{"mid": [{"value": 35683}], "uuid": [{"value": "3a0bea07-bc65-40f3-b21a-a9d68439064e"}], "vid": [{"value": 35683}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12222-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VII, No. 3<br />\n<br />\nNovember 20, 1902<br />\n<br />\nTHE<br />\n<br />\nNEWS LFTIFR<br />\ns<br />\nlet<br />\n<br />\n\"%bc.„3,220051W)<br />\n4tZZI4446..<br />\n<br />\nBEING<br />\n<br />\nTHE<br />\n<br />\nTHIRD NUMBER<br />\nOF<br />\n<br />\nVOLUME SEVEN<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns Hopkins Press.<br />\n<br />\nThe Johns Hopkins Universitu<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, 1902.<br />\n<br />\nof<br />\n<br />\nthe Medical titealtll:<br />\nPresident: 1RA IIRMSEN. Dean<br />\nVVILL/Ald H. How sl,L. Dean of the Cofleue loVreuity:<br />\nEnwiten H. GRIFFIN.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candi(lutes for the degres of Ph. D.)<br />\n(b) In Medicine. (courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERORADUATES:<br />\n(e) At candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000<br />\n200,000 volumes.<br />\nPratt Library,<br />\n<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\nTra Remmen.<br />\nJoseph S. Ames.<br />\nWilliam 11. Clark.<br />\nWilliam W. Brooks.<br />\nFro!actin P. Mall.<br />\nWill ion'.<br />\nHowell.<br />\nWilliam II. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\n<br />\nDirectors.<br />\n<br />\nSeminaries.<br />\n<br />\n11.<br />\n<br />\n110.<br />\n<br />\n101.<br />\n<br />\nii<br />\n<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\n<br />\nr.<br />\n.1. hi.<br />\nPro I. .11.1 f II.,<br />\n.lose<br />\n<br />\nUndergraduate Courses (leading to B. A.)<br />\normtvn.<br />\nI. classical<br />\nlir<br />\n<br />\nNla(heniat it.al Plosicei<br />\n(leading up to<br />\nI'<br />\n(leading uo to medicine).<br />\n(<br />\nItO in -Mathematical.<br />\n. Ii isiorical-Pol Bleat<br />\n(leading up to law).<br />\nModorn Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. X X V).<br />\nA merlean Chemical Jon met (vol. XX VI I I).<br />\nAmerican Journal of Philology (vol. XX III<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII ).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTterrestriel Magnetism (Vol. VII).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduete or collegiate<br />\nceurses, will be sent on applleat ion to the Registrar.<br />\n<br />\nVolume<br />\n<br />\namerican Cbeinical rfournal.<br />\nI. ItEMSEN. Editor. Monthly. 8vo.<br />\nXXV III in progress. $5 per volume.<br />\n<br />\nVolume.<br />\n<br />\n8vo.<br />\n%tutees from the Ithological laboratory.<br />\nVolume V complete. $5 per volume.<br />\n%tables in historical anti IPoUtical $cience.<br />\nMonthly. svo. Series XX in progress. $3 per<br />\nvolume.<br />\n<br />\n3obne hopkins 'University Circulars.<br />\n<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\nPill.3ohne lbopithte hospital Salletin. Monthly. 4to.<br />\nVolume XIII in progress. $1 per year.<br />\n19111. aohns Thophins hospital *Reports. 4to. Volume X<br />\nIn progress. $5 per volume.<br />\n1X.<br />\n<br />\nContributions to lissyriology anti Comparative<br />\n%mite: phtlolon. (ilettrage zur A ssyriologle, etc.)<br />\nVol. IV completo.<br />\n<br />\nX.<br />\n<br />\nMemoirs from tbe Ifiological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\nMobern Language 'Rotes.<br />\nA. M. ELLIOril, Editor. Monthly. 410. Volume<br />\nXVII in progress. $1.50 per volume.<br />\nX111. 3ournal of Experimental finebicine.<br />\nVV. II. WELCH, Editor. 111-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX1111. american journal of insanity.<br />\nII IN IV M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nX1111. 'Reports of Marylanb i3colo4iica I Survey.<br />\nWILLIAM B. CLARE, Editor.<br />\nXIX<br />\n<br />\nI,. tiilaerslerec.<br />\nSmith.<br />\nKirby<br />\n111aarice Illoonific id•<br />\n!laid 'Maid.<br />\nHenry LiYoml.<br />\n.<br />\n21farshall<br />\nHies tr. ituiyht.<br />\nViotr, /it.<br />\n<br />\nrick.<br />\nLa I ill.<br />\n<br />\nU<br />\n<br />\ntimerican ;foams! of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXXV in progress. $5 per volume.<br />\n<br />\n111111. limericati aournal of !philology.<br />\n13. L.(H LDERSLF,EV E, Editor. Quarterly. Miro,<br />\nVolume X XIII in progress. $3 per volume.<br />\n<br />\nP.<br />\n<br />\nInstruction.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nuleology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhisiology.<br />\nPO !fogy and Bacteriology.<br />\necology.<br />\nPh<br />\nPh lolog ice I Chemistry.<br />\nClinical Medicine.<br />\n<br />\n1.<br />\n<br />\nterrestrial Magnetism anti 'atmospheric Elec.<br />\ntricity I,. A. BAUER, Editor. Quarterly. five.<br />\nVolume V II in progress. $2.50 per volume.<br />\n<br />\nX11/1. annual 'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nX11311. annual Iftegister.<br />\nGiving the list()I officers and students,and stating<br />\nthe regulations, etc., of the University. Pub/Ls/ma at the dose of the academie year.<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text, of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. lid pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete lite-AMU° edi.1. liendel Harris. 110 pp. 4to. 10<br />\ntionp.latEeds1<br />\n$5.00.<br />\nReproduction in Phototype of Syriac MSS. with Antilegement,' Epistles. Edited by I. H. Hall. 13.004<br />\nBibliographia Hopkinelensis. Part I. Philology. Purrs<br />\nII 111. Chemistry, Mineralogy and Geology. Parts<br />\nI V- V-VI. Physics,Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nfi lull list ot publications will he sent on application.<br />\n<br />\nCommunications in respect to exchanees and remittances<br />\nmay he sent to Johns 'Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nNOVEMBER 20, 1902.<br />\n<br />\nNo. 3.<br />\n<br />\nA NEWSPAPER MAN'S WARNING.<br />\n<br />\ntV<br />\n<br />\nIIEN I was at the University a dozen years ago there was no student<br />\npaper. There had been efforts to establish one, in two of which I took<br />\npart, but the faculty was not then in the mood and we applied in vain for<br />\nPermission to go ahead. Even our much-loved class annual, the first of the Hullabaloos, had many trials and tribulations before we finally produced it upon the<br />\nstage of Un:versity life. This little foreword in a reminiscential vein is only<br />\npenned because it serves to measure my gratification at the success which has<br />\nattained the publication of THE NEWS- LETTVR. I have always held to the theory<br />\nthat a college paper, well-edited, may become a valuable aid in the development<br />\nOf that 'varsity spirit which seems essential to the growth and popularity of an<br />\ninstitution like the Johns Hopkins. This, I feel sure, has been proven by THE<br />\n<br />\nNEWS LETTER.<br />\nI have been asked to write something for this issue of THE NEws-LETTER.<br />\ncan think of nothing better than to contribute a leaf out of my own story as a<br />\nw.arning to some now in the University who have hopes and dreams of a certain<br />\nkind There is in every class a percentage—sometimes large, sometimes small—<br />\nwho desire to win a name as writers and who are more than likely to consider<br />\nthat newspaper work offers a means to that end. These are the men I want to<br />\nreach and to them I merely wish to say:<br />\n\"Don't do it.\"<br />\n.<br />\nA man who enters the newspaper field with the idea of stepping thereby<br />\ninto literature or into the writing of history or any other sort of book-making<br />\nthat requires sustained attention to score success, will ultimately wake up to a<br />\nrealization that his cherished volume has not been written, nor, for that mat'er,<br />\nhas. any other volume been turne,1 out that adequately satisfies the ambitions<br />\nof its producer. Journalism is sometimes a stepping-stone to literature, but<br />\nmore often it is a set-back. It gives a man a living, it trains him to write with<br />\nfacility, but it exacts much of him. The hours of work, especially on a morning<br />\nnewspaper, are long, and then there are frequent emergency demands beyond<br />\nthis limit. How, then, is a man likely to find time to delve into literature,<br />\nexcept in a most dilettante way? After an arduous mental and physical strain<br />\nof ten, twelve or fourteen hours, is he in condition to do work whose promise<br />\nand whose originality will gain the approval of the gentlemen who read manuscripts for the magazines and the publishing houses? He may write, having<br />\nacquired ease and speed, but he can never hope to concentrate his spare time for<br />\nmonths upon something other than his work for the paper. The result is that<br />\nhis note in literature is but the feeblest pipe, unnoticed beyond a circle of friends<br />\nand leading to no enduring reputation.<br />\nI<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nI know that some will say that there are literary posts in connection with a<br />\nlarge daily newspaper. There are, for example, writers of editorials and of<br />\ndramatic criticisms, reviewers of books and writers of special articles of a semiliterary or semi-editorial character. While this is true, it is also obvious that<br />\nthe newspaper publisher is not going to engage youths just out of college to fill<br />\nany of these posts. In fact, I may go farther and lay it down as a principle<br />\nborn of long experience that the best men for all these posts are those who have<br />\nbeen \"through the mill,\" who have had their notions tempered by actual rubbing up against all things and all men and who have gained thereby a certain<br />\ndelicacy of newspaper touch that enables them to take the pulse of the public<br />\nand to weigh right and wrong, importance and insignificance, with the rapidity<br />\nof judgment which a daily paper requires. I know one exceptionally able editor<br />\nand one brilliant literary critic, neither of whom were ever reporters The critic<br />\nwas secured by the paper solely by reason of his exceptional aptitude for his<br />\nparticular work, and can do nothing else for the newspaper, while the editor has<br />\nconfessed to me that he feels he would be more valuable if he posses:ed the<br />\ninsight which reporting and editing alone can give.<br />\nIt is evident, then, that the chance of entering newspaper life other than as<br />\na reporter is about one in a hundred. The ninety-nine, therefore, can attain<br />\nthe desirable posts only by the route from the bottom. I think all of them will<br />\nconsider journalism \"one demned grind\" after two months. A wary city editor<br />\nis afraid to trust the raw hand on other than routine items, and even with these<br />\nit is annoying to be reminded that the point has been overlooked or that initials<br />\nare necessary for all names. After that, however, comes the insidiously attractive part of a reporter's life. He is \"assigned\" to stories\" of importance; he<br />\nrubs'elbows with fatuous men of city and State, and interviews distinguished<br />\nvisitors; he feels that he is behind the scenes while dozens of dramas are being<br />\nacted simultaneously, and he learns that the stage-manager is always more<br />\nimportant than the actors, while the scene-shifter is very likely to be so. He<br />\nis, in a word, an active and not unimportant participant in the full tide of human<br />\nlife, and though his work is arduous and his hours long,there is sufficient variety<br />\nin his assignments, day by day, to keep him always interested in his work and<br />\neager to do better than his rivals.<br />\nA newspaper office is, however, not entirely made up of reporters. There<br />\nmust be a corps of editors to do nothing but edit; men to plan what reporters<br />\nand correspondents shall do; men to go over, read, correct and dress up the<br />\nvolume of matter pouring in; men to take that edited copy, classify it by relative<br />\nimportance and interest, and to select the best for publication and \"make up\"<br />\nthe pages. None of these men, in a first-grade newspaper office, ever write<br />\nanything but head-lines and corrections. Their hours are long, often unusually<br />\nso, their work confining, often uninteresting. Probably nearly all of them<br />\nstarted into journalism to pass on to literature. They escaped the maelstrom<br />\nof the attractiveness of reporting only to find themselves engulfed in the vortex<br />\nof \"copy-reading,\" Their \"great book\" is not likely to be written unless they<br />\ntear themselves from newspaper work. And that is difficult to men of thirty or<br />\nmore, men probably with families dependent on their salaries.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nThis question of remuneration also suggests an additional warning. After<br />\na college man who has gone into newspaper work has become broken in, his salary<br />\nwill average from $800 to $1500 as a reporter, comparing more than favorably<br />\nwith the incomes of his classmates who have gone into other professions. If he<br />\nbecomes an editor, or an editorial writer, he will get from $1200 to $2000, and<br />\nthis, too, may be still better than his classmates are doing. But that is his<br />\nmaximum, and in eight or ten years the classmates, those who are ambitious<br />\nand successful, begin to forge ahead; as a rule, to stay ahead. The editor with<br />\na comfortable salary will stay an editor of modest means all his life. He has<br />\nnot the capital to branch out in the line whose details he has mastered, for it<br />\ntakes a big sum to start a daily paper. He has to be content with the praises<br />\nof those who employ him and those who know him. His work is hidden in the<br />\nanonymity of each issue of his journal. His ambitions are for the paper. He<br />\nbelongs to an honorable profession and he is respected, therefore, in the corn.<br />\nmunity.<br />\nBut he never writes that world-illumining volume if he continues to work<br />\nconscientiously as a newspaper man.<br />\nCHARLES WEATHERS BUMP, '92.<br />\n<br />\nINTERCLASS FOOTBALL.<br />\n<br />\na1<br />\n<br />\n,0 one will doubt but that the interclass football games played by the classes<br />\nof '92, '93 and '94 were beyond all expectations a great success, and if<br />\nby recalling them to mind after several years have elapsed, I can a'rouse<br />\nany enthusiasm along this line of University athletics, I shall have been fully<br />\ncompensated for the time spent in writing these few lines.<br />\nFor several years prior to '92 there had been class football teams, and they<br />\ncontinued to form a part of University athletics until after the freshman year of<br />\nthe class of '94. At this time they were abolished and a University team put in the<br />\nfield. These class teams aroused a great amount of college spirit, and in my humble opinion the formation of a University football team was directly traceable to<br />\ntheir organization. Class spirit and pride reached their culmination<br />\nin the clases of '92, '93 ' and '94, and when I think of the splendid<br />\ngames played, I wonder how it came about that we could procure three such<br />\nteams out of so small a number of students I do not believe the teams that<br />\nformed the Interclass League for the winter of '91-'92 have ever been equalled<br />\nin any university, certainly never in the history of the Hopkins. Of course I<br />\nmay be a more or less interested party, but I am sure the above is the general<br />\nopinion of those who know something of the history of these classes.<br />\nNearly everyone is familiar with the history of the exciting games by which<br />\n'93 became the champions of the J. H.; '92 and '94 fought furiously for the<br />\nlaurels, but were doomed to disappointment. There were but three games<br />\nPlayed, so that each class had a fair chance, and it hurt the pride of '92 to meet<br />\ndefeat at the hands of the Junior class. '94 had not much to lose, for she was<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ntoo young in University life to appreciate the significance of such an event. In<br />\nhonor of winning this championship, each member of the team of the class of<br />\n'93 was given as a trophy a golden football with his name and class engraved<br />\nupon it. These little charms are highly prized by the men holding them and<br />\nare afterward pointed to with much pride.<br />\nI have thus briefly given a mere outline of what has been done in class<br />\nathletics at the University. Why cannot this spirit again be revived? I<br />\ntrust that the day will come when each class, as it enters the University, will<br />\norganize for athletics with the same feeling with which it organizes for protection against hazing, and that we will be able to witness the enthusiasm of a<br />\ndecade ago.<br />\n<br />\nH. N. A13F,RCRO1BIF.,<br />\nCaptain of '93 Football Team.<br />\n<br />\nALUMNI.<br />\nThe Rev C. H. H. Branch has recently been called to the Maxwell<br />\nStreet Presbyterian Church, Lexington, Ky.<br />\n'03<br />\nWethered Lilly is engaged in business in Dmver, Col., and reports his<br />\nhealth much improved.<br />\nThe engagement is announced of Mr Wilson L. Smith to Miss W.<br />\n'00<br />\nVirginia Wren, of Norfolk, Va. Mr. Smith will next spring complete his<br />\ncourse in architecture at Columbia University.<br />\n<br />\n'95<br />\n<br />\nDr. George Lefevre, president of the Johns Hopkins Club of the Middle<br />\nWest, who is now professor of Zoology at the University of Missouri, Columbia,<br />\nMo., announces that the third annual meeting and dinner of the Club will take<br />\nplace at the Hotel Baltimore, Kansas City, on the 20th. The railroads will<br />\ngive reduced rates for the Missouri-Kansas football game on that day, and it is<br />\nhoped to have a large attendance at the banquet. The Club now numbers more<br />\n<br />\n'91<br />\n<br />\nthan sixty members.<br />\nDr. James F. Mitchell has resigned as Resident Surgeon at the Hospital,<br />\nand has started practice in Washington. ' His address is 1311 Connecticut<br />\nAvenue.<br />\nThe Rt. Rev. Junius Moore Horner, P. E. Missionary Bishop of Ashe95<br />\nville, preached at Emmanuel Church on the 9th, on the subject of the mountain<br />\npeople of his diocese.<br />\nThe Rev. Francis Le Jau Frost, Ph. D. of the University in 1901, is now<br />\nrector of St. Mary's Church, Castleton, West New Brighton, S. I.<br />\nMr. Thomas Dixon, Jr., author of \"The Leopard's Spots,\" who lectured<br />\nin this city on the 11th, was a graduate student at the University 1883.4. Mr.<br />\nDixon is now working on a novel which deals with the divorce question.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nFOR THE UNDERGRADUATE.<br />\n<br />\nC<br />\n<br />\nHE Junidr-Freshman football game and cane-rush will again take up a<br />\nlarge share of the interest in fall athletics. The contests are scheduled<br />\nfor December 6 at American League Park. As usual, half a dozen tickets<br />\nwill be issued to each member of the two classes. Others wishing to secure<br />\ninvitations should apply to G. A. Foster, '04, manager of the Junior team, or<br />\nClarence Stone, '05, captain of the Freshman team.<br />\n<br />\nThe opening Musical Club concert took place on the afternoon of yesterday,<br />\nNovember 19, at the Hospital, the management following the usual wise plan<br />\nof selecting for the first audience those who are too weak to help themselves or<br />\nto protest. The choice of the Hospital is, in addition, fortunate in that many<br />\nof the old grads and former players on the clubs, who are now at the Medical<br />\nSchool, drop in and generously bestow their criticism upon the players. It<br />\nmust be said, however, that the general result of the afternoon's work was<br />\ngood, and that the leaders have cause to hope—which is about all that can be<br />\nexpected of a first attempt. The program was as follows:<br />\nGlee Club, University Ode, Devries, '89; Banjo Club, March Song from<br />\n\"The Show Girl;\" Mandolin Club, \"Imperial Edward March.\" Sousa; Glee<br />\nClub, 1902 medley, W. B Carver; Banjo Club, \"Our Director\" (Yale song);<br />\nMandolin Club, March from \"Prince of Pilsen;\" Glee Club, \"Wandering<br />\nSingers' Patrol;\" Banjo Club,' The Ragged Raglan,\" Edgeworth Smith '98; Solo,<br />\nP. K. Gilman, Med.; Glee Club,'Rah for Black and Blue,\" J. G. Peters, '97.<br />\nOn Monday night the members of the Senior Club assembled at that haunt<br />\nOf harmony for the second feast of the season, at which they were the guests of<br />\nthe newly elected class president, Harry King Tootle. After reading the<br />\nstringent House Rules, posted by the vigilant committee, the Seniors indulged<br />\nin a little decorous \"rough•house,\" during which a prominent member of the<br />\nlacrosse team was repeatedly called to order for his violation of Rule 5*. With<br />\nappetites .sharpened by these innocent diversions, the crowd next attacked a<br />\nbountiful \"spread,\" and then retired to the rear to drink the health of the host<br />\nof the evening. A short business meeting of the Club followed.<br />\n\"Resolved, That import duties on necessities of life should be materially<br />\nreduced,\" will be the subjett of the next debate by the Senate and the House.<br />\nIn the Senate, the negative will be taken by Lanier, Hunley and Sandrock,<br />\nand the affirmative by Smith, Hoffman and Warner; while in the House, Foster<br />\nErlanger and Evans will uphold the affirmative side and HumriChouse, Geiger<br />\nand Etnig the negative.<br />\nThe University of North Carolina has submitted the following question as<br />\nthe possible subject of their debate with tile Hopkins: \"Resolved, That the<br />\nPatriot should be independent of party authority in voting.\" We have the<br />\nchoice of defending either the negative or affirmative; but Dr. Lee feels that the<br />\nsubject is perhaps not the best one for the case, and another one may be chosen.<br />\n*This Rule prohibits violent and unparliatnentary language.<br />\n<br />\n\fTHE NEWS-L4TTER<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\nNOVEMBER 20, 1902.<br />\nSubscription $1 .50 per year.<br />\n.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editcas,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n.<br />\n<br />\nROBERT S. LA.NIER, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904<br />\nREGINALD S. OPIE, 1904.<br />\nW. S. BIRD 1903.<br />\nHARRY BAETJER, 1003.<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ H U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n,...••••••••••<br />\n<br />\nHE leading article of this issue is from the pen of an alumnus who, ever<br />\nsince his career as editor-in chief of the first HULLABALOO, has always<br />\nbeen strongly interested in Hopkins literary and journalistic affairs.<br />\nPerhaps even the convincing facts that he marshals so effectively will not hold<br />\nthe members of the Press Club back from their awful fate; but in the case of<br />\nunderclassmen with reportorial ambitions, there may still be hope. We congratulate the readers of THE NEWS-LETTER on having such an able intro<br />\nduction to this timely subject.<br />\n<br />\nt<br />\n<br />\nHE support given the football team by the college men and some faithful<br />\ngrads. was very gratifying at the Westminster game. The number and<br />\nspirit of the rooters was good, and there is no doubt that their vigorous<br />\nand well-trained songs and war-cries helped the team to render so good an account of themselves. Moreover, from present indications it seems that a large<br />\nproportion of the college will be at the American League Park on Saturday,<br />\nto get in good training for the great fight on Thanksgiving day.<br />\nHowever, there are many men in the college who can help the team in a<br />\nmore direct way than by yelling at it, and who are not taking advantage of<br />\ntheir opportunity. These are the men who should be composing the scrub<br />\nteam. It has rarely happened this season that, in their afternoon practice, the<br />\n'Varsity players have had a second team to line up against, on which to try<br />\n<br />\nZ<br />\n<br />\n\fTHE N EWS- LETT8R.<br />\ntheir plays. This is but a poor state of affairs. There are plenty of men who<br />\ncould make their class teams, and who have some knowledge of football, who<br />\nare failing in their duty to the college, merely because they see no direct reward<br />\nfor the exertion of coming out every afternoon and being rolled around by the<br />\n'Varsity players. It should need no second thought to show that there is as<br />\nlittle truth in such reasoning as there is honor in such a position. Although<br />\nthe 'Varsity team is now made up, supposedly, of the best players that can<br />\nPossibly be secured from the college and Medical School, still it is the interest<br />\nand pride of every student to do all in his power to make them steadily better.<br />\nAnd if it is in his power to give such active help as practising with the regular<br />\nteam, and if he does this faithfully, he will certainly deserve and obtain a<br />\nrespect and popularity among his fellow-students which cannot be measured<br />\nby formal athletic honors. Every man who is able ought to get out his football clothes every afternoon during the week that remains before Thanksgiving,<br />\nand show some practical evidence of his gratitude to his Alma Mater.<br />\n<br />\n4 40N to Homewood!\" is still the cry. And it is being taken up by new<br />\nvoices. The decision as to the dividing line between the University<br />\ngrounds and the new city park settles an important question. Mr. Brent<br />\nKeyser, in supplying funds for the survey, is enabling us to get an idea as to how<br />\nour future temples of learning are to be placed. The latest agitation on the movement, however, is one which peculiarly interests the undergraduates, since it<br />\nmust be carried out by them alone,— namely, the plan of a college dormitory,<br />\nto be built by Hopkins undergraduates by means of the dime savings-bank<br />\nsystem. It is astonishing how soon the dimes received in small change will<br />\ngrow into the $5.00 which fills the bank; little burden would be experienced in<br />\nsubscribing, say, $10.00 a year, even by those of least means. It is easy to cal<br />\nciliate that 150 students, each giving $10.00 per year, would in the course of six<br />\nyears accumulate the sum of $9,000, which with compound interest, would<br />\napproach $10,000. And this sum would be sufficient to erect a college dormitory at Homewood which would be a splendid memorial to the college<br />\nstudents of the J. H. U. from '02 to '08. As to the supervision of the matter,<br />\nthe four class treasurers could form a perpetual committee to collect the money<br />\nand take charge of the deposit. To start this movement would be an achievement of which the present college could always feel proud, and with good<br />\nreason.<br />\n<br />\nT has been thought advisable that the vacancy of assistant athletic editor on<br />\n<br />\n3<br />\n<br />\nTHu NHWS-LF,TTRR board should be filled, if possible, by a member of the<br />\nclass of '04. All candidates should hand in accounts of the M. A. C. and<br />\nUniversity of Maryland games, as soon as these occur, to Box 374.<br />\n<br />\n\fHE N EWS—LETTER<br />\n<br />\n' MI<br />\n<br />\nIll<br />\n<br />\nI 11111 111,,.<br />\n...,'<br />\n<br />\nJ<br />\n7,ii<br />\n<br />\n.. •. ..<br />\nN I VER S I<br />\n<br />\n.i :ITL:17)i 1 Mil 1 jI<br />\n<br />\n,<br />\nI 1 PIIIIIIMMUMMiliii<br />\n<br />\n,.<br />\n<br />\n,........,.............,,,<br />\n1111011g111,.,<br />\n4,,, .,.,.<br />\n<br />\niiiiiiiiiihiiiiiiiiiiiiiiiii<br />\n'<br />\n' It .'<br />\n<br />\nI<br />\n<br />\n.<br />\n<br />\nilillgiffitiMill<br />\n'IM4<br />\n<br />\nR. TOYOKICHI IYENTAGA, who lectured in the city last week. spent<br />\nsome time about the University renewing old acquaintances.<br />\nDr. Lyman Tyler, son of former President Tyler, will deliver the course of<br />\nlectures to be given at the University next February under the auspices of the<br />\nMaryland Society of Colonial Dames of America,<br />\nDr. A. Marshall Elliott is on the committee on membership of the recently<br />\norganized \"North Carolina Society.\"<br />\nThe lectures on American history by Professor Andrew C. McLaughlin, of<br />\nUniversity<br />\nof Michigan, have been postponed to November 24th and 25th.<br />\nthe<br />\nDr. McLaughlin will speak on \"The Principles and Politics of the American<br />\nRevolution.\"<br />\nDr. Paul Haupt, director of the Oriental Seminary, and Dr. T. C. Foote,<br />\nRayner Fellow in the Oriental Seminary, are organizing a class in Elementary<br />\nHebrew for ministers, theological students, and others interested in the sacred<br />\nIan guage.<br />\nPresident Remsen delivered an address on \"Original Research\" before the<br />\nAssociation of Collegiate Alum= in Washington on last Friday.<br />\nAt the annual meeting of the Charity Organization Society last week, President Remsen was elected president, and Dr. Gilman, vice-president. Dr. Remsen, Dr. Hurd and Dr. Hollander were elected members of the board of man•<br />\nagers. The annual public meeting of the society will be held at McCoy Hall,<br />\nMonday, December 1st. Addresses will be delivered by Rev. Dean Hodges, of<br />\nthe Cambridge Divinity School, on \"Alms and the Man,\" and by Mr. Edwin T.<br />\nDevine, General Secretary of the New York Charity Organization Society, on<br />\n\"Reasons for and the Possibilities of the Federation.\"<br />\nThe sixteenth annual convention of Colleges and Preparatory Schools of<br />\nthe Middle States and Maryland will be held at McCoy Hall on November 28th<br />\nand 29th. President Remsen will deliver the address of welcome to the delegates. The last time the association met in Baltimore was in 1894.<br />\nMr. John C. Thomas has been elected by the Hospital Trustees to the post<br />\nof Treasurer of the Johns Hopkins Hospital. Mr. Thomas fills the place of<br />\nMr. Joseph C. Merrifield, who died last July.<br />\n<br />\n\f'rHg NEWS—LETTER.<br />\n<br />\n9<br />\n<br />\nThe Geographical Society of Baltimore has received a great many recruits<br />\nfrom the student body on account of the connection of President-Emeritus<br />\nGilman and others with the society. The members on Monday last numbered<br />\n1,131. The lectures will not be held in McCoy Hall, as originally announce<br />\nd,<br />\nbut will take place at the Peabody Institute.<br />\nProf. G. W. Ritchey, of the Yerkes Observatory and the University of Chicago, has accepted an invitation to lecture before a special meeting of the Scien<br />\ntific Association on the evening of Tuesday, the 25th. Subject: \"Recent<br />\nResults in Astronomical Photography with the large instruments of the Yerkes<br />\nObservatory.\" Prof. Ritchey will show stereopticon pictures of some of these<br />\nwonderful photographs, and will explain the construction and operation of the<br />\ninstruments used in taking them.<br />\nThe fall meeting of the National Academy of Sciences was of especial in<br />\nterest to Hopkins men, not only because it was held in a University building,<br />\nbut also because several papers, among them perhaps the most important of<br />\nthe<br />\nsession, were read by workers at the University. These were Dr. Morse and<br />\nDr. R. W. Wood, who received great applause for their lectures and<br />\ndemonstrations. Dr. Wood explained the nature of a substance long sought for by scientists, which he had successfully investigated, designated by him as nitroso dimethylaniline. Its use will be in the field of astronomical photography, arising<br />\nfrom its extraordinary property of opaqueness to all visible rays of light,<br />\nand<br />\ntransparence to invisible rays.<br />\nY. M. C. A. NOTES.<br />\n<br />\nC<br />\n<br />\nHE services of the Week of Prayer for young men were fairly well attended, and the spirit of the attendance was very good. President Remsen and Dean Griffin were both present at the Sunday meeting.<br />\nAll men with nine o'clock classes have been urged to come a few minutes<br />\nearly for morning prayer service. The singing at this service is good, but<br />\nmore vOices would improve it. Dr. T. C. Foote leads this week and Mr. A. H.<br />\nClarke will be the leader next week.<br />\nThere is an interesting article in the November number of \"Association<br />\nMen.\" It gives a list and personal account, with some photographs, of leading college athletes who are leaders of the Christian Associations of their colleges Some of these men were met by the Hopkins delegates at Northfield<br />\nlast summer. Carter, of the Harvard Lacrosse team, was secretary of the Y.<br />\nM. C. A. for two years and is now student secretary for northern India.<br />\nFrance, captain of the Harvard baseball team and leader in Bible class work,<br />\nwas one of the most active men at Northfield for positive Christian work.<br />\nGardner, captain of the Princeton football team and member of the '03 crew, is<br />\npresident of the Association. Joe McCracken is general secretary at Columbia.<br />\nChadwick, captain of Yale's great eleven, is a leader in Christian work at Yale,<br />\nand had charge of the athletic events at Northfield. A copy of the article here<br />\noutlined is on the Y. M. C. A. bulletin board, or may be found on the reading<br />\nroom table in Levering Hall.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nto<br />\n<br />\nFOOTBALL SCHEDULE.<br />\nNov. 22—Maryland Agricultural College, at American League Park.<br />\n27—(Thanksgiving) University of Maryland, at American League<br />\nPark.<br />\n<br />\nHOPKINS, 6; WESTERN MARYLAND, 6.<br />\nLL things considered, we have cause to be proud of ourselves for the<br />\nshowing made in our first game of the season at Westminster.<br />\nUpon reaching there, it was decided that the game should be played<br />\nin two 20-minute halves. Hopkins won the toss, and decided to defend the<br />\nwest goal.<br />\nRoberts kicked off for Western Maryland. Strohbar received the ball and<br />\nadvanced it 10 yards. Miller made a run around right end for 15 yards, but at<br />\nthis point Western Maryland braced up and secured the ball on downs.<br />\nThe college boys played hard, but a fumble gave Yearley the opportunity<br />\nthe ball for Hopkins. A series of fine runs by Blanck, Houghton and<br />\nsecure<br />\nto<br />\nMiller carried the ball to Western Maryland's 20-yard line. Hopkins then lost<br />\nit on downs, but Maryland was forced to kick after being held for two downs.<br />\nStrohbar caught the ball, and by a beautiful run around right end advanced<br />\nthe ball to the 15-yard line. Blanck was pushed through several times, and<br />\nfinally, after a hard plunge, scored the first touchdown. He also kicked goal,<br />\nand after 18 minutes of play the score stood 6 to 0 in favor of Hopkins. The<br />\nremaining two minutes of the first half were spent in struggles which left the<br />\nball in the center of the field.<br />\nHopkins kicked off in the second half, and the ball was downed on the 10yard line. Western Maryland kept the ball most of the time, and fifteen seconds before the end of the game Roberts was pushed over for a touchdown near<br />\nthe side lines. After a long and serious argument, Spalding's \"Manual\" prevailed, and the ball was punted out, successfully heeled, and Roberts kicked<br />\ngoal, making the score 6 to 6.<br />\nTen seconds remained, and on the first down after the kick-off, time was<br />\ncalled and the contest was over.<br />\n<br />\n4<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nThe game was snappy and full of spirit from start to finish. The end runs<br />\nand rushes made by Blanck, Miller and Stone were fine. In fact, these three<br />\nbacks did nearly all the work of advancing the ball. Strohbar at quarterback<br />\ncontributed largely to Hopkins' success. Thanks to his accuracy, Hopkins did<br />\nnot make a fumble throughout the entire game. On Western Maryland's side,<br />\nRoberts, Hurley and Tarr played an excellent game, especially the first named.<br />\nWe have good reasons to be proud of the 'Varsity eleven. It is no small<br />\nmatter for players of comparatively green material to \"split even\" with a team<br />\noutweighing them by 16 pounds per man and playing on its own grounds.<br />\nThe rooters which went up with the team on a special car contributed<br />\nlargely to our success, for whenever they could take their eyes off the fair<br />\nco eds on the grand-stand they certainly did make a vast volume of encouraging noise.<br />\nChief Rooter Plaggemeyer is to be congratulated upon his success in getting the rooting so well organized in such a short time, and every man in the<br />\nUniversity should be on hand at the game with the Maryland Agricultural<br />\nCollege on Saturday next to cheer the Black and Blue on to victory.<br />\nThe line up was as follows:<br />\nJ. H. U.<br />\nW. MD.<br />\nHoughton<br />\nRight end<br />\nWilson<br />\nGreen<br />\nRight tackle<br />\nBrown<br />\n'Yearley<br />\nRight guard<br />\nWhite<br />\nMarshall<br />\nCenter<br />\nCooling<br />\nHutchins<br />\nLeft guard<br />\nClough<br />\nRosenfeld .....<br />\nLeft tackle<br />\nRoberts (Capt.)<br />\nCaulk<br />\nLeft end<br />\nSimpson<br />\nStrohbar<br />\nQuarterback<br />\nTreadway<br />\nMcCloskey<br />\nBlanck (Capt.)<br />\n*Right halfback<br />\n,.<br />\nHurley<br />\nMiller<br />\nLeft halfback<br />\nTarr<br />\n*Bla-nck and Stone exchanged positions while Hopkins was on the defensive.<br />\nScore-6 to 6. Time—Two 20-minute halves. Umpire—Goodrich, Maryland Athletic Club. Referee—Mr. Ernest Rich, Trinity College. Timers—<br />\nHoffman, J. H. U , and. Davis, W. Md. Linesmen—Stone, J H. U , and<br />\nGreen, W. Md.<br />\n<br />\nTRACK TEAM<br />\n<br />\nt<br />\n<br />\nHE prospect before the management of the Track team is very encouraging.<br />\nJudging by the number of candidates who have turned out at Captain R.<br />\nC. Hoffman's call—some of them experienced track men—there should<br />\nbe no difficulty in selecting a fast team to represent Hopkins at the several indoor meets this winter, and at the outdoor games next spring. Captain Hoffman expects, indeed, to develop as fast a team this year as ever turned out.<br />\n•<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nLight practice, for some time, will prevail. The candidates appear on<br />\nthe track three afternoons a week, and the two remaining afternoons are devoted to light gymnasium work for the systematic strengthening of the body.<br />\nA large proportion of the Freshman class have turned out, and under the<br />\ndirection of Mr. Mackdertnott and Captain Hoffman, the men are gradually<br />\nlosing their awkwardness. They will be instructed in the finer points when<br />\nthey have developed some \"form.\"<br />\nHard work will begin about the first of December. The men will devote<br />\ntheir time to the weights and pulleys in the track room, and will work on the<br />\ntrack, in preparation for the interclass games to be held in the cage about the<br />\nend of January. Definite arrangements for this meet have not yet been made.<br />\nTwo men will be elected by each class to confer with the track and field man<br />\nagement—Captain Hcfftnan, Manager Murkland, and Trainer Mackdermott—<br />\nconcerning the final arrangements to be worked out. There will be the usual track<br />\nand field events and an interclass relay race. A cup will be given to the victorious class in this event, and suitable prizes will be given to the winners of the<br />\nother events. There is also some talk of a relay race between the Freshmen<br />\nand Juniors if the two classes desire it.<br />\nThere will be several excellent men from the Medical School seen on the<br />\ncinder path this winter. \"Joe\" England and \"Bill\" Hoffman will be the<br />\nstandbys from the graduate department.<br />\nAmong those who will appear from the Senior Class are R. C. Hoffman,<br />\nTootle, Pessagno, Nelson, Blank, Yearley, and Smith. From the Junior Class:<br />\nLeCron, Porter, Emig, Kohn, Heald, Rosenheim and Branham. Among the<br />\nFreshmen now at work are: Dill, Boyd, Ullman, Pagon, Chistn, Hudgins,<br />\nMorse, Chambers, Goodenow, Bass, Zeigler, Mergenthaler, Super, Hull, and<br />\nR. C. Jackson.<br />\n<br />\nCLASS AND INTERCOLLEGIATE DEBATES.<br />\n<br />\nHILE, the interclass debates will not take place until some time in the<br />\nspring, the candidates for the Junior and Senior teams are already beginning to prepare for the event. Enough men from both classes have<br />\npresented themselves as candidates to secure representative teams.<br />\nIn order to stimulate interest in the class debates, and especially in the intercollegiate debates, a meeting of students was held November 12th to reorganize the Hopkins Debating Club. Sol Blum, '03, who was vice-president of<br />\nthe society last year, presided, and explained the objects of the club. Two intercollegiate debates will be held this year, one with the University of North<br />\nCarolina, and the other witb Brown or Columbia. The election of officers for<br />\nthe ensuing year resulted as follows: President, Sol Blum, '03; Vice-President,<br />\nGeo. A. Foster, '04; Secretary, L. W. Wallis,'04.<br />\n<br />\nTO<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n13<br />\n<br />\nFABLES FOR THE FOOLISH.<br />\nIn Words of a Few Syllables.<br />\nII.<br />\n<br />\nZ<br />\n<br />\nTHE FABLE OP THE PHILANTHROPIST AND THE HO!) HANDLER.<br />\n<br />\nHERE was once a well-meaning philanthropist who took a bath every<br />\nmorning and employed a clerk to figure out his income. One hot summer<br />\n. day he sat in the shade of a venerable oak watching a house which was<br />\nbeing built across the street from his home. He was waiting for his coachman<br />\nto bring around his high-steppers, for that afternoon he intended to arouse some<br />\ndust and some envy on the speedway.<br />\nAs he watched the sons of Ham carry the brick up the ladder he fell into a<br />\nPonder, and from the ponder he fell into a soliloquy. \"How much happier,\"<br />\nquoth he, \"are these men than I. How much they are to be envied. Behold!<br />\nthey have the digestion of an ostrich and the sleep of a little child.\" Here he<br />\nheaved a sigh such as we are accustomed to hear on the stage. Growing bolder,<br />\nhe advanced to one of the blackamoors who happened to be enjoying a short<br />\nrest in the shade, and addressed him thus:<br />\n\"0 bow much better your lot is than mine! You know the joy of walking,<br />\nwhile I—I have to go whithersoever my coachman listeth. You eat whatever<br />\nyour good wife puts into your till bucket, while I—I find the things prepared<br />\nby my French chef pall upon me. In the evening you go home and lie down to<br />\npeaceful slumbers. while I—I lie awake pondering what Pierpont Morgan is<br />\ngoing to do next.\"<br />\nHere did he heave another sigh The human edition of a work steer looked<br />\nat him in surprise. But the philanthropist continued his Sunday school con,<br />\nmuch after this fashion :<br />\n\"See how gcod it is to labor. Verily I say unto you, if I or some of my<br />\nfellows could carry your hod for you and enjoy your peace, willingly would our<br />\ndollars be rained upon you in recompense.\"<br />\nThe man who worked eight hours a day for one twenty-five could stand it<br />\nno longer.<br />\n\"Look a heall, man, don' you know I'se willin' to trade? I knows de joy<br />\noh walkin' does I? Huh! You carry a forty-pound hod up a ladder an' tell me<br />\nWhere de joy comes in. I eats what my ole woman gives me, does I? I recken<br />\nhit ain't too much. Jes gimme a shot at dat French chief, an' I'll show him.<br />\nDon' talk ter me erbout Pierpoiit Morgen! He can have all de res' ob de won',<br />\nef I wuz in your place. I sleeps lak a chile, does I? Don' you know, man, I'se<br />\nSO tired at night I can't eat tell mos' ten o'clock, an' in de mawnin' I'se so stiff<br />\nI can hardly walk. And yet you sez I've a good thing.\"<br />\nBut the philanthropist stcod up for his pet theory. For the last time he<br />\nsighed.<br />\n\"How happy one of my station would be if he could trade his dollars for<br />\nyour contentment. Only,\" he added sadly, \"he would not have the strength<br />\nto hold up the hod.\"<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n\"Don' let dat worry you,\" said the dusky son of toil. \"Ef any ob dem<br />\nbillionaires wants ter trade der dollars fer my hod, jes let 'em come eroun'. Ef<br />\nhits too heavy, I'll hold it up fer him.\"<br />\nMORAL. This fable teaches freshmen that contentment is an illusive<br />\nthing.<br />\n<br />\nWALTER'S WISDOM.<br />\n443'I' was as good as a vic'try, sah,\" said Walter, as I climbed into the<br />\nthrone-seat in his chamber of horrors. I let him explain.<br />\n'`Ef we'd been a-playin' on a billiard table insted of on .the side of a<br />\nmountain, sah, thar'd been nothin' doin'. You see, it was this way.'' Here<br />\nWalter made a dramatic sweep with his razor which threatened to decapitate me.<br />\n\"It's jest like this, sah. Here's the side of the hill, here's them fellers, here's<br />\nthe ball, and here we is. What next?\" Walter backed off and looked at me<br />\nquestioningly while he made an impressive oratorical pause. \"What next?<br />\nWhat made'm tie that score? Gravity, sah, gravity. You know that things are<br />\nboun' to roll down hill. That ball jest had to come down. Them fellers didn't<br />\ntie the score; it was gravity, sah, gravity.\"<br />\nThere was an impressive silence, broken only by the rasping sound which<br />\ntold the loafers in the barber shop that Walter was giving me a close shave for<br />\nSunday. I didn't need to be told.<br />\n\"I've been paintin', sah,\" Walter remarked at last when he saw that I was<br />\nblissfully oblivious to my surroundings. I opened one eye and looked at him.<br />\nAfter examining him closely I calmly closed my eye and ventured to state that<br />\nI saw no traces of it, that he still preserved that healthy brown color which I so<br />\nadmired. \"If that is nature, Walter,\" I said, \"it is good, but if it is art, it is<br />\nmuch better.\"<br />\nIf ever Walter came near cutting my throat that was the time. When he<br />\nhad gained control of his feelings he remonstrated. \"Law! sah, I ain't been<br />\npaintin' myself, but the shop, sah. Can't you smell it?\"<br />\n\"I have detected a peculiar odor, Walter,\" I replied, \"but I thought that<br />\nit was only your famous elixir for denuded roofs, otherwise known as hair-oil.\"<br />\n\"What, sah, what! Ef you would use some of my hair restorer, it would<br />\ndo you good.\"<br />\n\"Then why don't you use it, Walter?\"<br />\n\"It's no use, sah,\" he answered, sadly shaking his head, \"it's no use<br />\nHair restorer can't help my bald head My wife done took all my hair out<br />\nbefore I invented my hair-oil \"<br />\nWalter seemed to stand in need of consolation, but just then the bell rang<br />\nand I fled.<br />\n<br />\nTHE NURSE—They're twins, sir.<br />\nYOUNG HUSBAND—And I told her we must begin in a small way.—Life.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nSONGS FOR THE BLEACHERS.<br />\n(AIR : The (good ON Summer Time.)<br />\nIn the good old football time,<br />\nIn the good old football time,<br />\nBowling 'way around the ends,<br />\nSmashing through the line;<br />\nWe hold the ball, they can't hold at all,<br />\nAnd that's a very good sign<br />\nThat there's a gain for Hopkins<br />\nIn the good old football time.<br />\nMr. Dooley.)<br />\nOh, Uncle Daniel<br />\nAnd Uncle Ira,<br />\nThe greatest Prexs. the Hopkins ever knew;<br />\nSo diplomatic,<br />\nAnd so emphatic,<br />\nIs Uncle Dan and Uncle Ira too.<br />\n<br />\n(.1IR :<br />\n<br />\nOh, Mr. Garwood!<br />\nOh, Mr. Garwood!<br />\nThe finest coach the Hopkins ever knew,<br />\nHe keeps'em moving,<br />\nAlways improving,<br />\nDoes Mr. Garwood of the J. H. U.!<br />\n(AIR : There are Eyes of Blue.)<br />\nSome teams wear Blue;<br />\nThere is Crimson, too;<br />\nThere is Brown, and Purple, Gold and Green, and every hue;<br />\nBut as I surmise<br />\nThat you are wise,<br />\nYou cheer the Black and Blue so dear to Hopkins eyes.<br />\n(AIR:<br />\nse pine back to Dixie.)<br />\nA song for J H. U., boys!<br />\nWe're Hopkins through and through, boys!<br />\nJust watch them break the Farmers' line and box the end-men tool<br />\nRing out your loud Hosannas,<br />\nAnd wave the grand old banners,<br />\nAnd sing a song for Hopkins—the Black and Blue!<br />\n<br />\nTHE JEALOUS YOUTH.<br />\nThere was a young man in the cage<br />\nWho worked up an envious rage<br />\nWhen he saw Father Mack<br />\nSprint thrice round the track,<br />\nAlthough at a much advanced age.<br />\n<br />\n15<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nLours—Do you want to see something swell?<br />\nADOLPH —Sure.<br />\nLours—Just put a sponge in the bath tub.—Yale Record.<br />\nShe met him in the darkened hall;<br />\nSaid he, \"I've brought some roses.\"<br />\nHer answer seemed irrelevant;<br />\nIt was,\"How cold your nose is.\"—Varsity Fortnightly.<br />\nAfter the ball is over,<br />\nAfter the field is clear,<br />\nWhat have you done with my eyebrow?<br />\nAnd where is the rest of my ear?—Butler Collegian.<br />\nJACK—It must be awfully hard for Harry to quit boDzin' while on the football team.<br />\nJIM—Well, he can play full, anyway.—Prince/on Tiger.<br />\na<br />\n<br />\nThe Harvard Lamftoon is far from Dr. Griffin's course, but—<br />\n\"We now come to Thales, the Milesian, who imagined the world to be of<br />\nwater. He was undeceived by the Milesian authorities, who made him swim<br />\nover a steep hill and drink a glass of pebbles. His successor, Annexchimneys,<br />\nsaid that air was the only substance, whereupon he received a bill for clothing<br />\nwhich, his tailor declared, had been made to order from high-grade, hand-woven<br />\nair, warranted fast colors. Annexchimneys paid the bill, and thereafter kept<br />\nhis theories to himself.\"<br />\n\"Bughousides, of the Rheumatic school, maintained that empty space and<br />\nnon-being cannot exist. His rival, Embezzlecheese, proved the existence of<br />\nempty space by pushing Bughousides out of a third-story window. Meeting<br />\nhim soon after, Embezzlecheese inquired if he were well. 'I am not,' said the<br />\ngreat Rheumatic stiffly. 'You must be,' retorted Embezzlecheese,'non-being is<br />\nimpossible.' And he dodged the brick which the enraged Bughousides sent<br />\nafter him \"<br />\n<br />\n\fTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT et CO.,<br />\n704 MADISON AVE.<br />\nNNT ts<br />\n<br />\nC. & P.'Phone 3053-Y.411<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineer's Supplies._<br />\nN. W.Corner<br />\nLexington and Liberty Sts. BALTIMORE. MO.<br />\nAwls\" .for Kettp.1 (V. Esser Co., of New York .<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBARGER,<br />\n308 N. Charles Street.<br />\n<br />\n„,<br />\n<br />\nHenderson's<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nstudent's Supplies.<br />\n<br />\nFOR<br />\n<br />\nMadison 0Howard Sts.<br />\n<br />\nADVERTISING SPAr.E IN THIS PAPER<br />\n.PPLY TO<br />\n<br />\ne°<br />\n111„<br />\n<br />\nC?CienZe<br />\n:<br />\ne<br />\n•TS.,<br />\nLIGHT•LOM OAR<br />\n<br />\nPUBLISI-I -S.<br />\n<br />\n,<br />\n5: :1-ne-etre<br />\n<br />\nM. MEADE, OF<br />\n<br />\n1.0NDON,<br />\n<br />\nEXPERT CLEANER AND DYER,<br />\n126 N. Li ,TAW ST.,(2nd and 3rd doors).<br />\nThe most complete and modern department for<br />\nCleaning, dyeing and altering Gent's and Ladies'<br />\nIrarments.<br />\nIt's time your Winter Clothing<br />\n<br />\nwas put In order.<br />\n<br />\nDoes<br />\n<br />\nit need to be cleaned, dyed, altered or rePaire(l? Are now linings and velvet collars necessary?<br />\nNever mind what's the matter, we will fix it up to..<br />\nlook like new, and you won't have to pay very much<br />\neither. The Price List speaks for itself.<br />\n<br />\nGENTLEMEN'S Cu)THING PRESSED BY<br />\nCONTRACT. $1.50 PER MONTH.<br />\nPRICES FOR DRY CLEANING AN D DYEI NO .<br />\nGentlemen's Stilts cleaned and pressed<br />\n$1.00<br />\nTrousers,<br />\n.25<br />\nCoats,<br />\n.50<br />\nVests,<br />\n.25<br />\nOvercoats, 1.00<br />\nBoys' Suits, according to size, .50, .75 and 1 (10<br />\nVelvet collars on overcoats, .75<br />\nRELINING.—A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. All altering and repairing done here<br />\nby skilled tailors.<br />\nDYEING.<br />\nGentlemen's Suits dycd and pressed,<br />\n$2.00<br />\nOvercoats,<br />\n1 tIO<br />\nBoys' einits, according to size 1.00, 1.25 and 1.50<br />\n<br />\nM. BERNSTEIN & CO.<br />\n<br />\nCLOTHES MADE TO ORDER.<br />\n<br />\nLosnoN —A mEstosN<br />\n<br />\nThe illustrations show how the clothes we make fit<br />\nand look—the wear you'll learn about later.<br />\nThe light overcoat is ae especiat I y snappy garment,.<br />\nThe sack suit is cut after the very newest pattern.<br />\nThe winter overcoat. is as swagger as the dressiest<br />\nman could wish.<br />\nWe make all other proper styles, of course; (Irene<br />\ncutaway, double-breasted, four-button sack and<br />\nNorfolk suits.<br />\nYou can now have first pick of our first pick of<br />\ncloths.<br />\nPrices are low —we never learned to charge too<br />\nmuch. We would like to ;nuke your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style and a perWorkmanship<br />\nlit.<br />\nwill be the best you oversaw.<br />\nfect<br />\nYour money back if you are dissatisfied.<br />\n<br />\n_TAILORS<br />\n<br />\nAND<br />\n<br />\nIMPORTERS...<br />\n<br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that. lit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious man can find nothing to growl<br />\nabout our Kann\"<br />\ntS.<br />\nThe same attention<br />\nis given to the man that is less<br />\nParticular, it's'bur way.<br />\nWe are prepared to show you a large line of imported woolens, which does not cost any more than<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n126 NONTI i itTA\\A' S'I‘121]1..:T.<br />\n(Second door above Joel Outman & Co.).<br />\n<br />\nM. BERNSTEIN Lcc CO.<br />\n<br />\n126 N. Eutaw St.<br />\n<br />\nSEE OUR PRICE LIST FOR CLEANING, DYEING AND ALTERING.<br />\n<br />\n\fDrovers Sr Mechanics Nat'l Bank,<br />\n<br />\nSTIEFF PIANOS<br />\n<br />\nOF BALTIMORE, MD.<br />\nCAPITAL STOCK, $300,000.<br />\n<br />\nMA DE OP TB IC HEIST M A rrliRtIA I.4 A1ON FY<br />\nAND EXPERINNCEI (JAN<br />\n<br />\nHUY.<br />\n<br />\nSURPLUS AND PROFITS. $375.000.<br />\n(''Transacts a General Banking Business.<br />\n<br />\n9 N. LIIIEWJP'V ST.<br />\n_<br />\n•<br />\n<br />\nWARHHoonoo<br />\n<br />\nGUSHING Sr GOMPANY, Booksellers andStioers.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\n<br />\n&<br />\n<br />\nPROFS. G. W. LEHMAN<br />\n<br />\nSON.<br />\n<br />\nFOR<br />\n<br />\n34 W. BALTIMORE STREET.<br />\nSchool, Law. Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\n#<br />\n#<br />\nCollege of Baltimore.<br />\nSTATIONERY For School, Familg, Office and Bank.<br />\n_<br />\n—<br />\n<br />\nHaberdashers,<br />\nShirts, Neck• wear,Underwear<br />\nHosiery, etc.<br />\n111111•11111•1111•111•11•1111<br />\nSHIRTSTO ORDER A SPECIALTY.<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nJOIlDfiN STABIDEll GO.<br />\n<br />\no t)<br />\n;<br />\n51 I.<br />\nA<br />\nM A714:11.411<br />\n<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy—no adulterants. no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar- -natural eider vinegar, strictly pure and<br />\nstrong.<br />\nSir Oround Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\nOn dale The .1. II. II. Pennants, and all other College<br />\n<br />\nPennants.<br />\n<br />\nIlgenfritz Studio<br />\n<br />\n219 EAST BALTIMORE ST.<br />\n<br />\ntillecOSsor to CUMMins.<br />\n<br />\nA<br />\n<br />\nH. FETTING,<br />\nMANUFACTURER<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\nOF<br />\n<br />\nGreeli Utter fraternity jewelry,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nefore 'IPurchaeing.<br />\nplait'. Call ants 'Examine our iin<br />\n<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC. 6L<br />\n<br />\np. telephone<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. Of if<br />\n<br />\nJENNINGS ‘.4:d lIORSEY,<br />\n<br />\nRUZICKA<br />\n<br />\nMP.110.311 A N'I` TAILORS,<br />\n<br />\n21 W.<br />\n<br />\nfrA Yr FIVE'<br />\n<br />\n445-v.<br />\n<br />\nIC rir.<br />\n<br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, Sold and<br />\n<br />\nBookbinder,<br />\nI. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\n<br />\nTHEO. WARNER<br />\n<br />\nJAMES R. PAINE.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\n<br />\nPIPPEN'S F30011 STORE,<br />\n605 N. EUTFIrW ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\nAgents i'or Lincoln Sz Bennett and<br />\nWalter Barunrd's London Hats.<br />\n324 WEST B A LTI MORE STREET.<br />\na.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 407- /Top<br />\n<br />\nI ii s Gaps<br />\n<br />\nNORTH GERM LLOYD S. S. GO.<br />\nCABIN PASSRGE fkl- LOW<br />\n<br />\nNew York to Bronco, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBALTIMORE TO BRE,MEN DIRECT.<br />\n<br />\nfl. SGHUMAGHER Sr GO., General<br />\n<br />\nFor particulars apply to<br />\n<br />\nRunts.<br />\n<br />\n.JAS. MEIKLE, Vicc..Pnxer.<br />\nISAAC H. DIXON, PREST.<br />\nJAS. R. RICHARDs, TIREAS<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\n<br />\nSmith Dixon Co.<br />\n<br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\n'Baltimore, Md.<br />\n<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VII, No. 3<br /><br />\nNovember 20, 1902<br /><br />\nTHE<br /><br />\nNEWS LFTIFR<br />\ns<br />\nlet<br /><br />\n\"%bc.„3,220051W)<br />\n4tZZI4446..<br /><br />\nBEING<br /><br />\nTHE<br /><br />\nTHIRD NUMBER<br />\nOF<br /><br />\nVOLUME SEVEN<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns Hopkins Press.<br /><br />\nThe Johns Hopkins Universitu<br />\nBALTIMORE, MARYLAND.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, 1902.<br /><br />\nof<br /><br />\nthe Medical titealtll:<br />\nPresident: 1RA IIRMSEN. Dean<br />\nVVILL/Ald H. How sl,L. Dean of the Cofleue loVreuity:<br />\nEnwiten H. GRIFFIN.<br /><br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candi(lutes for the degres of Ph. D.)<br />\n(b) In Medicine. (courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERORADUATES:<br />\n(e) At candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000<br />\n200,000 volumes.<br />\nPratt Library,<br /><br />\nLaboratories.<br /><br />\nDirectors.<br />\nTra Remmen.<br />\nJoseph S. Ames.<br />\nWilliam 11. Clark.<br />\nWilliam W. Brooks.<br />\nFro!actin P. Mall.<br />\nWill ion'.<br />\nHowell.<br />\nWilliam II. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br /><br />\nDirectors.<br /><br />\nSeminaries.<br /><br />\n11.<br /><br />\n110.<br /><br />\n101.<br /><br />\nii<br /><br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br /><br />\nr.<br />\n.1. hi.<br />\nPro I. .11.1 f II.,<br />\n.lose<br /><br />\nUndergraduate Courses (leading to B. A.)<br />\normtvn.<br />\nI. classical<br />\nlir<br /><br />\nNla(heniat it.al Plosicei<br />\n(leading up to<br />\nI'<br />\n(leading uo to medicine).<br />\n(<br />\nItO in -Mathematical.<br />\n. Ii isiorical-Pol Bleat<br />\n(leading up to law).<br />\nModorn Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. X X V).<br />\nA merlean Chemical Jon met (vol. XX VI I I).<br />\nAmerican Journal of Philology (vol. XX III<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII ).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTterrestriel Magnetism (Vol. VII).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduete or collegiate<br />\nceurses, will be sent on applleat ion to the Registrar.<br /><br />\nVolume<br /><br />\namerican Cbeinical rfournal.<br />\nI. ItEMSEN. Editor. Monthly. 8vo.<br />\nXXV III in progress. $5 per volume.<br /><br />\nVolume.<br /><br />\n8vo.<br />\n%tutees from the Ithological laboratory.<br />\nVolume V complete. $5 per volume.<br />\n%tables in historical anti IPoUtical $cience.<br />\nMonthly. svo. Series XX in progress. $3 per<br />\nvolume.<br /><br />\n3obne hopkins 'University Circulars.<br /><br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\nPill.3ohne lbopithte hospital Salletin. Monthly. 4to.<br />\nVolume XIII in progress. $1 per year.<br />\n19111. aohns Thophins hospital *Reports. 4to. Volume X<br />\nIn progress. $5 per volume.<br />\n1X.<br /><br />\nContributions to lissyriology anti Comparative<br />\n%mite: phtlolon. (ilettrage zur A ssyriologle, etc.)<br />\nVol. IV completo.<br /><br />\nX.<br /><br />\nMemoirs from tbe Ifiological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\nMobern Language 'Rotes.<br />\nA. M. ELLIOril, Editor. Monthly. 410. Volume<br />\nXVII in progress. $1.50 per volume.<br />\nX111. 3ournal of Experimental finebicine.<br />\nVV. II. WELCH, Editor. 111-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX1111. american journal of insanity.<br />\nII IN IV M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nX1111. 'Reports of Marylanb i3colo4iica I Survey.<br />\nWILLIAM B. CLARE, Editor.<br />\nXIX<br /><br />\nI,. tiilaerslerec.<br />\nSmith.<br />\nKirby<br />\n111aarice Illoonific id•<br />\n!laid 'Maid.<br />\nHenry LiYoml.<br />\n.<br />\n21farshall<br />\nHies tr. ituiyht.<br />\nViotr, /it.<br /><br />\nrick.<br />\nLa I ill.<br /><br />\nU<br /><br />\ntimerican ;foams! of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXXV in progress. $5 per volume.<br /><br />\n111111. limericati aournal of !philology.<br />\n13. L.(H LDERSLF,EV E, Editor. Quarterly. Miro,<br />\nVolume X XIII in progress. $3 per volume.<br /><br />\nP.<br /><br />\nInstruction.<br /><br />\nChemistry.<br />\nPhysics.<br />\nuleology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhisiology.<br />\nPO !fogy and Bacteriology.<br />\necology.<br />\nPh<br />\nPh lolog ice I Chemistry.<br />\nClinical Medicine.<br /><br />\n1.<br /><br />\nterrestrial Magnetism anti 'atmospheric Elec.<br />\ntricity I,. A. BAUER, Editor. Quarterly. five.<br />\nVolume V II in progress. $2.50 per volume.<br /><br />\nX11/1. annual 'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nX11311. annual Iftegister.<br />\nGiving the list()I officers and students,and stating<br />\nthe regulations, etc., of the University. Pub/Ls/ma at the dose of the academie year.<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text, of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. lid pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete lite-AMU° edi.1. liendel Harris. 110 pp. 4to. 10<br />\ntionp.latEeds1<br />\n$5.00.<br />\nReproduction in Phototype of Syriac MSS. with Antilegement,' Epistles. Edited by I. H. Hall. 13.004<br />\nBibliographia Hopkinelensis. Part I. Philology. Purrs<br />\nII 111. Chemistry, Mineralogy and Geology. Parts<br />\nI V- V-VI. Physics,Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nfi lull list ot publications will he sent on application.<br /><br />\nCommunications in respect to exchanees and remittances<br />\nmay he sent to Johns 'Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nNOVEMBER 20, 1902.<br /><br />\nNo. 3.<br /><br />\nA NEWSPAPER MAN'S WARNING.<br /><br />\ntV<br /><br />\nIIEN I was at the University a dozen years ago there was no student<br />\npaper. There had been efforts to establish one, in two of which I took<br />\npart, but the faculty was not then in the mood and we applied in vain for<br />\nPermission to go ahead. Even our much-loved class annual, the first of the Hullabaloos, had many trials and tribulations before we finally produced it upon the<br />\nstage of Un:versity life. This little foreword in a reminiscential vein is only<br />\npenned because it serves to measure my gratification at the success which has<br />\nattained the publication of THE NEWS- LETTVR. I have always held to the theory<br />\nthat a college paper, well-edited, may become a valuable aid in the development<br />\nOf that 'varsity spirit which seems essential to the growth and popularity of an<br />\ninstitution like the Johns Hopkins. This, I feel sure, has been proven by THE<br /><br />\nNEWS LETTER.<br />\nI have been asked to write something for this issue of THE NEws-LETTER.<br />\ncan think of nothing better than to contribute a leaf out of my own story as a<br />\nw.arning to some now in the University who have hopes and dreams of a certain<br />\nkind There is in every class a percentage—sometimes large, sometimes small—<br />\nwho desire to win a name as writers and who are more than likely to consider<br />\nthat newspaper work offers a means to that end. These are the men I want to<br />\nreach and to them I merely wish to say:<br />\n\"Don't do it.\"<br />\n.<br />\nA man who enters the newspaper field with the idea of stepping thereby<br />\ninto literature or into the writing of history or any other sort of book-making<br />\nthat requires sustained attention to score success, will ultimately wake up to a<br />\nrealization that his cherished volume has not been written, nor, for that mat'er,<br />\nhas. any other volume been turne,1 out that adequately satisfies the ambitions<br />\nof its producer. Journalism is sometimes a stepping-stone to literature, but<br />\nmore often it is a set-back. It gives a man a living, it trains him to write with<br />\nfacility, but it exacts much of him. The hours of work, especially on a morning<br />\nnewspaper, are long, and then there are frequent emergency demands beyond<br />\nthis limit. How, then, is a man likely to find time to delve into literature,<br />\nexcept in a most dilettante way? After an arduous mental and physical strain<br />\nof ten, twelve or fourteen hours, is he in condition to do work whose promise<br />\nand whose originality will gain the approval of the gentlemen who read manuscripts for the magazines and the publishing houses? He may write, having<br />\nacquired ease and speed, but he can never hope to concentrate his spare time for<br />\nmonths upon something other than his work for the paper. The result is that<br />\nhis note in literature is but the feeblest pipe, unnoticed beyond a circle of friends<br />\nand leading to no enduring reputation.<br />\nI<br /><br />\nTHE NEWS-LETTER.<br />\nI know that some will say that there are literary posts in connection with a<br />\nlarge daily newspaper. There are, for example, writers of editorials and of<br />\ndramatic criticisms, reviewers of books and writers of special articles of a semiliterary or semi-editorial character. While this is true, it is also obvious that<br />\nthe newspaper publisher is not going to engage youths just out of college to fill<br />\nany of these posts. In fact, I may go farther and lay it down as a principle<br />\nborn of long experience that the best men for all these posts are those who have<br />\nbeen \"through the mill,\" who have had their notions tempered by actual rubbing up against all things and all men and who have gained thereby a certain<br />\ndelicacy of newspaper touch that enables them to take the pulse of the public<br />\nand to weigh right and wrong, importance and insignificance, with the rapidity<br />\nof judgment which a daily paper requires. I know one exceptionally able editor<br />\nand one brilliant literary critic, neither of whom were ever reporters The critic<br />\nwas secured by the paper solely by reason of his exceptional aptitude for his<br />\nparticular work, and can do nothing else for the newspaper, while the editor has<br />\nconfessed to me that he feels he would be more valuable if he posses:ed the<br />\ninsight which reporting and editing alone can give.<br />\nIt is evident, then, that the chance of entering newspaper life other than as<br />\na reporter is about one in a hundred. The ninety-nine, therefore, can attain<br />\nthe desirable posts only by the route from the bottom. I think all of them will<br />\nconsider journalism \"one demned grind\" after two months. A wary city editor<br />\nis afraid to trust the raw hand on other than routine items, and even with these<br />\nit is annoying to be reminded that the point has been overlooked or that initials<br />\nare necessary for all names. After that, however, comes the insidiously attractive part of a reporter's life. He is \"assigned\" to stories\" of importance; he<br />\nrubs'elbows with fatuous men of city and State, and interviews distinguished<br />\nvisitors; he feels that he is behind the scenes while dozens of dramas are being<br />\nacted simultaneously, and he learns that the stage-manager is always more<br />\nimportant than the actors, while the scene-shifter is very likely to be so. He<br />\nis, in a word, an active and not unimportant participant in the full tide of human<br />\nlife, and though his work is arduous and his hours long,there is sufficient variety<br />\nin his assignments, day by day, to keep him always interested in his work and<br />\neager to do better than his rivals.<br />\nA newspaper office is, however, not entirely made up of reporters. There<br />\nmust be a corps of editors to do nothing but edit; men to plan what reporters<br />\nand correspondents shall do; men to go over, read, correct and dress up the<br />\nvolume of matter pouring in; men to take that edited copy, classify it by relative<br />\nimportance and interest, and to select the best for publication and \"make up\"<br />\nthe pages. None of these men, in a first-grade newspaper office, ever write<br />\nanything but head-lines and corrections. Their hours are long, often unusually<br />\nso, their work confining, often uninteresting. Probably nearly all of them<br />\nstarted into journalism to pass on to literature. They escaped the maelstrom<br />\nof the attractiveness of reporting only to find themselves engulfed in the vortex<br />\nof \"copy-reading,\" Their \"great book\" is not likely to be written unless they<br />\ntear themselves from newspaper work. And that is difficult to men of thirty or<br />\nmore, men probably with families dependent on their salaries.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nThis question of remuneration also suggests an additional warning. After<br />\na college man who has gone into newspaper work has become broken in, his salary<br />\nwill average from $800 to $1500 as a reporter, comparing more than favorably<br />\nwith the incomes of his classmates who have gone into other professions. If he<br />\nbecomes an editor, or an editorial writer, he will get from $1200 to $2000, and<br />\nthis, too, may be still better than his classmates are doing. But that is his<br />\nmaximum, and in eight or ten years the classmates, those who are ambitious<br />\nand successful, begin to forge ahead; as a rule, to stay ahead. The editor with<br />\na comfortable salary will stay an editor of modest means all his life. He has<br />\nnot the capital to branch out in the line whose details he has mastered, for it<br />\ntakes a big sum to start a daily paper. He has to be content with the praises<br />\nof those who employ him and those who know him. His work is hidden in the<br />\nanonymity of each issue of his journal. His ambitions are for the paper. He<br />\nbelongs to an honorable profession and he is respected, therefore, in the corn.<br />\nmunity.<br />\nBut he never writes that world-illumining volume if he continues to work<br />\nconscientiously as a newspaper man.<br />\nCHARLES WEATHERS BUMP, '92.<br /><br />\nINTERCLASS FOOTBALL.<br /><br />\na1<br /><br />\n,0 one will doubt but that the interclass football games played by the classes<br />\nof '92, '93 and '94 were beyond all expectations a great success, and if<br />\nby recalling them to mind after several years have elapsed, I can a'rouse<br />\nany enthusiasm along this line of University athletics, I shall have been fully<br />\ncompensated for the time spent in writing these few lines.<br />\nFor several years prior to '92 there had been class football teams, and they<br />\ncontinued to form a part of University athletics until after the freshman year of<br />\nthe class of '94. At this time they were abolished and a University team put in the<br />\nfield. These class teams aroused a great amount of college spirit, and in my humble opinion the formation of a University football team was directly traceable to<br />\ntheir organization. Class spirit and pride reached their culmination<br />\nin the clases of '92, '93 ' and '94, and when I think of the splendid<br />\ngames played, I wonder how it came about that we could procure three such<br />\nteams out of so small a number of students I do not believe the teams that<br />\nformed the Interclass League for the winter of '91-'92 have ever been equalled<br />\nin any university, certainly never in the history of the Hopkins. Of course I<br />\nmay be a more or less interested party, but I am sure the above is the general<br />\nopinion of those who know something of the history of these classes.<br />\nNearly everyone is familiar with the history of the exciting games by which<br />\n'93 became the champions of the J. H.; '92 and '94 fought furiously for the<br />\nlaurels, but were doomed to disappointment. There were but three games<br />\nPlayed, so that each class had a fair chance, and it hurt the pride of '92 to meet<br />\ndefeat at the hands of the Junior class. '94 had not much to lose, for she was<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\ntoo young in University life to appreciate the significance of such an event. In<br />\nhonor of winning this championship, each member of the team of the class of<br />\n'93 was given as a trophy a golden football with his name and class engraved<br />\nupon it. These little charms are highly prized by the men holding them and<br />\nare afterward pointed to with much pride.<br />\nI have thus briefly given a mere outline of what has been done in class<br />\nathletics at the University. Why cannot this spirit again be revived? I<br />\ntrust that the day will come when each class, as it enters the University, will<br />\norganize for athletics with the same feeling with which it organizes for protection against hazing, and that we will be able to witness the enthusiasm of a<br />\ndecade ago.<br /><br />\nH. N. A13F,RCRO1BIF.,<br />\nCaptain of '93 Football Team.<br /><br />\nALUMNI.<br />\nThe Rev C. H. H. Branch has recently been called to the Maxwell<br />\nStreet Presbyterian Church, Lexington, Ky.<br />\n'03<br />\nWethered Lilly is engaged in business in Dmver, Col., and reports his<br />\nhealth much improved.<br />\nThe engagement is announced of Mr Wilson L. Smith to Miss W.<br />\n'00<br />\nVirginia Wren, of Norfolk, Va. Mr. Smith will next spring complete his<br />\ncourse in architecture at Columbia University.<br /><br />\n'95<br /><br />\nDr. George Lefevre, president of the Johns Hopkins Club of the Middle<br />\nWest, who is now professor of Zoology at the University of Missouri, Columbia,<br />\nMo., announces that the third annual meeting and dinner of the Club will take<br />\nplace at the Hotel Baltimore, Kansas City, on the 20th. The railroads will<br />\ngive reduced rates for the Missouri-Kansas football game on that day, and it is<br />\nhoped to have a large attendance at the banquet. The Club now numbers more<br /><br />\n'91<br /><br />\nthan sixty members.<br />\nDr. James F. Mitchell has resigned as Resident Surgeon at the Hospital,<br />\nand has started practice in Washington. ' His address is 1311 Connecticut<br />\nAvenue.<br />\nThe Rt. Rev. Junius Moore Horner, P. E. Missionary Bishop of Ashe95<br />\nville, preached at Emmanuel Church on the 9th, on the subject of the mountain<br />\npeople of his diocese.<br />\nThe Rev. Francis Le Jau Frost, Ph. D. of the University in 1901, is now<br />\nrector of St. Mary's Church, Castleton, West New Brighton, S. I.<br />\nMr. Thomas Dixon, Jr., author of \"The Leopard's Spots,\" who lectured<br />\nin this city on the 11th, was a graduate student at the University 1883.4. Mr.<br />\nDixon is now working on a novel which deals with the divorce question.<br /><br />\nTHE NEWS-LETTER.<br />\nFOR THE UNDERGRADUATE.<br /><br />\nC<br /><br />\nHE Junidr-Freshman football game and cane-rush will again take up a<br />\nlarge share of the interest in fall athletics. The contests are scheduled<br />\nfor December 6 at American League Park. As usual, half a dozen tickets<br />\nwill be issued to each member of the two classes. Others wishing to secure<br />\ninvitations should apply to G. A. Foster, '04, manager of the Junior team, or<br />\nClarence Stone, '05, captain of the Freshman team.<br /><br />\nThe opening Musical Club concert took place on the afternoon of yesterday,<br />\nNovember 19, at the Hospital, the management following the usual wise plan<br />\nof selecting for the first audience those who are too weak to help themselves or<br />\nto protest. The choice of the Hospital is, in addition, fortunate in that many<br />\nof the old grads and former players on the clubs, who are now at the Medical<br />\nSchool, drop in and generously bestow their criticism upon the players. It<br />\nmust be said, however, that the general result of the afternoon's work was<br />\ngood, and that the leaders have cause to hope—which is about all that can be<br />\nexpected of a first attempt. The program was as follows:<br />\nGlee Club, University Ode, Devries, '89; Banjo Club, March Song from<br />\n\"The Show Girl;\" Mandolin Club, \"Imperial Edward March.\" Sousa; Glee<br />\nClub, 1902 medley, W. B Carver; Banjo Club, \"Our Director\" (Yale song);<br />\nMandolin Club, March from \"Prince of Pilsen;\" Glee Club, \"Wandering<br />\nSingers' Patrol;\" Banjo Club,' The Ragged Raglan,\" Edgeworth Smith '98; Solo,<br />\nP. K. Gilman, Med.; Glee Club,'Rah for Black and Blue,\" J. G. Peters, '97.<br />\nOn Monday night the members of the Senior Club assembled at that haunt<br />\nOf harmony for the second feast of the season, at which they were the guests of<br />\nthe newly elected class president, Harry King Tootle. After reading the<br />\nstringent House Rules, posted by the vigilant committee, the Seniors indulged<br />\nin a little decorous \"rough•house,\" during which a prominent member of the<br />\nlacrosse team was repeatedly called to order for his violation of Rule 5*. With<br />\nappetites .sharpened by these innocent diversions, the crowd next attacked a<br />\nbountiful \"spread,\" and then retired to the rear to drink the health of the host<br />\nof the evening. A short business meeting of the Club followed.<br />\n\"Resolved, That import duties on necessities of life should be materially<br />\nreduced,\" will be the subjett of the next debate by the Senate and the House.<br />\nIn the Senate, the negative will be taken by Lanier, Hunley and Sandrock,<br />\nand the affirmative by Smith, Hoffman and Warner; while in the House, Foster<br />\nErlanger and Evans will uphold the affirmative side and HumriChouse, Geiger<br />\nand Etnig the negative.<br />\nThe University of North Carolina has submitted the following question as<br />\nthe possible subject of their debate with tile Hopkins: \"Resolved, That the<br />\nPatriot should be independent of party authority in voting.\" We have the<br />\nchoice of defending either the negative or affirmative; but Dr. Lee feels that the<br />\nsubject is perhaps not the best one for the case, and another one may be chosen.<br />\n*This Rule prohibits violent and unparliatnentary language.<br /><br />\nTHE NEWS-L4TTER<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\nNOVEMBER 20, 1902.<br />\nSubscription $1 .50 per year.<br />\n.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editcas,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br />\n.<br /><br />\nROBERT S. LA.NIER, 1903.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904<br />\nREGINALD S. OPIE, 1904.<br />\nW. S. BIRD 1903.<br />\nHARRY BAETJER, 1003.<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ H U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n,...••••••••••<br /><br />\nHE leading article of this issue is from the pen of an alumnus who, ever<br />\nsince his career as editor-in chief of the first HULLABALOO, has always<br />\nbeen strongly interested in Hopkins literary and journalistic affairs.<br />\nPerhaps even the convincing facts that he marshals so effectively will not hold<br />\nthe members of the Press Club back from their awful fate; but in the case of<br />\nunderclassmen with reportorial ambitions, there may still be hope. We congratulate the readers of THE NEWS-LETTER on having such an able intro<br />\nduction to this timely subject.<br /><br />\nt<br /><br />\nHE support given the football team by the college men and some faithful<br />\ngrads. was very gratifying at the Westminster game. The number and<br />\nspirit of the rooters was good, and there is no doubt that their vigorous<br />\nand well-trained songs and war-cries helped the team to render so good an account of themselves. Moreover, from present indications it seems that a large<br />\nproportion of the college will be at the American League Park on Saturday,<br />\nto get in good training for the great fight on Thanksgiving day.<br />\nHowever, there are many men in the college who can help the team in a<br />\nmore direct way than by yelling at it, and who are not taking advantage of<br />\ntheir opportunity. These are the men who should be composing the scrub<br />\nteam. It has rarely happened this season that, in their afternoon practice, the<br />\n'Varsity players have had a second team to line up against, on which to try<br /><br />\nZ<br /><br />\nTHE N EWS- LETT8R.<br />\ntheir plays. This is but a poor state of affairs. There are plenty of men who<br />\ncould make their class teams, and who have some knowledge of football, who<br />\nare failing in their duty to the college, merely because they see no direct reward<br />\nfor the exertion of coming out every afternoon and being rolled around by the<br />\n'Varsity players. It should need no second thought to show that there is as<br />\nlittle truth in such reasoning as there is honor in such a position. Although<br />\nthe 'Varsity team is now made up, supposedly, of the best players that can<br />\nPossibly be secured from the college and Medical School, still it is the interest<br />\nand pride of every student to do all in his power to make them steadily better.<br />\nAnd if it is in his power to give such active help as practising with the regular<br />\nteam, and if he does this faithfully, he will certainly deserve and obtain a<br />\nrespect and popularity among his fellow-students which cannot be measured<br />\nby formal athletic honors. Every man who is able ought to get out his football clothes every afternoon during the week that remains before Thanksgiving,<br />\nand show some practical evidence of his gratitude to his Alma Mater.<br /><br />\n4 40N to Homewood!\" is still the cry. And it is being taken up by new<br />\nvoices. The decision as to the dividing line between the University<br />\ngrounds and the new city park settles an important question. Mr. Brent<br />\nKeyser, in supplying funds for the survey, is enabling us to get an idea as to how<br />\nour future temples of learning are to be placed. The latest agitation on the movement, however, is one which peculiarly interests the undergraduates, since it<br />\nmust be carried out by them alone,— namely, the plan of a college dormitory,<br />\nto be built by Hopkins undergraduates by means of the dime savings-bank<br />\nsystem. It is astonishing how soon the dimes received in small change will<br />\ngrow into the $5.00 which fills the bank; little burden would be experienced in<br />\nsubscribing, say, $10.00 a year, even by those of least means. It is easy to cal<br />\nciliate that 150 students, each giving $10.00 per year, would in the course of six<br />\nyears accumulate the sum of $9,000, which with compound interest, would<br />\napproach $10,000. And this sum would be sufficient to erect a college dormitory at Homewood which would be a splendid memorial to the college<br />\nstudents of the J. H. U. from '02 to '08. As to the supervision of the matter,<br />\nthe four class treasurers could form a perpetual committee to collect the money<br />\nand take charge of the deposit. To start this movement would be an achievement of which the present college could always feel proud, and with good<br />\nreason.<br /><br />\nT has been thought advisable that the vacancy of assistant athletic editor on<br /><br />\n3<br /><br />\nTHu NHWS-LF,TTRR board should be filled, if possible, by a member of the<br />\nclass of '04. All candidates should hand in accounts of the M. A. C. and<br />\nUniversity of Maryland games, as soon as these occur, to Box 374.<br /><br />\nHE N EWS—LETTER<br /><br />\n' MI<br /><br />\nIll<br /><br />\nI 11111 111,,.<br />\n...,'<br /><br />\nJ<br />\n7,ii<br /><br />\n.. •. ..<br />\nN I VER S I<br /><br />\n.i :ITL:17)i 1 Mil 1 jI<br /><br />\n,<br />\nI 1 PIIIIIIMMUMMiliii<br /><br />\n,.<br /><br />\n,........,.............,,,<br />\n1111011g111,.,<br />\n4,,, .,.,.<br /><br />\niiiiiiiiiihiiiiiiiiiiiiiiiii<br />\n'<br />\n' It .'<br /><br />\nI<br /><br />\n.<br /><br />\nilillgiffitiMill<br />\n'IM4<br /><br />\nR. TOYOKICHI IYENTAGA, who lectured in the city last week. spent<br />\nsome time about the University renewing old acquaintances.<br />\nDr. Lyman Tyler, son of former President Tyler, will deliver the course of<br />\nlectures to be given at the University next February under the auspices of the<br />\nMaryland Society of Colonial Dames of America,<br />\nDr. A. Marshall Elliott is on the committee on membership of the recently<br />\norganized \"North Carolina Society.\"<br />\nThe lectures on American history by Professor Andrew C. McLaughlin, of<br />\nUniversity<br />\nof Michigan, have been postponed to November 24th and 25th.<br />\nthe<br />\nDr. McLaughlin will speak on \"The Principles and Politics of the American<br />\nRevolution.\"<br />\nDr. Paul Haupt, director of the Oriental Seminary, and Dr. T. C. Foote,<br />\nRayner Fellow in the Oriental Seminary, are organizing a class in Elementary<br />\nHebrew for ministers, theological students, and others interested in the sacred<br />\nIan guage.<br />\nPresident Remsen delivered an address on \"Original Research\" before the<br />\nAssociation of Collegiate Alum= in Washington on last Friday.<br />\nAt the annual meeting of the Charity Organization Society last week, President Remsen was elected president, and Dr. Gilman, vice-president. Dr. Remsen, Dr. Hurd and Dr. Hollander were elected members of the board of man•<br />\nagers. The annual public meeting of the society will be held at McCoy Hall,<br />\nMonday, December 1st. Addresses will be delivered by Rev. Dean Hodges, of<br />\nthe Cambridge Divinity School, on \"Alms and the Man,\" and by Mr. Edwin T.<br />\nDevine, General Secretary of the New York Charity Organization Society, on<br />\n\"Reasons for and the Possibilities of the Federation.\"<br />\nThe sixteenth annual convention of Colleges and Preparatory Schools of<br />\nthe Middle States and Maryland will be held at McCoy Hall on November 28th<br />\nand 29th. President Remsen will deliver the address of welcome to the delegates. The last time the association met in Baltimore was in 1894.<br />\nMr. John C. Thomas has been elected by the Hospital Trustees to the post<br />\nof Treasurer of the Johns Hopkins Hospital. Mr. Thomas fills the place of<br />\nMr. Joseph C. Merrifield, who died last July.<br /><br />\n'rHg NEWS—LETTER.<br /><br />\n9<br /><br />\nThe Geographical Society of Baltimore has received a great many recruits<br />\nfrom the student body on account of the connection of President-Emeritus<br />\nGilman and others with the society. The members on Monday last numbered<br />\n1,131. The lectures will not be held in McCoy Hall, as originally announce<br />\nd,<br />\nbut will take place at the Peabody Institute.<br />\nProf. G. W. Ritchey, of the Yerkes Observatory and the University of Chicago, has accepted an invitation to lecture before a special meeting of the Scien<br />\ntific Association on the evening of Tuesday, the 25th. Subject: \"Recent<br />\nResults in Astronomical Photography with the large instruments of the Yerkes<br />\nObservatory.\" Prof. Ritchey will show stereopticon pictures of some of these<br />\nwonderful photographs, and will explain the construction and operation of the<br />\ninstruments used in taking them.<br />\nThe fall meeting of the National Academy of Sciences was of especial in<br />\nterest to Hopkins men, not only because it was held in a University building,<br />\nbut also because several papers, among them perhaps the most important of<br />\nthe<br />\nsession, were read by workers at the University. These were Dr. Morse and<br />\nDr. R. W. Wood, who received great applause for their lectures and<br />\ndemonstrations. Dr. Wood explained the nature of a substance long sought for by scientists, which he had successfully investigated, designated by him as nitroso dimethylaniline. Its use will be in the field of astronomical photography, arising<br />\nfrom its extraordinary property of opaqueness to all visible rays of light,<br />\nand<br />\ntransparence to invisible rays.<br />\nY. M. C. A. NOTES.<br /><br />\nC<br /><br />\nHE services of the Week of Prayer for young men were fairly well attended, and the spirit of the attendance was very good. President Remsen and Dean Griffin were both present at the Sunday meeting.<br />\nAll men with nine o'clock classes have been urged to come a few minutes<br />\nearly for morning prayer service. The singing at this service is good, but<br />\nmore vOices would improve it. Dr. T. C. Foote leads this week and Mr. A. H.<br />\nClarke will be the leader next week.<br />\nThere is an interesting article in the November number of \"Association<br />\nMen.\" It gives a list and personal account, with some photographs, of leading college athletes who are leaders of the Christian Associations of their colleges Some of these men were met by the Hopkins delegates at Northfield<br />\nlast summer. Carter, of the Harvard Lacrosse team, was secretary of the Y.<br />\nM. C. A. for two years and is now student secretary for northern India.<br />\nFrance, captain of the Harvard baseball team and leader in Bible class work,<br />\nwas one of the most active men at Northfield for positive Christian work.<br />\nGardner, captain of the Princeton football team and member of the '03 crew, is<br />\npresident of the Association. Joe McCracken is general secretary at Columbia.<br />\nChadwick, captain of Yale's great eleven, is a leader in Christian work at Yale,<br />\nand had charge of the athletic events at Northfield. A copy of the article here<br />\noutlined is on the Y. M. C. A. bulletin board, or may be found on the reading<br />\nroom table in Levering Hall.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nto<br /><br />\nFOOTBALL SCHEDULE.<br />\nNov. 22—Maryland Agricultural College, at American League Park.<br />\n27—(Thanksgiving) University of Maryland, at American League<br />\nPark.<br /><br />\nHOPKINS, 6; WESTERN MARYLAND, 6.<br />\nLL things considered, we have cause to be proud of ourselves for the<br />\nshowing made in our first game of the season at Westminster.<br />\nUpon reaching there, it was decided that the game should be played<br />\nin two 20-minute halves. Hopkins won the toss, and decided to defend the<br />\nwest goal.<br />\nRoberts kicked off for Western Maryland. Strohbar received the ball and<br />\nadvanced it 10 yards. Miller made a run around right end for 15 yards, but at<br />\nthis point Western Maryland braced up and secured the ball on downs.<br />\nThe college boys played hard, but a fumble gave Yearley the opportunity<br />\nthe ball for Hopkins. A series of fine runs by Blanck, Houghton and<br />\nsecure<br />\nto<br />\nMiller carried the ball to Western Maryland's 20-yard line. Hopkins then lost<br />\nit on downs, but Maryland was forced to kick after being held for two downs.<br />\nStrohbar caught the ball, and by a beautiful run around right end advanced<br />\nthe ball to the 15-yard line. Blanck was pushed through several times, and<br />\nfinally, after a hard plunge, scored the first touchdown. He also kicked goal,<br />\nand after 18 minutes of play the score stood 6 to 0 in favor of Hopkins. The<br />\nremaining two minutes of the first half were spent in struggles which left the<br />\nball in the center of the field.<br />\nHopkins kicked off in the second half, and the ball was downed on the 10yard line. Western Maryland kept the ball most of the time, and fifteen seconds before the end of the game Roberts was pushed over for a touchdown near<br />\nthe side lines. After a long and serious argument, Spalding's \"Manual\" prevailed, and the ball was punted out, successfully heeled, and Roberts kicked<br />\ngoal, making the score 6 to 6.<br />\nTen seconds remained, and on the first down after the kick-off, time was<br />\ncalled and the contest was over.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nThe game was snappy and full of spirit from start to finish. The end runs<br />\nand rushes made by Blanck, Miller and Stone were fine. In fact, these three<br />\nbacks did nearly all the work of advancing the ball. Strohbar at quarterback<br />\ncontributed largely to Hopkins' success. Thanks to his accuracy, Hopkins did<br />\nnot make a fumble throughout the entire game. On Western Maryland's side,<br />\nRoberts, Hurley and Tarr played an excellent game, especially the first named.<br />\nWe have good reasons to be proud of the 'Varsity eleven. It is no small<br />\nmatter for players of comparatively green material to \"split even\" with a team<br />\noutweighing them by 16 pounds per man and playing on its own grounds.<br />\nThe rooters which went up with the team on a special car contributed<br />\nlargely to our success, for whenever they could take their eyes off the fair<br />\nco eds on the grand-stand they certainly did make a vast volume of encouraging noise.<br />\nChief Rooter Plaggemeyer is to be congratulated upon his success in getting the rooting so well organized in such a short time, and every man in the<br />\nUniversity should be on hand at the game with the Maryland Agricultural<br />\nCollege on Saturday next to cheer the Black and Blue on to victory.<br />\nThe line up was as follows:<br />\nJ. H. U.<br />\nW. MD.<br />\nHoughton<br />\nRight end<br />\nWilson<br />\nGreen<br />\nRight tackle<br />\nBrown<br />\n'Yearley<br />\nRight guard<br />\nWhite<br />\nMarshall<br />\nCenter<br />\nCooling<br />\nHutchins<br />\nLeft guard<br />\nClough<br />\nRosenfeld .....<br />\nLeft tackle<br />\nRoberts (Capt.)<br />\nCaulk<br />\nLeft end<br />\nSimpson<br />\nStrohbar<br />\nQuarterback<br />\nTreadway<br />\nMcCloskey<br />\nBlanck (Capt.)<br />\n*Right halfback<br />\n,.<br />\nHurley<br />\nMiller<br />\nLeft halfback<br />\nTarr<br />\n*Bla-nck and Stone exchanged positions while Hopkins was on the defensive.<br />\nScore-6 to 6. Time—Two 20-minute halves. Umpire—Goodrich, Maryland Athletic Club. Referee—Mr. Ernest Rich, Trinity College. Timers—<br />\nHoffman, J. H. U , and. Davis, W. Md. Linesmen—Stone, J H. U , and<br />\nGreen, W. Md.<br /><br />\nTRACK TEAM<br /><br />\nt<br /><br />\nHE prospect before the management of the Track team is very encouraging.<br />\nJudging by the number of candidates who have turned out at Captain R.<br />\nC. Hoffman's call—some of them experienced track men—there should<br />\nbe no difficulty in selecting a fast team to represent Hopkins at the several indoor meets this winter, and at the outdoor games next spring. Captain Hoffman expects, indeed, to develop as fast a team this year as ever turned out.<br />\n•<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br /><br />\nLight practice, for some time, will prevail. The candidates appear on<br />\nthe track three afternoons a week, and the two remaining afternoons are devoted to light gymnasium work for the systematic strengthening of the body.<br />\nA large proportion of the Freshman class have turned out, and under the<br />\ndirection of Mr. Mackdertnott and Captain Hoffman, the men are gradually<br />\nlosing their awkwardness. They will be instructed in the finer points when<br />\nthey have developed some \"form.\"<br />\nHard work will begin about the first of December. The men will devote<br />\ntheir time to the weights and pulleys in the track room, and will work on the<br />\ntrack, in preparation for the interclass games to be held in the cage about the<br />\nend of January. Definite arrangements for this meet have not yet been made.<br />\nTwo men will be elected by each class to confer with the track and field man<br />\nagement—Captain Hcfftnan, Manager Murkland, and Trainer Mackdermott—<br />\nconcerning the final arrangements to be worked out. There will be the usual track<br />\nand field events and an interclass relay race. A cup will be given to the victorious class in this event, and suitable prizes will be given to the winners of the<br />\nother events. There is also some talk of a relay race between the Freshmen<br />\nand Juniors if the two classes desire it.<br />\nThere will be several excellent men from the Medical School seen on the<br />\ncinder path this winter. \"Joe\" England and \"Bill\" Hoffman will be the<br />\nstandbys from the graduate department.<br />\nAmong those who will appear from the Senior Class are R. C. Hoffman,<br />\nTootle, Pessagno, Nelson, Blank, Yearley, and Smith. From the Junior Class:<br />\nLeCron, Porter, Emig, Kohn, Heald, Rosenheim and Branham. Among the<br />\nFreshmen now at work are: Dill, Boyd, Ullman, Pagon, Chistn, Hudgins,<br />\nMorse, Chambers, Goodenow, Bass, Zeigler, Mergenthaler, Super, Hull, and<br />\nR. C. Jackson.<br /><br />\nCLASS AND INTERCOLLEGIATE DEBATES.<br /><br />\nHILE, the interclass debates will not take place until some time in the<br />\nspring, the candidates for the Junior and Senior teams are already beginning to prepare for the event. Enough men from both classes have<br />\npresented themselves as candidates to secure representative teams.<br />\nIn order to stimulate interest in the class debates, and especially in the intercollegiate debates, a meeting of students was held November 12th to reorganize the Hopkins Debating Club. Sol Blum, '03, who was vice-president of<br />\nthe society last year, presided, and explained the objects of the club. Two intercollegiate debates will be held this year, one with the University of North<br />\nCarolina, and the other witb Brown or Columbia. The election of officers for<br />\nthe ensuing year resulted as follows: President, Sol Blum, '03; Vice-President,<br />\nGeo. A. Foster, '04; Secretary, L. W. Wallis,'04.<br /><br />\nTO<br /><br />\nTHE NEWS-LETTER.<br /><br />\n13<br /><br />\nFABLES FOR THE FOOLISH.<br />\nIn Words of a Few Syllables.<br />\nII.<br /><br />\nZ<br /><br />\nTHE FABLE OP THE PHILANTHROPIST AND THE HO!) HANDLER.<br /><br />\nHERE was once a well-meaning philanthropist who took a bath every<br />\nmorning and employed a clerk to figure out his income. One hot summer<br />\n. day he sat in the shade of a venerable oak watching a house which was<br />\nbeing built across the street from his home. He was waiting for his coachman<br />\nto bring around his high-steppers, for that afternoon he intended to arouse some<br />\ndust and some envy on the speedway.<br />\nAs he watched the sons of Ham carry the brick up the ladder he fell into a<br />\nPonder, and from the ponder he fell into a soliloquy. \"How much happier,\"<br />\nquoth he, \"are these men than I. How much they are to be envied. Behold!<br />\nthey have the digestion of an ostrich and the sleep of a little child.\" Here he<br />\nheaved a sigh such as we are accustomed to hear on the stage. Growing bolder,<br />\nhe advanced to one of the blackamoors who happened to be enjoying a short<br />\nrest in the shade, and addressed him thus:<br />\n\"0 bow much better your lot is than mine! You know the joy of walking,<br />\nwhile I—I have to go whithersoever my coachman listeth. You eat whatever<br />\nyour good wife puts into your till bucket, while I—I find the things prepared<br />\nby my French chef pall upon me. In the evening you go home and lie down to<br />\npeaceful slumbers. while I—I lie awake pondering what Pierpont Morgan is<br />\ngoing to do next.\"<br />\nHere did he heave another sigh The human edition of a work steer looked<br />\nat him in surprise. But the philanthropist continued his Sunday school con,<br />\nmuch after this fashion :<br />\n\"See how gcod it is to labor. Verily I say unto you, if I or some of my<br />\nfellows could carry your hod for you and enjoy your peace, willingly would our<br />\ndollars be rained upon you in recompense.\"<br />\nThe man who worked eight hours a day for one twenty-five could stand it<br />\nno longer.<br />\n\"Look a heall, man, don' you know I'se willin' to trade? I knows de joy<br />\noh walkin' does I? Huh! You carry a forty-pound hod up a ladder an' tell me<br />\nWhere de joy comes in. I eats what my ole woman gives me, does I? I recken<br />\nhit ain't too much. Jes gimme a shot at dat French chief, an' I'll show him.<br />\nDon' talk ter me erbout Pierpoiit Morgen! He can have all de res' ob de won',<br />\nef I wuz in your place. I sleeps lak a chile, does I? Don' you know, man, I'se<br />\nSO tired at night I can't eat tell mos' ten o'clock, an' in de mawnin' I'se so stiff<br />\nI can hardly walk. And yet you sez I've a good thing.\"<br />\nBut the philanthropist stcod up for his pet theory. For the last time he<br />\nsighed.<br />\n\"How happy one of my station would be if he could trade his dollars for<br />\nyour contentment. Only,\" he added sadly, \"he would not have the strength<br />\nto hold up the hod.\"<br /><br />\n14<br /><br />\nTHE NEWS-LETTER.<br /><br />\n\"Don' let dat worry you,\" said the dusky son of toil. \"Ef any ob dem<br />\nbillionaires wants ter trade der dollars fer my hod, jes let 'em come eroun'. Ef<br />\nhits too heavy, I'll hold it up fer him.\"<br />\nMORAL. This fable teaches freshmen that contentment is an illusive<br />\nthing.<br /><br />\nWALTER'S WISDOM.<br />\n443'I' was as good as a vic'try, sah,\" said Walter, as I climbed into the<br />\nthrone-seat in his chamber of horrors. I let him explain.<br />\n'`Ef we'd been a-playin' on a billiard table insted of on .the side of a<br />\nmountain, sah, thar'd been nothin' doin'. You see, it was this way.'' Here<br />\nWalter made a dramatic sweep with his razor which threatened to decapitate me.<br />\n\"It's jest like this, sah. Here's the side of the hill, here's them fellers, here's<br />\nthe ball, and here we is. What next?\" Walter backed off and looked at me<br />\nquestioningly while he made an impressive oratorical pause. \"What next?<br />\nWhat made'm tie that score? Gravity, sah, gravity. You know that things are<br />\nboun' to roll down hill. That ball jest had to come down. Them fellers didn't<br />\ntie the score; it was gravity, sah, gravity.\"<br />\nThere was an impressive silence, broken only by the rasping sound which<br />\ntold the loafers in the barber shop that Walter was giving me a close shave for<br />\nSunday. I didn't need to be told.<br />\n\"I've been paintin', sah,\" Walter remarked at last when he saw that I was<br />\nblissfully oblivious to my surroundings. I opened one eye and looked at him.<br />\nAfter examining him closely I calmly closed my eye and ventured to state that<br />\nI saw no traces of it, that he still preserved that healthy brown color which I so<br />\nadmired. \"If that is nature, Walter,\" I said, \"it is good, but if it is art, it is<br />\nmuch better.\"<br />\nIf ever Walter came near cutting my throat that was the time. When he<br />\nhad gained control of his feelings he remonstrated. \"Law! sah, I ain't been<br />\npaintin' myself, but the shop, sah. Can't you smell it?\"<br />\n\"I have detected a peculiar odor, Walter,\" I replied, \"but I thought that<br />\nit was only your famous elixir for denuded roofs, otherwise known as hair-oil.\"<br />\n\"What, sah, what! Ef you would use some of my hair restorer, it would<br />\ndo you good.\"<br />\n\"Then why don't you use it, Walter?\"<br />\n\"It's no use, sah,\" he answered, sadly shaking his head, \"it's no use<br />\nHair restorer can't help my bald head My wife done took all my hair out<br />\nbefore I invented my hair-oil \"<br />\nWalter seemed to stand in need of consolation, but just then the bell rang<br />\nand I fled.<br /><br />\nTHE NURSE—They're twins, sir.<br />\nYOUNG HUSBAND—And I told her we must begin in a small way.—Life.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nSONGS FOR THE BLEACHERS.<br />\n(AIR : The (good ON Summer Time.)<br />\nIn the good old football time,<br />\nIn the good old football time,<br />\nBowling 'way around the ends,<br />\nSmashing through the line;<br />\nWe hold the ball, they can't hold at all,<br />\nAnd that's a very good sign<br />\nThat there's a gain for Hopkins<br />\nIn the good old football time.<br />\nMr. Dooley.)<br />\nOh, Uncle Daniel<br />\nAnd Uncle Ira,<br />\nThe greatest Prexs. the Hopkins ever knew;<br />\nSo diplomatic,<br />\nAnd so emphatic,<br />\nIs Uncle Dan and Uncle Ira too.<br /><br />\n(.1IR :<br /><br />\nOh, Mr. Garwood!<br />\nOh, Mr. Garwood!<br />\nThe finest coach the Hopkins ever knew,<br />\nHe keeps'em moving,<br />\nAlways improving,<br />\nDoes Mr. Garwood of the J. H. U.!<br />\n(AIR : There are Eyes of Blue.)<br />\nSome teams wear Blue;<br />\nThere is Crimson, too;<br />\nThere is Brown, and Purple, Gold and Green, and every hue;<br />\nBut as I surmise<br />\nThat you are wise,<br />\nYou cheer the Black and Blue so dear to Hopkins eyes.<br />\n(AIR:<br />\nse pine back to Dixie.)<br />\nA song for J H. U., boys!<br />\nWe're Hopkins through and through, boys!<br />\nJust watch them break the Farmers' line and box the end-men tool<br />\nRing out your loud Hosannas,<br />\nAnd wave the grand old banners,<br />\nAnd sing a song for Hopkins—the Black and Blue!<br /><br />\nTHE JEALOUS YOUTH.<br />\nThere was a young man in the cage<br />\nWho worked up an envious rage<br />\nWhen he saw Father Mack<br />\nSprint thrice round the track,<br />\nAlthough at a much advanced age.<br /><br />\n15<br /><br />\n16<br /><br />\nTHE NEWS-LETTER<br /><br />\nLours—Do you want to see something swell?<br />\nADOLPH —Sure.<br />\nLours—Just put a sponge in the bath tub.—Yale Record.<br />\nShe met him in the darkened hall;<br />\nSaid he, \"I've brought some roses.\"<br />\nHer answer seemed irrelevant;<br />\nIt was,\"How cold your nose is.\"—Varsity Fortnightly.<br />\nAfter the ball is over,<br />\nAfter the field is clear,<br />\nWhat have you done with my eyebrow?<br />\nAnd where is the rest of my ear?—Butler Collegian.<br />\nJACK—It must be awfully hard for Harry to quit boDzin' while on the football team.<br />\nJIM—Well, he can play full, anyway.—Prince/on Tiger.<br />\na<br /><br />\nThe Harvard Lamftoon is far from Dr. Griffin's course, but—<br />\n\"We now come to Thales, the Milesian, who imagined the world to be of<br />\nwater. He was undeceived by the Milesian authorities, who made him swim<br />\nover a steep hill and drink a glass of pebbles. His successor, Annexchimneys,<br />\nsaid that air was the only substance, whereupon he received a bill for clothing<br />\nwhich, his tailor declared, had been made to order from high-grade, hand-woven<br />\nair, warranted fast colors. Annexchimneys paid the bill, and thereafter kept<br />\nhis theories to himself.\"<br />\n\"Bughousides, of the Rheumatic school, maintained that empty space and<br />\nnon-being cannot exist. His rival, Embezzlecheese, proved the existence of<br />\nempty space by pushing Bughousides out of a third-story window. Meeting<br />\nhim soon after, Embezzlecheese inquired if he were well. 'I am not,' said the<br />\ngreat Rheumatic stiffly. 'You must be,' retorted Embezzlecheese,'non-being is<br />\nimpossible.' And he dodged the brick which the enraged Bughousides sent<br />\nafter him \"<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT et CO.,<br />\n704 MADISON AVE.<br />\nNNT ts<br /><br />\nC. &amp; P.'Phone 3053-Y.411<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments,<br />\nDraughtsmen's and Engineer's Supplies._<br />\nN. W.Corner<br />\nLexington and Liberty Sts. BALTIMORE. MO.<br />\nAwls\" .for Kettp.1 (V. Esser Co., of New York .<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBARGER,<br />\n308 N. Charles Street.<br /><br />\n„,<br /><br />\nHenderson's<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nstudent's Supplies.<br /><br />\nFOR<br /><br />\nMadison 0Howard Sts.<br /><br />\nADVERTISING SPAr.E IN THIS PAPER<br />\n.PPLY TO<br /><br />\ne°<br />\n111„<br /><br />\nC?CienZe<br />\n:<br />\ne<br />\n•TS.,<br />\nLIGHT•LOM OAR<br /><br />\nPUBLISI-I -S.<br /><br />\n,<br />\n5: :1-ne-etre<br /><br />\nM. MEADE, OF<br /><br />\n1.0NDON,<br /><br />\nEXPERT CLEANER AND DYER,<br />\n126 N. Li ,TAW ST.,(2nd and 3rd doors).<br />\nThe most complete and modern department for<br />\nCleaning, dyeing and altering Gent's and Ladies'<br />\nIrarments.<br />\nIt's time your Winter Clothing<br /><br />\nwas put In order.<br /><br />\nDoes<br /><br />\nit need to be cleaned, dyed, altered or rePaire(l? Are now linings and velvet collars necessary?<br />\nNever mind what's the matter, we will fix it up to..<br />\nlook like new, and you won't have to pay very much<br />\neither. The Price List speaks for itself.<br /><br />\nGENTLEMEN'S Cu)THING PRESSED BY<br />\nCONTRACT. $1.50 PER MONTH.<br />\nPRICES FOR DRY CLEANING AN D DYEI NO .<br />\nGentlemen's Stilts cleaned and pressed<br />\n$1.00<br />\nTrousers,<br />\n.25<br />\nCoats,<br />\n.50<br />\nVests,<br />\n.25<br />\nOvercoats, 1.00<br />\nBoys' Suits, according to size, .50, .75 and 1 (10<br />\nVelvet collars on overcoats, .75<br />\nRELINING.—A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. All altering and repairing done here<br />\nby skilled tailors.<br />\nDYEING.<br />\nGentlemen's Suits dycd and pressed,<br />\n$2.00<br />\nOvercoats,<br />\n1 tIO<br />\nBoys' einits, according to size 1.00, 1.25 and 1.50<br /><br />\nM. BERNSTEIN &amp; CO.<br /><br />\nCLOTHES MADE TO ORDER.<br /><br />\nLosnoN —A mEstosN<br /><br />\nThe illustrations show how the clothes we make fit<br />\nand look—the wear you'll learn about later.<br />\nThe light overcoat is ae especiat I y snappy garment,.<br />\nThe sack suit is cut after the very newest pattern.<br />\nThe winter overcoat. is as swagger as the dressiest<br />\nman could wish.<br />\nWe make all other proper styles, of course; (Irene<br />\ncutaway, double-breasted, four-button sack and<br />\nNorfolk suits.<br />\nYou can now have first pick of our first pick of<br />\ncloths.<br />\nPrices are low —we never learned to charge too<br />\nmuch. We would like to ;nuke your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style and a perWorkmanship<br />\nlit.<br />\nwill be the best you oversaw.<br />\nfect<br />\nYour money back if you are dissatisfied.<br /><br />\n_TAILORS<br /><br />\nAND<br /><br />\nIMPORTERS...<br /><br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that. lit well, look well and wear<br />\nwell, that's very important.<br />\nThe most fastidious man can find nothing to growl<br />\nabout our Kann\"<br />\ntS.<br />\nThe same attention<br />\nis given to the man that is less<br />\nParticular, it's'bur way.<br />\nWe are prepared to show you a large line of imported woolens, which does not cost any more than<br />\nthe domestic.<br />\n\"SEE US BEFORE BUYING\"<br />\n126 NONTI i itTA\\A' S'I‘121]1..:T.<br />\n(Second door above Joel Outman &amp; Co.).<br /><br />\nM. BERNSTEIN Lcc CO.<br /><br />\n126 N. Eutaw St.<br /><br />\nSEE OUR PRICE LIST FOR CLEANING, DYEING AND ALTERING.<br /><br />\nDrovers Sr Mechanics Nat'l Bank,<br /><br />\nSTIEFF PIANOS<br /><br />\nOF BALTIMORE, MD.<br />\nCAPITAL STOCK, $300,000.<br /><br />\nMA DE OP TB IC HEIST M A rrliRtIA I.4 A1ON FY<br />\nAND EXPERINNCEI (JAN<br /><br />\nHUY.<br /><br />\nSURPLUS AND PROFITS. $375.000.<br />\n(''Transacts a General Banking Business.<br /><br />\n9 N. LIIIEWJP'V ST.<br />\n_<br />\n•<br /><br />\nWARHHoonoo<br /><br />\nGUSHING Sr GOMPANY, Booksellers andStioers.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br /><br />\n&amp;<br /><br />\nPROFS. G. W. LEHMAN<br /><br />\nSON.<br /><br />\nFOR<br /><br />\n34 W. BALTIMORE STREET.<br />\nSchool, Law. Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\n#<br />\n#<br />\nCollege of Baltimore.<br />\nSTATIONERY For School, Familg, Office and Bank.<br />\n_<br />\n—<br /><br />\nHaberdashers,<br />\nShirts, Neck• wear,Underwear<br />\nHosiery, etc.<br />\n111111•11111•1111•111•11•1111<br />\nSHIRTSTO ORDER A SPECIALTY.<br /><br />\nTHOS.BLAKE CO<br /><br />\nJOIlDfiN STABIDEll GO.<br /><br />\no t)<br />\n;<br />\n51 I.<br />\nA<br />\nM A714:11.411<br /><br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy—no adulterants. no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar- -natural eider vinegar, strictly pure and<br />\nstrong.<br />\nSir Oround Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\nOn dale The .1. II. II. Pennants, and all other College<br /><br />\nPennants.<br /><br />\nIlgenfritz Studio<br /><br />\n219 EAST BALTIMORE ST.<br /><br />\ntillecOSsor to CUMMins.<br /><br />\nA<br /><br />\nH. FETTING,<br />\nMANUFACTURER<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\nOF<br /><br />\nGreeli Utter fraternity jewelry,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nefore 'IPurchaeing.<br />\nplait'. Call ants 'Examine our iin<br /><br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC. 6L<br /><br />\np. telephone<br /><br />\nLibraries arranged and put in<br />\norder without removal. Of if<br /><br />\nJENNINGS ‘.4:d lIORSEY,<br /><br />\nRUZICKA<br /><br />\nMP.110.311 A N'I` TAILORS,<br /><br />\n21 W.<br /><br />\nfrA Yr FIVE'<br /><br />\n445-v.<br /><br />\nIC rir.<br /><br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, Sold and<br /><br />\nBookbinder,<br />\nI. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br /><br />\nTHEO. WARNER<br /><br />\nJAMES R. PAINE.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br /><br />\nPIPPEN'S F30011 STORE,<br />\n605 N. EUTFIrW ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br /><br />\nAgents i'or Lincoln Sz Bennett and<br />\nWalter Barunrd's London Hats.<br />\n324 WEST B A LTI MORE STREET.<br />\na.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 407- /Top<br /><br />\nI ii s Gaps<br /><br />\nNORTH GERM LLOYD S. S. GO.<br />\nCABIN PASSRGE fkl- LOW<br /><br />\nNew York to Bronco, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBALTIMORE TO BRE,MEN DIRECT.<br /><br />\nfl. SGHUMAGHER Sr GO., General<br /><br />\nFor particulars apply to<br /><br />\nRunts.<br /><br />\n.JAS. MEIKLE, Vicc..Pnxer.<br />\nISAAC H. DIXON, PREST.<br />\nJAS. R. RICHARDs, TIREAS<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br /><br />\nSmith Dixon Co.<br /><br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\n'Baltimore, Md.<br /><br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36241, "display": null, "description": null, "target_type": "file", "target_uuid": "401b91a5-f320-4a80-9cf8-9395b3d55597", "url": "http://digital.library.jhu.edu/system/files/2022-03/12222-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12222, "target_type": "node", "target_uuid": "2e81a25e-3673-47ec-9fe2-b1327a02ec3f", "url": "/node/12222"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9e5d2d7a-502c-4d93-8cb2-27461af83e0f"}]}