{"mid": [{"value": 38101}], "uuid": [{"value": "939f2c17-3c79-4e12-98d1-0eb7c93f3a5c"}], "vid": [{"value": 38101}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:47:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12668-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:47:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:47:55+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\n3J- oiIns /*whim NriusiErttrr<br />\n<br />\nVol. XL—No. 18<br />\n<br />\nMiss Shriver Is<br />\nDance Sponsor<br />\nAfter Firebrand<br />\nMd. Casualty Auditorium To<br />\nBe Scene Of Barnstormer<br />\nPlay On December 14<br />\n<br />\nSkit Presented<br />\nBarnstormers Playlet Given<br />\nAt Assembly Yesterday To<br />\nSophomores And Frosh<br />\nMiss Molly Shriver is the sponsor<br />\nof the dance, following the play, The<br />\nFirebrand, which will be presented<br />\non Saturday, December 14, in the<br />\nMaryland Casualty Auditorium. Music will be supplied by the \"Ramb-<br />\n<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, DECEMBER 6, 1935.<br />\n<br />\nZierler Elected Editor<br />\nOf'News-Letter' By Staff<br />\nKenneth Zierler, president of Pi<br />\nDelta Epsilon, honorary journalistic fraternity, was elected editor-in-chief of the NEWS-LETTER at<br />\na meeting of the combined editorial and business staffs of the<br />\npaper last Tuesday before the<br />\nThanksgiving holidays.<br />\nHe defeated Irving Leberfeld, who also<br />\nwas nominated for the office by<br />\nthe Board of Control.<br />\nRemaining as advisory editor of<br />\nthe NEWS-LETTER, Jesse Borden,<br />\nretiring editor-in-chief, will be an<br />\nex-officio member of the Board of<br />\nControl.<br />\nAnnouncement was made that<br />\nthe Editorial Board will be dissolved, to centralize the policy of<br />\nthe paper.<br />\nAt the same meeting, Dave Caplan and Bernard Pinck were elected sports editors.<br />\n<br />\nlers.\"<br />\n<br />\nDecember 18 Date<br />\nOf 2nd Gymboree<br />\n<br />\nSEE<br />\nEDITORIALS<br />\nON PAGE 2<br />\nPrice<br />\n<br />\nFive Cents<br />\n<br />\nCompton Treats Cosmic Rays<br />\nDr. Ames Reports Norman<br />\nIn First Dohme Talk Tuesday Definite Success<br />\nSpeaks<br />\nGives Comprehensive Survey Of Cosmic Rays Before Large Of J.11. U. Purposes<br />\nAudience; Won Nobel Prize In 1925; Dohme<br />\nHimself Introduces Speaker In Remsen<br />\n<br />\nAngell<br />\nToday<br />\nOn World Peace<br />\nFor<br />\n<br />\nCongratulates Trustees<br />\nSelection Of Dr. Bowman; To Point<br />\nOut Conditions<br />\nDefines J. H. U. Purposes<br />\nThat Will Lead To War In<br />\nIn the annual report of the PresiThis Peace-Loving World<br />\n<br />\nInaugurating the 1935-1936 season<br />\n\"The subject of cosmic rays origiof Dohme lectures, Mr. Dohme himnated at the beginning of the presself<br />\npresented<br />\nthe<br />\ndistinguished ent century with C. T. R.<br />\nWilson's<br />\nAmerican<br />\nphysicist,<br />\nArthur<br />\nH. experiments with conductivity of<br />\nair. dent, recently published, Dr. Joseph<br />\nCompton, from the University of<br />\nThe study progressed at various S. Ames recorded his last suggesChicago, to a capacity audience in<br />\nstages through certain discoveries in tions and criticisms as president of<br />\nRemsen 1, last Monday afternoon.<br />\nthe field of radioactivity, through the Hopkins, and at the same time<br />\nDr. Compton, one of the world's<br />\nthe discovery of the increase of con- congratulated the Board of Trustees Enjoyed Brilliant Journalistic<br />\nleading authorities on cosmic rays,<br />\nductivity of air at high altitudes and on the selection of Dr. Isiah BowCareer; Author Of \"Great<br />\nspoke on that subject, approaching<br />\nthe subsequent linking up of this man as his successor.<br />\nit from two sides, the properties of<br />\nIllusion\" Is A Knight<br />\nto cosmic rays until recent years,<br />\nWriting of the success of the Hopthe rays, including their origin, nawhen a great many physicists, kins in fulfilling<br />\nits underlying purA renowned observer of internature, and uses to man.<br />\nspurred on by the work of Robert poses, he states:<br />\nStressing the complexity of the<br />\ntional affairs will treat the timely<br />\nA. Millikan, have spent a great deal<br />\n\"It is not easy to suggest tests<br />\ncosmic ray problem and the relatively<br />\nsubject of Peace when Sir Norman<br />\nof time in various experiments.<br />\nby which it can be decided whether<br />\nsmall program yet made in that<br />\nAngell speaks today at 4 P. M. in La\"Discovery that the rays form one the University<br />\nis performing its funcfield, the speaker dwelt at length<br />\nof the most important types of energy tions properly or<br />\ntrobe<br />\n112, endeavoring to answer the<br />\non various phases of the subject.<br />\nnot. Certainly such<br />\nin the universe, energies varying tests as number<br />\nof students, hours question \"Why Does A World DesirAccording to him, the present theofrom particles with one billion elec- per week devoted<br />\nto class work by ing Peace Get War?\" The noted<br />\nries concerning the rays, claim that<br />\ntron volts to others with one thou- faculty or<br />\nstudents and so on have British author<br />\nthey originate at a point in interof The Great Illusion<br />\nsand billion volts has led to the de- little to do<br />\nwith the matter. The<br />\nstellar space at about 100 billion<br />\nwill talk under the auspices of the<br />\nmagnetism of the earth, high ener- success of<br />\nthe University, which in<br />\nlight years from the earth and after<br />\ngies in electrodynamics and the fea- my judgment<br />\nis definite, has been George Huntington Williams Memotraveling through the ether strike<br />\ntures of the universe billions of light assured in<br />\nthe past and will be rial Lecture.<br />\nthe earth uniformly from all sides.<br />\nyears in the past together with the assured in<br />\nthe future largely by the<br />\nAs to the manner in which they are<br />\nStopping here as a part of a short<br />\nsire for their use in the study of the attitude of<br />\nmind of the faculty and tour of the United<br />\nproduced, there exist conflicting<br />\nStates, the disthe nuclear of the atom.\"<br />\nthe spirit of devotion to the ideals<br />\nideas, he stated. Millikan, who has<br />\ntinguished British authority returns<br />\nexperiments to the breaking up of of the University<br />\nwhich permeate<br />\ndevoted years of study to the subto the scene of many years of his<br />\nSlides Illustrate Lecture<br />\nthe whole institution.<br />\nThe underject, attributes there rays to an<br />\nearly<br />\nlife as a prospector and rancher<br />\nDr. Compton closed the lecture, lying thought. naturally, is freedom<br />\natomic nuclear process of the buildof<br />\nthought<br />\nin<br />\nand<br />\nthe<br />\nwhich<br />\naction<br />\nwas illustrated by lantern<br />\nWestern States. Sir Norman<br />\nupon the part<br />\ning up of matter in space, while<br />\nProfessor Franck of the Hopkins slides, again bringing out the broad- of both students and faculty, and was born in 1874 and was educated<br />\nfaculty conceives them as a result ness and complexity of the mystery relief of the faculty as far as pos- by private tutors and later in France<br />\nof the formation of potential differ- of the cosmic ray and ventured the sible from administrative duties, and attended the Lycee of Paris.<br />\nences through the accumulation of thought that twentieth century phy- in fact from all duties except those<br />\nAfter spending some time in the<br />\ncharges of electric fields by the ex- sics was just beginning an immense- connected with their academic po- United States, Sir Norman returned<br />\nplosion of novae, which are new born ly long and difficult job with a goal sitions.\"<br />\nto Europe to be launched on a brilstars, he added. There are a num- important both for its own end and<br />\nDefines Purpose<br />\nliant journalistic career as an Amerber of other theories also prevalent, as a step in a further task. Man in<br />\nPreviously he defined the Univer- ican. correspondent.<br />\nHe achieved<br />\nbut nothing very definite is known struggling infinitely slowly, but none sity's purposes in saying:<br />\nfame in this capacity and continued<br />\nthe less surely to grasp another link<br />\nat present, the speaker continued.<br />\n\"The question which must be his success as a member of the Paris<br />\nin the endless chain which bears the raised constantly by the President<br />\nOrigin Of Cosmic Rays<br />\nin Daily Mail. Then he was promoted<br />\nDealing with the origin of the key to the fascinating riddle of our consultation with the faculties and to the editorship of Foreign<br />\nAffairs.<br />\nuniverse and of ourselves.<br />\nrays, the lecturer stated:<br />\nthe Board of Trustees is that of the<br />\nAuthoring many books on interna-<br />\n<br />\nBritain On U.S.Tour<br />\n<br />\nRepresentatives .of the Barnstormers Club presented a skit at the assembly entitled<br />\nThe<br />\nLighthouse<br />\nKeeper's Daughter. Those taking<br />\npart were B. Murphy, Weiss, Prager, 0. D. K. Sponsoring Annual Affair<br />\nAt The Gym; MacGill Urges<br />\nBranower, and Halle. Before the enLarge Attendance<br />\nactment of the skit Zenas Sears explained the story and setting of the<br />\nThis Gymboree is under the sponplay, which is laid in the Duchy of<br />\nFlorence where the Medici held soring of 0. D. K. and the direction<br />\npower. The action centered about of the<br />\nAthletic Department. John<br />\nthe love affairs of Cellini, a sculptor.<br />\nMacGill, president of the Student<br />\nHe stated:<br />\nActivities Committee, issued the folThe Firebrand will be without a lowing statement:<br />\ndoubt one of the best the Barnstorm\"The Gymboree last year was<br />\ners have ever presented. Hard work<br />\nvery successful, and we hope to make<br />\nby all staffs has done its part to<br />\nmake it a success. Your support will this year's event more successful. I<br />\nurge you all to attend and bring<br />\ndo the rest.\"<br />\nyour dates with you so that this<br />\nPutting the final touches to the<br />\nmay become one of the main social<br />\npreparations for the coming production, The Firebrand, next Saturday events of the year. In order to make<br />\nnight, the three staffs of the Barn- this even more a social event, the<br />\nstormers have literally been working fraternities are being urged to have<br />\nday and night to have everything let- parties following the Gymboree.\"<br />\nter-perfect by the time the curtain<br />\nElaborate Program<br />\nrises.<br />\nThe elaborate program will in<br />\nunderlying purpose of the University. tional conditions, Sir Norman is best<br />\nThe cast has been working for sev- elude two exhibition boxing matches,<br />\nThe Johns Hopkins University has known as the writer of the Great<br />\neral weeks under the tutleage of Mr. two or threet wrestling exhibitions,<br />\nbeen distinguished from its founda- Illusion, which has been translated<br />\nPaul Hinrichs, who is coaching his tumbling, perhaps<br />\nby a professional,<br />\ntion by its attention to this matter, in most of the countries of the world.<br />\nfirst Barnstormer play, although he<br />\ngroup fencing, and a grand finale in<br />\nand by its constant attempt to con- In 1931 he was knighted by the Brit(Continued on Page 3, Col. 6)<br />\nthe form of a Varsity vs. Alumni<br />\ncentrate upon its purpose.<br />\nUlti- ish monarch for his contributions to<br />\nbasketball game.<br />\nPete Reynolds,<br />\nmately this is two-fold; first, to pro- civilization.<br />\nFritz Stude, and Opie Chancellor will<br />\nvide opportunities for the individual<br />\nbe among the Alumni. Tleere will<br />\nmembers of its faculties to extend<br />\nalso be a badminton match between Medal Advanced For Paper Hopkins, Phi Psi, Wins Vice their investigations and studies into<br />\nFrank Roberts, Number One man<br />\nPresidency; J. Harrington certain fields of inquiry, and second,<br />\nOn Sewerage Works Built<br />\nof Mt. Washington, vs. Jimmy Bento prepare students anf teachers in<br />\nBeats Kempton For Post these fields. Education of a large<br />\nIn The City Of Columbus<br />\nson.<br />\nThe inimitable \"Rube\" Baer<br />\nwill be among the performers.<br />\nnumber of students has never been<br />\nThe Rudolph Henry modal has<br />\nRobert Ward, a pledge to Delta<br />\nTickets for the second annual<br />\nits purpose. Its students, in all stages<br />\nClergyman And - Educator Gymboree, to be held at the Gym been awarded to John H. Gregory, Upsilon fraternity and a student in<br />\nof their studies, advanced and otherWill Address Group In Wednesday, December 18, at 8:15 professor of civil and sanitary en- the School of Engineering, after a wise, are brought into contact with Major Bonamy Dobree, 0. B. E.,<br />\nnoted British lecturer and literary<br />\nLevering Hall At 6 P. M. P. M., are now on sale at $.40 per gineering at the Johns Hopkins Uni- long and hotly contested campaign, this spirit of the institution. It is critics,<br />\nwill deliver the Tudor and<br />\ncouple and $.25 stag.<br />\nversity, in collaboration with Orris was elected last Tuesday to the presi- true that degrees of various kinds<br />\nStuart<br />\nClub<br />\npublic lecture next WedDr. Thomas Guthrie Speers, wellThe following students are hand- Bonney, Sewerage Relief Engineer; dency of the freshman class over including the Bachelors' degree are<br />\nnesday, December 11, at 5 o'clock in<br />\nknown clergyman and educator, will ling the pasteboards: John MacGill, Robert A.<br />\ngiven,<br />\nbut the fundamental idea of<br />\nAllton, Sewage Disposal Arty O'Keefe, a Phi Psi pledge and<br />\nLevering Hall on the topic, \"Milton<br />\naddress the University Supper Club Meade Johnson, L. Emrnart, D. Levy,<br />\nthe institution is that it is open to<br />\nEngineer, and the late R. H. Simp- an A. B. student. Ward was the sole<br />\nand Dryden: A Comparison and a<br />\non an unannounced subject on the R. Levi, B. Murphy, T. Dukehart, J.<br />\nD. U. candidate for president of any students of all stages of development Contrast in Poetic Idea and Poetic<br />\nnight of Tuesday, December 10, at Bradford, R. Glanz, B. Pinck, S. son, ChieS Engineer, of Columbus, of the classes to win the toga. Last who are competent and desirous of<br />\nMethod.\" Baltimore; is one of the<br />\n6 P. M. in Levering Hall.<br />\nPrager, H. Severn, W. Hazlett, W. Ohio, for their paper entitled \"In- year three of the class presidents making progress in certain lines of cities Major<br />\nDobree is visiting on a<br />\nstudy, and formalities such as ex- tour of the United<br />\nDr. Speers, who speaks at the third Erlanger, M. Harmel, N. Soifer, H. tercepting Sewers and Storm Stand- were D. U.'s.<br />\nStates.<br />\nrequirements have been<br />\nmeeting of the club, will probably Maulsby, P. Umbarger, R. Watkins, by Tanks at Columbus, Ohio.\" The<br />\nThe vice-presidency of the class pressed by<br />\nAuthor of \"Restorative Comedy\"<br />\nbe introduced by Theodore Wiehe, F. Beehler, K. Zierler, W. Kempton, paper is descriptive of important went to Harry Hopkins, a student in reduced to a minimum. This policy and \"Restorative<br />\nTragedy,\" and a<br />\nR. Ward, J. Royster, E. Donnelly, B. sewerage and sewage treatment<br />\nmakes an institution which is quite number<br />\nchairman of the Supper Club.<br />\nthe College of Arts and Sciences<br />\nof other works dealing with<br />\nSpring,<br />\nS. Finkel, I. Gertman and<br />\nunlike the general type of college or the literature<br />\nThe speaker, who is a member of<br />\nof the late seventeenth<br />\nworks recently built by the City of and a pledge to Phi Psi, who defeatuniversity. It is quite impossible to century,<br />\nthe Presbyterian Board of National M. Kempton.<br />\nMajor Dobree was formerly<br />\nAlpha<br />\nChesley,<br />\nJohnny<br />\nDelta<br />\nPhi,<br />\ned<br />\nColumbus as a part of a comprehencompare the work of The Johns Uni- professor of English<br />\nMissions, was born in New Jersey.<br />\nat the Egyptian<br />\nsive program of river cleansing that an engineer. Cy Treib, a Phi Sig versity with that of other institutions<br />\nUniversity in Cairo and is a Fellow<br />\nAfter graduating from Princeton Finkel Wins Old Gold<br />\npledge, was elected secretary over<br />\nis being carried out by the city.<br />\nby any of the ordinarily accepted of the Royal Society of Literature.<br />\nUniversity in 1912 with Phi Beta<br />\nJoe Bowersox, Tau Alpha Phi, while<br />\nContest; Safier Second<br />\nMedal Awarded Annually<br />\nstandards or tests. The University In 1925 he lectured at the London<br />\nKappa honors, he received his B. D.<br />\nJohn Blucher, a Kappa Sig, took the<br />\nIn 1924 the Rudolph Hering medal<br />\nwill, I hope, never cease to consider University. He graduated from Camat the Union Theological Seminary<br />\ntreasurership from Abner Golden,<br />\nStanley Finkel, a sophomore in the was<br />\ninstituted and endowed by the<br />\nown problems in its own way, bridge University, receiving his masits<br />\nin 1916. He later obtained his D. D. College of Arts and Sciences, won<br />\nPhi Alpha neophyte. Bob McCarthy<br />\nSanitary Engineering Division of the<br />\n(Continued on Page 3, Col. 5)<br />\nter of arts degree in 1926.<br />\nat Wooster College in 1935.<br />\nof S. P. E., defeated Harold Ricards,<br />\nfirst prize in the score-guessing con- American Society<br />\nof Civil EngiIn Field Artillery<br />\na Kappa Sig, for sergeant-at-arms.<br />\nHe married Miss Elizabeth Thach- test sponsored by P. Lorillard & Co., neers, and open to the award<br />\nof hte<br />\nOfficer<br />\nSoph<br />\nMeeting<br />\ncigarGold<br />\nmanufacturer<br />\nOld<br />\nof<br />\nBefore<br />\ntaking an absorbing inters<br />\ner in 1926 and has three children.<br />\nJimmy Harrington, Beta pledge,<br />\nmedal are all original papers which<br />\nest in literature Major Dobree held<br />\nIn 1915 he went to the Near East ettes. The $10 prize for guessing deal with any branch of Sanitary was the victor for the position of<br />\nAll Sophomore Class officers are a commission in the Royal Field Arwith Dr. Robert Spear. In 1916 he nearest to the scores of the Hopkins- Engineering and which are present- freshman representative to the Stuexpected to attend the meeting called tillery and served during the World<br />\nHaverford<br />\nCaliforSouthern<br />\nand<br />\nthe<br />\nbecame assistant and associate mined to the Society in finished form. dent Council, beating by a small<br />\nby John Royster, president of the War in France and with Allenby in<br />\nister of the University Place Pres- nia-Notre Dame /football games will It is intended that the award of the margin Murray Kempton, an Alpha<br />\nclass of '38, to be held Tuesday, Dec. Palestine. He matriculated at the<br />\nbe awarded to Stan in the near fu- medal<br />\nbe made annually and to the Delt and a member of the NEW:byterian Church in New York City.<br />\n10, in Levering Hall, at 12:30 P. M. Royal Military Academy in Woolture.<br />\nauthor or authors of that paper LETTER staff. For this post there were<br />\nDuring the World War he was<br />\nThis includes Jacobs, Christ, Coun- wich and was commissioned in 1910.<br />\nSecond prizes went to Sigmund Sa- which contains the most valuable originally<br />\nfive candidates.<br />\nchaplain in the 102nd Infantry in<br />\nselman and Clautice. Class plans for<br />\nFollowing his address Major Dofier, who will receive $5. T. W. Haz- contribution to the increase of knowFrance.<br />\nHis fine service was rethe coming year will be discussed.<br />\nbree, who is at present making a<br />\nlett and Charlie Gaw secured the ledge in, and to the advancement of,<br />\nwarded with the Distinguished Sertour of the United States, will be<br />\nthird and fourth awards, of two and the sanitary branch of the Engineer- Leber Will Represent Y<br />\nvice Cross and Croix de Guerre. On<br />\ntendered a dinner by the Tudor and<br />\none cartons of cigarettes, respec- ing profession. Since the endowment<br />\nConventi<br />\nIndiana<br />\non<br />\nAt<br />\nSenior Pictures Tuesday<br />\nhis return in 1919 he became asso- tively.<br />\nStuart Club at the Southern Hotel.<br />\nof the medal in 1924, it has been<br />\nciate pastor of the First Presbyteradition to the active members,<br />\nIn<br />\npresident<br />\nHenry<br />\nLeber,<br />\nH.<br />\nof the<br />\nDave Levy, business manager of awarded only twice, in 1927 and in<br />\nPhotographic Editor Nat Soifer<br />\nran Church, New York City, with<br />\nthe Baltimore alumni of the group<br />\nHopkins Y. M. C. A., is heading a<br />\nthe NEWS-LETTER, and Robert Wat- 1931.<br />\nannounced Wednesday that picDr. George Alexander and Dr. Harry<br />\nwill assist in honoring the Englishgroup of delegates from the Johns<br />\nkins, advertising manager, judged<br />\nHonored For Third Time<br />\ntures of seniors will be taken for<br />\nEmerson Fosdick. He left this posi- the contest.<br />\nman.<br />\nHopkins Y. M. C. A., is heading a<br />\nthe Hullabaloo starting Tuesday<br />\nThis is the third time that Profestion in 1928 to become pastor of the<br />\ngroup of delegates from the Johns<br />\nand continuing tip-sough Friday.<br />\nsor Gregory has been honored by the<br />\nBrown Memorial Presbyterian Church<br />\nHopkins University attending the<br />\nMayer Talks On Germany<br />\nTo<br />\nNotices will be in the postoffice<br />\nsociety.<br />\nLecture<br />\nIn<br />\nEngland<br />\nIn<br />\n1910<br />\nhe<br />\nwas<br />\nawarded<br />\nthe<br />\nof Baltimore.<br />\n12th Quadrennial Convention of the<br />\nThomas Fitch Rowland Prize for his<br />\nboxes for appointments. FraterStudent Volunteer Movement to be<br />\nDr. Speers is also active as a trusDr. Joseph Mayer, Associate ProProfessor H. S. Jennings, head of paper entitled \"The Improved Water<br />\nnity pictures must be taken on<br />\nheld in Indianapolis from December<br />\ntee of Princeton University, Gouch- the Department<br />\nfessor<br />\nof Chemistry at the Johns<br />\nand<br />\nSewage<br />\nof Zoology in the<br />\nWorks of Columbus, 28 through January 1.<br />\nMoilday, December 9, any time<br />\nAccompanyer College, The Union Memorial School for Higffer<br />\nHopkins Uniersity, will today address<br />\nStudies, has been Ohio,\" and in 1930, in conjunction ing<br />\nbetween<br />\nA.<br />\n9<br />\nM. and 9 P. M. These<br />\nLeber are Dr. E. A. Schaal, exea meeting of the International LunchHospital, the Presbyterian Eye, Ear appointed a visiting professor at with C. B. Hoover and C.<br />\nB. Cornell, cutive secretary of the Y. M. C. A.,<br />\nare individual pictures and everyeon Group in Leevring Hall. In his<br />\nand Throat Charity Hospital, and Cambridge University in England, was awarded The<br />\nJames Laurie Huntley Lloyd, and John Bamberber.<br />\none must pay his dollar when the<br />\ntalk, Dr. Mayer will discuss his exthe Maryland Training School for where he will lecture for the remain- Prize for their paper<br />\nentitled \"The More students are expected to swell<br />\npicture is taken.<br />\nperiences in Germany during the past<br />\nColored Girls.<br />\nder of this year.<br />\nO'Shaughnessy Dam and Reservoir.\" the group representing<br />\nthe local \"Y.\"<br />\nsummer.<br />\n<br />\nSpeers Speaks<br />\nTo Third Supper<br />\nClub Tonight<br />\n<br />\nRudolph Herring Ward Elected Head<br />\nMedal Awarded To Of Freshman Class<br />\nProfessor Gregor) After Heated Battle<br />\n<br />\nMilton, Dryden<br />\nTopic Of Speech<br />\nBy Major Dobree<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 6, 1935<br />\n<br />\nMbe ilewslisetter<br />\n<br />\nthe Hopkins chapter of the N. S. L. tends toward radical leadership; and, as such, it defeats its own purpose.<br />\nThe purpose of the N. S. L. is not the propagation of<br />\nFounded 1897<br />\nany single idea—the practice of the little-read but muchmaligned Marxian principles, for example put the carSubscription per year<br />\n$2.00<br />\nrying out of its platform. At least it should be. But,<br />\nBy Mail<br />\n$2.50<br />\nas matters stand, it is quite evident that the N. S. L.<br />\nis proceeding along the line of a single idea, and frightRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Postoffice, Johns Hop- ening out all other ideas.<br />\nkins University.<br />\nThis seems to be an unfortunate circumstance. Here<br />\n<br />\nIntercollegiates<br />\n<br />\nVIEWS AND REVIEWS<br />\n<br />\nCharles Hudson, Emory University<br />\nstudent, spent three days in a hypnotic trance recently when a psychology professor who had hypnotized<br />\nhim for demonstration purposes was<br />\nunable to bring him out of the trance.<br />\nDuring this time, Hudson walked<br />\nand rode to the movies. At the end<br />\nof three days he suddenly blinked<br />\nhis eyes and asked what had happened about the campus.<br />\n•<br />\n*<br />\n<br />\nKEITH'S<br />\nBill Robinson, cast as Rogers'<br />\nIf I Had A Million, with an all- friend, goes through a number of his<br />\nstar cast is now playing at Keith's tap dances during the picture.<br />\n<br />\nEntered as second-class matter December 3, 1909, is a body, with a platform not essentially radical, in<br />\nat the Postoffice in Baltimore, Md., under the Act of the hands of a suggestively radical membership. These<br />\nare problems of vital interest to us as those who will<br />\nCongress, November 3, 1879.<br />\nbecome the thinking members of society. As leaders<br />\nPublished semi-weekly from October to June, ex- we will have to consider problems of national<br />\nand incept during examination and college holiday periods ternational—and yet<br />\nTen times as many students are<br />\npersonal—import. Still, here we<br />\nby undergraduates of the Johns Hopkins University.<br />\nnow using their college libraries as<br />\nare, letting a tiny group do nearly all the thinking.<br />\ndid in 1925.<br />\nThere is no use arguing that the problems the N.<br />\n*<br />\n*<br />\nEDITORIAL DEPARTMENT<br />\nS. L. discusses don't have any significance for us. There<br />\nKenneth Zierler<br />\nA professor at the Los Angeles<br />\nEditor-in-Chief<br />\nis a bird that is supposed to hide its head in the sand<br />\nJunior College was having trouble<br />\nIrving Leberfeld<br />\nManaging Editor<br />\nto escape from very real danger. But the ostrich never<br />\nkeeping his class quiet. Finally, in<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nwent<br />\nto<br />\ncollege.<br />\nAssistant Managing Editors<br />\nexasperation, he shouted, \"Order,<br />\nDavid Caplan<br />\nAssistant Sports Editor<br />\nIt is a virtual necessity that a campus of the Hop- please.\"<br />\nEdgar Kemler<br />\nFeature Editor<br />\nkins' intellectual level should have some outlet where<br />\n\"Hot beef sandwich,\" came an abHarold Kropman, Jack Stein, Sidney Green,<br />\npeople concerned with doing away with racial preju- sent-minded voice from the rear of<br />\nColumnists<br />\ndices and people concerned with abolishing war and the room.<br />\nJesse N. Borden<br />\nAdvisory Editor<br />\n* * *<br />\npeople concerned with menaces to academic frpedom<br />\nEDITORIAL STAFF<br />\nand so on could all get together and exchange ideas<br />\nWhen Skracuse University was in<br />\nBernard Pinck, Sigmund Safier, Max Iskowitz,<br />\nand accomplish something.<br />\nits infancy the tuition was only $20<br />\nNathaniel Finkelstein, Murray Kempton, Wetha term.<br />\nIn<br />\nother<br />\nwords,<br />\nwhat<br />\nwe<br />\nneed<br />\nis<br />\nsomething<br />\nbroader<br />\nered Barroll, Jr., Isadore Gertman, Jewett<br />\n* * *<br />\nthan the N. S. L. There is no use suggesting that these<br />\nGoldsmith, Leonard Jaffe, Red Glantz, Lester<br />\nThe<br />\nYale-Harvard<br />\nClub of Lon:don<br />\npeople—these<br />\nnon-radicals<br />\n--join<br />\nthe<br />\nN.<br />\nS.<br />\nL. as a means<br />\nCaplan, Howard Reizenstein, Julian Adler.<br />\nof finding expression. The very connotation of those arranged to have the Yale-Harvard<br />\nthree letters is so restrictive that a broad group would game transmitted to them by cable.<br />\nBUSINESS DEPARTMENT<br />\nAfter a hearty dinner, the club memnow be impossible within the N. S. L.<br />\nDavid H. Levy<br />\nBusiness kanager<br />\nbers divided into two camps and<br />\nRobert Watkins<br />\nAdvertising Manager<br />\nThus, as we see it, the best thing to do is to do away prepared to listen ot the game. But<br />\nRobert Levi<br />\nCirculation Manager<br />\nwith the N. S. L. and organize this broad group where the Western Union made a mistake<br />\nWilliam B. Kempton<br />\nOffice Manager<br />\nevery honestly interested person could voice his opin- and sent a different game. It was<br />\nMelville Locker<br />\n. Copy and Filing Manager<br />\nion and share in the action—an organization dominated not until the second half that the<br />\nby no single idea other than that of reaching intelli- right stadium was hooked up.<br />\nBUSINESS STAFF<br />\ngent decisions.<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\n* * *<br />\nN. Soifer, S. Tinley<br />\nStudents of Baylor University in<br />\nHere we would have pale liberals and pink liberals,<br />\nFriday,<br />\n<br />\nDecember 6, 1935<br />\n<br />\nVeritas Vos Liberabit<br />\n<br />\nradicals and reactionaries—reactionaries interested in Texas, have orgailized a traveling<br />\nthe success of some mutual topic exclusive of the rest. show in order to publicize their university.<br />\nVital subjects handled vitally.<br />\n* * *<br />\n<br />\nIt is usually required of an incumbent editor that<br />\nhe make his first editorial a promise of policy. We fall<br />\nin line, not because it is a custom, but because we want<br />\nWe must admit that we—and thousands of others—<br />\nto. We want everybody to know what attitude we will<br />\nare staring defeat in the face. It is now almost a virtake and how we will stand.<br />\ntual certainty that the United States will send a team<br />\nThis is our policy: \"Veritas vos liberabit.\" \"The<br />\nof young athletes to be indoctrinated at the Berlin<br />\ntruth shall make you free.\"<br />\nOlympics.<br />\nWe cannot foresee what problems win arise during<br />\nThat is what burns us up. Politicians at the head of<br />\nthe course of the year. But we can say that those that<br />\ndo come up will be approached with mind free from the American Olympic Committee have shoved us into<br />\na meeting room to hear Nazi speeches and read Nazi<br />\nprejudice—with a view of careful examination of all<br />\npossibilities, that present themselves—with intellectual posters and they have locked the door and barred the<br />\nexit. Then they smugly say, \"We dasn't mix politics<br />\nhonesty—with the Hopkins manner.<br />\nand athletics. Therefore, on to Germany.\"<br />\nOur guide we take from one whose every breath<br />\nThat has been their big argument. Keep politics<br />\nseems to have been drawn from the University—Dr.<br />\nout of the Olympics. That is our big argument, too.<br />\nJoseph S. Ames. Dr. Ames writes in his recently issued<br />\nWe don't regard this as a Jewish question. Racially, of<br />\nReport of the President—his last one: \"The success of<br />\ncourse,<br />\nGermany has stigmatized Jewish athletes. Rethe University, which in my judgment' is definite, has<br />\nbeen assured in the past and will be assured in the fu- ligiously, the Germans have warred on Catholic and<br />\nture largely by the attitude of mind of the faculty and Protestant as well as on Jewish athletes. Even more<br />\nthe spirit of devotion to the ideals of the University general, the Nazis require acceptance of their party's<br />\nwhich permeate the whole institution. The underlying bigoted ideology.<br />\nthought, naturally, is freedom of thought and action<br />\nWhat is the Nazi ideology? Here are some excerpts<br />\nupon the part of both students and faculty.\"<br />\nfrom a booklet written by Bruno Malitz, Sports Leader<br />\nThis is our policy: In our news columns, impartial of the Storm Troops, 32nd Brigade, Berlin Center. This<br />\n\"statemennt of what are facts to the best of our knowl- document, virtually official, was printed by National<br />\nedge; in our editorial columns, weighed analyses; but Socialist Library and was distributed free of charge to<br />\nall sports clubs and youth organizations in Germany.<br />\neverywhere our lead is truth.<br />\nIt is still on the Nazi Library preferred list:<br />\n<br />\nDefeated<br />\n<br />\nN. S. L.<br />\nThe most discussed body on the campus is the N.<br />\nS. L.—with all due respects to 0. D. K. The National<br />\nStudents' League is an organization that defies indifference. It makes you aware of its existence and it<br />\nforces you to be either with it or against it. There is<br />\nno third alternative, just as there is no third alternative in whether you are touched by one of the points<br />\non its platform or not.<br />\nConcerning the N. S. L. we feel that here is an<br />\norganization whose potentialities have been undeveloped<br />\nor have been developed along too narrow lines. Conskier for a moment the range of its activity:<br />\n<br />\nFor the Nazi, \"Politics belong in sports\" ...<br />\nWe Nazis see no value whatsoever in having<br />\nNegroes travel through Germany and meeting<br />\n\"our finest\" in competition ... You will ask us<br />\nnow, \"Don't you want any international games,<br />\nany Olympic games in the Nazi state?\" We answer, \"Yes; as a matter of fact, we consider<br />\nthem, due to international propaganda reasons,<br />\nas necessary<br />\n.\"<br />\n<br />\nStephens College, Missouri, offers<br />\na course in \"Artistic Loafing.\"<br />\n* .* *<br />\nA professor of Ohio State University rec'ently served tea and cakes at<br />\nthe end of an exam. His purpose was<br />\nto revive the students, we suppose.<br />\n* * *<br />\nI think that I shall never see<br />\nA poem as lovely as a red flag with<br />\na white dot<br />\nFlying from Packer Hall on Monday<br />\nsaying<br />\nThere is no drill for me.<br />\nLehigh Brown and White.<br />\n*<br />\n<br />\n*<br />\n<br />\nTheatre in Baltimore. This picture<br />\nAlso in the cast are Louise Henry,<br />\nwill play until next Wednesday night. Alan Dinehart, and Etienne Girardot.<br />\nIncluded in the cast is Gary CoopThe story was adapted from Chas.<br />\ner, Charles Laughton, W. C. Fields, T. Dazzey's play, by Sam Hellman.<br />\nGeorge Raft, Jack Oakie, Charles George Marshall was the director<br />\nRuggles, Mary Boland, May Robson, for this picture.<br />\nRichard Bennett, and Alison Skipworth.<br />\n<br />\nLITTLE<br />\nIf I Had A Million is a comedy<br />\nGeorge Arliss, in his latest picskit, returning by popular request.<br />\nture, Mister Hobo, is now occupying<br />\nCharles Laughton, one of the lead- the screen at the Little Theatre.<br />\ning members of the cast, was born<br />\n<br />\nArliss portrays a new type of role<br />\nin Scarborough, England. Descend- in this picture, departing from his<br />\nant of a long line of hotel keepers, \"dandified\" characterizations, and<br />\nhe had two choices—hotel clerk or taking the part of an ordinary hobo,<br />\nnavy officer. He flunked his naval ex- tramping through the country.<br />\n<br />\nam, and became a hotel keeper. In<br />\n<br />\nArliss steps out of his hobo charthe World War, he spent five years acter for a Period, and becomes<br />\nas a private. After the war he spent Francois Rothschild, a noted and a<br />\nthe next five years in his father's prominent man. The end of the pichotel. He became interested in plays, ture, however, see him once again<br />\nand was well known on London in rags, and \"on the road.\"<br />\nstages.<br />\n<br />\nIncluded in this program is some-<br />\n<br />\nHis picture successes are Henry<br />\nthe Eighth, The Barretts of Wimpole<br />\nStreet, Ruggles of Red Gap, Les Miscrables, Mutiny on the Bounty, and<br />\nnow, If I Had A Million.<br />\n<br />\nthing very novel in the way of car-<br />\n<br />\nNEW<br />\nThe New Theatre is now showing<br />\non its screen the beloved humorist,<br />\nWill Rogers, in his last and best picture, In Old Kentucky.<br />\nRogers' role In Old Kentucky is<br />\nthat of Steve Tapley, a horse trainer,<br />\nwho makes champions of colts,<br />\nfriends out of enemies, and brings<br />\nromance to estranged sweethearts.<br />\nThe drama of the picture arises out<br />\nof a feud between the families of old<br />\nCharles Sellon and Charles Richman.<br />\nRogers gets himself in and out of<br />\ntrouble trying to protect Sellon from<br />\nthe law, and trying to keep the Sellon-Richman romance from breaking<br />\nup.<br />\nThe feud between the two families<br />\nreaches its climax, when they enter<br />\ntheir horses in the Ashford stakes.<br />\n<br />\nBOULEVARD<br />\nCecil B. DeMille's motion picture<br />\nepic The Crusades, opens today at<br />\nthe Boulevard Theatre.<br />\nThe story concerns Richard Cour<br />\nde Lion, King of England, who goes<br />\nto the Crusades to release himself<br />\nfrom his obligation to marry Princess Alice of France. En route he<br />\nmarries Berengaria, Princess of Navarre. When the Crusaders reach the<br />\nHoly Land they find the Saracen<br />\nforces under their Emperor Saladin<br />\nare stronger than they had expected,<br />\nand their resistance checks the tide<br />\nof the invasion at Acre for many<br />\nweeks.<br />\nIn the cast are Henry Wilcoxson,<br />\nIan Keith, Katherine DeMille, Loretta Young, C. Aubrey Smith, Joseph<br />\nSchildkraut, and others.<br />\n<br />\ntoons.<br />\n<br />\nA new<br />\n<br />\nFrench<br />\n<br />\nanimated<br />\n<br />\nshort should attract a great deal of<br />\nattention and admiration.<br />\n<br />\n*<br />\n<br />\nMinnesota students read more<br />\nscandal items than general news<br />\nitems, a survey recently disclosed.<br />\n* * *<br />\nA professor at the University of<br />\nPennsylvania promised a quiz. The<br />\nnext day, noticing the sparely settled seats, he called the quiz off.<br />\nThereupon the door opened, and the<br />\nseats were rapidly filled.<br />\n* * *<br />\nThe Tower proves that she loves<br />\nyou:<br />\nGiven: I love you.<br />\nTo prove: You love me.<br />\nProof: I love you (given).<br />\nTherefore I am a lover.<br />\nAll' the world loves a lover (axiom).<br />\nYou're all the world to me.<br />\nTherefore you love me.<br />\n* * *<br />\nA staff announcer of QNOW recently sot up temporary microphones<br />\non the platform atop a new building<br />\nthat is going up on the University<br />\nof Texas campus. He was scheduled to interview the workmen from<br />\n4:15 to 4:45. He found himself left<br />\nalone by 4:30, the workers' quitting<br />\ntime.<br />\n* * *<br />\n<br />\nIf Mr. Brundage and General Sherrill think they can<br />\nkeep politics out of the Olympics by ignoring the protests of those who prefer the Olympic ideal and by having our athletes come back from Germany boasting<br />\nthat they were \"real chummy with Ad Hitler, Julie<br />\nStreicher, Ernie Roehm, Bill Goering, Rudy Hess, and<br />\nFour years of pullthg the wool,<br />\nI. For lowered tuition fees and a free college in<br />\nthe rest of the lads,\" then we must conclude that Mr. and there's your<br />\nsheepskin.<br />\nevery city over 100,000.<br />\nBrundage's and General Sherrill's reasoning powers<br />\n—Notre<br />\nDame Scholastic.<br />\n2. For academic freedom for all students and in- work backwards, to deal kindly with them.<br />\n* *<br />\nstructors.<br />\nAccording to an official bulletin.<br />\nBut, perhaps, they don't know what the Olympic<br />\n3. For abolition of all forms of compulsory religideal is. Baron Pierre de Coubertin, founder of the published by the Kansas State Norious services in colleges.<br />\nmal School in 1902, \"it would be a<br />\nmodern Olympic games, wrote:<br />\n4. For abolition of the R. 0. T. C.; against war<br />\nshame if any Teachers College stu\"The main issue in life is not the victory but the<br />\nand fascism.<br />\ndent should be arrested for riding a<br />\nfight: the essential is not to have won but to have fought<br />\nbicycle at a rate of speed exceeding<br />\n5. For full social and political equality for Negroes<br />\nwell. To spread these precepts is to pave the way for<br />\nthe lawful limit.\"<br />\nand other racial minorities.<br />\na more valiant humanity, stronger, and consequently<br />\n* * *<br />\n6. For unemployment insurance.<br />\nmore scrupulous and more generous. These words exAbsent-minded Dean (knocking on<br />\ntend across the whole domains and form the basis of the<br />\ngates of St. Peter)—\"C'mon open<br />\nHere are controversial problems.<br />\nSome of them a healthy and happy philosophy.<br />\nup here, or I'll throw the whole fradon't apply to the Hopkins particularly. But we can't<br />\n. \"The Olympic movement gives the world an ideal ternity out.\"<br />\nconceive of anyone who is not concerned with at least<br />\n—Wabash Caveman.<br />\none of those six points;—the fourth one, if nothing else. which reckons with the reality of life, and includes a<br />\n* * *<br />\npossibility<br />\nto<br />\nguide<br />\nthe<br />\nreality<br />\ntoward<br />\nthe<br />\nOlympic<br />\nWar strikes at everybody.<br />\nAd<br />\nin<br />\nthe<br />\nBerkeley<br />\nGazettes \"Lost:<br />\nIdea: 'Joie des muscles, culte de la beaute; travail<br />\nTo join a group with the range that the N. S. L.<br />\npour le service de la famille et de la societe; ces trois Strong box with five $1100 bills, gold<br />\nhas, a program need not be in accord with the rest on<br />\nand silver pieces. Value sentimenelements unis en un faisceau indissoluble.'<br />\nevery point. It is necessary merely that he be intertal.\"<br />\n\"May joy and good fellowship reign, and - in this<br />\nested in some one point. The organization should then<br />\n* * *<br />\nserve as a clearing house for problems of that nature. manner, may the Olympic Torch pursue its way through<br />\nAccording to the Notre Dame<br />\nTherein lies our quarrel with the N. S. L. Its mem- the ages, increasing friendly understanding among the Scholastic college graduates don't<br />\nbership is too restricted. It is colored by the more or nations, for the good of a humanity always more en- have to attend homecoming celebraless radical element whose presence has apparently thusiastic, more courageous and more pure.\"<br />\ntions to see their old classmates.<br />\nBruno Maltiz retorts:<br />\nscared off most of those who would like to manifest<br />\nThey hold reunions in front of emsome concern about one or more of the N. S. L.'s points.<br />\nployment agencies every few weeks.<br />\nFrenchmen, Belgians, Polaks, and Jew—<br />\n* * *<br />\nBut it just isn't done. Association with even one radiNiggers run on German tracks and swim in<br />\nThe<br />\ncal? Why, it's like undressing in public!<br />\nWoman's<br />\nClub of Temple UniGerman pools. Good money is thrown away and<br />\nWe can not share this apprehension. Our idea is<br />\nversity was founded by a man.<br />\nnobody can truthfully say that international<br />\n* * *<br />\nthat if we can get, without obligation, any assistance<br />\nrelationships between Germany and its enemies<br />\nin getting Something done we'd like to get done, we<br />\nMen<br />\nstudents<br />\nat the University of<br />\nhave been bettered.<br />\nOklahoma selected a committee to<br />\nwelcome it with no scruples attached.<br />\nThat gnashing of teeth you hear is Baron de Cou petition the city commissioners to<br />\nHowever, no matter what the reason may be, it is<br />\nrepeal the ban on hitch-hiking.<br />\nan established fact that the present membership of bertin struggling in his grave.<br />\n<br />\n.7<br />\n<br />\n•<br />\nAR above the clouds, on all the leading airlines, your<br />\npilot is always within hearing and speaking distance<br />\nof airports —via Western Electric radio telephone.<br />\n<br />\nF<br />\n<br />\nThis equipment, made by the manufacturing unit of the<br />\nBell System,is helping the airlines to set a notable record<br />\nfor fast,safe transportation. Teletype—another Bell System<br />\nservice — speeds printed weather information to airports.<br />\nLong Distance and local telephone facilities, too, play<br />\nimportant parts in airline operations.<br />\nBell System services reach out in many directions to<br />\nthe benefit of industry and commerce.<br />\nYou can \"fly\" home by telephone, in<br />\na couple of minutes. Why not do it<br />\ntonight? Station-to-Station rates are<br />\nlowest after 7P. M.<br />\n<br />\ntl<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., DECEMBER 6, 1935<br />\n<br />\nFaculty Signs Frosh Commission<br />\nProtest Against Answers Questions<br />\nU.S.In Olympics On World Problems<br />\n<br />\nTHIS COLLEGIATE WORLD<br />\n<br />\n3<br />\n<br />\nDr. Ames Reports Miss Shriver Is<br />\nDefinite Success<br />\nDance Sponsor<br />\nOf J.H.U. Purposes<br />\n<br />\nAlthough blind for 25 years, Perry actually ketch a star but as<br />\nyet it is<br />\nHale, Yale All-American in 1900, a impossibilty. They also<br />\nhave dishasnt missed a game since the day covered that the clouds are<br />\ncoming<br />\nthe doctor told him he would never down closer and that some<br />\nday we<br />\nmight actually be able to discover<br />\nAt a meeting of the Freshman see again.<br />\nMd. Casualty Auditorium To<br />\n(Continued from Page 1, Col. 5)<br />\n* * *<br />\njust what a cloud is composed of.<br />\nCommission held last Tuesday eveBe Scene Of Barnstormer<br />\nBoas, Lov<br />\n.ejoy, Berry, French ning, the members filled out a ques- Colleges and universities through- Q. What was Peter Lombard's and will not, I hope, be influenced<br />\nPlay On December 14<br />\ntoo much by what is done at other<br />\nthe United States expect im- theory of the universe?<br />\nJoin In Statement Issued tionnaire on highly controversial is- out<br />\nA. Peter Lombard thought the institutions. Its problems are its own<br />\nproved financial conditions during<br />\nAgainst U.S. Participation sues including some about Interna- the 1935-36 school year, according to earth was a sphere and that he had problems, and not those, as a rule, (Continued from Page 1, Col. 1)<br />\nhas had much previous experience<br />\ntional Affairs, and Capital and La- the department of interior.<br />\nabsolutely gone all over every point of other universities.\"<br />\nin<br />\nand<br />\nthat<br />\nhe<br />\nprofessi<br />\n* * *<br />\ncouldn't possibly be<br />\nbor and other important subjects.<br />\nonal stock companies.<br />\nThe president's duties were disUndergraduates at CCNY will as- wrong.<br />\nIn the questions concerning interThe cast, headed by Jerry<br />\ncussed and Dr. Ames recommended<br />\nBranQ. What is the best--known pre- the giving<br />\nsist<br />\nin the administration of student<br />\nnational affairs, it deeloped that a<br />\nof some assistance to the ower, as Benveneto Cellini,<br />\namorous<br />\nFair Play In Sports Commitscientific theory of the origin of the<br />\nrelief.<br />\npresident in the supervision over silversmith<br />\nlittle less than half of the members<br />\nof Milan, and Zenas Sears<br />\n*<br />\nearth?<br />\n*<br />\ntee Attacks German Policy belong to the R. 0. T.<br />\nthe School of Higher Studies by en- as<br />\nthe<br />\nC. Moreover,<br />\nDuke,<br />\nwhose Duchess is in<br />\nFirst recipient of Columbia UniThe story in the Bible. The diffi- larging the<br />\noffice of the president.<br />\nAs Unsportsmanlike<br />\na small majority favored the United versity's bronze lion award is Dr. culty of this theory<br />\nlove with Cellini.<br />\nis that it would In general, Dr. Ames<br />\npraised the<br />\n--Harold<br />\n.Urey, professor of chem- be a mighty strenuous job to create<br />\nThe play takes place in<br />\nset-up of his former position andd<br />\nMany members of the Hopkins fac- States joining the World Court, while istry andC Nobel<br />\nFlorence<br />\na<br />\nprize<br />\nworld in six days.<br />\nwinner for the<br />\nthe same number voted against its<br />\nin<br />\nthe sixteenth century.<br />\nconcerning this, he recorded:<br />\nulty were among those who signed<br />\nCellini<br />\nhas<br />\ndiscovery of heavy water.<br />\nThe pre-scientific theory is that<br />\njoining the League of Nations. The<br />\njust been pardoned by<br />\n\"The<br />\nduties<br />\nDuke<br />\na petition issued by the Committee<br />\nof<br />\nthe<br />\nPresiden<br />\nAlesant, ac* * *<br />\nthe earth broke off the sun. The difmembers of the Commission unanicording to the present organization, dro de Medici for a previous crime<br />\non Fair Play in Sports recently cirThere are 365 American students ficulty is that the sun is not<br />\nexmously declared that they would par- at German<br />\nare not perhaps clearly expressed, on condition that he keep<br />\nuniversities. Medicine plained.<br />\nthe peace.<br />\nculated, opposing United States' parand I think there is a distinct ad- Then Cellini kills<br />\nticipate in a defensive war fought draws most foreign students to GerMaffio, an old enThat story (Genesis) is only the<br />\nticipation in the 1936 Olympics to be<br />\nvantage in leaving matters as they emy of<br />\non United States territory, but more many, philosophy \\fewest.<br />\nhis. With his life in danger,<br />\nJewish virgin anyway. Every race<br />\nheld in Germany.<br />\nare at present stated. He has all the<br />\n* *<br />\nthan two-thirds of the members<br />\nCellini comes back to his<br />\nhas its own virgin.<br />\nworkshop<br />\nThe committee counts among its<br />\nauthority that anyone could wish,<br />\nVaccination through vaccine pills<br />\nwolud not participate in an offento brag of his exploit to his<br />\nMutation: taking a rabbit with one<br />\nmembers such men as Dr. Franz<br />\napprenand his responsibility is quite clearly<br />\nor tablets will be the method of the short<br />\nleg and crossing breeding until<br />\nsie war.<br />\ntice, his friend and model,<br />\nundersto<br />\nod.\"<br />\nBoas, Heywood Broun, Gov. James<br />\nAryda,<br />\nfuture, says Dr. Lloyd Arnold, of the it is all<br />\nright.<br />\nThe questions on capital and labor Universi<br />\nwith whom he is in love.<br />\nty of Illinois.<br />\nIn regard to the faculty tenure of<br />\nM. Curley, Arthur Garfield Hays,<br />\nshow a definite trend towards<br />\nThe Duke arrives and is<br />\n* * *<br />\nwideabout to<br />\nRev. Reinhold Niebuhr, Lawrence E.<br />\nI'll check that prophecy on the office, Dr. Ames stated he believed<br />\nly differing beliefs with<br />\narrest him when he sees Angela.<br />\nDr.<br />\nFrancis<br />\nthat<br />\nthis<br />\nWaylan<br />\nshould<br />\nd<br />\nbe<br />\nindefini<br />\nmany<br />\nAdams,<br />\nte<br />\nAmin<br />\nof<br />\nthe<br />\n26th and if my prediction is wrong I<br />\nSpivak, Norman Thomas. and OsThen all thought of the danger<br />\nherst '62, is one of the oldest col- promise<br />\nthe questions winning majoriti<br />\ndises by<br />\nto penalize myself by volun- case of professors and a few others,<br />\nwald Garrison Villard.<br />\nappears and arrangements are<br />\nlege alumni living.<br />\nbut<br />\nthat<br />\njust one vote. The strong minoriti<br />\nin<br />\nthe<br />\nmajorit<br />\ny of cases<br />\nmade<br />\ntarily limiting my reading this wines<br />\nThe protest follows:<br />\nfor Angela to come to the<br />\n* * *<br />\nDuke's<br />\nter to the Congressional Record, the there are advantages in a limited<br />\nin these cases would vote for<br />\nRoose\"Whereas Berlin, Germany, was<br />\nsummer palace that evening. Cellini<br />\nColumbia University received gifts published Hearings of the House tenure.\"<br />\nvelt today if eligible for voting,<br />\nprotests, but to no avail.<br />\nappointed host to the 1936 Olympiad<br />\ntotalling $45,216 during October.<br />\nSub-Committee on Deficiency Apbefore the Nazis usurped power in would favor greater government conThe Duke's cousin, Ottaviano, stays<br />\n* * *<br />\npropriations, and last year's seed<br />\na manner repugnant to democratic trol of industry than at present,<br />\nbehind<br />\nto engage Cellini in a plot<br />\ncatalogu<br />\nes . . .<br />\nStatistics indicate that 200,000<br />\nideals, and whereas it appears that would favor some form<br />\nagainst Alesandro's life, but the art* * *<br />\nof social children now attending school in the<br />\npropagandists would seize upon such ownership<br />\nist refuses. Then the Duchess arrives<br />\nIn 1930 The Daily Cardinal, stuof the basic idustries, United States will probably become<br />\ninternational events to disseminate<br />\nand, displaying a marked interest in<br />\ndent<br />\ndaily<br />\ncriminal<br />\nof<br />\nthe<br />\ns.<br />\nUniversi<br />\nty<br />\nof Wisand is for increased organiza<br />\ntion of<br />\nunChristian and anti-social doctrines<br />\nCeillini's work, invites him to the<br />\n* *<br />\nconsin, had for its editorial chairman<br />\nA strong majority<br />\non a vast scale, and whereas true labor unions.<br />\nsummer<br />\npalace. The silversmith, anxa<br />\nvery<br />\noutspok<br />\nWorld-wide<br />\nen<br />\nyoung<br />\nman<br />\nnamed<br />\neducation<br />\nis<br />\nthe<br />\nsport rests upon principles of honor, voted for government ownership of greatest factor for<br />\nious to follow, accepts her invitation.<br />\npeace, says Har- Forrest Allen. A very able writer,<br />\nfair dealing, and justice to all, and public utilities.<br />\nAnd so the plot<br />\ncapable of first rate editorial satire.<br />\nards Dean Roscoe Pound.<br />\nOrganizations Asked To No- The productionwends merrily on.<br />\nwhereas, the present German govAllen throughout his senior year was<br />\nIn the questions on the<br />\n*<br />\n*<br />\n*<br />\nstaff, under the<br />\nuse of<br />\nernment has officially violated those<br />\ntify Peace Council On leadership of Frank Hirschman, has<br />\nliquor, the results showed that<br />\nAthletic ability of men entering about as popular with the faculty as<br />\nthe<br />\nprinciples and by word and deed has<br />\nbeen working late nights to build the<br />\nCommission had among its<br />\ncollege is increasing yearly, accord- a pay cut before Christmas. AnyTheir Representatives<br />\nmembers<br />\nplaced itself beyond the pale of colsets portraying medieval Italy, conthing<br />\ndone<br />\nby<br />\nconserva<br />\nthe<br />\ntives<br />\na majority of teetotalers,<br />\non<br />\ning<br />\nto<br />\nexperim<br />\nenters<br />\nat<br />\nthe<br />\nUnierboth for<br />\nlective human endeavor, and wherethe faculty that Mr. Allen didn't apbeer and other liquors.<br />\nsity of California at Los Angeles.<br />\nWhether or not they have received ceived by Torn O'Conner.<br />\nknowledge of the horror with which<br />\nproe of was promptly followed by a invitations to become<br />\nThe advertising, in the form of<br />\n* * *<br />\nmembers of the<br />\nthe world looks upon Nazi activity<br />\nstinging editorial in The Daily Car- Permane<br />\nposters,<br />\nand programs, is handled by<br />\nnt<br />\nPeace<br />\nJoe<br />\nLouis,<br />\nCouncil,<br />\nheavywe<br />\night sensation,<br />\nall organis withheld from the German people<br />\ndinal. And there wasn't cry much<br />\nAlan Delevett, assisted by Himes,<br />\nizations<br />\nis<br />\nsaid<br />\nto<br />\non<br />\nthe<br />\nenjoy<br />\ncampus<br />\nchicken<br />\na<br />\ndinner—<br />\nare<br />\nrequeste<br />\nd<br />\nby oppressive censorship;<br />\nproviding there are five chickens, they did that Mr. Allen approved of. to notify the group in writing in care McFeely, Kramer and Ewing. \"Some\"Therefore, resolved that we,<br />\nthing different\" is the idea, and vaToday Forrest Allen, whom sev- inclinations to<br />\nvegetables, and two quarts of milk.<br />\nhave representatives<br />\nmoved to lend our moral support to<br />\nrious<br />\neral<br />\nadvertising stunts are planned<br />\nof<br />\nhis<br />\nadversar<br />\nies<br />\non<br />\nthe<br />\nfaculty<br />\n* * *<br />\non the Council. This is the result of<br />\nvictims of man-made suffering in the Kemler To Edit Paper; Asks For<br />\nfor next week.<br />\nonce hopefully believed would come the<br />\nBusines<br />\ndelibera<br />\ns<br />\nis on the upswing and<br />\ntions of the Peace Counsame spirit in which we answered the<br />\nMaterial For Next Literary<br />\nTickets for the play itself will be<br />\nveering more and more toward gov- to a bad end, is rumored to be draw- cil at a meeting held on Tuesday in<br />\ncall for shipments of supplies to<br />\nIssue<br />\ning<br />\ndown a salary of $8,000 a year,<br />\non<br />\nsale in Levering Hall all during<br />\nernment<br />\ncontrol, says Dean Roswell<br />\nLevering.<br />\ncountries including Germany, strickas an Assistant Coordinator of the<br />\nnext week, free to holders of S. A.<br />\nC.<br />\nMcCrea<br />\nof<br />\nColumbi<br />\na<br />\nUniversi<br />\nty<br />\nThe words of this body, whose foren with war, famine, earthquake and<br />\nThe first Feature Issue of<br />\nTVA, under David Lilienthal.<br />\nC. cards. Otherwise the price will be<br />\nIf<br />\nthe School of Business.<br />\nflood, hereby voice our opposition to NEWS-LETTER will be<br />\nmation was authorized by the underthings<br />\nhad<br />\ngone<br />\nagainst<br />\nAllen<br />\npublished next<br />\nin this<br />\n$1.00 apiece.<br />\n*<br />\n*<br />\n*<br />\nAmerica's participation in the 1936 Tuesday, Decembe<br />\nfashion, any more than they did, he graduates during a recent poll, is still<br />\nr 10, as a suppleTwenty-six Greek manuscripts of<br />\nOlympics in Germany; we appeal to ment to the<br />\nwould probably today be in the Ju- in the hands of a temporary steering<br />\nregular news ediiton.<br />\nNobel Prize In Medicine<br />\nthe New Testament are owned by<br />\nthe Olympic committees of all civil- Edited by<br />\nnior Cabinet, repenting the eil of his committee. As soon as a sufficient<br />\nEdgar Kemler, the paper<br />\nthe University of Chicago. It is the<br />\nized nations to withdraw their teams, will be<br />\nnumber<br />\nof<br />\ncampus<br />\nways.<br />\nclubs and frater- To Former Lecturer Here<br />\nof a literary character, consecond largest collection in the counand urge that said Olympiad be post- taining<br />\nnities are represented, a permanent<br />\nshort stories, plays, poetry,<br />\ntry.<br />\nponed or removed to a land officially<br />\nThe Nobel Prize in Medicine has<br />\nA lot of earnest young American governing body will be formed to inand articles of a more or<br />\n* * *<br />\nless conworthy of harboring these historic<br />\nbeen awarded Dr. Hans Spemenn,<br />\ncampus debaters are having sad ex- itiate the policy of the Council.<br />\ntroversial nature, all written by<br />\nvariDont marry a girl whos late for<br />\ngames.\"<br />\nwho lectured at Johns Hopkins Uniperiences meethig the present Oxous students at the Hopkins.<br />\nThursdays at 4 o'clock in Room B,<br />\ndates, says Dr. Alfred Adler, noted<br />\n(Signed)<br />\nersity before the Zoology Departford and Cambridge teams which<br />\nIn order to facilitate composit<br />\nLevering Hall, have been set as the<br />\nion Viennese psychologist, and don't are touring the country.<br />\nment two years ago.<br />\nGeorge Boas, Professor of the Hisand to accelerate publication,<br />\ntime and place for the ensuing sesKem- marry a man to \"save him.\"<br />\ntory of Philosophy -.<br />\nDr. Spemenn received the prize for<br />\nEnglish debate tactics never seem<br />\nler urged that \"students prepare<br />\n*<br />\n*<br />\n*<br />\nsions<br />\nof the Permanent Peace Counto<br />\nArthur Lovejoy, Professor of Philwork done in experimental embryto change, but unfortunately their<br />\nsubmit some 'material of any type<br />\nRadio programs should be governcil. Recently, letters were written to<br />\nto<br />\nosophy<br />\nology on vertebrate animals. He is<br />\nAmerican opponents never get wise.<br />\nbe printed in the next literary<br />\nment-controlled, in the opinion of<br />\nHopkins organizations inviting par- now a professo<br />\nsupIt<br />\nr of comparative anis a common assertion that the<br />\nSidney Painter, Associate in History<br />\nplement, which will come out some- college presidents recently polled by<br />\natomy on vertebrates.<br />\nOxford Union proides the best debate peace.<br />\nJohannes Mattern, Lecturer in Polittime around Christmas.\" The<br />\nidea the Federal Communications Com- training in the world, although it<br />\nical Science<br />\nmission.<br />\nis to draw out any latent talent of<br />\na<br />\nseems to consist of of an ability to<br />\nJames Hart, Associate Professor in<br />\n* * *<br />\nliterary nature that may reside in<br />\ncharm the audience, to maintain<br />\nPolitical Science<br />\nCoumbia, Mo.—There may be complete nonchalence, to spin<br />\nH. C. Lancaster, Professor of French the persons of the men attending the<br />\nmerry<br />\nsomething to the American theory of tales.<br />\nHopkins University.<br />\n(Graduate School)<br />\nuniversal college education, and then<br />\nG. Gruenbaum, Professor of Italian<br />\nAmerican students, on the other<br />\nagain—<br />\n(Graduate School)<br />\nhand, bone up for weeks, outline<br />\nDr. Joseph Ames Reports<br />\nHere are some of the answers that their<br />\nJohn C. French, Librarian of the Unconcretely and spew forth<br />\nSuccess Of J. H. U. Aims turned up in a recent Uniersity of all ofcase<br />\niversity<br />\nwhich the Englishmen wave<br />\nMissouri quiz:<br />\nTenney Frank, Professor of History<br />\nfacts and figures at a terrific rate—<br />\nDr. Joseph Sweetman Ames,<br />\n(Graduate School)<br />\nQ. What experiment led to the airily aside as so much amusing rubpresiW. Stull Holt, Associate Professor of dent emeritus of the Hopkins, spoke establishment of the Mendelian law? bish.<br />\nat the first meeting of Sigma Xi,<br />\nHistory<br />\nA. Cutting the tails off mice and<br />\nthe<br />\nFrederic C. Lane, Associate Profes- Hopkins Chapter of National Honor- breeding them.<br />\nary Society for the Promotion of<br />\nsor of History<br />\nBARBER SHOP<br />\nQ. What do we learn from asJacob Hollander, Chairman, Depart- Research, on Thursday, December<br />\n5, tronomy concerning our physical<br />\nTheodore's<br />\nment of Political Economy<br />\n1935, at 8:15 P. M., in Maryland Hall, universe?<br />\nST. PAUL and 33RD STREETS<br />\nKent Roberts Greenfield, Professor in Room 110. Recent Scientif<br />\nic and<br />\nA. Many astronomers have tried<br />\nDon't spoil the thrill of getting home again by worrying<br />\nof History<br />\nNext To Birely's<br />\nTechnical Developments in Aero- to discove0<br />\nways so that we could<br />\nabout the shipment of your baggage. Solve the problem by<br />\nE. W. Berry, Dean of the College of nautics<br />\nwas the topic. Refreshments<br />\nArts and Sciences<br />\nleaving everything to Railway Express. We will call for<br />\nwere served after the meeting.<br />\nW. B. Kouwenhoven, Dean of the Enyour trunks, baggage and personal belongings and send<br />\nIn celebration of the semi-centengineering School.<br />\nthem<br />\nhome on fast passenger trains through to destination.<br />\nnial of the society, two research<br />\nThe aforementioned are among the<br />\nYou<br />\ncan<br />\nprizes<br />\ntake yourtrain home with peace ofmind—knowing<br />\nof<br />\nof<br />\n$1,000 each were awardmembers of the faculty who signed<br />\ned,<br />\none<br />\nthat<br />\nin<br />\nyour<br />\nthe<br />\nbaggage will be there quickly and safely. Railway<br />\nphysical<br />\nsciences<br />\nand<br />\nthe petition.<br />\none in the life sciences.<br />\nExpress service is a decided economy in expense, too.<br />\nE. B. Mathews is the Chapter<br />\nAfter vacation,send your baggage back the same way.<br />\npresident, and M. W. Pullen holds<br />\nWe give a receipt on pick-up and take a receipt on dethe office of secretary. Dr. E. B.<br />\nlivery...double proof of swift, sure handling.<br />\nSeeling, of the Johns Hopkins MediFor service or information merely call or telephone<br />\nThis week: CLARENCE WEIMER.<br />\ncal School, is the representative to<br />\nIn the hands of this cheerful senior<br />\nCHARLES and FAYETTE STREETS<br />\nthe National Chapter.<br />\nVErnon 0600<br />\nlies the task of editing the 1936<br />\nDEPOT OFFICE: 203 E. FRANKLIN STREET<br />\nVEmon 0600<br />\nHullabaloo, on which annual he has<br />\n••••••<br />\n•.111.111•••••••••••111111.?<br />\nBALTIMORE, MD.<br />\ndevoted quite a bit of his energies<br />\nGet New Low Fares<br />\nin years past. During the spring<br />\nOther Information<br />\nST. PAUL at 33RD STREET<br />\nterm he will manage the lacrosse<br />\nFrom Greyhound<br />\nPrescriptions—School Supplies<br />\nteam. He was formerly a crack shot<br />\nAgent<br />\nCandy-Cigars<br />\nThese big reductions effecon the rifle team.<br />\nUnexcelled Fountain Service<br />\ntive nearly everywhere.<br />\nDrop in, or telephone for<br />\nClarence is secretary of Omicron 111.11.11.1...........1.41.11.••••••••••••••••••••••••••••••••••••<br />\nspecific details.<br />\nDelta Kappa, national honorary fraGREYHOUND<br />\nAGENCY,INC.<br />\nBUS<br />\nTERMINAL<br />\nternity, to which he was elected last<br />\nJ. H. FURST CO.<br />\n217-221 W. Baltimore St.<br />\nLIATION -WIDE RAIL- AIR SERVICE<br />\nYear. He is also a member of Pi<br />\nPhone: PLaza 0520<br />\nPrinters of<br />\njournali<br />\nhonorar<br />\nbelta Epsilon,<br />\nstic<br />\ny<br />\nCampus Agent — M. L.<br />\nTUNE IN ON THE RAILWAY EXPRESS NEWS PARADE<br />\nPHILOLOGICAL and<br />\nKrieger, E. 22 Dormitory,<br />\nfraternity, and was associated with<br />\nEvery week from the following stations:<br />\nSCIENTIFIC PUBLICATIONS<br />\nCHesapeake 4912.<br />\nthe old \"Black and Blue Jay.\" He<br />\nWEEI • WOR • WHK • WLS • KWK • WDSU • WFAA<br />\n12-20 Hopkins Place<br />\nBaltimore<br />\nWGST • KYA • KNX • KSTP • KOMO • WBAL • KOIL<br />\nbelongs to no social fraternity.<br />\n<br />\nObject To Nazism<br />\n<br />\nCampus Groups<br />\nAsked For Stand<br />\nBy Peace Council<br />\n<br />\nFirst Literary Issue<br />\nTo Appear Tuesday<br />\n<br />\n4,J<br />\n<br />\nHOME FOR THE<br />\nCHRISTMAS<br />\nA HOLIDAY?<br />\n(Wilma you iarnayei<br />\n<br />\n(44<br />\n<br />\nQU ICKLYand ECONOMICALLY<br />\n<br />\nsT<br />\n<br />\nGrtirortiouN<br />\nits<br />\n•<br />\n<br />\nCampus Captains<br />\n<br />\nt<br />\nUtINSI<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nUN<br />\n<br />\n*<br />\nROUND tV<br />\nTRIP<br />\nGREA<br />\nTLY<br />\nEffective REDFARES<br />\nRettirn Dec.15 to<br />\nUCED<br />\nBefore<br />\nJail.I<br />\nFebruary I<br />\n<br />\nRAILWAY<br />\nEXPRESS<br />\n<br />\nWatch for local announcements<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 10, 1935<br />\n<br />\nCbe PewelLetter<br />\nFounded 1897<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nWhat Is Proletarian Literature?<br />\n<br />\n3 Novels<br />\n<br />\nA Review - - By Elijah Adams<br />\n<br />\nReviewed By C. Beach<br />\nThe corrent controversy between left-wing and<br />\nright-wing literary critics has not always Men too<br />\nclear. Objectivity and keen sanity have not always<br />\nprevailed on both sides. But the assault of the \"proletarian\" critics and writers has done much to clear a<br />\nhazy atmosphere and renew. the vitality of both the<br />\nmanner and content of literary criticism. The flaccid<br />\nsentimentalists like William Lyons Phelps, Isabel Patterson, and Herschel Brickell, have shown their true<br />\ncolors by retreating behind a cloud of pointless slander,<br />\nbut the more intelligent of the critics, Krutch and Cowley, for example, have taken up the challenge sincerely<br />\nand objectively. The result has been a purer literary<br />\natmosphere, -more conducive to creative effort and the<br />\nclarity of literary criteria.<br />\nPut broadly and most reasonably, the chief claim<br />\nof the left-wing critics is that'literary productions tse<br />\njudged by the degree of understanding of social forces<br />\ndisplayed therein. Sound technique and convincing reality of character are not however dispensed with as<br />\nbourgeois superfluities. On the contrary, the radicalminded critics contend that the broad comprehension by<br />\nan author of the lines of development of his own times<br />\ngives more vital and organic meaning to his technique<br />\nand delineation of character; that an understanding of<br />\nthe dynamics of social change Makes possible a fuller<br />\nand clearer conception of individual character and a<br />\nsounder development of the chosen theme; that, in fine,<br />\nthese three ingredients of good literature are so vitally<br />\nconnected that -the absence of one results inevitably in<br />\nthe weakening of the others.<br />\nThe question of propaganda. in art is beside the<br />\npoint. A really great novel, according to the abovementioned criteria, cannot but be good propaganda. It<br />\ndrives home mercilessly the necessity of the next step<br />\nin the scale of social progress. A bad novel, however<br />\nforcefully contentious, remains a bad work of art and<br />\ntherefore fails in its conscious purpose.<br />\n<br />\nRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Postoffice, Johns Hopkins University.<br />\n<br />\n(Continued from Page 1, Col. 2)<br />\nthe Soviet Union. Archibald Mac- completely vague and insignificant.<br />\na revolutionary head, the values of eish, Stephen Spender,<br />\n*<br />\n*<br />\n*<br />\nW. H. Auden,<br />\nEntered as second-class matter December 3, 1909, the left-wing artist find their chief<br />\nA left wing poet, on the other hand,<br />\nCecil-Day ewis, and Thornton Wilder<br />\nat the Postoffice in Baltimore, Md., under the Act of use<br />\nis dealing with ideas just as valid,<br />\nas a weapon and an educational are among those<br />\ndiscussed in the<br />\nCongress, November 3, 1879.<br />\nbut his medium is one in which form<br />\nforce, rather than as a toy for tired remaining articles.<br />\nis particularly important—in some<br />\nPublished semi-weekly from October to June, ex- business men or a willful,<br />\nself-justiAt this point it is well to compare cases<br />\nmore important than the concept during examination and college holiday periods<br />\nfying, seilf-conscious drive towards the achievements of proletarian tent. A logical critique<br />\nof our social<br />\nby undergraduates of the Johns Hopkins University.<br />\n\"pure\" expression. A genuinely pure literature in the fields of criticism and economic system and the knowand poetry, or broader, non-fiction edge of<br />\na method of changing it<br />\nart, an art freed of any sort of class<br />\nEDITORIAL DEPARTMENT<br />\nand fiction. Not alone in this volume,<br />\nmakes<br />\nthe<br />\npoet a better craftsman in<br />\nbias,<br />\nan<br />\nart motivated by the desire but in all the radical<br />\nKenneth Zierler<br />\nEditor-in-Chief<br />\npublications on ideas, not in form. In fact, it usually<br />\nto<br />\ntransmit all experience emotion- the scene, we continually notice that<br />\nIrving Leberfeld<br />\nManaging Editor<br />\nincreases his stylistic difficulties.<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nally and educationally valid, an art the book reviews, the theater and And so, for<br />\nleft-wing poetry as fine<br />\nAssistant Managing Editors<br />\nbased upon more individualistic self- movie reviews, the analyses of liter- in form as it is in content, we shall<br />\nDavid Caplan, Bernard D. Pinch,<br />\nary figures and movements are in- have<br />\nto wait until the accidental<br />\nexpression than has ever been known,<br />\nSports Editors<br />\ncomparably better, for the most part, forces which<br />\nproduce a great poet<br />\ncan exist, it follows only in a class- than<br />\nEdgar Kemler<br />\nMagazine Editor<br />\nthe poetry, and, in lesser degree, play upon<br />\none who is a Marxist.<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nless society.<br />\nthe fiction. The explanation of this<br />\nIn concalusion, this anthaflogy<br />\nColumnists<br />\n* * *<br />\nseems to me to rest in the nature of not only<br />\nJesse N. Borden<br />\nAdvisory Editor<br />\nbetter than most for its inThe body of proletarian fiction, the new qualities in left-wing litera- trinsic value: it is far more imporEDITORIAL STAFF<br />\nture. These new qualities lie chiefly tant than<br />\nSigmund Safier, Max Iskowitz, Nathaniel Finkmost for the great movewhich has been developing at a headin the application of a more system- ment and<br />\nthe important aesthetic and<br />\nelstein, Murray Kempton, Wethered Barroll, Jr.,<br />\nlong rate in the last five years esatic, more rational, and more com- social<br />\nIsadore Gertman, Jewett Goldsmith, Leonard<br />\ntheories which it combines<br />\npecially, is represented by 16 short plete world-outlook to the problems<br />\nand represents. Notwithstanding its<br />\nJaffe, Red Glantz, Lester Caplan, Howard Reizstories and excerpts from novels. we see about us. Thus a critic who temporary<br />\nenstein, Julian Adler.<br />\nweaknesses, the fact of a<br />\nAmong these there is great diversity adopts the left-wing position imme- complete new literary tradition, uniBUSINESS DEPARTMENT<br />\nin style and content, the charge of diately furnishes himself with a fied<br />\ncritical, and<br />\nself-conscious,<br />\nmicroscope and system of analysis springing fully-armed<br />\napparent<br />\nfrom<br />\nbourgeois critics that all left-wing<br />\nDavid H. Levy<br />\nBusiness Manager<br />\ncombination<br />\nweapon, stethoscop,e nothingness to its present floration,<br />\nfiction is written according to a<br />\nRobert Watkins<br />\nAdvertising Manager<br />\nmore effective and accurate than he all within<br />\nRobert Levi<br />\nthe last ten years, is a matCirculation Manager<br />\nsimple set of formulae, learned by<br />\nhas ever known. Immediately the ter for<br />\nWilliam B. Kernpton<br />\nOffice Manager<br />\nmarvel and admiration. Our<br />\nrote and applied metallically, to the<br />\nquality of his work is enhanced a duty to proletarian<br />\nMelville Locker<br />\nCopy and Filing Manager<br />\nliterature is one<br />\ncontrary notwithstanding. The sehundred-fold for good literary criti- of sympathy and defense,<br />\nso that we<br />\nlections<br />\ninclude<br />\nstories<br />\nabout<br />\na<br />\nscab<br />\nBUSINESS STAFF<br />\ncism depends on keen perception, may help it play its part in the strugin<br />\na<br />\ntaxi<br />\n-strike, farm laborers, the sound logic,<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\nand a unified way of re- gle which is to bring us to an era<br />\nburial of an unknown soldier, an inN. Soifer, S. Tinley<br />\ngarding facts; without any of these when literature and all art will flourcident on the West Coast after Westhree qualities, criticism can be cor- ish as never before on the earth's<br />\nA survey, of four American novels chosen at ranley Everest's murder, etc.<br />\nTuesday, December 10, 1935<br />\nrespondingly untrue, illogical, or surface.<br />\ndom will perhaps elucidate, by elaboration and concrete<br />\nThere were only two poorly chosen<br />\nexample, the three criteria of literary art in fiction.<br />\nselections, and I think the most reThe criticisms are not meant to be characteristic of all<br />\ncent proletarian fiction, if this is a<br />\nof each author's work nor are they placed in some<br />\nTo a waiting world we present this, the first maga- fair sample of it, has improved tregraduated schematic arrangement, with each novel emmendously over the styaed, unim:<br />\nzine number of the NEWS-LETTER. For once there is<br />\nbodying some universal principle or another. All the<br />\naginative tracts of a few years ago.<br />\nlittle of the newspaper in an issue of this journal. There<br />\nnovels, I repeat, were chosen haphazardly with no<br />\nThe section on poetry reveals most<br />\nare those who archly repeat, \"For once?\" These we of the present weaknesses of prolepurpose in mind but of diversion.<br />\n(Continued from Page 1, Col. 6)<br />\nHe noticed the great ease with which<br />\nDemocracy by Henry Adams is generally conceded<br />\ntarian literature. Unoriginal imagcan ignore as catty souls—catty and lacking taste.<br />\nvery morning, for he had completed he could walk, now that he was the<br />\nto be a second-rate novel. The weight of melodrama<br />\nStill, with dignity, we present the first literary ery, crudity of expression, the sacriwork on the new model, and all that possessor of his secret.<br />\nburdens the story, and its heroine is imperfectly and unnumber of the NEWS-LETTER. The plan, originating with fice of form and style to sloganized was necessary<br />\nwas a trial. He was<br />\nAs he neared the hotel, he was convincingly drawn, as are all its other characters with<br />\npolitical content, these are the most<br />\nMr. Edgar Kemler, to attempt to supply the Hopkins<br />\nimportant of such weaknesses. I sure it would prove successful, for somewhat surprised, and not a little the exception of the senator. The problem as Henry<br />\nhe had worked out each detail so<br />\ncampus with an outlet for literary talent that has been liked the<br />\npoems of Kenneth Fearing<br />\ndisappointed with his reception. ne Adams saw it was the seeming unworkability of decarefully.<br />\nWith a sudden determina- expected<br />\nentirely<br />\nby<br />\nexecuted<br />\nyear<br />\nhas<br />\nover<br />\nlacking for<br />\nbeen<br />\na<br />\nvery much, and of his three selections<br />\na crowd of admirers to be mocracy and the frustration of the ideal ends of govthat gentleman. Mr. Kemler's chief qualification is I should choose Lullaby as the best tion, he decided to try out his new waiting for him; instead, no one ernment. The cause to which he attributed the break'chute in this afternoon's performseemed even to notice him. \"Possibly down of the system was the extension of political dethat he was a member of the last and, perhaps, best poem in the collection. The poetry<br />\nance.<br />\nis<br />\ncertainly<br />\nthey do not recognize me,\" he mocracy to the great masses of the unlearned. He<br />\nas<br />\nvarious<br />\nin<br />\nspecific<br />\nstaff of the Black and Blue Jay. Requiescat in pace.<br />\nCarefully strapping on the flimsy thought. Noticing a newspaper, he allows the reader, however, a moment of hope, which<br />\nmaterial and style as any collection<br />\nThe Jay, we mean, not Mr. Kemler.<br />\nof bourgeois poetry of the same size; piece of silk, which was his new walked over to see if he was given for all practical purposes resolves itself into faith in<br />\nWe realize that this product is not all it might be. and the fact that there<br />\nis unity in parachute, he clambered into his a write-up. The paper was an \"ex- civil service reform as the salvation of democracy. OvIn fact, it may be all it mightn't be. Still, there must general theme and general outlook waiting plane, and was soon amazing tra\" which had just been published, viou.sly, Henry Adams misread the lines of force in<br />\nbe a beginning to everything—a conception not original only makes the collecpon as a whole the simple country folk with his no doubt, on his account. Staring society. He admitted that he couldn't easily find them<br />\nseries of stunts. Now came the time from the front page was Edward's in his \"Education\". In his novel, he showed that when<br />\nwith us. We have sown the seed. All we can do now is better.<br />\nhope that the talent of this University, seeing in the<br />\nIt was interesting to note that no- for the final stunt—the parachute picture, and above that, glaring head- he did guess at them, he guessed wrong. The result is<br />\nNEWS-LETTER a quarterly medium for their efforts, will where in the section<br />\nappeared any jump, in which he would prove be- lines. But surely those headlines a novel that is a rather clever and scathing portrayal<br />\npresent us with better and more varied stories, poems, pretentious, affected obscurity—the yond all doubt that his new inven- could not refer to him, for<br />\nthey said, of the Washington haut-monde of his day but not much<br />\netc., for future editions.<br />\nsort that we find in many of the tion was valuable. He took one look \"Daring Flyer Killed.\" A change of more than that.<br />\nWe repeat,- we have sowed the seed, and, although third-rateps in modern poetry, who at the crowd below, then taking a emotion crossed Edward's face and,<br />\nWilliam Dean Howells was a better novelist than<br />\nthis particular result is more like an abortion than emulate honest stylistic experimerri<br />\n. deep breath, he jumped into free for the first time, it occurred to him<br />\nanything else, still we feel that, with the potentialities by turning it into arrogant esoteri- space. He had made many jumps that he was dead.<br />\nHenry Adams. He understood more clearly and symbefore, but now, for the first time,<br />\nwe believe are to be found at the Hopkins, and with cism and cliquish faddism.<br />\npathetically what was happening in the United States<br />\nhe experienced a vague terror that<br />\ncareful incubation, this endeavor may mature into quite<br />\n* * *<br />\nof his time. He was more effective in the unfolding<br />\na valuable member of the publications family.<br />\nof realistic detail. But in A Modern Instance one feels<br />\nThe examples of reportage were all his new 'chute might not open. As<br />\nthat his characters are somewhat stunted, never fully<br />\nexcellent, with one exception—John if to dispel this fear, he pulled the<br />\nAnd largely because the<br />\nand convincingly human.<br />\nL. Spivak's lachrymose A Letter lo rip cord and waited for the jerk<br />\nproblem of divorce, the theme of the book, is treated in<br />\nPresident Roosevelt. Balancing this which would signify that the chute<br />\na thoroughly unrealistic fashion. The first three-quar(Continued from Page 1, Col. 3)<br />\nwas The Fall of Shangpo by Agnes had opened properly. Time passed,<br />\nin<br />\nsplit<br />\nwhich<br />\neach<br />\nseemed<br />\nsecond<br />\nters of the novel are a fair enough picture of the marital<br />\nSmedley,<br />\na<br />\nstirring accoun tof an<br />\ndown under the staus quo.<br />\nan hour, and a sudden overwhelming<br />\nlife of an ambitious and egotistical husband and a<br />\nearly<br />\nevent<br />\nin<br />\nthe<br />\nhistory<br />\nof<br />\nRed<br />\n(proleworkmen<br />\nAlso, there are a few actual<br />\nGIFTS OF MARS<br />\ndevoted wife. The stage is set for a fine projection of<br />\nChina. Reportage is an art developed nausea came to him with the realitariat), who are not very conspicuous in the radical<br />\nparticularly well by left-wing jour- zation that his new invention was a Little red drops of blood that creep the divorce problem of the day, flowing naturally and<br />\npublicity notices.<br />\nfailure—that the chute was not go- down your face and body,<br />\nrealistically out of the carefully a,rranged background.<br />\nnalists.<br />\nopen.<br />\nFalling<br />\nto<br />\nmadly<br />\ning<br />\nthrough<br />\nIn<br />\nthe last quarter of the novel, the curtain rises only<br />\nRabble, neurotics, and some keen thinkers have<br />\nThe section on drama contains<br />\nwarm, yet cold—<br />\nrushing<br />\nair,<br />\nhe<br />\nsenexperienced<br />\nthe<br />\nchain of fortuitous circumstances and foolish state<br />\non<br />\na<br />\non<br />\nmost<br />\n,Shame<br />\nnotably<br />\nworld!<br />\nClifford<br />\nthe<br />\nnation<br />\nin<br />\nOdets'<br />\nwealthiest<br />\nWaitAnd little old ladies with eyes that<br />\nscared the<br />\nsations such as only a person in his<br />\nlegislation. The unity of character is shattered and<br />\nFor<br />\nLefty,<br />\ning<br />\nwhich<br />\ncomhas<br />\nbeen<br />\nproportion?<br />\nweep,<br />\nof<br />\nsense<br />\nyour<br />\nis<br />\nwhere<br />\nyou, Mr. Hearst;<br />\nthe narrative becomes a string of sequences, boring and<br />\npletely reviewed in many other predicament could experience. His And weeping grow tired and old.<br />\nI reveal all these things in the name of Enlightsuperfluous. It seems that Howells proceeded for a while<br />\nplaces, from the New York Times to life flashed through his mind, as he These are the gifts of Mars.<br />\nenment in America. The radicals deserve to be exin a largely instinctive fashion and that when he came<br />\nNew Theater. In addition, there is grimly looked at the earth rushing<br />\nposed. They are neither relieving the sufferers of America, America, a recital with four up to meet him.<br />\nThen a sudden<br />\nto the point where the theme had to be resolved into its<br />\nUNIVERSITY<br />\ninevitable conclusion, his meagre understanding of the<br />\nthe world nor are they fostering the refinements speakers, by Albert Kreymbourg, an- thought—now, if ever, was the time<br />\nother form adopted by proletarian to try his theory about walking on I stand—God knows how much I forces inherent in divorce as a social problem led him<br />\nof the world.<br />\nastray.<br />\ntremble,<br />\nforce,<br />\ncultural<br />\ndramatists, and brought to its full air. He closed his eyes, and concenIf they expect to become a great<br />\ntrated with all his strength, on the Inside the gates where men like I<br />\ndevelopment<br />\nrecitation.<br />\nin<br />\nthe<br />\nmass<br />\nscarthen their path is obvious. First, let them stop<br />\nDespite the rushing air,,<br />\nFew will disagree with the judgment that Main<br />\nassemble<br />\nThe climactic scenes from three fa- subject.<br />\ning the middle classes. Admit the truth, intellectual<br />\nmous plays are reprinted: Stevedore, beads of perspiration stood out on My heart is sad, I breath a sigh—a Street is a better novel than Democracy and A Modern<br />\nradicals! Tell the world what asses both you and it They<br />\nInstance. Main Stret has a vigorous appeal that is<br />\ntear<br />\nShall Not Die, and Black Pit. his forehead,. as he willed his body<br />\nhave been. You for getting up the hopeless scare— Left-wing literature is best known to cease falling. After what seemed That's brushed away—yet I am glad absent in the other two novels. The development of<br />\nand do not fear<br />\nits theme is much sounder and more effective, its charand it, the world, for falling for it! It all may come to Americans in the form of the an interminable age, but which was<br />\nacterizations are fuller and more telling. One feels<br />\nto a lot of wasteful bloodshed unless the real revo- drama, simply because plays, once not more than a second, he could feel For now I know that all is well;<br />\nHis hurtling body<br />\nNo longer chained but free—<br />\nthroughout the nervous genius of Sinclair Lewis. It<br />\nproduced, have a chance to establish a difference.<br />\nlution belongs to the workmen.<br />\nseemed to be slowing down. At last, And what I am or shall become<br />\nmoreover, an exceedingly more valuable document of<br />\nis,<br />\na<br />\nreputaand<br />\nmuch<br />\nquicker<br />\nfirmer<br />\nThen be more gracious in your attitude towards<br />\nhere was success. He concentrated<br />\nDepends, at least, on me.<br />\nits times. Lewis, I believe, mulled over the contempovolumes<br />\ntion<br />\nor<br />\nnovthan<br />\nof<br />\npoetry<br />\nour American upper middle class. Remember: that<br />\nrary scene aplenty before he sat down to write. And<br />\nels. Along with the rise of the left.. even harder, and now, looking down,<br />\naudience is the only one at the present time, suffiwhen he did, the problem of Carol Kennicott and her<br />\nwing drama, which is generally ack- he could see that his fall had been<br />\nA Smile<br />\nciently educated to receive your cavortings. Didn't nowledged by critics of all shades of checked; he was walking on air.<br />\nrelations to Main Street was clearly in his mind. But<br />\nA little kitten all cuddled up<br />\nEdward could imagine the surprise<br />\nthe ramifications of the problem, its extent and depth,<br />\nthey turn out in flocks to hear Communist John Stra- opinion to be the most vital and<br />\nin<br />\nyour lap<br />\nprevamust<br />\nbe<br />\nwhich<br />\nincredulity<br />\nand<br />\nhe<br />\ndid not see. The result is a vague dissatisfaction<br />\nthe<br />\ntendency<br />\nAmeritan<br />\npromising<br />\nseem,<br />\nin<br />\nthe<br />\nmay<br />\nit<br />\nas<br />\nSad<br />\nhere?<br />\nhis<br />\nvisit<br />\non<br />\nchey<br />\npurring<br />\nlent with the crowd below. In his<br />\non the reader's part with the character of Carol. It is<br />\ntheater<br />\nof<br />\ngoes<br />\nthe<br />\ntoday,<br />\ngrowth<br />\nsupchief<br />\nthe<br />\nbeen<br />\nalways<br />\nelement<br />\nhave<br />\nwealthier<br />\ndeliciously.<br />\nnot, as Walter Lippman!' argues, that Lewis never saw<br />\nscores of New Theater units, organ- fancy, he could already hear the conporters of the flowering of an Enlightenment—in<br />\nhe<br />\ngratulations<br />\nwould<br />\nwhen<br />\nreceive<br />\nMain Street from any angle but his own, i.e., Carol's.<br />\nized into the New Theater League.<br />\nthe 20th no less than in the 18th century. Working<br />\nLippmarm excepts the reaction of the farm girl, Bea<br />\nBaltimore has such a group; every he willed his body to float gently to Laughter<br />\nclass patronage will be much too confining in every large city in the country has one.<br />\nA little monkey climbs<br />\nthe ground. But, being a true showSorenson, on her first arrival at Gopher Prairie,. But the<br />\nman, he decided to further his great<br />\n* * *<br />\nand chatters<br />\nwhole life of the Gopher Prairie ruling clique is so ably,<br />\nway.<br />\nand tosses cocoanut shells<br />\ntoo ably, presented from its own point of view, that<br />\nThe last section is that of literary stunt by landing on the outskirts of<br />\nAnd finally, if you, having renounced revolution<br />\nall around.<br />\n.more often than not we laugh at Carol Kennicott rather<br />\ncriticism. One of its most interest- the town and walking back to his<br />\nas your major profession, should pour your radical<br />\nthan an \"unreconstructed\" Babbit. He. also sees Main<br />\ning articles deals with proletarian hotel.<br />\nsouls into the liberal arts—try, as best you can, to<br />\nStreet from the vigorous point of view of the mulcted<br />\nHaving so decided, he willed his Scntg<br />\nGranville<br />\nself-criticism.<br />\nliterary<br />\ntake yourselves less seriously. Otherwise, you may Hicks contributes a brief inventory body to move sideways, and looking<br />\nfarmers and the itinerant farm workers. The attracWistfully, a little bird<br />\nbore the bourgeois world to reaction and tears—much of recent American literary history. down he could see the land slipping<br />\ntion for Carol held out by the big Swedish plumber and<br />\ndreams and breathes<br />\nby<br />\nit<br />\ndone<br />\nhandy-man who is an I. W. W. is significant. The<br />\nhave<br />\nalong.<br />\ncould<br />\nfloated<br />\nmerrily<br />\nits dream<br />\nJoshua Kimitz offers his excellent by, as he<br />\nmore quickly than you ever<br />\nsympathy<br />\nlanded,<br />\nwith which he is drawn by Lewis shows that<br />\noutskirts,<br />\nhe<br />\naloud.<br />\nstandardization<br />\nin<br />\nthe<br />\nReaching<br />\nliterary<br />\ncharge<br />\nof<br />\nbombs!<br />\n(Continued on Page 3, Col. 4)<br />\nBy A. L. Schneider<br />\npolemic against Max Eastman's and began his walk back to his hotel.<br />\n<br />\nBy Way Of Introduction<br />\n<br />\nThe Man Who Walked On Air<br />\nA Story - - By Philip Pearl<br />\n<br />\nPreface On Radicals<br />\n<br />\nPoems<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., DECEMBER 10, 1935<br />\n<br />\n3<br />\n<br />\nMentarians Go National 3Novels NEWS OF THE WEEK<br />\nTHE MENTARIAN PROGRAM<br />\n<br />\nMentarians Ridiculed<br />\nBy \"Judge\" Magazine<br />\n<br />\nAll persons interested in the advancement of Enlighteinment in<br />\nAmerica must unite under the<br />\nMentarian banner1. To make a concerted effort to<br />\neducate the taste of the American<br />\npublic. Or to organize an intellectual market.<br />\nTo thus establish the manof-letters and the maii-of-art as a<br />\nself-respecting and profit-making<br />\nentity in America.<br />\n3. To join the lot of the humanists with that of the lovers of science in the effort that Enlightenment may reap the rewards of<br />\nscientific discoveries—and not Big<br />\nBusiness get them.<br />\n4. To then, after having established Enlightenment as a power<br />\nin society, wage as much war as<br />\npossible against social injustices.<br />\nIN CONCLUSION, the Mentarians seek a position in American society--not as despised radicals without an audience—but as<br />\nmen interested in life's fineries, at<br />\nlast finding expression for themselves in the wealthiest (and formerly the dullest) of nations.<br />\nFor further information: Buy<br />\nThe Mentarian Manifesto, Price<br />\n10 cents.<br />\n<br />\nOhio Youth Declare<br />\nNeed For Movement<br />\n(Ed. Note—We received this<br />\nletter from the New Republic.<br />\nWe are printing it because we<br />\nthink it a sincere literary document, laying bare the mental insides of a human being. Often in<br />\na letter, without a.ny self-consciousness, a writer can reveal<br />\nhimself more boldly than in an<br />\nentire novel. Here is an example.<br />\nAnd the letter is doubly interesting as testimony that there is<br />\nactually need for a Mentarian<br />\nmovement throughout the towns<br />\nof the country—this being one of<br />\na number of similar notes.)<br />\nTo Edgar Kemler,<br />\nCare of The New Republic,<br />\nNew York City.<br />\nNov. 3, 1935.<br />\n<br />\nTHE FIRST M. P.<br />\n<br />\nWith the recent slamming of the<br />\nMentarian movement in the December issue of Judge Magazine, the<br />\nrapid growth of interest in the<br />\nAiovement reaches its highest point.<br />\nAs one of the items under the wellknown feature, \"Judge On the<br />\nBench\", almost a whole column is<br />\ndevoted to ridiculing the group which<br />\nhad its start on the Hopkins campus<br />\nlast spring.<br />\nThe writer, entitling his article,<br />\nThe Mentarians, paraphrases the basic outlines of the Mentarian platform—i.e., that intellectuals should<br />\nwithdraw from Communist parties<br />\nand from waging the class struggle.<br />\n\"Well, we read about a new group in<br />\nBaltimore,\" he says, \"calling themselves 'Mentarians! This singularly<br />\nugly word (?) means, as we understand it, people who have . . . cultivated tastes and not much else. They<br />\nare thereby set apart from the mob<br />\n. . . They are really anti-human, because the vast majority of the masses are, of course, human.<br />\n\"In recent years, it seems, the<br />\nMentarian has made the mistake of<br />\nthinking that he could or ought to<br />\ndo something to make the world better. He let himself feel sorry for the<br />\nmasses . . . What he overlooked was<br />\nthe fact that he had no abilities as a<br />\nleader . . . Therefbre the Mentarian<br />\nSociety of Baltimore has voted to<br />\nreturn the class struggle back to;the<br />\ndullards.\"<br />\nThe writer, after thus caustically<br />\nsummarizing the Mentarian position,<br />\nfinally concludes on a note of reluctant agreement. \"Must our prescription for the government of the future be the continual removal from<br />\npublic life who shows any signs of<br />\nbrains? It sometimes seems so.\"<br />\n0-0<br />\n<br />\nFirst Set Forth<br />\nIn The News-Letter<br />\nThe Mentarian movement—name<br />\nand most of the major ideas—had its<br />\nfirst public exposal in the May 7,<br />\n1935 edition of the Hopkins NEWSLETTER. This was the Manifesto--later revised, and issued in the form<br />\nof a pamphlet.<br />\nThe first step in the national spread<br />\nof the ideas was the dispatching of<br />\n<br />\nI think enough of your letter in the<br />\nNew Republic of some weeks ago to<br />\n'keep it in place of easy reference.<br />\nWhen I feel particularly depressed,<br />\nworthless and purposeless, I read it.<br />\nI feel some better after doing so too<br />\nbe assured that there are still at<br />\nleast a few people whose attitude<br />\ntowards life is similar to mine.<br />\nI'm not, however, a college graduate—nor a high school graduate;<br />\nbut just one of those naturals you<br />\nmention.<br />\n<br />\nBut I'm a realist, all right. I don't<br />\ndwell in any neurotic phantasies. I've<br />\nread modern psychologies, but they<br />\ndon't solve the problem.<br />\nMost of<br />\nthem are worthless. Given a proper<br />\nsocial system, psychological wrecks<br />\nwould disappear. Now the insane are<br />\nbetter off than other people, for they<br />\nlive in their own mental world aliti<br />\ntheir material existence is automatically institutionalized. The world now<br />\nis full of derelicts and they are not all<br />\nin the asylums, I asure you. For the<br />\nI am a non-conformist—in every- present economic system<br />\nof industry<br />\nthing. I don't work well in any kind and technology<br />\nhas produced milof harness; nor do I like any kind lions of them.<br />\nof physical work for its own sake or<br />\nDo any of you Mentarians desire<br />\nfor the money resulting. In these<br />\nmarriage? It seems to me an imrespects, I seem to conform to your<br />\npossible state, unless the economics<br />\npattern of a Mentarian. And, my<br />\nof marriage are assured. If you want<br />\nlife—or at least, what pleasure I<br />\na full-blown neurosis, marriage under<br />\nhave in it—is all mental.<br />\nthe present milieu offers a good one,<br />\nIf I had money for just a living, unless the pair are perfectly matched<br />\nI wouldn't do a damn thing I wasn't —mentally. Don't you think so? Sex<br />\ninterested in. It's rotten state, but is all right for a Mentarian, but it<br />\nI see no way to change it. I'm only soon becomes an empty passtime—<br />\na plumber's son, and for me, it would not an end of itself.<br />\nhave been better if I had not graviTo me, the triumph of the intellect<br />\ntated to books and literature. Better<br />\nis its ability to absorb the experience<br />\nhad I remained in the brawn and<br />\nof others without the pain. I've done<br />\nignorance which was my beginning.<br />\na lot of this by observation—and<br />\nYou see I went through a period probably more by reading in the<br />\nof seeking happiness by material sources mentioned.<br />\nBut all this<br />\nmeans, buying clothes, furniture, au- premature experiences leaves me<br />\ntomobiles, which now are without with a washed up feeling toward life.<br />\ninterest or value to me as escape me- life in general, but I can look only at<br />\nchanisms. Contemplation seems the the bare truth about myself. The<br />\nonly worthwhile pursuit.<br />\nthings that the Mentarians stand for,<br />\nI can't change the social system<br />\nnor the people in it. Groups and<br />\nmovements seem equally impotent.<br />\nRadical demagogy, or any other kind,<br />\nhas no appeal for me. Such men are<br />\nhypocritical at heart, anyway. So<br />\nwhat can I do?<br />\nI read constantly the Nation, New<br />\nRepublic, Harper's, Forum, Scribners. But I can't get away from it.<br />\nIt's a helluva life anyway you look.<br />\nI wish to live closer to the Mentarians—or such people like them.<br />\nIt's a big satisfaction to live around<br />\npeople you're in tune with—and I'm<br />\ncertainly out of tune with the people<br />\naround me. They can't understand<br />\npeople like me, and I don't attempt<br />\nany explanation. I'm a non-conformist, and it's a hard cross to bear,<br />\nbelieve me.<br />\n<br />\nI :land for. And the success of a<br />\nMentarian Party in America would<br />\ngive me new hope in the only things<br />\nwhich have any meaning for me.<br />\nSincerely yours,<br />\nH. F.,<br />\n<br />\nIn the middle of the 18th Century in France, a group of Mentarians organized under the leadership of Diderot and D'Alembert.<br />\nthe two editors of the great Encyclopoedia, along with the loud<br />\nchampionship of Voltaire. Here<br />\nare some of the campaign cries:<br />\n\"Unite all our followers. Courage! Let us all pull together, Gentlemen, numbers always command<br />\nrespect. Rise in revolt and you<br />\nwill be masters! . . . It is disgraceful that philosophy cannot<br />\ndo for us what it did for the ancients. It united them; here only<br />\nsuperstition has that privilege.\"—<br />\nVoltaire, in a letter to D'Alembert,<br />\ndated in 1753.<br />\n\"Happy are men of letters if<br />\nthey recognize at last that the<br />\nsurest way of making themselves<br />\nrespectable is to live united and<br />\nalmost shut up among themselves<br />\n(i. e., without obligations to a patron); that by this union they will<br />\ncome to give the law to the rest<br />\nof the nation in all affairs of taste<br />\nand philosophy . . . As if the art<br />\nof instructing and enlightening<br />\nmen were not after the too rare<br />\nart of good government, the noblest<br />\nportion and gift in human reach.\"<br />\n—D'Alembert's Manifesto,<br />\nabout 1750.<br />\n<br />\n(Continued from Page 2, Col. 5)<br />\nthe author of Main Street realized<br />\nthat there was a focal center for the<br />\noverthrow and destruction of Main<br />\nStreet. But the spirit of rebellion<br />\nhere is so vague and unreal that the<br />\ntig handy-man can only steal away<br />\nin the night to leave Gopher Prairie<br />\nto stew in its own juice. Maybe that<br />\nis all that one could expect in this<br />\ncolantry in 1919, but cer%ainly the<br />\nleast Lewis could have done, had he<br />\nunderstood more clearly the alignment of social forces, was to sow the<br />\nseed of a real hope, to let shine forth,<br />\neven if only for a moment, a small<br />\nray of the future. He did not. Because, seeing Dr. Kennicott and Vida<br />\nand Percy Bresnahan and the others<br />\nhappy and contented,. and Carol always on tender-hooks, Lewis began<br />\nto think that maybe their way of life<br />\nwas right and Carol's was wrong.<br />\nHe wondered whether Carol was not<br />\nlike the chorus girl who remarked<br />\nthat she was the only one in line<br />\nwho was in step. Lewis was confused on this point and the result<br />\nwas that the development of Carol's<br />\ncharacter was lost in the emotional<br />\n<br />\nRamblers To Give Music<br />\nSir Norman Approves<br />\nAfter Barnstomer Play Student Peace<br />\nMovements<br />\nThe Ramblers, one of Baltimore's<br />\nfinest bands, have been booked as<br />\nthe feature attraction of the dance<br />\nto follow the Barnstomer production<br />\nof \"The Firebrand.\"<br />\n<br />\nAnnouncement<br />\nof the booking marked the end of<br />\npreparations for one of the gala occasions of the year. Miss Molly<br />\nShriver had already been announced<br />\nsponsor for the -affair.<br />\nSale of tickets, which began in<br />\nLevering Hall yesterday, will continue until eleven-thirty Saturday.<br />\nStudent activity cards must be exchanged for reserved seats. Extra<br />\ntickets for the show and the dance<br />\nsell separately for one dollar each.<br />\n<br />\nand ideological confusion of Sinclair<br />\nLewis.<br />\n(A fourth novel, closer to the<br />\nreviewer's ideal, will be reviewed<br />\nin a later issue.)<br />\n<br />\nWorkers Of The World!<br />\n(Continued from Page 4, Col. 6)<br />\nOscar. Don't give me none of your<br />\ntalk, Buffington. You ain't no proletarian. You're a traitor to them.<br />\nYou and all the rest of the halfwitted intellectuals.<br />\nBuff. (Aroused).<br />\nGet out, you<br />\nimbecile!<br />\n<br />\nUnredeemed Microscopes<br />\nCameras, Binoculars, Musical<br />\nInstruments, Typewriters<br />\n—.-<br />\n<br />\n118 N. LIBERTY STREET<br />\nPLaza 3495<br />\n<br />\nporter, Sir Norman Angell expressed approval concerning the<br />\nAmerican Student Peace Movement.<br />\n\"If the Student Peace Movement consists of organized discussion, a thrashing out of both sides<br />\nof the question, and intelligent<br />\nthinking about peace, then I am<br />\nin favor of it.\"<br />\n<br />\nSecrist Will Speak At<br />\n0. D. K. Assembly Thursday<br />\n(Continued from Page 1, Col. 6)<br />\nand leadership. 2. Scholarship. 3.<br />\nAthletics. 4. Publications. 5. Other<br />\ncampus activities.<br />\nAlthough the<br />\ncharacter of 0. D. K. allows three<br />\nper cent of the Junior and Senior<br />\nclasses to be admitted to the circle,<br />\nthe Hopkins chapter has only five<br />\nmembers, instead of the maximum of<br />\n<br />\nmovement's a fizzle. And in the twelve members.<br />\ngreatest hour of my career, too.<br />\nDuring the period since its origin<br />\nJulius. But isn't there anything here 0. D. K. has admitted many faculty members. Those who are now<br />\nI can do?<br />\ncopies of the Manifesto to many of<br />\nat<br />\nthe University are President<br />\nthe leading writers and thinkers of<br />\nOlive. Now isn't that fine of him,<br />\nIsaiah Bowman, Dean E. W. Berry,<br />\nVee. To stick with us.<br />\nthe nation. Many answers were reBuff. No, no. Thank you, son. Dr. J. B. Whitehead, Dr. W. V. Weyceived—some favorable, some unfavorable. For example, Josoph Wood<br />\nYou've been a great help. But your forth, Dr. John C. French, Dr. A. G.<br />\nOscar. (In a roar). Ha, ha, ha.<br />\nChristie, Dr. R. S. Roulston, Dr.<br />\nKrutch, editor of The Nation, wrote:<br />\nservice lies elsewhere. Let me be the<br />\nHo, ho, ho. Never read Marx.<br />\nBroadus<br />\nMitchell, Dr. Knight Dun\"Thanks for the copy, which I have<br />\nmartyr. I've earned the right. You<br />\nBuff. Men, get that imposter out<br />\nlap, Dr. George Boas, Dr. Wardlaw<br />\nread with interest and amusement.<br />\nknow my aims, ideals, and hopes for<br />\nof here.<br />\nMiles. I am afraid that I agree with most<br />\nthe working class. Follow them when<br />\n(The two start toward Oscar, but<br />\nof it.\"<br />\nI'm no longer in your midst. Perhe climbs up on the back of the<br />\nhaps, at some future day I- shall reMovement Given<br />\nSecond Cotillion To Be<br />\ncouch, pulls up the shade, opens the<br />\njoin you—returning from prison,<br />\nwindow,<br />\nand starting to crawl<br />\nSpace In \"New Republic\"<br />\nHeld On February 14<br />\nfrom Elba. Leave. Your duties' elseThe next step was the publication through, turns about, facing Buffingwhere. Remember: there must alof a letter by the founder of the ton.)<br />\nThe Second Cotillion will be. held<br />\nways be some to carry the seed of<br />\nOscar. Call your dogs off, Buffmovement in the New Republic of<br />\nFebruary 14, according to an antruth<br />\nfar<br />\nfrom<br />\nits<br />\nunfortunat<br />\ne<br />\nparOctober 9, 1935. Bruce Bliven, the ington. It's too late. I knew all<br />\nent. Julius, my Boswell. (He shakes nouncement made by Alan DeleveLL,<br />\npublisher of the magazine, expressed about this, and tipped off the cops.<br />\nhis hand.) Go, lad. May we meet chairman of the Cotillion Board last<br />\nconsiderable interest in the project in The whole place is surrounded. Come<br />\nSaturday.<br />\nin<br />\nUtopia.<br />\na private letter to society headquar- on comrade: you and I are the same<br />\nAlthough there is no definite anJulius. But, Mr. Buffington, I hate<br />\nters. It is probably from this notice party. You ain't going to stay with<br />\nto leave you like this. You need me. nouncement of the orchestra to be<br />\nin the New Republic that the writer these wind-bags now, are you?<br />\nBuff. No, it's too dangerous. And featured, plans are under way to seComrade.<br />\nof the Judge editorial received his inWill well. Maybe I<br />\nain't a Communist after all. So long, let's be cheerful. They can't arrest cure one of the leading lights in the<br />\nformation.<br />\nme. Remember, I am the masses. orchestra world.<br />\nThen during the months of October Buffington.<br />\nThe<br />\nmasses. The pressure of the<br />\nand November, the society received<br />\nOscar. Suire, Buffington, there's<br />\nmany letters from all parts of the cops for blocks around. And when working-class will hammer down my<br />\nN. S. L. To Discuss<br />\ncountry—in sympathy or protest they find you with that bomb, well-- prison walls. Their enthusiasm will<br />\nagainst the New Republic article. see if you can sell 'em a couple of be fired by my failure. I'll turn deA. S. U. Formation Here<br />\nLetters came in from towns in Flor- your books on Marx. Ho, ho, ho. feat into victory. I'll stir revolution<br />\nThe formation of the American<br />\nfrom my cell. WORKERS OF THE<br />\nida, Ohio, and Pennsylvania—from (They exit).<br />\nStudent Union and the sending of<br />\nWORLD<br />\nUNITE.<br />\nPhiladelphia, New Haven, New York,<br />\n1st Bomber. Jeez, de cops. Come<br />\ndelegates to its first national conBoston, and Chicago. One of these is on, Jo, let's get out. We's really read<br />\nAll. WORKERS OF THE WORLD<br />\nvention will be the subjects of disreproduced elsewhere on this page. Marx, see, Mr. Buffington, dat's our UNITE! (Curtain.)<br />\ncusion at the meeting of the NaIn San Diego, California, the So- profesion—so ther ain't no use in us<br />\n(This should be sufficient to make tional Student League on Wednesciety has been communicating with stayin to face the music. (Start<br />\nthe point; the rest of the play will be day at 4 p. m. in Levering Hall,<br />\nsome West Coast Mentarians of a toward door.)<br />\npresented only on demand.—E. K.) Room B.<br />\nsympathetic turn. The I. B. H., a naBuff. Back! Back!<br />\nI say, you<br />\ntive organization along the lines of mercenaries. (They march out, heedthe Eastern society, may have pre- less.) Alone—deserted and betrayed<br />\nsented at its Christmas Convention a by my allies. In the greatest hour of<br />\nreading of the Mentarian Manifesto. my life.<br />\nAccording to the founder, this is<br />\nJulius. Not by all, sir. You still<br />\ncertainly a remarkably rapid growth have me. Shall I grab the bombers<br />\nand the organization at the Hopkins, before it's too late?<br />\nthe local, central society, might well<br />\nBuff. No, no, never mind. It's<br />\ngrow to set the pace for the country. in the nature of things. I'm<br />\na fizzle.<br />\nMemberships are open: Apply P. 0. We radicals, we true<br />\nhumanitarians<br />\nBox 516.<br />\nhave always been fizzles. The whole<br />\n<br />\nCHRISTMAS SHOPPING<br />\nIS EASY<br />\nat HUTZLER'S!<br />\n<br />\nHOME FOR THE<br />\nCHRISTMAS<br />\nHOLIDAY?<br />\nAtikaa you& tygagei<br />\n<br />\nQU1CKLYaa ECONOMICALLY<br />\nDon't spoil the thrill of getting home again by worrying<br />\nabout the shipment of your baggage. Solve the problem by<br />\nleaving everything to Railway Express. We will call for<br />\nyour trunks, baggage and personal belongings and send<br />\n<br />\nJust looking around will give you<br />\nplenty of ideas. Or-you can consult our Shopping Service<br />\nabout what Mother,<br />\nSister, or The Girl would like.<br />\n<br />\nthem home on fast passenger trains through to destination.<br />\nYou can take yourtrain home with peace ofmind —knowing<br />\n<br />\nAnd how about picking out what you<br />\nwill get with Dad's<br />\nChristmas check?<br />\n<br />\nExpress service is a decided economy in expense, too.<br />\nAfter vacation,send your baggage back the same way.<br />\nWe give a receipt on pick-up and take a receipt on delivery...double proof of swift, sure handling.<br />\nFor service or information merely call or telephone<br />\n<br />\nthat your baggage will be there quickly and safely. Railway<br />\n<br />\nHum(13FORIEM<br />\n<br />\nNew Philadelphia, Ohio.<br />\n<br />\nNEW YORK<br />\nLOANS OFFICE<br />\nLOANS<br />\n•<br />\n<br />\nIn a short and hurried personal<br />\nstatement to a NEWS-LETTER re-<br />\n<br />\n—<br />\nSPORTS CENTRE<br />\n<br />\nSKATE AT<br />\n<br />\nC.C.M. and Spalding Skates on sale<br />\n<br />\n4/6<br />\n<br />\nCall PLaza 1696<br />\nFor QUICK LOANS On<br />\nAUTOMOBILES<br />\n<br />\nPUBLIC LOAN CO.<br />\n232 - 34 EQUITABLE BUILDING.<br />\n<br />\nCHARLES and FAYETTE STREETS<br />\nVErnon 0600<br />\nDEPOT OFFICE: 203 E. FRANKLIN STREET<br />\nVErnon 0600<br />\nBALTIMORE, MD.<br />\n<br />\nRAITAwAv<br />\nEXPRESS<br />\nAGENCY, INC.<br />\n<br />\n,ticlesin<br />\n\"<br />\nReaders .D<br />\nBes<br />\nitgem<br />\ns'<br />\nt:g<br />\n[<br />\nBest A<br />\nMagazines<br />\nFor Price of One\"<br />\n[Special gift prices for Christmas<br />\nM. A. Wessel, Agent — Box 1063 1<br />\n—.J<br />\n<br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and 33RD STREETS<br />\nNext To Birely's<br />\n<br />\nJATION -WIDE RAIL- AIR SERVICE<br />\nTUNE IN ON THE RAILWAY EXPRESS NEWS PARADE<br />\nEvery week from the following stations:<br />\nWEE!• WOR • WHK • WLS •KWK • WDSU • WFAA<br />\nWGST • KYA • KNX • KSTP • KOMO • WBAL • ROIL<br />\nWatch for loco/ announcements<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., DECEMBER 10, 1935<br />\n<br />\n4<br />\n<br />\nown good.<br />\nBuff. True to your emotions?<br />\nWell, well. A whale is true to his<br />\nemotions; a walrus, to his; an oyster, to his; maybe, even an ape is<br />\ntrue. But an intellectual and a revolutionary, NEVER.<br />\nCome, gentlemen.<br />\nOlive. Oh, George, don't be so<br />\nsmart. Don't you love me any more?<br />\nDon't you know what it means to<br />\nme? For our future, George—don't—<br />\nBuff. Now lisWn to me, Olive-.<br />\nThis IS our future. And when the<br />\nmind starts to build, then there's no<br />\ntime for love—and the emotions.<br />\nSee? If men were true to their emotions,they'd be no better off than<br />\nthose animals I just showed you who<br />\nARE true.<br />\nOlive. Oh-h-h. I feel faint. I'm<br />\nslipping. The lights, Vee, the lights.<br />\n(She faints.)<br />\nBuff Quick, comrade, get some<br />\nwater. (The comrade rushes off.)<br />\nJulius. Can I help any, Mr. Buffington?<br />\nBuff. No, no. No help. Get that<br />\n(Silence.)<br />\nwater, quick, comrade.<br />\nHurry, fool, hurry. (He looks at her<br />\nvery carefully.) Olive! She's coming to. Wake up. Don't scare me<br />\nlike that. (Comrade arrives with the<br />\nwater, dashes her face with it, runs<br />\n<br />\nWORLD!<br />\nWORKERS OF THE<br />\n••<br />\nThe Farce Of Our Revolutionaries:- •• -:<br />\n<br />\nWhat will Trotsky say? I'll be the<br />\nstock—<br />\nlaughing<br />\nBuff. Well, then, what's<br />\nthe<br />\nOlive. Ha, ha, ha. Oh, Vee, havetrouble?<br />\nof humor?<br />\nComrade. He went and tied me haven't you any sense<br />\nBesides, Trotsky hasn't written to<br />\nup. That's what.<br />\nmy<br />\n(While they are talking a spy slips you since the time you sent him<br />\nlove letters by mistake. Read on—<br />\nin under a couch, unseen.)<br />\nlook for my name.<br />\nOlive. You fool.<br />\nWhat did you<br />\nJulius. What else does it say, Mr.<br />\nlet him tie you up for?<br />\nBuffington?<br />\nBuff. Quiet, Olive. Listen, man,<br />\nBuff. (He reads on) \"The story<br />\nwhat did we tell you to? Can you<br />\nof Buffington's start in matters<br />\nremember that?<br />\nrevolutionary is highly revealing of<br />\nComrade. No, sir, I don't.<br />\nBuff. You don't remember? Lord, his character. As a small lad, his<br />\nfather once took him to meet the<br />\nwhy not?<br />\n(Continued from Page 1, Col. 1)<br />\n<br />\nComrade. Cause I didn't underPresident in the White House. For<br />\nstand what you said. I ain't never the old man, a small-town politician,<br />\nunerstood them big words you use.<br />\nthe trip was an award for counting<br />\nBuff. Damnation! A fine time to .he votes wrong in the election. Now<br />\ntell us that.<br />\no understand the story, it's necesJulius. But, comrade, we talk the sary to explain that Buffington had<br />\nlanguage of Marx and Engels. Your )ne of the most remarkably effusive<br />\nlanguage! For it was certainly in )1adders ever recorded in one so<br />\nyour interest that they laid down oung. He was as eternally moist<br />\ntheir thoughts and life work.<br />\nis the western coast of the Atlantic<br />\nComrade. You're right. We got icean. So, in the midst of the most<br />\nto speak good Anglish.<br />\n,ober formalities, seated on the most<br />\nBuff. Good English, sure. And I eremonious knee of the chief execuconfess it's very sad that we do. You jve, his unfortunate system broke<br />\nsee we of the working class could down and sobbed itself away. That,<br />\nonce curse and slang and talk our you see, is the start of his revolusalty dialect all we wanted to. But, tionary career.<br />\nThat, in short, is<br />\nalas, it's no longer ours. We've been 13uffington.\"<br />\nrobbed of our tongue. Their novelI can<br />\nOlive. My, so like you.<br />\nists use our \"ain'ts\", \"cripes\" and almost believe it. You never know<br />\n\"damns\". Their once-charming essay- when to stop.<br />\nists now overhear our sailors and<br />\nAny<br />\nJulius. That's libel, sir.<br />\nrailroadmen and jot down our most<br />\nmore?<br />\nvulgar thoughts. Society says, \"Oh,<br />\nBuff. This is miserable. I can't<br />\nyeah,\" \"lousy,\" and \"Come seben.\"<br />\nit.<br />\nSo what remains to you, comrade, read more. I can't stand<br />\nDoes it<br />\nit?<br />\nwrote<br />\nWho<br />\nJulius.<br />\nand me? Nothing but the colorless<br />\nsay?<br />\nheir<br />\nladorables\"—t<br />\nand<br />\n\"axquisites\"<br />\ncast-off grammar of a fOrmer day.<br />\nBuff. Let me see. It sounds like<br />\nNo use fooling ourselves. These are —Yes, sure, it's Lovebalm.<br />\nthe tools with which we must wage<br />\nSuch impuOlive. Lovebalm!<br />\nclass warfare . . .<br />\ndence.<br />\ntruth,<br />\nit<br />\nthe<br />\nComrade. Ain't<br />\nBuff. This can't be allowed to go<br />\nthough? Sure, sure!<br />\non. It's got to be shut up. And<br />\nOlive. Vee, Stop. Can't you see<br />\nright away. Listen, men. We're not<br />\nthe poor fellow wants to tell us somegoing to bomb Smith tonight. There's<br />\nthing?<br />\nonly one thing to do before it's too<br />\nBuff. Yes, certainly. What haplate. And that's Lovebalm. We've<br />\npened, comrade?<br />\ngot to put him out of the way.<br />\nComrade. I was so scared. I donOlive. Vee, you're not serious<br />\nto<br />\nthe \"Worker<br />\nno, see. But I went<br />\nabout this?<br />\nPress\" building<br />\nBuff. No? Let me have that phone.<br />\nJulius<br />\n(together).<br />\nOlive,<br />\nBuff,<br />\ntakes the phone). Hello, opera(He<br />\nWell?<br />\nHello,<br />\nComrade. I saw a man come out. tor, quickly, Calvert 3030.<br />\nSo I went and asked him where revolutionary sUpply shop. Hello—<br />\nHe says he don't yes, I know—red bombs, red books,<br />\nLovebalm was.<br />\nred ties, red underwear—cut that<br />\nknow.<br />\nBuff. What'd the man look like? stuff out—this is Buffington. Yeah.<br />\nSend up another bomb,<br />\nComrade. I dunno. So dark, so Listen.<br />\ndark. But he looked a little like old<br />\nLoveblam. But if he don't know, it<br />\nain't my business to call him liar.<br />\nThen sure enough, soon's I turned<br />\naround, he stuck a pistol in my back,<br />\nhanded me a paper, and said, \"Man,<br />\nyou better run like hell, and if you<br />\ndon't give this to Buffington, I'll<br />\nshoot you down, straightway.\"<br />\nJulius. I thought you were tied<br />\nup?<br />\nComrade. I dunno. I forget, see.<br />\nSo dark, so dark!<br />\nBuff. Oh, bother the story. Let<br />\nme see that paper, man. Quick!<br />\n(Starts to read the headlines). \"Lovebalm Joins Forces With Communists!<br />\nUnited Front Against Buffington.<br />\nTwo hundred men sign resolution to<br />\nthwart, picket or ignore Buffington.<br />\nBuffington's<br />\nof<br />\nstory<br />\nAmazing<br />\nin<br />\nexposed<br />\ncareer<br />\nblackguardly<br />\n<br />\nBy EDGAR KEMLER<br />\n<br />\nIt's for<br />\ndouble strong mixture.<br />\nLovebalm. Changed my mind, see.<br />\nMake it fast. What? You say you<br />\nhaven't been paid for the last one.<br />\nGood heavens, man, I'll pay you after<br />\nthe revolution. VVha-at? No credit<br />\n—you don't believe in the revolution?<br />\nWhat a hell of a proletarian you are?<br />\nLet Lovebalm pay for it.<br />\nListen.<br />\nre's charged enough to my account.<br />\nSure, take it out of his insurance<br />\nmoney. No? To hell with you, then,<br />\nyou double-crosser. (He slams down<br />\ntile receiver).<br />\nJulius. Can't we use just the one,<br />\nMr. Buffington?<br />\nBuff. That's what we'll have to<br />\nMen, you know the address.<br />\ndo.<br />\nComrade, this is your one great opportunity to vindicate yourself. You<br />\ncome with us. You're used to this<br />\nsort of thing. You'll throw the body<br />\nin the river, or bury it. I don't care.<br />\nOlive. Vee, how could you. If<br />\nI thought you meant it, I'd shoot you<br />\nfirst.<br />\nBuff. Stupid, of course I mean it.<br />\nCome, hurry, men, we've no time to<br />\nFirst, plant the bomb. Seclose.<br />\nond—<br />\nOlive. Why must you terrorize<br />\nthe poor fellow?<br />\nBuff. Havent you heard what he's<br />\nwritten? He'll ruin my career.<br />\nOlive. You never think about me<br />\n<br />\n, Noise (under couch). Ho, ho, ha,<br />\ncourse not<br />\nBuff. That's simple. Who is the ha. Never read Marx—of<br />\nha, ha.<br />\ngreatest economist? Obviously, Karl —that's rich—ha,<br />\nshaggy-looking, wind-blown<br />\n(A<br />\nMarx. Therefore, he is the greatest<br />\ndoctor, too, just as castor oil is the little man emerges from under.)<br />\n<br />\nsir?<br />\n<br />\nOlive. Well, what business is it<br />\nof yours? Besides, you know I love<br />\nall men. You've often said so.<br />\nBuff. You get me angry, Olive.<br />\nWhy the deuce do you bring love into<br />\nthe picture, at a time like this?<br />\n<br />\nno doubt about it.<br />\nJulius. Who shall I send for then,<br />\n<br />\nCHARLIE DER<br />\nFirst Class Laundry<br />\n3224 GREENMOUNT AVE.<br />\nQuality Hand Work at Our<br />\nLow Prices<br />\n<br />\nOlive. I'm true to my emotions.<br />\nPlease don't bomb tonight. For your<br />\n<br />\nBoulevard<br />\n<br />\nBarber<br />\n<br />\nShop<br />\n<br />\nS. E. Corner Saint Paul & 33rd Streets<br />\nEntrance on 33rd Street<br />\nWeek Days-8 A, M. to 7:30 P. M.<br />\nSaturday-8 A. M. to 9 P. M.<br />\n<br />\nIGB<br />\n<br />\nmV 45<br />\nii S<br />\n4k.<br />\nROUND iRIP*<br />\nGRyfki.tyb rAREss<br />\nRefec„tiv kis<br />\n}<br />\n0Jah.IED<br />\nREDUC<br />\nre<br />\n411<br />\n<br />\nBelo<br />\n<br />\nebt-uaryi<br />\n<br />\n-<br />\n<br />\nChas. Landler, Prop.<br />\n<br />\nHAIRCUTS-40c<br />\n<br />\nComrade (Once more he's back in<br />\nJulius. But Karl Marx is dead, the room, returning unnoticed.) Oscar, my friend, I thought you was a<br />\nSi'..<br />\nCommunist. I thought you was one<br />\nBuff. Of course, of course.<br />\nus.<br />\nof<br />\nJulius. Well, what shall we do?<br />\n<br />\ngreatest of all revolutionaries.<br />\n<br />\nJulius. Shut up, comrade.<br />\nYour wife's desperately ill.<br />\nOlive. Oscar, the inter-party spy!<br />\nBuff. We do what is next best.<br />\nBuff. Who let you in?<br />\nJulius. What's that?<br />\nOscar. I didnt have to be invited.<br />\nBuff. We find the one who is<br />\nmost representative of Karl Marx on You don't need no hand-carved invitations when you're the ambassaEarth.<br />\ndor of fifteen million hungry workJulius. But where?<br />\nBesides, your comrade over<br />\nfrom men.<br />\nvolumes<br />\nBuff. (Taking<br />\nwe was all the same<br />\nthought<br />\nthere<br />\nthis<br />\nsee<br />\nyou<br />\nbook-shelf). Julius,<br />\nparty. He showed me the place here.<br />\nvolume?<br />\nI followed him. Why ain't you never<br />\nJulius. Yes, sir.<br />\nBuff. \"The Essence of Karl Marx. told him where he belongs?<br />\nComrade. Yeah. Why ain't you<br />\nA fine book. I wrote it.<br />\ntold me?<br />\nnever<br />\nJulius. Then you're the—<br />\nBuff. My God, a traitor, too,<br />\nBuff. Not yet. Wait. Here now<br />\nwe have this one, too. \"An Answer Comrade!<br />\nOscar. Aw, shut up, Buffington.<br />\nto Buffington's Essence of Karl<br />\nYou aamned fake. Never read Marx!<br />\nMarx.\" I wrote this.<br />\nI thought not. Cheap windbag. So<br />\nOlive. Vee, please.<br />\nyou expect to blow up Lovebalm,<br />\nsir,<br />\nSurely,<br />\nJulius. Your wife?<br />\nafter spending your life in tiddlyyou're the great doctor then!<br />\nthe<br />\nBuff.Yes, yes. But listen, Julius. winks filling up the mouths of<br />\ntheories.<br />\ngassy<br />\nof<br />\nlot<br />\na<br />\nwith<br />\nmasses<br />\nAn<br />\nyou<br />\nsomething.<br />\ntell<br />\nto<br />\nI'm going<br />\nThey don't want that. They don't<br />\nabsolute confidence.<br />\nyou. You don't care a damn for<br />\nwant<br />\nagain.)<br />\nout<br />\nJulius. Yes.<br />\nin<br />\nOlive. (Opening her eyes.) Well,<br />\nBuff. Very few know of its truth them. You ain't touched a spade<br />\nof<br />\ndrop<br />\na<br />\nearned<br />\nhave<br />\naint<br />\nneedn't<br />\nfor heaven's sacks, you<br />\n—and no one could possibly guess it. your life. You<br />\nAll you care for in this<br />\nsweat.<br />\nhad that idiot throw water all over<br />\nJulius. Yes.<br />\nme—and spoil my dress.<br />\nBuff. These are the most authori- crazy world is your own reputatian.<br />\nSo a trick! tative texts—interpretations of Marx At a time when the country bawls for<br />\nBuff. Your dress?<br />\na good leader, you throw bombs at<br />\nAnd so old and hackneyed! Come, —youll find anywhere.<br />\nanother gassy high-brow. I hope to<br />\ngentlemen, let's be going.<br />\nJulius. I don't doubt it.<br />\nvery<br />\nfeel<br />\nI<br />\nill.<br />\nI'm<br />\nGeorge,<br />\nOlive.<br />\nBuff. Well, the truth of the mat- hell you kill each other.<br />\nMy dear<br />\nDon't go.<br />\nBuff. (Patronizingly).<br />\nsick.<br />\nter is—look, I've NEVER read Marx!<br />\nJulius. Shall I call a doctor, Mr. Never looked within the covers in fellow—<br />\nShe looks white as my life. Never read a line.<br />\nBuffington?<br />\n(Continued on Page 3, Col. 4)<br />\nchalk.<br />\nBuff. Yes, she looks pretty bad.<br />\nBut no, no doctor. What she needs<br />\n<br />\nany more.<br />\nBuff. Please don't nag, Olive. It's<br />\nnot becoming.<br />\nOlive. I won't pay for last month's<br />\nlaundry if you go.<br />\nBuff. Be reasonable, Olive.<br />\nis an economist.<br />\nOlive. I'll become terribly sick if<br />\nJulius. An economist? Good heavyou do him any harm.<br />\nens, sir, your wife is sick.<br />\nBuff. Who, Lovebalm? How do<br />\nBuff. Young man, I repeat. She<br />\nyou know him?<br />\nneeds an economist. The source of<br />\nOlive. I—I don't, exactly.<br />\nall literature, all art, all thought, all<br />\nBuff. Certainly, you know him. history, all revolution, and certainly,<br />\nYou like him. I suppose you love all disease is economic. There can be<br />\nhim.<br />\n<br />\nIf you're right?<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\nBaltimore<br />\n12-20 Hopkins Place<br />\n<br />\nGet New Low Fares<br />\nOther Information<br />\nFrom Greyhound<br />\nAgent<br />\nThese big reductions effective nearly everywhere.<br />\nDrop in, or telephone for<br />\nspecific details.<br />\nBUS<br />\nGREYHOUND<br />\nTERMINAL<br />\n217-221 W. Baltimore St.<br />\nPhone: PLaza 0520<br />\nCampus Agent — M. L.<br />\nKrieger, E. 22 Dormitory,<br />\nCHesapeake 4912.<br />\n<br />\nors<br />\n<br />\nTHE BARNSTORMERS<br />\nPRESENT<br />\n<br />\n\"THE FIREBRAND\"<br />\n\"THE<br />\n<br />\nS.A.C.<br />\n<br />\n—or—<br />\n<br />\nAFFAIRS<br />\n<br />\nOF<br />\n<br />\nCELLINI\"<br />\n<br />\nan invective!<br />\nJulius. Isn't it true, sir?<br />\nBuff. Of course—but what difference—it's the damnest thing I've<br />\never had.<br />\nJulius. I'm afraid I don't understand, sir? What could be bad about<br />\nbeing an American?<br />\nWhy, boy, that's<br />\nBuff. Bad?<br />\nmiserable. Who, of any importance<br />\namong radicals is an American? All<br />\nour great leaders, thinkers, scholars,<br />\nfigures worthy of the least reverence, are Poles, Slovaks, Czechs,<br />\nHungars, Letts, Russians, Tartars,<br />\nAmerican.<br />\nbut<br />\nCracks—anything<br />\n<br />\nDANCING<br />\nTHE<br />\n<br />\nEXCHANGED<br />\n<br />\nIN<br />\n<br />\nLEVERING HALL<br />\n<br />\narticle on inside pages.\"<br />\nJulius. Great guns, Mr. Buffington! That's the biggest challenge<br />\nwe've ever had.<br />\nOlive. Does it mention me, Vee,<br />\nin the article?<br />\nBuff. (He turns quickly to inside<br />\npages). Well, I'll be damned. Look<br />\n\"Although<br />\n(He reads).<br />\nat this.<br />\nBuffington has done the best he could<br />\nto conceal his ancestry, there is irrefutable evidence that he's from an<br />\nAmerican family, traced to the Mayflower. There can be no doubt. Buffington is a Yankee. Down with Buffington!\" God, Olive, that's an insult!<br />\nThey call me an American. What<br />\n<br />\nCARDS<br />\n<br />\nAFTER<br />\n<br />\nSHOW<br />\n<br />\nBY<br />\n<br />\n\"THE RAMBLERS\"<br />\n<br />\n•<br />\n<br />\nMARYLAND<br />\n<br />\nCASUALTY<br />\n<br />\nAUDITORIUM<br />\n-0 N —<br />\nSATURDAY, DECEMER 14th<br />\n8:30 P. M.<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\n3J- oiIns /*whim NriusiErttrr<br /><br />\nVol. XL—No. 18<br /><br />\nMiss Shriver Is<br />\nDance Sponsor<br />\nAfter Firebrand<br />\nMd. Casualty Auditorium To<br />\nBe Scene Of Barnstormer<br />\nPlay On December 14<br /><br />\nSkit Presented<br />\nBarnstormers Playlet Given<br />\nAt Assembly Yesterday To<br />\nSophomores And Frosh<br />\nMiss Molly Shriver is the sponsor<br />\nof the dance, following the play, The<br />\nFirebrand, which will be presented<br />\non Saturday, December 14, in the<br />\nMaryland Casualty Auditorium. Music will be supplied by the \"Ramb-<br /><br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, DECEMBER 6, 1935.<br /><br />\nZierler Elected Editor<br />\nOf'News-Letter' By Staff<br />\nKenneth Zierler, president of Pi<br />\nDelta Epsilon, honorary journalistic fraternity, was elected editor-in-chief of the NEWS-LETTER at<br />\na meeting of the combined editorial and business staffs of the<br />\npaper last Tuesday before the<br />\nThanksgiving holidays.<br />\nHe defeated Irving Leberfeld, who also<br />\nwas nominated for the office by<br />\nthe Board of Control.<br />\nRemaining as advisory editor of<br />\nthe NEWS-LETTER, Jesse Borden,<br />\nretiring editor-in-chief, will be an<br />\nex-officio member of the Board of<br />\nControl.<br />\nAnnouncement was made that<br />\nthe Editorial Board will be dissolved, to centralize the policy of<br />\nthe paper.<br />\nAt the same meeting, Dave Caplan and Bernard Pinck were elected sports editors.<br /><br />\nlers.\"<br /><br />\nDecember 18 Date<br />\nOf 2nd Gymboree<br /><br />\nSEE<br />\nEDITORIALS<br />\nON PAGE 2<br />\nPrice<br /><br />\nFive Cents<br /><br />\nCompton Treats Cosmic Rays<br />\nDr. Ames Reports Norman<br />\nIn First Dohme Talk Tuesday Definite Success<br />\nSpeaks<br />\nGives Comprehensive Survey Of Cosmic Rays Before Large Of J.11. U. Purposes<br />\nAudience; Won Nobel Prize In 1925; Dohme<br />\nHimself Introduces Speaker In Remsen<br /><br />\nAngell<br />\nToday<br />\nOn World Peace<br />\nFor<br /><br />\nCongratulates Trustees<br />\nSelection Of Dr. Bowman; To Point<br />\nOut Conditions<br />\nDefines J. H. U. Purposes<br />\nThat Will Lead To War In<br />\nIn the annual report of the PresiThis Peace-Loving World<br /><br />\nInaugurating the 1935-1936 season<br />\n\"The subject of cosmic rays origiof Dohme lectures, Mr. Dohme himnated at the beginning of the presself<br />\npresented<br />\nthe<br />\ndistinguished ent century with C. T. R.<br />\nWilson's<br />\nAmerican<br />\nphysicist,<br />\nArthur<br />\nH. experiments with conductivity of<br />\nair. dent, recently published, Dr. Joseph<br />\nCompton, from the University of<br />\nThe study progressed at various S. Ames recorded his last suggesChicago, to a capacity audience in<br />\nstages through certain discoveries in tions and criticisms as president of<br />\nRemsen 1, last Monday afternoon.<br />\nthe field of radioactivity, through the Hopkins, and at the same time<br />\nDr. Compton, one of the world's<br />\nthe discovery of the increase of con- congratulated the Board of Trustees Enjoyed Brilliant Journalistic<br />\nleading authorities on cosmic rays,<br />\nductivity of air at high altitudes and on the selection of Dr. Isiah BowCareer; Author Of \"Great<br />\nspoke on that subject, approaching<br />\nthe subsequent linking up of this man as his successor.<br />\nit from two sides, the properties of<br />\nIllusion\" Is A Knight<br />\nto cosmic rays until recent years,<br />\nWriting of the success of the Hopthe rays, including their origin, nawhen a great many physicists, kins in fulfilling<br />\nits underlying purA renowned observer of internature, and uses to man.<br />\nspurred on by the work of Robert poses, he states:<br />\nStressing the complexity of the<br />\ntional affairs will treat the timely<br />\nA. Millikan, have spent a great deal<br />\n\"It is not easy to suggest tests<br />\ncosmic ray problem and the relatively<br />\nsubject of Peace when Sir Norman<br />\nof time in various experiments.<br />\nby which it can be decided whether<br />\nsmall program yet made in that<br />\nAngell speaks today at 4 P. M. in La\"Discovery that the rays form one the University<br />\nis performing its funcfield, the speaker dwelt at length<br />\nof the most important types of energy tions properly or<br />\ntrobe<br />\n112, endeavoring to answer the<br />\non various phases of the subject.<br />\nnot. Certainly such<br />\nin the universe, energies varying tests as number<br />\nof students, hours question \"Why Does A World DesirAccording to him, the present theofrom particles with one billion elec- per week devoted<br />\nto class work by ing Peace Get War?\" The noted<br />\nries concerning the rays, claim that<br />\ntron volts to others with one thou- faculty or<br />\nstudents and so on have British author<br />\nthey originate at a point in interof The Great Illusion<br />\nsand billion volts has led to the de- little to do<br />\nwith the matter. The<br />\nstellar space at about 100 billion<br />\nwill talk under the auspices of the<br />\nmagnetism of the earth, high ener- success of<br />\nthe University, which in<br />\nlight years from the earth and after<br />\ngies in electrodynamics and the fea- my judgment<br />\nis definite, has been George Huntington Williams Memotraveling through the ether strike<br />\ntures of the universe billions of light assured in<br />\nthe past and will be rial Lecture.<br />\nthe earth uniformly from all sides.<br />\nyears in the past together with the assured in<br />\nthe future largely by the<br />\nAs to the manner in which they are<br />\nStopping here as a part of a short<br />\nsire for their use in the study of the attitude of<br />\nmind of the faculty and tour of the United<br />\nproduced, there exist conflicting<br />\nStates, the disthe nuclear of the atom.\"<br />\nthe spirit of devotion to the ideals<br />\nideas, he stated. Millikan, who has<br />\ntinguished British authority returns<br />\nexperiments to the breaking up of of the University<br />\nwhich permeate<br />\ndevoted years of study to the subto the scene of many years of his<br />\nSlides Illustrate Lecture<br />\nthe whole institution.<br />\nThe underject, attributes there rays to an<br />\nearly<br />\nlife as a prospector and rancher<br />\nDr. Compton closed the lecture, lying thought. naturally, is freedom<br />\natomic nuclear process of the buildof<br />\nthought<br />\nin<br />\nand<br />\nthe<br />\nwhich<br />\naction<br />\nwas illustrated by lantern<br />\nWestern States. Sir Norman<br />\nupon the part<br />\ning up of matter in space, while<br />\nProfessor Franck of the Hopkins slides, again bringing out the broad- of both students and faculty, and was born in 1874 and was educated<br />\nfaculty conceives them as a result ness and complexity of the mystery relief of the faculty as far as pos- by private tutors and later in France<br />\nof the formation of potential differ- of the cosmic ray and ventured the sible from administrative duties, and attended the Lycee of Paris.<br />\nences through the accumulation of thought that twentieth century phy- in fact from all duties except those<br />\nAfter spending some time in the<br />\ncharges of electric fields by the ex- sics was just beginning an immense- connected with their academic po- United States, Sir Norman returned<br />\nplosion of novae, which are new born ly long and difficult job with a goal sitions.\"<br />\nto Europe to be launched on a brilstars, he added. There are a num- important both for its own end and<br />\nDefines Purpose<br />\nliant journalistic career as an Amerber of other theories also prevalent, as a step in a further task. Man in<br />\nPreviously he defined the Univer- ican. correspondent.<br />\nHe achieved<br />\nbut nothing very definite is known struggling infinitely slowly, but none sity's purposes in saying:<br />\nfame in this capacity and continued<br />\nthe less surely to grasp another link<br />\nat present, the speaker continued.<br />\n\"The question which must be his success as a member of the Paris<br />\nin the endless chain which bears the raised constantly by the President<br />\nOrigin Of Cosmic Rays<br />\nin Daily Mail. Then he was promoted<br />\nDealing with the origin of the key to the fascinating riddle of our consultation with the faculties and to the editorship of Foreign<br />\nAffairs.<br />\nuniverse and of ourselves.<br />\nrays, the lecturer stated:<br />\nthe Board of Trustees is that of the<br />\nAuthoring many books on interna-<br /><br />\nBritain On U.S.Tour<br /><br />\nRepresentatives .of the Barnstormers Club presented a skit at the assembly entitled<br />\nThe<br />\nLighthouse<br />\nKeeper's Daughter. Those taking<br />\npart were B. Murphy, Weiss, Prager, 0. D. K. Sponsoring Annual Affair<br />\nAt The Gym; MacGill Urges<br />\nBranower, and Halle. Before the enLarge Attendance<br />\nactment of the skit Zenas Sears explained the story and setting of the<br />\nThis Gymboree is under the sponplay, which is laid in the Duchy of<br />\nFlorence where the Medici held soring of 0. D. K. and the direction<br />\npower. The action centered about of the<br />\nAthletic Department. John<br />\nthe love affairs of Cellini, a sculptor.<br />\nMacGill, president of the Student<br />\nHe stated:<br />\nActivities Committee, issued the folThe Firebrand will be without a lowing statement:<br />\ndoubt one of the best the Barnstorm\"The Gymboree last year was<br />\ners have ever presented. Hard work<br />\nvery successful, and we hope to make<br />\nby all staffs has done its part to<br />\nmake it a success. Your support will this year's event more successful. I<br />\nurge you all to attend and bring<br />\ndo the rest.\"<br />\nyour dates with you so that this<br />\nPutting the final touches to the<br />\nmay become one of the main social<br />\npreparations for the coming production, The Firebrand, next Saturday events of the year. In order to make<br />\nnight, the three staffs of the Barn- this even more a social event, the<br />\nstormers have literally been working fraternities are being urged to have<br />\nday and night to have everything let- parties following the Gymboree.\"<br />\nter-perfect by the time the curtain<br />\nElaborate Program<br />\nrises.<br />\nThe elaborate program will in<br />\nunderlying purpose of the University. tional conditions, Sir Norman is best<br />\nThe cast has been working for sev- elude two exhibition boxing matches,<br />\nThe Johns Hopkins University has known as the writer of the Great<br />\neral weeks under the tutleage of Mr. two or threet wrestling exhibitions,<br />\nbeen distinguished from its founda- Illusion, which has been translated<br />\nPaul Hinrichs, who is coaching his tumbling, perhaps<br />\nby a professional,<br />\ntion by its attention to this matter, in most of the countries of the world.<br />\nfirst Barnstormer play, although he<br />\ngroup fencing, and a grand finale in<br />\nand by its constant attempt to con- In 1931 he was knighted by the Brit(Continued on Page 3, Col. 6)<br />\nthe form of a Varsity vs. Alumni<br />\ncentrate upon its purpose.<br />\nUlti- ish monarch for his contributions to<br />\nbasketball game.<br />\nPete Reynolds,<br />\nmately this is two-fold; first, to pro- civilization.<br />\nFritz Stude, and Opie Chancellor will<br />\nvide opportunities for the individual<br />\nbe among the Alumni. Tleere will<br />\nmembers of its faculties to extend<br />\nalso be a badminton match between Medal Advanced For Paper Hopkins, Phi Psi, Wins Vice their investigations and studies into<br />\nFrank Roberts, Number One man<br />\nPresidency; J. Harrington certain fields of inquiry, and second,<br />\nOn Sewerage Works Built<br />\nof Mt. Washington, vs. Jimmy Bento prepare students anf teachers in<br />\nBeats Kempton For Post these fields. Education of a large<br />\nIn The City Of Columbus<br />\nson.<br />\nThe inimitable \"Rube\" Baer<br />\nwill be among the performers.<br />\nnumber of students has never been<br />\nThe Rudolph Henry modal has<br />\nRobert Ward, a pledge to Delta<br />\nTickets for the second annual<br />\nits purpose. Its students, in all stages<br />\nClergyman And - Educator Gymboree, to be held at the Gym been awarded to John H. Gregory, Upsilon fraternity and a student in<br />\nof their studies, advanced and otherWill Address Group In Wednesday, December 18, at 8:15 professor of civil and sanitary en- the School of Engineering, after a wise, are brought into contact with Major Bonamy Dobree, 0. B. E.,<br />\nnoted British lecturer and literary<br />\nLevering Hall At 6 P. M. P. M., are now on sale at $.40 per gineering at the Johns Hopkins Uni- long and hotly contested campaign, this spirit of the institution. It is critics,<br />\nwill deliver the Tudor and<br />\ncouple and $.25 stag.<br />\nversity, in collaboration with Orris was elected last Tuesday to the presi- true that degrees of various kinds<br />\nStuart<br />\nClub<br />\npublic lecture next WedDr. Thomas Guthrie Speers, wellThe following students are hand- Bonney, Sewerage Relief Engineer; dency of the freshman class over including the Bachelors' degree are<br />\nnesday, December 11, at 5 o'clock in<br />\nknown clergyman and educator, will ling the pasteboards: John MacGill, Robert A.<br />\ngiven,<br />\nbut the fundamental idea of<br />\nAllton, Sewage Disposal Arty O'Keefe, a Phi Psi pledge and<br />\nLevering Hall on the topic, \"Milton<br />\naddress the University Supper Club Meade Johnson, L. Emrnart, D. Levy,<br />\nthe institution is that it is open to<br />\nEngineer, and the late R. H. Simp- an A. B. student. Ward was the sole<br />\nand Dryden: A Comparison and a<br />\non an unannounced subject on the R. Levi, B. Murphy, T. Dukehart, J.<br />\nD. U. candidate for president of any students of all stages of development Contrast in Poetic Idea and Poetic<br />\nnight of Tuesday, December 10, at Bradford, R. Glanz, B. Pinck, S. son, ChieS Engineer, of Columbus, of the classes to win the toga. Last who are competent and desirous of<br />\nMethod.\" Baltimore; is one of the<br />\n6 P. M. in Levering Hall.<br />\nPrager, H. Severn, W. Hazlett, W. Ohio, for their paper entitled \"In- year three of the class presidents making progress in certain lines of cities Major<br />\nDobree is visiting on a<br />\nstudy, and formalities such as ex- tour of the United<br />\nDr. Speers, who speaks at the third Erlanger, M. Harmel, N. Soifer, H. tercepting Sewers and Storm Stand- were D. U.'s.<br />\nStates.<br />\nrequirements have been<br />\nmeeting of the club, will probably Maulsby, P. Umbarger, R. Watkins, by Tanks at Columbus, Ohio.\" The<br />\nThe vice-presidency of the class pressed by<br />\nAuthor of \"Restorative Comedy\"<br />\nbe introduced by Theodore Wiehe, F. Beehler, K. Zierler, W. Kempton, paper is descriptive of important went to Harry Hopkins, a student in reduced to a minimum. This policy and \"Restorative<br />\nTragedy,\" and a<br />\nR. Ward, J. Royster, E. Donnelly, B. sewerage and sewage treatment<br />\nmakes an institution which is quite number<br />\nchairman of the Supper Club.<br />\nthe College of Arts and Sciences<br />\nof other works dealing with<br />\nSpring,<br />\nS. Finkel, I. Gertman and<br />\nunlike the general type of college or the literature<br />\nThe speaker, who is a member of<br />\nof the late seventeenth<br />\nworks recently built by the City of and a pledge to Phi Psi, who defeatuniversity. It is quite impossible to century,<br />\nthe Presbyterian Board of National M. Kempton.<br />\nMajor Dobree was formerly<br />\nAlpha<br />\nChesley,<br />\nJohnny<br />\nDelta<br />\nPhi,<br />\ned<br />\nColumbus as a part of a comprehencompare the work of The Johns Uni- professor of English<br />\nMissions, was born in New Jersey.<br />\nat the Egyptian<br />\nsive program of river cleansing that an engineer. Cy Treib, a Phi Sig versity with that of other institutions<br />\nUniversity in Cairo and is a Fellow<br />\nAfter graduating from Princeton Finkel Wins Old Gold<br />\npledge, was elected secretary over<br />\nis being carried out by the city.<br />\nby any of the ordinarily accepted of the Royal Society of Literature.<br />\nUniversity in 1912 with Phi Beta<br />\nJoe Bowersox, Tau Alpha Phi, while<br />\nContest; Safier Second<br />\nMedal Awarded Annually<br />\nstandards or tests. The University In 1925 he lectured at the London<br />\nKappa honors, he received his B. D.<br />\nJohn Blucher, a Kappa Sig, took the<br />\nIn 1924 the Rudolph Hering medal<br />\nwill, I hope, never cease to consider University. He graduated from Camat the Union Theological Seminary<br />\ntreasurership from Abner Golden,<br />\nStanley Finkel, a sophomore in the was<br />\ninstituted and endowed by the<br />\nown problems in its own way, bridge University, receiving his masits<br />\nin 1916. He later obtained his D. D. College of Arts and Sciences, won<br />\nPhi Alpha neophyte. Bob McCarthy<br />\nSanitary Engineering Division of the<br />\n(Continued on Page 3, Col. 5)<br />\nter of arts degree in 1926.<br />\nat Wooster College in 1935.<br />\nof S. P. E., defeated Harold Ricards,<br />\nfirst prize in the score-guessing con- American Society<br />\nof Civil EngiIn Field Artillery<br />\na Kappa Sig, for sergeant-at-arms.<br />\nHe married Miss Elizabeth Thach- test sponsored by P. Lorillard &amp; Co., neers, and open to the award<br />\nof hte<br />\nOfficer<br />\nSoph<br />\nMeeting<br />\ncigarGold<br />\nmanufacturer<br />\nOld<br />\nof<br />\nBefore<br />\ntaking an absorbing inters<br />\ner in 1926 and has three children.<br />\nJimmy Harrington, Beta pledge,<br />\nmedal are all original papers which<br />\nest in literature Major Dobree held<br />\nIn 1915 he went to the Near East ettes. The $10 prize for guessing deal with any branch of Sanitary was the victor for the position of<br />\nAll Sophomore Class officers are a commission in the Royal Field Arwith Dr. Robert Spear. In 1916 he nearest to the scores of the Hopkins- Engineering and which are present- freshman representative to the Stuexpected to attend the meeting called tillery and served during the World<br />\nHaverford<br />\nCaliforSouthern<br />\nand<br />\nthe<br />\nbecame assistant and associate mined to the Society in finished form. dent Council, beating by a small<br />\nby John Royster, president of the War in France and with Allenby in<br />\nister of the University Place Pres- nia-Notre Dame /football games will It is intended that the award of the margin Murray Kempton, an Alpha<br />\nclass of '38, to be held Tuesday, Dec. Palestine. He matriculated at the<br />\nbe awarded to Stan in the near fu- medal<br />\nbe made annually and to the Delt and a member of the NEW:byterian Church in New York City.<br />\n10, in Levering Hall, at 12:30 P. M. Royal Military Academy in Woolture.<br />\nauthor or authors of that paper LETTER staff. For this post there were<br />\nDuring the World War he was<br />\nThis includes Jacobs, Christ, Coun- wich and was commissioned in 1910.<br />\nSecond prizes went to Sigmund Sa- which contains the most valuable originally<br />\nfive candidates.<br />\nchaplain in the 102nd Infantry in<br />\nselman and Clautice. Class plans for<br />\nFollowing his address Major Dofier, who will receive $5. T. W. Haz- contribution to the increase of knowFrance.<br />\nHis fine service was rethe coming year will be discussed.<br />\nbree, who is at present making a<br />\nlett and Charlie Gaw secured the ledge in, and to the advancement of,<br />\nwarded with the Distinguished Sertour of the United States, will be<br />\nthird and fourth awards, of two and the sanitary branch of the Engineer- Leber Will Represent Y<br />\nvice Cross and Croix de Guerre. On<br />\ntendered a dinner by the Tudor and<br />\none cartons of cigarettes, respec- ing profession. Since the endowment<br />\nConventi<br />\nIndiana<br />\non<br />\nAt<br />\nSenior Pictures Tuesday<br />\nhis return in 1919 he became asso- tively.<br />\nStuart Club at the Southern Hotel.<br />\nof the medal in 1924, it has been<br />\nciate pastor of the First Presbyteradition to the active members,<br />\nIn<br />\npresident<br />\nHenry<br />\nLeber,<br />\nH.<br />\nof the<br />\nDave Levy, business manager of awarded only twice, in 1927 and in<br />\nPhotographic Editor Nat Soifer<br />\nran Church, New York City, with<br />\nthe Baltimore alumni of the group<br />\nHopkins Y. M. C. A., is heading a<br />\nthe NEWS-LETTER, and Robert Wat- 1931.<br />\nannounced Wednesday that picDr. George Alexander and Dr. Harry<br />\nwill assist in honoring the Englishgroup of delegates from the Johns<br />\nkins, advertising manager, judged<br />\nHonored For Third Time<br />\ntures of seniors will be taken for<br />\nEmerson Fosdick. He left this posi- the contest.<br />\nman.<br />\nHopkins Y. M. C. A., is heading a<br />\nthe Hullabaloo starting Tuesday<br />\nThis is the third time that Profestion in 1928 to become pastor of the<br />\ngroup of delegates from the Johns<br />\nand continuing tip-sough Friday.<br />\nsor Gregory has been honored by the<br />\nBrown Memorial Presbyterian Church<br />\nHopkins University attending the<br />\nMayer Talks On Germany<br />\nTo<br />\nNotices will be in the postoffice<br />\nsociety.<br />\nLecture<br />\nIn<br />\nEngland<br />\nIn<br />\n1910<br />\nhe<br />\nwas<br />\nawarded<br />\nthe<br />\nof Baltimore.<br />\n12th Quadrennial Convention of the<br />\nThomas Fitch Rowland Prize for his<br />\nboxes for appointments. FraterStudent Volunteer Movement to be<br />\nDr. Speers is also active as a trusDr. Joseph Mayer, Associate ProProfessor H. S. Jennings, head of paper entitled \"The Improved Water<br />\nnity pictures must be taken on<br />\nheld in Indianapolis from December<br />\ntee of Princeton University, Gouch- the Department<br />\nfessor<br />\nof Chemistry at the Johns<br />\nand<br />\nSewage<br />\nof Zoology in the<br />\nWorks of Columbus, 28 through January 1.<br />\nMoilday, December 9, any time<br />\nAccompanyer College, The Union Memorial School for Higffer<br />\nHopkins Uniersity, will today address<br />\nStudies, has been Ohio,\" and in 1930, in conjunction ing<br />\nbetween<br />\nA.<br />\n9<br />\nM. and 9 P. M. These<br />\nLeber are Dr. E. A. Schaal, exea meeting of the International LunchHospital, the Presbyterian Eye, Ear appointed a visiting professor at with C. B. Hoover and C.<br />\nB. Cornell, cutive secretary of the Y. M. C. A.,<br />\nare individual pictures and everyeon Group in Leevring Hall. In his<br />\nand Throat Charity Hospital, and Cambridge University in England, was awarded The<br />\nJames Laurie Huntley Lloyd, and John Bamberber.<br />\none must pay his dollar when the<br />\ntalk, Dr. Mayer will discuss his exthe Maryland Training School for where he will lecture for the remain- Prize for their paper<br />\nentitled \"The More students are expected to swell<br />\npicture is taken.<br />\nperiences in Germany during the past<br />\nColored Girls.<br />\nder of this year.<br />\nO'Shaughnessy Dam and Reservoir.\" the group representing<br />\nthe local \"Y.\"<br />\nsummer.<br /><br />\nSpeers Speaks<br />\nTo Third Supper<br />\nClub Tonight<br /><br />\nRudolph Herring Ward Elected Head<br />\nMedal Awarded To Of Freshman Class<br />\nProfessor Gregor) After Heated Battle<br /><br />\nMilton, Dryden<br />\nTopic Of Speech<br />\nBy Major Dobree<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 6, 1935<br /><br />\nMbe ilewslisetter<br /><br />\nthe Hopkins chapter of the N. S. L. tends toward radical leadership; and, as such, it defeats its own purpose.<br />\nThe purpose of the N. S. L. is not the propagation of<br />\nFounded 1897<br />\nany single idea—the practice of the little-read but muchmaligned Marxian principles, for example put the carSubscription per year<br />\n$2.00<br />\nrying out of its platform. At least it should be. But,<br />\nBy Mail<br />\n$2.50<br />\nas matters stand, it is quite evident that the N. S. L.<br />\nis proceeding along the line of a single idea, and frightRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Postoffice, Johns Hop- ening out all other ideas.<br />\nkins University.<br />\nThis seems to be an unfortunate circumstance. Here<br /><br />\nIntercollegiates<br /><br />\nVIEWS AND REVIEWS<br /><br />\nCharles Hudson, Emory University<br />\nstudent, spent three days in a hypnotic trance recently when a psychology professor who had hypnotized<br />\nhim for demonstration purposes was<br />\nunable to bring him out of the trance.<br />\nDuring this time, Hudson walked<br />\nand rode to the movies. At the end<br />\nof three days he suddenly blinked<br />\nhis eyes and asked what had happened about the campus.<br />\n•<br />\n*<br /><br />\nKEITH'S<br />\nBill Robinson, cast as Rogers'<br />\nIf I Had A Million, with an all- friend, goes through a number of his<br />\nstar cast is now playing at Keith's tap dances during the picture.<br /><br />\nEntered as second-class matter December 3, 1909, is a body, with a platform not essentially radical, in<br />\nat the Postoffice in Baltimore, Md., under the Act of the hands of a suggestively radical membership. These<br />\nare problems of vital interest to us as those who will<br />\nCongress, November 3, 1879.<br />\nbecome the thinking members of society. As leaders<br />\nPublished semi-weekly from October to June, ex- we will have to consider problems of national<br />\nand incept during examination and college holiday periods ternational—and yet<br />\nTen times as many students are<br />\npersonal—import. Still, here we<br />\nby undergraduates of the Johns Hopkins University.<br />\nnow using their college libraries as<br />\nare, letting a tiny group do nearly all the thinking.<br />\ndid in 1925.<br />\nThere is no use arguing that the problems the N.<br />\n*<br />\n*<br />\nEDITORIAL DEPARTMENT<br />\nS. L. discusses don't have any significance for us. There<br />\nKenneth Zierler<br />\nA professor at the Los Angeles<br />\nEditor-in-Chief<br />\nis a bird that is supposed to hide its head in the sand<br />\nJunior College was having trouble<br />\nIrving Leberfeld<br />\nManaging Editor<br />\nto escape from very real danger. But the ostrich never<br />\nkeeping his class quiet. Finally, in<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nwent<br />\nto<br />\ncollege.<br />\nAssistant Managing Editors<br />\nexasperation, he shouted, \"Order,<br />\nDavid Caplan<br />\nAssistant Sports Editor<br />\nIt is a virtual necessity that a campus of the Hop- please.\"<br />\nEdgar Kemler<br />\nFeature Editor<br />\nkins' intellectual level should have some outlet where<br />\n\"Hot beef sandwich,\" came an abHarold Kropman, Jack Stein, Sidney Green,<br />\npeople concerned with doing away with racial preju- sent-minded voice from the rear of<br />\nColumnists<br />\ndices and people concerned with abolishing war and the room.<br />\nJesse N. Borden<br />\nAdvisory Editor<br />\n* * *<br />\npeople concerned with menaces to academic frpedom<br />\nEDITORIAL STAFF<br />\nand so on could all get together and exchange ideas<br />\nWhen Skracuse University was in<br />\nBernard Pinck, Sigmund Safier, Max Iskowitz,<br />\nand accomplish something.<br />\nits infancy the tuition was only $20<br />\nNathaniel Finkelstein, Murray Kempton, Wetha term.<br />\nIn<br />\nother<br />\nwords,<br />\nwhat<br />\nwe<br />\nneed<br />\nis<br />\nsomething<br />\nbroader<br />\nered Barroll, Jr., Isadore Gertman, Jewett<br />\n* * *<br />\nthan the N. S. L. There is no use suggesting that these<br />\nGoldsmith, Leonard Jaffe, Red Glantz, Lester<br />\nThe<br />\nYale-Harvard<br />\nClub of Lon:don<br />\npeople—these<br />\nnon-radicals<br />\n--join<br />\nthe<br />\nN.<br />\nS.<br />\nL. as a means<br />\nCaplan, Howard Reizenstein, Julian Adler.<br />\nof finding expression. The very connotation of those arranged to have the Yale-Harvard<br />\nthree letters is so restrictive that a broad group would game transmitted to them by cable.<br />\nBUSINESS DEPARTMENT<br />\nAfter a hearty dinner, the club memnow be impossible within the N. S. L.<br />\nDavid H. Levy<br />\nBusiness kanager<br />\nbers divided into two camps and<br />\nRobert Watkins<br />\nAdvertising Manager<br />\nThus, as we see it, the best thing to do is to do away prepared to listen ot the game. But<br />\nRobert Levi<br />\nCirculation Manager<br />\nwith the N. S. L. and organize this broad group where the Western Union made a mistake<br />\nWilliam B. Kempton<br />\nOffice Manager<br />\nevery honestly interested person could voice his opin- and sent a different game. It was<br />\nMelville Locker<br />\n. Copy and Filing Manager<br />\nion and share in the action—an organization dominated not until the second half that the<br />\nby no single idea other than that of reaching intelli- right stadium was hooked up.<br />\nBUSINESS STAFF<br />\ngent decisions.<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\n* * *<br />\nN. Soifer, S. Tinley<br />\nStudents of Baylor University in<br />\nHere we would have pale liberals and pink liberals,<br />\nFriday,<br /><br />\nDecember 6, 1935<br /><br />\nVeritas Vos Liberabit<br /><br />\nradicals and reactionaries—reactionaries interested in Texas, have orgailized a traveling<br />\nthe success of some mutual topic exclusive of the rest. show in order to publicize their university.<br />\nVital subjects handled vitally.<br />\n* * *<br /><br />\nIt is usually required of an incumbent editor that<br />\nhe make his first editorial a promise of policy. We fall<br />\nin line, not because it is a custom, but because we want<br />\nWe must admit that we—and thousands of others—<br />\nto. We want everybody to know what attitude we will<br />\nare staring defeat in the face. It is now almost a virtake and how we will stand.<br />\ntual certainty that the United States will send a team<br />\nThis is our policy: \"Veritas vos liberabit.\" \"The<br />\nof young athletes to be indoctrinated at the Berlin<br />\ntruth shall make you free.\"<br />\nOlympics.<br />\nWe cannot foresee what problems win arise during<br />\nThat is what burns us up. Politicians at the head of<br />\nthe course of the year. But we can say that those that<br />\ndo come up will be approached with mind free from the American Olympic Committee have shoved us into<br />\na meeting room to hear Nazi speeches and read Nazi<br />\nprejudice—with a view of careful examination of all<br />\npossibilities, that present themselves—with intellectual posters and they have locked the door and barred the<br />\nexit. Then they smugly say, \"We dasn't mix politics<br />\nhonesty—with the Hopkins manner.<br />\nand athletics. Therefore, on to Germany.\"<br />\nOur guide we take from one whose every breath<br />\nThat has been their big argument. Keep politics<br />\nseems to have been drawn from the University—Dr.<br />\nout of the Olympics. That is our big argument, too.<br />\nJoseph S. Ames. Dr. Ames writes in his recently issued<br />\nWe don't regard this as a Jewish question. Racially, of<br />\nReport of the President—his last one: \"The success of<br />\ncourse,<br />\nGermany has stigmatized Jewish athletes. Rethe University, which in my judgment' is definite, has<br />\nbeen assured in the past and will be assured in the fu- ligiously, the Germans have warred on Catholic and<br />\nture largely by the attitude of mind of the faculty and Protestant as well as on Jewish athletes. Even more<br />\nthe spirit of devotion to the ideals of the University general, the Nazis require acceptance of their party's<br />\nwhich permeate the whole institution. The underlying bigoted ideology.<br />\nthought, naturally, is freedom of thought and action<br />\nWhat is the Nazi ideology? Here are some excerpts<br />\nupon the part of both students and faculty.\"<br />\nfrom a booklet written by Bruno Malitz, Sports Leader<br />\nThis is our policy: In our news columns, impartial of the Storm Troops, 32nd Brigade, Berlin Center. This<br />\n\"statemennt of what are facts to the best of our knowl- document, virtually official, was printed by National<br />\nedge; in our editorial columns, weighed analyses; but Socialist Library and was distributed free of charge to<br />\nall sports clubs and youth organizations in Germany.<br />\neverywhere our lead is truth.<br />\nIt is still on the Nazi Library preferred list:<br /><br />\nDefeated<br /><br />\nN. S. L.<br />\nThe most discussed body on the campus is the N.<br />\nS. L.—with all due respects to 0. D. K. The National<br />\nStudents' League is an organization that defies indifference. It makes you aware of its existence and it<br />\nforces you to be either with it or against it. There is<br />\nno third alternative, just as there is no third alternative in whether you are touched by one of the points<br />\non its platform or not.<br />\nConcerning the N. S. L. we feel that here is an<br />\norganization whose potentialities have been undeveloped<br />\nor have been developed along too narrow lines. Conskier for a moment the range of its activity:<br /><br />\nFor the Nazi, \"Politics belong in sports\" ...<br />\nWe Nazis see no value whatsoever in having<br />\nNegroes travel through Germany and meeting<br />\n\"our finest\" in competition ... You will ask us<br />\nnow, \"Don't you want any international games,<br />\nany Olympic games in the Nazi state?\" We answer, \"Yes; as a matter of fact, we consider<br />\nthem, due to international propaganda reasons,<br />\nas necessary<br />\n.\"<br /><br />\nStephens College, Missouri, offers<br />\na course in \"Artistic Loafing.\"<br />\n* .* *<br />\nA professor of Ohio State University rec'ently served tea and cakes at<br />\nthe end of an exam. His purpose was<br />\nto revive the students, we suppose.<br />\n* * *<br />\nI think that I shall never see<br />\nA poem as lovely as a red flag with<br />\na white dot<br />\nFlying from Packer Hall on Monday<br />\nsaying<br />\nThere is no drill for me.<br />\nLehigh Brown and White.<br />\n*<br /><br />\n*<br /><br />\nTheatre in Baltimore. This picture<br />\nAlso in the cast are Louise Henry,<br />\nwill play until next Wednesday night. Alan Dinehart, and Etienne Girardot.<br />\nIncluded in the cast is Gary CoopThe story was adapted from Chas.<br />\ner, Charles Laughton, W. C. Fields, T. Dazzey's play, by Sam Hellman.<br />\nGeorge Raft, Jack Oakie, Charles George Marshall was the director<br />\nRuggles, Mary Boland, May Robson, for this picture.<br />\nRichard Bennett, and Alison Skipworth.<br /><br />\nLITTLE<br />\nIf I Had A Million is a comedy<br />\nGeorge Arliss, in his latest picskit, returning by popular request.<br />\nture, Mister Hobo, is now occupying<br />\nCharles Laughton, one of the lead- the screen at the Little Theatre.<br />\ning members of the cast, was born<br /><br />\nArliss portrays a new type of role<br />\nin Scarborough, England. Descend- in this picture, departing from his<br />\nant of a long line of hotel keepers, \"dandified\" characterizations, and<br />\nhe had two choices—hotel clerk or taking the part of an ordinary hobo,<br />\nnavy officer. He flunked his naval ex- tramping through the country.<br /><br />\nam, and became a hotel keeper. In<br /><br />\nArliss steps out of his hobo charthe World War, he spent five years acter for a Period, and becomes<br />\nas a private. After the war he spent Francois Rothschild, a noted and a<br />\nthe next five years in his father's prominent man. The end of the pichotel. He became interested in plays, ture, however, see him once again<br />\nand was well known on London in rags, and \"on the road.\"<br />\nstages.<br /><br />\nIncluded in this program is some-<br /><br />\nHis picture successes are Henry<br />\nthe Eighth, The Barretts of Wimpole<br />\nStreet, Ruggles of Red Gap, Les Miscrables, Mutiny on the Bounty, and<br />\nnow, If I Had A Million.<br /><br />\nthing very novel in the way of car-<br /><br />\nNEW<br />\nThe New Theatre is now showing<br />\non its screen the beloved humorist,<br />\nWill Rogers, in his last and best picture, In Old Kentucky.<br />\nRogers' role In Old Kentucky is<br />\nthat of Steve Tapley, a horse trainer,<br />\nwho makes champions of colts,<br />\nfriends out of enemies, and brings<br />\nromance to estranged sweethearts.<br />\nThe drama of the picture arises out<br />\nof a feud between the families of old<br />\nCharles Sellon and Charles Richman.<br />\nRogers gets himself in and out of<br />\ntrouble trying to protect Sellon from<br />\nthe law, and trying to keep the Sellon-Richman romance from breaking<br />\nup.<br />\nThe feud between the two families<br />\nreaches its climax, when they enter<br />\ntheir horses in the Ashford stakes.<br /><br />\nBOULEVARD<br />\nCecil B. DeMille's motion picture<br />\nepic The Crusades, opens today at<br />\nthe Boulevard Theatre.<br />\nThe story concerns Richard Cour<br />\nde Lion, King of England, who goes<br />\nto the Crusades to release himself<br />\nfrom his obligation to marry Princess Alice of France. En route he<br />\nmarries Berengaria, Princess of Navarre. When the Crusaders reach the<br />\nHoly Land they find the Saracen<br />\nforces under their Emperor Saladin<br />\nare stronger than they had expected,<br />\nand their resistance checks the tide<br />\nof the invasion at Acre for many<br />\nweeks.<br />\nIn the cast are Henry Wilcoxson,<br />\nIan Keith, Katherine DeMille, Loretta Young, C. Aubrey Smith, Joseph<br />\nSchildkraut, and others.<br /><br />\ntoons.<br /><br />\nA new<br /><br />\nFrench<br /><br />\nanimated<br /><br />\nshort should attract a great deal of<br />\nattention and admiration.<br /><br />\n*<br /><br />\nMinnesota students read more<br />\nscandal items than general news<br />\nitems, a survey recently disclosed.<br />\n* * *<br />\nA professor at the University of<br />\nPennsylvania promised a quiz. The<br />\nnext day, noticing the sparely settled seats, he called the quiz off.<br />\nThereupon the door opened, and the<br />\nseats were rapidly filled.<br />\n* * *<br />\nThe Tower proves that she loves<br />\nyou:<br />\nGiven: I love you.<br />\nTo prove: You love me.<br />\nProof: I love you (given).<br />\nTherefore I am a lover.<br />\nAll' the world loves a lover (axiom).<br />\nYou're all the world to me.<br />\nTherefore you love me.<br />\n* * *<br />\nA staff announcer of QNOW recently sot up temporary microphones<br />\non the platform atop a new building<br />\nthat is going up on the University<br />\nof Texas campus. He was scheduled to interview the workmen from<br />\n4:15 to 4:45. He found himself left<br />\nalone by 4:30, the workers' quitting<br />\ntime.<br />\n* * *<br /><br />\nIf Mr. Brundage and General Sherrill think they can<br />\nkeep politics out of the Olympics by ignoring the protests of those who prefer the Olympic ideal and by having our athletes come back from Germany boasting<br />\nthat they were \"real chummy with Ad Hitler, Julie<br />\nStreicher, Ernie Roehm, Bill Goering, Rudy Hess, and<br />\nFour years of pullthg the wool,<br />\nI. For lowered tuition fees and a free college in<br />\nthe rest of the lads,\" then we must conclude that Mr. and there's your<br />\nsheepskin.<br />\nevery city over 100,000.<br />\nBrundage's and General Sherrill's reasoning powers<br />\n—Notre<br />\nDame Scholastic.<br />\n2. For academic freedom for all students and in- work backwards, to deal kindly with them.<br />\n* *<br />\nstructors.<br />\nAccording to an official bulletin.<br />\nBut, perhaps, they don't know what the Olympic<br />\n3. For abolition of all forms of compulsory religideal is. Baron Pierre de Coubertin, founder of the published by the Kansas State Norious services in colleges.<br />\nmal School in 1902, \"it would be a<br />\nmodern Olympic games, wrote:<br />\n4. For abolition of the R. 0. T. C.; against war<br />\nshame if any Teachers College stu\"The main issue in life is not the victory but the<br />\nand fascism.<br />\ndent should be arrested for riding a<br />\nfight: the essential is not to have won but to have fought<br />\nbicycle at a rate of speed exceeding<br />\n5. For full social and political equality for Negroes<br />\nwell. To spread these precepts is to pave the way for<br />\nthe lawful limit.\"<br />\nand other racial minorities.<br />\na more valiant humanity, stronger, and consequently<br />\n* * *<br />\n6. For unemployment insurance.<br />\nmore scrupulous and more generous. These words exAbsent-minded Dean (knocking on<br />\ntend across the whole domains and form the basis of the<br />\ngates of St. Peter)—\"C'mon open<br />\nHere are controversial problems.<br />\nSome of them a healthy and happy philosophy.<br />\nup here, or I'll throw the whole fradon't apply to the Hopkins particularly. But we can't<br />\n. \"The Olympic movement gives the world an ideal ternity out.\"<br />\nconceive of anyone who is not concerned with at least<br />\n—Wabash Caveman.<br />\none of those six points;—the fourth one, if nothing else. which reckons with the reality of life, and includes a<br />\n* * *<br />\npossibility<br />\nto<br />\nguide<br />\nthe<br />\nreality<br />\ntoward<br />\nthe<br />\nOlympic<br />\nWar strikes at everybody.<br />\nAd<br />\nin<br />\nthe<br />\nBerkeley<br />\nGazettes \"Lost:<br />\nIdea: 'Joie des muscles, culte de la beaute; travail<br />\nTo join a group with the range that the N. S. L.<br />\npour le service de la famille et de la societe; ces trois Strong box with five $1100 bills, gold<br />\nhas, a program need not be in accord with the rest on<br />\nand silver pieces. Value sentimenelements unis en un faisceau indissoluble.'<br />\nevery point. It is necessary merely that he be intertal.\"<br />\n\"May joy and good fellowship reign, and - in this<br />\nested in some one point. The organization should then<br />\n* * *<br />\nserve as a clearing house for problems of that nature. manner, may the Olympic Torch pursue its way through<br />\nAccording to the Notre Dame<br />\nTherein lies our quarrel with the N. S. L. Its mem- the ages, increasing friendly understanding among the Scholastic college graduates don't<br />\nbership is too restricted. It is colored by the more or nations, for the good of a humanity always more en- have to attend homecoming celebraless radical element whose presence has apparently thusiastic, more courageous and more pure.\"<br />\ntions to see their old classmates.<br />\nBruno Maltiz retorts:<br />\nscared off most of those who would like to manifest<br />\nThey hold reunions in front of emsome concern about one or more of the N. S. L.'s points.<br />\nployment agencies every few weeks.<br />\nFrenchmen, Belgians, Polaks, and Jew—<br />\n* * *<br />\nBut it just isn't done. Association with even one radiNiggers run on German tracks and swim in<br />\nThe<br />\ncal? Why, it's like undressing in public!<br />\nWoman's<br />\nClub of Temple UniGerman pools. Good money is thrown away and<br />\nWe can not share this apprehension. Our idea is<br />\nversity was founded by a man.<br />\nnobody can truthfully say that international<br />\n* * *<br />\nthat if we can get, without obligation, any assistance<br />\nrelationships between Germany and its enemies<br />\nin getting Something done we'd like to get done, we<br />\nMen<br />\nstudents<br />\nat the University of<br />\nhave been bettered.<br />\nOklahoma selected a committee to<br />\nwelcome it with no scruples attached.<br />\nThat gnashing of teeth you hear is Baron de Cou petition the city commissioners to<br />\nHowever, no matter what the reason may be, it is<br />\nrepeal the ban on hitch-hiking.<br />\nan established fact that the present membership of bertin struggling in his grave.<br /><br />\n.7<br /><br />\n•<br />\nAR above the clouds, on all the leading airlines, your<br />\npilot is always within hearing and speaking distance<br />\nof airports —via Western Electric radio telephone.<br /><br />\nF<br /><br />\nThis equipment, made by the manufacturing unit of the<br />\nBell System,is helping the airlines to set a notable record<br />\nfor fast,safe transportation. Teletype—another Bell System<br />\nservice — speeds printed weather information to airports.<br />\nLong Distance and local telephone facilities, too, play<br />\nimportant parts in airline operations.<br />\nBell System services reach out in many directions to<br />\nthe benefit of industry and commerce.<br />\nYou can \"fly\" home by telephone, in<br />\na couple of minutes. Why not do it<br />\ntonight? Station-to-Station rates are<br />\nlowest after 7P. M.<br /><br />\ntl<br /><br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 6, 1935<br /><br />\nFaculty Signs Frosh Commission<br />\nProtest Against Answers Questions<br />\nU.S.In Olympics On World Problems<br /><br />\nTHIS COLLEGIATE WORLD<br /><br />\n3<br /><br />\nDr. Ames Reports Miss Shriver Is<br />\nDefinite Success<br />\nDance Sponsor<br />\nOf J.H.U. Purposes<br /><br />\nAlthough blind for 25 years, Perry actually ketch a star but as<br />\nyet it is<br />\nHale, Yale All-American in 1900, a impossibilty. They also<br />\nhave dishasnt missed a game since the day covered that the clouds are<br />\ncoming<br />\nthe doctor told him he would never down closer and that some<br />\nday we<br />\nmight actually be able to discover<br />\nAt a meeting of the Freshman see again.<br />\nMd. Casualty Auditorium To<br />\n(Continued from Page 1, Col. 5)<br />\n* * *<br />\njust what a cloud is composed of.<br />\nCommission held last Tuesday eveBe Scene Of Barnstormer<br />\nBoas, Lov<br />\n.ejoy, Berry, French ning, the members filled out a ques- Colleges and universities through- Q. What was Peter Lombard's and will not, I hope, be influenced<br />\nPlay On December 14<br />\ntoo much by what is done at other<br />\nthe United States expect im- theory of the universe?<br />\nJoin In Statement Issued tionnaire on highly controversial is- out<br />\nA. Peter Lombard thought the institutions. Its problems are its own<br />\nproved financial conditions during<br />\nAgainst U.S. Participation sues including some about Interna- the 1935-36 school year, according to earth was a sphere and that he had problems, and not those, as a rule, (Continued from Page 1, Col. 1)<br />\nhas had much previous experience<br />\ntional Affairs, and Capital and La- the department of interior.<br />\nabsolutely gone all over every point of other universities.\"<br />\nin<br />\nand<br />\nthat<br />\nhe<br />\nprofessi<br />\n* * *<br />\ncouldn't possibly be<br />\nbor and other important subjects.<br />\nonal stock companies.<br />\nThe president's duties were disUndergraduates at CCNY will as- wrong.<br />\nIn the questions concerning interThe cast, headed by Jerry<br />\ncussed and Dr. Ames recommended<br />\nBranQ. What is the best--known pre- the giving<br />\nsist<br />\nin the administration of student<br />\nnational affairs, it deeloped that a<br />\nof some assistance to the ower, as Benveneto Cellini,<br />\namorous<br />\nFair Play In Sports Commitscientific theory of the origin of the<br />\nrelief.<br />\npresident in the supervision over silversmith<br />\nlittle less than half of the members<br />\nof Milan, and Zenas Sears<br />\n*<br />\nearth?<br />\n*<br />\ntee Attacks German Policy belong to the R. 0. T.<br />\nthe School of Higher Studies by en- as<br />\nthe<br />\nC. Moreover,<br />\nDuke,<br />\nwhose Duchess is in<br />\nFirst recipient of Columbia UniThe story in the Bible. The diffi- larging the<br />\noffice of the president.<br />\nAs Unsportsmanlike<br />\na small majority favored the United versity's bronze lion award is Dr. culty of this theory<br />\nlove with Cellini.<br />\nis that it would In general, Dr. Ames<br />\npraised the<br />\n--Harold<br />\n.Urey, professor of chem- be a mighty strenuous job to create<br />\nThe play takes place in<br />\nset-up of his former position andd<br />\nMany members of the Hopkins fac- States joining the World Court, while istry andC Nobel<br />\nFlorence<br />\na<br />\nprize<br />\nworld in six days.<br />\nwinner for the<br />\nthe same number voted against its<br />\nin<br />\nthe sixteenth century.<br />\nconcerning this, he recorded:<br />\nulty were among those who signed<br />\nCellini<br />\nhas<br />\ndiscovery of heavy water.<br />\nThe pre-scientific theory is that<br />\njoining the League of Nations. The<br />\njust been pardoned by<br />\n\"The<br />\nduties<br />\nDuke<br />\na petition issued by the Committee<br />\nof<br />\nthe<br />\nPresiden<br />\nAlesant, ac* * *<br />\nthe earth broke off the sun. The difmembers of the Commission unanicording to the present organization, dro de Medici for a previous crime<br />\non Fair Play in Sports recently cirThere are 365 American students ficulty is that the sun is not<br />\nexmously declared that they would par- at German<br />\nare not perhaps clearly expressed, on condition that he keep<br />\nuniversities. Medicine plained.<br />\nthe peace.<br />\nculated, opposing United States' parand I think there is a distinct ad- Then Cellini kills<br />\nticipate in a defensive war fought draws most foreign students to GerMaffio, an old enThat story (Genesis) is only the<br />\nticipation in the 1936 Olympics to be<br />\nvantage in leaving matters as they emy of<br />\non United States territory, but more many, philosophy \\fewest.<br />\nhis. With his life in danger,<br />\nJewish virgin anyway. Every race<br />\nheld in Germany.<br />\nare at present stated. He has all the<br />\n* *<br />\nthan two-thirds of the members<br />\nCellini comes back to his<br />\nhas its own virgin.<br />\nworkshop<br />\nThe committee counts among its<br />\nauthority that anyone could wish,<br />\nVaccination through vaccine pills<br />\nwolud not participate in an offento brag of his exploit to his<br />\nMutation: taking a rabbit with one<br />\nmembers such men as Dr. Franz<br />\napprenand his responsibility is quite clearly<br />\nor tablets will be the method of the short<br />\nleg and crossing breeding until<br />\nsie war.<br />\ntice, his friend and model,<br />\nundersto<br />\nod.\"<br />\nBoas, Heywood Broun, Gov. James<br />\nAryda,<br />\nfuture, says Dr. Lloyd Arnold, of the it is all<br />\nright.<br />\nThe questions on capital and labor Universi<br />\nwith whom he is in love.<br />\nty of Illinois.<br />\nIn regard to the faculty tenure of<br />\nM. Curley, Arthur Garfield Hays,<br />\nshow a definite trend towards<br />\nThe Duke arrives and is<br />\n* * *<br />\nwideabout to<br />\nRev. Reinhold Niebuhr, Lawrence E.<br />\nI'll check that prophecy on the office, Dr. Ames stated he believed<br />\nly differing beliefs with<br />\narrest him when he sees Angela.<br />\nDr.<br />\nFrancis<br />\nthat<br />\nthis<br />\nWaylan<br />\nshould<br />\nd<br />\nbe<br />\nindefini<br />\nmany<br />\nAdams,<br />\nte<br />\nAmin<br />\nof<br />\nthe<br />\n26th and if my prediction is wrong I<br />\nSpivak, Norman Thomas. and OsThen all thought of the danger<br />\nherst '62, is one of the oldest col- promise<br />\nthe questions winning majoriti<br />\ndises by<br />\nto penalize myself by volun- case of professors and a few others,<br />\nwald Garrison Villard.<br />\nappears and arrangements are<br />\nlege alumni living.<br />\nbut<br />\nthat<br />\njust one vote. The strong minoriti<br />\nin<br />\nthe<br />\nmajorit<br />\ny of cases<br />\nmade<br />\ntarily limiting my reading this wines<br />\nThe protest follows:<br />\nfor Angela to come to the<br />\n* * *<br />\nDuke's<br />\nter to the Congressional Record, the there are advantages in a limited<br />\nin these cases would vote for<br />\nRoose\"Whereas Berlin, Germany, was<br />\nsummer palace that evening. Cellini<br />\nColumbia University received gifts published Hearings of the House tenure.\"<br />\nvelt today if eligible for voting,<br />\nprotests, but to no avail.<br />\nappointed host to the 1936 Olympiad<br />\ntotalling $45,216 during October.<br />\nSub-Committee on Deficiency Apbefore the Nazis usurped power in would favor greater government conThe Duke's cousin, Ottaviano, stays<br />\n* * *<br />\npropriations, and last year's seed<br />\na manner repugnant to democratic trol of industry than at present,<br />\nbehind<br />\nto engage Cellini in a plot<br />\ncatalogu<br />\nes . . .<br />\nStatistics indicate that 200,000<br />\nideals, and whereas it appears that would favor some form<br />\nagainst Alesandro's life, but the art* * *<br />\nof social children now attending school in the<br />\npropagandists would seize upon such ownership<br />\nist refuses. Then the Duchess arrives<br />\nIn 1930 The Daily Cardinal, stuof the basic idustries, United States will probably become<br />\ninternational events to disseminate<br />\nand, displaying a marked interest in<br />\ndent<br />\ndaily<br />\ncriminal<br />\nof<br />\nthe<br />\ns.<br />\nUniversi<br />\nty<br />\nof Wisand is for increased organiza<br />\ntion of<br />\nunChristian and anti-social doctrines<br />\nCeillini's work, invites him to the<br />\n* *<br />\nconsin, had for its editorial chairman<br />\nA strong majority<br />\non a vast scale, and whereas true labor unions.<br />\nsummer<br />\npalace. The silversmith, anxa<br />\nvery<br />\noutspok<br />\nWorld-wide<br />\nen<br />\nyoung<br />\nman<br />\nnamed<br />\neducation<br />\nis<br />\nthe<br />\nsport rests upon principles of honor, voted for government ownership of greatest factor for<br />\nious to follow, accepts her invitation.<br />\npeace, says Har- Forrest Allen. A very able writer,<br />\nfair dealing, and justice to all, and public utilities.<br />\nAnd so the plot<br />\ncapable of first rate editorial satire.<br />\nards Dean Roscoe Pound.<br />\nOrganizations Asked To No- The productionwends merrily on.<br />\nwhereas, the present German govAllen throughout his senior year was<br />\nIn the questions on the<br />\n*<br />\n*<br />\n*<br />\nstaff, under the<br />\nuse of<br />\nernment has officially violated those<br />\ntify Peace Council On leadership of Frank Hirschman, has<br />\nliquor, the results showed that<br />\nAthletic ability of men entering about as popular with the faculty as<br />\nthe<br />\nprinciples and by word and deed has<br />\nbeen working late nights to build the<br />\nCommission had among its<br />\ncollege is increasing yearly, accord- a pay cut before Christmas. AnyTheir Representatives<br />\nmembers<br />\nplaced itself beyond the pale of colsets portraying medieval Italy, conthing<br />\ndone<br />\nby<br />\nconserva<br />\nthe<br />\ntives<br />\na majority of teetotalers,<br />\non<br />\ning<br />\nto<br />\nexperim<br />\nenters<br />\nat<br />\nthe<br />\nUnierboth for<br />\nlective human endeavor, and wherethe faculty that Mr. Allen didn't apbeer and other liquors.<br />\nsity of California at Los Angeles.<br />\nWhether or not they have received ceived by Torn O'Conner.<br />\nknowledge of the horror with which<br />\nproe of was promptly followed by a invitations to become<br />\nThe advertising, in the form of<br />\n* * *<br />\nmembers of the<br />\nthe world looks upon Nazi activity<br />\nstinging editorial in The Daily Car- Permane<br />\nposters,<br />\nand programs, is handled by<br />\nnt<br />\nPeace<br />\nJoe<br />\nLouis,<br />\nCouncil,<br />\nheavywe<br />\night sensation,<br />\nall organis withheld from the German people<br />\ndinal. And there wasn't cry much<br />\nAlan Delevett, assisted by Himes,<br />\nizations<br />\nis<br />\nsaid<br />\nto<br />\non<br />\nthe<br />\nenjoy<br />\ncampus<br />\nchicken<br />\na<br />\ndinner—<br />\nare<br />\nrequeste<br />\nd<br />\nby oppressive censorship;<br />\nproviding there are five chickens, they did that Mr. Allen approved of. to notify the group in writing in care McFeely, Kramer and Ewing. \"Some\"Therefore, resolved that we,<br />\nthing different\" is the idea, and vaToday Forrest Allen, whom sev- inclinations to<br />\nvegetables, and two quarts of milk.<br />\nhave representatives<br />\nmoved to lend our moral support to<br />\nrious<br />\neral<br />\nadvertising stunts are planned<br />\nof<br />\nhis<br />\nadversar<br />\nies<br />\non<br />\nthe<br />\nfaculty<br />\n* * *<br />\non the Council. This is the result of<br />\nvictims of man-made suffering in the Kemler To Edit Paper; Asks For<br />\nfor next week.<br />\nonce hopefully believed would come the<br />\nBusines<br />\ndelibera<br />\ns<br />\nis on the upswing and<br />\ntions of the Peace Counsame spirit in which we answered the<br />\nMaterial For Next Literary<br />\nTickets for the play itself will be<br />\nveering more and more toward gov- to a bad end, is rumored to be draw- cil at a meeting held on Tuesday in<br />\ncall for shipments of supplies to<br />\nIssue<br />\ning<br />\ndown a salary of $8,000 a year,<br />\non<br />\nsale in Levering Hall all during<br />\nernment<br />\ncontrol, says Dean Roswell<br />\nLevering.<br />\ncountries including Germany, strickas an Assistant Coordinator of the<br />\nnext week, free to holders of S. A.<br />\nC.<br />\nMcCrea<br />\nof<br />\nColumbi<br />\na<br />\nUniversi<br />\nty<br />\nThe words of this body, whose foren with war, famine, earthquake and<br />\nThe first Feature Issue of<br />\nTVA, under David Lilienthal.<br />\nC. cards. Otherwise the price will be<br />\nIf<br />\nthe School of Business.<br />\nflood, hereby voice our opposition to NEWS-LETTER will be<br />\nmation was authorized by the underthings<br />\nhad<br />\ngone<br />\nagainst<br />\nAllen<br />\npublished next<br />\nin this<br />\n$1.00 apiece.<br />\n*<br />\n*<br />\n*<br />\nAmerica's participation in the 1936 Tuesday, Decembe<br />\nfashion, any more than they did, he graduates during a recent poll, is still<br />\nr 10, as a suppleTwenty-six Greek manuscripts of<br />\nOlympics in Germany; we appeal to ment to the<br />\nwould probably today be in the Ju- in the hands of a temporary steering<br />\nregular news ediiton.<br />\nNobel Prize In Medicine<br />\nthe New Testament are owned by<br />\nthe Olympic committees of all civil- Edited by<br />\nnior Cabinet, repenting the eil of his committee. As soon as a sufficient<br />\nEdgar Kemler, the paper<br />\nthe University of Chicago. It is the<br />\nized nations to withdraw their teams, will be<br />\nnumber<br />\nof<br />\ncampus<br />\nways.<br />\nclubs and frater- To Former Lecturer Here<br />\nof a literary character, consecond largest collection in the counand urge that said Olympiad be post- taining<br />\nnities are represented, a permanent<br />\nshort stories, plays, poetry,<br />\ntry.<br />\nponed or removed to a land officially<br />\nThe Nobel Prize in Medicine has<br />\nA lot of earnest young American governing body will be formed to inand articles of a more or<br />\n* * *<br />\nless conworthy of harboring these historic<br />\nbeen awarded Dr. Hans Spemenn,<br />\ncampus debaters are having sad ex- itiate the policy of the Council.<br />\ntroversial nature, all written by<br />\nvariDont marry a girl whos late for<br />\ngames.\"<br />\nwho lectured at Johns Hopkins Uniperiences meethig the present Oxous students at the Hopkins.<br />\nThursdays at 4 o'clock in Room B,<br />\ndates, says Dr. Alfred Adler, noted<br />\n(Signed)<br />\nersity before the Zoology Departford and Cambridge teams which<br />\nIn order to facilitate composit<br />\nLevering Hall, have been set as the<br />\nion Viennese psychologist, and don't are touring the country.<br />\nment two years ago.<br />\nGeorge Boas, Professor of the Hisand to accelerate publication,<br />\ntime and place for the ensuing sesKem- marry a man to \"save him.\"<br />\ntory of Philosophy -.<br />\nDr. Spemenn received the prize for<br />\nEnglish debate tactics never seem<br />\nler urged that \"students prepare<br />\n*<br />\n*<br />\n*<br />\nsions<br />\nof the Permanent Peace Counto<br />\nArthur Lovejoy, Professor of Philwork done in experimental embryto change, but unfortunately their<br />\nsubmit some 'material of any type<br />\nRadio programs should be governcil. Recently, letters were written to<br />\nto<br />\nosophy<br />\nology on vertebrate animals. He is<br />\nAmerican opponents never get wise.<br />\nbe printed in the next literary<br />\nment-controlled, in the opinion of<br />\nHopkins organizations inviting par- now a professo<br />\nsupIt<br />\nr of comparative anis a common assertion that the<br />\nSidney Painter, Associate in History<br />\nplement, which will come out some- college presidents recently polled by<br />\natomy on vertebrates.<br />\nOxford Union proides the best debate peace.<br />\nJohannes Mattern, Lecturer in Polittime around Christmas.\" The<br />\nidea the Federal Communications Com- training in the world, although it<br />\nical Science<br />\nmission.<br />\nis to draw out any latent talent of<br />\na<br />\nseems to consist of of an ability to<br />\nJames Hart, Associate Professor in<br />\n* * *<br />\nliterary nature that may reside in<br />\ncharm the audience, to maintain<br />\nPolitical Science<br />\nCoumbia, Mo.—There may be complete nonchalence, to spin<br />\nH. C. Lancaster, Professor of French the persons of the men attending the<br />\nmerry<br />\nsomething to the American theory of tales.<br />\nHopkins University.<br />\n(Graduate School)<br />\nuniversal college education, and then<br />\nG. Gruenbaum, Professor of Italian<br />\nAmerican students, on the other<br />\nagain—<br />\n(Graduate School)<br />\nhand, bone up for weeks, outline<br />\nDr. Joseph Ames Reports<br />\nHere are some of the answers that their<br />\nJohn C. French, Librarian of the Unconcretely and spew forth<br />\nSuccess Of J. H. U. Aims turned up in a recent Uniersity of all ofcase<br />\niversity<br />\nwhich the Englishmen wave<br />\nMissouri quiz:<br />\nTenney Frank, Professor of History<br />\nfacts and figures at a terrific rate—<br />\nDr. Joseph Sweetman Ames,<br />\n(Graduate School)<br />\nQ. What experiment led to the airily aside as so much amusing rubpresiW. Stull Holt, Associate Professor of dent emeritus of the Hopkins, spoke establishment of the Mendelian law? bish.<br />\nat the first meeting of Sigma Xi,<br />\nHistory<br />\nA. Cutting the tails off mice and<br />\nthe<br />\nFrederic C. Lane, Associate Profes- Hopkins Chapter of National Honor- breeding them.<br />\nary Society for the Promotion of<br />\nsor of History<br />\nBARBER SHOP<br />\nQ. What do we learn from asJacob Hollander, Chairman, Depart- Research, on Thursday, December<br />\n5, tronomy concerning our physical<br />\nTheodore's<br />\nment of Political Economy<br />\n1935, at 8:15 P. M., in Maryland Hall, universe?<br />\nST. PAUL and 33RD STREETS<br />\nKent Roberts Greenfield, Professor in Room 110. Recent Scientif<br />\nic and<br />\nA. Many astronomers have tried<br />\nDon't spoil the thrill of getting home again by worrying<br />\nof History<br />\nNext To Birely's<br />\nTechnical Developments in Aero- to discove0<br />\nways so that we could<br />\nabout the shipment of your baggage. Solve the problem by<br />\nE. W. Berry, Dean of the College of nautics<br />\nwas the topic. Refreshments<br />\nArts and Sciences<br />\nleaving everything to Railway Express. We will call for<br />\nwere served after the meeting.<br />\nW. B. Kouwenhoven, Dean of the Enyour trunks, baggage and personal belongings and send<br />\nIn celebration of the semi-centengineering School.<br />\nthem<br />\nhome on fast passenger trains through to destination.<br />\nnial of the society, two research<br />\nThe aforementioned are among the<br />\nYou<br />\ncan<br />\nprizes<br />\ntake yourtrain home with peace ofmind—knowing<br />\nof<br />\nof<br />\n$1,000 each were awardmembers of the faculty who signed<br />\ned,<br />\none<br />\nthat<br />\nin<br />\nyour<br />\nthe<br />\nbaggage will be there quickly and safely. Railway<br />\nphysical<br />\nsciences<br />\nand<br />\nthe petition.<br />\none in the life sciences.<br />\nExpress service is a decided economy in expense, too.<br />\nE. B. Mathews is the Chapter<br />\nAfter vacation,send your baggage back the same way.<br />\npresident, and M. W. Pullen holds<br />\nWe give a receipt on pick-up and take a receipt on dethe office of secretary. Dr. E. B.<br />\nlivery...double proof of swift, sure handling.<br />\nSeeling, of the Johns Hopkins MediFor service or information merely call or telephone<br />\nThis week: CLARENCE WEIMER.<br />\ncal School, is the representative to<br />\nIn the hands of this cheerful senior<br />\nCHARLES and FAYETTE STREETS<br />\nthe National Chapter.<br />\nVErnon 0600<br />\nlies the task of editing the 1936<br />\nDEPOT OFFICE: 203 E. FRANKLIN STREET<br />\nVEmon 0600<br />\nHullabaloo, on which annual he has<br />\n••••••<br />\n•.111.111•••••••••••111111.?<br />\nBALTIMORE, MD.<br />\ndevoted quite a bit of his energies<br />\nGet New Low Fares<br />\nin years past. During the spring<br />\nOther Information<br />\nST. PAUL at 33RD STREET<br />\nterm he will manage the lacrosse<br />\nFrom Greyhound<br />\nPrescriptions—School Supplies<br />\nteam. He was formerly a crack shot<br />\nAgent<br />\nCandy-Cigars<br />\nThese big reductions effecon the rifle team.<br />\nUnexcelled Fountain Service<br />\ntive nearly everywhere.<br />\nDrop in, or telephone for<br />\nClarence is secretary of Omicron 111.11.11.1...........1.41.11.••••••••••••••••••••••••••••••••••••<br />\nspecific details.<br />\nDelta Kappa, national honorary fraGREYHOUND<br />\nAGENCY,INC.<br />\nBUS<br />\nTERMINAL<br />\nternity, to which he was elected last<br />\nJ. H. FURST CO.<br />\n217-221 W. Baltimore St.<br />\nLIATION -WIDE RAIL- AIR SERVICE<br />\nYear. He is also a member of Pi<br />\nPhone: PLaza 0520<br />\nPrinters of<br />\njournali<br />\nhonorar<br />\nbelta Epsilon,<br />\nstic<br />\ny<br />\nCampus Agent — M. L.<br />\nTUNE IN ON THE RAILWAY EXPRESS NEWS PARADE<br />\nPHILOLOGICAL and<br />\nKrieger, E. 22 Dormitory,<br />\nfraternity, and was associated with<br />\nEvery week from the following stations:<br />\nSCIENTIFIC PUBLICATIONS<br />\nCHesapeake 4912.<br />\nthe old \"Black and Blue Jay.\" He<br />\nWEEI • WOR • WHK • WLS • KWK • WDSU • WFAA<br />\n12-20 Hopkins Place<br />\nBaltimore<br />\nWGST • KYA • KNX • KSTP • KOMO • WBAL • KOIL<br />\nbelongs to no social fraternity.<br /><br />\nObject To Nazism<br /><br />\nCampus Groups<br />\nAsked For Stand<br />\nBy Peace Council<br /><br />\nFirst Literary Issue<br />\nTo Appear Tuesday<br /><br />\n4,J<br /><br />\nHOME FOR THE<br />\nCHRISTMAS<br />\nA HOLIDAY?<br />\n(Wilma you iarnayei<br /><br />\n(44<br /><br />\nQU ICKLYand ECONOMICALLY<br /><br />\nsT<br /><br />\nGrtirortiouN<br />\nits<br />\n•<br /><br />\nCampus Captains<br /><br />\nt<br />\nUtINSI<br /><br />\nBirely's Pharmacy<br /><br />\nUN<br /><br />\n*<br />\nROUND tV<br />\nTRIP<br />\nGREA<br />\nTLY<br />\nEffective REDFARES<br />\nRettirn Dec.15 to<br />\nUCED<br />\nBefore<br />\nJail.I<br />\nFebruary I<br /><br />\nRAILWAY<br />\nEXPRESS<br /><br />\nWatch for local announcements<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 10, 1935<br /><br />\nCbe PewelLetter<br />\nFounded 1897<br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nWhat Is Proletarian Literature?<br /><br />\n3 Novels<br /><br />\nA Review - - By Elijah Adams<br /><br />\nReviewed By C. Beach<br />\nThe corrent controversy between left-wing and<br />\nright-wing literary critics has not always Men too<br />\nclear. Objectivity and keen sanity have not always<br />\nprevailed on both sides. But the assault of the \"proletarian\" critics and writers has done much to clear a<br />\nhazy atmosphere and renew. the vitality of both the<br />\nmanner and content of literary criticism. The flaccid<br />\nsentimentalists like William Lyons Phelps, Isabel Patterson, and Herschel Brickell, have shown their true<br />\ncolors by retreating behind a cloud of pointless slander,<br />\nbut the more intelligent of the critics, Krutch and Cowley, for example, have taken up the challenge sincerely<br />\nand objectively. The result has been a purer literary<br />\natmosphere, -more conducive to creative effort and the<br />\nclarity of literary criteria.<br />\nPut broadly and most reasonably, the chief claim<br />\nof the left-wing critics is that'literary productions tse<br />\njudged by the degree of understanding of social forces<br />\ndisplayed therein. Sound technique and convincing reality of character are not however dispensed with as<br />\nbourgeois superfluities. On the contrary, the radicalminded critics contend that the broad comprehension by<br />\nan author of the lines of development of his own times<br />\ngives more vital and organic meaning to his technique<br />\nand delineation of character; that an understanding of<br />\nthe dynamics of social change Makes possible a fuller<br />\nand clearer conception of individual character and a<br />\nsounder development of the chosen theme; that, in fine,<br />\nthese three ingredients of good literature are so vitally<br />\nconnected that -the absence of one results inevitably in<br />\nthe weakening of the others.<br />\nThe question of propaganda. in art is beside the<br />\npoint. A really great novel, according to the abovementioned criteria, cannot but be good propaganda. It<br />\ndrives home mercilessly the necessity of the next step<br />\nin the scale of social progress. A bad novel, however<br />\nforcefully contentious, remains a bad work of art and<br />\ntherefore fails in its conscious purpose.<br /><br />\nRemit subscription fees to Treasurer, Student Activities Council, Remsen Hall, Postoffice, Johns Hopkins University.<br /><br />\n(Continued from Page 1, Col. 2)<br />\nthe Soviet Union. Archibald Mac- completely vague and insignificant.<br />\na revolutionary head, the values of eish, Stephen Spender,<br />\n*<br />\n*<br />\n*<br />\nW. H. Auden,<br />\nEntered as second-class matter December 3, 1909, the left-wing artist find their chief<br />\nA left wing poet, on the other hand,<br />\nCecil-Day ewis, and Thornton Wilder<br />\nat the Postoffice in Baltimore, Md., under the Act of use<br />\nis dealing with ideas just as valid,<br />\nas a weapon and an educational are among those<br />\ndiscussed in the<br />\nCongress, November 3, 1879.<br />\nbut his medium is one in which form<br />\nforce, rather than as a toy for tired remaining articles.<br />\nis particularly important—in some<br />\nPublished semi-weekly from October to June, ex- business men or a willful,<br />\nself-justiAt this point it is well to compare cases<br />\nmore important than the concept during examination and college holiday periods<br />\nfying, seilf-conscious drive towards the achievements of proletarian tent. A logical critique<br />\nof our social<br />\nby undergraduates of the Johns Hopkins University.<br />\n\"pure\" expression. A genuinely pure literature in the fields of criticism and economic system and the knowand poetry, or broader, non-fiction edge of<br />\na method of changing it<br />\nart, an art freed of any sort of class<br />\nEDITORIAL DEPARTMENT<br />\nand fiction. Not alone in this volume,<br />\nmakes<br />\nthe<br />\npoet a better craftsman in<br />\nbias,<br />\nan<br />\nart motivated by the desire but in all the radical<br />\nKenneth Zierler<br />\nEditor-in-Chief<br />\npublications on ideas, not in form. In fact, it usually<br />\nto<br />\ntransmit all experience emotion- the scene, we continually notice that<br />\nIrving Leberfeld<br />\nManaging Editor<br />\nincreases his stylistic difficulties.<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nally and educationally valid, an art the book reviews, the theater and And so, for<br />\nleft-wing poetry as fine<br />\nAssistant Managing Editors<br />\nbased upon more individualistic self- movie reviews, the analyses of liter- in form as it is in content, we shall<br />\nDavid Caplan, Bernard D. Pinch,<br />\nary figures and movements are in- have<br />\nto wait until the accidental<br />\nexpression than has ever been known,<br />\nSports Editors<br />\ncomparably better, for the most part, forces which<br />\nproduce a great poet<br />\ncan exist, it follows only in a class- than<br />\nEdgar Kemler<br />\nMagazine Editor<br />\nthe poetry, and, in lesser degree, play upon<br />\none who is a Marxist.<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\nless society.<br />\nthe fiction. The explanation of this<br />\nIn concalusion, this anthaflogy<br />\nColumnists<br />\n* * *<br />\nseems to me to rest in the nature of not only<br />\nJesse N. Borden<br />\nAdvisory Editor<br />\nbetter than most for its inThe body of proletarian fiction, the new qualities in left-wing litera- trinsic value: it is far more imporEDITORIAL STAFF<br />\nture. These new qualities lie chiefly tant than<br />\nSigmund Safier, Max Iskowitz, Nathaniel Finkmost for the great movewhich has been developing at a headin the application of a more system- ment and<br />\nthe important aesthetic and<br />\nelstein, Murray Kempton, Wethered Barroll, Jr.,<br />\nlong rate in the last five years esatic, more rational, and more com- social<br />\nIsadore Gertman, Jewett Goldsmith, Leonard<br />\ntheories which it combines<br />\npecially, is represented by 16 short plete world-outlook to the problems<br />\nand represents. Notwithstanding its<br />\nJaffe, Red Glantz, Lester Caplan, Howard Reizstories and excerpts from novels. we see about us. Thus a critic who temporary<br />\nenstein, Julian Adler.<br />\nweaknesses, the fact of a<br />\nAmong these there is great diversity adopts the left-wing position imme- complete new literary tradition, uniBUSINESS DEPARTMENT<br />\nin style and content, the charge of diately furnishes himself with a fied<br />\ncritical, and<br />\nself-conscious,<br />\nmicroscope and system of analysis springing fully-armed<br />\napparent<br />\nfrom<br />\nbourgeois critics that all left-wing<br />\nDavid H. Levy<br />\nBusiness Manager<br />\ncombination<br />\nweapon, stethoscop,e nothingness to its present floration,<br />\nfiction is written according to a<br />\nRobert Watkins<br />\nAdvertising Manager<br />\nmore effective and accurate than he all within<br />\nRobert Levi<br />\nthe last ten years, is a matCirculation Manager<br />\nsimple set of formulae, learned by<br />\nhas ever known. Immediately the ter for<br />\nWilliam B. Kernpton<br />\nOffice Manager<br />\nmarvel and admiration. Our<br />\nrote and applied metallically, to the<br />\nquality of his work is enhanced a duty to proletarian<br />\nMelville Locker<br />\nCopy and Filing Manager<br />\nliterature is one<br />\ncontrary notwithstanding. The sehundred-fold for good literary criti- of sympathy and defense,<br />\nso that we<br />\nlections<br />\ninclude<br />\nstories<br />\nabout<br />\na<br />\nscab<br />\nBUSINESS STAFF<br />\ncism depends on keen perception, may help it play its part in the strugin<br />\na<br />\ntaxi<br />\n-strike, farm laborers, the sound logic,<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\nand a unified way of re- gle which is to bring us to an era<br />\nburial of an unknown soldier, an inN. Soifer, S. Tinley<br />\ngarding facts; without any of these when literature and all art will flourcident on the West Coast after Westhree qualities, criticism can be cor- ish as never before on the earth's<br />\nA survey, of four American novels chosen at ranley Everest's murder, etc.<br />\nTuesday, December 10, 1935<br />\nrespondingly untrue, illogical, or surface.<br />\ndom will perhaps elucidate, by elaboration and concrete<br />\nThere were only two poorly chosen<br />\nexample, the three criteria of literary art in fiction.<br />\nselections, and I think the most reThe criticisms are not meant to be characteristic of all<br />\ncent proletarian fiction, if this is a<br />\nof each author's work nor are they placed in some<br />\nTo a waiting world we present this, the first maga- fair sample of it, has improved tregraduated schematic arrangement, with each novel emmendously over the styaed, unim:<br />\nzine number of the NEWS-LETTER. For once there is<br />\nbodying some universal principle or another. All the<br />\naginative tracts of a few years ago.<br />\nlittle of the newspaper in an issue of this journal. There<br />\nnovels, I repeat, were chosen haphazardly with no<br />\nThe section on poetry reveals most<br />\nare those who archly repeat, \"For once?\" These we of the present weaknesses of prolepurpose in mind but of diversion.<br />\n(Continued from Page 1, Col. 6)<br />\nHe noticed the great ease with which<br />\nDemocracy by Henry Adams is generally conceded<br />\ntarian literature. Unoriginal imagcan ignore as catty souls—catty and lacking taste.<br />\nvery morning, for he had completed he could walk, now that he was the<br />\nto be a second-rate novel. The weight of melodrama<br />\nStill, with dignity, we present the first literary ery, crudity of expression, the sacriwork on the new model, and all that possessor of his secret.<br />\nburdens the story, and its heroine is imperfectly and unnumber of the NEWS-LETTER. The plan, originating with fice of form and style to sloganized was necessary<br />\nwas a trial. He was<br />\nAs he neared the hotel, he was convincingly drawn, as are all its other characters with<br />\npolitical content, these are the most<br />\nMr. Edgar Kemler, to attempt to supply the Hopkins<br />\nimportant of such weaknesses. I sure it would prove successful, for somewhat surprised, and not a little the exception of the senator. The problem as Henry<br />\nhe had worked out each detail so<br />\ncampus with an outlet for literary talent that has been liked the<br />\npoems of Kenneth Fearing<br />\ndisappointed with his reception. ne Adams saw it was the seeming unworkability of decarefully.<br />\nWith a sudden determina- expected<br />\nentirely<br />\nby<br />\nexecuted<br />\nyear<br />\nhas<br />\nover<br />\nlacking for<br />\nbeen<br />\na<br />\nvery much, and of his three selections<br />\na crowd of admirers to be mocracy and the frustration of the ideal ends of govthat gentleman. Mr. Kemler's chief qualification is I should choose Lullaby as the best tion, he decided to try out his new waiting for him; instead, no one ernment. The cause to which he attributed the break'chute in this afternoon's performseemed even to notice him. \"Possibly down of the system was the extension of political dethat he was a member of the last and, perhaps, best poem in the collection. The poetry<br />\nance.<br />\nis<br />\ncertainly<br />\nthey do not recognize me,\" he mocracy to the great masses of the unlearned. He<br />\nas<br />\nvarious<br />\nin<br />\nspecific<br />\nstaff of the Black and Blue Jay. Requiescat in pace.<br />\nCarefully strapping on the flimsy thought. Noticing a newspaper, he allows the reader, however, a moment of hope, which<br />\nmaterial and style as any collection<br />\nThe Jay, we mean, not Mr. Kemler.<br />\nof bourgeois poetry of the same size; piece of silk, which was his new walked over to see if he was given for all practical purposes resolves itself into faith in<br />\nWe realize that this product is not all it might be. and the fact that there<br />\nis unity in parachute, he clambered into his a write-up. The paper was an \"ex- civil service reform as the salvation of democracy. OvIn fact, it may be all it mightn't be. Still, there must general theme and general outlook waiting plane, and was soon amazing tra\" which had just been published, viou.sly, Henry Adams misread the lines of force in<br />\nbe a beginning to everything—a conception not original only makes the collecpon as a whole the simple country folk with his no doubt, on his account. Staring society. He admitted that he couldn't easily find them<br />\nseries of stunts. Now came the time from the front page was Edward's in his \"Education\". In his novel, he showed that when<br />\nwith us. We have sown the seed. All we can do now is better.<br />\nhope that the talent of this University, seeing in the<br />\nIt was interesting to note that no- for the final stunt—the parachute picture, and above that, glaring head- he did guess at them, he guessed wrong. The result is<br />\nNEWS-LETTER a quarterly medium for their efforts, will where in the section<br />\nappeared any jump, in which he would prove be- lines. But surely those headlines a novel that is a rather clever and scathing portrayal<br />\npresent us with better and more varied stories, poems, pretentious, affected obscurity—the yond all doubt that his new inven- could not refer to him, for<br />\nthey said, of the Washington haut-monde of his day but not much<br />\netc., for future editions.<br />\nsort that we find in many of the tion was valuable. He took one look \"Daring Flyer Killed.\" A change of more than that.<br />\nWe repeat,- we have sowed the seed, and, although third-rateps in modern poetry, who at the crowd below, then taking a emotion crossed Edward's face and,<br />\nWilliam Dean Howells was a better novelist than<br />\nthis particular result is more like an abortion than emulate honest stylistic experimerri<br />\n. deep breath, he jumped into free for the first time, it occurred to him<br />\nanything else, still we feel that, with the potentialities by turning it into arrogant esoteri- space. He had made many jumps that he was dead.<br />\nHenry Adams. He understood more clearly and symbefore, but now, for the first time,<br />\nwe believe are to be found at the Hopkins, and with cism and cliquish faddism.<br />\npathetically what was happening in the United States<br />\nhe experienced a vague terror that<br />\ncareful incubation, this endeavor may mature into quite<br />\n* * *<br />\nof his time. He was more effective in the unfolding<br />\na valuable member of the publications family.<br />\nof realistic detail. But in A Modern Instance one feels<br />\nThe examples of reportage were all his new 'chute might not open. As<br />\nthat his characters are somewhat stunted, never fully<br />\nexcellent, with one exception—John if to dispel this fear, he pulled the<br />\nAnd largely because the<br />\nand convincingly human.<br />\nL. Spivak's lachrymose A Letter lo rip cord and waited for the jerk<br />\nproblem of divorce, the theme of the book, is treated in<br />\nPresident Roosevelt. Balancing this which would signify that the chute<br />\na thoroughly unrealistic fashion. The first three-quar(Continued from Page 1, Col. 3)<br />\nwas The Fall of Shangpo by Agnes had opened properly. Time passed,<br />\nin<br />\nsplit<br />\nwhich<br />\neach<br />\nseemed<br />\nsecond<br />\nters of the novel are a fair enough picture of the marital<br />\nSmedley,<br />\na<br />\nstirring accoun tof an<br />\ndown under the staus quo.<br />\nan hour, and a sudden overwhelming<br />\nlife of an ambitious and egotistical husband and a<br />\nearly<br />\nevent<br />\nin<br />\nthe<br />\nhistory<br />\nof<br />\nRed<br />\n(proleworkmen<br />\nAlso, there are a few actual<br />\nGIFTS OF MARS<br />\ndevoted wife. The stage is set for a fine projection of<br />\nChina. Reportage is an art developed nausea came to him with the realitariat), who are not very conspicuous in the radical<br />\nparticularly well by left-wing jour- zation that his new invention was a Little red drops of blood that creep the divorce problem of the day, flowing naturally and<br />\npublicity notices.<br />\nfailure—that the chute was not go- down your face and body,<br />\nrealistically out of the carefully a,rranged background.<br />\nnalists.<br />\nopen.<br />\nFalling<br />\nto<br />\nmadly<br />\ning<br />\nthrough<br />\nIn<br />\nthe last quarter of the novel, the curtain rises only<br />\nRabble, neurotics, and some keen thinkers have<br />\nThe section on drama contains<br />\nwarm, yet cold—<br />\nrushing<br />\nair,<br />\nhe<br />\nsenexperienced<br />\nthe<br />\nchain of fortuitous circumstances and foolish state<br />\non<br />\na<br />\non<br />\nmost<br />\n,Shame<br />\nnotably<br />\nworld!<br />\nClifford<br />\nthe<br />\nnation<br />\nin<br />\nOdets'<br />\nwealthiest<br />\nWaitAnd little old ladies with eyes that<br />\nscared the<br />\nsations such as only a person in his<br />\nlegislation. The unity of character is shattered and<br />\nFor<br />\nLefty,<br />\ning<br />\nwhich<br />\ncomhas<br />\nbeen<br />\nproportion?<br />\nweep,<br />\nof<br />\nsense<br />\nyour<br />\nis<br />\nwhere<br />\nyou, Mr. Hearst;<br />\nthe narrative becomes a string of sequences, boring and<br />\npletely reviewed in many other predicament could experience. His And weeping grow tired and old.<br />\nI reveal all these things in the name of Enlightsuperfluous. It seems that Howells proceeded for a while<br />\nplaces, from the New York Times to life flashed through his mind, as he These are the gifts of Mars.<br />\nenment in America. The radicals deserve to be exin a largely instinctive fashion and that when he came<br />\nNew Theater. In addition, there is grimly looked at the earth rushing<br />\nposed. They are neither relieving the sufferers of America, America, a recital with four up to meet him.<br />\nThen a sudden<br />\nto the point where the theme had to be resolved into its<br />\nUNIVERSITY<br />\ninevitable conclusion, his meagre understanding of the<br />\nthe world nor are they fostering the refinements speakers, by Albert Kreymbourg, an- thought—now, if ever, was the time<br />\nother form adopted by proletarian to try his theory about walking on I stand—God knows how much I forces inherent in divorce as a social problem led him<br />\nof the world.<br />\nastray.<br />\ntremble,<br />\nforce,<br />\ncultural<br />\ndramatists, and brought to its full air. He closed his eyes, and concenIf they expect to become a great<br />\ntrated with all his strength, on the Inside the gates where men like I<br />\ndevelopment<br />\nrecitation.<br />\nin<br />\nthe<br />\nmass<br />\nscarthen their path is obvious. First, let them stop<br />\nDespite the rushing air,,<br />\nFew will disagree with the judgment that Main<br />\nassemble<br />\nThe climactic scenes from three fa- subject.<br />\ning the middle classes. Admit the truth, intellectual<br />\nmous plays are reprinted: Stevedore, beads of perspiration stood out on My heart is sad, I breath a sigh—a Street is a better novel than Democracy and A Modern<br />\nradicals! Tell the world what asses both you and it They<br />\nInstance. Main Stret has a vigorous appeal that is<br />\ntear<br />\nShall Not Die, and Black Pit. his forehead,. as he willed his body<br />\nhave been. You for getting up the hopeless scare— Left-wing literature is best known to cease falling. After what seemed That's brushed away—yet I am glad absent in the other two novels. The development of<br />\nand do not fear<br />\nits theme is much sounder and more effective, its charand it, the world, for falling for it! It all may come to Americans in the form of the an interminable age, but which was<br />\nacterizations are fuller and more telling. One feels<br />\nto a lot of wasteful bloodshed unless the real revo- drama, simply because plays, once not more than a second, he could feel For now I know that all is well;<br />\nHis hurtling body<br />\nNo longer chained but free—<br />\nthroughout the nervous genius of Sinclair Lewis. It<br />\nproduced, have a chance to establish a difference.<br />\nlution belongs to the workmen.<br />\nseemed to be slowing down. At last, And what I am or shall become<br />\nmoreover, an exceedingly more valuable document of<br />\nis,<br />\na<br />\nreputaand<br />\nmuch<br />\nquicker<br />\nfirmer<br />\nThen be more gracious in your attitude towards<br />\nhere was success. He concentrated<br />\nDepends, at least, on me.<br />\nits times. Lewis, I believe, mulled over the contempovolumes<br />\ntion<br />\nor<br />\nnovthan<br />\nof<br />\npoetry<br />\nour American upper middle class. Remember: that<br />\nrary scene aplenty before he sat down to write. And<br />\nels. Along with the rise of the left.. even harder, and now, looking down,<br />\naudience is the only one at the present time, suffiwhen he did, the problem of Carol Kennicott and her<br />\nwing drama, which is generally ack- he could see that his fall had been<br />\nA Smile<br />\nciently educated to receive your cavortings. Didn't nowledged by critics of all shades of checked; he was walking on air.<br />\nrelations to Main Street was clearly in his mind. But<br />\nA little kitten all cuddled up<br />\nEdward could imagine the surprise<br />\nthe ramifications of the problem, its extent and depth,<br />\nthey turn out in flocks to hear Communist John Stra- opinion to be the most vital and<br />\nin<br />\nyour lap<br />\nprevamust<br />\nbe<br />\nwhich<br />\nincredulity<br />\nand<br />\nhe<br />\ndid not see. The result is a vague dissatisfaction<br />\nthe<br />\ntendency<br />\nAmeritan<br />\npromising<br />\nseem,<br />\nin<br />\nthe<br />\nmay<br />\nit<br />\nas<br />\nSad<br />\nhere?<br />\nhis<br />\nvisit<br />\non<br />\nchey<br />\npurring<br />\nlent with the crowd below. In his<br />\non the reader's part with the character of Carol. It is<br />\ntheater<br />\nof<br />\ngoes<br />\nthe<br />\ntoday,<br />\ngrowth<br />\nsupchief<br />\nthe<br />\nbeen<br />\nalways<br />\nelement<br />\nhave<br />\nwealthier<br />\ndeliciously.<br />\nnot, as Walter Lippman!' argues, that Lewis never saw<br />\nscores of New Theater units, organ- fancy, he could already hear the conporters of the flowering of an Enlightenment—in<br />\nhe<br />\ngratulations<br />\nwould<br />\nwhen<br />\nreceive<br />\nMain Street from any angle but his own, i.e., Carol's.<br />\nized into the New Theater League.<br />\nthe 20th no less than in the 18th century. Working<br />\nLippmarm excepts the reaction of the farm girl, Bea<br />\nBaltimore has such a group; every he willed his body to float gently to Laughter<br />\nclass patronage will be much too confining in every large city in the country has one.<br />\nA little monkey climbs<br />\nthe ground. But, being a true showSorenson, on her first arrival at Gopher Prairie,. But the<br />\nman, he decided to further his great<br />\n* * *<br />\nand chatters<br />\nwhole life of the Gopher Prairie ruling clique is so ably,<br />\nway.<br />\nand tosses cocoanut shells<br />\ntoo ably, presented from its own point of view, that<br />\nThe last section is that of literary stunt by landing on the outskirts of<br />\nAnd finally, if you, having renounced revolution<br />\nall around.<br />\n.more often than not we laugh at Carol Kennicott rather<br />\ncriticism. One of its most interest- the town and walking back to his<br />\nas your major profession, should pour your radical<br />\nthan an \"unreconstructed\" Babbit. He. also sees Main<br />\ning articles deals with proletarian hotel.<br />\nsouls into the liberal arts—try, as best you can, to<br />\nStreet from the vigorous point of view of the mulcted<br />\nHaving so decided, he willed his Scntg<br />\nGranville<br />\nself-criticism.<br />\nliterary<br />\ntake yourselves less seriously. Otherwise, you may Hicks contributes a brief inventory body to move sideways, and looking<br />\nfarmers and the itinerant farm workers. The attracWistfully, a little bird<br />\nbore the bourgeois world to reaction and tears—much of recent American literary history. down he could see the land slipping<br />\ntion for Carol held out by the big Swedish plumber and<br />\ndreams and breathes<br />\nby<br />\nit<br />\ndone<br />\nhandy-man who is an I. W. W. is significant. The<br />\nhave<br />\nalong.<br />\ncould<br />\nfloated<br />\nmerrily<br />\nits dream<br />\nJoshua Kimitz offers his excellent by, as he<br />\nmore quickly than you ever<br />\nsympathy<br />\nlanded,<br />\nwith which he is drawn by Lewis shows that<br />\noutskirts,<br />\nhe<br />\naloud.<br />\nstandardization<br />\nin<br />\nthe<br />\nReaching<br />\nliterary<br />\ncharge<br />\nof<br />\nbombs!<br />\n(Continued on Page 3, Col. 4)<br />\nBy A. L. Schneider<br />\npolemic against Max Eastman's and began his walk back to his hotel.<br /><br />\nBy Way Of Introduction<br /><br />\nThe Man Who Walked On Air<br />\nA Story - - By Philip Pearl<br /><br />\nPreface On Radicals<br /><br />\nPoems<br /><br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 10, 1935<br /><br />\n3<br /><br />\nMentarians Go National 3Novels NEWS OF THE WEEK<br />\nTHE MENTARIAN PROGRAM<br /><br />\nMentarians Ridiculed<br />\nBy \"Judge\" Magazine<br /><br />\nAll persons interested in the advancement of Enlighteinment in<br />\nAmerica must unite under the<br />\nMentarian banner1. To make a concerted effort to<br />\neducate the taste of the American<br />\npublic. Or to organize an intellectual market.<br />\nTo thus establish the manof-letters and the maii-of-art as a<br />\nself-respecting and profit-making<br />\nentity in America.<br />\n3. To join the lot of the humanists with that of the lovers of science in the effort that Enlightenment may reap the rewards of<br />\nscientific discoveries—and not Big<br />\nBusiness get them.<br />\n4. To then, after having established Enlightenment as a power<br />\nin society, wage as much war as<br />\npossible against social injustices.<br />\nIN CONCLUSION, the Mentarians seek a position in American society--not as despised radicals without an audience—but as<br />\nmen interested in life's fineries, at<br />\nlast finding expression for themselves in the wealthiest (and formerly the dullest) of nations.<br />\nFor further information: Buy<br />\nThe Mentarian Manifesto, Price<br />\n10 cents.<br /><br />\nOhio Youth Declare<br />\nNeed For Movement<br />\n(Ed. Note—We received this<br />\nletter from the New Republic.<br />\nWe are printing it because we<br />\nthink it a sincere literary document, laying bare the mental insides of a human being. Often in<br />\na letter, without a.ny self-consciousness, a writer can reveal<br />\nhimself more boldly than in an<br />\nentire novel. Here is an example.<br />\nAnd the letter is doubly interesting as testimony that there is<br />\nactually need for a Mentarian<br />\nmovement throughout the towns<br />\nof the country—this being one of<br />\na number of similar notes.)<br />\nTo Edgar Kemler,<br />\nCare of The New Republic,<br />\nNew York City.<br />\nNov. 3, 1935.<br /><br />\nTHE FIRST M. P.<br /><br />\nWith the recent slamming of the<br />\nMentarian movement in the December issue of Judge Magazine, the<br />\nrapid growth of interest in the<br />\nAiovement reaches its highest point.<br />\nAs one of the items under the wellknown feature, \"Judge On the<br />\nBench\", almost a whole column is<br />\ndevoted to ridiculing the group which<br />\nhad its start on the Hopkins campus<br />\nlast spring.<br />\nThe writer, entitling his article,<br />\nThe Mentarians, paraphrases the basic outlines of the Mentarian platform—i.e., that intellectuals should<br />\nwithdraw from Communist parties<br />\nand from waging the class struggle.<br />\n\"Well, we read about a new group in<br />\nBaltimore,\" he says, \"calling themselves 'Mentarians! This singularly<br />\nugly word (?) means, as we understand it, people who have . . . cultivated tastes and not much else. They<br />\nare thereby set apart from the mob<br />\n. . . They are really anti-human, because the vast majority of the masses are, of course, human.<br />\n\"In recent years, it seems, the<br />\nMentarian has made the mistake of<br />\nthinking that he could or ought to<br />\ndo something to make the world better. He let himself feel sorry for the<br />\nmasses . . . What he overlooked was<br />\nthe fact that he had no abilities as a<br />\nleader . . . Therefbre the Mentarian<br />\nSociety of Baltimore has voted to<br />\nreturn the class struggle back to;the<br />\ndullards.\"<br />\nThe writer, after thus caustically<br />\nsummarizing the Mentarian position,<br />\nfinally concludes on a note of reluctant agreement. \"Must our prescription for the government of the future be the continual removal from<br />\npublic life who shows any signs of<br />\nbrains? It sometimes seems so.\"<br />\n0-0<br /><br />\nFirst Set Forth<br />\nIn The News-Letter<br />\nThe Mentarian movement—name<br />\nand most of the major ideas—had its<br />\nfirst public exposal in the May 7,<br />\n1935 edition of the Hopkins NEWSLETTER. This was the Manifesto--later revised, and issued in the form<br />\nof a pamphlet.<br />\nThe first step in the national spread<br />\nof the ideas was the dispatching of<br /><br />\nI think enough of your letter in the<br />\nNew Republic of some weeks ago to<br />\n'keep it in place of easy reference.<br />\nWhen I feel particularly depressed,<br />\nworthless and purposeless, I read it.<br />\nI feel some better after doing so too<br />\nbe assured that there are still at<br />\nleast a few people whose attitude<br />\ntowards life is similar to mine.<br />\nI'm not, however, a college graduate—nor a high school graduate;<br />\nbut just one of those naturals you<br />\nmention.<br /><br />\nBut I'm a realist, all right. I don't<br />\ndwell in any neurotic phantasies. I've<br />\nread modern psychologies, but they<br />\ndon't solve the problem.<br />\nMost of<br />\nthem are worthless. Given a proper<br />\nsocial system, psychological wrecks<br />\nwould disappear. Now the insane are<br />\nbetter off than other people, for they<br />\nlive in their own mental world aliti<br />\ntheir material existence is automatically institutionalized. The world now<br />\nis full of derelicts and they are not all<br />\nin the asylums, I asure you. For the<br />\nI am a non-conformist—in every- present economic system<br />\nof industry<br />\nthing. I don't work well in any kind and technology<br />\nhas produced milof harness; nor do I like any kind lions of them.<br />\nof physical work for its own sake or<br />\nDo any of you Mentarians desire<br />\nfor the money resulting. In these<br />\nmarriage? It seems to me an imrespects, I seem to conform to your<br />\npossible state, unless the economics<br />\npattern of a Mentarian. And, my<br />\nof marriage are assured. If you want<br />\nlife—or at least, what pleasure I<br />\na full-blown neurosis, marriage under<br />\nhave in it—is all mental.<br />\nthe present milieu offers a good one,<br />\nIf I had money for just a living, unless the pair are perfectly matched<br />\nI wouldn't do a damn thing I wasn't —mentally. Don't you think so? Sex<br />\ninterested in. It's rotten state, but is all right for a Mentarian, but it<br />\nI see no way to change it. I'm only soon becomes an empty passtime—<br />\na plumber's son, and for me, it would not an end of itself.<br />\nhave been better if I had not graviTo me, the triumph of the intellect<br />\ntated to books and literature. Better<br />\nis its ability to absorb the experience<br />\nhad I remained in the brawn and<br />\nof others without the pain. I've done<br />\nignorance which was my beginning.<br />\na lot of this by observation—and<br />\nYou see I went through a period probably more by reading in the<br />\nof seeking happiness by material sources mentioned.<br />\nBut all this<br />\nmeans, buying clothes, furniture, au- premature experiences leaves me<br />\ntomobiles, which now are without with a washed up feeling toward life.<br />\ninterest or value to me as escape me- life in general, but I can look only at<br />\nchanisms. Contemplation seems the the bare truth about myself. The<br />\nonly worthwhile pursuit.<br />\nthings that the Mentarians stand for,<br />\nI can't change the social system<br />\nnor the people in it. Groups and<br />\nmovements seem equally impotent.<br />\nRadical demagogy, or any other kind,<br />\nhas no appeal for me. Such men are<br />\nhypocritical at heart, anyway. So<br />\nwhat can I do?<br />\nI read constantly the Nation, New<br />\nRepublic, Harper's, Forum, Scribners. But I can't get away from it.<br />\nIt's a helluva life anyway you look.<br />\nI wish to live closer to the Mentarians—or such people like them.<br />\nIt's a big satisfaction to live around<br />\npeople you're in tune with—and I'm<br />\ncertainly out of tune with the people<br />\naround me. They can't understand<br />\npeople like me, and I don't attempt<br />\nany explanation. I'm a non-conformist, and it's a hard cross to bear,<br />\nbelieve me.<br /><br />\nI :land for. And the success of a<br />\nMentarian Party in America would<br />\ngive me new hope in the only things<br />\nwhich have any meaning for me.<br />\nSincerely yours,<br />\nH. F.,<br /><br />\nIn the middle of the 18th Century in France, a group of Mentarians organized under the leadership of Diderot and D'Alembert.<br />\nthe two editors of the great Encyclopoedia, along with the loud<br />\nchampionship of Voltaire. Here<br />\nare some of the campaign cries:<br />\n\"Unite all our followers. Courage! Let us all pull together, Gentlemen, numbers always command<br />\nrespect. Rise in revolt and you<br />\nwill be masters! . . . It is disgraceful that philosophy cannot<br />\ndo for us what it did for the ancients. It united them; here only<br />\nsuperstition has that privilege.\"—<br />\nVoltaire, in a letter to D'Alembert,<br />\ndated in 1753.<br />\n\"Happy are men of letters if<br />\nthey recognize at last that the<br />\nsurest way of making themselves<br />\nrespectable is to live united and<br />\nalmost shut up among themselves<br />\n(i. e., without obligations to a patron); that by this union they will<br />\ncome to give the law to the rest<br />\nof the nation in all affairs of taste<br />\nand philosophy . . . As if the art<br />\nof instructing and enlightening<br />\nmen were not after the too rare<br />\nart of good government, the noblest<br />\nportion and gift in human reach.\"<br />\n—D'Alembert's Manifesto,<br />\nabout 1750.<br /><br />\n(Continued from Page 2, Col. 5)<br />\nthe author of Main Street realized<br />\nthat there was a focal center for the<br />\noverthrow and destruction of Main<br />\nStreet. But the spirit of rebellion<br />\nhere is so vague and unreal that the<br />\ntig handy-man can only steal away<br />\nin the night to leave Gopher Prairie<br />\nto stew in its own juice. Maybe that<br />\nis all that one could expect in this<br />\ncolantry in 1919, but cer%ainly the<br />\nleast Lewis could have done, had he<br />\nunderstood more clearly the alignment of social forces, was to sow the<br />\nseed of a real hope, to let shine forth,<br />\neven if only for a moment, a small<br />\nray of the future. He did not. Because, seeing Dr. Kennicott and Vida<br />\nand Percy Bresnahan and the others<br />\nhappy and contented,. and Carol always on tender-hooks, Lewis began<br />\nto think that maybe their way of life<br />\nwas right and Carol's was wrong.<br />\nHe wondered whether Carol was not<br />\nlike the chorus girl who remarked<br />\nthat she was the only one in line<br />\nwho was in step. Lewis was confused on this point and the result<br />\nwas that the development of Carol's<br />\ncharacter was lost in the emotional<br /><br />\nRamblers To Give Music<br />\nSir Norman Approves<br />\nAfter Barnstomer Play Student Peace<br />\nMovements<br />\nThe Ramblers, one of Baltimore's<br />\nfinest bands, have been booked as<br />\nthe feature attraction of the dance<br />\nto follow the Barnstomer production<br />\nof \"The Firebrand.\"<br /><br />\nAnnouncement<br />\nof the booking marked the end of<br />\npreparations for one of the gala occasions of the year. Miss Molly<br />\nShriver had already been announced<br />\nsponsor for the -affair.<br />\nSale of tickets, which began in<br />\nLevering Hall yesterday, will continue until eleven-thirty Saturday.<br />\nStudent activity cards must be exchanged for reserved seats. Extra<br />\ntickets for the show and the dance<br />\nsell separately for one dollar each.<br /><br />\nand ideological confusion of Sinclair<br />\nLewis.<br />\n(A fourth novel, closer to the<br />\nreviewer's ideal, will be reviewed<br />\nin a later issue.)<br /><br />\nWorkers Of The World!<br />\n(Continued from Page 4, Col. 6)<br />\nOscar. Don't give me none of your<br />\ntalk, Buffington. You ain't no proletarian. You're a traitor to them.<br />\nYou and all the rest of the halfwitted intellectuals.<br />\nBuff. (Aroused).<br />\nGet out, you<br />\nimbecile!<br /><br />\nUnredeemed Microscopes<br />\nCameras, Binoculars, Musical<br />\nInstruments, Typewriters<br />\n—.-<br /><br />\n118 N. LIBERTY STREET<br />\nPLaza 3495<br /><br />\nporter, Sir Norman Angell expressed approval concerning the<br />\nAmerican Student Peace Movement.<br />\n\"If the Student Peace Movement consists of organized discussion, a thrashing out of both sides<br />\nof the question, and intelligent<br />\nthinking about peace, then I am<br />\nin favor of it.\"<br /><br />\nSecrist Will Speak At<br />\n0. D. K. Assembly Thursday<br />\n(Continued from Page 1, Col. 6)<br />\nand leadership. 2. Scholarship. 3.<br />\nAthletics. 4. Publications. 5. Other<br />\ncampus activities.<br />\nAlthough the<br />\ncharacter of 0. D. K. allows three<br />\nper cent of the Junior and Senior<br />\nclasses to be admitted to the circle,<br />\nthe Hopkins chapter has only five<br />\nmembers, instead of the maximum of<br /><br />\nmovement's a fizzle. And in the twelve members.<br />\ngreatest hour of my career, too.<br />\nDuring the period since its origin<br />\nJulius. But isn't there anything here 0. D. K. has admitted many faculty members. Those who are now<br />\nI can do?<br />\ncopies of the Manifesto to many of<br />\nat<br />\nthe University are President<br />\nthe leading writers and thinkers of<br />\nOlive. Now isn't that fine of him,<br />\nIsaiah Bowman, Dean E. W. Berry,<br />\nVee. To stick with us.<br />\nthe nation. Many answers were reBuff. No, no. Thank you, son. Dr. J. B. Whitehead, Dr. W. V. Weyceived—some favorable, some unfavorable. For example, Josoph Wood<br />\nYou've been a great help. But your forth, Dr. John C. French, Dr. A. G.<br />\nOscar. (In a roar). Ha, ha, ha.<br />\nChristie, Dr. R. S. Roulston, Dr.<br />\nKrutch, editor of The Nation, wrote:<br />\nservice lies elsewhere. Let me be the<br />\nHo, ho, ho. Never read Marx.<br />\nBroadus<br />\nMitchell, Dr. Knight Dun\"Thanks for the copy, which I have<br />\nmartyr. I've earned the right. You<br />\nBuff. Men, get that imposter out<br />\nlap, Dr. George Boas, Dr. Wardlaw<br />\nread with interest and amusement.<br />\nknow my aims, ideals, and hopes for<br />\nof here.<br />\nMiles. I am afraid that I agree with most<br />\nthe working class. Follow them when<br />\n(The two start toward Oscar, but<br />\nof it.\"<br />\nI'm no longer in your midst. Perhe climbs up on the back of the<br />\nhaps, at some future day I- shall reMovement Given<br />\nSecond Cotillion To Be<br />\ncouch, pulls up the shade, opens the<br />\njoin you—returning from prison,<br />\nwindow,<br />\nand starting to crawl<br />\nSpace In \"New Republic\"<br />\nHeld On February 14<br />\nfrom Elba. Leave. Your duties' elseThe next step was the publication through, turns about, facing Buffingwhere. Remember: there must alof a letter by the founder of the ton.)<br />\nThe Second Cotillion will be. held<br />\nways be some to carry the seed of<br />\nOscar. Call your dogs off, Buffmovement in the New Republic of<br />\nFebruary 14, according to an antruth<br />\nfar<br />\nfrom<br />\nits<br />\nunfortunat<br />\ne<br />\nparOctober 9, 1935. Bruce Bliven, the ington. It's too late. I knew all<br />\nent. Julius, my Boswell. (He shakes nouncement made by Alan DeleveLL,<br />\npublisher of the magazine, expressed about this, and tipped off the cops.<br />\nhis hand.) Go, lad. May we meet chairman of the Cotillion Board last<br />\nconsiderable interest in the project in The whole place is surrounded. Come<br />\nSaturday.<br />\nin<br />\nUtopia.<br />\na private letter to society headquar- on comrade: you and I are the same<br />\nAlthough there is no definite anJulius. But, Mr. Buffington, I hate<br />\nters. It is probably from this notice party. You ain't going to stay with<br />\nto leave you like this. You need me. nouncement of the orchestra to be<br />\nin the New Republic that the writer these wind-bags now, are you?<br />\nBuff. No, it's too dangerous. And featured, plans are under way to seComrade.<br />\nof the Judge editorial received his inWill well. Maybe I<br />\nain't a Communist after all. So long, let's be cheerful. They can't arrest cure one of the leading lights in the<br />\nformation.<br />\nme. Remember, I am the masses. orchestra world.<br />\nThen during the months of October Buffington.<br />\nThe<br />\nmasses. The pressure of the<br />\nand November, the society received<br />\nOscar. Suire, Buffington, there's<br />\nmany letters from all parts of the cops for blocks around. And when working-class will hammer down my<br />\nN. S. L. To Discuss<br />\ncountry—in sympathy or protest they find you with that bomb, well-- prison walls. Their enthusiasm will<br />\nagainst the New Republic article. see if you can sell 'em a couple of be fired by my failure. I'll turn deA. S. U. Formation Here<br />\nLetters came in from towns in Flor- your books on Marx. Ho, ho, ho. feat into victory. I'll stir revolution<br />\nThe formation of the American<br />\nfrom my cell. WORKERS OF THE<br />\nida, Ohio, and Pennsylvania—from (They exit).<br />\nStudent Union and the sending of<br />\nWORLD<br />\nUNITE.<br />\nPhiladelphia, New Haven, New York,<br />\n1st Bomber. Jeez, de cops. Come<br />\ndelegates to its first national conBoston, and Chicago. One of these is on, Jo, let's get out. We's really read<br />\nAll. WORKERS OF THE WORLD<br />\nvention will be the subjects of disreproduced elsewhere on this page. Marx, see, Mr. Buffington, dat's our UNITE! (Curtain.)<br />\ncusion at the meeting of the NaIn San Diego, California, the So- profesion—so ther ain't no use in us<br />\n(This should be sufficient to make tional Student League on Wednesciety has been communicating with stayin to face the music. (Start<br />\nthe point; the rest of the play will be day at 4 p. m. in Levering Hall,<br />\nsome West Coast Mentarians of a toward door.)<br />\npresented only on demand.—E. K.) Room B.<br />\nsympathetic turn. The I. B. H., a naBuff. Back! Back!<br />\nI say, you<br />\ntive organization along the lines of mercenaries. (They march out, heedthe Eastern society, may have pre- less.) Alone—deserted and betrayed<br />\nsented at its Christmas Convention a by my allies. In the greatest hour of<br />\nreading of the Mentarian Manifesto. my life.<br />\nAccording to the founder, this is<br />\nJulius. Not by all, sir. You still<br />\ncertainly a remarkably rapid growth have me. Shall I grab the bombers<br />\nand the organization at the Hopkins, before it's too late?<br />\nthe local, central society, might well<br />\nBuff. No, no, never mind. It's<br />\ngrow to set the pace for the country. in the nature of things. I'm<br />\na fizzle.<br />\nMemberships are open: Apply P. 0. We radicals, we true<br />\nhumanitarians<br />\nBox 516.<br />\nhave always been fizzles. The whole<br /><br />\nCHRISTMAS SHOPPING<br />\nIS EASY<br />\nat HUTZLER'S!<br /><br />\nHOME FOR THE<br />\nCHRISTMAS<br />\nHOLIDAY?<br />\nAtikaa you&amp; tygagei<br /><br />\nQU1CKLYaa ECONOMICALLY<br />\nDon't spoil the thrill of getting home again by worrying<br />\nabout the shipment of your baggage. Solve the problem by<br />\nleaving everything to Railway Express. We will call for<br />\nyour trunks, baggage and personal belongings and send<br /><br />\nJust looking around will give you<br />\nplenty of ideas. Or-you can consult our Shopping Service<br />\nabout what Mother,<br />\nSister, or The Girl would like.<br /><br />\nthem home on fast passenger trains through to destination.<br />\nYou can take yourtrain home with peace ofmind —knowing<br /><br />\nAnd how about picking out what you<br />\nwill get with Dad's<br />\nChristmas check?<br /><br />\nExpress service is a decided economy in expense, too.<br />\nAfter vacation,send your baggage back the same way.<br />\nWe give a receipt on pick-up and take a receipt on delivery...double proof of swift, sure handling.<br />\nFor service or information merely call or telephone<br /><br />\nthat your baggage will be there quickly and safely. Railway<br /><br />\nHum(13FORIEM<br /><br />\nNew Philadelphia, Ohio.<br /><br />\nNEW YORK<br />\nLOANS OFFICE<br />\nLOANS<br />\n•<br /><br />\nIn a short and hurried personal<br />\nstatement to a NEWS-LETTER re-<br /><br />\n—<br />\nSPORTS CENTRE<br /><br />\nSKATE AT<br /><br />\nC.C.M. and Spalding Skates on sale<br /><br />\n4/6<br /><br />\nCall PLaza 1696<br />\nFor QUICK LOANS On<br />\nAUTOMOBILES<br /><br />\nPUBLIC LOAN CO.<br />\n232 - 34 EQUITABLE BUILDING.<br /><br />\nCHARLES and FAYETTE STREETS<br />\nVErnon 0600<br />\nDEPOT OFFICE: 203 E. FRANKLIN STREET<br />\nVErnon 0600<br />\nBALTIMORE, MD.<br /><br />\nRAITAwAv<br />\nEXPRESS<br />\nAGENCY, INC.<br /><br />\n,ticlesin<br />\n\"<br />\nReaders .D<br />\nBes<br />\nitgem<br />\ns'<br />\nt:g<br />\n[<br />\nBest A<br />\nMagazines<br />\nFor Price of One\"<br />\n[Special gift prices for Christmas<br />\nM. A. Wessel, Agent — Box 1063 1<br />\n—.J<br /><br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and 33RD STREETS<br />\nNext To Birely's<br /><br />\nJATION -WIDE RAIL- AIR SERVICE<br />\nTUNE IN ON THE RAILWAY EXPRESS NEWS PARADE<br />\nEvery week from the following stations:<br />\nWEE!• WOR • WHK • WLS •KWK • WDSU • WFAA<br />\nWGST • KYA • KNX • KSTP • KOMO • WBAL • ROIL<br />\nWatch for loco/ announcements<br /><br />\nHOME WOOD, BALTIMORE, MD., DECEMBER 10, 1935<br /><br />\n4<br /><br />\nown good.<br />\nBuff. True to your emotions?<br />\nWell, well. A whale is true to his<br />\nemotions; a walrus, to his; an oyster, to his; maybe, even an ape is<br />\ntrue. But an intellectual and a revolutionary, NEVER.<br />\nCome, gentlemen.<br />\nOlive. Oh, George, don't be so<br />\nsmart. Don't you love me any more?<br />\nDon't you know what it means to<br />\nme? For our future, George—don't—<br />\nBuff. Now lisWn to me, Olive-.<br />\nThis IS our future. And when the<br />\nmind starts to build, then there's no<br />\ntime for love—and the emotions.<br />\nSee? If men were true to their emotions,they'd be no better off than<br />\nthose animals I just showed you who<br />\nARE true.<br />\nOlive. Oh-h-h. I feel faint. I'm<br />\nslipping. The lights, Vee, the lights.<br />\n(She faints.)<br />\nBuff Quick, comrade, get some<br />\nwater. (The comrade rushes off.)<br />\nJulius. Can I help any, Mr. Buffington?<br />\nBuff. No, no. No help. Get that<br />\n(Silence.)<br />\nwater, quick, comrade.<br />\nHurry, fool, hurry. (He looks at her<br />\nvery carefully.) Olive! She's coming to. Wake up. Don't scare me<br />\nlike that. (Comrade arrives with the<br />\nwater, dashes her face with it, runs<br /><br />\nWORLD!<br />\nWORKERS OF THE<br />\n••<br />\nThe Farce Of Our Revolutionaries:- •• -:<br /><br />\nWhat will Trotsky say? I'll be the<br />\nstock—<br />\nlaughing<br />\nBuff. Well, then, what's<br />\nthe<br />\nOlive. Ha, ha, ha. Oh, Vee, havetrouble?<br />\nof humor?<br />\nComrade. He went and tied me haven't you any sense<br />\nBesides, Trotsky hasn't written to<br />\nup. That's what.<br />\nmy<br />\n(While they are talking a spy slips you since the time you sent him<br />\nlove letters by mistake. Read on—<br />\nin under a couch, unseen.)<br />\nlook for my name.<br />\nOlive. You fool.<br />\nWhat did you<br />\nJulius. What else does it say, Mr.<br />\nlet him tie you up for?<br />\nBuffington?<br />\nBuff. Quiet, Olive. Listen, man,<br />\nBuff. (He reads on) \"The story<br />\nwhat did we tell you to? Can you<br />\nof Buffington's start in matters<br />\nremember that?<br />\nrevolutionary is highly revealing of<br />\nComrade. No, sir, I don't.<br />\nBuff. You don't remember? Lord, his character. As a small lad, his<br />\nfather once took him to meet the<br />\nwhy not?<br />\n(Continued from Page 1, Col. 1)<br /><br />\nComrade. Cause I didn't underPresident in the White House. For<br />\nstand what you said. I ain't never the old man, a small-town politician,<br />\nunerstood them big words you use.<br />\nthe trip was an award for counting<br />\nBuff. Damnation! A fine time to .he votes wrong in the election. Now<br />\ntell us that.<br />\no understand the story, it's necesJulius. But, comrade, we talk the sary to explain that Buffington had<br />\nlanguage of Marx and Engels. Your )ne of the most remarkably effusive<br />\nlanguage! For it was certainly in )1adders ever recorded in one so<br />\nyour interest that they laid down oung. He was as eternally moist<br />\ntheir thoughts and life work.<br />\nis the western coast of the Atlantic<br />\nComrade. You're right. We got icean. So, in the midst of the most<br />\nto speak good Anglish.<br />\n,ober formalities, seated on the most<br />\nBuff. Good English, sure. And I eremonious knee of the chief execuconfess it's very sad that we do. You jve, his unfortunate system broke<br />\nsee we of the working class could down and sobbed itself away. That,<br />\nonce curse and slang and talk our you see, is the start of his revolusalty dialect all we wanted to. But, tionary career.<br />\nThat, in short, is<br />\nalas, it's no longer ours. We've been 13uffington.\"<br />\nrobbed of our tongue. Their novelI can<br />\nOlive. My, so like you.<br />\nists use our \"ain'ts\", \"cripes\" and almost believe it. You never know<br />\n\"damns\". Their once-charming essay- when to stop.<br />\nists now overhear our sailors and<br />\nAny<br />\nJulius. That's libel, sir.<br />\nrailroadmen and jot down our most<br />\nmore?<br />\nvulgar thoughts. Society says, \"Oh,<br />\nBuff. This is miserable. I can't<br />\nyeah,\" \"lousy,\" and \"Come seben.\"<br />\nit.<br />\nSo what remains to you, comrade, read more. I can't stand<br />\nDoes it<br />\nit?<br />\nwrote<br />\nWho<br />\nJulius.<br />\nand me? Nothing but the colorless<br />\nsay?<br />\nheir<br />\nladorables\"—t<br />\nand<br />\n\"axquisites\"<br />\ncast-off grammar of a fOrmer day.<br />\nBuff. Let me see. It sounds like<br />\nNo use fooling ourselves. These are —Yes, sure, it's Lovebalm.<br />\nthe tools with which we must wage<br />\nSuch impuOlive. Lovebalm!<br />\nclass warfare . . .<br />\ndence.<br />\ntruth,<br />\nit<br />\nthe<br />\nComrade. Ain't<br />\nBuff. This can't be allowed to go<br />\nthough? Sure, sure!<br />\non. It's got to be shut up. And<br />\nOlive. Vee, Stop. Can't you see<br />\nright away. Listen, men. We're not<br />\nthe poor fellow wants to tell us somegoing to bomb Smith tonight. There's<br />\nthing?<br />\nonly one thing to do before it's too<br />\nBuff. Yes, certainly. What haplate. And that's Lovebalm. We've<br />\npened, comrade?<br />\ngot to put him out of the way.<br />\nComrade. I was so scared. I donOlive. Vee, you're not serious<br />\nto<br />\nthe \"Worker<br />\nno, see. But I went<br />\nabout this?<br />\nPress\" building<br />\nBuff. No? Let me have that phone.<br />\nJulius<br />\n(together).<br />\nOlive,<br />\nBuff,<br />\ntakes the phone). Hello, opera(He<br />\nWell?<br />\nHello,<br />\nComrade. I saw a man come out. tor, quickly, Calvert 3030.<br />\nSo I went and asked him where revolutionary sUpply shop. Hello—<br />\nHe says he don't yes, I know—red bombs, red books,<br />\nLovebalm was.<br />\nred ties, red underwear—cut that<br />\nknow.<br />\nBuff. What'd the man look like? stuff out—this is Buffington. Yeah.<br />\nSend up another bomb,<br />\nComrade. I dunno. So dark, so Listen.<br />\ndark. But he looked a little like old<br />\nLoveblam. But if he don't know, it<br />\nain't my business to call him liar.<br />\nThen sure enough, soon's I turned<br />\naround, he stuck a pistol in my back,<br />\nhanded me a paper, and said, \"Man,<br />\nyou better run like hell, and if you<br />\ndon't give this to Buffington, I'll<br />\nshoot you down, straightway.\"<br />\nJulius. I thought you were tied<br />\nup?<br />\nComrade. I dunno. I forget, see.<br />\nSo dark, so dark!<br />\nBuff. Oh, bother the story. Let<br />\nme see that paper, man. Quick!<br />\n(Starts to read the headlines). \"Lovebalm Joins Forces With Communists!<br />\nUnited Front Against Buffington.<br />\nTwo hundred men sign resolution to<br />\nthwart, picket or ignore Buffington.<br />\nBuffington's<br />\nof<br />\nstory<br />\nAmazing<br />\nin<br />\nexposed<br />\ncareer<br />\nblackguardly<br /><br />\nBy EDGAR KEMLER<br /><br />\nIt's for<br />\ndouble strong mixture.<br />\nLovebalm. Changed my mind, see.<br />\nMake it fast. What? You say you<br />\nhaven't been paid for the last one.<br />\nGood heavens, man, I'll pay you after<br />\nthe revolution. VVha-at? No credit<br />\n—you don't believe in the revolution?<br />\nWhat a hell of a proletarian you are?<br />\nLet Lovebalm pay for it.<br />\nListen.<br />\nre's charged enough to my account.<br />\nSure, take it out of his insurance<br />\nmoney. No? To hell with you, then,<br />\nyou double-crosser. (He slams down<br />\ntile receiver).<br />\nJulius. Can't we use just the one,<br />\nMr. Buffington?<br />\nBuff. That's what we'll have to<br />\nMen, you know the address.<br />\ndo.<br />\nComrade, this is your one great opportunity to vindicate yourself. You<br />\ncome with us. You're used to this<br />\nsort of thing. You'll throw the body<br />\nin the river, or bury it. I don't care.<br />\nOlive. Vee, how could you. If<br />\nI thought you meant it, I'd shoot you<br />\nfirst.<br />\nBuff. Stupid, of course I mean it.<br />\nCome, hurry, men, we've no time to<br />\nFirst, plant the bomb. Seclose.<br />\nond—<br />\nOlive. Why must you terrorize<br />\nthe poor fellow?<br />\nBuff. Havent you heard what he's<br />\nwritten? He'll ruin my career.<br />\nOlive. You never think about me<br /><br />\n, Noise (under couch). Ho, ho, ha,<br />\ncourse not<br />\nBuff. That's simple. Who is the ha. Never read Marx—of<br />\nha, ha.<br />\ngreatest economist? Obviously, Karl —that's rich—ha,<br />\nshaggy-looking, wind-blown<br />\n(A<br />\nMarx. Therefore, he is the greatest<br />\ndoctor, too, just as castor oil is the little man emerges from under.)<br /><br />\nsir?<br /><br />\nOlive. Well, what business is it<br />\nof yours? Besides, you know I love<br />\nall men. You've often said so.<br />\nBuff. You get me angry, Olive.<br />\nWhy the deuce do you bring love into<br />\nthe picture, at a time like this?<br /><br />\nno doubt about it.<br />\nJulius. Who shall I send for then,<br /><br />\nCHARLIE DER<br />\nFirst Class Laundry<br />\n3224 GREENMOUNT AVE.<br />\nQuality Hand Work at Our<br />\nLow Prices<br /><br />\nOlive. I'm true to my emotions.<br />\nPlease don't bomb tonight. For your<br /><br />\nBoulevard<br /><br />\nBarber<br /><br />\nShop<br /><br />\nS. E. Corner Saint Paul &amp; 33rd Streets<br />\nEntrance on 33rd Street<br />\nWeek Days-8 A, M. to 7:30 P. M.<br />\nSaturday-8 A. M. to 9 P. M.<br /><br />\nIGB<br /><br />\nmV 45<br />\nii S<br />\n4k.<br />\nROUND iRIP*<br />\nGRyfki.tyb rAREss<br />\nRefec„tiv kis<br />\n}<br />\n0Jah.IED<br />\nREDUC<br />\nre<br />\n411<br /><br />\nBelo<br /><br />\nebt-uaryi<br /><br />\n-<br /><br />\nChas. Landler, Prop.<br /><br />\nHAIRCUTS-40c<br /><br />\nComrade (Once more he's back in<br />\nJulius. But Karl Marx is dead, the room, returning unnoticed.) Oscar, my friend, I thought you was a<br />\nSi'..<br />\nCommunist. I thought you was one<br />\nBuff. Of course, of course.<br />\nus.<br />\nof<br />\nJulius. Well, what shall we do?<br /><br />\ngreatest of all revolutionaries.<br /><br />\nJulius. Shut up, comrade.<br />\nYour wife's desperately ill.<br />\nOlive. Oscar, the inter-party spy!<br />\nBuff. We do what is next best.<br />\nBuff. Who let you in?<br />\nJulius. What's that?<br />\nOscar. I didnt have to be invited.<br />\nBuff. We find the one who is<br />\nmost representative of Karl Marx on You don't need no hand-carved invitations when you're the ambassaEarth.<br />\ndor of fifteen million hungry workJulius. But where?<br />\nBesides, your comrade over<br />\nfrom men.<br />\nvolumes<br />\nBuff. (Taking<br />\nwe was all the same<br />\nthought<br />\nthere<br />\nthis<br />\nsee<br />\nyou<br />\nbook-shelf). Julius,<br />\nparty. He showed me the place here.<br />\nvolume?<br />\nI followed him. Why ain't you never<br />\nJulius. Yes, sir.<br />\nBuff. \"The Essence of Karl Marx. told him where he belongs?<br />\nComrade. Yeah. Why ain't you<br />\nA fine book. I wrote it.<br />\ntold me?<br />\nnever<br />\nJulius. Then you're the—<br />\nBuff. My God, a traitor, too,<br />\nBuff. Not yet. Wait. Here now<br />\nwe have this one, too. \"An Answer Comrade!<br />\nOscar. Aw, shut up, Buffington.<br />\nto Buffington's Essence of Karl<br />\nYou aamned fake. Never read Marx!<br />\nMarx.\" I wrote this.<br />\nI thought not. Cheap windbag. So<br />\nOlive. Vee, please.<br />\nyou expect to blow up Lovebalm,<br />\nsir,<br />\nSurely,<br />\nJulius. Your wife?<br />\nafter spending your life in tiddlyyou're the great doctor then!<br />\nthe<br />\nBuff.Yes, yes. But listen, Julius. winks filling up the mouths of<br />\ntheories.<br />\ngassy<br />\nof<br />\nlot<br />\na<br />\nwith<br />\nmasses<br />\nAn<br />\nyou<br />\nsomething.<br />\ntell<br />\nto<br />\nI'm going<br />\nThey don't want that. They don't<br />\nabsolute confidence.<br />\nyou. You don't care a damn for<br />\nwant<br />\nagain.)<br />\nout<br />\nJulius. Yes.<br />\nin<br />\nOlive. (Opening her eyes.) Well,<br />\nBuff. Very few know of its truth them. You ain't touched a spade<br />\nof<br />\ndrop<br />\na<br />\nearned<br />\nhave<br />\naint<br />\nneedn't<br />\nfor heaven's sacks, you<br />\n—and no one could possibly guess it. your life. You<br />\nAll you care for in this<br />\nsweat.<br />\nhad that idiot throw water all over<br />\nJulius. Yes.<br />\nme—and spoil my dress.<br />\nBuff. These are the most authori- crazy world is your own reputatian.<br />\nSo a trick! tative texts—interpretations of Marx At a time when the country bawls for<br />\nBuff. Your dress?<br />\na good leader, you throw bombs at<br />\nAnd so old and hackneyed! Come, —youll find anywhere.<br />\nanother gassy high-brow. I hope to<br />\ngentlemen, let's be going.<br />\nJulius. I don't doubt it.<br />\nvery<br />\nfeel<br />\nI<br />\nill.<br />\nI'm<br />\nGeorge,<br />\nOlive.<br />\nBuff. Well, the truth of the mat- hell you kill each other.<br />\nMy dear<br />\nDon't go.<br />\nBuff. (Patronizingly).<br />\nsick.<br />\nter is—look, I've NEVER read Marx!<br />\nJulius. Shall I call a doctor, Mr. Never looked within the covers in fellow—<br />\nShe looks white as my life. Never read a line.<br />\nBuffington?<br />\n(Continued on Page 3, Col. 4)<br />\nchalk.<br />\nBuff. Yes, she looks pretty bad.<br />\nBut no, no doctor. What she needs<br /><br />\nany more.<br />\nBuff. Please don't nag, Olive. It's<br />\nnot becoming.<br />\nOlive. I won't pay for last month's<br />\nlaundry if you go.<br />\nBuff. Be reasonable, Olive.<br />\nis an economist.<br />\nOlive. I'll become terribly sick if<br />\nJulius. An economist? Good heavyou do him any harm.<br />\nens, sir, your wife is sick.<br />\nBuff. Who, Lovebalm? How do<br />\nBuff. Young man, I repeat. She<br />\nyou know him?<br />\nneeds an economist. The source of<br />\nOlive. I—I don't, exactly.<br />\nall literature, all art, all thought, all<br />\nBuff. Certainly, you know him. history, all revolution, and certainly,<br />\nYou like him. I suppose you love all disease is economic. There can be<br />\nhim.<br /><br />\nIf you're right?<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\nBaltimore<br />\n12-20 Hopkins Place<br /><br />\nGet New Low Fares<br />\nOther Information<br />\nFrom Greyhound<br />\nAgent<br />\nThese big reductions effective nearly everywhere.<br />\nDrop in, or telephone for<br />\nspecific details.<br />\nBUS<br />\nGREYHOUND<br />\nTERMINAL<br />\n217-221 W. Baltimore St.<br />\nPhone: PLaza 0520<br />\nCampus Agent — M. L.<br />\nKrieger, E. 22 Dormitory,<br />\nCHesapeake 4912.<br /><br />\nors<br /><br />\nTHE BARNSTORMERS<br />\nPRESENT<br /><br />\n\"THE FIREBRAND\"<br />\n\"THE<br /><br />\nS.A.C.<br /><br />\n—or—<br /><br />\nAFFAIRS<br /><br />\nOF<br /><br />\nCELLINI\"<br /><br />\nan invective!<br />\nJulius. Isn't it true, sir?<br />\nBuff. Of course—but what difference—it's the damnest thing I've<br />\never had.<br />\nJulius. I'm afraid I don't understand, sir? What could be bad about<br />\nbeing an American?<br />\nWhy, boy, that's<br />\nBuff. Bad?<br />\nmiserable. Who, of any importance<br />\namong radicals is an American? All<br />\nour great leaders, thinkers, scholars,<br />\nfigures worthy of the least reverence, are Poles, Slovaks, Czechs,<br />\nHungars, Letts, Russians, Tartars,<br />\nAmerican.<br />\nbut<br />\nCracks—anything<br /><br />\nDANCING<br />\nTHE<br /><br />\nEXCHANGED<br /><br />\nIN<br /><br />\nLEVERING HALL<br /><br />\narticle on inside pages.\"<br />\nJulius. Great guns, Mr. Buffington! That's the biggest challenge<br />\nwe've ever had.<br />\nOlive. Does it mention me, Vee,<br />\nin the article?<br />\nBuff. (He turns quickly to inside<br />\npages). Well, I'll be damned. Look<br />\n\"Although<br />\n(He reads).<br />\nat this.<br />\nBuffington has done the best he could<br />\nto conceal his ancestry, there is irrefutable evidence that he's from an<br />\nAmerican family, traced to the Mayflower. There can be no doubt. Buffington is a Yankee. Down with Buffington!\" God, Olive, that's an insult!<br />\nThey call me an American. What<br /><br />\nCARDS<br /><br />\nAFTER<br /><br />\nSHOW<br /><br />\nBY<br /><br />\n\"THE RAMBLERS\"<br /><br />\n•<br /><br />\nMARYLAND<br /><br />\nCASUALTY<br /><br />\nAUDITORIUM<br />\n-0 N —<br />\nSATURDAY, DECEMER 14th<br />\n8:30 P. M.<br /><br />"}], "field_media_file": [{"target_id": 38992, "display": null, "description": null, "target_type": "file", "target_uuid": "59514b64-e1b9-4a67-b564-a37073b67d9e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12668-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12668, "target_type": "node", "target_uuid": "2e3ff0e1-791a-4b94-99c2-be98aef53591", "url": "/node/12668"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "07fa4466-342b-46f0-a445-a7b78b82e148"}]}