{"mid": [{"value": 35695}], "uuid": [{"value": "368c6c15-8654-43aa-93b4-96a81c875309"}], "vid": [{"value": 35695}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12232-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "February 5, 1903<br />\n<br />\nVol. VII, No. 8<br />\n<br />\nTHE<br />\n4<br />\n<br />\nNEWS ere•LETTER<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fPie Joints Hopkins Pre.<br />\n<br />\nThc JoIiii Hopkins Universitil<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nTWENTY-SEVENTH<br />\nBeginning October<br />\n<br />\nYEAR.<br />\n<br />\n1.<br />\n<br />\nItmerican Chemical Journal.<br />\nI. EtENBENT, Editor. Monthly, am Volume<br />\nXX.IX in progress. $5 per volume.<br />\n'Itmcrican aournal of Philology.<br />\nII. L.(ii I.I)ER SLEEVE, Editor. Quarterly.<br />\nVolume X X111 in progress. 13 pervel nine.<br />\n<br />\n110.<br />\n<br />\nStubies front the 13ioloaical laboratory.<br />\nVolume V ClJniplete. $5 per volume.;<br />\n<br />\n10.<br />\n<br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\nre.<br />\n<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR TJNDER(IRADUATES:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLaboratories.<br />\nhetnistry.<br />\nhyaies.<br />\neology and Mineralogy.<br />\nlogy,<br />\nnatomy.<br />\nhysiology.<br />\nathology and Bac tort)logy.<br />\narmacolog<br />\nenlist ry.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLain.<br />\nSanskrit.<br />\n1'iuJ lilt'.<br />\n<br />\nDirectors.<br />\nIra lienon<br />\nJoseph S. Ames.<br />\nWilliam 11. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. 11muItli.<br />\nWilliam, H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oder.<br />\nDirectors.<br />\nBasil I.()Hares!, ere.<br />\nI'. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Ilanpt.<br />\nHenry<br />\n.4. Marshall b;11 lot t<br />\n.lamex<br />\nlleiyht.<br />\nJohn At. Vincent.<br />\n.1. lt. 1 lollasith<br />\n<br />\n0111tillee.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\n<br />\n(I))!,<br />\n<br />\nWiscith<br />\n<br />\nPh)<br />\n<br />\nUndergraduate<br />\n<br />\nAwe,.<br />\n<br />\nCourses (leading<br />\n<br />\nto 13. A).<br />\n<br />\nI. classical<br />\n(the \"old college eourse\").<br />\nNlathematical-Physioal<br />\n(leading up to engineering).<br />\n.t. 'hetnical-Biological<br />\n(leading up to medicine).<br />\n4 i;eologleal-Biologleal.<br />\n6. latin- Ma t hematical.<br />\n6. II istorien] Political<br />\n(leading up to law).<br />\n7. Modern 14inguages.<br />\n2.<br />\n<br />\nSerial Publications.<br />\nmodest) Journal of Mathematies(vol X XV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Jeurnal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV 1.<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circula<br />\nX X I I).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\nStables in Victories( anb 'politica! $cience.<br />\nMonthly. Svo. Series XXI in progress. $:;<br />\nvolume.<br />\n3obna 1bophins \"University Circulars.<br />\nContaining reports or scientific and 1 ittra y wi irk<br />\nin progress in Baltimore. Ito. Vol. X Xl I in<br />\nprogress. $1 per year.<br />\n<br />\n0111. 3obno lbophins<br />\n<br />\nlboopital Zulletin. Monthly. 41o.<br />\nVolume X I V In progress $1 per year.<br />\n1011111. Johns Ibopkins bospital eports. 4to. Volume XI<br />\nin progress. $5 per volume.<br />\nix.<br />\n<br />\nContributions to lissyriology anb Comparative<br />\netc.)<br />\n5enittle pbitotowe, Ileitrage zii r A ssy<br />\nVol. IV complete.<br />\n<br />\nX.<br />\n<br />\nMemoirs from the 16iological laboratory.<br />\nW. K. BROOKS, Miler. Volume IV tionitilde<br />\n$7.50 per volume.<br />\n<br />\nLibraries.<br />\nUniversity,<br />\n106,000 volumes.<br />\nPeabody Institute, 146,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nVolti tee<br />\n<br />\n11.<br />\n<br />\nI, 1Q02.<br />\n<br />\nPresident: 1.a., HEMSEN. ikon of /he Medical I'acuity:<br />\nW i LLIAM H. Howsci.. Dean of the Colleye Faculty:<br />\nEDWARD H. GRIFFIN.<br />\n<br />\nlimertean Journal of Mathematics.<br />\nF. Mt ilthEY, Editor. Quarterly. 4t.o.<br />\nXX V in progress. $6 per volume.<br />\n<br />\nMobern language Votes.<br />\nA. M ELLIOTT, Editor. Monthly. 4to. Voluni.•<br />\nX.V 1 II in progress. $1.60 per volume.<br />\nX11. 'Journal of Experimental Mancini:.<br />\nW, II. WELCH, Editor,<br />\n8vo.<br />\nV I in progress. $5 per volume.<br />\nX11.<br />\n<br />\nX111. 2tmerican 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.4to, $5 per<br />\nvolume.<br />\nX110.<br />\nD.<br />\n<br />\neports of flbarylanb entoloaical Survey.<br />\n1,V I',LIAM B.(IA RK, Editor.<br />\nterrestrial Magnetism anb Ittmospheric Elec.<br />\ntrietty. L. A. BA1'ER, Editor. Quarterly. It.<br />\nVolume VII in progress. $2.50 per volume,<br />\n<br />\nftni. itnnualliteport.<br />\nPresented by the President. of the Board of Trustees, reviewing the operations of the University<br />\nduring the past acsdetnic year.<br />\nP11.'Etnnual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, ete., of the University. Po?,.<br />\nfished at the close of the academic year.<br />\n<br />\nIn addition to the serials shove named. copies may<br />\nhe obtained of I he works mentioned helow:<br />\nThe Collected Physical Papers of Henry A. Howland.<br />\nThe CriticalEdition of the Hebrew Text i)f the I ild<br />\nTestament. Edited by Prof. Paul Haupt. Prospee'tus on application.<br />\nRowland's Photographs of the Normal Soho) Spectrum.<br />\n10 plates. $20.00.<br />\n'Description of the Johns Hopkins Hnspital. .1. S. Billings, Editor. iw pp. 4to. ral plates. b7.5i) cloth.<br />\nThe Teaching of the Apostles. Complen lac- simile edition. Edited by .1. itendel Harris. 110 pp. 4to. 10<br />\nplates. &MC<br />\nReproduction in Phototyipe of Syriac MSS. with A tithegomena Epistles. Ed ted by I. H. Hall. VOX).<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\nII-11 I. Chemistry, Mineralogy and Geology. Parts<br />\nV-V-VI. Physies,Astronomy us lid Mat<br />\nt<br />\nto. 30 cents per part.<br />\nft full list of publications will be bent on application.<br />\n<br />\nCommunications in respect to exchanges and remittances<br />\nhe sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\nmay<br />\n<br />\n\f,<br />\n<br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nFEBRUARY 5, 1903.<br />\n<br />\nNo. 8.<br />\n<br />\nSOME EDUCATIONAL PRINCIPLES UNDERLYING COLLEGE<br />\nINSTRUCTION.<br />\n--I Concluded.]<br />\nHUS far we have been dealing witn the adolescent age in general, we shall now proceed to consider more particularly that part of it with which the college instructor<br />\nhas to deal. The adolescent of from 18-22 has the same characteristics as that of the<br />\nadolescent from 14 to 18. The difference is in the degree and manner of manifestation of<br />\nthe characteristics. The college student must be looked upon as a being surcharged<br />\nWith nervous force which is continually seeking manifestation along the line of least resistence, in that way which most satisfies his desires. The emotional element in him is<br />\nthe same emotional life as before, except that it has become more intellectualized, more<br />\nunder the control of the reason, if his education has been properly directed; otherwise it is<br />\nall the more predominating But taking the usual college freshman, his emotions must be<br />\nreckoned with as being intense and fitful, and marked by its extraordinary manifestations<br />\nof love, hate, auger, pride, loyalty, rivalry, jealousy, courage. Altruistic motives likely<br />\nhave greater sway at this time than in the earlier years. He is usually sensitive and introspective On the whole, the emotions predominate over the intellect, and this fact, together with the character of these emotions, must be in mind whenever approach is made<br />\nto him either for the purposes of instruction, or for any other. By the time he reaches his<br />\nJunior and senior years, these unusual manifestations of the emotions are in most cases<br />\ntoned down and have become under the control of the intellect. His interests, his judgments, his actions have risen to this higher plane, and the method of approach may<br />\ntake advantage of the change<br />\nIn intellectual capacity he has progressed in the power of synthesis and generalization<br />\nto some degree, largely conditioned by the four factors (1) the subjects he has studied in<br />\nschool;(2) the experience he has had outside of it; (3) the direction, help and encouragement<br />\nhe has had;(4) his own ability. No more definite generalization than this is passible, in so<br />\nfar as I know. The instructor can usually determine the question in a short time at any<br />\nrate. Then, too, it is really the least important of all to consider. There is little need for<br />\nsuch, however, inasmuch • as in educational institutions facts regarding the intellect are<br />\neasily obtained and the results estimated in some more or less perfect way.<br />\nIn his will power he is just as strong and as determined as before, perhaps even more<br />\nSO. Like the emotions, however, the will is more amenable to reason. Yet reason has not<br />\ngained the ascendancy by any means There are frequent spells of lassitude, and then<br />\ntimes when he will exhaust himself in his activity. When his mind is once made<br />\nup he is more hard to dissuade than formerly; he is essentially active and enthusiastic in<br />\nwhatever he undertakes, and assumes the attitude of independence and responsibility more<br />\nthan before. He must have interests of some kind to which he can give his energy, and<br />\nthis is more likely to be true with the college man than with the preparatory school boy.<br />\nThe tendency to give almost all his energy to one special line of activity, which will<br />\nlater become his life work, is making itself manifest. And whereas before his activity<br />\nmade itself felt in a great many directions in an almost equal degree, he has now chosen<br />\none or several lines which most appeal to him, and has withdrawn his attention from the<br />\nothers.<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS- LETTER.<br />\n<br />\nThe college years constitute the period par excellence when he passes through that turmoil of fixing for himself those eternal principles which are to be used as his standard of<br />\njudging right and wrong in the world, and of &terming his relations to his Creator. With<br />\nthe broader horizon, with increased intellectual power, with wider experience, he is now<br />\nable to grapple with such problems and after a struggle or longer or shorter duration, perhaps of several years, he emerges with certain definite principles which in all probability<br />\nwill govern all his later thinking. It is this time also, rather than the previous, when<br />\nhe really first looks upon the world seriously, and ponders what he is to do in it and for it,<br />\nhis choice being determined by heredity, environment, and individual choice. It is the<br />\ntime of most unstable mental equilibrium. It is the storm and stress period of life, when<br />\nresponsibilities, more often exaggerated than not, begin to be realized, when opportunities<br />\nof varying kinds are suggested, when he feels the power within hint with which it seems<br />\nhe can almost move the world, yet with uncertainty as to the directions in which it may<br />\nbe right for him to exert his energy, and after that is decided where it is best. All these<br />\nserious conflicting conditions necessarily cause mental turmoil. And what an opportunity<br />\nthere is for the educator—him whom he loves—it is too grand and beautiful and inspiring<br />\nto think of it. The reward that comes to the teachur who can reach him is more than the<br />\npaltry dollars that business may offer in excess of his meager salary.<br />\nWe have in adolescence the sublime spectacle of youth being born into the life of the<br />\nrace to be prepared for the battles that life brings When he enters he is resistless energyuncontrolled by reason, when he leaves it he is a mature man with the same emotional<br />\nstrength as at the beginning but manifested now in accord with \"the good, the true and<br />\nthe beautiful\" through the cultivation of the intellect and the discipline of the will.<br />\nAs educational principles to be drawn from these facts of genetic psychology, I would<br />\nsuggest the following as of the greatest importance. They are for the most part been<br />\nmade, obvious by what has preceded, and require but little explanation<br />\n(1) The personality of the instructor should be such as to appeal to young people.<br />\nWhile this is in all cases true, it is nowhere so true as in the adolescent age, when the<br />\nadmiration of the youth for the adult becomes so strong as to devolop into hero worship.<br />\nIf the instructor wishes to make full use of this tendency in young people, he must address<br />\nhimself to them in such a manner, both in and out of the lecture hell, that they will feel<br />\nthat he understands them, and that he has a genuine interest in their development. Inasmuch as the intellectual occupies a subordinate place in the field of their interests, the instructor must administer to their other interests to a considerable degree, whether they be<br />\nmoral, aesthetic, religious, personal, or so3ial. While it is true that it is the personality of<br />\nthe instructor that enters into the life of the student far more than what he teaches, it is<br />\njust as true, that the more pleasing his personality, the deeper the impressions his teaching<br />\nmakes upon them.<br />\n(2) Growing out of the above but deserving the rank of the other principles given,<br />\nthe instructor should thoroughly understand the nature of adolescents.<br />\n(3) Deep intellectual interests should be developed in the student, and a serious atti_<br />\ntude toward study as preparation for after life established The truth is self-evident. As<br />\nJames whits out this is to be done by building upon those interests already acquired, lead•<br />\njug to those more advanced. But let me insert a word of caution at this point, as to the<br />\ndetermination of the degree of difficulty of sabject matter that should be attempted. The<br />\nfact t hat some students can do the work, is not in itself an indication of the rightfulness Of<br />\ngiving that work. Adolescents can do wonders and the discovery of difficulties is often<br />\nthe strongest motive for pursuit of a line of work, and when this is true the course offered<br />\nmay be entirely wrong from the educational point of view. Psychology demands that the<br />\ninterest and motive should abide in the subject itself.<br />\n(4) The instructor should make use of and develop the tendency to independent<br />\nthought and action.<br />\n(6) The instructor should inspire in the student enthusiastic; activity in his studies,<br />\nand in all the other legitimate activities of life. Otherwise much of the evil and the in-<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\ndifferent yvill come into his life He must do something; help him to do that which is<br />\nprofitable.<br />\n(6) Economical use of the nervous energy should be planned. The unessential should<br />\nbe eliminated; proper and definite directions of study given; doubts, perplexities, fears, removed; the scatter-brained lured to consecutive thinking; manias for thinking in extreme<br />\ndegree restrained; and true habits of thought formed. That is, this storm and stress period<br />\nof life where so much nervous force is wasted, should be so regulated as to give to the student, when he emerges from it, the maximum amount of plwer.<br />\n(7) The practical bearing of the subject matter of instruction upon life, present and<br />\nfuture, should always be clear in the mind of the student. He should always think the<br />\nsubject worthy of all the energy that he can give to it, and be able to state the reasons<br />\ntherefor. Otherwise he is departing from his normal attitude towards things.<br />\n(8) The individuality of the student should be properly cared for, that its strong<br />\nPoints may be preserved, and its weak points strengthened.<br />\n.(9) Opportunity for the student to express his thoughts freely and with the benefit of<br />\ncriticism should be afforded. No mental process is complete until it has found expression.<br />\nAll instruction should provide for it. It may best be done by free oral discussion or under<br />\ndirection by set debate.<br />\nWe are now ready to proceed to inquire into the question in how far do the systems<br />\nof instruction prevailing in colleges fulfill these laws? These systems may be classified<br />\ninto three—(1) the lecture system; (2) the text book and recitation system; (3) the combination of the two.<br />\nThe character of a lecture course differs with the character of the lecturer. Some<br />\ncourses are almost purely informational. in so far as the product derived from them is concerned. In others there is a personal element contributed by a lecturer that is very<br />\nvaluable, These two features must be separated in a discussion of the system as a 'whole.<br />\nFirst, the lecture in HO far as it is informative. If we review this kind of lecture, in<br />\nthe light of these principles, it must be unhesitatingly condemned Only one of them<br />\nwill, in all probability, be fulfilled, that of making clear the practical bearing of the subject matter upon life, and in many cases it fails in this as well. The preponderance of<br />\nevidence is overwhelmingly against its achieving (1) the awakening of deep intellectual<br />\ninterests; (2) the developing of independent thought; (8) the inspiration to enthusiastic<br />\nactivity; (4) the insuring of an economical use of nervous energy; (5) the full development<br />\nof the individuality; (6) the giving of opportunity for expression of thought The first and<br />\nSecond principles cannot be applied in this connection.<br />\nAnd furthermore, and sufficient in itself alone to mark it as a very imperfect method<br />\nof procedure even though the truth be not strictly educational, such a means is not the best<br />\nto give information. The notes taken are not a fair and true synopsis of the lecture given<br />\nGreat labor upon the part of the student is needed to prepare their imperfect reproduction<br />\nproperly, and so on The lecturer in these days owes the student a printed book, and if<br />\nthe matter of his lectures is worth publication, he will not have difficulty in securing a<br />\npublisher. Or if this is not possible, he may make good use, and from the students' standpoint better use of a book written by another.<br />\nThe personal element in a lecture is of very great value indeed in securing the results<br />\nto be achieved in the above enumeration of principles. But the best use of personalty is<br />\nnot being made in giving an informative lecture. To this we shall return later.<br />\n(2) With the text book and the recitation system as great a variety of results is secured<br />\nas with the lecture system, depending again upon the instructor. On the whole it is better<br />\nthan the lecture system. For a mere reading of a book with the reflections that a student<br />\nnotes,<br />\nmight make thereon as he reads along is analogous in every respect to the reading of<br />\nof<br />\narrangement<br />\nbetter<br />\na<br />\nand<br />\nstatement<br />\nbetter<br />\na<br />\nis<br />\nthere<br />\nthat<br />\nwith these advantages added,<br />\nthought in the text than in the students notes. This method furthermore has the advantage of the recitation, of whatever sort it may be.<br />\n<br />\n\f'I'Hl<br />\n<br />\nN liNt'S—LETTER.<br />\n<br />\nhere the personality of the instructor is more strongly felt than in a lecture, and the<br />\nstudent has the benefit of exchange of thought upon the text with his fellows. This method<br />\nis open to two objections at least. (1) It is not practicable with the organization of most<br />\ncolleges as at present constituted. (2) It is narrowing in its effect if it confines attention to<br />\none text.<br />\nThe ideal as I view it, is the combination of the text book and lecture system. There<br />\nis value in the lecture, and it must be recognized; likewise there is value in the use of a<br />\ntext. If I were asked to submit a plan after which college instruction might be best<br />\nmodeled, it wottld be the following:<br />\n(I) Lectures for the purposes of inspiration, direction, amplification, of the nature of<br />\nnew matter not contained in texts, or a comparison of the views of different authors with<br />\nthe lecturer's own individual interpretation, thereby giving a clearer differentiation, or for<br />\nthe purpose of summarizing.<br />\nThese lectures should be given by the man most fitted in personality, knowledge, and<br />\nexperience, and at those times that would best aid the student according to the principles<br />\nindicated above.<br />\n(2) A text that would give the outline of the course in such a way as to guide the<br />\nthought of the student. This is not a necessity if the following factors supply the same<br />\nneed.<br />\n(3) A well stocked library. Not one or two copies of every book referred to during<br />\nthe courie, though this is good, but in preference many copies of a few books which are<br />\nwritten upon lines similar to that followed by the course. This would be comparable to a<br />\nPhysical or chemical laboratory where each student has his desk.<br />\n(4) Assistants to the lecturer of the right personality and in sufficient number, so that<br />\nevery student may, come in close and frequent contact with one assistant at least. The<br />\nduties of the assistants would be:(1) to direct study,(2) to consult upon difficult points met<br />\nby pupils in study or to help him in it in every way,(3) to conduct frequent discussions<br />\nupon the reading and lectures at stated periods with the students in his charge. They<br />\nwould then carry the burden of the work. In a small college the lecturer might act in this<br />\ncapacity as well. But if the burden be too great for one man, and additional assistants be<br />\nneeded, he ought to take part of this work, alternating at intervals with the assistants,<br />\nthat he may come in contact with all the students.<br />\nWith this plan I believe those principles could be fully achieved, and although it involves a change of administration of college courses, which have good arguments in their<br />\nfavor as at present constituted, yet I believe the colleges are more and more coming to<br />\nsome such plan as this, and that this movement will be hastened when more care is taken<br />\nto ascertain the real needs of their students.<br />\n<br />\nRLAN UPDEGRAFF.<br />\nThe Girls' Latin School, Baltimore.<br />\n<br />\nALUMNI NOTES.<br />\n993<br />\n<br />\nMr. Geo. Stewart Brown, now a member of the first branch of city<br />\ncouncil, is a candidate for the second branch at the coming spring elections.<br />\nThomas C. Pinkerton an.1 Wm. Sneeringer, of Boston Tech, have been<br />\ngreeting friends about the University this week.<br />\nMr. Arthur W. Machen, Jr., has a carefully prepared article<br />\nin the January number of the Maryland Law Review, calling attention to the<br />\nnecessity of a thorough revision of the corporation law of Maryland.<br />\n<br />\n'96<br />\n<br />\n\fTH8 N HWS—LETTER.<br />\nTHE CECIL RHODES' SCHOLARSHIPS.<br />\nRESIDENT REMSEN went to Philadelphia last week to meet several<br />\neducators of New Jersey and Pennsylvania in conference with a repre<br />\nsentative of the Cecil . Rhodes Trustees for the arrangement of details for<br />\nthe award of the scholarships to Oxford University, provided by the will of the<br />\ngreat South African promoter. The conference was held in the office of Provost<br />\nHarrison, President Wilson, of Princeton, being another of those in attendance.<br />\nPreliminary plans in the same manner had already been made by several New<br />\nEngland States. The Philadelphia meeting passed a resolution, of which the<br />\nmost interesting clause for us is this:<br />\n\"In Maryland th.- nomination of Rhodes scholars for the State shall be<br />\nintrusted to a committee of from three to five members chosen from the college<br />\nfaculties of the State by the president of Johns Hopkins University, of which<br />\ncommittee he shall be chairman.<br />\n\"The selection of candidates shall be limited: To persons not less than 19<br />\nor more than 23 years of age: to persons who for at least two years shall have<br />\nbeen regularly enrolled students of an American college.\"<br />\nThe New Jersey and Pennsylvania committees will be determined in a<br />\nsimilar way by President Wilson and Provost Harrison.<br />\nTwo scholars will be named in each State, each scholarship continuing<br />\nthree years with an income each year of $300.<br />\nThe precise method by which the Maryland scholars will be selected, next<br />\nto the names of the men themselves, is of course the most pertinent subject for<br />\nPresent speculation. President Remsen does not yet know himself, nor had he<br />\neven named the rest of the committee when this went to press.<br />\n''A great deal of thought will be required,\" said Dr. Remsen, early this<br />\nweek, \"to determine just the right methods of selection. 'What academic qualifications will make a man eligible' is probably the first question that those most<br />\ninterested will ask us. It shall be understood, therefore, at the outset that we<br />\nmust be reasonably assured that whomsoever we recommend shall be able to<br />\nmeet the regular requirements for entrance to Oxford University. 'Responsions'<br />\nis the term by which these examinations are known. The responsions may be<br />\nregarded in a general sense as the Oxford man's matriculation examination, to<br />\nuse the term current here. They differ, however, in content from our entrance<br />\nexaminations, demanding from the candidate more of some things and not so<br />\nmuch of others. Latin, Greek, and mathematics are the most important elements of the responsions. The requirements in Greek, in particular, will probably seem unusually severe to most American students. And this requirement<br />\ncannot be waived by the substitution of something else, as is often in American<br />\nschools. What formal test will be applied by the committee itself I am not yet<br />\nable to say.\"<br />\n\"Then, you know, Mr. Rhodes' will expresses certain preferences concerning the general character of the men who are to fill his scholarships. These<br />\nmust also be observed. It will be with us to recommend young men, vigorous<br />\nand devoted to outdoor life, men best fitted by good fellowship to enter with the<br />\nbest spirit into their intercourse with other men.\"<br />\n•<br />\n<br />\n(p<br />\n<br />\n\fHli NEws-LETTEA,R.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nFEBRUARY 5, 1903.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\n<br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n...............<br />\n<br />\nAthletic Editing,<br />\n<br />\nW. S. BIRD. 1908.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\n<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nHARRY. BAETJER, 1903.<br />\n. Itrocim BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hop.<br />\nking University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\n.I. H. U.; or box $98, Medical School of Johns Hopkins Hospital.<br />\n1.1.111•110<br />\n,<br />\n<br />\n1<br />\n1 , MOVEMENT is on foot in the Senior Class to institute some form of the<br />\nHonor System in the undergraduate department. There are differences<br />\namong the men as to the method to be pursued in attaining the desired<br />\nend , This is but natural; the system requires careful consideration, and there<br />\nis much which the men regard in different lights, since the point of view cannot<br />\nbe in all cases the same. These differences are differences of method, and not<br />\nof result. The class is a unit in the belief that the Honor System will be of<br />\nbenefit to the University. No one is antagonistic to the introduction of the<br />\nHonor System, but there does exist a division of opinion as to the best way of<br />\nsecuring the desired result.<br />\nAs soon as the Senior Class has formulated a system which they believe<br />\nwill be best for the University a delegation will visit the two other classes and<br />\nurge its adoption. After the matter has had the approbation of the Senior<br />\nClass there can be no doubt of its adoption by the Junior and Freshman classes.<br />\nThe only word of criticism which has been heard is to the effect that the<br />\nmen who are prominent in the present agitation have unduly magnified the<br />\noffenses upon which they base their plea for the need of an Honor System. Such<br />\nis not the case. The men who have taken a lively interest in behalf of this<br />\nmeasure have not made a single statement of existing conditions which any ob-<br />\n<br />\n\f*nig NEWS-LErrgR.<br />\n<br />\n7<br />\n<br />\nserving man can challenge. The president of the Senior Class was the originaLor of the movement, and he is willing to bear any hostile criticism. Seeing<br />\nthat the trend of public opinion was in favor of self-government by the student<br />\nbody he decided to hold a class meeting in order to discuss the question. The<br />\nmeeting was held, and the matter discussed. It was seen that the question was<br />\none of the gravest importance, and after some discussion the meeting adjourned<br />\nto meet a week later. This was as it should be, for there is no need of haste<br />\nand the longer the time spent in deliberation the better will be the system which<br />\nwill be adopted.<br />\nA letter which has been received from J. S. Grasty, '02, throws some light<br />\non the system as in use at a southern,University He says: •'There can be no<br />\ndoubt that the \"Honor System\" is the most efficient means yet devised to inculcate a deep sense of honor upon college men. It is in vogue at the Washington and Lee, as it is in all the colleges and universities of the South. At<br />\nthe Washington and Lee, where I am now a student, I have had ample opportunity to observe the workings of the \"Honor System,\" and I must say that I<br />\nheartily approve of it. Every man here is assumed to be a man of honor and is<br />\ntreated as such. In the performance of duty he is wholly free from espionage<br />\nand his word is accepted without question. This system is traditional here,<br />\nand any abuse is quickly and rightfully resented by the student body.\"<br />\nNo one can but believe that a solution will be found for this vexing<br />\nproblem. The greatest difficulty lies in the method to be pursued in attaining<br />\nthe desired end.<br />\nHE inter class games have been a source of great profit to the contestants.<br />\nEach has learned what his relative standing is, and what he must do in<br />\norder to win in the future. Aside from the interest aroused by class<br />\nrivalry there was a great desire to know what the men could do, especially the<br />\nnew men. From this meet Captain Hoffman is now better able to judge of the<br />\ncapabilities of the different men.<br />\nOne thing which was noticable was the lack of headwork displayed by the<br />\ndistance runners. Nelson's capture of the mile and Tootle's capture of the half<br />\nshould never have been permitted. Neither of these men is a distance runner,<br />\nand the fact that each crossed the tape first in his race shows that there was a<br />\nlamentable lack of thought on the part of the other contestants, most of whom<br />\nwere far speedier at such d'stances. The loss of the mile was a bitter disappointment to Porter, and one which he should take to heart. After last year's<br />\nexperience at Electric Park against Randell one would think that he would<br />\nnever again content himself with such an easy going pace as was set in the mile<br />\nrun. Had he displayed the least bit of judgement he would have known that<br />\nNelson could beat him on the sprint, and he should have managed his race accordingly. This is a lesson he must learn, or else find himself defeated time and<br />\ntime again by inferior men. The same lack of judgement was displayed in the<br />\nhalf. After a slow pace for six laps it was camparatively easy for Tootle to<br />\nsprint for two hundred yards and win the race.<br />\n<br />\nt<br />\n<br />\n\fIHE NEWS-LETTEk.<br />\nLeCron did remarkably well for the Junior Class, but he suffered by being<br />\nentered in too many events. Stone, of the Freshman Class, is a man of great<br />\npromise. He is always in condition, and can he depended upon to make a good<br />\nshowing in any contest he enters. Jackson, of the same class, showed up well<br />\nin the relay, and is developing into a steady, fast runner.<br />\nIn the relay race interest centered in the struggle for second place. No<br />\ndoubt the victory of the Freshman team came as a surprise to many, yet they<br />\nhad trained consistently and were in prime condition. It can hardly be expected<br />\nthat the Juniors are content with the result, and we may expect to hear that<br />\nthey have challanged the Freshmen for another race.<br />\nThe superiority of the Senior Class was so great that the two other classes<br />\nwere overshadowed. It would he an excellent idea for the Juniors and Freshmen to hold a dual meet with practically the same events. The difference in<br />\npoints was not great, showing that the two classes were nearly evenly matched.<br />\nShould a dual meet he held he would be a wise prophet who could pick the<br />\nwinner.<br />\nHE, Hullabaloo Club, an organization of the Senior Class for the promotion<br />\nof sociability and good fellowship, seems to be languishing. It is true<br />\nthat a feeling of sociability and good fellowship prevails in the class, but<br />\neven the most sanguine supporters of the club cannot claim that it has been<br />\nfostered by the class club. The cause of this state of affairs is not far to seek:<br />\nthere is very little time that the men can spend at the club rooms, the quarters<br />\nof the club are not furnished as attractively as they might be, and the board of<br />\ngovernors are not giving the club the attention it requires. The men who compose this board started the club, and then got the Senior Class to adopt their<br />\nideas and to continue them in the offices they had selected, They must now<br />\nmake good their promises. It would seem that the hoard of governors is responsible in a large degree for the present situation, and to them the class<br />\nlooks for a betterment of the club's condition. The club ought not to be given<br />\nup, and it will not be given up, but something must be done, and that quickly.<br />\nThe original intention of the founders of the club was to make it in time an<br />\nundergraduate affair. No better time than the present could be found for car<br />\ntying out this project. The kindly feeling which exists between the classes,<br />\ndue in no small degree to the friendly rivalry of the class games, makes this a<br />\npropitious moment for taking this step, which will be of benefit to all. The<br />\nNEWS-LETTER does not wish to appear to dictate to the club, and only in its<br />\ndesire for the welfare of the undergraduate body it has made the forgoing suggestion.<br />\nNo matter what action is taken upon this suggestion the fact remains that<br />\nit is up to the board of governors to do something.<br />\n<br />\nt<br />\n<br />\nHelen of Troy.<br />\n\"How can you dress so expensively when the City is under siege on your<br />\naccount?\" demanded the Daughter of Priam.<br />\n\"Because I get all my gowns from Paris,\" coldly replied the Cause of the<br />\nTrouble.— Yale Record.<br />\n<br />\n\fTHE N EW S-LETTER.<br />\n<br />\nI<br />\n<br />\nI III ON I<br />\n<br />\nI II<br />\n<br />\nI IIIIUt<br />\n<br />\nI I Oil I Iii I it I<br />\n<br />\n9<br />\n<br />\n111<br />\n<br />\nI H01101511<br />\n<br />\n117 IN<br />\n:<br />\n40<br />\n<br />\nmem<br />\nm<br />\n:c••<br />\n<br />\n4<br />\n<br />\naiftd.1<br />\naa mar<br />\n<br />\nat<br />\n<br />\n;<br />\n<br />\n1<br />\n<br />\n.47,..::Tz75171;<br />\n,MIIIMMIIIIIIIIIIIIMIIIII11111111111111M11111111111111111111MMIIIMIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIII,1111111111111111111111111111111111111111111111611111111111111111141MillatiAliia<br />\n,•,•<br />\n<br />\nT the Yale Alumni banquet held at the Carrollton Hotel on January 23,<br />\nDr. Herbert E. Greene responded to the toast, \"Harvard.\" Extempore<br />\nspeeches were made by President Ira Remsen and Drs. B. C. Steiner and<br />\nW. H. Welsh.<br />\n\"Trusts and Their Development\" was the subject of a lecture delivered by<br />\nDr. George E Barnett before the Typographical Union of Baltimore on February 1.<br />\nDr. Guy Carleton Lee is one of the committee on arrangements for the<br />\nDickenson Alumni banquet, which will be held at the Rennert Hotel to-morrow<br />\nnight<br />\nAt the winter exhibit of the Charcoal Club there are several excellent marine<br />\nand landscape scenes from the brush of Mr S. B Whiteman.<br />\nProfessor Angelo Heilprin, of Philadelphia, delivered an illustrated lecture<br />\non \"Scientific Aspects of the Mount Pelee Eruption\" at the Johns Hopkins<br />\nClub on January 24. Professor Heilprin, who was one of the first scientists to<br />\nreach Martinique after the outbreak, gave a most graphic account of the terrible eruption<br />\nPresident-Emeritus Gilman and Dr. Albert Shaw are members of the General Education Board, recently chartered by Congress for the promotion of Educational work in the United States, which was organized in Washington on<br />\nJanuary 29.<br />\n<br />\n•<br />\n<br />\nMr. Edgeworth Smith, who has been confined to his room threatened with<br />\ntyphoid fever, is reported considerably improved.<br />\nDr. E. C. Armstrong is president, and Dr. Geo. C. Barnett is secretary of<br />\nthe Randolf-Macon Alumni Association of Baltimore, which will hold its annual<br />\nbanquet at the Rennert Hotel on February 6.<br />\nDr. Kirby Flower Smith delivered a lecture on \"The Medical Legend of<br />\nVirgil\" in the Donovan Room on the evening of January 30. ------<br />\n<br />\n0<br />\n<br />\nDINWIT—Say, our backbones are like serial stories, are n't they?<br />\nTHINWIT—Prove it.<br />\nDINWIT—Continued in our necks.—Lampoon.<br />\n<br />\n\fTHE NEWS-I,ETTUR<br />\n<br />\n1.0<br />\n<br />\nUNDERGRADUATE NOTES<br />\n'HE concert given by the Musical Clubs at Forest Glen was a thoroughly<br />\nsuccessful affair in respect not only to the performance of the three clubs<br />\nbut also to the enjoyment of the individual players. The quartet composed of Hall, Coffin, Gilman, and Ford was especially well received. The<br />\nconcert was followed by a dance and reception.<br />\nThe clubs are now busily rehearsing for the Baltimore concert, which will<br />\ntake place at Lehman's Hall on Friday, February 27. This concert is the most<br />\nimportant one of the year, and the management is determined that it shall be a<br />\nsuccess.<br />\n<br />\nC<br />\n<br />\nFebruary 23 has finally been selected as the date of the Senior banquet.<br />\nIt was found impossible to complete arrangements in time to hold the banquet<br />\non last Friday night, as originally intended.<br />\nA committee consisting of Custis, Plaggemeyer, Strayer, and Tootle has<br />\nbeen appointed by the Senior Class, looking towards the adoption of the<br />\n\"Honor System\" at the University. Nothing definite has as yet been decided<br />\nupon, but the committee is carefully considering the plan and expects to have<br />\nthe proposition ready in a short time, so that action may be taken on it.<br />\nThe St. James Hotel and February 20 have been decided upon as the place<br />\nand time of holding the Junior Class Banquet. The committee expects to appoint the speakers and the toasts to which they will respond, in a few days.<br />\nThat all who attend will have a glorious time goes without saying.<br />\nThe crowds that assemble in the gallery of the cage every evening to watch<br />\nthe track and lacrosse candidates is a sign of the lively interest that is being<br />\ntaken in these sports by the students.<br />\nLast Monday night the Junior Class held a \"smoker and feed\" in the<br />\ntrophy room. It was arranged by several enthusiastic members of the class,<br />\nwho wished to arouse interest in University and class affairs. That their efforts<br />\nwere crowned with success was evident to all who happened to be around 'he<br />\nGym on Monday night. It is the intention of the class to hold a number of informal gatherings during the coming months.<br />\n<br />\nWHO IS HE?<br />\n(Extract from<br />\n<br />\nho National Park Seminary \"Merrarti.\")<br />\n<br />\nIf the young gentleman who sang on the Johns Hopkins Glee Club and<br />\nwho was so forgetful as to leave his trousers at the seminary, will call between<br />\none and two on Saturday, they will be returned to him.<br />\n(If the aforesaid young gentleman will divulge his name he will he awarded<br />\na leather medal by the NEws LRTTER. If another young gentleman, who, by<br />\nthe way, plays with the 'Varsity football team, will divulge by what means a<br />\ncharming damsel kept him cornered for three hours, we shall gladly award<br />\nanother medal.---ED.)<br />\n<br />\n\fTHE NEWS—LErrMt.<br />\n<br />\n11<br />\n<br />\nGAMES SC H EDU LF.D TO DAT E.<br />\nFebruary 14th—Baltimore Athletic Club, Fifth Regiment Armory.<br />\nFebruary 21st or 28th—Johns Hopkins University, Open Handicap Games.<br />\nMarch 7th—Georgetown University, Washington, D. C.<br />\nApril 2rith—University of Pennsylvania, Relay Races.<br />\n<br />\nINTERCLASS ATHLETIC CONTESTS.<br />\nHE first annual interclass athletic meet came off in the \"cage\" last Thursday night. The cage had been elaborately decorated with the championship banners which Hopkins has won, and together with the flags of the<br />\nClasses of 1903 and 1904, the walls and rafters were decked in true gala attire.<br />\nThese banners are the proofs of the athletic excellence to which Hopkins has<br />\nattained, while the \"vim\" and \"vigor\" manifested by the contestants in the<br />\nvarious contests showed that this excellence is still to remain above par.<br />\nDuring the course of the evening several genuine surprises were encountered, first among them being the result of the mile run. Porter was picked<br />\nfor a sure winner, and Nelson's fast pace and the good form in which he ran<br />\nwere totally unexpected. While Nelson's work on the track has always been<br />\nvery creditable, still he has never been numbered among the fastest long-distance -runners. He shows unusual promise. Captain Hoffman will no doubt<br />\nbe able to use him to advantage for the Varsity.<br />\nThe second surprise came in the relay race. The Seniors won out by a<br />\nbroad margin, as was expected, but the defeat of the Juniors by the Freshmen<br />\ncreated a little surprise. The Freshmen ran in good form, Stone's pace against<br />\nLeCron being particularly commendable.<br />\nSurprise No. 3 came in the half mile run, when Harry Tootle carried off<br />\nfirst honors. Heretofore, Tootle has been counted on to figure conspicuously<br />\nin the dashes, but he has never posed as a long distance man, and his exhibition proves him to be a valuable runner in either long or short distance.<br />\nThe thirty yard dash came off in first class style, and both Pessagno and<br />\nBlanck did pretty work in the running high jump.<br />\nA large crowd attended, and we may expect Manager Dulaney to report a<br />\nfinancial success.<br />\nThe summary is as follows:<br />\nThirty Yard Dash—First heat—(two to qualify) Walker, first; Hudgins,<br />\nsecond. Second heat—Pessagno, first; Williams, second. Third heat—Stone,<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n12<br />\n<br />\nfirst; Smith, second. Fourth heat—Tootle, first; Blanck, second. Fifth heat<br />\n—Branham, first; Bogue, second.<br />\nSemi-finals (three to qualify)—First heat—Pessagno, first; Williams,<br />\nsecond; Stone, Walker. third. Second heat—Tootle, first; Blanck, second;<br />\nSmith, third.<br />\nFinals—Tootle, first; Pessagno, second; Blanck, third; Stone, fourth.<br />\nRunning High Jump—Pessagno, first; Blanck, second Smith, Hawkins,<br />\nthird.<br />\nRelay Teams—Seniors entered Pessagno, Hoffman, Tootle, Nelson. Juniors<br />\nentered Strohbar, Branham, Porter, LeCron. Freshmen entered Hudgins, Morse,<br />\nJackson, Stone.<br />\nThe Seniors won the relay by about one-half lap; the Freshmen came second and the Juniors third.<br />\nPutting Shot (12 pound)—Blanck, first; Yearley, second; Stone, third;<br />\nPearre, fourth.<br />\nOne Mile Run—Nelson, first; Porter, second; LeCron, third; Morse,<br />\nfourth.<br />\nStanding Broad Jump—Blanck, first; Tootle, second. Williams, third,<br />\nPessagno, fourth.<br />\nHalf Mile Run—Tootle, first; LeCron, second; Stone, third; Strohbar,<br />\nfourth.<br />\nThe officials were as follows : Referee, L. C. Taylor; clerk of course, W.<br />\nM. Mackdermott; marshall, W. S. Bird; announcer, Plaggemeyer; scorer, C.<br />\nRiley; track judges. W. E. Hoffman, Jr., A. B. Atkinson, and G. L. Freese;<br />\nfield judges, George B. Schall, Harvey B. Stone; starter, W. M. Mackdermott.<br />\nFrom the above summary it may be easily seen that the Seniors swept the<br />\ndeck, taking first place in all seven events and gaining a total of 534 points.<br />\nThe Juniors and Freshmen together made about 20 points.<br />\nThe following table explains the work of the individual contestants.<br />\nName<br />\n<br />\n1<br />\n2<br />\n3<br />\n4<br />\n<br />\n7<br />\n9<br />\n10<br />\n12<br />\n<br />\n:10 yd. Dash High Jump Broad.Jump Shot Put Milo Hun SRO pi. Run Total<br />\n<br />\nBlanck, 03,<br />\n2<br />\n3<br />\n5<br />\n5<br />\nTootle, '03;<br />\n5<br />\n3<br />\n5<br />\nPessagno, 03,<br />\n3<br />\n5<br />\n1<br />\nNelson, '03,<br />\n5<br />\nLeCron,'04,<br />\n2<br />\n3<br />\nStone, '05,<br />\n1<br />\n2<br />\n2<br />\nYearley, 03,<br />\n3<br />\nPorter, '04,<br />\n3<br />\nWilliams, '03,<br />\n2<br />\nSmith, 03,<br />\n1<br />\nHawkins, 04,<br />\n1<br />\nStrohbar, '04,<br />\n1<br />\nPearre, '04,<br />\n1<br />\nMorse, '05,<br />\n1<br />\nSenior Relay Team, 5 points.<br />\nFreshmen Relay Team, 3 points.<br />\nSeniors, 534 points; Juniors, 11% points; Freshmen, 9 points.<br />\n<br />\n15<br />\n13<br />\n9<br />\n5<br />\n5<br />\n5<br />\n3<br />\n3<br />\n2<br />\n134<br />\n1<br />\n1<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nLACROSSE NEWS.<br />\n<br />\nt<br />\n<br />\nHERE is little change in the lacrosse situation since the previous issue of<br />\nthe NEWS LETTER. A game is now practically assured with Hobart<br />\nCollege for April 11th though the Hobart manager is having some trouble in arranging a southern trip. The question of a game with the English<br />\nteam is causing some annoyance. Harvard, to whom the English management<br />\nhas entrusted the arranging of their schedule, wishes to postpone the Hopkins<br />\ngame till June 25th. Of course. it will be impossible to hold our team together<br />\nas late as that; and unless Harvard can arrange to have the English team meet<br />\nus June 20th, the Britishers will miss the greatest opportunity of their American trip. This date may seem late, but the Englishmen will not reach America,<br />\naccording to present arrangements, until June 16th. If June 20th can be arranged, Hopkins may play Harvard here June 13th.<br />\nIt now seems improbable that the team will get any trip except that to<br />\nSwarthmore. C. C., N. Y., was the only team that was willing to play Hopkins out of Baltimore, and unfortunately dates could not be arranged. The<br />\nLeague games fall here this year in accordance with the League's arrangements.<br />\n<br />\nAMONG THE COLLEGES.<br />\nN the future all Yale students who are unable to swim will be required to<br />\ntake instruction in this branch of sports.<br />\n<br />\n3<br />\n<br />\nRockfeller's Christmas gift to Chicago University was $1,000,000.<br />\n11Columbia University is planning a course in automobile engineering which<br />\nwill begin next April with an enrollment of thirty students.<br />\n<br />\n.1._<br />\n<br />\nIt is estimated that American students issue three hundred periodicals.<br />\nHarvard has the largest college library in the United States, having 700,000<br />\nvolumes, Yale has 200,000, Columbia 133,000, Cornell 126,000.<br />\nFifty-five United States Senators and 400 Representatives are college graduates. Our present Congress contains graduates from 113 colleges.<br />\nThe University of Utah has a very ambitious dramatic club. The club<br />\nrecently gave a performance of A. W. Pinero's play, \"The Amazons.\"<br />\nA Department of Chinese will soon be established at Columbia, several<br />\ngifts having been received lately for that purpose.<br />\nIn relation to the proposed two-year college course President Wilson, of<br />\nPrinceton, is said to have remarked, \"I cannot imagine how anybody who ever<br />\nsaw a Sophomore could ever think of graduating one in that condition.\"<br />\nYale has taken up water-polo again this year.<br />\nA performance of \"Everyman\" was given in the College Chapel at Vassar<br />\nby the Elizabethan Stage Society of London.<br />\n<br />\n\fTHI<br />\n<br />\n14<br />\n<br />\nNEWS-LETTER.<br />\n<br />\nThe proposition of increasing the number of yards to be gained in four<br />\ndowns from five yards to ten is being agitated among western colleges. The<br />\nobject of the ruling is to increase open work and decrease mass plays.<br />\nThe class of temporary politics at Princeton has been organized into a<br />\nchamber of deputies, modeled exactly after the French chamber. The Seniors<br />\nconstitute the conservative and the Juniors the radical element. The ministry<br />\nhas been chosen from the conservatives.<br />\n<br />\nVALUABLE ADDITION TO THE STROUSE SEMETIC LIBRARY.<br />\nHROUGH the generosity of Mr. Leopold Strouse the Strouse Semetic<br />\nLibrary has been enriched by a collection of books that will give to this<br />\ndepartment of the University the most valuable library of the kind in<br />\nthe country. The Strouse Semetic Library was founded about six years ago by<br />\nMr. Strouse, who has been making additions to it from time to time. The<br />\npresent donatiOn is, however, the most generous ever made, and its benefits to<br />\nthe department, and to the University in general cannot be overestimated. Mr.<br />\nStrouse recently learned that the library of Mr. S Schwartzberger, a prominent<br />\nHebrew scholar of New York, was on sale, and he commissioned Dr. Rosenau,<br />\nFellow by courtesy in Semetic languages, to go to New York and examine the<br />\nlibrary with a view of purchasing the most valuable volumes. Dr. Rosenau<br />\nfound that the library contained many rare and valuable works, which he<br />\npromptly secured. The new books, which number about 1500 volumes, many<br />\nof them out of print, embrace all phases of Hebrew literature, including philosophy, poetry, history, biography, legal enactments, and natural sciences. The<br />\ncollection arrived at the University several days ago, and is now being catalogued. Public formal announcement of the gift will be made on Commemoration Day.<br />\n<br />\nZ;<br />\n<br />\nOILY OZZY'S ORIGINAL ODDITIES.<br />\nIII. ANASTASIA'S ANTICS.<br />\nAnastasia ate arsenic<br />\nTo see if %would really make her sick.<br />\nPapa looked up from where he sat,<br />\nAnd remarked, \"I thought she'd more sense than that.\"<br />\nIV<br />\n<br />\nBREEZEY BEATRICE.<br />\n<br />\nBeatrice burned out her sister's eyes<br />\nAnd mamma, evincing her great surprise,<br />\nSaid, \"I s'pose now it's no use to dwell upon it,<br />\nBut really I wish you hadn't done it.\"<br />\n<br />\n\fTHE NEWS-LETTER,<br />\n<br />\n15<br />\n<br />\nA DESSERTATION ON SONNETS.<br />\nHE Poet tried to slip past the barber shop, but it was no use. He paused<br />\nto read the sign in large letters which read, \"No Smoking—By Ladies.\"<br />\nThe pause was fatal. The Objector dragged him in, and stood him up<br />\nhefore the group of amateur sonnet writers.<br />\n\"You are an imposter, sir!\" said the Captain of the Supes. \"It is not<br />\nhard to write a sonnet; even I, myself, have done it.\" Overlooking the concealed rhyme the Poet made answer.<br />\n\"You write a sonnet! You couldn't write an obituary notice of the class<br />\ngames.\"<br />\n\"But I did, I was inspired.\"<br />\nThe Bugologist whispered to Mister Dinklebender that he knew to a pint<br />\nhow much was needed to inspire the Captain of the Supes.<br />\n\"Did you use the same words I used ?\"<br />\ndid, and I have written a sonnet about the sea. Please don't get sea.<br />\nWith this parting remark the Captain of the Supes recited a sonnet<br />\nentitled:<br />\nWILLIE<br />\n<br />\nAND HIS YACHT.<br />\n<br />\nThere is a charm in sailing which doth steal<br />\nOn summer days into the sailor's heart.<br />\nThere in his cosy yacht he feels apart<br />\nFrom the more vulgar herd. He can unseal<br />\nHis champagne basket for his friends and feel<br />\nAs each cork pops that they've made such a start<br />\nThat every man will likely need a chart<br />\nWhen he gets home, the key-hole to reveal.<br />\nboor by a long experience cloth he learn<br />\nAssistance he requires when it's half past<br />\nThe hour of three, the cop will be his guide<br />\nAs homeward he's attempting to return.<br />\nWhen on the hat-rack all his clothes he's cast<br />\nBy Bromo-Seltzer is he purified.<br />\n<br />\n\"There is certainly a personal flavor over it all,\" was the comment of<br />\nthe Fusser, \"almost as much as in my own, which—ahem!—is not at all bad.\"<br />\n\"I wish that policeman had the beat up our way,\" mused the Objector as<br />\nhe cast a reminiscent wink in the direction of the Poet.<br />\nThe Bugologist could be restrained no longer. From his breast pocket he<br />\ndrew a soiled piece of yellow paper upon which appeared the picture of a man<br />\n(labeled canvasser for funds for team) sitting upon a youth (labeled freshman).<br />\nThe modesty which he acceded to the solicitations of the Angry Mob showed<br />\nplainly that he was not used to the role he was playing, but he bluffed the part<br />\nwith a certain air of cunning assurance.<br />\n\"I have here a sonnet,\" he said, \"prepared according to the rules of the<br />\ncontest, which deals not only with the athletic situation, but is a picture of<br />\nwhat is bound to happen before the debating teams goes to North Carolina. It<br />\nis entitled:<br />\n<br />\n\f16<br />\n<br />\nTHI NEWS-14F,TTER.<br />\n\"THE MAN WE xNow.\"<br />\nThere is a man who doth delight to steal,<br />\nA smile upon his face, guile in his heart,<br />\nInto our pockets and abstract a part<br />\nOf our too-hard earned cash He doth unseal<br />\nOur pocketbooks, and in them he doth feel<br />\nFor our spare change, although we stare and start<br />\nAnd ask him if he's sl eering by a chart;<br />\nNot till we're fleeced doth he the plot reveal.<br />\n<br />\nHe is a college canvasser we learn,<br />\nA dread subscription fiend with blackest past;<br />\nFor college men he claims to be a guide.<br />\nHe prongs our dough, and there is no return;<br />\nlilt') a pool for athletes it is cast<br />\nAnd thus are our athletics purified.<br />\n<br />\nThe effusion was greeted with three groans by the Angry Mob. The Bugologist was not disconcerted in the least. He carefully put away his manu—<br />\nscript, and remarked that his sonnet ought to take the blue ribbon, the gold<br />\nmedal, and a few other et ceteras<br />\nThe Fusser could restrain himself no longer. \"I've done it,\" he shouted.<br />\n\"Done what ?\" the Chief Supe was polite enough to ask when he saw that<br />\nno one else happened to be listening.<br />\n\"Written a sonnet. The moon was full, I was—well, the inspiration<br />\nseized me. It is entitled<br />\n\"TO AM A RYFLIS.\"<br />\n<br />\nWhen brightly beams the moon I love to steal<br />\nBeneath thy window, sweet, and there my heart<br />\nIn ecstacy doth beat.— — —<br />\n<br />\nThe Fusser looked around, saw that he was alone, and departed sorrowing.<br />\nAn hour later Walter was seen to emerge from the coal cellar. The Angry<br />\nMob spent the afternoon recuperating 'neath the shade of the sheltering palms.<br />\n<br />\nHow He Won Her.<br />\nIce cream he bought his darling,<br />\nAnd she ate, and ate, and ate;<br />\nTill at last her heart she gave him,<br />\nTo make room for one more plate.<br />\n—Lampoon.<br />\n<br />\nI.<br />\nHer cheeks are round with the softening slope<br />\nOf a delicate flower's most graceful curve;<br />\nHer delicious chin (it is dimpled in!)<br />\nIs as rounding as beauties deserve.<br />\nHer glorious form is a Mellow delight<br />\nOf ellipses, parabolas wondrously fair;<br />\nI ask as I gam at her circulars ways,<br />\nWill the well-rounded treat me square?<br />\n—The Occident.<br />\n<br />\n\fOPEN ALL NIGHT<br />\n<br />\nWILLIAXSON 0 WATTS,<br />\n.,3D rug Ztorcs,„<br />\nBaltimore and Eutaw Streets.<br />\n<br />\nHocward and Ftlanklin Streets.<br />\n<br />\n\"(Eater.<br />\n.VrtIcw, Saucy, (Boobs. perfunierp, Collet ?Article, Ctoare, Sam<br />\n<br />\n(<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN HAI:11,110HE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber floods, Olass Ware,<br />\nStudents Sundries<br />\n<br />\nH. S. WRIGHT &-<br />\n<br />\nI'. 'Phone 3350- .4,111<br />\n<br />\nHENRY N. BRUNS,<br />\n111-it \\vino ,,A,tt.crj,tis,<br />\n.'\\.I heill.t it di<br />\n<br />\n1,(1<br />\n<br />\nN.<br />\n<br />\n)<br />\n<br />\n'H., (J./<br />\n<br />\n,A!itn I for<br />\n<br />\nHenderson's<br />\n<br />\n-Your inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\n<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\nIn<br />\n<br />\n. I 1,`\\<<br />\n<br />\n1.exinuton wel 1.ibc1.1%<br />\n<br />\n704 MADISON AVE.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nMadison<br />\nStudents' Supplies,<br />\n<br />\neg Howard Sts.<br />\n<br />\nvorporaled I $i s<br />\n<br />\n\"ti's StfonA<br />\n<br />\nas the Steonskest.\"<br />\n<br />\nTiftE FIDELITY MUTUIIL LIFE INSUIVINGE<br />\n<br />\nOF PI-PILA.DEL.P111/1..<br />\nInsurance for TILE<br />\nAN EX()ELLEN T OPPORTUNITY is offered Students and Teachers to write<br />\nFIDELATY, either during vacation or permanently.<br />\nFor Agency in Mxryland or West Virginia,<br />\n<br />\n-<br />\n<br />\nAddress,<br />\n4:KA11.4.11, Man8ger<br />\n8068 Merchants Bank Bldg., lialtlumre.<br />\n•<br />\n<br />\nFor Ad \\•ertising Sp... iii Otis Paper<br />\n.11)111.1\"Ill<br />\n<br />\n\"(0<br />\n<br />\n//r)<br />\n<br />\n.:L.›orrri-m(<br />\ns<br />\nLom BARD tIr.<br />\n<br />\nzw.e,<br />\n, Afteort<br />\nNO,<br />\n<br />\nT.,<br />\n<br />\n11AE:<br />\n<br />\nPUBLISHERS.<br />\n<br />\nMt)<br />\n<br />\n\f,<br />\nT-<br />\n<br />\nCog $300,000. SOUS and Undiwidul P10111 $400 000<br />\n<br />\nSTIEFF PIANOS<br />\n<br />\nDrovers & Mechanics Nat'l Bank,<br />\n<br />\nMONEY<br />\nMADE Or THE BENI' MATERIA1.M<br />\n<br />\nOF BALTIMORE.<br />\nAND 14:XPEIRIENUE CAN<br />\nWALICIOLMOMNI<br />\n<br />\nliUY.<br />\n<br />\nI)<br />\n<br />\nN. LI BERTY ST.<br />\n<br />\nrs<br />\nGUSHING &GOMPRNY,8Botaotkiselle<br />\noners.<br />\n<br />\nand<br />\n<br />\n1. Strouse, Vice-Prest.<br />\nEdw. P. Hayden. Asset enahlAr.<br />\n<br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p, r year and upward.<br />\n<br />\n34 W. BIALTIMORE STREET.<br />\nand Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\ni*<br />\ntt,<br />\nCollege of Baltimore.<br />\nSTPITIOMBRY—For School, Pamily, Office and Bank.<br />\n<br />\n. School, Law, Medical, Classical<br />\n<br />\nHaberdashers,<br />\nShirts, Neck!' wear,Underwear<br />\nHosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.College<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nOn Sale The .1. 11. lJ. Pennants, aid all other<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANU,ACTUMER<br />\n<br />\nJas. Clark, Prod<br />\nChas. 8. Miller, Cashier.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON,<br />\nFOR<br />\n<br />\nJORDAN STRBI,Ell GO.<br />\n<br />\n.45V .<br />\n11StOoN70<br />\nM A710<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy--no adulterants,lio coloring, line quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\n(Hive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK,<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br />\n<br />\nOf<br />\n<br />\nOreek letter fraternitv aewetrp,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\ng.<br />\nPlease Call anb Examine our tine iBcfore Purchasin<br />\n<br />\nRecounts Solicited.<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n'BALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial \"Discount to Students.<br />\nC. & P. telephone 445-g.<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. if or<br />\n<br />\njENNINGS tit HORSEY,<br />\n<br />\n\"get R UZICKA<br />\n<br />\nM ERCHAN91.` TAILOHN,<br />\n21 %V. F&y syrTE<br />\n<br />\nSTIt alt'1`.<br />\n<br />\n0;-<br />\n<br />\nBOOKS ! I<br />\n-11ANDII<br />\nSECOND<br />\nand Miscellaneous,<br />\nSchool, Medical<br />\nBought, Sold and<br />\n<br />\nExchanged.<br />\n<br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EUTRAN ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\nBoo/binder,<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nWARNER 6c CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nA<br />\nManufacturers of<br />\n1-f<br />\nSilk and Caasimere Hats. IP'<br />\n<br />\nHopkins Caps<br />\n<br />\nV,<br />\n<br />\n60<br />\nS.<br />\nS.<br />\nYD<br />\nLLO<br />\nMAN<br />\nNORTH GER<br />\n.<br />\nRATES<br />\nLOW<br />\nAT<br />\nGE.<br />\nCABIN IliSSR<br />\n<br />\n•<br />\n<br />\nGenoa, etc.<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples,<br />\n.<br />\nDIRECT<br />\nBRDIEN<br />\nTO<br />\nBfiLTIMORE<br />\n<br />\nIPor particulars<br />\n<br />\n11. SGIWAVIGHER & GO., General Rants.<br />\n<br />\nappluto<br />\n<br />\nJAS. MEIKLE, VICE<br />\nISAAC H. DIXON. PPICST.<br />\nJAS. R. RICHARDS. TREAS.<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSmith, Dixon Co.<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "February 5, 1903<br /><br />\nVol. VII, No. 8<br /><br />\nTHE<br />\n4<br /><br />\nNEWS ere•LETTER<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nPie Joints Hopkins Pre.<br /><br />\nThc JoIiii Hopkins Universitil<br />\nBALTIMORE, MARYLAND.<br /><br />\nTWENTY-SEVENTH<br />\nBeginning October<br /><br />\nYEAR.<br /><br />\n1.<br /><br />\nItmerican Chemical Journal.<br />\nI. EtENBENT, Editor. Monthly, am Volume<br />\nXX.IX in progress. $5 per volume.<br />\n'Itmcrican aournal of Philology.<br />\nII. L.(ii I.I)ER SLEEVE, Editor. Quarterly.<br />\nVolume X X111 in progress. 13 pervel nine.<br /><br />\n110.<br /><br />\nStubies front the 13ioloaical laboratory.<br />\nVolume V ClJniplete. $5 per volume.;<br /><br />\n10.<br /><br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br /><br />\nre.<br /><br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR TJNDER(IRADUATES:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLaboratories.<br />\nhetnistry.<br />\nhyaies.<br />\neology and Mineralogy.<br />\nlogy,<br />\nnatomy.<br />\nhysiology.<br />\nathology and Bac tort)logy.<br />\narmacolog<br />\nenlist ry.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLain.<br />\nSanskrit.<br />\n1'iuJ lilt'.<br /><br />\nDirectors.<br />\nIra lienon<br />\nJoseph S. Ames.<br />\nWilliam 11. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. 11muItli.<br />\nWilliam, H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oder.<br />\nDirectors.<br />\nBasil I.()Hares!, ere.<br />\nI'. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Ilanpt.<br />\nHenry<br />\n.4. Marshall b;11 lot t<br />\n.lamex<br />\nlleiyht.<br />\nJohn At. Vincent.<br />\n.1. lt. 1 lollasith<br /><br />\n0111tillee.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br /><br />\n(I))!,<br /><br />\nWiscith<br /><br />\nPh)<br /><br />\nUndergraduate<br /><br />\nAwe,.<br /><br />\nCourses (leading<br /><br />\nto 13. A).<br /><br />\nI. classical<br />\n(the \"old college eourse\").<br />\nNlathematical-Physioal<br />\n(leading up to engineering).<br />\n.t. 'hetnical-Biological<br />\n(leading up to medicine).<br />\n4 i;eologleal-Biologleal.<br />\n6. latin- Ma t hematical.<br />\n6. II istorien] Political<br />\n(leading up to law).<br />\n7. Modern 14inguages.<br />\n2.<br /><br />\nSerial Publications.<br />\nmodest) Journal of Mathematies(vol X XV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Jeurnal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV 1.<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circula<br />\nX X I I).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\nStables in Victories( anb 'politica! $cience.<br />\nMonthly. Svo. Series XXI in progress. $:;<br />\nvolume.<br />\n3obna 1bophins \"University Circulars.<br />\nContaining reports or scientific and 1 ittra y wi irk<br />\nin progress in Baltimore. Ito. Vol. X Xl I in<br />\nprogress. $1 per year.<br /><br />\n0111. 3obno lbophins<br /><br />\nlboopital Zulletin. Monthly. 41o.<br />\nVolume X I V In progress $1 per year.<br />\n1011111. Johns Ibopkins bospital eports. 4to. Volume XI<br />\nin progress. $5 per volume.<br />\nix.<br /><br />\nContributions to lissyriology anb Comparative<br />\netc.)<br />\n5enittle pbitotowe, Ileitrage zii r A ssy<br />\nVol. IV complete.<br /><br />\nX.<br /><br />\nMemoirs from the 16iological laboratory.<br />\nW. K. BROOKS, Miler. Volume IV tionitilde<br />\n$7.50 per volume.<br /><br />\nLibraries.<br />\nUniversity,<br />\n106,000 volumes.<br />\nPeabody Institute, 146,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nVolti tee<br /><br />\n11.<br /><br />\nI, 1Q02.<br /><br />\nPresident: 1.a., HEMSEN. ikon of /he Medical I'acuity:<br />\nW i LLIAM H. Howsci.. Dean of the Colleye Faculty:<br />\nEDWARD H. GRIFFIN.<br /><br />\nlimertean Journal of Mathematics.<br />\nF. Mt ilthEY, Editor. Quarterly. 4t.o.<br />\nXX V in progress. $6 per volume.<br /><br />\nMobern language Votes.<br />\nA. M ELLIOTT, Editor. Monthly. 4to. Voluni.•<br />\nX.V 1 II in progress. $1.60 per volume.<br />\nX11. 'Journal of Experimental Mancini:.<br />\nW, II. WELCH, Editor,<br />\n8vo.<br />\nV I in progress. $5 per volume.<br />\nX11.<br /><br />\nX111. 2tmerican 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.4to, $5 per<br />\nvolume.<br />\nX110.<br />\nD.<br /><br />\neports of flbarylanb entoloaical Survey.<br />\n1,V I',LIAM B.(IA RK, Editor.<br />\nterrestrial Magnetism anb Ittmospheric Elec.<br />\ntrietty. L. A. BA1'ER, Editor. Quarterly. It.<br />\nVolume VII in progress. $2.50 per volume,<br /><br />\nftni. itnnualliteport.<br />\nPresented by the President. of the Board of Trustees, reviewing the operations of the University<br />\nduring the past acsdetnic year.<br />\nP11.'Etnnual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, ete., of the University. Po?,.<br />\nfished at the close of the academic year.<br /><br />\nIn addition to the serials shove named. copies may<br />\nhe obtained of I he works mentioned helow:<br />\nThe Collected Physical Papers of Henry A. Howland.<br />\nThe CriticalEdition of the Hebrew Text i)f the I ild<br />\nTestament. Edited by Prof. Paul Haupt. Prospee'tus on application.<br />\nRowland's Photographs of the Normal Soho) Spectrum.<br />\n10 plates. $20.00.<br />\n'Description of the Johns Hopkins Hnspital. .1. S. Billings, Editor. iw pp. 4to. ral plates. b7.5i) cloth.<br />\nThe Teaching of the Apostles. Complen lac- simile edition. Edited by .1. itendel Harris. 110 pp. 4to. 10<br />\nplates. &amp;MC<br />\nReproduction in Phototyipe of Syriac MSS. with A tithegomena Epistles. Ed ted by I. H. Hall. VOX).<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\nII-11 I. Chemistry, Mineralogy and Geology. Parts<br />\nV-V-VI. Physies,Astronomy us lid Mat<br />\nt<br />\nto. 30 cents per part.<br />\nft full list of publications will be bent on application.<br /><br />\nCommunications in respect to exchanges and remittances<br />\nhe sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nmay<br /><br />\n,<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nFEBRUARY 5, 1903.<br /><br />\nNo. 8.<br /><br />\nSOME EDUCATIONAL PRINCIPLES UNDERLYING COLLEGE<br />\nINSTRUCTION.<br />\n--I Concluded.]<br />\nHUS far we have been dealing witn the adolescent age in general, we shall now proceed to consider more particularly that part of it with which the college instructor<br />\nhas to deal. The adolescent of from 18-22 has the same characteristics as that of the<br />\nadolescent from 14 to 18. The difference is in the degree and manner of manifestation of<br />\nthe characteristics. The college student must be looked upon as a being surcharged<br />\nWith nervous force which is continually seeking manifestation along the line of least resistence, in that way which most satisfies his desires. The emotional element in him is<br />\nthe same emotional life as before, except that it has become more intellectualized, more<br />\nunder the control of the reason, if his education has been properly directed; otherwise it is<br />\nall the more predominating But taking the usual college freshman, his emotions must be<br />\nreckoned with as being intense and fitful, and marked by its extraordinary manifestations<br />\nof love, hate, auger, pride, loyalty, rivalry, jealousy, courage. Altruistic motives likely<br />\nhave greater sway at this time than in the earlier years. He is usually sensitive and introspective On the whole, the emotions predominate over the intellect, and this fact, together with the character of these emotions, must be in mind whenever approach is made<br />\nto him either for the purposes of instruction, or for any other. By the time he reaches his<br />\nJunior and senior years, these unusual manifestations of the emotions are in most cases<br />\ntoned down and have become under the control of the intellect. His interests, his judgments, his actions have risen to this higher plane, and the method of approach may<br />\ntake advantage of the change<br />\nIn intellectual capacity he has progressed in the power of synthesis and generalization<br />\nto some degree, largely conditioned by the four factors (1) the subjects he has studied in<br />\nschool;(2) the experience he has had outside of it; (3) the direction, help and encouragement<br />\nhe has had;(4) his own ability. No more definite generalization than this is passible, in so<br />\nfar as I know. The instructor can usually determine the question in a short time at any<br />\nrate. Then, too, it is really the least important of all to consider. There is little need for<br />\nsuch, however, inasmuch • as in educational institutions facts regarding the intellect are<br />\neasily obtained and the results estimated in some more or less perfect way.<br />\nIn his will power he is just as strong and as determined as before, perhaps even more<br />\nSO. Like the emotions, however, the will is more amenable to reason. Yet reason has not<br />\ngained the ascendancy by any means There are frequent spells of lassitude, and then<br />\ntimes when he will exhaust himself in his activity. When his mind is once made<br />\nup he is more hard to dissuade than formerly; he is essentially active and enthusiastic in<br />\nwhatever he undertakes, and assumes the attitude of independence and responsibility more<br />\nthan before. He must have interests of some kind to which he can give his energy, and<br />\nthis is more likely to be true with the college man than with the preparatory school boy.<br />\nThe tendency to give almost all his energy to one special line of activity, which will<br />\nlater become his life work, is making itself manifest. And whereas before his activity<br />\nmade itself felt in a great many directions in an almost equal degree, he has now chosen<br />\none or several lines which most appeal to him, and has withdrawn his attention from the<br />\nothers.<br /><br />\n2<br /><br />\nTHE NEWS- LETTER.<br /><br />\nThe college years constitute the period par excellence when he passes through that turmoil of fixing for himself those eternal principles which are to be used as his standard of<br />\njudging right and wrong in the world, and of &amp;terming his relations to his Creator. With<br />\nthe broader horizon, with increased intellectual power, with wider experience, he is now<br />\nable to grapple with such problems and after a struggle or longer or shorter duration, perhaps of several years, he emerges with certain definite principles which in all probability<br />\nwill govern all his later thinking. It is this time also, rather than the previous, when<br />\nhe really first looks upon the world seriously, and ponders what he is to do in it and for it,<br />\nhis choice being determined by heredity, environment, and individual choice. It is the<br />\ntime of most unstable mental equilibrium. It is the storm and stress period of life, when<br />\nresponsibilities, more often exaggerated than not, begin to be realized, when opportunities<br />\nof varying kinds are suggested, when he feels the power within hint with which it seems<br />\nhe can almost move the world, yet with uncertainty as to the directions in which it may<br />\nbe right for him to exert his energy, and after that is decided where it is best. All these<br />\nserious conflicting conditions necessarily cause mental turmoil. And what an opportunity<br />\nthere is for the educator—him whom he loves—it is too grand and beautiful and inspiring<br />\nto think of it. The reward that comes to the teachur who can reach him is more than the<br />\npaltry dollars that business may offer in excess of his meager salary.<br />\nWe have in adolescence the sublime spectacle of youth being born into the life of the<br />\nrace to be prepared for the battles that life brings When he enters he is resistless energyuncontrolled by reason, when he leaves it he is a mature man with the same emotional<br />\nstrength as at the beginning but manifested now in accord with \"the good, the true and<br />\nthe beautiful\" through the cultivation of the intellect and the discipline of the will.<br />\nAs educational principles to be drawn from these facts of genetic psychology, I would<br />\nsuggest the following as of the greatest importance. They are for the most part been<br />\nmade, obvious by what has preceded, and require but little explanation<br />\n(1) The personality of the instructor should be such as to appeal to young people.<br />\nWhile this is in all cases true, it is nowhere so true as in the adolescent age, when the<br />\nadmiration of the youth for the adult becomes so strong as to devolop into hero worship.<br />\nIf the instructor wishes to make full use of this tendency in young people, he must address<br />\nhimself to them in such a manner, both in and out of the lecture hell, that they will feel<br />\nthat he understands them, and that he has a genuine interest in their development. Inasmuch as the intellectual occupies a subordinate place in the field of their interests, the instructor must administer to their other interests to a considerable degree, whether they be<br />\nmoral, aesthetic, religious, personal, or so3ial. While it is true that it is the personality of<br />\nthe instructor that enters into the life of the student far more than what he teaches, it is<br />\njust as true, that the more pleasing his personality, the deeper the impressions his teaching<br />\nmakes upon them.<br />\n(2) Growing out of the above but deserving the rank of the other principles given,<br />\nthe instructor should thoroughly understand the nature of adolescents.<br />\n(3) Deep intellectual interests should be developed in the student, and a serious atti_<br />\ntude toward study as preparation for after life established The truth is self-evident. As<br />\nJames whits out this is to be done by building upon those interests already acquired, lead•<br />\njug to those more advanced. But let me insert a word of caution at this point, as to the<br />\ndetermination of the degree of difficulty of sabject matter that should be attempted. The<br />\nfact t hat some students can do the work, is not in itself an indication of the rightfulness Of<br />\ngiving that work. Adolescents can do wonders and the discovery of difficulties is often<br />\nthe strongest motive for pursuit of a line of work, and when this is true the course offered<br />\nmay be entirely wrong from the educational point of view. Psychology demands that the<br />\ninterest and motive should abide in the subject itself.<br />\n(4) The instructor should make use of and develop the tendency to independent<br />\nthought and action.<br />\n(6) The instructor should inspire in the student enthusiastic; activity in his studies,<br />\nand in all the other legitimate activities of life. Otherwise much of the evil and the in-<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\ndifferent yvill come into his life He must do something; help him to do that which is<br />\nprofitable.<br />\n(6) Economical use of the nervous energy should be planned. The unessential should<br />\nbe eliminated; proper and definite directions of study given; doubts, perplexities, fears, removed; the scatter-brained lured to consecutive thinking; manias for thinking in extreme<br />\ndegree restrained; and true habits of thought formed. That is, this storm and stress period<br />\nof life where so much nervous force is wasted, should be so regulated as to give to the student, when he emerges from it, the maximum amount of plwer.<br />\n(7) The practical bearing of the subject matter of instruction upon life, present and<br />\nfuture, should always be clear in the mind of the student. He should always think the<br />\nsubject worthy of all the energy that he can give to it, and be able to state the reasons<br />\ntherefor. Otherwise he is departing from his normal attitude towards things.<br />\n(8) The individuality of the student should be properly cared for, that its strong<br />\nPoints may be preserved, and its weak points strengthened.<br />\n.(9) Opportunity for the student to express his thoughts freely and with the benefit of<br />\ncriticism should be afforded. No mental process is complete until it has found expression.<br />\nAll instruction should provide for it. It may best be done by free oral discussion or under<br />\ndirection by set debate.<br />\nWe are now ready to proceed to inquire into the question in how far do the systems<br />\nof instruction prevailing in colleges fulfill these laws? These systems may be classified<br />\ninto three—(1) the lecture system; (2) the text book and recitation system; (3) the combination of the two.<br />\nThe character of a lecture course differs with the character of the lecturer. Some<br />\ncourses are almost purely informational. in so far as the product derived from them is concerned. In others there is a personal element contributed by a lecturer that is very<br />\nvaluable, These two features must be separated in a discussion of the system as a 'whole.<br />\nFirst, the lecture in HO far as it is informative. If we review this kind of lecture, in<br />\nthe light of these principles, it must be unhesitatingly condemned Only one of them<br />\nwill, in all probability, be fulfilled, that of making clear the practical bearing of the subject matter upon life, and in many cases it fails in this as well. The preponderance of<br />\nevidence is overwhelmingly against its achieving (1) the awakening of deep intellectual<br />\ninterests; (2) the developing of independent thought; (8) the inspiration to enthusiastic<br />\nactivity; (4) the insuring of an economical use of nervous energy; (5) the full development<br />\nof the individuality; (6) the giving of opportunity for expression of thought The first and<br />\nSecond principles cannot be applied in this connection.<br />\nAnd furthermore, and sufficient in itself alone to mark it as a very imperfect method<br />\nof procedure even though the truth be not strictly educational, such a means is not the best<br />\nto give information. The notes taken are not a fair and true synopsis of the lecture given<br />\nGreat labor upon the part of the student is needed to prepare their imperfect reproduction<br />\nproperly, and so on The lecturer in these days owes the student a printed book, and if<br />\nthe matter of his lectures is worth publication, he will not have difficulty in securing a<br />\npublisher. Or if this is not possible, he may make good use, and from the students' standpoint better use of a book written by another.<br />\nThe personal element in a lecture is of very great value indeed in securing the results<br />\nto be achieved in the above enumeration of principles. But the best use of personalty is<br />\nnot being made in giving an informative lecture. To this we shall return later.<br />\n(2) With the text book and the recitation system as great a variety of results is secured<br />\nas with the lecture system, depending again upon the instructor. On the whole it is better<br />\nthan the lecture system. For a mere reading of a book with the reflections that a student<br />\nnotes,<br />\nmight make thereon as he reads along is analogous in every respect to the reading of<br />\nof<br />\narrangement<br />\nbetter<br />\na<br />\nand<br />\nstatement<br />\nbetter<br />\na<br />\nis<br />\nthere<br />\nthat<br />\nwith these advantages added,<br />\nthought in the text than in the students notes. This method furthermore has the advantage of the recitation, of whatever sort it may be.<br /><br />\n'I'Hl<br /><br />\nN liNt'S—LETTER.<br /><br />\nhere the personality of the instructor is more strongly felt than in a lecture, and the<br />\nstudent has the benefit of exchange of thought upon the text with his fellows. This method<br />\nis open to two objections at least. (1) It is not practicable with the organization of most<br />\ncolleges as at present constituted. (2) It is narrowing in its effect if it confines attention to<br />\none text.<br />\nThe ideal as I view it, is the combination of the text book and lecture system. There<br />\nis value in the lecture, and it must be recognized; likewise there is value in the use of a<br />\ntext. If I were asked to submit a plan after which college instruction might be best<br />\nmodeled, it wottld be the following:<br />\n(I) Lectures for the purposes of inspiration, direction, amplification, of the nature of<br />\nnew matter not contained in texts, or a comparison of the views of different authors with<br />\nthe lecturer's own individual interpretation, thereby giving a clearer differentiation, or for<br />\nthe purpose of summarizing.<br />\nThese lectures should be given by the man most fitted in personality, knowledge, and<br />\nexperience, and at those times that would best aid the student according to the principles<br />\nindicated above.<br />\n(2) A text that would give the outline of the course in such a way as to guide the<br />\nthought of the student. This is not a necessity if the following factors supply the same<br />\nneed.<br />\n(3) A well stocked library. Not one or two copies of every book referred to during<br />\nthe courie, though this is good, but in preference many copies of a few books which are<br />\nwritten upon lines similar to that followed by the course. This would be comparable to a<br />\nPhysical or chemical laboratory where each student has his desk.<br />\n(4) Assistants to the lecturer of the right personality and in sufficient number, so that<br />\nevery student may, come in close and frequent contact with one assistant at least. The<br />\nduties of the assistants would be:(1) to direct study,(2) to consult upon difficult points met<br />\nby pupils in study or to help him in it in every way,(3) to conduct frequent discussions<br />\nupon the reading and lectures at stated periods with the students in his charge. They<br />\nwould then carry the burden of the work. In a small college the lecturer might act in this<br />\ncapacity as well. But if the burden be too great for one man, and additional assistants be<br />\nneeded, he ought to take part of this work, alternating at intervals with the assistants,<br />\nthat he may come in contact with all the students.<br />\nWith this plan I believe those principles could be fully achieved, and although it involves a change of administration of college courses, which have good arguments in their<br />\nfavor as at present constituted, yet I believe the colleges are more and more coming to<br />\nsome such plan as this, and that this movement will be hastened when more care is taken<br />\nto ascertain the real needs of their students.<br /><br />\nRLAN UPDEGRAFF.<br />\nThe Girls' Latin School, Baltimore.<br /><br />\nALUMNI NOTES.<br />\n993<br /><br />\nMr. Geo. Stewart Brown, now a member of the first branch of city<br />\ncouncil, is a candidate for the second branch at the coming spring elections.<br />\nThomas C. Pinkerton an.1 Wm. Sneeringer, of Boston Tech, have been<br />\ngreeting friends about the University this week.<br />\nMr. Arthur W. Machen, Jr., has a carefully prepared article<br />\nin the January number of the Maryland Law Review, calling attention to the<br />\nnecessity of a thorough revision of the corporation law of Maryland.<br /><br />\n'96<br /><br />\nTH8 N HWS—LETTER.<br />\nTHE CECIL RHODES' SCHOLARSHIPS.<br />\nRESIDENT REMSEN went to Philadelphia last week to meet several<br />\neducators of New Jersey and Pennsylvania in conference with a repre<br />\nsentative of the Cecil . Rhodes Trustees for the arrangement of details for<br />\nthe award of the scholarships to Oxford University, provided by the will of the<br />\ngreat South African promoter. The conference was held in the office of Provost<br />\nHarrison, President Wilson, of Princeton, being another of those in attendance.<br />\nPreliminary plans in the same manner had already been made by several New<br />\nEngland States. The Philadelphia meeting passed a resolution, of which the<br />\nmost interesting clause for us is this:<br />\n\"In Maryland th.- nomination of Rhodes scholars for the State shall be<br />\nintrusted to a committee of from three to five members chosen from the college<br />\nfaculties of the State by the president of Johns Hopkins University, of which<br />\ncommittee he shall be chairman.<br />\n\"The selection of candidates shall be limited: To persons not less than 19<br />\nor more than 23 years of age: to persons who for at least two years shall have<br />\nbeen regularly enrolled students of an American college.\"<br />\nThe New Jersey and Pennsylvania committees will be determined in a<br />\nsimilar way by President Wilson and Provost Harrison.<br />\nTwo scholars will be named in each State, each scholarship continuing<br />\nthree years with an income each year of $300.<br />\nThe precise method by which the Maryland scholars will be selected, next<br />\nto the names of the men themselves, is of course the most pertinent subject for<br />\nPresent speculation. President Remsen does not yet know himself, nor had he<br />\neven named the rest of the committee when this went to press.<br />\n''A great deal of thought will be required,\" said Dr. Remsen, early this<br />\nweek, \"to determine just the right methods of selection. 'What academic qualifications will make a man eligible' is probably the first question that those most<br />\ninterested will ask us. It shall be understood, therefore, at the outset that we<br />\nmust be reasonably assured that whomsoever we recommend shall be able to<br />\nmeet the regular requirements for entrance to Oxford University. 'Responsions'<br />\nis the term by which these examinations are known. The responsions may be<br />\nregarded in a general sense as the Oxford man's matriculation examination, to<br />\nuse the term current here. They differ, however, in content from our entrance<br />\nexaminations, demanding from the candidate more of some things and not so<br />\nmuch of others. Latin, Greek, and mathematics are the most important elements of the responsions. The requirements in Greek, in particular, will probably seem unusually severe to most American students. And this requirement<br />\ncannot be waived by the substitution of something else, as is often in American<br />\nschools. What formal test will be applied by the committee itself I am not yet<br />\nable to say.\"<br />\n\"Then, you know, Mr. Rhodes' will expresses certain preferences concerning the general character of the men who are to fill his scholarships. These<br />\nmust also be observed. It will be with us to recommend young men, vigorous<br />\nand devoted to outdoor life, men best fitted by good fellowship to enter with the<br />\nbest spirit into their intercourse with other men.\"<br />\n•<br /><br />\n(p<br /><br />\nHli NEws-LETTEA,R.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nFEBRUARY 5, 1903.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br /><br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n...............<br /><br />\nAthletic Editing,<br /><br />\nW. S. BIRD. 1908.<br />\nJ. NEWMAN NUMSEN, 1904.<br /><br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nHARRY. BAETJER, 1903.<br />\n. Itrocim BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hop.<br />\nking University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\n.I. H. U.; or box $98, Medical School of Johns Hopkins Hospital.<br />\n1.1.111•110<br />\n,<br /><br />\n1<br />\n1 , MOVEMENT is on foot in the Senior Class to institute some form of the<br />\nHonor System in the undergraduate department. There are differences<br />\namong the men as to the method to be pursued in attaining the desired<br />\nend , This is but natural; the system requires careful consideration, and there<br />\nis much which the men regard in different lights, since the point of view cannot<br />\nbe in all cases the same. These differences are differences of method, and not<br />\nof result. The class is a unit in the belief that the Honor System will be of<br />\nbenefit to the University. No one is antagonistic to the introduction of the<br />\nHonor System, but there does exist a division of opinion as to the best way of<br />\nsecuring the desired result.<br />\nAs soon as the Senior Class has formulated a system which they believe<br />\nwill be best for the University a delegation will visit the two other classes and<br />\nurge its adoption. After the matter has had the approbation of the Senior<br />\nClass there can be no doubt of its adoption by the Junior and Freshman classes.<br />\nThe only word of criticism which has been heard is to the effect that the<br />\nmen who are prominent in the present agitation have unduly magnified the<br />\noffenses upon which they base their plea for the need of an Honor System. Such<br />\nis not the case. The men who have taken a lively interest in behalf of this<br />\nmeasure have not made a single statement of existing conditions which any ob-<br /><br />\n*nig NEWS-LErrgR.<br /><br />\n7<br /><br />\nserving man can challenge. The president of the Senior Class was the originaLor of the movement, and he is willing to bear any hostile criticism. Seeing<br />\nthat the trend of public opinion was in favor of self-government by the student<br />\nbody he decided to hold a class meeting in order to discuss the question. The<br />\nmeeting was held, and the matter discussed. It was seen that the question was<br />\none of the gravest importance, and after some discussion the meeting adjourned<br />\nto meet a week later. This was as it should be, for there is no need of haste<br />\nand the longer the time spent in deliberation the better will be the system which<br />\nwill be adopted.<br />\nA letter which has been received from J. S. Grasty, '02, throws some light<br />\non the system as in use at a southern,University He says: •'There can be no<br />\ndoubt that the \"Honor System\" is the most efficient means yet devised to inculcate a deep sense of honor upon college men. It is in vogue at the Washington and Lee, as it is in all the colleges and universities of the South. At<br />\nthe Washington and Lee, where I am now a student, I have had ample opportunity to observe the workings of the \"Honor System,\" and I must say that I<br />\nheartily approve of it. Every man here is assumed to be a man of honor and is<br />\ntreated as such. In the performance of duty he is wholly free from espionage<br />\nand his word is accepted without question. This system is traditional here,<br />\nand any abuse is quickly and rightfully resented by the student body.\"<br />\nNo one can but believe that a solution will be found for this vexing<br />\nproblem. The greatest difficulty lies in the method to be pursued in attaining<br />\nthe desired end.<br />\nHE inter class games have been a source of great profit to the contestants.<br />\nEach has learned what his relative standing is, and what he must do in<br />\norder to win in the future. Aside from the interest aroused by class<br />\nrivalry there was a great desire to know what the men could do, especially the<br />\nnew men. From this meet Captain Hoffman is now better able to judge of the<br />\ncapabilities of the different men.<br />\nOne thing which was noticable was the lack of headwork displayed by the<br />\ndistance runners. Nelson's capture of the mile and Tootle's capture of the half<br />\nshould never have been permitted. Neither of these men is a distance runner,<br />\nand the fact that each crossed the tape first in his race shows that there was a<br />\nlamentable lack of thought on the part of the other contestants, most of whom<br />\nwere far speedier at such d'stances. The loss of the mile was a bitter disappointment to Porter, and one which he should take to heart. After last year's<br />\nexperience at Electric Park against Randell one would think that he would<br />\nnever again content himself with such an easy going pace as was set in the mile<br />\nrun. Had he displayed the least bit of judgement he would have known that<br />\nNelson could beat him on the sprint, and he should have managed his race accordingly. This is a lesson he must learn, or else find himself defeated time and<br />\ntime again by inferior men. The same lack of judgement was displayed in the<br />\nhalf. After a slow pace for six laps it was camparatively easy for Tootle to<br />\nsprint for two hundred yards and win the race.<br /><br />\nt<br /><br />\nIHE NEWS-LETTEk.<br />\nLeCron did remarkably well for the Junior Class, but he suffered by being<br />\nentered in too many events. Stone, of the Freshman Class, is a man of great<br />\npromise. He is always in condition, and can he depended upon to make a good<br />\nshowing in any contest he enters. Jackson, of the same class, showed up well<br />\nin the relay, and is developing into a steady, fast runner.<br />\nIn the relay race interest centered in the struggle for second place. No<br />\ndoubt the victory of the Freshman team came as a surprise to many, yet they<br />\nhad trained consistently and were in prime condition. It can hardly be expected<br />\nthat the Juniors are content with the result, and we may expect to hear that<br />\nthey have challanged the Freshmen for another race.<br />\nThe superiority of the Senior Class was so great that the two other classes<br />\nwere overshadowed. It would he an excellent idea for the Juniors and Freshmen to hold a dual meet with practically the same events. The difference in<br />\npoints was not great, showing that the two classes were nearly evenly matched.<br />\nShould a dual meet he held he would be a wise prophet who could pick the<br />\nwinner.<br />\nHE, Hullabaloo Club, an organization of the Senior Class for the promotion<br />\nof sociability and good fellowship, seems to be languishing. It is true<br />\nthat a feeling of sociability and good fellowship prevails in the class, but<br />\neven the most sanguine supporters of the club cannot claim that it has been<br />\nfostered by the class club. The cause of this state of affairs is not far to seek:<br />\nthere is very little time that the men can spend at the club rooms, the quarters<br />\nof the club are not furnished as attractively as they might be, and the board of<br />\ngovernors are not giving the club the attention it requires. The men who compose this board started the club, and then got the Senior Class to adopt their<br />\nideas and to continue them in the offices they had selected, They must now<br />\nmake good their promises. It would seem that the hoard of governors is responsible in a large degree for the present situation, and to them the class<br />\nlooks for a betterment of the club's condition. The club ought not to be given<br />\nup, and it will not be given up, but something must be done, and that quickly.<br />\nThe original intention of the founders of the club was to make it in time an<br />\nundergraduate affair. No better time than the present could be found for car<br />\ntying out this project. The kindly feeling which exists between the classes,<br />\ndue in no small degree to the friendly rivalry of the class games, makes this a<br />\npropitious moment for taking this step, which will be of benefit to all. The<br />\nNEWS-LETTER does not wish to appear to dictate to the club, and only in its<br />\ndesire for the welfare of the undergraduate body it has made the forgoing suggestion.<br />\nNo matter what action is taken upon this suggestion the fact remains that<br />\nit is up to the board of governors to do something.<br /><br />\nt<br /><br />\nHelen of Troy.<br />\n\"How can you dress so expensively when the City is under siege on your<br />\naccount?\" demanded the Daughter of Priam.<br />\n\"Because I get all my gowns from Paris,\" coldly replied the Cause of the<br />\nTrouble.— Yale Record.<br /><br />\nTHE N EW S-LETTER.<br /><br />\nI<br /><br />\nI III ON I<br /><br />\nI II<br /><br />\nI IIIIUt<br /><br />\nI I Oil I Iii I it I<br /><br />\n9<br /><br />\n111<br /><br />\nI H01101511<br /><br />\n117 IN<br />\n:<br />\n40<br /><br />\nmem<br />\nm<br />\n:c••<br /><br />\n4<br /><br />\naiftd.1<br />\naa mar<br /><br />\nat<br /><br />\n;<br /><br />\n1<br /><br />\n.47,..::Tz75171;<br />\n,MIIIMMIIIIIIIIIIIIMIIIII11111111111111M11111111111111111111MMIIIMIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIII,1111111111111111111111111111111111111111111111611111111111111111141MillatiAliia<br />\n,•,•<br /><br />\nT the Yale Alumni banquet held at the Carrollton Hotel on January 23,<br />\nDr. Herbert E. Greene responded to the toast, \"Harvard.\" Extempore<br />\nspeeches were made by President Ira Remsen and Drs. B. C. Steiner and<br />\nW. H. Welsh.<br />\n\"Trusts and Their Development\" was the subject of a lecture delivered by<br />\nDr. George E Barnett before the Typographical Union of Baltimore on February 1.<br />\nDr. Guy Carleton Lee is one of the committee on arrangements for the<br />\nDickenson Alumni banquet, which will be held at the Rennert Hotel to-morrow<br />\nnight<br />\nAt the winter exhibit of the Charcoal Club there are several excellent marine<br />\nand landscape scenes from the brush of Mr S. B Whiteman.<br />\nProfessor Angelo Heilprin, of Philadelphia, delivered an illustrated lecture<br />\non \"Scientific Aspects of the Mount Pelee Eruption\" at the Johns Hopkins<br />\nClub on January 24. Professor Heilprin, who was one of the first scientists to<br />\nreach Martinique after the outbreak, gave a most graphic account of the terrible eruption<br />\nPresident-Emeritus Gilman and Dr. Albert Shaw are members of the General Education Board, recently chartered by Congress for the promotion of Educational work in the United States, which was organized in Washington on<br />\nJanuary 29.<br /><br />\n•<br /><br />\nMr. Edgeworth Smith, who has been confined to his room threatened with<br />\ntyphoid fever, is reported considerably improved.<br />\nDr. E. C. Armstrong is president, and Dr. Geo. C. Barnett is secretary of<br />\nthe Randolf-Macon Alumni Association of Baltimore, which will hold its annual<br />\nbanquet at the Rennert Hotel on February 6.<br />\nDr. Kirby Flower Smith delivered a lecture on \"The Medical Legend of<br />\nVirgil\" in the Donovan Room on the evening of January 30. ------<br /><br />\n0<br /><br />\nDINWIT—Say, our backbones are like serial stories, are n't they?<br />\nTHINWIT—Prove it.<br />\nDINWIT—Continued in our necks.—Lampoon.<br /><br />\nTHE NEWS-I,ETTUR<br /><br />\n1.0<br /><br />\nUNDERGRADUATE NOTES<br />\n'HE concert given by the Musical Clubs at Forest Glen was a thoroughly<br />\nsuccessful affair in respect not only to the performance of the three clubs<br />\nbut also to the enjoyment of the individual players. The quartet composed of Hall, Coffin, Gilman, and Ford was especially well received. The<br />\nconcert was followed by a dance and reception.<br />\nThe clubs are now busily rehearsing for the Baltimore concert, which will<br />\ntake place at Lehman's Hall on Friday, February 27. This concert is the most<br />\nimportant one of the year, and the management is determined that it shall be a<br />\nsuccess.<br /><br />\nC<br /><br />\nFebruary 23 has finally been selected as the date of the Senior banquet.<br />\nIt was found impossible to complete arrangements in time to hold the banquet<br />\non last Friday night, as originally intended.<br />\nA committee consisting of Custis, Plaggemeyer, Strayer, and Tootle has<br />\nbeen appointed by the Senior Class, looking towards the adoption of the<br />\n\"Honor System\" at the University. Nothing definite has as yet been decided<br />\nupon, but the committee is carefully considering the plan and expects to have<br />\nthe proposition ready in a short time, so that action may be taken on it.<br />\nThe St. James Hotel and February 20 have been decided upon as the place<br />\nand time of holding the Junior Class Banquet. The committee expects to appoint the speakers and the toasts to which they will respond, in a few days.<br />\nThat all who attend will have a glorious time goes without saying.<br />\nThe crowds that assemble in the gallery of the cage every evening to watch<br />\nthe track and lacrosse candidates is a sign of the lively interest that is being<br />\ntaken in these sports by the students.<br />\nLast Monday night the Junior Class held a \"smoker and feed\" in the<br />\ntrophy room. It was arranged by several enthusiastic members of the class,<br />\nwho wished to arouse interest in University and class affairs. That their efforts<br />\nwere crowned with success was evident to all who happened to be around 'he<br />\nGym on Monday night. It is the intention of the class to hold a number of informal gatherings during the coming months.<br /><br />\nWHO IS HE?<br />\n(Extract from<br /><br />\nho National Park Seminary \"Merrarti.\")<br /><br />\nIf the young gentleman who sang on the Johns Hopkins Glee Club and<br />\nwho was so forgetful as to leave his trousers at the seminary, will call between<br />\none and two on Saturday, they will be returned to him.<br />\n(If the aforesaid young gentleman will divulge his name he will he awarded<br />\na leather medal by the NEws LRTTER. If another young gentleman, who, by<br />\nthe way, plays with the 'Varsity football team, will divulge by what means a<br />\ncharming damsel kept him cornered for three hours, we shall gladly award<br />\nanother medal.---ED.)<br /><br />\nTHE NEWS—LErrMt.<br /><br />\n11<br /><br />\nGAMES SC H EDU LF.D TO DAT E.<br />\nFebruary 14th—Baltimore Athletic Club, Fifth Regiment Armory.<br />\nFebruary 21st or 28th—Johns Hopkins University, Open Handicap Games.<br />\nMarch 7th—Georgetown University, Washington, D. C.<br />\nApril 2rith—University of Pennsylvania, Relay Races.<br /><br />\nINTERCLASS ATHLETIC CONTESTS.<br />\nHE first annual interclass athletic meet came off in the \"cage\" last Thursday night. The cage had been elaborately decorated with the championship banners which Hopkins has won, and together with the flags of the<br />\nClasses of 1903 and 1904, the walls and rafters were decked in true gala attire.<br />\nThese banners are the proofs of the athletic excellence to which Hopkins has<br />\nattained, while the \"vim\" and \"vigor\" manifested by the contestants in the<br />\nvarious contests showed that this excellence is still to remain above par.<br />\nDuring the course of the evening several genuine surprises were encountered, first among them being the result of the mile run. Porter was picked<br />\nfor a sure winner, and Nelson's fast pace and the good form in which he ran<br />\nwere totally unexpected. While Nelson's work on the track has always been<br />\nvery creditable, still he has never been numbered among the fastest long-distance -runners. He shows unusual promise. Captain Hoffman will no doubt<br />\nbe able to use him to advantage for the Varsity.<br />\nThe second surprise came in the relay race. The Seniors won out by a<br />\nbroad margin, as was expected, but the defeat of the Juniors by the Freshmen<br />\ncreated a little surprise. The Freshmen ran in good form, Stone's pace against<br />\nLeCron being particularly commendable.<br />\nSurprise No. 3 came in the half mile run, when Harry Tootle carried off<br />\nfirst honors. Heretofore, Tootle has been counted on to figure conspicuously<br />\nin the dashes, but he has never posed as a long distance man, and his exhibition proves him to be a valuable runner in either long or short distance.<br />\nThe thirty yard dash came off in first class style, and both Pessagno and<br />\nBlanck did pretty work in the running high jump.<br />\nA large crowd attended, and we may expect Manager Dulaney to report a<br />\nfinancial success.<br />\nThe summary is as follows:<br />\nThirty Yard Dash—First heat—(two to qualify) Walker, first; Hudgins,<br />\nsecond. Second heat—Pessagno, first; Williams, second. Third heat—Stone,<br /><br />\nTHE NEWS—LETTER.<br /><br />\n12<br /><br />\nfirst; Smith, second. Fourth heat—Tootle, first; Blanck, second. Fifth heat<br />\n—Branham, first; Bogue, second.<br />\nSemi-finals (three to qualify)—First heat—Pessagno, first; Williams,<br />\nsecond; Stone, Walker. third. Second heat—Tootle, first; Blanck, second;<br />\nSmith, third.<br />\nFinals—Tootle, first; Pessagno, second; Blanck, third; Stone, fourth.<br />\nRunning High Jump—Pessagno, first; Blanck, second Smith, Hawkins,<br />\nthird.<br />\nRelay Teams—Seniors entered Pessagno, Hoffman, Tootle, Nelson. Juniors<br />\nentered Strohbar, Branham, Porter, LeCron. Freshmen entered Hudgins, Morse,<br />\nJackson, Stone.<br />\nThe Seniors won the relay by about one-half lap; the Freshmen came second and the Juniors third.<br />\nPutting Shot (12 pound)—Blanck, first; Yearley, second; Stone, third;<br />\nPearre, fourth.<br />\nOne Mile Run—Nelson, first; Porter, second; LeCron, third; Morse,<br />\nfourth.<br />\nStanding Broad Jump—Blanck, first; Tootle, second. Williams, third,<br />\nPessagno, fourth.<br />\nHalf Mile Run—Tootle, first; LeCron, second; Stone, third; Strohbar,<br />\nfourth.<br />\nThe officials were as follows : Referee, L. C. Taylor; clerk of course, W.<br />\nM. Mackdermott; marshall, W. S. Bird; announcer, Plaggemeyer; scorer, C.<br />\nRiley; track judges. W. E. Hoffman, Jr., A. B. Atkinson, and G. L. Freese;<br />\nfield judges, George B. Schall, Harvey B. Stone; starter, W. M. Mackdermott.<br />\nFrom the above summary it may be easily seen that the Seniors swept the<br />\ndeck, taking first place in all seven events and gaining a total of 534 points.<br />\nThe Juniors and Freshmen together made about 20 points.<br />\nThe following table explains the work of the individual contestants.<br />\nName<br /><br />\n1<br />\n2<br />\n3<br />\n4<br /><br />\n7<br />\n9<br />\n10<br />\n12<br /><br />\n:10 yd. Dash High Jump Broad.Jump Shot Put Milo Hun SRO pi. Run Total<br /><br />\nBlanck, 03,<br />\n2<br />\n3<br />\n5<br />\n5<br />\nTootle, '03;<br />\n5<br />\n3<br />\n5<br />\nPessagno, 03,<br />\n3<br />\n5<br />\n1<br />\nNelson, '03,<br />\n5<br />\nLeCron,'04,<br />\n2<br />\n3<br />\nStone, '05,<br />\n1<br />\n2<br />\n2<br />\nYearley, 03,<br />\n3<br />\nPorter, '04,<br />\n3<br />\nWilliams, '03,<br />\n2<br />\nSmith, 03,<br />\n1<br />\nHawkins, 04,<br />\n1<br />\nStrohbar, '04,<br />\n1<br />\nPearre, '04,<br />\n1<br />\nMorse, '05,<br />\n1<br />\nSenior Relay Team, 5 points.<br />\nFreshmen Relay Team, 3 points.<br />\nSeniors, 534 points; Juniors, 11% points; Freshmen, 9 points.<br /><br />\n15<br />\n13<br />\n9<br />\n5<br />\n5<br />\n5<br />\n3<br />\n3<br />\n2<br />\n134<br />\n1<br />\n1<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nLACROSSE NEWS.<br /><br />\nt<br /><br />\nHERE is little change in the lacrosse situation since the previous issue of<br />\nthe NEWS LETTER. A game is now practically assured with Hobart<br />\nCollege for April 11th though the Hobart manager is having some trouble in arranging a southern trip. The question of a game with the English<br />\nteam is causing some annoyance. Harvard, to whom the English management<br />\nhas entrusted the arranging of their schedule, wishes to postpone the Hopkins<br />\ngame till June 25th. Of course. it will be impossible to hold our team together<br />\nas late as that; and unless Harvard can arrange to have the English team meet<br />\nus June 20th, the Britishers will miss the greatest opportunity of their American trip. This date may seem late, but the Englishmen will not reach America,<br />\naccording to present arrangements, until June 16th. If June 20th can be arranged, Hopkins may play Harvard here June 13th.<br />\nIt now seems improbable that the team will get any trip except that to<br />\nSwarthmore. C. C., N. Y., was the only team that was willing to play Hopkins out of Baltimore, and unfortunately dates could not be arranged. The<br />\nLeague games fall here this year in accordance with the League's arrangements.<br /><br />\nAMONG THE COLLEGES.<br />\nN the future all Yale students who are unable to swim will be required to<br />\ntake instruction in this branch of sports.<br /><br />\n3<br /><br />\nRockfeller's Christmas gift to Chicago University was $1,000,000.<br />\n11Columbia University is planning a course in automobile engineering which<br />\nwill begin next April with an enrollment of thirty students.<br /><br />\n.1._<br /><br />\nIt is estimated that American students issue three hundred periodicals.<br />\nHarvard has the largest college library in the United States, having 700,000<br />\nvolumes, Yale has 200,000, Columbia 133,000, Cornell 126,000.<br />\nFifty-five United States Senators and 400 Representatives are college graduates. Our present Congress contains graduates from 113 colleges.<br />\nThe University of Utah has a very ambitious dramatic club. The club<br />\nrecently gave a performance of A. W. Pinero's play, \"The Amazons.\"<br />\nA Department of Chinese will soon be established at Columbia, several<br />\ngifts having been received lately for that purpose.<br />\nIn relation to the proposed two-year college course President Wilson, of<br />\nPrinceton, is said to have remarked, \"I cannot imagine how anybody who ever<br />\nsaw a Sophomore could ever think of graduating one in that condition.\"<br />\nYale has taken up water-polo again this year.<br />\nA performance of \"Everyman\" was given in the College Chapel at Vassar<br />\nby the Elizabethan Stage Society of London.<br /><br />\nTHI<br /><br />\n14<br /><br />\nNEWS-LETTER.<br /><br />\nThe proposition of increasing the number of yards to be gained in four<br />\ndowns from five yards to ten is being agitated among western colleges. The<br />\nobject of the ruling is to increase open work and decrease mass plays.<br />\nThe class of temporary politics at Princeton has been organized into a<br />\nchamber of deputies, modeled exactly after the French chamber. The Seniors<br />\nconstitute the conservative and the Juniors the radical element. The ministry<br />\nhas been chosen from the conservatives.<br /><br />\nVALUABLE ADDITION TO THE STROUSE SEMETIC LIBRARY.<br />\nHROUGH the generosity of Mr. Leopold Strouse the Strouse Semetic<br />\nLibrary has been enriched by a collection of books that will give to this<br />\ndepartment of the University the most valuable library of the kind in<br />\nthe country. The Strouse Semetic Library was founded about six years ago by<br />\nMr. Strouse, who has been making additions to it from time to time. The<br />\npresent donatiOn is, however, the most generous ever made, and its benefits to<br />\nthe department, and to the University in general cannot be overestimated. Mr.<br />\nStrouse recently learned that the library of Mr. S Schwartzberger, a prominent<br />\nHebrew scholar of New York, was on sale, and he commissioned Dr. Rosenau,<br />\nFellow by courtesy in Semetic languages, to go to New York and examine the<br />\nlibrary with a view of purchasing the most valuable volumes. Dr. Rosenau<br />\nfound that the library contained many rare and valuable works, which he<br />\npromptly secured. The new books, which number about 1500 volumes, many<br />\nof them out of print, embrace all phases of Hebrew literature, including philosophy, poetry, history, biography, legal enactments, and natural sciences. The<br />\ncollection arrived at the University several days ago, and is now being catalogued. Public formal announcement of the gift will be made on Commemoration Day.<br /><br />\nZ;<br /><br />\nOILY OZZY'S ORIGINAL ODDITIES.<br />\nIII. ANASTASIA'S ANTICS.<br />\nAnastasia ate arsenic<br />\nTo see if %would really make her sick.<br />\nPapa looked up from where he sat,<br />\nAnd remarked, \"I thought she'd more sense than that.\"<br />\nIV<br /><br />\nBREEZEY BEATRICE.<br /><br />\nBeatrice burned out her sister's eyes<br />\nAnd mamma, evincing her great surprise,<br />\nSaid, \"I s'pose now it's no use to dwell upon it,<br />\nBut really I wish you hadn't done it.\"<br /><br />\nTHE NEWS-LETTER,<br /><br />\n15<br /><br />\nA DESSERTATION ON SONNETS.<br />\nHE Poet tried to slip past the barber shop, but it was no use. He paused<br />\nto read the sign in large letters which read, \"No Smoking—By Ladies.\"<br />\nThe pause was fatal. The Objector dragged him in, and stood him up<br />\nhefore the group of amateur sonnet writers.<br />\n\"You are an imposter, sir!\" said the Captain of the Supes. \"It is not<br />\nhard to write a sonnet; even I, myself, have done it.\" Overlooking the concealed rhyme the Poet made answer.<br />\n\"You write a sonnet! You couldn't write an obituary notice of the class<br />\ngames.\"<br />\n\"But I did, I was inspired.\"<br />\nThe Bugologist whispered to Mister Dinklebender that he knew to a pint<br />\nhow much was needed to inspire the Captain of the Supes.<br />\n\"Did you use the same words I used ?\"<br />\ndid, and I have written a sonnet about the sea. Please don't get sea.<br />\nWith this parting remark the Captain of the Supes recited a sonnet<br />\nentitled:<br />\nWILLIE<br /><br />\nAND HIS YACHT.<br /><br />\nThere is a charm in sailing which doth steal<br />\nOn summer days into the sailor's heart.<br />\nThere in his cosy yacht he feels apart<br />\nFrom the more vulgar herd. He can unseal<br />\nHis champagne basket for his friends and feel<br />\nAs each cork pops that they've made such a start<br />\nThat every man will likely need a chart<br />\nWhen he gets home, the key-hole to reveal.<br />\nboor by a long experience cloth he learn<br />\nAssistance he requires when it's half past<br />\nThe hour of three, the cop will be his guide<br />\nAs homeward he's attempting to return.<br />\nWhen on the hat-rack all his clothes he's cast<br />\nBy Bromo-Seltzer is he purified.<br /><br />\n\"There is certainly a personal flavor over it all,\" was the comment of<br />\nthe Fusser, \"almost as much as in my own, which—ahem!—is not at all bad.\"<br />\n\"I wish that policeman had the beat up our way,\" mused the Objector as<br />\nhe cast a reminiscent wink in the direction of the Poet.<br />\nThe Bugologist could be restrained no longer. From his breast pocket he<br />\ndrew a soiled piece of yellow paper upon which appeared the picture of a man<br />\n(labeled canvasser for funds for team) sitting upon a youth (labeled freshman).<br />\nThe modesty which he acceded to the solicitations of the Angry Mob showed<br />\nplainly that he was not used to the role he was playing, but he bluffed the part<br />\nwith a certain air of cunning assurance.<br />\n\"I have here a sonnet,\" he said, \"prepared according to the rules of the<br />\ncontest, which deals not only with the athletic situation, but is a picture of<br />\nwhat is bound to happen before the debating teams goes to North Carolina. It<br />\nis entitled:<br /><br />\n16<br /><br />\nTHI NEWS-14F,TTER.<br />\n\"THE MAN WE xNow.\"<br />\nThere is a man who doth delight to steal,<br />\nA smile upon his face, guile in his heart,<br />\nInto our pockets and abstract a part<br />\nOf our too-hard earned cash He doth unseal<br />\nOur pocketbooks, and in them he doth feel<br />\nFor our spare change, although we stare and start<br />\nAnd ask him if he's sl eering by a chart;<br />\nNot till we're fleeced doth he the plot reveal.<br /><br />\nHe is a college canvasser we learn,<br />\nA dread subscription fiend with blackest past;<br />\nFor college men he claims to be a guide.<br />\nHe prongs our dough, and there is no return;<br />\nlilt') a pool for athletes it is cast<br />\nAnd thus are our athletics purified.<br /><br />\nThe effusion was greeted with three groans by the Angry Mob. The Bugologist was not disconcerted in the least. He carefully put away his manu—<br />\nscript, and remarked that his sonnet ought to take the blue ribbon, the gold<br />\nmedal, and a few other et ceteras<br />\nThe Fusser could restrain himself no longer. \"I've done it,\" he shouted.<br />\n\"Done what ?\" the Chief Supe was polite enough to ask when he saw that<br />\nno one else happened to be listening.<br />\n\"Written a sonnet. The moon was full, I was—well, the inspiration<br />\nseized me. It is entitled<br />\n\"TO AM A RYFLIS.\"<br /><br />\nWhen brightly beams the moon I love to steal<br />\nBeneath thy window, sweet, and there my heart<br />\nIn ecstacy doth beat.— — —<br /><br />\nThe Fusser looked around, saw that he was alone, and departed sorrowing.<br />\nAn hour later Walter was seen to emerge from the coal cellar. The Angry<br />\nMob spent the afternoon recuperating 'neath the shade of the sheltering palms.<br /><br />\nHow He Won Her.<br />\nIce cream he bought his darling,<br />\nAnd she ate, and ate, and ate;<br />\nTill at last her heart she gave him,<br />\nTo make room for one more plate.<br />\n—Lampoon.<br /><br />\nI.<br />\nHer cheeks are round with the softening slope<br />\nOf a delicate flower's most graceful curve;<br />\nHer delicious chin (it is dimpled in!)<br />\nIs as rounding as beauties deserve.<br />\nHer glorious form is a Mellow delight<br />\nOf ellipses, parabolas wondrously fair;<br />\nI ask as I gam at her circulars ways,<br />\nWill the well-rounded treat me square?<br />\n—The Occident.<br /><br />\nOPEN ALL NIGHT<br /><br />\nWILLIAXSON 0 WATTS,<br />\n.,3D rug Ztorcs,„<br />\nBaltimore and Eutaw Streets.<br /><br />\nHocward and Ftlanklin Streets.<br /><br />\n\"(Eater.<br />\n.VrtIcw, Saucy, (Boobs. perfunierp, Collet ?Article, Ctoare, Sam<br /><br />\n(<br /><br />\nTHE CHEAPEST PLACE<br />\nIN HAI:11,110HE FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber floods, Olass Ware,<br />\nStudents Sundries<br /><br />\nH. S. WRIGHT &amp;-<br /><br />\nI'. 'Phone 3350- .4,111<br /><br />\nHENRY N. BRUNS,<br />\n111-it \\vino ,,A,tt.crj,tis,<br />\n.'\\.I heill.t it di<br /><br />\n1,(1<br /><br />\nN.<br /><br />\n)<br /><br />\n'H., (J./<br /><br />\n,A!itn I for<br /><br />\nHenderson's<br /><br />\n-Your inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br /><br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\nIn<br /><br />\n. I 1,`\\&lt;<br /><br />\n1.exinuton wel 1.ibc1.1%<br /><br />\n704 MADISON AVE.<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nMadison<br />\nStudents' Supplies,<br /><br />\neg Howard Sts.<br /><br />\nvorporaled I $i s<br /><br />\n\"ti's StfonA<br /><br />\nas the Steonskest.\"<br /><br />\nTiftE FIDELITY MUTUIIL LIFE INSUIVINGE<br /><br />\nOF PI-PILA.DEL.P111/1..<br />\nInsurance for TILE<br />\nAN EX()ELLEN T OPPORTUNITY is offered Students and Teachers to write<br />\nFIDELATY, either during vacation or permanently.<br />\nFor Agency in Mxryland or West Virginia,<br /><br />\n-<br /><br />\nAddress,<br />\n4:KA11.4.11, Man8ger<br />\n8068 Merchants Bank Bldg., lialtlumre.<br />\n•<br /><br />\nFor Ad \\•ertising Sp... iii Otis Paper<br />\n.11)111.1\"Ill<br /><br />\n\"(0<br /><br />\n//r)<br /><br />\n.:L.›orrri-m(<br />\ns<br />\nLom BARD tIr.<br /><br />\nzw.e,<br />\n, Afteort<br />\nNO,<br /><br />\nT.,<br /><br />\n11AE:<br /><br />\nPUBLISHERS.<br /><br />\nMt)<br /><br />\n,<br />\nT-<br /><br />\nCog $300,000. SOUS and Undiwidul P10111 $400 000<br /><br />\nSTIEFF PIANOS<br /><br />\nDrovers &amp; Mechanics Nat'l Bank,<br /><br />\nMONEY<br />\nMADE Or THE BENI' MATERIA1.M<br /><br />\nOF BALTIMORE.<br />\nAND 14:XPEIRIENUE CAN<br />\nWALICIOLMOMNI<br /><br />\nliUY.<br /><br />\nI)<br /><br />\nN. LI BERTY ST.<br /><br />\nrs<br />\nGUSHING &amp;GOMPRNY,8Botaotkiselle<br />\noners.<br /><br />\nand<br /><br />\n1. Strouse, Vice-Prest.<br />\nEdw. P. Hayden. Asset enahlAr.<br /><br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p, r year and upward.<br /><br />\n34 W. BIALTIMORE STREET.<br />\nand Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\ni*<br />\ntt,<br />\nCollege of Baltimore.<br />\nSTPITIOMBRY—For School, Pamily, Office and Bank.<br /><br />\n. School, Law, Medical, Classical<br /><br />\nHaberdashers,<br />\nShirts, Neck!' wear,Underwear<br />\nHosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.College<br /><br />\nTHOS.BLAKE CO<br /><br />\nOn Sale The .1. 11. lJ. Pennants, aid all other<br />\nPennants.<br /><br />\n219 EAST BALTIMORE ST.<br />\nA H. FETTING,<br />\nMANU,ACTUMER<br /><br />\nJas. Clark, Prod<br />\nChas. 8. Miller, Cashier.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON,<br />\nFOR<br /><br />\nJORDAN STRBI,Ell GO.<br /><br />\n.45V .<br />\n11StOoN70<br />\nM A710<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Brandy--no adulterants,lio coloring, line quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\n(Hive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK,<br /><br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br /><br />\nOf<br /><br />\nOreek letter fraternitv aewetrp,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\ng.<br />\nPlease Call anb Examine our tine iBcfore Purchasin<br /><br />\nRecounts Solicited.<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n'BALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial \"Discount to Students.<br />\nC. &amp; P. telephone 445-g.<br /><br />\nLibraries arranged and put in<br />\norder without removal. if or<br /><br />\njENNINGS tit HORSEY,<br /><br />\n\"get R UZICKA<br /><br />\nM ERCHAN91.` TAILOHN,<br />\n21 %V. F&amp;y syrTE<br /><br />\nSTIt alt'1`.<br /><br />\n0;-<br /><br />\nBOOKS ! I<br />\n-11ANDII<br />\nSECOND<br />\nand Miscellaneous,<br />\nSchool, Medical<br />\nBought, Sold and<br /><br />\nExchanged.<br /><br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EUTRAN ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br /><br />\nJ. H. U. Binder.<br /><br />\nBoo/binder,<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO. WARNER.<br /><br />\nWARNER 6c CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nA<br />\nManufacturers of<br />\n1-f<br />\nSilk and Caasimere Hats. IP'<br /><br />\nHopkins Caps<br /><br />\nV,<br /><br />\n60<br />\nS.<br />\nS.<br />\nYD<br />\nLLO<br />\nMAN<br />\nNORTH GER<br />\n.<br />\nRATES<br />\nLOW<br />\nAT<br />\nGE.<br />\nCABIN IliSSR<br /><br />\n•<br /><br />\nGenoa, etc.<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples,<br />\n.<br />\nDIRECT<br />\nBRDIEN<br />\nTO<br />\nBfiLTIMORE<br /><br />\nIPor particulars<br /><br />\n11. SGIWAVIGHER &amp; GO., General Rants.<br /><br />\nappluto<br /><br />\nJAS. MEIKLE, VICE<br />\nISAAC H. DIXON. PPICST.<br />\nJAS. R. RICHARDS. TREAS.<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\nBaltimore, Md.<br /><br />\nSmith, Dixon Co.<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36253, "display": null, "description": null, "target_type": "file", "target_uuid": "b7e12f55-5903-4e60-9ed4-3eb85648f0f9", "url": "http://digital.library.jhu.edu/system/files/2022-03/12232-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12232, "target_type": "node", "target_uuid": "ee67043a-9122-4ecf-9d26-13dd0046c160", "url": "/node/12232"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0f0d1dba-74d0-49f4-aa1f-4af2b3a8d67d"}]}