{"mid": [{"value": 37833}], "uuid": [{"value": "aa379f26-6956-4ebb-badd-e36c6728db21"}], "vid": [{"value": 37833}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:40:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12401-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:40:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:40:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MEMBER OF THE<br />\n<br />\nINTERCOLLEGIATE<br />\n[<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nOltt<br />\n<br />\nEdgar Blumstein Is Elected<br />\nBusiness Manager Of<br />\nNewspaper<br />\nLEVIN APPOINTED<br />\nADVISORY EDITOR<br />\nLangfeld And Perlmutter<br />\nAre Elected Managing Editors<br />\nFollowing the clearing up of a<br />\ndifficulty which from the start<br />\npromised to culminate in undesirable complications, Norman S.<br />\nHeaney, at a meeting held Wednesday, was elected editor-in-chief of<br />\nTHE NEWS-LETTER for the term<br />\nMarch, 1933, to March, 1934.<br />\nTwo days prior to the election,<br />\nHyman Levin, who retires from the<br />\nhead of the paper today, definitely<br />\nstated his intention of not seeking<br />\nre-election and signified Heaney as<br />\nhis choice for the editorship.<br />\nOthers Elected<br />\n<br />\nPrice, 5 Cents<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FRIDAY, MARCH 3, 1933<br />\n<br />\nVol. XXXVII, No. 28<br />\n<br />\nHEANEY NAMED<br />\nEDITOR-IN-CHIEF<br />\nOF NEWSPAPER<br />\n<br />\niqopkitts Nrtus-Erttrr<br />\n<br />\nMusical Club To Present<br />\nConcert At Atlantic City<br />\nWill Appear At Hotel Chalfonte-Haddon Hall Next Saturday In Second Appearance At Resort; Group Has<br />\nPresented Eight Concerts This College Year<br />\n<br />\nDRAMA GROUPS<br />\nTO MEET HERE<br />\nON APRIL 15<br />\n<br />\ntions for rendition by the Blue Jay<br />\nOrchestra and by the Glee Club.<br />\nPurpose Of Conference Is<br />\nDiscussion Of Current<br />\nReporting upon the financial condition of the club following a seaProblems<br />\nson's operations, J. Milton Smith,<br />\npresident of the organization, ex- FIRST OF ITS TYPE<br />\nEVER TO BE HELD<br />\npressed gratification with the success achieved. Expenses have been<br />\nkept within the budgetary limits Seven Colleges Accept Inviprescribed by the Student Activities<br />\ntations To Date; ProCouncil, and it is hoped that a small<br />\ngram Being Planned<br />\nmargin will be cleared as a nucleus<br />\nA conference composed of the<br />\nfor next season.<br />\nrepresentatives and directors of the<br />\nReputation Wide, Said<br />\nThe local reputation of the club various college dramatic organizahas been growing, and officials of tions throughout the state, the first<br />\nthe club have stated that this has of its kind to take place, will be held<br />\nbeen one of the best seasons. It is on Saturday, April 15, at the Johns<br />\nPerformance Good<br />\nprobable that next year's schedule Hopkins Playshop.<br />\nThe purpose of this conference,<br />\nComments on the performance of will include several new concerts, it<br />\naccording to Dr. N. Bryllion Fagin,<br />\nthe various groups in the club have was said.<br />\nbeen distinctly favorable. The quarAt the annual banquet, which will director of the Playshop, will be to<br />\ntet and Banjo Club drew hearty ap- be held following the Atlantic City provide an opportunity for the displause from a well-filled house at the trip, election of officers will take cussion of problems affecting colhome concert. The audience was place. Arrangements for the af- lege dramatics. The need for such<br />\nparticularly receptive of Osmar P. fair will be made public later, Smith discussions, he said, has long been<br />\nfelt.<br />\nSteinwald's arrangements of selec- I said.<br />\n<br />\nFulfilling its final engagement of<br />\nthe 1932-33 season, the Musical<br />\nClub journeys to Atlantic City on<br />\nSaturday, March 11, where it will<br />\nappear at the Hotel Chalfonte-Haddon Hall. This is the second time<br />\nthat the club members have been<br />\nguests of the Hotel.<br />\nTo date the club has presented<br />\neight concerts, both in and out of<br />\nthe State. Public appearances have<br />\nbeen made at five churches in the<br />\ncity, and at Wilson College, Chambersburg, Pa., Maryland College for<br />\nWomen, Lutherville, and at the<br />\nMaryland<br />\nCasualty Clubhouse,<br />\nwhere the annual home concert and<br />\ndance were held last Friday.<br />\n<br />\nCLASS MEMBERS<br />\nPLEASE PAY<br />\nCLASS DUES NOW<br />\n<br />\nDr. Karl Herzfeld To Present Illustrated Lecture<br />\nAt Assembly<br />\nDr. Karl Herzfeld, professor of<br />\nphysics, will present an illustrated<br />\nlecture on \"Colleges and College<br />\nLife In Germany\" at the assembly<br />\nnext Thursday.<br />\nAccording to William H. Triplett, president of Student Council,<br />\nthe assemblies for March 9 and<br />\nMarch 16 will feature Dr. Christie<br />\nand Dr. Broadus Mitchell, associate<br />\nprofessor of political economy. The<br />\ntopics of their talks have as yet not<br />\nbeen announced.<br />\nPi Delta Epsilon, national honorary journalistic fraternity, will<br />\nhold its annual public initiation,<br />\nApril 6. A prominent journalist<br />\nwill be secured as the principal<br />\nspeaker. Tau Beta Pi and Omicron<br />\nDelta Kappa, engineering and active<br />\nhonorary fraternities, respectively,<br />\nare to also publicly initiate at the<br />\nsubsequent assemblies in April.<br />\n<br />\nTulane,HopkinsTo<br />\nDebate Here At<br />\n4 P.M. Today<br />\n<br />\nDR. VAN ORMAN<br />\nCALLS MEETING<br />\nOF STICKMEN<br />\nWants To Get Acquainted<br />\nWith Lacrosse<br />\nSquad<br />\nVETERANS WILL<br />\nREPORT TODAY<br />\nNew Candidates To Meet<br />\nNext Monday At<br />\n4 P. M.<br />\nAll members of last year's larrosse squad are urged by Coach<br />\nRay Van Orman to appear at<br />\nHomewood field this afternoon at 4<br />\np. m. New candidates should report at Homewood on Monday at<br />\nthe same time.<br />\nThe main purpose of this plan is<br />\nto permit the coach to learn what<br />\nold and new material is on hand,<br />\nand to dole out equipment more efficiently. By these arrangements<br />\npractice also will get under way<br />\nmore quickly.<br />\nEarly Practice Essential<br />\n<br />\nA debate between Tulane UniverThough the team's first scheduled<br />\nOthers who were elected to board<br />\nsity of New Orleans, Louisiana, and<br />\nconference<br />\na<br />\narranging<br />\nthis<br />\nIn<br />\ngame<br />\nwill take place April 8 against<br />\nof control posts are: Edgar BlumJohns Hopkins is to be held today<br />\nquestionnaire<br />\nwas<br />\nsent<br />\npreliminary<br />\nthe<br />\nAlumni<br />\nClub, Coach Van Orstein, business manager; Millard<br />\nin all Mary- in room 108, Gilman Hall, at 4 man believes holding practice at<br />\nunits<br />\nto<br />\ndramatic<br />\nthe<br />\nLangfeld, Jr., and Martin Perlmut\"Resolved,<br />\nland colleges, the purpose of this p. m. on the subject,<br />\nsuch an early stage is essential to<br />\nter, managing editors; Richard<br />\nlegislashould<br />\nenact<br />\nThat<br />\nCongress<br />\nset a convenbeing<br />\nto<br />\nquestionnaire<br />\nFeise and Philip P. Hamburger, asof the promotion of a squad as compeient date for the conference and to tion for the centralized control<br />\ntent as last year's. Likewise, the<br />\nsistant managing editors; Bert Gordetermine the points of greatest in- industry.\"<br />\npossibility of unfavorable weather<br />\ndon, office manager; Ray Goldberg,<br />\nterest to these organizations. The The Hopkins team, composed of conditions in March will not appear<br />\nadvertising manager; Charles HasFinal Selection Of Orchestra Prominent Speakers Are To results of the questionnaires fixed Charles Squire, a junior, and Abner too detrimental to the squad's detings, circulation manager.<br />\nTo Be Made By<br />\nTalk Before Intercolthe date as April and embodied the Willen, a sophomore, will uphold velopment.<br />\nAt the request of Heaney, the<br />\nNext Week<br />\nlegiate Meet<br />\ntopics of play selection, play pro- the affirmative side of the question.<br />\nAt present the possibility of<br />\nboard of control of the paper apA Hopkins debate team repreduction and casting in the program.<br />\npointed Levin advisory editor-inproducing<br />\na team as powerful as last<br />\nAPRIL 22 IS DATE<br />\nFOUR SESSIONS TO BE Seven colleges have accepted the sented by Jerome Blum and S. Raychief, an honorary position given to<br />\nyear's<br />\nOlympic<br />\nrepresentatives apSET FOR AFFAIR<br />\nHELD IN LEVERING invitation to attend this conference mond Dunn will meet the team of<br />\nrecognihead<br />\nin<br />\nthis year's retiring<br />\nthe University of Dayton, of Day- pears doubtful. Among the attack<br />\nto date, several of these asking if<br />\ntion of Levin's work since October,<br />\nEddie Duchin, Ozzie Nelson, Villard, Blanshard, Barnes, they could bring large groups with ton, Ohio, on the subject dealing men missing are former Cap1930. The advisory editor will be<br />\nwith war debts. Blum and Dunn tain Jack Turnbull, Guild and DarKeezer, Are Among<br />\nTed Weems, Being<br />\nthem. The others showed great ena non-voting member of the governwill support the view that war rell. On the defense, the loss of<br />\nConsidered<br />\nSpeakers<br />\nthusiasm in their answers.<br />\ning board and will serve as an edigoalie Fritz Stude, Kneip, and Moss<br />\ndebts should not be cancelled.<br />\nSeven Colleges Have Accepted<br />\ntorial adviser to THE NEWS-LETTER<br />\nwill also be sorely felt.<br />\nthe<br />\nDebate<br />\nThe subscription price to the<br />\nSquire is president of<br />\nProminent national and local figexpect<br />\nwho<br />\ncolleges<br />\nfar,<br />\nthe<br />\nSo<br />\nstaff.<br />\nUnder such circumstances, there<br />\nAssociation which was reorganized<br />\nJunior Prom which is to be held ure are to participate in the fifth anFaced By Unique Situation<br />\nLoyola,<br />\nare:<br />\nrepresentatives<br />\nsend<br />\nto<br />\nbe plenty of room for compewill<br />\nBoth Blum and<br />\nApril 22 at the Alcazar has been nual Intercollegiate Liberal Confertwo years ago.<br />\nFaced by the unique situation reduced to $2.20, tax included, it ence which is to be sponsored by the Blue Ridge, Western Maryland, Dunn, who debated against the tent players; and Coach Van Orwhich made four juniors eligible for was announced by J. M. Scott, chair- Liberal Club of the Johns Hopkins State Normal of Salisbury, State University of Pittsburgh last month, man is anxious for all aspirants to<br />\nMaryland Col- are members of the editorial staff appear as quickly as possible.<br />\ntwo major positions on the editorial man of the committee.<br />\nUniversity, March 10 and 11. The Normal of Towson,<br />\nThe- of THE NEWS-LETTER.<br />\nWestminster<br />\nWomen,<br />\nfor<br />\nlege<br />\nboard, it was found necessary to<br />\nAdopt New Plan<br />\ntheme of the conclave is to be<br />\nHopkins.<br />\nand<br />\nSeminary<br />\nological<br />\nelect two managing editors instead<br />\nA decision was reached by the \"Ways Out—Guides Through EcoGregory Is Co-Author<br />\nof the customary one. When the committee at its meeting this week nomic Chaos.\"<br />\nA tentative program has been al- Production Of Daily NewsOf Engineering Paper<br />\npaper returns to a semi-weekly ba- to give to members of the Junior<br />\nFour sessions will be held in Lev- ready planned. From 9:00-10:00<br />\nPaper Depicted-In Film<br />\nsis next fall, Langfeld and Perlmut- Class who have paid their class dues ering Hall, one on next Friday and a. m. there will be held a period for<br />\nJohn H. Gregory, professor of<br />\nPresented By \"Sun\"<br />\nter will be in charge of one issue one free ticket to the Prom pro- three on Saturday. The first meet- registration of delegates, followed<br />\ncivil and sanitary engineering at the<br />\neach. Subordinate to each manag- vided those juniors sell two tickets ing will be held at 8 p. m., March by addresses of welcome by PresThe various activities incident to<br />\nHopkins, is the joint author with<br />\ning editor there will be an assistant to the dance. At the same time as 10. The second, third, and fourth ident Joseph Ames, Dr. John C. the production of the daily newspaRobert A. Allton and James H.<br />\nmanaging editor.<br />\nit announced this move the com- meetings are scheduled for March French, Chester A. Morrow, and per were depicted in motion pictures Blodgett, both of Columbus, Ohio,<br />\nelection,<br />\nCommenting on the<br />\npresented at yesterday's assembly<br />\nmittee issued a plea for cooperation 11 at 11 a. m., 2 p. m., and 8 p. m. Elmer Greensfelder.<br />\nof a short paper published in Civil<br />\nLevin said yesterday:<br />\nThe Sun. A crowd which overby<br />\nSpeak<br />\nTo<br />\nSpencer<br />\nDr.<br />\nof all members of the Junior Class<br />\nAmong Speakers<br />\nEngineering,<br />\nvolume three, FebruLevin Comments<br />\nFrom 10:30-12:00 an address will taxed the hall's capacity attended.<br />\nas well as of the three other underary, 1933, entitled \"Holding-Down<br />\nAmong<br />\nwill<br />\napthe<br />\nspeakers<br />\nwho<br />\n\"The election of Heaney to the graduate classes at the Johns HopHenry Edward Warner, veteran<br />\nbe given on \"Plays for the College<br />\nPower of Concrete Piles—Results<br />\npear before the conference are Paul<br />\neditor-in-chief of the campus news- kins. An effort is being made to<br />\nTheatre\", by Dr. Hazleton Spencer, Sun newspaper man, explained porof Tests Made at Columbus, Ohio,<br />\nthe<br />\nBlanshard, college director of<br />\npaper is undoubtedly, for several make the Prom the best ever spontions of the film.<br />\n(Continued on Page 3, Col. 2)<br />\nSquare Precast Piles with Paron<br />\nLeague for Industrial Democracy;<br />\nreasons, the best thing that could sored by the third year class at<br />\nallel<br />\nSides.\"<br />\nthe Hon. Paul John Kvale, Farmer(Continued on Page 2, Col. 2)<br />\nHomewood, according to reports.<br />\nLabor member of Congress; Dr.<br />\nFinal Selection Soon<br />\nCharles 0. Hardy, economist in the<br />\nIt was definitely stated by Scott<br />\nBrookings Institute; J. B. S. Hardand Don Kelly, president of the<br />\nman, editor of the Advance.<br />\nJunior Class, that final selection of<br />\nHarry Elmer Barnes, former pro- Alan Mosely, Graduate Student In Zoology, Describing<br />\nthe orchestra for the affair will be<br />\nDr. Julius Petersen, professor of<br />\n\"The Contemporary Educational made by next week. The selection fessor of sociology at Smith ColExperiences In Letter To Dr. Andrews, Says He<br />\nliterature at the University<br />\nGerman<br />\npresident<br />\nMovements Abroad\" is the general will be made from the following lege; Albert D. Hutzler,<br />\nShoots Rabbits And Catches Fish For Food<br />\nAssociation<br />\nof<br />\nof Berlin, and president of the<br />\nsubject of a series of lectures to be three bands: Eddie Duchin, playing of the Baltimore<br />\nHardships encountered in Siberia boat did not leave until May, he Goethe-Gesellschaft, began his lecpresented during this semester by at the Central Park Casino; Ozzie Commerce; Oswald J. Villard, ediDr. Isaac Leon Kandel, professor of Nelson, now featured at the Hotel tor of the Nation; R. M. Boickel, while making studies of snails was forced to travel by sled so that tures in three courses in the School<br />\neducation and associate in the In- New Yorker; and Ted Weems, director of the Editorial Research found near the Angara River, were he might be in the neighborhood of of Higher Studies, Wednesday. He<br />\nternational Institute, Teachers' Col- whose band is providing the dance Reports; Dexter M. Keezer, of the described by Alan Mosely, a grad- the Angara River when the ice<br />\nis here under the auspices of the<br />\nstaff of The Sun; and uate student of zoology at the Hop- melts.<br />\nlege, Columbia University.<br />\nmusic at present at the Hotel Penn- editorial<br />\nDonald Henderson, economist in the kins, in a recent letter to Dr. E. A. The object of this expedition is James Speyer Visiting ProfessorThe course, given in the School sylvania.<br />\nColumbia University.<br />\nAndrews, professor emeritus of zo- to compare the snails of Siberia with ship for 1932-33.<br />\nof Higher Studies in Education, is<br />\nCommittee Plans Publicity<br />\nOn<br />\nList<br />\nBarnes,<br />\nVillard<br />\nthose of the northwestern section of<br />\nology.<br />\nAn extensive publicity campaign<br />\ndesigned to acquaint American stuThe courses are: Methodology of<br />\nprovisions<br />\nsome<br />\nCanada. For the last five summers Literary Criticism, The German<br />\non<br />\nAlthough<br />\nhe<br />\ntook<br />\nMr. Blanshard has appeared<br />\ndents with the more significant edu- will be conducted under the direccational developments in foreign tion of Hyman Levin a member of the Hopkins campus several times in along, Mr. Mosely shoots rabbits prior to 1931, Mr. Mosely traveled Classical Drama, and The Contemcountries, especially China, Mexico, the Junior Prom committee. Others the past three years. Dr. Barnes is and catches fish for his food. He to the Rocky Mountain region of<br />\nporary German Novel.<br />\nItaly, and Russia.<br />\non the publicity group of the com- well-known, especially for his ar- lives in a small skin but with only Canada to study snail life there.<br />\nThis visit was made possible by<br />\n- Dr. Kandel has been a member mittee are Gardiner Hill, Robert ticles which are syndicated through- one of the natives, whom he hired Late in that year, he was awarded<br />\nof the Columbia University faculty Powell, Buck Tayman, and Henry out the country by Scripps-Howard. to take care of the boats, as a com- the Rathbun Fellowship, which had the establishment of a professorship<br />\nbeen established to promote the by James Speyer, who donated<br />\nsince 1923. He received his A.B. Beeler. The class officers, Kelly, Both Mr. Villard and Mr. Keezer panion.<br />\nVoyage Described<br />\nstudy of the geographical distribu- $50,000 to \"invite yearly a profesin 1902, his M.A. in 1906 at Man- Ted Stern, and Mike Cohen, to- are nationally noted for their ediLeaving Edinburgh, Scotland, tion of animals in foreign countries.<br />\nchester, and his Ph.D. at Columbia gether with Scott, committee chair- torial work.<br />\nsor from a German University for<br />\ncolnearby<br />\nwhere<br />\nhe had been this winter, the This award expires at the end of<br />\nmany<br />\nfrom<br />\nStudents<br />\nmost<br />\nrecent<br />\nhis<br />\nin 1910. Among<br />\nman, are in charge of the sale of<br />\ntwo months or more,to come in conbooks are \"Essays in Comparative tickets and the arrangements for the leges are eypected to attend the an- zoologist traveled to Russia. Here 1933.<br />\nIn 1928, Mr. Mosely was award- tact with the students and profesnual conference. In the past, it was his progress was hindered since he<br />\nEducation,\" \"History of Secondary orchestra.<br />\npermit<br />\nfrom<br />\nthe<br />\nhas<br />\ned<br />\na B.S. degree from the Univer- sors, not necessarily to give a regconclave<br />\nobtain<br />\na<br />\nfirst<br />\nhad<br />\nto<br />\nClub<br />\nLiberal<br />\nA sponsor for the Junior Prom said, the<br />\nEducation,\" and \"Reorganization<br />\nthe<br />\non Page 4, Col. 5) ular course of lectures.\"<br />\nBecause<br />\n(Continued<br />\nGovernment.<br />\nsuccess.<br />\nSoviet<br />\nproved of interest and<br />\nof Education in Prussia.\"<br />\nis to be chosen soon.<br />\nQuestionnaire Sent Out<br />\n<br />\nJUNIOR PROM TICKET LIBERAL CONCLAVE<br />\nIS SET AT $2.50 BY IS SCHEDULED FOR<br />\nDANCE COMMITTEE MARCH 10-11 HERE<br />\n<br />\nCOLUMBIA PROFESSOR<br />\nIS LECTURING HERE<br />\n<br />\nHardshipsHinderHardyHopkins<br />\nStudent Seeking Siberian Snails DR. J. PETERSEN WILL<br />\n<br />\nGIVE THREE COURSES<br />\n<br />\n\f2<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 3, 1933<br />\n<br />\nUbe 71/ewsoletter Dr. G. Gruenbaum<br />\n<br />\nINTERCO<br />\n<br />\nLLEGIATE<br />\nCAMIDUS<br />\nSubscription per year<br />\n$2 00<br />\nBy<br />\nRemit subscription fees to John Myers, treas- Is<br />\nNEWS<br />\nUIRIEVITIEff<br />\nurer, Student Activities Council, Gilman Hall,<br />\nBy MILLARD LANGFELD, JR.<br />\nPostoffice, Johns Hopkins University.<br />\nAn ambitious student at the University<br />\nUnfolding the sophisticated and de- as much at home behind the footlights as<br />\nEntered as second-class matter<br />\nJack Dempsey<br />\n3,<br />\n1909, at the Postoffice in Baltimore,December<br />\nMd., under<br />\nof Colorado worked his way through col- lightfully amusing story of the round- they are behind a microphone. Peggy<br />\nJack Turnbull<br />\nthe Act of Congress November 3, 1879.<br />\nthe-town adventures of a rich and typic- Healy, Paul Whiteman's latest feminine<br />\nan address delivered at the lege by washing 150,000 windows.<br />\nJack Henderson<br />\nally English young man of affairs, Spring discovery, puts over several popular<br />\nPublished semi-weekly from October to June, In<br />\n* *<br />\nexcept during examination and college holiday Playshop on Monday, Dr. Gustav<br />\nJack Sharkey<br />\nTime For Henry, the current stage hit numbers in great fashion, and one can<br />\nperiods by undergraduates of the Johns Hopkins<br />\nthe Maryland is ably living up to its readily realize why they call her \"The \"Jack\" Johnson—<br />\nUniversity.<br />\nGruenbaum, associate professor of The Catholic University Tower sug- at<br />\ngests the only way to end this depression reputation of being one of the most Personality Girl.\" Miss Healy possesses These boys will probably be all acquainted<br />\nMember of The Intercollegiate Newspaper As- Romance Languages, discussed the<br />\nclever comedies ever to emanate from a world of charm and ability.<br />\nwould be to repeal the law of gravity— the pen of Benn Levy,<br />\nsociation of the Middle Atlantic States and<br />\nthat talented and<br />\nThere are four other acts featuring with Promoter Jack Curley.<br />\nof The National College Press Association.<br />\nlife of Luigi Pirandello, eminent then everything would<br />\nwitty playwright.<br />\ngo up.<br />\n0-0<br />\ncomedy, songs, and acrobatics.<br />\nItalian playwright, in relation to its<br />\nWith the inimitable Henry Hull in the<br />\nThe screen feature presents Richard<br />\n• *<br />\nOffice phone<br />\nDame Rumor has it that there is a<br />\nUNiversity 7383<br />\nleading<br />\nrole and a<br />\nof unusual merit Dix in his latest success, \"The Great<br />\nEditor's home phone_____UNiversity 1379 reflection in his works.<br />\nIndiana University claims the record and suitability, thiscast<br />\npeculiarly brilliant Jasper, a comedy drama that depicts the couple of thousand dollars in the Treasof<br />\ncoca-cola<br />\nconsumption. About 2375 and penetrating farce is rounding out a life of a careless young Romeo who starts ury given by the Alumni for a squash<br />\nThe lecture was followed by one<br />\nBusiness communications should be addressed<br />\nto the Business Manager, Johns Hopkins<br />\nweek of consistent success and popu- out in life as a street car motorman, and court..<br />\nUni\"cokes\"<br />\nare<br />\ndispensed<br />\ndaily.<br />\nof Pirandello's one-act plays, \"The<br />\nversity. All articles and communications<br />\nlarity.<br />\nfinally ends up as the world's greatest<br />\nutining to the editorial department should per* * *<br />\n0--0<br />\nbe<br />\nWar a La Tracy<br />\nforwarded to the Editor-in-Chief, Johns Hop- Imbecile,\" the principal parts being<br />\nfortune teller. Dix is given grand supIn a questionnaire given to a class at<br />\nkins University.<br />\nWe suggest that George Packard inFeaturing Lee Tracy, well known star port in this picture by Edna May Oliver<br />\ntaken by Peter Weisengoff, Samuel the University<br />\nstall a mail box in his car.<br />\nof Oklahoma, Al Capone of many a Broadway stage and screen and Wera Engels.<br />\nSelsky, Mary Alvey, and Charles was the only name in a list of fifty that success, in the type of role just suited One of the most unique plays of the<br />\nEditorial Department<br />\n0-0<br />\nhis style and personality, Private present season will be shown in BaltiHirschfield. Miss Jane Hutzler di- was correctly identified by all the stu- for<br />\nEditor-in-Chief<br />\nJones opens at Keith's Theatre today.<br />\nBeta Doug Williamson crashes through<br />\nmore next week when the Vagabond<br />\nHYMAN LEVIN, '34<br />\ndents.<br />\nrected the presentation.<br />\nFilmed against a background of battle Players present Adding Machine, Elmer with a hit with the Black<br />\nand Blue Jay<br />\nManaging Editor<br />\n* * *<br />\nsets so realistic as to defy detection by Rice's stirring drama on death and the<br />\nNORMAN HEANEY, '34<br />\n\"Intercepted<br />\nLetters.\"<br />\nThe next activity of the Playshop<br />\nthe<br />\nmost<br />\nsearching<br />\nstudent<br />\nof affairs mil- beyond.<br />\nAssistant Managing Editors<br />\nAt the University of Giesson, Germany, itary, this production<br />\n0-0<br />\ntells the amusing<br />\nMARTIN PERLMUTTER, '34<br />\nwill be on March 10, when a lecture<br />\nVagabonds Shine<br />\nthe students do not hesitate to express tale of the beloved doughboy of the 'Ole<br />\nMILLARD LANGFELD, JR., '34<br />\nThe S. P. E.'s want to be identified as<br />\nFor 25 years Mr. Zero has worked<br />\non \"The American Theatre Today\" their opinion on a lecture. When the Bill type.<br />\nJunior Editors<br />\nfaithfully over the books of a tyrannical Sig Eps, but we claim that this sounds<br />\nRichard Feise, '35<br />\nDaddy<br />\nemployer, only to be dismissed—a victim<br />\nPhilip Hamburger, '35<br />\nwill be given by Dr. N. Bryllion students disagree they shuffle their feet; AccompaniedSugar<br />\nby gay music and bright of the machine age. In a despairing too much like a burp.<br />\nAssociate Editors<br />\nwhen they approve a round of applause songs, Broadway<br />\no—o<br />\nDad, current attrac- frenzy he commits murder and suffers<br />\nDonald Proctor, '33<br />\nFagin, the director. This will be prevails.<br />\nJ. Marion Grove, '33<br />\ntion at the New, tells the old, old story the extreme penalty at the hands of the<br />\nHy Levin's name figured so prominently<br />\nSanford Sarney, '33<br />\n* * *<br />\nof a Broadway butterfly who pays too state.<br />\nfollowed by a presentation of a onein the Blue Jay that some people conMordecai Edelman, '33<br />\nhigh to see her names in the bright bulbs<br />\nHis adventures after he has passed fused the magazine<br />\nIt<br />\nappears<br />\nas<br />\nthough<br />\nwith THE NEWSSports Editor<br />\nHarvard<br />\nnot only of this grandest of canyons. But it tells down the last mile and through that little<br />\nact play by Edward John KirschBernard Verlin, '33<br />\ntook a \"beating\" from Yale in football, it with a new twist and punch which is green door of the execution chamber form LETTER.<br />\nReporters<br />\nbaum.<br />\nbut in grammar as well. Before the game really original, and tells it well.<br />\nthe nucleus of an enthralling evening.<br />\n0—o<br />\nerome Blum, '34; Samuel M. Doctofsky, '34;<br />\nStanley Stillman, '34; S. J. Berkowitz, '33;<br />\nWith Joan Blondell, Ricardo Cortez,<br />\nA Daughter of Her People will remain<br />\nPreparations<br />\nYale<br />\nBuck<br />\nTaiman<br />\nare<br />\nhas<br />\nreceived<br />\nalready<br />\nunder<br />\nbeen criticized or<br />\nthe<br />\nfollowing<br />\ntelegram:<br />\nA. E. Gutman, '35; Sylvan D. Solarz, '35;<br />\nGinger Rogers, and a troup of some of at the Europa Theatre for another week,<br />\nE. R. Harrison, '35; Leonard Wallenstein, way for<br />\n\"The Harvard Athletic Association Hollywood's prettiest (and<br />\ncommended on his recent gigolo act out<br />\nthey<br />\npresentation<br />\nthe<br />\nmake<br />\n'ern<br />\nfullwhile on the same program a travel film,<br />\nof a<br />\n'36; Stanley E. Blumberg, '36; Abe Edelwishes you good luck in tomorrow's nice out there), Broadway Dad is guar- Jerusalem, The Holy City,, will provide in the Forest Park district.<br />\nman, '36; Irving Lottman, '34; Melvin<br />\nGoldberg, '36; Herschel Levin, '36; S. R. length comedy to be given in April. game. May the best team win.\" Yale anteed to shake you out of all those blues. pleasing support.<br />\n0-0<br />\nDunn, '33; Carson Frailey, '35; Carl<br />\nRhythm Boys<br />\nSuccesses And Orchids<br />\nman, '36; Leonard Paymer, '35; HartIt won't be long now before the politwired back: \"The Yale Athletic AssoFred<br />\nPaul<br />\nWhiteman's<br />\nBang, '36.<br />\nRhythm<br />\nwith<br />\nAnd before we go to sit before our<br />\nciation wishes you luck in tomorrow's Peggy Healy, are commandingBoys,<br />\nthe spot- bank and gaze wistfully at the door, we ical machinery- will get under way. Acgame. May the next better team win.\" light billing at the Hippodrome Theatre must throw an orchid to Mr. Harry tivity elections are scheduled for this<br />\nBusiness Department<br />\nFOUNDED 1897<br />\n<br />\n11-1 LAT IU V II CIA'S<br />\n<br />\nJ.H.U. Playskop<br />\nSpeaker<br />\n<br />\nBusiness Manager<br />\n<br />\n1VLNURICE R. CHASSIN, '33<br />\nAdvertising Manager<br />\nWM. N. MEYERS, '33<br />\nCirculation Manager<br />\nMORTON ROME, '33<br />\nOffice Manager<br />\nEDGAR BLUMSTEIN, '34<br />\nharIes Ney, '33: Abram Burk, '34; Leonard<br />\nHarris, '34; Harold Kantrow, '35; Irvin<br />\nBlum. '35; Bert Prager, '35; Bert<br />\nGordon,<br />\n'35; Ray Goldberg, '35 ; Allan Delevett, '36;<br />\nCharles Hastings, '36.<br />\n<br />\nHeaney, ,Blumstein<br />\nNamed To Chief<br />\nPosts On Paper<br />\n<br />\nthis week. Heard many times over the IIenkle of Ford's for Counsellor-At-Law, month.<br />\n*<br />\nair, as a feature of Whiteman's broad- one of the finest shows he has brought to<br />\nMen students at Columbia University casts, these four boys prove they are just that time-honored stage.<br />\napprove of fraternities as ideal places to<br />\nhang their hats, swell places for freshmen<br />\nto obtain advice, and they present the<br />\nway to political advancement.<br />\n<br />\n(Continued from Page 1, Col. 1)<br />\nhave been brought about. I am in Thirty Barnard girls nursed bruises<br />\nno position to definitely say whether after entertaining 100 frosh from Columbia University at a recent dance.<br />\nPrinted by<br />\nthe new head will carry on the ediH. G. ROEBUCK & SON<br />\n* * *<br />\n119 W. Mulberry St<br />\nBaltimore, Md. torial policies which have been folA lecturer on cowboy songs at Vassar<br />\nFRIDAY, MARCH 3, 1933<br />\nlowed since my election in March, College was drawn aside by eight girls<br />\n1932. But I can assure the cam- who stated that they did not think he<br />\nwas fair in having two lectures, one for<br />\nThe Editor's Farewell<br />\npus that Heaney will do what is best mixed audiences and one for male, and<br />\nFORTUNATELY, this publication and will<br />\nshow that he can handle the that they wanted his lecture for male auwill carry on as the official University<br />\ndiences.<br />\nnewspaper, beginning with today's issue, position to which he has been named.<br />\n* * *<br />\nunder the direction of a new, yet expe- I am ready to stick by him and the<br />\nAppropriate atmosphere was given a<br />\nrienced, editorial board consisting of four<br />\npaper throughout our senior year recent lecture held at Rio Grande Colmen who will be seniors next fall and<br />\nlege. The topic was on \"Love and Martwo who will be juniors. With this is- and for the remainder of our present riage\" and the lights<br />\nwere dimmed.<br />\nsue, the editor-in-chief, Hyman Levin, junior term.<br />\n* *<br />\nwho held this post since the close of his<br />\n\"Undoubtedly, Heaney will an- A Wisconsin professor has come to the<br />\nsophomore year, will turn over the leadership Of THE NEWS-LETTER to a new nounce his editorial platform within defense of the much-maligned practise<br />\nknown as \"cramming.\" He claims that<br />\nhead, Norman Heaney, who will indubit- the<br />\nnext two weeks. I am confident matter learned rapidly is retained better<br />\nably display his capability as director of<br />\nthat he will make every effort to than that gained after hours of applicathe publication.<br />\ntion.<br />\nRetirement from the head of such a carry on the splendid editorial spirit<br />\n* * *<br />\npublication as this at the close of one's of the paper.<br />\nAt Detroit University the students de-<br />\n<br />\njunior year naturally brings to one pangs<br />\nmanded that the number of co-eds be inExpresses Gratitude<br />\nof deep regret. But there is a consolation<br />\ncreased<br />\nor cut out entirely.<br />\nfor the retiring head, on this occasion, in \"My gratitude for the<br />\nkindness and<br />\n* * *<br />\nthat he has been kindly afforded the opportunity to do his part, as advisory edi- courtesy displayed by the board of<br />\nA student at the University of Washtor-in-chief, to which honorary post he control in its appointment of me to ington, who had flunked out and was pehas been appointed by the board of conthe honorary post of advisory edi- titioning for reinstatement, was asked<br />\ntrol, in keeping THE NEWS-LETTER at its<br />\nif the cause of failure had been removed.<br />\npresent high standard of news content, tor-in-chief is indeed too great for He answered \"Yes, I married her.\"<br />\neditorial content, and make-up, as well as adequate expression in this state• *<br />\nin improving the paper still more.<br />\nment. In this position I am afforded The Yale Bulldog issued the following<br />\nThe new editorial board, which will<br />\nfirst-aid hint: \"In case of severe nose<br />\nthe<br />\nwelcome opportunity to advise<br />\nserve until March, 1934, is without a<br />\nbleed, it is not advisable to put a tournidoubt interested in journalism, in THE the editorial board on problems quet around the neck.\"<br />\nNEWS-LETTER as a University publica* *<br />\nwhich arise in the course of pubtion, and in the welfare of the campus.<br />\nAccording to an investigation at the<br />\nThough the editorial policies may be al- lishing the University paper.\"<br />\nUniversity of Iowa only one out of eleven<br />\ntered somewhat, this paper will continue,<br />\nHeaney, the new editor-in-chief, college engagements result in marriage.<br />\nas it has—as an influential University<br />\nis<br />\na student in the School of Bus•<br />\n*<br />\norgan with the view of presenting all the<br />\nnews and of exercising what power a iness Economics and will be gradA \"depression\" course has ben orgaencollege paper should and can through its<br />\nuated in June, 1934. He is a junior ized in the graduate school of business adeditorial columns.<br />\nministration at Stanford University.<br />\n• *<br />\nWhether or not the policies of the out- manager of the Musical Club and of<br />\ngoing editorial board have been accepted the lacrosse team here. Recently he<br />\nAccording to a recent survey, there are<br />\nwholly by the entire campus it has been<br />\nwon the 0. D. K. essay contest for more people in penal institutions than in<br />\nevident and proven that THE NEWSeducational institutions.<br />\nLETTER has risen, since last March, from the second time in three years. He<br />\n* * *<br />\nthe ranks of a \"house organ,\" \"yessing\" joined THE NEWS-LETTER staff in<br />\nIt pays to get good grades at Califorthe authorities and the campus leaders, to<br />\nNovember, 1930, and was promoted nia. If a student receives a grade of<br />\na real college paper with the courage to<br />\nsay what it believes and to adhere to its to assistant managing editor and to \"A\" in the mid-year exam, he is excused<br />\nfrom the course and receives a five-dollar<br />\nconvictions. Recapitulation of the suc- managing editor.<br />\nrebate.<br />\ncessful editorial campaigns is unnecessary<br />\n* * *<br />\nBlumstein New Manager<br />\nat this time. The list is comparatively<br />\nlengthy.<br />\nBlumstein, who will serve as bus- A report from Loyola states that the<br />\ncollege man of today has three desires;<br />\nIt is probable that this spirit will be<br />\niness manager now, is assistant man- the pig skin, the sheep skin, and the skin<br />\ncarried on, even if slightly modified, by<br />\nthe new editor-in-chief and his associates. ager of the basketball team and you love to touch.<br />\n* * *<br />\nOf course, it seems almost needless to<br />\nstate that Heaney will have the privilege<br />\nof doing as he cares, despite what foundation has been laid.<br />\nThe retiring editor-in-chief and newly<br />\nappointed advisory editor takes this opportunity to thank the University authorities and activity heads for their cooperation, to congratulate and wish the best<br />\nof luck to Heaney and the new editorial<br />\nboard, to publicly express a deep appreciation for the inimitable cooperation<br />\ngiven by our printers, H. G. Roebuck &<br />\nSon, and to express a hope for the continued success of THE NEWS-LETTER.<br />\n<br />\nmanager of the cross-country squad.<br />\nGirls were worth their weight in gold<br />\nHe served as office manager of THE at a dance held at M. I. T., where adNEWS-LETTER from last March to mission was one cent a pound, with an<br />\nadditional tax of 10 cents for brunettes,<br />\nWednesday of this week.<br />\n15 cents for blondes, and 20 cents for<br />\nOf those elected, five will be red-heads.<br />\n* * *<br />\ngraduated in 1934 and five, in 1935.<br />\nfollowing<br />\nThe<br />\nis a poem which apThe retiring editor-in-chief was<br />\npeared in the Fordham Ram:<br />\nnamed assistant managing editor in \"A wise little co-ed from Troy<br />\nhis freshman year and editor-in- Went out with a young Cooper boy,<br />\nWhen he gave her his pin<br />\nchief at the end of his sophomore<br />\n<br />\nyear.<br />\n<br />\nShe exclaimed, \"Why, its tin!\"<br />\n\"Begad,\" cried the lad, \"that's alloy.\"<br />\n<br />\nAfter College<br />\nWHAT?<br />\n•<br />\n<br />\nEngineering?<br />\n<br />\nCoal... silk stockings. .. meat<br />\n<br />\n—and the telephone<br />\nKeenly aware of the problems of business, large<br />\nand small, Bell System commercial men are constantly devising special telephone plans to customfit service to the user's needs.<br />\nFor example, a plan they worked out for a<br />\ncoal distributor helped him to contact 50% more<br />\ndealers. A manufacturer, using a telephone selling<br />\nplan, sold 700 dozen pairs of hosiery through<br />\none Long Distance call. A great meat packer<br />\nhandles complex sales and distribution problems<br />\nefficiently with the aid of planned Long Distance<br />\nand private wire services.<br />\nSystematic telephone plans are helping many<br />\nusers to build business — cut costs — handle collections — unify nationwide organizations — increase<br />\nprofits. And Bell System men are seeking still<br />\nother ways to make the telephone more useful.<br />\n<br />\nBELL SYSTEM<br />\n<br />\nHarry D. Watts, V. P. of James<br />\nStewart & Co., Inc., builders of<br />\nfamous buildings throughout the<br />\nworld, says: \"World progress depends upon engineering. No wonder eager college men look toward<br />\nthis profession. But to succeed<br />\nyou must have a technical background, ability to take the<br />\nknocks, and alertness to take<br />\nadvantage of the breaks.\"<br />\n<br />\ntake the knocks.\" And<br />\nA yet brains<br />\ncount above all.<br />\nMITY to<br />\n<br />\nThat's why in engineering, as in college, a pipe is the favorite smoke. A<br />\npipeful ofgood old Edgeworth Smoking Tobacco clears the brain for those<br />\nintensive problems that confront the<br />\nengineer ... or the college man.<br />\nOf course most college men know<br />\nEdgeworth.* They like its distinctive<br />\nflavor that comes only from this blend<br />\noffine old burleys. Perhaps you'd like<br />\nto try before you buy. Then just write<br />\nto Larus & Bro. Co., io5 S. 22d St.,<br />\nRichmond, Va., and you'll get a free<br />\nsample packet of Edgeworth.<br />\n*A recent investigation showed Edgeworth the<br />\nfavorite smoke at 42 out of 54 leading colleges<br />\n<br />\nEDGEWORTH<br />\nSMOKING TOBACCO<br />\nBuy Edgeworth<br />\nanywhere in two<br />\nforms—Edgeworth<br />\nReady - Rubbed<br />\nand Edgeworth<br />\nPlug Slice. All<br />\nsizes —150 pocket<br />\npackage to pound<br />\nhumidor tin.Some<br />\nsizes in vacuum<br />\nsealed tins.<br />\n<br />\nTELEPHONE HOME ONE NIGHT EACH WEEK I<br />\n. . . LOWEST RATES AFTER EIGHT-THIRTY j<br />\n<br />\nFor Better Work Call<br />\n<br />\n6<br />\n<br />\nNEW and REBUILT TYPEWRITERS<br />\nALL MAKES, SOLD LIKE RENTING, PAY MONTHLY<br />\nA Machine For Every Purse and Purpose<br />\n<br />\nFROM $19.75 TO $126.00<br />\nAll Repairs, Supplies<br />\nRENT ANY MAKE — SPECIAL RATES<br />\nBe Sure To Try a MONARCH NOISELESS<br />\nBefore Purchasing Any Portable Typewriter.<br />\n<br />\nAMERICAN WRITING MACHINE CO.<br />\n18 PARK AVENUE<br />\n•<br />\n<br />\nPLaza 2060<br />\n<br />\n(Serving and Saving Typewriter Users for 52 Years)<br />\n<br />\nFried's Cleaning<br />\n101 E. 21ST STREET<br />\nPhone BElmont 5501<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nPRINTERS OF<br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 HOPKINS PLAaa, BALTIMORE<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., MARCH 3, 1933<br />\n<br />\nAuthor<br />\nJAY QUINT BEATEN Dr.OfRoulston<br />\nCritical Conrad<br />\nBY MT. ST. MARY'S F. Meyer's Edition<br />\nTEAM BY 32-29<br />\nHopkins Rally In Last Quarter Of Contest Falls<br />\nShort<br />\nAnother defeat marked the closing of the basketball season, as far<br />\nas Hopkins is concerned, when a<br />\nMt. St. Mary combine beat the Jays<br />\nlast Tuesday night at Evergreen.<br />\nThe final score was 32-29.<br />\nA Jay rally in the last quarter of<br />\nthe contest fell short. From beginning to end the Mountaineers held<br />\nthe upper hand both in attack and<br />\ndefense.<br />\n<br />\nAn historical-critical edition of<br />\nConrad Ferdinand Meyer's \"Huttens Letzte Tage\", which may be<br />\nconsidered as establishing the foundations for all future studies of that<br />\nwork, has just been released by the<br />\nJohns Hopkins Press. The author<br />\nof the volume is Dr. R. B. Roulston,<br />\nprofessor of German here.<br />\nThe project has been undertaken,<br />\nit was stated, with the aim first, of<br />\n\"establishing the true history of the<br />\ntext of the work of the Swiss poet,<br />\nand second, of rendering accessible<br />\nto students of Meyer all of the material necessary for the study of his<br />\npoem, within the compass of one<br />\nvolume.\"<br />\n<br />\nBrooklyn Wrestlers Beat<br />\nHopkins Matmen By<br />\n23-5 Score<br />\nBrooklyn Polytechnic proved sufficiently strong to conquer the Johns<br />\nHopkins grapplers last Saturday<br />\nnight, 23-5. Only Captain Hamilton Sears, wrestling in the 165-1b.<br />\nclass, was able to chalk up a victory.<br />\nNext to Captain Sears, Bachman,<br />\nwho grapples in the 115-1b. class,<br />\ngave the best exhibition.<br />\nThe curtain will be brought down<br />\non the season this week end. Tonight Gallaudet will be encountered<br />\nat Washington, and tomorrow<br />\nnight Western Maryland will be engaged at Westminster.<br />\n<br />\nDr.Seymour To Deliver<br />\nEight Shaw Lectures<br />\nBeginning March 6<br />\n\"American Diplomacy During the<br />\nWord War\" will be the general topic<br />\nof a series of eight lectures, to be<br />\ngiven at the Hopkins, beginning<br />\nMarch 6 by Dr. Charles Seymour,<br />\nSterling professor of history and<br />\nprovost of Yale University.<br />\nThe lectures are being delivered<br />\nunder the auspices of the Albert<br />\nShaw lectureship and of the Page<br />\nSchool of International Relations.<br />\n\"The German Appeal to Wilson\"<br />\nand \"The Negotiation of the Armistice\", to be given March 6 and 8,<br />\nrespectively, will be open to the<br />\npublic.<br />\n<br />\nFinal Sale of the Season!<br />\nAll remaining readymade Suits, Overcoats<br />\nand Topcoats<br />\n<br />\nKATZ CLOTHES<br />\n211 - 213 E. Baltimore Street<br />\n<br />\n••••••••••••••••••••••••••••••••••••••••••.....e<br />\n<br />\nPhone Belmont 7908<br />\n<br />\nBIRELY'S<br />\nPHARMACY<br />\n<br />\nMounts Always Lead<br />\n<br />\nWith the exception of parts of the<br />\nlast period, the Mounts retained at<br />\nleast a seven-point lead. The visiting team showed keen ability at retrieving rebounds under its own and<br />\nunder Hopkins's basket. Likewise,<br />\nthe Mounts' center man, Hopkins,<br />\nconstantly obtained the tap-off.<br />\nThus his team had possession of the<br />\nball most of the time.<br />\nThe second cause of the Jay defeat was the performance of the<br />\nLynch brothers. Tom thrilled the<br />\naudience with his sharp cutting for<br />\nthe basket, while Joe fed passes to<br />\nhis teammates and guarded Caleb<br />\nKelly without any difficulty.<br />\nThe Black and Blue team's loss<br />\nresulted from faults that have been<br />\nthe cause of almost all its defeats.<br />\nIn the first place, the team tried to<br />\nplay in a manner suitable against a<br />\nzone defense, while the Mounts<br />\nstarted with a zone defense and immediately switched to man-for-man<br />\nstyle.<br />\n<br />\nHopkins Playshop<br />\nTo Sponsor Conclave<br />\n<br />\nMARYLAND THEATRE<br />\n<br />\n(Continued from Page 1, Col. 4)<br />\nassociate professor of English at the<br />\nJohns Hopkins University, and reports of the activities of theatres<br />\nrepresented will be read.<br />\nFollowing the luncheon hour Dr.<br />\nFagin will conduct a round<br />\ntable discussion on the \"Function of<br />\nthe College Theatre\", followed by a<br />\ntalk on problems of play production<br />\nby Miss Dorothy Elderdyce, director of dramatics at Westminster<br />\nSeminary.<br />\nThe meeting will then adjourn<br />\nuntil 8:30 p. m., when the members<br />\nof the conference are invited to witness the production of a modern<br />\nAmerican play at the Playshop.<br />\n<br />\nHENRY HULL<br />\n<br />\nTrack Coach Asks For<br />\nMore Candidates At<br />\nTrack Practice<br />\nAt a recent meeting of the track<br />\nteam, Coach Waldo Hambleton emphasized the need for more candidates in the middle distances and<br />\nthe field events.<br />\nAccording to Manager Bruce<br />\nHerman, there will be only two<br />\nhome meets this year. Delaware<br />\nUniversity will provide the opposition for the Jay trackmen on<br />\nApril 15 at Homewood, while<br />\nMaryland will invade the Black and<br />\nBlue field on May 20. This marks<br />\nthe first time in four years that the<br />\nTerp-Jay meet will take place at<br />\nHomewood.<br />\nPresent indications point to a<br />\nsuccessful campaign. Most of the<br />\nmembers of last year's squad are<br />\nagain available for service, and will<br />\nbe supplemented by a group of<br />\npromising freshmen.<br />\nEquipment has been given out to<br />\nmembers of last year's varsity. Candidates are urged to come out. Praefizz is held daily at 4 P. M. at<br />\nRo ewood Field.<br />\n<br />\nOUR ADVERTISERS<br />\n<br />\nST. PAUL at 33RD STREET<br />\nYour Neighborhood Drug Store<br />\n<br />\nIn the International Farce Comedy Hit<br />\nin New York — Now a Hit of London)<br />\nWeeks<br />\n(26<br />\n<br />\nPRESCRIPTIONS<br />\nI School Supplies, Candy, Cigars I<br />\nUnexcelled Fountain Service ;<br />\nMake Our Store Your Store<br />\n<br />\n'ARUNDEL ICE CREAM SHOPPC<br />\nBAKERY, CONFECTIONERY<br />\nSandwiches — Sodas — Sundaes<br />\n2436-A N. CHARLES ST.<br />\nCHesapeake 9495<br />\n<br />\n111••••••••••••••••••••••••••••••••••..................................<br />\n<br />\n'SPRINGTIME FOR HENRY'<br />\n<br />\n\"What is impossible to others is possible to us.\"<br />\nMoth Holes, Burns, Tears, and Cuts in Clothing, Linens, and Silk Rewoven Perfectly.<br />\nUNEXCELLED SERVICE<br />\n<br />\nBy BENN W. LEVY<br />\nWith GAVIN MUIR — EDITH ATWATER<br />\n<br />\nRELIABLE WEAVING CO.<br />\n<br />\nEvenings: 50c to $2— Matinee Saturday: 50c to $1.50<br />\nMATINEE THURSDAY: Best Seats $1.00, Plus 10 percent Tax<br />\nPRESENT THIS ADVERTISEMENT AND OBTAIN TICKETS<br />\nFOR TONIGHT, SATURDAY MATINEE AND NIGHT AT<br />\n50 PERCENT REDUCTION<br />\n<br />\nVE rnon 1868<br />\n<br />\n208 WEST SARATGOA STREET<br />\n<br />\nIvIANIctmuNG-8 A. M. to 8 P. M. Daily f<br />\n8 A. M. to 10 P. M. Saturday?<br />\n4<br />\ne<br />\n<br />\nTheodore's Barber Shop 4+<br />\n<br />\nFormerly with EMIL CAYE<br />\nS. W. Cor. St. Paul and 33rd Streets<br />\nNext to Birely's<br />\n%<br />\n<br />\nPEABODY<br />\nPHARMACY<br />\nCALVERT and 30TH STS.<br />\n'We sell Drugs and Give Service'<br />\n9<br />\n<br />\nPeo vie _know it..<br />\n‘‘<br />\n<br />\nAerievAid<br />\n1,<br />\ncy<br />\nallyy<br />\n<br />\nJay Rally Fails<br />\n<br />\nThe Mounts were leadin, 30-22.<br />\nCamitta made good a foul toss and<br />\nSiverd added a two-pointer. J.<br />\nLynch retaliated with a field goal,<br />\nbut Don Kelly matched this with a<br />\nlong one. With but seconds to go,<br />\nthe Jay captain took another long<br />\none from beyond mid-court. The<br />\ntimer's gun went off but the ball<br />\ncontinued on its way to the last<br />\nHopkins score.<br />\n<br />\nPATRONIZE<br />\n<br />\n•61<br />\n<br />\nJay Attack Slow<br />\n<br />\nHopkins, however, continued to<br />\nset a slow, methodical pace instead<br />\nof cutting fast for the basket. Consequently the Jays had to make most<br />\nof their shots from long range. To<br />\nmake matters worse, their shooting<br />\nunder the basket, on the few opportunities they were able to do so, was<br />\nunusually poor.<br />\nOnly during the beginning and<br />\nthe close of the second half did the<br />\nJays speed up the contest and with<br />\neach effort Mount St. Mary's lead<br />\nwas quickly diminished but not overcome. Particularly thrilling was the<br />\nclosing rally.<br />\n<br />\nOFF<br />\n<br />\nTHEN smokerskeep buying the<br />\nsame cigarette day after day...<br />\nit's a pretty good sign that they're<br />\ngetting what they want... mildness,<br />\nbetter taste — a smoke that's always<br />\nthe same.<br />\nSo we're going right on making<br />\nChesterfields just as we always have<br />\n... selecting choice, ripe tobaccos<br />\n... ageing them... blending and<br />\ncross-blending them...making them<br />\ninto cigarettes in the most scientific<br />\nways that are known.<br />\nAs long as we do these things we<br />\nknow that smokers will continue to<br />\nsay,\"They Satisfy\". For that's what<br />\npeople are saying about Chesterfields.<br />\nIf you smoke, why not find out<br />\nabout them? A package or two will<br />\ntell you the whole story.<br />\n<br />\nN<br />\n<br />\nTHEY'RE MILDER—<br />\nTHEY TASTE BETTER<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., MARCH 3, 1933<br />\n<br />\n4<br />\n<br />\nPlans For Banquet<br />\nELECTS Levin, Chassin Retire From Engineering Society<br />\nPRESS PUBLISHES HISTORY CLUB<br />\nO'ROURKE PRESIDENT Chief Posts Of News-Letter To Hold Dance Here Are To Be Discussed<br />\nINTERNATIONAL LAW<br />\nSTUDY BY F. S. DUNN<br />\nTickets Will Cost $1.10; Are To<br />\nPlans for future dances and a<br />\nBe Placed On Sale In Near<br />\nfather and son banquet to be held by<br />\nFuture, It Is Announced<br />\nthe Johns Hopkins DeMolay Club<br />\nA dance, sponsored by the Amer- will be discussed at a meeting of the<br />\nican Society of Civil Engineers, is organization today, at 12:20 in Levto be held at Levering Hall soon.<br />\nering Hall.<br />\nNegotiations are now being carried<br />\nIt is urged that all Members be<br />\non to secure an out-of-town orchespresent in order that a definite<br />\ntra.<br />\ncourse of action may be decided<br />\nTickets are to be $1.00, plus tax, upon.<br />\nand will be on sale at an early date.<br />\n<br />\n\"Protection Of Nationals\" Is<br />\nThe Title Of New<br />\nAt a recent meeting of the InterBook<br />\nnational Relations Club, Vernon O'Rourke, graduate student in<br />\n<br />\nOTHER LAW BOOKS the p olitical science department,<br />\nTO BE PUBLISHED was elected pesident; Mrs. L. P.<br />\nHamburger Jr., of the history de-<br />\n<br />\nCommentary On The Russian partment, vice-president; and E.<br />\nDebt Situation ForthVan Sant, secretary and treasurer.<br />\ncoming<br />\nThe International Relations Club<br />\n<br />\nDetermines Governmental Action<br />\n<br />\nThe study determines the actions<br />\nof governments in dealing with<br />\nquestions of protection; and it<br />\nreaches the conclusion that the introduction of extra-legal factors in<br />\nthe disposition of contentious issues<br />\nis unavoidable.<br />\nWith this analysis, the author<br />\noffers a new theory to serve as the<br />\nbasis of international responsibility<br />\nfor injuries to aliens.<br />\nSeveral publications of the Hopkins that are forthcoming from the<br />\nPage School of International Relations are: \"The Soviet Government<br />\nand the Russian Debts,\" which is an<br />\ninquiry into the nature and present<br />\nstatus of the question by Lazare<br />\nTeper ; and \"Manifest Destiny\", a<br />\nstudy of nationalists expansionism<br />\nin American history, by Albert K.<br />\nWeinberg.<br />\n<br />\nMosely, Grad Student,<br />\nSeeking Siberian Snails<br />\n(Continued front Page 1, Col. 5)<br />\nsity of Manitoba. After entering<br />\nthe Hopkins as a graduate student,<br />\nhe was appointed a student instructor. For a time he was a substitute<br />\ninstructor at the University of<br />\nNorth Carolina.<br />\n<br />\n—Courtesy Sun papers<br />\n<br />\n—Courtesy Sun papers<br />\n<br />\nHYMAN LEVIN<br />\nHyman Levin, who is a junior in the<br />\nCollege of Arts and Sciences at the Hopkins, today is succeeded to the position<br />\nof editor-in-chief of THE NEWS-LETTER.<br />\nIn retiring from the head of the paper,<br />\nLevin becomes, by special appointment,<br />\nadvisory editor-in-chief until March, 1934.<br />\nNamed to the honorary post in recognition of his work in the improvement of the<br />\nnewspaper, he will serve as a non-voting<br />\nmember of the board of control and as<br />\nadviser to the staff.<br />\n<br />\nMaurice R. Chassin, who is taking special courses at the School of Hygiene<br />\nand Public Health, retires from his position of business manager. He will be<br />\ngraduated from the A.B. school in June.<br />\nHe is a member of 0. D. K., captain of<br />\ntrack team, treasurer of Pi Delta Epsilon,<br />\nand advertising manager of The Hullabaloo staff.<br />\nBoth retiring NEWS-LETTER heads were<br />\nelected on March 24, 1932.<br />\n<br />\nMORRISON &<br />\nFIFER<br />\nLINDEN and DOLPHIN<br />\nWish To Announce the Purchase of<br />\n<br />\nBacon's Drug Store<br />\nSt. Paul and 31st Street<br />\n\"We Solicit Your Patronage\"<br />\n<br />\nIn order to have an active mind you must have a healthy body<br />\nEAT<br />\n<br />\nMAURICE R. CHASSIN<br />\n<br />\nAT<br />\n<br />\nTHE<br />\n,, ,,<br />\n<br />\nWith several other publications<br />\nforthcoming the Johns Hopkins<br />\nPress recently published \"The Protection of Nationals\", by Frederick<br />\nSherwood Dunn, associate member<br />\nof the Page School and Creswell<br />\nLecturer on international law in The<br />\nJohns Hopkins University.<br />\nAs a study in international law the<br />\nauthor re-examines the whole subject of the application of law to international questions. He seeks to<br />\ndevelop a conception of the subject<br />\nthat is more in line with modern theories of jurisprudence, rejecting the<br />\nusual conceived difficulties in the international field.<br />\n<br />\nwas organized in 1928 as an academic club with membership limited<br />\nto graduate students and faculty<br />\nmembers. Twenty members are<br />\nThe club reelected each year.<br />\nceives books on the League of Nations and international relations<br />\nfrom the Carnegie Endowment<br />\nevery year. The Fortnightly Summary, a periodic reading on international events, also sent by the<br />\nCarnegie Endowment, is distributed<br />\namong the members.<br />\nA speaker addresses the club at a<br />\nmonthly luncheon meeting. After<br />\nthe luncheon there is a group meeting with a general discussion on international events, one of the members delivering a paper. No new<br />\nadvisor has been chosen since Dr.<br />\nWilloughby, former advisor, announced his intention of resigning.<br />\n<br />\nBOULEVARD RESTAURANT<br />\n3226<br />\n<br />\nGREENMOUNT AVENUE, Near 33RD STREET<br />\nWhere Choice, Moderate Prices Prevail<br />\nAlso at New Presto, 5 EAST NORTH AVENUE<br />\n<br />\nOther Publications<br />\n<br />\nWith these will also be published<br />\n\"The Economic Effectiveness of the<br />\nChinese Boycotts\", by C. F. Remer ;<br />\n\"The Shanghai Incident of May 30,<br />\n1925\", a case study in social-political conflict by Maurice T. Price;<br />\nand \"The Russo-Japanese Entente<br />\nof 1907-1916\", a study in secret diplomacy by Ernest B. Price.<br />\nTogether with these several publications from the Page School of<br />\nInternational Relations will be<br />\nprinted \"Equity Receiverships In<br />\nthe Common Pleas Court of Franklin County, Ohio, In the Years<br />\n1927 and 1928\", by Thomas Clifford Billig, associate professor of<br />\nlaw at West Virginia University.<br />\nHis book is a scholarly analysis of<br />\nthe Ohio State system of equity receivership as administered by the<br />\nCommon Pleas Court of Franklyn,<br />\nOhio.<br />\n<br />\nHopkins Varsity Club<br />\nMakes Changes In<br />\nIts Constitution<br />\nEligibility For Entrance Into Group<br />\nExtended To Athlete Who<br />\nWins Major Letter<br />\nA complete reorganization was<br />\nmade and a new constitution composed at a meeting of the Varsity<br />\nClub held Monday.<br />\nThe eligibility for entrance into<br />\nthe group was extended by the new<br />\nconstitution to any Hopkins athlete<br />\nwho wins his major letter. It also<br />\nstates that the president of the group<br />\nmust call a meeting at least once a<br />\nmonth and that any member absenting himself from three consecutive<br />\nmeetings will lose his status in the<br />\nclub.<br />\nThe formation of an athletic<br />\nhonor society, with membership<br />\nlimited to those who are outstanding in athletic ability, was proposed<br />\nat the meeting.<br />\n<br />\nILLUSION:<br />\n<br />\n... with three lovely and<br />\nLook at this remarkable lady.<br />\nperfect heads... all attached to a normal body. She<br />\nappears to sit on the stage, with the lower part of her<br />\nbody concealed by flowers. She can wink, smile, and<br />\nnod. She can talk, laugh, and sing—all at the same<br />\ntime. Thousands of people have seen this feat of magic<br />\nand pronounced it a wonderful sight!<br />\nEXPLANATION:<br />\n<br />\nAudiences used to pay an extra fee to go behind the<br />\nscenes to see how this trick was worked. They discovered that the three-headed woman was merely a<br />\nreflection in a mirror. The glass showed the heads of<br />\nthree girls but the body of only one. The other two<br />\nwere cleverly hidden so that only their heads showed<br />\nin the mirror.<br />\nSOURCE:\"Magic Stage Illusions and Scientific Diversions\"<br />\nby Albert A. Hopkins...Munn & Co., New York<br />\n<br />\nKEPT FRESH<br />\nIN THE WELDED<br />\nHUMIDOR PACK<br />\n<br />\nIt's fun to be fooled__<br />\n...it's more fun to KNOW<br />\nThis \"three-headed woman\" trick goes throat. Ripe, costly tobaccos are mild,<br />\nmellow—gentle. The question is whether<br />\n'way back to the early days of magic.<br />\ncigarette is made from cheap tobacco<br />\na<br />\nprothat<br />\nAlso old is the suggestion<br />\ntection for your throat and freedom from or the more expensive grades.<br />\ncoughing can be achieved through some<br />\nIt is a fact, well known by<br />\n•<br />\nmagic trick.<br />\ncigaleaf tobacco experts, that<br />\neasiest<br />\nTHE EXPLANATION: The<br />\nthat<br />\nare made from finer, MORE<br />\nCamels<br />\ncigarette<br />\nthe<br />\nis<br />\nyour<br />\nthroat<br />\non<br />\nrette<br />\nEXPENSIVE tobaccos than any other<br />\nis made from the choicest, ripe tobaccos.<br />\npopular brand.<br />\nCheap, raw tobaccos are, as you<br />\nwould naturally expect, harsh to the<br />\nAmerican men and women have smoked<br />\nmore billions of Camels than any other<br />\nbrand because of the appeal of more expensive tobaccos and matchless blending.<br />\nWon't you stack up your own experience<br />\nwith a cigarette made from milder, costlier tobaccos...against magic claims about<br />\n\"cigarettes and your throat\"?<br />\nTry fresh Camels—in the air-tight,<br />\nwelded Humidor Pack that seals the<br />\nfreshness and coolness,the mildness and<br />\nflavor of Camels...inside.<br />\n<br />\nCopyright, 1933, R. J. Reynolds Tobacco Company<br />\n<br />\nNO TRICKS<br />\n..JUST COSTLIER<br />\n.7'ORACCOS<br />\nIN A MATCHLESS<br />\n<br />\nBLEND<br />\n<br />\nii.e../i.ri,<br />\n<br />\nMrs. L. P. Hamburger, Jr., And<br />\nE. Van Sant Chosen As<br />\nOther Offiers<br />\n<br />\n\f", "format": "basic_html", "processed": "MEMBER OF THE<br /><br />\nINTERCOLLEGIATE<br />\n[<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nOltt<br /><br />\nEdgar Blumstein Is Elected<br />\nBusiness Manager Of<br />\nNewspaper<br />\nLEVIN APPOINTED<br />\nADVISORY EDITOR<br />\nLangfeld And Perlmutter<br />\nAre Elected Managing Editors<br />\nFollowing the clearing up of a<br />\ndifficulty which from the start<br />\npromised to culminate in undesirable complications, Norman S.<br />\nHeaney, at a meeting held Wednesday, was elected editor-in-chief of<br />\nTHE NEWS-LETTER for the term<br />\nMarch, 1933, to March, 1934.<br />\nTwo days prior to the election,<br />\nHyman Levin, who retires from the<br />\nhead of the paper today, definitely<br />\nstated his intention of not seeking<br />\nre-election and signified Heaney as<br />\nhis choice for the editorship.<br />\nOthers Elected<br /><br />\nPrice, 5 Cents<br /><br />\nHOMEWOOD, BALTIMORE, MD., FRIDAY, MARCH 3, 1933<br /><br />\nVol. XXXVII, No. 28<br /><br />\nHEANEY NAMED<br />\nEDITOR-IN-CHIEF<br />\nOF NEWSPAPER<br /><br />\niqopkitts Nrtus-Erttrr<br /><br />\nMusical Club To Present<br />\nConcert At Atlantic City<br />\nWill Appear At Hotel Chalfonte-Haddon Hall Next Saturday In Second Appearance At Resort; Group Has<br />\nPresented Eight Concerts This College Year<br /><br />\nDRAMA GROUPS<br />\nTO MEET HERE<br />\nON APRIL 15<br /><br />\ntions for rendition by the Blue Jay<br />\nOrchestra and by the Glee Club.<br />\nPurpose Of Conference Is<br />\nDiscussion Of Current<br />\nReporting upon the financial condition of the club following a seaProblems<br />\nson's operations, J. Milton Smith,<br />\npresident of the organization, ex- FIRST OF ITS TYPE<br />\nEVER TO BE HELD<br />\npressed gratification with the success achieved. Expenses have been<br />\nkept within the budgetary limits Seven Colleges Accept Inviprescribed by the Student Activities<br />\ntations To Date; ProCouncil, and it is hoped that a small<br />\ngram Being Planned<br />\nmargin will be cleared as a nucleus<br />\nA conference composed of the<br />\nfor next season.<br />\nrepresentatives and directors of the<br />\nReputation Wide, Said<br />\nThe local reputation of the club various college dramatic organizahas been growing, and officials of tions throughout the state, the first<br />\nthe club have stated that this has of its kind to take place, will be held<br />\nbeen one of the best seasons. It is on Saturday, April 15, at the Johns<br />\nPerformance Good<br />\nprobable that next year's schedule Hopkins Playshop.<br />\nThe purpose of this conference,<br />\nComments on the performance of will include several new concerts, it<br />\naccording to Dr. N. Bryllion Fagin,<br />\nthe various groups in the club have was said.<br />\nbeen distinctly favorable. The quarAt the annual banquet, which will director of the Playshop, will be to<br />\ntet and Banjo Club drew hearty ap- be held following the Atlantic City provide an opportunity for the displause from a well-filled house at the trip, election of officers will take cussion of problems affecting colhome concert. The audience was place. Arrangements for the af- lege dramatics. The need for such<br />\nparticularly receptive of Osmar P. fair will be made public later, Smith discussions, he said, has long been<br />\nfelt.<br />\nSteinwald's arrangements of selec- I said.<br /><br />\nFulfilling its final engagement of<br />\nthe 1932-33 season, the Musical<br />\nClub journeys to Atlantic City on<br />\nSaturday, March 11, where it will<br />\nappear at the Hotel Chalfonte-Haddon Hall. This is the second time<br />\nthat the club members have been<br />\nguests of the Hotel.<br />\nTo date the club has presented<br />\neight concerts, both in and out of<br />\nthe State. Public appearances have<br />\nbeen made at five churches in the<br />\ncity, and at Wilson College, Chambersburg, Pa., Maryland College for<br />\nWomen, Lutherville, and at the<br />\nMaryland<br />\nCasualty Clubhouse,<br />\nwhere the annual home concert and<br />\ndance were held last Friday.<br /><br />\nCLASS MEMBERS<br />\nPLEASE PAY<br />\nCLASS DUES NOW<br /><br />\nDr. Karl Herzfeld To Present Illustrated Lecture<br />\nAt Assembly<br />\nDr. Karl Herzfeld, professor of<br />\nphysics, will present an illustrated<br />\nlecture on \"Colleges and College<br />\nLife In Germany\" at the assembly<br />\nnext Thursday.<br />\nAccording to William H. Triplett, president of Student Council,<br />\nthe assemblies for March 9 and<br />\nMarch 16 will feature Dr. Christie<br />\nand Dr. Broadus Mitchell, associate<br />\nprofessor of political economy. The<br />\ntopics of their talks have as yet not<br />\nbeen announced.<br />\nPi Delta Epsilon, national honorary journalistic fraternity, will<br />\nhold its annual public initiation,<br />\nApril 6. A prominent journalist<br />\nwill be secured as the principal<br />\nspeaker. Tau Beta Pi and Omicron<br />\nDelta Kappa, engineering and active<br />\nhonorary fraternities, respectively,<br />\nare to also publicly initiate at the<br />\nsubsequent assemblies in April.<br /><br />\nTulane,HopkinsTo<br />\nDebate Here At<br />\n4 P.M. Today<br /><br />\nDR. VAN ORMAN<br />\nCALLS MEETING<br />\nOF STICKMEN<br />\nWants To Get Acquainted<br />\nWith Lacrosse<br />\nSquad<br />\nVETERANS WILL<br />\nREPORT TODAY<br />\nNew Candidates To Meet<br />\nNext Monday At<br />\n4 P. M.<br />\nAll members of last year's larrosse squad are urged by Coach<br />\nRay Van Orman to appear at<br />\nHomewood field this afternoon at 4<br />\np. m. New candidates should report at Homewood on Monday at<br />\nthe same time.<br />\nThe main purpose of this plan is<br />\nto permit the coach to learn what<br />\nold and new material is on hand,<br />\nand to dole out equipment more efficiently. By these arrangements<br />\npractice also will get under way<br />\nmore quickly.<br />\nEarly Practice Essential<br /><br />\nA debate between Tulane UniverThough the team's first scheduled<br />\nOthers who were elected to board<br />\nsity of New Orleans, Louisiana, and<br />\nconference<br />\na<br />\narranging<br />\nthis<br />\nIn<br />\ngame<br />\nwill take place April 8 against<br />\nof control posts are: Edgar BlumJohns Hopkins is to be held today<br />\nquestionnaire<br />\nwas<br />\nsent<br />\npreliminary<br />\nthe<br />\nAlumni<br />\nClub, Coach Van Orstein, business manager; Millard<br />\nin all Mary- in room 108, Gilman Hall, at 4 man believes holding practice at<br />\nunits<br />\nto<br />\ndramatic<br />\nthe<br />\nLangfeld, Jr., and Martin Perlmut\"Resolved,<br />\nland colleges, the purpose of this p. m. on the subject,<br />\nsuch an early stage is essential to<br />\nter, managing editors; Richard<br />\nlegislashould<br />\nenact<br />\nThat<br />\nCongress<br />\nset a convenbeing<br />\nto<br />\nquestionnaire<br />\nFeise and Philip P. Hamburger, asof the promotion of a squad as compeient date for the conference and to tion for the centralized control<br />\ntent as last year's. Likewise, the<br />\nsistant managing editors; Bert Gordetermine the points of greatest in- industry.\"<br />\npossibility of unfavorable weather<br />\ndon, office manager; Ray Goldberg,<br />\nterest to these organizations. The The Hopkins team, composed of conditions in March will not appear<br />\nadvertising manager; Charles HasFinal Selection Of Orchestra Prominent Speakers Are To results of the questionnaires fixed Charles Squire, a junior, and Abner too detrimental to the squad's detings, circulation manager.<br />\nTo Be Made By<br />\nTalk Before Intercolthe date as April and embodied the Willen, a sophomore, will uphold velopment.<br />\nAt the request of Heaney, the<br />\nNext Week<br />\nlegiate Meet<br />\ntopics of play selection, play pro- the affirmative side of the question.<br />\nAt present the possibility of<br />\nboard of control of the paper apA Hopkins debate team repreduction and casting in the program.<br />\npointed Levin advisory editor-inproducing<br />\na team as powerful as last<br />\nAPRIL 22 IS DATE<br />\nFOUR SESSIONS TO BE Seven colleges have accepted the sented by Jerome Blum and S. Raychief, an honorary position given to<br />\nyear's<br />\nOlympic<br />\nrepresentatives apSET FOR AFFAIR<br />\nHELD IN LEVERING invitation to attend this conference mond Dunn will meet the team of<br />\nrecognihead<br />\nin<br />\nthis year's retiring<br />\nthe University of Dayton, of Day- pears doubtful. Among the attack<br />\nto date, several of these asking if<br />\ntion of Levin's work since October,<br />\nEddie Duchin, Ozzie Nelson, Villard, Blanshard, Barnes, they could bring large groups with ton, Ohio, on the subject dealing men missing are former Cap1930. The advisory editor will be<br />\nwith war debts. Blum and Dunn tain Jack Turnbull, Guild and DarKeezer, Are Among<br />\nTed Weems, Being<br />\nthem. The others showed great ena non-voting member of the governwill support the view that war rell. On the defense, the loss of<br />\nConsidered<br />\nSpeakers<br />\nthusiasm in their answers.<br />\ning board and will serve as an edigoalie Fritz Stude, Kneip, and Moss<br />\ndebts should not be cancelled.<br />\nSeven Colleges Have Accepted<br />\ntorial adviser to THE NEWS-LETTER<br />\nwill also be sorely felt.<br />\nthe<br />\nDebate<br />\nThe subscription price to the<br />\nSquire is president of<br />\nProminent national and local figexpect<br />\nwho<br />\ncolleges<br />\nfar,<br />\nthe<br />\nSo<br />\nstaff.<br />\nUnder such circumstances, there<br />\nAssociation which was reorganized<br />\nJunior Prom which is to be held ure are to participate in the fifth anFaced By Unique Situation<br />\nLoyola,<br />\nare:<br />\nrepresentatives<br />\nsend<br />\nto<br />\nbe plenty of room for compewill<br />\nBoth Blum and<br />\nApril 22 at the Alcazar has been nual Intercollegiate Liberal Confertwo years ago.<br />\nFaced by the unique situation reduced to $2.20, tax included, it ence which is to be sponsored by the Blue Ridge, Western Maryland, Dunn, who debated against the tent players; and Coach Van Orwhich made four juniors eligible for was announced by J. M. Scott, chair- Liberal Club of the Johns Hopkins State Normal of Salisbury, State University of Pittsburgh last month, man is anxious for all aspirants to<br />\nMaryland Col- are members of the editorial staff appear as quickly as possible.<br />\ntwo major positions on the editorial man of the committee.<br />\nUniversity, March 10 and 11. The Normal of Towson,<br />\nThe- of THE NEWS-LETTER.<br />\nWestminster<br />\nWomen,<br />\nfor<br />\nlege<br />\nboard, it was found necessary to<br />\nAdopt New Plan<br />\ntheme of the conclave is to be<br />\nHopkins.<br />\nand<br />\nSeminary<br />\nological<br />\nelect two managing editors instead<br />\nA decision was reached by the \"Ways Out—Guides Through EcoGregory Is Co-Author<br />\nof the customary one. When the committee at its meeting this week nomic Chaos.\"<br />\nA tentative program has been al- Production Of Daily NewsOf Engineering Paper<br />\npaper returns to a semi-weekly ba- to give to members of the Junior<br />\nFour sessions will be held in Lev- ready planned. From 9:00-10:00<br />\nPaper Depicted-In Film<br />\nsis next fall, Langfeld and Perlmut- Class who have paid their class dues ering Hall, one on next Friday and a. m. there will be held a period for<br />\nJohn H. Gregory, professor of<br />\nPresented By \"Sun\"<br />\nter will be in charge of one issue one free ticket to the Prom pro- three on Saturday. The first meet- registration of delegates, followed<br />\ncivil and sanitary engineering at the<br />\neach. Subordinate to each manag- vided those juniors sell two tickets ing will be held at 8 p. m., March by addresses of welcome by PresThe various activities incident to<br />\nHopkins, is the joint author with<br />\ning editor there will be an assistant to the dance. At the same time as 10. The second, third, and fourth ident Joseph Ames, Dr. John C. the production of the daily newspaRobert A. Allton and James H.<br />\nmanaging editor.<br />\nit announced this move the com- meetings are scheduled for March French, Chester A. Morrow, and per were depicted in motion pictures Blodgett, both of Columbus, Ohio,<br />\nelection,<br />\nCommenting on the<br />\npresented at yesterday's assembly<br />\nmittee issued a plea for cooperation 11 at 11 a. m., 2 p. m., and 8 p. m. Elmer Greensfelder.<br />\nof a short paper published in Civil<br />\nLevin said yesterday:<br />\nThe Sun. A crowd which overby<br />\nSpeak<br />\nTo<br />\nSpencer<br />\nDr.<br />\nof all members of the Junior Class<br />\nAmong Speakers<br />\nEngineering,<br />\nvolume three, FebruLevin Comments<br />\nFrom 10:30-12:00 an address will taxed the hall's capacity attended.<br />\nas well as of the three other underary, 1933, entitled \"Holding-Down<br />\nAmong<br />\nwill<br />\napthe<br />\nspeakers<br />\nwho<br />\n\"The election of Heaney to the graduate classes at the Johns HopHenry Edward Warner, veteran<br />\nbe given on \"Plays for the College<br />\nPower of Concrete Piles—Results<br />\npear before the conference are Paul<br />\neditor-in-chief of the campus news- kins. An effort is being made to<br />\nTheatre\", by Dr. Hazleton Spencer, Sun newspaper man, explained porof Tests Made at Columbus, Ohio,<br />\nthe<br />\nBlanshard, college director of<br />\npaper is undoubtedly, for several make the Prom the best ever spontions of the film.<br />\n(Continued on Page 3, Col. 2)<br />\nSquare Precast Piles with Paron<br />\nLeague for Industrial Democracy;<br />\nreasons, the best thing that could sored by the third year class at<br />\nallel<br />\nSides.\"<br />\nthe Hon. Paul John Kvale, Farmer(Continued on Page 2, Col. 2)<br />\nHomewood, according to reports.<br />\nLabor member of Congress; Dr.<br />\nFinal Selection Soon<br />\nCharles 0. Hardy, economist in the<br />\nIt was definitely stated by Scott<br />\nBrookings Institute; J. B. S. Hardand Don Kelly, president of the<br />\nman, editor of the Advance.<br />\nJunior Class, that final selection of<br />\nHarry Elmer Barnes, former pro- Alan Mosely, Graduate Student In Zoology, Describing<br />\nthe orchestra for the affair will be<br />\nDr. Julius Petersen, professor of<br />\n\"The Contemporary Educational made by next week. The selection fessor of sociology at Smith ColExperiences In Letter To Dr. Andrews, Says He<br />\nliterature at the University<br />\nGerman<br />\npresident<br />\nMovements Abroad\" is the general will be made from the following lege; Albert D. Hutzler,<br />\nShoots Rabbits And Catches Fish For Food<br />\nAssociation<br />\nof<br />\nof Berlin, and president of the<br />\nsubject of a series of lectures to be three bands: Eddie Duchin, playing of the Baltimore<br />\nHardships encountered in Siberia boat did not leave until May, he Goethe-Gesellschaft, began his lecpresented during this semester by at the Central Park Casino; Ozzie Commerce; Oswald J. Villard, ediDr. Isaac Leon Kandel, professor of Nelson, now featured at the Hotel tor of the Nation; R. M. Boickel, while making studies of snails was forced to travel by sled so that tures in three courses in the School<br />\neducation and associate in the In- New Yorker; and Ted Weems, director of the Editorial Research found near the Angara River, were he might be in the neighborhood of of Higher Studies, Wednesday. He<br />\nternational Institute, Teachers' Col- whose band is providing the dance Reports; Dexter M. Keezer, of the described by Alan Mosely, a grad- the Angara River when the ice<br />\nis here under the auspices of the<br />\nstaff of The Sun; and uate student of zoology at the Hop- melts.<br />\nlege, Columbia University.<br />\nmusic at present at the Hotel Penn- editorial<br />\nDonald Henderson, economist in the kins, in a recent letter to Dr. E. A. The object of this expedition is James Speyer Visiting ProfessorThe course, given in the School sylvania.<br />\nColumbia University.<br />\nAndrews, professor emeritus of zo- to compare the snails of Siberia with ship for 1932-33.<br />\nof Higher Studies in Education, is<br />\nCommittee Plans Publicity<br />\nOn<br />\nList<br />\nBarnes,<br />\nVillard<br />\nthose of the northwestern section of<br />\nology.<br />\nAn extensive publicity campaign<br />\ndesigned to acquaint American stuThe courses are: Methodology of<br />\nprovisions<br />\nsome<br />\nCanada. For the last five summers Literary Criticism, The German<br />\non<br />\nAlthough<br />\nhe<br />\ntook<br />\nMr. Blanshard has appeared<br />\ndents with the more significant edu- will be conducted under the direccational developments in foreign tion of Hyman Levin a member of the Hopkins campus several times in along, Mr. Mosely shoots rabbits prior to 1931, Mr. Mosely traveled Classical Drama, and The Contemcountries, especially China, Mexico, the Junior Prom committee. Others the past three years. Dr. Barnes is and catches fish for his food. He to the Rocky Mountain region of<br />\nporary German Novel.<br />\nItaly, and Russia.<br />\non the publicity group of the com- well-known, especially for his ar- lives in a small skin but with only Canada to study snail life there.<br />\nThis visit was made possible by<br />\n- Dr. Kandel has been a member mittee are Gardiner Hill, Robert ticles which are syndicated through- one of the natives, whom he hired Late in that year, he was awarded<br />\nof the Columbia University faculty Powell, Buck Tayman, and Henry out the country by Scripps-Howard. to take care of the boats, as a com- the Rathbun Fellowship, which had the establishment of a professorship<br />\nbeen established to promote the by James Speyer, who donated<br />\nsince 1923. He received his A.B. Beeler. The class officers, Kelly, Both Mr. Villard and Mr. Keezer panion.<br />\nVoyage Described<br />\nstudy of the geographical distribu- $50,000 to \"invite yearly a profesin 1902, his M.A. in 1906 at Man- Ted Stern, and Mike Cohen, to- are nationally noted for their ediLeaving Edinburgh, Scotland, tion of animals in foreign countries.<br />\nchester, and his Ph.D. at Columbia gether with Scott, committee chair- torial work.<br />\nsor from a German University for<br />\ncolnearby<br />\nwhere<br />\nhe had been this winter, the This award expires at the end of<br />\nmany<br />\nfrom<br />\nStudents<br />\nmost<br />\nrecent<br />\nhis<br />\nin 1910. Among<br />\nman, are in charge of the sale of<br />\ntwo months or more,to come in conbooks are \"Essays in Comparative tickets and the arrangements for the leges are eypected to attend the an- zoologist traveled to Russia. Here 1933.<br />\nIn 1928, Mr. Mosely was award- tact with the students and profesnual conference. In the past, it was his progress was hindered since he<br />\nEducation,\" \"History of Secondary orchestra.<br />\npermit<br />\nfrom<br />\nthe<br />\nhas<br />\ned<br />\na B.S. degree from the Univer- sors, not necessarily to give a regconclave<br />\nobtain<br />\na<br />\nfirst<br />\nhad<br />\nto<br />\nClub<br />\nLiberal<br />\nA sponsor for the Junior Prom said, the<br />\nEducation,\" and \"Reorganization<br />\nthe<br />\non Page 4, Col. 5) ular course of lectures.\"<br />\nBecause<br />\n(Continued<br />\nGovernment.<br />\nsuccess.<br />\nSoviet<br />\nproved of interest and<br />\nof Education in Prussia.\"<br />\nis to be chosen soon.<br />\nQuestionnaire Sent Out<br /><br />\nJUNIOR PROM TICKET LIBERAL CONCLAVE<br />\nIS SET AT $2.50 BY IS SCHEDULED FOR<br />\nDANCE COMMITTEE MARCH 10-11 HERE<br /><br />\nCOLUMBIA PROFESSOR<br />\nIS LECTURING HERE<br /><br />\nHardshipsHinderHardyHopkins<br />\nStudent Seeking Siberian Snails DR. J. PETERSEN WILL<br /><br />\nGIVE THREE COURSES<br /><br />\n2<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 3, 1933<br /><br />\nUbe 71/ewsoletter Dr. G. Gruenbaum<br /><br />\nINTERCO<br /><br />\nLLEGIATE<br />\nCAMIDUS<br />\nSubscription per year<br />\n$2 00<br />\nBy<br />\nRemit subscription fees to John Myers, treas- Is<br />\nNEWS<br />\nUIRIEVITIEff<br />\nurer, Student Activities Council, Gilman Hall,<br />\nBy MILLARD LANGFELD, JR.<br />\nPostoffice, Johns Hopkins University.<br />\nAn ambitious student at the University<br />\nUnfolding the sophisticated and de- as much at home behind the footlights as<br />\nEntered as second-class matter<br />\nJack Dempsey<br />\n3,<br />\n1909, at the Postoffice in Baltimore,December<br />\nMd., under<br />\nof Colorado worked his way through col- lightfully amusing story of the round- they are behind a microphone. Peggy<br />\nJack Turnbull<br />\nthe Act of Congress November 3, 1879.<br />\nthe-town adventures of a rich and typic- Healy, Paul Whiteman's latest feminine<br />\nan address delivered at the lege by washing 150,000 windows.<br />\nJack Henderson<br />\nally English young man of affairs, Spring discovery, puts over several popular<br />\nPublished semi-weekly from October to June, In<br />\n* *<br />\nexcept during examination and college holiday Playshop on Monday, Dr. Gustav<br />\nJack Sharkey<br />\nTime For Henry, the current stage hit numbers in great fashion, and one can<br />\nperiods by undergraduates of the Johns Hopkins<br />\nthe Maryland is ably living up to its readily realize why they call her \"The \"Jack\" Johnson—<br />\nUniversity.<br />\nGruenbaum, associate professor of The Catholic University Tower sug- at<br />\ngests the only way to end this depression reputation of being one of the most Personality Girl.\" Miss Healy possesses These boys will probably be all acquainted<br />\nMember of The Intercollegiate Newspaper As- Romance Languages, discussed the<br />\nclever comedies ever to emanate from a world of charm and ability.<br />\nwould be to repeal the law of gravity— the pen of Benn Levy,<br />\nsociation of the Middle Atlantic States and<br />\nthat talented and<br />\nThere are four other acts featuring with Promoter Jack Curley.<br />\nof The National College Press Association.<br />\nlife of Luigi Pirandello, eminent then everything would<br />\nwitty playwright.<br />\ngo up.<br />\n0-0<br />\ncomedy, songs, and acrobatics.<br />\nItalian playwright, in relation to its<br />\nWith the inimitable Henry Hull in the<br />\nThe screen feature presents Richard<br />\n• *<br />\nOffice phone<br />\nDame Rumor has it that there is a<br />\nUNiversity 7383<br />\nleading<br />\nrole and a<br />\nof unusual merit Dix in his latest success, \"The Great<br />\nEditor's home phone_____UNiversity 1379 reflection in his works.<br />\nIndiana University claims the record and suitability, thiscast<br />\npeculiarly brilliant Jasper, a comedy drama that depicts the couple of thousand dollars in the Treasof<br />\ncoca-cola<br />\nconsumption. About 2375 and penetrating farce is rounding out a life of a careless young Romeo who starts ury given by the Alumni for a squash<br />\nThe lecture was followed by one<br />\nBusiness communications should be addressed<br />\nto the Business Manager, Johns Hopkins<br />\nweek of consistent success and popu- out in life as a street car motorman, and court..<br />\nUni\"cokes\"<br />\nare<br />\ndispensed<br />\ndaily.<br />\nof Pirandello's one-act plays, \"The<br />\nversity. All articles and communications<br />\nlarity.<br />\nfinally ends up as the world's greatest<br />\nutining to the editorial department should per* * *<br />\n0--0<br />\nbe<br />\nWar a La Tracy<br />\nforwarded to the Editor-in-Chief, Johns Hop- Imbecile,\" the principal parts being<br />\nfortune teller. Dix is given grand supIn a questionnaire given to a class at<br />\nkins University.<br />\nWe suggest that George Packard inFeaturing Lee Tracy, well known star port in this picture by Edna May Oliver<br />\ntaken by Peter Weisengoff, Samuel the University<br />\nstall a mail box in his car.<br />\nof Oklahoma, Al Capone of many a Broadway stage and screen and Wera Engels.<br />\nSelsky, Mary Alvey, and Charles was the only name in a list of fifty that success, in the type of role just suited One of the most unique plays of the<br />\nEditorial Department<br />\n0-0<br />\nhis style and personality, Private present season will be shown in BaltiHirschfield. Miss Jane Hutzler di- was correctly identified by all the stu- for<br />\nEditor-in-Chief<br />\nJones opens at Keith's Theatre today.<br />\nBeta Doug Williamson crashes through<br />\nmore next week when the Vagabond<br />\nHYMAN LEVIN, '34<br />\ndents.<br />\nrected the presentation.<br />\nFilmed against a background of battle Players present Adding Machine, Elmer with a hit with the Black<br />\nand Blue Jay<br />\nManaging Editor<br />\n* * *<br />\nsets so realistic as to defy detection by Rice's stirring drama on death and the<br />\nNORMAN HEANEY, '34<br />\n\"Intercepted<br />\nLetters.\"<br />\nThe next activity of the Playshop<br />\nthe<br />\nmost<br />\nsearching<br />\nstudent<br />\nof affairs mil- beyond.<br />\nAssistant Managing Editors<br />\nAt the University of Giesson, Germany, itary, this production<br />\n0-0<br />\ntells the amusing<br />\nMARTIN PERLMUTTER, '34<br />\nwill be on March 10, when a lecture<br />\nVagabonds Shine<br />\nthe students do not hesitate to express tale of the beloved doughboy of the 'Ole<br />\nMILLARD LANGFELD, JR., '34<br />\nThe S. P. E.'s want to be identified as<br />\nFor 25 years Mr. Zero has worked<br />\non \"The American Theatre Today\" their opinion on a lecture. When the Bill type.<br />\nJunior Editors<br />\nfaithfully over the books of a tyrannical Sig Eps, but we claim that this sounds<br />\nRichard Feise, '35<br />\nDaddy<br />\nemployer, only to be dismissed—a victim<br />\nPhilip Hamburger, '35<br />\nwill be given by Dr. N. Bryllion students disagree they shuffle their feet; AccompaniedSugar<br />\nby gay music and bright of the machine age. In a despairing too much like a burp.<br />\nAssociate Editors<br />\nwhen they approve a round of applause songs, Broadway<br />\no—o<br />\nDad, current attrac- frenzy he commits murder and suffers<br />\nDonald Proctor, '33<br />\nFagin, the director. This will be prevails.<br />\nJ. Marion Grove, '33<br />\ntion at the New, tells the old, old story the extreme penalty at the hands of the<br />\nHy Levin's name figured so prominently<br />\nSanford Sarney, '33<br />\n* * *<br />\nof a Broadway butterfly who pays too state.<br />\nfollowed by a presentation of a onein the Blue Jay that some people conMordecai Edelman, '33<br />\nhigh to see her names in the bright bulbs<br />\nHis adventures after he has passed fused the magazine<br />\nIt<br />\nappears<br />\nas<br />\nthough<br />\nwith THE NEWSSports Editor<br />\nHarvard<br />\nnot only of this grandest of canyons. But it tells down the last mile and through that little<br />\nact play by Edward John KirschBernard Verlin, '33<br />\ntook a \"beating\" from Yale in football, it with a new twist and punch which is green door of the execution chamber form LETTER.<br />\nReporters<br />\nbaum.<br />\nbut in grammar as well. Before the game really original, and tells it well.<br />\nthe nucleus of an enthralling evening.<br />\n0—o<br />\nerome Blum, '34; Samuel M. Doctofsky, '34;<br />\nStanley Stillman, '34; S. J. Berkowitz, '33;<br />\nWith Joan Blondell, Ricardo Cortez,<br />\nA Daughter of Her People will remain<br />\nPreparations<br />\nYale<br />\nBuck<br />\nTaiman<br />\nare<br />\nhas<br />\nreceived<br />\nalready<br />\nunder<br />\nbeen criticized or<br />\nthe<br />\nfollowing<br />\ntelegram:<br />\nA. E. Gutman, '35; Sylvan D. Solarz, '35;<br />\nGinger Rogers, and a troup of some of at the Europa Theatre for another week,<br />\nE. R. Harrison, '35; Leonard Wallenstein, way for<br />\n\"The Harvard Athletic Association Hollywood's prettiest (and<br />\ncommended on his recent gigolo act out<br />\nthey<br />\npresentation<br />\nthe<br />\nmake<br />\n'ern<br />\nfullwhile on the same program a travel film,<br />\nof a<br />\n'36; Stanley E. Blumberg, '36; Abe Edelwishes you good luck in tomorrow's nice out there), Broadway Dad is guar- Jerusalem, The Holy City,, will provide in the Forest Park district.<br />\nman, '36; Irving Lottman, '34; Melvin<br />\nGoldberg, '36; Herschel Levin, '36; S. R. length comedy to be given in April. game. May the best team win.\" Yale anteed to shake you out of all those blues. pleasing support.<br />\n0-0<br />\nDunn, '33; Carson Frailey, '35; Carl<br />\nRhythm Boys<br />\nSuccesses And Orchids<br />\nman, '36; Leonard Paymer, '35; HartIt won't be long now before the politwired back: \"The Yale Athletic AssoFred<br />\nPaul<br />\nWhiteman's<br />\nBang, '36.<br />\nRhythm<br />\nwith<br />\nAnd before we go to sit before our<br />\nciation wishes you luck in tomorrow's Peggy Healy, are commandingBoys,<br />\nthe spot- bank and gaze wistfully at the door, we ical machinery- will get under way. Acgame. May the next better team win.\" light billing at the Hippodrome Theatre must throw an orchid to Mr. Harry tivity elections are scheduled for this<br />\nBusiness Department<br />\nFOUNDED 1897<br /><br />\n11-1 LAT IU V II CIA'S<br /><br />\nJ.H.U. Playskop<br />\nSpeaker<br /><br />\nBusiness Manager<br /><br />\n1VLNURICE R. CHASSIN, '33<br />\nAdvertising Manager<br />\nWM. N. MEYERS, '33<br />\nCirculation Manager<br />\nMORTON ROME, '33<br />\nOffice Manager<br />\nEDGAR BLUMSTEIN, '34<br />\nharIes Ney, '33: Abram Burk, '34; Leonard<br />\nHarris, '34; Harold Kantrow, '35; Irvin<br />\nBlum. '35; Bert Prager, '35; Bert<br />\nGordon,<br />\n'35; Ray Goldberg, '35 ; Allan Delevett, '36;<br />\nCharles Hastings, '36.<br /><br />\nHeaney, ,Blumstein<br />\nNamed To Chief<br />\nPosts On Paper<br /><br />\nthis week. Heard many times over the IIenkle of Ford's for Counsellor-At-Law, month.<br />\n*<br />\nair, as a feature of Whiteman's broad- one of the finest shows he has brought to<br />\nMen students at Columbia University casts, these four boys prove they are just that time-honored stage.<br />\napprove of fraternities as ideal places to<br />\nhang their hats, swell places for freshmen<br />\nto obtain advice, and they present the<br />\nway to political advancement.<br /><br />\n(Continued from Page 1, Col. 1)<br />\nhave been brought about. I am in Thirty Barnard girls nursed bruises<br />\nno position to definitely say whether after entertaining 100 frosh from Columbia University at a recent dance.<br />\nPrinted by<br />\nthe new head will carry on the ediH. G. ROEBUCK &amp; SON<br />\n* * *<br />\n119 W. Mulberry St<br />\nBaltimore, Md. torial policies which have been folA lecturer on cowboy songs at Vassar<br />\nFRIDAY, MARCH 3, 1933<br />\nlowed since my election in March, College was drawn aside by eight girls<br />\n1932. But I can assure the cam- who stated that they did not think he<br />\nwas fair in having two lectures, one for<br />\nThe Editor's Farewell<br />\npus that Heaney will do what is best mixed audiences and one for male, and<br />\nFORTUNATELY, this publication and will<br />\nshow that he can handle the that they wanted his lecture for male auwill carry on as the official University<br />\ndiences.<br />\nnewspaper, beginning with today's issue, position to which he has been named.<br />\n* * *<br />\nunder the direction of a new, yet expe- I am ready to stick by him and the<br />\nAppropriate atmosphere was given a<br />\nrienced, editorial board consisting of four<br />\npaper throughout our senior year recent lecture held at Rio Grande Colmen who will be seniors next fall and<br />\nlege. The topic was on \"Love and Martwo who will be juniors. With this is- and for the remainder of our present riage\" and the lights<br />\nwere dimmed.<br />\nsue, the editor-in-chief, Hyman Levin, junior term.<br />\n* *<br />\nwho held this post since the close of his<br />\n\"Undoubtedly, Heaney will an- A Wisconsin professor has come to the<br />\nsophomore year, will turn over the leadership Of THE NEWS-LETTER to a new nounce his editorial platform within defense of the much-maligned practise<br />\nknown as \"cramming.\" He claims that<br />\nhead, Norman Heaney, who will indubit- the<br />\nnext two weeks. I am confident matter learned rapidly is retained better<br />\nably display his capability as director of<br />\nthat he will make every effort to than that gained after hours of applicathe publication.<br />\ntion.<br />\nRetirement from the head of such a carry on the splendid editorial spirit<br />\n* * *<br />\npublication as this at the close of one's of the paper.<br />\nAt Detroit University the students de-<br /><br />\njunior year naturally brings to one pangs<br />\nmanded that the number of co-eds be inExpresses Gratitude<br />\nof deep regret. But there is a consolation<br />\ncreased<br />\nor cut out entirely.<br />\nfor the retiring head, on this occasion, in \"My gratitude for the<br />\nkindness and<br />\n* * *<br />\nthat he has been kindly afforded the opportunity to do his part, as advisory edi- courtesy displayed by the board of<br />\nA student at the University of Washtor-in-chief, to which honorary post he control in its appointment of me to ington, who had flunked out and was pehas been appointed by the board of conthe honorary post of advisory edi- titioning for reinstatement, was asked<br />\ntrol, in keeping THE NEWS-LETTER at its<br />\nif the cause of failure had been removed.<br />\npresent high standard of news content, tor-in-chief is indeed too great for He answered \"Yes, I married her.\"<br />\neditorial content, and make-up, as well as adequate expression in this state• *<br />\nin improving the paper still more.<br />\nment. In this position I am afforded The Yale Bulldog issued the following<br />\nThe new editorial board, which will<br />\nfirst-aid hint: \"In case of severe nose<br />\nthe<br />\nwelcome opportunity to advise<br />\nserve until March, 1934, is without a<br />\nbleed, it is not advisable to put a tournidoubt interested in journalism, in THE the editorial board on problems quet around the neck.\"<br />\nNEWS-LETTER as a University publica* *<br />\nwhich arise in the course of pubtion, and in the welfare of the campus.<br />\nAccording to an investigation at the<br />\nThough the editorial policies may be al- lishing the University paper.\"<br />\nUniversity of Iowa only one out of eleven<br />\ntered somewhat, this paper will continue,<br />\nHeaney, the new editor-in-chief, college engagements result in marriage.<br />\nas it has—as an influential University<br />\nis<br />\na student in the School of Bus•<br />\n*<br />\norgan with the view of presenting all the<br />\nnews and of exercising what power a iness Economics and will be gradA \"depression\" course has ben orgaencollege paper should and can through its<br />\nuated in June, 1934. He is a junior ized in the graduate school of business adeditorial columns.<br />\nministration at Stanford University.<br />\n• *<br />\nWhether or not the policies of the out- manager of the Musical Club and of<br />\ngoing editorial board have been accepted the lacrosse team here. Recently he<br />\nAccording to a recent survey, there are<br />\nwholly by the entire campus it has been<br />\nwon the 0. D. K. essay contest for more people in penal institutions than in<br />\nevident and proven that THE NEWSeducational institutions.<br />\nLETTER has risen, since last March, from the second time in three years. He<br />\n* * *<br />\nthe ranks of a \"house organ,\" \"yessing\" joined THE NEWS-LETTER staff in<br />\nIt pays to get good grades at Califorthe authorities and the campus leaders, to<br />\nNovember, 1930, and was promoted nia. If a student receives a grade of<br />\na real college paper with the courage to<br />\nsay what it believes and to adhere to its to assistant managing editor and to \"A\" in the mid-year exam, he is excused<br />\nfrom the course and receives a five-dollar<br />\nconvictions. Recapitulation of the suc- managing editor.<br />\nrebate.<br />\ncessful editorial campaigns is unnecessary<br />\n* * *<br />\nBlumstein New Manager<br />\nat this time. The list is comparatively<br />\nlengthy.<br />\nBlumstein, who will serve as bus- A report from Loyola states that the<br />\ncollege man of today has three desires;<br />\nIt is probable that this spirit will be<br />\niness manager now, is assistant man- the pig skin, the sheep skin, and the skin<br />\ncarried on, even if slightly modified, by<br />\nthe new editor-in-chief and his associates. ager of the basketball team and you love to touch.<br />\n* * *<br />\nOf course, it seems almost needless to<br />\nstate that Heaney will have the privilege<br />\nof doing as he cares, despite what foundation has been laid.<br />\nThe retiring editor-in-chief and newly<br />\nappointed advisory editor takes this opportunity to thank the University authorities and activity heads for their cooperation, to congratulate and wish the best<br />\nof luck to Heaney and the new editorial<br />\nboard, to publicly express a deep appreciation for the inimitable cooperation<br />\ngiven by our printers, H. G. Roebuck &amp;<br />\nSon, and to express a hope for the continued success of THE NEWS-LETTER.<br /><br />\nmanager of the cross-country squad.<br />\nGirls were worth their weight in gold<br />\nHe served as office manager of THE at a dance held at M. I. T., where adNEWS-LETTER from last March to mission was one cent a pound, with an<br />\nadditional tax of 10 cents for brunettes,<br />\nWednesday of this week.<br />\n15 cents for blondes, and 20 cents for<br />\nOf those elected, five will be red-heads.<br />\n* * *<br />\ngraduated in 1934 and five, in 1935.<br />\nfollowing<br />\nThe<br />\nis a poem which apThe retiring editor-in-chief was<br />\npeared in the Fordham Ram:<br />\nnamed assistant managing editor in \"A wise little co-ed from Troy<br />\nhis freshman year and editor-in- Went out with a young Cooper boy,<br />\nWhen he gave her his pin<br />\nchief at the end of his sophomore<br /><br />\nyear.<br /><br />\nShe exclaimed, \"Why, its tin!\"<br />\n\"Begad,\" cried the lad, \"that's alloy.\"<br /><br />\nAfter College<br />\nWHAT?<br />\n•<br /><br />\nEngineering?<br /><br />\nCoal... silk stockings. .. meat<br /><br />\n—and the telephone<br />\nKeenly aware of the problems of business, large<br />\nand small, Bell System commercial men are constantly devising special telephone plans to customfit service to the user's needs.<br />\nFor example, a plan they worked out for a<br />\ncoal distributor helped him to contact 50% more<br />\ndealers. A manufacturer, using a telephone selling<br />\nplan, sold 700 dozen pairs of hosiery through<br />\none Long Distance call. A great meat packer<br />\nhandles complex sales and distribution problems<br />\nefficiently with the aid of planned Long Distance<br />\nand private wire services.<br />\nSystematic telephone plans are helping many<br />\nusers to build business — cut costs — handle collections — unify nationwide organizations — increase<br />\nprofits. And Bell System men are seeking still<br />\nother ways to make the telephone more useful.<br /><br />\nBELL SYSTEM<br /><br />\nHarry D. Watts, V. P. of James<br />\nStewart &amp; Co., Inc., builders of<br />\nfamous buildings throughout the<br />\nworld, says: \"World progress depends upon engineering. No wonder eager college men look toward<br />\nthis profession. But to succeed<br />\nyou must have a technical background, ability to take the<br />\nknocks, and alertness to take<br />\nadvantage of the breaks.\"<br /><br />\ntake the knocks.\" And<br />\nA yet brains<br />\ncount above all.<br />\nMITY to<br /><br />\nThat's why in engineering, as in college, a pipe is the favorite smoke. A<br />\npipeful ofgood old Edgeworth Smoking Tobacco clears the brain for those<br />\nintensive problems that confront the<br />\nengineer ... or the college man.<br />\nOf course most college men know<br />\nEdgeworth.* They like its distinctive<br />\nflavor that comes only from this blend<br />\noffine old burleys. Perhaps you'd like<br />\nto try before you buy. Then just write<br />\nto Larus &amp; Bro. Co., io5 S. 22d St.,<br />\nRichmond, Va., and you'll get a free<br />\nsample packet of Edgeworth.<br />\n*A recent investigation showed Edgeworth the<br />\nfavorite smoke at 42 out of 54 leading colleges<br /><br />\nEDGEWORTH<br />\nSMOKING TOBACCO<br />\nBuy Edgeworth<br />\nanywhere in two<br />\nforms—Edgeworth<br />\nReady - Rubbed<br />\nand Edgeworth<br />\nPlug Slice. All<br />\nsizes —150 pocket<br />\npackage to pound<br />\nhumidor tin.Some<br />\nsizes in vacuum<br />\nsealed tins.<br /><br />\nTELEPHONE HOME ONE NIGHT EACH WEEK I<br />\n. . . LOWEST RATES AFTER EIGHT-THIRTY j<br /><br />\nFor Better Work Call<br /><br />\n6<br /><br />\nNEW and REBUILT TYPEWRITERS<br />\nALL MAKES, SOLD LIKE RENTING, PAY MONTHLY<br />\nA Machine For Every Purse and Purpose<br /><br />\nFROM $19.75 TO $126.00<br />\nAll Repairs, Supplies<br />\nRENT ANY MAKE — SPECIAL RATES<br />\nBe Sure To Try a MONARCH NOISELESS<br />\nBefore Purchasing Any Portable Typewriter.<br /><br />\nAMERICAN WRITING MACHINE CO.<br />\n18 PARK AVENUE<br />\n•<br /><br />\nPLaza 2060<br /><br />\n(Serving and Saving Typewriter Users for 52 Years)<br /><br />\nFried's Cleaning<br />\n101 E. 21ST STREET<br />\nPhone BElmont 5501<br /><br />\nJ. H. FURST CO.<br /><br />\nPRINTERS OF<br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 HOPKINS PLAaa, BALTIMORE<br /><br />\nHOME WOOD, BALTIMORE, MD., MARCH 3, 1933<br /><br />\nAuthor<br />\nJAY QUINT BEATEN Dr.OfRoulston<br />\nCritical Conrad<br />\nBY MT. ST. MARY'S F. Meyer's Edition<br />\nTEAM BY 32-29<br />\nHopkins Rally In Last Quarter Of Contest Falls<br />\nShort<br />\nAnother defeat marked the closing of the basketball season, as far<br />\nas Hopkins is concerned, when a<br />\nMt. St. Mary combine beat the Jays<br />\nlast Tuesday night at Evergreen.<br />\nThe final score was 32-29.<br />\nA Jay rally in the last quarter of<br />\nthe contest fell short. From beginning to end the Mountaineers held<br />\nthe upper hand both in attack and<br />\ndefense.<br /><br />\nAn historical-critical edition of<br />\nConrad Ferdinand Meyer's \"Huttens Letzte Tage\", which may be<br />\nconsidered as establishing the foundations for all future studies of that<br />\nwork, has just been released by the<br />\nJohns Hopkins Press. The author<br />\nof the volume is Dr. R. B. Roulston,<br />\nprofessor of German here.<br />\nThe project has been undertaken,<br />\nit was stated, with the aim first, of<br />\n\"establishing the true history of the<br />\ntext of the work of the Swiss poet,<br />\nand second, of rendering accessible<br />\nto students of Meyer all of the material necessary for the study of his<br />\npoem, within the compass of one<br />\nvolume.\"<br /><br />\nBrooklyn Wrestlers Beat<br />\nHopkins Matmen By<br />\n23-5 Score<br />\nBrooklyn Polytechnic proved sufficiently strong to conquer the Johns<br />\nHopkins grapplers last Saturday<br />\nnight, 23-5. Only Captain Hamilton Sears, wrestling in the 165-1b.<br />\nclass, was able to chalk up a victory.<br />\nNext to Captain Sears, Bachman,<br />\nwho grapples in the 115-1b. class,<br />\ngave the best exhibition.<br />\nThe curtain will be brought down<br />\non the season this week end. Tonight Gallaudet will be encountered<br />\nat Washington, and tomorrow<br />\nnight Western Maryland will be engaged at Westminster.<br /><br />\nDr.Seymour To Deliver<br />\nEight Shaw Lectures<br />\nBeginning March 6<br />\n\"American Diplomacy During the<br />\nWord War\" will be the general topic<br />\nof a series of eight lectures, to be<br />\ngiven at the Hopkins, beginning<br />\nMarch 6 by Dr. Charles Seymour,<br />\nSterling professor of history and<br />\nprovost of Yale University.<br />\nThe lectures are being delivered<br />\nunder the auspices of the Albert<br />\nShaw lectureship and of the Page<br />\nSchool of International Relations.<br />\n\"The German Appeal to Wilson\"<br />\nand \"The Negotiation of the Armistice\", to be given March 6 and 8,<br />\nrespectively, will be open to the<br />\npublic.<br /><br />\nFinal Sale of the Season!<br />\nAll remaining readymade Suits, Overcoats<br />\nand Topcoats<br /><br />\nKATZ CLOTHES<br />\n211 - 213 E. Baltimore Street<br /><br />\n••••••••••••••••••••••••••••••••••••••••••.....e<br /><br />\nPhone Belmont 7908<br /><br />\nBIRELY'S<br />\nPHARMACY<br /><br />\nMounts Always Lead<br /><br />\nWith the exception of parts of the<br />\nlast period, the Mounts retained at<br />\nleast a seven-point lead. The visiting team showed keen ability at retrieving rebounds under its own and<br />\nunder Hopkins's basket. Likewise,<br />\nthe Mounts' center man, Hopkins,<br />\nconstantly obtained the tap-off.<br />\nThus his team had possession of the<br />\nball most of the time.<br />\nThe second cause of the Jay defeat was the performance of the<br />\nLynch brothers. Tom thrilled the<br />\naudience with his sharp cutting for<br />\nthe basket, while Joe fed passes to<br />\nhis teammates and guarded Caleb<br />\nKelly without any difficulty.<br />\nThe Black and Blue team's loss<br />\nresulted from faults that have been<br />\nthe cause of almost all its defeats.<br />\nIn the first place, the team tried to<br />\nplay in a manner suitable against a<br />\nzone defense, while the Mounts<br />\nstarted with a zone defense and immediately switched to man-for-man<br />\nstyle.<br /><br />\nHopkins Playshop<br />\nTo Sponsor Conclave<br /><br />\nMARYLAND THEATRE<br /><br />\n(Continued from Page 1, Col. 4)<br />\nassociate professor of English at the<br />\nJohns Hopkins University, and reports of the activities of theatres<br />\nrepresented will be read.<br />\nFollowing the luncheon hour Dr.<br />\nFagin will conduct a round<br />\ntable discussion on the \"Function of<br />\nthe College Theatre\", followed by a<br />\ntalk on problems of play production<br />\nby Miss Dorothy Elderdyce, director of dramatics at Westminster<br />\nSeminary.<br />\nThe meeting will then adjourn<br />\nuntil 8:30 p. m., when the members<br />\nof the conference are invited to witness the production of a modern<br />\nAmerican play at the Playshop.<br /><br />\nHENRY HULL<br /><br />\nTrack Coach Asks For<br />\nMore Candidates At<br />\nTrack Practice<br />\nAt a recent meeting of the track<br />\nteam, Coach Waldo Hambleton emphasized the need for more candidates in the middle distances and<br />\nthe field events.<br />\nAccording to Manager Bruce<br />\nHerman, there will be only two<br />\nhome meets this year. Delaware<br />\nUniversity will provide the opposition for the Jay trackmen on<br />\nApril 15 at Homewood, while<br />\nMaryland will invade the Black and<br />\nBlue field on May 20. This marks<br />\nthe first time in four years that the<br />\nTerp-Jay meet will take place at<br />\nHomewood.<br />\nPresent indications point to a<br />\nsuccessful campaign. Most of the<br />\nmembers of last year's squad are<br />\nagain available for service, and will<br />\nbe supplemented by a group of<br />\npromising freshmen.<br />\nEquipment has been given out to<br />\nmembers of last year's varsity. Candidates are urged to come out. Praefizz is held daily at 4 P. M. at<br />\nRo ewood Field.<br /><br />\nOUR ADVERTISERS<br /><br />\nST. PAUL at 33RD STREET<br />\nYour Neighborhood Drug Store<br /><br />\nIn the International Farce Comedy Hit<br />\nin New York — Now a Hit of London)<br />\nWeeks<br />\n(26<br /><br />\nPRESCRIPTIONS<br />\nI School Supplies, Candy, Cigars I<br />\nUnexcelled Fountain Service ;<br />\nMake Our Store Your Store<br /><br />\n'ARUNDEL ICE CREAM SHOPPC<br />\nBAKERY, CONFECTIONERY<br />\nSandwiches — Sodas — Sundaes<br />\n2436-A N. CHARLES ST.<br />\nCHesapeake 9495<br /><br />\n111••••••••••••••••••••••••••••••••••..................................<br /><br />\n'SPRINGTIME FOR HENRY'<br /><br />\n\"What is impossible to others is possible to us.\"<br />\nMoth Holes, Burns, Tears, and Cuts in Clothing, Linens, and Silk Rewoven Perfectly.<br />\nUNEXCELLED SERVICE<br /><br />\nBy BENN W. LEVY<br />\nWith GAVIN MUIR — EDITH ATWATER<br /><br />\nRELIABLE WEAVING CO.<br /><br />\nEvenings: 50c to $2— Matinee Saturday: 50c to $1.50<br />\nMATINEE THURSDAY: Best Seats $1.00, Plus 10 percent Tax<br />\nPRESENT THIS ADVERTISEMENT AND OBTAIN TICKETS<br />\nFOR TONIGHT, SATURDAY MATINEE AND NIGHT AT<br />\n50 PERCENT REDUCTION<br /><br />\nVE rnon 1868<br /><br />\n208 WEST SARATGOA STREET<br /><br />\nIvIANIctmuNG-8 A. M. to 8 P. M. Daily f<br />\n8 A. M. to 10 P. M. Saturday?<br />\n4<br />\ne<br /><br />\nTheodore's Barber Shop 4+<br /><br />\nFormerly with EMIL CAYE<br />\nS. W. Cor. St. Paul and 33rd Streets<br />\nNext to Birely's<br />\n%<br /><br />\nPEABODY<br />\nPHARMACY<br />\nCALVERT and 30TH STS.<br />\n'We sell Drugs and Give Service'<br />\n9<br /><br />\nPeo vie _know it..<br />\n‘‘<br /><br />\nAerievAid<br />\n1,<br />\ncy<br />\nallyy<br /><br />\nJay Rally Fails<br /><br />\nThe Mounts were leadin, 30-22.<br />\nCamitta made good a foul toss and<br />\nSiverd added a two-pointer. J.<br />\nLynch retaliated with a field goal,<br />\nbut Don Kelly matched this with a<br />\nlong one. With but seconds to go,<br />\nthe Jay captain took another long<br />\none from beyond mid-court. The<br />\ntimer's gun went off but the ball<br />\ncontinued on its way to the last<br />\nHopkins score.<br /><br />\nPATRONIZE<br /><br />\n•61<br /><br />\nJay Attack Slow<br /><br />\nHopkins, however, continued to<br />\nset a slow, methodical pace instead<br />\nof cutting fast for the basket. Consequently the Jays had to make most<br />\nof their shots from long range. To<br />\nmake matters worse, their shooting<br />\nunder the basket, on the few opportunities they were able to do so, was<br />\nunusually poor.<br />\nOnly during the beginning and<br />\nthe close of the second half did the<br />\nJays speed up the contest and with<br />\neach effort Mount St. Mary's lead<br />\nwas quickly diminished but not overcome. Particularly thrilling was the<br />\nclosing rally.<br /><br />\nOFF<br /><br />\nTHEN smokerskeep buying the<br />\nsame cigarette day after day...<br />\nit's a pretty good sign that they're<br />\ngetting what they want... mildness,<br />\nbetter taste — a smoke that's always<br />\nthe same.<br />\nSo we're going right on making<br />\nChesterfields just as we always have<br />\n... selecting choice, ripe tobaccos<br />\n... ageing them... blending and<br />\ncross-blending them...making them<br />\ninto cigarettes in the most scientific<br />\nways that are known.<br />\nAs long as we do these things we<br />\nknow that smokers will continue to<br />\nsay,\"They Satisfy\". For that's what<br />\npeople are saying about Chesterfields.<br />\nIf you smoke, why not find out<br />\nabout them? A package or two will<br />\ntell you the whole story.<br /><br />\nN<br /><br />\nTHEY'RE MILDER—<br />\nTHEY TASTE BETTER<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 3, 1933<br /><br />\n4<br /><br />\nPlans For Banquet<br />\nELECTS Levin, Chassin Retire From Engineering Society<br />\nPRESS PUBLISHES HISTORY CLUB<br />\nO'ROURKE PRESIDENT Chief Posts Of News-Letter To Hold Dance Here Are To Be Discussed<br />\nINTERNATIONAL LAW<br />\nSTUDY BY F. S. DUNN<br />\nTickets Will Cost $1.10; Are To<br />\nPlans for future dances and a<br />\nBe Placed On Sale In Near<br />\nfather and son banquet to be held by<br />\nFuture, It Is Announced<br />\nthe Johns Hopkins DeMolay Club<br />\nA dance, sponsored by the Amer- will be discussed at a meeting of the<br />\nican Society of Civil Engineers, is organization today, at 12:20 in Levto be held at Levering Hall soon.<br />\nering Hall.<br />\nNegotiations are now being carried<br />\nIt is urged that all Members be<br />\non to secure an out-of-town orchespresent in order that a definite<br />\ntra.<br />\ncourse of action may be decided<br />\nTickets are to be $1.00, plus tax, upon.<br />\nand will be on sale at an early date.<br /><br />\n\"Protection Of Nationals\" Is<br />\nThe Title Of New<br />\nAt a recent meeting of the InterBook<br />\nnational Relations Club, Vernon O'Rourke, graduate student in<br /><br />\nOTHER LAW BOOKS the p olitical science department,<br />\nTO BE PUBLISHED was elected pesident; Mrs. L. P.<br />\nHamburger Jr., of the history de-<br /><br />\nCommentary On The Russian partment, vice-president; and E.<br />\nDebt Situation ForthVan Sant, secretary and treasurer.<br />\ncoming<br />\nThe International Relations Club<br /><br />\nDetermines Governmental Action<br /><br />\nThe study determines the actions<br />\nof governments in dealing with<br />\nquestions of protection; and it<br />\nreaches the conclusion that the introduction of extra-legal factors in<br />\nthe disposition of contentious issues<br />\nis unavoidable.<br />\nWith this analysis, the author<br />\noffers a new theory to serve as the<br />\nbasis of international responsibility<br />\nfor injuries to aliens.<br />\nSeveral publications of the Hopkins that are forthcoming from the<br />\nPage School of International Relations are: \"The Soviet Government<br />\nand the Russian Debts,\" which is an<br />\ninquiry into the nature and present<br />\nstatus of the question by Lazare<br />\nTeper ; and \"Manifest Destiny\", a<br />\nstudy of nationalists expansionism<br />\nin American history, by Albert K.<br />\nWeinberg.<br /><br />\nMosely, Grad Student,<br />\nSeeking Siberian Snails<br />\n(Continued front Page 1, Col. 5)<br />\nsity of Manitoba. After entering<br />\nthe Hopkins as a graduate student,<br />\nhe was appointed a student instructor. For a time he was a substitute<br />\ninstructor at the University of<br />\nNorth Carolina.<br /><br />\n—Courtesy Sun papers<br /><br />\n—Courtesy Sun papers<br /><br />\nHYMAN LEVIN<br />\nHyman Levin, who is a junior in the<br />\nCollege of Arts and Sciences at the Hopkins, today is succeeded to the position<br />\nof editor-in-chief of THE NEWS-LETTER.<br />\nIn retiring from the head of the paper,<br />\nLevin becomes, by special appointment,<br />\nadvisory editor-in-chief until March, 1934.<br />\nNamed to the honorary post in recognition of his work in the improvement of the<br />\nnewspaper, he will serve as a non-voting<br />\nmember of the board of control and as<br />\nadviser to the staff.<br /><br />\nMaurice R. Chassin, who is taking special courses at the School of Hygiene<br />\nand Public Health, retires from his position of business manager. He will be<br />\ngraduated from the A.B. school in June.<br />\nHe is a member of 0. D. K., captain of<br />\ntrack team, treasurer of Pi Delta Epsilon,<br />\nand advertising manager of The Hullabaloo staff.<br />\nBoth retiring NEWS-LETTER heads were<br />\nelected on March 24, 1932.<br /><br />\nMORRISON &amp;<br />\nFIFER<br />\nLINDEN and DOLPHIN<br />\nWish To Announce the Purchase of<br /><br />\nBacon's Drug Store<br />\nSt. Paul and 31st Street<br />\n\"We Solicit Your Patronage\"<br /><br />\nIn order to have an active mind you must have a healthy body<br />\nEAT<br /><br />\nMAURICE R. CHASSIN<br /><br />\nAT<br /><br />\nTHE<br />\n,, ,,<br /><br />\nWith several other publications<br />\nforthcoming the Johns Hopkins<br />\nPress recently published \"The Protection of Nationals\", by Frederick<br />\nSherwood Dunn, associate member<br />\nof the Page School and Creswell<br />\nLecturer on international law in The<br />\nJohns Hopkins University.<br />\nAs a study in international law the<br />\nauthor re-examines the whole subject of the application of law to international questions. He seeks to<br />\ndevelop a conception of the subject<br />\nthat is more in line with modern theories of jurisprudence, rejecting the<br />\nusual conceived difficulties in the international field.<br /><br />\nwas organized in 1928 as an academic club with membership limited<br />\nto graduate students and faculty<br />\nmembers. Twenty members are<br />\nThe club reelected each year.<br />\nceives books on the League of Nations and international relations<br />\nfrom the Carnegie Endowment<br />\nevery year. The Fortnightly Summary, a periodic reading on international events, also sent by the<br />\nCarnegie Endowment, is distributed<br />\namong the members.<br />\nA speaker addresses the club at a<br />\nmonthly luncheon meeting. After<br />\nthe luncheon there is a group meeting with a general discussion on international events, one of the members delivering a paper. No new<br />\nadvisor has been chosen since Dr.<br />\nWilloughby, former advisor, announced his intention of resigning.<br /><br />\nBOULEVARD RESTAURANT<br />\n3226<br /><br />\nGREENMOUNT AVENUE, Near 33RD STREET<br />\nWhere Choice, Moderate Prices Prevail<br />\nAlso at New Presto, 5 EAST NORTH AVENUE<br /><br />\nOther Publications<br /><br />\nWith these will also be published<br />\n\"The Economic Effectiveness of the<br />\nChinese Boycotts\", by C. F. Remer ;<br />\n\"The Shanghai Incident of May 30,<br />\n1925\", a case study in social-political conflict by Maurice T. Price;<br />\nand \"The Russo-Japanese Entente<br />\nof 1907-1916\", a study in secret diplomacy by Ernest B. Price.<br />\nTogether with these several publications from the Page School of<br />\nInternational Relations will be<br />\nprinted \"Equity Receiverships In<br />\nthe Common Pleas Court of Franklin County, Ohio, In the Years<br />\n1927 and 1928\", by Thomas Clifford Billig, associate professor of<br />\nlaw at West Virginia University.<br />\nHis book is a scholarly analysis of<br />\nthe Ohio State system of equity receivership as administered by the<br />\nCommon Pleas Court of Franklyn,<br />\nOhio.<br /><br />\nHopkins Varsity Club<br />\nMakes Changes In<br />\nIts Constitution<br />\nEligibility For Entrance Into Group<br />\nExtended To Athlete Who<br />\nWins Major Letter<br />\nA complete reorganization was<br />\nmade and a new constitution composed at a meeting of the Varsity<br />\nClub held Monday.<br />\nThe eligibility for entrance into<br />\nthe group was extended by the new<br />\nconstitution to any Hopkins athlete<br />\nwho wins his major letter. It also<br />\nstates that the president of the group<br />\nmust call a meeting at least once a<br />\nmonth and that any member absenting himself from three consecutive<br />\nmeetings will lose his status in the<br />\nclub.<br />\nThe formation of an athletic<br />\nhonor society, with membership<br />\nlimited to those who are outstanding in athletic ability, was proposed<br />\nat the meeting.<br /><br />\nILLUSION:<br /><br />\n... with three lovely and<br />\nLook at this remarkable lady.<br />\nperfect heads... all attached to a normal body. She<br />\nappears to sit on the stage, with the lower part of her<br />\nbody concealed by flowers. She can wink, smile, and<br />\nnod. She can talk, laugh, and sing—all at the same<br />\ntime. Thousands of people have seen this feat of magic<br />\nand pronounced it a wonderful sight!<br />\nEXPLANATION:<br /><br />\nAudiences used to pay an extra fee to go behind the<br />\nscenes to see how this trick was worked. They discovered that the three-headed woman was merely a<br />\nreflection in a mirror. The glass showed the heads of<br />\nthree girls but the body of only one. The other two<br />\nwere cleverly hidden so that only their heads showed<br />\nin the mirror.<br />\nSOURCE:\"Magic Stage Illusions and Scientific Diversions\"<br />\nby Albert A. Hopkins...Munn &amp; Co., New York<br /><br />\nKEPT FRESH<br />\nIN THE WELDED<br />\nHUMIDOR PACK<br /><br />\nIt's fun to be fooled__<br />\n...it's more fun to KNOW<br />\nThis \"three-headed woman\" trick goes throat. Ripe, costly tobaccos are mild,<br />\nmellow—gentle. The question is whether<br />\n'way back to the early days of magic.<br />\ncigarette is made from cheap tobacco<br />\na<br />\nprothat<br />\nAlso old is the suggestion<br />\ntection for your throat and freedom from or the more expensive grades.<br />\ncoughing can be achieved through some<br />\nIt is a fact, well known by<br />\n•<br />\nmagic trick.<br />\ncigaleaf tobacco experts, that<br />\neasiest<br />\nTHE EXPLANATION: The<br />\nthat<br />\nare made from finer, MORE<br />\nCamels<br />\ncigarette<br />\nthe<br />\nis<br />\nyour<br />\nthroat<br />\non<br />\nrette<br />\nEXPENSIVE tobaccos than any other<br />\nis made from the choicest, ripe tobaccos.<br />\npopular brand.<br />\nCheap, raw tobaccos are, as you<br />\nwould naturally expect, harsh to the<br />\nAmerican men and women have smoked<br />\nmore billions of Camels than any other<br />\nbrand because of the appeal of more expensive tobaccos and matchless blending.<br />\nWon't you stack up your own experience<br />\nwith a cigarette made from milder, costlier tobaccos...against magic claims about<br />\n\"cigarettes and your throat\"?<br />\nTry fresh Camels—in the air-tight,<br />\nwelded Humidor Pack that seals the<br />\nfreshness and coolness,the mildness and<br />\nflavor of Camels...inside.<br /><br />\nCopyright, 1933, R. J. Reynolds Tobacco Company<br /><br />\nNO TRICKS<br />\n..JUST COSTLIER<br />\n.7'ORACCOS<br />\nIN A MATCHLESS<br /><br />\nBLEND<br /><br />\nii.e../i.ri,<br /><br />\nMrs. L. P. Hamburger, Jr., And<br />\nE. Van Sant Chosen As<br />\nOther Offiers<br /><br />"}], "field_media_file": [{"target_id": 38724, "display": null, "description": null, "target_type": "file", "target_uuid": "de8271f8-1ebb-4379-88f0-371ad5c0f90f", "url": "http://digital.library.jhu.edu/system/files/2022-03/12401-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12401, "target_type": "node", "target_uuid": "b7c3dcea-5b78-40ce-bb1b-83a327f3893c", "url": "/node/12401"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "92784290-fe04-4cb8-b826-a469d742d1ea"}]}