{"mid": [{"value": 35608}], "uuid": [{"value": "8a9e2752-fb55-4ed1-b942-584bdca4cd13"}], "vid": [{"value": 35608}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:09:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12156-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:09:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:09:37+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "PRESS OF STONEBRAKER BROS., BALTIMORE<br />\n<br />\n\fJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br />\n<br />\nTwenty-fifth Year.<br />\n<br />\nBeginning October 1st, 1900.<br />\n<br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br />\n<br />\nDANIEL C. GILMAN<br />\nWm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As speciabstudents.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n95 000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\n<br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra .Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Os/cr.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXII.)<br />\nChemistry (vol XXIV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XVIII.)<br />\nModern Languages (vol. XV.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br />\n<br />\nEditors.<br />\nFrank MoreFey.<br />\nIra Remsen.<br />\nBasil L.Gildersleeve.<br />\nHerbert B. Adams.<br />\nA. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br />\n<br />\nThe Johns Hopkins Press.<br />\nAmerican Journal of Mathematics.<br />\nS NEWCOMB,Editor. Quarterly. 4to. Volume XXII.<br />\nin progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nII.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXIV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nV.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series XVIII<br />\nin progress. $3 per volume.<br />\nHopkins University Circulars.<br />\nJohns<br />\nVI.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXI in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nX.<br />\nW. K. BROOKS, Editor. Volume IV inprogress. $7.60<br />\nper volume.<br />\nXl. Modern Language Notes.<br />\nA. M. Eworr, Editor. Monthly. 4to. Volume XV<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. 11. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nV in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $6 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc., of the University. Published at the<br />\nclose ofthe academic year.<br />\nI.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\nBIBLIOGRAPHIA HOPKINSIENSIS. Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br />\n<br />\n•<br />\n<br />\n\fCbe news- - Letter. *<br />\nVol. V.<br />\n<br />\nNovember 30, 1900.<br />\n<br />\nBOATING WEEK AT OXFORD.<br />\nWe must remember that Oxford in these days<br />\nis almost as much of a social institution as educational. Oxford and Cambridge are the two<br />\ngreat educational institutions of the realm, and<br />\nit is the thing for young men of the best families<br />\nto spend some years at one or the other of the<br />\nUniversities. All the sons of the nobility and all<br />\nothers who can afford it in all classes are enrolled<br />\nthere. The Universities have the flower of the<br />\nthe English youth. Among all these wealthy<br />\nscions of noble houses, it would be only natural<br />\nto find some idlers, and some who merely come<br />\nfor the social advantages. But the majority of<br />\nthe students are good workers and some who<br />\ndo not seem to work hard in term, often work<br />\nexceedingly hard in vacation.<br />\nThe students are democratic and unconventional in many ways. You know the Oxford<br />\nstudents are required to wear cap and gown, at<br />\nlectures always, and out on the street during<br />\ncertain hours. They wear the mortarboard cap<br />\nin good orthodox fashion, but the gown, alas,<br />\nthey wear in the most untoward style. Some of<br />\nthem wear it in shreds and tatters,—the .more<br />\ndilapidated the better;—some carry it on their<br />\narm, or swing it all doubled up in the hand;<br />\nsome twist it around their neck for a scarf; any<br />\nway but the plain way in which it was intended<br />\nto be worn.<br />\nThe students strongly believe in physical prowess. It is rare for a student to wear an overcoat, even in the coldest weather. If he carries<br />\na heavy rough cane, he is considered sufficiently protected from the weather and all else.<br />\nHe is in all this way cultivating a heroic endurance.<br />\nHe runs around on the banks of the Isis,even in<br />\nmid-winter, scantily clad in a pair of white flannels,not reaching down to the bare knees. Then<br />\nhe shiver's and stands around with hands in his<br />\npockets and no cap on,along the river bank with<br />\nan occasional row in the boats. This is also the<br />\nhardening process. It looks like an invitation<br />\n<br />\nNo. 4.<br />\n<br />\nto rheumatism or pleurisy. But some of the<br />\nstudents still live and flourish.<br />\nThe classic Isis,—as the river Thames is called<br />\nas it flows through Oxford, is one of the great<br />\ndelights of the University city. It gives beauty<br />\nof scenery, and plenty of sport in swimming,<br />\nboating, fishing and skating. All the year<br />\nround the river is used in some way, and one<br />\nsoon learns to love the little stream.<br />\nThe greatest week on the river is the last of<br />\nMay and the first of June. It is Boating Week<br />\nor the Eighth Week, so called because there are<br />\neight men in each boat, each boat therefore an<br />\neight, and there are twenty or more colleges reprepresented by a boat apiece, the men in rowing<br />\nsuits of distinctive colors and each boat flaunting its college flag.<br />\nThey race every day at four o'clock and six<br />\no'clock for six suceessive days. It is sometimes<br />\nvery exciting. For there is an intense rivalry<br />\namong the colleges. The coveted honor for the<br />\ncollege is to be water champion, or \"head of the<br />\nriver,\" as they call it.<br />\nThe course is about a mile, from Iffley Mill to<br />\nFolly Bridge. Great crowds of students run<br />\nalong the bank with the racers, shouting and<br />\nsinging, ringing bells and blowing horns. It is<br />\ntremenous noise and enthusiasm. Here they<br />\nshout,—\"Go it Merton!\" \"Steady,Brasenose!\"<br />\nInteresting it is to see the other boats come<br />\npast to salute the victor. The salute is made by<br />\nthe crews adroitly tossing their oars in the air.<br />\nEvery once in a while a crew will lose their<br />\nequilibrium, and over goes their boat, and the<br />\nrowers are immersed in the river. This boating<br />\nweek is the great week at Oxford, greater than<br />\nCommencement, which is called Commemoration, and which is a rather dry and formal affair.<br />\nBoating Week brings the crowds of fond<br />\nmammas and sisters and pretty sweethearts,<br />\nand the little city is full of gaiety and beauty.<br />\nThere are also all sorts of festivities besides the<br />\nraces. The week is crowded with concerts,<br />\ndances, river excursions, punting trips, houseboat parties and tally-ho parties. But the daily<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nraces are the great social feature. The river<br />\nside has perhaps twenty great handsome barges<br />\n(some of them once belonged to the ancient<br />\nguilds of London and were used in the Lord<br />\nMayor's river show in olden days), floating<br />\nhouses exquisitely furnished. And here tea is<br />\nserved between races in elegant style. The<br />\nflower of all England, its beauty and culture and<br />\nwealth is here in Oxford for Boating Week.<br />\nThe greatest boating contest of the year, however, and for which everything else is a prepararation, is the annual race with their rival university, Cambridge. We went down to London<br />\nto see this one Saturday in March. The course<br />\nwas on the Thames from Putney to Mortlake,<br />\nfour miles and a quarter. We were well up near<br />\nthe finish. There were enormous crowds and<br />\ntremendous excitement. The Oxford boys came<br />\nin first as they had usually done for some years<br />\nbefore. We were proud of the Oxford blue<br />\nStrange, the race was over at four o'clock, by<br />\nLondon time, and the results of it were published in the New York papers at one o'clock,<br />\nthree hours before. Curious the results of the<br />\ntime differences between the two points.<br />\nBaltimore.<br />\n0. H.<br />\n<br />\nTHE LURID STREAK.<br />\n<br />\nBy Another Hope.<br />\nI am an elphberg. My nose is red (it is ripe),<br />\nand I am all right.<br />\nThe moon was shining brightly when I ascended the ladder which, attached to nothing<br />\nbut the curtain-cord of Fluvia's window-blind,<br />\nhung perpendicular over the moat.<br />\n\"If the spring only holds,\" I muttered between<br />\nclamped teeth.<br />\n\"Precious!\" A soft voice grated upon the<br />\nwindow pane only a foot above me. She was<br />\nthere!<br />\n\"Yes,\" I hissed, on principle.<br />\n\"Is oo there ?\"<br />\n\"Ah, Fluvia, I have conic, I have come.\" She<br />\nsnivelled softly—also on principle.<br />\n\"Is oo safe?\" Though my position was a<br />\nhazardous one, I endeavored to reassure her.<br />\n\"This is a ground-floor window and the<br />\nmoat—.\" At mention of the moat, I could hear<br />\nher frame shudder. I had expected this, and<br />\ninwardly cursed my carelessness.<br />\n\"The moat,\" I added quickly, \"is only three<br />\nfeet deep.\" It was four, but Heaven will forgive<br />\nthe lie. She shrieked, but opened the window.<br />\nWWW<br />\nIn doing so, however, she disturbed the poise of<br />\nNOVELTIES BY UNERRING QUILLS. the spring blind. There was a whirr, followed<br />\nby a sharp ping, as the spring blind drew me up<br />\nThe NEWS-LETTER realizes the ever-quickening with a vicious jerk. Myfeet were on the window<br />\ncompetition which exists in modern American sill, and I was safe. I could not but look at my<br />\nperiodical literature, and is making gigantic reflection in the window-pane. There I stood,<br />\nefforts to keep abreast of the times. It is with with the mellow moon-light flooding my crimson<br />\ngreat pleasure that we announce a series of nov- hair—I hate to do this—and my finely chisseled<br />\nelties by the most fashionable and strenuous features outlined against the darkness of the<br />\nwriters of modern fiction, a few of whom we night. My high hat made me look every inch of<br />\nmention with thrills of pardonable pride: An- my six feet two; a cut-a-way coat with wellother Hope, Dick Thirty cents, Davis, the Bore padded shoulders set off my naturally fine figure<br />\nreporter; Miss May Johnsing, who wrote,\"To to advantage; and a pair of plaid golf stockings<br />\nHave and to Strangle-hold\"; Theodore Rough- brought out the beauties of my well-turned<br />\nhouse Roozefelt, the father of the polite dime- calves. How could she help it! She shone like<br />\nnovel; William Just-Once-More Bryan,author of a star in that moon-light which I was not using,<br />\n\"Never Again\" and \"Misunderstood \"; Paul and her beauty overwhelmed me with a sense of<br />\nLeister Fraud, who wrote \"Me and Vandy\" or its subtleness.<br />\nI was in the act of stepping into the room<br />\n\"Janice Meredith\"; Round-the-World Kipling,<br />\nthe Brass Band Poet; Algernon Charles Wind- when she shrieked again in a stage whisper,and,<br />\nburner, author of\"the Confuser and Confused,\" drawing her skirts about her, sprang upon a<br />\na poem which reads either way. The first of chair. There was a rustling noise as of advancing footsteps. I stopped.<br />\nthis most promising series is<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n\"The six ?\" I questioned, replacing my foot<br />\nupon the window-sill and gauging the jump with<br />\na hurried glance.<br />\n\"No,rats!\" she whispered,\"butlam not afraid<br />\nwhen you are here.\" I stepped into the room,and<br />\nwe clinched. Alas, my chance question wasto be<br />\nanswered truly, but too late. For at that moment<br />\nthe door burst open,and Blue Mike,accompanied<br />\nby the Six, entered. Drawing my rapier, I fell<br />\nupon them. With one lunge, I spitted three of<br />\nthe six, and there remained but Detchard,Rupert<br />\nof Hofbrau, Blue Mike, and the Belgian. Their<br />\nfour blades beat upon my guard with keen fury,<br />\nbut Fluvia's eves were upon me, and I never<br />\nfaltered. Our swords twinkled and threshed<br />\nabout iu the room until the heat became intense.<br />\nMy nerves were drawn as tight as piano-strings,<br />\nand I felt keyed to a high pitch. After an hour<br />\nand a half, the Belgian fell exhausted, but the<br />\nremaining three seemed comparatively fresh. I<br />\nfelt myself weakening,but gathered my energies<br />\nand finished Detchard with a neat uppercut.<br />\nBlue Mike, beside himself with rage at the sight<br />\nof so many of his followers strewn about,<br />\nrushed upon me blindly. I turned aside his point<br />\ndexterously,and lunged forward with such force<br />\nthat my rapier penetrated two double thicknesses of Harveyized corsets, and came out at<br />\nthe other side. In an endeavor to withdraw it,<br />\nmy good blade snapped, leaving me helpless—at<br />\nthe mercy of that arch devil, Rupert of Hofbrau.<br />\nThe young villain laughed mockingly and flung<br />\nhis golden curls to the gentle breeze which wafted<br />\nthrough the open casement.<br />\n\"I will kill you first, Sire,\" he said, bowing<br />\n\"and then—\" He paused, and glanced impudently over my shoulder at the white figure of<br />\nthe Princess, outlined in the gloom.<br />\n\"You saucy thing,\" I snarled like a trapped<br />\ntiger. (I)id you ever hear a trapped tiger snarl?<br />\nNeither did I, but it's very effective.<br />\n\"The bauld piece!\" re-echoed the princess, not<br />\nin the least like a trapped tigress. Rupert's sneering smile fired my blood. And I leaped upon<br />\nhim, wrenched away his rapier and sent it spin<br />\nfling through the open casement. Whereupon we<br />\nfell to with the weapons nature had given us, and<br />\nI crossed high, receiving a stiff counter on the<br />\njaw. It was then that the princess called tome:<br />\n<br />\n3<br />\n<br />\n\"Don't mind his head, Razzy ; hit him in the<br />\nslats.\" I followed her opportune advice delivering a stiff body-punch which broke two of<br />\nyoung Rupert's ribs and bent his spinal column.<br />\nHe reeled backward, staggered forward, summoned his ebbing energies with a supreme effort<br />\nand catght me a stinging swipe across my royal<br />\nelpliberg. Without more ado, I put him out.<br />\nWhen I was quite through, I heard the princess<br />\nsigh slightly and murmur:<br />\n\"0, Razzy!\"<br />\n\"Call me Rudolph!\"I pleaded; \"call me anything but Razzy!\" I never heard her answer,<br />\nfor at that moment my elphberg began to bleed<br />\nprofusely. So, taking one last, longing look, I<br />\ndeparted through the window,leaving upon the<br />\nnew brussels carpet a lurid streak.<br />\nAnd upon every anniversary of our parting,<br />\nI receive one red, red rose.<br />\nU-.<br />\n<br />\nTHE SCORE IS ROLLING UP.<br />\n(\"PERSONAL EXPERIENCE IS THE BASIS OF ALL<br />\n<br />\nTRUE<br />\n<br />\nLITERATURE.\")<br />\n<br />\nTune \"John Brown's Body.\"<br />\n<br />\nHopkins' team is lining up upon the field,<br />\nHopkins' team is lining up upon the field,<br />\nHopkins' men are lining up around the field,<br />\nThe score is naught to naught.<br />\nthem, Hopkins, Hopkins, hold them.<br />\nHold them, Hopkins, Hopkins, hold them.<br />\nPush them, Hopkins, Hopkins, push them.<br />\nThe score is naught to naught.<br />\n<br />\nCHORUS.—Hold<br />\n<br />\nIL<br />\nHopkins' line is rolling onward to the goal,<br />\nHopkins' line is rolling onward to the goal,<br />\nHopkins' ball is lying right beside the goal,<br />\nThe score is naught to naught.<br />\nCHORUS.—Hold<br />\n<br />\nthem, Hopkins, etc.<br />\n<br />\nFlags of Black and Blue are waving over us.<br />\nFlags of Black and Blue are waving over us,<br />\nAll the Hopkins girls are raving over us,<br />\nThe score is six to naught.<br />\nare rooting, Hopkins, rooting,<br />\nWe are rooting, Hopkins, rooting,<br />\nAll the Hopkins whistles tooting,<br />\nThe score is rolling up.<br />\n0. M., 1902.<br />\n<br />\nCHORUS.—We<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\ntbe 14ews.9Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents Of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nNOVEMBER 30, 1900.<br />\nSubscription $1.30 per year.<br />\n<br />\nto cents a single copy.<br />\n<br />\nEditor in Chief,<br />\n<br />\n.<br />\n.<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\n<br />\nAthletic Editor, .<br />\nBusiness Manager,<br />\n<br />\n.<br />\n.<br />\n<br />\nNORMAN BOYER, 1901.<br />\nJOHN M. BOOKER, 1901.<br />\n<br />\nI WILLIAM D. HILL, 1902.<br />\nF.:BEN C. HILL, 1902.<br />\nSOL STROUSB, 1902.<br />\n<br />\n\"found itself\" until Thanksgiving Day. It has<br />\nnow that finished precision which it lacked at<br />\nAnnapolis. Hopkins out-weighs St. John's eight<br />\npounds to the man, and should be ashamed to<br />\nlet the tie stand. The NeWS-LETTER congratulates St. John's upon its team; a team that<br />\nplays with such a fine dash, spirit, and style,<br />\nthat its light weight is practically no criterion<br />\nof its playing ability.<br />\n<br />\nWWW<br />\n<br />\nThe NEWS-LETTER has received the following<br />\n.<br />\n.<br />\ncommunicat<br />\nion from the Registrar, which will<br />\nAssistant Business Manager,<br />\n. AUBREY ?BARRE, JR., 1902.<br />\nsettle the debated point of the use of the word<br />\nAddress all articles, communications, etc., to NORMAN BOYER.<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\n\"the\" in speaking of this University:<br />\nSubscriptions and business communications should be sent to<br />\nTo THE EDITOR:<br />\nJOHN M.BANDRL, box 94,3 H. U.; or box 398, Medical School of<br />\nJohns Hopkins Hospital.<br />\nDear Sir—Apropos of the question raised in<br />\nthe recent issue of the NEWS-LETTER, I beg<br />\nNotwithstanding a few disagreeable features, leave<br />\nto say that the certificate of incorporaand some discouragements, the foot-ball season tion<br />\nof the University uses the designation \"The<br />\nwhich has just closed has been a very successful Johns<br />\nHopkins University,\" and this has always<br />\none for Hopkins. The team has worked faith- been<br />\nofficially regarded as the corporate name<br />\nfully, and, whether it is to retain the inter-colof the institution. Yours very truly,<br />\nlege pennant or not, deserves an appreciative<br />\nT. R. BALL, Registrar<br />\nrecognition of its services. That the terrible<br />\nJI6 .A6<br />\ndrubbing received at Charlottesville did not disCALENDAR OF UNIVERSITY<br />\npirit the men shows the grit of the team, and<br />\nMEETINGS.<br />\nthat game probably went a long way toward<br />\nPhysics, Journal Meeting—Profs. Rowland and<br />\nputting the team in condition to win later.<br />\nCaptain Sayler, Messrs. Casler, Bond and Ran- Ames, Wednesday, Room 23, 11 a. in.<br />\nChemistry, Journal Meeting—Prof. Remsen, Mondolph, who coached the men, and every member<br />\nday,9 a. m.<br />\nof the team who contributed toward the final<br />\nBiology, Zoological and Botanical Club—Prof.<br />\nresult will stand high in the regard of the Brooks, Friday, 11 a. m.<br />\nGeology—Prof. Clark, Tuesdays, 11 a. m.<br />\nstudent body.<br />\nPhysiological Journal Club (Biology—Prof.Howell,<br />\nIt is the opinion of the NEWS-LETTER that the<br />\nvictory over the University of Maryland on Monday,11 a. in<br />\nLatin,Journal Club—Prof. Smith, 12 m.<br />\nThanksgiving Day was the greatest success of<br />\nEnglish,Journal Meeting—Prof. Bright,alt. Friday,<br />\nthis season—or, indeed of the past two seasons. 4-6 p. m., Room 4.<br />\nGermanic Society—Prof. Wood,fortnightly, ThursThe championship of the Maryland Intercollegiate Association brings with it less of a city days,4-6 p. m., Room 4.<br />\nRomance Club—Prof. Elliott, Wednesday, 11 a. m.,<br />\nprestige—which has long been lacking, and<br />\nRoom 2.<br />\nwhich is, after all, of the most substantial<br />\nHistorical Conference—Prof. Vincent, Friday, 10<br />\nbenefit to us—than the decisive defeat of our a. m., Room 23.<br />\nPolitical Conference—Dr. Willoughby, Alternate,<br />\nfamous sister university, whose teams have always been followed with interest by hundreds Tuesdays,8 p. m.<br />\nEconomic Seminary—Asst. Profs. Sherwood and<br />\nof Baltimoreans.<br />\nHollander, Thursdays, 4,-6 p. m. Room 24.<br />\n.<br />\n<br />\nJOHN A. SLEMONS, 1902.<br />\nJOHN M. HANDEL, 1901.<br />\n<br />\nor or sr<br />\n<br />\nThe NEWS-LETTER would like to see a postseason game with St. John's—say Dec. 8th—at<br />\nUnion Park, if possible. Our team never really<br />\n<br />\nScientific Association—Monthly,<br />\nWednesdays, 4<br />\np. m. Prof. Ames.<br />\nPhilological Association—Dr. Spieker.<br />\nTeacher's Lectures,Educational—Friday,7.30 p.m.,<br />\nMcCoy Hall.<br />\nTeacher's Lectures, Scientific—Saturday, 9.30 a. m.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\nlacrosse field, strike terror in the ranks of an<br />\nopposing host, and cheer our men on to victory.<br />\nbreast.\"<br />\nsavage<br />\nthe<br />\n\"Music bath charms to sooth<br />\nAt present our series of songs is somewhat like<br />\nTo any one who attends Gym. at all, or ever a yard of fine cloth that is supposed to cover<br />\nvisits the building, the musical atmosphere that a two-yard table: what we have is good, but it<br />\nis beginning to pervade the place is noticeable does not extend far enough. Therefore some<br />\nalmost immediately. When stray members of one ought to attempt to lengthen the cloth<br />\nthe Banjo or Mandolin Clubs happen to have either by composing words and music,or setting<br />\nan.open hour, they generally manage to meet in words to some stirring standard selection—<br />\nthe Trophy-room,and wake up the chess players; words that fit both the music and the occasion.<br />\nand not only are we being favored with soft One of the best cheering songs sung atthe Princestrains from stringed instruments, but some ton-Yale game was to the tune of Die Wacht am<br />\nstudents in the exuberance of their joyful spirits Rhein. All who have knack in this line should<br />\nare gradually forming the custom of rending the try, and if the production is good, the NEWSair with vocal productions. It is impossible for LETTER Will certainly publish it.<br />\nthose without a nice ear for music to criticise<br />\nthese selections or even assert that they are<br />\nWWW<br />\nmusic, but without disputing the use of the<br />\nword, we must acknowledge that this pleasing<br />\nReports from the Yale-Princeton game depractice should be encouraged. Of course the scribe the witness-stands as being almost aniserene quiet of McCoy Hall cannot be disturbed, mate with the contrasting Blue of Yale, and<br />\nbut there is no reason why Mack's Palace should the Black and Orange of Nassau, which, minnot be a stage for the ebullition of song after the gled with the charming colors of the apparel of<br />\ndifficulties of Laboratory. The sensuous pleas- the ladies present, produced a varied but beautiures of a rollicking good song, affects every one, ful aspect of color and harmony. Though there<br />\nwhether he is inclined to music or not; music would be some danger of the heavens falling<br />\ncauses a lively spirit to spring from gloom, and were 13,000 persons to witness a Hopkinsgame,<br />\nunites the people who join in. The mystic fasci- and though the bad weather we have experienced<br />\nnation of a negro for a camp-meeting is due to this foot-ball season has prevented many ladies<br />\nthe magic influence that the wierd chants have from attending our games, there have generally<br />\non his musical and fanatic nature. The Ameri- been enough present to relieve the monotony of<br />\ncan people are gradually acquiring the reputation nothing but masculine forms—and since with the<br />\nof the most musical nation; and Hopkins men, fair sex the waving of flags is about the only<br />\nfollowing their benefactory inclination, should meansfor manifesting enthusiasm,flags have been<br />\nendeavor to assist in the establishment of such seen to some extent. The student of nature finds<br />\na reputation. But even without such a high aim, absorbingly interesting the actions of the girl<br />\nye pioneers continue your efforts, and we'll all whose unbounded enthusiasm urges her to join<br />\nJoin in; \"for a dash of joyful song will last a in the yells of the rooters, but who is retarded<br />\nwhole life long.\"<br />\nby a proper sense of decorum, and whose excitevar w<br />\nmentfinds its only outlet through frantic wavings<br />\nmuch of a<br />\nTalking about songs brings forth thefact that of the flag of her escort. It is pretty<br />\nno girl,<br />\nand<br />\nflag<br />\na<br />\ndespite our wonderful increase in the last two burden for a fellow to carry<br />\nhe<br />\nboth<br />\npossess<br />\nyears, we are yet lacking in the line of songs but if he is lucky enough to<br />\nthe<br />\nnot<br />\nand<br />\none<br />\nsuitable for all occasions. Our ode is inspiring; should never go to a game with<br />\nover,<br />\nPeters' Black and Blue is an excellent, effective other. The foot-ball season is virtually<br />\nbeauties,<br />\nits<br />\nadds<br />\ncomposition; the Dummy Line is good; but but during lacrosse,when spring<br />\nwhat we still need is some soul-stirring war every fellow who takes a girl to the games<br />\nsong, which, poured forth by hundreds of loyal should also take a flag. It's a small but pleassupporters, will carry across gridiron and ant matter.<br />\n<br />\nDASHES.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\nTHE ROUGH-<br />\n<br />\nJoe England—\"But my big brother can lick<br />\nyour big brother!\"<br />\nHOUSE OF REPRESENTATIVES.<br />\nVoice (from bench in corner)—\"Take your<br />\nfeet off my face.\"<br />\nThe House is called to disorder by the PresiEloq. Guy—\"Say, push; if you don't break off<br />\ndent hammering a table, but as the snores of the this rough house, I won't do a thing to you on<br />\nmembers are very s(o)norous (this is a pun),the exams.\"<br />\nSergeant-at-Arms borrows a gun from the KenEnter two Seniors:<br />\ntucky delegation, and succeeds in waking up the<br />\nAngry Mob—\"Get out! Kill 'em! A has!<br />\npush by firing six rounds. \"The first speaker What the—!\"<br />\nwill take the floor,\" says the President.<br />\nSeniors flee in horror.<br />\nBeeuwkes stands up as if he had just seen his<br />\nGentleman from Ireland produces a hod.<br />\nmother-in-law.<br />\nWhite—\"Smoke up, Mickey, your pipe's out!\"<br />\n(Voice)—\"Throw him a rope!\"<br />\nPutts (soto voce)—\"When will you pay me<br />\nBeeuwkes—\"There is no doubt,—er—there is that half dollar you owe for class dues?\"<br />\nno doubt.\"<br />\nHutzler (waking up)—\" What day is to-day ?\"<br />\nGentleman from Ireland—\"Not a dern bit.\"<br />\nBeeuwkes, (wearily)—\"There can be no<br />\nBeeuwkes—\"The city water is unfit to drink.\" doubt\"—<br />\nEloquent Guy—\"Use beer!\"<br />\nVoice—\" Who said there was?\"<br />\nLoud applause from those who are awake.<br />\nEloq. Guy—\"Yes, there is only one way to<br />\nKentucky waves a bloody shirt. The rest breathe correctly. Mr. Carver will meet you<br />\nturn over in their sleep.<br />\ngentlemen, and instruct you in my system of<br />\nKentucky (to Eloq. Guy, aside)—\" What scientific inhalation.\"<br />\nbrand do you drink, Dock?\"<br />\nSmith talks in his sleep—\"* *<br />\nEloq. Guy—\"Kloster, at Pabst's.\"<br />\nWhite—\"Move we adjourn!\"<br />\nTwo villains pull the chair from under GentleWhole House—\"Second it!\"<br />\nman from Ireland.<br />\nGeneral outburst of latent enthusiasm for<br />\nGeneral outcry—\" Mr. Mac. has the floor!\"<br />\nspeaking. Fight in one corner. Three men try<br />\nMarkell, (reading from notes)—\"I protest; to wake Hoffman up. Slemons comes to with a<br />\nthe chair did not sustain him.\"<br />\njolt that shakes McCoy Hall. Stampede for corAngry Mob—\"Fee, fy, fo, fum, the end of the ridor.<br />\nworld will surely come.\"<br />\nBeeuwkes (in distance)—\"There is no doubt,—<br />\nSleepy Voice—\" Wake me up when it gets oh, I mean—\"<br />\nhere.\"<br />\nCurtain!<br />\nH. R. V.<br />\nBeeuwkes (in a pause of the proceedings)—<br />\n\"There is no doubt,—that is, there can be no<br />\nW WW<br />\ndoubt.\"<br />\nProlonged applause, waving of handkerchiefs,<br />\nThe Editors of the \"Hullabaloo\" are making<br />\nbloody shirt and neckties. Gentleman from their efforts felt in a most emphatic way, for it<br />\nBack River sprains his thumb from snapping is doubtful if there is a student in the whole Uniforth thunderous volleys of applause.<br />\nversity who has not been approached on the subPres.—\"You have all heard the debate,and—\" ject of subscribing to the Hullabaloo, and this<br />\nGang—\"Whistle; we are deaf down here.\"<br />\n\"approaching\" usually ends in another name<br />\nPres.—\"I will now throw the question open.\" added to the subscription list, although the price<br />\nVoice (shocked)—\"Don't expose the poor this year will be $1.25 a volume instead of $1.00<br />\nthing.\"<br />\nthe men in the University aught to appreciate<br />\nGuggenheimer—\"Henry James says—\"<br />\nthe value and expense of publishing this book,<br />\nMarkell—\"You're another; I knew Henry and the price should not materially affect the<br />\nJames and everything else before you did.\"<br />\nnumber of subscribers.<br />\n<br />\nIt<br />\n<br />\n\f7<br />\n<br />\nTHE NEWS-LETTER.<br />\nFOOT-BALL.<br />\nST. JOHN'S, 5 t HOPKINS. 5.<br />\nSaturday's game was one which will long be<br />\nremembered by all who witnessed it. Thc<br />\nelements were favorable in the afternoon, in<br />\nspite of the drizzling rain in the morning, and<br />\nthe grounds were in fair condition. A goodly<br />\nnumber of rooters assembled at Camden Station<br />\nto accompany the team to Annapolis. The<br />\nscene on the train was one of jollification and<br />\nrough-house, Chief rooter Swindell presiding<br />\nas usual, ably seconded by sub-chief rooter Lew<br />\nWhite. The morning was spent in \"doing\" the<br />\n• town. The Naval Academy, the Capitol and<br />\nother places of interest were visited and some<br />\ntook pains to see whether or not the town was<br />\n\"local option.\". Later, the decision was in<br />\nfavor of the negative. The team dined at St.<br />\nJohn's College, the rooters at the Chesapeake.<br />\nAbout two o'clock the latter lined up at the<br />\nstation to be reinforced by those coming down<br />\non the afternoon train. They all then marched to<br />\nthe grounds, rending the air with yells and<br />\nhideous noises, to find the teams putting on the<br />\nfinishing touches before the game. At 2.40 the<br />\nteams lined up. Every one knew that it was<br />\na case of when \"Greek meets Greek.\" Both sides<br />\nwent at each other for blood, and although the<br />\nrooters had given the \"Undertaker\" yell several<br />\ntimes for the edification of the crowd, it soon<br />\nbecame evident that there was \"another little<br />\njob\" for the Hopkins Team as well as for the<br />\nUndertaker, and that the aforesaid job was no<br />\n\"cinch.\" Our team clearly outplayed St. John's<br />\nat every point, putting up a much stronger game<br />\nthan they. We kept the ball in their territory<br />\nmost of the time during the 1st half, but lost it<br />\nwithin 15 yds. of their goal, twice on fumbles,<br />\nonce on downs. The 1st half ended with the<br />\nscore 0 to 0. At the beginning of the second<br />\nhalf, Hopkins kicked off and in 3 or 4 minutes<br />\nSt. Johns had advanced the ball to the centre of<br />\nthe field. Then Wells of St. Johns went around<br />\nright end for a 25 yd. gain, bringing the ball to<br />\nour 30 yd. line. The opposing team then tried<br />\ntheir end plays around left end. Having finally<br />\ngotten the ball on a fumble by one of their own<br />\nmen,St.Johns scored a touchdown, but failed to<br />\n<br />\nkick a goal. After that St.John's put up their best<br />\ngame. They hit our line at a terrific rate, often<br />\nmaking ten yard gains and keeping the ball in<br />\nour territory a good part of the time. When the<br />\nlast half was finished, all but six minutes, we had<br />\nthe ball on our 7 yd. line. And it was a case of<br />\n\"root hog or die, and root quick\" for the<br />\nHopkins team. Then came a finish sufficient<br />\nto satisfy the enthusiasm of any football crank.<br />\nIn 5 min. and 55 secs. we had put the pig skin<br />\nwithin 4 yds. of their goal, with three beautiful<br />\nend runs, one made by Riggs, the other two by<br />\nTyler. The teams having lined up, Riggs<br />\nwent through for a touchdown just as time was<br />\nup, and the rooters gave an exhibition of an<br />\nameteur insane asylum. The ball was kicked<br />\nout by Riggs. Caster seemed to catch it<br />\nfairly, but the umpire said he (Casler) moved<br />\nhis loot, so the game was ended with a score of<br />\n5 to 5.<br />\nThe contest on the whole was clean and fast<br />\nfrom beginning to end.<br />\nBlanck played a good steady game, so did<br />\nMeadows.<br />\nButler's playing was as usual up to the notch<br />\nand well nigh perfect in every detail.<br />\nThe end runs of Riggs and Tyler were distinguishing features of the game.<br />\nThe team as a whole played in excellent form<br />\nand was in far better shape at the end of the<br />\ngame than St. John's.<br />\nWells and Spates put up the best game for St.<br />\nJohn's.<br />\nThis game gives Hopkinsthe championship,as<br />\nwe were champions at the beginning of the<br />\nseason.<br />\nThe line-up was as follows:<br />\nST. JOHN'S.<br />\n<br />\nPOSITION.<br />\n<br />\nHOPKINS.<br />\n<br />\nGillespie<br />\nL. B.<br />\nWistner (capt.), Seth<br />\nButler<br />\nL. T.<br />\nBaker<br />\nFincke<br />\nL. G.<br />\nHutchins<br />\nWhitman<br />\nC.<br />\nBlecker<br />\nYearly, easier<br />\nR. G.<br />\nSpates<br />\nBacon<br />\nR. T.<br />\nMorgan, Keys<br />\nNelson<br />\nR. E.<br />\nHoward<br />\nMeadows<br />\nRandall<br />\nQ.<br />\nRiggs<br />\nL. H.<br />\nGeary<br />\nSayler, Tyler<br />\nR.H.<br />\nWells<br />\nBlanck.<br />\nF. B.<br />\nHalbert<br />\nUmpire— Artaud. Referee—Thompson, (Georgetown University). Time—Two 35 min. halves.<br />\nTouchdowns—Riggs and Wells.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\nJ. H.U., 12; UNIV. OF MD., 0.<br />\n<br />\nThe Johns Hopkins foot-ball season closed<br />\ntriumphantly on Thanksgiving Day when the<br />\nwearers of the black and blue defeated their<br />\nlong time rivals, the University of Maryland, at<br />\nUnion Park. The day was perfect, and the field<br />\nin good condition,but what proved the greatest<br />\nincentive for each canvas-clad warrior to do his<br />\nutmost to win was thefact that from the grandstand hundreds of fair eyes were focused upon<br />\nhim. The two elevens played clean, hard, fast<br />\nfoot-ball, and one very gratifying thing was the<br />\nabsence of any dirty playing which would tend<br />\nto mar the game. The game was a triumph for<br />\namateur sport. University of Maryland had<br />\nremoved from her team every man who could<br />\nnot play under the amateur definitions cited in<br />\nthe Intercollegiate Official Hand-Book. It was<br />\na contest of bona-fide student against bona-fide<br />\nstudent; and now that the two universities<br />\nthoroughly understand each other and are<br />\nunited in their determination to stand for<br />\nstraight foot-ball, there is every reason to believe that\"peace and harmony shall continue to<br />\nreign,\" and the annual game become a permanent institution.<br />\nThe foot-ball policy of Johns Hopkins is a<br />\nwell defined, though, in this city we regret to<br />\nsay, almost a unique one. We stand for amateurism, and we maintain that our bona-fide<br />\nstudent team is equal to any bona-fide student<br />\nteam that any college in Baltimore can produce.<br />\nBut to return to the subject, the Thanksgiving<br />\nDay game. Our team played as a unit, and<br />\nthat consistent team work won the game for<br />\nus. The Doctors on the other hand played individually; team work was lacking. Their punting was good.<br />\nIn vain the Doctors hammered the Hopkins<br />\nline; it was unmovable. But when the Black<br />\nand Blue had possession of the ball \"why every<br />\ntime they hit the line they went right through.\"<br />\nAgain and again Butler tore great holes through<br />\nthat Maryland line; again and again our backs<br />\nplunged through it for heavy gains, and it was<br />\nthis continual pounding that gave Hopkins a<br />\ntouchdown after ten minutes of play, Butler<br />\ncarrying it over the line. Riggs kicked goal.<br />\nAfter the ball was again kicked off, Hopkins<br />\n<br />\n(by two serious fumbles)lost it twice in rapid<br />\nsuccession. Then some punting was indulged<br />\nin and in this Maryland showed to better advantage, for on interchange of kicks \"Mike\"<br />\nGriffin of Maryland came out ahead of our men.<br />\nIn the second half the Black and Blue resorted<br />\nto this hammering again and again and by an<br />\nuninterrupted series of gains the ball was taken<br />\nfrom our 25-yard line to Univ. of Maryland's<br />\n1-yard line and then Blanck carried it over for<br />\nHopkins' second touch-down. Riggs kicked<br />\ngoal. The ball was kicked off by Maryland<br />\nand Hopkins again began a steady advance<br />\ndown the field. It was evident that she had<br />\nMaryland \"going\" and it was only the darkness<br />\nthat prevented a larger score from being rolled up.<br />\nThe teams lined up as follows:<br />\nPOSITIONS.<br />\nUNIV. OF MD.<br />\nJ. II. U.<br />\nGillespie,<br />\nDavis, Dann,<br />\nL. E.<br />\nButler,<br />\nL.T.<br />\nScott,<br />\nCasler,<br />\nL. G.<br />\nCarey,<br />\nWhitman,<br />\nC.<br />\nBrown,<br />\nYearly,<br />\nR. G.<br />\nBuck,<br />\nR. T.<br />\nBacon,<br />\nBumgartner,<br />\nNelson,<br />\nR. E.<br />\nDrewrey,<br />\nMeadows,<br />\nQ.<br />\nRogers, Davis,<br />\nRiggs,<br />\nR. H. B.<br />\nBurns,<br />\nSayler,<br />\nL. H. B. Mann, Frosher,<br />\nBlanck,<br />\nF. B.,<br />\nHarper, Griffin,<br />\nReferee—Gresham Poe,(Princeton). Umpire—Henkel, (B. M. C.) Time-keepers—Micky Whitehurst,<br />\n(Univ. of Md.), Ellis Jackson, (D. A. C.) Linesmen<br />\n—Sayler and Green. Touch-downs—Butler, Blanck.<br />\nGoals—Riggs, 2. Time of halves-20 and 18 minutes. Score—J. H. U., 12; Univ. of Md., 0.<br />\nsr sr sr<br />\n<br />\nA Child's Primer of the Game.<br />\nDid you see little Joel Butler butt the Md. line<br />\nside-wise and over backwards?<br />\nWasn't the ripping sound our tackles-back<br />\nmade realistic?<br />\nMy! but that tackles-back gave one a Thanksgiving appetite.<br />\nHow hard Gillespie tackled! He and Nelson<br />\ndisappointed Maryland so.<br />\nAnd they say that Blanck is only a freshman<br />\nafter all; but then so is Yearley. Think how<br />\nnicely they will \"do\" when they have grown up<br />\nmore! What a lot of openings Cassler made<br />\nfor that promising young man, Sayler! Did he<br />\ntake advantage of them? Oh, yes, Oh my, yes.<br />\nWhitman looked like a \"century plant\" at<br />\ncentre.<br />\nNor was Bacon a ham.<br />\nDid Meadows miss anything coming to him!<br />\nOh, no, he did not. But then, we knew he was<br />\na \"sure thing\" any way.<br />\nRiggs is too much of a \"kicker\" for some<br />\ntastes. He just suits mine. But then, variety<br />\nis the spice of life, and there was plenty of it in<br />\nthe \"kicking.\"<br />\n<br />\n\f9<br />\n<br />\nTHE NEWS-LETTER.<br />\nMUSICAL CLUBS,<br />\nThe Musical Clubs have been having a series<br />\nof daily, and to some extent nightly rehearsals<br />\nwhich have kept McCoy Hallin a constant state<br />\nof uproar. Indeed it is hard for even the most<br />\nwary to know when it is time to pass along the<br />\ncorridors, for notices of the different practices<br />\nare posted often only a short while before the<br />\ntumult is to begin, so that the fortunate one has<br />\nlittle warning or chance to leave the building.<br />\nA great deal of credit is due Mr. Eyster, the<br />\nleader of the Glee Club for his skill and patience<br />\nin drilling the many men who have entered their<br />\nnames as candidates for the Club, for the majority of therri had had little or no previous experience in reading music. Another thing that he<br />\nshould be praised for is the thoroughness with<br />\nwhich he has rehearsed every piece till each man<br />\nknew his part perfectly. And whenever there<br />\nwas a sign of any part being weak, quartettes<br />\nwere straightway formed and the careless ones<br />\nquickly discovered. In this manner the full<br />\nstrength of every voice is assured.<br />\nThis same scheme was adopted last year in<br />\nthe Mandolin Club, with the result that it was<br />\nundoubtedly the best College Club that played<br />\nin Baltimore last winter. Mr. Moulton is continuing this practice and will assuredly meet<br />\nwith like success. In one respect this club is<br />\nbetter than previously, in that the pieces,<br />\nalthough comprising some very lively two-steps<br />\nand marches, are taken mostly from opera selections. For opera selections when played by a<br />\nMandolin Club are beautiful. This fact was<br />\nclearly shown by the enthusiastic manner in<br />\nwhich portions of \"The Singing Girl\" were<br />\nreceived last year. Then in still another aspect<br />\nthe Clubs have made an advance for this year.<br />\nThe Glee and Mandolin Clubs will have several<br />\npieces together, the mandolins playing a soft<br />\naccompaniment to the voices. The Banjo Club<br />\nhas taken a most decided \"brace,\" and with<br />\nmore banjos and banjeaurines bids fair to rival<br />\nits sister clubs.<br />\nBut it is needless to praise the Clubs so highly,<br />\nfor shortly after the -concert at Hannah Moore<br />\nAcademy, on December 7th, will come the Baltimore concert, and then every one will be a judge<br />\nunto himself.<br />\n<br />\nWITH APOLOGIES.<br />\n'T was the hour preceding dinner,<br />\nSomewhere 'long 'twixt five and six;<br />\nI was standing near the \"gym\" door<br />\nIdly holding down the bricks;<br />\nWhen there came from out the windows<br />\nOf McCoy a fearful din—<br />\nHowls and groans and shrieks and rumblings!<br />\nWhat was going on within?<br />\nMore discordant grew the discord,<br />\nMore unearthly! Could it be<br />\nThat such noise by human voices<br />\nWas produced? Well, I would see.<br />\nThrough the doorway quick I hurried,<br />\nUpward toward the Lecture Hall;<br />\nThere a picture met my vision,<br />\nWhich in night-mares I recall.<br />\nOne poor man had really fainted,<br />\nQuite unconscious there he lay:<br />\nOne was stamping 'round the platform,<br />\nLooking like a wolf at bay.<br />\nIn a double row before him<br />\nThere were twenty fiends or more,<br />\nEach one making noise sufficient<br />\nTo have come from all the score.<br />\nThere was harsh and blatant tenor,<br />\nThere was rumbling jarring bass<br />\nTorture exquisite to listen—<br />\nAh! I understood the case!<br />\nThis was just a Glee Club practice,<br />\nAnd that man with face afrown<br />\nIs the leader, Mr. Eyster,<br />\nHaving troubles of his own.<br />\nAnd the man who couldn't stand it<br />\nAnd had fainted? Well, you see,<br />\nIt was really not surprising.<br />\nHe had suffered agony.<br />\nFor the blow almost killed Fisher,<br />\nWhen the Glee Club tried to do<br />\nHis harmonious arrangement<br />\nOf the song,\"Ma Lady Lu.\"<br />\n—W. B. CARVER.<br />\nOlir ger slr<br />\n<br />\nUP TO DATE.<br />\nChainless wheels we now frequently see,<br />\nHorseless carriages common may be;<br />\nBut the latest invention<br />\nAttracting attention<br />\nIs the noiseless applause, a in Lee.<br />\n—Nemo.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n10<br />\nITEMS.<br />\n<br />\nThe Johns Hopkins alumni in Kansas, Missouri, Iowa, Nebraska organized an alumni<br />\nassociation on Thanksgiving day.<br />\nwww<br />\nDr. F. Howard Taylor, R. C. P., M. R. C. P.,<br />\nB. S., made an addresslast week before the Y. M.<br />\nC. A.,on the subject of Missionary work in China.<br />\nHe dwelt principally on the possibilities of gainingfirmer hold upon the Chinese through the work<br />\nof medical missionaries. There was a large audience and the address was thoroughly enjoyed.<br />\nImmediately afterward a short business meeting was held in order to fill the vacancy in the<br />\nboard of directors of the Lawrence House caused<br />\nby the resignation of A. R. Bird '01. Bartgis<br />\nMcGlone '02 was selected for this office.<br />\nW<br />\n<br />\nThe Senior Class has completed its election of<br />\nofficers for the ensuing year. Those who were<br />\nelected were Lindsay C.Spencer, Historian; Mortimer Bye, Sergeant-at-arms;and John M.Booker, Poet. Those on the Executive Committee are<br />\nJ. G. Machen, W. I. Kohn, J. M. Booker, J. E.<br />\nTyler, Jr., A. W. Bruton, H. W. Warner, and<br />\nNorman Boyer. The Banquet Committee is composed of B. M. Bernheim,A. R.Bird,J. A.Sayler,<br />\nJ. S. Briscoe, and H. S. Byrne.<br />\nser W W<br />\n<br />\nRobert T. Crane has appointed the following<br />\nmen to serve on the Executive Committee of the<br />\nJunior Class:S.Strouse,E. C. Hill,J. G.Campbell,<br />\nC. A. Myers, H. C. Gillispie, H. B. Stone, R. E.<br />\nGolladay, and S. Smith, including also the President and Vice-President of the class.<br />\nW W<br />\nIt has been the custom in the Univerisity for<br />\nseveral years for each class to give something toward furnishing the Trophy Room.This room has<br />\nbeen set apartfor the especial use and enjoyment<br />\nof the men, and through this custom the room is<br />\nmade more comfortable and attractive, and the<br />\nclasses are bound more closely to the University.<br />\nFor the members of each class feel that they own<br />\nand have paid for some part ofthis room. Accordingly J. Pels, chairman, G. Sisco, A. Pearre, Jr.,<br />\nR. C. Sharretts, and L. C. Murphy, have been<br />\nappointed as a committee to select a suitable<br />\ngift to be given to this room in the name of the<br />\nJunior Class.<br />\n<br />\nAt the request of Mayor Hayes, Pres. Gilman<br />\nhas appointed Dr. D. S. Johnson and Professor<br />\nWm. Bullock Clark to represent Baltimore at<br />\nthe Convention of the National Irrigation Congress to be held in Chicago.<br />\nwww<br />\nOn November 13th, the fiftieth anniversary<br />\nof the birth of Robert Louis Stevenson, an informal gathering of students in the President's<br />\noffice listened to interesting papers concerning<br />\nthat gifted author.<br />\nwww<br />\nAt a meeting of the College Entrance Examination Board oi the Middle States and Maryland held in New York last week, splans for<br />\nunifying matriculation requirements in all<br />\nstandard colleges were formulated. Dean<br />\nGriffin, who represented Hopkins, is in sympathy with the movement, but states that<br />\nowing to the three year course here, the certificate of the Board will only avail for certain subjects, roughly speaking those requited for our<br />\nfour year course.<br />\nslar W sir<br />\n<br />\nDr. J. Douglas Bruce, Ph. D., 1894, has<br />\nbeen elected to the chair of English Language<br />\nand Literature in the University of Tennessee.<br />\n.A5 .A5.45<br />\n<br />\nProfessor Simon Newcomb has prepared a<br />\nmemorial on the death of Professor Thomas<br />\nCraig, formerly director of the mathematical<br />\nseminary.<br />\nAbout twenty students of the Medical School,<br />\nformer students of Yale, celebrated the Yale<br />\nvictory over Princeton on Saturday November<br />\n17, by an enjoyable smoker.<br />\nww<br />\nThey sat upon the garden stile,<br />\nThe youthlet and the maid.<br />\n\"The stars above are not as bright<br />\nAs you,\" he softly said.<br />\nShe lifted up her little hand<br />\nToward luna's golden light;<br />\n• \"The moon above is not as full<br />\nAs you, my dear, to-night.\"<br />\n<br />\n—Ex.<br />\n<br />\nki<br />\n<br />\n\fti<br />\n<br />\nTHE NEWS-LETTER.<br />\nEXCHANGE PLACE.<br />\nSOME YELLOW STEAKS FROM THE PRINCETON Tiger.<br />\n<br />\nLESSONS FOR THE LITTLE ONES.<br />\n<br />\nChin-a is the Place where the Laund-ries dome<br />\nfrom.<br />\nIt is In-hab-it-ed by Boxers who are worse<br />\nthan<br />\nTom Shark-ey and Mister Corb-ett took Togeth-er.<br />\nChin-a is not so Bad-to Work.<br />\nWillie Holl-en-zolleon would like to work It,<br />\nSo would the Czar—not of the Tend-er-loin,<br />\nHow-some-ever.<br />\nVic has a hunch, she would too.<br />\nBe-sides, the Chinks have no Rights,<br />\nWhat Rights have they?<br />\nThey want their Coun-try to Live in.<br />\nThey would like to Do their Own Pray-ing.<br />\nThey don't like Us.<br />\nThat is E-nough to Queer them to Be-gin with.<br />\nMore ov-er, they have all kinds of Rocks.<br />\nThe Rocks are not doing them A-n-y Good,and<br />\nbesides; we need the Money.<br />\nWe sent some People to tell them their God<br />\nwas N. G. and they got Hot Un-der the Hat.<br />\nThey made a Bum out of the People,<br />\nNow, do you want to Kill them?<br />\nWait, we can Bet-ter.<br />\nWe can turn in Here, at 35th St., and Kill a<br />\nChop Suey.<br />\nBe-cause De-ver-y has not shut up the Pe-kin<br />\nas Yet.<br />\nCome on.<br />\nVir<br />\n<br />\nON BROADWAY.<br />\nIt happened just the other day.<br />\nI went abroad to take the air,<br />\nAnd as I wandered down Broadway,<br />\nI saw a crowd assembled there.<br />\nNow wondering what the cause could be,<br />\nI hurried up, all blown and hot,<br />\nAnd joined the mob in haste, to see<br />\nIf some one had been killed or not.<br />\nSoon found I what the crowd had drawn,<br />\nA girl, more fair than most girls are,<br />\nWith open-woven stockings on,<br />\n-Was getting on a cable-car.<br />\n<br />\n11<br />\n<br />\n\"That's hard.\"<br />\n\"What?\"<br />\n\"The rock that hit my head.\"<br />\nsr sr sr<br />\nglobe struck her<br />\nincandescent<br />\nswinging<br />\nAs the<br />\nseemed to<br />\nlight<br />\nbright<br />\na<br />\nforehead,<br />\nfull in the<br />\nface.<br />\nbreak over her<br />\nw w sr<br />\nI had to go through the<br />\nan'<br />\ngorra,<br />\nMike \"Be<br />\nwhere Casey was murnight<br />\nwoods the other<br />\nthey say is haunted,<br />\nthat<br />\nan'<br />\nfall,<br />\nlast<br />\nthered<br />\nthe whole way.\"<br />\nbackward<br />\nwalked<br />\nI<br />\nan', bedad<br />\ndoin' that?\"<br />\nafter<br />\nye<br />\nwuz<br />\nfor<br />\nwhat<br />\n\"An'<br />\nPat:<br />\nsee if anycould<br />\nI<br />\nthat<br />\nso<br />\nman,<br />\n\"Faith<br />\nMike:<br />\nme.\"<br />\nbehind<br />\nup<br />\ncomin'<br />\nthing wuz<br />\nsr sr sr<br />\na man remarked that if<br />\nago<br />\nmornings<br />\nA few<br />\nmake E.P. Roe,and<br />\nshould<br />\nBoat<br />\na<br />\nin<br />\nThree Men<br />\nthat Pass in the<br />\nShips<br />\nthe<br />\nHale<br />\nEveret<br />\nEdward<br />\nto let Walter<br />\ncompelled<br />\nbe<br />\nwould<br />\nNight, they<br />\nwhich<br />\nBeecher,<br />\nWard<br />\nHenry<br />\nand<br />\nSavage Landor<br />\nand<br />\nHaggard<br />\nRider<br />\nmake<br />\nlikelihood<br />\nall<br />\nin<br />\nwould<br />\nWild.<br />\nOscar<br />\nnot<br />\nif<br />\nRiley<br />\nJames Whitcomb<br />\nw sr W<br />\nOnce Love and Fate a game offoot-ball played,<br />\nA man's poor heart the ball—the field his soul.<br />\nHe won her heart but failed to wed the maid,<br />\nSo Love a touchdown scored, but missed the goal.<br />\n<br />\nIn that case the game must have been a tie.<br />\nw sr sr<br />\nThe Roman Guide, the three Englishmen and<br />\nthe American stood before the seats from which<br />\nthe Vestal Virgins had once watched the happy<br />\nlions play charley-horse with martyrs. The<br />\nRoman guide waved his hand expansively.<br />\n\"This,\" said he, \"is the Ruin of Ruins, the<br />\nColliseum.\"<br />\nThe American smiled faintly. \"The Ruin of<br />\nRuins?\" he said, negligently, lighting a Bull<br />\ncigarette, \"Oh, Fudge—wait till you steer your<br />\nlamps toward the Dewey Arch.\"<br />\nAs his chest swelled proudly, a button from<br />\nhis vest struck the nearest Englishman in the<br />\neye with alarming force.<br />\n- r sr<br />\n\"For more than a week you have been slighting me,\" she said plaintively, as she took out her<br />\npocket-book and paid the obesity cure doctor for<br />\nten days' treatment.<br />\n<br />\n\frff<br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br />\n<br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br />\n<br />\nCALL<br />\n<br />\nJAS. H. DOWNS,<br />\n<br />\nBANKERS AND BROKERS,<br />\n217 EAST GERMAN STREET,<br />\n<br />\nIPOR Class, Fraternity and College Stationery, Banquet Cards,<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nBALTIMORE, MD,<br />\n<br />\nSMOKE UP!<br />\n<br />\nRAH! HOPKINS!!<br />\n<br />\nRAH!<br />\n<br />\nimminimminim<br />\nGO TO<br />\n<br />\nRAH!IF ITS<br />\n<br />\nANYTHING IN TOBACCO YOU WANT<br />\n<br />\nThe Chas, Wills Surgical Instrument Co,<br />\nBENJ. A. NELSON, GEN'L MANAGER.<br />\n<br />\nI. D. LANG, TOBACCONIST,<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n<br />\n833 MADISON AVENUE.<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br />\n<br />\n•<br />\n<br />\nBOX TRADE A SPECIALTY.<br />\n<br />\nDrovers & Mechanics National Bank of Baltimore.<br />\nCapital.Stock $300,000.<br />\n<br />\nSurplus and Profits, $350,000.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n300 N. HOWARD ST.<br />\n<br />\nMUELLER,<br />\n<br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\n/ 9.1„uwerrat<br />\n.<br />\n00 nat<br />\n<br />\n..517/C 23oposi/ ...V2o.vos<br />\n<br />\nA. H. FETTING,<br />\n<br />\nMANUFACTURER OF<br />\n<br />\nfired Letter Traternity<br />\njewelry.<br />\n<br />\n(LONDON STUDIO.)<br />\nFINEST PHOTOGRAPIC WORK<br />\nIN THE CITY.<br />\nOE.<br />\n16$<br />\n.<br />\n1<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br />\n<br />\nMASON 4S. HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it. is, I believe, an instrument of the very first<br />\nMORITZ MOSZKOWSKI.<br />\n(Signed)<br />\nrank.\"<br />\n<br />\n14 AND 16 ST. PAUL STREET.<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nC. H. Hildebrandt & Son, Sole Agts.<br />\n<br />\nNEW YORK TO BREMEN,<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nW w gr CABIN PASSAGE AT LOW RATES.<br />\n<br />\nLONDON, PARIS. GIBRALTAR.<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nA. SCHUMACHER & CO<br />\nGeneral Agents.<br />\n<br />\nFor particulars apply to<br />\n<br />\n5 WEST LEXINGTON ST.<br />\n<br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br />\n<br />\nJ. I). Wheeler, Cashier.<br />\nChas. S. Miller, Ass'L Cashier.<br />\n<br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br />\n<br />\nDIRECT.<br />\n<br />\nAE) SURETY BONDS<br />\n<br />\n'fidelity<br />\n<br />\nST,<br />\n<br />\nMASONIC TEMPL(.<br />\n<br />\nCLINTON P. PAINE & CO,<br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br />\n<br />\neHARI.13S<br />\n<br />\n229 N.<br />\n<br />\nCM<br />\n<br />\nand Deposit Company of Maryland,<br />\n<br />\nKranz-Smith<br />\npiano CO.<br />\n<br />\n109 and III North Charles etreet.<br />\nSOLE AGENTS<br />\n<br />\nbickering, Bradbury and Webster<br />\n<br />\ne<br />\n<br />\nite Pianos. tit<br />\nC. dt. P. Phone 2322-2.<br />\n<br />\n040<br />\n<br />\nFactory Prices<br />\n<br />\nBARTLETT, HAAWARD 60 CO.<br />\n• 'founders and Engineers,<br />\nWorks, Pratt and Scott Ste.<br />\nOffice Calvert and German Ste.<br />\nManufacturers ofCast and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas holders, Purifiers, Condensers, etc. Columns, 'Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON 818.<br />\n<br />\nBECOMES SURETY ON<br />\n<br />\nALL CLASSES OF BONDS.<br />\n<br />\nSAFETY DEPOSIT BOXES.<br />\n<br />\nEDWIN WARFIELD, Pres't.<br />\nxst Vice-Pres't, H. Crawford Black.<br />\nJos. R. Stonebraker.<br />\n\"<br />\n2nd<br />\n'rhos, A. Whelan.<br />\n\"<br />\n3rd<br />\n<br />\nH. E. BOSLER, Sec'y-Treas.<br />\nHarry Nicodemus,<br />\nAss't See'y-Treas<br />\n<br />\nBOOKS Old and<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\n605 N. Eutaw St.<br />\nW M. V. P1PPEN.<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltim ore in everything known in Music.<br />\nSole Agents for<br />\n, Mandolins, Guitars, Banjos<br />\n'<br />\n'Washburn<br />\nand Zithers.<br />\n44 Angelus, Automatic Attachments for<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES.<br />\n201-203 N. CHARLES STREET.<br />\n<br />\nLUNCH ROOMS!<br />\n<br />\nHARRY T.<br />\n<br />\nTHE !DRUID<br />\nIVI Li DVS<br />\n<br />\nLUNCH ROOM,<br />\n<br />\n122 NORTH HOWARD STREET,<br />\nOYSTERS IN ALL STYLES.<br />\n<br />\nYOUR PATRONAGE SOLICITED.<br />\n<br />\n\fSNVITH, DIXON & CO.<br />\n<br />\nPAPER oe<br />\n<br />\n4<br />\n29-31<br />\n<br />\nB_ CI3ARIB<br />\n<br />\nLAGER BEERS<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\n6oldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br />\n<br />\nWas. B. Oliver.<br />\n<br />\nJ. Wm. Middendorf.<br />\n<br />\nMIDDENDORF OLIVER & CO.<br />\n<br />\nBankers and Brokers,<br />\n206 IL A.ST<br />\nMembers<br />\nBaltimore Stock Exchange,<br />\n<br />\nN<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\nWedding Silver iirfit5delsor<br />\nIN GREAT VARIETY.<br />\n<br />\nJACOE31 61- .11?,NKINS,<br />\n216 N. CHARLES ST.<br />\n<br />\nSilversmiths.<br />\n<br />\ne<br />\n<br />\n4<br />\n<br />\n• ORIGINALANDFAMOUS<br />\n<br />\nROCHESTER BEER- Bavarian<br />\n<br />\nrerun l3rau<br />\nApollo<br />\n<br />\nOffice and Depot, 227-239 5. Central Avenue.<br />\n<br />\nGEO. C. SUCRO, Sole Agent.<br />\nHome Telephone 2060<br />\nc. & P. Telephone 10(10<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br />\n<br />\nATLANTIC TRANSPORT CO.<br />\n1 BROADWAY<br />\n<br />\n403-409 WATER ST.<br />\n<br />\nNEW YORK<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nHOWARD AND GERMAN STREETS,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nJAMES<br />\n<br />\nTHEO. WARNER,<br />\n<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nW. BALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\n11\"nfritz<br />\nStudio.<br />\n<br />\nR. PAINE.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS,<br />\n<br />\nphotographs<br />\n<br />\nmanK•<br />\n<br />\n0001111ERCIFIL & FARMERS NOTIONFIL BANK,<br />\n<br />\nHIGH GRADE Goons—Lem Puiees.<br />\n203<br />\n<br />\nTRADE<br />\n<br />\nBALTIMORE<br />\nBRANCW<br />\n717-239S.CENTRAIAVE<br />\nGEO.C.SUCRO•<br />\n<br />\nImwrenee B. Kemp, President.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE,<br />\n<br />\nTHE BLAKE CO.<br />\n<br />\nBARTHOLOMAY'SIs THE Bohemian<br />\n<br />\nBALTIMORE.<br />\n<br />\nHENDERSON'S<br />\nTEXT BOOKS, NOTE BOOKS.<br />\nSTUDENT'S SUPPLIES,<br />\n<br />\nROCHESTER,N.Y.<br />\n<br />\n.• MANAGER • •• •\"<br />\n<br />\ns-rpoiovr,<br />\nBALTIMORE, MD.<br />\n<br />\nER.<br />\n<br />\nBartholomay Brewery Co.<br />\n<br />\nHATTERS, 43$<br />\n<br />\nCANES, ETC<br />\n<br />\nAgents for Lincoln 86 Bennett and Walter Barnard's London Hats.<br />\n3:24 W. 13A.I.;FIIN.40R.E<br />\nMANUFACTURERS OF<br />\n<br />\nSilk and Cassimere Hats.<br />\n<br />\n•q11.-•<41wHOPKINS CAPS.<br />\n<br />\nGushing st compan<br />\n<br />\n0 BOOKSELLERS ...<br />\nN<br />\n.STATIONERS.<br />\n<br />\n34W. BALTIMORE STREET<br />\nSUCCESSOR TO CUMMINS<br />\n<br />\n20 WEST LEXINGTON<br />\n<br />\nSTREET.<br />\n<br />\nSPECIAL DISCOUNT TO STUDENTS.<br />\n<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS 11100/1S.<br />\n<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins Hospital and The Woman'sCollege of Balt°.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nI1ELEN 14. 1-10L.,LXDAY,<br />\n600 N. EC 1.31*.A.MT<br />\nBALTIMORE, MD.<br />\n<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br />\n<br />\nT1EF<br />\npiANos<br />\n<br />\nCINIAS. M.<br />\n<br />\nAnheuser-Busch<br />\nBrewing ilss'n<br />\n<br />\nYou get the benefit of<br />\nall this labor,skill,brains<br />\nand capital.<br />\n<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating; terms.<br />\nWrite for Illustrated Cata[logue.<br />\nSTIEFFR,<br />\n<br />\n9 N. Liberty St., I taltimore, Md. 5n nth St , N. AV., Washington, D. C.<br />\n<br />\nB. U. EICHELBERGER,<br />\n<br />\nSt. Louis, Mo.<br />\n<br />\n1300}'(S AND STATIONERY,<br />\n<br />\nBrew the Best Beers<br />\nin the World.<br />\n<br />\nNo. 308 North Cl-karleal Street,<br />\n<br />\nDAVTIMORE<br />\n<br />\nENGRAVING AND STAMPING.<br />\nY. N. C. A. BUILDING,<br />\n<br />\nBRANCH:<br />\n<br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\nC. 86 P. Telephone<br />\n2314.<br />\n<br />\nC. & P.Telephone 2351.<br />\n<br />\nSTONEBRAKER BROS.,<br />\n21z E. Baltimore St.<br />\n<br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br />\n<br />\n\fFORD'S!<br />\n<br />\n'-THE THEATRE OF BALTIMORE.4s<br />\n<br />\nDEC. 3,<br />\nONE<br />\nWEEK<br />\n<br />\n011auncey Olcott.<br />\n<br />\nLEMMERT<br />\n<br />\nDEC. 10,<br />\n<br />\nFITTING AND DRA<br />\nPING THE OUTER MAN SO<br />\nTHAT HIS FIGURE IS SHOWN<br />\nTO BEST ADVANTAGE.<br />\nIT IS A PLEASURE TO WEAR<br />\nCLOTHES MADE BY US.<br />\n<br />\nLEMMERT,<br />\n<br />\n\"Way Down East.\"<br />\n<br />\nONE<br />\nWEEK.<br />\n<br />\nLEADS IN<br />\n<br />\nNIXON &<br />\nZIMMERMAN'S<br />\n<br />\nAcademy of Music !<br />\nfel A' ifi)<br />\niF41201-IMAN'S<br />\nEMPIRE THEATRE COMPANY,<br />\nIn \"Lord and Lady Algy.\"<br />\n<br />\nWEEK OF<br />\nNOV. 26th.<br />\n(THANKSGIVING)<br />\n<br />\n123 AR<br />\n14 E. FAYETTE STREET.<br />\n<br />\nPERSONAL APPEARANCE OF<br />\n<br />\nWEEK OF<br />\nDEC. 3rd.<br />\n<br />\nPECIAL DISCOUNT<br />\n<br />\nS<br />\n<br />\njt<br />\n<br />\nipt<br />\n<br />\nTo the Students and Nurses of Johns Hopkins WC will lIuIl& 1<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n<br />\n0 y<br />\n0<br />\n<br />\nDE.NIMAN THOMPSON<br />\nIn '' The Old Homestead\"<br />\n<br />\nOUR HERD SIR,<br />\n9<br />\n<br />\nMINOR'S,<br />\n<br />\nw JIFFES STUDIO, sr<br />\n<br />\n• 218 NORTH EUTAW STREET,<br />\n106 N. CHARLES STREET.<br />\n<br />\nBALTIMORE, MD<br />\n<br />\n•<br />\n<br />\nthe n cis )blest part of your<br />\nImprove its appear-<br />\n<br />\np twee and comfort by wear-<br />\n<br />\nlog OUR HATS.<br />\ning<br />\nUP-TO-DATE,<br />\nONE PRICE.<br />\n<br />\n411P,<br />\n.•••<br />\nIV\"<br />\n<br />\neeee<br />\n<br />\n4<br />\n<br />\ntioLiNPFEL 6<br />\n<br />\ngctrtt<br />\n<br />\nM<br />\n<br />\nMandolins*<br />\n<br />\nEMBERS OF THE MANDOLIN CLUB and all musically inclined HoPKINs men who desire to purchase a<br />\nstringed instrument should visit the only manufacturers in Baltimore.<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\n<br />\nNEAR SARATOGA ST.<br />\nOPEN EVENINGS.<br />\nINSTRUMENTS TAKEN IN EXCHANGE.<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\nGUITARS AND BANJOS.<br />\n<br />\nJ. 8MIT1-1,<br />\n<br />\nWELL! WELL! WELL! WELL!<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\nDROP IN HOPKINS<br />\nON SATURDAYS<br />\n<br />\nEMSTSMUMIESAWSMMNSIZONAMMA<br />\n<br />\n•<br />\n•<br />\n•<br />\n•<br />\n<br />\nAND WATCH US MAKE THE FINEST CHOCOLATES ON EARTH<br />\n<br />\nSPECIAL FLAVORS:\"PONCE<br />\n<br />\nDE LEON.\"<br />\n<br />\nWALDORF-ASTORIA.\"<br />\n<br />\nOld mid New<br />\n<br />\nCollege and University Books Bought and Sold,<br />\n<br />\n0151-1 & mEUNER,<br />\n<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br />\n<br />\nKRISPETTES KONTINUALLY.<br />\n40W<br />\n<br />\nBooKs<br />\n<br />\nNEW=ZWANTROZNAMEENIZUMEMEMMOMMATAMMS1<br />\n<br />\nCAN'T OCT 'EPA CLNEWNERE.<br />\n<br />\nKORN<br />\n<br />\nlii<br />\n<br />\nNMENES'aa<br />\n<br />\nCall at 805 North Hocward Street,<br />\n<br />\nLEXINGTON STREET.<br />\n<br />\n3 DOORS ABOVE MADISON.<br />\n<br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n125 EAST, NEAR CALVERT STREET.<br />\n<br />\nC. SS. h SICRRCUM000filUDSEORE<br />\nCOLLARS.<br />\n<br />\nCUFFS<br />\n<br />\nGLOVES.<br />\n<br />\nIONEBRA,<br />\nKER<br />\nriter<br />\nI aVer'S<br />\nPal ic5[\\eli<br />\n(0•_)<br />\na7 E.BALT0.6T___\\<br />\n*<br />\n<br />\nE.rc<br />\n<br />\nbALTIMORD.<br />\n<br />\nBRACES.<br />\n<br />\nUMBRELLAS.<br />\n<br />\nCANES.<br />\n<br />\nTIES.<br />\n<br />\nETC.<br />\n<br />\nNovember 7th, fgoo.<br />\nWhile visiting the Paris Exposition 01 1900, the wonderful display of<br />\nwines from all parts of the world was made a special study by our representative, who secured some very fine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Cutlet, Chateau Larose, Chateau Lafitte, Chattau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s of Deinhard & Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Olney Forrester & Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\n<br />\nSTONEBRAKER BROTHERS,<br />\n217 E. BALTIMORE ST.,<br />\n<br />\nI.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n\f", "format": "basic_html", "processed": "PRESS OF STONEBRAKER BROS., BALTIMORE<br /><br />\nJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br /><br />\nTwenty-fifth Year.<br /><br />\nBeginning October 1st, 1900.<br /><br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br /><br />\nDANIEL C. GILMAN<br />\nWm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As speciabstudents.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n95 000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br /><br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra .Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Os/cr.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXII.)<br />\nChemistry (vol XXIV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XVIII.)<br />\nModern Languages (vol. XV.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br /><br />\nEditors.<br />\nFrank MoreFey.<br />\nIra Remsen.<br />\nBasil L.Gildersleeve.<br />\nHerbert B. Adams.<br />\nA. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br /><br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br /><br />\nThe Johns Hopkins Press.<br />\nAmerican Journal of Mathematics.<br />\nS NEWCOMB,Editor. Quarterly. 4to. Volume XXII.<br />\nin progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nII.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXIV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nV.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series XVIII<br />\nin progress. $3 per volume.<br />\nHopkins University Circulars.<br />\nJohns<br />\nVI.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXI in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nX.<br />\nW. K. BROOKS, Editor. Volume IV inprogress. $7.60<br />\nper volume.<br />\nXl. Modern Language Notes.<br />\nA. M. Eworr, Editor. Monthly. 4to. Volume XV<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. 11. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nV in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $6 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc., of the University. Published at the<br />\nclose ofthe academic year.<br />\nI.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\nBIBLIOGRAPHIA HOPKINSIENSIS. Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br /><br />\n•<br /><br />\nCbe news- - Letter. *<br />\nVol. V.<br /><br />\nNovember 30, 1900.<br /><br />\nBOATING WEEK AT OXFORD.<br />\nWe must remember that Oxford in these days<br />\nis almost as much of a social institution as educational. Oxford and Cambridge are the two<br />\ngreat educational institutions of the realm, and<br />\nit is the thing for young men of the best families<br />\nto spend some years at one or the other of the<br />\nUniversities. All the sons of the nobility and all<br />\nothers who can afford it in all classes are enrolled<br />\nthere. The Universities have the flower of the<br />\nthe English youth. Among all these wealthy<br />\nscions of noble houses, it would be only natural<br />\nto find some idlers, and some who merely come<br />\nfor the social advantages. But the majority of<br />\nthe students are good workers and some who<br />\ndo not seem to work hard in term, often work<br />\nexceedingly hard in vacation.<br />\nThe students are democratic and unconventional in many ways. You know the Oxford<br />\nstudents are required to wear cap and gown, at<br />\nlectures always, and out on the street during<br />\ncertain hours. They wear the mortarboard cap<br />\nin good orthodox fashion, but the gown, alas,<br />\nthey wear in the most untoward style. Some of<br />\nthem wear it in shreds and tatters,—the .more<br />\ndilapidated the better;—some carry it on their<br />\narm, or swing it all doubled up in the hand;<br />\nsome twist it around their neck for a scarf; any<br />\nway but the plain way in which it was intended<br />\nto be worn.<br />\nThe students strongly believe in physical prowess. It is rare for a student to wear an overcoat, even in the coldest weather. If he carries<br />\na heavy rough cane, he is considered sufficiently protected from the weather and all else.<br />\nHe is in all this way cultivating a heroic endurance.<br />\nHe runs around on the banks of the Isis,even in<br />\nmid-winter, scantily clad in a pair of white flannels,not reaching down to the bare knees. Then<br />\nhe shiver's and stands around with hands in his<br />\npockets and no cap on,along the river bank with<br />\nan occasional row in the boats. This is also the<br />\nhardening process. It looks like an invitation<br /><br />\nNo. 4.<br /><br />\nto rheumatism or pleurisy. But some of the<br />\nstudents still live and flourish.<br />\nThe classic Isis,—as the river Thames is called<br />\nas it flows through Oxford, is one of the great<br />\ndelights of the University city. It gives beauty<br />\nof scenery, and plenty of sport in swimming,<br />\nboating, fishing and skating. All the year<br />\nround the river is used in some way, and one<br />\nsoon learns to love the little stream.<br />\nThe greatest week on the river is the last of<br />\nMay and the first of June. It is Boating Week<br />\nor the Eighth Week, so called because there are<br />\neight men in each boat, each boat therefore an<br />\neight, and there are twenty or more colleges reprepresented by a boat apiece, the men in rowing<br />\nsuits of distinctive colors and each boat flaunting its college flag.<br />\nThey race every day at four o'clock and six<br />\no'clock for six suceessive days. It is sometimes<br />\nvery exciting. For there is an intense rivalry<br />\namong the colleges. The coveted honor for the<br />\ncollege is to be water champion, or \"head of the<br />\nriver,\" as they call it.<br />\nThe course is about a mile, from Iffley Mill to<br />\nFolly Bridge. Great crowds of students run<br />\nalong the bank with the racers, shouting and<br />\nsinging, ringing bells and blowing horns. It is<br />\ntremenous noise and enthusiasm. Here they<br />\nshout,—\"Go it Merton!\" \"Steady,Brasenose!\"<br />\nInteresting it is to see the other boats come<br />\npast to salute the victor. The salute is made by<br />\nthe crews adroitly tossing their oars in the air.<br />\nEvery once in a while a crew will lose their<br />\nequilibrium, and over goes their boat, and the<br />\nrowers are immersed in the river. This boating<br />\nweek is the great week at Oxford, greater than<br />\nCommencement, which is called Commemoration, and which is a rather dry and formal affair.<br />\nBoating Week brings the crowds of fond<br />\nmammas and sisters and pretty sweethearts,<br />\nand the little city is full of gaiety and beauty.<br />\nThere are also all sorts of festivities besides the<br />\nraces. The week is crowded with concerts,<br />\ndances, river excursions, punting trips, houseboat parties and tally-ho parties. But the daily<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nraces are the great social feature. The river<br />\nside has perhaps twenty great handsome barges<br />\n(some of them once belonged to the ancient<br />\nguilds of London and were used in the Lord<br />\nMayor's river show in olden days), floating<br />\nhouses exquisitely furnished. And here tea is<br />\nserved between races in elegant style. The<br />\nflower of all England, its beauty and culture and<br />\nwealth is here in Oxford for Boating Week.<br />\nThe greatest boating contest of the year, however, and for which everything else is a prepararation, is the annual race with their rival university, Cambridge. We went down to London<br />\nto see this one Saturday in March. The course<br />\nwas on the Thames from Putney to Mortlake,<br />\nfour miles and a quarter. We were well up near<br />\nthe finish. There were enormous crowds and<br />\ntremendous excitement. The Oxford boys came<br />\nin first as they had usually done for some years<br />\nbefore. We were proud of the Oxford blue<br />\nStrange, the race was over at four o'clock, by<br />\nLondon time, and the results of it were published in the New York papers at one o'clock,<br />\nthree hours before. Curious the results of the<br />\ntime differences between the two points.<br />\nBaltimore.<br />\n0. H.<br /><br />\nTHE LURID STREAK.<br /><br />\nBy Another Hope.<br />\nI am an elphberg. My nose is red (it is ripe),<br />\nand I am all right.<br />\nThe moon was shining brightly when I ascended the ladder which, attached to nothing<br />\nbut the curtain-cord of Fluvia's window-blind,<br />\nhung perpendicular over the moat.<br />\n\"If the spring only holds,\" I muttered between<br />\nclamped teeth.<br />\n\"Precious!\" A soft voice grated upon the<br />\nwindow pane only a foot above me. She was<br />\nthere!<br />\n\"Yes,\" I hissed, on principle.<br />\n\"Is oo there ?\"<br />\n\"Ah, Fluvia, I have conic, I have come.\" She<br />\nsnivelled softly—also on principle.<br />\n\"Is oo safe?\" Though my position was a<br />\nhazardous one, I endeavored to reassure her.<br />\n\"This is a ground-floor window and the<br />\nmoat—.\" At mention of the moat, I could hear<br />\nher frame shudder. I had expected this, and<br />\ninwardly cursed my carelessness.<br />\n\"The moat,\" I added quickly, \"is only three<br />\nfeet deep.\" It was four, but Heaven will forgive<br />\nthe lie. She shrieked, but opened the window.<br />\nWWW<br />\nIn doing so, however, she disturbed the poise of<br />\nNOVELTIES BY UNERRING QUILLS. the spring blind. There was a whirr, followed<br />\nby a sharp ping, as the spring blind drew me up<br />\nThe NEWS-LETTER realizes the ever-quickening with a vicious jerk. Myfeet were on the window<br />\ncompetition which exists in modern American sill, and I was safe. I could not but look at my<br />\nperiodical literature, and is making gigantic reflection in the window-pane. There I stood,<br />\nefforts to keep abreast of the times. It is with with the mellow moon-light flooding my crimson<br />\ngreat pleasure that we announce a series of nov- hair—I hate to do this—and my finely chisseled<br />\nelties by the most fashionable and strenuous features outlined against the darkness of the<br />\nwriters of modern fiction, a few of whom we night. My high hat made me look every inch of<br />\nmention with thrills of pardonable pride: An- my six feet two; a cut-a-way coat with wellother Hope, Dick Thirty cents, Davis, the Bore padded shoulders set off my naturally fine figure<br />\nreporter; Miss May Johnsing, who wrote,\"To to advantage; and a pair of plaid golf stockings<br />\nHave and to Strangle-hold\"; Theodore Rough- brought out the beauties of my well-turned<br />\nhouse Roozefelt, the father of the polite dime- calves. How could she help it! She shone like<br />\nnovel; William Just-Once-More Bryan,author of a star in that moon-light which I was not using,<br />\n\"Never Again\" and \"Misunderstood \"; Paul and her beauty overwhelmed me with a sense of<br />\nLeister Fraud, who wrote \"Me and Vandy\" or its subtleness.<br />\nI was in the act of stepping into the room<br />\n\"Janice Meredith\"; Round-the-World Kipling,<br />\nthe Brass Band Poet; Algernon Charles Wind- when she shrieked again in a stage whisper,and,<br />\nburner, author of\"the Confuser and Confused,\" drawing her skirts about her, sprang upon a<br />\na poem which reads either way. The first of chair. There was a rustling noise as of advancing footsteps. I stopped.<br />\nthis most promising series is<br /><br />\nTHE NEWS-LETTER.<br />\n\"The six ?\" I questioned, replacing my foot<br />\nupon the window-sill and gauging the jump with<br />\na hurried glance.<br />\n\"No,rats!\" she whispered,\"butlam not afraid<br />\nwhen you are here.\" I stepped into the room,and<br />\nwe clinched. Alas, my chance question wasto be<br />\nanswered truly, but too late. For at that moment<br />\nthe door burst open,and Blue Mike,accompanied<br />\nby the Six, entered. Drawing my rapier, I fell<br />\nupon them. With one lunge, I spitted three of<br />\nthe six, and there remained but Detchard,Rupert<br />\nof Hofbrau, Blue Mike, and the Belgian. Their<br />\nfour blades beat upon my guard with keen fury,<br />\nbut Fluvia's eves were upon me, and I never<br />\nfaltered. Our swords twinkled and threshed<br />\nabout iu the room until the heat became intense.<br />\nMy nerves were drawn as tight as piano-strings,<br />\nand I felt keyed to a high pitch. After an hour<br />\nand a half, the Belgian fell exhausted, but the<br />\nremaining three seemed comparatively fresh. I<br />\nfelt myself weakening,but gathered my energies<br />\nand finished Detchard with a neat uppercut.<br />\nBlue Mike, beside himself with rage at the sight<br />\nof so many of his followers strewn about,<br />\nrushed upon me blindly. I turned aside his point<br />\ndexterously,and lunged forward with such force<br />\nthat my rapier penetrated two double thicknesses of Harveyized corsets, and came out at<br />\nthe other side. In an endeavor to withdraw it,<br />\nmy good blade snapped, leaving me helpless—at<br />\nthe mercy of that arch devil, Rupert of Hofbrau.<br />\nThe young villain laughed mockingly and flung<br />\nhis golden curls to the gentle breeze which wafted<br />\nthrough the open casement.<br />\n\"I will kill you first, Sire,\" he said, bowing<br />\n\"and then—\" He paused, and glanced impudently over my shoulder at the white figure of<br />\nthe Princess, outlined in the gloom.<br />\n\"You saucy thing,\" I snarled like a trapped<br />\ntiger. (I)id you ever hear a trapped tiger snarl?<br />\nNeither did I, but it's very effective.<br />\n\"The bauld piece!\" re-echoed the princess, not<br />\nin the least like a trapped tigress. Rupert's sneering smile fired my blood. And I leaped upon<br />\nhim, wrenched away his rapier and sent it spin<br />\nfling through the open casement. Whereupon we<br />\nfell to with the weapons nature had given us, and<br />\nI crossed high, receiving a stiff counter on the<br />\njaw. It was then that the princess called tome:<br /><br />\n3<br /><br />\n\"Don't mind his head, Razzy ; hit him in the<br />\nslats.\" I followed her opportune advice delivering a stiff body-punch which broke two of<br />\nyoung Rupert's ribs and bent his spinal column.<br />\nHe reeled backward, staggered forward, summoned his ebbing energies with a supreme effort<br />\nand catght me a stinging swipe across my royal<br />\nelpliberg. Without more ado, I put him out.<br />\nWhen I was quite through, I heard the princess<br />\nsigh slightly and murmur:<br />\n\"0, Razzy!\"<br />\n\"Call me Rudolph!\"I pleaded; \"call me anything but Razzy!\" I never heard her answer,<br />\nfor at that moment my elphberg began to bleed<br />\nprofusely. So, taking one last, longing look, I<br />\ndeparted through the window,leaving upon the<br />\nnew brussels carpet a lurid streak.<br />\nAnd upon every anniversary of our parting,<br />\nI receive one red, red rose.<br />\nU-.<br /><br />\nTHE SCORE IS ROLLING UP.<br />\n(\"PERSONAL EXPERIENCE IS THE BASIS OF ALL<br /><br />\nTRUE<br /><br />\nLITERATURE.\")<br /><br />\nTune \"John Brown's Body.\"<br /><br />\nHopkins' team is lining up upon the field,<br />\nHopkins' team is lining up upon the field,<br />\nHopkins' men are lining up around the field,<br />\nThe score is naught to naught.<br />\nthem, Hopkins, Hopkins, hold them.<br />\nHold them, Hopkins, Hopkins, hold them.<br />\nPush them, Hopkins, Hopkins, push them.<br />\nThe score is naught to naught.<br /><br />\nCHORUS.—Hold<br /><br />\nIL<br />\nHopkins' line is rolling onward to the goal,<br />\nHopkins' line is rolling onward to the goal,<br />\nHopkins' ball is lying right beside the goal,<br />\nThe score is naught to naught.<br />\nCHORUS.—Hold<br /><br />\nthem, Hopkins, etc.<br /><br />\nFlags of Black and Blue are waving over us.<br />\nFlags of Black and Blue are waving over us,<br />\nAll the Hopkins girls are raving over us,<br />\nThe score is six to naught.<br />\nare rooting, Hopkins, rooting,<br />\nWe are rooting, Hopkins, rooting,<br />\nAll the Hopkins whistles tooting,<br />\nThe score is rolling up.<br />\n0. M., 1902.<br /><br />\nCHORUS.—We<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\ntbe 14ews.9Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents Of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nNOVEMBER 30, 1900.<br />\nSubscription $1.30 per year.<br /><br />\nto cents a single copy.<br /><br />\nEditor in Chief,<br /><br />\n.<br />\n.<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editors,<br /><br />\nAthletic Editor, .<br />\nBusiness Manager,<br /><br />\n.<br />\n.<br /><br />\nNORMAN BOYER, 1901.<br />\nJOHN M. BOOKER, 1901.<br /><br />\nI WILLIAM D. HILL, 1902.<br />\nF.:BEN C. HILL, 1902.<br />\nSOL STROUSB, 1902.<br /><br />\n\"found itself\" until Thanksgiving Day. It has<br />\nnow that finished precision which it lacked at<br />\nAnnapolis. Hopkins out-weighs St. John's eight<br />\npounds to the man, and should be ashamed to<br />\nlet the tie stand. The NeWS-LETTER congratulates St. John's upon its team; a team that<br />\nplays with such a fine dash, spirit, and style,<br />\nthat its light weight is practically no criterion<br />\nof its playing ability.<br /><br />\nWWW<br /><br />\nThe NEWS-LETTER has received the following<br />\n.<br />\n.<br />\ncommunicat<br />\nion from the Registrar, which will<br />\nAssistant Business Manager,<br />\n. AUBREY ?BARRE, JR., 1902.<br />\nsettle the debated point of the use of the word<br />\nAddress all articles, communications, etc., to NORMAN BOYER.<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\n\"the\" in speaking of this University:<br />\nSubscriptions and business communications should be sent to<br />\nTo THE EDITOR:<br />\nJOHN M.BANDRL, box 94,3 H. U.; or box 398, Medical School of<br />\nJohns Hopkins Hospital.<br />\nDear Sir—Apropos of the question raised in<br />\nthe recent issue of the NEWS-LETTER, I beg<br />\nNotwithstanding a few disagreeable features, leave<br />\nto say that the certificate of incorporaand some discouragements, the foot-ball season tion<br />\nof the University uses the designation \"The<br />\nwhich has just closed has been a very successful Johns<br />\nHopkins University,\" and this has always<br />\none for Hopkins. The team has worked faith- been<br />\nofficially regarded as the corporate name<br />\nfully, and, whether it is to retain the inter-colof the institution. Yours very truly,<br />\nlege pennant or not, deserves an appreciative<br />\nT. R. BALL, Registrar<br />\nrecognition of its services. That the terrible<br />\nJI6 .A6<br />\ndrubbing received at Charlottesville did not disCALENDAR OF UNIVERSITY<br />\npirit the men shows the grit of the team, and<br />\nMEETINGS.<br />\nthat game probably went a long way toward<br />\nPhysics, Journal Meeting—Profs. Rowland and<br />\nputting the team in condition to win later.<br />\nCaptain Sayler, Messrs. Casler, Bond and Ran- Ames, Wednesday, Room 23, 11 a. in.<br />\nChemistry, Journal Meeting—Prof. Remsen, Mondolph, who coached the men, and every member<br />\nday,9 a. m.<br />\nof the team who contributed toward the final<br />\nBiology, Zoological and Botanical Club—Prof.<br />\nresult will stand high in the regard of the Brooks, Friday, 11 a. m.<br />\nGeology—Prof. Clark, Tuesdays, 11 a. m.<br />\nstudent body.<br />\nPhysiological Journal Club (Biology—Prof.Howell,<br />\nIt is the opinion of the NEWS-LETTER that the<br />\nvictory over the University of Maryland on Monday,11 a. in<br />\nLatin,Journal Club—Prof. Smith, 12 m.<br />\nThanksgiving Day was the greatest success of<br />\nEnglish,Journal Meeting—Prof. Bright,alt. Friday,<br />\nthis season—or, indeed of the past two seasons. 4-6 p. m., Room 4.<br />\nGermanic Society—Prof. Wood,fortnightly, ThursThe championship of the Maryland Intercollegiate Association brings with it less of a city days,4-6 p. m., Room 4.<br />\nRomance Club—Prof. Elliott, Wednesday, 11 a. m.,<br />\nprestige—which has long been lacking, and<br />\nRoom 2.<br />\nwhich is, after all, of the most substantial<br />\nHistorical Conference—Prof. Vincent, Friday, 10<br />\nbenefit to us—than the decisive defeat of our a. m., Room 23.<br />\nPolitical Conference—Dr. Willoughby, Alternate,<br />\nfamous sister university, whose teams have always been followed with interest by hundreds Tuesdays,8 p. m.<br />\nEconomic Seminary—Asst. Profs. Sherwood and<br />\nof Baltimoreans.<br />\nHollander, Thursdays, 4,-6 p. m. Room 24.<br />\n.<br /><br />\nJOHN A. SLEMONS, 1902.<br />\nJOHN M. HANDEL, 1901.<br /><br />\nor or sr<br /><br />\nThe NEWS-LETTER would like to see a postseason game with St. John's—say Dec. 8th—at<br />\nUnion Park, if possible. Our team never really<br /><br />\nScientific Association—Monthly,<br />\nWednesdays, 4<br />\np. m. Prof. Ames.<br />\nPhilological Association—Dr. Spieker.<br />\nTeacher's Lectures,Educational—Friday,7.30 p.m.,<br />\nMcCoy Hall.<br />\nTeacher's Lectures, Scientific—Saturday, 9.30 a. m.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\nlacrosse field, strike terror in the ranks of an<br />\nopposing host, and cheer our men on to victory.<br />\nbreast.\"<br />\nsavage<br />\nthe<br />\n\"Music bath charms to sooth<br />\nAt present our series of songs is somewhat like<br />\nTo any one who attends Gym. at all, or ever a yard of fine cloth that is supposed to cover<br />\nvisits the building, the musical atmosphere that a two-yard table: what we have is good, but it<br />\nis beginning to pervade the place is noticeable does not extend far enough. Therefore some<br />\nalmost immediately. When stray members of one ought to attempt to lengthen the cloth<br />\nthe Banjo or Mandolin Clubs happen to have either by composing words and music,or setting<br />\nan.open hour, they generally manage to meet in words to some stirring standard selection—<br />\nthe Trophy-room,and wake up the chess players; words that fit both the music and the occasion.<br />\nand not only are we being favored with soft One of the best cheering songs sung atthe Princestrains from stringed instruments, but some ton-Yale game was to the tune of Die Wacht am<br />\nstudents in the exuberance of their joyful spirits Rhein. All who have knack in this line should<br />\nare gradually forming the custom of rending the try, and if the production is good, the NEWSair with vocal productions. It is impossible for LETTER Will certainly publish it.<br />\nthose without a nice ear for music to criticise<br />\nthese selections or even assert that they are<br />\nWWW<br />\nmusic, but without disputing the use of the<br />\nword, we must acknowledge that this pleasing<br />\nReports from the Yale-Princeton game depractice should be encouraged. Of course the scribe the witness-stands as being almost aniserene quiet of McCoy Hall cannot be disturbed, mate with the contrasting Blue of Yale, and<br />\nbut there is no reason why Mack's Palace should the Black and Orange of Nassau, which, minnot be a stage for the ebullition of song after the gled with the charming colors of the apparel of<br />\ndifficulties of Laboratory. The sensuous pleas- the ladies present, produced a varied but beautiures of a rollicking good song, affects every one, ful aspect of color and harmony. Though there<br />\nwhether he is inclined to music or not; music would be some danger of the heavens falling<br />\ncauses a lively spirit to spring from gloom, and were 13,000 persons to witness a Hopkinsgame,<br />\nunites the people who join in. The mystic fasci- and though the bad weather we have experienced<br />\nnation of a negro for a camp-meeting is due to this foot-ball season has prevented many ladies<br />\nthe magic influence that the wierd chants have from attending our games, there have generally<br />\non his musical and fanatic nature. The Ameri- been enough present to relieve the monotony of<br />\ncan people are gradually acquiring the reputation nothing but masculine forms—and since with the<br />\nof the most musical nation; and Hopkins men, fair sex the waving of flags is about the only<br />\nfollowing their benefactory inclination, should meansfor manifesting enthusiasm,flags have been<br />\nendeavor to assist in the establishment of such seen to some extent. The student of nature finds<br />\na reputation. But even without such a high aim, absorbingly interesting the actions of the girl<br />\nye pioneers continue your efforts, and we'll all whose unbounded enthusiasm urges her to join<br />\nJoin in; \"for a dash of joyful song will last a in the yells of the rooters, but who is retarded<br />\nwhole life long.\"<br />\nby a proper sense of decorum, and whose excitevar w<br />\nmentfinds its only outlet through frantic wavings<br />\nmuch of a<br />\nTalking about songs brings forth thefact that of the flag of her escort. It is pretty<br />\nno girl,<br />\nand<br />\nflag<br />\na<br />\ndespite our wonderful increase in the last two burden for a fellow to carry<br />\nhe<br />\nboth<br />\npossess<br />\nyears, we are yet lacking in the line of songs but if he is lucky enough to<br />\nthe<br />\nnot<br />\nand<br />\none<br />\nsuitable for all occasions. Our ode is inspiring; should never go to a game with<br />\nover,<br />\nPeters' Black and Blue is an excellent, effective other. The foot-ball season is virtually<br />\nbeauties,<br />\nits<br />\nadds<br />\ncomposition; the Dummy Line is good; but but during lacrosse,when spring<br />\nwhat we still need is some soul-stirring war every fellow who takes a girl to the games<br />\nsong, which, poured forth by hundreds of loyal should also take a flag. It's a small but pleassupporters, will carry across gridiron and ant matter.<br /><br />\nDASHES.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nTHE ROUGH-<br /><br />\nJoe England—\"But my big brother can lick<br />\nyour big brother!\"<br />\nHOUSE OF REPRESENTATIVES.<br />\nVoice (from bench in corner)—\"Take your<br />\nfeet off my face.\"<br />\nThe House is called to disorder by the PresiEloq. Guy—\"Say, push; if you don't break off<br />\ndent hammering a table, but as the snores of the this rough house, I won't do a thing to you on<br />\nmembers are very s(o)norous (this is a pun),the exams.\"<br />\nSergeant-at-Arms borrows a gun from the KenEnter two Seniors:<br />\ntucky delegation, and succeeds in waking up the<br />\nAngry Mob—\"Get out! Kill 'em! A has!<br />\npush by firing six rounds. \"The first speaker What the—!\"<br />\nwill take the floor,\" says the President.<br />\nSeniors flee in horror.<br />\nBeeuwkes stands up as if he had just seen his<br />\nGentleman from Ireland produces a hod.<br />\nmother-in-law.<br />\nWhite—\"Smoke up, Mickey, your pipe's out!\"<br />\n(Voice)—\"Throw him a rope!\"<br />\nPutts (soto voce)—\"When will you pay me<br />\nBeeuwkes—\"There is no doubt,—er—there is that half dollar you owe for class dues?\"<br />\nno doubt.\"<br />\nHutzler (waking up)—\" What day is to-day ?\"<br />\nGentleman from Ireland—\"Not a dern bit.\"<br />\nBeeuwkes, (wearily)—\"There can be no<br />\nBeeuwkes—\"The city water is unfit to drink.\" doubt\"—<br />\nEloquent Guy—\"Use beer!\"<br />\nVoice—\" Who said there was?\"<br />\nLoud applause from those who are awake.<br />\nEloq. Guy—\"Yes, there is only one way to<br />\nKentucky waves a bloody shirt. The rest breathe correctly. Mr. Carver will meet you<br />\nturn over in their sleep.<br />\ngentlemen, and instruct you in my system of<br />\nKentucky (to Eloq. Guy, aside)—\" What scientific inhalation.\"<br />\nbrand do you drink, Dock?\"<br />\nSmith talks in his sleep—\"* *<br />\nEloq. Guy—\"Kloster, at Pabst's.\"<br />\nWhite—\"Move we adjourn!\"<br />\nTwo villains pull the chair from under GentleWhole House—\"Second it!\"<br />\nman from Ireland.<br />\nGeneral outburst of latent enthusiasm for<br />\nGeneral outcry—\" Mr. Mac. has the floor!\"<br />\nspeaking. Fight in one corner. Three men try<br />\nMarkell, (reading from notes)—\"I protest; to wake Hoffman up. Slemons comes to with a<br />\nthe chair did not sustain him.\"<br />\njolt that shakes McCoy Hall. Stampede for corAngry Mob—\"Fee, fy, fo, fum, the end of the ridor.<br />\nworld will surely come.\"<br />\nBeeuwkes (in distance)—\"There is no doubt,—<br />\nSleepy Voice—\" Wake me up when it gets oh, I mean—\"<br />\nhere.\"<br />\nCurtain!<br />\nH. R. V.<br />\nBeeuwkes (in a pause of the proceedings)—<br />\n\"There is no doubt,—that is, there can be no<br />\nW WW<br />\ndoubt.\"<br />\nProlonged applause, waving of handkerchiefs,<br />\nThe Editors of the \"Hullabaloo\" are making<br />\nbloody shirt and neckties. Gentleman from their efforts felt in a most emphatic way, for it<br />\nBack River sprains his thumb from snapping is doubtful if there is a student in the whole Uniforth thunderous volleys of applause.<br />\nversity who has not been approached on the subPres.—\"You have all heard the debate,and—\" ject of subscribing to the Hullabaloo, and this<br />\nGang—\"Whistle; we are deaf down here.\"<br />\n\"approaching\" usually ends in another name<br />\nPres.—\"I will now throw the question open.\" added to the subscription list, although the price<br />\nVoice (shocked)—\"Don't expose the poor this year will be $1.25 a volume instead of $1.00<br />\nthing.\"<br />\nthe men in the University aught to appreciate<br />\nGuggenheimer—\"Henry James says—\"<br />\nthe value and expense of publishing this book,<br />\nMarkell—\"You're another; I knew Henry and the price should not materially affect the<br />\nJames and everything else before you did.\"<br />\nnumber of subscribers.<br /><br />\nIt<br /><br />\n7<br /><br />\nTHE NEWS-LETTER.<br />\nFOOT-BALL.<br />\nST. JOHN'S, 5 t HOPKINS. 5.<br />\nSaturday's game was one which will long be<br />\nremembered by all who witnessed it. Thc<br />\nelements were favorable in the afternoon, in<br />\nspite of the drizzling rain in the morning, and<br />\nthe grounds were in fair condition. A goodly<br />\nnumber of rooters assembled at Camden Station<br />\nto accompany the team to Annapolis. The<br />\nscene on the train was one of jollification and<br />\nrough-house, Chief rooter Swindell presiding<br />\nas usual, ably seconded by sub-chief rooter Lew<br />\nWhite. The morning was spent in \"doing\" the<br />\n• town. The Naval Academy, the Capitol and<br />\nother places of interest were visited and some<br />\ntook pains to see whether or not the town was<br />\n\"local option.\". Later, the decision was in<br />\nfavor of the negative. The team dined at St.<br />\nJohn's College, the rooters at the Chesapeake.<br />\nAbout two o'clock the latter lined up at the<br />\nstation to be reinforced by those coming down<br />\non the afternoon train. They all then marched to<br />\nthe grounds, rending the air with yells and<br />\nhideous noises, to find the teams putting on the<br />\nfinishing touches before the game. At 2.40 the<br />\nteams lined up. Every one knew that it was<br />\na case of when \"Greek meets Greek.\" Both sides<br />\nwent at each other for blood, and although the<br />\nrooters had given the \"Undertaker\" yell several<br />\ntimes for the edification of the crowd, it soon<br />\nbecame evident that there was \"another little<br />\njob\" for the Hopkins Team as well as for the<br />\nUndertaker, and that the aforesaid job was no<br />\n\"cinch.\" Our team clearly outplayed St. John's<br />\nat every point, putting up a much stronger game<br />\nthan they. We kept the ball in their territory<br />\nmost of the time during the 1st half, but lost it<br />\nwithin 15 yds. of their goal, twice on fumbles,<br />\nonce on downs. The 1st half ended with the<br />\nscore 0 to 0. At the beginning of the second<br />\nhalf, Hopkins kicked off and in 3 or 4 minutes<br />\nSt. Johns had advanced the ball to the centre of<br />\nthe field. Then Wells of St. Johns went around<br />\nright end for a 25 yd. gain, bringing the ball to<br />\nour 30 yd. line. The opposing team then tried<br />\ntheir end plays around left end. Having finally<br />\ngotten the ball on a fumble by one of their own<br />\nmen,St.Johns scored a touchdown, but failed to<br /><br />\nkick a goal. After that St.John's put up their best<br />\ngame. They hit our line at a terrific rate, often<br />\nmaking ten yard gains and keeping the ball in<br />\nour territory a good part of the time. When the<br />\nlast half was finished, all but six minutes, we had<br />\nthe ball on our 7 yd. line. And it was a case of<br />\n\"root hog or die, and root quick\" for the<br />\nHopkins team. Then came a finish sufficient<br />\nto satisfy the enthusiasm of any football crank.<br />\nIn 5 min. and 55 secs. we had put the pig skin<br />\nwithin 4 yds. of their goal, with three beautiful<br />\nend runs, one made by Riggs, the other two by<br />\nTyler. The teams having lined up, Riggs<br />\nwent through for a touchdown just as time was<br />\nup, and the rooters gave an exhibition of an<br />\nameteur insane asylum. The ball was kicked<br />\nout by Riggs. Caster seemed to catch it<br />\nfairly, but the umpire said he (Casler) moved<br />\nhis loot, so the game was ended with a score of<br />\n5 to 5.<br />\nThe contest on the whole was clean and fast<br />\nfrom beginning to end.<br />\nBlanck played a good steady game, so did<br />\nMeadows.<br />\nButler's playing was as usual up to the notch<br />\nand well nigh perfect in every detail.<br />\nThe end runs of Riggs and Tyler were distinguishing features of the game.<br />\nThe team as a whole played in excellent form<br />\nand was in far better shape at the end of the<br />\ngame than St. John's.<br />\nWells and Spates put up the best game for St.<br />\nJohn's.<br />\nThis game gives Hopkinsthe championship,as<br />\nwe were champions at the beginning of the<br />\nseason.<br />\nThe line-up was as follows:<br />\nST. JOHN'S.<br /><br />\nPOSITION.<br /><br />\nHOPKINS.<br /><br />\nGillespie<br />\nL. B.<br />\nWistner (capt.), Seth<br />\nButler<br />\nL. T.<br />\nBaker<br />\nFincke<br />\nL. G.<br />\nHutchins<br />\nWhitman<br />\nC.<br />\nBlecker<br />\nYearly, easier<br />\nR. G.<br />\nSpates<br />\nBacon<br />\nR. T.<br />\nMorgan, Keys<br />\nNelson<br />\nR. E.<br />\nHoward<br />\nMeadows<br />\nRandall<br />\nQ.<br />\nRiggs<br />\nL. H.<br />\nGeary<br />\nSayler, Tyler<br />\nR.H.<br />\nWells<br />\nBlanck.<br />\nF. B.<br />\nHalbert<br />\nUmpire— Artaud. Referee—Thompson, (Georgetown University). Time—Two 35 min. halves.<br />\nTouchdowns—Riggs and Wells.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br />\nJ. H.U., 12; UNIV. OF MD., 0.<br /><br />\nThe Johns Hopkins foot-ball season closed<br />\ntriumphantly on Thanksgiving Day when the<br />\nwearers of the black and blue defeated their<br />\nlong time rivals, the University of Maryland, at<br />\nUnion Park. The day was perfect, and the field<br />\nin good condition,but what proved the greatest<br />\nincentive for each canvas-clad warrior to do his<br />\nutmost to win was thefact that from the grandstand hundreds of fair eyes were focused upon<br />\nhim. The two elevens played clean, hard, fast<br />\nfoot-ball, and one very gratifying thing was the<br />\nabsence of any dirty playing which would tend<br />\nto mar the game. The game was a triumph for<br />\namateur sport. University of Maryland had<br />\nremoved from her team every man who could<br />\nnot play under the amateur definitions cited in<br />\nthe Intercollegiate Official Hand-Book. It was<br />\na contest of bona-fide student against bona-fide<br />\nstudent; and now that the two universities<br />\nthoroughly understand each other and are<br />\nunited in their determination to stand for<br />\nstraight foot-ball, there is every reason to believe that\"peace and harmony shall continue to<br />\nreign,\" and the annual game become a permanent institution.<br />\nThe foot-ball policy of Johns Hopkins is a<br />\nwell defined, though, in this city we regret to<br />\nsay, almost a unique one. We stand for amateurism, and we maintain that our bona-fide<br />\nstudent team is equal to any bona-fide student<br />\nteam that any college in Baltimore can produce.<br />\nBut to return to the subject, the Thanksgiving<br />\nDay game. Our team played as a unit, and<br />\nthat consistent team work won the game for<br />\nus. The Doctors on the other hand played individually; team work was lacking. Their punting was good.<br />\nIn vain the Doctors hammered the Hopkins<br />\nline; it was unmovable. But when the Black<br />\nand Blue had possession of the ball \"why every<br />\ntime they hit the line they went right through.\"<br />\nAgain and again Butler tore great holes through<br />\nthat Maryland line; again and again our backs<br />\nplunged through it for heavy gains, and it was<br />\nthis continual pounding that gave Hopkins a<br />\ntouchdown after ten minutes of play, Butler<br />\ncarrying it over the line. Riggs kicked goal.<br />\nAfter the ball was again kicked off, Hopkins<br /><br />\n(by two serious fumbles)lost it twice in rapid<br />\nsuccession. Then some punting was indulged<br />\nin and in this Maryland showed to better advantage, for on interchange of kicks \"Mike\"<br />\nGriffin of Maryland came out ahead of our men.<br />\nIn the second half the Black and Blue resorted<br />\nto this hammering again and again and by an<br />\nuninterrupted series of gains the ball was taken<br />\nfrom our 25-yard line to Univ. of Maryland's<br />\n1-yard line and then Blanck carried it over for<br />\nHopkins' second touch-down. Riggs kicked<br />\ngoal. The ball was kicked off by Maryland<br />\nand Hopkins again began a steady advance<br />\ndown the field. It was evident that she had<br />\nMaryland \"going\" and it was only the darkness<br />\nthat prevented a larger score from being rolled up.<br />\nThe teams lined up as follows:<br />\nPOSITIONS.<br />\nUNIV. OF MD.<br />\nJ. II. U.<br />\nGillespie,<br />\nDavis, Dann,<br />\nL. E.<br />\nButler,<br />\nL.T.<br />\nScott,<br />\nCasler,<br />\nL. G.<br />\nCarey,<br />\nWhitman,<br />\nC.<br />\nBrown,<br />\nYearly,<br />\nR. G.<br />\nBuck,<br />\nR. T.<br />\nBacon,<br />\nBumgartner,<br />\nNelson,<br />\nR. E.<br />\nDrewrey,<br />\nMeadows,<br />\nQ.<br />\nRogers, Davis,<br />\nRiggs,<br />\nR. H. B.<br />\nBurns,<br />\nSayler,<br />\nL. H. B. Mann, Frosher,<br />\nBlanck,<br />\nF. B.,<br />\nHarper, Griffin,<br />\nReferee—Gresham Poe,(Princeton). Umpire—Henkel, (B. M. C.) Time-keepers—Micky Whitehurst,<br />\n(Univ. of Md.), Ellis Jackson, (D. A. C.) Linesmen<br />\n—Sayler and Green. Touch-downs—Butler, Blanck.<br />\nGoals—Riggs, 2. Time of halves-20 and 18 minutes. Score—J. H. U., 12; Univ. of Md., 0.<br />\nsr sr sr<br /><br />\nA Child's Primer of the Game.<br />\nDid you see little Joel Butler butt the Md. line<br />\nside-wise and over backwards?<br />\nWasn't the ripping sound our tackles-back<br />\nmade realistic?<br />\nMy! but that tackles-back gave one a Thanksgiving appetite.<br />\nHow hard Gillespie tackled! He and Nelson<br />\ndisappointed Maryland so.<br />\nAnd they say that Blanck is only a freshman<br />\nafter all; but then so is Yearley. Think how<br />\nnicely they will \"do\" when they have grown up<br />\nmore! What a lot of openings Cassler made<br />\nfor that promising young man, Sayler! Did he<br />\ntake advantage of them? Oh, yes, Oh my, yes.<br />\nWhitman looked like a \"century plant\" at<br />\ncentre.<br />\nNor was Bacon a ham.<br />\nDid Meadows miss anything coming to him!<br />\nOh, no, he did not. But then, we knew he was<br />\na \"sure thing\" any way.<br />\nRiggs is too much of a \"kicker\" for some<br />\ntastes. He just suits mine. But then, variety<br />\nis the spice of life, and there was plenty of it in<br />\nthe \"kicking.\"<br /><br />\n9<br /><br />\nTHE NEWS-LETTER.<br />\nMUSICAL CLUBS,<br />\nThe Musical Clubs have been having a series<br />\nof daily, and to some extent nightly rehearsals<br />\nwhich have kept McCoy Hallin a constant state<br />\nof uproar. Indeed it is hard for even the most<br />\nwary to know when it is time to pass along the<br />\ncorridors, for notices of the different practices<br />\nare posted often only a short while before the<br />\ntumult is to begin, so that the fortunate one has<br />\nlittle warning or chance to leave the building.<br />\nA great deal of credit is due Mr. Eyster, the<br />\nleader of the Glee Club for his skill and patience<br />\nin drilling the many men who have entered their<br />\nnames as candidates for the Club, for the majority of therri had had little or no previous experience in reading music. Another thing that he<br />\nshould be praised for is the thoroughness with<br />\nwhich he has rehearsed every piece till each man<br />\nknew his part perfectly. And whenever there<br />\nwas a sign of any part being weak, quartettes<br />\nwere straightway formed and the careless ones<br />\nquickly discovered. In this manner the full<br />\nstrength of every voice is assured.<br />\nThis same scheme was adopted last year in<br />\nthe Mandolin Club, with the result that it was<br />\nundoubtedly the best College Club that played<br />\nin Baltimore last winter. Mr. Moulton is continuing this practice and will assuredly meet<br />\nwith like success. In one respect this club is<br />\nbetter than previously, in that the pieces,<br />\nalthough comprising some very lively two-steps<br />\nand marches, are taken mostly from opera selections. For opera selections when played by a<br />\nMandolin Club are beautiful. This fact was<br />\nclearly shown by the enthusiastic manner in<br />\nwhich portions of \"The Singing Girl\" were<br />\nreceived last year. Then in still another aspect<br />\nthe Clubs have made an advance for this year.<br />\nThe Glee and Mandolin Clubs will have several<br />\npieces together, the mandolins playing a soft<br />\naccompaniment to the voices. The Banjo Club<br />\nhas taken a most decided \"brace,\" and with<br />\nmore banjos and banjeaurines bids fair to rival<br />\nits sister clubs.<br />\nBut it is needless to praise the Clubs so highly,<br />\nfor shortly after the -concert at Hannah Moore<br />\nAcademy, on December 7th, will come the Baltimore concert, and then every one will be a judge<br />\nunto himself.<br /><br />\nWITH APOLOGIES.<br />\n'T was the hour preceding dinner,<br />\nSomewhere 'long 'twixt five and six;<br />\nI was standing near the \"gym\" door<br />\nIdly holding down the bricks;<br />\nWhen there came from out the windows<br />\nOf McCoy a fearful din—<br />\nHowls and groans and shrieks and rumblings!<br />\nWhat was going on within?<br />\nMore discordant grew the discord,<br />\nMore unearthly! Could it be<br />\nThat such noise by human voices<br />\nWas produced? Well, I would see.<br />\nThrough the doorway quick I hurried,<br />\nUpward toward the Lecture Hall;<br />\nThere a picture met my vision,<br />\nWhich in night-mares I recall.<br />\nOne poor man had really fainted,<br />\nQuite unconscious there he lay:<br />\nOne was stamping 'round the platform,<br />\nLooking like a wolf at bay.<br />\nIn a double row before him<br />\nThere were twenty fiends or more,<br />\nEach one making noise sufficient<br />\nTo have come from all the score.<br />\nThere was harsh and blatant tenor,<br />\nThere was rumbling jarring bass<br />\nTorture exquisite to listen—<br />\nAh! I understood the case!<br />\nThis was just a Glee Club practice,<br />\nAnd that man with face afrown<br />\nIs the leader, Mr. Eyster,<br />\nHaving troubles of his own.<br />\nAnd the man who couldn't stand it<br />\nAnd had fainted? Well, you see,<br />\nIt was really not surprising.<br />\nHe had suffered agony.<br />\nFor the blow almost killed Fisher,<br />\nWhen the Glee Club tried to do<br />\nHis harmonious arrangement<br />\nOf the song,\"Ma Lady Lu.\"<br />\n—W. B. CARVER.<br />\nOlir ger slr<br /><br />\nUP TO DATE.<br />\nChainless wheels we now frequently see,<br />\nHorseless carriages common may be;<br />\nBut the latest invention<br />\nAttracting attention<br />\nIs the noiseless applause, a in Lee.<br />\n—Nemo.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n10<br />\nITEMS.<br /><br />\nThe Johns Hopkins alumni in Kansas, Missouri, Iowa, Nebraska organized an alumni<br />\nassociation on Thanksgiving day.<br />\nwww<br />\nDr. F. Howard Taylor, R. C. P., M. R. C. P.,<br />\nB. S., made an addresslast week before the Y. M.<br />\nC. A.,on the subject of Missionary work in China.<br />\nHe dwelt principally on the possibilities of gainingfirmer hold upon the Chinese through the work<br />\nof medical missionaries. There was a large audience and the address was thoroughly enjoyed.<br />\nImmediately afterward a short business meeting was held in order to fill the vacancy in the<br />\nboard of directors of the Lawrence House caused<br />\nby the resignation of A. R. Bird '01. Bartgis<br />\nMcGlone '02 was selected for this office.<br />\nW<br /><br />\nThe Senior Class has completed its election of<br />\nofficers for the ensuing year. Those who were<br />\nelected were Lindsay C.Spencer, Historian; Mortimer Bye, Sergeant-at-arms;and John M.Booker, Poet. Those on the Executive Committee are<br />\nJ. G. Machen, W. I. Kohn, J. M. Booker, J. E.<br />\nTyler, Jr., A. W. Bruton, H. W. Warner, and<br />\nNorman Boyer. The Banquet Committee is composed of B. M. Bernheim,A. R.Bird,J. A.Sayler,<br />\nJ. S. Briscoe, and H. S. Byrne.<br />\nser W W<br /><br />\nRobert T. Crane has appointed the following<br />\nmen to serve on the Executive Committee of the<br />\nJunior Class:S.Strouse,E. C. Hill,J. G.Campbell,<br />\nC. A. Myers, H. C. Gillispie, H. B. Stone, R. E.<br />\nGolladay, and S. Smith, including also the President and Vice-President of the class.<br />\nW W<br />\nIt has been the custom in the Univerisity for<br />\nseveral years for each class to give something toward furnishing the Trophy Room.This room has<br />\nbeen set apartfor the especial use and enjoyment<br />\nof the men, and through this custom the room is<br />\nmade more comfortable and attractive, and the<br />\nclasses are bound more closely to the University.<br />\nFor the members of each class feel that they own<br />\nand have paid for some part ofthis room. Accordingly J. Pels, chairman, G. Sisco, A. Pearre, Jr.,<br />\nR. C. Sharretts, and L. C. Murphy, have been<br />\nappointed as a committee to select a suitable<br />\ngift to be given to this room in the name of the<br />\nJunior Class.<br /><br />\nAt the request of Mayor Hayes, Pres. Gilman<br />\nhas appointed Dr. D. S. Johnson and Professor<br />\nWm. Bullock Clark to represent Baltimore at<br />\nthe Convention of the National Irrigation Congress to be held in Chicago.<br />\nwww<br />\nOn November 13th, the fiftieth anniversary<br />\nof the birth of Robert Louis Stevenson, an informal gathering of students in the President's<br />\noffice listened to interesting papers concerning<br />\nthat gifted author.<br />\nwww<br />\nAt a meeting of the College Entrance Examination Board oi the Middle States and Maryland held in New York last week, splans for<br />\nunifying matriculation requirements in all<br />\nstandard colleges were formulated. Dean<br />\nGriffin, who represented Hopkins, is in sympathy with the movement, but states that<br />\nowing to the three year course here, the certificate of the Board will only avail for certain subjects, roughly speaking those requited for our<br />\nfour year course.<br />\nslar W sir<br /><br />\nDr. J. Douglas Bruce, Ph. D., 1894, has<br />\nbeen elected to the chair of English Language<br />\nand Literature in the University of Tennessee.<br />\n.A5 .A5.45<br /><br />\nProfessor Simon Newcomb has prepared a<br />\nmemorial on the death of Professor Thomas<br />\nCraig, formerly director of the mathematical<br />\nseminary.<br />\nAbout twenty students of the Medical School,<br />\nformer students of Yale, celebrated the Yale<br />\nvictory over Princeton on Saturday November<br />\n17, by an enjoyable smoker.<br />\nww<br />\nThey sat upon the garden stile,<br />\nThe youthlet and the maid.<br />\n\"The stars above are not as bright<br />\nAs you,\" he softly said.<br />\nShe lifted up her little hand<br />\nToward luna's golden light;<br />\n• \"The moon above is not as full<br />\nAs you, my dear, to-night.\"<br /><br />\n—Ex.<br /><br />\nki<br /><br />\nti<br /><br />\nTHE NEWS-LETTER.<br />\nEXCHANGE PLACE.<br />\nSOME YELLOW STEAKS FROM THE PRINCETON Tiger.<br /><br />\nLESSONS FOR THE LITTLE ONES.<br /><br />\nChin-a is the Place where the Laund-ries dome<br />\nfrom.<br />\nIt is In-hab-it-ed by Boxers who are worse<br />\nthan<br />\nTom Shark-ey and Mister Corb-ett took Togeth-er.<br />\nChin-a is not so Bad-to Work.<br />\nWillie Holl-en-zolleon would like to work It,<br />\nSo would the Czar—not of the Tend-er-loin,<br />\nHow-some-ever.<br />\nVic has a hunch, she would too.<br />\nBe-sides, the Chinks have no Rights,<br />\nWhat Rights have they?<br />\nThey want their Coun-try to Live in.<br />\nThey would like to Do their Own Pray-ing.<br />\nThey don't like Us.<br />\nThat is E-nough to Queer them to Be-gin with.<br />\nMore ov-er, they have all kinds of Rocks.<br />\nThe Rocks are not doing them A-n-y Good,and<br />\nbesides; we need the Money.<br />\nWe sent some People to tell them their God<br />\nwas N. G. and they got Hot Un-der the Hat.<br />\nThey made a Bum out of the People,<br />\nNow, do you want to Kill them?<br />\nWait, we can Bet-ter.<br />\nWe can turn in Here, at 35th St., and Kill a<br />\nChop Suey.<br />\nBe-cause De-ver-y has not shut up the Pe-kin<br />\nas Yet.<br />\nCome on.<br />\nVir<br /><br />\nON BROADWAY.<br />\nIt happened just the other day.<br />\nI went abroad to take the air,<br />\nAnd as I wandered down Broadway,<br />\nI saw a crowd assembled there.<br />\nNow wondering what the cause could be,<br />\nI hurried up, all blown and hot,<br />\nAnd joined the mob in haste, to see<br />\nIf some one had been killed or not.<br />\nSoon found I what the crowd had drawn,<br />\nA girl, more fair than most girls are,<br />\nWith open-woven stockings on,<br />\n-Was getting on a cable-car.<br /><br />\n11<br /><br />\n\"That's hard.\"<br />\n\"What?\"<br />\n\"The rock that hit my head.\"<br />\nsr sr sr<br />\nglobe struck her<br />\nincandescent<br />\nswinging<br />\nAs the<br />\nseemed to<br />\nlight<br />\nbright<br />\na<br />\nforehead,<br />\nfull in the<br />\nface.<br />\nbreak over her<br />\nw w sr<br />\nI had to go through the<br />\nan'<br />\ngorra,<br />\nMike \"Be<br />\nwhere Casey was murnight<br />\nwoods the other<br />\nthey say is haunted,<br />\nthat<br />\nan'<br />\nfall,<br />\nlast<br />\nthered<br />\nthe whole way.\"<br />\nbackward<br />\nwalked<br />\nI<br />\nan', bedad<br />\ndoin' that?\"<br />\nafter<br />\nye<br />\nwuz<br />\nfor<br />\nwhat<br />\n\"An'<br />\nPat:<br />\nsee if anycould<br />\nI<br />\nthat<br />\nso<br />\nman,<br />\n\"Faith<br />\nMike:<br />\nme.\"<br />\nbehind<br />\nup<br />\ncomin'<br />\nthing wuz<br />\nsr sr sr<br />\na man remarked that if<br />\nago<br />\nmornings<br />\nA few<br />\nmake E.P. Roe,and<br />\nshould<br />\nBoat<br />\na<br />\nin<br />\nThree Men<br />\nthat Pass in the<br />\nShips<br />\nthe<br />\nHale<br />\nEveret<br />\nEdward<br />\nto let Walter<br />\ncompelled<br />\nbe<br />\nwould<br />\nNight, they<br />\nwhich<br />\nBeecher,<br />\nWard<br />\nHenry<br />\nand<br />\nSavage Landor<br />\nand<br />\nHaggard<br />\nRider<br />\nmake<br />\nlikelihood<br />\nall<br />\nin<br />\nwould<br />\nWild.<br />\nOscar<br />\nnot<br />\nif<br />\nRiley<br />\nJames Whitcomb<br />\nw sr W<br />\nOnce Love and Fate a game offoot-ball played,<br />\nA man's poor heart the ball—the field his soul.<br />\nHe won her heart but failed to wed the maid,<br />\nSo Love a touchdown scored, but missed the goal.<br /><br />\nIn that case the game must have been a tie.<br />\nw sr sr<br />\nThe Roman Guide, the three Englishmen and<br />\nthe American stood before the seats from which<br />\nthe Vestal Virgins had once watched the happy<br />\nlions play charley-horse with martyrs. The<br />\nRoman guide waved his hand expansively.<br />\n\"This,\" said he, \"is the Ruin of Ruins, the<br />\nColliseum.\"<br />\nThe American smiled faintly. \"The Ruin of<br />\nRuins?\" he said, negligently, lighting a Bull<br />\ncigarette, \"Oh, Fudge—wait till you steer your<br />\nlamps toward the Dewey Arch.\"<br />\nAs his chest swelled proudly, a button from<br />\nhis vest struck the nearest Englishman in the<br />\neye with alarming force.<br />\n- r sr<br />\n\"For more than a week you have been slighting me,\" she said plaintively, as she took out her<br />\npocket-book and paid the obesity cure doctor for<br />\nten days' treatment.<br /><br />\nrff<br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br /><br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br /><br />\nCALL<br /><br />\nJAS. H. DOWNS,<br /><br />\nBANKERS AND BROKERS,<br />\n217 EAST GERMAN STREET,<br /><br />\nIPOR Class, Fraternity and College Stationery, Banquet Cards,<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nBALTIMORE, MD,<br /><br />\nSMOKE UP!<br /><br />\nRAH! HOPKINS!!<br /><br />\nRAH!<br /><br />\nimminimminim<br />\nGO TO<br /><br />\nRAH!IF ITS<br /><br />\nANYTHING IN TOBACCO YOU WANT<br /><br />\nThe Chas, Wills Surgical Instrument Co,<br />\nBENJ. A. NELSON, GEN'L MANAGER.<br /><br />\nI. D. LANG, TOBACCONIST,<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br /><br />\n833 MADISON AVENUE.<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br /><br />\n•<br /><br />\nBOX TRADE A SPECIALTY.<br /><br />\nDrovers &amp; Mechanics National Bank of Baltimore.<br />\nCapital.Stock $300,000.<br /><br />\nSurplus and Profits, $350,000.<br /><br />\nBALTIMORE, MD.<br /><br />\n300 N. HOWARD ST.<br /><br />\nMUELLER,<br /><br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\n/ 9.1„uwerrat<br />\n.<br />\n00 nat<br /><br />\n..517/C 23oposi/ ...V2o.vos<br /><br />\nA. H. FETTING,<br /><br />\nMANUFACTURER OF<br /><br />\nfired Letter Traternity<br />\njewelry.<br /><br />\n(LONDON STUDIO.)<br />\nFINEST PHOTOGRAPIC WORK<br />\nIN THE CITY.<br />\nOE.<br />\n16$<br />\n.<br />\n1<br /><br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br /><br />\nMASON 4S. HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it. is, I believe, an instrument of the very first<br />\nMORITZ MOSZKOWSKI.<br />\n(Signed)<br />\nrank.\"<br /><br />\n14 AND 16 ST. PAUL STREET.<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\n321 N. Howard Street.<br /><br />\nC. H. Hildebrandt &amp; Son, Sole Agts.<br /><br />\nNEW YORK TO BREMEN,<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nW w gr CABIN PASSAGE AT LOW RATES.<br /><br />\nLONDON, PARIS. GIBRALTAR.<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nA. SCHUMACHER &amp; CO<br />\nGeneral Agents.<br /><br />\nFor particulars apply to<br /><br />\n5 WEST LEXINGTON ST.<br /><br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br /><br />\nJ. I). Wheeler, Cashier.<br />\nChas. S. Miller, Ass'L Cashier.<br /><br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br /><br />\nDIRECT.<br /><br />\nAE) SURETY BONDS<br /><br />\n'fidelity<br /><br />\nST,<br /><br />\nMASONIC TEMPL(.<br /><br />\nCLINTON P. PAINE &amp; CO,<br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br /><br />\neHARI.13S<br /><br />\n229 N.<br /><br />\nCM<br /><br />\nand Deposit Company of Maryland,<br /><br />\nKranz-Smith<br />\npiano CO.<br /><br />\n109 and III North Charles etreet.<br />\nSOLE AGENTS<br /><br />\nbickering, Bradbury and Webster<br /><br />\ne<br /><br />\nite Pianos. tit<br />\nC. dt. P. Phone 2322-2.<br /><br />\n040<br /><br />\nFactory Prices<br /><br />\nBARTLETT, HAAWARD 60 CO.<br />\n• 'founders and Engineers,<br />\nWorks, Pratt and Scott Ste.<br />\nOffice Calvert and German Ste.<br />\nManufacturers ofCast and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas holders, Purifiers, Condensers, etc. Columns, 'Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON 818.<br /><br />\nBECOMES SURETY ON<br /><br />\nALL CLASSES OF BONDS.<br /><br />\nSAFETY DEPOSIT BOXES.<br /><br />\nEDWIN WARFIELD, Pres't.<br />\nxst Vice-Pres't, H. Crawford Black.<br />\nJos. R. Stonebraker.<br />\n\"<br />\n2nd<br />\n'rhos, A. Whelan.<br />\n\"<br />\n3rd<br /><br />\nH. E. BOSLER, Sec'y-Treas.<br />\nHarry Nicodemus,<br />\nAss't See'y-Treas<br /><br />\nBOOKS Old and<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\n605 N. Eutaw St.<br />\nW M. V. P1PPEN.<br /><br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltim ore in everything known in Music.<br />\nSole Agents for<br />\n, Mandolins, Guitars, Banjos<br />\n'<br />\n'Washburn<br />\nand Zithers.<br />\n44 Angelus, Automatic Attachments for<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES.<br />\n201-203 N. CHARLES STREET.<br /><br />\nLUNCH ROOMS!<br /><br />\nHARRY T.<br /><br />\nTHE !DRUID<br />\nIVI Li DVS<br /><br />\nLUNCH ROOM,<br /><br />\n122 NORTH HOWARD STREET,<br />\nOYSTERS IN ALL STYLES.<br /><br />\nYOUR PATRONAGE SOLICITED.<br /><br />\nSNVITH, DIXON &amp; CO.<br /><br />\nPAPER oe<br /><br />\n4<br />\n29-31<br /><br />\nB_ CI3ARIB<br /><br />\nLAGER BEERS<br /><br />\nGlobe<br />\nBrewery<br /><br />\n6oldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br /><br />\nWas. B. Oliver.<br /><br />\nJ. Wm. Middendorf.<br /><br />\nMIDDENDORF OLIVER &amp; CO.<br /><br />\nBankers and Brokers,<br />\n206 IL A.ST<br />\nMembers<br />\nBaltimore Stock Exchange,<br /><br />\nN<br /><br />\nESTABLISHED 1879.<br /><br />\nWedding Silver iirfit5delsor<br />\nIN GREAT VARIETY.<br /><br />\nJACOE31 61- .11?,NKINS,<br />\n216 N. CHARLES ST.<br /><br />\nSilversmiths.<br /><br />\ne<br /><br />\n4<br /><br />\n• ORIGINALANDFAMOUS<br /><br />\nROCHESTER BEER- Bavarian<br /><br />\nrerun l3rau<br />\nApollo<br /><br />\nOffice and Depot, 227-239 5. Central Avenue.<br /><br />\nGEO. C. SUCRO, Sole Agent.<br />\nHome Telephone 2060<br />\nc. &amp; P. Telephone 10(10<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br /><br />\nATLANTIC TRANSPORT CO.<br />\n1 BROADWAY<br /><br />\n403-409 WATER ST.<br /><br />\nNEW YORK<br /><br />\nWilson Keyser, Cashier.<br /><br />\nHOWARD AND GERMAN STREETS,<br /><br />\nBALTIMORE, MD.<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nJAMES<br /><br />\nTHEO. WARNER,<br /><br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nW. BALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\n11\"nfritz<br />\nStudio.<br /><br />\nR. PAINE.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS,<br /><br />\nphotographs<br /><br />\nmanK•<br /><br />\n0001111ERCIFIL &amp; FARMERS NOTIONFIL BANK,<br /><br />\nHIGH GRADE Goons—Lem Puiees.<br />\n203<br /><br />\nTRADE<br /><br />\nBALTIMORE<br />\nBRANCW<br />\n717-239S.CENTRAIAVE<br />\nGEO.C.SUCRO•<br /><br />\nImwrenee B. Kemp, President.<br /><br />\nUNIVERSITY<br />\nBOOK STORE,<br /><br />\nTHE BLAKE CO.<br /><br />\nBARTHOLOMAY'SIs THE Bohemian<br /><br />\nBALTIMORE.<br /><br />\nHENDERSON'S<br />\nTEXT BOOKS, NOTE BOOKS.<br />\nSTUDENT'S SUPPLIES,<br /><br />\nROCHESTER,N.Y.<br /><br />\n.• MANAGER • •• •\"<br /><br />\ns-rpoiovr,<br />\nBALTIMORE, MD.<br /><br />\nER.<br /><br />\nBartholomay Brewery Co.<br /><br />\nHATTERS, 43$<br /><br />\nCANES, ETC<br /><br />\nAgents for Lincoln 86 Bennett and Walter Barnard's London Hats.<br />\n3:24 W. 13A.I.;FIIN.40R.E<br />\nMANUFACTURERS OF<br /><br />\nSilk and Cassimere Hats.<br /><br />\n•q11.-•&lt;41wHOPKINS CAPS.<br /><br />\nGushing st compan<br /><br />\n0 BOOKSELLERS ...<br />\nN<br />\n.STATIONERS.<br /><br />\n34W. BALTIMORE STREET<br />\nSUCCESSOR TO CUMMINS<br /><br />\n20 WEST LEXINGTON<br /><br />\nSTREET.<br /><br />\nSPECIAL DISCOUNT TO STUDENTS.<br /><br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS 11100/1S.<br /><br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins Hospital and The Woman'sCollege of Balt°.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nI1ELEN 14. 1-10L.,LXDAY,<br />\n600 N. EC 1.31*.A.MT<br />\nBALTIMORE, MD.<br /><br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br /><br />\nT1EF<br />\npiANos<br /><br />\nCINIAS. M.<br /><br />\nAnheuser-Busch<br />\nBrewing ilss'n<br /><br />\nYou get the benefit of<br />\nall this labor,skill,brains<br />\nand capital.<br /><br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating; terms.<br />\nWrite for Illustrated Cata[logue.<br />\nSTIEFFR,<br /><br />\n9 N. Liberty St., I taltimore, Md. 5n nth St , N. AV., Washington, D. C.<br /><br />\nB. U. EICHELBERGER,<br /><br />\nSt. Louis, Mo.<br /><br />\n1300}'(S AND STATIONERY,<br /><br />\nBrew the Best Beers<br />\nin the World.<br /><br />\nNo. 308 North Cl-karleal Street,<br /><br />\nDAVTIMORE<br /><br />\nENGRAVING AND STAMPING.<br />\nY. N. C. A. BUILDING,<br /><br />\nBRANCH:<br /><br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\nC. 86 P. Telephone<br />\n2314.<br /><br />\nC. &amp; P.Telephone 2351.<br /><br />\nSTONEBRAKER BROS.,<br />\n21z E. Baltimore St.<br /><br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br /><br />\nFORD'S!<br /><br />\n'-THE THEATRE OF BALTIMORE.4s<br /><br />\nDEC. 3,<br />\nONE<br />\nWEEK<br /><br />\n011auncey Olcott.<br /><br />\nLEMMERT<br /><br />\nDEC. 10,<br /><br />\nFITTING AND DRA<br />\nPING THE OUTER MAN SO<br />\nTHAT HIS FIGURE IS SHOWN<br />\nTO BEST ADVANTAGE.<br />\nIT IS A PLEASURE TO WEAR<br />\nCLOTHES MADE BY US.<br /><br />\nLEMMERT,<br /><br />\n\"Way Down East.\"<br /><br />\nONE<br />\nWEEK.<br /><br />\nLEADS IN<br /><br />\nNIXON &amp;<br />\nZIMMERMAN'S<br /><br />\nAcademy of Music !<br />\nfel A' ifi)<br />\niF41201-IMAN'S<br />\nEMPIRE THEATRE COMPANY,<br />\nIn \"Lord and Lady Algy.\"<br /><br />\nWEEK OF<br />\nNOV. 26th.<br />\n(THANKSGIVING)<br /><br />\n123 AR<br />\n14 E. FAYETTE STREET.<br /><br />\nPERSONAL APPEARANCE OF<br /><br />\nWEEK OF<br />\nDEC. 3rd.<br /><br />\nPECIAL DISCOUNT<br /><br />\nS<br /><br />\njt<br /><br />\nipt<br /><br />\nTo the Students and Nurses of Johns Hopkins WC will lIuIl&amp; 1<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br /><br />\n0 y<br />\n0<br /><br />\nDE.NIMAN THOMPSON<br />\nIn '' The Old Homestead\"<br /><br />\nOUR HERD SIR,<br />\n9<br /><br />\nMINOR'S,<br /><br />\nw JIFFES STUDIO, sr<br /><br />\n• 218 NORTH EUTAW STREET,<br />\n106 N. CHARLES STREET.<br /><br />\nBALTIMORE, MD<br /><br />\n•<br /><br />\nthe n cis )blest part of your<br />\nImprove its appear-<br /><br />\np twee and comfort by wear-<br /><br />\nlog OUR HATS.<br />\ning<br />\nUP-TO-DATE,<br />\nONE PRICE.<br /><br />\n411P,<br />\n.•••<br />\nIV\"<br /><br />\neeee<br /><br />\n4<br /><br />\ntioLiNPFEL 6<br /><br />\ngctrtt<br /><br />\nM<br /><br />\nMandolins*<br /><br />\nEMBERS OF THE MANDOLIN CLUB and all musically inclined HoPKINs men who desire to purchase a<br />\nstringed instrument should visit the only manufacturers in Baltimore.<br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br /><br />\nNEAR SARATOGA ST.<br />\nOPEN EVENINGS.<br />\nINSTRUMENTS TAKEN IN EXCHANGE.<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\nGUITARS AND BANJOS.<br /><br />\nJ. 8MIT1-1,<br /><br />\nWELL! WELL! WELL! WELL!<br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\nDROP IN HOPKINS<br />\nON SATURDAYS<br /><br />\nEMSTSMUMIESAWSMMNSIZONAMMA<br /><br />\n•<br />\n•<br />\n•<br />\n•<br /><br />\nAND WATCH US MAKE THE FINEST CHOCOLATES ON EARTH<br /><br />\nSPECIAL FLAVORS:\"PONCE<br /><br />\nDE LEON.\"<br /><br />\nWALDORF-ASTORIA.\"<br /><br />\nOld mid New<br /><br />\nCollege and University Books Bought and Sold,<br /><br />\n0151-1 &amp; mEUNER,<br /><br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br /><br />\nKRISPETTES KONTINUALLY.<br />\n40W<br /><br />\nBooKs<br /><br />\nNEW=ZWANTROZNAMEENIZUMEMEMMOMMATAMMS1<br /><br />\nCAN'T OCT 'EPA CLNEWNERE.<br /><br />\nKORN<br /><br />\nlii<br /><br />\nNMENES'aa<br /><br />\nCall at 805 North Hocward Street,<br /><br />\nLEXINGTON STREET.<br /><br />\n3 DOORS ABOVE MADISON.<br /><br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br /><br />\nBALTIMORE, MD.<br /><br />\n125 EAST, NEAR CALVERT STREET.<br /><br />\nC. SS. h SICRRCUM000filUDSEORE<br />\nCOLLARS.<br /><br />\nCUFFS<br /><br />\nGLOVES.<br /><br />\nIONEBRA,<br />\nKER<br />\nriter<br />\nI aVer'S<br />\nPal ic5[\\eli<br />\n(0•_)<br />\na7 E.BALT0.6T___\\<br />\n*<br /><br />\nE.rc<br /><br />\nbALTIMORD.<br /><br />\nBRACES.<br /><br />\nUMBRELLAS.<br /><br />\nCANES.<br /><br />\nTIES.<br /><br />\nETC.<br /><br />\nNovember 7th, fgoo.<br />\nWhile visiting the Paris Exposition 01 1900, the wonderful display of<br />\nwines from all parts of the world was made a special study by our representative, who secured some very fine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Cutlet, Chateau Larose, Chateau Lafitte, Chattau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s of Deinhard &amp; Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Olney Forrester &amp; Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br /><br />\nSTONEBRAKER BROTHERS,<br />\n217 E. BALTIMORE ST.,<br /><br />\nI.<br /><br />\nBALTIMORE, MD.<br /><br />"}], "field_media_file": [{"target_id": 36166, "display": null, "description": null, "target_type": "file", "target_uuid": "70dcf089-9f53-4775-b8e2-6dfcddf856c7", "url": "http://digital.library.jhu.edu/system/files/2022-03/12156-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12156, "target_type": "node", "target_uuid": "c2dbda7a-0019-4533-bb9b-ad3dc3b1d8c8", "url": "/node/12156"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "2ddd647c-2c41-4cfb-94a9-93cf0f33a589"}]}