{"mid": [{"value": 36539}], "uuid": [{"value": "c116052d-879a-489d-82e2-d9a1351f022d"}], "vid": [{"value": 36539}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:48:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12904-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:48:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:48:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "3TIEIS musrizrimn<br />\nVOL. XXIV, NO. 10.<br />\n<br />\nBALTIMORE, 'MD., DECEMBER 16, 1919.<br />\n<br />\nPRICE, FIVE CENTS<br />\n<br />\nENTERTAINED BY MR. THURSTON MUSICAL CLUBS GUESTS OF TOME PUBLIC. INVITED TO INITIATION FRESHMEN DEFEAT EOPHOMORES<br />\nMagician Gives Clever Talk at Big<br />\nMass-meeting—Many Announcements Made.<br />\n<br />\nTrip to Port Deposit Full of Amusing<br />\nIncidents— Will Play at Gilman's,<br />\nJanuary the 10th.<br />\n<br />\nOmicron Delta Kappa Will Hold Public<br />\n• Ceremony in C. E. Hall, Wednesday the 17th at 12.20 O'clock.<br />\n<br />\nDodson Makes 60-Yard Run for Touchdown—Lack of Practice Tells<br />\nAgainst Sophomores.<br />\n<br />\nAt the mass-meeting held FriThe student body of the. UniThe freshman football team<br />\nIn spite of .an evening of mist,<br />\nday in the C. E. Hall, Bartus rain, and mud, 47 members of versity .has been invited to attend turned the trick<br />\non the heavier<br />\nTrew made several announcements the Johns Hopkins combined mus- the public preliminary initiation and more<br />\nexperienced sophomores<br />\nconcerning the play to be given by ical clubs arrived at 5.30 P. M. of its new members into the Omilast Saturday, winning to the<br />\nthe dramatic club on Monday, the last Saturday, at the foot of a cron Delta Kappa fraternity to<br />\ntune of 6-0. The sophs showed<br />\ntwenty-second.<br />\n.high bluff at the top of which the be held -December 17, 1919, in the a<br />\nmarked lack of teamwork and<br />\nFerdinand :Meyer, captain of la- 'Tome Institute is situated. The Civil Engineering Building, at<br />\npunch,<br />\nnever once being able to<br />\ncrosse, said that fall lacrosse prac- absence of Professor Swartz was 12.20 o'clock. A talk will be given<br />\ntice would soon be called off and felt, for the boys were not accus- by one of the alumni members of earn a first down, whih: the Freshthe equipment must be handed in tomed to sealing bluffs. • It was the fraternity, probably the Dean ies tore off eight. The freshmen<br />\nin the near future. He also called pitch dark, and it was a great or Dr: French. Immediately fol- line, of which only four were first<br />\nattention to the excellent schedule relief when the boys eventually lowing .the public initiation the string men, played with wonderwhich has been promised and to reached the summit. after groping members and initiates will pro- ful teamwork, stopping the<br />\nheavy<br />\nthe good news that Ream, Wolfe their way up a Series Or steps all(I ceed to the Hopkins. Club for the sophomore<br />\nbacks at the line of<br />\nprivate initiation and after which•<br />\nhad consented to coach the team<br />\nIld(1y<br />\nscrimmage repeatedly.<br />\nagain this year.<br />\nThe hearty dinner was most wel- a dinner will be given.<br />\nCromwell and Landy played<br />\nTeddy Burger announced that come to the tired inoiltain climbThe Omicron Delta Kappa frathe public initiation of the Omi- ers, and soon all glooay thoughts ternity was founded 114 1914 at hard slashing football on the line,<br />\ncron Delta Kappa fnt I ernity of mud and -rain were dispelled Washington and Lee University while Middleton nabbed the runwould be held in the Civil Engi- by the cordial welcome the Hop- and the Hopkins chapter establish- ner time after time when the<br />\nneerino. Lecture Hall, at 12.20, to kins men received from 1). Mur- ed in 191(L Thus the fraternity is sophs attempted to encircle his<br />\nbe followed by the private initia- ray P. Brush, our former deny, comparatively a new thing and end. Kelly, the young freshman<br />\ntion and dinner at the Hopkins and from Tome. There were ac- will probably mean .more in the quarterback, who was not out for<br />\nClub. He then introduced Mr. comodations for only tvnty-live future than a ny other organiza- the 'Varsity this season, outgenerThurston, the great magician.<br />\n.verity. ..Itk aims aled the upperclassmen at all<br />\nmen, and at first it was d ci ed tion at the,l'Ai<br />\nMr. Thurston, after telling the that the freshmen would tittAw<br />\nare to fndher -The inieWts of times.<br />\nassembly that he had come out Baltimore on the one o'clock train' Hopkins • in every way, help up- - The sophs showed throughout<br />\nsimply for the pleasure of seeing from Perryville. They were re- hold old traditions and originate the fracas lack of practice and<br />\noverconfidence. In the rush betheir handsome faces, explained lieved to learn that room for them and support new ideas.<br />\nhow he had happened to become would be provided.<br />\nThe fraternity is an honorary tween the halves several of the '22a magician. It seems that at the<br />\nThe concert was a complete suc- one and to be a member of Omi- gridders took part, instead of takage of seven lie had had the pleas- cess. The Tome boys turned out cron Delta Kappa means that a ing a much needed rest, which unure to see Herman, at that time in a body, and the remaining,seats man has received one of the great- doubtedly was to be counted in<br />\nthe greatest magician_ in the in the large chapel were occupied est honors, in college as only the their failure to advance the ball in<br />\nworld, perform, and had imme- by visitors. Both the elder people few men. who are the very best in the second half, as they had both<br />\ndiately decided to become a ma- and the students were highly the five branches of scholarship, weight and experience on the<br />\ngician. Years later, however, he plased with the concert, as was athletics, literary activities; pub- youngsters.<br />\nfound himself at Northfield study- evidenced by the continuous ap- lications, and social leadership<br />\nAlthough there were several<br />\ning for the ministry. After four plause' and the large number of are admitted.<br />\nfumbles, there were not nearly as<br />\nyears here he completed all plans encores to the special numbers.<br />\nThe 'national convention of the many as might have been expected<br />\nto go to University of Pennsyl- It was \"the best entertainment fraternity will be held, here prob- for the slipperiness of the field<br />\nvania for a course in medicine. Tome has heard for more than a ably some time soon after Christ- and the heavy, wet ball.<br />\nHe was to be given this course on year,\" as one of the Tome seniors mas.* The officers of this chapter<br />\nIntercepted forward passes on<br />\ncondition that he become a med- remarked.<br />\nare at present, Bobby Hoffman, the part of Dodson and Barchet<br />\nical missionary in China upon<br />\nAn unusually big program was president; Charlie Leber, vice- played an important part in the<br />\ngraduation.<br />\npresented. The main new feature president, and Terry Burger, sec— game, as the single touchdown<br />\nOn the way to Philadelphia he. in it was the original Egyptian retary.<br />\nwas scored in this manner. Dodstopped off in New York and there dance by Princess Kumalae, who<br />\nson ran in and intercepted a short<br />\nagain saw a performance by Her- is an unrivalled expert direct was overflowing with songs and forward pass, catching it like a<br />\nman. The next morning when he from the Orient, where her fame jokes. His buck-dancing -made baseball, and tore through the '22<br />\nwent to the station whom should as a, professional -anaesthetic\" a hit\" at Tome. While dancing line for a 1.1111 of 60 yards and a<br />\nlie see but Herman walking up dancer sprearl so rapidly that she he remarked, \"I shake my should- score. Half the soph team was<br />\nand ,down. By some mistake, or was invoked to giVe a demonstra- ers and I shake my knees. This so dumfounded that they stood up<br />\nthe intervention of fate he was tion before the future Hopkins is a free country, and I'll shake and watched him go past, while<br />\ngiven a ticket to Syracuse, the des- students. Her beautiful costume what I pleaw!\" and then proved the rest threw themselves at the<br />\ntination of - Herman, instead of was even- more-sensational than it by his remarkable dancing.<br />\nrunner, but Dodson's stiff-arm was<br />\nThe jazz orchestra, consisting working well, and excellent dodgPhiladelphia. When asked whether any that Cleopatra ever wore.<br />\nhe,wished to exchange it he said, Princess Kumalae, alias Holmes of Messrs. Bowers, Coulter, Meyers ing on the slippery field enabled<br />\n\"No, I'll go to Syracuse.\"<br />\nBoyd, was forced to perform in and Rankin proved most popular. him to elude all the tacklers..<br />\nThus, purely by chance, he was artificial moonlight, since it was Ralph Bowers, the pianist, also Barchet failed at a try for goal.<br />\nstarted on the way toward becom- rainy weather, and the moon did played a,piano solo, \"The Vamp.\" Toward the end of the fourth<br />\ning the world's greatest magician. not appear. This, at least, afford- The applause was so great that quarter Barchet intercepted a forHe had many long years of work ed ample' opportunity for the they had to give several encores. ward pass on his 35-yard mark,<br />\nand hard luck before him and it Tome boys to use their imaginaThe Hawaiian strino. trio, and bid fair to repeat Dodson's<br />\nwas only by perseverance that he tions.<br />\nMessrs. Coulter, Riggs and<br />\n6 Ham- spectacular run. However, John<br />\nsucceeded.<br />\nMr. Pegram, as Buck, the Bell-. bleton, was greeted with repeated Markwell overtook him on the<br />\nHere Mr. Thurston was warned boy, gave a very witty monologue bursts of applause. \"Doug\" Coul- soph's eight-yard line, after a run<br />\nthat his time was nearly up so he and explained to the audience how ter played \"Spring Song\" on his of 57 yards, thus preventing a<br />\ncalh4 for a volunteer to help him he became his own grandfather. ukulele. Hambleton gave the Ha- second touchdown, as '22 tightenBuck was a handsome negro and<br />\n(Continued on page 3, col. 2)<br />\n- (Continued on page 7, col. 3)<br />\n(Continued on pace 7, col. I)<br />\n<br />\n\f111•111111M<br />\n•<br />\n•<br />\n<br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16,1919.<br />\n<br />\n2<br />\n<br />\nMAY SELL LOTS TO CITY COLLEGE<br />\nSites of McCoy and Levering Halls for<br />\nSale—Would Make Natural Outlet<br />\nfor B. C. C. Expansion.<br />\n<br />\nOU'LL smoke a WDC more than an ordinary pipe,<br />\nbecause it's. a sweet, mellow smoke. Follow the old<br />\npipe connoisseurs and have three, four, or more W D C Pipes<br />\non your rack. Smoke a cool one every time. Then you'll<br />\nknow what a real smoke is. Any good dealer will furnish<br />\nyou with several select shapes.<br />\n<br />\ny<br />\n<br />\n-<br />\n<br />\nWm. DEMUTH 8t CO:. NEW<br />\nWORLD'S<br />\n<br />\nLARGEST<br />\n<br />\nYORK<br />\n<br />\nMAKERS—.00e FINE<br />\n<br />\nikrairrirk<br />\n<br />\nPIPES<br />\n<br />\n'Kipp To.<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nHIGH GRADE CHOCOLATES.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot .be underquoted by any house at any time.<br />\nBesides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br />\n<br />\nJohn C. Knipp & Sons<br />\nDRAPERIES<br />\n<br />\nDECORATIONS<br />\n<br />\nFURNITURE<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nATTENTION! J. H.U.STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br />\n<br />\nPRINTERS<br />\n<br />\nPUBLISHERS<br />\n<br />\nMEY,F,FALTIEIMER<br />\nThe Big Stationery Store<br />\n1 0- 1 2 N. HOWARD STREET<br />\n<br />\nBALTIMORE<br />\n<br />\nThe sites of McCoy Hall and<br />\nLevering Hall will soon be sold<br />\nat private sale to the highest bidder. This is an extraordinary opportunity for the Baltimore City<br />\nCollege to expand.<br />\nThe entire block adjoining the<br />\nCity College on the north between<br />\nHoward, Eutaw and Druid Hill<br />\navenue, is now available for the<br />\nuse of the City College if the City<br />\nwill consider taking it over from<br />\nthe Johns Hopkins University.<br />\nNo money would be required ne:<br />\ncessarily, since the University<br />\nwould probably be willing to take<br />\nCity Stock in payment; or, if the<br />\nCity desires to purchase the property out of the general budget,<br />\nthe University would probably accept one-fourth the exact amount<br />\nper year for a period of four<br />\nyears, meanwhile, occupying without rent the Chemical Laboratory<br />\nand Biological Laboratory. The<br />\nCity College, each year in the last<br />\nfour, has practically required an<br />\nadditional floor in the old Main<br />\nBuilding located in the block 'offered and is now occupying the<br />\nentire building as an Annex. This<br />\ngrowth will continue, as surely as<br />\nthe City is growing, and should<br />\nnow be provided for. Men of vision who urge taking over this<br />\nProperty before it is sold elsewhere will unquestionably do the<br />\nCity College and the City a genuine service.<br />\nIf this block is acquired by the<br />\nCity, the building there will serve<br />\nthe immediate needs of the City<br />\nCollege and in the future the<br />\nappearance and utility of the City<br />\nCollege may be substantially added to. In the first place, the<br />\n-architect who planned the City<br />\nCollege Building, evidently expected the buildings in front of it<br />\nto be razed or the street to be cut<br />\nthrough and, with that expectation in view, he put the entrance<br />\naround in what is now an alley.<br />\nThis situation can be appreciated,<br />\nespecially if one stands in front<br />\nof the main entrance of the City<br />\nCollege and looks at the building<br />\nfrom :that point of view. If this<br />\nsituation is gtraiglitened out, it<br />\nwill add tremendously to the value<br />\nof the College as a public building.<br />\nThis block, in addition to affording an open space in front of<br />\nthe City College, would also provide ample room for a Cage and<br />\nAnnex over near the Eutaw street<br />\nside while the space immediately<br />\nin front of the City College can be<br />\nused for a track and recreation<br />\nground, such as has been provided<br />\nfor the Polytechnic Institute, on<br />\nthe west side of Calvert street opposite its Main Building. Students of the College should have<br />\nthis, both from the standpoint of<br />\n(Continued on page 6, col. I)<br />\n<br />\nJohns Hopkins Press<br />\nI.—American Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nVolume XLI in progress. $6 per volume. (Foreign postage 50 cts.)<br />\nII.—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER. Editors. Quarterly. 8vo.<br />\nVolume XL in progress. $5 per volume. (Foreign postage 50 cts.)<br />\nIII.—Johns Hopkins University Studies in<br />\nHistorical and Political Science.<br />\n8vo. Series XXXVII in progress.<br />\n$3.50 per volume.<br />\nIV.—Johns Hopkins University Circular<br />\nIncluding Annual Report. Register,<br />\netc. 8vo. Volume XXXVIII in progress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXX in<br />\nprogress. $3 per year. (Foreign postage 50 cts.)<br />\nVI.—Johns Hopkins Hospital Reports.<br />\n4to. Volume XIX in progress. $5<br />\nper volume. (Foreign postage 50 cts.)<br />\nVII.—Contributions to Assyriology and<br />\nSemitic Philology.<br />\n(Beitrage zur Assyriologie, etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITSCH, Editors. Volume X in<br />\nprogress.<br />\nVIII.—Modern- Language Notes.<br />\nJ. W. BRIGHT, Editor in Chief;<br />\nG. GRUENBAUM, W. KURRELMEYER and •H. C. LANCASTER.<br />\nMonthly. 4to. Volume XXXIV in<br />\nprogress. $3 per volume. (Foreign<br />\npostage 50 cts.)<br />\n1X.—American Journal of Insanity.<br />\nVolume LXXVI in progress. Quarterly. 8vo. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\nX.—Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n81<br />\n,<br />\n0. Volume XXIV in progress. $3<br />\nper volume. k Foreign postage 25 cts.)<br />\nXL—Reprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. Fourth<br />\n.Series in progress, $2.<br />\nXII.—Hesperia.<br />\nHERMANN COLLITZ, HENRY<br />\nWOOD and JAMES W. BRIGHT, Editors. Fourteen numbers have appeared.<br />\nMonograph in the Romance<br />\nLanguages and Literatures.<br />\nEDWARD C. ARMSTRONG, Editor.<br />\n8vo. Six numbers have appeared.<br />\nXIV. -RepOrts of the Maryland Geological Survey.<br />\nE. B. MATHEWS, Editor.<br />\nXV.—Johns Hopkins University Studies in Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nA full list of publications wilt be<br />\nsent on application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16, 1919.<br />\nFaculty Notes.<br />\n<br />\nQUACKS FROM A QUACK<br />\n<br />\n11<br />\n<br />\nDr. Jos. T. Singewald, Jr.,* has<br />\nbeen granted A leave of absence<br />\nin order to carry on further geological investigations • in South<br />\nAmerica. He will sail from New<br />\nOrleans on December 17. . .<br />\nThe field of work will be in<br />\nnorthwestern Peru, and will consist primarily in an investigation<br />\nof the oil districts of that region,<br />\nand of the possibility of their extension. Although the work is<br />\nbeing done for one of the large<br />\noil companies, it will afford an<br />\nopportunity to extend the geologic<br />\ninvestigations of the recent Williams Memorial Expedition.<br />\nThe Williams Expedition was<br />\nprevented from entering this region on account of yellow fever<br />\nand the bubonic plague at the<br />\nport of entry'at Paita, Peru; hence<br />\nDr. Singewald was unable to secure the geologic data on that<br />\nregion. This work is expected to<br />\nyield additional material for the<br />\ncollection of the Department of<br />\nGeology covering South America<br />\nand to form the basis of further<br />\ngeologic and paleontologic researches by members of the department.<br />\n<br />\nJust between you and me and<br />\nthe post-office I want to tell you<br />\nall about the compliment that<br />\nthe editors handed out to me the<br />\nOther day. They • said, \"George,<br />\nYou've got a pretty good line but<br />\nit hasn't any clothes on it.\" '<br />\nNow<br />\nhow would you interpret them<br />\nwords?<br />\nI want to get down on my bended knees and apologize for a very<br />\ngrievous mistake in spelling which<br />\noccurred in a recent issue. The<br />\nname of the widely heralded and<br />\nWorld.famous cbemist, the man<br />\nWho has done so much to benefit<br />\nscience by his untiring and exhaustive research work, the man<br />\nwhose -inventive genius is the<br />\nwonder of the age, the man whose<br />\nPatents are the pride of the nation and whose inventions are in<br />\nevery kitchen, this man, I say,<br />\nspells his name capital Gwyn.<br />\nOf course I realize that I could<br />\nlay the blame on the type-setter,<br />\nbut I'm not that kind of a fellow.<br />\nThe unpardonable error was purely and-solely my fault, as Dr. Hulburt said, \"I did it with my little<br />\nhatchet.\"<br />\nJust a little incident that took<br />\nBureau Well Under Way.<br />\nplace. in Prof. Slominsky's logic<br />\nThe Bureau • of Athletic Pub-class last Wednesday. After arriving on the scene of action the licity of Johns Hopkins has gottenwell under way. Dope on a11 athcustomary ten minutes late, and<br />\nafter having successfully borrow- letics going on at the University<br />\ned the customary cigarette and is sent to all the Baltimore newsmatch, the illustrious philosopher papers three times a week, and,<br />\nwrote on the board, \"All men are as soon as the board can get in<br />\nperfect.\" Etaving looked thrice touch with them, will be mailed<br />\nat the instructor, Macht, the con- to papers of neighboring cities.<br />\nThe board consists of Norman<br />\nscienciouS objector raised a storm<br />\nof protest. Whereupon the logi-. C. Keyes, director and editor of<br />\ncian made answer, \"Mr. Macht, I lacrosse; E. M. Welliver, football;<br />\nrealize .that it is a damn lie, but L. W. Lord, baseball; W. Carbo,<br />\nnevertheless I write it upon the track; C. I. T. Gould, minor<br />\nboard unblushing.\" Now, boys, sports; and Carl G. Scott, official<br />\nthat really and truly happened. If photographer.<br />\nyou don't believe me ask the \"old<br />\nFor Diver's Reasons.<br />\nboy\" himself.<br />\nUnto<br />\na<br />\nlittle African '<br />\nThe report has come drifting in<br />\nA-swimming in the Nile<br />\nthat in the course of experiments<br />\nAppeared quite unexpectedly<br />\ndown in the chem. lab. it became<br />\nA hungry crocodile,<br />\nAnd with the chill politeness<br />\nnecessary to mix iodine with alThat makes the warm blood<br />\ncohol to form the compound<br />\nfreeze,<br />\nwhich Dr. Gwyn tells us generally<br />\nSaid, \"I'll take a little dark<br />\nsports the title Tincture of Iodine.<br />\nmeat<br />\nIn the midst of this experiment a<br />\nWithout the dressing, please.\"<br />\n• —Ex.<br />\nlarge crowd gathered, no doubt attracted by the old familiar odor.<br />\nENTERTAINED BY MR. THURS1ON<br />\nAmong these was \"Minnie\" Norwood, (you know Minnie, dear lit(Continuedfrom page I)<br />\ntle thing, isn't she?) who said it<br />\nperform<br />\na trick. After much percertainly looked like the real<br />\nsuasion<br />\nJake Miller reluctantly<br />\nthing, and it didn't smell a bit<br />\nlike grape juice, and who insisted consented to assist him. As a reupon drinking it. As yet I haven't sult his character was almost<br />\nheard the results, but if it worked ruined for a search by Mr. Thursall right I certainly will install ton revealed the fact that he had<br />\nsuch an apparatus to take the concealed upon him, in addition<br />\nplace of my present rasin plus to numerous packs of cards, a pair<br />\nginger ale method, wouldn't you, of baby's socks, a lady's stocking<br />\nand some other article of feminine<br />\nDick Tone?<br />\napparel which it is impossible for<br />\nthe writer to describe.<br />\nCo-operate.<br />\nMr. Thurston did not have time<br />\nProf.—I want to see you get a to investigate further into the<br />\nB on this exam, young man.<br />\nmysteries of Jake's surroundings<br />\nY. M.—So do I. Let's pull to- so after a hullabaloo for Mr.<br />\ngether.—Ex.<br />\nThurston the meeting broke up.<br />\n<br />\n3<br />\n<br />\nZIONIST SOCIETY HOLDS MEETING<br />\nInteresting Address Given by Mr.<br />\nMarvin Lowenthal of New York<br />\nWork Well Under Way.<br />\n<br />\nThe Johns Hopkins Zionist Society held its second monthly<br />\nmeeting last Wednesday, December 10. The feature of the meeting was an illuminating address<br />\nby Mr. Marvin Lowenthal, of New<br />\nYork City, on the subject \"Some<br />\nZionist Problems of Today.\" Mr.<br />\nLowenthal is connected with the<br />\nExecutive Department of the National Zionist Organization and is<br />\ntherefore well informed concerning the problems and difficulties<br />\nencountered in the restoration of<br />\nYour Suit or Overcoat<br />\nthe Jewish homeland.<br />\nSo many thousands of .Jews-- will have those smart dapper kinks if<br />\nespecially those living in Eastern it comes from here where a specialty is<br />\nEurope, said - the speaker, are being made of clothing for college boys<br />\nand young men<br />\neagerly awaiting the first opportunity to emigrate into the land<br />\nPrices, $25.00 to $65.00<br />\nof their national aspirations that<br />\nthe land, misused as it has been<br />\nduring the years of Turkish dominion, will be unable to accommodate them all. Trained, scientific agriculturists are needed inHOWARD AND LEXINGTON STS.<br />\nabundance in order to prepare the<br />\nsoil for large-scale colonization.<br />\nIn addition to this agricultural<br />\nproblem, there is the industrial<br />\nproblem—that of building up sufficient industrie to render Palestine economically self-sufficient.<br />\nMr. Lowenthal devoted considerable attention to the work of the<br />\nZionist Society of Engineers, 29 BALTIMORE ST., EAST<br />\nwhich is completing a scientific<br />\nOne Door West of Light Street<br />\nstudy of the economic needs of the<br />\nfuture population of Palestine.<br />\nThe address made a deep impres- • Sole Agents for Baltimore for College Fraternity Bands (6reek Letter Societies),<br />\nsion upon the forty-odd students<br />\npresent, and served to give many<br />\nARROW COLLARS<br />\nof the new members their first SHIRTS<br />\nglimpse into the actual attainment<br />\nof an ideal which not so long ago<br />\n01, Ctl•<br />\nhad seemed to many to be unatQuality<br />\ntainable.<br />\nThe work of the Hopkins Zionist Society is by this time well<br />\ns Svi<br />\nunder way. Four study circles are<br />\nl• 1 . CV°11eN''.<br />\nI<br />\n,<br />\nIk'\"<br />\nalready in full swing. These in14e°5<br />\nMerchandise<br />\nclude: (1) Elementary Hebrew,<br />\nand (2) advanced modern Hebrew,<br />\nboth given by Dr. Ember, of the<br />\nSemitics Department; (3)a course HATS<br />\nHOSIERY<br />\nin practical Hebrew, under the<br />\nvery able leadership of Mr. William Chomsky ; and (4) a general<br />\ncourse in Zionism.' In the last215 N. CHARLES ST.<br />\nmentioned course the rather novel<br />\nXaltimore's Bes1 Shop For<br />\nidea is being employed of having<br />\nMen's Sox and Ties.<br />\na committee of students lead the<br />\n75 Cents and Up.<br />\ncourse. This committee is composed of Messrs. Chomsky, J. M.<br />\nBerkowitz and M. Levine. All interested students are particularly<br />\ninvited to attend the general<br />\ncourse in Zionism, which is given<br />\non Fridays, at 10.30 A. M., in<br />\n106-108 CLAY ST.<br />\nRoom 117, Gilman Hall.<br />\n<br />\nYOUNG MAN<br />\n<br />\nSTEWART& 0<br />\n<br />\nTHE HATTERIE<br />\nHats of Quality<br />\n<br />\nlte#<br />\n<br />\noi-<br />\n<br />\nc<br />\n<br />\nTHE HOSIERY SHOP<br />\n<br />\nBOOK BINDING<br />\nJoseph Ruzicka<br />\n<br />\nA chin strap of quarter-inch<br />\nblack ribbon is being used for<br />\nholding freshmen caps in the jaunty position prescribed by the<br />\nsophs of Kansas State Agricultural School.<br />\n<br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\nLI( pkins Seals in Silver and<br />\nGold,<br />\nCollege Jewelry or Specially<br />\n<br />\n28 E. BALTIMORE STREL<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16, 1919.<br />\n<br />\nTHE NEWS-LETTER'S MAILBAG<br />\ninto a state of chaos. Stop and<br />\nconsider, is it not true that in the<br />\nworld of business and in the fields A Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulof professional practice one must<br />\n$2.00<br />\nSubscription<br />\nder the Responsibility.<br />\nexercise his own judgment consuccessful,<br />\nbe<br />\nEntered as second-class matter De- stantly in order to<br />\ncember 3, 1909, at the Post Office at and is there any better place to deAll letters intended for publication<br />\nBaltimore, Md., under Act of Congress, velop this faculty than in the colmust be concise.<br />\nNovember 3, 1879.<br />\nNo attention will be paid to anonylege? We are provided with faculmous letters, but names signed as an<br />\nto<br />\nOctober<br />\nfrom<br />\nweekly,<br />\nPublished<br />\nevidence of good faith will not be printed<br />\nty advisers; these would then funcif request is made that they be omitted.<br />\nJune, by the students of Johns Hop- tion in the truest sense of the word,<br />\nThe publication of a letter is not to be<br />\nkins University.<br />\ntaken as an indorsement of its views by<br />\nand not as mere assistants to tile<br />\nNEWS-LETTER, which invites the<br />\nTHE<br />\nbe<br />\nshould<br />\nBusiness communications<br />\nRegistrar, as at present. The minfreest discussion of matters of general<br />\naddressed to the BUSINESS MANAGER,<br />\ninterest.<br />\nJOHNS HOPKINS UNIVERSITY; Cal arti- scrupulous element, which is alcles and other communications should ways with us, is no more restrained<br />\nle sent to the EDITOR-IN-CHIEF.<br />\nunder the present system than in To the Editor of Tin; NEWS-LETTER:<br />\nSir—I noticed •in the columns<br />\nHomewood 100 the proposed one, they cut with imTelephcr_e<br />\nthrough the of your issue of a few weeks ago<br />\nget<br />\nto<br />\ncrib<br />\nand<br />\npunity,<br />\nEditor-in-Chief..<br />\nexaminations, or else flunk most a letter signed N. M. which -goesJohn H. Lewin, '20.<br />\nso far in its advocacy of an \"II\"<br />\ngloriously and graduate by some<br />\nfor<br />\ndramatics as to depreciate the<br />\nManaging Editor.<br />\nunderground manipulation of the<br />\nof debating and journalism.<br />\nvalne<br />\nFrederick F. Torsch, '20.<br />\nwires.<br />\nOne sentence from this letter<br />\nAssociate Editors.<br />\nThe • new plan, in a modified<br />\nreads, \"College debates are, as a<br />\nJames R. Lomauro, '20.<br />\nform, is now in operation on one<br />\nVertrees J. Wyckoff, '20.<br />\nrule, highly beneficial to the partiand<br />\nchemistry,<br />\nin<br />\ncourses<br />\nthe<br />\nof<br />\nMitchell B. Carroll, '20.<br />\nbut decidedly less valuable<br />\ncipant,<br />\nno one can say that the work is not<br />\nCarroll Stansbury, '21.<br />\nand<br />\nentertaining<br />\nto the auditors.\"<br />\nHenry E. Niles, '21.<br />\nanother<br />\ndone as efficiently as in<br />\nthis<br />\nof<br />\nwriter<br />\nThe<br />\nstatement must<br />\nLlewellyn W. Lord, '21.<br />\ncourse, where the regulations are<br />\nbe<br />\none-of<br />\nthose<br />\nwhose<br />\nintellectual<br />\nJunior Editors.<br />\nof the utmost stringency. The<br />\nEdward Huey, '22.<br />\nour humble opin- evolution has not reached that<br />\nin<br />\nis,<br />\nclass<br />\nformer<br />\nH. Douglas Cotton, '22.<br />\nof development which will<br />\nion, one of the best-working groups stage<br />\nBusiness Manager.<br />\npermit him to enjoy or profit by<br />\nreano<br />\nis<br />\nUniversity.<br />\nThere<br />\nin the<br />\nGeorge W. Wagner, '20.<br />\nalthough not amusing,<br />\nson why the honor system should things that,<br />\nCirculation Manager.<br />\nvital<br />\nof<br />\nare<br />\nimportance to anyone<br />\nof<br />\nnot bring us closer to the ideal<br />\nHenry H. Morriss, '20.<br />\nbody of men who takes an hiterest in civic afuniversity—a<br />\ntrue<br />\nthe<br />\nAssistant Business Managers.<br />\nfairs; or can he be one whose abengaged whole-heartedly in the<br />\nVernon E. Stuart, '20.<br />\nsence from the college debates (hisbest<br />\nthe<br />\nfor<br />\nlearning,<br />\nof<br />\npursuit<br />\n'21.<br />\nGeorge Deichman,<br />\nqualifies him entirely front render_<br />\nprogress of mankind.<br />\ning an intelligent opinion or their<br />\nDEC. 16,1919<br />\nBALTIMOR E, MD.,<br />\nvalue to the auditors.<br />\n\"The Admirable Crichton.\"<br />\nAnother sentence, \"The extreme<br />\nAn Extension of-the Honor System.<br />\nTickets are now on sale for<br />\nSonic thud last year there was \"The Admirable Crichton,\" .the conventionality of undergraduate<br />\nPublications is in no way an ina sporadic agitation among the<br />\nplay to be given by the Johns centive for the contribution of.<br />\nstudent body on behalf of the adopHopkins Dramatic Club, at Al- truly literary work.\" This seems<br />\ntion at Hopkins of a system of atbaugh's Theatre.<br />\nto me to be nailer beside the questendance similar to that in vogue,<br />\nplay<br />\nsecond<br />\nthe<br />\nbe<br />\nwill<br />\nThis<br />\ntion. Does the writer mean to inin the great English universities,<br />\ngiven by the inTly founded club, timate that the performance of<br />\nnamely, that attendance at thd<br />\nstudents and friends of last year's dramatic club, as exvarious lectures, recitations and and the<br />\nHopkins are, eagerly awaiting the cellent as it was from the viewlaboratory periods be placed upon<br />\nproduction. The undoubted suc- point of a college play, could realan honor basis. After causing a<br />\nof \"You Never Can Tell\" last ly be considered tow art? Morecess<br />\nthe<br />\nupon<br />\nripples<br />\nfew momentary<br />\nattested by the abundant over, no \"II\" is awarded for jouryear,<br />\nplacid surface of on r undergraducriticism front all nalistic work at -Hopkins, so why<br />\ncomplimentary<br />\nsupineate existence, the issue was<br />\nsides, leads us to expect real en- bring that into the argnment?<br />\nly dropped.<br />\nnight.<br />\nBut let us get back to the real<br />\nSeveral arguments may be ad- tertainment next Monday<br />\nThe play this yqar is one of J. question, namely, why should the<br />\nvanced in fiti'or of this plan. Students are coining to realize that M. Barrie's, aml abounds With the \"I-I\" be awarded in debating and<br />\nreal cleverness. The club not in dramatics? The university<br />\nany neglect of their work during author's<br />\nby Mr. Carol Sachs, has<br />\nassisted<br />\nI\" is trod t lona lly a symbol that<br />\nthe term will lead either to flat<br />\nenthe<br />\nthe<br />\nand<br />\nall<br />\nmade<br />\nscenery<br />\ntlw wearer as one<br />\ndistinguishes<br />\neXaminafailure at the time of the<br />\ntions or to an inordinate cram- thusiastic cast under Miss Walter . who has successfully represented<br />\n-ming just before them, with a con- has spared neither time nor trou- the university in competition with<br />\n, other universities. Under this desequent loss of nearly all of the ble in preparation.<br />\nThe result we feel sure will be finition, which, let ine empliasize,<br />\nknowledge obtained in so short a<br />\ntime. The only-students that win a true exanqde of Hopkins' abil- tradition has estaidished, athletics<br />\nout in the ultimate analysis are ity and spirit, and from the time and debating naturally fall.<br />\nDramatics, Glee Club and such<br />\nthose who have arrived at this con- the curtain rises, every Hopkins<br />\nstudent activities of a more social<br />\nclusion and arrange their work man will feel pride in the play.<br />\nWe say every Hopkins man, be- character fall under an entirely<br />\nsystematically. Under the present<br />\nrules, these men are hampered in cause every student must be in different class. Their members<br />\ngirl should be rewarded by some token<br />\ndoing the work that is most urgent the audience, with his best<br />\nto share his pride.<br />\nfamily<br />\nand<br />\nbut surely not by an award of the<br />\nbeing<br />\nto<br />\nmade<br />\nby<br />\nimportant<br />\nand<br />\n\"II.\" The value of the<br />\nuniversity<br />\nspending<br />\nbesides<br />\nIncidentally,<br />\nspend their time in less important<br />\nis based upon the<br />\nletter<br />\ncollege<br />\nbe<br />\nwill<br />\nhe<br />\nevening,<br />\nenjoyable<br />\nan<br />\nat<br />\nmastered<br />\nbe<br />\nmay<br />\ncourses'that<br />\nassisting in advertising the Hop- fact that it is hard to get. It<br />\nother times with equal facility.<br />\nOf course, it will be said that kins spirit and college life, which represents actual competitiqn with<br />\nstudents will err in their judg- we are developing, and of which other colleges. It means that the<br />\nment, that they will intentionally the efforts of the dramatic club wearer has been selected as the<br />\nabuse their privilege, and that, gives evidence. Moreover, every best man to repuesent the college<br />\nturned loose from all restraints, ticket bought aids materially those in its struggle to overcome strong<br />\nthey will throw both their own efforts and helps to insure their adversaries and in the case of the<br />\ntrack \"H\" it means actual victory<br />\nstores of knowledge and the plans success.<br />\nover an opposing college.<br />\nearly.<br />\ntickets<br />\nyour<br />\nBuy<br />\nprofessors<br />\nof their long-suffering<br />\n<br />\n• JO (1011118AlialSilie1118-10101<br />\n<br />\nI do not want any one to think<br />\nI am trying to down the Dramatic<br />\nClub. Nothing of the kind.<br />\nI appreciate fully the value of<br />\nsuch an organization to Hopkins<br />\nand feel that its organizers are<br />\nto be complimented for their success in establishing the club on the high plane that it occupies.<br />\nOn the other hand, I protest<br />\nagainst any action -that will depreciate the value of the \"H\" by<br />\nmaking it too common. I think<br />\nthe members of the Dramatic Club<br />\nwill agree with me in this stand<br />\nand in agreeing will adopt some<br />\nmore fitting award that will show<br />\non the face of it what it stands<br />\nfor.<br />\nW. M. I).<br />\nThe Charge of The Math Brigade.<br />\n[With apologies to Tennyson.]<br />\nI.<br />\nHalf a day, half a day,<br />\nHalf a day passes<br />\nJust about problems in math<br />\nWrote the six classes.<br />\n\"Forward to math exams!<br />\n'Charge for the pens, my lambs!\"<br />\nJust about problems in math<br />\nWrote the six classes.<br />\n<br />\n\"Forward to math exams!\"<br />\nIs there a man who shams?<br />\nYes, for each student knows<br />\nSlim are his chances.<br />\nTheirs is to make reply,<br />\nTheirs is to reason why;<br />\nTheirs not .to sit and sigh<br />\nJust about problems in math<br />\nWrote the sif cl-sses.<br />\n<br />\nProblems to right of them,<br />\nProblems .to left of them,<br />\nProblems in front of them<br />\nStared in their faces.<br />\nStormed with (I dare not tell),<br />\nBoldly they wrote, and well,<br />\nJust about problems in math,<br />\nTrying examples to quell,.<br />\nWrote the six classes.<br />\n•<br />\n<br />\nIV.<br />\n•<br />\nFlashed each his inky pen,<br />\nFlashed as he wrote and then<br />\nDipped it in ink again.<br />\nThe faculty gazes.<br />\nPlunged in the midst of math,<br />\nRose they to awful wrath.<br />\nProblem and Theorem<br />\nReeled from the inky path,<br />\nSlaughtered in masses.<br />\nSome few had passed, but not<br />\nAll of six classes.<br />\n—Ex.<br />\n<br />\n1\"THE ADMIRABLE CRICHTON\"1<br />\nBy M. BIBULOUS CAROLUS<br />\n<br />\nSome people bemoan<br />\nThat the times are all wrong—<br />\nIt's a penal offense to depart<br />\nFrom conventional pale,<br />\nEven though life be_stale,<br />\nStripped of all romance and art.<br />\nAs the pendulum swings—<br />\n„While Time flaps 'his wings—<br />\n'T will leave these days drab and<br />\nneurotic,<br />\nTo a realm of delight<br />\nFull of laughter and light,<br />\nWhere people dare do the quixotic.<br />\nWe embark on a venture,<br />\nIn a play that was meant sure<br />\nTo revel in fanciful things,<br />\nThough mere puppets we are,<br />\nThe stage is a star<br />\nWith Clementine pulling the strings.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 16, 1919.<br />\n<br />\n5<br />\n<br />\nMAJOR GUILD TO LEAVE HOPKINS<br />\n<br />\nA good guess for<br />\nyou would be—<br />\n<br />\nUniversity Sustains Loss on His Retirement From U. S. Army—Built Model<br />\nR. 0. T. C. Unit Here—His<br />\nFuture Undetermined.<br />\n<br />\nThe Johns Hopkins 1\"niversity<br />\nlifts sustained a loss in the departure of Major George R. Guild, who<br />\nretired from the army Monday,<br />\nDecember 15, 1919. On December<br />\n11 Major Guild addressed for the<br />\nlast time the R. 0. T. C. unit<br />\nwhich he has built up with so<br />\nmuch care and wisdom. The Major will live in Baltimore, but is<br />\notherwise Undecided as to his future. He will be succeeded as professor of military science and tactics by Lieut.-Col. Olin 0. Ellis.<br />\nMajor Guild is a member of the<br />\nhonorary fraternity Omicron Del—There's style<br />\nta Kappa, treasurer of the Johns<br />\nHopkins Orchestra and a member<br />\nto them<br />\nof the Engineering Advisor<br />\nBoard. He is, with Colonel Moss.<br />\nthe author of \"Military Students'<br />\nText-Book\" in four volumes,\"Military Customs and Courtesies,\"<br />\n\"Practical Topography,\" \"R. 0. T.<br />\nC. Students' Military Record,\"<br />\netc., and has served in the PhilipBaltimore, Charles and Fayette<br />\ntimid on the Texas border.<br />\nWhen Majbr Guild first came<br />\nhere in September, 1917, the Johns<br />\n- AMUSEMENTS<br />\nHopkins unit of the R. 0. T. C.<br />\nhad been organized a year under<br />\nLieutenant Elliott. After he had<br />\nbeen here a few weeks, he got<br />\nNights at 8 Shaw—Mats. at 2.<br />\nthe idea. of making this unit a<br />\nMatinees Wed., Thurs. and Sat.<br />\npioneer of its kind in educational<br />\nNew York Winter Garden's<br />\nmilitary work., .The first thing to<br />\nbe done was in the matter of discipline. There was to be, he deWith the Original All-Star Cast<br />\ntermined,<br />\nno forcing—everything<br />\nHeaded by<br />\nunit must be on a volunthe<br />\nabout<br />\nWILLIE AND EUGENE HOWARD,<br />\nROY CUMMINGS, WM.PHILBRICK, tary basis. The Student Council<br />\nauthorized the demerit system<br />\nJOHN BURKE-150 OTHERS,<br />\nIncluding the<br />\nwith punishment tours, as pracFAMOUS WINTER GARDEN CHORUS.<br />\nticed at West Point, and from<br />\nEves., $1 to $3. Mat. Sat., 75c to $2.<br />\nthat time on the unit has been<br />\nMats. Wed. and Thurs., 50c to $1.50.<br />\na great success.<br />\nNext Week—Seats Thursday..<br />\nIn the summer of 1918, Major.<br />\n\"SOME TIME.\"<br />\nGuild was in comand of the<br />\nFirst Battalion, companies A, B,<br />\nand D at the first R. 0. T. C.<br />\nC<br />\nTHE<br />\ncamps at Plattsburg. He returned to the university that fall but<br />\nin the middle of October was callPresents<br />\ned to Philadelphia to become district inspector of the Third Dis\"The Admirable Crichton\"<br />\nBy James M. Barrie<br />\ntrict, Students' Army Training<br />\n_<br />\nCorps.<br />\nALBAUGH'S THEATRE<br />\nAfter the demobilization of the<br />\nMonday, Dec. 22, 1919, 8:15 P.M. S. A.. T. C. a tremendous slump<br />\nwas experienced throughout the<br />\nTickets at Albaugh's after Dec. 15th<br />\n50c to $2.00<br />\ncountry in the wish for military<br />\n<br />\nJarirtu<br />\nikatth<br />\nCutlir,6<br />\n<br />\nTie<br />\n<br />\nflub<br />\n<br />\nAUDITORIUM<br />\n<br />\n\"PASSING SHOW\"<br />\n<br />\nJohns Hopkins Dramatic Club<br />\n<br />\nTHE \"PLYMOUTH\" OVERCOAT<br />\nIn brown and green mixtures; with naval muff pockets<br />\nand tailored lower pockets; extra-large convertible<br />\ncollar.<br />\n<br />\n'0<br />\n<br />\nNECKWEAR<br />\nPROMOTION MANAGER SHIRTS<br />\nA University student with energy and business<br />\nLefrane & Ault<br />\nability to assist in securing boys for Summer Camp.<br />\nExcellent opportunity for wide awake man. Minimum compensation is $500. For information address Director's Office, Lake Placid Camp, 27 Ware<br />\nStreet, Cambridge, Mass.<br />\n<br />\n421 N. Noward St.<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br />\ncourses. Very few, if any, volunteer It. 0. T. C. units could enLuncheon<br />\nroll as many as a hundred men<br />\nAfternoon Tea<br />\nin the spring of 1919. Hopkins<br />\nMUSIC<br />\nwould-have fared as badly as the SODAS AND SUNDAES<br />\nrest had not Major Guild asked<br />\nto be released from his Philadelphia position to return here. With<br />\nhis arrival, however, came the ne1 W. UNIVERSITY PARKWAY<br />\ncessary spirit and enthusiasm to<br />\nOPPOSITE J. H. U. ATHLETIC FIELD<br />\narouse Hopkins men to get the''<br />\nrecord enrollment of 178 men out<br />\nof a possible 235. The War De- Drug Store for J. H. U. Boys<br />\npartment appreciated this work<br />\nPHONE HOMEWOOD 2121<br />\nand there was some talk or having the R. 0. T. C. headquarters<br />\nof the Third District transferred Buy an (H) Pipe made special<br />\nfor the Boys.<br />\nto Hopkins, a move that may yet<br />\nbe acconiplishieti.<br />\nUnder the then existing law<br />\nMajor Guild would have had IT<br />\ngo on the retired list of the Army<br />\nlast summer but fortunately the<br />\nMADE TO ORDER<br />\nlaw was changed in time to make<br />\nthis unnecessary.<br />\n-AND<br />\nIn building the unit the Major's<br />\nwish has always been to develop<br />\nFINISHED CLOTHES •<br />\nofficers—not drillmasters. To this<br />\nmay be attributed the excellent<br />\nPLAZA BUILDING<br />\ncourses given by the military department here. Not so much time 19 AND 21 EAST FAYETTE STREET<br />\nis spent in learning to drill to tinsoldier perfection, but more time<br />\nis devoted to fitting students to be<br />\n0 R T MA N S<br />\nConsequently<br />\ncapable officers.<br />\nmore is accomplished in this unit \"Queen Quality\" Home-Made Candies<br />\n80e. a pound<br />\nthan in any in the United States,<br />\nalthough the actual number of<br />\nVISIT OUR ICE CREAM PARLORS<br />\nworking hours is less here than at<br />\n227 N. HOWARD STREET<br />\nsome other colleges. • Military<br />\nscience has been elevated to the ARTISTIC PHOTOGRAPHS<br />\nranks of a regular college course,<br />\ncarrying seventeen pc-Ants towards<br />\ngraduation and being an elective<br />\n,319 North Charles Street<br />\nfor all the etVgineering courses except the chemical.<br />\nSPECIAL 'DISCOUNT TO J . H.U. STUDENTS<br />\n<br />\nR.G.LOY & COMPANY<br />\n<br />\nLEMMERT<br />\n<br />\nIlgenfritz<br />\n<br />\nROBERT PAUL IULA •<br />\nTHE LAFAYETTE<br />\nCHOCOLATE S1-10P<br />\n<br />\nORCHESTRA DE LUXE<br />\n<br />\nCharles and Lafayette Ave.<br />\n<br />\nTHE ARCADE<br />\nTEA ROO/v1<br />\n324 N. Charles St.<br />\n<br />\nMUSIC fOR DANCES, RECEPTIONS, ETC.<br />\nTELEPHONE. G1LMOR 2929<br />\n<br />\nRESIDENCE, 614 FULTON AVENUE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16, 1919.<br />\n<br />\n6<br />\n<br />\nWolfe To Coach Lacrosse.<br />\n<br />\nTHE TURKISH CIGARETTE<br />\nYou may hunt the<br />\nworld over—but you cannot find a, cigarette to<br />\n. take the place of Murad.<br />\nThe tobacco in Murad is 100% pure<br />\nTurkish—and Turkish is the most<br />\nfamous of all tobaccos for cigarettes.<br />\nIt is true that “ordinary\" cigarettes<br />\ncost a trifle less.<br />\n<br />\n\"Judge for. yourself<br />\n<br />\nmanagement<br />\nThe<br />\nlacrosse<br />\nwishes to announce that, after<br />\nmuch persuasion, Reaney Wolfe<br />\nhas consented to coach the lacrosse 'team for the 1920 season.<br />\nWolfe is well known to all lacrosse \"fans,\" having starred for<br />\nHopkins before graduating a few<br />\nyears ago. He was chosen sometime ago by a committee comprising \"Bill\" Schmeisser, father of<br />\nlacrosse at Hopkins, Ferdie<br />\nMeyer and Norman Keyes, captain<br />\nand manager respectively, of this<br />\nyear's team, but it was feared for<br />\na while that, because of business<br />\nduties, he would be unable fo,<br />\nspare sufficient time. His acceptance will be heartily welcomed by<br />\nall followers of the sport at Hopkins, as it once more assures the<br />\nteam of a first-class coaching<br />\nstaff.<br />\nManager Keyes requests all<br />\nwho expect to go out for the team<br />\nto assemble at 12.30, Wednesday,<br />\nDecember 17, in the Donovan<br />\nRoom. The meeting will be addressed by the different leaders of<br />\nthe sport and probably also by Mr.<br />\nMurphy.<br />\nSwimming Schedule Altered.<br />\n<br />\nMaas#e restGnadathisit<br />\nand Egyptian iMinthe1lbni<br />\n<br />\n•<br />\n<br />\n20<br />\nCENTS<br />\n<br />\nOn account of a conflict with<br />\nthe basket ball team, which • will<br />\nmeet Bucknell on December 19,<br />\nthe meet scheduled by the swimming team for that date with the<br />\nUniversity of Pennsylvania has<br />\nbeen postponed until February 14.<br />\nThe meet set for the latter date<br />\nwith Swarthniore will be .put off<br />\nuntil later in the season. As the<br />\nschedule now stands, the first engagement will be with Lehigh in<br />\nthe B. A. C. tank on January 17.<br />\nIn order that the members of<br />\nthe team may have more individual attention and practice, Captain R. /C. Hall has decided to<br />\nshortly divide the squad into two<br />\nparts, the first comprising the<br />\ndozen or so men whose places on<br />\nthe 'Varsity are regarded as almost certain, and the second being made up of the remaining candidates. If the proper arrangements can be made with the Baltimore Athletic'Club, the first squad<br />\nwill hold practices two afternoons<br />\neach week, while the other will<br />\npractice once a week. In addition<br />\nto this, both will meet together<br />\nwith Coach Ortland on Thursday<br />\nnights.. With such intensified<br />\ntraining, Captain Hall expects to<br />\nhave his team up to top form by<br />\nthe beginning of the regular season...<br />\nMotto Metamorphosis.<br />\n<br />\nMAY SELL LOTS TO CITY COLLEGE<br />\n(Continued front page 2)<br />\n<br />\nhealth and recreation and in order<br />\nto permit the City College to fairly compete with the Polytechnic<br />\nInstitute in athletics and in the<br />\nadvantages offered.<br />\nIf the suggested purchase is<br />\nmade, it might be pointed out that<br />\n<br />\nnothing would be taken from the<br />\nCity's taxable basis, this property<br />\nnot now being assessed. In addition, any money paid to the Johns<br />\nHopkins University will be used<br />\nfor further public improvements<br />\nat Homewood so that the same<br />\nappropriation will work twice for<br />\nthe general benefit of the City.<br />\n<br />\nThe University officials have,<br />\nrecently received inquiries for<br />\nthis block from a theatre syndicate and the indications are that<br />\nit may _be sold before very long.<br />\nIf the City desiFes to provide for<br />\nthe immediate and future of the<br />\nCity College, action should be<br />\ntaken at once.<br />\n<br />\nNineteenth Century—Wine, woman and song.<br />\nTwentieth Century—Near-beer,<br />\nflappers and jazz.<br />\nHe (sadly)—Your refusal •to<br />\nmarry me will mike me a different<br />\nman.<br />\nShe (hopefully) — Well, you<br />\nmight come around and see me<br />\nagain some time.—Ex.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 16, i919.<br />\nMUSICAL CLUBS GUESTS OF TOME<br />\n<br />\nI_I<br />\n<br />\nII Ii<br />\n<br />\n(Continuedfrom page 1)<br />\nwaiian steel guitar solo, \"The<br />\nRosary,\" in a most effective manlier.<br />\nMany interesting incidents occurred during the night after the<br />\nconcert was given. Turpin had to<br />\nsleep on an improvised bed. Two<br />\nbunks were placed alongside of<br />\neach other, and three boys had to<br />\nsleep on them. When the bunks<br />\nwere separated Turpin found himself on an imaginary bed, between<br />\nthe two bunks. Some of the men<br />\nwere not sleepy and they played<br />\ngames in order to while away<br />\nsome time.<br />\nOn Sunday morning, after<br />\nbreakfast was served, the restless<br />\ncrowd of Hopkins men boarded<br />\nthe train. The jazz orchestra<br />\nbegan to perform, when the conTHE<br />\nductor growled, \"you Tome boys<br />\nwill have to behave or I will put<br />\nCollar Hug Clothes<br />\nyou off at Aberdeen.\" Silence preBaltimore and libefyStreets<br />\nvailed for a fraction of a second.<br />\nWhen the conductor learned that<br />\nthe boys were Black and Blue<br />\nmen, he said in a pleasant manner, \"you can play all you-please<br />\nif you do not drown my voice<br />\n\\Olen I call the stations.\" Then<br />\nthe boys gave vent to their musicFor nfen Who<br />\nal feelings.<br />\n\"Chink<br />\nThe musical clubs will give a<br />\nconcert at Gilman Country school<br />\non January 10, and at the Brantley Baptist Church on January 16.<br />\nThe concerts at Friend's School,<br />\n8 E. Baltimore St.<br />\nGoucher College, Hood's College,<br />\nand at the Church of Our Savior<br />\nwill take place sonic time after<br />\nthe examinations are over. The<br />\n\"McCoy Hall\" concert will be<br />\npresented in spring, and most<br />\nStationers Engravers Printers<br />\nlikely at Lehman's Hall.<br />\nFountain<br />\nPens I. P. Note Books<br />\nThe positions of the various<br />\nmembers of the musical clubs are 229 Park Avenue - Baltimore<br />\nnow settled, and are as follows:<br />\n<br />\n1:11141111111111talinil<br />\n<br />\nDEG US PAT Orr<br />\n<br />\nTHE BEVERAGE<br />\n<br />\nFellowship—in college or<br />\nout of it—flourishes best<br />\nwith good food and wholesome drink. Ice-cold<br />\nBevo—unexcelled among<br />\nbeverages in purity and<br />\nhealthfulness—is most<br />\nsatisfying as a drink by<br />\nitself or a relish with<br />\nfood that makes a hap.<br />\npier repast.<br />\n<br />\nUALITY SHOP<br />\n<br />\nHESS SHOES<br />\n<br />\nANHEUSER-BUSCH,ST.LOUIS<br />\n<br />\nN. HESS' SONS<br />\n<br />\nIt must be<br />\nIce eold<br />\n<br />\nFRESHMEN DEFEAT SOPHOMORES<br />\n<br />\nJ. H.SAUMENIG & CO.<br />\n<br />\nSeniors Elect Baker to Student Council<br />\nand Adopt Canes.<br />\n<br />\n(Continued from page i)<br />\ned and the freshies were unable<br />\nto advance the leather the necessary eight yards.<br />\n. The line-up:<br />\n<br />\nAt a meeting of the Senior<br />\nClass last Tuesday, Eli Baker was<br />\nelected to the Student Council, to<br />\nfill the one vacancy still existing.<br />\nA spirited discussion took place<br />\nSophomores. on the question of wearing a disFortney<br />\ntinctive class mark after Easter.<br />\nBarrett<br />\n......Schas It was decided that a special deSchmidt sign of canes would be adopted,<br />\nMoore<br />\nand a committee was appointed to<br />\nReid<br />\narrange for them. Another was<br />\n.Engle<br />\nchosen to look into the matter of<br />\nOwings<br />\nTome adopting a (list inctive Senior cap,<br />\nWood (c) as is worn at several of the northMarkell ern colleges.<br />\n<br />\nFreshmen.<br />\nPos.<br />\nMiddleton<br />\nL. E<br />\nButler<br />\nL. T.<br />\nRones.<br />\nL. G.<br />\nCromwell<br />\nC.<br />\nLandy (c.)<br />\nR. G.<br />\nWilliams<br />\nR. T.<br />\nElgert<br />\nR. E<br />\nKelly<br />\nQ. B.<br />\nBarchet<br />\nL. H.<br />\nDodson<br />\nR. H<br />\nBaughman.<br />\nF B.<br />\nFreshmen<br />\n0 6 0 0-6<br />\nSophomores ..<br />\n0 0 0 0-0<br />\nSubstitutions—Freshmen: CulliMore<br />\nfor Elgert; Sophomores: Wigton for<br />\nWood, Wood for Wigton, Holmes for<br />\nFortney, Fortney for Holmes, Holmes<br />\nfor Engle, Nicodemus for Moore. Referee—Jones. Umpire—Hoffman. Head<br />\nLinesman—Welliver.<br />\nTouchdown —<br />\nDodson. Time of Periods-10 minutes.<br />\n<br />\nMANDOLIN CLUB.<br />\nLeader—Douglas Coulter.<br />\nFirst Mandolins—H. C. Davis, J..L.<br />\nRank, J. R. Lomauro, C. A. Rankin, J.<br />\nD. Virdin, A. L. Bolton, C. S. Collins,<br />\nM. W. Kessler.<br />\nSecond Mandolins—T. F. Hubbard,<br />\n.T. A. Weinberg, L. F. Buxby, A. H.<br />\nBurnham, Jr., M. E. Scheidt, H. Seitz.<br />\nGuitars—R. W. Hambleton, J. H.<br />\nRiggs, R. F. Passano, H. Holsopple, B.<br />\nKuder, J. Lewis.<br />\nFirst Violins—C. A. Rankin, G.Myers,<br />\nBanjo-Ukulele—P. R. Wiggins, L.<br />\nMcA. Cattanach.<br />\nGLEE CLUB:<br />\nDirector—Harry Hartman.<br />\nFirst Tenors — G. Cattanach, C. A.<br />\nRankin, Fairballks, Prince.<br />\nFirst Basses—J. L. Rank, J. R. Lomauro, Defandorf„Parsons, MacDonald,<br />\nL. Cattanach, Spieler, Turpin, Burnham, Singewald.<br />\nSecond Tenors —J. D. Virdin, F.<br />\nTorsch, Langluttig, Price, L. Henck,<br />\nKauffman,`H. C. Davis, Kuder.<br />\nSecond Bas se s— Lewis, Gressitt,<br />\nWeaver, Kelley, Leonard, Emlet, gerliken, T. Hubbard, Buchner.<br />\n<br />\nLunches, Cigars,<br />\nCigarettes, Candy,<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br />\n<br />\nE. E. ADAMS<br />\nThe Chas. Wilms Surgical Instrument Co.<br />\n300 N. Howard<br />\nSt„ Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nHospital, Invalid and Microscopic<br />\nSupplies.<br />\nORTHOPEDIC APPLIANCES.<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards—Invitations<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER — PRINTER —STATIONER<br />\n229 N. Charles Street<br />\n<br />\nCollars—Dozens of Styles—and Other Furnishings<br />\nTHE STORE<br />\nFOR MEN<br />\n<br />\nHUTZLER BitirliElt<br />\n<br />\nHoward Street<br />\nNear Saratoga<br />\n<br />\n\fTHE-JOHNS HOPKINS NEWS-LETTER, DECEMBER 16, 1919.<br />\n<br />\nS<br />\nPLAY GETS FINISHING TOUCHES<br />\n<br />\nFUND FAR FROM COMPLETED<br />\n<br />\nDramatic Club and Cast are Speeding<br />\nUp Preparations for Presentation<br />\n\"The Admirable Crichton\" at<br />\nAlbaugh's Dec. 22nd.<br />\n<br />\nProspects Dark for Dormitory—Pledges<br />\nCome in Slowly—Amount Not<br />\nHalf Subscribed.<br />\n<br />\nOn Monday, December 22, the<br />\nJohns Hopkins Dramatic Club<br />\nwill give its first performance this<br />\nseason, .T. M. Barrie's well-known<br />\nplay \"The Admirable Crichton.\"<br />\nThe play will be given at Albaugh's Theatre and the seats are<br />\nnow on sale at Albaugh's ticket<br />\noffice. Realizing that only a few<br />\n(lays are left in which to complete<br />\npreparations, everyone connected<br />\nwith the club has redoubled his<br />\nefforts to make this year's presentation even more successful than<br />\nlast year's.<br />\nRehearsals are now being held<br />\ndaily and under the careful guidance of, their coach, Miss Clementine Walter; members of the cast<br />\nare putting the finishing touches<br />\non the work which they began<br />\nsoon after the opening of college.<br />\nTo the feminine characters the<br />\nchoice of costumes is a matter of<br />\nthe greatest importance. Every<br />\ndebutante in town has been consulted concerning the most approved styles in feminine attire,<br />\nand many have been shocked<br />\nwhen some one of the young actors lets slip a question as to what<br />\ncolor; garters should be worn with<br />\nan evening dress or where to buy<br />\nsilk stockings. Even the masculine characters are not totally exempt from the clothing question<br />\nand proprietors of certain hock<br />\nshops are surprised by the unusual demand for full dress suits.<br />\nThe property man, too, has his<br />\nhands full. In one corner of the<br />\ndramatic club's room in the Barn<br />\nthere is already piled a heterogeneous collection of life preservers,<br />\nchina ware, chairs, lanterns, and<br />\nmany other things that arouse the<br />\ncuriosity of one who has not seen<br />\nthe play. Mr. Carol Sachs, formerly an instructor at the Maryland Institute, has made a room<br />\nin Gilman hall his studio and<br />\nthere, aided by a corps of assistants, he is rapidly finishing the<br />\nwork of painting the scenery.<br />\nUnder his skilful direction des-<br />\n<br />\nogo.ogoqogogai-fogogogogogoRogogo.ogogo:zogogolio.--:0,-zol_fpgog<br />\nYou can't see a Show by reading the Program<br />\nNeither can you tell the quality of our garments<br />\nby reading this ad. Let us show you!<br />\n<br />\nThe dormitory fund is less than<br />\n$32 and up<br />\nhalf subscribed. The campaign<br />\ncommittee has received donations<br />\nand pledges to the amount of only<br />\nClothes of Custom Quality<br />\n$109,000. This -leaves $191,000<br />\n- 14 N. CHARLES ST.<br />\nstill to be raised. Pledges are still<br />\ncoming in, but it is felt that Hop- ONOROTeugofluifo-F:0-ifoit-0:<br />\nOPtOrt.Ore<br />\n-fo:<br />\n-TontafforicYY:0L700A0A011):0::0ff0<br />\nkins Alumni and students must<br />\nCOME TO<br />\nbestir themselves if the opening<br />\n.of the 1920-21 term is to find a<br />\ndormitory here. The restjlts of<br />\nST. PAUL ST. AND NORTH AVE.<br />\nthe drive thus far seem to indicate<br />\n(Cars pass in front of door)<br />\nthat a spirit of \"let George do it\"<br />\nRev. David Carson Bayless<br />\nCORDIAL WE<br />\nServices. 11 A. M. and 8 P. M.<br />\nhas 'prevailed. Most of the men<br />\nMinister<br />\nTO ALL STUDENTS<br />\nMen's Bible Class. 9.45 A. M<br />\nUniversity<br />\nthe<br />\nwith<br />\nassociated<br />\nhave contributed, but not on the<br />\nThe Men of Johns Hopkins University Are Most Cordially Invited to Attend the Servicrs<br />\nbasis of \"all that I can afford.\"<br />\nPeter .5 Episrnpat Thurril<br />\n(6rarp<br />\nThe committee has been _divided<br />\nMONUMENT ST. AND PARK AVE.<br />\ninto two groups. One of these<br />\n•<br />\ngroups is assigned to the duty of<br />\n41 The services on Sunday are at II o'clock and 8 o'clock. Seats will be reserved for Johns<br />\n'<br />\nHopkins men up to the hour of service. We want to have the privilege of having you assocanvassing all of the Alumni in<br />\nciated with us in our worship, and we hope that the benefit may be reciprocal.<br />\nthe city; while the other will<br />\nwrite personal letters to those<br />\nJunior Athletics.<br />\nwho do not live here. It is hoped<br />\nIt has been found necessary to<br />\nthat in this way, the spirit that<br />\n(THE BOOK MART)<br />\nwas manifested at the beginning discontinue outdoor basket ball<br />\non account of the cold weather.<br />\nof the drive may be regained.<br />\nThe freshman teams will continue<br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nto meet inside, but the upper-classAND COLLEGE REQUISITES<br />\nLatgot<br />\nflowers<br />\nLady—Have all<br />\nmen will be switched over to the<br />\nin names?<br />\nIMPORTERS AND DEALERS IN<br />\nsoccer squads or the setting - up<br />\nFlorist—Yes, madam.<br />\nFINE BOOKS<br />\nsquads.<br />\nLady—Even the common ones?<br />\ncandidates<br />\nof<br />\nnumber<br />\nA large<br />\nFlorist—Yes, madam.<br />\nfor soccer have already appeared 301 N. CHARLES STREET<br />\nLady—Isn't nature wonderful!<br />\nand two teams, have been organBaltimore, Md.<br />\nized. B. R. Smith is captain and<br />\nP. R. \"Nickerson assistant captain<br />\nerts and parlor walls are pro- of the first team, while D. E.<br />\nSchuchts, aided by J. F. Strott,<br />\n,<br />\nduced with equal facility.<br />\nThere is every indication that will lead the second.<br />\nMore teams will be organized in<br />\nthe play next Monday will be a<br />\ngreat success, and those interest- the future as the nuinber of caned in the dramatic club have ex- didates is constantly 'increasing<br />\nYou're Interested In<br />\npressed the hope that a large and.a schedule of contests between<br />\nEvery<br />\nStudent Should Own<br />\nnumber of Hopkins students will these teams will soon be arranged.<br />\nattend. Members of the club are A. team to. represent the juniors<br />\nSend Your Name for Monthly List<br />\nselling cards for one dollar a piece will be selected from all these<br />\nleading<br />\nplay<br />\nthe<br />\nwill<br />\nand<br />\nteams<br />\nwhich will be credited as that<br />\nCharles Street, at Mulberry<br />\namount toward a reserve seat \"prep\" schools in the vicinity.<br />\nwhen presented at Albaugh's<br />\nThe Height of Nerve.<br />\nticket office or the theatre. As<br />\nA fellow trying to flirt with a<br />\nthe club desires to have some<br />\n23 E. HANOVER ST.<br />\nmoney on hand it is desirable to girl on a street car, when she is •<br />\nBALTIMORE, MD.<br />\npurchase these cards as soon as hanging onto a strap and he ocPrinters of Philological and<br />\npossible and exchange them .for cupies the seat directly in front<br />\nof her.—Er.<br />\nScientific Works<br />\nseats whenever convenient.<br />\n<br />\nNorilimitwirr tiregligtrriatt Thurril<br />\n<br />\nThe Medical Standard Book Go.<br />\n<br />\nThe<br />\nNorman Remington Co,<br />\n<br />\nBOOKS<br />\n<br />\nJ. H. FURST CO<br />\n<br />\n111<br />\n<br />\nt-7/SS WALTER<br />\n4CCOMP/1/1/11:5 THC RFfiRS/11_ BY /1CT/N6<br />\nP/IRT IN OU/\"18-SHOW.<br />\nHERE, HER LIPS B/?E WI-/IS TL /A/6 TO ACCOMPnNY L/1,0Y/7/1/0'<br />\n<br />\nAT fi fifNC fi'SRL<br />\nOf Tiff<br />\n<br />\nDRAI'lliTIC<br />\n<br />\n(Loa<br />\n<br />\nHER 11/INDS /IRE FRCP/IR/NG<br />\nSt/PPE/f MTN L. ABY /10/7T/111,<br />\nONE FOOT.<br />\nST/IMP/NO\" /N<br />\nSYMP/5 THY'7. k vVI TH TWEE/1/)'<br />\n/WO THE<br />\nOTHER /S STI187'<br />\n<br />\nIA/G TO<br />\nINITH<br />\n<br />\n1/1/1ILK OFF<br />\nER NCS<br />\n<br />\n1/ARRr MORRISS<br />\n.5711UL4T/N6<br />\nCI! 7:<br />\nT/6<br />\nLADYC477/1/f/NE<br />\nW/71/ /9 17NZ:<br />\nST/F/N6 Or<br />\nF/SN.<br />\n<br />\nam/ix /IT<br />\n<br />\nTHE(AO<br />\n71/E.<br />\n01-ACTSI<br />\n0/41PLIf Lt-13E•R PULL/N6<br />\n4/1/ /1146/414RY LEI/ER TO /6N/TE4/07SSIMILD BE/ICON fiNg S/6/11AL<br />\n- C7701L SNIP<br />\nA' NrP077/<br />\n<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America. \"Johns Hopkins University Circulars,\"\"Modern Language Notes,\" -Maryland Historical Magazine,\" 'University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\n)frat ter. Special attention given to the<br />\niniltairach,a<br />\nspirm<br />\n<br />\nDOCTORS' DISSERTATIONS<br />\nin Greek, Latin, Anglo-Saxon. Old English, and<br />\nRomance and Germanic Languages<br />\n<br />\nWyman's<br />\n<br />\nThe Largest &<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\n<br />\nMen's<br />\n<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br />\n<br />\nShoes<br />\n19 Lexington St.<br />\n<br />\nSole Agent for<br />\nthe Johnston &<br />\nMurphy Shoes.<br />\n<br />\n\f", "format": "basic_html", "processed": "3TIEIS musrizrimn<br />\nVOL. XXIV, NO. 10.<br /><br />\nBALTIMORE, 'MD., DECEMBER 16, 1919.<br /><br />\nPRICE, FIVE CENTS<br /><br />\nENTERTAINED BY MR. THURSTON MUSICAL CLUBS GUESTS OF TOME PUBLIC. INVITED TO INITIATION FRESHMEN DEFEAT EOPHOMORES<br />\nMagician Gives Clever Talk at Big<br />\nMass-meeting—Many Announcements Made.<br /><br />\nTrip to Port Deposit Full of Amusing<br />\nIncidents— Will Play at Gilman's,<br />\nJanuary the 10th.<br /><br />\nOmicron Delta Kappa Will Hold Public<br />\n• Ceremony in C. E. Hall, Wednesday the 17th at 12.20 O'clock.<br /><br />\nDodson Makes 60-Yard Run for Touchdown—Lack of Practice Tells<br />\nAgainst Sophomores.<br /><br />\nAt the mass-meeting held FriThe student body of the. UniThe freshman football team<br />\nIn spite of .an evening of mist,<br />\nday in the C. E. Hall, Bartus rain, and mud, 47 members of versity .has been invited to attend turned the trick<br />\non the heavier<br />\nTrew made several announcements the Johns Hopkins combined mus- the public preliminary initiation and more<br />\nexperienced sophomores<br />\nconcerning the play to be given by ical clubs arrived at 5.30 P. M. of its new members into the Omilast Saturday, winning to the<br />\nthe dramatic club on Monday, the last Saturday, at the foot of a cron Delta Kappa fraternity to<br />\ntune of 6-0. The sophs showed<br />\ntwenty-second.<br />\n.high bluff at the top of which the be held -December 17, 1919, in the a<br />\nmarked lack of teamwork and<br />\nFerdinand :Meyer, captain of la- 'Tome Institute is situated. The Civil Engineering Building, at<br />\npunch,<br />\nnever once being able to<br />\ncrosse, said that fall lacrosse prac- absence of Professor Swartz was 12.20 o'clock. A talk will be given<br />\ntice would soon be called off and felt, for the boys were not accus- by one of the alumni members of earn a first down, whih: the Freshthe equipment must be handed in tomed to sealing bluffs. • It was the fraternity, probably the Dean ies tore off eight. The freshmen<br />\nin the near future. He also called pitch dark, and it was a great or Dr: French. Immediately fol- line, of which only four were first<br />\nattention to the excellent schedule relief when the boys eventually lowing .the public initiation the string men, played with wonderwhich has been promised and to reached the summit. after groping members and initiates will pro- ful teamwork, stopping the<br />\nheavy<br />\nthe good news that Ream, Wolfe their way up a Series Or steps all(I ceed to the Hopkins. Club for the sophomore<br />\nbacks at the line of<br />\nprivate initiation and after which•<br />\nhad consented to coach the team<br />\nIld(1y<br />\nscrimmage repeatedly.<br />\nagain this year.<br />\nThe hearty dinner was most wel- a dinner will be given.<br />\nCromwell and Landy played<br />\nTeddy Burger announced that come to the tired inoiltain climbThe Omicron Delta Kappa frathe public initiation of the Omi- ers, and soon all glooay thoughts ternity was founded 114 1914 at hard slashing football on the line,<br />\ncron Delta Kappa fnt I ernity of mud and -rain were dispelled Washington and Lee University while Middleton nabbed the runwould be held in the Civil Engi- by the cordial welcome the Hop- and the Hopkins chapter establish- ner time after time when the<br />\nneerino. Lecture Hall, at 12.20, to kins men received from 1). Mur- ed in 191(L Thus the fraternity is sophs attempted to encircle his<br />\nbe followed by the private initia- ray P. Brush, our former deny, comparatively a new thing and end. Kelly, the young freshman<br />\ntion and dinner at the Hopkins and from Tome. There were ac- will probably mean .more in the quarterback, who was not out for<br />\nClub. He then introduced Mr. comodations for only tvnty-live future than a ny other organiza- the 'Varsity this season, outgenerThurston, the great magician.<br />\n.verity. ..Itk aims aled the upperclassmen at all<br />\nmen, and at first it was d ci ed tion at the,l'Ai<br />\nMr. Thurston, after telling the that the freshmen would tittAw<br />\nare to fndher -The inieWts of times.<br />\nassembly that he had come out Baltimore on the one o'clock train' Hopkins • in every way, help up- - The sophs showed throughout<br />\nsimply for the pleasure of seeing from Perryville. They were re- hold old traditions and originate the fracas lack of practice and<br />\noverconfidence. In the rush betheir handsome faces, explained lieved to learn that room for them and support new ideas.<br />\nhow he had happened to become would be provided.<br />\nThe fraternity is an honorary tween the halves several of the '22a magician. It seems that at the<br />\nThe concert was a complete suc- one and to be a member of Omi- gridders took part, instead of takage of seven lie had had the pleas- cess. The Tome boys turned out cron Delta Kappa means that a ing a much needed rest, which unure to see Herman, at that time in a body, and the remaining,seats man has received one of the great- doubtedly was to be counted in<br />\nthe greatest magician_ in the in the large chapel were occupied est honors, in college as only the their failure to advance the ball in<br />\nworld, perform, and had imme- by visitors. Both the elder people few men. who are the very best in the second half, as they had both<br />\ndiately decided to become a ma- and the students were highly the five branches of scholarship, weight and experience on the<br />\ngician. Years later, however, he plased with the concert, as was athletics, literary activities; pub- youngsters.<br />\nfound himself at Northfield study- evidenced by the continuous ap- lications, and social leadership<br />\nAlthough there were several<br />\ning for the ministry. After four plause' and the large number of are admitted.<br />\nfumbles, there were not nearly as<br />\nyears here he completed all plans encores to the special numbers.<br />\nThe 'national convention of the many as might have been expected<br />\nto go to University of Pennsyl- It was \"the best entertainment fraternity will be held, here prob- for the slipperiness of the field<br />\nvania for a course in medicine. Tome has heard for more than a ably some time soon after Christ- and the heavy, wet ball.<br />\nHe was to be given this course on year,\" as one of the Tome seniors mas.* The officers of this chapter<br />\nIntercepted forward passes on<br />\ncondition that he become a med- remarked.<br />\nare at present, Bobby Hoffman, the part of Dodson and Barchet<br />\nical missionary in China upon<br />\nAn unusually big program was president; Charlie Leber, vice- played an important part in the<br />\ngraduation.<br />\npresented. The main new feature president, and Terry Burger, sec— game, as the single touchdown<br />\nOn the way to Philadelphia he. in it was the original Egyptian retary.<br />\nwas scored in this manner. Dodstopped off in New York and there dance by Princess Kumalae, who<br />\nson ran in and intercepted a short<br />\nagain saw a performance by Her- is an unrivalled expert direct was overflowing with songs and forward pass, catching it like a<br />\nman. The next morning when he from the Orient, where her fame jokes. His buck-dancing -made baseball, and tore through the '22<br />\nwent to the station whom should as a, professional -anaesthetic\" a hit\" at Tome. While dancing line for a 1.1111 of 60 yards and a<br />\nlie see but Herman walking up dancer sprearl so rapidly that she he remarked, \"I shake my should- score. Half the soph team was<br />\nand ,down. By some mistake, or was invoked to giVe a demonstra- ers and I shake my knees. This so dumfounded that they stood up<br />\nthe intervention of fate he was tion before the future Hopkins is a free country, and I'll shake and watched him go past, while<br />\ngiven a ticket to Syracuse, the des- students. Her beautiful costume what I pleaw!\" and then proved the rest threw themselves at the<br />\ntination of - Herman, instead of was even- more-sensational than it by his remarkable dancing.<br />\nrunner, but Dodson's stiff-arm was<br />\nThe jazz orchestra, consisting working well, and excellent dodgPhiladelphia. When asked whether any that Cleopatra ever wore.<br />\nhe,wished to exchange it he said, Princess Kumalae, alias Holmes of Messrs. Bowers, Coulter, Meyers ing on the slippery field enabled<br />\n\"No, I'll go to Syracuse.\"<br />\nBoyd, was forced to perform in and Rankin proved most popular. him to elude all the tacklers..<br />\nThus, purely by chance, he was artificial moonlight, since it was Ralph Bowers, the pianist, also Barchet failed at a try for goal.<br />\nstarted on the way toward becom- rainy weather, and the moon did played a,piano solo, \"The Vamp.\" Toward the end of the fourth<br />\ning the world's greatest magician. not appear. This, at least, afford- The applause was so great that quarter Barchet intercepted a forHe had many long years of work ed ample' opportunity for the they had to give several encores. ward pass on his 35-yard mark,<br />\nand hard luck before him and it Tome boys to use their imaginaThe Hawaiian strino. trio, and bid fair to repeat Dodson's<br />\nwas only by perseverance that he tions.<br />\nMessrs. Coulter, Riggs and<br />\n6 Ham- spectacular run. However, John<br />\nsucceeded.<br />\nMr. Pegram, as Buck, the Bell-. bleton, was greeted with repeated Markwell overtook him on the<br />\nHere Mr. Thurston was warned boy, gave a very witty monologue bursts of applause. \"Doug\" Coul- soph's eight-yard line, after a run<br />\nthat his time was nearly up so he and explained to the audience how ter played \"Spring Song\" on his of 57 yards, thus preventing a<br />\ncalh4 for a volunteer to help him he became his own grandfather. ukulele. Hambleton gave the Ha- second touchdown, as '22 tightenBuck was a handsome negro and<br />\n(Continued on page 3, col. 2)<br />\n- (Continued on page 7, col. 3)<br />\n(Continued on pace 7, col. I)<br /><br />\n111•111111M<br />\n•<br />\n•<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16,1919.<br /><br />\n2<br /><br />\nMAY SELL LOTS TO CITY COLLEGE<br />\nSites of McCoy and Levering Halls for<br />\nSale—Would Make Natural Outlet<br />\nfor B. C. C. Expansion.<br /><br />\nOU'LL smoke a WDC more than an ordinary pipe,<br />\nbecause it's. a sweet, mellow smoke. Follow the old<br />\npipe connoisseurs and have three, four, or more W D C Pipes<br />\non your rack. Smoke a cool one every time. Then you'll<br />\nknow what a real smoke is. Any good dealer will furnish<br />\nyou with several select shapes.<br /><br />\ny<br /><br />\n-<br /><br />\nWm. DEMUTH 8t CO:. NEW<br />\nWORLD'S<br /><br />\nLARGEST<br /><br />\nYORK<br /><br />\nMAKERS—.00e FINE<br /><br />\nikrairrirk<br /><br />\nPIPES<br /><br />\n'Kipp To.<br /><br />\nMANUFACTURERS OF<br /><br />\nHIGH GRADE CHOCOLATES.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot .be underquoted by any house at any time.<br />\nBesides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br /><br />\nJohn C. Knipp &amp; Sons<br />\nDRAPERIES<br /><br />\nDECORATIONS<br /><br />\nFURNITURE<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nATTENTION! J. H.U.STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br /><br />\nPRINTERS<br /><br />\nPUBLISHERS<br /><br />\nMEY,F,FALTIEIMER<br />\nThe Big Stationery Store<br />\n1 0- 1 2 N. HOWARD STREET<br /><br />\nBALTIMORE<br /><br />\nThe sites of McCoy Hall and<br />\nLevering Hall will soon be sold<br />\nat private sale to the highest bidder. This is an extraordinary opportunity for the Baltimore City<br />\nCollege to expand.<br />\nThe entire block adjoining the<br />\nCity College on the north between<br />\nHoward, Eutaw and Druid Hill<br />\navenue, is now available for the<br />\nuse of the City College if the City<br />\nwill consider taking it over from<br />\nthe Johns Hopkins University.<br />\nNo money would be required ne:<br />\ncessarily, since the University<br />\nwould probably be willing to take<br />\nCity Stock in payment; or, if the<br />\nCity desires to purchase the property out of the general budget,<br />\nthe University would probably accept one-fourth the exact amount<br />\nper year for a period of four<br />\nyears, meanwhile, occupying without rent the Chemical Laboratory<br />\nand Biological Laboratory. The<br />\nCity College, each year in the last<br />\nfour, has practically required an<br />\nadditional floor in the old Main<br />\nBuilding located in the block 'offered and is now occupying the<br />\nentire building as an Annex. This<br />\ngrowth will continue, as surely as<br />\nthe City is growing, and should<br />\nnow be provided for. Men of vision who urge taking over this<br />\nProperty before it is sold elsewhere will unquestionably do the<br />\nCity College and the City a genuine service.<br />\nIf this block is acquired by the<br />\nCity, the building there will serve<br />\nthe immediate needs of the City<br />\nCollege and in the future the<br />\nappearance and utility of the City<br />\nCollege may be substantially added to. In the first place, the<br />\n-architect who planned the City<br />\nCollege Building, evidently expected the buildings in front of it<br />\nto be razed or the street to be cut<br />\nthrough and, with that expectation in view, he put the entrance<br />\naround in what is now an alley.<br />\nThis situation can be appreciated,<br />\nespecially if one stands in front<br />\nof the main entrance of the City<br />\nCollege and looks at the building<br />\nfrom :that point of view. If this<br />\nsituation is gtraiglitened out, it<br />\nwill add tremendously to the value<br />\nof the College as a public building.<br />\nThis block, in addition to affording an open space in front of<br />\nthe City College, would also provide ample room for a Cage and<br />\nAnnex over near the Eutaw street<br />\nside while the space immediately<br />\nin front of the City College can be<br />\nused for a track and recreation<br />\nground, such as has been provided<br />\nfor the Polytechnic Institute, on<br />\nthe west side of Calvert street opposite its Main Building. Students of the College should have<br />\nthis, both from the standpoint of<br />\n(Continued on page 6, col. I)<br /><br />\nJohns Hopkins Press<br />\nI.—American Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nVolume XLI in progress. $6 per volume. (Foreign postage 50 cts.)<br />\nII.—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER. Editors. Quarterly. 8vo.<br />\nVolume XL in progress. $5 per volume. (Foreign postage 50 cts.)<br />\nIII.—Johns Hopkins University Studies in<br />\nHistorical and Political Science.<br />\n8vo. Series XXXVII in progress.<br />\n$3.50 per volume.<br />\nIV.—Johns Hopkins University Circular<br />\nIncluding Annual Report. Register,<br />\netc. 8vo. Volume XXXVIII in progress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXX in<br />\nprogress. $3 per year. (Foreign postage 50 cts.)<br />\nVI.—Johns Hopkins Hospital Reports.<br />\n4to. Volume XIX in progress. $5<br />\nper volume. (Foreign postage 50 cts.)<br />\nVII.—Contributions to Assyriology and<br />\nSemitic Philology.<br />\n(Beitrage zur Assyriologie, etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITSCH, Editors. Volume X in<br />\nprogress.<br />\nVIII.—Modern- Language Notes.<br />\nJ. W. BRIGHT, Editor in Chief;<br />\nG. GRUENBAUM, W. KURRELMEYER and •H. C. LANCASTER.<br />\nMonthly. 4to. Volume XXXIV in<br />\nprogress. $3 per volume. (Foreign<br />\npostage 50 cts.)<br />\n1X.—American Journal of Insanity.<br />\nVolume LXXVI in progress. Quarterly. 8vo. $5 per volume. (Foreign<br />\npostage 50 cts.)<br />\nX.—Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n81<br />\n,<br />\n0. Volume XXIV in progress. $3<br />\nper volume. k Foreign postage 25 cts.)<br />\nXL—Reprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. Fourth<br />\n.Series in progress, $2.<br />\nXII.—Hesperia.<br />\nHERMANN COLLITZ, HENRY<br />\nWOOD and JAMES W. BRIGHT, Editors. Fourteen numbers have appeared.<br />\nMonograph in the Romance<br />\nLanguages and Literatures.<br />\nEDWARD C. ARMSTRONG, Editor.<br />\n8vo. Six numbers have appeared.<br />\nXIV. -RepOrts of the Maryland Geological Survey.<br />\nE. B. MATHEWS, Editor.<br />\nXV.—Johns Hopkins University Studies in Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nA full list of publications wilt be<br />\nsent on application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD.<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16, 1919.<br />\nFaculty Notes.<br /><br />\nQUACKS FROM A QUACK<br /><br />\n11<br /><br />\nDr. Jos. T. Singewald, Jr.,* has<br />\nbeen granted A leave of absence<br />\nin order to carry on further geological investigations • in South<br />\nAmerica. He will sail from New<br />\nOrleans on December 17. . .<br />\nThe field of work will be in<br />\nnorthwestern Peru, and will consist primarily in an investigation<br />\nof the oil districts of that region,<br />\nand of the possibility of their extension. Although the work is<br />\nbeing done for one of the large<br />\noil companies, it will afford an<br />\nopportunity to extend the geologic<br />\ninvestigations of the recent Williams Memorial Expedition.<br />\nThe Williams Expedition was<br />\nprevented from entering this region on account of yellow fever<br />\nand the bubonic plague at the<br />\nport of entry'at Paita, Peru; hence<br />\nDr. Singewald was unable to secure the geologic data on that<br />\nregion. This work is expected to<br />\nyield additional material for the<br />\ncollection of the Department of<br />\nGeology covering South America<br />\nand to form the basis of further<br />\ngeologic and paleontologic researches by members of the department.<br /><br />\nJust between you and me and<br />\nthe post-office I want to tell you<br />\nall about the compliment that<br />\nthe editors handed out to me the<br />\nOther day. They • said, \"George,<br />\nYou've got a pretty good line but<br />\nit hasn't any clothes on it.\" '<br />\nNow<br />\nhow would you interpret them<br />\nwords?<br />\nI want to get down on my bended knees and apologize for a very<br />\ngrievous mistake in spelling which<br />\noccurred in a recent issue. The<br />\nname of the widely heralded and<br />\nWorld.famous cbemist, the man<br />\nWho has done so much to benefit<br />\nscience by his untiring and exhaustive research work, the man<br />\nwhose -inventive genius is the<br />\nwonder of the age, the man whose<br />\nPatents are the pride of the nation and whose inventions are in<br />\nevery kitchen, this man, I say,<br />\nspells his name capital Gwyn.<br />\nOf course I realize that I could<br />\nlay the blame on the type-setter,<br />\nbut I'm not that kind of a fellow.<br />\nThe unpardonable error was purely and-solely my fault, as Dr. Hulburt said, \"I did it with my little<br />\nhatchet.\"<br />\nJust a little incident that took<br />\nBureau Well Under Way.<br />\nplace. in Prof. Slominsky's logic<br />\nThe Bureau • of Athletic Pub-class last Wednesday. After arriving on the scene of action the licity of Johns Hopkins has gottenwell under way. Dope on a11 athcustomary ten minutes late, and<br />\nafter having successfully borrow- letics going on at the University<br />\ned the customary cigarette and is sent to all the Baltimore newsmatch, the illustrious philosopher papers three times a week, and,<br />\nwrote on the board, \"All men are as soon as the board can get in<br />\nperfect.\" Etaving looked thrice touch with them, will be mailed<br />\nat the instructor, Macht, the con- to papers of neighboring cities.<br />\nThe board consists of Norman<br />\nscienciouS objector raised a storm<br />\nof protest. Whereupon the logi-. C. Keyes, director and editor of<br />\ncian made answer, \"Mr. Macht, I lacrosse; E. M. Welliver, football;<br />\nrealize .that it is a damn lie, but L. W. Lord, baseball; W. Carbo,<br />\nnevertheless I write it upon the track; C. I. T. Gould, minor<br />\nboard unblushing.\" Now, boys, sports; and Carl G. Scott, official<br />\nthat really and truly happened. If photographer.<br />\nyou don't believe me ask the \"old<br />\nFor Diver's Reasons.<br />\nboy\" himself.<br />\nUnto<br />\na<br />\nlittle African '<br />\nThe report has come drifting in<br />\nA-swimming in the Nile<br />\nthat in the course of experiments<br />\nAppeared quite unexpectedly<br />\ndown in the chem. lab. it became<br />\nA hungry crocodile,<br />\nAnd with the chill politeness<br />\nnecessary to mix iodine with alThat makes the warm blood<br />\ncohol to form the compound<br />\nfreeze,<br />\nwhich Dr. Gwyn tells us generally<br />\nSaid, \"I'll take a little dark<br />\nsports the title Tincture of Iodine.<br />\nmeat<br />\nIn the midst of this experiment a<br />\nWithout the dressing, please.\"<br />\n• —Ex.<br />\nlarge crowd gathered, no doubt attracted by the old familiar odor.<br />\nENTERTAINED BY MR. THURS1ON<br />\nAmong these was \"Minnie\" Norwood, (you know Minnie, dear lit(Continuedfrom page I)<br />\ntle thing, isn't she?) who said it<br />\nperform<br />\na trick. After much percertainly looked like the real<br />\nsuasion<br />\nJake Miller reluctantly<br />\nthing, and it didn't smell a bit<br />\nlike grape juice, and who insisted consented to assist him. As a reupon drinking it. As yet I haven't sult his character was almost<br />\nheard the results, but if it worked ruined for a search by Mr. Thursall right I certainly will install ton revealed the fact that he had<br />\nsuch an apparatus to take the concealed upon him, in addition<br />\nplace of my present rasin plus to numerous packs of cards, a pair<br />\nginger ale method, wouldn't you, of baby's socks, a lady's stocking<br />\nand some other article of feminine<br />\nDick Tone?<br />\napparel which it is impossible for<br />\nthe writer to describe.<br />\nCo-operate.<br />\nMr. Thurston did not have time<br />\nProf.—I want to see you get a to investigate further into the<br />\nB on this exam, young man.<br />\nmysteries of Jake's surroundings<br />\nY. M.—So do I. Let's pull to- so after a hullabaloo for Mr.<br />\ngether.—Ex.<br />\nThurston the meeting broke up.<br /><br />\n3<br /><br />\nZIONIST SOCIETY HOLDS MEETING<br />\nInteresting Address Given by Mr.<br />\nMarvin Lowenthal of New York<br />\nWork Well Under Way.<br /><br />\nThe Johns Hopkins Zionist Society held its second monthly<br />\nmeeting last Wednesday, December 10. The feature of the meeting was an illuminating address<br />\nby Mr. Marvin Lowenthal, of New<br />\nYork City, on the subject \"Some<br />\nZionist Problems of Today.\" Mr.<br />\nLowenthal is connected with the<br />\nExecutive Department of the National Zionist Organization and is<br />\ntherefore well informed concerning the problems and difficulties<br />\nencountered in the restoration of<br />\nYour Suit or Overcoat<br />\nthe Jewish homeland.<br />\nSo many thousands of .Jews-- will have those smart dapper kinks if<br />\nespecially those living in Eastern it comes from here where a specialty is<br />\nEurope, said - the speaker, are being made of clothing for college boys<br />\nand young men<br />\neagerly awaiting the first opportunity to emigrate into the land<br />\nPrices, $25.00 to $65.00<br />\nof their national aspirations that<br />\nthe land, misused as it has been<br />\nduring the years of Turkish dominion, will be unable to accommodate them all. Trained, scientific agriculturists are needed inHOWARD AND LEXINGTON STS.<br />\nabundance in order to prepare the<br />\nsoil for large-scale colonization.<br />\nIn addition to this agricultural<br />\nproblem, there is the industrial<br />\nproblem—that of building up sufficient industrie to render Palestine economically self-sufficient.<br />\nMr. Lowenthal devoted considerable attention to the work of the<br />\nZionist Society of Engineers, 29 BALTIMORE ST., EAST<br />\nwhich is completing a scientific<br />\nOne Door West of Light Street<br />\nstudy of the economic needs of the<br />\nfuture population of Palestine.<br />\nThe address made a deep impres- • Sole Agents for Baltimore for College Fraternity Bands (6reek Letter Societies),<br />\nsion upon the forty-odd students<br />\npresent, and served to give many<br />\nARROW COLLARS<br />\nof the new members their first SHIRTS<br />\nglimpse into the actual attainment<br />\nof an ideal which not so long ago<br />\n01, Ctl•<br />\nhad seemed to many to be unatQuality<br />\ntainable.<br />\nThe work of the Hopkins Zionist Society is by this time well<br />\ns Svi<br />\nunder way. Four study circles are<br />\nl• 1 . CV°11eN''.<br />\nI<br />\n,<br />\nIk'\"<br />\nalready in full swing. These in14e°5<br />\nMerchandise<br />\nclude: (1) Elementary Hebrew,<br />\nand (2) advanced modern Hebrew,<br />\nboth given by Dr. Ember, of the<br />\nSemitics Department; (3)a course HATS<br />\nHOSIERY<br />\nin practical Hebrew, under the<br />\nvery able leadership of Mr. William Chomsky ; and (4) a general<br />\ncourse in Zionism.' In the last215 N. CHARLES ST.<br />\nmentioned course the rather novel<br />\nXaltimore's Bes1 Shop For<br />\nidea is being employed of having<br />\nMen's Sox and Ties.<br />\na committee of students lead the<br />\n75 Cents and Up.<br />\ncourse. This committee is composed of Messrs. Chomsky, J. M.<br />\nBerkowitz and M. Levine. All interested students are particularly<br />\ninvited to attend the general<br />\ncourse in Zionism, which is given<br />\non Fridays, at 10.30 A. M., in<br />\n106-108 CLAY ST.<br />\nRoom 117, Gilman Hall.<br /><br />\nYOUNG MAN<br /><br />\nSTEWART&amp; 0<br /><br />\nTHE HATTERIE<br />\nHats of Quality<br /><br />\nlte#<br /><br />\noi-<br /><br />\nc<br /><br />\nTHE HOSIERY SHOP<br /><br />\nBOOK BINDING<br />\nJoseph Ruzicka<br /><br />\nA chin strap of quarter-inch<br />\nblack ribbon is being used for<br />\nholding freshmen caps in the jaunty position prescribed by the<br />\nsophs of Kansas State Agricultural School.<br /><br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\nLI( pkins Seals in Silver and<br />\nGold,<br />\nCollege Jewelry or Specially<br /><br />\n28 E. BALTIMORE STREL<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16, 1919.<br /><br />\nTHE NEWS-LETTER'S MAILBAG<br />\ninto a state of chaos. Stop and<br />\nconsider, is it not true that in the<br />\nworld of business and in the fields A Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulof professional practice one must<br />\n$2.00<br />\nSubscription<br />\nder the Responsibility.<br />\nexercise his own judgment consuccessful,<br />\nbe<br />\nEntered as second-class matter De- stantly in order to<br />\ncember 3, 1909, at the Post Office at and is there any better place to deAll letters intended for publication<br />\nBaltimore, Md., under Act of Congress, velop this faculty than in the colmust be concise.<br />\nNovember 3, 1879.<br />\nNo attention will be paid to anonylege? We are provided with faculmous letters, but names signed as an<br />\nto<br />\nOctober<br />\nfrom<br />\nweekly,<br />\nPublished<br />\nevidence of good faith will not be printed<br />\nty advisers; these would then funcif request is made that they be omitted.<br />\nJune, by the students of Johns Hop- tion in the truest sense of the word,<br />\nThe publication of a letter is not to be<br />\nkins University.<br />\ntaken as an indorsement of its views by<br />\nand not as mere assistants to tile<br />\nNEWS-LETTER, which invites the<br />\nTHE<br />\nbe<br />\nshould<br />\nBusiness communications<br />\nRegistrar, as at present. The minfreest discussion of matters of general<br />\naddressed to the BUSINESS MANAGER,<br />\ninterest.<br />\nJOHNS HOPKINS UNIVERSITY; Cal arti- scrupulous element, which is alcles and other communications should ways with us, is no more restrained<br />\nle sent to the EDITOR-IN-CHIEF.<br />\nunder the present system than in To the Editor of Tin; NEWS-LETTER:<br />\nSir—I noticed •in the columns<br />\nHomewood 100 the proposed one, they cut with imTelephcr_e<br />\nthrough the of your issue of a few weeks ago<br />\nget<br />\nto<br />\ncrib<br />\nand<br />\npunity,<br />\nEditor-in-Chief..<br />\nexaminations, or else flunk most a letter signed N. M. which -goesJohn H. Lewin, '20.<br />\nso far in its advocacy of an \"II\"<br />\ngloriously and graduate by some<br />\nfor<br />\ndramatics as to depreciate the<br />\nManaging Editor.<br />\nunderground manipulation of the<br />\nof debating and journalism.<br />\nvalne<br />\nFrederick F. Torsch, '20.<br />\nwires.<br />\nOne sentence from this letter<br />\nAssociate Editors.<br />\nThe • new plan, in a modified<br />\nreads, \"College debates are, as a<br />\nJames R. Lomauro, '20.<br />\nform, is now in operation on one<br />\nVertrees J. Wyckoff, '20.<br />\nrule, highly beneficial to the partiand<br />\nchemistry,<br />\nin<br />\ncourses<br />\nthe<br />\nof<br />\nMitchell B. Carroll, '20.<br />\nbut decidedly less valuable<br />\ncipant,<br />\nno one can say that the work is not<br />\nCarroll Stansbury, '21.<br />\nand<br />\nentertaining<br />\nto the auditors.\"<br />\nHenry E. Niles, '21.<br />\nanother<br />\ndone as efficiently as in<br />\nthis<br />\nof<br />\nwriter<br />\nThe<br />\nstatement must<br />\nLlewellyn W. Lord, '21.<br />\ncourse, where the regulations are<br />\nbe<br />\none-of<br />\nthose<br />\nwhose<br />\nintellectual<br />\nJunior Editors.<br />\nof the utmost stringency. The<br />\nEdward Huey, '22.<br />\nour humble opin- evolution has not reached that<br />\nin<br />\nis,<br />\nclass<br />\nformer<br />\nH. Douglas Cotton, '22.<br />\nof development which will<br />\nion, one of the best-working groups stage<br />\nBusiness Manager.<br />\npermit him to enjoy or profit by<br />\nreano<br />\nis<br />\nUniversity.<br />\nThere<br />\nin the<br />\nGeorge W. Wagner, '20.<br />\nalthough not amusing,<br />\nson why the honor system should things that,<br />\nCirculation Manager.<br />\nvital<br />\nof<br />\nare<br />\nimportance to anyone<br />\nof<br />\nnot bring us closer to the ideal<br />\nHenry H. Morriss, '20.<br />\nbody of men who takes an hiterest in civic afuniversity—a<br />\ntrue<br />\nthe<br />\nAssistant Business Managers.<br />\nfairs; or can he be one whose abengaged whole-heartedly in the<br />\nVernon E. Stuart, '20.<br />\nsence from the college debates (hisbest<br />\nthe<br />\nfor<br />\nlearning,<br />\nof<br />\npursuit<br />\n'21.<br />\nGeorge Deichman,<br />\nqualifies him entirely front render_<br />\nprogress of mankind.<br />\ning an intelligent opinion or their<br />\nDEC. 16,1919<br />\nBALTIMOR E, MD.,<br />\nvalue to the auditors.<br />\n\"The Admirable Crichton.\"<br />\nAnother sentence, \"The extreme<br />\nAn Extension of-the Honor System.<br />\nTickets are now on sale for<br />\nSonic thud last year there was \"The Admirable Crichton,\" .the conventionality of undergraduate<br />\nPublications is in no way an ina sporadic agitation among the<br />\nplay to be given by the Johns centive for the contribution of.<br />\nstudent body on behalf of the adopHopkins Dramatic Club, at Al- truly literary work.\" This seems<br />\ntion at Hopkins of a system of atbaugh's Theatre.<br />\nto me to be nailer beside the questendance similar to that in vogue,<br />\nplay<br />\nsecond<br />\nthe<br />\nbe<br />\nwill<br />\nThis<br />\ntion. Does the writer mean to inin the great English universities,<br />\ngiven by the inTly founded club, timate that the performance of<br />\nnamely, that attendance at thd<br />\nstudents and friends of last year's dramatic club, as exvarious lectures, recitations and and the<br />\nHopkins are, eagerly awaiting the cellent as it was from the viewlaboratory periods be placed upon<br />\nproduction. The undoubted suc- point of a college play, could realan honor basis. After causing a<br />\nof \"You Never Can Tell\" last ly be considered tow art? Morecess<br />\nthe<br />\nupon<br />\nripples<br />\nfew momentary<br />\nattested by the abundant over, no \"II\" is awarded for jouryear,<br />\nplacid surface of on r undergraducriticism front all nalistic work at -Hopkins, so why<br />\ncomplimentary<br />\nsupineate existence, the issue was<br />\nsides, leads us to expect real en- bring that into the argnment?<br />\nly dropped.<br />\nnight.<br />\nBut let us get back to the real<br />\nSeveral arguments may be ad- tertainment next Monday<br />\nThe play this yqar is one of J. question, namely, why should the<br />\nvanced in fiti'or of this plan. Students are coining to realize that M. Barrie's, aml abounds With the \"I-I\" be awarded in debating and<br />\nreal cleverness. The club not in dramatics? The university<br />\nany neglect of their work during author's<br />\nby Mr. Carol Sachs, has<br />\nassisted<br />\nI\" is trod t lona lly a symbol that<br />\nthe term will lead either to flat<br />\nenthe<br />\nthe<br />\nand<br />\nall<br />\nmade<br />\nscenery<br />\ntlw wearer as one<br />\ndistinguishes<br />\neXaminafailure at the time of the<br />\ntions or to an inordinate cram- thusiastic cast under Miss Walter . who has successfully represented<br />\n-ming just before them, with a con- has spared neither time nor trou- the university in competition with<br />\n, other universities. Under this desequent loss of nearly all of the ble in preparation.<br />\nThe result we feel sure will be finition, which, let ine empliasize,<br />\nknowledge obtained in so short a<br />\ntime. The only-students that win a true exanqde of Hopkins' abil- tradition has estaidished, athletics<br />\nout in the ultimate analysis are ity and spirit, and from the time and debating naturally fall.<br />\nDramatics, Glee Club and such<br />\nthose who have arrived at this con- the curtain rises, every Hopkins<br />\nstudent activities of a more social<br />\nclusion and arrange their work man will feel pride in the play.<br />\nWe say every Hopkins man, be- character fall under an entirely<br />\nsystematically. Under the present<br />\nrules, these men are hampered in cause every student must be in different class. Their members<br />\ngirl should be rewarded by some token<br />\ndoing the work that is most urgent the audience, with his best<br />\nto share his pride.<br />\nfamily<br />\nand<br />\nbut surely not by an award of the<br />\nbeing<br />\nto<br />\nmade<br />\nby<br />\nimportant<br />\nand<br />\n\"II.\" The value of the<br />\nuniversity<br />\nspending<br />\nbesides<br />\nIncidentally,<br />\nspend their time in less important<br />\nis based upon the<br />\nletter<br />\ncollege<br />\nbe<br />\nwill<br />\nhe<br />\nevening,<br />\nenjoyable<br />\nan<br />\nat<br />\nmastered<br />\nbe<br />\nmay<br />\ncourses'that<br />\nassisting in advertising the Hop- fact that it is hard to get. It<br />\nother times with equal facility.<br />\nOf course, it will be said that kins spirit and college life, which represents actual competitiqn with<br />\nstudents will err in their judg- we are developing, and of which other colleges. It means that the<br />\nment, that they will intentionally the efforts of the dramatic club wearer has been selected as the<br />\nabuse their privilege, and that, gives evidence. Moreover, every best man to repuesent the college<br />\nturned loose from all restraints, ticket bought aids materially those in its struggle to overcome strong<br />\nthey will throw both their own efforts and helps to insure their adversaries and in the case of the<br />\ntrack \"H\" it means actual victory<br />\nstores of knowledge and the plans success.<br />\nover an opposing college.<br />\nearly.<br />\ntickets<br />\nyour<br />\nBuy<br />\nprofessors<br />\nof their long-suffering<br /><br />\n• JO (1011118AlialSilie1118-10101<br /><br />\nI do not want any one to think<br />\nI am trying to down the Dramatic<br />\nClub. Nothing of the kind.<br />\nI appreciate fully the value of<br />\nsuch an organization to Hopkins<br />\nand feel that its organizers are<br />\nto be complimented for their success in establishing the club on the high plane that it occupies.<br />\nOn the other hand, I protest<br />\nagainst any action -that will depreciate the value of the \"H\" by<br />\nmaking it too common. I think<br />\nthe members of the Dramatic Club<br />\nwill agree with me in this stand<br />\nand in agreeing will adopt some<br />\nmore fitting award that will show<br />\non the face of it what it stands<br />\nfor.<br />\nW. M. I).<br />\nThe Charge of The Math Brigade.<br />\n[With apologies to Tennyson.]<br />\nI.<br />\nHalf a day, half a day,<br />\nHalf a day passes<br />\nJust about problems in math<br />\nWrote the six classes.<br />\n\"Forward to math exams!<br />\n'Charge for the pens, my lambs!\"<br />\nJust about problems in math<br />\nWrote the six classes.<br /><br />\n\"Forward to math exams!\"<br />\nIs there a man who shams?<br />\nYes, for each student knows<br />\nSlim are his chances.<br />\nTheirs is to make reply,<br />\nTheirs is to reason why;<br />\nTheirs not .to sit and sigh<br />\nJust about problems in math<br />\nWrote the sif cl-sses.<br /><br />\nProblems to right of them,<br />\nProblems .to left of them,<br />\nProblems in front of them<br />\nStared in their faces.<br />\nStormed with (I dare not tell),<br />\nBoldly they wrote, and well,<br />\nJust about problems in math,<br />\nTrying examples to quell,.<br />\nWrote the six classes.<br />\n•<br /><br />\nIV.<br />\n•<br />\nFlashed each his inky pen,<br />\nFlashed as he wrote and then<br />\nDipped it in ink again.<br />\nThe faculty gazes.<br />\nPlunged in the midst of math,<br />\nRose they to awful wrath.<br />\nProblem and Theorem<br />\nReeled from the inky path,<br />\nSlaughtered in masses.<br />\nSome few had passed, but not<br />\nAll of six classes.<br />\n—Ex.<br /><br />\n1\"THE ADMIRABLE CRICHTON\"1<br />\nBy M. BIBULOUS CAROLUS<br /><br />\nSome people bemoan<br />\nThat the times are all wrong—<br />\nIt's a penal offense to depart<br />\nFrom conventional pale,<br />\nEven though life be_stale,<br />\nStripped of all romance and art.<br />\nAs the pendulum swings—<br />\n„While Time flaps 'his wings—<br />\n'T will leave these days drab and<br />\nneurotic,<br />\nTo a realm of delight<br />\nFull of laughter and light,<br />\nWhere people dare do the quixotic.<br />\nWe embark on a venture,<br />\nIn a play that was meant sure<br />\nTo revel in fanciful things,<br />\nThough mere puppets we are,<br />\nThe stage is a star<br />\nWith Clementine pulling the strings.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 16, 1919.<br /><br />\n5<br /><br />\nMAJOR GUILD TO LEAVE HOPKINS<br /><br />\nA good guess for<br />\nyou would be—<br /><br />\nUniversity Sustains Loss on His Retirement From U. S. Army—Built Model<br />\nR. 0. T. C. Unit Here—His<br />\nFuture Undetermined.<br /><br />\nThe Johns Hopkins 1\"niversity<br />\nlifts sustained a loss in the departure of Major George R. Guild, who<br />\nretired from the army Monday,<br />\nDecember 15, 1919. On December<br />\n11 Major Guild addressed for the<br />\nlast time the R. 0. T. C. unit<br />\nwhich he has built up with so<br />\nmuch care and wisdom. The Major will live in Baltimore, but is<br />\notherwise Undecided as to his future. He will be succeeded as professor of military science and tactics by Lieut.-Col. Olin 0. Ellis.<br />\nMajor Guild is a member of the<br />\nhonorary fraternity Omicron Del—There's style<br />\nta Kappa, treasurer of the Johns<br />\nHopkins Orchestra and a member<br />\nto them<br />\nof the Engineering Advisor<br />\nBoard. He is, with Colonel Moss.<br />\nthe author of \"Military Students'<br />\nText-Book\" in four volumes,\"Military Customs and Courtesies,\"<br />\n\"Practical Topography,\" \"R. 0. T.<br />\nC. Students' Military Record,\"<br />\netc., and has served in the PhilipBaltimore, Charles and Fayette<br />\ntimid on the Texas border.<br />\nWhen Majbr Guild first came<br />\nhere in September, 1917, the Johns<br />\n- AMUSEMENTS<br />\nHopkins unit of the R. 0. T. C.<br />\nhad been organized a year under<br />\nLieutenant Elliott. After he had<br />\nbeen here a few weeks, he got<br />\nNights at 8 Shaw—Mats. at 2.<br />\nthe idea. of making this unit a<br />\nMatinees Wed., Thurs. and Sat.<br />\npioneer of its kind in educational<br />\nNew York Winter Garden's<br />\nmilitary work., .The first thing to<br />\nbe done was in the matter of discipline. There was to be, he deWith the Original All-Star Cast<br />\ntermined,<br />\nno forcing—everything<br />\nHeaded by<br />\nunit must be on a volunthe<br />\nabout<br />\nWILLIE AND EUGENE HOWARD,<br />\nROY CUMMINGS, WM.PHILBRICK, tary basis. The Student Council<br />\nauthorized the demerit system<br />\nJOHN BURKE-150 OTHERS,<br />\nIncluding the<br />\nwith punishment tours, as pracFAMOUS WINTER GARDEN CHORUS.<br />\nticed at West Point, and from<br />\nEves., $1 to $3. Mat. Sat., 75c to $2.<br />\nthat time on the unit has been<br />\nMats. Wed. and Thurs., 50c to $1.50.<br />\na great success.<br />\nNext Week—Seats Thursday..<br />\nIn the summer of 1918, Major.<br />\n\"SOME TIME.\"<br />\nGuild was in comand of the<br />\nFirst Battalion, companies A, B,<br />\nand D at the first R. 0. T. C.<br />\nC<br />\nTHE<br />\ncamps at Plattsburg. He returned to the university that fall but<br />\nin the middle of October was callPresents<br />\ned to Philadelphia to become district inspector of the Third Dis\"The Admirable Crichton\"<br />\nBy James M. Barrie<br />\ntrict, Students' Army Training<br />\n_<br />\nCorps.<br />\nALBAUGH'S THEATRE<br />\nAfter the demobilization of the<br />\nMonday, Dec. 22, 1919, 8:15 P.M. S. A.. T. C. a tremendous slump<br />\nwas experienced throughout the<br />\nTickets at Albaugh's after Dec. 15th<br />\n50c to $2.00<br />\ncountry in the wish for military<br /><br />\nJarirtu<br />\nikatth<br />\nCutlir,6<br /><br />\nTie<br /><br />\nflub<br /><br />\nAUDITORIUM<br /><br />\n\"PASSING SHOW\"<br /><br />\nJohns Hopkins Dramatic Club<br /><br />\nTHE \"PLYMOUTH\" OVERCOAT<br />\nIn brown and green mixtures; with naval muff pockets<br />\nand tailored lower pockets; extra-large convertible<br />\ncollar.<br /><br />\n'0<br /><br />\nNECKWEAR<br />\nPROMOTION MANAGER SHIRTS<br />\nA University student with energy and business<br />\nLefrane &amp; Ault<br />\nability to assist in securing boys for Summer Camp.<br />\nExcellent opportunity for wide awake man. Minimum compensation is $500. For information address Director's Office, Lake Placid Camp, 27 Ware<br />\nStreet, Cambridge, Mass.<br /><br />\n421 N. Noward St.<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br />\ncourses. Very few, if any, volunteer It. 0. T. C. units could enLuncheon<br />\nroll as many as a hundred men<br />\nAfternoon Tea<br />\nin the spring of 1919. Hopkins<br />\nMUSIC<br />\nwould-have fared as badly as the SODAS AND SUNDAES<br />\nrest had not Major Guild asked<br />\nto be released from his Philadelphia position to return here. With<br />\nhis arrival, however, came the ne1 W. UNIVERSITY PARKWAY<br />\ncessary spirit and enthusiasm to<br />\nOPPOSITE J. H. U. ATHLETIC FIELD<br />\narouse Hopkins men to get the''<br />\nrecord enrollment of 178 men out<br />\nof a possible 235. The War De- Drug Store for J. H. U. Boys<br />\npartment appreciated this work<br />\nPHONE HOMEWOOD 2121<br />\nand there was some talk or having the R. 0. T. C. headquarters<br />\nof the Third District transferred Buy an (H) Pipe made special<br />\nfor the Boys.<br />\nto Hopkins, a move that may yet<br />\nbe acconiplishieti.<br />\nUnder the then existing law<br />\nMajor Guild would have had IT<br />\ngo on the retired list of the Army<br />\nlast summer but fortunately the<br />\nMADE TO ORDER<br />\nlaw was changed in time to make<br />\nthis unnecessary.<br />\n-AND<br />\nIn building the unit the Major's<br />\nwish has always been to develop<br />\nFINISHED CLOTHES •<br />\nofficers—not drillmasters. To this<br />\nmay be attributed the excellent<br />\nPLAZA BUILDING<br />\ncourses given by the military department here. Not so much time 19 AND 21 EAST FAYETTE STREET<br />\nis spent in learning to drill to tinsoldier perfection, but more time<br />\nis devoted to fitting students to be<br />\n0 R T MA N S<br />\nConsequently<br />\ncapable officers.<br />\nmore is accomplished in this unit \"Queen Quality\" Home-Made Candies<br />\n80e. a pound<br />\nthan in any in the United States,<br />\nalthough the actual number of<br />\nVISIT OUR ICE CREAM PARLORS<br />\nworking hours is less here than at<br />\n227 N. HOWARD STREET<br />\nsome other colleges. • Military<br />\nscience has been elevated to the ARTISTIC PHOTOGRAPHS<br />\nranks of a regular college course,<br />\ncarrying seventeen pc-Ants towards<br />\ngraduation and being an elective<br />\n,319 North Charles Street<br />\nfor all the etVgineering courses except the chemical.<br />\nSPECIAL 'DISCOUNT TO J . H.U. STUDENTS<br /><br />\nR.G.LOY &amp; COMPANY<br /><br />\nLEMMERT<br /><br />\nIlgenfritz<br /><br />\nROBERT PAUL IULA •<br />\nTHE LAFAYETTE<br />\nCHOCOLATE S1-10P<br /><br />\nORCHESTRA DE LUXE<br /><br />\nCharles and Lafayette Ave.<br /><br />\nTHE ARCADE<br />\nTEA ROO/v1<br />\n324 N. Charles St.<br /><br />\nMUSIC fOR DANCES, RECEPTIONS, ETC.<br />\nTELEPHONE. G1LMOR 2929<br /><br />\nRESIDENCE, 614 FULTON AVENUE<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, DECEMBER 16, 1919.<br /><br />\n6<br /><br />\nWolfe To Coach Lacrosse.<br /><br />\nTHE TURKISH CIGARETTE<br />\nYou may hunt the<br />\nworld over—but you cannot find a, cigarette to<br />\n. take the place of Murad.<br />\nThe tobacco in Murad is 100% pure<br />\nTurkish—and Turkish is the most<br />\nfamous of all tobaccos for cigarettes.<br />\nIt is true that “ordinary\" cigarettes<br />\ncost a trifle less.<br /><br />\n\"Judge for. yourself<br /><br />\nmanagement<br />\nThe<br />\nlacrosse<br />\nwishes to announce that, after<br />\nmuch persuasion, Reaney Wolfe<br />\nhas consented to coach the lacrosse 'team for the 1920 season.<br />\nWolfe is well known to all lacrosse \"fans,\" having starred for<br />\nHopkins before graduating a few<br />\nyears ago. He was chosen sometime ago by a committee comprising \"Bill\" Schmeisser, father of<br />\nlacrosse at Hopkins, Ferdie<br />\nMeyer and Norman Keyes, captain<br />\nand manager respectively, of this<br />\nyear's team, but it was feared for<br />\na while that, because of business<br />\nduties, he would be unable fo,<br />\nspare sufficient time. His acceptance will be heartily welcomed by<br />\nall followers of the sport at Hopkins, as it once more assures the<br />\nteam of a first-class coaching<br />\nstaff.<br />\nManager Keyes requests all<br />\nwho expect to go out for the team<br />\nto assemble at 12.30, Wednesday,<br />\nDecember 17, in the Donovan<br />\nRoom. The meeting will be addressed by the different leaders of<br />\nthe sport and probably also by Mr.<br />\nMurphy.<br />\nSwimming Schedule Altered.<br /><br />\nMaas#e restGnadathisit<br />\nand Egyptian iMinthe1lbni<br /><br />\n•<br /><br />\n20<br />\nCENTS<br /><br />\nOn account of a conflict with<br />\nthe basket ball team, which • will<br />\nmeet Bucknell on December 19,<br />\nthe meet scheduled by the swimming team for that date with the<br />\nUniversity of Pennsylvania has<br />\nbeen postponed until February 14.<br />\nThe meet set for the latter date<br />\nwith Swarthniore will be .put off<br />\nuntil later in the season. As the<br />\nschedule now stands, the first engagement will be with Lehigh in<br />\nthe B. A. C. tank on January 17.<br />\nIn order that the members of<br />\nthe team may have more individual attention and practice, Captain R. /C. Hall has decided to<br />\nshortly divide the squad into two<br />\nparts, the first comprising the<br />\ndozen or so men whose places on<br />\nthe 'Varsity are regarded as almost certain, and the second being made up of the remaining candidates. If the proper arrangements can be made with the Baltimore Athletic'Club, the first squad<br />\nwill hold practices two afternoons<br />\neach week, while the other will<br />\npractice once a week. In addition<br />\nto this, both will meet together<br />\nwith Coach Ortland on Thursday<br />\nnights.. With such intensified<br />\ntraining, Captain Hall expects to<br />\nhave his team up to top form by<br />\nthe beginning of the regular season...<br />\nMotto Metamorphosis.<br /><br />\nMAY SELL LOTS TO CITY COLLEGE<br />\n(Continued front page 2)<br /><br />\nhealth and recreation and in order<br />\nto permit the City College to fairly compete with the Polytechnic<br />\nInstitute in athletics and in the<br />\nadvantages offered.<br />\nIf the suggested purchase is<br />\nmade, it might be pointed out that<br /><br />\nnothing would be taken from the<br />\nCity's taxable basis, this property<br />\nnot now being assessed. In addition, any money paid to the Johns<br />\nHopkins University will be used<br />\nfor further public improvements<br />\nat Homewood so that the same<br />\nappropriation will work twice for<br />\nthe general benefit of the City.<br /><br />\nThe University officials have,<br />\nrecently received inquiries for<br />\nthis block from a theatre syndicate and the indications are that<br />\nit may _be sold before very long.<br />\nIf the City desiFes to provide for<br />\nthe immediate and future of the<br />\nCity College, action should be<br />\ntaken at once.<br /><br />\nNineteenth Century—Wine, woman and song.<br />\nTwentieth Century—Near-beer,<br />\nflappers and jazz.<br />\nHe (sadly)—Your refusal •to<br />\nmarry me will mike me a different<br />\nman.<br />\nShe (hopefully) — Well, you<br />\nmight come around and see me<br />\nagain some time.—Ex.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 16, i919.<br />\nMUSICAL CLUBS GUESTS OF TOME<br /><br />\nI_I<br /><br />\nII Ii<br /><br />\n(Continuedfrom page 1)<br />\nwaiian steel guitar solo, \"The<br />\nRosary,\" in a most effective manlier.<br />\nMany interesting incidents occurred during the night after the<br />\nconcert was given. Turpin had to<br />\nsleep on an improvised bed. Two<br />\nbunks were placed alongside of<br />\neach other, and three boys had to<br />\nsleep on them. When the bunks<br />\nwere separated Turpin found himself on an imaginary bed, between<br />\nthe two bunks. Some of the men<br />\nwere not sleepy and they played<br />\ngames in order to while away<br />\nsome time.<br />\nOn Sunday morning, after<br />\nbreakfast was served, the restless<br />\ncrowd of Hopkins men boarded<br />\nthe train. The jazz orchestra<br />\nbegan to perform, when the conTHE<br />\nductor growled, \"you Tome boys<br />\nwill have to behave or I will put<br />\nCollar Hug Clothes<br />\nyou off at Aberdeen.\" Silence preBaltimore and libefyStreets<br />\nvailed for a fraction of a second.<br />\nWhen the conductor learned that<br />\nthe boys were Black and Blue<br />\nmen, he said in a pleasant manner, \"you can play all you-please<br />\nif you do not drown my voice<br />\n\\Olen I call the stations.\" Then<br />\nthe boys gave vent to their musicFor nfen Who<br />\nal feelings.<br />\n\"Chink<br />\nThe musical clubs will give a<br />\nconcert at Gilman Country school<br />\non January 10, and at the Brantley Baptist Church on January 16.<br />\nThe concerts at Friend's School,<br />\n8 E. Baltimore St.<br />\nGoucher College, Hood's College,<br />\nand at the Church of Our Savior<br />\nwill take place sonic time after<br />\nthe examinations are over. The<br />\n\"McCoy Hall\" concert will be<br />\npresented in spring, and most<br />\nStationers Engravers Printers<br />\nlikely at Lehman's Hall.<br />\nFountain<br />\nPens I. P. Note Books<br />\nThe positions of the various<br />\nmembers of the musical clubs are 229 Park Avenue - Baltimore<br />\nnow settled, and are as follows:<br /><br />\n1:11141111111111talinil<br /><br />\nDEG US PAT Orr<br /><br />\nTHE BEVERAGE<br /><br />\nFellowship—in college or<br />\nout of it—flourishes best<br />\nwith good food and wholesome drink. Ice-cold<br />\nBevo—unexcelled among<br />\nbeverages in purity and<br />\nhealthfulness—is most<br />\nsatisfying as a drink by<br />\nitself or a relish with<br />\nfood that makes a hap.<br />\npier repast.<br /><br />\nUALITY SHOP<br /><br />\nHESS SHOES<br /><br />\nANHEUSER-BUSCH,ST.LOUIS<br /><br />\nN. HESS' SONS<br /><br />\nIt must be<br />\nIce eold<br /><br />\nFRESHMEN DEFEAT SOPHOMORES<br /><br />\nJ. H.SAUMENIG &amp; CO.<br /><br />\nSeniors Elect Baker to Student Council<br />\nand Adopt Canes.<br /><br />\n(Continued from page i)<br />\ned and the freshies were unable<br />\nto advance the leather the necessary eight yards.<br />\n. The line-up:<br /><br />\nAt a meeting of the Senior<br />\nClass last Tuesday, Eli Baker was<br />\nelected to the Student Council, to<br />\nfill the one vacancy still existing.<br />\nA spirited discussion took place<br />\nSophomores. on the question of wearing a disFortney<br />\ntinctive class mark after Easter.<br />\nBarrett<br />\n......Schas It was decided that a special deSchmidt sign of canes would be adopted,<br />\nMoore<br />\nand a committee was appointed to<br />\nReid<br />\narrange for them. Another was<br />\n.Engle<br />\nchosen to look into the matter of<br />\nOwings<br />\nTome adopting a (list inctive Senior cap,<br />\nWood (c) as is worn at several of the northMarkell ern colleges.<br /><br />\nFreshmen.<br />\nPos.<br />\nMiddleton<br />\nL. E<br />\nButler<br />\nL. T.<br />\nRones.<br />\nL. G.<br />\nCromwell<br />\nC.<br />\nLandy (c.)<br />\nR. G.<br />\nWilliams<br />\nR. T.<br />\nElgert<br />\nR. E<br />\nKelly<br />\nQ. B.<br />\nBarchet<br />\nL. H.<br />\nDodson<br />\nR. H<br />\nBaughman.<br />\nF B.<br />\nFreshmen<br />\n0 6 0 0-6<br />\nSophomores ..<br />\n0 0 0 0-0<br />\nSubstitutions—Freshmen: CulliMore<br />\nfor Elgert; Sophomores: Wigton for<br />\nWood, Wood for Wigton, Holmes for<br />\nFortney, Fortney for Holmes, Holmes<br />\nfor Engle, Nicodemus for Moore. Referee—Jones. Umpire—Hoffman. Head<br />\nLinesman—Welliver.<br />\nTouchdown —<br />\nDodson. Time of Periods-10 minutes.<br /><br />\nMANDOLIN CLUB.<br />\nLeader—Douglas Coulter.<br />\nFirst Mandolins—H. C. Davis, J..L.<br />\nRank, J. R. Lomauro, C. A. Rankin, J.<br />\nD. Virdin, A. L. Bolton, C. S. Collins,<br />\nM. W. Kessler.<br />\nSecond Mandolins—T. F. Hubbard,<br />\n.T. A. Weinberg, L. F. Buxby, A. H.<br />\nBurnham, Jr., M. E. Scheidt, H. Seitz.<br />\nGuitars—R. W. Hambleton, J. H.<br />\nRiggs, R. F. Passano, H. Holsopple, B.<br />\nKuder, J. Lewis.<br />\nFirst Violins—C. A. Rankin, G.Myers,<br />\nBanjo-Ukulele—P. R. Wiggins, L.<br />\nMcA. Cattanach.<br />\nGLEE CLUB:<br />\nDirector—Harry Hartman.<br />\nFirst Tenors — G. Cattanach, C. A.<br />\nRankin, Fairballks, Prince.<br />\nFirst Basses—J. L. Rank, J. R. Lomauro, Defandorf„Parsons, MacDonald,<br />\nL. Cattanach, Spieler, Turpin, Burnham, Singewald.<br />\nSecond Tenors —J. D. Virdin, F.<br />\nTorsch, Langluttig, Price, L. Henck,<br />\nKauffman,`H. C. Davis, Kuder.<br />\nSecond Bas se s— Lewis, Gressitt,<br />\nWeaver, Kelley, Leonard, Emlet, gerliken, T. Hubbard, Buchner.<br /><br />\nLunches, Cigars,<br />\nCigarettes, Candy,<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br /><br />\nE. E. ADAMS<br />\nThe Chas. Wilms Surgical Instrument Co.<br />\n300 N. Howard<br />\nSt„ Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nHospital, Invalid and Microscopic<br />\nSupplies.<br />\nORTHOPEDIC APPLIANCES.<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards—Invitations<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER — PRINTER —STATIONER<br />\n229 N. Charles Street<br /><br />\nCollars—Dozens of Styles—and Other Furnishings<br />\nTHE STORE<br />\nFOR MEN<br /><br />\nHUTZLER BitirliElt<br /><br />\nHoward Street<br />\nNear Saratoga<br /><br />\nTHE-JOHNS HOPKINS NEWS-LETTER, DECEMBER 16, 1919.<br /><br />\nS<br />\nPLAY GETS FINISHING TOUCHES<br /><br />\nFUND FAR FROM COMPLETED<br /><br />\nDramatic Club and Cast are Speeding<br />\nUp Preparations for Presentation<br />\n\"The Admirable Crichton\" at<br />\nAlbaugh's Dec. 22nd.<br /><br />\nProspects Dark for Dormitory—Pledges<br />\nCome in Slowly—Amount Not<br />\nHalf Subscribed.<br /><br />\nOn Monday, December 22, the<br />\nJohns Hopkins Dramatic Club<br />\nwill give its first performance this<br />\nseason, .T. M. Barrie's well-known<br />\nplay \"The Admirable Crichton.\"<br />\nThe play will be given at Albaugh's Theatre and the seats are<br />\nnow on sale at Albaugh's ticket<br />\noffice. Realizing that only a few<br />\n(lays are left in which to complete<br />\npreparations, everyone connected<br />\nwith the club has redoubled his<br />\nefforts to make this year's presentation even more successful than<br />\nlast year's.<br />\nRehearsals are now being held<br />\ndaily and under the careful guidance of, their coach, Miss Clementine Walter; members of the cast<br />\nare putting the finishing touches<br />\non the work which they began<br />\nsoon after the opening of college.<br />\nTo the feminine characters the<br />\nchoice of costumes is a matter of<br />\nthe greatest importance. Every<br />\ndebutante in town has been consulted concerning the most approved styles in feminine attire,<br />\nand many have been shocked<br />\nwhen some one of the young actors lets slip a question as to what<br />\ncolor; garters should be worn with<br />\nan evening dress or where to buy<br />\nsilk stockings. Even the masculine characters are not totally exempt from the clothing question<br />\nand proprietors of certain hock<br />\nshops are surprised by the unusual demand for full dress suits.<br />\nThe property man, too, has his<br />\nhands full. In one corner of the<br />\ndramatic club's room in the Barn<br />\nthere is already piled a heterogeneous collection of life preservers,<br />\nchina ware, chairs, lanterns, and<br />\nmany other things that arouse the<br />\ncuriosity of one who has not seen<br />\nthe play. Mr. Carol Sachs, formerly an instructor at the Maryland Institute, has made a room<br />\nin Gilman hall his studio and<br />\nthere, aided by a corps of assistants, he is rapidly finishing the<br />\nwork of painting the scenery.<br />\nUnder his skilful direction des-<br /><br />\nogo.ogoqogogai-fogogogogogoRogogo.ogogo:zogogolio.--:0,-zol_fpgog<br />\nYou can't see a Show by reading the Program<br />\nNeither can you tell the quality of our garments<br />\nby reading this ad. Let us show you!<br /><br />\nThe dormitory fund is less than<br />\n$32 and up<br />\nhalf subscribed. The campaign<br />\ncommittee has received donations<br />\nand pledges to the amount of only<br />\nClothes of Custom Quality<br />\n$109,000. This -leaves $191,000<br />\n- 14 N. CHARLES ST.<br />\nstill to be raised. Pledges are still<br />\ncoming in, but it is felt that Hop- ONOROTeugofluifo-F:0-ifoit-0:<br />\nOPtOrt.Ore<br />\n-fo:<br />\n-TontafforicYY:0L700A0A011):0::0ff0<br />\nkins Alumni and students must<br />\nCOME TO<br />\nbestir themselves if the opening<br />\n.of the 1920-21 term is to find a<br />\ndormitory here. The restjlts of<br />\nST. PAUL ST. AND NORTH AVE.<br />\nthe drive thus far seem to indicate<br />\n(Cars pass in front of door)<br />\nthat a spirit of \"let George do it\"<br />\nRev. David Carson Bayless<br />\nCORDIAL WE<br />\nServices. 11 A. M. and 8 P. M.<br />\nhas 'prevailed. Most of the men<br />\nMinister<br />\nTO ALL STUDENTS<br />\nMen's Bible Class. 9.45 A. M<br />\nUniversity<br />\nthe<br />\nwith<br />\nassociated<br />\nhave contributed, but not on the<br />\nThe Men of Johns Hopkins University Are Most Cordially Invited to Attend the Servicrs<br />\nbasis of \"all that I can afford.\"<br />\nPeter .5 Episrnpat Thurril<br />\n(6rarp<br />\nThe committee has been _divided<br />\nMONUMENT ST. AND PARK AVE.<br />\ninto two groups. One of these<br />\n•<br />\ngroups is assigned to the duty of<br />\n41 The services on Sunday are at II o'clock and 8 o'clock. Seats will be reserved for Johns<br />\n'<br />\nHopkins men up to the hour of service. We want to have the privilege of having you assocanvassing all of the Alumni in<br />\nciated with us in our worship, and we hope that the benefit may be reciprocal.<br />\nthe city; while the other will<br />\nwrite personal letters to those<br />\nJunior Athletics.<br />\nwho do not live here. It is hoped<br />\nIt has been found necessary to<br />\nthat in this way, the spirit that<br />\n(THE BOOK MART)<br />\nwas manifested at the beginning discontinue outdoor basket ball<br />\non account of the cold weather.<br />\nof the drive may be regained.<br />\nThe freshman teams will continue<br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nto meet inside, but the upper-classAND COLLEGE REQUISITES<br />\nLatgot<br />\nflowers<br />\nLady—Have all<br />\nmen will be switched over to the<br />\nin names?<br />\nIMPORTERS AND DEALERS IN<br />\nsoccer squads or the setting - up<br />\nFlorist—Yes, madam.<br />\nFINE BOOKS<br />\nsquads.<br />\nLady—Even the common ones?<br />\ncandidates<br />\nof<br />\nnumber<br />\nA large<br />\nFlorist—Yes, madam.<br />\nfor soccer have already appeared 301 N. CHARLES STREET<br />\nLady—Isn't nature wonderful!<br />\nand two teams, have been organBaltimore, Md.<br />\nized. B. R. Smith is captain and<br />\nP. R. \"Nickerson assistant captain<br />\nerts and parlor walls are pro- of the first team, while D. E.<br />\nSchuchts, aided by J. F. Strott,<br />\n,<br />\nduced with equal facility.<br />\nThere is every indication that will lead the second.<br />\nMore teams will be organized in<br />\nthe play next Monday will be a<br />\ngreat success, and those interest- the future as the nuinber of caned in the dramatic club have ex- didates is constantly 'increasing<br />\nYou're Interested In<br />\npressed the hope that a large and.a schedule of contests between<br />\nEvery<br />\nStudent Should Own<br />\nnumber of Hopkins students will these teams will soon be arranged.<br />\nattend. Members of the club are A. team to. represent the juniors<br />\nSend Your Name for Monthly List<br />\nselling cards for one dollar a piece will be selected from all these<br />\nleading<br />\nplay<br />\nthe<br />\nwill<br />\nand<br />\nteams<br />\nwhich will be credited as that<br />\nCharles Street, at Mulberry<br />\namount toward a reserve seat \"prep\" schools in the vicinity.<br />\nwhen presented at Albaugh's<br />\nThe Height of Nerve.<br />\nticket office or the theatre. As<br />\nA fellow trying to flirt with a<br />\nthe club desires to have some<br />\n23 E. HANOVER ST.<br />\nmoney on hand it is desirable to girl on a street car, when she is •<br />\nBALTIMORE, MD.<br />\npurchase these cards as soon as hanging onto a strap and he ocPrinters of Philological and<br />\npossible and exchange them .for cupies the seat directly in front<br />\nof her.—Er.<br />\nScientific Works<br />\nseats whenever convenient.<br /><br />\nNorilimitwirr tiregligtrriatt Thurril<br /><br />\nThe Medical Standard Book Go.<br /><br />\nThe<br />\nNorman Remington Co,<br /><br />\nBOOKS<br /><br />\nJ. H. FURST CO<br /><br />\n111<br /><br />\nt-7/SS WALTER<br />\n4CCOMP/1/1/11:5 THC RFfiRS/11_ BY /1CT/N6<br />\nP/IRT IN OU/\"18-SHOW.<br />\nHERE, HER LIPS B/?E WI-/IS TL /A/6 TO ACCOMPnNY L/1,0Y/7/1/0'<br /><br />\nAT fi fifNC fi'SRL<br />\nOf Tiff<br /><br />\nDRAI'lliTIC<br /><br />\n(Loa<br /><br />\nHER 11/INDS /IRE FRCP/IR/NG<br />\nSt/PPE/f MTN L. ABY /10/7T/111,<br />\nONE FOOT.<br />\nST/IMP/NO\" /N<br />\nSYMP/5 THY'7. k vVI TH TWEE/1/)'<br />\n/WO THE<br />\nOTHER /S STI187'<br /><br />\nIA/G TO<br />\nINITH<br /><br />\n1/1/1ILK OFF<br />\nER NCS<br /><br />\n1/ARRr MORRISS<br />\n.5711UL4T/N6<br />\nCI! 7:<br />\nT/6<br />\nLADYC477/1/f/NE<br />\nW/71/ /9 17NZ:<br />\nST/F/N6 Or<br />\nF/SN.<br /><br />\nam/ix /IT<br /><br />\nTHE(AO<br />\n71/E.<br />\n01-ACTSI<br />\n0/41PLIf Lt-13E•R PULL/N6<br />\n4/1/ /1146/414RY LEI/ER TO /6N/TE4/07SSIMILD BE/ICON fiNg S/6/11AL<br />\n- C7701L SNIP<br />\nA' NrP077/<br /><br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America. \"Johns Hopkins University Circulars,\"\"Modern Language Notes,\" -Maryland Historical Magazine,\" 'University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\n)frat ter. Special attention given to the<br />\niniltairach,a<br />\nspirm<br /><br />\nDOCTORS' DISSERTATIONS<br />\nin Greek, Latin, Anglo-Saxon. Old English, and<br />\nRomance and Germanic Languages<br /><br />\nWyman's<br /><br />\nThe Largest &amp;<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br /><br />\nMen's<br /><br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br /><br />\nShoes<br />\n19 Lexington St.<br /><br />\nSole Agent for<br />\nthe Johnston &amp;<br />\nMurphy Shoes.<br /><br />"}], "field_media_file": [{"target_id": 37429, "display": null, "description": null, "target_type": "file", "target_uuid": "bfa5ff31-54e9-4dad-b8d1-75105e739fc0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12904-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12904, "target_type": "node", "target_uuid": "4433e953-3c6c-4b79-a980-0add3600bdaf", "url": "/node/12904"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "ed381c14-7f3a-4b0b-8909-1e5f640636a5"}]}