{"mid": [{"value": 35635}], "uuid": [{"value": "530ad538-7125-45d8-981a-47fc02dc5725"}], "vid": [{"value": 35635}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12180-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "PRESS OF STONEBRAKER<br />\n<br />\nBROS., 13ALTIMORE.<br />\n<br />\n\fJOHNS HOPKINS<br />\nUNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nBALTIMORE, MD.<br />\nII.<br />\n<br />\nTwenty-Fifth Year.<br />\n<br />\n13eginning October 1st, 1900.<br />\nIII.<br />\n<br />\n• DANIEL C. GILMAN<br />\nWM. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br />\n<br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br />\n<br />\nIV.<br />\nV.<br />\n<br />\nINSTRUCTION.<br />\nFor Oraduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As speciabstudents.<br />\n<br />\nVI.<br />\n<br />\nVii.<br />\nVIII.<br />\nIX.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\n<br />\nX.<br />\n<br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra Reinsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\n11'illiam II. Howell.<br />\nH. Welch.<br />\nJohnJ. Abel.<br />\nJohnj. Abel.<br />\nWilliam Osier.<br />\n<br />\nXI.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Blo0111field.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the 'Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Cheinical-Iiiologicid,<br />\n(leading up to Medicine.)<br />\n4. Geological-I3iological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\n<br />\nEditors.<br />\n<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssynology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br />\n<br />\nFrank Morley.<br />\nIra Renzsen,<br />\nBasil L. Gildersleeve.<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br />\n_<br />\n<br />\n-Programmes of the Courses offered to graduate students<br />\nto Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe ,-,cnt on application to the Registrar.<br />\n<br />\nXII.<br />\n<br />\nXIII.<br />\n<br />\nXIV.<br />\nXV.<br />\n<br />\nXVI.<br />\n<br />\nXVII.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY,Editor. Quarterly. 4to. Volume XXIII.<br />\nin progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nI. REMSF-N, Editor. Monthly. 8vo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nStudies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series XIX<br />\nin progress. $3 per volume.<br />\nJohns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nJohns Hopkins Hospital Reporta. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nContributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. Eworr, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. Svo. Volume<br />\nV in progress. $5 per volume.<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\n1,. A. 13AuER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nAnnual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc. of the University. Published at the<br />\nclose ofthe academic year.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF TI1E NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHR TEACHING OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\nBIBLIOGRAPHIA HCPKINSIENSIS. Part I. Philology. Parts<br />\nII-III. Chemistry, Minerology and Geology. Parts<br />\nIV-V-V1 Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br />\n<br />\n\f•Cbe news= Letter.•<br />\nVol. V.<br />\n<br />\nMay 23, 1901.<br />\n<br />\nCOLLEGE LIFE AT SEVILLE.<br />\n( Notes of a sometime student at Academio de Sevilla.)<br />\n<br />\nHE Spanish student would stare at our<br />\nTidea<br />\nof college life, for he does not feel the<br />\nAmerican athletic enthusiasm. He is intent<br />\non his cards and his beloved cigarettes, his<br />\nlittle games of strength, his evenings at<br />\nthe theatre, with its rollicking \"rough<br />\nhouse,\" or at the cafe, drinking much, but<br />\nseldom too much; he serenades, he makes love<br />\nat barred windows, he avenges with knife-andcloak duels offenses against his strict code of<br />\netiquette. Life is jovial and care-free, but by<br />\nno means lawless, among these young subjects<br />\nof King Alfonso XIII.<br />\nHowever studious, however poor he may be,<br />\nthe- Spanish student always finds time in the<br />\nevening to drop in at the café or the theatre.<br />\nThis is but natural in a country where the<br />\ncafé takes the place of home-life for the male<br />\nmembers of the family after the late dinner.<br />\nAt the little tables—of which there may be<br />\nfour hundred or more in the great building,<br />\nopen to the street—sit young and old, drinking, smoking, chaffing, watching the crowd.<br />\nThis café-existence is all-important in the student's life; yet it cannot be reckoned dissipation, since a single order ensures a seat for the<br />\nwhole evening, and even the most impecunious can afford to drink the red wine almost<br />\nlike water. Fifteen cents will buy a bottle of<br />\nfairly good vintage, containing about one and<br />\none-half pints. As in all wine-drinking countries of Europe, there is little intoxication in<br />\nSpain.<br />\nAt the theatre, too, the student feels thoroughly at home. Everybody in the college<br />\ngoes, two or three times a week. To this<br />\n<br />\nNo. 16<br />\n<br />\namusement also a scanty purse is no bar. The<br />\nTeatro ',or kora offers a succession of light<br />\ncomedies, operas, etc., every hour, with a<br />\nslight intermission; and for each performance,<br />\na good seat \"down in front\" costs but ten<br />\ncents. The orchestra, or pit is, in Spain, the<br />\ncheapest place in the theatre; the expensive<br />\nseats are the elevated stalls at the sides and<br />\nback. This is a survival of the original<br />\n\"courtyard\" theatre, where the common people poured into an enclosed courtyard to find<br />\nthe stage at one end, and the nobility and people of consequence in the balconies surrounding the court. In the present Spanish theatre,<br />\nthe balconies are low-priced towards the top,<br />\nand are much cultivated by the students. The<br />\nplays given are like our \"curtain-raisers,\" domestic farces or light operas. There is a great<br />\ndeal of dancing; the house always becomes attention at the click of the castanets, announcing the Sevillana with its supple, swaying,<br />\ngraceful body-movements, so different from the<br />\nFrench hopping and skipping.<br />\nThe students' highest jinks are on Innocents' Day and at the Carnival on Shrove<br />\nTuesday. In the afternoon he sallies forth,<br />\nmasked,and armed with bags of fiafielillos, bits<br />\nof paper cut so fine that it will bunch up<br />\ninto a ball that can be thrown some distance,<br />\nbut will burst at touch. He makes for the<br />\nPaseo, or public drive, where there is a grand<br />\ndress parade of everyone who can hire a carriage. Ah! a pretty face flashes by, and away<br />\nour student flies, jumps on the carriage steps,<br />\nand dashes, full in the girl's face, a bunch of<br />\nfiafielillos mingled with much gold tinsel. The<br />\ngirl smiles at him—the more tinsel the greater<br />\nthe compliment—and, hanging on the steps,<br />\nhe enjoys a flirtation until someone slings<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\npaftelillos down his neck, when he jumps off<br />\nand goes for his assailant. Perfect liberty is<br />\npeamitted, both from and towards any masker.<br />\nIn the evening our student starts out for<br />\nthe café, but has to run the gauntlet of the<br />\nbalconies, where are girls with bags of flour<br />\nand weighted rag balls attached to strings, just<br />\nheavy enough to smash a stiff hat. When he<br />\ngets to the café, he finds it humming with the<br />\nrevelers. The fun grows furious; he thoughtlessly runs across the open floor of the café in<br />\nhis disguise, and thereby invites upon himself<br />\na. shower of bread-crusts and rotten potatoes,<br />\nfor such is the custom.<br />\nThen he joins a merry throng in the gallery<br />\nof the theatre. The rates are reduced tonight<br />\nso the building is crowded, and there is a flow<br />\nof jocular comments on the performance.<br />\nMeanwhile the esludiante in the gallery is<br />\nmaking some diablillos—\"little devils.\" He<br />\ntears up his play-bill into narrow strips and<br />\nrolls these spirally into slender darts about<br />\nsix inches long, with one end pointed and the<br />\nother flat. This wide end he presses between<br />\nthe tips of his forefingers, and, drawing them<br />\nup and back, with a sharp jerk he shoots the<br />\n\"little devil\" into the lap of a pretty girl in a<br />\nbox below. She does not notice, for sometimes there are as many as a hundred in the<br />\nair at once. But he continues his bombardment, and at last he is rewarded by a little<br />\nsweep and flutter of the fan, the Spanish woman's telegraph of feelings. In a moment<br />\nthe duenna turns aside, and the marksman is<br />\nmade blissful by a swift glance and smile.<br />\nBut there is that \"pig\" who, they say, is engaged to her! and now a \"malicious devil,\"<br />\nwith a pin stuck in the tip, zips down and<br />\nstings the rival's arm.<br />\nIn such ways begin the love affairs of the<br />\nestudiante. He is very fond of the ladies, but<br />\nhe has a hard time to meet them. In the first<br />\nplace, no respectable Spanish girl is allowed to<br />\ncall on friends, or to receive visitors, without<br />\nthe presence and sanction of her mother or<br />\nother elderly relative. The express invitation<br />\nof the mother alone allows a young man to<br />\ncall, even though he is engaged to the girl.<br />\nSo the Spanish student's afaire du coeur<br />\n<br />\nrequires a deal of time and thought. If he<br />\nsees her first on the promenade, he must<br />\nshadow her, so persistently that she will notice<br />\nhim, and yet so unobtrusively that the duenna<br />\nwill not. Again a stolen look over the shoulder, with a signal of the eloquent fan, tells<br />\nthat the young lady is conscious of his existence, and he traces her to her home. Then<br />\nhe must, in student slang, hacer el oso,\"play<br />\nthe bear\"—walk up and down, in front of the<br />\nhouse, at a certain hour each day. Meanwhile, he makes inquiries about the girl, and<br />\ntries to get word to her through mutual acquaintances; and, if fortunate, some day he<br />\nmay see a handkerchief flutter behind the<br />\nwindow-bars. That night, muffled in his cafia,<br />\nor long mantle, he steals to the window, and<br />\nwhispers his important communi cations<br />\nthrough the iron bars. For every window at<br />\nall accessible is provided with a stout iron<br />\ngrating, an inheritance from the Moors, who<br />\nwished thus to insure the seclusion of their<br />\nladies. The suitor may here propose for the<br />\nyoung lady's hand; but, unless he is accepted,<br />\nhe may never reach a greater intimacy. So it<br />\ncomes that a pedestrian through the streets of<br />\nSeville, by night, sees iii his walk twenty such<br />\nshrouded figures leaning against the gratings,<br />\ntheir cloaks pulled high over the head by the<br />\nleft arm. If a student, he will say: \"Another<br />\nfellow eating iron!''<br />\nThe Spanish students are all great smokers;<br />\nfifteen to twenty cigarettes daily is an average<br />\nallowance. Cigars are costly, and pipes are<br />\nunknown. As with all the courteous Spaniard's conduct, the students have a most formal code of etiquette for smoking. Somebody<br />\nproduces a tobacco-pouch. No matter where<br />\nhe is, in a public conveyance or among strangers, he will offer the tobacco to all present.<br />\nThose who accept usually have their own pet<br />\nbrand of papers, and so the cigarettes are<br />\nquickly rolled. Then the first man, as convivador, or host, lights his own cigarette. But it<br />\nwould be a gross insult to offer a match for a<br />\n\"light,\" so he hands his weed, the lighted end<br />\nforemost, to the nearest man, who returns it,<br />\nmoistened end foremost,and forthwith passes his<br />\nown cigarette,now lighted,to his next neighbor.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nThese rules must be scrupulously observed.<br />\nTo throw away a cigarette which has been<br />\nreturned from lighting is a deadly affront, and<br />\ncalls for a duel.<br />\nThese student duels, of frequent occurrence,<br />\nare fought with the navaja, or clasp-knife.<br />\nThe ever-present cafia is rolled around the left<br />\narm as a shield, and the wounds are apt to be<br />\nin the left hand. The scene is generally a<br />\nstudents' room. There is no stabbing, the<br />\nknife is slashed only; and cuts for the face are<br />\nnot allowed. Since the fight may be stopped<br />\nat the option of the combatant who receives the<br />\nfirst wound, the duels are almost never fatal.<br />\nIntercollegiate athletics are unknown in<br />\nSpain. Fencing, hand-ball, and such games as<br />\nleap-frog, however, are popular, among them<br />\nthe \"bull-fight.\" The\"bull\" puts his hands<br />\non his knees, and may use only his shoulders.<br />\nThe \" Torero\" tries with his bands alone to<br />\noverthrow the \"bull.\" Elbow-wrestling is<br />\nalso a favorite amusement at the cafés. A<br />\nstudent, seated at a table with some stranger,<br />\nwill enter into a test of strength with him.<br />\nThe right arms are bent, the elbows leaned<br />\nside by side on the table, and the hands<br />\nclasped. He who, without moving his elbow,<br />\ncan force his opponent's hand back upon the<br />\ntable, enjoys a treat at the other's expense.<br />\nWhen he is at a \"blow-out\" with friends,<br />\nthe student must also be careful of the proper<br />\nform. In quantities of over a quart, wine is<br />\nusually in leather bottles or skins, with a slender tube in the neck for a mouth-piece. There<br />\nare no glasses; so each man, as the bottle comes<br />\naround, leans far back in his chair, assures<br />\nhimself that the mouth-piece is accurately<br />\nsituated at a short distance from his mouth,<br />\nand then elevates the skin, causing the stream<br />\nto pour down his throat. On no account must<br />\nhis lips touch the mouth-piece. If he can,<br />\nmoreover, depress his epiglottis, so that no<br />\naction of gulping is necessary for the descent<br />\nof the •wine, he is considered quite accomplished.<br />\nIt must not be thought that the estudiantes<br />\nare not good scholars. Indeed, many of them<br />\nat Seville were working their way through, in<br />\nvarious capacities ranging from a valet up-<br />\n<br />\n3<br />\n<br />\nwards. No record is kept of absences from<br />\nclass, and no questions are asked—the professor does not even know his students' names,<br />\nBut there is a \"repetition'' held after each<br />\nlecture by a \"quiz-master,\" by which the<br />\nsubject is thoroughly reviewed. The examinations are every three months, and at the finals<br />\nare very severe, so that any trifling meets with<br />\na speedy end.<br />\nThe Spanish students are reckless youth,<br />\nwith their fun and frolic and moonlight guitars.<br />\nYet they are seldom too wild; and everywhere<br />\nand at all times, they have the traditional<br />\ncourtesy that makes the Spaniard the most<br />\ndignified man of all nations.<br />\nVI OE' Vff'<br />\n<br />\nMEDICAL SCHOOL ITEMS.<br />\nCommencement of the Nurse's TrainTHE<br />\ning School connected with the Johns Hopkins Hospital will be held on Friday afternoon,<br />\nMay 24th, in one of the hospital buildings.<br />\nThe graduating class numbers eighteen.<br />\nsir W<br />\n<br />\nMr. Ed. H. Hume, Yale '97, of Bombay,<br />\nIndia, who has been following the medical<br />\ncourse at Hopkins for the past four years, has<br />\nbeen elected International Student to Great<br />\nBritian. On his graduation here, Mr. Hume<br />\nwill leave for Liverpool, where he will pursue<br />\nhis studies further.<br />\n.1116<br />\n<br />\n.1i6<br />\n<br />\nThere are about seventy physicians in attendance upon the post graduate courses in<br />\nMedicine at the Johns Hopkins Medical<br />\nSchool. These courses last during the months<br />\nof May and June, and draw graduated physicians from all parts of the country to Hopkins.<br />\nar<br />\nMr. Warfield T. Longcope has been appointed Pathologist at the University Hospital,<br />\nPhiladelphia.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\ntbe 1ilevni3.1Lcttcr.<br />\nPublished Portnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nMAY 23, 1901.<br />\nSubscription Si<br />\n<br />\nEditor in Chief,<br />\n.<br />\n.<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\n<br />\nto cents a single copy.<br />\n<br />\nper vcItr.<br />\n<br />\n.<br />\n<br />\n.<br />\n.<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nWILLIAM B, HILL, 1902,<br />\nSOL STROME, 1902.<br />\nBBEN C. HILL, 1902.<br />\n{ROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\n1:3YMAN C. MURPHY, 1902.<br />\nJOHN M. BANDEL, 1901.<br />\n. .<br />\n. AUBREY PEARRE,JR., 1902.<br />\n.<br />\n<br />\nAddress all articles, communications,etc.,to WILLIAM B. HILL.<br />\nbox 269,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJOHN M. BANDEL, box 94, J H. U.; or box 398, Medical School of<br />\nJohns Hopkins Hospital.<br />\n<br />\nis not alone in its misfortunes.<br />\nHOPKINS<br />\nWe extend sympathy and regret to Lafayette College, which has recently lost one of its<br />\nablest professors—Dr. Thomas Conrad Porter,<br />\nDean of the Pardee Scientific Department.<br />\nAsir W<br />\n<br />\nlast the efforts of\"Mac\" are rewarded,<br />\nATand<br />\nHopkins will have a gallery added to<br />\nthe cage. In connection with this latest improvement, it would perhaps be well to direct<br />\nthe attention of some of those profound critics<br />\nwhose superior wisdom qualifies them to correct the mistakes (?) made by our Physical<br />\nDirector, to a few of the innovations and improvements made by him during his incumbency of office.<br />\nWhen Mr. Mackdermott accepted the position as head of the athletic department of the<br />\nJohns Hopkins he found athletics in a lamentable condition. Since then he has remodeled<br />\nthe entire athletic system of the University;<br />\nimproved and lighted with electricity the cage,<br />\nsecured suitable athletic grounds, and last but<br />\nnot least, coached winning teams. It would<br />\nbe well if certain of his detractors would pause<br />\nto consider a few of these things. However,<br />\n<br />\nwe are willing to be enlightened, and perhaps<br />\nsome of these sage critics can suggest a better<br />\nman for the position. Now is your chance,<br />\ngentlemen, speak up! but remember, we need<br />\na man who can do something besides put on a<br />\nlovely pair of tights and do\"stunts\" on the<br />\nhorizontal bar. Up to this time the NEwsLETTER has refrained from entering this<br />\ncontroversy, but when the vital interests of<br />\nHopkins athletics are involved it is time something should be said in the matter. Under<br />\nthe present regime Hopkins athletics are<br />\nmore flourishing than ever before, and their<br />\nwelfare should not be sacrificed for the gratification of a few critics whose knowledge of<br />\nathletics is very limited, and whose contributions to the same have been mainly of the<br />\n\"hot-air\" variety.<br />\nApropos to this we publish a letter from the<br />\nPresident of the Athletic Association regarding a certain poem published in the \"Hullabaloo.\" In the effort to display wit (?) the<br />\nwriter of the poem not only sacrificed truth,<br />\nbut showed himself wofully incompetent to<br />\nwrite upon a subject which he evidently knows<br />\nnothing about. THP; NEws LETTER hopes<br />\nthat these puerile attempts to injure the best<br />\ninterests of Hopkins will be abandoned, and<br />\nthat in the future all our men may have one<br />\naim—namely, the honor and welfare of the<br />\nBlack and Blue.<br />\n<br />\nEditor of News-Letter.<br />\nAlthough the i9oi Hullabaloo is an excellent<br />\nproduction, it contains several articles that<br />\nshould never have been allowed to appear.<br />\nIt is one thing to ridicule, in a good natured<br />\nway, the peculiarities of a member of the faculty, and quite another thing to endeavor to<br />\nruin his reputation by making all sorts of insinuations as to his habits and character.<br />\nThe author of the poem \"Drink Deep\" has<br />\nnot only done the present Director of Athletics a great injustice, but has shown very clearly that he, the author, does not know what he<br />\nis talking about. I have no desire to belittle<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nthe work done by our former instructor, because he and I were, and are still, the best of<br />\nfriends, but the author of the poein should<br />\nhave been very sure that he could firove that<br />\nour present instructor has ever used \"unfair<br />\nmeans\" to make our teams win. I do not<br />\nknow who the author of this poem is, but I<br />\nventure the prediction that he is one of the<br />\n\"side line\" athletes who never played on a<br />\nteam in his life, but who was always very liberal with his criticism of those who worked.<br />\nAgain—can it be possible that the editors of<br />\nthe Hullabaloo still believe that Mr. Mackdermott had anything to do with the handicapping that caused so much bad feeling after our<br />\ngames at the armory? Yet, if they do not believe this, why did they permit the insinuation<br />\nthat is so evident in the illustration of the<br />\n\"Professor's Library\" ? Why do not the gentlemen who write such articles and who have<br />\nbeen so busy circulating the slanderous reports<br />\nabout the University and about town, come<br />\nout boldly and make definite charges against<br />\nthe Director of Physical Training, that he may<br />\nbe able to defend himself, and stop all this miserable squabbling that has been going on ever<br />\nsince the football trouble last fall.<br />\nIt is quite evident what the object of these<br />\ngentlemen is, and I would like to ask them<br />\nthis one question—suppose you succeed, by<br />\nthe persistent circulation of your rumors of<br />\n\"crooked\" work (none of which you have<br />\nbeen able to prove), in causing Mr. Mackdermott to resign;—what then? Have you a successor of equal, or anywhere near equal ability,<br />\nselected who will take his place, at the very<br />\nsmall salary which we can afford to pay? I<br />\nhave asked this question a number of times<br />\nand have not yet received an answer.<br />\nTo realize what Mr. Mackdermott has done<br />\nfor Hopkins Athletics it is only necessary to<br />\nread the present Hullabaloo and one of six or<br />\neight years ago. As to \"crooked\" work, I<br />\ncould mention various examples in that line<br />\nthat occurred long before Mr. Mackdermott<br />\nhad anything to do with our athletics.<br />\nIt is doubtless true that some of those who<br />\nhave been circulating these rumors, really be-<br />\n<br />\n5<br />\n<br />\nlieve them to be true, but they do not seem to<br />\nrealize that they are seriously injuring our<br />\nathletic reputation, as well as the reputation<br />\nof the Director of Athletics, by this method<br />\nof procedure.<br />\nIf the author of \"Drink Deep\" really has<br />\nthe interest of Hopkins Athletics at heart, let<br />\nhim make formal charges, in writing, against<br />\nthe Athletic Director, and lay these charges,<br />\nthrough Dr. Renouf, before the board for investigation.<br />\nIn the meantime,—no more of these unproved rumors against the man who has done<br />\nso much to place Hopkins in the place she now<br />\nholds in the athletic world.<br />\nALBERT M. Rimsn,<br />\nPresident Athletic Association.<br />\nWWW<br />\n<br />\nA SPLENDID OPPORTUNITY.<br />\nseems indeed a blessing that once a year<br />\nIT the<br />\nstudents of the various Universities<br />\nare given an opportunity to assemble under<br />\nthe cool pines of East Northfield, Conn., and<br />\ntalk over common interests and discuss the<br />\nevents of the day.<br />\nHere there is no chance for class politics<br />\nor fraternity factions creating disagreeable<br />\ncliques. No feeling can exist but that of true<br />\n'Christian friendship. It is hoped that this<br />\nyear more Hopkins men will make use of the<br />\nopportunity thus offered to know one another<br />\nbetter, and to mingle with the students of<br />\nother Universities.<br />\nThe date of opening is Friday, June 28th,<br />\nand of closing, Sunday night, July 7th, 1901.<br />\nFrom present indications, it is sure that the<br />\nattendance of the Conference, as a whole, will<br />\nbe larger and more representative than ever.<br />\nA word as to what the Convention really is,<br />\nfrom a Hopkins man who was there, may be<br />\nof value.<br />\nLast year the total number of fellows at<br />\nNorthfield was six hundred. Yale and Princeton had the largest delegations, Yale having<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nover one hundred men, and Princeton just<br />\nabout one hundred. But, altogether, there<br />\nwere men present from one hundred and fiftytwo different Colleges and institutions of learning. The men represented twenty-four different Christian denominations, though some<br />\nof them did not belong to any.<br />\nAt the Conference, as much of the morning<br />\nas each man chose could be used in attending<br />\ndifferent meetings, of which there were four,<br />\neach lasting but one hour, and beginning at<br />\n8 A. M.<br />\nThe long afternoons were then given up to<br />\nrecreation. Yale, Harvard, Amherst, Princeton, Williams, Brown, and several other Colleges, played for the baseball championship.<br />\nSome splendid tennis playing was also done<br />\non the twelve courts, where the tennis tournament came very near being won by a Johns<br />\nHopkins man. The fellows that didn't care<br />\nfor baseball or tennis, were either playing<br />\ngolf, climbing mountains, or rowing on the<br />\nwaters of the historic Connecticut.<br />\nIn the evening, about sunset, there was<br />\nalways a meeting held on \"Little Round<br />\nTop,\" where different life-works were presented to the men for consideration. Then,<br />\nat 8 o'clock, came the regular evening platform address, after which everyone started for<br />\nthe camp. Now,some of the men lived in the<br />\nNorthfield Seminary buildings near the large<br />\nAuditorium, but the majority dwelt in tents<br />\non the mountain side, in a tall forest of tall<br />\nCathedral pines, whose fallen needles have<br />\nbeen many years in spreading a thick carpet<br />\nround about our tents. The tents are erected<br />\non'small board platforms, scattered amongst<br />\nthe trees, within hearing distance of the big<br />\ngong on the rustic \"hash-house,\"to which place<br />\nthere is a general stampede at 7 A. M.,<br />\nP. M., and 6 P. M. The camp is about half<br />\na mile from the Auditorium, and is delightful,<br />\nboth in equipment and situation.<br />\nAmong the many pleasant memories of the<br />\nConference last Summer, there is only space<br />\nto mention the gigantic bonfire on the evening<br />\nof July 4th, and the tremendous enthusiasm<br />\nof the Patriotic Celebration, on that same<br />\nevening, when, into the large Auditorium<br />\n<br />\nmarched the many delegations, each singing<br />\ntheir own College song, and then each delegation, composed of five or more men, sang to<br />\nthe others a verse or so of its College song.<br />\nThe Hopkins should have at least twenty-five<br />\nmen this year to sing \"'Rah for the Black<br />\nand Blue !\" and give a good old Hullabaloo.<br />\nPigeons were flying about the building with<br />\nPrinceton flags attached. The Canadian Colleges were shouting,\"Rule Britania.\" The<br />\nenthusiasm beggars all attempts at description.<br />\nIt is, indeed, well worth your while to go<br />\nto Northfield, if only for the above reasons.<br />\nBut there are still others. These pleasures<br />\nwere enjoyed by the writer, they may be enjoyed by you ; but, like all others of their<br />\nkind, in a few weeks they have gone, and you<br />\nhave only their memory. But, at Northfield<br />\nyou can get more than this. Rev. Campbell<br />\nMorgan, of London, Mr. Robert E. Speer, of<br />\nNew York, and President Seth Low, of<br />\nColumbia University, will speak ; and they<br />\nare men who know how to speak to men.<br />\nBut, of more value even than the talks, perhaps, is the life—the very essence of life, with<br />\nwhich you feel yourself surrounded. You are<br />\nfilled with a splendid optimism. You feel you<br />\nare beginning to see things in a new light, in<br />\na true light; and that is the goal of us all.<br />\nYou see about you, men who are true to themselves and to others, and you feel that you<br />\nyourself can become the same.<br />\nInformation as to expenses, etc., may be<br />\nobtained from H. F. Perkins, or from A. R.<br />\nBird, who will be only too glad to answer any<br />\neiuestions, and give information to those who<br />\nbelieve they may be able to go there.<br />\nW<br />\n<br />\nW<br />\n<br />\nUNIVERSITY NEWS NOTES.<br />\nJ. M. Vincent, Acting Director of the<br />\nDR.Historical<br />\nDepartment, is back at the<br />\nUniversity, after an illness of several days.<br />\n<br />\nPresident Gilman has been notified of his<br />\nre-election as vice-president of the Archaeological Institute of America.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nDr. Herbert B. Adams is about to leave Baltimore for Amherst, Mass., where he will<br />\nspend a week before going to Nova Scotia for<br />\nthe summer.<br />\nw w sr<br />\nPresident Gilman delivered an address at<br />\nGirard College on the 22d. He will also be<br />\nthe Commencement Day Orator at the Woman's College.<br />\nsr w<br />\nThe Phi Beta Kappa Initiation of the members elected at the recent meeting was held<br />\nFriday of last week, at 5 o'clock, in the Donovan Room.<br />\nWWW<br />\n<br />\nJames Wriner Harry, graduate in the Historical Department, has just been appointed<br />\nFellow in History for the next year. He succeeds Wm. E. Martin, who will take his doctor's degree. Mr. Harry is an A. B. of<br />\nGeorgetown College, Kentucky, 1899.<br />\nsr w sr<br />\nAn invitation has been received from the<br />\nImperial College of Agriculture, at Sapporo,<br />\nJapan, for their twenty-fifth anniversary,<br />\nwhich was held May 14th. Two graduates of<br />\nthe University are now members of the Sapporo Faculty; Dr. Sato, the acting director,<br />\nand the professor of historical science.<br />\nW W W<br />\n<br />\nGen. Lloyd L. Jackson delivered an address<br />\nto the Senior Class, on Tuesday of last week.<br />\nSubject: \"The choice of a business career for<br />\ncollege men.\" Gen. Jackson laid especial<br />\nemphasis on the growing need, in business<br />\npursuits, of men of good education and integrity.<br />\nw sr sr<br />\nThursday of last week the University was<br />\nvisited by a party of nine gentlemen from<br />\nCuba, and one from Porto Rico, who have<br />\nbeen attending the National Conference of<br />\nCharities in Washington. These visitors are<br />\ninspecting the methods of education and charitable work in this country, and were invited<br />\nby President Gilman to come to Baltimore.<br />\nLieut.-Col. McHardy, of Edinburgh, Scotland,<br />\nwas also present.<br />\n<br />\n7<br />\n<br />\nA novel course inAmerican history and diplomacy has been arranged for the graduate students in the Historical Department. An excursion will be made every Saturday to the<br />\nCapitol at Washington, where Dr. J. M.<br />\nCallahan, Albert Shaw lecturer on diplomatic history, will explain the important<br />\ndocuments in the State Department and Congressional Library.<br />\nWWW<br />\n<br />\nMarathon M. Ramsey, a graduate student<br />\nin Romance Languages, has been appointed<br />\nProfessor of Spanish in Leland-Stanford University. Mr. Ramsey is a graduate of Columbian University, where he obtained his A. M.<br />\nin 1895. He was for some time in the Secret<br />\nService of the U. S. A., and was associated<br />\nwith Lieutenant Rowan, who made the famous<br />\ntrip across Cuba. Mr. Ramsey has written<br />\nseveral books on the Spanish language; his last<br />\none is now used as a text-book in the public<br />\nschools of Cuba.<br />\n<br />\nTHE 1901 ',HULLABALOO.\"<br />\nyear's Hullabaloo is out at last! AfTHIS<br />\nter such a long wait, a good course is<br />\nexpected, and the appetites are sharpened for<br />\nthe meal, prepared after arduous work by the<br />\nBoard, who are cooks, stirrers, and tasters, in<br />\none. This year's book is certainly up to expectations. Everything in it has been gotten<br />\nup with great care, and what is the main<br />\nobject of the book, it makes one laugh. To<br />\nhave heard the laughter of about fifty men,<br />\nlounging around the entrance to McCoy, last<br />\nThursday, reading the Hullabaloo, would be<br />\nsufficient evidence that it is being enjoyed.<br />\nEverybody must buy a Hullabaloo.<br />\nIn our opinion, the Board of Editors has<br />\nmade a mistake in adopting the class colors<br />\non the cover of the book. They form a neat<br />\ncombination, but have not the Hopkins individualism of the Black and Blue. Especially<br />\nis the policy poor when we remember that the<br />\ncolors of naughty-one are also the colors of a<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nlocal University which also publishes a year<br />\nINTER-COLLEGIATE MEET.<br />\nbook.<br />\nThe class drawing, in colors, is an innova- NOTWITHSTANDING the elements, the<br />\ntion that is bound to please. The illustrations,<br />\nfew people who went out to Electric<br />\nall through the book, are far superior to those Park Saturday afternoon, the i8th, witnessed<br />\nusually seen in a College annual, for they lack one of the most successful spring track and<br />\nalmost all traces of amateurism. There is field meets of the Maryland Intercollegiate<br />\nnothing so draws a reader as attractive illus- Athletic Association ever held. The games<br />\ntrations, and the class of 14901 can feel itself were a fine exhibition of endurance, in which<br />\nlucky in having on its roll men of such artistic several State records were broken by Hopkins<br />\nability as their productions in the Hullabaloo men ; and had it not been for a ruling of the<br />\ngive evidence of.<br />\nreferee, a total of four records would have<br />\nThe general reading matter, or record of easily been smashed.<br />\nCollege events, is arranged in a pleasant,<br />\nAll the events were splendidly contested by<br />\ninteresting order. In the roasts and grinds on the representatives<br />\nof the Colleges composing<br />\nProfessors, students, and \"characters,\" no the Association.<br />\nBut the wearers of the Black<br />\nviolent extremities have been reached, and no and Blue came<br />\nout victors with a good margin.<br />\none can feel hurt by the \"gentle\" knocks.<br />\nWestern Maryland was an easy second with<br />\nThe book contains many original ideas, very St. Johns third.<br />\nwell executed. The race for the presidency<br />\nThe one hundred, and two hundred and<br />\nis one of the most novel illustrations that has twenty yards<br />\ndashes were won, hands down,<br />\nappeared in a Hullabaloo for years.<br />\nby Horace Whitman, whose work all the<br />\nWe congratulate the Board on having scat- season has been superb.<br />\nIn the two hundred<br />\ntered its jokes on different members of the and<br />\ntwenty yard dash, he broke the Maryland<br />\nFaculty, instead of on one poor, harmless record by 2-5<br />\nof a second. The relay was won<br />\nDoctor. The feat was hard to accomplish, but by<br />\nHopkins in the record-breaking time of<br />\nsuccess has crowned their efforts.<br />\n3 minutes 34 3-5 seconds. In the four hunTHE NEWS-LETTER congratulates the class dred and forty<br />\nyard dash Riggs ran well, but<br />\nof 1901 on its successful year book, and adwas beaten out by Patterson of Western Maryvises everybody to buy one or more copies.<br />\nland,.while England in the half-mile run was<br />\nMr War<br />\nclosely pressed by Crane of St. Johns.<br />\nMorfit Mullen, captain of the '99 team, ran<br />\nOUR NEW GALLERY.<br />\nan exhibition quarter of a mile to try and<br />\ncarpenters are now at work, adding to break the State record held jointly by Hamthe cage our long-felt want—a gallery. mill and himself, and made several years ago<br />\nIt is needless to state that this improvement, in 54 seconds. He was paced by two shortbrought about through the efforts of \"Mac,\" distance sprinters. He was able to reduce the<br />\nwill be beneficial to spectators and athletes time to 52 1-5 seconds, after a beautiful run.<br />\nThe gatnes were under the supervision of<br />\nalike, for, by keeping the former off the track<br />\nand in-field, it will prevent, to a great extent, Prof. Win. M. Mackdermott as clerk of the<br />\nruts and furrows in the ground of the cage, course, and were speedily run off by him and<br />\nhis assistants, Mr. George E. Lamb, of the<br />\nwhich prove dangerous to the runners.<br />\nThe gallery will be sixty-five feet long by Baltimore Athletic Club, and Mr. Thomas J.<br />\nten wide the four tiers of seats, raised one Martin, of St. Leo's Gymnasium.<br />\nabove the other, giving a seating capacity of<br />\nHopkins won firsts in all the field events.<br />\nabout three hundred. Entrance to the gallery Scholl came out first in the running high<br />\nwill be by the door leading from the entrance jump, without any trouble; Garrett, second;<br />\nhall of the gymnasium building.<br />\nCromwell, St. John's, third. In the running<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nbroad jump,Pessagno, Garrett and Scholl,were<br />\nwinners of the first three places; in the shotput, Garrett, Roberts, the young gidnt from<br />\nW. Md. C., and Stone, carried off the medals;<br />\nthe hammer throw was also won by Garrett,<br />\nwith Roberts and Humphreys second and<br />\nthird, respectively.<br />\nThe results of the field events are as follows:<br />\nOne Hundred Yards Dash—Horace Whitman, Johns Hopkins University, first ; H. S.<br />\nRiggin, Western Maryland College, second;<br />\nEugene L. Pessagno, Johns Hopkins University, third; W. W. Weedqn, Johns Hopkins<br />\nUniversity, fourth. Time, .To 3-5. Garey<br />\nand Cromwell of St. John's College, Parris<br />\nand Krauss of Western Maryland College and<br />\nAtkinson of Johns Hopkins University also<br />\nran.<br />\nTwo Hundred and Twenty Yards Dash—<br />\nHorace Whitman, Johns Hopkins University,<br />\nfirst; H. S. Riggin, Western Maryland College, second; W. W. Weedon, Johns Hopkins<br />\nUniversity, third ; A. B. Atkinson, Johns<br />\nHopkins University, fourth. Time, .23. W.<br />\nE Hoffman, T. F. Riggs and E. L. Pessagno,<br />\nJohns Hopkins University; Garey, Wells,<br />\nBradley, Torbert, Halbert, Cromwell, St.<br />\nJohn's College; F. B. Krauss, L. H. Chaffinch, J. W.Parris, Western Maryland College,<br />\nalso ran.<br />\n<br />\n9<br />\n<br />\nOne Mile Relay—Johns Hopkins University,<br />\nfirst ; Western Maryland, second. Time,<br />\n3.34 3-5. The teams ran as follows: Johns<br />\nHopkins, Riggs, Hoffman, England, Whitman; Western Maryland, Patterson, Stansbury, Krauss, Riggin; St. John's, Roberts,<br />\nGarey, Bradley, Halbert.<br />\nw w or<br />\nTENNIS TOURNAMENT.<br />\nThe annual Spring contests for the tennis<br />\nchampionship of the Maryland Intercollegiate<br />\nAthletic Association took place in the cage of<br />\nthe Johns Hopkins University Wednesday<br />\nmorning, and resulted in complete victory for<br />\nthe Hopkins men.<br />\nSt. Johns College, Western Maryland College and John Hopkins University were represented in the tournament, three entries being<br />\nallowed, one for the singles and two for the<br />\ndoubles. The following men were chosen to<br />\nrepresent their college:<br />\n<br />\nJohns Hopkins—Camillus Bush, in the singles, and George B. Scholl and C. Bush in the<br />\ndoubles.<br />\nSt. John's—E. H. Burwell and E. S. Powell<br />\nin the doubles, and Edward Duvall in the<br />\nsingles.<br />\nWestern Maryland—E. A. Cobey and F. L.<br />\nJohns in the doubles, and F. R. Holt in the<br />\nsingles.<br />\nFour Hundred and Forty Yards Dash—H.<br />\nThe contest began at io o'clock with a match<br />\nC. Patterson, Western Maryland College, first; between Duval of St. John's and Holt of<br />\nT. F. Riggs, Johns Hopkins University, Western Maryland. Duval won in two straight<br />\nsecond; J. E, Tyler, Johns Hopkins Univer- sets—score 6-o and 6-2. In the doubles the<br />\nsity, third ; E. E. Tarr, Western Maryland thing was reversed, and Western Maryland<br />\nCollege, fourth. Time,.54 2-5. Humphreys won out. Burwell and Powell won the first<br />\nof John Hopkins University, and Cronin of set by a score of 6-2 ; but Cobey and Johns<br />\nSt. Johns College also ran.<br />\ngot the next two sets, score 6-0, 6-2.<br />\nHalf Mile Run—J.T. England, Johns HopHopkins having won the championship last<br />\nkins University, first ; Crane, St. John's Colhad to play the winners of the preliminaries.<br />\nlege, second ; B. A. Stansbury, Western<br />\nthe singles Bush won two straight sets from<br />\nIn<br />\nMaryland College, third; W. H. Thatcher,<br />\nDuval, 6-2, 6-3. In the doubles Bush and<br />\nJohns Hopkins University, fourth. Time,<br />\nScholl beat Cobey and Johns, 6-1, 6-o.<br />\nAdler and Humphreys of Johns<br />\n2.10 4-5.<br />\nThe winners of each event were awarded<br />\nHopkins University, Roberts and Hall of St.<br />\nwhich had been prepared by the Intermedals,<br />\nWestern<br />\nof<br />\nTreadway<br />\nand<br />\nCollege,<br />\nJohn's<br />\nAssociation.<br />\ncollegiate<br />\nran.<br />\nalso<br />\nCollege<br />\nMaryland<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n_<br />\n<br />\nLACROSSE.<br />\nseason of 1901 has been one<br />\nTHEofLacrosse<br />\nthe most successful we have seen,<br />\nthough it did not land us another championship. This year we endeavored to play the<br />\nvery best teams in the country, having little<br />\nidea that we could be so successful as we have<br />\nbeen. It being our stated policy to vie with<br />\nsuperiors, andl ose or win, as the case may be,<br />\nwith honor, rather, than to win with ease from<br />\nweaker teams.<br />\nIt is true we started our season this year<br />\nwith the most sanguine hopes. Last year we<br />\nlost three of the best Lacrosse men we ever<br />\nhad; MacInnes, whose place at in home we<br />\nhardly expected could be filled, Baetjer, whose<br />\ngoal-protecting ability was unequaled, and<br />\nFoster, whose strong third defense field play<br />\nwas unexcelled.. Then, too, \"Billy\" Maddren<br />\ncould not be with us to inspire, encourage and<br />\nstrengthen us. Knowing these difficulties, and<br />\napparently having no one at hand to fill these<br />\nvacancies, and a free-for-all open season in<br />\nprospect, could we expect any more than<br />\nto play our best and lose? Contrary to our expectations we have had even a more glorious<br />\nseason than heretofore.<br />\nOur first game opened as usual with the<br />\n\"All Baltimores\" who under the captaincy of<br />\nMaddren fully expected to win. But by steady,<br />\ncareful playing of our new team, J. H. U. won<br />\nby a score six to one.<br />\n•<br />\nIn this game it could be seen that even<br />\nthough our men were small they were capable<br />\nof putting up a fair game of Lacrosse. Again<br />\non April r3th, the Lacrosse Team from the<br />\nUniversity of Pennsylvania visited us, and at<br />\nAmerican League Park, in a hard, well contested game, we landed another victory for the<br />\nBlack and Blue.<br />\nThe Team of Teams, the Champions of the<br />\nthe Country, The Crescents, we played next.<br />\nWith the feeling of almost certain defeat, but<br />\nnot with the usual nervousness, our Lacrosse<br />\ntwelve appeared on Crescents' field in a pouring rain.<br />\nTo the surprise of all, our magnificent team<br />\nwork won, thus making us the first College<br />\n<br />\n:77<br />\n<br />\nteam that has beaten the Crescents for twelve<br />\nyears. It was, according to the Crescents, the<br />\nbest exhibition of scientific Lacrosse that they<br />\nhave seen, and they fully complimented our<br />\nboys. It is a fact, and unprecedented, that<br />\nthere was not a miss-pass nor a miss-catch on<br />\nHopkins' side during the whole game.<br />\nWith our hopes now raised, we entered the<br />\ncontest with City College of New York, at<br />\nElectric Park, and the fourth successive victory was won for the Black and Blue. Score<br />\nseven to one.<br />\nOn May the fourth, with Columbia, we had<br />\none of our hardest games, though comparatively easy victory. J. H. U. were victors by<br />\na score of seven to one. On the following<br />\nMonday, the sixth, before we had recovered<br />\nfrom the Columbia game, we were on the field<br />\nagainst our supposed hardest proposition; Harvard. But by good, clean, clever work another victory was insured for Hopkins, score<br />\nfour to naught. But this came not without<br />\nvery adverse results. The boys who were cut<br />\nup somewhat in the Columbia game were made<br />\nworse by the severe checking of Harvard, and<br />\na few of us were knocked out, causing no vain<br />\nhopes at Swarthmore. Not being able to practice for the following Saturday's game at<br />\nSwarthmore, our team endeavored to rest and<br />\nget in shape, but at Swarthmore it was evident<br />\nthat this was not accomplished. In one of the<br />\nhardest fought games of Lacrosse J. H. U.<br />\nhas witnessed, the Black and Blue lost the very<br />\nfirst game in four years to a college, Swarthmore. It was a hard fought game in every<br />\nsense, and the superior physical condition of<br />\nSwarthmore showed up in beautiful form, giving them the game four to two.<br />\nThus the season for 1901 ended, with six<br />\nvictories and one defeat, making one of the<br />\nbest records in Hopkins Lacrosse.<br />\nGoals scored: J. H. U. 33; Opponents 9.<br />\nGoals scored by Putts . . . . .ii<br />\n\" Hatch . . . . 7<br />\n\" B. Bernbeim . . 8<br />\n\" J. Bandel . . . 5<br />\n\" Abercrombie .<br />\n\" Straus<br />\nR. T. A.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nMR. DOOLEY ON LACROSSE<br />\n<br />\nI1<br />\n<br />\nEXCHANGE PLACE.<br />\n<br />\n(With apologies to P. P. Dunne)<br />\n<br />\nY. S. ESREVNOC.<br />\n44MARTIN,\" said Mr. Hennessy the other<br />\nday, \"pwhat have ye found in the paper<br />\nthet's absorbin yer atthention so that ye've let<br />\nyir poipe go owt? It must be exthramly intheresting t' ye.\"<br />\n\"Well,\" said Mr. Dooley, \"Oi've been radin<br />\nabout th' Lacrosse game.\"<br />\n\"The Lacrosse game, pwhat's thet?\"interrupted Hennessy.<br />\n\"Thet's just pwhat Oi asked Hogan's bye<br />\nth' ither day whin he came in with his face all<br />\nbr-ruised up, an he sed 'it's lacr-rosse Oi've<br />\nbin playin,' ses he 'all wan iv th' la-ads strruck me over th' head with a stick.' Oi hope<br />\nye lathered wan with your shillalah me bye,<br />\nses Oi. 'Ye don't understand' ses he, ''twas<br />\nin the game an it didn't mather f'r Oi kept th'<br />\nball an' our team wan. Would ye bike t' see<br />\nthe'game Mr. Dooley?' Thet Oi would ses Oi.<br />\nSo Hagan's bye br-rought me a thicket an'<br />\nOi wint t' see th' game.<br />\nThere was about two dozen fellows there in<br />\nsthriped shirts an'—well they looked loik the'd<br />\nfeegot t' put on their tr-rousers. They had a<br />\nball about th' soize av a limon, all' they threw<br />\nit around in little nets on th' ends av their<br />\nsthicks, and th' way they ran with it wud<br />\nmek yer hair sta-and on end, an' shafin at each<br />\nither with th' sthicks, all' they all wud get<br />\ninto a bunch in wan end av thr field an' somebody wud holler, \"Sh-shoot!\" and then the<br />\ncr-rowd wud yell bike ma-ad, fer they kept it<br />\nup f'r half an hour or more-re, but Oi didn't<br />\nsee anywan sh-shoot ath-all.<br />\n'Twas a gr-reat game, so Hogan's bye thold<br />\nme, th' gr-reathest game on earth, an' Oi war<br />\njust radin' th' iccount av it in th' pa-aper.<br />\nAnd he lit his pipe and went out.<br />\nww w<br />\n<br />\nTHE GOOD OF IT.<br />\nShe: That was a fortunate occurence at the<br />\nTower of Babel.<br />\nHe: I don't know, why?<br />\nShe: Just think how uncultured it would be<br />\nnot to know French.<br />\n<br />\nQuery:—Would the President of a criminal<br />\nclub be a Vice-President?<br />\n—U. of Chicago Weekly.<br />\nwww<br />\nProf: \"Tell me the name of the tropical belt<br />\nnorth of the Equator.\"<br />\nStudent: \"Can't sir.\"<br />\n.Prof: \"Correct, That will do.\"<br />\n—Ex.<br />\nw w w<br />\nNo doubt the careless yachtsman<br />\nWho casts anchor from o'er head,<br />\nDisturbs the chamber-mermaid<br />\nWho makes the oyster bed.<br />\n—Tiger.<br />\nW<br />\n<br />\nGrind: I find the way to learning decidedly<br />\nhard and long.<br />\nSport: Why don't you take a few cuts?<br />\n—Lampoon.<br />\nfir<br />\n<br />\nW<br />\n<br />\n'CELLO AND L<br />\nI went to call the other night<br />\nAnd, as she wished, I took my 'cello;<br />\nHer mother liked to hear me play,<br />\nSo in the room she had to stay;<br />\nI played till ten, then came away—<br />\nNothing doing.<br />\nI then bethought me of a plan<br />\nHow, when I went the week ensuing.<br />\nThere might, perchance,—Oh! Crafty man—<br />\nBe something doing.<br />\nI went again, this time supplied<br />\nWith a trusty penknife by my side.<br />\nThen just as I began to play,<br />\nShe chanced to turn her head away,<br />\nI cut my string—<br />\nSnap! \"That's too bad,<br />\nIt was the only A I had.\"<br />\nAnd so that night I couldn't play,<br />\nAnd mother didn't care to stay—<br />\nPlenty doing!<br />\nHoward J. White, in \"The Bruonian.\"<br />\nWI'•11r slIr<br />\n<br />\nFirst Fair One: Yes, Clarice laces awfully.<br />\nSecond Fair One: Really! I suppose it is a<br />\nmere matter of form.—C. C. N. Y. Arercury.<br />\n<br />\n\fMEMBERS OF<br />\n<br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br />\n<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br />\n<br />\nCALL ()\\<br />\n<br />\nJAS. H. DOWNS,<br />\n229 N. eitaRLEs ST.<br />\nMASONIC TEMPLE.<br />\n<br />\nCLINTON P. PAINE cSc CO.<br />\nBANKERS<br />\n<br />\nAND<br />\n<br />\nPOR Class, Fraternity roid College Stationery, Banquet Cards,<br />\n<br />\nBROKERS,<br />\n<br />\n217 EAST GERMAN STREET,<br />\nBALTIMORE, MD.<br />\n<br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br />\n<br />\nSMOKE UP! RAH! RAH! RAIN! HOPKINS!!<br />\nTS<br />\n<br />\nANYTHING IN TOBACCO YOU WANT<br />\n<br />\nGO TO<br />\n<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nThe Chas, Willms Surgical Instument Co,<br />\nBENJ. A. NELSON, GEN.L. MANAGER.<br />\n<br />\nI. D. LANG, TOBACCONIST,<br />\n<br />\nPhysicians,' Surgeons,' Hospital and hmalid Supplies.<br />\nFine Microscopes and Accessories,<br />\n<br />\n833 MADISON AVENUE<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br />\n<br />\n•<br />\n<br />\nBOX T RADE A SPECIALTY.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n300 N. HOWARD ST.<br />\n<br />\nDrovers St Mechanics National Bank of Baltimore.<br />\nSurplus and Profits, $350,000.<br />\n<br />\nCapital.Stoek $300,000.<br />\n<br />\n5 WEST<br />\n<br />\nMUELLER,<br />\n<br />\nIN THE CITY.<br />\n<br />\nJar .9?on, $3.00 and 71,cnva.rd.<br />\n<br />\nMANUFACTURER OF<br />\n<br />\nA. H. FETT1NG,<br />\n14<br />\n<br />\nAND<br />\n<br />\nSpecial attention given to Holiday<br />\nwork and Croups, Class Pictures, etc.<br />\n<br />\nJ. 1). Wheeler, Cashier.<br />\nChas. S. Miller, Ass't Cashier.<br />\n<br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br />\n<br />\n.<br />\n'<br />\nSi<br />\n<br />\nFINEST PHOTOGRAPIC WORK<br />\n<br />\nTRANSACTS A GENERAL RANKING BUSINESS.<br />\n<br />\nSafo Vaposd<br />\n<br />\nLEXINOTON<br />\n<br />\n(LONDON STUDIO.)<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br />\n<br />\nGreek Cetter 'Fraternity<br />\njewelry.<br />\n<br />\nMASON & HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first.<br />\nMoaiTz Mos:et:ow:mt.<br />\n(Signed)<br />\nrank.\"<br />\n<br />\n16 ST. PAUL STREET.<br />\n<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nC. H. Hildebrandt & Son, Sole Agts.<br />\n<br />\nNI:W YORK TO BREMEN,<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nw w w<br />\nCABIN PASSAOE AT LOW<br />\n<br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\n<br />\nRATES.<br />\n<br />\nBALTIMORE TO BREMEN<br />\n<br />\nA. SCHUMACHER & CO<br />\nFor particulars apply to<br />\n<br />\nSURETY<br />\n<br />\nDIRECT.<br />\n<br />\nGeneral Agents.<br />\n<br />\nthe liranz.Smith<br />\npiano.Co.<br />\n<br />\nki<br />\n<br />\nBONDS<br />\n<br />\n'Fidelity and Deposit Company of Maryland,<br />\n<br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br />\n<br />\nCbickering, Bradbury and Webster<br />\nf<br />\nti;<br />\n<br />\nINNS. it*<br />\n<br />\nC. & P. Phone 2322-2.<br />\n<br />\nFactory Prices<br />\n<br />\nLIARTLIT:17r, HAYWARD do CO.<br />\n* * Tounders and Engineers, e e<br />\n1;<br />\nfilYitI4i1 hi<br />\n<br />\n'OR 111<br />\n<br />\n' 1-13-404.11 I, 1<br />\n,<br />\n,<br />\n<br />\nt<br />\n<br />\nWorks, Pratt and Scott Sts.<br />\nOffice Calvert and German Sts.<br />\no nu filet u rers oft.us t and Wrought Iron Work Cr linildings.<br />\nSI arcs, Railings, ISaleonies, Guards, Vaults and Arca Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nlIorizontal Tubular Boilers, Wrought Iron Tanks, Gas !folders, Purifiers, Condensers, etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Ilridges.<br />\nANIERIORIIRMIMMMEMMR1<br />\n<br />\nCHARLES AND LEXINGTON STS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS<br />\nSAFETY DEPOSIT BOXES.<br />\n<br />\nEDWIN WA RI:1E1,D, Pres't.<br />\nst Vice-Pres't, II. Crawford Black.<br />\nJos. R. titolieliraker.<br />\n211d<br />\n\"<br />\nThos. A lAlielan<br />\n\"<br />\n3rd<br />\n<br />\nBOOKS<br />\n<br />\nII. E. BOSLER, See'y-Treas.<br />\n<br />\nThe oldest Ohl Rook Store. and the lars.fe.:4<br />\nstock of ON ;meI New Books ill the City.<br />\n.<br />\nBooks bought, sold um! exchanged. .<br />\n<br />\nHarry Nicorh•linis,<br />\nAss't See'y Ti,<br />\n<br />\nW M.<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealersin Baltimore in every thing known in Music.<br />\nSole Agents for<br />\nGuitars, Banjos<br />\nand Zithers.<br />\nngclust, Automatic Attachments for<br />\n44:f1<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES,<br />\n<br />\n\"Washburn\" mundonns,<br />\n<br />\n201-203 N. CHARLES STREET.<br />\n<br />\nOld and<br />\n<br />\n605 N. Eutaw fit.<br />\n<br />\nV. PIPPEN.<br />\n<br />\nSTONEBRAKER BROS.,<br />\n<br />\nPRINTERS,<br />\nLet us Estimate on your Spring Catalogues, etc.<br />\n217<br />\n<br />\nE. BALTIMORE ST.<br />\n<br />\n\fS7vVITI-1, DIXON & CO.<br />\nCALL AND CiET AN ESTIMATE.<br />\n<br />\not PAPER oe<br />\n<br />\nSTONE-BRAKER BROS.,<br />\nPRINTERS.<br />\n<br />\nii%-*liWfr*tVqri4-'4Wfrik4Wfr***tjWfrift<br />\n<br />\n29-31 S.. CI—I..AIR,LES ST_<br />\n<br />\nGlobe<br />\n1,<br />\nZ<br />\nBrewery<br />\n<br />\nt.1)<br />\n<br />\nLAGER BEERS<br />\n6014brau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br />\n<br />\nJ. Win. Panicle!),Lori.<br />\n<br />\nWin. B. Oliver.<br />\n<br />\nMIDDENDORF OLIVER & CO.<br />\n<br />\nBankers and Brokers,<br />\n205 EAST GE:RN/IAN STREET,<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br />\n<br />\n6ifts for<br />\nBrides<br />\n<br />\nSilversmiths.<br />\n<br />\nBohemian<br />\n<br />\n• ORIGINALAND FAMOUS<br />\n<br />\nROCHESTER BEER. Bavarian<br />\ninaerzen 13rau<br />\nApollo<br />\n<br />\nTRADE MARK.<br />\n<br />\nBALTIMORE<br />\n• • BRANCH -f,•,&<br />\n<br />\n217139SAENTRAL AVE<br />\n<br />\nGEO. C. SUCRO, Sole Agent.<br />\nTH,loione low<br />\nHome Telephone 2000<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class l'assengers<br />\nSt reasonable rates.<br />\nATLANTIC TIRANT.SIPOR'r CO.<br />\n<br />\n403409 WATER<br />\n<br />\n1 BROADWAY<br />\n<br />\nST.<br />\n<br />\nNEW YORK.<br />\n<br />\nLawrence IS. Kemp, President.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE,<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nCO[11[11ERCIFIL & FFIRMERS NRTIONRL BRNK,<br />\nHOWARD AND GERMAN STREETS,<br />\nBALTIMORE, MD.<br />\n<br />\nTEXT nooas, NOTE BOOKS,<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nSTUDENTS SUPPLIES.<br />\n<br />\nTHE BLAKE CO.HABERDASHERS,<br />\n<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nGODS--Low pmens.<br />\n<br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\nphotographs<br />\n<br />\nligentritz<br />\nStudio.<br />\n<br />\nSUCCESSOR TO CUMMINS<br />\n20<br />\n<br />\nTHE<br />\n<br />\nBALTIMORE.<br />\n<br />\nHENDERSON'S ,1<br />\n<br />\nHIGH GRADE<br />\n<br />\nBARTHOLOMAY'S<br />\n<br />\nOffice and Depot, 227-239 .S. Central Avenue.<br />\nMD.<br />\n<br />\nIN GREAT VARIETY.<br />\n<br />\ndIAL:0131 ett216 N. CHARLES ST.<br />\n<br />\nROCHESTER, N. Y.<br />\n<br />\n,GE.P;C•5 U C RO<br />\n,.......,ANAGER • • •<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\nWedding Sil„AoWI<br />\n<br />\nBartholomay Brewery Co.<br />\n<br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nTIM). WARNER,<br />\n<br />\nJAMES<br />\n<br />\nR. PAINE.<br />\n<br />\nWARN ER & CO.<br />\nUMBRELLAS, Q HATTERS, 40 CANES, ETC<br />\nAgents for Lincoln & Bennett and Walter Barnard's London Hats.<br />\n3:24 W. flALTIN10IEE STFtE1jT.,<br />\nMANUFACTURERS OF<br />\n<br />\nSilk iind Cassitnere Ilats.<br />\n<br />\n\"Cilir\"Clr HOPKINS CAPS.<br />\n<br />\nplug 81Companu<br />\n<br />\nN STATIONERS.<br />\n<br />\nBOOKSELLERS Ari.<br />\n<br />\n34W. BALTIMORE STREET<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS BOOKS.<br />\n<br />\nWF.,'S1'<br />\nSPECIAL DISCOUNT TO STUDENTS.<br />\n<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins II ospi Ltd and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\n1-1ELEN M. HOLLYDAY,<br />\n600 N. Li;LITANY ST.,<br />\nBALTIMORE, MD.<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br />\n<br />\n.linhenscr-Busch<br />\nBrewing liss'n<br />\n<br />\nYou get. the benefit of<br />\nall thislabor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cats[logue.<br />\nCHAS. M. STIIEFIP,<br />\n9 N. Liberty St., Baltimore, Md. 5211ffil St., N. W., Washington, I). C.<br />\n<br />\nTIEF<br />\nPiANos<br />\n<br />\nB. G. EICHELBERGER,<br />\n<br />\nSt. Louis Mo.<br />\n<br />\n]3OOKS AND STATIONERY,<br />\n<br />\nBrew the Best Beers<br />\nIII the World.<br />\n<br />\nENGRAVING AND STAMPING.<br />\nNo. 308 /%1c,r11-1 ellitrlos Street,<br />\nY. M. C. A. BUILDING,<br />\n<br />\n•ALTIMORE BRANCH:<br />\n<br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\nC. &. P. Telephone<br />\n2314.<br />\n<br />\nC. &P.Telephone 2351.<br />\n<br />\nSTONEBRAKER BROS.,<br />\n2 z E. Baltimore St.<br />\n<br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br />\n<br />\n\fotif7)<br />\n<br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nSEASON,<br />\n<br />\nLEM MERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br />\n<br />\nLEMMERT<br />\n<br />\nNovember 7th, 1900.<br />\nWhile visiting the Paris Exposition of Iwo, the wonderful display of<br />\nwines from all parts of the world was made a special study by our representative, who secured some very fine euvees of French wines, both<br />\nred and white, such as Chateau Pontet Canet, Chateau Larose, Chateau Lafitte, Chatcau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s of Deinhard & Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Offley Forrester & Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped i n 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br />\n<br />\n701-703-705 Madison Ave., Baltimore.<br />\n<br />\nLEMMERT<br />\n<br />\n14 E. FAYETTE STREET.<br />\n<br />\nS<br />\n<br />\nPECIAL, DISCOUNT!<br />\n<br />\nTo the Students and Nurses of Johns Hopkins we will make a<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n<br />\nsr JEFFIR.ES STUDIO, sr<br />\n<br />\nl'll<br />\n0<br />\nll.,S<br />\n<br />\nOUR HERD, SIR,<br />\nMINOR'S,<br />\n<br />\n0<br />\n)<br />\n1 218 NORTH EUTAW STREET,<br />\n<br />\nis the<br />\n<br />\npa,:rril<br />\n<br />\nm<br />\ncgm<br />\nrofv<br />\noc;ti!,r,ya ,<br />\npe<br />\nelatrri<br />\nt!toncder.and<br />\n0<br />\ning OUR HATS.<br />\n‘<br />\n41<br />\nUP-TO-DATE,<br />\nt.<br />\n0<br />\n,a.se, ofi<br />\nONE PRICE.<br />\n<br />\nI0<br />\n<br />\n106 N. CHARLES STREET.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n1<br />\n.)aitilteliketeleZZZZeZZ<br />\n,Z0ZZitelititalititeiainitititilletC.t<br />\n<br />\nBo<br />\n<br />\nIL<br />\n<br />\ntioLiApFEL & ritirtt<br />\n<br />\nMANDOLINS, GUITARS aa BANJOS<br />\n\"Have a tone<br />\nThat's all their own.\"<br />\n<br />\nit Mandolins*<br />\n<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\nNEAR SARATOGA ST.<br />\n<br />\nGUITARS AND BANJOS.<br />\n<br />\nOPEN EVENINGS.<br />\n<br />\nINSTRUMENTS TAKEN IN<br />\n<br />\nEXCHANCE.<br />\n<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\n\"t '<br />\n4<br />\n<br />\n///////////,',<br />\n<br />\n`<br />\n'<br />\n4.T •,<br />\n\\\\•,4-4444\\'',C\"',4-7<br />\n<br />\n0, •<br />\n<br />\n'<br />\n<br />\narammialif<br />\n<br />\nNow Ready<br />\n<br />\nThe<br />\nHullabaloo<br />\nA limited number of copies may be secured<br />\nat the University Post Office, at Cushing's or ut Eichelberger's.<br />\n<br />\n1901<br />\n<br />\nThe Subscription Price is $1.25.<br />\nf:<br />\nr.'!1,\"<br />\n1LfIrl'77r,<br />\n<br />\n771<br />\nA1\"1\"175,.<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•tt:?::.:•ri7:i•<br />\n<br />\n•<br />\n<br />\n••<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n7117<br />\nS\\<br />\n71<br />\n41179471<br />\n‘.,t \"rkAlli,M51737/711SM17107.1:3!=1,4\"1\"771\"lajr711\"1771\"'• ‘,,1`,1,017791\",...W.J.„<br />\n<br />\n\f", "format": "basic_html", "processed": "PRESS OF STONEBRAKER<br /><br />\nBROS., 13ALTIMORE.<br /><br />\nJOHNS HOPKINS<br />\nUNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nBALTIMORE, MD.<br />\nII.<br /><br />\nTwenty-Fifth Year.<br /><br />\n13eginning October 1st, 1900.<br />\nIII.<br /><br />\n• DANIEL C. GILMAN<br />\nWM. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br /><br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br /><br />\nIV.<br />\nV.<br /><br />\nINSTRUCTION.<br />\nFor Oraduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As speciabstudents.<br /><br />\nVI.<br /><br />\nVii.<br />\nVIII.<br />\nIX.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br /><br />\nX.<br /><br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra Reinsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\n11'illiam II. Howell.<br />\nH. Welch.<br />\nJohnJ. Abel.<br />\nJohnj. Abel.<br />\nWilliam Osier.<br /><br />\nXI.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Blo0111field.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the 'Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Cheinical-Iiiologicid,<br />\n(leading up to Medicine.)<br />\n4. Geological-I3iological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br /><br />\nEditors.<br /><br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssynology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br /><br />\nFrank Morley.<br />\nIra Renzsen,<br />\nBasil L. Gildersleeve.<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br />\n_<br /><br />\n-Programmes of the Courses offered to graduate students<br />\nto Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe ,-,cnt on application to the Registrar.<br /><br />\nXII.<br /><br />\nXIII.<br /><br />\nXIV.<br />\nXV.<br /><br />\nXVI.<br /><br />\nXVII.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY,Editor. Quarterly. 4to. Volume XXIII.<br />\nin progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nI. REMSF-N, Editor. Monthly. 8vo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nStudies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series XIX<br />\nin progress. $3 per volume.<br />\nJohns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nJohns Hopkins Hospital Reporta. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nContributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. Eworr, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. Svo. Volume<br />\nV in progress. $5 per volume.<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\n1,. A. 13AuER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nAnnual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc. of the University. Published at the<br />\nclose ofthe academic year.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF TI1E NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHR TEACHING OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\nBIBLIOGRAPHIA HCPKINSIENSIS. Part I. Philology. Parts<br />\nII-III. Chemistry, Minerology and Geology. Parts<br />\nIV-V-V1 Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br /><br />\n•Cbe news= Letter.•<br />\nVol. V.<br /><br />\nMay 23, 1901.<br /><br />\nCOLLEGE LIFE AT SEVILLE.<br />\n( Notes of a sometime student at Academio de Sevilla.)<br /><br />\nHE Spanish student would stare at our<br />\nTidea<br />\nof college life, for he does not feel the<br />\nAmerican athletic enthusiasm. He is intent<br />\non his cards and his beloved cigarettes, his<br />\nlittle games of strength, his evenings at<br />\nthe theatre, with its rollicking \"rough<br />\nhouse,\" or at the cafe, drinking much, but<br />\nseldom too much; he serenades, he makes love<br />\nat barred windows, he avenges with knife-andcloak duels offenses against his strict code of<br />\netiquette. Life is jovial and care-free, but by<br />\nno means lawless, among these young subjects<br />\nof King Alfonso XIII.<br />\nHowever studious, however poor he may be,<br />\nthe- Spanish student always finds time in the<br />\nevening to drop in at the café or the theatre.<br />\nThis is but natural in a country where the<br />\ncafé takes the place of home-life for the male<br />\nmembers of the family after the late dinner.<br />\nAt the little tables—of which there may be<br />\nfour hundred or more in the great building,<br />\nopen to the street—sit young and old, drinking, smoking, chaffing, watching the crowd.<br />\nThis café-existence is all-important in the student's life; yet it cannot be reckoned dissipation, since a single order ensures a seat for the<br />\nwhole evening, and even the most impecunious can afford to drink the red wine almost<br />\nlike water. Fifteen cents will buy a bottle of<br />\nfairly good vintage, containing about one and<br />\none-half pints. As in all wine-drinking countries of Europe, there is little intoxication in<br />\nSpain.<br />\nAt the theatre, too, the student feels thoroughly at home. Everybody in the college<br />\ngoes, two or three times a week. To this<br /><br />\nNo. 16<br /><br />\namusement also a scanty purse is no bar. The<br />\nTeatro ',or kora offers a succession of light<br />\ncomedies, operas, etc., every hour, with a<br />\nslight intermission; and for each performance,<br />\na good seat \"down in front\" costs but ten<br />\ncents. The orchestra, or pit is, in Spain, the<br />\ncheapest place in the theatre; the expensive<br />\nseats are the elevated stalls at the sides and<br />\nback. This is a survival of the original<br />\n\"courtyard\" theatre, where the common people poured into an enclosed courtyard to find<br />\nthe stage at one end, and the nobility and people of consequence in the balconies surrounding the court. In the present Spanish theatre,<br />\nthe balconies are low-priced towards the top,<br />\nand are much cultivated by the students. The<br />\nplays given are like our \"curtain-raisers,\" domestic farces or light operas. There is a great<br />\ndeal of dancing; the house always becomes attention at the click of the castanets, announcing the Sevillana with its supple, swaying,<br />\ngraceful body-movements, so different from the<br />\nFrench hopping and skipping.<br />\nThe students' highest jinks are on Innocents' Day and at the Carnival on Shrove<br />\nTuesday. In the afternoon he sallies forth,<br />\nmasked,and armed with bags of fiafielillos, bits<br />\nof paper cut so fine that it will bunch up<br />\ninto a ball that can be thrown some distance,<br />\nbut will burst at touch. He makes for the<br />\nPaseo, or public drive, where there is a grand<br />\ndress parade of everyone who can hire a carriage. Ah! a pretty face flashes by, and away<br />\nour student flies, jumps on the carriage steps,<br />\nand dashes, full in the girl's face, a bunch of<br />\nfiafielillos mingled with much gold tinsel. The<br />\ngirl smiles at him—the more tinsel the greater<br />\nthe compliment—and, hanging on the steps,<br />\nhe enjoys a flirtation until someone slings<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\npaftelillos down his neck, when he jumps off<br />\nand goes for his assailant. Perfect liberty is<br />\npeamitted, both from and towards any masker.<br />\nIn the evening our student starts out for<br />\nthe café, but has to run the gauntlet of the<br />\nbalconies, where are girls with bags of flour<br />\nand weighted rag balls attached to strings, just<br />\nheavy enough to smash a stiff hat. When he<br />\ngets to the café, he finds it humming with the<br />\nrevelers. The fun grows furious; he thoughtlessly runs across the open floor of the café in<br />\nhis disguise, and thereby invites upon himself<br />\na. shower of bread-crusts and rotten potatoes,<br />\nfor such is the custom.<br />\nThen he joins a merry throng in the gallery<br />\nof the theatre. The rates are reduced tonight<br />\nso the building is crowded, and there is a flow<br />\nof jocular comments on the performance.<br />\nMeanwhile the esludiante in the gallery is<br />\nmaking some diablillos—\"little devils.\" He<br />\ntears up his play-bill into narrow strips and<br />\nrolls these spirally into slender darts about<br />\nsix inches long, with one end pointed and the<br />\nother flat. This wide end he presses between<br />\nthe tips of his forefingers, and, drawing them<br />\nup and back, with a sharp jerk he shoots the<br />\n\"little devil\" into the lap of a pretty girl in a<br />\nbox below. She does not notice, for sometimes there are as many as a hundred in the<br />\nair at once. But he continues his bombardment, and at last he is rewarded by a little<br />\nsweep and flutter of the fan, the Spanish woman's telegraph of feelings. In a moment<br />\nthe duenna turns aside, and the marksman is<br />\nmade blissful by a swift glance and smile.<br />\nBut there is that \"pig\" who, they say, is engaged to her! and now a \"malicious devil,\"<br />\nwith a pin stuck in the tip, zips down and<br />\nstings the rival's arm.<br />\nIn such ways begin the love affairs of the<br />\nestudiante. He is very fond of the ladies, but<br />\nhe has a hard time to meet them. In the first<br />\nplace, no respectable Spanish girl is allowed to<br />\ncall on friends, or to receive visitors, without<br />\nthe presence and sanction of her mother or<br />\nother elderly relative. The express invitation<br />\nof the mother alone allows a young man to<br />\ncall, even though he is engaged to the girl.<br />\nSo the Spanish student's afaire du coeur<br /><br />\nrequires a deal of time and thought. If he<br />\nsees her first on the promenade, he must<br />\nshadow her, so persistently that she will notice<br />\nhim, and yet so unobtrusively that the duenna<br />\nwill not. Again a stolen look over the shoulder, with a signal of the eloquent fan, tells<br />\nthat the young lady is conscious of his existence, and he traces her to her home. Then<br />\nhe must, in student slang, hacer el oso,\"play<br />\nthe bear\"—walk up and down, in front of the<br />\nhouse, at a certain hour each day. Meanwhile, he makes inquiries about the girl, and<br />\ntries to get word to her through mutual acquaintances; and, if fortunate, some day he<br />\nmay see a handkerchief flutter behind the<br />\nwindow-bars. That night, muffled in his cafia,<br />\nor long mantle, he steals to the window, and<br />\nwhispers his important communi cations<br />\nthrough the iron bars. For every window at<br />\nall accessible is provided with a stout iron<br />\ngrating, an inheritance from the Moors, who<br />\nwished thus to insure the seclusion of their<br />\nladies. The suitor may here propose for the<br />\nyoung lady's hand; but, unless he is accepted,<br />\nhe may never reach a greater intimacy. So it<br />\ncomes that a pedestrian through the streets of<br />\nSeville, by night, sees iii his walk twenty such<br />\nshrouded figures leaning against the gratings,<br />\ntheir cloaks pulled high over the head by the<br />\nleft arm. If a student, he will say: \"Another<br />\nfellow eating iron!''<br />\nThe Spanish students are all great smokers;<br />\nfifteen to twenty cigarettes daily is an average<br />\nallowance. Cigars are costly, and pipes are<br />\nunknown. As with all the courteous Spaniard's conduct, the students have a most formal code of etiquette for smoking. Somebody<br />\nproduces a tobacco-pouch. No matter where<br />\nhe is, in a public conveyance or among strangers, he will offer the tobacco to all present.<br />\nThose who accept usually have their own pet<br />\nbrand of papers, and so the cigarettes are<br />\nquickly rolled. Then the first man, as convivador, or host, lights his own cigarette. But it<br />\nwould be a gross insult to offer a match for a<br />\n\"light,\" so he hands his weed, the lighted end<br />\nforemost, to the nearest man, who returns it,<br />\nmoistened end foremost,and forthwith passes his<br />\nown cigarette,now lighted,to his next neighbor.<br /><br />\nTHE NEWS-LETTER.<br />\nThese rules must be scrupulously observed.<br />\nTo throw away a cigarette which has been<br />\nreturned from lighting is a deadly affront, and<br />\ncalls for a duel.<br />\nThese student duels, of frequent occurrence,<br />\nare fought with the navaja, or clasp-knife.<br />\nThe ever-present cafia is rolled around the left<br />\narm as a shield, and the wounds are apt to be<br />\nin the left hand. The scene is generally a<br />\nstudents' room. There is no stabbing, the<br />\nknife is slashed only; and cuts for the face are<br />\nnot allowed. Since the fight may be stopped<br />\nat the option of the combatant who receives the<br />\nfirst wound, the duels are almost never fatal.<br />\nIntercollegiate athletics are unknown in<br />\nSpain. Fencing, hand-ball, and such games as<br />\nleap-frog, however, are popular, among them<br />\nthe \"bull-fight.\" The\"bull\" puts his hands<br />\non his knees, and may use only his shoulders.<br />\nThe \" Torero\" tries with his bands alone to<br />\noverthrow the \"bull.\" Elbow-wrestling is<br />\nalso a favorite amusement at the cafés. A<br />\nstudent, seated at a table with some stranger,<br />\nwill enter into a test of strength with him.<br />\nThe right arms are bent, the elbows leaned<br />\nside by side on the table, and the hands<br />\nclasped. He who, without moving his elbow,<br />\ncan force his opponent's hand back upon the<br />\ntable, enjoys a treat at the other's expense.<br />\nWhen he is at a \"blow-out\" with friends,<br />\nthe student must also be careful of the proper<br />\nform. In quantities of over a quart, wine is<br />\nusually in leather bottles or skins, with a slender tube in the neck for a mouth-piece. There<br />\nare no glasses; so each man, as the bottle comes<br />\naround, leans far back in his chair, assures<br />\nhimself that the mouth-piece is accurately<br />\nsituated at a short distance from his mouth,<br />\nand then elevates the skin, causing the stream<br />\nto pour down his throat. On no account must<br />\nhis lips touch the mouth-piece. If he can,<br />\nmoreover, depress his epiglottis, so that no<br />\naction of gulping is necessary for the descent<br />\nof the •wine, he is considered quite accomplished.<br />\nIt must not be thought that the estudiantes<br />\nare not good scholars. Indeed, many of them<br />\nat Seville were working their way through, in<br />\nvarious capacities ranging from a valet up-<br /><br />\n3<br /><br />\nwards. No record is kept of absences from<br />\nclass, and no questions are asked—the professor does not even know his students' names,<br />\nBut there is a \"repetition'' held after each<br />\nlecture by a \"quiz-master,\" by which the<br />\nsubject is thoroughly reviewed. The examinations are every three months, and at the finals<br />\nare very severe, so that any trifling meets with<br />\na speedy end.<br />\nThe Spanish students are reckless youth,<br />\nwith their fun and frolic and moonlight guitars.<br />\nYet they are seldom too wild; and everywhere<br />\nand at all times, they have the traditional<br />\ncourtesy that makes the Spaniard the most<br />\ndignified man of all nations.<br />\nVI OE' Vff'<br /><br />\nMEDICAL SCHOOL ITEMS.<br />\nCommencement of the Nurse's TrainTHE<br />\ning School connected with the Johns Hopkins Hospital will be held on Friday afternoon,<br />\nMay 24th, in one of the hospital buildings.<br />\nThe graduating class numbers eighteen.<br />\nsir W<br /><br />\nMr. Ed. H. Hume, Yale '97, of Bombay,<br />\nIndia, who has been following the medical<br />\ncourse at Hopkins for the past four years, has<br />\nbeen elected International Student to Great<br />\nBritian. On his graduation here, Mr. Hume<br />\nwill leave for Liverpool, where he will pursue<br />\nhis studies further.<br />\n.1116<br /><br />\n.1i6<br /><br />\nThere are about seventy physicians in attendance upon the post graduate courses in<br />\nMedicine at the Johns Hopkins Medical<br />\nSchool. These courses last during the months<br />\nof May and June, and draw graduated physicians from all parts of the country to Hopkins.<br />\nar<br />\nMr. Warfield T. Longcope has been appointed Pathologist at the University Hospital,<br />\nPhiladelphia.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\ntbe 1ilevni3.1Lcttcr.<br />\nPublished Portnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nMAY 23, 1901.<br />\nSubscription Si<br /><br />\nEditor in Chief,<br />\n.<br />\n.<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br /><br />\nto cents a single copy.<br /><br />\nper vcItr.<br /><br />\n.<br /><br />\n.<br />\n.<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nWILLIAM B, HILL, 1902,<br />\nSOL STROME, 1902.<br />\nBBEN C. HILL, 1902.<br />\n{ROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\n1:3YMAN C. MURPHY, 1902.<br />\nJOHN M. BANDEL, 1901.<br />\n. .<br />\n. AUBREY PEARRE,JR., 1902.<br />\n.<br /><br />\nAddress all articles, communications,etc.,to WILLIAM B. HILL.<br />\nbox 269,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJOHN M. BANDEL, box 94, J H. U.; or box 398, Medical School of<br />\nJohns Hopkins Hospital.<br /><br />\nis not alone in its misfortunes.<br />\nHOPKINS<br />\nWe extend sympathy and regret to Lafayette College, which has recently lost one of its<br />\nablest professors—Dr. Thomas Conrad Porter,<br />\nDean of the Pardee Scientific Department.<br />\nAsir W<br /><br />\nlast the efforts of\"Mac\" are rewarded,<br />\nATand<br />\nHopkins will have a gallery added to<br />\nthe cage. In connection with this latest improvement, it would perhaps be well to direct<br />\nthe attention of some of those profound critics<br />\nwhose superior wisdom qualifies them to correct the mistakes (?) made by our Physical<br />\nDirector, to a few of the innovations and improvements made by him during his incumbency of office.<br />\nWhen Mr. Mackdermott accepted the position as head of the athletic department of the<br />\nJohns Hopkins he found athletics in a lamentable condition. Since then he has remodeled<br />\nthe entire athletic system of the University;<br />\nimproved and lighted with electricity the cage,<br />\nsecured suitable athletic grounds, and last but<br />\nnot least, coached winning teams. It would<br />\nbe well if certain of his detractors would pause<br />\nto consider a few of these things. However,<br /><br />\nwe are willing to be enlightened, and perhaps<br />\nsome of these sage critics can suggest a better<br />\nman for the position. Now is your chance,<br />\ngentlemen, speak up! but remember, we need<br />\na man who can do something besides put on a<br />\nlovely pair of tights and do\"stunts\" on the<br />\nhorizontal bar. Up to this time the NEwsLETTER has refrained from entering this<br />\ncontroversy, but when the vital interests of<br />\nHopkins athletics are involved it is time something should be said in the matter. Under<br />\nthe present regime Hopkins athletics are<br />\nmore flourishing than ever before, and their<br />\nwelfare should not be sacrificed for the gratification of a few critics whose knowledge of<br />\nathletics is very limited, and whose contributions to the same have been mainly of the<br />\n\"hot-air\" variety.<br />\nApropos to this we publish a letter from the<br />\nPresident of the Athletic Association regarding a certain poem published in the \"Hullabaloo.\" In the effort to display wit (?) the<br />\nwriter of the poem not only sacrificed truth,<br />\nbut showed himself wofully incompetent to<br />\nwrite upon a subject which he evidently knows<br />\nnothing about. THP; NEws LETTER hopes<br />\nthat these puerile attempts to injure the best<br />\ninterests of Hopkins will be abandoned, and<br />\nthat in the future all our men may have one<br />\naim—namely, the honor and welfare of the<br />\nBlack and Blue.<br /><br />\nEditor of News-Letter.<br />\nAlthough the i9oi Hullabaloo is an excellent<br />\nproduction, it contains several articles that<br />\nshould never have been allowed to appear.<br />\nIt is one thing to ridicule, in a good natured<br />\nway, the peculiarities of a member of the faculty, and quite another thing to endeavor to<br />\nruin his reputation by making all sorts of insinuations as to his habits and character.<br />\nThe author of the poem \"Drink Deep\" has<br />\nnot only done the present Director of Athletics a great injustice, but has shown very clearly that he, the author, does not know what he<br />\nis talking about. I have no desire to belittle<br /><br />\nTHE NEWS-LETTER.<br />\nthe work done by our former instructor, because he and I were, and are still, the best of<br />\nfriends, but the author of the poein should<br />\nhave been very sure that he could firove that<br />\nour present instructor has ever used \"unfair<br />\nmeans\" to make our teams win. I do not<br />\nknow who the author of this poem is, but I<br />\nventure the prediction that he is one of the<br />\n\"side line\" athletes who never played on a<br />\nteam in his life, but who was always very liberal with his criticism of those who worked.<br />\nAgain—can it be possible that the editors of<br />\nthe Hullabaloo still believe that Mr. Mackdermott had anything to do with the handicapping that caused so much bad feeling after our<br />\ngames at the armory? Yet, if they do not believe this, why did they permit the insinuation<br />\nthat is so evident in the illustration of the<br />\n\"Professor's Library\" ? Why do not the gentlemen who write such articles and who have<br />\nbeen so busy circulating the slanderous reports<br />\nabout the University and about town, come<br />\nout boldly and make definite charges against<br />\nthe Director of Physical Training, that he may<br />\nbe able to defend himself, and stop all this miserable squabbling that has been going on ever<br />\nsince the football trouble last fall.<br />\nIt is quite evident what the object of these<br />\ngentlemen is, and I would like to ask them<br />\nthis one question—suppose you succeed, by<br />\nthe persistent circulation of your rumors of<br />\n\"crooked\" work (none of which you have<br />\nbeen able to prove), in causing Mr. Mackdermott to resign;—what then? Have you a successor of equal, or anywhere near equal ability,<br />\nselected who will take his place, at the very<br />\nsmall salary which we can afford to pay? I<br />\nhave asked this question a number of times<br />\nand have not yet received an answer.<br />\nTo realize what Mr. Mackdermott has done<br />\nfor Hopkins Athletics it is only necessary to<br />\nread the present Hullabaloo and one of six or<br />\neight years ago. As to \"crooked\" work, I<br />\ncould mention various examples in that line<br />\nthat occurred long before Mr. Mackdermott<br />\nhad anything to do with our athletics.<br />\nIt is doubtless true that some of those who<br />\nhave been circulating these rumors, really be-<br /><br />\n5<br /><br />\nlieve them to be true, but they do not seem to<br />\nrealize that they are seriously injuring our<br />\nathletic reputation, as well as the reputation<br />\nof the Director of Athletics, by this method<br />\nof procedure.<br />\nIf the author of \"Drink Deep\" really has<br />\nthe interest of Hopkins Athletics at heart, let<br />\nhim make formal charges, in writing, against<br />\nthe Athletic Director, and lay these charges,<br />\nthrough Dr. Renouf, before the board for investigation.<br />\nIn the meantime,—no more of these unproved rumors against the man who has done<br />\nso much to place Hopkins in the place she now<br />\nholds in the athletic world.<br />\nALBERT M. Rimsn,<br />\nPresident Athletic Association.<br />\nWWW<br /><br />\nA SPLENDID OPPORTUNITY.<br />\nseems indeed a blessing that once a year<br />\nIT the<br />\nstudents of the various Universities<br />\nare given an opportunity to assemble under<br />\nthe cool pines of East Northfield, Conn., and<br />\ntalk over common interests and discuss the<br />\nevents of the day.<br />\nHere there is no chance for class politics<br />\nor fraternity factions creating disagreeable<br />\ncliques. No feeling can exist but that of true<br />\n'Christian friendship. It is hoped that this<br />\nyear more Hopkins men will make use of the<br />\nopportunity thus offered to know one another<br />\nbetter, and to mingle with the students of<br />\nother Universities.<br />\nThe date of opening is Friday, June 28th,<br />\nand of closing, Sunday night, July 7th, 1901.<br />\nFrom present indications, it is sure that the<br />\nattendance of the Conference, as a whole, will<br />\nbe larger and more representative than ever.<br />\nA word as to what the Convention really is,<br />\nfrom a Hopkins man who was there, may be<br />\nof value.<br />\nLast year the total number of fellows at<br />\nNorthfield was six hundred. Yale and Princeton had the largest delegations, Yale having<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\nover one hundred men, and Princeton just<br />\nabout one hundred. But, altogether, there<br />\nwere men present from one hundred and fiftytwo different Colleges and institutions of learning. The men represented twenty-four different Christian denominations, though some<br />\nof them did not belong to any.<br />\nAt the Conference, as much of the morning<br />\nas each man chose could be used in attending<br />\ndifferent meetings, of which there were four,<br />\neach lasting but one hour, and beginning at<br />\n8 A. M.<br />\nThe long afternoons were then given up to<br />\nrecreation. Yale, Harvard, Amherst, Princeton, Williams, Brown, and several other Colleges, played for the baseball championship.<br />\nSome splendid tennis playing was also done<br />\non the twelve courts, where the tennis tournament came very near being won by a Johns<br />\nHopkins man. The fellows that didn't care<br />\nfor baseball or tennis, were either playing<br />\ngolf, climbing mountains, or rowing on the<br />\nwaters of the historic Connecticut.<br />\nIn the evening, about sunset, there was<br />\nalways a meeting held on \"Little Round<br />\nTop,\" where different life-works were presented to the men for consideration. Then,<br />\nat 8 o'clock, came the regular evening platform address, after which everyone started for<br />\nthe camp. Now,some of the men lived in the<br />\nNorthfield Seminary buildings near the large<br />\nAuditorium, but the majority dwelt in tents<br />\non the mountain side, in a tall forest of tall<br />\nCathedral pines, whose fallen needles have<br />\nbeen many years in spreading a thick carpet<br />\nround about our tents. The tents are erected<br />\non'small board platforms, scattered amongst<br />\nthe trees, within hearing distance of the big<br />\ngong on the rustic \"hash-house,\"to which place<br />\nthere is a general stampede at 7 A. M.,<br />\nP. M., and 6 P. M. The camp is about half<br />\na mile from the Auditorium, and is delightful,<br />\nboth in equipment and situation.<br />\nAmong the many pleasant memories of the<br />\nConference last Summer, there is only space<br />\nto mention the gigantic bonfire on the evening<br />\nof July 4th, and the tremendous enthusiasm<br />\nof the Patriotic Celebration, on that same<br />\nevening, when, into the large Auditorium<br /><br />\nmarched the many delegations, each singing<br />\ntheir own College song, and then each delegation, composed of five or more men, sang to<br />\nthe others a verse or so of its College song.<br />\nThe Hopkins should have at least twenty-five<br />\nmen this year to sing \"'Rah for the Black<br />\nand Blue !\" and give a good old Hullabaloo.<br />\nPigeons were flying about the building with<br />\nPrinceton flags attached. The Canadian Colleges were shouting,\"Rule Britania.\" The<br />\nenthusiasm beggars all attempts at description.<br />\nIt is, indeed, well worth your while to go<br />\nto Northfield, if only for the above reasons.<br />\nBut there are still others. These pleasures<br />\nwere enjoyed by the writer, they may be enjoyed by you ; but, like all others of their<br />\nkind, in a few weeks they have gone, and you<br />\nhave only their memory. But, at Northfield<br />\nyou can get more than this. Rev. Campbell<br />\nMorgan, of London, Mr. Robert E. Speer, of<br />\nNew York, and President Seth Low, of<br />\nColumbia University, will speak ; and they<br />\nare men who know how to speak to men.<br />\nBut, of more value even than the talks, perhaps, is the life—the very essence of life, with<br />\nwhich you feel yourself surrounded. You are<br />\nfilled with a splendid optimism. You feel you<br />\nare beginning to see things in a new light, in<br />\na true light; and that is the goal of us all.<br />\nYou see about you, men who are true to themselves and to others, and you feel that you<br />\nyourself can become the same.<br />\nInformation as to expenses, etc., may be<br />\nobtained from H. F. Perkins, or from A. R.<br />\nBird, who will be only too glad to answer any<br />\neiuestions, and give information to those who<br />\nbelieve they may be able to go there.<br />\nW<br /><br />\nW<br /><br />\nUNIVERSITY NEWS NOTES.<br />\nJ. M. Vincent, Acting Director of the<br />\nDR.Historical<br />\nDepartment, is back at the<br />\nUniversity, after an illness of several days.<br /><br />\nPresident Gilman has been notified of his<br />\nre-election as vice-president of the Archaeological Institute of America.<br /><br />\nTHE NEWS-LETTER.<br />\nDr. Herbert B. Adams is about to leave Baltimore for Amherst, Mass., where he will<br />\nspend a week before going to Nova Scotia for<br />\nthe summer.<br />\nw w sr<br />\nPresident Gilman delivered an address at<br />\nGirard College on the 22d. He will also be<br />\nthe Commencement Day Orator at the Woman's College.<br />\nsr w<br />\nThe Phi Beta Kappa Initiation of the members elected at the recent meeting was held<br />\nFriday of last week, at 5 o'clock, in the Donovan Room.<br />\nWWW<br /><br />\nJames Wriner Harry, graduate in the Historical Department, has just been appointed<br />\nFellow in History for the next year. He succeeds Wm. E. Martin, who will take his doctor's degree. Mr. Harry is an A. B. of<br />\nGeorgetown College, Kentucky, 1899.<br />\nsr w sr<br />\nAn invitation has been received from the<br />\nImperial College of Agriculture, at Sapporo,<br />\nJapan, for their twenty-fifth anniversary,<br />\nwhich was held May 14th. Two graduates of<br />\nthe University are now members of the Sapporo Faculty; Dr. Sato, the acting director,<br />\nand the professor of historical science.<br />\nW W W<br /><br />\nGen. Lloyd L. Jackson delivered an address<br />\nto the Senior Class, on Tuesday of last week.<br />\nSubject: \"The choice of a business career for<br />\ncollege men.\" Gen. Jackson laid especial<br />\nemphasis on the growing need, in business<br />\npursuits, of men of good education and integrity.<br />\nw sr sr<br />\nThursday of last week the University was<br />\nvisited by a party of nine gentlemen from<br />\nCuba, and one from Porto Rico, who have<br />\nbeen attending the National Conference of<br />\nCharities in Washington. These visitors are<br />\ninspecting the methods of education and charitable work in this country, and were invited<br />\nby President Gilman to come to Baltimore.<br />\nLieut.-Col. McHardy, of Edinburgh, Scotland,<br />\nwas also present.<br /><br />\n7<br /><br />\nA novel course inAmerican history and diplomacy has been arranged for the graduate students in the Historical Department. An excursion will be made every Saturday to the<br />\nCapitol at Washington, where Dr. J. M.<br />\nCallahan, Albert Shaw lecturer on diplomatic history, will explain the important<br />\ndocuments in the State Department and Congressional Library.<br />\nWWW<br /><br />\nMarathon M. Ramsey, a graduate student<br />\nin Romance Languages, has been appointed<br />\nProfessor of Spanish in Leland-Stanford University. Mr. Ramsey is a graduate of Columbian University, where he obtained his A. M.<br />\nin 1895. He was for some time in the Secret<br />\nService of the U. S. A., and was associated<br />\nwith Lieutenant Rowan, who made the famous<br />\ntrip across Cuba. Mr. Ramsey has written<br />\nseveral books on the Spanish language; his last<br />\none is now used as a text-book in the public<br />\nschools of Cuba.<br /><br />\nTHE 1901 ',HULLABALOO.\"<br />\nyear's Hullabaloo is out at last! AfTHIS<br />\nter such a long wait, a good course is<br />\nexpected, and the appetites are sharpened for<br />\nthe meal, prepared after arduous work by the<br />\nBoard, who are cooks, stirrers, and tasters, in<br />\none. This year's book is certainly up to expectations. Everything in it has been gotten<br />\nup with great care, and what is the main<br />\nobject of the book, it makes one laugh. To<br />\nhave heard the laughter of about fifty men,<br />\nlounging around the entrance to McCoy, last<br />\nThursday, reading the Hullabaloo, would be<br />\nsufficient evidence that it is being enjoyed.<br />\nEverybody must buy a Hullabaloo.<br />\nIn our opinion, the Board of Editors has<br />\nmade a mistake in adopting the class colors<br />\non the cover of the book. They form a neat<br />\ncombination, but have not the Hopkins individualism of the Black and Blue. Especially<br />\nis the policy poor when we remember that the<br />\ncolors of naughty-one are also the colors of a<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nlocal University which also publishes a year<br />\nINTER-COLLEGIATE MEET.<br />\nbook.<br />\nThe class drawing, in colors, is an innova- NOTWITHSTANDING the elements, the<br />\ntion that is bound to please. The illustrations,<br />\nfew people who went out to Electric<br />\nall through the book, are far superior to those Park Saturday afternoon, the i8th, witnessed<br />\nusually seen in a College annual, for they lack one of the most successful spring track and<br />\nalmost all traces of amateurism. There is field meets of the Maryland Intercollegiate<br />\nnothing so draws a reader as attractive illus- Athletic Association ever held. The games<br />\ntrations, and the class of 14901 can feel itself were a fine exhibition of endurance, in which<br />\nlucky in having on its roll men of such artistic several State records were broken by Hopkins<br />\nability as their productions in the Hullabaloo men ; and had it not been for a ruling of the<br />\ngive evidence of.<br />\nreferee, a total of four records would have<br />\nThe general reading matter, or record of easily been smashed.<br />\nCollege events, is arranged in a pleasant,<br />\nAll the events were splendidly contested by<br />\ninteresting order. In the roasts and grinds on the representatives<br />\nof the Colleges composing<br />\nProfessors, students, and \"characters,\" no the Association.<br />\nBut the wearers of the Black<br />\nviolent extremities have been reached, and no and Blue came<br />\nout victors with a good margin.<br />\none can feel hurt by the \"gentle\" knocks.<br />\nWestern Maryland was an easy second with<br />\nThe book contains many original ideas, very St. Johns third.<br />\nwell executed. The race for the presidency<br />\nThe one hundred, and two hundred and<br />\nis one of the most novel illustrations that has twenty yards<br />\ndashes were won, hands down,<br />\nappeared in a Hullabaloo for years.<br />\nby Horace Whitman, whose work all the<br />\nWe congratulate the Board on having scat- season has been superb.<br />\nIn the two hundred<br />\ntered its jokes on different members of the and<br />\ntwenty yard dash, he broke the Maryland<br />\nFaculty, instead of on one poor, harmless record by 2-5<br />\nof a second. The relay was won<br />\nDoctor. The feat was hard to accomplish, but by<br />\nHopkins in the record-breaking time of<br />\nsuccess has crowned their efforts.<br />\n3 minutes 34 3-5 seconds. In the four hunTHE NEWS-LETTER congratulates the class dred and forty<br />\nyard dash Riggs ran well, but<br />\nof 1901 on its successful year book, and adwas beaten out by Patterson of Western Maryvises everybody to buy one or more copies.<br />\nland,.while England in the half-mile run was<br />\nMr War<br />\nclosely pressed by Crane of St. Johns.<br />\nMorfit Mullen, captain of the '99 team, ran<br />\nOUR NEW GALLERY.<br />\nan exhibition quarter of a mile to try and<br />\ncarpenters are now at work, adding to break the State record held jointly by Hamthe cage our long-felt want—a gallery. mill and himself, and made several years ago<br />\nIt is needless to state that this improvement, in 54 seconds. He was paced by two shortbrought about through the efforts of \"Mac,\" distance sprinters. He was able to reduce the<br />\nwill be beneficial to spectators and athletes time to 52 1-5 seconds, after a beautiful run.<br />\nThe gatnes were under the supervision of<br />\nalike, for, by keeping the former off the track<br />\nand in-field, it will prevent, to a great extent, Prof. Win. M. Mackdermott as clerk of the<br />\nruts and furrows in the ground of the cage, course, and were speedily run off by him and<br />\nhis assistants, Mr. George E. Lamb, of the<br />\nwhich prove dangerous to the runners.<br />\nThe gallery will be sixty-five feet long by Baltimore Athletic Club, and Mr. Thomas J.<br />\nten wide the four tiers of seats, raised one Martin, of St. Leo's Gymnasium.<br />\nabove the other, giving a seating capacity of<br />\nHopkins won firsts in all the field events.<br />\nabout three hundred. Entrance to the gallery Scholl came out first in the running high<br />\nwill be by the door leading from the entrance jump, without any trouble; Garrett, second;<br />\nhall of the gymnasium building.<br />\nCromwell, St. John's, third. In the running<br /><br />\nTHE NEWS-LETTER.<br />\nbroad jump,Pessagno, Garrett and Scholl,were<br />\nwinners of the first three places; in the shotput, Garrett, Roberts, the young gidnt from<br />\nW. Md. C., and Stone, carried off the medals;<br />\nthe hammer throw was also won by Garrett,<br />\nwith Roberts and Humphreys second and<br />\nthird, respectively.<br />\nThe results of the field events are as follows:<br />\nOne Hundred Yards Dash—Horace Whitman, Johns Hopkins University, first ; H. S.<br />\nRiggin, Western Maryland College, second;<br />\nEugene L. Pessagno, Johns Hopkins University, third; W. W. Weedqn, Johns Hopkins<br />\nUniversity, fourth. Time, .To 3-5. Garey<br />\nand Cromwell of St. John's College, Parris<br />\nand Krauss of Western Maryland College and<br />\nAtkinson of Johns Hopkins University also<br />\nran.<br />\nTwo Hundred and Twenty Yards Dash—<br />\nHorace Whitman, Johns Hopkins University,<br />\nfirst; H. S. Riggin, Western Maryland College, second; W. W. Weedon, Johns Hopkins<br />\nUniversity, third ; A. B. Atkinson, Johns<br />\nHopkins University, fourth. Time, .23. W.<br />\nE Hoffman, T. F. Riggs and E. L. Pessagno,<br />\nJohns Hopkins University; Garey, Wells,<br />\nBradley, Torbert, Halbert, Cromwell, St.<br />\nJohn's College; F. B. Krauss, L. H. Chaffinch, J. W.Parris, Western Maryland College,<br />\nalso ran.<br /><br />\n9<br /><br />\nOne Mile Relay—Johns Hopkins University,<br />\nfirst ; Western Maryland, second. Time,<br />\n3.34 3-5. The teams ran as follows: Johns<br />\nHopkins, Riggs, Hoffman, England, Whitman; Western Maryland, Patterson, Stansbury, Krauss, Riggin; St. John's, Roberts,<br />\nGarey, Bradley, Halbert.<br />\nw w or<br />\nTENNIS TOURNAMENT.<br />\nThe annual Spring contests for the tennis<br />\nchampionship of the Maryland Intercollegiate<br />\nAthletic Association took place in the cage of<br />\nthe Johns Hopkins University Wednesday<br />\nmorning, and resulted in complete victory for<br />\nthe Hopkins men.<br />\nSt. Johns College, Western Maryland College and John Hopkins University were represented in the tournament, three entries being<br />\nallowed, one for the singles and two for the<br />\ndoubles. The following men were chosen to<br />\nrepresent their college:<br /><br />\nJohns Hopkins—Camillus Bush, in the singles, and George B. Scholl and C. Bush in the<br />\ndoubles.<br />\nSt. John's—E. H. Burwell and E. S. Powell<br />\nin the doubles, and Edward Duvall in the<br />\nsingles.<br />\nWestern Maryland—E. A. Cobey and F. L.<br />\nJohns in the doubles, and F. R. Holt in the<br />\nsingles.<br />\nFour Hundred and Forty Yards Dash—H.<br />\nThe contest began at io o'clock with a match<br />\nC. Patterson, Western Maryland College, first; between Duval of St. John's and Holt of<br />\nT. F. Riggs, Johns Hopkins University, Western Maryland. Duval won in two straight<br />\nsecond; J. E, Tyler, Johns Hopkins Univer- sets—score 6-o and 6-2. In the doubles the<br />\nsity, third ; E. E. Tarr, Western Maryland thing was reversed, and Western Maryland<br />\nCollege, fourth. Time,.54 2-5. Humphreys won out. Burwell and Powell won the first<br />\nof John Hopkins University, and Cronin of set by a score of 6-2 ; but Cobey and Johns<br />\nSt. Johns College also ran.<br />\ngot the next two sets, score 6-0, 6-2.<br />\nHalf Mile Run—J.T. England, Johns HopHopkins having won the championship last<br />\nkins University, first ; Crane, St. John's Colhad to play the winners of the preliminaries.<br />\nlege, second ; B. A. Stansbury, Western<br />\nthe singles Bush won two straight sets from<br />\nIn<br />\nMaryland College, third; W. H. Thatcher,<br />\nDuval, 6-2, 6-3. In the doubles Bush and<br />\nJohns Hopkins University, fourth. Time,<br />\nScholl beat Cobey and Johns, 6-1, 6-o.<br />\nAdler and Humphreys of Johns<br />\n2.10 4-5.<br />\nThe winners of each event were awarded<br />\nHopkins University, Roberts and Hall of St.<br />\nwhich had been prepared by the Intermedals,<br />\nWestern<br />\nof<br />\nTreadway<br />\nand<br />\nCollege,<br />\nJohn's<br />\nAssociation.<br />\ncollegiate<br />\nran.<br />\nalso<br />\nCollege<br />\nMaryland<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\n_<br /><br />\nLACROSSE.<br />\nseason of 1901 has been one<br />\nTHEofLacrosse<br />\nthe most successful we have seen,<br />\nthough it did not land us another championship. This year we endeavored to play the<br />\nvery best teams in the country, having little<br />\nidea that we could be so successful as we have<br />\nbeen. It being our stated policy to vie with<br />\nsuperiors, andl ose or win, as the case may be,<br />\nwith honor, rather, than to win with ease from<br />\nweaker teams.<br />\nIt is true we started our season this year<br />\nwith the most sanguine hopes. Last year we<br />\nlost three of the best Lacrosse men we ever<br />\nhad; MacInnes, whose place at in home we<br />\nhardly expected could be filled, Baetjer, whose<br />\ngoal-protecting ability was unequaled, and<br />\nFoster, whose strong third defense field play<br />\nwas unexcelled.. Then, too, \"Billy\" Maddren<br />\ncould not be with us to inspire, encourage and<br />\nstrengthen us. Knowing these difficulties, and<br />\napparently having no one at hand to fill these<br />\nvacancies, and a free-for-all open season in<br />\nprospect, could we expect any more than<br />\nto play our best and lose? Contrary to our expectations we have had even a more glorious<br />\nseason than heretofore.<br />\nOur first game opened as usual with the<br />\n\"All Baltimores\" who under the captaincy of<br />\nMaddren fully expected to win. But by steady,<br />\ncareful playing of our new team, J. H. U. won<br />\nby a score six to one.<br />\n•<br />\nIn this game it could be seen that even<br />\nthough our men were small they were capable<br />\nof putting up a fair game of Lacrosse. Again<br />\non April r3th, the Lacrosse Team from the<br />\nUniversity of Pennsylvania visited us, and at<br />\nAmerican League Park, in a hard, well contested game, we landed another victory for the<br />\nBlack and Blue.<br />\nThe Team of Teams, the Champions of the<br />\nthe Country, The Crescents, we played next.<br />\nWith the feeling of almost certain defeat, but<br />\nnot with the usual nervousness, our Lacrosse<br />\ntwelve appeared on Crescents' field in a pouring rain.<br />\nTo the surprise of all, our magnificent team<br />\nwork won, thus making us the first College<br /><br />\n:77<br /><br />\nteam that has beaten the Crescents for twelve<br />\nyears. It was, according to the Crescents, the<br />\nbest exhibition of scientific Lacrosse that they<br />\nhave seen, and they fully complimented our<br />\nboys. It is a fact, and unprecedented, that<br />\nthere was not a miss-pass nor a miss-catch on<br />\nHopkins' side during the whole game.<br />\nWith our hopes now raised, we entered the<br />\ncontest with City College of New York, at<br />\nElectric Park, and the fourth successive victory was won for the Black and Blue. Score<br />\nseven to one.<br />\nOn May the fourth, with Columbia, we had<br />\none of our hardest games, though comparatively easy victory. J. H. U. were victors by<br />\na score of seven to one. On the following<br />\nMonday, the sixth, before we had recovered<br />\nfrom the Columbia game, we were on the field<br />\nagainst our supposed hardest proposition; Harvard. But by good, clean, clever work another victory was insured for Hopkins, score<br />\nfour to naught. But this came not without<br />\nvery adverse results. The boys who were cut<br />\nup somewhat in the Columbia game were made<br />\nworse by the severe checking of Harvard, and<br />\na few of us were knocked out, causing no vain<br />\nhopes at Swarthmore. Not being able to practice for the following Saturday's game at<br />\nSwarthmore, our team endeavored to rest and<br />\nget in shape, but at Swarthmore it was evident<br />\nthat this was not accomplished. In one of the<br />\nhardest fought games of Lacrosse J. H. U.<br />\nhas witnessed, the Black and Blue lost the very<br />\nfirst game in four years to a college, Swarthmore. It was a hard fought game in every<br />\nsense, and the superior physical condition of<br />\nSwarthmore showed up in beautiful form, giving them the game four to two.<br />\nThus the season for 1901 ended, with six<br />\nvictories and one defeat, making one of the<br />\nbest records in Hopkins Lacrosse.<br />\nGoals scored: J. H. U. 33; Opponents 9.<br />\nGoals scored by Putts . . . . .ii<br />\n\" Hatch . . . . 7<br />\n\" B. Bernbeim . . 8<br />\n\" J. Bandel . . . 5<br />\n\" Abercrombie .<br />\n\" Straus<br />\nR. T. A.<br /><br />\nTHE NEWS-LETTER.<br />\nMR. DOOLEY ON LACROSSE<br /><br />\nI1<br /><br />\nEXCHANGE PLACE.<br /><br />\n(With apologies to P. P. Dunne)<br /><br />\nY. S. ESREVNOC.<br />\n44MARTIN,\" said Mr. Hennessy the other<br />\nday, \"pwhat have ye found in the paper<br />\nthet's absorbin yer atthention so that ye've let<br />\nyir poipe go owt? It must be exthramly intheresting t' ye.\"<br />\n\"Well,\" said Mr. Dooley, \"Oi've been radin<br />\nabout th' Lacrosse game.\"<br />\n\"The Lacrosse game, pwhat's thet?\"interrupted Hennessy.<br />\n\"Thet's just pwhat Oi asked Hogan's bye<br />\nth' ither day whin he came in with his face all<br />\nbr-ruised up, an he sed 'it's lacr-rosse Oi've<br />\nbin playin,' ses he 'all wan iv th' la-ads strruck me over th' head with a stick.' Oi hope<br />\nye lathered wan with your shillalah me bye,<br />\nses Oi. 'Ye don't understand' ses he, ''twas<br />\nin the game an it didn't mather f'r Oi kept th'<br />\nball an' our team wan. Would ye bike t' see<br />\nthe'game Mr. Dooley?' Thet Oi would ses Oi.<br />\nSo Hagan's bye br-rought me a thicket an'<br />\nOi wint t' see th' game.<br />\nThere was about two dozen fellows there in<br />\nsthriped shirts an'—well they looked loik the'd<br />\nfeegot t' put on their tr-rousers. They had a<br />\nball about th' soize av a limon, all' they threw<br />\nit around in little nets on th' ends av their<br />\nsthicks, and th' way they ran with it wud<br />\nmek yer hair sta-and on end, an' shafin at each<br />\nither with th' sthicks, all' they all wud get<br />\ninto a bunch in wan end av thr field an' somebody wud holler, \"Sh-shoot!\" and then the<br />\ncr-rowd wud yell bike ma-ad, fer they kept it<br />\nup f'r half an hour or more-re, but Oi didn't<br />\nsee anywan sh-shoot ath-all.<br />\n'Twas a gr-reat game, so Hogan's bye thold<br />\nme, th' gr-reathest game on earth, an' Oi war<br />\njust radin' th' iccount av it in th' pa-aper.<br />\nAnd he lit his pipe and went out.<br />\nww w<br /><br />\nTHE GOOD OF IT.<br />\nShe: That was a fortunate occurence at the<br />\nTower of Babel.<br />\nHe: I don't know, why?<br />\nShe: Just think how uncultured it would be<br />\nnot to know French.<br /><br />\nQuery:—Would the President of a criminal<br />\nclub be a Vice-President?<br />\n—U. of Chicago Weekly.<br />\nwww<br />\nProf: \"Tell me the name of the tropical belt<br />\nnorth of the Equator.\"<br />\nStudent: \"Can't sir.\"<br />\n.Prof: \"Correct, That will do.\"<br />\n—Ex.<br />\nw w w<br />\nNo doubt the careless yachtsman<br />\nWho casts anchor from o'er head,<br />\nDisturbs the chamber-mermaid<br />\nWho makes the oyster bed.<br />\n—Tiger.<br />\nW<br /><br />\nGrind: I find the way to learning decidedly<br />\nhard and long.<br />\nSport: Why don't you take a few cuts?<br />\n—Lampoon.<br />\nfir<br /><br />\nW<br /><br />\n'CELLO AND L<br />\nI went to call the other night<br />\nAnd, as she wished, I took my 'cello;<br />\nHer mother liked to hear me play,<br />\nSo in the room she had to stay;<br />\nI played till ten, then came away—<br />\nNothing doing.<br />\nI then bethought me of a plan<br />\nHow, when I went the week ensuing.<br />\nThere might, perchance,—Oh! Crafty man—<br />\nBe something doing.<br />\nI went again, this time supplied<br />\nWith a trusty penknife by my side.<br />\nThen just as I began to play,<br />\nShe chanced to turn her head away,<br />\nI cut my string—<br />\nSnap! \"That's too bad,<br />\nIt was the only A I had.\"<br />\nAnd so that night I couldn't play,<br />\nAnd mother didn't care to stay—<br />\nPlenty doing!<br />\nHoward J. White, in \"The Bruonian.\"<br />\nWI'•11r slIr<br /><br />\nFirst Fair One: Yes, Clarice laces awfully.<br />\nSecond Fair One: Really! I suppose it is a<br />\nmere matter of form.—C. C. N. Y. Arercury.<br /><br />\nMEMBERS OF<br /><br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br /><br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br /><br />\nCALL ()\\<br /><br />\nJAS. H. DOWNS,<br />\n229 N. eitaRLEs ST.<br />\nMASONIC TEMPLE.<br /><br />\nCLINTON P. PAINE cSc CO.<br />\nBANKERS<br /><br />\nAND<br /><br />\nPOR Class, Fraternity roid College Stationery, Banquet Cards,<br /><br />\nBROKERS,<br /><br />\n217 EAST GERMAN STREET,<br />\nBALTIMORE, MD.<br /><br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br /><br />\nSMOKE UP! RAH! RAH! RAIN! HOPKINS!!<br />\nTS<br /><br />\nANYTHING IN TOBACCO YOU WANT<br /><br />\nGO TO<br /><br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nThe Chas, Willms Surgical Instument Co,<br />\nBENJ. A. NELSON, GEN.L. MANAGER.<br /><br />\nI. D. LANG, TOBACCONIST,<br /><br />\nPhysicians,' Surgeons,' Hospital and hmalid Supplies.<br />\nFine Microscopes and Accessories,<br /><br />\n833 MADISON AVENUE<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br /><br />\n•<br /><br />\nBOX T RADE A SPECIALTY.<br /><br />\nBALTIMORE, MD.<br /><br />\n300 N. HOWARD ST.<br /><br />\nDrovers St Mechanics National Bank of Baltimore.<br />\nSurplus and Profits, $350,000.<br /><br />\nCapital.Stoek $300,000.<br /><br />\n5 WEST<br /><br />\nMUELLER,<br /><br />\nIN THE CITY.<br /><br />\nJar .9?on, $3.00 and 71,cnva.rd.<br /><br />\nMANUFACTURER OF<br /><br />\nA. H. FETT1NG,<br />\n14<br /><br />\nAND<br /><br />\nSpecial attention given to Holiday<br />\nwork and Croups, Class Pictures, etc.<br /><br />\nJ. 1). Wheeler, Cashier.<br />\nChas. S. Miller, Ass't Cashier.<br /><br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br /><br />\n.<br />\n'<br />\nSi<br /><br />\nFINEST PHOTOGRAPIC WORK<br /><br />\nTRANSACTS A GENERAL RANKING BUSINESS.<br /><br />\nSafo Vaposd<br /><br />\nLEXINOTON<br /><br />\n(LONDON STUDIO.)<br /><br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br /><br />\nGreek Cetter 'Fraternity<br />\njewelry.<br /><br />\nMASON &amp; HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first.<br />\nMoaiTz Mos:et:ow:mt.<br />\n(Signed)<br />\nrank.\"<br /><br />\n16 ST. PAUL STREET.<br /><br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\n321 N. Howard Street.<br /><br />\nC. H. Hildebrandt &amp; Son, Sole Agts.<br /><br />\nNI:W YORK TO BREMEN,<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nw w w<br />\nCABIN PASSAOE AT LOW<br /><br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br /><br />\nRATES.<br /><br />\nBALTIMORE TO BREMEN<br /><br />\nA. SCHUMACHER &amp; CO<br />\nFor particulars apply to<br /><br />\nSURETY<br /><br />\nDIRECT.<br /><br />\nGeneral Agents.<br /><br />\nthe liranz.Smith<br />\npiano.Co.<br /><br />\nki<br /><br />\nBONDS<br /><br />\n'Fidelity and Deposit Company of Maryland,<br /><br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br /><br />\nCbickering, Bradbury and Webster<br />\nf<br />\nti;<br /><br />\nINNS. it*<br /><br />\nC. &amp; P. Phone 2322-2.<br /><br />\nFactory Prices<br /><br />\nLIARTLIT:17r, HAYWARD do CO.<br />\n* * Tounders and Engineers, e e<br />\n1;<br />\nfilYitI4i1 hi<br /><br />\n'OR 111<br /><br />\n' 1-13-404.11 I, 1<br />\n,<br />\n,<br /><br />\nt<br /><br />\nWorks, Pratt and Scott Sts.<br />\nOffice Calvert and German Sts.<br />\no nu filet u rers oft.us t and Wrought Iron Work Cr linildings.<br />\nSI arcs, Railings, ISaleonies, Guards, Vaults and Arca Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nlIorizontal Tubular Boilers, Wrought Iron Tanks, Gas !folders, Purifiers, Condensers, etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Ilridges.<br />\nANIERIORIIRMIMMMEMMR1<br /><br />\nCHARLES AND LEXINGTON STS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS<br />\nSAFETY DEPOSIT BOXES.<br /><br />\nEDWIN WA RI:1E1,D, Pres't.<br />\nst Vice-Pres't, II. Crawford Black.<br />\nJos. R. titolieliraker.<br />\n211d<br />\n\"<br />\nThos. A lAlielan<br />\n\"<br />\n3rd<br /><br />\nBOOKS<br /><br />\nII. E. BOSLER, See'y-Treas.<br /><br />\nThe oldest Ohl Rook Store. and the lars.fe.:4<br />\nstock of ON ;meI New Books ill the City.<br />\n.<br />\nBooks bought, sold um! exchanged. .<br /><br />\nHarry Nicorh•linis,<br />\nAss't See'y Ti,<br /><br />\nW M.<br /><br />\nEISENBRANDT'S<br />\nLeading Dealersin Baltimore in every thing known in Music.<br />\nSole Agents for<br />\nGuitars, Banjos<br />\nand Zithers.<br />\nngclust, Automatic Attachments for<br />\n44:f1<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES,<br /><br />\n\"Washburn\" mundonns,<br /><br />\n201-203 N. CHARLES STREET.<br /><br />\nOld and<br /><br />\n605 N. Eutaw fit.<br /><br />\nV. PIPPEN.<br /><br />\nSTONEBRAKER BROS.,<br /><br />\nPRINTERS,<br />\nLet us Estimate on your Spring Catalogues, etc.<br />\n217<br /><br />\nE. BALTIMORE ST.<br /><br />\nS7vVITI-1, DIXON &amp; CO.<br />\nCALL AND CiET AN ESTIMATE.<br /><br />\not PAPER oe<br /><br />\nSTONE-BRAKER BROS.,<br />\nPRINTERS.<br /><br />\nii%-*liWfr*tVqri4-'4Wfrik4Wfr***tjWfrift<br /><br />\n29-31 S.. CI—I..AIR,LES ST_<br /><br />\nGlobe<br />\n1,<br />\nZ<br />\nBrewery<br /><br />\nt.1)<br /><br />\nLAGER BEERS<br />\n6014brau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br /><br />\nJ. Win. Panicle!),Lori.<br /><br />\nWin. B. Oliver.<br /><br />\nMIDDENDORF OLIVER &amp; CO.<br /><br />\nBankers and Brokers,<br />\n205 EAST GE:RN/IAN STREET,<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br /><br />\n6ifts for<br />\nBrides<br /><br />\nSilversmiths.<br /><br />\nBohemian<br /><br />\n• ORIGINALAND FAMOUS<br /><br />\nROCHESTER BEER. Bavarian<br />\ninaerzen 13rau<br />\nApollo<br /><br />\nTRADE MARK.<br /><br />\nBALTIMORE<br />\n• • BRANCH -f,•,&amp;<br /><br />\n217139SAENTRAL AVE<br /><br />\nGEO. C. SUCRO, Sole Agent.<br />\nTH,loione low<br />\nHome Telephone 2000<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class l'assengers<br />\nSt reasonable rates.<br />\nATLANTIC TIRANT.SIPOR'r CO.<br /><br />\n403409 WATER<br /><br />\n1 BROADWAY<br /><br />\nST.<br /><br />\nNEW YORK.<br /><br />\nLawrence IS. Kemp, President.<br /><br />\nUNIVERSITY<br />\nBOOK STORE,<br /><br />\nWilson Keyser, Cashier.<br /><br />\nCO[11[11ERCIFIL &amp; FFIRMERS NRTIONRL BRNK,<br />\nHOWARD AND GERMAN STREETS,<br />\nBALTIMORE, MD.<br /><br />\nTEXT nooas, NOTE BOOKS,<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nSTUDENTS SUPPLIES.<br /><br />\nTHE BLAKE CO.HABERDASHERS,<br /><br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nGODS--Low pmens.<br /><br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\nphotographs<br /><br />\nligentritz<br />\nStudio.<br /><br />\nSUCCESSOR TO CUMMINS<br />\n20<br /><br />\nTHE<br /><br />\nBALTIMORE.<br /><br />\nHENDERSON'S ,1<br /><br />\nHIGH GRADE<br /><br />\nBARTHOLOMAY'S<br /><br />\nOffice and Depot, 227-239 .S. Central Avenue.<br />\nMD.<br /><br />\nIN GREAT VARIETY.<br /><br />\ndIAL:0131 ett216 N. CHARLES ST.<br /><br />\nROCHESTER, N. Y.<br /><br />\n,GE.P;C•5 U C RO<br />\n,.......,ANAGER • • •<br /><br />\nESTABLISHED 1879.<br /><br />\nWedding Sil„AoWI<br /><br />\nBartholomay Brewery Co.<br /><br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nTIM). WARNER,<br /><br />\nJAMES<br /><br />\nR. PAINE.<br /><br />\nWARN ER &amp; CO.<br />\nUMBRELLAS, Q HATTERS, 40 CANES, ETC<br />\nAgents for Lincoln &amp; Bennett and Walter Barnard's London Hats.<br />\n3:24 W. flALTIN10IEE STFtE1jT.,<br />\nMANUFACTURERS OF<br /><br />\nSilk iind Cassitnere Ilats.<br /><br />\n\"Cilir\"Clr HOPKINS CAPS.<br /><br />\nplug 81Companu<br /><br />\nN STATIONERS.<br /><br />\nBOOKSELLERS Ari.<br /><br />\n34W. BALTIMORE STREET<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS BOOKS.<br /><br />\nWF.,'S1'<br />\nSPECIAL DISCOUNT TO STUDENTS.<br /><br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins II ospi Ltd and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\n1-1ELEN M. HOLLYDAY,<br />\n600 N. Li;LITANY ST.,<br />\nBALTIMORE, MD.<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br /><br />\n.linhenscr-Busch<br />\nBrewing liss'n<br /><br />\nYou get. the benefit of<br />\nall thislabor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cats[logue.<br />\nCHAS. M. STIIEFIP,<br />\n9 N. Liberty St., Baltimore, Md. 5211ffil St., N. W., Washington, I). C.<br /><br />\nTIEF<br />\nPiANos<br /><br />\nB. G. EICHELBERGER,<br /><br />\nSt. Louis Mo.<br /><br />\n]3OOKS AND STATIONERY,<br /><br />\nBrew the Best Beers<br />\nIII the World.<br /><br />\nENGRAVING AND STAMPING.<br />\nNo. 308 /%1c,r11-1 ellitrlos Street,<br />\nY. M. C. A. BUILDING,<br /><br />\n•ALTIMORE BRANCH:<br /><br />\nLOUIS ILLMER,<br />\nGen'l Agent and Mgr.<br />\nC. &amp;. P. Telephone<br />\n2314.<br /><br />\nC. &amp;P.Telephone 2351.<br /><br />\nSTONEBRAKER BROS.,<br />\n2 z E. Baltimore St.<br /><br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br /><br />\notif7)<br /><br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nSEASON,<br /><br />\nLEM MERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br /><br />\nLEMMERT<br /><br />\nNovember 7th, 1900.<br />\nWhile visiting the Paris Exposition of Iwo, the wonderful display of<br />\nwines from all parts of the world was made a special study by our representative, who secured some very fine euvees of French wines, both<br />\nred and white, such as Chateau Pontet Canet, Chateau Larose, Chateau Lafitte, Chatcau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s of Deinhard &amp; Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Offley Forrester &amp; Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped i n 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br /><br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br /><br />\n701-703-705 Madison Ave., Baltimore.<br /><br />\nLEMMERT<br /><br />\n14 E. FAYETTE STREET.<br /><br />\nS<br /><br />\nPECIAL, DISCOUNT!<br /><br />\nTo the Students and Nurses of Johns Hopkins we will make a<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br /><br />\nsr JEFFIR.ES STUDIO, sr<br /><br />\nl'll<br />\n0<br />\nll.,S<br /><br />\nOUR HERD, SIR,<br />\nMINOR'S,<br /><br />\n0<br />\n)<br />\n1 218 NORTH EUTAW STREET,<br /><br />\nis the<br /><br />\npa,:rril<br /><br />\nm<br />\ncgm<br />\nrofv<br />\noc;ti!,r,ya ,<br />\npe<br />\nelatrri<br />\nt!toncder.and<br />\n0<br />\ning OUR HATS.<br />\n‘<br />\n41<br />\nUP-TO-DATE,<br />\nt.<br />\n0<br />\n,a.se, ofi<br />\nONE PRICE.<br /><br />\nI0<br /><br />\n106 N. CHARLES STREET.<br /><br />\nBALTIMORE, MD.<br /><br />\n1<br />\n.)aitilteliketeleZZZZeZZ<br />\n,Z0ZZitelititalititeiainitititilletC.t<br /><br />\nBo<br /><br />\nIL<br /><br />\ntioLiApFEL &amp; ritirtt<br /><br />\nMANDOLINS, GUITARS aa BANJOS<br />\n\"Have a tone<br />\nThat's all their own.\"<br /><br />\nit Mandolins*<br /><br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br />\nNEAR SARATOGA ST.<br /><br />\nGUITARS AND BANJOS.<br /><br />\nOPEN EVENINGS.<br /><br />\nINSTRUMENTS TAKEN IN<br /><br />\nEXCHANCE.<br /><br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\n\"t '<br />\n4<br /><br />\n///////////,',<br /><br />\n`<br />\n'<br />\n4.T •,<br />\n\\\\•,4-4444\\'',C\"',4-7<br /><br />\n0, •<br /><br />\n'<br /><br />\narammialif<br /><br />\nNow Ready<br /><br />\nThe<br />\nHullabaloo<br />\nA limited number of copies may be secured<br />\nat the University Post Office, at Cushing's or ut Eichelberger's.<br /><br />\n1901<br /><br />\nThe Subscription Price is $1.25.<br />\nf:<br />\nr.'!1,\"<br />\n1LfIrl'77r,<br /><br />\n771<br />\nA1\"1\"175,.<br /><br />\n•<br /><br />\n•<br /><br />\n•tt:?::.:•ri7:i•<br /><br />\n•<br /><br />\n••<br /><br />\n•<br /><br />\n•<br /><br />\n7117<br />\nS\\<br />\n71<br />\n41179471<br />\n‘.,t \"rkAlli,M51737/711SM17107.1:3!=1,4\"1\"771\"lajr711\"1771\"'• ‘,,1`,1,017791\",...W.J.„<br /><br />"}], "field_media_file": [{"target_id": 36193, "display": null, "description": null, "target_type": "file", "target_uuid": "4750bb70-f4b2-43cc-ae51-2f887a0df765", "url": "http://digital.library.jhu.edu/system/files/2022-03/12180-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12180, "target_type": "node", "target_uuid": "4258a5bf-7278-4b42-8b27-b8ddc4c8a526", "url": "/node/12180"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f00101bd-dc3b-44be-82e0-a61adeee256e"}]}