{"mid": [{"value": 51016}], "uuid": [{"value": "0c6da060-3cf9-412c-986d-1bf918bbe539"}], "vid": [{"value": 51016}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T15:01:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "15615-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T15:01:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T15:01:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nTHE COUNTRY AROUND WASHIN GTON<br />\n<br />\nR<br />\n<br />\nB When, in George Waslnngton 8 tame, the site of the Caplfal<br />\n<br />\ntion on the Potomac, midway between the North and the South,<br />\n<br />\nthe word tidewater was a good one to conjure with, and naviga-<br />\n~ tion meant the largest means of commerce, for waterways then<br />\n<br />\n- afforded the easiest mode of travel and transportation. Other<br />\n<br />\n5 »1., modes there were, of course; wagons rumbled over rough roads,<br />\n- and stage coaches jostled ﬁ'orm town to town their loads of<br />\n<br />\nuneasy passengers, who had no thought of better or quicker<br />\n- Means of travel.<br />\n~would have dreamed of radiate in all directions fromi the<br />\nNation’s Capital, inviting new-fashioned power-dnven vehicles<br />\n~ to swift and casy riding; and steel rails that lead nortl, south,<br />\n. east, and west bear well-loaded trains which move at a speed<br />\nthat the foundersof the Nation would have considered perilous<br />\nor incredible.: Even the air has now become a thoroughfare,<br />\n~and aircraft may daﬂy be seen flying afar from an dviation field<br />\n- at Wasliington. :<br />\nTidewater nawgatmn may have lost some of its appeal in our<br />\n<br />\nday, yet from time to time light-draft war vessels of the United<br />\n<br />\nStates and of other nations ecome from' all the world’s seas to<br />\nanchor by the United States Navy Yard at Washington. The<br />\nPotomac is still the same noble river that was ferried by George<br />\nWashington—far more majestic than the Thames, the Seine, or<br />\nthe Tiber, on which stand great capitals of the Old World—<br />\nand its glamour is now glogiously enriched by sacréd memories.<br />\nThe Arlington Mangion, which was built on a site familiar to<br />\nGeorge Washington and which before the Civil War was the<br />\nhome of a great Southerner, stands to-day among thirty thou-<br />\n<br />\nsand graves as a shrine of national devotion and a pledge of<br />\n<br />\nnational unity: From the portals of the mansion the visitor<br />\n<br />\nmay see the river gleaming. just below, and beyond it liesa<br />\nscene that Lafayette, when a guest there, pronounced the<br />\nfinest in the world, now made still finer by a beautified city<br />\nthwt has become a place of pilgrimage for all Americans.<br />\n<br />\n“A few miles downstream from Arlington stands historic<br />\nAlexandria, where Washington worshiped, a eity much older<br />\nthau the Capital, lying midway between it and Mount Vernon,<br />\n<br />\nx the home of Washington, another American Mecca.<br />\n<br />\n* Annapolis, the capital of Maryland, thirty miles east of Wash -<br />\n_mv\\ton, stands at tidewater on the Severn, close to Chesapeake<br />\nBay, the largest and perhaps the most attractive body of water<br />\nof its kind along the Atlantic coast. Annapolis is proud of a<br />\nhistory that extends far back into Colonial times. There once<br />\nsat the Continental Congress, and there George Washington<br />\nresigned his commission as Commander in Chief. Future<br />\nofficers of our warships receive training at Annapolis, at the<br />\nUnited States Naval Academy.<br />\n<br />\nThe country around Washington shown on the other side of<br />\nthis sheet is full of historic memories. Bladensburg, a few<br />\nmiles northeast of the city, remembered for its old dueling<br />\nground, recalls to mind the death there of Commodore Decatur,<br />\n“the hero of Tripoli.” There also was made a feeble defense of<br />\nthe city against British-invaders who burned both the Capitol<br />\nand the White House in our second war with England. We<br />\n.remembeér, too, that later in that same war an American held<br />\nfor a time as a prisoner on a British vessel in the harbor of<br />\nBaltimore gave us in an hour of stress “The Star-Spangled<br />\nBanner.”<br />\n<br />\n~ The Civil War also left here its marks and its memories.<br />\n‘Through the streets of Frederick, forty miles northwest of<br />\nWashington, on that *‘cool September morn” sung by Whittier,<br />\n“Stonewall” Jackson’s men marched, menacingly, too near the<br />\nCapital. Later a small force under -the eommand of Jubal<br />\nEarly achieved the nearest approach ‘to the city made by the<br />\n“soldiers of the Southern Confederacy, in a battle whose site is<br />\nmarked by gravestones to be seen only a few miles north of<br />\nWashington. The curious traveler may stand to-day, if he<br />\nwill.just where Lincoln stood under fire in ’64 on the ram-<br />\nparts of an earthen fort to survey the scene of that buttle.<br />\nRemnants of similar forts that then made a chain around the<br />\ncity may still be found here and there in the suburbs. Sites<br />\nof battle fields dot the country southwest of Washington, across<br />\nthe Potomac. There on the map we may see the suggestive<br />\nnames Bull Run, Manassas, and Chantilly.<br />\n<br />\nSinee the days of the Civil War Washington has grown in<br />\npopulation fromeless than 100,000 to nearly 450,000 and<br />\nBaltimore from about 250,000 to more than 770,000, each<br />\n'spreadmg far beyond its war-time limits, and scores of villages<br />\nhave sprung up in the countrysrde between and around the<br />\ntwo cities.<br />\n<br />\nThis region recalls also some events of history of quite<br />\nanother kmd One of the earliest railroads operated in the<br />\n<br />\n- United States was _that between Washington and Baltimore,<br />\n<br />\nand the first telegraph line in the world carried words between<br />\nthose cities. Samuel Pierpont Langley, Secretary of the<br />\n<br />\nSmltheeman Institution, tried out on the Potomac near Wash-<br />\n<br />\nington, 1, amid general glbes and derision, hrs expenmental flying<br />\n<br />\n: .;of the United States was %gat the head of tldewater naviga-<br />\n<br />\nTo-day roads better than,ﬁeorge Waehmgton :<br />\n<br />\nmachmeﬁ that furmshed to later experimenters the .key to A<br />\n<br />\n,7,:-‘,_,” s T<br />\n<br />\nsuccess in the navigation of the air. -<br />\n<br />\nnational lixetory ~Great men -and great events are here fitly<br />\n<br />\ncommemorated in a national spmt and the visitor from any<br />\n<br />\nState may justly feel, as he views its impiessive memorials and<br />\n<br />\nits abounding beauty, that his Capital City may be proudly? :<br />\n_compared wrth any other of the world’s capitals. . s<br />\n<br />\nAmid all the stirring and s&gmﬁmnt events of human lnsto,<br />\n<br />\n <br />\n<br />\n- that are linked with this region the subtle yet effective work of i _ Chesapeake Bay is a fine example of what is called a “drowned. .<br />\n<br />\n‘natural forces on the face of the earth has here been carried<br />\nalong unceasingly.  The natural features of the region shotm<br />\non the map are those which are peculiar to the country that lies<br />\n<br />\nalong what is called the “fall line”—the line or zone in which<br />\n<br />\nthe streams of the southern Atlantic slope fall in cataracts - .<br />\n<br />\nor rapids. from the Piedmont Plateau to the Coastal Plain.<br />\nWashington, Baltimore, and other cities farther north or south<br />\n<br />\nstand in this zone, which marks the head of navigation and .<br />\n<br />\nso determined their location. In the area northwest of this<br />\nzone the streams flow swiftly or turbulently in rather narrow<br />\nchannels; in the area southeast of it, at least in this region, they<br />\nbecome broad tidal estuaries. The Potomac makes its largest<br />\nleap at Grreat Falls, about 16 miles above Washington, and it<br />\nfoams in a smaller cascade at Little Falls, about 5 miles above<br />\nthe city. Those who may journey to Great Falls will find<br />\nthere, on the Virginia side, a half-ruined stretch of a part of<br />\na canal built under the direction of George Washington as a<br />\nlink in a projected chain of waterways designed to connect the<br />\n<br />\n“East and the West of his day. This canal was replaced by<br />\n<br />\nthe Chesapeake and Ohio Canal, on the Maryland side of the<br />\n<br />\nriver, which extends from Washingfon to Cumberland. The<br />\n- seene at the falls is impressively wild and rugged. Here the<br />\n<br />\nriver has long been wearing its way into hard rocks—gnelss<br />\nand schist—and in a deep gorge thus made below the falls its<br />\nwaters surge swiftly forward in their course to the sea.<br />\n<br />\nAt Washington the Potomac is joined by the Anacostia— -<br />\n<br />\nthe “Eastern Branch” — on which, it is said, boats once<br />\nascended on tidewater to Bladensburg. In the Piedmont<br />\ncountry we can see how stream beds are cut; here, on the<br />\nCoastal Plain, ‘'we can see how, by similar slow yet ceaseless<br />\n<br />\n-natural processes, stream beds are filled up; and we have<br />\nlearned, too, that the crust of the earth, seemlngly so stable, -<br />\n<br />\nis really always in' quivering motion and that regions are raised<br />\n<br />\nor lowered by subterranean forces which . from age to Hge -<br />\n<br />\ntransform land to sea and sea to land.<br />\n<br />\nIt is by just such erosion and deposition and by such ups<br />\nand downs that geologic formations are made: Areas that<br />\nare uplifted or that stand high are gradually worn down<br />\nby rain and rill and slide and stream, rocks are broken up<br />\nby frost and chemical action into fragments; and the waste<br />\nthus formed is carried down and deposited elegwhere at one<br />\n<br />\n‘or another period of time as gravel and sand and mud in<br />\n<br />\ngreat patches or in widely extended deposits to make forma-<br />\ntions. A formation is thus merely a deposit or a series of<br />\n<br />\ndeposits laid down, generally in water, at a certain time and<br />\n<br />\nplace; the stuff of which it is made is @s old as the earth.<br />\n‘The record of the time in which it was formed—its geologic<br />\nage—can be learned best from the remnants of once living<br />\nbeings that made it their graveyard for every age bas its<br />\ncharacteristic fossils. :<br />\n<br />\nThe rocks that lie northwest of the fall line are in general<br />\nold and hard—rocks like granite—and evidently once lay far<br />\nbeneath the surface; those that lie southeast of that line are in<br />\ngeneral younger and softer, including sand and clay. The<br />\ngource .of the softer deposits was, of course, the harder, older<br />\nrocks, and the way in which these rocks are broken down<br />\ninto fragments may be seen in any natural or artificial cut that<br />\nexposes them to weatherir g, such as a streamway or a road cut.<br />\n<br />\nWhere the granitic rocks are thus disintegrated the minerals of -<br />\n<br />\nwhich they are composed-—quartz, mica, and feldspar, for ex-<br />\n<br />\nample—become loose sand and clay and, being then subject to -<br />\n<br />\nmovement by running water, are gradually carried downstream<br />\ntoward the sea—in this region southeastward. The oldest of<br />\n<br />\nthese southeasterly deposits were laid down in \"Cretaceous-<br />\n<br />\ntime, in what has been called the age of reptiles—not snakes,<br />\nfor snakes were rare in that age—but lizard-like and other<br />\nforms, some of them huge and unwieldy, much larger than<br />\n<br />\nalligators, others smaller, and still others having wings and -<br />\nBirds with teeth were among the strange<br />\n<br />\nthe power of flight. .<br />\nbeings of that age. The plants of Cretaceous time, which are<br />\nrecorded mainly by innumerable impressions of leaves, included<br />\nthe precursors of our present trees and shrubs. :<br />\n<br />\nUpon submerged Cretaceous deposits later formations were<br />\nlaid down by the combined action of erosion and deposition—<br />\nforces still here in operation.<br />\n<br />\nVoleanic rocks are found in the northwest quarter of the ’<br />\n<br />\nregion shown on the map, where, ages ago, lavas were poured<br />\n<br />\nout of vents that have not yet been discovered.<br />\n<br />\n <br />\n      <br />\n <br />\n<br />\nThe Capxtal City is itself a treasure house of mementos of -ff.;that extenﬁed far northeastward and southwestward from the<br />\n<br />\n..areaheremap o<br />\n<br />\n~ been called Ap;;alachla From this region, once the hlghest “‘E<br />\n- land in. the eastern part of-the country, material was washed %<br />\neastward to form the gently: dipping beds of the Coasml Plain, . g<br />\n<br />\ne Wlnch is an uplifted sea bottom:<br />\n<br />\n   <br />\n<br />\n\" river that emptied into the sea-at the presént moyth of the<br />\n<br />\n. to tobaceo, the main source of Colonial wealth here, and laterto<br />\n<br />\n: Baltimore.<br />\n<br />\n'geographlc provinces. but in some measure a boundary between<br />\n<br />\n_whlch grow here, but its'dominance in size is rivaled in some<br />\n<br />\ntrees—include conspicuously maple, elm, oak, and linden,<br />\n<br />\n- once a reproach to the city a saunterer may find many species<br />\n<br />\n-a geologic atlas of the country. The topographic maps show<br />\n<br />\n- height above sea level of all parts of every area mapped. These -<br />\n<br />\n- of 1 inch to 4 miles. Streams and their names are represented<br />\n<br />\n~ best roads are shown in red—main through roads of standard<br />\n<br />\n- nished .by Federal and State highway organizations and by<br />\n~ automobile associations.<br />\n<br />\n\" standard topographic maps published by the Geological Sur-<br />\n<br />\n. and vicinity me&eurmg about 44 by 53 inches, covering 583<br />\n<br />\n- ing the areas covered in dny State and the prices of the maps<br />\n<br />\n; 5 R : 9<br />\ne o : iy<br />\nWashmgbon atands on thie edge of the Pledr;wnt Plateau, e<br />\n~dow —remnantef-a-geat range of mountains =<br />\n<br />\n‘and was the highest part of a region that has ST<br />\n<br />\n <br />\n<br />\nThe Coastal Plam lmelf has had many ups a.nd downs. i‘\\_:<br />\n<br />\nval}ey —the old valley of the Susquehanna, once a mighty<br />\nbay but now in what was its Ewer stretch “drowned” by the<br />\nsinking of the land.<br />\n<br />\nThe deeper soils in the area shown on the map ‘naturally lie<br />\nsoutheast of the fall line, toward Chesapeake Bay, forming the<br />\ngarden land of the region mapped—land once given up largely<br />\n<br />\nIndian corn and other crops, bv* now devoted in great part -<br />\nto truck farming to supply the markets of Washmgm and<br />\n<br />\nThe fall lme malks not only the bound‘u'y betweeq two<br />\n<br />\ntwo biologic provmces—provmces of life. Many of the native<br />\nplants of the region are confined to one or the other side of -<br />\nthat line. Out of the 1,600 or more species of native plants -<br />\nfound in the area here mapped more than 300 grow only in the<br />\nPiedmont region and nearly 80 others do not grow far east of<br />\nit. On the other hand, nearly 200 species of these 1,600 grow<br />\nonly on the Coastal Plain and nearly 90 others do not grow -<br />\nfar west of it. '<br />\nThe largest tree in the region is the oak, many specles of<br />\n<br />\nareas by the tulip tree (Liriodendron), often. called the tuhp<br />\npoplar, whose soft wood is marketed as poplhr and is used in<br />\nmaking paper. The chestnut was once abundant here, but its<br />\nvery existence is now threatened by a widespread blight whose<br />\nravages have not yet been stopped by the most devoted scien-<br />\ntific study and effort. The beech, more beautiful, perhaps, than<br />\nany other, adorns the woodland here and there, its smooth,<br />\nwell-rounded trunk tempting defacement by the carved initials<br />\nof loiterers and lovers.<br />\n<br />\nThe native flora is well preserved in Rock Creek National<br />\n_ Park,-a ‘spacious reservation traversed by fine roads, bridle<br />\npaths, and footpaths that afford picturesque views in a charm-<br />\ning little valley through which the creek tumbles and ripples<br />\nfor miles on its way to the Potomac.<br />\n<br />\nThe trees of the city—and Washington is famous for its<br />\n<br />\nthough there are many others, and in the beautiful parks that<br />\nnow help to fill those “magnificent distances” which were<br />\n<br />\nof exotic trees and plants to lend interest to his stroll. -<br />\nUnited States topographic engineers and geologists are now<br />\nmaking surveys and preparing maps to form a topographic and<br />\n<br />\nall mountains, hills, valleys, streams, lakes, and other natural<br />\nfeatures, as well as all canals, roads, villages, towns, and cities.<br />\nThe form of the land is indicated by contour lines showing the<br />\n<br />\nmaps are sold at the cost of paper and printing.<br />\n<br />\nThe geologic maps are bound in folios that contain descrip-<br />\ntive texts and illustrations, which set forth the character and<br />\nextent of the geologic formations, the geologic hlstory, and the<br />\nmineral resources of the areas mapped.<br />\n<br />\nThe map here presented shows an area covermg one degree<br />\nof latitude and longitude, about 3,700 square miles, on a scale<br />\n<br />\nin blue, and the relief is indicated by shading, the light being -<br />\nassumed to come from the upper left side—the northwest. The<br />\n<br />\nconstruction by unbroken red lines, roads not so good by broken<br />\nred lines—and the poorer roads in black. Many of the poorer<br />\nroads, however, are fit for motor traffic in dry weather. The<br />\nroads have been thus classified according to information fur-<br />\n<br />\nThe map is the product of a reductlon of sixteen combined<br />\n<br />\nvey on a scale of 1 inch to 1 mile. A map of Washmgton<br />\nsquare mlles, on a Scale ‘of 2 inches to 1- m;le, has also been Vi e<br />\npubhshed 35 3 et _<br />\nStandard topograph‘le maps of more t,han two—ﬁfths of the<br />\nUnited States have beerr. published, and an index. map show- -<br />\n<br />\n <br />\n<br />\nmay be obtained from the I)lrector of the Geologwal Survey at<br />\nWashmgtdg_r<br />\n<br />\n <br />\n\f", "format": "basic_html", "processed": "<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nTHE COUNTRY AROUND WASHIN GTON<br /><br />\nR<br /><br />\nB When, in George Waslnngton 8 tame, the site of the Caplfal<br /><br />\ntion on the Potomac, midway between the North and the South,<br /><br />\nthe word tidewater was a good one to conjure with, and naviga-<br />\n~ tion meant the largest means of commerce, for waterways then<br /><br />\n- afforded the easiest mode of travel and transportation. Other<br /><br />\n5 »1., modes there were, of course; wagons rumbled over rough roads,<br />\n- and stage coaches jostled ﬁ'orm town to town their loads of<br /><br />\nuneasy passengers, who had no thought of better or quicker<br />\n- Means of travel.<br />\n~would have dreamed of radiate in all directions fromi the<br />\nNation’s Capital, inviting new-fashioned power-dnven vehicles<br />\n~ to swift and casy riding; and steel rails that lead nortl, south,<br />\n. east, and west bear well-loaded trains which move at a speed<br />\nthat the foundersof the Nation would have considered perilous<br />\nor incredible.: Even the air has now become a thoroughfare,<br />\n~and aircraft may daﬂy be seen flying afar from an dviation field<br />\n- at Wasliington. :<br />\nTidewater nawgatmn may have lost some of its appeal in our<br /><br />\nday, yet from time to time light-draft war vessels of the United<br /><br />\nStates and of other nations ecome from' all the world’s seas to<br />\nanchor by the United States Navy Yard at Washington. The<br />\nPotomac is still the same noble river that was ferried by George<br />\nWashington—far more majestic than the Thames, the Seine, or<br />\nthe Tiber, on which stand great capitals of the Old World—<br />\nand its glamour is now glogiously enriched by sacréd memories.<br />\nThe Arlington Mangion, which was built on a site familiar to<br />\nGeorge Washington and which before the Civil War was the<br />\nhome of a great Southerner, stands to-day among thirty thou-<br /><br />\nsand graves as a shrine of national devotion and a pledge of<br /><br />\nnational unity: From the portals of the mansion the visitor<br /><br />\nmay see the river gleaming. just below, and beyond it liesa<br />\nscene that Lafayette, when a guest there, pronounced the<br />\nfinest in the world, now made still finer by a beautified city<br />\nthwt has become a place of pilgrimage for all Americans.<br /><br />\n“A few miles downstream from Arlington stands historic<br />\nAlexandria, where Washington worshiped, a eity much older<br />\nthau the Capital, lying midway between it and Mount Vernon,<br /><br />\nx the home of Washington, another American Mecca.<br /><br />\n* Annapolis, the capital of Maryland, thirty miles east of Wash -<br />\n_mv\\ton, stands at tidewater on the Severn, close to Chesapeake<br />\nBay, the largest and perhaps the most attractive body of water<br />\nof its kind along the Atlantic coast. Annapolis is proud of a<br />\nhistory that extends far back into Colonial times. There once<br />\nsat the Continental Congress, and there George Washington<br />\nresigned his commission as Commander in Chief. Future<br />\nofficers of our warships receive training at Annapolis, at the<br />\nUnited States Naval Academy.<br /><br />\nThe country around Washington shown on the other side of<br />\nthis sheet is full of historic memories. Bladensburg, a few<br />\nmiles northeast of the city, remembered for its old dueling<br />\nground, recalls to mind the death there of Commodore Decatur,<br />\n“the hero of Tripoli.” There also was made a feeble defense of<br />\nthe city against British-invaders who burned both the Capitol<br />\nand the White House in our second war with England. We<br />\n.remembeér, too, that later in that same war an American held<br />\nfor a time as a prisoner on a British vessel in the harbor of<br />\nBaltimore gave us in an hour of stress “The Star-Spangled<br />\nBanner.”<br /><br />\n~ The Civil War also left here its marks and its memories.<br />\n‘Through the streets of Frederick, forty miles northwest of<br />\nWashington, on that *‘cool September morn” sung by Whittier,<br />\n“Stonewall” Jackson’s men marched, menacingly, too near the<br />\nCapital. Later a small force under -the eommand of Jubal<br />\nEarly achieved the nearest approach ‘to the city made by the<br />\n“soldiers of the Southern Confederacy, in a battle whose site is<br />\nmarked by gravestones to be seen only a few miles north of<br />\nWashington. The curious traveler may stand to-day, if he<br />\nwill.just where Lincoln stood under fire in ’64 on the ram-<br />\nparts of an earthen fort to survey the scene of that buttle.<br />\nRemnants of similar forts that then made a chain around the<br />\ncity may still be found here and there in the suburbs. Sites<br />\nof battle fields dot the country southwest of Washington, across<br />\nthe Potomac. There on the map we may see the suggestive<br />\nnames Bull Run, Manassas, and Chantilly.<br /><br />\nSinee the days of the Civil War Washington has grown in<br />\npopulation fromeless than 100,000 to nearly 450,000 and<br />\nBaltimore from about 250,000 to more than 770,000, each<br />\n'spreadmg far beyond its war-time limits, and scores of villages<br />\nhave sprung up in the countrysrde between and around the<br />\ntwo cities.<br /><br />\nThis region recalls also some events of history of quite<br />\nanother kmd One of the earliest railroads operated in the<br /><br />\n- United States was _that between Washington and Baltimore,<br /><br />\nand the first telegraph line in the world carried words between<br />\nthose cities. Samuel Pierpont Langley, Secretary of the<br /><br />\nSmltheeman Institution, tried out on the Potomac near Wash-<br /><br />\nington, 1, amid general glbes and derision, hrs expenmental flying<br /><br />\n: .;of the United States was %gat the head of tldewater naviga-<br /><br />\nTo-day roads better than,ﬁeorge Waehmgton :<br /><br />\nmachmeﬁ that furmshed to later experimenters the .key to A<br /><br />\n,7,:-‘,_,” s T<br /><br />\nsuccess in the navigation of the air. -<br /><br />\nnational lixetory ~Great men -and great events are here fitly<br /><br />\ncommemorated in a national spmt and the visitor from any<br /><br />\nState may justly feel, as he views its impiessive memorials and<br /><br />\nits abounding beauty, that his Capital City may be proudly? :<br />\n_compared wrth any other of the world’s capitals. . s<br /><br />\nAmid all the stirring and s&amp;gmﬁmnt events of human lnsto,<br /><br /><br /><br />\n- that are linked with this region the subtle yet effective work of i _ Chesapeake Bay is a fine example of what is called a “drowned. .<br /><br />\n‘natural forces on the face of the earth has here been carried<br />\nalong unceasingly.  The natural features of the region shotm<br />\non the map are those which are peculiar to the country that lies<br /><br />\nalong what is called the “fall line”—the line or zone in which<br /><br />\nthe streams of the southern Atlantic slope fall in cataracts - .<br /><br />\nor rapids. from the Piedmont Plateau to the Coastal Plain.<br />\nWashington, Baltimore, and other cities farther north or south<br /><br />\nstand in this zone, which marks the head of navigation and .<br /><br />\nso determined their location. In the area northwest of this<br />\nzone the streams flow swiftly or turbulently in rather narrow<br />\nchannels; in the area southeast of it, at least in this region, they<br />\nbecome broad tidal estuaries. The Potomac makes its largest<br />\nleap at Grreat Falls, about 16 miles above Washington, and it<br />\nfoams in a smaller cascade at Little Falls, about 5 miles above<br />\nthe city. Those who may journey to Great Falls will find<br />\nthere, on the Virginia side, a half-ruined stretch of a part of<br />\na canal built under the direction of George Washington as a<br />\nlink in a projected chain of waterways designed to connect the<br /><br />\n“East and the West of his day. This canal was replaced by<br /><br />\nthe Chesapeake and Ohio Canal, on the Maryland side of the<br /><br />\nriver, which extends from Washingfon to Cumberland. The<br />\n- seene at the falls is impressively wild and rugged. Here the<br /><br />\nriver has long been wearing its way into hard rocks—gnelss<br />\nand schist—and in a deep gorge thus made below the falls its<br />\nwaters surge swiftly forward in their course to the sea.<br /><br />\nAt Washington the Potomac is joined by the Anacostia— -<br /><br />\nthe “Eastern Branch” — on which, it is said, boats once<br />\nascended on tidewater to Bladensburg. In the Piedmont<br />\ncountry we can see how stream beds are cut; here, on the<br />\nCoastal Plain, ‘'we can see how, by similar slow yet ceaseless<br /><br />\n-natural processes, stream beds are filled up; and we have<br />\nlearned, too, that the crust of the earth, seemlngly so stable, -<br /><br />\nis really always in' quivering motion and that regions are raised<br /><br />\nor lowered by subterranean forces which . from age to Hge -<br /><br />\ntransform land to sea and sea to land.<br /><br />\nIt is by just such erosion and deposition and by such ups<br />\nand downs that geologic formations are made: Areas that<br />\nare uplifted or that stand high are gradually worn down<br />\nby rain and rill and slide and stream, rocks are broken up<br />\nby frost and chemical action into fragments; and the waste<br />\nthus formed is carried down and deposited elegwhere at one<br /><br />\n‘or another period of time as gravel and sand and mud in<br /><br />\ngreat patches or in widely extended deposits to make forma-<br />\ntions. A formation is thus merely a deposit or a series of<br /><br />\ndeposits laid down, generally in water, at a certain time and<br /><br />\nplace; the stuff of which it is made is @s old as the earth.<br />\n‘The record of the time in which it was formed—its geologic<br />\nage—can be learned best from the remnants of once living<br />\nbeings that made it their graveyard for every age bas its<br />\ncharacteristic fossils. :<br /><br />\nThe rocks that lie northwest of the fall line are in general<br />\nold and hard—rocks like granite—and evidently once lay far<br />\nbeneath the surface; those that lie southeast of that line are in<br />\ngeneral younger and softer, including sand and clay. The<br />\ngource .of the softer deposits was, of course, the harder, older<br />\nrocks, and the way in which these rocks are broken down<br />\ninto fragments may be seen in any natural or artificial cut that<br />\nexposes them to weatherir g, such as a streamway or a road cut.<br /><br />\nWhere the granitic rocks are thus disintegrated the minerals of -<br /><br />\nwhich they are composed-—quartz, mica, and feldspar, for ex-<br /><br />\nample—become loose sand and clay and, being then subject to -<br /><br />\nmovement by running water, are gradually carried downstream<br />\ntoward the sea—in this region southeastward. The oldest of<br /><br />\nthese southeasterly deposits were laid down in \"Cretaceous-<br /><br />\ntime, in what has been called the age of reptiles—not snakes,<br />\nfor snakes were rare in that age—but lizard-like and other<br />\nforms, some of them huge and unwieldy, much larger than<br /><br />\nalligators, others smaller, and still others having wings and -<br />\nBirds with teeth were among the strange<br /><br />\nthe power of flight. .<br />\nbeings of that age. The plants of Cretaceous time, which are<br />\nrecorded mainly by innumerable impressions of leaves, included<br />\nthe precursors of our present trees and shrubs. :<br /><br />\nUpon submerged Cretaceous deposits later formations were<br />\nlaid down by the combined action of erosion and deposition—<br />\nforces still here in operation.<br /><br />\nVoleanic rocks are found in the northwest quarter of the ’<br /><br />\nregion shown on the map, where, ages ago, lavas were poured<br /><br />\nout of vents that have not yet been discovered.<br /><br /><br /><br /><br /><br />\nThe Capxtal City is itself a treasure house of mementos of -ff.;that extenﬁed far northeastward and southwestward from the<br /><br />\n..areaheremap o<br /><br />\n~ been called Ap;;alachla From this region, once the hlghest “‘E<br />\n- land in. the eastern part of-the country, material was washed %<br />\neastward to form the gently: dipping beds of the Coasml Plain, . g<br /><br />\ne Wlnch is an uplifted sea bottom:<br /><br /><br /><br />\n\" river that emptied into the sea-at the presént moyth of the<br /><br />\n. to tobaceo, the main source of Colonial wealth here, and laterto<br /><br />\n: Baltimore.<br /><br />\n'geographlc provinces. but in some measure a boundary between<br /><br />\n_whlch grow here, but its'dominance in size is rivaled in some<br /><br />\ntrees—include conspicuously maple, elm, oak, and linden,<br /><br />\n- once a reproach to the city a saunterer may find many species<br /><br />\n-a geologic atlas of the country. The topographic maps show<br /><br />\n- height above sea level of all parts of every area mapped. These -<br /><br />\n- of 1 inch to 4 miles. Streams and their names are represented<br /><br />\n~ best roads are shown in red—main through roads of standard<br /><br />\n- nished .by Federal and State highway organizations and by<br />\n~ automobile associations.<br /><br />\n\" standard topographic maps published by the Geological Sur-<br /><br />\n. and vicinity me&amp;eurmg about 44 by 53 inches, covering 583<br /><br />\n- ing the areas covered in dny State and the prices of the maps<br /><br />\n; 5 R : 9<br />\ne o : iy<br />\nWashmgbon atands on thie edge of the Pledr;wnt Plateau, e<br />\n~dow —remnantef-a-geat range of mountains =<br /><br />\n‘and was the highest part of a region that has ST<br /><br /><br /><br />\nThe Coastal Plam lmelf has had many ups a.nd downs. i‘\\_:<br /><br />\nval}ey —the old valley of the Susquehanna, once a mighty<br />\nbay but now in what was its Ewer stretch “drowned” by the<br />\nsinking of the land.<br /><br />\nThe deeper soils in the area shown on the map ‘naturally lie<br />\nsoutheast of the fall line, toward Chesapeake Bay, forming the<br />\ngarden land of the region mapped—land once given up largely<br /><br />\nIndian corn and other crops, bv* now devoted in great part -<br />\nto truck farming to supply the markets of Washmgm and<br /><br />\nThe fall lme malks not only the bound‘u'y betweeq two<br /><br />\ntwo biologic provmces—provmces of life. Many of the native<br />\nplants of the region are confined to one or the other side of -<br />\nthat line. Out of the 1,600 or more species of native plants -<br />\nfound in the area here mapped more than 300 grow only in the<br />\nPiedmont region and nearly 80 others do not grow far east of<br />\nit. On the other hand, nearly 200 species of these 1,600 grow<br />\nonly on the Coastal Plain and nearly 90 others do not grow -<br />\nfar west of it. '<br />\nThe largest tree in the region is the oak, many specles of<br /><br />\nareas by the tulip tree (Liriodendron), often. called the tuhp<br />\npoplar, whose soft wood is marketed as poplhr and is used in<br />\nmaking paper. The chestnut was once abundant here, but its<br />\nvery existence is now threatened by a widespread blight whose<br />\nravages have not yet been stopped by the most devoted scien-<br />\ntific study and effort. The beech, more beautiful, perhaps, than<br />\nany other, adorns the woodland here and there, its smooth,<br />\nwell-rounded trunk tempting defacement by the carved initials<br />\nof loiterers and lovers.<br /><br />\nThe native flora is well preserved in Rock Creek National<br />\n_ Park,-a ‘spacious reservation traversed by fine roads, bridle<br />\npaths, and footpaths that afford picturesque views in a charm-<br />\ning little valley through which the creek tumbles and ripples<br />\nfor miles on its way to the Potomac.<br /><br />\nThe trees of the city—and Washington is famous for its<br /><br />\nthough there are many others, and in the beautiful parks that<br />\nnow help to fill those “magnificent distances” which were<br /><br />\nof exotic trees and plants to lend interest to his stroll. -<br />\nUnited States topographic engineers and geologists are now<br />\nmaking surveys and preparing maps to form a topographic and<br /><br />\nall mountains, hills, valleys, streams, lakes, and other natural<br />\nfeatures, as well as all canals, roads, villages, towns, and cities.<br />\nThe form of the land is indicated by contour lines showing the<br /><br />\nmaps are sold at the cost of paper and printing.<br /><br />\nThe geologic maps are bound in folios that contain descrip-<br />\ntive texts and illustrations, which set forth the character and<br />\nextent of the geologic formations, the geologic hlstory, and the<br />\nmineral resources of the areas mapped.<br /><br />\nThe map here presented shows an area covermg one degree<br />\nof latitude and longitude, about 3,700 square miles, on a scale<br /><br />\nin blue, and the relief is indicated by shading, the light being -<br />\nassumed to come from the upper left side—the northwest. The<br /><br />\nconstruction by unbroken red lines, roads not so good by broken<br />\nred lines—and the poorer roads in black. Many of the poorer<br />\nroads, however, are fit for motor traffic in dry weather. The<br />\nroads have been thus classified according to information fur-<br /><br />\nThe map is the product of a reductlon of sixteen combined<br /><br />\nvey on a scale of 1 inch to 1 mile. A map of Washmgton<br />\nsquare mlles, on a Scale ‘of 2 inches to 1- m;le, has also been Vi e<br />\npubhshed 35 3 et _<br />\nStandard topograph‘le maps of more t,han two—ﬁfths of the<br />\nUnited States have beerr. published, and an index. map show- -<br /><br /><br /><br />\nmay be obtained from the I)lrector of the Geologwal Survey at<br />\nWashmgtdg_r<br /><br /><br />"}], "field_media_file": [{"target_id": 51939, "display": null, "description": null, "target_type": "file", "target_uuid": "83e7795c-5022-4d84-b13d-531ff4142684", "url": "http://digital.library.jhu.edu/system/files/2022-03/15615-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 15615, "target_type": "node", "target_uuid": "69d7be75-09c2-4833-a5da-97ac6c4aa92b", "url": "/node/15615"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b4e40da0-c0c5-4c98-a751-351c19b3f870"}]}