{"mid": [{"value": 35563}], "uuid": [{"value": "e0e6e3b9-b5f6-48cf-9273-35ae9187d693"}], "vid": [{"value": 35563}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:08:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12116-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:08:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:08:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "SA MPT,<br />\nVol. III.<br />\n<br />\nt<br />\n<br />\nt<br />\n<br />\nOCTOBER 13th, 1<br />\n<br />\n4.<br />\n<br />\nj.111.<br />\n<br />\ntbe<br />\n<br />\n00,140/,VyS<br />\nPRESIDENT'S OFFICE.<br />\n<br />\nApiCIOs<br />\n<br />\ntiter<br />\n<br />\n•<br />\n<br />\nPublished by Students of<br />\n+ THE JOHNS HOPICINS<br />\n<br />\nPress of<br />\n• Guggenheimer, Weil & Co. A<br />\n_<br />\n_<br />\n<br />\nf UNIVERSITY<br />\n<br />\n.... ISSUED<br />\n<br />\n't<br />\n<br />\nBALTIMORE<br />\n<br />\n.Pt<br />\n<br />\nFORTNIGHTLY<br />\n-1446<br />\n<br />\n\fCushing & Company,IfiIii<br />\n<br />\n413<br />\n<br />\nNEW—<br />\n<br />\nBOONS 0Lb<br />\n<br />\nThe oldest Old-Book Store,•and the largest stock<br />\nof Old and New Books in the City. Books bought<br />\nand exchanged.<br />\nWM,<br />\n<br />\nBOOKSELLERS AND<br />\nSTATIONERS<br />\n<br />\n34 WEST BALTIMORE STREET.<br />\nSCHOOL, LAW, MEDICAL, AND CLASSICAL<br />\n<br />\nAND<br />\n<br />\nMISCELLANEOUS BOOKS.<br />\n<br />\nKeep eonatently on hand the Text Books used In Johns Hopkins Univeretty, Johns Hopkins<br />\nHospital, mid The Woman's College of Baltimore.<br />\n<br />\nV. PIPPEN,<br />\n<br />\nSTATIONERY.—For School, Family,(Mike and Bank.<br />\n<br />\n327 NORTH CHARLES STREET.<br />\n<br />\nr livEnsint Hurron<br />\n<br />\nB. G. E1CHELBERGER,<br />\n1300 KS fiND STATIONERY,<br />\n308 N. CHARLES ST.<br />\nT. a. O. A. BUILDIXO.<br />\n<br />\nBaltimore, Md.<br />\n<br />\n•<br />\n<br />\nROOMS<br />\n<br />\nPleasant second and third story rooms; also table<br />\nboard, good service, best of food.<br />\nPrice to J. H. 11. Men $3.00 weekly.<br />\n<br />\nAND<br />\n<br />\nMrs.<br />\n<br />\nBoard<br />\nALBERT<br />\n<br />\nILEENE,<br />\n1204 MeCulloh Street.<br />\n<br />\nr. PIIILBIN,<br />\n<br />\n'Mtn&ertaker anti<br />\n. 3Fitib lamer .<br />\n<br />\n(ISSUED CVLIIY<br />\n<br />\nrnisar.)<br />\n<br />\n2-1_,Z3_171;)<br />\n72.1713_ 1Z.,11./<br />\n1321.1.,TI1VLOR,..E,<br />\n<br />\nTelephone No. 3589.<br />\n<br />\nD.<br />\n<br />\nThe Society Paper of Baltimore.<br />\n<br />\nJOHN M. KEELER,<br />\n. TAILOR.<br />\n<br />\nLarge Stock, Popular Prices, Good Fitting, Prompt Delivery,<br />\n<br />\nBRIGHT AND BRF.F.7Y.<br />\n<br />\n5 N. CALVERT ST.<br />\n<br />\n4 4%, UPA<br />\n0%4% 4%4I 41,<br />\n<br />\n0$04.1\"„ov. estay. vP. OP.<br />\n<br />\nj<br />\n,10<br />\n<br />\n.<br />\n<br />\n•0‘<br />\n<br />\n\"<br />\n<br />\nNpSS1N HO*<br />\nE<br />\n4 416C0<br />\n<br />\n)<br />\nir<br />\nSter<br />\nY<br />\n4S<br />\nernie,k<br />\n<br />\n?e6tobe<br />\nLit411,ts<br />\nERS<br />\nLITHOG RAPHERS<br />\n, telter5;1)ocumenis,Le;a1 Blank3 STATIOS<br />\na PRINTERS<br />\ngooxcase;<br />\n<br />\nSI<br />\n<br />\n109 ILIIALTD.ST.<br />\n<br />\n41<br />\n<br />\n94<br />\n<br />\nAeneAk'<br />\n<br />\nI:10-<br />\n<br />\nr.erawf<br />\n<br />\n.<br />\nr4<br />\n;<br />\nre<br />\n<br />\ngot,<br />\n<br />\nt, (1_,<br />\n<br />\n%tab<br />\n<br />\n\fZile 1Rew/Letter,<br />\nVol. III.<br />\n<br />\nFortnightly<br />\n<br />\nTHE SALVATION OF THE GRADUATE<br />\nSTUDENT.<br />\n<br />\nThe average graduate student himself would<br />\nprobably be the last to admit that he needed<br />\nsalvation—that is, at least, any earthly kind.<br />\nHe is, of course, as a rule, passably well endowed with religious instincts, and therefore<br />\nquite willing to confess that he is \"a miserable<br />\nsinner;\" but that is far from saying that the<br />\nrest of mankind is not also thus, and even<br />\nmore so. Quite the contrary! He has—<br />\nprobably all his life, certainly through the<br />\nterm of his college and university existence—<br />\nworked harder and revelled less than the most<br />\nof his companions. Even now he is mortifying his flesh for the good of his higher nature<br />\nby incessant studying, both night and day.<br />\nHow absurd, then, that anyone should project<br />\nthe leavening of his stern rectitude with a little more of human frailty, and call that—his<br />\nsalvation. And yet he needs just this. He<br />\nmay have withstood the temptations of drinking, gambling, loafing, and all the rest. He<br />\nmust still be saved from himself; that is, from<br />\nthe conditions which at present surround him.<br />\nThe truth of this will become evident on a<br />\nlittle reflection. When a man enters upon<br />\nsome special graduate work, he finds that his<br />\ndepartment gives him much more of advantages than of time in which to avail himself<br />\nof them. These advantages have, perhaps,<br />\ncost him some sacrifice to obtain, while to enjoy them he has only this one opportunity.<br />\nSo he feels—and justly—the need of compressing all outside demands on his time into<br />\nthe smallest bounds possible, that he may<br />\ngive the utmost of it to his specialty.<br />\nBut though this cramming of his time is<br />\nnecessary, there is yet attendant on it a twofold danger. In the first place, his nervous<br />\nsystem is bound to suffer from the unremitting tax upon it; the importance of this point,<br />\nanyone who reads the article in Outing of Oc-<br />\n<br />\nNo<br />\n<br />\ntober 1st on Relaxation is sure to recognize.<br />\nAnd, in the second place, he is liable to undergo that of the sympathies, involved in pure<br />\nspecialization, and fatal to him if he intends<br />\nto take a place, and a worthy one, in life. For<br />\nhow can a teacher, for instance, get the best<br />\nresults from the men under him, unless he is<br />\nin actual comprehending sympathy with the<br />\nnature of each of them? And how can he be<br />\nin such sympathy, when he has renounced the<br />\nworld about him for a narrow double ego—<br />\nhimself and his special line of study? I do<br />\nnot say that this has actually happened to<br />\nmany, or even any, of our graduates; but I<br />\nbelieve it to be a danger which threatens all.<br />\nTo counteract this dangerous tendency,<br />\nthere are at present no means at his hand.<br />\nNone, at least, within the University. He<br />\nmay go into society, should he possess or be<br />\nable to form an outside circle of friends.<br />\nShould he do so, it is bound to prove a serious<br />\ndistraction and handicap to his work. But<br />\nof the companionship most likely to be of<br />\nvalue to himself—the men of other departments of his own University, whose life and<br />\npurposes lie along the same lines as his<br />\nown, yet who have, from the difference of<br />\ntheir work, a certain refreshing difference<br />\nof ideas—of this he has none. He may<br />\nmeet them at boarding-house or fraternity;<br />\nhe may have known them before he came<br />\nhere. But as far as his university existence<br />\ngoes, there is no reason whatever why he<br />\nshould ever come to know them. There is,<br />\nindeed, a -Graduate Students' Association\"<br />\nwhose name would imply some commingling<br />\nof its members. But in the first place, only<br />\na small proportion of the graduates belong to<br />\nthe Association. And those who do need<br />\nnever see each other, except at the semi-occasional cake and lemonade functions—mournful affairs, whose stiff conversation is not at<br />\nall calculated to compensate a man for giving<br />\n<br />\n\f'7<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nup an evening's work, fighting his way into \"'howdy!\" \"how's the boy?\" \"come over here<br />\na dress suit and high collar, and then spend- and sit down by me; I want to talk to you;\"<br />\n\"oh, do you know so and so? I want you to<br />\ning his time in extreme boredom.<br />\nmeet him. You'll be interested in hearing<br />\nnow<br />\nAs the Graduate Students' Association<br />\nhim<br />\ntalk,\" and so on. A few more pleasant<br />\nuseless.<br />\nstands, it is useless, and worse than<br />\na little fun and chaffing, an<br />\nacquaintances,<br />\nlapsInterest in it has lapsed signally, and in<br />\nrelaxation. And if, after<br />\nthorough<br />\nof<br />\nevening<br />\ning has taken away the most of its efficiency.<br />\nmake bold to tell a<br />\nshould<br />\none<br />\nsome<br />\nwhile,<br />\na<br />\nThere has, indeed, been as much scrapping<br />\nlet him do that,<br />\nsong—why,<br />\na<br />\nsing<br />\nor<br />\nand \"peanut politics\" over its elections as if story<br />\nits officer were to be endowed with the power too.<br />\nof doing some good. But the factional feel\"A little nonsense, now and then,<br />\ning this produces is only another drawback.<br />\nis relished by the best of men.\"<br />\nIs there a remedy for this state of affairs?<br />\nThat this is practicable, and no more exLook back at the records of the University's<br />\nyounger days; a time when the closest and pensive than the present system of \"recepmost cordial relations existed between all the tions,\" is certain. That a majority of the<br />\ngraduate students; when a man numbered men desire it to come to pass I know. Otheramong his best friends students and profes- wise I would have hardly ventured the exsors of other departments. These were the pression of such radical opinions. But whatdays when the old University Club—a univer- ever may be done in the matter, let one effort<br />\nsity club in fact as well as name—held its be made—to break up this constant classifyweekly social meetings in rooms near the Uni- ing of men into the departments to which they<br />\nversity; where, moreover, a man could at all belong. As Professor Adams has written:<br />\ntimes drop in and be apt to find a friend to \"Whatever social differentiation the academic<br />\nbody may experience, we should always hold<br />\nchat with in its quiet atmosphere.<br />\nthe student assemblies and folk-mote.<br />\nto<br />\nHopkins has, in growing, outgrown the<br />\nwe are in danger of degenerating<br />\nOtherwise<br />\nability of maintaining such close relations becliques and academic snobbery.<br />\nsocial<br />\ninto<br />\ntween all its men; but a new postgraduate<br />\nclub, following the lines of the original UniEDGEWORTH SMITH.<br />\nversity Club, might go far towards re-establishing those former conditions. A remedy<br />\nmore immediate and practical, however, than<br />\nthis, lies in our hands. Let every graduate<br />\nALumni NOTES.<br />\njoin the Graduate Students' Association, if he<br />\nis not already a member; and let him make<br />\nChas. K. Edmunds, A. B. '97, temporarily<br />\nthe Association offer him, in return, not<br />\nmerely occasional and very formal functions, occupies the chair of Physics in the Univerbut also something on the order of what have sity of Utah, at Salt Lake City.<br />\nnow come to be known generically as \"smo-t1W/Mtit<br />\nMr. C. E. Phelps, C. E. '95, has been apkers\"—meetings held in some place meant for<br />\nlounging, to which no man is formally in- pointed engineer of the Baltimore City SOvited, yet in failing to attend which every man way Commission.<br />\nwould feel that he had missed something;<br />\naffairs to which he can go in his every-day<br />\nJohn H. Latane, Pb. D.'95, will be lecturer<br />\nclothes, jumping up from his work, and per- in American Diplomatic History at this Unihaps bringing his pipe along with him. To versity.<br />\nbe greeted on his entrance with a \"hello!\"<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nTHE COLLEGE CONGRESS.<br />\n<br />\nGraded instruction in public speaking, continuing through the three years of residence,<br />\nis now an established feature of the Hopkins<br />\ncollegiate course. The general acceptance of<br />\nthe work done last year, the favorable appearance of the contestants in public debate, and<br />\nevident appreciation on the part of the men,<br />\nhas Sled to an increase of hours for the course<br />\nand a broadening of its scope. The instruction will be given, as last year, by Dr. Guy<br />\nCarleton Lee.<br />\nThe Senior and Junior classes will meet an<br />\nhour weekly, with the exception of the winter<br />\nterm, when the Seniors will meet every other<br />\nweek only. The Senior class, as formerly,<br />\nwill be organized as a Senate; the Juniors as<br />\na House of Representatives. This College<br />\nCongress, however, will convene only on alternate weeks; every second week will'be devoted to class instruction in Parliamentary<br />\nLaw and Practice, extemporaneous speaking<br />\nand debate. In the Senior class no text book<br />\nwill be employed other than a syllabus prepared by Dr. Lee. As a work of reference, \"Roberts's Parliamentary Syllabus\" and<br />\n\"Rules of Order\" will be used by the Junior<br />\nclass.<br />\nIn addition to the regular weekly meetings,<br />\nconferences will be arranged for the upper<br />\nclassmen, for the study of methods of collecting and sifting evidence, drawing briefs and<br />\npreparation for debate.<br />\nA happy innovation in the College Congress will be the arrangement in a related series of the subjects for debate. Each topic will<br />\nbe some phase of the great question of Territorial Expansion now so widely agitated. The<br />\nsubjects will be so planned that there will be<br />\nno interlocking of arguments, and the entire<br />\nseries will furnish a practical survey of Politics in the Nineteenth Century. The public<br />\nand inter-class debate in the spring will be<br />\nbased on the subject matter of the winter's<br />\nstudies. i. his thorough preparation will forcefully and brilliantly arm the contestants.<br />\nMore time this year will be given to open<br />\n<br />\n3<br />\n<br />\ndebate, as but two speakers on each side will<br />\nregularly be assigned.<br />\nThe Freshmen class is divided into sections<br />\nfor the study of Description, Narration, Exposition and Argument, as used in speaking.<br />\nNo text is available for the course, because of<br />\nits practical nature, so a syllabus prepared<br />\nby Dr. Lee, issued week by week, will be used.<br />\nThe class will participate in the contest in<br />\npublic speaking next spring.<br />\n<br />\nsunriAri.<br />\nDere ez a soun' ob Summah in de air;<br />\nSweet music am wafted on de breeze:<br />\nHyeah de crickets chirpin' in de low grass,<br />\nWhile de frogs air trillin' in de trees.<br />\nHan' en han' we wu walkin' thoo de meddah,<br />\nWif de moonbeams spawklin' on huh ha'ar,<br />\n'Twell my hea't wu' a'trippin' lak a hammah,<br />\nEz I gaze on my 'Liza Ann so fair.<br />\nIt seem lak de Heabens gone done open,<br />\nWif de angels ahoy' rin all aroun';<br />\n0 true-love, de Glory-Lan' wu' breakin'I<br />\nGold an' silba lay scattud o' de groun'.<br />\nWe ling'ud by de gate neah de yellums;<br />\nI drew clos'a, stan'in' by huh side,<br />\nHuh haid res'in' sof'ly on my should'a—<br />\nI pine den to tek huh fo' my bride.<br />\nPorn my hea't came de words dat I whisp'ud,<br />\nSof' en low, whisp'ud only fo' huh ears;<br />\nOn huh cheek a di'mun' seem to glis'en;—<br />\nWif huh han' she breshed away de tears.<br />\nDen I know dat 'Liza Ann, my true-love,<br />\nHuh hea't en han' hed given unt'a me;<br />\nCould I ask fo' any futh'a promise?—<br />\nMy bride, flex' come Chrismus, huh will be.<br />\nHi! Dere's a soun' of Summah in de air;<br />\nSweet music am wafted on de breeze;<br />\nHyeah de crickets chirpin' in de low grass,<br />\nWhile de frogs air trillin' in de trees.<br />\nW. P. SHRINER.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n4<br />\n<br />\nZbe jf2elpg0Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nOCTOBER 13, 1898.<br />\nSubscription $1.50 per year.<br />\n<br />\n15 cents a single copy.<br />\nJOHN<br />\n<br />\nEditor in Chief,<br />\n<br />\nC. FRENCH,'99.<br />\n<br />\nAssociate Editor in Chief, - - - WILLIAM P. EIHRIVER, 1900.<br />\nNews Uditors,<br />\nAthletic Editors,<br />\nGraduate Editors,<br />\n<br />\n- -<br />\n<br />\nJOHN H. KING, '99.<br />\n1 VINCENT A. RENOUF, LB.,'98.<br />\nGEORGE<br />\n. KNAPP, JR.,'99.<br />\nJOHN W. GRIFFIN, igoo.<br />\nV. EDGEWORTH SMITH.<br />\nH. Y. Bidkck.<br />\n<br />\nMedical School, CuAs. K. WINNE, JR.<br />\nExchange Editor, - - Address all articles, communications, etc. to JOHN C.<br />\nFRENCH. box 217, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent<br />\nto R. H. GRIMES, box 238, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br />\n<br />\nTo those who were members of the University last year THE NEWS-LETTER needs no introduction and makes no apologies for its existence. For the new students it has a word<br />\nof greeting. We would call their attention to<br />\nthe fact that this is the only publication of its<br />\nkind at the University. It is not a literary<br />\nmagazine, nor a comic journal, but primarily<br />\na newspaper. It is distinctly an amateur effort, and the editors gain nothing but experience. The fact that we try to represent so<br />\nmany diverse elements makes the problem difficult. It also makes it right for us to expect<br />\nthe undivided allegiance of the students. We<br />\nhope to have as subscribers this year, practically all the undergraduates and very many<br />\ngraduate students.<br />\nLast spring at Maryland Oval, Hopkins<br />\nwon with the greatest case the championship<br />\nof the Maryland Intercollegiate Association.<br />\nA few weeks ago, with scarcely greater difficulty, we carried off the championship in the<br />\ngatnes of the Maryland Athletic Union. These<br />\nassociations include practically all the track<br />\nand field teams in the State, and these victories give Hopkins a clear title to athletic supremacy in her own neighborhood. This supremacy we can easily maintain, and it be-<br />\n<br />\nhooves us, while keeping up our present standard, to look beyond our borders for more<br />\nworthy opponents. Our athletes should begin<br />\nat once to think about the American Intercollegiate games for next year. In this connection, the most encouraging sign of the times is<br />\nthe appointment of Mr. Mackdermott to have<br />\nfull charge of the outdoor sports of the University. Mr. Mackdermott's efficiency as a<br />\ncoach,and his interest in Hopkins affairs, have<br />\nbeen abundantly proved, and the agreement<br />\nbetween the Athletic Association and the trustees which resulted in his appointment was a<br />\nmost happy one.<br />\nAlthough our representatives in the volunteer army in the late war with Spain did not<br />\nreach the scene of actual conflict, and we have<br />\nno wounded heroes to idolize, nevertheless the<br />\nwar has touched us on many sides, and we may<br />\nclaim some share at least in its glory. Besides<br />\nthose who were actually mustered into the service of the government with the Maryland National Guard, we must remember the others<br />\nin the cavalry and artillery who were ready<br />\nand anxious to go. Nurses from the Medical<br />\nSchool were active in the work of the Red<br />\nCross. Some of our electricians were engaged<br />\nin harbor defense at Baltimore. A member<br />\nof the University faculty is now absent on<br />\nduty, and our president was offered a place on<br />\nthe commission to inquire into the affairs of<br />\nthe war department.<br />\nEvents since the mass-meeting last term<br />\nhave proved the truth of President Gilman's<br />\nassertion that the government did not need us,<br />\nand have fully justified Prof. Adams' advice<br />\nabout going off at half cock. Our military<br />\ncompany began bravely, and diminished in<br />\nrapid progression until there were few left to<br />\ndisband. Fortunately the suggestion of some<br />\nover-zealous ones, that military training be<br />\nmade a prominent feature here, died with<br />\nthe company. Such things are all right in<br />\ntime of war, but at other times we can wisely<br />\nleave them to \"prep\" schools, to whom they<br />\nbelong.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nBOOK NOTES.<br />\n<br />\nThere is no rest for the weary librarian.<br />\nHe has steadfastly to stick to his books. All<br />\nthe libraries have been thoroughly overhauled<br />\nduring the summer, and there were many valuable accessions to the Hopkins' collections.<br />\nDr. Keidel devoted the greater part of the<br />\nsummer to cataloguing and rearranging the<br />\nbooks of the department of Romance Languages.<br />\nProfessor Cleveland Abbe's rich library on<br />\nMeteorology has come to Hopkins. The collection is regarded as one of the most complete on the subject in this country, with the<br />\nexception, perhaps, of that at the Weather<br />\nBureau in Washington. The Abbe Library<br />\nnumbers about fifteen hundred volumes, and<br />\nwill be in the charge of Mr. Fassig, late of the<br />\nWashington Bureau Library, now connected<br />\nwith the Weather Service here and aS a lecturer in the University.<br />\nA glance over the exhibit of the New Book<br />\nDepartment brings to light de Tocqueville's<br />\n\"Democracy in America,\" with an introduction by President Gilman; \"The State,\" by<br />\nWoodrow Wilson, in a revised edition; and<br />\nthe second volume of \"The Historical Development of Modern Europe,\" by 'Charles M.<br />\nAndrews (Ph. D.'88), now associate professor<br />\nat Bryn Mawr. Dr. Andrews' scholarly work<br />\nis attracting wide attention. The Century<br />\nCo., by the way, will shortly issue a volume of<br />\nPresident Gilman's addresses on University<br />\nProblems.<br />\n\"Irrigation in Utah,\" published by C. H.<br />\nBrough (Ph. D.'98), in the Hopkins series of<br />\n- Historical Studies, has had an extensive sale<br />\nin the West. Dr. Brough is looking to a second edition.<br />\nSeveral of the recent publications on the<br />\nNew Book table are eminently noteworthy.<br />\nThe first of four volumes of \"Scientific Memories of Huxley,\" edited by Professors Foster<br />\nand Lankester; twenty-two masterly plates<br />\naccompany the text. \"A Constitutional History of the American People, 1776-1850,\" by<br />\nFrancis Newton Thorpe, in two volumes,<br />\n<br />\n5<br />\n<br />\nconies from the Harper's press, and in point<br />\not typography, paper, printing and binding, is<br />\nrepresentative of the highest order of practical<br />\nbook-making, a work which gives delight even<br />\nin the handling.<br />\nPERSONALS.<br />\n<br />\nErnest M. Jenkins and Vincent Renouf<br />\nwere among the Hopkins men at Narragansett Pier this summer.<br />\nJohn P. Hill, 'oo, was associated with the<br />\nCoast and Geodetic Survey on the resurvey of<br />\nChester river, employed on hydrographic<br />\nwork.<br />\nMarion Jungbluth, Duncan K. Brent, Frederick W. and R. Marsden Smith, Albert Keidel and George M. Clarke were among the foreign tourists.<br />\nWilson L. Smith, 'oo, camped on the Susquehanna in the early summer, and later made<br />\na tour of the coast resorts.<br />\nCaptain Robinson, '99, of the 'Varsity football team, and Louis W. Haskell, '99, spent a<br />\nlarge part of the summer in southern waters<br />\noff the coast of Georgia.<br />\nAlex. V. Schermerhorn, 'oo, spent the summer abroad, visiting Holland, England and<br />\nWales.<br />\nFerd. C. Fisher, '99, divided his vacation<br />\nbetween the mountains and seashore, visiting<br />\nMonterey and Atlantic City.<br />\nHarry Grimes, '99, and George W. Knapp,<br />\n'99, took an extended trip North. They travelled in Canada, and returned by way of Lake<br />\nGeorge and the Hudson river. Saratoga,<br />\nNewport, Narragansett and other points of<br />\ninterest were included in their itinerary.<br />\nJames L. A. Burrell,'oo, was connected with<br />\nthe Maryland State Geological Survey, and<br />\nhad some rough and tumble experiences in the<br />\nmountain country of Western Maryland. During the heat of the war the corps was nearly<br />\nfamished for news, as an occasional paper<br />\nonly strayed into camp.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nATHLE,TICS.<br />\nANOTHER CHAMPIONSHIP.<br />\n<br />\nAt the first annual track and field games of<br />\nthe Maryland Athletic Union, held at Maryland Oval, September 24, Hopkins athletes<br />\nbegan their work for this season by winning<br />\nanother championship. The most important<br />\nprize was \"The News Cup,\" which was offered<br />\nto the club scoring the highest number of<br />\npoints, and which will become the permanent<br />\nproperty of the club first winning three championships (not necessarily in succession).<br />\nThis cup is now on exhibition with other Hopkins prizes in the Trophy Room.<br />\nThe men composing our team deserve the<br />\nmore credit in view of the fact that the games<br />\nwere held before the beginning of our school<br />\nyear, when a number of our men were out of<br />\ntown.<br />\nNevertheless enough men were collected to<br />\nrepresent us in most events, and to score for<br />\nus twice as many points as our nearest competitor.<br />\nThe day was perfect, except that a strong<br />\nwind was blowing up the finish. In consequence of a hard rain on the previous day the<br />\ntrack was in poor condition. However, records went smashing, and new State championships were established. In the first event, the<br />\nmo-yard dash, Hopkins won first and second.<br />\nKnapp ran in his usual form, and won first in<br />\nJo 3-5 seconds, breaking the previous State<br />\nrecord of 10 4-5. Talty was a close second.<br />\nIn the 220 Knapp continued his good work,<br />\nwinning first in 24 seconds, and establishing<br />\nanother State record. The former record was<br />\n24 3-5. C. T. Clark made second place in the<br />\n88o-yard run, crossing the tape close behind<br />\nC. W. Hammill, of the Y. M. C. A. In the<br />\nmile run, unfortunately Hopkins did not get<br />\na place. We have, however, every reason to<br />\nbe proud of the work of R. T. Abercrombie,<br />\nwho ran until he dropped. Had he been in his<br />\nusual condition he would doubtless have won<br />\na place. While nearly everything was going<br />\n<br />\nour way on the track, it was much the same<br />\nin the field. In the running high jump Garrett won third and Weedon fourth. In the<br />\nother events in which Garrett was entered he<br />\nwon first, making new State records for the<br />\nrunning hop, step and jump and 16-111 hammer throw. In the former his distance was 42<br />\nfeet 10 inches, and he threw the hammer 107<br />\nfeet 8 1-2 inches. In putting the 16-lb. shot<br />\nhe covered 37 feet 7 1-2 inches. H. S. Whitman won third, with 32 feet 4 1-2 inches, and<br />\nT. Fitzgerald fourth, 27 feet 5 1-2 inches. Garrett's running broad jump was 21 feet 2 inches,<br />\nand he threw the discus 95 feet 9 inches. In<br />\nthe latter event Fitzgerald was second, with<br />\n89 feet 2 inches, and Whitman third, 86 feet<br />\n2 inches.<br />\nW. Weedon won second place in the running hop, step and jump, with 41 feet 10 1-4<br />\ninches.<br />\nThomas Fitzgerald ran a beautiful race in<br />\nthe 440-yard run, winning first in 56 3-5 seconds. Morfit Mullen finished close up, winning third. In the bicycle races, which were<br />\nconsiderably mixed up and run on a track ill<br />\nsuited to the purpose, we had no representatives.<br />\nThe last and most interesting event was the<br />\none-mile relay, which Hopkins won hands<br />\ndown, in 3 minutes 46 3-5 seconds.<br />\nThe team was composed of S. P. Smith, Geo.<br />\nW. Knapp, Jr., J. M. Mullen and T. Fitzgerald, Jr. Smith, the new man on the team, ran<br />\nwell, leading from the start. The other men<br />\neasily increased the lead. Much of the credit<br />\nof our easy victory is due to the coaching of<br />\nMr. Wm. M. Mackdermott.<br />\nThe final standing of the clubs by points is<br />\nas follows:<br />\nJohns Hopkins<br />\nMaryland Athletic Club<br />\nY. M. C. A.<br />\nBaltimore Athletic Club<br />\nSt. Leo's Gymnasium<br />\nDruid Athletic Club<br />\nGuilford Athletic Club<br />\nDruid Outing Club<br />\n<br />\n65<br />\n29<br />\n22<br />\n<br />\nII<br />\n12<br />\n<br />\n4<br />\n<br />\n\fM111111=11111111.1,<br />\n<br />\nTHE NEWS-LETTER.<br />\nFOOT BALL<br />\n<br />\n7<br />\n<br />\nHOPKINS IN C. A. C. GAtIES.<br />\n<br />\nThe candidates for this year's football team<br />\nThe events of last Saturday, held at the Cohave gotten down to hard work, and there is<br />\nlumbia Athletic Club grounds, Washington,<br />\npromise of a very strong team. They praccontributed almost as much to the glory of<br />\ntice every afternoon in the cage, under the<br />\nHopkins track and field athletics as our recent<br />\nsupervision of the coach and captain. Among<br />\nvictory in the M. A. U. games.<br />\nthose training are quite a number of new men,<br />\nWe had heard a great deal about the very<br />\nwho .have done good work on other teams.<br />\nfast time of the sprinters and the number of<br />\nSome of the most promising ones are: Alfred<br />\nrecord-smashers of the District, and the perIlreeton, who played on one of the best ath- centage of rooters was small, from<br />\nsuspicion<br />\nletic club teams in the city; Abner Saylor,<br />\nthat most of our men were outclassed. On<br />\nwho played a star game on Marston's team<br />\nthe contrary, there was hardly a man whom<br />\nlast year; Griffin, who was a member of the<br />\nwe entered not of the first class.<br />\nteam of the University of Minnesota last year,<br />\nKnapp walked away with the too-yards<br />\nand Lily, Nightingale and Miller, who played dash and the 220-yards run, winning the foron one of the best-known local teams.<br />\nmer in to 3-5 seconds and the latter in 23 3-5<br />\nThe manager has announced the schedule<br />\nseconds.<br />\nof games as follows:<br />\nGarrett, although he did not get a place in<br />\nOctober 15.—Rock Hill College, at Rock<br />\nthe discus, as scratch man, won the 16-lb.<br />\nHill.<br />\nhammer event at 117 feet 3 inches.<br />\nOctober 19.—Druid Athletic Club, at ElecScholl, with a handicap, won the 16-lb. shot<br />\ntric Park, Baltimore.<br />\nput, while Fishack, a 1901 man, took second<br />\nOctober 22.—Baltimore Medical College, at place in the pole vault.<br />\nElectric Park, Baltimore.<br />\nAbercrombie took second in the 88o-yards<br />\nOctober 26. — Swarthmore College, at running, a most plucky race, with Clark a close<br />\nSwarthmore, Pa.<br />\nthird.<br />\nOctober 29.—Maryland Agricultural ColAltogether all of our men did great credit<br />\nlege, at College Park.<br />\nto themselves and to the University.<br />\nNovember 2.—Haverford, at Haverford,<br />\nThis ends the traek and field athletics for<br />\nPa.<br />\nthis fall.<br />\nNovember 5.—Western Maryland College,<br />\nat Electric Park, Baltimore.<br />\nNovember 9.—Villanova College, at Philadelphia.<br />\nN. Y. A. C. GAMS.<br />\nNovember 12.—Gallaudet College, at Electric Park, Baltimore.<br />\nOn Saturday, October 1st, the New York<br />\nNovember t6.—Rock Hill College, at Elec- Athletic Club held its annual handicap games.<br />\ntric Park, Baltimore.<br />\nHopkins was well represented by Mr. Robert<br />\nNovember 19.—Open.<br />\nGarrett, who got two third places against the<br />\nNovember 24.—St. John's College, at An- champions of the world. In the hammer<br />\nnapolis, Md.<br />\nthrow his actual distance was tt8 feet 7 inches,<br />\nand in the standing broad jump he covered<br />\n9 feet to 1-2 inches. The games were held at<br />\nActive steps are being taken for the organi- the grounds of the New York Athletic Club,<br />\nzation of a basket-ball team, composed of men at Travers Island, before a large crowd of<br />\nwho have been in the local leagues.<br />\nspectators.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\nUNIVERSITY CHAT.<br />\n<br />\nThrough the summer vacation months the<br />\nfaculty was widely scattered in travel, at home<br />\nand abroad, or in quiet recreation in the mountains or along the coast.<br />\nPresident Gilman was at North-east Harbor, Maine.<br />\nDean Griffin and family spent the season at<br />\nLake Placid, the Adirondacks.<br />\nDr. Ames travelled on the Continent and in<br />\nEngland.<br />\nDr. Kirby Smith was among the Hopkinsians at the White Sulphur Springs, Virginia.<br />\nOf the Medical Faculty, Dr. Oster was in<br />\n,Europe; Dr. Halsted spent the summer in the<br />\nmountains of North Carolina.<br />\nProf. Ira Remsen was in Vermont and at<br />\nDeer Isle, Maine.<br />\nProf. Adams spent the vacation months in<br />\nliterary work at Amherst.<br />\nDr. Spieker travelled through the West, remaining some weeks in Nevada.<br />\nDr. Thomas S. Baker devoted several<br />\nmonths to study and travel in Germany.<br />\nDr. and Mrs. Vincent sought the seclusion<br />\nof a quiet little town in Ohio, six miles from a<br />\nrailroad, where they were free to carry on their<br />\nliterary work.<br />\nDr. E. E. Reed, of the Chemical Department, has been called to the professorship of<br />\nchemistry and physics at the Charlestown<br />\nUniversity, S. C.<br />\nPresident Gilman was in New York last<br />\nweek for the meeting of the Peabody Educational Fund. He was elected a member of<br />\nthe Committee on Finance.<br />\nThe Adirondacks were quite popular with<br />\nHopkins men this summer. E. S. Bruce and<br />\nJohn W. Griffin spent the season there. A<br />\nnumber of Hopkinsians canoed in Maine waters. Conway S. Hodges, Howard Post,<br />\nCharles M. Remsen and Edward L'Engle were<br />\namong those who either pitched their tents at<br />\nthe picturesque Lake Moosehead or shot the<br />\nrapids that abound in Maine streams.<br />\n<br />\nRegistrar Ball gives out the approximate<br />\nenrollment of students to date of October 5 as:<br />\nGraduates, 206; medical, 202; undergraduates, 190. The total, 598, is somewhat in<br />\nexcess of the enrollment of last year.<br />\nThe entering class numbers 69, 6o candidates for the degree of A. B., and 9 special<br />\nstudents. Sixty-three students are entered<br />\nin the first year class of the Medical School.<br />\nThe prospects for the usual up-to-date<br />\nBanjo, Mandolin and Glee Clubs, this year,<br />\nare very bright. The first trials have been<br />\nheld and a number of new faces will appear<br />\nin the make-up of the clubs. Tours are<br />\nplanned for both the Christmas and Easter vacations, under the management of Joshua Levering, Jr.,'99. Marion K. Jungbluth,'99, will<br />\nthis year lead the Glee Club. As last year, the<br />\nMandolin and Banjo Clubs will be led by Girvin Peters.<br />\nAt the reception tendered the incoming students by the Y. M. C. A., Mr. Eugene Levering, representing the Board of Trustees, spoke<br />\nwith great feeling of the late Dr. James Carey<br />\nThomas, who for so many years had identified<br />\nhimself with the Association's work in the University.<br />\nProfessor Adams will conduct, as a department of the Association's work, a study of the<br />\nApostolic Church and the Growth of Modern<br />\nMissions, Saturday mornings at half-past nine.<br />\nProfessor Adams' course last year on the Lif:<br />\nof Christ was largely attended by graduates<br />\nand undergraduates, and this year's studies<br />\npromise to be equally well attended.<br />\nAt the conclusion of Prof. Adams's lecture,<br />\nDr. Jeffrey R. Brackett will conduct a half<br />\nhour's conference on Applied Sociology, from<br />\no to 10.30 every Saturday.<br />\nDr. Brackett<br />\naims to interest university men in practical<br />\nsocial work, and in the social problems of the<br />\ncity. The 'Varsity Y. M. C. A. is at present<br />\nlargely interested in the Lawrence House, a<br />\nsocial settlement work begun in the Winans'<br />\ntenements of Southwest Baltimore, in 1893,<br />\nby the late Rev. Edward A. Lawrence.<br />\n<br />\n\fI<br />\n<br />\n/<br />\n<br />\n4k<br />\n•<br />\n<br />\n•<br />\n.1<br />\n<br />\n11111111......._<br />\n<br />\n\fBARTHOLOMAY BREWERY CO.<br />\nUM<br />\n<br />\nGoods<br />\n<br />\nROCHESTER, N. Y.<br />\n<br />\ncalled for<br />\n<br />\nCC)<br />\n<br />\nand<br />\n<br />\nITSELF. ?<br />\n,k0,t,% ‘IS MERirs. i<br />\n<br />\nts vc SELLS<br />\n<br />\n\\*%%<br />\n\\WIIIII/IRP'l<br />\n<br />\na<br />\n<br />\n-A, ..t.......: , .,:.„..<br />\nARTHOLOMAYS<br />\nROCHESTER<br />\n‘'<br />\n•...BEER.<br />\n‘,3<br />\n<br />\ndelivered.<br />\n<br />\nBohemian ot<br />\nBavarian 4t<br />\nMaerzen<br />\nApollo ot<br />\n<br />\nsis<br />\nDRY CLEANSING AND DYEING, 216 W. Fayette Street.<br />\n<br />\nJohns Hopkins University,<br />\n<br />\n1060—Tolophone-2000<br />\n<br />\nBALTIMORE BRANCH:<br />\n<br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAGER<br />\n<br />\nThe Chas. Wilms Surgical lustrument Co.<br />\nBENJ. A. NIELSON, 06111 Msnager.<br />\n<br />\nPROGRAMMES FOR 1898-99.<br />\nThe Johns Hopkins University Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the aca▪ demic year beginniag October ult, i828, may be had on appli• cation to the Registrar of the Johns Hopkins University.<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of the Johns Hopkins Medical School may also „<br />\n. . be had on application to the Registrars.<br />\n<br />\nFINE SURGICAL INSTRUMENTS,<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\n<br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTKLEPHONE 771.<br />\nP111‘,All SCHOOL OF<br />\n<br />\nSeason October 15 to June ist.<br />\n<br />\nScientific<br />\nPbpsical<br />\nCraining<br />\n<br />\nEndorsed by the Leading Physicians and<br />\nBusiness Men of Baltimore.<br />\nWe guarantee best results. . .<br />\n<br />\n531 N.Howard St.<br />\novrosrrii.<br />\nNew City College.<br />\n<br />\nDON HENRI,<br />\nJ. W. WALTEMEVER,<br />\nManagers.<br />\nFor terms apply at School.<br />\n<br />\nTHE UNIVERSITY SCHOOL FOR BOYS,<br />\n1205 CATHEDRAL ST.<br />\nW. S.<br />\n<br />\nMARSTON,<br />\n<br />\nA. B. AND C.<br />\n<br />\nC.<br />\n<br />\nPRINCIPAL.<br />\n<br />\nTen experienced teachers as assistants.<br />\n<br />\nPreparatory Department<br />\n<br />\nALISISRT IIILDEBRANDT.<br />\n<br />\nESTABLISHRD 1838,<br />\n<br />\nC. H. HILDEBRANDT & SON,<br />\nPAANUFACTUPIErl• Or<br />\n<br />\nMusical Instruments and Strings, Repairing of Violins, Music Boxes<br />\nand Other Instruments. Agents for the Celebrated Shaw<br />\nPiano. A Large Collection of Genuine Old Violins.<br />\n<br />\nBALTIMORE, October 8, z898.<br />\nRealizing that Medicinal Beverages should be selected with the<br />\ngreatest possible care from the most reliable producers, we have<br />\nused every precaution in our importations to select all of our Wines<br />\nand Liquors from the most reliable houses in Europe, and can give<br />\nevery assurance to our patrons that they can find strictly pure old<br />\nOporto Port, Madeira, Sherry, Burgundies, Clarets, Sauternes, Cognacs, etc„ when ordering from<br />\n<br />\nJORDAN STABLER,<br />\n701-3-5 Madison Ave.<br />\n<br />\nfor Boys from eight to elven years old.<br />\n<br />\nNEW YORK TO BREMEN, •..•<br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN ....<br />\n<br />\nNORTH GERMAN LLOYD S.S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER & CO.<br />\nGeneral Agents.<br />\n<br />\nFor particulars apply to<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nNo. 19 N. LIBERTY ST.<br />\n<br />\nDIRECT.<br />\n<br />\nevery description. . .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br />\n<br />\nF. It IVIVID5011 & C°<br />\n<br />\n509 W. Franklin Street,<br />\n<br />\nTelephone 2095.<br />\n<br />\nBaltimore, Mn.<br />\n<br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 415 Water Street,[Second 81-]<br />\nAdjoining Custom House on the Weet<br />\n<br />\nShort Insurance for a Day<br />\n.. or Longer Period,<br />\n<br />\nTHOMAS I. CAREY, Pru.<br />\n<br />\nBOARD OF DIRECTORS<br />\n<br />\nATLANTIC TR2OcNSPOR.T LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to Eundon at reasonable rates.<br />\n<br />\nThe Atlantic Transport Co.,<br />\nsoe-soa WATER STREET,<br />\nBALTIMORE.<br />\n<br />\nNew York Shipping Co.,<br />\nI BROADWAY,<br />\nNEW YORK.<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\nMadison & Howard Sts.<br />\n<br />\nFord. C. Latrobe,<br />\nA. J. Ulman,<br />\nWilliam Harvey<br />\nJoshua G. Harvey,<br />\nJames W. Hates<br />\nN. W. James,<br />\nAndrew D. Jones. GRIFFITH 1HIflTU,Lt.<br />\n<br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nRICHARD B. POST, billy.<br />\n<br />\n..f,PiloToGRAPHicsu NIL!es<br />\n:4-1111,1111<br />\n<br />\n. Text Books •<br />\n. Note Books . _<br />\nStudents' Supplies<br />\n<br />\nt I<br />\n<br />\n'II<br />\n<br />\n'<br />\n<br />\nKodaks & Cameras<br />\nAll<br />\nthings Photographic.<br />\nDeveloping<br />\nand<br />\n4,ie<br />\nFinishing.<br />\n<br />\n0,4<br />\n<br />\n,1111<br />\n!<br />\nI<br />\n4<br />\n!106<br />\n1<br />\n<br />\nN CHARLES<br />\nt dALTiMORE MD<br />\n<br />\nST<br />\n<br />\n,<br />\n<br />\nTHE CUMMINS<br />\nPHOTO-STOCK CO<br />\n40 W. Lexington St.<br />\n<br />\n\f", "format": "basic_html", "processed": "SA MPT,<br />\nVol. III.<br /><br />\nt<br /><br />\nt<br /><br />\nOCTOBER 13th, 1<br /><br />\n4.<br /><br />\nj.111.<br /><br />\ntbe<br /><br />\n00,140/,VyS<br />\nPRESIDENT'S OFFICE.<br /><br />\nApiCIOs<br /><br />\ntiter<br /><br />\n•<br /><br />\nPublished by Students of<br />\n+ THE JOHNS HOPICINS<br /><br />\nPress of<br />\n• Guggenheimer, Weil &amp; Co. A<br />\n_<br />\n_<br /><br />\nf UNIVERSITY<br /><br />\n.... ISSUED<br /><br />\n't<br /><br />\nBALTIMORE<br /><br />\n.Pt<br /><br />\nFORTNIGHTLY<br />\n-1446<br /><br />\nCushing &amp; Company,IfiIii<br /><br />\n413<br /><br />\nNEW—<br /><br />\nBOONS 0Lb<br /><br />\nThe oldest Old-Book Store,•and the largest stock<br />\nof Old and New Books in the City. Books bought<br />\nand exchanged.<br />\nWM,<br /><br />\nBOOKSELLERS AND<br />\nSTATIONERS<br /><br />\n34 WEST BALTIMORE STREET.<br />\nSCHOOL, LAW, MEDICAL, AND CLASSICAL<br /><br />\nAND<br /><br />\nMISCELLANEOUS BOOKS.<br /><br />\nKeep eonatently on hand the Text Books used In Johns Hopkins Univeretty, Johns Hopkins<br />\nHospital, mid The Woman's College of Baltimore.<br /><br />\nV. PIPPEN,<br /><br />\nSTATIONERY.—For School, Family,(Mike and Bank.<br /><br />\n327 NORTH CHARLES STREET.<br /><br />\nr livEnsint Hurron<br /><br />\nB. G. E1CHELBERGER,<br />\n1300 KS fiND STATIONERY,<br />\n308 N. CHARLES ST.<br />\nT. a. O. A. BUILDIXO.<br /><br />\nBaltimore, Md.<br /><br />\n•<br /><br />\nROOMS<br /><br />\nPleasant second and third story rooms; also table<br />\nboard, good service, best of food.<br />\nPrice to J. H. 11. Men $3.00 weekly.<br /><br />\nAND<br /><br />\nMrs.<br /><br />\nBoard<br />\nALBERT<br /><br />\nILEENE,<br />\n1204 MeCulloh Street.<br /><br />\nr. PIIILBIN,<br /><br />\n'Mtn&amp;ertaker anti<br />\n. 3Fitib lamer .<br /><br />\n(ISSUED CVLIIY<br /><br />\nrnisar.)<br /><br />\n2-1_,Z3_171;)<br />\n72.1713_ 1Z.,11./<br />\n1321.1.,TI1VLOR,..E,<br /><br />\nTelephone No. 3589.<br /><br />\nD.<br /><br />\nThe Society Paper of Baltimore.<br /><br />\nJOHN M. KEELER,<br />\n. TAILOR.<br /><br />\nLarge Stock, Popular Prices, Good Fitting, Prompt Delivery,<br /><br />\nBRIGHT AND BRF.F.7Y.<br /><br />\n5 N. CALVERT ST.<br /><br />\n4 4%, UPA<br />\n0%4% 4%4I 41,<br /><br />\n0$04.1\"„ov. estay. vP. OP.<br /><br />\nj<br />\n,10<br /><br />\n.<br /><br />\n•0‘<br /><br />\n\"<br /><br />\nNpSS1N HO*<br />\nE<br />\n4 416C0<br /><br />\n)<br />\nir<br />\nSter<br />\nY<br />\n4S<br />\nernie,k<br /><br />\n?e6tobe<br />\nLit411,ts<br />\nERS<br />\nLITHOG RAPHERS<br />\n, telter5;1)ocumenis,Le;a1 Blank3 STATIOS<br />\na PRINTERS<br />\ngooxcase;<br /><br />\nSI<br /><br />\n109 ILIIALTD.ST.<br /><br />\n41<br /><br />\n94<br /><br />\nAeneAk'<br /><br />\nI:10-<br /><br />\nr.erawf<br /><br />\n.<br />\nr4<br />\n;<br />\nre<br /><br />\ngot,<br /><br />\nt, (1_,<br /><br />\n%tab<br /><br />\nZile 1Rew/Letter,<br />\nVol. III.<br /><br />\nFortnightly<br /><br />\nTHE SALVATION OF THE GRADUATE<br />\nSTUDENT.<br /><br />\nThe average graduate student himself would<br />\nprobably be the last to admit that he needed<br />\nsalvation—that is, at least, any earthly kind.<br />\nHe is, of course, as a rule, passably well endowed with religious instincts, and therefore<br />\nquite willing to confess that he is \"a miserable<br />\nsinner;\" but that is far from saying that the<br />\nrest of mankind is not also thus, and even<br />\nmore so. Quite the contrary! He has—<br />\nprobably all his life, certainly through the<br />\nterm of his college and university existence—<br />\nworked harder and revelled less than the most<br />\nof his companions. Even now he is mortifying his flesh for the good of his higher nature<br />\nby incessant studying, both night and day.<br />\nHow absurd, then, that anyone should project<br />\nthe leavening of his stern rectitude with a little more of human frailty, and call that—his<br />\nsalvation. And yet he needs just this. He<br />\nmay have withstood the temptations of drinking, gambling, loafing, and all the rest. He<br />\nmust still be saved from himself; that is, from<br />\nthe conditions which at present surround him.<br />\nThe truth of this will become evident on a<br />\nlittle reflection. When a man enters upon<br />\nsome special graduate work, he finds that his<br />\ndepartment gives him much more of advantages than of time in which to avail himself<br />\nof them. These advantages have, perhaps,<br />\ncost him some sacrifice to obtain, while to enjoy them he has only this one opportunity.<br />\nSo he feels—and justly—the need of compressing all outside demands on his time into<br />\nthe smallest bounds possible, that he may<br />\ngive the utmost of it to his specialty.<br />\nBut though this cramming of his time is<br />\nnecessary, there is yet attendant on it a twofold danger. In the first place, his nervous<br />\nsystem is bound to suffer from the unremitting tax upon it; the importance of this point,<br />\nanyone who reads the article in Outing of Oc-<br /><br />\nNo<br /><br />\ntober 1st on Relaxation is sure to recognize.<br />\nAnd, in the second place, he is liable to undergo that of the sympathies, involved in pure<br />\nspecialization, and fatal to him if he intends<br />\nto take a place, and a worthy one, in life. For<br />\nhow can a teacher, for instance, get the best<br />\nresults from the men under him, unless he is<br />\nin actual comprehending sympathy with the<br />\nnature of each of them? And how can he be<br />\nin such sympathy, when he has renounced the<br />\nworld about him for a narrow double ego—<br />\nhimself and his special line of study? I do<br />\nnot say that this has actually happened to<br />\nmany, or even any, of our graduates; but I<br />\nbelieve it to be a danger which threatens all.<br />\nTo counteract this dangerous tendency,<br />\nthere are at present no means at his hand.<br />\nNone, at least, within the University. He<br />\nmay go into society, should he possess or be<br />\nable to form an outside circle of friends.<br />\nShould he do so, it is bound to prove a serious<br />\ndistraction and handicap to his work. But<br />\nof the companionship most likely to be of<br />\nvalue to himself—the men of other departments of his own University, whose life and<br />\npurposes lie along the same lines as his<br />\nown, yet who have, from the difference of<br />\ntheir work, a certain refreshing difference<br />\nof ideas—of this he has none. He may<br />\nmeet them at boarding-house or fraternity;<br />\nhe may have known them before he came<br />\nhere. But as far as his university existence<br />\ngoes, there is no reason whatever why he<br />\nshould ever come to know them. There is,<br />\nindeed, a -Graduate Students' Association\"<br />\nwhose name would imply some commingling<br />\nof its members. But in the first place, only<br />\na small proportion of the graduates belong to<br />\nthe Association. And those who do need<br />\nnever see each other, except at the semi-occasional cake and lemonade functions—mournful affairs, whose stiff conversation is not at<br />\nall calculated to compensate a man for giving<br /><br />\n'7<br /><br />\nTHE NEWS-LETTER.<br /><br />\nup an evening's work, fighting his way into \"'howdy!\" \"how's the boy?\" \"come over here<br />\na dress suit and high collar, and then spend- and sit down by me; I want to talk to you;\"<br />\n\"oh, do you know so and so? I want you to<br />\ning his time in extreme boredom.<br />\nmeet him. You'll be interested in hearing<br />\nnow<br />\nAs the Graduate Students' Association<br />\nhim<br />\ntalk,\" and so on. A few more pleasant<br />\nuseless.<br />\nstands, it is useless, and worse than<br />\na little fun and chaffing, an<br />\nacquaintances,<br />\nlapsInterest in it has lapsed signally, and in<br />\nrelaxation. And if, after<br />\nthorough<br />\nof<br />\nevening<br />\ning has taken away the most of its efficiency.<br />\nmake bold to tell a<br />\nshould<br />\none<br />\nsome<br />\nwhile,<br />\na<br />\nThere has, indeed, been as much scrapping<br />\nlet him do that,<br />\nsong—why,<br />\na<br />\nsing<br />\nor<br />\nand \"peanut politics\" over its elections as if story<br />\nits officer were to be endowed with the power too.<br />\nof doing some good. But the factional feel\"A little nonsense, now and then,<br />\ning this produces is only another drawback.<br />\nis relished by the best of men.\"<br />\nIs there a remedy for this state of affairs?<br />\nThat this is practicable, and no more exLook back at the records of the University's<br />\nyounger days; a time when the closest and pensive than the present system of \"recepmost cordial relations existed between all the tions,\" is certain. That a majority of the<br />\ngraduate students; when a man numbered men desire it to come to pass I know. Otheramong his best friends students and profes- wise I would have hardly ventured the exsors of other departments. These were the pression of such radical opinions. But whatdays when the old University Club—a univer- ever may be done in the matter, let one effort<br />\nsity club in fact as well as name—held its be made—to break up this constant classifyweekly social meetings in rooms near the Uni- ing of men into the departments to which they<br />\nversity; where, moreover, a man could at all belong. As Professor Adams has written:<br />\ntimes drop in and be apt to find a friend to \"Whatever social differentiation the academic<br />\nbody may experience, we should always hold<br />\nchat with in its quiet atmosphere.<br />\nthe student assemblies and folk-mote.<br />\nto<br />\nHopkins has, in growing, outgrown the<br />\nwe are in danger of degenerating<br />\nOtherwise<br />\nability of maintaining such close relations becliques and academic snobbery.<br />\nsocial<br />\ninto<br />\ntween all its men; but a new postgraduate<br />\nclub, following the lines of the original UniEDGEWORTH SMITH.<br />\nversity Club, might go far towards re-establishing those former conditions. A remedy<br />\nmore immediate and practical, however, than<br />\nthis, lies in our hands. Let every graduate<br />\nALumni NOTES.<br />\njoin the Graduate Students' Association, if he<br />\nis not already a member; and let him make<br />\nChas. K. Edmunds, A. B. '97, temporarily<br />\nthe Association offer him, in return, not<br />\nmerely occasional and very formal functions, occupies the chair of Physics in the Univerbut also something on the order of what have sity of Utah, at Salt Lake City.<br />\nnow come to be known generically as \"smo-t1W/Mtit<br />\nMr. C. E. Phelps, C. E. '95, has been apkers\"—meetings held in some place meant for<br />\nlounging, to which no man is formally in- pointed engineer of the Baltimore City SOvited, yet in failing to attend which every man way Commission.<br />\nwould feel that he had missed something;<br />\naffairs to which he can go in his every-day<br />\nJohn H. Latane, Pb. D.'95, will be lecturer<br />\nclothes, jumping up from his work, and per- in American Diplomatic History at this Unihaps bringing his pipe along with him. To versity.<br />\nbe greeted on his entrance with a \"hello!\"<br /><br />\nTHE NEWS-LETTER.<br />\nTHE COLLEGE CONGRESS.<br /><br />\nGraded instruction in public speaking, continuing through the three years of residence,<br />\nis now an established feature of the Hopkins<br />\ncollegiate course. The general acceptance of<br />\nthe work done last year, the favorable appearance of the contestants in public debate, and<br />\nevident appreciation on the part of the men,<br />\nhas Sled to an increase of hours for the course<br />\nand a broadening of its scope. The instruction will be given, as last year, by Dr. Guy<br />\nCarleton Lee.<br />\nThe Senior and Junior classes will meet an<br />\nhour weekly, with the exception of the winter<br />\nterm, when the Seniors will meet every other<br />\nweek only. The Senior class, as formerly,<br />\nwill be organized as a Senate; the Juniors as<br />\na House of Representatives. This College<br />\nCongress, however, will convene only on alternate weeks; every second week will'be devoted to class instruction in Parliamentary<br />\nLaw and Practice, extemporaneous speaking<br />\nand debate. In the Senior class no text book<br />\nwill be employed other than a syllabus prepared by Dr. Lee. As a work of reference, \"Roberts's Parliamentary Syllabus\" and<br />\n\"Rules of Order\" will be used by the Junior<br />\nclass.<br />\nIn addition to the regular weekly meetings,<br />\nconferences will be arranged for the upper<br />\nclassmen, for the study of methods of collecting and sifting evidence, drawing briefs and<br />\npreparation for debate.<br />\nA happy innovation in the College Congress will be the arrangement in a related series of the subjects for debate. Each topic will<br />\nbe some phase of the great question of Territorial Expansion now so widely agitated. The<br />\nsubjects will be so planned that there will be<br />\nno interlocking of arguments, and the entire<br />\nseries will furnish a practical survey of Politics in the Nineteenth Century. The public<br />\nand inter-class debate in the spring will be<br />\nbased on the subject matter of the winter's<br />\nstudies. i. his thorough preparation will forcefully and brilliantly arm the contestants.<br />\nMore time this year will be given to open<br /><br />\n3<br /><br />\ndebate, as but two speakers on each side will<br />\nregularly be assigned.<br />\nThe Freshmen class is divided into sections<br />\nfor the study of Description, Narration, Exposition and Argument, as used in speaking.<br />\nNo text is available for the course, because of<br />\nits practical nature, so a syllabus prepared<br />\nby Dr. Lee, issued week by week, will be used.<br />\nThe class will participate in the contest in<br />\npublic speaking next spring.<br /><br />\nsunriAri.<br />\nDere ez a soun' ob Summah in de air;<br />\nSweet music am wafted on de breeze:<br />\nHyeah de crickets chirpin' in de low grass,<br />\nWhile de frogs air trillin' in de trees.<br />\nHan' en han' we wu walkin' thoo de meddah,<br />\nWif de moonbeams spawklin' on huh ha'ar,<br />\n'Twell my hea't wu' a'trippin' lak a hammah,<br />\nEz I gaze on my 'Liza Ann so fair.<br />\nIt seem lak de Heabens gone done open,<br />\nWif de angels ahoy' rin all aroun';<br />\n0 true-love, de Glory-Lan' wu' breakin'I<br />\nGold an' silba lay scattud o' de groun'.<br />\nWe ling'ud by de gate neah de yellums;<br />\nI drew clos'a, stan'in' by huh side,<br />\nHuh haid res'in' sof'ly on my should'a—<br />\nI pine den to tek huh fo' my bride.<br />\nPorn my hea't came de words dat I whisp'ud,<br />\nSof' en low, whisp'ud only fo' huh ears;<br />\nOn huh cheek a di'mun' seem to glis'en;—<br />\nWif huh han' she breshed away de tears.<br />\nDen I know dat 'Liza Ann, my true-love,<br />\nHuh hea't en han' hed given unt'a me;<br />\nCould I ask fo' any futh'a promise?—<br />\nMy bride, flex' come Chrismus, huh will be.<br />\nHi! Dere's a soun' of Summah in de air;<br />\nSweet music am wafted on de breeze;<br />\nHyeah de crickets chirpin' in de low grass,<br />\nWhile de frogs air trillin' in de trees.<br />\nW. P. SHRINER.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n4<br /><br />\nZbe jf2elpg0Letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nOCTOBER 13, 1898.<br />\nSubscription $1.50 per year.<br /><br />\n15 cents a single copy.<br />\nJOHN<br /><br />\nEditor in Chief,<br /><br />\nC. FRENCH,'99.<br /><br />\nAssociate Editor in Chief, - - - WILLIAM P. EIHRIVER, 1900.<br />\nNews Uditors,<br />\nAthletic Editors,<br />\nGraduate Editors,<br /><br />\n- -<br /><br />\nJOHN H. KING, '99.<br />\n1 VINCENT A. RENOUF, LB.,'98.<br />\nGEORGE<br />\n. KNAPP, JR.,'99.<br />\nJOHN W. GRIFFIN, igoo.<br />\nV. EDGEWORTH SMITH.<br />\nH. Y. Bidkck.<br /><br />\nMedical School, CuAs. K. WINNE, JR.<br />\nExchange Editor, - - Address all articles, communications, etc. to JOHN C.<br />\nFRENCH. box 217, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent<br />\nto R. H. GRIMES, box 238, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br /><br />\nTo those who were members of the University last year THE NEWS-LETTER needs no introduction and makes no apologies for its existence. For the new students it has a word<br />\nof greeting. We would call their attention to<br />\nthe fact that this is the only publication of its<br />\nkind at the University. It is not a literary<br />\nmagazine, nor a comic journal, but primarily<br />\na newspaper. It is distinctly an amateur effort, and the editors gain nothing but experience. The fact that we try to represent so<br />\nmany diverse elements makes the problem difficult. It also makes it right for us to expect<br />\nthe undivided allegiance of the students. We<br />\nhope to have as subscribers this year, practically all the undergraduates and very many<br />\ngraduate students.<br />\nLast spring at Maryland Oval, Hopkins<br />\nwon with the greatest case the championship<br />\nof the Maryland Intercollegiate Association.<br />\nA few weeks ago, with scarcely greater difficulty, we carried off the championship in the<br />\ngatnes of the Maryland Athletic Union. These<br />\nassociations include practically all the track<br />\nand field teams in the State, and these victories give Hopkins a clear title to athletic supremacy in her own neighborhood. This supremacy we can easily maintain, and it be-<br /><br />\nhooves us, while keeping up our present standard, to look beyond our borders for more<br />\nworthy opponents. Our athletes should begin<br />\nat once to think about the American Intercollegiate games for next year. In this connection, the most encouraging sign of the times is<br />\nthe appointment of Mr. Mackdermott to have<br />\nfull charge of the outdoor sports of the University. Mr. Mackdermott's efficiency as a<br />\ncoach,and his interest in Hopkins affairs, have<br />\nbeen abundantly proved, and the agreement<br />\nbetween the Athletic Association and the trustees which resulted in his appointment was a<br />\nmost happy one.<br />\nAlthough our representatives in the volunteer army in the late war with Spain did not<br />\nreach the scene of actual conflict, and we have<br />\nno wounded heroes to idolize, nevertheless the<br />\nwar has touched us on many sides, and we may<br />\nclaim some share at least in its glory. Besides<br />\nthose who were actually mustered into the service of the government with the Maryland National Guard, we must remember the others<br />\nin the cavalry and artillery who were ready<br />\nand anxious to go. Nurses from the Medical<br />\nSchool were active in the work of the Red<br />\nCross. Some of our electricians were engaged<br />\nin harbor defense at Baltimore. A member<br />\nof the University faculty is now absent on<br />\nduty, and our president was offered a place on<br />\nthe commission to inquire into the affairs of<br />\nthe war department.<br />\nEvents since the mass-meeting last term<br />\nhave proved the truth of President Gilman's<br />\nassertion that the government did not need us,<br />\nand have fully justified Prof. Adams' advice<br />\nabout going off at half cock. Our military<br />\ncompany began bravely, and diminished in<br />\nrapid progression until there were few left to<br />\ndisband. Fortunately the suggestion of some<br />\nover-zealous ones, that military training be<br />\nmade a prominent feature here, died with<br />\nthe company. Such things are all right in<br />\ntime of war, but at other times we can wisely<br />\nleave them to \"prep\" schools, to whom they<br />\nbelong.<br /><br />\nTHE NEWS-LETTER.<br />\nBOOK NOTES.<br /><br />\nThere is no rest for the weary librarian.<br />\nHe has steadfastly to stick to his books. All<br />\nthe libraries have been thoroughly overhauled<br />\nduring the summer, and there were many valuable accessions to the Hopkins' collections.<br />\nDr. Keidel devoted the greater part of the<br />\nsummer to cataloguing and rearranging the<br />\nbooks of the department of Romance Languages.<br />\nProfessor Cleveland Abbe's rich library on<br />\nMeteorology has come to Hopkins. The collection is regarded as one of the most complete on the subject in this country, with the<br />\nexception, perhaps, of that at the Weather<br />\nBureau in Washington. The Abbe Library<br />\nnumbers about fifteen hundred volumes, and<br />\nwill be in the charge of Mr. Fassig, late of the<br />\nWashington Bureau Library, now connected<br />\nwith the Weather Service here and aS a lecturer in the University.<br />\nA glance over the exhibit of the New Book<br />\nDepartment brings to light de Tocqueville's<br />\n\"Democracy in America,\" with an introduction by President Gilman; \"The State,\" by<br />\nWoodrow Wilson, in a revised edition; and<br />\nthe second volume of \"The Historical Development of Modern Europe,\" by 'Charles M.<br />\nAndrews (Ph. D.'88), now associate professor<br />\nat Bryn Mawr. Dr. Andrews' scholarly work<br />\nis attracting wide attention. The Century<br />\nCo., by the way, will shortly issue a volume of<br />\nPresident Gilman's addresses on University<br />\nProblems.<br />\n\"Irrigation in Utah,\" published by C. H.<br />\nBrough (Ph. D.'98), in the Hopkins series of<br />\n- Historical Studies, has had an extensive sale<br />\nin the West. Dr. Brough is looking to a second edition.<br />\nSeveral of the recent publications on the<br />\nNew Book table are eminently noteworthy.<br />\nThe first of four volumes of \"Scientific Memories of Huxley,\" edited by Professors Foster<br />\nand Lankester; twenty-two masterly plates<br />\naccompany the text. \"A Constitutional History of the American People, 1776-1850,\" by<br />\nFrancis Newton Thorpe, in two volumes,<br /><br />\n5<br /><br />\nconies from the Harper's press, and in point<br />\not typography, paper, printing and binding, is<br />\nrepresentative of the highest order of practical<br />\nbook-making, a work which gives delight even<br />\nin the handling.<br />\nPERSONALS.<br /><br />\nErnest M. Jenkins and Vincent Renouf<br />\nwere among the Hopkins men at Narragansett Pier this summer.<br />\nJohn P. Hill, 'oo, was associated with the<br />\nCoast and Geodetic Survey on the resurvey of<br />\nChester river, employed on hydrographic<br />\nwork.<br />\nMarion Jungbluth, Duncan K. Brent, Frederick W. and R. Marsden Smith, Albert Keidel and George M. Clarke were among the foreign tourists.<br />\nWilson L. Smith, 'oo, camped on the Susquehanna in the early summer, and later made<br />\na tour of the coast resorts.<br />\nCaptain Robinson, '99, of the 'Varsity football team, and Louis W. Haskell, '99, spent a<br />\nlarge part of the summer in southern waters<br />\noff the coast of Georgia.<br />\nAlex. V. Schermerhorn, 'oo, spent the summer abroad, visiting Holland, England and<br />\nWales.<br />\nFerd. C. Fisher, '99, divided his vacation<br />\nbetween the mountains and seashore, visiting<br />\nMonterey and Atlantic City.<br />\nHarry Grimes, '99, and George W. Knapp,<br />\n'99, took an extended trip North. They travelled in Canada, and returned by way of Lake<br />\nGeorge and the Hudson river. Saratoga,<br />\nNewport, Narragansett and other points of<br />\ninterest were included in their itinerary.<br />\nJames L. A. Burrell,'oo, was connected with<br />\nthe Maryland State Geological Survey, and<br />\nhad some rough and tumble experiences in the<br />\nmountain country of Western Maryland. During the heat of the war the corps was nearly<br />\nfamished for news, as an occasional paper<br />\nonly strayed into camp.<br /><br />\nTHE NEWS-LETTER.<br />\nATHLE,TICS.<br />\nANOTHER CHAMPIONSHIP.<br /><br />\nAt the first annual track and field games of<br />\nthe Maryland Athletic Union, held at Maryland Oval, September 24, Hopkins athletes<br />\nbegan their work for this season by winning<br />\nanother championship. The most important<br />\nprize was \"The News Cup,\" which was offered<br />\nto the club scoring the highest number of<br />\npoints, and which will become the permanent<br />\nproperty of the club first winning three championships (not necessarily in succession).<br />\nThis cup is now on exhibition with other Hopkins prizes in the Trophy Room.<br />\nThe men composing our team deserve the<br />\nmore credit in view of the fact that the games<br />\nwere held before the beginning of our school<br />\nyear, when a number of our men were out of<br />\ntown.<br />\nNevertheless enough men were collected to<br />\nrepresent us in most events, and to score for<br />\nus twice as many points as our nearest competitor.<br />\nThe day was perfect, except that a strong<br />\nwind was blowing up the finish. In consequence of a hard rain on the previous day the<br />\ntrack was in poor condition. However, records went smashing, and new State championships were established. In the first event, the<br />\nmo-yard dash, Hopkins won first and second.<br />\nKnapp ran in his usual form, and won first in<br />\nJo 3-5 seconds, breaking the previous State<br />\nrecord of 10 4-5. Talty was a close second.<br />\nIn the 220 Knapp continued his good work,<br />\nwinning first in 24 seconds, and establishing<br />\nanother State record. The former record was<br />\n24 3-5. C. T. Clark made second place in the<br />\n88o-yard run, crossing the tape close behind<br />\nC. W. Hammill, of the Y. M. C. A. In the<br />\nmile run, unfortunately Hopkins did not get<br />\na place. We have, however, every reason to<br />\nbe proud of the work of R. T. Abercrombie,<br />\nwho ran until he dropped. Had he been in his<br />\nusual condition he would doubtless have won<br />\na place. While nearly everything was going<br /><br />\nour way on the track, it was much the same<br />\nin the field. In the running high jump Garrett won third and Weedon fourth. In the<br />\nother events in which Garrett was entered he<br />\nwon first, making new State records for the<br />\nrunning hop, step and jump and 16-111 hammer throw. In the former his distance was 42<br />\nfeet 10 inches, and he threw the hammer 107<br />\nfeet 8 1-2 inches. In putting the 16-lb. shot<br />\nhe covered 37 feet 7 1-2 inches. H. S. Whitman won third, with 32 feet 4 1-2 inches, and<br />\nT. Fitzgerald fourth, 27 feet 5 1-2 inches. Garrett's running broad jump was 21 feet 2 inches,<br />\nand he threw the discus 95 feet 9 inches. In<br />\nthe latter event Fitzgerald was second, with<br />\n89 feet 2 inches, and Whitman third, 86 feet<br />\n2 inches.<br />\nW. Weedon won second place in the running hop, step and jump, with 41 feet 10 1-4<br />\ninches.<br />\nThomas Fitzgerald ran a beautiful race in<br />\nthe 440-yard run, winning first in 56 3-5 seconds. Morfit Mullen finished close up, winning third. In the bicycle races, which were<br />\nconsiderably mixed up and run on a track ill<br />\nsuited to the purpose, we had no representatives.<br />\nThe last and most interesting event was the<br />\none-mile relay, which Hopkins won hands<br />\ndown, in 3 minutes 46 3-5 seconds.<br />\nThe team was composed of S. P. Smith, Geo.<br />\nW. Knapp, Jr., J. M. Mullen and T. Fitzgerald, Jr. Smith, the new man on the team, ran<br />\nwell, leading from the start. The other men<br />\neasily increased the lead. Much of the credit<br />\nof our easy victory is due to the coaching of<br />\nMr. Wm. M. Mackdermott.<br />\nThe final standing of the clubs by points is<br />\nas follows:<br />\nJohns Hopkins<br />\nMaryland Athletic Club<br />\nY. M. C. A.<br />\nBaltimore Athletic Club<br />\nSt. Leo's Gymnasium<br />\nDruid Athletic Club<br />\nGuilford Athletic Club<br />\nDruid Outing Club<br /><br />\n65<br />\n29<br />\n22<br /><br />\nII<br />\n12<br /><br />\n4<br /><br />\nM111111=11111111.1,<br /><br />\nTHE NEWS-LETTER.<br />\nFOOT BALL<br /><br />\n7<br /><br />\nHOPKINS IN C. A. C. GAtIES.<br /><br />\nThe candidates for this year's football team<br />\nThe events of last Saturday, held at the Cohave gotten down to hard work, and there is<br />\nlumbia Athletic Club grounds, Washington,<br />\npromise of a very strong team. They praccontributed almost as much to the glory of<br />\ntice every afternoon in the cage, under the<br />\nHopkins track and field athletics as our recent<br />\nsupervision of the coach and captain. Among<br />\nvictory in the M. A. U. games.<br />\nthose training are quite a number of new men,<br />\nWe had heard a great deal about the very<br />\nwho .have done good work on other teams.<br />\nfast time of the sprinters and the number of<br />\nSome of the most promising ones are: Alfred<br />\nrecord-smashers of the District, and the perIlreeton, who played on one of the best ath- centage of rooters was small, from<br />\nsuspicion<br />\nletic club teams in the city; Abner Saylor,<br />\nthat most of our men were outclassed. On<br />\nwho played a star game on Marston's team<br />\nthe contrary, there was hardly a man whom<br />\nlast year; Griffin, who was a member of the<br />\nwe entered not of the first class.<br />\nteam of the University of Minnesota last year,<br />\nKnapp walked away with the too-yards<br />\nand Lily, Nightingale and Miller, who played dash and the 220-yards run, winning the foron one of the best-known local teams.<br />\nmer in to 3-5 seconds and the latter in 23 3-5<br />\nThe manager has announced the schedule<br />\nseconds.<br />\nof games as follows:<br />\nGarrett, although he did not get a place in<br />\nOctober 15.—Rock Hill College, at Rock<br />\nthe discus, as scratch man, won the 16-lb.<br />\nHill.<br />\nhammer event at 117 feet 3 inches.<br />\nOctober 19.—Druid Athletic Club, at ElecScholl, with a handicap, won the 16-lb. shot<br />\ntric Park, Baltimore.<br />\nput, while Fishack, a 1901 man, took second<br />\nOctober 22.—Baltimore Medical College, at place in the pole vault.<br />\nElectric Park, Baltimore.<br />\nAbercrombie took second in the 88o-yards<br />\nOctober 26. — Swarthmore College, at running, a most plucky race, with Clark a close<br />\nSwarthmore, Pa.<br />\nthird.<br />\nOctober 29.—Maryland Agricultural ColAltogether all of our men did great credit<br />\nlege, at College Park.<br />\nto themselves and to the University.<br />\nNovember 2.—Haverford, at Haverford,<br />\nThis ends the traek and field athletics for<br />\nPa.<br />\nthis fall.<br />\nNovember 5.—Western Maryland College,<br />\nat Electric Park, Baltimore.<br />\nNovember 9.—Villanova College, at Philadelphia.<br />\nN. Y. A. C. GAMS.<br />\nNovember 12.—Gallaudet College, at Electric Park, Baltimore.<br />\nOn Saturday, October 1st, the New York<br />\nNovember t6.—Rock Hill College, at Elec- Athletic Club held its annual handicap games.<br />\ntric Park, Baltimore.<br />\nHopkins was well represented by Mr. Robert<br />\nNovember 19.—Open.<br />\nGarrett, who got two third places against the<br />\nNovember 24.—St. John's College, at An- champions of the world. In the hammer<br />\nnapolis, Md.<br />\nthrow his actual distance was tt8 feet 7 inches,<br />\nand in the standing broad jump he covered<br />\n9 feet to 1-2 inches. The games were held at<br />\nActive steps are being taken for the organi- the grounds of the New York Athletic Club,<br />\nzation of a basket-ball team, composed of men at Travers Island, before a large crowd of<br />\nwho have been in the local leagues.<br />\nspectators.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br />\nUNIVERSITY CHAT.<br /><br />\nThrough the summer vacation months the<br />\nfaculty was widely scattered in travel, at home<br />\nand abroad, or in quiet recreation in the mountains or along the coast.<br />\nPresident Gilman was at North-east Harbor, Maine.<br />\nDean Griffin and family spent the season at<br />\nLake Placid, the Adirondacks.<br />\nDr. Ames travelled on the Continent and in<br />\nEngland.<br />\nDr. Kirby Smith was among the Hopkinsians at the White Sulphur Springs, Virginia.<br />\nOf the Medical Faculty, Dr. Oster was in<br />\n,Europe; Dr. Halsted spent the summer in the<br />\nmountains of North Carolina.<br />\nProf. Ira Remsen was in Vermont and at<br />\nDeer Isle, Maine.<br />\nProf. Adams spent the vacation months in<br />\nliterary work at Amherst.<br />\nDr. Spieker travelled through the West, remaining some weeks in Nevada.<br />\nDr. Thomas S. Baker devoted several<br />\nmonths to study and travel in Germany.<br />\nDr. and Mrs. Vincent sought the seclusion<br />\nof a quiet little town in Ohio, six miles from a<br />\nrailroad, where they were free to carry on their<br />\nliterary work.<br />\nDr. E. E. Reed, of the Chemical Department, has been called to the professorship of<br />\nchemistry and physics at the Charlestown<br />\nUniversity, S. C.<br />\nPresident Gilman was in New York last<br />\nweek for the meeting of the Peabody Educational Fund. He was elected a member of<br />\nthe Committee on Finance.<br />\nThe Adirondacks were quite popular with<br />\nHopkins men this summer. E. S. Bruce and<br />\nJohn W. Griffin spent the season there. A<br />\nnumber of Hopkinsians canoed in Maine waters. Conway S. Hodges, Howard Post,<br />\nCharles M. Remsen and Edward L'Engle were<br />\namong those who either pitched their tents at<br />\nthe picturesque Lake Moosehead or shot the<br />\nrapids that abound in Maine streams.<br /><br />\nRegistrar Ball gives out the approximate<br />\nenrollment of students to date of October 5 as:<br />\nGraduates, 206; medical, 202; undergraduates, 190. The total, 598, is somewhat in<br />\nexcess of the enrollment of last year.<br />\nThe entering class numbers 69, 6o candidates for the degree of A. B., and 9 special<br />\nstudents. Sixty-three students are entered<br />\nin the first year class of the Medical School.<br />\nThe prospects for the usual up-to-date<br />\nBanjo, Mandolin and Glee Clubs, this year,<br />\nare very bright. The first trials have been<br />\nheld and a number of new faces will appear<br />\nin the make-up of the clubs. Tours are<br />\nplanned for both the Christmas and Easter vacations, under the management of Joshua Levering, Jr.,'99. Marion K. Jungbluth,'99, will<br />\nthis year lead the Glee Club. As last year, the<br />\nMandolin and Banjo Clubs will be led by Girvin Peters.<br />\nAt the reception tendered the incoming students by the Y. M. C. A., Mr. Eugene Levering, representing the Board of Trustees, spoke<br />\nwith great feeling of the late Dr. James Carey<br />\nThomas, who for so many years had identified<br />\nhimself with the Association's work in the University.<br />\nProfessor Adams will conduct, as a department of the Association's work, a study of the<br />\nApostolic Church and the Growth of Modern<br />\nMissions, Saturday mornings at half-past nine.<br />\nProfessor Adams' course last year on the Lif:<br />\nof Christ was largely attended by graduates<br />\nand undergraduates, and this year's studies<br />\npromise to be equally well attended.<br />\nAt the conclusion of Prof. Adams's lecture,<br />\nDr. Jeffrey R. Brackett will conduct a half<br />\nhour's conference on Applied Sociology, from<br />\no to 10.30 every Saturday.<br />\nDr. Brackett<br />\naims to interest university men in practical<br />\nsocial work, and in the social problems of the<br />\ncity. The 'Varsity Y. M. C. A. is at present<br />\nlargely interested in the Lawrence House, a<br />\nsocial settlement work begun in the Winans'<br />\ntenements of Southwest Baltimore, in 1893,<br />\nby the late Rev. Edward A. Lawrence.<br /><br />\nI<br /><br />\n/<br /><br />\n4k<br />\n•<br /><br />\n•<br />\n.1<br /><br />\n11111111......._<br /><br />\nBARTHOLOMAY BREWERY CO.<br />\nUM<br /><br />\nGoods<br /><br />\nROCHESTER, N. Y.<br /><br />\ncalled for<br /><br />\nCC)<br /><br />\nand<br /><br />\nITSELF. ?<br />\n,k0,t,% ‘IS MERirs. i<br /><br />\nts vc SELLS<br /><br />\n\\*%%<br />\n\\WIIIII/IRP'l<br /><br />\na<br /><br />\n-A, ..t.......: , .,:.„..<br />\nARTHOLOMAYS<br />\nROCHESTER<br />\n‘'<br />\n•...BEER.<br />\n‘,3<br /><br />\ndelivered.<br /><br />\nBohemian ot<br />\nBavarian 4t<br />\nMaerzen<br />\nApollo ot<br /><br />\nsis<br />\nDRY CLEANSING AND DYEING, 216 W. Fayette Street.<br /><br />\nJohns Hopkins University,<br /><br />\n1060—Tolophone-2000<br /><br />\nBALTIMORE BRANCH:<br /><br />\nOffice and Depot, - 227-239 S. Central Ave.<br />\nGEO. C. SUCRO, MANAGER<br /><br />\nThe Chas. Wilms Surgical lustrument Co.<br />\nBENJ. A. NIELSON, 06111 Msnager.<br /><br />\nPROGRAMMES FOR 1898-99.<br />\nThe Johns Hopkins University Circular containing announcements<br />\n. . of the Collegiate and Graduate courses offered for the aca▪ demic year beginniag October ult, i828, may be had on appli• cation to the Registrar of the Johns Hopkins University.<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of the Johns Hopkins Medical School may also „<br />\n. . be had on application to the Registrars.<br /><br />\nFINE SURGICAL INSTRUMENTS,<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br /><br />\n300 N. HOWARD ST., - BALTIMORE, MD.<br />\nTKLEPHONE 771.<br />\nP111‘,All SCHOOL OF<br /><br />\nSeason October 15 to June ist.<br /><br />\nScientific<br />\nPbpsical<br />\nCraining<br /><br />\nEndorsed by the Leading Physicians and<br />\nBusiness Men of Baltimore.<br />\nWe guarantee best results. . .<br /><br />\n531 N.Howard St.<br />\novrosrrii.<br />\nNew City College.<br /><br />\nDON HENRI,<br />\nJ. W. WALTEMEVER,<br />\nManagers.<br />\nFor terms apply at School.<br /><br />\nTHE UNIVERSITY SCHOOL FOR BOYS,<br />\n1205 CATHEDRAL ST.<br />\nW. S.<br /><br />\nMARSTON,<br /><br />\nA. B. AND C.<br /><br />\nC.<br /><br />\nPRINCIPAL.<br /><br />\nTen experienced teachers as assistants.<br /><br />\nPreparatory Department<br /><br />\nALISISRT IIILDEBRANDT.<br /><br />\nESTABLISHRD 1838,<br /><br />\nC. H. HILDEBRANDT &amp; SON,<br />\nPAANUFACTUPIErl• Or<br /><br />\nMusical Instruments and Strings, Repairing of Violins, Music Boxes<br />\nand Other Instruments. Agents for the Celebrated Shaw<br />\nPiano. A Large Collection of Genuine Old Violins.<br /><br />\nBALTIMORE, October 8, z898.<br />\nRealizing that Medicinal Beverages should be selected with the<br />\ngreatest possible care from the most reliable producers, we have<br />\nused every precaution in our importations to select all of our Wines<br />\nand Liquors from the most reliable houses in Europe, and can give<br />\nevery assurance to our patrons that they can find strictly pure old<br />\nOporto Port, Madeira, Sherry, Burgundies, Clarets, Sauternes, Cognacs, etc„ when ordering from<br /><br />\nJORDAN STABLER,<br />\n701-3-5 Madison Ave.<br /><br />\nfor Boys from eight to elven years old.<br /><br />\nNEW YORK TO BREMEN, •..•<br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN ....<br /><br />\nNORTH GERMAN LLOYD S.S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER &amp; CO.<br />\nGeneral Agents.<br /><br />\nFor particulars apply to<br /><br />\nBALTIMORE, MD.<br /><br />\nNo. 19 N. LIBERTY ST.<br /><br />\nDIRECT.<br /><br />\nevery description. . .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br /><br />\nF. It IVIVID5011 &amp; C°<br /><br />\n509 W. Franklin Street,<br /><br />\nTelephone 2095.<br /><br />\nBaltimore, Mn.<br /><br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 415 Water Street,[Second 81-]<br />\nAdjoining Custom House on the Weet<br /><br />\nShort Insurance for a Day<br />\n.. or Longer Period,<br /><br />\nTHOMAS I. CAREY, Pru.<br /><br />\nBOARD OF DIRECTORS<br /><br />\nATLANTIC TR2OcNSPOR.T LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to Eundon at reasonable rates.<br /><br />\nThe Atlantic Transport Co.,<br />\nsoe-soa WATER STREET,<br />\nBALTIMORE.<br /><br />\nNew York Shipping Co.,<br />\nI BROADWAY,<br />\nNEW YORK.<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\nMadison &amp; Howard Sts.<br /><br />\nFord. C. Latrobe,<br />\nA. J. Ulman,<br />\nWilliam Harvey<br />\nJoshua G. Harvey,<br />\nJames W. Hates<br />\nN. W. James,<br />\nAndrew D. Jones. GRIFFITH 1HIflTU,Lt.<br /><br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nRICHARD B. POST, billy.<br /><br />\n..f,PiloToGRAPHicsu NIL!es<br />\n:4-1111,1111<br /><br />\n. Text Books •<br />\n. Note Books . _<br />\nStudents' Supplies<br /><br />\nt I<br /><br />\n'II<br /><br />\n'<br /><br />\nKodaks &amp; Cameras<br />\nAll<br />\nthings Photographic.<br />\nDeveloping<br />\nand<br />\n4,ie<br />\nFinishing.<br /><br />\n0,4<br /><br />\n,1111<br />\n!<br />\nI<br />\n4<br />\n!106<br />\n1<br /><br />\nN CHARLES<br />\nt dALTiMORE MD<br /><br />\nST<br /><br />\n,<br /><br />\nTHE CUMMINS<br />\nPHOTO-STOCK CO<br />\n40 W. Lexington St.<br /><br />"}], "field_media_file": [{"target_id": 36121, "display": null, "description": null, "target_type": "file", "target_uuid": "bd30e476-f0a7-46b3-8c28-1bae15eea99a", "url": "http://digital.library.jhu.edu/system/files/2022-03/12116-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12116, "target_type": "node", "target_uuid": "e7c772b0-37bd-4290-a12b-c60dd9f25051", "url": "/node/12116"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0d9fb22a-4354-4131-a2eb-a15349f64e9c"}]}