{"mid": [{"value": 51687}], "uuid": [{"value": "1c1ef0a7-5454-4503-8726-abf683be2821"}], "vid": [{"value": 51687}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-21T22:31:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16724-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-21T22:31:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-21T22:31:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "| wish it were possible for me. personally to extend a warm handshake of greeting to every visitor. Since<br />\nit isn't, allow me to express my cordial welcome in the printed word. As mayor of the city, | voice<br />\n<br />\nBaltimore's welcome with the heartiness typical of Southern hospitality.<br />\n<br />\nThere are many sides to Baltimore. If you are artistically inclined and are fond of paintings and bronzes,<br />\nyou'll get a real thrill when you visit our Art Museum. The building itself, is an architectural gem and the<br />\n<br />\nart objects in it have been very carefully selected.<br />\n<br />\nIf you fancy picturesque scenery, you'll go into raptures when you see Druid Hill Park. It is one of the<br />\ngreat parks in the land, embracing over seven hundred acres of gloriously inspiring landscape. Be sure<br />\n<br />\n <br />\n<br />\nUHE<br />\n<br />\nPlan to see Baltimore in all its charming facets. The scene around the War Memorial, the City Hall Plaza<br />\nand the City Hall will remind you of picturesque Berlin.<br />\n<br />\nThe old world dignity of Mt. Vernon Place will bring up memories of the Place Vendome in Paris<br />\n<br />\nAnd Lexington Street in our shopping district may bring up visions of Piccadilly Circus in London.<br />\nTry to catch the spirit of Baltimore. A stroll through Guilford, Homeland and Roland Park, our most<br />\n<br />\nimpressive suburban section, will show you that Baltimoreans appreciate the finer things . . . and know<br />\n<br />\nhow to live.<br />\n<br />\nto see lovely Druid Lake. If you have any children, take them to the zoo, by all means. Queen Rambai-<br />\n<br />\nBarni of Siam described Druid Hill Park as one of the most beautiful she ever visited.<br />\n<br />\nNow when it comes to the historic, Baltimore is rich in landmarks and in shrines of history. Baltimore<br />\nopens many breathtaking pages of past glories. Of course, you're planning to see Fort McHenry. This<br />\nfamous fort was the scene of the memorable repulse of the British fleet in 1814.<br />\n<br />\nstirring battle that Francis Scott Key wrote the “Star Spangled Banner.”<br />\n<br />\nThe Shot Tower is another well-known landmark. It was erected in 1828 and is the only one of its kind<br />\n<br />\nin America.<br />\n<br />\nThen, we have superbly sculptured monuments by the score. Baltimore is known as the ““Monumental<br />\nCity” and has certainly earned the honor. First,” among our important monuments is the impressive<br />\n<br />\nIt was during this’<br />\n<br />\nYou'll find that our hotels enjoy offering superb service to the visitor within our midst.<br />\n<br />\nThe delicacies in sea food and Southern food are to be had in Baltimore at their best.- Modestly, | say<br />\n<br />\nW ashington Monument in quaint Mt. Vernon Place. It was the first public monument erected by any<br />\ncity or state in memory of George Woashington. A tour of the monuments, shrines, tablets and other<br />\nhistorical places should give you several pleasant afternoons.<br />\n<br />\nMunicipa| Tour One<br />\n<br />\nOne-hour Motor Trip from the City Hall<br />\nto the Mansion House in Druid Hill Park<br />\n<br />\nStart at the City Hall Plaza, corner of Holliday and Lexington<br />\nStreets. Facing the City Hall on the east is the imposing War<br />\nMemorial Building. In the block next to the City Hall is the<br />\nnew Municipal Office Building. On the opposite side of<br />\nHolliday Street is the Municipal Museum.<br />\n<br />\n <br />\n<br />\nSouth on Holliday Street to Fayette. West on Fayette to<br />\nCalvert. In the plaza is the Battle Monument, erected more<br />\nthan 100 years ago in commemoration of the victories at the<br />\nBattle of Baltimore (North Point) and in the attack on Fort<br />\nMcHenry in 1814. On the right is the new Postoffice. On<br />\nthe left is the city's $3,000,000 Courthouse, containing<br />\npicturesque mural paintings depicting the early history of the<br />\ncity and state.<br />\n<br />\nSouth on Calvert to Redwood. West on Redwood to Light.<br />\nOn the northeast corner there is a tablet on the site of the<br />\nFountain Inn, where George Washington was entertained on<br />\nmany occasions in Colonial days. .<br />\n<br />\nNorth on Light Street to Baltimore—On the southwest corner<br />\nis the Baltimore Trust Building, 34 stories, total height 500<br />\nfeet, the city's tallest structure. On the northeast corner is the<br />\ncity's oldest bank, its charter dating from 1795.<br />\n<br />\nNorth on Light Street (St. Paul St.) to Fayette. West on<br />\nFayette Street to Green—On the southeast corner stands old<br />\nW estminster Presbyterian Church and graveyard, which con-<br />\ntains the remains of Edgar Allan Poe, poet and writer, and<br />\n<br />\nauthor of “'The Raven''.<br />\n<br />\nSouth on Green Street to Baltimore, thence east to Howard<br />\nStreet, thence north to Saratoga. This section just passed through<br />\nis the heart of Baltimore's retail shopping district, containing<br />\nnearly all of the large department stores and specialty shops.<br />\nThe district extends a short distance westward.<br />\n<br />\nEast on Saratoga Street to Charles—On the southeast corner<br />\nis St. Paul’s P. E. Church, the oldest congregation in Baltimore.<br />\nThe present edifice stands on the site of the original lot bought<br />\nin 1830 for $10.<br />\n<br />\nNorth on Charles Street to Mulberry—On the northeast<br />\ncorner is the Roman Catholic Archepiscopal residence, for<br />\nmany years the home of James Cardinal Gibbons, the first<br />\nAmerican to be given the Red Hat by the Vatican.<br />\n<br />\nWest on Mulberry Street to Cathedral, thence north on<br />\nCathedral—On the right is the Roman Catholic Cathedral,<br />\nerected in 1808, and on the left Calvert Hall College. Note<br />\n<br />\nRochambeau tablet on College wall. It was here that Count<br />\nRochambeau camped with his army on the return from York-<br />\ntown.<br />\n<br />\nNorth on Cathedral to Monument, thence east to Charles—In<br />\nthe center of the square is the first monument erected to<br />\nGeneral Washington by any commonwealth. The corner-<br />\nstone was laid on July 4, 1815, with Masonic ceremony. The<br />\nland was given by Col. John Eager Howard, Revolutionary<br />\nWar hero and friend of Washington, whose statue is in the<br />\nsquare. The stone was given by the owner of a Maryland<br />\nquarry and the funds for construction were raised by lottery.<br />\nThe massive figure of Washington was placed atop the shaft<br />\nin 1824. The total height is 210 feet. A few yards south of<br />\nthe monument stands an equestrian statue of Lafayette,<br />\nerected by the city of Baltimore and dedicated by President<br />\nCoolidge. On the northeast corer is Mount Vernon Place<br />\nM. E. Church, erected on the site of the home in which<br />\nFrancis Scott Key, author of ‘“‘The Star Spangled Banner,\"<br />\ndied. Note tablet on wall.<br />\n<br />\nOn the southeast corner is the Peabody Conservatory of<br />\nMusic, of national importance, founded by George Peabody<br />\nwhose statue is in the square. Looking south from this point,<br />\na distance of one block, is the Walters Art Gallery (Centre<br />\nand Charles) which was bequeathed to the city of Baltimore<br />\nby Henry Walters. It contains one of the finest private col-<br />\nlections in the world.<br />\n<br />\nCircle Washington Monument and go west on Monument<br />\nStreet to Cathedral, thence to Mt. Royal Avenue, passing the<br />\nhandsome Maryland Institute of Art and Design on the left,<br />\nthence around south side of reservoir to the Mansion House<br />\nin Druid Hill Park. This is Baltimore's oldest public park. It is<br />\nreplete with natural scenery and contains nearly 700 acres. In<br />\nthe park are to be seen deer and sheep and the city zoo is also<br />\nlocated here.<br />\n<br />\nMunicipal Tour Two<br />\n<br />\nOne-hour Motor Trip from the Mansion<br />\nHouse in Druid Hill Park to<br />\nFort McHenry<br />\n<br />\nLeaving the Mansion House, proceed to the north side of<br />\nreservoir, cross Cedar Avenue Bridge to the U. S. Marine<br />\nHospital, thence north in W yman Park to University Parkway<br />\nat Stony Run Bridge, thence circling in front of the Maryland<br />\nCasualty Company group of buildings at 40th Street and<br />\nKeswick Road, coming out at 40th to University Parkway,<br />\nthence to 39th Street, thence ¢ast to Charles, thence north on<br />\nCharles to Greenway, then making sharp right turn coming<br />\nsouth on Greenway to Charles and University Parkway. In<br />\nthis section, which includes a part of Guilford, may be seen<br />\nsome of Baltimore's fine residences and modern apartment<br />\nhouses.<br />\n<br />\nAt Charles Street enter Homewood, the group of buildings of<br />\n<br />\nthe Johns Hopkins University. The Colonial mansion opposite<br />\n<br />\nGreenway was the home of Charles Carroll of Carrollton, one<br />\n<br />\nof the Maryland signers of the Declaration of Independence,<br />\n<br />\nand is one of the finest examples of Colonial architecture yet<br />\n<br />\nsstanding. Circle the Hopkins grounds, coming out at 33rd<br />\ntreet.<br />\n<br />\nSouth on Charles Street to 29th passing on the right the new<br />\nMunicipal Art Museum.<br />\n<br />\nEast on 29th Street to Greenmount Avenue, thence north to<br />\n33rd Street, thence east to the Hillen Road. On the right, a<br />\nshort distance east of Greenmount Avenue, on an eminence<br />\nstands the new City College, which is declared to be the finest<br />\nbuilding of its kind from an architectural standpoint in the<br />\nUnited States. A little nearer on the left side is seen the<br />\nBaltimore Stadium, the scene of many big contests. The seat-<br />\ning capacity of the Stadium is 78,000.<br />\n<br />\nAt Hillen Road circle the city's big water filtration plant, the<br />\ncapacity of which now is being doubled.<br />\n<br />\nEnter Clifton Park at 33rd Street and pass around or near the<br />\nmansion of the late Johns Hopkins, who made possible the<br />\nUniversity, Medical School and Hospital bearing his name. At<br />\nthe time of Hopkins' endowment it was the largest single be-<br />\nquest made to any educational institution in the country.<br />\nLeave Clifton Park by way of the Washington Street entrance<br />\nto North Avenue and thence west to Broadway.<br />\n<br />\nSouth on Broadway to Monument Street. On the left is the<br />\ngroup of buildings of the world-renowned Johns Hopkins<br />\nHospital and Medical School, the buildings extending<br />\nseveral blocks to the south and east. Ccntinue south on<br />\nBroadway to Fayette Street, near the corner being seen a<br />\nmonument to Thomas Wildey, founder of Odd Fellowship<br />\nin the United States more than 100 years ago. Continue south<br />\non Broadway to its foot, which is Fell's Point, the third oldest<br />\nsection of Baltimore, several houses over a century old still<br />\nstanding there. It was here that the famous clipper ships were<br />\nbuilt several generations ago. Go around the market house,<br />\nwhich also is very old, and proceed north to Fayette Street.<br />\n<br />\nWest on Fayette Street to Aisquith. On the Northwest<br />\ncorner, in the rear, is an old Quaker Meeting House and<br />\ngraveyard dating back nearly 200 years. Continue west on<br />\nFayette Street to the Civic Center, which begins at the Falls-<br />\nway. In a straight line running westward are to be seen the old<br />\nShot Tower, erected in 1828, Police Building, War Memorial,<br />\nCity Hall, Postoffice and Courthouse. At Gay Street, looking<br />\nnorth across the plaza, are to be seen the Fire Department and<br />\n<br />\nMunicipal Office Buildings.<br />\n<br />\nSouth on Gay Street to Pratt, thence east to Albermarle. On<br />\nthe northwest corner is the ''Flag House,\" where Mrs. Mary<br />\nPickersgill made the flag which floated triumphantly over<br />\nFort McHenry throughout its bombardment in 1814, This<br />\nflag is preserved in the Smithsonian Institute at Washington.<br />\n<br />\nNorth on Albemarle Street to Lombard, thence to Front<br />\nStreet to the house where Charles Carroll of Carrollton died.<br />\nThe city has been using the building as a vocational school.<br />\nThis section today is not very inviting, but it is a part of old<br />\nBaltimore Town and once contained the residences of its best<br />\ncitizens.<br />\n<br />\nHere's hoping your stay in Baltimore will be a happy one.<br />\nhome about some of your pleasant experiences in our city.<br />\n<br />\nit, Baltimore cuisine is outstanding .<br />\n<br />\nWest on Lombard Street to Light, thence south to Key High-<br />\nway, thence to Fort Avenue and Fort McHenry. The old fort<br />\n<br />\n. dates from 1777, but was not used in the Revolutionary War.<br />\n<br />\nIt was constructed originally by the citizens of Baltimore at<br />\ntheir own expense. Later it was presented to the Federal<br />\nGovernment and the Star Fort built in its center. The Govern-<br />\nment appropriated only $20,000 for this, the people of<br />\nBaltimore paying the balance. The fort defeated the British<br />\nfleet on September 13-14, 1814, said defeat causing the<br />\nBritish Government to make peace soon afterward. The fort,<br />\nwhich contains statues of Col. George Armistead, its defender;<br />\nFrancis Scott Key, who wrote the National Anthem while<br />\ndetained on a British ship during the bombardment, and a<br />\nshaft to the privateersmen, was dedicated on Septem‘)er 12,<br />\n1928, as a National Shrine. The old fort has been restored to<br />\nits appearance in 1814, The Star Fort, magazine, dungeons,<br />\ncannon ball storage mounds, batteries, officers’ quarters and<br />\nother buildings are of exceptional interest.<br />\n<br />\nMunicipal Tour Three<br />\n<br />\nTour of Baltimore's Public Park System<br />\n<br />\nStarting from Memorial Plaza east of the City Hall. East on<br />\nFayette Street to Fallsway, south to Baltimore, east to Eden<br />\nStreet. South on Eden gtreet to Gough the course will pass<br />\nCity Springs Square in the most thickly populated section of<br />\nthe city. East on Gough to Patterson Park, the city's first<br />\nPublic Park of consequence with its many historical associa-<br />\ntions.<br />\n<br />\nWesterly on Baltimore Street from Patterson Park to Broad-<br />\nway and thence north apast the Johns Hopkins Hospital to<br />\nNorth Avenue and eastwardly to Washington Street and into<br />\nClifton Park, one time the home of the celebrated Johns<br />\nHopkins.<br />\n<br />\nLeaving Clifton Park by way of the Alameda to 33rd Street<br />\nand westerly to Venable Park and the Baltimore Stadium.<br />\nContinuing westerly to University Parkway and thence north-<br />\nwest to the entrance into W yman Park in the vicinity of 39th<br />\nStreet and south through W yman Park to the Marine Hospital<br />\nand westerly into Druid Hill Park, world famous for its natural<br />\nbeauties.<br />\n<br />\nLeaving Druid Hill Park by way of Mondawmin Avenue out<br />\nthe Gwynn's Falls Parkway to the Windsor Mill Road to the<br />\nFranklintown Road and thence south through Gwynn's Falls<br />\nPark to the Ellicott Driveway and thence continuing by way<br />\nof Brunswick Street, Wilkens Avenue and Monroe Street into<br />\nCarnroll Park to the historical museum maintained by the<br />\nDaughters of the American Revolution and where the most<br />\nmodern playground facilities may be seen.<br />\n<br />\nLeaving Carroll Park by way of Bayard Street to Hamburg<br />\nand following easterly on Hamburg to Battery Avenue will<br />\nbring the party to the celebrated Federal Hill Park overlook-<br />\ning the Baltimore Harbor.<br />\n<br />\nSouth from Federal Hill Park on Battery Avenue to Riverside<br />\nPark with its modern swimming pool facilities and thence<br />\n<br />\nThis folder is a miniature “guide book.” It will tell you where to go and how to go. See Baltimore and<br />\nyou will see portrayed the history of our country, through important shrines and beautiful memorials.<br />\nYou will see, too, a city where people enjoy 312 days of sunshine a year. Not a land of enchantment<br />\nwith make-believe joys and bizarre thrills. Baltimore is real . . . it's human . . . it's genuine. It has<br />\ncharacter, friendliness and an appreciation of living.<br />\n<br />\n <br />\n<br />\nwest on Randall Street to Hanover and south on Hanover<br />\nacross the bridge to Broening Park where refreshments may<br />\n<br />\nbe had at the Maryland Yacht Club.<br />\nMunicipal Tour Four<br />\n<br />\nGreen Spring Valley--Loch Raven Tour<br />\n<br />\nSee the picturesque country-side surrounding Baltimore.<br />\nEnjoy the scenic beauties of this charming rolling country in<br />\na memorable two-hour tour.<br />\n<br />\nStart at Belvedere Avenue and Park Heights Avenue. Con-<br />\ntinue along Park Heights Avenue past the Maryland Country<br />\nClub. Turn left on Slade Avenue past Suburban Club. Turn<br />\nright on Reisterstown Road, past Woodholme Country Club.<br />\nTurn right at Tobin Station on Valley Road, past Green Spring<br />\nValley Hunt Club. Turn left at Stevenson. Continue on Valley<br />\nRoad past Maryland Polo Club and Brooklandwood Farm,<br />\nscene of the nationally famous point-to-point race. Turn left<br />\non Falls Road. Turn right on Seminary Avenue, through<br />\nLutherville past Maryland College for Women. Turn left at<br />\nYork Road past Timonium, scene of Maryland State tair. Turn<br />\nright at Warren Road. Tu-n right at Sunnybrook on Jarrets-<br />\nville Road. Sharp left U turn to Dulaney Valley to Loch<br />\nRaven Road, to Loch Raven Bridge past impressive Loch<br />\nRaven Dam. Continue to Cromwell Bridge to Joppa Road.<br />\nTurn left at Charles Street Avenue, past Elkridge Kennels. On<br />\nthe left, see Homeland, impressive residential section of<br />\nBaltimore. Continue on Charles Street to Mt. Vernon Place,<br />\none of the most beautiful public squares in the country.<br />\n<br />\nPORT OF BALTIMORE<br />\nAs viewed from historic Federal Hill Park<br />\n<br />\nFrom this picturesque hilltop can be seen the city’s growing<br />\nskyline, while spread out below is Baltimore's international<br />\nport, which handles shipping from the Seven Seas and con-<br />\nducts business with all important harbors of the United States<br />\nand foreign countries. This port handles a yearly business<br />\nof 15,000,000 tons of cargo, valued at $750,000,000.<br />\n<br />\nFifty-four steamship services operate direct from Baltimore.<br />\n<br />\nSoutheast across the harbor is Fort McHenry, birthplace of<br />\nthe “‘Star-Spangled Banner'. In the distance is historic Fort<br />\nCarroll.<br />\n<br />\nThe harbor view includes the four great marine terminals of<br />\nthe Baltimore and Ohio Railroad, the Pennsylvania Railroad,<br />\nthe Western Maryland Railway and the Canton Company,<br />\nwith 38 deepwater ocean piers. In the Middle Branch section<br />\nis the new $8,500,000 marine terminal constructed by the<br />\ncity of Baltimore and operated by the Western Maryland<br />\nRailway. Modern shipbuilding and repair yards are scattered<br />\nalong the shore line. Great waterfront industrial plants in the<br />\nbusiness of steel, sugar, petroleum, copper, tin, spices, chemi-<br />\ncals, fertilizers, canning, airplane manufacturing, and many<br />\nother lines give testimony to the importance of Baltimore as a<br />\n<br />\nseaboard manufacturing center, and the seventh industrial city<br />\n<br />\nof the United States.<br />\n<br />\nJacksz;<br />\n<br />\nMain ship channels and all channels leading to the ocean<br />\n<br />\n_ piers of the marine terminals have a controlling depth of 35<br />\n<br />\ne Aificrd 1red<br />\nDeacidified using the<br />\n<br />\nS<br />\n<br />\n <br />\n <br />\n<br />\nNeutralizing Agent: i ;<br />\nTreatment %aié: Y fl\\/l7ne31um UGS<br />\n| /<br />\nDODEKKEEPER<br />\n<br />\n: e e,<br />\nPRESERVATION TECHNOLOGIES, Lp,<br />\n<br />\nfeet at mean low water.<br />\n<br />\nThe Baltimore Association of Commerce will supply the visi-<br />\ntor with complete data on the Port of Baltimore, the second<br />\nforeign trade tonnage port on the Atlantic Coast.<br />\n<br />\nMake Baltimore<br />\n<br />\nYour Tour-quarters<br />\n<br />\nThe territory surrounding Baltimore is rich in historic interest<br />\nand nature's beauties. Make Baltimore your headquarters and<br />\narrange daily trips that will live in your memory through the<br />\nyears.<br />\n<br />\nSee quaint Annapolis, one of the most charming Colonial<br />\ntowns in the United States.<br />\n<br />\nSee Gettysburg Battlefield, one of the world's most important<br />\nbattlefields.<br />\n<br />\nSee Mount Vernon, home and burial place of George Wash-<br />\nington and his wife.<br />\n<br />\nSee Washington, the nation's capital.<br />\nSee Frederick, the home of Barbara Fritchie.<br />\n<br />\nSee Southern Maryland where the first Maryland Colonists<br />\n<br />\nsettled.<br />\n<br />\nSee the Eastern Shore of Maryland, a beautiful territory with<br />\n<br />\nlarge estates and stately Colonial mansions.<br />\n<br />\nSee Ocean City, Maryland's famous seashore. And bathe in<br />\n<br />\nthe Atlantic Ocean.<br />\n<br />\n <br />\n<br />\nAnd see, too, many other places you have read about on the<br />\n<br />\npages of history.<br />\n<br />\nBookkeeper process.<br />\n<br />\n111 Thomson Park Drive<br />\nCranberry Township, PA 16066<br />\n<br />\n(724) 779-2111<br />\n<br />\n  <br />\n   <br />\n\f", "format": "basic_html", "processed": "| wish it were possible for me. personally to extend a warm handshake of greeting to every visitor. Since<br />\nit isn't, allow me to express my cordial welcome in the printed word. As mayor of the city, | voice<br /><br />\nBaltimore's welcome with the heartiness typical of Southern hospitality.<br /><br />\nThere are many sides to Baltimore. If you are artistically inclined and are fond of paintings and bronzes,<br />\nyou'll get a real thrill when you visit our Art Museum. The building itself, is an architectural gem and the<br /><br />\nart objects in it have been very carefully selected.<br /><br />\nIf you fancy picturesque scenery, you'll go into raptures when you see Druid Hill Park. It is one of the<br />\ngreat parks in the land, embracing over seven hundred acres of gloriously inspiring landscape. Be sure<br /><br /><br /><br />\nUHE<br /><br />\nPlan to see Baltimore in all its charming facets. The scene around the War Memorial, the City Hall Plaza<br />\nand the City Hall will remind you of picturesque Berlin.<br /><br />\nThe old world dignity of Mt. Vernon Place will bring up memories of the Place Vendome in Paris<br /><br />\nAnd Lexington Street in our shopping district may bring up visions of Piccadilly Circus in London.<br />\nTry to catch the spirit of Baltimore. A stroll through Guilford, Homeland and Roland Park, our most<br /><br />\nimpressive suburban section, will show you that Baltimoreans appreciate the finer things . . . and know<br /><br />\nhow to live.<br /><br />\nto see lovely Druid Lake. If you have any children, take them to the zoo, by all means. Queen Rambai-<br /><br />\nBarni of Siam described Druid Hill Park as one of the most beautiful she ever visited.<br /><br />\nNow when it comes to the historic, Baltimore is rich in landmarks and in shrines of history. Baltimore<br />\nopens many breathtaking pages of past glories. Of course, you're planning to see Fort McHenry. This<br />\nfamous fort was the scene of the memorable repulse of the British fleet in 1814.<br /><br />\nstirring battle that Francis Scott Key wrote the “Star Spangled Banner.”<br /><br />\nThe Shot Tower is another well-known landmark. It was erected in 1828 and is the only one of its kind<br /><br />\nin America.<br /><br />\nThen, we have superbly sculptured monuments by the score. Baltimore is known as the ““Monumental<br />\nCity” and has certainly earned the honor. First,” among our important monuments is the impressive<br /><br />\nIt was during this’<br /><br />\nYou'll find that our hotels enjoy offering superb service to the visitor within our midst.<br /><br />\nThe delicacies in sea food and Southern food are to be had in Baltimore at their best.- Modestly, | say<br /><br />\nW ashington Monument in quaint Mt. Vernon Place. It was the first public monument erected by any<br />\ncity or state in memory of George Woashington. A tour of the monuments, shrines, tablets and other<br />\nhistorical places should give you several pleasant afternoons.<br /><br />\nMunicipa| Tour One<br /><br />\nOne-hour Motor Trip from the City Hall<br />\nto the Mansion House in Druid Hill Park<br /><br />\nStart at the City Hall Plaza, corner of Holliday and Lexington<br />\nStreets. Facing the City Hall on the east is the imposing War<br />\nMemorial Building. In the block next to the City Hall is the<br />\nnew Municipal Office Building. On the opposite side of<br />\nHolliday Street is the Municipal Museum.<br /><br /><br /><br />\nSouth on Holliday Street to Fayette. West on Fayette to<br />\nCalvert. In the plaza is the Battle Monument, erected more<br />\nthan 100 years ago in commemoration of the victories at the<br />\nBattle of Baltimore (North Point) and in the attack on Fort<br />\nMcHenry in 1814. On the right is the new Postoffice. On<br />\nthe left is the city's $3,000,000 Courthouse, containing<br />\npicturesque mural paintings depicting the early history of the<br />\ncity and state.<br /><br />\nSouth on Calvert to Redwood. West on Redwood to Light.<br />\nOn the northeast corner there is a tablet on the site of the<br />\nFountain Inn, where George Washington was entertained on<br />\nmany occasions in Colonial days. .<br /><br />\nNorth on Light Street to Baltimore—On the southwest corner<br />\nis the Baltimore Trust Building, 34 stories, total height 500<br />\nfeet, the city's tallest structure. On the northeast corner is the<br />\ncity's oldest bank, its charter dating from 1795.<br /><br />\nNorth on Light Street (St. Paul St.) to Fayette. West on<br />\nFayette Street to Green—On the southeast corner stands old<br />\nW estminster Presbyterian Church and graveyard, which con-<br />\ntains the remains of Edgar Allan Poe, poet and writer, and<br /><br />\nauthor of “'The Raven''.<br /><br />\nSouth on Green Street to Baltimore, thence east to Howard<br />\nStreet, thence north to Saratoga. This section just passed through<br />\nis the heart of Baltimore's retail shopping district, containing<br />\nnearly all of the large department stores and specialty shops.<br />\nThe district extends a short distance westward.<br /><br />\nEast on Saratoga Street to Charles—On the southeast corner<br />\nis St. Paul’s P. E. Church, the oldest congregation in Baltimore.<br />\nThe present edifice stands on the site of the original lot bought<br />\nin 1830 for $10.<br /><br />\nNorth on Charles Street to Mulberry—On the northeast<br />\ncorner is the Roman Catholic Archepiscopal residence, for<br />\nmany years the home of James Cardinal Gibbons, the first<br />\nAmerican to be given the Red Hat by the Vatican.<br /><br />\nWest on Mulberry Street to Cathedral, thence north on<br />\nCathedral—On the right is the Roman Catholic Cathedral,<br />\nerected in 1808, and on the left Calvert Hall College. Note<br /><br />\nRochambeau tablet on College wall. It was here that Count<br />\nRochambeau camped with his army on the return from York-<br />\ntown.<br /><br />\nNorth on Cathedral to Monument, thence east to Charles—In<br />\nthe center of the square is the first monument erected to<br />\nGeneral Washington by any commonwealth. The corner-<br />\nstone was laid on July 4, 1815, with Masonic ceremony. The<br />\nland was given by Col. John Eager Howard, Revolutionary<br />\nWar hero and friend of Washington, whose statue is in the<br />\nsquare. The stone was given by the owner of a Maryland<br />\nquarry and the funds for construction were raised by lottery.<br />\nThe massive figure of Washington was placed atop the shaft<br />\nin 1824. The total height is 210 feet. A few yards south of<br />\nthe monument stands an equestrian statue of Lafayette,<br />\nerected by the city of Baltimore and dedicated by President<br />\nCoolidge. On the northeast corer is Mount Vernon Place<br />\nM. E. Church, erected on the site of the home in which<br />\nFrancis Scott Key, author of ‘“‘The Star Spangled Banner,\"<br />\ndied. Note tablet on wall.<br /><br />\nOn the southeast corner is the Peabody Conservatory of<br />\nMusic, of national importance, founded by George Peabody<br />\nwhose statue is in the square. Looking south from this point,<br />\na distance of one block, is the Walters Art Gallery (Centre<br />\nand Charles) which was bequeathed to the city of Baltimore<br />\nby Henry Walters. It contains one of the finest private col-<br />\nlections in the world.<br /><br />\nCircle Washington Monument and go west on Monument<br />\nStreet to Cathedral, thence to Mt. Royal Avenue, passing the<br />\nhandsome Maryland Institute of Art and Design on the left,<br />\nthence around south side of reservoir to the Mansion House<br />\nin Druid Hill Park. This is Baltimore's oldest public park. It is<br />\nreplete with natural scenery and contains nearly 700 acres. In<br />\nthe park are to be seen deer and sheep and the city zoo is also<br />\nlocated here.<br /><br />\nMunicipal Tour Two<br /><br />\nOne-hour Motor Trip from the Mansion<br />\nHouse in Druid Hill Park to<br />\nFort McHenry<br /><br />\nLeaving the Mansion House, proceed to the north side of<br />\nreservoir, cross Cedar Avenue Bridge to the U. S. Marine<br />\nHospital, thence north in W yman Park to University Parkway<br />\nat Stony Run Bridge, thence circling in front of the Maryland<br />\nCasualty Company group of buildings at 40th Street and<br />\nKeswick Road, coming out at 40th to University Parkway,<br />\nthence to 39th Street, thence ¢ast to Charles, thence north on<br />\nCharles to Greenway, then making sharp right turn coming<br />\nsouth on Greenway to Charles and University Parkway. In<br />\nthis section, which includes a part of Guilford, may be seen<br />\nsome of Baltimore's fine residences and modern apartment<br />\nhouses.<br /><br />\nAt Charles Street enter Homewood, the group of buildings of<br /><br />\nthe Johns Hopkins University. The Colonial mansion opposite<br /><br />\nGreenway was the home of Charles Carroll of Carrollton, one<br /><br />\nof the Maryland signers of the Declaration of Independence,<br /><br />\nand is one of the finest examples of Colonial architecture yet<br /><br />\nsstanding. Circle the Hopkins grounds, coming out at 33rd<br />\ntreet.<br /><br />\nSouth on Charles Street to 29th passing on the right the new<br />\nMunicipal Art Museum.<br /><br />\nEast on 29th Street to Greenmount Avenue, thence north to<br />\n33rd Street, thence east to the Hillen Road. On the right, a<br />\nshort distance east of Greenmount Avenue, on an eminence<br />\nstands the new City College, which is declared to be the finest<br />\nbuilding of its kind from an architectural standpoint in the<br />\nUnited States. A little nearer on the left side is seen the<br />\nBaltimore Stadium, the scene of many big contests. The seat-<br />\ning capacity of the Stadium is 78,000.<br /><br />\nAt Hillen Road circle the city's big water filtration plant, the<br />\ncapacity of which now is being doubled.<br /><br />\nEnter Clifton Park at 33rd Street and pass around or near the<br />\nmansion of the late Johns Hopkins, who made possible the<br />\nUniversity, Medical School and Hospital bearing his name. At<br />\nthe time of Hopkins' endowment it was the largest single be-<br />\nquest made to any educational institution in the country.<br />\nLeave Clifton Park by way of the Washington Street entrance<br />\nto North Avenue and thence west to Broadway.<br /><br />\nSouth on Broadway to Monument Street. On the left is the<br />\ngroup of buildings of the world-renowned Johns Hopkins<br />\nHospital and Medical School, the buildings extending<br />\nseveral blocks to the south and east. Ccntinue south on<br />\nBroadway to Fayette Street, near the corner being seen a<br />\nmonument to Thomas Wildey, founder of Odd Fellowship<br />\nin the United States more than 100 years ago. Continue south<br />\non Broadway to its foot, which is Fell's Point, the third oldest<br />\nsection of Baltimore, several houses over a century old still<br />\nstanding there. It was here that the famous clipper ships were<br />\nbuilt several generations ago. Go around the market house,<br />\nwhich also is very old, and proceed north to Fayette Street.<br /><br />\nWest on Fayette Street to Aisquith. On the Northwest<br />\ncorner, in the rear, is an old Quaker Meeting House and<br />\ngraveyard dating back nearly 200 years. Continue west on<br />\nFayette Street to the Civic Center, which begins at the Falls-<br />\nway. In a straight line running westward are to be seen the old<br />\nShot Tower, erected in 1828, Police Building, War Memorial,<br />\nCity Hall, Postoffice and Courthouse. At Gay Street, looking<br />\nnorth across the plaza, are to be seen the Fire Department and<br /><br />\nMunicipal Office Buildings.<br /><br />\nSouth on Gay Street to Pratt, thence east to Albermarle. On<br />\nthe northwest corner is the ''Flag House,\" where Mrs. Mary<br />\nPickersgill made the flag which floated triumphantly over<br />\nFort McHenry throughout its bombardment in 1814, This<br />\nflag is preserved in the Smithsonian Institute at Washington.<br /><br />\nNorth on Albemarle Street to Lombard, thence to Front<br />\nStreet to the house where Charles Carroll of Carrollton died.<br />\nThe city has been using the building as a vocational school.<br />\nThis section today is not very inviting, but it is a part of old<br />\nBaltimore Town and once contained the residences of its best<br />\ncitizens.<br /><br />\nHere's hoping your stay in Baltimore will be a happy one.<br />\nhome about some of your pleasant experiences in our city.<br /><br />\nit, Baltimore cuisine is outstanding .<br /><br />\nWest on Lombard Street to Light, thence south to Key High-<br />\nway, thence to Fort Avenue and Fort McHenry. The old fort<br /><br />\n. dates from 1777, but was not used in the Revolutionary War.<br /><br />\nIt was constructed originally by the citizens of Baltimore at<br />\ntheir own expense. Later it was presented to the Federal<br />\nGovernment and the Star Fort built in its center. The Govern-<br />\nment appropriated only $20,000 for this, the people of<br />\nBaltimore paying the balance. The fort defeated the British<br />\nfleet on September 13-14, 1814, said defeat causing the<br />\nBritish Government to make peace soon afterward. The fort,<br />\nwhich contains statues of Col. George Armistead, its defender;<br />\nFrancis Scott Key, who wrote the National Anthem while<br />\ndetained on a British ship during the bombardment, and a<br />\nshaft to the privateersmen, was dedicated on Septem‘)er 12,<br />\n1928, as a National Shrine. The old fort has been restored to<br />\nits appearance in 1814, The Star Fort, magazine, dungeons,<br />\ncannon ball storage mounds, batteries, officers’ quarters and<br />\nother buildings are of exceptional interest.<br /><br />\nMunicipal Tour Three<br /><br />\nTour of Baltimore's Public Park System<br /><br />\nStarting from Memorial Plaza east of the City Hall. East on<br />\nFayette Street to Fallsway, south to Baltimore, east to Eden<br />\nStreet. South on Eden gtreet to Gough the course will pass<br />\nCity Springs Square in the most thickly populated section of<br />\nthe city. East on Gough to Patterson Park, the city's first<br />\nPublic Park of consequence with its many historical associa-<br />\ntions.<br /><br />\nWesterly on Baltimore Street from Patterson Park to Broad-<br />\nway and thence north apast the Johns Hopkins Hospital to<br />\nNorth Avenue and eastwardly to Washington Street and into<br />\nClifton Park, one time the home of the celebrated Johns<br />\nHopkins.<br /><br />\nLeaving Clifton Park by way of the Alameda to 33rd Street<br />\nand westerly to Venable Park and the Baltimore Stadium.<br />\nContinuing westerly to University Parkway and thence north-<br />\nwest to the entrance into W yman Park in the vicinity of 39th<br />\nStreet and south through W yman Park to the Marine Hospital<br />\nand westerly into Druid Hill Park, world famous for its natural<br />\nbeauties.<br /><br />\nLeaving Druid Hill Park by way of Mondawmin Avenue out<br />\nthe Gwynn's Falls Parkway to the Windsor Mill Road to the<br />\nFranklintown Road and thence south through Gwynn's Falls<br />\nPark to the Ellicott Driveway and thence continuing by way<br />\nof Brunswick Street, Wilkens Avenue and Monroe Street into<br />\nCarnroll Park to the historical museum maintained by the<br />\nDaughters of the American Revolution and where the most<br />\nmodern playground facilities may be seen.<br /><br />\nLeaving Carroll Park by way of Bayard Street to Hamburg<br />\nand following easterly on Hamburg to Battery Avenue will<br />\nbring the party to the celebrated Federal Hill Park overlook-<br />\ning the Baltimore Harbor.<br /><br />\nSouth from Federal Hill Park on Battery Avenue to Riverside<br />\nPark with its modern swimming pool facilities and thence<br /><br />\nThis folder is a miniature “guide book.” It will tell you where to go and how to go. See Baltimore and<br />\nyou will see portrayed the history of our country, through important shrines and beautiful memorials.<br />\nYou will see, too, a city where people enjoy 312 days of sunshine a year. Not a land of enchantment<br />\nwith make-believe joys and bizarre thrills. Baltimore is real . . . it's human . . . it's genuine. It has<br />\ncharacter, friendliness and an appreciation of living.<br /><br /><br /><br />\nwest on Randall Street to Hanover and south on Hanover<br />\nacross the bridge to Broening Park where refreshments may<br /><br />\nbe had at the Maryland Yacht Club.<br />\nMunicipal Tour Four<br /><br />\nGreen Spring Valley--Loch Raven Tour<br /><br />\nSee the picturesque country-side surrounding Baltimore.<br />\nEnjoy the scenic beauties of this charming rolling country in<br />\na memorable two-hour tour.<br /><br />\nStart at Belvedere Avenue and Park Heights Avenue. Con-<br />\ntinue along Park Heights Avenue past the Maryland Country<br />\nClub. Turn left on Slade Avenue past Suburban Club. Turn<br />\nright on Reisterstown Road, past Woodholme Country Club.<br />\nTurn right at Tobin Station on Valley Road, past Green Spring<br />\nValley Hunt Club. Turn left at Stevenson. Continue on Valley<br />\nRoad past Maryland Polo Club and Brooklandwood Farm,<br />\nscene of the nationally famous point-to-point race. Turn left<br />\non Falls Road. Turn right on Seminary Avenue, through<br />\nLutherville past Maryland College for Women. Turn left at<br />\nYork Road past Timonium, scene of Maryland State tair. Turn<br />\nright at Warren Road. Tu-n right at Sunnybrook on Jarrets-<br />\nville Road. Sharp left U turn to Dulaney Valley to Loch<br />\nRaven Road, to Loch Raven Bridge past impressive Loch<br />\nRaven Dam. Continue to Cromwell Bridge to Joppa Road.<br />\nTurn left at Charles Street Avenue, past Elkridge Kennels. On<br />\nthe left, see Homeland, impressive residential section of<br />\nBaltimore. Continue on Charles Street to Mt. Vernon Place,<br />\none of the most beautiful public squares in the country.<br /><br />\nPORT OF BALTIMORE<br />\nAs viewed from historic Federal Hill Park<br /><br />\nFrom this picturesque hilltop can be seen the city’s growing<br />\nskyline, while spread out below is Baltimore's international<br />\nport, which handles shipping from the Seven Seas and con-<br />\nducts business with all important harbors of the United States<br />\nand foreign countries. This port handles a yearly business<br />\nof 15,000,000 tons of cargo, valued at $750,000,000.<br /><br />\nFifty-four steamship services operate direct from Baltimore.<br /><br />\nSoutheast across the harbor is Fort McHenry, birthplace of<br />\nthe “‘Star-Spangled Banner'. In the distance is historic Fort<br />\nCarroll.<br /><br />\nThe harbor view includes the four great marine terminals of<br />\nthe Baltimore and Ohio Railroad, the Pennsylvania Railroad,<br />\nthe Western Maryland Railway and the Canton Company,<br />\nwith 38 deepwater ocean piers. In the Middle Branch section<br />\nis the new $8,500,000 marine terminal constructed by the<br />\ncity of Baltimore and operated by the Western Maryland<br />\nRailway. Modern shipbuilding and repair yards are scattered<br />\nalong the shore line. Great waterfront industrial plants in the<br />\nbusiness of steel, sugar, petroleum, copper, tin, spices, chemi-<br />\ncals, fertilizers, canning, airplane manufacturing, and many<br />\nother lines give testimony to the importance of Baltimore as a<br /><br />\nseaboard manufacturing center, and the seventh industrial city<br /><br />\nof the United States.<br /><br />\nJacksz;<br /><br />\nMain ship channels and all channels leading to the ocean<br /><br />\n_ piers of the marine terminals have a controlling depth of 35<br /><br />\ne Aificrd 1red<br />\nDeacidified using the<br /><br />\nS<br /><br /><br /><br /><br />\nNeutralizing Agent: i ;<br />\nTreatment %aié: Y fl\\/l7ne31um UGS<br />\n| /<br />\nDODEKKEEPER<br /><br />\n: e e,<br />\nPRESERVATION TECHNOLOGIES, Lp,<br /><br />\nfeet at mean low water.<br /><br />\nThe Baltimore Association of Commerce will supply the visi-<br />\ntor with complete data on the Port of Baltimore, the second<br />\nforeign trade tonnage port on the Atlantic Coast.<br /><br />\nMake Baltimore<br /><br />\nYour Tour-quarters<br /><br />\nThe territory surrounding Baltimore is rich in historic interest<br />\nand nature's beauties. Make Baltimore your headquarters and<br />\narrange daily trips that will live in your memory through the<br />\nyears.<br /><br />\nSee quaint Annapolis, one of the most charming Colonial<br />\ntowns in the United States.<br /><br />\nSee Gettysburg Battlefield, one of the world's most important<br />\nbattlefields.<br /><br />\nSee Mount Vernon, home and burial place of George Wash-<br />\nington and his wife.<br /><br />\nSee Washington, the nation's capital.<br />\nSee Frederick, the home of Barbara Fritchie.<br /><br />\nSee Southern Maryland where the first Maryland Colonists<br /><br />\nsettled.<br /><br />\nSee the Eastern Shore of Maryland, a beautiful territory with<br /><br />\nlarge estates and stately Colonial mansions.<br /><br />\nSee Ocean City, Maryland's famous seashore. And bathe in<br /><br />\nthe Atlantic Ocean.<br /><br /><br /><br />\nAnd see, too, many other places you have read about on the<br /><br />\npages of history.<br /><br />\nBookkeeper process.<br /><br />\n111 Thomson Park Drive<br />\nCranberry Township, PA 16066<br /><br />\n(724) 779-2111<br /><br /><br /><br />"}], "field_media_file": [{"target_id": 52610, "display": null, "description": null, "target_type": "file", "target_uuid": "bf20bac9-ab3e-4b23-98c6-b8d4303e22dc", "url": "http://digital.library.jhu.edu/system/files/2022-03/16724-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16724, "target_type": "node", "target_uuid": "8e8a6f70-a3b6-4e7d-b098-ab2a0be39d4a", "url": "/node/16724"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "804ab0fe-adc1-45ec-9308-e6a297df82f7"}]}