{"mid": [{"value": 38205}], "uuid": [{"value": "58980a25-455d-4b05-b251-479f72a33191"}], "vid": [{"value": 38205}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12774-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "READ<br />\n\"The Phi Bete Case\"<br />\npage 2<br />\n<br />\n3104tts iqopking ,Nrius-Cittrr<br />\n<br />\nSENIORS<br />\nPay Your June Week Fee<br />\nBefore April 15th<br />\n<br />\n!tic<br />\nrd-<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 6, 1937.<br />\n<br />\nVOL. XLI, No. 32<br />\n<br />\nPRICE 5 CEN'I'11<br />\n<br />\nthe<br />\nere<br />\nred<br />\nere<br />\n<br />\nSHILS, ASU HEAD, REJECTED FOR PHI BETE<br />\n•<br />\n<br />\n:elold<br />\njor<br />\nby<br />\n'he<br />\nlb.<br />\n<br />\nFour-Fifths of<br />\nStudents Favor<br />\nAssembly Plan<br />\n<br />\n,tz,<br />\nhn<br />\nryer)ss<br />\n<br />\nOverhelming Majority Vote<br />\nSpeakers, And Ten<br />\nDollar Fee<br />\n307 CAST BALLOTS<br />\nStatus Quo Apparently Supported; 1 Grad Student<br />\nVotes<br />\n<br />\np.<br />\n<br />\nci<br />\n<br />\nI.<br />\n<br />\n1<br />\n<br />\nC<br />\n<br />\nCCNY Nearly Mars Phi Sig, Phi Alpha Stood<br />\nJay Stick Debut Latest To Join<br />\n14<br />\nWith Early Scores Strike Committee<br />\n<br />\n'Hullabaloo' Bills<br />\nDue Says Austrian<br />\nRobert Austrian, editor of the<br />\nHullabaloo, announced today that<br />\nall Fraternity, Senior's and Sports'<br />\nbills due must be paid by the end<br />\nof the week, as the book is going<br />\nto press before May 1.<br />\nThe bills may be paid to Henry<br />\nKramer, business manager of the<br />\nHullabaloo, between 12 and 1 in<br />\nthe Hullabaloo office any day now.<br />\n\"Prompt payment by these<br />\ngroups for space will make possible price discounts, which will<br />\nresult in a larger and better year<br />\nbook,\" said Kramer.<br />\n<br />\nSeventh In Class;<br />\nUndergraduates Make<br />\nScholarship Fraternity<br />\n<br />\nRoll Of Committee Members<br />\nSwelled To Twelve<br />\nRejected Undergrad Receives Necessary Two Blackballs;<br />\nBy Additions<br />\nNo Discussion Of Case At Meeting<br />\nProgram Now Includes AsAccording To Chapter Officers<br />\nUnexpectedly Strong Gotham<br />\nsembly And 'News-LetClub Scores First<br />\nOfficers For Next Year I Academic Attainment, Good<br />\nter' Campaign<br />\nTwo Counters<br />\nChosen; Alumnus Honored<br />\nMoral Character QualifiWith decision of Phi Sigma Delta<br />\nBy<br />\nMembership<br />\ncations For Election<br />\nAt approximately 3.20 P. M. Sat- and Phi Alpha social fraternities to<br />\nHome Squad Shows Good<br />\nForm In Running Up<br />\n13.3 Tally<br />\n<br />\nurday last, several hundred spectators scattered about the Homewood<br />\nstands had the uncomfortable sensation of sitting in on history in the<br />\nraw. Which goes to show that you<br />\nnever can tell where destiny will intrude her dirty digit.<br />\n<br />\nadd representatives to the committee, the total number of organiza-<br />\n<br />\nThirty-one Johns Hopkins men<br />\nMaurice Shils, seventh-ranking stuwere elected to the local Chapter of dent in his class and chairman<br />\nof the<br />\ntions represented in the coming StuPhi Beta Kappa fraternity, at the American Student Union,<br />\nwas<br />\nreFour-fifths of the Johns Hopkins<br />\ndent Strike Against War next April<br />\nannual business meeting of the frat- jected for Phi Beta Kappa<br />\nat<br />\nstudents favor \"any type of assemthe<br />\nan22nd, had swelled to 12, it was anernity Friday evening, April 2. nual business meeting of<br />\nbly,\" particularly voluntary ones, prethe society's<br />\nnounced after a meeting of the group<br />\nFourteen<br />\nfer speakers twice a month at them<br />\nunder-graduates, eleven Hopkins chapter, Friday, April 2.<br />\nThe occasion for her latest mad at noon yesterday.<br />\nand will pay $10 a piece for June<br />\nSeventy-Two Awarded Fel- prank was the 1937 debut of a highly- At the same time Milton Brotman, graduate students in Philosophy, Fourteen undergraduates were electWeek tickets. Such, in essence, is the<br />\n..<br />\nthree graduate students in Medicine, ed to the society.<br />\ntouted Jay lacrosse team, with its secretary of the committee, issued a<br />\nlowships And Grants In<br />\nresult of the questionnaire conducted<br />\none<br />\nalumnus,<br />\nand two members of the<br />\nShils, who had been nominated<br />\nline-up packed to the eyeballs with<br />\nby the Student Council last week.<br />\ncall for larger representation. Other<br />\nHigher School<br />\nacademic staff make up the list.<br />\nlettermen. The principals were said<br />\nunanimously<br />\nby the executive comThree hundred and seven ballots<br />\nrepresentatives of the great tradition organizations now active in the<br />\nTheir names follow:<br />\nmittee of the society, received two<br />\nwere turned in; 91 from freshmen,<br />\nThe folowing graduate fellowships<br />\nand another group—allegedly ripe strike are the Hullabaloo, the Debat80 from sophomores, 75 from juniors and scholarships have been<br />\nCollegiate Students<br />\nblackballs, the exact number necesawarded for the chopping-block — from the ing Council, the Student Activities<br />\nand 50 from seniors, 1 from a gradRobert Austrian, William Diamond, sary to keep him out.<br />\nfor next year, announced Dr. W. Stull City College of New York. As a con- Committee,<br />\nAbout twenty<br />\nPhi Epsilon Pi, Omicron<br />\nuate student, and 10 unaffiliated.<br />\nWilliam Ambach Eichengreen, Don- members of Phi Beta<br />\ntest, the railbirds looked upon this<br />\nKappa attendTwo hundred and thirty-nine de- Holt, associate professor of history<br />\nDelta Kappa, the Hopkins branch of<br />\nald Eugene Emerson, Harold Free- ed the meeting.<br />\nbill of fare in the same light as a<br />\nclared in the affirmative to the ques- and chairman of the Graduate Scholfree-for-all between Joe Louis and the Y. M. C. A., the American Stu- man, Sidney Richard Gladstein, HarShils is also a member of the Remtion: \"Do you favor an assembly of arship Committee yesterday:<br />\ndent Union, the Young Communist<br />\nJackie Cooper.<br />\nold Murray Goldstein, Joseph Elliott sen Chemical Society, a<br />\nGraduate Fellowships<br />\nany type?\"; 38 replied in the negaformer memWell, the affair started off in an League and the NEWS-LETTER.<br />\ntive; 7 answers were undecided.<br />\nBruce Fellowship in Zoology—LanGreen, Jr., John Simon Kasper, ber of the Hullabaloo staff,<br />\nand the<br />\northodox enough fashion. Hammer<br />\n\"Of course,\" said Brotman, \"this<br />\nThere was one \"ghost vote.\"<br />\ndum Shettles.<br />\nFloyd Katske, Anthony Walter Kraus, recipient of freshmen<br />\nnumerals<br />\nfor<br />\nHimes<br />\npassed<br />\nout<br />\nto<br />\nJack<br />\nKaufman,<br />\nis a catholic enough representation.<br />\n213 For Assemblies<br />\nJr., Sidney Hyman Levy, John Hor- swimming.<br />\nBuchner Scholarship in Education who advanced to the shooting circle.<br />\nVoluntary assemblies are guaranNevertheless there are many imThe panic was on.<br />\nThis is the first time within his<br />\nportant campus groups which have ace Masopust, Bernard Doave Pinck.<br />\nteed an attendance of 213 students, ----Beulah I. Benton.<br />\nDuPont Fellowship in Chemistry—<br />\nGraduate Students In Philosophy<br />\nAt this juncture, Fate picked up not signified their intention of joinwhile 31 flatly refuse to attend them,<br />\nmemory, which goes back \"a good<br />\nthe C. C. N. Y. boys and whisked ing the committee.\"<br />\nand 43 will with reservations. As to S. R. Buc.<br />\nRobert Gaston Deupree, Sally Cary many years,\" said Dr. John C. French,<br />\nChief point for discussion at yes- Fairfax Harrison, John Hall<br />\nthe nature of the assembly, 215 favorMarshall Elliott Scholarship in Ro- them off for a miracle ride, which<br />\nHopkins, librarian of the University and Phi<br />\nleft Jay rooters cold, but which terday's meeting was the projected<br />\ned speakers (an added notation was<br />\nmance Languages for 1936-37—A. E.<br />\nWilliam Randolph Kanne, Alfred Lee Beta Kappa historian, that an underbrought joy to the hearts of visitors peace education campaign during<br />\nusually \"good ones\") while the next<br />\ngraduate nominee has been blackfrom Maryland, St. John's, Mt. Wash- the three weeks left before the Sklar, Charles Francis Squire, Daniel balled. Shils was not discussed bein order of preference was a program Croere.<br />\nGildersleeve Fellowship in Greek-- ington, and other local points of in- strike. 'Whether the campaign will Richard Stull, Winston Da.nae Wal- for the balloting took<br />\ndevoted to \"awards, fraternity tap<br />\nplace, so that<br />\nterest.<br />\ndays, musical performances, etc.\" John D. MeDarmid.<br />\nemphasize the abstract perils of war ters, Earl Reeves Wasserman, Mil- no reason for the action was stated<br />\nIt all began when Norm Melvin or point out the concrete \"hot-spots\" dred Georgia West, George<br />\nFifty-four wanted this, while scattered<br />\nGlaffin Scholarship in Chemistry—<br />\nErnest at the meeting, according to Dr.<br />\nmanifested overmuch enthusiasm on of the present world situation reballoters came out for informal dis- Darnell V. Sickman.<br />\nFrench.<br />\nWright.<br />\ncussions, songs and yells, and variety.<br />\nHarcum Scholarship in Archaeol- the person of a New York defense mained an unsettled question at the<br />\nUndergTads Eligible<br />\nGraduate Students In Medicine<br />\nman. Willie the Jay out home was close of the meeting.<br />\nUndergraduates eligible for memConsidered very significant was the ogy—Eleanor Swallow.<br />\nHenry Frederic Helmholz, Jr., Jos- bership in Phi Beta<br />\nA tentative plan of attack for preHunting Scholarship in Political meditating his crimes on the mournfact that 60% of the ballots<br />\nKappa, as stated<br />\ners' bench, Hal Kaufman, an attack strike program was released how- eph Leo Lilenthal, Jr., Francis Joseph in the chapter constitution, must<br />\nfavored assemblies twice a month. Science—Harold F. Sylvester.<br />\nbe<br />\nPeabody Fellowship in Semetics— man hitherto unknown to fame, ever. Its basic points include:<br />\n\"candidates for the degree of bachThat has been the system during the<br />\nOtenasek.<br />\nturned a nice pass to good account;<br />\n1. An assembly featuring discuselor of arts.\" and \"distinguished for<br />\ngreater part of this year, succeding Abraham Sachs.<br />\nAlumnus<br />\nsion of the peace question, with emRogers<br />\nFellowship<br />\nin Latin—J. E. and C. C. N. Y. was out in front.<br />\nacademic attainment.\" Prof. Hazthe former regime of weekly, compulGuy Everett Snavely.<br />\nAs if that weren't enough, while phasis on two opposing schools of<br />\nleton Spencer, of the department of<br />\nsory ones. Sixty-eight, however, de- A. Crake.<br />\nMembers Of Academic Staff<br />\nScott Scholarship iun Greek—Rich- Melvin was spending another peni- foreign policy—those of collective<br />\nEnglish, and secretary of Phi Beta<br />\nsire them once a week and 40, a sintent moment among the spectators, security and isolationist neutrality.<br />\nRobert Dudley Fowler, James Kappa, stated that the two requireard Suffern.<br />\ngle assembly once a month.<br />\n2. An active editorial and educa- Franck.<br />\nStack Scholarship—Henry C. Smith co-captain Gottfried shot a pass to<br />\nments for admission were scholarConformity to existing conditions<br />\nfirst-attack George Lenchner. And, tional campaigns on the part of the<br />\nwas further endowed by overwhelm- (Psychology).<br />\nOf the members of the faculty ship and good moral character. Eli(Continued on page 4, column 3)<br />\nNEWS-LETTER.<br />\nVogeler Fellowship in Archaeology<br />\nnewly elected<br />\ning approval given June Week and<br />\nProfessor James gible undegraduates are awarded the<br />\nFranck has been associated with the key in the following manner prethe price of $10 for the latter party. —William McDonald.<br />\nGraduate Scholarships<br />\nOut of 305 voting on the query \"Are<br />\nPhysics Department since 1935. Dr. scribed by the chapter constitution:<br />\n1. A subcommittee of the executive<br />\nyou in favor of a June Week?\" Archaeology:<br />\nRobert D. Fowler, of the Department<br />\nJohn A. Alexander.<br />\nonly 44 failed to write \"Yes.\" Conof Chemistry, joined the faculty last committee—the committee on underCharles H. Reeves.<br />\nsiderably less interest was shown<br />\nyear. Dr. Guy E. Snavely, the only graduate investigation- -selects a reaconcerning the fee, but from 166 Botany:<br />\nHopkins alumnus elected to the local sonable number of those students who<br />\nRex. M. Webster.<br />\nvoting 144 declared that $10 was<br />\nchapter this year, is President of Bir- have led their class scholastically.<br />\nChemistry:<br />\nthe top price.<br />\n'News-Letter' Reporter Finds Biology Faculty Busy Discov- mingham-Southern College, and took The basis for selection is entirely<br />\nJ. P. English, Paul Vichl, C. E.<br />\nSpeaking for the Student Council,<br />\nhis A.B. at the Johns Hopkins in scholarship.<br />\nering Causes Of Population Decline<br />\nDonald Emerson, secretary, said, Messer, J. J. Mitchell, R. G. Shepherd,<br />\n1901; his Ph.D. in 1908.<br />\nCommittee Review<br />\n\"Serious interest was shown by prac- B. L. Ritz, B. Phillips, Irene Stark,<br />\n2. The executive committee reviews<br />\nIn Flour Beetle<br />\nAlumni members of the fraternity<br />\ntically all of those who voted on this J. F. Baxter, B. Witten.<br />\nare chosen on the basis of special the names presented it by the subBy MORRIS A. VVESSEL<br />\nquestionnaire. The response was as Education:<br />\ncal of certain other insects. It goes distinction after graduation. Colleg- committee and, in general unanimousHarriet Wells.<br />\nWhy do populations increase and through a life cycle of egg, larval, iate and graduate students are elect- ly accepts the nominations, unless a<br />\ngratifying as could be expected, when<br />\ndecline? What are the biological pupal and adult stages. The time ed to Phi Beta Kappa at the Johns candidate is known not to fulfill the<br />\nyou see how many questions were English:<br />\nRowland Evans, Albert Murphee, phenomena which are responsible for necessary for the development of the Hopkins during the final year of their character requirements. The comasked. The response to the Honor<br />\nWlolfinger, Orville Linck, these changes in population? What adult from the egg has been found study.<br />\nSystem ones are being studied and Joseph<br />\nmittee is charged with recommendcauses long and short life?<br />\ntabulated. They are of diversified George Sanderein, Varley Lang.<br />\nAre to vary considerably with regard to<br />\nNewly elected members to the ing those who \"in their judgment<br />\nGeology:<br />\nthere any inherited factors in these environmental conditions, such as oldest Greek letter fraternity—found- ought to be elected to Phi Beta<br />\ncontent.\"<br />\nE. Chondonette Norris, Marjorie problems? These are the problems temperature, nutrition and humidity. ed at William and Mary College in Kappa\" and to present at the annual<br />\nWoodberry.<br />\nin which the Department of Biology About fifty days is the time neces- 1776—will be initiated on April 30, meeting the names of those whom<br />\nGerman:<br />\nof the Johns Hopkins School of Hy.. sary for an egg to develop into an at the new Johns Hopkins Club on they consider worthy of this honor.<br />\nRalph Collins, Walter Ade.<br />\ngiene and Public Health, located at adult, under conditions consisting of on the Homewood campus. The an3. The 1000 or so members of the<br />\nGreek:<br />\nWolfe and Madison Streets, are pri- a white flour culture, fifty per cent nual dinner of the chapter will be held Hopkins chapter are invited to attend<br />\nDonald Doakkey.<br />\nmarily interested.<br />\nhumidity and twenty-seven degrees the same evening, with Professor Leo the annual meeting. Usually, Dr.<br />\n\"British<br />\nCorporation<br />\nFinance\"<br />\nHistory:<br />\nThis article will be devoted to the Centergrade. The adult life lasts for Wlolman of Columbia University as French said, about twenty show up.<br />\nShows Research In<br />\nFranklin Spiker, Frederick Hay- work being done by Dr. Thomas a year and a half, or often longer.<br />\nBallOting is anonymous, and two<br />\nguest speaker.<br />\nPreference Shares<br />\n(Continued on page 3, column 2)<br />\nPark, Associate in Biology, and Mr.<br />\nOfficers of the chapter for 1937- blackballs are sufficient to reject a<br />\nB. A. Schneider, graduate student in<br />\nConditioning<br />\n38 were elected as follows: Dr. Lewis nominee. Normally the chapter acThe Johns Hopkins University<br />\nBiology, who are now studying the<br />\nIt has been known for many years H. Weed, president; Dr. George H. cepts the judgment of the executive<br />\nPress has recently issued a study of Fireside Discussion To Have<br />\nphysiological aspects of the growth that when organisms are kept in the Barnett, vice-president; Dr. George H. committee. Dr. Spencer explained.<br />\nearly preference shares by Dr. G. E.<br />\nShaffer<br />\nAs<br />\nLeader<br />\nand decline of population in labora- same culture medium for some time, Evans, Jr., secretary; and Dr. RichTomorrow<br />\n(Continued on page 3, column 1)<br />\nEvans, Jr., of the Political Economy<br />\ntory controlled cultures of the com- this medium is \"conditioned.\" In ard M. Haywood, treasurer.<br />\nDepartmen. \"British<br />\nCorporation<br />\nDr. G. Wilson Shaffer, Director of mon flour beetle Tribolium confusum. some cases this conditioning favorFinance 1775-1850, A Study of Pref- Athletics<br />\nDr. Notestein To Speak<br />\nat the Hopkins, will be the<br />\nably influences the growth of populaerence Shares,\" is the culmination of leader<br />\n\"Y\" Nominates Four<br />\nat the Fireside Discussion<br />\nFlour Pest<br />\nToday At Hygiene School<br />\ntion, and in other cases it causes a<br />\nDr. Evans' research in England re- group<br />\ntomorrow afternoon at 4.15<br />\nThis beetle is found in flour sup- decline of population. In the case<br />\nFor<br />\nOffice<br />\nPresident<br />\nOf<br />\ngarding the stock issues of industrial p.m. In<br />\nLevering Hall. The topic to ply houses and does considerable dam- of this beetle, conditioning causes a<br />\nDr. Frank W. Notestein, lecturer<br />\ncompanies during the Industrial be discussed<br />\nis the \"Relation of Rec- age to stored flour, and for many decrease in population, in fact, in<br />\nLawrence Hanawalt, H. H. Lloyd, at the School of Public and InternaRevolution.<br />\nreation to Mental Health.\" Dr. Shaf- years has been carefully studied by time, causes a virtual extinction of Otto Philips and Charles Swartz were tional Affairs at Princeton UniverThe<br />\nauthor's<br />\nprevious<br />\nwork fer, who received his<br />\ndoctorate in the United States Department of the organism. It is the cause of this nominated for president of the Hop- sity, will be the DeLamar lecturer at<br />\non stock financing and preference phychology, is part<br />\nauthor of sev- Agriculture in an attempt to devise population decline that Dr. Park has kins \"Y\" at a meeting of the nomi- the School of Hygiene this afternoon<br />\nstock had been in regard to American eral texts on the<br />\nsubject.<br />\na method of controlling its devas- been especially interested in.<br />\nnating committee held last week. at 5 P.M. He will speak on \"Differcompanies. To fully understand this<br />\nLists have been posted in Levering tating activity. It is easly cultivated<br />\nOther nominations included: for sec- ences in the Fertility of Important<br />\nDr. Evans found it necessary to in- Hall and at<br />\nthe post office bulletin In the laboratory, since all the necesretary, Robert Bauer and Hammond Classes of Population.\" The lecture<br />\nDevour Eggs<br />\nvestigate British finances and stocks, boards, and students<br />\nare asked to sary equipment consists of containers<br />\nOne of the extraordinary features Brown; and for treasurer, Henry will be held in the auditorium of<br />\nmany types of which were taken over sign up immediately.<br />\nThe group is and flour of a standard consistency.<br />\nthe School of Hygiene, on Wolfe<br />\nof Tribolium is the fact that the adult Blucher and Boyd Frey.<br />\nby early American companies.<br />\nlimited to 20 students.<br />\nThe beetle has the life history typiElections will be held on Monday, Street.<br />\n(Continued on Page 3, Co1.2)<br />\n<br />\nHolt Announces<br />\nGrad Scholarships<br />\n<br />\nPopulation Growth and Decline<br />\nStudied At School of Hygiene<br />\n<br />\nPress Issues Evans<br />\nStock Shares Study<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 6, 1937<br />\n<br />\n2<br />\n<br />\nOlje 3obn5 ji)optlins<br />\n<br />\nImportant Medical Problem<br />\nImportant problems today face the whole medical<br />\nprofessions and students aspiring to enter that field.<br />\nThe students on the one hand ask themselves \"Just<br />\nwhat, scholastically and otherwise, is required of a pre-<br />\n<br />\nOn The Literary Horizon<br />\n<br />\n23rd Psalm<br />\nStudent's Style<br />\n<br />\nthe tongues of the district, and, dazed<br />\nIn the \"Journal of Social Philoso- and uncomprehending, are tried and<br />\nfound guilty. To her guilt is given<br />\nmedical school?\" This question is asked anxiously, for phy\" for January of this year, there<br />\nthe added weight of her nationality.<br />\nprospects of acceptance at any medical school are far appeared an estimate of the popu... $2.00<br />\n1.<br />\nSubscription per<br />\nMr. Hilton is an author supremely<br />\nlar book, \"Man the Unknown,\" by<br />\n$2.50<br />\nfrom bright for the average student.<br />\nBy Mail<br />\nAlexis Carrel, doubly interesting be- adapted to such a story. His ability<br />\nThe doctors of today voice the queries \"Are the best<br />\nActivities Council,<br />\nRemit subscription fees to Treasurer, Student<br />\nof its merit and its authorship. to portray a retiring, sincere person,<br />\ncause<br />\nUniversity.<br />\nmen being taken into medical schools?\" and \"Are the<br />\nRemsen Hall, Postotlice, Johns Hopkins<br />\nThe article was written by Dr. H. with complete sympathy, and to avoid<br />\npre-medical and medical school curricula so arranged as<br />\nS.<br />\nJennings, Henry Walters Profes- the extremes both of ridicule and 2.<br />\nPostollice<br />\nthe<br />\nat<br />\n1909,<br />\nto develop the best possible doctors?\"<br />\nEntered as second class matter December 3,<br />\nNovember 3, 1579.<br />\nCongress,<br />\nof<br />\nAct<br />\nof Zoology at the Johns Hopkins sentimentality, is equalled by few<br />\nsor<br />\nthe<br />\nunder<br />\nMd.,<br />\nnaltimore,<br />\nin<br />\nIn an article in the New York Times Magazine of<br />\nUniversity, and presents another authors of this or any day. The<br />\nexcept during exam- April 4, entitled \"The Doctors Diagnose Their Own viewpoint on the best-seller of popu- harshest notes in his book, of which<br />\nPublished semi-weekly from October to June,<br />\nuudeigraduates of the Johns Case\" it is stated that there are many faults to find with<br />\nby<br />\nperiods<br />\nholiday<br />\ncollege<br />\nand<br />\nination<br />\nlar biology. The article is entitled there are quite a few, are very quiet 3.<br />\nHopkins University.<br />\nthe young medical school graduate of today. The<br />\n\"Biology and Social Reform,\" and ones---almost as thought he apoloauthor, Esther Everett Lape, states:<br />\ncomprises an authoritative and care- gised to his characters. In this book,<br />\nEDITORIAL STAFF<br />\n-Chief<br />\nEditor-in<br />\nview<br />\nthe<br />\ndoctors<br />\nfor<br />\n-- .-___. .<br />\nsolid<br />\n\"There<br />\nis<br />\namong<br />\nsupport<br />\n-fully<br />\ndocumented series of questions, the two main characters may be said<br />\n__<br />\n—<br />\n.<br />\nFinkel<br />\nStanley<br />\nEditors<br />\n_<br />\nJames Morrow, David Caplan<br />\nraised by the fundamental premise to live, but only as if in memory of<br />\nmedical<br />\nis<br />\nbetter<br />\nmedicine<br />\nto<br />\nEditor<br />\nroad<br />\nbetter<br />\nmain<br />\nthe<br />\nthat<br />\nSports<br />\n—________<br />\n_ ...______._.— —<br />\nBernard D. Pluck .<br />\nJr..----_Arriststst Mangaing Editors education (the notable advances of the two decades are of the book—that through the Sci- an old man.<br />\nBenjamin Rout, Wethered Barron,<br />\nThey are both common<br />\nAssistant Sport: Editor<br />\nences of Life we may arrive at better<br />\n4.<br />\n. .. .. _ ..— —<br />\nHarold Zheutlin<br />\n—Columnist<br />\ninto<br />\nmedimen<br />\ngetting<br />\nright<br />\nthat<br />\nand<br />\nduly<br />\nrecognized)<br />\nenough<br />\ntypes<br />\nas fictional characters<br />\nlaws for human conduct and relaPaul Berge ._________—______—<br />\nGoldsmith,<br />\nJewett<br />\nFinkelstein,<br />\ncal schools is an even sharper problem than balancing tions. The arguments are clearly pre- go, and yet they retain perhaps more<br />\nReporters—Max Iskowitz, Nathaniel<br />\nLeonard Rubinger,<br />\nHoward Reizenstein, Julian Adler, Carl Resin,<br />\nRosenthal,<br />\nLester<br />\nthe curriculum.\"<br />\nsented, and sound, to a layman, well- Individuality than the great individKrieger,<br />\nMorris Wessel, Arthur Katz, Martin<br />\nDiggs, William BurMurray Kempton, Victor Victoroff, Charles<br />\nThe question of what is wrong with our present sys- chosen. Anyone who has jointed the ual of the book, the wife, Jessica.<br />\nArnold Glantz, Joe<br />\nford, J. C. Handelsman, Mal Boshnack,<br />\ngroii pof thinkers which sets this<br />\nAlperstein,<br />\nMilton<br />\nMillberg,<br />\nIrving<br />\nAnd yet, despite all this, there is 5.<br />\nSacks,<br />\nSamovar, Seymore<br />\ntem of medical education is quite aptly answered by anbok up as a theme, should make it a a little<br />\nBaum.<br />\nZenas<br />\nstretching of the credulity.<br />\nother quotation from the same article.<br />\npoint to read the commentary of Dr. There are a few<br />\nBUSINESS STAFF<br />\nspots where the<br />\nManager<br />\nBusiness<br />\n__<br />\n\"Few medical men would want to return to the old- Jennings.<br />\nWilliam 13. Kempton______L_______<br />\nreader is asked to accept something<br />\nBusiness Manager<br />\nnt<br />\n______—_—____—_Assista<br />\nMelville Locker<br />\nas altogether natural and right,<br />\nAdvertising Manager time medical education; many, however, are dubious of<br />\nMR. HILTON AGAIN<br />\nWm. C. Erlanger____________<br />\nCirculation Manager<br />\n___<br />\n_________<br />\nthe young \"super-scientist\" which the modern system<br />\nThe past weeks saw the publica- which jarrs, even if softly, upon his<br />\nGerald Willen<br />\nManager<br />\nOffice<br />\n---Howard Linkoff ....._ .___________ __ _<br />\nout. It is not certainly, that tion of another book by James Hil- feeling of probability and continuity. 6.<br />\nCopy and Filing Manager tends they think, to turn<br />\nNathaniel Soifer _____________<br />\nthe young graduate of the present has too much science ton, which coincided almost exactly Also, in sustaining the soft touch, it<br />\n--but rather that he has not acquired enough science to with the general release of the photo- has become in some spots almost<br />\nADVERTISING SY<br />\n........TED FOR NATIONAL<br />\ngive him the integrating power that will make his sec- play from his earlier work, \"Lost too light, and the writing lacks depth<br />\nService, Inc.<br />\nNational Advertising<br />\ntional information effective. Too often, some medical Horizon.\" The new novel, \"We Are in a number of passages, particularly<br />\nCollege Publishers Represestatiae<br />\nNEW YORK. N.Y.<br />\nfeel, the younger men have accumulated bits of Not Alone,\" (Little, Brown and Co., having to do with the moving and uncritics<br />\n420 MADISON AVE.<br />\n- SAN FRANCISCO<br />\nCHIC 160 • BOSTON<br />\n• 9<br />\ninformation bearing on methods rather than a power to Boston, $2.00) returns from the usual ending. Perhaps it is that the<br />\nPORTLANE<br />\nLOS ANGELES<br />\nrealm qf gigantic phantasy, into prologue robs the story as such of<br />\nsense clinical problems as a whole.\"<br />\n1437<br />\nMcmber<br />\ntg36<br />\nof more simple, and therefore a great part of its drama—yet the<br />\nthose<br />\nWhile the undergraduate school cannot, without being<br />\nmore<br />\ncharming whimsy and people who are moving in the story<br />\ngenuine,<br />\none-sided, give the student the amount of science needed,<br />\nstory is simple—and should have had no prologue, and<br />\nThe<br />\nsentiment.<br />\nDistributors at<br />\nit should be able to give him the integrating power menin<br />\nthe<br />\nforshadowed<br />\nprologue—a should be an intensely affected as<br />\ntioned above. At the Hopkins the senior examination<br />\nsmall<br />\ntown<br />\ndoctor<br />\nEnglish<br />\n,almost though nothing had been told.<br />\nconsists of questir ns which attempt to ascertain whether<br />\nThe book will enjoy a sale, due in<br />\nin his<br />\nunbelieving<br />\nsave<br />\nunassuming,<br />\nhis<br />\nfrom<br />\nthe senior taking the examination has received<br />\nMember Of The<br />\nsome measure to the earlier work<br />\na<br />\nwork,<br />\nin<br />\nis<br />\nnet<br />\nof<br />\ncaught<br />\ncircumASSOCIATION<br />\nINTERCOLLEGIATE NEWSPAPER<br />\nscientific studies more than just the bare facts. This<br />\nstances surrounding the death of his already mentioned--\"Lost Horizon.\"<br />\nOf Middle Atlantic States<br />\nis all well and good and places the Hopkins at a higher<br />\nwife, and hanged for it, in the best To compare the two would be very<br />\nlevel than most undergraduate schools, yet it seems a<br />\nEnglish manner. The ending coin- difficult. They are unlike in type,<br />\nTUESDAY, APRIL 6, 1937<br />\ncurious thing when we find out that the student is given<br />\ncides with the beginning of the World and the first was an unquestioned<br />\na list of books to read in order to help him pass this<br />\nwriting,<br />\nof fanciful<br />\nWar, so that there is given an op- masterpiece<br />\nexamination.<br />\nportunity for a very masterful sym- Whereas the second is quiet and reIt appears that the four years of study alone do not bolism at the end, hidden under the served. To take an earlier comparBeta Kappa has a<br />\nThis is no denial that Phi<br />\nprepare the student, that the courses he takes gives him details of the trial and the execution. ison in his works, we return to \"Goodserious student under- only the bare facts and omit the integrating power. This<br />\nweight and vital influence on<br />\nThe central character, Dr. New- by Mr. Chips,\" or \"Without Armor.\"<br />\nmembership. It is the is distinctly a flaw in our system of education. It is the come, is jolted from the comparative The latter falls short by comparison,<br />\ngraduates who look farward to<br />\nthose who are the same thing, on a smaller scale perhaps, which is being seclusion of his life in the old cathe- while the other—a very short novel<br />\nsingle token of recognition given to<br />\nhave a justifiable protested against in the medical school. We see, there- dral town by the call to attend a ----almost a study—has still the charm<br />\nWe<br />\nscholastic leaders of their class.<br />\nfore, that forward strides taken in pre-medical education carnival dancer — a German girl— of originality, and the moving underconcerned with its<br />\ninterest in the Hopkins chapter. We are<br />\nwill help solve the problem.<br />\nwho has been hurt. They find in each statement at its best, which is perbe elected<br />\nproceedings; we are anxious that students<br />\nthe simple tenderness which haps the source of the chief charm<br />\nother<br />\nWith improvement in curricula there also should be<br />\nqualifications.<br />\ntheir<br />\nto<br />\nboth<br />\nhave<br />\nbeen denied—he by a of this contemporary English novregard<br />\ndue<br />\nwith<br />\nand<br />\nfairly<br />\na greater standardization of medical school requiretypical shrew of the period, to whom elist. \"Good-by, Mr. Chips,\" is still<br />\nthe<br />\nof<br />\nhistory<br />\nwill<br />\nschools<br />\nthe<br />\nmedical<br />\nat<br />\nin<br />\nacceptances<br />\nthe<br />\nthat<br />\nso<br />\nrare<br />\nments<br />\ncase,<br />\nTo judge fairly this<br />\nhe was married through his own lack the example of its type which even<br />\nwe must keep be based not at all on courses taken, but upon scholarHopkins Chapter of Phi Beta Kappa,<br />\ninitiative — she by the circum- its author will find difficult to equal,<br />\nof<br />\nusually<br />\ncharacteristics<br />\nother<br />\nand<br />\nthe<br />\npersonality,<br />\njust what can ship,<br />\nstances<br />\nof a brutal life. But when the if we are to be permitted the liberty<br />\nclearly in mind the issues involved and<br />\naccepted as a basis for judgment. This step would<br />\nfor future ones.<br />\nis<br />\nwife<br />\nfound dead, they are trans- of referring any author constantly<br />\nbe done for the present case as well as<br />\npre-medical<br />\nthe<br />\nfor<br />\nuncertainty<br />\nof<br />\neliminate a great deal<br />\nformed into lovers, and then to to his masterpiece.<br />\nChap- students and would certainly be a progressive step.<br />\nBeta<br />\nthe<br />\nof<br />\nmembers<br />\ntwo<br />\nthe<br />\nIt is obvious that<br />\n—W.B.B.<br />\nmurderers, in a very few hours, by<br />\nexercised their<br />\nThe problem of what men to accept at medical schools<br />\nter of the honorary scholastic fraternity<br />\nadversely is a serious one and requires very considerate thought.<br />\nlegal and constitutional rights in voting<br />\nthis. But It does seem, though, that the young super-scientist,<br />\ndeny<br />\ncan<br />\none<br />\nNo<br />\ncandidate.<br />\none<br />\nthis<br />\nagainst<br />\ncommittee,<br />\nexecutive<br />\nwho has only an ability to remember many isolated<br />\nit is equally factual that the<br />\nfindings facts, does get too far in comparison with his actual<br />\nthe<br />\napproved<br />\nunanimously<br />\nhad<br />\nafter discussion,<br />\nacademic records. worth. The elimination of some of these would also be<br />\nof the subcommittee on undergraduate<br />\nRecent appointments of chapter<br />\nFraternity men aren't exempted<br />\nthe officers and an improvement.<br />\nof<br />\njudgment<br />\nthe<br />\nIn other words, in<br />\nofficers<br />\nfor next year are as follows:<br />\nfever.<br />\nhouse-cleaning<br />\nSpring<br />\nfrom<br />\nCommittee,<br />\nfive members who constitute the Executive<br />\nGaunt,<br />\nthorPresident; Ivins, Vice-Preshouse<br />\ntheir<br />\nof<br />\nhad<br />\nhonor<br />\nK.A.'s<br />\nThe<br />\nthe<br />\nof<br />\n\"worthy<br />\nall fifteen were considered<br />\nident;<br />\nFrommelt,<br />\nvacation.<br />\nSecretary; Ahroon,<br />\nthe<br />\nduring<br />\ncleaned<br />\noughly<br />\nKappa.\"<br />\nBeta<br />\nelection to Phi<br />\nRecorder;<br />\nLittleton,<br />\nEaster<br />\nfor<br />\nTreasurer; Molscheduled<br />\nwas<br />\nare<br />\ntea-dance<br />\nA<br />\nmembers<br />\nNow according to the constitution,<br />\nare<br />\nThey<br />\nloy,<br />\nArchivist<br />\nLibrarian;<br />\nconsiderations.<br />\noff<br />\nCoady, Sercalled<br />\nbe<br />\nto<br />\nhad<br />\nit<br />\nbut<br />\nSunday,<br />\ntwo<br />\nof<br />\nchosen on the basis<br />\n(2) good<br />\nbecause the work wasn't finished. geant at Arms.<br />\n(1) distinguished academic attainment and<br />\n<br />\nt WS<br />\n<br />\nLetter<br />\n<br />\nLOCAL NOTE<br />\n<br />\nCoeDeo,<br />\n<br />\nThe Phi Bete Case<br />\n<br />\nGREEK LETTER NOTES<br />\n<br />\nCONTEMPO<br />\nOMMENT RARY<br />\n<br />\nScholastically, there can be no dispute as to the qualithe<br />\nfications of this man; he ranked number seven in<br />\nleaders<br />\nacademic<br />\ndefinitely<br />\nconsidered<br />\ngroup of fifteen,<br />\nCommittee.<br />\nby both the sub-committee and the Executive<br />\nP B K is<br />\n(for<br />\ncondition<br />\nessential<br />\nSo the first, and most<br />\nfulfilled.<br />\ncertainly<br />\nis<br />\nfraternity)<br />\nscholastic<br />\nhonorary<br />\nan<br />\nthe<br />\nAs to moral conduct we need only consult any of<br />\nto<br />\nacquaintances<br />\nor<br />\n-students<br />\nfellow<br />\nhis<br />\nfaculty or<br />\nestablish beyond doubt his moral worthiness.<br />\nBecause of the lack of discussion on this particular<br />\ncase, grave and serious suspicions and conclusions are<br />\nproduced. It is a shame that this student, after a<br />\nfull college career of distinguished academic attainment<br />\nshould not have even been given benefit of discussion.<br />\nIt is an injustice to him and an indirect slap in the face<br />\nat the judgment of the Executive Committee.<br />\nStudents, like U13, are unable to understand the rejection when we consider the qualification necessary and<br />\nthe qualifications possessed by this undergraduate. Because of the lack of any discussion or any charges, it is<br />\nmade to seem likely that outside factors had intervened.<br />\nBut what we are interested in is what to do about it.<br />\nFirst let us say that this case demands reconsideration.<br />\nYes, we are aware that the chapter constitution does<br />\nnot provide for such a procedure. But action can be<br />\ntaken if the chapter meets again and examines carefully<br />\nall possibilities.<br />\nThere is also the matter of a recurrence of the<br />\npresent unfortunate situation. It is clear that some<br />\nreform in the method of selecting Phi Beta Kappa members is needed. We suggest either a two-thirds or<br />\nmajority vote.<br />\nOur opinion in no way constitutes an indictment of<br />\nthe Hopkins chapter of Phi Beta Kappa. We are more<br />\nconvinced than ever of the high calibre and fair-mindedness which characterized all officers and members whom<br />\nwe interviewed.<br />\nBut what we strongly condemn are the conditions<br />\nwhich allowed such a case as this to arise.<br />\n<br />\nBiblical Fame)<br />\nThe Prof. is my shepherd; I shall<br />\nnot want. He maketh me to sit<br />\nthrough long lectures: he snappeth me out of still slumbers.<br />\nHe readeth over my papers: he<br />\nleadeth me on the path of scholarship for my own sake.<br />\n<br />\nWhile this was going on, Guy Stark,<br />\n* * «<br />\nout-going Number I of the chapter,<br />\nAt a recent meeting of the MaryMore than just a few seniors are turning into the was vacationing in Florida. Sounds land Alpha chapter of Sigma Phi<br />\nhome stretch of their College careers with a fear of bad since Sid Finley, the treasurer, Epsilon, the following officers<br />\nwere<br />\npossible failure tugging at their hearts. After sixteen<br />\nwas also in the South recently.<br />\nelected<br />\nand<br />\nJohn<br />\ninstalled:<br />\nSause,<br />\nyears of preparation they are ready to step off into<br />\nBill Witte, grad student and Tau President; Robert Dowell, Vice-Presthe world, and the questions they are feeling are, prepident; James Griffin, Secretary; Clark<br />\naration for what? If they fail to get a job, aren't they Beta Pi, was initiated last week.<br />\nfar behind non-college men? Will college prove to be<br />\n\"Bottle\" Buttner and \"Hon\" Thom- Ewing, Treasurer; James Lyle, Hisa spring-board or a sand pile? And particularly, what as<br />\nhave really been behind the eight torian; Benson Boss, Guard; Paul<br />\nare their chances for success?<br />\nReigner and Thomas Considine, first<br />\nball<br />\nlately.<br />\nHalf and half, to the last question, answers John R.<br />\nand<br />\nsecond 1VEarshalls.<br />\nTunis, Harvard, '11, in his book \"Was College Worth<br />\nmembers<br />\n541<br />\nthe<br />\nof<br />\nare<br />\nBeta<br />\nsurgsurvey<br />\npractising<br />\nboys<br />\nThe<br />\nrecent<br />\na<br />\non<br />\nSigma Phi Epsilon won the BowlWhile?\". Based<br />\nof his graduating class of 25 years ago, Mr. Tunis pre- ery these days—on defenseless bull ing League, for which it will receive<br />\ndicts that 25 years from now half of us will be dis- frogs. The operating surgeon was J. a cup.<br />\nappointed in our life's work!<br />\nTalbott Littleton, III, with all manPhi Ep takes pleasure in announcThe book, an attempt to evaluate higher education on<br />\nthe basis of accomplishments and failures of the au- ner of assistants. One on the hind ing the pledging of Bernie Rome, one<br />\nthor's own classmates, repeatedly raises the question, legs, one on the fore-legs, one giving of the new mid-season freshmen.<br />\n\"Is it all worth while?\" While the writer leaves that ether, and the rest kibitzing. The ob- Bernie is a graduate of Forest Park<br />\nfor the reader to decide, there is no doubt as to what he ject was to get out a kidney, sew the High School, where he established<br />\nthinks. Worth while for some, the impression he leaves<br />\nfrog back together and keep him fame as a track star.<br />\nis that College is a poor investment for many more.<br />\n• * •<br />\nalive. The incentive was two dinners<br />\nStarting with what he calls a fair cross-section of<br />\nSaturday<br />\nnight,<br />\nApril 3, Phi Eps<br />\nif<br />\nthe<br />\nfrog<br />\nlived<br />\nat<br />\na<br />\nleast<br />\nday<br />\nand<br />\nthat<br />\nreveals<br />\nTunis<br />\nMr.<br />\nproduct,<br />\ncollege<br />\nthe American<br />\ntheir<br />\nannual subscription<br />\nwhile a few have achieved \"Who's Who,\" about 100 are a half. Luck has favored the frog threw<br />\nSpring formal at the Phoenix Club.<br />\nactually dependent upon others---some even on relief! and it's still hanging on.<br />\nA big time was had by all, since all<br />\nThe cnly note in any way encouraging is his estimated<br />\n* • •<br />\nmembers had dates and the 'wolfing'<br />\nclass income average of $4,450—a good living income.<br />\nDuring the spring vacation Johns was left entirely up to the nonThe campus \"big-shot\" is no sure bet for success, adds<br />\nMr. Tunis as he discloses how several of the poorest Hopkins Betas spread out over the members who attended. Facilities<br />\nwere also arranged for drinks to be<br />\nand relatively obscure boys of his class have become its old U.S. Some went north to Sarasold at the bar, or setups were to<br />\nmost distinguished members. Another interesting point toga, one went south to Florida, one<br />\nbe had at the tables.<br />\nis his deduction pertaining to the question of marrriage.<br />\nwent to Indiana, and others to the<br />\nHe says a college man \"cut his chances of unhappiness<br />\nBig City, New York.<br />\nin two when he marries\" a college woman.<br />\nAfter a three week illness of quite<br />\n*<br />\n*<br />\na<br />\nin<br />\nwritten<br />\nWhile?\"<br />\nTunis'<br />\n\"Is<br />\nWorth<br />\nMr.<br />\nCollege<br />\nserious nature, Morel Harmel has<br />\nThe latest arrival is a pup, from once more returned to school to<br />\nclear and easy style and for the edification of the college man, should have a great appeal to every under- which big things are expected. It make up missed studies. He will regraduate, as well as for the senior on the homestretch. is a Great Dane. It suffers already sume his position and duties as newly<br />\nfrom consumption—of too much food. elected Prater Superior of Phi Ep.<br />\n--The Ursinus Weekly<br />\n<br />\nAgain, Why College?<br />\n<br />\nfl<br />\nTv<br />\n<br />\nYea, tho he handeth out the blue<br />\nexam books, I shall fear no evil:<br />\nfor I have Hand-Shaked; they<br />\nmarks and thy criticisms they<br />\n<br />\nThou readest my paper before me<br />\nin the presence of mine school<br />\nmates: thou pointests out my<br />\nerrors; my fears are abated.<br />\nSurely good luck and mercy have<br />\nfollowed me all the days of my<br />\nschool life, and I shall be accepted in the Med. School of<br />\nHopkins.<br />\nAmen!<br />\n<br />\n(4<br />\n<br />\nreqi<br />\n<br />\nfrighten me.<br />\n<br />\nPP<br />\n<br />\nan<br />\nwhc<br />\nince<br />\nwea<br />\nmor<br />\nkno'<br />\nther<br />\nthe<br />\nan<br />\ned,<br />\nof<br />\nmig<br />\nblac<br />\n<br />\nthis<br />\nmee<br />\n\"I<br />\nblac<br />\nsaid<br />\n<br />\nPUBLIC<br />\nNOTICE<br />\nTO ALL<br />\nPIPE<br />\nSMOKERS<br />\n<br />\nAssociated Cotieeiate Press<br />\n<br />\nmoral conduct.<br />\n<br />\n(With Apologies to David of<br />\n<br />\nand bewildering claims made for<br />\npipe tobacco make it our duty,<br />\nwe believe, to publish this<br />\nstraight-forward statement.<br />\nFor 60 years we have been<br />\nmaking fine pipe tobaccos,<br />\nwhich we guarantee against<br />\ntongue bite. Now for the first<br />\ntime we divulge the methods<br />\nwhich have made this guarantee possible.<br />\nPipe tobaccos may be<br />\nrushed through a plant at a<br />\ngreatsaving in expense. Every<br />\ntobacco expert knows this.<br />\nOr they may be made by<br />\nthe slow, patient method used<br />\nin Edgeworth. This method<br />\nwe call Process-Aging. There<br />\nare twelve required steps,<br />\neach under laboratory control.<br />\nIt takes 4 to 7 times as long<br />\nas might seem necessary.<br />\nThis prevents tongue bite<br />\nas no other method will. We<br />\ninvite you to prove this statement to your own satisfaction<br />\nat our risk. You are the only<br />\njudge.<br />\nMHE CONFLICTING<br />\n<br />\nNOTE: There are three kinds of<br />\nEdgeworth for you to choose<br />\nfrom:<br />\n1—Edgeworth Ready-Rubbed—a<br />\ncool,long-burning tobacco preferred<br />\nby seasoned smokers.<br />\n2—Edgeworth Plug Slice—for the<br />\nsmoker who likes to crumble the<br />\ntobacco in his hands until it's just<br />\nright for him.<br />\n3—Edgeworth Jr.—the kY11140 tobacco also Process-Aged, but cut<br />\nfor a milder, more free-burning<br />\nsmoke.<br />\n<br />\nPlease accept 501e Gold Plat d<br />\nfor only 100 when you buy II<br />\nMerely send inside white wrap., time<br />\nany tin of Edgeworth with your<br />\naddress and 10# to Lams & lire.<br />\nDept. 'On<br />\n<br />\nLARUS & BRO. CO.<br />\n<br />\nD]<br />\n\"I<br />\nthe<br />\nKap<br />\nnot<br />\na p(<br />\niousl<br />\nship.<br />\na co<br />\nan u<br />\nbers<br />\nof ti<br />\ntwoshou<br />\nsimp<br />\nIt<br />\ntutio<br />\nfifth:<br />\nrecoi<br />\nat tl<br />\nbers.<br />\nDr<br />\nin L<br />\non u<br />\n\"0<br />\ngrad<br />\nI chc<br />\nuncle<br />\nfor<br />\nThes<br />\ncomr<br />\ndoub<br />\n\"I<br />\ndidal<br />\ntheir<br />\nnow<br />\nthe (<br />\nsee<br />\nclass<br />\nBeta<br />\nDr<br />\nman<br />\nuate<br />\n\"T<br />\ned or<br />\nship<br />\nfrom<br />\nship,<br />\nfled;<br />\nhid<br />\nattac<br />\nsure<br />\nin bi<br />\nthose<br />\ntingu<br />\nand<br />\nthat<br />\nagair<br />\nstate<br />\nbut<br />\nanon,<br />\nfeet,<br />\nthey<br />\n<br />\nthing<br />\nco<br />\nprey(<br />\ncases<br />\nshbul<br />\nPhi<br />\nsecor<br />\nthe I<br />\ndidat<br />\n<br />\nat<br />\n<br />\nTt<br />\n<br />\n\f3<br />\n<br />\nHOMEVVOOD, BALTIMORE, APRIL 6, 1937<br />\n<br />\nPraises Georgian Simplicity<br />\nEdinburgh Chemist Wu,Editor, ToTalk<br />\nShils, ASU Head Biology Faculty VisitorOf<br />\nJohns Hopkins Club Building<br />\nRejected By Phi Makes Discovery Calls Club House One Of Finest In Country; Attend Speaks Before ACS At SCA Conference<br />\nOpen House Held For Faculty<br />\nKendall To Talk Tonight Speaker Prominent As Editor<br />\nIs Studying<br />\nMarch<br />\n29th<br />\nBeta Kappa Department<br />\nOn<br />\nOn \"Liquids And<br />\nAnd National YMCA<br />\nCauses Of Population<br />\n300<br />\n<br />\nHad Ranked Seventh In<br />\nClass; Among 15<br />\nNominated<br />\n<br />\nDecline In Beetle<br />\n(Continued from Page 1, Col. 4)<br />\n<br />\nBy VICTOR VICTOROFF<br />\nA casual visitor to the new Alumni.<br />\nFaculty Building is immediately<br />\nstruck by the all-pervading whiteness<br />\nand cleanliness of the edifice, both<br />\ninside and out. Clad in its mantle<br />\nof Georgian simplicity, it commands<br />\nrespect. One need not look long at the<br />\nbuilding without realizing the beautiful sentiment manifest in this memorial created for and offered to the<br />\nmemory of William A. and Charles<br />\nL. Marburg.<br />\n<br />\nbeetles eat their own eggs. It can<br />\nbe easily seen that this might have<br />\nan important effect upon the populaTWO BALLOTS DECIDE tion growth and decline. However,<br />\nDr. Park found that those beetles<br />\nTwo Blackballs Sufficient To kept in fresh<br />\nflour devoured twice as<br />\nmany eggs as those beetles which<br />\nRule Him Out Despite<br />\nwere kept in the conditioned flour.<br />\nRecommendation<br />\nThis could not account, therefore, for<br />\na decline in population of the organ(Continued from Page 1, Col. 6)<br />\nThe club house, one of the finest<br />\nNo explanation of a blackball is isms kept in the conditioned culture<br />\nof its kind in the country, occupies a<br />\nrequired, but Dr. French agreed that medium.<br />\nsecluded site on the north side of the<br />\na member of the Phi Beta Kappa,<br />\nLowers Fec,undity<br />\nBotanical Gardens at Homewood. Its<br />\nwho had reason to consider a nomHowever, in studying fecundity,<br />\ninee unworthy because of a character that is the production of eggs, Dr. Georgian architecture qualifies it to<br />\ntake its place among the rest of the<br />\nweakness, should consider it his Park found that those beetles<br />\nkept<br />\nmoral obligation to make that fault in fresh flour which was charged buildings on the campus.<br />\nInside, the smell of fresh paint<br />\nknown to his confreres and to ask regularly produced ten times as many<br />\nthem to join with him in maintaining eggs as those kept in conditioned stil tinges the air with a not-unpleasthe society's standards and rejecting flour. As far as fertility is con- ant odor. All is new, glistening, and<br />\nan unfit candidate. Dr. French add- cerned—that is the capacity for these white. Imported rugs and beautiful<br />\ned, however, that he could conceive eggs to develop----he found that it was paintings in perfect taste are charof a situation in which a member approximately the same In both cases. acteristic of the house's sumptuousmight dislike to state his reasons for Therefore, it may be seen, that this ness. Complete and carefully-selected<br />\nmodernistic furniture in all the rooms<br />\nblackballing.<br />\ndecrease of fecundity in the condiof the house give unsurpassable<br />\nThe reason for the blackballs in tioned cultures would have a drastic<br />\ncomfort, and lend a particular digthis case was not brought out at the reduction effect upon the population<br />\nnity of their own, compatible with<br />\nmeeting, Dr. French stated.<br />\ngrowth.<br />\nthe environment and general tenor<br />\n\"I think it is unfortunate that the<br />\nFurthermore, Dr. Park found that of the building as a whole. Impresblackball system is used,\" Dr. French the larval metamorphic time required<br />\nsive in their simplicity are the armsaid.<br />\nby those beetles kept in conditioned chairs next to the tables in the<br />\nDr. Spencer stated:<br />\ncultures was about one-third longer dining-room.<br />\n\"I oppose the blackball system for than that of those kept in the fresh<br />\nThe structure is arranged ideally<br />\nthe simple reason that Phi Beta flour, and he also found that there for the purpose for which it is inKappa is not a social club. You can was an increased mortality rate in tended. There are spacious dining<br />\nnot blackball on the principal that the metamorphoses of those kept in rooms and a comfortable lounge,<br />\na person might not fit in harmon- conditioned flour.<br />\ngame rooms and reading rooms. It<br />\niously with the rest of the memberFrom this investigation, it is clearship. I think the method of allowing ly shown that the reduction in fecun•<br />\na couple of blackballs to disqualify is dity and the increase of metamorphic<br />\nan unwise method of selecting mem- time period and metamorphic morbers to the Phi Beta Kappa. I am tality are of primary importance in<br />\nof the opinion that no more than a the population decline of Triboliurn.<br />\ntwo-thirds !vote of thole preseint<br />\nThe importance of this work is<br />\nshould be required, perhaps even a<br />\nthat, if these factors of the condisimple majority.\"<br />\ntioned culture medium may be shown<br />\nIt was pointed out that the constito be the most essential ones in the<br />\ntution could be amended by a four- explanation<br />\nof the population decline<br />\nfifths vote and that a meeting for<br />\nof Tribolium, there may be further<br />\nreconsideration of Shils could be called<br />\nevidence to the effect that similar facat the written request of five memtors are responsible for the population<br />\nbers.<br />\ntrends in many other organisms, and<br />\nDr. Richard M. Haywood, associate<br />\nthese factors may be pre-eminent in<br />\ncommittee<br />\nthe<br />\nof<br />\nin Latin, member<br />\nthe shaping of the course of all<br />\non undergraduate investigation, said:<br />\npopulations.<br />\nunder\"On the sub-committee for<br />\ngraduate students, Dr. Blumberg and<br />\nchose Mr. Shils as one of the fifteen<br />\nundergraduates academically eligible<br />\nfor membership to Phi Beta Kappa.<br />\nThese were given to the executive<br />\ncommittee, none of whom raised any (Continued from page 1, column 2)<br />\ndoubt as to thir qualifications.<br />\nden, Sidney T. Matthews, Jean C.<br />\n\"I regret the incident, for the can- Sask.<br />\ndidates were obviously leaders of Latin:<br />\ntheir class. Although the charter<br />\nR. E. Peg-ram, C. D. Malbone,<br />\nnow specifies that character is one of Charles Buck.<br />\nthe qualifications, I should prefer to Mathematics:<br />\nsee the leaders of the graduating<br />\nAbraham Seidenberg, John Knudclass automatically elected to Phi son.<br />\nBeta Kappa.\"<br />\nOriental Seminary:<br />\nDr. Albert E. Blumberg, chairDavid Panitz.<br />\nman of the committee on undergrad- Philosophy:<br />\nuate investigation, stated:<br />\nIrving P. Orems.<br />\n\"The Phi Beta Kappa key is award- Physics:<br />\ned on the two-fold ground of scholarMichael Emmert, Milton Benson,<br />\nship and character. It is obvious that William Bright, Thomas Schreiber.<br />\nfrom the point of view of scholar- Political Economy:<br />\nship, Mr. Shils is perfectly well qualiJohn Loftus, Meno Lowenstein,<br />\nfied; consequently, the rejection of Donald Jones, Helen Potter.<br />\nhi3 candidacy constitutes a serious Political Science:<br />\nattack upon his character. I feel<br />\nJohn 0. Tabler, Donald Rubensure that this attack is not concurred stein.<br />\nin by the overwhelming majority of Psychology:<br />\nthose who know him and his dinFlorence Jennings.<br />\ntinguished record in the classroom Romance Languages:<br />\nand on the campus. The very fact<br />\nH. E. Creave, W. L. Greene, 13.<br />\nthat the two persons who voted Lichtenstein, T. J. Murphy.<br />\nagainst him lacked the courage to Zoology:<br />\nstate and defend their convictions,<br />\nMargaret Hoover, Raymond Berry,<br />\nbut chose rather to hide behind the Ray Watterson, Margaret Deringer.<br />\nanonymity of a secret ballot, in effect, invalidates whatever objection<br />\nthey may have had.<br />\n\"If Phi Beta Kappa is to mean anything it is necessary to take steps<br />\nat once to rectify this injustice to<br />\nTwo prizes of one dollar each in<br />\nprevent the recurrence of similar soda shop merchandise will be awardcases in the future. Such steps ed to the two Hopkins students who<br />\nshould include, first, the election to submit the best group of suggestions<br />\nPhi Beta Kappa of Mr. Shils, and, for the improvement of Levering<br />\nsecond, changes in the procedure of Hall, according to Martin Levine,<br />\nthe Hopkins chapter in electing can- chairman of the Levering Hall Comdidates.\"<br />\nmittee.<br />\n<br />\ncontains, also, a large smoking room<br />\nand refreshment as well as locker<br />\nrooms and showers. One wing of<br />\nthe building is reserved for the use<br />\nof women members.<br />\nOn March 29th an \"Open-House\"<br />\nwas given for members of the faculty. Dinner was served to 100 of the<br />\n300 present on that evening. On the<br />\nfirst of April a second informal<br />\ngathering, this time of the Alumni,<br />\nwas held. 114 persons partook of dinner on that occasion. Later, refreshments were served. No formal dedication has as yet taken place.<br />\nMrs. Grace C. Fisher, manageress<br />\nof the club, said, \"The club is for the<br />\nbenefit of faculty and alumni. Meals<br />\nwill be served at moderate prices to<br />\nmembers, and every effort to make<br />\nthem comfortable here will be<br />\nmade.\"<br />\nThe club is not open to the public,<br />\nand its use is restricted wholly to<br />\nmembers and their guests. Membership is open to all men and women<br />\nwho are members of the teaching<br />\nstaff of the University, and of the<br />\nJohns Hopkins Hospital, and to all<br />\ngraduate students and alumni of the<br />\nUniversity. The other requirement<br />\nis that an application for admission<br />\nmust be accompanied by the endorsement of two club members.<br />\nThe Board of Governors plans to<br />\nkeep the club open for eleven months<br />\nin the year. The officers are: President, R. G. Merrick; vice-president,<br />\nG. E. Barnett; secretary, W. B. Kouwenhoven, and treasurer, A. C. Howard.<br />\n<br />\nSolutions\"<br />\n<br />\nStudent Secretary<br />\n<br />\nDr. James Kendall, professor of<br />\nchemistry at the University of Edinburgh, will speak before a meeting<br />\nof the Maryland branch of the Amer:<br />\nican Chemical Society at 8.15 P. M.<br />\nthis evening in room 58, Rowland<br />\nHall. His subject will be \"Liquids<br />\nand Solutions.\"<br />\nDr. Kendall, born in Surrey, England, on June 30, 1889, was educated<br />\nat the University of Edinburgh,<br />\nwhere he took his doctor's degree in<br />\n1915. Having decided to do graduate<br />\nwork, he then went to the Nobel Institute in Stockholm for a brief period.<br />\nHe was a member of the Faculty of<br />\nColumbia<br />\nUniversity from 1913<br />\nto 1926, when he left to become professor of chemistry at Washington<br />\nSquare College.<br />\nHe remained in America until<br />\n1928, when he went to Edinburgh to<br />\ntake the position he now holds.<br />\nHis speech will be a summary of<br />\nthe papers and discussions of the<br />\nFaraday Society which met last September in Edinburgh.<br />\n<br />\nY. T. Wu, former National Secretary of the Student Division of the<br />\nY. M. C. A. an editor-in-chief of the<br />\nChinese Division of the Associated<br />\nPress, will be the guest speaker at<br />\nthe Student Christian Association<br />\nMeeting of Maryland Colleges at Levering Hall tomorrow. Students from<br />\nGoucher, Maryland State Teachers<br />\nCollege, Morgan College, Maryland<br />\nCollege for Women, and Hopkins<br />\nwill take part in the conference.<br />\nAt 4.00, Mr. Wu will lead a Round<br />\nTable discussion for \"Y\" Cabinet<br />\nmembers on \"The Christian Revolution.\" The speaker is one of the<br />\nleaders of the Christian movements<br />\nin the East, and is said to be one of<br />\nthe foremost interpreters of the Chinese movement.<br />\nAt the evening meeting at 7.30,<br />\nMr. Wu will speak on \"My Conception of God.\" The meeting will be<br />\nopen tol all faculty, students, and<br />\nfriends of the University, and will<br />\nbe held at Levering Hall.<br />\nAs editor-in-chief of the Associated Press, Mr. Wu has built up a<br />\ngroup of Chinese writers whose production, during the past few years,<br />\nis regarded as notable and who have<br />\natempted to put forward a comprehensive and coordinated program of<br />\nliterature production, especially for<br />\neducated Chinese youth. His major<br />\ncontributions have been in the field of<br />\ninterpreting the meaning, the discipline and the social implications of<br />\nChristianity.<br />\n<br />\nSon neborn Will Speak<br />\nTo Biology Convention<br />\nDr. Tracy M. Sonneborn, associate<br />\nprofessor of Zoology at the Hopkins,<br />\nwill be one ofthe guest speakers at<br />\nthe annual Maryland Biology Teachers' Convention, to be held at Hood<br />\nCollege, April 10 1937. He will give<br />\na summary of work done in the field<br />\nof Genetics during the past three<br />\n<br />\nPhilip Merivale says:<br />\n<br />\n\"My throat's grateful for Luckies<br />\n— a light smoke\"<br />\n\"In one of the first important parts I<br />\ndid in America, the play called for a<br />\nlong and very trying individual performance. In every scene for five full acts I<br />\nwas on stage talking almost continuously. The strain made itimperative that<br />\nI safeguard my throat and voice. After<br />\ntrying different brands of cigarettes, I<br />\ncame across Luckies. They stood the test<br />\nand for many years now I've enjoyed<br />\nthem. I like the taste of Luckies and my<br />\nthroat is grateful for a light smoke.\"<br />\n<br />\nHolt Announces<br />\nGrad Scholarships<br />\n<br />\nphyveva<br />\nl<br />\ne<br />\n<br />\nAn independent survey was made recently<br />\n<br />\nPlan Prizes For Levering<br />\nImprovement Suggestions<br />\n<br />\nTo the members of<br />\nBOH<br />\n<br />\nfurnish your official fraternity<br />\nor J. H. U. seal and attach it to any of our<br />\nindividual jewelry from $1.00 up.<br />\nQuick Service At<br />\nWe can<br />\n<br />\n(HK$<br />\n<br />\nAy<br />\n<br />\nA(I)<br />\n<br />\n1,4E<br />\n<br />\nALI(1)<br />\n<br />\n(DA<br />\n<br />\nitorA<br />\n<br />\n43E11<br />\n<br />\nManufacturing Jewelers<br />\n<br />\n.111A<br />\n<br />\n207 WEST SARATOGA STREET<br />\nPhone Calvert 1300<br />\n<br />\nKA<br />\n<br />\nTA II<br />\n<br />\n6<br />\n<br />\nca/,<br />\n<br />\nfnc.<br />\n<br />\namong professional men and women—lawyers,<br />\ndoctors, lecturers, scientists, etc. Of those who<br />\nsaid they smoke cigarettes, more than 87% stated<br />\nthey personally prefer a light smoke.<br />\nMr. Merivale verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies—a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br />\n<br />\nTHE FINEST TOBACCOS—<br />\n\"THE CREAM OF THE CROP\"<br />\n<br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\n<br />\nCopyright 11137. The American Tobacco Company<br />\n<br />\n\f4<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 6, 1937<br />\n<br />\nJay Baseballers<br />\nWinBy9-5Score<br />\nAt Towson Field<br />\n<br />\nDukehart Pushes One Over On C. C. N. F.<br />\n<br />\nJ.H.U.Hand Ball<br />\nTeam Completes<br />\n36-37 Schedule<br />\n<br />\nBeat Towson Teachers In<br />\nThe Initial Game<br />\nOf Season<br />\n<br />\nJays<br />\n<br />\nCARPER STARTS GAINS<br />\n<br />\nSEASON SUCCESSFUL<br />\n<br />\nJays Win By Staging Six<br />\nRun Rally In Eighth<br />\nInning<br />\n<br />\nRecord In Three Year's<br />\nPlay; 18 Wins. 3<br />\nLosses<br />\n<br />\nThe Johns Hopkins University<br />\nbaseball team defeated the Towson<br />\nTeachers in its first game last Saturday at the Gilman School by the<br />\nscore of 9 to 5.<br />\nThe Indians scored first in the second inning, but the Hopkins team<br />\nerased that lead in their half of the<br />\nsecond inning and scored again in<br />\nthe third and sixth innings. However<br />\nNormal team took the lead again in<br />\ntheir half of the eighth by scoring<br />\nthree runs and leading 4 to 3. In<br />\ntheir half of the eighth inning the<br />\nHopkins team staged a six run rally<br />\nin which each better got one turn<br />\nat the plate.<br />\nJays Score In 8th<br />\nJohn Carper, Hopkins center fielder, led the attack with three outs<br />\nout of four trips to the plate. It was<br />\nhis hit in the second inning that set<br />\nthe stage for the first run, when<br />\nAlperstein laid down a sacrifice bunt<br />\nto advance Carper to second, and<br />\nCarper scored when Romanofsky<br />\ncame through with a single. Again,<br />\nwhen the Jays were behind in the<br />\neight inning it was Carper's third<br />\nhit that started the six run rally<br />\nwhich meant the victory for Hopkins.<br />\nLen Rubinger was credited with<br />\nthe victory and pitched the full nine<br />\ninnings. He was nicked for nine hits<br />\nand gave ten walks, but struck out<br />\nnine men.<br />\nThe Jays' next opponent will be<br />\nMount St. Mary's team and the game<br />\nis scheduled for this Saturday, at<br />\n3 p.m., probably at the Gilman School<br />\ndiamond.<br />\nThe line-up and score by innings<br />\nfollows:<br />\nJOHNS HOPKINS<br />\nAb. R. H.0. A<br />\n3 1 1 3 0<br />\nRomanofsky, lf<br />\n3 2 2 8 0<br />\nStevens, c<br />\n2 1 0 1 0<br />\nBray'aw, rf<br />\n4 0 1 4 3<br />\nHartke, as<br />\n5 1 2 6 0<br />\nClisham, lb<br />\n2 1 0 0 0<br />\nMilan, 3b<br />\n4 2 3 0 0<br />\nCarper, cf<br />\n2 0 0 4 2<br />\nAlp'ten, 2b<br />\nRubinger, p<br />\n3 1 1 1 3<br />\n<br />\nThe Johns Hopkins Varsity Handball team ended the season by splitting two games before the Easter<br />\nholidays. After trouncing Western<br />\nMaryland 5-0, the Jay wallmen were<br />\nturned back by the revenge-seeking<br />\nPennsylvania U. Team, 6-1.<br />\n<br />\nTotals<br />\n<br />\n28 9 10 27 8<br />\n<br />\n'110WSON TEACHERS<br />\nAb. R. H.0. A<br />\n2 1 0 3 0<br />\nSokolow, 2b<br />\n5 1 1 2 3<br />\nCrest, ss<br />\n4 0 0 2 2<br />\nBennett, 3b<br />\n5 0 1 3 1<br />\nL,ow'ten, c<br />\n6 0 1 2<br />\nHam'ton, if<br />\n4 2 3 1<br />\nWheeler, cf<br />\n3<br />\nWilliams, cf<br />\n1 0<br />\n4 0 1 8 1<br />\nBudeke, lb<br />\n2<br />\n5 1 1<br />\nSmith, p<br />\n1Weis<br />\n1 0 1<br />\n1 0<br />\n2Gordon<br />\n<br />\n•<br />\n<br />\nC. C. N. Y. Bows To<br />\nStrong Jay Squad<br />\n<br />\nOFF<br />\nand<br />\nN<br />\nBy RED GLA.NTZ<br />\nAPRIL FOOL! !<br />\nIf you've heard this story before,<br />\nit's your own fault. If you haven't,<br />\nhave a laugh at the expense of our<br />\never belittled trainer, Jimmy Benson.<br />\nThe setting—Homewood Field, April<br />\n1, the air resounding with the swish<br />\nof sticks, hickory against heads, and<br />\nthe outbursts of the outsiders. Suddenly a figure drops with an accompanying shriek of agony. . . . Pete<br />\nSwindell is down with a limp leg. . .<br />\nHis head goes from side to side. . . .<br />\nhe's drooling at the mouth.<br />\n<br />\nContinued from Page 7, Col. 3)<br />\nwhen the Jays came up for air, the<br />\nscore stood:<br />\nC.C.N.Y 2; JOHNS HOPKINS 0<br />\n<br />\nBasketball Squad Tops Season<br />\n.<br />\njj With<br />\nBanquet At Levering<br />\nLetters Distributed By Coach Mallonee Assisted By Dr.<br />\nShaffer And Prager; Siegel, Rasin, Cross, Melvin<br />\nZheutlin, And Traggis Get Majors<br />\n<br />\nTrip Terriors<br />\nLose to Penn<br />\n1 -6<br />\n<br />\n5-0;<br />\n<br />\nThe Hopkins team previously defeated Penn on the Homewood courts<br />\n5-1. Arnold \"Red\" Glantz supplied<br />\nthe only Jay victory on the Penn<br />\ncourts.<br />\nThe team ended a highly successful season with seven wins and two<br />\nlosses. The team is captained by<br />\nNathaniel Finkelstein and coached<br />\nby Reuben Baer.<br />\nJays Sweep Singles<br />\nIn the first singles match with<br />\nWestern Maryland, Milt Alperstein<br />\ndefeated Joe Dickson 15-11, 15-12 in<br />\na hard-fought match with Alperstein's better condition, giving him<br />\nthe edge.<br />\nDick Pasternak overwhelmed Bill Harston 15-5, 15-6 in<br />\nthe second singles, while Captain<br />\nFinkelstein completed the sweep of<br />\nthe singles by defeating Dan Volkhart 15-8, 15-9.<br />\nIn the doubles, Pasternak paired<br />\nwith Rossett, a newcomer on the<br />\nteam, to beat Johnson and Daly of<br />\nWestern Maryland, 15-8, 15-6. The<br />\nWestminster team forfeited the last<br />\ndoubles matc)11 to Alperstein and<br />\nFinkelstein.<br />\nPasternak Injured<br />\nIn the first singles at Penn, Iry<br />\nMilberg lost a hard-fought match to<br />\nJohn Anderson 21-19, 21-9. The secong singles match was called off after<br />\nSlick Pasternak of Hopkins split a<br />\nfinger bone when leading Rockmore<br />\nof Penn, 18-12. Milt Alperstein lost<br />\na long drawn-out struggle to \"Blimp\"<br />\nWolinsky of Penn 21-15, 21-19 in the<br />\nthird singles. \"Red\" Glantz provided<br />\nthe only Hopkins victory by playing<br />\na great game of ball to turn aside<br />\nWade of Penn 21-16, 21-12. Glantz's<br />\nsuperior speed afoot clinched this<br />\nbattle.<br />\nPenn Takes Doubles<br />\nMilberg and Alperstein lost the<br />\nfirst doubles after winning the first<br />\ngame 21-18, but dropped the next two<br />\n21-17<br />\n23-21. Glantz and Finkelstein bowed in the second doubles<br />\n18-21, 21-15, 17-21.<br />\n<br />\nIf Coach Kelso Morrill had walked<br />\nin about this time the situation<br />\nwould probably have taken on the<br />\ninterior decorators (bench drapers),<br />\nBy LEN RUBINGER<br />\nelements of straight tragedy. As it<br />\nIt would not have been appropriate reluctantly satisfied themselves with<br />\nwas, the atmosphere around the Jay (page Stanley Prager) to finish off H.'s of smaller proportions.<br />\nOf<br />\nbench was hardly that of high car- the basketball season without hav- course Stanley Q. Prager was preSquad<br />\nPrepares<br />\nFor<br />\nMatch<br />\nnival.<br />\ning had something to eat to top it off. sented with his major letter (little<br />\nWith Swarthmore<br />\nThen Melvin passed to Tommy And so the Basketball Banquet was deserved as it was); but it is interFriday<br />\nDukehart on the crease, and reason held last Wednesday eve within the esting to mention that it required<br />\nwas again triumphant. The rest of stately portals of one of Levering's all the brains and reserve of the AthWith the weather favorable and<br />\nthe story is quickly told. When the upstairs rooms. With Dr. Shaffer act- letic Department (ask Dr. Shaffer) the courts open and in excellent conreturns were in, the Blue Jay's high- ing the part or toastmaster and the to equip the robust laugh-creator with dition, the Blue Jay tennis aspirants<br />\nTotals<br />\n38 5 924 9<br />\nhave taken to the out of doors for<br />\nCoach Dotterweich dashes into the class collection of bric-a-brac was on rest of the group (which included a sweater.<br />\n1Batted for Williams in eighth.<br />\nclubhouse yelling, \"Bens, for Gawd's top by a count of 13-3.<br />\nplayers, managers, and the coach,<br />\nLenny Krakauer and Benny Root their pre-season practices. Until now<br />\n2Batted for Sokolow in eighth.<br />\nBut, if the score was orthodox, the Mr. Mallonee) contributing no little were elected Junior managers for the netmen had been working out in<br />\nsake, it's Pete, he's broken a leg<br />\nJohns Hopkins 0 1 1 0 0 1 0 6 x 9 (the good one)! ! Jimmy gulps, but modus operandi was not. For the<br />\nby way of wise-cracks and \"clean\" next year. The resignation of Prager the gym, perfecting strokes and getTowson Teach. 0 1 0 00 0 0 3 1-5 only for a second, for in the next mo- boys from New York may have been<br />\njokes, a joyful time was had by all.<br />\nleaves the Senior managership wide ting the correct timing.<br />\nErrors--lFtomanofsky, Hartke, Car- nient he has a stretcher in one hand picked as door-mats, but the word<br />\nThe first test for the Blue courtopen. Root and Krakauer are to battle<br />\nSeigel Says Good-bye<br />\nper, Alperstein, Rubinger, Budeke and the proverbial black bag in the \"Welcome\" was absent from their<br />\nit out during the 1937-38 campaign, sters is with the Swarthmore team<br />\nThe<br />\naffair<br />\nwas<br />\nnot<br />\nwithout<br />\nthe<br />\nun(2), Smith, Hamilton. Two-base hits other, and is at the same time utter- persons. Their defense squad sported<br />\nto the loser going the distinction of on the ninth of April, at the Home--Stevens, Wheler. Stolen bases- ing loud reassurance to the world in one of the lustiest collections of avoidable serious moments characwood courts. That is the start of an<br />\nhaving helped for there years.<br />\nteristic<br />\nof<br />\na<br />\nfinal<br />\nbanquet.<br />\nIt<br />\nwas,<br />\n--Stevens, Wheeler.<br />\nStolen bases— general such as \"I'm comin', Pete . . . hatchet-wielders ever seen on the<br />\nextensive schedule which, in addiamong<br />\nother<br />\nthings,<br />\na<br />\nfarewell<br />\ndinner<br />\nBusiness<br />\nMonkey<br />\nbypitcher—By Rubinger (Sokolow); rolling watermelons, the Dumb . . . Homewood terrain. Any attempt at<br />\ntion to teams representing the varto Captain Herb Seigel. Herb, the<br />\nA round of applause greeted \"Mal's\"<br />\nSmith (Stevens). Strike-outs — By Benny, etc.\"<br />\na display of the far-famed Jay passious Maryland institutions includes<br />\nonly<br />\ngraduating<br />\nmember<br />\nof<br />\nthe<br />\nteam,<br />\nenlightening report that Manager<br />\nRubinger, 9; Smith, 1. 2Base on balls<br />\nsuch formidable foes as Duke, LeThe turf literally slides under Jim's ing attack was apt to bring forth was congratulated upon his brilliant<br />\nPrager couldn't count. When all the<br />\n—Rubinger, 10; Smith, 7.<br />\nan<br />\nexhibition<br />\nof<br />\nmob<br />\nviolence,<br />\nwhich<br />\nfeet as he endeavors to reach the<br />\nyear of captaincy; and he in turn ex- playing times of each game were high, Lafayette, Catholic U., and<br />\nWilliam and Mary.<br />\never-suffering Pete. He kneels rev- would have been balm to the soul of pressed his appreciation to the vaadded up, it was found that the conerentity only to be greeted by a grin- the late Dutch Schultz.<br />\nrious players for their cooperation tests ranged from 80-120 minutes,<br />\nSince the first match is so close<br />\nFurthermore, the Gotham attack, and spirit during the season.<br />\nning pan and an unroarous \"April<br />\nat<br />\nhand, the team will not have too<br />\nwhereas a regulation game lasts just<br />\nfor a Northern entry, was not only<br />\nFool!\"<br />\nCarl Resin, one of the most re- 40. Nice going, Stan!<br />\nmuch time to get into top shape.<br />\nIs the joke, however, on Jimmy amazingly well-integrated, but, in ad- markable court performers at the<br />\nNext year's uniforms will be blue However, Coach Hofmeister will<br />\nThe Black and Blue Jay Vee stick- Benson? It's not so certain. How dition, seemed to know how to con- Hopkins in recent years, was elected with gold stripes (Gabardine). Com- want his charges go through their<br />\nthe circle.<br />\nThe to succeed Seigel. The vote was<br />\nmen dropped a 5-2 decision to an ex- sympathetic will he be in the future? duct itself around<br />\nplete sweat suits, latest style, will be paces this week, and then select his<br />\nindividuals for the spots in which<br />\nunanimously in his favor; in fact, worn by the first ten.<br />\nceptionally strong Boys' Latin la- He who laughs last, Jimmy, can and boys had evidently been around.<br />\nthey are to play. Carl Hartman, last<br />\nAs a consequence, the Jays had there never was the slightest doubt<br />\ncrosse team at the Homewood lower ought to! Wolf, wolf!<br />\nyear's number one man, has graduan<br />\nunexpected<br />\nopportunity<br />\nto<br />\ndisplay<br />\nin<br />\nanyone's<br />\nmind<br />\nas<br />\nto<br />\nwho<br />\nwas<br />\nto<br />\nfield last Friday.<br />\nAdler New Maryland<br />\nated, and therefore will not be on<br />\ntheir wares. Outstanding among the fill Herb Seigel's shoes.<br />\nBoys' Latin<br />\nHopkins J.V.<br />\nInterfraternity Softball<br />\nexhibits was Dukehart, who regisStockbridge<br />\nState Ping Pong Champ hand this year.<br />\nG.<br />\nThomas<br />\nLetters Given<br />\nSchedule; Second Week tered four goals. three of them when Coach Gardner Mallonee distributed<br />\nWith numerous veterans of last<br />\nCecil<br />\n.P.<br />\nWebber<br />\nthey counted. He was stoutly aided the letter awards in grand fashion.<br />\nBrooks<br />\nC.P<br />\nWhitelock<br />\nA new Maryland State Table Ten- year's squad returning prospects are<br />\nby Melvin's four assists. Among the There were the usual cheers, laugh- nis champion was crowned recently bright. Heading this list is Captain<br />\nWells<br />\nF.D.Russell Tuesday, April 6.<br />\nDelta Upsilon vs. Alpha Phi Rbo. other starters, Don Naylor, Jack<br />\nGalloway<br />\nS.D<br />\nParker<br />\nhand-shaking (literally when Lou Adler, a Johns Hopkins Brown, smooth stroking shot maker,<br />\nter, and<br />\nDelta Phi vs. Phi Sigma Delta.<br />\nKaufman, with two goaLs, and Dorsey speaking) as each letter-man ad- Senior, won the title at the Baltimore who is expected to be the ace of the<br />\nNaylor<br />\nC.<br />\nTraggis<br />\nYearley toiled nobly.<br />\nmainstays of the team. Others reWilliams<br />\nS.A.<br />\nCoulson Wednesday, April 1.<br />\nvanced to the center table to receive Street tables.<br />\nPhi Kapp aPsi vs. Alpha Ep. Pi.<br />\nking<br />\nF.A.<br />\nLyn<br />\nThe reserves also came in for a his certificate. At the end of this<br />\nAdler defeated the three top seeded turning letter winners are BranPi Lambda Phi vs. Beta Theta Pi. large share of the glory. Bobby short ritual, Seigel, Resin, Cross, players to gain the crown, including ower, Kramer, Lamed, Lamble, Stine,<br />\nLamed<br />\nOH<br />\nGross<br />\nBeeler<br />\nLH.<br />\nSiliman Thursday, April 8.<br />\nMewshaw, and Billy Kempton turned Melvin, Zheutlin, and Tragis were Simpeles, defending champion of last and Radcliffe. With this group as a<br />\nScore by innings:<br />\nin a pair of tallies apiece, while found to be the proud possessors of year, and will be presented with the nucleus, a formidable array should<br />\nSigma Phi Ep. vs. Phi. Alpha.<br />\nBoys' Latin<br />\n0 3 2 0 -5<br />\nTau Alpha Phi vs. Tau Alpha Jimmy Triplett made a promising major H's; while Rubinger, Rosen- Sellmeyer trophy at the association's present itself for action on the lined<br />\nJ.V.<br />\ncourts.<br />\n0 0 0 2 -2<br />\nOmega_<br />\nthal, Green, and Carleton, the so-called banquet in the near future.<br />\ndebut.<br />\n--J. M. K.<br />\n<br />\nJayvee Stickmen<br />\nBow To Boys Latin<br />\n<br />\nTennis Team Takes<br />\nTo Outdoor Practice<br />\n<br />\nac<br />\nin<br />\nth<br />\nar<br />\nrn<br />\nan<br />\nbe<br />\nA<br />\nba<br />\nse<br />\ncc<br />\nwi<br />\nJo<br />\nho<br />\n<br />\nhi<br />\nby<br />\nIn!<br />\nof<br />\n<br />\nof<br />\nfo<br />\nwil<br />\nth 4<br />\nCo<br />\ntiO<br />\n<br />\nthe<br />\nkin<br />\n<br />\nSi<br />\n<br />\nto<br />\nac<br />\nrell<br />\npra<br />\n<br />\n'1<br />\nsity<br />\nat<br />\nsini<br />\nThc<br />\nth.a<br />\npur<br />\ndisc<br />\nstu(<br />\nthe<br />\ntim<br />\nto<br />\n<br />\nReg<br />\n<br />\nA<br />\nCOM<br />\nTUC:<br />\nday,<br />\nnom<br />\nUnii<br />\nWYK<br />\neipa<br />\n1937<br />\n<br />\nA(<br />\nvers<br />\nthis<br />\nhas<br />\nwhei<br />\nten-ii<br />\n<br />\nTIdem]<br />\nunde<br />\nare<br />\nto ei<br />\ntwee<br />\nIs Ill<br />\n<br />\nTI<br />\nof cl<br />\nwill<br />\nof ti<br />\nThe<br />\nwill<br />\nuntil<br />\naddit<br />\nholid<br />\n<br />\nTh<br />\n1938<br />\nruar3<br />\nthroe<br />\nfinal<br />\nthe :3<br />\nbe co<br />\n<br />\n\f", "format": "basic_html", "processed": "READ<br />\n\"The Phi Bete Case\"<br />\npage 2<br /><br />\n3104tts iqopking ,Nrius-Cittrr<br /><br />\nSENIORS<br />\nPay Your June Week Fee<br />\nBefore April 15th<br /><br />\n!tic<br />\nrd-<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 6, 1937.<br /><br />\nVOL. XLI, No. 32<br /><br />\nPRICE 5 CEN'I'11<br /><br />\nthe<br />\nere<br />\nred<br />\nere<br /><br />\nSHILS, ASU HEAD, REJECTED FOR PHI BETE<br />\n•<br /><br />\n:elold<br />\njor<br />\nby<br />\n'he<br />\nlb.<br /><br />\nFour-Fifths of<br />\nStudents Favor<br />\nAssembly Plan<br /><br />\n,tz,<br />\nhn<br />\nryer)ss<br /><br />\nOverhelming Majority Vote<br />\nSpeakers, And Ten<br />\nDollar Fee<br />\n307 CAST BALLOTS<br />\nStatus Quo Apparently Supported; 1 Grad Student<br />\nVotes<br /><br />\np.<br /><br />\nci<br /><br />\nI.<br /><br />\n1<br /><br />\nC<br /><br />\nCCNY Nearly Mars Phi Sig, Phi Alpha Stood<br />\nJay Stick Debut Latest To Join<br />\n14<br />\nWith Early Scores Strike Committee<br /><br />\n'Hullabaloo' Bills<br />\nDue Says Austrian<br />\nRobert Austrian, editor of the<br />\nHullabaloo, announced today that<br />\nall Fraternity, Senior's and Sports'<br />\nbills due must be paid by the end<br />\nof the week, as the book is going<br />\nto press before May 1.<br />\nThe bills may be paid to Henry<br />\nKramer, business manager of the<br />\nHullabaloo, between 12 and 1 in<br />\nthe Hullabaloo office any day now.<br />\n\"Prompt payment by these<br />\ngroups for space will make possible price discounts, which will<br />\nresult in a larger and better year<br />\nbook,\" said Kramer.<br /><br />\nSeventh In Class;<br />\nUndergraduates Make<br />\nScholarship Fraternity<br /><br />\nRoll Of Committee Members<br />\nSwelled To Twelve<br />\nRejected Undergrad Receives Necessary Two Blackballs;<br />\nBy Additions<br />\nNo Discussion Of Case At Meeting<br />\nProgram Now Includes AsAccording To Chapter Officers<br />\nUnexpectedly Strong Gotham<br />\nsembly And 'News-LetClub Scores First<br />\nOfficers For Next Year I Academic Attainment, Good<br />\nter' Campaign<br />\nTwo Counters<br />\nChosen; Alumnus Honored<br />\nMoral Character QualifiWith decision of Phi Sigma Delta<br />\nBy<br />\nMembership<br />\ncations For Election<br />\nAt approximately 3.20 P. M. Sat- and Phi Alpha social fraternities to<br />\nHome Squad Shows Good<br />\nForm In Running Up<br />\n13.3 Tally<br /><br />\nurday last, several hundred spectators scattered about the Homewood<br />\nstands had the uncomfortable sensation of sitting in on history in the<br />\nraw. Which goes to show that you<br />\nnever can tell where destiny will intrude her dirty digit.<br /><br />\nadd representatives to the committee, the total number of organiza-<br /><br />\nThirty-one Johns Hopkins men<br />\nMaurice Shils, seventh-ranking stuwere elected to the local Chapter of dent in his class and chairman<br />\nof the<br />\ntions represented in the coming StuPhi Beta Kappa fraternity, at the American Student Union,<br />\nwas<br />\nreFour-fifths of the Johns Hopkins<br />\ndent Strike Against War next April<br />\nannual business meeting of the frat- jected for Phi Beta Kappa<br />\nat<br />\nstudents favor \"any type of assemthe<br />\nan22nd, had swelled to 12, it was anernity Friday evening, April 2. nual business meeting of<br />\nbly,\" particularly voluntary ones, prethe society's<br />\nnounced after a meeting of the group<br />\nFourteen<br />\nfer speakers twice a month at them<br />\nunder-graduates, eleven Hopkins chapter, Friday, April 2.<br />\nThe occasion for her latest mad at noon yesterday.<br />\nand will pay $10 a piece for June<br />\nSeventy-Two Awarded Fel- prank was the 1937 debut of a highly- At the same time Milton Brotman, graduate students in Philosophy, Fourteen undergraduates were electWeek tickets. Such, in essence, is the<br />\n..<br />\nthree graduate students in Medicine, ed to the society.<br />\ntouted Jay lacrosse team, with its secretary of the committee, issued a<br />\nlowships And Grants In<br />\nresult of the questionnaire conducted<br />\none<br />\nalumnus,<br />\nand two members of the<br />\nShils, who had been nominated<br />\nline-up packed to the eyeballs with<br />\nby the Student Council last week.<br />\ncall for larger representation. Other<br />\nHigher School<br />\nacademic staff make up the list.<br />\nlettermen. The principals were said<br />\nunanimously<br />\nby the executive comThree hundred and seven ballots<br />\nrepresentatives of the great tradition organizations now active in the<br />\nTheir names follow:<br />\nmittee of the society, received two<br />\nwere turned in; 91 from freshmen,<br />\nThe folowing graduate fellowships<br />\nand another group—allegedly ripe strike are the Hullabaloo, the Debat80 from sophomores, 75 from juniors and scholarships have been<br />\nCollegiate Students<br />\nblackballs, the exact number necesawarded for the chopping-block — from the ing Council, the Student Activities<br />\nand 50 from seniors, 1 from a gradRobert Austrian, William Diamond, sary to keep him out.<br />\nfor next year, announced Dr. W. Stull City College of New York. As a con- Committee,<br />\nAbout twenty<br />\nPhi Epsilon Pi, Omicron<br />\nuate student, and 10 unaffiliated.<br />\nWilliam Ambach Eichengreen, Don- members of Phi Beta<br />\ntest, the railbirds looked upon this<br />\nKappa attendTwo hundred and thirty-nine de- Holt, associate professor of history<br />\nDelta Kappa, the Hopkins branch of<br />\nald Eugene Emerson, Harold Free- ed the meeting.<br />\nbill of fare in the same light as a<br />\nclared in the affirmative to the ques- and chairman of the Graduate Scholfree-for-all between Joe Louis and the Y. M. C. A., the American Stu- man, Sidney Richard Gladstein, HarShils is also a member of the Remtion: \"Do you favor an assembly of arship Committee yesterday:<br />\ndent Union, the Young Communist<br />\nJackie Cooper.<br />\nold Murray Goldstein, Joseph Elliott sen Chemical Society, a<br />\nGraduate Fellowships<br />\nany type?\"; 38 replied in the negaformer memWell, the affair started off in an League and the NEWS-LETTER.<br />\ntive; 7 answers were undecided.<br />\nBruce Fellowship in Zoology—LanGreen, Jr., John Simon Kasper, ber of the Hullabaloo staff,<br />\nand the<br />\northodox enough fashion. Hammer<br />\n\"Of course,\" said Brotman, \"this<br />\nThere was one \"ghost vote.\"<br />\ndum Shettles.<br />\nFloyd Katske, Anthony Walter Kraus, recipient of freshmen<br />\nnumerals<br />\nfor<br />\nHimes<br />\npassed<br />\nout<br />\nto<br />\nJack<br />\nKaufman,<br />\nis a catholic enough representation.<br />\n213 For Assemblies<br />\nJr., Sidney Hyman Levy, John Hor- swimming.<br />\nBuchner Scholarship in Education who advanced to the shooting circle.<br />\nVoluntary assemblies are guaranNevertheless there are many imThe panic was on.<br />\nThis is the first time within his<br />\nportant campus groups which have ace Masopust, Bernard Doave Pinck.<br />\nteed an attendance of 213 students, ----Beulah I. Benton.<br />\nDuPont Fellowship in Chemistry—<br />\nGraduate Students In Philosophy<br />\nAt this juncture, Fate picked up not signified their intention of joinwhile 31 flatly refuse to attend them,<br />\nmemory, which goes back \"a good<br />\nthe C. C. N. Y. boys and whisked ing the committee.\"<br />\nand 43 will with reservations. As to S. R. Buc.<br />\nRobert Gaston Deupree, Sally Cary many years,\" said Dr. John C. French,<br />\nChief point for discussion at yes- Fairfax Harrison, John Hall<br />\nthe nature of the assembly, 215 favorMarshall Elliott Scholarship in Ro- them off for a miracle ride, which<br />\nHopkins, librarian of the University and Phi<br />\nleft Jay rooters cold, but which terday's meeting was the projected<br />\ned speakers (an added notation was<br />\nmance Languages for 1936-37—A. E.<br />\nWilliam Randolph Kanne, Alfred Lee Beta Kappa historian, that an underbrought joy to the hearts of visitors peace education campaign during<br />\nusually \"good ones\") while the next<br />\ngraduate nominee has been blackfrom Maryland, St. John's, Mt. Wash- the three weeks left before the Sklar, Charles Francis Squire, Daniel balled. Shils was not discussed bein order of preference was a program Croere.<br />\nGildersleeve Fellowship in Greek-- ington, and other local points of in- strike. 'Whether the campaign will Richard Stull, Winston Da.nae Wal- for the balloting took<br />\ndevoted to \"awards, fraternity tap<br />\nplace, so that<br />\nterest.<br />\ndays, musical performances, etc.\" John D. MeDarmid.<br />\nemphasize the abstract perils of war ters, Earl Reeves Wasserman, Mil- no reason for the action was stated<br />\nIt all began when Norm Melvin or point out the concrete \"hot-spots\" dred Georgia West, George<br />\nFifty-four wanted this, while scattered<br />\nGlaffin Scholarship in Chemistry—<br />\nErnest at the meeting, according to Dr.<br />\nmanifested overmuch enthusiasm on of the present world situation reballoters came out for informal dis- Darnell V. Sickman.<br />\nFrench.<br />\nWright.<br />\ncussions, songs and yells, and variety.<br />\nHarcum Scholarship in Archaeol- the person of a New York defense mained an unsettled question at the<br />\nUndergTads Eligible<br />\nGraduate Students In Medicine<br />\nman. Willie the Jay out home was close of the meeting.<br />\nUndergraduates eligible for memConsidered very significant was the ogy—Eleanor Swallow.<br />\nHenry Frederic Helmholz, Jr., Jos- bership in Phi Beta<br />\nA tentative plan of attack for preHunting Scholarship in Political meditating his crimes on the mournfact that 60% of the ballots<br />\nKappa, as stated<br />\ners' bench, Hal Kaufman, an attack strike program was released how- eph Leo Lilenthal, Jr., Francis Joseph in the chapter constitution, must<br />\nfavored assemblies twice a month. Science—Harold F. Sylvester.<br />\nbe<br />\nPeabody Fellowship in Semetics— man hitherto unknown to fame, ever. Its basic points include:<br />\n\"candidates for the degree of bachThat has been the system during the<br />\nOtenasek.<br />\nturned a nice pass to good account;<br />\n1. An assembly featuring discuselor of arts.\" and \"distinguished for<br />\ngreater part of this year, succeding Abraham Sachs.<br />\nAlumnus<br />\nsion of the peace question, with emRogers<br />\nFellowship<br />\nin Latin—J. E. and C. C. N. Y. was out in front.<br />\nacademic attainment.\" Prof. Hazthe former regime of weekly, compulGuy Everett Snavely.<br />\nAs if that weren't enough, while phasis on two opposing schools of<br />\nleton Spencer, of the department of<br />\nsory ones. Sixty-eight, however, de- A. Crake.<br />\nMembers Of Academic Staff<br />\nScott Scholarship iun Greek—Rich- Melvin was spending another peni- foreign policy—those of collective<br />\nEnglish, and secretary of Phi Beta<br />\nsire them once a week and 40, a sintent moment among the spectators, security and isolationist neutrality.<br />\nRobert Dudley Fowler, James Kappa, stated that the two requireard Suffern.<br />\ngle assembly once a month.<br />\n2. An active editorial and educa- Franck.<br />\nStack Scholarship—Henry C. Smith co-captain Gottfried shot a pass to<br />\nments for admission were scholarConformity to existing conditions<br />\nfirst-attack George Lenchner. And, tional campaigns on the part of the<br />\nwas further endowed by overwhelm- (Psychology).<br />\nOf the members of the faculty ship and good moral character. Eli(Continued on page 4, column 3)<br />\nNEWS-LETTER.<br />\nVogeler Fellowship in Archaeology<br />\nnewly elected<br />\ning approval given June Week and<br />\nProfessor James gible undegraduates are awarded the<br />\nFranck has been associated with the key in the following manner prethe price of $10 for the latter party. —William McDonald.<br />\nGraduate Scholarships<br />\nOut of 305 voting on the query \"Are<br />\nPhysics Department since 1935. Dr. scribed by the chapter constitution:<br />\n1. A subcommittee of the executive<br />\nyou in favor of a June Week?\" Archaeology:<br />\nRobert D. Fowler, of the Department<br />\nJohn A. Alexander.<br />\nonly 44 failed to write \"Yes.\" Conof Chemistry, joined the faculty last committee—the committee on underCharles H. Reeves.<br />\nsiderably less interest was shown<br />\nyear. Dr. Guy E. Snavely, the only graduate investigation- -selects a reaconcerning the fee, but from 166 Botany:<br />\nHopkins alumnus elected to the local sonable number of those students who<br />\nRex. M. Webster.<br />\nvoting 144 declared that $10 was<br />\nchapter this year, is President of Bir- have led their class scholastically.<br />\nChemistry:<br />\nthe top price.<br />\n'News-Letter' Reporter Finds Biology Faculty Busy Discov- mingham-Southern College, and took The basis for selection is entirely<br />\nJ. P. English, Paul Vichl, C. E.<br />\nSpeaking for the Student Council,<br />\nhis A.B. at the Johns Hopkins in scholarship.<br />\nering Causes Of Population Decline<br />\nDonald Emerson, secretary, said, Messer, J. J. Mitchell, R. G. Shepherd,<br />\n1901; his Ph.D. in 1908.<br />\nCommittee Review<br />\n\"Serious interest was shown by prac- B. L. Ritz, B. Phillips, Irene Stark,<br />\n2. The executive committee reviews<br />\nIn Flour Beetle<br />\nAlumni members of the fraternity<br />\ntically all of those who voted on this J. F. Baxter, B. Witten.<br />\nare chosen on the basis of special the names presented it by the subBy MORRIS A. VVESSEL<br />\nquestionnaire. The response was as Education:<br />\ncal of certain other insects. It goes distinction after graduation. Colleg- committee and, in general unanimousHarriet Wells.<br />\nWhy do populations increase and through a life cycle of egg, larval, iate and graduate students are elect- ly accepts the nominations, unless a<br />\ngratifying as could be expected, when<br />\ndecline? What are the biological pupal and adult stages. The time ed to Phi Beta Kappa at the Johns candidate is known not to fulfill the<br />\nyou see how many questions were English:<br />\nRowland Evans, Albert Murphee, phenomena which are responsible for necessary for the development of the Hopkins during the final year of their character requirements. The comasked. The response to the Honor<br />\nWlolfinger, Orville Linck, these changes in population? What adult from the egg has been found study.<br />\nSystem ones are being studied and Joseph<br />\nmittee is charged with recommendcauses long and short life?<br />\ntabulated. They are of diversified George Sanderein, Varley Lang.<br />\nAre to vary considerably with regard to<br />\nNewly elected members to the ing those who \"in their judgment<br />\nGeology:<br />\nthere any inherited factors in these environmental conditions, such as oldest Greek letter fraternity—found- ought to be elected to Phi Beta<br />\ncontent.\"<br />\nE. Chondonette Norris, Marjorie problems? These are the problems temperature, nutrition and humidity. ed at William and Mary College in Kappa\" and to present at the annual<br />\nWoodberry.<br />\nin which the Department of Biology About fifty days is the time neces- 1776—will be initiated on April 30, meeting the names of those whom<br />\nGerman:<br />\nof the Johns Hopkins School of Hy.. sary for an egg to develop into an at the new Johns Hopkins Club on they consider worthy of this honor.<br />\nRalph Collins, Walter Ade.<br />\ngiene and Public Health, located at adult, under conditions consisting of on the Homewood campus. The an3. The 1000 or so members of the<br />\nGreek:<br />\nWolfe and Madison Streets, are pri- a white flour culture, fifty per cent nual dinner of the chapter will be held Hopkins chapter are invited to attend<br />\nDonald Doakkey.<br />\nmarily interested.<br />\nhumidity and twenty-seven degrees the same evening, with Professor Leo the annual meeting. Usually, Dr.<br />\n\"British<br />\nCorporation<br />\nFinance\"<br />\nHistory:<br />\nThis article will be devoted to the Centergrade. The adult life lasts for Wlolman of Columbia University as French said, about twenty show up.<br />\nShows Research In<br />\nFranklin Spiker, Frederick Hay- work being done by Dr. Thomas a year and a half, or often longer.<br />\nBallOting is anonymous, and two<br />\nguest speaker.<br />\nPreference Shares<br />\n(Continued on page 3, column 2)<br />\nPark, Associate in Biology, and Mr.<br />\nOfficers of the chapter for 1937- blackballs are sufficient to reject a<br />\nB. A. Schneider, graduate student in<br />\nConditioning<br />\n38 were elected as follows: Dr. Lewis nominee. Normally the chapter acThe Johns Hopkins University<br />\nBiology, who are now studying the<br />\nIt has been known for many years H. Weed, president; Dr. George H. cepts the judgment of the executive<br />\nPress has recently issued a study of Fireside Discussion To Have<br />\nphysiological aspects of the growth that when organisms are kept in the Barnett, vice-president; Dr. George H. committee. Dr. Spencer explained.<br />\nearly preference shares by Dr. G. E.<br />\nShaffer<br />\nAs<br />\nLeader<br />\nand decline of population in labora- same culture medium for some time, Evans, Jr., secretary; and Dr. RichTomorrow<br />\n(Continued on page 3, column 1)<br />\nEvans, Jr., of the Political Economy<br />\ntory controlled cultures of the com- this medium is \"conditioned.\" In ard M. Haywood, treasurer.<br />\nDepartmen. \"British<br />\nCorporation<br />\nDr. G. Wilson Shaffer, Director of mon flour beetle Tribolium confusum. some cases this conditioning favorFinance 1775-1850, A Study of Pref- Athletics<br />\nDr. Notestein To Speak<br />\nat the Hopkins, will be the<br />\nably influences the growth of populaerence Shares,\" is the culmination of leader<br />\n\"Y\" Nominates Four<br />\nat the Fireside Discussion<br />\nFlour Pest<br />\nToday At Hygiene School<br />\ntion, and in other cases it causes a<br />\nDr. Evans' research in England re- group<br />\ntomorrow afternoon at 4.15<br />\nThis beetle is found in flour sup- decline of population. In the case<br />\nFor<br />\nOffice<br />\nPresident<br />\nOf<br />\ngarding the stock issues of industrial p.m. In<br />\nLevering Hall. The topic to ply houses and does considerable dam- of this beetle, conditioning causes a<br />\nDr. Frank W. Notestein, lecturer<br />\ncompanies during the Industrial be discussed<br />\nis the \"Relation of Rec- age to stored flour, and for many decrease in population, in fact, in<br />\nLawrence Hanawalt, H. H. Lloyd, at the School of Public and InternaRevolution.<br />\nreation to Mental Health.\" Dr. Shaf- years has been carefully studied by time, causes a virtual extinction of Otto Philips and Charles Swartz were tional Affairs at Princeton UniverThe<br />\nauthor's<br />\nprevious<br />\nwork fer, who received his<br />\ndoctorate in the United States Department of the organism. It is the cause of this nominated for president of the Hop- sity, will be the DeLamar lecturer at<br />\non stock financing and preference phychology, is part<br />\nauthor of sev- Agriculture in an attempt to devise population decline that Dr. Park has kins \"Y\" at a meeting of the nomi- the School of Hygiene this afternoon<br />\nstock had been in regard to American eral texts on the<br />\nsubject.<br />\na method of controlling its devas- been especially interested in.<br />\nnating committee held last week. at 5 P.M. He will speak on \"Differcompanies. To fully understand this<br />\nLists have been posted in Levering tating activity. It is easly cultivated<br />\nOther nominations included: for sec- ences in the Fertility of Important<br />\nDr. Evans found it necessary to in- Hall and at<br />\nthe post office bulletin In the laboratory, since all the necesretary, Robert Bauer and Hammond Classes of Population.\" The lecture<br />\nDevour Eggs<br />\nvestigate British finances and stocks, boards, and students<br />\nare asked to sary equipment consists of containers<br />\nOne of the extraordinary features Brown; and for treasurer, Henry will be held in the auditorium of<br />\nmany types of which were taken over sign up immediately.<br />\nThe group is and flour of a standard consistency.<br />\nthe School of Hygiene, on Wolfe<br />\nof Tribolium is the fact that the adult Blucher and Boyd Frey.<br />\nby early American companies.<br />\nlimited to 20 students.<br />\nThe beetle has the life history typiElections will be held on Monday, Street.<br />\n(Continued on Page 3, Co1.2)<br /><br />\nHolt Announces<br />\nGrad Scholarships<br /><br />\nPopulation Growth and Decline<br />\nStudied At School of Hygiene<br /><br />\nPress Issues Evans<br />\nStock Shares Study<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 6, 1937<br /><br />\n2<br /><br />\nOlje 3obn5 ji)optlins<br /><br />\nImportant Medical Problem<br />\nImportant problems today face the whole medical<br />\nprofessions and students aspiring to enter that field.<br />\nThe students on the one hand ask themselves \"Just<br />\nwhat, scholastically and otherwise, is required of a pre-<br /><br />\nOn The Literary Horizon<br /><br />\n23rd Psalm<br />\nStudent's Style<br /><br />\nthe tongues of the district, and, dazed<br />\nIn the \"Journal of Social Philoso- and uncomprehending, are tried and<br />\nfound guilty. To her guilt is given<br />\nmedical school?\" This question is asked anxiously, for phy\" for January of this year, there<br />\nthe added weight of her nationality.<br />\nprospects of acceptance at any medical school are far appeared an estimate of the popu... $2.00<br />\n1.<br />\nSubscription per<br />\nMr. Hilton is an author supremely<br />\nlar book, \"Man the Unknown,\" by<br />\n$2.50<br />\nfrom bright for the average student.<br />\nBy Mail<br />\nAlexis Carrel, doubly interesting be- adapted to such a story. His ability<br />\nThe doctors of today voice the queries \"Are the best<br />\nActivities Council,<br />\nRemit subscription fees to Treasurer, Student<br />\nof its merit and its authorship. to portray a retiring, sincere person,<br />\ncause<br />\nUniversity.<br />\nmen being taken into medical schools?\" and \"Are the<br />\nRemsen Hall, Postotlice, Johns Hopkins<br />\nThe article was written by Dr. H. with complete sympathy, and to avoid<br />\npre-medical and medical school curricula so arranged as<br />\nS.<br />\nJennings, Henry Walters Profes- the extremes both of ridicule and 2.<br />\nPostollice<br />\nthe<br />\nat<br />\n1909,<br />\nto develop the best possible doctors?\"<br />\nEntered as second class matter December 3,<br />\nNovember 3, 1579.<br />\nCongress,<br />\nof<br />\nAct<br />\nof Zoology at the Johns Hopkins sentimentality, is equalled by few<br />\nsor<br />\nthe<br />\nunder<br />\nMd.,<br />\nnaltimore,<br />\nin<br />\nIn an article in the New York Times Magazine of<br />\nUniversity, and presents another authors of this or any day. The<br />\nexcept during exam- April 4, entitled \"The Doctors Diagnose Their Own viewpoint on the best-seller of popu- harshest notes in his book, of which<br />\nPublished semi-weekly from October to June,<br />\nuudeigraduates of the Johns Case\" it is stated that there are many faults to find with<br />\nby<br />\nperiods<br />\nholiday<br />\ncollege<br />\nand<br />\nination<br />\nlar biology. The article is entitled there are quite a few, are very quiet 3.<br />\nHopkins University.<br />\nthe young medical school graduate of today. The<br />\n\"Biology and Social Reform,\" and ones---almost as thought he apoloauthor, Esther Everett Lape, states:<br />\ncomprises an authoritative and care- gised to his characters. In this book,<br />\nEDITORIAL STAFF<br />\n-Chief<br />\nEditor-in<br />\nview<br />\nthe<br />\ndoctors<br />\nfor<br />\n-- .-___. .<br />\nsolid<br />\n\"There<br />\nis<br />\namong<br />\nsupport<br />\n-fully<br />\ndocumented series of questions, the two main characters may be said<br />\n__<br />\n—<br />\n.<br />\nFinkel<br />\nStanley<br />\nEditors<br />\n_<br />\nJames Morrow, David Caplan<br />\nraised by the fundamental premise to live, but only as if in memory of<br />\nmedical<br />\nis<br />\nbetter<br />\nmedicine<br />\nto<br />\nEditor<br />\nroad<br />\nbetter<br />\nmain<br />\nthe<br />\nthat<br />\nSports<br />\n—________<br />\n_ ...______._.— —<br />\nBernard D. Pluck .<br />\nJr..----_Arriststst Mangaing Editors education (the notable advances of the two decades are of the book—that through the Sci- an old man.<br />\nBenjamin Rout, Wethered Barron,<br />\nThey are both common<br />\nAssistant Sport: Editor<br />\nences of Life we may arrive at better<br />\n4.<br />\n. .. .. _ ..— —<br />\nHarold Zheutlin<br />\n—Columnist<br />\ninto<br />\nmedimen<br />\ngetting<br />\nright<br />\nthat<br />\nand<br />\nduly<br />\nrecognized)<br />\nenough<br />\ntypes<br />\nas fictional characters<br />\nlaws for human conduct and relaPaul Berge ._________—______—<br />\nGoldsmith,<br />\nJewett<br />\nFinkelstein,<br />\ncal schools is an even sharper problem than balancing tions. The arguments are clearly pre- go, and yet they retain perhaps more<br />\nReporters—Max Iskowitz, Nathaniel<br />\nLeonard Rubinger,<br />\nHoward Reizenstein, Julian Adler, Carl Resin,<br />\nRosenthal,<br />\nLester<br />\nthe curriculum.\"<br />\nsented, and sound, to a layman, well- Individuality than the great individKrieger,<br />\nMorris Wessel, Arthur Katz, Martin<br />\nDiggs, William BurMurray Kempton, Victor Victoroff, Charles<br />\nThe question of what is wrong with our present sys- chosen. Anyone who has jointed the ual of the book, the wife, Jessica.<br />\nArnold Glantz, Joe<br />\nford, J. C. Handelsman, Mal Boshnack,<br />\ngroii pof thinkers which sets this<br />\nAlperstein,<br />\nMilton<br />\nMillberg,<br />\nIrving<br />\nAnd yet, despite all this, there is 5.<br />\nSacks,<br />\nSamovar, Seymore<br />\ntem of medical education is quite aptly answered by anbok up as a theme, should make it a a little<br />\nBaum.<br />\nZenas<br />\nstretching of the credulity.<br />\nother quotation from the same article.<br />\npoint to read the commentary of Dr. There are a few<br />\nBUSINESS STAFF<br />\nspots where the<br />\nManager<br />\nBusiness<br />\n__<br />\n\"Few medical men would want to return to the old- Jennings.<br />\nWilliam 13. Kempton______L_______<br />\nreader is asked to accept something<br />\nBusiness Manager<br />\nnt<br />\n______—_—____—_Assista<br />\nMelville Locker<br />\nas altogether natural and right,<br />\nAdvertising Manager time medical education; many, however, are dubious of<br />\nMR. HILTON AGAIN<br />\nWm. C. Erlanger____________<br />\nCirculation Manager<br />\n___<br />\n_________<br />\nthe young \"super-scientist\" which the modern system<br />\nThe past weeks saw the publica- which jarrs, even if softly, upon his<br />\nGerald Willen<br />\nManager<br />\nOffice<br />\n---Howard Linkoff ....._ .___________ __ _<br />\nout. It is not certainly, that tion of another book by James Hil- feeling of probability and continuity. 6.<br />\nCopy and Filing Manager tends they think, to turn<br />\nNathaniel Soifer _____________<br />\nthe young graduate of the present has too much science ton, which coincided almost exactly Also, in sustaining the soft touch, it<br />\n--but rather that he has not acquired enough science to with the general release of the photo- has become in some spots almost<br />\nADVERTISING SY<br />\n........TED FOR NATIONAL<br />\ngive him the integrating power that will make his sec- play from his earlier work, \"Lost too light, and the writing lacks depth<br />\nService, Inc.<br />\nNational Advertising<br />\ntional information effective. Too often, some medical Horizon.\" The new novel, \"We Are in a number of passages, particularly<br />\nCollege Publishers Represestatiae<br />\nNEW YORK. N.Y.<br />\nfeel, the younger men have accumulated bits of Not Alone,\" (Little, Brown and Co., having to do with the moving and uncritics<br />\n420 MADISON AVE.<br />\n- SAN FRANCISCO<br />\nCHIC 160 • BOSTON<br />\n• 9<br />\ninformation bearing on methods rather than a power to Boston, $2.00) returns from the usual ending. Perhaps it is that the<br />\nPORTLANE<br />\nLOS ANGELES<br />\nrealm qf gigantic phantasy, into prologue robs the story as such of<br />\nsense clinical problems as a whole.\"<br />\n1437<br />\nMcmber<br />\ntg36<br />\nof more simple, and therefore a great part of its drama—yet the<br />\nthose<br />\nWhile the undergraduate school cannot, without being<br />\nmore<br />\ncharming whimsy and people who are moving in the story<br />\ngenuine,<br />\none-sided, give the student the amount of science needed,<br />\nstory is simple—and should have had no prologue, and<br />\nThe<br />\nsentiment.<br />\nDistributors at<br />\nit should be able to give him the integrating power menin<br />\nthe<br />\nforshadowed<br />\nprologue—a should be an intensely affected as<br />\ntioned above. At the Hopkins the senior examination<br />\nsmall<br />\ntown<br />\ndoctor<br />\nEnglish<br />\n,almost though nothing had been told.<br />\nconsists of questir ns which attempt to ascertain whether<br />\nThe book will enjoy a sale, due in<br />\nin his<br />\nunbelieving<br />\nsave<br />\nunassuming,<br />\nhis<br />\nfrom<br />\nthe senior taking the examination has received<br />\nMember Of The<br />\nsome measure to the earlier work<br />\na<br />\nwork,<br />\nin<br />\nis<br />\nnet<br />\nof<br />\ncaught<br />\ncircumASSOCIATION<br />\nINTERCOLLEGIATE NEWSPAPER<br />\nscientific studies more than just the bare facts. This<br />\nstances surrounding the death of his already mentioned--\"Lost Horizon.\"<br />\nOf Middle Atlantic States<br />\nis all well and good and places the Hopkins at a higher<br />\nwife, and hanged for it, in the best To compare the two would be very<br />\nlevel than most undergraduate schools, yet it seems a<br />\nEnglish manner. The ending coin- difficult. They are unlike in type,<br />\nTUESDAY, APRIL 6, 1937<br />\ncurious thing when we find out that the student is given<br />\ncides with the beginning of the World and the first was an unquestioned<br />\na list of books to read in order to help him pass this<br />\nwriting,<br />\nof fanciful<br />\nWar, so that there is given an op- masterpiece<br />\nexamination.<br />\nportunity for a very masterful sym- Whereas the second is quiet and reIt appears that the four years of study alone do not bolism at the end, hidden under the served. To take an earlier comparBeta Kappa has a<br />\nThis is no denial that Phi<br />\nprepare the student, that the courses he takes gives him details of the trial and the execution. ison in his works, we return to \"Goodserious student under- only the bare facts and omit the integrating power. This<br />\nweight and vital influence on<br />\nThe central character, Dr. New- by Mr. Chips,\" or \"Without Armor.\"<br />\nmembership. It is the is distinctly a flaw in our system of education. It is the come, is jolted from the comparative The latter falls short by comparison,<br />\ngraduates who look farward to<br />\nthose who are the same thing, on a smaller scale perhaps, which is being seclusion of his life in the old cathe- while the other—a very short novel<br />\nsingle token of recognition given to<br />\nhave a justifiable protested against in the medical school. We see, there- dral town by the call to attend a ----almost a study—has still the charm<br />\nWe<br />\nscholastic leaders of their class.<br />\nfore, that forward strides taken in pre-medical education carnival dancer — a German girl— of originality, and the moving underconcerned with its<br />\ninterest in the Hopkins chapter. We are<br />\nwill help solve the problem.<br />\nwho has been hurt. They find in each statement at its best, which is perbe elected<br />\nproceedings; we are anxious that students<br />\nthe simple tenderness which haps the source of the chief charm<br />\nother<br />\nWith improvement in curricula there also should be<br />\nqualifications.<br />\ntheir<br />\nto<br />\nboth<br />\nhave<br />\nbeen denied—he by a of this contemporary English novregard<br />\ndue<br />\nwith<br />\nand<br />\nfairly<br />\na greater standardization of medical school requiretypical shrew of the period, to whom elist. \"Good-by, Mr. Chips,\" is still<br />\nthe<br />\nof<br />\nhistory<br />\nwill<br />\nschools<br />\nthe<br />\nmedical<br />\nat<br />\nin<br />\nacceptances<br />\nthe<br />\nthat<br />\nso<br />\nrare<br />\nments<br />\ncase,<br />\nTo judge fairly this<br />\nhe was married through his own lack the example of its type which even<br />\nwe must keep be based not at all on courses taken, but upon scholarHopkins Chapter of Phi Beta Kappa,<br />\ninitiative — she by the circum- its author will find difficult to equal,<br />\nof<br />\nusually<br />\ncharacteristics<br />\nother<br />\nand<br />\nthe<br />\npersonality,<br />\njust what can ship,<br />\nstances<br />\nof a brutal life. But when the if we are to be permitted the liberty<br />\nclearly in mind the issues involved and<br />\naccepted as a basis for judgment. This step would<br />\nfor future ones.<br />\nis<br />\nwife<br />\nfound dead, they are trans- of referring any author constantly<br />\nbe done for the present case as well as<br />\npre-medical<br />\nthe<br />\nfor<br />\nuncertainty<br />\nof<br />\neliminate a great deal<br />\nformed into lovers, and then to to his masterpiece.<br />\nChap- students and would certainly be a progressive step.<br />\nBeta<br />\nthe<br />\nof<br />\nmembers<br />\ntwo<br />\nthe<br />\nIt is obvious that<br />\n—W.B.B.<br />\nmurderers, in a very few hours, by<br />\nexercised their<br />\nThe problem of what men to accept at medical schools<br />\nter of the honorary scholastic fraternity<br />\nadversely is a serious one and requires very considerate thought.<br />\nlegal and constitutional rights in voting<br />\nthis. But It does seem, though, that the young super-scientist,<br />\ndeny<br />\ncan<br />\none<br />\nNo<br />\ncandidate.<br />\none<br />\nthis<br />\nagainst<br />\ncommittee,<br />\nexecutive<br />\nwho has only an ability to remember many isolated<br />\nit is equally factual that the<br />\nfindings facts, does get too far in comparison with his actual<br />\nthe<br />\napproved<br />\nunanimously<br />\nhad<br />\nafter discussion,<br />\nacademic records. worth. The elimination of some of these would also be<br />\nof the subcommittee on undergraduate<br />\nRecent appointments of chapter<br />\nFraternity men aren't exempted<br />\nthe officers and an improvement.<br />\nof<br />\njudgment<br />\nthe<br />\nIn other words, in<br />\nofficers<br />\nfor next year are as follows:<br />\nfever.<br />\nhouse-cleaning<br />\nSpring<br />\nfrom<br />\nCommittee,<br />\nfive members who constitute the Executive<br />\nGaunt,<br />\nthorPresident; Ivins, Vice-Preshouse<br />\ntheir<br />\nof<br />\nhad<br />\nhonor<br />\nK.A.'s<br />\nThe<br />\nthe<br />\nof<br />\n\"worthy<br />\nall fifteen were considered<br />\nident;<br />\nFrommelt,<br />\nvacation.<br />\nSecretary; Ahroon,<br />\nthe<br />\nduring<br />\ncleaned<br />\noughly<br />\nKappa.\"<br />\nBeta<br />\nelection to Phi<br />\nRecorder;<br />\nLittleton,<br />\nEaster<br />\nfor<br />\nTreasurer; Molscheduled<br />\nwas<br />\nare<br />\ntea-dance<br />\nA<br />\nmembers<br />\nNow according to the constitution,<br />\nare<br />\nThey<br />\nloy,<br />\nArchivist<br />\nLibrarian;<br />\nconsiderations.<br />\noff<br />\nCoady, Sercalled<br />\nbe<br />\nto<br />\nhad<br />\nit<br />\nbut<br />\nSunday,<br />\ntwo<br />\nof<br />\nchosen on the basis<br />\n(2) good<br />\nbecause the work wasn't finished. geant at Arms.<br />\n(1) distinguished academic attainment and<br /><br />\nt WS<br /><br />\nLetter<br /><br />\nLOCAL NOTE<br /><br />\nCoeDeo,<br /><br />\nThe Phi Bete Case<br /><br />\nGREEK LETTER NOTES<br /><br />\nCONTEMPO<br />\nOMMENT RARY<br /><br />\nScholastically, there can be no dispute as to the qualithe<br />\nfications of this man; he ranked number seven in<br />\nleaders<br />\nacademic<br />\ndefinitely<br />\nconsidered<br />\ngroup of fifteen,<br />\nCommittee.<br />\nby both the sub-committee and the Executive<br />\nP B K is<br />\n(for<br />\ncondition<br />\nessential<br />\nSo the first, and most<br />\nfulfilled.<br />\ncertainly<br />\nis<br />\nfraternity)<br />\nscholastic<br />\nhonorary<br />\nan<br />\nthe<br />\nAs to moral conduct we need only consult any of<br />\nto<br />\nacquaintances<br />\nor<br />\n-students<br />\nfellow<br />\nhis<br />\nfaculty or<br />\nestablish beyond doubt his moral worthiness.<br />\nBecause of the lack of discussion on this particular<br />\ncase, grave and serious suspicions and conclusions are<br />\nproduced. It is a shame that this student, after a<br />\nfull college career of distinguished academic attainment<br />\nshould not have even been given benefit of discussion.<br />\nIt is an injustice to him and an indirect slap in the face<br />\nat the judgment of the Executive Committee.<br />\nStudents, like U13, are unable to understand the rejection when we consider the qualification necessary and<br />\nthe qualifications possessed by this undergraduate. Because of the lack of any discussion or any charges, it is<br />\nmade to seem likely that outside factors had intervened.<br />\nBut what we are interested in is what to do about it.<br />\nFirst let us say that this case demands reconsideration.<br />\nYes, we are aware that the chapter constitution does<br />\nnot provide for such a procedure. But action can be<br />\ntaken if the chapter meets again and examines carefully<br />\nall possibilities.<br />\nThere is also the matter of a recurrence of the<br />\npresent unfortunate situation. It is clear that some<br />\nreform in the method of selecting Phi Beta Kappa members is needed. We suggest either a two-thirds or<br />\nmajority vote.<br />\nOur opinion in no way constitutes an indictment of<br />\nthe Hopkins chapter of Phi Beta Kappa. We are more<br />\nconvinced than ever of the high calibre and fair-mindedness which characterized all officers and members whom<br />\nwe interviewed.<br />\nBut what we strongly condemn are the conditions<br />\nwhich allowed such a case as this to arise.<br /><br />\nBiblical Fame)<br />\nThe Prof. is my shepherd; I shall<br />\nnot want. He maketh me to sit<br />\nthrough long lectures: he snappeth me out of still slumbers.<br />\nHe readeth over my papers: he<br />\nleadeth me on the path of scholarship for my own sake.<br /><br />\nWhile this was going on, Guy Stark,<br />\n* * «<br />\nout-going Number I of the chapter,<br />\nAt a recent meeting of the MaryMore than just a few seniors are turning into the was vacationing in Florida. Sounds land Alpha chapter of Sigma Phi<br />\nhome stretch of their College careers with a fear of bad since Sid Finley, the treasurer, Epsilon, the following officers<br />\nwere<br />\npossible failure tugging at their hearts. After sixteen<br />\nwas also in the South recently.<br />\nelected<br />\nand<br />\nJohn<br />\ninstalled:<br />\nSause,<br />\nyears of preparation they are ready to step off into<br />\nBill Witte, grad student and Tau President; Robert Dowell, Vice-Presthe world, and the questions they are feeling are, prepident; James Griffin, Secretary; Clark<br />\naration for what? If they fail to get a job, aren't they Beta Pi, was initiated last week.<br />\nfar behind non-college men? Will college prove to be<br />\n\"Bottle\" Buttner and \"Hon\" Thom- Ewing, Treasurer; James Lyle, Hisa spring-board or a sand pile? And particularly, what as<br />\nhave really been behind the eight torian; Benson Boss, Guard; Paul<br />\nare their chances for success?<br />\nReigner and Thomas Considine, first<br />\nball<br />\nlately.<br />\nHalf and half, to the last question, answers John R.<br />\nand<br />\nsecond 1VEarshalls.<br />\nTunis, Harvard, '11, in his book \"Was College Worth<br />\nmembers<br />\n541<br />\nthe<br />\nof<br />\nare<br />\nBeta<br />\nsurgsurvey<br />\npractising<br />\nboys<br />\nThe<br />\nrecent<br />\na<br />\non<br />\nSigma Phi Epsilon won the BowlWhile?\". Based<br />\nof his graduating class of 25 years ago, Mr. Tunis pre- ery these days—on defenseless bull ing League, for which it will receive<br />\ndicts that 25 years from now half of us will be dis- frogs. The operating surgeon was J. a cup.<br />\nappointed in our life's work!<br />\nTalbott Littleton, III, with all manPhi Ep takes pleasure in announcThe book, an attempt to evaluate higher education on<br />\nthe basis of accomplishments and failures of the au- ner of assistants. One on the hind ing the pledging of Bernie Rome, one<br />\nthor's own classmates, repeatedly raises the question, legs, one on the fore-legs, one giving of the new mid-season freshmen.<br />\n\"Is it all worth while?\" While the writer leaves that ether, and the rest kibitzing. The ob- Bernie is a graduate of Forest Park<br />\nfor the reader to decide, there is no doubt as to what he ject was to get out a kidney, sew the High School, where he established<br />\nthinks. Worth while for some, the impression he leaves<br />\nfrog back together and keep him fame as a track star.<br />\nis that College is a poor investment for many more.<br />\n• * •<br />\nalive. The incentive was two dinners<br />\nStarting with what he calls a fair cross-section of<br />\nSaturday<br />\nnight,<br />\nApril 3, Phi Eps<br />\nif<br />\nthe<br />\nfrog<br />\nlived<br />\nat<br />\na<br />\nleast<br />\nday<br />\nand<br />\nthat<br />\nreveals<br />\nTunis<br />\nMr.<br />\nproduct,<br />\ncollege<br />\nthe American<br />\ntheir<br />\nannual subscription<br />\nwhile a few have achieved \"Who's Who,\" about 100 are a half. Luck has favored the frog threw<br />\nSpring formal at the Phoenix Club.<br />\nactually dependent upon others---some even on relief! and it's still hanging on.<br />\nA big time was had by all, since all<br />\nThe cnly note in any way encouraging is his estimated<br />\n* • •<br />\nmembers had dates and the 'wolfing'<br />\nclass income average of $4,450—a good living income.<br />\nDuring the spring vacation Johns was left entirely up to the nonThe campus \"big-shot\" is no sure bet for success, adds<br />\nMr. Tunis as he discloses how several of the poorest Hopkins Betas spread out over the members who attended. Facilities<br />\nwere also arranged for drinks to be<br />\nand relatively obscure boys of his class have become its old U.S. Some went north to Sarasold at the bar, or setups were to<br />\nmost distinguished members. Another interesting point toga, one went south to Florida, one<br />\nbe had at the tables.<br />\nis his deduction pertaining to the question of marrriage.<br />\nwent to Indiana, and others to the<br />\nHe says a college man \"cut his chances of unhappiness<br />\nBig City, New York.<br />\nin two when he marries\" a college woman.<br />\nAfter a three week illness of quite<br />\n*<br />\n*<br />\na<br />\nin<br />\nwritten<br />\nWhile?\"<br />\nTunis'<br />\n\"Is<br />\nWorth<br />\nMr.<br />\nCollege<br />\nserious nature, Morel Harmel has<br />\nThe latest arrival is a pup, from once more returned to school to<br />\nclear and easy style and for the edification of the college man, should have a great appeal to every under- which big things are expected. It make up missed studies. He will regraduate, as well as for the senior on the homestretch. is a Great Dane. It suffers already sume his position and duties as newly<br />\nfrom consumption—of too much food. elected Prater Superior of Phi Ep.<br />\n--The Ursinus Weekly<br /><br />\nAgain, Why College?<br /><br />\nfl<br />\nTv<br /><br />\nYea, tho he handeth out the blue<br />\nexam books, I shall fear no evil:<br />\nfor I have Hand-Shaked; they<br />\nmarks and thy criticisms they<br /><br />\nThou readest my paper before me<br />\nin the presence of mine school<br />\nmates: thou pointests out my<br />\nerrors; my fears are abated.<br />\nSurely good luck and mercy have<br />\nfollowed me all the days of my<br />\nschool life, and I shall be accepted in the Med. School of<br />\nHopkins.<br />\nAmen!<br /><br />\n(4<br /><br />\nreqi<br /><br />\nfrighten me.<br /><br />\nPP<br /><br />\nan<br />\nwhc<br />\nince<br />\nwea<br />\nmor<br />\nkno'<br />\nther<br />\nthe<br />\nan<br />\ned,<br />\nof<br />\nmig<br />\nblac<br /><br />\nthis<br />\nmee<br />\n\"I<br />\nblac<br />\nsaid<br /><br />\nPUBLIC<br />\nNOTICE<br />\nTO ALL<br />\nPIPE<br />\nSMOKERS<br /><br />\nAssociated Cotieeiate Press<br /><br />\nmoral conduct.<br /><br />\n(With Apologies to David of<br /><br />\nand bewildering claims made for<br />\npipe tobacco make it our duty,<br />\nwe believe, to publish this<br />\nstraight-forward statement.<br />\nFor 60 years we have been<br />\nmaking fine pipe tobaccos,<br />\nwhich we guarantee against<br />\ntongue bite. Now for the first<br />\ntime we divulge the methods<br />\nwhich have made this guarantee possible.<br />\nPipe tobaccos may be<br />\nrushed through a plant at a<br />\ngreatsaving in expense. Every<br />\ntobacco expert knows this.<br />\nOr they may be made by<br />\nthe slow, patient method used<br />\nin Edgeworth. This method<br />\nwe call Process-Aging. There<br />\nare twelve required steps,<br />\neach under laboratory control.<br />\nIt takes 4 to 7 times as long<br />\nas might seem necessary.<br />\nThis prevents tongue bite<br />\nas no other method will. We<br />\ninvite you to prove this statement to your own satisfaction<br />\nat our risk. You are the only<br />\njudge.<br />\nMHE CONFLICTING<br /><br />\nNOTE: There are three kinds of<br />\nEdgeworth for you to choose<br />\nfrom:<br />\n1—Edgeworth Ready-Rubbed—a<br />\ncool,long-burning tobacco preferred<br />\nby seasoned smokers.<br />\n2—Edgeworth Plug Slice—for the<br />\nsmoker who likes to crumble the<br />\ntobacco in his hands until it's just<br />\nright for him.<br />\n3—Edgeworth Jr.—the kY11140 tobacco also Process-Aged, but cut<br />\nfor a milder, more free-burning<br />\nsmoke.<br /><br />\nPlease accept 501e Gold Plat d<br />\nfor only 100 when you buy II<br />\nMerely send inside white wrap., time<br />\nany tin of Edgeworth with your<br />\naddress and 10# to Lams &amp; lire.<br />\nDept. 'On<br /><br />\nLARUS &amp; BRO. CO.<br /><br />\nD]<br />\n\"I<br />\nthe<br />\nKap<br />\nnot<br />\na p(<br />\niousl<br />\nship.<br />\na co<br />\nan u<br />\nbers<br />\nof ti<br />\ntwoshou<br />\nsimp<br />\nIt<br />\ntutio<br />\nfifth:<br />\nrecoi<br />\nat tl<br />\nbers.<br />\nDr<br />\nin L<br />\non u<br />\n\"0<br />\ngrad<br />\nI chc<br />\nuncle<br />\nfor<br />\nThes<br />\ncomr<br />\ndoub<br />\n\"I<br />\ndidal<br />\ntheir<br />\nnow<br />\nthe (<br />\nsee<br />\nclass<br />\nBeta<br />\nDr<br />\nman<br />\nuate<br />\n\"T<br />\ned or<br />\nship<br />\nfrom<br />\nship,<br />\nfled;<br />\nhid<br />\nattac<br />\nsure<br />\nin bi<br />\nthose<br />\ntingu<br />\nand<br />\nthat<br />\nagair<br />\nstate<br />\nbut<br />\nanon,<br />\nfeet,<br />\nthey<br /><br />\nthing<br />\nco<br />\nprey(<br />\ncases<br />\nshbul<br />\nPhi<br />\nsecor<br />\nthe I<br />\ndidat<br /><br />\nat<br /><br />\nTt<br /><br />\n3<br /><br />\nHOMEVVOOD, BALTIMORE, APRIL 6, 1937<br /><br />\nPraises Georgian Simplicity<br />\nEdinburgh Chemist Wu,Editor, ToTalk<br />\nShils, ASU Head Biology Faculty VisitorOf<br />\nJohns Hopkins Club Building<br />\nRejected By Phi Makes Discovery Calls Club House One Of Finest In Country; Attend Speaks Before ACS At SCA Conference<br />\nOpen House Held For Faculty<br />\nKendall To Talk Tonight Speaker Prominent As Editor<br />\nIs Studying<br />\nMarch<br />\n29th<br />\nBeta Kappa Department<br />\nOn<br />\nOn \"Liquids And<br />\nAnd National YMCA<br />\nCauses Of Population<br />\n300<br /><br />\nHad Ranked Seventh In<br />\nClass; Among 15<br />\nNominated<br /><br />\nDecline In Beetle<br />\n(Continued from Page 1, Col. 4)<br /><br />\nBy VICTOR VICTOROFF<br />\nA casual visitor to the new Alumni.<br />\nFaculty Building is immediately<br />\nstruck by the all-pervading whiteness<br />\nand cleanliness of the edifice, both<br />\ninside and out. Clad in its mantle<br />\nof Georgian simplicity, it commands<br />\nrespect. One need not look long at the<br />\nbuilding without realizing the beautiful sentiment manifest in this memorial created for and offered to the<br />\nmemory of William A. and Charles<br />\nL. Marburg.<br /><br />\nbeetles eat their own eggs. It can<br />\nbe easily seen that this might have<br />\nan important effect upon the populaTWO BALLOTS DECIDE tion growth and decline. However,<br />\nDr. Park found that those beetles<br />\nTwo Blackballs Sufficient To kept in fresh<br />\nflour devoured twice as<br />\nmany eggs as those beetles which<br />\nRule Him Out Despite<br />\nwere kept in the conditioned flour.<br />\nRecommendation<br />\nThis could not account, therefore, for<br />\na decline in population of the organ(Continued from Page 1, Col. 6)<br />\nThe club house, one of the finest<br />\nNo explanation of a blackball is isms kept in the conditioned culture<br />\nof its kind in the country, occupies a<br />\nrequired, but Dr. French agreed that medium.<br />\nsecluded site on the north side of the<br />\na member of the Phi Beta Kappa,<br />\nLowers Fec,undity<br />\nBotanical Gardens at Homewood. Its<br />\nwho had reason to consider a nomHowever, in studying fecundity,<br />\ninee unworthy because of a character that is the production of eggs, Dr. Georgian architecture qualifies it to<br />\ntake its place among the rest of the<br />\nweakness, should consider it his Park found that those beetles<br />\nkept<br />\nmoral obligation to make that fault in fresh flour which was charged buildings on the campus.<br />\nInside, the smell of fresh paint<br />\nknown to his confreres and to ask regularly produced ten times as many<br />\nthem to join with him in maintaining eggs as those kept in conditioned stil tinges the air with a not-unpleasthe society's standards and rejecting flour. As far as fertility is con- ant odor. All is new, glistening, and<br />\nan unfit candidate. Dr. French add- cerned—that is the capacity for these white. Imported rugs and beautiful<br />\ned, however, that he could conceive eggs to develop----he found that it was paintings in perfect taste are charof a situation in which a member approximately the same In both cases. acteristic of the house's sumptuousmight dislike to state his reasons for Therefore, it may be seen, that this ness. Complete and carefully-selected<br />\nmodernistic furniture in all the rooms<br />\nblackballing.<br />\ndecrease of fecundity in the condiof the house give unsurpassable<br />\nThe reason for the blackballs in tioned cultures would have a drastic<br />\ncomfort, and lend a particular digthis case was not brought out at the reduction effect upon the population<br />\nnity of their own, compatible with<br />\nmeeting, Dr. French stated.<br />\ngrowth.<br />\nthe environment and general tenor<br />\n\"I think it is unfortunate that the<br />\nFurthermore, Dr. Park found that of the building as a whole. Impresblackball system is used,\" Dr. French the larval metamorphic time required<br />\nsive in their simplicity are the armsaid.<br />\nby those beetles kept in conditioned chairs next to the tables in the<br />\nDr. Spencer stated:<br />\ncultures was about one-third longer dining-room.<br />\n\"I oppose the blackball system for than that of those kept in the fresh<br />\nThe structure is arranged ideally<br />\nthe simple reason that Phi Beta flour, and he also found that there for the purpose for which it is inKappa is not a social club. You can was an increased mortality rate in tended. There are spacious dining<br />\nnot blackball on the principal that the metamorphoses of those kept in rooms and a comfortable lounge,<br />\na person might not fit in harmon- conditioned flour.<br />\ngame rooms and reading rooms. It<br />\niously with the rest of the memberFrom this investigation, it is clearship. I think the method of allowing ly shown that the reduction in fecun•<br />\na couple of blackballs to disqualify is dity and the increase of metamorphic<br />\nan unwise method of selecting mem- time period and metamorphic morbers to the Phi Beta Kappa. I am tality are of primary importance in<br />\nof the opinion that no more than a the population decline of Triboliurn.<br />\ntwo-thirds !vote of thole preseint<br />\nThe importance of this work is<br />\nshould be required, perhaps even a<br />\nthat, if these factors of the condisimple majority.\"<br />\ntioned culture medium may be shown<br />\nIt was pointed out that the constito be the most essential ones in the<br />\ntution could be amended by a four- explanation<br />\nof the population decline<br />\nfifths vote and that a meeting for<br />\nof Tribolium, there may be further<br />\nreconsideration of Shils could be called<br />\nevidence to the effect that similar facat the written request of five memtors are responsible for the population<br />\nbers.<br />\ntrends in many other organisms, and<br />\nDr. Richard M. Haywood, associate<br />\nthese factors may be pre-eminent in<br />\ncommittee<br />\nthe<br />\nof<br />\nin Latin, member<br />\nthe shaping of the course of all<br />\non undergraduate investigation, said:<br />\npopulations.<br />\nunder\"On the sub-committee for<br />\ngraduate students, Dr. Blumberg and<br />\nchose Mr. Shils as one of the fifteen<br />\nundergraduates academically eligible<br />\nfor membership to Phi Beta Kappa.<br />\nThese were given to the executive<br />\ncommittee, none of whom raised any (Continued from page 1, column 2)<br />\ndoubt as to thir qualifications.<br />\nden, Sidney T. Matthews, Jean C.<br />\n\"I regret the incident, for the can- Sask.<br />\ndidates were obviously leaders of Latin:<br />\ntheir class. Although the charter<br />\nR. E. Peg-ram, C. D. Malbone,<br />\nnow specifies that character is one of Charles Buck.<br />\nthe qualifications, I should prefer to Mathematics:<br />\nsee the leaders of the graduating<br />\nAbraham Seidenberg, John Knudclass automatically elected to Phi son.<br />\nBeta Kappa.\"<br />\nOriental Seminary:<br />\nDr. Albert E. Blumberg, chairDavid Panitz.<br />\nman of the committee on undergrad- Philosophy:<br />\nuate investigation, stated:<br />\nIrving P. Orems.<br />\n\"The Phi Beta Kappa key is award- Physics:<br />\ned on the two-fold ground of scholarMichael Emmert, Milton Benson,<br />\nship and character. It is obvious that William Bright, Thomas Schreiber.<br />\nfrom the point of view of scholar- Political Economy:<br />\nship, Mr. Shils is perfectly well qualiJohn Loftus, Meno Lowenstein,<br />\nfied; consequently, the rejection of Donald Jones, Helen Potter.<br />\nhi3 candidacy constitutes a serious Political Science:<br />\nattack upon his character. I feel<br />\nJohn 0. Tabler, Donald Rubensure that this attack is not concurred stein.<br />\nin by the overwhelming majority of Psychology:<br />\nthose who know him and his dinFlorence Jennings.<br />\ntinguished record in the classroom Romance Languages:<br />\nand on the campus. The very fact<br />\nH. E. Creave, W. L. Greene, 13.<br />\nthat the two persons who voted Lichtenstein, T. J. Murphy.<br />\nagainst him lacked the courage to Zoology:<br />\nstate and defend their convictions,<br />\nMargaret Hoover, Raymond Berry,<br />\nbut chose rather to hide behind the Ray Watterson, Margaret Deringer.<br />\nanonymity of a secret ballot, in effect, invalidates whatever objection<br />\nthey may have had.<br />\n\"If Phi Beta Kappa is to mean anything it is necessary to take steps<br />\nat once to rectify this injustice to<br />\nTwo prizes of one dollar each in<br />\nprevent the recurrence of similar soda shop merchandise will be awardcases in the future. Such steps ed to the two Hopkins students who<br />\nshould include, first, the election to submit the best group of suggestions<br />\nPhi Beta Kappa of Mr. Shils, and, for the improvement of Levering<br />\nsecond, changes in the procedure of Hall, according to Martin Levine,<br />\nthe Hopkins chapter in electing can- chairman of the Levering Hall Comdidates.\"<br />\nmittee.<br /><br />\ncontains, also, a large smoking room<br />\nand refreshment as well as locker<br />\nrooms and showers. One wing of<br />\nthe building is reserved for the use<br />\nof women members.<br />\nOn March 29th an \"Open-House\"<br />\nwas given for members of the faculty. Dinner was served to 100 of the<br />\n300 present on that evening. On the<br />\nfirst of April a second informal<br />\ngathering, this time of the Alumni,<br />\nwas held. 114 persons partook of dinner on that occasion. Later, refreshments were served. No formal dedication has as yet taken place.<br />\nMrs. Grace C. Fisher, manageress<br />\nof the club, said, \"The club is for the<br />\nbenefit of faculty and alumni. Meals<br />\nwill be served at moderate prices to<br />\nmembers, and every effort to make<br />\nthem comfortable here will be<br />\nmade.\"<br />\nThe club is not open to the public,<br />\nand its use is restricted wholly to<br />\nmembers and their guests. Membership is open to all men and women<br />\nwho are members of the teaching<br />\nstaff of the University, and of the<br />\nJohns Hopkins Hospital, and to all<br />\ngraduate students and alumni of the<br />\nUniversity. The other requirement<br />\nis that an application for admission<br />\nmust be accompanied by the endorsement of two club members.<br />\nThe Board of Governors plans to<br />\nkeep the club open for eleven months<br />\nin the year. The officers are: President, R. G. Merrick; vice-president,<br />\nG. E. Barnett; secretary, W. B. Kouwenhoven, and treasurer, A. C. Howard.<br /><br />\nSolutions\"<br /><br />\nStudent Secretary<br /><br />\nDr. James Kendall, professor of<br />\nchemistry at the University of Edinburgh, will speak before a meeting<br />\nof the Maryland branch of the Amer:<br />\nican Chemical Society at 8.15 P. M.<br />\nthis evening in room 58, Rowland<br />\nHall. His subject will be \"Liquids<br />\nand Solutions.\"<br />\nDr. Kendall, born in Surrey, England, on June 30, 1889, was educated<br />\nat the University of Edinburgh,<br />\nwhere he took his doctor's degree in<br />\n1915. Having decided to do graduate<br />\nwork, he then went to the Nobel Institute in Stockholm for a brief period.<br />\nHe was a member of the Faculty of<br />\nColumbia<br />\nUniversity from 1913<br />\nto 1926, when he left to become professor of chemistry at Washington<br />\nSquare College.<br />\nHe remained in America until<br />\n1928, when he went to Edinburgh to<br />\ntake the position he now holds.<br />\nHis speech will be a summary of<br />\nthe papers and discussions of the<br />\nFaraday Society which met last September in Edinburgh.<br /><br />\nY. T. Wu, former National Secretary of the Student Division of the<br />\nY. M. C. A. an editor-in-chief of the<br />\nChinese Division of the Associated<br />\nPress, will be the guest speaker at<br />\nthe Student Christian Association<br />\nMeeting of Maryland Colleges at Levering Hall tomorrow. Students from<br />\nGoucher, Maryland State Teachers<br />\nCollege, Morgan College, Maryland<br />\nCollege for Women, and Hopkins<br />\nwill take part in the conference.<br />\nAt 4.00, Mr. Wu will lead a Round<br />\nTable discussion for \"Y\" Cabinet<br />\nmembers on \"The Christian Revolution.\" The speaker is one of the<br />\nleaders of the Christian movements<br />\nin the East, and is said to be one of<br />\nthe foremost interpreters of the Chinese movement.<br />\nAt the evening meeting at 7.30,<br />\nMr. Wu will speak on \"My Conception of God.\" The meeting will be<br />\nopen tol all faculty, students, and<br />\nfriends of the University, and will<br />\nbe held at Levering Hall.<br />\nAs editor-in-chief of the Associated Press, Mr. Wu has built up a<br />\ngroup of Chinese writers whose production, during the past few years,<br />\nis regarded as notable and who have<br />\natempted to put forward a comprehensive and coordinated program of<br />\nliterature production, especially for<br />\neducated Chinese youth. His major<br />\ncontributions have been in the field of<br />\ninterpreting the meaning, the discipline and the social implications of<br />\nChristianity.<br /><br />\nSon neborn Will Speak<br />\nTo Biology Convention<br />\nDr. Tracy M. Sonneborn, associate<br />\nprofessor of Zoology at the Hopkins,<br />\nwill be one ofthe guest speakers at<br />\nthe annual Maryland Biology Teachers' Convention, to be held at Hood<br />\nCollege, April 10 1937. He will give<br />\na summary of work done in the field<br />\nof Genetics during the past three<br /><br />\nPhilip Merivale says:<br /><br />\n\"My throat's grateful for Luckies<br />\n— a light smoke\"<br />\n\"In one of the first important parts I<br />\ndid in America, the play called for a<br />\nlong and very trying individual performance. In every scene for five full acts I<br />\nwas on stage talking almost continuously. The strain made itimperative that<br />\nI safeguard my throat and voice. After<br />\ntrying different brands of cigarettes, I<br />\ncame across Luckies. They stood the test<br />\nand for many years now I've enjoyed<br />\nthem. I like the taste of Luckies and my<br />\nthroat is grateful for a light smoke.\"<br /><br />\nHolt Announces<br />\nGrad Scholarships<br /><br />\nphyveva<br />\nl<br />\ne<br /><br />\nAn independent survey was made recently<br /><br />\nPlan Prizes For Levering<br />\nImprovement Suggestions<br /><br />\nTo the members of<br />\nBOH<br /><br />\nfurnish your official fraternity<br />\nor J. H. U. seal and attach it to any of our<br />\nindividual jewelry from $1.00 up.<br />\nQuick Service At<br />\nWe can<br /><br />\n(HK$<br /><br />\nAy<br /><br />\nA(I)<br /><br />\n1,4E<br /><br />\nALI(1)<br /><br />\n(DA<br /><br />\nitorA<br /><br />\n43E11<br /><br />\nManufacturing Jewelers<br /><br />\n.111A<br /><br />\n207 WEST SARATOGA STREET<br />\nPhone Calvert 1300<br /><br />\nKA<br /><br />\nTA II<br /><br />\n6<br /><br />\nca/,<br /><br />\nfnc.<br /><br />\namong professional men and women—lawyers,<br />\ndoctors, lecturers, scientists, etc. Of those who<br />\nsaid they smoke cigarettes, more than 87% stated<br />\nthey personally prefer a light smoke.<br />\nMr. Merivale verifies the wisdom of this preference, and so do other leading artists of the<br />\nradio, stage, screen and opera. Their voices are<br />\ntheir fortunes. That's why so many of them<br />\nsmoke Luckies.You,too,can have the throat protection of Luckies—a light smoke,free of certain<br />\nharsh irritants removed by the exclusive process<br />\n\"It's Toasted\". Luckies are gentle on the throat.<br /><br />\nTHE FINEST TOBACCOS—<br />\n\"THE CREAM OF THE CROP\"<br /><br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br /><br />\nCopyright 11137. The American Tobacco Company<br /><br />\n4<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 6, 1937<br /><br />\nJay Baseballers<br />\nWinBy9-5Score<br />\nAt Towson Field<br /><br />\nDukehart Pushes One Over On C. C. N. F.<br /><br />\nJ.H.U.Hand Ball<br />\nTeam Completes<br />\n36-37 Schedule<br /><br />\nBeat Towson Teachers In<br />\nThe Initial Game<br />\nOf Season<br /><br />\nJays<br /><br />\nCARPER STARTS GAINS<br /><br />\nSEASON SUCCESSFUL<br /><br />\nJays Win By Staging Six<br />\nRun Rally In Eighth<br />\nInning<br /><br />\nRecord In Three Year's<br />\nPlay; 18 Wins. 3<br />\nLosses<br /><br />\nThe Johns Hopkins University<br />\nbaseball team defeated the Towson<br />\nTeachers in its first game last Saturday at the Gilman School by the<br />\nscore of 9 to 5.<br />\nThe Indians scored first in the second inning, but the Hopkins team<br />\nerased that lead in their half of the<br />\nsecond inning and scored again in<br />\nthe third and sixth innings. However<br />\nNormal team took the lead again in<br />\ntheir half of the eighth by scoring<br />\nthree runs and leading 4 to 3. In<br />\ntheir half of the eighth inning the<br />\nHopkins team staged a six run rally<br />\nin which each better got one turn<br />\nat the plate.<br />\nJays Score In 8th<br />\nJohn Carper, Hopkins center fielder, led the attack with three outs<br />\nout of four trips to the plate. It was<br />\nhis hit in the second inning that set<br />\nthe stage for the first run, when<br />\nAlperstein laid down a sacrifice bunt<br />\nto advance Carper to second, and<br />\nCarper scored when Romanofsky<br />\ncame through with a single. Again,<br />\nwhen the Jays were behind in the<br />\neight inning it was Carper's third<br />\nhit that started the six run rally<br />\nwhich meant the victory for Hopkins.<br />\nLen Rubinger was credited with<br />\nthe victory and pitched the full nine<br />\ninnings. He was nicked for nine hits<br />\nand gave ten walks, but struck out<br />\nnine men.<br />\nThe Jays' next opponent will be<br />\nMount St. Mary's team and the game<br />\nis scheduled for this Saturday, at<br />\n3 p.m., probably at the Gilman School<br />\ndiamond.<br />\nThe line-up and score by innings<br />\nfollows:<br />\nJOHNS HOPKINS<br />\nAb. R. H.0. A<br />\n3 1 1 3 0<br />\nRomanofsky, lf<br />\n3 2 2 8 0<br />\nStevens, c<br />\n2 1 0 1 0<br />\nBray'aw, rf<br />\n4 0 1 4 3<br />\nHartke, as<br />\n5 1 2 6 0<br />\nClisham, lb<br />\n2 1 0 0 0<br />\nMilan, 3b<br />\n4 2 3 0 0<br />\nCarper, cf<br />\n2 0 0 4 2<br />\nAlp'ten, 2b<br />\nRubinger, p<br />\n3 1 1 1 3<br /><br />\nThe Johns Hopkins Varsity Handball team ended the season by splitting two games before the Easter<br />\nholidays. After trouncing Western<br />\nMaryland 5-0, the Jay wallmen were<br />\nturned back by the revenge-seeking<br />\nPennsylvania U. Team, 6-1.<br /><br />\nTotals<br /><br />\n28 9 10 27 8<br /><br />\n'110WSON TEACHERS<br />\nAb. R. H.0. A<br />\n2 1 0 3 0<br />\nSokolow, 2b<br />\n5 1 1 2 3<br />\nCrest, ss<br />\n4 0 0 2 2<br />\nBennett, 3b<br />\n5 0 1 3 1<br />\nL,ow'ten, c<br />\n6 0 1 2<br />\nHam'ton, if<br />\n4 2 3 1<br />\nWheeler, cf<br />\n3<br />\nWilliams, cf<br />\n1 0<br />\n4 0 1 8 1<br />\nBudeke, lb<br />\n2<br />\n5 1 1<br />\nSmith, p<br />\n1Weis<br />\n1 0 1<br />\n1 0<br />\n2Gordon<br /><br />\n•<br /><br />\nC. C. N. Y. Bows To<br />\nStrong Jay Squad<br /><br />\nOFF<br />\nand<br />\nN<br />\nBy RED GLA.NTZ<br />\nAPRIL FOOL! !<br />\nIf you've heard this story before,<br />\nit's your own fault. If you haven't,<br />\nhave a laugh at the expense of our<br />\never belittled trainer, Jimmy Benson.<br />\nThe setting—Homewood Field, April<br />\n1, the air resounding with the swish<br />\nof sticks, hickory against heads, and<br />\nthe outbursts of the outsiders. Suddenly a figure drops with an accompanying shriek of agony. . . . Pete<br />\nSwindell is down with a limp leg. . .<br />\nHis head goes from side to side. . . .<br />\nhe's drooling at the mouth.<br /><br />\nContinued from Page 7, Col. 3)<br />\nwhen the Jays came up for air, the<br />\nscore stood:<br />\nC.C.N.Y 2; JOHNS HOPKINS 0<br /><br />\nBasketball Squad Tops Season<br />\n.<br />\njj With<br />\nBanquet At Levering<br />\nLetters Distributed By Coach Mallonee Assisted By Dr.<br />\nShaffer And Prager; Siegel, Rasin, Cross, Melvin<br />\nZheutlin, And Traggis Get Majors<br /><br />\nTrip Terriors<br />\nLose to Penn<br />\n1 -6<br /><br />\n5-0;<br /><br />\nThe Hopkins team previously defeated Penn on the Homewood courts<br />\n5-1. Arnold \"Red\" Glantz supplied<br />\nthe only Jay victory on the Penn<br />\ncourts.<br />\nThe team ended a highly successful season with seven wins and two<br />\nlosses. The team is captained by<br />\nNathaniel Finkelstein and coached<br />\nby Reuben Baer.<br />\nJays Sweep Singles<br />\nIn the first singles match with<br />\nWestern Maryland, Milt Alperstein<br />\ndefeated Joe Dickson 15-11, 15-12 in<br />\na hard-fought match with Alperstein's better condition, giving him<br />\nthe edge.<br />\nDick Pasternak overwhelmed Bill Harston 15-5, 15-6 in<br />\nthe second singles, while Captain<br />\nFinkelstein completed the sweep of<br />\nthe singles by defeating Dan Volkhart 15-8, 15-9.<br />\nIn the doubles, Pasternak paired<br />\nwith Rossett, a newcomer on the<br />\nteam, to beat Johnson and Daly of<br />\nWestern Maryland, 15-8, 15-6. The<br />\nWestminster team forfeited the last<br />\ndoubles matc)11 to Alperstein and<br />\nFinkelstein.<br />\nPasternak Injured<br />\nIn the first singles at Penn, Iry<br />\nMilberg lost a hard-fought match to<br />\nJohn Anderson 21-19, 21-9. The secong singles match was called off after<br />\nSlick Pasternak of Hopkins split a<br />\nfinger bone when leading Rockmore<br />\nof Penn, 18-12. Milt Alperstein lost<br />\na long drawn-out struggle to \"Blimp\"<br />\nWolinsky of Penn 21-15, 21-19 in the<br />\nthird singles. \"Red\" Glantz provided<br />\nthe only Hopkins victory by playing<br />\na great game of ball to turn aside<br />\nWade of Penn 21-16, 21-12. Glantz's<br />\nsuperior speed afoot clinched this<br />\nbattle.<br />\nPenn Takes Doubles<br />\nMilberg and Alperstein lost the<br />\nfirst doubles after winning the first<br />\ngame 21-18, but dropped the next two<br />\n21-17<br />\n23-21. Glantz and Finkelstein bowed in the second doubles<br />\n18-21, 21-15, 17-21.<br /><br />\nIf Coach Kelso Morrill had walked<br />\nin about this time the situation<br />\nwould probably have taken on the<br />\ninterior decorators (bench drapers),<br />\nBy LEN RUBINGER<br />\nelements of straight tragedy. As it<br />\nIt would not have been appropriate reluctantly satisfied themselves with<br />\nwas, the atmosphere around the Jay (page Stanley Prager) to finish off H.'s of smaller proportions.<br />\nOf<br />\nbench was hardly that of high car- the basketball season without hav- course Stanley Q. Prager was preSquad<br />\nPrepares<br />\nFor<br />\nMatch<br />\nnival.<br />\ning had something to eat to top it off. sented with his major letter (little<br />\nWith Swarthmore<br />\nThen Melvin passed to Tommy And so the Basketball Banquet was deserved as it was); but it is interFriday<br />\nDukehart on the crease, and reason held last Wednesday eve within the esting to mention that it required<br />\nwas again triumphant. The rest of stately portals of one of Levering's all the brains and reserve of the AthWith the weather favorable and<br />\nthe story is quickly told. When the upstairs rooms. With Dr. Shaffer act- letic Department (ask Dr. Shaffer) the courts open and in excellent conreturns were in, the Blue Jay's high- ing the part or toastmaster and the to equip the robust laugh-creator with dition, the Blue Jay tennis aspirants<br />\nTotals<br />\n38 5 924 9<br />\nhave taken to the out of doors for<br />\nCoach Dotterweich dashes into the class collection of bric-a-brac was on rest of the group (which included a sweater.<br />\n1Batted for Williams in eighth.<br />\nclubhouse yelling, \"Bens, for Gawd's top by a count of 13-3.<br />\nplayers, managers, and the coach,<br />\nLenny Krakauer and Benny Root their pre-season practices. Until now<br />\n2Batted for Sokolow in eighth.<br />\nBut, if the score was orthodox, the Mr. Mallonee) contributing no little were elected Junior managers for the netmen had been working out in<br />\nsake, it's Pete, he's broken a leg<br />\nJohns Hopkins 0 1 1 0 0 1 0 6 x 9 (the good one)! ! Jimmy gulps, but modus operandi was not. For the<br />\nby way of wise-cracks and \"clean\" next year. The resignation of Prager the gym, perfecting strokes and getTowson Teach. 0 1 0 00 0 0 3 1-5 only for a second, for in the next mo- boys from New York may have been<br />\njokes, a joyful time was had by all.<br />\nleaves the Senior managership wide ting the correct timing.<br />\nErrors--lFtomanofsky, Hartke, Car- nient he has a stretcher in one hand picked as door-mats, but the word<br />\nThe first test for the Blue courtopen. Root and Krakauer are to battle<br />\nSeigel Says Good-bye<br />\nper, Alperstein, Rubinger, Budeke and the proverbial black bag in the \"Welcome\" was absent from their<br />\nit out during the 1937-38 campaign, sters is with the Swarthmore team<br />\nThe<br />\naffair<br />\nwas<br />\nnot<br />\nwithout<br />\nthe<br />\nun(2), Smith, Hamilton. Two-base hits other, and is at the same time utter- persons. Their defense squad sported<br />\nto the loser going the distinction of on the ninth of April, at the Home--Stevens, Wheler. Stolen bases- ing loud reassurance to the world in one of the lustiest collections of avoidable serious moments characwood courts. That is the start of an<br />\nhaving helped for there years.<br />\nteristic<br />\nof<br />\na<br />\nfinal<br />\nbanquet.<br />\nIt<br />\nwas,<br />\n--Stevens, Wheeler.<br />\nStolen bases— general such as \"I'm comin', Pete . . . hatchet-wielders ever seen on the<br />\nextensive schedule which, in addiamong<br />\nother<br />\nthings,<br />\na<br />\nfarewell<br />\ndinner<br />\nBusiness<br />\nMonkey<br />\nbypitcher—By Rubinger (Sokolow); rolling watermelons, the Dumb . . . Homewood terrain. Any attempt at<br />\ntion to teams representing the varto Captain Herb Seigel. Herb, the<br />\nA round of applause greeted \"Mal's\"<br />\nSmith (Stevens). Strike-outs — By Benny, etc.\"<br />\na display of the far-famed Jay passious Maryland institutions includes<br />\nonly<br />\ngraduating<br />\nmember<br />\nof<br />\nthe<br />\nteam,<br />\nenlightening report that Manager<br />\nRubinger, 9; Smith, 1. 2Base on balls<br />\nsuch formidable foes as Duke, LeThe turf literally slides under Jim's ing attack was apt to bring forth was congratulated upon his brilliant<br />\nPrager couldn't count. When all the<br />\n—Rubinger, 10; Smith, 7.<br />\nan<br />\nexhibition<br />\nof<br />\nmob<br />\nviolence,<br />\nwhich<br />\nfeet as he endeavors to reach the<br />\nyear of captaincy; and he in turn ex- playing times of each game were high, Lafayette, Catholic U., and<br />\nWilliam and Mary.<br />\never-suffering Pete. He kneels rev- would have been balm to the soul of pressed his appreciation to the vaadded up, it was found that the conerentity only to be greeted by a grin- the late Dutch Schultz.<br />\nrious players for their cooperation tests ranged from 80-120 minutes,<br />\nSince the first match is so close<br />\nFurthermore, the Gotham attack, and spirit during the season.<br />\nning pan and an unroarous \"April<br />\nat<br />\nhand, the team will not have too<br />\nwhereas a regulation game lasts just<br />\nfor a Northern entry, was not only<br />\nFool!\"<br />\nCarl Resin, one of the most re- 40. Nice going, Stan!<br />\nmuch time to get into top shape.<br />\nIs the joke, however, on Jimmy amazingly well-integrated, but, in ad- markable court performers at the<br />\nNext year's uniforms will be blue However, Coach Hofmeister will<br />\nThe Black and Blue Jay Vee stick- Benson? It's not so certain. How dition, seemed to know how to con- Hopkins in recent years, was elected with gold stripes (Gabardine). Com- want his charges go through their<br />\nthe circle.<br />\nThe to succeed Seigel. The vote was<br />\nmen dropped a 5-2 decision to an ex- sympathetic will he be in the future? duct itself around<br />\nplete sweat suits, latest style, will be paces this week, and then select his<br />\nindividuals for the spots in which<br />\nunanimously in his favor; in fact, worn by the first ten.<br />\nceptionally strong Boys' Latin la- He who laughs last, Jimmy, can and boys had evidently been around.<br />\nthey are to play. Carl Hartman, last<br />\nAs a consequence, the Jays had there never was the slightest doubt<br />\ncrosse team at the Homewood lower ought to! Wolf, wolf!<br />\nyear's number one man, has graduan<br />\nunexpected<br />\nopportunity<br />\nto<br />\ndisplay<br />\nin<br />\nanyone's<br />\nmind<br />\nas<br />\nto<br />\nwho<br />\nwas<br />\nto<br />\nfield last Friday.<br />\nAdler New Maryland<br />\nated, and therefore will not be on<br />\ntheir wares. Outstanding among the fill Herb Seigel's shoes.<br />\nBoys' Latin<br />\nHopkins J.V.<br />\nInterfraternity Softball<br />\nexhibits was Dukehart, who regisStockbridge<br />\nState Ping Pong Champ hand this year.<br />\nG.<br />\nThomas<br />\nLetters Given<br />\nSchedule; Second Week tered four goals. three of them when Coach Gardner Mallonee distributed<br />\nWith numerous veterans of last<br />\nCecil<br />\n.P.<br />\nWebber<br />\nthey counted. He was stoutly aided the letter awards in grand fashion.<br />\nBrooks<br />\nC.P<br />\nWhitelock<br />\nA new Maryland State Table Ten- year's squad returning prospects are<br />\nby Melvin's four assists. Among the There were the usual cheers, laugh- nis champion was crowned recently bright. Heading this list is Captain<br />\nWells<br />\nF.D.Russell Tuesday, April 6.<br />\nDelta Upsilon vs. Alpha Phi Rbo. other starters, Don Naylor, Jack<br />\nGalloway<br />\nS.D<br />\nParker<br />\nhand-shaking (literally when Lou Adler, a Johns Hopkins Brown, smooth stroking shot maker,<br />\nter, and<br />\nDelta Phi vs. Phi Sigma Delta.<br />\nKaufman, with two goaLs, and Dorsey speaking) as each letter-man ad- Senior, won the title at the Baltimore who is expected to be the ace of the<br />\nNaylor<br />\nC.<br />\nTraggis<br />\nYearley toiled nobly.<br />\nmainstays of the team. Others reWilliams<br />\nS.A.<br />\nCoulson Wednesday, April 1.<br />\nvanced to the center table to receive Street tables.<br />\nPhi Kapp aPsi vs. Alpha Ep. Pi.<br />\nking<br />\nF.A.<br />\nLyn<br />\nThe reserves also came in for a his certificate. At the end of this<br />\nAdler defeated the three top seeded turning letter winners are BranPi Lambda Phi vs. Beta Theta Pi. large share of the glory. Bobby short ritual, Seigel, Resin, Cross, players to gain the crown, including ower, Kramer, Lamed, Lamble, Stine,<br />\nLamed<br />\nOH<br />\nGross<br />\nBeeler<br />\nLH.<br />\nSiliman Thursday, April 8.<br />\nMewshaw, and Billy Kempton turned Melvin, Zheutlin, and Tragis were Simpeles, defending champion of last and Radcliffe. With this group as a<br />\nScore by innings:<br />\nin a pair of tallies apiece, while found to be the proud possessors of year, and will be presented with the nucleus, a formidable array should<br />\nSigma Phi Ep. vs. Phi. Alpha.<br />\nBoys' Latin<br />\n0 3 2 0 -5<br />\nTau Alpha Phi vs. Tau Alpha Jimmy Triplett made a promising major H's; while Rubinger, Rosen- Sellmeyer trophy at the association's present itself for action on the lined<br />\nJ.V.<br />\ncourts.<br />\n0 0 0 2 -2<br />\nOmega_<br />\nthal, Green, and Carleton, the so-called banquet in the near future.<br />\ndebut.<br />\n--J. M. K.<br /><br />\nJayvee Stickmen<br />\nBow To Boys Latin<br /><br />\nTennis Team Takes<br />\nTo Outdoor Practice<br /><br />\nac<br />\nin<br />\nth<br />\nar<br />\nrn<br />\nan<br />\nbe<br />\nA<br />\nba<br />\nse<br />\ncc<br />\nwi<br />\nJo<br />\nho<br /><br />\nhi<br />\nby<br />\nIn!<br />\nof<br /><br />\nof<br />\nfo<br />\nwil<br />\nth 4<br />\nCo<br />\ntiO<br /><br />\nthe<br />\nkin<br /><br />\nSi<br /><br />\nto<br />\nac<br />\nrell<br />\npra<br /><br />\n'1<br />\nsity<br />\nat<br />\nsini<br />\nThc<br />\nth.a<br />\npur<br />\ndisc<br />\nstu(<br />\nthe<br />\ntim<br />\nto<br /><br />\nReg<br /><br />\nA<br />\nCOM<br />\nTUC:<br />\nday,<br />\nnom<br />\nUnii<br />\nWYK<br />\neipa<br />\n1937<br /><br />\nA(<br />\nvers<br />\nthis<br />\nhas<br />\nwhei<br />\nten-ii<br /><br />\nTIdem]<br />\nunde<br />\nare<br />\nto ei<br />\ntwee<br />\nIs Ill<br /><br />\nTI<br />\nof cl<br />\nwill<br />\nof ti<br />\nThe<br />\nwill<br />\nuntil<br />\naddit<br />\nholid<br /><br />\nTh<br />\n1938<br />\nruar3<br />\nthroe<br />\nfinal<br />\nthe :3<br />\nbe co<br /><br />"}], "field_media_file": [{"target_id": 39096, "display": null, "description": null, "target_type": "file", "target_uuid": "c7588aca-8570-49dd-9166-3e9cc909b8a0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12774-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12774, "target_type": "node", "target_uuid": "f00f00aa-75e6-49de-9918-3cf1dab44911", "url": "/node/12774"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "53959c60-bfbf-4b60-b4a6-261fad447743"}]}