{"mid": [{"value": 35617}], "uuid": [{"value": "249b699e-4a4a-4a79-b4c2-b69f4e6e2519"}], "vid": [{"value": 35617}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:09:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12164-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:09:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:09:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "...111.11111<br />\n<br />\nnOlikinst31111<br />\nIssued<br />\n<br />\nBaltimore<br />\nc70grP<br />\nPRESS OF STONEBRAKER<br />\n<br />\nFortnightly<br />\n•<br />\n<br />\nBROS., BALTIMORE<br />\n<br />\n\fJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br />\n<br />\nRuenty-fifth Year.<br />\n<br />\nBeginning October 1st, 1900.<br />\n<br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br />\n<br />\nDANIEL C. GILMAN<br />\nWas;H. HowELL.<br />\n<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special-students.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\n<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\nHenry A. Rowhtral.<br />\nIra Reinsert.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam II. Howell.<br />\nWilliam H. Welch.<br />\n.John J. Abel.<br />\nJohn J. Abel,<br />\nWilliam Oskr.<br />\n<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gihlerskt<br />\nKirby F. Smith.<br />\nMaurice Bloomfiehl.<br />\nPaul Haupt.<br />\nlknry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the ''Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br />\n<br />\nEditors.<br />\nFrank Morley.<br />\nIra Remsen,<br />\nBasil L. Gildersleeve.<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Wekh.<br />\n<br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nAmerican Journal of Mathematics:<br />\n<br />\nP. MORLEY,Editor. Quarterly. 4to. Volume XXIII..<br />\nin progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. &Ivo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nStudies from the Biolologicil Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nII. B. ADAMS, Editor. Monthly. 8vo. Series XIX<br />\nin progress. $3 per volume.<br />\nJohns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\n'progress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nJohns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nContributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. IluooKs, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\n\\V. H. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nV in progress. $5 per volume.<br />\nAmerican Journal of Insanity,<br />\nHENRY M. HUED, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nAnnual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students and stating the<br />\nPublished at the<br />\nregulations, etc. of the University. '<br />\nclose ofthe academic year.<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL,. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\n1118LI0GRAPHIA HOPKINSIENSIS. Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications 1n respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br />\n<br />\nA<br />\n<br />\n\fCbe news= Letter. *<br />\nVol. V.<br />\n<br />\nFebruary 7, 1901.<br />\nA BORDER RAID.<br />\n<br />\nthe broad south porch of the farm house,<br />\nONwhere<br />\nearly sunshine streamed through a<br />\nscreen of morning-glory vines, covering the<br />\nwhite weatherboards with distorted tracery and<br />\nflecking her blue calico with spots of light,<br />\nDorothy stood beside a tall old-fashioned churn.<br />\nShe had sent the dasher plunging up and down<br />\nwith a steady chug! chug! that the wood-shed<br />\nand kitchen tossed back and forth between them<br />\nin little echoes,until butter had come,and now she<br />\nstopped to rest. Leaning thoughtfully on the<br />\nlong handle she looked out across the sloping<br />\nbarnyard, over the valley that swam in summer-haze to the blue hills beyond. Behind<br />\nthose hills was Mason and Dixon's line, which<br />\ntwo years of civil war had made bitterly significant as the boundary line ofslavery and rebelllion.<br />\nA turnpike that ran by the house and curled<br />\nround a knoll a little above it, showing at the<br />\nturn a last gleam of dusty white limestone, ran<br />\nstraight to those hills and on into the south.<br />\nFrom this same porch, at the beginning of the<br />\nwar, Dorothy had watched her two brothers<br />\nmarch away with the village company over that<br />\nturn of the road while the squeak of fifes and<br />\nthe rub-a-dub of Fent Johnson's drum sounded<br />\nacross the pasture. A year before that Frank<br />\nhad reined in his horse at the same spot to whve<br />\nhis hand to her befote he galloped away toward<br />\nVirginia.<br />\nEvery summer since he had left the village to<br />\nmake his home with a southern uncle, Frank<br />\nhad ridden across country to visit his relatives<br />\nin the little valley. Dorothy remembered how<br />\nin that year, the year her mother had died, they<br />\nwalked out in the moonlight the evening before<br />\nhis departure past the churchyard where the<br />\nstones looked like piles of shining snow, to the<br />\nold beech at the school-house with F. & D.<br />\ncarved in boyish jackknife cuts on its smooth<br />\nbark.<br />\nPerhaps he would never come again, thought<br />\nDorothy, now deep in reverie, remembering the<br />\n<br />\nNo.<br />\n<br />\nharsh words she had heard in his father's house<br />\nwhen the news spread through the neighborhood<br />\nthat Frank Walters had joined the rebel army.<br />\nDorothy's thoughts had strayed far from her<br />\nchurning and were wandering in troubled loyalty<br />\ninto the region south of the blue haze. Now her<br />\nreverie was broken rudely. Over the brow of<br />\nthe hill rode a horseman, then another, and a<br />\nthird ; and three Union scouts came at a tired<br />\ntrot down the road. Mr. Miller, Dorothy's<br />\nfather, was already at the gate, waiting to ask<br />\nfor news and to invite them in.<br />\nThe day before a warning had come that there<br />\nwas danger of a raid across the border, and prudent farmers had been hiding provisions and<br />\ndriving their cattle up into remote wood-lotsfor<br />\nsafety. Indeed, some had thought that Mr.<br />\nMiller himself was in danger, should the raiders<br />\ncome, for he had been known before the war as<br />\nan ardent and outspoken abolitionist and a<br />\nhelper of runaway slaves. Some alleged violations of the rights of non-combatants in the<br />\nSouth had given rise to vague threats against<br />\nhim that had reached his ears, but he was unwilling to leave his daughters alone, and so<br />\ngave little heed to his neighbors' advice to flee.<br />\nThe scouts brought news that a raiding party<br />\nwas out in force a few miles to the southwest<br />\nfollowing an uncertain course. They themselves<br />\nwere on their way to a point of vantage behind the town. One of their number held the<br />\nhorses ready for instant mounting, while his<br />\ncompanions laved their dusty faces at the pump<br />\nand sniffed savory odors of frying ham from the<br />\nkitchen. Little Jennie, Dorothy's sister, climbed<br />\nthe sheep-pasture hill from which she could see a<br />\nmile up the road, and stood sentinel while they<br />\nrested.<br />\nJust as Dorothy with wooden bowl and salt<br />\njar turned to go.to the spring-house, and black<br />\nSusan showed her shining face at the kitchen<br />\ndoor to say,\"Most ready, boys!\" Jennie came<br />\nrunning and screaming. The disappointed soldiers seized canteen and knapsack, tumbled into<br />\ntheir saddles, and were off in a moment.<br />\n<br />\n•<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThey were hardly out of sight when the head<br />\nof a column of troopers with dingy gray uniforms<br />\nand slouch hats appeared at the turn of the road.<br />\nSusan dropped her kettles and pans and scrambled in ashen terror to a hiding place in the garret, for she was an escaped slave. Mr. Miller,<br />\nafter lingering almost too long,ran at Dorothy's<br />\nearnest entreaty to conceal himself in an empty<br />\ncorn-crib. A moment later the yard was full of<br />\nrebel soldiers, and a young officer was asking<br />\ncourteously enough for Mr. Miller.<br />\nDorothy, secretly wondering at his honest face<br />\nand easy manner, answered, \"I don't know<br />\nwhere he is, and I certainly should not tell you if<br />\nI did.\"<br />\nThe officer smiled.<br />\n\"I suppose a little fib is excusable under the<br />\ncircumstances,\" he said, \"but we feel pretty sure<br />\nhe's here. I must ask you to remain where you<br />\nare while my men search the place.\"<br />\nFrom her seat on the trellised stoop, Dorothy<br />\ncould see the door of the crib in which her father<br />\nwas hiding, and she watched it anxiously as a<br />\ndetail of men went toward the outbuildings.<br />\nThe next moment she was soothing Jennie, who<br />\nhad been startled into frightened screams by the<br />\nsudden appearance of a soldier in the room in<br />\nwhich she had taken refuge. The officer reassured them, and ordering a soldier to see that<br />\nthey were not molested, retired for a conference<br />\nwith his guides.<br />\nMeanwhile the search went on. It was orderly<br />\nenough at first; but the drink from a looted tavern had made the men reckless, and they were<br />\nsoon engaged in wanton pillage. Drawers and<br />\nchests were broken in search for valuables and<br />\ntheir contents strewed about. The searchers<br />\nspread devastation in the larder, and brought<br />\nruin to the kitchen, garden and spring-house.<br />\nDorothy gave little thought, however, to the<br />\nsounds of destruction about her. She was anxiously watching the corncrib. Her face paled a<br />\nlittle as she saw a tall raider enter the door and<br />\ndisappeared, within, and her heart sank in hopelessness. The crib was empty and the search<br />\nwas so thorough that there was no hope that<br />\nher father would not be seen.<br />\nPresently the soldier appeared again, alone,<br />\nslammed the door behind him and called to his<br />\n<br />\ncompanions. Dorothy looked in joyful wonder<br />\nas the searching party came leading a number of<br />\nhorses to report that Mr. Miller could not be<br />\nfound. She would have wondered no less had<br />\nshe been able to see what went on all this time<br />\nbehind the weather-stained boards of the crib.<br />\nThrough the cracks in the crib Mr. Miller had<br />\nwatched the soldiers and had heard drunken<br />\nthreats of \"hanging to the nearest tree.\" He<br />\nhad heard Jennie's scream, and filled with a horrible fear, he could hardly keep from rushing out,<br />\nhelpless as he was. Then the door had opened,<br />\nand a tall young raider walked to the hogshead<br />\nbehind which he was hiding and looked down<br />\nupon him. Mr. Miller rose to surrender himself,<br />\nwhen to his surprise the soldier pressed him<br />\ndown with, \"Keep still, man, keep still!\" Then<br />\nwalking quickly to the door he called to his companions, \"He's not in here, boys; come on, let's<br />\ngive it up!\" And the party went away leaving<br />\nMr. Miller surprised and puzzled at his strange<br />\nescape.<br />\nOld Susan's fear had sharpened her wits, and<br />\nthe search of the house had been equally fruitless.<br />\nDorothy stepped back into the doorway as the<br />\ntroopers crowded again into the yard and prepared to mount. Before her on the stoop Jennie<br />\nstill sobbed, and the house dog Plato at her feet<br />\ngrowled at the intruders. She heard a step in<br />\nthe hall behind her, and a strangely familiar<br />\nvoice said softly,\"Dorothy!\"<br />\nShe turned,startled,and saw a dusty,sunburned<br />\nsoldier. It was a moment before she recognized<br />\nhim.<br />\n\"Oh! Frank,\" she gasped, and she laid a restraining hand on Plato's nose.<br />\n\"Hush,\" said he, they mustn't see me talking<br />\nto you. Tell your father to get out of that crib<br />\ninto the woods,for we're coming to look for him<br />\nagain. Don't forget me, Dorothy. Good bye!\"<br />\nThen he walked rapidly out past her and<br />\njoined his comrades. The soldiers lingered a moment caring for their horses, and then at a few<br />\nsharp words of command,with a rattle of accouterments and a thunder of hoofs the column disappeared behind a cloud of dust on its way<br />\ndown the valley.<br />\nNext day the raiders came back on their way<br />\nsouth. Both Mr. Miller and Susan had found<br />\n<br />\n;f<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nsafer hiding places, and wisely; for a squad of<br />\ntroopers had surrounded the house at night<br />\nthinking he might return.<br />\nDorothy stood in the door to watch the long<br />\nprocession go by. First came a great herd of<br />\ncattle and a string of captured horses, and then<br />\nthe long column of soldiers laden with all sorts<br />\nof plunder. Her glance singled out a trooper in<br />\ntattered gray who dared give her only a look or<br />\nrecognition. At the bend in the road he turned<br />\nin his saddle to look back,and then the dust hid<br />\nhim from her sight. She watched till the column<br />\ndisappeared over the hill, and with a little song<br />\non her lips, turned again to her work.<br />\nF.<br />\nsr Of OF<br />\n<br />\nTHE ANNUAL FEED.<br />\nfourth annual \"Feed,\" held to celebrate<br />\nTHEHopkins<br />\nathletic victories, proved a decided success. One cause of this was the fact that<br />\ncertain novelties were inserted in the programme<br />\nwhich, heretofore, has consisted chiefly of burlesque athletic \"stunts,\" as sack-races and<br />\nchicken-fights. Friday night's exhibition dispensed with these hackneyed pastimes, and while<br />\nmuscle received its proper place in the exercises,<br />\nart and science were also encouraged. Musical<br />\nart, in the \"Submarine Band ;\" figurative art,<br />\nin the living picures; and decorative art, in the<br />\nblackened-glove contest: science,in the hypnotic<br />\nexhibition. These inovations emanated chiefly<br />\nfrom the resourceful brains of Billy Maddren<br />\nand Physical Director Mackdermott.<br />\nThe programme opened with speeches by Dr.<br />\nRemsen, President Gilman and Dean Griffin. Dr.<br />\nRemsen recounted the athletic achievements of<br />\nHopkins during the past year. Dr. Gilman in<br />\nhis address told the audience how he once informed a delegation of Harvard professors that<br />\nthe honor of having H. U. after one's name was<br />\ngreatly increased by prefixing a j.<br />\nThe surprise of the evening was sprung upon<br />\nthe audience when Boozer's Submarine Band,<br />\nclad in white duck, and barten<br />\npardon<br />\nus, we mean white jackets, filed out upon the<br />\nstage. Then the house was served up a rich<br />\nmusical treat. Instrumental solos and trios, interspersed with full orchestra (later the orches-<br />\n<br />\n3<br />\n<br />\ntra was fuller) pieces were encored again and<br />\nagain. The Dean said: \"Never has music moved<br />\nme so before,\" while we observed that President<br />\nGilman was even further moved—(all the way<br />\nout of the building). The living pictures were,<br />\nfor the most part, of a strictly moral nature,<br />\nwith the exception of one, concerning which,<br />\nAnthony Comstock, and the anti-vice crusaders<br />\nmight have taken issue.<br />\nPete Moore posed as the Greek discus thrower,<br />\nand it is a pity some of his fair admirers could<br />\nnot have heheld him clad in spotless white.<br />\n\"Abbie,\" as the Lacrosse Player; Hoffman<br />\nand England, as the Runners; and Sayler, as<br />\nthe Foot-ball Player, were loudly applauded.<br />\nHaughton was \"a perket lady.\" HiS Carmencita \"stunt\" was excellently rendered, and if he<br />\ncan get into shape WC would advise him to start<br />\nin life as a chorus-girl. When he appeared on the<br />\nstage several students in the audience were<br />\nheard to remark : \"Is'nt she natural; looks ex;\" but here the Boozer band<br />\nactly like<br />\ndrowned the name. The Hopkins Banjo Club<br />\nfurnished some admirable \"ragtime\" music,<br />\nand then Maddren kept everyone interested in<br />\nan exhibition of hypnotism. This was the feature of the evening. After putting his negro<br />\nsubjects through all manner of odd tricks, he<br />\ndemonstrated the genuineness of the performance<br />\nby allowing one of the audience to stick a pin<br />\ninto the hand of a hypnotised person without<br />\ncausing the latter any pain. Mr. Maddren has<br />\nbeen studying the subject of hypnotism about<br />\nfour months, and in that short time has become<br />\nrather familiar with it, as was demonstrated<br />\nFriday night.<br />\nNext, the crowd adjourned to the cage and<br />\nwatched Zaza and Sapho, otherwise Snowden<br />\nand Hopper,decorate each othar's anatomy with<br />\ncharcoal. There was not time to weigh out the<br />\namount of charcoal deposited on each, so the<br />\nmatch was called a draw.<br />\nIn an exciting,three-heat obstacle race, Winternitz came off victorious. Owing to the lateness<br />\nof the hour the tug-of-war between the Junior<br />\nand Freshman classes was called off. \"Back to<br />\nthe Gym\" was the signal then given, and there<br />\nthe \"feed,\" consisting of chicken-salad, rolls,<br />\nice cream, cake and coffee was served.<br />\n<br />\nPRESS OF ISTONEBRAKER BROS., BALTIMORE.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\ntbe 14ews.Zetter.<br />\n<br />\nPublished Fortnightly during the University Year<br />\nStudents Of THE JOHNS<br />\n<br />\nby the<br />\n<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nFEBRUARY 7, 1901.<br />\n•<br />\nSubscription $1.50 per<br />\n<br />\nEditor in Chief,<br />\n<br />\nyear.<br />\n<br />\nJo cents a single copy.<br />\nNORMAN HOVER, 1901.<br />\n<br />\n.<br />\n<br />\nJOHN M. HOOKER, 1901.<br />\n<br />\nAssociate Editor in Chief,<br />\n<br />\nWILLIAM 13, HILL, 1902.<br />\nBERN C. HILL, 1902.<br />\nSOL STROUSE, 1902.<br />\n<br />\nNews Editors,<br />\n<br />\nf JOHN<br />\n<br />\nA. SLEMONS, 1902.<br />\n.YMAN C. MURPHY, 1902.<br />\n<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\n<br />\n.<br />\n<br />\n.<br />\n<br />\nAssistant Business Manager,<br />\n<br />\n.<br />\n<br />\nJOHN M. HANDEL, 1901.<br />\n<br />\nAUBREY PHARR E, JR., 1902.<br />\n<br />\nAddress all articles, communications, etc., to<br />\n<br />\nNORMAN BOYER.<br />\n<br />\nbox 96,johns Ifopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\n<br />\nJOHN M. BANnim, box 94, J<br />\n<br />\nH. U.; or box 30, Medical School of<br />\n<br />\nJohns Hopkins Hospital.<br />\n<br />\nwhich arranged and carried<br />\nTHEoutCommittee<br />\nthe program of the Feed last Friday<br />\nnight deserves the hearty congratulation of the<br />\nwhole University for the able manner in which<br />\nthe whole affair was conducted. Everything<br />\nwent off smoothly and pleasantly, and there<br />\nwas not a hitch. The orderly way in which the<br />\nentertainment proceeded in every respect was in<br />\ndelightful contrast to some of the bargain-counter rushes that have been witnessed in past<br />\nyears.<br />\nThe Feed was undoubtedly the best that has<br />\never been given, and it is to be hoped that the<br />\nfinancial success will be as great as the artistic,<br />\nThe Committee showed much originality in their<br />\nselection of attractive features of entertainment,<br />\nand great credit is due Messrs. Maddrcn and<br />\nMackdermott, who planned and superintended<br />\nthe effective presentation of the various numbers.<br />\nThe Banjo Club responded to the appeal for aid<br />\nin a gratifying way,and the hypnotic exhibition<br />\nvvas the finest thing yet.<br />\nw w<br />\nMANAGERS of Hopkins teams who have<br />\nflitted vainly from one place to another interviewing league magnates and dick ering with<br />\nrival claimants for tile temporary use of a small<br />\nbut exceedingly, valuable piece of ground up in<br />\nNorth Baltimore,and athletic captains who have<br />\nbeen compelled to take their men for spring practice away out beyond the city limits, will rub<br />\n<br />\ntheir hands with joy at the tidings that the<br />\ndream of years is about to be realized. Johns<br />\nHopkins University, planted on the sloping side<br />\nof a hill amid surrounding dwellings and busy<br />\ntrade, and an open campus with space for all<br />\nkinds of games and the additional charm of practical ownership seem too mutually foreign ever<br />\nto have ary real connection. But if the negotiations at present under way do not fail, another season will see us in practical possession<br />\nof a lacrosse and foot-ball field with suitable<br />\naccommodations for track and field sports.<br />\nThis will without doubt be the greatest step<br />\ntaken in athletics in years, perhaps the greatest<br />\nthat we have ever taken at one time. The building of the cage was a great achievement, and<br />\none that was in the highest degree appreciated,<br />\nbut that was recognized as but a preliminary<br />\nstep to the acquisition of an outdoor practice<br />\nground. The list of athletic victories for 1900<br />\nthat was announced at the feed on Friday was<br />\na remarkable one for a city university. With a<br />\npermanent field at hand, the list for 1901 should<br />\nbe still better, and doubtless Director Mackdermott expects it to be. The credit for this admirable move is, indeed, due mainly to Mr.<br />\nMackdermott, and is only one of the many<br />\nimprovements that have been instituted under<br />\nhis regime.<br />\noir 9r fr<br />\n<br />\nA GAIN AND A LOSS.<br />\nJust as we are going to press comes the news<br />\nthat a great tract of over 150 acres of valuable<br />\nland on Charles Street Avenue has been offered<br />\nas a gift to the University, with the understanding that at such time as the circumstances shall<br />\npermit, tile University shall be established permanently upon that site. The condition attached<br />\nto the gift is that the sum of $1,000,000 shall be<br />\nraised lw other friends of the University in order<br />\nto enable it to carry out the plan of removal.<br />\nThe trustees expect to be able to raise the sum<br />\nwithout difficulty. This news is the most encouraging that has been announced concerning<br />\nthe Hopkins for years—the greatest endowment<br />\nsince that of fhe founder himself. The generous<br />\nand spirited donors of this gift are Mr. William<br />\nWyman, Mr. William S. Keyser, Mr. Francis M.<br />\n<br />\n41.<br />\n<br />\n\f9<br />\n<br />\n5<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nJencks, and an unknown gentleman. A fuller<br />\nEXCHANGE PLACE.<br />\naccount must be reserved until our next issue.<br />\nAnother surprise is the announced resignation<br />\nF.iIia: \"Father, why do you call my allowof Dr. Herbert B. Adams, head of. the Historiance pin money?\"<br />\ncal Department, on account of continued illPater: \"Because I got stuck for it, my dear.\"<br />\nhealth. Dr. Adams' departure will be regretted,<br />\n—Ex.<br />\nby all students who have come in contact with<br />\nWWW<br />\nhim.<br />\n\"They tell me, Professor, that you have mastered all the modern tongues.\"<br />\nEXTRA LECTURES IN FEBRUARY<br />\n\"Yes,\" answered the Professor, \"all but two,<br />\nwife's and her mother's.\"<br />\nmy<br />\nMARCH.<br />\nAND<br />\n—Ex.<br />\nse,WW<br />\n<br />\nJohns Hopkins University has announced<br />\nTHEseveral<br />\nextra courses of lectures which<br />\n<br />\n\"Paw! Say, paw,\" little Johnnie began\"Now what do you want?\" asked the suffering<br />\nfather with the emphasis on the \"now.\"<br />\n\"Will my hair fall off when it's ripe like<br />\nyours?\"<br />\n<br />\nshould be of great interest and importance to all<br />\nstudents of History, Politics, and Economics.<br />\nThey will be distributed through the remaining weeks of February and March. The sched\"I was mimicking Prof.— the other day, and<br />\nule is:<br />\ncaught me at it.\"<br />\nbe<br />\nC.<br />\nof<br />\nD.<br />\nWashington,<br />\nBancroft,<br />\nDr. Frederic<br />\ndid he say ?\"<br />\n\"What<br />\nlectures<br />\nTwelve<br />\n12th.<br />\nMarch<br />\nFebruary 4th to<br />\nme to stop making a fool of myself.\"<br />\ntold<br />\n\"He<br />\n1840-1861.<br />\non U. S. History,<br />\n—Ex.<br />\nUniverStanford<br />\nLeland<br />\nof<br />\nDr. E. D. Durand,<br />\n611r W<br />\nlecThirty<br />\n20th.<br />\nMay<br />\nto<br />\nsity, February 4th,<br />\nJimmy: \"Ain't it good of the school board to<br />\ntures on American Finance.<br />\nand<br />\n8th<br />\n1st,<br />\nup the school in the summer so we can<br />\nshut<br />\nFebruary<br />\nLee,<br />\nDr. Guy Carleton<br />\ncourse<br />\nhis<br />\nof<br />\nrest.\"<br />\nconclusion<br />\na<br />\nin<br />\nhave<br />\n15th. Three lectures<br />\n\"Aw, dat ain't de reason. Dey haf<br />\nTommy:<br />\non English History.<br />\nSix<br />\nteachers a chance to learn some<br />\n30th.<br />\nto<br />\nthe<br />\n1st<br />\nMarch<br />\ngive<br />\nSykes,<br />\nto<br />\nMr. Frederick<br />\n—Ex.<br />\nLiterature<br />\nmore.\"<br />\nlectures on English<br />\n.A6 ser 141'<br />\nMarch<br />\nEngland,<br />\nof<br />\nHarrison,<br />\nMr. Frederick<br />\n6th and 7th. Two lectures on Alfred the Great.<br />\n\"Holy smoke!\" said Satan, as he tossed on<br />\nProfessor M. L. D'Ooge, March 8th. One lec- another bishop.<br />\n—Chicago Weekly.<br />\nture on Delphi and the French Excavations.<br />\nProfessor J. B. Moore, of Columbia UniverProfessor(who has been floored by inquisitive<br />\nsity, March 19th to 21st. Two lectures: (1)<br />\nPolicy<br />\nOur<br />\n(2)<br />\nSpain;<br />\nwith<br />\nFreshman.) \"Mr. Brown, a fool can ask a quesOur Treaty of Peace<br />\ntion that ten wise men could not answer.\"<br />\nin the Far East.<br />\n20th<br />\nMarch<br />\nBoston,<br />\nof<br />\nMr. Brown,'04: \"I guess that's why so many<br />\nDr. James Schouler,<br />\nhis<br />\n—Harvard Lampoon.<br />\nof<br />\ncontinuation<br />\nin<br />\nof us flunk.\"<br />\nto 29th. Four lectures<br />\nRethe<br />\nof<br />\nFounders<br />\nthe<br />\ncourse of last year on<br />\nWW<br />\npublic: (1)John and Samuel Adams; (2)James<br />\n\"My father worked his way through college.\"<br />\nMadison; (3)John Jay and John Marshall: (4)<br />\n\"That's about what I'm doing.\"<br />\nJames Madison.<br />\nthat?\"<br />\n\"What's<br />\navail<br />\nwill<br />\nman<br />\nHopkins<br />\nIt is hoped that every<br />\nworking father for my way through.\"<br />\nI'm<br />\n\"Yes:<br />\nlecthese<br />\nattend<br />\nto<br />\nhimself of the opportunity<br />\n—Cornell Widow.<br />\ntures.<br />\n<br />\nPRESS OF 6TONEBRAKER BROS., BALTIMORE.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ncheers and \"Hullabaloos,\" they separated,some<br />\ngoing home to rest and dream of the fair faces of<br />\nJohns Hopkins Musical Clubs paid a the evening, while others hastened to an adHE<br />\nHying visit to Annapolis on Saturday, Jan- journed meeting of the \"M. R. W.,\" held at the<br />\nuary 26th. The men assembled at Camden Sta- \"Maryland Hotel.\" Here toasts were given<br />\ntion at 4 o'clock, and, after an anxious wait for and songs were sung till the Annapolis police<br />\nPresident King and the tickets, boarded their became nervous and decided to join the feast.<br />\nPrivate ear which was hitched to a supposed Their unwillingness to submit to the necessary<br />\nexpress train. Judging from the way in which initiation caused great discontent among the<br />\nthat train stopped at every apology for a station, members, and the meeting had to he adjourned.<br />\nThe next morning at nine o'clock, everybody<br />\nhowever, an aCC01111110dati011 train would have<br />\nto stop at every cross tie. Nevertheless the ride met once more at the station and took the train<br />\nwas thoroughly enjoyable, and few of the men for home. These short trips are really more enwere glad to bestir themselves and get out into joyable than the extended Christmas and Easter<br />\nthe snow when the train finally pulled into the trips, and, as there are going to be quite a numstation at Annapolis. Arrangements had been ber of these during the next two months, more<br />\npreviously made as to lodging the men,and soon Hopkins men should avail themselves of the<br />\nall were showing their appreciation of the good pleasures derived from the Clubs. There are<br />\ndinners and their hospitable welcome. Indeed several positions now open on the clubs to men<br />\nsuch attention and kindness was paid them that who are willing to give some of their time to<br />\nseveral remained over at the risk of paving their good, hard practice,<br />\nsr sr sr<br />\nown way home.<br />\nSOME MUSICAL HINTS.<br />\nThe concert was given in the U. S. Armory,<br />\n-inside the Academy grounds, and the Clubs were Bditor-in.Chief of THE NEws•LE'rrEE,<br />\nThe Johns Hopkins University.<br />\ngreeted by an enthusiastic audience numbering<br />\nDear Sir: In looking over the article in the last issue<br />\nabout six hundred. The concert itself was not of your paper entitled \"Heard in the Rear,\" in which<br />\nquite as good as usual, for the length of the the author undertakes to criticise the work of the<br />\nbuilding and the great number of girders over- Musical Clubs in the Baltimore Concert, I noticed<br />\nhead made the volume of the Clubs seem weak. several assertions that in my mind will work injury<br />\nThese unfavorable conditions, however, did not to the Clubs. So, as I paid the utmost attention to<br />\nevery piece in this concert, and have listened to a<br />\naffect the Mandolin Club as much as the other number of discussions by musical critics concerning<br />\nclubs, for the sharp sound of the mandolins the merits of the clubs, I have determined to seek the<br />\nseemed to carry the whole length of the hall and use of your columns in order to praise the men and<br />\nthe Club played in better time and with more leaders for their excellent work and to offer a few<br />\nexpression than in any otherconcert this season. suggestions which may perhaps benefit concerts in<br />\nthe future.<br />\nMr. Swindell's absence was felt by all the Clubs,<br />\nIn the first place, I must congratulate the men for<br />\nand it is hoped that he will soon be back in the one of the best concerts ever given in Baltimore by<br />\nranks. Mr. Sneeringer took his place as \"end any College organization. The selections were all<br />\n\"Rhoda\" well chosen, and the medlies showed most skillful<br />\nman,\" and sang \"Goo-goo Eyes\"<br />\narrangement. One mistake that has, in some inexpliwith good success.<br />\ncable way, been spread broadcast is that \"My Lady<br />\nAfter the concert a reception was given in the l,u\" is an old piece. Now this is not the ease for it<br />\n\"Chase Home,\" orw of the finest old houses in came into popularity during the middle of last sumAnnapolis. A number of the town's fairest mer, In fact the Glee Club music is all recent except<br />\nmaidens were present and received the men with one medley and the two University odes. Then, as to<br />\npraise and smiles and chicken salad, all of which the Mandolin Club being inferior to last year, I think<br />\nthis is most decidedly incorrect, and I am strengthwere highly enjoyed. just before leaving, the ened in my opinion by the majority of those who<br />\nmen got together and sang in pathetic strains, heard the clubs last year. True, the Mandolin Club<br />\n\"Bring the Wagon Home, John,\" and \"Don't last year, raised the standard much higher than it<br />\nForget the Hopkins Lads.\" Then, with a few<br />\n1C0NTINuEn ON PAGE 1.1..}<br />\nTHE ANNAPOLIS CONCERT.<br />\n<br />\nT<br />\n<br />\n\f-7'<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nstick in the manner of a drum major, and with<br />\na mighty swagger. His evolutions were cut<br />\nEditor in ChiefNews Letter,<br />\nshort by a murmer which ran among the crowd<br />\nDear Sir:—I enclose the following account of to the effect that the animals were out. He<br />\nthe Zoo's destruction,as I think our college pa- dropped his stick, said he guessed he'd go home,<br />\nper's next issue should contain some graphic and \"took out.\" His lieutenant said, \"I ain't<br />\naccount of that catastrophe. I do not care to goin' to run,\" and followed the drum major.<br />\nappend my name to the article, as I am not The rest of the band rapidly dispersed. One boy<br />\nwriting for fame, but for the \"joy of the work- ran up behind a fat old colored woman, and<br />\nbarked so ferociously, that the unoffending old<br />\nYours respectfully.<br />\ning.\"<br />\ntaken by surprise, completely collapsed,<br />\nlady,<br />\nN. B. I have decided to sign with my class nudown upon the pavement with force.<br />\nsitting<br />\nmerals, as I think everyone should endeavor<br />\nof the great beauty of the fire, I found<br />\nspite<br />\nIn<br />\nto shed as much lustre upon his class as possible.<br />\nmyself speculating upon the terrible conseTHE BURNING OF THE ZOO.<br />\nquences of wild animals running amuck among<br />\ncrowd. (Only a lack of space prevents the<br />\nthe<br />\nlooked<br />\nI<br />\nsomewhere.<br />\nout<br />\nrang<br />\ncry<br />\nFire! The<br />\nof the author's speculation, which<br />\npublication<br />\nthe<br />\nupon<br />\nsnow<br />\nthe<br />\nsee<br />\nto<br />\nout of the window<br />\nvivid<br />\naccount in twelve sheets of what<br />\na<br />\ngives<br />\na<br />\nwith<br />\ntinged<br />\nhousetops<br />\nneighboring<br />\nstreets and<br />\nconflicting feelings would be, if<br />\nand<br />\ntorn<br />\nhis<br />\nand<br />\nhat<br />\nmy<br />\ndonning<br />\nHurriedly<br />\nruddy glow.<br />\n\"terrible consequences.\" This<br />\nany<br />\nwere<br />\nthere<br />\ndoor<br />\nthe<br />\nbanging<br />\nstreet<br />\nthe<br />\ninto<br />\ncoat, I rushed<br />\ninto a tirade upon \"caremerges<br />\nspeculation<br />\nilluminated<br />\nbrilliantly<br />\nwas<br />\nafter me. The sky<br />\npublic<br />\nbuildings, built with a<br />\nconstructed<br />\nlessly<br />\npeoof<br />\nThrongs<br />\nreach.<br />\ncould<br />\neye<br />\nas far as the<br />\ncloses with a symand<br />\nfire,\"<br />\nto<br />\ncatching<br />\nview<br />\nheavens<br />\nthe<br />\nof<br />\npart<br />\nthat<br />\ntowards<br />\nple streamed<br />\nanimals and<br />\npent-up<br />\nthe<br />\nfor<br />\noutburst<br />\npathetic<br />\napproached.<br />\nI<br />\nas<br />\nperceptibly<br />\nwhich brightened<br />\nof the<br />\nmember<br />\na<br />\nbecome<br />\nto<br />\nthe<br />\ndetermination<br />\npeople,<br />\naged<br />\nmiddle<br />\npeople,<br />\nyoung<br />\nOld people,<br />\nroof<br />\nwith<br />\nrecalled<br />\nthe<br />\nof<br />\nfalling<br />\nThe<br />\nA.)<br />\nC.<br />\nP.<br />\nS.<br />\npeople—their<br />\ncolored<br />\nmostly<br />\nand colored people,<br />\ncrash,<br />\nA<br />\ngreat<br />\nthoughts.<br />\nwandering<br />\nmy<br />\nstart<br />\na<br />\nshone<br />\nlight,<br />\nyellow<br />\nthe<br />\nby<br />\nebony faces touched<br />\nwith the subdued ruddiness of bronze. (The followed by a shower of sparks shooting upeditor reluctantly omits the author's brief re- wards into the azure of the sky, cast over the<br />\nflections covering sixteen sheets of foolscap upon: ashen features of all a purple glow. An enor(1), the multitude of people, representing so mous cloud of smoke hung for an instant like a<br />\nmany and such varied interests; (2), the holi- black pall over all. Then it billowed away.<br />\nday spirit which had \"grafted itself upon them;\" The fall of the roof left several solitary poles<br />\n(3), the good humor and \"bonne commarady standing, up which the lurid flames languidly<br />\nwhich saturated the atmosphere;\" (4), \"the licked. The glory of the fire went with the roof,<br />\nevident interest which pervaded the whole;\" and beyond a few live wires performing in the<br />\n(5), a dissertation upon curiosity and its not near foreground, nothing more of interest<br />\ninfrequent unhappy consequences, as exemplified occurred. The great crowd slunk away, and I<br />\n1903.<br />\nby a certain precocious child and a live wire. slunk with it.<br />\nAir w or.<br />\nthe<br />\nupon<br />\nposition<br />\na<br />\nfor<br />\ntrying<br />\nis<br />\nThe author<br />\nMAY HIS SHADOW NEVER<br />\nNEWS LETTER staff. The omitted matter is of a<br />\nGROW LESS.<br />\nquality that assures him his place upon the board )<br />\nSeveral people cried out that the Zoo was on fire.<br />\nHe's only a scrub in our Hopkins cage,<br />\nYet a noble sight to me,<br />\nThe fire itself was now in sight though several<br />\nhis time for the 'Varsity's sake,<br />\nWasting<br />\nforhurried<br />\nI<br />\npace,<br />\nmy<br />\nsquares off. Quickening<br />\nHe knows what he cannot be.<br />\nof<br />\noutskirts<br />\nthe<br />\nUpon<br />\nZoo.<br />\nward. It was the<br />\nYet he works and grinds for others' rewards<br />\nthe crowd, a negro urchin, who was leading a<br />\nWrite his name on our history's page,<br />\nband of boys somewhat smaller than himself,<br />\nWhat he tried to do for the Black and Blue,<br />\nThat scrub in the Hopkins cage. —Husky.<br />\nattracted m v attention. He wielded a broom-<br />\n<br />\nAN ESSAY.<br />\n<br />\nPR<br />\n<br />\nOF STONEBRAKER<br />\n<br />\nBROB., BALTIMORE.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\nHOPKINS TO HAVE OUTING<br />\nGROUNDS.<br />\n<br />\nABALTIMORE paper last Friday morning contained about a column ofnews concerning the<br />\nnew outing grounds which we hope to secure<br />\nthis spring. Mr. Mackdermott says he does not<br />\nknow where this article originated,as the matter<br />\nwas to be kept a profound secret until his plans<br />\nwere fully matured; but since he has been anticipated by the newspaper, he adds that the<br />\nJohns Hopkins Athletic Association has been incorporated, and that we are to have a share in<br />\nthe new baseball grounds which are about to be<br />\nestablished by the American League Base-ball<br />\nClub. The new grounds will be a short distance<br />\nfrom Union Park—York Road and 29th Street,<br />\nand will have the same seating capacity as the<br />\n01(1. There will be a grand stand and two sets<br />\nof bleachers, one in left field, the other in right.<br />\nInstead of a club house, as the paper stated, to<br />\nbe used by baseball players as well as Hopkins<br />\nstudents, Hopkins will build her own club house<br />\non the grounds, near centre field, for the exclusive use of her own men. The club house will be<br />\nfitted out with locker room, shower baths, rubbing boards, and all other modern attachments.<br />\nThe one thing we have needed above all others<br />\nfor past years,is a campus; some place where our<br />\nteams may practise in the open,and not have to<br />\nhe caged up, playing by gas light half the time.<br />\nWhy have our base-ball teams been a failure?<br />\nSimply for lack of grounds on which to practice.<br />\nWhy has Hopkins above all other universities,<br />\nalways lacked that true college spirit which<br />\nshould be identical with every college or university? Because the Hopkins University is situated in the heart of the city, surrounded on all<br />\nsides by dwellings, with not the least excuse for a<br />\ncampus, and second, because we have no dormitory life. When an athletic field is secured, it is<br />\nto be hoped that these obstacles will be done<br />\naway with to a great extent, and there is no<br />\nreason whyHopkins,after securing these grounds,<br />\ncannot shove her athletic teams to the front,<br />\nand put them on a level with those of other<br />\nprominent universities and colleges in the country. It might be well to say that this attempt<br />\nat securing outing grounds may be solely attrib-<br />\n<br />\nuted to Mr. Mackdermott's unrelaxing interest<br />\nin Hopkins athletics, and if the grounds are obtained, it will be another step onward toward<br />\nthe goal which \"Mac\"and our teams deserve to<br />\nreach.<br />\n<br />\nATHLETIC NOTES.<br />\nschedule has been arranged<br />\nTHEforfollowing<br />\nthe championship series of foot-ball<br />\ngames for the season 1901-1902:<br />\nNov. 9th.—St. John's vs.Western Maryland, at<br />\nWestminster.<br />\nNov. 16th.—Johns Hopkins vs. St. John's, at<br />\nBaltimore.<br />\nNov.-23rd.—Johns Hopkins vs. Western Maryland, at Baltimore.<br />\ngir 9r or<br />\nThe contest for the tennis championship of<br />\nthe Maryland Intercollegiate association will be<br />\nheld in the Hopkins cage on Wednesday, May<br />\n15th, at 10 A. M.<br />\nsr or sr<br />\nThe annual track and field championship games<br />\nwill be held in Baltimore, on Saturday, May<br />\n18th. A special committee has been appointed<br />\nto take charge of these games and consists of<br />\nWm. M. Mackdermott, Hopkins, Chairman;<br />\nJames A. Fechtig, St.Johns; and Wm. M. Black,<br />\nWestern Maryland.<br />\nsr sr or<br />\nAn Athletic Association has been added to the<br />\nHopkins Club through the instrumentality of<br />\nMr. Mackdermott. Under the auspices of this<br />\nbranch of the Hopkins Club, Mr. Morfit Mullen<br />\nwill compete in the B. A. C. games which will<br />\nbe held at the Fifth Regiment armory this<br />\nmonth. A baseball club will also be organized<br />\nby Mr. Geo. C. Morrison, an old Hopkins baseball player, which will play during the summer<br />\nmonths.<br />\nmir<br />\nAn addition soon to be made to the cage will<br />\nbe a gallery across the west end. This gallery<br />\nwill be ten feet from the ground and ten feet<br />\ndeep, with a seating capacity of several hundred.<br />\nAs soon as pleasant weather comes and the lacrosse team is able to practice out of doors, work<br />\nwill begin upon this most valuable addition.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nMEETING OF INTER-COLLEGIATE<br />\nASSOCIATION.<br />\nSaturdayjanuary 26th,there was a meetONing<br />\nof the Inter-Collegiate A'ssociation of<br />\nMaryland in the gymnasium of the Johns Hopkins University. The delegates present were<br />\nMessrs. Cain, Fechtig and Wisner,of St. John's;<br />\nCobey, of Western Maryland;and Mackdermott<br />\nand Reese, of Hopkins.<br />\nA resolution was offered by Mr. Mackdermott,<br />\nthe gist of which is as follows:<br />\n\"In case of two or more colleges scoring an<br />\nequal number of points, then if one of these colleges shall have been champion for the previous<br />\nyear, that college shall continue to hold the<br />\nchampionship for the ensuing year.\"<br />\nThis resolution was passed and accepted asan<br />\namendment to article IX of the constitution.<br />\nThis amendment was the outcome of such a<br />\nstate of affairs as exist at the present time,<br />\nconcerning thefoot-ball championship of the past<br />\nseason. Both Hopkins and St. Johns having<br />\nwon an equal number of games, the championship was undecided, so the necessity for the rule<br />\ngiven above was felt.<br />\nIt was also decided \"that the contestants in<br />\neach event in the Track and Field Championship<br />\ngames should be limited to four contestants from<br />\neach college.\"<br />\nThe treasurer of the Association reported that<br />\nthe finances were in excellent condition, and that<br />\n\"they were away ahead of the game.\"<br />\nsr .ber<br />\n<br />\n411<br />\n<br />\nADVICE TO ATHLETES FROM<br />\nMACKDERMOTT.<br />\nthe above caption, a lengthy article<br />\nUNDER<br />\nwas published in the New York Sunday<br />\nWorld, of January 27th, giving Mr. Mackdermott's ideas on training diet. It is quite gratifying to the editors of the NEWS—LETTER that<br />\nthe fame of our Physical Director, and with him<br />\nthat of our University, has gone abroad, and<br />\nthat his opinions have been voiced in the great<br />\nmetropolitan newspapers. Part of the article<br />\nin question follows:<br />\n\"Prof. William M. Mackdcrmott, Director of<br />\nPhysical Training of Johns Hopkins University,<br />\nBaltimore, has prepared a training diet for ath-<br />\n<br />\n9<br />\n<br />\nletes in training based on an experience of<br />\ntwenty years in practical athletics and of twelve<br />\nyears as a trainer, six of which have been spent<br />\nat Johns Hopkins. Mackdermott has made a<br />\nstudy of the subject and incidentally has paid<br />\nconsiderable attention to diet for persons suffering from obesity and leading sedentary lives.<br />\nProf. Mackdermott was for a number of years<br />\na leading member of the world famous Manhattan Athletic Club and contested as one of the<br />\nold Cherry Diamond track team, winning a<br />\nnational reputation as a consistent all-around<br />\nathlete.<br />\n\"Under his tuition the Johns Hopkins boys have<br />\nrepeatedly won and now hold the track and<br />\nfield and football championships of the South.<br />\nFor three years they have held the inter-collegiate lacrosse championship.<br />\n'Many more persons eat themselves to death<br />\n\"<br />\nin the course of a year,' says Mackdermott,<br />\n'than drink themselves to death. If the temperance folks all over the country would include the<br />\nadvocacy of moderation in eating in their crusades, they would confer a great blessing on<br />\nhumanity.'<br />\n\"The following diet is prepared for athletes in<br />\ntraining, who must maintain strength to do<br />\ntheir work.<br />\nMeats—Roast beef, moderately rare; mutton<br />\nchops, lamb chops and beef steak (broiled moderately rare); chicken, turkey, duck, sweetbreads, rabbit, fresh fish (no salt fish) lamb,<br />\nmutton. Do not eat fat or gravies.<br />\nVegetables—Spinach, lettuce,celery,asparagus<br />\n(without oil or butter dressing), white potatoes,<br />\nboiled, mashed or baked; lentils, lima and dried<br />\nbeans, rhubarb, greens, kale, split and green<br />\npeas, tomatoes in season.<br />\nFruits—Oranges, moderately; baked and<br />\nstewed apples,currants, prunes,figs,raspberries,<br />\ndates, stewed fruit.<br />\nBread—Wheat, rye and graham bread, one<br />\n(lay old; toast, hot bread, rolls or any kind of<br />\nhot cakes must not be eaten during training<br />\nperiod.<br />\nMiscellaneous—Eggs, soft boiled, shirred,<br />\nomelet or poached; oatmeal, beef tea, mutton<br />\nbroth; milk, occasional, if pure; tapioco, sago,<br />\narrowroot, cocoa, grape-nuts, cauliflower.\"<br />\n<br />\n•<br />\n<br />\nPR ESS CIF $TONEBRANER BRO$<br />\n<br />\nBALTIMORE.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHAPPENINGS IN THE UNIVERSITY.<br />\n<br />\nR. Ira Remsen has been chosen to represent<br />\nJohns Hopkins at the meeting of the American Association of Universities, which will begin<br />\nin Chicago on February 26th. The association<br />\nis composed of the presidents and professors of<br />\nthe various universities and colleges of this<br />\ncountry, and meets annually to discuss subjects<br />\nrelating to the inner affairs, of university management.<br />\nwww<br />\nDr. Hamilton Wright Mabie, associate editor<br />\nof the Outlook, will deliver the Turnbull lectures<br />\non poetry this spring. Mr. Mabie is well known<br />\nas an author, and is also an exceptionally good<br />\nspeaker. His works cover a variety of literary<br />\nsubjects. The dates for these lectures are as yet<br />\nunknown, but will be somewhere about April<br />\n11th.<br />\nAs As<br />\n<br />\nThe contest for the Tocqueville medal is<br />\nopened once more. The medal is given to the<br />\nUniversi' v each year by Baron Coubertin of<br />\nParis, and is offered by the University to the<br />\nstudent presenting the best essay on some phase<br />\nof French History, political or social, of the<br />\nperiod between 1815 and 1890.<br />\nwww<br />\nHenry A. Converse, a graduate student in<br />\nmathematics and philosophy, has been teaching<br />\nduring the past month at the Baltimore Polytechnic Institute. Mr.Converse has been offered<br />\nseveral positions which will be open to him as<br />\nsoon as he receives his degree.<br />\nww<br />\nWalter B.Swindell,'01, who has been detained<br />\nat home for nearly a month with a serious<br />\nattack of the grip, is convalescing, and hopes to<br />\nbe back to the University in a short time.<br />\nJP .A6.0<br />\nThe Historical and Political Science Association celebrated John Marshall Day,in the rooms<br />\nof the Historical Seminary last Friday. Dr. W.<br />\nW. Willoughby read a paper on \"John Marshall<br />\nand Political Science;\" Mr. W. E. Martin,<br />\nFellow in History, read one on \"John Marshall<br />\nas a Historian.\" President Gilman made a few<br />\nremarks concerning the John Marshall prize<br />\n<br />\nannually awarded by the University, and Dr. J.<br />\nM. Vincent spoke on \"The Prize Winners.\"<br />\nJP JP<br />\nMr. Bailey Willis, of the United States Geological survey will begin a course of lectures on<br />\nStratigraphic and Structural Geology in the Geological Lecture Room on Thursday, February .7.<br />\nw 4r or<br />\nCharles Edward Lyon,'97, who left his graduate studies here last year to follow lectures in<br />\nGerman universities, has returned after a stay<br />\nof six months at the universities of Leipsic and<br />\nMunich. He will continue his work in the German department here.<br />\njb .44<br />\n<br />\n44<br />\n<br />\nY. M. C. A. NOTES.<br />\nLIFE WORK MEETING.<br />\nHE Association has under way a series of<br />\ntalks on the requirements, duties, and opportunities of the various callings, with the hope<br />\nof giving practical help not only to students who<br />\nhave not yet determined upon a profession, but<br />\nto others as well, by making more clear and<br />\npositive some of the ideas that are most important. The list includes Mr. Eugene Levering on<br />\n\"A Business Career ;\" Dean Griffin on \"Teaching as a Life Work ;\" Mr. Niles on \"Law as a<br />\nProfession ;\"and Dr. Kelly on \"The Doctor of<br />\nthe Future.\" Others will be announced later.<br />\nIt is the purpose of the committee to conduct<br />\neight meetings on this plan, after which the Sunday afternoon services will be discontinued for<br />\nthe year. Five o'clock on Sunday for forty-five<br />\nminutes, is the time.<br />\n<br />\nT<br />\n<br />\nCLASSES.<br />\nTwenty-five members of the Y. M. C. A. are<br />\nstudying the Bible in three classes meeting<br />\nweekly.<br />\nMr. A. IL Ewing has been conducting a class<br />\nof a dozen men in the study of modern conditions in missions. The class will be continued<br />\nfor several weeks, although Mr. Ewing will sail<br />\nfor India the last of this month, directly after<br />\ntaking his degree of Ph. D. He will resume his<br />\nmissionary work, his station being at Allahabad.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n[CONTINUED FROM PAGE G.]<br />\n<br />\nhad been, but any one who this year heard \"Salome\"<br />\ncould not fail to notice the expression and feeling<br />\nthat the men themselves had for the more modulated<br />\nstrains. In the other pieces there is -less expression<br />\nthan in this, on account of their being marches.<br />\nThe Banjo Club, in my opinion, deserves the most<br />\npraise, for they entered the year handicapped in numbers, and disheartened by their former record. But<br />\nnow we undoubtedly have a club that rivals that of<br />\nPrinceton, and this year, if proper training is kept tip<br />\nthe Johns Hopkins Clubs will show the Princeton<br />\nmen that all three clubs are better than theirs.<br />\nBut enough of praise: for I must come to the main<br />\nreason for writing this letter, and that is to offer a<br />\nfew suggestions. They are all of minor significance,<br />\nhut still effect, to a certain degree at least, the opinion that the audience has of the clubs. To begin<br />\nwith, there should be more system in the manner in<br />\nwhich the men come upon the stage. Usually they<br />\nstraggle in, slowly form a crooked line, and then,<br />\nsomeone finding himself in the wrong place, there is<br />\nmore commotion. This of course does not always<br />\ntake place in just the manner described, hut there is<br />\nan air of uncertainty in all the clubs, especially the<br />\nGlee Club, which impresses the audience most unfavorably. Then too, the leader almost invariably<br />\nhas difficulty in gaining the attention of his club in<br />\norder to start the piece. ):'et for hint to start before<br />\nall the mei are looking at hint, would bring about a<br />\nweak beginning and mar the whole selection. For<br />\nthe old adage \"work well begun is half done,\"is most<br />\nsurely applicable to Musical Clubs also. And now I<br />\nwould like to offer a suggestion, concerning the too<br />\nfrequent use of the pistol. One explosion, or perhaps<br />\ntwo, is startling and has a good effect, but more than<br />\nthis only tend to make the concert like a cheap vaudeville, where the attention of the audience has to be<br />\ngained by some such artificial means. The question<br />\nas to the number of encores that should be given is<br />\none of some importance, for too many are apt to tire<br />\nthe audience, and too few give the impression that<br />\nthe clubs have a small repertoire. In the Baltimore<br />\ncencert, too many were given, and the hearers were<br />\nall fatigued at the close of the programme. The number of encores is, of course, at the descretion of the<br />\nleaders, and they should not be carried away by the<br />\nenthusiasm of the men, but should wait for sufficient<br />\napplause.<br />\nAnd now with these last few suggestions I will<br />\nclose, with most earnest wishes for the continued<br />\nsuccess of the clubs.<br />\nYours very truly,<br />\nA HOPKINS MUSIC LOVER<br />\nWW W<br />\n<br />\nInvention.—A rubber stamp to be used on domestic letters has been invented by The Widow<br />\n(Cornell) staff, and saves time, ink, and won-y.<br />\n<br />\n11<br />\n<br />\nAnswers to examinations given in one of the<br />\nleading grammar schools of Boston:<br />\nWho were the Pilgrims?<br />\nA dirty, funny set, who lived under the earth.<br />\nName a domestic animal useful for clothing,<br />\nand describe its habits?<br />\nThe ox. He don't have any habits, because<br />\nhe lives in a stable.<br />\nIf you were traveling across the desert, where<br />\nwould you choose to rest?<br />\nI would rest on a stool.<br />\nMention five races of men?<br />\nMen, women, children and babies.<br />\nDescribe the white race, and show that it is<br />\nsuperior to other races?<br />\nA white man will nod at you, when he meets<br />\nYOU on the street.<br />\nOf what is the surface of the earth composed ?<br />\nDirt and people.<br />\nName a fruit that has its seed On the outside?<br />\nA seed cake.<br />\nName five forms of water?<br />\nHot water, cold water, faucet water, well<br />\nwater, and ice \\voter.<br />\nName and locate the five senses?<br />\nThe eyes are in the northern part of the face,<br />\nand the mouth in the southern.<br />\nWho were the mound builders ?<br />\nHistory cannot answer this question. Science<br />\nonly can.<br />\nDefine \"flinch\" and use it in a sentence?<br />\n\"Flinch,\" to shrink. Flannel flinches, when it<br />\nis washed.<br />\nBy what is the earth surrounded, and 1).y<br />\nwhat is it lighted?<br />\nIt is surrounded by water and lighted by gas<br />\nand electricity.<br />\nName six animals of the arctic Zone?<br />\nThree polar bears and three seals.<br />\nWhat is yeast?<br />\nYeast is a vegetable flying about in the air,<br />\nhitching itself on to anything.<br />\nWhy do you open the dampers in a stove,<br />\nwhile lighting a fire?<br />\nTo let the oxygen in and the nitrogen out.<br />\nWhat did the constitution do for the country?<br />\nIt gave the president a head.<br />\nWhat are the last teeth that come to a man?<br />\nFalse teeth. .<br />\n<br />\nLTIMOR<br />\n<br />\n\fP. PAINE<br />\nGORDON P. PAINE<br />\n<br />\nCLINTON<br />\n<br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE SlOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br />\n<br />\nCLINTON P. PAINE<br />\nBANKERS<br />\n<br />\nAND<br />\n<br />\n&<br />\n<br />\nj ON<br />\n<br />\n229 N. C147111LES ST.<br />\n<br />\nCo.<br />\n<br />\nBROKERS,<br />\n<br />\nMASONIC TEM,LE.<br />\n<br />\nVOR Class, Fraternity and College Stationery, Banquet Cards,-<br />\n<br />\n217 FAST GERMAN STREET,<br />\nRALT1MORE, MD.<br />\n<br />\nPRIVA I h. WIRES TO<br />\nNEW YORK AND CHICAGO.<br />\n<br />\nSMOKE UP!<br />\n<br />\nRAH! RAH! RAH! HOPKINS!!<br />\nIF ITS<br />\n<br />\nANYTHING IN TOBACCO YOU WANT<br />\n<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nThe Chas, \\Nibs Surgical Inst[ument Co,<br />\n<br />\nGo To I. D. LANG, TOBACCONIST,<br />\n<br />\nBENJ. A. NELSON, GEN't. MANAGER.<br />\n<br />\n833 MADISON AVENUE.<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n<br />\nBOX TIRADE<br />\n<br />\nA SPECIALTY<br />\n<br />\nDrovers & Meehanics National Bank of Baltimore.<br />\nCapitaIeStock $300,000.<br />\n<br />\nJAS. H. DOWNS,<br />\n<br />\n300 N. HOWARD ST.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMUELLER,<br />\n<br />\n(LONDON STUDIO.)<br />\n<br />\nFINEST PHOTOGRAPIC WORK<br />\n<br />\nTRANSACTS A GENERAL BANKING BUSINESS<br />\nSafe<br />\n<br />\n.2)a,u0.rie alo.pre,<br />\n<br />\n00 €<br />\n<br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br />\n<br />\nAND<br />\n<br />\nIN THE CITY.<br />\n<br />\n9.1„usverrve.<br />\n.Special attention given to Holiday<br />\nwork and tiroups, Class Pictures, etc.<br />\n<br />\nJ. D. Wheeler, Cashier.<br />\nChas. S. Miller, Ass't Cashier.<br />\n<br />\nA. H. FETTING,<br />\n14<br />\n<br />\nMANUFACTURER OF<br />\n<br />\nWeek Letter -fraternity<br />\n3ewetry.<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br />\n<br />\nMASON & HAMLIN PIANOFORTE.<br />\nsinging tone, and the :ietion is most satisfactory.<br />\n\"It has<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nrank.\"<br />\nI Signed I<br />\nMORITZ MOSZKOWSKI.<br />\n<br />\n16 ST. PAUL STREET.<br />\n<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\nC. H. Hildebrandt & Son, Sole Agts.<br />\n<br />\ni<br />\n<br />\nLONDON. PARIS, (IIBRALTAR.<br />\nNAPLES. GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nA. SCHUMACHER & CO<br />\nGeneral Agents.<br />\n<br />\nFor particulars apply to<br />\nSURETY BONDS<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nNEW YORK TO BREMEN,<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nw w w CABIN PASSAGE AT LOW RATES.<br />\nIi<br />\n<br />\n5 WEST LEXINGTON ST.<br />\n<br />\nSurplus und Profits, $350,000.<br />\n<br />\nDIRECT.<br />\n<br />\nAre<br />\n<br />\nKratik-Smilb<br />\npiano CO.<br />\n<br />\nCht<br />\n<br />\nTidelity and Deposit Company of Maryland,<br />\n•<br />\n<br />\n109 and III North Charles nrect.<br />\nSOLE AGENTS<br />\n<br />\nDickering, Bradbury and Webster<br />\nIt* Pianos. e*<br />\nC.& F. Phone 2322-2.<br />\n<br />\nFactory Prices<br />\n<br />\nBARTL,eirr, HAYWARD er CO.<br />\n11 'Founders and Engineers, • e<br />\nOffloe Calvert and German Sts.<br />\nWorks, Pratt and Scott Sts.<br />\nManufacturers °feast and Wrought Iron Work for Buildings,<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nIforizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought<br />\n'Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON $TS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES.<br />\n<br />\nEDWIN WARFIELD, Pres't.<br />\ntat Vice-Pres't, H. Crawford Black.<br />\n2nd<br />\n\"<br />\nFos. R. Stonebraker.<br />\n3rd<br />\n\"<br />\nThos. A. Whelan.<br />\n<br />\n11. H. 130SLER, Sec'y-Treas.<br />\nHarry Nieodemus,<br />\nAss't See'y-Treas<br />\n<br />\nBOOKS<br />\n<br />\nOld and<br />\n<br />\nNew.,<br />\n<br />\nThe oldest Old Book Store, rind the largest<br />\nstock of Old and New Books in the Cit:p.<br />\nBooks bou,L,tht, sold and exchanged. . . .<br />\nWM. V. PIPPEN.<br />\n<br />\n605 N. Eutaw St.<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\n4 iiingdus5 4 Automatic Attachments for<br />\nPianos.<br />\nREGINA MUSIC BOXES.<br />\nGRAMOPHONES, ETc,<br />\n201-203 N. CHARLES STREET.<br />\n<br />\n\"Washburn\"<br />\n<br />\n1_,UNCti IROONIS I<br />\n<br />\nHARRY T. 1V1UMYS<br />\n<br />\nTHI-7. DRUID<br />\nLIICIHT LUNCH ROOM<br />\n<br />\n122 NORTH HOWARD STREET,<br />\nOYSTERS IN ALL STYLES.<br />\n<br />\nYOUR PATRONAGE SOLICITED,<br />\n<br />\n\fDIXON ut co.<br />\n<br />\nSPITITH,<br />\n<br />\nIlSCS:11<br />\n<br />\n0: PAPER oe<br />\n<br />\n311N-T.RARLES 57<br />\n<br />\nV11.,Rikviojey<br />\n<br />\n29-31 IS_ 01-I_ARLEIE3 ST_<br />\n<br />\nLAGER BEERS<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\n60Idbrau And Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market<br />\nWm. It. Oliver.<br />\n<br />\nJ. Win. Middendorf.<br />\n<br />\nMIDDENDORF OLIVER & Co.<br />\n<br />\nBankers and Brokers,<br />\n<br />\nBartholomay Brewery Co.<br />\nROCHESTER,N. Y.<br />\n<br />\nBARTH0LOMAY'S is THE bohemian<br />\n• ORIGINALAND FAMOUS e<br />\n<br />\nROCHESTER BEER: Bavarian<br />\n• BRANCH<br />\n<br />\n227-239 SIENTRAI AVE<br />\nGEO.C.S CRO•<br />\n• MANAGER • •• •<br />\n<br />\n005 EAST GFCIRIVIAN STREET,<br />\nMembers<br />\n<br />\nOffice and Depot, 227-239 S. Central Avenue.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nBaltimore Stock Exchange.<br />\n<br />\nGEO. C. SUCRO, Sole Agent.<br />\nHome Tdephone 2060<br />\nT..1,,ption, logo<br />\n<br />\n(..<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\nWedding Silver<br />\n<br />\nNEW YORK TO LONDON DIRECT.<br />\n<br />\nTrfitdseisor<br />\n<br />\nExcellent accommodations for it limited<br />\nnumber of First-Class Passengers<br />\n:Lt reasonable rates.<br />\n<br />\nIN GREAT VARIETY.<br />\n<br />\nit Silversmiths.<br />\nHENDERSON'S 1 the<br />\nJACOUtl 61- .11<br />\n<br />\nK I INS,<br />\n<br />\n216 N. CHARLES ST.<br />\n<br />\nNEW YORK.<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nLawrence B. Kemp, President.<br />\n<br />\nAND<br />\n<br />\nSTREETS,<br />\n<br />\nGERMAN<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nHABERDASHERS.<br />\nShirts,<br />\n<br />\n1 BROADWAY<br />\n<br />\nBALTIMORE.<br />\n<br />\nHOWARD<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nATLANTIC: TIRANSVORT CO.<br />\n<br />\n403-4()1) WATER ST.<br />\n<br />\nC01111111ERCIFIL & FFIRRIERS NOTIONK BANK,<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE,<br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENT'S SUPPLIES.<br />\n<br />\n(Daerfzen 13rau<br />\nripollo<br />\n<br />\nTRADE MARk•<br />\n<br />\nB A LT I MORE<br />\n<br />\nOilers to<br />\n<br />\nDepositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nJAMES R. PAINE.<br />\n<br />\nTI1E0. WARNER,<br />\n<br />\nWARNER 8c CO.<br />\n<br />\nNeckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nUMBRELLAS, i) HATTERS, Q<br />\nHIGH GRADE GOODS I.f/W 'MMES.<br />\n<br />\nCANES, Erc<br />\n<br />\nAgents for Lincoln & Bennett and Walter Barnard's London Hats.<br />\n<br />\n324 W. liALl'INION.F.:<br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nSilk and Cassimere liats.<br />\n<br />\nphotographs<br />\n<br />\n---Clit.HOPKI NS CAPS.<br />\n<br />\nIlgenfritz<br />\n<br />\nGushing& Companu<br />\n<br />\nStudio.<br />\n<br />\n0 BOOKSELLERS...,<br />\nSTATIONERS.<br />\n<br />\n34 W. BALTIMORE STREET.<br />\nSUCCESSOR TO CUMMINS<br />\nSCHOOL, LAW, MEDICAL. CLASSICAL AND MISCELLANEOUS BOOS,<br />\n<br />\n20<br />\n<br />\nVVHST<br />\n<br />\nILJEXIIWIT()N<br />\n<br />\nSTIREHT.<br />\n<br />\nSPECIAL DISCOUNT TO STUDENTS.<br />\n<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns hopkins Hospital and The Woman's College of link',<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nI-tiBLEE,N M. HoL.L.YDAv,<br />\n000 N. EUTAW ST.,<br />\n<br />\nTIEF<br />\n<br />\nRALTIMORE, MD.\"<br />\n<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br />\n<br />\niinheuser-Busen<br />\n<br />\nAccommodating terms.<br />\nWrite for Illustrated CainPogue.<br />\nCHAS. M. STIRIFP.<br />\n(i N. Liberty St., Baltimore, Md. 521 nth St., N. W., Washington, D. C.<br />\n<br />\nB.<br />\n<br />\n13.<br />\n<br />\nBOOKS<br />\n<br />\nAND STATIONERY,<br />\n<br />\nNo. 308 North Cliarlotit Street,<br />\nY. M. C. A. BUILDING,<br />\nC. &<br />\n<br />\nP. Telephone 2351.<br />\n<br />\nSTONEBRAKER BROS.,<br />\n2 I 7 E. Baltimore St„.<br />\n<br />\n2314.<br />\n<br />\nPRESS OF OTONEBRAKER<br />\n<br />\nEICHELBERGER,<br />\n<br />\nENGRAVING AND STAMPING.<br />\n<br />\nBALTIMORE RCA NCR:<br />\n<br />\nLOUIS ILLMER,<br />\nGetel Agent and Mgr.<br />\nC. & P. Telephone<br />\n<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\n<br />\npiAlklos<br />\n<br />\nBrewing Ass'n<br />\nSt. Louis, Mo.<br />\nBrew the Best Becr,<br />\nin the World.<br />\n<br />\nYou get the benefit of<br />\nall this lalmr,skill,brains<br />\nand capital.<br />\n<br />\nBROS., BALTIMORE.<br />\n<br />\nBALTIIVIORE, MD<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NO1ICE.<br />\n<br />\n\fFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nHOLIDAY SEASON,<br />\n<br />\nFORD'S!<br />\nFEB. 11,<br />\nONE<br />\nWEEK<br />\n<br />\n\"QUO VADIS\"<br />\n<br />\nFEB 18<br />\nONE<br />\nWEEK.<br />\n<br />\nLEMMERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br />\n<br />\nTHEATRE OF BALTIMORE<br />\n<br />\nJAMB'S A. HE:14INIE,<br />\nIN \"SAG HARBOR.\"<br />\n<br />\nACADEMY OF MUSIC!<br />\n<br />\n;<br />\nr 411rMN4M AN<br />\n<br />\nWEEK OF<br />\nFEB. 4<br />\n<br />\n66 E. 8. NVIIILLARD.\"<br />\n<br />\nWEEK OF<br />\nFEB 11.<br />\n<br />\n47 .11 6fi'rhe Fitunawa.y Girl.\"<br />\nCoining,\"To H HNC ii nti<br />\n<br />\nLEMMERT<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br />\n<br />\nto Hold.\"<br />\n<br />\nSPACE TO LET.<br />\n<br />\nLEMMERT.<br />\n<br />\n14 E. FAYETTE STREET.<br />\n<br />\nze• aeixteimitaitimutateasimeeitimitimiteiteeq<br />\nis the<br />\n<br />\nPECIAL DISCOUNT! jt<br />\n<br />\nS<br />\n<br />\nnoblest<br />\n<br />\nTo the Students and Nurses of Johns Hopkins We 0 IIMake n<br />\ndiscount of one-third on all styles of Photographs In single<br />\ndozen WS. Better discount for classes.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\ntiotizikpFEL e 8Eizet<br />\nmandolins<br />\n<br />\npart<br />\n<br />\nof<br />\n<br />\nyour<br />\n<br />\nHERD, Shi,!=;.,Jli::;1),,.,e,_titr,yain2::<br />\nlug OUR HATS.<br />\n<br />\n0<br />\n<br />\n0<br />\n<br />\nJEFFIRES STUDIO, w<br />\n08 N CHARLES STREET.<br />\n<br />\nOUR<br />\n<br />\nMINOR'S,<br />\n<br />\nUP-TO-DATE,<br />\n<br />\n0 218 NORTH EUTAW STREET,<br />\n0<br />\n<br />\nONE PRICE.<br />\n<br />\n07<br />\n<br />\n. ZZieZezzezzzaz.ezzaziteitialteazazez;p:,<br />\n,<br />\n:<br />\n-...<br />\n'<br />\ni<br />\n.,.<br />\n,<br />\n:<br />\n.,<br />\n.<br />\n<br />\nH.<br />\n<br />\n13.<br />\n<br />\nMANDOLINS, GUITARS anD BANJOS<br />\n\"hlive a tone<br />\nThat's all their own \"<br />\n<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\n<br />\nGUITARS AND BANJOS.<br />\n<br />\nNEAR SARATOGA ST.<br />\nINSTRUMENTS TAKEN IN EXCHANGE<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\nOPEN EVENINGS.<br />\n<br />\nJ. SMITH,<br />\nNASTATMAW=<br />\nOuzel<br />\n<br />\nMOMS=<br />\n<br />\nWATOZZZAMTWASIANTO<br />\n<br />\nBOOKS<br />\n<br />\nOld<br />\n<br />\n111114.1<br />\n<br />\nNwss-<br />\n<br />\nSZTAW USTASWAM=NAMTRAWATAMMAZTOMMaMIAW<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br />\n<br />\nCall at 805 North Hogvaror Street,<br />\n3 DOORS ABOVF MADISON.<br />\n<br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br />\n<br />\nC. SS. h SICK<br />\nCOLLARS.<br />\n<br />\nCUFFS<br />\n<br />\nrr<br />\n<br />\nG LOVES.<br />\n<br />\ner5<br />\n<br />\nEr.) rave rs<br />\n)L111<br />\nZ17 E.OLT0,6T.<br />\nBALTIMORE/M-6, .<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n125 EAST, NEAR CALVERT STREET.<br />\n<br />\nSCCCOO 0 11)) R*DS E0_0 R<br />\nBRACES.<br />\n<br />\nUMBRELLAS.<br />\n<br />\nCANES<br />\n<br />\nTIES.<br />\n<br />\nETC.<br />\n<br />\nNovember 7th, 195o.<br />\nWhile visiting the Paris Exposition of Iwo, the wonderful display of<br />\nwines from all parts of the world was made a special study by our represell t: ye, W liii secured sonic very fine euvees of French wines, both<br />\nred and white, such as Chateau 'Ponta Canet, Chateau Larose, Chateau Lafitte, Chattau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Con Let. The latter liner than Chateau Yquem and not so<br />\nsweet Also sonic special vintag.s of' Deinhard & Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of aH Offley Forrester & Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in Lin gallon<br />\npipes direct Iroin the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 MadlISOI1 A VC., Sid OM<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\nSTONEBRAKER BROTHERS,<br />\n217 E. BALTIMORE ST.,<br />\n<br />\n.06 .pg .0<br />\n<br />\nADVERTISE IN THE \"NEWS LETTER.\"<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n.4 .4<br />\n<br />\n\f", "format": "basic_html", "processed": "...111.11111<br /><br />\nnOlikinst31111<br />\nIssued<br /><br />\nBaltimore<br />\nc70grP<br />\nPRESS OF STONEBRAKER<br /><br />\nFortnightly<br />\n•<br /><br />\nBROS., BALTIMORE<br /><br />\nJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br /><br />\nRuenty-fifth Year.<br /><br />\nBeginning October 1st, 1900.<br /><br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br /><br />\nDANIEL C. GILMAN<br />\nWas;H. HowELL.<br /><br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special-students.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br /><br />\nLaboratories.<br /><br />\nDirectors.<br />\nHenry A. Rowhtral.<br />\nIra Reinsert.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam II. Howell.<br />\nWilliam H. Welch.<br />\n.John J. Abel.<br />\nJohn J. Abel,<br />\nWilliam Oskr.<br /><br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gihlerskt<br />\nKirby F. Smith.<br />\nMaurice Bloomfiehl.<br />\nPaul Haupt.<br />\nlknry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the ''Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br /><br />\nEditors.<br />\nFrank Morley.<br />\nIra Remsen,<br />\nBasil L. Gildersleeve.<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Wekh.<br /><br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nAmerican Journal of Mathematics:<br /><br />\nP. MORLEY,Editor. Quarterly. 4to. Volume XXIII..<br />\nin progress. $5 per volume.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. &amp;Ivo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nStudies from the Biolologicil Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nStudies in Historical and Political Science.<br />\nII. B. ADAMS, Editor. Monthly. 8vo. Series XIX<br />\nin progress. $3 per volume.<br />\nJohns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\n'progress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nJohns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nContributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. IluooKs, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\n\\V. H. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nV in progress. $5 per volume.<br />\nAmerican Journal of Insanity,<br />\nHENRY M. HUED, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nAnnual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students and stating the<br />\nPublished at the<br />\nregulations, etc. of the University. '<br />\nclose ofthe academic year.<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL,. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. H. Hall. $3.00.<br />\n1118LI0GRAPHIA HOPKINSIENSIS. Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications 1n respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br /><br />\nA<br /><br />\nCbe news= Letter. *<br />\nVol. V.<br /><br />\nFebruary 7, 1901.<br />\nA BORDER RAID.<br /><br />\nthe broad south porch of the farm house,<br />\nONwhere<br />\nearly sunshine streamed through a<br />\nscreen of morning-glory vines, covering the<br />\nwhite weatherboards with distorted tracery and<br />\nflecking her blue calico with spots of light,<br />\nDorothy stood beside a tall old-fashioned churn.<br />\nShe had sent the dasher plunging up and down<br />\nwith a steady chug! chug! that the wood-shed<br />\nand kitchen tossed back and forth between them<br />\nin little echoes,until butter had come,and now she<br />\nstopped to rest. Leaning thoughtfully on the<br />\nlong handle she looked out across the sloping<br />\nbarnyard, over the valley that swam in summer-haze to the blue hills beyond. Behind<br />\nthose hills was Mason and Dixon's line, which<br />\ntwo years of civil war had made bitterly significant as the boundary line ofslavery and rebelllion.<br />\nA turnpike that ran by the house and curled<br />\nround a knoll a little above it, showing at the<br />\nturn a last gleam of dusty white limestone, ran<br />\nstraight to those hills and on into the south.<br />\nFrom this same porch, at the beginning of the<br />\nwar, Dorothy had watched her two brothers<br />\nmarch away with the village company over that<br />\nturn of the road while the squeak of fifes and<br />\nthe rub-a-dub of Fent Johnson's drum sounded<br />\nacross the pasture. A year before that Frank<br />\nhad reined in his horse at the same spot to whve<br />\nhis hand to her befote he galloped away toward<br />\nVirginia.<br />\nEvery summer since he had left the village to<br />\nmake his home with a southern uncle, Frank<br />\nhad ridden across country to visit his relatives<br />\nin the little valley. Dorothy remembered how<br />\nin that year, the year her mother had died, they<br />\nwalked out in the moonlight the evening before<br />\nhis departure past the churchyard where the<br />\nstones looked like piles of shining snow, to the<br />\nold beech at the school-house with F. &amp; D.<br />\ncarved in boyish jackknife cuts on its smooth<br />\nbark.<br />\nPerhaps he would never come again, thought<br />\nDorothy, now deep in reverie, remembering the<br /><br />\nNo.<br /><br />\nharsh words she had heard in his father's house<br />\nwhen the news spread through the neighborhood<br />\nthat Frank Walters had joined the rebel army.<br />\nDorothy's thoughts had strayed far from her<br />\nchurning and were wandering in troubled loyalty<br />\ninto the region south of the blue haze. Now her<br />\nreverie was broken rudely. Over the brow of<br />\nthe hill rode a horseman, then another, and a<br />\nthird ; and three Union scouts came at a tired<br />\ntrot down the road. Mr. Miller, Dorothy's<br />\nfather, was already at the gate, waiting to ask<br />\nfor news and to invite them in.<br />\nThe day before a warning had come that there<br />\nwas danger of a raid across the border, and prudent farmers had been hiding provisions and<br />\ndriving their cattle up into remote wood-lotsfor<br />\nsafety. Indeed, some had thought that Mr.<br />\nMiller himself was in danger, should the raiders<br />\ncome, for he had been known before the war as<br />\nan ardent and outspoken abolitionist and a<br />\nhelper of runaway slaves. Some alleged violations of the rights of non-combatants in the<br />\nSouth had given rise to vague threats against<br />\nhim that had reached his ears, but he was unwilling to leave his daughters alone, and so<br />\ngave little heed to his neighbors' advice to flee.<br />\nThe scouts brought news that a raiding party<br />\nwas out in force a few miles to the southwest<br />\nfollowing an uncertain course. They themselves<br />\nwere on their way to a point of vantage behind the town. One of their number held the<br />\nhorses ready for instant mounting, while his<br />\ncompanions laved their dusty faces at the pump<br />\nand sniffed savory odors of frying ham from the<br />\nkitchen. Little Jennie, Dorothy's sister, climbed<br />\nthe sheep-pasture hill from which she could see a<br />\nmile up the road, and stood sentinel while they<br />\nrested.<br />\nJust as Dorothy with wooden bowl and salt<br />\njar turned to go.to the spring-house, and black<br />\nSusan showed her shining face at the kitchen<br />\ndoor to say,\"Most ready, boys!\" Jennie came<br />\nrunning and screaming. The disappointed soldiers seized canteen and knapsack, tumbled into<br />\ntheir saddles, and were off in a moment.<br /><br />\n•<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThey were hardly out of sight when the head<br />\nof a column of troopers with dingy gray uniforms<br />\nand slouch hats appeared at the turn of the road.<br />\nSusan dropped her kettles and pans and scrambled in ashen terror to a hiding place in the garret, for she was an escaped slave. Mr. Miller,<br />\nafter lingering almost too long,ran at Dorothy's<br />\nearnest entreaty to conceal himself in an empty<br />\ncorn-crib. A moment later the yard was full of<br />\nrebel soldiers, and a young officer was asking<br />\ncourteously enough for Mr. Miller.<br />\nDorothy, secretly wondering at his honest face<br />\nand easy manner, answered, \"I don't know<br />\nwhere he is, and I certainly should not tell you if<br />\nI did.\"<br />\nThe officer smiled.<br />\n\"I suppose a little fib is excusable under the<br />\ncircumstances,\" he said, \"but we feel pretty sure<br />\nhe's here. I must ask you to remain where you<br />\nare while my men search the place.\"<br />\nFrom her seat on the trellised stoop, Dorothy<br />\ncould see the door of the crib in which her father<br />\nwas hiding, and she watched it anxiously as a<br />\ndetail of men went toward the outbuildings.<br />\nThe next moment she was soothing Jennie, who<br />\nhad been startled into frightened screams by the<br />\nsudden appearance of a soldier in the room in<br />\nwhich she had taken refuge. The officer reassured them, and ordering a soldier to see that<br />\nthey were not molested, retired for a conference<br />\nwith his guides.<br />\nMeanwhile the search went on. It was orderly<br />\nenough at first; but the drink from a looted tavern had made the men reckless, and they were<br />\nsoon engaged in wanton pillage. Drawers and<br />\nchests were broken in search for valuables and<br />\ntheir contents strewed about. The searchers<br />\nspread devastation in the larder, and brought<br />\nruin to the kitchen, garden and spring-house.<br />\nDorothy gave little thought, however, to the<br />\nsounds of destruction about her. She was anxiously watching the corncrib. Her face paled a<br />\nlittle as she saw a tall raider enter the door and<br />\ndisappeared, within, and her heart sank in hopelessness. The crib was empty and the search<br />\nwas so thorough that there was no hope that<br />\nher father would not be seen.<br />\nPresently the soldier appeared again, alone,<br />\nslammed the door behind him and called to his<br /><br />\ncompanions. Dorothy looked in joyful wonder<br />\nas the searching party came leading a number of<br />\nhorses to report that Mr. Miller could not be<br />\nfound. She would have wondered no less had<br />\nshe been able to see what went on all this time<br />\nbehind the weather-stained boards of the crib.<br />\nThrough the cracks in the crib Mr. Miller had<br />\nwatched the soldiers and had heard drunken<br />\nthreats of \"hanging to the nearest tree.\" He<br />\nhad heard Jennie's scream, and filled with a horrible fear, he could hardly keep from rushing out,<br />\nhelpless as he was. Then the door had opened,<br />\nand a tall young raider walked to the hogshead<br />\nbehind which he was hiding and looked down<br />\nupon him. Mr. Miller rose to surrender himself,<br />\nwhen to his surprise the soldier pressed him<br />\ndown with, \"Keep still, man, keep still!\" Then<br />\nwalking quickly to the door he called to his companions, \"He's not in here, boys; come on, let's<br />\ngive it up!\" And the party went away leaving<br />\nMr. Miller surprised and puzzled at his strange<br />\nescape.<br />\nOld Susan's fear had sharpened her wits, and<br />\nthe search of the house had been equally fruitless.<br />\nDorothy stepped back into the doorway as the<br />\ntroopers crowded again into the yard and prepared to mount. Before her on the stoop Jennie<br />\nstill sobbed, and the house dog Plato at her feet<br />\ngrowled at the intruders. She heard a step in<br />\nthe hall behind her, and a strangely familiar<br />\nvoice said softly,\"Dorothy!\"<br />\nShe turned,startled,and saw a dusty,sunburned<br />\nsoldier. It was a moment before she recognized<br />\nhim.<br />\n\"Oh! Frank,\" she gasped, and she laid a restraining hand on Plato's nose.<br />\n\"Hush,\" said he, they mustn't see me talking<br />\nto you. Tell your father to get out of that crib<br />\ninto the woods,for we're coming to look for him<br />\nagain. Don't forget me, Dorothy. Good bye!\"<br />\nThen he walked rapidly out past her and<br />\njoined his comrades. The soldiers lingered a moment caring for their horses, and then at a few<br />\nsharp words of command,with a rattle of accouterments and a thunder of hoofs the column disappeared behind a cloud of dust on its way<br />\ndown the valley.<br />\nNext day the raiders came back on their way<br />\nsouth. Both Mr. Miller and Susan had found<br /><br />\n;f<br /><br />\nTHE NEWS-LETTER.<br />\nsafer hiding places, and wisely; for a squad of<br />\ntroopers had surrounded the house at night<br />\nthinking he might return.<br />\nDorothy stood in the door to watch the long<br />\nprocession go by. First came a great herd of<br />\ncattle and a string of captured horses, and then<br />\nthe long column of soldiers laden with all sorts<br />\nof plunder. Her glance singled out a trooper in<br />\ntattered gray who dared give her only a look or<br />\nrecognition. At the bend in the road he turned<br />\nin his saddle to look back,and then the dust hid<br />\nhim from her sight. She watched till the column<br />\ndisappeared over the hill, and with a little song<br />\non her lips, turned again to her work.<br />\nF.<br />\nsr Of OF<br /><br />\nTHE ANNUAL FEED.<br />\nfourth annual \"Feed,\" held to celebrate<br />\nTHEHopkins<br />\nathletic victories, proved a decided success. One cause of this was the fact that<br />\ncertain novelties were inserted in the programme<br />\nwhich, heretofore, has consisted chiefly of burlesque athletic \"stunts,\" as sack-races and<br />\nchicken-fights. Friday night's exhibition dispensed with these hackneyed pastimes, and while<br />\nmuscle received its proper place in the exercises,<br />\nart and science were also encouraged. Musical<br />\nart, in the \"Submarine Band ;\" figurative art,<br />\nin the living picures; and decorative art, in the<br />\nblackened-glove contest: science,in the hypnotic<br />\nexhibition. These inovations emanated chiefly<br />\nfrom the resourceful brains of Billy Maddren<br />\nand Physical Director Mackdermott.<br />\nThe programme opened with speeches by Dr.<br />\nRemsen, President Gilman and Dean Griffin. Dr.<br />\nRemsen recounted the athletic achievements of<br />\nHopkins during the past year. Dr. Gilman in<br />\nhis address told the audience how he once informed a delegation of Harvard professors that<br />\nthe honor of having H. U. after one's name was<br />\ngreatly increased by prefixing a j.<br />\nThe surprise of the evening was sprung upon<br />\nthe audience when Boozer's Submarine Band,<br />\nclad in white duck, and barten<br />\npardon<br />\nus, we mean white jackets, filed out upon the<br />\nstage. Then the house was served up a rich<br />\nmusical treat. Instrumental solos and trios, interspersed with full orchestra (later the orches-<br /><br />\n3<br /><br />\ntra was fuller) pieces were encored again and<br />\nagain. The Dean said: \"Never has music moved<br />\nme so before,\" while we observed that President<br />\nGilman was even further moved—(all the way<br />\nout of the building). The living pictures were,<br />\nfor the most part, of a strictly moral nature,<br />\nwith the exception of one, concerning which,<br />\nAnthony Comstock, and the anti-vice crusaders<br />\nmight have taken issue.<br />\nPete Moore posed as the Greek discus thrower,<br />\nand it is a pity some of his fair admirers could<br />\nnot have heheld him clad in spotless white.<br />\n\"Abbie,\" as the Lacrosse Player; Hoffman<br />\nand England, as the Runners; and Sayler, as<br />\nthe Foot-ball Player, were loudly applauded.<br />\nHaughton was \"a perket lady.\" HiS Carmencita \"stunt\" was excellently rendered, and if he<br />\ncan get into shape WC would advise him to start<br />\nin life as a chorus-girl. When he appeared on the<br />\nstage several students in the audience were<br />\nheard to remark : \"Is'nt she natural; looks ex;\" but here the Boozer band<br />\nactly like<br />\ndrowned the name. The Hopkins Banjo Club<br />\nfurnished some admirable \"ragtime\" music,<br />\nand then Maddren kept everyone interested in<br />\nan exhibition of hypnotism. This was the feature of the evening. After putting his negro<br />\nsubjects through all manner of odd tricks, he<br />\ndemonstrated the genuineness of the performance<br />\nby allowing one of the audience to stick a pin<br />\ninto the hand of a hypnotised person without<br />\ncausing the latter any pain. Mr. Maddren has<br />\nbeen studying the subject of hypnotism about<br />\nfour months, and in that short time has become<br />\nrather familiar with it, as was demonstrated<br />\nFriday night.<br />\nNext, the crowd adjourned to the cage and<br />\nwatched Zaza and Sapho, otherwise Snowden<br />\nand Hopper,decorate each othar's anatomy with<br />\ncharcoal. There was not time to weigh out the<br />\namount of charcoal deposited on each, so the<br />\nmatch was called a draw.<br />\nIn an exciting,three-heat obstacle race, Winternitz came off victorious. Owing to the lateness<br />\nof the hour the tug-of-war between the Junior<br />\nand Freshman classes was called off. \"Back to<br />\nthe Gym\" was the signal then given, and there<br />\nthe \"feed,\" consisting of chicken-salad, rolls,<br />\nice cream, cake and coffee was served.<br /><br />\nPRESS OF ISTONEBRAKER BROS., BALTIMORE.<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br />\ntbe 14ews.Zetter.<br /><br />\nPublished Fortnightly during the University Year<br />\nStudents Of THE JOHNS<br /><br />\nby the<br /><br />\nHOPKINS UNIVERSITY.<br /><br />\nFEBRUARY 7, 1901.<br />\n•<br />\nSubscription $1.50 per<br /><br />\nEditor in Chief,<br /><br />\nyear.<br /><br />\nJo cents a single copy.<br />\nNORMAN HOVER, 1901.<br /><br />\n.<br /><br />\nJOHN M. HOOKER, 1901.<br /><br />\nAssociate Editor in Chief,<br /><br />\nWILLIAM 13, HILL, 1902.<br />\nBERN C. HILL, 1902.<br />\nSOL STROUSE, 1902.<br /><br />\nNews Editors,<br /><br />\nf JOHN<br /><br />\nA. SLEMONS, 1902.<br />\n.YMAN C. MURPHY, 1902.<br /><br />\nAthletic Editors,<br />\nBusiness Manager,<br /><br />\n.<br /><br />\n.<br /><br />\nAssistant Business Manager,<br /><br />\n.<br /><br />\nJOHN M. HANDEL, 1901.<br /><br />\nAUBREY PHARR E, JR., 1902.<br /><br />\nAddress all articles, communications, etc., to<br /><br />\nNORMAN BOYER.<br /><br />\nbox 96,johns Ifopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br /><br />\nJOHN M. BANnim, box 94, J<br /><br />\nH. U.; or box 30, Medical School of<br /><br />\nJohns Hopkins Hospital.<br /><br />\nwhich arranged and carried<br />\nTHEoutCommittee<br />\nthe program of the Feed last Friday<br />\nnight deserves the hearty congratulation of the<br />\nwhole University for the able manner in which<br />\nthe whole affair was conducted. Everything<br />\nwent off smoothly and pleasantly, and there<br />\nwas not a hitch. The orderly way in which the<br />\nentertainment proceeded in every respect was in<br />\ndelightful contrast to some of the bargain-counter rushes that have been witnessed in past<br />\nyears.<br />\nThe Feed was undoubtedly the best that has<br />\never been given, and it is to be hoped that the<br />\nfinancial success will be as great as the artistic,<br />\nThe Committee showed much originality in their<br />\nselection of attractive features of entertainment,<br />\nand great credit is due Messrs. Maddrcn and<br />\nMackdermott, who planned and superintended<br />\nthe effective presentation of the various numbers.<br />\nThe Banjo Club responded to the appeal for aid<br />\nin a gratifying way,and the hypnotic exhibition<br />\nvvas the finest thing yet.<br />\nw w<br />\nMANAGERS of Hopkins teams who have<br />\nflitted vainly from one place to another interviewing league magnates and dick ering with<br />\nrival claimants for tile temporary use of a small<br />\nbut exceedingly, valuable piece of ground up in<br />\nNorth Baltimore,and athletic captains who have<br />\nbeen compelled to take their men for spring practice away out beyond the city limits, will rub<br /><br />\ntheir hands with joy at the tidings that the<br />\ndream of years is about to be realized. Johns<br />\nHopkins University, planted on the sloping side<br />\nof a hill amid surrounding dwellings and busy<br />\ntrade, and an open campus with space for all<br />\nkinds of games and the additional charm of practical ownership seem too mutually foreign ever<br />\nto have ary real connection. But if the negotiations at present under way do not fail, another season will see us in practical possession<br />\nof a lacrosse and foot-ball field with suitable<br />\naccommodations for track and field sports.<br />\nThis will without doubt be the greatest step<br />\ntaken in athletics in years, perhaps the greatest<br />\nthat we have ever taken at one time. The building of the cage was a great achievement, and<br />\none that was in the highest degree appreciated,<br />\nbut that was recognized as but a preliminary<br />\nstep to the acquisition of an outdoor practice<br />\nground. The list of athletic victories for 1900<br />\nthat was announced at the feed on Friday was<br />\na remarkable one for a city university. With a<br />\npermanent field at hand, the list for 1901 should<br />\nbe still better, and doubtless Director Mackdermott expects it to be. The credit for this admirable move is, indeed, due mainly to Mr.<br />\nMackdermott, and is only one of the many<br />\nimprovements that have been instituted under<br />\nhis regime.<br />\noir 9r fr<br /><br />\nA GAIN AND A LOSS.<br />\nJust as we are going to press comes the news<br />\nthat a great tract of over 150 acres of valuable<br />\nland on Charles Street Avenue has been offered<br />\nas a gift to the University, with the understanding that at such time as the circumstances shall<br />\npermit, tile University shall be established permanently upon that site. The condition attached<br />\nto the gift is that the sum of $1,000,000 shall be<br />\nraised lw other friends of the University in order<br />\nto enable it to carry out the plan of removal.<br />\nThe trustees expect to be able to raise the sum<br />\nwithout difficulty. This news is the most encouraging that has been announced concerning<br />\nthe Hopkins for years—the greatest endowment<br />\nsince that of fhe founder himself. The generous<br />\nand spirited donors of this gift are Mr. William<br />\nWyman, Mr. William S. Keyser, Mr. Francis M.<br /><br />\n41.<br /><br />\n9<br /><br />\n5<br /><br />\nTHE NEWS-LETTER.<br /><br />\nJencks, and an unknown gentleman. A fuller<br />\nEXCHANGE PLACE.<br />\naccount must be reserved until our next issue.<br />\nAnother surprise is the announced resignation<br />\nF.iIia: \"Father, why do you call my allowof Dr. Herbert B. Adams, head of. the Historiance pin money?\"<br />\ncal Department, on account of continued illPater: \"Because I got stuck for it, my dear.\"<br />\nhealth. Dr. Adams' departure will be regretted,<br />\n—Ex.<br />\nby all students who have come in contact with<br />\nWWW<br />\nhim.<br />\n\"They tell me, Professor, that you have mastered all the modern tongues.\"<br />\nEXTRA LECTURES IN FEBRUARY<br />\n\"Yes,\" answered the Professor, \"all but two,<br />\nwife's and her mother's.\"<br />\nmy<br />\nMARCH.<br />\nAND<br />\n—Ex.<br />\nse,WW<br /><br />\nJohns Hopkins University has announced<br />\nTHEseveral<br />\nextra courses of lectures which<br /><br />\n\"Paw! Say, paw,\" little Johnnie began\"Now what do you want?\" asked the suffering<br />\nfather with the emphasis on the \"now.\"<br />\n\"Will my hair fall off when it's ripe like<br />\nyours?\"<br /><br />\nshould be of great interest and importance to all<br />\nstudents of History, Politics, and Economics.<br />\nThey will be distributed through the remaining weeks of February and March. The sched\"I was mimicking Prof.— the other day, and<br />\nule is:<br />\ncaught me at it.\"<br />\nbe<br />\nC.<br />\nof<br />\nD.<br />\nWashington,<br />\nBancroft,<br />\nDr. Frederic<br />\ndid he say ?\"<br />\n\"What<br />\nlectures<br />\nTwelve<br />\n12th.<br />\nMarch<br />\nFebruary 4th to<br />\nme to stop making a fool of myself.\"<br />\ntold<br />\n\"He<br />\n1840-1861.<br />\non U. S. History,<br />\n—Ex.<br />\nUniverStanford<br />\nLeland<br />\nof<br />\nDr. E. D. Durand,<br />\n611r W<br />\nlecThirty<br />\n20th.<br />\nMay<br />\nto<br />\nsity, February 4th,<br />\nJimmy: \"Ain't it good of the school board to<br />\ntures on American Finance.<br />\nand<br />\n8th<br />\n1st,<br />\nup the school in the summer so we can<br />\nshut<br />\nFebruary<br />\nLee,<br />\nDr. Guy Carleton<br />\ncourse<br />\nhis<br />\nof<br />\nrest.\"<br />\nconclusion<br />\na<br />\nin<br />\nhave<br />\n15th. Three lectures<br />\n\"Aw, dat ain't de reason. Dey haf<br />\nTommy:<br />\non English History.<br />\nSix<br />\nteachers a chance to learn some<br />\n30th.<br />\nto<br />\nthe<br />\n1st<br />\nMarch<br />\ngive<br />\nSykes,<br />\nto<br />\nMr. Frederick<br />\n—Ex.<br />\nLiterature<br />\nmore.\"<br />\nlectures on English<br />\n.A6 ser 141'<br />\nMarch<br />\nEngland,<br />\nof<br />\nHarrison,<br />\nMr. Frederick<br />\n6th and 7th. Two lectures on Alfred the Great.<br />\n\"Holy smoke!\" said Satan, as he tossed on<br />\nProfessor M. L. D'Ooge, March 8th. One lec- another bishop.<br />\n—Chicago Weekly.<br />\nture on Delphi and the French Excavations.<br />\nProfessor J. B. Moore, of Columbia UniverProfessor(who has been floored by inquisitive<br />\nsity, March 19th to 21st. Two lectures: (1)<br />\nPolicy<br />\nOur<br />\n(2)<br />\nSpain;<br />\nwith<br />\nFreshman.) \"Mr. Brown, a fool can ask a quesOur Treaty of Peace<br />\ntion that ten wise men could not answer.\"<br />\nin the Far East.<br />\n20th<br />\nMarch<br />\nBoston,<br />\nof<br />\nMr. Brown,'04: \"I guess that's why so many<br />\nDr. James Schouler,<br />\nhis<br />\n—Harvard Lampoon.<br />\nof<br />\ncontinuation<br />\nin<br />\nof us flunk.\"<br />\nto 29th. Four lectures<br />\nRethe<br />\nof<br />\nFounders<br />\nthe<br />\ncourse of last year on<br />\nWW<br />\npublic: (1)John and Samuel Adams; (2)James<br />\n\"My father worked his way through college.\"<br />\nMadison; (3)John Jay and John Marshall: (4)<br />\n\"That's about what I'm doing.\"<br />\nJames Madison.<br />\nthat?\"<br />\n\"What's<br />\navail<br />\nwill<br />\nman<br />\nHopkins<br />\nIt is hoped that every<br />\nworking father for my way through.\"<br />\nI'm<br />\n\"Yes:<br />\nlecthese<br />\nattend<br />\nto<br />\nhimself of the opportunity<br />\n—Cornell Widow.<br />\ntures.<br /><br />\nPRESS OF 6TONEBRAKER BROS., BALTIMORE.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br /><br />\ncheers and \"Hullabaloos,\" they separated,some<br />\ngoing home to rest and dream of the fair faces of<br />\nJohns Hopkins Musical Clubs paid a the evening, while others hastened to an adHE<br />\nHying visit to Annapolis on Saturday, Jan- journed meeting of the \"M. R. W.,\" held at the<br />\nuary 26th. The men assembled at Camden Sta- \"Maryland Hotel.\" Here toasts were given<br />\ntion at 4 o'clock, and, after an anxious wait for and songs were sung till the Annapolis police<br />\nPresident King and the tickets, boarded their became nervous and decided to join the feast.<br />\nPrivate ear which was hitched to a supposed Their unwillingness to submit to the necessary<br />\nexpress train. Judging from the way in which initiation caused great discontent among the<br />\nthat train stopped at every apology for a station, members, and the meeting had to he adjourned.<br />\nThe next morning at nine o'clock, everybody<br />\nhowever, an aCC01111110dati011 train would have<br />\nto stop at every cross tie. Nevertheless the ride met once more at the station and took the train<br />\nwas thoroughly enjoyable, and few of the men for home. These short trips are really more enwere glad to bestir themselves and get out into joyable than the extended Christmas and Easter<br />\nthe snow when the train finally pulled into the trips, and, as there are going to be quite a numstation at Annapolis. Arrangements had been ber of these during the next two months, more<br />\npreviously made as to lodging the men,and soon Hopkins men should avail themselves of the<br />\nall were showing their appreciation of the good pleasures derived from the Clubs. There are<br />\ndinners and their hospitable welcome. Indeed several positions now open on the clubs to men<br />\nsuch attention and kindness was paid them that who are willing to give some of their time to<br />\nseveral remained over at the risk of paving their good, hard practice,<br />\nsr sr sr<br />\nown way home.<br />\nSOME MUSICAL HINTS.<br />\nThe concert was given in the U. S. Armory,<br />\n-inside the Academy grounds, and the Clubs were Bditor-in.Chief of THE NEws•LE'rrEE,<br />\nThe Johns Hopkins University.<br />\ngreeted by an enthusiastic audience numbering<br />\nDear Sir: In looking over the article in the last issue<br />\nabout six hundred. The concert itself was not of your paper entitled \"Heard in the Rear,\" in which<br />\nquite as good as usual, for the length of the the author undertakes to criticise the work of the<br />\nbuilding and the great number of girders over- Musical Clubs in the Baltimore Concert, I noticed<br />\nhead made the volume of the Clubs seem weak. several assertions that in my mind will work injury<br />\nThese unfavorable conditions, however, did not to the Clubs. So, as I paid the utmost attention to<br />\nevery piece in this concert, and have listened to a<br />\naffect the Mandolin Club as much as the other number of discussions by musical critics concerning<br />\nclubs, for the sharp sound of the mandolins the merits of the clubs, I have determined to seek the<br />\nseemed to carry the whole length of the hall and use of your columns in order to praise the men and<br />\nthe Club played in better time and with more leaders for their excellent work and to offer a few<br />\nexpression than in any otherconcert this season. suggestions which may perhaps benefit concerts in<br />\nthe future.<br />\nMr. Swindell's absence was felt by all the Clubs,<br />\nIn the first place, I must congratulate the men for<br />\nand it is hoped that he will soon be back in the one of the best concerts ever given in Baltimore by<br />\nranks. Mr. Sneeringer took his place as \"end any College organization. The selections were all<br />\n\"Rhoda\" well chosen, and the medlies showed most skillful<br />\nman,\" and sang \"Goo-goo Eyes\"<br />\narrangement. One mistake that has, in some inexpliwith good success.<br />\ncable way, been spread broadcast is that \"My Lady<br />\nAfter the concert a reception was given in the l,u\" is an old piece. Now this is not the ease for it<br />\n\"Chase Home,\" orw of the finest old houses in came into popularity during the middle of last sumAnnapolis. A number of the town's fairest mer, In fact the Glee Club music is all recent except<br />\nmaidens were present and received the men with one medley and the two University odes. Then, as to<br />\npraise and smiles and chicken salad, all of which the Mandolin Club being inferior to last year, I think<br />\nthis is most decidedly incorrect, and I am strengthwere highly enjoyed. just before leaving, the ened in my opinion by the majority of those who<br />\nmen got together and sang in pathetic strains, heard the clubs last year. True, the Mandolin Club<br />\n\"Bring the Wagon Home, John,\" and \"Don't last year, raised the standard much higher than it<br />\nForget the Hopkins Lads.\" Then, with a few<br />\n1C0NTINuEn ON PAGE 1.1..}<br />\nTHE ANNAPOLIS CONCERT.<br /><br />\nT<br /><br />\n-7'<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nstick in the manner of a drum major, and with<br />\na mighty swagger. His evolutions were cut<br />\nEditor in ChiefNews Letter,<br />\nshort by a murmer which ran among the crowd<br />\nDear Sir:—I enclose the following account of to the effect that the animals were out. He<br />\nthe Zoo's destruction,as I think our college pa- dropped his stick, said he guessed he'd go home,<br />\nper's next issue should contain some graphic and \"took out.\" His lieutenant said, \"I ain't<br />\naccount of that catastrophe. I do not care to goin' to run,\" and followed the drum major.<br />\nappend my name to the article, as I am not The rest of the band rapidly dispersed. One boy<br />\nwriting for fame, but for the \"joy of the work- ran up behind a fat old colored woman, and<br />\nbarked so ferociously, that the unoffending old<br />\nYours respectfully.<br />\ning.\"<br />\ntaken by surprise, completely collapsed,<br />\nlady,<br />\nN. B. I have decided to sign with my class nudown upon the pavement with force.<br />\nsitting<br />\nmerals, as I think everyone should endeavor<br />\nof the great beauty of the fire, I found<br />\nspite<br />\nIn<br />\nto shed as much lustre upon his class as possible.<br />\nmyself speculating upon the terrible conseTHE BURNING OF THE ZOO.<br />\nquences of wild animals running amuck among<br />\ncrowd. (Only a lack of space prevents the<br />\nthe<br />\nlooked<br />\nI<br />\nsomewhere.<br />\nout<br />\nrang<br />\ncry<br />\nFire! The<br />\nof the author's speculation, which<br />\npublication<br />\nthe<br />\nupon<br />\nsnow<br />\nthe<br />\nsee<br />\nto<br />\nout of the window<br />\nvivid<br />\naccount in twelve sheets of what<br />\na<br />\ngives<br />\na<br />\nwith<br />\ntinged<br />\nhousetops<br />\nneighboring<br />\nstreets and<br />\nconflicting feelings would be, if<br />\nand<br />\ntorn<br />\nhis<br />\nand<br />\nhat<br />\nmy<br />\ndonning<br />\nHurriedly<br />\nruddy glow.<br />\n\"terrible consequences.\" This<br />\nany<br />\nwere<br />\nthere<br />\ndoor<br />\nthe<br />\nbanging<br />\nstreet<br />\nthe<br />\ninto<br />\ncoat, I rushed<br />\ninto a tirade upon \"caremerges<br />\nspeculation<br />\nilluminated<br />\nbrilliantly<br />\nwas<br />\nafter me. The sky<br />\npublic<br />\nbuildings, built with a<br />\nconstructed<br />\nlessly<br />\npeoof<br />\nThrongs<br />\nreach.<br />\ncould<br />\neye<br />\nas far as the<br />\ncloses with a symand<br />\nfire,\"<br />\nto<br />\ncatching<br />\nview<br />\nheavens<br />\nthe<br />\nof<br />\npart<br />\nthat<br />\ntowards<br />\nple streamed<br />\nanimals and<br />\npent-up<br />\nthe<br />\nfor<br />\noutburst<br />\npathetic<br />\napproached.<br />\nI<br />\nas<br />\nperceptibly<br />\nwhich brightened<br />\nof the<br />\nmember<br />\na<br />\nbecome<br />\nto<br />\nthe<br />\ndetermination<br />\npeople,<br />\naged<br />\nmiddle<br />\npeople,<br />\nyoung<br />\nOld people,<br />\nroof<br />\nwith<br />\nrecalled<br />\nthe<br />\nof<br />\nfalling<br />\nThe<br />\nA.)<br />\nC.<br />\nP.<br />\nS.<br />\npeople—their<br />\ncolored<br />\nmostly<br />\nand colored people,<br />\ncrash,<br />\nA<br />\ngreat<br />\nthoughts.<br />\nwandering<br />\nmy<br />\nstart<br />\na<br />\nshone<br />\nlight,<br />\nyellow<br />\nthe<br />\nby<br />\nebony faces touched<br />\nwith the subdued ruddiness of bronze. (The followed by a shower of sparks shooting upeditor reluctantly omits the author's brief re- wards into the azure of the sky, cast over the<br />\nflections covering sixteen sheets of foolscap upon: ashen features of all a purple glow. An enor(1), the multitude of people, representing so mous cloud of smoke hung for an instant like a<br />\nmany and such varied interests; (2), the holi- black pall over all. Then it billowed away.<br />\nday spirit which had \"grafted itself upon them;\" The fall of the roof left several solitary poles<br />\n(3), the good humor and \"bonne commarady standing, up which the lurid flames languidly<br />\nwhich saturated the atmosphere;\" (4), \"the licked. The glory of the fire went with the roof,<br />\nevident interest which pervaded the whole;\" and beyond a few live wires performing in the<br />\n(5), a dissertation upon curiosity and its not near foreground, nothing more of interest<br />\ninfrequent unhappy consequences, as exemplified occurred. The great crowd slunk away, and I<br />\n1903.<br />\nby a certain precocious child and a live wire. slunk with it.<br />\nAir w or.<br />\nthe<br />\nupon<br />\nposition<br />\na<br />\nfor<br />\ntrying<br />\nis<br />\nThe author<br />\nMAY HIS SHADOW NEVER<br />\nNEWS LETTER staff. The omitted matter is of a<br />\nGROW LESS.<br />\nquality that assures him his place upon the board )<br />\nSeveral people cried out that the Zoo was on fire.<br />\nHe's only a scrub in our Hopkins cage,<br />\nYet a noble sight to me,<br />\nThe fire itself was now in sight though several<br />\nhis time for the 'Varsity's sake,<br />\nWasting<br />\nforhurried<br />\nI<br />\npace,<br />\nmy<br />\nsquares off. Quickening<br />\nHe knows what he cannot be.<br />\nof<br />\noutskirts<br />\nthe<br />\nUpon<br />\nZoo.<br />\nward. It was the<br />\nYet he works and grinds for others' rewards<br />\nthe crowd, a negro urchin, who was leading a<br />\nWrite his name on our history's page,<br />\nband of boys somewhat smaller than himself,<br />\nWhat he tried to do for the Black and Blue,<br />\nThat scrub in the Hopkins cage. —Husky.<br />\nattracted m v attention. He wielded a broom-<br /><br />\nAN ESSAY.<br /><br />\nPR<br /><br />\nOF STONEBRAKER<br /><br />\nBROB., BALTIMORE.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br />\nHOPKINS TO HAVE OUTING<br />\nGROUNDS.<br /><br />\nABALTIMORE paper last Friday morning contained about a column ofnews concerning the<br />\nnew outing grounds which we hope to secure<br />\nthis spring. Mr. Mackdermott says he does not<br />\nknow where this article originated,as the matter<br />\nwas to be kept a profound secret until his plans<br />\nwere fully matured; but since he has been anticipated by the newspaper, he adds that the<br />\nJohns Hopkins Athletic Association has been incorporated, and that we are to have a share in<br />\nthe new baseball grounds which are about to be<br />\nestablished by the American League Base-ball<br />\nClub. The new grounds will be a short distance<br />\nfrom Union Park—York Road and 29th Street,<br />\nand will have the same seating capacity as the<br />\n01(1. There will be a grand stand and two sets<br />\nof bleachers, one in left field, the other in right.<br />\nInstead of a club house, as the paper stated, to<br />\nbe used by baseball players as well as Hopkins<br />\nstudents, Hopkins will build her own club house<br />\non the grounds, near centre field, for the exclusive use of her own men. The club house will be<br />\nfitted out with locker room, shower baths, rubbing boards, and all other modern attachments.<br />\nThe one thing we have needed above all others<br />\nfor past years,is a campus; some place where our<br />\nteams may practise in the open,and not have to<br />\nhe caged up, playing by gas light half the time.<br />\nWhy have our base-ball teams been a failure?<br />\nSimply for lack of grounds on which to practice.<br />\nWhy has Hopkins above all other universities,<br />\nalways lacked that true college spirit which<br />\nshould be identical with every college or university? Because the Hopkins University is situated in the heart of the city, surrounded on all<br />\nsides by dwellings, with not the least excuse for a<br />\ncampus, and second, because we have no dormitory life. When an athletic field is secured, it is<br />\nto be hoped that these obstacles will be done<br />\naway with to a great extent, and there is no<br />\nreason whyHopkins,after securing these grounds,<br />\ncannot shove her athletic teams to the front,<br />\nand put them on a level with those of other<br />\nprominent universities and colleges in the country. It might be well to say that this attempt<br />\nat securing outing grounds may be solely attrib-<br /><br />\nuted to Mr. Mackdermott's unrelaxing interest<br />\nin Hopkins athletics, and if the grounds are obtained, it will be another step onward toward<br />\nthe goal which \"Mac\"and our teams deserve to<br />\nreach.<br /><br />\nATHLETIC NOTES.<br />\nschedule has been arranged<br />\nTHEforfollowing<br />\nthe championship series of foot-ball<br />\ngames for the season 1901-1902:<br />\nNov. 9th.—St. John's vs.Western Maryland, at<br />\nWestminster.<br />\nNov. 16th.—Johns Hopkins vs. St. John's, at<br />\nBaltimore.<br />\nNov.-23rd.—Johns Hopkins vs. Western Maryland, at Baltimore.<br />\ngir 9r or<br />\nThe contest for the tennis championship of<br />\nthe Maryland Intercollegiate association will be<br />\nheld in the Hopkins cage on Wednesday, May<br />\n15th, at 10 A. M.<br />\nsr or sr<br />\nThe annual track and field championship games<br />\nwill be held in Baltimore, on Saturday, May<br />\n18th. A special committee has been appointed<br />\nto take charge of these games and consists of<br />\nWm. M. Mackdermott, Hopkins, Chairman;<br />\nJames A. Fechtig, St.Johns; and Wm. M. Black,<br />\nWestern Maryland.<br />\nsr sr or<br />\nAn Athletic Association has been added to the<br />\nHopkins Club through the instrumentality of<br />\nMr. Mackdermott. Under the auspices of this<br />\nbranch of the Hopkins Club, Mr. Morfit Mullen<br />\nwill compete in the B. A. C. games which will<br />\nbe held at the Fifth Regiment armory this<br />\nmonth. A baseball club will also be organized<br />\nby Mr. Geo. C. Morrison, an old Hopkins baseball player, which will play during the summer<br />\nmonths.<br />\nmir<br />\nAn addition soon to be made to the cage will<br />\nbe a gallery across the west end. This gallery<br />\nwill be ten feet from the ground and ten feet<br />\ndeep, with a seating capacity of several hundred.<br />\nAs soon as pleasant weather comes and the lacrosse team is able to practice out of doors, work<br />\nwill begin upon this most valuable addition.<br /><br />\nTHE NEWS-LETTER.<br />\nMEETING OF INTER-COLLEGIATE<br />\nASSOCIATION.<br />\nSaturdayjanuary 26th,there was a meetONing<br />\nof the Inter-Collegiate A'ssociation of<br />\nMaryland in the gymnasium of the Johns Hopkins University. The delegates present were<br />\nMessrs. Cain, Fechtig and Wisner,of St. John's;<br />\nCobey, of Western Maryland;and Mackdermott<br />\nand Reese, of Hopkins.<br />\nA resolution was offered by Mr. Mackdermott,<br />\nthe gist of which is as follows:<br />\n\"In case of two or more colleges scoring an<br />\nequal number of points, then if one of these colleges shall have been champion for the previous<br />\nyear, that college shall continue to hold the<br />\nchampionship for the ensuing year.\"<br />\nThis resolution was passed and accepted asan<br />\namendment to article IX of the constitution.<br />\nThis amendment was the outcome of such a<br />\nstate of affairs as exist at the present time,<br />\nconcerning thefoot-ball championship of the past<br />\nseason. Both Hopkins and St. Johns having<br />\nwon an equal number of games, the championship was undecided, so the necessity for the rule<br />\ngiven above was felt.<br />\nIt was also decided \"that the contestants in<br />\neach event in the Track and Field Championship<br />\ngames should be limited to four contestants from<br />\neach college.\"<br />\nThe treasurer of the Association reported that<br />\nthe finances were in excellent condition, and that<br />\n\"they were away ahead of the game.\"<br />\nsr .ber<br /><br />\n411<br /><br />\nADVICE TO ATHLETES FROM<br />\nMACKDERMOTT.<br />\nthe above caption, a lengthy article<br />\nUNDER<br />\nwas published in the New York Sunday<br />\nWorld, of January 27th, giving Mr. Mackdermott's ideas on training diet. It is quite gratifying to the editors of the NEWS—LETTER that<br />\nthe fame of our Physical Director, and with him<br />\nthat of our University, has gone abroad, and<br />\nthat his opinions have been voiced in the great<br />\nmetropolitan newspapers. Part of the article<br />\nin question follows:<br />\n\"Prof. William M. Mackdcrmott, Director of<br />\nPhysical Training of Johns Hopkins University,<br />\nBaltimore, has prepared a training diet for ath-<br /><br />\n9<br /><br />\nletes in training based on an experience of<br />\ntwenty years in practical athletics and of twelve<br />\nyears as a trainer, six of which have been spent<br />\nat Johns Hopkins. Mackdermott has made a<br />\nstudy of the subject and incidentally has paid<br />\nconsiderable attention to diet for persons suffering from obesity and leading sedentary lives.<br />\nProf. Mackdermott was for a number of years<br />\na leading member of the world famous Manhattan Athletic Club and contested as one of the<br />\nold Cherry Diamond track team, winning a<br />\nnational reputation as a consistent all-around<br />\nathlete.<br />\n\"Under his tuition the Johns Hopkins boys have<br />\nrepeatedly won and now hold the track and<br />\nfield and football championships of the South.<br />\nFor three years they have held the inter-collegiate lacrosse championship.<br />\n'Many more persons eat themselves to death<br />\n\"<br />\nin the course of a year,' says Mackdermott,<br />\n'than drink themselves to death. If the temperance folks all over the country would include the<br />\nadvocacy of moderation in eating in their crusades, they would confer a great blessing on<br />\nhumanity.'<br />\n\"The following diet is prepared for athletes in<br />\ntraining, who must maintain strength to do<br />\ntheir work.<br />\nMeats—Roast beef, moderately rare; mutton<br />\nchops, lamb chops and beef steak (broiled moderately rare); chicken, turkey, duck, sweetbreads, rabbit, fresh fish (no salt fish) lamb,<br />\nmutton. Do not eat fat or gravies.<br />\nVegetables—Spinach, lettuce,celery,asparagus<br />\n(without oil or butter dressing), white potatoes,<br />\nboiled, mashed or baked; lentils, lima and dried<br />\nbeans, rhubarb, greens, kale, split and green<br />\npeas, tomatoes in season.<br />\nFruits—Oranges, moderately; baked and<br />\nstewed apples,currants, prunes,figs,raspberries,<br />\ndates, stewed fruit.<br />\nBread—Wheat, rye and graham bread, one<br />\n(lay old; toast, hot bread, rolls or any kind of<br />\nhot cakes must not be eaten during training<br />\nperiod.<br />\nMiscellaneous—Eggs, soft boiled, shirred,<br />\nomelet or poached; oatmeal, beef tea, mutton<br />\nbroth; milk, occasional, if pure; tapioco, sago,<br />\narrowroot, cocoa, grape-nuts, cauliflower.\"<br /><br />\n•<br /><br />\nPR ESS CIF $TONEBRANER BRO$<br /><br />\nBALTIMORE.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHAPPENINGS IN THE UNIVERSITY.<br /><br />\nR. Ira Remsen has been chosen to represent<br />\nJohns Hopkins at the meeting of the American Association of Universities, which will begin<br />\nin Chicago on February 26th. The association<br />\nis composed of the presidents and professors of<br />\nthe various universities and colleges of this<br />\ncountry, and meets annually to discuss subjects<br />\nrelating to the inner affairs, of university management.<br />\nwww<br />\nDr. Hamilton Wright Mabie, associate editor<br />\nof the Outlook, will deliver the Turnbull lectures<br />\non poetry this spring. Mr. Mabie is well known<br />\nas an author, and is also an exceptionally good<br />\nspeaker. His works cover a variety of literary<br />\nsubjects. The dates for these lectures are as yet<br />\nunknown, but will be somewhere about April<br />\n11th.<br />\nAs As<br /><br />\nThe contest for the Tocqueville medal is<br />\nopened once more. The medal is given to the<br />\nUniversi' v each year by Baron Coubertin of<br />\nParis, and is offered by the University to the<br />\nstudent presenting the best essay on some phase<br />\nof French History, political or social, of the<br />\nperiod between 1815 and 1890.<br />\nwww<br />\nHenry A. Converse, a graduate student in<br />\nmathematics and philosophy, has been teaching<br />\nduring the past month at the Baltimore Polytechnic Institute. Mr.Converse has been offered<br />\nseveral positions which will be open to him as<br />\nsoon as he receives his degree.<br />\nww<br />\nWalter B.Swindell,'01, who has been detained<br />\nat home for nearly a month with a serious<br />\nattack of the grip, is convalescing, and hopes to<br />\nbe back to the University in a short time.<br />\nJP .A6.0<br />\nThe Historical and Political Science Association celebrated John Marshall Day,in the rooms<br />\nof the Historical Seminary last Friday. Dr. W.<br />\nW. Willoughby read a paper on \"John Marshall<br />\nand Political Science;\" Mr. W. E. Martin,<br />\nFellow in History, read one on \"John Marshall<br />\nas a Historian.\" President Gilman made a few<br />\nremarks concerning the John Marshall prize<br /><br />\nannually awarded by the University, and Dr. J.<br />\nM. Vincent spoke on \"The Prize Winners.\"<br />\nJP JP<br />\nMr. Bailey Willis, of the United States Geological survey will begin a course of lectures on<br />\nStratigraphic and Structural Geology in the Geological Lecture Room on Thursday, February .7.<br />\nw 4r or<br />\nCharles Edward Lyon,'97, who left his graduate studies here last year to follow lectures in<br />\nGerman universities, has returned after a stay<br />\nof six months at the universities of Leipsic and<br />\nMunich. He will continue his work in the German department here.<br />\njb .44<br /><br />\n44<br /><br />\nY. M. C. A. NOTES.<br />\nLIFE WORK MEETING.<br />\nHE Association has under way a series of<br />\ntalks on the requirements, duties, and opportunities of the various callings, with the hope<br />\nof giving practical help not only to students who<br />\nhave not yet determined upon a profession, but<br />\nto others as well, by making more clear and<br />\npositive some of the ideas that are most important. The list includes Mr. Eugene Levering on<br />\n\"A Business Career ;\" Dean Griffin on \"Teaching as a Life Work ;\" Mr. Niles on \"Law as a<br />\nProfession ;\"and Dr. Kelly on \"The Doctor of<br />\nthe Future.\" Others will be announced later.<br />\nIt is the purpose of the committee to conduct<br />\neight meetings on this plan, after which the Sunday afternoon services will be discontinued for<br />\nthe year. Five o'clock on Sunday for forty-five<br />\nminutes, is the time.<br /><br />\nT<br /><br />\nCLASSES.<br />\nTwenty-five members of the Y. M. C. A. are<br />\nstudying the Bible in three classes meeting<br />\nweekly.<br />\nMr. A. IL Ewing has been conducting a class<br />\nof a dozen men in the study of modern conditions in missions. The class will be continued<br />\nfor several weeks, although Mr. Ewing will sail<br />\nfor India the last of this month, directly after<br />\ntaking his degree of Ph. D. He will resume his<br />\nmissionary work, his station being at Allahabad.<br /><br />\nTHE NEWS-LETTER.<br />\n[CONTINUED FROM PAGE G.]<br /><br />\nhad been, but any one who this year heard \"Salome\"<br />\ncould not fail to notice the expression and feeling<br />\nthat the men themselves had for the more modulated<br />\nstrains. In the other pieces there is -less expression<br />\nthan in this, on account of their being marches.<br />\nThe Banjo Club, in my opinion, deserves the most<br />\npraise, for they entered the year handicapped in numbers, and disheartened by their former record. But<br />\nnow we undoubtedly have a club that rivals that of<br />\nPrinceton, and this year, if proper training is kept tip<br />\nthe Johns Hopkins Clubs will show the Princeton<br />\nmen that all three clubs are better than theirs.<br />\nBut enough of praise: for I must come to the main<br />\nreason for writing this letter, and that is to offer a<br />\nfew suggestions. They are all of minor significance,<br />\nhut still effect, to a certain degree at least, the opinion that the audience has of the clubs. To begin<br />\nwith, there should be more system in the manner in<br />\nwhich the men come upon the stage. Usually they<br />\nstraggle in, slowly form a crooked line, and then,<br />\nsomeone finding himself in the wrong place, there is<br />\nmore commotion. This of course does not always<br />\ntake place in just the manner described, hut there is<br />\nan air of uncertainty in all the clubs, especially the<br />\nGlee Club, which impresses the audience most unfavorably. Then too, the leader almost invariably<br />\nhas difficulty in gaining the attention of his club in<br />\norder to start the piece. ):'et for hint to start before<br />\nall the mei are looking at hint, would bring about a<br />\nweak beginning and mar the whole selection. For<br />\nthe old adage \"work well begun is half done,\"is most<br />\nsurely applicable to Musical Clubs also. And now I<br />\nwould like to offer a suggestion, concerning the too<br />\nfrequent use of the pistol. One explosion, or perhaps<br />\ntwo, is startling and has a good effect, but more than<br />\nthis only tend to make the concert like a cheap vaudeville, where the attention of the audience has to be<br />\ngained by some such artificial means. The question<br />\nas to the number of encores that should be given is<br />\none of some importance, for too many are apt to tire<br />\nthe audience, and too few give the impression that<br />\nthe clubs have a small repertoire. In the Baltimore<br />\ncencert, too many were given, and the hearers were<br />\nall fatigued at the close of the programme. The number of encores is, of course, at the descretion of the<br />\nleaders, and they should not be carried away by the<br />\nenthusiasm of the men, but should wait for sufficient<br />\napplause.<br />\nAnd now with these last few suggestions I will<br />\nclose, with most earnest wishes for the continued<br />\nsuccess of the clubs.<br />\nYours very truly,<br />\nA HOPKINS MUSIC LOVER<br />\nWW W<br /><br />\nInvention.—A rubber stamp to be used on domestic letters has been invented by The Widow<br />\n(Cornell) staff, and saves time, ink, and won-y.<br /><br />\n11<br /><br />\nAnswers to examinations given in one of the<br />\nleading grammar schools of Boston:<br />\nWho were the Pilgrims?<br />\nA dirty, funny set, who lived under the earth.<br />\nName a domestic animal useful for clothing,<br />\nand describe its habits?<br />\nThe ox. He don't have any habits, because<br />\nhe lives in a stable.<br />\nIf you were traveling across the desert, where<br />\nwould you choose to rest?<br />\nI would rest on a stool.<br />\nMention five races of men?<br />\nMen, women, children and babies.<br />\nDescribe the white race, and show that it is<br />\nsuperior to other races?<br />\nA white man will nod at you, when he meets<br />\nYOU on the street.<br />\nOf what is the surface of the earth composed ?<br />\nDirt and people.<br />\nName a fruit that has its seed On the outside?<br />\nA seed cake.<br />\nName five forms of water?<br />\nHot water, cold water, faucet water, well<br />\nwater, and ice \\voter.<br />\nName and locate the five senses?<br />\nThe eyes are in the northern part of the face,<br />\nand the mouth in the southern.<br />\nWho were the mound builders ?<br />\nHistory cannot answer this question. Science<br />\nonly can.<br />\nDefine \"flinch\" and use it in a sentence?<br />\n\"Flinch,\" to shrink. Flannel flinches, when it<br />\nis washed.<br />\nBy what is the earth surrounded, and 1).y<br />\nwhat is it lighted?<br />\nIt is surrounded by water and lighted by gas<br />\nand electricity.<br />\nName six animals of the arctic Zone?<br />\nThree polar bears and three seals.<br />\nWhat is yeast?<br />\nYeast is a vegetable flying about in the air,<br />\nhitching itself on to anything.<br />\nWhy do you open the dampers in a stove,<br />\nwhile lighting a fire?<br />\nTo let the oxygen in and the nitrogen out.<br />\nWhat did the constitution do for the country?<br />\nIt gave the president a head.<br />\nWhat are the last teeth that come to a man?<br />\nFalse teeth. .<br /><br />\nLTIMOR<br /><br />\nP. PAINE<br />\nGORDON P. PAINE<br /><br />\nCLINTON<br /><br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE SlOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br /><br />\nCLINTON P. PAINE<br />\nBANKERS<br /><br />\nAND<br /><br />\n&amp;<br /><br />\nj ON<br /><br />\n229 N. C147111LES ST.<br /><br />\nCo.<br /><br />\nBROKERS,<br /><br />\nMASONIC TEM,LE.<br /><br />\nVOR Class, Fraternity and College Stationery, Banquet Cards,-<br /><br />\n217 FAST GERMAN STREET,<br />\nRALT1MORE, MD.<br /><br />\nPRIVA I h. WIRES TO<br />\nNEW YORK AND CHICAGO.<br /><br />\nSMOKE UP!<br /><br />\nRAH! RAH! RAH! HOPKINS!!<br />\nIF ITS<br /><br />\nANYTHING IN TOBACCO YOU WANT<br /><br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nThe Chas, \\Nibs Surgical Inst[ument Co,<br /><br />\nGo To I. D. LANG, TOBACCONIST,<br /><br />\nBENJ. A. NELSON, GEN't. MANAGER.<br /><br />\n833 MADISON AVENUE.<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br /><br />\nBOX TIRADE<br /><br />\nA SPECIALTY<br /><br />\nDrovers &amp; Meehanics National Bank of Baltimore.<br />\nCapitaIeStock $300,000.<br /><br />\nJAS. H. DOWNS,<br /><br />\n300 N. HOWARD ST.<br /><br />\nBALTIMORE, MD.<br /><br />\nMUELLER,<br /><br />\n(LONDON STUDIO.)<br /><br />\nFINEST PHOTOGRAPIC WORK<br /><br />\nTRANSACTS A GENERAL BANKING BUSINESS<br />\nSafe<br /><br />\n.2)a,u0.rie alo.pre,<br /><br />\n00 €<br /><br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br /><br />\nAND<br /><br />\nIN THE CITY.<br /><br />\n9.1„usverrve.<br />\n.Special attention given to Holiday<br />\nwork and tiroups, Class Pictures, etc.<br /><br />\nJ. D. Wheeler, Cashier.<br />\nChas. S. Miller, Ass't Cashier.<br /><br />\nA. H. FETTING,<br />\n14<br /><br />\nMANUFACTURER OF<br /><br />\nWeek Letter -fraternity<br />\n3ewetry.<br /><br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes as follows regarding the<br /><br />\nMASON &amp; HAMLIN PIANOFORTE.<br />\nsinging tone, and the :ietion is most satisfactory.<br />\n\"It has<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nrank.\"<br />\nI Signed I<br />\nMORITZ MOSZKOWSKI.<br /><br />\n16 ST. PAUL STREET.<br /><br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\nC. H. Hildebrandt &amp; Son, Sole Agts.<br /><br />\ni<br /><br />\nLONDON. PARIS, (IIBRALTAR.<br />\nNAPLES. GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nA. SCHUMACHER &amp; CO<br />\nGeneral Agents.<br /><br />\nFor particulars apply to<br />\nSURETY BONDS<br /><br />\n321 N. Howard Street.<br /><br />\nNEW YORK TO BREMEN,<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nw w w CABIN PASSAGE AT LOW RATES.<br />\nIi<br /><br />\n5 WEST LEXINGTON ST.<br /><br />\nSurplus und Profits, $350,000.<br /><br />\nDIRECT.<br /><br />\nAre<br /><br />\nKratik-Smilb<br />\npiano CO.<br /><br />\nCht<br /><br />\nTidelity and Deposit Company of Maryland,<br />\n•<br /><br />\n109 and III North Charles nrect.<br />\nSOLE AGENTS<br /><br />\nDickering, Bradbury and Webster<br />\nIt* Pianos. e*<br />\nC.&amp; F. Phone 2322-2.<br /><br />\nFactory Prices<br /><br />\nBARTL,eirr, HAYWARD er CO.<br />\n11 'Founders and Engineers, • e<br />\nOffloe Calvert and German Sts.<br />\nWorks, Pratt and Scott Sts.<br />\nManufacturers °feast and Wrought Iron Work for Buildings,<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nIforizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought<br />\n'Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON $TS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES.<br /><br />\nEDWIN WARFIELD, Pres't.<br />\ntat Vice-Pres't, H. Crawford Black.<br />\n2nd<br />\n\"<br />\nFos. R. Stonebraker.<br />\n3rd<br />\n\"<br />\nThos. A. Whelan.<br /><br />\n11. H. 130SLER, Sec'y-Treas.<br />\nHarry Nieodemus,<br />\nAss't See'y-Treas<br /><br />\nBOOKS<br /><br />\nOld and<br /><br />\nNew.,<br /><br />\nThe oldest Old Book Store, rind the largest<br />\nstock of Old and New Books in the Cit:p.<br />\nBooks bou,L,tht, sold and exchanged. . . .<br />\nWM. V. PIPPEN.<br /><br />\n605 N. Eutaw St.<br /><br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\n4 iiingdus5 4 Automatic Attachments for<br />\nPianos.<br />\nREGINA MUSIC BOXES.<br />\nGRAMOPHONES, ETc,<br />\n201-203 N. CHARLES STREET.<br /><br />\n\"Washburn\"<br /><br />\n1_,UNCti IROONIS I<br /><br />\nHARRY T. 1V1UMYS<br /><br />\nTHI-7. DRUID<br />\nLIICIHT LUNCH ROOM<br /><br />\n122 NORTH HOWARD STREET,<br />\nOYSTERS IN ALL STYLES.<br /><br />\nYOUR PATRONAGE SOLICITED,<br /><br />\nDIXON ut co.<br /><br />\nSPITITH,<br /><br />\nIlSCS:11<br /><br />\n0: PAPER oe<br /><br />\n311N-T.RARLES 57<br /><br />\nV11.,Rikviojey<br /><br />\n29-31 IS_ 01-I_ARLEIE3 ST_<br /><br />\nLAGER BEERS<br /><br />\nGlobe<br />\nBrewery<br /><br />\n60Idbrau And Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market<br />\nWm. It. Oliver.<br /><br />\nJ. Win. Middendorf.<br /><br />\nMIDDENDORF OLIVER &amp; Co.<br /><br />\nBankers and Brokers,<br /><br />\nBartholomay Brewery Co.<br />\nROCHESTER,N. Y.<br /><br />\nBARTH0LOMAY'S is THE bohemian<br />\n• ORIGINALAND FAMOUS e<br /><br />\nROCHESTER BEER: Bavarian<br />\n• BRANCH<br /><br />\n227-239 SIENTRAI AVE<br />\nGEO.C.S CRO•<br />\n• MANAGER • •• •<br /><br />\n005 EAST GFCIRIVIAN STREET,<br />\nMembers<br /><br />\nOffice and Depot, 227-239 S. Central Avenue.<br /><br />\nBALTIMORE, MD.<br /><br />\nBaltimore Stock Exchange.<br /><br />\nGEO. C. SUCRO, Sole Agent.<br />\nHome Tdephone 2060<br />\nT..1,,ption, logo<br /><br />\n(..<br /><br />\nESTABLISHED 1879.<br /><br />\nWedding Silver<br /><br />\nNEW YORK TO LONDON DIRECT.<br /><br />\nTrfitdseisor<br /><br />\nExcellent accommodations for it limited<br />\nnumber of First-Class Passengers<br />\n:Lt reasonable rates.<br /><br />\nIN GREAT VARIETY.<br /><br />\nit Silversmiths.<br />\nHENDERSON'S 1 the<br />\nJACOUtl 61- .11<br /><br />\nK I INS,<br /><br />\n216 N. CHARLES ST.<br /><br />\nNEW YORK.<br /><br />\nWilson Keyser, Cashier.<br /><br />\nLawrence B. Kemp, President.<br /><br />\nAND<br /><br />\nSTREETS,<br /><br />\nGERMAN<br /><br />\nBALTIMORE, MD.<br /><br />\nHABERDASHERS.<br />\nShirts,<br /><br />\n1 BROADWAY<br /><br />\nBALTIMORE.<br /><br />\nHOWARD<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nTHE BLAKE CO<br /><br />\nATLANTIC: TIRANSVORT CO.<br /><br />\n403-4()1) WATER ST.<br /><br />\nC01111111ERCIFIL &amp; FFIRRIERS NOTIONK BANK,<br /><br />\nUNIVERSITY<br />\nBOOK STORE,<br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENT'S SUPPLIES.<br /><br />\n(Daerfzen 13rau<br />\nripollo<br /><br />\nTRADE MARk•<br /><br />\nB A LT I MORE<br /><br />\nOilers to<br /><br />\nDepositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nJAMES R. PAINE.<br /><br />\nTI1E0. WARNER,<br /><br />\nWARNER 8c CO.<br /><br />\nNeckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nUMBRELLAS, i) HATTERS, Q<br />\nHIGH GRADE GOODS I.f/W 'MMES.<br /><br />\nCANES, Erc<br /><br />\nAgents for Lincoln &amp; Bennett and Walter Barnard's London Hats.<br /><br />\n324 W. liALl'INION.F.:<br />\n203 W. BALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\nMANUFACTURERS OF<br /><br />\nSilk and Cassimere liats.<br /><br />\nphotographs<br /><br />\n---Clit.HOPKI NS CAPS.<br /><br />\nIlgenfritz<br /><br />\nGushing&amp; Companu<br /><br />\nStudio.<br /><br />\n0 BOOKSELLERS...,<br />\nSTATIONERS.<br /><br />\n34 W. BALTIMORE STREET.<br />\nSUCCESSOR TO CUMMINS<br />\nSCHOOL, LAW, MEDICAL. CLASSICAL AND MISCELLANEOUS BOOS,<br /><br />\n20<br /><br />\nVVHST<br /><br />\nILJEXIIWIT()N<br /><br />\nSTIREHT.<br /><br />\nSPECIAL DISCOUNT TO STUDENTS.<br /><br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns hopkins Hospital and The Woman's College of link',<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nI-tiBLEE,N M. HoL.L.YDAv,<br />\n000 N. EUTAW ST.,<br /><br />\nTIEF<br /><br />\nRALTIMORE, MD.\"<br /><br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br /><br />\niinheuser-Busen<br /><br />\nAccommodating terms.<br />\nWrite for Illustrated CainPogue.<br />\nCHAS. M. STIRIFP.<br />\n(i N. Liberty St., Baltimore, Md. 521 nth St., N. W., Washington, D. C.<br /><br />\nB.<br /><br />\n13.<br /><br />\nBOOKS<br /><br />\nAND STATIONERY,<br /><br />\nNo. 308 North Cliarlotit Street,<br />\nY. M. C. A. BUILDING,<br />\nC. &amp;<br /><br />\nP. Telephone 2351.<br /><br />\nSTONEBRAKER BROS.,<br />\n2 I 7 E. Baltimore St„.<br /><br />\n2314.<br /><br />\nPRESS OF OTONEBRAKER<br /><br />\nEICHELBERGER,<br /><br />\nENGRAVING AND STAMPING.<br /><br />\nBALTIMORE RCA NCR:<br /><br />\nLOUIS ILLMER,<br />\nGetel Agent and Mgr.<br />\nC. &amp; P. Telephone<br /><br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br /><br />\npiAlklos<br /><br />\nBrewing Ass'n<br />\nSt. Louis, Mo.<br />\nBrew the Best Becr,<br />\nin the World.<br /><br />\nYou get the benefit of<br />\nall this lalmr,skill,brains<br />\nand capital.<br /><br />\nBROS., BALTIMORE.<br /><br />\nBALTIIVIORE, MD<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NO1ICE.<br /><br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nHOLIDAY SEASON,<br /><br />\nFORD'S!<br />\nFEB. 11,<br />\nONE<br />\nWEEK<br /><br />\n\"QUO VADIS\"<br /><br />\nFEB 18<br />\nONE<br />\nWEEK.<br /><br />\nLEMMERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br /><br />\nTHEATRE OF BALTIMORE<br /><br />\nJAMB'S A. HE:14INIE,<br />\nIN \"SAG HARBOR.\"<br /><br />\nACADEMY OF MUSIC!<br /><br />\n;<br />\nr 411rMN4M AN<br /><br />\nWEEK OF<br />\nFEB. 4<br /><br />\n66 E. 8. NVIIILLARD.\"<br /><br />\nWEEK OF<br />\nFEB 11.<br /><br />\n47 .11 6fi'rhe Fitunawa.y Girl.\"<br />\nCoining,\"To H HNC ii nti<br /><br />\nLEMMERT<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br /><br />\nto Hold.\"<br /><br />\nSPACE TO LET.<br /><br />\nLEMMERT.<br /><br />\n14 E. FAYETTE STREET.<br /><br />\nze• aeixteimitaitimutateasimeeitimitimiteiteeq<br />\nis the<br /><br />\nPECIAL DISCOUNT! jt<br /><br />\nS<br /><br />\nnoblest<br /><br />\nTo the Students and Nurses of Johns Hopkins We 0 IIMake n<br />\ndiscount of one-third on all styles of Photographs In single<br />\ndozen WS. Better discount for classes.<br /><br />\nBALTIMORE, MD.<br /><br />\ntiotizikpFEL e 8Eizet<br />\nmandolins<br /><br />\npart<br /><br />\nof<br /><br />\nyour<br /><br />\nHERD, Shi,!=;.,Jli::;1),,.,e,_titr,yain2::<br />\nlug OUR HATS.<br /><br />\n0<br /><br />\n0<br /><br />\nJEFFIRES STUDIO, w<br />\n08 N CHARLES STREET.<br /><br />\nOUR<br /><br />\nMINOR'S,<br /><br />\nUP-TO-DATE,<br /><br />\n0 218 NORTH EUTAW STREET,<br />\n0<br /><br />\nONE PRICE.<br /><br />\n07<br /><br />\n. ZZieZezzezzzaz.ezzaziteitialteazazez;p:,<br />\n,<br />\n:<br />\n-...<br />\n'<br />\ni<br />\n.,.<br />\n,<br />\n:<br />\n.,<br />\n.<br /><br />\nH.<br /><br />\n13.<br /><br />\nMANDOLINS, GUITARS anD BANJOS<br />\n\"hlive a tone<br />\nThat's all their own \"<br /><br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br /><br />\nGUITARS AND BANJOS.<br /><br />\nNEAR SARATOGA ST.<br />\nINSTRUMENTS TAKEN IN EXCHANGE<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\nOPEN EVENINGS.<br /><br />\nJ. SMITH,<br />\nNASTATMAW=<br />\nOuzel<br /><br />\nMOMS=<br /><br />\nWATOZZZAMTWASIANTO<br /><br />\nBOOKS<br /><br />\nOld<br /><br />\n111114.1<br /><br />\nNwss-<br /><br />\nSZTAW USTASWAM=NAMTRAWATAMMAZTOMMaMIAW<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br /><br />\nCall at 805 North Hogvaror Street,<br />\n3 DOORS ABOVF MADISON.<br /><br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br /><br />\nC. SS. h SICK<br />\nCOLLARS.<br /><br />\nCUFFS<br /><br />\nrr<br /><br />\nG LOVES.<br /><br />\ner5<br /><br />\nEr.) rave rs<br />\n)L111<br />\nZ17 E.OLT0,6T.<br />\nBALTIMORE/M-6, .<br /><br />\nBALTIMORE, MD.<br /><br />\n125 EAST, NEAR CALVERT STREET.<br /><br />\nSCCCOO 0 11)) R*DS E0_0 R<br />\nBRACES.<br /><br />\nUMBRELLAS.<br /><br />\nCANES<br /><br />\nTIES.<br /><br />\nETC.<br /><br />\nNovember 7th, 195o.<br />\nWhile visiting the Paris Exposition of Iwo, the wonderful display of<br />\nwines from all parts of the world was made a special study by our represell t: ye, W liii secured sonic very fine euvees of French wines, both<br />\nred and white, such as Chateau 'Ponta Canet, Chateau Larose, Chateau Lafitte, Chattau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Con Let. The latter liner than Chateau Yquem and not so<br />\nsweet Also sonic special vintag.s of' Deinhard &amp; Co.'s celebrated Rhine<br />\nWines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of aH Offley Forrester &amp; Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in Lin gallon<br />\npipes direct Iroin the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 MadlISOI1 A VC., Sid OM<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\nSTONEBRAKER BROTHERS,<br />\n217 E. BALTIMORE ST.,<br /><br />\n.06 .pg .0<br /><br />\nADVERTISE IN THE \"NEWS LETTER.\"<br /><br />\nBALTIMORE, MD.<br /><br />\n.4 .4<br /><br />"}], "field_media_file": [{"target_id": 36175, "display": null, "description": null, "target_type": "file", "target_uuid": "48b60e93-9e24-4e3d-b69f-f10821b03c84", "url": "http://digital.library.jhu.edu/system/files/2022-03/12164-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12164, "target_type": "node", "target_uuid": "0338dcd5-4d66-49c6-9e2f-b7c2a18a551d", "url": "/node/12164"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a80ce24f-1598-45ca-b989-8d8cc577d807"}]}