{"mid": [{"value": 39360}], "uuid": [{"value": "3f0f0b85-dabc-43ac-b6ca-dbb8507315e4"}], "vid": [{"value": 39360}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:28:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13940-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:28:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:28:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Weekend Weather Watch:<br />\n<br />\nCold temperatures,<br />\nchance of flurries.<br />\nTonight will be dark.<br />\n<br />\n'News ?Eater<br />\n<br />\nVOL. LXXII, No. 8<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, NOVEMBER 17. 1967<br />\n<br />\nUniversity Waiting For S.C.<br />\nBefore Deciding Vic's Case<br />\nRoss Jones, Secretary of the University, says that the<br />\nHopkins is waiting to speak with the Student Council<br />\nbefore issuing a policy statement on the alledged discrimination at the Marylander Barber Shop.<br />\nJones said that he had \"tried to contact Bruce Ledig,\"<br />\nStudent Council President. \"If Ledig would ever respond<br />\nto me I would ask him and Victor Dates to go to the •<br />\nshop and see what the situation is.\"<br />\nLast year the Student Council took part in the barber shop discrimination case. Therefore, Jones wants to<br />\nbe sure that the Council is satisfied before he makes a<br />\nformal public statement.<br />\n\"Really,\" he said, \"there is no problem. According to<br />\nwhat I've been able to determine, he is not chargine prices<br />\nwhich tend to keep Negroes out of the shop.\" However,<br />\nhe wants Ledig to go and talk with Victor the barber. If<br />\nthe Council is satisfied that there has been no discrimination, the University will issue a public statement.<br />\nThe controversy was sparked by a sign in the shop<br />\nwhich advised that \"kinky\" hair could not be cut for less<br />\nthan three dollars. Regular haircuts cost two dollars. The<br />\nsign was recently removed, when Victor DeRuggiero,<br />\nproprietor of the shop, heard that the University objected. Razor cuts for Negroes now cost three dollars while<br />\na regular hair cut costs two dollars for anyone.<br />\nVictor says that the price hike for Negroes is due to<br />\nthe fact that their hair is harder to cut than is Caucasians' hair. He insists that he is not descriminatory.<br />\n\"Victor welcomes everyone!\" says Victor. He added that<br />\nhe had never had a Negro ask for a razor cut in his shop,<br />\nand therefore, had never charged three dollars.<br />\nArnold Rausenberger, a barber in the Levering Hall<br />\nshop, said that cutting Negroes' hair presented no special<br />\nproblems. He added that he couldn't understand why<br />\nVictor would charge extra for a razor cut of curly hair.<br />\nLedig said that the Student Council probably would<br />\ndo something about the barber shop incident. As yet,<br />\nhowever, he was not familiar with the facts. \"What has<br />\ngone on around there?\" he asked.<br />\n<br />\nFreshmen Descend To New Depths<br />\nAs Liquor Flows In Carrel Party<br />\nBy DICK CRAMER<br />\nThe administration has decided to take an unequivocal stand in regard to a party thrown in the study carrels<br />\nbeneath the freshmen dormitories.<br />\nSome freshman decided that the newly opened study<br />\nroom would be the perfect site for a small party. As the<br />\nroom can be entered only with the use of a room key<br />\nand since not many dormitory residents study on Saturday, they had no fear of being disturbed. Therefore, they<br />\nstocked the room and gave it a small house-warming.<br />\nThe room has been adequately soundproofed and the<br />\nparty was never discovered. The girls in attendance, of<br />\ncourse, left before one o'clock and the gathering was<br />\nended without incident. However, no one was overcautious about leaving traces behind.<br />\nThe next day, beer bottles and cans were found<br />\nstrewn about the rdom. One of the frosted glass partitions which separate the carrels was smashed. The administration swung into action with a concentrated investigatory program.<br />\nMrs. Van Norman, upon hearing the news, embarked<br />\non a tour of the disaster area. Later in the day, Robert<br />\nP. Bilgrave, Director of Student Affairs, was seen inspecting the premises.<br />\nMrs. Van Norman commented, \"It's a very unusual<br />\nplace for this to happen. Most people are looking for a<br />\nquiet place to study.\" As yet, she has taken no definitive<br />\n• action. According to her, it is not within her province to<br />\ndo so. \"It's the responsibility of the D.S.R.C. and the<br />\nPlant Manager's Office,\" she said. \"I really have very<br />\nlittle to do with it.\"<br />\nMr. Wesley Taylor, Plant Manager, said that, as yet, he<br />\nhas \"not talked to anyone about it.\" He added that the<br />\nmatter was the responsibility of Mrs. Van Norman and<br />\nand the D.S.R.C.<br />\nHenry Yang, President of the D.S.R.C. said, \"I<br />\nreally don't know too much about it.\" When asked under<br />\nwhose jurisdiction the incident fell, he replied, \"It's<br />\nreally only the responsibility of the D.S.R.C.\"<br />\nColonel Robert Serena, Head Resident Dorm Master,<br />\nminced no words on the incident. \"See Mr. Bilgrave,\" he<br />\nsaid. \"He's handling it\". Mr. Bilgrave could not be reached for comment.<br />\n<br />\nVietnam War Threatens Cutbacks<br />\nIn Government Grants To Hopkins<br />\nBy BOB SLOAN<br />\nEDITOR'S NOTE: This is the second of a series concerning the financial shortages at Hopkins.<br />\nCutbacks in Federal spending for higher education due<br />\nto the Vietnam War threaten to aggravate Hopkins' financial problem.<br />\nGovernment funds to Hopkins, which made up 52%<br />\nof the current revenues for 1966-67, may be substantially reduced in the near future if the freeze on federal<br />\naid continues. A primary cause of the freeze is the enormous cost of the war in Vietnam. Smaller, lower-rated<br />\nschools have already felt the effects of the cutbacks, but<br />\nHopkins as yet has only felt the pinch slightly.<br />\nHowever, if the war drags on the shortage of funds<br />\ngoing to Hopkins will be acute. If replacement funds cannot be found the University \"will have no other choice\"<br />\nthan to make cutbacks says Bruce J. Partridge, VicePresident for the Administration. He added that because<br />\ngovernment money makes up so large a portion of the<br />\nbudget, this contraction will be the only solution.<br />\nThough Government money goes for government<br />\nprojects, the funds result in a portion of professorial<br />\nsalaries, the addition of graduate students, and the purchase of equipment for research. These side benefits of<br />\nthe federal funds for individual research add substantially<br />\nto the resources of the University.<br />\nWhen a professor applies for a grant to do individual<br />\nresearch, the request must first be approved by the<br />\nUniversity with respect to its cost and the number of<br />\nhours involved. If the University approves the project,<br />\nthe request goes to the government board kir approval.<br />\nIf, for example, the professor will spend half his time<br />\nfor research, the government will pay half of his normal<br />\nsalary. Graduate students are hired and the cost they incur is shared by the University and government; the same<br />\nholds for purchased equipment.<br />\n<br />\nOn the Inside:<br />\nWe pay a special tribute<br />\nto our capitalist sponsors.<br />\nSee all pages.<br />\n<br />\n72ND YEAR<br />\n<br />\nHousemaster's Report Scores<br />\nFood Service Administration<br />\n<br />\n(Continued on Page 2)<br />\n<br />\nDoyle Smith; a dormitory housemaster, submitted a<br />\nreport two weeks ago, highly critical of the administration of the food service.<br />\nThe report, submitted to Howard LaShaw, director of<br />\nthe dormitory Food Service, concluded that the Food<br />\nService \"should be run on a cash basis.\" Smith stated<br />\nthat \"the only way to cut out the flab\" is to run the<br />\nFood Service on a competitive basis.<br />\nSmith surveyed dormitory residents in order to compile his report. The report was initiated by request of the<br />\nPlant Manager's Office.<br />\nThe report criticized the time scheduling of the cafeteria, as well as the machinery involved in the operation<br />\nof the food service.<br />\nA particular target of Smith's report was a \"young<br />\nundergraduate\" employed by the cafeteria. Besides being<br />\n\"unclean, flippant and generally incompetent\" as Smith<br />\nimplied that most of the student help were, he distastefully noticed the undergraduate's habit of \"picking his<br />\nnose and running his fingers through his hair and then<br />\nserving you.\"<br />\nIn the survey which Smith conducted, 27 floors in the<br />\nFreshman houses were polled. Some \"novelties\" which<br />\nSmith discovered in reviewing the complaints included a<br />\nfreshman finding a fly \"cooked into his roll.\"<br />\nFour floors of freshman complained about finding<br />\nhair in their food. Ten floors noted the quantity of dirty<br />\ndishes. While there was unanimous sentiment that food<br />\nin the cafeteria was poor, twelve floors of freshman indicated that they just couldn't get enough of it.<br />\nSmith concluded that \"the administration must come<br />\nto grips with the food problem, and it is their responsibility to do whatever is needed to repair defects in the<br />\nFood Service. The handicap of budgets is the Plant Manager's office doing, not the students.\"<br />\nSmith stated that \"it should be made clear that we expect action, prompt and decisive actions.\"<br />\n<br />\nHopkins Leads In The Developing<br />\nOf New Drug To Treat Blood Clots<br />\n<br />\nHieronimous Exhibit Provokes<br />\nCharges Of Religious Blasphemy<br />\n<br />\nDr. Henry Wagner and Dr. Donald Tow, researchers at<br />\nthe Johns Hopkins School of Medicine, will be among<br />\nthe leading participants in the test of urokinase, a new<br />\ndrug for the effective treatment of arterial thrombosis.<br />\nUrokinase,so named because it is derived from human<br />\nurine, is not designed for the prevention of arterial<br />\nthrombosis, but instead it will be used to dissolve clots<br />\nin the arteries.<br />\nBoth Dr. Wagner and Dr. Tow hope that this drug will<br />\nbe effective in the correction of such medical disorders<br />\nas pulmonary embolism and mycardal infarctions.<br />\nUrokinase will enable doctors to dissolve blood clots<br />\nin a matter of hours, a process which presently takes up<br />\nto three weeks With present treatment patients often<br />\ndie or are seriously disabled.<br />\nNeither Hopkins' doctors have spent all their time on<br />\nurine. Working concurrently they have developed an<br />\n\"isotope scanning system,\" which allows them to see<br />\nwhat affect the drug is having. This technique promises<br />\nmany other possibilities, yet to be examined.<br />\nUrokinase likewise enables the development of new<br />\ntechniques in blood transfusion. \"In fact,\" states Dr.<br />\nTibor Greenwalt, medical director of the American<br />\nNational Red Cross,\"it is now old-fashioned to use whole<br />\nblood for transfusions.\"<br />\nHe added that it is now possible to take only the<br />\nplasma from the blood and return the remaining components of the blood to the body. This technique will aid<br />\nin alleviating the problem caused by a shortage' of available blood in today's hospitals.<br />\nIn practice, this means that as much as one liter ot<br />\nplasma a week could be removed from a healthy donor<br />\nwithout any ill effects.<br />\nThis ability to transfuse large quantities of blood<br />\nmeans that parents of a child suffering from leukemia<br />\nmight \"donate just the platelets in their blood up to two<br />\nor three times a week.\"<br />\nPlatelet transfusions are used to control bleeding in<br />\nleukemia.<br />\nUrokinase and other new techniques for the treatment of blood disorders, were outlined by the panel of<br />\nexperts during the briefing of\"New Horizons in Science<br />\nsponsored by the Washington University in St. Louis<br />\nand The Council for the Advancement of Science Writing.<br />\n<br />\nby DENNIS ESTIS<br />\nSeveral persons, including faculty wives, have charged<br />\nthat the art exhibit of Robert Hieronimus, 'currently<br />\nbeing shown at Levering Hall, is \"irreverent\".<br />\nThose people, both in the Hopkins community and in<br />\nthe City, have been shocked by the artists' portrayal of<br />\nof the Christ figure and several other symbols which he<br />\nemploys.<br />\nDr. Chester Wickwire, Director of Levering Hall, expressed the opinion that these charges were minor in<br />\nnature. Dr. Wickwire felt that the comments made were<br />\ntypical reactions one \"might expect from persons not<br />\naccustomed to this kind of art\".<br />\n\"Hieronimus is hot attempting to be irreverent,\" said<br />\nWickwire, \"but he feels that America, and not himself,<br />\nhas desecrated these symbols.\"<br />\nIn reply to the charges. Hieronimus said that he also<br />\nhad some complaints. He placed the primary blame on<br />\nthe present leaders of our nation in every field of endeavor, including religion. \"Our religious leaders have not<br />\nlistened to the needs of the generation. The symbols are<br />\nnot a slap at all. Man needs God, but not in a traditional<br />\nsense.\"<br />\nDr. Wickwire feels that the exhibit is \"very worthwhile\", and believes that it has \"livened things up.\"<br />\nThe exhibit features a sculpture of a dummy which is<br />\ncrucified on a wooden cross. The dummy is decorated<br />\nwith symbols of American materialism such as Coke buttons,and dollar signs. The exhibit also includes paintings,<br />\npen drawings, and a sculpture which revolves on a turntable.<br />\nHieronimus is also involved in other activities. He goes<br />\nto the Maryland Institute and used to teach in public<br />\nschools in Baltimore County. He painted the front of<br />\nthe new Black Jack night club on Lafayette Avenue,and<br />\nhe spends his spare time painting bodies on Howard<br />\nStreet. He is most noted on campus for his multicolored<br />\n\"symbolic Volkswagen\" and his poster advertising the<br />\n\"Mothers of Invention\" concert.<br />\nMany of the works on display at the exhibit can be<br />\npurchased from the author at a nominal fee. There are<br />\ncertain paintings which cost as much as $1000.<br />\nImmediately at the close of the Hieronimus show,an<br />\nexhibit of ceramic pieces will be displayed, along with<br />\nworks by Mrs. Raya Bueding.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17, 1%7<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE TWO<br />\n<br />\nWhat kind do you smoke?<br />\nWiliam,<br />\na<br />\n<br />\n7rivarden<br />\n1111101.Clturc<br />\n<br />\nMONZA<br />\n<br />\nWhatever kind you smoke,<br />\nyou owe it to yourself to<br />\ntry MONZA Pipe Tobacco.<br />\nYour favorite pipe will give<br />\nyou more pleasure when<br />\nou choose this imported<br />\nblend of the world's fine<br />\ntobaccos.<br />\n<br />\nmove up to<br />\n<br />\nPIPE TOSACCO<br />\n<br />\nt Cutbacks<br />\nVietnam War Threatens Gran<br />\npay the full professor's salary.<br />\n<br />\nThe promise of government aid<br />\nmany very capable, and well<br />\nlures<br />\nHowever, funds may be cut<br />\nto campuses which<br />\nprofessors<br />\npaid<br />\ngraduate<br />\nthe<br />\nhappens,<br />\nback. If this<br />\naid. Such is the<br />\nfederal<br />\nthe<br />\nget<br />\ncan<br />\nstudents are fired because there is<br />\nwhen funds<br />\nThus,<br />\nat<br />\nHopkins.<br />\ncase<br />\nequipdo,<br />\nto<br />\nthem<br />\nno work for<br />\nUniverthe<br />\nthere,<br />\nno<br />\nlonger<br />\nare<br />\nment is not purchased because<br />\nthe<br />\nup<br />\nwith<br />\ncome<br />\nto<br />\nhave<br />\nwill<br />\nsity<br />\nit<br />\nfor<br />\nneed<br />\nresearch<br />\nthere is no<br />\navailnot<br />\nare<br />\nIf<br />\nfunds<br />\nprofessor.<br />\nand the University faces the proprofessors, not unblem of paying the full salary of a able, assistant<br />\nhave to be dropped<br />\nwill<br />\nder<br />\ntenure,<br />\nprofessor for which it formerly<br />\nre-allocated to<br />\nsalaries<br />\ntheir<br />\nand<br />\nhalf.<br />\npaid<br />\nonly<br />\n(Continued from Page 1)<br />\n<br />\nThe Catholic Community<br />\nOn Campus<br />\n<br />\nar<br />\n<br />\nMONZA<br />\n<br />\nTHE IMPORTED MK TOSACCO<br />\nONLY 300 A POUCH<br />\nFor a COMPLIMENTARY pouch of MONZA PIPE TOBACCO,<br />\nsend 10t to cover postage and handling with this<br />\ncoupon to:<br />\nROMICK'S INTERNATIONAL, INC.<br />\nP.O. BOX 3033, DEPT. NO. 17<br />\nNO. HOLLYWOOD, CALIF. 91606<br />\n<br />\nMASS SCHEDULE:<br />\nSUNDAYS: 10:30 A.M. in Levering<br />\nGreat Hall (\"Folk Mass\")<br />\n<br />\nFRIDAYS: 12:00 Noon in Levering Hall<br />\nChapel<br />\n<br />\n(Please Print)<br />\nName<br />\nCity<br />\n<br />\nStreet<br />\n<br />\nDue to the Thanksgiving Holidays there<br />\nwill be no Mass in Levering on Friday, Nov.<br />\n24th or on Sunday Nov. 26th.<br />\n<br />\nZip<br />\n<br />\nState<br />\nA<br />\n<br />\nENS MINI 111111 111111M MEI ANS EM 11•1111 11111E<br />\n<br />\nThus, when the Vietnam war<br />\nsaps government educational aid,<br />\nthe subsequent contraction of the<br />\nUniversity will mean the firing of<br />\nprofessors in a school which is already, according to department<br />\nheads, understaffed, as well as cutting back in other areas of University operations.<br />\nContraction of a University al.<br />\nready considered too small is regrettable. \"We may have hard<br />\ntimes,\" states Partridge, \"but we<br />\nwill just have to do some belt<br />\ntightening,\" Partridge says that the<br />\nfinancial problem is nothing new<br />\nfor Hopkins. There has always<br />\nbeen the problem of determining,<br />\nexpenditures on the basis of available funds, and the University is<br />\nconstantly searching for new sources of money. At the present, says<br />\nPartridge, all sources are being<br />\nexploited.<br />\n\"The faculty must be educated<br />\nto the workings of financial operations at Hopkins,\" Partridge believes.<br />\n\"In a University, finance is never a question of spend or not<br />\nspend, do or don't; it is a question, rather, of the assignment of<br />\npriorities,\" he continued. Hopkins<br />\nhas a stable source of income,<br />\nsources of income which may lose<br />\na substantial portion of their<br />\ngest donor.<br />\n<br />\nNM NMI<br />\n<br />\n111111111<br />\n<br />\nCalling all<br />\n<br />\n24-page brochure has facts<br />\nand figures to help you see<br />\nBritain on a student budget<br />\n<br />\nsOdents<br />\nvisiting<br />\nbritain<br />\n<br />\nHow to travel 1000 miles by<br />\ntrain and boat for only $30.<br />\n100 places to get a single room<br />\nfor $4 a night, breakfast<br />\nincluded—dormitory space<br />\ncosts less.<br />\nBicycle rentals for $2.80 a<br />\nweek.<br />\nDiscotheques, folk singing, jazz<br />\nclubs and boutiques.<br />\nSeason ticket to 900 stately<br />\nhomes, castles and historic<br />\nsights for $3.<br />\nWhere to get lunch or dinner<br />\nfor $1.<br />\nHow to choose your<br />\ntransportation to Britain.<br />\nSpecial student programs<br />\nstarting a $655, including fa,e<br />\nand tour, but excluding cost of<br />\nfree time.<br />\nTravel-study programs, work<br />\ncamps,summer schools.<br />\nLondon theatres, balcony seats<br />\n$1.40—some gallery seats 700.<br />\n<br />\nBritish Travel<br />\nBox 923, New York, N.Y. 10019<br />\nPlease send me your free 24-page brochure \"Students Visiting Britain.\"<br />\nName<br />\n<br />\nCLOTHES<br />\nHORSES!<br />\ncheck the<br />\nquality and<br />\nvalue at<br />\nTHE<br />\n<br />\nSAMPLE<br />\nSTORE<br />\nEVERY SUIT<br />\nIN OUR STOCK<br />\nValues to<br />\n$65.00<br />\n<br />\n*29<br />\n<br />\n40*<br />\n<br />\nSAMPLE STORE<br />\n3031 Greenmount Ave.<br />\nin Waverly<br />\nOPEN EVERY EVENING<br />\ni• CHARC-11 • MC • $1000<br />\n<br />\nCIIM<br />\n<br />\ncareer opportur,lies in<br />\n<br />\nMANAGEMENT<br />\n<br />\nACCOUNTING<br />\n<br />\nBachelor's or master's degree in<br />\naccounting<br />\nMaster's degree in:<br />\nbusiness administration<br />\npublic administration<br />\nindustrial management<br />\nfinance<br />\neconomics<br />\npersonnel management<br />\nliberal arts<br />\nB average or above in major subjects<br />\n<br />\nCollege<br />\nAEC<br />\n<br />\nrecruiter interviewing<br />\n<br />\nOil (am pus<br />\n<br />\nAddress<br />\nCity<br />\n<br />\nState<br />\n<br />\nMINI MIN MIMI MIN 1E111 M11111 1E1111 NEI 1111M1 MINN<br />\n<br />\nZip<br />\nNMI MIMI NMI 1111<br />\n<br />\nSee your placement officer for brochure and interview appointment<br />\nU.S. ATOMIC ENERGY<br />\nCOMMISSION<br />\nan equal opportypity employer<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17. I 967<br />\n<br />\nNFWS-LETTER<br />\n<br />\nPAGE TI I REE<br />\n0<br />\n<br />\nI CAMPUS NOTES<br />\nHELIO - ECCENTRICITY<br />\nProfessor Edward Rosen, Professor of History of Science at<br />\nCCNY,will present five lectures on<br />\n\"The Physical World from Copernicus to Kepler.\" The first lecture<br />\nwill be on Copernicus, November<br />\n29, 2 p.m., in the Garrett Room<br />\nof the Eisenhower Library.<br />\nPROFITEERING<br />\nThe Vector will be distributed<br />\non Tuesday, November 21. Due to<br />\nprohibitive printing costs, free distribution will only be available to<br />\nundergraduates. Graduate students<br />\nand faculty will be asked to cough<br />\nup 25¢. Contributions are solicited<br />\namong students and faculty. All<br />\ncorrespondence should be addressed to VECTOR,Box 1105.<br />\nPLAGUE YOUR PROF<br />\nThe Course Guide will be published this semester, under new<br />\neditorship, with Student Council<br />\nfinancial backing. The new questionaire will have an essay format.<br />\nEssay answers will allow students<br />\nto be more specific about courses<br />\nand professors. (If you're concerned about your mark, inform<br />\nyour prof about this innovation<br />\nand your potential use of it). The<br />\nquestionaires will be in mailboxes<br />\nafter Thanksgiving.<br />\nSING ALONG WITH BONAZZI<br />\nThe Baltimore Choral Arts Society is presenting Elaine Bonazzi,<br />\nat Goucher's Kraushaar Auditorium, on December 17, 8:30 p.m.<br />\nBonazzi, who records for Columbia, will sing Bach's Christmas Oratorio. Tickets are $4, and may be<br />\nobtained from the Society at 4<br />\nEast University Parkway.<br />\n<br />\nCarnegie-Mellon University,. Head<br />\nof the Department of Computer<br />\nScience, will speak on \"What Does<br />\nit Mean to Converse with a Computer?\" Dr. Perlis may be late since<br />\nhis computer has been nagging him<br />\nto death.<br />\nLEAVE BALTIMORE? AWW<br />\nThere will be a chartered Greyhound Bus to New York City for<br />\nThanksgiving Vacation. It leaves<br />\nLevering Hall at 2 p.m., on Wednesday, November 22. The bus will<br />\nreturn on Sunday, leaving Port<br />\n<br />\nAuthority at 7 p.m. Round trip<br />\nfare is $9.50. Contact Eric Herzog,<br />\nBox 1001 or call 235-2371. Our<br />\nsympathies to all floppies who<br />\nbrave the annual ten hour Sunday<br />\nride down the Jersey Turnpike.<br />\nBEARING ALONG WITH SEX<br />\nRichard F. Hettlinger,author ot<br />\nLiving with Sex: The Student's<br />\nDilemma, will present a Jeffery<br />\nlecture on \"Living with Sex,\"<br />\nNoveinber 21,4 p.m., in the Great<br />\nHall of Levering. Children under<br />\n18 will not be admitted without<br />\nan adult.<br />\n<br />\nStand fast<br />\nin Bass Weejuns!<br />\nRide it out ... wait for Bass Weejuns® moccasins<br />\nat your nearby college store or shoe shop.<br />\nOnly Bass makes Weejuns.<br />\nMain St.,<br />\nG. H. Bass & Co.,<br />\nWilton, Maine 04294.<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nPecora's Restaurant<br />\n<br />\nSias<br />\n<br />\nfor the finest Italian food in town<br />\n<br />\n3320 Greenmount Ave.<br />\nSPAGHETTI MEALS<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\nCARRY OUT SERVICE<br />\nCALL 889-38w<br />\n00l31<br />\n<br />\nHow would you fit into Du Pont's Project X?<br />\n<br />\nMEANWHILE,BACH AT THE . . .<br />\nOn Sunday, November 19, the<br />\nGlee Clubs of Goucher,and Franklin and Marshall will present a<br />\njoint concert. Featured will be<br />\nBach's \"Magnificat in D.\" This<br />\nSunday's concert marks the second<br />\nhalf of the intercourse between<br />\nGoucher, and Franklin and Marshall Glee Clubs.<br />\nCONTEMPLATE YOUR NAVAL<br />\nDr. Gunnar P. Oilman, of the<br />\nScientific Staff at the Naval Research Lab, will be at Hopkins on<br />\nDecember 1. Join up and steal<br />\nsome secret research contracts<br />\nfrom your alma mater.<br />\nSHUT UP AND LISTEN<br />\nThe next computer seminar will<br />\nbe held Monday, November 20,<br />\n3:30 p.m., in the Auditorium of<br />\nShaffer Hall. Dr. Alan Perlis of the<br />\n<br />\nSTAMP IT!<br />\nIT'S THE RAGE<br />\n<br />\nREGULAR<br />\nMODEL<br />\nANY<br />\n<br />\n2<br />\n<br />\n3 LINE TEXT<br />\nThe finest INDESTRUCTIBLE METAL<br />\n1<br />\n2\" x<br />\nPOCKET RUBBER STAMP. /<br />\nSend check or money order. B.<br />\nsure to include your Zip Code. No<br />\npostage or handling charges. Add<br />\nsales tax.<br />\n<br />\nr.<br />\n<br />\nPrompt shipment. Satisfaction Guaranteed<br />\nTHIE MOPP CO.<br />\nP. 0. Bei 18623 Lenox Square Station<br />\nATLANTA. GA.. 30325<br />\n<br />\nSAV-IT<br />\niitiuORS<br />\n329 W.29th St.<br />\nTHE HOUSE OF<br />\nGOOD CHEER<br />\n<br />\n243-3313<br />\n<br />\nYou are the only person who can answer<br />\nthat question.<br />\nTo do it, you should know as much as possible about<br />\nthe 150 new plant units Du Pont has built since<br />\nthe end of World War II. You'd then choose from one of<br />\nthe many lively fields of interest at Du Pont:<br />\ndesign, construction, production, marketing, research<br />\nand process improvement (to name just a few).<br />\nInvolvement starts the day you join. There is no<br />\ntraining period. You go into responsible work right away.<br />\nYour professional development is stimulated by<br />\nreal problems and by opportunities to continue your<br />\nacademic studies under a tuition refund program.<br />\nYou work in small groups where individual<br />\ncontributions are quickly noted and appreciated.<br />\nThe work is significant, and of benefit to society.<br />\nYou're part of the most exciting technical environment<br />\navailable today and tomorrow, and facilities and<br />\nassociates are the best.<br />\nHow could you fit in? Why not sign up for a chat with<br />\na Du Pont interviewer and find out? The coupon will<br />\nalso bring you more information about us.<br />\nFinally, what is Project X?<br />\nWe don't khow yet. Could be we're OU PON T<br />\nwaiting for you to tell us.<br />\n1116. y.). PAT 011<br />\n<br />\nE. I. du Pont de Nemours & Co. (Inc.)<br />\nNemours Building 2500-2<br />\nWilmington, Delaware 19898<br />\nPlease send me the Du Pont Magazine along with<br />\nthe other magazines I have checked below.<br />\n0 Chemical Engineers at Du Pont<br />\n0 Mechanical Engineers at Du Pont<br />\n111 Engineers at Du Pont<br />\n0 Du Pont and the College Graduate<br />\nName<br />\nClass<br />\n<br />\nMajor<br />\n<br />\nDegree expected<br />\n<br />\nCollege<br />\nMy address<br />\nCity<br />\n<br />\nState<br />\n<br />\nZip Code<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE FOUR<br />\n<br />\nThe Grass, Somewhere, Is Greener<br />\nIn a recent report to the Plant Manager's Office, freshman housemaster, past DSRC president and veteran dorm dweller Doyle Smith<br />\ninformed Wesley Taylor that not only was the food served in the<br />\ndormitories of exceptionally poor quality, but that organizational<br />\n_aspects of the food service's management makes dining there an unattractive and harrasing ordeal.<br />\nThe report is the most recent evidence of a growing dissatisfaction directed against the very services dorm residents hope to receive<br />\nfor the $900 each pays to the university annually. Despite the recent<br />\noutlay of money for unseen improvements, and compared to many<br />\nuniversities throughout the nation who are rapidly expanding their<br />\ndormitory facilities with new and modern structures, Hopkins students are resigned to living in two-tone cinder block cell blocks.<br />\nGranted, Hopkins cannot suddenly refurbish or build new dorms at<br />\nthe moment, but it can furnish the dormitory diner with more nutritious and attractive meals.<br />\nAmong the complaints listed in Smith's report(A compilation of<br />\nfreshman grievances) were: too much starch, too small poultry, too<br />\nlittle food, dirty utensils, no variety or choice in any one meal,<br />\ngreasy food, little fruit, hair and flies (ad nauseum) in food, badly<br />\nprepared desserts,etc., etc ...There is no excuse for these conditions<br />\nto continue. One need only go as close by as Notre Dame to see how<br />\nwell some students are able to eat.<br />\nHousemaster Smith comes to the conclusion that the food service should henceforth be run on a cash basis, which would force it<br />\nto become more competitive — that is, if better food were offered,<br />\nmore students would patronize the dining room; if a poor meal were<br />\nserved, students could eat elsewhere and only the food service would<br />\nlose out.<br />\nWe strongly recommend that the Plant Manager's Office look into<br />\nsuch a proposition by requesting bids from competing food services,<br />\nincluding the largest and most popular service, which, incidentally,<br />\nfeeds the hungry mouths at Goucher and Notre Dame. To have a dormitory with good enough food and organization to attract enough<br />\ndorm students to eat there on a cash basis would entail a considerably<br />\nlarger budget for food on the part of the Plant Manager. But the<br />\nmoney which many dorm residents now lose by missing meals breakfasts when they sleep late, lunches when they have classes, din- _<br />\nner when they are away - Or parents come to town - would perhaps make up for the more expensive meals served on a cash basis.<br />\nHow far more democratic it would be to pay for the mealswhich you<br />\nare here to eat and which you want to eat, rather than paying for the<br />\nliver you do not eat and the stone-hard cake you cannot digest.<br />\nAt a recent ODK meeting, Hopkins Plant Manager Wesley Taylor<br />\nexplained that he had once received bids from several food services,<br />\nand the present management had underbid all others. He also expressed his faith in the product it offers the dorm students at dinner<br />\ntime. Mr. Taylor is also the gentleman, reliable sources have told us,<br />\nwho recently suggested that the Kosher Dining Room lower its quality of food if it wants to lower its prices. Such a truism we do not<br />\ndispute, but we certainly hope he has not lowered the quality of<br />\nfood in the dormitory for this reason when we have been told by<br />\nDoyle Smith that students there would prefer paying slightly more if<br />\nthey could be assured of a corresponding improvement in their<br />\nmeals.<br />\nWe feel certain that if the concerned parties in the administration<br />\ndevoted their time to trying to find a more effective and appetizing<br />\nmean of feeding the dorm students rather than quieting and calming incipient food protests, then perhaps a solution to the problem<br />\ncould be found. But in case the Plant Manager is not sensitive to the<br />\nrequest of Doyle Smith and other students, then dorm residents<br />\nmay well find last year's student council president Bill Reinsch's<br />\nsuggestion the most effective - -dump an entire dinner on the steps<br />\nof Homewood House.<br />\n<br />\nEh, Johns nphtnø Pistaa-Ettist<br />\nEDITORS-IN-CHIEF<br />\nRoger C. Toll<br />\n<br />\nPeter J. Koper<br />\n<br />\nBUSINESS MANAGERS<br />\nJames N. Franke<br />\n<br />\nDavid S. Cooper<br />\n<br />\nTHE BOARD OF CONTROL<br />\nEXECUTIVE EDITOR<br />\nAN<br />\nAL<br />\nCHAIRM<br />\nEDITORI<br />\nJoseph Weinberg<br />\n<br />\nDavid Schneiderman<br />\n<br />\nNEWS MANAGER<br />\nDennis Estis<br />\n<br />\nNEWS EDITOR<br />\n<br />\nCOPY EDITOR<br />\nPeter Harnik<br />\n<br />\nBruce Drake<br />\n<br />\nSPORTS EDITOR<br />\n<br />\nGRAPHICS EDITOR<br />\n<br />\nJames Sloan<br />\n<br />\nNeil Grauer<br />\n<br />\nASSOCIATE EDITORS<br />\nElia Katz<br />\n<br />\nMurray Rudnick<br />\n<br />\nJed Luchow<br />\n<br />\nMike Phillips<br />\n<br />\nREPORTERS<br />\nRichard Cramer, Steven Britz, Steve Bartlett, George Gorse.<br />\nTed Rohrlich, David Hoelscher, Tom Lemm, Robert Sloan,<br />\nand Steve Shriver.<br />\nFEATURES:Michael Michaelson. Kenneth Bond, James Bennett.<br />\nTim Stocks. Baron Wormser. and Seth Feldman.<br />\n<br />\nNEWS:<br />\n<br />\nSPORTS: Richard Hollander, and Bob llyams.<br />\nGRAPHICS: Snuffy Smith<br />\nP11OTOGRAPI IY: Tom Hoffman and Frank Urrutia<br />\n<br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nThis Is Your Paper!<br />\nshould be the ones to make deciTo The Editors:<br />\nsions about how the educational<br />\nbe<br />\nto<br />\nis<br />\nCouncil<br />\nThe Student<br />\ncarried out.<br />\ncommended for its action in mov- process is<br />\nThe News-Letter goes.<br />\nfar<br />\nThis<br />\nrights,<br />\nof<br />\nbill<br />\nstudent<br />\na<br />\ning to draft<br />\nLetter recognizes<br />\nNewsThe<br />\nBut<br />\nand The News-Letter is to be comuniversity comthe<br />\nto<br />\nparts<br />\nthree<br />\ng<br />\nsupportin<br />\neditorial<br />\nits<br />\nfor<br />\nmended<br />\nfaculty and adstudents,<br />\nmunity:<br />\nexthis action. But it would be<br />\nindeed<br />\ntremely unfortunate if such a bill ministration. Three partsdifferent<br />\nis<br />\npart<br />\none<br />\nbut<br />\nare,<br />\nthere<br />\nn<br />\nconceptio<br />\nwere to mirror a false<br />\nserve the<br />\nof the student's role in the univer- in being there only to<br />\nin decirole<br />\nits<br />\nHence<br />\ntwo.<br />\nother<br />\nand<br />\nsociety,<br />\nin<br />\nsity community and<br />\ndifferbe<br />\nalso<br />\nshould<br />\naking<br />\nsion-m<br />\nI think there is evidence that<br />\nthe<br />\nfor<br />\nnatural<br />\nbe<br />\nwould<br />\nIt<br />\nent.<br />\nLetter<br />\nNewsand<br />\nCouncil members<br />\nalvoice,<br />\na<br />\nhave<br />\nto<br />\ntion<br />\nadministra<br />\neditorial writers share such a conor even the<br />\nonly<br />\nthe<br />\nnot<br />\nthough<br />\nception.<br />\nmatters<br />\nThe Council's action came as a predominant .voice, in<br />\ne, e.g. financompetenc<br />\nits<br />\nwithin<br />\nation<br />\nAdministr<br />\nalleged<br />\nof<br />\nresult<br />\nsuch as acasuppression of a protest against ces, but not in matters policy or<br />\nresearch<br />\nprogram,<br />\ndemic<br />\ndormithe<br />\nin<br />\nfood<br />\nof<br />\nthe quality<br />\nThe administories. The Council appears to be student discipline.<br />\nable to serve<br />\nbe<br />\nalso<br />\nshould<br />\ntration<br />\nstudent<br />\nwith<br />\nprimarily<br />\nconcerned<br />\nthe uniabout<br />\ndecisions<br />\nmaking<br />\nin<br />\nrules<br />\nfreedom to protest, parietal<br />\nto society - relates<br />\nit<br />\nas<br />\nversity<br />\nimwhile<br />\nthat,<br />\nmatters<br />\nother<br />\nand<br />\narea<br />\nportant, are peripheral to the edu- perhaps the most important this<br />\n- - but<br />\n-making<br />\ndecision<br />\nof<br />\nbill<br />\nstudent<br />\nNo<br />\nprocess.<br />\ncational<br />\nan administration<br />\nof rights will have any meaning un- would require representative of<br />\nbroadly<br />\nwas<br />\nthat<br />\nesan<br />\nas<br />\nstudent<br />\nthe<br />\ndefines<br />\nit<br />\nless<br />\nthe academic<br />\nsential (one might even sat the society as well as<br />\nmember board of<br />\nessential) participant in this pro- community;a 48for instance, be<br />\ncess. This -implies that students, trustees, could, students, eight<br />\neight<br />\nof<br />\nup<br />\nalong with the other participants, made<br />\nTo The Editors:<br />\nBlackwell's the Book Center is<br />\nnot. Until it reaches that happy estate (and the Great Pumpkin rises<br />\nfrom the Homewood patch), some<br />\nmembers of the community will<br />\nview any improvements as mere<br />\ntokenism. Meanwhile, however, responsible criticism from The<br />\nNews-Letter and other voices of<br />\noutraged literacy can help to<br />\nnudge the Book Center along toward a more effective role in the<br />\ntotal educational processs.<br />\nAlthough I recognize the tone<br />\nof slightly cracked authority, an<br />\noccupational disease, as indeed my<br />\nown, the ex cathedra statements<br />\nwhich Dick Cramer ascribed to me<br />\nin his lively article on the Book<br />\nCenter seemed to appear some-<br />\n<br />\nwhat out of context. Memory is<br />\nspecial pleading and protest makes<br />\nbetter copy than progress, but my<br />\nown recollection is that I prefaced<br />\nthe remark about plenty of room<br />\nfor improvement with the comment that 1967 has seen more<br />\nconstructive changes in bookish<br />\npolicy than I can remember during<br />\nthe rest -of my stay at Hopkins.<br />\n(And, I'd quickly add, not enough<br />\nchanges to satisfy the legitimate<br />\nexpectations of the students, the<br />\nfaculty, or, for the matter, the<br />\nManager.)<br />\nAs you have reminded us in the<br />\npast, The News-Letter has played<br />\nan instrumental role in provoking<br />\nsome of these changes. The homework,agitation, and suggestions of<br />\nthose students who included Book<br />\n<br />\nfaculty members, eight alumni,<br />\nfour representatives of each of the<br />\nfederal, state and local governments and twelve representatives<br />\nof interest groups in the community at large: labor, business, professions, the arts, civil-rights organizations and so forth. As the administration is now constituted,<br />\nhowever,such powers would clearly be unwarranted.<br />\nThis, of course is not the way<br />\npower relationships are now. And<br />\nthey are not going to become this<br />\nway by the grace of the Administration. Any student bill of rights<br />\nthat wousld be acceptable to the<br />\nAdministration would be per se an<br />\nineffective one. This does not<br />\nmean that the effort to draw up a<br />\nbill of rights should be abandoned.<br />\nRather it means that such a document should be presented as a list<br />\nof demands, demands that the students are prepared to back up with<br />\naction.<br />\nAs a guide in drawing up such a<br />\nbill, every Council member should<br />\nread the Declaration of the Canadian Student, passed last September at the Congress of the Cana(Continued on Page 5)<br />\n<br />\nStore reform in their political<br />\nplatforms also helped. But it would<br />\nbe Jess than fair to overtook a<br />\nnumber of others who contributed at one time or another to moving the issue from the familiar<br />\nsphere of diffuse discontent toward a number of specific actions.<br />\nMessrs. Taylor and Vayne, with<br />\nsome advice from Tony Neville<br />\nand others, had started- plans for<br />\nthe physical improvement of the<br />\nnew quarters some time before the<br />\nheadlines of last year. On balance,,<br />\nthe Center seems to me one of the<br />\nhappier privinces of the \"new Gilman Hall.\" The faculty committee<br />\nformed last year had the chance<br />\nto profit from the advice and discontent of many members of the<br />\ncommunity, including letters from<br />\n(Continued on Page 3<br />\n<br />\nthe dorm students, would not sup— frightened of student power, nu,<br />\nTo The Editors:<br />\nraises questions as to in principle. but because of its<br />\nRecent attacks on the Student port it. This<br />\nof a leader to pull dogmatism, conceit, and narrowobligation<br />\nthe<br />\ncomCouncil have inspired a few<br />\npolitical conscious- mindedness. At the Washington<br />\ninto<br />\npeople<br />\nthe<br />\nments of my own, as one familiar<br />\nagainst their will; March on the Pentagon the sight<br />\nness,<br />\npossibly<br />\nwith the organization.<br />\nbut a democratic system and a lack of a beautiful girl, complete with<br />\nFirst, it is to be remembered, of party cadres in this case deter- flowers, bells, etc. yelling \"Get<br />\nthat the Conncil and the president mined the decision. I would sug- him! Get him!\" as her friends atfinds itself in the dilemma of being gest that critics frequently fail to tacked someone supporting the<br />\nexpected by the students to up- consider what the Council usually war lent an element of hypocrisy<br />\nhold their views and simultaneous- takes note of, the fact that if one to the movement.<br />\nly expected by the administration is to reform the Council, one must<br />\nWhile students always seem to<br />\nto aid in propagating the official first reform the students, no easy perceive a grain of truth in an isline. Since they are the one group task.<br />\nsue, we have an equal affinity for<br />\nregularly consulted by the admincreating black and white issues<br />\nprotest<br />\non<br />\ncomment<br />\na<br />\nFinally,<br />\nistration, they by definition, bein general. Council criticism is of- out of grey ones through oversimcome members of the status quo,<br />\nI*<br />\nten directed toward the irrelevancy plification and exaggeration.<br />\nand thus most, of necessity, usualdeto<br />\nnot<br />\nthings<br />\nthese<br />\nmention<br />\nof its inquiries, with the suggestion<br />\nly work within an orthodox frame- that it give its attention to nation- fend the Council, as it was conbe<br />\nwork if they are not to snuffed<br />\nal issues of war, the draft, civil stantly a source of frustration to<br />\nout of existence by a cynical ad- rights, etc. No one explains how me during my tenure, but merely<br />\nministration even before• they the Council with limited author- to point out that the issue is a<br />\ncould be rejected by over - or unity and influence on the campus, grey one, rather than all black.<br />\nder zealous students. If led creaSincerely,<br />\nmake a national impression.<br />\ncan<br />\ntively by the representatives (and Furthermore, I tend to be rattier<br />\nPresident<br />\nex<br />\nBill<br />\nRcinsch<br />\n-Council<br />\nare<br />\nI remind everyone that these<br />\nelected by the students, who must,<br />\nwhat he thought I should do. He<br />\nthe Editors:<br />\nin the final analysis, be blamed for To<br />\nded keeping the mess to<br />\nrecommen<br />\nthe<br />\nconsidered<br />\nalways<br />\nhave<br />\nI<br />\nmistakes), the Student Council has<br />\n, when the NewsTherefore<br />\nmyself.<br />\nviran opportunity for constructive News-Letter a \"paragon of<br />\ncalled, I related<br />\nLetter<br />\n\"<br />\n\"reporter<br />\nof<br />\ntraditions<br />\nthe<br />\nin<br />\nsteeped<br />\nactivity in all areas. One should, tue,\"<br />\nhe<br />\nasked<br />\nand<br />\nme to tell<br />\nto<br />\nthis<br />\nhim<br />\nhowever, keep the odds against honesty, objectivity, impartiality, him the story anyway, \"just oat<br />\nthree<br />\nFor<br />\nns.<br />\nabstractio<br />\nrelated<br />\nthe Council, as represented by the and<br />\ner of curiosity.\" Hopeless naive inadministration, in mind and not years I have enjoyed News-Lett<br />\ndividual that I am, I told the<br />\nand<br />\nobjective,<br />\nhonest,<br />\naccounts<br />\nexaggerate one failure into monudarn kid the twenty-minute story<br />\nof<br />\notlicrs.<br />\nmental and inherent incompetence. impartial - of the plights<br />\nin about three minutes, under the<br />\n3,<br />\nNovember<br />\nthe<br />\nin<br />\n,<br />\nSomehow<br />\nSecond. the Council is forced<br />\nthat I not see it in print<br />\ncondition<br />\nhonesty,<br />\nneither<br />\nto consider aspects of problems 1967 issue, was<br />\nReply: \"Don't<br />\nremorning.<br />\nFriday<br />\nty<br />\nimpartiali<br />\nnor<br />\ny,<br />\nobjectivit<br />\nunknown to (or ignored by)critics.<br />\nworry.\"<br />\nnot<br />\nsimply<br />\nwere<br />\nfacts<br />\nFor example, in my campaign I lated. The<br />\nHonest to God, fellas. are yoU<br />\nproper sequence.<br />\nproposed a protest against dorm accurate or in<br />\nthat<br />\nhard-up for a story? If<br />\nfood by dumping an entire meal<br />\nThis lack is undoubtedly a fu- found guilty, J plan to sue the<br />\non the steps of Ilomewood !louse. nction of the way the paper got<br />\nNews-Letter for libel for the<br />\nLater this was not done, largely the story. Anticipating a Newsof tile court 'costs.<br />\namount<br />\nbecause my investigations showed Letter inquiry. I asked Mr. Bilgrave<br />\nDavid Wirtz<br />\nthat my constituents. particularly<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE FIVE<br />\n<br />\nDr. Macksey Reviews Book Center<br />\n(Continued from Page 4)<br />\n<br />\ncolleagues which were considerably more inflammable than the press<br />\ncoverage, but most importantly it<br />\nhad a remarkably effective chairman, Dr. Owen Phillips, who gathered a considerable body of information about university bookstores and JHU procedures, who<br />\nforced its schedule through the<br />\nChristmas holiday so that a draft<br />\nreport could be presented by the<br />\n<br />\nfirst of the year. In a climate<br />\nwhere it often takes three months<br />\nfor a committee to resolve to open<br />\nthe window, this was no small achievement and possible only with<br />\nlarge doses of strong coffee and<br />\nthe expert archival work of his assistant, Mrs. Elder, Further<br />\nthough, he was able to embody in<br />\na choerent form most of the intelligent suggestions which were<br />\n<br />\n(Continued on Page 6)<br />\n<br />\nEngineers scientists<br />\n<br />\nUDH Speaks<br />\ndian Union of Students. The declaration defines education as \"a<br />\ncontributive social process\"- of<br />\nwhich the main goal is \"to serve<br />\nsociety by developing the full potential of all citizens,\" and goes on<br />\nfrom there to discuss essential student rights and duties, based on<br />\nthe student's being \"a member of<br />\na global society.\" Among these are<br />\nthe right \"to establish democratic,<br />\nrepresentative student associations\" and, since \"educational reform will not come in a vacuum,\"<br />\nto \"ally themselves with other<br />\ngroups in society- which have similar aims.\" The student also has<br />\n\"the • right and the duty . . . to<br />\nmake basic decisions about the<br />\nconditions and nature of his intellectual activity and the goals served<br />\nby educational institutions.\"<br />\nSuch a concept of education<br />\nwill clearly never be realized at<br />\nHopkins unless major changes are<br />\nmade. This situation must be the<br />\nprimary concern of both the Student Council and The News-Letter<br />\nif they are to have any claim to our<br />\nat<br />\nYours faithfully,<br />\nRobert Chodos<br />\nUnion for Democracy at<br />\nHopkins<br />\n<br />\nNaval<br />\nResearch<br />\nLaboratory<br />\nWASHINGTON, D.C.<br />\n<br />\nThere's Room<br />\nat our up<br />\n...and we'll<br />\n<br />\n(Continued from Page 4)<br />\n<br />\n•Oi<br />\n<br />\nbrought to the committee and<br />\nwhich were translated into the<br />\nfinal report.<br />\nThere were nine substantive recommendations in the committee's<br />\nreport, followed by a discussion<br />\nof the assumptions and policy behind them. Dr. Bevan, who had<br />\noriginally charged the committee,<br />\n<br />\nAn Equal Opportunity Employer<br />\n<br />\nThe Navy's Corporate Laboratory—NRL is<br />\nengaged in research embracing practically<br />\nall branches of physical and engineering science and covering the entire range from<br />\nbasic investigation of fundamental problems<br />\nto applied and developmental research.<br />\n<br />\nshow you<br />\nhow to get there.<br />\n<br />\nThe Laboratory has current vacancies and a<br />\ncontinuing need for physicists, chemists,<br />\nmetallurgists, mathematicians, oceanographers, and engineers (electronic, electrical,<br />\nmechanical, and civil). Persons appointed<br />\nreceive the full benefits of the career Civil<br />\nService.<br />\n<br />\nAs an innovator in the aerospace community, Fairchild Hiller has<br />\nselected \"areas of inevitability\" where our experience and capability show clear promise for substantial contributions, for continuing growth.<br />\nOur future is in scientific satellite technology, electronic information handling, supersonic and super-capacity airliners, regional<br />\nairliners, vertical flight technology, and in the related specialized<br />\ntechnologies. Fairchild Hiller provides unmatched professional<br />\nchallenge. Unmatched personal growth.<br />\nFairchild Hiller's unique personnel development programs will<br />\nkeep you moving as fast as your individual abilities allow.<br />\nFind out more about career opportunities at Fairchild Hiller by<br />\ncontacting your Placement Office now. Campus interviews may be<br />\nscheduled on<br />\n<br />\nCandidates for bachelor's, master's and doctor's degrees in any of the above fields are<br />\ninvited to schedule interviews with the NRL<br />\nrepresentative who will be in the<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\nplacement office on<br />\n<br />\nDECEMBER 1, 1967<br />\n<br />\nWEDNESDAY, DECEMBER 6, 1967<br />\n<br />\nVAIF?<br />\nC.:<br />\n<br />\nI-1IL.CI<br />\nPI<br />\n<br />\nF<br />\n<br />\n0<br />\n<br />\nf3<br />\n<br />\nA<br />\n<br />\nThose who for any reason are unable to<br />\nschedule interviews may write to The Director (Code 1818), Naval Research Laboratory, Washington, D. C. 20390.<br />\n<br />\nIL,L.EF?<br />\n7<br />\n<br />\nI<br />\n<br />\n0<br />\n<br />\nTV<br />\n<br />\nAircraft Division, Aircraft Service Division, Republic<br />\nAviation Division, Space and Electronics Systems Division,<br />\nStratos Division, Technical Services.Division<br />\nAn equal opportunity employer, M&F<br />\n<br />\nANNUAL FALL<br />\n••••••••••••<br />\n•••••••••••••••<br />\n<br />\n••••••<br />\n<br />\n••••<br />\n•••••••<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\n•<br />\n•<br />\n<br />\n•<br />\n<br />\n•••••••<br />\n<br />\n•••••••••<br />\nS••••••••••<br />\n<br />\n••••••••••<br />\n<br />\nDrastic Reductions on Hundreds of Fine Volumes!<br />\n<br />\nSAVE50% to 70%<br />\nNon-Fiction Titles On<br />\n<br />\nLiterature - Biography - Poetry - Science - History - Reference Philosophy - Psychology - Humor - Romance - Sports - Art - Travel<br />\n<br />\nALL Subjects! Hundreds of Bargains!<br />\nSALE STARTS FRIDAY, NOVEMBER 17th<br />\nTHE JOHNS HOPKINS UNIVERSITY<br />\nBOOK CENTER<br />\nIn The Heart of Gilman Hall<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE SIX<br />\n<br />\nthe Roao qoes EVER on<br />\nsonq cycle ••• music By<br />\nOonalO swann poems<br />\nP. P.tolkien<br />\nNow the songs of Frodo,lbo, Sam Treebeard and<br />\nTom Bombadil can be sung or played by all. Donald<br />\nSwann, of Flanders and Swann, has, with the assistance and encouragement of Professor Tolkien, set<br />\nseven songs from The Lord of The Rings to music.<br />\nEach song may be sung individually or taken together<br />\nas a group to form a song cycle. The arrangements<br />\nare for piano or voice and guitar symbols are given.<br />\n$3.95<br />\n<br />\npoems anO songs of misnle eaRth<br />\nREAD BY J.R.R. TOLKIEN<br />\nFor his first venture into the recording world Professor<br />\nTolkien has chosen to read from the delightful poems<br />\nof Tom Bombadil. On the reverse side William Elvin<br />\nsings the songs from The Road Goes Ever On with<br />\nDonald Swann at the piano. This record is a must.<br />\nCaedmon Record rTC 1231<br />\n$5.95<br />\nAvadable at your college bookstore<br />\nHOUGHTON MIFFLIN COMPANY<br />\n<br />\nAVAILABLE AT<br />\n<br />\nTHE JOHNS HOPKINS<br />\nBOOK CENTER<br />\nIN THE HEART OF GILMAN HALL<br />\n<br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17,1961<br />\n<br />\nWho's Afraid of the Bookstore?<br />\n(Continued from Page 5)<br />\n<br />\nand the President responded to the<br />\nreport promptly and, contrary to<br />\nyour account, agreed with only<br />\nminor revisions to enable all of the<br />\nproposals in time for the opening<br />\nof the Center at the end of the<br />\nmonth. In addition, a permanent<br />\npolicy committee was established<br />\nto see that the recommendations<br />\nfound their way into practice and<br />\nto serve as an effective channel<br />\nfor suggestions and complaints<br />\nfrom all members of the community. (To the best of my knowledge, the committee has not addressed itself, as reported, to the<br />\nstaff's need for a green room or<br />\nany similar request, although suggestions from the employees toward the improvement of service<br />\nand conditions are just as welcome<br />\nas those from the students or faculty. Presumably all members of<br />\nthe community are enfranchised<br />\nto complain and to propose.) Despite the bonecrushing demands already made on his time by all<br />\nbranches of the University, Dr.<br />\nBevan agreed to chair the new<br />\ncommittee and thereby identify<br />\nthe importance of the Book Cen-<br />\n<br />\nter in the academic enterprise.<br />\nHad Mr. Cramer more space, he<br />\nmight have mentioned some of the<br />\nspecific attempts at improving and<br />\nextending the Center's services:<br />\na new special-order and information department, self-service for<br />\nthe text department during most<br />\nof the year, a small second-hand<br />\nand antiquarian department, the<br />\ninclusion of recordings, prints,<br />\nsome press and art books, and additional clerical supplies in the<br />\ngeneral stock; and a start at least<br />\ntoward extending the inventory of<br />\ntrade books and little magazines<br />\nto make the Center a more profitable place to browse.<br />\nSome of the changes were controversial: the shift to a topical<br />\narrangement of the trade books<br />\nwas in response to many requests,<br />\nbut it still has its bagaries for those<br />\naccustomed to the orderly procession of categories; Evan S. Connell's recent novel, The Diary of a<br />\nRapist, quixotically appears under<br />\n\"Sociology,\" while books about<br />\nthe Kennedy clan and the Kama<br />\nSutra tend to turn up under \"Humor.\" For my part, I'm still trying to parse the difference be-<br />\n<br />\nCAMPUS<br />\nINTERVIEWS<br />\nNEXT WEEK<br />\nGraduates at all degree levels<br />\nare urged to investigate<br />\nthe career opportunities at<br />\n<br />\nNIH<br />\nThe world's largest center<br />\nfor conquest of disease<br />\nand improvement of human health<br />\nThe National Institutes of Health—NIH—is the principal research<br />\narm of the U.S. Public Health Service, and conducts many of the<br />\nmost advanced programs in medical science today. These programs require specialists in a wide range of disciplines. Example: Right now NIH has openings in the following areas:<br />\nCHEMISTS . . . BIOLOGISTS . . . NURSES . . . MEDICAL<br />\nTECHNOLOGISTS . . . SOCIAL WORKERS . . . LIBRARIANS<br />\n. . . ENGINEERS . . . COMPUTER PROGRAMMERS. . . MATHEMATICIANS . . . STATISTICIANS . . . SYSTEMS ANALYSTS<br />\n. . . MANAGEMENT INTERNS . . . PERSONNEL SPECIALISTS<br />\n. . . ACCOUNTANTS . . . INFORMATION SPECIALISTS . . .<br />\nMANAGEMENT ANALYSTS . . . CONTRACT SPECIALISTS<br />\nThese are permanent positions that offer high professional<br />\nchallenge and the benefits of career Federal employment. Starting salaries are attractive and opportunity for advancement is<br />\n<br />\ntween \"Fiction\" and \"Literature.\"<br />\nThe decision to extend a 10%<br />\ndiscount on \"trade\" books to all<br />\ncustomers was in response to the<br />\nexplicit request of many students<br />\nand faculty members. This proposal, in fact, seemed the most urgent of the student suggestions.<br />\nThe distinctions between \"trade\"<br />\nand \"text\" categories are made by<br />\nthe publishers, not the management of the Book Center. (In a<br />\nfew cases, the Manager has been<br />\nable to translate a given title to a<br />\ntrade discount by stocking the entire series, e.g. the Loeb Library.)<br />\nThe decision on discounts was a<br />\nprovisional one, involving some<br />\npossible deficits if the volume does<br />\nnot increase in the trade department. The original committee report suggested that discount policy should not be given priority<br />\nover the scope and quality of the<br />\nstock. To my knowledge, only one<br />\nfaculty member lamented the lost<br />\ndiscount on non-trade items, and<br />\nthis was on principle a reluctance<br />\nto give up benefits. If the students<br />\nfeel that the discount is irrelevant,<br />\nit can be revoked and the savings<br />\ndirected toward either improvements in the Book Center.<br />\nObviously, the most trying aspect of the Book Center this year<br />\nhas been the incredible hang-up<br />\nabout texts and special orders. It<br />\nis impossible, however, to wish all<br />\nthe responsibility on the management. The Center has added to the<br />\nstaff in an effort to meet some of<br />\nthe problems, but for almost three<br />\nmonths was without an invoice<br />\nclerk. Further, there are alwavc<br />\nfamiliar delays: the faculty is notoriously slow in submitting lists<br />\nof texts for courses (mea culpa),<br />\nin part because the new courses<br />\nfrequently do not take shape until<br />\nthose few clear days in June; the<br />\ntext houses are so busy effecting<br />\ncorporate mergers that their warehousing and order departments are<br />\nincreasingly fallible (books listed<br />\nas \"in print\" often turn out to be<br />\nnot available until December\");<br />\neven that most addled monopoly,<br />\nthe U.S. Post Office, has increasingly contributed its share of confusion. And finally, the failure to<br />\nanticipate the number of books<br />\nneeded in each course is a direct<br />\nresult of taking too seriously what<br />\nthe students took too lightly:<br />\nspring pre-registration.<br />\nCompared with the massive text<br />\norders of the multiversities, the<br />\nIlopkins Book Center is a quaintly<br />\nsmall operation. If the publishers<br />\nmay occasionally treat our local<br />\nneeds at the same level of priority<br />\nas orders from Katmandu, the<br />\nstaff here has, I think, often tried<br />\nto compensate for this with heroic<br />\n(Continued on Page 8)<br />\nRx Rx Rx Rx Rx Rx Rx Rx Ric<br />\n<br />\nM Thanksgiving<br />\nDay Cards<br />\n<br />\nt<br />\n!<br />\n<br />\nAlso, Gift Boxes of<br />\n<br />\nCandy<br />\nGreenway Pharmacy<br />\n<br />\nexcellent.<br />\nCAMPUS INTERVIEWS<br />\n<br />\nDECEMBER 5<br />\n<br />\nAn NIH representative will be visiting your campus next week<br />\nto discuss these positions with interested students. You may<br />\narrange an interview during this visit by contacting the Placement Office. Or, if you prefer, you may write or call<br />\nCollege Relations Officer<br />\n<br />\nNATIONAL INSTITUTES OF HEALTH<br />\n<br />\nCharles and 34th Sts.<br />\nRx Rx Rx Px Rx<br />\n<br />\nRx Rx<br />\n<br />\nCHUNG'S<br />\nCARRY-OUT<br />\nFine Chinese and.<br />\nPolynesian Food<br />\n<br />\nPhone:(301)496-4707<br />\n<br />\nOpen Dolly 11 A.!'4.. 10 P.M.<br />\nFriday A Sat 11 A.M..12 P.M.<br />\nSunday 1 P.M..11 P.M.<br />\n<br />\nAn equal opportunity employer, M&F<br />\n<br />\n508 W. Cold Spring Lame<br />\n<br />\nBethesda, Maryland 20014<br />\n<br />\n889-3428<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE SEVEN<br />\n<br />\n\"What doesIBM offer a<br />\nPh.D?I'd say diversity.But<br />\njudge for yourself when<br />\nthey're here Dec.12th:'<br />\n<br />\n;e<br />\nis<br />\n<br />\n)-<br />\n<br />\nLs<br />\n),<br />\n;s<br />\nti1<br />\n<br />\n.ere<br />\ned<br />\nbe<br />\n<br />\nly,<br />\n<br />\n)nto<br />\nks<br />\nect<br />\n'aat<br />\nly:<br />\n<br />\next<br />\nthe<br />\ntiy<br />\nlers<br />\nDeal<br />\nrity<br />\nthe<br />\nried<br />\n!roic<br />\n<br />\nRx<br />\n<br />\nIj<br />\n<br />\nIj<br />\n<br />\n'<br />\nfi<br />\n41<br />\n<br />\n: it%<br />\n<br />\nwe<br />\n<br />\n\"I think IBM's worth listening to because the advantages<br />\nthat attracted me are even stronger today.(This is Gary<br />\nKozak,Ph.D. in Analytical-Physical Chemistry,an IBM<br />\nDevelopment Chemist and Project Manager.)<br />\n\"At IBM you're constantly working with people doing<br />\nadvanced work in many different fields. That's a great asset<br />\nto any scientist because today's problems are often<br />\ninterdisciplinary. You can't solve them with one kind of<br />\nbackground. You need inputs from three or four different<br />\nkinds of people.<br />\n\"A good example is the solid logic technology used in<br />\nbuilding the IBM System/360. The EE tells you how many<br />\nconductors you'll have, where they go,and what should be<br />\nat the terminals. An ME designs fixturing and automatic<br />\nprocesses. A Polymer Chemist formulates insulators<br />\nand says how they should be used. The Metallurgist<br />\nspecifies alloy compositions. The Physicist decides how to<br />\noptimize a process for producing transistors and diodes.<br />\nAnd all these people have to talk with each other and<br />\nhelp each other.<br />\n\"It's a stimulating environment,and it keeps you technologically sharp. Of course, to do all this interfacing with<br />\nother disciplines, you need a free and informal atmosphere,<br />\nand IBM has it. It's a good place for a scientist to work.\"<br />\nThere's more to the IBM story than Gary has mentioned.<br />\nYou can get all the facts when we interview Ph.D.'s on<br />\ncampu.Make an appointment at your placement office,<br />\neven if you're headed for military service.<br />\nOr if you can't make a campus interview,send an outline<br />\nof your interests and educational background to<br />\nMr. L. H.Covert,IBM,Armonk, Li ,<br />\nN.Y. 10504. We're an equal<br />\nopportunity employer.<br />\ncji=j3<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nk Center<br />\nIlls,Wills and Bills of Boo<br />\nDr. Macksey Concludes Marathon onreliable<br />\nishments as well<br />\naccompl<br />\nmade<br />\nto<br />\nhave<br />\nseem<br />\nand<br />\nsource own snafus<br />\n<br />\n(Continued from Page 6)<br />\n<br />\nefforts to phone, wire, or dog-sled<br />\nfor the missing books. And we<br />\nstill have the antique advantage of<br />\npersonal access to the people running the store. I only hope that in<br />\nthe future some of the crippling<br />\nlacunae can be spotted earlier,<br />\nwhile there is still time to recruit<br />\nsubstitute texts (or apply for a<br />\n<br />\nAs to the gratuitous slander<br />\nabout the \"guard\" (there are two<br />\nguards, baby), I can only add that<br />\nthe occasional discourtesy I've seen<br />\nin the store during a career of<br />\nabandoned browsing has generally<br />\ncome from the other side of the<br />\ncounter. in fact, Mr. Uren, who,<br />\nlike a number of other members of<br />\nthe staff, seems to enjoy a chance<br />\nto do small favors for the custo-<br />\n<br />\nmers, is the most<br />\nfew<br />\nof the News-Letter in Gilman much less progress in the past<br />\nCenHall,coming up with his own copy years than the Hopkins Book<br />\nwhen all the others are exhausted: ter. In the former case, I'm not<br />\nRecent visits to the Princeton even sure that \"progress\" is the<br />\nU-Store (which has opted for de- word, since their stock of Princevoting much space to high-profit ton University Press books was<br />\n\"soft goods\") and to the Colum- riddled with holes.<br />\nThere is always an ideal univerbia Book Store have reminded me<br />\nill-defined perhaps, but the<br />\nsity,<br />\nwhich<br />\nons,<br />\ninstituti<br />\nthose<br />\nthat<br />\nclaim a richer audience, have their vital standard against which the<br />\n<br />\nTRW is success by association<br />\nAfs-,1<br />\n/<br />\n<br />\nEugene Noth, MS<br />\nTracking it Analytical Simulation<br />\n<br />\nrohl'D.<br />\n'<br />\n,greeoriitF<br />\nL;;:,Vitc.le<br />\nIG°<br />\n<br />\n•:,.<br />\n<br />\nas the<br />\nfailures of the real university must<br />\nbe measured. One of the functions<br />\nof the responsible critic is to remind us of that ideal university<br />\n(which surely includes a much better Book Center). The critic can<br />\nalso help at the most primitive<br />\nlevel by using some of the instruments of reform, such as the al'most blank tablet at the specialorder counter for suggesting titles<br />\nand authors which should be in<br />\nstock. Somewhat more ambitiously, perhaps the News-Letter can<br />\nsuggest an effective means by<br />\nwhich the Students can carry their<br />\nsuggestions and complaints representatively to the committee on<br />\npolicy.(Have an election and you<br />\nmay poll fifty votes.) You might<br />\ntry something like a \"Direct Line\"<br />\ncolumn in your paper for the inveterate letter writers among us.<br />\nFinally, without abandoning the<br />\nideal university, in all our disappointments with the refractory<br />\npresent, we must never lose sight<br />\nof the continuing existence of the<br />\nreal university and its occasional<br />\napproximations of the ideal.<br />\nSincerely yours,<br />\nRichard A. Macksey<br />\nProfessor of Humanities<br />\nBiC Medium Point 19e<br />\n<br />\n.......<br />\nAndra Blaufuss, BS<br />\nGuidance it Mission Simulation<br />\n<br />\nJames Austin, MS<br />\nSystems Analysis 6 Software<br />\n<br />\nFloyd Thomas, Ph.D.<br />\nAdvanced Technology<br />\n<br />\nDon Bowyler, MS<br />\nElectr)nrc Reconnaissance<br />\n<br />\nRoger Burnell, MS<br />\nTelecommunications<br />\n<br />\n••<br />\nJoseph Kawamura, Ph.D.<br />\nSpace Guidance<br />\n<br />\nBiC Fine Point 25t<br />\n<br />\nLawrence Fink, BA<br />\nSub•Systems Programming<br />\n<br />\nrialsilartin, MBA<br />\nrs<br />\n‘ti:<br />\n<br />\nFrom Los Angeles to Houston to Washington,from Space<br />\nSystems to Ocean Systems to Information Systems,<br />\nyoung people are making things happen at TRW,<br />\n<br />\nTake a look around any TRW location.<br />\nThe young faces outnumber the old by<br />\na good margin. The vast majoritji of<br />\nscientists and engineers you'll meet are<br />\nunder thirty, or forty at least. Why?<br />\nBecause we depend cm young ideas,<br />\nnew ideas, fresh ideas. That's why we<br />\nneed you.<br />\nWhat kind of a place is TRW? Ask<br />\naround. Tal_k to your professors and<br />\nfaculty_advisors, or your friends who are<br />\nalready working with TRW. Most of our<br />\nprofessional employees applied to TRW<br />\non the recommendation of friends.<br />\nHere are some of the disciplines where<br />\nnew graduates may find career opportunities at TRW:<br />\n<br />\nComputer Sciences/Analytical<br />\nResearch / Aerosciences / Information Systems / Digital Systems / Communications Systems/Reliability/<br />\nGuidance & Control / Sensor Systems<br />\n/ Microelectronics / Electric Power /<br />\nSpace Vehicle Design / Antenna Systems Design and Analysis / Mechanical Engineering / Product Assurance /<br />\nIntegration & Test / Systems Engineering / Circuit Design / Electronic Countermeasures & Electronic Intelligence<br />\nSystems<br />\nIf you'll be receiving your degree<br />\n(Ph.D.; MS or BS) in Engineering or<br />\nScience this year, check with your<br />\nPlacement Director and talk with us<br />\n<br />\nwhile we're on campus. If you can't<br />\nmake it at that time and would like to<br />\nbe considered for openings in the Los<br />\nAngeles area, Houston or Washington,<br />\nsend your resume to: W. D. Mclvers,<br />\nCollege Relations, TRW, One Space<br />\nPark, Redondo Beach, California 90278.<br />\n<br />\nDespite<br />\nfiendish torture<br />\ndynamic BiC Duo<br />\nwrites first time,<br />\nevery time!<br />\nS rugged pair of<br />\n'<br />\nBIC<br />\nstick pens wins again<br />\nin unending war<br />\nagainst ball-point<br />\nskip. clog and smear.<br />\nDespitp horrible<br />\npunishment by mad<br />\nscientists, inc still<br />\nwrites first time, every<br />\ntime. And no wonder.<br />\nDiese'Dyamite\" Ball<br />\nis the hardest metal<br />\nMade. encased in a<br />\nsolid brass nose cone.<br />\nWill not skip, clog<br />\nor smear no matter<br />\nwhat devilish abuse<br />\nis devised for them<br />\nby sadistic students.<br />\nGet the dynamic<br />\nBIC Duo at your<br />\ncampus store now.<br />\n<br />\na.<br />\n<br />\nc•J<br />\n<br />\nWATERMAN-BIC PEN CORP<br />\nMILFORD, CONN<br />\n<br />\nAn Equal Opportunity Employer<br />\n<br />\nwho are applying advanced technology to space, defense, automotive, aircrait, electronics and industrial<br />\nTRW ((ormerly Thompson Rams Wooldridge) is 60,000 people at 200 operations around the world<br />\n<br />\nmarkets.<br />\n<br />\nENGINEERS AND SCIENTISTS<br />\n<br />\nTRW CAMPUS INTERVIEWS<br />\n<br />\n1\"`'..•<br />\n.<br />\n—jte ;7.tt<br />\n111441<br />\n<br />\n.<br />\n.00<br />\n<br />\nFriday, December 1, 1967<br />\n<br />\nAVAILABLE AT:<br />\nTHE JOHNS HOPKINS<br />\nBOOK (ENTER<br />\n<br />\nSEE YOUR PLACEMENT OFFICE<br />\n<br />\nGilman Hall<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVFMBER 17, 1967<br />\n<br />\nHop-Terror<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE NINE<br />\n<br />\nJays Nest<br />\n<br />\n(Continued from Page 12)<br />\n<br />\n4 ;;*<br />\n,<br />\n<br />\nthe performance of Jay quarterback Jim Feely, as the 5-8 signalcaller had perhaps the best of several excellent Saturday's hitting on<br />\neleven of fourteen passes for 240<br />\nyards and three touchdowns, running for two more scores, and<br />\nthrowing for two conversions.<br />\nHopkins jumped out to a 14-0 lead<br />\non scoring tosses of 60 and 26<br />\nyards from Feely to Joe Cowan;<br />\nand - after Dickinson scored its<br />\nlone T.D. - the Junior quarterback<br />\nthrew to Steve Latson for a 19<br />\nyard score, ran for four yards and<br />\nanother tally, and then handed off<br />\nto Paul Weiss, whose four yard<br />\nT.D. carry gave the Hop a 34-6<br />\nhalftime lead.<br />\nFeely's eight yard run made the<br />\ncount 40-0, before sub quarterbacks Mike Shaw (voted outstanding Jay back of the game,mainly<br />\nfor his work in the defensive secondary) and Steve Clark connected on T.D. tosses of 16 and 14<br />\nyards to Latson and Dave Levien.<br />\nSotir had special praise for his<br />\ndefensive line - especially Wit Holden and Jim Lotto - calling its performance \"better than in the past\";<br />\nbut felt that its offensive counterpart - with the exception of Lineman of the Week Mark Perlmutter<br />\n- did relatively poorly.<br />\nSometime-place kicker Wes Bachur will be available for the game<br />\ntomorrow.<br />\n<br />\n(Continued from Page 10)<br />\n<br />\nBarrette's contingent sports an<br />\noutstanding ability in all positions.<br />\nIn view of these the attractions of soccer in general and at<br />\nHopkins,it appears rather astounding that the sport has been de-emphasized to such an extent. The<br />\nperspective can be clearly seen by<br />\nthe number of fans present at soccer contest (42 at last Tuesday's<br />\nvictory) and at football games<br />\n(over 2000 normally).<br />\nI would like to make it clear<br />\nthat I am in no wise advocating<br />\nthe desertion of football either<br />\nin emphasis or in fan support.<br />\nFootball enthusiasm is a present<br />\nand positive factor on almost every<br />\ncollege campus. I am for packing<br />\nthe stands on Homewood Field<br />\ntomorrow. I do not however, condone the one-sided support which<br />\nhas thus far been given to Hopkins<br />\ngridmen. The action on the pitch<br />\nfield is in no way less outstanding,<br />\nas will be evidenced tomorrow<br />\nwhen the pitchmen host Dickinson at 11 o'clock for their final<br />\nouting of the season.<br />\n<br />\nI've Got My Eye On The Man...<br />\nin a VA NJ 1-1 E U S<br />\n<br />\nNJ'<br />\n<br />\n\"417' VANOPRESS SHIRT<br />\nAnd what an eyeful he is! A physique as<br />\nwell-built and manner as smooth as his<br />\npermanently pressed . . . VANOPRESS<br />\nshirt. A swingy style that matches the<br />\n\"417\" authentic tailoring of his buttondown collar and V-Tapered fit. Switched-on<br />\nstripes or colorful solids in dress or sport,<br />\nVan Heusen has them all. Will I keep him<br />\nin sight? You'd better believe it!<br />\n<br />\nBuild up your following with Passport 360,<br />\nthe influential line of men's toiletries by Van Heusen.<br />\n<br />\nBy students<br />\nfor students<br />\n<br />\nPSYCHEDELICS<br />\nAND THE<br />\n<br />\nCOLLEGE<br />\nSTUDENT<br />\n<br />\n41<br />\n,<br />\n<br />\nCompiled by the<br />\nPrinceton University<br />\nStudent Committee on<br />\nMental Health<br />\nIt took a group of college students to cut through the pretensions and moral judgments<br />\nbeing aired about psychedelic<br />\ndrugs. This 50e• pamphlet<br />\ntells just the facts—the social,<br />\nmedical, and legal aspects of<br />\npsychedelic drug use, descriptions of a successful and unsuccessful trip, and clear definitions of drug-related terms.<br />\nAvailable at your bookstore<br />\n<br />\nPrinceton<br />\nUniversity Press<br />\nPrinceton, N. J. 08540<br />\n<br />\nAVAILABLE AT:<br />\n<br />\nTHE JOhNS HOPKINS<br />\nBOOK CENTER<br />\nGilman Hall<br />\n<br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY 1. FOLD<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nWaverly Laundromat<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br />\n<br />\nJOHN P. NUGENT, JR,<br />\nLife & Health<br />\nInsurance<br />\nCompare<br />\n<br />\n243-7961<br />\n<br />\nWhich Johns Hopkins man is a decision-maker at General Electric?<br />\n(They all are)<br />\nLaddie L. Stahl, MS, '50, joined<br />\nGeneral Electric in 1954 as Manager<br />\nof Product Planning and Market Research for the Missile and Space<br />\nDivision. Today he heads the Research and Development Application<br />\nService at the General Electric R&D<br />\nCenter.<br />\nDecision-maker? You bet! But<br />\nevery Johns Hopkins grad gets his<br />\nshare of responsibility at General<br />\nElectric.<br />\n<br />\nTake Bob Anderson, '60, an<br />\nEconomic Specialist at the Large<br />\nSteam Turbine and Generator Department. He helps evaluate the financial end of some of the Company's major manufacturing projects.<br />\nAnd Nuclear Physicist Joe Gotwals, '63, is involved in testing and<br />\ndesign analysis of submarine nuclear reactors at the Knolls Atomic<br />\nPower Laboratory in Schenectady,<br />\nNew York.<br />\n<br />\nGENERAL<br />\n<br />\nELECTRIC<br />\n<br />\nA - Equal Opportunity Employer<br />\n<br />\nResponsibility and decisionmaking come early at General Electric. We're growing so fast and in<br />\nso many challenging areas, that<br />\nthere's no waiting for the big opportunities.<br />\nHow about you? Do you have<br />\nwhat it takes to make important<br />\ndecisions for General Electric? If<br />\nyou think you do, talk to the General<br />\nElectric recruiter when he's on<br />\ncampus.<br />\n910-00<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\n• PAGE TEN<br />\n<br />\nHopkins Finds Heaps'Home<br />\nThe University has purchased a month, with the above charges<br />\nparking garage on St. Paul Street, payable monthly in advance.<br />\nto alleviate Jove rcrowae d parking<br />\nThe garage, on 3330 St. Paul<br />\nconditions on campus.<br />\nStreet, known as the Homewood<br />\nThe garage is a multi-level, rein- garage, will provide immediate<br />\nforced concrete and brick, self- space availibility to all Hopkins<br />\nparking facility, located in the im- faculty, students and employees.<br />\nmediate vicinity of the University<br />\nOne Apartment Houses. Current<br />\nFreshman Wrestling<br />\nmonthly rates of $15.00 and<br />\nthe<br />\nfor<br />\ncontinued<br />\nbe<br />\nthose interested in freshwill<br />\nAll<br />\n$12.50<br />\nmonth of November. However, ef- man wrestling who have not<br />\nfective December 1, 1967 the ra- attended either the team's meettes for Hopkins people will be ing or practices are requested<br />\n$12.00 per month for standard to contact Coach Kyle Smith<br />\nsized cars and $10.00 per month in his office in the Athletic<br />\nfor compact cars.<br />\nCenter as soon as possible.<br />\nArrangements can be made for<br />\nmonthly rental of spaces by applyto the attendant on duty at the<br />\ngarage. Under such arrangements<br />\neach user is assigned his own space<br />\nwhich he retains from month to<br />\nPROMENADE CONCERT<br />\nThe Walters — Peabody Promenade Concert will be held on<br />\nNovember 30 at 12:30 p.m. at<br />\nthe Walters' Art Gallery. On<br />\nNovember 30 there will be a<br />\nguitar and woodwind ensemble.<br />\nThe Public is invited to browse<br />\nwhile the groups play. The<br />\ngroup is comprised of students<br />\nfrom the Peabody Institute.<br />\n<br />\nClassified<br />\nFAITH AND JUDAISM' is the topic of a free supper lecture which<br />\nwill be held this Sunday at Beth<br />\nJacob Synagogue, Park Heights<br />\nAvenue with Rabbi Joseph Scheeter. Transportation by bus is being<br />\nprovided at a cost of fifty cents<br />\nand will leave from in front of<br />\nthe Eisenhower Library at 5:30<br />\np.m. Goucher girls will also be<br />\npresent.<br />\nYAVNEH OF BALTIMORE is<br />\npresenting a lecture by Rabbi<br />\nJacob S. Green on the JEWISH<br />\nCONCEPT OF SOCIAL JUSTICE<br />\nin Levering Hall, Sunday, November 26, at 6:30p.m.<br />\n<br />\nJay's Nest<br />\nDespite these attributes, soccer has consistantly taken a back<br />\nseat to grid competition at Hopkins. This secondary position can<br />\nbe witnessed by the poor condition<br />\nof the pitch field, the limited seating capacity, and the lack of attendance at soccer contests. Like<br />\nother sports such as baseball, soccer is not noted for its quantity of<br />\npartisans, but for their fervor.<br />\nEven at Hopkins, soccer has its<br />\nenthusiastic fans, but they are few<br />\nin number.<br />\nPerhaps football is partially to<br />\nblame for this lack of support. The<br />\nscheduling of football games is<br />\nconsistently given pre-eminence<br />\nover soccer contests. Football is<br />\nalso enhanced by publication of<br />\nprinted programs, loud speaker<br />\ncoverage, and cheerleaders (after<br />\na fashion).<br />\nPitchmen Strong<br />\nThe 1967 edition of the Blue<br />\nJay pitchmen has thus far amassed<br />\na 6-4 record with impressive victories over powerful Drexel and<br />\nWestern Maryland. Coach Gary<br />\n<br />\nBy JIM SLOAN<br />\nSports Editor<br />\n<br />\nAlthough in almost every other<br />\ncountry in the world, soccer is the<br />\nnational sport; in America the emphasis is focused on football - The<br />\nspectator sport. This fact is especially evident on the professional<br />\nand collegiate levels, and Hopkins<br />\nis no exception.<br />\nThe universal appeal which soccer arouses for peoples of all nationalities certainly must have<br />\nsome relevancy to American fans.<br />\nIndeed it has, as witnessed by the<br />\nattempts.of the new professional<br />\nsoccer organizations. The facination which many fans hold for the<br />\ngame can be only partially explained. The sport Is one of continual action and perpetual motion. The substitutions are minimal, and the rules are easy to<br />\nunderstand.<br />\nBody contact is also present in<br />\nsoccer, and the game requires coordination of the entire body in<br />\nall aspects of play. Endurance, as<br />\nin lacrosse, is an important factor.<br />\n<br />\nAll Types of Subs<br />\nSnacks — Beer<br />\nOPEN TILL 1:00<br />\n7 DAYS A WEEK<br />\n<br />\nB & M SUB SHOP<br />\n31st & GUILFORD<br />\n.‘‘‘ do the tr%•<br />\n<br />\nNEW PENGUINS<br />\nIN STOCK<br />\n<br />\nor644<br />\n<br />\n...at your<br />\ncampus<br />\n!iiishookstore<br />\n<br />\nREAD Shaw's SAINT JOAN before and after the show. A<br />\nPenguin paperback exclusive.<br />\nComplete play with Shaw's<br />\nPreface. PL3. 65¢<br />\n<br />\nc Adult<br />\n<br />\nyoung<br />\n<br />\n0,-4<br />\n<br />\nfoe<br />\n<br />\nnever forget<br />\n<br />\nplo<br />\n<br />\n(and you will<br />\nalways remember)<br />\nthe fabulous<br />\nvalues at<br />\n/<br />\nTHE<br />\n<br />\n00.1st<br />\n<br />\nz<br />\n<br />\nf.<br />\n<br />\nSAMPLE<br />\nSTORE<br />\n<br />\nYe'<br />\n-<br />\n<br />\nEVERY<br />\nSPORTCOAT<br />\nIN STOCK<br />\nValues to $45.00<br />\n<br />\nfly home confirmed<br />\nfor 1/3 less . . Mail this application TODAY.<br />\nLake Central Airlines, Weir Cook Airport, Indianapolis, Indiana 46241<br />\nYes, I would like to take advantage of 1/3 savings on the first-class<br />\nfare every time I fly Lake Central—without giving up the privilege of<br />\nconfirmed reservations. I enclose $10 for the membership service<br />\ncharge for the entire year of 1968 ($5 for the balance of 1967) and<br />\nverification that I am under 22 years old. I understand that my identification card will be honored for all Lake Central flights with the<br />\nexception of flights on New Year's Day, Easter, Memorial Day, Labor<br />\nDay, Thanksgiving or Christmas, or three days prior to or following<br />\nthese holidays.<br />\n<br />\nBaltimore, Md. 21211<br />\n<br />\nN BOOKS<br />\nPENGUI<br />\nAVAILABLE AT<br />\nTHE JOHNS HOPKINS UNIV.<br />\nBOOK CENTER<br />\n•<br />\nGILMAN HALL<br />\n<br />\nSAMPLE STORE<br />\nOPEN EVERY EVENING<br />\n<br />\n• CHARC.I1 • NAC • $1000 CUB<br />\n<br />\nMAKE A DATE AND DON'T<br />\nBE LATE . . . HARRY LITTLE<br />\nIS WAITING<br />\nSubmarines • Pizza<br />\nSpaghetti • Sour II•ef<br />\n<br />\nNAME<br />\n<br />\n3300 Clipper Mill Road<br />\n<br />\n*19<br />\n3031 Greenmount Ave.<br />\nin Waverly<br />\n<br />\nYoung Adult Fare Plan Membership Application<br />\n<br />\nI enclose: ri $5.00 for balance of 1967 ri $10 for entire year of 1968<br />\nLI $15.00 for 1967 and 1968.<br />\n<br />\nPENGUIN BOOKS INC<br />\n<br />\n-CHARLES STREET<br />\nREVIEW<br />\nThe Charles Street Review,<br />\nunder new leadership, is in the<br />\nprocess of being revitalized. The<br />\nsleeping carcass is expected to<br />\nbe reborn, in expanded form,<br />\nsometime after semester break.<br />\nIn order to be resuscitated to<br />\nthe healthy life it once had, it<br />\nneeds photographs and prose<br />\nand poetry and music discussion and ideas. Please give your<br />\ntime, at least, to a worthwhile<br />\nendeavor, to a child on its<br />\nknees. Please give your name<br />\nand work to Box 42, or find<br />\nJohn Moorheadin Levering Hall.<br />\n<br />\nYl<br />\n<br />\nTHE CITY OF MAN. W. Warren Wagar. Examines the possibility of<br />\na world civilization as the solution to the twentieth century's political and spiritual crisis. A931. $1.65<br />\n<br />\nSEE Shaw's SAINT JOAN—<br />\nwith Maurice Evans,<br />\nTheodore Bikel, Raymond<br />\nMassey, Roddy McDowall<br />\nand Genevieve Bujold—on<br />\nTV, Monday evening, December 4th. Check local<br />\nlistings for time and<br />\nchannel.<br />\n<br />\nBACHUR BOOTS - Soccer cocaptain Wes Bachur lines up for<br />\na shot on goal in last Tuesday's<br />\nbout against Western Maryland.<br />\nJays won 2-1.<br />\n<br />\nELEPHANTS<br />\n<br />\nURBAN CHOICES: THE CITY AND ITS CRITICS. Roger Starr. A<br />\ntimely and probing review of America's urban problehis and their<br />\npossible solutions. Covers housing, unemployment, racial tensions, poverty, architectural planning, air and water pollution, and<br />\nurban politics. A951. $1.45<br />\n<br />\nENGELS: SELECTED WRITINGS. Edited by W. 0. Henderson. A<br />\nnew and wide selection from articles and correspondence, revealing Engels as economist, historian, philosopher, and military critic.<br />\nA729. $1.95<br />\n<br />\nr.<br />\n<br />\njJPIc by ToM.Fahinan<br />\n<br />\n•<br />\n<br />\nvrtk<br />\n<br />\nLATIN AMERICAN WRITING TODAY. Edited by J. M. Cohen. The<br />\nlatest volume in this new series offers prose and poetry by writers<br />\nfrom Argentina, Brazil, Chile, Colombia, Cuba, Mexico, Peru and<br />\nUruguay. All works are presented in English. 2490. $1.25<br />\n<br />\n,<br />\n<br />\n140,<br />\n<br />\nHARRY LITTLE<br />\n<br />\nSIGNATURE<br />\n<br />\nZIP<br />\n<br />\nSTATE<br />\n<br />\nWEIGHT<br />\n<br />\nHEIGHT<br />\n<br />\nDATE OF BIRTH<br />\nCOLOR EYES<br />\n<br />\nLAKE CENTRAL<br />\nthe<br />\nft<br />\nNo.,<br />\n<br />\nCARRY OUT SHOPS<br />\n<br />\nCITY'<br />\n<br />\nADDRESS<br />\n<br />\nCGLL,R<br />\n<br />\n_<br />\n<br />\n32nd Near Greenmount<br />\n25th Near Greenmount<br />\nYork Road & Regester Ave.<br />\n<br />\nairline with a heart<br />\n* * * * 'A' * *<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nHarriers Wind Up Mediocre Season<br />\nBy RICH HOLLANDER<br />\nThe varsity cross country warriors wrapped up their dual and invitational meet season last week<br />\nat Gettysburg and Gallaudet with<br />\na mediocre 3 and 7 record.<br />\nThe season however has not<br />\nbeen as dismal as the standings<br />\nwould indicate. Last Saturday they<br />\nventured to the Gallaudet Invitational in Washington. Despite the<br />\nloss of one participant, the Jays<br />\nran gamely,- and came in fifth<br />\namong the nine teams entered. The<br />\npathetic thing was that the second<br />\nplace team was a mere 18 points<br />\nahead. Still Jeff Lauren, John Wilken and Cliff Cyr were medal winners among the myriad of runners.<br />\nOnly victorious American University took more medals than Hopkins.<br />\nBitter about the muddy trails<br />\nthey encountered, the harriers excused dropping both ends of a<br />\ntriangular meet to Gettysburg and<br />\nRider. Apparently the major obstacles were their opponents, as<br />\nthey lost to Gettysburg 24 to 33<br />\nand to Rider 26 to 29. As usual<br />\nLauren led the pack with a third<br />\nclocking in 28:29. Captain Cyr<br />\nskirted in at seventh place. Probably the most encouraging sign<br />\n<br />\nthe return of injured John<br />\nMcKeon, who took fourteenth<br />\nplace.<br />\nFour days earlier Jeff Lauren<br />\nfell victim to a cramp, and with<br />\nhim crumbled the Jay's fortunes<br />\nin a 20 to 39 drubbing at the hands<br />\nof visiting Swarthmore, John Witken and Cliff Cyr placed third and<br />\nfifth, but their comrads were un-<br />\n<br />\nable to keep pace.<br />\nThe freshmen have closed their<br />\ncampaign with a 3-2-1 mark. They<br />\nhave been quite consistent in losing to Bainbridge Prep twice, taking Towson State twice,Poly once,<br />\nand drawing even with Mount St.<br />\nJoseph. In the 25 to 30 triumph<br />\nover Poly, Matt Polk eclipsed the<br />\nfield breezing home in 13:39.<br />\n<br />\nTHEATRE HOPKINS<br />\n1967-1968 Season<br />\nStudent Season Subscriptions still<br />\navailable 5 Productions For $5.00<br />\n<br />\nTicket Office,Shriver Hall<br />\nThe Johns Hopkins University<br />\nBaltimore, Maiyland 21218<br />\n(Single per play admission $2.25)<br />\nLast season more than 700 people were<br />\nturned away in a single week-end.<br />\n<br />\nPAGE ELEVEN<br />\nVARSITY BASKETBALL SCRIMMAGES<br />\nHopkins 95<br />\nAlexandria Amateur<br />\nTeam 86<br />\nHopkins 74<br />\nSoutheastern U. 65<br />\nTonight: B.J.C., 6:30 p.m. - Away<br />\n<br />\nTuesday, November 21<br />\nMorgan State<br />\n7:00 p.m. - Away<br />\nWednesday, November 29<br />\nBaltimore U.<br />\n8:00 p.m. - Home<br />\n<br />\nPLACEMENT BUREAU ANNOUNCES<br />\nGRADUATE SCHOOL INTERVIEWS - SENIORS<br />\nFriday, November 17 - SYARCUSE UNIV LAW SCHOOL<br />\nFriday, November 17 - VILLA NOVA LAW SCHOOL<br />\nWednesday, November 29 - NORTHWESTERN UNIV<br />\nLAW SCHOOL<br />\nMonday, December 4 - UNIV OF CHICAGO BUSINESS SCHOOL<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL TO<br />\nARRANGE FOR INTERVIEWS.<br />\nGraduate students and seniors in non-science fields who are<br />\ninterested in government careers should take Federal Service<br />\nEntrance Exams early in academic year. Exams are given<br />\nmonthly through May.<br />\nAPPLICATIONS FOR ABOVE EXAMS ARE AVAILABLE IN PLACEMENT BUREAU, 100 WHITEHEAD HALL.<br />\n<br />\nB.I.A. Notes 1<br />\nATO has captured the BIA League A title. DU defeated Phi Gant<br />\n6-0 last Tuesday on a touchdown<br />\npass to Bruce Ledig for the championship in League B.<br />\nATO is slated to play DU for<br />\nthe fraternity crown, but the date<br />\nis yet to be announced. Freshman<br />\nand Upper Class Dorm competition<br />\nare not completed, however, Baker<br />\nand Wood are leading.<br />\nAD has forfeited two games<br />\nas of November 2. Therefore they<br />\nwill not be allowed to play in the<br />\nleague this year, and will not participate in BIA football next year.<br />\nA referee's clinic for basketball<br />\nwill be held Tuesday, December 5,<br />\nat 4:15p.m. in the classroom of<br />\nthe Athletic Center. Each BIA referee will receive $1.50 per game.<br />\nDave Bennett has recently been<br />\nappointed to the vacant post on<br />\nthe BIA board.<br />\nThe BIA will sponser the following winter sports: basketball,<br />\nWrestling, swimming, ping-pong.<br />\nSquash, handball, badminton,<br />\nhowling, and volleyball.<br />\ncolter opportunities<br />\nPh.D., M.S., or B.S. in:<br />\n<br />\nENGINEERING<br />\nchemical<br />\ncivil<br />\nelectrical<br />\nmechanical<br />\nmetallurgical<br />\nmining<br />\nnuclear<br />\n<br />\nEnroll in one of three exciting classes. Charger R/T,<br />\nCoronet R/T, or Dart GTSport. Each has its own distinctive sporty style, but all three have a lot in common. Like automatic transmissions, wide-tread red<br />\nline tires, special handling packages, and a long list<br />\nof other standard and optional features.<br />\n<br />\nTo add some color to campus, get your Official<br />\nDodge Scat Pack Jacket in the official \"Dodge Red\"<br />\nColor—with the<br />\nauthentic embroidered \"bumblebee\" design on<br />\nfront and back.<br />\nSend for yours<br />\ntoday.<br />\n<br />\nSCIENCE<br />\nengineering physics<br />\nhealth physics<br />\nmetallurgy<br />\nphysics<br />\nB average or above in major subjects<br />\nAEC recruiter interviewing<br />\n<br />\ncampus<br />\n<br />\nNOVEMBER 28, 1967<br />\nSee your placement officer for brochure and interview appointment<br />\nU. S. ATOMIC ENERGY<br />\nCOMMISSION<br />\nan equal opportunity employer<br />\n<br />\nWe need your head in our<br />\nbusiness<br />\n<br />\nSt Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross Loin Eddie s<br />\n<br />\nDodge Coronet R/T<br />\n<br />\nTo help you make the grade, the standard engines<br />\nfor the Scat Pack include a 340-cu.-in. V8 for the<br />\nDart GTS. And for Charger R/T and Coronet R/T, a<br />\n440 Magnum V8. Or for a more accelerated course,<br />\nyou can order the optional 426 Hemi.<br />\n<br />\nifiNik<br />\n11<br />\n<br />\n0<br />\n<br />\n.<br />\n<br />\nDodge Dart GTSport<br />\n<br />\nAll three members of the Scat Pack offer distinguishing marks at no extra cost. Bold bumblebee<br />\nstripes wrapped around the rear. Or Rallye stripes<br />\nalong the side. Or if you prefer to be a little more<br />\nmodest, no stripes at all. It's your choice. Ready for<br />\nclass? With the Scat Pack, you've got it. Why not sign<br />\nup at your nearby Dodge Dealer's and get your<br />\nBumblebee Degree, today?<br />\n<br />\nFILL OUT AND MAIL TO:<br />\nHughes-Hatcher-Suffrin, 1133 Shelby at State,<br />\nDetroit, Michigan 48226. Attn.: Mr. Gus Anton.<br />\nEnclosed is a check or money order (made payable to<br />\nHughes-Hatcher-Suffrin) for $<br />\nto cover cast of<br />\njackets at $9.95 each. Available sizes: S, M,<br />\nL, XL, XXL. (Add 4% sales tax for delivery in Michigan.)<br />\nName<br />\n<br />\nSize<br />\n<br />\nAddress<br />\n<br />\nCity<br />\n<br />\nState<br />\n<br />\nZip<br />\n<br />\n\fNEWS<br />\n<br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE TWELVE<br />\n<br />\nSP<br />\n<br />\nLETTER<br />\n<br />\nM.A.C. Champs Battle Terrors<br />\nBy MIKE PHILLIPS<br />\nAssured the Southen Division<br />\nMiddle Atlantic Conference championship - Hopkins' first such title<br />\nsince 1960 - the varsity football<br />\nteam puts its new-found reputation on the line tomorrow, when<br />\nit concludes the 1967 season by<br />\nhosting second-place M.A.C. finisher Western Maryland at 2:00<br />\np.m. •<br />\nThe Terrors, 3-1 in the league<br />\nand 5-2 overall, are quite possibly<br />\nthe strongest - and certainly the<br />\nmost opportunistic - group the<br />\nJays have faced this year. In routing Randolph-Macon, which handed Horkins its lone setback by 4822, the Westminster squad utilized<br />\nits particular abilities to the utmost,capitalizing on six pass interceptions and three fumbles to win<br />\n35-3.<br />\nKey to Western Maryland's success this season has been its defensive unit, a group that has allowed<br />\nbut 77 points in seven games(Hopkins: 87 in six) and permitted<br />\nmore than one touchdown in only<br />\ntwo of them. Standouts in this<br />\ngroup are linebacker John Heritage, middle guard Joe Anthony,<br />\ntackle Vic McTeer (who goes at<br />\n6-4 and 240 pounds). To some extent the game's outcome will hinge<br />\non the effectiveness of this contingent against Hopkins' forty-pointa-game offense.<br />\n<br />\nCridders \"Right- to Division Title<br />\nTo Be Tested by Victors<br />\nOf Randolph-Macon<br />\n<br />\nbit of an anomaly - it has averaged<br />\nover twenty points a game, yet is<br />\nunimpressive otherwise statistically (e.g. 186 yards total offense in<br />\nlast week's 15-0 defeat of Drexel),<br />\nsometimes seems overly dependent<br />\non the defense (e.g. the team's 268 conquest of Bridgewater, in<br />\nwhich it trailed in every offensive<br />\nstatistic), but is possessed of some<br />\noutstanding individuals. In quarterback Bruce Bozman (11 of 15 passes for two T.D.'s against Hopkins<br />\nlast year), a good passer, field general, and runner; and halfback Jerry Borga, a speedy power runner<br />\nwho is also the team's best pass receiver, the Terrors have two of the<br />\nbest individual performers in the<br />\nM.A.C.<br />\nReal Stakes Tomorrow<br />\nHopkins, now 5-0 in the Southern Division by virtue of last<br />\nweek's 52-6 rout of Dickinson,<br />\ncannot cede its loop leadership by<br />\nlosing to Western Maryland Saturday. What is on the line tomorrow<br />\nis its \"right\" to the Southern Division crown - the extent to which<br />\nthe championship is \"deserved.\"<br />\nWestern Maryland's lone league<br />\nloss (by 25-8) in its opener with<br />\nWagner, a power (4-0) in the generally tougher Northern Division<br />\nthe M.A.C., and its big edge<br />\nWestern Maryland's offense is a of<br />\n<br />\nagainst the one common opponent<br />\nit shares with the Jay s could establish an argument for Terror superiority only amendable to disapproval by a Hopkins win.<br />\nJay Coach Alex Sour, seemingly impressed by Western Maryland's conquest of Randolph-Macon, supported the thesis of a Terror edge. \"The Randolph-Macon<br />\ncomparative scores show we've<br />\nreally got a tough game on our<br />\nhands Saturday,\" he said. \"Western Maryland should be favored;<br />\nI don't see how it could be put any<br />\nother way.\"<br />\nEvidence Ambiguous<br />\nFor all the above, though, the<br />\navailable evidence is far from completely favoring Western Maryland.<br />\nThe Westminster club's RandolphMacon triumph came the week after that team had - aided by a soso Jay performance and some<br />\nbreaks - taken Hopkins; and Randolph-Macon which hardly played<br />\nas well as it had the week before,<br />\nmay have been complacent after<br />\nthat victory. In both ball games<br />\nthe offensive statistics of the opposed teams were fairly equal. All<br />\nin all, tomorrow's game would<br />\nseem fairly close to a tossup; and in this writer's view - the edge goes<br />\nto Hopkins.<br />\nThe course of last Saturday's<br />\n52-6 Jay win over Dickinson can<br />\nbe fairly well outlined in terms of<br />\n(Continued on Page 9)<br />\n<br />\nHopkins Kickers Win<br />\nTwo Straight Matches<br />\nBy BOB HYAMS<br />\nThe varsity soccer team captured their sixth victory of the season<br />\nlast Tuesday as they defeated a<br />\npowerful but ineffective Western<br />\nMaryland squad by 2-1.<br />\nWestern Maryland scored in the<br />\nsecond period, but the Jays tied<br />\nthe score 1-1 as Wes Bachur scored<br />\nwith an assist from Roger Purdon.<br />\nThe winning goal was scored by<br />\nRandy Miller on a penalty kick in<br />\nthe third quarter.<br />\nOn Veteran's Day, November<br />\n11, for the first time. in twenty<br />\nyears, the Jays beat Drexel by a<br />\nscore of 3-1. Drexel had earlier<br />\nbeaten Middle Atlantic Conference<br />\npower Haverford 3-0 and had tied<br />\nPenn, 2-2.<br />\nThe Jay's initial goal was scored<br />\nin the first period by Dave Roberts with an assist from Art Guerin.<br />\nThere was no further scoring until<br />\n<br />\nthe fourth period. Bill Nhari tallied<br />\nDrexel's lone goal, while Ken Niman had an unassisted goal, and<br />\nArt Guerin scored with an assist<br />\nfrom Greg Sarav.<br />\nTuesday's win was Hopkins'<br />\nthird in a row, their fourth in the<br />\nlast five, and fifth in the last seven<br />\ngames. The team's overall record is<br />\n6-4, 5-2 in the Middle Atlantic<br />\nConference, and 3-2 in the MasonDixon Conference. The Jays are<br />\ntied for third place in the Northern Division of the Mason-Dixon<br />\nConference.<br />\nThe season's finale will be enacted on Saturday, November 18,<br />\nat 11:00 a.m. at Homewood. They<br />\nwill host Dickinson, whose Conference record is 6-2-2, compared to<br />\nHopkins'5-2. This game will determine third place in the Southern<br />\nDivision of the Middle Atlantic<br />\nConference.<br />\n<br />\nOnce again the screen<br />\nexplodes with rage and passion<br />\nand greatness!<br />\n\"A LUSTY, BOLDLY PROVOCATIVE FILM\" LIFE Magazine<br />\n<br />\n13uirroCHAI<br />\n<br />\nR<br />\n0tfoRI PETER<br />\n<br />\nas Becket<br />\n<br />\nas His King<br />\n<br />\no you buy<br />\nashirt<br />\noralabel?<br />\nYou buy both, if you're<br />\nsmart. Because a good label<br />\nmeans a good shirt. A shirt<br />\nthat's styled to last. With<br />\nrolls, pleats and tapers in<br />\nthe right places. And a wide<br />\nenough selection of colors so<br />\nyou don't have to buy the<br />\n<br />\nsame shade twice.<br />\nThis Arrow \"Cum Laude\"<br />\nOxford has all the things a<br />\ngood label means. Buttondown roll collar with a soft<br />\nflare. Tapered waist.<br />\nPerma-lron so it won't<br />\n<br />\nwrinkle.'Sanforized -Plus.\"<br />\nAnd it comes in blue, pinks,<br />\nstripes, etc., etc., for $7.00.<br />\nSo, if you want a good<br />\nshirt, look for a good label.<br />\nAnd if you want the best<br />\nlabel, buy a shirt made<br />\nby Arrow.<br />\n<br />\nwaH JOHN GIELGUD- DONALD VOLHT MARIO MUNI- PAMELA BROWN<br />\nDIRECTED BY<br />\n<br />\nBIEDMRD AMU<br />\nPETER GLENVILLE<br />\nHAN ANOUILII<br />\nSCREENPLAY<br />\n<br />\nBASED ON THE PLAY 'BECKET' BY<br />\n<br />\nSCHEDULPIA<br />\n<br />\nPERFORMANCES<br />\n<br />\n10<br />\n1-sem/E041 1VE 7— 19561<br />\n/North at Charles<br />\n<br />\nat 2, 5:15, 8:30<br />\n<br />\nNO SEATS RESERVED<br />\n<br />\ndneing I CI 2 — 2256i<br />\n<br />\nin yorkridgeshp.ctr:<br />\n1 mile North of Beltway<br />\nLutherville Exit 26<br />\n<br />\nfiRZN<br />\n<br />\nEvery Ticket Holder Guaranteed A Seat<br />\n<br />\n\f", "format": "basic_html", "processed": "Weekend Weather Watch:<br /><br />\nCold temperatures,<br />\nchance of flurries.<br />\nTonight will be dark.<br /><br />\n'News ?Eater<br /><br />\nVOL. LXXII, No. 8<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, NOVEMBER 17. 1967<br /><br />\nUniversity Waiting For S.C.<br />\nBefore Deciding Vic's Case<br />\nRoss Jones, Secretary of the University, says that the<br />\nHopkins is waiting to speak with the Student Council<br />\nbefore issuing a policy statement on the alledged discrimination at the Marylander Barber Shop.<br />\nJones said that he had \"tried to contact Bruce Ledig,\"<br />\nStudent Council President. \"If Ledig would ever respond<br />\nto me I would ask him and Victor Dates to go to the •<br />\nshop and see what the situation is.\"<br />\nLast year the Student Council took part in the barber shop discrimination case. Therefore, Jones wants to<br />\nbe sure that the Council is satisfied before he makes a<br />\nformal public statement.<br />\n\"Really,\" he said, \"there is no problem. According to<br />\nwhat I've been able to determine, he is not chargine prices<br />\nwhich tend to keep Negroes out of the shop.\" However,<br />\nhe wants Ledig to go and talk with Victor the barber. If<br />\nthe Council is satisfied that there has been no discrimination, the University will issue a public statement.<br />\nThe controversy was sparked by a sign in the shop<br />\nwhich advised that \"kinky\" hair could not be cut for less<br />\nthan three dollars. Regular haircuts cost two dollars. The<br />\nsign was recently removed, when Victor DeRuggiero,<br />\nproprietor of the shop, heard that the University objected. Razor cuts for Negroes now cost three dollars while<br />\na regular hair cut costs two dollars for anyone.<br />\nVictor says that the price hike for Negroes is due to<br />\nthe fact that their hair is harder to cut than is Caucasians' hair. He insists that he is not descriminatory.<br />\n\"Victor welcomes everyone!\" says Victor. He added that<br />\nhe had never had a Negro ask for a razor cut in his shop,<br />\nand therefore, had never charged three dollars.<br />\nArnold Rausenberger, a barber in the Levering Hall<br />\nshop, said that cutting Negroes' hair presented no special<br />\nproblems. He added that he couldn't understand why<br />\nVictor would charge extra for a razor cut of curly hair.<br />\nLedig said that the Student Council probably would<br />\ndo something about the barber shop incident. As yet,<br />\nhowever, he was not familiar with the facts. \"What has<br />\ngone on around there?\" he asked.<br /><br />\nFreshmen Descend To New Depths<br />\nAs Liquor Flows In Carrel Party<br />\nBy DICK CRAMER<br />\nThe administration has decided to take an unequivocal stand in regard to a party thrown in the study carrels<br />\nbeneath the freshmen dormitories.<br />\nSome freshman decided that the newly opened study<br />\nroom would be the perfect site for a small party. As the<br />\nroom can be entered only with the use of a room key<br />\nand since not many dormitory residents study on Saturday, they had no fear of being disturbed. Therefore, they<br />\nstocked the room and gave it a small house-warming.<br />\nThe room has been adequately soundproofed and the<br />\nparty was never discovered. The girls in attendance, of<br />\ncourse, left before one o'clock and the gathering was<br />\nended without incident. However, no one was overcautious about leaving traces behind.<br />\nThe next day, beer bottles and cans were found<br />\nstrewn about the rdom. One of the frosted glass partitions which separate the carrels was smashed. The administration swung into action with a concentrated investigatory program.<br />\nMrs. Van Norman, upon hearing the news, embarked<br />\non a tour of the disaster area. Later in the day, Robert<br />\nP. Bilgrave, Director of Student Affairs, was seen inspecting the premises.<br />\nMrs. Van Norman commented, \"It's a very unusual<br />\nplace for this to happen. Most people are looking for a<br />\nquiet place to study.\" As yet, she has taken no definitive<br />\n• action. According to her, it is not within her province to<br />\ndo so. \"It's the responsibility of the D.S.R.C. and the<br />\nPlant Manager's Office,\" she said. \"I really have very<br />\nlittle to do with it.\"<br />\nMr. Wesley Taylor, Plant Manager, said that, as yet, he<br />\nhas \"not talked to anyone about it.\" He added that the<br />\nmatter was the responsibility of Mrs. Van Norman and<br />\nand the D.S.R.C.<br />\nHenry Yang, President of the D.S.R.C. said, \"I<br />\nreally don't know too much about it.\" When asked under<br />\nwhose jurisdiction the incident fell, he replied, \"It's<br />\nreally only the responsibility of the D.S.R.C.\"<br />\nColonel Robert Serena, Head Resident Dorm Master,<br />\nminced no words on the incident. \"See Mr. Bilgrave,\" he<br />\nsaid. \"He's handling it\". Mr. Bilgrave could not be reached for comment.<br /><br />\nVietnam War Threatens Cutbacks<br />\nIn Government Grants To Hopkins<br />\nBy BOB SLOAN<br />\nEDITOR'S NOTE: This is the second of a series concerning the financial shortages at Hopkins.<br />\nCutbacks in Federal spending for higher education due<br />\nto the Vietnam War threaten to aggravate Hopkins' financial problem.<br />\nGovernment funds to Hopkins, which made up 52%<br />\nof the current revenues for 1966-67, may be substantially reduced in the near future if the freeze on federal<br />\naid continues. A primary cause of the freeze is the enormous cost of the war in Vietnam. Smaller, lower-rated<br />\nschools have already felt the effects of the cutbacks, but<br />\nHopkins as yet has only felt the pinch slightly.<br />\nHowever, if the war drags on the shortage of funds<br />\ngoing to Hopkins will be acute. If replacement funds cannot be found the University \"will have no other choice\"<br />\nthan to make cutbacks says Bruce J. Partridge, VicePresident for the Administration. He added that because<br />\ngovernment money makes up so large a portion of the<br />\nbudget, this contraction will be the only solution.<br />\nThough Government money goes for government<br />\nprojects, the funds result in a portion of professorial<br />\nsalaries, the addition of graduate students, and the purchase of equipment for research. These side benefits of<br />\nthe federal funds for individual research add substantially<br />\nto the resources of the University.<br />\nWhen a professor applies for a grant to do individual<br />\nresearch, the request must first be approved by the<br />\nUniversity with respect to its cost and the number of<br />\nhours involved. If the University approves the project,<br />\nthe request goes to the government board kir approval.<br />\nIf, for example, the professor will spend half his time<br />\nfor research, the government will pay half of his normal<br />\nsalary. Graduate students are hired and the cost they incur is shared by the University and government; the same<br />\nholds for purchased equipment.<br /><br />\nOn the Inside:<br />\nWe pay a special tribute<br />\nto our capitalist sponsors.<br />\nSee all pages.<br /><br />\n72ND YEAR<br /><br />\nHousemaster's Report Scores<br />\nFood Service Administration<br /><br />\n(Continued on Page 2)<br /><br />\nDoyle Smith; a dormitory housemaster, submitted a<br />\nreport two weeks ago, highly critical of the administration of the food service.<br />\nThe report, submitted to Howard LaShaw, director of<br />\nthe dormitory Food Service, concluded that the Food<br />\nService \"should be run on a cash basis.\" Smith stated<br />\nthat \"the only way to cut out the flab\" is to run the<br />\nFood Service on a competitive basis.<br />\nSmith surveyed dormitory residents in order to compile his report. The report was initiated by request of the<br />\nPlant Manager's Office.<br />\nThe report criticized the time scheduling of the cafeteria, as well as the machinery involved in the operation<br />\nof the food service.<br />\nA particular target of Smith's report was a \"young<br />\nundergraduate\" employed by the cafeteria. Besides being<br />\n\"unclean, flippant and generally incompetent\" as Smith<br />\nimplied that most of the student help were, he distastefully noticed the undergraduate's habit of \"picking his<br />\nnose and running his fingers through his hair and then<br />\nserving you.\"<br />\nIn the survey which Smith conducted, 27 floors in the<br />\nFreshman houses were polled. Some \"novelties\" which<br />\nSmith discovered in reviewing the complaints included a<br />\nfreshman finding a fly \"cooked into his roll.\"<br />\nFour floors of freshman complained about finding<br />\nhair in their food. Ten floors noted the quantity of dirty<br />\ndishes. While there was unanimous sentiment that food<br />\nin the cafeteria was poor, twelve floors of freshman indicated that they just couldn't get enough of it.<br />\nSmith concluded that \"the administration must come<br />\nto grips with the food problem, and it is their responsibility to do whatever is needed to repair defects in the<br />\nFood Service. The handicap of budgets is the Plant Manager's office doing, not the students.\"<br />\nSmith stated that \"it should be made clear that we expect action, prompt and decisive actions.\"<br /><br />\nHopkins Leads In The Developing<br />\nOf New Drug To Treat Blood Clots<br /><br />\nHieronimous Exhibit Provokes<br />\nCharges Of Religious Blasphemy<br /><br />\nDr. Henry Wagner and Dr. Donald Tow, researchers at<br />\nthe Johns Hopkins School of Medicine, will be among<br />\nthe leading participants in the test of urokinase, a new<br />\ndrug for the effective treatment of arterial thrombosis.<br />\nUrokinase,so named because it is derived from human<br />\nurine, is not designed for the prevention of arterial<br />\nthrombosis, but instead it will be used to dissolve clots<br />\nin the arteries.<br />\nBoth Dr. Wagner and Dr. Tow hope that this drug will<br />\nbe effective in the correction of such medical disorders<br />\nas pulmonary embolism and mycardal infarctions.<br />\nUrokinase will enable doctors to dissolve blood clots<br />\nin a matter of hours, a process which presently takes up<br />\nto three weeks With present treatment patients often<br />\ndie or are seriously disabled.<br />\nNeither Hopkins' doctors have spent all their time on<br />\nurine. Working concurrently they have developed an<br />\n\"isotope scanning system,\" which allows them to see<br />\nwhat affect the drug is having. This technique promises<br />\nmany other possibilities, yet to be examined.<br />\nUrokinase likewise enables the development of new<br />\ntechniques in blood transfusion. \"In fact,\" states Dr.<br />\nTibor Greenwalt, medical director of the American<br />\nNational Red Cross,\"it is now old-fashioned to use whole<br />\nblood for transfusions.\"<br />\nHe added that it is now possible to take only the<br />\nplasma from the blood and return the remaining components of the blood to the body. This technique will aid<br />\nin alleviating the problem caused by a shortage' of available blood in today's hospitals.<br />\nIn practice, this means that as much as one liter ot<br />\nplasma a week could be removed from a healthy donor<br />\nwithout any ill effects.<br />\nThis ability to transfuse large quantities of blood<br />\nmeans that parents of a child suffering from leukemia<br />\nmight \"donate just the platelets in their blood up to two<br />\nor three times a week.\"<br />\nPlatelet transfusions are used to control bleeding in<br />\nleukemia.<br />\nUrokinase and other new techniques for the treatment of blood disorders, were outlined by the panel of<br />\nexperts during the briefing of\"New Horizons in Science<br />\nsponsored by the Washington University in St. Louis<br />\nand The Council for the Advancement of Science Writing.<br /><br />\nby DENNIS ESTIS<br />\nSeveral persons, including faculty wives, have charged<br />\nthat the art exhibit of Robert Hieronimus, 'currently<br />\nbeing shown at Levering Hall, is \"irreverent\".<br />\nThose people, both in the Hopkins community and in<br />\nthe City, have been shocked by the artists' portrayal of<br />\nof the Christ figure and several other symbols which he<br />\nemploys.<br />\nDr. Chester Wickwire, Director of Levering Hall, expressed the opinion that these charges were minor in<br />\nnature. Dr. Wickwire felt that the comments made were<br />\ntypical reactions one \"might expect from persons not<br />\naccustomed to this kind of art\".<br />\n\"Hieronimus is hot attempting to be irreverent,\" said<br />\nWickwire, \"but he feels that America, and not himself,<br />\nhas desecrated these symbols.\"<br />\nIn reply to the charges. Hieronimus said that he also<br />\nhad some complaints. He placed the primary blame on<br />\nthe present leaders of our nation in every field of endeavor, including religion. \"Our religious leaders have not<br />\nlistened to the needs of the generation. The symbols are<br />\nnot a slap at all. Man needs God, but not in a traditional<br />\nsense.\"<br />\nDr. Wickwire feels that the exhibit is \"very worthwhile\", and believes that it has \"livened things up.\"<br />\nThe exhibit features a sculpture of a dummy which is<br />\ncrucified on a wooden cross. The dummy is decorated<br />\nwith symbols of American materialism such as Coke buttons,and dollar signs. The exhibit also includes paintings,<br />\npen drawings, and a sculpture which revolves on a turntable.<br />\nHieronimus is also involved in other activities. He goes<br />\nto the Maryland Institute and used to teach in public<br />\nschools in Baltimore County. He painted the front of<br />\nthe new Black Jack night club on Lafayette Avenue,and<br />\nhe spends his spare time painting bodies on Howard<br />\nStreet. He is most noted on campus for his multicolored<br />\n\"symbolic Volkswagen\" and his poster advertising the<br />\n\"Mothers of Invention\" concert.<br />\nMany of the works on display at the exhibit can be<br />\npurchased from the author at a nominal fee. There are<br />\ncertain paintings which cost as much as $1000.<br />\nImmediately at the close of the Hieronimus show,an<br />\nexhibit of ceramic pieces will be displayed, along with<br />\nworks by Mrs. Raya Bueding.<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1%7<br /><br />\nNEWS-LETTER<br /><br />\nPAGE TWO<br /><br />\nWhat kind do you smoke?<br />\nWiliam,<br />\na<br /><br />\n7rivarden<br />\n1111101.Clturc<br /><br />\nMONZA<br /><br />\nWhatever kind you smoke,<br />\nyou owe it to yourself to<br />\ntry MONZA Pipe Tobacco.<br />\nYour favorite pipe will give<br />\nyou more pleasure when<br />\nou choose this imported<br />\nblend of the world's fine<br />\ntobaccos.<br /><br />\nmove up to<br /><br />\nPIPE TOSACCO<br /><br />\nt Cutbacks<br />\nVietnam War Threatens Gran<br />\npay the full professor's salary.<br /><br />\nThe promise of government aid<br />\nmany very capable, and well<br />\nlures<br />\nHowever, funds may be cut<br />\nto campuses which<br />\nprofessors<br />\npaid<br />\ngraduate<br />\nthe<br />\nhappens,<br />\nback. If this<br />\naid. Such is the<br />\nfederal<br />\nthe<br />\nget<br />\ncan<br />\nstudents are fired because there is<br />\nwhen funds<br />\nThus,<br />\nat<br />\nHopkins.<br />\ncase<br />\nequipdo,<br />\nto<br />\nthem<br />\nno work for<br />\nUniverthe<br />\nthere,<br />\nno<br />\nlonger<br />\nare<br />\nment is not purchased because<br />\nthe<br />\nup<br />\nwith<br />\ncome<br />\nto<br />\nhave<br />\nwill<br />\nsity<br />\nit<br />\nfor<br />\nneed<br />\nresearch<br />\nthere is no<br />\navailnot<br />\nare<br />\nIf<br />\nfunds<br />\nprofessor.<br />\nand the University faces the proprofessors, not unblem of paying the full salary of a able, assistant<br />\nhave to be dropped<br />\nwill<br />\nder<br />\ntenure,<br />\nprofessor for which it formerly<br />\nre-allocated to<br />\nsalaries<br />\ntheir<br />\nand<br />\nhalf.<br />\npaid<br />\nonly<br />\n(Continued from Page 1)<br /><br />\nThe Catholic Community<br />\nOn Campus<br /><br />\nar<br /><br />\nMONZA<br /><br />\nTHE IMPORTED MK TOSACCO<br />\nONLY 300 A POUCH<br />\nFor a COMPLIMENTARY pouch of MONZA PIPE TOBACCO,<br />\nsend 10t to cover postage and handling with this<br />\ncoupon to:<br />\nROMICK'S INTERNATIONAL, INC.<br />\nP.O. BOX 3033, DEPT. NO. 17<br />\nNO. HOLLYWOOD, CALIF. 91606<br /><br />\nMASS SCHEDULE:<br />\nSUNDAYS: 10:30 A.M. in Levering<br />\nGreat Hall (\"Folk Mass\")<br /><br />\nFRIDAYS: 12:00 Noon in Levering Hall<br />\nChapel<br /><br />\n(Please Print)<br />\nName<br />\nCity<br /><br />\nStreet<br /><br />\nDue to the Thanksgiving Holidays there<br />\nwill be no Mass in Levering on Friday, Nov.<br />\n24th or on Sunday Nov. 26th.<br /><br />\nZip<br /><br />\nState<br />\nA<br /><br />\nENS MINI 111111 111111M MEI ANS EM 11•1111 11111E<br /><br />\nThus, when the Vietnam war<br />\nsaps government educational aid,<br />\nthe subsequent contraction of the<br />\nUniversity will mean the firing of<br />\nprofessors in a school which is already, according to department<br />\nheads, understaffed, as well as cutting back in other areas of University operations.<br />\nContraction of a University al.<br />\nready considered too small is regrettable. \"We may have hard<br />\ntimes,\" states Partridge, \"but we<br />\nwill just have to do some belt<br />\ntightening,\" Partridge says that the<br />\nfinancial problem is nothing new<br />\nfor Hopkins. There has always<br />\nbeen the problem of determining,<br />\nexpenditures on the basis of available funds, and the University is<br />\nconstantly searching for new sources of money. At the present, says<br />\nPartridge, all sources are being<br />\nexploited.<br />\n\"The faculty must be educated<br />\nto the workings of financial operations at Hopkins,\" Partridge believes.<br />\n\"In a University, finance is never a question of spend or not<br />\nspend, do or don't; it is a question, rather, of the assignment of<br />\npriorities,\" he continued. Hopkins<br />\nhas a stable source of income,<br />\nsources of income which may lose<br />\na substantial portion of their<br />\ngest donor.<br /><br />\nNM NMI<br /><br />\n111111111<br /><br />\nCalling all<br /><br />\n24-page brochure has facts<br />\nand figures to help you see<br />\nBritain on a student budget<br /><br />\nsOdents<br />\nvisiting<br />\nbritain<br /><br />\nHow to travel 1000 miles by<br />\ntrain and boat for only $30.<br />\n100 places to get a single room<br />\nfor $4 a night, breakfast<br />\nincluded—dormitory space<br />\ncosts less.<br />\nBicycle rentals for $2.80 a<br />\nweek.<br />\nDiscotheques, folk singing, jazz<br />\nclubs and boutiques.<br />\nSeason ticket to 900 stately<br />\nhomes, castles and historic<br />\nsights for $3.<br />\nWhere to get lunch or dinner<br />\nfor $1.<br />\nHow to choose your<br />\ntransportation to Britain.<br />\nSpecial student programs<br />\nstarting a $655, including fa,e<br />\nand tour, but excluding cost of<br />\nfree time.<br />\nTravel-study programs, work<br />\ncamps,summer schools.<br />\nLondon theatres, balcony seats<br />\n$1.40—some gallery seats 700.<br /><br />\nBritish Travel<br />\nBox 923, New York, N.Y. 10019<br />\nPlease send me your free 24-page brochure \"Students Visiting Britain.\"<br />\nName<br /><br />\nCLOTHES<br />\nHORSES!<br />\ncheck the<br />\nquality and<br />\nvalue at<br />\nTHE<br /><br />\nSAMPLE<br />\nSTORE<br />\nEVERY SUIT<br />\nIN OUR STOCK<br />\nValues to<br />\n$65.00<br /><br />\n*29<br /><br />\n40*<br /><br />\nSAMPLE STORE<br />\n3031 Greenmount Ave.<br />\nin Waverly<br />\nOPEN EVERY EVENING<br />\ni• CHARC-11 • MC • $1000<br /><br />\nCIIM<br /><br />\ncareer opportur,lies in<br /><br />\nMANAGEMENT<br /><br />\nACCOUNTING<br /><br />\nBachelor's or master's degree in<br />\naccounting<br />\nMaster's degree in:<br />\nbusiness administration<br />\npublic administration<br />\nindustrial management<br />\nfinance<br />\neconomics<br />\npersonnel management<br />\nliberal arts<br />\nB average or above in major subjects<br /><br />\nCollege<br />\nAEC<br /><br />\nrecruiter interviewing<br /><br />\nOil (am pus<br /><br />\nAddress<br />\nCity<br /><br />\nState<br /><br />\nMINI MIN MIMI MIN 1E111 M11111 1E1111 NEI 1111M1 MINN<br /><br />\nZip<br />\nNMI MIMI NMI 1111<br /><br />\nSee your placement officer for brochure and interview appointment<br />\nU.S. ATOMIC ENERGY<br />\nCOMMISSION<br />\nan equal opportypity employer<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17. I 967<br /><br />\nNFWS-LETTER<br /><br />\nPAGE TI I REE<br />\n0<br /><br />\nI CAMPUS NOTES<br />\nHELIO - ECCENTRICITY<br />\nProfessor Edward Rosen, Professor of History of Science at<br />\nCCNY,will present five lectures on<br />\n\"The Physical World from Copernicus to Kepler.\" The first lecture<br />\nwill be on Copernicus, November<br />\n29, 2 p.m., in the Garrett Room<br />\nof the Eisenhower Library.<br />\nPROFITEERING<br />\nThe Vector will be distributed<br />\non Tuesday, November 21. Due to<br />\nprohibitive printing costs, free distribution will only be available to<br />\nundergraduates. Graduate students<br />\nand faculty will be asked to cough<br />\nup 25¢. Contributions are solicited<br />\namong students and faculty. All<br />\ncorrespondence should be addressed to VECTOR,Box 1105.<br />\nPLAGUE YOUR PROF<br />\nThe Course Guide will be published this semester, under new<br />\neditorship, with Student Council<br />\nfinancial backing. The new questionaire will have an essay format.<br />\nEssay answers will allow students<br />\nto be more specific about courses<br />\nand professors. (If you're concerned about your mark, inform<br />\nyour prof about this innovation<br />\nand your potential use of it). The<br />\nquestionaires will be in mailboxes<br />\nafter Thanksgiving.<br />\nSING ALONG WITH BONAZZI<br />\nThe Baltimore Choral Arts Society is presenting Elaine Bonazzi,<br />\nat Goucher's Kraushaar Auditorium, on December 17, 8:30 p.m.<br />\nBonazzi, who records for Columbia, will sing Bach's Christmas Oratorio. Tickets are $4, and may be<br />\nobtained from the Society at 4<br />\nEast University Parkway.<br /><br />\nCarnegie-Mellon University,. Head<br />\nof the Department of Computer<br />\nScience, will speak on \"What Does<br />\nit Mean to Converse with a Computer?\" Dr. Perlis may be late since<br />\nhis computer has been nagging him<br />\nto death.<br />\nLEAVE BALTIMORE? AWW<br />\nThere will be a chartered Greyhound Bus to New York City for<br />\nThanksgiving Vacation. It leaves<br />\nLevering Hall at 2 p.m., on Wednesday, November 22. The bus will<br />\nreturn on Sunday, leaving Port<br /><br />\nAuthority at 7 p.m. Round trip<br />\nfare is $9.50. Contact Eric Herzog,<br />\nBox 1001 or call 235-2371. Our<br />\nsympathies to all floppies who<br />\nbrave the annual ten hour Sunday<br />\nride down the Jersey Turnpike.<br />\nBEARING ALONG WITH SEX<br />\nRichard F. Hettlinger,author ot<br />\nLiving with Sex: The Student's<br />\nDilemma, will present a Jeffery<br />\nlecture on \"Living with Sex,\"<br />\nNoveinber 21,4 p.m., in the Great<br />\nHall of Levering. Children under<br />\n18 will not be admitted without<br />\nan adult.<br /><br />\nStand fast<br />\nin Bass Weejuns!<br />\nRide it out ... wait for Bass Weejuns® moccasins<br />\nat your nearby college store or shoe shop.<br />\nOnly Bass makes Weejuns.<br />\nMain St.,<br />\nG. H. Bass &amp; Co.,<br />\nWilton, Maine 04294.<br /><br />\nHopkins students, new and old, try:<br /><br />\nPecora's Restaurant<br /><br />\nSias<br /><br />\nfor the finest Italian food in town<br /><br />\n3320 Greenmount Ave.<br />\nSPAGHETTI MEALS<br />\nPIZZA PIE A SPECIALTY<br /><br />\nCARRY OUT SERVICE<br />\nCALL 889-38w<br />\n00l31<br /><br />\nHow would you fit into Du Pont's Project X?<br /><br />\nMEANWHILE,BACH AT THE . . .<br />\nOn Sunday, November 19, the<br />\nGlee Clubs of Goucher,and Franklin and Marshall will present a<br />\njoint concert. Featured will be<br />\nBach's \"Magnificat in D.\" This<br />\nSunday's concert marks the second<br />\nhalf of the intercourse between<br />\nGoucher, and Franklin and Marshall Glee Clubs.<br />\nCONTEMPLATE YOUR NAVAL<br />\nDr. Gunnar P. Oilman, of the<br />\nScientific Staff at the Naval Research Lab, will be at Hopkins on<br />\nDecember 1. Join up and steal<br />\nsome secret research contracts<br />\nfrom your alma mater.<br />\nSHUT UP AND LISTEN<br />\nThe next computer seminar will<br />\nbe held Monday, November 20,<br />\n3:30 p.m., in the Auditorium of<br />\nShaffer Hall. Dr. Alan Perlis of the<br /><br />\nSTAMP IT!<br />\nIT'S THE RAGE<br /><br />\nREGULAR<br />\nMODEL<br />\nANY<br /><br />\n2<br /><br />\n3 LINE TEXT<br />\nThe finest INDESTRUCTIBLE METAL<br />\n1<br />\n2\" x<br />\nPOCKET RUBBER STAMP. /<br />\nSend check or money order. B.<br />\nsure to include your Zip Code. No<br />\npostage or handling charges. Add<br />\nsales tax.<br /><br />\nr.<br /><br />\nPrompt shipment. Satisfaction Guaranteed<br />\nTHIE MOPP CO.<br />\nP. 0. Bei 18623 Lenox Square Station<br />\nATLANTA. GA.. 30325<br /><br />\nSAV-IT<br />\niitiuORS<br />\n329 W.29th St.<br />\nTHE HOUSE OF<br />\nGOOD CHEER<br /><br />\n243-3313<br /><br />\nYou are the only person who can answer<br />\nthat question.<br />\nTo do it, you should know as much as possible about<br />\nthe 150 new plant units Du Pont has built since<br />\nthe end of World War II. You'd then choose from one of<br />\nthe many lively fields of interest at Du Pont:<br />\ndesign, construction, production, marketing, research<br />\nand process improvement (to name just a few).<br />\nInvolvement starts the day you join. There is no<br />\ntraining period. You go into responsible work right away.<br />\nYour professional development is stimulated by<br />\nreal problems and by opportunities to continue your<br />\nacademic studies under a tuition refund program.<br />\nYou work in small groups where individual<br />\ncontributions are quickly noted and appreciated.<br />\nThe work is significant, and of benefit to society.<br />\nYou're part of the most exciting technical environment<br />\navailable today and tomorrow, and facilities and<br />\nassociates are the best.<br />\nHow could you fit in? Why not sign up for a chat with<br />\na Du Pont interviewer and find out? The coupon will<br />\nalso bring you more information about us.<br />\nFinally, what is Project X?<br />\nWe don't khow yet. Could be we're OU PON T<br />\nwaiting for you to tell us.<br />\n1116. y.). PAT 011<br /><br />\nE. I. du Pont de Nemours &amp; Co. (Inc.)<br />\nNemours Building 2500-2<br />\nWilmington, Delaware 19898<br />\nPlease send me the Du Pont Magazine along with<br />\nthe other magazines I have checked below.<br />\n0 Chemical Engineers at Du Pont<br />\n0 Mechanical Engineers at Du Pont<br />\n111 Engineers at Du Pont<br />\n0 Du Pont and the College Graduate<br />\nName<br />\nClass<br /><br />\nMajor<br /><br />\nDegree expected<br /><br />\nCollege<br />\nMy address<br />\nCity<br /><br />\nState<br /><br />\nZip Code<br /><br />\nNEWS-LETTER<br /><br />\nPAGE FOUR<br /><br />\nThe Grass, Somewhere, Is Greener<br />\nIn a recent report to the Plant Manager's Office, freshman housemaster, past DSRC president and veteran dorm dweller Doyle Smith<br />\ninformed Wesley Taylor that not only was the food served in the<br />\ndormitories of exceptionally poor quality, but that organizational<br />\n_aspects of the food service's management makes dining there an unattractive and harrasing ordeal.<br />\nThe report is the most recent evidence of a growing dissatisfaction directed against the very services dorm residents hope to receive<br />\nfor the $900 each pays to the university annually. Despite the recent<br />\noutlay of money for unseen improvements, and compared to many<br />\nuniversities throughout the nation who are rapidly expanding their<br />\ndormitory facilities with new and modern structures, Hopkins students are resigned to living in two-tone cinder block cell blocks.<br />\nGranted, Hopkins cannot suddenly refurbish or build new dorms at<br />\nthe moment, but it can furnish the dormitory diner with more nutritious and attractive meals.<br />\nAmong the complaints listed in Smith's report(A compilation of<br />\nfreshman grievances) were: too much starch, too small poultry, too<br />\nlittle food, dirty utensils, no variety or choice in any one meal,<br />\ngreasy food, little fruit, hair and flies (ad nauseum) in food, badly<br />\nprepared desserts,etc., etc ...There is no excuse for these conditions<br />\nto continue. One need only go as close by as Notre Dame to see how<br />\nwell some students are able to eat.<br />\nHousemaster Smith comes to the conclusion that the food service should henceforth be run on a cash basis, which would force it<br />\nto become more competitive — that is, if better food were offered,<br />\nmore students would patronize the dining room; if a poor meal were<br />\nserved, students could eat elsewhere and only the food service would<br />\nlose out.<br />\nWe strongly recommend that the Plant Manager's Office look into<br />\nsuch a proposition by requesting bids from competing food services,<br />\nincluding the largest and most popular service, which, incidentally,<br />\nfeeds the hungry mouths at Goucher and Notre Dame. To have a dormitory with good enough food and organization to attract enough<br />\ndorm students to eat there on a cash basis would entail a considerably<br />\nlarger budget for food on the part of the Plant Manager. But the<br />\nmoney which many dorm residents now lose by missing meals breakfasts when they sleep late, lunches when they have classes, din- _<br />\nner when they are away - Or parents come to town - would perhaps make up for the more expensive meals served on a cash basis.<br />\nHow far more democratic it would be to pay for the mealswhich you<br />\nare here to eat and which you want to eat, rather than paying for the<br />\nliver you do not eat and the stone-hard cake you cannot digest.<br />\nAt a recent ODK meeting, Hopkins Plant Manager Wesley Taylor<br />\nexplained that he had once received bids from several food services,<br />\nand the present management had underbid all others. He also expressed his faith in the product it offers the dorm students at dinner<br />\ntime. Mr. Taylor is also the gentleman, reliable sources have told us,<br />\nwho recently suggested that the Kosher Dining Room lower its quality of food if it wants to lower its prices. Such a truism we do not<br />\ndispute, but we certainly hope he has not lowered the quality of<br />\nfood in the dormitory for this reason when we have been told by<br />\nDoyle Smith that students there would prefer paying slightly more if<br />\nthey could be assured of a corresponding improvement in their<br />\nmeals.<br />\nWe feel certain that if the concerned parties in the administration<br />\ndevoted their time to trying to find a more effective and appetizing<br />\nmean of feeding the dorm students rather than quieting and calming incipient food protests, then perhaps a solution to the problem<br />\ncould be found. But in case the Plant Manager is not sensitive to the<br />\nrequest of Doyle Smith and other students, then dorm residents<br />\nmay well find last year's student council president Bill Reinsch's<br />\nsuggestion the most effective - -dump an entire dinner on the steps<br />\nof Homewood House.<br /><br />\nEh, Johns nphtnø Pistaa-Ettist<br />\nEDITORS-IN-CHIEF<br />\nRoger C. Toll<br /><br />\nPeter J. Koper<br /><br />\nBUSINESS MANAGERS<br />\nJames N. Franke<br /><br />\nDavid S. Cooper<br /><br />\nTHE BOARD OF CONTROL<br />\nEXECUTIVE EDITOR<br />\nAN<br />\nAL<br />\nCHAIRM<br />\nEDITORI<br />\nJoseph Weinberg<br /><br />\nDavid Schneiderman<br /><br />\nNEWS MANAGER<br />\nDennis Estis<br /><br />\nNEWS EDITOR<br /><br />\nCOPY EDITOR<br />\nPeter Harnik<br /><br />\nBruce Drake<br /><br />\nSPORTS EDITOR<br /><br />\nGRAPHICS EDITOR<br /><br />\nJames Sloan<br /><br />\nNeil Grauer<br /><br />\nASSOCIATE EDITORS<br />\nElia Katz<br /><br />\nMurray Rudnick<br /><br />\nJed Luchow<br /><br />\nMike Phillips<br /><br />\nREPORTERS<br />\nRichard Cramer, Steven Britz, Steve Bartlett, George Gorse.<br />\nTed Rohrlich, David Hoelscher, Tom Lemm, Robert Sloan,<br />\nand Steve Shriver.<br />\nFEATURES:Michael Michaelson. Kenneth Bond, James Bennett.<br />\nTim Stocks. Baron Wormser. and Seth Feldman.<br /><br />\nNEWS:<br /><br />\nSPORTS: Richard Hollander, and Bob llyams.<br />\nGRAPHICS: Snuffy Smith<br />\nP11OTOGRAPI IY: Tom Hoffman and Frank Urrutia<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nThis Is Your Paper!<br />\nshould be the ones to make deciTo The Editors:<br />\nsions about how the educational<br />\nbe<br />\nto<br />\nis<br />\nCouncil<br />\nThe Student<br />\ncarried out.<br />\ncommended for its action in mov- process is<br />\nThe News-Letter goes.<br />\nfar<br />\nThis<br />\nrights,<br />\nof<br />\nbill<br />\nstudent<br />\na<br />\ning to draft<br />\nLetter recognizes<br />\nNewsThe<br />\nBut<br />\nand The News-Letter is to be comuniversity comthe<br />\nto<br />\nparts<br />\nthree<br />\ng<br />\nsupportin<br />\neditorial<br />\nits<br />\nfor<br />\nmended<br />\nfaculty and adstudents,<br />\nmunity:<br />\nexthis action. But it would be<br />\nindeed<br />\ntremely unfortunate if such a bill ministration. Three partsdifferent<br />\nis<br />\npart<br />\none<br />\nbut<br />\nare,<br />\nthere<br />\nn<br />\nconceptio<br />\nwere to mirror a false<br />\nserve the<br />\nof the student's role in the univer- in being there only to<br />\nin decirole<br />\nits<br />\nHence<br />\ntwo.<br />\nother<br />\nand<br />\nsociety,<br />\nin<br />\nsity community and<br />\ndifferbe<br />\nalso<br />\nshould<br />\naking<br />\nsion-m<br />\nI think there is evidence that<br />\nthe<br />\nfor<br />\nnatural<br />\nbe<br />\nwould<br />\nIt<br />\nent.<br />\nLetter<br />\nNewsand<br />\nCouncil members<br />\nalvoice,<br />\na<br />\nhave<br />\nto<br />\ntion<br />\nadministra<br />\neditorial writers share such a conor even the<br />\nonly<br />\nthe<br />\nnot<br />\nthough<br />\nception.<br />\nmatters<br />\nThe Council's action came as a predominant .voice, in<br />\ne, e.g. financompetenc<br />\nits<br />\nwithin<br />\nation<br />\nAdministr<br />\nalleged<br />\nof<br />\nresult<br />\nsuch as acasuppression of a protest against ces, but not in matters policy or<br />\nresearch<br />\nprogram,<br />\ndemic<br />\ndormithe<br />\nin<br />\nfood<br />\nof<br />\nthe quality<br />\nThe administories. The Council appears to be student discipline.<br />\nable to serve<br />\nbe<br />\nalso<br />\nshould<br />\ntration<br />\nstudent<br />\nwith<br />\nprimarily<br />\nconcerned<br />\nthe uniabout<br />\ndecisions<br />\nmaking<br />\nin<br />\nrules<br />\nfreedom to protest, parietal<br />\nto society - relates<br />\nit<br />\nas<br />\nversity<br />\nimwhile<br />\nthat,<br />\nmatters<br />\nother<br />\nand<br />\narea<br />\nportant, are peripheral to the edu- perhaps the most important this<br />\n- - but<br />\n-making<br />\ndecision<br />\nof<br />\nbill<br />\nstudent<br />\nNo<br />\nprocess.<br />\ncational<br />\nan administration<br />\nof rights will have any meaning un- would require representative of<br />\nbroadly<br />\nwas<br />\nthat<br />\nesan<br />\nas<br />\nstudent<br />\nthe<br />\ndefines<br />\nit<br />\nless<br />\nthe academic<br />\nsential (one might even sat the society as well as<br />\nmember board of<br />\nessential) participant in this pro- community;a 48for instance, be<br />\ncess. This -implies that students, trustees, could, students, eight<br />\neight<br />\nof<br />\nup<br />\nalong with the other participants, made<br />\nTo The Editors:<br />\nBlackwell's the Book Center is<br />\nnot. Until it reaches that happy estate (and the Great Pumpkin rises<br />\nfrom the Homewood patch), some<br />\nmembers of the community will<br />\nview any improvements as mere<br />\ntokenism. Meanwhile, however, responsible criticism from The<br />\nNews-Letter and other voices of<br />\noutraged literacy can help to<br />\nnudge the Book Center along toward a more effective role in the<br />\ntotal educational processs.<br />\nAlthough I recognize the tone<br />\nof slightly cracked authority, an<br />\noccupational disease, as indeed my<br />\nown, the ex cathedra statements<br />\nwhich Dick Cramer ascribed to me<br />\nin his lively article on the Book<br />\nCenter seemed to appear some-<br /><br />\nwhat out of context. Memory is<br />\nspecial pleading and protest makes<br />\nbetter copy than progress, but my<br />\nown recollection is that I prefaced<br />\nthe remark about plenty of room<br />\nfor improvement with the comment that 1967 has seen more<br />\nconstructive changes in bookish<br />\npolicy than I can remember during<br />\nthe rest -of my stay at Hopkins.<br />\n(And, I'd quickly add, not enough<br />\nchanges to satisfy the legitimate<br />\nexpectations of the students, the<br />\nfaculty, or, for the matter, the<br />\nManager.)<br />\nAs you have reminded us in the<br />\npast, The News-Letter has played<br />\nan instrumental role in provoking<br />\nsome of these changes. The homework,agitation, and suggestions of<br />\nthose students who included Book<br /><br />\nfaculty members, eight alumni,<br />\nfour representatives of each of the<br />\nfederal, state and local governments and twelve representatives<br />\nof interest groups in the community at large: labor, business, professions, the arts, civil-rights organizations and so forth. As the administration is now constituted,<br />\nhowever,such powers would clearly be unwarranted.<br />\nThis, of course is not the way<br />\npower relationships are now. And<br />\nthey are not going to become this<br />\nway by the grace of the Administration. Any student bill of rights<br />\nthat wousld be acceptable to the<br />\nAdministration would be per se an<br />\nineffective one. This does not<br />\nmean that the effort to draw up a<br />\nbill of rights should be abandoned.<br />\nRather it means that such a document should be presented as a list<br />\nof demands, demands that the students are prepared to back up with<br />\naction.<br />\nAs a guide in drawing up such a<br />\nbill, every Council member should<br />\nread the Declaration of the Canadian Student, passed last September at the Congress of the Cana(Continued on Page 5)<br /><br />\nStore reform in their political<br />\nplatforms also helped. But it would<br />\nbe Jess than fair to overtook a<br />\nnumber of others who contributed at one time or another to moving the issue from the familiar<br />\nsphere of diffuse discontent toward a number of specific actions.<br />\nMessrs. Taylor and Vayne, with<br />\nsome advice from Tony Neville<br />\nand others, had started- plans for<br />\nthe physical improvement of the<br />\nnew quarters some time before the<br />\nheadlines of last year. On balance,,<br />\nthe Center seems to me one of the<br />\nhappier privinces of the \"new Gilman Hall.\" The faculty committee<br />\nformed last year had the chance<br />\nto profit from the advice and discontent of many members of the<br />\ncommunity, including letters from<br />\n(Continued on Page 3<br /><br />\nthe dorm students, would not sup— frightened of student power, nu,<br />\nTo The Editors:<br />\nraises questions as to in principle. but because of its<br />\nRecent attacks on the Student port it. This<br />\nof a leader to pull dogmatism, conceit, and narrowobligation<br />\nthe<br />\ncomCouncil have inspired a few<br />\npolitical conscious- mindedness. At the Washington<br />\ninto<br />\npeople<br />\nthe<br />\nments of my own, as one familiar<br />\nagainst their will; March on the Pentagon the sight<br />\nness,<br />\npossibly<br />\nwith the organization.<br />\nbut a democratic system and a lack of a beautiful girl, complete with<br />\nFirst, it is to be remembered, of party cadres in this case deter- flowers, bells, etc. yelling \"Get<br />\nthat the Conncil and the president mined the decision. I would sug- him! Get him!\" as her friends atfinds itself in the dilemma of being gest that critics frequently fail to tacked someone supporting the<br />\nexpected by the students to up- consider what the Council usually war lent an element of hypocrisy<br />\nhold their views and simultaneous- takes note of, the fact that if one to the movement.<br />\nly expected by the administration is to reform the Council, one must<br />\nWhile students always seem to<br />\nto aid in propagating the official first reform the students, no easy perceive a grain of truth in an isline. Since they are the one group task.<br />\nsue, we have an equal affinity for<br />\nregularly consulted by the admincreating black and white issues<br />\nprotest<br />\non<br />\ncomment<br />\na<br />\nFinally,<br />\nistration, they by definition, bein general. Council criticism is of- out of grey ones through oversimcome members of the status quo,<br />\nI*<br />\nten directed toward the irrelevancy plification and exaggeration.<br />\nand thus most, of necessity, usualdeto<br />\nnot<br />\nthings<br />\nthese<br />\nmention<br />\nof its inquiries, with the suggestion<br />\nly work within an orthodox frame- that it give its attention to nation- fend the Council, as it was conbe<br />\nwork if they are not to snuffed<br />\nal issues of war, the draft, civil stantly a source of frustration to<br />\nout of existence by a cynical ad- rights, etc. No one explains how me during my tenure, but merely<br />\nministration even before• they the Council with limited author- to point out that the issue is a<br />\ncould be rejected by over - or unity and influence on the campus, grey one, rather than all black.<br />\nder zealous students. If led creaSincerely,<br />\nmake a national impression.<br />\ncan<br />\ntively by the representatives (and Furthermore, I tend to be rattier<br />\nPresident<br />\nex<br />\nBill<br />\nRcinsch<br />\n-Council<br />\nare<br />\nI remind everyone that these<br />\nelected by the students, who must,<br />\nwhat he thought I should do. He<br />\nthe Editors:<br />\nin the final analysis, be blamed for To<br />\nded keeping the mess to<br />\nrecommen<br />\nthe<br />\nconsidered<br />\nalways<br />\nhave<br />\nI<br />\nmistakes), the Student Council has<br />\n, when the NewsTherefore<br />\nmyself.<br />\nviran opportunity for constructive News-Letter a \"paragon of<br />\ncalled, I related<br />\nLetter<br />\n\"<br />\n\"reporter<br />\nof<br />\ntraditions<br />\nthe<br />\nin<br />\nsteeped<br />\nactivity in all areas. One should, tue,\"<br />\nhe<br />\nasked<br />\nand<br />\nme to tell<br />\nto<br />\nthis<br />\nhim<br />\nhowever, keep the odds against honesty, objectivity, impartiality, him the story anyway, \"just oat<br />\nthree<br />\nFor<br />\nns.<br />\nabstractio<br />\nrelated<br />\nthe Council, as represented by the and<br />\ner of curiosity.\" Hopeless naive inadministration, in mind and not years I have enjoyed News-Lett<br />\ndividual that I am, I told the<br />\nand<br />\nobjective,<br />\nhonest,<br />\naccounts<br />\nexaggerate one failure into monudarn kid the twenty-minute story<br />\nof<br />\notlicrs.<br />\nmental and inherent incompetence. impartial - of the plights<br />\nin about three minutes, under the<br />\n3,<br />\nNovember<br />\nthe<br />\nin<br />\n,<br />\nSomehow<br />\nSecond. the Council is forced<br />\nthat I not see it in print<br />\ncondition<br />\nhonesty,<br />\nneither<br />\nto consider aspects of problems 1967 issue, was<br />\nReply: \"Don't<br />\nremorning.<br />\nFriday<br />\nty<br />\nimpartiali<br />\nnor<br />\ny,<br />\nobjectivit<br />\nunknown to (or ignored by)critics.<br />\nworry.\"<br />\nnot<br />\nsimply<br />\nwere<br />\nfacts<br />\nFor example, in my campaign I lated. The<br />\nHonest to God, fellas. are yoU<br />\nproper sequence.<br />\nproposed a protest against dorm accurate or in<br />\nthat<br />\nhard-up for a story? If<br />\nfood by dumping an entire meal<br />\nThis lack is undoubtedly a fu- found guilty, J plan to sue the<br />\non the steps of Ilomewood !louse. nction of the way the paper got<br />\nNews-Letter for libel for the<br />\nLater this was not done, largely the story. Anticipating a Newsof tile court 'costs.<br />\namount<br />\nbecause my investigations showed Letter inquiry. I asked Mr. Bilgrave<br />\nDavid Wirtz<br />\nthat my constituents. particularly<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE FIVE<br /><br />\nDr. Macksey Reviews Book Center<br />\n(Continued from Page 4)<br /><br />\ncolleagues which were considerably more inflammable than the press<br />\ncoverage, but most importantly it<br />\nhad a remarkably effective chairman, Dr. Owen Phillips, who gathered a considerable body of information about university bookstores and JHU procedures, who<br />\nforced its schedule through the<br />\nChristmas holiday so that a draft<br />\nreport could be presented by the<br /><br />\nfirst of the year. In a climate<br />\nwhere it often takes three months<br />\nfor a committee to resolve to open<br />\nthe window, this was no small achievement and possible only with<br />\nlarge doses of strong coffee and<br />\nthe expert archival work of his assistant, Mrs. Elder, Further<br />\nthough, he was able to embody in<br />\na choerent form most of the intelligent suggestions which were<br /><br />\n(Continued on Page 6)<br /><br />\nEngineers scientists<br /><br />\nUDH Speaks<br />\ndian Union of Students. The declaration defines education as \"a<br />\ncontributive social process\"- of<br />\nwhich the main goal is \"to serve<br />\nsociety by developing the full potential of all citizens,\" and goes on<br />\nfrom there to discuss essential student rights and duties, based on<br />\nthe student's being \"a member of<br />\na global society.\" Among these are<br />\nthe right \"to establish democratic,<br />\nrepresentative student associations\" and, since \"educational reform will not come in a vacuum,\"<br />\nto \"ally themselves with other<br />\ngroups in society- which have similar aims.\" The student also has<br />\n\"the • right and the duty . . . to<br />\nmake basic decisions about the<br />\nconditions and nature of his intellectual activity and the goals served<br />\nby educational institutions.\"<br />\nSuch a concept of education<br />\nwill clearly never be realized at<br />\nHopkins unless major changes are<br />\nmade. This situation must be the<br />\nprimary concern of both the Student Council and The News-Letter<br />\nif they are to have any claim to our<br />\nat<br />\nYours faithfully,<br />\nRobert Chodos<br />\nUnion for Democracy at<br />\nHopkins<br /><br />\nNaval<br />\nResearch<br />\nLaboratory<br />\nWASHINGTON, D.C.<br /><br />\nThere's Room<br />\nat our up<br />\n...and we'll<br /><br />\n(Continued from Page 4)<br /><br />\n•Oi<br /><br />\nbrought to the committee and<br />\nwhich were translated into the<br />\nfinal report.<br />\nThere were nine substantive recommendations in the committee's<br />\nreport, followed by a discussion<br />\nof the assumptions and policy behind them. Dr. Bevan, who had<br />\noriginally charged the committee,<br /><br />\nAn Equal Opportunity Employer<br /><br />\nThe Navy's Corporate Laboratory—NRL is<br />\nengaged in research embracing practically<br />\nall branches of physical and engineering science and covering the entire range from<br />\nbasic investigation of fundamental problems<br />\nto applied and developmental research.<br /><br />\nshow you<br />\nhow to get there.<br /><br />\nThe Laboratory has current vacancies and a<br />\ncontinuing need for physicists, chemists,<br />\nmetallurgists, mathematicians, oceanographers, and engineers (electronic, electrical,<br />\nmechanical, and civil). Persons appointed<br />\nreceive the full benefits of the career Civil<br />\nService.<br /><br />\nAs an innovator in the aerospace community, Fairchild Hiller has<br />\nselected \"areas of inevitability\" where our experience and capability show clear promise for substantial contributions, for continuing growth.<br />\nOur future is in scientific satellite technology, electronic information handling, supersonic and super-capacity airliners, regional<br />\nairliners, vertical flight technology, and in the related specialized<br />\ntechnologies. Fairchild Hiller provides unmatched professional<br />\nchallenge. Unmatched personal growth.<br />\nFairchild Hiller's unique personnel development programs will<br />\nkeep you moving as fast as your individual abilities allow.<br />\nFind out more about career opportunities at Fairchild Hiller by<br />\ncontacting your Placement Office now. Campus interviews may be<br />\nscheduled on<br /><br />\nCandidates for bachelor's, master's and doctor's degrees in any of the above fields are<br />\ninvited to schedule interviews with the NRL<br />\nrepresentative who will be in the<br /><br />\nJOHNS HOPKINS UNIVERSITY<br />\nplacement office on<br /><br />\nDECEMBER 1, 1967<br /><br />\nWEDNESDAY, DECEMBER 6, 1967<br /><br />\nVAIF?<br />\nC.:<br /><br />\nI-1IL.CI<br />\nPI<br /><br />\nF<br /><br />\n0<br /><br />\nf3<br /><br />\nA<br /><br />\nThose who for any reason are unable to<br />\nschedule interviews may write to The Director (Code 1818), Naval Research Laboratory, Washington, D. C. 20390.<br /><br />\nIL,L.EF?<br />\n7<br /><br />\nI<br /><br />\n0<br /><br />\nTV<br /><br />\nAircraft Division, Aircraft Service Division, Republic<br />\nAviation Division, Space and Electronics Systems Division,<br />\nStratos Division, Technical Services.Division<br />\nAn equal opportunity employer, M&amp;F<br /><br />\nANNUAL FALL<br />\n••••••••••••<br />\n•••••••••••••••<br /><br />\n••••••<br /><br />\n••••<br />\n•••••••<br /><br />\n•<br />\n•<br />\n•<br /><br />\n•<br />\n•<br /><br />\n•<br /><br />\n•••••••<br /><br />\n•••••••••<br />\nS••••••••••<br /><br />\n••••••••••<br /><br />\nDrastic Reductions on Hundreds of Fine Volumes!<br /><br />\nSAVE50% to 70%<br />\nNon-Fiction Titles On<br /><br />\nLiterature - Biography - Poetry - Science - History - Reference Philosophy - Psychology - Humor - Romance - Sports - Art - Travel<br /><br />\nALL Subjects! Hundreds of Bargains!<br />\nSALE STARTS FRIDAY, NOVEMBER 17th<br />\nTHE JOHNS HOPKINS UNIVERSITY<br />\nBOOK CENTER<br />\nIn The Heart of Gilman Hall<br /><br />\nNEWS-LETTER<br /><br />\nPAGE SIX<br /><br />\nthe Roao qoes EVER on<br />\nsonq cycle ••• music By<br />\nOonalO swann poems<br />\nP. P.tolkien<br />\nNow the songs of Frodo,lbo, Sam Treebeard and<br />\nTom Bombadil can be sung or played by all. Donald<br />\nSwann, of Flanders and Swann, has, with the assistance and encouragement of Professor Tolkien, set<br />\nseven songs from The Lord of The Rings to music.<br />\nEach song may be sung individually or taken together<br />\nas a group to form a song cycle. The arrangements<br />\nare for piano or voice and guitar symbols are given.<br />\n$3.95<br /><br />\npoems anO songs of misnle eaRth<br />\nREAD BY J.R.R. TOLKIEN<br />\nFor his first venture into the recording world Professor<br />\nTolkien has chosen to read from the delightful poems<br />\nof Tom Bombadil. On the reverse side William Elvin<br />\nsings the songs from The Road Goes Ever On with<br />\nDonald Swann at the piano. This record is a must.<br />\nCaedmon Record rTC 1231<br />\n$5.95<br />\nAvadable at your college bookstore<br />\nHOUGHTON MIFFLIN COMPANY<br /><br />\nAVAILABLE AT<br /><br />\nTHE JOHNS HOPKINS<br />\nBOOK CENTER<br />\nIN THE HEART OF GILMAN HALL<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17,1961<br /><br />\nWho's Afraid of the Bookstore?<br />\n(Continued from Page 5)<br /><br />\nand the President responded to the<br />\nreport promptly and, contrary to<br />\nyour account, agreed with only<br />\nminor revisions to enable all of the<br />\nproposals in time for the opening<br />\nof the Center at the end of the<br />\nmonth. In addition, a permanent<br />\npolicy committee was established<br />\nto see that the recommendations<br />\nfound their way into practice and<br />\nto serve as an effective channel<br />\nfor suggestions and complaints<br />\nfrom all members of the community. (To the best of my knowledge, the committee has not addressed itself, as reported, to the<br />\nstaff's need for a green room or<br />\nany similar request, although suggestions from the employees toward the improvement of service<br />\nand conditions are just as welcome<br />\nas those from the students or faculty. Presumably all members of<br />\nthe community are enfranchised<br />\nto complain and to propose.) Despite the bonecrushing demands already made on his time by all<br />\nbranches of the University, Dr.<br />\nBevan agreed to chair the new<br />\ncommittee and thereby identify<br />\nthe importance of the Book Cen-<br /><br />\nter in the academic enterprise.<br />\nHad Mr. Cramer more space, he<br />\nmight have mentioned some of the<br />\nspecific attempts at improving and<br />\nextending the Center's services:<br />\na new special-order and information department, self-service for<br />\nthe text department during most<br />\nof the year, a small second-hand<br />\nand antiquarian department, the<br />\ninclusion of recordings, prints,<br />\nsome press and art books, and additional clerical supplies in the<br />\ngeneral stock; and a start at least<br />\ntoward extending the inventory of<br />\ntrade books and little magazines<br />\nto make the Center a more profitable place to browse.<br />\nSome of the changes were controversial: the shift to a topical<br />\narrangement of the trade books<br />\nwas in response to many requests,<br />\nbut it still has its bagaries for those<br />\naccustomed to the orderly procession of categories; Evan S. Connell's recent novel, The Diary of a<br />\nRapist, quixotically appears under<br />\n\"Sociology,\" while books about<br />\nthe Kennedy clan and the Kama<br />\nSutra tend to turn up under \"Humor.\" For my part, I'm still trying to parse the difference be-<br /><br />\nCAMPUS<br />\nINTERVIEWS<br />\nNEXT WEEK<br />\nGraduates at all degree levels<br />\nare urged to investigate<br />\nthe career opportunities at<br /><br />\nNIH<br />\nThe world's largest center<br />\nfor conquest of disease<br />\nand improvement of human health<br />\nThe National Institutes of Health—NIH—is the principal research<br />\narm of the U.S. Public Health Service, and conducts many of the<br />\nmost advanced programs in medical science today. These programs require specialists in a wide range of disciplines. Example: Right now NIH has openings in the following areas:<br />\nCHEMISTS . . . BIOLOGISTS . . . NURSES . . . MEDICAL<br />\nTECHNOLOGISTS . . . SOCIAL WORKERS . . . LIBRARIANS<br />\n. . . ENGINEERS . . . COMPUTER PROGRAMMERS. . . MATHEMATICIANS . . . STATISTICIANS . . . SYSTEMS ANALYSTS<br />\n. . . MANAGEMENT INTERNS . . . PERSONNEL SPECIALISTS<br />\n. . . ACCOUNTANTS . . . INFORMATION SPECIALISTS . . .<br />\nMANAGEMENT ANALYSTS . . . CONTRACT SPECIALISTS<br />\nThese are permanent positions that offer high professional<br />\nchallenge and the benefits of career Federal employment. Starting salaries are attractive and opportunity for advancement is<br /><br />\ntween \"Fiction\" and \"Literature.\"<br />\nThe decision to extend a 10%<br />\ndiscount on \"trade\" books to all<br />\ncustomers was in response to the<br />\nexplicit request of many students<br />\nand faculty members. This proposal, in fact, seemed the most urgent of the student suggestions.<br />\nThe distinctions between \"trade\"<br />\nand \"text\" categories are made by<br />\nthe publishers, not the management of the Book Center. (In a<br />\nfew cases, the Manager has been<br />\nable to translate a given title to a<br />\ntrade discount by stocking the entire series, e.g. the Loeb Library.)<br />\nThe decision on discounts was a<br />\nprovisional one, involving some<br />\npossible deficits if the volume does<br />\nnot increase in the trade department. The original committee report suggested that discount policy should not be given priority<br />\nover the scope and quality of the<br />\nstock. To my knowledge, only one<br />\nfaculty member lamented the lost<br />\ndiscount on non-trade items, and<br />\nthis was on principle a reluctance<br />\nto give up benefits. If the students<br />\nfeel that the discount is irrelevant,<br />\nit can be revoked and the savings<br />\ndirected toward either improvements in the Book Center.<br />\nObviously, the most trying aspect of the Book Center this year<br />\nhas been the incredible hang-up<br />\nabout texts and special orders. It<br />\nis impossible, however, to wish all<br />\nthe responsibility on the management. The Center has added to the<br />\nstaff in an effort to meet some of<br />\nthe problems, but for almost three<br />\nmonths was without an invoice<br />\nclerk. Further, there are alwavc<br />\nfamiliar delays: the faculty is notoriously slow in submitting lists<br />\nof texts for courses (mea culpa),<br />\nin part because the new courses<br />\nfrequently do not take shape until<br />\nthose few clear days in June; the<br />\ntext houses are so busy effecting<br />\ncorporate mergers that their warehousing and order departments are<br />\nincreasingly fallible (books listed<br />\nas \"in print\" often turn out to be<br />\nnot available until December\");<br />\neven that most addled monopoly,<br />\nthe U.S. Post Office, has increasingly contributed its share of confusion. And finally, the failure to<br />\nanticipate the number of books<br />\nneeded in each course is a direct<br />\nresult of taking too seriously what<br />\nthe students took too lightly:<br />\nspring pre-registration.<br />\nCompared with the massive text<br />\norders of the multiversities, the<br />\nIlopkins Book Center is a quaintly<br />\nsmall operation. If the publishers<br />\nmay occasionally treat our local<br />\nneeds at the same level of priority<br />\nas orders from Katmandu, the<br />\nstaff here has, I think, often tried<br />\nto compensate for this with heroic<br />\n(Continued on Page 8)<br />\nRx Rx Rx Rx Rx Rx Rx Rx Ric<br /><br />\nM Thanksgiving<br />\nDay Cards<br /><br />\nt<br />\n!<br /><br />\nAlso, Gift Boxes of<br /><br />\nCandy<br />\nGreenway Pharmacy<br /><br />\nexcellent.<br />\nCAMPUS INTERVIEWS<br /><br />\nDECEMBER 5<br /><br />\nAn NIH representative will be visiting your campus next week<br />\nto discuss these positions with interested students. You may<br />\narrange an interview during this visit by contacting the Placement Office. Or, if you prefer, you may write or call<br />\nCollege Relations Officer<br /><br />\nNATIONAL INSTITUTES OF HEALTH<br /><br />\nCharles and 34th Sts.<br />\nRx Rx Rx Px Rx<br /><br />\nRx Rx<br /><br />\nCHUNG'S<br />\nCARRY-OUT<br />\nFine Chinese and.<br />\nPolynesian Food<br /><br />\nPhone:(301)496-4707<br /><br />\nOpen Dolly 11 A.!'4.. 10 P.M.<br />\nFriday A Sat 11 A.M..12 P.M.<br />\nSunday 1 P.M..11 P.M.<br /><br />\nAn equal opportunity employer, M&amp;F<br /><br />\n508 W. Cold Spring Lame<br /><br />\nBethesda, Maryland 20014<br /><br />\n889-3428<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE SEVEN<br /><br />\n\"What doesIBM offer a<br />\nPh.D?I'd say diversity.But<br />\njudge for yourself when<br />\nthey're here Dec.12th:'<br /><br />\n;e<br />\nis<br /><br />\n)-<br /><br />\nLs<br />\n),<br />\n;s<br />\nti1<br /><br />\n.ere<br />\ned<br />\nbe<br /><br />\nly,<br /><br />\n)nto<br />\nks<br />\nect<br />\n'aat<br />\nly:<br /><br />\next<br />\nthe<br />\ntiy<br />\nlers<br />\nDeal<br />\nrity<br />\nthe<br />\nried<br />\n!roic<br /><br />\nRx<br /><br />\nIj<br /><br />\nIj<br /><br />\n'<br />\nfi<br />\n41<br /><br />\n: it%<br /><br />\nwe<br /><br />\n\"I think IBM's worth listening to because the advantages<br />\nthat attracted me are even stronger today.(This is Gary<br />\nKozak,Ph.D. in Analytical-Physical Chemistry,an IBM<br />\nDevelopment Chemist and Project Manager.)<br />\n\"At IBM you're constantly working with people doing<br />\nadvanced work in many different fields. That's a great asset<br />\nto any scientist because today's problems are often<br />\ninterdisciplinary. You can't solve them with one kind of<br />\nbackground. You need inputs from three or four different<br />\nkinds of people.<br />\n\"A good example is the solid logic technology used in<br />\nbuilding the IBM System/360. The EE tells you how many<br />\nconductors you'll have, where they go,and what should be<br />\nat the terminals. An ME designs fixturing and automatic<br />\nprocesses. A Polymer Chemist formulates insulators<br />\nand says how they should be used. The Metallurgist<br />\nspecifies alloy compositions. The Physicist decides how to<br />\noptimize a process for producing transistors and diodes.<br />\nAnd all these people have to talk with each other and<br />\nhelp each other.<br />\n\"It's a stimulating environment,and it keeps you technologically sharp. Of course, to do all this interfacing with<br />\nother disciplines, you need a free and informal atmosphere,<br />\nand IBM has it. It's a good place for a scientist to work.\"<br />\nThere's more to the IBM story than Gary has mentioned.<br />\nYou can get all the facts when we interview Ph.D.'s on<br />\ncampu.Make an appointment at your placement office,<br />\neven if you're headed for military service.<br />\nOr if you can't make a campus interview,send an outline<br />\nof your interests and educational background to<br />\nMr. L. H.Covert,IBM,Armonk, Li ,<br />\nN.Y. 10504. We're an equal<br />\nopportunity employer.<br />\ncji=j3<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE EIGHT<br /><br />\nk Center<br />\nIlls,Wills and Bills of Boo<br />\nDr. Macksey Concludes Marathon onreliable<br />\nishments as well<br />\naccompl<br />\nmade<br />\nto<br />\nhave<br />\nseem<br />\nand<br />\nsource own snafus<br /><br />\n(Continued from Page 6)<br /><br />\nefforts to phone, wire, or dog-sled<br />\nfor the missing books. And we<br />\nstill have the antique advantage of<br />\npersonal access to the people running the store. I only hope that in<br />\nthe future some of the crippling<br />\nlacunae can be spotted earlier,<br />\nwhile there is still time to recruit<br />\nsubstitute texts (or apply for a<br /><br />\nAs to the gratuitous slander<br />\nabout the \"guard\" (there are two<br />\nguards, baby), I can only add that<br />\nthe occasional discourtesy I've seen<br />\nin the store during a career of<br />\nabandoned browsing has generally<br />\ncome from the other side of the<br />\ncounter. in fact, Mr. Uren, who,<br />\nlike a number of other members of<br />\nthe staff, seems to enjoy a chance<br />\nto do small favors for the custo-<br /><br />\nmers, is the most<br />\nfew<br />\nof the News-Letter in Gilman much less progress in the past<br />\nCenHall,coming up with his own copy years than the Hopkins Book<br />\nwhen all the others are exhausted: ter. In the former case, I'm not<br />\nRecent visits to the Princeton even sure that \"progress\" is the<br />\nU-Store (which has opted for de- word, since their stock of Princevoting much space to high-profit ton University Press books was<br />\n\"soft goods\") and to the Colum- riddled with holes.<br />\nThere is always an ideal univerbia Book Store have reminded me<br />\nill-defined perhaps, but the<br />\nsity,<br />\nwhich<br />\nons,<br />\ninstituti<br />\nthose<br />\nthat<br />\nclaim a richer audience, have their vital standard against which the<br /><br />\nTRW is success by association<br />\nAfs-,1<br />\n/<br /><br />\nEugene Noth, MS<br />\nTracking it Analytical Simulation<br /><br />\nrohl'D.<br />\n'<br />\n,greeoriitF<br />\nL;;:,Vitc.le<br />\nIG°<br /><br />\n•:,.<br /><br />\nas the<br />\nfailures of the real university must<br />\nbe measured. One of the functions<br />\nof the responsible critic is to remind us of that ideal university<br />\n(which surely includes a much better Book Center). The critic can<br />\nalso help at the most primitive<br />\nlevel by using some of the instruments of reform, such as the al'most blank tablet at the specialorder counter for suggesting titles<br />\nand authors which should be in<br />\nstock. Somewhat more ambitiously, perhaps the News-Letter can<br />\nsuggest an effective means by<br />\nwhich the Students can carry their<br />\nsuggestions and complaints representatively to the committee on<br />\npolicy.(Have an election and you<br />\nmay poll fifty votes.) You might<br />\ntry something like a \"Direct Line\"<br />\ncolumn in your paper for the inveterate letter writers among us.<br />\nFinally, without abandoning the<br />\nideal university, in all our disappointments with the refractory<br />\npresent, we must never lose sight<br />\nof the continuing existence of the<br />\nreal university and its occasional<br />\napproximations of the ideal.<br />\nSincerely yours,<br />\nRichard A. Macksey<br />\nProfessor of Humanities<br />\nBiC Medium Point 19e<br /><br />\n.......<br />\nAndra Blaufuss, BS<br />\nGuidance it Mission Simulation<br /><br />\nJames Austin, MS<br />\nSystems Analysis 6 Software<br /><br />\nFloyd Thomas, Ph.D.<br />\nAdvanced Technology<br /><br />\nDon Bowyler, MS<br />\nElectr)nrc Reconnaissance<br /><br />\nRoger Burnell, MS<br />\nTelecommunications<br /><br />\n••<br />\nJoseph Kawamura, Ph.D.<br />\nSpace Guidance<br /><br />\nBiC Fine Point 25t<br /><br />\nLawrence Fink, BA<br />\nSub•Systems Programming<br /><br />\nrialsilartin, MBA<br />\nrs<br />\n‘ti:<br /><br />\nFrom Los Angeles to Houston to Washington,from Space<br />\nSystems to Ocean Systems to Information Systems,<br />\nyoung people are making things happen at TRW,<br /><br />\nTake a look around any TRW location.<br />\nThe young faces outnumber the old by<br />\na good margin. The vast majoritji of<br />\nscientists and engineers you'll meet are<br />\nunder thirty, or forty at least. Why?<br />\nBecause we depend cm young ideas,<br />\nnew ideas, fresh ideas. That's why we<br />\nneed you.<br />\nWhat kind of a place is TRW? Ask<br />\naround. Tal_k to your professors and<br />\nfaculty_advisors, or your friends who are<br />\nalready working with TRW. Most of our<br />\nprofessional employees applied to TRW<br />\non the recommendation of friends.<br />\nHere are some of the disciplines where<br />\nnew graduates may find career opportunities at TRW:<br /><br />\nComputer Sciences/Analytical<br />\nResearch / Aerosciences / Information Systems / Digital Systems / Communications Systems/Reliability/<br />\nGuidance &amp; Control / Sensor Systems<br />\n/ Microelectronics / Electric Power /<br />\nSpace Vehicle Design / Antenna Systems Design and Analysis / Mechanical Engineering / Product Assurance /<br />\nIntegration &amp; Test / Systems Engineering / Circuit Design / Electronic Countermeasures &amp; Electronic Intelligence<br />\nSystems<br />\nIf you'll be receiving your degree<br />\n(Ph.D.; MS or BS) in Engineering or<br />\nScience this year, check with your<br />\nPlacement Director and talk with us<br /><br />\nwhile we're on campus. If you can't<br />\nmake it at that time and would like to<br />\nbe considered for openings in the Los<br />\nAngeles area, Houston or Washington,<br />\nsend your resume to: W. D. Mclvers,<br />\nCollege Relations, TRW, One Space<br />\nPark, Redondo Beach, California 90278.<br /><br />\nDespite<br />\nfiendish torture<br />\ndynamic BiC Duo<br />\nwrites first time,<br />\nevery time!<br />\nS rugged pair of<br />\n'<br />\nBIC<br />\nstick pens wins again<br />\nin unending war<br />\nagainst ball-point<br />\nskip. clog and smear.<br />\nDespitp horrible<br />\npunishment by mad<br />\nscientists, inc still<br />\nwrites first time, every<br />\ntime. And no wonder.<br />\nDiese'Dyamite\" Ball<br />\nis the hardest metal<br />\nMade. encased in a<br />\nsolid brass nose cone.<br />\nWill not skip, clog<br />\nor smear no matter<br />\nwhat devilish abuse<br />\nis devised for them<br />\nby sadistic students.<br />\nGet the dynamic<br />\nBIC Duo at your<br />\ncampus store now.<br /><br />\na.<br /><br />\nc•J<br /><br />\nWATERMAN-BIC PEN CORP<br />\nMILFORD, CONN<br /><br />\nAn Equal Opportunity Employer<br /><br />\nwho are applying advanced technology to space, defense, automotive, aircrait, electronics and industrial<br />\nTRW ((ormerly Thompson Rams Wooldridge) is 60,000 people at 200 operations around the world<br /><br />\nmarkets.<br /><br />\nENGINEERS AND SCIENTISTS<br /><br />\nTRW CAMPUS INTERVIEWS<br /><br />\n1\"`'..•<br />\n.<br />\n—jte ;7.tt<br />\n111441<br /><br />\n.<br />\n.00<br /><br />\nFriday, December 1, 1967<br /><br />\nAVAILABLE AT:<br />\nTHE JOHNS HOPKINS<br />\nBOOK (ENTER<br /><br />\nSEE YOUR PLACEMENT OFFICE<br /><br />\nGilman Hall<br /><br />\nHOMEWOOD, BALTIMORE, NOVFMBER 17, 1967<br /><br />\nHop-Terror<br /><br />\nNEWS-LETTER<br /><br />\nPAGE NINE<br /><br />\nJays Nest<br /><br />\n(Continued from Page 12)<br /><br />\n4 ;;*<br />\n,<br /><br />\nthe performance of Jay quarterback Jim Feely, as the 5-8 signalcaller had perhaps the best of several excellent Saturday's hitting on<br />\neleven of fourteen passes for 240<br />\nyards and three touchdowns, running for two more scores, and<br />\nthrowing for two conversions.<br />\nHopkins jumped out to a 14-0 lead<br />\non scoring tosses of 60 and 26<br />\nyards from Feely to Joe Cowan;<br />\nand - after Dickinson scored its<br />\nlone T.D. - the Junior quarterback<br />\nthrew to Steve Latson for a 19<br />\nyard score, ran for four yards and<br />\nanother tally, and then handed off<br />\nto Paul Weiss, whose four yard<br />\nT.D. carry gave the Hop a 34-6<br />\nhalftime lead.<br />\nFeely's eight yard run made the<br />\ncount 40-0, before sub quarterbacks Mike Shaw (voted outstanding Jay back of the game,mainly<br />\nfor his work in the defensive secondary) and Steve Clark connected on T.D. tosses of 16 and 14<br />\nyards to Latson and Dave Levien.<br />\nSotir had special praise for his<br />\ndefensive line - especially Wit Holden and Jim Lotto - calling its performance \"better than in the past\";<br />\nbut felt that its offensive counterpart - with the exception of Lineman of the Week Mark Perlmutter<br />\n- did relatively poorly.<br />\nSometime-place kicker Wes Bachur will be available for the game<br />\ntomorrow.<br /><br />\n(Continued from Page 10)<br /><br />\nBarrette's contingent sports an<br />\noutstanding ability in all positions.<br />\nIn view of these the attractions of soccer in general and at<br />\nHopkins,it appears rather astounding that the sport has been de-emphasized to such an extent. The<br />\nperspective can be clearly seen by<br />\nthe number of fans present at soccer contest (42 at last Tuesday's<br />\nvictory) and at football games<br />\n(over 2000 normally).<br />\nI would like to make it clear<br />\nthat I am in no wise advocating<br />\nthe desertion of football either<br />\nin emphasis or in fan support.<br />\nFootball enthusiasm is a present<br />\nand positive factor on almost every<br />\ncollege campus. I am for packing<br />\nthe stands on Homewood Field<br />\ntomorrow. I do not however, condone the one-sided support which<br />\nhas thus far been given to Hopkins<br />\ngridmen. The action on the pitch<br />\nfield is in no way less outstanding,<br />\nas will be evidenced tomorrow<br />\nwhen the pitchmen host Dickinson at 11 o'clock for their final<br />\nouting of the season.<br /><br />\nI've Got My Eye On The Man...<br />\nin a VA NJ 1-1 E U S<br /><br />\nNJ'<br /><br />\n\"417' VANOPRESS SHIRT<br />\nAnd what an eyeful he is! A physique as<br />\nwell-built and manner as smooth as his<br />\npermanently pressed . . . VANOPRESS<br />\nshirt. A swingy style that matches the<br />\n\"417\" authentic tailoring of his buttondown collar and V-Tapered fit. Switched-on<br />\nstripes or colorful solids in dress or sport,<br />\nVan Heusen has them all. Will I keep him<br />\nin sight? You'd better believe it!<br /><br />\nBuild up your following with Passport 360,<br />\nthe influential line of men's toiletries by Van Heusen.<br /><br />\nBy students<br />\nfor students<br /><br />\nPSYCHEDELICS<br />\nAND THE<br /><br />\nCOLLEGE<br />\nSTUDENT<br /><br />\n41<br />\n,<br /><br />\nCompiled by the<br />\nPrinceton University<br />\nStudent Committee on<br />\nMental Health<br />\nIt took a group of college students to cut through the pretensions and moral judgments<br />\nbeing aired about psychedelic<br />\ndrugs. This 50e• pamphlet<br />\ntells just the facts—the social,<br />\nmedical, and legal aspects of<br />\npsychedelic drug use, descriptions of a successful and unsuccessful trip, and clear definitions of drug-related terms.<br />\nAvailable at your bookstore<br /><br />\nPrinceton<br />\nUniversity Press<br />\nPrinceton, N. J. 08540<br /><br />\nAVAILABLE AT:<br /><br />\nTHE JOhNS HOPKINS<br />\nBOOK CENTER<br />\nGilman Hall<br /><br />\nComplete Bachelor<br />\nService<br />\nFLUFF DRY 1. FOLD<br />\nSHIRTS—DRY CLEANING<br /><br />\nWaverly Laundromat<br />\n3330 GREENMOUNT AVE.<br />\n467-2123<br /><br />\nJOHN P. NUGENT, JR,<br />\nLife &amp; Health<br />\nInsurance<br />\nCompare<br /><br />\n243-7961<br /><br />\nWhich Johns Hopkins man is a decision-maker at General Electric?<br />\n(They all are)<br />\nLaddie L. Stahl, MS, '50, joined<br />\nGeneral Electric in 1954 as Manager<br />\nof Product Planning and Market Research for the Missile and Space<br />\nDivision. Today he heads the Research and Development Application<br />\nService at the General Electric R&amp;D<br />\nCenter.<br />\nDecision-maker? You bet! But<br />\nevery Johns Hopkins grad gets his<br />\nshare of responsibility at General<br />\nElectric.<br /><br />\nTake Bob Anderson, '60, an<br />\nEconomic Specialist at the Large<br />\nSteam Turbine and Generator Department. He helps evaluate the financial end of some of the Company's major manufacturing projects.<br />\nAnd Nuclear Physicist Joe Gotwals, '63, is involved in testing and<br />\ndesign analysis of submarine nuclear reactors at the Knolls Atomic<br />\nPower Laboratory in Schenectady,<br />\nNew York.<br /><br />\nGENERAL<br /><br />\nELECTRIC<br /><br />\nA - Equal Opportunity Employer<br /><br />\nResponsibility and decisionmaking come early at General Electric. We're growing so fast and in<br />\nso many challenging areas, that<br />\nthere's no waiting for the big opportunities.<br />\nHow about you? Do you have<br />\nwhat it takes to make important<br />\ndecisions for General Electric? If<br />\nyou think you do, talk to the General<br />\nElectric recruiter when he's on<br />\ncampus.<br />\n910-00<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nNEWS-LETTER<br /><br />\n• PAGE TEN<br /><br />\nHopkins Finds Heaps'Home<br />\nThe University has purchased a month, with the above charges<br />\nparking garage on St. Paul Street, payable monthly in advance.<br />\nto alleviate Jove rcrowae d parking<br />\nThe garage, on 3330 St. Paul<br />\nconditions on campus.<br />\nStreet, known as the Homewood<br />\nThe garage is a multi-level, rein- garage, will provide immediate<br />\nforced concrete and brick, self- space availibility to all Hopkins<br />\nparking facility, located in the im- faculty, students and employees.<br />\nmediate vicinity of the University<br />\nOne Apartment Houses. Current<br />\nFreshman Wrestling<br />\nmonthly rates of $15.00 and<br />\nthe<br />\nfor<br />\ncontinued<br />\nbe<br />\nthose interested in freshwill<br />\nAll<br />\n$12.50<br />\nmonth of November. However, ef- man wrestling who have not<br />\nfective December 1, 1967 the ra- attended either the team's meettes for Hopkins people will be ing or practices are requested<br />\n$12.00 per month for standard to contact Coach Kyle Smith<br />\nsized cars and $10.00 per month in his office in the Athletic<br />\nfor compact cars.<br />\nCenter as soon as possible.<br />\nArrangements can be made for<br />\nmonthly rental of spaces by applyto the attendant on duty at the<br />\ngarage. Under such arrangements<br />\neach user is assigned his own space<br />\nwhich he retains from month to<br />\nPROMENADE CONCERT<br />\nThe Walters — Peabody Promenade Concert will be held on<br />\nNovember 30 at 12:30 p.m. at<br />\nthe Walters' Art Gallery. On<br />\nNovember 30 there will be a<br />\nguitar and woodwind ensemble.<br />\nThe Public is invited to browse<br />\nwhile the groups play. The<br />\ngroup is comprised of students<br />\nfrom the Peabody Institute.<br /><br />\nClassified<br />\nFAITH AND JUDAISM' is the topic of a free supper lecture which<br />\nwill be held this Sunday at Beth<br />\nJacob Synagogue, Park Heights<br />\nAvenue with Rabbi Joseph Scheeter. Transportation by bus is being<br />\nprovided at a cost of fifty cents<br />\nand will leave from in front of<br />\nthe Eisenhower Library at 5:30<br />\np.m. Goucher girls will also be<br />\npresent.<br />\nYAVNEH OF BALTIMORE is<br />\npresenting a lecture by Rabbi<br />\nJacob S. Green on the JEWISH<br />\nCONCEPT OF SOCIAL JUSTICE<br />\nin Levering Hall, Sunday, November 26, at 6:30p.m.<br /><br />\nJay's Nest<br />\nDespite these attributes, soccer has consistantly taken a back<br />\nseat to grid competition at Hopkins. This secondary position can<br />\nbe witnessed by the poor condition<br />\nof the pitch field, the limited seating capacity, and the lack of attendance at soccer contests. Like<br />\nother sports such as baseball, soccer is not noted for its quantity of<br />\npartisans, but for their fervor.<br />\nEven at Hopkins, soccer has its<br />\nenthusiastic fans, but they are few<br />\nin number.<br />\nPerhaps football is partially to<br />\nblame for this lack of support. The<br />\nscheduling of football games is<br />\nconsistently given pre-eminence<br />\nover soccer contests. Football is<br />\nalso enhanced by publication of<br />\nprinted programs, loud speaker<br />\ncoverage, and cheerleaders (after<br />\na fashion).<br />\nPitchmen Strong<br />\nThe 1967 edition of the Blue<br />\nJay pitchmen has thus far amassed<br />\na 6-4 record with impressive victories over powerful Drexel and<br />\nWestern Maryland. Coach Gary<br /><br />\nBy JIM SLOAN<br />\nSports Editor<br /><br />\nAlthough in almost every other<br />\ncountry in the world, soccer is the<br />\nnational sport; in America the emphasis is focused on football - The<br />\nspectator sport. This fact is especially evident on the professional<br />\nand collegiate levels, and Hopkins<br />\nis no exception.<br />\nThe universal appeal which soccer arouses for peoples of all nationalities certainly must have<br />\nsome relevancy to American fans.<br />\nIndeed it has, as witnessed by the<br />\nattempts.of the new professional<br />\nsoccer organizations. The facination which many fans hold for the<br />\ngame can be only partially explained. The sport Is one of continual action and perpetual motion. The substitutions are minimal, and the rules are easy to<br />\nunderstand.<br />\nBody contact is also present in<br />\nsoccer, and the game requires coordination of the entire body in<br />\nall aspects of play. Endurance, as<br />\nin lacrosse, is an important factor.<br /><br />\nAll Types of Subs<br />\nSnacks — Beer<br />\nOPEN TILL 1:00<br />\n7 DAYS A WEEK<br /><br />\nB &amp; M SUB SHOP<br />\n31st &amp; GUILFORD<br />\n.‘‘‘ do the tr%•<br /><br />\nNEW PENGUINS<br />\nIN STOCK<br /><br />\nor644<br /><br />\n...at your<br />\ncampus<br />\n!iiishookstore<br /><br />\nREAD Shaw's SAINT JOAN before and after the show. A<br />\nPenguin paperback exclusive.<br />\nComplete play with Shaw's<br />\nPreface. PL3. 65¢<br /><br />\nc Adult<br /><br />\nyoung<br /><br />\n0,-4<br /><br />\nfoe<br /><br />\nnever forget<br /><br />\nplo<br /><br />\n(and you will<br />\nalways remember)<br />\nthe fabulous<br />\nvalues at<br />\n/<br />\nTHE<br /><br />\n00.1st<br /><br />\nz<br /><br />\nf.<br /><br />\nSAMPLE<br />\nSTORE<br /><br />\nYe'<br />\n-<br /><br />\nEVERY<br />\nSPORTCOAT<br />\nIN STOCK<br />\nValues to $45.00<br /><br />\nfly home confirmed<br />\nfor 1/3 less . . Mail this application TODAY.<br />\nLake Central Airlines, Weir Cook Airport, Indianapolis, Indiana 46241<br />\nYes, I would like to take advantage of 1/3 savings on the first-class<br />\nfare every time I fly Lake Central—without giving up the privilege of<br />\nconfirmed reservations. I enclose $10 for the membership service<br />\ncharge for the entire year of 1968 ($5 for the balance of 1967) and<br />\nverification that I am under 22 years old. I understand that my identification card will be honored for all Lake Central flights with the<br />\nexception of flights on New Year's Day, Easter, Memorial Day, Labor<br />\nDay, Thanksgiving or Christmas, or three days prior to or following<br />\nthese holidays.<br /><br />\nBaltimore, Md. 21211<br /><br />\nN BOOKS<br />\nPENGUI<br />\nAVAILABLE AT<br />\nTHE JOHNS HOPKINS UNIV.<br />\nBOOK CENTER<br />\n•<br />\nGILMAN HALL<br /><br />\nSAMPLE STORE<br />\nOPEN EVERY EVENING<br /><br />\n• CHARC.I1 • NAC • $1000 CUB<br /><br />\nMAKE A DATE AND DON'T<br />\nBE LATE . . . HARRY LITTLE<br />\nIS WAITING<br />\nSubmarines • Pizza<br />\nSpaghetti • Sour II•ef<br /><br />\nNAME<br /><br />\n3300 Clipper Mill Road<br /><br />\n*19<br />\n3031 Greenmount Ave.<br />\nin Waverly<br /><br />\nYoung Adult Fare Plan Membership Application<br /><br />\nI enclose: ri $5.00 for balance of 1967 ri $10 for entire year of 1968<br />\nLI $15.00 for 1967 and 1968.<br /><br />\nPENGUIN BOOKS INC<br /><br />\n-CHARLES STREET<br />\nREVIEW<br />\nThe Charles Street Review,<br />\nunder new leadership, is in the<br />\nprocess of being revitalized. The<br />\nsleeping carcass is expected to<br />\nbe reborn, in expanded form,<br />\nsometime after semester break.<br />\nIn order to be resuscitated to<br />\nthe healthy life it once had, it<br />\nneeds photographs and prose<br />\nand poetry and music discussion and ideas. Please give your<br />\ntime, at least, to a worthwhile<br />\nendeavor, to a child on its<br />\nknees. Please give your name<br />\nand work to Box 42, or find<br />\nJohn Moorheadin Levering Hall.<br /><br />\nYl<br /><br />\nTHE CITY OF MAN. W. Warren Wagar. Examines the possibility of<br />\na world civilization as the solution to the twentieth century's political and spiritual crisis. A931. $1.65<br /><br />\nSEE Shaw's SAINT JOAN—<br />\nwith Maurice Evans,<br />\nTheodore Bikel, Raymond<br />\nMassey, Roddy McDowall<br />\nand Genevieve Bujold—on<br />\nTV, Monday evening, December 4th. Check local<br />\nlistings for time and<br />\nchannel.<br /><br />\nBACHUR BOOTS - Soccer cocaptain Wes Bachur lines up for<br />\na shot on goal in last Tuesday's<br />\nbout against Western Maryland.<br />\nJays won 2-1.<br /><br />\nELEPHANTS<br /><br />\nURBAN CHOICES: THE CITY AND ITS CRITICS. Roger Starr. A<br />\ntimely and probing review of America's urban problehis and their<br />\npossible solutions. Covers housing, unemployment, racial tensions, poverty, architectural planning, air and water pollution, and<br />\nurban politics. A951. $1.45<br /><br />\nENGELS: SELECTED WRITINGS. Edited by W. 0. Henderson. A<br />\nnew and wide selection from articles and correspondence, revealing Engels as economist, historian, philosopher, and military critic.<br />\nA729. $1.95<br /><br />\nr.<br /><br />\njJPIc by ToM.Fahinan<br /><br />\n•<br /><br />\nvrtk<br /><br />\nLATIN AMERICAN WRITING TODAY. Edited by J. M. Cohen. The<br />\nlatest volume in this new series offers prose and poetry by writers<br />\nfrom Argentina, Brazil, Chile, Colombia, Cuba, Mexico, Peru and<br />\nUruguay. All works are presented in English. 2490. $1.25<br /><br />\n,<br /><br />\n140,<br /><br />\nHARRY LITTLE<br /><br />\nSIGNATURE<br /><br />\nZIP<br /><br />\nSTATE<br /><br />\nWEIGHT<br /><br />\nHEIGHT<br /><br />\nDATE OF BIRTH<br />\nCOLOR EYES<br /><br />\nLAKE CENTRAL<br />\nthe<br />\nft<br />\nNo.,<br /><br />\nCARRY OUT SHOPS<br /><br />\nCITY'<br /><br />\nADDRESS<br /><br />\nCGLL,R<br /><br />\n_<br /><br />\n32nd Near Greenmount<br />\n25th Near Greenmount<br />\nYork Road &amp; Regester Ave.<br /><br />\nairline with a heart<br />\n* * * * 'A' * *<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nNEWS-LETTER<br /><br />\nHarriers Wind Up Mediocre Season<br />\nBy RICH HOLLANDER<br />\nThe varsity cross country warriors wrapped up their dual and invitational meet season last week<br />\nat Gettysburg and Gallaudet with<br />\na mediocre 3 and 7 record.<br />\nThe season however has not<br />\nbeen as dismal as the standings<br />\nwould indicate. Last Saturday they<br />\nventured to the Gallaudet Invitational in Washington. Despite the<br />\nloss of one participant, the Jays<br />\nran gamely,- and came in fifth<br />\namong the nine teams entered. The<br />\npathetic thing was that the second<br />\nplace team was a mere 18 points<br />\nahead. Still Jeff Lauren, John Wilken and Cliff Cyr were medal winners among the myriad of runners.<br />\nOnly victorious American University took more medals than Hopkins.<br />\nBitter about the muddy trails<br />\nthey encountered, the harriers excused dropping both ends of a<br />\ntriangular meet to Gettysburg and<br />\nRider. Apparently the major obstacles were their opponents, as<br />\nthey lost to Gettysburg 24 to 33<br />\nand to Rider 26 to 29. As usual<br />\nLauren led the pack with a third<br />\nclocking in 28:29. Captain Cyr<br />\nskirted in at seventh place. Probably the most encouraging sign<br /><br />\nthe return of injured John<br />\nMcKeon, who took fourteenth<br />\nplace.<br />\nFour days earlier Jeff Lauren<br />\nfell victim to a cramp, and with<br />\nhim crumbled the Jay's fortunes<br />\nin a 20 to 39 drubbing at the hands<br />\nof visiting Swarthmore, John Witken and Cliff Cyr placed third and<br />\nfifth, but their comrads were un-<br /><br />\nable to keep pace.<br />\nThe freshmen have closed their<br />\ncampaign with a 3-2-1 mark. They<br />\nhave been quite consistent in losing to Bainbridge Prep twice, taking Towson State twice,Poly once,<br />\nand drawing even with Mount St.<br />\nJoseph. In the 25 to 30 triumph<br />\nover Poly, Matt Polk eclipsed the<br />\nfield breezing home in 13:39.<br /><br />\nTHEATRE HOPKINS<br />\n1967-1968 Season<br />\nStudent Season Subscriptions still<br />\navailable 5 Productions For $5.00<br /><br />\nTicket Office,Shriver Hall<br />\nThe Johns Hopkins University<br />\nBaltimore, Maiyland 21218<br />\n(Single per play admission $2.25)<br />\nLast season more than 700 people were<br />\nturned away in a single week-end.<br /><br />\nPAGE ELEVEN<br />\nVARSITY BASKETBALL SCRIMMAGES<br />\nHopkins 95<br />\nAlexandria Amateur<br />\nTeam 86<br />\nHopkins 74<br />\nSoutheastern U. 65<br />\nTonight: B.J.C., 6:30 p.m. - Away<br /><br />\nTuesday, November 21<br />\nMorgan State<br />\n7:00 p.m. - Away<br />\nWednesday, November 29<br />\nBaltimore U.<br />\n8:00 p.m. - Home<br /><br />\nPLACEMENT BUREAU ANNOUNCES<br />\nGRADUATE SCHOOL INTERVIEWS - SENIORS<br />\nFriday, November 17 - SYARCUSE UNIV LAW SCHOOL<br />\nFriday, November 17 - VILLA NOVA LAW SCHOOL<br />\nWednesday, November 29 - NORTHWESTERN UNIV<br />\nLAW SCHOOL<br />\nMonday, December 4 - UNIV OF CHICAGO BUSINESS SCHOOL<br />\nCONTACT PLACEMENT BUREAU, 100 WHITEHEAD HALL TO<br />\nARRANGE FOR INTERVIEWS.<br />\nGraduate students and seniors in non-science fields who are<br />\ninterested in government careers should take Federal Service<br />\nEntrance Exams early in academic year. Exams are given<br />\nmonthly through May.<br />\nAPPLICATIONS FOR ABOVE EXAMS ARE AVAILABLE IN PLACEMENT BUREAU, 100 WHITEHEAD HALL.<br /><br />\nB.I.A. Notes 1<br />\nATO has captured the BIA League A title. DU defeated Phi Gant<br />\n6-0 last Tuesday on a touchdown<br />\npass to Bruce Ledig for the championship in League B.<br />\nATO is slated to play DU for<br />\nthe fraternity crown, but the date<br />\nis yet to be announced. Freshman<br />\nand Upper Class Dorm competition<br />\nare not completed, however, Baker<br />\nand Wood are leading.<br />\nAD has forfeited two games<br />\nas of November 2. Therefore they<br />\nwill not be allowed to play in the<br />\nleague this year, and will not participate in BIA football next year.<br />\nA referee's clinic for basketball<br />\nwill be held Tuesday, December 5,<br />\nat 4:15p.m. in the classroom of<br />\nthe Athletic Center. Each BIA referee will receive $1.50 per game.<br />\nDave Bennett has recently been<br />\nappointed to the vacant post on<br />\nthe BIA board.<br />\nThe BIA will sponser the following winter sports: basketball,<br />\nWrestling, swimming, ping-pong.<br />\nSquash, handball, badminton,<br />\nhowling, and volleyball.<br />\ncolter opportunities<br />\nPh.D., M.S., or B.S. in:<br /><br />\nENGINEERING<br />\nchemical<br />\ncivil<br />\nelectrical<br />\nmechanical<br />\nmetallurgical<br />\nmining<br />\nnuclear<br /><br />\nEnroll in one of three exciting classes. Charger R/T,<br />\nCoronet R/T, or Dart GTSport. Each has its own distinctive sporty style, but all three have a lot in common. Like automatic transmissions, wide-tread red<br />\nline tires, special handling packages, and a long list<br />\nof other standard and optional features.<br /><br />\nTo add some color to campus, get your Official<br />\nDodge Scat Pack Jacket in the official \"Dodge Red\"<br />\nColor—with the<br />\nauthentic embroidered \"bumblebee\" design on<br />\nfront and back.<br />\nSend for yours<br />\ntoday.<br /><br />\nSCIENCE<br />\nengineering physics<br />\nhealth physics<br />\nmetallurgy<br />\nphysics<br />\nB average or above in major subjects<br />\nAEC recruiter interviewing<br /><br />\ncampus<br /><br />\nNOVEMBER 28, 1967<br />\nSee your placement officer for brochure and interview appointment<br />\nU. S. ATOMIC ENERGY<br />\nCOMMISSION<br />\nan equal opportunity employer<br /><br />\nWe need your head in our<br />\nbusiness<br /><br />\nSt Paul Barber Shop<br />\n3120 St. Paul St.<br />\nAcross Loin Eddie s<br /><br />\nDodge Coronet R/T<br /><br />\nTo help you make the grade, the standard engines<br />\nfor the Scat Pack include a 340-cu.-in. V8 for the<br />\nDart GTS. And for Charger R/T and Coronet R/T, a<br />\n440 Magnum V8. Or for a more accelerated course,<br />\nyou can order the optional 426 Hemi.<br /><br />\nifiNik<br />\n11<br /><br />\n0<br /><br />\n.<br /><br />\nDodge Dart GTSport<br /><br />\nAll three members of the Scat Pack offer distinguishing marks at no extra cost. Bold bumblebee<br />\nstripes wrapped around the rear. Or Rallye stripes<br />\nalong the side. Or if you prefer to be a little more<br />\nmodest, no stripes at all. It's your choice. Ready for<br />\nclass? With the Scat Pack, you've got it. Why not sign<br />\nup at your nearby Dodge Dealer's and get your<br />\nBumblebee Degree, today?<br /><br />\nFILL OUT AND MAIL TO:<br />\nHughes-Hatcher-Suffrin, 1133 Shelby at State,<br />\nDetroit, Michigan 48226. Attn.: Mr. Gus Anton.<br />\nEnclosed is a check or money order (made payable to<br />\nHughes-Hatcher-Suffrin) for $<br />\nto cover cast of<br />\njackets at $9.95 each. Available sizes: S, M,<br />\nL, XL, XXL. (Add 4% sales tax for delivery in Michigan.)<br />\nName<br /><br />\nSize<br /><br />\nAddress<br /><br />\nCity<br /><br />\nState<br /><br />\nZip<br /><br />\nNEWS<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 17, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE TWELVE<br /><br />\nSP<br /><br />\nLETTER<br /><br />\nM.A.C. Champs Battle Terrors<br />\nBy MIKE PHILLIPS<br />\nAssured the Southen Division<br />\nMiddle Atlantic Conference championship - Hopkins' first such title<br />\nsince 1960 - the varsity football<br />\nteam puts its new-found reputation on the line tomorrow, when<br />\nit concludes the 1967 season by<br />\nhosting second-place M.A.C. finisher Western Maryland at 2:00<br />\np.m. •<br />\nThe Terrors, 3-1 in the league<br />\nand 5-2 overall, are quite possibly<br />\nthe strongest - and certainly the<br />\nmost opportunistic - group the<br />\nJays have faced this year. In routing Randolph-Macon, which handed Horkins its lone setback by 4822, the Westminster squad utilized<br />\nits particular abilities to the utmost,capitalizing on six pass interceptions and three fumbles to win<br />\n35-3.<br />\nKey to Western Maryland's success this season has been its defensive unit, a group that has allowed<br />\nbut 77 points in seven games(Hopkins: 87 in six) and permitted<br />\nmore than one touchdown in only<br />\ntwo of them. Standouts in this<br />\ngroup are linebacker John Heritage, middle guard Joe Anthony,<br />\ntackle Vic McTeer (who goes at<br />\n6-4 and 240 pounds). To some extent the game's outcome will hinge<br />\non the effectiveness of this contingent against Hopkins' forty-pointa-game offense.<br /><br />\nCridders \"Right- to Division Title<br />\nTo Be Tested by Victors<br />\nOf Randolph-Macon<br /><br />\nbit of an anomaly - it has averaged<br />\nover twenty points a game, yet is<br />\nunimpressive otherwise statistically (e.g. 186 yards total offense in<br />\nlast week's 15-0 defeat of Drexel),<br />\nsometimes seems overly dependent<br />\non the defense (e.g. the team's 268 conquest of Bridgewater, in<br />\nwhich it trailed in every offensive<br />\nstatistic), but is possessed of some<br />\noutstanding individuals. In quarterback Bruce Bozman (11 of 15 passes for two T.D.'s against Hopkins<br />\nlast year), a good passer, field general, and runner; and halfback Jerry Borga, a speedy power runner<br />\nwho is also the team's best pass receiver, the Terrors have two of the<br />\nbest individual performers in the<br />\nM.A.C.<br />\nReal Stakes Tomorrow<br />\nHopkins, now 5-0 in the Southern Division by virtue of last<br />\nweek's 52-6 rout of Dickinson,<br />\ncannot cede its loop leadership by<br />\nlosing to Western Maryland Saturday. What is on the line tomorrow<br />\nis its \"right\" to the Southern Division crown - the extent to which<br />\nthe championship is \"deserved.\"<br />\nWestern Maryland's lone league<br />\nloss (by 25-8) in its opener with<br />\nWagner, a power (4-0) in the generally tougher Northern Division<br />\nthe M.A.C., and its big edge<br />\nWestern Maryland's offense is a of<br /><br />\nagainst the one common opponent<br />\nit shares with the Jay s could establish an argument for Terror superiority only amendable to disapproval by a Hopkins win.<br />\nJay Coach Alex Sour, seemingly impressed by Western Maryland's conquest of Randolph-Macon, supported the thesis of a Terror edge. \"The Randolph-Macon<br />\ncomparative scores show we've<br />\nreally got a tough game on our<br />\nhands Saturday,\" he said. \"Western Maryland should be favored;<br />\nI don't see how it could be put any<br />\nother way.\"<br />\nEvidence Ambiguous<br />\nFor all the above, though, the<br />\navailable evidence is far from completely favoring Western Maryland.<br />\nThe Westminster club's RandolphMacon triumph came the week after that team had - aided by a soso Jay performance and some<br />\nbreaks - taken Hopkins; and Randolph-Macon which hardly played<br />\nas well as it had the week before,<br />\nmay have been complacent after<br />\nthat victory. In both ball games<br />\nthe offensive statistics of the opposed teams were fairly equal. All<br />\nin all, tomorrow's game would<br />\nseem fairly close to a tossup; and in this writer's view - the edge goes<br />\nto Hopkins.<br />\nThe course of last Saturday's<br />\n52-6 Jay win over Dickinson can<br />\nbe fairly well outlined in terms of<br />\n(Continued on Page 9)<br /><br />\nHopkins Kickers Win<br />\nTwo Straight Matches<br />\nBy BOB HYAMS<br />\nThe varsity soccer team captured their sixth victory of the season<br />\nlast Tuesday as they defeated a<br />\npowerful but ineffective Western<br />\nMaryland squad by 2-1.<br />\nWestern Maryland scored in the<br />\nsecond period, but the Jays tied<br />\nthe score 1-1 as Wes Bachur scored<br />\nwith an assist from Roger Purdon.<br />\nThe winning goal was scored by<br />\nRandy Miller on a penalty kick in<br />\nthe third quarter.<br />\nOn Veteran's Day, November<br />\n11, for the first time. in twenty<br />\nyears, the Jays beat Drexel by a<br />\nscore of 3-1. Drexel had earlier<br />\nbeaten Middle Atlantic Conference<br />\npower Haverford 3-0 and had tied<br />\nPenn, 2-2.<br />\nThe Jay's initial goal was scored<br />\nin the first period by Dave Roberts with an assist from Art Guerin.<br />\nThere was no further scoring until<br /><br />\nthe fourth period. Bill Nhari tallied<br />\nDrexel's lone goal, while Ken Niman had an unassisted goal, and<br />\nArt Guerin scored with an assist<br />\nfrom Greg Sarav.<br />\nTuesday's win was Hopkins'<br />\nthird in a row, their fourth in the<br />\nlast five, and fifth in the last seven<br />\ngames. The team's overall record is<br />\n6-4, 5-2 in the Middle Atlantic<br />\nConference, and 3-2 in the MasonDixon Conference. The Jays are<br />\ntied for third place in the Northern Division of the Mason-Dixon<br />\nConference.<br />\nThe season's finale will be enacted on Saturday, November 18,<br />\nat 11:00 a.m. at Homewood. They<br />\nwill host Dickinson, whose Conference record is 6-2-2, compared to<br />\nHopkins'5-2. This game will determine third place in the Southern<br />\nDivision of the Middle Atlantic<br />\nConference.<br /><br />\nOnce again the screen<br />\nexplodes with rage and passion<br />\nand greatness!<br />\n\"A LUSTY, BOLDLY PROVOCATIVE FILM\" LIFE Magazine<br /><br />\n13uirroCHAI<br /><br />\nR<br />\n0tfoRI PETER<br /><br />\nas Becket<br /><br />\nas His King<br /><br />\no you buy<br />\nashirt<br />\noralabel?<br />\nYou buy both, if you're<br />\nsmart. Because a good label<br />\nmeans a good shirt. A shirt<br />\nthat's styled to last. With<br />\nrolls, pleats and tapers in<br />\nthe right places. And a wide<br />\nenough selection of colors so<br />\nyou don't have to buy the<br /><br />\nsame shade twice.<br />\nThis Arrow \"Cum Laude\"<br />\nOxford has all the things a<br />\ngood label means. Buttondown roll collar with a soft<br />\nflare. Tapered waist.<br />\nPerma-lron so it won't<br /><br />\nwrinkle.'Sanforized -Plus.\"<br />\nAnd it comes in blue, pinks,<br />\nstripes, etc., etc., for $7.00.<br />\nSo, if you want a good<br />\nshirt, look for a good label.<br />\nAnd if you want the best<br />\nlabel, buy a shirt made<br />\nby Arrow.<br /><br />\nwaH JOHN GIELGUD- DONALD VOLHT MARIO MUNI- PAMELA BROWN<br />\nDIRECTED BY<br /><br />\nBIEDMRD AMU<br />\nPETER GLENVILLE<br />\nHAN ANOUILII<br />\nSCREENPLAY<br /><br />\nBASED ON THE PLAY 'BECKET' BY<br /><br />\nSCHEDULPIA<br /><br />\nPERFORMANCES<br /><br />\n10<br />\n1-sem/E041 1VE 7— 19561<br />\n/North at Charles<br /><br />\nat 2, 5:15, 8:30<br /><br />\nNO SEATS RESERVED<br /><br />\ndneing I CI 2 — 2256i<br /><br />\nin yorkridgeshp.ctr:<br />\n1 mile North of Beltway<br />\nLutherville Exit 26<br /><br />\nfiRZN<br /><br />\nEvery Ticket Holder Guaranteed A Seat<br /><br />"}], "field_media_file": [{"target_id": 40252, "display": null, "description": null, "target_type": "file", "target_uuid": "644b238c-8bbe-4aaa-9729-5d227bc17b1f", "url": "http://digital.library.jhu.edu/system/files/2022-03/13940-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13940, "target_type": "node", "target_uuid": "f54e51f9-424c-4aa3-b5e3-5d88a461b14b", "url": "/node/13940"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "7e74a9b7-c67c-47d1-b64f-8960eb8e2691"}]}