{"mid": [{"value": 40312}], "uuid": [{"value": "44a502bc-0f99-44ff-bfbd-e9ded183a4cc"}], "vid": [{"value": 40312}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:03:00+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14350-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:03:00+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:03:00+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "'Tis<br />\n<br />\nA gREAT<br />\n<br />\ndAy<br />\n<br />\nTO bE 111141<br />\nby SEAN MACCONSAWIN<br />\n<br />\nEvery St. Patrick's day, there is always someone who wants to know<br />\nWhy it is that the Irish have a day all unto themselves, why it is that the<br />\nIrish deserve a day. To the average American, Ireland is a picturesque little<br />\nisland where the people spend their time getting drunk, speaking with odd'<br />\naccents, and talking about funny soap with green specks in it.<br />\nFew realize the actual historical and cultural importance of Ireland. For<br />\nexample, very few know that between the fall of the Roman Empire and<br />\ntile rise of culture in Renaissance Italy, it was Ireland that kept the lamps<br />\nk)-1: learning lit in Europe. Fewer still would even believe that it was the<br />\nIrish who introduced divining to poetry. And even those aware of<br />\nIreland's recent literaiv import are not fully aware of Irchind's literary<br />\nheritage.<br />\nTo begin with, St. Patrick was not important to just Ireland, he was<br />\nimportant to the whole of Northern Europe. The conversion of Ireland led<br />\niirectly to the conversion of :the rest of Northern Europe, as Ireland<br />\nbecame an important point for sending out missionaries. To give sonic<br />\nIdea of how many missionaries Ireland sent out, the Schedae de islandia of<br />\nAra Multiscilus list 150 Irish saints who were sent to Germany, 45 to<br />\nGaul, 30 to Belgium, 44 to England. 13 to Italy, and 8 to Norway and<br />\nIceland. In addition to this, there were over one hundred monasteries<br />\noun ded outside of Ireland by these mission iries .Iii i strong sense, St.<br />\nPatrick's cLiy celebNites the introduction of Christitnity to most of<br />\nNorthern Europe.<br />\nAnother reason for ikt hcans to be enthusiastic about St. Patrick's<br />\nDay is that there is reasonable evidence to support the theory that<br />\nAmeriCa was visitie&by St. Brendan is early as the cigth century AD.<br />\nThere is a tradition iliong the northmcn, that is, the Vikings and their<br />\nt.lan Vineland, which<br />\ndescendants,-t- hat tlotiWaS a region farther SouthI<br />\nthey called irlaod cI inikla (Ireland the great). There is also a<br />\ncorresponding tradition among American Indians.<br />\nSimultaneously, Ireland maintained what were amost the only schools<br />\nin Europe which dealt with Classic Literature. One need only point to the<br />\nBook of Kells ;Is an example of the mere craftsmanship of Ireland's<br />\nAbbeys. This book, which is considered by many to be the finest example<br />\nof illuminated manuscripts in existence, probably dates back to the eigth •<br />\ncentury: what in Europe from that period could equal it?<br />\nIrish scholarship from the eighth to the tenth centuries was supreme ill<br />\nEurope. During thi.s period, anyone North of central Italy who read Greek<br />\nWas either Irish or taught by one, Towns such as Aix, Tours, Marseilles,::<br />\nSalzburg and St. Gall are heavily indebted to the Irish for their cultural<br />\norigins -- in fact. the Irish Missionaries responsible for theowns arc tihi<br />\nmentioned in those towns' benediction rites.<br />\nIn iddition, the indigenous Celtic liteniture Uftt e an has been classed<br />\neqwil to thtl\"lifq121-e- Greeks. Although only<br />\ny many scholars<br />\nrecently recognized, the ancient sagas carry as strong a sense of character<br />\nand insight into the human condition as any of the Greek myths, and<br />\ncertainly more than the Norse sagas. Perhaps the best modern examples of<br />\nthe eloquence of Irish mythology are Yeats' poems based on them.<br />\nIt was this Celtic literature which 'also introduced the concept of<br />\n<br />\nrhymed verse to literature. Perhaps because of the inherent musical sense<br />\nof the Irish, perhaps because of the exquisite fluidity and expressiveness<br />\n.of Gaelic, the Celtic poets in Ireland were employing an advanced form of<br />\nrhymed verse as early.: as the eighth century, when the first Arabic<br />\nexamples appeared.<br />\nWhat then happened to the Irish? How it that a nation so proud, so<br />\npowerful could be so fallen, so weak? One may be tempted to point out<br />\nthat neither Greece, Rome, Israel or Italy are major powers at present,<br />\neven though they were at one time the centers of the world's civilization.<br />\nBut an analogy is not an acceptable explanation.<br />\nTo be blunt, what happened to Ireland was England.<br />\nIt would be pointless to fully trace the history of Irish subjugation by<br />\nthe English: for our purposes let us start with Oliver Cromwell. Cromwell,<br />\nLord Protector of England, protestant despot and murderer of Charles I.<br />\ndid not take kindly to the fact that most of Ireland was Catholk. It was<br />\nnot enough for him that most of Ireland's land had been given over to<br />\nEnglishmen as political plums (e.g., Sir Walter Raleigh, who introduced<br />\nthe potato to Ireland). It was not enough that an Irishman was not<br />\nallowed to own a horse not worth more than six pence.<br />\nCromwell was fond of such things as laying siege to Irish towns, and<br />\nslaughtering Irish Catholics, \"in the name of God.\" Cromwell was fond of<br />\nselling Irish women and children into slavery.<br />\nThings got worse. In a 'fight for the British crown, all of Ireland except<br />\nthe predominantly Protestant Ulster backed Otholic James: unfortunately,<br />\nthe Protestant William of Orange was victorious. Here is where the<br />\nprevious rivalry between Ulster and the rest of Ireland grew into a full<br />\nscale hatred. The Battle of the Boyne in 1,00, which was not the major<br />\nmilitary engagement of the war, still holds.'' rific emotional significance<br />\nfor Irishmen, symbolizing is it does Irchind last hope for parity with<br />\nCatholic England.<br />\nAnother shot at independence rose gloriously on Ireland's political<br />\nhorizon with the coining of Parnell, but even there, Ireland was met with a<br />\nfailure. Parnell, a gifted politician and even gifted orator, is considered<br />\ntoday to have been the only man capable of brining about a peaceful<br />\nindependence, but his disgrace through his illicit affair with Kitty O'Shea<br />\nproved fatal politically.<br />\nFinally in 1916, Ireland gained her self respect, and in 1918, her<br />\nindependence. Yet after almost eight hundred years of progressive English<br />\nsubjugation, Ireland is not a world power by any means.<br />\nNone the less, Ireland's contributions have been immense. In the field<br />\nof writing, most of the great English language writers of the past eighty,<br />\nyears have been Irish. One is hardprcssed to think of greater writers, poets,<br />\nor dramatists than William Bader Yeats, lames Joyce, George Bernard<br />\nShaw, Samuel Beckettt, Oscar Wilde or Brendan Behan. In fact, one is<br />\nrather hardpressed to think of an English-born• writer of the period of<br />\neqiuil status.<br />\nHere in America, though, the average Irilbinan is characterized as a<br />\nil, and eager to kill people<br />\n'<br />\nheavy drinking Catholic, who is poor, boastril<br />\nover some stupid religious difference. Because it is common to read how<br />\nmany people have been killed in the last three years of sectarian strife in<br />\nNorthern Ireland it is easy to be oblivious of the fact that more people<br />\nhave been killed in civil disturbances in Jamaica than Northern Ireland<br />\nduring the same period of time, and that the Christian vs. Moslem war in<br />\nLebanon has claimed more lives in a year than violence in Northern<br />\nIreland has in the last five. Nor do most people realize that the society in<br />\nNorthern Ireland is structured against Catholics as solidly as Mississippi<br />\nwas structured against blacks in the fifties.<br />\nRather than think of the Irish as drunkards, blowing up whatever they<br />\ncan, think of them as a people dispossessed of the homeland. Better still,think of them as the much abused, oft-forgotten cornerstone of modern<br />\nEurope. •<br />\n<br />\n\fpage 2/news-letter/march 18, 1977.<br />\n<br />\nCongresswoman Shirley Chisholm:<br />\nFull of outrage and sorrow<br />\n<br />\nBy MIKE GIULIANO<br />\nShirley Chisholm, the first black congresswoman in<br />\nAmerica, represents a New York district which includes<br />\nBedford-Stuyesant, one of the nation's largest ghettoes.<br />\nThe 52-year-old Chisholm became a national political<br />\nfigure in 1972 when she made a presidential bid and<br />\nreceived 152 delegate votes. Speaking March 9 at the<br />\nCollege of Notre Dame on the topic \"Women and Work in<br />\nAmerica: Then and Now,\" Mrs. Chisholm displayed an<br />\nintense awareness of \"the unwillingness of our society to<br />\nallow women to share in the American dream.\"<br />\nThere is a pattern to American history, contended<br />\nChisholm, which explains how we 'arrived at a<br />\ndiscriminatory system of laws. Early colonial laws were<br />\nbased on English common law, in which women were<br />\nproperty, and early American legal documents were much<br />\nthe same: \"The Constitution and the Bill of Rights were<br />\nwritten by and for men.- In American history books<br />\nthere is little mention of women, those who played<br />\ncrucial roles in the growth of the West and of cities.<br />\nChisholm traced the ways in which discriminatory work<br />\npractices, like many American history books, have made<br />\nsecond class citizens of women: \"Since work is a source<br />\n<br />\nof fulfillment and success, discrimination on the basis of<br />\nsex deprives women of one basic way to success.- Women<br />\nwere discouraged from working, were encouraged to stay<br />\nhome: Indeed, a woman interested in physical labor was a<br />\nsocial outcast.<br />\n\"Women had entered into the labor force at times<br />\nwhen the economy demanded it. [In World War Two]<br />\nwomen were welcomed into the factories and assembly<br />\nlines to produce nitions for war.\" But, when the war was<br />\nover, after women had proven their capacities, they were<br />\nsummarily pushed aside. It was no longer acceptable for<br />\nwomen to work, and many who wanted to work were<br />\nconsidered unpatriotic, because they deprived returning<br />\nsoldiers of jobs. \"That pattern has been reinforced in<br />\nevery aspect of our society.\"<br />\nChisholm compared the feminist movement of today<br />\nwith the Civil Rights movement of the 1950's and 1960's,<br />\nwhen large numbers of women, black and white,<br />\ndemanded equal rights for blacks. \"Out of this struggle we<br />\nput laws on the books. In doing so the federal government<br />\nhelped to end discrimination by race...Many women who<br />\nhad marched in Selma began to realize that discrimination<br />\non the basis of sex was just as dehumanizing, just as<br />\ndemoralizing, as discrimination on the basis of the color<br />\n<br />\nAn open<br />\nktter to<br />\nMartin<br />\nMandel<br />\n<br />\nDar Marvin:<br />\nWhen St. Patrick expelled tile snakes from Ireland, a<br />\nfew good swimmers in the lot widoubtedly made their.<br />\n.way to Maryland. But I am not writing this letter merely<br />\nto inform you of my successful search for the roots of<br />\nyour family. Rather, I am impelled t9 ask you, as a man<br />\nwho owes his livelihood and reputation (such as it is) to<br />\nthe Democratic Party, how you could be so disloyal and.<br />\ninconsiderate to the members of that party as to award a<br />\nlucrative and prestigious seat in the House of Delegates to •<br />\na heathen Republican? Or is your memory as short as you<br />\nare?<br />\nIn the many years of our mutually profitable.<br />\nassociation, there have been a few surprises on both sides,<br />\nto be sure. But I had never figured you for a traitor to<br />\nthat great party which has enabled us to feed so fully and<br />\nso well from that richest of all larders: the public trough.'<br />\nEven if no qualified candidate could be found for the seat•<br />\n(as was certainly not the case, for I am reminded of the.<br />\ncontrary state of affairs every time I look in the mirror),<br />\nit would have been an easy thing to fill the post with a,<br />\n<br />\npossible.<br />\nIn the federal government, Chisholm is disturbed by<br />\nthe fact that in a country where half of the population is<br />\nfemale , there are 19 women members of a 435 member<br />\nCongress. Chisholm feels, however, that \"the President is<br />\nmoving in the right direction. You will see [in the Carter<br />\nadministration] the greatest number of women that have<br />\never been selected in any administration of this country.<br />\nHe didn't put enough women on the top level, but at least<br />\nit's a beginning.<br />\n\"When I was making a bid for president I wanted a<br />\nmultifaceted cabinet, because that's America.\" Chisholm<br />\nstated to one of her opponents[left unnamed], that she<br />\nwanted Indians, women, and Blacks in her cabinet, to<br />\nwhich he replied: \"They aren't qualified.\" At that very<br />\nmoment she had three Indians, all with Ph.D.s. all<br />\nexperienced and intelligent women under consideration<br />\nfor Secretary of the Interior. Chisholm went and did some •<br />\nresearch, looked into the qualifications and records of<br />\nsome of the men who have been put into that office in<br />\nthis century, and one need hardly add that 'she was not<br />\nuplifted by what she found.<br />\nShirley Chisholm was full of outrage and sorrow<br />\nbecause of the \"tremendous waste of physical and<br />\npsychical energy that could be given to ameliorate<br />\nhumanity. It is time, past time, that women be accepted<br />\non the political force and the labor force of this nation.\"<br />\n<br />\nV-P Benton<br />\nresigns<br />\n<br />\nloyal party hack. If anonymity had indeed been the<br />\nprime<br />\nqualification for the job, surely a cursory search of your<br />\nChristmas card list would have elicited a plethora<br />\nof<br />\nunknowns, has-beens, and Ne'er-to-be's, any one of whom<br />\nwould have made a splendid delegate. But instead<br />\nIn a mimeographed letter to colleagues in the<br />\nof<br />\ntaking the sane course of action, Marvin, you in<br />\nAdministration and Faculty, Dr. George S. Benton<br />\nyour<br />\ninfinite wisdom chose to spit in the face of every<br />\nresigned his post as Vice -President for the Homewood<br />\nDemocrat in the state of Maryland. I am taking<br />\nDivisions, effective July 1. Citing a desire to resume<br />\nthis<br />\nopportunity to salute you for this daring(though lunatic) teaching and devote more time to \" national science<br />\nact and to urge you, since you are so fond of Republi<br />\npolicy' Beottin went on to express his belief that many<br />\ncans<br />\nof a sudden, to ask Jerry Ford to head up your defense<br />\nof his goals as Vice-President had been accomplished, such<br />\nfund.<br />\nas the reorganization of the library and the creation of<br />\nTo come to the point, Marvin you crud, why didn't<br />\nstudent services.<br />\nyou give me the job? Dammit, I earned the bloody seat!<br />\nDr. Benton will return to his post as Professor in the<br />\nWho bought 15 drinks at your last victory party? At<br />\nDepartm<br />\nent of Earth and Planetary Sciences, with joint<br />\ntwo<br />\nbucks a shot for watered-down Pride of Baltimore<br />\nappointment in the Department of Mechanic'a and<br />\nbourbon? Who persuaded the Pallottines to shell out<br />\nMaterials Science. Before returning, he Will take a<br />\nfor<br />\nyou when you were hurting? Who spread<br />\nthe \"long-delayed sabbatical \".<br />\nwalking-around money throughout Hampden, so thick<br />\nAs the first step toward administrative reorganization<br />\nthat you could skate on it? Who got out<br />\nthen newly-installed President Muller, Benton was<br />\nby<br />\nthe<br />\nSheppard-Pratt vote for you to put your ticket over<br />\nappointed Vice-President of the Homewood Divisions in<br />\nthe<br />\ntop in Towson?<br />\nMarch 1972. Dr. Benton had responsibility for all<br />\noperations on the Homewood campus, as well as for<br />\nYou knew I was hungry. You knew I needed the gig.<br />\nproviding liason with the School of Advanced<br />\nHow could you do this to me? Now that you're a big-shot<br />\nInternational Studies in Washington, D.C.<br />\nin Annapolis, is it too much to throw a crumb to your old<br />\n410••••••••••••••••••<br />\nfriends at the two-dollar window?<br />\nThe lakes of Killarney could not hold the tears of •<br />\n•<br />\n1. Toward an ethical society<br />\nsorrow you're to be crying once revenge is taken for your •<br />\n2. Television and society: the •<br />\nmonstrous act of betrayal. There is a jury that cannot be •<br />\nworld in 21 inches (diagonally)I<br />\nfixed, a jury for whom the only just verdict has already<br />\n0<br />\nu<br />\n)<br />\n3.<br />\nNature<br />\nis a hanging judge<br />\nn_<br />\n•<br />\n•<br />\nbeen decided upon. The jury of the party faithful finds<br />\nwo4.<br />\nThe<br />\nnature<br />\nof power<br />\nW<br />\n>- 0 5. The<br />\n•<br />\nyou guilty of treason and sentences you, excommunicate<br />\ndirection of our future<br />\n•<br />\nthat you are, to live with yourself. Some scoundrels just •<br />\n6. America the leader?<br />\n•<br />\nmight be able to so, you know?<br />\n7. Future world<br />\nTimothy P. Monaghan ••••••••••••••••••<br />\n•<br />\nPC<br />\n<br />\nN4 pRofik<br />\n<br />\nof one's skin.<br />\n\"There are thousands of women who have economic<br />\nand psychological needs to work. More women need to<br />\nwork today than ever before.\" As nearly half of our<br />\nmarriages are ending in divorce, \"the number of women<br />\nwho head households is increasing.\" One in every seven<br />\nchildren in this Country is raised in a family where the<br />\nfather is absent. In the last decade alone the number of<br />\nsingle parent households has risen 60%. The Urban<br />\nInstitute reports that 48% of American families headed by<br />\nwomen have incomes which. fall below the poverty level.<br />\nThese women, according to Chisholm, are either<br />\nunemployed or underemployed, and there is not an<br />\nadequate system of day care centers for their children.<br />\nMiddle class women often need to supplement family<br />\nincomes, because of inflation and because the costs of<br />\nmaintaining a home have skyrocketed, while wage<br />\nbenefits have not been adequately raised. These women<br />\nneed to work and are not working for pin money.<br />\nEducated women are not exempt from discriminatory<br />\npractices on the job market. \"It doesn't make sense for<br />\nyou to go to college and suddenly find that you have to<br />\nput all this on a shelf, because of the social conditions in<br />\nthis society.\" Several of Chisholm's rich, well-educated,<br />\nwomen friends get psychiatric assistance, pay $100 a<br />\nsession for someone to tell them what's needed, when the<br />\nproblem is so obvious, when women, nearly 40% of whom<br />\nare working, consistently find that there are gaps between<br />\nwhat they earn and what men earn. The House Education<br />\nand Labor Committee, of which Chisholm is a member,<br />\nreported that 25% of working women are either<br />\nelementary school teachers, bookkeepers, waitresses, or<br />\nsecretaries, all of which positions \"provide subsistence<br />\nwages and no upward mobility.\"<br />\nIn addition to her support for the Equal Rights<br />\nAmendment, Chisholm has been devoting much time to<br />\nDay Care Legislation. \"Women want to be productive<br />\ncitizens like anyone else, but won't be unless they feel<br />\ntheir children are being cared for.\" She proposes the<br />\nnationalization of day care centers. These centers would<br />\nbe more than babysitters and places to dump children. No<br />\nwoman who has children should work a forty hour week<br />\nunless she can have some assurance of child security.<br />\nMany women stay at home and receive public assistance<br />\nprecisely because there are not enough day care centers.<br />\nSome people criticize such women, saying: \"They don't<br />\nwant, to work; they want wel are,\" but Chisholm.asserts:<br />\n\"Every person basically want to feel a part of society as a<br />\nproductive citizen, five fifth of a man, not three fifths.\"<br />\nShe recognizes the need for omen to stay home and care<br />\nfor young children [\"Comir , with the child is a necessity<br />\nfor nurturing.\"], but this is not always economiCally<br />\n<br />\n\fmarch 18 1977/news-letter/page 3<br />\n<br />\nSpud( OUT TO ThE<br />\n<br />\nElection Results<br />\nHomewood (Special)--After a tense three-day flurry at<br />\ncampus polls, the Hopkins Tabulations Headquarters<br />\nannounced Wednesday night the winners in the annual<br />\nStudent Council elections. An unusually large turnout for<br />\nthe voting—almost one-half the student body—was<br />\nvariously attributed to the warm weather, the concern<br />\nover administration maneuverings, and the mistaking of<br />\nballot boxes for kleenex dispensers.<br />\nIn the Presidential race, a five-person struggle was pared<br />\nto a two-man runoff. Stu Davidson, a sophomore who has<br />\nbeen characterized as \"an intellectual Ralph Kramden,\"<br />\nmoved one step closer to \"the big time, Alice!\", as did<br />\nJunior David Chesanow. The latter, however, faces almost<br />\na two-hundred vote deficit to be made up in the finals<br />\n(trailing Davidson in the preliminaries, 382 to 193).<br />\nLeft in the canipaign lurch were Brad Stark, Gary<br />\nStahl, and Bunny Howard. The two remaining candidates<br />\nmay have to barter for their important blocs of votes to<br />\ngain the top spot, as primary losers can often spell trouble<br />\nfor the victors (cf. Ronald Reagan, How to Leave Your<br />\nOPponent Thirty Points Down on Some Godforsaken Ski<br />\nSlope).<br />\nThe Vice-Presidential contest came down to the wire,<br />\nas Randy Randazzo edged out the other half of the<br />\nChesanow ticket, Andy Albstein, 401-380. Promotional<br />\nagents for Fleetwood Mac, Dave Mason, and Jackie Wilson<br />\nare standing by. Pat Gatling became the new Student<br />\n•Council Secretary, swamping her opponent Bryan Stamm<br />\n524-172.<br />\nFor the final position in the yearly SC quartet, one<br />\ncontendor was eliminated and the other two slated for a<br />\nrun-off next week. The odd man o it was Dave Lewing<br />\n(by a ,mere eight votes), who was immediately claimed on<br />\nwaivers by the Toronto Blue Jays, Hopkins' parent team.<br />\nMeanwhile, primary leader Val Fein (320 votes) and<br />\nrwiner-up Neal Pilzer (244) gird themselves for another<br />\ngrueling campaign week, like their Presidential<br />\ncounterparts. Outgoing two-term Treasurer Ron Bialek<br />\nPlans to retire to La Crosse, Wisconsin, where he will<br />\nsupervise the activities of the Police Athletic League and<br />\nhandle the women's sports desk for the La Crosse Check.<br />\nWhile this week's election fervor died down, a related<br />\nPolitical incident heated up Wednesday afternoon. A<br />\nsizable crowd (estimated in the thirties) gathered in front<br />\nof Homewood House to protest the decision by the<br />\nCommittee on Undergraduate Studies to drop the present<br />\ncredited form of Intersession.<br />\nThe protestors, served Schaefer beer by the Protest<br />\nSocial Committee, found only two of their number<br />\nallowed to enter Homewood House to talk to the Deans.<br />\nThe pair—Andy Davis and Sheldon Himmelfarb—entered<br />\nthe administrative enclave as the demonstrators kept an<br />\nangry vigil outdoors. They returned a short time later,<br />\narmed with mimeographed statements drawn up by Dean<br />\nSuskind and approved by Dean Owen.<br />\nThe double-Dean, memo listed three points (in all<br />\ncapital letters): that the Dean's Office didn't particularly<br />\ncare what happened to Intersesion, that it was the CUS<br />\nboard--a faculty organization--that had made the decision,<br />\nand that students should address their grievances to and<br />\nhaggle with faculty members, not the Dean of the Faculty<br />\nof Arts and Sciences or the Dean of Undergraduate and<br />\nGraduate Studies, who should be left pleasantly alone in<br />\nthe renovating Homewood House.<br />\nWith the release of the statement, the crowd quickly<br />\ndispersed. Students walked away wondering where to<br />\ncarry the protest next, and probably mulling over to<br />\nWhom the burden would be passed that night. Such a<br />\ndecision will be made this coming week.<br />\noly p.<br />\n<br />\nBy S.C. HAQUES<br />\nIn an exclusive interview with the News-Letter, S.C. Presidential candidate David Chesanow announced<br />\nhis intention to seek a reduction in campus movie prices, and promised to get kegs of beer in the quad on<br />\nsunny days.<br />\nChesanow expressed his hope that many of the students who did not vote in the primary would vote the<br />\nsecond time around. He cited undergraduate disgust with\" big time\" politics, such as those exhibited by his<br />\nrun-off opponent, Stuart Davidson. The young artist felt the voters should know that he spent only fifteen<br />\ndollars on his campiagn.<br />\nDavidson was unavailable for comment, the word being that he was in Annapolis, lobbying against the<br />\nraising of the drinking age.<br />\nWhile Davidson has called the fight against the calendar change a success, Chesanow characterized it as\" a<br />\nfrantic and desperate attempt in self-defense,\"where the S.C. never received any written guarantee that it<br />\nwould not be done at another time. He questioned calling a short run accomplishment a\" triumph.\"<br />\nChesanow stated that the most important issue facing the University was the involvement with regimes<br />\nwhich have abrogated human rights.\" There is nothing more pressing than that,\" said the candidate.\" We're<br />\nobligated to become involved as human beings, if not as students.\"Chesanow admitted that student strikes<br />\nmight be one method for protesting in this case.<br />\nBoth candidates have expressed their concern in the past that the News- Letter did not contain enough<br />\ncampus news. Chesanow clarified his stand by explaining that the relationship between the N-L and the<br />\nCouncil\" has to remain a critical one for the benefit of the readers.\" He went on to say that the lack of SC<br />\nnews was probably due to the decline of the council itself, which Chesanow sees as a\"jOke.\"<br />\n<br />\nLOOK,WERE NOT GOING<br />\nTO STAND FOR YOUR<br />\nj<br />\nHUMAN RIGHTS VIOLATION<br />\n............-<br />\n<br />\nMARGULIES<br />\nROT110)<br />\n<br />\nAND<br />\nTHAT<br />\nGoES FoR<br />\nYoU<br />\nTOO!<br />\ne_d<br />\n<br />\nFBI stalls on Letelier probe<br />\nBy RUSS SMITH<br />\nWashington, D.0<br />\n\"We're getting to the end of our rope. We've<br />\ncooperated with the FBI, we've kept from publicly<br />\ncriticizing the FBI, but we're not further along in the<br />\ninvestigation now than we were six months ago.\"-Michael<br />\nMoffitt<br />\nMichael Moffitt is an angry young man and there's a<br />\ngood reason why. It's been over six months now since<br />\nMoffitt's wife Ronni and former Chilean ambassador<br />\nOrlando Letelier were assassinated on Washington's<br />\nEmbassy Row. Over six months and still the FBI has<br />\nfailed to capture their killers.<br />\nAnd it's not as if the FBI is short on leads. In fact,<br />\nMoffitt and his co-workers at the Institute for Policy<br />\nStudies [IPS] have provided investigators with the names<br />\nand addresses of the men they say planted the bomb in<br />\nLetelier's car last September.<br />\n\"We have evidence that the assassination was ordered<br />\nby DINA [Chile's secret police] and carried out by six<br />\nCuban ex`iles, all veteran terrorists, who are now living in<br />\nFlorida,\" claims Moffitt. The FBI has been given this<br />\ninformation but refuses to act on it, looking instead for<br />\nnon-political motives for the killings. The most frustrating<br />\npart, says Moffitt, is that the FBI knows that IPS is right<br />\nbut still won't do anything.<br />\nA possible key link in the case is Orlando Bosch, a<br />\nterrorist with DINA affiliations, who is now in jail in<br />\nVenezuela. Moffitt believes that Bosch could let go with<br />\nsome valuable talk if only the FBI would make the effort.<br />\n\"We've been told time and time again that they're<br />\nready to move on the case, and now they say they're<br />\nstymied. Does someone else have to get their head blown<br />\noff to show the FBI that DINA isn't kidding around?\"<br />\nMoffitt commented. Failing immediate action from the<br />\nFBI, IPS may call for a special congressional investigation<br />\ninto the murders, although considering Congress' track<br />\nrecord on that score, not many are optimistic about the<br />\nresults of such an investigation.<br />\n\"This assassination is a direct outgrowth of U.S. foreign<br />\n<br />\npolicy since World War II. The CIA has been trying to<br />\ndestroy progressive movements in Third World countries<br />\ncommitted to social change for years now,\" Moffitt said.<br />\nThe people of Chile join those of Iran, Brazil, Vietnam<br />\nand a host of other countries who have been savagely<br />\nvictimized by American imperialism since World War II.<br />\nIt's no secret that a public airing of this murder probe<br />\nwould do little to bolster the flagging image of the CIA<br />\nmainly because of its close ties with DINA and other<br />\nforeign secret police netwprds. Exactly what the Cia role<br />\nin the Letelier assassination is remains unclear, but<br />\naccording to Moffitt, \"It's inconceivable that foreign<br />\npolice are carrying out illegal activities in the United<br />\nStates without the CIA knowing about them.\" It's also no<br />\nsecret that the Cuban gunmen were CIA-trained. So, it's<br />\nnot hard to figure out why the FBI is dragging its feet on<br />\nthe investigation.<br />\nAnd there's no indication that this terrorism will stop.<br />\n\"A person I know is said to be on DINA's hit list, he's<br />\nbeen harrassed and followed, but we still can't get police<br />\nprotection for him or any other Chilean,\" stated Moffitt.<br />\nRelations between the United States and Chile are<br />\nbound to be less friendly during Jimmy Carter's<br />\nadministration, but whether the Chilean Junta is given a<br />\nwrist-slapping or is dealt with morel severely remains to be<br />\nseen. Moffitt's unsure about Carter's position , saying<br />\n\"It's another case of him promising something during the<br />\ncampaign and not knowing whether he'll act on it.\"<br />\nMoffitt added that the Chilean government was<br />\ndisappointed when Carter nosed out Ford last November<br />\nbecause they think he's \"too dangerous\" and \"too far to<br />\nthe left.\"<br />\nMeanwhile, DINA agents are busier than ever, stalking<br />\naround Washington,. checking out campuses, tracking<br />\ndown and harrassing: Chileans disloyal to the Junta. Since<br />\nAllende's overthrow'in 1973, there's been an attacklon a<br />\nprominent Allende minister,every September. \"They'll<br />\nprobably get somame next fall,\"says Abffitt. \"if not bePre.\"<br />\n-C1<br />\n<br />\n\fpage 4/news-letter/march 18, 1977'<br />\n<br />\nThe First Breeze ofSummer'is not a<br />\ngreat play. It is, however, a good play and<br />\nis given a fine production by Center<br />\nStage. Perhaps these adjectives seem<br />\nnebulous and indicate a certain<br />\nambivalence on the part of the reviewer.<br />\nMy job is particularly difficult because, as<br />\na theatre lover, I feel compelled to tell all<br />\nthe would-be theatre patrons to rush out<br />\nand support Center Stage. God knows,<br />\nanything resembling sophistication is<br />\nbadly needed in Baltimore, and I find it<br />\ntruly amazing that Center Stage, although<br />\nstill desperate for financial support, has<br />\ndone as well as it has. Also, I must admit<br />\nthat there are many things about First<br />\nBreeze that should be praised.<br />\nIt is atrocious for a city like Baltimore,<br />\nwhich has such a large black population,<br />\nto have no visible signs of black theatre.<br />\nThe selection of First Breeze,<br />\nwonderfully representative of black<br />\ntheatre, is to be praised as an attempt to<br />\nright this wrong.<br />\nAside from the few celebrities who can<br />\nbe seen at the Mechanic, Baltimore is<br />\nlittle acquainted with big names, so<br />\nCenter Stage has pulled off quite a coup<br />\nby getting the great Claudia McNeil, best<br />\nremembered as the original, Momma in A<br />\nRaisin in the Sun, for the centralcharacter in the present production. This<br />\nis doubly gratifying because many local<br />\nactors are given a chance to work with<br />\nsuch a talented performer.<br />\nIt is refreshing, too, to see a<br />\nlittle-known, yet promising playwright,<br />\nlike Leslie Lee, given a showcase for his<br />\ntalent. It is also good to see that someone<br />\nother than Stan Wojewodski, in this case<br />\nWoodie King, Jr., is directing at Center<br />\nStage.<br />\nBut there are, as well, the less than<br />\npraiseworthy points.<br />\nMiss McNeil, because of the structure<br />\nof the play, is not given enough to do,<br />\nand when the play loses its way, as it<br />\noften does, she is powerless to set it<br />\nstraight:<br />\nAs I previously said, it is gratifying to<br />\nsee a new playwright at work, but since<br />\nMr. Lee is a new playwright, he has not<br />\nfully mastered his craft and the audience<br />\nmust be forewarned of some dry patches<br />\non the way.<br />\nHis play deals with Gremmar (Miss<br />\nMcNeil) in the present with her family<br />\nand, through flashbacks, the young<br />\nGremmar -- then called Lucretia<br />\n(Elizabeth Van Dyke) -- and the past<br />\nevents that shaped her into what she is.<br />\nWe see Lucretia with her first lover, Sam<br />\n<br />\nDavis Hall and Elizabeth van Dyke appear in a scene from \"The First Breeze ofSummer\"<br />\nby Leslie Lee; now through April 10.<br />\nGreen (Tommy Hicks), who stood up for<br />\nup through the use of these flashbacks.<br />\nMost of the other actors are top notch.<br />\na friend out of disgust over the treatment<br />\nBut this is just where the drama fails.<br />\nPeter Wise and'Ronny Claton are fine as<br />\nof the black man only to be struck down;<br />\nPerhaps a lot of blame must go to the<br />\nLou and his .brother Nate, and Barney<br />\nLucretia's affair with a stereotypical,<br />\ndirector, but certainly much must be<br />\nCohen, a local. actor sometimes involved<br />\nwhite, poor little rich boy (Davis Hall):<br />\nshared by Mr. Lee.<br />\nwith Theatre Hopkins, is excellent in:a<br />\nher turning to prostitution at the end of<br />\nAll of the flashbacks take place in what<br />\nsmall part as he exemplifies that one of<br />\nthe affair; and her ruination of Harper<br />\nis Gremmar's present bedroom; we see<br />\nthe keys to good acting is detail. Special<br />\nEdwards (William Jay) who had had<br />\nGremmar reminiscing as the scenes of her.<br />\nmention must also be made of Dorthi<br />\naspirations of becoming a minister. The<br />\nyouth are played out by Lucretia and<br />\nFox, a professional comedienne, who<br />\ndrama ensues when Gremmar's grandson,<br />\neach one of the lovers. The problem is<br />\nadds just the right humor to Aunt Edna.<br />\nLou Edwards (Peter Wise) is provoked<br />\nthat watching Miss McNeil reflect on<br />\nthe daughter whose father was white.<br />\ninto attacking his grandmother after he<br />\nGremmar's youth, fondle the costume<br />\nTechnically, the show was<br />\nlearns that his Aunt Edna (Dorthi Fox)<br />\npearls that her first lover, Sam Green,<br />\nunimpressive. Although the costumes<br />\nwas the product of the affair with the<br />\ngave her and which she still wears, is<br />\nwere fine, the set was perhaps<br />\nwhite rich boy.<br />\ninfinitely more interesting than what is<br />\nunnecessarily overdone, and one pice. a<br />\nhappening in the bedroom. The flashback<br />\nlarge tree protruding from upstage left,<br />\nscenes are overlong, generally less<br />\nwas particularly hideous.<br />\nwell-written than the family scenes, and<br />\nWhen considered in its entirety, the<br />\ndirected with a weaker hand.<br />\ngood points of the show probably<br />\nNot wanting to trivialize what Mr. Lee<br />\nThe power of the play comes in its<br />\noutweigh the bad. its best good point<br />\nis attempting to tell us, but trying only to<br />\nexamination of familial relationships, but<br />\nbeing Miss McNeil. If you do decide to<br />\nclarify his point, I interpret the play as<br />\nnot what underlies those relationships<br />\ntrek<br />\ndown to Center Stage (and I'm not<br />\ntelling us that before we can move on we<br />\nand brings them into being. Perhaps the<br />\nsuggestin<br />\ng you don't), you will be<br />\nmust accept what we are. He is more<br />\nmost affecting scene is that in which Miss<br />\npleasantly<br />\nsurprised<br />\nto learn that not only<br />\nspecific about this as regards the black<br />\nMcNeil plays scrabble With Lou, her<br />\nMiss<br />\nis<br />\nMcNeil<br />\na<br />\ngifte-d<br />\nactress, she is an<br />\nman, but tries, nevertheless, to generalize<br />\ngrandson: she 'cheats. She shows that a<br />\nequally<br />\ngifted<br />\nsinger.<br />\nto all men. The drama of this, the<br />\ngreat actress can make something so<br />\nunderlying force, is supposed to be built<br />\nKeno Rider<br />\nsimple into something so wonderful.<br />\n<br />\nAT CENTER STACIE<br />\n<br />\nweekly arts calendar<br />\nTheater<br />\nMechanic Theater, Hopkins Plaza, 727-4103. \"Grease.\" Through March<br />\n1 27.<br />\n('enter Stage, 700 N. Calvert St. Leslie Lee's \"The First Breeze of Summer,\" with Claudia McNeil. Call<br />\n332-0033 for<br />\nfurther information. Through April 10.<br />\nEisenhower Theater, Kennedy Center, Washington. Mike Nichols' production of a musical based on the comic<br />\nstrip \"Little<br />\nOrphan Annie.\" Call(202) 254-3600 for ticket information. Through March 31.<br />\nMusical Theater Lab, Kennedy, Washington, \"Hot Grog,\" a pirate musical. Through March 27.<br />\nNational Theater, 1321 E. Street NW, Washington. Liv Ullmann in Eugene O'Neill's \"Anna Christie,\" directed<br />\nby Jose<br />\nQuintero. Through April 9. Call(202) 872-0466.<br />\nFord's Theater, 511 Tenth St. NEW, Washington, \"The All Night Strut:\" a look at the music and dance<br />\nof the 1930's and<br />\n1940's. Through March 27. Call (202) 638-2368 for further information.<br />\nEssec Community College, 'Enemy of the People.' Arthur Miller's adaptation of lbsen's play, tonight and tomorrow<br />\nnight<br />\nat 8 pm,and at 7 pm on Sunday.<br />\nMorgan State University, A production of George Orwell's \"Animal Farm.\" Tcmight and tomorrow night<br />\nat 8 pm, and<br />\nSunday at 3:30 pm<br />\n<br />\nTHE JOHNS HOPKINS FEDERAL CREDIT UNION<br />\ncordially invites its members<br />\nand their guests to attend the<br />\nFIFTH ANNUAL MEETING<br />\n<br />\nThursday, March 24, 1977<br />\n5:30-7:30 pm.<br />\nGlass Pavilion, Homewood Campus<br />\nFeaturing:<br />\n*A Baked Chicken Dinner<br />\n*Five door prizes 'available only to Credit Union<br />\nmembers in attendance)<br />\n*Business Reports<br />\n*Nominations and elections of members to<br />\nvacant Positions<br />\n<br />\nConcerts<br />\nLyric Theater, 120 W. Mt. Royal Ave., 837-5691. Leon Fleisher will conduct the pops concert on March 19 at 8:15 pm.<br />\nThe program includes Rimsky-Korsakoff's \"Capriccio Espagnolp.\"<br />\nPeabody Institute, Mount Vernon Place. A member of the faculty, Robert Hall Lewis, will have his \"Combinani<br />\noni 3\" for<br />\noboe, percussion and narrator, previewed at 7:30 pm on March 20. The free program will be in Leakin Hall, and<br />\nincludes<br />\nworks by Donizetti. Hindemith and Krenek. The free noon concert on March 23, in the Peabody Concert Hall, will<br />\nbe a<br />\nprogram of French vocal literature.<br />\nCenter Stage, Orchestra Piccola, March 21 at 8:15 pm; Mozart's Adagio and Rondo for Violin and Orchestra, Schubert's<br />\nSymphony No. 5. Counod's Petite Symphonic for Winds and Hayden's Symphony No. 46.<br />\nGoucher College. Kraushaar auditorium. The Goucher-Hopkins Community Syrnphoney will performs works by<br />\nMendelssohn, Mozart. Beethoven and Mayuzumi at 8 pm on March 20. Free.<br />\nCenter Forum, Old St. Paul's Church, Charles 3nd Saratoga Sts. On March 22 at 12:30 pm there will be the Medieval Arts<br />\nEnsemble and the Mass Pangue Lingua of Josquin. At noon on the same day pianist William Brown will perform popular<br />\ntunes in the Coffeehouse.<br />\nLovely Lane Methodist ('hurch, 2200 St. Paul St. Tonight at 8:30 pm. Michael Cooney will perform traditional American<br />\nand British folk songs.<br />\n<br />\nFee: $5.00<br />\nFor further information about the meeting and the bus service<br />\navailable from JHMI, call either Credit Union office:<br />\nHomewood: 338-8320<br />\nJHMI: 955-6116<br />\n<br />\nSee you on the 24th!<br />\n<br />\n/<br />\n<br />\n\fmarch 18, 1977/news-letter/page 5<br />\n<br />\nhip it dluovintown<br />\nare superseded by careful arrangements of coca cola<br />\nglasses.<br />\nA Campbell's soup can, electric chair, Jackie Kennedy<br />\nand Liz Taylor, identify the work of the most popular<br />\nartist in the exhibition, Andy Warhol. Through a series of<br />\nsimilar objects, in this instance repeated images of an<br />\nelectric chair, Warhol demonstrates how the repetition of<br />\nan object. takes away its meaning: \"When you see a<br />\ngruesome picture over and over again, it doesn't really<br />\nhave any effect\"(Warhol,Art News, November 1963.)<br />\nWarhol seems to typify the Pop art movement, but<br />\nsomeone like Rauschenburg, who does not make<br />\nextensive use of advertisements in his compositions, is a<br />\nbit more enigmatic. That is part of the fun, trying to<br />\ndiscover what the art works have in common and in what<br />\nways they serve as commentaries on contemporary<br />\nculture.<br />\n<br />\nAn exhibition called \"American Pop Art and the<br />\nCulture of the Sixties\" will continue at the Downtown<br />\nGallery of the Baltimore Museum of Art (Charles and<br />\nRedwood Sts.) through March 25. The artists represented<br />\nare Tom Wesselmann, Robert Indiana, George Segal,<br />\nJames Rosenquist, Jim Dine, Jasper Johns, Roy<br />\nLichtenstein, Robert Rauschenberg, Andy Warhol, and<br />\nClaes Oldenburg.<br />\nThe graphics and posters, in one way or another, reflect<br />\nthe ways in which the mass media and commercial<br />\nPrinting have affected contemporary art. If there is a<br />\ncommon ground for the 38 pieces of Pop art, it is that the<br />\nartists are using images from popular culture. The very<br />\nbanality and vulgarity of advertisements and celebrities<br />\nbecomes the subject matter. Still life paintings of pears<br />\n<br />\nIt'll Ilicw vt/cur imlrl<br />\n<br />\nMike Giuliano<br />\n<br />\nDobra to conduct<br />\nGuest conductor Ronald Dobra, founder of the<br />\nTheater Project Orchestra, and Mark Goldstein,<br />\npercussionist and director of the Baltimore Percussion<br />\nQuintet, formerly associated with Young Audiences, Inc.,<br />\nwill be featured artists in a concert with the Goucher<br />\nHopkins Community Symphony Orchestra. The free<br />\nconcert will be at 8 pm March 20 at Kraushaar<br />\nAuditorium.<br />\nMr. Dobra is a Peabody graduate student in conducting<br />\nwith Leo Mueller and Theodore Morrison and in<br />\nsightsinging with Asher Zlotnik. A Boston University<br />\nclarinet major, he earned degrees in music and media<br />\nfrom Catholic University and Antioch College, and served<br />\nwith the USAF Band in Washington, D.C.<br />\n<br />\n••<br />\n<br />\nRoy Lichtenstein Zipper, 1962<br />\n<br />\nThe teenage.queens ofpunk-rock, The Runaways, Will be<br />\nplaying tonight and tomorrow night at the Hollywood<br />\nPalace, 6512 Baltimore National Turnpike [Route 401, exit 15<br />\n[Vest offthe Beltway. live girls from LA, the oldest 18 yam.ofa,the<br />\nRunaways's stage act is, to say the least, suggestive. We urge<br />\nyou to come on down and cheer them on. The curtain goes<br />\nup at 9:30. Tickets are $4.00 at the door. For further<br />\ninformation call 788-7720.<br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br />\n<br />\n0\\nce,<br />\n1>nce<br />\nrsce<br />\nFt:idav\\<br />\nMarci,j1<br />\nreaf I-1 a I /<br />\naokns I-10ek;ns<br />\n(6-0 86e)<br />\nAotrA;ssioh<br />\nrre sh Al -- Free<br />\n13e.e.r — D54<br />\n<br />\n9PI<br />\n<br />\nw!<br />\nJe<br />\nWho AreYou<br />\nToday there is a way to answer all of your questions.<br />\nresolve your doubts... and, at the same time, discover the truth<br />\nand beauty of your Jewish heritage. For men the first step begins<br />\nat Hadar Hatorah; for women at Machon Chana.<br />\nEach of these unique institutes of learning offers meaningful,<br />\nin-depth courses in Jewish history, ethics, traditions, philosophy,<br />\nHebrew and Yiddish. A complete curriculum in basic and advance<br />\nJudaism. With no previous religious background requirements, no<br />\nfees for those unable to pay. Plus a choice of day or evening<br />\nsessions, Sunday or Weekend seminars, and a Summer Program.<br />\nDormitory facilities also available.<br />\nRabbi Jacob J Hecht, Dean<br />\n<br />\nREGISTRATIONS ARE NOW BEING ACCEPTED<br />\nFOR ALL SESSIONS<br />\nCONIAIT/EE pr4.<br />\nFor further information, call or wnte<br />\n<br />\nHADAR HATORAH<br />\nLubavitch School for College Youth<br />\n[OE JEWISH<br />\n<br />\ng24 EASTERN PARKWAY. BKLYN, N.Y. 11213<br />\n(212) 735-0200<br />\n<br />\nMACHON CHANA<br />\n<br />\nMomen's Institute for the Study of Judaism<br />\n733 EASTERN PARKWAY. BKLYN. N.Y. 11213<br />\n(212) 735-0200<br />\n<br />\n\fpage 6/news-letter/march 18, 1977<br />\n<br />\nmarika christian<br />\n<br />\no the editor:<br />\nRe: Colin Cammerer's sloppy,<br />\nsimple-minded Springsteen piece<br />\n(N-L, March 15).<br />\n\"It's My Life\" was a hit single<br />\nfQr the Animals exactly eleven<br />\nyears ago, long before there was<br />\neither a group or a song entitled<br />\n\"Bad Company,\" and apparently<br />\nlong before Cammerer was even<br />\ntoilet-trained. The only new tune<br />\ntat Springsteen performed<br />\nSunday night was \"Don't Look<br />\nac<br />\n<br />\nRecord reviews from the man<br />\nMiles Davis Water Babies Columbia Pc 34396<br />\nFor the past three or four years, Miles Davis<br />\nhas all but<br />\ncompletely lost his following from the<br />\nfifties onward.<br />\nThose who fondly remembered such<br />\nclassics as Round<br />\nMidnight or Sketches of Spain couldn't<br />\nfigure out what<br />\nMiles was trying to do with \"all that rock<br />\nand roll.\"<br />\nOn the other hand, there is a generation<br />\nof Miles Davis<br />\nfans who have never heard anything before<br />\nIn a Silent<br />\nWay, and would be amazed to find out that<br />\nJohn Coltrane<br />\n(isn't he dead of something?) was a part of<br />\nMiles's•band for<br />\na few years. Columbia Records, Miles's'<br />\nlabel, has not<br />\nobjected to this arrangement,<br />\nbecause this<br />\nignorant young audience has many dollars<br />\n, and money is<br />\nthe name of the game.<br />\n<br />\nBut it has backfired on them, because Miles<br />\nrefuses to<br />\ngo as out and out commercial as, say,<br />\nformer student<br />\nFreddie Hubbard (also on Columbia) or<br />\nformer sideman<br />\nHerbie Hancock (again on Columbia). Miles's<br />\nlast two<br />\nalbums have been commercial flops, basically,<br />\nbecause the<br />\nonly people interested are die-hards who still<br />\nbelieve, and<br />\nmusic critics to whom Miles's; recorded output is<br />\na living.<br />\nThis release is all older material, released in an<br />\nattempt<br />\nto woo back older listeners. Side one, record<br />\ned around<br />\nthe time of such classics as ESP, Miles<br />\nSmiles and<br />\nNefertitti, is out and out fantastic. Wayne Shorte<br />\nr, Herbie<br />\nn Carter and Tony Williams were perhaps<br />\nMiles's' best<br />\nstudio band (the George Coleman band was a<br />\ndynamite<br />\nlive band),and these cuts are priceless. Side two,<br />\nrecorded<br />\nbetween Filles de Killamanjaro and In a Silent<br />\nWay is<br />\nutterly worthless, except that they ' allow the jacket<br />\nto<br />\nlist Chick Corea as one of the sidemen.<br />\nStill, the first side is well worth your money, assumi<br />\nng<br />\n<br />\nyou already have the above mentioned<br />\nalbums.<br />\nPersonally, I would have preferred new materi<br />\nal and a<br />\nfull-blown anthology of outtakes, but with Teo<br />\nMacero<br />\n(Niles's former producer) gone, Miles may find<br />\nit difficult<br />\nto do anything new at Columbia.<br />\n<br />\nARTS<br />\n<br />\nI imagine every high-school trumpet player with<br />\ndelusions of good range will want this album, and they<br />\ncan have it. There are dozens of good screech players<br />\naround, and many better bands. This is a waste of time<br />\nand money.<br />\n<br />\nWeather Report Heavy Weather Columbia PC 34418<br />\n<br />\nHeavy Weather is Weather Report's seventh album:<br />\nmaybe I'm simply addicted, but I have yet to come across<br />\nsomething they've done which I disliked. Seven for seven<br />\nThis is without question the best jazz album of<br />\nthe last<br />\nis an incredible score by anyone's standards.<br />\nsix months. An all star band is one thing, but<br />\nwhen they<br />\nJoe Zawinul and Wayne Shorter have been the nucleus<br />\nall play like stars, that's a session! Mel Lewis<br />\nis joined by<br />\nof the group since its inception back in 1970. Since then.<br />\nbassist extraorclinaire Ron Carter, pianist Hank<br />\nJones, they have gone through three bassists (Miroslav Vitous.<br />\ntrumpeter Freddie Hubbard, tenor man Michae<br />\nl Brecker, Alphonso Johnson, and Andrew White) and a small armY<br />\nand Greg Herbert alto, and Cecil Bridgewater,<br />\ntrumpet, of percussionists before they came to their present<br />\nfor two cuts.<br />\npersonnel. What is important about this current group is<br />\nThe real surprise of the album is Freddie<br />\nHubbard. that the bassist, Jaco Pastorius, has become as much -3<br />\nMany of us thought that Hubbard, cooke<br />\nd-out and<br />\ndriving force with the group as its two leaders.<br />\nuncaring, had long ago sold his soul to rock and<br />\nroll. His<br />\nPastorius is a blessing to the group. infinitely superior<br />\nlast few albums and concert appearances have<br />\nproved<br />\nto his predecessors. He is a great rhythm player, as have<br />\nembarrassing, and most of us went in desparation<br />\nto our<br />\nbeen all of their bassists, but most of all, he is a soloist, a<br />\nold albums. But this! Play A Child is Born;<br />\nHubbard<br />\nmelodicist of the highest calibre—the perfect counter<br />\nhasn't sounded this good since the classic Blue Moon<br />\nwith<br />\nvoice to Shorter and Zawinui.<br />\nBlakey's Jazz Messengers., Throughout the<br />\nalbum,<br />\nOn the other hands, the drummers are taking a more<br />\nHubbard literally swings his ass off, providing<br />\na strong,<br />\nand more subordinate role. Some of their work, as in<br />\nlyrical solo on evefy track he plays.<br />\nHavona, is first rate, but much of the time they are<br />\nMichael Brecker is the album's other surprise.<br />\nBrecker,<br />\nmerely metronomic. In fact, on Teen Town, Pastorius<br />\nif one is to go by his numerous funk recordings,<br />\nseems too<br />\ntakes<br />\nover the drumming, and the change is virtually,<br />\noften to be a minor talent whose chief ability<br />\nis being able unnoticeable.<br />\nto blithely rip off every major R&B tenor<br />\nplayer since<br />\nThe album is a masterpiece, transcendent of labels. Just<br />\nIllinois Jacquet. Actually, Brecker is just<br />\nanother jazz pick it up, put on Birdland, and you have<br />\nexcuse enough<br />\nmusician who likes to eat. His solos on this<br />\nalbum are to buy the record. And that's only the first cut...<br />\nhard-edged and logical without sounding<br />\nthe least bit<br />\nstudied, and he swings like he invented the term.<br />\nThe rhythym section is, of course, as<br />\ndependable as<br />\nMarvin Mandel's assertions of innocence.<br />\nNo comment is<br />\nnecessary; for them brilliance is de riguer.<br />\nMel Lewis Mel Lewis and Friends A&M Horizo<br />\nn SP717<br />\n<br />\nMaynard Ferguson Conquistador PC 34457<br />\nWhat is ultimately most irritating about this album<br />\nis<br />\nnot so-much that it is garbage, but that it is garbage that<br />\nwe have all heard before. Bob James, who produces the<br />\nalbum, might just have easily overdubbed Maynard onto<br />\nsome outtakes from an unused Bob James session.<br />\nWe are expected to be impressed by the presence of<br />\nMaynard's band on this one (his last attempt, Primal<br />\nScream, placed the blame upon studio musicians). So<br />\nwhat? The only impressive passage the band gets, outside<br />\nof two-bar funk cliches and endless rhythm vamps, is on<br />\nThe Fly, and the trumpet section there is led by Jon<br />\nFaddis, a twenty-three year old whiz kid who could blow<br />\nMaynard off the band stand eight days a week.<br />\n<br />\n\fmarch 18, 1977/news-letter/page 7<br />\n<br />\n411<br />\n<br />\nEnjoy the Lacrosse<br />\ngame with $.25 beer<br />\nin the Rat from<br />\n1 hour before to 2<br />\n<br />\n.41111111110.<br />\n<br />\n-NOM.ato.<br />\n<br />\nSenior Class Film Series<br />\npresents<br />\n<br />\n\"ONE OF THE YEAR'S10 BEST:'<br />\n\"A BRILLIANT FEAT OF MOVIE-MAKING:',<br />\n\"ONE OF'THE YEAR'S 10 BEST'?<br />\n\"It flawlessly expresses<br />\nthe belief that'manhood<br />\nrequires rites of<br />\nviolence<br />\n' —TIME MAGAZINE<br />\n<br />\n—NEWSWEEIC<br />\n<br />\nhours after the<br />\n<br />\ngame.<br />\n<br />\nFREE BEER FOR<br />\nENIORS AFTER<br />\nTHE GAME.<br />\nALFRED HITCHCOCK'S<br />\n<br />\nEINIIIIILY MAW<br />\n<br />\nABCPICTURES CORP IXtsents<br />\n<br />\nHOFIF<br />\nST<br />\n'SAMPECKINH<br />\n<br />\n1<br />\nFRi• & SAT.<br />\nMARCII 18 & 19<br />\nN GS1<br />\nARR<br />\n<br />\nShaffer 3<br />\n<br />\n7:30 & 10:00<br />\nAdMISSION $1.00<br />\nSENIORS<br />\n<br />\n$.75<br />\n<br />\nThe Johns Hopkins University<br />\nOffice of Special Events<br />\nPresents<br />\n<br />\nCombined sounds of harpsichord, banjo and twelve-string guitar.<br />\nClassics, folk music, traditional hoedowns and ragtime - a unique sound!<br />\nSUNDAY MARCH 20 at 7:30 P.M.<br />\nShriver Hall Auditorium, The Johns Hopkins University<br />\nHomewood Campus<br />\nREGULAR ADMISSION: $3.75<br />\n<br />\nThere's no body in the family plot.<br />\n<br />\nKAREN BLACK • BRUCE DERN<br />\nBARBARA HARRIS • WILLIAM DEVANE<br />\n<br />\n3/18 - 3/19<br />\n7:30 az, 10:00<br />\n<br />\n$1.00<br />\nShriver Hall<br />\n<br />\nFULL-TIME STUDENTS W/ID: $2.75<br />\n<br />\n1<br />\n<br />\n\fTwenty Questiong<br />\n<br />\nNEWS—LETTER<br />\nvol. lxxxi, no. 41<br />\neditor-in-chief<br />\nEric Garland<br />\n<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editors<br />\nJ.D. Considine<br />\nMike Giuliano<br />\nphoto-production mgr.<br />\nJennifer Bishop<br />\nsports editor<br />\nDavid Kraus<br />\ngraphics editor<br />\nScott Marks<br />\nhigher consciousness<br />\n- D.H. Warren<br />\ncirculation editor<br />\nHowie<br />\nproduction<br />\nDale Horan<br />\nJim McDonald<br />\nJoe Rodrigue<br />\nForeign Affairs Desk<br />\nMark Hertsgaard<br />\nbar editor<br />\na. press<br />\nKenneth Sokolow (l899-1976)-f<br />\n<br />\ngood start<br />\nIt is good to see that the New Political Caucus is off to a fine start<br />\non campus. Its `;Enemies of the People\" film series of last week was a<br />\nbig success, both in terms of attendance and solid political education.<br />\nThe Caucus' left of center stance and its expected future<br />\nconsideration of questions that are usually neglected in conventional<br />\ndiscourse (e.g., jEIU involvement with foreign- governments, the<br />\nefficacy of the American two party capitalist system) are refreshing<br />\nand long overdue. We wish them the best of luck.<br />\n<br />\nletters to the editor<br />\nTo the Editor:<br />\nI realize that it is the fashion<br />\nof the day to be a skeptic, to cast<br />\na cynical eye on familiar<br />\ninstitutions. I realize, too, that<br />\nmany people are of the attitude<br />\nthat the world is a sad place if<br />\nothers cannot bear a few laughing<br />\nslights against them, e.g. the<br />\nPolish, Italian, etc.,joke.<br />\nHowever, I am confused as to<br />\nthe purpose of Mr. Colin Camerer<br />\nin his \"article\" of 3-8-77. Is he<br />\nwriting news, social commentary,<br />\nor satire? I do not find it<br />\nnewsworthy, legitimate, or<br />\nlaughable. I find it appalling and<br />\npitiful in its backward prejudice<br />\nand false sense of superiority. Mr.<br />\nCamerer, in his piece on the<br />\nEvening College, has found it<br />\nnecessary to include derogatory<br />\ndescriptions of Jews, nurses, and<br />\nhousewives, and to downgrade<br />\nand patronize a segment of the'<br />\nuniversity that truly deserves<br />\nplaudits, not put-downs.<br />\nA great many people have<br />\nconsiderable respect for those<br />\nworking adults who have the<br />\ncourage and motivation to return<br />\nto school at the expense of their<br />\nfree time. These students are<br />\nsincere, intelligent, and eager to<br />\nbe accepted, yet they are often<br />\nhampered by the attitudes of<br />\ncertain undergraduates such as<br />\nMr. Camerer, who seems to view<br />\nthem as ridiculous. Mr. Camerer<br />\nhas examined his subjects<br />\nthrough stereotypic. rather than<br />\n<br />\nrose-colored, glasses.<br />\nStereotyping is passe, Mr.<br />\nCamerer. It is not entertaining.<br />\nI question Mr. Camerer's taste<br />\nin wishing to have such an article<br />\npublished, and 1 question the<br />\ntaste of the News-Letter in<br />\nchoosing to publish it. I was<br />\nasked why I bother to respond to<br />\nsuch garbage. It is because I<br />\nexpect garbage to be tossed out.<br />\nArna Cohen<br />\nTo the editor:<br />\nDon't you . wonder sometimes<br />\nabout sound and visiOn?<br />\ndo<br />\n<br />\nBy JOHN PERROTTA<br />\nLife at Johns Hopkins in the nineteenth century was<br />\ndefinitely a different scene. With no Rathskellar, 110<br />\nHomewood campus, no University housing, and only a<br />\nhandful of Goucher girls, the typical Hopkins student was<br />\nin for the trip of his life.<br />\nThe new University, thrusting all its resources in the<br />\ndirection of academics and research, had neither the<br />\nmoney nor the need for a dormitory. Fortunately for<br />\nthem, many Baltimoreans wee still suffering the effects<br />\nof the Civil War and the Depression of 1873. TheY<br />\nwelcomed both Peabody and Hopkins students into their<br />\nhomes as boarders.<br />\nSo many students settled near McCulloh and Biddle<br />\nStreets that this area was christened the Latin Quarter. It<br />\nwas quiet with old brick houses later praised by Hopkins<br />\nalumnus Woodrow Wilson in a letter to his sweetheart.<br />\nIf Johns Hopkins is world-famous today,it certainly<br />\nwasn't known by all Baltimoreans in the 1880's. Indeed.<br />\nnot until the Hospital began treating patients did<br />\n\"Hopkins\" become a household word. A Johns Hopkins<br />\nstudent, placing an ad in the Baltimore Sun for a room<br />\n\"near the University\", was offered a room near the<br />\nUniversity of Maryland medical school.<br />\nLiving was pretty cheap. Rooms were usually $5 a<br />\nmonth. Meals went for $4 a week, or that much a<br />\nfortnight if you cooked them yourself. Milk was 3 cents a<br />\nglass, apples, two for a nickel. Twelve bananas could be<br />\nhad for 8 cents at the Lexington Market. And kerosene to<br />\nfuel your study lamp was a quarter a month.<br />\nHerbert Baxter Adams (of Adams House fame) claimed<br />\nthat cutting corners in Germany, it still cost him $1000 a<br />\nyear. However, a student in Baltimore could live \"on the<br />\nfat of the land\" for $500 a year, and that he himself paid<br />\n<br />\nAl<br />\niger<br />\n<br />\npioul<br />\nfold<br />\n<br />\nlii<br />\nIf<br />\nbeen<br />\n<br />\nthe<br />\n<br />\nr<br />\nSt<br />\nfust<br />\n<br />\n1-1(<br />\n<br />\nfOrti<br />\n<br />\nfic<br />\n<br />\ny<br />\n<br />\nth p<br />\n<br />\nr<br />\neid<br />\n<br />\nhelp<br />\n<br />\n4.41<br />\n<br />\nheir<br />\n<br />\nPr<br />\n<br />\nEgg Roll Norton<br />\nDear Mr. Camerer:<br />\nRe: your tongue in cheek article<br />\nconcerning evening students.<br />\nThere is one important factor<br />\nyou didn't mention that may<br />\nhelp explain the mysterious<br />\ndifferences you noted between<br />\nday<br />\nand evening students. The<br />\nevening students, generally, are<br />\nsigning their own checks for<br />\ntuition—Daddy 'doesn't send a<br />\ncheck each month. And in order<br />\nto sign their own checks they are<br />\nworking full-time, putting the<br />\nmoney in the bank, and no doubt<br />\ngiving up other luxuries they<br />\nmight be enjoying. Could this<br />\nprecipitate the intensity and<br />\nenthusiasm? Interesting!<br />\nShirley Goodman<br />\nDepartment of Behavioral Sciences<br />\nSchool of Hygiene & Public Health.<br />\n<br />\nREMSEN IINVENI4<br />\ndi<br />\n:k:,:1;<br />\nIn a direct affront to the°J'<br />\nCarter's new administration }' I<br />\n<br />\nts/<br />\n<br />\nOW om(AM CNi FRom CARAAANLIS ON Rom SADAT, ONE<br />\nOtsJ 1-ROM TORRIJOS 1WELVE cr<Om ID I WIN tkND NoTto* 'MIZE 1tY<br />\n<br />\n,<br />\n<br />\nNOTIN<br />\nYJAROI.<br />\n<br />\nsaccharin.<br />\nSaccharin, or Ortho-sullobe crO'<br />\nwas a professor at the HoPl fillistie<br />\noi<br />\nUniversity's part that one `.05<br />\nwas the product of the 1-10143niciti ll<br />\n1923, was unavailable for c°111;<br />\nThe government claims t113'us, fan<br />\nthe Delaney amendment.<br />\nser kl<br />\nr llt'<br />\ncancer of the bladder ill'<br />\nAmendment forces them to °rceesIfi.;;<br />\nThe Administration here ;',A,11<br />\nI<br />\nweek, saying that.\" With<br />\nbetween the government antii5irriiii\\<br />\nreason behind the governillej.<br />\nMilton S. Eisenhower's boArt A<br />\nThere ar,e plans on the PtA;<br />\nvending rhiachines, and the<br />\nstatement to President Carter'<br />\n<br />\n\fstlub -- a nineteenth century turn-on<br />\nInlY $300 a year for room, board, and laundry, \"and I<br />\neard in a first-class place.\"<br />\n•,,Among<br />\nAmong boarding houses of Hopkins renown, Mrs.<br />\nstood taller than all. She revitalized students,<br />\n:Ilwied professors, and visiting lecturers with meals which<br />\nvould make the dorm cafeteria food look like cow<br />\n,fhodder. In his diary, a Hopkins student wrote that a guest,<br />\n„n4vIng eaten at Mrs. Egerton's Boarding House, said<br />\nDaltiMOre is the gastronomic center of the universe.\"<br />\nThe gripe that Hopkins is too graduate-oriented has<br />\nbeen a<br />\npart of the University since its inception. New<br />\n!aduate students frequently dined with the President and<br />\n,'Ith other faculty members. Professor Morris would invite<br />\n'Iudents to his home for \"oysters, beer, and cigars.\" Such<br />\nrilenngs even took place in the library, that is, until the<br />\ni<br />\nfatian<br />\ndiscovered a piece of chicken pressed between<br />\nPages of a very valuable book.<br />\ni Students often made house calls to their professors, the<br />\nfr4,stees, and their families. They visited the families of<br />\nYoung women en masse, as dating was still a<br />\nflsclalous endeavor. Clubs such as the Twenty Questions<br />\nfill') were organized by the inure creative Baltimore belles<br />\n°r the sole purpose of partying with Hopkins students.<br />\n110Pkins' first fraternity, Beta Theta Pi, was organized<br />\n1)(ktlY one century ago. The first pledge class journeyed<br />\nt°h Yale where they were initiated at President Gilman's<br />\nPter of the fraternity. Later, more fraternities came<br />\nexistence. Frat houses were more social than<br />\nential: only a few graduate students lived there, to<br />\nheelP pay the rent and thus maintain a fraternity<br />\nad quarters. Frat-community relations were a problem<br />\nthen, and landlords often evicted fraternities from<br />\ne_tr tow houses.<br />\nFrat athletics and hazing were unheard of until the late<br />\n<br />\nt<br />\n<br />\n1890's. But other activities, especially rushing, got out of<br />\nhand when brothers sought pledges from the nearby boys<br />\nprep schools.<br />\nPhi Beta Kappa was Hopkins' only honorary fraternity<br />\nat the turn of the century. President Gilman was<br />\nappointed its first chairman. Admission into Phi Beta<br />\nKappa required a unanimous vote, a rule which, due to a<br />\ncertain woman-hater alumnus, kept several .co-cd: from<br />\nmembership.<br />\nSince there was no gymnasium, itchy students turned<br />\nto recreational facilities in the city. The Baltimore<br />\nAthletic Club promised to waive the initiation fee of any<br />\nstudent provided he pay the one dollar monthly dues. The<br />\nUniversity chartered a horse-drawn wagon which brought<br />\nboys to clifton, the estate of Mr. Johns Hopkins, where<br />\nthey could play on the open lawns.<br />\nIn 1882 Edward Hartwell was appointed the Hopkins'<br />\nfirst physical education instructor. A year later a small<br />\ngym equipped with lockers, bath, and offices was<br />\nconstructed. Tennis courts were laid in the yard area. A<br />\nfootball team was organized in 1881, lacrosse in 1882. As<br />\nsports grew at Hopkins, it was obvious the present<br />\ngymnasium was inadequate. In 1898 row houses were<br />\ndemolished, and a new,larger gym was erected.<br />\nIn 1876 a club, modeled after the German kneipe, or<br />\ntavern, was organized for Saturday night get-togethers. The<br />\nstudents played cards, chess, smoked (cigarettes), drank<br />\nbeer, and sang German and Latin songs led by the<br />\nclassicist Basil Gildersleeve. Later the group established a<br />\nregular meeting hall in the back room of a grocery store.<br />\nSaint Dennis, a black man, tended the fire and<br />\noccasionally crossed the street to buy refreshments for the<br />\nstudents. In ten years the kneipe gave way to a more<br />\norganized Johns Hopkins University Club with Professor<br />\nGildersleeve presiding. Unfortunately undergraduates<br />\nwere screwed again as membership was limited to those<br />\ntwenty-five and over. Thus, many students had to seek<br />\nthrills elsewhere.<br />\nThe first society formed solely in the interests of the<br />\nundergraduates was the Matriculate Society. Their<br />\nopening dance--or \"hop\", as it was appropriately<br />\ncalled —was held on Commemoration Day, 1887, in the<br />\ngymnasium. Due to its success, the hops were held on<br />\nother occasions. Despite the fact that Goucher College<br />\nallowed only girls living with their parents to attend the<br />\nhops, there were usually enough \"locals\" on hand to<br />\ndance with.<br />\n<br />\nOld Administration building<br />\nThe theatre was almost untouched by Hopkins<br />\nstudents before the turn of the century. .The only<br />\ndramatic production on record is a minstral show by the<br />\nlight-hearted local fraternity, Alpha Sigma Sigma (ASS)<br />\nin 1890. The two hundred dollar profit from ticket sales<br />\nwas donated to the Athletic Association.<br />\nThe first Glee Club was formed in 1879 and enjoyed a<br />\nvery short life. In 1883 another Glee Club was organized,<br />\nwith tenor Woodrow Wilson among its first members. But<br />\na banjo and mandolin club formed five years later was so<br />\n'popular that it knocked the Glee Club out of prominence.<br />\nSoon this new music club, equipped with singers,<br />\nperformed concerts in Maryland and other states. Several<br />\nstudents, perhaps realizing their true talents, never<br />\nreturned to the University. This, along with a faculty fed<br />\nup with banjo practice in the classrooms, caused music to<br />\nabruptly stop at Hopkins. Is wasn't until almost the end<br />\nof the century that a new music group, incorporating glee,<br />\nbanjo, and mandolin, was organized.<br />\nThe Peabody Conservatory of Music always attracted<br />\nHopkins students. They were known even to cut class(or<br />\nseminars, as they were called) to see a performance. The<br />\ntheatre too, offered top-quality entertainment: Booth,/<br />\nJefferson, Rossi.<br />\nIn 1897 a music appreciation club was formed.<br />\nConcerts were performed in the original McCoy Hall<br />\ndowntown, under the direction of the Peabody<br />\nConservatory of Music. In a few years interest in this<br />\nmusic association waned.<br />\n<br />\n70's terrorism comes to the United States<br />\nViolence is as American as<br />\napple pie.\"<br />\n—H. Rap Brown<br />\n<br />\n0<br />\n<br />\nrIN goEs SOUR<br />\na<br />\ndin<br />\ncr nd<br />\n<br />\nHopkins University, Jimmy<br />\np tradition of the Johns<br />\nD.A. place a ban upon the the artificial sweetener<br />\n<br />\n10<br />\n<br />\nAc.<br />\nImide, was discovered in 1879 by Ira Rcmsen, who<br />\nty at the time. It has long been a matter of pride on the<br />\nw:ps useful and pleasurable food additives in American life<br />\nfoes! \"ulogy.. Remsen, who died Of cancer of the bladder in<br />\ntt1,1 ,4n<br />\naus!q a was due to the wording of a controversial'law known as<br />\nts,'•“! test in Canada which found that saccharin produced<br />\npokthgovernment claims that the wording of the Delaney<br />\nrestki aritroff the-market.<br />\nCigs<br />\nMuller was overheard at lunch<br />\n050,1 ti otherwise. President<br />\nOxiiiv Its, doubt that Mr. Carter wants to sweeten relations<br />\ner ktioersitY•\" High level insiders have intimated that the-real<br />\nns Was Carter's annoyance at having been left out of<br />\n,<br />\n,i-kuresIdent<br />\nis Calling<br />\nti„;<br />\nto have peanuts removed from all on-campus<br />\n\"uncil is contemplating sending a\" strongly worded\"<br />\nC<br />\n<br />\nI<br />\n<br />\nn.iiversity<br />\n<br />\nTerror has come home with a<br />\nvengeance to America. What used<br />\nto be condensed to one-column<br />\nparagraphs in the World Briefs<br />\nsection, along with the natural<br />\ndisasters and , new elections in<br />\nsome remote foreign country,<br />\nnow appear as front-page<br />\ndouble-deck headlines, with<br />\ngigantic photos of your business<br />\nassociate or next-door neighbor<br />\nheld at gunpoint.<br />\nThis new wave of violence<br />\nisn't necessarily more prevalent<br />\nor devastating than other eras'<br />\nlabor battles or protest<br />\nmovements. What sets the<br />\nhostage-taking and shooting<br />\nsprees apart is that it's personal:<br />\nno crowds clashing with police or<br />\nmobs fighting in the streets, but<br />\na lone figure or two with guns. In<br />\nTom Wolfe's \"Me Decade,\" the<br />\nimage of a direct attacker<br />\nentirely fits the mood of the<br />\ncountry, faceless while intensely<br />\npersonal.<br />\nAt the same time, the current<br />\nbrand of terrorism receives a<br />\ncertain measure of media glory.<br />\nPeople like Charles Manson (who<br />\nnow appears to have been a few<br />\nyears ahead of his time), and<br />\nPatty Hearst are cult items. The<br />\n<br />\nrevolutionary airs attached to<br />\nsome - terrorist groups almost<br />\nmake them \"respectable\" in<br />\ntelevision eyes -- the Mao Hour in<br />\nNetwork isn't too many seasons<br />\naway. It's very easy to dismiss<br />\nsomeone perceived as an<br />\nanarchist they're fighting a<br />\ngovernment with an ideology, a<br />\nsimple tag that excuses thinking<br />\nabout whatever motives are<br />\nbehind them.<br />\nMeanwhile, each week brings a<br />\nnew figure out of nowhere,<br />\nholding up or shooting at equally<br />\n.anonymous people. Charles<br />\nHopkins, on trial this week, can't<br />\npay rent and takes on City Hall.<br />\nIn Indianapolis, Anthony Kiritsis<br />\nwires up his landlord and parades<br />\nhim down the street.<br />\nFolks<br />\nlike Fred Cowan and Corey<br />\nMoore pop out of places like<br />\nNew Rochelle and Cleveland to<br />\nnational attention or a call from<br />\nthy President.<br />\nFinally, the siege in<br />\nWashington conducted by Hanafi<br />\nMuslims appears to confirm the<br />\nimpression of a piecemeal<br />\naniarchy, some in large organized<br />\ndoses, most however erupting in<br />\na random place, taking the<br />\nnearest available hostage.<br />\nNaturally enough, politicians<br />\nsuspect, another round of<br />\nassassinations. Senate Majority<br />\nLeader Robert Byrd wants a<br />\n<br />\nbullet proof glass screen<br />\nconstructed around the Senate<br />\nfloor. And the special House<br />\nAssassinations Committee revives<br />\nitself every • few months,<br />\npresumably with one eye on the<br />\nmurders of the sixties and the<br />\nother nervously glancing at<br />\nfuture targets.<br />\nSensational assassinations,<br />\nhowever, would seem out of<br />\nplace or lost amid the new<br />\nterrorist climate. Some people<br />\nwill doubtless get an urge to go<br />\nafter Carter (or at least the<br />\nfactory nearest him), but the rest<br />\nwould settle for just about<br />\nanyone. The scores of hostages<br />\ntaken in various incidents.<br />\ncertainly were not direct targets<br />\n— you could be the next one<br />\ncaptured, if in the right (wrong)<br />\nspot.<br />\nThat's what scares most about<br />\nthe recent attacks: there doesn't<br />\nappear to be any motive or<br />\nintended targets. Bodies are held<br />\nto be bartered for no apparent<br />\nvictory or loss. Eventually, legal<br />\njustice winds up each individual<br />\nact, but there's no sense of<br />\ndeterrence or conclusion. Just<br />\nmore headlines and tense film<br />\nfootage to come. The mood of<br />\nthe seventies has put its personal<br />\nstamp on violence.<br />\n1:M• Garknid<br />\n<br />\n\fpage 10/news-letter/march 18, 1977<br />\n<br />\n/AL<br />\nL<br />\n<br />\nzias2721'17<br />\n<br />\nOnQ117<br />\n<br />\nsk3:\\,:onv<br />\n1111-17:2©:-2 27, OT7 1;00<br />\nC7r117.13:1 ica':11:4\\10 COisiii.\"*AZIEGATICnJ<br />\nA<br />\n°<br />\ntrk 4.4<br />\n.c`<br />\n4.‘<br />\n0 .;•<•c<br />\n„<br />\n0<br />\nL.1:4<br />\n<br />\n0100 Stevenson Eload<br />\n<br />\nPRE.SENTS<br />\n<br />\nYou are invited to hear<br />\n<br />\nTH-E<br />\n<br />\n1117<br />\n<br />\nf<br />\n<br />\nU.S. SENATOR F2A:1:c CEU471Cii<br />\nMember of the Senate Foreign Relations Committee<br />\nand leading advocate of human rights<br />\n<br />\nsTin:3<br />\n<br />\nANNUAL<br />\n<br />\nHEALTH CAREERS<br />\nSYNPOSIU11<br />\n<br />\nU.S. SEAAT011 PAUL S.<br />\nMember of the Senate Foreign Relations Committee<br />\nART/ GOON:111H<br />\n<br />\nExecutive director, National Conference on Soviet Jewry<br />\n<br />\nDR. ROBERT 0. FREEV1AN<br />\nDean, Peggy Meyerhoff Pearlstone School<br />\nof Graduate Studies, Baltimore Hebrew College<br />\n<br />\nSponsored by the Soviet Jewry Committee<br />\nof the Baltimore Jewish Council<br />\n752-2630<br />\n<br />\nMot4., I ues.,+WEb., MARC.14 at,01a, 4a3<br />\n; o PM.<br />\nvtawirvc,<br />\n<br />\nRoot-% OF Ttie STutANT<br />\n<br />\nUN ioN<br />\n<br />\nPublic Invited<br />\nFree Admission<br />\n<br />\nCFRes REPAsisip-ielvts)<br />\n<br />\n74.•.{. J. J.<br />\n<br />\n.1:\"..Pr<br />\n<br />\n•-•-*•••<br />\n••!4••4•1<br />\n<br />\nJilt Housing Lottery<br />\nContract Signing Sessions<br />\nMonday March 21 - single units, single and double spaces<br />\nTuesday, March 22 - three-, four-, and five-person spaces<br />\nDormitory Social Lounge - 7 p.m.<br />\nAll students whose names were drawn in the housing lottery<br />\nand who wish to accept the offered space(s) must attend<br />\nthis session. Contracts will be signed at this time.<br />\n<br />\nQuestions should be directed to:<br />\nBelva Scott or Umran Uras<br />\nOff-Campus Housing Office<br />\nWolman Hall, 338-7958<br />\n<br />\n\fA Touch oF CLASS:<br />\n<br />\nmarch 18, 1977/news-letter/page 11<br />\n<br />\nLONg JOIIN'S<br />\n<br />\nbar of the wee<br />\n<br />\nWith workers at Bowie on strike, and all indications suggesting that Pimlico won't open this Monday, one<br />\nmight feel no need to drive out West29th Street to the Jones Falls Expressway. Well, the JFX does not look<br />\ntoo promising, but don't give up on that general direction. There happens to be a place named Long John's<br />\nPub that sits on the tail end of West 29th, across from Sterling's, yet.<br />\nLong John's is as good a spot as any to drown out the sorrows of shut-down Maryland race tracks. In<br />\nfact, this bar rates a cut above the average Greenmount or Hampden saloon, at least in terms of decor.<br />\nTables with non-plastic green tablecloths. Candles that have fishnet patterns around their glass containers.<br />\nSwivel-action leather bar stools and a deluxe giant TV screen.<br />\nPlushness, however, is a double-edged sword in drinking establishments. The ritzy style at Long<br />\nJohn's—as one patron conjectured. \"the owners must just be little homebodies\"—tends to preclude a sense<br />\nof locale, of Baltimore turf. The bar could be uprooted and transplanted anywhere along the Eastern<br />\nseaboard without the blink of an eyelash. During football season, Colt highlight films and Monday night<br />\ngames aroused loyalty; nowadays, a bare Oriole poster hangs on the wall to remind one of the city.<br />\nThe \"notch-above\" atmosphere fortunately does not bring along higher prices. Tuborg Gold goes for<br />\nforty cents a draft, a very modest expense. And Happy Hour from five to six (Monday through Thursday)<br />\nfeatures a nickel off the beer and mixed drinks for forty cents. To get food, show up sometime in the<br />\nafternoon for standard grill fare; at night, pizzas are served until 11:30. Those who complain of an absence<br />\nof Nathan's in the area should check out the Monday night special: hot dogs for a quarter apiece.<br />\nThe physical proportions inside Long John's also set it apart from the neighborhood taverns. A very long<br />\nbar cuts a large \"L\" in the room, leaving relatively small space for tables. Most of the patrons, then, sit at<br />\nthe bar, which doesn't make for the crowds about the tables usually seen at other places. Instead, this is one<br />\nplace the reviewer can trot out that favored word—\"intimacy.\"<br />\nFor some action, the jukebox suffers from an overdose of country tunes, though a Buddy Holly number<br />\nof \"When Irish Eyes Are Smiling\" may be found. A couple \"new\" pinball machines (one is Captain<br />\nFantastic) stand along one wall, a rarity in these parts—most bars carry the old-style machines that lack<br />\nflipper, points, and any apparent redeeming social value. The real game connoiseur will be delighted to find<br />\na miniature electronic bowling alley, where one slides a metal disc to knock down the pins. Several different<br />\ngames can be played, all for a long-lasting quarter for two contestants. And anyone who scores over 199 on<br />\nthe \"Regular\" version may receive a welcome surprise one Friday (ask the bartender for details).<br />\nLong John's will probably seem unfamiliar to the seasoned local barg..,er, what with its higher-class<br />\ninterior and close surroundings. Like any good bar, however, a few rounds and words with the regulars will<br />\nmake one feel right at home in Charm City.<br />\n2<br />\n--Sizuff'y Sandlot<br />\n<br />\nDiNiNq IN BALTIMORE -- NATURAL<br />\nScirocco Restaurant, 3900 N. Charles<br />\nSt., is the most recent addition to thE<br />\nlimited list of natural food restaurants in<br />\nBaltimore. Unfortunate1y, it is not the<br />\nwonder it is advertised to be.<br />\nTo begin with, Scirrocco has an<br />\nidentity problem. Benevolent murals of<br />\nsmiling suns and friendly cacti are<br />\njuxtaposed with a well-stocked bar, over<br />\nwhich sits a plastic sign bearing the<br />\nrestaurant name. Waiters cheerfully<br />\nattired in Scirrocco T-shirts work with a<br />\nmaitre d' in a black three-piece suit, a<br />\nman who belongs more with the<br />\nfasionable establishment on the other side<br />\nof the partition.<br />\nThis peculiar split personality is also<br />\nreflected in the table settings and menu.<br />\nThe blue -checkered tablecloths are<br />\nprotected by a sheet of acrylic on which a<br />\ndirty little vase holds a few dried flowers.<br />\nThe course offerings vary from the<br />\ntraditional roast prime ribs of beef to'the<br />\nmore \"exotic\" and \"original\"<br />\nall-vegetable dishes.<br />\nDinner began with soup served in a<br />\ncup, a feature not mentioned on the<br />\nmenu. The fresh mushroom soup was<br />\nneither tasty nor fresh, and seemed<br />\nreheated. For one-fourth the price, a can<br />\nof Campbell's would have been more<br />\nplentiful and appetizing.<br />\nOur appetizers, mushroom caps stuffed<br />\nwith snails in garlic butter, were an<br />\nextreme disappointment. The few<br />\nmushroom slices floating in the soup<br />\ncame from larger mushrooms than those<br />\nused for appetizer. The taste of garlic<br />\nbutter was barely perceptible, and the<br />\ndecorative parsley limp beyond<br />\nrecognition.<br />\nOur main courses consisted of small<br />\nPortions of a curried vegetable dish<br />\nWithout curry (bearing a strange<br />\nresemblance to another dish on the<br />\nmenu), and a Ratatouille casserole. The<br />\nvegetables were generally unrecognizable<br />\nby taste or appearance, due to<br />\novercooking or continuous re-warming.<br />\nWhen the Ratatouille, which was cold on<br />\nthe inside, was returned, it came back<br />\nalmost immediately piping-hot, the plate<br />\n<br />\nPub<br />\n<br />\nstill manageable. This suggested the use of<br />\na micro-wave oven. Is this the \"natural<br />\ntaste of food\" that Scirrocco's boasts?<br />\nThe gastronomical highlight of the<br />\nevening was the bread, two honey-carrot<br />\nmuffins fresh from the oven, served at the<br />\nend of the meal.<br />\nThe establishment claims that \"every<br />\nmeal is prepared to your order.\" Is this<br />\nthe only excuse for slow service and<br />\ntemperamental cooks? There are no<br />\nchoices offered within any dish, and it<br />\nturned out to be difficult to distinguish<br />\none vegetarian item from another. The.<br />\nmenu differentiated by sauce, but the<br />\nchef didn't seem to go that far.<br />\nScirrocco is more expensive .and<br />\npretentious, and less imaginative than the<br />\nother natural food restaurants in the area.<br />\nThey are attempting to integrate healthy<br />\neating with middle-class standards: They<br />\nhave not succeeded—they have only<br />\nmanaged to bring out the worst aspects of<br />\nboth realms.<br />\nPerhaps they should not have tried.<br />\n-- The Bobsey Twins<br />\n<br />\nSaturday past, several consorts and<br />\ntook a stroll down Little Italy way,<br />\nthought we'd eat well, drink well, and be<br />\nItalian for at least a night. Maybe longer.<br />\nWe would have been wiser to make the<br />\ntrek a bit later than dinner hour since<br />\nevery establishment of any repute in<br />\nLittle Italy sports round the black lines<br />\nfrom 6:30 to 7:00 weekend nights. We<br />\nwound up at Chiapparelli's 237 High St.,<br />\nand have yet to regret it.<br />\nThe wait was long -- maybe two hours -but the stand-up bar to the left of the<br />\nrestaurant was enough to settle our thirst,<br />\nenough to prime us for an exciting meal.<br />\nOur drinks were all delicious and then<br />\nsome: the Freddy Fudpucker had ample<br />\nevidence of tequila and the fresh banana<br />\nwas crushed just right. The gin and tonics,<br />\na popular drink at our quarter of the bar,<br />\nmet with thumbs up all around.<br />\nAll the appetizers were good, but the<br />\nclams casino was thG hit of the night.<br />\nClams casino like I've never had them;<br />\n<br />\nFood ANd LiTTEE !Tay<br />\n<br />\nhuge, tasty clams suffocated by a<br />\ntantalizing concoction of tomato, herbs<br />\nand breading. This taste treat is not to be<br />\nmissed. The entrees were all delightful, the veal<br />\ndishes drawing special praise. The<br />\nhighlight, however, was the Ed Perry's<br />\nShrimp and Clam Scampi, a mystical dish<br />\nthat begs not to be eaten, but just gazed<br />\nupon. Rarely in an Italian restaurant<br />\n[in any restaurant] have I come across a<br />\nscampi so fixed up with jumbo firm<br />\nshrimp and tender clams. Quite a<br />\nsensation, to say the least.<br />\nIn all fairness, one must admit that the<br />\ndeserts were a mixed bag. The spumoni<br />\nand tortoni were run of the mill affairs,<br />\nI've had better at the opening of a<br />\nsuburban Carvel. The cheese cake wasn't<br />\nbad, but a mistake after such a rich meal.<br />\nCoffee was fine.<br />\nChiaparelli's tariffs are a bit dear—our<br />\nbill for seven came to $136, with several<br />\ndrinks apiece--but if you've got a few<br />\nbucks to spare there's no excuse not to<br />\nscoot on down to Chiaparelli's.<br />\nilthouglz some Baltimoreans will tell<br />\nyou otherwise, it is possible to get burned<br />\n<br />\nin Little Italy. We know that reality all<br />\ntoo well.<br />\nSergi 's Ice House doesn't look all that<br />\nbad from the outside, just a boring white<br />\nbuilding. I don't want to go on too long<br />\nabout this excuse for a restaurant, but as<br />\ne gastromme du peup1e, / feel compei!ed<br />\nto rake over a few details, ugly as they<br />\nare.<br />\nFor starters, the drinks were weak.<br />\nAlso tasted funny. The appetizers were<br />\npoor. Our main dishes varied, from the<br />\nmediocre—ravioli, spaghetti and Italian<br />\nsausage- to the positively criminal. In that<br />\nlatter category were the chicken and veal<br />\nparmesan, which were both stretched out<br />\non huge plates like pancakes, a thin strip<br />\nof chicken or veal buried by greasy<br />\nbreading. The clams possillipo were<br />\nhopelessly lost amid an 'indifferent sauce.<br />\nThe salads hrere plain and limp, the<br />\nbread cold and slightly, stale, and the<br />\ncheesecake -too heavy. All this fur a stiff'<br />\nprice, at least ten dollars over what it<br />\ndeserved.'<br />\nI felt awful the rest of that day, and it<br />\nwasn't until I downed five Old<br />\nMilwaukees in Hansen 's Saloon that Ifelt<br />\nlike myself' again.<br />\n<br />\n\fpage 12/news-letter/march 18, 1977<br />\n<br />\nTROOP]<br />\n<br />\nO_P-1<br />\n<br />\nOfig OPFR<br />\n<br />\n5_5_0<br />\n<br />\n13rea0<br />\n. 5-1wiihFjeienad...<br />\n<br />\nSATURDAY<br />\nIN THE RATHSKELLAR<br />\n<br />\nThs Sutiday<br />\nto<br />\n<br />\n- tfn •<br />\n<br />\nRRst ENeUsg LuTRERAN ci4uRct4 HouGf<br />\n3803 N. ciur(es s+reet<br />\n<br />\na<br />\n<br />\n-g<br />\nNONVERBAL COMMUNICATION STUDY<br />\nMen and women undergrads sought for(study on the<br />\ncommunication of feelings through nonverbal cues.<br />\nTakes about 90 minutes, pays $3.00. Nonverbal<br />\ncommunication is one of the fastest growing and<br />\nmost fascinating areas of research in psychology. Call<br />\nor come see Dr. Hall, Ames 237, 338-7876, to get<br />\nmore,information and to sign up.<br />\n<br />\nROBINSON'S GORSUCH HOUSE<br />\n511<br />\n<br />\nGORSUCh<br />\n<br />\nAVENUE 235-2744<br />\nNEWLy-dECORATEd!<br />\nNEW MANAgEMENT!<br />\n<br />\nIFEATURiNg...<br />\ngREEk et AMERICAN CUISINE<br />\n<br />\nCOME iN<br />\n*<br />\n*<br />\n*<br />\n*<br />\n<br />\n[g]<br />\n<br />\n-g<br />\na<br />\n<br />\n50'S DANCE<br />\nMusic Provided by<br />\n`Starfire'<br />\nCelebrate the 1st<br />\nLacrosse Game<br />\nAdmission $.35<br />\n<br />\n-g-g<br />\nig Look for a Union<br />\nrg Board Dance in<br />\nli l the Glass Pavilion<br />\non April 8.<br />\n<br />\nANd TRY OUR<br />\n<br />\n5_<br />\n<br />\nFlaming shiskabob<br />\nGreek salad<br />\nPastitsio mousaka<br />\nBaklava<br />\n<br />\nAcademy Award Nominations!<br />\n<br />\nRooms available for private parties<br />\n--- Banquets --- Catering ---<br />\n<br />\nUV ULLMANN<br />\n<br />\nBURCH TRAVEL LTD.<br />\n3900 N. Charles St.<br />\n467-3900<br />\n<br />\nBEST ACTRESS<br />\n<br />\nFrom April 1 through June 14, you can fly roundtrip from<br />\nNew York to Luxembourg for only $410.<br />\nThat's $89 less than the youth fare you'd pay on any<br />\nother scheduled airline.(From Chicago you pay $458 and<br />\nsave $103.) All you have to do is be under the age of 24.<br />\nThere are no booking restrictions. And no skimping on<br />\nmeals or service. Because we give you the same service<br />\nyou'd get from other airlines, without the same high costs.<br />\nSo,if you're not flying Icelandic to Europe, you're<br />\nspending more than you have to.<br />\nWe'll give you the best deal.<br />\n<br />\nINGMAR BERGMAN<br />\n<br />\nBEST DIRECTION<br />\nIN \"FACE TO FACE\" ;A ;;;;::e ▪ •,.\\\\•<br />\n•<br />\n<br />\n• `1.=.7- •<br />\n<br />\naKee<br />\nVittorio<br />\nDe Sica's<br />\n<br />\nSave$89onjetfares<br />\nto Europe and book<br />\nanytime you want.<br />\n<br />\nvacanABiief<br />\non<br />\n<br />\nIcelandic Airlines, Dept. ##CN<br />\n630 Fifth Ave., N.Y., N.Y. 1(X)20<br />\nSee your travel agent. Or al toll free:(840 555-1212.<br />\nPlease send information on all Icelandic's low-cost fares to Europe.<br />\n<br />\nStarring Florinda Bolkan<br />\nDirected by Vittorio DeSica<br />\nAn Allied Artists Release aD<br />\naao • Color<br />\n<br />\nName<br />\nAddress<br />\n<br />\n1 .d.<br />\n<br />\n-A GREAT FILM!<br />\nONE OF LIFE'S<br />\nRICHEST<br />\nAND MOST<br />\nREWARDING<br />\nPERSONAL<br />\n- EXPERIENCES!<br />\nRe\\ Reed.<br />\n<br />\nSyndicated Columnist<br />\n<br />\n,<br />\n<br />\nCity<br />\n<br />\nState<br />\n<br />\nLFares subjectp<br />\nt4. change and 'Z.%pr,<br />\n.1 a,,.d<br />\n<br />\ni<br />\n<br />\nZip<br />\n<br />\n_.J<br />\n<br />\nLowest Jet fares to Europe of any scheduled airline.<br />\n<br />\n•<br />\n<br />\nA Film Event You Shouldn't Miss!<br />\nROTUNDA CINEMA<br />\n40th St. and Keswick<br />\n235-1800<br />\n<br />\n•<br />\n<br />\n\fmarch 18, i977/news-letter/page 13<br />\n./<br />\n<br />\nI\"<br />\n<br />\nI<br />\n<br />\n.0\"<br />\n<br />\n00'<br />\n<br />\n.•••<br />\n<br />\nLOOKING FOR WORK?<br />\n<br />\nOFFICE OF THE CHAPLAIN<br />\n\"THE SUNDAY EXPERI ENCE\"<br />\nPresents<br />\n<br />\nWhat is your resume telling an employer? I will analyze<br />\nyour current resume and/or develop a new one that will<br />\nproduce results. Call 628-7561, 10AM-9PM.<br />\n<br />\nSPANISH by experienced native<br />\nteachers - All levels, all age*.<br />\n146-2056.<br />\nPharmaKinetics Laboratories t<br />\nconducting studies to compar<br />\ndifferent brands of prescriptio<br />\nmedicines. Safety and effectivene<br />\nof these medicines have already<br />\nbeen established. If 19-30 years old<br />\nmale, healthy, you may be eligible<br />\nto participate. Studies involve<br />\nstaying over-night in our dormitoryj<br />\ntaking a dose Of medicine and the<br />\ndrawing of several small blood<br />\nsamples by skilled technicians<br />\nStudi‘es are conducted under strict<br />\nmedical superivision. Participants<br />\nare paid $70-$500 depending upon<br />\nthe length of time involved. To find<br />\nout if you are eligible you musttake<br />\na physical exam to determine if you<br />\nAre healthy. We will pay you $10<br />\nfor taking the first physical. Bring<br />\nvalid I.D. Call 366-2001.<br />\n<br />\n\"A FORUM OF HOPKINS STUDENT GROUPS<br />\nWITH SPECIAL INTERESTS AND CONCERNS\"<br />\n<br />\nYour Campus-Pride!<br />\nNEW<br />\nNEW REVOLUTIONARY<br />\nUNIQUE<br />\n<br />\nwith Representatives from:<br />\nthe BLACK STUDENT UNION<br />\nthe GAY CAUCUS<br />\nthe HOPKINS PLAY GROUP<br />\nand ASOCIAL/POLITICAL ACTIVIS I<br />\n<br />\nHISTORIC— First University Campus Postcards<br />\n•<br />\n<br />\nDifferent Superb Scenic-Views,<br />\nFrom Your Campus. On One Card<br />\nYOUR CAMPUS PRIDE GOES WORLDWIDE<br />\n<br />\n1<br />\n<br />\nThink! Think more often on your relatives &<br />\nfriends, drop them a line. They will admire &<br />\ntreasure your pride! Frame one for yourself!<br />\nSUNDAY, MARCH 20, 11:00 AM<br />\nLISTENING-VIEWING ROOM<br />\nLEVERING HALL<br />\n<br />\n16 MM MOVIES shown for all<br />\noccasions- 1000's of titles. Call<br />\nahead:Richard, 377-0762.<br />\n<br />\nU1-PRIDE CREATIVE POSTCARDS<br />\nON SALE/AT YOUR UNIVERSITY BOOK-CENTER<br />\n<br />\nThe<br />\nchallenge<br />\nHidden in this diagram are the names of<br />\ntwenty foods or snacks that go great with<br />\na cold Pabst. They may be spelled forwards<br />\nor backwards, vertically or horizontally, even<br />\n<br />\nPART TIME employment<br />\nopportunity for Student proficient<br />\nin Fortran computer programming,<br />\nMath/Stat, background considered a<br />\nphi's. Call 7 30-51 28 or write<br />\nMASINC, 10221 Wincopin Circle<br />\nsuite 216, Columbia, Md. 21044.<br />\n<br />\nWe hunt Ocean Rose<br />\nfor the Mardi Gras!<br />\n<br />\nBill's<br />\nUnivesitti SandvAch Shoppe and Deli<br />\nAd Lump Crab Cakes<br />\nGenuine Koiher Corned Beef<br />\nDelicious Roost Beef<br />\nVirginia Baked Ham<br />\nVarious C0/<br />\n1<br />\n41 Cuts<br />\nCheese(Swim, Provolone.. Muemter)<br />\nKother Hot Dogs<br />\nCatering<br />\nParty Trays(special order)<br />\nPim<br />\nHome Made Desert(Chem Cake)<br />\nIce Cream<br />\nSelect Grocery item<br />\nRants<br />\n<br />\ndiagonally, but are always in a straight line.<br />\nThe first one has been circled to get you<br />\ngoing. Your challenge is to discover and<br />\ncircle the other nineteen!<br />\n<br />\nWVARJ X<br />\nBCYPHOTDOG<br />\nMDEPCOUANPLF<br />\nMAK P I ZZAMUOUHT<br />\nE ROWGON PS V P I DS<br />\nYUJDOMECORNCH I P<br />\nTHNZAKYFTACOSBA<br />\nXACWCDS I AVERUBG<br />\nS HR I MPRSTHPNRQH<br />\nTTHGSEEHOQRJ PBE<br />\nO CELNAGNCHEESET<br />\nZAYABNRCHXTCWET<br />\n✓ EUKUUH I FZTGF I<br />\nH HRXTB I PTERAQJ<br />\nAK PSMPSALAM I<br />\nMLNASMKS_NA<br />\nRH .FCJO<br />\n<br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br />\n<br />\nPR E-M ED STUDENTS: Trouble<br />\ngetting into medical school? Let us<br />\nput you in med. school in Italy.<br />\nContact immediately: A.M.S.I., Box<br />\n155, Landenberg, P \". 19350, dr<br />\ncall: (215)-274-8951<br />\n<br />\nRESTAIMUNIT & CARRY OUT<br />\nnom 4674362<br />\nUPSIVIDIMINTY PARKWAY<br />\n114 - Fri: 9:30 - 7:00<br />\nAT APT. PAUL.<br />\nL.<br />\n1.41111011111111111fTY ONE ARIL<br />\nSat: 9:30 - 2:00<br />\nMod Sundays<br />\nFREE SODA WIT9 TM1S A n AND<br />\nPURCHASE OF S1.00<br />\n<br />\n(UNIVERSITY STUDY<br />\nInterested in earning university credits<br />\nwhile exploring a new land in all its<br />\naspects? Why not consider a summer.<br />\nsemester, year, or degree program at<br />\none of Israel's seven leading<br />\nuniversities. Religious studies,<br />\nhumanities, the social sciences and a<br />\nhost of other courses are offered in<br />\neither English or Hebrew with special<br />\nemphasis on helping you get a grasp<br />\nof Israel. Whether it be in Jerusalem,<br />\nHaifa, Tel Aviv or the Negev, a study<br />\nprogram at an Israeli university will<br />\ngive you a new feeling about Israel<br />\nand yourself as well. Write for a/<br />\nbrochure giving information about all<br />\nthe universities and the programs they<br />\noffer.<br />\nCouncil for Advancement<br />\nof Study Programs<br />\nat Israeli Universities,<br />\n515 Park Avenue, New York,<br />\nNew York 10022,(212)751-6070<br />\n<br />\nFor information, please send to the above address.<br />\nName<br />\n<br />\nAge<br />\n<br />\nAddress<br />\n<br />\nPABST. Since 1844.The quality has always come through.<br />\n<br />\nCity<br />\n<br />\nC1977 PABST BREWING COMPANY Milwaukee Ws Peoria Heights III ,gewark NJ Los Angeles Calif Pabst Georgia<br />\n<br />\nUniversity<br />\nI.L.L3HOVdS V\\IVH SOOV1 000<br />\nLOH HOIMONVS Sd1H0 N HSIJ SdIHD NUOD di/11181-1S A3)1811.1 N3>IDIHO A339 099 N900<br />\nsPc..3 ..PP!H<br />\n-dOd VZZId )4V31S H30t3n9INVH ST:3Z13Hd liNtrIVS 3S33HD SdIHD 01V10(.1<br />\n<br />\nState<br />\n<br />\nZip<br />\n<br />\n.14<br />\n<br />\n\fpage<br />\n<br />\n14/news-letter/march 18, 1977<br />\n•<br />\n<br />\nCOLOR NOTES<br />\n<br />\n•<br />\n<br />\nJohn Allan, Wayne Abernathy, and<br />\nMarci Foggan are not returning to<br />\nHomewood next year(hurrah!). This<br />\ncreates vacancies among the officers<br />\nof the Johns Hopkins Republican<br />\nClub. Therefore, the JHU—GOP club<br />\nwill be holding General Elections for<br />\nofficers Tuesday, March 22 at 6:30<br />\n, p.m. in Rowland 300:<br />\nIt's back again! Yep, the<br />\nStarlighter! The Fl-Club is once again<br />\nsponsoring its moonlight cruise. The<br />\nbig date is May 7 at 8:30 p.m. Tickets<br />\nwill be sold on a first come—first serve<br />\nbasis at the Athletic Center from 1-3<br />\ndaily. There are a limited amount so<br />\nget. your tickets. Don't be left<br />\nstanding at the dock with your thumb<br />\nin your nose. One big night of<br />\ndancing, drinking (mixed drinks),<br />\neating (and swimming?).,At $12.00<br />\nper couple, what more can you ask?<br />\n<br />\nI<br />\n<br />\ngri<br />\n<br />\nAn Evening of<br />\nWhole Earth Music<br />\nwith the<br />\n<br />\nPAUL WINTER<br />\nCONSORT<br />\nMonday,March 28<br />\n8 p.rn.<br />\nField House<br />\n<br />\nESSEX COMMUNITY COLLEGE<br />\n$2.50 Admission<br />\n$1.50 ECC Students<br />\n<br />\n11-1E BOLTON HILL FRAME SHOP<br />\n<br />\nFULL SERVICE CUSTOM FRAMING AND<br />\nQUALITY CRAFTS AT REASONABLE PRICES<br />\n<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n()<br />\n0<br />\n()<br />\n()<br />\n0<br />\n<br />\n15% OFF OP ANY FRAMING ORDER<br />\nwri-N 11-PS AD.<br />\nIIS NC1`4ECHEN STREET<br />\n212.17<br />\n(26q -6333<br />\nNON lUES WED FRI falo 71-1UFt.5 104:30 5C' 10-5<br />\n<br />\n0<br />\n0<br />\n<br />\nTickets Available: 682-6202<br />\n9<br />\n<br />\n-<br />\n<br />\nThe Johns Hopkins University<br />\nJewish Students Association is<br />\nsponsoring a bagel brunch this<br />\nSunday, March 20,, in the Kosher<br />\nDining Hall, from 11:30 to 1 o'clock.<br />\nAll the bagels, lox, white fish, and<br />\ncream cheese you can eat for one<br />\ndollar.<br />\nThe Jewish Students Association is<br />\nsponsoring religious services on Friday<br />\nnight at 6:30 in the Kosher Dining<br />\nHall. Saturday Afternoon Services will<br />\nbe held at 5:30 in the KDH.<br />\n<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n<br />\nsuommusteantr<br />\n<br />\n(..--\\\\........\\__<br />\n<br />\n,.....,r<br />\n„c„, ---, ,--\"7<br />\n....<br />\n<br />\n• .<br />\n<br />\no•<br />\n<br />\n-<br />\n<br />\n--r,<br />\n......<br />\n<br />\n--...\\,? )<br />\nt<br />\ns-.--:<br />\n\"<br />\n. 4 -t Iiis<br />\n<br />\n1<br />\n<br />\n'' --\\\\<br />\n.)...1<br />\n<br />\n7.<br />\nN.\\,n --51•.... =<br />\n<br />\n11:<br />\n11<br />\n<br />\n-.'<br />\n<br />\n.......<br />\n<br />\n.,,,,<br />\n<br />\n%.1<br />\n)<br />\n: s'-`\\. --•;\"\\-N<br />\n,<br />\n<br />\n•<br />\n<br />\n.....<br />\n<br />\n.11011.0.1.<br />\n<br />\n1%<br />\n<br />\n•<br />\n<br />\nA paid typist is needed for the<br />\nSpring Fair. If interested, call<br />\n338-7682.<br />\nThe finals of the First Annual<br />\nJohns Hopkins Open Squash<br />\nTournament will be held Wednesday<br />\nafternoon, March 23. The public is<br />\ninvited.<br />\nBIA Lacrosse Deadline for rosters is<br />\nFriday March 25. Rosters can be<br />\npicked up in the Newton H. White<br />\nAthletic Center. It is important that<br />\nthe rosters are in before vacation so<br />\nthe schedule can be made up.<br />\n<br />\nB1S/M3S OPPORTUNffY<br />\n<br />\ntuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nhninediate Earnings<br />\nSend $1.00 To:<br />\n<br />\nEnvelopes Dept.339*<br />\n310 Franklin Street<br />\nlisten<br />\ns<br />\nLIVE! OH STAGE!<br />\nTHE 50's COME TO LIFE!<br />\ningest<br />\ndanc<br />\ntovvd<br />\nshoW in<br />\n<br />\n\\<br />\n<br />\nAO\"`1\\<br />\n<br />\n1)<br />\n<br />\nPut your expensive eye<br />\nbehind our inexpensive System 35:..and WOW.<br />\n<br />\nCHARGE TICKETS<br />\n<br />\nBY TELEPHONE WITH<br />\nYOUR CREDIT CARD.<br />\nPhone(301)727-4103<br />\nTickets available at<br />\nall T)cketron outlets<br />\n<br />\nTHE NEW<br />\nMECHANIC<br />\nMorris A. Mechanic Theatre<br />\nHopkins Plaza, Baltimore<br />\nANEW .1111111. .111111111.<br />\n<br />\n.0111i<br />\n<br />\nJOHN GA CH BOOKSHOP<br />\nBALTIMORE'S LARGEST<br />\nUSED BOOKSTORE<br />\nI<br />\n<br />\n3322 Greenmount Ave.<br />\n467-4344<br />\nUSED AND RARE<br />\nOLD AND OUT—OF—PRINT<br />\n•41.1.<br />\n<br />\n•IIMP•<br />\n<br />\nI1<br />\nI<br />\nI ,h'Ik<br />\nI<br />\nI<br />\n<br />\n.111111.• ••IMM• .1111•• I<br />\n<br />\nJust about any of the great photographs you see<br />\ncould have been taken with Vivitar System 35.<br />\nPlus one good eye. Vivitar System 35 is a most<br />\ninexpensive way to get serious about photography.<br />\nThe basic limitation is your own creativity and skill.<br />\nVivitar 220/SL 35mm camera Center-weighted<br />\nmatch needle metering system/Speeds from<br />\n1/1000 to 1 second plus \"B\" for time expo- _<br />\nsure/Electronic flash sync at 1/125th<br />\nsecond/Universal thread mount 50mm<br />\nf1.8 lens/En'ilt-in hot shoe/Self timer/<br />\nFilm-in -chamber indicator/ASA Range<br />\n25-1600. Vivitar Automatic Electronic<br />\nFlash Up to 200 flashes from one single<br />\n<br />\n.Ponder & Best, Inc<br />\n<br />\n1977<br />\n<br />\nVivitar System 35<br />\n<br />\n9 volt alkaline battery. Vivitar Automatic<br />\n135mm f2.8 lens Super focal length<br />\nfor portraits/About 21/2 times larger than<br />\nnormal image. Vivitar 2X Tele Converter<br />\nDoubles'the effective focal length of your<br />\nlenses/Converts the 50mm lens to 100mm/<br />\nthe 135mm lens to 270mm.Vivitar Enduro<br />\nCase Carries the entire system comfortably and securely while hiking, cycling,<br />\nskiing, etc. Find the nearest Vivitar dealer and<br />\nask for a demonstration.<br />\nMarketed in the U.S.A. by Ponder & Best, Inc.<br />\nCorporate Offices: 1630 Stewart Street, Santa Monica,<br />\nCA 90406. In Canada: Vivitar Canada Ltd./Ltee<br />\n<br />\n\fmarch 18, 1977/news-letter/page 15<br />\n<br />\nLaxinen defeat Hobart.<br />\nYale next victim Saturday<br />\nPlaying on a chilly Homewood Field Wednesday<br />\nafternoon, a pack of Blue Jay stickmen warmed up for<br />\ntheir regular season opener by whipping a hot Hobart<br />\nsquad, 17-10.<br />\nThis was Hopkins' final inter-collegiate scrimmage<br />\nbefore hosting Yale Saturday afternoon when the Jays<br />\nbegin pursuit of the 1977 national championship.<br />\nFIobart provided an excellent test for JHU. The visitors<br />\nfrom New York state are defending National champions.<br />\nin Division II and, according to Homewood coach<br />\nHenry<br />\nCiccarone, \"play a gambling style of lacrosse that<br />\n(Hopkins) probably won't see too much of during the<br />\nseason.\"<br />\nThe Jays had played sluggishly during the first quarter<br />\nof their previous two scrimmages, but such was not the<br />\ncase on Wednesday afternoon. Hopkins opened with a<br />\ntremendous rush and it looked as though Hobart would<br />\n'be run right off th6 field and clear across University<br />\nParkway.<br />\nJHU opened the scoring early in the opening period,<br />\nculminating a series of passes in which over half the team<br />\nmembers on the field had possession of the ball. After<br />\nmaking a save, goalie Kevin Mahon passed out to<br />\ndefenseman Mark Greenberg. Defenseman Leroy Katz,<br />\nattackman Mike O'Neill and midfielder Tom Myrick also<br />\nhad the ball before Doober Auburn fired home the game's<br />\nOpening goal.<br />\nOn the ensuing face-off, middie Bob Maimone got the<br />\nball to Dave Huntley. Huntley returned it to Maimone<br />\nand Bob put a 15-foot bullet past the helpless goalie.<br />\nMaimone notched his second goal of the contest minutes<br />\nlater and JHU held a 3-0 lead before Hobart knew what<br />\nhad hit them.<br />\nHowever, the visitors came storming back with three<br />\ngoals of their own to knot the score midway through t!<br />\n<br />\nquarter. This tie was shortlived as Huntley, Hirsch and<br />\nBob DeSimone scored for Hopkins before the period had<br />\nended and the Jays held a 6-3 lead after the game's first<br />\nfifteen minutes.<br />\nThe second quarter was marked by a definite letdown<br />\nin the pace of play, as compared with that in the first<br />\nperiod. Neither team played consistently well for any<br />\nlength of time and there was little sustained offense at<br />\neither end of the field. Both squads tallied a pair of goals<br />\napiece (DeSimone and Jon Swerdloff for JHU) giving<br />\nHopkins an 8-5 halftime bulge.<br />\nAs contrasted with their performance in the second<br />\nperiod, the Blue Jays' effort in the third quarter was<br />\nexcellent. The offense regained some of the life and style<br />\nit had exhibited in the opening quarter, while the defense,<br />\nsave for one mental lapse, totally shut down the Hobart<br />\nscoring machinery.<br />\nThe Jays outscored fheir visitors 4-1 in this third<br />\nfifteen minutes of action to take a commanding 12-6 lead<br />\ninto the fourth quarter. Swerdloff, a freshman from<br />\nBaltimore, paced the attack with a pair of goals.<br />\nThe game was no longer in doubt during the final<br />\nperiod, a situation that gave both coaches a chance to rest<br />\ntheir starters. Play became sloppy once again, although<br />\nthe scoring did not cease. The Jays added four goals to<br />\ntheir total, with Swerdloff having a goal and an assist to<br />\nbring his point total to five for his'afternoon's work.<br />\nCiccarone was not particularly happy with the team's<br />\noverall play, but did see aspects of the game that he hopes<br />\nto see continue.<br />\n\"I was pleased with the way we capitalized on some of<br />\ntheir defensive mistakes,\" the Coach noted. \"In addition,<br />\nour defense did a good job—we gave them a few goals and<br />\nthen we shut the door.\"<br />\nConcerning Saturday's opponent, Yale, the third year<br />\n<br />\nmentor said, \"I don't know anything about them and that<br />\ncould be dangerous. But, if we play the way we're capable<br />\nof playing, we should beat them.\"<br />\n• The Bulldogs from New Haven are 1-1 on the season so<br />\nfar having beaten North Carolina State and lost to Duie.<br />\nGametime on Homewood field is 2:00.<br />\n<br />\nIn the springtime one's fancy<br />\nTurns to love and baseball<br />\n<br />\nLegged<br />\n<br />\nweapons of<br />\n<br />\nWhile springtime may shift many Hopkins' minds Baltimore, and<br />\noutfielder George Coutros of nearby<br />\ntoward the spring fair, lacrosse, or, in general, the winding Cockeysville.<br />\ndown of the school year, for some, the warmer weather<br />\nThe set of returning vets include co-captains Bob Babb<br />\nsignifies the retuyn of baseball to the Homewood of Bloomsburg,<br />\nPennsylvania and David Emala of<br />\ncommunity.<br />\nRandallstown, Maryland, plus the team's number one<br />\nAnd because the Blue Jay nine are coming off their hurler of a year<br />\nago, Charlie Lachenbruch of Los Altos<br />\nbest season ever and are entering the season with a core of Hills, California. Other<br />\npitchers returning are sophomore<br />\nreturning veterans as well as a set of promising freshmen, Steffan Burns and<br />\nJunior Jason Sussman.<br />\nCoach Dennis Cox believes that baseball has \"come of<br />\nAt this point, the Jays are winding down their<br />\nage\" here at the University.<br />\nexhibition season in preparation for their season opener<br />\nThe Jays are coming off a super season in which they to be held on Thursday,<br />\nMarch 24 at the Homewood ball<br />\ncompiled a league record of 13-3 in the Middle Atlantic field when they meet<br />\nMt. St. Mary's in a double-header.<br />\nConference. This mark earned the team a berth in the In a scrimmage held<br />\nTuesday at home, the Jay nine were<br />\nNCAA Division II play-offs, in which they advanced to defeated by Essex<br />\nCommunity College by the score of<br />\nthe second round before being eliminated.<br />\n5-3.<br />\n1976' graduation cost the Blue Jays five key players in<br />\nStarting pitcher April got off to a shaky start, when in<br />\nace pitcher Billy Jones (5-1),• second baseman Lou the first inning he gave<br />\nup two runs. The first tally was<br />\nPodiazek, shortstop Tom Pedioni, catcher Jim Duffy, and driven in by a long<br />\ntriple to right field by an Essex player.<br />\ncenter fielder Larry Santoro, but the ball club has some This player came down<br />\nthe line to cross the plate when<br />\nkey freshmen prospects.<br />\nApril uncorked a wild pitch that slipped by catcher Mark<br />\nFirst-year man Frank Parreira should become a Buchta.<br />\nHopkins' mainstay in the pitching rotation. Last year, in<br />\nThe Jays fought back successfully taking the lead in the<br />\nleading Arundel High School to victory in the state bottom of the fifth inning. Earlier<br />\nin the third, the home<br />\ntournament, Parreira was named by the News-American as team had tied the score when<br />\nsenior Babb walked, was<br />\nPlayer-of-the-Year.<br />\nsent to third when freshman John Santo reached on an<br />\nOther frosh hopefuls include pitcher-outfielder Mike error, and was batted<br />\nin by junior Emala when he also<br />\nApril of Potomac Maryland; catcher Rick Law of reached on a ground ball<br />\nerror. Outfielder Dave Lewing<br />\ntied the score by sending a line single to left. In the fifth,<br />\nBabb again scored when he singled to center, stole second<br />\nbase, and was driven in by a single from frosh Brad<br />\nRosborough.<br />\nThe Jays were unable to muster any other offense in<br />\nthe game, while giving up three runs to Essex. The visitors<br />\npicked up two more in the seventh on a triple, and error<br />\nby pitcher Lachenbruch, and a sacrifice. The insurance<br />\nrun came in the top of the ninth, driven in by a double up<br />\nthe alley in right center.<br />\nExhibition games vyill continue through next week.<br />\nTomorrow the team will have a double-header away<br />\nfacing Dundalk College. The 23 game schedule is a bit<br />\nrigorous this year and Coach Cox has expressed some<br />\nconcern about the ability of his pitching staff to handle<br />\nthe extra load, especially the eight scheduled<br />\ndouble-headers. But the entire team is optimistic about<br />\ngut and wood battlefield.<br />\nthe coming, hoping to improve on last year's season.<br />\n<br />\n\faapod pinup<br />\n<br />\nINdEpENdENCE POiNTe DELAWARE<br />\n<br />\nA bright little spot to while away<br />\nthe Spring Vacation. Can only be reached<br />\nby boat -- a number of local firms ranging<br />\nfrom wooden six-seaters to high-speed<br />\ncruisers will spirit you across the waters.<br />\nOnce in Independence Point, you'll find a<br />\ngas station, some bar stools, and a score of<br />\nunderage chickens. Those are the most<br />\nrecent lodor highlights. The rest is pure<br />\nIndependence. You can't get it anywhere<br />\nelse.<br />\n<br />\n--rift<br />\n—ZARaft<br />\nt..<br />\n<br />\nHopnaidi, NEw McKim<br />\nHopewell is not a town for the meek. In<br />\n1968, at' the height of the protest years, the<br />\nsmall settlement evicted all men over the age<br />\nof twelve and passed ordinances to clip out all<br />\nmasculine pronouns from incoming mail.<br />\nHopewell approaches its tenth anniversary in<br />\nfine fashion, and is rumored to be on the verge<br />\nof a big land-trade with one of New York<br />\nCity's boroughs. Meanwhile, just remember<br />\nthat if you plan to visit Hopewell, bring a<br />\ndress.<br />\n<br />\n\"Oeit urt<br />\n<br />\n('a/or Bay is the<br />\n/) 1(1 e to be in<br />\nFlorida .for the<br />\nSpring. ,N0<br />\nbeach -b la nkel<br />\nl)ingo n 0 wadays,<br />\nsnappy dress like vi'<br />\nCroc on the right is<br />\na must in these<br />\nparts. Once the<br />\nclothes (and proper<br />\ngrip on beer cup)<br />\nare mastered, Gator<br />\nBay offers up all its<br />\npleasures to the .<br />\ndedicated<br />\nfun -seeker. For'<br />\nstarters, !here's the<br />\nin a ra thon Swamp<br />\nWeekend.<br />\n<br />\nGATOR Bay, FloRidA<br />\n<br />\n\f", "format": "basic_html", "processed": "'Tis<br /><br />\nA gREAT<br /><br />\ndAy<br /><br />\nTO bE 111141<br />\nby SEAN MACCONSAWIN<br /><br />\nEvery St. Patrick's day, there is always someone who wants to know<br />\nWhy it is that the Irish have a day all unto themselves, why it is that the<br />\nIrish deserve a day. To the average American, Ireland is a picturesque little<br />\nisland where the people spend their time getting drunk, speaking with odd'<br />\naccents, and talking about funny soap with green specks in it.<br />\nFew realize the actual historical and cultural importance of Ireland. For<br />\nexample, very few know that between the fall of the Roman Empire and<br />\ntile rise of culture in Renaissance Italy, it was Ireland that kept the lamps<br />\nk)-1: learning lit in Europe. Fewer still would even believe that it was the<br />\nIrish who introduced divining to poetry. And even those aware of<br />\nIreland's recent literaiv import are not fully aware of Irchind's literary<br />\nheritage.<br />\nTo begin with, St. Patrick was not important to just Ireland, he was<br />\nimportant to the whole of Northern Europe. The conversion of Ireland led<br />\niirectly to the conversion of :the rest of Northern Europe, as Ireland<br />\nbecame an important point for sending out missionaries. To give sonic<br />\nIdea of how many missionaries Ireland sent out, the Schedae de islandia of<br />\nAra Multiscilus list 150 Irish saints who were sent to Germany, 45 to<br />\nGaul, 30 to Belgium, 44 to England. 13 to Italy, and 8 to Norway and<br />\nIceland. In addition to this, there were over one hundred monasteries<br />\noun ded outside of Ireland by these mission iries .Iii i strong sense, St.<br />\nPatrick's cLiy celebNites the introduction of Christitnity to most of<br />\nNorthern Europe.<br />\nAnother reason for ikt hcans to be enthusiastic about St. Patrick's<br />\nDay is that there is reasonable evidence to support the theory that<br />\nAmeriCa was visitie&amp;by St. Brendan is early as the cigth century AD.<br />\nThere is a tradition iliong the northmcn, that is, the Vikings and their<br />\nt.lan Vineland, which<br />\ndescendants,-t- hat tlotiWaS a region farther SouthI<br />\nthey called irlaod cI inikla (Ireland the great). There is also a<br />\ncorresponding tradition among American Indians.<br />\nSimultaneously, Ireland maintained what were amost the only schools<br />\nin Europe which dealt with Classic Literature. One need only point to the<br />\nBook of Kells ;Is an example of the mere craftsmanship of Ireland's<br />\nAbbeys. This book, which is considered by many to be the finest example<br />\nof illuminated manuscripts in existence, probably dates back to the eigth •<br />\ncentury: what in Europe from that period could equal it?<br />\nIrish scholarship from the eighth to the tenth centuries was supreme ill<br />\nEurope. During thi.s period, anyone North of central Italy who read Greek<br />\nWas either Irish or taught by one, Towns such as Aix, Tours, Marseilles,::<br />\nSalzburg and St. Gall are heavily indebted to the Irish for their cultural<br />\norigins -- in fact. the Irish Missionaries responsible for theowns arc tihi<br />\nmentioned in those towns' benediction rites.<br />\nIn iddition, the indigenous Celtic liteniture Uftt e an has been classed<br />\neqwil to thtl\"lifq121-e- Greeks. Although only<br />\ny many scholars<br />\nrecently recognized, the ancient sagas carry as strong a sense of character<br />\nand insight into the human condition as any of the Greek myths, and<br />\ncertainly more than the Norse sagas. Perhaps the best modern examples of<br />\nthe eloquence of Irish mythology are Yeats' poems based on them.<br />\nIt was this Celtic literature which 'also introduced the concept of<br /><br />\nrhymed verse to literature. Perhaps because of the inherent musical sense<br />\nof the Irish, perhaps because of the exquisite fluidity and expressiveness<br />\n.of Gaelic, the Celtic poets in Ireland were employing an advanced form of<br />\nrhymed verse as early.: as the eighth century, when the first Arabic<br />\nexamples appeared.<br />\nWhat then happened to the Irish? How it that a nation so proud, so<br />\npowerful could be so fallen, so weak? One may be tempted to point out<br />\nthat neither Greece, Rome, Israel or Italy are major powers at present,<br />\neven though they were at one time the centers of the world's civilization.<br />\nBut an analogy is not an acceptable explanation.<br />\nTo be blunt, what happened to Ireland was England.<br />\nIt would be pointless to fully trace the history of Irish subjugation by<br />\nthe English: for our purposes let us start with Oliver Cromwell. Cromwell,<br />\nLord Protector of England, protestant despot and murderer of Charles I.<br />\ndid not take kindly to the fact that most of Ireland was Catholk. It was<br />\nnot enough for him that most of Ireland's land had been given over to<br />\nEnglishmen as political plums (e.g., Sir Walter Raleigh, who introduced<br />\nthe potato to Ireland). It was not enough that an Irishman was not<br />\nallowed to own a horse not worth more than six pence.<br />\nCromwell was fond of such things as laying siege to Irish towns, and<br />\nslaughtering Irish Catholics, \"in the name of God.\" Cromwell was fond of<br />\nselling Irish women and children into slavery.<br />\nThings got worse. In a 'fight for the British crown, all of Ireland except<br />\nthe predominantly Protestant Ulster backed Otholic James: unfortunately,<br />\nthe Protestant William of Orange was victorious. Here is where the<br />\nprevious rivalry between Ulster and the rest of Ireland grew into a full<br />\nscale hatred. The Battle of the Boyne in 1,00, which was not the major<br />\nmilitary engagement of the war, still holds.'' rific emotional significance<br />\nfor Irishmen, symbolizing is it does Irchind last hope for parity with<br />\nCatholic England.<br />\nAnother shot at independence rose gloriously on Ireland's political<br />\nhorizon with the coining of Parnell, but even there, Ireland was met with a<br />\nfailure. Parnell, a gifted politician and even gifted orator, is considered<br />\ntoday to have been the only man capable of brining about a peaceful<br />\nindependence, but his disgrace through his illicit affair with Kitty O'Shea<br />\nproved fatal politically.<br />\nFinally in 1916, Ireland gained her self respect, and in 1918, her<br />\nindependence. Yet after almost eight hundred years of progressive English<br />\nsubjugation, Ireland is not a world power by any means.<br />\nNone the less, Ireland's contributions have been immense. In the field<br />\nof writing, most of the great English language writers of the past eighty,<br />\nyears have been Irish. One is hardprcssed to think of greater writers, poets,<br />\nor dramatists than William Bader Yeats, lames Joyce, George Bernard<br />\nShaw, Samuel Beckettt, Oscar Wilde or Brendan Behan. In fact, one is<br />\nrather hardpressed to think of an English-born• writer of the period of<br />\neqiuil status.<br />\nHere in America, though, the average Irilbinan is characterized as a<br />\nil, and eager to kill people<br />\n'<br />\nheavy drinking Catholic, who is poor, boastril<br />\nover some stupid religious difference. Because it is common to read how<br />\nmany people have been killed in the last three years of sectarian strife in<br />\nNorthern Ireland it is easy to be oblivious of the fact that more people<br />\nhave been killed in civil disturbances in Jamaica than Northern Ireland<br />\nduring the same period of time, and that the Christian vs. Moslem war in<br />\nLebanon has claimed more lives in a year than violence in Northern<br />\nIreland has in the last five. Nor do most people realize that the society in<br />\nNorthern Ireland is structured against Catholics as solidly as Mississippi<br />\nwas structured against blacks in the fifties.<br />\nRather than think of the Irish as drunkards, blowing up whatever they<br />\ncan, think of them as a people dispossessed of the homeland. Better still,think of them as the much abused, oft-forgotten cornerstone of modern<br />\nEurope. •<br /><br />\npage 2/news-letter/march 18, 1977.<br /><br />\nCongresswoman Shirley Chisholm:<br />\nFull of outrage and sorrow<br /><br />\nBy MIKE GIULIANO<br />\nShirley Chisholm, the first black congresswoman in<br />\nAmerica, represents a New York district which includes<br />\nBedford-Stuyesant, one of the nation's largest ghettoes.<br />\nThe 52-year-old Chisholm became a national political<br />\nfigure in 1972 when she made a presidential bid and<br />\nreceived 152 delegate votes. Speaking March 9 at the<br />\nCollege of Notre Dame on the topic \"Women and Work in<br />\nAmerica: Then and Now,\" Mrs. Chisholm displayed an<br />\nintense awareness of \"the unwillingness of our society to<br />\nallow women to share in the American dream.\"<br />\nThere is a pattern to American history, contended<br />\nChisholm, which explains how we 'arrived at a<br />\ndiscriminatory system of laws. Early colonial laws were<br />\nbased on English common law, in which women were<br />\nproperty, and early American legal documents were much<br />\nthe same: \"The Constitution and the Bill of Rights were<br />\nwritten by and for men.- In American history books<br />\nthere is little mention of women, those who played<br />\ncrucial roles in the growth of the West and of cities.<br />\nChisholm traced the ways in which discriminatory work<br />\npractices, like many American history books, have made<br />\nsecond class citizens of women: \"Since work is a source<br /><br />\nof fulfillment and success, discrimination on the basis of<br />\nsex deprives women of one basic way to success.- Women<br />\nwere discouraged from working, were encouraged to stay<br />\nhome: Indeed, a woman interested in physical labor was a<br />\nsocial outcast.<br />\n\"Women had entered into the labor force at times<br />\nwhen the economy demanded it. [In World War Two]<br />\nwomen were welcomed into the factories and assembly<br />\nlines to produce nitions for war.\" But, when the war was<br />\nover, after women had proven their capacities, they were<br />\nsummarily pushed aside. It was no longer acceptable for<br />\nwomen to work, and many who wanted to work were<br />\nconsidered unpatriotic, because they deprived returning<br />\nsoldiers of jobs. \"That pattern has been reinforced in<br />\nevery aspect of our society.\"<br />\nChisholm compared the feminist movement of today<br />\nwith the Civil Rights movement of the 1950's and 1960's,<br />\nwhen large numbers of women, black and white,<br />\ndemanded equal rights for blacks. \"Out of this struggle we<br />\nput laws on the books. In doing so the federal government<br />\nhelped to end discrimination by race...Many women who<br />\nhad marched in Selma began to realize that discrimination<br />\non the basis of sex was just as dehumanizing, just as<br />\ndemoralizing, as discrimination on the basis of the color<br /><br />\nAn open<br />\nktter to<br />\nMartin<br />\nMandel<br /><br />\nDar Marvin:<br />\nWhen St. Patrick expelled tile snakes from Ireland, a<br />\nfew good swimmers in the lot widoubtedly made their.<br />\n.way to Maryland. But I am not writing this letter merely<br />\nto inform you of my successful search for the roots of<br />\nyour family. Rather, I am impelled t9 ask you, as a man<br />\nwho owes his livelihood and reputation (such as it is) to<br />\nthe Democratic Party, how you could be so disloyal and.<br />\ninconsiderate to the members of that party as to award a<br />\nlucrative and prestigious seat in the House of Delegates to •<br />\na heathen Republican? Or is your memory as short as you<br />\nare?<br />\nIn the many years of our mutually profitable.<br />\nassociation, there have been a few surprises on both sides,<br />\nto be sure. But I had never figured you for a traitor to<br />\nthat great party which has enabled us to feed so fully and<br />\nso well from that richest of all larders: the public trough.'<br />\nEven if no qualified candidate could be found for the seat•<br />\n(as was certainly not the case, for I am reminded of the.<br />\ncontrary state of affairs every time I look in the mirror),<br />\nit would have been an easy thing to fill the post with a,<br /><br />\npossible.<br />\nIn the federal government, Chisholm is disturbed by<br />\nthe fact that in a country where half of the population is<br />\nfemale , there are 19 women members of a 435 member<br />\nCongress. Chisholm feels, however, that \"the President is<br />\nmoving in the right direction. You will see [in the Carter<br />\nadministration] the greatest number of women that have<br />\never been selected in any administration of this country.<br />\nHe didn't put enough women on the top level, but at least<br />\nit's a beginning.<br />\n\"When I was making a bid for president I wanted a<br />\nmultifaceted cabinet, because that's America.\" Chisholm<br />\nstated to one of her opponents[left unnamed], that she<br />\nwanted Indians, women, and Blacks in her cabinet, to<br />\nwhich he replied: \"They aren't qualified.\" At that very<br />\nmoment she had three Indians, all with Ph.D.s. all<br />\nexperienced and intelligent women under consideration<br />\nfor Secretary of the Interior. Chisholm went and did some •<br />\nresearch, looked into the qualifications and records of<br />\nsome of the men who have been put into that office in<br />\nthis century, and one need hardly add that 'she was not<br />\nuplifted by what she found.<br />\nShirley Chisholm was full of outrage and sorrow<br />\nbecause of the \"tremendous waste of physical and<br />\npsychical energy that could be given to ameliorate<br />\nhumanity. It is time, past time, that women be accepted<br />\non the political force and the labor force of this nation.\"<br /><br />\nV-P Benton<br />\nresigns<br /><br />\nloyal party hack. If anonymity had indeed been the<br />\nprime<br />\nqualification for the job, surely a cursory search of your<br />\nChristmas card list would have elicited a plethora<br />\nof<br />\nunknowns, has-beens, and Ne'er-to-be's, any one of whom<br />\nwould have made a splendid delegate. But instead<br />\nIn a mimeographed letter to colleagues in the<br />\nof<br />\ntaking the sane course of action, Marvin, you in<br />\nAdministration and Faculty, Dr. George S. Benton<br />\nyour<br />\ninfinite wisdom chose to spit in the face of every<br />\nresigned his post as Vice -President for the Homewood<br />\nDemocrat in the state of Maryland. I am taking<br />\nDivisions, effective July 1. Citing a desire to resume<br />\nthis<br />\nopportunity to salute you for this daring(though lunatic) teaching and devote more time to \" national science<br />\nact and to urge you, since you are so fond of Republi<br />\npolicy' Beottin went on to express his belief that many<br />\ncans<br />\nof a sudden, to ask Jerry Ford to head up your defense<br />\nof his goals as Vice-President had been accomplished, such<br />\nfund.<br />\nas the reorganization of the library and the creation of<br />\nTo come to the point, Marvin you crud, why didn't<br />\nstudent services.<br />\nyou give me the job? Dammit, I earned the bloody seat!<br />\nDr. Benton will return to his post as Professor in the<br />\nWho bought 15 drinks at your last victory party? At<br />\nDepartm<br />\nent of Earth and Planetary Sciences, with joint<br />\ntwo<br />\nbucks a shot for watered-down Pride of Baltimore<br />\nappointment in the Department of Mechanic'a and<br />\nbourbon? Who persuaded the Pallottines to shell out<br />\nMaterials Science. Before returning, he Will take a<br />\nfor<br />\nyou when you were hurting? Who spread<br />\nthe \"long-delayed sabbatical \".<br />\nwalking-around money throughout Hampden, so thick<br />\nAs the first step toward administrative reorganization<br />\nthat you could skate on it? Who got out<br />\nthen newly-installed President Muller, Benton was<br />\nby<br />\nthe<br />\nSheppard-Pratt vote for you to put your ticket over<br />\nappointed Vice-President of the Homewood Divisions in<br />\nthe<br />\ntop in Towson?<br />\nMarch 1972. Dr. Benton had responsibility for all<br />\noperations on the Homewood campus, as well as for<br />\nYou knew I was hungry. You knew I needed the gig.<br />\nproviding liason with the School of Advanced<br />\nHow could you do this to me? Now that you're a big-shot<br />\nInternational Studies in Washington, D.C.<br />\nin Annapolis, is it too much to throw a crumb to your old<br />\n410••••••••••••••••••<br />\nfriends at the two-dollar window?<br />\nThe lakes of Killarney could not hold the tears of •<br />\n•<br />\n1. Toward an ethical society<br />\nsorrow you're to be crying once revenge is taken for your •<br />\n2. Television and society: the •<br />\nmonstrous act of betrayal. There is a jury that cannot be •<br />\nworld in 21 inches (diagonally)I<br />\nfixed, a jury for whom the only just verdict has already<br />\n0<br />\nu<br />\n)<br />\n3.<br />\nNature<br />\nis a hanging judge<br />\nn_<br />\n•<br />\n•<br />\nbeen decided upon. The jury of the party faithful finds<br />\nwo4.<br />\nThe<br />\nnature<br />\nof power<br />\nW<br />\n&gt;- 0 5. The<br />\n•<br />\nyou guilty of treason and sentences you, excommunicate<br />\ndirection of our future<br />\n•<br />\nthat you are, to live with yourself. Some scoundrels just •<br />\n6. America the leader?<br />\n•<br />\nmight be able to so, you know?<br />\n7. Future world<br />\nTimothy P. Monaghan ••••••••••••••••••<br />\n•<br />\nPC<br /><br />\nN4 pRofik<br /><br />\nof one's skin.<br />\n\"There are thousands of women who have economic<br />\nand psychological needs to work. More women need to<br />\nwork today than ever before.\" As nearly half of our<br />\nmarriages are ending in divorce, \"the number of women<br />\nwho head households is increasing.\" One in every seven<br />\nchildren in this Country is raised in a family where the<br />\nfather is absent. In the last decade alone the number of<br />\nsingle parent households has risen 60%. The Urban<br />\nInstitute reports that 48% of American families headed by<br />\nwomen have incomes which. fall below the poverty level.<br />\nThese women, according to Chisholm, are either<br />\nunemployed or underemployed, and there is not an<br />\nadequate system of day care centers for their children.<br />\nMiddle class women often need to supplement family<br />\nincomes, because of inflation and because the costs of<br />\nmaintaining a home have skyrocketed, while wage<br />\nbenefits have not been adequately raised. These women<br />\nneed to work and are not working for pin money.<br />\nEducated women are not exempt from discriminatory<br />\npractices on the job market. \"It doesn't make sense for<br />\nyou to go to college and suddenly find that you have to<br />\nput all this on a shelf, because of the social conditions in<br />\nthis society.\" Several of Chisholm's rich, well-educated,<br />\nwomen friends get psychiatric assistance, pay $100 a<br />\nsession for someone to tell them what's needed, when the<br />\nproblem is so obvious, when women, nearly 40% of whom<br />\nare working, consistently find that there are gaps between<br />\nwhat they earn and what men earn. The House Education<br />\nand Labor Committee, of which Chisholm is a member,<br />\nreported that 25% of working women are either<br />\nelementary school teachers, bookkeepers, waitresses, or<br />\nsecretaries, all of which positions \"provide subsistence<br />\nwages and no upward mobility.\"<br />\nIn addition to her support for the Equal Rights<br />\nAmendment, Chisholm has been devoting much time to<br />\nDay Care Legislation. \"Women want to be productive<br />\ncitizens like anyone else, but won't be unless they feel<br />\ntheir children are being cared for.\" She proposes the<br />\nnationalization of day care centers. These centers would<br />\nbe more than babysitters and places to dump children. No<br />\nwoman who has children should work a forty hour week<br />\nunless she can have some assurance of child security.<br />\nMany women stay at home and receive public assistance<br />\nprecisely because there are not enough day care centers.<br />\nSome people criticize such women, saying: \"They don't<br />\nwant, to work; they want wel are,\" but Chisholm.asserts:<br />\n\"Every person basically want to feel a part of society as a<br />\nproductive citizen, five fifth of a man, not three fifths.\"<br />\nShe recognizes the need for omen to stay home and care<br />\nfor young children [\"Comir , with the child is a necessity<br />\nfor nurturing.\"], but this is not always economiCally<br /><br />\nmarch 18 1977/news-letter/page 3<br /><br />\nSpud( OUT TO ThE<br /><br />\nElection Results<br />\nHomewood (Special)--After a tense three-day flurry at<br />\ncampus polls, the Hopkins Tabulations Headquarters<br />\nannounced Wednesday night the winners in the annual<br />\nStudent Council elections. An unusually large turnout for<br />\nthe voting—almost one-half the student body—was<br />\nvariously attributed to the warm weather, the concern<br />\nover administration maneuverings, and the mistaking of<br />\nballot boxes for kleenex dispensers.<br />\nIn the Presidential race, a five-person struggle was pared<br />\nto a two-man runoff. Stu Davidson, a sophomore who has<br />\nbeen characterized as \"an intellectual Ralph Kramden,\"<br />\nmoved one step closer to \"the big time, Alice!\", as did<br />\nJunior David Chesanow. The latter, however, faces almost<br />\na two-hundred vote deficit to be made up in the finals<br />\n(trailing Davidson in the preliminaries, 382 to 193).<br />\nLeft in the canipaign lurch were Brad Stark, Gary<br />\nStahl, and Bunny Howard. The two remaining candidates<br />\nmay have to barter for their important blocs of votes to<br />\ngain the top spot, as primary losers can often spell trouble<br />\nfor the victors (cf. Ronald Reagan, How to Leave Your<br />\nOPponent Thirty Points Down on Some Godforsaken Ski<br />\nSlope).<br />\nThe Vice-Presidential contest came down to the wire,<br />\nas Randy Randazzo edged out the other half of the<br />\nChesanow ticket, Andy Albstein, 401-380. Promotional<br />\nagents for Fleetwood Mac, Dave Mason, and Jackie Wilson<br />\nare standing by. Pat Gatling became the new Student<br />\n•Council Secretary, swamping her opponent Bryan Stamm<br />\n524-172.<br />\nFor the final position in the yearly SC quartet, one<br />\ncontendor was eliminated and the other two slated for a<br />\nrun-off next week. The odd man o it was Dave Lewing<br />\n(by a ,mere eight votes), who was immediately claimed on<br />\nwaivers by the Toronto Blue Jays, Hopkins' parent team.<br />\nMeanwhile, primary leader Val Fein (320 votes) and<br />\nrwiner-up Neal Pilzer (244) gird themselves for another<br />\ngrueling campaign week, like their Presidential<br />\ncounterparts. Outgoing two-term Treasurer Ron Bialek<br />\nPlans to retire to La Crosse, Wisconsin, where he will<br />\nsupervise the activities of the Police Athletic League and<br />\nhandle the women's sports desk for the La Crosse Check.<br />\nWhile this week's election fervor died down, a related<br />\nPolitical incident heated up Wednesday afternoon. A<br />\nsizable crowd (estimated in the thirties) gathered in front<br />\nof Homewood House to protest the decision by the<br />\nCommittee on Undergraduate Studies to drop the present<br />\ncredited form of Intersession.<br />\nThe protestors, served Schaefer beer by the Protest<br />\nSocial Committee, found only two of their number<br />\nallowed to enter Homewood House to talk to the Deans.<br />\nThe pair—Andy Davis and Sheldon Himmelfarb—entered<br />\nthe administrative enclave as the demonstrators kept an<br />\nangry vigil outdoors. They returned a short time later,<br />\narmed with mimeographed statements drawn up by Dean<br />\nSuskind and approved by Dean Owen.<br />\nThe double-Dean, memo listed three points (in all<br />\ncapital letters): that the Dean's Office didn't particularly<br />\ncare what happened to Intersesion, that it was the CUS<br />\nboard--a faculty organization--that had made the decision,<br />\nand that students should address their grievances to and<br />\nhaggle with faculty members, not the Dean of the Faculty<br />\nof Arts and Sciences or the Dean of Undergraduate and<br />\nGraduate Studies, who should be left pleasantly alone in<br />\nthe renovating Homewood House.<br />\nWith the release of the statement, the crowd quickly<br />\ndispersed. Students walked away wondering where to<br />\ncarry the protest next, and probably mulling over to<br />\nWhom the burden would be passed that night. Such a<br />\ndecision will be made this coming week.<br />\noly p.<br /><br />\nBy S.C. HAQUES<br />\nIn an exclusive interview with the News-Letter, S.C. Presidential candidate David Chesanow announced<br />\nhis intention to seek a reduction in campus movie prices, and promised to get kegs of beer in the quad on<br />\nsunny days.<br />\nChesanow expressed his hope that many of the students who did not vote in the primary would vote the<br />\nsecond time around. He cited undergraduate disgust with\" big time\" politics, such as those exhibited by his<br />\nrun-off opponent, Stuart Davidson. The young artist felt the voters should know that he spent only fifteen<br />\ndollars on his campiagn.<br />\nDavidson was unavailable for comment, the word being that he was in Annapolis, lobbying against the<br />\nraising of the drinking age.<br />\nWhile Davidson has called the fight against the calendar change a success, Chesanow characterized it as\" a<br />\nfrantic and desperate attempt in self-defense,\"where the S.C. never received any written guarantee that it<br />\nwould not be done at another time. He questioned calling a short run accomplishment a\" triumph.\"<br />\nChesanow stated that the most important issue facing the University was the involvement with regimes<br />\nwhich have abrogated human rights.\" There is nothing more pressing than that,\" said the candidate.\" We're<br />\nobligated to become involved as human beings, if not as students.\"Chesanow admitted that student strikes<br />\nmight be one method for protesting in this case.<br />\nBoth candidates have expressed their concern in the past that the News- Letter did not contain enough<br />\ncampus news. Chesanow clarified his stand by explaining that the relationship between the N-L and the<br />\nCouncil\" has to remain a critical one for the benefit of the readers.\" He went on to say that the lack of SC<br />\nnews was probably due to the decline of the council itself, which Chesanow sees as a\"jOke.\"<br /><br />\nLOOK,WERE NOT GOING<br />\nTO STAND FOR YOUR<br />\nj<br />\nHUMAN RIGHTS VIOLATION<br />\n............-<br /><br />\nMARGULIES<br />\nROT110)<br /><br />\nAND<br />\nTHAT<br />\nGoES FoR<br />\nYoU<br />\nTOO!<br />\ne_d<br /><br />\nFBI stalls on Letelier probe<br />\nBy RUSS SMITH<br />\nWashington, D.0<br />\n\"We're getting to the end of our rope. We've<br />\ncooperated with the FBI, we've kept from publicly<br />\ncriticizing the FBI, but we're not further along in the<br />\ninvestigation now than we were six months ago.\"-Michael<br />\nMoffitt<br />\nMichael Moffitt is an angry young man and there's a<br />\ngood reason why. It's been over six months now since<br />\nMoffitt's wife Ronni and former Chilean ambassador<br />\nOrlando Letelier were assassinated on Washington's<br />\nEmbassy Row. Over six months and still the FBI has<br />\nfailed to capture their killers.<br />\nAnd it's not as if the FBI is short on leads. In fact,<br />\nMoffitt and his co-workers at the Institute for Policy<br />\nStudies [IPS] have provided investigators with the names<br />\nand addresses of the men they say planted the bomb in<br />\nLetelier's car last September.<br />\n\"We have evidence that the assassination was ordered<br />\nby DINA [Chile's secret police] and carried out by six<br />\nCuban ex`iles, all veteran terrorists, who are now living in<br />\nFlorida,\" claims Moffitt. The FBI has been given this<br />\ninformation but refuses to act on it, looking instead for<br />\nnon-political motives for the killings. The most frustrating<br />\npart, says Moffitt, is that the FBI knows that IPS is right<br />\nbut still won't do anything.<br />\nA possible key link in the case is Orlando Bosch, a<br />\nterrorist with DINA affiliations, who is now in jail in<br />\nVenezuela. Moffitt believes that Bosch could let go with<br />\nsome valuable talk if only the FBI would make the effort.<br />\n\"We've been told time and time again that they're<br />\nready to move on the case, and now they say they're<br />\nstymied. Does someone else have to get their head blown<br />\noff to show the FBI that DINA isn't kidding around?\"<br />\nMoffitt commented. Failing immediate action from the<br />\nFBI, IPS may call for a special congressional investigation<br />\ninto the murders, although considering Congress' track<br />\nrecord on that score, not many are optimistic about the<br />\nresults of such an investigation.<br />\n\"This assassination is a direct outgrowth of U.S. foreign<br /><br />\npolicy since World War II. The CIA has been trying to<br />\ndestroy progressive movements in Third World countries<br />\ncommitted to social change for years now,\" Moffitt said.<br />\nThe people of Chile join those of Iran, Brazil, Vietnam<br />\nand a host of other countries who have been savagely<br />\nvictimized by American imperialism since World War II.<br />\nIt's no secret that a public airing of this murder probe<br />\nwould do little to bolster the flagging image of the CIA<br />\nmainly because of its close ties with DINA and other<br />\nforeign secret police netwprds. Exactly what the Cia role<br />\nin the Letelier assassination is remains unclear, but<br />\naccording to Moffitt, \"It's inconceivable that foreign<br />\npolice are carrying out illegal activities in the United<br />\nStates without the CIA knowing about them.\" It's also no<br />\nsecret that the Cuban gunmen were CIA-trained. So, it's<br />\nnot hard to figure out why the FBI is dragging its feet on<br />\nthe investigation.<br />\nAnd there's no indication that this terrorism will stop.<br />\n\"A person I know is said to be on DINA's hit list, he's<br />\nbeen harrassed and followed, but we still can't get police<br />\nprotection for him or any other Chilean,\" stated Moffitt.<br />\nRelations between the United States and Chile are<br />\nbound to be less friendly during Jimmy Carter's<br />\nadministration, but whether the Chilean Junta is given a<br />\nwrist-slapping or is dealt with morel severely remains to be<br />\nseen. Moffitt's unsure about Carter's position , saying<br />\n\"It's another case of him promising something during the<br />\ncampaign and not knowing whether he'll act on it.\"<br />\nMoffitt added that the Chilean government was<br />\ndisappointed when Carter nosed out Ford last November<br />\nbecause they think he's \"too dangerous\" and \"too far to<br />\nthe left.\"<br />\nMeanwhile, DINA agents are busier than ever, stalking<br />\naround Washington,. checking out campuses, tracking<br />\ndown and harrassing: Chileans disloyal to the Junta. Since<br />\nAllende's overthrow'in 1973, there's been an attacklon a<br />\nprominent Allende minister,every September. \"They'll<br />\nprobably get somame next fall,\"says Abffitt. \"if not bePre.\"<br />\n-C1<br /><br />\npage 4/news-letter/march 18, 1977'<br /><br />\nThe First Breeze ofSummer'is not a<br />\ngreat play. It is, however, a good play and<br />\nis given a fine production by Center<br />\nStage. Perhaps these adjectives seem<br />\nnebulous and indicate a certain<br />\nambivalence on the part of the reviewer.<br />\nMy job is particularly difficult because, as<br />\na theatre lover, I feel compelled to tell all<br />\nthe would-be theatre patrons to rush out<br />\nand support Center Stage. God knows,<br />\nanything resembling sophistication is<br />\nbadly needed in Baltimore, and I find it<br />\ntruly amazing that Center Stage, although<br />\nstill desperate for financial support, has<br />\ndone as well as it has. Also, I must admit<br />\nthat there are many things about First<br />\nBreeze that should be praised.<br />\nIt is atrocious for a city like Baltimore,<br />\nwhich has such a large black population,<br />\nto have no visible signs of black theatre.<br />\nThe selection of First Breeze,<br />\nwonderfully representative of black<br />\ntheatre, is to be praised as an attempt to<br />\nright this wrong.<br />\nAside from the few celebrities who can<br />\nbe seen at the Mechanic, Baltimore is<br />\nlittle acquainted with big names, so<br />\nCenter Stage has pulled off quite a coup<br />\nby getting the great Claudia McNeil, best<br />\nremembered as the original, Momma in A<br />\nRaisin in the Sun, for the centralcharacter in the present production. This<br />\nis doubly gratifying because many local<br />\nactors are given a chance to work with<br />\nsuch a talented performer.<br />\nIt is refreshing, too, to see a<br />\nlittle-known, yet promising playwright,<br />\nlike Leslie Lee, given a showcase for his<br />\ntalent. It is also good to see that someone<br />\nother than Stan Wojewodski, in this case<br />\nWoodie King, Jr., is directing at Center<br />\nStage.<br />\nBut there are, as well, the less than<br />\npraiseworthy points.<br />\nMiss McNeil, because of the structure<br />\nof the play, is not given enough to do,<br />\nand when the play loses its way, as it<br />\noften does, she is powerless to set it<br />\nstraight:<br />\nAs I previously said, it is gratifying to<br />\nsee a new playwright at work, but since<br />\nMr. Lee is a new playwright, he has not<br />\nfully mastered his craft and the audience<br />\nmust be forewarned of some dry patches<br />\non the way.<br />\nHis play deals with Gremmar (Miss<br />\nMcNeil) in the present with her family<br />\nand, through flashbacks, the young<br />\nGremmar -- then called Lucretia<br />\n(Elizabeth Van Dyke) -- and the past<br />\nevents that shaped her into what she is.<br />\nWe see Lucretia with her first lover, Sam<br /><br />\nDavis Hall and Elizabeth van Dyke appear in a scene from \"The First Breeze ofSummer\"<br />\nby Leslie Lee; now through April 10.<br />\nGreen (Tommy Hicks), who stood up for<br />\nup through the use of these flashbacks.<br />\nMost of the other actors are top notch.<br />\na friend out of disgust over the treatment<br />\nBut this is just where the drama fails.<br />\nPeter Wise and'Ronny Claton are fine as<br />\nof the black man only to be struck down;<br />\nPerhaps a lot of blame must go to the<br />\nLou and his .brother Nate, and Barney<br />\nLucretia's affair with a stereotypical,<br />\ndirector, but certainly much must be<br />\nCohen, a local. actor sometimes involved<br />\nwhite, poor little rich boy (Davis Hall):<br />\nshared by Mr. Lee.<br />\nwith Theatre Hopkins, is excellent in:a<br />\nher turning to prostitution at the end of<br />\nAll of the flashbacks take place in what<br />\nsmall part as he exemplifies that one of<br />\nthe affair; and her ruination of Harper<br />\nis Gremmar's present bedroom; we see<br />\nthe keys to good acting is detail. Special<br />\nEdwards (William Jay) who had had<br />\nGremmar reminiscing as the scenes of her.<br />\nmention must also be made of Dorthi<br />\naspirations of becoming a minister. The<br />\nyouth are played out by Lucretia and<br />\nFox, a professional comedienne, who<br />\ndrama ensues when Gremmar's grandson,<br />\neach one of the lovers. The problem is<br />\nadds just the right humor to Aunt Edna.<br />\nLou Edwards (Peter Wise) is provoked<br />\nthat watching Miss McNeil reflect on<br />\nthe daughter whose father was white.<br />\ninto attacking his grandmother after he<br />\nGremmar's youth, fondle the costume<br />\nTechnically, the show was<br />\nlearns that his Aunt Edna (Dorthi Fox)<br />\npearls that her first lover, Sam Green,<br />\nunimpressive. Although the costumes<br />\nwas the product of the affair with the<br />\ngave her and which she still wears, is<br />\nwere fine, the set was perhaps<br />\nwhite rich boy.<br />\ninfinitely more interesting than what is<br />\nunnecessarily overdone, and one pice. a<br />\nhappening in the bedroom. The flashback<br />\nlarge tree protruding from upstage left,<br />\nscenes are overlong, generally less<br />\nwas particularly hideous.<br />\nwell-written than the family scenes, and<br />\nWhen considered in its entirety, the<br />\ndirected with a weaker hand.<br />\ngood points of the show probably<br />\nNot wanting to trivialize what Mr. Lee<br />\nThe power of the play comes in its<br />\noutweigh the bad. its best good point<br />\nis attempting to tell us, but trying only to<br />\nexamination of familial relationships, but<br />\nbeing Miss McNeil. If you do decide to<br />\nclarify his point, I interpret the play as<br />\nnot what underlies those relationships<br />\ntrek<br />\ndown to Center Stage (and I'm not<br />\ntelling us that before we can move on we<br />\nand brings them into being. Perhaps the<br />\nsuggestin<br />\ng you don't), you will be<br />\nmust accept what we are. He is more<br />\nmost affecting scene is that in which Miss<br />\npleasantly<br />\nsurprised<br />\nto learn that not only<br />\nspecific about this as regards the black<br />\nMcNeil plays scrabble With Lou, her<br />\nMiss<br />\nis<br />\nMcNeil<br />\na<br />\ngifte-d<br />\nactress, she is an<br />\nman, but tries, nevertheless, to generalize<br />\ngrandson: she 'cheats. She shows that a<br />\nequally<br />\ngifted<br />\nsinger.<br />\nto all men. The drama of this, the<br />\ngreat actress can make something so<br />\nunderlying force, is supposed to be built<br />\nKeno Rider<br />\nsimple into something so wonderful.<br /><br />\nAT CENTER STACIE<br /><br />\nweekly arts calendar<br />\nTheater<br />\nMechanic Theater, Hopkins Plaza, 727-4103. \"Grease.\" Through March<br />\n1 27.<br />\n('enter Stage, 700 N. Calvert St. Leslie Lee's \"The First Breeze of Summer,\" with Claudia McNeil. Call<br />\n332-0033 for<br />\nfurther information. Through April 10.<br />\nEisenhower Theater, Kennedy Center, Washington. Mike Nichols' production of a musical based on the comic<br />\nstrip \"Little<br />\nOrphan Annie.\" Call(202) 254-3600 for ticket information. Through March 31.<br />\nMusical Theater Lab, Kennedy, Washington, \"Hot Grog,\" a pirate musical. Through March 27.<br />\nNational Theater, 1321 E. Street NW, Washington. Liv Ullmann in Eugene O'Neill's \"Anna Christie,\" directed<br />\nby Jose<br />\nQuintero. Through April 9. Call(202) 872-0466.<br />\nFord's Theater, 511 Tenth St. NEW, Washington, \"The All Night Strut:\" a look at the music and dance<br />\nof the 1930's and<br />\n1940's. Through March 27. Call (202) 638-2368 for further information.<br />\nEssec Community College, 'Enemy of the People.' Arthur Miller's adaptation of lbsen's play, tonight and tomorrow<br />\nnight<br />\nat 8 pm,and at 7 pm on Sunday.<br />\nMorgan State University, A production of George Orwell's \"Animal Farm.\" Tcmight and tomorrow night<br />\nat 8 pm, and<br />\nSunday at 3:30 pm<br /><br />\nTHE JOHNS HOPKINS FEDERAL CREDIT UNION<br />\ncordially invites its members<br />\nand their guests to attend the<br />\nFIFTH ANNUAL MEETING<br /><br />\nThursday, March 24, 1977<br />\n5:30-7:30 pm.<br />\nGlass Pavilion, Homewood Campus<br />\nFeaturing:<br />\n*A Baked Chicken Dinner<br />\n*Five door prizes 'available only to Credit Union<br />\nmembers in attendance)<br />\n*Business Reports<br />\n*Nominations and elections of members to<br />\nvacant Positions<br /><br />\nConcerts<br />\nLyric Theater, 120 W. Mt. Royal Ave., 837-5691. Leon Fleisher will conduct the pops concert on March 19 at 8:15 pm.<br />\nThe program includes Rimsky-Korsakoff's \"Capriccio Espagnolp.\"<br />\nPeabody Institute, Mount Vernon Place. A member of the faculty, Robert Hall Lewis, will have his \"Combinani<br />\noni 3\" for<br />\noboe, percussion and narrator, previewed at 7:30 pm on March 20. The free program will be in Leakin Hall, and<br />\nincludes<br />\nworks by Donizetti. Hindemith and Krenek. The free noon concert on March 23, in the Peabody Concert Hall, will<br />\nbe a<br />\nprogram of French vocal literature.<br />\nCenter Stage, Orchestra Piccola, March 21 at 8:15 pm; Mozart's Adagio and Rondo for Violin and Orchestra, Schubert's<br />\nSymphony No. 5. Counod's Petite Symphonic for Winds and Hayden's Symphony No. 46.<br />\nGoucher College. Kraushaar auditorium. The Goucher-Hopkins Community Syrnphoney will performs works by<br />\nMendelssohn, Mozart. Beethoven and Mayuzumi at 8 pm on March 20. Free.<br />\nCenter Forum, Old St. Paul's Church, Charles 3nd Saratoga Sts. On March 22 at 12:30 pm there will be the Medieval Arts<br />\nEnsemble and the Mass Pangue Lingua of Josquin. At noon on the same day pianist William Brown will perform popular<br />\ntunes in the Coffeehouse.<br />\nLovely Lane Methodist ('hurch, 2200 St. Paul St. Tonight at 8:30 pm. Michael Cooney will perform traditional American<br />\nand British folk songs.<br /><br />\nFee: $5.00<br />\nFor further information about the meeting and the bus service<br />\navailable from JHMI, call either Credit Union office:<br />\nHomewood: 338-8320<br />\nJHMI: 955-6116<br /><br />\nSee you on the 24th!<br /><br />\n/<br /><br />\nmarch 18, 1977/news-letter/page 5<br /><br />\nhip it dluovintown<br />\nare superseded by careful arrangements of coca cola<br />\nglasses.<br />\nA Campbell's soup can, electric chair, Jackie Kennedy<br />\nand Liz Taylor, identify the work of the most popular<br />\nartist in the exhibition, Andy Warhol. Through a series of<br />\nsimilar objects, in this instance repeated images of an<br />\nelectric chair, Warhol demonstrates how the repetition of<br />\nan object. takes away its meaning: \"When you see a<br />\ngruesome picture over and over again, it doesn't really<br />\nhave any effect\"(Warhol,Art News, November 1963.)<br />\nWarhol seems to typify the Pop art movement, but<br />\nsomeone like Rauschenburg, who does not make<br />\nextensive use of advertisements in his compositions, is a<br />\nbit more enigmatic. That is part of the fun, trying to<br />\ndiscover what the art works have in common and in what<br />\nways they serve as commentaries on contemporary<br />\nculture.<br /><br />\nAn exhibition called \"American Pop Art and the<br />\nCulture of the Sixties\" will continue at the Downtown<br />\nGallery of the Baltimore Museum of Art (Charles and<br />\nRedwood Sts.) through March 25. The artists represented<br />\nare Tom Wesselmann, Robert Indiana, George Segal,<br />\nJames Rosenquist, Jim Dine, Jasper Johns, Roy<br />\nLichtenstein, Robert Rauschenberg, Andy Warhol, and<br />\nClaes Oldenburg.<br />\nThe graphics and posters, in one way or another, reflect<br />\nthe ways in which the mass media and commercial<br />\nPrinting have affected contemporary art. If there is a<br />\ncommon ground for the 38 pieces of Pop art, it is that the<br />\nartists are using images from popular culture. The very<br />\nbanality and vulgarity of advertisements and celebrities<br />\nbecomes the subject matter. Still life paintings of pears<br /><br />\nIt'll Ilicw vt/cur imlrl<br /><br />\nMike Giuliano<br /><br />\nDobra to conduct<br />\nGuest conductor Ronald Dobra, founder of the<br />\nTheater Project Orchestra, and Mark Goldstein,<br />\npercussionist and director of the Baltimore Percussion<br />\nQuintet, formerly associated with Young Audiences, Inc.,<br />\nwill be featured artists in a concert with the Goucher<br />\nHopkins Community Symphony Orchestra. The free<br />\nconcert will be at 8 pm March 20 at Kraushaar<br />\nAuditorium.<br />\nMr. Dobra is a Peabody graduate student in conducting<br />\nwith Leo Mueller and Theodore Morrison and in<br />\nsightsinging with Asher Zlotnik. A Boston University<br />\nclarinet major, he earned degrees in music and media<br />\nfrom Catholic University and Antioch College, and served<br />\nwith the USAF Band in Washington, D.C.<br /><br />\n••<br /><br />\nRoy Lichtenstein Zipper, 1962<br /><br />\nThe teenage.queens ofpunk-rock, The Runaways, Will be<br />\nplaying tonight and tomorrow night at the Hollywood<br />\nPalace, 6512 Baltimore National Turnpike [Route 401, exit 15<br />\n[Vest offthe Beltway. live girls from LA, the oldest 18 yam.ofa,the<br />\nRunaways's stage act is, to say the least, suggestive. We urge<br />\nyou to come on down and cheer them on. The curtain goes<br />\nup at 9:30. Tickets are $4.00 at the door. For further<br />\ninformation call 788-7720.<br />\n••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br /><br />\n0\\nce,<br />\n1&gt;nce<br />\nrsce<br />\nFt:idav\\<br />\nMarci,j1<br />\nreaf I-1 a I /<br />\naokns I-10ek;ns<br />\n(6-0 86e)<br />\nAotrA;ssioh<br />\nrre sh Al -- Free<br />\n13e.e.r — D54<br /><br />\n9PI<br /><br />\nw!<br />\nJe<br />\nWho AreYou<br />\nToday there is a way to answer all of your questions.<br />\nresolve your doubts... and, at the same time, discover the truth<br />\nand beauty of your Jewish heritage. For men the first step begins<br />\nat Hadar Hatorah; for women at Machon Chana.<br />\nEach of these unique institutes of learning offers meaningful,<br />\nin-depth courses in Jewish history, ethics, traditions, philosophy,<br />\nHebrew and Yiddish. A complete curriculum in basic and advance<br />\nJudaism. With no previous religious background requirements, no<br />\nfees for those unable to pay. Plus a choice of day or evening<br />\nsessions, Sunday or Weekend seminars, and a Summer Program.<br />\nDormitory facilities also available.<br />\nRabbi Jacob J Hecht, Dean<br /><br />\nREGISTRATIONS ARE NOW BEING ACCEPTED<br />\nFOR ALL SESSIONS<br />\nCONIAIT/EE pr4.<br />\nFor further information, call or wnte<br /><br />\nHADAR HATORAH<br />\nLubavitch School for College Youth<br />\n[OE JEWISH<br /><br />\ng24 EASTERN PARKWAY. BKLYN, N.Y. 11213<br />\n(212) 735-0200<br /><br />\nMACHON CHANA<br /><br />\nMomen's Institute for the Study of Judaism<br />\n733 EASTERN PARKWAY. BKLYN. N.Y. 11213<br />\n(212) 735-0200<br /><br />\npage 6/news-letter/march 18, 1977<br /><br />\nmarika christian<br /><br />\no the editor:<br />\nRe: Colin Cammerer's sloppy,<br />\nsimple-minded Springsteen piece<br />\n(N-L, March 15).<br />\n\"It's My Life\" was a hit single<br />\nfQr the Animals exactly eleven<br />\nyears ago, long before there was<br />\neither a group or a song entitled<br />\n\"Bad Company,\" and apparently<br />\nlong before Cammerer was even<br />\ntoilet-trained. The only new tune<br />\ntat Springsteen performed<br />\nSunday night was \"Don't Look<br />\nac<br /><br />\nRecord reviews from the man<br />\nMiles Davis Water Babies Columbia Pc 34396<br />\nFor the past three or four years, Miles Davis<br />\nhas all but<br />\ncompletely lost his following from the<br />\nfifties onward.<br />\nThose who fondly remembered such<br />\nclassics as Round<br />\nMidnight or Sketches of Spain couldn't<br />\nfigure out what<br />\nMiles was trying to do with \"all that rock<br />\nand roll.\"<br />\nOn the other hand, there is a generation<br />\nof Miles Davis<br />\nfans who have never heard anything before<br />\nIn a Silent<br />\nWay, and would be amazed to find out that<br />\nJohn Coltrane<br />\n(isn't he dead of something?) was a part of<br />\nMiles's•band for<br />\na few years. Columbia Records, Miles's'<br />\nlabel, has not<br />\nobjected to this arrangement,<br />\nbecause this<br />\nignorant young audience has many dollars<br />\n, and money is<br />\nthe name of the game.<br /><br />\nBut it has backfired on them, because Miles<br />\nrefuses to<br />\ngo as out and out commercial as, say,<br />\nformer student<br />\nFreddie Hubbard (also on Columbia) or<br />\nformer sideman<br />\nHerbie Hancock (again on Columbia). Miles's<br />\nlast two<br />\nalbums have been commercial flops, basically,<br />\nbecause the<br />\nonly people interested are die-hards who still<br />\nbelieve, and<br />\nmusic critics to whom Miles's; recorded output is<br />\na living.<br />\nThis release is all older material, released in an<br />\nattempt<br />\nto woo back older listeners. Side one, record<br />\ned around<br />\nthe time of such classics as ESP, Miles<br />\nSmiles and<br />\nNefertitti, is out and out fantastic. Wayne Shorte<br />\nr, Herbie<br />\nn Carter and Tony Williams were perhaps<br />\nMiles's' best<br />\nstudio band (the George Coleman band was a<br />\ndynamite<br />\nlive band),and these cuts are priceless. Side two,<br />\nrecorded<br />\nbetween Filles de Killamanjaro and In a Silent<br />\nWay is<br />\nutterly worthless, except that they ' allow the jacket<br />\nto<br />\nlist Chick Corea as one of the sidemen.<br />\nStill, the first side is well worth your money, assumi<br />\nng<br /><br />\nyou already have the above mentioned<br />\nalbums.<br />\nPersonally, I would have preferred new materi<br />\nal and a<br />\nfull-blown anthology of outtakes, but with Teo<br />\nMacero<br />\n(Niles's former producer) gone, Miles may find<br />\nit difficult<br />\nto do anything new at Columbia.<br /><br />\nARTS<br /><br />\nI imagine every high-school trumpet player with<br />\ndelusions of good range will want this album, and they<br />\ncan have it. There are dozens of good screech players<br />\naround, and many better bands. This is a waste of time<br />\nand money.<br /><br />\nWeather Report Heavy Weather Columbia PC 34418<br /><br />\nHeavy Weather is Weather Report's seventh album:<br />\nmaybe I'm simply addicted, but I have yet to come across<br />\nsomething they've done which I disliked. Seven for seven<br />\nThis is without question the best jazz album of<br />\nthe last<br />\nis an incredible score by anyone's standards.<br />\nsix months. An all star band is one thing, but<br />\nwhen they<br />\nJoe Zawinul and Wayne Shorter have been the nucleus<br />\nall play like stars, that's a session! Mel Lewis<br />\nis joined by<br />\nof the group since its inception back in 1970. Since then.<br />\nbassist extraorclinaire Ron Carter, pianist Hank<br />\nJones, they have gone through three bassists (Miroslav Vitous.<br />\ntrumpeter Freddie Hubbard, tenor man Michae<br />\nl Brecker, Alphonso Johnson, and Andrew White) and a small armY<br />\nand Greg Herbert alto, and Cecil Bridgewater,<br />\ntrumpet, of percussionists before they came to their present<br />\nfor two cuts.<br />\npersonnel. What is important about this current group is<br />\nThe real surprise of the album is Freddie<br />\nHubbard. that the bassist, Jaco Pastorius, has become as much -3<br />\nMany of us thought that Hubbard, cooke<br />\nd-out and<br />\ndriving force with the group as its two leaders.<br />\nuncaring, had long ago sold his soul to rock and<br />\nroll. His<br />\nPastorius is a blessing to the group. infinitely superior<br />\nlast few albums and concert appearances have<br />\nproved<br />\nto his predecessors. He is a great rhythm player, as have<br />\nembarrassing, and most of us went in desparation<br />\nto our<br />\nbeen all of their bassists, but most of all, he is a soloist, a<br />\nold albums. But this! Play A Child is Born;<br />\nHubbard<br />\nmelodicist of the highest calibre—the perfect counter<br />\nhasn't sounded this good since the classic Blue Moon<br />\nwith<br />\nvoice to Shorter and Zawinui.<br />\nBlakey's Jazz Messengers., Throughout the<br />\nalbum,<br />\nOn the other hands, the drummers are taking a more<br />\nHubbard literally swings his ass off, providing<br />\na strong,<br />\nand more subordinate role. Some of their work, as in<br />\nlyrical solo on evefy track he plays.<br />\nHavona, is first rate, but much of the time they are<br />\nMichael Brecker is the album's other surprise.<br />\nBrecker,<br />\nmerely metronomic. In fact, on Teen Town, Pastorius<br />\nif one is to go by his numerous funk recordings,<br />\nseems too<br />\ntakes<br />\nover the drumming, and the change is virtually,<br />\noften to be a minor talent whose chief ability<br />\nis being able unnoticeable.<br />\nto blithely rip off every major R&amp;B tenor<br />\nplayer since<br />\nThe album is a masterpiece, transcendent of labels. Just<br />\nIllinois Jacquet. Actually, Brecker is just<br />\nanother jazz pick it up, put on Birdland, and you have<br />\nexcuse enough<br />\nmusician who likes to eat. His solos on this<br />\nalbum are to buy the record. And that's only the first cut...<br />\nhard-edged and logical without sounding<br />\nthe least bit<br />\nstudied, and he swings like he invented the term.<br />\nThe rhythym section is, of course, as<br />\ndependable as<br />\nMarvin Mandel's assertions of innocence.<br />\nNo comment is<br />\nnecessary; for them brilliance is de riguer.<br />\nMel Lewis Mel Lewis and Friends A&amp;M Horizo<br />\nn SP717<br /><br />\nMaynard Ferguson Conquistador PC 34457<br />\nWhat is ultimately most irritating about this album<br />\nis<br />\nnot so-much that it is garbage, but that it is garbage that<br />\nwe have all heard before. Bob James, who produces the<br />\nalbum, might just have easily overdubbed Maynard onto<br />\nsome outtakes from an unused Bob James session.<br />\nWe are expected to be impressed by the presence of<br />\nMaynard's band on this one (his last attempt, Primal<br />\nScream, placed the blame upon studio musicians). So<br />\nwhat? The only impressive passage the band gets, outside<br />\nof two-bar funk cliches and endless rhythm vamps, is on<br />\nThe Fly, and the trumpet section there is led by Jon<br />\nFaddis, a twenty-three year old whiz kid who could blow<br />\nMaynard off the band stand eight days a week.<br /><br />\nmarch 18, 1977/news-letter/page 7<br /><br />\n411<br /><br />\nEnjoy the Lacrosse<br />\ngame with $.25 beer<br />\nin the Rat from<br />\n1 hour before to 2<br /><br />\n.41111111110.<br /><br />\n-NOM.ato.<br /><br />\nSenior Class Film Series<br />\npresents<br /><br />\n\"ONE OF THE YEAR'S10 BEST:'<br />\n\"A BRILLIANT FEAT OF MOVIE-MAKING:',<br />\n\"ONE OF'THE YEAR'S 10 BEST'?<br />\n\"It flawlessly expresses<br />\nthe belief that'manhood<br />\nrequires rites of<br />\nviolence<br />\n' —TIME MAGAZINE<br /><br />\n—NEWSWEEIC<br /><br />\nhours after the<br /><br />\ngame.<br /><br />\nFREE BEER FOR<br />\nENIORS AFTER<br />\nTHE GAME.<br />\nALFRED HITCHCOCK'S<br /><br />\nEINIIIIILY MAW<br /><br />\nABCPICTURES CORP IXtsents<br /><br />\nHOFIF<br />\nST<br />\n'SAMPECKINH<br /><br />\n1<br />\nFRi• &amp; SAT.<br />\nMARCII 18 &amp; 19<br />\nN GS1<br />\nARR<br /><br />\nShaffer 3<br /><br />\n7:30 &amp; 10:00<br />\nAdMISSION $1.00<br />\nSENIORS<br /><br />\n$.75<br /><br />\nThe Johns Hopkins University<br />\nOffice of Special Events<br />\nPresents<br /><br />\nCombined sounds of harpsichord, banjo and twelve-string guitar.<br />\nClassics, folk music, traditional hoedowns and ragtime - a unique sound!<br />\nSUNDAY MARCH 20 at 7:30 P.M.<br />\nShriver Hall Auditorium, The Johns Hopkins University<br />\nHomewood Campus<br />\nREGULAR ADMISSION: $3.75<br /><br />\nThere's no body in the family plot.<br /><br />\nKAREN BLACK • BRUCE DERN<br />\nBARBARA HARRIS • WILLIAM DEVANE<br /><br />\n3/18 - 3/19<br />\n7:30 az, 10:00<br /><br />\n$1.00<br />\nShriver Hall<br /><br />\nFULL-TIME STUDENTS W/ID: $2.75<br /><br />\n1<br /><br />\nTwenty Questiong<br /><br />\nNEWS—LETTER<br />\nvol. lxxxi, no. 41<br />\neditor-in-chief<br />\nEric Garland<br /><br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editors<br />\nJ.D. Considine<br />\nMike Giuliano<br />\nphoto-production mgr.<br />\nJennifer Bishop<br />\nsports editor<br />\nDavid Kraus<br />\ngraphics editor<br />\nScott Marks<br />\nhigher consciousness<br />\n- D.H. Warren<br />\ncirculation editor<br />\nHowie<br />\nproduction<br />\nDale Horan<br />\nJim McDonald<br />\nJoe Rodrigue<br />\nForeign Affairs Desk<br />\nMark Hertsgaard<br />\nbar editor<br />\na. press<br />\nKenneth Sokolow (l899-1976)-f<br /><br />\ngood start<br />\nIt is good to see that the New Political Caucus is off to a fine start<br />\non campus. Its `;Enemies of the People\" film series of last week was a<br />\nbig success, both in terms of attendance and solid political education.<br />\nThe Caucus' left of center stance and its expected future<br />\nconsideration of questions that are usually neglected in conventional<br />\ndiscourse (e.g., jEIU involvement with foreign- governments, the<br />\nefficacy of the American two party capitalist system) are refreshing<br />\nand long overdue. We wish them the best of luck.<br /><br />\nletters to the editor<br />\nTo the Editor:<br />\nI realize that it is the fashion<br />\nof the day to be a skeptic, to cast<br />\na cynical eye on familiar<br />\ninstitutions. I realize, too, that<br />\nmany people are of the attitude<br />\nthat the world is a sad place if<br />\nothers cannot bear a few laughing<br />\nslights against them, e.g. the<br />\nPolish, Italian, etc.,joke.<br />\nHowever, I am confused as to<br />\nthe purpose of Mr. Colin Camerer<br />\nin his \"article\" of 3-8-77. Is he<br />\nwriting news, social commentary,<br />\nor satire? I do not find it<br />\nnewsworthy, legitimate, or<br />\nlaughable. I find it appalling and<br />\npitiful in its backward prejudice<br />\nand false sense of superiority. Mr.<br />\nCamerer, in his piece on the<br />\nEvening College, has found it<br />\nnecessary to include derogatory<br />\ndescriptions of Jews, nurses, and<br />\nhousewives, and to downgrade<br />\nand patronize a segment of the'<br />\nuniversity that truly deserves<br />\nplaudits, not put-downs.<br />\nA great many people have<br />\nconsiderable respect for those<br />\nworking adults who have the<br />\ncourage and motivation to return<br />\nto school at the expense of their<br />\nfree time. These students are<br />\nsincere, intelligent, and eager to<br />\nbe accepted, yet they are often<br />\nhampered by the attitudes of<br />\ncertain undergraduates such as<br />\nMr. Camerer, who seems to view<br />\nthem as ridiculous. Mr. Camerer<br />\nhas examined his subjects<br />\nthrough stereotypic. rather than<br /><br />\nrose-colored, glasses.<br />\nStereotyping is passe, Mr.<br />\nCamerer. It is not entertaining.<br />\nI question Mr. Camerer's taste<br />\nin wishing to have such an article<br />\npublished, and 1 question the<br />\ntaste of the News-Letter in<br />\nchoosing to publish it. I was<br />\nasked why I bother to respond to<br />\nsuch garbage. It is because I<br />\nexpect garbage to be tossed out.<br />\nArna Cohen<br />\nTo the editor:<br />\nDon't you . wonder sometimes<br />\nabout sound and visiOn?<br />\ndo<br /><br />\nBy JOHN PERROTTA<br />\nLife at Johns Hopkins in the nineteenth century was<br />\ndefinitely a different scene. With no Rathskellar, 110<br />\nHomewood campus, no University housing, and only a<br />\nhandful of Goucher girls, the typical Hopkins student was<br />\nin for the trip of his life.<br />\nThe new University, thrusting all its resources in the<br />\ndirection of academics and research, had neither the<br />\nmoney nor the need for a dormitory. Fortunately for<br />\nthem, many Baltimoreans wee still suffering the effects<br />\nof the Civil War and the Depression of 1873. TheY<br />\nwelcomed both Peabody and Hopkins students into their<br />\nhomes as boarders.<br />\nSo many students settled near McCulloh and Biddle<br />\nStreets that this area was christened the Latin Quarter. It<br />\nwas quiet with old brick houses later praised by Hopkins<br />\nalumnus Woodrow Wilson in a letter to his sweetheart.<br />\nIf Johns Hopkins is world-famous today,it certainly<br />\nwasn't known by all Baltimoreans in the 1880's. Indeed.<br />\nnot until the Hospital began treating patients did<br />\n\"Hopkins\" become a household word. A Johns Hopkins<br />\nstudent, placing an ad in the Baltimore Sun for a room<br />\n\"near the University\", was offered a room near the<br />\nUniversity of Maryland medical school.<br />\nLiving was pretty cheap. Rooms were usually $5 a<br />\nmonth. Meals went for $4 a week, or that much a<br />\nfortnight if you cooked them yourself. Milk was 3 cents a<br />\nglass, apples, two for a nickel. Twelve bananas could be<br />\nhad for 8 cents at the Lexington Market. And kerosene to<br />\nfuel your study lamp was a quarter a month.<br />\nHerbert Baxter Adams (of Adams House fame) claimed<br />\nthat cutting corners in Germany, it still cost him $1000 a<br />\nyear. However, a student in Baltimore could live \"on the<br />\nfat of the land\" for $500 a year, and that he himself paid<br /><br />\nAl<br />\niger<br /><br />\npioul<br />\nfold<br /><br />\nlii<br />\nIf<br />\nbeen<br /><br />\nthe<br /><br />\nr<br />\nSt<br />\nfust<br /><br />\n1-1(<br /><br />\nfOrti<br /><br />\nfic<br /><br />\ny<br /><br />\nth p<br /><br />\nr<br />\neid<br /><br />\nhelp<br /><br />\n4.41<br /><br />\nheir<br /><br />\nPr<br /><br />\nEgg Roll Norton<br />\nDear Mr. Camerer:<br />\nRe: your tongue in cheek article<br />\nconcerning evening students.<br />\nThere is one important factor<br />\nyou didn't mention that may<br />\nhelp explain the mysterious<br />\ndifferences you noted between<br />\nday<br />\nand evening students. The<br />\nevening students, generally, are<br />\nsigning their own checks for<br />\ntuition—Daddy 'doesn't send a<br />\ncheck each month. And in order<br />\nto sign their own checks they are<br />\nworking full-time, putting the<br />\nmoney in the bank, and no doubt<br />\ngiving up other luxuries they<br />\nmight be enjoying. Could this<br />\nprecipitate the intensity and<br />\nenthusiasm? Interesting!<br />\nShirley Goodman<br />\nDepartment of Behavioral Sciences<br />\nSchool of Hygiene &amp; Public Health.<br /><br />\nREMSEN IINVENI4<br />\ndi<br />\n:k:,:1;<br />\nIn a direct affront to the°J'<br />\nCarter's new administration }' I<br /><br />\nts/<br /><br />\nOW om(AM CNi FRom CARAAANLIS ON Rom SADAT, ONE<br />\nOtsJ 1-ROM TORRIJOS 1WELVE cr\n<br />\n,<br /><br />\nNOTIN<br />\nYJAROI.<br /><br />\nsaccharin.<br />\nSaccharin, or Ortho-sullobe crO'<br />\nwas a professor at the HoPl fillistie<br />\noi<br />\nUniversity's part that one `.05<br />\nwas the product of the 1-10143niciti ll<br />\n1923, was unavailable for c°111;<br />\nThe government claims t113'us, fan<br />\nthe Delaney amendment.<br />\nser kl<br />\nr llt'<br />\ncancer of the bladder ill'<br />\nAmendment forces them to °rceesIfi.;;<br />\nThe Administration here ;',A,11<br />\nI<br />\nweek, saying that.\" With<br />\nbetween the government antii5irriiii\\<br />\nreason behind the governillej.<br />\nMilton S. Eisenhower's boArt A<br />\nThere ar,e plans on the PtA;<br />\nvending rhiachines, and the<br />\nstatement to President Carter'<br /><br />\nstlub -- a nineteenth century turn-on<br />\nInlY $300 a year for room, board, and laundry, \"and I<br />\neard in a first-class place.\"<br />\n•,,Among<br />\nAmong boarding houses of Hopkins renown, Mrs.<br />\nstood taller than all. She revitalized students,<br />\n:Ilwied professors, and visiting lecturers with meals which<br />\nvould make the dorm cafeteria food look like cow<br />\n,fhodder. In his diary, a Hopkins student wrote that a guest,<br />\n„n4vIng eaten at Mrs. Egerton's Boarding House, said<br />\nDaltiMOre is the gastronomic center of the universe.\"<br />\nThe gripe that Hopkins is too graduate-oriented has<br />\nbeen a<br />\npart of the University since its inception. New<br />\n!aduate students frequently dined with the President and<br />\n,'Ith other faculty members. Professor Morris would invite<br />\n'Iudents to his home for \"oysters, beer, and cigars.\" Such<br />\nrilenngs even took place in the library, that is, until the<br />\ni<br />\nfatian<br />\ndiscovered a piece of chicken pressed between<br />\nPages of a very valuable book.<br />\ni Students often made house calls to their professors, the<br />\nfr4,stees, and their families. They visited the families of<br />\nYoung women en masse, as dating was still a<br />\nflsclalous endeavor. Clubs such as the Twenty Questions<br />\nfill') were organized by the inure creative Baltimore belles<br />\n°r the sole purpose of partying with Hopkins students.<br />\n110Pkins' first fraternity, Beta Theta Pi, was organized<br />\n1)(ktlY one century ago. The first pledge class journeyed<br />\nt°h Yale where they were initiated at President Gilman's<br />\nPter of the fraternity. Later, more fraternities came<br />\nexistence. Frat houses were more social than<br />\nential: only a few graduate students lived there, to<br />\nheelP pay the rent and thus maintain a fraternity<br />\nad quarters. Frat-community relations were a problem<br />\nthen, and landlords often evicted fraternities from<br />\ne_tr tow houses.<br />\nFrat athletics and hazing were unheard of until the late<br /><br />\nt<br /><br />\n1890's. But other activities, especially rushing, got out of<br />\nhand when brothers sought pledges from the nearby boys<br />\nprep schools.<br />\nPhi Beta Kappa was Hopkins' only honorary fraternity<br />\nat the turn of the century. President Gilman was<br />\nappointed its first chairman. Admission into Phi Beta<br />\nKappa required a unanimous vote, a rule which, due to a<br />\ncertain woman-hater alumnus, kept several .co-cd: from<br />\nmembership.<br />\nSince there was no gymnasium, itchy students turned<br />\nto recreational facilities in the city. The Baltimore<br />\nAthletic Club promised to waive the initiation fee of any<br />\nstudent provided he pay the one dollar monthly dues. The<br />\nUniversity chartered a horse-drawn wagon which brought<br />\nboys to clifton, the estate of Mr. Johns Hopkins, where<br />\nthey could play on the open lawns.<br />\nIn 1882 Edward Hartwell was appointed the Hopkins'<br />\nfirst physical education instructor. A year later a small<br />\ngym equipped with lockers, bath, and offices was<br />\nconstructed. Tennis courts were laid in the yard area. A<br />\nfootball team was organized in 1881, lacrosse in 1882. As<br />\nsports grew at Hopkins, it was obvious the present<br />\ngymnasium was inadequate. In 1898 row houses were<br />\ndemolished, and a new,larger gym was erected.<br />\nIn 1876 a club, modeled after the German kneipe, or<br />\ntavern, was organized for Saturday night get-togethers. The<br />\nstudents played cards, chess, smoked (cigarettes), drank<br />\nbeer, and sang German and Latin songs led by the<br />\nclassicist Basil Gildersleeve. Later the group established a<br />\nregular meeting hall in the back room of a grocery store.<br />\nSaint Dennis, a black man, tended the fire and<br />\noccasionally crossed the street to buy refreshments for the<br />\nstudents. In ten years the kneipe gave way to a more<br />\norganized Johns Hopkins University Club with Professor<br />\nGildersleeve presiding. Unfortunately undergraduates<br />\nwere screwed again as membership was limited to those<br />\ntwenty-five and over. Thus, many students had to seek<br />\nthrills elsewhere.<br />\nThe first society formed solely in the interests of the<br />\nundergraduates was the Matriculate Society. Their<br />\nopening dance--or \"hop\", as it was appropriately<br />\ncalled —was held on Commemoration Day, 1887, in the<br />\ngymnasium. Due to its success, the hops were held on<br />\nother occasions. Despite the fact that Goucher College<br />\nallowed only girls living with their parents to attend the<br />\nhops, there were usually enough \"locals\" on hand to<br />\ndance with.<br /><br />\nOld Administration building<br />\nThe theatre was almost untouched by Hopkins<br />\nstudents before the turn of the century. .The only<br />\ndramatic production on record is a minstral show by the<br />\nlight-hearted local fraternity, Alpha Sigma Sigma (ASS)<br />\nin 1890. The two hundred dollar profit from ticket sales<br />\nwas donated to the Athletic Association.<br />\nThe first Glee Club was formed in 1879 and enjoyed a<br />\nvery short life. In 1883 another Glee Club was organized,<br />\nwith tenor Woodrow Wilson among its first members. But<br />\na banjo and mandolin club formed five years later was so<br />\n'popular that it knocked the Glee Club out of prominence.<br />\nSoon this new music club, equipped with singers,<br />\nperformed concerts in Maryland and other states. Several<br />\nstudents, perhaps realizing their true talents, never<br />\nreturned to the University. This, along with a faculty fed<br />\nup with banjo practice in the classrooms, caused music to<br />\nabruptly stop at Hopkins. Is wasn't until almost the end<br />\nof the century that a new music group, incorporating glee,<br />\nbanjo, and mandolin, was organized.<br />\nThe Peabody Conservatory of Music always attracted<br />\nHopkins students. They were known even to cut class(or<br />\nseminars, as they were called) to see a performance. The<br />\ntheatre too, offered top-quality entertainment: Booth,/<br />\nJefferson, Rossi.<br />\nIn 1897 a music appreciation club was formed.<br />\nConcerts were performed in the original McCoy Hall<br />\ndowntown, under the direction of the Peabody<br />\nConservatory of Music. In a few years interest in this<br />\nmusic association waned.<br /><br />\n70's terrorism comes to the United States<br />\nViolence is as American as<br />\napple pie.\"<br />\n—H. Rap Brown<br /><br />\n0<br /><br />\nrIN goEs SOUR<br />\na<br />\ndin<br />\ncr nd<br /><br />\nHopkins University, Jimmy<br />\np tradition of the Johns<br />\nD.A. place a ban upon the the artificial sweetener<br /><br />\n10<br /><br />\nAc.<br />\nImide, was discovered in 1879 by Ira Rcmsen, who<br />\nty at the time. It has long been a matter of pride on the<br />\nw:ps useful and pleasurable food additives in American life<br />\nfoes! \"ulogy.. Remsen, who died Of cancer of the bladder in<br />\ntt1,1 ,4n<br />\naus!q a was due to the wording of a controversial'law known as<br />\nts,'•“! test in Canada which found that saccharin produced<br />\npokthgovernment claims that the wording of the Delaney<br />\nrestki aritroff the-market.<br />\nCigs<br />\nMuller was overheard at lunch<br />\n050,1 ti otherwise. President<br />\nOxiiiv Its, doubt that Mr. Carter wants to sweeten relations<br />\ner ktioersitY•\" High level insiders have intimated that the-real<br />\nns Was Carter's annoyance at having been left out of<br />\n,<br />\n,i-kuresIdent<br />\nis Calling<br />\nti„;<br />\nto have peanuts removed from all on-campus<br />\n\"uncil is contemplating sending a\" strongly worded\"<br />\nC<br /><br />\nI<br /><br />\nn.iiversity<br /><br />\nTerror has come home with a<br />\nvengeance to America. What used<br />\nto be condensed to one-column<br />\nparagraphs in the World Briefs<br />\nsection, along with the natural<br />\ndisasters and , new elections in<br />\nsome remote foreign country,<br />\nnow appear as front-page<br />\ndouble-deck headlines, with<br />\ngigantic photos of your business<br />\nassociate or next-door neighbor<br />\nheld at gunpoint.<br />\nThis new wave of violence<br />\nisn't necessarily more prevalent<br />\nor devastating than other eras'<br />\nlabor battles or protest<br />\nmovements. What sets the<br />\nhostage-taking and shooting<br />\nsprees apart is that it's personal:<br />\nno crowds clashing with police or<br />\nmobs fighting in the streets, but<br />\na lone figure or two with guns. In<br />\nTom Wolfe's \"Me Decade,\" the<br />\nimage of a direct attacker<br />\nentirely fits the mood of the<br />\ncountry, faceless while intensely<br />\npersonal.<br />\nAt the same time, the current<br />\nbrand of terrorism receives a<br />\ncertain measure of media glory.<br />\nPeople like Charles Manson (who<br />\nnow appears to have been a few<br />\nyears ahead of his time), and<br />\nPatty Hearst are cult items. The<br /><br />\nrevolutionary airs attached to<br />\nsome - terrorist groups almost<br />\nmake them \"respectable\" in<br />\ntelevision eyes -- the Mao Hour in<br />\nNetwork isn't too many seasons<br />\naway. It's very easy to dismiss<br />\nsomeone perceived as an<br />\nanarchist they're fighting a<br />\ngovernment with an ideology, a<br />\nsimple tag that excuses thinking<br />\nabout whatever motives are<br />\nbehind them.<br />\nMeanwhile, each week brings a<br />\nnew figure out of nowhere,<br />\nholding up or shooting at equally<br />\n.anonymous people. Charles<br />\nHopkins, on trial this week, can't<br />\npay rent and takes on City Hall.<br />\nIn Indianapolis, Anthony Kiritsis<br />\nwires up his landlord and parades<br />\nhim down the street.<br />\nFolks<br />\nlike Fred Cowan and Corey<br />\nMoore pop out of places like<br />\nNew Rochelle and Cleveland to<br />\nnational attention or a call from<br />\nthy President.<br />\nFinally, the siege in<br />\nWashington conducted by Hanafi<br />\nMuslims appears to confirm the<br />\nimpression of a piecemeal<br />\naniarchy, some in large organized<br />\ndoses, most however erupting in<br />\na random place, taking the<br />\nnearest available hostage.<br />\nNaturally enough, politicians<br />\nsuspect, another round of<br />\nassassinations. Senate Majority<br />\nLeader Robert Byrd wants a<br /><br />\nbullet proof glass screen<br />\nconstructed around the Senate<br />\nfloor. And the special House<br />\nAssassinations Committee revives<br />\nitself every • few months,<br />\npresumably with one eye on the<br />\nmurders of the sixties and the<br />\nother nervously glancing at<br />\nfuture targets.<br />\nSensational assassinations,<br />\nhowever, would seem out of<br />\nplace or lost amid the new<br />\nterrorist climate. Some people<br />\nwill doubtless get an urge to go<br />\nafter Carter (or at least the<br />\nfactory nearest him), but the rest<br />\nwould settle for just about<br />\nanyone. The scores of hostages<br />\ntaken in various incidents.<br />\ncertainly were not direct targets<br />\n— you could be the next one<br />\ncaptured, if in the right (wrong)<br />\nspot.<br />\nThat's what scares most about<br />\nthe recent attacks: there doesn't<br />\nappear to be any motive or<br />\nintended targets. Bodies are held<br />\nto be bartered for no apparent<br />\nvictory or loss. Eventually, legal<br />\njustice winds up each individual<br />\nact, but there's no sense of<br />\ndeterrence or conclusion. Just<br />\nmore headlines and tense film<br />\nfootage to come. The mood of<br />\nthe seventies has put its personal<br />\nstamp on violence.<br />\n1:M• Garknid<br /><br />\npage 10/news-letter/march 18, 1977<br /><br />\n/AL<br />\nL<br /><br />\nzias2721'17<br /><br />\nOnQ117<br /><br />\nsk3:\\,:onv<br />\n1111-17:2©:-2 27, OT7 1;00<br />\nC7r117.13:1 ica':11:4\\10 COisiii.\"*AZIEGATICnJ<br />\nA<br />\n°<br />\ntrk 4.4<br />\n.c`<br />\n4.‘<br />\n0 .;•&lt;•c<br />\n„<br />\n0<br />\nL.1:4<br /><br />\n0100 Stevenson Eload<br /><br />\nPRE.SENTS<br /><br />\nYou are invited to hear<br /><br />\nTH-E<br /><br />\n1117<br /><br />\nf<br /><br />\nU.S. SENATOR F2A:1:c CEU471Cii<br />\nMember of the Senate Foreign Relations Committee<br />\nand leading advocate of human rights<br /><br />\nsTin:3<br /><br />\nANNUAL<br /><br />\nHEALTH CAREERS<br />\nSYNPOSIU11<br /><br />\nU.S. SEAAT011 PAUL S.<br />\nMember of the Senate Foreign Relations Committee<br />\nART/ GOON:111H<br /><br />\nExecutive director, National Conference on Soviet Jewry<br /><br />\nDR. ROBERT 0. FREEV1AN<br />\nDean, Peggy Meyerhoff Pearlstone School<br />\nof Graduate Studies, Baltimore Hebrew College<br /><br />\nSponsored by the Soviet Jewry Committee<br />\nof the Baltimore Jewish Council<br />\n752-2630<br /><br />\nMot4., I ues.,+WEb., MARC.14 at,01a, 4a3<br />\n; o PM.<br />\nvtawirvc,<br /><br />\nRoot-% OF Ttie STutANT<br /><br />\nUN ioN<br /><br />\nPublic Invited<br />\nFree Admission<br /><br />\nCFRes REPAsisip-ielvts)<br /><br />\n74.•.{. J. J.<br /><br />\n.1:\"..Pr<br /><br />\n•-•-*•••<br />\n••!4••4•1<br /><br />\nJilt Housing Lottery<br />\nContract Signing Sessions<br />\nMonday March 21 - single units, single and double spaces<br />\nTuesday, March 22 - three-, four-, and five-person spaces<br />\nDormitory Social Lounge - 7 p.m.<br />\nAll students whose names were drawn in the housing lottery<br />\nand who wish to accept the offered space(s) must attend<br />\nthis session. Contracts will be signed at this time.<br /><br />\nQuestions should be directed to:<br />\nBelva Scott or Umran Uras<br />\nOff-Campus Housing Office<br />\nWolman Hall, 338-7958<br /><br />\nA Touch oF CLASS:<br /><br />\nmarch 18, 1977/news-letter/page 11<br /><br />\nLONg JOIIN'S<br /><br />\nbar of the wee<br /><br />\nWith workers at Bowie on strike, and all indications suggesting that Pimlico won't open this Monday, one<br />\nmight feel no need to drive out West29th Street to the Jones Falls Expressway. Well, the JFX does not look<br />\ntoo promising, but don't give up on that general direction. There happens to be a place named Long John's<br />\nPub that sits on the tail end of West 29th, across from Sterling's, yet.<br />\nLong John's is as good a spot as any to drown out the sorrows of shut-down Maryland race tracks. In<br />\nfact, this bar rates a cut above the average Greenmount or Hampden saloon, at least in terms of decor.<br />\nTables with non-plastic green tablecloths. Candles that have fishnet patterns around their glass containers.<br />\nSwivel-action leather bar stools and a deluxe giant TV screen.<br />\nPlushness, however, is a double-edged sword in drinking establishments. The ritzy style at Long<br />\nJohn's—as one patron conjectured. \"the owners must just be little homebodies\"—tends to preclude a sense<br />\nof locale, of Baltimore turf. The bar could be uprooted and transplanted anywhere along the Eastern<br />\nseaboard without the blink of an eyelash. During football season, Colt highlight films and Monday night<br />\ngames aroused loyalty; nowadays, a bare Oriole poster hangs on the wall to remind one of the city.<br />\nThe \"notch-above\" atmosphere fortunately does not bring along higher prices. Tuborg Gold goes for<br />\nforty cents a draft, a very modest expense. And Happy Hour from five to six (Monday through Thursday)<br />\nfeatures a nickel off the beer and mixed drinks for forty cents. To get food, show up sometime in the<br />\nafternoon for standard grill fare; at night, pizzas are served until 11:30. Those who complain of an absence<br />\nof Nathan's in the area should check out the Monday night special: hot dogs for a quarter apiece.<br />\nThe physical proportions inside Long John's also set it apart from the neighborhood taverns. A very long<br />\nbar cuts a large \"L\" in the room, leaving relatively small space for tables. Most of the patrons, then, sit at<br />\nthe bar, which doesn't make for the crowds about the tables usually seen at other places. Instead, this is one<br />\nplace the reviewer can trot out that favored word—\"intimacy.\"<br />\nFor some action, the jukebox suffers from an overdose of country tunes, though a Buddy Holly number<br />\nof \"When Irish Eyes Are Smiling\" may be found. A couple \"new\" pinball machines (one is Captain<br />\nFantastic) stand along one wall, a rarity in these parts—most bars carry the old-style machines that lack<br />\nflipper, points, and any apparent redeeming social value. The real game connoiseur will be delighted to find<br />\na miniature electronic bowling alley, where one slides a metal disc to knock down the pins. Several different<br />\ngames can be played, all for a long-lasting quarter for two contestants. And anyone who scores over 199 on<br />\nthe \"Regular\" version may receive a welcome surprise one Friday (ask the bartender for details).<br />\nLong John's will probably seem unfamiliar to the seasoned local barg..,er, what with its higher-class<br />\ninterior and close surroundings. Like any good bar, however, a few rounds and words with the regulars will<br />\nmake one feel right at home in Charm City.<br />\n2<br />\n--Sizuff'y Sandlot<br /><br />\nDiNiNq IN BALTIMORE -- NATURAL<br />\nScirocco Restaurant, 3900 N. Charles<br />\nSt., is the most recent addition to thE<br />\nlimited list of natural food restaurants in<br />\nBaltimore. Unfortunate1y, it is not the<br />\nwonder it is advertised to be.<br />\nTo begin with, Scirrocco has an<br />\nidentity problem. Benevolent murals of<br />\nsmiling suns and friendly cacti are<br />\njuxtaposed with a well-stocked bar, over<br />\nwhich sits a plastic sign bearing the<br />\nrestaurant name. Waiters cheerfully<br />\nattired in Scirrocco T-shirts work with a<br />\nmaitre d' in a black three-piece suit, a<br />\nman who belongs more with the<br />\nfasionable establishment on the other side<br />\nof the partition.<br />\nThis peculiar split personality is also<br />\nreflected in the table settings and menu.<br />\nThe blue -checkered tablecloths are<br />\nprotected by a sheet of acrylic on which a<br />\ndirty little vase holds a few dried flowers.<br />\nThe course offerings vary from the<br />\ntraditional roast prime ribs of beef to'the<br />\nmore \"exotic\" and \"original\"<br />\nall-vegetable dishes.<br />\nDinner began with soup served in a<br />\ncup, a feature not mentioned on the<br />\nmenu. The fresh mushroom soup was<br />\nneither tasty nor fresh, and seemed<br />\nreheated. For one-fourth the price, a can<br />\nof Campbell's would have been more<br />\nplentiful and appetizing.<br />\nOur appetizers, mushroom caps stuffed<br />\nwith snails in garlic butter, were an<br />\nextreme disappointment. The few<br />\nmushroom slices floating in the soup<br />\ncame from larger mushrooms than those<br />\nused for appetizer. The taste of garlic<br />\nbutter was barely perceptible, and the<br />\ndecorative parsley limp beyond<br />\nrecognition.<br />\nOur main courses consisted of small<br />\nPortions of a curried vegetable dish<br />\nWithout curry (bearing a strange<br />\nresemblance to another dish on the<br />\nmenu), and a Ratatouille casserole. The<br />\nvegetables were generally unrecognizable<br />\nby taste or appearance, due to<br />\novercooking or continuous re-warming.<br />\nWhen the Ratatouille, which was cold on<br />\nthe inside, was returned, it came back<br />\nalmost immediately piping-hot, the plate<br /><br />\nPub<br /><br />\nstill manageable. This suggested the use of<br />\na micro-wave oven. Is this the \"natural<br />\ntaste of food\" that Scirrocco's boasts?<br />\nThe gastronomical highlight of the<br />\nevening was the bread, two honey-carrot<br />\nmuffins fresh from the oven, served at the<br />\nend of the meal.<br />\nThe establishment claims that \"every<br />\nmeal is prepared to your order.\" Is this<br />\nthe only excuse for slow service and<br />\ntemperamental cooks? There are no<br />\nchoices offered within any dish, and it<br />\nturned out to be difficult to distinguish<br />\none vegetarian item from another. The.<br />\nmenu differentiated by sauce, but the<br />\nchef didn't seem to go that far.<br />\nScirrocco is more expensive .and<br />\npretentious, and less imaginative than the<br />\nother natural food restaurants in the area.<br />\nThey are attempting to integrate healthy<br />\neating with middle-class standards: They<br />\nhave not succeeded—they have only<br />\nmanaged to bring out the worst aspects of<br />\nboth realms.<br />\nPerhaps they should not have tried.<br />\n-- The Bobsey Twins<br /><br />\nSaturday past, several consorts and<br />\ntook a stroll down Little Italy way,<br />\nthought we'd eat well, drink well, and be<br />\nItalian for at least a night. Maybe longer.<br />\nWe would have been wiser to make the<br />\ntrek a bit later than dinner hour since<br />\nevery establishment of any repute in<br />\nLittle Italy sports round the black lines<br />\nfrom 6:30 to 7:00 weekend nights. We<br />\nwound up at Chiapparelli's 237 High St.,<br />\nand have yet to regret it.<br />\nThe wait was long -- maybe two hours -but the stand-up bar to the left of the<br />\nrestaurant was enough to settle our thirst,<br />\nenough to prime us for an exciting meal.<br />\nOur drinks were all delicious and then<br />\nsome: the Freddy Fudpucker had ample<br />\nevidence of tequila and the fresh banana<br />\nwas crushed just right. The gin and tonics,<br />\na popular drink at our quarter of the bar,<br />\nmet with thumbs up all around.<br />\nAll the appetizers were good, but the<br />\nclams casino was thG hit of the night.<br />\nClams casino like I've never had them;<br /><br />\nFood ANd LiTTEE !Tay<br /><br />\nhuge, tasty clams suffocated by a<br />\ntantalizing concoction of tomato, herbs<br />\nand breading. This taste treat is not to be<br />\nmissed. The entrees were all delightful, the veal<br />\ndishes drawing special praise. The<br />\nhighlight, however, was the Ed Perry's<br />\nShrimp and Clam Scampi, a mystical dish<br />\nthat begs not to be eaten, but just gazed<br />\nupon. Rarely in an Italian restaurant<br />\n[in any restaurant] have I come across a<br />\nscampi so fixed up with jumbo firm<br />\nshrimp and tender clams. Quite a<br />\nsensation, to say the least.<br />\nIn all fairness, one must admit that the<br />\ndeserts were a mixed bag. The spumoni<br />\nand tortoni were run of the mill affairs,<br />\nI've had better at the opening of a<br />\nsuburban Carvel. The cheese cake wasn't<br />\nbad, but a mistake after such a rich meal.<br />\nCoffee was fine.<br />\nChiaparelli's tariffs are a bit dear—our<br />\nbill for seven came to $136, with several<br />\ndrinks apiece--but if you've got a few<br />\nbucks to spare there's no excuse not to<br />\nscoot on down to Chiaparelli's.<br />\nilthouglz some Baltimoreans will tell<br />\nyou otherwise, it is possible to get burned<br /><br />\nin Little Italy. We know that reality all<br />\ntoo well.<br />\nSergi 's Ice House doesn't look all that<br />\nbad from the outside, just a boring white<br />\nbuilding. I don't want to go on too long<br />\nabout this excuse for a restaurant, but as<br />\ne gastromme du peup1e, / feel compei!ed<br />\nto rake over a few details, ugly as they<br />\nare.<br />\nFor starters, the drinks were weak.<br />\nAlso tasted funny. The appetizers were<br />\npoor. Our main dishes varied, from the<br />\nmediocre—ravioli, spaghetti and Italian<br />\nsausage- to the positively criminal. In that<br />\nlatter category were the chicken and veal<br />\nparmesan, which were both stretched out<br />\non huge plates like pancakes, a thin strip<br />\nof chicken or veal buried by greasy<br />\nbreading. The clams possillipo were<br />\nhopelessly lost amid an 'indifferent sauce.<br />\nThe salads hrere plain and limp, the<br />\nbread cold and slightly, stale, and the<br />\ncheesecake -too heavy. All this fur a stiff'<br />\nprice, at least ten dollars over what it<br />\ndeserved.'<br />\nI felt awful the rest of that day, and it<br />\nwasn't until I downed five Old<br />\nMilwaukees in Hansen 's Saloon that Ifelt<br />\nlike myself' again.<br /><br />\npage 12/news-letter/march 18, 1977<br /><br />\nTROOP]<br /><br />\nO_P-1<br /><br />\nOfig OPFR<br /><br />\n5_5_0<br /><br />\n13rea0<br />\n. 5-1wiihFjeienad...<br /><br />\nSATURDAY<br />\nIN THE RATHSKELLAR<br /><br />\nThs Sutiday<br />\nto<br /><br />\n- tfn •<br /><br />\nRRst ENeUsg LuTRERAN ci4uRct4 HouGf<br />\n3803 N. ciur(es s+reet<br /><br />\na<br /><br />\n-g<br />\nNONVERBAL COMMUNICATION STUDY<br />\nMen and women undergrads sought for(study on the<br />\ncommunication of feelings through nonverbal cues.<br />\nTakes about 90 minutes, pays $3.00. Nonverbal<br />\ncommunication is one of the fastest growing and<br />\nmost fascinating areas of research in psychology. Call<br />\nor come see Dr. Hall, Ames 237, 338-7876, to get<br />\nmore,information and to sign up.<br /><br />\nROBINSON'S GORSUCH HOUSE<br />\n511<br /><br />\nGORSUCh<br /><br />\nAVENUE 235-2744<br />\nNEWLy-dECORATEd!<br />\nNEW MANAgEMENT!<br /><br />\nIFEATURiNg...<br />\ngREEk et AMERICAN CUISINE<br /><br />\nCOME iN<br />\n*<br />\n*<br />\n*<br />\n*<br /><br />\n[g]<br /><br />\n-g<br />\na<br /><br />\n50'S DANCE<br />\nMusic Provided by<br />\n`Starfire'<br />\nCelebrate the 1st<br />\nLacrosse Game<br />\nAdmission $.35<br /><br />\n-g-g<br />\nig Look for a Union<br />\nrg Board Dance in<br />\nli l the Glass Pavilion<br />\non April 8.<br /><br />\nANd TRY OUR<br /><br />\n5_<br /><br />\nFlaming shiskabob<br />\nGreek salad<br />\nPastitsio mousaka<br />\nBaklava<br /><br />\nAcademy Award Nominations!<br /><br />\nRooms available for private parties<br />\n--- Banquets --- Catering ---<br /><br />\nUV ULLMANN<br /><br />\nBURCH TRAVEL LTD.<br />\n3900 N. Charles St.<br />\n467-3900<br /><br />\nBEST ACTRESS<br /><br />\nFrom April 1 through June 14, you can fly roundtrip from<br />\nNew York to Luxembourg for only $410.<br />\nThat's $89 less than the youth fare you'd pay on any<br />\nother scheduled airline.(From Chicago you pay $458 and<br />\nsave $103.) All you have to do is be under the age of 24.<br />\nThere are no booking restrictions. And no skimping on<br />\nmeals or service. Because we give you the same service<br />\nyou'd get from other airlines, without the same high costs.<br />\nSo,if you're not flying Icelandic to Europe, you're<br />\nspending more than you have to.<br />\nWe'll give you the best deal.<br /><br />\nINGMAR BERGMAN<br /><br />\nBEST DIRECTION<br />\nIN \"FACE TO FACE\" ;A ;;;;::e ▪ •,.\\\\•<br />\n•<br /><br />\n• `1.=.7- •<br /><br />\naKee<br />\nVittorio<br />\nDe Sica's<br /><br />\nSave$89onjetfares<br />\nto Europe and book<br />\nanytime you want.<br /><br />\nvacanABiief<br />\non<br /><br />\nIcelandic Airlines, Dept. ##CN<br />\n630 Fifth Ave., N.Y., N.Y. 1(X)20<br />\nSee your travel agent. Or al toll free:(840 555-1212.<br />\nPlease send information on all Icelandic's low-cost fares to Europe.<br /><br />\nStarring Florinda Bolkan<br />\nDirected by Vittorio DeSica<br />\nAn Allied Artists Release aD<br />\naao • Color<br /><br />\nName<br />\nAddress<br /><br />\n1 .d.<br /><br />\n-A GREAT FILM!<br />\nONE OF LIFE'S<br />\nRICHEST<br />\nAND MOST<br />\nREWARDING<br />\nPERSONAL<br />\n- EXPERIENCES!<br />\nRe\\ Reed.<br /><br />\nSyndicated Columnist<br /><br />\n,<br /><br />\nCity<br /><br />\nState<br /><br />\nLFares subjectp<br />\nt4. change and 'Z.%pr,<br />\n.1 a,,.d<br /><br />\ni<br /><br />\nZip<br /><br />\n_.J<br /><br />\nLowest Jet fares to Europe of any scheduled airline.<br /><br />\n•<br /><br />\nA Film Event You Shouldn't Miss!<br />\nROTUNDA CINEMA<br />\n40th St. and Keswick<br />\n235-1800<br /><br />\n•<br /><br />\nmarch 18, i977/news-letter/page 13<br />\n./<br /><br />\nI\"<br /><br />\nI<br /><br />\n.0\"<br /><br />\n00'<br /><br />\n.•••<br /><br />\nLOOKING FOR WORK?<br /><br />\nOFFICE OF THE CHAPLAIN<br />\n\"THE SUNDAY EXPERI ENCE\"<br />\nPresents<br /><br />\nWhat is your resume telling an employer? I will analyze<br />\nyour current resume and/or develop a new one that will<br />\nproduce results. Call 628-7561, 10AM-9PM.<br /><br />\nSPANISH by experienced native<br />\nteachers - All levels, all age*.<br />\n146-2056.<br />\nPharmaKinetics Laboratories t<br />\nconducting studies to compar<br />\ndifferent brands of prescriptio<br />\nmedicines. Safety and effectivene<br />\nof these medicines have already<br />\nbeen established. If 19-30 years old<br />\nmale, healthy, you may be eligible<br />\nto participate. Studies involve<br />\nstaying over-night in our dormitoryj<br />\ntaking a dose Of medicine and the<br />\ndrawing of several small blood<br />\nsamples by skilled technicians<br />\nStudi‘es are conducted under strict<br />\nmedical superivision. Participants<br />\nare paid $70-$500 depending upon<br />\nthe length of time involved. To find<br />\nout if you are eligible you musttake<br />\na physical exam to determine if you<br />\nAre healthy. We will pay you $10<br />\nfor taking the first physical. Bring<br />\nvalid I.D. Call 366-2001.<br /><br />\n\"A FORUM OF HOPKINS STUDENT GROUPS<br />\nWITH SPECIAL INTERESTS AND CONCERNS\"<br /><br />\nYour Campus-Pride!<br />\nNEW<br />\nNEW REVOLUTIONARY<br />\nUNIQUE<br /><br />\nwith Representatives from:<br />\nthe BLACK STUDENT UNION<br />\nthe GAY CAUCUS<br />\nthe HOPKINS PLAY GROUP<br />\nand ASOCIAL/POLITICAL ACTIVIS I<br /><br />\nHISTORIC— First University Campus Postcards<br />\n•<br /><br />\nDifferent Superb Scenic-Views,<br />\nFrom Your Campus. On One Card<br />\nYOUR CAMPUS PRIDE GOES WORLDWIDE<br /><br />\n1<br /><br />\nThink! Think more often on your relatives &amp;<br />\nfriends, drop them a line. They will admire &amp;<br />\ntreasure your pride! Frame one for yourself!<br />\nSUNDAY, MARCH 20, 11:00 AM<br />\nLISTENING-VIEWING ROOM<br />\nLEVERING HALL<br /><br />\n16 MM MOVIES shown for all<br />\noccasions- 1000's of titles. Call<br />\nahead:Richard, 377-0762.<br /><br />\nU1-PRIDE CREATIVE POSTCARDS<br />\nON SALE/AT YOUR UNIVERSITY BOOK-CENTER<br /><br />\nThe<br />\nchallenge<br />\nHidden in this diagram are the names of<br />\ntwenty foods or snacks that go great with<br />\na cold Pabst. They may be spelled forwards<br />\nor backwards, vertically or horizontally, even<br /><br />\nPART TIME employment<br />\nopportunity for Student proficient<br />\nin Fortran computer programming,<br />\nMath/Stat, background considered a<br />\nphi's. Call 7 30-51 28 or write<br />\nMASINC, 10221 Wincopin Circle<br />\nsuite 216, Columbia, Md. 21044.<br /><br />\nWe hunt Ocean Rose<br />\nfor the Mardi Gras!<br /><br />\nBill's<br />\nUnivesitti SandvAch Shoppe and Deli<br />\nAd Lump Crab Cakes<br />\nGenuine Koiher Corned Beef<br />\nDelicious Roost Beef<br />\nVirginia Baked Ham<br />\nVarious C0/<br />\n1<br />\n41 Cuts<br />\nCheese(Swim, Provolone.. Muemter)<br />\nKother Hot Dogs<br />\nCatering<br />\nParty Trays(special order)<br />\nPim<br />\nHome Made Desert(Chem Cake)<br />\nIce Cream<br />\nSelect Grocery item<br />\nRants<br /><br />\ndiagonally, but are always in a straight line.<br />\nThe first one has been circled to get you<br />\ngoing. Your challenge is to discover and<br />\ncircle the other nineteen!<br /><br />\nWVARJ X<br />\nBCYPHOTDOG<br />\nMDEPCOUANPLF<br />\nMAK P I ZZAMUOUHT<br />\nE ROWGON PS V P I DS<br />\nYUJDOMECORNCH I P<br />\nTHNZAKYFTACOSBA<br />\nXACWCDS I AVERUBG<br />\nS HR I MPRSTHPNRQH<br />\nTTHGSEEHOQRJ PBE<br />\nO CELNAGNCHEESET<br />\nZAYABNRCHXTCWET<br />\n✓ EUKUUH I FZTGF I<br />\nH HRXTB I PTERAQJ<br />\nAK PSMPSALAM I<br />\nMLNASMKS_NA<br />\nRH .FCJO<br /><br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br /><br />\nPR E-M ED STUDENTS: Trouble<br />\ngetting into medical school? Let us<br />\nput you in med. school in Italy.<br />\nContact immediately: A.M.S.I., Box<br />\n155, Landenberg, P \". 19350, dr<br />\ncall: (215)-274-8951<br /><br />\nRESTAIMUNIT &amp; CARRY OUT<br />\nnom 4674362<br />\nUPSIVIDIMINTY PARKWAY<br />\n114 - Fri: 9:30 - 7:00<br />\nAT APT. PAUL.<br />\nL.<br />\n1.41111011111111111fTY ONE ARIL<br />\nSat: 9:30 - 2:00<br />\nMod Sundays<br />\nFREE SODA WIT9 TM1S A n AND<br />\nPURCHASE OF S1.00<br /><br />\n(UNIVERSITY STUDY<br />\nInterested in earning university credits<br />\nwhile exploring a new land in all its<br />\naspects? Why not consider a summer.<br />\nsemester, year, or degree program at<br />\none of Israel's seven leading<br />\nuniversities. Religious studies,<br />\nhumanities, the social sciences and a<br />\nhost of other courses are offered in<br />\neither English or Hebrew with special<br />\nemphasis on helping you get a grasp<br />\nof Israel. Whether it be in Jerusalem,<br />\nHaifa, Tel Aviv or the Negev, a study<br />\nprogram at an Israeli university will<br />\ngive you a new feeling about Israel<br />\nand yourself as well. Write for a/<br />\nbrochure giving information about all<br />\nthe universities and the programs they<br />\noffer.<br />\nCouncil for Advancement<br />\nof Study Programs<br />\nat Israeli Universities,<br />\n515 Park Avenue, New York,<br />\nNew York 10022,(212)751-6070<br /><br />\nFor information, please send to the above address.<br />\nName<br /><br />\nAge<br /><br />\nAddress<br /><br />\nPABST. Since 1844.The quality has always come through.<br /><br />\nCity<br /><br />\nC1977 PABST BREWING COMPANY Milwaukee Ws Peoria Heights III ,gewark NJ Los Angeles Calif Pabst Georgia<br /><br />\nUniversity<br />\nI.L.L3HOVdS V\\IVH SOOV1 000<br />\nLOH HOIMONVS Sd1H0 N HSIJ SdIHD NUOD di/11181-1S A3)1811.1 N3&gt;IDIHO A339 099 N900<br />\nsPc..3 ..PP!H<br />\n-dOd VZZId )4V31S H30t3n9INVH ST:3Z13Hd liNtrIVS 3S33HD SdIHD 01V10(.1<br /><br />\nState<br /><br />\nZip<br /><br />\n.14<br /><br />\npage<br /><br />\n14/news-letter/march 18, 1977<br />\n•<br /><br />\nCOLOR NOTES<br /><br />\n•<br /><br />\nJohn Allan, Wayne Abernathy, and<br />\nMarci Foggan are not returning to<br />\nHomewood next year(hurrah!). This<br />\ncreates vacancies among the officers<br />\nof the Johns Hopkins Republican<br />\nClub. Therefore, the JHU—GOP club<br />\nwill be holding General Elections for<br />\nofficers Tuesday, March 22 at 6:30<br />\n, p.m. in Rowland 300:<br />\nIt's back again! Yep, the<br />\nStarlighter! The Fl-Club is once again<br />\nsponsoring its moonlight cruise. The<br />\nbig date is May 7 at 8:30 p.m. Tickets<br />\nwill be sold on a first come—first serve<br />\nbasis at the Athletic Center from 1-3<br />\ndaily. There are a limited amount so<br />\nget. your tickets. Don't be left<br />\nstanding at the dock with your thumb<br />\nin your nose. One big night of<br />\ndancing, drinking (mixed drinks),<br />\neating (and swimming?).,At $12.00<br />\nper couple, what more can you ask?<br /><br />\nI<br /><br />\ngri<br /><br />\nAn Evening of<br />\nWhole Earth Music<br />\nwith the<br /><br />\nPAUL WINTER<br />\nCONSORT<br />\nMonday,March 28<br />\n8 p.rn.<br />\nField House<br /><br />\nESSEX COMMUNITY COLLEGE<br />\n$2.50 Admission<br />\n$1.50 ECC Students<br /><br />\n11-1E BOLTON HILL FRAME SHOP<br /><br />\nFULL SERVICE CUSTOM FRAMING AND<br />\nQUALITY CRAFTS AT REASONABLE PRICES<br /><br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n()<br />\n0<br />\n()<br />\n()<br />\n0<br /><br />\n15% OFF OP ANY FRAMING ORDER<br />\nwri-N 11-PS AD.<br />\nIIS NC1`4ECHEN STREET<br />\n212.17<br />\n(26q -6333<br />\nNON lUES WED FRI falo 71-1UFt.5 104:30 5C' 10-5<br /><br />\n0<br />\n0<br /><br />\nTickets Available: 682-6202<br />\n9<br /><br />\n-<br /><br />\nThe Johns Hopkins University<br />\nJewish Students Association is<br />\nsponsoring a bagel brunch this<br />\nSunday, March 20,, in the Kosher<br />\nDining Hall, from 11:30 to 1 o'clock.<br />\nAll the bagels, lox, white fish, and<br />\ncream cheese you can eat for one<br />\ndollar.<br />\nThe Jewish Students Association is<br />\nsponsoring religious services on Friday<br />\nnight at 6:30 in the Kosher Dining<br />\nHall. Saturday Afternoon Services will<br />\nbe held at 5:30 in the KDH.<br /><br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br /><br />\nsuommusteantr<br /><br />\n(..--\\\\........\\__<br /><br />\n,.....,r<br />\n„c„, ---, ,--\"7<br />\n....<br /><br />\n• .<br /><br />\no•<br /><br />\n-<br /><br />\n--r,<br />\n......<br /><br />\n--...\\,? )<br />\nt<br />\ns-.--:<br />\n\"<br />\n. 4 -t Iiis<br /><br />\n1<br /><br />\n'' --\\\\<br />\n.)...1<br /><br />\n7.<br />\nN.\\,n --51•.... =<br /><br />\n11:<br />\n11<br /><br />\n-.'<br /><br />\n.......<br /><br />\n.,,,,<br /><br />\n%.1<br />\n)<br />\n: s'-`\\. --•;\"\\-N<br />\n,<br /><br />\n•<br /><br />\n.....<br /><br />\n.11011.0.1.<br /><br />\n1%<br /><br />\n•<br /><br />\nA paid typist is needed for the<br />\nSpring Fair. If interested, call<br />\n338-7682.<br />\nThe finals of the First Annual<br />\nJohns Hopkins Open Squash<br />\nTournament will be held Wednesday<br />\nafternoon, March 23. The public is<br />\ninvited.<br />\nBIA Lacrosse Deadline for rosters is<br />\nFriday March 25. Rosters can be<br />\npicked up in the Newton H. White<br />\nAthletic Center. It is important that<br />\nthe rosters are in before vacation so<br />\nthe schedule can be made up.<br /><br />\nB1S/M3S OPPORTUNffY<br /><br />\ntuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nhninediate Earnings<br />\nSend $1.00 To:<br /><br />\nEnvelopes Dept.339*<br />\n310 Franklin Street<br />\nlisten<br />\ns<br />\nLIVE! OH STAGE!<br />\nTHE 50's COME TO LIFE!<br />\ningest<br />\ndanc<br />\ntovvd<br />\nshoW in<br /><br />\n\\<br /><br />\nAO\"`1\\<br /><br />\n1)<br /><br />\nPut your expensive eye<br />\nbehind our inexpensive System 35:..and WOW.<br /><br />\nCHARGE TICKETS<br /><br />\nBY TELEPHONE WITH<br />\nYOUR CREDIT CARD.<br />\nPhone(301)727-4103<br />\nTickets available at<br />\nall T)cketron outlets<br /><br />\nTHE NEW<br />\nMECHANIC<br />\nMorris A. Mechanic Theatre<br />\nHopkins Plaza, Baltimore<br />\nANEW .1111111. .111111111.<br /><br />\n.0111i<br /><br />\nJOHN GA CH BOOKSHOP<br />\nBALTIMORE'S LARGEST<br />\nUSED BOOKSTORE<br />\nI<br /><br />\n3322 Greenmount Ave.<br />\n467-4344<br />\nUSED AND RARE<br />\nOLD AND OUT—OF—PRINT<br />\n•41.1.<br /><br />\n•IIMP•<br /><br />\nI1<br />\nI<br />\nI ,h'Ik<br />\nI<br />\nI<br /><br />\n.111111.• ••IMM• .1111•• I<br /><br />\nJust about any of the great photographs you see<br />\ncould have been taken with Vivitar System 35.<br />\nPlus one good eye. Vivitar System 35 is a most<br />\ninexpensive way to get serious about photography.<br />\nThe basic limitation is your own creativity and skill.<br />\nVivitar 220/SL 35mm camera Center-weighted<br />\nmatch needle metering system/Speeds from<br />\n1/1000 to 1 second plus \"B\" for time expo- _<br />\nsure/Electronic flash sync at 1/125th<br />\nsecond/Universal thread mount 50mm<br />\nf1.8 lens/En'ilt-in hot shoe/Self timer/<br />\nFilm-in -chamber indicator/ASA Range<br />\n25-1600. Vivitar Automatic Electronic<br />\nFlash Up to 200 flashes from one single<br /><br />\n.Ponder &amp; Best, Inc<br /><br />\n1977<br /><br />\nVivitar System 35<br /><br />\n9 volt alkaline battery. Vivitar Automatic<br />\n135mm f2.8 lens Super focal length<br />\nfor portraits/About 21/2 times larger than<br />\nnormal image. Vivitar 2X Tele Converter<br />\nDoubles'the effective focal length of your<br />\nlenses/Converts the 50mm lens to 100mm/<br />\nthe 135mm lens to 270mm.Vivitar Enduro<br />\nCase Carries the entire system comfortably and securely while hiking, cycling,<br />\nskiing, etc. Find the nearest Vivitar dealer and<br />\nask for a demonstration.<br />\nMarketed in the U.S.A. by Ponder &amp; Best, Inc.<br />\nCorporate Offices: 1630 Stewart Street, Santa Monica,<br />\nCA 90406. In Canada: Vivitar Canada Ltd./Ltee<br /><br />\nmarch 18, 1977/news-letter/page 15<br /><br />\nLaxinen defeat Hobart.<br />\nYale next victim Saturday<br />\nPlaying on a chilly Homewood Field Wednesday<br />\nafternoon, a pack of Blue Jay stickmen warmed up for<br />\ntheir regular season opener by whipping a hot Hobart<br />\nsquad, 17-10.<br />\nThis was Hopkins' final inter-collegiate scrimmage<br />\nbefore hosting Yale Saturday afternoon when the Jays<br />\nbegin pursuit of the 1977 national championship.<br />\nFIobart provided an excellent test for JHU. The visitors<br />\nfrom New York state are defending National champions.<br />\nin Division II and, according to Homewood coach<br />\nHenry<br />\nCiccarone, \"play a gambling style of lacrosse that<br />\n(Hopkins) probably won't see too much of during the<br />\nseason.\"<br />\nThe Jays had played sluggishly during the first quarter<br />\nof their previous two scrimmages, but such was not the<br />\ncase on Wednesday afternoon. Hopkins opened with a<br />\ntremendous rush and it looked as though Hobart would<br />\n'be run right off th6 field and clear across University<br />\nParkway.<br />\nJHU opened the scoring early in the opening period,<br />\nculminating a series of passes in which over half the team<br />\nmembers on the field had possession of the ball. After<br />\nmaking a save, goalie Kevin Mahon passed out to<br />\ndefenseman Mark Greenberg. Defenseman Leroy Katz,<br />\nattackman Mike O'Neill and midfielder Tom Myrick also<br />\nhad the ball before Doober Auburn fired home the game's<br />\nOpening goal.<br />\nOn the ensuing face-off, middie Bob Maimone got the<br />\nball to Dave Huntley. Huntley returned it to Maimone<br />\nand Bob put a 15-foot bullet past the helpless goalie.<br />\nMaimone notched his second goal of the contest minutes<br />\nlater and JHU held a 3-0 lead before Hobart knew what<br />\nhad hit them.<br />\nHowever, the visitors came storming back with three<br />\ngoals of their own to knot the score midway through t!<br /><br />\nquarter. This tie was shortlived as Huntley, Hirsch and<br />\nBob DeSimone scored for Hopkins before the period had<br />\nended and the Jays held a 6-3 lead after the game's first<br />\nfifteen minutes.<br />\nThe second quarter was marked by a definite letdown<br />\nin the pace of play, as compared with that in the first<br />\nperiod. Neither team played consistently well for any<br />\nlength of time and there was little sustained offense at<br />\neither end of the field. Both squads tallied a pair of goals<br />\napiece (DeSimone and Jon Swerdloff for JHU) giving<br />\nHopkins an 8-5 halftime bulge.<br />\nAs contrasted with their performance in the second<br />\nperiod, the Blue Jays' effort in the third quarter was<br />\nexcellent. The offense regained some of the life and style<br />\nit had exhibited in the opening quarter, while the defense,<br />\nsave for one mental lapse, totally shut down the Hobart<br />\nscoring machinery.<br />\nThe Jays outscored fheir visitors 4-1 in this third<br />\nfifteen minutes of action to take a commanding 12-6 lead<br />\ninto the fourth quarter. Swerdloff, a freshman from<br />\nBaltimore, paced the attack with a pair of goals.<br />\nThe game was no longer in doubt during the final<br />\nperiod, a situation that gave both coaches a chance to rest<br />\ntheir starters. Play became sloppy once again, although<br />\nthe scoring did not cease. The Jays added four goals to<br />\ntheir total, with Swerdloff having a goal and an assist to<br />\nbring his point total to five for his'afternoon's work.<br />\nCiccarone was not particularly happy with the team's<br />\noverall play, but did see aspects of the game that he hopes<br />\nto see continue.<br />\n\"I was pleased with the way we capitalized on some of<br />\ntheir defensive mistakes,\" the Coach noted. \"In addition,<br />\nour defense did a good job—we gave them a few goals and<br />\nthen we shut the door.\"<br />\nConcerning Saturday's opponent, Yale, the third year<br /><br />\nmentor said, \"I don't know anything about them and that<br />\ncould be dangerous. But, if we play the way we're capable<br />\nof playing, we should beat them.\"<br />\n• The Bulldogs from New Haven are 1-1 on the season so<br />\nfar having beaten North Carolina State and lost to Duie.<br />\nGametime on Homewood field is 2:00.<br /><br />\nIn the springtime one's fancy<br />\nTurns to love and baseball<br /><br />\nLegged<br /><br />\nweapons of<br /><br />\nWhile springtime may shift many Hopkins' minds Baltimore, and<br />\noutfielder George Coutros of nearby<br />\ntoward the spring fair, lacrosse, or, in general, the winding Cockeysville.<br />\ndown of the school year, for some, the warmer weather<br />\nThe set of returning vets include co-captains Bob Babb<br />\nsignifies the retuyn of baseball to the Homewood of Bloomsburg,<br />\nPennsylvania and David Emala of<br />\ncommunity.<br />\nRandallstown, Maryland, plus the team's number one<br />\nAnd because the Blue Jay nine are coming off their hurler of a year<br />\nago, Charlie Lachenbruch of Los Altos<br />\nbest season ever and are entering the season with a core of Hills, California. Other<br />\npitchers returning are sophomore<br />\nreturning veterans as well as a set of promising freshmen, Steffan Burns and<br />\nJunior Jason Sussman.<br />\nCoach Dennis Cox believes that baseball has \"come of<br />\nAt this point, the Jays are winding down their<br />\nage\" here at the University.<br />\nexhibition season in preparation for their season opener<br />\nThe Jays are coming off a super season in which they to be held on Thursday,<br />\nMarch 24 at the Homewood ball<br />\ncompiled a league record of 13-3 in the Middle Atlantic field when they meet<br />\nMt. St. Mary's in a double-header.<br />\nConference. This mark earned the team a berth in the In a scrimmage held<br />\nTuesday at home, the Jay nine were<br />\nNCAA Division II play-offs, in which they advanced to defeated by Essex<br />\nCommunity College by the score of<br />\nthe second round before being eliminated.<br />\n5-3.<br />\n1976' graduation cost the Blue Jays five key players in<br />\nStarting pitcher April got off to a shaky start, when in<br />\nace pitcher Billy Jones (5-1),• second baseman Lou the first inning he gave<br />\nup two runs. The first tally was<br />\nPodiazek, shortstop Tom Pedioni, catcher Jim Duffy, and driven in by a long<br />\ntriple to right field by an Essex player.<br />\ncenter fielder Larry Santoro, but the ball club has some This player came down<br />\nthe line to cross the plate when<br />\nkey freshmen prospects.<br />\nApril uncorked a wild pitch that slipped by catcher Mark<br />\nFirst-year man Frank Parreira should become a Buchta.<br />\nHopkins' mainstay in the pitching rotation. Last year, in<br />\nThe Jays fought back successfully taking the lead in the<br />\nleading Arundel High School to victory in the state bottom of the fifth inning. Earlier<br />\nin the third, the home<br />\ntournament, Parreira was named by the News-American as team had tied the score when<br />\nsenior Babb walked, was<br />\nPlayer-of-the-Year.<br />\nsent to third when freshman John Santo reached on an<br />\nOther frosh hopefuls include pitcher-outfielder Mike error, and was batted<br />\nin by junior Emala when he also<br />\nApril of Potomac Maryland; catcher Rick Law of reached on a ground ball<br />\nerror. Outfielder Dave Lewing<br />\ntied the score by sending a line single to left. In the fifth,<br />\nBabb again scored when he singled to center, stole second<br />\nbase, and was driven in by a single from frosh Brad<br />\nRosborough.<br />\nThe Jays were unable to muster any other offense in<br />\nthe game, while giving up three runs to Essex. The visitors<br />\npicked up two more in the seventh on a triple, and error<br />\nby pitcher Lachenbruch, and a sacrifice. The insurance<br />\nrun came in the top of the ninth, driven in by a double up<br />\nthe alley in right center.<br />\nExhibition games vyill continue through next week.<br />\nTomorrow the team will have a double-header away<br />\nfacing Dundalk College. The 23 game schedule is a bit<br />\nrigorous this year and Coach Cox has expressed some<br />\nconcern about the ability of his pitching staff to handle<br />\nthe extra load, especially the eight scheduled<br />\ndouble-headers. But the entire team is optimistic about<br />\ngut and wood battlefield.<br />\nthe coming, hoping to improve on last year's season.<br /><br />\naapod pinup<br /><br />\nINdEpENdENCE POiNTe DELAWARE<br /><br />\nA bright little spot to while away<br />\nthe Spring Vacation. Can only be reached<br />\nby boat -- a number of local firms ranging<br />\nfrom wooden six-seaters to high-speed<br />\ncruisers will spirit you across the waters.<br />\nOnce in Independence Point, you'll find a<br />\ngas station, some bar stools, and a score of<br />\nunderage chickens. Those are the most<br />\nrecent lodor highlights. The rest is pure<br />\nIndependence. You can't get it anywhere<br />\nelse.<br /><br />\n--rift<br />\n—ZARaft<br />\nt..<br /><br />\nHopnaidi, NEw McKim<br />\nHopewell is not a town for the meek. In<br />\n1968, at' the height of the protest years, the<br />\nsmall settlement evicted all men over the age<br />\nof twelve and passed ordinances to clip out all<br />\nmasculine pronouns from incoming mail.<br />\nHopewell approaches its tenth anniversary in<br />\nfine fashion, and is rumored to be on the verge<br />\nof a big land-trade with one of New York<br />\nCity's boroughs. Meanwhile, just remember<br />\nthat if you plan to visit Hopewell, bring a<br />\ndress.<br /><br />\n\"Oeit urt<br /><br />\n('a/or Bay is the<br />\n/) 1(1 e to be in<br />\nFlorida .for the<br />\nSpring. ,N0<br />\nbeach -b la nkel<br />\nl)ingo n 0 wadays,<br />\nsnappy dress like vi'<br />\nCroc on the right is<br />\na must in these<br />\nparts. Once the<br />\nclothes (and proper<br />\ngrip on beer cup)<br />\nare mastered, Gator<br />\nBay offers up all its<br />\npleasures to the .<br />\ndedicated<br />\nfun -seeker. For'<br />\nstarters, !here's the<br />\nin a ra thon Swamp<br />\nWeekend.<br /><br />\nGATOR Bay, FloRidA<br /><br />"}], "field_media_file": [{"target_id": 41206, "display": null, "description": null, "target_type": "file", "target_uuid": "559c257e-1dc6-4a51-8536-cf2f9f4771ee", "url": "http://digital.library.jhu.edu/system/files/2022-03/14350-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14350, "target_type": "node", "target_uuid": "acf03bb0-fc8c-4952-baf5-d1e6b73ba07b", "url": "/node/14350"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0caf9143-a7dd-4b01-b7d0-90f15b26a2e2"}]}