{"mid": [{"value": 38203}], "uuid": [{"value": "a81e7951-0bf9-452d-80d9-c319024e97c9"}], "vid": [{"value": 38203}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:50:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12772-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:50:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:50:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "STICKMEN BEGIN<br />\nSEASON SATURDAY<br />\n—page 4<br />\n<br />\n3Joint,9 /firttikittg _Nrius-dirttrr<br />\n<br />\nLECTURER PREDICTS<br />\nPEACE TILL '61<br />\n—page 3<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 1, 1937<br />\n<br />\nVOL. XLI, No. 32<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nFIVE FACULTY MEN FACE DISMISSAL IN JUNE<br />\nAsks Jay<br />\nCarolina Solon Patriot<br />\nSwimmers Use<br />\nSeeks Lynching American Strokes<br />\nLicensing Act<br />\nAsks For Preservation Of<br />\nAmerican Way Of<br />\nLynching<br />\n<br />\nMitchell Present<br />\nProposes Bill As Compromise To Wagner- Costigan Act<br />\n<br />\nInjured In Dive,<br />\nEditor Warns Of<br />\nJapanese Attack<br />\n<br />\nirreleven,t? .<br />\n<br />\nMud Creek, N.Y., March 31—Bernard McHadden, the publisher, was<br />\nslightly injured early today when he<br />\ndived into water as shallow as his<br />\neditorials in the Young Men's Christian Association's pool here.<br />\n<br />\nMrs. Betsy Ross Rolloway, holder<br />\nof the Pulitzer prize for patriotism,<br />\nyesterday asked that the Hopkins<br />\nswimming team strike the Australian crawl dash from the list of<br />\nevents at future meets, because \"the<br />\nvery name 'Australian' proves that it<br />\nis un-American.\"<br />\n<br />\nAttendants helped him to a nearby<br />\nhospital, where he was treated for<br />\nscalp wounds and lacerations on his<br />\nforehead, nose and chin. Before leaving, he presented the nurse and interne who worked on him with back<br />\ncopies of his La Liberte and the admonition to be wary of a Japanese<br />\ninvasion on the West coast of the<br />\nUnited States. He said:<br />\n\"You are young and do not, as yet,<br />\nfully comprehend the complexities<br />\nand sophistries of international politics. I'll give you two reasons why I<br />\nexpect this invasion and expect it<br />\nany day now: first, Japan must have<br />\nan outlet to the sea; second, the<br />\nstrike of the Geisha girls is by no<br />\nmeans over and the tired business<br />\nman can't wait indefinitely. Hollywood is full of beautiful girls. Get<br />\nthe connection? Sure! Well, think<br />\nit over.\"<br />\n<br />\nIn a letter to Waldo Hambleton,<br />\nBlue Jay mentor, Mrs. Rolloway<br />\nasserted that it was \"disgraceful for<br />\nAmerican schools and universities to<br />\nteach our youth to be dependent on<br />\nthings of foreign origin, when our<br />\nforefathers have developed such an<br />\namazing variety of typically American strokes and dives.\"<br />\n\"I have devoted my entire life,\"<br />\nshe added, \"to the fight against the<br />\npercolation into our life of things<br />\nforeign. Italian spaghetti, Turkish<br />\ntobacco, French pastry, the Swiss<br />\nmovement in watches, the Spanish<br />\ntango, the Viennese waltz, the Dutch<br />\ntreat, Russian vodka--all these have<br />\nfelt my wrath; especially, Russian<br />\nvodka.\"<br />\n<br />\nCouncil Rejects<br />\nAlternate Plan<br />\nOf 5% Pay Cut<br />\nAgrees To Economist's Plea<br />\nThat \"Full Professors<br />\nMust Live, Too\"<br />\n<br />\nNames Untold<br />\nGraduate Students To Be<br />\nOffered Posts As<br />\nSubstitutes<br />\n<br />\nJessups, Md., March 31—The Academic Council of the Jessups University today unanimously voted the<br />\ndismissal of five faculty members<br />\nSouth Carolina Democrat, and leader<br />\nholding the rank of instructors. The<br />\nof the Southern bloc fighting the<br />\ndismissals, effective June 1, were<br />\npending Wagner 7 Costigan antinecessitated by the inadequate billiard facilities in the new faculty<br />\nlynching bill, yesterday offered to<br />\nclub house, it was explained.<br />\nsupport a compromise measure to<br />\nThe names of those dismissed were<br />\nprovide a Federal licensing act for<br />\nnot disclosed. An alternate plan of<br />\nlynchings.<br />\na blanket five per cent salary cut,<br />\nbrought<br />\nproposal<br />\nCadwalader's<br />\nwhich would have precluded the dismissals, was rejected by acclamation,<br />\nlively House debate, in which an unwhen Dr. Adam Smith, full proknown spectator, later identified as<br />\nfessor of economics, reminded the<br />\nof<br />\nthe<br />\nMitchell,<br />\nProfessor Broadus<br />\nCouncil, consisting exclusively of full<br />\nJohns Hopkins University, provided<br />\nprofessors, that \"full professors have<br />\nthe most exciting moment.<br />\nto live, too.\"<br />\nKhent<br />\nSays<br />\nPresident DisThe meeting was called by Dr.<br />\nCadwalader was on the floor decriminates<br />\nAgainst<br />\nMaine<br />\nJerome Higgins, president of the<br />\nfending his proposal, when the HopAnnapolis Bartenders Urged university, who did not attend. Dr.<br />\nkins economist interrupted from the<br />\nAnd Vermont<br />\nHiggins, in a messege last week,<br />\nAction To Bolster<br />\ngallery with a bitter harangue against<br />\ncharged<br />\nthe Council to seek a remedy<br />\nthe<br />\nupon<br />\nattack<br />\n\"an<br />\ncalled<br />\nIn<br />\nwhat he<br />\nan address before the Johns<br />\nOff-Year Reverses<br />\nfor the \"unfortunate billiard situa•<br />\nlast of our great Southern tradi- Hopkins Chapter of the American<br />\ntion, upon which depends our rating<br />\ntions.\"<br />\nStudent Union, in Levering Hall, at<br />\nAnnapolis, Md. March 31.—The<br />\n—Courtesy Net's Pod<br />\namong<br />\nthe great universities of the<br />\nMISS JUNE LANG<br />\nThe Cadwalader bill, placed in the noon yesterday, Frank R. Khent, pollong battle between the thirst of St.<br />\nworld.\"<br />\nHouse hopper yesterday, will, ac- itical commentator for the Baltimore<br />\nJohn's students and the legislature of<br />\nDean Hector Merryweather, of the<br />\ncording to its sponsor, be \"the great- Sun, charged that \"New Deal presMaryland is over at last. A comproSchool of Liberal Arts, who presided,<br />\nest advance in Southern culture since sure\" was responsible for failure of<br />\nmise was reached today through efsaid: \"We have a faculty of close<br />\nthe passage of the Eighteenth amend- the football teams of the Universities<br />\nforts of Senator J. Frank Woollen.<br />\nto live hundred. The new club house<br />\nof Maine and Vermont to receive inment.\"<br />\nHenceforth on alternate years, stuhas but one pool table. The disparity<br />\nRepresentative,<br />\n\"Why,\" said the<br />\nvitations to play in the year's Rose<br />\ndents will be permitted the full facilLate returns from the registrar's<br />\nThe Hopkins chapter of the Young<br />\n\"it will raise the standard of culture Bowl game in Palo Alto, California.<br />\nities of cafes and restaurants in An- is so great that the problem becomes<br />\nobvious. If the faculty were to parthroughout the entire South. Fur- Khent's address—entitled \"What Can office yesterday disclosed that one Communist League will meet to- napolis.<br />\nticipate in an elimination tournament<br />\nthermore it will provide a tremen- We Do To Protect National Minori- student—Otto von Schwegeldorf, an morrow night at 8.00 P. M. in the<br />\nThe action came in response to a<br />\nIn straight pool, and, let us assume,<br />\ndous source of revenue for our great ties?\" dealt with the question of gov- exchange student from the Univer- telephone booth<br />\non the first floor of petition from the Annapolis Barkeep- we were to<br />\nshoot one hundred points,<br />\nernment persecution of \"harmless\" sity of Leipsig—survived the first<br />\nPresident's humanitrrian program.<br />\ner's Association complaining that<br />\nGilman.<br />\nso much time would be required that<br />\n\"There is another aspect to the Republican agitators.<br />\nwhen the legislature was not in sessemester examination in Dr. Robert<br />\nwe wouldn't have a single day to<br />\nproposal which appeals to me greatGeoffrey Polopony, president of the sion, their business dwindled to the<br />\n\"Persons close to the New Deal B. Roolston's German reading course.<br />\ndevote to black ball. And, you all<br />\nly. If we can set up a decent stand- have informed me,\" said Khent in<br />\nEarlier reports from an unofficial group, said the purpose of the meet- • point of disappearing.<br />\nknow, that it is not our policy to<br />\nard of lynching, we will be able to part, \"that the gigantic Roosevelt<br />\nsource had fourteen dead, six in- ing was \"to discuss the decline in<br />\nThe petition demanded action on discriminate. No, not even<br />\nagainst<br />\ndispense forever with state courts.<br />\nwill spare nothing in its attempt to jured and five untouched.<br />\nprotestable matter proposed at re- the part of their star customers, to black ball.<br />\n\"Thus we can apply the money stamp out this inoffensive minority. I,<br />\nprovide for them during the lean<br />\nWilliam Tenner, '38, who thought cent gatherings.\" He said:<br />\n\"I came here willing to vote my<br />\nspent on judges, who are now useless, myself, have been followed for weeks<br />\nyears.<br />\nhe<br />\npassed,<br />\nsaid:<br />\n\"I'll<br />\ndrop<br />\nthe<br />\ncourse<br />\nown salary cut,\" Dean Merryto buying Easter overalls for the by a group of taxidermists offering<br />\n\"If we are to continue our fight<br />\nAs an advantage to St. John's stu- weather continued. \"But, when it<br />\nsharecroppers. Remember, the pas- to stuff me for the Smithsonian Insti- and pick it up again in 1942 when<br />\nDr.<br />\nsabbatical<br />\nagainst<br />\nRoolston<br />\ngoes<br />\nthe pillars of bourgoeis con- dents, the new bill, now being acted comes to matters pertaining to econaway<br />\non<br />\nsage of this bill means more fat-back tute.\"<br />\nleave.\"<br />\nventionalism we must protest more on by the house, will save them the omics, I always take the word of an<br />\nand turnips all over the South.\"<br />\nAt the close of his address those<br />\nDr. Roolston said: \"Well, anyway, frequently. I am going to suggest taxi-fare to points outside the three- economist. Frankly, Dr. Smith has<br />\nAt this point, Dr. Mitchell broke present at the meeting drew up a<br />\nmade me change my mind. No one<br />\nIn with the cry: \"I have come to save resolution protesting the government you can't say that I'm not consistent. that we hold a campus-wide contest, mile limit, one year out of two.<br />\nAsked to give reasons for limit- will deny that 'full professors have<br />\nthe American way of lynching.\" Ex- program against the Republican I don't know why so many can't get<br />\nwith prizes for those who bring in ing the college men during<br />\nlegisla- to live, too'.\"<br />\ncept for scattered bits like \"worse party. Plans were laid for a \"pilgrim- through my course. All you have to<br />\nthe<br />\nbest, most protestable matter. tive sessions, Senator Woollen bluffly<br />\nDr. Olynthus Dig, professor of<br />\nthan Alexander Hamilton,\" \"the cul- age\" to Washington to picket the have is an elementary knowledge of<br />\nremarked that it was a moot ques- Greek archwology, moved that the<br />\nlud boys,\" \"great Southern tradi- headquarters of the Democratic Na- German philology and a stout heart.\" Hitler is a fascist.\"<br />\ntion as to whether the facilities of word \"too\" be dug out of the records,<br />\ntions,\" \"picturesque sharecroppers,\" tional Committee as a protest against<br />\nAnnapolis would be adequate to any \"as it might give rise to some imthe rest of his words could not be this attack upon fundamental demofurther<br />\ndrain during the active peri- pertinent questions.\" The motion was<br />\nthe<br />\nuproar.<br />\ndistinguished in<br />\ncratic institutions.\"<br />\nods. \"We can only try to protect accepted.<br />\nHouse attendants finally managed<br />\nour — uh — interests,\" he said.<br />\nThe dean took the floor again.<br />\nto eject the speaker. After a few<br />\nThe Senator looks forward to great \"The dismissals will leave the dehours questioning he ,was released<br />\nAt the Fireside meeting last Tues- other purposes, by other people in<br />\nimprovements in the state capital. partments of philosophy, Greek and<br />\nfrom the Northwestern police staday afternoon Dr. Albert Blumberg control of the nation.<br />\nNo longer will bartenders just out- psychology very weak, but let's not<br />\ntion. He is believed to have returned<br />\nMembers of the First Ward Dem- led a discussion on \"The Place of ReThis strike against war is a means side the boundary be enabled to lord look at it too pessimistically. You<br />\nto his home in the Green Spring<br />\nocratic Non-Partisan Lodge heard ligion in Modern Society.\" The dis- of demonstrating to the world just It over their less fortunate city cou- remember the song, of course, about<br />\nValley of Maryland.<br />\nMayor Howard W. Jackson, Herbert cussion was said to be Very lively and how the most potential cannon fod- sins. All is to be free and equal— there being a silver lining for every<br />\nR. O'Connor, Lansdale G. Sasscer, the group did not adjourn until 6.30 der feels about ending its life in every other year.<br />\ncloud. For instance, there are a lot<br />\nWilliam S. Gordy, and J. Allen Coad, P. M. Last year the team won six some unmarked grave, about living<br />\nof clever young graduate students<br />\nrenounce and reject each and every out of ten against much stiffer com- physically and mentally shell shocked<br />\nwho want to teach. We'll place them<br />\nproposal, legitimate and otherwise, petition.<br />\non the staff and whatever we pay<br />\nor gassed. This matter is also part<br />\nNationally, the Anti-War strike is<br />\nto enter the gubernatorial race next<br />\nthem we'll take back for tuition.\"<br />\nand parcel of the honor system,<br />\nDr. David Rorton Mobinson yester- year. The general dissatisfaction was sponsored by the United Student<br />\n\"Dean, you're a genius,\" intoned<br />\nguarded by the Student Council. \"It<br />\nday announced that he would soon re- laid to the undue size of the salary. Peace Committee. This makes the<br />\nDr. Dig.<br />\nis astounding,\" said Dr. Sigerist, \"that<br />\n\"The Blue Jay stick team is in<br />\nlease discoveries, \"which will revolu\"I'd be tempted to wager my all fourth year that the demonstration Madrid has resisted the Rebel army<br />\n\"That's why I'm Dean,\" said the<br />\ntionize all the previous knowledge on the Irish sweeps,\" moaned the has been held at the Hopkins. Its<br />\ngood shape, and is picking up every Dean.<br />\n\"Back to order please.\"<br />\nso long, for when the Italian and<br />\nhas Mayor, \"What would the people of career began stormily when emwhich<br />\nHopkins scholarship<br />\nday,\" said Coach Melso Korrill today<br />\nGerman troops advanced against her,<br />\namassed about the primitive and Southern Maryland think ?\" queried battled R. 0. T. C. members turned<br />\nin an informal interview at the gymshe didn't even have sufficient guns<br />\nbackward peoples inhabiting the Sasscer and Coad. Gordy was most a hose on a faculty speaker. Last<br />\nnasium. \"I got word yesterday our<br />\nfor all her men.\" And that is why<br />\nwilds of Latrobe and Maryland Halls, sniffy and contemptuous of all. \"I'd year's strike was considered the most<br />\nsecond game was with Washington<br />\nwe should all support the strike.<br />\nHomewood.\" Dr. Mobinson returned be hounded to death to buy new sap- peaceful and orderly in history.<br />\nand Lee,\" said Korrill as his team<br />\nThe pond behind Levering Hall,<br />\nAlthough his team failed to win, worked out on the floor of the gym. unused since the<br />\nto civilization Tuesday after a peril- lings to plant in the Salisbury court\"The response to our financial camabandonment of<br />\nous three-hour trip through this lit- yard. You know the bough of the paign has been very gratifying, but C. Lindenmeyr copped high score by \"But they aint' kidding me,\" he Hell Week here, will be filled and<br />\nshooting 98 from the prone position, added. \"Washington and Lee have the space used for the<br />\ntle known region.<br />\ntree almost broke during the last our goal is far from being attained,\"<br />\nestablishment<br />\nThe University archmologist was lynching.\"<br />\nsaid James Bradford, Chairman of 96 kneeling and 78 standing, for a been dead a long time.<br />\nof an open air beer garden for the<br />\nreticent about releasing further<br />\nRumors to the effect that C. C. N. faculty.<br />\nthe June Week Committee. Rasin total of 272. We, supporting this<br />\nnews of his findings. \"I do not feel,\"<br />\nwas all over the court, popping in strike, wish to make the basis of Y.'s team is already in town have<br />\nDexter Feathers, ground keeper,<br />\nhe said, \"that work of this sort has<br />\nlong ones ,following up on rebounds. this demonstration as broad as pos- been circulating about the campus. said: \"Work on it will start whenany place outside the scientific jourHe seemed to have an inexhaustible sible and to enlist the backing of C. C. N. Y. will be remembered as ever we feel like it. If the faculty<br />\nThe Hopkins Playshop will observe amount of energy in his rompings every group affiliated with the Hop- the team that startled 4-5-6 fans last members are going to drink, let<br />\nnal.\"<br />\n\"But, there are some things about the fourteen hundred and eighty- about the floor, a fact that worried kins. This will be a strike that is year. They upset the entire game them drink out in the open.\" Then,<br />\nthis strange race whch should be of sixth day of the new freedom in Ger- his wearied man no little. He ex- general ,and we hope effective, mani- by getting lifts with Camels. Reports philosophically: \"There's very little<br />\nInterest to everyone. Of course, most many with a performance tonight at pressed the opinion that Mr. Roosevelt festation of student sentiment against were confirmed that Saturday last, you can copy from those Germans<br />\nof us do not ever think to investigate nine o'clock of \"Civilization Along has no desire to attain such a goal, war.<br />\nthe coach of the C. C. N. Y. team these days, but even the most biased<br />\nthis--the most fascinating of all the the Rhineland,\" an historical drama, but that the precedents which he sets<br />\nMaybe we did not make such a bad left New York incognito. The rest have to hand it to their beer<br />\nof course.<br />\nprimitive civilizations.\"<br />\nof the team left in strpet cars.<br />\nmay be taken over in the future for move after all.<br />\ngardens.\"<br />\nWASHINGTON, D. C., March 31.<br />\n—Rep. Robert E. Lee Cadwalader,<br />\n<br />\n\"Persecution\" By<br />\nNew Deal Attacked<br />\n<br />\nCompromise Gives<br />\nJohnnies UseofBars<br />\n<br />\nOne Passes, Others Irked By Decline 01<br />\nFail German Exam Protestable Items<br />\n<br />\nAnti-War Strike Is Not Rasin's Goal,<br />\nDespite Bradford's Plea For June Cash<br />\n<br />\nPolitomania<br />\n<br />\nPromises New Dope<br />\nOn Primitive People<br />\n<br />\nStick Tutor Tells<br />\n'10'He's No Dummy<br />\n<br />\nTo Fill In Pond<br />\n<br />\nToGiveGermanPlay<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 1, 1937<br />\n<br />\n2<br />\n<br />\nabe jobitc jOopitins<br />\nLetter<br />\n<br />\nPay Before The Deadline<br />\nThe request of the June Week Committee for payment<br />\nof the June Week levy of $10 before noon this Saturday<br />\nsems to us perfectly justified. The reasons must be<br />\napparent to every one.<br />\n<br />\nIn order for the Committee to plan its program carefully and ensure smooth functioning and adequate entertainment, it must have an accurate estimate of the funds<br />\n$2.00<br />\n_<br />\nSubscription per year<br />\navailable. This can only be accomplished by prompt<br />\n$2.50<br />\nBy Mail<br />\npayment of the levy before any actual planning is done.<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nThe Seniors now have it in their power to ensure a<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nJune Week which will be satisfactory and enjoyable<br />\nto all.<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nWe urge all men who have not paid their fees to do so<br />\nin Ilaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nbefore 12 o'clock noon this Saturday in Levering Hall.<br />\nBy doing this they will serve not only the interests of<br />\nPublished semi-weekly from October to June, except during exam- the class, but of themselves.<br />\n<br />\nI RCLIN1<br />\n<br />\nThe<br />\nInquiring<br />\nReporter<br />\n<br />\nTHE<br />\n<br />\nAM PUS<br />\nwith BOBBY HILDRETII<br />\nThis column is really good today:<br />\nDr. Kouwenhoven's Easter basket<br />\ncontained a 1937 Buick. More power<br />\nto you.<br />\na a<br />\nDr. Fagin and Donald Kirkley visited New York during the holidays<br />\nto criticize the Broadway plays.<br />\n<br />\nIn tercollegiates<br />\n(By Associated Collegiate Press)<br />\n<br />\nThe gentleness he exercises in<br />\nawakening fellow students for eight<br />\no'clock classes is just one kind of<br />\nadvertising that recommends BerHave you a question of general in- nard Gilman, \"The Slumber-Snapper\"<br />\nterest on which you would like to of the University of Richmond to<br />\nget a consensus of opinion? Drop it new clients.<br />\nin a note to Box 396.<br />\nEye-catching bills which he posts<br />\nThe Question: Are you in favor of on all bulletin boards explain that<br />\na course in sex instruction at the he eases the soundest snorers to conHopkins?<br />\nsciousness with a firm but unobjectThe Place: In and about the NEWS- ionable touch—for only 20 cents a<br />\nweek.<br />\nLETTER Office and Dormitory.<br />\n<br />\nHere's one for Mr. Sachs. Why is<br />\na person driving a fast car over a<br />\n\"Do you know,\" his circular asks,<br />\nbump road like the Supreme Court? William B. Kempton, junior: Yeah,<br />\n\"that failure to eat breakfast kills<br />\ninI<br />\nswell.<br />\ngood<br />\na<br />\nit's<br />\nIt's<br />\nthink<br />\n. . . Give up? When he reaches 70<br />\nducement for keeping the boys more men every year than cancer,<br />\nThe Student Council is to be congratulated for the he must have a good constitution to<br />\nEDITORIAL STAFF<br />\ntuberculosis or halistosis? That failEditor-in-Chief questionnaire which it sponsored. If the Student Body<br />\nfrom the Gayety.<br />\naway<br />\nStanley Finkel.<br />\nkeep his seat.<br />\nManaging Editors<br />\nure to attend early classes has blightJames Morrow, David Caplan<br />\nSports Editor lends its cooperation to the balloting, results should be<br />\nArthur Rosett, freshman: I think a ed more college careers than any<br />\nBernard 1). Pinck<br />\nEditors<br />\na valuable basis for further activition of the Student<br />\nBenjamin Root, Wethered Barroll, Jr.—.......Assistant Mangaing<br />\ncourse in sex instruction is a very other cause?\"<br />\nJune Week Flash—Glen Gray and<br />\nAssistant Sports Editor Council.<br />\nHarold Zheutlin<br />\ngood thing. It teaches young peohis Case Loma orchestra in York,<br />\nColumnist<br />\nPaul Berge<br />\nple things which might ordinarily<br />\nWe wonder why such a procedure was not followed Thursday, April 15th.<br />\nIncidently,<br />\nReporters—Max Iskowitz, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nChin golf, a game designed to aid<br />\nbe learned 'through harmful exHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger, before the class dues were made compulsory by an there has been a change in this outshavers in going down the facial<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal, undemocratic process.<br />\nsources.<br />\nor<br />\nperience<br />\nunreliable<br />\nfit. Those two hot trumpet tooters,<br />\nfairways in the least possible strokes<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William BurWe hope the students will fill out the questionnaire Grady Watts and Bobby Jones, havg, Bud Gusack, senior: Yes, because a has yelled \"fore\" on nine university<br />\nford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nAlperstein,<br />\nMilton<br />\nMillberg,<br />\nIrving<br />\nSarnovitz, Seymore Sacks,<br />\ndeparted and Glen Gray now stands<br />\nseriously.<br />\nnatural curiosity about sex exists and college campuses in the East.<br />\nZenas Baum.<br />\nup and directs.<br />\nin minds of all boys and girls of<br />\nAnd collegians, one from each of<br />\nBUSINESS STAFF<br />\n*<br />\nmy age. Better to have enlightenBusiness Manager<br />\n_<br />\nWilliam B. Kempton<br />\nthe institutions in the Ivy League:<br />\nThe noon card parties in Levering<br />\nAssistant Business Manager<br />\nment by authority than by other<br />\nMelville Locker<br />\n(Brown, Yale, Princeton, Williams,<br />\nThe day after tomorrow Kelso Morrill will release his Hall have resumed now that Lent is<br />\nAdvertising Manager<br />\nWm. C. Erlanger<br />\nmeans.<br />\nDartmouth, Amherst, Columbia and<br />\nManager<br />\nCirculation<br />\nfor<br />\nteam<br />\nlacrosse<br />\nthe<br />\nHopkins<br />\nof<br />\nJonhs<br />\nedition<br />\nthird<br />\nGerald Willen<br />\nover. The boys you saw playing<br />\nOffice Manager public approval. It was in 1935 that Kels succeeded Ray<br />\nWilliam Sattler, sophomore: I haven't Wesleyan) will compete in bringing<br />\nHoward Linkoff<br />\nduring that self-denial period only<br />\nCopy and Filing Manager<br />\nNathaniel Soifer<br />\nbeen to one lecture yet and there- their faces out of the \"rough\" with<br />\nvan Orman as professor of lacrosse science and tactics gave up studying.<br />\nfore feel that I can't commit my- a minimum of strokes and no slices.<br />\nhere.<br />\nREPRESSNTIICI FOR NATIONAL ADVIERTISING SY<br />\nself.<br />\nAnd it looks like this is the year he's been waiting for.<br />\nBlanche Benton was the name of<br />\nNational Advertising Service, Inc.<br />\nLacrosse is a tradition at the Hopkins, and traditions that beautiful piece of architecture Arthur Katz, junior: Yes. An alarmCollege Publishers Representatlas<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\ning number of young men of colpack a punch when they're backed up by a squad of from Chicago that visited our camcan<br />\nFRANCISCO<br />\nSAN<br />\nBOSTON<br />\nCHICAGO<br />\nlege age are in the dark, as it were,<br />\nszarfLit<br />\n•<br />\nr',RTLANC<br />\nLos AN , FLES<br />\nexperienced and speedy stickmen. They say that Mary- puss during spring vacation. For<br />\nconcerning these matters. This is<br />\nland babies are born with lacrosse sticks in their hands further information see Miss Beulah<br />\nMember<br />\nl937<br />\nunfortunate. A well-arranged course<br />\nand that most of them grow up and go to the Hopkins.<br />\nBenton of the education department.<br />\nin sex education will reduce this<br />\nYes,<br />\nit<br />\nher<br />\nwas<br />\nsister.<br />\nthat<br />\nto<br />\nthe conclusion<br />\nSober examination reads us<br />\ndifficulty, somewhat.<br />\nDIA ributors<br />\nthat story is pure legend, but the idea is tenable, for, if<br />\nD.<br />\nFrancis Gilbert, senior: I think<br />\nthis state is the king of the lacrosse world, Hopkins is<br />\nJanet Schuchardt driving around<br />\nthis course in sex education at the<br />\nthe emperor.<br />\nin her dad's new Packard 120.<br />\nall Smoking Tobacco<br />\nHopkins should be made a permanBack around the turn of the century Hopkins men Beauty on wheels; I mean the car.<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nent<br />\nof<br />\npart<br />\nthe<br />\nschool<br />\ncurriculum.<br />\n*<br />\nbites the Tongue<br />\nintroduced lacrosse to the Free State. And Hopkins<br />\nOf Middle Atlantic States<br />\nIt is one of the most progressive<br />\nhas called the music since then.<br />\nGracie Gillen survived with her<br />\nsteps made by our progressive inOver the period of years the Blue teams have even injured back, the result of a frat<br />\nTHURSDAY, APRIL 1, 1937<br />\nstitution. Let us hope it is here<br />\nwon more national titles than all other teams combined. house flop. James Palmer Lyle is<br />\nto stay. Elucidation through the<br />\nthe<br />\ncause<br />\nof<br />\nLittle<br />\nAudrey's<br />\nrapid<br />\nHopkins players have spread out over the country,<br />\nwill lift the shroud from<br />\nlectures<br />\nteaching the game as they went -- initiating high recovery.<br />\nmany facts heretofore regarded<br />\nTwo petitions of the St. John's student body asking schools and colleges in the lore of that old Indian contest<br />\nas mysterious.<br />\nNote to Hutch: How does it feel to<br />\nfor the repeal of the state law preventing them from ---\"the fastest game on two feet.\"<br />\npay the cab fare when the boy Douglas Price, freshman: Although<br />\nlegally buying beer or intoxicating liquors in the City<br />\nIn 1928, the Johns Hopkins University stickmen repfriend's race track note (two dollar<br />\nI've never attended a lecture, they<br />\nof Annapolis or within a three-mile limit thereof have resented the United States in the Olympic Games at<br />\nbill to you) couldn't be changed?<br />\nare undoubtedly wonderful as they<br />\nAmsterdam. In 1932, they represented the nation in the<br />\nbeen rejected.<br />\nSmart action, Henderson, I think I<br />\ntell one all things one should know<br />\nwere<br />\ncopies<br />\ntwo<br />\nLos<br />\nAngeles Olympic Games. The United States, in this<br />\nDrawn up by the Student Council,<br />\nwill carry some.<br />\nconcerning<br />\nsexual matters. It will<br />\nsent to the Anne Arundel County Delegation and the way, has sent more Hopkins men to the Olympiads than<br />\nact as a force tending toward hap*<br />\n*<br />\nCollege<br />\nit has sent athletes from any other single college.<br />\nother to the president and faculty of St. John's<br />\npier marriages.<br />\nVasilka Petroff spent her spring<br />\nasking that it be sent to the board of Visitors and GovBut there has been a sad note these last two years.<br />\nvacation<br />\nin<br />\nworking<br />\nour<br />\nlibrary.<br />\nShe<br />\nRobert Feishaker, freshman: I think<br />\nernors. Both were rejected, the latter never getting Not since the 1932-1933-1934 period has a Jay team won<br />\nEdgeworth Guarantees thatProcessmust have school daze.<br />\nthe course is a good thing. Most<br />\nbeyond the president's office.<br />\nthe national championship. Mt. Washington has worn<br />\nAging Prevents Tongue Bite<br />\nfellows know quite a bit after a<br />\nIn view of the democratic teachings which a college the crown since then. The fact that former Hopkins men<br />\nRumor:<br />\nThe<br />\nWomen's<br />\nClub<br />\nhave<br />\nfashion,<br />\nbut<br />\nthe<br />\ncourse will clear<br />\nMONGUE BITE is the bane of<br />\nis in a position to offer and the fact that such a law led the clubmen to these titles in small consolation.<br />\nplanned at tea for April 8 . Dr. Guttup vague points.<br />\npipe smokers. We guarantee<br />\nThe time is more pleasant now. Freshmen and sophois entirely a discriminatory one, the NEWS-LETTER canmacher will be the guest speaker.<br />\nEdgeworth will not bite the<br />\nthat<br />\nof<br />\nbody<br />\nstudent<br />\nthe<br />\nwith<br />\nsympathy<br />\nin<br />\nfeeling<br />\nmores have become juniors ad seniors. They have<br />\nnot help<br />\nThe topic, I understand, will be on 15. Certain areas of Egypt are cultongue.<br />\ngained that factor that cost them two championships<br />\nSt.. John's College.<br />\nThe use of the finest Burley tosexology. 0. U. Girls.<br />\ntivated by irritation.<br />\nThe law evidently was designed to prevent the stu- — experience.<br />\nbaccos will not prevent tongue bite.<br />\n*<br />\nThis is the year.<br />\ndents from drinking, but those students who want to<br />\n16. A water shed is a shed in the<br />\nIt's the processing that does it. As<br />\nPaul Berge exercising the cute litevery tobacco expert knows, pipe<br />\ndrink no doubt find means to do so. Thus, the law canmiddle of the sea where ships<br />\ntle secretary in Gilman Hall, after<br />\ntobacco can be rushed through the<br />\nnot serve a very practical use, but remains on the books<br />\nshelter during a storm.<br />\nher lunch. What's the matter Micplant and save big sums of money.<br />\nas a very sad piece of legislation; for if a young man is<br />\n17. Zanzibar is noted for its monis pipe tobacco, but it is not<br />\nIt<br />\nkey,<br />\nisn't<br />\nyour<br />\nproviding,<br />\nlunch<br />\nhour<br />\nfrom<br />\n1<br />\nto<br />\nso,<br />\ndo<br />\nmay<br />\nhe<br />\nbeer<br />\nthe<br />\npurchase<br />\nof age to<br />\nThe<br />\nkeys.<br />\nEdgeworth.<br />\nBritish<br />\ngovernor<br />\nlives<br />\n2<br />\np.m.?<br />\nOr<br />\nwould<br />\nyou<br />\ncollege.<br />\nrather write<br />\nhowever, he is not fortunate enough to attend<br />\nOur method is Process-Aging—<br />\nthere.<br />\nthan walk and talk?<br />\nThe whole fear of the college seems to be that the<br />\na process as vital as the aging of old<br />\n18. New York stands on the Atlantic<br />\nrepeal of the law might interfere with the financial aid<br />\nwines. There are twelve required<br />\nsideboard.<br />\nsteps, each under laboratory control.<br />\nwhich the college receives from the State Legislature.<br />\nIt takes 4 to 7 times as long as might<br />\n19. The Nile is full of crocodiles and<br />\nThis fear, however well based, seems odd, for it would be<br />\nObservers frequently comment on the attitude of uniseem necessary. But in no other way<br />\npyramids.<br />\nvery strange indeed for a state which legalizes liquor versity graduates and students toward politics and other<br />\ncan we guarantee that Edgeworth<br />\nWe dedicate this column today to 20. The Arctic circle is the Arctic<br />\nand beer and sets a legal age limit to refuse money to a issues which involve the well being of the whole nation.<br />\nwill not bite the tongue.<br />\ncollege which but stands by that law.<br />\nThey point out that the educated frequently exhibit Mr. Hamill. Material is from Dr.<br />\nregion where it is day all day<br />\nWe ask you to try it under our<br />\ntake<br />\nnot<br />\ndoes<br />\nadministration<br />\nIt seems to us that the<br />\nlong.<br />\na cynical attitude, or perhaps what may be more aptly Seuss' Book of Boners in regard to<br />\nmoney-back guarantee. If Edgecola healthy attitude in its regard for the maturity of<br />\nworth bites your tongue, return it<br />\ntermed intellectual snobbishness, toward public affairs Geography.<br />\n21. The equator is a menagerie lion<br />\nand get your money back. You<br />\nlege students. Furthermore, disrespect for law and of the day, and, still more harmful, refuse to exercise<br />\nFrom Dr. Seuss Book of Boners.<br />\nrunning around the earth and<br />\ncan't lose.<br />\nauthority in general (as during the drought era of pro- their franchise or seek political office.<br />\nToday in regard to Geography. We<br />\nthrough<br />\nAfrica.<br />\nhibition) is made conducive by this law.<br />\nhigh<br />\nthe<br />\nconducted<br />\npolitics<br />\non<br />\nnot<br />\nthat<br />\nis<br />\nAdmitted<br />\ndedicate this column to Mr. Hamill.<br />\nNOTE: There are three kinds of<br />\nNext week we will examine the<br />\nmoral and intellectual plane that should evolve from the 1. Grade school pupil who was<br />\nEdgeworth for you to choose from:<br />\nboners made in science and math.<br />\npublic service, nevertheless, the educated owe a duty<br />\nasked why the Panama Canal<br />\n1—Edgeworth Ready-Rubbed—a<br />\nto their commonwealth and fellow citizens which cannot<br />\ncool, long-burning tobacco precontents<br />\nwould aid in the defense of the<br />\nthe<br />\nof<br />\nany<br />\nregard<br />\nreaders<br />\nBefore any of our<br />\nbe dismissed with a cynical sweep of the arm. A man<br />\nferred by seasoned smokers.<br />\ncountry in time of war said: \"The<br />\non the front page with the slightest seriousness, we who is the possessor of the highest knowledge that the<br />\n2—Edgeworth Plug Slice—for the<br />\nlocks will keep out the enemy<br />\nwish they would examine the date of this issue.<br />\nsmoker who likes to crumble the<br />\ninstitutions of learning have to offer, who has been<br />\nships.\"<br />\ntobacco in his hands until it's just<br />\ntaught to think, to discern logical thinking from dis2. Climate lasts all the time, but<br />\nright for him.<br />\nordered rantings, to appreciate the needs of the majority<br />\nweather only a few days.<br />\n3—Edgeworth Jr.—the same tothe<br />\nlimited minority, should realize his<br />\nrather than<br />\nbacco also Process-Aged, but cut<br />\nWe wonder how many of those who viewed Richard<br />\n3. Latitude tells you how hot you<br />\nto God, self and his fellow man.<br />\nfor a milder, more free-burning<br />\nWagner's \"Lohengri'n\" Monday night realized that responsibility<br />\nare, and longitude how cold you<br />\nsmoke.<br />\nParadoxically, at this time, millions of government<br />\nit was not long ago that such a performance would be<br />\nare.<br />\nto<br />\nexpended<br />\nannually<br />\nprovide<br />\nbeing<br />\nhigher<br />\nare<br />\nfunds<br />\nconsidered as intensely anti-patriotic.<br />\nfor the youth of the United States, who accept 4. The climate of Bombay is such<br />\nYes, we should not criticize Hitler's barring of Men- education<br />\nthat its inhabitants have to live<br />\npresented by a benevolent governopportunities<br />\nthe<br />\ndelsohn or Rubenstein without appreciating our own<br />\nPlease accept 500 Gold Plated Collar-Pin<br />\nelsewhere.<br />\nby<br />\nto<br />\nattempt<br />\nlending<br />\nreciprocate<br />\nno<br />\nmaise<br />\nand<br />\nment,<br />\ntide<br />\nfor only 10t when you buy Edgeworth.<br />\nhigh<br />\nthe<br />\nduring<br />\nattitude toward German culture<br />\nMerely send inside white wrapper from<br />\nthe fruits gleaned from education to the best interest 5. The sun never sets on the Britof World War propaganda. We were in just the same<br />\nany tin of Edgeworth with your name and<br />\nish Empire because the British<br />\nsociety.<br />\nof<br />\nunenlightened<br />\nand 10t to Lanus & Bro. Co.,<br />\naddress<br />\nposition as the Nazis in regard to our<br />\nEmpire is in the East and the<br />\nDept. 100, Richmond. Va.<br />\nduty of the educated man does not cease in<br />\nThe<br />\nposition.<br />\nsun sets in the West.<br />\nmerely engaging in public life or exercising his franIt was in the heat of the denunciation of everything<br />\nThe sun sets in the West and hur6.<br />\nto<br />\nhimself<br />\nobligated<br />\ninformed,<br />\nkeep<br />\nchise.<br />\nis<br />\nto<br />\nHe<br />\nthe<br />\nof<br />\nminds<br />\nintellectual<br />\nthe<br />\nthat<br />\nwith a German tinge<br />\nries around to the East to be in<br />\nmake of life a continuous period of study. He must be<br />\nAf4fa<br />\ncountry were prostituted to produce such patriotic and<br />\ntime to rise the next morning.<br />\naware of the issues of the day, the political troubles<br />\nchauvinistic propaganda as Dr. W. R. Thayer's comment.<br />\nwhich afflict the nation, and only after a thorough 7. Imports are ports very far inland.<br />\n4/R.<br />\nHe wrote:<br />\n8. Nearly at the bottom of Lake —••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••—•••••••••••••I<br />\nand analysis, should he express his views.<br />\nstudy<br />\nwar,<br />\nof<br />\npassion<br />\n\"Wagner's music is . . . unrestrained<br />\nMichigan is Chicago.<br />\nTo the educated falls the task of unmasking the<br />\n-P<br />\n7141/e4;1,77aredi<br />\nlust and cunning that belongs to an uncivilized race.\"<br />\nas demagogue, the partisan, and uninformed press, 10. A mountain range is a cooking<br />\nOf course now that there is peace (peace, at least,<br />\nstove used at high altitudes.<br />\nwho make it a common practice to lead the masses<br />\nopposed to a war with a foreign country) only the vesto their way of thinking, whether right or wrong, for 11. The people of India are divided<br />\nGerthe<br />\nagainst<br />\nfrenzy<br />\nand<br />\nhatred<br />\nformer<br />\nour<br />\nof<br />\ntiges<br />\ninto casts and outcasts.<br />\ntheir own selfish purposes.<br />\nmans remain. But in place of this there are others.<br />\nThought along political and social angles might well 12. Persian cats is the chief industry<br />\nup<br />\nwhip<br />\nto<br />\nattempting<br />\nstill<br />\nare<br />\nsocieties<br />\n\"Patriotic\"<br />\nof Persia--hence the word \"purr.\"<br />\nare begin while the student is still in college. If such modes<br />\nhatred and prejudice. Of course now the objects<br />\nMediterranean and the Red<br />\nThe<br />\n13.<br />\nin<br />\nstill<br />\nis<br />\nhe<br />\ndeveloped<br />\nenshrouded<br />\nwhile<br />\nthought<br />\nof<br />\nare<br />\nessenremain<br />\ninvolved<br />\nPEN and PENCIL SETS<br />\nprinciples<br />\ndifferent, but the<br />\nSea are connected by the Sewage<br />\nan intellectual atmosphere attributed to college life,<br />\ntially the same.<br />\nCanal.<br />\nthe man, as a citizen, will find he has acquired a sense<br />\nIf we tend to laugh at ourselves for assuming such<br />\nof political mindedness, and will continue to interest 14. New York is behind Greenwich<br />\nthe<br />\nduring<br />\nculture<br />\nGerman<br />\ntowards<br />\nattitude<br />\nan absurd<br />\ntime because America was not<br />\nhimself in the well-being of his country.<br />\nGreat War, we should look about ourselves today and<br />\ndiscovered until very much later.<br />\nof Detroit, Varsity News.<br />\n—U.<br />\nsober.<br />\nmentally<br />\nare<br />\nwe<br />\nwhile<br />\ntake inventory<br />\n<br />\nination and college holiday periods by undergraduates of the Johns<br />\nHopkins U ni versity.<br />\n<br />\nCongratulations!<br />\n<br />\nKelso Begins His Third Season<br />\n<br />\nPipe Smokers!<br />\n<br />\nPlease Don't<br />\nBelieve<br />\n<br />\nAssociated Gotleesiate Press<br />\nConeeSiaie West<br />\n<br />\nSt. John's And Beer<br />\n<br />\nCONTEMPORARY<br />\nOMMENT<br />\nYour Franchise<br />\n<br />\nKnowledge IsPower<br />\n<br />\nNuff Said<br />\n<br />\nLOST<br />\n<br />\nA \"Blight\" At The Opera<br />\n<br />\n11<br />\n<br />\nLuckiesh, Color and its Ap-1<br />\nplication was taken from<br />\n<br />\nI<br />\n<br />\nthePhysics Library without<br />\nbeing signed for ,about<br />\nFebruary 19. Please return<br />\n<br />\nthis book promptly, and no<br />\nquestions asked.<br />\n<br />\nKIBLER'S<br />\n<br />\nJewelers and Opticians<br />\n<br />\n3222 Greemnount Avenue<br />\n<br />\nEDGEWORTH<br />\nEDGEWORTH<br />\n<br />\n\f3<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 1, 1937<br />\n<br />\nDormitorv Activities Committee<br />\nDance Faculty Club To<br />\nBecker Sees No \"Bulletin's\" New International<br />\nBe Sold Set For Saturday Eve BeOpenedThisEve Start Pians For Spring Dance<br />\nTo<br />\nIssue<br />\nEuropean War By Hopkins Press<br />\nLikely 'Till 1961 'Bulletin Of The Institute Of<br />\nCites Past History To Prove<br />\nPeriods Between Wars<br />\nLonger<br />\n<br />\nMedicine' Features Magic<br />\nIn Ancient Medicine<br />\n<br />\nCountries<br />\nForeign<br />\nTwenty-Eight<br />\nBernard Pinck, chief of the DorThe new faculty building will be<br />\nTo Be Represented<br />\nmitory Activities Committee, definbe<br />\nto<br />\nis<br />\nedifice<br />\nThe<br />\ntoday.<br />\ndedicated<br />\nat Party<br />\nthe permanent quarters of the Johns itely committed himself today the<br />\nfact that he and his associates are<br />\nThe only annual event, the Inter- Hopkins Club. This organization, in<br />\nconsidering plans and particulars<br />\nnational Night Dance, taking place existence several years already, offor the Spring Dance of 1937—an anin Levering Hall which features rep- fers membership to faculty and al- nual affair at Alumni Memorial Hall.<br />\nPinck was quite emphatic in<br />\nresentatives from twenty-eight coun- umni. A reception will feature the<br />\nhis stressing of the fact that the<br />\ntries, will be held Saturday, April 3. \"house warming\" this evening.<br />\nsuccess of the dance, and even it,<br />\nSponsored jointly by the CosmopoliCompleted through the aid of Mr. presentation depends entirely upon<br />\ntan Club and the Friendly Relations<br />\nTheodore Marburg and his sister, the hearty support \"of the material<br />\nGroup, there will be students from<br />\nMiss Amelia Marburg, the building nature,\" of the dormitory residents,<br />\nand of the student body in general.<br />\nforeign countries studying at Goucher<br />\nis in complete harmony with other<br />\nTentatively, the first two weeks in<br />\nand Notre Dame of Maryland in adHopkins halls and is situated in the May have been<br />\nconsidered for the<br />\ndition to those here at Hopkins.<br />\nnorth end of the Botanical Gardens. date, but there is every chance that<br />\nMusic will be furnished by the Blue<br />\nonce the machinery of the commitJays from 9 until 1, while impromptu<br />\ntee starts functioning, the boys will<br />\nbe enabled to chalk a red check on<br />\nentertainment will be furnished by<br />\ntheir calendars for some time in<br />\nguests throughout the evening. Dan<br />\nApril.<br />\nde Lima, president of the CosmopoliYesterday afternoon the Student<br />\nA committee which will be an<br />\ntan Club, says, \"We are to have a<br />\nyoung lady entertainer also. I am Council stuffed the post-office boxes<br />\n•<br />\nkeeping the nature of her avocation of undergraduates with questiona secret until the evening of the naires on policy—the Honor System<br />\ndance. However, I will guarantee and the Assembly question. The ather performance to be the best at<br />\ntitudes of students towards the Honor<br />\nany of our dances.\"<br />\nThe price of admission is 50c and System, whether they think it effect-<br />\n<br />\nJust announced by the Johns Hopkins Press is the publication of the<br />\nMarch issue of the Bulletin of the<br />\nInstitute of Medicine.<br />\nA quick glance at the table of contents of the Bulletin reveals a typical<br />\nchoice of subject matter. \"Greek<br />\nMedicine in Its Relation to Religion<br />\nand Magic\" by Ludwig Edelson;<br />\n\"Guillame Adler and His ContribuDr. Carl Becker, professor of histion to Biblical Medicine\" by Ososer<br />\ntory at Cornell University, went back Temkin, and \"Texts and Documents,\"<br />\n300 years in his James Schouler lec- a comprehensive and inclusive comture in Latrobe Hall Tuesday after- pilation of contributions to the microscopic anatomy of the pancreas by<br />\nnoon, to prove that another general<br />\nPaul Langerhaus, build up an imposwar is not likely to break out until<br />\ning and satisfactory magazine.<br />\n1961. His address was entitled \"Rights<br />\nThe first ,and featured article, is a<br />\nof War.\"<br />\ndiscussion of a topic that has prevStarting with 1618, the speaker iously been almost ignored by historians and medical men.<br />\npointed out that that peaceful lulls<br />\nThe title, \"Greek Medicine in its<br />\nbetween European wars have lasted,<br />\nRelation to Religion and Magic,\" de- includes refreshments. Three hunrespectively 24 years, 20 years, 29 notes that topic.<br />\ndred tickets have already been sold,<br />\nyears, 38 years and 43 years. The<br />\nThe neglect of men in ignoring this more are available now at Levering<br />\npresent peace has already lasted 19 phase of ancient life is justified and Hall. Every one is urged to buy his<br />\napologized for by the author, Ludwig ticket now, as there will be an addiyears.<br />\nEdelstein, who says, \"The neglect of tional charge of five cents at the<br />\n\"Generalizing roughly,\" said Dr.<br />\nreligious and magical medicine seems door.<br />\nBecker, \"we find that the periods of the more justifiable because, accordwar tend to become shorter, the peri- ing to the prevailing opinion, Greek<br />\nods of peace longer ,so that if the medical art itself dispensed with rePrinters of<br />\npresent general peace is to be longer ligion and magic.\"<br />\nPHILOLOGICAL and<br />\nThrough many examples, referthan the last one, we need not expect<br />\nences to ancient writings and quotaSCIENTIFIC PUBLICATIONS<br />\nanother general war until about 1961. tions from classic physicians like<br />\n12-20 Hopkins Place Baltimore<br />\nI do not vouch for this conclusion Hippocrates, the author shows clearly<br />\nsince the statistics are limited and the unmistakable connotations apparent in Greek medicine of Greek<br />\nnone too precise.\"<br />\nsuperstition. Mr. Edelstein is conDr. Becker further declared that<br />\nvinced, and convinces his reader, that<br />\na state's interests, \"location, and magic was really rejected as wrong<br />\npolitical system are almost the sole by the Greek physicians. However,<br />\nfactors in determining its foreign religion plays an important part in<br />\nthe theory and practice of Greek<br />\npolicy.<br />\n\"The balance sheets of wars waged medicine, which is the forerunner and<br />\nduring the last three centuries is suf- the beginning of modern science.<br />\nGuillame Ader, an almost forgotficiently accurate to demonstrate<br />\nthat the ends which states pursue ten seventeenth century French phyare too limited and archaic to be of sician-poet, is the subject of an exTempkin.<br />\npermanent value . . . that it defeats haustive study by Ososer<br />\nmore often than not, the purpose Moral advice to the farmers and middle-classes of Gascony in 100 quatfor which it was waged.<br />\nrains constitute the basis for the<br />\n\"In the fundamental sense . . . war<br />\nstudy. Ader is pictured as a sage,<br />\nis validated by the assumption that<br />\nclever man who used his knowledge<br />\nnations can profit by depriving each<br />\nof the respect of superstition by the<br />\nLooked<br />\npossessions.<br />\nother of valued<br />\nneighboring Gascon farmers to cure<br />\nat in this light, war is only another<br />\nthem of their ills, real or imaginary.<br />\naspect of the wider problem of social<br />\nHis common-sense served in highest<br />\njustice.<br />\ncapacity as a means to prescribe<br />\n\"Since the two are related, there treatment. Where he saw that the<br />\nis no reason why the solution of one patient could not understand or apshould forever wait on the solution preciate treatment, and suspected<br />\nof the other. In either case a good that he would not submit himself to<br />\nway is to begin by changing the rules it unless magical hocus-pocus was<br />\nof the game.\"<br />\nconnected with it, he hypocritically<br />\nuses the horoscope in psychotherapeutic cases. The man loved poetry<br />\nequally as well as medicine and strove<br />\nat all times to combine those two<br />\ninterests by expressing his medical<br />\nModern Play Concerns Itself With beliefs and of making known his findings in rhyme.<br />\nCollege Grad in Depression<br />\nFamous in the annals of medical<br />\nThe new W. P. A. play, \"The Class history is the name of Paul Langerof '29,\" will be presented by the haus. In the section of the Bulletin<br />\nJohns Hopkins Playshop for five per- reserved for \"Texts and Documents\"<br />\nformances, starting April 20. It is a reprint of a translation of \"Conpossible that there will also be a tributions to the Microscopic Anatmatinee. \"The Class of '29\" is a omy of the Pancreas\" written in Gerplay of the Federal Theatre project, man by the specialist in 1869 is<br />\nand is widely recognized as one of printed. It is edited, arranged and<br />\nthe best of the entire output of this prefaced by an introductory essay<br />\norganization. The occasion will mark by H. Morrison, M. 0., giving the<br />\npainthe first opportunity for Baltimore complete story of Langerhaus's<br />\npancrethe<br />\nof<br />\ninvestigation<br />\nstaking<br />\nTheatre<br />\nplay, and<br />\nto see a Federal<br />\non<br />\none which should be of interest be- atic ductless glands, with notes<br />\nlife.<br />\nhis<br />\ncause of its timeliness and subject<br />\nThe paper by Langerhaus was<br />\nmatter.<br />\nfor his doctor's degree in<br />\nwritten<br />\nThis play, already in rehearsal,<br />\nand Surgery. It is reproMedicine<br />\nunder the direction of Mrs. Myra<br />\nduced with a facsimile of the origLehr, is the story of the graduating<br />\ninal cover, in both German and the<br />\nclass of an American University<br />\ntranslation in the Bulletin.<br />\nwhich entered the current scene at<br />\nthe outbreak of the depression. The<br />\ntragedies and comedies of their necessary readjustments are brilliantly<br />\nDr. T. Guthrie Speers, pastor of<br />\nportrayed by an author who can<br />\nBrown Memorial Church, will<br />\nthe<br />\nexperience.<br />\nwrite from contemporary<br />\nthe discussion on \"What My<br />\nlead<br />\nThe director of the Federal Theatre,1<br />\nHas Done For Me\"---at<br />\nReligion<br />\nfrom whom permission was obtained<br />\nmeeting of the Fireregular<br />\nthe<br />\nto present the play, has promised to<br />\nat 4:15 tomorrow at<br />\nSessions<br />\nside<br />\nCircularize it throughout the state<br />\nLevering Hall.<br />\nit<br />\nbelieves,<br />\nfor<br />\nMaryland,<br />\nhe<br />\nforms,<br />\nof<br />\nA member of the Levering Hall<br />\na necessary part of every college<br />\nand a trustee of Goucher<br />\nBoard,<br />\nstudent's dramatic experience.<br />\nCollege, Dr. Speers is a frequent<br />\nThe cast which has been assembled<br />\nvisitor to the Hopkins campus,<br />\nfor the play, includes some of the<br />\nand has spoken to various student<br />\nPlayshop's most seasoned veterans.<br />\ngroups at intervals.<br />\nTo be seen, among others, will be<br />\nThe Fireside Sessions are limPatty Singewald, Annette Jurgens,<br />\nited to twenty students and stuElsie Kane, Reardon Fusselbaugh,<br />\ndents interested are asked to sign<br />\nRaymond Abbitt, and Alfred Greenup on the lists posted at the Post<br />\nhood. \"The Class of '29\" is the<br />\nOffice and at the Levering Hall<br />\nmost modern play to be presented<br />\nbulletin boards.<br />\nat the Playshop this season.<br />\n<br />\nRIGHTS OF WAR<br />\n<br />\nSees Relation Between Problems Of War And<br />\nSocial Justice<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nCouncil Conducting<br />\nNew Questionnaire<br />\n<br />\nauxiliary to the Dormitory Activities<br />\nCommittee will be appointed in the<br />\nnear future by Chairman Pinck.<br />\nThose desirous of serving are asked<br />\nto communicate with him.<br />\n<br />\nPrevious Spring Dances have been<br />\npopular affairs with the 'dormers.<br />\nSeveral years ago one was given on<br />\na floor placed on the campus. The<br />\nusual program is to have the dance<br />\nin the Cumming Room. It will probably be the case this year, too. When<br />\nthe Dance Committee is appointed,<br />\nits first duty will be to extract, as<br />\npainlessly as possible, pledges from<br />\nthe dorm residents to pay a proportionate amount of the expenses. The<br />\ntariff will probably run about a dollar a couple. The fact that the dance's<br />\npresentation is absolutely dependant<br />\nupon the welcome it receives at the<br />\nhands of 'dormers' was made absolutely clear by Pinck.<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\n<br />\nive, if not, why, and whether they<br />\nwould turn in a cheating student.<br />\n<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br />\n<br />\nOther questions concerned opinions on compulsory assemblies and<br />\nJune Week. The statement on the<br />\nlatter was similar to that submitted<br />\nby the June Week Committee to Seniors several weeks ago—how much,<br />\nif any, undergraduates are willing to<br />\nspend on the June Week.<br />\nHershner Cross, president of the<br />\nStudent Council, could not be reached<br />\nto ascertain the reason for this questionnaire.<br />\n<br />\nWhat you want is easy; to find.<br />\nYou get efficient service.<br />\nPrices are reasonable.<br />\n<br />\nHUTZLER BIMEIZ sq••<br />\n<br />\nJanet Gaynor says:<br />\n<br />\n\"Leading artists of the screen<br />\nprefer Luckies\"<br />\n\"I live at the beach most of the year and<br />\nthere is hardly a weekend that a number of<br />\nfriends don'tdrop in. Naturally,I keepseveral<br />\nbrands of cigarettes on hand for guests, but<br />\nthe Luckies are always the first to disappear.I<br />\nsuppose it's just natural that Luckies would be<br />\nthe favorite brand because most of my friends<br />\nin pictures have discovered that the long hours<br />\nof rehearsing and shooting atthe studio place<br />\nasevere tax on the throat.Leadingartists of the<br />\nscreen prefer Luckies because they are a light<br />\nsmoke that sympathizes with tender throats.\"<br />\n<br />\nPlayshop To Give<br />\n(Me Class Of '29'<br />\n<br />\nFEMININE STAR OF DAVID 0.SELZNICK'S<br />\nTECHNICOLOR PRODUCTION OF\"A STAR IS BORN\"<br />\n<br />\nAn independent survey was made recently<br />\n<br />\nFireside Session<br />\n<br />\namong professional men and women --lawyers,<br />\ndoctors,lecturers,scientists, etc. Of those who said<br />\nthey smoke cigarettes, more than 87% stated they<br />\npersonally prefer a light smoke.<br />\nMiss Gaynor verifies the wisdom of this pref.<br />\nerence,and so do other leading artists of the radio,<br />\nstage, screen and opera. Their voices are their<br />\nfortunes. That's why so many of them smoke<br />\nLuckies. You,too, can have the throat protection<br />\nof Luckies — a light smoke, free of certain harsh<br />\nirritants removed by the exclusive process \"It's<br />\nToasted\". Luckies are gentle on the throat.<br />\n<br />\nTHE FINEST TOBACCOS\"THE CREAM OF THE CROP\"<br />\n<br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1937. The AmerIcli.<br />\n<br />\n\fHOMEWOOD, BALTIMORE,<br />\n<br />\n4<br />\n<br />\nAPRIL 1, 1937<br />\n<br />\nLacrosse Team To Face<br />\nThe John Hopkins University<br />\nCity College Of New York<br />\nSpring Schedule -1937<br />\nSaturday At Homewood<br />\nJays Have Three Lettermen<br />\nAvailable For Starting<br />\nPositions<br />\nVISITORS ARE STRONG<br />\nLavender Invaders Hold Victory Over Strong N.<br />\nY. Lacrosse Club<br />\nThe crash of clashing sticks, the<br />\nwhip of whistling passes, and thuds<br />\nof bruising bodies will feature the<br />\n1937 debut of the Johns Hopkins<br />\nhickory handlers in their initial encounter with the Lavender of C. C.<br />\nN. Y. Saturday afternoon at Homewood. This affair will provide a first<br />\nrate proving grounds for the current<br />\nlacrosse edition as the Gotham Club<br />\nrepresents a singularly well-balanced<br />\nten.<br />\nThe Blue Jays, with ten lettermen<br />\navailable for the starting positions,<br />\ntake the field with a veritable powerhouse on both offensive and defensive phases of play. Seven members<br />\nof the varsity have played together<br />\nfor the past three years, and they<br />\nshould coordinate with precise accuracy. Captain Pete Swindell and<br />\nDon Naylor resume their point positions with Johnny Ghinger at first<br />\ndefense. Jim Triplett, Bill Vickers,<br />\nMyra Green and Bill Kenny, all prepschool luminaries, will fill in as<br />\nfirst<br />\nthe<br />\ntroopers<br />\nwhen<br />\nshock<br />\nstringers play out. Dorsey Yearley, Johnny Beeler and Hammer<br />\nHimes are the long-winded Indians who trot incesstantly up and<br />\ndown field at the wings and pivot staCharles Mewtions respectively.<br />\nshaw and Herb Seigal understudy<br />\nthese men. The close-in attack presents Tommy Dukehart, Norm Melvin and Jack Kaufman with Johnny<br />\nKempton, Johnny<br />\nEnders, Billy<br />\nWaters, Frank Buch and Pete BernKahl<br />\nGeorge<br />\nalternating.<br />\nhelm<br />\nguards the nets for the Morrill ma-<br />\n<br />\nchine, with Ferdy Passano, former<br />\nAll-State from Boys' Latin, in reserve.<br />\nC. C. N. Y. Powerful<br />\nC. C. N. Y. has the best rounded<br />\narray of 'crossmen seen in recent<br />\nyears in Knickerville. George Lenchner and Phil Gottfried stand out visibly on the Lavender attack, supported by Larry Raskin. Its midfield will probably need the most<br />\nwatching, for Curran, Kent and Wienberger are the most consistent and<br />\nskilled of the invading horde. The<br />\nCity College defense is well balanced,<br />\nwith Silverman at the point, Gerbarsky at cover and Block checking<br />\naway at first defenseman.<br />\nThe Homewood group, who invaded New York last year to discolor<br />\nthe Lavender somewhat by a 14-8<br />\ndefeat, are eagerly awaiting the resumption of relations. The visitors<br />\nshowed considerable power in downing a strong New York lacrosse club<br />\nlast week, with the markers at 11-9.<br />\nThis is conclusive evidence that the<br />\noncoming array has players on its<br />\nattacks who can hit the target steadily the first time out. This characterizes a fine lacrosse club.<br />\n<br />\nHambleton Drills<br />\nTrack Candidates<br />\nDrilling daily since spring vacation, the track and field aspirants are<br />\npreparing for their opening meet<br />\nagainst Swarthmore on April 10.<br />\nCoach Waldo Hambleton is putting his cohorts through conditioning exercises to gradually work them<br />\ninto condition. The speed demons<br />\nand field men are working out and<br />\nshown signs that they will have a<br />\ngood season.<br />\nNeed Field Men<br />\nWith Baetjer, Graziano and other<br />\ncapable dash men back in the fold,<br />\nthe main need for candidates is in the<br />\nfield events.<br />\nConditioning exercises will be held<br />\nthe rest of the week with time trials<br />\nscheduled for the following week.<br />\n<br />\n\" 24<br />\nMay 1<br />\n\"<br />\n8<br />\n\" 15<br />\n\" 22<br />\n<br />\nLACROSSE-3 P. M.<br />\nCity College of New York<br />\nBALTIMORE<br />\nDartmouth College<br />\nDartmouth, N. H.<br />\nUniversity of Pennsylvania<br />\nBALTIMORE<br />\nSwarthmore College<br />\nSwarthmore, Pa.<br />\nPrinceton University<br />\nPrinceton, N. J.<br />\nSt. John's College<br />\nBALTIMORE<br />\nU. S. Military Academy<br />\nWest Point, N. Y.<br />\nUniversity of Maryland<br />\nBALTIMORE<br />\n<br />\nApril 10<br />\n\" 17<br />\n\" 21<br />\n\"23-24<br />\n\" 27<br />\nMay 1<br />\n\"<br />\n8<br />\n\"14-15<br />\n<br />\nTRACK AND FIELD-3 P. M.<br />\nSwarthmore College<br />\nSwarthmore, Pa.<br />\nHaverford College<br />\nHaverford, Pa.<br />\nWestern Maryland College<br />\nBALTIMORE<br />\nPenn Relays<br />\nPhiladelphia, Pa.<br />\nCatholic University<br />\nWashington, D. C.<br />\nWashington College<br />\nBALTIMORE<br />\nMason-Dixon Conference Meet<br />\nBALTIMORE<br />\nMiddle States Championships<br />\nPhilyadelphia, Pa.<br />\n<br />\nApril 3<br />\n\" 10<br />\n17<br />\n11<br />\n<br />\nBASEBALL-3 P. M.<br />\n3 Towson State Teachers<br />\nBALTIMORE<br />\n10 Mount St. Mary's College<br />\nBALTIMORE<br />\n12 Loyola College<br />\nEvergreen, Md.<br />\n16 Drexel Institute<br />\nPhiladelphia, Pa.<br />\n17 Swarthmore College<br />\nv. Swarthmore, Pa.<br />\n21 Western Maryland College<br />\nBALTIMORE<br />\n24 Washington College<br />\nChestertown, Md.<br />\n28 Dickinson College<br />\nCarlisle, Pa.<br />\nMay 1 Haverford College<br />\nHaverford, Pa.<br />\n7 Drew University<br />\nMadison, N. J.<br />\n8 Union College<br />\nSchenectady, N. Y.<br />\n11 Loyola College<br />\nBALTIMORE<br />\nJune Week Alumni<br />\nBALTIMORE<br />\nApril<br />\n<br />\nSixteen Teams 'Vie Letter Awards<br />\nFor Softball Title<br />\nGames Scheduled For Tuesday, Wednesday, Thursday, Friday Afternoons<br />\nWith sixteen teams competing for<br />\nthe interclass softball title, the<br />\nfourth year of organized play directed by Reuben Baer has gotten<br />\nunder way. The softball league is<br />\ndivided into four divisions, and<br />\ngames are scheduled for Tuesday,<br />\nWednesday, Thursday and Friday<br />\nafternoons at 4:15.<br />\nNames Changed<br />\nAlthough the same teams are competing as in basket ball, the renaming of most squads make it appear<br />\nthere are many newcomers. In the<br />\nTuesday League the Tigers, Nightriders, Tech Hawks and Senior<br />\nMechs will battle for the title. The<br />\nWednesday League contains the<br />\nSenior Gas-Civils, Cardiacs and Nine<br />\nJ's.<br />\nOn Thursdays the See-Ease,<br />\nLiterati, Junior Mechs, and Whirlwinds play. The following day the<br />\nM. J. All-Stars, Cement Mixers, Blue<br />\nBears and Newcomers engage in con<br />\ntests.<br />\n<br />\n.44<br />\n<br />\nApril 9<br />\n\" 16<br />\n23<br />\n24<br />\n27<br />\n29<br />\nMay 1<br />\n\"<br />\n4<br />\n6<br />\n8<br />\n11<br />\n14<br />\n<br />\nTENNIS-3 P. M.<br />\nSwarthmore College<br />\nDuke University<br />\nLehigh University<br />\nLafayette College<br />\nSt. John's College<br />\nWestern Maryland College<br />\nCatholic University<br />\nLoyola College<br />\nSt. John's College<br />\nOpen<br />\nLoyola College<br />\nCollege of William and Mary<br />\n<br />\nEvergreen, Md.<br />\nWilliamsburg, Va.<br />\n<br />\nApril 8<br />\n\" 13<br />\n14<br />\n20<br />\n28<br />\nMay 4<br />\n5<br />\n10<br />\n12<br />\n<br />\nGOLF-3 P. M.<br />\nCornell University<br />\nCollege of Osteopathy<br />\nSwarthmore College.<br />\nHaverford College<br />\nUniversity of Virginia<br />\nLehigh University<br />\nLafayette College<br />\nUniversity of Delaware<br />\nDickinson College<br />\n<br />\nBALTIMORE<br />\nPhiladelphia, Pa.<br />\nSwarthmore, Pa.<br />\nBALTIMORE<br />\nBALTIMORE<br />\nBethlehem, Pa.<br />\nEaston, Pa.<br />\nBALTIMORE<br />\nCarlisle, Pa.<br />\n<br />\n44<br />\n<br />\ndi<br />\n<br />\n11<br />\n<br />\nBALTIMORE<br />\nBALTIMORE<br />\nBethlehem, Pa.<br />\nEaston, Pa.<br />\nBALTIMORE<br />\nWestminster, Md.<br />\n(Tentative)<br />\nBALTIMORE<br />\nAnnapolis, Md.<br />\n<br />\nAt the meeting of the Athletic<br />\nBoard March 19, letters were awarded to those who participated in the<br />\n<br />\nwinter sports. Six major H's were<br />\ngiven along with fourteen minor H's.<br />\nThose who played in the required<br />\nnumber of games in basket ball were<br />\nCaptain Herb Seigel, Norman Melvin, Earl Cross, Carl Rasin, Harold<br />\nZheutlin<br />\n<br />\nand Demetrius Traggis.<br />\nThese six athletes received the major<br />\naward.<br />\n<br />\nEight minor H's were earned by<br />\nmembers of the wrestling team. The<br />\nawards were to Bob Vernon, 118 lb.<br />\nclass; Bob Linthicum, 125 lbs.; Sam<br />\nRosenstein, 135 lbs.; Lincoln Katz,<br />\n145 lbs.; Ed Clautice, 155 lbs.; John<br />\nEdwards, 165 lbs.; Charles Barnett,<br />\n175 lbs., and Bill Lamble, heavyweight.<br />\nIn fencing, Phil Small, Irwin Sherman, Walter Peale, P. Reed, Ross<br />\nand Davis secured the minor H.<br />\nAwards for swimming and handball will be announced later .<br />\n<br />\n30<br />\nSti<br />\n<br />\n66 BAFFLES INSIDE<br />\nSTILL9TIME<br />\n<br />\nFILTER -COOL SMOKE<br />\n<br />\nto be fitted<br />\nfor a<br />\n<br />\nDistinctive<br />\nEaster<br />\nSuit<br />\nStyle and workmanship<br />\nconsidered it actually<br />\ncosts LESS at<br />\n<br />\nJos. Schioss<br />\n& Son<br />\n<br />\n5 East Lexington St.<br />\n(nowhere else)<br />\n<br />\nMEDICO<br />\n<br />\nFILTER PIPE<br />\nSOMETHING WONDIRFUL<br />\nGOES ON INS1111<br />\n<br />\nMIN<br />\nVIMMUI<br />\nAll SHAPES<br />\n<br />\n.20ont<br />\nfitie6dey<br />\n6—wratt<br />\nIFINEST<br />\nNH IAN.<br />\nMONEY<br />\nCAN BUY<br />\nWir4,<br />\n31tri IF VALUE<br />\n<br />\nThis simple appearing yet amazing<br />\nabsorbent filter invention with Cellophane exterior and<br />\ncooling mesh screen<br />\ninterior keepsjuices<br />\nand flakes in Filter<br />\nand out of mouth.<br />\nl'revents tongue<br />\nbite,raw mouth.<br />\nwet heel, had<br />\nodor, frequent<br />\nexpectoration.<br />\nNo breaking<br />\nves<br />\nin<br />\nth.eltame<br />\nmproana<br />\nath<br />\nrp<br />\noa<br />\nmaoL<br />\nfil\".<br />\n<br />\nALSO CIGARETTE AND CIGAR<br />\n<br />\nBAFFLES 'BREAK UP<br />\nSMOKE STREAM - FILTER REALLY FILTERS<br />\n<br />\nstuc<br />\nbly,<br />\nfer<br />\nand<br />\nWe<br />\nrest<br />\nby<br />\nWI<br />\n<br />\n80<br />\nand<br />\nuat<br />\nTw(<br />\ncla<br />\ntion<br />\nany<br />\ntive<br />\nThe<br />\n<br />\nVI<br />\n<br />\ntee,<br />\nwh i<br />\nand<br />\nthe<br />\ned<br />\n<br />\n1161.12<br />\n<br />\nin oi<br />\ndew<br />\nday!<br />\nFift<br />\nbalk<br />\ncuss<br />\n<br />\nCc<br />\nfact<br />\nfavo<br />\nThai<br />\ngrea<br />\nthe I<br />\nsory<br />\nsire<br />\ngle<br />\nCc<br />\nwas<br />\n<br />\ning<br />\nthe<br />\nOut<br />\nyou<br />\nonly<br />\nsidei<br />\ncone<br />\nvotit<br />\nthe<br />\nSr<br />\nDoni<br />\n\"Ser<br />\ntical<br />\nques<br />\ngrat<br />\nyou<br />\naske<br />\nSyst<br />\ntabu<br />\ncont4<br />\n<br />\nPr<br />\nSti<br />\n\"Brit<br />\n<br />\nou'll quid/<br />\nyfind out<br />\nor yourself'<br />\n... that Chesterfields<br />\nare MILDER... that they have a<br />\nmore pleasing TASTE and AROMA<br />\n<br />\nf<br />\n<br />\nTh<br />\nPress<br />\nearly<br />\nEvar<br />\nDepz<br />\nFinal<br />\neren(<br />\nDr.<br />\ngardi<br />\ncomr<br />\nRevo<br />\nTh<br />\non E<br />\nstoell<br />\ncomp<br />\nDr. I<br />\nvestij<br />\nmany<br />\nby Cl<br />\n<br />\n\f", "format": "basic_html", "processed": "STICKMEN BEGIN<br />\nSEASON SATURDAY<br />\n—page 4<br /><br />\n3Joint,9 /firttikittg _Nrius-dirttrr<br /><br />\nLECTURER PREDICTS<br />\nPEACE TILL '61<br />\n—page 3<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 1, 1937<br /><br />\nVOL. XLI, No. 32<br /><br />\nPRICE 5 CENTS<br /><br />\nFIVE FACULTY MEN FACE DISMISSAL IN JUNE<br />\nAsks Jay<br />\nCarolina Solon Patriot<br />\nSwimmers Use<br />\nSeeks Lynching American Strokes<br />\nLicensing Act<br />\nAsks For Preservation Of<br />\nAmerican Way Of<br />\nLynching<br /><br />\nMitchell Present<br />\nProposes Bill As Compromise To Wagner- Costigan Act<br /><br />\nInjured In Dive,<br />\nEditor Warns Of<br />\nJapanese Attack<br /><br />\nirreleven,t? .<br /><br />\nMud Creek, N.Y., March 31—Bernard McHadden, the publisher, was<br />\nslightly injured early today when he<br />\ndived into water as shallow as his<br />\neditorials in the Young Men's Christian Association's pool here.<br /><br />\nMrs. Betsy Ross Rolloway, holder<br />\nof the Pulitzer prize for patriotism,<br />\nyesterday asked that the Hopkins<br />\nswimming team strike the Australian crawl dash from the list of<br />\nevents at future meets, because \"the<br />\nvery name 'Australian' proves that it<br />\nis un-American.\"<br /><br />\nAttendants helped him to a nearby<br />\nhospital, where he was treated for<br />\nscalp wounds and lacerations on his<br />\nforehead, nose and chin. Before leaving, he presented the nurse and interne who worked on him with back<br />\ncopies of his La Liberte and the admonition to be wary of a Japanese<br />\ninvasion on the West coast of the<br />\nUnited States. He said:<br />\n\"You are young and do not, as yet,<br />\nfully comprehend the complexities<br />\nand sophistries of international politics. I'll give you two reasons why I<br />\nexpect this invasion and expect it<br />\nany day now: first, Japan must have<br />\nan outlet to the sea; second, the<br />\nstrike of the Geisha girls is by no<br />\nmeans over and the tired business<br />\nman can't wait indefinitely. Hollywood is full of beautiful girls. Get<br />\nthe connection? Sure! Well, think<br />\nit over.\"<br /><br />\nIn a letter to Waldo Hambleton,<br />\nBlue Jay mentor, Mrs. Rolloway<br />\nasserted that it was \"disgraceful for<br />\nAmerican schools and universities to<br />\nteach our youth to be dependent on<br />\nthings of foreign origin, when our<br />\nforefathers have developed such an<br />\namazing variety of typically American strokes and dives.\"<br />\n\"I have devoted my entire life,\"<br />\nshe added, \"to the fight against the<br />\npercolation into our life of things<br />\nforeign. Italian spaghetti, Turkish<br />\ntobacco, French pastry, the Swiss<br />\nmovement in watches, the Spanish<br />\ntango, the Viennese waltz, the Dutch<br />\ntreat, Russian vodka--all these have<br />\nfelt my wrath; especially, Russian<br />\nvodka.\"<br /><br />\nCouncil Rejects<br />\nAlternate Plan<br />\nOf 5% Pay Cut<br />\nAgrees To Economist's Plea<br />\nThat \"Full Professors<br />\nMust Live, Too\"<br /><br />\nNames Untold<br />\nGraduate Students To Be<br />\nOffered Posts As<br />\nSubstitutes<br /><br />\nJessups, Md., March 31—The Academic Council of the Jessups University today unanimously voted the<br />\ndismissal of five faculty members<br />\nSouth Carolina Democrat, and leader<br />\nholding the rank of instructors. The<br />\nof the Southern bloc fighting the<br />\ndismissals, effective June 1, were<br />\npending Wagner 7 Costigan antinecessitated by the inadequate billiard facilities in the new faculty<br />\nlynching bill, yesterday offered to<br />\nclub house, it was explained.<br />\nsupport a compromise measure to<br />\nThe names of those dismissed were<br />\nprovide a Federal licensing act for<br />\nnot disclosed. An alternate plan of<br />\nlynchings.<br />\na blanket five per cent salary cut,<br />\nbrought<br />\nproposal<br />\nCadwalader's<br />\nwhich would have precluded the dismissals, was rejected by acclamation,<br />\nlively House debate, in which an unwhen Dr. Adam Smith, full proknown spectator, later identified as<br />\nfessor of economics, reminded the<br />\nof<br />\nthe<br />\nMitchell,<br />\nProfessor Broadus<br />\nCouncil, consisting exclusively of full<br />\nJohns Hopkins University, provided<br />\nprofessors, that \"full professors have<br />\nthe most exciting moment.<br />\nto live, too.\"<br />\nKhent<br />\nSays<br />\nPresident DisThe meeting was called by Dr.<br />\nCadwalader was on the floor decriminates<br />\nAgainst<br />\nMaine<br />\nJerome Higgins, president of the<br />\nfending his proposal, when the HopAnnapolis Bartenders Urged university, who did not attend. Dr.<br />\nkins economist interrupted from the<br />\nAnd Vermont<br />\nHiggins, in a messege last week,<br />\nAction To Bolster<br />\ngallery with a bitter harangue against<br />\ncharged<br />\nthe Council to seek a remedy<br />\nthe<br />\nupon<br />\nattack<br />\n\"an<br />\ncalled<br />\nIn<br />\nwhat he<br />\nan address before the Johns<br />\nOff-Year Reverses<br />\nfor the \"unfortunate billiard situa•<br />\nlast of our great Southern tradi- Hopkins Chapter of the American<br />\ntion, upon which depends our rating<br />\ntions.\"<br />\nStudent Union, in Levering Hall, at<br />\nAnnapolis, Md. March 31.—The<br />\n—Courtesy Net's Pod<br />\namong<br />\nthe great universities of the<br />\nMISS JUNE LANG<br />\nThe Cadwalader bill, placed in the noon yesterday, Frank R. Khent, pollong battle between the thirst of St.<br />\nworld.\"<br />\nHouse hopper yesterday, will, ac- itical commentator for the Baltimore<br />\nJohn's students and the legislature of<br />\nDean Hector Merryweather, of the<br />\ncording to its sponsor, be \"the great- Sun, charged that \"New Deal presMaryland is over at last. A comproSchool of Liberal Arts, who presided,<br />\nest advance in Southern culture since sure\" was responsible for failure of<br />\nmise was reached today through efsaid: \"We have a faculty of close<br />\nthe passage of the Eighteenth amend- the football teams of the Universities<br />\nforts of Senator J. Frank Woollen.<br />\nto live hundred. The new club house<br />\nof Maine and Vermont to receive inment.\"<br />\nHenceforth on alternate years, stuhas but one pool table. The disparity<br />\nRepresentative,<br />\n\"Why,\" said the<br />\nvitations to play in the year's Rose<br />\ndents will be permitted the full facilLate returns from the registrar's<br />\nThe Hopkins chapter of the Young<br />\n\"it will raise the standard of culture Bowl game in Palo Alto, California.<br />\nities of cafes and restaurants in An- is so great that the problem becomes<br />\nobvious. If the faculty were to parthroughout the entire South. Fur- Khent's address—entitled \"What Can office yesterday disclosed that one Communist League will meet to- napolis.<br />\nticipate in an elimination tournament<br />\nthermore it will provide a tremen- We Do To Protect National Minori- student—Otto von Schwegeldorf, an morrow night at 8.00 P. M. in the<br />\nThe action came in response to a<br />\nIn straight pool, and, let us assume,<br />\ndous source of revenue for our great ties?\" dealt with the question of gov- exchange student from the Univer- telephone booth<br />\non the first floor of petition from the Annapolis Barkeep- we were to<br />\nshoot one hundred points,<br />\nernment persecution of \"harmless\" sity of Leipsig—survived the first<br />\nPresident's humanitrrian program.<br />\ner's Association complaining that<br />\nGilman.<br />\nso much time would be required that<br />\n\"There is another aspect to the Republican agitators.<br />\nwhen the legislature was not in sessemester examination in Dr. Robert<br />\nwe wouldn't have a single day to<br />\nproposal which appeals to me greatGeoffrey Polopony, president of the sion, their business dwindled to the<br />\n\"Persons close to the New Deal B. Roolston's German reading course.<br />\ndevote to black ball. And, you all<br />\nly. If we can set up a decent stand- have informed me,\" said Khent in<br />\nEarlier reports from an unofficial group, said the purpose of the meet- • point of disappearing.<br />\nknow, that it is not our policy to<br />\nard of lynching, we will be able to part, \"that the gigantic Roosevelt<br />\nsource had fourteen dead, six in- ing was \"to discuss the decline in<br />\nThe petition demanded action on discriminate. No, not even<br />\nagainst<br />\ndispense forever with state courts.<br />\nwill spare nothing in its attempt to jured and five untouched.<br />\nprotestable matter proposed at re- the part of their star customers, to black ball.<br />\n\"Thus we can apply the money stamp out this inoffensive minority. I,<br />\nprovide for them during the lean<br />\nWilliam Tenner, '38, who thought cent gatherings.\" He said:<br />\n\"I came here willing to vote my<br />\nspent on judges, who are now useless, myself, have been followed for weeks<br />\nyears.<br />\nhe<br />\npassed,<br />\nsaid:<br />\n\"I'll<br />\ndrop<br />\nthe<br />\ncourse<br />\nown salary cut,\" Dean Merryto buying Easter overalls for the by a group of taxidermists offering<br />\n\"If we are to continue our fight<br />\nAs an advantage to St. John's stu- weather continued. \"But, when it<br />\nsharecroppers. Remember, the pas- to stuff me for the Smithsonian Insti- and pick it up again in 1942 when<br />\nDr.<br />\nsabbatical<br />\nagainst<br />\nRoolston<br />\ngoes<br />\nthe pillars of bourgoeis con- dents, the new bill, now being acted comes to matters pertaining to econaway<br />\non<br />\nsage of this bill means more fat-back tute.\"<br />\nleave.\"<br />\nventionalism we must protest more on by the house, will save them the omics, I always take the word of an<br />\nand turnips all over the South.\"<br />\nAt the close of his address those<br />\nDr. Roolston said: \"Well, anyway, frequently. I am going to suggest taxi-fare to points outside the three- economist. Frankly, Dr. Smith has<br />\nAt this point, Dr. Mitchell broke present at the meeting drew up a<br />\nmade me change my mind. No one<br />\nIn with the cry: \"I have come to save resolution protesting the government you can't say that I'm not consistent. that we hold a campus-wide contest, mile limit, one year out of two.<br />\nAsked to give reasons for limit- will deny that 'full professors have<br />\nthe American way of lynching.\" Ex- program against the Republican I don't know why so many can't get<br />\nwith prizes for those who bring in ing the college men during<br />\nlegisla- to live, too'.\"<br />\ncept for scattered bits like \"worse party. Plans were laid for a \"pilgrim- through my course. All you have to<br />\nthe<br />\nbest, most protestable matter. tive sessions, Senator Woollen bluffly<br />\nDr. Olynthus Dig, professor of<br />\nthan Alexander Hamilton,\" \"the cul- age\" to Washington to picket the have is an elementary knowledge of<br />\nremarked that it was a moot ques- Greek archwology, moved that the<br />\nlud boys,\" \"great Southern tradi- headquarters of the Democratic Na- German philology and a stout heart.\" Hitler is a fascist.\"<br />\ntion as to whether the facilities of word \"too\" be dug out of the records,<br />\ntions,\" \"picturesque sharecroppers,\" tional Committee as a protest against<br />\nAnnapolis would be adequate to any \"as it might give rise to some imthe rest of his words could not be this attack upon fundamental demofurther<br />\ndrain during the active peri- pertinent questions.\" The motion was<br />\nthe<br />\nuproar.<br />\ndistinguished in<br />\ncratic institutions.\"<br />\nods. \"We can only try to protect accepted.<br />\nHouse attendants finally managed<br />\nour — uh — interests,\" he said.<br />\nThe dean took the floor again.<br />\nto eject the speaker. After a few<br />\nThe Senator looks forward to great \"The dismissals will leave the dehours questioning he ,was released<br />\nAt the Fireside meeting last Tues- other purposes, by other people in<br />\nimprovements in the state capital. partments of philosophy, Greek and<br />\nfrom the Northwestern police staday afternoon Dr. Albert Blumberg control of the nation.<br />\nNo longer will bartenders just out- psychology very weak, but let's not<br />\ntion. He is believed to have returned<br />\nMembers of the First Ward Dem- led a discussion on \"The Place of ReThis strike against war is a means side the boundary be enabled to lord look at it too pessimistically. You<br />\nto his home in the Green Spring<br />\nocratic Non-Partisan Lodge heard ligion in Modern Society.\" The dis- of demonstrating to the world just It over their less fortunate city cou- remember the song, of course, about<br />\nValley of Maryland.<br />\nMayor Howard W. Jackson, Herbert cussion was said to be Very lively and how the most potential cannon fod- sins. All is to be free and equal— there being a silver lining for every<br />\nR. O'Connor, Lansdale G. Sasscer, the group did not adjourn until 6.30 der feels about ending its life in every other year.<br />\ncloud. For instance, there are a lot<br />\nWilliam S. Gordy, and J. Allen Coad, P. M. Last year the team won six some unmarked grave, about living<br />\nof clever young graduate students<br />\nrenounce and reject each and every out of ten against much stiffer com- physically and mentally shell shocked<br />\nwho want to teach. We'll place them<br />\nproposal, legitimate and otherwise, petition.<br />\non the staff and whatever we pay<br />\nor gassed. This matter is also part<br />\nNationally, the Anti-War strike is<br />\nto enter the gubernatorial race next<br />\nthem we'll take back for tuition.\"<br />\nand parcel of the honor system,<br />\nDr. David Rorton Mobinson yester- year. The general dissatisfaction was sponsored by the United Student<br />\n\"Dean, you're a genius,\" intoned<br />\nguarded by the Student Council. \"It<br />\nday announced that he would soon re- laid to the undue size of the salary. Peace Committee. This makes the<br />\nDr. Dig.<br />\nis astounding,\" said Dr. Sigerist, \"that<br />\n\"The Blue Jay stick team is in<br />\nlease discoveries, \"which will revolu\"I'd be tempted to wager my all fourth year that the demonstration Madrid has resisted the Rebel army<br />\n\"That's why I'm Dean,\" said the<br />\ntionize all the previous knowledge on the Irish sweeps,\" moaned the has been held at the Hopkins. Its<br />\ngood shape, and is picking up every Dean.<br />\n\"Back to order please.\"<br />\nso long, for when the Italian and<br />\nhas Mayor, \"What would the people of career began stormily when emwhich<br />\nHopkins scholarship<br />\nday,\" said Coach Melso Korrill today<br />\nGerman troops advanced against her,<br />\namassed about the primitive and Southern Maryland think ?\" queried battled R. 0. T. C. members turned<br />\nin an informal interview at the gymshe didn't even have sufficient guns<br />\nbackward peoples inhabiting the Sasscer and Coad. Gordy was most a hose on a faculty speaker. Last<br />\nnasium. \"I got word yesterday our<br />\nfor all her men.\" And that is why<br />\nwilds of Latrobe and Maryland Halls, sniffy and contemptuous of all. \"I'd year's strike was considered the most<br />\nsecond game was with Washington<br />\nwe should all support the strike.<br />\nHomewood.\" Dr. Mobinson returned be hounded to death to buy new sap- peaceful and orderly in history.<br />\nand Lee,\" said Korrill as his team<br />\nThe pond behind Levering Hall,<br />\nAlthough his team failed to win, worked out on the floor of the gym. unused since the<br />\nto civilization Tuesday after a peril- lings to plant in the Salisbury court\"The response to our financial camabandonment of<br />\nous three-hour trip through this lit- yard. You know the bough of the paign has been very gratifying, but C. Lindenmeyr copped high score by \"But they aint' kidding me,\" he Hell Week here, will be filled and<br />\nshooting 98 from the prone position, added. \"Washington and Lee have the space used for the<br />\ntle known region.<br />\ntree almost broke during the last our goal is far from being attained,\"<br />\nestablishment<br />\nThe University archmologist was lynching.\"<br />\nsaid James Bradford, Chairman of 96 kneeling and 78 standing, for a been dead a long time.<br />\nof an open air beer garden for the<br />\nreticent about releasing further<br />\nRumors to the effect that C. C. N. faculty.<br />\nthe June Week Committee. Rasin total of 272. We, supporting this<br />\nnews of his findings. \"I do not feel,\"<br />\nwas all over the court, popping in strike, wish to make the basis of Y.'s team is already in town have<br />\nDexter Feathers, ground keeper,<br />\nhe said, \"that work of this sort has<br />\nlong ones ,following up on rebounds. this demonstration as broad as pos- been circulating about the campus. said: \"Work on it will start whenany place outside the scientific jourHe seemed to have an inexhaustible sible and to enlist the backing of C. C. N. Y. will be remembered as ever we feel like it. If the faculty<br />\nThe Hopkins Playshop will observe amount of energy in his rompings every group affiliated with the Hop- the team that startled 4-5-6 fans last members are going to drink, let<br />\nnal.\"<br />\n\"But, there are some things about the fourteen hundred and eighty- about the floor, a fact that worried kins. This will be a strike that is year. They upset the entire game them drink out in the open.\" Then,<br />\nthis strange race whch should be of sixth day of the new freedom in Ger- his wearied man no little. He ex- general ,and we hope effective, mani- by getting lifts with Camels. Reports philosophically: \"There's very little<br />\nInterest to everyone. Of course, most many with a performance tonight at pressed the opinion that Mr. Roosevelt festation of student sentiment against were confirmed that Saturday last, you can copy from those Germans<br />\nof us do not ever think to investigate nine o'clock of \"Civilization Along has no desire to attain such a goal, war.<br />\nthe coach of the C. C. N. Y. team these days, but even the most biased<br />\nthis--the most fascinating of all the the Rhineland,\" an historical drama, but that the precedents which he sets<br />\nMaybe we did not make such a bad left New York incognito. The rest have to hand it to their beer<br />\nof course.<br />\nprimitive civilizations.\"<br />\nof the team left in strpet cars.<br />\nmay be taken over in the future for move after all.<br />\ngardens.\"<br />\nWASHINGTON, D. C., March 31.<br />\n—Rep. Robert E. Lee Cadwalader,<br /><br />\n\"Persecution\" By<br />\nNew Deal Attacked<br /><br />\nCompromise Gives<br />\nJohnnies UseofBars<br /><br />\nOne Passes, Others Irked By Decline 01<br />\nFail German Exam Protestable Items<br /><br />\nAnti-War Strike Is Not Rasin's Goal,<br />\nDespite Bradford's Plea For June Cash<br /><br />\nPolitomania<br /><br />\nPromises New Dope<br />\nOn Primitive People<br /><br />\nStick Tutor Tells<br />\n'10'He's No Dummy<br /><br />\nTo Fill In Pond<br /><br />\nToGiveGermanPlay<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 1, 1937<br /><br />\n2<br /><br />\nabe jobitc jOopitins<br />\nLetter<br /><br />\nPay Before The Deadline<br />\nThe request of the June Week Committee for payment<br />\nof the June Week levy of $10 before noon this Saturday<br />\nsems to us perfectly justified. The reasons must be<br />\napparent to every one.<br /><br />\nIn order for the Committee to plan its program carefully and ensure smooth functioning and adequate entertainment, it must have an accurate estimate of the funds<br />\n$2.00<br />\n_<br />\nSubscription per year<br />\navailable. This can only be accomplished by prompt<br />\n$2.50<br />\nBy Mail<br />\npayment of the levy before any actual planning is done.<br />\nRemit subscription fees to Treasurer, Student Activities Council,<br />\nThe Seniors now have it in their power to ensure a<br />\nRemsen Hall, Postoffice, Johns Hopkins University.<br />\nJune Week which will be satisfactory and enjoyable<br />\nto all.<br />\nEntered as second class matter December 3, 1909, at the Postoffice<br />\nWe urge all men who have not paid their fees to do so<br />\nin Ilaltimore, Md., under the Act of Congress, November 3, 1879.<br />\nbefore 12 o'clock noon this Saturday in Levering Hall.<br />\nBy doing this they will serve not only the interests of<br />\nPublished semi-weekly from October to June, except during exam- the class, but of themselves.<br /><br />\nI RCLIN1<br /><br />\nThe<br />\nInquiring<br />\nReporter<br /><br />\nTHE<br /><br />\nAM PUS<br />\nwith BOBBY HILDRETII<br />\nThis column is really good today:<br />\nDr. Kouwenhoven's Easter basket<br />\ncontained a 1937 Buick. More power<br />\nto you.<br />\na a<br />\nDr. Fagin and Donald Kirkley visited New York during the holidays<br />\nto criticize the Broadway plays.<br /><br />\nIn tercollegiates<br />\n(By Associated Collegiate Press)<br /><br />\nThe gentleness he exercises in<br />\nawakening fellow students for eight<br />\no'clock classes is just one kind of<br />\nadvertising that recommends BerHave you a question of general in- nard Gilman, \"The Slumber-Snapper\"<br />\nterest on which you would like to of the University of Richmond to<br />\nget a consensus of opinion? Drop it new clients.<br />\nin a note to Box 396.<br />\nEye-catching bills which he posts<br />\nThe Question: Are you in favor of on all bulletin boards explain that<br />\na course in sex instruction at the he eases the soundest snorers to conHopkins?<br />\nsciousness with a firm but unobjectThe Place: In and about the NEWS- ionable touch—for only 20 cents a<br />\nweek.<br />\nLETTER Office and Dormitory.<br /><br />\nHere's one for Mr. Sachs. Why is<br />\na person driving a fast car over a<br />\n\"Do you know,\" his circular asks,<br />\nbump road like the Supreme Court? William B. Kempton, junior: Yeah,<br />\n\"that failure to eat breakfast kills<br />\ninI<br />\nswell.<br />\ngood<br />\na<br />\nit's<br />\nIt's<br />\nthink<br />\n. . . Give up? When he reaches 70<br />\nducement for keeping the boys more men every year than cancer,<br />\nThe Student Council is to be congratulated for the he must have a good constitution to<br />\nEDITORIAL STAFF<br />\ntuberculosis or halistosis? That failEditor-in-Chief questionnaire which it sponsored. If the Student Body<br />\nfrom the Gayety.<br />\naway<br />\nStanley Finkel.<br />\nkeep his seat.<br />\nManaging Editors<br />\nure to attend early classes has blightJames Morrow, David Caplan<br />\nSports Editor lends its cooperation to the balloting, results should be<br />\nArthur Rosett, freshman: I think a ed more college careers than any<br />\nBernard 1). Pinck<br />\nEditors<br />\na valuable basis for further activition of the Student<br />\nBenjamin Root, Wethered Barroll, Jr.—.......Assistant Mangaing<br />\ncourse in sex instruction is a very other cause?\"<br />\nJune Week Flash—Glen Gray and<br />\nAssistant Sports Editor Council.<br />\nHarold Zheutlin<br />\ngood thing. It teaches young peohis Case Loma orchestra in York,<br />\nColumnist<br />\nPaul Berge<br />\nple things which might ordinarily<br />\nWe wonder why such a procedure was not followed Thursday, April 15th.<br />\nIncidently,<br />\nReporters—Max Iskowitz, Nathaniel Finkelstein, Jewett Goldsmith,<br />\nChin golf, a game designed to aid<br />\nbe learned 'through harmful exHoward Reizenstein, Julian Adler, Carl Rasin, Leonard Rubinger, before the class dues were made compulsory by an there has been a change in this outshavers in going down the facial<br />\nMorris Wessel, Arthur Katz, Martin Krieger, Lester Rosenthal, undemocratic process.<br />\nsources.<br />\nor<br />\nperience<br />\nunreliable<br />\nfit. Those two hot trumpet tooters,<br />\nfairways in the least possible strokes<br />\nMurray Kempton, Victor Victoroff, Charles Diggs, William BurWe hope the students will fill out the questionnaire Grady Watts and Bobby Jones, havg, Bud Gusack, senior: Yes, because a has yelled \"fore\" on nine university<br />\nford, J. C. Handelsman, Mal Boshnack, Arnold Glantz, Joe<br />\nAlperstein,<br />\nMilton<br />\nMillberg,<br />\nIrving<br />\nSarnovitz, Seymore Sacks,<br />\ndeparted and Glen Gray now stands<br />\nseriously.<br />\nnatural curiosity about sex exists and college campuses in the East.<br />\nZenas Baum.<br />\nup and directs.<br />\nin minds of all boys and girls of<br />\nAnd collegians, one from each of<br />\nBUSINESS STAFF<br />\n*<br />\nmy age. Better to have enlightenBusiness Manager<br />\n_<br />\nWilliam B. Kempton<br />\nthe institutions in the Ivy League:<br />\nThe noon card parties in Levering<br />\nAssistant Business Manager<br />\nment by authority than by other<br />\nMelville Locker<br />\n(Brown, Yale, Princeton, Williams,<br />\nThe day after tomorrow Kelso Morrill will release his Hall have resumed now that Lent is<br />\nAdvertising Manager<br />\nWm. C. Erlanger<br />\nmeans.<br />\nDartmouth, Amherst, Columbia and<br />\nManager<br />\nCirculation<br />\nfor<br />\nteam<br />\nlacrosse<br />\nthe<br />\nHopkins<br />\nof<br />\nJonhs<br />\nedition<br />\nthird<br />\nGerald Willen<br />\nover. The boys you saw playing<br />\nOffice Manager public approval. It was in 1935 that Kels succeeded Ray<br />\nWilliam Sattler, sophomore: I haven't Wesleyan) will compete in bringing<br />\nHoward Linkoff<br />\nduring that self-denial period only<br />\nCopy and Filing Manager<br />\nNathaniel Soifer<br />\nbeen to one lecture yet and there- their faces out of the \"rough\" with<br />\nvan Orman as professor of lacrosse science and tactics gave up studying.<br />\nfore feel that I can't commit my- a minimum of strokes and no slices.<br />\nhere.<br />\nREPRESSNTIICI FOR NATIONAL ADVIERTISING SY<br />\nself.<br />\nAnd it looks like this is the year he's been waiting for.<br />\nBlanche Benton was the name of<br />\nNational Advertising Service, Inc.<br />\nLacrosse is a tradition at the Hopkins, and traditions that beautiful piece of architecture Arthur Katz, junior: Yes. An alarmCollege Publishers Representatlas<br />\nNEW YORK. N.Y.<br />\n420 MADISON AVE.<br />\ning number of young men of colpack a punch when they're backed up by a squad of from Chicago that visited our camcan<br />\nFRANCISCO<br />\nSAN<br />\nBOSTON<br />\nCHICAGO<br />\nlege age are in the dark, as it were,<br />\nszarfLit<br />\n•<br />\nr',RTLANC<br />\nLos AN , FLES<br />\nexperienced and speedy stickmen. They say that Mary- puss during spring vacation. For<br />\nconcerning these matters. This is<br />\nland babies are born with lacrosse sticks in their hands further information see Miss Beulah<br />\nMember<br />\nl937<br />\nunfortunate. A well-arranged course<br />\nand that most of them grow up and go to the Hopkins.<br />\nBenton of the education department.<br />\nin sex education will reduce this<br />\nYes,<br />\nit<br />\nher<br />\nwas<br />\nsister.<br />\nthat<br />\nto<br />\nthe conclusion<br />\nSober examination reads us<br />\ndifficulty, somewhat.<br />\nDIA ributors<br />\nthat story is pure legend, but the idea is tenable, for, if<br />\nD.<br />\nFrancis Gilbert, senior: I think<br />\nthis state is the king of the lacrosse world, Hopkins is<br />\nJanet Schuchardt driving around<br />\nthis course in sex education at the<br />\nthe emperor.<br />\nin her dad's new Packard 120.<br />\nall Smoking Tobacco<br />\nHopkins should be made a permanBack around the turn of the century Hopkins men Beauty on wheels; I mean the car.<br />\nMember Of The<br />\nINTERCOLLEGIATE NEWSPAPER ASSOCIATION<br />\nent<br />\nof<br />\npart<br />\nthe<br />\nschool<br />\ncurriculum.<br />\n*<br />\nbites the Tongue<br />\nintroduced lacrosse to the Free State. And Hopkins<br />\nOf Middle Atlantic States<br />\nIt is one of the most progressive<br />\nhas called the music since then.<br />\nGracie Gillen survived with her<br />\nsteps made by our progressive inOver the period of years the Blue teams have even injured back, the result of a frat<br />\nTHURSDAY, APRIL 1, 1937<br />\nstitution. Let us hope it is here<br />\nwon more national titles than all other teams combined. house flop. James Palmer Lyle is<br />\nto stay. Elucidation through the<br />\nthe<br />\ncause<br />\nof<br />\nLittle<br />\nAudrey's<br />\nrapid<br />\nHopkins players have spread out over the country,<br />\nwill lift the shroud from<br />\nlectures<br />\nteaching the game as they went -- initiating high recovery.<br />\nmany facts heretofore regarded<br />\nTwo petitions of the St. John's student body asking schools and colleges in the lore of that old Indian contest<br />\nas mysterious.<br />\nNote to Hutch: How does it feel to<br />\nfor the repeal of the state law preventing them from ---\"the fastest game on two feet.\"<br />\npay the cab fare when the boy Douglas Price, freshman: Although<br />\nlegally buying beer or intoxicating liquors in the City<br />\nIn 1928, the Johns Hopkins University stickmen repfriend's race track note (two dollar<br />\nI've never attended a lecture, they<br />\nof Annapolis or within a three-mile limit thereof have resented the United States in the Olympic Games at<br />\nbill to you) couldn't be changed?<br />\nare undoubtedly wonderful as they<br />\nAmsterdam. In 1932, they represented the nation in the<br />\nbeen rejected.<br />\nSmart action, Henderson, I think I<br />\ntell one all things one should know<br />\nwere<br />\ncopies<br />\ntwo<br />\nLos<br />\nAngeles Olympic Games. The United States, in this<br />\nDrawn up by the Student Council,<br />\nwill carry some.<br />\nconcerning<br />\nsexual matters. It will<br />\nsent to the Anne Arundel County Delegation and the way, has sent more Hopkins men to the Olympiads than<br />\nact as a force tending toward hap*<br />\n*<br />\nCollege<br />\nit has sent athletes from any other single college.<br />\nother to the president and faculty of St. John's<br />\npier marriages.<br />\nVasilka Petroff spent her spring<br />\nasking that it be sent to the board of Visitors and GovBut there has been a sad note these last two years.<br />\nvacation<br />\nin<br />\nworking<br />\nour<br />\nlibrary.<br />\nShe<br />\nRobert Feishaker, freshman: I think<br />\nernors. Both were rejected, the latter never getting Not since the 1932-1933-1934 period has a Jay team won<br />\nEdgeworth Guarantees thatProcessmust have school daze.<br />\nthe course is a good thing. Most<br />\nbeyond the president's office.<br />\nthe national championship. Mt. Washington has worn<br />\nAging Prevents Tongue Bite<br />\nfellows know quite a bit after a<br />\nIn view of the democratic teachings which a college the crown since then. The fact that former Hopkins men<br />\nRumor:<br />\nThe<br />\nWomen's<br />\nClub<br />\nhave<br />\nfashion,<br />\nbut<br />\nthe<br />\ncourse will clear<br />\nMONGUE BITE is the bane of<br />\nis in a position to offer and the fact that such a law led the clubmen to these titles in small consolation.<br />\nplanned at tea for April 8 . Dr. Guttup vague points.<br />\npipe smokers. We guarantee<br />\nThe time is more pleasant now. Freshmen and sophois entirely a discriminatory one, the NEWS-LETTER canmacher will be the guest speaker.<br />\nEdgeworth will not bite the<br />\nthat<br />\nof<br />\nbody<br />\nstudent<br />\nthe<br />\nwith<br />\nsympathy<br />\nin<br />\nfeeling<br />\nmores have become juniors ad seniors. They have<br />\nnot help<br />\nThe topic, I understand, will be on 15. Certain areas of Egypt are cultongue.<br />\ngained that factor that cost them two championships<br />\nSt.. John's College.<br />\nThe use of the finest Burley tosexology. 0. U. Girls.<br />\ntivated by irritation.<br />\nThe law evidently was designed to prevent the stu- — experience.<br />\nbaccos will not prevent tongue bite.<br />\n*<br />\nThis is the year.<br />\ndents from drinking, but those students who want to<br />\n16. A water shed is a shed in the<br />\nIt's the processing that does it. As<br />\nPaul Berge exercising the cute litevery tobacco expert knows, pipe<br />\ndrink no doubt find means to do so. Thus, the law canmiddle of the sea where ships<br />\ntle secretary in Gilman Hall, after<br />\ntobacco can be rushed through the<br />\nnot serve a very practical use, but remains on the books<br />\nshelter during a storm.<br />\nher lunch. What's the matter Micplant and save big sums of money.<br />\nas a very sad piece of legislation; for if a young man is<br />\n17. Zanzibar is noted for its monis pipe tobacco, but it is not<br />\nIt<br />\nkey,<br />\nisn't<br />\nyour<br />\nproviding,<br />\nlunch<br />\nhour<br />\nfrom<br />\n1<br />\nto<br />\nso,<br />\ndo<br />\nmay<br />\nhe<br />\nbeer<br />\nthe<br />\npurchase<br />\nof age to<br />\nThe<br />\nkeys.<br />\nEdgeworth.<br />\nBritish<br />\ngovernor<br />\nlives<br />\n2<br />\np.m.?<br />\nOr<br />\nwould<br />\nyou<br />\ncollege.<br />\nrather write<br />\nhowever, he is not fortunate enough to attend<br />\nOur method is Process-Aging—<br />\nthere.<br />\nthan walk and talk?<br />\nThe whole fear of the college seems to be that the<br />\na process as vital as the aging of old<br />\n18. New York stands on the Atlantic<br />\nrepeal of the law might interfere with the financial aid<br />\nwines. There are twelve required<br />\nsideboard.<br />\nsteps, each under laboratory control.<br />\nwhich the college receives from the State Legislature.<br />\nIt takes 4 to 7 times as long as might<br />\n19. The Nile is full of crocodiles and<br />\nThis fear, however well based, seems odd, for it would be<br />\nObservers frequently comment on the attitude of uniseem necessary. But in no other way<br />\npyramids.<br />\nvery strange indeed for a state which legalizes liquor versity graduates and students toward politics and other<br />\ncan we guarantee that Edgeworth<br />\nWe dedicate this column today to 20. The Arctic circle is the Arctic<br />\nand beer and sets a legal age limit to refuse money to a issues which involve the well being of the whole nation.<br />\nwill not bite the tongue.<br />\ncollege which but stands by that law.<br />\nThey point out that the educated frequently exhibit Mr. Hamill. Material is from Dr.<br />\nregion where it is day all day<br />\nWe ask you to try it under our<br />\ntake<br />\nnot<br />\ndoes<br />\nadministration<br />\nIt seems to us that the<br />\nlong.<br />\na cynical attitude, or perhaps what may be more aptly Seuss' Book of Boners in regard to<br />\nmoney-back guarantee. If Edgecola healthy attitude in its regard for the maturity of<br />\nworth bites your tongue, return it<br />\ntermed intellectual snobbishness, toward public affairs Geography.<br />\n21. The equator is a menagerie lion<br />\nand get your money back. You<br />\nlege students. Furthermore, disrespect for law and of the day, and, still more harmful, refuse to exercise<br />\nFrom Dr. Seuss Book of Boners.<br />\nrunning around the earth and<br />\ncan't lose.<br />\nauthority in general (as during the drought era of pro- their franchise or seek political office.<br />\nToday in regard to Geography. We<br />\nthrough<br />\nAfrica.<br />\nhibition) is made conducive by this law.<br />\nhigh<br />\nthe<br />\nconducted<br />\npolitics<br />\non<br />\nnot<br />\nthat<br />\nis<br />\nAdmitted<br />\ndedicate this column to Mr. Hamill.<br />\nNOTE: There are three kinds of<br />\nNext week we will examine the<br />\nmoral and intellectual plane that should evolve from the 1. Grade school pupil who was<br />\nEdgeworth for you to choose from:<br />\nboners made in science and math.<br />\npublic service, nevertheless, the educated owe a duty<br />\nasked why the Panama Canal<br />\n1—Edgeworth Ready-Rubbed—a<br />\nto their commonwealth and fellow citizens which cannot<br />\ncool, long-burning tobacco precontents<br />\nwould aid in the defense of the<br />\nthe<br />\nof<br />\nany<br />\nregard<br />\nreaders<br />\nBefore any of our<br />\nbe dismissed with a cynical sweep of the arm. A man<br />\nferred by seasoned smokers.<br />\ncountry in time of war said: \"The<br />\non the front page with the slightest seriousness, we who is the possessor of the highest knowledge that the<br />\n2—Edgeworth Plug Slice—for the<br />\nlocks will keep out the enemy<br />\nwish they would examine the date of this issue.<br />\nsmoker who likes to crumble the<br />\ninstitutions of learning have to offer, who has been<br />\nships.\"<br />\ntobacco in his hands until it's just<br />\ntaught to think, to discern logical thinking from dis2. Climate lasts all the time, but<br />\nright for him.<br />\nordered rantings, to appreciate the needs of the majority<br />\nweather only a few days.<br />\n3—Edgeworth Jr.—the same tothe<br />\nlimited minority, should realize his<br />\nrather than<br />\nbacco also Process-Aged, but cut<br />\nWe wonder how many of those who viewed Richard<br />\n3. Latitude tells you how hot you<br />\nto God, self and his fellow man.<br />\nfor a milder, more free-burning<br />\nWagner's \"Lohengri'n\" Monday night realized that responsibility<br />\nare, and longitude how cold you<br />\nsmoke.<br />\nParadoxically, at this time, millions of government<br />\nit was not long ago that such a performance would be<br />\nare.<br />\nto<br />\nexpended<br />\nannually<br />\nprovide<br />\nbeing<br />\nhigher<br />\nare<br />\nfunds<br />\nconsidered as intensely anti-patriotic.<br />\nfor the youth of the United States, who accept 4. The climate of Bombay is such<br />\nYes, we should not criticize Hitler's barring of Men- education<br />\nthat its inhabitants have to live<br />\npresented by a benevolent governopportunities<br />\nthe<br />\ndelsohn or Rubenstein without appreciating our own<br />\nPlease accept 500 Gold Plated Collar-Pin<br />\nelsewhere.<br />\nby<br />\nto<br />\nattempt<br />\nlending<br />\nreciprocate<br />\nno<br />\nmaise<br />\nand<br />\nment,<br />\ntide<br />\nfor only 10t when you buy Edgeworth.<br />\nhigh<br />\nthe<br />\nduring<br />\nattitude toward German culture<br />\nMerely send inside white wrapper from<br />\nthe fruits gleaned from education to the best interest 5. The sun never sets on the Britof World War propaganda. We were in just the same<br />\nany tin of Edgeworth with your name and<br />\nish Empire because the British<br />\nsociety.<br />\nof<br />\nunenlightened<br />\nand 10t to Lanus &amp; Bro. Co.,<br />\naddress<br />\nposition as the Nazis in regard to our<br />\nEmpire is in the East and the<br />\nDept. 100, Richmond. Va.<br />\nduty of the educated man does not cease in<br />\nThe<br />\nposition.<br />\nsun sets in the West.<br />\nmerely engaging in public life or exercising his franIt was in the heat of the denunciation of everything<br />\nThe sun sets in the West and hur6.<br />\nto<br />\nhimself<br />\nobligated<br />\ninformed,<br />\nkeep<br />\nchise.<br />\nis<br />\nto<br />\nHe<br />\nthe<br />\nof<br />\nminds<br />\nintellectual<br />\nthe<br />\nthat<br />\nwith a German tinge<br />\nries around to the East to be in<br />\nmake of life a continuous period of study. He must be<br />\nAf4fa<br />\ncountry were prostituted to produce such patriotic and<br />\ntime to rise the next morning.<br />\naware of the issues of the day, the political troubles<br />\nchauvinistic propaganda as Dr. W. R. Thayer's comment.<br />\nwhich afflict the nation, and only after a thorough 7. Imports are ports very far inland.<br />\n4/R.<br />\nHe wrote:<br />\n8. Nearly at the bottom of Lake —••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••—•••••••••••••I<br />\nand analysis, should he express his views.<br />\nstudy<br />\nwar,<br />\nof<br />\npassion<br />\n\"Wagner's music is . . . unrestrained<br />\nMichigan is Chicago.<br />\nTo the educated falls the task of unmasking the<br />\n-P<br />\n7141/e4;1,77aredi<br />\nlust and cunning that belongs to an uncivilized race.\"<br />\nas demagogue, the partisan, and uninformed press, 10. A mountain range is a cooking<br />\nOf course now that there is peace (peace, at least,<br />\nstove used at high altitudes.<br />\nwho make it a common practice to lead the masses<br />\nopposed to a war with a foreign country) only the vesto their way of thinking, whether right or wrong, for 11. The people of India are divided<br />\nGerthe<br />\nagainst<br />\nfrenzy<br />\nand<br />\nhatred<br />\nformer<br />\nour<br />\nof<br />\ntiges<br />\ninto casts and outcasts.<br />\ntheir own selfish purposes.<br />\nmans remain. But in place of this there are others.<br />\nThought along political and social angles might well 12. Persian cats is the chief industry<br />\nup<br />\nwhip<br />\nto<br />\nattempting<br />\nstill<br />\nare<br />\nsocieties<br />\n\"Patriotic\"<br />\nof Persia--hence the word \"purr.\"<br />\nare begin while the student is still in college. If such modes<br />\nhatred and prejudice. Of course now the objects<br />\nMediterranean and the Red<br />\nThe<br />\n13.<br />\nin<br />\nstill<br />\nis<br />\nhe<br />\ndeveloped<br />\nenshrouded<br />\nwhile<br />\nthought<br />\nof<br />\nare<br />\nessenremain<br />\ninvolved<br />\nPEN and PENCIL SETS<br />\nprinciples<br />\ndifferent, but the<br />\nSea are connected by the Sewage<br />\nan intellectual atmosphere attributed to college life,<br />\ntially the same.<br />\nCanal.<br />\nthe man, as a citizen, will find he has acquired a sense<br />\nIf we tend to laugh at ourselves for assuming such<br />\nof political mindedness, and will continue to interest 14. New York is behind Greenwich<br />\nthe<br />\nduring<br />\nculture<br />\nGerman<br />\ntowards<br />\nattitude<br />\nan absurd<br />\ntime because America was not<br />\nhimself in the well-being of his country.<br />\nGreat War, we should look about ourselves today and<br />\ndiscovered until very much later.<br />\nof Detroit, Varsity News.<br />\n—U.<br />\nsober.<br />\nmentally<br />\nare<br />\nwe<br />\nwhile<br />\ntake inventory<br /><br />\nination and college holiday periods by undergraduates of the Johns<br />\nHopkins U ni versity.<br /><br />\nCongratulations!<br /><br />\nKelso Begins His Third Season<br /><br />\nPipe Smokers!<br /><br />\nPlease Don't<br />\nBelieve<br /><br />\nAssociated Gotleesiate Press<br />\nConeeSiaie West<br /><br />\nSt. John's And Beer<br /><br />\nCONTEMPORARY<br />\nOMMENT<br />\nYour Franchise<br /><br />\nKnowledge IsPower<br /><br />\nNuff Said<br /><br />\nLOST<br /><br />\nA \"Blight\" At The Opera<br /><br />\n11<br /><br />\nLuckiesh, Color and its Ap-1<br />\nplication was taken from<br /><br />\nI<br /><br />\nthePhysics Library without<br />\nbeing signed for ,about<br />\nFebruary 19. Please return<br /><br />\nthis book promptly, and no<br />\nquestions asked.<br /><br />\nKIBLER'S<br /><br />\nJewelers and Opticians<br /><br />\n3222 Greemnount Avenue<br /><br />\nEDGEWORTH<br />\nEDGEWORTH<br /><br />\n3<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 1, 1937<br /><br />\nDormitorv Activities Committee<br />\nDance Faculty Club To<br />\nBecker Sees No \"Bulletin's\" New International<br />\nBe Sold Set For Saturday Eve BeOpenedThisEve Start Pians For Spring Dance<br />\nTo<br />\nIssue<br />\nEuropean War By Hopkins Press<br />\nLikely 'Till 1961 'Bulletin Of The Institute Of<br />\nCites Past History To Prove<br />\nPeriods Between Wars<br />\nLonger<br /><br />\nMedicine' Features Magic<br />\nIn Ancient Medicine<br /><br />\nCountries<br />\nForeign<br />\nTwenty-Eight<br />\nBernard Pinck, chief of the DorThe new faculty building will be<br />\nTo Be Represented<br />\nmitory Activities Committee, definbe<br />\nto<br />\nis<br />\nedifice<br />\nThe<br />\ntoday.<br />\ndedicated<br />\nat Party<br />\nthe permanent quarters of the Johns itely committed himself today the<br />\nfact that he and his associates are<br />\nThe only annual event, the Inter- Hopkins Club. This organization, in<br />\nconsidering plans and particulars<br />\nnational Night Dance, taking place existence several years already, offor the Spring Dance of 1937—an anin Levering Hall which features rep- fers membership to faculty and al- nual affair at Alumni Memorial Hall.<br />\nPinck was quite emphatic in<br />\nresentatives from twenty-eight coun- umni. A reception will feature the<br />\nhis stressing of the fact that the<br />\ntries, will be held Saturday, April 3. \"house warming\" this evening.<br />\nsuccess of the dance, and even it,<br />\nSponsored jointly by the CosmopoliCompleted through the aid of Mr. presentation depends entirely upon<br />\ntan Club and the Friendly Relations<br />\nTheodore Marburg and his sister, the hearty support \"of the material<br />\nGroup, there will be students from<br />\nMiss Amelia Marburg, the building nature,\" of the dormitory residents,<br />\nand of the student body in general.<br />\nforeign countries studying at Goucher<br />\nis in complete harmony with other<br />\nTentatively, the first two weeks in<br />\nand Notre Dame of Maryland in adHopkins halls and is situated in the May have been<br />\nconsidered for the<br />\ndition to those here at Hopkins.<br />\nnorth end of the Botanical Gardens. date, but there is every chance that<br />\nMusic will be furnished by the Blue<br />\nonce the machinery of the commitJays from 9 until 1, while impromptu<br />\ntee starts functioning, the boys will<br />\nbe enabled to chalk a red check on<br />\nentertainment will be furnished by<br />\ntheir calendars for some time in<br />\nguests throughout the evening. Dan<br />\nApril.<br />\nde Lima, president of the CosmopoliYesterday afternoon the Student<br />\nA committee which will be an<br />\ntan Club, says, \"We are to have a<br />\nyoung lady entertainer also. I am Council stuffed the post-office boxes<br />\n•<br />\nkeeping the nature of her avocation of undergraduates with questiona secret until the evening of the naires on policy—the Honor System<br />\ndance. However, I will guarantee and the Assembly question. The ather performance to be the best at<br />\ntitudes of students towards the Honor<br />\nany of our dances.\"<br />\nThe price of admission is 50c and System, whether they think it effect-<br /><br />\nJust announced by the Johns Hopkins Press is the publication of the<br />\nMarch issue of the Bulletin of the<br />\nInstitute of Medicine.<br />\nA quick glance at the table of contents of the Bulletin reveals a typical<br />\nchoice of subject matter. \"Greek<br />\nMedicine in Its Relation to Religion<br />\nand Magic\" by Ludwig Edelson;<br />\n\"Guillame Adler and His ContribuDr. Carl Becker, professor of histion to Biblical Medicine\" by Ososer<br />\ntory at Cornell University, went back Temkin, and \"Texts and Documents,\"<br />\n300 years in his James Schouler lec- a comprehensive and inclusive comture in Latrobe Hall Tuesday after- pilation of contributions to the microscopic anatomy of the pancreas by<br />\nnoon, to prove that another general<br />\nPaul Langerhaus, build up an imposwar is not likely to break out until<br />\ning and satisfactory magazine.<br />\n1961. His address was entitled \"Rights<br />\nThe first ,and featured article, is a<br />\nof War.\"<br />\ndiscussion of a topic that has prevStarting with 1618, the speaker iously been almost ignored by historians and medical men.<br />\npointed out that that peaceful lulls<br />\nThe title, \"Greek Medicine in its<br />\nbetween European wars have lasted,<br />\nRelation to Religion and Magic,\" de- includes refreshments. Three hunrespectively 24 years, 20 years, 29 notes that topic.<br />\ndred tickets have already been sold,<br />\nyears, 38 years and 43 years. The<br />\nThe neglect of men in ignoring this more are available now at Levering<br />\npresent peace has already lasted 19 phase of ancient life is justified and Hall. Every one is urged to buy his<br />\napologized for by the author, Ludwig ticket now, as there will be an addiyears.<br />\nEdelstein, who says, \"The neglect of tional charge of five cents at the<br />\n\"Generalizing roughly,\" said Dr.<br />\nreligious and magical medicine seems door.<br />\nBecker, \"we find that the periods of the more justifiable because, accordwar tend to become shorter, the peri- ing to the prevailing opinion, Greek<br />\nods of peace longer ,so that if the medical art itself dispensed with rePrinters of<br />\npresent general peace is to be longer ligion and magic.\"<br />\nPHILOLOGICAL and<br />\nThrough many examples, referthan the last one, we need not expect<br />\nences to ancient writings and quotaSCIENTIFIC PUBLICATIONS<br />\nanother general war until about 1961. tions from classic physicians like<br />\n12-20 Hopkins Place Baltimore<br />\nI do not vouch for this conclusion Hippocrates, the author shows clearly<br />\nsince the statistics are limited and the unmistakable connotations apparent in Greek medicine of Greek<br />\nnone too precise.\"<br />\nsuperstition. Mr. Edelstein is conDr. Becker further declared that<br />\nvinced, and convinces his reader, that<br />\na state's interests, \"location, and magic was really rejected as wrong<br />\npolitical system are almost the sole by the Greek physicians. However,<br />\nfactors in determining its foreign religion plays an important part in<br />\nthe theory and practice of Greek<br />\npolicy.<br />\n\"The balance sheets of wars waged medicine, which is the forerunner and<br />\nduring the last three centuries is suf- the beginning of modern science.<br />\nGuillame Ader, an almost forgotficiently accurate to demonstrate<br />\nthat the ends which states pursue ten seventeenth century French phyare too limited and archaic to be of sician-poet, is the subject of an exTempkin.<br />\npermanent value . . . that it defeats haustive study by Ososer<br />\nmore often than not, the purpose Moral advice to the farmers and middle-classes of Gascony in 100 quatfor which it was waged.<br />\nrains constitute the basis for the<br />\n\"In the fundamental sense . . . war<br />\nstudy. Ader is pictured as a sage,<br />\nis validated by the assumption that<br />\nclever man who used his knowledge<br />\nnations can profit by depriving each<br />\nof the respect of superstition by the<br />\nLooked<br />\npossessions.<br />\nother of valued<br />\nneighboring Gascon farmers to cure<br />\nat in this light, war is only another<br />\nthem of their ills, real or imaginary.<br />\naspect of the wider problem of social<br />\nHis common-sense served in highest<br />\njustice.<br />\ncapacity as a means to prescribe<br />\n\"Since the two are related, there treatment. Where he saw that the<br />\nis no reason why the solution of one patient could not understand or apshould forever wait on the solution preciate treatment, and suspected<br />\nof the other. In either case a good that he would not submit himself to<br />\nway is to begin by changing the rules it unless magical hocus-pocus was<br />\nof the game.\"<br />\nconnected with it, he hypocritically<br />\nuses the horoscope in psychotherapeutic cases. The man loved poetry<br />\nequally as well as medicine and strove<br />\nat all times to combine those two<br />\ninterests by expressing his medical<br />\nModern Play Concerns Itself With beliefs and of making known his findings in rhyme.<br />\nCollege Grad in Depression<br />\nFamous in the annals of medical<br />\nThe new W. P. A. play, \"The Class history is the name of Paul Langerof '29,\" will be presented by the haus. In the section of the Bulletin<br />\nJohns Hopkins Playshop for five per- reserved for \"Texts and Documents\"<br />\nformances, starting April 20. It is a reprint of a translation of \"Conpossible that there will also be a tributions to the Microscopic Anatmatinee. \"The Class of '29\" is a omy of the Pancreas\" written in Gerplay of the Federal Theatre project, man by the specialist in 1869 is<br />\nand is widely recognized as one of printed. It is edited, arranged and<br />\nthe best of the entire output of this prefaced by an introductory essay<br />\norganization. The occasion will mark by H. Morrison, M. 0., giving the<br />\npainthe first opportunity for Baltimore complete story of Langerhaus's<br />\npancrethe<br />\nof<br />\ninvestigation<br />\nstaking<br />\nTheatre<br />\nplay, and<br />\nto see a Federal<br />\non<br />\none which should be of interest be- atic ductless glands, with notes<br />\nlife.<br />\nhis<br />\ncause of its timeliness and subject<br />\nThe paper by Langerhaus was<br />\nmatter.<br />\nfor his doctor's degree in<br />\nwritten<br />\nThis play, already in rehearsal,<br />\nand Surgery. It is reproMedicine<br />\nunder the direction of Mrs. Myra<br />\nduced with a facsimile of the origLehr, is the story of the graduating<br />\ninal cover, in both German and the<br />\nclass of an American University<br />\ntranslation in the Bulletin.<br />\nwhich entered the current scene at<br />\nthe outbreak of the depression. The<br />\ntragedies and comedies of their necessary readjustments are brilliantly<br />\nDr. T. Guthrie Speers, pastor of<br />\nportrayed by an author who can<br />\nBrown Memorial Church, will<br />\nthe<br />\nexperience.<br />\nwrite from contemporary<br />\nthe discussion on \"What My<br />\nlead<br />\nThe director of the Federal Theatre,1<br />\nHas Done For Me\"---at<br />\nReligion<br />\nfrom whom permission was obtained<br />\nmeeting of the Fireregular<br />\nthe<br />\nto present the play, has promised to<br />\nat 4:15 tomorrow at<br />\nSessions<br />\nside<br />\nCircularize it throughout the state<br />\nLevering Hall.<br />\nit<br />\nbelieves,<br />\nfor<br />\nMaryland,<br />\nhe<br />\nforms,<br />\nof<br />\nA member of the Levering Hall<br />\na necessary part of every college<br />\nand a trustee of Goucher<br />\nBoard,<br />\nstudent's dramatic experience.<br />\nCollege, Dr. Speers is a frequent<br />\nThe cast which has been assembled<br />\nvisitor to the Hopkins campus,<br />\nfor the play, includes some of the<br />\nand has spoken to various student<br />\nPlayshop's most seasoned veterans.<br />\ngroups at intervals.<br />\nTo be seen, among others, will be<br />\nThe Fireside Sessions are limPatty Singewald, Annette Jurgens,<br />\nited to twenty students and stuElsie Kane, Reardon Fusselbaugh,<br />\ndents interested are asked to sign<br />\nRaymond Abbitt, and Alfred Greenup on the lists posted at the Post<br />\nhood. \"The Class of '29\" is the<br />\nOffice and at the Levering Hall<br />\nmost modern play to be presented<br />\nbulletin boards.<br />\nat the Playshop this season.<br /><br />\nRIGHTS OF WAR<br /><br />\nSees Relation Between Problems Of War And<br />\nSocial Justice<br /><br />\nJ. H. FURST CO.<br /><br />\nCouncil Conducting<br />\nNew Questionnaire<br /><br />\nauxiliary to the Dormitory Activities<br />\nCommittee will be appointed in the<br />\nnear future by Chairman Pinck.<br />\nThose desirous of serving are asked<br />\nto communicate with him.<br /><br />\nPrevious Spring Dances have been<br />\npopular affairs with the 'dormers.<br />\nSeveral years ago one was given on<br />\na floor placed on the campus. The<br />\nusual program is to have the dance<br />\nin the Cumming Room. It will probably be the case this year, too. When<br />\nthe Dance Committee is appointed,<br />\nits first duty will be to extract, as<br />\npainlessly as possible, pledges from<br />\nthe dorm residents to pay a proportionate amount of the expenses. The<br />\ntariff will probably run about a dollar a couple. The fact that the dance's<br />\npresentation is absolutely dependant<br />\nupon the welcome it receives at the<br />\nhands of 'dormers' was made absolutely clear by Pinck.<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br /><br />\nive, if not, why, and whether they<br />\nwould turn in a cheating student.<br /><br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br /><br />\nOther questions concerned opinions on compulsory assemblies and<br />\nJune Week. The statement on the<br />\nlatter was similar to that submitted<br />\nby the June Week Committee to Seniors several weeks ago—how much,<br />\nif any, undergraduates are willing to<br />\nspend on the June Week.<br />\nHershner Cross, president of the<br />\nStudent Council, could not be reached<br />\nto ascertain the reason for this questionnaire.<br /><br />\nWhat you want is easy; to find.<br />\nYou get efficient service.<br />\nPrices are reasonable.<br /><br />\nHUTZLER BIMEIZ sq••<br /><br />\nJanet Gaynor says:<br /><br />\n\"Leading artists of the screen<br />\nprefer Luckies\"<br />\n\"I live at the beach most of the year and<br />\nthere is hardly a weekend that a number of<br />\nfriends don'tdrop in. Naturally,I keepseveral<br />\nbrands of cigarettes on hand for guests, but<br />\nthe Luckies are always the first to disappear.I<br />\nsuppose it's just natural that Luckies would be<br />\nthe favorite brand because most of my friends<br />\nin pictures have discovered that the long hours<br />\nof rehearsing and shooting atthe studio place<br />\nasevere tax on the throat.Leadingartists of the<br />\nscreen prefer Luckies because they are a light<br />\nsmoke that sympathizes with tender throats.\"<br /><br />\nPlayshop To Give<br />\n(Me Class Of '29'<br /><br />\nFEMININE STAR OF DAVID 0.SELZNICK'S<br />\nTECHNICOLOR PRODUCTION OF\"A STAR IS BORN\"<br /><br />\nAn independent survey was made recently<br /><br />\nFireside Session<br /><br />\namong professional men and women --lawyers,<br />\ndoctors,lecturers,scientists, etc. Of those who said<br />\nthey smoke cigarettes, more than 87% stated they<br />\npersonally prefer a light smoke.<br />\nMiss Gaynor verifies the wisdom of this pref.<br />\nerence,and so do other leading artists of the radio,<br />\nstage, screen and opera. Their voices are their<br />\nfortunes. That's why so many of them smoke<br />\nLuckies. You,too, can have the throat protection<br />\nof Luckies — a light smoke, free of certain harsh<br />\nirritants removed by the exclusive process \"It's<br />\nToasted\". Luckies are gentle on the throat.<br /><br />\nTHE FINEST TOBACCOS\"THE CREAM OF THE CROP\"<br /><br />\nA Light Smoke<br />\n\"It's Toasted\" Your Throat Protection<br />\nAGAINST IRRITATION—AGAINST COUGH<br />\nCopyright 1937. The AmerIcli.<br /><br />\nHOMEWOOD, BALTIMORE,<br /><br />\n4<br /><br />\nAPRIL 1, 1937<br /><br />\nLacrosse Team To Face<br />\nThe John Hopkins University<br />\nCity College Of New York<br />\nSpring Schedule -1937<br />\nSaturday At Homewood<br />\nJays Have Three Lettermen<br />\nAvailable For Starting<br />\nPositions<br />\nVISITORS ARE STRONG<br />\nLavender Invaders Hold Victory Over Strong N.<br />\nY. Lacrosse Club<br />\nThe crash of clashing sticks, the<br />\nwhip of whistling passes, and thuds<br />\nof bruising bodies will feature the<br />\n1937 debut of the Johns Hopkins<br />\nhickory handlers in their initial encounter with the Lavender of C. C.<br />\nN. Y. Saturday afternoon at Homewood. This affair will provide a first<br />\nrate proving grounds for the current<br />\nlacrosse edition as the Gotham Club<br />\nrepresents a singularly well-balanced<br />\nten.<br />\nThe Blue Jays, with ten lettermen<br />\navailable for the starting positions,<br />\ntake the field with a veritable powerhouse on both offensive and defensive phases of play. Seven members<br />\nof the varsity have played together<br />\nfor the past three years, and they<br />\nshould coordinate with precise accuracy. Captain Pete Swindell and<br />\nDon Naylor resume their point positions with Johnny Ghinger at first<br />\ndefense. Jim Triplett, Bill Vickers,<br />\nMyra Green and Bill Kenny, all prepschool luminaries, will fill in as<br />\nfirst<br />\nthe<br />\ntroopers<br />\nwhen<br />\nshock<br />\nstringers play out. Dorsey Yearley, Johnny Beeler and Hammer<br />\nHimes are the long-winded Indians who trot incesstantly up and<br />\ndown field at the wings and pivot staCharles Mewtions respectively.<br />\nshaw and Herb Seigal understudy<br />\nthese men. The close-in attack presents Tommy Dukehart, Norm Melvin and Jack Kaufman with Johnny<br />\nKempton, Johnny<br />\nEnders, Billy<br />\nWaters, Frank Buch and Pete BernKahl<br />\nGeorge<br />\nalternating.<br />\nhelm<br />\nguards the nets for the Morrill ma-<br /><br />\nchine, with Ferdy Passano, former<br />\nAll-State from Boys' Latin, in reserve.<br />\nC. C. N. Y. Powerful<br />\nC. C. N. Y. has the best rounded<br />\narray of 'crossmen seen in recent<br />\nyears in Knickerville. George Lenchner and Phil Gottfried stand out visibly on the Lavender attack, supported by Larry Raskin. Its midfield will probably need the most<br />\nwatching, for Curran, Kent and Wienberger are the most consistent and<br />\nskilled of the invading horde. The<br />\nCity College defense is well balanced,<br />\nwith Silverman at the point, Gerbarsky at cover and Block checking<br />\naway at first defenseman.<br />\nThe Homewood group, who invaded New York last year to discolor<br />\nthe Lavender somewhat by a 14-8<br />\ndefeat, are eagerly awaiting the resumption of relations. The visitors<br />\nshowed considerable power in downing a strong New York lacrosse club<br />\nlast week, with the markers at 11-9.<br />\nThis is conclusive evidence that the<br />\noncoming array has players on its<br />\nattacks who can hit the target steadily the first time out. This characterizes a fine lacrosse club.<br /><br />\nHambleton Drills<br />\nTrack Candidates<br />\nDrilling daily since spring vacation, the track and field aspirants are<br />\npreparing for their opening meet<br />\nagainst Swarthmore on April 10.<br />\nCoach Waldo Hambleton is putting his cohorts through conditioning exercises to gradually work them<br />\ninto condition. The speed demons<br />\nand field men are working out and<br />\nshown signs that they will have a<br />\ngood season.<br />\nNeed Field Men<br />\nWith Baetjer, Graziano and other<br />\ncapable dash men back in the fold,<br />\nthe main need for candidates is in the<br />\nfield events.<br />\nConditioning exercises will be held<br />\nthe rest of the week with time trials<br />\nscheduled for the following week.<br /><br />\n\" 24<br />\nMay 1<br />\n\"<br />\n8<br />\n\" 15<br />\n\" 22<br /><br />\nLACROSSE-3 P. M.<br />\nCity College of New York<br />\nBALTIMORE<br />\nDartmouth College<br />\nDartmouth, N. H.<br />\nUniversity of Pennsylvania<br />\nBALTIMORE<br />\nSwarthmore College<br />\nSwarthmore, Pa.<br />\nPrinceton University<br />\nPrinceton, N. J.<br />\nSt. John's College<br />\nBALTIMORE<br />\nU. S. Military Academy<br />\nWest Point, N. Y.<br />\nUniversity of Maryland<br />\nBALTIMORE<br /><br />\nApril 10<br />\n\" 17<br />\n\" 21<br />\n\"23-24<br />\n\" 27<br />\nMay 1<br />\n\"<br />\n8<br />\n\"14-15<br /><br />\nTRACK AND FIELD-3 P. M.<br />\nSwarthmore College<br />\nSwarthmore, Pa.<br />\nHaverford College<br />\nHaverford, Pa.<br />\nWestern Maryland College<br />\nBALTIMORE<br />\nPenn Relays<br />\nPhiladelphia, Pa.<br />\nCatholic University<br />\nWashington, D. C.<br />\nWashington College<br />\nBALTIMORE<br />\nMason-Dixon Conference Meet<br />\nBALTIMORE<br />\nMiddle States Championships<br />\nPhilyadelphia, Pa.<br /><br />\nApril 3<br />\n\" 10<br />\n17<br />\n11<br /><br />\nBASEBALL-3 P. M.<br />\n3 Towson State Teachers<br />\nBALTIMORE<br />\n10 Mount St. Mary's College<br />\nBALTIMORE<br />\n12 Loyola College<br />\nEvergreen, Md.<br />\n16 Drexel Institute<br />\nPhiladelphia, Pa.<br />\n17 Swarthmore College<br />\nv. Swarthmore, Pa.<br />\n21 Western Maryland College<br />\nBALTIMORE<br />\n24 Washington College<br />\nChestertown, Md.<br />\n28 Dickinson College<br />\nCarlisle, Pa.<br />\nMay 1 Haverford College<br />\nHaverford, Pa.<br />\n7 Drew University<br />\nMadison, N. J.<br />\n8 Union College<br />\nSchenectady, N. Y.<br />\n11 Loyola College<br />\nBALTIMORE<br />\nJune Week Alumni<br />\nBALTIMORE<br />\nApril<br /><br />\nSixteen Teams 'Vie Letter Awards<br />\nFor Softball Title<br />\nGames Scheduled For Tuesday, Wednesday, Thursday, Friday Afternoons<br />\nWith sixteen teams competing for<br />\nthe interclass softball title, the<br />\nfourth year of organized play directed by Reuben Baer has gotten<br />\nunder way. The softball league is<br />\ndivided into four divisions, and<br />\ngames are scheduled for Tuesday,<br />\nWednesday, Thursday and Friday<br />\nafternoons at 4:15.<br />\nNames Changed<br />\nAlthough the same teams are competing as in basket ball, the renaming of most squads make it appear<br />\nthere are many newcomers. In the<br />\nTuesday League the Tigers, Nightriders, Tech Hawks and Senior<br />\nMechs will battle for the title. The<br />\nWednesday League contains the<br />\nSenior Gas-Civils, Cardiacs and Nine<br />\nJ's.<br />\nOn Thursdays the See-Ease,<br />\nLiterati, Junior Mechs, and Whirlwinds play. The following day the<br />\nM. J. All-Stars, Cement Mixers, Blue<br />\nBears and Newcomers engage in con<br />\ntests.<br /><br />\n.44<br /><br />\nApril 9<br />\n\" 16<br />\n23<br />\n24<br />\n27<br />\n29<br />\nMay 1<br />\n\"<br />\n4<br />\n6<br />\n8<br />\n11<br />\n14<br /><br />\nTENNIS-3 P. M.<br />\nSwarthmore College<br />\nDuke University<br />\nLehigh University<br />\nLafayette College<br />\nSt. John's College<br />\nWestern Maryland College<br />\nCatholic University<br />\nLoyola College<br />\nSt. John's College<br />\nOpen<br />\nLoyola College<br />\nCollege of William and Mary<br /><br />\nEvergreen, Md.<br />\nWilliamsburg, Va.<br /><br />\nApril 8<br />\n\" 13<br />\n14<br />\n20<br />\n28<br />\nMay 4<br />\n5<br />\n10<br />\n12<br /><br />\nGOLF-3 P. M.<br />\nCornell University<br />\nCollege of Osteopathy<br />\nSwarthmore College.<br />\nHaverford College<br />\nUniversity of Virginia<br />\nLehigh University<br />\nLafayette College<br />\nUniversity of Delaware<br />\nDickinson College<br /><br />\nBALTIMORE<br />\nPhiladelphia, Pa.<br />\nSwarthmore, Pa.<br />\nBALTIMORE<br />\nBALTIMORE<br />\nBethlehem, Pa.<br />\nEaston, Pa.<br />\nBALTIMORE<br />\nCarlisle, Pa.<br /><br />\n44<br /><br />\ndi<br /><br />\n11<br /><br />\nBALTIMORE<br />\nBALTIMORE<br />\nBethlehem, Pa.<br />\nEaston, Pa.<br />\nBALTIMORE<br />\nWestminster, Md.<br />\n(Tentative)<br />\nBALTIMORE<br />\nAnnapolis, Md.<br /><br />\nAt the meeting of the Athletic<br />\nBoard March 19, letters were awarded to those who participated in the<br /><br />\nwinter sports. Six major H's were<br />\ngiven along with fourteen minor H's.<br />\nThose who played in the required<br />\nnumber of games in basket ball were<br />\nCaptain Herb Seigel, Norman Melvin, Earl Cross, Carl Rasin, Harold<br />\nZheutlin<br /><br />\nand Demetrius Traggis.<br />\nThese six athletes received the major<br />\naward.<br /><br />\nEight minor H's were earned by<br />\nmembers of the wrestling team. The<br />\nawards were to Bob Vernon, 118 lb.<br />\nclass; Bob Linthicum, 125 lbs.; Sam<br />\nRosenstein, 135 lbs.; Lincoln Katz,<br />\n145 lbs.; Ed Clautice, 155 lbs.; John<br />\nEdwards, 165 lbs.; Charles Barnett,<br />\n175 lbs., and Bill Lamble, heavyweight.<br />\nIn fencing, Phil Small, Irwin Sherman, Walter Peale, P. Reed, Ross<br />\nand Davis secured the minor H.<br />\nAwards for swimming and handball will be announced later .<br /><br />\n30<br />\nSti<br /><br />\n66 BAFFLES INSIDE<br />\nSTILL9TIME<br /><br />\nFILTER -COOL SMOKE<br /><br />\nto be fitted<br />\nfor a<br /><br />\nDistinctive<br />\nEaster<br />\nSuit<br />\nStyle and workmanship<br />\nconsidered it actually<br />\ncosts LESS at<br /><br />\nJos. Schioss<br />\n&amp; Son<br /><br />\n5 East Lexington St.<br />\n(nowhere else)<br /><br />\nMEDICO<br /><br />\nFILTER PIPE<br />\nSOMETHING WONDIRFUL<br />\nGOES ON INS1111<br /><br />\nMIN<br />\nVIMMUI<br />\nAll SHAPES<br /><br />\n.20ont<br />\nfitie6dey<br />\n6—wratt<br />\nIFINEST<br />\nNH IAN.<br />\nMONEY<br />\nCAN BUY<br />\nWir4,<br />\n31tri IF VALUE<br /><br />\nThis simple appearing yet amazing<br />\nabsorbent filter invention with Cellophane exterior and<br />\ncooling mesh screen<br />\ninterior keepsjuices<br />\nand flakes in Filter<br />\nand out of mouth.<br />\nl'revents tongue<br />\nbite,raw mouth.<br />\nwet heel, had<br />\nodor, frequent<br />\nexpectoration.<br />\nNo breaking<br />\nves<br />\nin<br />\nth.eltame<br />\nmproana<br />\nath<br />\nrp<br />\noa<br />\nmaoL<br />\nfil\".<br /><br />\nALSO CIGARETTE AND CIGAR<br /><br />\nBAFFLES 'BREAK UP<br />\nSMOKE STREAM - FILTER REALLY FILTERS<br /><br />\nstuc<br />\nbly,<br />\nfer<br />\nand<br />\nWe<br />\nrest<br />\nby<br />\nWI<br /><br />\n80<br />\nand<br />\nuat<br />\nTw(<br />\ncla<br />\ntion<br />\nany<br />\ntive<br />\nThe<br /><br />\nVI<br /><br />\ntee,<br />\nwh i<br />\nand<br />\nthe<br />\ned<br /><br />\n1161.12<br /><br />\nin oi<br />\ndew<br />\nday!<br />\nFift<br />\nbalk<br />\ncuss<br /><br />\nCc<br />\nfact<br />\nfavo<br />\nThai<br />\ngrea<br />\nthe I<br />\nsory<br />\nsire<br />\ngle<br />\nCc<br />\nwas<br /><br />\ning<br />\nthe<br />\nOut<br />\nyou<br />\nonly<br />\nsidei<br />\ncone<br />\nvotit<br />\nthe<br />\nSr<br />\nDoni<br />\n\"Ser<br />\ntical<br />\nques<br />\ngrat<br />\nyou<br />\naske<br />\nSyst<br />\ntabu<br />\ncont4<br /><br />\nPr<br />\nSti<br />\n\"Brit<br /><br />\nou'll quid/<br />\nyfind out<br />\nor yourself'<br />\n... that Chesterfields<br />\nare MILDER... that they have a<br />\nmore pleasing TASTE and AROMA<br /><br />\nf<br /><br />\nTh<br />\nPress<br />\nearly<br />\nEvar<br />\nDepz<br />\nFinal<br />\neren(<br />\nDr.<br />\ngardi<br />\ncomr<br />\nRevo<br />\nTh<br />\non E<br />\nstoell<br />\ncomp<br />\nDr. I<br />\nvestij<br />\nmany<br />\nby Cl<br /><br />"}], "field_media_file": [{"target_id": 39094, "display": null, "description": null, "target_type": "file", "target_uuid": "f4c58390-53d9-4f05-b702-4275c2dcc6f1", "url": "http://digital.library.jhu.edu/system/files/2022-03/12772-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12772, "target_type": "node", "target_uuid": "cb455995-b530-46fc-b90f-2db945f0c186", "url": "/node/12772"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "5144e223-6f62-4d1a-9873-a3c48584a1ea"}]}