{"mid": [{"value": 37289}], "uuid": [{"value": "e5730fe0-153d-4a1a-b721-5b7cf3ab09fe"}], "vid": [{"value": 37289}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:03:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13279-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:03:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:03:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXII, No. 3<br />\n<br />\niABOLITION OF<br />\nPADDLING LAUDED<br />\nPaddling Incompatible With<br />\nHopkins Dignity, Says Dean<br />\n<br />\n•<br />\n<br />\n-t‘<br />\n<br />\nDR. HULBURT IS<br />\nAWARDED DEGREE<br />\nDr. Lorrain S. Hulburt,<br />\nProfessor Emeritus of Mathematics at Hopkins, has been<br />\nawarded the honary degree of<br />\nDoctor of Laws by the University of South Dakota.<br />\nDr. Hulburt held his first<br />\nchair in Mathematics at South<br />\nDakota, from 1887 to 1891,<br />\ncoming to Baltimore in 1892.<br />\nFrom 1897 until his retirement<br />\na year ago, Dr. Hulbert was<br />\nCollegiate Professor of Mathematics at this University. The presentation of the degree was made at the commencement exercises of the<br />\nUniversity of South Dakota.<br />\n<br />\nSEVEN BOOKS PRINTED<br />\nBY HOPKINS PRESS<br />\nDoctors Shanks and Willoughby<br />\nAmong Authors to Have<br />\nNew Works Printed<br />\n<br />\nTOSSED PASS<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nSYRACUSE DEFEATS<br />\nFIGHTING JAYS<br />\nPindell's Pass to Houston Gives<br />\nHopkins Touchdown<br />\n<br />\nMany volumes written or edited<br />\nSECOND HALF SCORELESS<br />\nby professors of Johns Hopkins<br />\nUniversity have been printed by the<br />\nSome Disagree, However;<br />\nWhirlwind Aerial Attack of Jays<br />\nJohns Hopkins Press during the<br />\nMourn Loss of Color<br />\nConsistently Gains<br />\nsummer. The titles of these works<br />\nand their authors follow:<br />\nVolume 45—Numbers 2 and<br />\nVaried comment has been excited<br />\nUnleashing a powerful aerial at3 of the Johns Hopkins Union the campus by the abolition of<br />\ntack,<br />\nHopkins held the strong Syraversity Studies in Historical<br />\nthe immemorial custom of paddling<br />\ncuse<br />\nfootball<br />\nmachine to a 21-to-6<br />\nand Political Science.<br />\nfreshmen. From the dean down,<br />\nscore<br />\nat Archbold Stadium SaturThe Department of Justice<br />\nexpression of opinion has been open<br />\nof the United States, by Albert<br />\nday. Ten of the thirty-three Jay<br />\nand decided.<br />\nLangebuttig.<br />\npasses were successfully completed.<br />\nThe Legal Status and FuncDr. Ames said, when approached<br />\nThe team showed.a complete retions of the General Accounton the subject, \"I thoroughly ap- Seniors Nominate<br />\nWatson Pindell, Jay fullback, who<br />\ning Office, by W.F. Willough- forward-passed the pigskin to versal of form over its performance<br />\nprove the new ruling; and am, deClass Officers<br />\nagainst Richmond last week and<br />\nHouston to score Hopkins' only<br />\nby.<br />\nlighted at this action on the part of<br />\nThomas N. Biddison and H.<br />\npoints against Syracuse.<br />\nthe Syracuse aggregation<br />\ngave<br />\nOriental<br />\nStudies,<br />\nedited<br />\nby<br />\nthe Student Council. Paddling gave<br />\nrise to bullying, and I never liked Ridgely Warfield headed the list of<br />\nCyrus Adler and Aaron Emplenty of trouble. Although the<br />\nAlpha Mu Tau •<br />\nto see five men on one. It is<br />\nclass nominations made last •<br />\nber.<br />\nOrange eleven scored their twentynot senior<br />\ngood sportsmanship. Furthermore, Thursday at the first meeting of the<br />\nFlaubert's Youth, by Lewis<br />\nPetitions Board one points in the first half, the final<br />\nthe idea was patterned after fifth year. Biddison and Warfield were<br />\nPiaget Shanks.<br />\nAt the first meeting of the InterThe History and Civiliza- fraternity Board, with Ridgely outcome of the contest was in doubt<br />\nrate colleges and is not commensu- both nominated for the office of<br />\ntion of Ancient Megara, by E. Warfield presiding, the Alpha Mu until the last whistle.<br />\nrate with the dignity of the Univerpresident of the class. The meeting,<br />\nsity.\"<br />\nL. Highbarger.<br />\nTau fraternity submitted its petiJay Passes Next Touchdown<br />\nwhich was held in the C. E. Hall<br />\nShakespearean Character tion for admittance to the Board.<br />\n• Injury to the dignity of Johns<br />\nIn<br />\nthe second quarter a barrage<br />\nimmediately after the first weekly<br />\nInterpretation: The Merchant It was represented by Leonard CovHopkins was the keynote of the<br />\nof Venice, edited by James W. ell, to whom the requirements for of Jay forward passes finally rereply of Joseph G. Blandi, president assembly, was not very well atBright.<br />\nof the Student Council. He also tended. Donald White, Gardner<br />\nadmission were explained. The Al- sulted in a touchdown. Hopkins<br />\nurged that paddling is too old-fash- Mallonee and Randolph Mengers<br />\npha Mu Taus must be represented got possession of the ball on SyraShanks Writes on Flaubert<br />\non<br />\nioned for this institution. He con- were proposed for vice-president.<br />\nthe Board for a period of three cuse's 28-yard line after the home<br />\nDr. Shanks' book on Flaubert is<br />\nyears<br />\nwithout having a vote in any team had attempted two forward<br />\ntinued \"The freshmen who most<br />\nOther nominations were: For one that should interest many Hopdodged the paddling were the most secretary, Dalsemer and McCurley kins undergraduates, due to the fact of the proceedings. After this time passes, both of which were groundeager to inflict it on the frosh when for treasurer, Boynton, Gardiner that Flaubert's works are being their membership will be acknowled by alert Blue Jays. From a kick<br />\ntheir turn came.\"<br />\n.„<br />\nand liarris for sergeant-at-arms, read by classes in French. The edged.<br />\n--qui-a--?as-10<br />\ndiscussion it was de- ormatton,Frosh Not Dependable<br />\nArmor and Hemmeter ; for dele- book deals with -Flaubert's dreams - A tter<br />\nRidgely Warfield, cheer lead- gates to the student council, Biddi- of Romanticism through the me- cided that for the present the week- Boynton that was good for 22 yards.<br />\ntr, Inter-Fraternity Board president, son, Lawrence. White, Boynton, dium of his letters and juvenile ex- ly meetings would continue to be A pass to Lawrence failed, but on<br />\nand student head of the R. O. T. C. Steinwald, Dotterweich, Ham- periences. The book contains the held on Mondays. President War- the next<br />\nplay, Houston, who had reunit, says, \"If the freshmen cooper- burger, Rohr, Bauernschmidt, Mc- first account in English of Flau- field explained several points re- placed Mallonee at left<br />\nend, gathate, I think the plan is very good. Elfresh and Carroll. The senior bert's earliest novel.<br />\ngarding the rushing agreement, aft- ered in a long, 30-yard toss. Lyons<br />\nHowever, in my experience I have class is entitled to two representaThe volume of Oriental Studies er which the session was adjourned. was thrown for a loss. Syracuse at<br />\nfound that freshmen can't be tives on the student council and, edited by Cyrus Adler and Aaron<br />\nThe next meeting will be on Oc- this point was penalized 15 yards<br />\ncounted on for much.\"<br />\nunder the present ruling, the presi- Ember is in commemoration of the tober 10, at 12: 30, in room 106, when Loucks, a substitute back,<br />\nCharles Harris, a senior, made dent of the class will also be a mem- work done by Dr. Paul Haupt at Mechanical Laboratory.<br />\nspoke to a teammate. On the next<br />\nthe following comment: \"Paddling ber, ex-officio, of this body.<br />\nJohns Hopkins.<br />\nplay, a pass from Pindell over the<br />\nIS good for stubborn frosh. Its<br />\nThe work on Ancient Megara is Only Two Veterans<br />\ncenter of the line, was snatched by<br />\nab- \"Nominations for all of these<br />\nsence, however, steadies the college offices will be reopened at the next a very complete account of the deHouston after several players had<br />\nReturn to Rifle Club touched<br />\nand takes away the high school at- senior class meeting on Thursday,\" velopment of one of the most imthe ball, and converted into<br />\nChances for candidates on the a touchdown. Pindell's dropkick<br />\nmosphere. The freshmen seem to said Joseph Blandi, president of the portant of the Greek city-states.<br />\ncooperate in carrying out the regu- student council. This move was de- The author has used ancient tradi- rifle team are exceptionally good went wide.<br />\nseason, according to a statelations.\"<br />\ncided upon in order to give those tions, inscriptions, modern excava- this<br />\nLyons Outpunts Baysinger<br />\nment<br />\nmade by Lieutenant (Wiley,<br />\nMr. E. A. Schall, executive secre- who were not present at the first tion and abundant general archaethe<br />\nJay<br />\nof<br />\nsharpshooters.<br />\nPrevious to Hopkins' scoring, the<br />\ntary of the campus Y. M. C. A., al- meeting a chance ,to make nomina- ological material in reconstructing coach<br />\nBecause of the graduation a playing had been obviously in favor<br />\nthe life of the ancient state.<br />\nthough he lauds the new system, tions.<br />\npractically all of last year's marks- of Syracuse. In an exchange of<br />\nthinks that freshmen regulations are<br />\nmen, a new team must be built punts at the beginning of the game,<br />\ngood. These, however, according FOOT WARMER INTERESTING FEATURE<br />\nBussard and Plummer, who Bobby Lyons had a slight advantage<br />\naround<br />\nto Mr. Schall, should be reduced to<br />\nOF UNIVERSITY FOUNDER'S DESK were regulars of -last season's out- over Baysinger, the Syracuse quara minimum and then strictly endoubtful whether Garis terback. The Orange eleven then<br />\nHidden away in the dark archives entire outside is studded with huge fit. It is<br />\nforced.<br />\nwill return to the team. Last year's started a determined attack from<br />\nMr. Carey Thompson, a former or dusty corners of the campus are bolt heads, an impression of<br />\ncaptain iS now attending medical midfield, which resulted in a touchstudent here, has very definite views<br />\nstrength and solidity thereby being school.<br />\ndown. Brophy added the extra<br />\ninteresting<br />\nrelics<br />\nmany<br />\nfound<br />\nto•<br />\nbe<br />\nOn the subject. \"Absence of the<br />\ngiven which its size belies. The<br />\nAs yet no definite announcement point by means of a dropkick.<br />\nPaddle takes half the joy out of the and antiques, dating from the early<br />\ndoor is lapped over with heavy of the schedule has been made.<br />\nLyons\" Punt Blocked<br />\nfreshman's life. He expects it.\"<br />\nhistory of the University. Some<br />\nbands of steel. There is no com- Lieutenant Offley stated also that<br />\nFollowing<br />\nthis first tally, the ball<br />\nthere are which are known to the<br />\nsuccessful candidates will be awardPh. D. Gives Opinion<br />\nbination lock, and entrance is gained<br />\nseesawed<br />\nback<br />\nand forth until Wied an \"rHt\" as in former years.<br />\n\"Doc\" Adams has no doubts majority of students, but many there<br />\nnick blocked a punt by Lyons and<br />\non the subject. \"Paddling abso- are which remain unnoticed and un- by means of a huge and heavy key<br />\nNewman recovered the ball on the<br />\nwhich fits into a peculiarly curved<br />\nlutely ought to go,\" he said, \"you known.<br />\nBarnstormers to Use<br />\n21-yard line. It took seven line<br />\nAre not sent here to learn to paddle.<br />\nkeyhole.<br />\nMiniature Theater bucks before Syracuse could put the<br />\nPerhaps the most interesting of<br />\nIf you are, you ought to go home<br />\nThe safe was made for the keepand save your money. Some should those in the latter class are the desk ing of record books and ledgers, as<br />\nStage settings and lighting effects ball over for their second score.<br />\ngo anyway; they don't learn any- and safe of Johns Hopkins, the<br />\nfor future Barnstormer productions Brophy's accurate toe again added<br />\nshown by the interior, fitted with a<br />\nthing:,<br />\nwill be visualized in advance by the extra point.<br />\nfounder of the University. These<br />\nlarge number of pigeon holes. Be- means of a miniature theater conLate in the second quarter SyraAn anonymous freshman stand- interesting antiques are to be found<br />\ncuse kicked off, but soon had the<br />\nthese<br />\nneath<br />\nthere<br />\ntwo<br />\nsmall<br />\nare<br />\nthis<br />\nstructed<br />\nsummer.<br />\ning at \"Doc's\" counter expressed in the Trustees' Room,in the ChemThe toy playshop, which was built ball on the 50-yard line and again<br />\nhis willingness to suffer<br />\npaddling ical Laboratory. There they have drawers for cash and smaller books.<br />\nstarted for the Jays' goal line. A<br />\nthis year in order to enjoy the priviA notice on the inside of the door by William B. Banks, art director<br />\nof line plays put the ball on<br />\nseries<br />\nbeen given a conspicuous position<br />\nlege of inflicting<br />\ngives the information that the safe of the campus dramatic organiza- the 17-yard line. Here, on a delayed<br />\nit on frosh next<br />\ntion, is an exact reproduction of the<br />\nyear. Z. Townsend Parks, a fresh- at the head of the long room and are<br />\nwas made by the patentee, Jesse stage of the Lyric Theater.<br />\nforward pass, Barbuti received a<br />\nman, is frankly skeptical of the used as a part of the regular furniDelano, of Water Street, New York. When entirely completed, it will long toss from Baysinger and scurgO04 intentions<br />\nof the sophomores. ture.<br />\nAt the present time the safe holds be furnished with footlights, ried across the line for his second<br />\n'Veil get the paddles, don't you<br />\nwould<br />\nThe<br />\nprobably<br />\nnot<br />\nbe<br />\nsafe<br />\n\"floods,\" back drops, curtains and touchdown. Again Brophy kicked<br />\n\\yorry,', he commented, \"and I inthe minutes of the Trustees.<br />\ngoal.<br />\ngiven much consideration today if it<br />\ntend to use them next<br />\nOur interest is at once gained all the other equipment of a real<br />\nyear.\"<br />\nHopkins then started their vicious<br />\ntheater.<br />\nAfter all, the question is still open were not for its cluster of associa- and held by the large, dark, earlypassing attack, which resulted in<br />\nBy<br />\nthis<br />\nsmall<br />\nof<br />\nmeans<br />\nstage<br />\nit<br />\nto conjecture, because Sergeant tions. It is about three feet high American desk, which Johns Hopwill be possible to experiment with the Jays' only touchdown of the<br />\nFrank says he has not yet made up and made of iron, with a massive<br />\nformerly<br />\nkins<br />\nused in his office. various shades of light and arrange contest.<br />\nhis mind on the subject.<br />\ndoor and heavy iron rollers. The<br />\nminiature scenes.<br />\n(Continued on page 5, column 5)<br />\n(Continued on page 4, column 2)<br />\nBLANDI OF SAME OPINION<br />\n<br />\nf I<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 11, 1927<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nUniversity. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br />\n<br />\nHopkins<br />\n<br />\nUniversity 0100<br />\n<br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nMORTON HAMBURGER, JR., '28<br />\n<br />\nAssistant Managing Editor<br />\nDONALD Hiss, '29<br />\n<br />\nManaging Editor<br />\nNORMAN B. GARDINER, JR., '28<br />\n<br />\nColumnist<br />\nALEXANDER C. WOODS, JR., '28<br />\nAssociate Editors<br />\nGEORGE E. BANKS, JR., '29<br />\nRALPH KIRKLEY, '28<br />\nPHILIP W. NESS, '29<br />\n<br />\nJunior Editors<br />\nRICHARD H. WOOD,'29<br />\nW. PURNELL HALL, JR.„ '30<br />\nROBERT F. SKUTCH, '30<br />\nWILMER H. DRIVER, '29<br />\n<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nA. BERNARD CHANCELLOR, JR., '28<br />\nLEONARD B. NOLLEY, '29<br />\nAARON GOLDSTEIN, '29<br />\nGEORGE GUMP, '30<br />\n<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nSAMUEL M. HECHT,'29<br />\nCirculation Manager<br />\nGEORGE M. GLAZIER. '20<br />\n<br />\nAdvertising Manager<br />\nZANVYL KRIEGER, '28<br />\nAssistant<br />\n<br />\nBusiness<br />\n<br />\nManagers<br />\nJOHN YOUNG,'30<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nPHILIP COWLES,'30<br />\nROBERT MYERS. 29<br />\nALVIN BLUM, '30<br />\n<br />\nDONALD C. WEILLER,'28<br />\nA. H. MORTON,'30<br />\nW. GRAHAM BOYCE, JR., '30<br />\nJOHN LOTZ, '30<br />\nWILLIAM RAFFEL,'30<br />\n<br />\nPHOTOGRAPHIC DEPARTMENT<br />\nManaging Editor<br />\nWILLIAM B. BANKS. '20<br />\n<br />\nStaff Photographer<br />\nVERNON SCHEIDT, '28<br />\nAssistant Photographers<br />\n<br />\nGEORGE R.<br />\n<br />\nWILLIAM S. PIKE,'29<br />\n<br />\nHILL, '29<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by Fleet-MeGinlv. Ttw<br />\n<br />\n\"<br />\n<br />\nCandler Buildin, Baltimore, Md.<br />\n<br />\nNO, THIS ISN'T A JOKE<br />\nFour classes hold their elections this week. Probably eight sets<br />\nof caucuses will be held—or possibly have been held—this week.<br />\nOf course, we realize that it is necessary to have some system in<br />\nselecting the man for whom you are going to vote. When two or<br />\nthree or four equally good men are up for an office, it is so hard<br />\nto decide who is really the best man. Therefore, why not let's<br />\nget together with the Mu Pis and see if we can't get Bill elected<br />\nsecretary? After all, he's 'as good as anybody else, and he is our<br />\nfraternity brother.<br />\nThis line of reasoning is almost irrefutable, now isn't it? If<br />\nBill is just as good as anybody else, and you like Bill a little better<br />\nthan the rest, why not try to get Bill into office? But unfortunately, in many cases, Bill isn't as good as the other fellow, though<br />\nhis followers may not realize it. The second step of the argument<br />\nholds good anyway, and a big combine is formed to insure Bill's<br />\nelection.<br />\nBill is elected. The other crowd cries \"Politics!\" just as loudly<br />\nas Bill's crowd would have yelled if Bill had been defeated. The<br />\nMu Pis slander the Zi Delts for eight months, but Bill is secretary.<br />\nAny exhortation to eliminate politics from student elections<br />\nusually calls forth either snickers or cynicism or utter disregard<br />\nof the exhorter. Is it absolutely impossible for a man to be<br />\nelected_ to office purely on his own qualifications? Or must the<br />\nbartering ability of his friends decide the issue? It usually does.<br />\n<br />\nAN IRRADIATION OF -HIGHER EDUCATION\"<br />\nAn advertisement in the May 28 issue of the Harvard Crimson<br />\nappealed so strongly to our sense,of humor that we have been<br />\ntempted to quote part of it in this column. An enterprising group<br />\nof people, trading under the name \"The College Tutoring Bureau\"<br />\nhas gathered together \"complete, accurate, reliable, well-typed<br />\nreviews and notes\" of most of the popular courses in the university and offers them for sale to those who need preparation for<br />\nthe final examinations.<br />\nThe list includes numerous courses in all departments. For<br />\nexample, one can secure this most invaluable crutch for English<br />\n28, 2, 11b, 33, 29b, 35b, 50b, 73, 41 and 48. Other subjects are not<br />\ncovered quite as exhaustively, but the assortment is ample. Some<br />\ncourses come under the general heading of the advertisement, but<br />\nothers are favored with a more detailed blurb. Students taking<br />\n\"Psychology A,\"for example, could secure \"a complete outline<br />\nof text-book and all lectures.\" And as an added. inducement:<br />\n\"a short, snappy outline of the Essential Rules of German Grammar given away without charge\" to German A students.<br />\nNo wonder Brother Mencken rants against the colleges! Maybe<br />\nthe only reason why nobody has tried out this admirable method<br />\nof'making money here at Hopkins is that the undergraduate body<br />\nis too small to make the venture worth while. Nevertheless, such<br />\n• organizations as \"The College Tutoring Bureau\" strike us as being<br />\nvery forceful arguments for the New Plan.<br />\n<br />\nThe Geneva School of<br />\nInternational Studies<br />\n<br />\nTHREE to FIVE MINUTES<br />\nto FORTY THEATRES<br />\nAND AllSHOPS<br />\n<br />\nHOTEL<br />\nBy LEON SACHS<br />\n<br />\n• s<br />\nfiAmE<br />\n<br />\nTIMES SQUARE<br />\nNEW YORK CITY<br />\ntary Union and Noble Prize Winjust di Broadway&<br />\nner; Professor Andre Siegfried<br />\n1 Sr<br />\n'<br />\n109-13wEsT45'<br />\n(France), of the Ecole des SciSend pastalfor<br />\nA9tes &Booklet<br />\nences Politiques; Lord Meston and<br />\nW. yOHNSON QUM<br />\nSir John F. Williams (Great BritPrenxiatt<br />\nain); Paul Mantoux (France),<br />\nand Professor Wm. Rappard<br />\n(Switzerland). Among the noted<br />\nAmerican lecturers were Professors<br />\nIrving Fisher of Yale and E. R. A.<br />\nSeligman of Columbia. In the two<br />\npreceding years lectures were delivered by Viscount Cecil, Dr. Edward<br />\nBenes, Paul Hymans, Manley 0.<br />\nHudson, and Gilbert Murray.<br />\nIn passing, it might be of interest<br />\nto note that Professors Zimmern,<br />\nWe are Agents for the<br />\nJaeckh, Siegfried, and Mantoux<br />\nCORONA, ROYAL,<br />\nhave recently lectured at Johns<br />\nUNDERWOOD & REMINGTON<br />\nHopkins.<br />\n<br />\nIn the spring of 1924, representatives of various European national<br />\nstudent organizations, while meeting in Prague to form the Federaion Universitaire Internationale (F.<br />\nU. I.), called upon their honorary<br />\npresident, Professor Alfred Zimmern, to undertake the establishment of some international educational center from which might emanate a better understanding of international affairs, cultures, and<br />\npeoples. The task was begun, and<br />\nin the summer of 1925 Professor<br />\nZimmern established in Geneva<br />\nwhat is at present known as The<br />\nGeneva School of International<br />\nStudies. The school, holding summer sessions in French and English,<br />\nis largely supported by voluntary<br />\nPORTABLES<br />\nIII<br />\nsubscriptions and endowments, parThe personnel and variety of the<br />\nticularly from America. Mr. Owen<br />\nbody infatuates one who<br />\nstudent<br />\nWe can. furnish them in the<br />\nD. Young, known to every Hopkins<br />\nwithin<br />\ncouped<br />\nhas<br />\nbeen<br />\nheretofore<br />\nCIIEMICAL, ENGINEERING<br />\nwith<br />\nman because of his association<br />\nnationalistic<br />\nboundaries—however<br />\nor any other keyboard you may desire.<br />\nthe Page School, was designated as<br />\nhead of the American General Com- spacious. Although the vast maAmerimittee. Thus the Geneva School, jority of the students are<br />\nCall or Phone us.<br />\nnationsprouting originally from student cans, yet the tinges of other<br />\nthat is<br />\nminds, dominated and directed by. alities offer a human hue<br />\nM. W. LUCY 8r,. CO.<br />\npast<br />\nthe<br />\nDuring<br />\nstriking.<br />\nindeed<br />\nmature international intellects, has<br />\n104 W. Fayette St.<br />\nevery state, Calvert 5902<br />\nexpanded to such a degree of im- summer, practically<br />\nof China and<br />\n\"30 Years in the Business\"<br />\nportance that today it enjoys the with the exception<br />\ncause<br />\nThe<br />\nwas<br />\nrepresented.<br />\nJapan,<br />\ndistinction of being officially recogattributed to the absence of these<br />\nnized by the International Comirjt,<br />\noriental represtrital'ives-iTtiirliuge<br />\ntee on Intellectual Cooperation<br />\ndistance and expense involved in<br />\nCAR largest-selling<br />\nThe twofold design of the school,<br />\nquality pencil<br />\nthe<br />\nreiterate,<br />\nto<br />\nHowever,<br />\ntravel.<br />\nnamely, to train leaders in internain the world<br />\nof the representation<br />\ntional affairs, and to produce an en- diversity<br />\nstrikes one immediately. Czechs<br />\nlightened public opinion, manifests<br />\nPoles, Germans and French,<br />\nand<br />\nitself in the type and variety of lec17<br />\nRussians and Americans, Englishtures that are given. During the<br />\nblack<br />\nmen and Indians—all sit side by degrees Superlative in quality,<br />\nfirst month the emphasis is laid on<br />\neither in delight or embarrassside<br />\nthe world-famous<br />\nnational tendencies and on the<br />\n3<br />\ntheir<br />\nof<br />\nas the virtues or vices<br />\nforces making for diversity. Lec- ment,<br />\ncoining<br />\ncountries are expounded<br />\nrespective<br />\ntures are given on the geographical,<br />\nAt an<br />\nlecturer.<br />\ndealers<br />\nracial, social and economic factors by the<br />\nAn Indian, Welshman and Ameraffecting international relations, on<br />\nBuy give best service and<br />\nassociate<br />\ncan<br />\nexample,<br />\nfor<br />\nican,<br />\nlongest wear.<br />\na<br />\nthe foreign policies of the principal<br />\nPlain ends,per doz.<br />\n$1.00<br />\nfor<br />\nreadily,<br />\nvery<br />\nanother<br />\none<br />\nwith<br />\ndozen<br />\nRubberends,per doz.<br />\n1.20<br />\nworld powers, and on the culture<br />\nground between American Pencil Co., 215 Fifth Ave.,N.Y.<br />\ncommon<br />\na<br />\nis<br />\nthere<br />\nothers.<br />\nmany<br />\nof<br />\ninstitutions<br />\nand<br />\nMakersofUNIQUEThin Lead<br />\nDuring the second month, the em- them—the same language. How- Colored Pencib in 12 colors—$1.00 per doz.<br />\nphasis is laid on international ten- ever, what of the Germans, Poles<br />\nand Italians? Unless the three hapdencies and on the forces making<br />\npen to know either German, Polish<br />\nfor cooperation. The principal top- or Italian (which case is unlikely)<br />\nics treated are those concerning the they must resort to French. French<br />\nLeague of Nations, International is the international language, and is<br />\nLaw and Custom, and the various the medium by means of which<br />\nmany possiblle dilemmas are avertinternational tribunals such as the<br />\nNearly every student at the<br />\ned.<br />\nWorld Court and the Hague Court<br />\nSchool knows a bit of French at<br />\nof Arbitration.<br />\nleast, and even if one does not enter<br />\ninto a conversation with one's alien<br />\nII<br />\nbrother, there is a congenial bon<br />\nThe student at the school is par- jour at any rate. The American<br />\nticularly impressed with the savants students, as a group, inspired no<br />\nwhom Professor Zimmern brings doubt by 'their hereditary aloofness<br />\nto Geneva to lecture. During the from foreign entanglements, know<br />\npast summer, the list of lecturers less French than any other national<br />\nincluded such distinguished person- group—and what is even more<br />\nages as: Senator De Brouckere smiting—they don't care. The fibre<br />\n(Belgium), Belgian delegate to the lined American note could speak<br />\nLeague of Nations Assembly (1926 better French than twenty Poles.<br />\nHowever, this association of stuand 1927) ; Dame Rachel Crowdy<br />\n(Great Britain), chief of the Social dents, devoid of its humor, has realWelfare Section of the League; Mr. ly instructive and enlightening conJules Destree (Belgium), member sequences. To hear a Frenchman<br />\nof the International Committee on and a German amicably argue the<br />\nIntellectual Cooperation'; Professor question of Rhine forces is much<br />\nLouis Eisenman (France), of the more instructive than a hundred<br />\nSorbonne ; Professor Giuseppe Gal- newspaper editorials. \"To see how<br />\nCathedral and<br />\nlivresi (Italy), of the University of the other half lives,\" to understand<br />\nMilan; Dr. Ernest Jaeckh (Ger- and sympathize are treasures which<br />\nMadison Streets<br />\nmany), of the Hochschule fiir Poli- each and every student carrie5_ away<br />\nik ; Dr. Christian Lange (Norway), from the Geneva School. InternaSecretary of the Inter-Parliamen- tional goodwill is the aftermath.<br />\n<br />\nTYPEWRITERS<br />\n<br />\nse<br />\n<br />\nhi<br />\nqi<br />\n<br />\nfo<br />\ndt<br />\n<br />\nbe<br />\nto<br />\ngi<br />\n<br />\nhi<br />\nge<br />\n<br />\nof<br />\nto<br />\n<br />\nali<br />\ntu<br />\nci<br />\nft<br />\n<br />\ntn(I<br />\no<br />\nc<br />\n<br />\nof<br />\n<br />\nas<br />\ndi<br />\n<br />\nrn<br />\n<br />\nlo<br />\nSi<br />\n11<br />\nci<br />\n<br />\nti<br />\n<br />\nt<br />\nf<br />\nc(<br />\n<br />\na<br />\n<br />\n\f- •.<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br />\n<br />\nMAIL<br />\n<br />\nIt<br />\n<br />\nAG<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n<br />\nCarl J. Doederlein<br />\nDIAMONDS<br />\n<br />\nSTE1 SON<br />\nHAI S<br />\n<br />\nMfrs. of Fraternity Goods of All Kinds<br />\n504 PARK BANK BUILDING<br />\n<br />\nADVICE TO FROSH<br />\n<br />\n'<br />\n<br />\nTo The Editor of the News-Letter.<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\n)N<br />\n<br />\nire.<br />\n<br />\n).<br />\nSt.<br />\n<br />\n19<br />\n<br />\n11<br />\n<br />\nDear Sir :.<br />\n<br />\n(Lexington at Liberty Sts.)<br />\nA rather unusual result of a survey, recently conducted at PrinceAdvance Showing of<br />\nton, on the number of men working<br />\ntheir way through the university ,t1<br />\n)<br />\nshows that the majority of these<br />\nstudents are graduates of preparaoa<br />\nb<br />\nfor FALL<br />\ntory schools rather than public<br />\nschools.<br />\n$292& $34.50<br />\n<br />\ntet5on (M*5<br />\n<br />\nFreshmen, counsel among yourselves. Your ways lie far before<br />\nYOU. Your future is your own.<br />\nYou are entering a new phase of<br />\n* * * * *<br />\nlife, a new era to which you will reFor the new seaquire adapting. Take heed to the<br />\nson we have asAnother of our universities has sembled<br />\nthe finest<br />\nfollowing advice and carry on your joined the ranks of the other educa- variety of men's<br />\nsuits it has ever<br />\nduty with the spirit of men who will<br />\ntional institutions who have forbid- been our privilege<br />\nbe outstanding figures in the years<br />\nden the use of automobiles to stu- to present. Styles<br />\nfounded on careto come. Among you is one who<br />\ndents. Wesleyan University has is- ful study of the<br />\nfashion trend as<br />\nWill lead you far on the paths of<br />\nsued an edict prohibiting sopho- indicated by the<br />\nglory, propound your cause to the mores<br />\nand freshmen from using best dressed men<br />\na this country<br />\nhighest court, and make himself cars and allowing only those<br />\njuniors and Europe. These<br />\ngenerally worthy of the conferred and seniors to do so who are given patterns will be<br />\noffered for your<br />\nname of President. There is one written permission by their parents. approval<br />\nas well<br />\nof you -fitted to hold each office open The only remaining alternative as a complete line<br />\nof toPcoats,overto the election. Go to the polls seems to be bicycles or airplanes. coats,<br />\nand our<br />\nspecially<br />\npriced<br />\najive to the responsibility of the fu* *<br />\n* *<br />\ntuxedo at $34.50.<br />\nture and with the interest of your<br />\nCarnegie Tech still maintains a<br />\nClass at heart.<br />\nAT 22 S. HOWARD ST.<br />\nunique tradition—a survivor of past<br />\nYou :have a great many good days when first year men were freshfriends; we all have, but have they men. All frosh must be cleansed \"Nationally<br />\n\"Justly<br />\nthe qualities of leadership that are<br />\nFamous<br />\nKnown\"<br />\nof past juvenile sins. The procenecessary for the holding of these dure is carried out by the use of<br />\noffices? Are they men of charac- copious quantities of water upon<br />\nBaltimore<br />\nter; leaders? Have they that degree the pajama clad yearlings in front<br />\nof stick-to-itiveness that would of the girl's dormitory.<br />\nclassify them as workers? Judge<br />\n* *<br />\n* *<br />\nas men; size up your classmate candidates and mentally contrast their<br />\nIn connection with the passing of<br />\ngood points. Balance their merits<br />\nfreshman regulations and traditions<br />\nwith their faults and choose your<br />\nman, not because he is a \"good fel- which are gradually being cast into<br />\nlow\" or a smooth talker, but because discard by many universities and<br />\nyou know by process of sane rea- colleges, as is being gradually exsoning and heartfelt interest that perienced by Hopkins, the school<br />\nhe is the right person to lead and<br />\npaper Rensellaer Polytechnic has enchampion the class of '31.<br />\ntered an urgent appeal for assist-duce.<br />\nThey claim that the most<br />\nR.\\\\. F.<br />\nessential experiences of college life<br />\nare being lost and implore an immediate reverting to the old regulaNAIVE IF NOTHING ELSE<br />\ntions.<br />\nTo the Editor of the News-Letter—<br />\n* * *<br />\nDear Sir:<br />\n<br />\n3<br />\n<br />\neltyied<br />\noryoung Xen<br />\nj<br />\n<br />\nA<br />\n<br />\nuthorities in dress are directing men's attention a little more toward formal shapes in soft<br />\nhats. The new Stetsons of this type are particularly smart and becoming; and are, of course,<br />\nhand-blocked to Stetson quality standards.<br />\nEight Dollars and up<br />\n<br />\nTaking,theguess<br />\nOut(1GAS<br />\n<br />\nInsufficient enrollment has resulted in the cancellation of the proposed round the world cruise in the<br />\nco-educational \"floating university,\"<br />\nthe Aurania. A total of only 214<br />\nstudents had registered. A. J. McIntosh, in charge of the cruise for<br />\nthis year, reiterates, however, his<br />\nbelief in the feasibility of co-education.<br />\n<br />\nWe freshmen are wearing green<br />\nties this year. We freshmen are<br />\nwearing black socks this year. And<br />\nthis year we freshmen are wearing<br />\nfreshmen buttons. Which, of<br />\ncourse, is all good and proper. We<br />\nwear these things so people will<br />\nknow we are freshmen. Upperclassmen probably think that people could tell that anyway, but<br />\nWe know that unless the actual<br />\nfreshmen are somehow distinguishThe time may come perhaps in<br />\ned the layman would consider sophomores freshmen; i. c., people who this day of splurges for higher eduare fresh should be called fresh- cation and better pupils when only<br />\nmen.<br />\nmarried students will be admitted<br />\nGreen ties on the campus are into our institutions of learning.<br />\nquite the thing. Very stylish and a Statistics compiled at the Univermark of respect. The professors sity of California show the grades<br />\nlook up to us because of it, you of married students to be superior<br />\nknow. But off the campus, a green to those of the unmarried.<br />\ntie becomes an eccentricity. An example of this occurred the other<br />\nday to the writer. Three female<br />\nDr. Harvey W. Wiley, an eminent<br />\nscholars from Western High School<br />\nauthority<br />\non education, has recently<br />\naccosted me one day as I was peacefully walking homeward. The mere come to the support of the smaller<br />\nfact that they were total strangers colleges. He praises their educato me did not deter them from tional value to the student<br />\nas being<br />\nmanifesting an interest in my ap- of far more worth than anything<br />\nthe<br />\npearance, or rather my tie's appear- big colleges and universities<br />\nmay<br />\nance. In fact, they liked my tie so<br />\nmuch that they offered to buy it. offer. There seems to be some conThey were told in reply that any solation for us small boys even if we<br />\noffer would be considered after the can't win football games.<br />\nChristmas holidays.<br />\nThat is the way it goes. UpperLiberal policies in teaching again<br />\nclassmen must be humored, so we<br />\ncome<br />\nto the front with a recent<br />\nhumor them with our green ties,<br />\ns_isacks, et al. We shall consider to action by Harvard University in redo so<br />\nuntil the freshmen have con- ducing classroom work from 29<br />\nclusively beaten the sophomore class weeks to 23 weeks during the year.<br />\nfootball, baseball, track, class The student<br />\nis expected to devote<br />\nrush, or what<br />\nhis time during those six weeks to<br />\nhave you?<br />\nR. T. C. • individual research.<br />\n<br />\nCIENTIFIC research is one important method<br />\nadopted by the gas industry to bring about universal use of gas for industrial heating purposes.<br />\n<br />\nS<br />\n<br />\nScientific study is being pursued at such institutions as the University of Illinois, University of<br />\nMichigan, Johns Hopkins, Massachusetts Institute<br />\nof Technology, American Institute of Baking,<br />\nAmerican Gas. Association testing laboratory, and<br />\nin many other institutions, besides the laboratories<br />\nmaintained by individual gas companies.<br />\nScience takes nothing for granted. The gas<br />\nindustry believes that its product will eventually<br />\nserve for every heat needed, and the purpose of all<br />\nthis investigation is to bring about the universal use<br />\nof gas in the most assured manner with the least<br />\npossible loss of time.<br />\nIndustrial concerns in all lines of business should<br />\nkeep themselves informed on the recent adaptation<br />\nof gas to their own industries.<br />\nWrite to your gas company for information, or to<br />\n<br />\nAmerican Gas Association<br />\n420 Lexington Avenue, New York City<br />\n<br />\nYOU CAN DO IT BETTER WITH GAS<br />\n<br />\nA<br />\n<br />\nA<br />\n<br />\nL.<br />\n<br />\nA<br />\n<br />\nAh<br />\n<br />\nAL<br />\nElk=<br />\n<br />\niira:11111111111111111::11<br />\n<br />\nA<br />\n<br />\nA<br />\nI.'<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br />\n<br />\n4<br />\n<br />\nSpeaking of Sports SYRACUSE DEFEATS<br />\nFIGHTING JAY ELEVEN<br />\nThe Iron Men of Brown last Sat-<br />\n<br />\nHome—HO. 2095-J<br />\n<br />\nPlione, CAL 1380<br />\n<br />\nFRANCES T. BANNON<br />\n<br />\nSuccessor to HARBAUGH & BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\ndefeat<br />\ncolumn<br />\n5)<br />\npage<br />\n1,<br />\nfirst<br />\n(Continued<br />\nfrom<br />\ntheir<br />\nurday suffered<br />\nStenographic Dictation, Copying,<br />\nsince Tuss McLanghry became<br />\nMultigraphing, Mimeographing<br />\nWith the opening of the second<br />\nBaltimore, Md.<br />\nmentor of the Providence team last half, Hopkins resumed its vigorous<br />\n<br />\nyear—in fact, since Harvard beat<br />\nFur<br />\nthe Brownians in 1925.<br />\nYoung's eleven representing the<br />\nUniversity of Pennsylvania did the<br />\ntrick in a terrific battle, the final<br />\nscore reading Penn, 14; Brown, 6.<br />\nBrown was a favorite, and only<br />\na few dared back the inexperienced<br />\nPenn eleven. Even at the end of<br />\nthe first half, according to reports,<br />\nthe Penn followers were hoping at<br />\nthe best for a tie score.<br />\nThe turning point of the game<br />\ncame in the third period, however.<br />\nWith Brown in possession of the<br />\nball on their own 23-yard line, Ray<br />\nRandall, Brownian quarterback and<br />\none of last year's Iron Men, called<br />\nfor a forward pass from a kick formation. Paul Scull, of Penn, who<br />\nhappened, incidentally, to be the<br />\nstar of the afternoon, intercepted<br />\nthe attempted pass and ran for a<br />\ntouchdown.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nRumor has it that the Brownian<br />\nbackers claim that the weather conditions caused the Iron Men to become rusty between the halves.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nYale received an unpleasant surprise last week-end in the form of<br />\nthe University of Georgia. What<br />\nwas expected by the Eli team to be<br />\na rather difficult work-out turned<br />\nout to be a tragedy. Georgia won<br />\nits first football game from Yale,<br />\n14-10.<br />\nThe Blue team outplayed the<br />\nSoutherners in every phase of the<br />\ngame, except in supplying the final<br />\npunch, earning twelve first downs<br />\nto Georgia's five. Fumbles at crucial moments were instrumental in<br />\nYale's defeat.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nattack and clearly outplayed their<br />\nopponents. Not only were the Syracuse players held scoreless, but at<br />\nonly one time did they seriously<br />\nthreaten. This threat came near the<br />\nend of the third quarter, when Baysinger intercepted Lyons' pass, putting Syracuse in Hopkins territory.<br />\nA kicking duel developed between<br />\nLyons and Baysinger during this<br />\nperiod. Lyons' punts were almost<br />\nperfect and on every exchange Hopkins gained ground.<br />\n<br />\nGood enough<br />\n<br />\nA. H. FETT1NG<br />\nMANUFACTUR LNG JEWELRY<br />\nCO.<br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n213 N. LIBERTY STREET<br />\n<br />\nfor Dad—<br />\ngood enough<br />\nfor you<br />\n<br />\nA<br />\n<br />\nYELLOW CAB STAND<br />\nAT<br />\n<br />\nHOMEWOOD FIELD<br />\n<br />\nCaplan Intercepts Pass<br />\n<br />\nImmediately after the start of the<br />\nfourth quarter, Caplan thrilled the<br />\nstands by intercepting a forward<br />\npass on his own 10-yard line and<br />\nracing 30 yards before he was<br />\nfinally downed by an Orange tackler.<br />\nTwo incompleted passes forced<br />\nHopkins to punt, but Manning fumbled and recovered on Syracuse's<br />\n30-yard line. A varied and bewildering attack, consisting mainly of<br />\nforward passes, brought Hopkins to<br />\nthe 8-yard line and gave the Jays<br />\na first down. Hopkins now changed<br />\nits tactics and resorted to line<br />\nplunges. After coming within one<br />\nyard of the Syracuse goal, the<br />\nOrange line held. Baysinger punted<br />\nfrom behind his line into safe territory. Again the Jays began a determined march on the Syracuse goal,<br />\nonly to be cut short by an intercepted forward pass on the 15-yard<br />\nline. Syracuse again kicked out of<br />\ndanger to end the contest.<br />\n<br />\nNo Charge for Extra Passengers<br />\n<br />\nots do gei More<br />\nMileage fro<br />\n<br />\n'PHONE<br />\n<br />\nVERNON 1212<br />\nFOR A<br />\n<br />\nYELLOW CAB<br />\n<br />\nMILES OFMILES<br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br />\n<br />\nBETHOLINE<br />\n<br />\n17<br />\n<br />\n\"THE WONDER MOTOR FUEIr<br />\n<br />\nAn injury to his arm forced Mallonee to retire from the game in the<br />\nsecond quarter. Houston, who replaced the Jay captain, showed alertness in handling Pindell's pass. At<br />\nleast three players had touched the<br />\nball before Houston grabbed it out<br />\nof the air.<br />\n<br />\n_<br />\n<br />\nPindell looked very good ill his<br />\nwork of backing up the line. Baysinger was the star for the Salt City<br />\n<br />\n•<br />\n<br />\n*.•<br />\n<br />\noutfit.<br />\n<br />\nGiving a remarkable demonstration of the Knute Rockne type of<br />\nfootball, Purdue downed Harvard<br />\nSaturday, by the score of 19 to 0.<br />\nRalph Welch, substituting for<br />\nCotten Wilcox,the star of the Western team, was the outstanding performer of the game. His punting,<br />\npassing, interference and defensive<br />\nplay were almost perfect, and the<br />\nCrimson eleven, who were considered the likely victor provided Wil.cox did not play, never had a<br />\nchance.<br />\n<br />\nRichmond, which gave the Jays<br />\nplenty of trouble during the humid<br />\nafternoon of opening day, took a<br />\nterrible walloping at the hands<br />\nof Cornell. The Spiders were<br />\nswamped, 58 to 0.<br />\n<br />\nFuture opponents of the Jays experienced unsuccessful afternoons,<br />\nwith the exception of Columbia and<br />\nSt. John's. North Carolina defeated Maryland, 7 to 6; Catholic<br />\n* * * * *<br />\nUniversity downed Loyola, 19 to<br />\nPurdue nearly ran up the score 12, and Ursinus gained a 7-to-0 verstill higher. When the final whistle dict over Delaware. Haverford lost<br />\nblew the Western team had the ball to Amherst, 14 to 0. St. John's<br />\ndrubbed Gallaudet, 20 to 0, and<br />\non Harvard's three-yard line.<br />\nWesleyan fell before Columbia, 28<br />\n* * * *<br />\nto O.<br />\n<br />\nMaryland tasted defeat for the<br />\nfirst time this season, North Carolina nosing the Terrapins out by the<br />\nscore of 7 to 6. The field was turned<br />\ninto a literal quagmire by the rain,<br />\nreports stated, making play almost<br />\nimpossible.<br />\nThe Old Liners, evidently, clearly<br />\noutplayed the North Carolina team,<br />\nhaving the ball in the Southerners'<br />\nterritory throughout the majority of<br />\nthe second half.<br />\n*<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nThis defeat eliminates Maryland<br />\nfrom any chance of winning the<br />\nSouthern Conference title. Boasting of one of the best teams to ever<br />\nrepresent the College Park institution, it was expected that Maryland<br />\nwould go fa,in the Conference this<br />\nseason.<br />\n<br />\n........,<br />\n<br />\n\"..<br />\n.0',<br />\n<br />\nf<br />\n------...<br />\n<br />\n- 4...,L05-1114:<br />\n<br />\nUndiscovered<br />\n<br />\ncountry<br />\nin industry<br />\n<br />\nLine-up and score:<br />\nSYRACUSE<br />\nJOHNS HOPKINS<br />\nRaymond ......L. E.(Capt.) Mallonee<br />\nVan-Ness ......L. T... ..Liebensperger<br />\nBrophy .<br />\n..L. G.. ......Kaufman<br />\nPowell<br />\nNicolello .....Center<br />\nNewman,<br />\nKegan<br />\nR G<br />\nWinick<br />\nBiddison<br />\nR T<br />\nLewis<br />\nR. E<br />\nBoynton<br />\nQ B<br />\nBaysinger<br />\nLyons<br />\nGoldman<br />\nCaplan<br />\nL H<br />\nSebo<br />\nR H<br />\nLawrence<br />\nBarbuti (Capt.) F. B.. ...<br />\n. Pindell<br />\nSyracuse ...<br />\n... .7 14 0 0-21<br />\nHopkins<br />\n0 6 0 0— 6<br />\nTouchdowns—Goldman, Barbuti 2,<br />\nHouston. Point after touchdown—<br />\nBrophy 3. Substitutions—For Syracuse, Henward for Goldman, Loucks<br />\nfor Henward, Taylor for Van Ness,<br />\nHenward for Loucks, Manning for<br />\nHenward, Richtmeyer for Raymond,<br />\nGoldman for Manning, Bizik for Sebo,<br />\nKapp for Brophy; Johns Hopkins,<br />\nBoyd for Powell, Houston for Mallonee. Referee—K. Dollenbeck, Pitt.<br />\nUmpire—A. W. Risley. Linesman—<br />\nH. E. Whiteside, Chicago. Time of<br />\nperiods—Fifteen minutes.<br />\n<br />\n101<br />\n<br />\n,<br />\n.....,..,..2....„....<br />\n..,......\":\"..;',Iltlii;\\1<br />\n4<br />\n<br />\nTHE globe's surface no longer 40's and 50's, charting the probable<br />\nholds much undiscovered country, trend of population and the requirebut the pioneer-minded man can still ments for service.<br />\nIn research and development, and<br />\nfind plenty of it in industry—particin telephone manufacture as well, the<br />\nularly in the telephone industry.<br />\nIn the Bell telephone companies Bell System takes seriously its responthroughout the entire country, men sibility to give adequate service now<br />\nare now exploring the 1930's and and to gird itself for a long future.<br />\n<br />\nBELL SYSTEM<br />\n<br />\nA nation-wide system gf i 8,000,000 inter-connecting telephones<br />\n<br />\n\"OUR<br />\n<br />\nPIONEERING<br />\n<br />\nWORK<br />\n<br />\nHAS<br />\n<br />\nJUST<br />\n<br />\nBEGUN\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br />\n<br />\n)<br />\nc4<br />\n'<br />\nc A1<br />\nelvett)JireProor<br />\nBONAIRATANDERBILT Hotelat Augusta, Georgia<br />\nA.E.MARTIN,Manager<br />\nAN IDEAL CHOICE<br />\nFOR THE<br />\nCHRISTMAS HOLIDAYS<br />\n<br />\nGoy—Tennix—ilfotoring<br />\nRiding—Shooting<br />\n<br />\nA<br />\n<br />\nRRANGE with your relatives and friends to pass<br />\nyour Christmas vacation Days at this famous center<br />\nof social and sports activities in the \"Sunny South\".<br />\nThe hotel has 400 delightful rooms with private baths<br />\nand every modern convenience for its guests. Vita glass,<br />\nadmitting the full benefit of the sun's ultra-violet rays, has<br />\nbeen made a feature of the Solarium.<br />\n<br />\nTWO 18-HOLE CHAMPIONSHIP GOLF COURSES<br />\nGrass Greene<br />\nCR A SS greens now on both grass tees and grass greens. A<br />\n\"J<br />\ne courses.The Hill Course,under the supervision of Donald<br />\nRoss, has now been lengthened<br />\nto 6,500 yards and equipped with<br />\n<br />\ncomplete water system on the<br />\nHill Course and the Lake Course<br />\ninsures perfect turf on all<br />\nfairways.<br />\n<br />\nThrough compartments and Pullman cars daily New York to Augusta.<br />\nThrough Pullman service from Chicago.<br />\n<br />\nThe New Fireproof<br />\nCHAMBERLAIN-VANDERBILT HOTEL<br />\nOld Point Contiort, Virginia<br />\nroof garden, large convention hall.<br />\n<br />\nApril 1, 1928 this new hotel will open<br />\nas an all - the-year Tourist Hotel.<br />\nOperated on the American Plan,<br />\nIt contains 300 bedrooms and bathrooms; an indoor swimming pool,<br />\n<br />\nThere you will find good fishing; seabathing; the Hampton Roads Golf<br />\nClub within 10 minutes; horseback<br />\nriding; tennis and shooting.<br />\n<br />\nCHURCHES TO FETE<br />\nVISITING STUDENTS<br />\nNeighboring Congregations<br />\nTo Give Dinner<br />\n<br />\nOLD DESK NOW IN C. L.<br />\nFIELD CLUB PAYS<br />\nVISIT TO ANT NESTS<br />\nAnt nests at Beltsville, about<br />\nthirty or forty miles from<br />\nBaltimore, were the objective<br />\nof the Field Club on their first<br />\ntrip of the year, last Saturday.<br />\nAccording to Mr. Light, secretary of the organization, a<br />\nnumber of trips will follow,<br />\nplans for which have not yet<br />\nbeen definitely formulated.<br />\n<br />\nChurches in the vicinity of Hopkins will give a dinner to out-oftown students of the University<br />\nThursday at six-thirty. This dinner, which will be held at the University Baptist Church, replaces the<br />\nannual reception of former years.<br />\nDr. John C. French will act as<br />\ntoastmaster and Dr. J. M. T. Fin- Rifle Team Needs<br />\nney, prominent Baltimore surgeon,<br />\nCandidates Badly<br />\nwill be the principal speaker. The<br />\nWith but one letter man back this<br />\ncommittee of arrangements for this<br />\naffair includes the Reverend H. N. year, the rifle team is at present in<br />\nArrowsmith, Lewis C. Moon and E.<br />\ndire straits for new men. An enA. Schaal.<br />\ntirely new team has to be built up<br />\nStudents Reception Saturday<br />\nThe annual International Stu- around Captain Bussard, and unless<br />\ndents' Reception will take place on<br />\nfrom<br />\nSaturday evening at the Friends promising material develops<br />\nof<br />\nthe<br />\nthe<br />\nincoming<br />\none<br />\nfreshmen,<br />\nMeeting House. This event is for<br />\nall foreign students studying in Bal- worst seasons in the history of Hoptimore, and precedes the full reor- kins sharpshooting is likely to reganization of the Baltimore Stu- sult.<br />\ndents' Cosmopolitan Club. At this<br />\nManager Plummer stated that the<br />\noccasion, last year; forty-six differRifle<br />\nClub would be considered an<br />\nent nations were represented.<br />\nCouncil<br />\nof<br />\nthe<br />\nY.<br />\nThe Friendship<br />\nactivity as usual, and urged all<br />\nM. C. A. will hold its first meeting freshmen tq sign up at the military<br />\nand dinner at the Friends Meeting office. Rifles and ammunition are<br />\nHouse next Tuesday evening. Mr.<br />\nthe men showing<br />\nTheodore McKeldin, secretary to furnished, and<br />\nMayor Broening, will make the ad- the greatest promise will be chosen<br />\nfor the team.<br />\ndress.<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nEsso<br />\n<br />\n5<br />\n<br />\n(Continued from page 1, column 3)<br />\n<br />\nOne's first impression is of the size<br />\nand height of the piece. Atop the<br />\nhuge desk top is a tall double bookcase with four glass paneled doors.<br />\nBeneath this is a row of pigeon<br />\nholels of various shapes and sizes.<br />\nThe desk is rather long and on each<br />\nside, beneath the top, is a set of four<br />\nwide drawers. Each of these is<br />\nequipped with a pair of large, round<br />\nhandles and an enormous keyhole.<br />\nThe top for the desk consists of<br />\nfour wooden panels, hinged together, two on each side, which can be<br />\nfolded out of the way to each end<br />\nand rested there on swinging arms.<br />\nWhen it is desired to cover the<br />\ntop, these panels are unfolded toward the center and there locked<br />\ntogether. The legs of the occupant<br />\nfit between the two sets of drawers<br />\nand it is here that one of the most<br />\ninteresting parts of the whole piece<br />\nis found. A large wooden foot<br />\nwarmer rests between the drawers<br />\nfor the comfort of the occupant.<br />\nHoles were drilled in the top for the<br />\nescape of the heat and one of the<br />\nsides can be lifted and hot bricks<br />\ninserted. In warm weather the<br />\nwarmer can be utilized as a foot<br />\nrest. The bookcase now contains<br />\na part of the interesting collection<br />\nof crockery of President Goodnow.<br />\n<br />\n7(5<br />\n<br />\nNEXT TRAIN<br />\nEAVE<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nYOU CAN ACTUALLY FEEL THE DIFFERENCE<br />\n<br />\nSTANDARD OIL COMPANY IIN. J.1<br />\n<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES,<br />\n<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\neatrter*owe<br />\nof Baltimore<br />\nThe character of the suits and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nDe<br />\n<br />\nHub<br />\n<br />\n7saltlinore, Charles and Fayette<br />\n<br />\nTo smoke wisely and well, choose Camels<br />\nirresistible reason for choosing this famous cigarette. Not for its<br />\npopularity alone, but for that superior<br />\nquality that produces it.<br />\nCamel wins its prestige with modern<br />\nsmokers by forthright value. It is rolled<br />\nof the choicest tobaccos that money<br />\ncan buy, and its blending is the taste<br />\nand fragrance triumph of tobacco<br />\nTHERE'S an<br />\n<br />\nscience.<br />\n<br />\nThe Camel smoker is tobacco fit. He<br />\nhas the best, with no scrimping or denial<br />\nof cost. There are no four-wheel brakes<br />\non Camel; no brakes at all. It is full<br />\nspeed ahead, straight for quality.<br />\nSelect Camel for smoking pleasure,<br />\nand you'll join distinguished company.<br />\nParticular, modern smokers have elected<br />\nit on the principle of superiority.<br />\n01927<br />\n\"Have a Camel!\"<br />\n<br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM, N. C.<br />\n<br />\n\f6<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1927<br />\n<br />\nSPEYER PROFESSOR<br />\nBEGINS LECTURES<br />\nDr. Enno Littman, Visiting Professor, to Deliver Genei al<br />\nLectures<br />\nDr. Enno Littman, the James<br />\nSpeyer Visiting Professor for 1927,<br />\nwill lecture before the Department<br />\nof Semitic Languages from October 6 until early in December. The<br />\nSpeyer Professorship was founded<br />\nin 1925 by James Speyer, a New<br />\nYork banker who gave the University the sum of $50,000, the income<br />\nfrom which is now being used to<br />\nbring a visiting professor from a<br />\nEuropean university each year.<br />\nGeneral Lectures<br />\n<br />\nBesides his lectures before the department, Dr. Littman will deliver<br />\ngeneral lectures probably on the<br />\nfollowing themes:<br />\n(1) The Origin of the Arabian<br />\nNights.<br />\n(2) The Literature of Abyssinia.<br />\n(3) Modern Arabic Folk-Literature.<br />\nThe subjects on which Dr. Littman will lecture before the Department of Semitic Languages follow:<br />\n(1) Arabic (classical, or the Muquaddins of Ibn Rbaldun, or<br />\nModum, Syrian, or Egyptian<br />\ndialect).<br />\n(2) Ethiopic (or another Abyssinean language, if required).<br />\n(3) Semitic inscriptions (Nabatean or Palmyrene of Preislamic Northern Arabic).<br />\n<br />\nSOPHS TO ELECT<br />\nOFFICERS TODAY<br />\n<br />\nNOTICES<br />\n<br />\nToday, at 12.30 P. M., the<br />\norganization of the sophomore<br />\nclass will be completed. Last<br />\nTuesday nominations for the<br />\nvarious class offices were taken<br />\nand after a reopening of nominations the ballot will be cast<br />\nthis afternoon.<br />\nAt the last meeting, which<br />\nwas the first one of the year,<br />\na lengthy discussion was held<br />\non the question of freshman<br />\nregulations. Nothing was decided, however, because the<br />\nmatter had been .put in the<br />\nhands of the Student Council<br />\nlast year. Joseph G. Blandi,<br />\npresident of the Student Council, conducted the discussion<br />\nin order that the Student<br />\nCouncil, through him, might<br />\nknow the sentiment of the<br />\nsophomore class on the matter.<br />\nFreshman regulations will<br />\nagain be brought up at the<br />\nmeeting today.<br />\n<br />\nSecretaries of all fraternities on the campus are requested to see Mr. Myers at<br />\nthe Postoffice and give him<br />\nthe addresses of their fraternity houses so that mail addressed to them may be distributed properly.<br />\nAll scholarship men who<br />\nhave not paid for their postoffice boxes, or class dues<br />\nand other fees, are also requested to see Mr. Myers.<br />\n<br />\nDr. French Has Too Many<br />\nDuties—Thompson Not<br />\nBack<br />\n<br />\nIn order to prepare for the intercollegiate debates of the late winter<br />\nand early spring, it is essential that<br />\nprospective material be sifted and<br />\nthe best given opportunities for<br />\npractice. The freshman-sophomore<br />\nand Adams Debates should therefore be held in November and December.<br />\nNorman B. Gardiner, secretary<br />\nand treasurer of the Council and<br />\nsole remaining senior member, will<br />\npreside at today's meeting.<br />\n<br />\nDecorations<br />\n<br />\nInterior Wood Work<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nDebating Council meets<br />\ntoday, 12:30, Room 112,<br />\nGilman Hall.<br />\nSenior elections Thursday,<br />\nimmediately after Assembly,<br />\nin Civil Engineering Hall.<br />\nPolls will be open until 1<br />\no'clock.<br />\n<br />\nLarge Crowd at Jay<br />\nDEBATING COUNCIL<br />\nCandidates'Rally<br />\nLOSES TWO MEMBERS A record-breakinggroup of can-<br />\n<br />\nLoss of the services of J. Carey<br />\nThompson and Dr. John C. French,<br />\npresident and faculty adviser of the<br />\nDebating Council, presents a serious<br />\nobstacle to the prospects of that<br />\nbody. Thompson is not returning<br />\nto Hopkins this fall, while Dr.<br />\nFrench finds himself too much taken up with his new responsibilities<br />\nas Librarian to be able to carry on<br />\nin the capacity of adviser to the<br />\nWas at Princeton<br />\nBefore coming to Hopkins, Dr. debaters.<br />\nLittman was the lecturer on SemiLast year Carey Thompson captic Philology at Princeton and the tained the winning junior team in<br />\nUniversity of Strassburg. He has he Adams Debate and distinguished<br />\nalso held professorships at the Uni- himself in debates with the Univerversity of Egypt and the University sity of North Carolina and with<br />\nof Bonn. Dr. Littman has written Washington and Lee. As president<br />\na number of works on Semitic Phi- of the Council, Thompson occupied<br />\nlology.<br />\na position for which he had been<br />\nWhile the study of Semitic Phi- carefully prepared by three years'<br />\nlology and other branches of the of debating.<br />\nSemitic languages does not hold<br />\nMeeting Today<br />\nmuch interest for the average stuThe<br />\nDebating<br />\nCouncil is to hold<br />\ndent at Johns Hopkins, the general<br />\nlectures given by Dr. Littman are its first meeting in Room 112, Gilexpected to be very attractive and man Hall, at 12: 30 today. Dr.<br />\nshould draw a large number of French's resignation will be tenundergraduates, since they will deal dered the Council at this time. The<br />\nmore with the literature of the East selection of a new adviser and electhan with the technicalities of its tion of a president will be the primary objects of the gathering; it is<br />\nlanguage.<br />\nThe gift of $50,000 which James probable that plans for the coming<br />\nSpeyer made to Johns Hopkins was year will also be adopted.<br />\none of the most liberal which the<br />\nUniversity has ever received, since<br />\nthe donor did not specify in what<br />\nmanner the funds should be used.<br />\nHowever, Speyer suggested that the<br />\nincome of the money should be used<br />\nto provide for a visiting lecturer<br />\nfrom Europe each year, 5(3 the University has followed his request.<br />\nThe professorship is not confined<br />\neach year to the Department of<br />\nSemitic Languages, as a lecturer in<br />\na different field is picked each year.<br />\n<br />\nFreshman class elections<br />\nwill be held today in the<br />\nChemical Laboratory, Room<br />\n101. Polls will be open<br />\n12:20 to 1.<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\ndidates for the combined staffs of<br />\nthe Black and Blue Jay presented<br />\nitself at the organization meeting of<br />\nthat publication in the Barn last<br />\nFriday night.<br />\nEditor-in-Chief Don White conducted the meeting, explaining the<br />\nworkings of the Jay and welcomed<br />\nthe candidates.<br />\nA novel plan for luncheons to be<br />\nheld at short intervals was announced as being under consideration. Candidates were signed up<br />\nfor their respective positions, and<br />\ntheir next meeting will be held this<br />\nThursday at 12: 20 in the Blue Jay<br />\noffice.<br />\n<br />\n1N%,<br />\n=<br />\n5,<br />\n<br />\nr4?<br />\n<br />\nARLINGTON HOTEL<br />\nIDEAL DOWNTOWN LOCATION<br />\nOne cfthe 4'M Notels<br />\n<br />\nOTHER.<br />\n<br />\nCAIRO<br />\n4-M I COLONIAL<br />\nFAIRFAX<br />\n<br />\nAWayS<br />\nA ROOM<br />\nA ROOM<br />\nWITH<br />\nWITH<br />\nRUNNING<br />\nPRIVATE<br />\n<br />\nHOTELS ii MARTINIQUE<br />\nWashington,D.0 TILDEN HALL<br />\n<br />\nWATER<br />\n<br />\n12,<br />\n<br />\nBATH<br />\n<br />\n13<br />\n<br />\nOPERATED BY MADDUX, MARSHALL, MOSS & MALLORY INC<br />\n•••<br />\n<br />\nWRITE FOR A fRff COPY OF OUR 'I.00 PICTORIAL GUIDE MAP OF WASHINGTON<br />\n<br />\n&traded<br />\n<br />\n*co.u.s.'sver ova<br />\n<br />\n&OA,<br />\nThe Slickest Coaton the Campus!<br />\nNo well dressed college man<br />\nis without one. It's the original,correct oiled slicker and<br />\nthere's nothing as smart or<br />\nsensible for rough weather<br />\nand chilly days.<br />\nMade of guaranteed waterproof oiled fabric in yellow,<br />\nolive-khaki or black. Has<br />\nall-'round strap on collar<br />\nand elastic at wrist-bands.<br />\nClasp•closing style<br />\nButton-closing style<br />\nStamp the correct name in<br />\nyour memory and buy no<br />\nother.<br />\n<br />\ncfimideactchudott<br />\nair*.<br />\nThe \"Standard Student\" is<br />\nmade only by the Standard<br />\nOiled Clothing Co., N.Y.C.<br />\nSlip one on at<br />\n<br />\nWarner's - 18 E. Baltimore Street<br />\nCahn's Quality Shop - 128 W. Baltimore Street<br />\n<br />\nYou don't have to get set like a<br />\ndisciple of Spencer to write with a<br />\nWaterman's. Sit as you will, hold<br />\nyour pen as you like, it will write<br />\nthe instant the pen point touches<br />\nthe paper. For instant and unequaled service, Waterman's has no<br />\npeer.<br />\nWe recommend for college work<br />\nWaterman's 01854 R.R. The holder is<br />\nmade of stainless ripple rubber. A metal<br />\nlip-guard protects the cap from breaking;<br />\na pocket clip insures against loss, and a<br />\nsolid 14-carat gold nib will give service<br />\nfor years. It has a big ink capacity.<br />\n<br />\nThe dealer from whom you buy your<br />\nsupplies sells<br />\n<br />\nWaIermeals<br />\n<br />\nNo.<br />\n01854 R.R.<br />\n$500<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br />\n<br />\nSTUWHITEHEAD BACK HOPKINS<br />\nDENTS PROMIIN B. & 0.<br />\nFROM EUROPE NENTFAIR<br />\nOF THE<br />\nIRON HORSE<br />\nDean of Engineering School Was<br />\nVisiting Professor<br />\nHONORED BY U. OF NANCY<br />\nStudied European Educational<br />\nMethods<br />\nDr. John Boswell Whitehead,<br />\nProfessor of Electrical Engineering<br />\nand Dean of the School of Engineering, has recently returned from<br />\na nine-month trip in Europe, where<br />\nhe was serving as Exchange Professor in Engineering and Applied<br />\nScience for a group of seven American universities.<br />\n<br />\nDuring his stay<br />\nabroad, Dr. Whitehead visited all<br />\nthe large cities in Europe. He spent<br />\nseven months in France, lecturing<br />\nin eleven universities. He spent<br />\nalso much time in England, Italy<br />\nand Switzerland.<br />\nDr. Whitehead was chiefly interested in Dielectric theory, insulation and high voltage; and at the<br />\nUniversities of Aix-Marseille, Grenoble, Lyon, Bordeaux, Toulouse,<br />\nCaen, Lille, Strasbourg, Nancy and<br />\nParis he delivered a series of lectures on these subjects. The complete series of nine lectures is to be<br />\nPublished by the Societe Francaise<br />\ndes Electriciens. In June he presented at the Conference Internationale des Grands—Reseaux- aux<br />\nHaines Tensions in Paris a lecture<br />\non High Voltage Insulation.<br />\nVisited Chief Laboratories.<br />\n<br />\nIn the various universities he visited, Dr. Whitehead made a careful<br />\nstudy of educational methods, particularly in the field of electrical<br />\n<br />\nNot the least ammig the factors<br />\nin the unprecedented success of the<br />\ngiant \"Fair of the Iron Horse\" has<br />\nbeen the work of three Hopkins<br />\nstudents employed by the B. & 0.<br />\nRailroad.<br />\nWhen the great procession gathers on the far side of the vast exposition grounds, Harry Piet, a Hopkins senior, is the man of the hour.<br />\nHe it is who assembles the numerous floats to take part in the lengthy<br />\npageant. Piet is property assistant<br />\nto Mrs. Adele Gutman Nathan, pageant director. Mrs. Nathan takes<br />\nher station in a specially constructed<br />\ntower directly opposite .the grandstand. At the appointed hour she<br />\ntelephones across to Piet, who is<br />\nstationed on the other side of the<br />\nfield, and when all is in readiness<br />\nhe gives the signal for the pageant<br />\nto start.<br />\nRalph Kirkley, another Hopkins<br />\nsenior and associate editor of the<br />\nNEWS-LETTER, has been responsible<br />\nfor most of, the publicity connected<br />\nwith the pageant. He was engaged<br />\nin this sort of work for at least a<br />\nmonth and a half before the opening<br />\nof the exhibit. During this time be<br />\nwrote two feature stories each day<br />\nin addition to a variety of magazine<br />\narticles on topics of national inter-<br />\n<br />\n2st in the field of railroading. These<br />\nstories and articles which were concerned chiefly with different aspects<br />\nof the pageant, were published in<br />\nseven hundred newspapers throughout the United States. Since the<br />\nopening of the exhibit, Kirkley has<br />\nbeen sending out daily news bulletins to the Associated Press and to<br />\nother newspapers outside of Baltimore. These bulletins are graphic<br />\naccounts of interesting daily incidents at the great fair. Kirkley is<br />\nalso often called upon to write feature stories for Baltimore publications about the American Indians<br />\nand others taking part in the pageant.<br />\n<br />\nSeason ticket sales to date,<br />\nas far as known, amount to<br />\n$630.<br />\nUniversity of Pennsylvania<br />\nsold 30,000 season tickets<br />\nail $20 for their football<br />\nseason--a total of<br />\n<br />\nMr. F. X. Milholland, assistant<br />\nto the Senior Vice-President of the<br />\nB. & 0. Railroad, spoke in the highest terms of Kirkley. He said he<br />\ncould not praise the young man<br />\nenough either with respect to his<br />\nabilities as a writer or as to his<br />\npersonal qualities. Kirkley's work<br />\nhas been all that could be desired,<br />\nhe said.<br />\nKirkley, himself, is enthusiastic<br />\nin his praise of the exhibit. \"It is<br />\nthe most interesting as well as the<br />\nbiggest thing of its kind that has<br />\never been staged in this country,\"<br />\nhe said.<br />\n<br />\n$600,000.<br />\nHow about it?<br />\nFRANK BROTHERS<br />\nFiftinAwntne Boot Shop<br />\nBetween 47th<br />\n<br />\nA type of shoe for<br />\neach need of the<br />\ncollege man<br />\n<br />\nAt L. Shaeffer's,<br />\n<br />\nRandolph Moore, also a Hopkins<br />\nstudent, drives a little Ford engine<br />\nwhich propels one of the floats in<br />\nthe pageant along the track. The<br />\nengine is concealed underneath the<br />\nfloat.<br />\n<br />\nAnd So the Day Was Utterly Ruined<br />\nYOU HAVEN'T A CARE. IN \"THE<br />\nWORLD AS you START OUT 70<br />\n„SEE THE BEST TEANJ THAT DEAR<br />\n<br />\nOLD .51wA5II HAS HAD IN YEAR5<br />\nw1PE Up YOUR ANCIENT RIVAL.<br />\n<br />\nSEATS ON<br />\n/ 'THE SO yARD<br />\nLINE! NOT BAP<br />\nEH !<br />\n<br />\nand 48th Streets, New York<br />\n<br />\n1800 E. Monument St.<br />\n<br />\nWatch this space<br />\nFORDYCE E. C. CAMPBELL<br />\n<br />\n•<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n•<br />\n<br />\nDined With Lindbergh.<br />\n<br />\nHe was in Paris at the time of<br />\nLindberg-h's flight. He did not witness the landing; however, he heard<br />\nthe plane flying over the city, and<br />\nlater attended a banquet in honor<br />\nof Mr. Lindbergh.<br />\n<br />\nBy BRIGGS<br />\n<br />\n\\W(<br />\n//////<br />\n<br />\nOne of the chief tributes paid<br />\n<br />\nDr. Whitehead's trip to Europe<br />\nwas made under the auspices of a<br />\ngroup of American universities:<br />\nCornell, Columbia, Harvard, Penn<br />\nState, Johns Hopkins, Yale and the<br />\nMassachusetts Institute of Technology. Five years ago this group<br />\nformed a commission for the exchange of Engineering professors<br />\nwith a similar group in France.<br />\nEvery other year a professor from<br />\neach country studies the electrical<br />\ndevelopment of the other and lectures on the work being done in his<br />\nown country.<br />\n<br />\n•<br />\n•<br />\n<br />\nAND you HAVE A GRAwD GABFEST AND MIKE KENDALL GIVES You ODDS<br />\nOF3TO ,AND IT6 GRAND LARCENY<br />\nWITH ALL THE 0L17 GANG Yoo<br />\nHAuENsT 6EEN SINCE LAS<br />\nTO TAKE H r.5 1.4C7/-4<br />\n00t4,7\"<br />\nYEAR.<br />\nYOU'RE ON FOR<br />\n`/00 EvEfk<br />\nGREAT<br />\n(I.0, AL)How'S<br />\nCALL A<br />\nDAY FOR<br />\nA HUNDRED.<br />\nTHE. BOY?<br />\nTHE GAME FEU-Pt<br />\nTHIS IS THE.<br />\nUp?<br />\nDA`i I GET EVEN<br />\n<br />\nengineering. He attended conventions and meetings, conferring with<br />\nmany educators, scientists and engineers. Also he carefully studied<br />\nthe large manufacturing plants of<br />\nEurope. He visited the chief electrical and physical laboratories in<br />\nthe countries in which he traveled.<br />\nto<br />\nProfessor Whitehead's work in electrical engineering was made by the<br />\nUniversity of Nancy. At this university he was presented the Medal<br />\nof Honor.<br />\n<br />\n,31.31) SiwASH SCoR,S A TOUCH—<br />\n.2owN BEF•00E THE GAME is<br />\n-TH.E4E MiNUT S 91-V.<br />\n<br />\nATTA BOY<br />\nSI WA SH)<br />\nSIWAr5H,<br />\n<br />\n-\\\\<br />\n<br />\n11)<br />\n<br />\nOct. 14<br />\n<br />\nAND THEN VOL) .5u00ENLy<br />\npi5CouER. yoviVe SmOKED YOUR<br />\nLAST OLD 0-0LD AND CAN'T<br />\nGET ANY MOE.. -TILL YOU GET<br />\nSACK To ToWN.<br />\n<br />\nvpky 15<br />\nRU.1N ED.<br />\n<br />\n14NO So THE<br />\n<br />\nTTERLy<br />\n<br />\n'THIS IS l'HE ROTTENEsT<br />\nTEAM THEY EVER HAD,-THEY<br />\nf3ETTER GET A NEW COACH<br />\nOR PLAY - VASS- A R<br />\n<br />\nSIWA;14<br />\n(1\\<br />\n<br />\n/%.<br />\n<br />\nLD<br />\nThe Smoother and Better Cigarette<br />\nnot a cough in a carload<br />\n© 1927, P. Lorillard Co., Est. 17u0<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br />\n<br />\nDR. WIGHT SPEAKS<br />\nAT RECEPTION<br />\nRodgers and Aiau Furnish Entertainment<br />\nLARGE CROWD PRESENT<br />\nFreshman Orchestra Provides<br />\nEvening's Music<br />\nAbout three hundred and twentyfive men attended the Y. M. C. A.<br />\nreception for freshmen last Friday<br />\nnight. The affair, which was held<br />\nin the Civil Engineering Hall,<br />\nturned out to be the usual rushing<br />\nparty. This year there were many<br />\nmore upper classmen than freshmen, the ratio being about two to<br />\none.<br />\nThe music for the affair was furnished by a freshman orchestra<br />\nunder the leadership of Osmar<br />\nSteinwald.<br />\nDr. Wight on Activities.<br />\n<br />\nDr. Carol V. B. Wight, who succeeded Dr. John F. French as chairman of the faculty committee on<br />\nstudent affairs when the latter became Librarian of the University,<br />\nwas the speaker of the evening. Dr.<br />\nWight spoke at length on the relation of extra curricular activities to<br />\ncollege life. It was pointed out by<br />\nhim that the proper ratio between<br />\nstudies and activities must be maintained in order that the student<br />\nmight get the most out of his college<br />\nexperience.<br />\nAthletics Good Training<br />\n<br />\nDr. Wight said that he thought<br />\nathletics good training for college<br />\nmen, in that sports put a man on his<br />\nown, teaches generosity and aids a<br />\nman to learn to keep his temper<br />\nunder control. Fraternities, Dr.<br />\nWight believed, are also very helpful and beneficial and may prove of<br />\n(Treat value in later life. The welcome the freshman class got, Dr.<br />\nWight said, would last throughout<br />\nthe time they were at college and<br />\nshould be passed on to the incoming<br />\nclasses of future years.<br />\nBill Rodgers was next on the program and his entertainment was as<br />\nlively and as appreciated as usual.<br />\nRodgers sang some humorous songs<br />\nas well as several of the old favorites and ended up his part of the<br />\nprogram by offering \"The Curse of<br />\nDrink.\"<br />\nNative Hawaiian Performs<br />\n<br />\nThe second bit of entertainment<br />\nwas furnished by C. K. Aiau, a native Hawaiian, who has been studying at the Johns Hopkins Medical<br />\nSchool. Aiau performed on the<br />\nguitar, the ukelele and another<br />\nstringed instrument.<br />\nRefreshments, in the form of ice<br />\ncream and cake, were served after<br />\nthe last musical number.<br />\n<br />\nMOTHER GOOSE<br />\nNUMBER<br />\n<br />\nBlack and<br />\nBlue Jay<br />\nOUT ABOUT<br />\n<br />\nOCT.<br />\n21<br />\n<br />\nHISS ELECTED TO<br />\nHARVARD LAW REVIEW<br />\nAnnouncement has recently<br />\nbeen made by the Harvard<br />\nLaw Review that Alger Hiss,<br />\ngraduate of Johns Hopkins in<br />\n1926, has been elected to its<br />\neditorial board with nineteen<br />\nother Harvard students.<br />\nFollowing a.brilliant college<br />\ncareer here, where he distinguished himself as a scholar,<br />\namateur actor, editor, military<br />\nstudent and all-round leader,<br />\nHiss went to Harvard a year<br />\nago to take up the study of<br />\nlaw. His interest in printers'<br />\nink has apparently subsided<br />\nnot a whit.<br />\n<br />\nTRACK TEAM HOLDS<br />\nINITIAL MEETING<br />\nImportance of Fall Practice<br />\nStressed By Captain<br />\nSEVEN REGULARS RETURN_<br />\nTurn-Out of Freshmen Candidates Pleases Coach<br />\nOrganization of the track squad<br />\nfor the coming season was begun<br />\nt a meeting held in the M. E. Building on last Friday. The gathering<br />\nwas addressed by Capt. Herman<br />\nSchiebel of the Cross Country<br />\nTeam, Capt. A. E. Vivell of the<br />\nTrack Team and Coach Ridgely<br />\nEdwards, pilot of the Black and<br />\nBlue cinder path artists for the past<br />\ntwo years.<br />\nThe meeting was begun with a<br />\nplea by Captain Schiebel for candidates for the cross country team.<br />\n\"The Work is not hard, and anyone<br />\nwith any aptitude for long distance<br />\nrunning can develop into a fairly<br />\ngood hill and dale man through<br />\nsteady practice.\" All men running<br />\ndistances upwards from half-mile<br />\nwere requested to try out for the<br />\nteam.<br />\n<br />\nVan Orman Adopts<br />\nLighter Uniform<br />\nCoach Ray Van Orman has made<br />\na change in the uniforms being worn<br />\nby the football team this year. The<br />\nnew uniform weighs approximately<br />\neight and one-half pounds. This is<br />\njust six and one-half pounds lighter<br />\nthan last year's togs, which weighed<br />\nfifteen.<br />\nThe idea of a light •uniform was<br />\nconceived by the United States Military Academy and was first put into<br />\npractice in the Army-Navy game of<br />\n1926. These uniforms were such<br />\nan improvement over the heavier<br />\nones that the A. G. Spalding Co.,<br />\nmanufacturers of the new uniforms,<br />\nplaced them on display in New<br />\nYork. It was here that Coach Van<br />\nOrman received the idea which he<br />\nhas put into practice.<br />\nNew uniforms were bought at<br />\nthe Hopkins athletic outfitters, and<br />\nwere first put into use against Richmond. One feature of the new uniform is the detachable hip pads.<br />\nThese protectors are strapped and<br />\nthe jersey pulled down over them.<br />\nIn addition to being less combersome, the pad does not protrude<br />\nfrom the pants. This gives the opposing team less opportunity to hold<br />\non to a man after he has been tackled. The head gears are lined with<br />\nsponge rubber instead of felt, making them lighter, more impervious<br />\nto perspiration and more comfortable.<br />\n<br />\nDemand<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n<br />\nM<br />\n<br />\nS<br />\n<br />\nT<br />\n<br />\nConvenient and Economical<br />\nTRANSPORTATION<br />\n<br />\nTHE STREET<br />\n<br />\nCARS<br />\n<br />\nESTABLISHED 1818<br />\n<br />\nMADISON AVENUE COP.FORTY-FOURTH STREET<br />\nNEW YORK<br />\nOur Representative will be at<br />\nTHE BELVEDERE<br />\non the following days<br />\nduring the coming season<br />\nOctober 10, 11, 12<br />\nNovember 7, 8, 9<br />\nDecember 5, 6, 7<br />\n<br />\nSod sad Black Color Comb.keg.Triad* Mark U S.Pat.011.<br />\n<br />\n*NoExpense<br />\nAfter Purchase<br />\n<br />\n0<br />\n<br />\nSendfor<br />\n<br />\nBROOKS'S Miscellany<br />\n<br />\nBOSTON<br />\n<br />\nPALM BEACH<br />\n<br />\nNEWPORT<br />\n<br />\nLITTLE BUILDING<br />\nTREMONT ECM BOYLSTON<br />\n<br />\nPLAZA BUILDING<br />\nCOUNTY ROAD<br />\n<br />\nAUDRAIN BUILDING<br />\n220 BELLEVUC Avenue<br />\n<br />\nV ivell Speaks<br />\n<br />\nSchiebel was followed by Captain<br />\nivell of the track team, who emphasized the importance of fall<br />\npractice, not so much to get into<br />\ncondition for the winter and spring<br />\nseasons, as furnishing practically a<br />\nwhole season of experience in running. Vivell further pointed out<br />\nthat fall practice allows the coach<br />\nto get an insight into the amount<br />\nand quality of the material that will<br />\nbe available in the spring.<br />\nThe last speaker at the meeting;<br />\nwas Ridgely Edwards, the only student head coach in the history of<br />\nmajor sports at Hopkins. \"Ridge\"<br />\nspoke of the necessity of everyone<br />\nin the freshman class who believed<br />\nhe had any ability, turning out for<br />\nthe fall track practice. \"Seven letter men return to college, leaving<br />\nmany vacancies to be filled in, mostly out of the incoming class, since<br />\nthe other years have been pretty<br />\nvelI combed for material.\"<br />\n<br />\nI<br />\n<br />\nOver-size<br />\nDuofold $7<br />\nDuofold Jr.$5<br />\nLady Duofold $5<br />\n<br />\ntarter s<br />\n<br />\nArewthtofold\\<br />\nwith<br />\n<br />\nPressureless<br />\nI<br />\nTouch<br />\nand<br />\nNon.Breakable /<br />\nBarrel<br />\n28\"; Lighter than Rubber<br />\n<br />\nMore Men on Track Team<br />\n<br />\nCoach Edwards likewise pointed<br />\nout that track differed from every<br />\nsport in that it offered more men<br />\nplaces on the varsity, and allowed<br />\nevery man free sway in the winning<br />\nof his events, no team work being<br />\nnecessary. He also pointed out that<br />\nthis allowed everyone to develop to<br />\nhis highest degree, irrespective of<br />\nthe performance of the other men<br />\non the team. He concluded his talk<br />\nwith a brief, review of the history<br />\nof track teams and noted runners at<br />\nHopkins.<br />\nAt the end of the meeting, cross<br />\ncountry practice was announced to<br />\nbegin that afternoon, while the initial track practice will be held this<br />\nafternoon at 4.00 on Homewood<br />\nField.<br />\n<br />\nParker's \"No Expense After<br />\nPurchase\" offer means that the<br />\nnew model Duofold necessarily<br />\nmust be a pen that stays in perfect order. Otherwise we'd go<br />\nbroke making repairs.<br />\nThe fact is that trouble has practically vanished since we replaced<br />\nrubber barrels with Non-Breakable Permanite.<br />\nAnd of course there's never been<br />\nanything else like the Parker Duofold Point that yields to any hand<br />\nyet never loses shape.<br />\nIf you want to taste something<br />\nnew in writing ease—called Pressureless Touch—try the New<br />\nModel Parker Duofold at the nearest pen counter.<br />\nTHE PARKER PEN COMPANY<br />\nJANESVILLE, WIS.<br />\n<br />\n*No Expense After'Purchase<br />\nTo prove that Parker Duofold Pena will stay<br />\nIn perfect order,Parker agrees to make good<br />\nfree, if one should fail, provided complete<br />\npen is sent by the owner direct to Parker<br />\n<br />\nwith 10e for return postage and insurance.<br />\n<br />\nThe Athletes<br />\nFriend<br />\nT'S strenuous business<br />\nfor the athlete to keep up<br />\nwith his work and at the<br />\nsame time get the sleep<br />\nthe coaches demand.<br />\nMany have discovered a<br />\nway to do it. They use a<br />\nRemington Portable for<br />\nall their writing. It helps<br />\nthem get better marks<br />\nbecause of the neatness<br />\nand legibility of the typeEasy Payments.<br />\n<br />\nwritten reports; and the<br />\ngreat saving of time as<br />\ncompared with the drudgery of writing by hand is<br />\na welcome relief.<br />\nRemington Portable is the<br />\nsmallest, lightest, most<br />\ncompact and most dependable portable with standard<br />\nkeyboard. Weighs only<br />\npounds, net. Carrying<br />\ncase only 4 inches high.<br />\n<br />\nRemington<br />\n•<br />\n<br />\nPortable<br />\nREMINGTON TYPEWRITER COMPANY<br />\nDivision of Remington, Rand, Inc.<br />\n<br />\n25 West Fayette Street<br />\nBALTIMORE, MD.<br />\n<br />\nrv<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXII, No. 3<br /><br />\niABOLITION OF<br />\nPADDLING LAUDED<br />\nPaddling Incompatible With<br />\nHopkins Dignity, Says Dean<br /><br />\n•<br /><br />\n-t‘<br /><br />\nDR. HULBURT IS<br />\nAWARDED DEGREE<br />\nDr. Lorrain S. Hulburt,<br />\nProfessor Emeritus of Mathematics at Hopkins, has been<br />\nawarded the honary degree of<br />\nDoctor of Laws by the University of South Dakota.<br />\nDr. Hulburt held his first<br />\nchair in Mathematics at South<br />\nDakota, from 1887 to 1891,<br />\ncoming to Baltimore in 1892.<br />\nFrom 1897 until his retirement<br />\na year ago, Dr. Hulbert was<br />\nCollegiate Professor of Mathematics at this University. The presentation of the degree was made at the commencement exercises of the<br />\nUniversity of South Dakota.<br /><br />\nSEVEN BOOKS PRINTED<br />\nBY HOPKINS PRESS<br />\nDoctors Shanks and Willoughby<br />\nAmong Authors to Have<br />\nNew Works Printed<br /><br />\nTOSSED PASS<br /><br />\nPRICE 5 CENTS<br /><br />\nSYRACUSE DEFEATS<br />\nFIGHTING JAYS<br />\nPindell's Pass to Houston Gives<br />\nHopkins Touchdown<br /><br />\nMany volumes written or edited<br />\nSECOND HALF SCORELESS<br />\nby professors of Johns Hopkins<br />\nUniversity have been printed by the<br />\nSome Disagree, However;<br />\nWhirlwind Aerial Attack of Jays<br />\nJohns Hopkins Press during the<br />\nMourn Loss of Color<br />\nConsistently Gains<br />\nsummer. The titles of these works<br />\nand their authors follow:<br />\nVolume 45—Numbers 2 and<br />\nVaried comment has been excited<br />\nUnleashing a powerful aerial at3 of the Johns Hopkins Union the campus by the abolition of<br />\ntack,<br />\nHopkins held the strong Syraversity Studies in Historical<br />\nthe immemorial custom of paddling<br />\ncuse<br />\nfootball<br />\nmachine to a 21-to-6<br />\nand Political Science.<br />\nfreshmen. From the dean down,<br />\nscore<br />\nat Archbold Stadium SaturThe Department of Justice<br />\nexpression of opinion has been open<br />\nof the United States, by Albert<br />\nday. Ten of the thirty-three Jay<br />\nand decided.<br />\nLangebuttig.<br />\npasses were successfully completed.<br />\nThe Legal Status and FuncDr. Ames said, when approached<br />\nThe team showed.a complete retions of the General Accounton the subject, \"I thoroughly ap- Seniors Nominate<br />\nWatson Pindell, Jay fullback, who<br />\ning Office, by W.F. Willough- forward-passed the pigskin to versal of form over its performance<br />\nprove the new ruling; and am, deClass Officers<br />\nagainst Richmond last week and<br />\nHouston to score Hopkins' only<br />\nby.<br />\nlighted at this action on the part of<br />\nThomas N. Biddison and H.<br />\npoints against Syracuse.<br />\nthe Syracuse aggregation<br />\ngave<br />\nOriental<br />\nStudies,<br />\nedited<br />\nby<br />\nthe Student Council. Paddling gave<br />\nrise to bullying, and I never liked Ridgely Warfield headed the list of<br />\nCyrus Adler and Aaron Emplenty of trouble. Although the<br />\nAlpha Mu Tau •<br />\nto see five men on one. It is<br />\nclass nominations made last •<br />\nber.<br />\nOrange eleven scored their twentynot senior<br />\ngood sportsmanship. Furthermore, Thursday at the first meeting of the<br />\nFlaubert's Youth, by Lewis<br />\nPetitions Board one points in the first half, the final<br />\nthe idea was patterned after fifth year. Biddison and Warfield were<br />\nPiaget Shanks.<br />\nAt the first meeting of the InterThe History and Civiliza- fraternity Board, with Ridgely outcome of the contest was in doubt<br />\nrate colleges and is not commensu- both nominated for the office of<br />\ntion of Ancient Megara, by E. Warfield presiding, the Alpha Mu until the last whistle.<br />\nrate with the dignity of the Univerpresident of the class. The meeting,<br />\nsity.\"<br />\nL. Highbarger.<br />\nTau fraternity submitted its petiJay Passes Next Touchdown<br />\nwhich was held in the C. E. Hall<br />\nShakespearean Character tion for admittance to the Board.<br />\n• Injury to the dignity of Johns<br />\nIn<br />\nthe second quarter a barrage<br />\nimmediately after the first weekly<br />\nInterpretation: The Merchant It was represented by Leonard CovHopkins was the keynote of the<br />\nof Venice, edited by James W. ell, to whom the requirements for of Jay forward passes finally rereply of Joseph G. Blandi, president assembly, was not very well atBright.<br />\nof the Student Council. He also tended. Donald White, Gardner<br />\nadmission were explained. The Al- sulted in a touchdown. Hopkins<br />\nurged that paddling is too old-fash- Mallonee and Randolph Mengers<br />\npha Mu Taus must be represented got possession of the ball on SyraShanks Writes on Flaubert<br />\non<br />\nioned for this institution. He con- were proposed for vice-president.<br />\nthe Board for a period of three cuse's 28-yard line after the home<br />\nDr. Shanks' book on Flaubert is<br />\nyears<br />\nwithout having a vote in any team had attempted two forward<br />\ntinued \"The freshmen who most<br />\nOther nominations were: For one that should interest many Hopdodged the paddling were the most secretary, Dalsemer and McCurley kins undergraduates, due to the fact of the proceedings. After this time passes, both of which were groundeager to inflict it on the frosh when for treasurer, Boynton, Gardiner that Flaubert's works are being their membership will be acknowled by alert Blue Jays. From a kick<br />\ntheir turn came.\"<br />\n.„<br />\nand liarris for sergeant-at-arms, read by classes in French. The edged.<br />\n--qui-a--?as-10<br />\ndiscussion it was de- ormatton,Frosh Not Dependable<br />\nArmor and Hemmeter ; for dele- book deals with -Flaubert's dreams - A tter<br />\nRidgely Warfield, cheer lead- gates to the student council, Biddi- of Romanticism through the me- cided that for the present the week- Boynton that was good for 22 yards.<br />\ntr, Inter-Fraternity Board president, son, Lawrence. White, Boynton, dium of his letters and juvenile ex- ly meetings would continue to be A pass to Lawrence failed, but on<br />\nand student head of the R. O. T. C. Steinwald, Dotterweich, Ham- periences. The book contains the held on Mondays. President War- the next<br />\nplay, Houston, who had reunit, says, \"If the freshmen cooper- burger, Rohr, Bauernschmidt, Mc- first account in English of Flau- field explained several points re- placed Mallonee at left<br />\nend, gathate, I think the plan is very good. Elfresh and Carroll. The senior bert's earliest novel.<br />\ngarding the rushing agreement, aft- ered in a long, 30-yard toss. Lyons<br />\nHowever, in my experience I have class is entitled to two representaThe volume of Oriental Studies er which the session was adjourned. was thrown for a loss. Syracuse at<br />\nfound that freshmen can't be tives on the student council and, edited by Cyrus Adler and Aaron<br />\nThe next meeting will be on Oc- this point was penalized 15 yards<br />\ncounted on for much.\"<br />\nunder the present ruling, the presi- Ember is in commemoration of the tober 10, at 12: 30, in room 106, when Loucks, a substitute back,<br />\nCharles Harris, a senior, made dent of the class will also be a mem- work done by Dr. Paul Haupt at Mechanical Laboratory.<br />\nspoke to a teammate. On the next<br />\nthe following comment: \"Paddling ber, ex-officio, of this body.<br />\nJohns Hopkins.<br />\nplay, a pass from Pindell over the<br />\nIS good for stubborn frosh. Its<br />\nThe work on Ancient Megara is Only Two Veterans<br />\ncenter of the line, was snatched by<br />\nab- \"Nominations for all of these<br />\nsence, however, steadies the college offices will be reopened at the next a very complete account of the deHouston after several players had<br />\nReturn to Rifle Club touched<br />\nand takes away the high school at- senior class meeting on Thursday,\" velopment of one of the most imthe ball, and converted into<br />\nChances for candidates on the a touchdown. Pindell's dropkick<br />\nmosphere. The freshmen seem to said Joseph Blandi, president of the portant of the Greek city-states.<br />\ncooperate in carrying out the regu- student council. This move was de- The author has used ancient tradi- rifle team are exceptionally good went wide.<br />\nseason, according to a statelations.\"<br />\ncided upon in order to give those tions, inscriptions, modern excava- this<br />\nLyons Outpunts Baysinger<br />\nment<br />\nmade by Lieutenant (Wiley,<br />\nMr. E. A. Schall, executive secre- who were not present at the first tion and abundant general archaethe<br />\nJay<br />\nof<br />\nsharpshooters.<br />\nPrevious to Hopkins' scoring, the<br />\ntary of the campus Y. M. C. A., al- meeting a chance ,to make nomina- ological material in reconstructing coach<br />\nBecause of the graduation a playing had been obviously in favor<br />\nthe life of the ancient state.<br />\nthough he lauds the new system, tions.<br />\npractically all of last year's marks- of Syracuse. In an exchange of<br />\nthinks that freshmen regulations are<br />\nmen, a new team must be built punts at the beginning of the game,<br />\ngood. These, however, according FOOT WARMER INTERESTING FEATURE<br />\nBussard and Plummer, who Bobby Lyons had a slight advantage<br />\naround<br />\nto Mr. Schall, should be reduced to<br />\nOF UNIVERSITY FOUNDER'S DESK were regulars of -last season's out- over Baysinger, the Syracuse quara minimum and then strictly endoubtful whether Garis terback. The Orange eleven then<br />\nHidden away in the dark archives entire outside is studded with huge fit. It is<br />\nforced.<br />\nwill return to the team. Last year's started a determined attack from<br />\nMr. Carey Thompson, a former or dusty corners of the campus are bolt heads, an impression of<br />\ncaptain iS now attending medical midfield, which resulted in a touchstudent here, has very definite views<br />\nstrength and solidity thereby being school.<br />\ndown. Brophy added the extra<br />\ninteresting<br />\nrelics<br />\nmany<br />\nfound<br />\nto•<br />\nbe<br />\nOn the subject. \"Absence of the<br />\ngiven which its size belies. The<br />\nAs yet no definite announcement point by means of a dropkick.<br />\nPaddle takes half the joy out of the and antiques, dating from the early<br />\ndoor is lapped over with heavy of the schedule has been made.<br />\nLyons\" Punt Blocked<br />\nfreshman's life. He expects it.\"<br />\nhistory of the University. Some<br />\nbands of steel. There is no com- Lieutenant Offley stated also that<br />\nFollowing<br />\nthis first tally, the ball<br />\nthere are which are known to the<br />\nsuccessful candidates will be awardPh. D. Gives Opinion<br />\nbination lock, and entrance is gained<br />\nseesawed<br />\nback<br />\nand forth until Wied an \"rHt\" as in former years.<br />\n\"Doc\" Adams has no doubts majority of students, but many there<br />\nnick blocked a punt by Lyons and<br />\non the subject. \"Paddling abso- are which remain unnoticed and un- by means of a huge and heavy key<br />\nNewman recovered the ball on the<br />\nwhich fits into a peculiarly curved<br />\nlutely ought to go,\" he said, \"you known.<br />\nBarnstormers to Use<br />\n21-yard line. It took seven line<br />\nAre not sent here to learn to paddle.<br />\nkeyhole.<br />\nMiniature Theater bucks before Syracuse could put the<br />\nPerhaps the most interesting of<br />\nIf you are, you ought to go home<br />\nThe safe was made for the keepand save your money. Some should those in the latter class are the desk ing of record books and ledgers, as<br />\nStage settings and lighting effects ball over for their second score.<br />\ngo anyway; they don't learn any- and safe of Johns Hopkins, the<br />\nfor future Barnstormer productions Brophy's accurate toe again added<br />\nshown by the interior, fitted with a<br />\nthing:,<br />\nwill be visualized in advance by the extra point.<br />\nfounder of the University. These<br />\nlarge number of pigeon holes. Be- means of a miniature theater conLate in the second quarter SyraAn anonymous freshman stand- interesting antiques are to be found<br />\ncuse kicked off, but soon had the<br />\nthese<br />\nneath<br />\nthere<br />\ntwo<br />\nsmall<br />\nare<br />\nthis<br />\nstructed<br />\nsummer.<br />\ning at \"Doc's\" counter expressed in the Trustees' Room,in the ChemThe toy playshop, which was built ball on the 50-yard line and again<br />\nhis willingness to suffer<br />\npaddling ical Laboratory. There they have drawers for cash and smaller books.<br />\nstarted for the Jays' goal line. A<br />\nthis year in order to enjoy the priviA notice on the inside of the door by William B. Banks, art director<br />\nof line plays put the ball on<br />\nseries<br />\nbeen given a conspicuous position<br />\nlege of inflicting<br />\ngives the information that the safe of the campus dramatic organiza- the 17-yard line. Here, on a delayed<br />\nit on frosh next<br />\ntion, is an exact reproduction of the<br />\nyear. Z. Townsend Parks, a fresh- at the head of the long room and are<br />\nwas made by the patentee, Jesse stage of the Lyric Theater.<br />\nforward pass, Barbuti received a<br />\nman, is frankly skeptical of the used as a part of the regular furniDelano, of Water Street, New York. When entirely completed, it will long toss from Baysinger and scurgO04 intentions<br />\nof the sophomores. ture.<br />\nAt the present time the safe holds be furnished with footlights, ried across the line for his second<br />\n'Veil get the paddles, don't you<br />\nwould<br />\nThe<br />\nprobably<br />\nnot<br />\nbe<br />\nsafe<br />\n\"floods,\" back drops, curtains and touchdown. Again Brophy kicked<br />\n\\yorry,', he commented, \"and I inthe minutes of the Trustees.<br />\ngoal.<br />\ngiven much consideration today if it<br />\ntend to use them next<br />\nOur interest is at once gained all the other equipment of a real<br />\nyear.\"<br />\nHopkins then started their vicious<br />\ntheater.<br />\nAfter all, the question is still open were not for its cluster of associa- and held by the large, dark, earlypassing attack, which resulted in<br />\nBy<br />\nthis<br />\nsmall<br />\nof<br />\nmeans<br />\nstage<br />\nit<br />\nto conjecture, because Sergeant tions. It is about three feet high American desk, which Johns Hopwill be possible to experiment with the Jays' only touchdown of the<br />\nFrank says he has not yet made up and made of iron, with a massive<br />\nformerly<br />\nkins<br />\nused in his office. various shades of light and arrange contest.<br />\nhis mind on the subject.<br />\ndoor and heavy iron rollers. The<br />\nminiature scenes.<br />\n(Continued on page 5, column 5)<br />\n(Continued on page 4, column 2)<br />\nBLANDI OF SAME OPINION<br /><br />\nf I<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 11, 1927<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nUniversity. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br /><br />\nHopkins<br /><br />\nUniversity 0100<br /><br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\nMORTON HAMBURGER, JR., '28<br /><br />\nAssistant Managing Editor<br />\nDONALD Hiss, '29<br /><br />\nManaging Editor<br />\nNORMAN B. GARDINER, JR., '28<br /><br />\nColumnist<br />\nALEXANDER C. WOODS, JR., '28<br />\nAssociate Editors<br />\nGEORGE E. BANKS, JR., '29<br />\nRALPH KIRKLEY, '28<br />\nPHILIP W. NESS, '29<br /><br />\nJunior Editors<br />\nRICHARD H. WOOD,'29<br />\nW. PURNELL HALL, JR.„ '30<br />\nROBERT F. SKUTCH, '30<br />\nWILMER H. DRIVER, '29<br /><br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nA. BERNARD CHANCELLOR, JR., '28<br />\nLEONARD B. NOLLEY, '29<br />\nAARON GOLDSTEIN, '29<br />\nGEORGE GUMP, '30<br /><br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nSAMUEL M. HECHT,'29<br />\nCirculation Manager<br />\nGEORGE M. GLAZIER. '20<br /><br />\nAdvertising Manager<br />\nZANVYL KRIEGER, '28<br />\nAssistant<br /><br />\nBusiness<br /><br />\nManagers<br />\nJOHN YOUNG,'30<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nPHILIP COWLES,'30<br />\nROBERT MYERS. 29<br />\nALVIN BLUM, '30<br /><br />\nDONALD C. WEILLER,'28<br />\nA. H. MORTON,'30<br />\nW. GRAHAM BOYCE, JR., '30<br />\nJOHN LOTZ, '30<br />\nWILLIAM RAFFEL,'30<br /><br />\nPHOTOGRAPHIC DEPARTMENT<br />\nManaging Editor<br />\nWILLIAM B. BANKS. '20<br /><br />\nStaff Photographer<br />\nVERNON SCHEIDT, '28<br />\nAssistant Photographers<br /><br />\nGEORGE R.<br /><br />\nWILLIAM S. PIKE,'29<br /><br />\nHILL, '29<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by Fleet-MeGinlv. Ttw<br /><br />\n\"<br /><br />\nCandler Buildin, Baltimore, Md.<br /><br />\nNO, THIS ISN'T A JOKE<br />\nFour classes hold their elections this week. Probably eight sets<br />\nof caucuses will be held—or possibly have been held—this week.<br />\nOf course, we realize that it is necessary to have some system in<br />\nselecting the man for whom you are going to vote. When two or<br />\nthree or four equally good men are up for an office, it is so hard<br />\nto decide who is really the best man. Therefore, why not let's<br />\nget together with the Mu Pis and see if we can't get Bill elected<br />\nsecretary? After all, he's 'as good as anybody else, and he is our<br />\nfraternity brother.<br />\nThis line of reasoning is almost irrefutable, now isn't it? If<br />\nBill is just as good as anybody else, and you like Bill a little better<br />\nthan the rest, why not try to get Bill into office? But unfortunately, in many cases, Bill isn't as good as the other fellow, though<br />\nhis followers may not realize it. The second step of the argument<br />\nholds good anyway, and a big combine is formed to insure Bill's<br />\nelection.<br />\nBill is elected. The other crowd cries \"Politics!\" just as loudly<br />\nas Bill's crowd would have yelled if Bill had been defeated. The<br />\nMu Pis slander the Zi Delts for eight months, but Bill is secretary.<br />\nAny exhortation to eliminate politics from student elections<br />\nusually calls forth either snickers or cynicism or utter disregard<br />\nof the exhorter. Is it absolutely impossible for a man to be<br />\nelected_ to office purely on his own qualifications? Or must the<br />\nbartering ability of his friends decide the issue? It usually does.<br /><br />\nAN IRRADIATION OF -HIGHER EDUCATION\"<br />\nAn advertisement in the May 28 issue of the Harvard Crimson<br />\nappealed so strongly to our sense,of humor that we have been<br />\ntempted to quote part of it in this column. An enterprising group<br />\nof people, trading under the name \"The College Tutoring Bureau\"<br />\nhas gathered together \"complete, accurate, reliable, well-typed<br />\nreviews and notes\" of most of the popular courses in the university and offers them for sale to those who need preparation for<br />\nthe final examinations.<br />\nThe list includes numerous courses in all departments. For<br />\nexample, one can secure this most invaluable crutch for English<br />\n28, 2, 11b, 33, 29b, 35b, 50b, 73, 41 and 48. Other subjects are not<br />\ncovered quite as exhaustively, but the assortment is ample. Some<br />\ncourses come under the general heading of the advertisement, but<br />\nothers are favored with a more detailed blurb. Students taking<br />\n\"Psychology A,\"for example, could secure \"a complete outline<br />\nof text-book and all lectures.\" And as an added. inducement:<br />\n\"a short, snappy outline of the Essential Rules of German Grammar given away without charge\" to German A students.<br />\nNo wonder Brother Mencken rants against the colleges! Maybe<br />\nthe only reason why nobody has tried out this admirable method<br />\nof'making money here at Hopkins is that the undergraduate body<br />\nis too small to make the venture worth while. Nevertheless, such<br />\n• organizations as \"The College Tutoring Bureau\" strike us as being<br />\nvery forceful arguments for the New Plan.<br /><br />\nThe Geneva School of<br />\nInternational Studies<br /><br />\nTHREE to FIVE MINUTES<br />\nto FORTY THEATRES<br />\nAND AllSHOPS<br /><br />\nHOTEL<br />\nBy LEON SACHS<br /><br />\n• s<br />\nfiAmE<br /><br />\nTIMES SQUARE<br />\nNEW YORK CITY<br />\ntary Union and Noble Prize Winjust di Broadway&amp;<br />\nner; Professor Andre Siegfried<br />\n1 Sr<br />\n'<br />\n109-13wEsT45'<br />\n(France), of the Ecole des SciSend pastalfor<br />\nA9tes &amp;Booklet<br />\nences Politiques; Lord Meston and<br />\nW. yOHNSON QUM<br />\nSir John F. Williams (Great BritPrenxiatt<br />\nain); Paul Mantoux (France),<br />\nand Professor Wm. Rappard<br />\n(Switzerland). Among the noted<br />\nAmerican lecturers were Professors<br />\nIrving Fisher of Yale and E. R. A.<br />\nSeligman of Columbia. In the two<br />\npreceding years lectures were delivered by Viscount Cecil, Dr. Edward<br />\nBenes, Paul Hymans, Manley 0.<br />\nHudson, and Gilbert Murray.<br />\nIn passing, it might be of interest<br />\nto note that Professors Zimmern,<br />\nWe are Agents for the<br />\nJaeckh, Siegfried, and Mantoux<br />\nCORONA, ROYAL,<br />\nhave recently lectured at Johns<br />\nUNDERWOOD &amp; REMINGTON<br />\nHopkins.<br /><br />\nIn the spring of 1924, representatives of various European national<br />\nstudent organizations, while meeting in Prague to form the Federaion Universitaire Internationale (F.<br />\nU. I.), called upon their honorary<br />\npresident, Professor Alfred Zimmern, to undertake the establishment of some international educational center from which might emanate a better understanding of international affairs, cultures, and<br />\npeoples. The task was begun, and<br />\nin the summer of 1925 Professor<br />\nZimmern established in Geneva<br />\nwhat is at present known as The<br />\nGeneva School of International<br />\nStudies. The school, holding summer sessions in French and English,<br />\nis largely supported by voluntary<br />\nPORTABLES<br />\nIII<br />\nsubscriptions and endowments, parThe personnel and variety of the<br />\nticularly from America. Mr. Owen<br />\nbody infatuates one who<br />\nstudent<br />\nWe can. furnish them in the<br />\nD. Young, known to every Hopkins<br />\nwithin<br />\ncouped<br />\nhas<br />\nbeen<br />\nheretofore<br />\nCIIEMICAL, ENGINEERING<br />\nwith<br />\nman because of his association<br />\nnationalistic<br />\nboundaries—however<br />\nor any other keyboard you may desire.<br />\nthe Page School, was designated as<br />\nhead of the American General Com- spacious. Although the vast maAmerimittee. Thus the Geneva School, jority of the students are<br />\nCall or Phone us.<br />\nnationsprouting originally from student cans, yet the tinges of other<br />\nthat is<br />\nminds, dominated and directed by. alities offer a human hue<br />\nM. W. LUCY 8r,. CO.<br />\npast<br />\nthe<br />\nDuring<br />\nstriking.<br />\nindeed<br />\nmature international intellects, has<br />\n104 W. Fayette St.<br />\nevery state, Calvert 5902<br />\nexpanded to such a degree of im- summer, practically<br />\nof China and<br />\n\"30 Years in the Business\"<br />\nportance that today it enjoys the with the exception<br />\ncause<br />\nThe<br />\nwas<br />\nrepresented.<br />\nJapan,<br />\ndistinction of being officially recogattributed to the absence of these<br />\nnized by the International Comirjt,<br />\noriental represtrital'ives-iTtiirliuge<br />\ntee on Intellectual Cooperation<br />\ndistance and expense involved in<br />\nCAR largest-selling<br />\nThe twofold design of the school,<br />\nquality pencil<br />\nthe<br />\nreiterate,<br />\nto<br />\nHowever,<br />\ntravel.<br />\nnamely, to train leaders in internain the world<br />\nof the representation<br />\ntional affairs, and to produce an en- diversity<br />\nstrikes one immediately. Czechs<br />\nlightened public opinion, manifests<br />\nPoles, Germans and French,<br />\nand<br />\nitself in the type and variety of lec17<br />\nRussians and Americans, Englishtures that are given. During the<br />\nblack<br />\nmen and Indians—all sit side by degrees Superlative in quality,<br />\nfirst month the emphasis is laid on<br />\neither in delight or embarrassside<br />\nthe world-famous<br />\nnational tendencies and on the<br />\n3<br />\ntheir<br />\nof<br />\nas the virtues or vices<br />\nforces making for diversity. Lec- ment,<br />\ncoining<br />\ncountries are expounded<br />\nrespective<br />\ntures are given on the geographical,<br />\nAt an<br />\nlecturer.<br />\ndealers<br />\nracial, social and economic factors by the<br />\nAn Indian, Welshman and Ameraffecting international relations, on<br />\nBuy give best service and<br />\nassociate<br />\ncan<br />\nexample,<br />\nfor<br />\nican,<br />\nlongest wear.<br />\na<br />\nthe foreign policies of the principal<br />\nPlain ends,per doz.<br />\n$1.00<br />\nfor<br />\nreadily,<br />\nvery<br />\nanother<br />\none<br />\nwith<br />\ndozen<br />\nRubberends,per doz.<br />\n1.20<br />\nworld powers, and on the culture<br />\nground between American Pencil Co., 215 Fifth Ave.,N.Y.<br />\ncommon<br />\na<br />\nis<br />\nthere<br />\nothers.<br />\nmany<br />\nof<br />\ninstitutions<br />\nand<br />\nMakersofUNIQUEThin Lead<br />\nDuring the second month, the em- them—the same language. How- Colored Pencib in 12 colors—$1.00 per doz.<br />\nphasis is laid on international ten- ever, what of the Germans, Poles<br />\nand Italians? Unless the three hapdencies and on the forces making<br />\npen to know either German, Polish<br />\nfor cooperation. The principal top- or Italian (which case is unlikely)<br />\nics treated are those concerning the they must resort to French. French<br />\nLeague of Nations, International is the international language, and is<br />\nLaw and Custom, and the various the medium by means of which<br />\nmany possiblle dilemmas are avertinternational tribunals such as the<br />\nNearly every student at the<br />\ned.<br />\nWorld Court and the Hague Court<br />\nSchool knows a bit of French at<br />\nof Arbitration.<br />\nleast, and even if one does not enter<br />\ninto a conversation with one's alien<br />\nII<br />\nbrother, there is a congenial bon<br />\nThe student at the school is par- jour at any rate. The American<br />\nticularly impressed with the savants students, as a group, inspired no<br />\nwhom Professor Zimmern brings doubt by 'their hereditary aloofness<br />\nto Geneva to lecture. During the from foreign entanglements, know<br />\npast summer, the list of lecturers less French than any other national<br />\nincluded such distinguished person- group—and what is even more<br />\nages as: Senator De Brouckere smiting—they don't care. The fibre<br />\n(Belgium), Belgian delegate to the lined American note could speak<br />\nLeague of Nations Assembly (1926 better French than twenty Poles.<br />\nHowever, this association of stuand 1927) ; Dame Rachel Crowdy<br />\n(Great Britain), chief of the Social dents, devoid of its humor, has realWelfare Section of the League; Mr. ly instructive and enlightening conJules Destree (Belgium), member sequences. To hear a Frenchman<br />\nof the International Committee on and a German amicably argue the<br />\nIntellectual Cooperation'; Professor question of Rhine forces is much<br />\nLouis Eisenman (France), of the more instructive than a hundred<br />\nSorbonne ; Professor Giuseppe Gal- newspaper editorials. \"To see how<br />\nCathedral and<br />\nlivresi (Italy), of the University of the other half lives,\" to understand<br />\nMilan; Dr. Ernest Jaeckh (Ger- and sympathize are treasures which<br />\nMadison Streets<br />\nmany), of the Hochschule fiir Poli- each and every student carrie5_ away<br />\nik ; Dr. Christian Lange (Norway), from the Geneva School. InternaSecretary of the Inter-Parliamen- tional goodwill is the aftermath.<br /><br />\nTYPEWRITERS<br /><br />\nse<br /><br />\nhi<br />\nqi<br /><br />\nfo<br />\ndt<br /><br />\nbe<br />\nto<br />\ngi<br /><br />\nhi<br />\nge<br /><br />\nof<br />\nto<br /><br />\nali<br />\ntu<br />\nci<br />\nft<br /><br />\ntn(I<br />\no<br />\nc<br /><br />\nof<br /><br />\nas<br />\ndi<br /><br />\nrn<br /><br />\nlo<br />\nSi<br />\n11<br />\nci<br /><br />\nti<br /><br />\nt<br />\nf<br />\nc(<br /><br />\na<br /><br />\n- •.<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br /><br />\nMAIL<br /><br />\nIt<br /><br />\nAG<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br /><br />\nCarl J. Doederlein<br />\nDIAMONDS<br /><br />\nSTE1 SON<br />\nHAI S<br /><br />\nMfrs. of Fraternity Goods of All Kinds<br />\n504 PARK BANK BUILDING<br /><br />\nADVICE TO FROSH<br /><br />\n'<br /><br />\nTo The Editor of the News-Letter.<br /><br />\n1<br /><br />\n1<br /><br />\n)N<br /><br />\nire.<br /><br />\n).<br />\nSt.<br /><br />\n19<br /><br />\n11<br /><br />\nDear Sir :.<br /><br />\n(Lexington at Liberty Sts.)<br />\nA rather unusual result of a survey, recently conducted at PrinceAdvance Showing of<br />\nton, on the number of men working<br />\ntheir way through the university ,t1<br />\n)<br />\nshows that the majority of these<br />\nstudents are graduates of preparaoa<br />\nb<br />\nfor FALL<br />\ntory schools rather than public<br />\nschools.<br />\n$292&amp; $34.50<br /><br />\ntet5on (M*5<br /><br />\nFreshmen, counsel among yourselves. Your ways lie far before<br />\nYOU. Your future is your own.<br />\nYou are entering a new phase of<br />\n* * * * *<br />\nlife, a new era to which you will reFor the new seaquire adapting. Take heed to the<br />\nson we have asAnother of our universities has sembled<br />\nthe finest<br />\nfollowing advice and carry on your joined the ranks of the other educa- variety of men's<br />\nsuits it has ever<br />\nduty with the spirit of men who will<br />\ntional institutions who have forbid- been our privilege<br />\nbe outstanding figures in the years<br />\nden the use of automobiles to stu- to present. Styles<br />\nfounded on careto come. Among you is one who<br />\ndents. Wesleyan University has is- ful study of the<br />\nfashion trend as<br />\nWill lead you far on the paths of<br />\nsued an edict prohibiting sopho- indicated by the<br />\nglory, propound your cause to the mores<br />\nand freshmen from using best dressed men<br />\na this country<br />\nhighest court, and make himself cars and allowing only those<br />\njuniors and Europe. These<br />\ngenerally worthy of the conferred and seniors to do so who are given patterns will be<br />\noffered for your<br />\nname of President. There is one written permission by their parents. approval<br />\nas well<br />\nof you -fitted to hold each office open The only remaining alternative as a complete line<br />\nof toPcoats,overto the election. Go to the polls seems to be bicycles or airplanes. coats,<br />\nand our<br />\nspecially<br />\npriced<br />\najive to the responsibility of the fu* *<br />\n* *<br />\ntuxedo at $34.50.<br />\nture and with the interest of your<br />\nCarnegie Tech still maintains a<br />\nClass at heart.<br />\nAT 22 S. HOWARD ST.<br />\nunique tradition—a survivor of past<br />\nYou :have a great many good days when first year men were freshfriends; we all have, but have they men. All frosh must be cleansed \"Nationally<br />\n\"Justly<br />\nthe qualities of leadership that are<br />\nFamous<br />\nKnown\"<br />\nof past juvenile sins. The procenecessary for the holding of these dure is carried out by the use of<br />\noffices? Are they men of charac- copious quantities of water upon<br />\nBaltimore<br />\nter; leaders? Have they that degree the pajama clad yearlings in front<br />\nof stick-to-itiveness that would of the girl's dormitory.<br />\nclassify them as workers? Judge<br />\n* *<br />\n* *<br />\nas men; size up your classmate candidates and mentally contrast their<br />\nIn connection with the passing of<br />\ngood points. Balance their merits<br />\nfreshman regulations and traditions<br />\nwith their faults and choose your<br />\nman, not because he is a \"good fel- which are gradually being cast into<br />\nlow\" or a smooth talker, but because discard by many universities and<br />\nyou know by process of sane rea- colleges, as is being gradually exsoning and heartfelt interest that perienced by Hopkins, the school<br />\nhe is the right person to lead and<br />\npaper Rensellaer Polytechnic has enchampion the class of '31.<br />\ntered an urgent appeal for assist-duce.<br />\nThey claim that the most<br />\nR.\\\\. F.<br />\nessential experiences of college life<br />\nare being lost and implore an immediate reverting to the old regulaNAIVE IF NOTHING ELSE<br />\ntions.<br />\nTo the Editor of the News-Letter—<br />\n* * *<br />\nDear Sir:<br /><br />\n3<br /><br />\neltyied<br />\noryoung Xen<br />\nj<br /><br />\nA<br /><br />\nuthorities in dress are directing men's attention a little more toward formal shapes in soft<br />\nhats. The new Stetsons of this type are particularly smart and becoming; and are, of course,<br />\nhand-blocked to Stetson quality standards.<br />\nEight Dollars and up<br /><br />\nTaking,theguess<br />\nOut(1GAS<br /><br />\nInsufficient enrollment has resulted in the cancellation of the proposed round the world cruise in the<br />\nco-educational \"floating university,\"<br />\nthe Aurania. A total of only 214<br />\nstudents had registered. A. J. McIntosh, in charge of the cruise for<br />\nthis year, reiterates, however, his<br />\nbelief in the feasibility of co-education.<br /><br />\nWe freshmen are wearing green<br />\nties this year. We freshmen are<br />\nwearing black socks this year. And<br />\nthis year we freshmen are wearing<br />\nfreshmen buttons. Which, of<br />\ncourse, is all good and proper. We<br />\nwear these things so people will<br />\nknow we are freshmen. Upperclassmen probably think that people could tell that anyway, but<br />\nWe know that unless the actual<br />\nfreshmen are somehow distinguishThe time may come perhaps in<br />\ned the layman would consider sophomores freshmen; i. c., people who this day of splurges for higher eduare fresh should be called fresh- cation and better pupils when only<br />\nmen.<br />\nmarried students will be admitted<br />\nGreen ties on the campus are into our institutions of learning.<br />\nquite the thing. Very stylish and a Statistics compiled at the Univermark of respect. The professors sity of California show the grades<br />\nlook up to us because of it, you of married students to be superior<br />\nknow. But off the campus, a green to those of the unmarried.<br />\ntie becomes an eccentricity. An example of this occurred the other<br />\nday to the writer. Three female<br />\nDr. Harvey W. Wiley, an eminent<br />\nscholars from Western High School<br />\nauthority<br />\non education, has recently<br />\naccosted me one day as I was peacefully walking homeward. The mere come to the support of the smaller<br />\nfact that they were total strangers colleges. He praises their educato me did not deter them from tional value to the student<br />\nas being<br />\nmanifesting an interest in my ap- of far more worth than anything<br />\nthe<br />\npearance, or rather my tie's appear- big colleges and universities<br />\nmay<br />\nance. In fact, they liked my tie so<br />\nmuch that they offered to buy it. offer. There seems to be some conThey were told in reply that any solation for us small boys even if we<br />\noffer would be considered after the can't win football games.<br />\nChristmas holidays.<br />\nThat is the way it goes. UpperLiberal policies in teaching again<br />\nclassmen must be humored, so we<br />\ncome<br />\nto the front with a recent<br />\nhumor them with our green ties,<br />\ns_isacks, et al. We shall consider to action by Harvard University in redo so<br />\nuntil the freshmen have con- ducing classroom work from 29<br />\nclusively beaten the sophomore class weeks to 23 weeks during the year.<br />\nfootball, baseball, track, class The student<br />\nis expected to devote<br />\nrush, or what<br />\nhis time during those six weeks to<br />\nhave you?<br />\nR. T. C. • individual research.<br /><br />\nCIENTIFIC research is one important method<br />\nadopted by the gas industry to bring about universal use of gas for industrial heating purposes.<br /><br />\nS<br /><br />\nScientific study is being pursued at such institutions as the University of Illinois, University of<br />\nMichigan, Johns Hopkins, Massachusetts Institute<br />\nof Technology, American Institute of Baking,<br />\nAmerican Gas. Association testing laboratory, and<br />\nin many other institutions, besides the laboratories<br />\nmaintained by individual gas companies.<br />\nScience takes nothing for granted. The gas<br />\nindustry believes that its product will eventually<br />\nserve for every heat needed, and the purpose of all<br />\nthis investigation is to bring about the universal use<br />\nof gas in the most assured manner with the least<br />\npossible loss of time.<br />\nIndustrial concerns in all lines of business should<br />\nkeep themselves informed on the recent adaptation<br />\nof gas to their own industries.<br />\nWrite to your gas company for information, or to<br /><br />\nAmerican Gas Association<br />\n420 Lexington Avenue, New York City<br /><br />\nYOU CAN DO IT BETTER WITH GAS<br /><br />\nA<br /><br />\nA<br /><br />\nL.<br /><br />\nA<br /><br />\nAh<br /><br />\nAL<br />\nElk=<br /><br />\niira:11111111111111111::11<br /><br />\nA<br /><br />\nA<br />\nI.'<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br /><br />\n4<br /><br />\nSpeaking of Sports SYRACUSE DEFEATS<br />\nFIGHTING JAY ELEVEN<br />\nThe Iron Men of Brown last Sat-<br /><br />\nHome—HO. 2095-J<br /><br />\nPlione, CAL 1380<br /><br />\nFRANCES T. BANNON<br /><br />\nSuccessor to HARBAUGH &amp; BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\ndefeat<br />\ncolumn<br />\n5)<br />\npage<br />\n1,<br />\nfirst<br />\n(Continued<br />\nfrom<br />\ntheir<br />\nurday suffered<br />\nStenographic Dictation, Copying,<br />\nsince Tuss McLanghry became<br />\nMultigraphing, Mimeographing<br />\nWith the opening of the second<br />\nBaltimore, Md.<br />\nmentor of the Providence team last half, Hopkins resumed its vigorous<br /><br />\nyear—in fact, since Harvard beat<br />\nFur<br />\nthe Brownians in 1925.<br />\nYoung's eleven representing the<br />\nUniversity of Pennsylvania did the<br />\ntrick in a terrific battle, the final<br />\nscore reading Penn, 14; Brown, 6.<br />\nBrown was a favorite, and only<br />\na few dared back the inexperienced<br />\nPenn eleven. Even at the end of<br />\nthe first half, according to reports,<br />\nthe Penn followers were hoping at<br />\nthe best for a tie score.<br />\nThe turning point of the game<br />\ncame in the third period, however.<br />\nWith Brown in possession of the<br />\nball on their own 23-yard line, Ray<br />\nRandall, Brownian quarterback and<br />\none of last year's Iron Men, called<br />\nfor a forward pass from a kick formation. Paul Scull, of Penn, who<br />\nhappened, incidentally, to be the<br />\nstar of the afternoon, intercepted<br />\nthe attempted pass and ran for a<br />\ntouchdown.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nRumor has it that the Brownian<br />\nbackers claim that the weather conditions caused the Iron Men to become rusty between the halves.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nYale received an unpleasant surprise last week-end in the form of<br />\nthe University of Georgia. What<br />\nwas expected by the Eli team to be<br />\na rather difficult work-out turned<br />\nout to be a tragedy. Georgia won<br />\nits first football game from Yale,<br />\n14-10.<br />\nThe Blue team outplayed the<br />\nSoutherners in every phase of the<br />\ngame, except in supplying the final<br />\npunch, earning twelve first downs<br />\nto Georgia's five. Fumbles at crucial moments were instrumental in<br />\nYale's defeat.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nattack and clearly outplayed their<br />\nopponents. Not only were the Syracuse players held scoreless, but at<br />\nonly one time did they seriously<br />\nthreaten. This threat came near the<br />\nend of the third quarter, when Baysinger intercepted Lyons' pass, putting Syracuse in Hopkins territory.<br />\nA kicking duel developed between<br />\nLyons and Baysinger during this<br />\nperiod. Lyons' punts were almost<br />\nperfect and on every exchange Hopkins gained ground.<br /><br />\nGood enough<br /><br />\nA. H. FETT1NG<br />\nMANUFACTUR LNG JEWELRY<br />\nCO.<br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n213 N. LIBERTY STREET<br /><br />\nfor Dad—<br />\ngood enough<br />\nfor you<br /><br />\nA<br /><br />\nYELLOW CAB STAND<br />\nAT<br /><br />\nHOMEWOOD FIELD<br /><br />\nCaplan Intercepts Pass<br /><br />\nImmediately after the start of the<br />\nfourth quarter, Caplan thrilled the<br />\nstands by intercepting a forward<br />\npass on his own 10-yard line and<br />\nracing 30 yards before he was<br />\nfinally downed by an Orange tackler.<br />\nTwo incompleted passes forced<br />\nHopkins to punt, but Manning fumbled and recovered on Syracuse's<br />\n30-yard line. A varied and bewildering attack, consisting mainly of<br />\nforward passes, brought Hopkins to<br />\nthe 8-yard line and gave the Jays<br />\na first down. Hopkins now changed<br />\nits tactics and resorted to line<br />\nplunges. After coming within one<br />\nyard of the Syracuse goal, the<br />\nOrange line held. Baysinger punted<br />\nfrom behind his line into safe territory. Again the Jays began a determined march on the Syracuse goal,<br />\nonly to be cut short by an intercepted forward pass on the 15-yard<br />\nline. Syracuse again kicked out of<br />\ndanger to end the contest.<br /><br />\nNo Charge for Extra Passengers<br /><br />\nots do gei More<br />\nMileage fro<br /><br />\n'PHONE<br /><br />\nVERNON 1212<br />\nFOR A<br /><br />\nYELLOW CAB<br /><br />\nMILES OFMILES<br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br /><br />\nBETHOLINE<br /><br />\n17<br /><br />\n\"THE WONDER MOTOR FUEIr<br /><br />\nAn injury to his arm forced Mallonee to retire from the game in the<br />\nsecond quarter. Houston, who replaced the Jay captain, showed alertness in handling Pindell's pass. At<br />\nleast three players had touched the<br />\nball before Houston grabbed it out<br />\nof the air.<br /><br />\n_<br /><br />\nPindell looked very good ill his<br />\nwork of backing up the line. Baysinger was the star for the Salt City<br /><br />\n•<br /><br />\n*.•<br /><br />\noutfit.<br /><br />\nGiving a remarkable demonstration of the Knute Rockne type of<br />\nfootball, Purdue downed Harvard<br />\nSaturday, by the score of 19 to 0.<br />\nRalph Welch, substituting for<br />\nCotten Wilcox,the star of the Western team, was the outstanding performer of the game. His punting,<br />\npassing, interference and defensive<br />\nplay were almost perfect, and the<br />\nCrimson eleven, who were considered the likely victor provided Wil.cox did not play, never had a<br />\nchance.<br /><br />\nRichmond, which gave the Jays<br />\nplenty of trouble during the humid<br />\nafternoon of opening day, took a<br />\nterrible walloping at the hands<br />\nof Cornell. The Spiders were<br />\nswamped, 58 to 0.<br /><br />\nFuture opponents of the Jays experienced unsuccessful afternoons,<br />\nwith the exception of Columbia and<br />\nSt. John's. North Carolina defeated Maryland, 7 to 6; Catholic<br />\n* * * * *<br />\nUniversity downed Loyola, 19 to<br />\nPurdue nearly ran up the score 12, and Ursinus gained a 7-to-0 verstill higher. When the final whistle dict over Delaware. Haverford lost<br />\nblew the Western team had the ball to Amherst, 14 to 0. St. John's<br />\ndrubbed Gallaudet, 20 to 0, and<br />\non Harvard's three-yard line.<br />\nWesleyan fell before Columbia, 28<br />\n* * * *<br />\nto O.<br /><br />\nMaryland tasted defeat for the<br />\nfirst time this season, North Carolina nosing the Terrapins out by the<br />\nscore of 7 to 6. The field was turned<br />\ninto a literal quagmire by the rain,<br />\nreports stated, making play almost<br />\nimpossible.<br />\nThe Old Liners, evidently, clearly<br />\noutplayed the North Carolina team,<br />\nhaving the ball in the Southerners'<br />\nterritory throughout the majority of<br />\nthe second half.<br />\n*<br /><br />\n*<br /><br />\n*<br /><br />\nThis defeat eliminates Maryland<br />\nfrom any chance of winning the<br />\nSouthern Conference title. Boasting of one of the best teams to ever<br />\nrepresent the College Park institution, it was expected that Maryland<br />\nwould go fa,in the Conference this<br />\nseason.<br /><br />\n........,<br /><br />\n\"..<br />\n.0',<br /><br />\nf<br />\n------...<br /><br />\n- 4...,L05-1114:<br /><br />\nUndiscovered<br /><br />\ncountry<br />\nin industry<br /><br />\nLine-up and score:<br />\nSYRACUSE<br />\nJOHNS HOPKINS<br />\nRaymond ......L. E.(Capt.) Mallonee<br />\nVan-Ness ......L. T... ..Liebensperger<br />\nBrophy .<br />\n..L. G.. ......Kaufman<br />\nPowell<br />\nNicolello .....Center<br />\nNewman,<br />\nKegan<br />\nR G<br />\nWinick<br />\nBiddison<br />\nR T<br />\nLewis<br />\nR. E<br />\nBoynton<br />\nQ B<br />\nBaysinger<br />\nLyons<br />\nGoldman<br />\nCaplan<br />\nL H<br />\nSebo<br />\nR H<br />\nLawrence<br />\nBarbuti (Capt.) F. B.. ...<br />\n. Pindell<br />\nSyracuse ...<br />\n... .7 14 0 0-21<br />\nHopkins<br />\n0 6 0 0— 6<br />\nTouchdowns—Goldman, Barbuti 2,<br />\nHouston. Point after touchdown—<br />\nBrophy 3. Substitutions—For Syracuse, Henward for Goldman, Loucks<br />\nfor Henward, Taylor for Van Ness,<br />\nHenward for Loucks, Manning for<br />\nHenward, Richtmeyer for Raymond,<br />\nGoldman for Manning, Bizik for Sebo,<br />\nKapp for Brophy; Johns Hopkins,<br />\nBoyd for Powell, Houston for Mallonee. Referee—K. Dollenbeck, Pitt.<br />\nUmpire—A. W. Risley. Linesman—<br />\nH. E. Whiteside, Chicago. Time of<br />\nperiods—Fifteen minutes.<br /><br />\n101<br /><br />\n,<br />\n.....,..,..2....„....<br />\n..,......\":\"..;',Iltlii;\\1<br />\n4<br /><br />\nTHE globe's surface no longer 40's and 50's, charting the probable<br />\nholds much undiscovered country, trend of population and the requirebut the pioneer-minded man can still ments for service.<br />\nIn research and development, and<br />\nfind plenty of it in industry—particin telephone manufacture as well, the<br />\nularly in the telephone industry.<br />\nIn the Bell telephone companies Bell System takes seriously its responthroughout the entire country, men sibility to give adequate service now<br />\nare now exploring the 1930's and and to gird itself for a long future.<br /><br />\nBELL SYSTEM<br /><br />\nA nation-wide system gf i 8,000,000 inter-connecting telephones<br /><br />\n\"OUR<br /><br />\nPIONEERING<br /><br />\nWORK<br /><br />\nHAS<br /><br />\nJUST<br /><br />\nBEGUN\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br /><br />\n)<br />\nc4<br />\n'<br />\nc A1<br />\nelvett)JireProor<br />\nBONAIRATANDERBILT Hotelat Augusta, Georgia<br />\nA.E.MARTIN,Manager<br />\nAN IDEAL CHOICE<br />\nFOR THE<br />\nCHRISTMAS HOLIDAYS<br /><br />\nGoy—Tennix—ilfotoring<br />\nRiding—Shooting<br /><br />\nA<br /><br />\nRRANGE with your relatives and friends to pass<br />\nyour Christmas vacation Days at this famous center<br />\nof social and sports activities in the \"Sunny South\".<br />\nThe hotel has 400 delightful rooms with private baths<br />\nand every modern convenience for its guests. Vita glass,<br />\nadmitting the full benefit of the sun's ultra-violet rays, has<br />\nbeen made a feature of the Solarium.<br /><br />\nTWO 18-HOLE CHAMPIONSHIP GOLF COURSES<br />\nGrass Greene<br />\nCR A SS greens now on both grass tees and grass greens. A<br />\n\"J<br />\ne courses.The Hill Course,under the supervision of Donald<br />\nRoss, has now been lengthened<br />\nto 6,500 yards and equipped with<br /><br />\ncomplete water system on the<br />\nHill Course and the Lake Course<br />\ninsures perfect turf on all<br />\nfairways.<br /><br />\nThrough compartments and Pullman cars daily New York to Augusta.<br />\nThrough Pullman service from Chicago.<br /><br />\nThe New Fireproof<br />\nCHAMBERLAIN-VANDERBILT HOTEL<br />\nOld Point Contiort, Virginia<br />\nroof garden, large convention hall.<br /><br />\nApril 1, 1928 this new hotel will open<br />\nas an all - the-year Tourist Hotel.<br />\nOperated on the American Plan,<br />\nIt contains 300 bedrooms and bathrooms; an indoor swimming pool,<br /><br />\nThere you will find good fishing; seabathing; the Hampton Roads Golf<br />\nClub within 10 minutes; horseback<br />\nriding; tennis and shooting.<br /><br />\nCHURCHES TO FETE<br />\nVISITING STUDENTS<br />\nNeighboring Congregations<br />\nTo Give Dinner<br /><br />\nOLD DESK NOW IN C. L.<br />\nFIELD CLUB PAYS<br />\nVISIT TO ANT NESTS<br />\nAnt nests at Beltsville, about<br />\nthirty or forty miles from<br />\nBaltimore, were the objective<br />\nof the Field Club on their first<br />\ntrip of the year, last Saturday.<br />\nAccording to Mr. Light, secretary of the organization, a<br />\nnumber of trips will follow,<br />\nplans for which have not yet<br />\nbeen definitely formulated.<br /><br />\nChurches in the vicinity of Hopkins will give a dinner to out-oftown students of the University<br />\nThursday at six-thirty. This dinner, which will be held at the University Baptist Church, replaces the<br />\nannual reception of former years.<br />\nDr. John C. French will act as<br />\ntoastmaster and Dr. J. M. T. Fin- Rifle Team Needs<br />\nney, prominent Baltimore surgeon,<br />\nCandidates Badly<br />\nwill be the principal speaker. The<br />\nWith but one letter man back this<br />\ncommittee of arrangements for this<br />\naffair includes the Reverend H. N. year, the rifle team is at present in<br />\nArrowsmith, Lewis C. Moon and E.<br />\ndire straits for new men. An enA. Schaal.<br />\ntirely new team has to be built up<br />\nStudents Reception Saturday<br />\nThe annual International Stu- around Captain Bussard, and unless<br />\ndents' Reception will take place on<br />\nfrom<br />\nSaturday evening at the Friends promising material develops<br />\nof<br />\nthe<br />\nthe<br />\nincoming<br />\none<br />\nfreshmen,<br />\nMeeting House. This event is for<br />\nall foreign students studying in Bal- worst seasons in the history of Hoptimore, and precedes the full reor- kins sharpshooting is likely to reganization of the Baltimore Stu- sult.<br />\ndents' Cosmopolitan Club. At this<br />\nManager Plummer stated that the<br />\noccasion, last year; forty-six differRifle<br />\nClub would be considered an<br />\nent nations were represented.<br />\nCouncil<br />\nof<br />\nthe<br />\nY.<br />\nThe Friendship<br />\nactivity as usual, and urged all<br />\nM. C. A. will hold its first meeting freshmen tq sign up at the military<br />\nand dinner at the Friends Meeting office. Rifles and ammunition are<br />\nHouse next Tuesday evening. Mr.<br />\nthe men showing<br />\nTheodore McKeldin, secretary to furnished, and<br />\nMayor Broening, will make the ad- the greatest promise will be chosen<br />\nfor the team.<br />\ndress.<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nEsso<br /><br />\n5<br /><br />\n(Continued from page 1, column 3)<br /><br />\nOne's first impression is of the size<br />\nand height of the piece. Atop the<br />\nhuge desk top is a tall double bookcase with four glass paneled doors.<br />\nBeneath this is a row of pigeon<br />\nholels of various shapes and sizes.<br />\nThe desk is rather long and on each<br />\nside, beneath the top, is a set of four<br />\nwide drawers. Each of these is<br />\nequipped with a pair of large, round<br />\nhandles and an enormous keyhole.<br />\nThe top for the desk consists of<br />\nfour wooden panels, hinged together, two on each side, which can be<br />\nfolded out of the way to each end<br />\nand rested there on swinging arms.<br />\nWhen it is desired to cover the<br />\ntop, these panels are unfolded toward the center and there locked<br />\ntogether. The legs of the occupant<br />\nfit between the two sets of drawers<br />\nand it is here that one of the most<br />\ninteresting parts of the whole piece<br />\nis found. A large wooden foot<br />\nwarmer rests between the drawers<br />\nfor the comfort of the occupant.<br />\nHoles were drilled in the top for the<br />\nescape of the heat and one of the<br />\nsides can be lifted and hot bricks<br />\ninserted. In warm weather the<br />\nwarmer can be utilized as a foot<br />\nrest. The bookcase now contains<br />\na part of the interesting collection<br />\nof crockery of President Goodnow.<br /><br />\n7(5<br /><br />\nNEXT TRAIN<br />\nEAVE<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nYOU CAN ACTUALLY FEEL THE DIFFERENCE<br /><br />\nSTANDARD OIL COMPANY IIN. J.1<br /><br />\nESTABLISHED ENGLISH UNIVERSITY<br />\nSTYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES,<br /><br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\neatrter*owe<br />\nof Baltimore<br />\nThe character of the suits and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nDe<br /><br />\nHub<br /><br />\n7saltlinore, Charles and Fayette<br /><br />\nTo smoke wisely and well, choose Camels<br />\nirresistible reason for choosing this famous cigarette. Not for its<br />\npopularity alone, but for that superior<br />\nquality that produces it.<br />\nCamel wins its prestige with modern<br />\nsmokers by forthright value. It is rolled<br />\nof the choicest tobaccos that money<br />\ncan buy, and its blending is the taste<br />\nand fragrance triumph of tobacco<br />\nTHERE'S an<br /><br />\nscience.<br /><br />\nThe Camel smoker is tobacco fit. He<br />\nhas the best, with no scrimping or denial<br />\nof cost. There are no four-wheel brakes<br />\non Camel; no brakes at all. It is full<br />\nspeed ahead, straight for quality.<br />\nSelect Camel for smoking pleasure,<br />\nand you'll join distinguished company.<br />\nParticular, modern smokers have elected<br />\nit on the principle of superiority.<br />\n01927<br />\n\"Have a Camel!\"<br /><br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM, N. C.<br /><br />\n6<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1927<br /><br />\nSPEYER PROFESSOR<br />\nBEGINS LECTURES<br />\nDr. Enno Littman, Visiting Professor, to Deliver Genei al<br />\nLectures<br />\nDr. Enno Littman, the James<br />\nSpeyer Visiting Professor for 1927,<br />\nwill lecture before the Department<br />\nof Semitic Languages from October 6 until early in December. The<br />\nSpeyer Professorship was founded<br />\nin 1925 by James Speyer, a New<br />\nYork banker who gave the University the sum of $50,000, the income<br />\nfrom which is now being used to<br />\nbring a visiting professor from a<br />\nEuropean university each year.<br />\nGeneral Lectures<br /><br />\nBesides his lectures before the department, Dr. Littman will deliver<br />\ngeneral lectures probably on the<br />\nfollowing themes:<br />\n(1) The Origin of the Arabian<br />\nNights.<br />\n(2) The Literature of Abyssinia.<br />\n(3) Modern Arabic Folk-Literature.<br />\nThe subjects on which Dr. Littman will lecture before the Department of Semitic Languages follow:<br />\n(1) Arabic (classical, or the Muquaddins of Ibn Rbaldun, or<br />\nModum, Syrian, or Egyptian<br />\ndialect).<br />\n(2) Ethiopic (or another Abyssinean language, if required).<br />\n(3) Semitic inscriptions (Nabatean or Palmyrene of Preislamic Northern Arabic).<br /><br />\nSOPHS TO ELECT<br />\nOFFICERS TODAY<br /><br />\nNOTICES<br /><br />\nToday, at 12.30 P. M., the<br />\norganization of the sophomore<br />\nclass will be completed. Last<br />\nTuesday nominations for the<br />\nvarious class offices were taken<br />\nand after a reopening of nominations the ballot will be cast<br />\nthis afternoon.<br />\nAt the last meeting, which<br />\nwas the first one of the year,<br />\na lengthy discussion was held<br />\non the question of freshman<br />\nregulations. Nothing was decided, however, because the<br />\nmatter had been .put in the<br />\nhands of the Student Council<br />\nlast year. Joseph G. Blandi,<br />\npresident of the Student Council, conducted the discussion<br />\nin order that the Student<br />\nCouncil, through him, might<br />\nknow the sentiment of the<br />\nsophomore class on the matter.<br />\nFreshman regulations will<br />\nagain be brought up at the<br />\nmeeting today.<br /><br />\nSecretaries of all fraternities on the campus are requested to see Mr. Myers at<br />\nthe Postoffice and give him<br />\nthe addresses of their fraternity houses so that mail addressed to them may be distributed properly.<br />\nAll scholarship men who<br />\nhave not paid for their postoffice boxes, or class dues<br />\nand other fees, are also requested to see Mr. Myers.<br /><br />\nDr. French Has Too Many<br />\nDuties—Thompson Not<br />\nBack<br /><br />\nIn order to prepare for the intercollegiate debates of the late winter<br />\nand early spring, it is essential that<br />\nprospective material be sifted and<br />\nthe best given opportunities for<br />\npractice. The freshman-sophomore<br />\nand Adams Debates should therefore be held in November and December.<br />\nNorman B. Gardiner, secretary<br />\nand treasurer of the Council and<br />\nsole remaining senior member, will<br />\npreside at today's meeting.<br /><br />\nDecorations<br /><br />\nInterior Wood Work<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nDebating Council meets<br />\ntoday, 12:30, Room 112,<br />\nGilman Hall.<br />\nSenior elections Thursday,<br />\nimmediately after Assembly,<br />\nin Civil Engineering Hall.<br />\nPolls will be open until 1<br />\no'clock.<br /><br />\nLarge Crowd at Jay<br />\nDEBATING COUNCIL<br />\nCandidates'Rally<br />\nLOSES TWO MEMBERS A record-breakinggroup of can-<br /><br />\nLoss of the services of J. Carey<br />\nThompson and Dr. John C. French,<br />\npresident and faculty adviser of the<br />\nDebating Council, presents a serious<br />\nobstacle to the prospects of that<br />\nbody. Thompson is not returning<br />\nto Hopkins this fall, while Dr.<br />\nFrench finds himself too much taken up with his new responsibilities<br />\nas Librarian to be able to carry on<br />\nin the capacity of adviser to the<br />\nWas at Princeton<br />\nBefore coming to Hopkins, Dr. debaters.<br />\nLittman was the lecturer on SemiLast year Carey Thompson captic Philology at Princeton and the tained the winning junior team in<br />\nUniversity of Strassburg. He has he Adams Debate and distinguished<br />\nalso held professorships at the Uni- himself in debates with the Univerversity of Egypt and the University sity of North Carolina and with<br />\nof Bonn. Dr. Littman has written Washington and Lee. As president<br />\na number of works on Semitic Phi- of the Council, Thompson occupied<br />\nlology.<br />\na position for which he had been<br />\nWhile the study of Semitic Phi- carefully prepared by three years'<br />\nlology and other branches of the of debating.<br />\nSemitic languages does not hold<br />\nMeeting Today<br />\nmuch interest for the average stuThe<br />\nDebating<br />\nCouncil is to hold<br />\ndent at Johns Hopkins, the general<br />\nlectures given by Dr. Littman are its first meeting in Room 112, Gilexpected to be very attractive and man Hall, at 12: 30 today. Dr.<br />\nshould draw a large number of French's resignation will be tenundergraduates, since they will deal dered the Council at this time. The<br />\nmore with the literature of the East selection of a new adviser and electhan with the technicalities of its tion of a president will be the primary objects of the gathering; it is<br />\nlanguage.<br />\nThe gift of $50,000 which James probable that plans for the coming<br />\nSpeyer made to Johns Hopkins was year will also be adopted.<br />\none of the most liberal which the<br />\nUniversity has ever received, since<br />\nthe donor did not specify in what<br />\nmanner the funds should be used.<br />\nHowever, Speyer suggested that the<br />\nincome of the money should be used<br />\nto provide for a visiting lecturer<br />\nfrom Europe each year, 5(3 the University has followed his request.<br />\nThe professorship is not confined<br />\neach year to the Department of<br />\nSemitic Languages, as a lecturer in<br />\na different field is picked each year.<br /><br />\nFreshman class elections<br />\nwill be held today in the<br />\nChemical Laboratory, Room<br />\n101. Polls will be open<br />\n12:20 to 1.<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\ndidates for the combined staffs of<br />\nthe Black and Blue Jay presented<br />\nitself at the organization meeting of<br />\nthat publication in the Barn last<br />\nFriday night.<br />\nEditor-in-Chief Don White conducted the meeting, explaining the<br />\nworkings of the Jay and welcomed<br />\nthe candidates.<br />\nA novel plan for luncheons to be<br />\nheld at short intervals was announced as being under consideration. Candidates were signed up<br />\nfor their respective positions, and<br />\ntheir next meeting will be held this<br />\nThursday at 12: 20 in the Blue Jay<br />\noffice.<br /><br />\n1N%,<br />\n=<br />\n5,<br /><br />\nr4?<br /><br />\nARLINGTON HOTEL<br />\nIDEAL DOWNTOWN LOCATION<br />\nOne cfthe 4'M Notels<br /><br />\nOTHER.<br /><br />\nCAIRO<br />\n4-M I COLONIAL<br />\nFAIRFAX<br /><br />\nAWayS<br />\nA ROOM<br />\nA ROOM<br />\nWITH<br />\nWITH<br />\nRUNNING<br />\nPRIVATE<br /><br />\nHOTELS ii MARTINIQUE<br />\nWashington,D.0 TILDEN HALL<br /><br />\nWATER<br /><br />\n12,<br /><br />\nBATH<br /><br />\n13<br /><br />\nOPERATED BY MADDUX, MARSHALL, MOSS &amp; MALLORY INC<br />\n•••<br /><br />\nWRITE FOR A fRff COPY OF OUR 'I.00 PICTORIAL GUIDE MAP OF WASHINGTON<br /><br />\n&amp;traded<br /><br />\n*co.u.s.'sver ova<br /><br />\n&amp;OA,<br />\nThe Slickest Coaton the Campus!<br />\nNo well dressed college man<br />\nis without one. It's the original,correct oiled slicker and<br />\nthere's nothing as smart or<br />\nsensible for rough weather<br />\nand chilly days.<br />\nMade of guaranteed waterproof oiled fabric in yellow,<br />\nolive-khaki or black. Has<br />\nall-'round strap on collar<br />\nand elastic at wrist-bands.<br />\nClasp•closing style<br />\nButton-closing style<br />\nStamp the correct name in<br />\nyour memory and buy no<br />\nother.<br /><br />\ncfimideactchudott<br />\nair*.<br />\nThe \"Standard Student\" is<br />\nmade only by the Standard<br />\nOiled Clothing Co., N.Y.C.<br />\nSlip one on at<br /><br />\nWarner's - 18 E. Baltimore Street<br />\nCahn's Quality Shop - 128 W. Baltimore Street<br /><br />\nYou don't have to get set like a<br />\ndisciple of Spencer to write with a<br />\nWaterman's. Sit as you will, hold<br />\nyour pen as you like, it will write<br />\nthe instant the pen point touches<br />\nthe paper. For instant and unequaled service, Waterman's has no<br />\npeer.<br />\nWe recommend for college work<br />\nWaterman's 01854 R.R. The holder is<br />\nmade of stainless ripple rubber. A metal<br />\nlip-guard protects the cap from breaking;<br />\na pocket clip insures against loss, and a<br />\nsolid 14-carat gold nib will give service<br />\nfor years. It has a big ink capacity.<br /><br />\nThe dealer from whom you buy your<br />\nsupplies sells<br /><br />\nWaIermeals<br /><br />\nNo.<br />\n01854 R.R.<br />\n$500<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br /><br />\nSTUWHITEHEAD BACK HOPKINS<br />\nDENTS PROMIIN B. &amp; 0.<br />\nFROM EUROPE NENTFAIR<br />\nOF THE<br />\nIRON HORSE<br />\nDean of Engineering School Was<br />\nVisiting Professor<br />\nHONORED BY U. OF NANCY<br />\nStudied European Educational<br />\nMethods<br />\nDr. John Boswell Whitehead,<br />\nProfessor of Electrical Engineering<br />\nand Dean of the School of Engineering, has recently returned from<br />\na nine-month trip in Europe, where<br />\nhe was serving as Exchange Professor in Engineering and Applied<br />\nScience for a group of seven American universities.<br /><br />\nDuring his stay<br />\nabroad, Dr. Whitehead visited all<br />\nthe large cities in Europe. He spent<br />\nseven months in France, lecturing<br />\nin eleven universities. He spent<br />\nalso much time in England, Italy<br />\nand Switzerland.<br />\nDr. Whitehead was chiefly interested in Dielectric theory, insulation and high voltage; and at the<br />\nUniversities of Aix-Marseille, Grenoble, Lyon, Bordeaux, Toulouse,<br />\nCaen, Lille, Strasbourg, Nancy and<br />\nParis he delivered a series of lectures on these subjects. The complete series of nine lectures is to be<br />\nPublished by the Societe Francaise<br />\ndes Electriciens. In June he presented at the Conference Internationale des Grands—Reseaux- aux<br />\nHaines Tensions in Paris a lecture<br />\non High Voltage Insulation.<br />\nVisited Chief Laboratories.<br /><br />\nIn the various universities he visited, Dr. Whitehead made a careful<br />\nstudy of educational methods, particularly in the field of electrical<br /><br />\nNot the least ammig the factors<br />\nin the unprecedented success of the<br />\ngiant \"Fair of the Iron Horse\" has<br />\nbeen the work of three Hopkins<br />\nstudents employed by the B. &amp; 0.<br />\nRailroad.<br />\nWhen the great procession gathers on the far side of the vast exposition grounds, Harry Piet, a Hopkins senior, is the man of the hour.<br />\nHe it is who assembles the numerous floats to take part in the lengthy<br />\npageant. Piet is property assistant<br />\nto Mrs. Adele Gutman Nathan, pageant director. Mrs. Nathan takes<br />\nher station in a specially constructed<br />\ntower directly opposite .the grandstand. At the appointed hour she<br />\ntelephones across to Piet, who is<br />\nstationed on the other side of the<br />\nfield, and when all is in readiness<br />\nhe gives the signal for the pageant<br />\nto start.<br />\nRalph Kirkley, another Hopkins<br />\nsenior and associate editor of the<br />\nNEWS-LETTER, has been responsible<br />\nfor most of, the publicity connected<br />\nwith the pageant. He was engaged<br />\nin this sort of work for at least a<br />\nmonth and a half before the opening<br />\nof the exhibit. During this time be<br />\nwrote two feature stories each day<br />\nin addition to a variety of magazine<br />\narticles on topics of national inter-<br /><br />\n2st in the field of railroading. These<br />\nstories and articles which were concerned chiefly with different aspects<br />\nof the pageant, were published in<br />\nseven hundred newspapers throughout the United States. Since the<br />\nopening of the exhibit, Kirkley has<br />\nbeen sending out daily news bulletins to the Associated Press and to<br />\nother newspapers outside of Baltimore. These bulletins are graphic<br />\naccounts of interesting daily incidents at the great fair. Kirkley is<br />\nalso often called upon to write feature stories for Baltimore publications about the American Indians<br />\nand others taking part in the pageant.<br /><br />\nSeason ticket sales to date,<br />\nas far as known, amount to<br />\n$630.<br />\nUniversity of Pennsylvania<br />\nsold 30,000 season tickets<br />\nail $20 for their football<br />\nseason--a total of<br /><br />\nMr. F. X. Milholland, assistant<br />\nto the Senior Vice-President of the<br />\nB. &amp; 0. Railroad, spoke in the highest terms of Kirkley. He said he<br />\ncould not praise the young man<br />\nenough either with respect to his<br />\nabilities as a writer or as to his<br />\npersonal qualities. Kirkley's work<br />\nhas been all that could be desired,<br />\nhe said.<br />\nKirkley, himself, is enthusiastic<br />\nin his praise of the exhibit. \"It is<br />\nthe most interesting as well as the<br />\nbiggest thing of its kind that has<br />\never been staged in this country,\"<br />\nhe said.<br /><br />\n$600,000.<br />\nHow about it?<br />\nFRANK BROTHERS<br />\nFiftinAwntne Boot Shop<br />\nBetween 47th<br /><br />\nA type of shoe for<br />\neach need of the<br />\ncollege man<br /><br />\nAt L. Shaeffer's,<br /><br />\nRandolph Moore, also a Hopkins<br />\nstudent, drives a little Ford engine<br />\nwhich propels one of the floats in<br />\nthe pageant along the track. The<br />\nengine is concealed underneath the<br />\nfloat.<br /><br />\nAnd So the Day Was Utterly Ruined<br />\nYOU HAVEN'T A CARE. IN \"THE<br />\nWORLD AS you START OUT 70<br />\n„SEE THE BEST TEANJ THAT DEAR<br /><br />\nOLD .51wA5II HAS HAD IN YEAR5<br />\nw1PE Up YOUR ANCIENT RIVAL.<br /><br />\nSEATS ON<br />\n/ 'THE SO yARD<br />\nLINE! NOT BAP<br />\nEH !<br /><br />\nand 48th Streets, New York<br /><br />\n1800 E. Monument St.<br /><br />\nWatch this space<br />\nFORDYCE E. C. CAMPBELL<br /><br />\n•<br />\n•<br /><br />\n•<br /><br />\n•<br />\n•<br /><br />\nDined With Lindbergh.<br /><br />\nHe was in Paris at the time of<br />\nLindberg-h's flight. He did not witness the landing; however, he heard<br />\nthe plane flying over the city, and<br />\nlater attended a banquet in honor<br />\nof Mr. Lindbergh.<br /><br />\nBy BRIGGS<br /><br />\n\\W(<br />\n//////<br /><br />\nOne of the chief tributes paid<br /><br />\nDr. Whitehead's trip to Europe<br />\nwas made under the auspices of a<br />\ngroup of American universities:<br />\nCornell, Columbia, Harvard, Penn<br />\nState, Johns Hopkins, Yale and the<br />\nMassachusetts Institute of Technology. Five years ago this group<br />\nformed a commission for the exchange of Engineering professors<br />\nwith a similar group in France.<br />\nEvery other year a professor from<br />\neach country studies the electrical<br />\ndevelopment of the other and lectures on the work being done in his<br />\nown country.<br /><br />\n•<br />\n•<br /><br />\nAND you HAVE A GRAwD GABFEST AND MIKE KENDALL GIVES You ODDS<br />\nOF3TO ,AND IT6 GRAND LARCENY<br />\nWITH ALL THE 0L17 GANG Yoo<br />\nHAuENsT 6EEN SINCE LAS<br />\nTO TAKE H r.5 1.4C7/-4<br />\n00t4,7\"<br />\nYEAR.<br />\nYOU'RE ON FOR<br />\n`/00 EvEfk<br />\nGREAT<br />\n(I.0, AL)How'S<br />\nCALL A<br />\nDAY FOR<br />\nA HUNDRED.<br />\nTHE. BOY?<br />\nTHE GAME FEU-Pt<br />\nTHIS IS THE.<br />\nUp?<br />\nDA`i I GET EVEN<br /><br />\nengineering. He attended conventions and meetings, conferring with<br />\nmany educators, scientists and engineers. Also he carefully studied<br />\nthe large manufacturing plants of<br />\nEurope. He visited the chief electrical and physical laboratories in<br />\nthe countries in which he traveled.<br />\nto<br />\nProfessor Whitehead's work in electrical engineering was made by the<br />\nUniversity of Nancy. At this university he was presented the Medal<br />\nof Honor.<br /><br />\n,31.31) SiwASH SCoR,S A TOUCH—<br />\n.2owN BEF•00E THE GAME is<br />\n-TH.E4E MiNUT S 91-V.<br /><br />\nATTA BOY<br />\nSI WA SH)<br />\nSIWAr5H,<br /><br />\n-\\\\<br /><br />\n11)<br /><br />\nOct. 14<br /><br />\nAND THEN VOL) .5u00ENLy<br />\npi5CouER. yoviVe SmOKED YOUR<br />\nLAST OLD 0-0LD AND CAN'T<br />\nGET ANY MOE.. -TILL YOU GET<br />\nSACK To ToWN.<br /><br />\nvpky 15<br />\nRU.1N ED.<br /><br />\n14NO So THE<br /><br />\nTTERLy<br /><br />\n'THIS IS l'HE ROTTENEsT<br />\nTEAM THEY EVER HAD,-THEY<br />\nf3ETTER GET A NEW COACH<br />\nOR PLAY - VASS- A R<br /><br />\nSIWA;14<br />\n(1\\<br /><br />\n/%.<br /><br />\nLD<br />\nThe Smoother and Better Cigarette<br />\nnot a cough in a carload<br />\n© 1927, P. Lorillard Co., Est. 17u0<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1927<br /><br />\nDR. WIGHT SPEAKS<br />\nAT RECEPTION<br />\nRodgers and Aiau Furnish Entertainment<br />\nLARGE CROWD PRESENT<br />\nFreshman Orchestra Provides<br />\nEvening's Music<br />\nAbout three hundred and twentyfive men attended the Y. M. C. A.<br />\nreception for freshmen last Friday<br />\nnight. The affair, which was held<br />\nin the Civil Engineering Hall,<br />\nturned out to be the usual rushing<br />\nparty. This year there were many<br />\nmore upper classmen than freshmen, the ratio being about two to<br />\none.<br />\nThe music for the affair was furnished by a freshman orchestra<br />\nunder the leadership of Osmar<br />\nSteinwald.<br />\nDr. Wight on Activities.<br /><br />\nDr. Carol V. B. Wight, who succeeded Dr. John F. French as chairman of the faculty committee on<br />\nstudent affairs when the latter became Librarian of the University,<br />\nwas the speaker of the evening. Dr.<br />\nWight spoke at length on the relation of extra curricular activities to<br />\ncollege life. It was pointed out by<br />\nhim that the proper ratio between<br />\nstudies and activities must be maintained in order that the student<br />\nmight get the most out of his college<br />\nexperience.<br />\nAthletics Good Training<br /><br />\nDr. Wight said that he thought<br />\nathletics good training for college<br />\nmen, in that sports put a man on his<br />\nown, teaches generosity and aids a<br />\nman to learn to keep his temper<br />\nunder control. Fraternities, Dr.<br />\nWight believed, are also very helpful and beneficial and may prove of<br />\n(Treat value in later life. The welcome the freshman class got, Dr.<br />\nWight said, would last throughout<br />\nthe time they were at college and<br />\nshould be passed on to the incoming<br />\nclasses of future years.<br />\nBill Rodgers was next on the program and his entertainment was as<br />\nlively and as appreciated as usual.<br />\nRodgers sang some humorous songs<br />\nas well as several of the old favorites and ended up his part of the<br />\nprogram by offering \"The Curse of<br />\nDrink.\"<br />\nNative Hawaiian Performs<br /><br />\nThe second bit of entertainment<br />\nwas furnished by C. K. Aiau, a native Hawaiian, who has been studying at the Johns Hopkins Medical<br />\nSchool. Aiau performed on the<br />\nguitar, the ukelele and another<br />\nstringed instrument.<br />\nRefreshments, in the form of ice<br />\ncream and cake, were served after<br />\nthe last musical number.<br /><br />\nMOTHER GOOSE<br />\nNUMBER<br /><br />\nBlack and<br />\nBlue Jay<br />\nOUT ABOUT<br /><br />\nOCT.<br />\n21<br /><br />\nHISS ELECTED TO<br />\nHARVARD LAW REVIEW<br />\nAnnouncement has recently<br />\nbeen made by the Harvard<br />\nLaw Review that Alger Hiss,<br />\ngraduate of Johns Hopkins in<br />\n1926, has been elected to its<br />\neditorial board with nineteen<br />\nother Harvard students.<br />\nFollowing a.brilliant college<br />\ncareer here, where he distinguished himself as a scholar,<br />\namateur actor, editor, military<br />\nstudent and all-round leader,<br />\nHiss went to Harvard a year<br />\nago to take up the study of<br />\nlaw. His interest in printers'<br />\nink has apparently subsided<br />\nnot a whit.<br /><br />\nTRACK TEAM HOLDS<br />\nINITIAL MEETING<br />\nImportance of Fall Practice<br />\nStressed By Captain<br />\nSEVEN REGULARS RETURN_<br />\nTurn-Out of Freshmen Candidates Pleases Coach<br />\nOrganization of the track squad<br />\nfor the coming season was begun<br />\nt a meeting held in the M. E. Building on last Friday. The gathering<br />\nwas addressed by Capt. Herman<br />\nSchiebel of the Cross Country<br />\nTeam, Capt. A. E. Vivell of the<br />\nTrack Team and Coach Ridgely<br />\nEdwards, pilot of the Black and<br />\nBlue cinder path artists for the past<br />\ntwo years.<br />\nThe meeting was begun with a<br />\nplea by Captain Schiebel for candidates for the cross country team.<br />\n\"The Work is not hard, and anyone<br />\nwith any aptitude for long distance<br />\nrunning can develop into a fairly<br />\ngood hill and dale man through<br />\nsteady practice.\" All men running<br />\ndistances upwards from half-mile<br />\nwere requested to try out for the<br />\nteam.<br /><br />\nVan Orman Adopts<br />\nLighter Uniform<br />\nCoach Ray Van Orman has made<br />\na change in the uniforms being worn<br />\nby the football team this year. The<br />\nnew uniform weighs approximately<br />\neight and one-half pounds. This is<br />\njust six and one-half pounds lighter<br />\nthan last year's togs, which weighed<br />\nfifteen.<br />\nThe idea of a light •uniform was<br />\nconceived by the United States Military Academy and was first put into<br />\npractice in the Army-Navy game of<br />\n1926. These uniforms were such<br />\nan improvement over the heavier<br />\nones that the A. G. Spalding Co.,<br />\nmanufacturers of the new uniforms,<br />\nplaced them on display in New<br />\nYork. It was here that Coach Van<br />\nOrman received the idea which he<br />\nhas put into practice.<br />\nNew uniforms were bought at<br />\nthe Hopkins athletic outfitters, and<br />\nwere first put into use against Richmond. One feature of the new uniform is the detachable hip pads.<br />\nThese protectors are strapped and<br />\nthe jersey pulled down over them.<br />\nIn addition to being less combersome, the pad does not protrude<br />\nfrom the pants. This gives the opposing team less opportunity to hold<br />\non to a man after he has been tackled. The head gears are lined with<br />\nsponge rubber instead of felt, making them lighter, more impervious<br />\nto perspiration and more comfortable.<br /><br />\nDemand<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br /><br />\nM<br /><br />\nS<br /><br />\nT<br /><br />\nConvenient and Economical<br />\nTRANSPORTATION<br /><br />\nTHE STREET<br /><br />\nCARS<br /><br />\nESTABLISHED 1818<br /><br />\nMADISON AVENUE COP.FORTY-FOURTH STREET<br />\nNEW YORK<br />\nOur Representative will be at<br />\nTHE BELVEDERE<br />\non the following days<br />\nduring the coming season<br />\nOctober 10, 11, 12<br />\nNovember 7, 8, 9<br />\nDecember 5, 6, 7<br /><br />\nSod sad Black Color Comb.keg.Triad* Mark U S.Pat.011.<br /><br />\n*NoExpense<br />\nAfter Purchase<br /><br />\n0<br /><br />\nSendfor<br /><br />\nBROOKS'S Miscellany<br /><br />\nBOSTON<br /><br />\nPALM BEACH<br /><br />\nNEWPORT<br /><br />\nLITTLE BUILDING<br />\nTREMONT ECM BOYLSTON<br /><br />\nPLAZA BUILDING<br />\nCOUNTY ROAD<br /><br />\nAUDRAIN BUILDING<br />\n220 BELLEVUC Avenue<br /><br />\nV ivell Speaks<br /><br />\nSchiebel was followed by Captain<br />\nivell of the track team, who emphasized the importance of fall<br />\npractice, not so much to get into<br />\ncondition for the winter and spring<br />\nseasons, as furnishing practically a<br />\nwhole season of experience in running. Vivell further pointed out<br />\nthat fall practice allows the coach<br />\nto get an insight into the amount<br />\nand quality of the material that will<br />\nbe available in the spring.<br />\nThe last speaker at the meeting;<br />\nwas Ridgely Edwards, the only student head coach in the history of<br />\nmajor sports at Hopkins. \"Ridge\"<br />\nspoke of the necessity of everyone<br />\nin the freshman class who believed<br />\nhe had any ability, turning out for<br />\nthe fall track practice. \"Seven letter men return to college, leaving<br />\nmany vacancies to be filled in, mostly out of the incoming class, since<br />\nthe other years have been pretty<br />\nvelI combed for material.\"<br /><br />\nI<br /><br />\nOver-size<br />\nDuofold $7<br />\nDuofold Jr.$5<br />\nLady Duofold $5<br /><br />\ntarter s<br /><br />\nArewthtofold\\<br />\nwith<br /><br />\nPressureless<br />\nI<br />\nTouch<br />\nand<br />\nNon.Breakable /<br />\nBarrel<br />\n28\"; Lighter than Rubber<br /><br />\nMore Men on Track Team<br /><br />\nCoach Edwards likewise pointed<br />\nout that track differed from every<br />\nsport in that it offered more men<br />\nplaces on the varsity, and allowed<br />\nevery man free sway in the winning<br />\nof his events, no team work being<br />\nnecessary. He also pointed out that<br />\nthis allowed everyone to develop to<br />\nhis highest degree, irrespective of<br />\nthe performance of the other men<br />\non the team. He concluded his talk<br />\nwith a brief, review of the history<br />\nof track teams and noted runners at<br />\nHopkins.<br />\nAt the end of the meeting, cross<br />\ncountry practice was announced to<br />\nbegin that afternoon, while the initial track practice will be held this<br />\nafternoon at 4.00 on Homewood<br />\nField.<br /><br />\nParker's \"No Expense After<br />\nPurchase\" offer means that the<br />\nnew model Duofold necessarily<br />\nmust be a pen that stays in perfect order. Otherwise we'd go<br />\nbroke making repairs.<br />\nThe fact is that trouble has practically vanished since we replaced<br />\nrubber barrels with Non-Breakable Permanite.<br />\nAnd of course there's never been<br />\nanything else like the Parker Duofold Point that yields to any hand<br />\nyet never loses shape.<br />\nIf you want to taste something<br />\nnew in writing ease—called Pressureless Touch—try the New<br />\nModel Parker Duofold at the nearest pen counter.<br />\nTHE PARKER PEN COMPANY<br />\nJANESVILLE, WIS.<br /><br />\n*No Expense After'Purchase<br />\nTo prove that Parker Duofold Pena will stay<br />\nIn perfect order,Parker agrees to make good<br />\nfree, if one should fail, provided complete<br />\npen is sent by the owner direct to Parker<br /><br />\nwith 10e for return postage and insurance.<br /><br />\nThe Athletes<br />\nFriend<br />\nT'S strenuous business<br />\nfor the athlete to keep up<br />\nwith his work and at the<br />\nsame time get the sleep<br />\nthe coaches demand.<br />\nMany have discovered a<br />\nway to do it. They use a<br />\nRemington Portable for<br />\nall their writing. It helps<br />\nthem get better marks<br />\nbecause of the neatness<br />\nand legibility of the typeEasy Payments.<br /><br />\nwritten reports; and the<br />\ngreat saving of time as<br />\ncompared with the drudgery of writing by hand is<br />\na welcome relief.<br />\nRemington Portable is the<br />\nsmallest, lightest, most<br />\ncompact and most dependable portable with standard<br />\nkeyboard. Weighs only<br />\npounds, net. Carrying<br />\ncase only 4 inches high.<br /><br />\nRemington<br />\n•<br /><br />\nPortable<br />\nREMINGTON TYPEWRITER COMPANY<br />\nDivision of Remington, Rand, Inc.<br /><br />\n25 West Fayette Street<br />\nBALTIMORE, MD.<br /><br />\nrv<br /><br />"}], "field_media_file": [{"target_id": 38179, "display": null, "description": null, "target_type": "file", "target_uuid": "b3200945-83e7-4bd0-ac51-005a840968a4", "url": "http://digital.library.jhu.edu/system/files/2022-03/13279-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13279, "target_type": "node", "target_uuid": "2c55d5f1-f458-48f7-8010-96eb6b7b9c06", "url": "/node/13279"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "650de6c6-a4ce-42e8-986f-be380165aa1e"}]}