{"mid": [{"value": 38135}], "uuid": [{"value": "0a5f764b-a7a0-4671-bb9d-12adfffda005"}], "vid": [{"value": 38135}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:48:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12702-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:48:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:48:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nrNTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nitalltts igopittits Nrins-Krttrr<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br />\n<br />\nVOLUME XLI, NO. 1<br />\n<br />\nDON'T DELAY!<br />\nSUBSCRIBE TO YOUR<br />\nHULLBALOO NOW<br />\n<br />\nJays Prepping Yearbook Dropped Freshman Camp Filled ToBrim Five New Courses Spitzer Arrival<br />\nActivity List With New'Campus Characters' Added To Chemistry At Hopkins Set<br />\nFor October10th From<br />\nAsS.A.C.Retrenches Eugene \"The Jeep\" Wilson, Bill \"Benny\" Freedman, And Schedule This Year<br />\nDuel At Lehigh \"Hullabaloo' Editors To Seek \"Terry McGovern Combine To Make Things Drs. Harks And Wiselogel To For October 9th<br />\nInteresting For New Class<br />\n<br />\nMallonee Men In Form Funds Through Optional<br />\nStudent Subscriptions<br />\nFor Debut After Three<br />\nWeeks' Work<br />\nAustrian Declares Fate Of<br />\nPindellGuidesBacks Book Rests On Undergraduate Response To Appeal<br />\nVincenti, Kahl, Ward, and Because of a cut in the Student<br />\nActivities Committee's appropriation<br />\nGraziano Form Nucleus<br />\nyear, the Hullabaloo, campus year<br />\nthis<br />\nOf Veteran Backfield<br />\n<br />\nTerry loves base-ball, especially<br />\nDo you remember, at the end of<br />\nlast year, the weeping, wailing, and when playing \"foist\" base on the<br />\ngnashing of finger nails? And all same team with \"Voinen\" Grove.<br />\nbecause the fellows thought that all Next best he likes to go to \"Choich\"<br />\nthe \"campus characters\" were leav- on Sunday.<br />\ning. Having been to Freshmen Camp<br />\n(My Gawd them nights was cold)<br />\n<br />\nBill Hammaker Likeable<br />\nAnother 'campus character\" des-<br />\n<br />\nI am now ready and willing to re- tined to become very popular is<br />\nBill Hammaker, the new \"Y\" secre-<br />\n<br />\nfute this stupid statement.<br />\n<br />\nThis class of '40 simply reeks with tarry. There isn't much you can say<br />\nAs the curtain rises for another group of University-supported activi- \"campus<br />\ncharacters.\"<br />\nAlready about Bill, except that he's one<br />\nscholastic year at Hopkins, few of us ties. The cut was effected, activities through our halls of learning are \"swell all-around fellow\". If there is<br />\nrealize that our athletic season is officials yesterday explained, to aid echoing cries of, \"Who doesn't know anyone who hasn't met our \"Y\" secalready more than three weeks old. in the University's general retrench- Eugene Wilson?\" We mean Eugene retary thus far, he will benefit him-<br />\n<br />\n-- —<br />\nIstanbul Professor Will Take<br />\nOver Philological Post In<br />\nDr. Fowler Will Take Charge Romance Language Dept.<br />\nOf Physical Chemistry; No<br />\nWord Of Robles<br />\nMayer Offers Course<br />\nFar-reaching changes in the person- Spanish Professor, Who Acnel and courses of the undergraduate<br />\ncepted Madrid Gov. Place<br />\nchemistry department at the Hopkins<br />\nUnreported Since Aug.<br />\nhave been made this fall. Eight new<br />\nAdminister Elem. Course<br />\nFor Department<br />\n<br />\nbook, has been excluded from the<br />\n<br />\ncourses have been added to the curDr. Leo Spitzer, professor of Roriculum, also five membrs of the<br />\nmance philology at the University of<br />\ngraduate faculty and two new instrucIstanbul, left yesterday from Venice<br />\ntors have been assigned to teach<br />\naboard the liner Conde di Savoia to<br />\nthem. The latter will also take an acassume the same position at the<br />\ntive part in the research work in<br />\nWhile most of us spent the closing, ment.<br />\nof the agile mind and horn-rimmed self exceedingly by dropping in Bill's<br />\nJohns Hopkins University. He is exchemistry.<br />\npected at the Hopkins October 9, acand, in many cases, the most joyous,<br />\nThe withdrawal of S.A.C. financial spectacles. Eugene, by the way, was Levering Hall office for a short \"bull<br />\nDr. David Harker, formerly of the<br />\ncording to Dr. H. Carrington Lancasdays of our long vacation, our grid- backing makes publication of the an- the fellow who didn't know a single session.\"<br />\nCalifornia Institute of Technology,<br />\nter, head of the departrment of Roiron hopefuls were hard at work get- nual dependent on a campaign for other fellow in the entire camp.<br />\nAlso at this time we feel that we and Dr. Frederick Wiselogel, premance languages.<br />\nting in trim before the dawn of an- subscriptions, which began with the<br />\nare privileged (don't tell the Editor!) viously an instructor in chemistry at<br />\nHavlow Questioned<br />\nWith the academic term already unthe<br />\nUniversity<br />\nof<br />\nMichigan,<br />\nhave<br />\ncome<br />\nother football campaign.<br />\nregistration days and will continue unAnd then there was Bill (Benny) in place upon the curly head of Boyd to the Hopkins to assist in the ele- der way, Dr. Lancaster yesterday<br />\nAt the helm, guiding and driving til the Thanksgiving holidays. In the Freedman who stopped Dr. Havlow Frey the coveted Nimbus for his exmentary course. Under the guidance also expressed concern for Dr. Jose<br />\nour light but well-oiled machine, we past two years, the cost of the individ- right smack in the middle of his cellent generalship and clever exec- oi the former, students are taking Robles, a professor in his department,<br />\nfind once again Coach Gardner Mal- ual year book has been included in the speech to ask him if he was kidding utive ability in running Freshmen the basic course, Physical Science IC, who left for Spain last June and has<br />\nwhich is a group course, including not yet returned. The last heard of<br />\nlonee. This year his task his been student's tuition.<br />\nwhen he told the Freshmen that the Camp.<br />\nOld System Bad<br />\nphysics, mathematics, and chemistry. Dr. Robles was through an Associated<br />\nsomewhat lightened by the addition<br />\nNor must we leave out genial Tom<br />\nPress dispatch of August 24.<br />\nDeclaring that the old system of name of Bridgeport, Connecticut's<br />\nWiselogel To Assist<br />\nof a new backfield adviser,-Wiatson Hullabaloo distribution had always oc- Socialist mayor was \"McLevy\". Mr. Hubbard, whose sparkling stories and<br />\nRobles Missing<br />\nDr. Wiselogel will assist Dr. F. 0.<br />\nDr. Lancaster said that neither he<br />\nPindell. Mr. Pindell has the distinction casioned deficits that had to be Freedman couldn't seem to<br />\ncamp<br />\ninwaggish<br />\ngestures<br />\nmade<br />\nour<br />\nRice<br />\nin<br />\nteaching<br />\nthe<br />\nelementary<br />\norget over<br />\nnor the University has made any efof having been a member, along with wiped out, in part, with additional It. When questioned about it, his finitely more pleasant and lusory.<br />\nganic chemistry course.<br />\nfort to communicate with Dr. Robles,<br />\n'37,<br />\nAustrian<br />\nUniversity<br />\nfunds,<br />\nRobert<br />\nHopkins<br />\nlast<br />\nthe<br />\nEngaged<br />\nin<br />\nconstructing an appaMr. Mallonee, of<br />\nonly reply was, \"Would you believe<br />\nWe might go on for hours at a time,<br />\neditor of the book, said that Dean E.<br />\nratus for the production of neutrons nor has anyone been appointed as yet<br />\neleven to defeat Maryland. On this<br />\na<br />\nguy if he told you his name was enumerating all the grand personin his place.<br />\nW. Berry and the S.A.C. had agreed<br />\nis Dr. Robert D. Fowler. His machine<br />\nteam he played fullback and was reDr. Robles had been appointed<br />\nto the induction of the new plan. It McGoldbery or O'Greenblatt.\"<br />\nages who put in their appearance at promises to be the most powerful<br />\nsponsible for many a long and much- was announced that the book will<br />\nWoe be unto us if we forget to Camp Letts, but this, like all other devised. He is in charge of the un- chief of Spain's foreign press relaneeded gain. \"Wats\" is a likeable and cost three dollars and fifty cents; subtions after the outbreak of the presgive you the dope on Francis Xavier mediocre articles, has been brought dergraduate physical chemistry labIntelligent chap. He gets along very scription is optional.<br />\noratory, and students working with ent rrevolt.<br />\nto a close by your cruel Editor.<br />\nPointing out that, though purchase Terry.<br />\nIt was one of Dr. Robles frequent<br />\nhim are coming in contact, with the<br />\nwell on and off the field with both his<br />\nof<br />\nthe<br />\nbook is optional, the mainvisits<br />\nmost<br />\nadvanced<br />\nto his native country, which<br />\nworks<br />\nin<br />\nthis<br />\nfield.<br />\ncandifellow coaches and the team<br />\ntenance of the Hullabaloo is totally deAnother contact between the under- he left for the Hopkins about ten<br />\ndates. While at Hopkins he was an pendent on the students' subscriptions,<br />\ngraduate students and the graduate years ago. He had left his family in<br />\nengineer,-and a good one at that. He Austrian added that \"it is no longer<br />\nfaculty is being provided by a new Porrtugal however, and is reported<br />\npossible to put out an adequate year<br />\ngraduated in 1928.<br />\nlecture course in theoretical chem- to have planned most of his stay<br />\nbook under the former financial<br />\nistry, which is offered by Professor in Madrid where he was friendly<br />\nCapable Assistants<br />\nNew \"Y\" Secretary Stresses New Rushing Agreement, J. E. Mayer, in collaboration with with officials of the \"liberal\" regime.<br />\nsystem\".<br />\nWith such capable men as Pindell<br />\nClass Support Urged<br />\nFreedom Before Freshmen; Backed By Administration, Dr. Fowler.<br />\nIn a statement to the Associated<br />\nand Ed Lotz, a figure familiar to us<br />\n\"By calling for the first three<br />\nChem.<br />\nEngineering<br />\nCourse<br />\nPress<br />\non August 24th, Robles exMalCoach<br />\nall, working with him,<br />\nLeaders Speak<br />\nNow In Effect<br />\nclasses' financial support\", he continWith the cooperation of the School pressed his confidence in the outcome<br />\nlonee finds himself in a much better ued, \"it is hoped that greater interest<br />\nof Engineering a course is being in- although he predicted that \"it would<br />\n\"Students seem to have overcome<br />\nposition than ever before to concen- will be shown and that the Hullabaloo<br />\nThe new \"rushing\" code, protected<br />\ntroduced for the first time in chemical be some time before peace is restored<br />\ntrate on the plays and field tactics will become more an undergraduate the pseudo-feudal waging system cus- by restrictions designed to prevent<br />\nengineering. Honor students will have in Spain.\"<br />\nnecessary to a winning ball team.<br />\npublication rather than solely a senior tomary at other colleges\", declared the reoccurence of past violations, an opportunity to do independent labChair Vacant<br />\nNo college team can be expected to one.\"<br />\nW. L. Hammaker, new secretary of<br />\nwas released Wednesday afternoon oratory work of research caliber, and<br />\nThe chair in Romance philology,<br />\nthe<br />\ngo far without the right sort of stuY.M.C.A.,<br />\nat<br />\nthe<br />\nfirst<br />\nstudent<br />\nThe book is to be dedicated to the<br />\nfollowing a meeting of the Interfra- emphasis is being laid in all laboratory which Dr. Spitzer will occupy upon<br />\ndent leader. And Captain Ted Gra.ziSchool of Engineering, observing its assembly held in Latrobe Hall yesterano,\"Graz\" for short, more than fills twenty-fifth anniversary this year.<br />\nday. He congratulated upperclassmer ternity Board. The agreement, ap- courses on the experimental methods his arrival, has been vacant since the<br />\nthat role. His spirit has been an exfor treating freshmen as normal hu proved by all members of the Board, which are used in modern chemical death of Dr. David Simon Blondheim<br />\nA meeting of the editorial staff of<br />\nresearch.<br />\nin Marrch, 1934.<br />\nman beings.<br />\nample for the rest of the squad, esthe annual is on the books for 12.20<br />\ntook effect immediately.<br />\nThe changes in the curriculum have<br />\nfor<br />\nthe<br />\nDr. Spitzer, a native of Austria,<br />\nnew men; and the<br />\npecially<br />\n\"Academic freedom at the Hopkins<br />\ntoday.<br />\nThe support of the Student Council .ben planned largely in accordance came to Istanbul from the University<br />\nseems<br />\na<br />\nrealized<br />\nother gridsters seem to have taken to<br />\nideal.<br />\nStudents<br />\nare<br />\n\"In this connection,\" said Austrian<br />\nthe idea perfectly, for, to use Mr \"I want to emphasize the fact tha treated as less mature members in an in punishing infractions has been en- with the recommendations of a com- of Cologne, late in 1933, when he was<br />\nMallonee's own words, \"this year's senior photography will begin the association of scholars engaged in ex- listed this year. Any group judged mittee appointed two years ago. con- allegedly expelled from Germany by<br />\nClark, chairman, and representatives the Nazi regime.<br />\nsquad is showing more fight, more first week in November. Therefore ploring the world.<br />\nguilty of violation by the members of<br />\nof the various science departments.<br />\nHe was born in Wien, in 1887, and<br />\nReligion Discussed<br />\nspirit, and more pep than any Hop- I want to ask all members of the<br />\nthe Board will face Council action.<br />\ntook doctorate in philology at the<br />\n\"I believe that religion should not<br />\nkins team in years.\"<br />\n\"Junior\" class, who plan to graduate<br />\nAdministration To Act<br />\nUniversity of Wien in 1909. He holds<br />\nbe merely an opiate of the people, a<br />\nThe eleven selected to tote the pig this<br />\nspring to turn in their names to<br />\nThere is the further possibility that<br />\nfurther degrees from the Universities<br />\nthing indulged in the towers of lusles<br />\nskin against Lehigh on October 10 the office.<br />\nof Paris, Leipzig and Rome. He atand forgotten outside. The \"Y\" fits the Administration will take action<br />\nwill certainly not be lacking in ex<br />\ntained a professorship at the Univerin with the spirit of the Hopkins. Its in the event of any serious offence.<br />\nperience. Five men, Ellis, Davies,<br />\nsity of Marlburg in 1925. Five years<br />\nphilosophy is service to the students<br />\nHopkins, Royster, and Day, have reMade<br />\nPlans<br />\nTo<br />\nConduct<br />\nExtensive<br />\nIn a letter last spring to William Mc•<br />\nlater he took over a similar position at<br />\nsocially, religiously, and personally.\"<br />\nturned from last year's first string<br />\nFall Activity In Chicago<br />\nCologne, where he remained until his<br />\nline. That gives \"Ma\" a mighty fine<br />\nLeaders in every extra-curricular Feeley, President of the Board, Dean<br />\nAnd St. Louis<br />\nsupposed expulsion.<br />\nactivity on the campus made brief Berry gave the following pledge of<br />\nbulwark around which to build a<br />\nforward wall. Rickards, Rostov, Meh Local Fraternity Accepts Invitation speeches primarily devised for the support:<br />\nWith a total of $512,000 already reTo Form Chapter Of<br />\nling, Manger, and Hecht, all of last<br />\nbenefit of freshmen and the solicita\"If I am right in this assumption ported, the public phases of the UniDr. Murnaghan Leaves<br />\nAlpha Chi Rho<br />\nyear's squad, have returned for antion os their support. Holt Maulsby, (that the agreement would be ap- versity's campaign for funds apother chance. Among the new linemen<br />\nFor Princeton Next Week<br />\nchairman of the Student Activities proved by all parties), I am glad to proached a close in two areas -this<br />\nOmicron Kappa Omicron, a socia Committee, conducted the program. give my approval to the agreement week, while showing signs of speeded<br />\nthere are a few outstanding candiDr. Francis D. Murnaghan, profesdates for first team berths. Baetjer fraternity at the Johns Hopkins Uni<br />\nCaplan Speaks<br />\nand to say that the Administration activity in two more. With the BalSpeaking for the NEWS-LETTER will stand squarely behind the en- timore campaign already settled into sor of applied mathematics at the<br />\na star 220 runner and a sweet end, versity has been admitted into Alpha<br />\nBlucher, Brown, and McShane, upper- Chi Rho, a national society. Early in David<br />\nCaplan, managing editor forcement of any penalty which the the \"long-range\" stage and with the Johns Hopkins University, is leaving<br />\nclassmen out for the first time, and September Alpha Chi Rho at its con stressed the importance of the news Board may decide upon after due New York alumni preparing to wind next week for the Institute for AdFinch and Chester have shown plenty vention in Madison, Wisconsin, indi paper as a means of \"gaining con considerations of particular cases of up their public drive at a banquet on vanced Studies at Princeton, where<br />\ncated that the local organization tacts with outstanding men at the infractions of the agreement.\"<br />\nof \"stuff\".<br />\nOctober 16th, plans are being laid for he will remain during the academic<br />\nwould receive a charter during the Hopkins\".<br />\nVeteran Backfield<br />\nSimilar Plan<br />\nintensive fall activity in the Chicago year.<br />\nAccording to Professor Murnaghan,<br />\nBob Austrian, editor of the Huila<br />\nThe presence of the veterans Vin- Christmas holidays. At that time O.K.<br />\nThe present plan, as approved by and St. Louis areas.<br />\nthe<br />\nInstitute is the world center for<br />\ncenti, Kahl, Ward, and Captain Grazi 0. will be formally initiated into Al- baloo, invited candidates to come ou the Board, is substantially like that<br />\nIncreases in the fund total over<br />\nano gives us a splendid backfield nu pha Chi Rho and drop their present for the annual, emphasizing the pas of last year. Beginning yesterday and the summer are in large part the re- mathematical research. Each year it<br />\ncleus, if not a complete backfield it name.<br />\nexcellency of the annual. Dwelling on continuing through October 15th sult of the New York campaign under invites a number of mathematicians<br />\nSince 1919, when O.K.O. was or- the glories of his activity was Phi there will be a 'hands-off\" period, the direction of J. Albert Durgon and to attend its sessions and study prob(Continued on Page 4, Col. 1)<br />\nganized at Hopkins, it has main- Grossman, head of the debating Coun during which fraternity men will Channing E. Sweitzer, President of lems and theories of interest.<br />\ntained a chapter here. The fraternity dl.<br />\nProfessor Albert Einstein will also<br />\nbe allowed to visit Freshmen and the New York, New Jersey and ConDorothy Thompson To<br />\nhas not previously affiliated itself<br />\n\"We have our \"heroines\", pleaded Thursdays frrom 8 to 10 p. m. and necticut Alumni Association. Al- be there, as will Professor G. Wegal,<br />\nIxa,<br />\nSpeak At Supper Club with any organization.<br />\nMarty Levine, president of the Barn on Sundays from 3 to 5 p. m. Begin though their public activity will not who delivered a lecture at Johns HopJames Alexander, president of the stormers, when he was cajoling first fling Friday, October, 16th, there will<br />\ncome to a formal close until mid-Oc- kins last winter. Another attender of<br />\nOver fifty people have joined the Guilford Avenue house, said, \"We are year men to try out for one of the be a week of \"open houses\", To each tober, the directors of the New<br />\nYorrk the seminary, which is located on the<br />\nUniversity Supper Club this fall. By happy at the prospect of becoming various staffs of his activity.<br />\nUniversity campus, is<br />\nfraternity will be alloted a day on drive have already begun a canvass Princeton<br />\nthe time of the first lecture on Oe brothers of Alpha Chi Rho, as the<br />\nOther non-athletic activities includ which parties may be held, eithei of non-alumni prospects as the first Professor A. Leftschetz, who has lectober 21, at which Dorothy Thompson latter is a fraternity standing fore ing the Musical Club, the Rifle<br />\nClub within or outside its house. Other step in the launching of the private tured here before and will do so again<br />\npopular free-lance writer and wife o most incollege ranks. They have chap- the Cotillion Board, the<br />\nin December under the Dohme LecAmerican wise, through that week rushing wil campaign.<br />\nSinclair Lewis, will speak. Approxi- ters throughout the country.<br />\nStudents Union were represented b3, be restricted to the alloted \"open<br />\nThe alumni banquet will be held tureship.<br />\nmately three hundred are expected to<br />\n\"We are not going to rushh fresh- Jack Steeper, Henry Leber, and Day house\" days.<br />\nunder the sponsorship of the recentlyjoin.<br />\nmen under our future name this fall, Erck and Ken Zierler respectively<br />\nUnrestricted \"rushing\" will prevai formed Johns Hopkins New York<br />\nMEETING TODAY<br />\nEight speakers, \"leaders in th for purely ethical reasons. However who held forth briefly.<br />\non Saturday, October 16th. Until on Alumni Club, of which Mr. Sweitzer<br />\nfields of economics, literary, and re any pledged will be initiated in<br />\nDenouncing the fact that he had to o'clock Sunday morrning, fraternity is president. Plans call for the seatThere will be a meeting of the<br />\nligious thought,\" will address the December.\"<br />\nspeak after leaders in \"rocking-chai men are allowed complete freedom ing of between fifteen hundred and<br />\npaper today at 4 o'clock in the<br />\nLevering Hall group in the course of<br />\nThe admission of Omicron Kappa activities,\" Theodore Graziano, cap- From that time until 3 p. m. the two thousand guests,<br />\nNews-Letter office. Both members<br />\nthe year. Arrangements have been Omicron into national ranks leave tain of football announced that their next day, when bids are presented<br />\nSo far no report on the success of and candidates for the staff are<br />\nmade by Dr. W. L. Hammaker, execu 0. K. 0., Tau Alpha Phi as the only was no more equipment available, ex- the traditional silent period will be the private Baltimore<br />\ncampaign has asked to attend.<br />\ntive secretary of the \"Y\".<br />\nlocal remaining on the campus.<br />\ncept for heavy and fast candidates. enforced.<br />\nbeen received.<br />\n<br />\nHammaker Speaks Council To Support<br />\nAtOpeningAssembly Fraternity Board<br />\n<br />\nCampaign Fund Hits<br />\nNew High $512,000<br />\n<br />\n0.K.0. Taken Into<br />\nNational Fraternity<br />\n<br />\n\f2<br />\n<br />\nHOIVIEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br />\n<br />\nIjc jolint Tipphinti<br />\n<br />\nKetter<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\nnot have its varsities, its June Week, seclusion and of academic unworldand its Frosh-Soph, in short, the label linass. It was partly the War and<br />\nof uniformity that connects all univer- partly the Depression which snapped<br />\nsities. They all exist on the Campus. him out of his stupor. It required the<br />\nBut they do not constitute the major useless clash of imperialistic rivalries<br />\ntradition of America's first University and the partial collapse of an economEven to Undergraduates, they rapidly ic system to shock him into a recogsink into significance before the depth nition of realities. As year follows<br />\nand magnitude of Hopkins' major year, we see the results of the awaktradition.<br />\nening: 'organization of liberal clubs,<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nIt is in its profound reverence for<br />\nRemit subscription fees to Treasurtruth and its ever-conscious respect<br />\ner, Student Activities Council, Remfor liberty that the real lintage and<br />\nsen Hall, Postoffice, Johns Hopkins<br />\nlegacy of the Hopkins lie. The imporUniversity.<br />\ntance of these ideas cannot be overemphasized.<br />\nEntered as second-class matter DeThe following paragraph appeared<br />\ncember 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under the Act of Con- in the NEWS-LETTER on April 1,<br />\ngress, November 3, 1879.<br />\n1936.<br />\n\"The University has never made any<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by<br />\nundergraduates of the Johns Hopkins<br />\nUniversity.<br />\n<br />\nEDITORIAL STAFF<br />\n<br />\neffort to develop the orthodox traditions. And for good reason. The Hopkins is no orthodox university. In its<br />\npolicy of minimizing the formalities<br />\nof education, of encouraging quality<br />\nrather than quantity, of emphasizing<br />\nfreedom and independence, the Hopkins has, for sixty years maintained<br />\na reputation for untrammelled scholarship, for independent and c eative<br />\nthought. Therein lies the strength of<br />\nthe Johns Hopkins University; and in<br />\nits development as the pioneer stronghold of free, independent, and, creative scholarship lies its greatest t adition.<br />\n<br />\nWilliam Diamond<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nAssociate Editor<br />\nJames Morrow, David Caplan<br />\nManaging Editors<br />\nBernard D. Pinck<br />\nSports Editor<br />\nMurray Kempton, Benjamin Root<br />\nAssistant Managing Editors<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Sports Editors<br />\nIt was President Gilman was first<br />\nIsadore Gertman, Wethered Barroll<br />\nNews Editors laid down the fundamental principles<br />\nof the Hopkins. It was he who said<br />\nBUSINESS STAFF<br />\nthat the University \"should be free<br />\nfrom the influences of partisanship<br />\nWilliam B. Kempton....<br />\nthat the instructions should be<br />\nBusiness Manager<br />\nthorough, as advanced and as special<br />\nMelville Locker<br />\nAssistant Business Manager as the intellectual condition of the<br />\ncount y will permit, that the glorry<br />\nWm. C. Erlanger<br />\nAdvertising Manager of the University should rest upon<br />\nGerald Willen<br />\nCirculation Manager the character of the teachers and the<br />\nHoward Linkoff<br />\nOffice Manager scholars here brought together, and<br />\nnot upon their number, nor upon the<br />\nNathaniel Soifer<br />\nCopy and Filing Manager buildings constructed for their use;<br />\nthat its sphere of influence should be<br />\nnational, while at the same time all<br />\nFriday, October 2, 1936<br />\nthe local institutions of education and<br />\nscience should be quickened by its<br />\n1936<br />\nMember<br />\npower.\"<br />\n1937<br />\n<br />\nAssociated G3Ileeide Press<br />\nDistributors of<br />\n<br />\nGrAle6iate Di6est<br />\n<br />\nFor Freshmen<br />\nTo students entering the Johns Hopkins for the first time it is customary<br />\nfor editors of the NEWS-LETTER to<br />\nto say a few words of welcome and of<br />\ngreeting. Suffice it to say, that the<br />\nNEWS-LETTER does extend its<br />\nheartiest greetings to new students<br />\nand usher them good fortune and success during their residence at the<br />\nUniversity.<br />\nBut there is something more to be<br />\nsaid. No first issue of the NEWSLETTER is complete without a word<br />\nabout traditions, a word addressed<br />\nparticularly to entering students. New<br />\nstudents have undoubtedly read and<br />\nperhaps wondered at too„ the page of<br />\n\"customs and traditions\" printed in<br />\nthe Handbook. Most of them are, actually, superficial and unimportant<br />\nthings. Perhaps it is surprising, but it<br />\nis nevertheless true, that the Hopkins<br />\nis almost completely free from that<br />\nvague, superficial tradition called<br />\n\"college spirit.\"<br />\nThe hollow fripperies that characterize so many American colleges today have never found a foothold at<br />\nHopkins. Not that the Hopkins does<br />\n<br />\nThis, for sixty years, has been •the<br />\nhistory of the Hopkins. And through<br />\nthose sixty years, following the lead<br />\nof \"The Seven\", the University has<br />\nset the pace in American graduate<br />\neducation which, as Time put it, \"created a tradition of free and fruitful<br />\npassed.\"<br />\n<br />\nWhither Democray<br />\nThe News-Letter is going to take<br />\nan editorial stand in the present presidential campaign!<br />\nIn a few days, this paper—for the<br />\nfirst time in its 39 years of history—<br />\nwill definitely align itself in a political campaign; it will advocate the<br />\nelection of a president editorially;<br />\nand it will continue in its presentation<br />\nof facts and principles until the day<br />\nof election.<br />\nThe times demand it! No, not the<br />\ntimes but the issues involved, which<br />\nare, after all, so closely associated<br />\nwith the times. Never before has the<br />\ncollege student been so profoundly<br />\naffected by a presidential election.<br />\nNever before have the issues involved<br />\nin a national election been so vital<br />\nto the college student as well as to the<br />\n\"man on the street.\"<br />\nUntil a few years ago the college<br />\nstudent was a members of a separate<br />\nand distinct class—set off from the<br />\nworld by all the tradition of academic<br />\n<br />\nNuniminimaiimanniiniiiiiimlumill1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111M111111111111111111111111111M1111<br />\n<br />\nof anti-war movements, of innumerable youth organization, participation<br />\nby students in every problem of national or international import. No<br />\nsingle sequence of events has exhibited the tendency better than the impressive mass anti-war demonstrations of the past four years, which last<br />\nyear called forth three quarters of a<br />\nmillion students from their classes<br />\nas a protest against war.<br />\nStudents are definitely interested in<br />\nnational affairs. They must be—because it touches them personally and<br />\nimmediately, as it touches any other<br />\nperson.<br />\nThe election of 1936, far from being<br />\njust another election, is of special,<br />\neven paramount importance. From<br />\nevery point of view, this one is a<br />\nclimatic election; from every point<br />\nof view, this election marks a crisis<br />\nin American history. Students, who in<br />\nall to short a time will inherit that<br />\nAmerica, cannot neglect to realize<br />\nthe importance of the issues at stake,<br />\nthe importance of the outcome of the<br />\nelection, the effect of that election on<br />\ntheir own future. This election represents the struggle to save America<br />\ntemporarily at least, perhaps permanently, for Democracy.<br />\nFour years ago, the News-Letter<br />\nsponsored a straw vote. Herbert Hoover won by a slight plurality. About the<br />\nthird week in October, this paper will<br />\nconduct another straw vote among<br />\nboth faculty and students. Until that<br />\ntime, the columns of the News-Letter<br />\nwill be entirely thrown open to student discussion. The paper will express itself freely. It is hoped that<br />\nthe student body will do the same.<br />\nDemocracy is based on education,<br />\nand education is based, ultimately,<br />\non free and fearless discussion.<br />\nDuring the next week, in the next<br />\ntwo issues of the News-Letter, the<br />\npolicy of the paper will be definitely<br />\noutlined; selection and rejections for<br />\nthe presidency will be made; the issues of the election will be clarified;<br />\nand the question of the future of<br />\nDemocracy will be placed squarely before the students.<br />\nThe News-Letter believes in a democracy, both political and economic.<br />\nThe News-Letter believes that, in the<br />\ncourse of events, the future of this<br />\ndemocracy has been gravely imperiled. The News-Letter is convinced<br />\nthat the question of Democracy's future is the primary issue of the<br />\n1336 election. And, because the NewsLetter considers that issue of paramount importance, it will attempt to<br />\ntake a rational but unequivocal position in the election campaign—a position based upon unbiased, unprejudiced facts.<br />\n<br />\n-:-<br />\n<br />\nBOOK<br />\n<br />\nFalsehood In War-Time. By<br />\nArthur Ponsonby, M.P. New<br />\nYork: E. P. Dutton & Co. 292<br />\npp. Special $1.00 edition.<br />\n\"When war is declared, truth is the<br />\nfirst casualty,\" goes the classic adage.<br />\nFalsehood in War-Time is a more than<br />\ncommendable discussion and exposition of the numerous lies, frauds and<br />\ndeceptions to which the war-generation was submitted in a monstrous attempt to arouse its passion and indignation.<br />\nThe reprinting of this volume comes<br />\nat a most fortuitous moment. Today<br />\nthe tenseness and double-dealings of<br />\ninternational rivalry have resulted in<br />\nthe exaltation of patriotism over<br />\ntruth as the essential element and<br />\nvirtue of statesmanship. The chances<br />\nare very great that the world will<br />\nshortly find itself in the chaos of<br />\nanother great War. When that war<br />\ncomes, one of its chief weapons will<br />\nbe falsehood, and lying. The casual,<br />\neveryday lie is often condoned, or at<br />\nleast ignored. But the wholesale deception of an entire nation by official<br />\nconnivance cannot be easily neglected.<br />\nLord Ponsonby has collected in his<br />\nsmall volume a group of the more<br />\ncommon, more insidious lies circulated in England, France, Germany,<br />\nItaly, and America during the War.<br />\nA long career in parliament and the<br />\ndiplomatic service has given him<br />\nboth the means and the ability to<br />\ntrace these lies to their sources.<br />\nThe denial of England's commitments to France, the invasion of<br />\nBelgium as the causus belli, the war<br />\nguilt of Germany, the passage of<br />\nRussian troops through England, the<br />\nstories of the mutilated nurse, the<br />\nhandless baby, the crucified Canadian,<br />\nand the German corpse factory are<br />\nobjectively, calmly, but relentlessly<br />\ntraced by Lord Ponsonby to their<br />\norigins and exposed as deliberate subterfuge and trickery on the part of<br />\nsupposedly responsible governments.<br />\n\"There is not a living soul in any<br />\ncountry who does not deeply resent having his passions roused,<br />\nhis indignation flamed, his pariotism exploited, and his highest<br />\nideals desecrated by concealment,<br />\nsubterfuge, fraud, trickery, and<br />\ndeliberate lying on the part of<br />\nthose in whom he is taught to<br />\nrepose confidence and to whom<br />\nhe Is enjoined to pay respect.<br />\n'None of the heroes prepared for<br />\nsuffering and sacrifice, none of<br />\nthe common herd ready for service and obedience, will be inclined<br />\nto listen to the call of their country once they discover the polluted sources from whence that<br />\ncall proceeds and recognize the<br />\nmonstrous finger of falsehood<br />\nwhich beckons them to the battlefield.\"<br />\nEducation of this type at this time<br />\nwill put a previously unsuspecting<br />\npeople on its guard when the debacle<br />\ncomes, will render it much less cred-<br />\n<br />\nREVIEWS<br />\n<br />\n-:-<br />\n<br />\nulous of statements, rumours, and lies like a man unveiling a statue of himissued specifically for its consumption self. He was heart<br />\nand soul a soldier;<br />\nby official propagandists.<br />\nhis memoirs are brief to the point of<br />\nRochambeau, Father and Son,<br />\nBy Jean-Edmond Weelen.<br />\nTranslated by Lawrence Lee.<br />\nWith a preface by Gilbert<br />\nChinard. New York: Henry<br />\nHolt & Co. 285 pp. $3.00.<br />\nHistory, or human whimsy if you<br />\nwill, often plays queer tricks on men.<br />\nStrange and persistent delusions have<br />\nagain and again grown up about some<br />\nparticular event or person and hahg<br />\non with startling tenacity. Certainly<br />\nnot the least of these are the widelypopular myth of the military genius<br />\nof George Washington (well-known as<br />\nthe \"father of his country\") and the<br />\nbelief in Lafayette as the guiding star<br />\nand ingenious strategist of the French<br />\nforces in America, during the War for<br />\nIndependence.<br />\nSome mocking irony has seen fit<br />\nto place Rochambeau in the shadows.<br />\nThat he was the actual saviour of<br />\nAmerica in 1783, that he was the<br />\nmost capable general France had produced in decades, that he far outclassed Washington in military strategy, that he was both theoretically<br />\nand actually the victor of Cornwallis<br />\nare easily forgotten under the influence of the blinding halo which surrounds the :more enthusiastic and<br />\nflaming glamour and dash of the<br />\nyoung Lafayette.<br />\nMr. Weelen, one of the younger and<br />\nlesser-known French historians, has<br />\nperformed no mean task in his attempt to adjust the balance of historical justice. The result of several<br />\nyeads of concentrated study of authentic public and private archives is<br />\nthis volume, in which Rochambeau<br />\n\"has ceased to be a mere name.\"<br />\nUndoubtedly Rochambeau himself<br />\nwas highly responsible for the neglect<br />\nposterity.<br />\nof<br />\nforgetfulness<br />\nand<br />\nThroughout life, he was unusually<br />\nquiet and reserved, the personification of modesty itself. By nature he<br />\nwas exactly the antithesis of Lafayette who perpetually spoke and acted<br />\n<br />\nmilitary crispness and suppress every<br />\nexpression of personality, opinion, or<br />\nemotion.<br />\nPerhaps the best summation of<br />\nRochambeau's character appears in<br />\nthe introduction written by Professor<br />\nChinard, formerly of the Johns Hopkins University, who is one of the<br />\nworld's greatest students of FrancoAmerican relations:<br />\n\"In the book of Mr. Welen, he<br />\nlives again, and the old aristocrat, the descendant of a long<br />\nline of warriors, appears unexpectedly more of a true republican in spirit and in conduct<br />\nthan Lafayette himself. He was<br />\nevery inch a soldier and had no<br />\nambition except to serve his<br />\ncountry; he was not only a nobleman but a gentleman and, in the<br />\nfullest sense of the word, an honest man.\"<br />\nRochambeau did serve his country:<br />\nhe served Louis XVI, he served America, and he served in the Revolution.<br />\nAlmost half of Mr. Weelen's volume<br />\nis consumed by the hitherto unpublished \"Journal of the Vicomte de<br />\nRochambeau,\" son of the Marshal of<br />\nwhom the Duc d'Engien said: \"Thanks<br />\nto you America is free.\" There is<br />\nnothing to recommend the journal<br />\nexcept perhaps the detail with which<br />\nan observant and astute soldier records his observations in America.<br />\n<br />\nBOULEVARD<br />\nHardware Co.<br />\n432 E. 42ND STREET<br />\nUNiversity 0749<br />\nHouse Furnishings<br />\nHardware<br />\nPaints<br />\nElectrical Supplies<br />\n<br />\n11<br />\n1<br />\n<br />\n;c<br />\nt go<br />\nf, YOUR LOOSE CHANCE<br />\nvt•<br />\n<br />\n•.1<br />\n<br />\n},<br />\n<br />\n,r<br />\n-<br />\n<br />\nWArs.<br />\n<br />\nIron out<br />\nyour laundry<br />\nworries<br />\nSP//FTLY — SAFELY — EC<br />\n<br />\nBv the Railway.Extvmss<br />\nffi<br />\n<br />\n\"Hang it all, Pater, they can't be that good at IN.\"<br />\n\"Wilcox, my son Twenty Grand would be good at 2001\"<br />\n<br />\n1<br />\n<br />\nimmommismommumunommiummummummuumommummummunumit<br />\nCopr. 1936 The Axton•Fishrr Tobacco Co., 1 o.<br />\nWE CERTIFY that we have inspected the Turkish and Domestic Tobaccos<br />\nblended in TWENTY GRAND cigarettes<br />\nand find them as fine in smoking quality as those used in cigarettes costing<br />\nas much as 50% more.<br />\n(signed) Seil, Putt & Rushy Inc.<br />\nan collaboration with tobacco expert)<br />\n<br />\nLet that dependable college pal, Railway Express,<br />\npick up and ship your laundry home and back for<br />\nyou every week. You will find it glossy going —<br />\neasy, fast, inexpensive.<br />\nMerely notify the folks you will send the package by Railway Express, and ask them to return it<br />\nthe same way. You can send it collect too, you<br />\nknow, and while on that subject, we can add, only<br />\nby Railway Express. The folks will understand. It<br />\nsaves keeping accounts, paying bills, to say nothing of spare change.<br />\nYou'll find the idea economical all round. The<br />\nminimum rate is low — only 38 cents — sometimes<br />\nless. Pick-up and delivery by motor vehicle and<br />\ninsurance included in the shipping charge. It's the<br />\nsame with shipping baggage or anything else by<br />\nRailway Express. So arrange your shipping dates<br />\nby phone call to the Railway Express agent, and<br />\nstart now.<br />\nCHARLES and FAYETTE STS.<br />\nVernon 0600<br />\nDepot Office: 203 E. Franklin Street<br />\nVernon 0600<br />\nBaltimore, Md.<br />\n<br />\nRAILWAY<br />\n<br />\nEN the class of 1917 was at college, a long<br />\nTHEN<br />\ntelephone call took (on the average)<br />\nmore than ten minutes to be put through.<br />\nThis time has been whittled down gradually, so<br />\nthat now the connection is made in an average of<br />\n1.4 minutes—nine out of ten of them while you<br />\nhold the line.<br />\nBut this is only one phase of the relentless effort<br />\nto improve. Your service is better today because<br />\nvoice transmission is clearer interruptions and<br />\nerrors less frequent than<br />\never before.<br />\nCollege men and women<br />\nAmerica demands fast but<br />\nfind after 7 P. M.<br />\ntime for<br />\nservice—and<br />\nconvenient<br />\na<br />\nsure telephone<br />\nlong distance calling.<br />\ngets it.<br />\nMoreover, most rates are<br />\nlowest then.<br />\n<br />\nEXPRESS<br />\n<br />\nAGENCY, INC.<br />\n<br />\nNATION-WIDE RAIL-AIR SERVICE<br />\n<br />\nBELL TELEPHONE SYSTE1‘1<br />\n<br />\n\f3<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br />\n<br />\nHopkinsMenAttend<br />\nAdditional Tryouts J.11.11. Adventurers Discover<br />\nJamaican Wilds Unromantic Affair At Harvard<br />\nFor Musical Club<br />\nSet For Tuesday Dr. Gardner And Company Fail To FindBrown-Skinned Drs. Havens, Mast, And 4<br />\nAspirants For Membership<br />\nAsked To Report At Levering Hall, 7.30 O'Clock<br />\nMore Than 50 Students Seek<br />\nPlaces In Group Last Night<br />\nAt Initial Tryouts<br />\n-- Additional tryouts for the Johns<br />\nHopkins Musical Club, oldest and largest campus activity, will be held this<br />\nTuesday at 7.30 P.M. in Levering Hall.<br />\nThe first meeting, held last night<br />\nwas attended by about 50 aspirants<br />\nfor the Glee Club, Blue Jay Orchestra, Banjo Club, and Hawaiian Troupe.<br />\nThere are still places in all these<br />\nbranches as well as in the business<br />\nstaff for newcomers.<br />\nA tentative program of concerts for<br />\nthis season indicates that last year's<br />\nschedule will be repeated until the<br />\nadditions of some other out-of-town<br />\npresentations. In the 1935-36 season,<br />\nconcerts are given at: Maryland College, in Lutherville; Clifton Avenue<br />\nM.E. Church; Annapolis High School;<br />\nPrince of Peace Church; The Chalfonte-Haddon Hall, an Atlantic City;<br />\nWalbrook M.E. Church; Babcock<br />\nMemorial Church; Marjorit Webster;<br />\nSt. Matthews Church; Wilson College;<br />\nRadio Station WCAO; St. Marks'<br />\nChurch; and the West Baltimore M.E.<br />\nChurch.<br />\nSteinwald Coaches Glee Club<br />\nTryouts for the Glee Club will be<br />\nunder the direction of Mr. Osmar P.<br />\niSteinwald, '28, the coach. Mr. Conrad<br />\nGebelein will again take over his<br />\nduties as director of the Banjo Club<br />\nand Hawaiian Troupe. Mr. Gebelein<br />\nwas leader of the world champion<br />\nHawaiian Troupe at the past Chicago<br />\nWorld's Fair. John Soule, '37, is in<br />\ncharge of the Blue Jay Orchestra.<br />\nJohn Steeper, '37, is president of the<br />\nclub, and J. Judge Mehling, '38, business manager.<br />\nLast year the roster of the Musical<br />\nClub contained over a hundred names.<br />\nThe seed of this organization was<br />\nplanted fifty years ago by a group of<br />\nstudents who later attained fame<br />\nIn other fields. Among those instrumental in the founding were the late<br />\nPresident Woodrow Wilson, then a<br />\ngraduate student in Political Science;<br />\nNewton D. Baker, President Wilson's<br />\nSecretary of War; Charles D. Levermore, winner of the Bok Peace<br />\nAward; Arthur Yager, former Governor of Porto Rico; and Albert Shaw,<br />\neditor of the Review of Reviews.<br />\n<br />\nAero Club Expects<br />\nSuccessful Year<br />\nSeeking new members to swell its<br />\nroster, the Johns Hopkins Aero Club<br />\nexpects to have a successful year. G.<br />\nGrahme Duce, president, announced<br />\nthat a meeting would be held early<br />\nnext week in Levering Hall.<br />\nThe large collection of model planes<br />\nwhich the club boasts will be used<br />\nas a basis for study and experiment.<br />\nLater in the Fall members plan a visit<br />\nto a government airport.<br />\n<br />\nDr. Havens To Take<br />\nLeave At Semester End<br />\nDr. Raymond T. Havens, Caroline<br />\nDonovan Professor of English literature, will be on leave of absence after<br />\nFebruary 1, to complete his work on<br />\nWordsworth's Prelude. Dr. William<br />\nParkes, instructor in English at Ohio<br />\nState University, will conduct classes<br />\nduring his absence.<br />\nDr. Havens, in addition to his graduate work, is at present conducting<br />\nin undergraduate course in the Romantic Poets. He is also scheduled<br />\nfor several lectures in the Survey of<br />\nEnglish Literature Course.<br />\n<br />\nBeauties; Learn Instead That Being Marooned Is Pretty<br />\nTiresome Affair, Especially When It Rains<br />\nFor students in the morass of 8.30 our work from there. It is very fine<br />\nEconomics classes, dreams of being country. We had a banana plantation<br />\nmarooned on a tropic isle surrounded on one side of us, and a coffee plantby a bevy of brown-skined beauties ation on the other.\"<br />\nExpedition Made<br />\nafford the only hope of a better life<br />\n\"A four-day expedition to the highto come. But to the members of the<br />\nHopkins expedition into the wilds of est mountain on the island about 7500<br />\nJamaica this past summer, being ma- feet in elevation, produced some inrooned was a pretty tiresome affair. teresting discoveries,\" continued Dr.<br />\nDr. W. Gardner Lynn, Zoology In- Lynn. \"Although we lost a great deal<br />\nstructor; Mrs. Lynn, also a Zoologist; of time through bad, rainy weather,<br />\nDr. John Buck, and C. B. David Heiser, we explored country we believe has<br />\na graduate student at the University never been seen before.\"<br />\nDr. Lynn expressed confidence that<br />\nmade up the membership of this particular expedition, and according to the next expedition into this little exDr. Lynn, they were pretty glad to get plored region would uncover many<br />\nit over with—that is, being marooned. new discoveries.<br />\n\"At five thousand feet we came<br />\nPlenty Of Rain<br />\n\"We were going along a road in across an animal, changed very little<br />\nJamaica during an incessant rain- since ancient times, known as the<br />\nstorm\" said Dr. Lynn,\"when suddenly Peripatus,\" said Dr. Lynn. \"It has<br />\nthere wasn't anymore road—just both the characteristics of an arthrolarge boulders in its place. That was pod and a worm, but it is usually<br />\ntwenty miles from the nearest town. placed in a class by itself. Previous<br />\nWe had to wait a week before we to our discovery the animal has never<br />\ncould get through and the rain held up been known to exist above 1000 feet.\"<br />\nStrange Species Of Frog<br />\nour investigations.\"<br />\n\"Among the other things that we<br />\nDr. Lynn outlined the work of the<br />\nmembers of the expedition as follows: saw was a species of tree frog, which<br />\nDr. Buck: Studied several new instead of laying eggs in ponds, laid<br />\nspecies of firefly, noting the fre- them in the bases of plants, filled with<br />\nquency of flashes of light and photo- water. At 3500 feet elevation there<br />\nwere large land crabs measuring seven<br />\ngraphing their spectra.<br />\nMr. Davidheiser: Specialized in the to eight inches across. We also studlife histories of moths and butterflies. ied marine forms on the sea-coast<br />\n\"The object of my work on the ex- during our automobile trip around the<br />\npedition was to collect frog embryos island.<br />\n\"Altogether, my wife and I colfor thyroid study,\" said Dr. Lynn.<br />\nThere is a species of frog in Jamaica lected 900 specimens of adult frogs,<br />\nwhich have no tadpole stage. Instead Including several species never before<br />\nits eggs are laid in rocks high up in known;; and a countless number of<br />\nfrog eggs, from which we studied the<br />\nthe mountains of the island.<br />\ndevelopment of the frog embryo,\" confeet<br />\n3500<br />\nabout<br />\n\"We made our base<br />\nup in the mountains and carried on cluded Dr. Lynn.<br />\n<br />\nLeave Of Absence Social Sciences Are<br />\nGranted To Dr.Reid Affected By Change<br />\nrms.(<br />\nProfessor Of Chemistry For New Reading List Revised<br />\nTo Cover A More<br />\nTwenty Years To<br />\nExtensive Field<br />\nRetire In '37<br />\n<br />\nPLEASE PATRONIZE<br />\nOUR ADVERTISERS<br />\n<br />\nWeed Visit Tercentenary<br />\nCelebration<br />\nAs the 332nd oldest college in the<br />\nworld, the Johns Hopkins University<br />\nwas represented at the Tercentenary<br />\nCelebration of Harvard University recently by Dr. Raymond D. Havens,<br />\nprofessor of English Literature; Dr.<br />\nS. 0. Mast, professor of Zoology; and<br />\nDr. Louis H. Weed, former dean of the<br />\nHopkins Medical School. Dr. Isaiah<br />\nBowman, president of the Hopkins,<br />\nwas taken ill and was unable to<br />\nattend.<br />\nThe delegates from the various universities throughout the world were<br />\ncalled to the platform, at the opening<br />\nof the assembly, in the order of their<br />\nseniority. Representatives of the University of Cairo were first to receive<br />\nan ovation from the assemblage of<br />\nover 15,000 persons. Delegates from<br />\nHopkins were 332nd to gain this<br />\nhonor.<br />\nFine Affair<br />\n\"We were royally entertained,\" said<br />\nDr. Mast. \"It was a very elaborate<br />\naffair. Everything possible was done<br />\nfor the convenience and pleasure of<br />\nthe delegates.\"<br />\nBesides attending conferring of degrees, and addresses by world reknowned educational figures and illustrious alumni, including the President of the United States, all the<br />\ndelegates were invited to several of<br />\nthe concerts given by the Boston<br />\nSymphony Orchestra. During their<br />\n<br />\nGet a fresh start<br />\nwith ARROW!<br />\nStock up now with Arrow Shirts—they'll<br />\nkeep you in style for years—and give<br />\nyou more collar and shirt satisfaction<br />\nthan you've ever known before.<br />\nTry HUNT or CARLTON, with the<br />\npopular wide-spread collar models.<br />\nMitoga fit. ... Sanforized Shrunk.<br />\nIn white or fancy — $2.00 — $2.50<br />\n<br />\nstay, the Hopkins representatives resided at the homes of members of<br />\nthe faculty of Harvard and their<br />\nfriends.<br />\nFRANCK RECEIVES GRANT<br />\nProfessor James Franck, of the<br />\nPhysics Department has received a<br />\ngrant of $10,000 from the Rockefeller<br />\nFoundation for researches in photosynthesis and the photo-oxidation pro-<br />\n<br />\nWhen college men think of shirts, they immediately think<br />\nArrow. Drop in and see our latest collegiate styles.<br />\n<br />\nMC PHERSON'S<br />\n11 East Baltimore Street<br />\n<br />\ncess.<br />\nDr. E. Emmett Reid, professor of<br />\nOrganic Chemistry, has been granted<br />\na one yearr's leave of absence, and is<br />\nto retire at the end of that period.<br />\nHe will be sixty-five years old next<br />\nspring.<br />\nDr. Reifi was appointed Associate<br />\nProfessor in Chemistry at the Hopkins in 1914 and Professor in 1916.<br />\nDuring the war he served as a consultant in gas warfare with title<br />\nChemical Warfare Service and was<br />\nsuccessful in working out the method<br />\nwhich is used for making tear gas at<br />\nthe present time. His scientific activities have covered a wide range in<br />\nthe filed of organic chemistry. His<br />\nstudies on hydrolysis and esterification culminated in an invitation to<br />\ncontribute a chapter on these subjects<br />\nto the most recent monograph on laboratory methods. His exhaustive and<br />\nlong-continued studies upon organic<br />\nsulfur compounds led to his selection<br />\nby the American Chemical Society as<br />\nthe author of the monograph on aliphatic sulfur compounds which is in<br />\nprocess of preparation at the present<br />\ntime. His fundamental studies on the<br />\noxidation of organic compounds have<br />\nbeen followed with keen interest by<br />\nlaboratories all over the country. Dr.<br />\nReid has also been noted for his<br />\nstudies in physical properties of series<br />\nof organic componuds. His laboratory<br />\nhas been most productive in matters<br />\nof manipulation and technique in organic work,.and the number of new<br />\nsubstances which have come out of it<br />\nmay possibly exceed that of any other<br />\nlaboratory.<br />\nLast year Dr. Reid gave two courses<br />\nin Organic Chemistry in the Graduate<br />\nDepartment.<br />\n<br />\nEVEN A BUSY COLLEGE MAN<br />\nNEEDS TO GO SHOPPING<br />\nONCE IN A WHILE<br />\nSo we'd like to file for future reference that our whole store<br />\nis at your service—though we call your attention especially to<br />\nour Men's Shop on the first floor, and our Young Men's Shop<br />\non the third. Perhaps you won't even have to come in; try<br />\nwriting or phoning us!<br />\n<br />\nHUTZLER BRITIEM<br />\n<br />\nDr. George H. Evans, who succeeds<br />\nDr. W. Stull Holt this year as head<br />\nof the Social Science Group, announced a change in the reading list for<br />\nstudent majoring in the Social Sciences.<br />\nLast yar's list included three separate groupings incorporating books<br />\nfor general reading; classics of social<br />\nscience and histories used as introductory surveys of logic, government<br />\nand politics.<br />\nCovers More Ground<br />\nThe revised list, however, follows<br />\na more definite purpose in that it attempts to link Social Science with<br />\nliterature, law and geography. Also<br />\nbooks are suggested to acquaint the<br />\nstudent with courses not offered at<br />\nanthropology.<br />\n<br />\nHopkins—particularly<br />\n<br />\nThis enables the student to gain more<br />\nknowledge with less effort on his<br />\npart. A larger list of classics is included which the student is expected<br />\nto merely dip into in order to obtain<br />\na foundation and knowledge of the<br />\nsubject-matter. Also provision is made<br />\nfor those who wish to obtain enlightenment of any course by outside reading under an instructor rather than<br />\ntake the course.<br />\n<br />\nGET YOUR<br />\nCOLLEGE RING<br />\nBearing<br />\nOfficial Seal<br />\n<br />\nWith the Pen That<br />\nStudents<br />\nRate Highest<br />\nBY ACTUAL VOTE<br />\n<br />\nInvented by n College<br />\nProfessor to Bring You<br />\nHigher Grades<br />\nA college professor noticed that<br />\npoor grades are often due not to<br />\nbrains running low but to pens running dry!<br />\nSo he worked out an utterly different and basically better pen principle<br />\n—and Geo. S. Parker engineered it<br />\nto perfection.<br />\nThuscame the revolutionary Parker<br />\nsacless Vacumatic that has superseded every old-style pen—both sactype and sacless.<br />\nRecently the student editors of 30<br />\ncollege papers asked 4,699 of their<br />\nreaders, \"Which make of pen do you<br />\nown? Which pen do you prefer?\"<br />\nTo both questions more students<br />\nanswered \"Parker,\" than any other<br />\ntwo makes of pens COMBINED!<br />\nOne reason is that the Vacumatic<br />\nink supply is EVER-VISIBLE, the<br />\nENTIRE length of the barrel. It<br />\nisn't merely last-drop visibility—<br />\ndoesn't merely show when your pen<br />\nis empty.It shows days ahead WHEN<br />\nIT'S RUNNING LOW, so it can't<br />\nrun dry against your will.<br />\n<br />\nonly<br />\n<br />\nThe Vacumatic9s working parts<br />\nare sealed in the top WHERE INK<br />\nCAN NEVER TOUCH THEM—<br />\ncan never decompose them. That's<br />\nwhy this miracle pen is GUARANTEED mechanically perfect.<br />\n<br />\n25c<br />\n<br />\nAnd the Parker Vacumatic has no<br />\nrubber ink sac or lever filler—hence<br />\n<br />\nCertified<br />\n$2.00 Value<br />\n<br />\nwith the<br />\npurchase ofa<br />\nbottle of<br />\n<br />\nQtafil<br />\nVaricer<br />\nt 15c—Tof al 40c ... YOU SAVE $1.75<br />\nThis amazing oiler is made solely to introduce Parker Quink - the miracle ink that cleans<br />\nyour pen as it writes, and dries ON PAPER<br />\n:f<br />\nfaster than pen-clogging inks.<br />\nGet ()tank today from any st,re selling nk.<br />\nTear off the box-top and on the back write the<br />\nFULL NAME of your school or college. ring<br />\nSIZE, and style wanted (man's or<br />\nwoman's), and your name and address. Mail box-top with 25 cents in<br />\ncoin to The Parker Pen Co.,Dept.737,<br />\nJanesville, Wis. Don't delay.This offer<br />\nends Dec. 31. 1936, if supply lasts.<br />\n<br />\nParLer<br />\n<br />\nMRao-VACUMATIC-ER<br />\nGUARANTEED MECHANICALLY PERFECT<br />\n<br />\n$75-9 Pencils, $2.50,<br />\nJunior, $5;<br />\n$3.50 and $5<br />\nOver-Size, $10<br />\n<br />\nhas room for 102% more ink without<br />\nincrease in size!<br />\nIts luminous,laminated Pearl style<br />\nhas won every pen Beauty Contest<br />\nby 2 to 1. Go and see it today at any<br />\ngood store selling pens. The Parker<br />\nPen Co., Janesville, Wis.<br />\n<br />\nTo Make Any Pen Clean Itself<br />\nTry this utterly different writing ink—<br />\nParker Quink — an ink that<br />\ndissolves deposits left in pens<br />\nby ordinary inks. Quink<br />\ncleanses a pen as it writes—a<br />\nParker or any other pen. Ends<br />\npen-clogging.Get Quink at any<br />\nstore selling ink, 15c and 25c.<br />\n<br />\nYour Nearest Dealer is<br />\nA Full<br />\nSupply<br />\nOf<br />\nQuinto<br />\n<br />\nKIBLER'S<br />\nJEWELERS and OPTICIANS<br />\n3222 GREENMOUNT AVENUE<br />\n<br />\nGet Your<br />\nJ. H. U.<br />\nRing Here<br />\n<br />\n\f4<br />\n<br />\nCross Country<br />\nSquad Prepares<br />\nFor '35 Season<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br />\n<br />\nIntercollegiate<br />\nPolicy<br />\n<br />\nOct. 3 — Open<br />\n, Away<br />\nThe intercollegiate athletics proOct. 10 — Lehigh<br />\nHome<br />\ngram of 1936-1937 will follow along<br />\nOct. 16 -- Washington<br />\nHome<br />\nthe lines pursued by the department<br />\nof athletics during the past two years.<br />\nOct. 24 --Haverford<br />\nHome<br />\nOnce again there will be thirteen acOct. 31 --- Randolph Macon Home<br />\nHarrier Squad Bolstered By tivities in which Hopkins teams will Nov. 7 -Swarthmore<br />\ncompete with other colleges and uniAway<br />\nReturn Of Many Experi- versities.<br />\nNov. 14 — American<br />\nAway<br />\nIn accordance with the standards<br />\nenced Veterans<br />\nNov. 21<br />\nOpen<br />\nof the University, athletics at the<br />\nHopkins will be conducted on a pureNov. 28 -- St. Johns<br />\nHome<br />\nly amateur basis. As in former years,<br />\nthere will be no subsidization of playPromising Freshman Appear ers nor the awarding of scholarships Physical Exams Set<br />\nbased on athletic prowress. The deFor This Month<br />\nIn Ranks Of New<br />\npartment is essentially interested in<br />\nthe organization of teams which will<br />\nCard Dates<br />\nThe Department of Physical Edube of value to and provide pleasure cation and Athletics wishes<br />\nto call to<br />\nThe Johns Hopkins cross-country for the members of the student body. the attention of undergraduates the<br />\nDr. Shaffer, associate director, em- fact that they are<br />\nrequired to have a<br />\nteam inaugurated its 1936 season this<br />\nphasized that this does not mean physical examination in<br />\nOctober of<br />\nweek with a series of limbering-up that athletic victories<br />\nwill not be their first and second years of resiexercises preparatory to taking to the desired, since victories do form the<br />\ndence. All students who have not<br />\nHomewood long distance course. The basis upon which a season's success is made appointments for<br />\nexaminations<br />\nsquad is moderate in size at this early measured. However, defeat will not are requested to apply for appointbe accepted so ungraciously as to je- ments at Room 407,<br />\nGilman Hall,<br />\ndate with more candidates expected<br />\nopardize a coach's position. The policy at once.<br />\nwhen the academic work swings will once again be<br />\nthat of athletics<br />\nEvery undergraduate is required to<br />\nalong more regularly.<br />\nfor the sake of sport alone.<br />\nhave one year of physical education<br />\nThe coaches have expressed satis- (two hours,<br />\nOf the squad which hill-and-daled<br />\none each week), unless<br />\nfaction<br />\nwith the great number of sufficient credits<br />\nhave<br />\nreveterans<br />\nlast year, many<br />\nare presented from<br />\ncandidates who have turned out for another institution<br />\nto absolve the returned to form the nucleus of the<br />\nthe various fall activities.<br />\nquirement (in the cases of transfer<br />\npresent track group. Captain Carl<br />\nAttractive schedules have ben ar- students).<br />\nSholtes is filling the position occu- ranged in these sports and the interest<br />\npied by Leonard Emmert in 1935, and enthusiasm ilicited by the candiwith Castelle, G. Brown, Lyman, dates presages success for the fall<br />\nprogram.<br />\nSchultz, Whrminski, Mace, Briscoe,<br />\nDr. Shaffer made it clear that there<br />\nand Boland contending for the places<br />\nis to be no sharp and distinct line of<br />\nleft by G. Brown and Moxley. Milton demarkation between the intercollegiSaul has stepped into the managerial ate sports and the intramural acshoes vacated by Hartman. Of the in- tivities. One program will not be made<br />\ncoming Freshmen, Scharpf and Lamb to conflict with the otherr, nor will<br />\nhave seen action with the long dis- one be considerably more emphasized<br />\ntance men of Poly, while Norton trod .han the other. Last year more than<br />\nthe cinders for the East Aurora H. S. 80 per cent of the students pursued<br />\nin New York.<br />\nsome athletic endeavor. It is hoped<br />\nHambleton At Reins<br />\nthat this lofty proportion will even<br />\nWaldo Hambleton, who also tutors be exceeded during the ensuing year.<br />\nthe swimmers and tracksters, again<br />\ntakes up the reins as mentor of the FOOTBALL MANAGERS OUT<br />\nmarathoners. He stated that the prosBrian Murphy, manager of the footpects for the coming season were ball team, has requested and urged<br />\nstill indefinite, but he expects the that all those freshmen interested in<br />\noutfit to be in fine fettle for the becoming football managers should<br />\nopening meet with Lehigh, the first appear at the field immediately. For<br />\nof seven contests for the Blue Jays. an enterprising student there is alMr. Hambleton advised any interested most a clear path to the position of<br />\nIn the sport to report, as a Junior senior manager. Football practices are<br />\nVarsity schedule has been arranged held at 4 each afternoon and all<br />\nfor those who do not make the first freshmen anxious to gain the berth<br />\nsquad. In particular are Freshmen should report at once.<br />\nurged to attend practices. The coach<br />\nwent further to declare that all out<br />\nfor the team would get into active<br />\ncompetition, and that this training<br />\nwould be essential for those who are<br />\ninterested in spring track, lacrosse,<br />\nbaseball, and the winter sports.<br />\nThe Schedule<br />\nOct. 24--Lehigh—Home<br />\nOct. 31—Swarthmore--Away<br />\nNov. 6—Drexel—Away<br />\nNov. 14—Franklin and Marshall<br />\nAway<br />\nNov. 21—Open<br />\nNov. 26—Capital C. C. —Away<br />\nDec. 12— S.A.A.A.U.<br />\n<br />\nSholtes Is Captain<br />\n<br />\nThe immense success of last year's<br />\nintramural<br />\n<br />\nsports<br />\n<br />\nprogram<br />\n<br />\nbanner season for the Jays. Great<br />\nthings are expected of Hartke and<br />\nPhillips on the offense. Captain Pete<br />\nBernheim, who also predicts a fine<br />\ncampaign, will no doubt be a bulwark on the Jay defense. Tommy<br />\nThe 1936 edition of soccer candi- Dukehart,<br />\na newcomer, is also expectdates put in its appearance for the<br />\ned to be one of the shining lights of<br />\ncurrent season on September 29.<br />\nthe squad.1<br />\nHaving waged a very successful campaign last year, the booters have atEarn expenses with novelties.<br />\ntained greater significance on the<br />\nDisplays sell for you. Samples<br />\nathletic program than ever before.<br />\nand training furnished.<br />\nWith last. year's entire squad, with<br />\nthe exception of McClean and Randall,<br />\nARTCRAFT<br />\n313 ALLEN<br />\nback for duty, Coach Dotterweich is<br />\nGrand Rapids, Michigan<br />\nvery optimistic and predicts another<br />\n<br />\nRooters Practice<br />\nForOpeningGame<br />\n<br />\nIntramural<br />\nPolicy<br />\n<br />\nFootball Schedule<br />\n<br />\nwhich<br />\n<br />\ndrew forth complimentary editorial<br />\ncomment from the local papers has<br />\nensured the continuance of this mode<br />\nof campus activity. For another season Reuben Baer will remain in the<br />\ncapacity of main organizer and director of the various integral parts of<br />\nthe intramural scheme. However, this<br />\nyear the entire staff of varsity coaches and assistants will be engaged for<br />\na good part of the time in the direction and supervision of intramural endeavors.<br />\nAgain the fundamental purpose of<br />\nthe sports plan is to promote participation of every enrolled undergraduate in some form of athletic activity.<br />\nThe list of sports arranged for this<br />\nyear includes in its fold football, basketball, softball, handball, badminton,<br />\nand tennis.<br />\n<br />\nN the making of fine<br />\n<br />\nI<br />\n<br />\nbeer there is no substitute for time . ..<br />\nand here at National<br />\n<br />\n... we take our time.<br />\n, BRANDAN'S<br />\nMen and Young Men's<br />\nFurnishings and Clothing<br />\n3206 GREENMOUNT AVE.<br />\nUNiversity 3064<br />\n<br />\nBRIGHT COLLEGE<br />\n<br />\nYEARS GET OFF TO<br />\nA GOOD STARTAT<br />\n<br />\n11110CIISCHILD,KOHN 411 Co.<br />\n<br />\n\"NATIONAL<br />\nThe National Brewing Co.<br />\nBALTIMORE, MD,<br />\n<br />\nEat At The<br />\n<br />\nPeabody<br />\nPharmacy<br />\n<br />\nBOULEVARD<br />\nRestaurant<br />\n<br />\nWe Sell Drugs and Give Service<br />\nCALVERT and 30TH STREETS<br />\n<br />\n3226 GREENMOUNT AVE.<br />\n<br />\nNORTH<br />\n<br />\nINN<br />\n<br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF<br />\nCOLLEGE FRIENDS<br />\nOur Prices are Lower Than Ever<br />\n<br />\nBirely's Pharmacy<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School Supplies<br />\nSandwiches<br />\nUnexcelled Fountain Service<br />\n<br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nGridmen Prepare<br />\nFor First Contest<br />\nMallonee Men In Form After<br />\nDebut After Three<br />\nWeek's Work<br />\n(Continued from Pagel, Col. 1)<br />\nitself. Vincenti has proven himself a<br />\ngood blocker and a valuable defense<br />\nman. Kahl and Ward kick well, and<br />\nKahl, moreover, has been running in<br />\na very commendable fashion. And of<br />\ncourse \"Graz\" holds down the fullback<br />\njob as usual.<br />\nGreen, a freshman of punting and<br />\nrunning value, stands out among the<br />\nnewcomers aspiring for backfield positions. Once again we have Demi<br />\nTraggis, our mighty mite, making<br />\nsome of the bigger boys look like<br />\nmonkeys.<br />\nStress Running Attack<br />\nThe coaching staff has been stressing a hard running offense; plenty of<br />\nend runs, reverses, spinners, and fast<br />\nline bucks will feature this year's attack. As yet nothing substantial in<br />\nthe way of a passing combination ha.s<br />\nbeen developed, but the mentors<br />\nseemed interested enough when Zinie<br />\nBaum, a junior and a member of the<br />\n1935 squad, first tossed, a couple of<br />\nbeautiful flat, bullet passes, and then<br />\nproceeded to fling the ball over fifty<br />\nyards down the field. If his control<br />\nimproves the Blue Jays may take to<br />\nthe air.<br />\nHopkins is going to try a new defense never before seen in Maryland.<br />\nMa prefers not to talk at the present.<br />\nIt looks like storms are brewing up<br />\nfor our friends from Annapolis.<br />\n<br />\nCStel. le<br />\n...for tobacco<br />\ncut right to smoke right<br />\nThere's a right way to carve a chicken or slice a ham.<br />\nAnd there's a right way to cut tobacco.<br />\nWhen the tobacco in your cigarette is cut the way<br />\nit is in Chesterfield ... right width and right length<br />\n... it burns even and smooth... it smokes better.<br />\n01936, LIGGETT & MYERS TOBACCO Co.<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nrNTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nitalltts igopittits Nrins-Krttrr<br /><br />\nPRICE 5 CENTS<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br /><br />\nVOLUME XLI, NO. 1<br /><br />\nDON'T DELAY!<br />\nSUBSCRIBE TO YOUR<br />\nHULLBALOO NOW<br /><br />\nJays Prepping Yearbook Dropped Freshman Camp Filled ToBrim Five New Courses Spitzer Arrival<br />\nActivity List With New'Campus Characters' Added To Chemistry At Hopkins Set<br />\nFor October10th From<br />\nAsS.A.C.Retrenches Eugene \"The Jeep\" Wilson, Bill \"Benny\" Freedman, And Schedule This Year<br />\nDuel At Lehigh \"Hullabaloo' Editors To Seek \"Terry McGovern Combine To Make Things Drs. Harks And Wiselogel To For October 9th<br />\nInteresting For New Class<br /><br />\nMallonee Men In Form Funds Through Optional<br />\nStudent Subscriptions<br />\nFor Debut After Three<br />\nWeeks' Work<br />\nAustrian Declares Fate Of<br />\nPindellGuidesBacks Book Rests On Undergraduate Response To Appeal<br />\nVincenti, Kahl, Ward, and Because of a cut in the Student<br />\nActivities Committee's appropriation<br />\nGraziano Form Nucleus<br />\nyear, the Hullabaloo, campus year<br />\nthis<br />\nOf Veteran Backfield<br /><br />\nTerry loves base-ball, especially<br />\nDo you remember, at the end of<br />\nlast year, the weeping, wailing, and when playing \"foist\" base on the<br />\ngnashing of finger nails? And all same team with \"Voinen\" Grove.<br />\nbecause the fellows thought that all Next best he likes to go to \"Choich\"<br />\nthe \"campus characters\" were leav- on Sunday.<br />\ning. Having been to Freshmen Camp<br />\n(My Gawd them nights was cold)<br /><br />\nBill Hammaker Likeable<br />\nAnother 'campus character\" des-<br /><br />\nI am now ready and willing to re- tined to become very popular is<br />\nBill Hammaker, the new \"Y\" secre-<br /><br />\nfute this stupid statement.<br /><br />\nThis class of '40 simply reeks with tarry. There isn't much you can say<br />\nAs the curtain rises for another group of University-supported activi- \"campus<br />\ncharacters.\"<br />\nAlready about Bill, except that he's one<br />\nscholastic year at Hopkins, few of us ties. The cut was effected, activities through our halls of learning are \"swell all-around fellow\". If there is<br />\nrealize that our athletic season is officials yesterday explained, to aid echoing cries of, \"Who doesn't know anyone who hasn't met our \"Y\" secalready more than three weeks old. in the University's general retrench- Eugene Wilson?\" We mean Eugene retary thus far, he will benefit him-<br /><br />\n-- —<br />\nIstanbul Professor Will Take<br />\nOver Philological Post In<br />\nDr. Fowler Will Take Charge Romance Language Dept.<br />\nOf Physical Chemistry; No<br />\nWord Of Robles<br />\nMayer Offers Course<br />\nFar-reaching changes in the person- Spanish Professor, Who Acnel and courses of the undergraduate<br />\ncepted Madrid Gov. Place<br />\nchemistry department at the Hopkins<br />\nUnreported Since Aug.<br />\nhave been made this fall. Eight new<br />\nAdminister Elem. Course<br />\nFor Department<br /><br />\nbook, has been excluded from the<br /><br />\ncourses have been added to the curDr. Leo Spitzer, professor of Roriculum, also five membrs of the<br />\nmance philology at the University of<br />\ngraduate faculty and two new instrucIstanbul, left yesterday from Venice<br />\ntors have been assigned to teach<br />\naboard the liner Conde di Savoia to<br />\nthem. The latter will also take an acassume the same position at the<br />\ntive part in the research work in<br />\nWhile most of us spent the closing, ment.<br />\nof the agile mind and horn-rimmed self exceedingly by dropping in Bill's<br />\nJohns Hopkins University. He is exchemistry.<br />\npected at the Hopkins October 9, acand, in many cases, the most joyous,<br />\nThe withdrawal of S.A.C. financial spectacles. Eugene, by the way, was Levering Hall office for a short \"bull<br />\nDr. David Harker, formerly of the<br />\ncording to Dr. H. Carrington Lancasdays of our long vacation, our grid- backing makes publication of the an- the fellow who didn't know a single session.\"<br />\nCalifornia Institute of Technology,<br />\nter, head of the departrment of Roiron hopefuls were hard at work get- nual dependent on a campaign for other fellow in the entire camp.<br />\nAlso at this time we feel that we and Dr. Frederick Wiselogel, premance languages.<br />\nting in trim before the dawn of an- subscriptions, which began with the<br />\nare privileged (don't tell the Editor!) viously an instructor in chemistry at<br />\nHavlow Questioned<br />\nWith the academic term already unthe<br />\nUniversity<br />\nof<br />\nMichigan,<br />\nhave<br />\ncome<br />\nother football campaign.<br />\nregistration days and will continue unAnd then there was Bill (Benny) in place upon the curly head of Boyd to the Hopkins to assist in the ele- der way, Dr. Lancaster yesterday<br />\nAt the helm, guiding and driving til the Thanksgiving holidays. In the Freedman who stopped Dr. Havlow Frey the coveted Nimbus for his exmentary course. Under the guidance also expressed concern for Dr. Jose<br />\nour light but well-oiled machine, we past two years, the cost of the individ- right smack in the middle of his cellent generalship and clever exec- oi the former, students are taking Robles, a professor in his department,<br />\nfind once again Coach Gardner Mal- ual year book has been included in the speech to ask him if he was kidding utive ability in running Freshmen the basic course, Physical Science IC, who left for Spain last June and has<br />\nwhich is a group course, including not yet returned. The last heard of<br />\nlonee. This year his task his been student's tuition.<br />\nwhen he told the Freshmen that the Camp.<br />\nOld System Bad<br />\nphysics, mathematics, and chemistry. Dr. Robles was through an Associated<br />\nsomewhat lightened by the addition<br />\nNor must we leave out genial Tom<br />\nPress dispatch of August 24.<br />\nDeclaring that the old system of name of Bridgeport, Connecticut's<br />\nWiselogel To Assist<br />\nof a new backfield adviser,-Wiatson Hullabaloo distribution had always oc- Socialist mayor was \"McLevy\". Mr. Hubbard, whose sparkling stories and<br />\nRobles Missing<br />\nDr. Wiselogel will assist Dr. F. 0.<br />\nDr. Lancaster said that neither he<br />\nPindell. Mr. Pindell has the distinction casioned deficits that had to be Freedman couldn't seem to<br />\ncamp<br />\ninwaggish<br />\ngestures<br />\nmade<br />\nour<br />\nRice<br />\nin<br />\nteaching<br />\nthe<br />\nelementary<br />\norget over<br />\nnor the University has made any efof having been a member, along with wiped out, in part, with additional It. When questioned about it, his finitely more pleasant and lusory.<br />\nganic chemistry course.<br />\nfort to communicate with Dr. Robles,<br />\n'37,<br />\nAustrian<br />\nUniversity<br />\nfunds,<br />\nRobert<br />\nHopkins<br />\nlast<br />\nthe<br />\nEngaged<br />\nin<br />\nconstructing an appaMr. Mallonee, of<br />\nonly reply was, \"Would you believe<br />\nWe might go on for hours at a time,<br />\neditor of the book, said that Dean E.<br />\nratus for the production of neutrons nor has anyone been appointed as yet<br />\neleven to defeat Maryland. On this<br />\na<br />\nguy if he told you his name was enumerating all the grand personin his place.<br />\nW. Berry and the S.A.C. had agreed<br />\nis Dr. Robert D. Fowler. His machine<br />\nteam he played fullback and was reDr. Robles had been appointed<br />\nto the induction of the new plan. It McGoldbery or O'Greenblatt.\"<br />\nages who put in their appearance at promises to be the most powerful<br />\nsponsible for many a long and much- was announced that the book will<br />\nWoe be unto us if we forget to Camp Letts, but this, like all other devised. He is in charge of the un- chief of Spain's foreign press relaneeded gain. \"Wats\" is a likeable and cost three dollars and fifty cents; subtions after the outbreak of the presgive you the dope on Francis Xavier mediocre articles, has been brought dergraduate physical chemistry labIntelligent chap. He gets along very scription is optional.<br />\noratory, and students working with ent rrevolt.<br />\nto a close by your cruel Editor.<br />\nPointing out that, though purchase Terry.<br />\nIt was one of Dr. Robles frequent<br />\nhim are coming in contact, with the<br />\nwell on and off the field with both his<br />\nof<br />\nthe<br />\nbook is optional, the mainvisits<br />\nmost<br />\nadvanced<br />\nto his native country, which<br />\nworks<br />\nin<br />\nthis<br />\nfield.<br />\ncandifellow coaches and the team<br />\ntenance of the Hullabaloo is totally deAnother contact between the under- he left for the Hopkins about ten<br />\ndates. While at Hopkins he was an pendent on the students' subscriptions,<br />\ngraduate students and the graduate years ago. He had left his family in<br />\nengineer,-and a good one at that. He Austrian added that \"it is no longer<br />\nfaculty is being provided by a new Porrtugal however, and is reported<br />\npossible to put out an adequate year<br />\ngraduated in 1928.<br />\nlecture course in theoretical chem- to have planned most of his stay<br />\nbook under the former financial<br />\nistry, which is offered by Professor in Madrid where he was friendly<br />\nCapable Assistants<br />\nNew \"Y\" Secretary Stresses New Rushing Agreement, J. E. Mayer, in collaboration with with officials of the \"liberal\" regime.<br />\nsystem\".<br />\nWith such capable men as Pindell<br />\nClass Support Urged<br />\nFreedom Before Freshmen; Backed By Administration, Dr. Fowler.<br />\nIn a statement to the Associated<br />\nand Ed Lotz, a figure familiar to us<br />\n\"By calling for the first three<br />\nChem.<br />\nEngineering<br />\nCourse<br />\nPress<br />\non August 24th, Robles exMalCoach<br />\nall, working with him,<br />\nLeaders Speak<br />\nNow In Effect<br />\nclasses' financial support\", he continWith the cooperation of the School pressed his confidence in the outcome<br />\nlonee finds himself in a much better ued, \"it is hoped that greater interest<br />\nof Engineering a course is being in- although he predicted that \"it would<br />\n\"Students seem to have overcome<br />\nposition than ever before to concen- will be shown and that the Hullabaloo<br />\nThe new \"rushing\" code, protected<br />\ntroduced for the first time in chemical be some time before peace is restored<br />\ntrate on the plays and field tactics will become more an undergraduate the pseudo-feudal waging system cus- by restrictions designed to prevent<br />\nengineering. Honor students will have in Spain.\"<br />\nnecessary to a winning ball team.<br />\npublication rather than solely a senior tomary at other colleges\", declared the reoccurence of past violations, an opportunity to do independent labChair Vacant<br />\nNo college team can be expected to one.\"<br />\nW. L. Hammaker, new secretary of<br />\nwas released Wednesday afternoon oratory work of research caliber, and<br />\nThe chair in Romance philology,<br />\nthe<br />\ngo far without the right sort of stuY.M.C.A.,<br />\nat<br />\nthe<br />\nfirst<br />\nstudent<br />\nThe book is to be dedicated to the<br />\nfollowing a meeting of the Interfra- emphasis is being laid in all laboratory which Dr. Spitzer will occupy upon<br />\ndent leader. And Captain Ted Gra.ziSchool of Engineering, observing its assembly held in Latrobe Hall yesterano,\"Graz\" for short, more than fills twenty-fifth anniversary this year.<br />\nday. He congratulated upperclassmer ternity Board. The agreement, ap- courses on the experimental methods his arrival, has been vacant since the<br />\nthat role. His spirit has been an exfor treating freshmen as normal hu proved by all members of the Board, which are used in modern chemical death of Dr. David Simon Blondheim<br />\nA meeting of the editorial staff of<br />\nresearch.<br />\nin Marrch, 1934.<br />\nman beings.<br />\nample for the rest of the squad, esthe annual is on the books for 12.20<br />\ntook effect immediately.<br />\nThe changes in the curriculum have<br />\nfor<br />\nthe<br />\nDr. Spitzer, a native of Austria,<br />\nnew men; and the<br />\npecially<br />\n\"Academic freedom at the Hopkins<br />\ntoday.<br />\nThe support of the Student Council .ben planned largely in accordance came to Istanbul from the University<br />\nseems<br />\na<br />\nrealized<br />\nother gridsters seem to have taken to<br />\nideal.<br />\nStudents<br />\nare<br />\n\"In this connection,\" said Austrian<br />\nthe idea perfectly, for, to use Mr \"I want to emphasize the fact tha treated as less mature members in an in punishing infractions has been en- with the recommendations of a com- of Cologne, late in 1933, when he was<br />\nMallonee's own words, \"this year's senior photography will begin the association of scholars engaged in ex- listed this year. Any group judged mittee appointed two years ago. con- allegedly expelled from Germany by<br />\nClark, chairman, and representatives the Nazi regime.<br />\nsquad is showing more fight, more first week in November. Therefore ploring the world.<br />\nguilty of violation by the members of<br />\nof the various science departments.<br />\nHe was born in Wien, in 1887, and<br />\nReligion Discussed<br />\nspirit, and more pep than any Hop- I want to ask all members of the<br />\nthe Board will face Council action.<br />\ntook doctorate in philology at the<br />\n\"I believe that religion should not<br />\nkins team in years.\"<br />\n\"Junior\" class, who plan to graduate<br />\nAdministration To Act<br />\nUniversity of Wien in 1909. He holds<br />\nbe merely an opiate of the people, a<br />\nThe eleven selected to tote the pig this<br />\nspring to turn in their names to<br />\nThere is the further possibility that<br />\nfurther degrees from the Universities<br />\nthing indulged in the towers of lusles<br />\nskin against Lehigh on October 10 the office.<br />\nof Paris, Leipzig and Rome. He atand forgotten outside. The \"Y\" fits the Administration will take action<br />\nwill certainly not be lacking in ex<br />\ntained a professorship at the Univerin with the spirit of the Hopkins. Its in the event of any serious offence.<br />\nperience. Five men, Ellis, Davies,<br />\nsity of Marlburg in 1925. Five years<br />\nphilosophy is service to the students<br />\nHopkins, Royster, and Day, have reMade<br />\nPlans<br />\nTo<br />\nConduct<br />\nExtensive<br />\nIn a letter last spring to William Mc•<br />\nlater he took over a similar position at<br />\nsocially, religiously, and personally.\"<br />\nturned from last year's first string<br />\nFall Activity In Chicago<br />\nCologne, where he remained until his<br />\nline. That gives \"Ma\" a mighty fine<br />\nLeaders in every extra-curricular Feeley, President of the Board, Dean<br />\nAnd St. Louis<br />\nsupposed expulsion.<br />\nactivity on the campus made brief Berry gave the following pledge of<br />\nbulwark around which to build a<br />\nforward wall. Rickards, Rostov, Meh Local Fraternity Accepts Invitation speeches primarily devised for the support:<br />\nWith a total of $512,000 already reTo Form Chapter Of<br />\nling, Manger, and Hecht, all of last<br />\nbenefit of freshmen and the solicita\"If I am right in this assumption ported, the public phases of the UniDr. Murnaghan Leaves<br />\nAlpha Chi Rho<br />\nyear's squad, have returned for antion os their support. Holt Maulsby, (that the agreement would be ap- versity's campaign for funds apother chance. Among the new linemen<br />\nFor Princeton Next Week<br />\nchairman of the Student Activities proved by all parties), I am glad to proached a close in two areas -this<br />\nOmicron Kappa Omicron, a socia Committee, conducted the program. give my approval to the agreement week, while showing signs of speeded<br />\nthere are a few outstanding candiDr. Francis D. Murnaghan, profesdates for first team berths. Baetjer fraternity at the Johns Hopkins Uni<br />\nCaplan Speaks<br />\nand to say that the Administration activity in two more. With the BalSpeaking for the NEWS-LETTER will stand squarely behind the en- timore campaign already settled into sor of applied mathematics at the<br />\na star 220 runner and a sweet end, versity has been admitted into Alpha<br />\nBlucher, Brown, and McShane, upper- Chi Rho, a national society. Early in David<br />\nCaplan, managing editor forcement of any penalty which the the \"long-range\" stage and with the Johns Hopkins University, is leaving<br />\nclassmen out for the first time, and September Alpha Chi Rho at its con stressed the importance of the news Board may decide upon after due New York alumni preparing to wind next week for the Institute for AdFinch and Chester have shown plenty vention in Madison, Wisconsin, indi paper as a means of \"gaining con considerations of particular cases of up their public drive at a banquet on vanced Studies at Princeton, where<br />\ncated that the local organization tacts with outstanding men at the infractions of the agreement.\"<br />\nof \"stuff\".<br />\nOctober 16th, plans are being laid for he will remain during the academic<br />\nwould receive a charter during the Hopkins\".<br />\nVeteran Backfield<br />\nSimilar Plan<br />\nintensive fall activity in the Chicago year.<br />\nAccording to Professor Murnaghan,<br />\nBob Austrian, editor of the Huila<br />\nThe presence of the veterans Vin- Christmas holidays. At that time O.K.<br />\nThe present plan, as approved by and St. Louis areas.<br />\nthe<br />\nInstitute is the world center for<br />\ncenti, Kahl, Ward, and Captain Grazi 0. will be formally initiated into Al- baloo, invited candidates to come ou the Board, is substantially like that<br />\nIncreases in the fund total over<br />\nano gives us a splendid backfield nu pha Chi Rho and drop their present for the annual, emphasizing the pas of last year. Beginning yesterday and the summer are in large part the re- mathematical research. Each year it<br />\ncleus, if not a complete backfield it name.<br />\nexcellency of the annual. Dwelling on continuing through October 15th sult of the New York campaign under invites a number of mathematicians<br />\nSince 1919, when O.K.O. was or- the glories of his activity was Phi there will be a 'hands-off\" period, the direction of J. Albert Durgon and to attend its sessions and study prob(Continued on Page 4, Col. 1)<br />\nganized at Hopkins, it has main- Grossman, head of the debating Coun during which fraternity men will Channing E. Sweitzer, President of lems and theories of interest.<br />\ntained a chapter here. The fraternity dl.<br />\nProfessor Albert Einstein will also<br />\nbe allowed to visit Freshmen and the New York, New Jersey and ConDorothy Thompson To<br />\nhas not previously affiliated itself<br />\n\"We have our \"heroines\", pleaded Thursdays frrom 8 to 10 p. m. and necticut Alumni Association. Al- be there, as will Professor G. Wegal,<br />\nIxa,<br />\nSpeak At Supper Club with any organization.<br />\nMarty Levine, president of the Barn on Sundays from 3 to 5 p. m. Begin though their public activity will not who delivered a lecture at Johns HopJames Alexander, president of the stormers, when he was cajoling first fling Friday, October, 16th, there will<br />\ncome to a formal close until mid-Oc- kins last winter. Another attender of<br />\nOver fifty people have joined the Guilford Avenue house, said, \"We are year men to try out for one of the be a week of \"open houses\", To each tober, the directors of the New<br />\nYorrk the seminary, which is located on the<br />\nUniversity Supper Club this fall. By happy at the prospect of becoming various staffs of his activity.<br />\nUniversity campus, is<br />\nfraternity will be alloted a day on drive have already begun a canvass Princeton<br />\nthe time of the first lecture on Oe brothers of Alpha Chi Rho, as the<br />\nOther non-athletic activities includ which parties may be held, eithei of non-alumni prospects as the first Professor A. Leftschetz, who has lectober 21, at which Dorothy Thompson latter is a fraternity standing fore ing the Musical Club, the Rifle<br />\nClub within or outside its house. Other step in the launching of the private tured here before and will do so again<br />\npopular free-lance writer and wife o most incollege ranks. They have chap- the Cotillion Board, the<br />\nin December under the Dohme LecAmerican wise, through that week rushing wil campaign.<br />\nSinclair Lewis, will speak. Approxi- ters throughout the country.<br />\nStudents Union were represented b3, be restricted to the alloted \"open<br />\nThe alumni banquet will be held tureship.<br />\nmately three hundred are expected to<br />\n\"We are not going to rushh fresh- Jack Steeper, Henry Leber, and Day house\" days.<br />\nunder the sponsorship of the recentlyjoin.<br />\nmen under our future name this fall, Erck and Ken Zierler respectively<br />\nUnrestricted \"rushing\" will prevai formed Johns Hopkins New York<br />\nMEETING TODAY<br />\nEight speakers, \"leaders in th for purely ethical reasons. However who held forth briefly.<br />\non Saturday, October 16th. Until on Alumni Club, of which Mr. Sweitzer<br />\nfields of economics, literary, and re any pledged will be initiated in<br />\nDenouncing the fact that he had to o'clock Sunday morrning, fraternity is president. Plans call for the seatThere will be a meeting of the<br />\nligious thought,\" will address the December.\"<br />\nspeak after leaders in \"rocking-chai men are allowed complete freedom ing of between fifteen hundred and<br />\npaper today at 4 o'clock in the<br />\nLevering Hall group in the course of<br />\nThe admission of Omicron Kappa activities,\" Theodore Graziano, cap- From that time until 3 p. m. the two thousand guests,<br />\nNews-Letter office. Both members<br />\nthe year. Arrangements have been Omicron into national ranks leave tain of football announced that their next day, when bids are presented<br />\nSo far no report on the success of and candidates for the staff are<br />\nmade by Dr. W. L. Hammaker, execu 0. K. 0., Tau Alpha Phi as the only was no more equipment available, ex- the traditional silent period will be the private Baltimore<br />\ncampaign has asked to attend.<br />\ntive secretary of the \"Y\".<br />\nlocal remaining on the campus.<br />\ncept for heavy and fast candidates. enforced.<br />\nbeen received.<br /><br />\nHammaker Speaks Council To Support<br />\nAtOpeningAssembly Fraternity Board<br /><br />\nCampaign Fund Hits<br />\nNew High $512,000<br /><br />\n0.K.0. Taken Into<br />\nNational Fraternity<br /><br />\n2<br /><br />\nHOIVIEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br /><br />\nIjc jolint Tipphinti<br /><br />\nKetter<br />\nSubscription per year<br />\nBy Mail<br /><br />\nnot have its varsities, its June Week, seclusion and of academic unworldand its Frosh-Soph, in short, the label linass. It was partly the War and<br />\nof uniformity that connects all univer- partly the Depression which snapped<br />\nsities. They all exist on the Campus. him out of his stupor. It required the<br />\nBut they do not constitute the major useless clash of imperialistic rivalries<br />\ntradition of America's first University and the partial collapse of an economEven to Undergraduates, they rapidly ic system to shock him into a recogsink into significance before the depth nition of realities. As year follows<br />\nand magnitude of Hopkins' major year, we see the results of the awaktradition.<br />\nening: 'organization of liberal clubs,<br /><br />\n$2.00<br />\n$2.50<br /><br />\nIt is in its profound reverence for<br />\nRemit subscription fees to Treasurtruth and its ever-conscious respect<br />\ner, Student Activities Council, Remfor liberty that the real lintage and<br />\nsen Hall, Postoffice, Johns Hopkins<br />\nlegacy of the Hopkins lie. The imporUniversity.<br />\ntance of these ideas cannot be overemphasized.<br />\nEntered as second-class matter DeThe following paragraph appeared<br />\ncember 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under the Act of Con- in the NEWS-LETTER on April 1,<br />\ngress, November 3, 1879.<br />\n1936.<br />\n\"The University has never made any<br />\nPublished semi-weekly from October to June, except during examination and college holiday periods by<br />\nundergraduates of the Johns Hopkins<br />\nUniversity.<br /><br />\nEDITORIAL STAFF<br /><br />\neffort to develop the orthodox traditions. And for good reason. The Hopkins is no orthodox university. In its<br />\npolicy of minimizing the formalities<br />\nof education, of encouraging quality<br />\nrather than quantity, of emphasizing<br />\nfreedom and independence, the Hopkins has, for sixty years maintained<br />\na reputation for untrammelled scholarship, for independent and c eative<br />\nthought. Therein lies the strength of<br />\nthe Johns Hopkins University; and in<br />\nits development as the pioneer stronghold of free, independent, and, creative scholarship lies its greatest t adition.<br /><br />\nWilliam Diamond<br />\nEditor-in-Chief<br />\nStanley Finkel<br />\nAssociate Editor<br />\nJames Morrow, David Caplan<br />\nManaging Editors<br />\nBernard D. Pinck<br />\nSports Editor<br />\nMurray Kempton, Benjamin Root<br />\nAssistant Managing Editors<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Sports Editors<br />\nIt was President Gilman was first<br />\nIsadore Gertman, Wethered Barroll<br />\nNews Editors laid down the fundamental principles<br />\nof the Hopkins. It was he who said<br />\nBUSINESS STAFF<br />\nthat the University \"should be free<br />\nfrom the influences of partisanship<br />\nWilliam B. Kempton....<br />\nthat the instructions should be<br />\nBusiness Manager<br />\nthorough, as advanced and as special<br />\nMelville Locker<br />\nAssistant Business Manager as the intellectual condition of the<br />\ncount y will permit, that the glorry<br />\nWm. C. Erlanger<br />\nAdvertising Manager of the University should rest upon<br />\nGerald Willen<br />\nCirculation Manager the character of the teachers and the<br />\nHoward Linkoff<br />\nOffice Manager scholars here brought together, and<br />\nnot upon their number, nor upon the<br />\nNathaniel Soifer<br />\nCopy and Filing Manager buildings constructed for their use;<br />\nthat its sphere of influence should be<br />\nnational, while at the same time all<br />\nFriday, October 2, 1936<br />\nthe local institutions of education and<br />\nscience should be quickened by its<br />\n1936<br />\nMember<br />\npower.\"<br />\n1937<br /><br />\nAssociated G3Ileeide Press<br />\nDistributors of<br /><br />\nGrAle6iate Di6est<br /><br />\nFor Freshmen<br />\nTo students entering the Johns Hopkins for the first time it is customary<br />\nfor editors of the NEWS-LETTER to<br />\nto say a few words of welcome and of<br />\ngreeting. Suffice it to say, that the<br />\nNEWS-LETTER does extend its<br />\nheartiest greetings to new students<br />\nand usher them good fortune and success during their residence at the<br />\nUniversity.<br />\nBut there is something more to be<br />\nsaid. No first issue of the NEWSLETTER is complete without a word<br />\nabout traditions, a word addressed<br />\nparticularly to entering students. New<br />\nstudents have undoubtedly read and<br />\nperhaps wondered at too„ the page of<br />\n\"customs and traditions\" printed in<br />\nthe Handbook. Most of them are, actually, superficial and unimportant<br />\nthings. Perhaps it is surprising, but it<br />\nis nevertheless true, that the Hopkins<br />\nis almost completely free from that<br />\nvague, superficial tradition called<br />\n\"college spirit.\"<br />\nThe hollow fripperies that characterize so many American colleges today have never found a foothold at<br />\nHopkins. Not that the Hopkins does<br /><br />\nThis, for sixty years, has been •the<br />\nhistory of the Hopkins. And through<br />\nthose sixty years, following the lead<br />\nof \"The Seven\", the University has<br />\nset the pace in American graduate<br />\neducation which, as Time put it, \"created a tradition of free and fruitful<br />\npassed.\"<br /><br />\nWhither Democray<br />\nThe News-Letter is going to take<br />\nan editorial stand in the present presidential campaign!<br />\nIn a few days, this paper—for the<br />\nfirst time in its 39 years of history—<br />\nwill definitely align itself in a political campaign; it will advocate the<br />\nelection of a president editorially;<br />\nand it will continue in its presentation<br />\nof facts and principles until the day<br />\nof election.<br />\nThe times demand it! No, not the<br />\ntimes but the issues involved, which<br />\nare, after all, so closely associated<br />\nwith the times. Never before has the<br />\ncollege student been so profoundly<br />\naffected by a presidential election.<br />\nNever before have the issues involved<br />\nin a national election been so vital<br />\nto the college student as well as to the<br />\n\"man on the street.\"<br />\nUntil a few years ago the college<br />\nstudent was a members of a separate<br />\nand distinct class—set off from the<br />\nworld by all the tradition of academic<br /><br />\nNuniminimaiimanniiniiiiiimlumill1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111M111111111111111111111111111M1111<br /><br />\nof anti-war movements, of innumerable youth organization, participation<br />\nby students in every problem of national or international import. No<br />\nsingle sequence of events has exhibited the tendency better than the impressive mass anti-war demonstrations of the past four years, which last<br />\nyear called forth three quarters of a<br />\nmillion students from their classes<br />\nas a protest against war.<br />\nStudents are definitely interested in<br />\nnational affairs. They must be—because it touches them personally and<br />\nimmediately, as it touches any other<br />\nperson.<br />\nThe election of 1936, far from being<br />\njust another election, is of special,<br />\neven paramount importance. From<br />\nevery point of view, this one is a<br />\nclimatic election; from every point<br />\nof view, this election marks a crisis<br />\nin American history. Students, who in<br />\nall to short a time will inherit that<br />\nAmerica, cannot neglect to realize<br />\nthe importance of the issues at stake,<br />\nthe importance of the outcome of the<br />\nelection, the effect of that election on<br />\ntheir own future. This election represents the struggle to save America<br />\ntemporarily at least, perhaps permanently, for Democracy.<br />\nFour years ago, the News-Letter<br />\nsponsored a straw vote. Herbert Hoover won by a slight plurality. About the<br />\nthird week in October, this paper will<br />\nconduct another straw vote among<br />\nboth faculty and students. Until that<br />\ntime, the columns of the News-Letter<br />\nwill be entirely thrown open to student discussion. The paper will express itself freely. It is hoped that<br />\nthe student body will do the same.<br />\nDemocracy is based on education,<br />\nand education is based, ultimately,<br />\non free and fearless discussion.<br />\nDuring the next week, in the next<br />\ntwo issues of the News-Letter, the<br />\npolicy of the paper will be definitely<br />\noutlined; selection and rejections for<br />\nthe presidency will be made; the issues of the election will be clarified;<br />\nand the question of the future of<br />\nDemocracy will be placed squarely before the students.<br />\nThe News-Letter believes in a democracy, both political and economic.<br />\nThe News-Letter believes that, in the<br />\ncourse of events, the future of this<br />\ndemocracy has been gravely imperiled. The News-Letter is convinced<br />\nthat the question of Democracy's future is the primary issue of the<br />\n1336 election. And, because the NewsLetter considers that issue of paramount importance, it will attempt to<br />\ntake a rational but unequivocal position in the election campaign—a position based upon unbiased, unprejudiced facts.<br /><br />\n-:-<br /><br />\nBOOK<br /><br />\nFalsehood In War-Time. By<br />\nArthur Ponsonby, M.P. New<br />\nYork: E. P. Dutton &amp; Co. 292<br />\npp. Special $1.00 edition.<br />\n\"When war is declared, truth is the<br />\nfirst casualty,\" goes the classic adage.<br />\nFalsehood in War-Time is a more than<br />\ncommendable discussion and exposition of the numerous lies, frauds and<br />\ndeceptions to which the war-generation was submitted in a monstrous attempt to arouse its passion and indignation.<br />\nThe reprinting of this volume comes<br />\nat a most fortuitous moment. Today<br />\nthe tenseness and double-dealings of<br />\ninternational rivalry have resulted in<br />\nthe exaltation of patriotism over<br />\ntruth as the essential element and<br />\nvirtue of statesmanship. The chances<br />\nare very great that the world will<br />\nshortly find itself in the chaos of<br />\nanother great War. When that war<br />\ncomes, one of its chief weapons will<br />\nbe falsehood, and lying. The casual,<br />\neveryday lie is often condoned, or at<br />\nleast ignored. But the wholesale deception of an entire nation by official<br />\nconnivance cannot be easily neglected.<br />\nLord Ponsonby has collected in his<br />\nsmall volume a group of the more<br />\ncommon, more insidious lies circulated in England, France, Germany,<br />\nItaly, and America during the War.<br />\nA long career in parliament and the<br />\ndiplomatic service has given him<br />\nboth the means and the ability to<br />\ntrace these lies to their sources.<br />\nThe denial of England's commitments to France, the invasion of<br />\nBelgium as the causus belli, the war<br />\nguilt of Germany, the passage of<br />\nRussian troops through England, the<br />\nstories of the mutilated nurse, the<br />\nhandless baby, the crucified Canadian,<br />\nand the German corpse factory are<br />\nobjectively, calmly, but relentlessly<br />\ntraced by Lord Ponsonby to their<br />\norigins and exposed as deliberate subterfuge and trickery on the part of<br />\nsupposedly responsible governments.<br />\n\"There is not a living soul in any<br />\ncountry who does not deeply resent having his passions roused,<br />\nhis indignation flamed, his pariotism exploited, and his highest<br />\nideals desecrated by concealment,<br />\nsubterfuge, fraud, trickery, and<br />\ndeliberate lying on the part of<br />\nthose in whom he is taught to<br />\nrepose confidence and to whom<br />\nhe Is enjoined to pay respect.<br />\n'None of the heroes prepared for<br />\nsuffering and sacrifice, none of<br />\nthe common herd ready for service and obedience, will be inclined<br />\nto listen to the call of their country once they discover the polluted sources from whence that<br />\ncall proceeds and recognize the<br />\nmonstrous finger of falsehood<br />\nwhich beckons them to the battlefield.\"<br />\nEducation of this type at this time<br />\nwill put a previously unsuspecting<br />\npeople on its guard when the debacle<br />\ncomes, will render it much less cred-<br /><br />\nREVIEWS<br /><br />\n-:-<br /><br />\nulous of statements, rumours, and lies like a man unveiling a statue of himissued specifically for its consumption self. He was heart<br />\nand soul a soldier;<br />\nby official propagandists.<br />\nhis memoirs are brief to the point of<br />\nRochambeau, Father and Son,<br />\nBy Jean-Edmond Weelen.<br />\nTranslated by Lawrence Lee.<br />\nWith a preface by Gilbert<br />\nChinard. New York: Henry<br />\nHolt &amp; Co. 285 pp. $3.00.<br />\nHistory, or human whimsy if you<br />\nwill, often plays queer tricks on men.<br />\nStrange and persistent delusions have<br />\nagain and again grown up about some<br />\nparticular event or person and hahg<br />\non with startling tenacity. Certainly<br />\nnot the least of these are the widelypopular myth of the military genius<br />\nof George Washington (well-known as<br />\nthe \"father of his country\") and the<br />\nbelief in Lafayette as the guiding star<br />\nand ingenious strategist of the French<br />\nforces in America, during the War for<br />\nIndependence.<br />\nSome mocking irony has seen fit<br />\nto place Rochambeau in the shadows.<br />\nThat he was the actual saviour of<br />\nAmerica in 1783, that he was the<br />\nmost capable general France had produced in decades, that he far outclassed Washington in military strategy, that he was both theoretically<br />\nand actually the victor of Cornwallis<br />\nare easily forgotten under the influence of the blinding halo which surrounds the :more enthusiastic and<br />\nflaming glamour and dash of the<br />\nyoung Lafayette.<br />\nMr. Weelen, one of the younger and<br />\nlesser-known French historians, has<br />\nperformed no mean task in his attempt to adjust the balance of historical justice. The result of several<br />\nyeads of concentrated study of authentic public and private archives is<br />\nthis volume, in which Rochambeau<br />\n\"has ceased to be a mere name.\"<br />\nUndoubtedly Rochambeau himself<br />\nwas highly responsible for the neglect<br />\nposterity.<br />\nof<br />\nforgetfulness<br />\nand<br />\nThroughout life, he was unusually<br />\nquiet and reserved, the personification of modesty itself. By nature he<br />\nwas exactly the antithesis of Lafayette who perpetually spoke and acted<br /><br />\nmilitary crispness and suppress every<br />\nexpression of personality, opinion, or<br />\nemotion.<br />\nPerhaps the best summation of<br />\nRochambeau's character appears in<br />\nthe introduction written by Professor<br />\nChinard, formerly of the Johns Hopkins University, who is one of the<br />\nworld's greatest students of FrancoAmerican relations:<br />\n\"In the book of Mr. Welen, he<br />\nlives again, and the old aristocrat, the descendant of a long<br />\nline of warriors, appears unexpectedly more of a true republican in spirit and in conduct<br />\nthan Lafayette himself. He was<br />\nevery inch a soldier and had no<br />\nambition except to serve his<br />\ncountry; he was not only a nobleman but a gentleman and, in the<br />\nfullest sense of the word, an honest man.\"<br />\nRochambeau did serve his country:<br />\nhe served Louis XVI, he served America, and he served in the Revolution.<br />\nAlmost half of Mr. Weelen's volume<br />\nis consumed by the hitherto unpublished \"Journal of the Vicomte de<br />\nRochambeau,\" son of the Marshal of<br />\nwhom the Duc d'Engien said: \"Thanks<br />\nto you America is free.\" There is<br />\nnothing to recommend the journal<br />\nexcept perhaps the detail with which<br />\nan observant and astute soldier records his observations in America.<br /><br />\nBOULEVARD<br />\nHardware Co.<br />\n432 E. 42ND STREET<br />\nUNiversity 0749<br />\nHouse Furnishings<br />\nHardware<br />\nPaints<br />\nElectrical Supplies<br /><br />\n11<br />\n1<br /><br />\n;c<br />\nt go<br />\nf, YOUR LOOSE CHANCE<br />\nvt•<br /><br />\n•.1<br /><br />\n},<br /><br />\n,r<br />\n-<br /><br />\nWArs.<br /><br />\nIron out<br />\nyour laundry<br />\nworries<br />\nSP//FTLY — SAFELY — EC<br /><br />\nBv the Railway.Extvmss<br />\nffi<br /><br />\n\"Hang it all, Pater, they can't be that good at IN.\"<br />\n\"Wilcox, my son Twenty Grand would be good at 2001\"<br /><br />\n1<br /><br />\nimmommismommumunommiummummummuumommummummunumit<br />\nCopr. 1936 The Axton•Fishrr Tobacco Co., 1 o.<br />\nWE CERTIFY that we have inspected the Turkish and Domestic Tobaccos<br />\nblended in TWENTY GRAND cigarettes<br />\nand find them as fine in smoking quality as those used in cigarettes costing<br />\nas much as 50% more.<br />\n(signed) Seil, Putt &amp; Rushy Inc.<br />\nan collaboration with tobacco expert)<br /><br />\nLet that dependable college pal, Railway Express,<br />\npick up and ship your laundry home and back for<br />\nyou every week. You will find it glossy going —<br />\neasy, fast, inexpensive.<br />\nMerely notify the folks you will send the package by Railway Express, and ask them to return it<br />\nthe same way. You can send it collect too, you<br />\nknow, and while on that subject, we can add, only<br />\nby Railway Express. The folks will understand. It<br />\nsaves keeping accounts, paying bills, to say nothing of spare change.<br />\nYou'll find the idea economical all round. The<br />\nminimum rate is low — only 38 cents — sometimes<br />\nless. Pick-up and delivery by motor vehicle and<br />\ninsurance included in the shipping charge. It's the<br />\nsame with shipping baggage or anything else by<br />\nRailway Express. So arrange your shipping dates<br />\nby phone call to the Railway Express agent, and<br />\nstart now.<br />\nCHARLES and FAYETTE STS.<br />\nVernon 0600<br />\nDepot Office: 203 E. Franklin Street<br />\nVernon 0600<br />\nBaltimore, Md.<br /><br />\nRAILWAY<br /><br />\nEN the class of 1917 was at college, a long<br />\nTHEN<br />\ntelephone call took (on the average)<br />\nmore than ten minutes to be put through.<br />\nThis time has been whittled down gradually, so<br />\nthat now the connection is made in an average of<br />\n1.4 minutes—nine out of ten of them while you<br />\nhold the line.<br />\nBut this is only one phase of the relentless effort<br />\nto improve. Your service is better today because<br />\nvoice transmission is clearer interruptions and<br />\nerrors less frequent than<br />\never before.<br />\nCollege men and women<br />\nAmerica demands fast but<br />\nfind after 7 P. M.<br />\ntime for<br />\nservice—and<br />\nconvenient<br />\na<br />\nsure telephone<br />\nlong distance calling.<br />\ngets it.<br />\nMoreover, most rates are<br />\nlowest then.<br /><br />\nEXPRESS<br /><br />\nAGENCY, INC.<br /><br />\nNATION-WIDE RAIL-AIR SERVICE<br /><br />\nBELL TELEPHONE SYSTE1‘1<br /><br />\n3<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br /><br />\nHopkinsMenAttend<br />\nAdditional Tryouts J.11.11. Adventurers Discover<br />\nJamaican Wilds Unromantic Affair At Harvard<br />\nFor Musical Club<br />\nSet For Tuesday Dr. Gardner And Company Fail To FindBrown-Skinned Drs. Havens, Mast, And 4<br />\nAspirants For Membership<br />\nAsked To Report At Levering Hall, 7.30 O'Clock<br />\nMore Than 50 Students Seek<br />\nPlaces In Group Last Night<br />\nAt Initial Tryouts<br />\n-- Additional tryouts for the Johns<br />\nHopkins Musical Club, oldest and largest campus activity, will be held this<br />\nTuesday at 7.30 P.M. in Levering Hall.<br />\nThe first meeting, held last night<br />\nwas attended by about 50 aspirants<br />\nfor the Glee Club, Blue Jay Orchestra, Banjo Club, and Hawaiian Troupe.<br />\nThere are still places in all these<br />\nbranches as well as in the business<br />\nstaff for newcomers.<br />\nA tentative program of concerts for<br />\nthis season indicates that last year's<br />\nschedule will be repeated until the<br />\nadditions of some other out-of-town<br />\npresentations. In the 1935-36 season,<br />\nconcerts are given at: Maryland College, in Lutherville; Clifton Avenue<br />\nM.E. Church; Annapolis High School;<br />\nPrince of Peace Church; The Chalfonte-Haddon Hall, an Atlantic City;<br />\nWalbrook M.E. Church; Babcock<br />\nMemorial Church; Marjorit Webster;<br />\nSt. Matthews Church; Wilson College;<br />\nRadio Station WCAO; St. Marks'<br />\nChurch; and the West Baltimore M.E.<br />\nChurch.<br />\nSteinwald Coaches Glee Club<br />\nTryouts for the Glee Club will be<br />\nunder the direction of Mr. Osmar P.<br />\niSteinwald, '28, the coach. Mr. Conrad<br />\nGebelein will again take over his<br />\nduties as director of the Banjo Club<br />\nand Hawaiian Troupe. Mr. Gebelein<br />\nwas leader of the world champion<br />\nHawaiian Troupe at the past Chicago<br />\nWorld's Fair. John Soule, '37, is in<br />\ncharge of the Blue Jay Orchestra.<br />\nJohn Steeper, '37, is president of the<br />\nclub, and J. Judge Mehling, '38, business manager.<br />\nLast year the roster of the Musical<br />\nClub contained over a hundred names.<br />\nThe seed of this organization was<br />\nplanted fifty years ago by a group of<br />\nstudents who later attained fame<br />\nIn other fields. Among those instrumental in the founding were the late<br />\nPresident Woodrow Wilson, then a<br />\ngraduate student in Political Science;<br />\nNewton D. Baker, President Wilson's<br />\nSecretary of War; Charles D. Levermore, winner of the Bok Peace<br />\nAward; Arthur Yager, former Governor of Porto Rico; and Albert Shaw,<br />\neditor of the Review of Reviews.<br /><br />\nAero Club Expects<br />\nSuccessful Year<br />\nSeeking new members to swell its<br />\nroster, the Johns Hopkins Aero Club<br />\nexpects to have a successful year. G.<br />\nGrahme Duce, president, announced<br />\nthat a meeting would be held early<br />\nnext week in Levering Hall.<br />\nThe large collection of model planes<br />\nwhich the club boasts will be used<br />\nas a basis for study and experiment.<br />\nLater in the Fall members plan a visit<br />\nto a government airport.<br /><br />\nDr. Havens To Take<br />\nLeave At Semester End<br />\nDr. Raymond T. Havens, Caroline<br />\nDonovan Professor of English literature, will be on leave of absence after<br />\nFebruary 1, to complete his work on<br />\nWordsworth's Prelude. Dr. William<br />\nParkes, instructor in English at Ohio<br />\nState University, will conduct classes<br />\nduring his absence.<br />\nDr. Havens, in addition to his graduate work, is at present conducting<br />\nin undergraduate course in the Romantic Poets. He is also scheduled<br />\nfor several lectures in the Survey of<br />\nEnglish Literature Course.<br /><br />\nBeauties; Learn Instead That Being Marooned Is Pretty<br />\nTiresome Affair, Especially When It Rains<br />\nFor students in the morass of 8.30 our work from there. It is very fine<br />\nEconomics classes, dreams of being country. We had a banana plantation<br />\nmarooned on a tropic isle surrounded on one side of us, and a coffee plantby a bevy of brown-skined beauties ation on the other.\"<br />\nExpedition Made<br />\nafford the only hope of a better life<br />\n\"A four-day expedition to the highto come. But to the members of the<br />\nHopkins expedition into the wilds of est mountain on the island about 7500<br />\nJamaica this past summer, being ma- feet in elevation, produced some inrooned was a pretty tiresome affair. teresting discoveries,\" continued Dr.<br />\nDr. W. Gardner Lynn, Zoology In- Lynn. \"Although we lost a great deal<br />\nstructor; Mrs. Lynn, also a Zoologist; of time through bad, rainy weather,<br />\nDr. John Buck, and C. B. David Heiser, we explored country we believe has<br />\na graduate student at the University never been seen before.\"<br />\nDr. Lynn expressed confidence that<br />\nmade up the membership of this particular expedition, and according to the next expedition into this little exDr. Lynn, they were pretty glad to get plored region would uncover many<br />\nit over with—that is, being marooned. new discoveries.<br />\n\"At five thousand feet we came<br />\nPlenty Of Rain<br />\n\"We were going along a road in across an animal, changed very little<br />\nJamaica during an incessant rain- since ancient times, known as the<br />\nstorm\" said Dr. Lynn,\"when suddenly Peripatus,\" said Dr. Lynn. \"It has<br />\nthere wasn't anymore road—just both the characteristics of an arthrolarge boulders in its place. That was pod and a worm, but it is usually<br />\ntwenty miles from the nearest town. placed in a class by itself. Previous<br />\nWe had to wait a week before we to our discovery the animal has never<br />\ncould get through and the rain held up been known to exist above 1000 feet.\"<br />\nStrange Species Of Frog<br />\nour investigations.\"<br />\n\"Among the other things that we<br />\nDr. Lynn outlined the work of the<br />\nmembers of the expedition as follows: saw was a species of tree frog, which<br />\nDr. Buck: Studied several new instead of laying eggs in ponds, laid<br />\nspecies of firefly, noting the fre- them in the bases of plants, filled with<br />\nquency of flashes of light and photo- water. At 3500 feet elevation there<br />\nwere large land crabs measuring seven<br />\ngraphing their spectra.<br />\nMr. Davidheiser: Specialized in the to eight inches across. We also studlife histories of moths and butterflies. ied marine forms on the sea-coast<br />\n\"The object of my work on the ex- during our automobile trip around the<br />\npedition was to collect frog embryos island.<br />\n\"Altogether, my wife and I colfor thyroid study,\" said Dr. Lynn.<br />\nThere is a species of frog in Jamaica lected 900 specimens of adult frogs,<br />\nwhich have no tadpole stage. Instead Including several species never before<br />\nits eggs are laid in rocks high up in known;; and a countless number of<br />\nfrog eggs, from which we studied the<br />\nthe mountains of the island.<br />\ndevelopment of the frog embryo,\" confeet<br />\n3500<br />\nabout<br />\n\"We made our base<br />\nup in the mountains and carried on cluded Dr. Lynn.<br /><br />\nLeave Of Absence Social Sciences Are<br />\nGranted To Dr.Reid Affected By Change<br />\nrms.(<br />\nProfessor Of Chemistry For New Reading List Revised<br />\nTo Cover A More<br />\nTwenty Years To<br />\nExtensive Field<br />\nRetire In '37<br /><br />\nPLEASE PATRONIZE<br />\nOUR ADVERTISERS<br /><br />\nWeed Visit Tercentenary<br />\nCelebration<br />\nAs the 332nd oldest college in the<br />\nworld, the Johns Hopkins University<br />\nwas represented at the Tercentenary<br />\nCelebration of Harvard University recently by Dr. Raymond D. Havens,<br />\nprofessor of English Literature; Dr.<br />\nS. 0. Mast, professor of Zoology; and<br />\nDr. Louis H. Weed, former dean of the<br />\nHopkins Medical School. Dr. Isaiah<br />\nBowman, president of the Hopkins,<br />\nwas taken ill and was unable to<br />\nattend.<br />\nThe delegates from the various universities throughout the world were<br />\ncalled to the platform, at the opening<br />\nof the assembly, in the order of their<br />\nseniority. Representatives of the University of Cairo were first to receive<br />\nan ovation from the assemblage of<br />\nover 15,000 persons. Delegates from<br />\nHopkins were 332nd to gain this<br />\nhonor.<br />\nFine Affair<br />\n\"We were royally entertained,\" said<br />\nDr. Mast. \"It was a very elaborate<br />\naffair. Everything possible was done<br />\nfor the convenience and pleasure of<br />\nthe delegates.\"<br />\nBesides attending conferring of degrees, and addresses by world reknowned educational figures and illustrious alumni, including the President of the United States, all the<br />\ndelegates were invited to several of<br />\nthe concerts given by the Boston<br />\nSymphony Orchestra. During their<br /><br />\nGet a fresh start<br />\nwith ARROW!<br />\nStock up now with Arrow Shirts—they'll<br />\nkeep you in style for years—and give<br />\nyou more collar and shirt satisfaction<br />\nthan you've ever known before.<br />\nTry HUNT or CARLTON, with the<br />\npopular wide-spread collar models.<br />\nMitoga fit. ... Sanforized Shrunk.<br />\nIn white or fancy — $2.00 — $2.50<br /><br />\nstay, the Hopkins representatives resided at the homes of members of<br />\nthe faculty of Harvard and their<br />\nfriends.<br />\nFRANCK RECEIVES GRANT<br />\nProfessor James Franck, of the<br />\nPhysics Department has received a<br />\ngrant of $10,000 from the Rockefeller<br />\nFoundation for researches in photosynthesis and the photo-oxidation pro-<br /><br />\nWhen college men think of shirts, they immediately think<br />\nArrow. Drop in and see our latest collegiate styles.<br /><br />\nMC PHERSON'S<br />\n11 East Baltimore Street<br /><br />\ncess.<br />\nDr. E. Emmett Reid, professor of<br />\nOrganic Chemistry, has been granted<br />\na one yearr's leave of absence, and is<br />\nto retire at the end of that period.<br />\nHe will be sixty-five years old next<br />\nspring.<br />\nDr. Reifi was appointed Associate<br />\nProfessor in Chemistry at the Hopkins in 1914 and Professor in 1916.<br />\nDuring the war he served as a consultant in gas warfare with title<br />\nChemical Warfare Service and was<br />\nsuccessful in working out the method<br />\nwhich is used for making tear gas at<br />\nthe present time. His scientific activities have covered a wide range in<br />\nthe filed of organic chemistry. His<br />\nstudies on hydrolysis and esterification culminated in an invitation to<br />\ncontribute a chapter on these subjects<br />\nto the most recent monograph on laboratory methods. His exhaustive and<br />\nlong-continued studies upon organic<br />\nsulfur compounds led to his selection<br />\nby the American Chemical Society as<br />\nthe author of the monograph on aliphatic sulfur compounds which is in<br />\nprocess of preparation at the present<br />\ntime. His fundamental studies on the<br />\noxidation of organic compounds have<br />\nbeen followed with keen interest by<br />\nlaboratories all over the country. Dr.<br />\nReid has also been noted for his<br />\nstudies in physical properties of series<br />\nof organic componuds. His laboratory<br />\nhas been most productive in matters<br />\nof manipulation and technique in organic work,.and the number of new<br />\nsubstances which have come out of it<br />\nmay possibly exceed that of any other<br />\nlaboratory.<br />\nLast year Dr. Reid gave two courses<br />\nin Organic Chemistry in the Graduate<br />\nDepartment.<br /><br />\nEVEN A BUSY COLLEGE MAN<br />\nNEEDS TO GO SHOPPING<br />\nONCE IN A WHILE<br />\nSo we'd like to file for future reference that our whole store<br />\nis at your service—though we call your attention especially to<br />\nour Men's Shop on the first floor, and our Young Men's Shop<br />\non the third. Perhaps you won't even have to come in; try<br />\nwriting or phoning us!<br /><br />\nHUTZLER BRITIEM<br /><br />\nDr. George H. Evans, who succeeds<br />\nDr. W. Stull Holt this year as head<br />\nof the Social Science Group, announced a change in the reading list for<br />\nstudent majoring in the Social Sciences.<br />\nLast yar's list included three separate groupings incorporating books<br />\nfor general reading; classics of social<br />\nscience and histories used as introductory surveys of logic, government<br />\nand politics.<br />\nCovers More Ground<br />\nThe revised list, however, follows<br />\na more definite purpose in that it attempts to link Social Science with<br />\nliterature, law and geography. Also<br />\nbooks are suggested to acquaint the<br />\nstudent with courses not offered at<br />\nanthropology.<br /><br />\nHopkins—particularly<br /><br />\nThis enables the student to gain more<br />\nknowledge with less effort on his<br />\npart. A larger list of classics is included which the student is expected<br />\nto merely dip into in order to obtain<br />\na foundation and knowledge of the<br />\nsubject-matter. Also provision is made<br />\nfor those who wish to obtain enlightenment of any course by outside reading under an instructor rather than<br />\ntake the course.<br /><br />\nGET YOUR<br />\nCOLLEGE RING<br />\nBearing<br />\nOfficial Seal<br /><br />\nWith the Pen That<br />\nStudents<br />\nRate Highest<br />\nBY ACTUAL VOTE<br /><br />\nInvented by n College<br />\nProfessor to Bring You<br />\nHigher Grades<br />\nA college professor noticed that<br />\npoor grades are often due not to<br />\nbrains running low but to pens running dry!<br />\nSo he worked out an utterly different and basically better pen principle<br />\n—and Geo. S. Parker engineered it<br />\nto perfection.<br />\nThuscame the revolutionary Parker<br />\nsacless Vacumatic that has superseded every old-style pen—both sactype and sacless.<br />\nRecently the student editors of 30<br />\ncollege papers asked 4,699 of their<br />\nreaders, \"Which make of pen do you<br />\nown? Which pen do you prefer?\"<br />\nTo both questions more students<br />\nanswered \"Parker,\" than any other<br />\ntwo makes of pens COMBINED!<br />\nOne reason is that the Vacumatic<br />\nink supply is EVER-VISIBLE, the<br />\nENTIRE length of the barrel. It<br />\nisn't merely last-drop visibility—<br />\ndoesn't merely show when your pen<br />\nis empty.It shows days ahead WHEN<br />\nIT'S RUNNING LOW, so it can't<br />\nrun dry against your will.<br /><br />\nonly<br /><br />\nThe Vacumatic9s working parts<br />\nare sealed in the top WHERE INK<br />\nCAN NEVER TOUCH THEM—<br />\ncan never decompose them. That's<br />\nwhy this miracle pen is GUARANTEED mechanically perfect.<br /><br />\n25c<br /><br />\nAnd the Parker Vacumatic has no<br />\nrubber ink sac or lever filler—hence<br /><br />\nCertified<br />\n$2.00 Value<br /><br />\nwith the<br />\npurchase ofa<br />\nbottle of<br /><br />\nQtafil<br />\nVaricer<br />\nt 15c—Tof al 40c ... YOU SAVE $1.75<br />\nThis amazing oiler is made solely to introduce Parker Quink - the miracle ink that cleans<br />\nyour pen as it writes, and dries ON PAPER<br />\n:f<br />\nfaster than pen-clogging inks.<br />\nGet ()tank today from any st,re selling nk.<br />\nTear off the box-top and on the back write the<br />\nFULL NAME of your school or college. ring<br />\nSIZE, and style wanted (man's or<br />\nwoman's), and your name and address. Mail box-top with 25 cents in<br />\ncoin to The Parker Pen Co.,Dept.737,<br />\nJanesville, Wis. Don't delay.This offer<br />\nends Dec. 31. 1936, if supply lasts.<br /><br />\nParLer<br /><br />\nMRao-VACUMATIC-ER<br />\nGUARANTEED MECHANICALLY PERFECT<br /><br />\n$75-9 Pencils, $2.50,<br />\nJunior, $5;<br />\n$3.50 and $5<br />\nOver-Size, $10<br /><br />\nhas room for 102% more ink without<br />\nincrease in size!<br />\nIts luminous,laminated Pearl style<br />\nhas won every pen Beauty Contest<br />\nby 2 to 1. Go and see it today at any<br />\ngood store selling pens. The Parker<br />\nPen Co., Janesville, Wis.<br /><br />\nTo Make Any Pen Clean Itself<br />\nTry this utterly different writing ink—<br />\nParker Quink — an ink that<br />\ndissolves deposits left in pens<br />\nby ordinary inks. Quink<br />\ncleanses a pen as it writes—a<br />\nParker or any other pen. Ends<br />\npen-clogging.Get Quink at any<br />\nstore selling ink, 15c and 25c.<br /><br />\nYour Nearest Dealer is<br />\nA Full<br />\nSupply<br />\nOf<br />\nQuinto<br /><br />\nKIBLER'S<br />\nJEWELERS and OPTICIANS<br />\n3222 GREENMOUNT AVENUE<br /><br />\nGet Your<br />\nJ. H. U.<br />\nRing Here<br /><br />\n4<br /><br />\nCross Country<br />\nSquad Prepares<br />\nFor '35 Season<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 2, 1936<br /><br />\nIntercollegiate<br />\nPolicy<br /><br />\nOct. 3 — Open<br />\n, Away<br />\nThe intercollegiate athletics proOct. 10 — Lehigh<br />\nHome<br />\ngram of 1936-1937 will follow along<br />\nOct. 16 -- Washington<br />\nHome<br />\nthe lines pursued by the department<br />\nof athletics during the past two years.<br />\nOct. 24 --Haverford<br />\nHome<br />\nOnce again there will be thirteen acOct. 31 --- Randolph Macon Home<br />\nHarrier Squad Bolstered By tivities in which Hopkins teams will Nov. 7 -Swarthmore<br />\ncompete with other colleges and uniAway<br />\nReturn Of Many Experi- versities.<br />\nNov. 14 — American<br />\nAway<br />\nIn accordance with the standards<br />\nenced Veterans<br />\nNov. 21<br />\nOpen<br />\nof the University, athletics at the<br />\nHopkins will be conducted on a pureNov. 28 -- St. Johns<br />\nHome<br />\nly amateur basis. As in former years,<br />\nthere will be no subsidization of playPromising Freshman Appear ers nor the awarding of scholarships Physical Exams Set<br />\nbased on athletic prowress. The deFor This Month<br />\nIn Ranks Of New<br />\npartment is essentially interested in<br />\nthe organization of teams which will<br />\nCard Dates<br />\nThe Department of Physical Edube of value to and provide pleasure cation and Athletics wishes<br />\nto call to<br />\nThe Johns Hopkins cross-country for the members of the student body. the attention of undergraduates the<br />\nDr. Shaffer, associate director, em- fact that they are<br />\nrequired to have a<br />\nteam inaugurated its 1936 season this<br />\nphasized that this does not mean physical examination in<br />\nOctober of<br />\nweek with a series of limbering-up that athletic victories<br />\nwill not be their first and second years of resiexercises preparatory to taking to the desired, since victories do form the<br />\ndence. All students who have not<br />\nHomewood long distance course. The basis upon which a season's success is made appointments for<br />\nexaminations<br />\nsquad is moderate in size at this early measured. However, defeat will not are requested to apply for appointbe accepted so ungraciously as to je- ments at Room 407,<br />\nGilman Hall,<br />\ndate with more candidates expected<br />\nopardize a coach's position. The policy at once.<br />\nwhen the academic work swings will once again be<br />\nthat of athletics<br />\nEvery undergraduate is required to<br />\nalong more regularly.<br />\nfor the sake of sport alone.<br />\nhave one year of physical education<br />\nThe coaches have expressed satis- (two hours,<br />\nOf the squad which hill-and-daled<br />\none each week), unless<br />\nfaction<br />\nwith the great number of sufficient credits<br />\nhave<br />\nreveterans<br />\nlast year, many<br />\nare presented from<br />\ncandidates who have turned out for another institution<br />\nto absolve the returned to form the nucleus of the<br />\nthe various fall activities.<br />\nquirement (in the cases of transfer<br />\npresent track group. Captain Carl<br />\nAttractive schedules have ben ar- students).<br />\nSholtes is filling the position occu- ranged in these sports and the interest<br />\npied by Leonard Emmert in 1935, and enthusiasm ilicited by the candiwith Castelle, G. Brown, Lyman, dates presages success for the fall<br />\nprogram.<br />\nSchultz, Whrminski, Mace, Briscoe,<br />\nDr. Shaffer made it clear that there<br />\nand Boland contending for the places<br />\nis to be no sharp and distinct line of<br />\nleft by G. Brown and Moxley. Milton demarkation between the intercollegiSaul has stepped into the managerial ate sports and the intramural acshoes vacated by Hartman. Of the in- tivities. One program will not be made<br />\ncoming Freshmen, Scharpf and Lamb to conflict with the otherr, nor will<br />\nhave seen action with the long dis- one be considerably more emphasized<br />\ntance men of Poly, while Norton trod .han the other. Last year more than<br />\nthe cinders for the East Aurora H. S. 80 per cent of the students pursued<br />\nin New York.<br />\nsome athletic endeavor. It is hoped<br />\nHambleton At Reins<br />\nthat this lofty proportion will even<br />\nWaldo Hambleton, who also tutors be exceeded during the ensuing year.<br />\nthe swimmers and tracksters, again<br />\ntakes up the reins as mentor of the FOOTBALL MANAGERS OUT<br />\nmarathoners. He stated that the prosBrian Murphy, manager of the footpects for the coming season were ball team, has requested and urged<br />\nstill indefinite, but he expects the that all those freshmen interested in<br />\noutfit to be in fine fettle for the becoming football managers should<br />\nopening meet with Lehigh, the first appear at the field immediately. For<br />\nof seven contests for the Blue Jays. an enterprising student there is alMr. Hambleton advised any interested most a clear path to the position of<br />\nIn the sport to report, as a Junior senior manager. Football practices are<br />\nVarsity schedule has been arranged held at 4 each afternoon and all<br />\nfor those who do not make the first freshmen anxious to gain the berth<br />\nsquad. In particular are Freshmen should report at once.<br />\nurged to attend practices. The coach<br />\nwent further to declare that all out<br />\nfor the team would get into active<br />\ncompetition, and that this training<br />\nwould be essential for those who are<br />\ninterested in spring track, lacrosse,<br />\nbaseball, and the winter sports.<br />\nThe Schedule<br />\nOct. 24--Lehigh—Home<br />\nOct. 31—Swarthmore--Away<br />\nNov. 6—Drexel—Away<br />\nNov. 14—Franklin and Marshall<br />\nAway<br />\nNov. 21—Open<br />\nNov. 26—Capital C. C. —Away<br />\nDec. 12— S.A.A.A.U.<br /><br />\nSholtes Is Captain<br /><br />\nThe immense success of last year's<br />\nintramural<br /><br />\nsports<br /><br />\nprogram<br /><br />\nbanner season for the Jays. Great<br />\nthings are expected of Hartke and<br />\nPhillips on the offense. Captain Pete<br />\nBernheim, who also predicts a fine<br />\ncampaign, will no doubt be a bulwark on the Jay defense. Tommy<br />\nThe 1936 edition of soccer candi- Dukehart,<br />\na newcomer, is also expectdates put in its appearance for the<br />\ned to be one of the shining lights of<br />\ncurrent season on September 29.<br />\nthe squad.1<br />\nHaving waged a very successful campaign last year, the booters have atEarn expenses with novelties.<br />\ntained greater significance on the<br />\nDisplays sell for you. Samples<br />\nathletic program than ever before.<br />\nand training furnished.<br />\nWith last. year's entire squad, with<br />\nthe exception of McClean and Randall,<br />\nARTCRAFT<br />\n313 ALLEN<br />\nback for duty, Coach Dotterweich is<br />\nGrand Rapids, Michigan<br />\nvery optimistic and predicts another<br /><br />\nRooters Practice<br />\nForOpeningGame<br /><br />\nIntramural<br />\nPolicy<br /><br />\nFootball Schedule<br /><br />\nwhich<br /><br />\ndrew forth complimentary editorial<br />\ncomment from the local papers has<br />\nensured the continuance of this mode<br />\nof campus activity. For another season Reuben Baer will remain in the<br />\ncapacity of main organizer and director of the various integral parts of<br />\nthe intramural scheme. However, this<br />\nyear the entire staff of varsity coaches and assistants will be engaged for<br />\na good part of the time in the direction and supervision of intramural endeavors.<br />\nAgain the fundamental purpose of<br />\nthe sports plan is to promote participation of every enrolled undergraduate in some form of athletic activity.<br />\nThe list of sports arranged for this<br />\nyear includes in its fold football, basketball, softball, handball, badminton,<br />\nand tennis.<br /><br />\nN the making of fine<br /><br />\nI<br /><br />\nbeer there is no substitute for time . ..<br />\nand here at National<br /><br />\n... we take our time.<br />\n, BRANDAN'S<br />\nMen and Young Men's<br />\nFurnishings and Clothing<br />\n3206 GREENMOUNT AVE.<br />\nUNiversity 3064<br /><br />\nBRIGHT COLLEGE<br /><br />\nYEARS GET OFF TO<br />\nA GOOD STARTAT<br /><br />\n11110CIISCHILD,KOHN 411 Co.<br /><br />\n\"NATIONAL<br />\nThe National Brewing Co.<br />\nBALTIMORE, MD,<br /><br />\nEat At The<br /><br />\nPeabody<br />\nPharmacy<br /><br />\nBOULEVARD<br />\nRestaurant<br /><br />\nWe Sell Drugs and Give Service<br />\nCALVERT and 30TH STREETS<br /><br />\n3226 GREENMOUNT AVE.<br /><br />\nNORTH<br /><br />\nINN<br /><br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF<br />\nCOLLEGE FRIENDS<br />\nOur Prices are Lower Than Ever<br /><br />\nBirely's Pharmacy<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School Supplies<br />\nSandwiches<br />\nUnexcelled Fountain Service<br /><br />\nJ. H. FURST CO.<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nGridmen Prepare<br />\nFor First Contest<br />\nMallonee Men In Form After<br />\nDebut After Three<br />\nWeek's Work<br />\n(Continued from Pagel, Col. 1)<br />\nitself. Vincenti has proven himself a<br />\ngood blocker and a valuable defense<br />\nman. Kahl and Ward kick well, and<br />\nKahl, moreover, has been running in<br />\na very commendable fashion. And of<br />\ncourse \"Graz\" holds down the fullback<br />\njob as usual.<br />\nGreen, a freshman of punting and<br />\nrunning value, stands out among the<br />\nnewcomers aspiring for backfield positions. Once again we have Demi<br />\nTraggis, our mighty mite, making<br />\nsome of the bigger boys look like<br />\nmonkeys.<br />\nStress Running Attack<br />\nThe coaching staff has been stressing a hard running offense; plenty of<br />\nend runs, reverses, spinners, and fast<br />\nline bucks will feature this year's attack. As yet nothing substantial in<br />\nthe way of a passing combination ha.s<br />\nbeen developed, but the mentors<br />\nseemed interested enough when Zinie<br />\nBaum, a junior and a member of the<br />\n1935 squad, first tossed, a couple of<br />\nbeautiful flat, bullet passes, and then<br />\nproceeded to fling the ball over fifty<br />\nyards down the field. If his control<br />\nimproves the Blue Jays may take to<br />\nthe air.<br />\nHopkins is going to try a new defense never before seen in Maryland.<br />\nMa prefers not to talk at the present.<br />\nIt looks like storms are brewing up<br />\nfor our friends from Annapolis.<br /><br />\nCStel. le<br />\n...for tobacco<br />\ncut right to smoke right<br />\nThere's a right way to carve a chicken or slice a ham.<br />\nAnd there's a right way to cut tobacco.<br />\nWhen the tobacco in your cigarette is cut the way<br />\nit is in Chesterfield ... right width and right length<br />\n... it burns even and smooth... it smokes better.<br />\n01936, LIGGETT &amp; MYERS TOBACCO Co.<br /><br />"}], "field_media_file": [{"target_id": 39026, "display": null, "description": null, "target_type": "file", "target_uuid": "f73b183a-eb5a-480b-8f97-7cb8e130f845", "url": "http://digital.library.jhu.edu/system/files/2022-03/12702-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12702, "target_type": "node", "target_uuid": "30c94d1c-a2dd-4c68-a136-b65c97482509", "url": "/node/12702"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "59a8b51a-4b07-4dd3-bb06-82dd36154c94"}]}