{"mid": [{"value": 37439}], "uuid": [{"value": "4e61605c-94be-43e7-8f3d-bc60df26f37b"}], "vid": [{"value": 37439}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:32:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13384-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:32:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:32:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MENEM<br />\n<br />\nMOW<br />\n<br />\nPrice 5 Cents<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br />\n<br />\nCLASS OFFICERS<br />\nARE NOMINATED<br />\nWitchhawks Expected Before<br />\nElections<br />\nVOTING NEXT WEEK<br />\nNominations To Be Reopened<br />\nPrevious To Elections<br />\nDuring the past week meetings<br />\nof the Sophomore, Junior and Senior Classes were held in order to<br />\nnominate men for class offices.<br />\nOn Tuesday the 8th, the Junior<br />\nClass met. It was agreed that the<br />\nnominee for the presidency, who received the greatest amount of votes<br />\nshould be duly elected, and the nominee with the next greatest number<br />\nshould become vice-president. Lockard and Towbin were nominated for<br />\npresident. For secretary, Cone,<br />\nRutherford and Powell are the nominees; and for treasurer, Kyle,<br />\nBurk and MacDonald. Heinserling<br />\nwas nominated for sergeant-atarms.<br />\nTwo men represent the Junior<br />\nClass on the Student Council. For<br />\nthese two positions eight men were<br />\nnominated: Yellot, Powell, Bloom,<br />\nRuark, Schwartz, Lockha-rd, Meeks,<br />\nand Millard.<br />\nAnother meeting of the class will<br />\nbe held on Tuesday the 15th, at<br />\nwhich the nominations will be recpened and the elections held. The<br />\ntime for voting will be from 12.20<br />\nto 1 o'clock.<br />\nThe meeting of the Sophomore<br />\nClass was held on Monday the 7th.<br />\nAs in the Junior elections, election<br />\nof the president and vice-president<br />\nwill be fixed by the first and second<br />\ngreatest number of votes.<br />\n<br />\nCLASS ELECTIONS<br />\nTO BE HELD<br />\nThe elections of class officers and Student Council<br />\nrepresentatives of three upper<br />\nclasses will take place this<br />\nweek. The Junior election will<br />\nbe held today, at 12.20, in the<br />\nC. E. Hall, while the Sophomores will cast their ballots<br />\ntomorrow, at the same hour.<br />\nThe Senior election will take<br />\nplace Thursday, after assembly. Nominations will be reopened before the ballot is<br />\ntaken in all three meetings.<br />\nCLASS Elections to be held.<br />\n<br />\nU. S. C. ADDRESSED<br />\nBY DR. JACK HART<br />\nSpeaer Stresses Facing Of<br />\nIssues<br />\nOVER 100 PRESENT<br />\nBill Wilson Praises Levering<br />\nHall<br />\n<br />\nFRENCH PROF GIVES GEOGRAPHY<br />\nLESSON TO IGNORANT FRESHMAN<br />\n\"In time, he became captain of<br />\na pirate lugger of three cannon and<br />\na crew of sixty men, and the coasters of Jersey still remember his exploits.\"<br />\nThe foregoing English translation of a passage of Merimee's \"Tamango\" by a student in French One<br />\nwas interrupted at about the conclusion of the sentences by the instructor's unexpected and devastating, \"A propos, ou est Jersey ?\"<br />\nAfter this had been repeated a<br />\ncouple of times and finally translated into \"By the way, where is<br />\nJersey,\" the freshman, at last comprehended what was expected of<br />\nhim, rattled his cranium (i.e., shook<br />\nhis head) and slowly and sorrowfully replied that he did not know.<br />\n\"A not unusual answer for a<br />\nfreshman,\" caustically remarked the<br />\ninstructor who then proceeded to<br />\ntell of the French first-year men<br />\nwho thought that Texas was near<br />\nNew York and that Brazil and<br />\nArgentine were included among the<br />\nSouthern States, concluding with a<br />\nwithering \"Freshmen are like that.\"<br />\nUpon being interrogated as to<br />\nthe leading product of the Isle of<br />\nJersey, the potential future scholar<br />\nagain pleaded ignorance. The in-<br />\n<br />\nstructor then proceeded to provide<br />\nenlightenment on both the situation<br />\nand product (cows) and was, moreover, so charitable and educational<br />\nas to explain the difference between<br />\nJersey cows and those of the neighboring island of Guernsey. A last<br />\nchance was given the frosh to redeem himself in the eyes of his<br />\nclassmates.<br />\n, I was<br />\n\"By the way, S<br />\nwondering if you happened to know<br />\non what side of a cow to sit during the milking.\"<br />\nBut the fates were unkind, for<br />\nMinerva, goddess of wisdom, had<br />\nnever deigned to pour this highly<br />\ntechnical bit of knowledge into the<br />\nbewildered student's head. Another<br />\nmember of the class, upon being<br />\nasked, guessed, \"On the left side<br />\nI suppose.\"<br />\nThe matter was then put to a<br />\nvote, most of the class voting for<br />\nthe right side.<br />\nBut democracy was doomed to<br />\nbe discredited for the majority were<br />\nwrong. The left side is the one on<br />\nwhich to sit while milking a cow!<br />\nHowever little French the freshmen may have learned that period,<br />\nit is certain that they had acquired<br />\na valuable bit of technical information which may, perhaps, be useful<br />\non some future occasion. Quien<br />\nsabe?<br />\n<br />\nBARNSTORMERS TO<br />\nMEET MONDAY<br />\nDue to the fact that Walter B. (\"Pops\") Swindell,<br />\ncoach of the Barnstormers,<br />\nwas unable to attend the meeting last Wednesday, the election of the president of that<br />\nclub was postponed. A meeting for this purpose will be<br />\nheld Monday, October 14th, at<br />\n12.30 in the Barn. An election<br />\nwas necessitated by the fact<br />\nthat Jack Deets, president of<br />\nthe Barnstormers, did not return to Hopkins this fall.<br />\n<br />\nLIBRARY HAS MANY<br />\nNEW ADDITIONS<br />\nNet Accession Nearly 400,000<br />\nVolumes<br />\nRARE BIBLES DONATED<br />\nAnonymous Gift Provides For<br />\nLanier Alcove<br />\n<br />\nJAYS CLASH WITH<br />\nSPIDERS TOMORROW<br />\nHopkins Team's Backfield<br />\nBadly Crippled<br />\nRICHMOND STRONG<br />\nVan Orman Shifts His LineUp Considerably<br />\nTomorrow, when the Hopkins<br />\nteam trots out into the new stadium<br />\nof the University of Richmond, the<br />\nSoutherners will see a badly crippled team.<br />\nThe Jays will be greatly handicapped, but they will be stubborn,<br />\nhead-up, and wary. This is the<br />\nhird game of their schedule, and the<br />\nteam is anxious to chalk one up in<br />\nthe win column. Thus far the<br />\nchecks have been in the defeat<br />\ncolumn, Lehigh winning to the tune<br />\nof 26 to 0, and Juniata, 7 to 0.<br />\nIf the team can get a taste of<br />\none victory they will be better set<br />\nfor the remainder of the schedule.<br />\nWhen they first cross the goal line<br />\nof the Richmond field they will have<br />\nan incentive to keep them on the go<br />\nfor the rest of the season.<br />\n<br />\nJohns Hopkins' Library had a net<br />\naccession of 16,721 bound volumes<br />\nduring the past year. This large<br />\nLast Tuesday night Dr. Jack<br />\nquantity is well distributed, each deHart of the University of Pennpartment having received its quota<br />\nsylvania, addressed the opening<br />\nof the latest works. This addition<br />\nmeeting of the University Supper<br />\nbrings the total number of books in<br />\nSpiders Lose First<br />\nClub in Levering Hall. Over one<br />\nan<br />\n400,000,<br />\nRichmond,<br />\nhowever, will be a<br />\nnearly<br />\nthe<br />\nlibrary<br />\nup<br />\nto<br />\nhundred members of the club were<br />\nhard<br />\nteam<br />\nto<br />\nall<br />\nprevious<br />\nbeat. They are exsurpasses<br />\nwhich<br />\namount<br />\npresent when Walter Frey, chairLiberal<br />\nClub<br />\nto<br />\nTeam<br />\nCross Country<br />\nrecords and places the Hopkins Li- ceptionally strong this year, having<br />\nman, introduced the speaker of the<br />\nOrganize Monday brary high up in the list of univer- Quite a number of old men back<br />\nRounding Into Form<br />\nevening. Dr. Hart first related his<br />\nPlans for the activities of the<br />\nFor the past week the cross-counon the gridiron, and they will be<br />\ndifficulties in finding Levering Hall. try squad has been practicing dili- Johns Hopkins Liberal Club will sity libraries.<br />\ndefending their goal with plenty of<br />\nRare Bible Collection<br />\nsays that he had come over one gently in the afternoon at Home- be discussed at the organization<br />\nOf the new books, one of the power. Last week, in the opening<br />\nstreet that would make a perfect wood field under the direction of meeting to be held Monday at 1<br />\ngame of their season they lost to<br />\ngolf course-36 holes in every the coach, Mr. Hambleton. Several P. M. in room B, second floor, Lev- most notable groups is the Hoffman<br />\nering<br />\nHall.<br />\nAll<br />\nstudents,<br />\nboth<br />\ngradsome<br />\ncollection,<br />\nin<br />\nwhich<br />\nBiblical<br />\nmembers<br />\nof<br />\nlast<br />\nWake Forest by a score of 19 to 0.<br />\nyear's<br />\nsquad<br />\nare<br />\nJuniors Nominate<br />\nblock. He then remarked that he<br />\nand<br />\nuate<br />\nand<br />\nundergraduate,<br />\nwho<br />\nare<br />\nGerman<br />\nrare<br />\nEnglish,<br />\nFrench,<br />\nback.<br />\nThey<br />\nare<br />\nHerman<br />\nSchabel,<br />\nThe nominations were made as could be kept in Baltimore longer<br />\nThis game, which inaugurated a<br />\nfollows: President, Jefferson, Guild, than another well-known man of the perhaps the best cross-country, and interested in the advancement of Greek Bibles are exhibited. The en- new stadium, should have been won<br />\ntwo-mile runner in the Southern liberal thought are cordially invited tire collection was donated by Henry<br />\nDukehart and Shirley; treasurer,<br />\nby Richmond and they were very<br />\nsame name as he expected to stay<br />\nJ. Hilken and was placed in a specolleges; Bob Kelly, captain; Wm. to attend.<br />\nEngland, Jung, Shinoner, BialosThe purpose of the Club is to cial ebony case at the end of the disappointed over the loss. They're<br />\nMuller, H. Emerson, Ch. Waters,<br />\nkorski, and Goldberg; secretary, two full days.<br />\nInterpretation<br />\nCh. Reeder, and James Hancock. center attention upon the defects German stacks. This case will be going to try to avenge their disapLamont, Getting, Kronsberg, and<br />\nLevy; sergeant-at-arms, Getting,<br />\nDr. Hart becoming serious, All look promising and certainly, cf our economic and social system, marked in bronze in the near future. pointment by defeating Hopkins toWatts, Levy, Dorman, Ness, and lamented on the fact that many peo- according to the coach, will give a and to provide the student body with The library can be proud that this morrow, and since the Jays have<br />\na forum in which perfect freedom remarkable collection has been met two successive<br />\nYavelow ; Student Council, one rep- ple lived by rules and regulations fine showing this season.<br />\ndefeats, they<br />\nof<br />\nthought and opinion is allowed. added to its shelves.<br />\nAmong<br />\nthe<br />\nnew<br />\nentrants<br />\nthis<br />\nresentative from the Sophomore rarely interpreting things for themwant to get going. This makes the<br />\nClass, Shrieve, Small, Siegle, Ness, selves. He stated that the \"Y\" year are Sugerman, Edgerton and The policy followed is to have preNew Lanier Alcove<br />\nprospects for a good game very<br />\nGruver, Alrich, Lily, Perry, Sykes, should be an organization that Junge. The coach would like some pared talks by members on topics<br />\nanonymous<br />\ngift of $1,000 was favorable.<br />\nAn<br />\nand Watts.<br />\nshould help to interpret the facts of more freshmen and sophomores to within the scope of the Club's in- recently received for an alcove in<br />\nWhen the Jays arrive in RichIn accordance with the ruling that life and get the most out of it. He come out for the squad as five of terests, followed by questions and<br />\nmemory of Sydney Lanier. For the<br />\nno man may run for two offices, the emphasized the fact that the \"Y\" the old men are graduating this discussion.<br />\nbenefit of those to whom the name mond Saturday, they will have a<br />\nThe Liberal Club was formed last<br />\nfollowing withdrawals from nomi- should not be taken as another year. This practice also is beneis not yet familiar, it might be stated number of injured men with them<br />\nnation are expected: Levy from the campus activity, but as the center of ficial to men who intend to run dis- fall, and soon developed into one that Lanier was a well-known south- to bolster up the ranks if<br />\nnecessary.<br />\nsecretarial nomination; Ness and all activities. Dr. Hart advised the tance or play lacrosse, basketball, or of the most active and successful ern poet who studied at the Johns The backfield will<br />\nbe the worst hit<br />\nWatts from the nomination to the \"Y\" men to face up to the differ- football, because it develops a fast organizations of its kind in Ameri- Hopkins University and held the<br />\nby<br />\ncasualties.<br />\nJack<br />\nTurnbull will be<br />\ncontent<br />\ncircles.<br />\nNot<br />\ncan<br />\ncollegiate<br />\nStudent Council; and Getting from ences saying that lack of free foot movement in the men.<br />\nchair of English literature for many<br />\nlimited<br />\nto<br />\nmeetings<br />\nout<br />\nwith<br />\na<br />\nseries<br />\nof<br />\nbecause of an injured knee<br />\nthe run for sergeant-at<br />\nAmong some of this season's opspeech \"got his goat.\" The speaker<br />\n-arms.<br />\nyears. He was an excellent musician<br />\nDue to the fact that the Jewish continued saying that he believed it ponents who look very promising its own members, it successully as well, and the musical flow of his which was received in the Juniata<br />\nmembers of the class could not at- was better to throw a few flowers is St. Johns. \"If enough candidates promoted an Intercollegiate Liberal poems have facilitated their being game. Niells is handicapped betend a meeting on the 14th because without removing the pots instead come out to allow for good substi- Conference, attended by about 75 put to music many<br />\ntimes. His fav- cause of leg injury from last week's<br />\nof the observance of Yom Kippur, of constantly evading issues.<br />\ntution where necessary, we may students from more than a dozen orite instrument was the<br />\nflute. Many game. Merriken, whose arm has<br />\nthe elections will be held on Wedmake an excellent affair of this colleges. The conference, which manuscrips and<br />\npictures<br />\nowned by been bad since the beginning of the<br />\nCriticisms<br />\nmeet,\" said Coach Hambleton. Prac- was addressed by a series of notable Dr. Lanier, as well<br />\nnesday the 16th.<br />\nas<br />\nseveral<br />\nletters season will<br />\nstated<br />\nman<br />\nPennsylvania<br />\nThe<br />\nstill be on the injured<br />\ntice takes place every day at 4 speakers including Norman Thomas written in<br />\nhis<br />\nown<br />\nhand,<br />\nwill<br />\nbe<br />\nSeniors Meet<br />\ncaught<br />\nreligion<br />\nwas<br />\nhis belief that<br />\no'clock at Homewood field. A wel- and Father John A. Ryan, proved a placed in<br />\nthe alcove. One picture list. Numerous injuries, as well,<br />\nThe senior class held its meet- rather than taugh and it was useless<br />\ncome is extended to those who care remarkable stimulation to liberal in<br />\nparticular is of exceeding rarity. have weakened the line. Helm,<br />\ning, Purnell Hall presiding, yester- unless one could not get away<br />\naround and watch practice. thought in nearby colleges, and re- It is<br />\nto<br />\ncome<br />\nday. The first business was to go from it, and always carried it with<br />\nan enlarged photograph of the Nichols and Bialoskorsky are out<br />\nsulted in the strengthening of exactual<br />\noak which Lanier described with injured limbs. Towbin is in<br />\nthrough the customary proceedure him. He said that the \"Y\" should<br />\nisting clubs in a number of instituso<br />\nvividly<br />\nin his poetry. This was the fray once again, but his side is<br />\nof electing several students of the be glad that there were people who Cage Fund Drive<br />\ntions, and the formation of groups<br />\ndonated<br />\nto<br />\nthe alcove by R. A.<br />\nTo<br />\nBe<br />\nContinued<br />\nEngineering School (who skip their criticized it, and that these criticisms<br />\nin several others.<br />\nstill bothering him, and Powell, at<br />\nBaker<br />\nProvision<br />\nthird year) into the class.<br />\nwas made besides<br />\nBasketball enthusiasts will be inThis year, with most of last<br />\nshould be met fairly and squarely in<br />\ncenter, limps considerably when he<br />\nThe following men were voted every case.<br />\nterested to know that work is now year's members back and a large for a Lanier professorship. The<br />\nin: Bailey Bateman, Miller, New, Previous to Dr. Hart's speech, a being done toward the fund for number of new additions expected, work of commemorating within her walks.<br />\nJays Revamped<br />\nStafford, Williams, Redue, Mulli- short talk was made by Bill Wilson, the new cage.<br />\nthe Liberal Club promises to be halls, the great sons of Hopkins is<br />\nThe<br />\nteam,<br />\nwhich has been scrimken, Messiora, Flocks, Merchant, traveling \"Y\" secretary of the MidSeveral men are attempting to even more vigorous and successful a fine mission.<br />\ntnaging hard all week, has been deLedornis, Matthews, Nerstin, Gold- dle Atlantic Area, in which he obtain contributions substantial than before. It plans to repeat the<br />\nveloping a new set of plays, and<br />\nstein, Suigewald, Jones, Lipnich, praised Levering Hall, stating it enough to put the desires for a cage, Intercollegiate Conference, a n d<br />\nseveral new men will appear in the<br />\nShugar, Elliot, Muker, Stumph, was the best building of its kind in on the Hopkins Campus, on a seri- make it larger and more representa- Cotillion Club<br />\nline-up. The team will leave BaltiTo Hold Dance more this<br />\nRasserew, Krebs, Rouark, Carmine, the East if not in the entire United ous basis. It is expected that in tive than ever. Several large meetevening by boat. Toand Campbell.<br />\nthe near future these contributions ings, open to the general public,<br />\nThe Cotillion Club will hold its morrow morning they will arrive at<br />\nStates.<br />\nThe following men were nomiSeveral letters from former cab- will be received. When this expecta- and addressed by speakers of na- regular Saturday night dance to- West Point, Va., and will go direct<br />\nnated for the class offices:<br />\ninet members were read by Mr. E. tion becomes a fact, an active drive tional prominence, will probably be morrow at Levering Hall. The to the University of Richmond by<br />\nPresident, Brownley, Waring, A. Schaal, executive secretary at will be started among the alumni held. The weekly program is now dance is scheduled to start prompt- bus. After the game, tomorrow<br />\nbeing mapped out by the officers.<br />\nNichel, Gettemuller, Linthicum, Hopkins in which Levering Hall and on the campus.<br />\nly at 9 o'clock with Bob Iula fur- evening, the Blue team will return<br />\nPurnell. Student Council, Gump, was highly praised. All these letters<br />\nMeetings will be held every Mon- nishing the music. The admission home by the same route instead of<br />\nEvery student in the University<br />\nCampbell and Hull; Secretary, were from men who expressed re- should realize the pressing need day, at the time and place men- will be $1.00, stag or couple.<br />\nspending the week-end in RichLove, Scheidt, Passerew ; Treasur- grets that they would not attend for this building; and when the tioned. Everyone interested in the<br />\nIt is hoped that the dances will mond.<br />\ner, McAll, Marks, Reck ; Sergeant- the first meeting of the University drive conies subscriptions should be discussion of liberal ideas is wel- continue to be as successful as the<br />\nCoach Van Orman has not yet<br />\nat-Arms,<br />\ncome.<br />\nwilling and plentiful.<br />\nopening dance held last week.<br />\nFerini and Keys.<br />\nSupper Club in Levering Hall.<br />\n(Continued on page 3, column 4)<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br />\n<br />\nTIIE<br />\n<br />\nHOPKINSIIEWSUTTER<br />\n<br />\nVICTORIAE GLORIA MERGES<br />\nBY SYLVAN LEBOW<br />\n<br />\nThe great majority of fresh- year—naturally those rating highmen who come to a university like est in scholarship. A freshman must<br />\napply himself immediately if he has<br />\nSubscription<br />\n$2.00 the Johns Hopkins, usually take too<br />\naspirations to Phi Beta Kappa, for<br />\nlong a time to become acclimated<br />\nevery<br />\nscholastic step taken by the<br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore, to their surroundings. This is a<br />\nstudents in each of his four years is<br />\nMd., under the Act of Congress November 3, 1879.<br />\ngreat injustice to themselves, as well judged. Only those pursuing the A.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins as a great sacrifice on the part of B., Ph. D., or M. D. courses are<br />\nUniversity.<br />\ntheir studies. Many students of the eligible for membership. The engineers have Tau Beta Pi to look forBusiness communications should be addressed to the BUSINESS MANAGER. entering classes have fine personaliJohns Hopkins University. All articles should be sent to the MANAGING EDITOR; ties, are naturally good students; ward to in the same light that the<br />\nother communications to the EDITOR-IN-CHIEF.<br />\narts students look forward to \" Phi<br />\nand thus have exceptional possibili- 13ete.\"<br />\nUniversity 0100 ties. Several of them have left enTelephone<br />\nNext in importance to Phi Bete<br />\nviable records behind them at prep- is the campus activities honor soEDITORIAL DEPARTMENT<br />\naratory schools, scholastically as ciety, Omicron Delta Kappa. The<br />\nEditor-in-Chief<br />\nwell as in activities. However, when \"0. D. K's\" are those men who<br />\nGEORGE GUMP,'30<br />\nthey get to college amid new sur- have excelled in the various activities which the university affords.<br />\nManaging Editor<br />\nroundings, and become subject to<br />\nAfter all, one does not come to colROBERT S. BAIRD, '30<br />\nthe knocks which accompany the lege merely for the purpose<br />\nof<br />\nAssistant Managing Editors<br />\ntransition from loudly high school reaching scholastic heights. There<br />\nRICHARD HUNT,'31 GEOFGE DOWELL,'31<br />\nsenior to inconspicuous \"Freshie,\" ought to be other things involved,<br />\nAssociate Editors<br />\nPAUL SPEAR, '30<br />\nSIDNEY WOLK, '30<br />\nthey seem to fall into a rut of one of which should be activities.<br />\ninactivity, and thus waste many A noted educator has said that if<br />\nJunior Editors<br />\nPURNELL HALL,'30<br />\nSTEWART L. SMITH, '30<br />\na precious minute of their time. he had the chance to go through colNESS,<br />\n'32<br />\nMcD.<br />\nROWLAND<br />\nJR.,<br />\n'31<br />\nMuLLIKIN,<br />\nHOWARD F.<br />\nThe years roll by quickly; fresh- lege once again, he would strive to<br />\nNATHAN M. HARRIS, '32<br />\nFRANK CONE, '31<br />\nSYLVAN LEBOW, '32<br />\nmen become upperclassmen, and make an average of just about eight,<br />\nGEORGE TRATTNER, '30<br />\nas they are preparing for grad- would go out for two activities<br />\nBUSINESS DEPARTMENT<br />\nuation, their past appears before (one athletic and one non-athletic),<br />\nGus BURKE, '31<br />\nthem like an open book, many a would endeavor to have a good time<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nchapter of which has been left &t each one of these things, and<br />\nLYLE GULLEY '31<br />\nSADLER ROBERTSON, '31<br />\nblank due to idling on the part of would try to take away with him<br />\nOffice Manager<br />\nthe individual, or perhaps due to a something more than mere book<br />\nALvIN &um,'30<br />\npursuit of endeavors along useless knowledge. Of course, some may<br />\nRandolph Rothchild, '31<br />\nSidney Ruffel, '31<br />\nchannels. The only chapter which dispute his theory, but many a \"Phi<br />\nJohn A. Jamison, '31<br />\nDavid S. Sykes, '32<br />\nHenry V. Saunders, '32<br />\nTheodore Fleishman, '31<br />\nyet remains to be filled is the final Bete,\" you know, at the close of<br />\none,—commencement—and then, all his college career has taken a job<br />\nin a shoe store, started to sell subProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md. that remains of the four years of<br />\ncollege experience is memories. Col- scriptions to the \"Ladies' Home<br />\nlege, like anything else, is just what Journal,\" or what have you? \"0. D.<br />\none makes of it. It can make men or K.\" is idealistic in its principles of<br />\nbreak them. In four years a stu- service to the school, and the stresdent can definitely and distinctly sing of the importance of the vaprepare and plan his future course rious activities for the benefit of the<br />\nof action, but he can also waste student himself. Tappings to the sothese years, and still be as stagnant ciety are held hi-annually and the<br />\na creature at the lapse of the time \"victors\" are decorated with the<br />\nWORSE AND WORSE<br />\nas he was when he first entered the anciently known laurel leaf at the<br />\nand<br />\nyear<br />\nevery<br />\nworse<br />\nand<br />\nassembly.<br />\nworse<br />\ngrows<br />\nsection<br />\nOPKINS' cheering<br />\nportals of his alma mater.<br />\nblame;<br />\nnot<br />\nto<br />\nare<br />\ncheer-leaderes<br />\nThe<br />\nvalue.<br />\nit never was of much<br />\nThe Tudor and Stuart Club is<br />\nThe advice Dr. French, librarian<br />\ntheir function is merely to lead the songs and not to provide the<br />\nan<br />\nhonorary literary club which<br />\nof the university, gives to freshsingers. The fault lies with the undergraduate body as a whole and<br />\nwas<br />\nfounded by Sir William Osler.<br />\nmen is that they should try to adopt<br />\nthe freshman class in particular.<br />\nOnly<br />\nmen of exceptional literary<br />\nas their goal some of the many hontastes<br />\nand interests are admitted.<br />\nors, which can and are to be won by<br />\nThere are three divisions of the group that should be giving vocal<br />\nAdmissions<br />\nto the club are decided<br />\nundergraduates. He claims that the<br />\nsupport to the eleven. In the first place, half of the undergraduates<br />\nby a board of governors. The club<br />\nvast majority of underclassmen<br />\ndo not attend the games at all; secondly, many of those that do attend<br />\nlimits its membership to eight memknow very little of these honors,<br />\ndo not sit in the cheering section; thirdly, a major portion of those in<br />\nbers in each class.<br />\nwhich are well worth striving for.<br />\nthe rooting stands open their mouths only for the purpose of eating<br />\nThere are numerous prizes to<br />\nThe only time that those who fall<br />\npeanuts.<br />\ninto this great pool of mediocrity scholarships offered either by the<br />\nuniversity or through private<br />\nupper<br />\nthree<br />\nthe<br />\nwake up to the fact, that there ever<br />\nManifestly it is impossible to compel the members of<br />\nsources,—among<br />\nwhich are the<br />\nwhether<br />\nwere things to strive for (and right<br />\nclasses to attend the games. To make them pay their athletic fee<br />\n(Continued<br />\non<br />\npage<br />\n3, column 3)<br />\nthe<br />\nat arm's reach, too) is when the<br />\nthey are present or not seems to be the most effective solution of<br />\nis<br />\nnot<br />\nproblem. However, this system is already in force and its effect<br />\nawards are made and the student<br />\nas far-reaching as would be imagined. Each upperclassman should<br />\nfinds himself grumbling over the<br />\nBOOKS<br />\ncertainly be enough interested in all that pertains to Hopkins to devote<br />\ntact that he is a better man than<br />\nBought—Sold—Exchanged<br />\nSaturday afternoons to the teams. Football games are enjoyable enough<br />\nJack, and that he could have done<br />\nPIPPEN'S BOOK STORE<br />\nin themselves to ninety per cent of the college population to cause<br />\nbetter than Bill if only he were given<br />\nBooks on Nearly All Subjects<br />\n605 North Eutaw Street<br />\nalmost unanimous attendance at games. They like football and they<br />\na fair chance, etc., etc., ad infinitum.<br />\nare interested in Hopkins' teams, yet still they stay away.<br />\nThis is always the case, and it will<br />\ncontinue to be such until civilization<br />\nAs for the second problem, that of bringing the men together in<br />\nreaches a state of utopia,—which<br />\none body, we believe there is a remedy. If all the high school youngsters<br />\ngentle reader, is quite a long ways<br />\nthat now infest the stands were to be debarred from the cheering secoff.<br />\ntion, more Hopkins men would view the game from the wooden stands.<br />\nThere are many honors to be acLast Saturday the youngsters spoiled many a person's afternoon by<br />\nquired<br />\nby conscientious students<br />\namused<br />\nthem<br />\nSome<br />\nof<br />\nthrowing popcorn and peanuts around the seats.<br />\nwho<br />\ntop<br />\ntheir respective classes inused<br />\nwhen<br />\nbest<br />\nat<br />\nthemselves with pea-shooters, barbaric instruments<br />\ntellectually.<br />\nFirst of all it would be<br />\nwould<br />\nwhich<br />\nspace<br />\nskillfully. These Breakers of the Peace take up<br />\nproper<br />\nto<br />\nmention<br />\nPhi Beta Kappa.<br />\nothers<br />\nmany<br />\nout<br />\nordinarily be occupied by Hopkins men and they keep<br />\nPhi<br />\nBeta<br />\nKappa<br />\nis<br />\nthe oldest of the<br />\nout<br />\ncheering<br />\nby their very presence. Furthermore, they take delight in<br />\nGreek<br />\nletter<br />\nsocieties,<br />\nthe father of<br />\nIt<br />\nyells.<br />\nthe<br />\nof time purposely, thereby greatly reducing the effect of<br />\nthem<br />\nall,<br />\nfounded<br />\nin<br />\n1776<br />\nat Willthe<br />\nsee<br />\nis fine advertising for the college to allow these boys in to<br />\niam<br />\nand<br />\nMary<br />\nCollege.<br />\nIt<br />\nstarted<br />\nas<br />\nthe<br />\nview<br />\ngames and the practice should be continued, but they should<br />\na<br />\nsocial<br />\norganization,<br />\nas<br />\nwell<br />\nas<br />\nan<br />\nthe<br />\ngame from some other vantage point. The cheering section is<br />\nintellectural and scholastic order.<br />\nbest place on the field from which to view the action and we believe<br />\nthe<br />\nWith the establishment of chapthat the undergraduates would naturally gravitate thither once<br />\nYou're welcome anywhere in a<br />\nters at such schools as Yale and<br />\nyouthful menace is removed.<br />\nSaunders System car. Drive one<br />\nHarvard, and with the appearance<br />\nof our brand new Chryslers or<br />\nModel A Fords on your next party<br />\nThe third problem, that of getting the undergraduates to cooperate<br />\nof such orders as the Freemasons,<br />\nor date. By sharing e -r3enses two<br />\nwere<br />\nsection<br />\nrooting<br />\nonce<br />\nthe<br />\nsolved<br />\nwould<br />\nbe<br />\nwith the cheer-leaders<br />\nPhi Beta Kappa decided to do away<br />\nor more may have a fine large<br />\nfilled with Hopkins men. Cheering is contagious; the few who always<br />\nevening at small cost. Special low<br />\nwith its secrets, and take the form<br />\nrates on long trips.<br />\ngive the yells would soon diffuse their spirit among the remainder.<br />\nin which it now appears,—namely,<br />\nthe<br />\nGiven<br />\ncheer-leaders.<br />\nwith<br />\nthe<br />\nrests<br />\nFurther than this, the burden<br />\na scholastic honor society. The namaterial it is up to them to develop it. At present they have nothing<br />\ntional council of the society is very<br />\nto work with, but we believe that they can measure up to the work<br />\nparticular with the granting of charif given the opportunity.<br />\nters for chapters. Only certain universities of high standing are honThe freshmen must be considered separately. They are required to<br />\nored<br />\nwith chapters of the \"Phi<br />\nattend the games, but so far nothing has been done to see that they<br />\nBete.\"<br />\nOf course, in its present<br />\ncome. We suggest that the pre-game parade be revised and tags issued.<br />\nfrom<br />\nhere<br />\nat Hopkins, \"Phi bete\"<br />\nEach freshman not having his tag should be made to answer to the<br />\nonly<br />\nconsiders<br />\nthose whose marks<br />\nsophomore class and a fit punishment be prescribed. Paddling, if<br />\nhigh; in fact, high<br />\nare<br />\nexceptionally<br />\nnecessary, can always be re-invoked as a corrective measure.<br />\nSS-2<br />\nscholastic attainments are the only<br />\n11 EAST NORTH AVENUE<br />\nrequisite.<br />\nOnly<br />\na<br />\ncertain<br />\nper<br />\ncentMake the freshmen attend all the games, banish the youngsters from<br />\nVernon 2704<br />\nage<br />\nof<br />\ntaken<br />\neach<br />\nstudents<br />\nare<br />\nin<br />\nthe cheering section, and the rest will take care of itself.<br />\nFOUNDED 1897<br />\n<br />\nEDITORIALS<br />\n<br />\nH1<br />\n<br />\nE<br />\n<br />\nPOPULAR<br />\n<br />\nBobby Lyons Announces:<br />\nthat if you want to see a pretty piece<br />\nof footwork, he'll be glad to show you<br />\nthe new Autumn styles in Hess shoes.<br />\nYou'll find him--and them--at The Barn<br />\n<br />\nN. HESS' SONS<br />\n8 E. Baltimore Street<br />\n<br />\nIF YOU \"MAJOR\" IN<br />\nTRANSPORTATION—<br />\nOne thing quickly becomes clear to students of transportation<br />\nproblems.<br />\nIt is the fact that in large cities the electric car lines with<br />\ntheir auxiliary coach and bus routes form the backbone of<br />\ntransportation.<br />\nIn this permanent and necessary public utility the problems<br />\nand principles involved are worth the notice and study of<br />\nevery young man interested in public service.<br />\nTHE UNITED RAILWAYS AND ELECTRIC CO.<br />\nof Baltimore<br />\n<br />\nNOW OPEN—<br />\nTHE<br />\nNEW<br />\n<br />\nSILVERNIAN<br />\n<br />\nBALTIMORE'S SMARTEST NIGHT CLUB<br />\n<br />\n823 CHARLES ST., NORTH<br />\nFeaturing Gus' Melody Boys and Novelty Entertainment<br />\nMinimum Charge $1.00<br />\nEvery Night<br />\n<br />\nRESERVATION<br />\nVERNON 7859-7203<br />\n<br />\nSaturdays and Holidays<br />\nCouvert Charge $1.00<br />\n<br />\nCORONA for College<br />\nCORONA leads the world<br />\non these 8 champion counts<br />\n1. STRENGTH: Strongest frame of any portable typewriter—solid one-piece Aluminum, rigidly braced.<br />\n2. SIMPLICITY: Fewer parts than any other standard-keyboard typewriter.<br />\n3. COMPLETENESS: More big-machine features than any other portable typewriter.<br />\n4. EASY TO LEARN: Corona design is the result of 20 years' study of the needs of<br />\nbeginners.<br />\n5. WAR SERVICE: An unequalled record for duration as the official portable of the<br />\nAllied Armies.<br />\n6. POPULARITY: There are over a million satisfied Corono owners.<br />\n7. DURABILITY: Coronas purchased 20 years ago are still giving satisfactory service.<br />\n8. BEAUTY: Graceful in line; exquisitely finished in every detail.<br />\n<br />\nM. W. LUCY & COMPANY<br />\n104 West Fayette Street<br />\n<br />\nBALTIMORE, MARYLAND<br />\n<br />\nSTETSON CLOTHES<br />\nfor<br />\n<br />\nCollege OYCen<br />\n<br />\nNationally<br />\n<br />\nJustly<br />\n<br />\nKnown<br />\n<br />\nFamous<br />\n<br />\nMADE FOR YOU<br />\n<br />\nFOUR NORTH CHARLES STREET<br />\n<br />\n\f=MI<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br />\nVICTORIAE GLORIA<br />\nMERCES<br />\n(Continued from page 2, column 4)<br />\n<br />\nWarner & Company<br />\n•<br />\nHats<br />\nClothing<br />\n<br />\n1<br />\n<br />\nand<br />\n<br />\nPurnishings<br />\nfor<br />\n<br />\nGenthmen<br />\n•<br />\n18 and 20 E. Baltimore Street<br />\n<br />\nN<br />\n<br />\ni<br />\n<br />\nc<br />\n-<br />\n<br />\nCLOTHES<br />\nCLOTHES<br />\n211-213 E. Baltimore<br />\n<br />\nA special selection of<br />\nWoolens---Suits to Ord<br />\n<br />\n$40<br />\n<br />\nAdams debating prizes, the De<br />\nToqueville medal, the Hollander<br />\nprize, the Rhodes, and other scholarships, as well as many other honors which a lack of space does not<br />\npermit going into details about.<br />\nAnd yet some freshmen (enough<br />\nupperclassmen, as well) seem to<br />\nadopt the attitude that there is nothing to work for.<br />\nThe greatest of all respect is self<br />\nrespect. If a man, at the end of his<br />\ncollege career, realizes that he has<br />\nfound out just what he is best suited for in life, he has done a wonderful thing, and will, by this early<br />\nstart in life, be out in the world advancing by leaps and bounds ahead<br />\nof his less fortunate brothers. Dr.<br />\nAmes, in his former capacity as<br />\ndean, often brought out the fact<br />\nthat college men should try to find<br />\nthemselves as soon as possible and<br />\nthen work as hard as they could<br />\ntoward their goal and ideal.<br />\nInterviews with members of the<br />\nfaculty are not to be sneezed at.<br />\nRather than come face to face with<br />\nhis \"profs\" in a frank, informal<br />\nway, many students may avoid priN ate interviews with them all during<br />\ntheir collegiate life. Not all faculty<br />\nmembers are as ferocious as they<br />\nseem to be, and you may rest assured that a good many of them are<br />\njust waiting for you to drop up to<br />\ntheir offices so that they may show<br />\noff some of their first editions, and<br />\nyou can also feel safe to uncover<br />\nyour troubles to them, for they will<br />\nlisten attentively and render sage<br />\nadvice. And say, how about our<br />\nnew<br />\ndistinguished-looking dean?<br />\nYou know what they say about \"the<br />\nman who smokes a pipe.\"<br />\n<br />\n3<br />\n<br />\nJAYS AND SPIDERS MEET<br />\n(Continued from page 1, column 6)<br />\n<br />\ncome to a decision on the final lineup for the Jay team. This line-up<br />\nwill probably not be known until<br />\nthe men go out on the field to arrange themselves for the kick-off.<br />\nThe tentative line-up, which, will,<br />\nno doubt, be changed considerably,<br />\nis:<br />\nPosition<br />\nRichmond<br />\nHopkins<br />\nTriplettL.E.<br />\nMiller<br />\nL.T.<br />\nKeating<br />\neyractet<br />\nL.G.<br />\nTowbin<br />\nC.<br />\nBelcher<br />\nPowell<br />\nMetcalf<br />\nLevy<br />\nR.G.<br />\nR.T.<br />\nLove<br />\nLee<br />\nKneip<br />\nR.E.<br />\nLandrum<br />\nGuild<br />\nQ.B.<br />\nDohrman<br />\nBledsoe<br />\nH.B.<br />\nMay<br />\nWeitzel<br />\nH.B. Gunter (c.)<br />\nHudart<br />\nF.B.<br />\nGroth<br />\n<br />\nChoosing<br />\nYourInvestment Banker<br />\nN choosing your investment banker it is of foremost importance to consider the financial responsibility and experience of the house.<br />\nGILLET & COMPANY is an established investment banking house and has built up a<br />\nreputation among thousands of individual investors, banks, insurance companies and other large<br />\ninstitutions through offering sound securities and<br />\na complete investment service.<br />\n<br />\nINTERCOLLEGIATE NEWS<br />\n<br />\nClosely identified with the steady growth of<br />\nGillet & Company is the Statistical Service which<br />\nis rendered to investors. The wide scope of this<br />\nservice provides continuous, dependable investment<br />\ninformation, placing at your disposal every facility<br />\nfor formulating and following a profitable investment program.<br />\n<br />\n(Continued from page 4, column 3)<br />\n<br />\nshould go on press with an extra<br />\nedition.<br />\n<br />\nTER<br />\n<br />\n* * * *<br />\n<br />\nA wrinkle in intelligence tests for<br />\nfreshmen is the inclusion of crossword puzzles. Freshmen at the University of Michigan are no longer<br />\nconfronted with the usual stock<br />\nquestions listed in the ordinary intelligence tests. Rather, freshmen<br />\nare confronted with such problems:<br />\nA word in five letters meaning a<br />\n'heavenly body with a long nebulous<br />\ntrail.\" The answer to which, of<br />\ncourse, is \"Angel.\" Also, something<br />\nof this sort: Four letters for<br />\n\"suitor.\" \"Sweetheart,\" for the<br />\nfreshmen is the obvious answer.<br />\nFreshmen this year find questions<br />\nlike these rather easy, says the<br />\nMichigan correspondent.<br />\n<br />\nGiLLET & Co.<br />\nBANKERS<br />\nLIGHT & REDWOOD STS.<br />\nBALTIMORE, MD.<br />\nTelephone PLaza 9060<br />\nWASHINGTON, D. C. PHILADELPHIA, PA. WILLIAMSPORT, PA.<br />\nEASTON, MD.<br />\n<br />\nBIRMINGHAM, ALA.<br />\n<br />\nof* fr<br />\n<br />\nRESERVED<br />\nFOR<br />\nIFINCHLEY<br />\nHATS<br />\n<br />\nMaybe there's<br />\nsomething<br />\nin it, after all<br />\nTrying outfor the editorial board, Simpson,<br />\n'33, is all energy. Here, there and everywhere to cover events, he is busy on the<br />\nwrite and rewrite—confident that<br />\nexperience will fit him for the post.<br />\nAnd Jones, his roommate,shows<br />\nequal determination in football.<br />\n<br />\n/<br />\n<br />\nTackling, bucking the line, practicing<br />\nsignals, he trusts to solid ground-work<br />\nto get him on the scrub this year.<br />\nGood training, both of them.<br />\nPerhaps there is something in high<br />\nscholarship, too. Industrial leaders<br />\nof today think so.<br />\n<br />\nliecitric<br />\nManu acturers...Purchasers...Distributors<br />\nSINCE<br />\n<br />\n1882<br />\n<br />\nFOR<br />\n<br />\nTHE<br />\n<br />\nBELL SYSTEM<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br />\n<br />\nZ<br />\n<br />\nINTERCOLLEGIATE<br />\n- NEWS - -<br />\n<br />\nG<br />\n<br />\n$8.50<br />\n<br />\nA sturdy new shoe for young men with a generous measure<br />\nof style ... and priced to fit a Scotchman's purse.<br />\n<br />\nAN<br />\n<br />\n19 E. Lexington<br />\n<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nPhone HOmewood 7908<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nBireley's Pharmacy<br />\n<br />\nHoles, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nDRESSES<br />\nREPAIR<br />\nALSO<br />\nSILK<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\nMoth<br />\nWE<br />\n<br />\nMake Our Store Your Store<br />\nYour Neighborhood Drug Store<br />\nST. PAUL at 33rd STREET<br />\n<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br />\n<br />\nWERGLEY'S<br />\n2438 Charles St., North<br />\n<br />\nLa Patisserie<br />\nSANDWICHES PAR EXCELLENCE<br />\n<br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n<br />\nJ. A. RITTER & SON<br />\nFlorist's and Decorators<br />\n1918 NORTH CHARLES ST., Near 20TH<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nPhone: VErnon 0573<br />\n<br />\nTHE NORTH INN<br />\n3 East North Avenue<br />\n441.0-<br />\n<br />\nThe Meeting Place for College Men<br />\nAfter the Game or the Dance<br />\n440.0.<br />\n<br />\n\"Food Prepared the Right Way\"<br />\n<br />\n15c First Quarter Mile-5c Each Additional Quarter Mile<br />\n<br />\nCENTURY CAB CO.<br />\n1718 N. CHARLES STREET<br />\n<br />\nVERNON 7002<br />\nWe are promoting the cab business from an expensive luxury<br />\nto an economical necessity<br />\n<br />\nAfter the Dance<br />\nST. ILEC S<br />\n8<br />\n<br />\n- 7 North Charles Street<br />\n<br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and<br />\nLombard Sts.<br />\nPLaza 6000<br />\n1723-25 N.<br />\nCharles St.<br />\nVErnon 4049<br />\n2402 Pennsylvania Ave.<br />\nLAfayette 2000<br />\n<br />\nBuicks<br />\nChevrolets<br />\nChryslers<br />\nHupmobiles<br />\nWillys-Knights<br />\n<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\nLIGHT<br />\nCOLORFUL<br />\nWARM<br />\nDRY<br />\n<br />\nIn any event<br />\nwear an<br />\n<br />\nLET rain, wind or chill sweep the field—you're dry and<br />\nwarm. Smartly dressed,too! Expertly styled in a wide range<br />\nof distinctive colors. For men and women, $7.50 to $25.<br />\nTHE ALLIGATOR COMPANY,St. Louis<br />\nProtect trouser legs—all colors to match all coats.<br />\nALLIGATOR (Pat.<br />\n.1Vew• STEPPER S App.for) $2 and $3.50 a pair.<br />\nAsk to see them.<br />\n<br />\nDRY<br />\n<br />\nFROM<br />\n<br />\nHEAD<br />\n<br />\nTO<br />\n<br />\n“Where we all meet<br />\nafter the big game\"<br />\n<br />\nFORD<br />\n<br />\nAutomobiles<br />\n<br />\nWEBSTER'S<br />\nCOLLEGIATE<br />\n<br />\nThe big majority<br />\nprefers Sheaffer's<br />\n<br />\npens,$8.75; Ladies',$7.50 and $8.25. Black and<br />\npearl De Luxe,$10.00; Ladies',$8.50 and $9.50.<br />\nPencils, $5.00. Others lower.<br />\n<br />\n* * * *<br />\n<br />\nALLIICAVIV 111<br />\nKEEP<br />\n<br />\nILGERS<br />\n<br />\nSeveral additions to the faculty<br />\nfor the academic year 1929-30 have<br />\nOur acquaintance with Mr. Ber- become effective with the opening<br />\ntrand Russell was fostered through<br />\nof the University.<br />\na study of that eminent philanthropForemost among the new men is<br />\nic-, work, \"The Problems of Philisopher.\" The opinion of our phi- Dr. Max Bodenstein, professor of<br />\nlosophy prof that Mr. Russell oc- physical chemistry at the University<br />\ncupies a prominent place in the of Berlin. Professor Bodenstein is<br />\npresent philosophic situation only<br />\nJames Speyer visiting professor for<br />\nadded to our opinion. Therefore,<br />\nit was with some degree of surprise the year. This chair was made<br />\nUP-TOWN SHOP<br />\nDOWN-TOWN SHOP<br />\nand not a little disappointment that possible by the gift of Mr. James<br />\nNorth<br />\nCharles<br />\n&<br />\nCalvert<br />\n& Fayette<br />\nwe read the following account of Speyer who gave $50,000 to the<br />\nOPEN ALL NIGHT<br />\nMr. Russell's address before an as- University for the purpose of ens(mbly in Bethlehem. The account abling a German professor of interwas deprecatory, to say the least.<br />\nnational reputation in his field to<br />\nThe reporter of the Lafayette had<br />\nseveral months in the Unispend<br />\nthis to say of the philosopher and<br />\nNEW<br />\nUSED<br />\nversity. Dr. Bodenstein has already<br />\nhis speech:<br />\n\"Perhaps Bertrand Russell is the begun a series of lectures before<br />\ncreative genius back of the jibes at students and faculty of the chemthe newspapers, super-salesmen and istry department.<br />\nefficiency methods, yet the fact<br />\nThe vacancy left by the death of<br />\nstands that these qiups have by<br />\nDr. Paul Haupt, late head of the<br />\nnow become sophomoric and are<br />\nthe stock-in-trade of the profession- Oriental Seminary, has been filled<br />\nal lecturer. Once, in a distant past, after several years' delay by the<br />\nthey would have brought roars of appointment of Dr. W. F. Albright.<br />\nTHE BACKUS MOTOR COMPANY<br />\nlaughter, for then they were sparkThe William Wallace King lec10-20 E. North Avenue<br />\nling novelties; now they decorate tureship in Psychology will be held<br />\nthe pages of five-cent magazines and for the ensuing year by Professor<br />\nVernon 4300<br />\nfall flat upon ears and eyes wearied Gustav Kafka, of the \"Technische<br />\nwith dull reciteration.<br />\nHauptschule\" in Dresden. Dr.<br />\n\"Just what good it is doing the Kafka is giving a course in comworthy people of Bethlehem to hear parative psychology on Tuesday<br />\nthe same thing every year or so is night.<br />\n'<br />\na dabatable matter. Perhaps some<br />\nDr. Charles Tansill, Professor of<br />\nFor Quick Reference<br />\nfew will find a vital message con- History at the American University,<br />\nHere is a companion for your hours of reading and study that will prove<br />\ncealed beneath the mass of irrel- has been appointed as lecturer in<br />\nits real value every time you consult it. A wealth of ready information on<br />\nevant and hackneyed humor and will history. His subject is the sources<br />\nwords, persons, places, is instantly yours in<br />\nform the nucleus of the intelligent of American History.<br />\nmovement toward the proper educaDr. Paul Dumont, of the Unition, Mr. Russell urged. But the<br />\nversity of Brussels is at present<br />\nmajority, it is probable, will utter<br />\nholding the position of visiting ProThe Best Abridged Dictionary<br />\nin some form or other the trenchant<br />\nbecause it is based upon the<br />\nfessor of Indology.<br />\ncomment of one departing listener,<br />\n\"Supreme Authority,\" WEBSTER'S NEW INTERNATIONAL<br />\nDr. Stephen d'Irsay, formerly<br />\n'It is not often that the people in<br />\nDICTIONARY. Contains 106,000<br />\nVocabulary Terms,includthe Lehigh Valley get to hear a man connected with the University of<br />\ning many New Words, with definitions, etymologies, pronunciations,<br />\nof Bertrand Russell's reputation.'\" Leipzig, has been appointed Asand indications of proper use—a dicsociate in the History of Medicine,<br />\ntionary of Biography —a Gazetteer—<br />\n****<br />\na special section showing, with illustrabeing one of the first to occupy a<br />\ntions, the rules of punctuation, use of<br />\nBeing Baltimoreans, we read with<br />\ncapitals, abbreviations, etc., etc.—foreign<br />\nposition in the recently established<br />\na great deal of interest and not a<br />\nwords and phrases-1,256 pages-1.700<br />\nDepartment of the History of Mediillustrations.<br />\nlittle pride that the Edgar Allan<br />\nThin -paper edition: Special Merriam Cloth, $5.00;<br />\ncine.<br />\nFabrdwid,$6.00; Leather,<br />\nPoe Society at the New York UniLook for the Circular Trade-Mark.<br />\nA<br />\nnumber<br />\nof<br />\nminor<br />\nappointments<br />\nversity is offering a $100 prize for<br />\nSee It At Your College Bookstore; or write for information to th.: Publishers. Free specimen pages if you mention this Paper.<br />\nthe best essay on the works of Poe. have also taken effect, including reG. & C. MERRIAM COMPANY<br />\nSpringfield, Mass.<br />\nsearch fellowships as well as faculty<br />\n****<br />\npositions.<br />\nThe student who is interested<br />\nmainly in activities of a social nature has long been decried. Such<br />\nappellations as \"tea hound,\" \"lounge<br />\nlizard,\" and \"jassers\" have been<br />\nput upon him. Even at Hopkins,<br />\nsome of us have come in for condemnation in this respect. The attendance at frequent tea-dances, one<br />\nsports' writer in a local newspaper<br />\nfeels, is the cause for the Black<br />\nand Blue's lack of success on the<br />\ngridiron.<br />\nIn all our perusals of college<br />\npapers, we have for the first time<br />\ncome upon a defense of the socalled \"lounge lizard.\" Our enthusiasm for this article was aroused<br />\nYou can't keep Sheaffer's Lifetime° performance<br />\nnot because we are entirely in syma secret. In 73 of America's 119 leading univerpathy with the \"jassers,\" but besities and colleges Sheaffer's swift, easy writing<br />\ncause this defense is somewhat out<br />\nand faultless service have placed Sheaffer's Lifeof the usual.<br />\ntime° first among all fountain pens in sales.*<br />\nThe \"tea hound,\" by participation<br />\nWhat pen, other than Sheaffer's Lifetime°, is<br />\nin social activities, it is felt, will<br />\nguaranteed for your entire life . . . against<br />\ngain invaluable training if he should<br />\neverythinA except loss? What pen has the<br />\nlater become a salesman, diplomat,<br />\nsmart lines and easy, restful-writing feel<br />\nor politician. If the \"tea hound\"<br />\nof Sheafrer's Balanced Lifetime°? There's<br />\nturns out to be a top-notcher he<br />\na reason for Sheaffer leadership. You'll<br />\nstands a good chance of managing<br />\nrecognize that the minute you try your<br />\na million-dollars. And since the<br />\nBalanced Lifetime° writing companearning power is the standard by<br />\nion! Do it today!<br />\nwhich men are now popularly<br />\njudged the \"jasser\" is taking adAt better stores everywhere<br />\nvantage of a training that puts him<br />\nfar ahead, in the matter of potential<br />\nAll fountain pens are Auaranteed against defects,<br />\nearning power, of the serious lads<br />\nbut Sheaffer's Lifetime° is guaranteed unconditionally for your life, and other Sheaffer products<br />\nwith the Phi Bete and Sigma Psi<br />\nare forever guaranteed against defect in materials<br />\nand workmanship. Green and black Lifetime°<br />\nboys.<br />\n<br />\ncfANIDWICIA<br />\nJiops<br />\n<br />\nBrown Zug—Grain<br />\n<br />\n111 E. Baltimore<br />\n<br />\nNew Appointments<br />\nMade to Faculty<br />\n<br />\nFOOT<br />\n<br />\nIn a recent edition of the Purdue<br />\nExponent, a news article was carried to the effect that a new boulevard in Lafayette, Ind. would soon<br />\nbe opened. The new artery was expected to provide a solution to the<br />\ntown's traffic problem. When our<br />\nir town's York Road is eventually<br />\nopened, we feel that the NEWS-LET(Continued on page 3, column 4)<br />\n<br />\nSHEAFFE<br />\nSAFETY SICRIP,<br />\nSuccessor to ink,50c.<br />\nRe-fills.3for25c.Practically non-breakable.<br />\ncan't spill. Carry it to<br />\n<br />\nclasses!<br />\n<br />\nPENS•PENCILS•DESK SETS•SKRIP<br />\nW.A.SHEAFFER PEN COMPANY•Fort Madison,Iowa, U.S.A.<br />\ngles. U.5. ha.011.<br />\nOW.A.IL P.0o. um<br />\n<br />\n*A recentsurvey made<br />\nby a disinterested organization showed<br />\nSheaffer's first in<br />\nfountain pen sales at<br />\n73 of America's 119<br />\nforemost seats of<br />\nlearning. Documents<br />\ncovering this survey<br />\nare available to anyone.<br />\n<br />\n\f", "format": "basic_html", "processed": "MENEM<br /><br />\nMOW<br /><br />\nPrice 5 Cents<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br /><br />\nCLASS OFFICERS<br />\nARE NOMINATED<br />\nWitchhawks Expected Before<br />\nElections<br />\nVOTING NEXT WEEK<br />\nNominations To Be Reopened<br />\nPrevious To Elections<br />\nDuring the past week meetings<br />\nof the Sophomore, Junior and Senior Classes were held in order to<br />\nnominate men for class offices.<br />\nOn Tuesday the 8th, the Junior<br />\nClass met. It was agreed that the<br />\nnominee for the presidency, who received the greatest amount of votes<br />\nshould be duly elected, and the nominee with the next greatest number<br />\nshould become vice-president. Lockard and Towbin were nominated for<br />\npresident. For secretary, Cone,<br />\nRutherford and Powell are the nominees; and for treasurer, Kyle,<br />\nBurk and MacDonald. Heinserling<br />\nwas nominated for sergeant-atarms.<br />\nTwo men represent the Junior<br />\nClass on the Student Council. For<br />\nthese two positions eight men were<br />\nnominated: Yellot, Powell, Bloom,<br />\nRuark, Schwartz, Lockha-rd, Meeks,<br />\nand Millard.<br />\nAnother meeting of the class will<br />\nbe held on Tuesday the 15th, at<br />\nwhich the nominations will be recpened and the elections held. The<br />\ntime for voting will be from 12.20<br />\nto 1 o'clock.<br />\nThe meeting of the Sophomore<br />\nClass was held on Monday the 7th.<br />\nAs in the Junior elections, election<br />\nof the president and vice-president<br />\nwill be fixed by the first and second<br />\ngreatest number of votes.<br /><br />\nCLASS ELECTIONS<br />\nTO BE HELD<br />\nThe elections of class officers and Student Council<br />\nrepresentatives of three upper<br />\nclasses will take place this<br />\nweek. The Junior election will<br />\nbe held today, at 12.20, in the<br />\nC. E. Hall, while the Sophomores will cast their ballots<br />\ntomorrow, at the same hour.<br />\nThe Senior election will take<br />\nplace Thursday, after assembly. Nominations will be reopened before the ballot is<br />\ntaken in all three meetings.<br />\nCLASS Elections to be held.<br /><br />\nU. S. C. ADDRESSED<br />\nBY DR. JACK HART<br />\nSpeaer Stresses Facing Of<br />\nIssues<br />\nOVER 100 PRESENT<br />\nBill Wilson Praises Levering<br />\nHall<br /><br />\nFRENCH PROF GIVES GEOGRAPHY<br />\nLESSON TO IGNORANT FRESHMAN<br />\n\"In time, he became captain of<br />\na pirate lugger of three cannon and<br />\na crew of sixty men, and the coasters of Jersey still remember his exploits.\"<br />\nThe foregoing English translation of a passage of Merimee's \"Tamango\" by a student in French One<br />\nwas interrupted at about the conclusion of the sentences by the instructor's unexpected and devastating, \"A propos, ou est Jersey ?\"<br />\nAfter this had been repeated a<br />\ncouple of times and finally translated into \"By the way, where is<br />\nJersey,\" the freshman, at last comprehended what was expected of<br />\nhim, rattled his cranium (i.e., shook<br />\nhis head) and slowly and sorrowfully replied that he did not know.<br />\n\"A not unusual answer for a<br />\nfreshman,\" caustically remarked the<br />\ninstructor who then proceeded to<br />\ntell of the French first-year men<br />\nwho thought that Texas was near<br />\nNew York and that Brazil and<br />\nArgentine were included among the<br />\nSouthern States, concluding with a<br />\nwithering \"Freshmen are like that.\"<br />\nUpon being interrogated as to<br />\nthe leading product of the Isle of<br />\nJersey, the potential future scholar<br />\nagain pleaded ignorance. The in-<br /><br />\nstructor then proceeded to provide<br />\nenlightenment on both the situation<br />\nand product (cows) and was, moreover, so charitable and educational<br />\nas to explain the difference between<br />\nJersey cows and those of the neighboring island of Guernsey. A last<br />\nchance was given the frosh to redeem himself in the eyes of his<br />\nclassmates.<br />\n, I was<br />\n\"By the way, S<br />\nwondering if you happened to know<br />\non what side of a cow to sit during the milking.\"<br />\nBut the fates were unkind, for<br />\nMinerva, goddess of wisdom, had<br />\nnever deigned to pour this highly<br />\ntechnical bit of knowledge into the<br />\nbewildered student's head. Another<br />\nmember of the class, upon being<br />\nasked, guessed, \"On the left side<br />\nI suppose.\"<br />\nThe matter was then put to a<br />\nvote, most of the class voting for<br />\nthe right side.<br />\nBut democracy was doomed to<br />\nbe discredited for the majority were<br />\nwrong. The left side is the one on<br />\nwhich to sit while milking a cow!<br />\nHowever little French the freshmen may have learned that period,<br />\nit is certain that they had acquired<br />\na valuable bit of technical information which may, perhaps, be useful<br />\non some future occasion. Quien<br />\nsabe?<br /><br />\nBARNSTORMERS TO<br />\nMEET MONDAY<br />\nDue to the fact that Walter B. (\"Pops\") Swindell,<br />\ncoach of the Barnstormers,<br />\nwas unable to attend the meeting last Wednesday, the election of the president of that<br />\nclub was postponed. A meeting for this purpose will be<br />\nheld Monday, October 14th, at<br />\n12.30 in the Barn. An election<br />\nwas necessitated by the fact<br />\nthat Jack Deets, president of<br />\nthe Barnstormers, did not return to Hopkins this fall.<br /><br />\nLIBRARY HAS MANY<br />\nNEW ADDITIONS<br />\nNet Accession Nearly 400,000<br />\nVolumes<br />\nRARE BIBLES DONATED<br />\nAnonymous Gift Provides For<br />\nLanier Alcove<br /><br />\nJAYS CLASH WITH<br />\nSPIDERS TOMORROW<br />\nHopkins Team's Backfield<br />\nBadly Crippled<br />\nRICHMOND STRONG<br />\nVan Orman Shifts His LineUp Considerably<br />\nTomorrow, when the Hopkins<br />\nteam trots out into the new stadium<br />\nof the University of Richmond, the<br />\nSoutherners will see a badly crippled team.<br />\nThe Jays will be greatly handicapped, but they will be stubborn,<br />\nhead-up, and wary. This is the<br />\nhird game of their schedule, and the<br />\nteam is anxious to chalk one up in<br />\nthe win column. Thus far the<br />\nchecks have been in the defeat<br />\ncolumn, Lehigh winning to the tune<br />\nof 26 to 0, and Juniata, 7 to 0.<br />\nIf the team can get a taste of<br />\none victory they will be better set<br />\nfor the remainder of the schedule.<br />\nWhen they first cross the goal line<br />\nof the Richmond field they will have<br />\nan incentive to keep them on the go<br />\nfor the rest of the season.<br /><br />\nJohns Hopkins' Library had a net<br />\naccession of 16,721 bound volumes<br />\nduring the past year. This large<br />\nLast Tuesday night Dr. Jack<br />\nquantity is well distributed, each deHart of the University of Pennpartment having received its quota<br />\nsylvania, addressed the opening<br />\nof the latest works. This addition<br />\nmeeting of the University Supper<br />\nbrings the total number of books in<br />\nSpiders Lose First<br />\nClub in Levering Hall. Over one<br />\nan<br />\n400,000,<br />\nRichmond,<br />\nhowever, will be a<br />\nnearly<br />\nthe<br />\nlibrary<br />\nup<br />\nto<br />\nhundred members of the club were<br />\nhard<br />\nteam<br />\nto<br />\nall<br />\nprevious<br />\nbeat. They are exsurpasses<br />\nwhich<br />\namount<br />\npresent when Walter Frey, chairLiberal<br />\nClub<br />\nto<br />\nTeam<br />\nCross Country<br />\nrecords and places the Hopkins Li- ceptionally strong this year, having<br />\nman, introduced the speaker of the<br />\nOrganize Monday brary high up in the list of univer- Quite a number of old men back<br />\nRounding Into Form<br />\nevening. Dr. Hart first related his<br />\nPlans for the activities of the<br />\nFor the past week the cross-counon the gridiron, and they will be<br />\ndifficulties in finding Levering Hall. try squad has been practicing dili- Johns Hopkins Liberal Club will sity libraries.<br />\ndefending their goal with plenty of<br />\nRare Bible Collection<br />\nsays that he had come over one gently in the afternoon at Home- be discussed at the organization<br />\nOf the new books, one of the power. Last week, in the opening<br />\nstreet that would make a perfect wood field under the direction of meeting to be held Monday at 1<br />\ngame of their season they lost to<br />\ngolf course-36 holes in every the coach, Mr. Hambleton. Several P. M. in room B, second floor, Lev- most notable groups is the Hoffman<br />\nering<br />\nHall.<br />\nAll<br />\nstudents,<br />\nboth<br />\ngradsome<br />\ncollection,<br />\nin<br />\nwhich<br />\nBiblical<br />\nmembers<br />\nof<br />\nlast<br />\nWake Forest by a score of 19 to 0.<br />\nyear's<br />\nsquad<br />\nare<br />\nJuniors Nominate<br />\nblock. He then remarked that he<br />\nand<br />\nuate<br />\nand<br />\nundergraduate,<br />\nwho<br />\nare<br />\nGerman<br />\nrare<br />\nEnglish,<br />\nFrench,<br />\nback.<br />\nThey<br />\nare<br />\nHerman<br />\nSchabel,<br />\nThe nominations were made as could be kept in Baltimore longer<br />\nThis game, which inaugurated a<br />\nfollows: President, Jefferson, Guild, than another well-known man of the perhaps the best cross-country, and interested in the advancement of Greek Bibles are exhibited. The en- new stadium, should have been won<br />\ntwo-mile runner in the Southern liberal thought are cordially invited tire collection was donated by Henry<br />\nDukehart and Shirley; treasurer,<br />\nby Richmond and they were very<br />\nsame name as he expected to stay<br />\nJ. Hilken and was placed in a specolleges; Bob Kelly, captain; Wm. to attend.<br />\nEngland, Jung, Shinoner, BialosThe purpose of the Club is to cial ebony case at the end of the disappointed over the loss. They're<br />\nMuller, H. Emerson, Ch. Waters,<br />\nkorski, and Goldberg; secretary, two full days.<br />\nInterpretation<br />\nCh. Reeder, and James Hancock. center attention upon the defects German stacks. This case will be going to try to avenge their disapLamont, Getting, Kronsberg, and<br />\nLevy; sergeant-at-arms, Getting,<br />\nDr. Hart becoming serious, All look promising and certainly, cf our economic and social system, marked in bronze in the near future. pointment by defeating Hopkins toWatts, Levy, Dorman, Ness, and lamented on the fact that many peo- according to the coach, will give a and to provide the student body with The library can be proud that this morrow, and since the Jays have<br />\na forum in which perfect freedom remarkable collection has been met two successive<br />\nYavelow ; Student Council, one rep- ple lived by rules and regulations fine showing this season.<br />\ndefeats, they<br />\nof<br />\nthought and opinion is allowed. added to its shelves.<br />\nAmong<br />\nthe<br />\nnew<br />\nentrants<br />\nthis<br />\nresentative from the Sophomore rarely interpreting things for themwant to get going. This makes the<br />\nClass, Shrieve, Small, Siegle, Ness, selves. He stated that the \"Y\" year are Sugerman, Edgerton and The policy followed is to have preNew Lanier Alcove<br />\nprospects for a good game very<br />\nGruver, Alrich, Lily, Perry, Sykes, should be an organization that Junge. The coach would like some pared talks by members on topics<br />\nanonymous<br />\ngift of $1,000 was favorable.<br />\nAn<br />\nand Watts.<br />\nshould help to interpret the facts of more freshmen and sophomores to within the scope of the Club's in- recently received for an alcove in<br />\nWhen the Jays arrive in RichIn accordance with the ruling that life and get the most out of it. He come out for the squad as five of terests, followed by questions and<br />\nmemory of Sydney Lanier. For the<br />\nno man may run for two offices, the emphasized the fact that the \"Y\" the old men are graduating this discussion.<br />\nbenefit of those to whom the name mond Saturday, they will have a<br />\nThe Liberal Club was formed last<br />\nfollowing withdrawals from nomi- should not be taken as another year. This practice also is beneis not yet familiar, it might be stated number of injured men with them<br />\nnation are expected: Levy from the campus activity, but as the center of ficial to men who intend to run dis- fall, and soon developed into one that Lanier was a well-known south- to bolster up the ranks if<br />\nnecessary.<br />\nsecretarial nomination; Ness and all activities. Dr. Hart advised the tance or play lacrosse, basketball, or of the most active and successful ern poet who studied at the Johns The backfield will<br />\nbe the worst hit<br />\nWatts from the nomination to the \"Y\" men to face up to the differ- football, because it develops a fast organizations of its kind in Ameri- Hopkins University and held the<br />\nby<br />\ncasualties.<br />\nJack<br />\nTurnbull will be<br />\ncontent<br />\ncircles.<br />\nNot<br />\ncan<br />\ncollegiate<br />\nStudent Council; and Getting from ences saying that lack of free foot movement in the men.<br />\nchair of English literature for many<br />\nlimited<br />\nto<br />\nmeetings<br />\nout<br />\nwith<br />\na<br />\nseries<br />\nof<br />\nbecause of an injured knee<br />\nthe run for sergeant-at<br />\nAmong some of this season's opspeech \"got his goat.\" The speaker<br />\n-arms.<br />\nyears. He was an excellent musician<br />\nDue to the fact that the Jewish continued saying that he believed it ponents who look very promising its own members, it successully as well, and the musical flow of his which was received in the Juniata<br />\nmembers of the class could not at- was better to throw a few flowers is St. Johns. \"If enough candidates promoted an Intercollegiate Liberal poems have facilitated their being game. Niells is handicapped betend a meeting on the 14th because without removing the pots instead come out to allow for good substi- Conference, attended by about 75 put to music many<br />\ntimes. His fav- cause of leg injury from last week's<br />\nof the observance of Yom Kippur, of constantly evading issues.<br />\ntution where necessary, we may students from more than a dozen orite instrument was the<br />\nflute. Many game. Merriken, whose arm has<br />\nthe elections will be held on Wedmake an excellent affair of this colleges. The conference, which manuscrips and<br />\npictures<br />\nowned by been bad since the beginning of the<br />\nCriticisms<br />\nmeet,\" said Coach Hambleton. Prac- was addressed by a series of notable Dr. Lanier, as well<br />\nnesday the 16th.<br />\nas<br />\nseveral<br />\nletters season will<br />\nstated<br />\nman<br />\nPennsylvania<br />\nThe<br />\nstill be on the injured<br />\ntice takes place every day at 4 speakers including Norman Thomas written in<br />\nhis<br />\nown<br />\nhand,<br />\nwill<br />\nbe<br />\nSeniors Meet<br />\ncaught<br />\nreligion<br />\nwas<br />\nhis belief that<br />\no'clock at Homewood field. A wel- and Father John A. Ryan, proved a placed in<br />\nthe alcove. One picture list. Numerous injuries, as well,<br />\nThe senior class held its meet- rather than taugh and it was useless<br />\ncome is extended to those who care remarkable stimulation to liberal in<br />\nparticular is of exceeding rarity. have weakened the line. Helm,<br />\ning, Purnell Hall presiding, yester- unless one could not get away<br />\naround and watch practice. thought in nearby colleges, and re- It is<br />\nto<br />\ncome<br />\nday. The first business was to go from it, and always carried it with<br />\nan enlarged photograph of the Nichols and Bialoskorsky are out<br />\nsulted in the strengthening of exactual<br />\noak which Lanier described with injured limbs. Towbin is in<br />\nthrough the customary proceedure him. He said that the \"Y\" should<br />\nisting clubs in a number of instituso<br />\nvividly<br />\nin his poetry. This was the fray once again, but his side is<br />\nof electing several students of the be glad that there were people who Cage Fund Drive<br />\ntions, and the formation of groups<br />\ndonated<br />\nto<br />\nthe alcove by R. A.<br />\nTo<br />\nBe<br />\nContinued<br />\nEngineering School (who skip their criticized it, and that these criticisms<br />\nin several others.<br />\nstill bothering him, and Powell, at<br />\nBaker<br />\nProvision<br />\nthird year) into the class.<br />\nwas made besides<br />\nBasketball enthusiasts will be inThis year, with most of last<br />\nshould be met fairly and squarely in<br />\ncenter, limps considerably when he<br />\nThe following men were voted every case.<br />\nterested to know that work is now year's members back and a large for a Lanier professorship. The<br />\nin: Bailey Bateman, Miller, New, Previous to Dr. Hart's speech, a being done toward the fund for number of new additions expected, work of commemorating within her walks.<br />\nJays Revamped<br />\nStafford, Williams, Redue, Mulli- short talk was made by Bill Wilson, the new cage.<br />\nthe Liberal Club promises to be halls, the great sons of Hopkins is<br />\nThe<br />\nteam,<br />\nwhich has been scrimken, Messiora, Flocks, Merchant, traveling \"Y\" secretary of the MidSeveral men are attempting to even more vigorous and successful a fine mission.<br />\ntnaging hard all week, has been deLedornis, Matthews, Nerstin, Gold- dle Atlantic Area, in which he obtain contributions substantial than before. It plans to repeat the<br />\nveloping a new set of plays, and<br />\nstein, Suigewald, Jones, Lipnich, praised Levering Hall, stating it enough to put the desires for a cage, Intercollegiate Conference, a n d<br />\nseveral new men will appear in the<br />\nShugar, Elliot, Muker, Stumph, was the best building of its kind in on the Hopkins Campus, on a seri- make it larger and more representa- Cotillion Club<br />\nline-up. The team will leave BaltiTo Hold Dance more this<br />\nRasserew, Krebs, Rouark, Carmine, the East if not in the entire United ous basis. It is expected that in tive than ever. Several large meetevening by boat. Toand Campbell.<br />\nthe near future these contributions ings, open to the general public,<br />\nThe Cotillion Club will hold its morrow morning they will arrive at<br />\nStates.<br />\nThe following men were nomiSeveral letters from former cab- will be received. When this expecta- and addressed by speakers of na- regular Saturday night dance to- West Point, Va., and will go direct<br />\nnated for the class offices:<br />\ninet members were read by Mr. E. tion becomes a fact, an active drive tional prominence, will probably be morrow at Levering Hall. The to the University of Richmond by<br />\nPresident, Brownley, Waring, A. Schaal, executive secretary at will be started among the alumni held. The weekly program is now dance is scheduled to start prompt- bus. After the game, tomorrow<br />\nbeing mapped out by the officers.<br />\nNichel, Gettemuller, Linthicum, Hopkins in which Levering Hall and on the campus.<br />\nly at 9 o'clock with Bob Iula fur- evening, the Blue team will return<br />\nPurnell. Student Council, Gump, was highly praised. All these letters<br />\nMeetings will be held every Mon- nishing the music. The admission home by the same route instead of<br />\nEvery student in the University<br />\nCampbell and Hull; Secretary, were from men who expressed re- should realize the pressing need day, at the time and place men- will be $1.00, stag or couple.<br />\nspending the week-end in RichLove, Scheidt, Passerew ; Treasur- grets that they would not attend for this building; and when the tioned. Everyone interested in the<br />\nIt is hoped that the dances will mond.<br />\ner, McAll, Marks, Reck ; Sergeant- the first meeting of the University drive conies subscriptions should be discussion of liberal ideas is wel- continue to be as successful as the<br />\nCoach Van Orman has not yet<br />\nat-Arms,<br />\ncome.<br />\nwilling and plentiful.<br />\nopening dance held last week.<br />\nFerini and Keys.<br />\nSupper Club in Levering Hall.<br />\n(Continued on page 3, column 4)<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br /><br />\nTIIE<br /><br />\nHOPKINSIIEWSUTTER<br /><br />\nVICTORIAE GLORIA MERGES<br />\nBY SYLVAN LEBOW<br /><br />\nThe great majority of fresh- year—naturally those rating highmen who come to a university like est in scholarship. A freshman must<br />\napply himself immediately if he has<br />\nSubscription<br />\n$2.00 the Johns Hopkins, usually take too<br />\naspirations to Phi Beta Kappa, for<br />\nlong a time to become acclimated<br />\nevery<br />\nscholastic step taken by the<br />\nEntered as second-class matter Oecember 3, 1909, at the Postoffice in Baltimore, to their surroundings. This is a<br />\nstudents in each of his four years is<br />\nMd., under the Act of Congress November 3, 1879.<br />\ngreat injustice to themselves, as well judged. Only those pursuing the A.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins as a great sacrifice on the part of B., Ph. D., or M. D. courses are<br />\nUniversity.<br />\ntheir studies. Many students of the eligible for membership. The engineers have Tau Beta Pi to look forBusiness communications should be addressed to the BUSINESS MANAGER. entering classes have fine personaliJohns Hopkins University. All articles should be sent to the MANAGING EDITOR; ties, are naturally good students; ward to in the same light that the<br />\nother communications to the EDITOR-IN-CHIEF.<br />\narts students look forward to \" Phi<br />\nand thus have exceptional possibili- 13ete.\"<br />\nUniversity 0100 ties. Several of them have left enTelephone<br />\nNext in importance to Phi Bete<br />\nviable records behind them at prep- is the campus activities honor soEDITORIAL DEPARTMENT<br />\naratory schools, scholastically as ciety, Omicron Delta Kappa. The<br />\nEditor-in-Chief<br />\nwell as in activities. However, when \"0. D. K's\" are those men who<br />\nGEORGE GUMP,'30<br />\nthey get to college amid new sur- have excelled in the various activities which the university affords.<br />\nManaging Editor<br />\nroundings, and become subject to<br />\nAfter all, one does not come to colROBERT S. BAIRD, '30<br />\nthe knocks which accompany the lege merely for the purpose<br />\nof<br />\nAssistant Managing Editors<br />\ntransition from loudly high school reaching scholastic heights. There<br />\nRICHARD HUNT,'31 GEOFGE DOWELL,'31<br />\nsenior to inconspicuous \"Freshie,\" ought to be other things involved,<br />\nAssociate Editors<br />\nPAUL SPEAR, '30<br />\nSIDNEY WOLK, '30<br />\nthey seem to fall into a rut of one of which should be activities.<br />\ninactivity, and thus waste many A noted educator has said that if<br />\nJunior Editors<br />\nPURNELL HALL,'30<br />\nSTEWART L. SMITH, '30<br />\na precious minute of their time. he had the chance to go through colNESS,<br />\n'32<br />\nMcD.<br />\nROWLAND<br />\nJR.,<br />\n'31<br />\nMuLLIKIN,<br />\nHOWARD F.<br />\nThe years roll by quickly; fresh- lege once again, he would strive to<br />\nNATHAN M. HARRIS, '32<br />\nFRANK CONE, '31<br />\nSYLVAN LEBOW, '32<br />\nmen become upperclassmen, and make an average of just about eight,<br />\nGEORGE TRATTNER, '30<br />\nas they are preparing for grad- would go out for two activities<br />\nBUSINESS DEPARTMENT<br />\nuation, their past appears before (one athletic and one non-athletic),<br />\nGus BURKE, '31<br />\nthem like an open book, many a would endeavor to have a good time<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nchapter of which has been left &amp;t each one of these things, and<br />\nLYLE GULLEY '31<br />\nSADLER ROBERTSON, '31<br />\nblank due to idling on the part of would try to take away with him<br />\nOffice Manager<br />\nthe individual, or perhaps due to a something more than mere book<br />\nALvIN &amp;um,'30<br />\npursuit of endeavors along useless knowledge. Of course, some may<br />\nRandolph Rothchild, '31<br />\nSidney Ruffel, '31<br />\nchannels. The only chapter which dispute his theory, but many a \"Phi<br />\nJohn A. Jamison, '31<br />\nDavid S. Sykes, '32<br />\nHenry V. Saunders, '32<br />\nTheodore Fleishman, '31<br />\nyet remains to be filled is the final Bete,\" you know, at the close of<br />\none,—commencement—and then, all his college career has taken a job<br />\nin a shoe store, started to sell subProduced by the R. L. Polk Printing Company 1930 Clifton Ave., Baltimore, Md. that remains of the four years of<br />\ncollege experience is memories. Col- scriptions to the \"Ladies' Home<br />\nlege, like anything else, is just what Journal,\" or what have you? \"0. D.<br />\none makes of it. It can make men or K.\" is idealistic in its principles of<br />\nbreak them. In four years a stu- service to the school, and the stresdent can definitely and distinctly sing of the importance of the vaprepare and plan his future course rious activities for the benefit of the<br />\nof action, but he can also waste student himself. Tappings to the sothese years, and still be as stagnant ciety are held hi-annually and the<br />\na creature at the lapse of the time \"victors\" are decorated with the<br />\nWORSE AND WORSE<br />\nas he was when he first entered the anciently known laurel leaf at the<br />\nand<br />\nyear<br />\nevery<br />\nworse<br />\nand<br />\nassembly.<br />\nworse<br />\ngrows<br />\nsection<br />\nOPKINS' cheering<br />\nportals of his alma mater.<br />\nblame;<br />\nnot<br />\nto<br />\nare<br />\ncheer-leaderes<br />\nThe<br />\nvalue.<br />\nit never was of much<br />\nThe Tudor and Stuart Club is<br />\nThe advice Dr. French, librarian<br />\ntheir function is merely to lead the songs and not to provide the<br />\nan<br />\nhonorary literary club which<br />\nof the university, gives to freshsingers. The fault lies with the undergraduate body as a whole and<br />\nwas<br />\nfounded by Sir William Osler.<br />\nmen is that they should try to adopt<br />\nthe freshman class in particular.<br />\nOnly<br />\nmen of exceptional literary<br />\nas their goal some of the many hontastes<br />\nand interests are admitted.<br />\nors, which can and are to be won by<br />\nThere are three divisions of the group that should be giving vocal<br />\nAdmissions<br />\nto the club are decided<br />\nundergraduates. He claims that the<br />\nsupport to the eleven. In the first place, half of the undergraduates<br />\nby a board of governors. The club<br />\nvast majority of underclassmen<br />\ndo not attend the games at all; secondly, many of those that do attend<br />\nlimits its membership to eight memknow very little of these honors,<br />\ndo not sit in the cheering section; thirdly, a major portion of those in<br />\nbers in each class.<br />\nwhich are well worth striving for.<br />\nthe rooting stands open their mouths only for the purpose of eating<br />\nThere are numerous prizes to<br />\nThe only time that those who fall<br />\npeanuts.<br />\ninto this great pool of mediocrity scholarships offered either by the<br />\nuniversity or through private<br />\nupper<br />\nthree<br />\nthe<br />\nwake up to the fact, that there ever<br />\nManifestly it is impossible to compel the members of<br />\nsources,—among<br />\nwhich are the<br />\nwhether<br />\nwere things to strive for (and right<br />\nclasses to attend the games. To make them pay their athletic fee<br />\n(Continued<br />\non<br />\npage<br />\n3, column 3)<br />\nthe<br />\nat arm's reach, too) is when the<br />\nthey are present or not seems to be the most effective solution of<br />\nis<br />\nnot<br />\nproblem. However, this system is already in force and its effect<br />\nawards are made and the student<br />\nas far-reaching as would be imagined. Each upperclassman should<br />\nfinds himself grumbling over the<br />\nBOOKS<br />\ncertainly be enough interested in all that pertains to Hopkins to devote<br />\ntact that he is a better man than<br />\nBought—Sold—Exchanged<br />\nSaturday afternoons to the teams. Football games are enjoyable enough<br />\nJack, and that he could have done<br />\nPIPPEN'S BOOK STORE<br />\nin themselves to ninety per cent of the college population to cause<br />\nbetter than Bill if only he were given<br />\nBooks on Nearly All Subjects<br />\n605 North Eutaw Street<br />\nalmost unanimous attendance at games. They like football and they<br />\na fair chance, etc., etc., ad infinitum.<br />\nare interested in Hopkins' teams, yet still they stay away.<br />\nThis is always the case, and it will<br />\ncontinue to be such until civilization<br />\nAs for the second problem, that of bringing the men together in<br />\nreaches a state of utopia,—which<br />\none body, we believe there is a remedy. If all the high school youngsters<br />\ngentle reader, is quite a long ways<br />\nthat now infest the stands were to be debarred from the cheering secoff.<br />\ntion, more Hopkins men would view the game from the wooden stands.<br />\nThere are many honors to be acLast Saturday the youngsters spoiled many a person's afternoon by<br />\nquired<br />\nby conscientious students<br />\namused<br />\nthem<br />\nSome<br />\nof<br />\nthrowing popcorn and peanuts around the seats.<br />\nwho<br />\ntop<br />\ntheir respective classes inused<br />\nwhen<br />\nbest<br />\nat<br />\nthemselves with pea-shooters, barbaric instruments<br />\ntellectually.<br />\nFirst of all it would be<br />\nwould<br />\nwhich<br />\nspace<br />\nskillfully. These Breakers of the Peace take up<br />\nproper<br />\nto<br />\nmention<br />\nPhi Beta Kappa.<br />\nothers<br />\nmany<br />\nout<br />\nordinarily be occupied by Hopkins men and they keep<br />\nPhi<br />\nBeta<br />\nKappa<br />\nis<br />\nthe oldest of the<br />\nout<br />\ncheering<br />\nby their very presence. Furthermore, they take delight in<br />\nGreek<br />\nletter<br />\nsocieties,<br />\nthe father of<br />\nIt<br />\nyells.<br />\nthe<br />\nof time purposely, thereby greatly reducing the effect of<br />\nthem<br />\nall,<br />\nfounded<br />\nin<br />\n1776<br />\nat Willthe<br />\nsee<br />\nis fine advertising for the college to allow these boys in to<br />\niam<br />\nand<br />\nMary<br />\nCollege.<br />\nIt<br />\nstarted<br />\nas<br />\nthe<br />\nview<br />\ngames and the practice should be continued, but they should<br />\na<br />\nsocial<br />\norganization,<br />\nas<br />\nwell<br />\nas<br />\nan<br />\nthe<br />\ngame from some other vantage point. The cheering section is<br />\nintellectural and scholastic order.<br />\nbest place on the field from which to view the action and we believe<br />\nthe<br />\nWith the establishment of chapthat the undergraduates would naturally gravitate thither once<br />\nYou're welcome anywhere in a<br />\nters at such schools as Yale and<br />\nyouthful menace is removed.<br />\nSaunders System car. Drive one<br />\nHarvard, and with the appearance<br />\nof our brand new Chryslers or<br />\nModel A Fords on your next party<br />\nThe third problem, that of getting the undergraduates to cooperate<br />\nof such orders as the Freemasons,<br />\nor date. By sharing e -r3enses two<br />\nwere<br />\nsection<br />\nrooting<br />\nonce<br />\nthe<br />\nsolved<br />\nwould<br />\nbe<br />\nwith the cheer-leaders<br />\nPhi Beta Kappa decided to do away<br />\nor more may have a fine large<br />\nfilled with Hopkins men. Cheering is contagious; the few who always<br />\nevening at small cost. Special low<br />\nwith its secrets, and take the form<br />\nrates on long trips.<br />\ngive the yells would soon diffuse their spirit among the remainder.<br />\nin which it now appears,—namely,<br />\nthe<br />\nGiven<br />\ncheer-leaders.<br />\nwith<br />\nthe<br />\nrests<br />\nFurther than this, the burden<br />\na scholastic honor society. The namaterial it is up to them to develop it. At present they have nothing<br />\ntional council of the society is very<br />\nto work with, but we believe that they can measure up to the work<br />\nparticular with the granting of charif given the opportunity.<br />\nters for chapters. Only certain universities of high standing are honThe freshmen must be considered separately. They are required to<br />\nored<br />\nwith chapters of the \"Phi<br />\nattend the games, but so far nothing has been done to see that they<br />\nBete.\"<br />\nOf course, in its present<br />\ncome. We suggest that the pre-game parade be revised and tags issued.<br />\nfrom<br />\nhere<br />\nat Hopkins, \"Phi bete\"<br />\nEach freshman not having his tag should be made to answer to the<br />\nonly<br />\nconsiders<br />\nthose whose marks<br />\nsophomore class and a fit punishment be prescribed. Paddling, if<br />\nhigh; in fact, high<br />\nare<br />\nexceptionally<br />\nnecessary, can always be re-invoked as a corrective measure.<br />\nSS-2<br />\nscholastic attainments are the only<br />\n11 EAST NORTH AVENUE<br />\nrequisite.<br />\nOnly<br />\na<br />\ncertain<br />\nper<br />\ncentMake the freshmen attend all the games, banish the youngsters from<br />\nVernon 2704<br />\nage<br />\nof<br />\ntaken<br />\neach<br />\nstudents<br />\nare<br />\nin<br />\nthe cheering section, and the rest will take care of itself.<br />\nFOUNDED 1897<br /><br />\nEDITORIALS<br /><br />\nH1<br /><br />\nE<br /><br />\nPOPULAR<br /><br />\nBobby Lyons Announces:<br />\nthat if you want to see a pretty piece<br />\nof footwork, he'll be glad to show you<br />\nthe new Autumn styles in Hess shoes.<br />\nYou'll find him--and them--at The Barn<br /><br />\nN. HESS' SONS<br />\n8 E. Baltimore Street<br /><br />\nIF YOU \"MAJOR\" IN<br />\nTRANSPORTATION—<br />\nOne thing quickly becomes clear to students of transportation<br />\nproblems.<br />\nIt is the fact that in large cities the electric car lines with<br />\ntheir auxiliary coach and bus routes form the backbone of<br />\ntransportation.<br />\nIn this permanent and necessary public utility the problems<br />\nand principles involved are worth the notice and study of<br />\nevery young man interested in public service.<br />\nTHE UNITED RAILWAYS AND ELECTRIC CO.<br />\nof Baltimore<br /><br />\nNOW OPEN—<br />\nTHE<br />\nNEW<br /><br />\nSILVERNIAN<br /><br />\nBALTIMORE'S SMARTEST NIGHT CLUB<br /><br />\n823 CHARLES ST., NORTH<br />\nFeaturing Gus' Melody Boys and Novelty Entertainment<br />\nMinimum Charge $1.00<br />\nEvery Night<br /><br />\nRESERVATION<br />\nVERNON 7859-7203<br /><br />\nSaturdays and Holidays<br />\nCouvert Charge $1.00<br /><br />\nCORONA for College<br />\nCORONA leads the world<br />\non these 8 champion counts<br />\n1. STRENGTH: Strongest frame of any portable typewriter—solid one-piece Aluminum, rigidly braced.<br />\n2. SIMPLICITY: Fewer parts than any other standard-keyboard typewriter.<br />\n3. COMPLETENESS: More big-machine features than any other portable typewriter.<br />\n4. EASY TO LEARN: Corona design is the result of 20 years' study of the needs of<br />\nbeginners.<br />\n5. WAR SERVICE: An unequalled record for duration as the official portable of the<br />\nAllied Armies.<br />\n6. POPULARITY: There are over a million satisfied Corono owners.<br />\n7. DURABILITY: Coronas purchased 20 years ago are still giving satisfactory service.<br />\n8. BEAUTY: Graceful in line; exquisitely finished in every detail.<br /><br />\nM. W. LUCY &amp; COMPANY<br />\n104 West Fayette Street<br /><br />\nBALTIMORE, MARYLAND<br /><br />\nSTETSON CLOTHES<br />\nfor<br /><br />\nCollege OYCen<br /><br />\nNationally<br /><br />\nJustly<br /><br />\nKnown<br /><br />\nFamous<br /><br />\nMADE FOR YOU<br /><br />\nFOUR NORTH CHARLES STREET<br /><br />\n=MI<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br />\nVICTORIAE GLORIA<br />\nMERCES<br />\n(Continued from page 2, column 4)<br /><br />\nWarner &amp; Company<br />\n•<br />\nHats<br />\nClothing<br /><br />\n1<br /><br />\nand<br /><br />\nPurnishings<br />\nfor<br /><br />\nGenthmen<br />\n•<br />\n18 and 20 E. Baltimore Street<br /><br />\nN<br /><br />\ni<br /><br />\nc<br />\n-<br /><br />\nCLOTHES<br />\nCLOTHES<br />\n211-213 E. Baltimore<br /><br />\nA special selection of<br />\nWoolens---Suits to Ord<br /><br />\n$40<br /><br />\nAdams debating prizes, the De<br />\nToqueville medal, the Hollander<br />\nprize, the Rhodes, and other scholarships, as well as many other honors which a lack of space does not<br />\npermit going into details about.<br />\nAnd yet some freshmen (enough<br />\nupperclassmen, as well) seem to<br />\nadopt the attitude that there is nothing to work for.<br />\nThe greatest of all respect is self<br />\nrespect. If a man, at the end of his<br />\ncollege career, realizes that he has<br />\nfound out just what he is best suited for in life, he has done a wonderful thing, and will, by this early<br />\nstart in life, be out in the world advancing by leaps and bounds ahead<br />\nof his less fortunate brothers. Dr.<br />\nAmes, in his former capacity as<br />\ndean, often brought out the fact<br />\nthat college men should try to find<br />\nthemselves as soon as possible and<br />\nthen work as hard as they could<br />\ntoward their goal and ideal.<br />\nInterviews with members of the<br />\nfaculty are not to be sneezed at.<br />\nRather than come face to face with<br />\nhis \"profs\" in a frank, informal<br />\nway, many students may avoid priN ate interviews with them all during<br />\ntheir collegiate life. Not all faculty<br />\nmembers are as ferocious as they<br />\nseem to be, and you may rest assured that a good many of them are<br />\njust waiting for you to drop up to<br />\ntheir offices so that they may show<br />\noff some of their first editions, and<br />\nyou can also feel safe to uncover<br />\nyour troubles to them, for they will<br />\nlisten attentively and render sage<br />\nadvice. And say, how about our<br />\nnew<br />\ndistinguished-looking dean?<br />\nYou know what they say about \"the<br />\nman who smokes a pipe.\"<br /><br />\n3<br /><br />\nJAYS AND SPIDERS MEET<br />\n(Continued from page 1, column 6)<br /><br />\ncome to a decision on the final lineup for the Jay team. This line-up<br />\nwill probably not be known until<br />\nthe men go out on the field to arrange themselves for the kick-off.<br />\nThe tentative line-up, which, will,<br />\nno doubt, be changed considerably,<br />\nis:<br />\nPosition<br />\nRichmond<br />\nHopkins<br />\nTriplettL.E.<br />\nMiller<br />\nL.T.<br />\nKeating<br />\neyractet<br />\nL.G.<br />\nTowbin<br />\nC.<br />\nBelcher<br />\nPowell<br />\nMetcalf<br />\nLevy<br />\nR.G.<br />\nR.T.<br />\nLove<br />\nLee<br />\nKneip<br />\nR.E.<br />\nLandrum<br />\nGuild<br />\nQ.B.<br />\nDohrman<br />\nBledsoe<br />\nH.B.<br />\nMay<br />\nWeitzel<br />\nH.B. Gunter (c.)<br />\nHudart<br />\nF.B.<br />\nGroth<br /><br />\nChoosing<br />\nYourInvestment Banker<br />\nN choosing your investment banker it is of foremost importance to consider the financial responsibility and experience of the house.<br />\nGILLET &amp; COMPANY is an established investment banking house and has built up a<br />\nreputation among thousands of individual investors, banks, insurance companies and other large<br />\ninstitutions through offering sound securities and<br />\na complete investment service.<br /><br />\nINTERCOLLEGIATE NEWS<br /><br />\nClosely identified with the steady growth of<br />\nGillet &amp; Company is the Statistical Service which<br />\nis rendered to investors. The wide scope of this<br />\nservice provides continuous, dependable investment<br />\ninformation, placing at your disposal every facility<br />\nfor formulating and following a profitable investment program.<br /><br />\n(Continued from page 4, column 3)<br /><br />\nshould go on press with an extra<br />\nedition.<br /><br />\nTER<br /><br />\n* * * *<br /><br />\nA wrinkle in intelligence tests for<br />\nfreshmen is the inclusion of crossword puzzles. Freshmen at the University of Michigan are no longer<br />\nconfronted with the usual stock<br />\nquestions listed in the ordinary intelligence tests. Rather, freshmen<br />\nare confronted with such problems:<br />\nA word in five letters meaning a<br />\n'heavenly body with a long nebulous<br />\ntrail.\" The answer to which, of<br />\ncourse, is \"Angel.\" Also, something<br />\nof this sort: Four letters for<br />\n\"suitor.\" \"Sweetheart,\" for the<br />\nfreshmen is the obvious answer.<br />\nFreshmen this year find questions<br />\nlike these rather easy, says the<br />\nMichigan correspondent.<br /><br />\nGiLLET &amp; Co.<br />\nBANKERS<br />\nLIGHT &amp; REDWOOD STS.<br />\nBALTIMORE, MD.<br />\nTelephone PLaza 9060<br />\nWASHINGTON, D. C. PHILADELPHIA, PA. WILLIAMSPORT, PA.<br />\nEASTON, MD.<br /><br />\nBIRMINGHAM, ALA.<br /><br />\nof* fr<br /><br />\nRESERVED<br />\nFOR<br />\nIFINCHLEY<br />\nHATS<br /><br />\nMaybe there's<br />\nsomething<br />\nin it, after all<br />\nTrying outfor the editorial board, Simpson,<br />\n'33, is all energy. Here, there and everywhere to cover events, he is busy on the<br />\nwrite and rewrite—confident that<br />\nexperience will fit him for the post.<br />\nAnd Jones, his roommate,shows<br />\nequal determination in football.<br /><br />\n/<br /><br />\nTackling, bucking the line, practicing<br />\nsignals, he trusts to solid ground-work<br />\nto get him on the scrub this year.<br />\nGood training, both of them.<br />\nPerhaps there is something in high<br />\nscholarship, too. Industrial leaders<br />\nof today think so.<br /><br />\nliecitric<br />\nManu acturers...Purchasers...Distributors<br />\nSINCE<br /><br />\n1882<br /><br />\nFOR<br /><br />\nTHE<br /><br />\nBELL SYSTEM<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 11, 1929<br /><br />\nZ<br /><br />\nINTERCOLLEGIATE<br />\n- NEWS - -<br /><br />\nG<br /><br />\n$8.50<br /><br />\nA sturdy new shoe for young men with a generous measure<br />\nof style ... and priced to fit a Scotchman's purse.<br /><br />\nAN<br /><br />\n19 E. Lexington<br /><br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nPhone HOmewood 7908<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nBireley's Pharmacy<br /><br />\nHoles, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nDRESSES<br />\nREPAIR<br />\nALSO<br />\nSILK<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\nMoth<br />\nWE<br /><br />\nMake Our Store Your Store<br />\nYour Neighborhood Drug Store<br />\nST. PAUL at 33rd STREET<br /><br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br /><br />\nWERGLEY'S<br />\n2438 Charles St., North<br /><br />\nLa Patisserie<br />\nSANDWICHES PAR EXCELLENCE<br /><br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br /><br />\nJ. A. RITTER &amp; SON<br />\nFlorist's and Decorators<br />\n1918 NORTH CHARLES ST., Near 20TH<br /><br />\nBALTIMORE, MD.<br /><br />\nPhone: VErnon 0573<br /><br />\nTHE NORTH INN<br />\n3 East North Avenue<br />\n441.0-<br /><br />\nThe Meeting Place for College Men<br />\nAfter the Game or the Dance<br />\n440.0.<br /><br />\n\"Food Prepared the Right Way\"<br /><br />\n15c First Quarter Mile-5c Each Additional Quarter Mile<br /><br />\nCENTURY CAB CO.<br />\n1718 N. CHARLES STREET<br /><br />\nVERNON 7002<br />\nWe are promoting the cab business from an expensive luxury<br />\nto an economical necessity<br /><br />\nAfter the Dance<br />\nST. ILEC S<br />\n8<br /><br />\n- 7 North Charles Street<br /><br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and<br />\nLombard Sts.<br />\nPLaza 6000<br />\n1723-25 N.<br />\nCharles St.<br />\nVErnon 4049<br />\n2402 Pennsylvania Ave.<br />\nLAfayette 2000<br /><br />\nBuicks<br />\nChevrolets<br />\nChryslers<br />\nHupmobiles<br />\nWillys-Knights<br /><br />\nBaltimore Concedes Milestone Supremacy<br /><br />\nLIGHT<br />\nCOLORFUL<br />\nWARM<br />\nDRY<br /><br />\nIn any event<br />\nwear an<br /><br />\nLET rain, wind or chill sweep the field—you're dry and<br />\nwarm. Smartly dressed,too! Expertly styled in a wide range<br />\nof distinctive colors. For men and women, $7.50 to $25.<br />\nTHE ALLIGATOR COMPANY,St. Louis<br />\nProtect trouser legs—all colors to match all coats.<br />\nALLIGATOR (Pat.<br />\n.1Vew• STEPPER S App.for) $2 and $3.50 a pair.<br />\nAsk to see them.<br /><br />\nDRY<br /><br />\nFROM<br /><br />\nHEAD<br /><br />\nTO<br /><br />\n“Where we all meet<br />\nafter the big game\"<br /><br />\nFORD<br /><br />\nAutomobiles<br /><br />\nWEBSTER'S<br />\nCOLLEGIATE<br /><br />\nThe big majority<br />\nprefers Sheaffer's<br /><br />\npens,$8.75; Ladies',$7.50 and $8.25. Black and<br />\npearl De Luxe,$10.00; Ladies',$8.50 and $9.50.<br />\nPencils, $5.00. Others lower.<br /><br />\n* * * *<br /><br />\nALLIICAVIV 111<br />\nKEEP<br /><br />\nILGERS<br /><br />\nSeveral additions to the faculty<br />\nfor the academic year 1929-30 have<br />\nOur acquaintance with Mr. Ber- become effective with the opening<br />\ntrand Russell was fostered through<br />\nof the University.<br />\na study of that eminent philanthropForemost among the new men is<br />\nic-, work, \"The Problems of Philisopher.\" The opinion of our phi- Dr. Max Bodenstein, professor of<br />\nlosophy prof that Mr. Russell oc- physical chemistry at the University<br />\ncupies a prominent place in the of Berlin. Professor Bodenstein is<br />\npresent philosophic situation only<br />\nJames Speyer visiting professor for<br />\nadded to our opinion. Therefore,<br />\nit was with some degree of surprise the year. This chair was made<br />\nUP-TOWN SHOP<br />\nDOWN-TOWN SHOP<br />\nand not a little disappointment that possible by the gift of Mr. James<br />\nNorth<br />\nCharles<br />\n&amp;<br />\nCalvert<br />\n&amp; Fayette<br />\nwe read the following account of Speyer who gave $50,000 to the<br />\nOPEN ALL NIGHT<br />\nMr. Russell's address before an as- University for the purpose of ens(mbly in Bethlehem. The account abling a German professor of interwas deprecatory, to say the least.<br />\nnational reputation in his field to<br />\nThe reporter of the Lafayette had<br />\nseveral months in the Unispend<br />\nthis to say of the philosopher and<br />\nNEW<br />\nUSED<br />\nversity. Dr. Bodenstein has already<br />\nhis speech:<br />\n\"Perhaps Bertrand Russell is the begun a series of lectures before<br />\ncreative genius back of the jibes at students and faculty of the chemthe newspapers, super-salesmen and istry department.<br />\nefficiency methods, yet the fact<br />\nThe vacancy left by the death of<br />\nstands that these qiups have by<br />\nDr. Paul Haupt, late head of the<br />\nnow become sophomoric and are<br />\nthe stock-in-trade of the profession- Oriental Seminary, has been filled<br />\nal lecturer. Once, in a distant past, after several years' delay by the<br />\nthey would have brought roars of appointment of Dr. W. F. Albright.<br />\nTHE BACKUS MOTOR COMPANY<br />\nlaughter, for then they were sparkThe William Wallace King lec10-20 E. North Avenue<br />\nling novelties; now they decorate tureship in Psychology will be held<br />\nthe pages of five-cent magazines and for the ensuing year by Professor<br />\nVernon 4300<br />\nfall flat upon ears and eyes wearied Gustav Kafka, of the \"Technische<br />\nwith dull reciteration.<br />\nHauptschule\" in Dresden. Dr.<br />\n\"Just what good it is doing the Kafka is giving a course in comworthy people of Bethlehem to hear parative psychology on Tuesday<br />\nthe same thing every year or so is night.<br />\n'<br />\na dabatable matter. Perhaps some<br />\nDr. Charles Tansill, Professor of<br />\nFor Quick Reference<br />\nfew will find a vital message con- History at the American University,<br />\nHere is a companion for your hours of reading and study that will prove<br />\ncealed beneath the mass of irrel- has been appointed as lecturer in<br />\nits real value every time you consult it. A wealth of ready information on<br />\nevant and hackneyed humor and will history. His subject is the sources<br />\nwords, persons, places, is instantly yours in<br />\nform the nucleus of the intelligent of American History.<br />\nmovement toward the proper educaDr. Paul Dumont, of the Unition, Mr. Russell urged. But the<br />\nversity of Brussels is at present<br />\nmajority, it is probable, will utter<br />\nholding the position of visiting ProThe Best Abridged Dictionary<br />\nin some form or other the trenchant<br />\nbecause it is based upon the<br />\nfessor of Indology.<br />\ncomment of one departing listener,<br />\n\"Supreme Authority,\" WEBSTER'S NEW INTERNATIONAL<br />\nDr. Stephen d'Irsay, formerly<br />\n'It is not often that the people in<br />\nDICTIONARY. Contains 106,000<br />\nVocabulary Terms,includthe Lehigh Valley get to hear a man connected with the University of<br />\ning many New Words, with definitions, etymologies, pronunciations,<br />\nof Bertrand Russell's reputation.'\" Leipzig, has been appointed Asand indications of proper use—a dicsociate in the History of Medicine,<br />\ntionary of Biography —a Gazetteer—<br />\n****<br />\na special section showing, with illustrabeing one of the first to occupy a<br />\ntions, the rules of punctuation, use of<br />\nBeing Baltimoreans, we read with<br />\ncapitals, abbreviations, etc., etc.—foreign<br />\nposition in the recently established<br />\na great deal of interest and not a<br />\nwords and phrases-1,256 pages-1.700<br />\nDepartment of the History of Mediillustrations.<br />\nlittle pride that the Edgar Allan<br />\nThin -paper edition: Special Merriam Cloth, $5.00;<br />\ncine.<br />\nFabrdwid,$6.00; Leather,<br />\nPoe Society at the New York UniLook for the Circular Trade-Mark.<br />\nA<br />\nnumber<br />\nof<br />\nminor<br />\nappointments<br />\nversity is offering a $100 prize for<br />\nSee It At Your College Bookstore; or write for information to th.: Publishers. Free specimen pages if you mention this Paper.<br />\nthe best essay on the works of Poe. have also taken effect, including reG. &amp; C. MERRIAM COMPANY<br />\nSpringfield, Mass.<br />\nsearch fellowships as well as faculty<br />\n****<br />\npositions.<br />\nThe student who is interested<br />\nmainly in activities of a social nature has long been decried. Such<br />\nappellations as \"tea hound,\" \"lounge<br />\nlizard,\" and \"jassers\" have been<br />\nput upon him. Even at Hopkins,<br />\nsome of us have come in for condemnation in this respect. The attendance at frequent tea-dances, one<br />\nsports' writer in a local newspaper<br />\nfeels, is the cause for the Black<br />\nand Blue's lack of success on the<br />\ngridiron.<br />\nIn all our perusals of college<br />\npapers, we have for the first time<br />\ncome upon a defense of the socalled \"lounge lizard.\" Our enthusiasm for this article was aroused<br />\nYou can't keep Sheaffer's Lifetime° performance<br />\nnot because we are entirely in syma secret. In 73 of America's 119 leading univerpathy with the \"jassers,\" but besities and colleges Sheaffer's swift, easy writing<br />\ncause this defense is somewhat out<br />\nand faultless service have placed Sheaffer's Lifeof the usual.<br />\ntime° first among all fountain pens in sales.*<br />\nThe \"tea hound,\" by participation<br />\nWhat pen, other than Sheaffer's Lifetime°, is<br />\nin social activities, it is felt, will<br />\nguaranteed for your entire life . . . against<br />\ngain invaluable training if he should<br />\neverythinA except loss? What pen has the<br />\nlater become a salesman, diplomat,<br />\nsmart lines and easy, restful-writing feel<br />\nor politician. If the \"tea hound\"<br />\nof Sheafrer's Balanced Lifetime°? There's<br />\nturns out to be a top-notcher he<br />\na reason for Sheaffer leadership. You'll<br />\nstands a good chance of managing<br />\nrecognize that the minute you try your<br />\na million-dollars. And since the<br />\nBalanced Lifetime° writing companearning power is the standard by<br />\nion! Do it today!<br />\nwhich men are now popularly<br />\njudged the \"jasser\" is taking adAt better stores everywhere<br />\nvantage of a training that puts him<br />\nfar ahead, in the matter of potential<br />\nAll fountain pens are Auaranteed against defects,<br />\nearning power, of the serious lads<br />\nbut Sheaffer's Lifetime° is guaranteed unconditionally for your life, and other Sheaffer products<br />\nwith the Phi Bete and Sigma Psi<br />\nare forever guaranteed against defect in materials<br />\nand workmanship. Green and black Lifetime°<br />\nboys.<br /><br />\ncfANIDWICIA<br />\nJiops<br /><br />\nBrown Zug—Grain<br /><br />\n111 E. Baltimore<br /><br />\nNew Appointments<br />\nMade to Faculty<br /><br />\nFOOT<br /><br />\nIn a recent edition of the Purdue<br />\nExponent, a news article was carried to the effect that a new boulevard in Lafayette, Ind. would soon<br />\nbe opened. The new artery was expected to provide a solution to the<br />\ntown's traffic problem. When our<br />\nir town's York Road is eventually<br />\nopened, we feel that the NEWS-LET(Continued on page 3, column 4)<br /><br />\nSHEAFFE<br />\nSAFETY SICRIP,<br />\nSuccessor to ink,50c.<br />\nRe-fills.3for25c.Practically non-breakable.<br />\ncan't spill. Carry it to<br /><br />\nclasses!<br /><br />\nPENS•PENCILS•DESK SETS•SKRIP<br />\nW.A.SHEAFFER PEN COMPANY•Fort Madison,Iowa, U.S.A.<br />\ngles. U.5. ha.011.<br />\nOW.A.IL P.0o. um<br /><br />\n*A recentsurvey made<br />\nby a disinterested organization showed<br />\nSheaffer's first in<br />\nfountain pen sales at<br />\n73 of America's 119<br />\nforemost seats of<br />\nlearning. Documents<br />\ncovering this survey<br />\nare available to anyone.<br /><br />"}], "field_media_file": [{"target_id": 38330, "display": null, "description": null, "target_type": "file", "target_uuid": "f1e80f75-1a59-412e-9c63-87e946478a03", "url": "http://digital.library.jhu.edu/system/files/2022-03/13384-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13384, "target_type": "node", "target_uuid": "d7a527f8-e03d-4364-8491-87df11bb69e6", "url": "/node/13384"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "298deecb-0fc4-4529-a750-a193aacbfd3d"}]}