{"mid": [{"value": 37615}], "uuid": [{"value": "64d66a2f-0e89-4f29-b220-64b34adb5882"}], "vid": [{"value": 37615}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:36:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12185-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:36:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:36:15+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. XXXV, No. 7<br />\n<br />\nJULIAN HUXLEY TO<br />\nSPEAK AT HOPKINS<br />\nWill Talk on \"Travels and<br />\nPolitics in Africa\"<br />\nMADE AFRICAN TOUR<br />\nTo Lecture For Williams Foundation<br />\nJulian Huxley, famous English<br />\nwriter and biologist, will lecture at<br />\nHopkins on Tuesday, November<br />\n11, at 5 P. M. in room 120, C. E.<br />\nBuilding, Professor Lancaster,<br />\nchairman of the committee on lectures, announced today. Professor<br />\nHuxley is the grandson of the faMous Thomas H. Huxley, Victorian<br />\napostle of evolution.<br />\nProfessor Huxley is professor of<br />\nzoology at King's College, London.<br />\nHe is famous for his research as a<br />\nbiologist and for his books and<br />\nmagazine articles. He is co-author<br />\nWith H. G. Wells of The Science of<br />\nLife, which is soon to be published,<br />\nand has also written The Individual<br />\nin the Animal Kingdom, Essays of<br />\na Biologist, The Stream of Life and<br />\nEssays in Popular Science. He has<br />\nalso been a constant contributor to<br />\nwell-known English and American<br />\nauthors.<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., OCTOBER 31, 1930<br />\n<br />\nSENIOR PICTURES TO<br />\nBE TAKEN NEXT WEEK<br />\nRobert Mille r, business<br />\nmanager of the Hullabaloo,<br />\nannounced today that the pictures of the individual members of the Senior class will<br />\nbe taken by the White Studios<br />\nstarting early next week.<br />\nAll Seniors are urgently requested to report to the Hullabaloo office for appointments<br />\nfor individual sittings starting<br />\nMonday from 12:20 to 1 :00<br />\nP. M. Promptness will save<br />\ntime and energy and will result in better service, it was<br />\nstated.<br />\n<br />\nPrice 5 Cents<br />\n<br />\nPRUSSIAN MINISTER H. J. DIME ADDRESSES Jays Meet Haverford<br />\nSTUDENTS AT ASSEMBLY<br />\nIn Second Night Game<br />\nPRAISES EDUCATION<br />\nPoints Out Features of German<br />\nSystem<br />\n<br />\nFormer Actor Speaks On Psychology Of Vaudeville Stage<br />\n<br />\nTomorrow at Homewood<br />\n<br />\nSTATE CONTROL<br />\nMr. H. J. Dunne, former wellWas Minister Of Education In<br />\nThe Prussian Cabinet<br />\nknown actor and at present asso\"Education plays a very impor- ciated with the Gas & Electric Co.,<br />\ntant part in international relation- received a very warm ovation when<br />\nships,\" said Dr. Carl Heinrich he addressed the student assembly<br />\nBecker, for ten years Minister of<br />\nyesterday.<br />\nEducation in the Prussian Cabinet,<br />\nMr. Dunne chose as his topic<br />\nin a lecture presented Wednesday<br />\nfor the James Schouler Founda- \"The Psychology of the Old Vaudeville Stage,\" and proceeded to<br />\ntion.<br />\n\"Education is important in mu- analyze the vaudeville game.<br />\ntual understanding between naActs were placed on bills by<br />\ntions,\" he continued, \"and good agents who received a small<br />\ncut of<br />\nwill and practical knowledge dethe actors' pay, and a great deal of<br />\npend upon it.\"<br />\nDr. Becker is especially qualified psychology was employed in arto talk on this subject. For the ranging these bills.<br />\nTo Settle Audience<br />\npast twelve years, first as State<br />\nEvery show was preceded by a<br />\nSecretary of Education and later<br />\nas head of that department, he has motion picture, which had as its<br />\nbeen a leading factor in educational purpose the settling down of the<br />\naudience. The first act, which was<br />\nreform in Prussia.<br />\nusually an acrobatic one, was meant<br />\nEducation Different<br />\n\"In Germany,\" Dr. Becker con- to catch the eye, as was the second,<br />\ntinued, \"ideals of education are ex- which was invariably composed of<br />\nactly opposite those held in the a man and woman, the latter being<br />\nUnited States. Here the colleges quite attractive. The good-looking<br />\nand universities are mostly private; girl is meant to rivet all eyes on the<br />\neven the state university is free stage and draw the interest for the<br />\nfrom control by the officials of the rest of the show. The act must not<br />\nstate. In Germany, on the other be too good, because if it is it will<br />\nhand, all educational facilities are spoil the climax which must come<br />\nunder the direct and complete con- later. The gentleman in the act,<br />\ntrol of the state ministry of educa- said Mr. Dunne, is about as imtion. The Minister's authority ex- portant \"as the tail of a cow.\"<br />\nOther Features<br />\ntends over all schools, state and<br />\nThe<br />\nthird<br />\nact is always comical,<br />\nprivate. In /addition to this, the<br />\nusually<br />\na<br />\nquartet<br />\nof comedians.<br />\nMinister also exercises control over<br />\nNext<br />\ncame<br />\nthe<br />\nusual<br />\n\"extra added<br />\nthe churches, theaters, moving picattraction.\"<br />\nNow<br />\nthe<br />\nwhole strain<br />\nture houses, operas and museums.\"<br />\nof<br />\nthe<br />\nshow<br />\nis<br />\nbroken<br />\nby an interThorough Training<br />\nmission<br />\nand<br />\neverything<br />\nhas to begin<br />\nThe German educational system<br />\nall<br />\nover<br />\nagain.<br />\nAs<br />\na<br />\nresult,<br />\nact five<br />\nincludes training for all lines of<br />\nhas<br />\nto<br />\nbe<br />\na<br />\ncrackerjack<br />\none<br />\nthat<br />\nendeavor. It is obligatory for everyone to attend a state elementary will reopen the show with a bang.<br />\nschool for four years. This edu- Following this there was the worst<br />\ncation is free. Then the student act on the bill, one that was based<br />\nhas his choice of staying in the entirely on the name of the star. It<br />\nsame school for four more years at must be followed by the best on the<br />\nno cost, or he may attend a nine- bill. Number eight is another<br />\nyear secondary school, for which \"dumb\" act because of the people<br />\nthere is a tuition charge. Upon getting up and leaving.<br />\nMr. Dunne then told several<br />\ngraduation from this he is qualified<br />\nto enter a university. Thus his jokes • and concluded by singing<br />\nwork in the university is more ad- \"Ireland.\" This was followed by<br />\nvanced than that of the first two so much applause that he was<br />\nyears in an American college, and forced to sing two more numbers,<br />\n\"On the Road to Mandalay\" and<br />\ncorresponds to graduate work.<br />\n\"Mighty Lak a Rose.\"<br />\n(Continued on page 3, col. 2)<br />\n<br />\nTURNBULL HEADS<br />\nSTATE SCORERS<br />\nLeading 45 scorers in college football this season, Jack<br />\nTurnbull, Hopkins gridiron<br />\nstar, has, to date chalked up 45<br />\npoints. Seven touchdowns and<br />\nthree successful points after<br />\ntouchdowns are credited to the<br />\nJay back.<br />\nTurnbull's nearest competitor is Berger, University of<br />\nMaryland man, who has garnered 36 points in carrying<br />\nover six touchdowns. Next in<br />\norder are Kim, of Navy;<br />\nKoppe, of Western Maryland;<br />\nDoughty, of Western Maryland, all with 30 points; and<br />\nChalmers, of Maryland, with<br />\n29 points.<br />\nHudert and Reid, both of<br />\nthe Jay gridders, are tied with<br />\n17 other collegiate scorers for<br />\ntenth place on the list. Another Hopkins player, Bauer,<br />\nis tied for last place.<br />\nTurnbull, who leads the<br />\nfield, has received considerable<br />\nmention from sports writers<br />\nin local papers.<br />\n<br />\nHopkins Team To Entertain<br />\nQuaker Aggregation In Third Home Tilt of the Season<br />\nHOPKINS ELEVEN<br />\nPICKED TO WIN<br />\nBlack and Blue Should Avenge<br />\n32 to 8 Defeat Administered<br />\nBy the Pennsylvanians<br />\nLast Year<br />\n<br />\nAfter a two weeks' lapse, the<br />\nHomewood Field will again be the<br />\nscene of action when the Hopkins<br />\nteam meets the Haverford College<br />\neleven tomorrow night. This will<br />\nbe the second night game and the<br />\nMiss Elisabeth Gilman Daughthird home game of the season for<br />\nter of Former President Will<br />\nthe Blue Jays, who hope to add the<br />\nBe Heard In Levering Hall<br />\nPennsylvanians to their list of<br />\nvictims.<br />\nMiss Elisabeth Gilman, daughter<br />\nAfter being held scoreless in their<br />\nof Daniel Coit Gilman, first presithree early games, the visiting team<br />\ndent of the Johns Hopkins Univerfinally broke into the Scoring<br />\nsity, and candidate for Governor on<br />\ncolumn when they defeated Trinity<br />\nthe Socialist ticket, will speak to the<br />\nCollege, 11 to 7, last Saturday.<br />\nPrevious tilts had resulted in a 20Liberal Club and the Intercollegiate<br />\nto-0 defeat administered by UrGilman for Governor Club today<br />\nsinus, a scoreless tie with SusqueJust Returned From Africa<br />\nin Levering Hall at 1:15 P. M. All<br />\nhanna, and a 6-0 shutout received<br />\nProfessor Huxley has just restudents are invited to attend.<br />\nat the hands of Kenyon. This last<br />\nturned from a four-month tour of<br />\nMiss Gilman, a graduate of Hopgame looked as though it might end<br />\nEast Africa, undertaken for the<br />\nSociaactive<br />\nin<br />\nthe<br />\nkins,<br />\nhas<br />\nbeen<br />\nin<br />\na scoreless tie until Kenyon exeEnglish Colonial Office Advisory<br />\nCommittee on Native Education, list party for the past ten years.<br />\nJ. H. U. Band To Play At cuted a long pass in the .closing<br />\nand is especially qualified to lecture She is a member of the Socialist<br />\nGame Tomorrow Night minutes of the fray which resulted<br />\non the subject. His lecture, Travels<br />\nin the lone score of the game.<br />\nCommittee of the State of MaryTomorrow night at the Hopkinsand Politics in Tropical Africa, will land, of the Woman's City Club, the<br />\nHaverford Improving<br />\nhe illustrated by lantern slides.<br />\nHaverford game, the band will<br />\nIt<br />\nmay<br />\nbe seen, then, that HaverInternational Relations Club, and<br />\nT. H. Huxley's Grandson<br />\nford<br />\nhas<br />\nbeen steadily improving<br />\nmake<br />\nits<br />\ninitial<br />\nappearance.<br />\nmany other organizations in the<br />\nProfessor Huxley has a distinand<br />\nrounding<br />\ninto form slowly.<br />\nMr.<br />\nConverso, leader of the band<br />\nalso a National Diguished heritage. He is the grand- vicinity. She is<br />\nSeveral<br />\nof<br />\nlast<br />\nyear's players arc<br />\nhas arranged a group of band pieces<br />\nson of the famous Thomas H. Hux- rector of the League for Industrial<br />\nmissing<br />\nfrom<br />\nthe<br />\nranks this year,<br />\nand popular Hopkins songs to be<br />\nley, who spoke at the opening of the Democracy, of which the Johns<br />\nonly<br />\nConn,<br />\nHaverford<br />\ncaptain, and<br />\nchapter.<br />\nplayed by the band on Saturday Fields, a heavy tackle, are veterais<br />\nJohns Hopkins University, the son Hopkins Liberal Club is a<br />\nSocial Workers<br />\nof Leonard Huxley, who was alnight.<br />\nlinesmen. In the backfield Dothard<br />\nMiss Gilman has been very active<br />\nmost as famous as his father, and in social relief work for many years.<br />\nThe band, garbed in the R. 0. T. and Cadbury are the only letterthe descendant of Dr. Arnold of<br />\nShe has performed yeoman's servC. uniform, will present military men, although Simons, Battey and<br />\nRugby. He himself, moreover, is ice in West Virginia, and was espeformations including the \"H\" for- Logan also saw service last year.<br />\nfamous in his own right. He was cially active in relieving distress<br />\nThe team has been fortunate as far<br />\nmation on the football field before<br />\nin 1910 research associate traveling during<br />\nRailthe Western Maryland<br />\nas injuries are concerned and it is<br />\nthe game and between the halves.<br />\nin Germany for the Rice Institute road strike.<br />\nsuffered<br />\nThe formations have been re- believed that White, who<br />\nof Houston, Texas, and in 1912 was<br />\nThe Intercollegiate Gilman for<br />\na wrist injury, will be ready for<br />\nhearsed to a point of perfection and<br />\nappointed to an assistant professor- Governor Club was recently formed<br />\nduty tomorrow night. The only<br />\nare expected to appear quite specship in that place. He held this<br />\nat Hopkins in support of Miss Gilserious<br />\ninjury thus far was the loss<br />\ntacular.<br />\nPosition until 1916, when he re- man's candidacy for Governor. It<br />\nof<br />\na<br />\nveteran<br />\nend, Campbell, ;who<br />\nThe band will have its dress returned to London for -duty at the is composed of members of the Unidislocated<br />\nhis<br />\nshoulder<br />\nand will be<br />\nhearsal on Saturday at 6.30 P. M.<br />\nRome Offices. In 1918 he was staff versity interested in her candidacy<br />\nremainder<br />\nlost<br />\nthe<br />\nto<br />\nthe<br />\nteam<br />\nfor<br />\nAt this meeting there will be a comlieutenant attached to general head- and was formed under the sponsorof<br />\nthe<br />\nseason.<br />\nplete and careful rehearsal of all<br />\nquarters in Italy, and with the end ship of the Liberal Club and the<br />\nCoach Van Orman's Black,and<br />\nmusic and formations to be preof the war he became a fellow and League for Industrial Democracy.<br />\nBlue<br />\ngridders should be able to<br />\nsented that evening.<br />\nLEVERIAG HALL SCENE OF<br />\nsenior demonstrator in zoology at<br />\nThe topic of the speech will be<br />\ntake the measure of the PenpsylSHAMBLES AS STUDENTS SHAVE BARBER<br />\nNew College, Oxford.<br />\n\"The College Student and the Comvanians, although probably not<br />\nHe was one Of the organizers and ing Election.\" It will be given after<br />\nIt is conventional in all civilized razor. Ah, that lather! Like the Cotillion Board To Hold<br />\nwithout a battle.<br />\na member of the Oxford ExpediLast Year's Loss<br />\nthe luncheon of the two clubs, meet- countries for members of the ton- snow-capped peaks of the Alps,<br />\nDance Tomorrow Night<br />\ntion to Spitzbergen. After his re- ing together on the second floor of sorial sect to cater only to mer- and yet with all the softness and<br />\nIt will be recalled that last year<br />\nThere will be a Cotillion Board the Hopkins team travelled to<br />\nturn, Mr. Huxley became professor .Levering Hall. The regular cafe- chants, laborers, scholars and pro- pliability of a down quilt. And the<br />\ndance<br />\ntomorrow night directly folof zoology at King's College. After<br />\nteria luncheon will be served. Reser- fessional men. One never sees a razor! All the glittering purity of lowing the Haverford football Haverford to play this game. After<br />\nholding this position for two years, vations for this may be made with barber enter another barber's offices a true Damascus sabre.<br />\nleading in the first half by a ttnichgame, in Levering Hall. Bob Iula's down, they were forced. to p14 the<br />\nlie was, in 1927, made honorary<br />\nto<br />\nget<br />\nhis<br />\nlocks<br />\nshorn<br />\nor<br />\nhis<br />\nface<br />\nThe lather was applied gently<br />\nLazare Teper, president of the club.<br />\nlecturer there.<br />\ncleansed of a beard. And least of and dextrously by one of the boys Orchestra will furnish the music, latter part of the game in a heavy<br />\nExclusive Statement<br />\nProf. At Royal Institute<br />\nIn an exclusive statement to the all does a merchant or a laborer whose experience had encompassed Which will last from 9 till 12.<br />\ndownpour of rain. Haverford;takProfessor Huxley has been presi- NEWS-LETTER, Miss Gilman said: come into a<br />\nAll affairs, thus far, have been ing advantage of this, scored': five<br />\nbarber shop to shave work of artistic propensities. It<br />\ndent of the National Union of<br />\nWell attended by Hopkins students. touchdowns and won,,32 to 8. •.,This<br />\n\"I myself am a graduate of Hop- the barber.<br />\ncannot be said that the deft motions<br />\nScientific Workers for four years, kins, and since my father was its<br />\nAt Hopkins, on the other hand, of his hand can be compared to The charge for admission is $1.00 year the Jays are determined to<br />\nand is Fullerian professor of physifirst president, all my traditions are a group of students under the im- Rembrandt—it would not do to be- for stag or couple.<br />\navenge this defeat and plan to do it<br />\nology in the Royal Institute.<br />\nthere. I am very much honored that pression that the local barber little an old recognized master. But<br />\nwithout the aid of jive Pltivkis.<br />\nHe comes to Hopkins under the<br />\nNOTICE<br />\na club has been formed in support needed a shave, suggested that such talent should not be left to lie<br />\nQuite a number of.spectator:p are<br />\nStaunch support on the part of the<br />\nGeorge Huntington Williams Foun- of my candidacy.\"<br />\nsince he had always treated them dormant. The application of genius student body marked the returns of last expected to turn out to the game to<br />\ndation. Dr. Williams was first proMiss Gilman is one of a series of fairly, it seemed ethically manda- in a crisis is not to be scoffed at— week's appeal for the improvement of the see what improvement the team has<br />\ntennis courts on the Hopkins campus.<br />\nfessor of geology at the Johns Hopprominent leaders of liberal thought tory for the boys to reciprocate. although, rest assured, John is of It is proposed to levy a charge of 10 made since its last appearance at the<br />\nkins University. After his death,<br />\nin America who are appearing this John (the barber) seemed rather the oppostie opinion. He objected cents per hour for use of the courts, as local field. Against Lehigh they<br />\nis done at such universities as Columbia<br />\nseveral members of his family doyear before the Liberal Club.<br />\noverwhelmed by this generous offer when the creamy suds were intro- and Virginia. The money amassed in satisfied even the most pessimistic<br />\nnated a fund to the University,<br />\nThe Liberal Club meets every and, although it cannot be truth- duced into the recesses of his ears this way will be used to hire a man to that football teams at Hopkins were<br />\nkeep the courts in A-1 condition. The<br />\none-half of the income of which is Friday at 12:30 in Levering Hall,<br />\nfully stated here that he was in a and he writhed when his eyes re- courts will also be resurfaced, enclosed improving.<br />\nused for promoting investigation in<br />\nand the speaker begins at 1:15. It ductile mood, he at last consented ceived a generous sample of the and improved in every way.<br />\nThe probable line-ups will be as<br />\nthat department, and the rest is<br />\nThis movement will be under the<br />\nis the policy of the club to alternate to be placed in one of his luxurious pearly bubbles. To state that he supervision of the Student Activities follows:<br />\nused to secure \"a lecturer of disoutside speakers with speeches by chairs. That is, he consented when entertained an aversion to the soap Council.<br />\nPos.<br />\nHaverford<br />\nHopkins<br />\nAll students desirous of seeing this<br />\ntinguished attainments on some<br />\nmembers of the club. Joel Seid- seven or eight students impressed entering his mouth would be merely movement under way will kindly sign the Lang .........L.E<br />\nFoley<br />\ntopic of widespread contemporary<br />\nman, former president of the club, him with the sincerity of their mo- mentioning a terrific onslaught in a following ballot and place it in P. 0. Towbin<br />\nLT<br />\nFields<br />\nBox 502. All ballots must be in by Nointerest.\" The lectureship was inwill be the first member of the club tives. Four of the assailants will mild manner. It was with some vember 4th.<br />\nLevy .........L.G..... Barnhurst<br />\naugurated in 1920.<br />\nbear scars of the conflict for many difficulty that his six attendants.\")<br />\nto present a speech.<br />\nC. ....... Masland<br />\nHelm<br />\nrajj<br />\nThe club is one of the most well moons, for John is as agile with the (one became tender-hearted and<br />\nBaker<br />\nCurtwright<br />\nRG<br />\nATTENTION<br />\nknown of its kind in this section of razor in war time as in times of rushed to the soda-fountain for<br />\nBialaskorski(c)R T.<br />\nHarvey<br />\nToday, promptly at 12.30, there the country. It has been very active peace.<br />\nRE<br />\nYearly<br />\nConn (c)<br />\nsome Coca-Cola; he had hoped to<br />\nwill be a meeting of all candidates in bringing noted political leaders<br />\nThe door of the shop was bolted, make the lather more palatable)<br />\nLyons<br />\n. QB<br />\nLogan<br />\nfor the editorial<br />\nstaff of the NEWS- before the interested students, and a feathery mass of lather was con- kept him seated. Never before has<br />\nBauer<br />\nLH<br />\nWhite<br />\nLETTER. It is essential that all the expects to continue its program of cocted by a chemistry student, and a ship tossed at sea as the<br />\nTurnbull<br />\n..<br />\n.<br />\nR<br />\nH<br />\nDothard<br />\nHopkins<br />\nnew men be present at this time.<br />\nformer years.<br />\nan engineering lad sharpened a<br />\nOF MORE THAN 20,000,000 INT1 Reynolds<br />\nFB<br />\nTripp<br />\n(Continued on page 3, col. 2)<br />\n<br />\nSOCIALIST CANDIDATE FOR<br />\nGOVERNOR SPEAKS TODAY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1930<br />\n<br />\n2<br />\n<br />\nTHE<br />\n<br />\nII<br />\n<br />\nNEWRIETTER<br />\n<br />\nObservations<br />\nby MUDDY<br />\n<br />\nLast year, Dean Berry undertook tne part of those responsible and<br />\na laudable experiment. With almost it ought to be corrected as soon as<br />\nmachine-like accuracy he diagnosed possible. From educational, many<br />\n$2.00<br />\nSubscription<br />\nthe condition of the College of Arts reading courses have become farsiand Sciences, of which he had re- .al snaps. More definite restrictions<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore, cently been made Dean, and charted ought to be laid down, and reading<br />\nunder the Act of Congress November 3, 1879.<br />\na course for her to sail on future courses be barred in the sciences,<br />\nvoyages. With a little more polish- but permitted only to the English<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins ing of the edges before next fall, and foreign language departments,<br />\nUniversity.<br />\nthat course will have proved itself where the restrictions of those in<br />\nthe biggest success in the history charge are quite severe.<br />\nof our college.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nIn adapting itself to the new ColHe found a schedule, complex,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nbecause it was more suited to the lege of Arts and Sciences, the Gerwhim of the professor than to the man department showed itself quite<br />\nof the student. So, the liberal in discarding its favorite<br />\nopportunity<br />\nBelmont 8778<br />\nTelephone<br />\nold schedule was discarded, and re- method of instruction in German I,<br />\nplaced by the present one. This in favor of the newer type of readschedule, however, has several weak ing course. The undergraduates adEDITORIAL DEPARTMENT<br />\npoints. In the first place, it is quite mire this attitude. The French deEditor-in-Chief<br />\nscarce in early week 9.30's. That is partment, however, merely added<br />\nGEORGE H. DOWELL,'31<br />\nto say, there are too few subjects Ithe new type of reading course to<br />\nmeeting at 9.30 on Monday and the old-fashioned standard course.<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nTuesday. Wednesday half way sat- ,The undergraduates, who, probably<br />\nisfies itself, due to the fact that most in the first place were responsible<br />\nAssistant Managing Editors<br />\nlate week courses start at that time. for the new type of course were<br />\nSTLVAN LEBOW, '32<br />\nROWLAND McD. NESS, '32<br />\nprobably just a wee bit too hasty.<br />\nThere are some students even toGlancing through the catalogue,<br />\nday, who want substantial, old-fashJunior Editors<br />\nwe notice under the heading of<br />\nNATHAN M. HARRIS, '32<br />\nRAYMOND DUNN,'33<br />\nioned courses. For the benefit of<br />\nPhilosophy, what has properly been<br />\nHAROLD B. YUDKIN,'32<br />\nDONALD PROCTOR, '33<br />\n,these, one section of German ought<br />\nMELVIN GUDE, '33<br />\ntermed one of the best courses the<br />\nHARRY GOODMAN, '33<br />\nto be of the standard type, and the<br />\nHERBERT L. FRIEDBERG,'33<br />\nDAVID DOLOWITZ, '33<br />\nUniversity offers. It is the one<br />\nrest to be continued as the present<br />\nMARION GROVE, '33<br />\nJACK GREENFIELD, '33<br />\ncourse on the campus in which the<br />\nGerman I. If the German departtraits of a gentleman are best exment does not follow the FrenchBUSINESS DEPARTMENT<br />\nemplified. Here, reminiscence is<br />\nmen, the few scholars here, with a<br />\nbrought of the old clays of the UniBusiness Manager<br />\ninterest in classical literature<br />\ndeep<br />\nGus BURK, '31<br />\nversity, when scholars were made<br />\nbe handicapped—and some of<br />\nwill<br />\nmen, via the route of Latin and<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nthese students may be potential GerDAVID SYKES, '32<br />\nGEORGE W. LA MONT,'32<br />\nGreek. It is a course which forms<br />\nman professors.<br />\nthe background of modern society,<br />\nOffice Manager<br />\nISADOR GUTMAN, '33<br />\nscience and religion.<br />\nThere is still one \"black sheep\"<br />\nI am referring to the one course course listed in the catalogue of the<br />\nWu.suR BLoom,'33<br />\nCHARLES NEY, '33<br />\nMORTON ROME. '33<br />\nSimoN Ltrr, '33<br />\nthat brings our own Dr. Boas be- College of Arts and Sciences. That<br />\nfore us with the History of Phi- is Chemistry 477N, commonly<br />\nlosophy. Inadvertantly, no doubt, it called Dr. Duncan's Quantitative<br />\nfroduced by the R. L. Polk Printing Company, 1930 Clifton Ave., Baltimore, Md. is listed in the catalogue, as coming<br />\nAnalysis.<br />\non Wednesday, Thursday, and FriExcept f o r highly technical<br />\nday, at 10.30. This time almost courses, there is no course, which<br />\nautomatically cuts it off from the so completely supplies the rudiments<br />\nmajority of pre-medical students in of laboratory technique, as Quantithe University, who, by all the tative Chemistry. Dr. Thornton has<br />\nedicts of Sir William Osier, should helped to give this subject an exneed this course most.<br />\ncellent reputation at Hopkins. AcTENNIS<br />\nAccording to the present curricu- cordingly, there are a number of<br />\nlum, one is not permitted a science 'pre-medical students, numbering<br />\nE would like to recommend that every student sign and hand<br />\nin the first year of residence. Soph- many potential surgeons, who seek<br />\nin the ballot in today's NEWS-LETTER which will make possible<br />\nomore pre-meds usually elect In- admission to the study, both for<br />\nan improvement of the tennis courts. Unless a majority of the underorganic Chemistry and Physics; gaining an analytical mind, and for<br />\ngraduates do this, it will be impossible to improve the condition of<br />\nthe courts. The fee to be asked for the use of the courts is nominal.<br />\nboth of which conflict with the His- training a steady hand.<br />\nWe should think that all those using the courts would be glad to pay<br />\ntory of Philosophy, since Physics<br />\nIt was probably with this point<br />\nthis charge for the change that will result.<br />\nand Thursday at in mind, that the course was listed<br />\nWednesday<br />\nmeets<br />\nTo those who do not play tennis at Hopkins, we would like to<br />\n10.30, and Chemistry, Friday at that in the catalogue. Yet, in the first<br />\npoint out the fact that the tennis team deserves to have the courts<br />\ntime. In the junior year, the pre- lecture, pre-medical students are<br />\nimproved for its use. During the last four years the Jay team has not<br />\nlost a match to a State opponent. The record made against teams out<br />\nmed will avail himself of Biology, told by Dr. Duncan that they are<br />\nof the State has been very good. This year the material available is<br />\nand will again find a conflict. The not wanted, but would be tolerated,<br />\nbetter than ever and the services of an experienced coach have been<br />\nsenior year, usually finds the pre- merely because the course is techsecured for the first time. An excellent schedule with many of the<br />\nmed looking for culture. He usually nical.<br />\nbest teams in the East is being arranged.<br />\nThe same system has proved satisfactory at Columbia and Virturns for aid, to the grand old man<br />\nWith extreme grace on the part<br />\nginia and should meet with equal success at Hopkins. Sign your<br />\nof the University, Dr. Swartz, in of Dr. Thornton, this class was<br />\nballot and hand it in immediately!<br />\nGeology. However, doubt enters given space in his spotlessly-clean<br />\nhis mind when he finds that again, lab, and assigned a stiff list of exthere is a conflict with Philosophy, periments to complete.<br />\nand the ranks are split.<br />\nThe Biology department, through<br />\nGENTLEMEN?<br />\nstudents<br />\ntheir<br />\nsend<br />\nlong experience, found that a biSome advisers<br />\nof<br />\nHistory<br />\nin<br />\nological GEIST is developed by the<br />\nover into the course<br />\nUDGING from their actions at last week's assembly, the present<br />\nPhilosophy, given by Mr. Dorsey in use of free time in the laboratory—<br />\nJ Freshman class is proving an excellent illustration of how Freshthe College for Teachers. However, but some members of the Chemistry<br />\nmen should 4zot act. Dr. Halsey's audience was anything but orderly.<br />\nsuch should not be the case. Phi- department believe that the only<br />\nContinual disturbances among the underclassmen made it difficult for<br />\nthe speaker to hear himself talk. Hopkins prides itself on the fact<br />\nlosophy is only as educational as its human beings worth living are<br />\nthat its students are gentlemen. We hope that no visitors viewed<br />\nlecturer. Two classes may have the graduate students in the Chemistry<br />\nthis exhibition of gentlemanly conduct.<br />\nsame texts, and assignments in Phi- department.<br />\nIn his greeting to Freshmen Dr. Ames said,\"—few men are as<br />\nAccordingly, students in Chemisyet the class with the betlosophy,<br />\nunpleasant to their associates as bumptious Freshmen.\" A certain group<br />\nthe<br />\ngain<br />\ninvariably<br />\nwill<br />\n477N, are only permitted to use<br />\nlecturer<br />\n'try<br />\nter<br />\nDf this year's new men should decidedly be termed bumptious, and<br />\nthere is no doubt that they are unpleasant to their associates. Freshmen<br />\nthe laboratory two days a week, for<br />\ngreater knowledge.<br />\nregulations were abolished at Hopkins because it was thought that the<br />\nOur claim is not that Mr. Dorsey a maximum of six hours. Since<br />\nfirst year men would realize their responsibilities and conduct themis not capable, or a poor lecturer. 1 they can see life further than in<br />\nselves as gentlemen. If the present class does not change its entire<br />\nhave never seen him, or talked with chemical laboratories, they are only<br />\nattitude, we strongly recommend the restoration of regulations.\"<br />\nany of his pupils. Our claim is ,permitted to dabble in, and receive<br />\nmerely the fact that we know who a smattering knowledge of analytics.<br />\nWhen asked by the writer, Dr.<br />\nDr. Boas is he has been tried and<br />\ntested right here before other Thornton had no objection to use of<br />\nHOMECOMING<br />\nclasses of the University, and has ,free time in his laboratory by stuFTER playing away from home on two successive Saturdays, the<br />\na distinct reputation as a lecturer. dents in Chemistry 477N, provided<br />\nJay eleven meets Haverford at Homewood Field tomorrow<br />\nCertainly, the next catalogue ought 'they did not allow fumes to penenight. The Hopkins team was decisively beaten by Rutgers, but showed<br />\nlist this particular change in the 'trate the room. There is absolutely<br />\nto<br />\na reversal of form in defeating Swarthmore in a close contest last<br />\nat least to permit seniors no conflict in laboratory space with<br />\ncatalogue,<br />\nweek. This year's eleven to date has shown much potential power.<br />\nDr. Boas, and Dr. uch use of free time. It seems that<br />\nboth<br />\nenjoy<br />\nHaverford will be represented by a weaker team than usual, and<br />\nto<br />\nHopkins may be expected to win.<br />\nyear.<br />\nsame<br />\nit merely satiates a whim of a chemthe<br />\nin<br />\nSwartz<br />\nWe hope that a good crowd --\"'<br />\nist to refuse such admittance. If<br />\ncalled the homecoming game. Th[pp&<br />\nUnithe<br />\nsufficient reason cannot be given for<br />\nWhen reading courses in<br />\nthe annual contests with St. Johr„,<br />\nversity were first opened to un- the erection of the barrier, students<br />\nstudents attending the opening gall<br />\ndergraduates, they were probably ought not be told to \"work when I<br />\nbe due to the fact that many belic.,<br />\nR.E MD.<br />\nthe eleven that represented Hopki '<br />\nmeant to supplement the regular say, or drop the course\" but in adcan be no excuse of this kind off<br />\nwork of the student, with beneficial dition to regular work, ought to be<br />\nFactory<br />\nDue to the fact that the banc<br />\nIf such was the reason for permitted to round off their doubts,<br />\neffect.<br />\ncontest, we hope that the cheerinl<br />\n600 S. Pulaski Street<br />\na mistake was made on by a cautious extra analyses.<br />\norigin,<br />\ntheir<br />\ncouldn't be any worse than that exl<br />\n<br />\nST. REGIS<br />\n<br />\nFOUNDED 1897<br />\n<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br />\n<br />\nPhone Belmont 9696<br />\n<br />\nJimmie's Drive It Yourself, Inc.<br />\nNo Deposit Required<br />\nDrive It Yourself<br />\n<br />\nRent A Car<br />\n<br />\nBaltimore, Md.<br />\n<br />\n3313 Greenmount Ave.<br />\n<br />\nEDI1 ORIALS<br />\n<br />\nW<br />\n<br />\nA<br />\n<br />\nSONS<br />\n<br />\nEven<br />\n<br />\nbrain-workers<br />\nand frat-house fans get<br />\n<br />\n\"ATHLETE'S FOOT\"<br />\nOU don't have to be an athlete to get\"Athlete's Foot.\"<br />\nMen who do their daily dozen in<br />\nthe library giving the old bean a<br />\nbig workout; and the boys who<br />\ndo a mental marathon in class<br />\nbut never try for the track—as<br />\nwell as those who really do give<br />\ntheir muscles to Alma Mater—<br />\nany and all arejustso much good<br />\nred meat to the tiny germ which<br />\nhas spread this ringworm infection everywhere. Tinea trichophyton is its name and it's the<br />\ncause of \"Athlete's Foot.\"<br />\n<br />\ndressing-room floors. In spite of<br />\nmodern sanitation (you have to<br />\nboil socks 15 minutes to kill it<br />\nthis fungus parasite infects and<br />\nre-infects bare feet almost any<br />\ntime they come in contact with<br />\ndamp floors.<br />\n<br />\nIt lurks in the very places<br />\nwhere we all go for cleanliness<br />\nand health—on the edges of<br />\nswimming pools and showers—<br />\nin gymnasiums—on locker- and<br />\n<br />\nlocker as a preventive. Use it<br />\nafter every exposure of bare<br />\nfeet on damp floors. At all<br />\ndruggists — G1.25. W.F.Young,<br />\nInc., Springfield, Mass.<br />\n<br />\nY<br />\n<br />\nAbsorbine Jr. kills the<br />\ngerm of<br />\n\"ATHLETL'S FOOT\"<br />\n<br />\nTests in a famous New York<br />\n\"lab\" have revealed that Absorbine Jr. penetrates flesh-like<br />\ntissues deeply and that wherIn universities from Pennsyl- ever it penetrates,it KILLS the<br />\nvania to California, it has been ringworm germ.<br />\nfound that 50% of the men have<br />\nIt might not be a bad idea to<br />\nit. The U.S. Health Service has examine your feet tonight. At<br />\nreported that \"at least half of the first sign of redness between<br />\nall adults suffer from it at some toes,itching,peeling or blisters,<br />\ntime.\" Co-eds are not immune douse on Absorbine Jr., and<br />\nfrom this trouble, either.<br />\nkeep a bottle handy in your<br />\n<br />\nAbsorbine<br />\nFOR YEARS HAS RELIEVED SORE<br />\nMUSCLES, MUSCULAR ACHES, BRUISES,<br />\nB URNS, CUTS, SPRAINS, ABRASIONS<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1930<br />\n<br />\n3<br />\n<br />\nDr. Bearden To Address<br />\nProf. Chinard to Address German Orator to<br />\nOptical Society Of America Audience at Little Theatre<br />\nAddress German Club<br />\n<br />\nN.You can put on a corn roast<br />\nbarbecue, weiner party, etc.,<br />\nanytime,anywhere with Saunders System cars. A car for<br />\nfive costs less than rail fare.<br />\nGlad to serve your bunch.<br />\nCoupes, Sedans or Touring.<br />\n<br />\nN<br />\n<br />\nSAUNDERS SYSTEM<br />\n<br />\n11 East North Avenue<br />\nVernon 2704<br />\n<br />\nThe Optical Society of America,<br />\nwhich is holding its fifteenth annual meeting starting today at the<br />\nUniversity of Virginia, has invited<br />\nDr. J. A. Bearden of the Hopkins<br />\nfaculty to read a paper. Dr. Bearden<br />\nwill address the assembly on<br />\n\"Grating Measurements of X-Ray<br />\nLengths and their Significance.\" On<br />\nthe same program Prof. A. H.<br />\n•Compton of the University of Chicago and Prof. G. Merrit of Cornell. Both of these men will also<br />\ndiscuss different phases of the<br />\nX-Ray.<br />\n<br />\nRifle Club To<br />\nHold Meeting 7oday<br />\nThere will be an organization<br />\nmeeting of the Rifle Club today, at<br />\n12.30, in the South Loft of Gilman<br />\nHall. Anyone interested in the<br />\nRifle Club, ought to attend this<br />\nmeeting as matters of importance<br />\nto the organization will be discussed.<br />\nThe Rifle team is selected from<br />\nthe members of the Rifle Club who<br />\nmake the best scores.<br />\nThere are about 35 members<br />\nsigned up at present and more candidates are urged to come out.<br />\nGERMAN EDUCATION<br />\n<br />\n••••••••<br />\n<br />\nFor Better Cleaning and<br />\nDyeing<br />\n<br />\nFRIED'S<br />\n101 E. 21st St.<br />\n<br />\nBelmont 5501<br />\n<br />\nFOR SALE<br />\n<br />\n1928 Pontiac<br />\nCabriolet<br />\n(With rumble seat)<br />\n<br />\n$125<br />\nP.O. Box 923<br />\n<br />\nJ. H. FURST CO.<br />\nPRINTERS OF<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 Hopkins Place, Baltimore<br />\n<br />\nTHE NEW<br />\n099<br />\n<br />\n(Continued from page 1, col. 3)<br />\n<br />\nOn Monday, November 3, Professor Chinard will speak in French<br />\nat the Little Theatre, Howard<br />\nstreet at Franklin, between the acts<br />\nof the 8.30 performance of \"La<br />\nGrande Mate,\" a French talkingpicture featuring Maurice Chevalier, under the auspices of the Baltimore Group of the Alliance Francaise.<br />\nMonsieur Gaston Gille, a distinguished lecturer of the group,<br />\nwill speak on the topic \"La Renaissance de la France Contemporaine\" in Civil Engineering Building, Friday, November 21, at 5<br />\nP.M. All students are invited to<br />\nattend, especially French students.<br />\nProf. Gibert Chinard and Prof.<br />\nH. C. Lancaster are members of the<br />\nCommittee for the Group, here in<br />\nBaltimore.<br />\nOther lectures by distinguished<br />\nFrenchmen are being arranged, as<br />\nwell as French social and conversational evenings, dramatic and musical events, etc.<br />\n<br />\nOrchestra Needs Players<br />\n<br />\nThere is no choice of studies in a<br />\nOf Brass Instruments<br />\nGerman school, and emphasis is<br />\nBruce Peake, president of the<br />\nplaced on theory and intellectual Johns Hopkins Musical Club antraining rather than character build- nounces that there are still some<br />\ning. There is no over-emphasis of<br />\nvacancies in the brass section of the<br />\nathletics in Germany, but stress is<br />\nplaced on the making of scholars. 'Blue Jay Orchestra.<br />\nThere are also some positions<br />\nIn a statement to the NEWSopen in the Banjo-Mandolin Club.<br />\nLETTER, Dr. Becker said:<br />\n\"The American student, as I<br />\nThe orchestra meets every<br />\nhave come in contact with him, Thursday at 4 P. M.<br />\nseems to be a very lively and wideThe Banjo Club meets every<br />\nawake sort. He seems very charm- Thursday at<br />\n,9 o'clock in Levering<br />\ning, and I am very found of him.\" Hall.<br />\n<br />\nHerr Heinz Bockhacker of El-<br />\n<br />\nAn influence for<br />\nbetter dressing at<br />\nMaryland colleges!<br />\n<br />\nberfeld, Germany, who spoke last<br />\nweek in Washington at the Fifth<br />\nInternational<br />\n<br />\nOratorical<br />\n<br />\nContest,<br />\n<br />\nwill address the Johns Hopkins<br />\nDormitory German Club tomorrow<br />\nevening at 7:30 in Levering Hall<br />\non \"The Youth Movement in Germany.\" The speaker will approach<br />\nthe subject from a new point of<br />\nview. The public is cordially invited.<br />\n<br />\nCLOTHES<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nHerr Bockhacker was chosen<br />\namong hundreds of German \"Gymnasium\" students to represent his<br />\ncountry in the Washington contest.<br />\nIn the German National Contest<br />\nheld in Berlin the candidates were<br />\ngiven but two minutes' preparation<br />\nfor a ten-minute speech.<br />\n<br />\nHOPKINS STUDENTS EAT AT<br />\n<br />\nThe Stadium Restaurant<br />\nCor. Greenmount Avenue and 31st Street<br />\n<br />\nRENT A CAR<br />\n<br />\nThe German Club considers itself<br />\nfortunate to have as guest for its<br />\nfirst public meeting such a distinguished young German student,<br />\nabove all since his stay in America<br />\nis limited to two weeks.<br />\n<br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\nDeposit Not Required<br />\n<br />\n2125 HARFORD AVE.<br />\n<br />\nThe J. H. U. Dormitory German<br />\nClub was founded recently by the<br />\nGerman Exchange Student Jurgen<br />\nG. von Ludwiger with the purpose<br />\nof discussing German-American relations and furthering the speaking<br />\nand reading of German among the<br />\nstudents.<br />\n<br />\nSTEPPING<br />\n<br />\n111 W NORTH AVE.<br />\nPhone, Wolfe 1413<br />\n•<br />\n•<br />\n<br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br />\n<br />\nvwv<br />\n<br />\nThe Club will present a speaker<br />\nto the public once a month in Levering Hall and from time to time<br />\nmovies will be shown depicting German life and culture.<br />\n<br />\nLEVERING HALL SCENE OF SHAMBLES<br />\nAS STUDENTS SHAVE BARBER<br />\n(Continued from Page 1, col. 4)<br />\nfor an attendant to hold his head<br />\nbarber did in his chair. Lather flew,<br />\nin place; in fact, it was hardly<br />\nblood was drawn and a veritable<br />\nshambles was present. But still the necessary for any more assistance<br />\nbattle raged far into the afternoon, save for the few boys who grasped<br />\nwith none of the participants tiring. his legs and arms to prevent anIt must be admitted that John ex- other upheaval. When one concenhibited the strength and vitality of trates on the matter, he is inclined<br />\nhis Neopolitan ancestors—but to no to feel that a throat is a throat . . .<br />\navail.<br />\nand a healthy throat is far superior<br />\nAgain the white disguise was ad- to a wounded one. John certainly<br />\njusted and the razor stropped. The maintained a diplomatic front in<br />\noperation was precarious,but every- his quietude.<br />\nthing was sacrificed for speed.<br />\nSo no longer must you keep<br />\n\"After all,\" said the lad with the quiet when you hear of a cook<br />\nrazor, \"it isn't my face, and I've being tendered a testimonial bangot a class in ten minutes.\" It was quet or a student lecturing a propeculiar how quietly John sat in fessor, or even a man biting a dog.<br />\nplace during this phase of the For you have heard how a campus<br />\nprocess. No longer was it necessary barber has been shaved by students!<br />\n<br />\nOPERATE IT YOURSELF<br />\n<br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br />\n\"Food Prepared the Right Way\"<br />\n<br />\nINTO<br />\n<br />\nA<br />\n<br />\nMODERN<br />\n<br />\nWORLD<br />\n<br />\nOur Business is to Improve Your Appearance<br />\nBaltimore's Foremost Cleaners and Dyers<br />\n<br />\nKAYES'<br />\nCLEANERS AND DYERS<br />\n3 Suits Sponged and Pressed $1.00<br />\n<br />\n$1<br />\n<br />\nLadies' and Gent's Tailoring A Specialty<br />\nHats Blocked and Renovated of all kinds<br />\n<br />\n32nd Street Corner Abell<br />\n<br />\n$750<br />\n<br />\nPhone, Belmont 5816<br />\n<br />\nPatronize the<br />\n<br />\nThey shut the door on hybrid styles<br />\n<br />\nRoland Park Drug Store<br />\n<br />\nSmartest Coat<br />\non the Campus<br />\nCollege men who know what to<br />\nwear and how to wear it choose<br />\nAlligator \"50\"—the new College<br />\nCoat... Alligator\"50\"is a smart<br />\ndouble-breasted raglan —long—fullcut—roomy—full-belted, with big<br />\npatch pockets, and a convertible<br />\ncollar that gives extra protection<br />\naround the neck ... Light in<br />\nweight —semi-transparent —absolutely weather-proof. Four rich,<br />\noriginal colors —Deep Sea, Tan,<br />\nBlue,Black —and only $7.50!...<br />\nOther Alligator models from<br />\n$5.00 to $25.00.<br />\n<br />\nTHE ALLIGATOR CO.<br />\nSt. Louis, Mo.<br />\n<br />\nMORGAN and MILLARD<br />\nRoland Avenue and Upland Road<br />\n<br />\nQuantity production of equipment has long<br />\nbeen practiced by the telephone industry.<br />\nTelephone designers years ago shut the door<br />\non many hybrid styles—seeking first to work<br />\nout instruments which could best transmit the<br />\nvoice, then making these few types in great<br />\nquantities.<br />\n<br />\nSAMUEL KIRK & SON, Inc.<br />\n<br />\nThis standardization made possible concentrated study of manufacturing processes, and<br />\n<br />\nJewelers—Stationers—Silversmiths<br />\n<br />\nsteady improvement of them. For example,the<br />\nproduction of 15,000,000 switchboard lamps a<br />\nyear, all of one type, led to the development<br />\nof a highly special machine which does in a<br />\nfew minutes what once took an hour.<br />\nManufacturing engineers, with their early<br />\nstart in applying these ideas, have been able to<br />\ndevelop methods which in many cases have become industrial models. The opportunity is there!<br />\n<br />\nBELL SYSTEM<br />\n<br />\n421 North Charles Street<br />\nBaltimore, Md.<br />\nWRIST WATCHES FOR MEN<br />\nGIFTS IN SILVERWARE<br />\nDIAMONDS—WATCHES—CLOCKS—JEWELRY<br />\nFounded 1815<br />\nA<br />\n<br />\nNATION-WIDE SYSTEM<br />\n<br />\nOF<br />\n<br />\nMORE THAN 20,000,000 INTER-CONNECT/NG TELEPHONE:,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1930<br />\n<br />\n4<br />\n<br />\n,<br />\n<br />\nActivity Cards<br />\nSTUDENTS TO BE GIVEN<br />\nM.FARAL TO LECTURE ON Student<br />\nOn Hand At Post Office<br />\nTdRNBULL FOUNDATION Students who have not received BARNSTORMER STICKERS<br />\nTo Begin Addresses On \"Poetic their Activities Card should secure<br />\nCycle of King Arthur\"<br />\nthem at the post office in Gilman<br />\nNovember 6th<br />\nHall at their earliest convenience.<br />\nMonsieur Edmond Faral, professor of Medieval Latin Literature Only those who present their rein the College de France, will lec- ceipt from the treasurer's office,<br />\nture for the Percy Graeme Turnbull may receive this card.<br />\nLecture Foundation this year, the<br />\nThe Student's Activities Card enRegistrar's office announced today. titles a duly registered student to<br />\nThis is the twenty-seventh series of<br />\none copy of the Hullabaloo, one<br />\nlectures promoted by this foundayearly subscription to the NEWStion.<br />\nProfessor Faral has chosen as his LETTER, one yearly subscription to<br />\ntopic The Poetic Cycle of King the Black and Blue Jay, one ticket<br />\nArthur. The course of six lectures to the first Barnstormers' presentawill be given in French, and the tion, a ticket to the Home Conaspects of the subject will be fully cert of the Musical Club, admission<br />\ndiscussed. The lectures will be to all debates of the Debating Coungiven on November 6, 7, 13, 14, 20 cil, and a Y. M. C. A. Hand Book.<br />\nStudents who have not received<br />\nand 21, in room 120 of the Civil<br />\ncard should get their's imtheir<br />\nM.<br />\nP.<br />\n5<br />\nat<br />\nBuilding<br />\nEngineering<br />\nrnediately.<br />\nand<br />\nhour<br />\nThey will each last one<br />\nthe doors will be closed as soon as<br />\nSORRY!<br />\nthe lectures begin.<br />\nwishes to corNEWS-LETTER<br />\nThe<br />\nLectureship<br />\nOldest<br />\nThe lectureship is the oldest in rect the false impression conveyed<br />\nthe University. It was founded in by one of its reporters in an article<br />\n1889 in memory of Percy Graeme last week which had stated the<br />\nTurnbull by his parents two years music at the Fashion Show as being<br />\nafter his death, and the first lectures that of the Blue Jay Orchestra.<br />\nThis group has not as yet apwere given in 1891.<br />\nThe purpose of the lectureship is peared before any public gathering.<br />\nto present an annual course of lec- The NEWS-LETTER regrets this<br />\ntures on poetry by a man to be error.<br />\nchosen by the President from<br />\namong \"properly qualified authors, Jay Harriers To<br />\nwriters or professors of America or<br />\nMeet St. Johns<br />\nTomorrow at 3:30 P. M. the<br />\nEurope.\"<br />\nAmong the twenty-six famous Hopkins cross-country team will<br />\nlecturers who have appeared at the meet St. Johns at Annapolis. Yesuniversity under this lectureship terday the team journeyed to the<br />\nsince 1891 are Henry Van Dyke, State capitol for a preliminary run<br />\nHamilton W. Mabie, Paul Shorey, over the course.<br />\nThe Junior Varsity meets Tome<br />\nSir Walter Raleigh, Professor Edmond Legouis and Walter de la School at Port Deposit this afternoon.<br />\nMare.<br />\n<br />\nA National Institution<br />\n<br />\nPurely American<br />\n<br />\nWe ask answer to our query as to whether readers ever pay any<br />\nattention to NEWS-LErrER ads. To the first five who return this ad<br />\nto the correct advertiser, each will be given a meal gratis. Souvenirs to the next tweny-five.<br />\n<br />\nLook for the Orange Lights<br />\n<br />\nA Meal a Minute<br />\n<br />\nS. Jesse Robinson Made Barnstormer Publicity Manager<br />\nIn order to arouse interest outside of the campus, a very clever<br />\nadvertising campaign has been<br />\nworked out for the Barnstormers'<br />\nplay. The plays have always been<br />\na social success, but this year it is<br />\nhoped to make it even more so.<br />\nThere will be found next Monday<br />\nmorning in the postoffice box of<br />\neach Hopkins student a small and<br />\nattractive oblong sticker advertising<br />\nthis year's production, \"The Black<br />\nFlamingo,\" which is to take place<br />\nat the Lyric Theare on December<br />\n5th and 6th.<br />\nCooperation Urged<br />\n<br />\nis the wish of the publicity<br />\nstaff of the Barnstormers that<br />\neveryone cooperate with the Club<br />\nby displaying these stickers on his<br />\nautomobile or in ,any other conspicuous place so as to arouse the<br />\ninterest of the Baltimore public in<br />\nthe production. The new publicity<br />\nstaff under the direction of S. Jesse<br />\nRobinson feels that with its extensive advertising campaign this year's<br />\nundertaking should break a predent by making the show a big<br />\nfinancial success. A high goal is<br />\nbeing set this year so that the Club<br />\nmight operate on a more pretentious<br />\nscale in the future.<br />\nIt<br />\n<br />\nKENT TO BEGIN<br />\nTALKS NEXT FRIDAY<br />\nFrank R. Kent will deliver<br />\nthe first lecture of his course<br />\nin Practical Politics next Friday, November 7. The class,<br />\nwhich is open to all undergraduates, will convene in<br />\nRoom 101, Remsen Hall.<br />\nMr. Kent, who conducts the<br />\n\"Great Game of Politics\"<br />\ncolumn in the Baltimore Sun,<br />\nis considered one of the most<br />\nprominent commentators on<br />\npolitics. He is also managing<br />\neditor of the Sun, with which<br />\nhe has been connected since<br />\n1898, and editor-owner of<br />\nthe Maryland Almanac, a<br />\nyearly publication. He has<br />\nalso written four books on<br />\npolitics, which have had wide<br />\ncirculation.<br />\n<br />\nAt a conference of the swimming<br />\nofficials it was decided to hold a<br />\n.meeting of all candidates within the<br />\nnext week. A tentative swimming<br />\nschedule will then be announced<br />\nwith the names and events of the<br />\n, new men. It is requested that all<br />\ninterested ill swimming in any way,<br />\nwhether for team or manager positions, watch the NEWS-LETTER and<br />\nbulletin boards for further announcements.<br />\nWednesday, November 5, in the<br />\nBarn at 1 P. M. All men interested<br />\nin wrestling are urged to try out<br />\nfor the team. No experience is<br />\nnecessary.<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nin neckwear are the key to a man's dress . . . they give that<br />\ntouch of personal effectiveness.<br />\n\"The Store of Standard Values\"<br />\n:-:<br />\n<br />\nManhattan Shirts<br />\n<br />\nScotch Spun Neckwear<br />\n<br />\n7 DINNERS<br />\nGood Food<br />\n<br />\nHASSLINGER'S<br />\n3226<br />\n<br />\nGreenmount Avenue<br />\nJust Below 33rd Street<br />\n<br />\nNo Deposit Required of Hopkins Students<br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br />\n<br />\nCoupes<br />\nRoadsters<br />\nSedans<br />\n<br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles St.<br />\nVernon 4049<br />\n<br />\nPLaza 6000<br />\n<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\nSimon Ackerman Clothes<br />\n<br />\n128 W. Fayette Street<br />\n<br />\nQUICK<br />\n<br />\nsta<br />\nde:<br />\n<br />\nFOR THE START<br />\n<br />\nha<br />\n<br />\nSPEED<br />\nr t<br />\n<br />\nWashington, D. C.<br />\nMARTINIQUE<br />\n<br />\nHAMILTON HOTEL<br />\n14th at K Street—<br />\nIn the Heart of the City<br />\nSingle with bath $3.00 to $5.00<br />\nDouble with bath $5.00 to $8.00<br />\n<br />\nAutomobiles<br />\n<br />\nAMOCOGAS<br />\n—and it costs<br />\n<br />\nCAIRO HOTEL<br />\nQue St. at 16th—<br />\nWashington's tallest building<br />\nSingle with bath $3.00 to $3.50<br />\nDouble with bath $4.00 to $6.00<br />\n<br />\ndec<br />\n<br />\n... Tailors ...<br />\n<br />\nFORTHE STRETCH<br />\n<br />\nThese Hotels offer superior<br />\naccommodations for your<br />\nnext visit to<br />\n<br />\nUSED<br />\n<br />\nthc<br />\ndit<br />\ntha<br />\ntw,<br />\n<br />\n111c<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nPOWER<br />\n<br />\nHAIR CUTTING, 40 CENTS<br />\nSHAVING, 20 CENTS<br />\n<br />\n16th St. at M, Northwest—<br />\nIdeal for motorists<br />\nSingle with bath $3.00 to $4.00<br />\nDouble with bath $5.00 to $6.00<br />\n<br />\nFORD<br />\n<br />\nsoi<br />\nthe<br />\nses,<br />\nof<br />\nthe<br />\next<br />\nbef<br />\n<br />\nREADY TO WEAR<br />\n<br />\nFOR, THE FINISH<br />\n<br />\nNEW<br />\n<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br />\n<br />\npoi<br />\nthe<br />\nalb<br />\ncep<br />\nfur<br />\nof<br />\nexi<br />\nvis<br />\nto<br />\nof<br />\n<br />\njoi<br />\n<br />\nVernon 3436<br />\n<br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE ... MARYLAND<br />\n<br />\nNe<br />\n<br />\nLowest Prices<br />\n<br />\nTO RENT<br />\n<br />\nancg6Ai@ieTt_ll<br />\n<br />\nCC<br />\n<br />\nALL FOR<br />\n<br />\n'Wa<br />\n<br />\nJOHN LUSCO, Proprietor<br />\n<br />\nW. FRANKLIN STREET<br />\n<br />\nInterwoven Hose<br />\n<br />\nCollege Men Will Appreciate This<br />\n6 BREAKFASTS<br />\n$7.00<br />\n<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\nExpert Service Guaranteed<br />\n<br />\n313<br />\n<br />\n:-:<br />\n<br />\n11 East Baltimore Street<br />\n<br />\nMcPHERSON'S<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nLocated in the Northend Basement of<br />\nLevering Hall. For the convenience of<br />\nthe Student Body and the Faculty<br />\n<br />\nTuxedos and Cutaways<br />\n<br />\nseason's styles<br />\n<br />\niii<br />\n<br />\n,The Campus Barber<br />\nShop<br />\n<br />\nSULSKY<br />\n<br />\nThe<br />\n<br />\nSwimming Team<br />\nto Organize Next Week<br />\n<br />\nVan Orman Pledges Aid<br />\nTo Wrestling Association and he set the first practice for<br />\nDr. Ray Van Orman addressed<br />\nthe organization meeting of the<br />\nwrestling team yesterday and<br />\npledged his support to the new<br />\ngroup. The Athletic Association<br />\nis unable to finance a wrestling<br />\nteam; therefore, any coaching that<br />\nthe team may get must be given<br />\ngratis.<br />\nDr. Van Orman promised the<br />\nteam the use of some wrestling<br />\nmats. He also stated that he would<br />\nurge all football men to come out<br />\nfor wrestling, since the sport is<br />\nvery valuable in building up football men. Jacobson, who precipitated the idea of a wrestling team,<br />\nwas elected temporary manager,<br />\n<br />\nAutumn ShowinR---<br />\n<br />\nOf<br />\n<br />\nof<br />\n<br />\ntw<br />\n<br />\nof<br />\n<br />\nsa.<br />\na<br />\nSe<br />\n<br />\nPa<br />\nfie<br />\n<br />\nA<br />\nin,<br />\n<br />\n11)<br />\nPa<br />\nor<br />\n<br />\na<br />\n<br />\nA<br />\n<br />\nof<br />\n<br />\nqt<br />\n11-1<br />\n91<br />\n<br />\nat<br />\n<br />\ntF<br />\n<br />\ngl<br />\n1<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\ntlis<br />\nri<br />\n<br />\n•<br />\n•<br />\n<br />\nh;<br />\nfi<br />\n<br />\nCl<br />\n<br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20<br />\n<br />\nfi<br />\n<br />\nE. North Avenue<br />\nVernon 4300<br />\n<br />\nAFRICAN OIL COMPANN<br />\n./Mlop. Bellmore. MA.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. XXXV, No. 7<br /><br />\nJULIAN HUXLEY TO<br />\nSPEAK AT HOPKINS<br />\nWill Talk on \"Travels and<br />\nPolitics in Africa\"<br />\nMADE AFRICAN TOUR<br />\nTo Lecture For Williams Foundation<br />\nJulian Huxley, famous English<br />\nwriter and biologist, will lecture at<br />\nHopkins on Tuesday, November<br />\n11, at 5 P. M. in room 120, C. E.<br />\nBuilding, Professor Lancaster,<br />\nchairman of the committee on lectures, announced today. Professor<br />\nHuxley is the grandson of the faMous Thomas H. Huxley, Victorian<br />\napostle of evolution.<br />\nProfessor Huxley is professor of<br />\nzoology at King's College, London.<br />\nHe is famous for his research as a<br />\nbiologist and for his books and<br />\nmagazine articles. He is co-author<br />\nWith H. G. Wells of The Science of<br />\nLife, which is soon to be published,<br />\nand has also written The Individual<br />\nin the Animal Kingdom, Essays of<br />\na Biologist, The Stream of Life and<br />\nEssays in Popular Science. He has<br />\nalso been a constant contributor to<br />\nwell-known English and American<br />\nauthors.<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD, BALTIMORE, MD., OCTOBER 31, 1930<br /><br />\nSENIOR PICTURES TO<br />\nBE TAKEN NEXT WEEK<br />\nRobert Mille r, business<br />\nmanager of the Hullabaloo,<br />\nannounced today that the pictures of the individual members of the Senior class will<br />\nbe taken by the White Studios<br />\nstarting early next week.<br />\nAll Seniors are urgently requested to report to the Hullabaloo office for appointments<br />\nfor individual sittings starting<br />\nMonday from 12:20 to 1 :00<br />\nP. M. Promptness will save<br />\ntime and energy and will result in better service, it was<br />\nstated.<br /><br />\nPrice 5 Cents<br /><br />\nPRUSSIAN MINISTER H. J. DIME ADDRESSES Jays Meet Haverford<br />\nSTUDENTS AT ASSEMBLY<br />\nIn Second Night Game<br />\nPRAISES EDUCATION<br />\nPoints Out Features of German<br />\nSystem<br /><br />\nFormer Actor Speaks On Psychology Of Vaudeville Stage<br /><br />\nTomorrow at Homewood<br /><br />\nSTATE CONTROL<br />\nMr. H. J. Dunne, former wellWas Minister Of Education In<br />\nThe Prussian Cabinet<br />\nknown actor and at present asso\"Education plays a very impor- ciated with the Gas &amp; Electric Co.,<br />\ntant part in international relation- received a very warm ovation when<br />\nships,\" said Dr. Carl Heinrich he addressed the student assembly<br />\nBecker, for ten years Minister of<br />\nyesterday.<br />\nEducation in the Prussian Cabinet,<br />\nMr. Dunne chose as his topic<br />\nin a lecture presented Wednesday<br />\nfor the James Schouler Founda- \"The Psychology of the Old Vaudeville Stage,\" and proceeded to<br />\ntion.<br />\n\"Education is important in mu- analyze the vaudeville game.<br />\ntual understanding between naActs were placed on bills by<br />\ntions,\" he continued, \"and good agents who received a small<br />\ncut of<br />\nwill and practical knowledge dethe actors' pay, and a great deal of<br />\npend upon it.\"<br />\nDr. Becker is especially qualified psychology was employed in arto talk on this subject. For the ranging these bills.<br />\nTo Settle Audience<br />\npast twelve years, first as State<br />\nEvery show was preceded by a<br />\nSecretary of Education and later<br />\nas head of that department, he has motion picture, which had as its<br />\nbeen a leading factor in educational purpose the settling down of the<br />\naudience. The first act, which was<br />\nreform in Prussia.<br />\nusually an acrobatic one, was meant<br />\nEducation Different<br />\n\"In Germany,\" Dr. Becker con- to catch the eye, as was the second,<br />\ntinued, \"ideals of education are ex- which was invariably composed of<br />\nactly opposite those held in the a man and woman, the latter being<br />\nUnited States. Here the colleges quite attractive. The good-looking<br />\nand universities are mostly private; girl is meant to rivet all eyes on the<br />\neven the state university is free stage and draw the interest for the<br />\nfrom control by the officials of the rest of the show. The act must not<br />\nstate. In Germany, on the other be too good, because if it is it will<br />\nhand, all educational facilities are spoil the climax which must come<br />\nunder the direct and complete con- later. The gentleman in the act,<br />\ntrol of the state ministry of educa- said Mr. Dunne, is about as imtion. The Minister's authority ex- portant \"as the tail of a cow.\"<br />\nOther Features<br />\ntends over all schools, state and<br />\nThe<br />\nthird<br />\nact is always comical,<br />\nprivate. In /addition to this, the<br />\nusually<br />\na<br />\nquartet<br />\nof comedians.<br />\nMinister also exercises control over<br />\nNext<br />\ncame<br />\nthe<br />\nusual<br />\n\"extra added<br />\nthe churches, theaters, moving picattraction.\"<br />\nNow<br />\nthe<br />\nwhole strain<br />\nture houses, operas and museums.\"<br />\nof<br />\nthe<br />\nshow<br />\nis<br />\nbroken<br />\nby an interThorough Training<br />\nmission<br />\nand<br />\neverything<br />\nhas to begin<br />\nThe German educational system<br />\nall<br />\nover<br />\nagain.<br />\nAs<br />\na<br />\nresult,<br />\nact five<br />\nincludes training for all lines of<br />\nhas<br />\nto<br />\nbe<br />\na<br />\ncrackerjack<br />\none<br />\nthat<br />\nendeavor. It is obligatory for everyone to attend a state elementary will reopen the show with a bang.<br />\nschool for four years. This edu- Following this there was the worst<br />\ncation is free. Then the student act on the bill, one that was based<br />\nhas his choice of staying in the entirely on the name of the star. It<br />\nsame school for four more years at must be followed by the best on the<br />\nno cost, or he may attend a nine- bill. Number eight is another<br />\nyear secondary school, for which \"dumb\" act because of the people<br />\nthere is a tuition charge. Upon getting up and leaving.<br />\nMr. Dunne then told several<br />\ngraduation from this he is qualified<br />\nto enter a university. Thus his jokes • and concluded by singing<br />\nwork in the university is more ad- \"Ireland.\" This was followed by<br />\nvanced than that of the first two so much applause that he was<br />\nyears in an American college, and forced to sing two more numbers,<br />\n\"On the Road to Mandalay\" and<br />\ncorresponds to graduate work.<br />\n\"Mighty Lak a Rose.\"<br />\n(Continued on page 3, col. 2)<br /><br />\nTURNBULL HEADS<br />\nSTATE SCORERS<br />\nLeading 45 scorers in college football this season, Jack<br />\nTurnbull, Hopkins gridiron<br />\nstar, has, to date chalked up 45<br />\npoints. Seven touchdowns and<br />\nthree successful points after<br />\ntouchdowns are credited to the<br />\nJay back.<br />\nTurnbull's nearest competitor is Berger, University of<br />\nMaryland man, who has garnered 36 points in carrying<br />\nover six touchdowns. Next in<br />\norder are Kim, of Navy;<br />\nKoppe, of Western Maryland;<br />\nDoughty, of Western Maryland, all with 30 points; and<br />\nChalmers, of Maryland, with<br />\n29 points.<br />\nHudert and Reid, both of<br />\nthe Jay gridders, are tied with<br />\n17 other collegiate scorers for<br />\ntenth place on the list. Another Hopkins player, Bauer,<br />\nis tied for last place.<br />\nTurnbull, who leads the<br />\nfield, has received considerable<br />\nmention from sports writers<br />\nin local papers.<br /><br />\nHopkins Team To Entertain<br />\nQuaker Aggregation In Third Home Tilt of the Season<br />\nHOPKINS ELEVEN<br />\nPICKED TO WIN<br />\nBlack and Blue Should Avenge<br />\n32 to 8 Defeat Administered<br />\nBy the Pennsylvanians<br />\nLast Year<br /><br />\nAfter a two weeks' lapse, the<br />\nHomewood Field will again be the<br />\nscene of action when the Hopkins<br />\nteam meets the Haverford College<br />\neleven tomorrow night. This will<br />\nbe the second night game and the<br />\nMiss Elisabeth Gilman Daughthird home game of the season for<br />\nter of Former President Will<br />\nthe Blue Jays, who hope to add the<br />\nBe Heard In Levering Hall<br />\nPennsylvanians to their list of<br />\nvictims.<br />\nMiss Elisabeth Gilman, daughter<br />\nAfter being held scoreless in their<br />\nof Daniel Coit Gilman, first presithree early games, the visiting team<br />\ndent of the Johns Hopkins Univerfinally broke into the Scoring<br />\nsity, and candidate for Governor on<br />\ncolumn when they defeated Trinity<br />\nthe Socialist ticket, will speak to the<br />\nCollege, 11 to 7, last Saturday.<br />\nPrevious tilts had resulted in a 20Liberal Club and the Intercollegiate<br />\nto-0 defeat administered by UrGilman for Governor Club today<br />\nsinus, a scoreless tie with SusqueJust Returned From Africa<br />\nin Levering Hall at 1:15 P. M. All<br />\nhanna, and a 6-0 shutout received<br />\nProfessor Huxley has just restudents are invited to attend.<br />\nat the hands of Kenyon. This last<br />\nturned from a four-month tour of<br />\nMiss Gilman, a graduate of Hopgame looked as though it might end<br />\nEast Africa, undertaken for the<br />\nSociaactive<br />\nin<br />\nthe<br />\nkins,<br />\nhas<br />\nbeen<br />\nin<br />\na scoreless tie until Kenyon exeEnglish Colonial Office Advisory<br />\nCommittee on Native Education, list party for the past ten years.<br />\nJ. H. U. Band To Play At cuted a long pass in the .closing<br />\nand is especially qualified to lecture She is a member of the Socialist<br />\nGame Tomorrow Night minutes of the fray which resulted<br />\non the subject. His lecture, Travels<br />\nin the lone score of the game.<br />\nCommittee of the State of MaryTomorrow night at the Hopkinsand Politics in Tropical Africa, will land, of the Woman's City Club, the<br />\nHaverford Improving<br />\nhe illustrated by lantern slides.<br />\nHaverford game, the band will<br />\nIt<br />\nmay<br />\nbe seen, then, that HaverInternational Relations Club, and<br />\nT. H. Huxley's Grandson<br />\nford<br />\nhas<br />\nbeen steadily improving<br />\nmake<br />\nits<br />\ninitial<br />\nappearance.<br />\nmany other organizations in the<br />\nProfessor Huxley has a distinand<br />\nrounding<br />\ninto form slowly.<br />\nMr.<br />\nConverso, leader of the band<br />\nalso a National Diguished heritage. He is the grand- vicinity. She is<br />\nSeveral<br />\nof<br />\nlast<br />\nyear's players arc<br />\nhas arranged a group of band pieces<br />\nson of the famous Thomas H. Hux- rector of the League for Industrial<br />\nmissing<br />\nfrom<br />\nthe<br />\nranks this year,<br />\nand popular Hopkins songs to be<br />\nley, who spoke at the opening of the Democracy, of which the Johns<br />\nonly<br />\nConn,<br />\nHaverford<br />\ncaptain, and<br />\nchapter.<br />\nplayed by the band on Saturday Fields, a heavy tackle, are veterais<br />\nJohns Hopkins University, the son Hopkins Liberal Club is a<br />\nSocial Workers<br />\nof Leonard Huxley, who was alnight.<br />\nlinesmen. In the backfield Dothard<br />\nMiss Gilman has been very active<br />\nmost as famous as his father, and in social relief work for many years.<br />\nThe band, garbed in the R. 0. T. and Cadbury are the only letterthe descendant of Dr. Arnold of<br />\nShe has performed yeoman's servC. uniform, will present military men, although Simons, Battey and<br />\nRugby. He himself, moreover, is ice in West Virginia, and was espeformations including the \"H\" for- Logan also saw service last year.<br />\nfamous in his own right. He was cially active in relieving distress<br />\nThe team has been fortunate as far<br />\nmation on the football field before<br />\nin 1910 research associate traveling during<br />\nRailthe Western Maryland<br />\nas injuries are concerned and it is<br />\nthe game and between the halves.<br />\nin Germany for the Rice Institute road strike.<br />\nsuffered<br />\nThe formations have been re- believed that White, who<br />\nof Houston, Texas, and in 1912 was<br />\nThe Intercollegiate Gilman for<br />\na wrist injury, will be ready for<br />\nhearsed to a point of perfection and<br />\nappointed to an assistant professor- Governor Club was recently formed<br />\nduty tomorrow night. The only<br />\nare expected to appear quite specship in that place. He held this<br />\nat Hopkins in support of Miss Gilserious<br />\ninjury thus far was the loss<br />\ntacular.<br />\nPosition until 1916, when he re- man's candidacy for Governor. It<br />\nof<br />\na<br />\nveteran<br />\nend, Campbell, ;who<br />\nThe band will have its dress returned to London for -duty at the is composed of members of the Unidislocated<br />\nhis<br />\nshoulder<br />\nand will be<br />\nhearsal on Saturday at 6.30 P. M.<br />\nRome Offices. In 1918 he was staff versity interested in her candidacy<br />\nremainder<br />\nlost<br />\nthe<br />\nto<br />\nthe<br />\nteam<br />\nfor<br />\nAt this meeting there will be a comlieutenant attached to general head- and was formed under the sponsorof<br />\nthe<br />\nseason.<br />\nplete and careful rehearsal of all<br />\nquarters in Italy, and with the end ship of the Liberal Club and the<br />\nCoach Van Orman's Black,and<br />\nmusic and formations to be preof the war he became a fellow and League for Industrial Democracy.<br />\nBlue<br />\ngridders should be able to<br />\nsented that evening.<br />\nLEVERIAG HALL SCENE OF<br />\nsenior demonstrator in zoology at<br />\nThe topic of the speech will be<br />\ntake the measure of the PenpsylSHAMBLES AS STUDENTS SHAVE BARBER<br />\nNew College, Oxford.<br />\n\"The College Student and the Comvanians, although probably not<br />\nHe was one Of the organizers and ing Election.\" It will be given after<br />\nIt is conventional in all civilized razor. Ah, that lather! Like the Cotillion Board To Hold<br />\nwithout a battle.<br />\na member of the Oxford ExpediLast Year's Loss<br />\nthe luncheon of the two clubs, meet- countries for members of the ton- snow-capped peaks of the Alps,<br />\nDance Tomorrow Night<br />\ntion to Spitzbergen. After his re- ing together on the second floor of sorial sect to cater only to mer- and yet with all the softness and<br />\nIt will be recalled that last year<br />\nThere will be a Cotillion Board the Hopkins team travelled to<br />\nturn, Mr. Huxley became professor .Levering Hall. The regular cafe- chants, laborers, scholars and pro- pliability of a down quilt. And the<br />\ndance<br />\ntomorrow night directly folof zoology at King's College. After<br />\nteria luncheon will be served. Reser- fessional men. One never sees a razor! All the glittering purity of lowing the Haverford football Haverford to play this game. After<br />\nholding this position for two years, vations for this may be made with barber enter another barber's offices a true Damascus sabre.<br />\nleading in the first half by a ttnichgame, in Levering Hall. Bob Iula's down, they were forced. to p14 the<br />\nlie was, in 1927, made honorary<br />\nto<br />\nget<br />\nhis<br />\nlocks<br />\nshorn<br />\nor<br />\nhis<br />\nface<br />\nThe lather was applied gently<br />\nLazare Teper, president of the club.<br />\nlecturer there.<br />\ncleansed of a beard. And least of and dextrously by one of the boys Orchestra will furnish the music, latter part of the game in a heavy<br />\nExclusive Statement<br />\nProf. At Royal Institute<br />\nIn an exclusive statement to the all does a merchant or a laborer whose experience had encompassed Which will last from 9 till 12.<br />\ndownpour of rain. Haverford;takProfessor Huxley has been presi- NEWS-LETTER, Miss Gilman said: come into a<br />\nAll affairs, thus far, have been ing advantage of this, scored': five<br />\nbarber shop to shave work of artistic propensities. It<br />\ndent of the National Union of<br />\nWell attended by Hopkins students. touchdowns and won,,32 to 8. •.,This<br />\n\"I myself am a graduate of Hop- the barber.<br />\ncannot be said that the deft motions<br />\nScientific Workers for four years, kins, and since my father was its<br />\nAt Hopkins, on the other hand, of his hand can be compared to The charge for admission is $1.00 year the Jays are determined to<br />\nand is Fullerian professor of physifirst president, all my traditions are a group of students under the im- Rembrandt—it would not do to be- for stag or couple.<br />\navenge this defeat and plan to do it<br />\nology in the Royal Institute.<br />\nthere. I am very much honored that pression that the local barber little an old recognized master. But<br />\nwithout the aid of jive Pltivkis.<br />\nHe comes to Hopkins under the<br />\nNOTICE<br />\na club has been formed in support needed a shave, suggested that such talent should not be left to lie<br />\nQuite a number of.spectator:p are<br />\nStaunch support on the part of the<br />\nGeorge Huntington Williams Foun- of my candidacy.\"<br />\nsince he had always treated them dormant. The application of genius student body marked the returns of last expected to turn out to the game to<br />\ndation. Dr. Williams was first proMiss Gilman is one of a series of fairly, it seemed ethically manda- in a crisis is not to be scoffed at— week's appeal for the improvement of the see what improvement the team has<br />\ntennis courts on the Hopkins campus.<br />\nfessor of geology at the Johns Hopprominent leaders of liberal thought tory for the boys to reciprocate. although, rest assured, John is of It is proposed to levy a charge of 10 made since its last appearance at the<br />\nkins University. After his death,<br />\nin America who are appearing this John (the barber) seemed rather the oppostie opinion. He objected cents per hour for use of the courts, as local field. Against Lehigh they<br />\nis done at such universities as Columbia<br />\nseveral members of his family doyear before the Liberal Club.<br />\noverwhelmed by this generous offer when the creamy suds were intro- and Virginia. The money amassed in satisfied even the most pessimistic<br />\nnated a fund to the University,<br />\nThe Liberal Club meets every and, although it cannot be truth- duced into the recesses of his ears this way will be used to hire a man to that football teams at Hopkins were<br />\nkeep the courts in A-1 condition. The<br />\none-half of the income of which is Friday at 12:30 in Levering Hall,<br />\nfully stated here that he was in a and he writhed when his eyes re- courts will also be resurfaced, enclosed improving.<br />\nused for promoting investigation in<br />\nand the speaker begins at 1:15. It ductile mood, he at last consented ceived a generous sample of the and improved in every way.<br />\nThe probable line-ups will be as<br />\nthat department, and the rest is<br />\nThis movement will be under the<br />\nis the policy of the club to alternate to be placed in one of his luxurious pearly bubbles. To state that he supervision of the Student Activities follows:<br />\nused to secure \"a lecturer of disoutside speakers with speeches by chairs. That is, he consented when entertained an aversion to the soap Council.<br />\nPos.<br />\nHaverford<br />\nHopkins<br />\nAll students desirous of seeing this<br />\ntinguished attainments on some<br />\nmembers of the club. Joel Seid- seven or eight students impressed entering his mouth would be merely movement under way will kindly sign the Lang .........L.E<br />\nFoley<br />\ntopic of widespread contemporary<br />\nman, former president of the club, him with the sincerity of their mo- mentioning a terrific onslaught in a following ballot and place it in P. 0. Towbin<br />\nLT<br />\nFields<br />\nBox 502. All ballots must be in by Nointerest.\" The lectureship was inwill be the first member of the club tives. Four of the assailants will mild manner. It was with some vember 4th.<br />\nLevy .........L.G..... Barnhurst<br />\naugurated in 1920.<br />\nbear scars of the conflict for many difficulty that his six attendants.\")<br />\nto present a speech.<br />\nC. ....... Masland<br />\nHelm<br />\nrajj<br />\nThe club is one of the most well moons, for John is as agile with the (one became tender-hearted and<br />\nBaker<br />\nCurtwright<br />\nRG<br />\nATTENTION<br />\nknown of its kind in this section of razor in war time as in times of rushed to the soda-fountain for<br />\nBialaskorski(c)R T.<br />\nHarvey<br />\nToday, promptly at 12.30, there the country. It has been very active peace.<br />\nRE<br />\nYearly<br />\nConn (c)<br />\nsome Coca-Cola; he had hoped to<br />\nwill be a meeting of all candidates in bringing noted political leaders<br />\nThe door of the shop was bolted, make the lather more palatable)<br />\nLyons<br />\n. QB<br />\nLogan<br />\nfor the editorial<br />\nstaff of the NEWS- before the interested students, and a feathery mass of lather was con- kept him seated. Never before has<br />\nBauer<br />\nLH<br />\nWhite<br />\nLETTER. It is essential that all the expects to continue its program of cocted by a chemistry student, and a ship tossed at sea as the<br />\nTurnbull<br />\n..<br />\n.<br />\nR<br />\nH<br />\nDothard<br />\nHopkins<br />\nnew men be present at this time.<br />\nformer years.<br />\nan engineering lad sharpened a<br />\nOF MORE THAN 20,000,000 INT1 Reynolds<br />\nFB<br />\nTripp<br />\n(Continued on page 3, col. 2)<br /><br />\nSOCIALIST CANDIDATE FOR<br />\nGOVERNOR SPEAKS TODAY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1930<br /><br />\n2<br /><br />\nTHE<br /><br />\nII<br /><br />\nNEWRIETTER<br /><br />\nObservations<br />\nby MUDDY<br /><br />\nLast year, Dean Berry undertook tne part of those responsible and<br />\na laudable experiment. With almost it ought to be corrected as soon as<br />\nmachine-like accuracy he diagnosed possible. From educational, many<br />\n$2.00<br />\nSubscription<br />\nthe condition of the College of Arts reading courses have become farsiand Sciences, of which he had re- .al snaps. More definite restrictions<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore, cently been made Dean, and charted ought to be laid down, and reading<br />\nunder the Act of Congress November 3, 1879.<br />\na course for her to sail on future courses be barred in the sciences,<br />\nvoyages. With a little more polish- but permitted only to the English<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins ing of the edges before next fall, and foreign language departments,<br />\nUniversity.<br />\nthat course will have proved itself where the restrictions of those in<br />\nthe biggest success in the history charge are quite severe.<br />\nof our college.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nIn adapting itself to the new ColHe found a schedule, complex,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING EDITOR;<br />\nother communications to the EDITOR-IN-CHIEF.<br />\nbecause it was more suited to the lege of Arts and Sciences, the Gerwhim of the professor than to the man department showed itself quite<br />\nof the student. So, the liberal in discarding its favorite<br />\nopportunity<br />\nBelmont 8778<br />\nTelephone<br />\nold schedule was discarded, and re- method of instruction in German I,<br />\nplaced by the present one. This in favor of the newer type of readschedule, however, has several weak ing course. The undergraduates adEDITORIAL DEPARTMENT<br />\npoints. In the first place, it is quite mire this attitude. The French deEditor-in-Chief<br />\nscarce in early week 9.30's. That is partment, however, merely added<br />\nGEORGE H. DOWELL,'31<br />\nto say, there are too few subjects Ithe new type of reading course to<br />\nmeeting at 9.30 on Monday and the old-fashioned standard course.<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nTuesday. Wednesday half way sat- ,The undergraduates, who, probably<br />\nisfies itself, due to the fact that most in the first place were responsible<br />\nAssistant Managing Editors<br />\nlate week courses start at that time. for the new type of course were<br />\nSTLVAN LEBOW, '32<br />\nROWLAND McD. NESS, '32<br />\nprobably just a wee bit too hasty.<br />\nThere are some students even toGlancing through the catalogue,<br />\nday, who want substantial, old-fashJunior Editors<br />\nwe notice under the heading of<br />\nNATHAN M. HARRIS, '32<br />\nRAYMOND DUNN,'33<br />\nioned courses. For the benefit of<br />\nPhilosophy, what has properly been<br />\nHAROLD B. YUDKIN,'32<br />\nDONALD PROCTOR, '33<br />\n,these, one section of German ought<br />\nMELVIN GUDE, '33<br />\ntermed one of the best courses the<br />\nHARRY GOODMAN, '33<br />\nto be of the standard type, and the<br />\nHERBERT L. FRIEDBERG,'33<br />\nDAVID DOLOWITZ, '33<br />\nUniversity offers. It is the one<br />\nrest to be continued as the present<br />\nMARION GROVE, '33<br />\nJACK GREENFIELD, '33<br />\ncourse on the campus in which the<br />\nGerman I. If the German departtraits of a gentleman are best exment does not follow the FrenchBUSINESS DEPARTMENT<br />\nemplified. Here, reminiscence is<br />\nmen, the few scholars here, with a<br />\nbrought of the old clays of the UniBusiness Manager<br />\ninterest in classical literature<br />\ndeep<br />\nGus BURK, '31<br />\nversity, when scholars were made<br />\nbe handicapped—and some of<br />\nwill<br />\nmen, via the route of Latin and<br />\nAdvertising Manager<br />\nCirculation Manager<br />\nthese students may be potential GerDAVID SYKES, '32<br />\nGEORGE W. LA MONT,'32<br />\nGreek. It is a course which forms<br />\nman professors.<br />\nthe background of modern society,<br />\nOffice Manager<br />\nISADOR GUTMAN, '33<br />\nscience and religion.<br />\nThere is still one \"black sheep\"<br />\nI am referring to the one course course listed in the catalogue of the<br />\nWu.suR BLoom,'33<br />\nCHARLES NEY, '33<br />\nMORTON ROME. '33<br />\nSimoN Ltrr, '33<br />\nthat brings our own Dr. Boas be- College of Arts and Sciences. That<br />\nfore us with the History of Phi- is Chemistry 477N, commonly<br />\nlosophy. Inadvertantly, no doubt, it called Dr. Duncan's Quantitative<br />\nfroduced by the R. L. Polk Printing Company, 1930 Clifton Ave., Baltimore, Md. is listed in the catalogue, as coming<br />\nAnalysis.<br />\non Wednesday, Thursday, and FriExcept f o r highly technical<br />\nday, at 10.30. This time almost courses, there is no course, which<br />\nautomatically cuts it off from the so completely supplies the rudiments<br />\nmajority of pre-medical students in of laboratory technique, as Quantithe University, who, by all the tative Chemistry. Dr. Thornton has<br />\nedicts of Sir William Osier, should helped to give this subject an exneed this course most.<br />\ncellent reputation at Hopkins. AcTENNIS<br />\nAccording to the present curricu- cordingly, there are a number of<br />\nlum, one is not permitted a science 'pre-medical students, numbering<br />\nE would like to recommend that every student sign and hand<br />\nin the first year of residence. Soph- many potential surgeons, who seek<br />\nin the ballot in today's NEWS-LETTER which will make possible<br />\nomore pre-meds usually elect In- admission to the study, both for<br />\nan improvement of the tennis courts. Unless a majority of the underorganic Chemistry and Physics; gaining an analytical mind, and for<br />\ngraduates do this, it will be impossible to improve the condition of<br />\nthe courts. The fee to be asked for the use of the courts is nominal.<br />\nboth of which conflict with the His- training a steady hand.<br />\nWe should think that all those using the courts would be glad to pay<br />\ntory of Philosophy, since Physics<br />\nIt was probably with this point<br />\nthis charge for the change that will result.<br />\nand Thursday at in mind, that the course was listed<br />\nWednesday<br />\nmeets<br />\nTo those who do not play tennis at Hopkins, we would like to<br />\n10.30, and Chemistry, Friday at that in the catalogue. Yet, in the first<br />\npoint out the fact that the tennis team deserves to have the courts<br />\ntime. In the junior year, the pre- lecture, pre-medical students are<br />\nimproved for its use. During the last four years the Jay team has not<br />\nlost a match to a State opponent. The record made against teams out<br />\nmed will avail himself of Biology, told by Dr. Duncan that they are<br />\nof the State has been very good. This year the material available is<br />\nand will again find a conflict. The not wanted, but would be tolerated,<br />\nbetter than ever and the services of an experienced coach have been<br />\nsenior year, usually finds the pre- merely because the course is techsecured for the first time. An excellent schedule with many of the<br />\nmed looking for culture. He usually nical.<br />\nbest teams in the East is being arranged.<br />\nThe same system has proved satisfactory at Columbia and Virturns for aid, to the grand old man<br />\nWith extreme grace on the part<br />\nginia and should meet with equal success at Hopkins. Sign your<br />\nof the University, Dr. Swartz, in of Dr. Thornton, this class was<br />\nballot and hand it in immediately!<br />\nGeology. However, doubt enters given space in his spotlessly-clean<br />\nhis mind when he finds that again, lab, and assigned a stiff list of exthere is a conflict with Philosophy, periments to complete.<br />\nand the ranks are split.<br />\nThe Biology department, through<br />\nGENTLEMEN?<br />\nstudents<br />\ntheir<br />\nsend<br />\nlong experience, found that a biSome advisers<br />\nof<br />\nHistory<br />\nin<br />\nological GEIST is developed by the<br />\nover into the course<br />\nUDGING from their actions at last week's assembly, the present<br />\nPhilosophy, given by Mr. Dorsey in use of free time in the laboratory—<br />\nJ Freshman class is proving an excellent illustration of how Freshthe College for Teachers. However, but some members of the Chemistry<br />\nmen should 4zot act. Dr. Halsey's audience was anything but orderly.<br />\nsuch should not be the case. Phi- department believe that the only<br />\nContinual disturbances among the underclassmen made it difficult for<br />\nthe speaker to hear himself talk. Hopkins prides itself on the fact<br />\nlosophy is only as educational as its human beings worth living are<br />\nthat its students are gentlemen. We hope that no visitors viewed<br />\nlecturer. Two classes may have the graduate students in the Chemistry<br />\nthis exhibition of gentlemanly conduct.<br />\nsame texts, and assignments in Phi- department.<br />\nIn his greeting to Freshmen Dr. Ames said,\"—few men are as<br />\nAccordingly, students in Chemisyet the class with the betlosophy,<br />\nunpleasant to their associates as bumptious Freshmen.\" A certain group<br />\nthe<br />\ngain<br />\ninvariably<br />\nwill<br />\n477N, are only permitted to use<br />\nlecturer<br />\n'try<br />\nter<br />\nDf this year's new men should decidedly be termed bumptious, and<br />\nthere is no doubt that they are unpleasant to their associates. Freshmen<br />\nthe laboratory two days a week, for<br />\ngreater knowledge.<br />\nregulations were abolished at Hopkins because it was thought that the<br />\nOur claim is not that Mr. Dorsey a maximum of six hours. Since<br />\nfirst year men would realize their responsibilities and conduct themis not capable, or a poor lecturer. 1 they can see life further than in<br />\nselves as gentlemen. If the present class does not change its entire<br />\nhave never seen him, or talked with chemical laboratories, they are only<br />\nattitude, we strongly recommend the restoration of regulations.\"<br />\nany of his pupils. Our claim is ,permitted to dabble in, and receive<br />\nmerely the fact that we know who a smattering knowledge of analytics.<br />\nWhen asked by the writer, Dr.<br />\nDr. Boas is he has been tried and<br />\ntested right here before other Thornton had no objection to use of<br />\nHOMECOMING<br />\nclasses of the University, and has ,free time in his laboratory by stuFTER playing away from home on two successive Saturdays, the<br />\na distinct reputation as a lecturer. dents in Chemistry 477N, provided<br />\nJay eleven meets Haverford at Homewood Field tomorrow<br />\nCertainly, the next catalogue ought 'they did not allow fumes to penenight. The Hopkins team was decisively beaten by Rutgers, but showed<br />\nlist this particular change in the 'trate the room. There is absolutely<br />\nto<br />\na reversal of form in defeating Swarthmore in a close contest last<br />\nat least to permit seniors no conflict in laboratory space with<br />\ncatalogue,<br />\nweek. This year's eleven to date has shown much potential power.<br />\nDr. Boas, and Dr. uch use of free time. It seems that<br />\nboth<br />\nenjoy<br />\nHaverford will be represented by a weaker team than usual, and<br />\nto<br />\nHopkins may be expected to win.<br />\nyear.<br />\nsame<br />\nit merely satiates a whim of a chemthe<br />\nin<br />\nSwartz<br />\nWe hope that a good crowd --\"'<br />\nist to refuse such admittance. If<br />\ncalled the homecoming game. Th[pp&amp;<br />\nUnithe<br />\nsufficient reason cannot be given for<br />\nWhen reading courses in<br />\nthe annual contests with St. Johr„,<br />\nversity were first opened to un- the erection of the barrier, students<br />\nstudents attending the opening gall<br />\ndergraduates, they were probably ought not be told to \"work when I<br />\nbe due to the fact that many belic.,<br />\nR.E MD.<br />\nthe eleven that represented Hopki '<br />\nmeant to supplement the regular say, or drop the course\" but in adcan be no excuse of this kind off<br />\nwork of the student, with beneficial dition to regular work, ought to be<br />\nFactory<br />\nDue to the fact that the banc<br />\nIf such was the reason for permitted to round off their doubts,<br />\neffect.<br />\ncontest, we hope that the cheerinl<br />\n600 S. Pulaski Street<br />\na mistake was made on by a cautious extra analyses.<br />\norigin,<br />\ntheir<br />\ncouldn't be any worse than that exl<br /><br />\nST. REGIS<br /><br />\nFOUNDED 1897<br /><br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br /><br />\nPhone Belmont 9696<br /><br />\nJimmie's Drive It Yourself, Inc.<br />\nNo Deposit Required<br />\nDrive It Yourself<br /><br />\nRent A Car<br /><br />\nBaltimore, Md.<br /><br />\n3313 Greenmount Ave.<br /><br />\nEDI1 ORIALS<br /><br />\nW<br /><br />\nA<br /><br />\nSONS<br /><br />\nEven<br /><br />\nbrain-workers<br />\nand frat-house fans get<br /><br />\n\"ATHLETE'S FOOT\"<br />\nOU don't have to be an athlete to get\"Athlete's Foot.\"<br />\nMen who do their daily dozen in<br />\nthe library giving the old bean a<br />\nbig workout; and the boys who<br />\ndo a mental marathon in class<br />\nbut never try for the track—as<br />\nwell as those who really do give<br />\ntheir muscles to Alma Mater—<br />\nany and all arejustso much good<br />\nred meat to the tiny germ which<br />\nhas spread this ringworm infection everywhere. Tinea trichophyton is its name and it's the<br />\ncause of \"Athlete's Foot.\"<br /><br />\ndressing-room floors. In spite of<br />\nmodern sanitation (you have to<br />\nboil socks 15 minutes to kill it<br />\nthis fungus parasite infects and<br />\nre-infects bare feet almost any<br />\ntime they come in contact with<br />\ndamp floors.<br /><br />\nIt lurks in the very places<br />\nwhere we all go for cleanliness<br />\nand health—on the edges of<br />\nswimming pools and showers—<br />\nin gymnasiums—on locker- and<br /><br />\nlocker as a preventive. Use it<br />\nafter every exposure of bare<br />\nfeet on damp floors. At all<br />\ndruggists — G1.25. W.F.Young,<br />\nInc., Springfield, Mass.<br /><br />\nY<br /><br />\nAbsorbine Jr. kills the<br />\ngerm of<br />\n\"ATHLETL'S FOOT\"<br /><br />\nTests in a famous New York<br />\n\"lab\" have revealed that Absorbine Jr. penetrates flesh-like<br />\ntissues deeply and that wherIn universities from Pennsyl- ever it penetrates,it KILLS the<br />\nvania to California, it has been ringworm germ.<br />\nfound that 50% of the men have<br />\nIt might not be a bad idea to<br />\nit. The U.S. Health Service has examine your feet tonight. At<br />\nreported that \"at least half of the first sign of redness between<br />\nall adults suffer from it at some toes,itching,peeling or blisters,<br />\ntime.\" Co-eds are not immune douse on Absorbine Jr., and<br />\nfrom this trouble, either.<br />\nkeep a bottle handy in your<br /><br />\nAbsorbine<br />\nFOR YEARS HAS RELIEVED SORE<br />\nMUSCLES, MUSCULAR ACHES, BRUISES,<br />\nB URNS, CUTS, SPRAINS, ABRASIONS<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1930<br /><br />\n3<br /><br />\nDr. Bearden To Address<br />\nProf. Chinard to Address German Orator to<br />\nOptical Society Of America Audience at Little Theatre<br />\nAddress German Club<br /><br />\nN.You can put on a corn roast<br />\nbarbecue, weiner party, etc.,<br />\nanytime,anywhere with Saunders System cars. A car for<br />\nfive costs less than rail fare.<br />\nGlad to serve your bunch.<br />\nCoupes, Sedans or Touring.<br /><br />\nN<br /><br />\nSAUNDERS SYSTEM<br /><br />\n11 East North Avenue<br />\nVernon 2704<br /><br />\nThe Optical Society of America,<br />\nwhich is holding its fifteenth annual meeting starting today at the<br />\nUniversity of Virginia, has invited<br />\nDr. J. A. Bearden of the Hopkins<br />\nfaculty to read a paper. Dr. Bearden<br />\nwill address the assembly on<br />\n\"Grating Measurements of X-Ray<br />\nLengths and their Significance.\" On<br />\nthe same program Prof. A. H.<br />\n•Compton of the University of Chicago and Prof. G. Merrit of Cornell. Both of these men will also<br />\ndiscuss different phases of the<br />\nX-Ray.<br /><br />\nRifle Club To<br />\nHold Meeting 7oday<br />\nThere will be an organization<br />\nmeeting of the Rifle Club today, at<br />\n12.30, in the South Loft of Gilman<br />\nHall. Anyone interested in the<br />\nRifle Club, ought to attend this<br />\nmeeting as matters of importance<br />\nto the organization will be discussed.<br />\nThe Rifle team is selected from<br />\nthe members of the Rifle Club who<br />\nmake the best scores.<br />\nThere are about 35 members<br />\nsigned up at present and more candidates are urged to come out.<br />\nGERMAN EDUCATION<br /><br />\n••••••••<br /><br />\nFor Better Cleaning and<br />\nDyeing<br /><br />\nFRIED'S<br />\n101 E. 21st St.<br /><br />\nBelmont 5501<br /><br />\nFOR SALE<br /><br />\n1928 Pontiac<br />\nCabriolet<br />\n(With rumble seat)<br /><br />\n$125<br />\nP.O. Box 923<br /><br />\nJ. H. FURST CO.<br />\nPRINTERS OF<br /><br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 Hopkins Place, Baltimore<br /><br />\nTHE NEW<br />\n099<br /><br />\n(Continued from page 1, col. 3)<br /><br />\nOn Monday, November 3, Professor Chinard will speak in French<br />\nat the Little Theatre, Howard<br />\nstreet at Franklin, between the acts<br />\nof the 8.30 performance of \"La<br />\nGrande Mate,\" a French talkingpicture featuring Maurice Chevalier, under the auspices of the Baltimore Group of the Alliance Francaise.<br />\nMonsieur Gaston Gille, a distinguished lecturer of the group,<br />\nwill speak on the topic \"La Renaissance de la France Contemporaine\" in Civil Engineering Building, Friday, November 21, at 5<br />\nP.M. All students are invited to<br />\nattend, especially French students.<br />\nProf. Gibert Chinard and Prof.<br />\nH. C. Lancaster are members of the<br />\nCommittee for the Group, here in<br />\nBaltimore.<br />\nOther lectures by distinguished<br />\nFrenchmen are being arranged, as<br />\nwell as French social and conversational evenings, dramatic and musical events, etc.<br /><br />\nOrchestra Needs Players<br /><br />\nThere is no choice of studies in a<br />\nOf Brass Instruments<br />\nGerman school, and emphasis is<br />\nBruce Peake, president of the<br />\nplaced on theory and intellectual Johns Hopkins Musical Club antraining rather than character build- nounces that there are still some<br />\ning. There is no over-emphasis of<br />\nvacancies in the brass section of the<br />\nathletics in Germany, but stress is<br />\nplaced on the making of scholars. 'Blue Jay Orchestra.<br />\nThere are also some positions<br />\nIn a statement to the NEWSopen in the Banjo-Mandolin Club.<br />\nLETTER, Dr. Becker said:<br />\n\"The American student, as I<br />\nThe orchestra meets every<br />\nhave come in contact with him, Thursday at 4 P. M.<br />\nseems to be a very lively and wideThe Banjo Club meets every<br />\nawake sort. He seems very charm- Thursday at<br />\n,9 o'clock in Levering<br />\ning, and I am very found of him.\" Hall.<br /><br />\nHerr Heinz Bockhacker of El-<br /><br />\nAn influence for<br />\nbetter dressing at<br />\nMaryland colleges!<br /><br />\nberfeld, Germany, who spoke last<br />\nweek in Washington at the Fifth<br />\nInternational<br /><br />\nOratorical<br /><br />\nContest,<br /><br />\nwill address the Johns Hopkins<br />\nDormitory German Club tomorrow<br />\nevening at 7:30 in Levering Hall<br />\non \"The Youth Movement in Germany.\" The speaker will approach<br />\nthe subject from a new point of<br />\nview. The public is cordially invited.<br /><br />\nCLOTHES<br /><br />\n211-213 E. Baltimore St.<br /><br />\nHerr Bockhacker was chosen<br />\namong hundreds of German \"Gymnasium\" students to represent his<br />\ncountry in the Washington contest.<br />\nIn the German National Contest<br />\nheld in Berlin the candidates were<br />\ngiven but two minutes' preparation<br />\nfor a ten-minute speech.<br /><br />\nHOPKINS STUDENTS EAT AT<br /><br />\nThe Stadium Restaurant<br />\nCor. Greenmount Avenue and 31st Street<br /><br />\nRENT A CAR<br /><br />\nThe German Club considers itself<br />\nfortunate to have as guest for its<br />\nfirst public meeting such a distinguished young German student,<br />\nabove all since his stay in America<br />\nis limited to two weeks.<br /><br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\nDeposit Not Required<br /><br />\n2125 HARFORD AVE.<br /><br />\nThe J. H. U. Dormitory German<br />\nClub was founded recently by the<br />\nGerman Exchange Student Jurgen<br />\nG. von Ludwiger with the purpose<br />\nof discussing German-American relations and furthering the speaking<br />\nand reading of German among the<br />\nstudents.<br /><br />\nSTEPPING<br /><br />\n111 W NORTH AVE.<br />\nPhone, Wolfe 1413<br />\n•<br />\n•<br /><br />\nTHE NORTH INN<br />\n3 EAST NORTH AVENUE<br /><br />\nvwv<br /><br />\nThe Club will present a speaker<br />\nto the public once a month in Levering Hall and from time to time<br />\nmovies will be shown depicting German life and culture.<br /><br />\nLEVERING HALL SCENE OF SHAMBLES<br />\nAS STUDENTS SHAVE BARBER<br />\n(Continued from Page 1, col. 4)<br />\nfor an attendant to hold his head<br />\nbarber did in his chair. Lather flew,<br />\nin place; in fact, it was hardly<br />\nblood was drawn and a veritable<br />\nshambles was present. But still the necessary for any more assistance<br />\nbattle raged far into the afternoon, save for the few boys who grasped<br />\nwith none of the participants tiring. his legs and arms to prevent anIt must be admitted that John ex- other upheaval. When one concenhibited the strength and vitality of trates on the matter, he is inclined<br />\nhis Neopolitan ancestors—but to no to feel that a throat is a throat . . .<br />\navail.<br />\nand a healthy throat is far superior<br />\nAgain the white disguise was ad- to a wounded one. John certainly<br />\njusted and the razor stropped. The maintained a diplomatic front in<br />\noperation was precarious,but every- his quietude.<br />\nthing was sacrificed for speed.<br />\nSo no longer must you keep<br />\n\"After all,\" said the lad with the quiet when you hear of a cook<br />\nrazor, \"it isn't my face, and I've being tendered a testimonial bangot a class in ten minutes.\" It was quet or a student lecturing a propeculiar how quietly John sat in fessor, or even a man biting a dog.<br />\nplace during this phase of the For you have heard how a campus<br />\nprocess. No longer was it necessary barber has been shaved by students!<br /><br />\nOPERATE IT YOURSELF<br /><br />\nThe Meeting Place For College Men<br />\nAfter the Game or the Dance<br />\n\"Food Prepared the Right Way\"<br /><br />\nINTO<br /><br />\nA<br /><br />\nMODERN<br /><br />\nWORLD<br /><br />\nOur Business is to Improve Your Appearance<br />\nBaltimore's Foremost Cleaners and Dyers<br /><br />\nKAYES'<br />\nCLEANERS AND DYERS<br />\n3 Suits Sponged and Pressed $1.00<br /><br />\n$1<br /><br />\nLadies' and Gent's Tailoring A Specialty<br />\nHats Blocked and Renovated of all kinds<br /><br />\n32nd Street Corner Abell<br /><br />\n$750<br /><br />\nPhone, Belmont 5816<br /><br />\nPatronize the<br /><br />\nThey shut the door on hybrid styles<br /><br />\nRoland Park Drug Store<br /><br />\nSmartest Coat<br />\non the Campus<br />\nCollege men who know what to<br />\nwear and how to wear it choose<br />\nAlligator \"50\"—the new College<br />\nCoat... Alligator\"50\"is a smart<br />\ndouble-breasted raglan —long—fullcut—roomy—full-belted, with big<br />\npatch pockets, and a convertible<br />\ncollar that gives extra protection<br />\naround the neck ... Light in<br />\nweight —semi-transparent —absolutely weather-proof. Four rich,<br />\noriginal colors —Deep Sea, Tan,<br />\nBlue,Black —and only $7.50!...<br />\nOther Alligator models from<br />\n$5.00 to $25.00.<br /><br />\nTHE ALLIGATOR CO.<br />\nSt. Louis, Mo.<br /><br />\nMORGAN and MILLARD<br />\nRoland Avenue and Upland Road<br /><br />\nQuantity production of equipment has long<br />\nbeen practiced by the telephone industry.<br />\nTelephone designers years ago shut the door<br />\non many hybrid styles—seeking first to work<br />\nout instruments which could best transmit the<br />\nvoice, then making these few types in great<br />\nquantities.<br /><br />\nSAMUEL KIRK &amp; SON, Inc.<br /><br />\nThis standardization made possible concentrated study of manufacturing processes, and<br /><br />\nJewelers—Stationers—Silversmiths<br /><br />\nsteady improvement of them. For example,the<br />\nproduction of 15,000,000 switchboard lamps a<br />\nyear, all of one type, led to the development<br />\nof a highly special machine which does in a<br />\nfew minutes what once took an hour.<br />\nManufacturing engineers, with their early<br />\nstart in applying these ideas, have been able to<br />\ndevelop methods which in many cases have become industrial models. The opportunity is there!<br /><br />\nBELL SYSTEM<br /><br />\n421 North Charles Street<br />\nBaltimore, Md.<br />\nWRIST WATCHES FOR MEN<br />\nGIFTS IN SILVERWARE<br />\nDIAMONDS—WATCHES—CLOCKS—JEWELRY<br />\nFounded 1815<br />\nA<br /><br />\nNATION-WIDE SYSTEM<br /><br />\nOF<br /><br />\nMORE THAN 20,000,000 INTER-CONNECT/NG TELEPHONE:,<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 31, 1930<br /><br />\n4<br /><br />\n,<br /><br />\nActivity Cards<br />\nSTUDENTS TO BE GIVEN<br />\nM.FARAL TO LECTURE ON Student<br />\nOn Hand At Post Office<br />\nTdRNBULL FOUNDATION Students who have not received BARNSTORMER STICKERS<br />\nTo Begin Addresses On \"Poetic their Activities Card should secure<br />\nCycle of King Arthur\"<br />\nthem at the post office in Gilman<br />\nNovember 6th<br />\nHall at their earliest convenience.<br />\nMonsieur Edmond Faral, professor of Medieval Latin Literature Only those who present their rein the College de France, will lec- ceipt from the treasurer's office,<br />\nture for the Percy Graeme Turnbull may receive this card.<br />\nLecture Foundation this year, the<br />\nThe Student's Activities Card enRegistrar's office announced today. titles a duly registered student to<br />\nThis is the twenty-seventh series of<br />\none copy of the Hullabaloo, one<br />\nlectures promoted by this foundayearly subscription to the NEWStion.<br />\nProfessor Faral has chosen as his LETTER, one yearly subscription to<br />\ntopic The Poetic Cycle of King the Black and Blue Jay, one ticket<br />\nArthur. The course of six lectures to the first Barnstormers' presentawill be given in French, and the tion, a ticket to the Home Conaspects of the subject will be fully cert of the Musical Club, admission<br />\ndiscussed. The lectures will be to all debates of the Debating Coungiven on November 6, 7, 13, 14, 20 cil, and a Y. M. C. A. Hand Book.<br />\nStudents who have not received<br />\nand 21, in room 120 of the Civil<br />\ncard should get their's imtheir<br />\nM.<br />\nP.<br />\n5<br />\nat<br />\nBuilding<br />\nEngineering<br />\nrnediately.<br />\nand<br />\nhour<br />\nThey will each last one<br />\nthe doors will be closed as soon as<br />\nSORRY!<br />\nthe lectures begin.<br />\nwishes to corNEWS-LETTER<br />\nThe<br />\nLectureship<br />\nOldest<br />\nThe lectureship is the oldest in rect the false impression conveyed<br />\nthe University. It was founded in by one of its reporters in an article<br />\n1889 in memory of Percy Graeme last week which had stated the<br />\nTurnbull by his parents two years music at the Fashion Show as being<br />\nafter his death, and the first lectures that of the Blue Jay Orchestra.<br />\nThis group has not as yet apwere given in 1891.<br />\nThe purpose of the lectureship is peared before any public gathering.<br />\nto present an annual course of lec- The NEWS-LETTER regrets this<br />\ntures on poetry by a man to be error.<br />\nchosen by the President from<br />\namong \"properly qualified authors, Jay Harriers To<br />\nwriters or professors of America or<br />\nMeet St. Johns<br />\nTomorrow at 3:30 P. M. the<br />\nEurope.\"<br />\nAmong the twenty-six famous Hopkins cross-country team will<br />\nlecturers who have appeared at the meet St. Johns at Annapolis. Yesuniversity under this lectureship terday the team journeyed to the<br />\nsince 1891 are Henry Van Dyke, State capitol for a preliminary run<br />\nHamilton W. Mabie, Paul Shorey, over the course.<br />\nThe Junior Varsity meets Tome<br />\nSir Walter Raleigh, Professor Edmond Legouis and Walter de la School at Port Deposit this afternoon.<br />\nMare.<br /><br />\nA National Institution<br /><br />\nPurely American<br /><br />\nWe ask answer to our query as to whether readers ever pay any<br />\nattention to NEWS-LErrER ads. To the first five who return this ad<br />\nto the correct advertiser, each will be given a meal gratis. Souvenirs to the next tweny-five.<br /><br />\nLook for the Orange Lights<br /><br />\nA Meal a Minute<br /><br />\nS. Jesse Robinson Made Barnstormer Publicity Manager<br />\nIn order to arouse interest outside of the campus, a very clever<br />\nadvertising campaign has been<br />\nworked out for the Barnstormers'<br />\nplay. The plays have always been<br />\na social success, but this year it is<br />\nhoped to make it even more so.<br />\nThere will be found next Monday<br />\nmorning in the postoffice box of<br />\neach Hopkins student a small and<br />\nattractive oblong sticker advertising<br />\nthis year's production, \"The Black<br />\nFlamingo,\" which is to take place<br />\nat the Lyric Theare on December<br />\n5th and 6th.<br />\nCooperation Urged<br /><br />\nis the wish of the publicity<br />\nstaff of the Barnstormers that<br />\neveryone cooperate with the Club<br />\nby displaying these stickers on his<br />\nautomobile or in ,any other conspicuous place so as to arouse the<br />\ninterest of the Baltimore public in<br />\nthe production. The new publicity<br />\nstaff under the direction of S. Jesse<br />\nRobinson feels that with its extensive advertising campaign this year's<br />\nundertaking should break a predent by making the show a big<br />\nfinancial success. A high goal is<br />\nbeing set this year so that the Club<br />\nmight operate on a more pretentious<br />\nscale in the future.<br />\nIt<br /><br />\nKENT TO BEGIN<br />\nTALKS NEXT FRIDAY<br />\nFrank R. Kent will deliver<br />\nthe first lecture of his course<br />\nin Practical Politics next Friday, November 7. The class,<br />\nwhich is open to all undergraduates, will convene in<br />\nRoom 101, Remsen Hall.<br />\nMr. Kent, who conducts the<br />\n\"Great Game of Politics\"<br />\ncolumn in the Baltimore Sun,<br />\nis considered one of the most<br />\nprominent commentators on<br />\npolitics. He is also managing<br />\neditor of the Sun, with which<br />\nhe has been connected since<br />\n1898, and editor-owner of<br />\nthe Maryland Almanac, a<br />\nyearly publication. He has<br />\nalso written four books on<br />\npolitics, which have had wide<br />\ncirculation.<br /><br />\nAt a conference of the swimming<br />\nofficials it was decided to hold a<br />\n.meeting of all candidates within the<br />\nnext week. A tentative swimming<br />\nschedule will then be announced<br />\nwith the names and events of the<br />\n, new men. It is requested that all<br />\ninterested ill swimming in any way,<br />\nwhether for team or manager positions, watch the NEWS-LETTER and<br />\nbulletin boards for further announcements.<br />\nWednesday, November 5, in the<br />\nBarn at 1 P. M. All men interested<br />\nin wrestling are urged to try out<br />\nfor the team. No experience is<br />\nnecessary.<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nin neckwear are the key to a man's dress . . . they give that<br />\ntouch of personal effectiveness.<br />\n\"The Store of Standard Values\"<br />\n:-:<br /><br />\nManhattan Shirts<br /><br />\nScotch Spun Neckwear<br /><br />\n7 DINNERS<br />\nGood Food<br /><br />\nHASSLINGER'S<br />\n3226<br /><br />\nGreenmount Avenue<br />\nJust Below 33rd Street<br /><br />\nNo Deposit Required of Hopkins Students<br />\nBuicks<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br /><br />\nCoupes<br />\nRoadsters<br />\nSedans<br /><br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles St.<br />\nVernon 4049<br /><br />\nPLaza 6000<br /><br />\nBaltimore Concedes Milestone Supremacy<br /><br />\nSimon Ackerman Clothes<br /><br />\n128 W. Fayette Street<br /><br />\nQUICK<br /><br />\nsta<br />\nde:<br /><br />\nFOR THE START<br /><br />\nha<br /><br />\nSPEED<br />\nr t<br /><br />\nWashington, D. C.<br />\nMARTINIQUE<br /><br />\nHAMILTON HOTEL<br />\n14th at K Street—<br />\nIn the Heart of the City<br />\nSingle with bath $3.00 to $5.00<br />\nDouble with bath $5.00 to $8.00<br /><br />\nAutomobiles<br /><br />\nAMOCOGAS<br />\n—and it costs<br /><br />\nCAIRO HOTEL<br />\nQue St. at 16th—<br />\nWashington's tallest building<br />\nSingle with bath $3.00 to $3.50<br />\nDouble with bath $4.00 to $6.00<br /><br />\ndec<br /><br />\n... Tailors ...<br /><br />\nFORTHE STRETCH<br /><br />\nThese Hotels offer superior<br />\naccommodations for your<br />\nnext visit to<br /><br />\nUSED<br /><br />\nthc<br />\ndit<br />\ntha<br />\ntw,<br /><br />\n111c<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nPOWER<br /><br />\nHAIR CUTTING, 40 CENTS<br />\nSHAVING, 20 CENTS<br /><br />\n16th St. at M, Northwest—<br />\nIdeal for motorists<br />\nSingle with bath $3.00 to $4.00<br />\nDouble with bath $5.00 to $6.00<br /><br />\nFORD<br /><br />\nsoi<br />\nthe<br />\nses,<br />\nof<br />\nthe<br />\next<br />\nbef<br /><br />\nREADY TO WEAR<br /><br />\nFOR, THE FINISH<br /><br />\nNEW<br /><br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br /><br />\npoi<br />\nthe<br />\nalb<br />\ncep<br />\nfur<br />\nof<br />\nexi<br />\nvis<br />\nto<br />\nof<br /><br />\njoi<br /><br />\nVernon 3436<br /><br />\n315 NORTH CHARLES STREET<br />\nBALTIMORE ... MARYLAND<br /><br />\nNe<br /><br />\nLowest Prices<br /><br />\nTO RENT<br /><br />\nancg6Ai@ieTt_ll<br /><br />\nCC<br /><br />\nALL FOR<br /><br />\n'Wa<br /><br />\nJOHN LUSCO, Proprietor<br /><br />\nW. FRANKLIN STREET<br /><br />\nInterwoven Hose<br /><br />\nCollege Men Will Appreciate This<br />\n6 BREAKFASTS<br />\n$7.00<br /><br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\nExpert Service Guaranteed<br /><br />\n313<br /><br />\n:-:<br /><br />\n11 East Baltimore Street<br /><br />\nMcPHERSON'S<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nLocated in the Northend Basement of<br />\nLevering Hall. For the convenience of<br />\nthe Student Body and the Faculty<br /><br />\nTuxedos and Cutaways<br /><br />\nseason's styles<br /><br />\niii<br /><br />\n,The Campus Barber<br />\nShop<br /><br />\nSULSKY<br /><br />\nThe<br /><br />\nSwimming Team<br />\nto Organize Next Week<br /><br />\nVan Orman Pledges Aid<br />\nTo Wrestling Association and he set the first practice for<br />\nDr. Ray Van Orman addressed<br />\nthe organization meeting of the<br />\nwrestling team yesterday and<br />\npledged his support to the new<br />\ngroup. The Athletic Association<br />\nis unable to finance a wrestling<br />\nteam; therefore, any coaching that<br />\nthe team may get must be given<br />\ngratis.<br />\nDr. Van Orman promised the<br />\nteam the use of some wrestling<br />\nmats. He also stated that he would<br />\nurge all football men to come out<br />\nfor wrestling, since the sport is<br />\nvery valuable in building up football men. Jacobson, who precipitated the idea of a wrestling team,<br />\nwas elected temporary manager,<br /><br />\nAutumn ShowinR---<br /><br />\nOf<br /><br />\nof<br /><br />\ntw<br /><br />\nof<br /><br />\nsa.<br />\na<br />\nSe<br /><br />\nPa<br />\nfie<br /><br />\nA<br />\nin,<br /><br />\n11)<br />\nPa<br />\nor<br /><br />\na<br /><br />\nA<br /><br />\nof<br /><br />\nqt<br />\n11-1<br />\n91<br /><br />\nat<br /><br />\ntF<br /><br />\ngl<br />\n1<br /><br />\n•<br />\n•<br />\n•<br /><br />\ntlis<br />\nri<br /><br />\n•<br />\n•<br /><br />\nh;<br />\nfi<br /><br />\nCl<br /><br />\nTHE BACKUS MOTOR COMPANY<br />\n10-20<br /><br />\nfi<br /><br />\nE. North Avenue<br />\nVernon 4300<br /><br />\nAFRICAN OIL COMPANN<br />\n./Mlop. Bellmore. MA.<br /><br />"}], "field_media_file": [{"target_id": 38506, "display": null, "description": null, "target_type": "file", "target_uuid": "2f085fa8-8b66-4acd-a8ac-d6fd540fa480", "url": "http://digital.library.jhu.edu/system/files/2022-03/12185-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12185, "target_type": "node", "target_uuid": "5c9524d9-1807-426e-9d20-4234e8db6672", "url": "/node/12185"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f8951fda-614b-48e0-a535-898ffde772df"}]}