{"mid": [{"value": 36937}], "uuid": [{"value": "7b64753e-46f9-4e6a-8ef4-785006c5daec"}], "vid": [{"value": 36937}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13103-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:34+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No 31<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 8,1924<br />\n<br />\nPENN RELAYS OUTSTANDING TRI-STATE STUDENT VOLUNTRACK AND FIELD EVENT<br />\nTEER CONFERENCE STARTS<br />\nAT HOOD COLLEGE<br />\nOF COMING SEASON<br />\nEngland, Canada, Cuba, and Western Representatives from Maryland, DelaStates Are Sending Teams. Over<br />\nware and Washington to Be Present.<br />\n450 Schools Represented<br />\nJ. H. U. to Send Twenty-seven<br />\n<br />\nThe Trustees of the Johns<br />\nHopkins University on behalf<br />\nof the Board, the Faculty. the<br />\nAlumni and the students of<br />\nthe University extend to Mrs.<br />\nWoodrow Wilson their sympathy in the loss of her distinguished husband, a graduate of this University, whose<br />\nhigh ideals uplifted the Nation<br />\nand whose great abilities nobly<br />\nserved it in time of peril.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nVARSITY MEDLEY RELAY HOPKINS<br />\nALUMNUS<br />\nRETEAM TO COMPETE IN<br />\nCEIVES BOK PRIZE OF<br />\nWILCO GAMES FEB. 16<br />\n$100,000<br />\nBooth, Clarke, Dorcus and Norwood Dr. Levermore's Plan to Preserve InExpected to Represent Black<br />\nternational Peace Chosen by Ameriand Blue<br />\ncan Peace Award Committee<br />\n<br />\nPennsylvania's thirtieth annual<br />\nBeginning with a \"get-together<br />\nHopkins will send a medley reDr. Charles Herbert Levermore,<br />\nrelay race carnival will this year supper\" at 6 P. M. on Feb. 8 the<br />\nwho<br />\nreceived his Ph. D. degree in<br />\nlay team to the Wilco Games, New<br />\n1886<br />\nin the graduate department of<br />\nbe finer than ever. Cambridge Uni- annual Tri-State Student VolunYork, February 16. At the recent<br />\nthe Johns Hopkins University, has<br />\nversity, England, has sent word teer Conference will enter into a<br />\nMillrose Games, Hopkins finished<br />\nbeen chosen as the winner of the<br />\nthat they will be represented. W. three day session, at Hood Colthird, back of Boston College and<br />\n$100,000 prize offered by Edward<br />\nR. Bristowe, the captain of the lege, Frederick. Delegates from<br />\nGeorgetown. However, the team W. Bok for the best plan<br />\nto preCambridge team wrote that as yet Student Branches of the Y. M. C. VARSITY<br />\nNATATORS TO was not exactly prepared for the serve international peace. At a<br />\nSWIM AGAINST CATHthey had not decided on what dis- A. and 'the Y. W. C. A. of instirace, as it was run in the middle meeting of the policy committee of<br />\nOLIC U. TOMORROW<br />\nof the examination period. A bet- the American Peace Award in Philtance they will choose. It is prob- tutions in Maryland, Delaware<br />\nable, however, that they will de- and the District of Columbia will Black List May Interfere With Entries. ter showing is thought probable by adelphia, February the fourth,<br />\nJohns Hopkins swimmers will Coach \"Jimmy\" Le Cato, now that John W. Davis presented Dr. Levcide on the two-mile distance, as be present at this conference lastcompete with Catholic University the mental burden is lifted from ermore with $50,000. If Congress<br />\nthey have in college Mountain, ex- ing over Feb. 8, 9, and 10.<br />\naccepts the plan the Hopkins eduthe men.<br />\nchampion half-miler of England, The conference is an annual af- at the Baltimore Athletic Club pool<br />\ncator will receive another $50,000..<br />\nThe<br />\nteam<br />\nsame<br />\nthat<br />\nperformed<br />\nin<br />\ntomorrow night. After the meet<br />\nand Lowe, both of whom have run fair held under the auspices of<br />\nThe news of Dr. Levermore's<br />\nthe Millrose Games will again take<br />\nthe half-mile in 1 minute 55 sec- the \"Student Volunteer Union,\" a dance will be held in the gymna- the floor. Verne Booth, whose gal- success caused a flutter of pride in<br />\nonds. It is also said that Griffiths, which is a movement for foreign sium—music being furnished by lant showing nearly placed Hopkins Hopkins circles. He received a dewho won the British half-mile missions. Open discussion of Blue Jay Six. Admission will be second at the Millrose event, will gree here with the late Woodrow<br />\nchampionship last July -is at Cam- American and foreign conditions, $1.50 a couple to the meet and run the mile; Dorcus will take the Wilson, and Dr. C. \\V. Miller, prohalf; Norwood, Hopkins 400-yard fessor in Greek at Johns Hopkins.<br />\nbridge. If he is there, Cambridge especially those which relate to dance; $1.00 single.<br />\nrecord holder, will step that dis- Dr. John H. Latane, dean of the<br />\nThe<br />\nHopkins<br />\nswimmers<br />\nhave<br />\nshould have a wonderful two-mile missionary work is the main reasplit even in their two endeavors tance, and Louis Clarke will show University, when informed of the<br />\nrelay team. Cambridge will com- son for holding the conference. thus far this season. Swarthmore his speed in the 220-yard dash.<br />\nprize winner did not express surpete in one of the medley relay The delegates are all interested in was snowed under by a wide marprise.<br />\nHe said that by comparing<br />\nNorwood and Dorcus are being<br />\nchampionships on Friday, April missionary work.<br />\ngin, but Brown, one of the out- closely followed in the competition some works written by Levermore<br />\nMany prominent speakers will standing teams of the country, for places on the team by \"Bob\" while at Hopkins he had come to<br />\n25th, the first day of the meeting.<br />\nThis means that their great athlete, address the Conference. Mr. Kir- ducked the Homewood fish by a 50- Heyn and Meredith, and one of the conclusion that the New Yorker<br />\n30 count.<br />\nthese men may be taken on at the was the winner.<br />\nAbrahams, will accompany the team. by Page, of New York, will speak<br />\nThe engagement tomorrow night last minute.<br />\nHas Splendid Record<br />\nAbrahams has done 94-5 seconds on \"World Conditions and Inter- should<br />\nbe close and exciting. CathDr.<br />\nClarke will likewise compete in<br />\nLevermore was born at<br />\nfor 100 yards, 21 4-5 seconds for national Relations As Involving olic furnishes fast opposition as a<br />\na series of special dash events Mansfield, Connecticut, on October<br />\nthe 220 yards, 49 3-5 seconds for War\"; Dr. Emory Smith of How- rule, and the Hopkins boys should against the best speed merchants 15, 1856. He received<br />\nan A. B. dethe quarter, and 23 feet 8 3-5 ard University on \"Racial Rela- come out on top only after a hard the East can produce. Clarke<br />\ngree at Yale in 1879 and entered<br />\nis<br />\ninches for the broad jump. He tions\"; Dr. James J. Coale of the struggle.<br />\nextremely fast on an indoor track, Johns Hopkins as a university felWon three events in the Cambridge- Presbyterian Board of Baltimore<br />\nThe makeup of the Hopkins team and has a fine opportunity to walk low in 1884. After receiving his<br />\nOxford, Harvard-Yale meet last on \"Modern Industrialism\"; Mil- is uncertain at this writing. It is off with the honors in one of these Ph. D. degree here he was an<br />\ninJuly and is one of the greatest track ton Stauffer of the Student Vol- hoped that the examinations and events.<br />\nstructor<br />\nof<br />\nhistory<br />\nin<br />\nthe<br />\nUniverathletes in the world. Pennsyl- unteer Movement on \"Missionary blacklist have not taken their toll, The medley relay team will prob- sity of California from<br />\n1886 to<br />\nvania has also invited Eric Liddell, Enterprise as Related to Foreign but as the complete results are not ably go to Washington to run in 1888, and at the Massachusetts InProblems.\"<br />\nOther<br />\nspeakers will ready<br />\nof Edinburgh University,. Scotthe makeup of the team is the Georgetown games on Febru- stitute of Technology from 1888<br />\nbe<br />\nD.<br />\nM.<br />\nChalmers<br />\nof the Union<br />\nland, the British 100 yards and 220<br />\nstill slightly uncertain. The lineup ary 21. Other members of the to 1893. He was president of<br />\nTheological Seminary of RichYards champion, to compete at the<br />\nwill be as follows, if the blacklist squad will be entered in special Adelphi College from 1896 to 1912.<br />\nmond, Dr. Chan of the George<br />\nCarnival. Liddell holds the British<br />\nhas been avoided:<br />\nevents at this meet.<br />\nIn 1913 he became secretary of the<br />\nWashington Hospital, Dr. Marecords for the above distance at<br />\nRelay — Sauerwein, Dunning, The Fifth Regiment-;Hopkins World Peace Foundation, Boston.<br />\nthur of the Hopkins School of Hy9 7-10 seconds and 21 3-5 seconds,<br />\nContinued on page 3, col. 3‘<br />\ngiene and Public Health, Mr. G.<br />\nGames will find the medley team He is also secretary of the New<br />\nrespectively. If he accepts, his<br />\nA. Pachew of Bolivia, and Dean<br />\nstepping out against the country's York Peace Society, the World<br />\nmeeting with the best of our colELECTRIC best. Boston College and George- Court League and League of NaLee of the University of Mary- WESTINGHOUSE<br />\nlege sprinters will be of the keen- land.<br />\nCO. CONDUCTS SPECTAC- town, the only teams holding a vio.- tions Union, and of the American<br />\nest interest.<br />\nULAR EXPERIMENT<br />\ntory over the Hopkins aggregation Association for International CoAny student wishing to attend<br />\nInternational Aspect<br />\nSince 1913 voltages in excess of in the last two 'years, are thought operation. With other leaders of<br />\nthe conference should see the loThe University of Havana, Cuba, cal committee in charge. Those 1,000,000 have been made to per- possible contenders. Pittsburgh and the last mentioned organization he<br />\nis sending up a team to the Carni- who ha-Ve signified their inten- form spectacular phenomena under Navy, two of last year's competi- assisted in forming the League of<br />\nval. Cuba is not strong in track tion of going to the conference the control of a man's finger at the tors, will be on hand, according to Nations Non-Partisan Association<br />\nathletics and they will be put in a are: Randolph Norwood, Karl High Voltage Laboratory of the the latest advices, to compete for in 1923.<br />\nclass race. Occidental College, of Miller, Paul Sylvester, Lee Cham- Westinghouse Electric Company. the Collegiate Medley Relay ChamWas in Hopkins Glee Club<br />\nthe Pacific Slope, has also stated bers, Allison Long, Harry Tylor, Recently, flashing zigzag<br />\npionship.<br />\nJohns<br />\nHopkins<br />\nDr.<br />\nwas<br />\nLevermore is the author of<br />\nthe<br />\narcs<br />\nthat they will have a team in the 'William Gross, Reese (Marsh, and high potential surges were in- victor in this event last year, and \"The Ruplic of New Haven,\" for<br />\nquarter, half and one-mile relay Phillip Pease, Alfred J. McKay, cluded in the demonstrations, which now holds the News Cup, emblem which he won the John Marshall<br />\nchampionships. Occidental has a W. E. Thomsen, Frank Birely, were witnessed by members of the of the championship.<br />\nprize at Johns Hopkins, and of<br />\nvery strong squad of sprinters and Donald Martin, J. A. Abraham, American Institute of Electrical<br />\n\"Syllabus of Lectures Upon PolitWill be hard to beat in these events. Robert Bull, Lowell Ensor, Karl Engineers and some visiting engiSECOND COTILLON OF YEAR ical History,\" since 1815, 1889.<br />\nn<br />\nwill also be represented. Levy, Reno Harp, Richard neers of other countries.<br />\nBesides these, Dr. Levermore wrote<br />\nHELD TUESDAY AT THE<br />\nThus with Canada, Cuba, England Gwinn, A. M. Cleveland, Ralph<br />\na<br />\nseries of year books on the<br />\nThe feature Of the demonstraMD.CASUALTY CLUB<br />\nand<br />\nd Colleges as far west as Cali- Wales, William Trout, Owens tions was the<br />\nLeague<br />\nof Nations, three of which<br />\nforming of a 42-foot<br />\nWith the storm clouds of examifornia represented, half of the Rea, E. A. Schaal, T. M. Ku, A. arc<br />\nhave<br />\nbeen<br />\npublished to date. While<br />\nat a potential of 1,000,000 volts. nations rolling away in the dim<br />\nglobe will be interested in the re- C. Frankwich, and Dr. Mather.<br />\nat<br />\nHopkins,<br />\nDr. Levermore sang<br />\nThis was the largest controlled arc horizon, Johns Hopkins undersults of Pennsylvania's great Carbass<br />\nin<br />\nthe Glee Club. Since then<br />\never made artificially, and it set a graduates, whether or not they<br />\nnival. It is probable also that Aus- CHRISTIAN SERVICE CLUB world's<br />\nrecord for laboratory work. had been struck with the bolt of he has published a number of song<br />\ntralia will send a college team, these<br />\nTO MEET FEB. 11<br />\nThe length of the arc, the tremend- failure, turned in unison to wor- books.<br />\nmen being on their way to the<br />\nClassmates Distinguished<br />\nThe next meeting of the Chris- ous voltage behind it and the deep ship the light hearted Terpsichore,<br />\nOlympic games in Paris next July. tian Service Club will be held on<br />\nThe success of Dr. Levermore reroar that accompanied it, combined goddess of dance. On the evenThe invitations to the Carnival Monday, February 11 at the home<br />\nto produce a peculiar feeling of ing of February the fifth, the last calls the achievements of other men<br />\nhave been out only a week, and al- of William P. McFaul, 4023 Roawe at the mighty electrical forces date on the examination schedule, who received Ph. D. degrees from<br />\nready more than sixty colleges have land Ave. Dr. Paul Harrison,<br />\nunder the control of a man's fin- the Johns Hopkins Cotillon Club Hopkins in 1886. Among them was<br />\nsent word that they will be on hand. known as the \"Prophet of the<br />\ncrave the second cotillon of the the late ex-President Woodrow<br />\nger. Manifestations of high volt- b<br />\nIt looks as if last year's record, Desert\" is a graduate of the Hopages of electricity produce a sensa- year. The music which was ren- Wilson, for whom the nation is<br />\nWhen 112 colleges competed at the kins Medical School, and will be<br />\ndered by eight pieces of Fisher's now mourning. Dr. D. R. Denry<br />\nContinued on page 2 col. 3<br />\nCarnival, will be broken, as many the speaker of the evening. Dr.<br />\nOrchestra was<br />\nexceptionally is professor in political economy at<br />\ncolleges are still to be heard from. Harrison is making a tour of the<br />\ngood. The affair was spirited as Massachusetts Institute of TechWANTED<br />\nInvitations Out<br />\ncountry addressing organizations<br />\nwell as colorful and will go down nology. Dr. John Denry is a philosCandidates<br />\nfor Business<br />\nThe invitations to the schools will similar to the Christian Service<br />\non record as being one of the live- opher at Columbia. Dr. Shosuki<br />\nBoard of Hullabaloo comgo out this week. Judging by the Club and the local club considers<br />\nliest and most successful cotil- Sato is now head of the Agriculmunicate with Jack Lewis,<br />\nearly inquiries, more schools than itself fortunate in having secured<br />\nlons<br />\nin the history of the Cotillon tural College in Japan. Dr. Albert<br />\nBox 491.<br />\nhim for Monday evening.<br />\nContinued on page 4, col. 3<br />\nI Club.<br />\nContinued on page 4, col. 2.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS - LETTER, FEBRUARY 8, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Mane ver<br />\nA. J. McKAY, '26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON,'24<br />\nC. EUGENE TOVELL,'24<br />\nOTHO J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS. '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 8, 1924<br />\n<br />\nWOODROW WILSON<br />\nWoodrow Wilson received his A. B. at Princeton. Princeton,<br />\nhowever, cannot claim him. He received his Ph. D. at Johns' Hopkins; but Hopkins cannot claim him. Wilson belonged to America<br />\nand America mourns his loss as the rest of the world bows its head<br />\nin tribute.<br />\nAlthough Hopkins cannot point to Mr. Wilson as their own, they<br />\ncan take a certain amount of pride in him and in his achievements.<br />\nContemporary press notices term him as \"imperialistic,\" as \"dictatorial,\" as \"idealistic.\" And still we are proud of him. We feel<br />\nthat although, at present, much of the good that he accomplished is<br />\n\"interred with his bones,\" it will arise and history will view Woodrow<br />\nWilson as one of the great of the great Americans. We are glad<br />\nthat Johns Hopkins is able to claim even a small part of his reflected<br />\nglory.<br />\nMr. Wilson may have had his faults. It may be that the allegation that he was \"dictatorial\" is true. He was undoubtedly \"idealistic.\" Throughout the years of his Presidency, however, he was<br />\nstriving for the good of his country and for the good of mankind.<br />\nHe thought that he had found a cure that would eliminate one of<br />\nthe greatest evils of humanity. And he gave his life while endeavoring to tender this supposed solution to an unsympathetic, unbelieving<br />\nand unresponsive nation.<br />\nIt is for posterity alone to pass judgment upon Woodrow Wilson<br />\nas a statesman. We, the undergraduates of Johns Hopkins University, can only say that we are proud of him and proud of his connection with Hopkins. And with the rest of the world we bow our<br />\nheads in admiration and in sorrow.<br />\n<br />\nNOTICES<br />\nTrack practice will be<br />\nheld daily in preparation for<br />\nHopk in s-Fifth Regiment<br />\ngames. Candidates see Fred<br />\nGeib, Manager.<br />\nThe Annual Home Concert by the Musical Club will<br />\nbe held at the Maryland Casualty Clubhouse on Feb. 21.<br />\nGet your non-athletic cards<br />\nredeemed by Mike Tilghman at the Barn any noon.<br />\nHopkins vs. Catholic University tomorrow night at<br />\nBaltimore Athletic Club pool<br />\nat 8 P. M. Dancing after<br />\nmeet.<br />\nRehearsal of the Glee Club<br />\nat the Barn at 4 P. M. Sunday. Important. All members urged to attend. Mr.<br />\nBochau will be there.<br />\n<br />\n\"XC\"<br />\nCORONA<br />\n<br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br />\n<br />\nThe St. REGIS<br />\n<br />\nHave you<br />\nseen it?<br />\n<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n<br />\n41Something new in portable<br />\ntypewriters.<br />\n<br />\n(Half Block below North Ave.)<br />\n<br />\n(Lit writes nearly all languages.<br />\n<br />\nNicholas Brown, Mgr.<br />\n<br />\n41Has 90 characters.<br />\nSee Fred Rich, College<br />\nRepresentative<br />\n118 W. FAYETTE ST.<br />\nBALTIMORE, MD.<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br />\n<br />\nWESTINGHOUSE EXPERIMENTS<br />\nContinued from page 1<br />\ntion which, witnesses find hard to<br />\ndefine.<br />\nFollowing the forming of the arc,<br />\nthere was a demonstration of the<br />\nefficiency of the horn gap. A 15foot horn was constructed and an<br />\narc was induced at a potential of<br />\n200,000 volts. The arc rose slowly,<br />\ndue to the hot air produced with a<br />\ntearing noise, to the end of the<br />\nhorn, blew out and immediately reestablished at the base. It rose<br />\nagain and again until the circuit<br />\nwas opened. This self-extinguishing feature is used daily on power<br />\nsystems to relieve surges and lightning strokes. This is a spectacular<br />\ntest and is an exhibition that witnesses do not soon forget.<br />\nThe next tests, were insulator<br />\nflashovers. In these tests a dry insulator post, built up of several<br />\nunits, was flashed over a potential<br />\nof 800,000 volts. Following this,<br />\nthe column was covered with a<br />\nheavy water spray to approximate<br />\nconditions during a torrential rainstorm, and it flashed over a potential of 650,000 volts, showing the<br />\nwet insulator to be over 80 per<br />\ncent as efficient as the dry insulator. This was a remarkably high<br />\nratio and attributed to excellent design.<br />\n<br />\nSTETSONc2<br />\n<br />\nBats<br />\nIn buying a Stetson you need only be concerned with the style—the quality is guaranteed by the name “Stetson\".<br />\nSTYLED<br />\n<br />\nFOR YOUNG<br />\n<br />\nMENi<br />\n<br />\nWhat awhale ofa difference<br />\njust afew cents n-p,ke!\"<br />\n<br />\nTHE EVILS OF EXAMINATIONS?<br />\nMid-years have come and gone and have, left in their wake the<br />\nannual toll. Despite the fact that the period of time devoted to<br />\nexaminations was materially lengthened, indications seem to show<br />\nthat the casualty list is as great, if not greater, than usual. Rumors<br />\nare numerous at this time but it seems probable that a number of<br />\nundergraduates have been ejected by means of the automatic threefailure route.<br />\nRecently, in commenting upon the lengthening of the examination<br />\nperiod, the NEWS-LETTER said: \"Failures under the new system can be<br />\ndue only to inherent stupidity or lack of application.\" And, allowing<br />\nfor inevitable exceptions, we repeat this. The evils attached to the<br />\npresent system may be numerous; the strain may be great; the<br />\nresults may not be in proportion to the worth of the individual student. We fail to see, however, how a man of average intelligence<br />\nwho has prepared methodically could fall below passing mark in<br />\nthree examinations.<br />\nWhatever excuses the unfortunates may present to the Board<br />\n.of Collegiate Studies, they cannot reasonably attribute their misfortune to the \"evils of examinations.\"<br />\n<br />\n—all the difference<br />\nbetween just an ordinary cigarette<br />\nand—FATIMA,the most skillful<br />\nblend in cigarette history.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS.LETTER, FEBRUARY 8, 1924<br />\n<br />\n3<br />\n<br />\nINFLUENCE OF JOHNS HOPKINS ON WOODROW WILSON AS fered by the Union may be ob50-Yard Dash—Lord, Sauerwein<br />\n220-yard Swim—Bahlke, CalA GRADUATE STUDENT MANIFESTED IN HIS<br />\ntained from the Secretary, Profes- and Welsh.<br />\nhoun.<br />\nLIFE'S WORK<br />\nsor J. W. Cunliffe, Journalism<br />\nPlunge—Howard and. Hamble100-yard Dash—Lord, Bahlke,<br />\nDeceased President Always Showed Great Interest in University Af- Building, Columbia University, ton.<br />\nWelsh.<br />\nNew York City.<br />\n100-Yard Back Stroke—Stevens, The meet will start at 8 o'clock<br />\nfairs. Instrumental in Organizing Glee Club and<br />\nBahlke, Dunning.<br />\nsharp.<br />\nDebating Council<br />\n•<br />\nVARSITY<br />\nNATATORS<br />\nTO<br />\nSWIM<br />\nWoodrow Wilson spent four years at the Johns Hopkins UniAGAINST CATHOLIC U.<br />\nversity studying Economics and Political Science under Professors<br />\nContinued from page I<br />\nEly and Adams. The influences he received at that time can be<br />\nBahlke<br />\nand<br />\nLord. (It is possible<br />\ntraced throughout the entire after life of our dead President.,<br />\nthat<br />\nWelsh<br />\nmay<br />\nswim.)<br />\nThe world came very near not having the leadership of WoodDiving—Lord, Stone, Calhoun.<br />\nrow Wilson during the World War. In 1882, his first year at Hopkins, he was undecided whether to specialize in Political Science, or<br />\nPsychology. Professor Hall, the famous psychologist, tells in his<br />\nautobiography that he accompanied Woodrow Wilson on a long walk<br />\nwhile they debated whether the future President should follow the<br />\none course- or the other. \"Finally,\" he says, \"the inheritance from<br />\nhis Virginia ancestors and his early training called him to Political<br />\nScience.\"<br />\nAt Hopkins first, Mr. Wilson<br />\n(This is the way one user describes Williams and the new Hinge-Cap)<br />\nbecame known as a most brilliant<br />\nAMERICAN UNIVERSITY<br />\ngraduate student.<br />\nIn the EcoMen buy Williams expecting to find<br />\nUNION MOVES PARIS<br />\nnomic Seminary he was scribe,<br />\ntheir main satisfaction in the HingeOFFICE<br />\nand his records of Professor Ely's<br />\nCap. But when they first use the<br />\nremarks are among the prized posThe Bulletin of the American<br />\ncream they get an equally pleasant<br />\nsessions of the University.<br />\nUniversity Union, just issued,<br />\nsurprise. The heavier lather, the<br />\ngreater thoroughness with which it<br />\nThe . qualities manifested by calls attention to the removal of<br />\nsoftens the beard, make a hit at once.<br />\nMr. Wilson while at. Hopkins are the Paris office to more commoThen, Williams lather lubricates the<br />\nNeatly combed, well-kept hair is a<br />\nthe same which were evident in all dious quarters at 173 Boulevard<br />\nbusiness and social asset.<br />\nskin<br />\nso that the razor fairly \"glides\"<br />\nSTACOMB makes the hair stay combed<br />\nhis later endeavors. In the semi- St. Germain, where students and<br />\nin any style you like even after it has<br />\nthe hairs off. And last, there's that<br />\nnary discussions he developed his professors visiting France will rejust been washed.<br />\ndelightful after-care of the skin.<br />\nSTACOMB—the original—has been<br />\nnaturally gigantic powers of ceive a cordial welcome from the<br />\nTruly, you'll find that with the Hingeused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nlogical reasoning. A definite con- Director, Professor Alg-eron ColCap Williams is \"miles ahead.\" It's<br />\nfor free trial tube.<br />\nclusion, reached after straight and man, (Chicago), and from Dr. H.<br />\npure cream without coloring matter<br />\na<br />\nJars-75c<br />\nTubes-35c<br />\nsearching thought, he would de- S. Kraus, (Columbia), Assistant<br />\nof any kind.<br />\nInsist on STACON1B—in the black,<br />\nyellow and gold package.<br />\nfend against the most adverse Director. The retiring Director,<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\ncriticism. The University had Professor Paul VanDyke (Prince$250 in prizes<br />\nStandard Laboratories, Inc.<br />\nfixed certain maximum length for ton) in his annual Report states<br />\nFor thebest sentence of ten words or less on the value of theWilliams Hinge-Cap,<br />\n750 Stanford Avenue Los Angeles, California<br />\nwe offer the following prizes: 1st prize $100; 2nd prize $50; two 3rd prizes,$25 each;<br />\nthe doctorate dissertation. Mr. that during the past year the<br />\nSend coupon for Free Trial Tube.<br />\ntwo 4th prizes,$10 each; six 5th prizes,$5 each. Any undergraduate or graduate<br />\n—<br />\nstudent is eligible. If two or more persons submit identical slogans deemed worthy<br />\nWilson wrote a thesis which was Union registered 1392 American<br />\nSTANDARD LABORATORIES,Inc.<br />\nof prizes, the full amount of the prize will be awarded to each. Contest closes at<br />\n750 Stanford Ave., Loe Angeles, California. Dept. 1<br />\nmidnight March 14,1924. Winners will be announced as soon thereafter as possible.<br />\nPlease send me free trial tube.<br />\nlonger than the accepted length, students, of whom 700 were womSubmit any number of slogans but write on one side of paper only, putting name,<br />\naddress, college and class at top of each sheet. Address letters to Contest Editor,<br />\nBarns<br />\nen<br />\nand had it published in book form<br />\nand 692 men; 1164 were<br />\nThe J. B. Williams Co.,Glastonbury, Conn.<br />\nAddress<br />\nbefore receiving the degree. He working at the University of<br />\npersisted that they accept his the- Paris and 325 followed courses<br />\nsis as it stood. They did; and (including- Summer courses) at<br />\nsubsequently enacted the present provincial universities. Dr. Geo.<br />\nrule that any suitable published E. MacLean, retiring Director of<br />\nform of the doctorate thesis is ac- the British division, reports 1255<br />\nregistrations, and Mr. R. H. Simpcepted.<br />\nAs a result of his training here son, the Assistant Director, sumhe turned his efforts toward marizes the different lines of<br />\nteaching; and the habit of ab- work undertaken by the London<br />\nstract unemotional consideration Office. Copies of this and of anof a problem, which is that of other Bulletin including letters<br />\nmany great teachers and think- from professors and students who<br />\nhave made use of the facilities ofContinued on page 4 col. 3<br />\n<br />\n\"The perfect<br />\ncream in the perfect container\"<br />\n<br />\nFo<br />\nunruly iair<br />\n<br />\nWilliams<br />\nShaving<br />\nCream<br />\n<br />\nFor this he was<br />\nsent to prison<br />\nROGER BACON<br />\n1214-1294<br />\n<br />\nEnglish philosopher and man<br />\nof science. Studied at Oxford<br />\nand the University of Paris.<br />\nWrote the Opus Majus, Opus<br />\nMinus, Opus Tertium, and<br />\nmany other treatises.<br />\n<br />\nIn an age of abstract speculation he boldly<br />\nasserted the mathematical basis of all the<br />\nsciences. But even mathematical calculation, he showed, must be verified by experiment, which discovers truths that speculation could never reach.<br />\n<br />\nMake Your College Paper<br />\nWrite your \"copy\" on a Remington Portable.<br />\nClean,legible copy will catch the editor. Use the<br />\nmachine also for your everyday work and persona)<br />\ncorrespondence. You will be surprised how much<br />\ntime and labor it will save.<br />\nCompact—fits in a case only four inches high.<br />\nConvenient—you can use it on your lap, if you wish, for it<br />\ncarries its table on its back.<br />\nComp/ete—with four-row keyboard,like the big machines,an<br />\nother 'big machine\" conveniences.<br />\nPrice, complete with case, $60. Easy payment terms if desired<br />\n<br />\nRemington<br />\n<br />\nRoger Bacon may not have invented gunpowder, as has been claimed by some biographers of the famous Franciscan friar, but<br />\nhe exploded some of the outstanding errors<br />\nof thirteenth century thought. Because of<br />\nhis advanced teachings, Bacon spent many<br />\nyears of his life in prison.<br />\n<br />\nMore than a million dollars a year is devoted to<br />\nresearch by the General<br />\nElectric Company in<br />\norder that the giant —<br />\nelectricity —may be<br />\nmade more and more<br />\nuseful to mankind.<br />\n<br />\nIn the Research Laboratories of the General Electric Company, Bacon's principles<br />\nare followed in every experimental investigation. The gas-filled electric lamp and<br />\nthe electron tube were worked out on<br />\npaper, but it was experimental verification<br />\nofthe underlying mathematical theory that<br />\nmade electric illumination, radio broadcasting and X-rays what they are today.<br />\n<br />\nPortable<br />\nRemington Typewriter Co.<br />\n25 W. Fayette St.<br />\nBaltimore<br />\n<br />\nGENERAL ELECTRIC<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 8, 1924<br />\n<br />\n4<br />\n<br />\nBe a Newspaper Correspondent<br />\nwith the Heacock Plan and earn a<br />\ngood income while learning; we<br />\nshow you how; begin actual work<br />\nat once; all or spare time; experience unnecessary; no canvas sing;<br />\nsend for particulars.<br />\nNewswriters Training Bureau<br />\nBuffalo, N. Y.<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br />\n<br />\nHOPKINS INFLUENCE MANIFESTED IN WILSON'S<br />\nWORK<br />\nShaw is winning fame as editor of<br />\nContinued from page 3<br />\nthe \"Review of Reviews.\" Dr. F.<br />\nM. Warren is professor in romance ers, was characteristic of WoodDr. Arthur row Wilson at Johns Hopkins.<br />\nlanguages of Yale.<br />\nof<br />\ngovernor<br />\nbecome<br />\nYeiger has<br />\nThese characteristics, which<br />\nPorto Rico, and Daniel Randall is<br />\nmay have been evident before,<br />\na prominent Baltimore lawyer.<br />\nwere given great opportunity for<br />\ngrowth in the quarter century of<br />\nCOLLEGE REPRESENTATIVE<br />\nteaching and graduate work.<br />\nwanted by one of our clients to<br />\nhandle a line of collegiate clothes. Later, as President of the United<br />\nThis manufacturer sells direct to States, Woodrow Wilson brought<br />\nthe college man and he wants a<br />\nhimself much approval and, at<br />\nfraternity man with a large fol- on<br />\nlowing. Exceptional proposition times, condemnation by the exerwith highest commissions paid.<br />\ncise of these same characteristics.<br />\nrationality, and<br />\nCOLLEGIATE SPECIAL Clear thinking,<br />\noften disqualitoo<br />\nAdvertising Agency, Inc. idealism are<br />\nfied by prejudice and jealousy.<br />\nAvenue, New York City<br />\nALUMNUS WINS PRIZE<br />\nContinued from page 3<br />\n<br />\nTHE FAMOUS OLYMPIC TOUR<br />\nBOOKINGS ARE MADE NOW FOR THE TRIP TO<br />\n<br />\nTHE OLYMPIC GAMES 1924<br />\nTHE COLLEGIATE TRIP<br />\n<br />\nDuring 30 days stay in Paris you will witness<br />\nthe Games,stop in a good Hotel, see the sights<br />\non special busses, make an excursion to Versailles, to Rouen, to Fontainebleau, have a special train bring you from and to the steamer at<br />\nCherbourg, and you also eat—three times a<br />\nday and plenty. Everything included at the unprecedented figure of<br />\n<br />\n$375<br />\n<br />\n503 Fifth<br />\n<br />\nActive in Student Affairs<br />\n<br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\nctiMILEENEDESaigillugmag=<br />\n<br />\nHOTOD,0E12<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n111#141R/Re1141010.14PReeekl4ic ,q4,014.014 014 014<br />\n<br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts... $3.00, $3.50 and $4.00<br />\n$3.30 and $4.40<br />\nNegligee<br />\n$5.50 and $6.60<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 days on Shirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nALWAYS USE A<br />\n<br />\nYELLOW CAB<br />\nOR PHONE<br />\n<br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br />\n<br />\nHowever greatly Mr. Wilson<br />\nwas influenced by Hopkins, he left<br />\nat Hopkins evidences of his own<br />\ninfluence. In 1884 Woodrow Wilson was a member of the first<br />\nJohns Hopkins Glee Club. A picture of this was published recentis H.St OSCAR G•L NAY<br />\nly in the Baltimore Sun showing<br />\nOWN ERS<br />\nhim with the other tenors of the<br />\n0Pb°<br />\nclub. Woodrow Wilson organ2'it*IDE*.\"1*<br />\n29 E. BALTIMORE ST.<br />\nized a debating society using the<br />\nAgents for JOHN B. STETSON HATS British House of Commons as a<br />\nand FRATERNITY BANDS<br />\nmodel. It was named the \"House<br />\nof Commons.\" These were the<br />\n\"student activities\" of Mr. Wilson.<br />\nAs a Teacher and lecturer Mr.<br />\nWilson made the most permanent<br />\nimpression on Hopkins. For<br />\nnearly a decade he gave an annual<br />\ncourse of lectures on political science. Among those of the present faculty who studied under the<br />\nfuture President are Dean Latane<br />\nand Dr. Hollander. By all who<br />\nhad that opportunity, Mr. Wilson's lectures are remembered as<br />\nbrilliant and witty ; and the man<br />\nHe has the pride of the peacock, the<br />\ncourage of the lion and the combined<br />\nhim. self as one who had a pronerve of the whole menagerie. And<br />\nwhy? Because he is sure of himself<br />\nfound grasp of his subject.<br />\nof his appearance.<br />\n<br />\nFROM NEW YORK TO NEW YORK<br />\nSEND FOR CIRCULAR A-19<br />\n<br />\nVICTOR H. KIFFE<br />\n<br />\noibeXatterle)<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD.KOHN 8c Co.<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nCorner CJayelie and<br />\n<br />\n—and sure<br />\n<br />\nAlways Interested in Hopkins<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nand individuality is offered here at prices that are not<br />\nAfter leaving the University,<br />\ninshow<br />\nto<br />\nand cannot be underquoted by any house at any time.<br />\nMr. Wilson continued<br />\nDr.<br />\nWhen<br />\nterest in its affairs.<br />\nBesides the reputation of an old-established firm<br />\nas President of<br />\nEvery \"Vaseline\" product is recresigned<br />\nRemsen<br />\nof each sale with a guarantee.<br />\nis<br />\nback<br />\nommended everywhere because of<br />\nits absolute purity and effectiveness.<br />\nJohns Hopkins University in 1914,<br />\n.Mr. Wilson gave much of his<br />\ntime in efforts to help the advisory<br />\nDECORATIONS<br />\nFURNITURE<br />\nDRAPERIES<br />\nboard select a worthy successor<br />\nNORTH<br />\n343<br />\nSTREET<br />\nCHARLES<br />\nto Dr. Remsen. Although at that<br />\ntime President of the United<br />\nStates he was interested in securChesebrough Mfg.Co. ing a man who would maintain<br />\n(Consolidated)<br />\nHopkins traditions.<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nThe death of Mr. Woodrow<br />\nPROGRAM FOR STUDENTS<br />\nWilson is a source of great soradand<br />\nST.<br />\nLIBERTY<br />\nBIBLE CLASS, 10 A. M.<br />\nrow to his many friends<br />\nAn Interesting Discussion of<br />\nAT SARATOGA mirers at Hopkins. He is, withVital Topics Under<br />\nout doubt, the greatest of the<br />\nDR.<br />\nLUNCHEON<br />\nHOWARD A. KELLY, Leader<br />\nmany famous sons of Hopkins.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nVaseline<br />\n<br />\nr<br />\n<br />\nHAIR TONIC<br />\n<br />\nMount Vernon PlaceM.E.Church<br />\n<br />\nTEA<br />\nEstablished 1873<br />\n<br />\nDINNER<br />\n<br />\nA. H. FETTING MAN'FG<br />\nJEWELRY CO.<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\nManufactured by<br />\n<br />\nWIGHT & HUMPHRIES<br />\n<br />\nA. JACOBS & SONS<br />\nTailors<br />\nUniforms and Liveries<br />\n128 W. FAYETTE ST.<br />\nBaltimore, Md.<br />\nNear Liberty St.<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nJAS. H. DOWNS<br />\n<br />\nYOUNG PEOPLES AT-HOME<br />\n5-7 P. M.<br />\n<br />\nPENN RELAY CARNIVAL<br />\nContinued from page 1<br />\n<br />\never will attend. Last year there<br />\nwere over 450 schools represented.<br />\nPLAZA 6987<br />\nIt is going to be very difficult to<br />\nhandle the games in the two days<br />\nallotted to them.<br />\nThe Carnival will be of especial<br />\nimportance this year, because of<br />\nthe keen competition for the Olympic team that will represent this<br />\ncountry in Paris this year. The<br />\nRelay Carnival will give the college<br />\nathletes of the entire country a<br />\nchance to show their ability, and<br />\nthe results will no doubt have a<br />\nbearing on the ultimate decision of<br />\nthe Olympic Committee in choosing the American team.<br />\nAny schools or colleges desiring<br />\nPrinters of<br />\nto attend the Carnival may do so<br />\ncrhe Johns Hopkins<br />\nas all are invited, by writing to the<br />\nManager of the Carnival, George<br />\nNEWS.-LETTER<br />\nW. Orten, 3301 Walnut Street,<br />\n<br />\n11.30 A. M.<br />\nManufacturers<br />\nuntil<br />\nGreek Letter Fraternity Jewelry<br />\n7.30 P. M<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\n<br />\nAztaw Sts.<br />\n<br />\n-Where Wholesale and Retail Districts Meet\"<br />\n<br />\n(The Sta<br />\n<br />\nAs the last and cleverest touch to his<br />\ntoilet, he smooths his mane with-Vaseline\" Hair Tonic. His head stays dapper<br />\nand sleek throughout the giddiest<br />\nwhirls.<br />\n-Vaseline\" Hair Tonic improves the<br />\nhair. At all drug stores and student<br />\nbarber shops.<br />\n<br />\nNEW YORK, N. Y.<br />\n<br />\n505 FIFTH AVE.<br />\n<br />\nTEA SERVED AT 6 O'CLOCK<br />\n<br />\nSPECIAL PARTIES<br />\n<br />\nENGRAVER PRINTER STATIONER<br />\nLOMBARD and SOUTH STREETS<br />\n229 N. CHARLES ST.<br />\n<br />\nPhiladelphia, Pa.<br />\n<br />\nEPWOR1 H LEAGUE<br />\n7-8 P. M.<br />\nSPECIAL STUDENTS AT-HOME<br />\nFEBRUARY 17<br />\n<br />\nAt the Washington Monument<br />\n<br />\nCOME DOWN AND<br />\nGET ACQUAINTED<br />\n<br />\nSafe Deposit & Trust Co.<br />\nOF BALTIMORE<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\n<br />\nJohn J. Nelligan, President<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No 31<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 8,1924<br /><br />\nPENN RELAYS OUTSTANDING TRI-STATE STUDENT VOLUNTRACK AND FIELD EVENT<br />\nTEER CONFERENCE STARTS<br />\nAT HOOD COLLEGE<br />\nOF COMING SEASON<br />\nEngland, Canada, Cuba, and Western Representatives from Maryland, DelaStates Are Sending Teams. Over<br />\nware and Washington to Be Present.<br />\n450 Schools Represented<br />\nJ. H. U. to Send Twenty-seven<br /><br />\nThe Trustees of the Johns<br />\nHopkins University on behalf<br />\nof the Board, the Faculty. the<br />\nAlumni and the students of<br />\nthe University extend to Mrs.<br />\nWoodrow Wilson their sympathy in the loss of her distinguished husband, a graduate of this University, whose<br />\nhigh ideals uplifted the Nation<br />\nand whose great abilities nobly<br />\nserved it in time of peril.<br /><br />\nPRICE 5 CENTS<br /><br />\nVARSITY MEDLEY RELAY HOPKINS<br />\nALUMNUS<br />\nRETEAM TO COMPETE IN<br />\nCEIVES BOK PRIZE OF<br />\nWILCO GAMES FEB. 16<br />\n$100,000<br />\nBooth, Clarke, Dorcus and Norwood Dr. Levermore's Plan to Preserve InExpected to Represent Black<br />\nternational Peace Chosen by Ameriand Blue<br />\ncan Peace Award Committee<br /><br />\nPennsylvania's thirtieth annual<br />\nBeginning with a \"get-together<br />\nHopkins will send a medley reDr. Charles Herbert Levermore,<br />\nrelay race carnival will this year supper\" at 6 P. M. on Feb. 8 the<br />\nwho<br />\nreceived his Ph. D. degree in<br />\nlay team to the Wilco Games, New<br />\n1886<br />\nin the graduate department of<br />\nbe finer than ever. Cambridge Uni- annual Tri-State Student VolunYork, February 16. At the recent<br />\nthe Johns Hopkins University, has<br />\nversity, England, has sent word teer Conference will enter into a<br />\nMillrose Games, Hopkins finished<br />\nbeen chosen as the winner of the<br />\nthat they will be represented. W. three day session, at Hood Colthird, back of Boston College and<br />\n$100,000 prize offered by Edward<br />\nR. Bristowe, the captain of the lege, Frederick. Delegates from<br />\nGeorgetown. However, the team W. Bok for the best plan<br />\nto preCambridge team wrote that as yet Student Branches of the Y. M. C. VARSITY<br />\nNATATORS TO was not exactly prepared for the serve international peace. At a<br />\nSWIM AGAINST CATHthey had not decided on what dis- A. and 'the Y. W. C. A. of instirace, as it was run in the middle meeting of the policy committee of<br />\nOLIC U. TOMORROW<br />\nof the examination period. A bet- the American Peace Award in Philtance they will choose. It is prob- tutions in Maryland, Delaware<br />\nable, however, that they will de- and the District of Columbia will Black List May Interfere With Entries. ter showing is thought probable by adelphia, February the fourth,<br />\nJohns Hopkins swimmers will Coach \"Jimmy\" Le Cato, now that John W. Davis presented Dr. Levcide on the two-mile distance, as be present at this conference lastcompete with Catholic University the mental burden is lifted from ermore with $50,000. If Congress<br />\nthey have in college Mountain, ex- ing over Feb. 8, 9, and 10.<br />\naccepts the plan the Hopkins eduthe men.<br />\nchampion half-miler of England, The conference is an annual af- at the Baltimore Athletic Club pool<br />\ncator will receive another $50,000..<br />\nThe<br />\nteam<br />\nsame<br />\nthat<br />\nperformed<br />\nin<br />\ntomorrow night. After the meet<br />\nand Lowe, both of whom have run fair held under the auspices of<br />\nThe news of Dr. Levermore's<br />\nthe Millrose Games will again take<br />\nthe half-mile in 1 minute 55 sec- the \"Student Volunteer Union,\" a dance will be held in the gymna- the floor. Verne Booth, whose gal- success caused a flutter of pride in<br />\nonds. It is also said that Griffiths, which is a movement for foreign sium—music being furnished by lant showing nearly placed Hopkins Hopkins circles. He received a dewho won the British half-mile missions. Open discussion of Blue Jay Six. Admission will be second at the Millrose event, will gree here with the late Woodrow<br />\nchampionship last July -is at Cam- American and foreign conditions, $1.50 a couple to the meet and run the mile; Dorcus will take the Wilson, and Dr. C. \\V. Miller, prohalf; Norwood, Hopkins 400-yard fessor in Greek at Johns Hopkins.<br />\nbridge. If he is there, Cambridge especially those which relate to dance; $1.00 single.<br />\nrecord holder, will step that dis- Dr. John H. Latane, dean of the<br />\nThe<br />\nHopkins<br />\nswimmers<br />\nhave<br />\nshould have a wonderful two-mile missionary work is the main reasplit even in their two endeavors tance, and Louis Clarke will show University, when informed of the<br />\nrelay team. Cambridge will com- son for holding the conference. thus far this season. Swarthmore his speed in the 220-yard dash.<br />\nprize winner did not express surpete in one of the medley relay The delegates are all interested in was snowed under by a wide marprise.<br />\nHe said that by comparing<br />\nNorwood and Dorcus are being<br />\nchampionships on Friday, April missionary work.<br />\ngin, but Brown, one of the out- closely followed in the competition some works written by Levermore<br />\nMany prominent speakers will standing teams of the country, for places on the team by \"Bob\" while at Hopkins he had come to<br />\n25th, the first day of the meeting.<br />\nThis means that their great athlete, address the Conference. Mr. Kir- ducked the Homewood fish by a 50- Heyn and Meredith, and one of the conclusion that the New Yorker<br />\n30 count.<br />\nthese men may be taken on at the was the winner.<br />\nAbrahams, will accompany the team. by Page, of New York, will speak<br />\nThe engagement tomorrow night last minute.<br />\nHas Splendid Record<br />\nAbrahams has done 94-5 seconds on \"World Conditions and Inter- should<br />\nbe close and exciting. CathDr.<br />\nClarke will likewise compete in<br />\nLevermore was born at<br />\nfor 100 yards, 21 4-5 seconds for national Relations As Involving olic furnishes fast opposition as a<br />\na series of special dash events Mansfield, Connecticut, on October<br />\nthe 220 yards, 49 3-5 seconds for War\"; Dr. Emory Smith of How- rule, and the Hopkins boys should against the best speed merchants 15, 1856. He received<br />\nan A. B. dethe quarter, and 23 feet 8 3-5 ard University on \"Racial Rela- come out on top only after a hard the East can produce. Clarke<br />\ngree at Yale in 1879 and entered<br />\nis<br />\ninches for the broad jump. He tions\"; Dr. James J. Coale of the struggle.<br />\nextremely fast on an indoor track, Johns Hopkins as a university felWon three events in the Cambridge- Presbyterian Board of Baltimore<br />\nThe makeup of the Hopkins team and has a fine opportunity to walk low in 1884. After receiving his<br />\nOxford, Harvard-Yale meet last on \"Modern Industrialism\"; Mil- is uncertain at this writing. It is off with the honors in one of these Ph. D. degree here he was an<br />\ninJuly and is one of the greatest track ton Stauffer of the Student Vol- hoped that the examinations and events.<br />\nstructor<br />\nof<br />\nhistory<br />\nin<br />\nthe<br />\nUniverathletes in the world. Pennsyl- unteer Movement on \"Missionary blacklist have not taken their toll, The medley relay team will prob- sity of California from<br />\n1886 to<br />\nvania has also invited Eric Liddell, Enterprise as Related to Foreign but as the complete results are not ably go to Washington to run in 1888, and at the Massachusetts InProblems.\"<br />\nOther<br />\nspeakers will ready<br />\nof Edinburgh University,. Scotthe makeup of the team is the Georgetown games on Febru- stitute of Technology from 1888<br />\nbe<br />\nD.<br />\nM.<br />\nChalmers<br />\nof the Union<br />\nland, the British 100 yards and 220<br />\nstill slightly uncertain. The lineup ary 21. Other members of the to 1893. He was president of<br />\nTheological Seminary of RichYards champion, to compete at the<br />\nwill be as follows, if the blacklist squad will be entered in special Adelphi College from 1896 to 1912.<br />\nmond, Dr. Chan of the George<br />\nCarnival. Liddell holds the British<br />\nhas been avoided:<br />\nevents at this meet.<br />\nIn 1913 he became secretary of the<br />\nWashington Hospital, Dr. Marecords for the above distance at<br />\nRelay — Sauerwein, Dunning, The Fifth Regiment-;Hopkins World Peace Foundation, Boston.<br />\nthur of the Hopkins School of Hy9 7-10 seconds and 21 3-5 seconds,<br />\nContinued on page 3, col. 3‘<br />\ngiene and Public Health, Mr. G.<br />\nGames will find the medley team He is also secretary of the New<br />\nrespectively. If he accepts, his<br />\nA. Pachew of Bolivia, and Dean<br />\nstepping out against the country's York Peace Society, the World<br />\nmeeting with the best of our colELECTRIC best. Boston College and George- Court League and League of NaLee of the University of Mary- WESTINGHOUSE<br />\nlege sprinters will be of the keen- land.<br />\nCO. CONDUCTS SPECTAC- town, the only teams holding a vio.- tions Union, and of the American<br />\nest interest.<br />\nULAR EXPERIMENT<br />\ntory over the Hopkins aggregation Association for International CoAny student wishing to attend<br />\nInternational Aspect<br />\nSince 1913 voltages in excess of in the last two 'years, are thought operation. With other leaders of<br />\nthe conference should see the loThe University of Havana, Cuba, cal committee in charge. Those 1,000,000 have been made to per- possible contenders. Pittsburgh and the last mentioned organization he<br />\nis sending up a team to the Carni- who ha-Ve signified their inten- form spectacular phenomena under Navy, two of last year's competi- assisted in forming the League of<br />\nval. Cuba is not strong in track tion of going to the conference the control of a man's finger at the tors, will be on hand, according to Nations Non-Partisan Association<br />\nathletics and they will be put in a are: Randolph Norwood, Karl High Voltage Laboratory of the the latest advices, to compete for in 1923.<br />\nclass race. Occidental College, of Miller, Paul Sylvester, Lee Cham- Westinghouse Electric Company. the Collegiate Medley Relay ChamWas in Hopkins Glee Club<br />\nthe Pacific Slope, has also stated bers, Allison Long, Harry Tylor, Recently, flashing zigzag<br />\npionship.<br />\nJohns<br />\nHopkins<br />\nDr.<br />\nwas<br />\nLevermore is the author of<br />\nthe<br />\narcs<br />\nthat they will have a team in the 'William Gross, Reese (Marsh, and high potential surges were in- victor in this event last year, and \"The Ruplic of New Haven,\" for<br />\nquarter, half and one-mile relay Phillip Pease, Alfred J. McKay, cluded in the demonstrations, which now holds the News Cup, emblem which he won the John Marshall<br />\nchampionships. Occidental has a W. E. Thomsen, Frank Birely, were witnessed by members of the of the championship.<br />\nprize at Johns Hopkins, and of<br />\nvery strong squad of sprinters and Donald Martin, J. A. Abraham, American Institute of Electrical<br />\n\"Syllabus of Lectures Upon PolitWill be hard to beat in these events. Robert Bull, Lowell Ensor, Karl Engineers and some visiting engiSECOND COTILLON OF YEAR ical History,\" since 1815, 1889.<br />\nn<br />\nwill also be represented. Levy, Reno Harp, Richard neers of other countries.<br />\nBesides these, Dr. Levermore wrote<br />\nHELD TUESDAY AT THE<br />\nThus with Canada, Cuba, England Gwinn, A. M. Cleveland, Ralph<br />\na<br />\nseries of year books on the<br />\nThe feature Of the demonstraMD.CASUALTY CLUB<br />\nand<br />\nd Colleges as far west as Cali- Wales, William Trout, Owens tions was the<br />\nLeague<br />\nof Nations, three of which<br />\nforming of a 42-foot<br />\nWith the storm clouds of examifornia represented, half of the Rea, E. A. Schaal, T. M. Ku, A. arc<br />\nhave<br />\nbeen<br />\npublished to date. While<br />\nat a potential of 1,000,000 volts. nations rolling away in the dim<br />\nglobe will be interested in the re- C. Frankwich, and Dr. Mather.<br />\nat<br />\nHopkins,<br />\nDr. Levermore sang<br />\nThis was the largest controlled arc horizon, Johns Hopkins undersults of Pennsylvania's great Carbass<br />\nin<br />\nthe Glee Club. Since then<br />\never made artificially, and it set a graduates, whether or not they<br />\nnival. It is probable also that Aus- CHRISTIAN SERVICE CLUB world's<br />\nrecord for laboratory work. had been struck with the bolt of he has published a number of song<br />\ntralia will send a college team, these<br />\nTO MEET FEB. 11<br />\nThe length of the arc, the tremend- failure, turned in unison to wor- books.<br />\nmen being on their way to the<br />\nClassmates Distinguished<br />\nThe next meeting of the Chris- ous voltage behind it and the deep ship the light hearted Terpsichore,<br />\nOlympic games in Paris next July. tian Service Club will be held on<br />\nThe success of Dr. Levermore reroar that accompanied it, combined goddess of dance. On the evenThe invitations to the Carnival Monday, February 11 at the home<br />\nto produce a peculiar feeling of ing of February the fifth, the last calls the achievements of other men<br />\nhave been out only a week, and al- of William P. McFaul, 4023 Roawe at the mighty electrical forces date on the examination schedule, who received Ph. D. degrees from<br />\nready more than sixty colleges have land Ave. Dr. Paul Harrison,<br />\nunder the control of a man's fin- the Johns Hopkins Cotillon Club Hopkins in 1886. Among them was<br />\nsent word that they will be on hand. known as the \"Prophet of the<br />\ncrave the second cotillon of the the late ex-President Woodrow<br />\nger. Manifestations of high volt- b<br />\nIt looks as if last year's record, Desert\" is a graduate of the Hopages of electricity produce a sensa- year. The music which was ren- Wilson, for whom the nation is<br />\nWhen 112 colleges competed at the kins Medical School, and will be<br />\ndered by eight pieces of Fisher's now mourning. Dr. D. R. Denry<br />\nContinued on page 2 col. 3<br />\nCarnival, will be broken, as many the speaker of the evening. Dr.<br />\nOrchestra was<br />\nexceptionally is professor in political economy at<br />\ncolleges are still to be heard from. Harrison is making a tour of the<br />\ngood. The affair was spirited as Massachusetts Institute of TechWANTED<br />\nInvitations Out<br />\ncountry addressing organizations<br />\nwell as colorful and will go down nology. Dr. John Denry is a philosCandidates<br />\nfor Business<br />\nThe invitations to the schools will similar to the Christian Service<br />\non record as being one of the live- opher at Columbia. Dr. Shosuki<br />\nBoard of Hullabaloo comgo out this week. Judging by the Club and the local club considers<br />\nliest and most successful cotil- Sato is now head of the Agriculmunicate with Jack Lewis,<br />\nearly inquiries, more schools than itself fortunate in having secured<br />\nlons<br />\nin the history of the Cotillon tural College in Japan. Dr. Albert<br />\nBox 491.<br />\nhim for Monday evening.<br />\nContinued on page 4, col. 3<br />\nI Club.<br />\nContinued on page 4, col. 2.<br /><br />\nTHE JOHNS HOPKINS NEWS - LETTER, FEBRUARY 8, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br />\nJOSEPH LEOPOLD, '24<br />\nManaging Editor<br />\nWILLIAM G. DEAN, JR., '24<br />\nAssistant Managing Editor<br />\nT. REESE MARSH, '24<br />\nAssociate Editors<br />\nRICHARD C. TILGHMAN, '25<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\nCHARLES G. HUTZLER, '24<br />\nJunior Editors<br />\nARTHUR L. NELSON, '26<br />\nERNEST A. STRATHMAN, '26<br />\nALGER G. Hiss, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Mane ver<br />\nA. J. McKAY, '26<br />\nCirculation Manager<br />\nJOHN C. LEWIS, JR., '24<br />\nAssistant Business Managers<br />\nD. MILES MARRIAN,'25<br />\nG. DONALD GIESKE,'25<br />\nJOHN T. DIXON,'24<br />\nC. EUGENE TOVELL,'24<br />\nOTHO J. KELLER, III, '26<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS. '25<br />\nHEYWARD E. BOYCE, JR., '27<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 8, 1924<br /><br />\nWOODROW WILSON<br />\nWoodrow Wilson received his A. B. at Princeton. Princeton,<br />\nhowever, cannot claim him. He received his Ph. D. at Johns' Hopkins; but Hopkins cannot claim him. Wilson belonged to America<br />\nand America mourns his loss as the rest of the world bows its head<br />\nin tribute.<br />\nAlthough Hopkins cannot point to Mr. Wilson as their own, they<br />\ncan take a certain amount of pride in him and in his achievements.<br />\nContemporary press notices term him as \"imperialistic,\" as \"dictatorial,\" as \"idealistic.\" And still we are proud of him. We feel<br />\nthat although, at present, much of the good that he accomplished is<br />\n\"interred with his bones,\" it will arise and history will view Woodrow<br />\nWilson as one of the great of the great Americans. We are glad<br />\nthat Johns Hopkins is able to claim even a small part of his reflected<br />\nglory.<br />\nMr. Wilson may have had his faults. It may be that the allegation that he was \"dictatorial\" is true. He was undoubtedly \"idealistic.\" Throughout the years of his Presidency, however, he was<br />\nstriving for the good of his country and for the good of mankind.<br />\nHe thought that he had found a cure that would eliminate one of<br />\nthe greatest evils of humanity. And he gave his life while endeavoring to tender this supposed solution to an unsympathetic, unbelieving<br />\nand unresponsive nation.<br />\nIt is for posterity alone to pass judgment upon Woodrow Wilson<br />\nas a statesman. We, the undergraduates of Johns Hopkins University, can only say that we are proud of him and proud of his connection with Hopkins. And with the rest of the world we bow our<br />\nheads in admiration and in sorrow.<br /><br />\nNOTICES<br />\nTrack practice will be<br />\nheld daily in preparation for<br />\nHopk in s-Fifth Regiment<br />\ngames. Candidates see Fred<br />\nGeib, Manager.<br />\nThe Annual Home Concert by the Musical Club will<br />\nbe held at the Maryland Casualty Clubhouse on Feb. 21.<br />\nGet your non-athletic cards<br />\nredeemed by Mike Tilghman at the Barn any noon.<br />\nHopkins vs. Catholic University tomorrow night at<br />\nBaltimore Athletic Club pool<br />\nat 8 P. M. Dancing after<br />\nmeet.<br />\nRehearsal of the Glee Club<br />\nat the Barn at 4 P. M. Sunday. Important. All members urged to attend. Mr.<br />\nBochau will be there.<br /><br />\n\"XC\"<br />\nCORONA<br /><br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br /><br />\nThe St. REGIS<br /><br />\nHave you<br />\nseen it?<br /><br />\nRESTAURANT<br />\n1817 N. Charles St.<br /><br />\n41Something new in portable<br />\ntypewriters.<br /><br />\n(Half Block below North Ave.)<br /><br />\n(Lit writes nearly all languages.<br /><br />\nNicholas Brown, Mgr.<br /><br />\n41Has 90 characters.<br />\nSee Fred Rich, College<br />\nRepresentative<br />\n118 W. FAYETTE ST.<br />\nBALTIMORE, MD.<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nR. H. Taylor<br />\nVernon 2355<br /><br />\nWESTINGHOUSE EXPERIMENTS<br />\nContinued from page 1<br />\ntion which, witnesses find hard to<br />\ndefine.<br />\nFollowing the forming of the arc,<br />\nthere was a demonstration of the<br />\nefficiency of the horn gap. A 15foot horn was constructed and an<br />\narc was induced at a potential of<br />\n200,000 volts. The arc rose slowly,<br />\ndue to the hot air produced with a<br />\ntearing noise, to the end of the<br />\nhorn, blew out and immediately reestablished at the base. It rose<br />\nagain and again until the circuit<br />\nwas opened. This self-extinguishing feature is used daily on power<br />\nsystems to relieve surges and lightning strokes. This is a spectacular<br />\ntest and is an exhibition that witnesses do not soon forget.<br />\nThe next tests, were insulator<br />\nflashovers. In these tests a dry insulator post, built up of several<br />\nunits, was flashed over a potential<br />\nof 800,000 volts. Following this,<br />\nthe column was covered with a<br />\nheavy water spray to approximate<br />\nconditions during a torrential rainstorm, and it flashed over a potential of 650,000 volts, showing the<br />\nwet insulator to be over 80 per<br />\ncent as efficient as the dry insulator. This was a remarkably high<br />\nratio and attributed to excellent design.<br /><br />\nSTETSONc2<br /><br />\nBats<br />\nIn buying a Stetson you need only be concerned with the style—the quality is guaranteed by the name “Stetson\".<br />\nSTYLED<br /><br />\nFOR YOUNG<br /><br />\nMENi<br /><br />\nWhat awhale ofa difference<br />\njust afew cents n-p,ke!\"<br /><br />\nTHE EVILS OF EXAMINATIONS?<br />\nMid-years have come and gone and have, left in their wake the<br />\nannual toll. Despite the fact that the period of time devoted to<br />\nexaminations was materially lengthened, indications seem to show<br />\nthat the casualty list is as great, if not greater, than usual. Rumors<br />\nare numerous at this time but it seems probable that a number of<br />\nundergraduates have been ejected by means of the automatic threefailure route.<br />\nRecently, in commenting upon the lengthening of the examination<br />\nperiod, the NEWS-LETTER said: \"Failures under the new system can be<br />\ndue only to inherent stupidity or lack of application.\" And, allowing<br />\nfor inevitable exceptions, we repeat this. The evils attached to the<br />\npresent system may be numerous; the strain may be great; the<br />\nresults may not be in proportion to the worth of the individual student. We fail to see, however, how a man of average intelligence<br />\nwho has prepared methodically could fall below passing mark in<br />\nthree examinations.<br />\nWhatever excuses the unfortunates may present to the Board<br />\n.of Collegiate Studies, they cannot reasonably attribute their misfortune to the \"evils of examinations.\"<br /><br />\n—all the difference<br />\nbetween just an ordinary cigarette<br />\nand—FATIMA,the most skillful<br />\nblend in cigarette history.<br /><br />\nTHE JOHNS HOPKINS NEWS.LETTER, FEBRUARY 8, 1924<br /><br />\n3<br /><br />\nINFLUENCE OF JOHNS HOPKINS ON WOODROW WILSON AS fered by the Union may be ob50-Yard Dash—Lord, Sauerwein<br />\n220-yard Swim—Bahlke, CalA GRADUATE STUDENT MANIFESTED IN HIS<br />\ntained from the Secretary, Profes- and Welsh.<br />\nhoun.<br />\nLIFE'S WORK<br />\nsor J. W. Cunliffe, Journalism<br />\nPlunge—Howard and. Hamble100-yard Dash—Lord, Bahlke,<br />\nDeceased President Always Showed Great Interest in University Af- Building, Columbia University, ton.<br />\nWelsh.<br />\nNew York City.<br />\n100-Yard Back Stroke—Stevens, The meet will start at 8 o'clock<br />\nfairs. Instrumental in Organizing Glee Club and<br />\nBahlke, Dunning.<br />\nsharp.<br />\nDebating Council<br />\n•<br />\nVARSITY<br />\nNATATORS<br />\nTO<br />\nSWIM<br />\nWoodrow Wilson spent four years at the Johns Hopkins UniAGAINST CATHOLIC U.<br />\nversity studying Economics and Political Science under Professors<br />\nContinued from page I<br />\nEly and Adams. The influences he received at that time can be<br />\nBahlke<br />\nand<br />\nLord. (It is possible<br />\ntraced throughout the entire after life of our dead President.,<br />\nthat<br />\nWelsh<br />\nmay<br />\nswim.)<br />\nThe world came very near not having the leadership of WoodDiving—Lord, Stone, Calhoun.<br />\nrow Wilson during the World War. In 1882, his first year at Hopkins, he was undecided whether to specialize in Political Science, or<br />\nPsychology. Professor Hall, the famous psychologist, tells in his<br />\nautobiography that he accompanied Woodrow Wilson on a long walk<br />\nwhile they debated whether the future President should follow the<br />\none course- or the other. \"Finally,\" he says, \"the inheritance from<br />\nhis Virginia ancestors and his early training called him to Political<br />\nScience.\"<br />\nAt Hopkins first, Mr. Wilson<br />\n(This is the way one user describes Williams and the new Hinge-Cap)<br />\nbecame known as a most brilliant<br />\nAMERICAN UNIVERSITY<br />\ngraduate student.<br />\nIn the EcoMen buy Williams expecting to find<br />\nUNION MOVES PARIS<br />\nnomic Seminary he was scribe,<br />\ntheir main satisfaction in the HingeOFFICE<br />\nand his records of Professor Ely's<br />\nCap. But when they first use the<br />\nremarks are among the prized posThe Bulletin of the American<br />\ncream they get an equally pleasant<br />\nsessions of the University.<br />\nUniversity Union, just issued,<br />\nsurprise. The heavier lather, the<br />\ngreater thoroughness with which it<br />\nThe . qualities manifested by calls attention to the removal of<br />\nsoftens the beard, make a hit at once.<br />\nMr. Wilson while at. Hopkins are the Paris office to more commoThen, Williams lather lubricates the<br />\nNeatly combed, well-kept hair is a<br />\nthe same which were evident in all dious quarters at 173 Boulevard<br />\nbusiness and social asset.<br />\nskin<br />\nso that the razor fairly \"glides\"<br />\nSTACOMB makes the hair stay combed<br />\nhis later endeavors. In the semi- St. Germain, where students and<br />\nin any style you like even after it has<br />\nthe hairs off. And last, there's that<br />\nnary discussions he developed his professors visiting France will rejust been washed.<br />\ndelightful after-care of the skin.<br />\nSTACOMB—the original—has been<br />\nnaturally gigantic powers of ceive a cordial welcome from the<br />\nTruly, you'll find that with the Hingeused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nlogical reasoning. A definite con- Director, Professor Alg-eron ColCap Williams is \"miles ahead.\" It's<br />\nfor free trial tube.<br />\nclusion, reached after straight and man, (Chicago), and from Dr. H.<br />\npure cream without coloring matter<br />\na<br />\nJars-75c<br />\nTubes-35c<br />\nsearching thought, he would de- S. Kraus, (Columbia), Assistant<br />\nof any kind.<br />\nInsist on STACON1B—in the black,<br />\nyellow and gold package.<br />\nfend against the most adverse Director. The retiring Director,<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\ncriticism. The University had Professor Paul VanDyke (Prince$250 in prizes<br />\nStandard Laboratories, Inc.<br />\nfixed certain maximum length for ton) in his annual Report states<br />\nFor thebest sentence of ten words or less on the value of theWilliams Hinge-Cap,<br />\n750 Stanford Avenue Los Angeles, California<br />\nwe offer the following prizes: 1st prize $100; 2nd prize $50; two 3rd prizes,$25 each;<br />\nthe doctorate dissertation. Mr. that during the past year the<br />\nSend coupon for Free Trial Tube.<br />\ntwo 4th prizes,$10 each; six 5th prizes,$5 each. Any undergraduate or graduate<br />\n—<br />\nstudent is eligible. If two or more persons submit identical slogans deemed worthy<br />\nWilson wrote a thesis which was Union registered 1392 American<br />\nSTANDARD LABORATORIES,Inc.<br />\nof prizes, the full amount of the prize will be awarded to each. Contest closes at<br />\n750 Stanford Ave., Loe Angeles, California. Dept. 1<br />\nmidnight March 14,1924. Winners will be announced as soon thereafter as possible.<br />\nPlease send me free trial tube.<br />\nlonger than the accepted length, students, of whom 700 were womSubmit any number of slogans but write on one side of paper only, putting name,<br />\naddress, college and class at top of each sheet. Address letters to Contest Editor,<br />\nBarns<br />\nen<br />\nand had it published in book form<br />\nand 692 men; 1164 were<br />\nThe J. B. Williams Co.,Glastonbury, Conn.<br />\nAddress<br />\nbefore receiving the degree. He working at the University of<br />\npersisted that they accept his the- Paris and 325 followed courses<br />\nsis as it stood. They did; and (including- Summer courses) at<br />\nsubsequently enacted the present provincial universities. Dr. Geo.<br />\nrule that any suitable published E. MacLean, retiring Director of<br />\nform of the doctorate thesis is ac- the British division, reports 1255<br />\nregistrations, and Mr. R. H. Simpcepted.<br />\nAs a result of his training here son, the Assistant Director, sumhe turned his efforts toward marizes the different lines of<br />\nteaching; and the habit of ab- work undertaken by the London<br />\nstract unemotional consideration Office. Copies of this and of anof a problem, which is that of other Bulletin including letters<br />\nmany great teachers and think- from professors and students who<br />\nhave made use of the facilities ofContinued on page 4 col. 3<br /><br />\n\"The perfect<br />\ncream in the perfect container\"<br /><br />\nFo<br />\nunruly iair<br /><br />\nWilliams<br />\nShaving<br />\nCream<br /><br />\nFor this he was<br />\nsent to prison<br />\nROGER BACON<br />\n1214-1294<br /><br />\nEnglish philosopher and man<br />\nof science. Studied at Oxford<br />\nand the University of Paris.<br />\nWrote the Opus Majus, Opus<br />\nMinus, Opus Tertium, and<br />\nmany other treatises.<br /><br />\nIn an age of abstract speculation he boldly<br />\nasserted the mathematical basis of all the<br />\nsciences. But even mathematical calculation, he showed, must be verified by experiment, which discovers truths that speculation could never reach.<br /><br />\nMake Your College Paper<br />\nWrite your \"copy\" on a Remington Portable.<br />\nClean,legible copy will catch the editor. Use the<br />\nmachine also for your everyday work and persona)<br />\ncorrespondence. You will be surprised how much<br />\ntime and labor it will save.<br />\nCompact—fits in a case only four inches high.<br />\nConvenient—you can use it on your lap, if you wish, for it<br />\ncarries its table on its back.<br />\nComp/ete—with four-row keyboard,like the big machines,an<br />\nother 'big machine\" conveniences.<br />\nPrice, complete with case, $60. Easy payment terms if desired<br /><br />\nRemington<br /><br />\nRoger Bacon may not have invented gunpowder, as has been claimed by some biographers of the famous Franciscan friar, but<br />\nhe exploded some of the outstanding errors<br />\nof thirteenth century thought. Because of<br />\nhis advanced teachings, Bacon spent many<br />\nyears of his life in prison.<br /><br />\nMore than a million dollars a year is devoted to<br />\nresearch by the General<br />\nElectric Company in<br />\norder that the giant —<br />\nelectricity —may be<br />\nmade more and more<br />\nuseful to mankind.<br /><br />\nIn the Research Laboratories of the General Electric Company, Bacon's principles<br />\nare followed in every experimental investigation. The gas-filled electric lamp and<br />\nthe electron tube were worked out on<br />\npaper, but it was experimental verification<br />\nofthe underlying mathematical theory that<br />\nmade electric illumination, radio broadcasting and X-rays what they are today.<br /><br />\nPortable<br />\nRemington Typewriter Co.<br />\n25 W. Fayette St.<br />\nBaltimore<br /><br />\nGENERAL ELECTRIC<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 8, 1924<br /><br />\n4<br /><br />\nBe a Newspaper Correspondent<br />\nwith the Heacock Plan and earn a<br />\ngood income while learning; we<br />\nshow you how; begin actual work<br />\nat once; all or spare time; experience unnecessary; no canvas sing;<br />\nsend for particulars.<br />\nNewswriters Training Bureau<br />\nBuffalo, N. Y.<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br /><br />\nHOPKINS INFLUENCE MANIFESTED IN WILSON'S<br />\nWORK<br />\nShaw is winning fame as editor of<br />\nContinued from page 3<br />\nthe \"Review of Reviews.\" Dr. F.<br />\nM. Warren is professor in romance ers, was characteristic of WoodDr. Arthur row Wilson at Johns Hopkins.<br />\nlanguages of Yale.<br />\nof<br />\ngovernor<br />\nbecome<br />\nYeiger has<br />\nThese characteristics, which<br />\nPorto Rico, and Daniel Randall is<br />\nmay have been evident before,<br />\na prominent Baltimore lawyer.<br />\nwere given great opportunity for<br />\ngrowth in the quarter century of<br />\nCOLLEGE REPRESENTATIVE<br />\nteaching and graduate work.<br />\nwanted by one of our clients to<br />\nhandle a line of collegiate clothes. Later, as President of the United<br />\nThis manufacturer sells direct to States, Woodrow Wilson brought<br />\nthe college man and he wants a<br />\nhimself much approval and, at<br />\nfraternity man with a large fol- on<br />\nlowing. Exceptional proposition times, condemnation by the exerwith highest commissions paid.<br />\ncise of these same characteristics.<br />\nrationality, and<br />\nCOLLEGIATE SPECIAL Clear thinking,<br />\noften disqualitoo<br />\nAdvertising Agency, Inc. idealism are<br />\nfied by prejudice and jealousy.<br />\nAvenue, New York City<br />\nALUMNUS WINS PRIZE<br />\nContinued from page 3<br /><br />\nTHE FAMOUS OLYMPIC TOUR<br />\nBOOKINGS ARE MADE NOW FOR THE TRIP TO<br /><br />\nTHE OLYMPIC GAMES 1924<br />\nTHE COLLEGIATE TRIP<br /><br />\nDuring 30 days stay in Paris you will witness<br />\nthe Games,stop in a good Hotel, see the sights<br />\non special busses, make an excursion to Versailles, to Rouen, to Fontainebleau, have a special train bring you from and to the steamer at<br />\nCherbourg, and you also eat—three times a<br />\nday and plenty. Everything included at the unprecedented figure of<br /><br />\n$375<br /><br />\n503 Fifth<br /><br />\nActive in Student Affairs<br /><br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\nctiMILEENEDESaigillugmag=<br /><br />\nHOTOD,0E12<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n111#141R/Re1141010.14PReeekl4ic ,q4,014.014 014 014<br /><br />\nSHIRT MAKER<br />\n226 N. Liberty St.<br />\nDress Shirts... $3.00, $3.50 and $4.00<br />\n$3.30 and $4.40<br />\nNegligee<br />\n$5.50 and $6.60<br />\nImported Madras<br />\nTerms Cash, Less 10% 30 days on Shirts<br />\nAlso a Full Line of Men's<br />\nFurnishings<br /><br />\nSTRATTON<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nALWAYS USE A<br /><br />\nYELLOW CAB<br />\nOR PHONE<br /><br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br /><br />\nHowever greatly Mr. Wilson<br />\nwas influenced by Hopkins, he left<br />\nat Hopkins evidences of his own<br />\ninfluence. In 1884 Woodrow Wilson was a member of the first<br />\nJohns Hopkins Glee Club. A picture of this was published recentis H.St OSCAR G•L NAY<br />\nly in the Baltimore Sun showing<br />\nOWN ERS<br />\nhim with the other tenors of the<br />\n0Pb°<br />\nclub. Woodrow Wilson organ2'it*IDE*.\"1*<br />\n29 E. BALTIMORE ST.<br />\nized a debating society using the<br />\nAgents for JOHN B. STETSON HATS British House of Commons as a<br />\nand FRATERNITY BANDS<br />\nmodel. It was named the \"House<br />\nof Commons.\" These were the<br />\n\"student activities\" of Mr. Wilson.<br />\nAs a Teacher and lecturer Mr.<br />\nWilson made the most permanent<br />\nimpression on Hopkins. For<br />\nnearly a decade he gave an annual<br />\ncourse of lectures on political science. Among those of the present faculty who studied under the<br />\nfuture President are Dean Latane<br />\nand Dr. Hollander. By all who<br />\nhad that opportunity, Mr. Wilson's lectures are remembered as<br />\nbrilliant and witty ; and the man<br />\nHe has the pride of the peacock, the<br />\ncourage of the lion and the combined<br />\nhim. self as one who had a pronerve of the whole menagerie. And<br />\nwhy? Because he is sure of himself<br />\nfound grasp of his subject.<br />\nof his appearance.<br /><br />\nFROM NEW YORK TO NEW YORK<br />\nSEND FOR CIRCULAR A-19<br /><br />\nVICTOR H. KIFFE<br /><br />\noibeXatterle)<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD.KOHN 8c Co.<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nCorner CJayelie and<br /><br />\n—and sure<br /><br />\nAlways Interested in Hopkins<br /><br />\nFURNITURE OF QUALITY<br /><br />\nand individuality is offered here at prices that are not<br />\nAfter leaving the University,<br />\ninshow<br />\nto<br />\nand cannot be underquoted by any house at any time.<br />\nMr. Wilson continued<br />\nDr.<br />\nWhen<br />\nterest in its affairs.<br />\nBesides the reputation of an old-established firm<br />\nas President of<br />\nEvery \"Vaseline\" product is recresigned<br />\nRemsen<br />\nof each sale with a guarantee.<br />\nis<br />\nback<br />\nommended everywhere because of<br />\nits absolute purity and effectiveness.<br />\nJohns Hopkins University in 1914,<br />\n.Mr. Wilson gave much of his<br />\ntime in efforts to help the advisory<br />\nDECORATIONS<br />\nFURNITURE<br />\nDRAPERIES<br />\nboard select a worthy successor<br />\nNORTH<br />\n343<br />\nSTREET<br />\nCHARLES<br />\nto Dr. Remsen. Although at that<br />\ntime President of the United<br />\nStates he was interested in securChesebrough Mfg.Co. ing a man who would maintain<br />\n(Consolidated)<br />\nHopkins traditions.<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nThe death of Mr. Woodrow<br />\nPROGRAM FOR STUDENTS<br />\nWilson is a source of great soradand<br />\nST.<br />\nLIBERTY<br />\nBIBLE CLASS, 10 A. M.<br />\nrow to his many friends<br />\nAn Interesting Discussion of<br />\nAT SARATOGA mirers at Hopkins. He is, withVital Topics Under<br />\nout doubt, the greatest of the<br />\nDR.<br />\nLUNCHEON<br />\nHOWARD A. KELLY, Leader<br />\nmany famous sons of Hopkins.<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nVaseline<br /><br />\nr<br /><br />\nHAIR TONIC<br /><br />\nMount Vernon PlaceM.E.Church<br /><br />\nTEA<br />\nEstablished 1873<br /><br />\nDINNER<br /><br />\nA. H. FETTING MAN'FG<br />\nJEWELRY CO.<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br />\nManufactured by<br /><br />\nWIGHT &amp; HUMPHRIES<br /><br />\nA. JACOBS &amp; SONS<br />\nTailors<br />\nUniforms and Liveries<br />\n128 W. FAYETTE ST.<br />\nBaltimore, Md.<br />\nNear Liberty St.<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nJAS. H. DOWNS<br /><br />\nYOUNG PEOPLES AT-HOME<br />\n5-7 P. M.<br /><br />\nPENN RELAY CARNIVAL<br />\nContinued from page 1<br /><br />\never will attend. Last year there<br />\nwere over 450 schools represented.<br />\nPLAZA 6987<br />\nIt is going to be very difficult to<br />\nhandle the games in the two days<br />\nallotted to them.<br />\nThe Carnival will be of especial<br />\nimportance this year, because of<br />\nthe keen competition for the Olympic team that will represent this<br />\ncountry in Paris this year. The<br />\nRelay Carnival will give the college<br />\nathletes of the entire country a<br />\nchance to show their ability, and<br />\nthe results will no doubt have a<br />\nbearing on the ultimate decision of<br />\nthe Olympic Committee in choosing the American team.<br />\nAny schools or colleges desiring<br />\nPrinters of<br />\nto attend the Carnival may do so<br />\ncrhe Johns Hopkins<br />\nas all are invited, by writing to the<br />\nManager of the Carnival, George<br />\nNEWS.-LETTER<br />\nW. Orten, 3301 Walnut Street,<br /><br />\n11.30 A. M.<br />\nManufacturers<br />\nuntil<br />\nGreek Letter Fraternity Jewelry<br />\n7.30 P. M<br />\n213 N. LIBERTY ST., Baltimore, Md.<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br /><br />\nAztaw Sts.<br /><br />\n-Where Wholesale and Retail Districts Meet\"<br /><br />\n(The Sta<br /><br />\nAs the last and cleverest touch to his<br />\ntoilet, he smooths his mane with-Vaseline\" Hair Tonic. His head stays dapper<br />\nand sleek throughout the giddiest<br />\nwhirls.<br />\n-Vaseline\" Hair Tonic improves the<br />\nhair. At all drug stores and student<br />\nbarber shops.<br /><br />\nNEW YORK, N. Y.<br /><br />\n505 FIFTH AVE.<br /><br />\nTEA SERVED AT 6 O'CLOCK<br /><br />\nSPECIAL PARTIES<br /><br />\nENGRAVER PRINTER STATIONER<br />\nLOMBARD and SOUTH STREETS<br />\n229 N. CHARLES ST.<br /><br />\nPhiladelphia, Pa.<br /><br />\nEPWOR1 H LEAGUE<br />\n7-8 P. M.<br />\nSPECIAL STUDENTS AT-HOME<br />\nFEBRUARY 17<br /><br />\nAt the Washington Monument<br /><br />\nCOME DOWN AND<br />\nGET ACQUAINTED<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nOF BALTIMORE<br />\n13 SOUTH ST.<br />\nOrganized 1864<br /><br />\nJohn J. Nelligan, President<br /><br />"}], "field_media_file": [{"target_id": 37827, "display": null, "description": null, "target_type": "file", "target_uuid": "17c67bcf-8d93-456c-bb25-7439986a6c6b", "url": "http://digital.library.jhu.edu/system/files/2022-03/13103-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13103, "target_type": "node", "target_uuid": "602b5893-f1cb-4073-9613-7930caa24600", "url": "/node/13103"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "df2970a0-d27d-4dc7-8085-7ee5e26faf25"}]}