{"mid": [{"value": 38165}], "uuid": [{"value": "6ddf9115-7dd7-4800-a98e-dc2a931321c9"}], "vid": [{"value": 38165}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:49:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12732-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:49:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:49:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "iat<br />\n<br />\niqopititts Nrtnoirttrr<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br />\n<br />\nVOL. XLI, No. 15<br />\nbi-<br />\n<br />\nHELP LICK<br />\nTHE JOHNNIES<br />\nTHURSDAY!<br />\nPRICE 5 CENTS<br />\n<br />\n,<br />\n<br />\nnirt<br />\nrills wl<br />\nLt the<br />\n<br />\nHopkins To Meet St.JohnsIn 54th Contest Saturday<br />\n<br />\ngame<br />\n11. Al<br />\nmen, 4<br />\nrho is $<br />\nnow ti<br />\ne held<br />\n<br />\nUS colstore<br />\n<br />\nThird Annual Gymboree Set For December 17th<br />\n•<br />\n<br />\nTo Accom- Annual Gymboree Hopkins Press Will<br />\nJay Eleven Prepares To Wage<br />\nAlcazar Houses His Brain-Child<br />\npany Hopkins Hoofers<br />\nDate Announced Honor Willoughby Hard Fight Against<br />\nFavored<br />\nHudson Delange<br />\nBy Dr. Shaffer In New Publication<br />\nJohnnie<br />\ns<br />\nAt<br />\nHomewood Field<br />\nDebut Thursday<br />\nProceeds Go To Financing Will Consist Of Essays WritOf Varsity Sweaters, Awards<br />\n<br />\nCotillion Board To Present<br />\n\"Sweet Rhythm\" For<br />\nTurkey Day<br />\nFrieda<br />\n<br />\nGibson<br />\n<br />\nten By Students And<br />\nAssociates<br />\n<br />\nWashington - Hopkins Bas- Dr. Garner Of Illinois To<br />\nketball Game To Be<br />\nHave Leading Article<br />\nFeature Event<br />\nOn Dr. Willoughby<br />\n<br />\nSings<br />\n<br />\n5<br />\n<br />\nMany Hail New Band A<br />\nDeparture From<br />\nTradition<br />\n<br />\nSuperior Record Of Crabtown Gridders Gives Them Edge<br />\nIn Traditional Battle; Lambros,Star Of Last Year's<br />\nJohnny Victory, Returns At Quarterback<br />\nPOPOW IN BACKFIELD<br />\nHe Heralds<br />\nAnnual Gymboree<br />\nJohnny Defeat Spells Success<br />\nAt Hopkins; Jays Determined To Win<br />\n<br />\nThe third annual Hopkins GymIn honor of Professor - Emeritus<br />\nboree has been announced for Decem- Westel Woodbury Willoughby of the<br />\nber 17, by Dr. Wilson Shaffer, Asso- Political Science Department of The<br />\nciate Director of Physical Education. Johns Hopkins University, The Johns<br />\nBy ARTHUR KATZ<br />\nPlans for this year include free admis- Hopkins Press announces the publiv .1.1.41L4 11 UIJi3L/14<br />\nsion of all students, a new plan of cation of a volume of Essays in Pol'itThis Saturday, for the fifty-fgurth<br />\nfinancial organization, and as a fea- feat Science.<br />\ntime, the fates will hold in their<br />\nture attraction, the basketball game<br />\nhands the power to mete out a sucMe book is divided into six main<br />\nbetween George Washington Universubjects, each of which is developed<br />\ncessful or disastrous season for two<br />\nsity and Hopkins. George Washington,<br />\nin essay form by either an associate<br />\nteams, since it is at that time that<br />\naccording to Dr. Shaffer, is one of<br />\nof Dr. Willoughb-y, or one of his<br />\nHopkins and St. John's will stage<br />\nthe<br />\nstrongest<br />\nteams<br />\nin the country.<br />\nas its piece de resistance to celebrants<br />\nformer students.<br />\ntheir<br />\nThe event is in charge of the Athtraditional clash at Homewood.<br />\n)SS of the holiday the smartly-served<br />\nArticle By Garner<br />\nDesch Announces He Has letic Board,<br />\nand<br />\nsponsored<br />\nThe<br />\nby<br />\nthe<br />\nBlue<br />\nAthJays have had a spotty<br />\nleading<br />\nThere<br />\nessay by Dr.<br />\nis a<br />\nmusicianship of Messrs. Hudson and<br />\nSent Invitations To<br />\nletic Council, the Omicron Delta James W. Garner, Professor of Politrecord<br />\nthis<br />\nyear, winning only one of<br />\nDe Lange and the vocalizations of<br />\nKappa Honorary Fraternity, and the ical Science, University of Illinois,<br />\nStudios<br />\nFilm<br />\nsix<br />\ncontests.<br />\nOn the other hand, the<br />\nthe delectable Miss Frieda, Gibson.<br />\nInterfraternity Board. A member of which evaluates and describes Prori Si.<br />\nCrabtown<br />\ngroup<br />\nhave taken the<br />\nDescribing the members of the cast the Athletic Board will be assigned fessor Willoughby's contributions to<br />\nWhile the beau monde regards the<br />\nmeasure of most of their opponents.<br />\nevent as the opening Of the Hopkins of Once in a Lifetime as \"the most from each of these, to integrate and Political Science. James Hart, one of<br />\ntalented people I have ever met,\" John direct the work. Mr. Gordon Mallonee his former students, follows up the<br />\nHowever, the Ivy-clustered tradition<br />\neocial season the academicians who<br />\nE. Desch,- director of the Barnstormers has been assigned to the Interfratern- essay by a presentation of a Wilthat has grown out of this semimodthe<br />\nto<br />\nstudy<br />\ndeepest<br />\ndevote their<br />\nannounced yesterday that he had sent wait for names<br />\nloughby Portrait. The two articles<br />\ncentenarian<br />\naltercation is of such a<br />\nling<br />\n\\,vai<br />\nalLuously<br />\na<br />\nern dance<br />\nDR. G. WILSON SHAFFER<br />\ne<br />\ninvitations to all the major Hollywood<br />\nThe funds, hich will be used for the have the effect of showing two sides<br />\nnature that victory in the Saturday<br />\n\"scout\"<br />\n(Story<br />\nstudios<br />\nurging<br />\nthem<br />\non<br />\nto<br />\nPage<br />\nfilm<br />\nrhythm\"<br />\n3.)<br />\nsweet<br />\nthe \"adventures in<br />\npurchase of the Varsity Athletic -of the man,<br />\nengagement is the measure of the<br />\nBarnstormer show when it is Awards, will come this year through<br />\nPart II deals with Public AdminWhich will be unfolded for their ben- the<br />\nsuccess of the entire season,<br />\npresented at the Auditorium Theatre, sale of tickets by the students to out- istration and Democracy and Adminpracticed hand of<br />\nefit under th<br />\nAs the teams stand now, the JohnDecember 12.<br />\nsiders. Each student will be asked and istration of Organization. The first<br />\nflies are afovered to win, mainly beWill Hudson. The Hudson-DeLange<br />\nexpected to sell one ticket.<br />\nCast Has Real Talent<br />\nessay was written by the brother of<br />\ncause of their superior record this<br />\norchestrations are said by many to<br />\nSince freshmen, due to their non- Professor Willoughby, William Frank\"Everyone in the cast has real talFall. The Annapolis aggregation has<br />\nbe the latest chapter in the short ent,\" said Mr. Desch. \"All have had inclusion in the three sponsoring linlin Willoughby, once Director of<br />\nregistered to date five wins, one<br />\nhut checkered history of swing.<br />\nprevious stage experiences and several groups, might be left out, an especial the Institute of Government at the<br />\ntie, and one loss. Of their common<br />\nThe boys depend for their effects have even become quite well-known to effort is to be made to reach them. The Brookings Institution at Washington, Decries Lack Of Time Spent adversaries, the Homewood eleven,<br />\nD.C.; the other by A. C. Millspaughk,<br />\nhas met defeat and the hands of three<br />\non smartly-drilled collective work local radio audiences. I don't believe Interfraternity Board will secure the<br />\nIn Out - Door Social<br />\nI have ever met a group of more tal- patronage of the pledges in the fra- also of the Brookings Institution.<br />\nprevious Johnnie opponents, all of.<br />\nrather than on unchecked solo imLaboratory<br />\nPolitical Theory<br />\nented people.\"<br />\nternities, and 0. D. K. will contact<br />\nwhich were taken in stride by the<br />\nprovisations. The results are shown<br />\nPolitical Theory occupies the third<br />\nTwo years ago Mr. Desch spent part the non-athletic activities. The freshvisitors.<br />\nDr. Jerome E. Davis, Associate<br />\nefforts of his summer vacation in the film man gym squads will, of course, be chapter of the book. Harold W. Stoke,<br />\nin the elaborately-scored<br />\nThe invading horde from Navy Row<br />\nWhich the combination has recorded city and made several contacts there reached through the Athletic Council. Associate Professor of Political Sci- Professor of Practical Philanthropy have several performers who will<br />\nence at the University of Nebraska, at Yale Divinity School addressed the bear<br />\nwatching in this tilt. Johnny<br />\n—rhythm exercises like \"Cross Coun- that he thinks might aid in giving An increased Freshman participation<br />\nand<br />\npatronage<br />\nis<br />\ndesired<br />\n'Stormers<br />\nthe<br />\nbreak<br />\nof<br />\nby<br />\nsome<br />\n\"the<br />\nthe Board. develops The Paradox of Representa- University Supper Club last Friday Lambros, quarterback, will be rethey<br />\nAvenue,\"<br />\nPark<br />\n\"Hobo<br />\non<br />\ntry Hop,\"<br />\ntive Government. E. Pendleton Herdeserve.\"<br />\nmembered by those who witnessed<br />\nnight, on \"Social Adventuring.\"<br />\n\"Eight Bars in Search of a Melody.\"<br />\nring, Department of Government at<br />\nthe<br />\ngame last year, as the painful<br />\nCanine Parts Open<br />\nDe<br />\nLamar, Talker, To Discuss Harvard University writes on Political Discussing the various social probA typical Hudson-DeLange producthorn in the side of the Jays. Time<br />\nIt was revealed that several canine Public Health<br />\nin Phillipines Parties and the Public Interest, and lems that exist in our society, Dr. after time, he ran punts thirty and<br />\ntion is the currently popular \"Organ<br />\nparts in the play have not been cast.<br />\nJohannes Mattern of the Department Davis asked student to invetigate forty yards<br />\nGrinder's Swing.\"<br />\nback, eluding many<br />\nRussian wolf hounds are preferable<br />\nA public lecture on The Progress of Political Science at the Hopkins<br />\nsome of these problems, by what he would-be<br />\ntacklers<br />\nbefore<br />\nbehag<br />\nMiss Gibson will take care of such but poodles or fox terriors will be of Public Health Work<br />\nin the Phil- completes the chapter with an essay<br />\ndowned..Again Lambros has an untermed<br />\nas<br />\n\"Social<br />\nAdventuring.\"<br />\nHe<br />\ncampus<br />\nAll<br />\nroles.<br />\nthe<br />\naccepted<br />\nfor<br />\nstraight numbers as \"You're Not the<br />\nippine Islands will be given by Dr.<br />\n(Continued on Page 3, Col. 5)<br />\nsaid, \"We are too apt to get an aero- derstudy or rather a running mate<br />\nKind,\" \"Tormented,\" and \"The Moon fraternities are invited to enter their C. Dunham this afternoon at five<br />\nin the person of Fred Burns, who<br />\nmascots in the tryouts. Pi Lambda Phi o'clock at the School of<br />\nHULLABALOO PHOTOGRAPHS plane view of social reality. The stuHygiene and<br />\nia Grinning at You,\" which have isis reputed to be even faster. Warren<br />\nand Alpha Tau Omega are already Public Health, 615 North Wolfe<br />\nThe<br />\nphotographer<br />\nfor the Hulla- dents studying the facts in the UniStreet.<br />\nHammann and Ned Lathrop will<br />\nsued from the collaborating pen of represented in the show by their rebaloo is scheduled to return to the<br />\nDr. Dunham is a Major in the Medare not always familiar with the round out the backfield quartet, exlyricist DeLange and composer Hud- spective \"house\" dogs.<br />\nHopkins December 1 and 2. All<br />\nical Corps of the U.S.A. and is the<br />\nperienced and fast.<br />\nlaboratory of society.\"<br />\nout-door<br />\nfraternity men and seniors are<br />\nson. Miss Gibson is reportedly eightdirector of laboratories in the Army<br />\nBob Snibbe, four year veteran on<br />\nHe<br />\nalso<br />\ndiscussed<br />\nthe<br />\nfield trips<br />\nwarned to make their final apeen, brunette, and vivacious, and ruMedical School. His talk is another<br />\nthe<br />\ncleat-trodden turf, will start the<br />\nwhich he takes with his students. On<br />\npointments then, as this is the last<br />\nmor has it that in her debut at a Yale<br />\nin a series of the de Lamar lectures<br />\nOrange<br />\nand Black plays from his<br />\nthese<br />\ntrips<br />\nthey<br />\nvisit such places as<br />\nchance before publication.<br />\nin Hygiene.<br />\nProm she stood the sons of Eli on<br />\nThe New York Municipal Lodging pivot position. The outstanding man<br />\n, House, Welfare Island, the New York on the line is Len Delisio, the left<br />\ntheir collective ear. She had recently Small Vote In Finals Chooses Hutchcraft For Student Council In<br />\nCity Morgue, and various factories. end. Having three years of football<br />\nreplaced Ruth Gaylor, generally assoElection<br />\nFriday's<br />\nLast<br />\nHe believes that it is impossible to under his belt, this wing man is a<br />\nciated<br />\nwith the early Hudsonteach sociology entirely from the deadly tackle on the defense as well<br />\nUeLange wax in gs.<br />\nLess than two-thirds of the freshclass rooms, and that it is absolutely as an excellent pass receiver on the<br />\nThe Grand March at Midnight will man class voted in the finals for the<br />\nnecessary to acquaint the students offense. Bill Stallings handles the<br />\nother end station to a good advanbe led by Miss Gloria Mellier, spon- man class voted in the finals for<br />\nwith the realities of society.<br />\nelection of their class officers last Explains<br />\nMethods<br />\nTrack<br />\nUsed<br />\nTo<br />\nDown<br />\nDiscussing<br />\n80r of the Cotillion, and David Erck,<br />\nthe<br />\nAmerican Federa- tage. Townsend and Christhilf will<br />\nCriminals, To<br />\nFriday. Their presidential choice was<br />\ntion<br />\nof<br />\nTeachers,<br />\nof<br />\nwhich he is Pres- try to force the Blue Jay plays into<br />\nPresident of the Board. Miss Lois<br />\nAmerican Institute Of Chemical<br />\nDonald A. Kirkwood, a Kappa Sigma<br />\nident, he said that all teachers should the center lane from their tackle<br />\nHeyward, of Jamestown, N.Y., will pledge and a Business and Engineerposts. Will Todd and Dave Snibble<br />\nEngineers<br />\njoin and unit for higher standards.<br />\ning student. He defeated Dick Green,<br />\nbe Guest of Honor.<br />\nfill<br />\nout the line flanking the snapper<br />\nAfter the Supper Club lecture, Dr.<br />\nWhen three members of the Brady only one make of automobile. Since<br />\nPatrons for the Cotillion include a member of the football team and a<br />\nDavis proceeded immediately to the at the guards.<br />\nfamily of Mt. Pleasant, Md., were the only suspect was a garage mech- Wilson<br />\nThe Jay team, although having had<br />\nthe President of the University and pledge of Delta Phi, for the office.<br />\nMemorial Methodist Episcopal<br />\nF. Milton Hutchcraft was elected blown to bits by a bomb hidden in a anic, and the automobile was handled<br />\na rather slow start in some of their<br />\nChurch<br />\nwhere<br />\nhe<br />\ngave<br />\nthe<br />\nUniversity<br />\nMrs. Isaiah Bowman, the Dean of freshman member of the student Christmas package<br />\nseveral years by his employer, the police began to Club lecture.<br />\nrecent games, are determined to<br />\nthe College and Mrs. Edward L. Council, his opponent being James<br />\nago, the police appealed to Dr. R. W. watch him closely. The mechanism<br />\ncome through with a victory over<br />\nBerry, Dr. and Mrs. Howard Cooper, Triplett, a Phi Psi pledge. Both<br />\nare Wood of the Johns Hopkins Univer- was reconstructed from the fragments,<br />\nSt. John's which will make the season<br />\nDr. and Mrs. Henry Siegerist, Mrs. students in the College of Arts and<br />\nsity for help in solving the crime. A and it was ascertained that an old- Thanksgiving Features<br />\na success and wipe away the sting of<br />\nJames B. Kempton, and Dr. Joseph Sciences.<br />\nfew small fragments found imbedded fashioned percussion cap of copper had<br />\nReduced Railroad Rates the former losses. With that in mind,<br />\nB. Ames.<br />\nVictor H. Ghent, Vice-President; in the walls of the room were all the been used to fire the machine.<br />\nplus a desire to avenge last year's<br />\nBenjamin Courtwright, Secretary; evidence obtained. By an inspection<br />\nThe police searched the home of the<br />\nSpecial reduced student rates for defeat, the Mallonee men are inculLeroy Applefield, Treasurer; and Wil- of these bits of metal, Dr. Wood was suspected man, and found a gun ident- railroad fares on the Pennsylvania cated with added spirit.<br />\nliam W. Whitelock, Sergeant-at- enabled to place the type and con- ical with that which had been recon- will be in effect for the Thanksgiving<br />\nThe Hopkins unit will be greatly<br />\nArms, were the other victorious struction of the bomb, eventually lead- structed from the evidence. A small holiday for any group of twent-five strengthened with the return of<br />\ncandidates.<br />\nbox of caps were also found. Then, a students going on one train. The re- Johnny Popow who was unable to<br />\ning to the arrest of the guilty man.<br />\nIN. Johnson Announces Committees<br />\nGhent, of Alpha Chi Rho, defeated<br />\nIn an address before the American year later, after the trial and convic- turn trip can be made individually see action against American U. because of injuries. Popow, a former<br />\nTo Reign Another<br />\nLaurie Dickson, a Phi Psi pledge Institute of Chemical Engineers, Dr. tion, a box of dynamite cartridges was on any train.<br />\nWeek<br />\nThe fare will be approximately linesman, has been transferred to a<br />\nand president of the Freshman Com- Wood traced the steps through which discovered in the cellar of the garage.<br />\n----mission, and Raymond Cluster, of methods more highly - refined than Since the evidence was largely circum- twenty-five percent cheaper—for ex- backfield position, by dint of his<br />\nMrs. Lucy Johnson, dietician extra- Phi Sigma Delta, in the vice-pres- those of the Federal Investigation stantial, the man received a ten-year ample, the fare to New York will be accurate hurling of the pigskin. Ted<br />\nGraziano will call the signals for<br />\n\"rdinaire, has announced that the con- idential ballot. The secretary, Court- Bureau were used, permitting the sentence for murder.<br />\n$5.65 instead of $7.50.<br />\nsponsored by the cefeteria will wright, a Delta Upsilon and a can- tracking down of the criminal, no matStudents going to New York, and the Big Blue team and much is exThus, through application of the scibe continued for one more week. The didate for the Cotillion Board, elimences of metallurgy, chemistry, and any other place, wishing to travel in pected of Ted in the way of line<br />\nter how carefully he had worked.<br />\n°biect of the contest is to see how inated Arthur Rossett in the finals.<br />\nFrom the fragments, the pieces of explosives, Dr. Wood was instrumental a group, are asked to sign today at plunges. George Kahl resumes his<br />\nInanY words can be made from \"anti- Applefield, treasurer, was victorious the tube whin had contained the dy- in the detection and solution of what the Registrar's Office, for the train fullback duties and will probably take<br />\nthesis.\"<br />\nover Harold O'Brien, a Kappa Sigma namite were selected and mailed to had appeared to be the perfect crime, they wish to go on. If twenty-five stu- over the punting assignment. Bob<br />\nThere are several prizes, each of the pledge. In the final for sergeant-at- several makers of tubing in the coun- a possibility which is becoming more dents sign for any one train, a ticket Ward and Bernie Vincenti are exWinners receiving free meals in the arms, VVhitelock, Kappa Alpha, de- try, finally identified by one of them and more remote, as science aids in agent will be at the Registrar's Of- pected to answer the call for the<br />\neafteria for a specified time.<br />\n(Continued on Page 3, Col. 1)<br />\nfeated Harold Jaffe.<br />\nas coming from a product used on tightening the net about the criminals. fice Wednesday morning.<br />\n<br />\nDU Will<br />\nurprise<br />\nind of<br />\nat this<br />\nWith a blare of brasses from the<br />\nExpert Skillful hirelings of Will Hudson and<br />\nI fabEddie De Lange, Turkey Day festiv'e outtheir<br />\neakish ities at the Hopkins will swing to<br />\nheight at the Alcazar in the First Cotillion next Thursday. The Board offers<br />\n<br />\nBarnstormers Cast<br />\nCalledVervTalented<br />\n<br />\nJerome Davis Asks<br />\nStudentsToVenture<br />\nmit/<br />\n<br />\nKirkwood Elected<br />\nFreshman President<br />\n<br />\nDr. Woods Solves Bombing Crime<br />\nBy Use Of Scientific Methods<br />\n<br />\nCafeteria Continues<br />\nTo Sponsor Contest<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br />\n<br />\n2<br />\n<br />\ntrbe jobn5 JtopkiuS<br />\n<br />\ncil represent the Campus before the<br />\nDean and attempt to secure the<br />\nabrogation of the policy?<br />\nThe matter, is essence, boils down,<br />\nit seems, to whether or not we should<br />\n<br />\nIRCLIN'<br />\nTHE<br />\nAMPUS<br />\n<br />\nHYMN TO THE GREAT DEAD Intercollegiates<br />\n<br />\nSome years ago at the University<br />\nBy J. MURRAY KEMPTON<br />\ninterloper may babble inanely, \"Nice of Notre Dame, quarterbacks used to<br />\nLEON (Bix) BEIDERBECKER<br />\ntrumpet.\" But the faithful are by whip their Irish elevens into forma(Died 1932)<br />\nmiracle silent, almost reverent. They tion by yelling signals in Italian and<br />\nCornet<br />\nhave assemblies at all. Why doesn't<br />\nPolish. Now football teams, almost<br />\nI had been thumbing my way seem to stop and tip their hats.<br />\nthe Council sound the Student Body<br />\nuniversally, use the old fashioned<br />\nAbout<br />\ndead.<br />\nis<br />\ngreat<br />\njazz's<br />\nFor<br />\nBix<br />\nM.<br />\nof<br />\npart<br />\nparticular<br />\nthat<br />\nthrough<br />\n,:Aut.ca<br />\non the subject? We suggest a quesBy STANLEY MORTON FINKEL<br />\nby Mad<br />\nHugues Parnassie's invaluable \"Guide him alone the faithful never debate. English numbers. But Tom Conley,<br />\n- ---tionnaire somewhat as follows:<br />\nIn the papers we read how the to Swing Music, which is devoted to Then later Armstrong has been at- coach at John Carrol university, has<br />\nktuatt Sub.cuption tees to reasurer, Student<br />\nbe<br />\nshould<br />\nassemblies<br />\nActivities Council, tternsen hail, rustuthee, joints<br />\nshirts stopped history in Nazi record lists of the masters of jazz in tacked as licking the old fire, Good- a new system whereby the names of<br />\nthink<br />\nbrown<br />\nyou<br />\nDo<br />\nHopkins Lnivetsiiy.<br />\nthe black shirts in Fasc.st their most characteristic moods when man as steeped in commercialism, foods--pastries especially, are subGermany,<br />\nabolished?<br />\ncompletely<br />\nEntered as second class matter December 3,<br />\ngold shirts in Mexico and my eye caught that caption. And, for Teagarden as uninspired, Teddy Wil- stituted.<br />\nthe<br />\nItaly,<br />\nbe<br />\nshould<br />\n1909, at the rustunice in Baltimore, Md., under<br />\nDo you think assemblies<br />\nthe Act ut Lungiess, November 3, 113'9.<br />\nothers, but here is a shirt which the first time, I realized that Bix will son as an imitator of Father Hines.<br />\nSignals are no longer complicated.<br />\ncompulsory?<br />\nstopped Sophomore History when Dr. have been dead five years come Feb- These others abide the question, but because the quarterback yells, \"BaPublished semi-weekly f ruin October to June,<br />\nexcept during examination and college holiday<br />\nIf assemblies are voluntary, would Greenfield VMS delivering a lecture.<br />\nBix alone is free.<br />\nnana cream\" or \"pineapple pie\" and<br />\nruary.<br />\nperiods by undergraduates of the johns Hopkins<br />\nUniversity.<br />\nyou attend regularly?<br />\n(Who said it couldn't happen here?)<br />\nmen hop into their various formthe<br />\nI'll<br />\nwhich<br />\nfor<br />\nis<br />\none<br />\nanniversary<br />\nThis<br />\nI cannot tell you what was Bix's<br />\nOne of our very fair-headed stu- wager they won't call out the army magic. Eminent critics have applied ations.<br />\nEDITORIAL STAFF<br />\nthe Council has sethink<br />\nDo<br />\nyou<br />\n. Editor-in-Chief<br />\nWilliam Diamond<br />\ndents (if he weren't our frat brother and the navy. Mr. Roosevelt won't to him the classim idiom--usual stylNeither fire nor water could chase<br />\nAssociate Editor cured the best speakers available?<br />\n...<br />\nStanley Finkel<br />\nJames Morrow, David Caplan Managing Editors<br />\ntell you it was Morty Bryer) produce one of those felicitious ad- ized stuff about perfect intervals, two Columbia university law classes<br />\nwe'd<br />\nEditor<br />\nSports<br />\nBernard 1). l'inek<br />\nWhat kinds of speakers would you<br />\ncame a few minutes late into the dresses in the course of which it is and phrases \"so fine as to be almost from the building. In true \"shosi<br />\nBenjamin Root, Wethered Barron, Jr.<br />\nAssislual Munaymg Editors like to hear?<br />\nSophomore History class. If you have subtly proved that, should the subject transparent.\" Such things cannot ac- must go on\" spirit the classes coni<br />\nAssistant Sports Editor<br />\nHarold Zheutliti<br />\nReporters—Max Iskowitz, Nathaniel Finkelstein,<br />\nHave you any suggestions'?<br />\never entered late into a history lee- return to life, he would thrown him- count for the overpowering nostal- tinued until they could be dismissed<br />\nJewett Goldsmith, Howard Reizenstein, Jul.<br />\nian Adler, ( rl Rusin, Leonard Riihingur.<br />\nture you know with what tiptoe-trig self whole-heartedly into the New gia of \"I'm Coming, Virginia,\" the \"by a decision of a higher court\"<br />\nMorris Wessel, Arthur Katz. Martin<br />\ndainty movements our hero approach- Deal. For Leon Beiderbecke was a pure glass of \"Singing the Blues,\" or while firemen and volunteers were<br />\nKrieger, Lester Rosenthal, Murray Kenipton.<br />\nBUSINESS STAFF<br />\nI ed the nearest seat. ,<br />\njazz cornetist, and jazz cornetists the sweeping attack of \"The River- trying to check the blaze.<br />\nBusiness Manager<br />\nWilliam B. Kenipton<br />\nA Rip Van Winkle of one of th<br />\nThe few rubber-necks who turned don't rate among the elite. In fact boat Shuffle.\"<br />\nAssistant Business Manager<br />\nMelville Locker<br />\nA managing editor in a recent movie around were joined by many others as<br />\nAdvertising Manager<br />\nWin. C. Erlanger<br />\nclasses who had found solace i<br />\nany true jazz fan, who hears you<br />\nCirculation Manager<br />\nGerald Wilkti<br />\nFor<br />\nBix's<br />\ncreative<br />\ninstinct<br />\nnever<br />\nOffice Manager was exasperatedly giving orders to their classmate took off his jacket— talking \"about Leon Beiderbecke and<br />\nHoward Liiikoff<br />\n\"snore-dom\" before the fire broke<br />\nran short. The infinite variety of his<br />\nCopy av,i Filiog Manager<br />\nNathaniel Soifer<br />\nchange the headline for the evening's revealing a ear-splitting, brilliantly- his cornet'.: is apt to toss you a lev- work was never dependent on rich- out was aroused after much shakinj<br />\nand sprinted from the smoke-filled<br />\nchecked red shirt. With great efforts eling glance and the acid comment ness of phrase or<br />\nMember<br />\n1936<br />\n1437<br />\nedition.<br />\nperfection of inMOM.<br />\nclass surprised their strong that \"the boy's name is Bix and he<br />\nentire<br />\nthe<br />\nterval. When he took off on one of<br />\n\"Try 'War Threatens Europe'—<br />\nAssociated Colleeide Press<br />\nThat big red apple sometimel<br />\ntemptation to titter.<br />\nplayed the horn.\"<br />\nthose ever - soaring inmprovisations,<br />\nthat's always good.\"<br />\nDistributors of<br />\nFinally the prof even saw red,<br />\nYet Bix is not without his notaries. everything that attaches itself to found in its parking space on the<br />\n\"What countries?\"<br />\ncenter of teacher's desk took th<br />\nstopped the lecture and smiled at the Every now and then, when a group critical rigamarole went by<br />\nthe<br />\nform of a bottle of Hiram Walker'<br />\n\"Flip a nickel!\"<br />\nBlonde Bryer.<br />\nof the faithful are gathered around board.<br />\na quart at that, on the desk of In<br />\nHis action as the signal for the most a good record collection, someone<br />\no FO* NATIONAL aovaariairio SY<br />\nIt was a good gag, because it hit<br />\nOf the spark within him we can structor Mulloy at Creighton Uni<br />\nRemthat<br />\nroar<br />\nSophomoronic<br />\non<br />\nthe<br />\nold<br />\none<br />\nAnd<br />\nones.<br />\nof<br />\nwill<br />\nput<br />\nterrific<br />\nInc.<br />\nNational Advertising Service,<br />\nclose to home. There is an undercurknow nothing. George Wettling, the versity.<br />\nCollet, Publisher., Representative<br />\nsen Hall has heard for years as the then a silence falls, as out of the<br />\nrent of feeling all through the United<br />\ngreat Chicago drummer, once told<br />\nNEW YORK, N.Y.<br />\n420 MADISON AVE.<br />\nIt was presented to him by th<br />\nclass of 1939 just \"let themselves go!\" confusion and welter of styles, there<br />\nBOSTON . SAN FRANCISCO<br />\nCHIC:k00<br />\nStates, particularly among college<br />\nme of hearing Bix as a raw country class after the completion of one<br />\nSEAT1LIL<br />\nAwn<br />\n.<br />\n•<br />\n*<br />\n*<br />\nLOs ANC., FS<br />\narches one clear line of music. Some<br />\npeople, that war looms imminent—<br />\nboy just up from Iowa playing those his \"gigantic assignments\" in thWell if nothing else, the NEWS-LETTuesday, November 24, 1936<br />\nflip •a nickel to decide where it will<br />\nglassy,<br />\nsoaring phrases on an old hopes that it would acquaint hi<br />\nTER can boast of an editor who rebreak.<br />\nsilver cornet. And, even when he with that muggy feeling that com<br />\nnewspaper<br />\na<br />\nthroughout<br />\nmained sober<br />\ngrew harder, playing \"hot\" solos for after too long a session with pag<br />\nHearst in his newsreels, is fond of<br />\nThomas C. Donnelly, associate proconvention.<br />\nthe great commercial bands and and pages of fine print.<br />\nshowing Italian, German and Russian<br />\nthe<br />\nUniverat<br />\na<br />\nof<br />\ngovernment<br />\ninto<br />\nfessor<br />\nAnd if our semi-weekly runs<br />\ndrinking his way into the grave, he<br />\npreparations for war. Armed men<br />\nMullop, on impulse, tossed the ho<br />\ndeficit this year, you might blame it sity of New Mexico claims that the<br />\nThere is no point in repeating here<br />\nnever seemed to lose that essential tle into the wastebasket, saying<br />\nmarching in uncountable battalions,<br />\nhas<br />\n, state public health laboratory<br />\neditor<br />\nour<br />\ncoca-cola's<br />\nnine<br />\nthe<br />\non<br />\nwhat has already been said in the hundreds of tanks shooting flame, airstyle and eternal freshness of in- \"Like the Europeans, I don't believ<br />\nbought for the nine feminine repre-' saved the people of New Mexico apspiration, Wettling who knew him crime and alcohol are associated.\"<br />\nSports Page and what will be said in planes swooping in bomb practice—<br />\nproximately $650,000 since it was essenatives at the I.N.A. convention.<br />\nin the years of decline, talks like one<br />\nIt is Oliver T. Beahrs' own magi(<br />\nthe local Sports columns during the how militaristic governments under<br />\nin<br />\n1920.<br />\ntablished<br />\nyou<br />\nplease<br />\nWoull<br />\n(Editor's note:<br />\nwho has known the Gods.<br />\nUnited<br />\nthe<br />\nis<br />\nit<br />\nBut<br />\nwith<br />\nare!<br />\nEveryone<br />\ndictators<br />\nthat is making his financial diffiremainder of the week.<br />\nWith the acquisition of a new sailstick to Circlin' the Campus?)<br />\nI was surprised when I realized culties vanish. Beahrs, a 22-year-oil<br />\nany black and blue blood coursing States who leads the world in her ar(As ociate editor's note: We are, ing pavilion on the Charles river basin<br />\nthat Bix will have been dead for five student at the University of Calimament appropriations these days.<br />\nInstithrough his veins will be the pers<br />\nand<br />\n36<br />\ndinghies,<br />\nMassachusetts<br />\ncampus—<br />\nwhich<br />\nsaying<br />\nnot<br />\ntut we're<br />\ncation of anticipation all through his<br />\nWho will be the first to strike? so you're note even on Muhlenberg's tute of Technology now has the most years next February. It seems a long fornia, performs sleight of hiss<br />\nThanksgiving Day dinner. We won't Flip a nickel!<br />\nextensive college yachting facilities in time when you hear him on one of magic to pay for his schooling.<br />\ngrounds!)<br />\nFor over five years he has bee<br />\nthe old ones, picking up some trite<br />\nthe country.<br />\n* 5 *<br />\nmake any optimistic prediction:<br />\nDr. T. Z. Koo, Chinese lecturer, also<br />\ncooked eggs out of t<br />\nsnatching<br />\nlittle<br />\nand<br />\nendowTram<br />\nafter<br />\ntheme<br />\nof<br />\ninstructor<br />\nLawrence,<br />\nProfessor<br />\nthey're bad luck. We won't make any expressed alarm at the pugnacious atbeing<br />\nTo continue our reputation for<br />\npessimistic ones: they're worse luck. mosphere of the world when he was in catty we'll have to tell you about a ri3nglish and journalism at Northwest- ing it with the glory of sheer crea- air, pulling rabbits out of hats, an<br />\nern University, won the ping-pong tion. I don't think they'll call out slipping out of handcuffs -- befori<br />\nBut we can predict that the boys will Syracuse a few weeks ago. Treaties recent dorm incident.<br />\nchampionship of the liner Normandie the bands for Bix as for the Pick- audiences, of course.<br />\nmake it hot for the Johnnies Saturday. limiting armies and navies, treaties<br />\nHerMax<br />\nand<br />\nHart<br />\nEd<br />\nIt seems that<br />\nHe spends his summers bafflin!<br />\nvhile on his way to Europe last sum- wicks and the Gilberts. But it's nice<br />\npromising mutual support in case of sey found a stray kitten who aroused<br />\ntheatre - goers with hi<br />\nAlaskan<br />\nthe<br />\nsame.<br />\nhat<br />\nall<br />\nand<br />\ntip<br />\nto<br />\nyour<br />\nstop<br />\n.r<br />\nCr.<br />\ndecided<br />\nthey<br />\naggression, treaties pledging neutral- their catty instincts So<br />\ne-eye\" tricks. Eski<br />\nquicker-than-th<br />\nfor<br />\nto<br />\nrecords,<br />\nBix's<br />\nAs<br />\nNOTE<br />\nity and peace, are running out this to keep the feline, feeding it with milk<br />\nand Indians have conferre(<br />\nmoes<br />\nthe<br />\nof<br />\nsake<br />\nthis<br />\nwas<br />\nwritten,<br />\nwhich<br />\nyear, and no one seems to be making from—oh, well, this really isn't the FRIENDLY<br />\nRELATIONS the great recording companies have upon him the coveted title of \"Ding<br />\nreason for the university deficit. AnyIn one form or another, several any successful move to renew them.<br />\nand<br />\nreprinted many of the classics. Victor Gesun Niein\" or the \"Big Medicini<br />\ncharges were made against the Stu\"War in two years! War in two how, they were successful for several<br />\nis conspicuous for the \"Memorial Man.\" Beahrs will graduate nes<br />\nTHANKSGIVING<br />\ndent Council in the last issue of the years!\" he asserted, pounding in days as the pet changed hands, we<br />\nAlbum,\" which contains some great May, after which he intends to di<br />\nNEws-Lerros As yet, there has been rhythm on the table before him with mean rooms, every night until .. .<br />\nbut very little Bix. Brunswick's enough magic to \"carpet\" himsel<br />\njazz,<br />\nThanksThe<br />\nannual<br />\nInternational<br />\nThe boys thought they were going<br />\nno answer from the Council, no alibis, dreadful emphasis.<br />\nof \"Singin' the Blues\" and through a three year medical course<br />\nreprint<br />\nto raise a cat, the authorities raised giving Dinner and Dance will be held<br />\nno rebuttal, no nothin'. There are<br />\nThe \"Installment plan\" dance a<br />\nWhich treaty or lack of one will<br />\nVirginia,\" with Frankie<br />\nCoining<br />\n\"I'm<br />\nRay<br />\nat<br />\nHall,<br />\n6.30<br />\nseveral possibilities for this silence: precipitate the deluge? Flip a nickel! hell, and now the dormers are sticking tonight at Levering<br />\nHis Or- Oregon State college offers men Btu<br />\nand<br />\n(Tram)<br />\nMraumbauer<br />\nKim, Chairman of the Friendly Relato raising beards.<br />\nI.—The Student Council thinks the<br />\nplenty of variety—if they ha<br />\nA boy and girl from campuses on<br />\ntions Committee of the \"Y\", will be chestra, is a standard classic, Vocal- dents<br />\nhis<br />\nwith<br />\nhappy<br />\nits<br />\nof<br />\nquite<br />\nRill<br />\nworthy<br />\nAlan<br />\nnot<br />\nare<br />\nmade<br />\ncharges<br />\nnickles. They are admittel<br />\nenough<br />\nfor<br />\nis<br />\nresponsible<br />\nian<br />\n\"Sorry—Since<br />\nopposite sides of the United States<br />\ndate at St. Paul and Greenmount, toastmaster, and Rev. T. Guthrie<br />\nattention; it refuses to recognize that<br />\nsorority for five cents an<br />\neach<br />\nto<br />\nMe<br />\nTurned<br />\nGirl<br />\nand<br />\nMy<br />\nDown\"<br />\nBest<br />\nFuof<br />\nVeterans<br />\nthe<br />\ndiscussing<br />\nwere<br />\njust struttin' along .. . Iry M. using Speers, of the Brown Memorial -The Jazz Me Blues—At the Jazz' have the privilege of dancing for 11<br />\ncertain evils are present in its aswars:<br />\nture<br />\nbe<br />\nthe<br />\nspeaker.<br />\nwill<br />\nChurch,<br />\nhis accordion talent in a rumble-seat<br />\nsembly system. This is, of course,<br />\nbefore they are shooed oti;<br />\nThe committee for the occasion Band Ball,\" all of which contain ex- minutes<br />\n\"It was a crazy idea, but it sure was . . . Phi Alph gave quite an affair at<br />\nhighly improbable, The Council canAttention is also Since the dance lasts three hour<br />\nBix<br />\nsolos.<br />\ntended<br />\nM.<br />\nKim,<br />\nof<br />\nChairman,<br />\nRay<br />\nconsists<br />\nthe Southern with the usual amount<br />\nnot but recognize that there are more based on sense,\" he said.<br />\ncalled to Bix's great piano solo on they can, if the desire, shuffle at 1<br />\n\"You don't really think that the af campus figures . . . TOM Ellis's A. Firpi, Charles Swartz, and Newthan two people on the Campus who<br />\ndifferent houses—all for sixty cents<br />\nVocalion's \"In a Mist.\"<br />\nland Day.<br />\nare raising their voices in objection United States will enter another war I :amsming smile at The Log Cabin. .<br />\nto the assembly system. Since the —not with so many people enrolled in Lenny Jaffe a genial host at Levering<br />\n(in spite of all that girl's efforts, Don<br />\nCouncil represents the Student Body, the pacifist cause!\" she questioned.<br />\nFight Tuberculosis<br />\nSchapiro remains — 2 'scandal - power<br />\nsomeif<br />\nas<br />\nIt is not likely that it is neglecting a<br />\nfeel<br />\nonly<br />\n\"I don't know. I<br />\nOn Thanksgiving Day Christmas<br />\nproblem which half the student body, thing inevitable were going to put me for this column) . . . Alan Pinker\"Thanks a hell of a Seals will again be sent to the people<br />\nat least, is discussing.<br />\nin uniform by a year from next spring, ton's grateful<br />\nas he left his frat brother's car. of the state in order to raise funds<br />\n2.—Or, the silence may result from and send me marching, even though I :ot,\"<br />\n* 5 *<br />\nto continue the fight against tuberthe fact that the Student Council know it's futile.\"<br />\nreported that culosis. This sale will be the thirtieth<br />\nis<br />\nauthoritatively<br />\nIt<br />\ncharges<br />\nthe<br />\nof<br />\nvalidity<br />\nadmits the<br />\nWhere is he going? Flip a nickel!<br />\nMrs. Vanneman has succombed to the one conducted by the Maryland Tuand is acting upon them. We hope<br />\nRound and round the crazy world , earmuff craze.<br />\nberculosis Association.<br />\nthe<br />\nof<br />\ncause<br />\ntrue<br />\nthis second is the<br />\n* 5 *<br />\nsoes, where it will all end nobody<br />\nThe death rate in Maryland has<br />\nCouncil's silence, but somehow we<br />\nknows. The last war fought to end<br />\nAnd there is the small fry who told Been reduced from 204.7 per 100,000<br />\nbelieve it owes the Student Body a<br />\nall wars—to make the world safe for his brother (an ex-editor of the people in 1907 to 79 per 100,000 in<br />\nstatment of intentions.<br />\ndemocracy. What will the next one NEWS-LETTER, at present a grad stu- 935. Tuberculosis is still however,<br />\nThe attitude of the Council in the be fought for?<br />\nthe leading cause of<br />\ndent, and a prolilc writer on Yorth<br />\nmatter of compulsory assemblies is<br />\nFIGHT<br />\ndeath between t h e<br />\nand social movements . . . Merely<br />\neven<br />\nunderstandable,<br />\nTUBERCULOSIS<br />\nnot completely<br />\nHAVE RAILWAY EXPRESS SHIP<br />\nbackfamily<br />\nsome<br />\nyou<br />\nages<br />\nof 15 and 45, the<br />\ngive<br />\nto<br />\ngiven<br />\nafter its letter to the Campus. The<br />\ncame<br />\nfirst<br />\nmost productive peground) that he thought<br />\nYOUR BAGGAGE BOTH WAYS!<br />\nopinion of the student body is almost<br />\nriod of life.<br />\nbillion, next trillion, then Cotillion.<br />\nunanimously against forced attend\"A new economic system must be<br />\nAmong the activiSpeaking of Cotillions, if this year's<br />\nance. One sign of this fact is in the devised, based on plenty not scarcity;<br />\nties of the Maryland<br />\nThanksgiving affair is a repetition of<br />\npetitions<br />\nthe<br />\nincome,<br />\nof<br />\non<br />\nsigners<br />\nthrift;<br />\nnot<br />\nof<br />\nnumber<br />\nan consumption<br />\nSend it home and back at economical<br />\nTuberculosis Associlast season's success, the dance will<br />\n•<br />\nwhich have been in circulation dur- aot capital; on use, not profit.\"<br />\n1<br />\n.°40<br />\n4<br />\n)<br />\nfiare<br />\nthat<br />\nation<br />\nthe<br />\nmake<br />\ncost by the old reliable college standto<br />\nbe a swell one. Enough<br />\ning the past few days. There is little<br />\nThus spoke Dr. Broad's Mitchell,<br />\nof<br />\nsale<br />\nby<br />\nthe<br />\nnanced<br />\na<br />\nlittle.<br />\nblush<br />\nPrinceton<br />\nof<br />\nRailway Express when you're<br />\nPresident<br />\nphone<br />\nby. You merely<br />\ndoubt that many more names would Associate Professor of Political Econ* 5 *<br />\nChristmas Seals are:<br />\nyour baggage is picked up<br />\nconcerning<br />\ncoming,<br />\nUse<br />\nBuy<br />\nand<br />\nclause<br />\nand<br />\nready. Going<br />\nbe added if the<br />\nomy in an address sponsored by the<br />\nA return engagement of the picturi- CHRISTMAS a state - wide sysby fast express train,<br />\nforwarded<br />\ncharge,<br />\npaid speakers were eliminated.<br />\nextra<br />\nwithout<br />\nSoc!al Science Department of Contem of free chest<br />\nzation of Owen Wister's novel \"The<br />\nSEALS<br />\nalso without<br />\nanywhere,<br />\npractically<br />\npromptly<br />\nWhence comes this reluctance of necticut College for Women, at New<br />\ndelivered<br />\nclinics, the Miracle<br />\nVirginian\" is now at the Little. Gary<br />\nno<br />\nin line, no<br />\nthe Council to depart from a system London, COT1/1., last Friday. The<br />\ndelay,<br />\nstanding<br />\nNo<br />\nexpense.<br />\nadditional<br />\nCooper and Walter Huston have the 'louse for children who have been In<br />\nwhich the Campus generally con- speaker was introduced by Dr. Harold<br />\nand inlow<br />\nand<br />\neconomical<br />\nare<br />\ncosts<br />\nteaching<br />\na<br />\nShipping<br />\ntuberculosis,<br />\nwith<br />\ndickering.<br />\ncontact<br />\ntwo leading roles.<br />\ndemns-the same Campus which R. Hutcheson, who took his degree at<br />\n* 5*<br />\nYou also get a reshipment.<br />\nclinic for colored physicians, public<br />\neach<br />\non<br />\ninsurance<br />\n$50.<br />\ndude<br />\nelected that Council to act for it?<br />\nthe Hopkins, and who is now an inThe Barnstormers rehearsal was health education and medical receipt on pick-up and Railway Express takes one,on delivThe Council implies, in its letter, strucutor in Economics at Connecticut<br />\nuproar for about seven- search.<br />\nan<br />\nin<br />\nthrown<br />\ndo<br />\nassemblies<br />\nery, to prove arrival in good condition. You have only to<br />\nthat since voluntary<br />\nCollege.<br />\nteen minutes when a trio of dogs (a<br />\nnotify Railway Express when to call, same as with the<br />\nnot attract enough people, the fault<br />\nDr. Mitchell declared in the course fox terrior, an Irish setter, a bulldog<br />\nBut, seriously, Hal refused to comof the entire matter lies with the of his address, \"that the old economics<br />\nweekly home laundry package and all will be swift, safe<br />\n-two females and one nuz,'e) got in ment as to wether some girl slapped<br />\nAdministration of the University.<br />\nnot<br />\nis<br />\nscarcity<br />\nserene. You simply take your train home. But phone<br />\non<br />\nand<br />\npredicated<br />\nsystem<br />\nhis wrist or whether it's just a bad<br />\na little scrap at the Barn.<br />\nThe Administration wants assemb- applicable to the new social order.\"<br />\nwithout fail and if you want standard shipping tags—<br />\nfirst<br />\n.<br />\ntemperaa<br />\nhandshakingitis<br />\nbe<br />\ncase of<br />\nOur dog is getting to<br />\nlies; voluntary assemblies don't work;<br />\n* 5 *<br />\nhe said, mental actress; and although about<br />\nproduction,\"<br />\nto use—mention it. They're yours on request. e<br />\nin<br />\nbest<br />\n\"Proficiency<br />\nthe<br />\nthey must be compulsory.<br />\ninvalidated our old concepts and one-sixteenth of the size of the other<br />\nof the excellent contributions<br />\n\"has<br />\nOne<br />\nIf, as the Council implies, the fault we can't cling any longer to the notion<br />\nCHARLES and FAYETTE STS.<br />\nof New Britain, Connecticut, to Haldogs, she put up a good fight.<br />\nVernon 0600<br />\nlies with Administration, why has it<br />\nindividuality in producwas the limore's social life wishes that those<br />\npreserving<br />\nshame,\"<br />\nof<br />\ndog-gone<br />\na<br />\n\"It's<br />\natten208 E. Franklin Street<br />\nOffice:<br />\nthe<br />\nDepot<br />\nto<br />\nmatter<br />\nthe<br />\nbrought<br />\nnot<br />\nher up so<br />\nVernon 0600<br />\n4 14)1-morons wouldn't call<br />\ntion..\"<br />\nopinion of the coach, Johnny Desch.<br />\nMd.<br />\nBaltimore,<br />\ntion of the Administration? The<br />\n* 5*<br />\noften when she is writing a comThe present administration finds itCouncil is, above all else, the medium<br />\ncommented<br />\nshe<br />\nsince<br />\nEver since Hal Wolfson broke his position. Ever<br />\naccording to Mitchell, \"apparbetween the Student Body and the self,<br />\nof in- wrist, he is being taken by all the in the \"News-Letter\" about her earprogram<br />\na<br />\nto<br />\ndedicated<br />\nently<br />\nBody<br />\nStudent<br />\nthe<br />\nAdministration. If<br />\nbeing pestefficiency and waste.\" He condemned drunks in the Saturday night eating- muffs, this Goucherub is<br />\nAGENCY, INC.<br />\nis so unanimously unsympathetic to\"Daily<br />\nPress,\"<br />\n\"Associated<br />\nthe<br />\nby<br />\nered<br />\nwho<br />\nheroes<br />\nactivities as \"wedded to places as various football<br />\nwards one of the policies of the Ad- government<br />\nNATION-WIDE RAIL -AIR SERVICE<br />\nscarcity.\" gave their right wrist for old Siwash. Mirror,\" and others.<br />\nministration, why does not the Coun- the notion of perpetuating<br />\n<br />\n}Letter<br />\n<br />\nFlip A Nickel<br />\n<br />\nC.ollefsiuto Ditsest<br />\n<br />\nOther Campuses<br />\n<br />\nJays And Johnnies<br />\n<br />\nIn Re: Assemblies<br />\n<br />\nA TROUBLE-SAVING TIP...<br />\n<br />\nTo<br />\nHome-bound<br />\nThanks-Givers<br />\n<br />\nMitchell In Conn.<br />\n<br />\n4<br />\n<br />\nRAILWAY EXPRESS<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br />\n<br />\n3<br />\n<br />\n•••<br />\n<br />\nMalakis To Address Hopkins Press To Dr. Wrinch Speaks<br />\nles Offers New Dr Bowman Speaks Spiked 'Shoe Meet Friends<br />\nOf Library<br />\nOn<br />\nUniversity<br />\nAims<br />\nWon<br />\nBy<br />\nCurtis<br />\nH.<br />\nS.<br />\nHonor Willoughby To Biology Faculty<br />\nSubstitute For<br />\nDr. Garner Of Illinois To Has Worked Extensively On<br />\nHeard By Washington Alum- N. Y. Harriers Cop Second<br />\nOld Capitalism ni At Reception In<br />\nHave Leading Article<br />\nConsecutive Title By<br />\nof(47 Chromosome<br />\n<br />\ntersity<br />\nsod to<br />\normain and<br />\nSi most<br />\nhioned<br />\n<br />\ny, has<br />\nnes of<br />\nsubicated<br />\n“Ba.<br />\nand<br />\nform<br />\nchase<br />\nlasses<br />\n\"oho%<br />\nS conmisse<br />\ncourt'<br />\n; wer<br />\nof th<br />\ntee<br />\nbrok<br />\nh akin<br />\ne-fille<br />\n<br />\netim<br />\nth<br />\n)k th<br />\n<br />\nOliver<br />\n<br />\nSILENT ON CONTRACT<br />\nEducator Being Droppd By<br />\nYale Tells He Would<br />\nAchieve End<br />\nDr. Jerome Davis, Yale University<br />\nProfessor who charged the university<br />\nwas not renewing his contract because of his \"economic opinions,\"<br />\nlast night offered a \"cooperative<br />\nDemocratic state\" as a substitute for<br />\ncapitalism which, he said, stood badly<br />\nin need of reform.<br />\nDr. Davis spoke at Wilson Memorial<br />\nMethodist Episcopal Church South,<br />\nunder auspices of the University Supper Club, sponsored by the Young<br />\nMen's Christian Association branch<br />\nat the Johns Hopkins University.<br />\n<br />\nof In<br />\nUni<br />\n<br />\nContract Not Mentioned<br />\nHe made no mention in his address<br />\nOf the Yale contract as professor of<br />\nby th sociology, which Dr. James Roland<br />\none o<br />\nAngell, president of the university,<br />\nin th(<br />\nsaid had been canceled because of<br />\nit hill'<br />\nthe \"budgetary situation.\"<br />\ncomet<br />\nLast night's speaker is a professor<br />\npaged<br />\nin the Yale School of Divinity and he<br />\nis president of the American Federhe bot<br />\nation of Teachers.<br />\nTo his audience of several hunbeliev<br />\ndred men and women, Dr. Davis adted.\"<br />\nmagi) vanced his idea of organization of<br />\nthe \"cooperative Democratic state\" in<br />\ndiffi<br />\near-ol; four major ways. There must be organization into \"consumers' cooperf Cali<br />\natives,\" he said, and into trade unions<br />\nhas<br />\nor \"producers' cooperatives.\"<br />\ng.<br />\n<br />\nbee<br />\nof th<br />\nts, an,<br />\nbefoil<br />\n9<br />\n<br />\n)afflin;<br />\nla hi<br />\nEski<br />\nnferre;<br />\n\"Ding<br />\n[edicint<br />\n<br />\na flex<br />\n<br />\nto d,<br />\nhimsel<br />\ncourse<br />\nnce<br />\nen stu<br />\n;y hay,<br />\n<br />\nIts as<br />\nfor<br />\ned out<br />\nhour0<br />\na at 1:<br />\ncen ti<br />\n<br />\nII<br />\n<br />\nCE<br />\n<br />\nOn Dr. Willoughby<br />\n<br />\nOn Thursday, December 3, at 4:30<br />\nP. M., members of the Friends of the<br />\n(Continued from Page 1, Col, 4)<br />\nThe distancement of Curtis High<br />\nDr. Isaiah Bowman, President of<br />\nLibrary will gather for a tea in the entitled From Geopolitik to Political<br />\nthe University, was heard last Wed- School, New York, eked out a vic- Gilman Room and will have the priv- Relativism.<br />\nnesday by the Washington Alumni tory in the annual cross - country<br />\nThe Scientific Method and the Fuilege of meeting a new member of the<br />\nAssociation, at their reception in his meet sponsored by the Hopkins chapture of Political Science by Marshall<br />\nter<br />\nof<br />\nacademic<br />\nthe<br />\nfamily,<br />\nNational<br />\nDr.<br />\nCollegiate<br />\nSociEmile<br />\nMalakis,<br />\nhonor, held in Washington. The meetE. Dcimock, Depatment of Political<br />\ning, after Dr. Bowman's address, was ety of Spiked Shot at Homewood last who comes to us as associate profesScience, University of Chicago, and<br />\nSaturday,<br />\nNovember<br />\n21,<br />\nwith<br />\na<br />\ntotal<br />\ndevoted to the election of officers for<br />\nsor of French Literature. Professor A Scientific Approach to the Study of<br />\nof forty team points. This is the<br />\nnext year.<br />\nMalakis will speak informally on Low by Walter Wheeler Cook, ProfesThis year Henry H. Glassie is Pres- second successive year the Curtis\"Chateaubriand\"<br />\nand his Travels in sor of Law, Northwestern University<br />\nident, and James Lee Bost, Secre- men have been victors.<br />\nAmerica<br />\nand<br />\nStein, of Chester High, ran the<br />\nan exhibit of books re- are included in the fourth part. This<br />\ntary. The new officers are Dr. Wm.<br />\nvery difficult two and one half mile lated to his topic drawn from his own chapter is entitled The Scientific<br />\nJackson Humphreys, President; Dr.<br />\nlibrary and from our collections will Method in PoUtics and Law.<br />\nLyman James Briggs, Vice - Presi- course in the remarkable time of<br />\nEssay By Sachs<br />\nbe displayed.<br />\n13<br />\nminutes<br />\nand<br />\n44<br />\nseconds.<br />\nTaking<br />\ndent, and Pierre Ghent, assistant<br />\nPark V, The Constitutional and Adthe lead at the start he led the pack<br />\nNotes On The Special Collections<br />\nSecretary and Treasurer. Mr. Bost<br />\nall through, and finished fully 320<br />\nThe Oliver Wendell Holmes Collec- ministrative Law, is subdivided into<br />\nwill continue as Secretary. Dr.<br />\ntion, presented four years ago by Dr. two topics. One is The Saga of klackyards ahead of the second man.<br />\nHumphreys is a well-known MeteorIn spite of the fact that Chester Lawrason Brown of Saranac Lake, stone v. Miller, which is a study in<br />\nological Physicist, and Dr. Briggs<br />\nran first, their having had only one New York, has been augmented by a Multiple State Taxation. The other is<br />\nholds the directorship of the Bureau<br />\nman entered eliminated them from further gift of rare books and pam- called Bankruptcy a3 a Subject of Adof Standards.<br />\nthe<br />\nteam scoring. Cook, of Southern phlets from Dr. Brown. Among these ministrative Jurisdiction. The first<br />\nDr. Bowman spoke a three-fold<br />\nHigh,<br />\nran second, coming in about 45 additional items as well as in the orig- was written by Leon Sachs Departplea for intelligence and efficiency<br />\nseconds<br />\nafter Steiner. Cook has been inal collection, there are numerous ment of Political Science at the Hop:n Government and Bureaus of Govschool harrier this year, works not listed in the Social Holmes kins, the second by Albert Langelutstellar<br />\nhigh<br />\narnment, for non-political education<br />\ncoming<br />\nin<br />\nfirst<br />\nfor Southern in a bibliography prepared by Mr. George tig, member of the Chicago Bar.<br />\nadministration, and for united action<br />\nThe last chapter is entitled Interlarge<br />\npercentage<br />\nof its meets this B. Ives. Arrangements have been made<br />\ntoward these ends, with men of abilyear. Potts, of City, and Hallam, of to have the entire collection indexed, nation& Law. In this part Political<br />\n.ty and experience in the positions<br />\nso that a handlist will be available for Disputes in International Law is<br />\nIf trust and responsibility. He Curtis, came in thrd and fourth rehandled by Charles G. Fenwick, Pro.reated on the foundation and use of spectively, within the next few sec- readers. Holmes was so largely idenonds. A Curtis man ran fifth fol- tied with the cultural life of New Eng- fessor of Political Science, Bryn Mawr<br />\nommissions and bureaus in our counlowed by four of the Polymen.<br />\nland for so long a time that a gather- College, while the second part deals<br />\n.ry as a necessary step which has<br />\nIn calculating team points, due to ing of his occasional poems and ad- with Legal Aspects of the Lytton ReJeen abused. A discussion of the<br />\nelimination, Cook<br />\nwas dresses is not a bad beginning for a port, by C. Watter Young,<br />\niced for scientific study and work Steiner's<br />\nThe book is printed mainly for the<br />\n,n the difficult problems of rela- counted one, and all other men moved literary history of his times. The entire<br />\nup one point. Final figures gave collection numbers nearly 200 pieces, friends of Dr. Willoughby who would<br />\nions between people, and the symCurtis forty points; Poly, 45; City, including letters and other manu- like to possess a copy of this tribute<br />\n)olism of the University as man's<br />\n63;; Southern, 82; and St. Joseph's, scripts.<br />\nto him. The book is on sale for $3.00.<br />\ntspiration toward the highest ideals<br />\n95. Hallam, however, was penalized<br />\nind powers, was terminated with a<br />\nfive seconds, for an infringement,<br />\nbrief outline of the task which forms<br />\nthus dropping Curtis into a perilous<br />\n!arms the work of the men in direcposition, wherfrom she emerged with<br />\n'Lion of a University; to select good<br />\na mere 42-43 victory over Poly.<br />\n,nen, and let them alone within reaThe race, according to the Hopkins'<br />\nsonable limits, provide a faculty<br />\nalert against complacency, and a Coach Hambleton, was \"one of the<br />\nstudent body which will waste as best. A very fast race. The time was<br />\nlittle time as possible, and an alumni fine.\"<br />\n<br />\nHis Honor<br />\n<br />\nDr. Davis Proposes \"Cooperative Democratic State\"<br />\nIn Talk Here<br />\n<br />\nWendell Holmes Collection<br />\nAugmented Recently<br />\nBy Gift<br />\n<br />\nOne Point Margin<br />\n<br />\n;roup determine and vigorous in purThis was the fifth annual race<br />\nMore effective political parties also suit of high standards in scholarship sponsored by the Spiked Shoe Socishould be organized, he continued, and material support.<br />\nety, national honorary track associaand this would mean, in all probabiltion.<br />\nity, the rise of Farmer-Labor and<br />\nProgressive parties.<br />\nFor Your<br />\nUrges Spiritual Force<br />\nLiquors<br />\nFinally, Dr. Davis said, the nation<br />\nshould organize as \"religious believers<br />\nto put the spiritual dynamo behind<br />\n3113 GREENMOUNT AVE.<br />\nthe changes that must be made.\"<br />\nFor Delivery<br />\nPhone UN. 4883<br />\n\"It depends on us whether we get<br />\nit,\" he said. \"We've certainly had<br />\n2111M1011111111011111111111111111Hill1111111111111111111111111111111111111Ili11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111V1<br />\nenough warnings to make us aware<br />\nOf the need for change. The World<br />\nWar and the investigations into the<br />\nmunitions industry alone should have<br />\nbeen ample.<br />\n\"I think that what we get will not<br />\nbe recognized by historians as capitalism. It may look very much like<br />\nthe Sweden of today.\"<br />\nDr. Davis termed the present distribution of wealth and power as<br />\n\"highly disgraceful.\" He said the<br />\nleaders of industry had no right to<br />\ncriticize WPA workers for \"spending<br />\nmost of their time leaning on their<br />\nShovels\" because, he continued, that<br />\nis precisely what industry did during<br />\nthe depression years.<br />\nConcentration of wealth into cor\"Mortimer,just look at Stuyvesant—the lone wolf of the Union Club.<br />\nporations, he went on, is growing to<br />\nlie hasn'tjoined the swing to TWENTY GRAND!\"<br />\nsuch an extent that if it should continue at the same rate for forty years,<br />\nall the wealth of the nation would<br />\nbe in the 200 wealthiest corporations.<br />\nRill<br />\n<br />\nPATRONIZE<br />\nTHE<br />\nJAY - JOHNNY<br />\nHOLIDAY TILT<br />\n<br />\nStructure<br />\nDr. Dorothy Wrinch, of the Mathematics Institute at Oxford University, and at present working on the<br />\nPhysico - chemical structure of the<br />\nchromosome, addressed the Biology<br />\nFaculty and Graduate Students last<br />\nFriday night.<br />\nDuring the last few years, Dr.<br />\nWrinch has become interested in the<br />\nstructure of the chromosomes, and<br />\nhas attempted to correlate the work<br />\nof the geneticists and gytologists<br />\nwith the present known knowledge<br />\nof organic molecules.<br />\nSpeaking on \"The Structure of the<br />\nChromosome,\" Dr. Wrinch put forth<br />\nthe theory that the chromosomes are<br />\nmade up of threads of protarnines interlaced with nucleic acid molecules.<br />\nAt the beginning of her talk she<br />\npleads for more interrelation between<br />\nthe fields of sicence, and asked more<br />\nchemists and physcists to Investigate the mysteries of biology.<br />\nDr. Wrinch is at present on a five<br />\nyear Rockefeller Grant to carry on<br />\nthis correlation, and she is spending<br />\npart of that time here in Amorist<br />\nJonferring with American Scientists.<br />\n<br />\nYES. BUT I<br />\nDON`i ENJOY<br />\nA PIPE THE<br />\nWAY YOU<br />\nSENIORS 00.<br />\n<br />\nr<br />\n<br />\nSeeHARRY<br />\n<br />\nYOU WILL—ONCE YOU TRY A<br />\nLOAD OF THE COLLEGE MAN'S<br />\nSMOKE*<br />\n—.HERE!<br />\n<br />\nBetter Dress<br />\nArrow unveils its newest dress shirt.<br />\nWe might call it dual control—Arrow's new<br />\nwell-behaved dress shirt which promises<br />\nnever to bulge out at the sides, dig into you<br />\nwhen you bend over, or ride up when you<br />\nsit down. Archer design—back curved in<br />\nand tails cupped to fit. It's the Lido —$3.<br />\nObserve the two ingenious suspender loops and trouser<br />\ntab to hold bosom in place—(adjustable tor swing music)!<br />\n<br />\nOther Arrow Dress Shirts $2.50 and more.<br />\nSanforized Shrunk.... A new shirt if one ever shrinks.<br />\n<br />\nCopr. 1936 The Axton.Fisher Tobacco Co., Inc.<br />\n<br />\nWE CERTIFY that we have inspected the Turkish and Domestic Tobaccos<br />\nblended in TWENTY GRAND cigarettes<br />\nand find them as fine in smoking quality as those used in cigarettes costing<br />\n<br />\nTraditional Football Clash<br />\nAt Homewood Saturday<br />\n(Continued from Page 1, Col. 6)<br />\nblocking halfbacks, with the latter in<br />\nthe prime position.<br />\nJohnny Royster centers the line<br />\nfrom his point of vantage and throws<br />\n210 pounds into the battle. Bud Mehling, sturdy sopnomore understudy,<br />\nWill see much action should Johnny<br />\nbe injured. Bill Day and Jimmy Hopkins take up their positions at the<br />\nguards, flanked by big Tommy Ellis<br />\nand \"Bruiser\" Kilbourne, tackles.<br />\nKilbourne is taking up the post vacant by Popow's migration into the<br />\nbrain trust. The line is further reinforced by Vickers and Baetjer at<br />\nthe wing outposts. Vickers, at the<br />\nright end will give the opposing<br />\nsafety men a great deal of concern<br />\nWhile Baetjer, the speedster of the<br />\narray, will make the tries after<br />\ntouchdown. The latter will be a constant threat to the Johnnie eleven by<br />\nvirtue of his educated toe.<br />\nAs has been the custom in recent<br />\nyears, a bonfire will be built on the<br />\nHopkins campus on the night previous to the encounter. The affair<br />\nWill serve to satisfy the enthusiasm<br />\nWhich will have reached its climax<br />\nat this point. The coaches and outstanding gridmen will speak in order<br />\nto rouse the pre-game excitement to<br />\nnew heights.<br />\n<br />\nPluc local<br />\ntax In<br />\ntax static,<br />\n<br />\n(Signed)<br />\n<br />\nas much as 50% more.<br />\nSeil,Putt& Rusby 10C. Analytical Laboratories<br />\n<br />\n(In collaboration with tobacco expert)<br />\nALSO OBTAINABLE IN FLAT FIFTIES<br />\n<br />\nBe Correctly Dressed For The Cotillion.<br />\nGet Your Collar At<br />\nM<br />\n<br />\nc Pherson's<br />\n<br />\n11 East Baltimore Street<br />\n<br />\nTHE COTILLION BOARD<br />\nPresents For The First Time In Baltimore<br />\nTHE NEW DANCE SENSATION<br />\n<br />\nHUTSON-DeLANGE<br />\n<br />\n10 to 3<br />\n<br />\nmg<br />\n<br />\n...and one inside white paraffin<br />\nwrapper from a tin of Edgeworth<br />\nJr. We ntake this amazing offer<br />\nof a $1.00 English Type Folding<br />\nPouch in Rep Cloth with Rubberized Liner for only 10¢ and<br />\none wrapper just to persuade<br />\nyou to try Falgeworth Jr. Buy<br />\na tin of Edgeworth Jr. today.<br />\nTake out the inside wrapper.<br />\nSend the wrapper and your dime<br />\ntogether with this coupon (or<br />\nwrite your name, eitilege and<br />\naddress on the wrapper)—and<br />\nwe will semi your pouch born ed lately.<br />\nOnly one to a<br />\ncustomer.<br />\n<br />\nSPECIAL<br />\nOFFER<br />\n<br />\nTickets Are On Sale In Levering Hall<br />\nTHANKSGIVING NIGHT<br />\n<br />\n$1.00 POUCH IN YOUR<br />\nCOLLEGE COLORS<br />\n<br />\nALCAZAR BALLROOM<br />\nL<br />\n<br />\nTick<br />\n<br />\n2.50 Stag<br />\nr'<br />\nCouple<br />\n<br />\nMial NM NS INS IMO<br />\nLamm & Bro. Co., Richmond. a.<br />\nEnclosed find 100 and one inpiide whito<br />\nparaffin wrapper Iron, a tin of f:agrworth<br />\nJr., for which send me $1.00 value silk<br />\ntobacco pouch in my college colors.<br />\nName—<br />\nAddress<br />\nCity<br />\n<br />\nState<br />\n<br />\nCOLLEGE'<br />\nOffer goodfor only 30 days<br />\nOw ova so um ima amp Imo um am<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br />\n<br />\n4<br />\n<br />\nPhantoms, AllStars, Cardiacs<br />\nAre Victorious<br />\n<br />\nPast Scores<br />\n100.1 llupgAtis<br />\n\".5'-,.., ..4,4.1A13<br />\n<br />\n......<br />\n<br />\nPower<br />\n<br />\nIn<br />\n<br />\nCrushing Victory Over<br />\nGas-Civils<br />\n<br />\n)01111 8<br />\n<br />\n..A..<br />\n<br />\njULM S<br />\n<br />\n40<br />\n<br />\naL. jWill<br />\n<br />\n...,.. Jul,. li<br />\n<br />\nII)<br />\n<br />\nI .a Upgsla<br />\n<br />\nId<br />\n<br />\nI Aut./v.411M<br />\n<br />\n.<br />\n.4...74,<br />\n0<br />\n<br />\nL.<br />\n<br />\nJUL. 3 ..---<br />\n<br />\nA 0,...Y LI Upal.aliti<br />\n<br />\n\" ^ 1074/<br />\n109h<br />\nlo93<br />\n<br />\nSs.<br />\n<br />\n15/.4.4.4115<br />\n<br />\nst. Juan's<br />\n<br />\n10<br />\n<br />\nJuan's -------<br />\n<br />\n0<br />\nu Blue Booters Shut Out Moun...—.....-<br />\n<br />\n10<br />\n<br />\nU<br />\n<br />\n111.11)K.L.1<br />\n<br />\n13<br />\n<br />\n^1693 st Joun's.....-- 18<br />\n6<br />\nx1594 St. Jonn's<br />\n22<br />\n1593 St. joint's<br />\n8lb<br />\n'1595 51. JU11(1.<br />\n18913 No game.<br />\n<br />\nIlupKit11<br />\n<br />\nHopx.iiiii<br />\nst. jonn's<br />\n:1L. Joun's<br />\nHopkins<br />\nHopkins<br />\ni iopkins<br />\n<br />\nliopmns<br />\nItopicins<br />\n<br />\n6<br />\n<br />\nd .......—<br />\n<br />\n13<br />\n<br />\n.7L. JUrlIl 3 .-. ZU<br />\nW. 301101<br />\nL.<br />\n<br />\nxxoy4 Hopscins<br />\nShow<br />\n<br />\n...It.<br />\n<br />\nU<br />\n<br />\nloess Si. Joun s<br />\n<br />\nX109.1<br />\n<br />\nCardiacs<br />\n<br />\ntu<br />\n<br />\n...........<br />\n<br />\n4<br />\nO<br />\n0<br />\n<br />\nCardiaes Win<br />\n<br />\ntriump over the Engineers. Dukehart and Sause excelled in offensive<br />\nplay, both running and passing with<br />\nthe \"greatest of ease\" behind a team<br />\nthat contributed some superlative<br />\n<br />\n4<br />\n0<br />\n<br />\n6<br />\n<br />\ntu<br />\n4<br />\nO<br />\n<br />\nits previously compiled record and<br />\n<br />\nThe Cardiacs' touch football prowess was clearly demonstrated in their<br />\n<br />\ntainers On Saturday,<br />\n<br />\no<br />\n<br />\n0<br />\n6 St. John's<br />\n1891 Hopkins<br />\n0<br />\n6 Hopkins<br />\n1898 St. .1c:inn's ,<br />\n6<br />\n1899 Hopkins ____....... 11 st. jonn's<br />\nAHEAD! 1900 Hopkins<br />\n5<br />\nPLAY-OFFS<br />\n5 st. John's<br />\n0<br />\nJohn's<br />\nSt.<br />\nHopkins<br />\n6<br />\nz19U1<br />\n1902-03 No game.<br />\n5<br />\n6 11 opkins<br />\n1904 St. John's<br />\n5<br />\nBaer Expects Finals To Be 1905 St. John's ...._ . 11 Hopkins,<br />\n___<br />\n0<br />\n2<br />\n_______<br />\nHopkini<br />\n1906 St. John's<br />\n0<br />\nU St. John's<br />\n1907 Hopkins<br />\nPlayed After Thanks4<br />\n11 Hopkins<br />\n1908 St. John's<br />\n0<br />\n18 St. John's<br />\nHopkins<br />\n1909<br />\ngiving<br />\n0<br />\n14 st. John's<br />\n1910 Hopkins<br />\no<br />\n16 st. John's<br />\n1911 Hopkins<br />\n2<br />\nSt. John's --------27 Hopkins<br />\n1912<br />\nClimaxing a week of really spir- 1913 Hopkins<br />\n3<br />\n14 St. John's<br />\n13<br />\n1914 St. John's ..... 34 Hopkins<br />\nited battling, the Intra-Mural foot- 1915 Hopkins- 20 st. John's<br />\n6<br />\n3<br />\n- 6 Hopkins<br />\nSt. John's<br />\nball league drew to a close with the 1916<br />\nHopkins<br />\n0<br />\n6<br />\n....<br />\nJohn's<br />\n1917 St.<br />\n7<br />\n14 St. John's<br />\nHopkins<br />\n1918<br />\nCardiacs, Phantoms, and New Jersey 1919 Hopkins<br />\n- 13<br />\n13 St. John's .<br />\n0<br />\n41 St. John's<br />\nHopkins<br />\nAll-F'tars clinching their title two 1920<br />\n8<br />\n___<br />\n..<br />\n1921 Hopkins .. ..... 17 St. John's<br />\n7<br />\n...._ ._.. 16 St. John's<br />\nHopkins<br />\n1922<br />\nweeks ago by trouncing the Tigers. 1923 Hopkins ...<br />\n0<br />\n3 St. ohn's<br />\n0<br />\n26 St. John's<br />\nHopkins<br />\n__........<br />\n1924<br />\nBoth the Cardiacs and Phantoms 1925 Hopkins<br />\n3<br />\n7 St. John's<br />\no<br />\n33 St. John's<br />\nHopkins .<br />\nwaited until last week to establish 1926<br />\no<br />\n1927 Hopkins .„_ 32 St. ,John's<br />\n46<br />\n0<br />\nHopkins<br />\n1928 St. John's<br />\nthemselves as victors; the former 1929<br />\n0<br />\n33 Hopkins<br />\nSt. John's<br />\n6<br />\nSt. John's ___ _ 26 Hopkins<br />\ncrushing last year's champ Senior 1910<br />\n19'31 Honkins .._ ... 20 St. ,Tohn's------------14<br />\n13 St. Joh' ----- --- -----0<br />\nHopkins ....<br />\nGas-Civils under a barrage of four 1912<br />\n1913 St. John's<br />\n13 nonkins--------------------0<br />\n1014 St. 'John's<br />\n13 Hopkins7<br />\ntouchdowns; the latter resting on 1935<br />\n0<br />\n6 Hopkins<br />\nSt. John's<br />\n<br />\nonly tying the Invaders, 6-6.<br />\n<br />\nBlue Ridge Succumbs To Jays; So They Think<br />\nArmy Booters Earn 4-1 Win<br />\n<br />\ns* Second game.<br />\n** Hopkins represented by class team. •<br />\nx Hopkins disbanded before scheduled game.<br />\nxx Stopped by referee, tie.<br />\nz St. John's walked off field, forfeit., in<br />\n1902.<br />\nSeries standing----St. John's win 24, johns<br />\nHopkins won 22. tied 7.<br />\nPoints standing----Johns Hopkins, 477; St.<br />\nJohn's, 461.<br />\n<br />\nThe St. Johns team is looking forward to the coming battle with antiThe fight in division A narrowed<br />\ncipation of an easy victory. Below down to two fraternities when the<br />\nCadets Conquer Jays At West are some of their opinions.<br />\nPhi Lambda Phi team eliminated<br />\nthe Phi Psi's by a 4-2 score.<br />\nPoint In Heavy<br />\nDeLisio: Look for a tough and vicious game<br />\nReferee Kaufman<br />\nwith no quarter given by Hopkins. St. John's<br />\nWind<br />\nAfter the game, Millard Kaufman,<br />\nwill come out on top.<br />\nHammann: We should take them if we play<br />\nthe referee said, \"Splendid team<br />\nThe Blue Jay Booters suffered a ball.<br />\nRoache: I would like to see us break that a<br />\nheady quarter-backing wereworl,nd evisevere set-back at the hands of a record of 46-0.<br />\ndent<br />\non both sides, and the close score 1'<br />\nwin<br />\n31-0.<br />\nAliba•<br />\nLambros:<br />\nWe're<br />\ngoing<br />\nto<br />\nmore competent Cadet aggregation 1/abbaindicates how evenly balanced the<br />\nSands: 20-6; no use paying, it's so sure.<br />\nat West Point last Wednesday by the<br />\nBurns; Expect a very close game.<br />\nteams were. This was by far the best .<br />\nscore of 4-1.<br />\nLathrop: We should win.<br />\nWeisheit: If conditions are right, we have a game of the year.\" He also said,\"Both<br />\nCadets Conquer Storm<br />\ngood chance of beating them as had as they teams<br />\nwell<br />\nwere<br />\nexceptionally<br />\nDespite the heavy wind that pre- have eVer been beaten.<br />\nChristhilf: I'm sure we will beat them, but matched and the resultant low score<br />\nvailed, the West Pointers battled, we will have to be on the alert for surprises, was no indication of offensive weaksinking three of their four goals, in 20-0.<br />\nD. Snibbe: Think it will be a good mine, as ness on the part of either aggretwo<br />\ntouchstorm.<br />\nat<br />\nleast<br />\nthe<br />\nusual,<br />\nbut<br />\nwe<br />\nwill<br />\nwin<br />\nby<br />\nteeth<br />\nof<br />\nthe very<br />\ndowns.<br />\ngation.\"<br />\nEarly in the opening period, Major<br />\nMacMillan: We are out for a new record. •<br />\nTau Alpha Omega caused one of<br />\nof<br />\nedge<br />\nin<br />\nevery<br />\nphase<br />\nTodd:<br />\nWe<br />\nhave<br />\nthe<br />\nCadets,<br />\nplaying inside right for the<br />\nthe dime.<br />\nthe most startling upsets by beating<br />\nStallings: We'll skunk 'em!<br />\nsank a direct pass from center Odom.<br />\nBuck: We can't be stopped!<br />\nAlpha Epsilon Phi, Playing as exThere was no further scoring until<br />\n11. Snibbe: I can see no chance for those<br />\npected the Delta Phis gained a 6-0<br />\nthe third quarter when Odom sue- llookinic boys.<br />\nTownshend: We'll clean up by three touch- victory over Tau Alpha Phi to comcesfully punting the ball into scoring downs.<br />\nplete the day's games.<br />\nLevely: We niorht to win.<br />\nposition followed through with a drivDivision Champs<br />\ning kick which found a resting place<br />\nCampus<br />\nDivision B Championship<br />\nThe<br />\nin the Hopkins' net.<br />\nThis afternoon the campus will be now rests on the outcome of the batThe Hopkins team now staged a<br />\ncrowned<br />\nwith flying footballs as All- tle between Delta Upsilon and Omiget<br />\nits<br />\nonly<br />\npoint.<br />\ncounter attack to<br />\nBrayshaw playing center for the Fraternity Athletic Day is inaugu- cron Kappa Omicron, while the Pi<br />\nBlue team, was on the delivery end rated. Every fraternity on the campus Lambs and Sigma Phi Upsilons are<br />\ndeadlocked for Division A honors<br />\nof the punt that yielded the Jays their will participate.<br />\n<br />\nThe Blue Jay Booters beat the<br />\nBlue Ridge soccer team at Homewood Saturday by a score of 4-0.<br />\nThe Blue Ridge team playing a hard<br />\ndefense game finally yielded to the<br />\nHopkins' assault when Linthicum<br />\nplaying center forward for the Jays<br />\ndented the net with a fast boot from<br />\nclose quarters.<br />\nHopkins Scores Repeatedly<br />\nThe second half opened with the<br />\nBlue Jays more determined than ever<br />\nto insure a quick victory. Three goals<br />\nwere chalked up in short order by<br />\nPrice, Hartke, and Brayshaw respectively as the Hopkins team continued their driving attack against<br />\nthe less competent Mountaineers.<br />\nThe Blue Ridge team was only<br />\nable to make four attempts at scoring throughout the entire game. The<br />\nHopkins' defense proved invincible<br />\nwhile the offense time and again<br />\nthwarted the Blue Ridge Booters with<br />\ntheir clever dribbling and passing.<br />\nlone tally.<br />\nArmy Scores Again<br />\nBernheim Injured<br />\nAs the game neared an end the<br />\nBill Gough, veteran outside right<br />\nperformer, was switched to full back Cadets scored two more goals to<br />\nposition to substitute for Pete Bern- make their victory certain.<br />\nhelm, captain and ace back man for<br />\nthe Jays who was out on an injury<br />\nCharles Lander, Prop.<br />\nsuffered in the Army tilt last WedHair Cutting 40c<br />\nBOULEVARD BARBER SHOP<br />\nnesday.<br />\n<br />\nHandball<br />\n<br />\nFencing<br />\nThe fencing ladder tournament<br />\nfor varsity positions begins im-<br />\n<br />\nThe playoffs of the handball ladder tournament have been postponed one week so as to begin on<br />\nSaturday, December 5, instead of<br />\nthis coming Saturday, as originally planned, because of the intertournament<br />\nthe<br />\nwith<br />\nference<br />\ncaused by the coming of the<br />\nThanksgiving vacation this week.<br />\n<br />\nmediately after the Thanksgiving<br />\nThe Phantom-Invader game was .vacation. Opportunities are still<br />\nhotly contested from the beginning. open for those wishing to participate. Practice is held at the barn<br />\nSwartzman crossed the goal - line<br />\nregularly<br />\non Wednesday at 8 P.M.<br />\nearly in the game for the Phantoms'<br />\nand on Saturday at 2 P.M.<br />\nonly score, while Milberg scored for<br />\nthe Invaders, with Alperstein supply,<br />\ning the needed interference.<br />\nPlayoffs After Holiday<br />\nLNEW YORK LOAN OFFICE<br />\nPlayoffs for the intramural chamUnredeemed microscopes, cameras, binoculars, musical<br />\npionship will take place following<br />\ninstruments, slide rules.<br />\naccordHolidays<br />\nthe Thanksgiving<br />\nReuben Baer, Director of Intramural<br />\n118 North Liberty<br />\nActivities.<br />\nblocking.<br />\n<br />\nStreet<br />\n<br />\nPlaza 3495<br />\n<br />\nPhi Psi Loses To Pi<br />\nLam As TAO Wins<br />\n<br />\nOn 33rd Street<br />\nBetween St. Paul And Calvert Streets<br />\nWeek Days<br />\nSaturday<br />\n8 A.M. To 7.30 P:M: 8 A.M. To 9 P.M.<br />\n<br />\nBirely<br />\n'<br />\ns Pharmacy<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School<br />\nSandwiches<br />\n<br />\nglass of National<br />\nBeer,sipped slowly, will tell you a<br />\nlot . . . drink it<br />\nfor its exquisite flavor<br />\n.. note the sturdy body<br />\nof definite character....<br />\n<br />\nA<br />\n<br />\nAli<br />\nU<br />\n<br />\nKem<br />\nPi<br />\n<br />\nF0<br />\nP.,<br />\n8.<br />\n<br />\nto the<br />\ntional<br />\nand<br />\nehapt,<br />\nnight<br />\n4ames<br />\nthe or,<br />\nand<br />\ncilapt •<br />\n<br />\nNEWS-<br />\n<br />\nBEER<br />\nThe National Brewing Co.<br />\nBALTIMORE, MD.<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\n•<br />\n<br />\naging<br />\nDavid<br />\nNEWSeditor<br />\nRram,<br />\nHuila•<br />\n<br />\nrf NATIONAL<br />\n<br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br />\n<br />\nPi<br />\nF1<br />\n<br />\n'rho<br />\nKemp<br />\n<br />\nUnexcelled Fountain Service<br />\n<br />\nCO.<br />\n<br />\nVOL.<br />\n<br />\nCrowned<br />\n<br />\nSupplies<br />\n<br />\nJ. H. FURST<br />\n<br />\nNE<br />\n<br />\nPi I<br />\noutfit:<br />\nare no<br />\nbut to<br />\nthe is<br />\nthese,\"<br />\nto fo<br />\naaid in<br />\nto the<br />\nor jou<br />\nEpsiio<br />\nism b3<br />\neontacl<br />\nby Pas<br />\nstrictel<br />\n<br />\niatic e<br />\n<br />\nRegt<br />\nout tho<br />\nconeer<br />\nare hr.(<br />\nplans r<br />\nitiea of<br />\n<br />\nAmericaS<br />\n<br />\nSent<br />\nincludc<br />\ntrian,<br />\nboloo;<br />\n<br />\nSOCiate<br />\n<br />\nHenan<br />\naiatant<br />\nbaloo<br />\nCotuici<br />\nthe N<br />\nkina, f<br />\nNEWS-<br />\n<br />\nAll-StarEleven<br />\npasses and punts...<br />\ntouchdowns . . . performance! That's<br />\nhow America picks 'em. By wire and<br />\nair-mail, fans rush to the football experts the tip...\"Here's another sure-fire<br />\nAll-American.\"<br />\n<br />\n60 yard dashes...<br />\n<br />\nEve]<br />\nDelta<br />\nasseml<br />\nJourna<br />\nLast y<br />\nident,<br />\nArthui<br />\ndieting<br />\nWas in<br />\nat tha<br />\n<br />\nAnd when you pick the all-star<br />\ncigarette eleven, it's performance again<br />\n—it's what a cigarette does that counts<br />\n<br />\nElig<br />\ntion at<br />\nager o<br />\nCation<br />\nboard<br />\ntion, a<br />\nla the<br />\n<br />\nT-H-E-Y S-A-T-I-S-F-Y<br />\nEleven letters that spell all the good<br />\nthings a cigarette can give...mildness<br />\n... a pleasing taste and aroma ... a<br />\nblend of mild ripe home-grown and<br />\nTurkish tobaccos rolled in pure cigarette paper<br />\n<br />\nA-1]<br />\nthe pc<br />\naoring<br />\nthe a<br />\neach<br />\nhigh s<br />\ndent n<br />\nthese<br />\nnear 11<br />\n<br />\n—the essentials of a<br />\ngood cigarette<br />\n<br />\nRiek,<br />\nSp<br />\neli<br />\n<br />\nAn<br />\nWill hi<br />\ning<br />\n<br />\nClub<br />\nat 8 y<br />\nDr.<br />\nClew<br />\nductoi<br />\nWith d<br />\nzniora<br />\n<br />\nAll<br />\n<br />\nto att<br />\nCopyright 1936. LiGGETT & MyERS TOBACCO Co.<br />\n<br />\n\f", "format": "basic_html", "processed": "iat<br /><br />\niqopititts Nrtnoirttrr<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br /><br />\nVOL. XLI, No. 15<br />\nbi-<br /><br />\nHELP LICK<br />\nTHE JOHNNIES<br />\nTHURSDAY!<br />\nPRICE 5 CENTS<br /><br />\n,<br /><br />\nnirt<br />\nrills wl<br />\nLt the<br /><br />\nHopkins To Meet St.JohnsIn 54th Contest Saturday<br /><br />\ngame<br />\n11. Al<br />\nmen, 4<br />\nrho is $<br />\nnow ti<br />\ne held<br /><br />\nUS colstore<br /><br />\nThird Annual Gymboree Set For December 17th<br />\n•<br /><br />\nTo Accom- Annual Gymboree Hopkins Press Will<br />\nJay Eleven Prepares To Wage<br />\nAlcazar Houses His Brain-Child<br />\npany Hopkins Hoofers<br />\nDate Announced Honor Willoughby Hard Fight Against<br />\nFavored<br />\nHudson Delange<br />\nBy Dr. Shaffer In New Publication<br />\nJohnnie<br />\ns<br />\nAt<br />\nHomewood Field<br />\nDebut Thursday<br />\nProceeds Go To Financing Will Consist Of Essays WritOf Varsity Sweaters, Awards<br /><br />\nCotillion Board To Present<br />\n\"Sweet Rhythm\" For<br />\nTurkey Day<br />\nFrieda<br /><br />\nGibson<br /><br />\nten By Students And<br />\nAssociates<br /><br />\nWashington - Hopkins Bas- Dr. Garner Of Illinois To<br />\nketball Game To Be<br />\nHave Leading Article<br />\nFeature Event<br />\nOn Dr. Willoughby<br /><br />\nSings<br /><br />\n5<br /><br />\nMany Hail New Band A<br />\nDeparture From<br />\nTradition<br /><br />\nSuperior Record Of Crabtown Gridders Gives Them Edge<br />\nIn Traditional Battle; Lambros,Star Of Last Year's<br />\nJohnny Victory, Returns At Quarterback<br />\nPOPOW IN BACKFIELD<br />\nHe Heralds<br />\nAnnual Gymboree<br />\nJohnny Defeat Spells Success<br />\nAt Hopkins; Jays Determined To Win<br /><br />\nThe third annual Hopkins GymIn honor of Professor - Emeritus<br />\nboree has been announced for Decem- Westel Woodbury Willoughby of the<br />\nber 17, by Dr. Wilson Shaffer, Asso- Political Science Department of The<br />\nciate Director of Physical Education. Johns Hopkins University, The Johns<br />\nBy ARTHUR KATZ<br />\nPlans for this year include free admis- Hopkins Press announces the publiv .1.1.41L4 11 UIJi3L/14<br />\nsion of all students, a new plan of cation of a volume of Essays in Pol'itThis Saturday, for the fifty-fgurth<br />\nfinancial organization, and as a fea- feat Science.<br />\ntime, the fates will hold in their<br />\nture attraction, the basketball game<br />\nhands the power to mete out a sucMe book is divided into six main<br />\nbetween George Washington Universubjects, each of which is developed<br />\ncessful or disastrous season for two<br />\nsity and Hopkins. George Washington,<br />\nin essay form by either an associate<br />\nteams, since it is at that time that<br />\naccording to Dr. Shaffer, is one of<br />\nof Dr. Willoughb-y, or one of his<br />\nHopkins and St. John's will stage<br />\nthe<br />\nstrongest<br />\nteams<br />\nin the country.<br />\nas its piece de resistance to celebrants<br />\nformer students.<br />\ntheir<br />\nThe event is in charge of the Athtraditional clash at Homewood.<br />\n)SS of the holiday the smartly-served<br />\nArticle By Garner<br />\nDesch Announces He Has letic Board,<br />\nand<br />\nsponsored<br />\nThe<br />\nby<br />\nthe<br />\nBlue<br />\nAthJays have had a spotty<br />\nleading<br />\nThere<br />\nessay by Dr.<br />\nis a<br />\nmusicianship of Messrs. Hudson and<br />\nSent Invitations To<br />\nletic Council, the Omicron Delta James W. Garner, Professor of Politrecord<br />\nthis<br />\nyear, winning only one of<br />\nDe Lange and the vocalizations of<br />\nKappa Honorary Fraternity, and the ical Science, University of Illinois,<br />\nStudios<br />\nFilm<br />\nsix<br />\ncontests.<br />\nOn the other hand, the<br />\nthe delectable Miss Frieda, Gibson.<br />\nInterfraternity Board. A member of which evaluates and describes Prori Si.<br />\nCrabtown<br />\ngroup<br />\nhave taken the<br />\nDescribing the members of the cast the Athletic Board will be assigned fessor Willoughby's contributions to<br />\nWhile the beau monde regards the<br />\nmeasure of most of their opponents.<br />\nevent as the opening Of the Hopkins of Once in a Lifetime as \"the most from each of these, to integrate and Political Science. James Hart, one of<br />\ntalented people I have ever met,\" John direct the work. Mr. Gordon Mallonee his former students, follows up the<br />\nHowever, the Ivy-clustered tradition<br />\neocial season the academicians who<br />\nE. Desch,- director of the Barnstormers has been assigned to the Interfratern- essay by a presentation of a Wilthat has grown out of this semimodthe<br />\nto<br />\nstudy<br />\ndeepest<br />\ndevote their<br />\nannounced yesterday that he had sent wait for names<br />\nloughby Portrait. The two articles<br />\ncentenarian<br />\naltercation is of such a<br />\nling<br />\n\\,vai<br />\nalLuously<br />\na<br />\nern dance<br />\nDR. G. WILSON SHAFFER<br />\ne<br />\ninvitations to all the major Hollywood<br />\nThe funds, hich will be used for the have the effect of showing two sides<br />\nnature that victory in the Saturday<br />\n\"scout\"<br />\n(Story<br />\nstudios<br />\nurging<br />\nthem<br />\non<br />\nto<br />\nPage<br />\nfilm<br />\nrhythm\"<br />\n3.)<br />\nsweet<br />\nthe \"adventures in<br />\npurchase of the Varsity Athletic -of the man,<br />\nengagement is the measure of the<br />\nBarnstormer show when it is Awards, will come this year through<br />\nPart II deals with Public AdminWhich will be unfolded for their ben- the<br />\nsuccess of the entire season,<br />\npresented at the Auditorium Theatre, sale of tickets by the students to out- istration and Democracy and Adminpracticed hand of<br />\nefit under th<br />\nAs the teams stand now, the JohnDecember 12.<br />\nsiders. Each student will be asked and istration of Organization. The first<br />\nflies are afovered to win, mainly beWill Hudson. The Hudson-DeLange<br />\nexpected to sell one ticket.<br />\nCast Has Real Talent<br />\nessay was written by the brother of<br />\ncause of their superior record this<br />\norchestrations are said by many to<br />\nSince freshmen, due to their non- Professor Willoughby, William Frank\"Everyone in the cast has real talFall. The Annapolis aggregation has<br />\nbe the latest chapter in the short ent,\" said Mr. Desch. \"All have had inclusion in the three sponsoring linlin Willoughby, once Director of<br />\nregistered to date five wins, one<br />\nhut checkered history of swing.<br />\nprevious stage experiences and several groups, might be left out, an especial the Institute of Government at the<br />\ntie, and one loss. Of their common<br />\nThe boys depend for their effects have even become quite well-known to effort is to be made to reach them. The Brookings Institution at Washington, Decries Lack Of Time Spent adversaries, the Homewood eleven,<br />\nD.C.; the other by A. C. Millspaughk,<br />\nhas met defeat and the hands of three<br />\non smartly-drilled collective work local radio audiences. I don't believe Interfraternity Board will secure the<br />\nIn Out - Door Social<br />\nI have ever met a group of more tal- patronage of the pledges in the fra- also of the Brookings Institution.<br />\nprevious Johnnie opponents, all of.<br />\nrather than on unchecked solo imLaboratory<br />\nPolitical Theory<br />\nented people.\"<br />\nternities, and 0. D. K. will contact<br />\nwhich were taken in stride by the<br />\nprovisations. The results are shown<br />\nPolitical Theory occupies the third<br />\nTwo years ago Mr. Desch spent part the non-athletic activities. The freshvisitors.<br />\nDr. Jerome E. Davis, Associate<br />\nefforts of his summer vacation in the film man gym squads will, of course, be chapter of the book. Harold W. Stoke,<br />\nin the elaborately-scored<br />\nThe invading horde from Navy Row<br />\nWhich the combination has recorded city and made several contacts there reached through the Athletic Council. Associate Professor of Political Sci- Professor of Practical Philanthropy have several performers who will<br />\nence at the University of Nebraska, at Yale Divinity School addressed the bear<br />\nwatching in this tilt. Johnny<br />\n—rhythm exercises like \"Cross Coun- that he thinks might aid in giving An increased Freshman participation<br />\nand<br />\npatronage<br />\nis<br />\ndesired<br />\n'Stormers<br />\nthe<br />\nbreak<br />\nof<br />\nby<br />\nsome<br />\n\"the<br />\nthe Board. develops The Paradox of Representa- University Supper Club last Friday Lambros, quarterback, will be rethey<br />\nAvenue,\"<br />\nPark<br />\n\"Hobo<br />\non<br />\ntry Hop,\"<br />\ntive Government. E. Pendleton Herdeserve.\"<br />\nmembered by those who witnessed<br />\nnight, on \"Social Adventuring.\"<br />\n\"Eight Bars in Search of a Melody.\"<br />\nring, Department of Government at<br />\nthe<br />\ngame last year, as the painful<br />\nCanine Parts Open<br />\nDe<br />\nLamar, Talker, To Discuss Harvard University writes on Political Discussing the various social probA typical Hudson-DeLange producthorn in the side of the Jays. Time<br />\nIt was revealed that several canine Public Health<br />\nin Phillipines Parties and the Public Interest, and lems that exist in our society, Dr. after time, he ran punts thirty and<br />\ntion is the currently popular \"Organ<br />\nparts in the play have not been cast.<br />\nJohannes Mattern of the Department Davis asked student to invetigate forty yards<br />\nGrinder's Swing.\"<br />\nback, eluding many<br />\nRussian wolf hounds are preferable<br />\nA public lecture on The Progress of Political Science at the Hopkins<br />\nsome of these problems, by what he would-be<br />\ntacklers<br />\nbefore<br />\nbehag<br />\nMiss Gibson will take care of such but poodles or fox terriors will be of Public Health Work<br />\nin the Phil- completes the chapter with an essay<br />\ndowned..Again Lambros has an untermed<br />\nas<br />\n\"Social<br />\nAdventuring.\"<br />\nHe<br />\ncampus<br />\nAll<br />\nroles.<br />\nthe<br />\naccepted<br />\nfor<br />\nstraight numbers as \"You're Not the<br />\nippine Islands will be given by Dr.<br />\n(Continued on Page 3, Col. 5)<br />\nsaid, \"We are too apt to get an aero- derstudy or rather a running mate<br />\nKind,\" \"Tormented,\" and \"The Moon fraternities are invited to enter their C. Dunham this afternoon at five<br />\nin the person of Fred Burns, who<br />\nmascots in the tryouts. Pi Lambda Phi o'clock at the School of<br />\nHULLABALOO PHOTOGRAPHS plane view of social reality. The stuHygiene and<br />\nia Grinning at You,\" which have isis reputed to be even faster. Warren<br />\nand Alpha Tau Omega are already Public Health, 615 North Wolfe<br />\nThe<br />\nphotographer<br />\nfor the Hulla- dents studying the facts in the UniStreet.<br />\nHammann and Ned Lathrop will<br />\nsued from the collaborating pen of represented in the show by their rebaloo is scheduled to return to the<br />\nDr. Dunham is a Major in the Medare not always familiar with the round out the backfield quartet, exlyricist DeLange and composer Hud- spective \"house\" dogs.<br />\nHopkins December 1 and 2. All<br />\nical Corps of the U.S.A. and is the<br />\nperienced and fast.<br />\nlaboratory of society.\"<br />\nout-door<br />\nfraternity men and seniors are<br />\nson. Miss Gibson is reportedly eightdirector of laboratories in the Army<br />\nBob Snibbe, four year veteran on<br />\nHe<br />\nalso<br />\ndiscussed<br />\nthe<br />\nfield trips<br />\nwarned to make their final apeen, brunette, and vivacious, and ruMedical School. His talk is another<br />\nthe<br />\ncleat-trodden turf, will start the<br />\nwhich he takes with his students. On<br />\npointments then, as this is the last<br />\nmor has it that in her debut at a Yale<br />\nin a series of the de Lamar lectures<br />\nOrange<br />\nand Black plays from his<br />\nthese<br />\ntrips<br />\nthey<br />\nvisit such places as<br />\nchance before publication.<br />\nin Hygiene.<br />\nProm she stood the sons of Eli on<br />\nThe New York Municipal Lodging pivot position. The outstanding man<br />\n, House, Welfare Island, the New York on the line is Len Delisio, the left<br />\ntheir collective ear. She had recently Small Vote In Finals Chooses Hutchcraft For Student Council In<br />\nCity Morgue, and various factories. end. Having three years of football<br />\nreplaced Ruth Gaylor, generally assoElection<br />\nFriday's<br />\nLast<br />\nHe believes that it is impossible to under his belt, this wing man is a<br />\nciated<br />\nwith the early Hudsonteach sociology entirely from the deadly tackle on the defense as well<br />\nUeLange wax in gs.<br />\nLess than two-thirds of the freshclass rooms, and that it is absolutely as an excellent pass receiver on the<br />\nThe Grand March at Midnight will man class voted in the finals for the<br />\nnecessary to acquaint the students offense. Bill Stallings handles the<br />\nother end station to a good advanbe led by Miss Gloria Mellier, spon- man class voted in the finals for<br />\nwith the realities of society.<br />\nelection of their class officers last Explains<br />\nMethods<br />\nTrack<br />\nUsed<br />\nTo<br />\nDown<br />\nDiscussing<br />\n80r of the Cotillion, and David Erck,<br />\nthe<br />\nAmerican Federa- tage. Townsend and Christhilf will<br />\nCriminals, To<br />\nFriday. Their presidential choice was<br />\ntion<br />\nof<br />\nTeachers,<br />\nof<br />\nwhich he is Pres- try to force the Blue Jay plays into<br />\nPresident of the Board. Miss Lois<br />\nAmerican Institute Of Chemical<br />\nDonald A. Kirkwood, a Kappa Sigma<br />\nident, he said that all teachers should the center lane from their tackle<br />\nHeyward, of Jamestown, N.Y., will pledge and a Business and Engineerposts. Will Todd and Dave Snibble<br />\nEngineers<br />\njoin and unit for higher standards.<br />\ning student. He defeated Dick Green,<br />\nbe Guest of Honor.<br />\nfill<br />\nout the line flanking the snapper<br />\nAfter the Supper Club lecture, Dr.<br />\nWhen three members of the Brady only one make of automobile. Since<br />\nPatrons for the Cotillion include a member of the football team and a<br />\nDavis proceeded immediately to the at the guards.<br />\nfamily of Mt. Pleasant, Md., were the only suspect was a garage mech- Wilson<br />\nThe Jay team, although having had<br />\nthe President of the University and pledge of Delta Phi, for the office.<br />\nMemorial Methodist Episcopal<br />\nF. Milton Hutchcraft was elected blown to bits by a bomb hidden in a anic, and the automobile was handled<br />\na rather slow start in some of their<br />\nChurch<br />\nwhere<br />\nhe<br />\ngave<br />\nthe<br />\nUniversity<br />\nMrs. Isaiah Bowman, the Dean of freshman member of the student Christmas package<br />\nseveral years by his employer, the police began to Club lecture.<br />\nrecent games, are determined to<br />\nthe College and Mrs. Edward L. Council, his opponent being James<br />\nago, the police appealed to Dr. R. W. watch him closely. The mechanism<br />\ncome through with a victory over<br />\nBerry, Dr. and Mrs. Howard Cooper, Triplett, a Phi Psi pledge. Both<br />\nare Wood of the Johns Hopkins Univer- was reconstructed from the fragments,<br />\nSt. John's which will make the season<br />\nDr. and Mrs. Henry Siegerist, Mrs. students in the College of Arts and<br />\nsity for help in solving the crime. A and it was ascertained that an old- Thanksgiving Features<br />\na success and wipe away the sting of<br />\nJames B. Kempton, and Dr. Joseph Sciences.<br />\nfew small fragments found imbedded fashioned percussion cap of copper had<br />\nReduced Railroad Rates the former losses. With that in mind,<br />\nB. Ames.<br />\nVictor H. Ghent, Vice-President; in the walls of the room were all the been used to fire the machine.<br />\nplus a desire to avenge last year's<br />\nBenjamin Courtwright, Secretary; evidence obtained. By an inspection<br />\nThe police searched the home of the<br />\nSpecial reduced student rates for defeat, the Mallonee men are inculLeroy Applefield, Treasurer; and Wil- of these bits of metal, Dr. Wood was suspected man, and found a gun ident- railroad fares on the Pennsylvania cated with added spirit.<br />\nliam W. Whitelock, Sergeant-at- enabled to place the type and con- ical with that which had been recon- will be in effect for the Thanksgiving<br />\nThe Hopkins unit will be greatly<br />\nArms, were the other victorious struction of the bomb, eventually lead- structed from the evidence. A small holiday for any group of twent-five strengthened with the return of<br />\ncandidates.<br />\nbox of caps were also found. Then, a students going on one train. The re- Johnny Popow who was unable to<br />\ning to the arrest of the guilty man.<br />\nIN. Johnson Announces Committees<br />\nGhent, of Alpha Chi Rho, defeated<br />\nIn an address before the American year later, after the trial and convic- turn trip can be made individually see action against American U. because of injuries. Popow, a former<br />\nTo Reign Another<br />\nLaurie Dickson, a Phi Psi pledge Institute of Chemical Engineers, Dr. tion, a box of dynamite cartridges was on any train.<br />\nWeek<br />\nThe fare will be approximately linesman, has been transferred to a<br />\nand president of the Freshman Com- Wood traced the steps through which discovered in the cellar of the garage.<br />\n----mission, and Raymond Cluster, of methods more highly - refined than Since the evidence was largely circum- twenty-five percent cheaper—for ex- backfield position, by dint of his<br />\nMrs. Lucy Johnson, dietician extra- Phi Sigma Delta, in the vice-pres- those of the Federal Investigation stantial, the man received a ten-year ample, the fare to New York will be accurate hurling of the pigskin. Ted<br />\nGraziano will call the signals for<br />\n\"rdinaire, has announced that the con- idential ballot. The secretary, Court- Bureau were used, permitting the sentence for murder.<br />\n$5.65 instead of $7.50.<br />\nsponsored by the cefeteria will wright, a Delta Upsilon and a can- tracking down of the criminal, no matStudents going to New York, and the Big Blue team and much is exThus, through application of the scibe continued for one more week. The didate for the Cotillion Board, elimences of metallurgy, chemistry, and any other place, wishing to travel in pected of Ted in the way of line<br />\nter how carefully he had worked.<br />\n°biect of the contest is to see how inated Arthur Rossett in the finals.<br />\nFrom the fragments, the pieces of explosives, Dr. Wood was instrumental a group, are asked to sign today at plunges. George Kahl resumes his<br />\nInanY words can be made from \"anti- Applefield, treasurer, was victorious the tube whin had contained the dy- in the detection and solution of what the Registrar's Office, for the train fullback duties and will probably take<br />\nthesis.\"<br />\nover Harold O'Brien, a Kappa Sigma namite were selected and mailed to had appeared to be the perfect crime, they wish to go on. If twenty-five stu- over the punting assignment. Bob<br />\nThere are several prizes, each of the pledge. In the final for sergeant-at- several makers of tubing in the coun- a possibility which is becoming more dents sign for any one train, a ticket Ward and Bernie Vincenti are exWinners receiving free meals in the arms, VVhitelock, Kappa Alpha, de- try, finally identified by one of them and more remote, as science aids in agent will be at the Registrar's Of- pected to answer the call for the<br />\neafteria for a specified time.<br />\n(Continued on Page 3, Col. 1)<br />\nfeated Harold Jaffe.<br />\nas coming from a product used on tightening the net about the criminals. fice Wednesday morning.<br /><br />\nDU Will<br />\nurprise<br />\nind of<br />\nat this<br />\nWith a blare of brasses from the<br />\nExpert Skillful hirelings of Will Hudson and<br />\nI fabEddie De Lange, Turkey Day festiv'e outtheir<br />\neakish ities at the Hopkins will swing to<br />\nheight at the Alcazar in the First Cotillion next Thursday. The Board offers<br /><br />\nBarnstormers Cast<br />\nCalledVervTalented<br /><br />\nJerome Davis Asks<br />\nStudentsToVenture<br />\nmit/<br /><br />\nKirkwood Elected<br />\nFreshman President<br /><br />\nDr. Woods Solves Bombing Crime<br />\nBy Use Of Scientific Methods<br /><br />\nCafeteria Continues<br />\nTo Sponsor Contest<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br /><br />\n2<br /><br />\ntrbe jobn5 JtopkiuS<br /><br />\ncil represent the Campus before the<br />\nDean and attempt to secure the<br />\nabrogation of the policy?<br />\nThe matter, is essence, boils down,<br />\nit seems, to whether or not we should<br /><br />\nIRCLIN'<br />\nTHE<br />\nAMPUS<br /><br />\nHYMN TO THE GREAT DEAD Intercollegiates<br /><br />\nSome years ago at the University<br />\nBy J. MURRAY KEMPTON<br />\ninterloper may babble inanely, \"Nice of Notre Dame, quarterbacks used to<br />\nLEON (Bix) BEIDERBECKER<br />\ntrumpet.\" But the faithful are by whip their Irish elevens into forma(Died 1932)<br />\nmiracle silent, almost reverent. They tion by yelling signals in Italian and<br />\nCornet<br />\nhave assemblies at all. Why doesn't<br />\nPolish. Now football teams, almost<br />\nI had been thumbing my way seem to stop and tip their hats.<br />\nthe Council sound the Student Body<br />\nuniversally, use the old fashioned<br />\nAbout<br />\ndead.<br />\nis<br />\ngreat<br />\njazz's<br />\nFor<br />\nBix<br />\nM.<br />\nof<br />\npart<br />\nparticular<br />\nthat<br />\nthrough<br />\n,:Aut.ca<br />\non the subject? We suggest a quesBy STANLEY MORTON FINKEL<br />\nby Mad<br />\nHugues Parnassie's invaluable \"Guide him alone the faithful never debate. English numbers. But Tom Conley,<br />\n- ---tionnaire somewhat as follows:<br />\nIn the papers we read how the to Swing Music, which is devoted to Then later Armstrong has been at- coach at John Carrol university, has<br />\nktuatt Sub.cuption tees to reasurer, Student<br />\nbe<br />\nshould<br />\nassemblies<br />\nActivities Council, tternsen hail, rustuthee, joints<br />\nshirts stopped history in Nazi record lists of the masters of jazz in tacked as licking the old fire, Good- a new system whereby the names of<br />\nthink<br />\nbrown<br />\nyou<br />\nDo<br />\nHopkins Lnivetsiiy.<br />\nthe black shirts in Fasc.st their most characteristic moods when man as steeped in commercialism, foods--pastries especially, are subGermany,<br />\nabolished?<br />\ncompletely<br />\nEntered as second class matter December 3,<br />\ngold shirts in Mexico and my eye caught that caption. And, for Teagarden as uninspired, Teddy Wil- stituted.<br />\nthe<br />\nItaly,<br />\nbe<br />\nshould<br />\n1909, at the rustunice in Baltimore, Md., under<br />\nDo you think assemblies<br />\nthe Act ut Lungiess, November 3, 113'9.<br />\nothers, but here is a shirt which the first time, I realized that Bix will son as an imitator of Father Hines.<br />\nSignals are no longer complicated.<br />\ncompulsory?<br />\nstopped Sophomore History when Dr. have been dead five years come Feb- These others abide the question, but because the quarterback yells, \"BaPublished semi-weekly f ruin October to June,<br />\nexcept during examination and college holiday<br />\nIf assemblies are voluntary, would Greenfield VMS delivering a lecture.<br />\nBix alone is free.<br />\nnana cream\" or \"pineapple pie\" and<br />\nruary.<br />\nperiods by undergraduates of the johns Hopkins<br />\nUniversity.<br />\nyou attend regularly?<br />\n(Who said it couldn't happen here?)<br />\nmen hop into their various formthe<br />\nI'll<br />\nwhich<br />\nfor<br />\nis<br />\none<br />\nanniversary<br />\nThis<br />\nI cannot tell you what was Bix's<br />\nOne of our very fair-headed stu- wager they won't call out the army magic. Eminent critics have applied ations.<br />\nEDITORIAL STAFF<br />\nthe Council has sethink<br />\nDo<br />\nyou<br />\n. Editor-in-Chief<br />\nWilliam Diamond<br />\ndents (if he weren't our frat brother and the navy. Mr. Roosevelt won't to him the classim idiom--usual stylNeither fire nor water could chase<br />\nAssociate Editor cured the best speakers available?<br />\n...<br />\nStanley Finkel<br />\nJames Morrow, David Caplan Managing Editors<br />\ntell you it was Morty Bryer) produce one of those felicitious ad- ized stuff about perfect intervals, two Columbia university law classes<br />\nwe'd<br />\nEditor<br />\nSports<br />\nBernard 1). l'inek<br />\nWhat kinds of speakers would you<br />\ncame a few minutes late into the dresses in the course of which it is and phrases \"so fine as to be almost from the building. In true \"shosi<br />\nBenjamin Root, Wethered Barron, Jr.<br />\nAssislual Munaymg Editors like to hear?<br />\nSophomore History class. If you have subtly proved that, should the subject transparent.\" Such things cannot ac- must go on\" spirit the classes coni<br />\nAssistant Sports Editor<br />\nHarold Zheutliti<br />\nReporters—Max Iskowitz, Nathaniel Finkelstein,<br />\nHave you any suggestions'?<br />\never entered late into a history lee- return to life, he would thrown him- count for the overpowering nostal- tinued until they could be dismissed<br />\nJewett Goldsmith, Howard Reizenstein, Jul.<br />\nian Adler, ( rl Rusin, Leonard Riihingur.<br />\nture you know with what tiptoe-trig self whole-heartedly into the New gia of \"I'm Coming, Virginia,\" the \"by a decision of a higher court\"<br />\nMorris Wessel, Arthur Katz. Martin<br />\ndainty movements our hero approach- Deal. For Leon Beiderbecke was a pure glass of \"Singing the Blues,\" or while firemen and volunteers were<br />\nKrieger, Lester Rosenthal, Murray Kenipton.<br />\nBUSINESS STAFF<br />\nI ed the nearest seat. ,<br />\njazz cornetist, and jazz cornetists the sweeping attack of \"The River- trying to check the blaze.<br />\nBusiness Manager<br />\nWilliam B. Kenipton<br />\nA Rip Van Winkle of one of th<br />\nThe few rubber-necks who turned don't rate among the elite. In fact boat Shuffle.\"<br />\nAssistant Business Manager<br />\nMelville Locker<br />\nA managing editor in a recent movie around were joined by many others as<br />\nAdvertising Manager<br />\nWin. C. Erlanger<br />\nclasses who had found solace i<br />\nany true jazz fan, who hears you<br />\nCirculation Manager<br />\nGerald Wilkti<br />\nFor<br />\nBix's<br />\ncreative<br />\ninstinct<br />\nnever<br />\nOffice Manager was exasperatedly giving orders to their classmate took off his jacket— talking \"about Leon Beiderbecke and<br />\nHoward Liiikoff<br />\n\"snore-dom\" before the fire broke<br />\nran short. The infinite variety of his<br />\nCopy av,i Filiog Manager<br />\nNathaniel Soifer<br />\nchange the headline for the evening's revealing a ear-splitting, brilliantly- his cornet'.: is apt to toss you a lev- work was never dependent on rich- out was aroused after much shakinj<br />\nand sprinted from the smoke-filled<br />\nchecked red shirt. With great efforts eling glance and the acid comment ness of phrase or<br />\nMember<br />\n1936<br />\n1437<br />\nedition.<br />\nperfection of inMOM.<br />\nclass surprised their strong that \"the boy's name is Bix and he<br />\nentire<br />\nthe<br />\nterval. When he took off on one of<br />\n\"Try 'War Threatens Europe'—<br />\nAssociated Colleeide Press<br />\nThat big red apple sometimel<br />\ntemptation to titter.<br />\nplayed the horn.\"<br />\nthose ever - soaring inmprovisations,<br />\nthat's always good.\"<br />\nDistributors of<br />\nFinally the prof even saw red,<br />\nYet Bix is not without his notaries. everything that attaches itself to found in its parking space on the<br />\n\"What countries?\"<br />\ncenter of teacher's desk took th<br />\nstopped the lecture and smiled at the Every now and then, when a group critical rigamarole went by<br />\nthe<br />\nform of a bottle of Hiram Walker'<br />\n\"Flip a nickel!\"<br />\nBlonde Bryer.<br />\nof the faithful are gathered around board.<br />\na quart at that, on the desk of In<br />\nHis action as the signal for the most a good record collection, someone<br />\no FO* NATIONAL aovaariairio SY<br />\nIt was a good gag, because it hit<br />\nOf the spark within him we can structor Mulloy at Creighton Uni<br />\nRemthat<br />\nroar<br />\nSophomoronic<br />\non<br />\nthe<br />\nold<br />\none<br />\nAnd<br />\nones.<br />\nof<br />\nwill<br />\nput<br />\nterrific<br />\nInc.<br />\nNational Advertising Service,<br />\nclose to home. There is an undercurknow nothing. George Wettling, the versity.<br />\nCollet, Publisher., Representative<br />\nsen Hall has heard for years as the then a silence falls, as out of the<br />\nrent of feeling all through the United<br />\ngreat Chicago drummer, once told<br />\nNEW YORK, N.Y.<br />\n420 MADISON AVE.<br />\nIt was presented to him by th<br />\nclass of 1939 just \"let themselves go!\" confusion and welter of styles, there<br />\nBOSTON . SAN FRANCISCO<br />\nCHIC:k00<br />\nStates, particularly among college<br />\nme of hearing Bix as a raw country class after the completion of one<br />\nSEAT1LIL<br />\nAwn<br />\n.<br />\n•<br />\n*<br />\n*<br />\nLOs ANC., FS<br />\narches one clear line of music. Some<br />\npeople, that war looms imminent—<br />\nboy just up from Iowa playing those his \"gigantic assignments\" in thWell if nothing else, the NEWS-LETTuesday, November 24, 1936<br />\nflip •a nickel to decide where it will<br />\nglassy,<br />\nsoaring phrases on an old hopes that it would acquaint hi<br />\nTER can boast of an editor who rebreak.<br />\nsilver cornet. And, even when he with that muggy feeling that com<br />\nnewspaper<br />\na<br />\nthroughout<br />\nmained sober<br />\ngrew harder, playing \"hot\" solos for after too long a session with pag<br />\nHearst in his newsreels, is fond of<br />\nThomas C. Donnelly, associate proconvention.<br />\nthe great commercial bands and and pages of fine print.<br />\nshowing Italian, German and Russian<br />\nthe<br />\nUniverat<br />\na<br />\nof<br />\ngovernment<br />\ninto<br />\nfessor<br />\nAnd if our semi-weekly runs<br />\ndrinking his way into the grave, he<br />\npreparations for war. Armed men<br />\nMullop, on impulse, tossed the ho<br />\ndeficit this year, you might blame it sity of New Mexico claims that the<br />\nThere is no point in repeating here<br />\nnever seemed to lose that essential tle into the wastebasket, saying<br />\nmarching in uncountable battalions,<br />\nhas<br />\n, state public health laboratory<br />\neditor<br />\nour<br />\ncoca-cola's<br />\nnine<br />\nthe<br />\non<br />\nwhat has already been said in the hundreds of tanks shooting flame, airstyle and eternal freshness of in- \"Like the Europeans, I don't believ<br />\nbought for the nine feminine repre-' saved the people of New Mexico apspiration, Wettling who knew him crime and alcohol are associated.\"<br />\nSports Page and what will be said in planes swooping in bomb practice—<br />\nproximately $650,000 since it was essenatives at the I.N.A. convention.<br />\nin the years of decline, talks like one<br />\nIt is Oliver T. Beahrs' own magi(<br />\nthe local Sports columns during the how militaristic governments under<br />\nin<br />\n1920.<br />\ntablished<br />\nyou<br />\nplease<br />\nWoull<br />\n(Editor's note:<br />\nwho has known the Gods.<br />\nUnited<br />\nthe<br />\nis<br />\nit<br />\nBut<br />\nwith<br />\nare!<br />\nEveryone<br />\ndictators<br />\nthat is making his financial diffiremainder of the week.<br />\nWith the acquisition of a new sailstick to Circlin' the Campus?)<br />\nI was surprised when I realized culties vanish. Beahrs, a 22-year-oil<br />\nany black and blue blood coursing States who leads the world in her ar(As ociate editor's note: We are, ing pavilion on the Charles river basin<br />\nthat Bix will have been dead for five student at the University of Calimament appropriations these days.<br />\nInstithrough his veins will be the pers<br />\nand<br />\n36<br />\ndinghies,<br />\nMassachusetts<br />\ncampus—<br />\nwhich<br />\nsaying<br />\nnot<br />\ntut we're<br />\ncation of anticipation all through his<br />\nWho will be the first to strike? so you're note even on Muhlenberg's tute of Technology now has the most years next February. It seems a long fornia, performs sleight of hiss<br />\nThanksgiving Day dinner. We won't Flip a nickel!<br />\nextensive college yachting facilities in time when you hear him on one of magic to pay for his schooling.<br />\ngrounds!)<br />\nFor over five years he has bee<br />\nthe old ones, picking up some trite<br />\nthe country.<br />\n* 5 *<br />\nmake any optimistic prediction:<br />\nDr. T. Z. Koo, Chinese lecturer, also<br />\ncooked eggs out of t<br />\nsnatching<br />\nlittle<br />\nand<br />\nendowTram<br />\nafter<br />\ntheme<br />\nof<br />\ninstructor<br />\nLawrence,<br />\nProfessor<br />\nthey're bad luck. We won't make any expressed alarm at the pugnacious atbeing<br />\nTo continue our reputation for<br />\npessimistic ones: they're worse luck. mosphere of the world when he was in catty we'll have to tell you about a ri3nglish and journalism at Northwest- ing it with the glory of sheer crea- air, pulling rabbits out of hats, an<br />\nern University, won the ping-pong tion. I don't think they'll call out slipping out of handcuffs -- befori<br />\nBut we can predict that the boys will Syracuse a few weeks ago. Treaties recent dorm incident.<br />\nchampionship of the liner Normandie the bands for Bix as for the Pick- audiences, of course.<br />\nmake it hot for the Johnnies Saturday. limiting armies and navies, treaties<br />\nHerMax<br />\nand<br />\nHart<br />\nEd<br />\nIt seems that<br />\nHe spends his summers bafflin!<br />\nvhile on his way to Europe last sum- wicks and the Gilberts. But it's nice<br />\npromising mutual support in case of sey found a stray kitten who aroused<br />\ntheatre - goers with hi<br />\nAlaskan<br />\nthe<br />\nsame.<br />\nhat<br />\nall<br />\nand<br />\ntip<br />\nto<br />\nyour<br />\nstop<br />\n.r<br />\nCr.<br />\ndecided<br />\nthey<br />\naggression, treaties pledging neutral- their catty instincts So<br />\ne-eye\" tricks. Eski<br />\nquicker-than-th<br />\nfor<br />\nto<br />\nrecords,<br />\nBix's<br />\nAs<br />\nNOTE<br />\nity and peace, are running out this to keep the feline, feeding it with milk<br />\nand Indians have conferre(<br />\nmoes<br />\nthe<br />\nof<br />\nsake<br />\nthis<br />\nwas<br />\nwritten,<br />\nwhich<br />\nyear, and no one seems to be making from—oh, well, this really isn't the FRIENDLY<br />\nRELATIONS the great recording companies have upon him the coveted title of \"Ding<br />\nreason for the university deficit. AnyIn one form or another, several any successful move to renew them.<br />\nand<br />\nreprinted many of the classics. Victor Gesun Niein\" or the \"Big Medicini<br />\ncharges were made against the Stu\"War in two years! War in two how, they were successful for several<br />\nis conspicuous for the \"Memorial Man.\" Beahrs will graduate nes<br />\nTHANKSGIVING<br />\ndent Council in the last issue of the years!\" he asserted, pounding in days as the pet changed hands, we<br />\nAlbum,\" which contains some great May, after which he intends to di<br />\nNEws-Lerros As yet, there has been rhythm on the table before him with mean rooms, every night until .. .<br />\nbut very little Bix. Brunswick's enough magic to \"carpet\" himsel<br />\njazz,<br />\nThanksThe<br />\nannual<br />\nInternational<br />\nThe boys thought they were going<br />\nno answer from the Council, no alibis, dreadful emphasis.<br />\nof \"Singin' the Blues\" and through a three year medical course<br />\nreprint<br />\nto raise a cat, the authorities raised giving Dinner and Dance will be held<br />\nno rebuttal, no nothin'. There are<br />\nThe \"Installment plan\" dance a<br />\nWhich treaty or lack of one will<br />\nVirginia,\" with Frankie<br />\nCoining<br />\n\"I'm<br />\nRay<br />\nat<br />\nHall,<br />\n6.30<br />\nseveral possibilities for this silence: precipitate the deluge? Flip a nickel! hell, and now the dormers are sticking tonight at Levering<br />\nHis Or- Oregon State college offers men Btu<br />\nand<br />\n(Tram)<br />\nMraumbauer<br />\nKim, Chairman of the Friendly Relato raising beards.<br />\nI.—The Student Council thinks the<br />\nplenty of variety—if they ha<br />\nA boy and girl from campuses on<br />\ntions Committee of the \"Y\", will be chestra, is a standard classic, Vocal- dents<br />\nhis<br />\nwith<br />\nhappy<br />\nits<br />\nof<br />\nquite<br />\nRill<br />\nworthy<br />\nAlan<br />\nnot<br />\nare<br />\nmade<br />\ncharges<br />\nnickles. They are admittel<br />\nenough<br />\nfor<br />\nis<br />\nresponsible<br />\nian<br />\n\"Sorry—Since<br />\nopposite sides of the United States<br />\ndate at St. Paul and Greenmount, toastmaster, and Rev. T. Guthrie<br />\nattention; it refuses to recognize that<br />\nsorority for five cents an<br />\neach<br />\nto<br />\nMe<br />\nTurned<br />\nGirl<br />\nand<br />\nMy<br />\nDown\"<br />\nBest<br />\nFuof<br />\nVeterans<br />\nthe<br />\ndiscussing<br />\nwere<br />\njust struttin' along .. . Iry M. using Speers, of the Brown Memorial -The Jazz Me Blues—At the Jazz' have the privilege of dancing for 11<br />\ncertain evils are present in its aswars:<br />\nture<br />\nbe<br />\nthe<br />\nspeaker.<br />\nwill<br />\nChurch,<br />\nhis accordion talent in a rumble-seat<br />\nsembly system. This is, of course,<br />\nbefore they are shooed oti;<br />\nThe committee for the occasion Band Ball,\" all of which contain ex- minutes<br />\n\"It was a crazy idea, but it sure was . . . Phi Alph gave quite an affair at<br />\nhighly improbable, The Council canAttention is also Since the dance lasts three hour<br />\nBix<br />\nsolos.<br />\ntended<br />\nM.<br />\nKim,<br />\nof<br />\nChairman,<br />\nRay<br />\nconsists<br />\nthe Southern with the usual amount<br />\nnot but recognize that there are more based on sense,\" he said.<br />\ncalled to Bix's great piano solo on they can, if the desire, shuffle at 1<br />\n\"You don't really think that the af campus figures . . . TOM Ellis's A. Firpi, Charles Swartz, and Newthan two people on the Campus who<br />\ndifferent houses—all for sixty cents<br />\nVocalion's \"In a Mist.\"<br />\nland Day.<br />\nare raising their voices in objection United States will enter another war I :amsming smile at The Log Cabin. .<br />\nto the assembly system. Since the —not with so many people enrolled in Lenny Jaffe a genial host at Levering<br />\n(in spite of all that girl's efforts, Don<br />\nCouncil represents the Student Body, the pacifist cause!\" she questioned.<br />\nFight Tuberculosis<br />\nSchapiro remains — 2 'scandal - power<br />\nsomeif<br />\nas<br />\nIt is not likely that it is neglecting a<br />\nfeel<br />\nonly<br />\n\"I don't know. I<br />\nOn Thanksgiving Day Christmas<br />\nproblem which half the student body, thing inevitable were going to put me for this column) . . . Alan Pinker\"Thanks a hell of a Seals will again be sent to the people<br />\nat least, is discussing.<br />\nin uniform by a year from next spring, ton's grateful<br />\nas he left his frat brother's car. of the state in order to raise funds<br />\n2.—Or, the silence may result from and send me marching, even though I :ot,\"<br />\n* 5 *<br />\nto continue the fight against tuberthe fact that the Student Council know it's futile.\"<br />\nreported that culosis. This sale will be the thirtieth<br />\nis<br />\nauthoritatively<br />\nIt<br />\ncharges<br />\nthe<br />\nof<br />\nvalidity<br />\nadmits the<br />\nWhere is he going? Flip a nickel!<br />\nMrs. Vanneman has succombed to the one conducted by the Maryland Tuand is acting upon them. We hope<br />\nRound and round the crazy world , earmuff craze.<br />\nberculosis Association.<br />\nthe<br />\nof<br />\ncause<br />\ntrue<br />\nthis second is the<br />\n* 5 *<br />\nsoes, where it will all end nobody<br />\nThe death rate in Maryland has<br />\nCouncil's silence, but somehow we<br />\nknows. The last war fought to end<br />\nAnd there is the small fry who told Been reduced from 204.7 per 100,000<br />\nbelieve it owes the Student Body a<br />\nall wars—to make the world safe for his brother (an ex-editor of the people in 1907 to 79 per 100,000 in<br />\nstatment of intentions.<br />\ndemocracy. What will the next one NEWS-LETTER, at present a grad stu- 935. Tuberculosis is still however,<br />\nThe attitude of the Council in the be fought for?<br />\nthe leading cause of<br />\ndent, and a prolilc writer on Yorth<br />\nmatter of compulsory assemblies is<br />\nFIGHT<br />\ndeath between t h e<br />\nand social movements . . . Merely<br />\neven<br />\nunderstandable,<br />\nTUBERCULOSIS<br />\nnot completely<br />\nHAVE RAILWAY EXPRESS SHIP<br />\nbackfamily<br />\nsome<br />\nyou<br />\nages<br />\nof 15 and 45, the<br />\ngive<br />\nto<br />\ngiven<br />\nafter its letter to the Campus. The<br />\ncame<br />\nfirst<br />\nmost productive peground) that he thought<br />\nYOUR BAGGAGE BOTH WAYS!<br />\nopinion of the student body is almost<br />\nriod of life.<br />\nbillion, next trillion, then Cotillion.<br />\nunanimously against forced attend\"A new economic system must be<br />\nAmong the activiSpeaking of Cotillions, if this year's<br />\nance. One sign of this fact is in the devised, based on plenty not scarcity;<br />\nties of the Maryland<br />\nThanksgiving affair is a repetition of<br />\npetitions<br />\nthe<br />\nincome,<br />\nof<br />\non<br />\nsigners<br />\nthrift;<br />\nnot<br />\nof<br />\nnumber<br />\nan consumption<br />\nSend it home and back at economical<br />\nTuberculosis Associlast season's success, the dance will<br />\n•<br />\nwhich have been in circulation dur- aot capital; on use, not profit.\"<br />\n1<br />\n.°40<br />\n4<br />\n)<br />\nfiare<br />\nthat<br />\nation<br />\nthe<br />\nmake<br />\ncost by the old reliable college standto<br />\nbe a swell one. Enough<br />\ning the past few days. There is little<br />\nThus spoke Dr. Broad's Mitchell,<br />\nof<br />\nsale<br />\nby<br />\nthe<br />\nnanced<br />\na<br />\nlittle.<br />\nblush<br />\nPrinceton<br />\nof<br />\nRailway Express when you're<br />\nPresident<br />\nphone<br />\nby. You merely<br />\ndoubt that many more names would Associate Professor of Political Econ* 5 *<br />\nChristmas Seals are:<br />\nyour baggage is picked up<br />\nconcerning<br />\ncoming,<br />\nUse<br />\nBuy<br />\nand<br />\nclause<br />\nand<br />\nready. Going<br />\nbe added if the<br />\nomy in an address sponsored by the<br />\nA return engagement of the picturi- CHRISTMAS a state - wide sysby fast express train,<br />\nforwarded<br />\ncharge,<br />\npaid speakers were eliminated.<br />\nextra<br />\nwithout<br />\nSoc!al Science Department of Contem of free chest<br />\nzation of Owen Wister's novel \"The<br />\nSEALS<br />\nalso without<br />\nanywhere,<br />\npractically<br />\npromptly<br />\nWhence comes this reluctance of necticut College for Women, at New<br />\ndelivered<br />\nclinics, the Miracle<br />\nVirginian\" is now at the Little. Gary<br />\nno<br />\nin line, no<br />\nthe Council to depart from a system London, COT1/1., last Friday. The<br />\ndelay,<br />\nstanding<br />\nNo<br />\nexpense.<br />\nadditional<br />\nCooper and Walter Huston have the 'louse for children who have been In<br />\nwhich the Campus generally con- speaker was introduced by Dr. Harold<br />\nand inlow<br />\nand<br />\neconomical<br />\nare<br />\ncosts<br />\nteaching<br />\na<br />\nShipping<br />\ntuberculosis,<br />\nwith<br />\ndickering.<br />\ncontact<br />\ntwo leading roles.<br />\ndemns-the same Campus which R. Hutcheson, who took his degree at<br />\n* 5*<br />\nYou also get a reshipment.<br />\nclinic for colored physicians, public<br />\neach<br />\non<br />\ninsurance<br />\n$50.<br />\ndude<br />\nelected that Council to act for it?<br />\nthe Hopkins, and who is now an inThe Barnstormers rehearsal was health education and medical receipt on pick-up and Railway Express takes one,on delivThe Council implies, in its letter, strucutor in Economics at Connecticut<br />\nuproar for about seven- search.<br />\nan<br />\nin<br />\nthrown<br />\ndo<br />\nassemblies<br />\nery, to prove arrival in good condition. You have only to<br />\nthat since voluntary<br />\nCollege.<br />\nteen minutes when a trio of dogs (a<br />\nnotify Railway Express when to call, same as with the<br />\nnot attract enough people, the fault<br />\nDr. Mitchell declared in the course fox terrior, an Irish setter, a bulldog<br />\nBut, seriously, Hal refused to comof the entire matter lies with the of his address, \"that the old economics<br />\nweekly home laundry package and all will be swift, safe<br />\n-two females and one nuz,'e) got in ment as to wether some girl slapped<br />\nAdministration of the University.<br />\nnot<br />\nis<br />\nscarcity<br />\nserene. You simply take your train home. But phone<br />\non<br />\nand<br />\npredicated<br />\nsystem<br />\nhis wrist or whether it's just a bad<br />\na little scrap at the Barn.<br />\nThe Administration wants assemb- applicable to the new social order.\"<br />\nwithout fail and if you want standard shipping tags—<br />\nfirst<br />\n.<br />\ntemperaa<br />\nhandshakingitis<br />\nbe<br />\ncase of<br />\nOur dog is getting to<br />\nlies; voluntary assemblies don't work;<br />\n* 5 *<br />\nhe said, mental actress; and although about<br />\nproduction,\"<br />\nto use—mention it. They're yours on request. e<br />\nin<br />\nbest<br />\n\"Proficiency<br />\nthe<br />\nthey must be compulsory.<br />\ninvalidated our old concepts and one-sixteenth of the size of the other<br />\nof the excellent contributions<br />\n\"has<br />\nOne<br />\nIf, as the Council implies, the fault we can't cling any longer to the notion<br />\nCHARLES and FAYETTE STS.<br />\nof New Britain, Connecticut, to Haldogs, she put up a good fight.<br />\nVernon 0600<br />\nlies with Administration, why has it<br />\nindividuality in producwas the limore's social life wishes that those<br />\npreserving<br />\nshame,\"<br />\nof<br />\ndog-gone<br />\na<br />\n\"It's<br />\natten208 E. Franklin Street<br />\nOffice:<br />\nthe<br />\nDepot<br />\nto<br />\nmatter<br />\nthe<br />\nbrought<br />\nnot<br />\nher up so<br />\nVernon 0600<br />\n4 14)1-morons wouldn't call<br />\ntion..\"<br />\nopinion of the coach, Johnny Desch.<br />\nMd.<br />\nBaltimore,<br />\ntion of the Administration? The<br />\n* 5*<br />\noften when she is writing a comThe present administration finds itCouncil is, above all else, the medium<br />\ncommented<br />\nshe<br />\nsince<br />\nEver since Hal Wolfson broke his position. Ever<br />\naccording to Mitchell, \"apparbetween the Student Body and the self,<br />\nof in- wrist, he is being taken by all the in the \"News-Letter\" about her earprogram<br />\na<br />\nto<br />\ndedicated<br />\nently<br />\nBody<br />\nStudent<br />\nthe<br />\nAdministration. If<br />\nbeing pestefficiency and waste.\" He condemned drunks in the Saturday night eating- muffs, this Goucherub is<br />\nAGENCY, INC.<br />\nis so unanimously unsympathetic to\"Daily<br />\nPress,\"<br />\n\"Associated<br />\nthe<br />\nby<br />\nered<br />\nwho<br />\nheroes<br />\nactivities as \"wedded to places as various football<br />\nwards one of the policies of the Ad- government<br />\nNATION-WIDE RAIL -AIR SERVICE<br />\nscarcity.\" gave their right wrist for old Siwash. Mirror,\" and others.<br />\nministration, why does not the Coun- the notion of perpetuating<br /><br />\n}Letter<br /><br />\nFlip A Nickel<br /><br />\nC.ollefsiuto Ditsest<br /><br />\nOther Campuses<br /><br />\nJays And Johnnies<br /><br />\nIn Re: Assemblies<br /><br />\nA TROUBLE-SAVING TIP...<br /><br />\nTo<br />\nHome-bound<br />\nThanks-Givers<br /><br />\nMitchell In Conn.<br /><br />\n4<br /><br />\nRAILWAY EXPRESS<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br /><br />\n3<br /><br />\n•••<br /><br />\nMalakis To Address Hopkins Press To Dr. Wrinch Speaks<br />\nles Offers New Dr Bowman Speaks Spiked 'Shoe Meet Friends<br />\nOf Library<br />\nOn<br />\nUniversity<br />\nAims<br />\nWon<br />\nBy<br />\nCurtis<br />\nH.<br />\nS.<br />\nHonor Willoughby To Biology Faculty<br />\nSubstitute For<br />\nDr. Garner Of Illinois To Has Worked Extensively On<br />\nHeard By Washington Alum- N. Y. Harriers Cop Second<br />\nOld Capitalism ni At Reception In<br />\nHave Leading Article<br />\nConsecutive Title By<br />\nof(47 Chromosome<br /><br />\ntersity<br />\nsod to<br />\normain and<br />\nSi most<br />\nhioned<br /><br />\ny, has<br />\nnes of<br />\nsubicated<br />\n“Ba.<br />\nand<br />\nform<br />\nchase<br />\nlasses<br />\n\"oho%<br />\nS conmisse<br />\ncourt'<br />\n; wer<br />\nof th<br />\ntee<br />\nbrok<br />\nh akin<br />\ne-fille<br /><br />\netim<br />\nth<br />\n)k th<br /><br />\nOliver<br /><br />\nSILENT ON CONTRACT<br />\nEducator Being Droppd By<br />\nYale Tells He Would<br />\nAchieve End<br />\nDr. Jerome Davis, Yale University<br />\nProfessor who charged the university<br />\nwas not renewing his contract because of his \"economic opinions,\"<br />\nlast night offered a \"cooperative<br />\nDemocratic state\" as a substitute for<br />\ncapitalism which, he said, stood badly<br />\nin need of reform.<br />\nDr. Davis spoke at Wilson Memorial<br />\nMethodist Episcopal Church South,<br />\nunder auspices of the University Supper Club, sponsored by the Young<br />\nMen's Christian Association branch<br />\nat the Johns Hopkins University.<br /><br />\nof In<br />\nUni<br /><br />\nContract Not Mentioned<br />\nHe made no mention in his address<br />\nOf the Yale contract as professor of<br />\nby th sociology, which Dr. James Roland<br />\none o<br />\nAngell, president of the university,<br />\nin th(<br />\nsaid had been canceled because of<br />\nit hill'<br />\nthe \"budgetary situation.\"<br />\ncomet<br />\nLast night's speaker is a professor<br />\npaged<br />\nin the Yale School of Divinity and he<br />\nis president of the American Federhe bot<br />\nation of Teachers.<br />\nTo his audience of several hunbeliev<br />\ndred men and women, Dr. Davis adted.\"<br />\nmagi) vanced his idea of organization of<br />\nthe \"cooperative Democratic state\" in<br />\ndiffi<br />\near-ol; four major ways. There must be organization into \"consumers' cooperf Cali<br />\natives,\" he said, and into trade unions<br />\nhas<br />\nor \"producers' cooperatives.\"<br />\ng.<br /><br />\nbee<br />\nof th<br />\nts, an,<br />\nbefoil<br />\n9<br /><br />\n)afflin;<br />\nla hi<br />\nEski<br />\nnferre;<br />\n\"Ding<br />\n[edicint<br /><br />\na flex<br /><br />\nto d,<br />\nhimsel<br />\ncourse<br />\nnce<br />\nen stu<br />\n;y hay,<br /><br />\nIts as<br />\nfor<br />\ned out<br />\nhour0<br />\na at 1:<br />\ncen ti<br /><br />\nII<br /><br />\nCE<br /><br />\nOn Dr. Willoughby<br /><br />\nOn Thursday, December 3, at 4:30<br />\nP. M., members of the Friends of the<br />\n(Continued from Page 1, Col, 4)<br />\nThe distancement of Curtis High<br />\nDr. Isaiah Bowman, President of<br />\nLibrary will gather for a tea in the entitled From Geopolitik to Political<br />\nthe University, was heard last Wed- School, New York, eked out a vic- Gilman Room and will have the priv- Relativism.<br />\nnesday by the Washington Alumni tory in the annual cross - country<br />\nThe Scientific Method and the Fuilege of meeting a new member of the<br />\nAssociation, at their reception in his meet sponsored by the Hopkins chapture of Political Science by Marshall<br />\nter<br />\nof<br />\nacademic<br />\nthe<br />\nfamily,<br />\nNational<br />\nDr.<br />\nCollegiate<br />\nSociEmile<br />\nMalakis,<br />\nhonor, held in Washington. The meetE. Dcimock, Depatment of Political<br />\ning, after Dr. Bowman's address, was ety of Spiked Shot at Homewood last who comes to us as associate profesScience, University of Chicago, and<br />\nSaturday,<br />\nNovember<br />\n21,<br />\nwith<br />\na<br />\ntotal<br />\ndevoted to the election of officers for<br />\nsor of French Literature. Professor A Scientific Approach to the Study of<br />\nof forty team points. This is the<br />\nnext year.<br />\nMalakis will speak informally on Low by Walter Wheeler Cook, ProfesThis year Henry H. Glassie is Pres- second successive year the Curtis\"Chateaubriand\"<br />\nand his Travels in sor of Law, Northwestern University<br />\nident, and James Lee Bost, Secre- men have been victors.<br />\nAmerica<br />\nand<br />\nStein, of Chester High, ran the<br />\nan exhibit of books re- are included in the fourth part. This<br />\ntary. The new officers are Dr. Wm.<br />\nvery difficult two and one half mile lated to his topic drawn from his own chapter is entitled The Scientific<br />\nJackson Humphreys, President; Dr.<br />\nlibrary and from our collections will Method in PoUtics and Law.<br />\nLyman James Briggs, Vice - Presi- course in the remarkable time of<br />\nEssay By Sachs<br />\nbe displayed.<br />\n13<br />\nminutes<br />\nand<br />\n44<br />\nseconds.<br />\nTaking<br />\ndent, and Pierre Ghent, assistant<br />\nPark V, The Constitutional and Adthe lead at the start he led the pack<br />\nNotes On The Special Collections<br />\nSecretary and Treasurer. Mr. Bost<br />\nall through, and finished fully 320<br />\nThe Oliver Wendell Holmes Collec- ministrative Law, is subdivided into<br />\nwill continue as Secretary. Dr.<br />\ntion, presented four years ago by Dr. two topics. One is The Saga of klackyards ahead of the second man.<br />\nHumphreys is a well-known MeteorIn spite of the fact that Chester Lawrason Brown of Saranac Lake, stone v. Miller, which is a study in<br />\nological Physicist, and Dr. Briggs<br />\nran first, their having had only one New York, has been augmented by a Multiple State Taxation. The other is<br />\nholds the directorship of the Bureau<br />\nman entered eliminated them from further gift of rare books and pam- called Bankruptcy a3 a Subject of Adof Standards.<br />\nthe<br />\nteam scoring. Cook, of Southern phlets from Dr. Brown. Among these ministrative Jurisdiction. The first<br />\nDr. Bowman spoke a three-fold<br />\nHigh,<br />\nran second, coming in about 45 additional items as well as in the orig- was written by Leon Sachs Departplea for intelligence and efficiency<br />\nseconds<br />\nafter Steiner. Cook has been inal collection, there are numerous ment of Political Science at the Hop:n Government and Bureaus of Govschool harrier this year, works not listed in the Social Holmes kins, the second by Albert Langelutstellar<br />\nhigh<br />\narnment, for non-political education<br />\ncoming<br />\nin<br />\nfirst<br />\nfor Southern in a bibliography prepared by Mr. George tig, member of the Chicago Bar.<br />\nadministration, and for united action<br />\nThe last chapter is entitled Interlarge<br />\npercentage<br />\nof its meets this B. Ives. Arrangements have been made<br />\ntoward these ends, with men of abilyear. Potts, of City, and Hallam, of to have the entire collection indexed, nation&amp; Law. In this part Political<br />\n.ty and experience in the positions<br />\nso that a handlist will be available for Disputes in International Law is<br />\nIf trust and responsibility. He Curtis, came in thrd and fourth rehandled by Charles G. Fenwick, Pro.reated on the foundation and use of spectively, within the next few sec- readers. Holmes was so largely idenonds. A Curtis man ran fifth fol- tied with the cultural life of New Eng- fessor of Political Science, Bryn Mawr<br />\nommissions and bureaus in our counlowed by four of the Polymen.<br />\nland for so long a time that a gather- College, while the second part deals<br />\n.ry as a necessary step which has<br />\nIn calculating team points, due to ing of his occasional poems and ad- with Legal Aspects of the Lytton ReJeen abused. A discussion of the<br />\nelimination, Cook<br />\nwas dresses is not a bad beginning for a port, by C. Watter Young,<br />\niced for scientific study and work Steiner's<br />\nThe book is printed mainly for the<br />\n,n the difficult problems of rela- counted one, and all other men moved literary history of his times. The entire<br />\nup one point. Final figures gave collection numbers nearly 200 pieces, friends of Dr. Willoughby who would<br />\nions between people, and the symCurtis forty points; Poly, 45; City, including letters and other manu- like to possess a copy of this tribute<br />\n)olism of the University as man's<br />\n63;; Southern, 82; and St. Joseph's, scripts.<br />\nto him. The book is on sale for $3.00.<br />\ntspiration toward the highest ideals<br />\n95. Hallam, however, was penalized<br />\nind powers, was terminated with a<br />\nfive seconds, for an infringement,<br />\nbrief outline of the task which forms<br />\nthus dropping Curtis into a perilous<br />\n!arms the work of the men in direcposition, wherfrom she emerged with<br />\n'Lion of a University; to select good<br />\na mere 42-43 victory over Poly.<br />\n,nen, and let them alone within reaThe race, according to the Hopkins'<br />\nsonable limits, provide a faculty<br />\nalert against complacency, and a Coach Hambleton, was \"one of the<br />\nstudent body which will waste as best. A very fast race. The time was<br />\nlittle time as possible, and an alumni fine.\"<br /><br />\nHis Honor<br /><br />\nDr. Davis Proposes \"Cooperative Democratic State\"<br />\nIn Talk Here<br /><br />\nWendell Holmes Collection<br />\nAugmented Recently<br />\nBy Gift<br /><br />\nOne Point Margin<br /><br />\n;roup determine and vigorous in purThis was the fifth annual race<br />\nMore effective political parties also suit of high standards in scholarship sponsored by the Spiked Shoe Socishould be organized, he continued, and material support.<br />\nety, national honorary track associaand this would mean, in all probabiltion.<br />\nity, the rise of Farmer-Labor and<br />\nProgressive parties.<br />\nFor Your<br />\nUrges Spiritual Force<br />\nLiquors<br />\nFinally, Dr. Davis said, the nation<br />\nshould organize as \"religious believers<br />\nto put the spiritual dynamo behind<br />\n3113 GREENMOUNT AVE.<br />\nthe changes that must be made.\"<br />\nFor Delivery<br />\nPhone UN. 4883<br />\n\"It depends on us whether we get<br />\nit,\" he said. \"We've certainly had<br />\n2111M1011111111011111111111111111Hill1111111111111111111111111111111111111Ili11111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111V1<br />\nenough warnings to make us aware<br />\nOf the need for change. The World<br />\nWar and the investigations into the<br />\nmunitions industry alone should have<br />\nbeen ample.<br />\n\"I think that what we get will not<br />\nbe recognized by historians as capitalism. It may look very much like<br />\nthe Sweden of today.\"<br />\nDr. Davis termed the present distribution of wealth and power as<br />\n\"highly disgraceful.\" He said the<br />\nleaders of industry had no right to<br />\ncriticize WPA workers for \"spending<br />\nmost of their time leaning on their<br />\nShovels\" because, he continued, that<br />\nis precisely what industry did during<br />\nthe depression years.<br />\nConcentration of wealth into cor\"Mortimer,just look at Stuyvesant—the lone wolf of the Union Club.<br />\nporations, he went on, is growing to<br />\nlie hasn'tjoined the swing to TWENTY GRAND!\"<br />\nsuch an extent that if it should continue at the same rate for forty years,<br />\nall the wealth of the nation would<br />\nbe in the 200 wealthiest corporations.<br />\nRill<br /><br />\nPATRONIZE<br />\nTHE<br />\nJAY - JOHNNY<br />\nHOLIDAY TILT<br /><br />\nStructure<br />\nDr. Dorothy Wrinch, of the Mathematics Institute at Oxford University, and at present working on the<br />\nPhysico - chemical structure of the<br />\nchromosome, addressed the Biology<br />\nFaculty and Graduate Students last<br />\nFriday night.<br />\nDuring the last few years, Dr.<br />\nWrinch has become interested in the<br />\nstructure of the chromosomes, and<br />\nhas attempted to correlate the work<br />\nof the geneticists and gytologists<br />\nwith the present known knowledge<br />\nof organic molecules.<br />\nSpeaking on \"The Structure of the<br />\nChromosome,\" Dr. Wrinch put forth<br />\nthe theory that the chromosomes are<br />\nmade up of threads of protarnines interlaced with nucleic acid molecules.<br />\nAt the beginning of her talk she<br />\npleads for more interrelation between<br />\nthe fields of sicence, and asked more<br />\nchemists and physcists to Investigate the mysteries of biology.<br />\nDr. Wrinch is at present on a five<br />\nyear Rockefeller Grant to carry on<br />\nthis correlation, and she is spending<br />\npart of that time here in Amorist<br />\nJonferring with American Scientists.<br /><br />\nYES. BUT I<br />\nDON`i ENJOY<br />\nA PIPE THE<br />\nWAY YOU<br />\nSENIORS 00.<br /><br />\nr<br /><br />\nSeeHARRY<br /><br />\nYOU WILL—ONCE YOU TRY A<br />\nLOAD OF THE COLLEGE MAN'S<br />\nSMOKE*<br />\n—.HERE!<br /><br />\nBetter Dress<br />\nArrow unveils its newest dress shirt.<br />\nWe might call it dual control—Arrow's new<br />\nwell-behaved dress shirt which promises<br />\nnever to bulge out at the sides, dig into you<br />\nwhen you bend over, or ride up when you<br />\nsit down. Archer design—back curved in<br />\nand tails cupped to fit. It's the Lido —$3.<br />\nObserve the two ingenious suspender loops and trouser<br />\ntab to hold bosom in place—(adjustable tor swing music)!<br /><br />\nOther Arrow Dress Shirts $2.50 and more.<br />\nSanforized Shrunk.... A new shirt if one ever shrinks.<br /><br />\nCopr. 1936 The Axton.Fisher Tobacco Co., Inc.<br /><br />\nWE CERTIFY that we have inspected the Turkish and Domestic Tobaccos<br />\nblended in TWENTY GRAND cigarettes<br />\nand find them as fine in smoking quality as those used in cigarettes costing<br /><br />\nTraditional Football Clash<br />\nAt Homewood Saturday<br />\n(Continued from Page 1, Col. 6)<br />\nblocking halfbacks, with the latter in<br />\nthe prime position.<br />\nJohnny Royster centers the line<br />\nfrom his point of vantage and throws<br />\n210 pounds into the battle. Bud Mehling, sturdy sopnomore understudy,<br />\nWill see much action should Johnny<br />\nbe injured. Bill Day and Jimmy Hopkins take up their positions at the<br />\nguards, flanked by big Tommy Ellis<br />\nand \"Bruiser\" Kilbourne, tackles.<br />\nKilbourne is taking up the post vacant by Popow's migration into the<br />\nbrain trust. The line is further reinforced by Vickers and Baetjer at<br />\nthe wing outposts. Vickers, at the<br />\nright end will give the opposing<br />\nsafety men a great deal of concern<br />\nWhile Baetjer, the speedster of the<br />\narray, will make the tries after<br />\ntouchdown. The latter will be a constant threat to the Johnnie eleven by<br />\nvirtue of his educated toe.<br />\nAs has been the custom in recent<br />\nyears, a bonfire will be built on the<br />\nHopkins campus on the night previous to the encounter. The affair<br />\nWill serve to satisfy the enthusiasm<br />\nWhich will have reached its climax<br />\nat this point. The coaches and outstanding gridmen will speak in order<br />\nto rouse the pre-game excitement to<br />\nnew heights.<br /><br />\nPluc local<br />\ntax In<br />\ntax static,<br /><br />\n(Signed)<br /><br />\nas much as 50% more.<br />\nSeil,Putt&amp; Rusby 10C. Analytical Laboratories<br /><br />\n(In collaboration with tobacco expert)<br />\nALSO OBTAINABLE IN FLAT FIFTIES<br /><br />\nBe Correctly Dressed For The Cotillion.<br />\nGet Your Collar At<br />\nM<br /><br />\nc Pherson's<br /><br />\n11 East Baltimore Street<br /><br />\nTHE COTILLION BOARD<br />\nPresents For The First Time In Baltimore<br />\nTHE NEW DANCE SENSATION<br /><br />\nHUTSON-DeLANGE<br /><br />\n10 to 3<br /><br />\nmg<br /><br />\n...and one inside white paraffin<br />\nwrapper from a tin of Edgeworth<br />\nJr. We ntake this amazing offer<br />\nof a $1.00 English Type Folding<br />\nPouch in Rep Cloth with Rubberized Liner for only 10¢ and<br />\none wrapper just to persuade<br />\nyou to try Falgeworth Jr. Buy<br />\na tin of Edgeworth Jr. today.<br />\nTake out the inside wrapper.<br />\nSend the wrapper and your dime<br />\ntogether with this coupon (or<br />\nwrite your name, eitilege and<br />\naddress on the wrapper)—and<br />\nwe will semi your pouch born ed lately.<br />\nOnly one to a<br />\ncustomer.<br /><br />\nSPECIAL<br />\nOFFER<br /><br />\nTickets Are On Sale In Levering Hall<br />\nTHANKSGIVING NIGHT<br /><br />\n$1.00 POUCH IN YOUR<br />\nCOLLEGE COLORS<br /><br />\nALCAZAR BALLROOM<br />\nL<br /><br />\nTick<br /><br />\n2.50 Stag<br />\nr'<br />\nCouple<br /><br />\nMial NM NS INS IMO<br />\nLamm &amp; Bro. Co., Richmond. a.<br />\nEnclosed find 100 and one inpiide whito<br />\nparaffin wrapper Iron, a tin of f:agrworth<br />\nJr., for which send me $1.00 value silk<br />\ntobacco pouch in my college colors.<br />\nName—<br />\nAddress<br />\nCity<br /><br />\nState<br /><br />\nCOLLEGE'<br />\nOffer goodfor only 30 days<br />\nOw ova so um ima amp Imo um am<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 24, 1936<br /><br />\n4<br /><br />\nPhantoms, AllStars, Cardiacs<br />\nAre Victorious<br /><br />\nPast Scores<br />\n100.1 llupgAtis<br />\n\".5'-,.., ..4,4.1A13<br /><br />\n......<br /><br />\nPower<br /><br />\nIn<br /><br />\nCrushing Victory Over<br />\nGas-Civils<br /><br />\n)01111 8<br /><br />\n..A..<br /><br />\njULM S<br /><br />\n40<br /><br />\naL. jWill<br /><br />\n...,.. Jul,. li<br /><br />\nII)<br /><br />\nI .a Upgsla<br /><br />\nId<br /><br />\nI Aut./v.411M<br /><br />\n.<br />\n.4...74,<br />\n0<br /><br />\nL.<br /><br />\nJUL. 3 ..---<br /><br />\nA 0,...Y LI Upal.aliti<br /><br />\n\" ^ 1074/<br />\n109h<br />\nlo93<br /><br />\nSs.<br /><br />\n15/.4.4.4115<br /><br />\nst. Juan's<br /><br />\n10<br /><br />\nJuan's -------<br /><br />\n0<br />\nu Blue Booters Shut Out Moun...—.....-<br /><br />\n10<br /><br />\nU<br /><br />\n111.11)K.L.1<br /><br />\n13<br /><br />\n^1693 st Joun's.....-- 18<br />\n6<br />\nx1594 St. Jonn's<br />\n22<br />\n1593 St. joint's<br />\n8lb<br />\n'1595 51. JU11(1.<br />\n18913 No game.<br /><br />\nIlupKit11<br /><br />\nHopx.iiiii<br />\nst. jonn's<br />\n:1L. Joun's<br />\nHopkins<br />\nHopkins<br />\ni iopkins<br /><br />\nliopmns<br />\nItopicins<br /><br />\n6<br /><br />\nd .......—<br /><br />\n13<br /><br />\n.7L. JUrlIl 3 .-. ZU<br />\nW. 301101<br />\nL.<br /><br />\nxxoy4 Hopscins<br />\nShow<br /><br />\n...It.<br /><br />\nU<br /><br />\nloess Si. Joun s<br /><br />\nX109.1<br /><br />\nCardiacs<br /><br />\ntu<br /><br />\n...........<br /><br />\n4<br />\nO<br />\n0<br /><br />\nCardiaes Win<br /><br />\ntriump over the Engineers. Dukehart and Sause excelled in offensive<br />\nplay, both running and passing with<br />\nthe \"greatest of ease\" behind a team<br />\nthat contributed some superlative<br /><br />\n4<br />\n0<br /><br />\n6<br /><br />\ntu<br />\n4<br />\nO<br /><br />\nits previously compiled record and<br /><br />\nThe Cardiacs' touch football prowess was clearly demonstrated in their<br /><br />\ntainers On Saturday,<br /><br />\no<br /><br />\n0<br />\n6 St. John's<br />\n1891 Hopkins<br />\n0<br />\n6 Hopkins<br />\n1898 St. .1c:inn's ,<br />\n6<br />\n1899 Hopkins ____....... 11 st. jonn's<br />\nAHEAD! 1900 Hopkins<br />\n5<br />\nPLAY-OFFS<br />\n5 st. John's<br />\n0<br />\nJohn's<br />\nSt.<br />\nHopkins<br />\n6<br />\nz19U1<br />\n1902-03 No game.<br />\n5<br />\n6 11 opkins<br />\n1904 St. John's<br />\n5<br />\nBaer Expects Finals To Be 1905 St. John's ...._ . 11 Hopkins,<br />\n___<br />\n0<br />\n2<br />\n_______<br />\nHopkini<br />\n1906 St. John's<br />\n0<br />\nU St. John's<br />\n1907 Hopkins<br />\nPlayed After Thanks4<br />\n11 Hopkins<br />\n1908 St. John's<br />\n0<br />\n18 St. John's<br />\nHopkins<br />\n1909<br />\ngiving<br />\n0<br />\n14 st. John's<br />\n1910 Hopkins<br />\no<br />\n16 st. John's<br />\n1911 Hopkins<br />\n2<br />\nSt. John's --------27 Hopkins<br />\n1912<br />\nClimaxing a week of really spir- 1913 Hopkins<br />\n3<br />\n14 St. John's<br />\n13<br />\n1914 St. John's ..... 34 Hopkins<br />\nited battling, the Intra-Mural foot- 1915 Hopkins- 20 st. John's<br />\n6<br />\n3<br />\n- 6 Hopkins<br />\nSt. John's<br />\nball league drew to a close with the 1916<br />\nHopkins<br />\n0<br />\n6<br />\n....<br />\nJohn's<br />\n1917 St.<br />\n7<br />\n14 St. John's<br />\nHopkins<br />\n1918<br />\nCardiacs, Phantoms, and New Jersey 1919 Hopkins<br />\n- 13<br />\n13 St. John's .<br />\n0<br />\n41 St. John's<br />\nHopkins<br />\nAll-F'tars clinching their title two 1920<br />\n8<br />\n___<br />\n..<br />\n1921 Hopkins .. ..... 17 St. John's<br />\n7<br />\n...._ ._.. 16 St. John's<br />\nHopkins<br />\n1922<br />\nweeks ago by trouncing the Tigers. 1923 Hopkins ...<br />\n0<br />\n3 St. ohn's<br />\n0<br />\n26 St. John's<br />\nHopkins<br />\n__........<br />\n1924<br />\nBoth the Cardiacs and Phantoms 1925 Hopkins<br />\n3<br />\n7 St. John's<br />\no<br />\n33 St. John's<br />\nHopkins .<br />\nwaited until last week to establish 1926<br />\no<br />\n1927 Hopkins .„_ 32 St. ,John's<br />\n46<br />\n0<br />\nHopkins<br />\n1928 St. John's<br />\nthemselves as victors; the former 1929<br />\n0<br />\n33 Hopkins<br />\nSt. John's<br />\n6<br />\nSt. John's ___ _ 26 Hopkins<br />\ncrushing last year's champ Senior 1910<br />\n19'31 Honkins .._ ... 20 St. ,Tohn's------------14<br />\n13 St. Joh' ----- --- -----0<br />\nHopkins ....<br />\nGas-Civils under a barrage of four 1912<br />\n1913 St. John's<br />\n13 nonkins--------------------0<br />\n1014 St. 'John's<br />\n13 Hopkins7<br />\ntouchdowns; the latter resting on 1935<br />\n0<br />\n6 Hopkins<br />\nSt. John's<br /><br />\nonly tying the Invaders, 6-6.<br /><br />\nBlue Ridge Succumbs To Jays; So They Think<br />\nArmy Booters Earn 4-1 Win<br /><br />\ns* Second game.<br />\n** Hopkins represented by class team. •<br />\nx Hopkins disbanded before scheduled game.<br />\nxx Stopped by referee, tie.<br />\nz St. John's walked off field, forfeit., in<br />\n1902.<br />\nSeries standing----St. John's win 24, johns<br />\nHopkins won 22. tied 7.<br />\nPoints standing----Johns Hopkins, 477; St.<br />\nJohn's, 461.<br /><br />\nThe St. Johns team is looking forward to the coming battle with antiThe fight in division A narrowed<br />\ncipation of an easy victory. Below down to two fraternities when the<br />\nCadets Conquer Jays At West are some of their opinions.<br />\nPhi Lambda Phi team eliminated<br />\nthe Phi Psi's by a 4-2 score.<br />\nPoint In Heavy<br />\nDeLisio: Look for a tough and vicious game<br />\nReferee Kaufman<br />\nwith no quarter given by Hopkins. St. John's<br />\nWind<br />\nAfter the game, Millard Kaufman,<br />\nwill come out on top.<br />\nHammann: We should take them if we play<br />\nthe referee said, \"Splendid team<br />\nThe Blue Jay Booters suffered a ball.<br />\nRoache: I would like to see us break that a<br />\nheady quarter-backing wereworl,nd evisevere set-back at the hands of a record of 46-0.<br />\ndent<br />\non both sides, and the close score 1'<br />\nwin<br />\n31-0.<br />\nAliba•<br />\nLambros:<br />\nWe're<br />\ngoing<br />\nto<br />\nmore competent Cadet aggregation 1/abbaindicates how evenly balanced the<br />\nSands: 20-6; no use paying, it's so sure.<br />\nat West Point last Wednesday by the<br />\nBurns; Expect a very close game.<br />\nteams were. This was by far the best .<br />\nscore of 4-1.<br />\nLathrop: We should win.<br />\nWeisheit: If conditions are right, we have a game of the year.\" He also said,\"Both<br />\nCadets Conquer Storm<br />\ngood chance of beating them as had as they teams<br />\nwell<br />\nwere<br />\nexceptionally<br />\nDespite the heavy wind that pre- have eVer been beaten.<br />\nChristhilf: I'm sure we will beat them, but matched and the resultant low score<br />\nvailed, the West Pointers battled, we will have to be on the alert for surprises, was no indication of offensive weaksinking three of their four goals, in 20-0.<br />\nD. Snibbe: Think it will be a good mine, as ness on the part of either aggretwo<br />\ntouchstorm.<br />\nat<br />\nleast<br />\nthe<br />\nusual,<br />\nbut<br />\nwe<br />\nwill<br />\nwin<br />\nby<br />\nteeth<br />\nof<br />\nthe very<br />\ndowns.<br />\ngation.\"<br />\nEarly in the opening period, Major<br />\nMacMillan: We are out for a new record. •<br />\nTau Alpha Omega caused one of<br />\nof<br />\nedge<br />\nin<br />\nevery<br />\nphase<br />\nTodd:<br />\nWe<br />\nhave<br />\nthe<br />\nCadets,<br />\nplaying inside right for the<br />\nthe dime.<br />\nthe most startling upsets by beating<br />\nStallings: We'll skunk 'em!<br />\nsank a direct pass from center Odom.<br />\nBuck: We can't be stopped!<br />\nAlpha Epsilon Phi, Playing as exThere was no further scoring until<br />\n11. Snibbe: I can see no chance for those<br />\npected the Delta Phis gained a 6-0<br />\nthe third quarter when Odom sue- llookinic boys.<br />\nTownshend: We'll clean up by three touch- victory over Tau Alpha Phi to comcesfully punting the ball into scoring downs.<br />\nplete the day's games.<br />\nLevely: We niorht to win.<br />\nposition followed through with a drivDivision Champs<br />\ning kick which found a resting place<br />\nCampus<br />\nDivision B Championship<br />\nThe<br />\nin the Hopkins' net.<br />\nThis afternoon the campus will be now rests on the outcome of the batThe Hopkins team now staged a<br />\ncrowned<br />\nwith flying footballs as All- tle between Delta Upsilon and Omiget<br />\nits<br />\nonly<br />\npoint.<br />\ncounter attack to<br />\nBrayshaw playing center for the Fraternity Athletic Day is inaugu- cron Kappa Omicron, while the Pi<br />\nBlue team, was on the delivery end rated. Every fraternity on the campus Lambs and Sigma Phi Upsilons are<br />\ndeadlocked for Division A honors<br />\nof the punt that yielded the Jays their will participate.<br /><br />\nThe Blue Jay Booters beat the<br />\nBlue Ridge soccer team at Homewood Saturday by a score of 4-0.<br />\nThe Blue Ridge team playing a hard<br />\ndefense game finally yielded to the<br />\nHopkins' assault when Linthicum<br />\nplaying center forward for the Jays<br />\ndented the net with a fast boot from<br />\nclose quarters.<br />\nHopkins Scores Repeatedly<br />\nThe second half opened with the<br />\nBlue Jays more determined than ever<br />\nto insure a quick victory. Three goals<br />\nwere chalked up in short order by<br />\nPrice, Hartke, and Brayshaw respectively as the Hopkins team continued their driving attack against<br />\nthe less competent Mountaineers.<br />\nThe Blue Ridge team was only<br />\nable to make four attempts at scoring throughout the entire game. The<br />\nHopkins' defense proved invincible<br />\nwhile the offense time and again<br />\nthwarted the Blue Ridge Booters with<br />\ntheir clever dribbling and passing.<br />\nlone tally.<br />\nArmy Scores Again<br />\nBernheim Injured<br />\nAs the game neared an end the<br />\nBill Gough, veteran outside right<br />\nperformer, was switched to full back Cadets scored two more goals to<br />\nposition to substitute for Pete Bern- make their victory certain.<br />\nhelm, captain and ace back man for<br />\nthe Jays who was out on an injury<br />\nCharles Lander, Prop.<br />\nsuffered in the Army tilt last WedHair Cutting 40c<br />\nBOULEVARD BARBER SHOP<br />\nnesday.<br /><br />\nHandball<br /><br />\nFencing<br />\nThe fencing ladder tournament<br />\nfor varsity positions begins im-<br /><br />\nThe playoffs of the handball ladder tournament have been postponed one week so as to begin on<br />\nSaturday, December 5, instead of<br />\nthis coming Saturday, as originally planned, because of the intertournament<br />\nthe<br />\nwith<br />\nference<br />\ncaused by the coming of the<br />\nThanksgiving vacation this week.<br /><br />\nmediately after the Thanksgiving<br />\nThe Phantom-Invader game was .vacation. Opportunities are still<br />\nhotly contested from the beginning. open for those wishing to participate. Practice is held at the barn<br />\nSwartzman crossed the goal - line<br />\nregularly<br />\non Wednesday at 8 P.M.<br />\nearly in the game for the Phantoms'<br />\nand on Saturday at 2 P.M.<br />\nonly score, while Milberg scored for<br />\nthe Invaders, with Alperstein supply,<br />\ning the needed interference.<br />\nPlayoffs After Holiday<br />\nLNEW YORK LOAN OFFICE<br />\nPlayoffs for the intramural chamUnredeemed microscopes, cameras, binoculars, musical<br />\npionship will take place following<br />\ninstruments, slide rules.<br />\naccordHolidays<br />\nthe Thanksgiving<br />\nReuben Baer, Director of Intramural<br />\n118 North Liberty<br />\nActivities.<br />\nblocking.<br /><br />\nStreet<br /><br />\nPlaza 3495<br /><br />\nPhi Psi Loses To Pi<br />\nLam As TAO Wins<br /><br />\nOn 33rd Street<br />\nBetween St. Paul And Calvert Streets<br />\nWeek Days<br />\nSaturday<br />\n8 A.M. To 7.30 P:M: 8 A.M. To 9 P.M.<br /><br />\nBirely<br />\n'<br />\ns Pharmacy<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptions—School<br />\nSandwiches<br /><br />\nglass of National<br />\nBeer,sipped slowly, will tell you a<br />\nlot . . . drink it<br />\nfor its exquisite flavor<br />\n.. note the sturdy body<br />\nof definite character....<br /><br />\nA<br /><br />\nAli<br />\nU<br /><br />\nKem<br />\nPi<br /><br />\nF0<br />\nP.,<br />\n8.<br /><br />\nto the<br />\ntional<br />\nand<br />\nehapt,<br />\nnight<br />\n4ames<br />\nthe or,<br />\nand<br />\ncilapt •<br /><br />\nNEWS-<br /><br />\nBEER<br />\nThe National Brewing Co.<br />\nBALTIMORE, MD.<br /><br />\n•<br /><br />\n•<br /><br />\n•<br /><br />\naging<br />\nDavid<br />\nNEWSeditor<br />\nRram,<br />\nHuila•<br /><br />\nrf NATIONAL<br /><br />\nPrinters of<br />\nPHILOLOGICAL and<br />\nSCIENTIFIC PUBLICATIONS<br />\n12-20 Hopkins Place Baltimore<br /><br />\nPi<br />\nF1<br /><br />\n'rho<br />\nKemp<br /><br />\nUnexcelled Fountain Service<br /><br />\nCO.<br /><br />\nVOL.<br /><br />\nCrowned<br /><br />\nSupplies<br /><br />\nJ. H. FURST<br /><br />\nNE<br /><br />\nPi I<br />\noutfit:<br />\nare no<br />\nbut to<br />\nthe is<br />\nthese,\"<br />\nto fo<br />\naaid in<br />\nto the<br />\nor jou<br />\nEpsiio<br />\nism b3<br />\neontacl<br />\nby Pas<br />\nstrictel<br /><br />\niatic e<br /><br />\nRegt<br />\nout tho<br />\nconeer<br />\nare hr.(<br />\nplans r<br />\nitiea of<br /><br />\nAmericaS<br /><br />\nSent<br />\nincludc<br />\ntrian,<br />\nboloo;<br /><br />\nSOCiate<br /><br />\nHenan<br />\naiatant<br />\nbaloo<br />\nCotuici<br />\nthe N<br />\nkina, f<br />\nNEWS-<br /><br />\nAll-StarEleven<br />\npasses and punts...<br />\ntouchdowns . . . performance! That's<br />\nhow America picks 'em. By wire and<br />\nair-mail, fans rush to the football experts the tip...\"Here's another sure-fire<br />\nAll-American.\"<br /><br />\n60 yard dashes...<br /><br />\nEve]<br />\nDelta<br />\nasseml<br />\nJourna<br />\nLast y<br />\nident,<br />\nArthui<br />\ndieting<br />\nWas in<br />\nat tha<br /><br />\nAnd when you pick the all-star<br />\ncigarette eleven, it's performance again<br />\n—it's what a cigarette does that counts<br /><br />\nElig<br />\ntion at<br />\nager o<br />\nCation<br />\nboard<br />\ntion, a<br />\nla the<br /><br />\nT-H-E-Y S-A-T-I-S-F-Y<br />\nEleven letters that spell all the good<br />\nthings a cigarette can give...mildness<br />\n... a pleasing taste and aroma ... a<br />\nblend of mild ripe home-grown and<br />\nTurkish tobaccos rolled in pure cigarette paper<br /><br />\nA-1]<br />\nthe pc<br />\naoring<br />\nthe a<br />\neach<br />\nhigh s<br />\ndent n<br />\nthese<br />\nnear 11<br /><br />\n—the essentials of a<br />\ngood cigarette<br /><br />\nRiek,<br />\nSp<br />\neli<br /><br />\nAn<br />\nWill hi<br />\ning<br /><br />\nClub<br />\nat 8 y<br />\nDr.<br />\nClew<br />\nductoi<br />\nWith d<br />\nzniora<br /><br />\nAll<br /><br />\nto att<br />\nCopyright 1936. LiGGETT &amp; MyERS TOBACCO Co.<br /><br />"}], "field_media_file": [{"target_id": 39056, "display": null, "description": null, "target_type": "file", "target_uuid": "9dea44cf-f73f-40ef-ac09-f7c3fe2186d0", "url": "http://digital.library.jhu.edu/system/files/2022-03/12732-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12732, "target_type": "node", "target_uuid": "25d07025-bce8-4654-affe-b8263f700e2b", "url": "/node/12732"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a0884c1d-e8ab-4f39-8110-73ba0d32b745"}]}