{"mid": [{"value": 40327}], "uuid": [{"value": "5d183c67-eac6-4bf7-b863-4108613b1cf8"}], "vid": [{"value": 40327}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T20:03:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14356-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T20:03:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T20:03:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "riLioney<br />\ner<br />\npart two<br />\nPornography<br />\nand Society<br />\n<br />\nI<br />\n<br />\nPOCKET<br />\nBOOKS<br />\nJennifer bi<br />\n<br />\nLast week, in Part One of the News-Letter<br />\ninterview, staff member Rhona Lyons<br />\ndiscussed<br />\nwith Dr. Money the problems<br />\nof gender identity and differentiation. The<br />\nWorld-famous researcher, never at a loss for<br />\nwords, drew on the wealth of his first-hand<br />\nexperience in the frontiers of s:Aology. This<br />\nweek, the interview concludes with Dr.<br />\nMoney giving his observations on<br />\npermissiveness,\" pornography, sex offenders,<br />\nand ethics. The conversation begins with Dr.<br />\nMoney talking about change.<br />\n<br />\nOK to enter here? What does that indicate? Read on...<br />\nNature<br />\nlien I think about (big feasting and celebration when the families got masturbate and to have visual imagery of it.<br />\nmakes sure about that because she wants the race to<br />\nChange 1 usually think about such an easy change, when together. In that society, which was really dependent on<br />\nall is said and done,as the change to the metric system.<br />\nreproduce. And if you don't think of it yourself then it<br />\nthe family as a farm or fishing unit, if you didn't produce<br />\nWhich has taken ten years?<br />\na baby between you, then your family didn't want you to comes to you in a dream. Well, all of this adds up in the<br />\nYes, and you get a great deal of resistance to it. But the get married. Well we don't get people living together long run to say that the big issue, as many people know,<br />\n‘vaY it's done is that it takes a long period of preparation today while they're at college in order to see whether in vending a magazine like Hustler is the issue of the,<br />\nin Which you get the practical things in order, the they can produce a family or not, but it's the other way<br />\nimplications and freedom of expression. For once you<br />\nmachines that you weigh and measure with, and the costs around. They're using that system because they don't<br />\nallow privilege to certain segments of the population to<br />\nof the change over. You educate the public in how to have to produce a family until they're ready to begin their censor and discipline what others will do, 'then you've<br />\nmanage the new system, which means partly you train parenthood. People nowadays are using the possibility of layed the groundwork that can allow that principle to<br />\nthem at school, partly you train the older ones on separating the beginning of your recreational sex life, and creep until you have a dictatorial society. We've had<br />\nplenty of evidence in the twentieth icentury that you.<br />\ntelevisign or through the public media, and then one night the beginning of your procreational sex life. Now that<br />\nat midnight<br />\nneed great care to protect the growth of freedom. It can<br />\nit's D-Day and anybody who doesn't really isn't permissiveness at all, it's just simply a change<br />\nconform after that is in some way or another punished. of custom...another thing you can say about be exterminated iso easily.<br />\nThey pay some sort of a penalty. Well that's the best way permissiveness is that for probably as far back as history Recently in Manhattan there has been a flurry of<br />\ncontroversy about pornography. ! Do you feel that<br />\n10 bring about change in society. It's so rational that we has been recorded, when people get I older and they see<br />\npornography, in the form of peep shows, Magazines, and<br />\nardly ever do it.<br />\ntheir own end coming, they become doomsayers and<br />\nrioreYOU?consider Western society permissive, and getting they see the young generation as always going to hell, prostitution, is a victimless crime, or does it hurt the<br />\n,so<br />\n(quickly. But that's been going on since time immemorial. community as the critics content?<br />\nPermissive for what?...If you're talking about sex, I think How do you feel about the case of Larry Flint, publisher Well, aren't you just playing with words, the same as they<br />\nwhat's happening is that we are, with great difficulty, of Hustler magazine?Is his publication totally without are? The real issue is not whether it's a crime or whether<br />\nthere are victims or no victims, the real lissue is are you<br />\nadjusting ourselves to the Birth Control Age, which didn't social redeeming value? Should he be in jail?<br />\ngoing to break the taboo or are you not?<br />\nget started until 1930. For it was in the late 1920's that I think the first part of that answer is that there is a<br />\nthe .<br />\nyou feel it should be broken? Should it exist at all?<br />\nDo<br />\nlatex process was invented and that was the first time pretty substantial body of evidence that sex alone doesn't<br />\nThe<br />\ntaboo on sex? Well, when you carry it to its extreme<br />\nthat You<br />\ngot really effective birth control, the condom, do you any harm. However,it is like just about everything<br />\nhave the Inquisition which (we had three and four<br />\nyou<br />\nthat<br />\npeople would use because it didn't interfere with else in human life that is the use that it is put to differs<br />\ncenturies ago, under which circumstance you torture<br />\ntheir sexual gratification. It could be predictable, that you riccording to the principles you have. So, you can show<br />\npeople until they make a false confession that they had a<br />\nw ouldn't get pregnant if you used it, but perhaps even pictures of a crucifixion in order to warn people not to do<br />\ndream of cohabiting with the devil and then you burn<br />\ninore important is that it was cheap enough to be mass it, but you could also use it as lessons in how to do it. I<br />\nat the stake. So, when you overdo the strength of<br />\nthem<br />\nProduced and mass distributed. Everybody knows that use that example because in churches we teach children<br />\nthe taboo it carries you to extremes which are, by I think<br />\nafter 1930, we got the Pill and then the I.U.D. was quite vivid information about how to commit a<br />\nrie<br />\neverybody's 'agreement today, beyond all the bounds of<br />\ndiscovered and brough back into use. Everybody knows crucifixion, but we have a set of moral standards that go<br />\nat We still haven't reached the end of the road on with- it, as well as religious ones, so they don't come<br />\ncommon sense. Now, the basis of the taboo is that it<br />\nrestricts you in something that you do. Nobody's ever<br />\nontraceptive methods, especially those which can be home crucifying their dolls in crucifixion games. By<br />\nUsed<br />\ncounted up all the ethnic societies on earth to find out<br />\nby the mule. Research is .stil under way for that. .contrast on television we have a general cultural<br />\nwhether every single one of them does have a taboo on<br />\ncertainly<br />\nwar<br />\nand<br />\nand<br />\nglorifies<br />\nkilling<br />\nundercurrent<br />\nthat<br />\nMY Point is that from 1930-1977 is not quite half a<br />\nsomething, however it is clear that the taboo of one<br />\nutury yet, and that's not very much time for a change doesn't require to be censored off the television screen or<br />\nsociety is different from that of another. Some people<br />\nth at'S so momentous that it's equivalent to the discovery the magazine pages. So we get the message across to<br />\n°f the usage of fire, because it really hits every person's<br />\nhave a taboo on whom you are allowed to use your vocal<br />\nchildren growing up that it's a good thing to play war<br />\nlife.<br />\nwith. There's a taboo on food, there's a taboo on<br />\nchords<br />\nsoldiers,<br />\nbe<br />\nand<br />\nAnd we human beings have a record of being pretty games and killer games and get ready to<br />\nsl<br />\ncorpses and how you get rid of dead people. There's a<br />\nat being able to make major cultural changes like maybe street killers too, and of course we don't like that,<br />\ntn—<br />\ngi3<br />\nslight taboo on elimination, and many socities on earth<br />\nespecially when they_ involve what we've defined for but it's a by-product price we pay. For sex the message is<br />\noutse<br />\nhave been heir to this great taboo,on sex- What we're<br />\n,<br />\nt<br />\nlves as \"moral issues\". What is actually happening is that it's all right as long as you keep it secret-1 could say<br />\nwith right now in this age of birth control is a<br />\nstruggling<br />\n1141 the older generation has extraordinary difficulty in<br />\ndirty, underground, except then you say that it's sacred<br />\ngreater latitude with regard to what society allows<br />\ntalki to the younger one about it, because one of the and you just keep it for the one you love. We're<br />\nindividuals to define for themselves, as their own<br />\nparts of our sexual taboo is that you're not allowed to '<br />\nhopelessly at odds with ourselves about that. As far as the<br />\nstandards. That's a really far more -important<br />\nebxchange informatiori openly across the generations. public information and open discussion or viewing of sex<br />\nis<br />\narents are very touchy about discussing anything of their is concerned then society's official rule it's a taboo. socio-cultural event in modern history than most people<br />\nLn<br />\now<br />\ncatch on to, because it really is possible to get involved in<br />\nsex life even with their adult children. It's not a And you know a taboo that's good is so good that You<br />\nsexually stimulating activities and to iparticipate with<br />\n4und red percent avoided but it's pretty much so. don't even recognize it in your midst. It's like the air you<br />\nyour own partner without constantly having to prepare<br />\nnerefore we leave the younger generation of teenagers<br />\nbreathe. You just breathe it without asking any<br />\nand .<br />\nof time for the children that will result. So, I guess<br />\nahead<br />\ntaboo<br />\nis<br />\nof<br />\nsuch<br />\nwith<br />\nsex.<br />\nThe<br />\nquestions. That's how it is<br />\nin young adults to work out their own system of how<br />\nback to your question by saying that anything<br />\nget<br />\nI<br />\ncan<br />\nbecomes<br />\nit<br />\nlike<br />\na<br />\nthat<br />\nnative<br />\neffective<br />\nso<br />\nincorporate contraception into the relationship long standing and<br />\nto excess, either negative excess or positive<br />\ncarried<br />\nbe<br />\ncan<br />\nmany<br />\npeople<br />\nmany,<br />\nwhen<br />\ninto<br />\ningrained<br />\nso<br />\nlanguage,<br />\nen the sexes, to, what I've said in one piece I wrote,<br />\nthat's<br />\ntrue for any aspeetof human behavior,<br />\nand<br />\nexcess,<br />\nop a new set of moral principles, ethics of human they're growing up that they never think to question it.<br />\nso what we need to do is to work out a set of<br />\nrelationships in the Birth Control Age. What you do in They get involved in the bureaucracy or the committee or<br />\ncommon-sensical rules, and that's what society in it's<br />\n;fact see if you look around college students, for example, whatever it is that's going to ban magazines. Well, to<br />\nextremely stumbling way is trying; to do now. But, as is<br />\n:s that without having given a name to it, they are turning backtrack the evidence is that it's not harmful. It does<br />\nso commonly the case when change takes place, you get<br />\n1° the old custom that survived in Europe in the far north not induce any particular type of sexual behavior, good<br />\nof Scandinavia,<br />\nbe<br />\nused<br />\nas<br />\nan<br />\nmay<br />\nIt<br />\ngreat pendulum swings from one extreme to the other.<br />\nit.<br />\nor bad, in people who look at<br />\nwhich probably used to cover all of<br />\ngoing<br />\nto<br />\nget<br />\nare<br />\nit's very difficult for the human race just to hit the<br />\nwho<br />\nand<br />\npeople<br />\narousal<br />\nby<br />\n(Aire'Pe<br />\nbefore the Mediterranean customs crept in adjunct to sexual<br />\nand<br />\nexample<br />\nis<br />\nthat<br />\nof the road and find the best answer to the current<br />\ncommon<br />\nmiddle<br />\nThe<br />\nanyway.<br />\naroused<br />\nsexually<br />\ntook over. This is the old custom of betrothal, of<br />\nequality between the sexes, proving that you could get teenage boys will use some pictures out of sexy magazines<br />\nsituation. So, right now, as of the last couple of weeks,<br />\ndon't have the<br />\nthe pendulum has swung all the way over to the negative,<br />\nPrevanant before you got legally married. This old system as masturbation pictures, but.if they<br />\nused the announcement of the intention to get pregnant magazines they have Rile pictures in their imaginations and Times Square is going to be cleaned up, come hell or<br />\nas the betrothal announcement, as the occasion for the anyway !because it is a part of human nature to ihigh water. Well, I'll tell you that the answer to that can<br />\n4<br />\n<br />\ndevW<br />\n<br />\ncontinued on page 2<br />\n<br />\n\fpage 2<br />\n<br />\nnews-letter<br />\n<br />\nMONEY FROM OW<br />\nbe found if you look to the history of prohibition. And<br />\nall that will happen is thati when you take it out of the<br />\nopen market place, it will be taken over by the gangsters.<br />\nIt will not leave our society. It will just have a different<br />\nset of owners, and I don't like to see any part of our<br />\ncommercial life . to become the prerogative of the<br />\nunderworld because they don't pay taxes on it and then•<br />\nwe all have to suffer by having, a few people get<br />\nimmensely rich illegaly, and that gives them moreJeverage<br />\non political power because, they can buy off politicians,<br />\nwhich everybody knows they have done.. And,in the end,<br />\nsociety pays much too heavy a price for it.<br />\nWe did that<br />\nwith Prohibition.,We're doing it with marijuana, and next<br />\nwe're going to do it probably with sex. It's been that way<br />\nwith prostitution for practically as far back as you can<br />\nremember.<br />\n-Whati then do you think might be some of the<br />\nprecipitating causes ofsexual crimes?<br />\nExcessive and rigid' application of the taboos to<br />\nchildren and • excessive punishment of them in childhood<br />\nwhen they are developing their sexual status. As far as one<br />\nh s the evidence, it is part of Nature's scheme of things<br />\nfor all primates to rehearse sexuality in sexual play, just<br />\nthe same way as they rehearse speech In babbling before<br />\nthey get ready to talk. If you put total veto on infantile.<br />\nand childhood expressions, of sexuality then you get<br />\nanomalies of sexual expression which take the place of<br />\nthe norm. For example, you can see in the clinic without<br />\ntoo much trouble, that a horrendous experience with sex<br />\nin infancy has long-term aftereffects. One case that<br />\nillustrates this is the case of where a baby is threatened,<br />\nithappens not too infrequently, that his penis will be cut<br />\noff with the scissors or the, kitchen carving knife if he<br />\nplays with it. Well, I've known examples where the<br />\naftermath of that was that the kid couldn't ever see a<br />\nknife without having an impulse to cut somebody with it<br />\nsexually. Couldn't get into a love relationship because he<br />\nwas scared he would cut his girlfriend in a sadistic way.<br />\nWell, every person who is a sex offender who gets picked<br />\nup and put in jail for it, has a very poignant history if you<br />\n<br />\napril 29, 19<br />\n<br />\nget them to talk about what's happened to them in the<br />\ncourse of their development from childhood onwards that<br />\ndistorted their sexuality to such an extraordinary degree.<br />\nSo, society, without being aware of what it's doing, is'<br />\nactually producing all of these monstrosities by the very<br />\nact of an attempt at purity.<br />\nWhat do you suggest as treatmentfor sex offenders?<br />\nWell there probably isn't a single answer to your question.<br />\nI can give you two opposite sides of the coin for an<br />\nanswer. Let's take, to illustrate one case, the example of<br />\nthe exhibitionist. If you are riding in a subway late at<br />\nnight and the exhibitionist dares to flash himself to get<br />\nfrom you an expression of surprise, because that's .the<br />\nessential key to the exhibitionist, to get shock or surprise<br />\nfrom the partner, the strangei- who is not expecting to see<br />\nhis penis, and that gets him all geared up and he then can<br />\ngo home with an erection and perform sexually which<br />\nwould not otherwise be possible usually. Well, if you look<br />\nat.that person and don't be surprised, and don't make a<br />\nbig noise and scream, then possibly tell him \"It's too small<br />\n,for me\", then it's such an absolute put-down that he can't<br />\ncontinue anymore, he's finished. So there are ways of<br />\nbeing able to teach the rest of society how to handle the<br />\nperson who's already been sexually crippled by his<br />\nupbringing. If you do have society taught that then it<br />\nrepresents a change towards; sex in our society, so that it<br />\nis possible that within three generations we could bring up<br />\nour children differently that we don't produce anymore<br />\nof these anomalies. Now at the other side of the coin if<br />\nyou're taking the situation as it is today and you've got<br />\nthe person who is a rape murderer, let's say, then<br />\nnobody's going to tolerate him at large. Then you can get<br />\nsome effective relief for that person if you give him a<br />\n- reatment with anti-androgen, Which puts his own male<br />\nsex hormone at rest for as long as you're giving it, also<br />\nprobably has a direct sexual tranquilizing effect of brain<br />\ncells themselves. Then if' you combine that with a<br />\nprogram of counseling you can expect to get that person,<br />\nwell I've used the word, psychically realigned,,in such a<br />\nway that he may not feel safe in this day and age with<br />\nputting him back in society at large, but you certainly<br />\ncould have him on a supervised way of living that is not<br />\nquite so monstrous as complete jail. If you have<br />\n<br />\nsomeone who's simply an exhibitionist who really doesn<br />\never do any dangerous harm to anyone, except sal;<br />\nthem, then it is possible with this form of treatment<br />\nget them rehabilitated so that they don't do it anymor<br />\nDo you. consider giving drugs or surgery to someotie<br />\njail ethical?<br />\nWell' I'll throw the question back at you. If there's(<br />\nrapist who feels totally incapable of controlling<br />\nbehavior, and<br />\nsay that feeling• that they're no 111°<br />\ncapable of controlling it than an epileptic is Of stoppla<br />\nthe next epileptic attack, and if there. was a reasonabl<br />\ngood chance that by doing brain surgery you could mal,<br />\nit possible for him not to have to be an impulsive rapis<br />\nanymore, and I mean dangerously violent and maYb<br />\nkilling, which would you think is better: to require him t°<br />\ngo into the gas chamber and be dead forever or to take<br />\nthe surgical treatment in the hope that it would all°<br />\nhim to live the rest of his life without sex in it?<br />\n<br />\n`...we are, with great difficulty,<br />\nadjusting ourselves to the Birth<br />\nControl Age...'<br />\n•<br />\nBut is he being coerced because he doesn't want to die? '<br />\nIs he being coerced into the death chamber? Yes, °<br />\ncourse he is. I mean we have to stop being fools 01<br />\nthis. What's happened now with all of this holy talk\"1<br />\nabout the rights of prisoners, which had a good beginfull<br />\nin so far as prisoners were being offered the chance t<br />\nvolunteer for testing of infectious agents and new drug<br />\nthat had no bearing on their own health. That was oka)<br />\nto talk about respecting the rights of prisoners instead 0<br />\nusing them as Hitler did as guinea pigs, but to tel<br />\nprisoner that he can't sign a paper for his own treatmell<br />\nthat will help his personal sense of well-being, to rne aAri<br />\nexample of the pendulum that swung the other way an'<br />\nit's an example of- the vindictive cruelty of society thad<br />\nsays, \"We've got you now.We're going to keep you, au<br />\nnot, let you go, even if we have to put you in tile g35<br />\nchamber.\"•<br />\n<br />\n1004<br />\n<br />\n7e<br />\n<br />\n17C.<br />\n<br />\n;<br />\n- sCo712771<br />\n<br />\nCa-<br />\n<br />\np7-ese ts<br />\n<br />\n(ThE JohNs HopkiNs UNIVERSiTy<br />\nWEEKEND WONDER FLIX<br />\nOfficE of ThE ChAplAiN<br />\n<br />\nSEVEN<br />\nBEAUTIES<br />\n<br />\nPRESENTS<br />\n<br />\nAn indelible film, unlike any other I have ever seen. The<br />\nscript, photography, direction and performances are<br />\npractically incomparable. —Gene Shah!, NBC-TV<br />\n<br />\n7*-icot<br />\nCUM<br />\na•Cja5sical<br />\nutile Rcitctl<br />\ncciturdaL ,4/37430, 1977<br />\n0TN,<br />\n<br />\nar-rctti. foc;$777<br />\n<br />\nLibra\"-<br />\n<br />\n*sU<br />\nAnew film by Lina Wertmuller<br />\n<br />\nSeven*<br />\nBeauties<br />\n<br />\n...that's what they call him.<br />\n<br />\nEll<br />\n<br />\nstarring Giancarlo Giannini<br />\n<br />\n7:30*. & 10:00 HomEwood CAmp<br />\nFRIDAY, APRIL 29 GREAT HALL<br />\nSATURDAY,<br />\nAPRIL 30 SHRIVER H41<br />\n!1„dmissioN: $1.00<br />\n<br />\nDETAILS 318-810<br />\n<br />\n\f92<br />\nocsr<br />\nsca<br />\nent<br />\nMOr<br />\n<br />\nme<br />\n;re's<br />\nig 11.<br />\ntiler<br />\n<br />\napril 29, 1977<br />\n<br />\npage 3<br />\n<br />\nnews-letter<br />\n<br />\nPeabody news<br />\n<br />\n•<br />\n•<br />\n<br />\nOpera premieres<br />\nGalkin bows in<br />\n<br />\n)nab<br />\nma<br />\n<br />\nrapis<br />\nnayb<br />\ntale<br />\nalloa<br />\n<br />\n•<br />\n<br />\n,s,<br />\nabet)<br />\nLlkin<br />\nnnin<br />\nce t<br />\ndrug<br />\noka)<br />\nad 0<br />\ntell<br />\nnient<br />\nis all<br />\n( and<br />\nthat<br />\n, arid<br />\ne gas<br />\n<br />\nBy JOSQUIN DESPRES<br />\n#<br />\new operas are not an everyday affair. It used to be<br />\nthere<br />\nthat<br />\nw ould<br />\nbe a new Opera every season for the great opera houses of<br />\nEurope, but those days are long gone. Today the expense,<br />\nthe risk, and the reluctance of major companies to<br />\nperform new works seem to preclude any but the very<br />\nbest of the new composers from the ranks of the opera<br />\nmasters.<br />\nThus, it is no small achievement to bring a new opera<br />\nto Baltimore. Let alone a new Opera by a Peabody<br />\ngradute, and a Pulitzer Prize winner at that. But it will<br />\nhappen, and it will mark the opening of the<br />\nPeabody-Hopkins merger as a benefit for the financially<br />\nbeleaguered conservatory.<br />\nThe Voyage of Edgar Allan Poe is Dominick Argento's<br />\nvision of Poe's last journey. It concerns itself with the last<br />\ndays of the writer's life, which started with a boat trip in<br />\nRichmond and ended in death in a gutter in Baltimore.<br />\nWhat happened in between remains a mystery, and that<br />\nmystery was the spark that lit the idea for the opera. With<br />\na libretto by Argento's colleague at the University of<br />\nMinnesota, Charles Nolte, the Opera had its premiere in<br />\nSt. Paul in 1976 with the Minnesota Opera Company.<br />\nHope Quackenbush, the promotion director for the<br />\nMorris Mechanic Theatre, was one of the audience.<br />\nMrs. Quackenbush knew that Minnesota Opera had the<br />\nsingers and the sets, and felt sure that Baltimore could<br />\nsupply the orchestra and chorus for the work's much<br />\nneeded East Coast premiere, so why not? The Baltimore<br />\n<br />\n.New Peabody _Director Elliot Galkin in action<br />\nOpera Company proved more than willing, and the 'Johns<br />\nGalkin, whose appointment was confirmed by Hopkins<br />\nHopkins University saw the Opera as the most suitable<br />\nPresident Steve Muller, is the ideal choice for the peabody<br />\nvehicle for a benefit for the Peabody. Thus, ont,June 6, Director, as his comprehension of both the musical and<br />\nThe Voyage of Edgar Allan Poe will receive its East Coast<br />\nacademic should prove invaluable to his efforts to afford a<br />\npremiere.<br />\nsmooth and equitable integration of Hopkins and<br />\nThis performance will also mark the appointment of ' -Peabody students. As he was quoted in the ;Sun(8 April,<br />\nElliot Galkin as the director of the Peabody. Galkin, who<br />\n1977), he will try \"to develop the kinds of programs that<br />\nin addition to his teaching duties at Hopkins, Goucher<br />\nwould exploit to the fullest the resources of both the<br />\n(where he heads the music department), and Peabody, is<br />\nPeabody Institute and theJ ohns Hopkins University.\"<br />\nthe music critic for the Baltimore Sun, as well as the<br />\nWell, an opera is an awfully big event for a<br />\npresident of the Music Critic Assocation.<br />\n-housewarming party, but then, this is an awfully big<br />\n(To expound upon his career would prove almost<br />\nhousewarming. And if an East Coast premiere of a<br />\nfatally lengthy; suffice to say that this former student of<br />\nPeabody student's opera is representative of the kind of<br />\nNadia Boulanger has been involved in almost every form<br />\nthing that will result from the affiliation of Hopkins and<br />\nDf music from country fiddling to Opera, and is one of<br />\nPeabody, then the next years should be something to<br />\nAmerica's most respected critics and musicologists.)<br />\nwatch (or rather listen to) indeed.<br />\n<br />\n1.<br />\npoputt s\"iVeS<br />\n<br />\nrhe<br />\n<br />\nresults are in! An overworked N-L tabulations staff<br />\nworked long into last night, furiously collating the data<br />\nfrom the \"Who is your worst professor?\" poll. The poll,<br />\nissued two weeks ago, received an overwhelming response<br />\n- the heavier mail days required three of the burlier<br />\nmembers of the delivery crew to tote the stacks of<br />\nresponses back to the Gatehouse. Once all the entries<br />\nwere in, the N-L consulted famous social scientist and<br />\namateur pollster M.R. Bongue to select a scientifically<br />\naccurate sampling of the responses. After extensive<br />\ncooperative research with Dr. Bongue, the staff came up<br />\nwith the 33 random entries that most exactly represent<br />\nthe collective Hopkins undergraduate.<br />\nThe entries, on the whole, indicated a creative impulse<br />\nhidden within the deepest pre-med recesses of the average<br />\nHopkins student. Most replies took the liberty of<br />\nproviding answers outside the strict yes/no requests, of<br />\nwriting extensive comments where one word would have<br />\nsufficed, of posing questions in response to questions; in<br />\nshort, it seems a lot of talent on campus has been<br />\nsmothered under multiple-choice exams and<br />\nproblem-gutted homework.<br />\nTo start, the \"Faculty\" section evoked the widest range<br />\nof responses. No less than 29 personages were bestowed<br />\nthe title of \"Favorite Professor,\" coming from all<br />\ndepartments. Multiple nods went to Drs. Gryder, Crenson,<br />\nCone, Pfeffer, Posner, and Russel-Wood. Honorable<br />\nmentions would take too much space to list -- you know<br />\nWho you are, so keep up the good work.<br />\nThe Henny Youngman Award for best jokes went to<br />\nMichael Hooker (Philosophy), in a tight contest with<br />\nthose who found no professor capable of delivering a<br />\none-liner at the appropriate moment. One reply gave a<br />\nbackhanded compliment to Robert Green, \"for stealing<br />\nthe best jokes from Dr. Pond.\"<br />\nDr. Richard Macksey of the Humanities Center took<br />\nhonors'in the art of obsfucation, although a number of<br />\nvoters picked Drs. Ranum and Kenner as masters of the<br />\nverbal footnote. 8s for the worst advisor; well, a plurality<br />\nrecommended staying away from Gilman 155 for course<br />\ncounseling. At the same time, a sizeable vote came in for<br />\nDr. Dierman, even though it wasn't technically his<br />\ncategory (see below).<br />\nThe. \"n o -e duca tion-at-Hopkins-is-complete-without\"<br />\nquerry, which asked \"Have you ever seen John Barth\"(a<br />\nvariation on the \"Have you ever talked with Muller\"<br />\nroutine), found roughly half the undergraduates fulfilled,<br />\nthe other half still searching. This question elicited quite a<br />\nfew riffs, from \"I once caught a glimpse of his head<br />\n<br />\ntO prO<br />\n<br />\ngleaming across the quad\" to an ecstatic \"Yes, three times<br />\nin fact!\"<br />\nIn the \"Academic\" category, the Math and Chemistry<br />\n'departments finished a close one-two for the worst<br />\ncollection of graduate students. On the other hand,<br />\nBiology took the \"Worst Nerds\" crown in a runaway.<br />\nThat much-desired Homewood delicacy, the gut course,<br />\nbrought 'a surprisingly varied collection of courses to the<br />\nsurface. Everything from Social Psychology to Organic<br />\nChemistry, from Bioengineering Seminars to .Kenner<br />\nclasses got mention as the Nirvana of TheAcademic set. A<br />\ncouple students protested this question, however, saying<br />\n\"There are guts at Hopkins?\" and \"You think I'm going<br />\nto 'ye that aw. ?!\"<br />\n<br />\nNoted pollster Dr. M.R. Bongue<br />\nhe choices for worst and best course were likewise<br />\nunclear; many courses got nominated in both categories.<br />\nGenerally, introductory courses and Psychology offerings<br />\ncame under the most criticism. Meanwhile, there was no<br />\nagreement on the best course, a quandary that should<br />\nhave been expected.<br />\nIn \"Campus\" matters, three rooms vied for position as<br />\nbest lecture hall: Remsen 101, Shaffer 3, and Maryland 110.<br />\nRemsen I emerged as the solid choice for worst room on<br />\ncampus. No consensus emerged on library levels; C and B<br />\ndrew strong support as the favorite levels, though DX,<br />\nand M all had their loyal followers. In the case of class<br />\ntimes, the hours before noon were<br />\nprogressively hated, with 9:00 the most despised. The<br />\nreplies evidenced no great love for 4:00 classes, either,<br />\n<br />\nessors<br />\n<br />\nand a few found \"anytime\" to be a bad time for a course.<br />\nFood? A brave 10% ,stated they would eat Servomation<br />\nofferings even when endowed with free will, one<br />\ncourageous (or gluttonous) soul writing \"Sure!\"<br />\nThe question of what to do with that perennial<br />\nheadache, Garland Hall, engendered the most imaginative<br />\nsolutions of the poll. The proferred choices all received<br />\nnominal support, with a parking lot edging out the<br />\nproposed bowling alley and tennis courts. Individual calls<br />\ncame for replacement with McDonald's, a Mexican<br />\nrestaurant, a stable and riding course, a sex counseling<br />\ncenter, and an all-night organic lab. Many wanted a \"piece<br />\nof the Block\" on campus, in the form of a combined<br />\nsaloon/brothel. And a canny few thought Garland Hall<br />\nshould be removed in favor of an administration building.<br />\nFinally, in the \"General\" section, respondents were<br />\nasked to rate President Muller's performance (\"I thought<br />\nCarter was President,\" one person noted). \"Say what\"<br />\ntook 32% of the vote, \"Fair\" next at' 21% the rest<br />\nscattered from 'Excellent' to \"Poor\" and one \"Cute.\"<br />\nComplaints Were registered that Muller only paid<br />\nattention to grad students.<br />\nDr. Dierman, a near-winner earlier, handily beat out Dr.<br />\nSuskind 3-1 for disfavor. Whether Hopkins is worth the<br />\nmoney coughed up by undergraduates (that is, their<br />\nparents) was hotly contested, with about equal numbers<br />\nsaying \"Ay and t. Nay.\" One terminally disillusioned<br />\nstudent scribbled little \"Ha-Ha's\" around the border of<br />\nthe entry, while another casually explained \"No... but<br />\nthen again, I'm on financial aid.\"<br />\nBy a 60-40 margin, students found the Hopkins<br />\npastime of lacrosse \"not that big a deal, \"though a<br />\ncouple negative votes had the qualifications \"only when<br />\nbloody\" and \"If you like French cuisine.\"<br />\nFor the last bit of information, the entrants had to try<br />\nto identify themselves (for _untold demographic<br />\npurposes). It seemed self-rated \"derelicts\" sent in the<br />\nmost replies, with a good number of \"jocks\" and \"nerds\"<br />\nalso responding. The plurality; though, went to the<br />\n\"other\" denomination, wherein species ranging from<br />\n\"closet pre-med\" through \"person\" to \"sweet young<br />\nthing\" appeared. One student went so far as to!declare<br />\nthat \"I also look liket Jimmy Carter,\" obviously someone<br />\nfamiliar with the vagaries of poll-taking.<br />\nAs a finale, the headline-cum-title of the poll, \"Who is<br />\nyour worst professor?\", must, for now, remain<br />\nunanswered. It seems the computer broke down on that<br />\none, spewing out names and numbers in an electric<br />\nfrenzy. Sorry.<br />\n<br />\n\fpage 4<br />\n<br />\nEar<br />\n<br />\nl Hines looks amazingly like Bobby Short, thL. New<br />\nYork sophisticate, song interpreter par excellence. Hines,<br />\nresembles Short, except that while Short exudes New<br />\nYork's 'East Side in the best of times, Hines carries with<br />\nhim the Chicago of the forties. Class, but the kind of class<br />\nthat doesn't need the sheer polish of money, like a suit<br />\nthat looks good even off the models who never seem so<br />\nmuch as to sweat.<br />\nHe sits at the piano on the cramped stage and rambles<br />\ninto an introduction, hitting notes and playing runs as if<br />\nhe was just warming up, untiLbefore you reali7e what he's<br />\nplayed, the whole thing falls together as the most intricate<br />\ndevelopment of that tune you've ever heard. Of course,<br />\nit's a tune that you've heard countless times before, but<br />\nnone the less, each chorus sounds different, not merely<br />\nfrom the succeeding choruses, but from any previous<br />\nperformance in memory.<br />\nHines looks about the right age to have grown up<br />\nplaying bebop. Indeed, both Charlie Parker and Dizzy<br />\nGillespie were in his band in Chicago, as was Billy<br />\nEckstine, who put together the first Bop Big Band,<br />\ndrawing heavily from the Hines alumnae (one prize was'<br />\nsinger Sarah Vaughn). Yeah, Hines played with the early<br />\nboppers. He also played with the young Louis Armstrong,<br />\nand not as an apprentice either. As an equal.<br />\n\"I met Louis, and that's what caused us to be friends,'<br />\nsays Hines of his early style. \"We were both playing the<br />\nsame style, only I was playing the piano, and he was<br />\nplaying the trumpet. Now, the reason I was playing it on<br />\npiano is because back in the days when I started, way<br />\nbefore I ever heard Armstrong, I was playing this way in<br />\nPittsburgh, Pennsylvania. I was playing the \"trumpetstyle\" because they couldn't hear ragtime in the classical<br />\nstyle I was using, the fingering... So the only way I could<br />\nget heard was to play what I wanted to play, only instead<br />\nof playing it on trumpet, I played it on piano. That's<br />\nwhere it started.\"<br />\n<br />\n\"The only hope I see for<br />\nany young musician is to<br />\n'learn your horn.'\"<br />\nHines goes'into a medley: West Side Story. The medley<br />\nform suits Hines to the point that you'd think he invented<br />\nit. In a way he did; as critic and producer Don Schaten<br />\nput it, Hines' improvisations are so full of other songs,<br />\nwhen he slides into anew tunei_it's almost as if the new<br />\ntune had been improvised on the spot. The same happens<br />\nwith West Side Story. Hines trots the melodies out as if<br />\nthey were his own, and plays with them as he wants. For<br />\ninstance, I Feel Pretty sounds suspiciously like it was<br />\nwritten by Fats Wailer;,<br />\nmoreover, Chicago appears<br />\n<br />\napril 29, 1977<br />\n<br />\nnews-letter<br />\n<br />\nFatha Hines:<br />\nOriginaljazz<br />\nBy J.D.Considine<br />\n<br />\nmysteriously before the finale (\"It was the West Side of<br />\nChicago,\" he says at the end).<br />\nYou might expect the back-up musicians to look pretty<br />\nmuch the same as Hines. Rudy Rutterford, smoothly<br />\ndressed, jocular, easily middle-aged, seems the perfect<br />\nman for the part, as he roars in his best Coleman Hawkins<br />\nsytle through a tenor sax blues. The bandstand displays an<br />\nalto, a tenor, a soprano, a clarinet, a C flute and a G flute.<br />\nOnly four of the six get used.<br />\nThe drum set features a series of tuned toms,just right<br />\nfor those impressive around- the-set paradidles crowds<br />\nlove. Eddie Graham, young, British-looking, sits behind<br />\nthe traps, bursting energy. He's a young drummer, which<br />\nseems good enough excuse for his lengthy solos consisting<br />\nalmost entirely of Buddy Rich/Gene K rupa cliches. He<br />\ngets two fifteen minute solos, which most of the crowd<br />\n<br />\nlove. In short, he's fast, flashy and fun, which, you guess,<br />\nmakes up for his lack of ideas.<br />\nJ ohnny Orr fools you.. Unlike Graham, whose flurry of<br />\nnotes seem to hide a lack of quality, Orr's basswork seems<br />\nalmost reticent, as if he were afraid to say something.<br />\nUntil he solos. Small children are often told to merely<br />\nspeak when spoken to, and when Or finally speaks, it's<br />\ngenius. Brilliant runs, flawless double-stops, and an<br />\nexquisite melodic sense combine for solos which carry the<br />\nquiet brilliance of a Picasso drawing.<br />\n\"Nobody's backing the young man who decides to<br />\nkeep J azz going as a cultural art... You've got young<br />\npeople coming out of the schools today that are great<br />\nmusicians, but where are they going? Nobody's making<br />\nany openings, nobody.\"<br />\nIt would be easy to dismiss Hines as just another old<br />\nmusician who regrets passing of<br />\nhis time, until you learn about his non-musical life. For<br />\nexample, that he is currently the President of the Overseas<br />\nPress Club. That he speaks frequently with the State<br />\nDepartment's Arts Programs Co-Ordinators. That, while<br />\nplaying at a reception or Gerald Ford and Valery<br />\nGiscard D'Estaing, he spoke to the President about the<br />\nimportance of government involvement in the Arts.<br />\nHe thinks that there should be a Secretary for the Arts;<br />\n\"I've been fighting for that for years, and, God bless the<br />\ndead, Ellington too... But we're just a couple of people...\"<br />\nHe intends to speak to President Carter when he plays for<br />\nhim, but is worried because he is unsure where Carter<br />\nstands.<br />\nBut it is with the young, Hines feels, the answer lies.<br />\n\"There's not a kid you know that's not interested in Bugs<br />\nBunny. So why not open up an avenue for music?\"<br />\nGetting the message across, that music is something<br />\nvaluable in itself--that's what is needed.\"The trouble with<br />\nthe United States is they're commercial...They're trying<br />\nto put music, as far as success is concerned, in the<br />\ncategory of sports.\"<br />\n\"The only hope I see for any young musician is learn<br />\nyour horn.' Learn your instrument. Don't pick it up by<br />\near. Years ago, when we had the big bands, you had to<br />\nknow what to do to be in the band... We went down to<br />\nrecord because we wanted to hear ourselves, perfect<br />\nourselves...\" The drive for excellence, for music for its<br />\nown sake seems all that is needed to make the world run<br />\nsmoothly.<br />\nIt also seems very dry. Dry, until you think back to<br />\nMarva Josie, the band's vocalist, swinging through Jelly,<br />\nJelly in a down home, no holds barred performance, that<br />\nwould have Dinah Washington blushing with envy. It's not<br />\nuntil you realize that these cats4swinging their asses off in<br />\nthe dirtiest down-home blues you ever heard - are all cats<br />\nwho know their aces better than their friends, that what<br />\nHines says really makes sense.<br />\n<br />\narts calendar<br />\nConcerts<br />\n<br />\nYou always look in this window but you never go in. You make a point to take the route up 31st Street, letting your<br />\neyes do a quick search to feed your wondering about the perhaps unimaginable kinds of things that take place within.<br />\nYou conjure the pink naked grapefruits dancing, swaying to the amorous undertone you play in your backcorws when<br />\nyou think about Ier and her and them. But the window is black. Your fantasies are not there. You always walk on, not<br />\nunderstanding, not knowing that your images are wrong, your words are wasted, and your mind may never heal. You<br />\nlaugh in.your solitary box now as you leave the window behind.<br />\nBread and Roses Coffeehouse, a Homewood alternative at 426 East 31st Street, will feature a BEER PARTY with live<br />\nmusic by CARL CHATSKY tonight at 9 P.M., and tomorrow evening the incredible ILILI MUSIC EXPERIENCE at 8<br />\nP.M. A donation of one dollar is requested for both events. And don't forget: LUCHA,the inspirational talents of five<br />\nwomen singing of working and poor people from around the world, will appear at Bread and Roses Saturday, May 14 at<br />\n8 P.M.<br />\nYou always look in this window but never go in.<br />\n<br />\nBaltimore Symphony Orchestra, Lyric Theater, 120 W. Mount<br />\nRoyal Ave. Judith Burganger, pianist, and Arid l Deborah<br />\nRubinstein, soprano, will solo at the Baltimore Symphony's pop<br />\nconcert at 8:15 p.m. on April 30. It will be an all-Tchaikovsky<br />\nprogram.<br />\nGoucher College. Pianist Alfred Brendel will perform in an<br />\nall-Beethoven concert at 8:30 p.m. on May 3 in Kraushaar<br />\nAuditorium.<br />\nLeft Bank Jazz Society, Famous Ballroom, 1717 N. Charles St.<br />\nThe Bill Hardman-Junior Cook Quintet will play on May 1 at 5<br />\np.m.<br />\nThe Urban Philharmonic Orchestra, led by Darrold Hunt, will give<br />\na. benefit concert for the Kidney Foundation of Maryland on May<br />\nI at 8 p.m. in the Lyric Theater. Ticket prices range from $5 to<br />\n$50. For further information call 523-4826 or 653-2639.<br />\nLoyola College. Billy Joel will perform in the gymnasium on May<br />\n4 at 8 p.m. General admission tickets are $7 and are available at<br />\nthe Johns Hopkins Union.<br />\nTheater<br />\nMa-111mile Theater, Hopkins Plaza. Barbara Rush and Tom Troupe<br />\nstar in \"Same Time, Next Year.\" through April 30. Call 727-4103<br />\nfor ticket information.<br />\nCenter Stage, 700 North Calvert St. Jules Feiffer's \"Knock<br />\nKnock.\" through May 15. Student rush tickets are available. Call<br />\n332-0033 for further information.<br />\nKennedy Center Opera House (Washington.) The Tony<br />\nAward-winning musical \"Shenandoah,\" through April 30. Call<br />\n(202) 254-3600 for further inforniation.<br />\nKennedy Center Eisenhower Theater (Washington.) Arthur<br />\nMiller's new play, 'The Archbishop's Ceiling,\" starring Bibi<br />\nAnderson and John Collum will open on May 2 and play through<br />\nJune 4. Call(202) 254-3600 for FURTHER INFORMATION.<br />\nArena Stage, 6th and Maine Ave., S.W.(Washington.) Maxim<br />\nGorki's 'The Lower Depths,\" through May 8.<br />\nArena Players, 801 McCtilloh St. Four plays: Langston Hughes'<br />\n\"Soul Gone Home\" and \"Mother and Child.\" Ted Shine's<br />\n\"Shoes,\" and Clay Goss'\"Of Being flit.\"<br />\n<br />\n\fapril 29, 1977<br />\n<br />\nnews-letter<br />\n<br />\nCity film fare is mighty poor;<br />\nFast relief with the Film Festival<br />\nOffice of the Chaplain to aid this summer<br />\n/By MIKE GIULIANO<br />\nand even the few foreign directors with a popular<br />\n. t has not been a good spring for films and the situation • following-- Wertmuller, Bergman, Fellini, Truffaut--are<br />\nis truly pathetic in<br />\noften unacceptable unless the subtitles have been replaced<br />\nBaltimore, where one can choose between The Eagle Has<br />\nwith a dubbed soundtrack. An example: Wertmuller's<br />\nLanded, Cassandra Crossing, Silver Streak (still doing Swept Away opened at a suburban.theatre with the<br />\ngood business after many months), Airport 77, and<br />\noriginal Italian soundtrack, did lousy business the first<br />\nGodzilla Vs. Bionic Monster. Such films are playing in<br />\nweek and was replaced the second week with a poorly<br />\nWashington and New York, but these cities can actually<br />\ndubbed .<br />\nv ersion which did much better at the box office.<br />\nrill theaters for serious documentaries like Harlan<br />\nMost foreign directors do not exist in Baltimore. The<br />\nCounty<br />\nU.S.A., film biographies like Edvard Munch, and • last Godard film, as far as I know, to play in a commercial<br />\nFassbinder festivals.<br />\nBaltimore theater was Weekend in the late 1960's.<br />\nQuick: What was the last documentary film you saw in<br />\nSatyajit Ray, the prolific Indian director, produces<br />\na commercial Baltimore theater? You probably have not<br />\nmasterpieces on a yearly basis, but the man is a cipher in<br />\nseen even one, because there have been very few. Baltimore. No Japanese director, not even Akira<br />\nBaltimore audiences, while enthusiastic<br />\nabout mindless -iKurosawa, is a hot item in this city.<br />\nentertainment, aren't going to<br />\nstand in line and pay three<br />\nSince the 5 West and 7 East closed a few years ago,<br />\ndollars for intelligent entertainment. The moviegoing<br />\nBaltimore's one remaining art house has been the<br />\nPublic doesn't really know anything about documentary _ Playhouse on 25th St., but the Playhouse plays it safe and<br />\nh.lms, but<br />\nthey do have bitter memories of grainy, dull<br />\npresents us with a mixed bag of art and commercial<br />\nfilms dealing with venereal disease and civil defense 'entertainment, as<br />\nit probably has to do in order to stay in<br />\nPrecautions shown in high school classes, and some<br />\nbusiness. Consequently, we get Bergman and<br />\nPeople, having seen a vintage documentary, a Nanook<br />\nTunnelvision, Sautet and soft pornography, Malle and The<br />\nof<br />\ntile North (1922), conclude that nonfiction films, because<br />\nSeven<br />\nPer Cent Solution. Satyajit Ray, Robert Bresson<br />\nof their<br />\nvalue as social documents, should be preserved in (who?), Akira Kurosawa and Alain Tanner (who?who?),<br />\nmuseums and occasionally dusted.<br />\nare rarely, if ever, found at the Playhouse.<br />\n. A contemporary documentary, no matter how good it is,<br />\n, The situation in Baltimore's commercial theaters is<br />\nslinPly will not make money in a commercial Baltimore<br />\ngenerally rather dismal, but several film series, special<br />\ntheater. Hearts and Minds, even after it won an Academy<br />\nscreenings and festivals provide a welcome alternative to<br />\nAward for best documentary film, played one week at the<br />\nThe Shaggy D.A. and A Star Is Born. Hopkins' Office-of<br />\nCharles theater before disappearing from this metropolis<br />\nthe Chaplain, as a part of its Sunday Experience series,<br />\nof 2,000,000 souls (there are considerably fewer<br />\nwill present Marcel Ophuls' The Memory of Justice<br />\n,<br />\n111(3viegoers, and even fewer documentary filmgoers. I (1976) on May 8 at 11 a.m. in Shriver Hall. A catered<br />\nsnared Hearts and Minds with five, possibly six, people •lunch will be available during intermission; call 338-8187<br />\nc'ne Saturday afternoon.) Harlan County U.S.A., an<br />\nfor luncheon reservations. This documentary examination<br />\nex<br />\nr amination of social injustice in the K entucky coal<br />\nof Nazi crimes was directed by the same man who gave us<br />\nlelds, and Union Maids, which deals with 1930's labor<br />\nThe Sorrow and the Pity. The Memory of Justice has<br />\nrilcivements in Chicago, are thought provoking films about<br />\nnever been commercially released in Baltimore. On May<br />\n°11temporary<br />\nc<br />\nAmerican society. Neither film is playing in<br />\n22 at 11 a.m. in the Listening and Viewing Room, the<br />\nnaltimore. Documentaries with relevance and immediacy<br />\nSunday Experience will screen Ingmar Bergman's Through<br />\nare not despised, but are simply ignored.<br />\na Glass Darkly. The film will be followed by a critique by<br />\nFor most of us, movies are an escape from reality, a<br />\nDr. Rene Girard of the Romance Languages Department.<br />\n.way to forget the fact that people died on picket lines and<br />\nThere is no admission charge for these two films.<br />\nitn Vietnam. We do need, once in a while, to sit in a dark<br />\nThe Office of the Chaplain is also sponsoring its fifth<br />\n,Iteater for two hours and immerse ourselves in the<br />\nannual summer film series, Hollywood Cavalcade, which<br />\nl'Intastic adventures of Shirley Temple and Godzilla, but<br />\nruns from May 8 until August 28, and includes Chaplin's<br />\nwhat is dangerous and damnable is when we assume that 'City Lights, Greta<br />\nGarbo in Anna Christie, Jean Harlow in<br />\nril°vies are no more than an escape medium, when we<br />\nFrank Capra's Platinum Blonde, the Marx Brothers' A<br />\nflegleot the fact that films can, like the Godfather,<br />\nNight at the Opera, Marlene Dietrich in Shanghai Express,<br />\nentertain and offer social commentary.<br />\nTod Browning's Freaks and much much more. Screenings<br />\nniBaltimore audiences receive foreign films with little -Are in Shaffer 3. Reduced<br />\nsubscription rates for 25 or 12<br />\n-°re<br />\n..,..;__..,enthusiasm than they do domestiC documentaries, admissions are available through May 8 from the Office of<br />\n<br />\nthe Chaplain. Single admission tickets will be available at<br />\neach performance. Stop by the Chaplain's Office for a<br />\nfree brochure and calendar, or call 338-8187.<br />\nThe eighth Baltimore International Film Festival will<br />\nbe held from May 13-21 at the Tower Theater, 2 Charles<br />\nCenter, Charles and Saratoga Sts. The films to be shown<br />\nare: Fernando Arrabal's Guernica(1976) on May 13 at 10<br />\np.m. and May 19 at 7:30 p.m.; Vim Wender's Alice In<br />\nThe Odes(1974) on May 14 at 7:30 p.m. and May 17 at<br />\n9:30 p.m.; Rainer Werner Fassbinder's The Bitter Tears of<br />\nPetra Van Kant (1973) on May 14 at 10 p.m.; Andre<br />\nTechine's French Provincial (1976) on May 15 at 7.30<br />\np.m. and May 18 at 9:30 p.m.; Wim Wender's The<br />\nGoalie Anxiety at the Penalty Kick (1971) on May 16 at<br />\n9:30 p.m. and May 20 at 7:30 p.m.;11ohn Waters' Pink<br />\nFlamingoes (1972) on May 13 at midnight; \\Wham<br />\nMenzies' Invaders From Mars (1953) on May 14 at<br />\nmidnight; Claude Chabrol's La Rupture(1975)on May 15<br />\nat 10 p.m. and May 19 at 7:30 p.m.; David and Al<br />\nMaysles' Grey Gardens (1975) on .May 18 at 7:30 p.m.<br />\nand May 20 at 10 p.m.; Satyajit Ray's The Adversary<br />\n(1971) on May 17 at 7:30 p.m. and May 21 at 7:30 p.m.;<br />\nClaude Whatham's Swallows and Amazons(1974)on May<br />\n13 at 2 p.m. and May 20 at 2 p.m.; Fiedler Cook's From<br />\nThe Mixed-up Files of Mrs. Basil E. Frankweiler (1975)<br />\non May 14 at 2 p.m.; and winners of the Independent<br />\nFilm Competition on May 21 at 10 p.m. For further<br />\ninformation call 539-2187.<br />\nFinally, a film series at IHoward Community College<br />\n(Little Patuxent Parkway in Columbia) presents free films<br />\nevery Sunday night at 7 p.m. The schedule for the next<br />\nfew weeks is as follows: Howard Hawks' Scarface on May<br />\n1; D.W. Griffith's Abraham Lincoln on May 8; Main<br />\nResnais' Hiroshima Mon Amour on May 15; Akira<br />\n.Kurosawa's Seven Samurai on May 22; and !Jean Renoir's<br />\nBoudu Saved From Drowning on May 29.<br />\n<br />\nArellano's 11 O'CLOCK has a hallucinatory quality<br />\nsh %en you come to the revolution, bring your dancing<br />\ns, Qles•kick a step with the sadistic Doctor Nodarse slide<br />\n'<br />\nc eP dance with the brutal guard the sergeant with his<br />\nwa.rbine and the heart of slush with the mysterious Tere<br />\nElth the drunken Professor of Everything Pedro with One<br />\nisY,!at.be peripheral the Oedipal knife-thrower whose target<br />\nch wtom who's been pinned to the board there are others<br />\nru ange partners hook arms with Pepe Lopez the suicide<br />\nkiartYr in the confessional of mud ask the butcher his<br />\ndneys are shot ask his donor the drunkard his kidneys<br />\nat<br />\nit,e shot by the pistol of the guard with the slashed thigh<br />\ns an orgy of stabbings and song it's a little too long.<br />\ntr And it's touching and lunatic; it's religions<br />\n.vansoendence in a maximum security prison; it's a<br />\n'<br />\nolfalnikaze Castro revolution on a small scale; it's the night<br />\nthe dancing dead; it's wine into water info rum into<br />\n'at<br />\nit occasionally loses its head.<br />\nAr °L1 know Bob Arellano, but you don't know this Bob<br />\ncheisliano unless you've spent some time with him in a<br />\njail. Unless you've peopled his nightmares. These<br />\nare<br />\nbi! ,three corpses and far more casualties at the final<br />\n``belcout. The characters are hopelessly mortal.<br />\ncurb wrote the original script ten years ago before<br />\n'all politics became fixed. It was a philosophical script,<br />\n'rev•<br />\nlth overtones of the academic, the religious, the<br />\np(40dutionary. It showed its date. It had the pace of a<br />\netnio• And Bob was not satisfied.<br />\n<br />\nIn this new version director Ned Solomon (he's the one<br />\nwith the guitar) gets three characters out from under their<br />\nlabels and sets them on their feet. Everyone gets a chance<br />\nto explain himself, and most of the explanations are<br />\nconvincing. The professor, the priest, and the<br />\nrevolutionary have been condemned to death by an<br />\noverworked count with a ten minute patience, but, for<br />\nthe time being, their bodies are more useful, than their<br />\ncorpses could ever be. I can't tell you why; let your<br />\nimagination run riot. The question becomes: Live and be<br />\n•of service to the state, or—the alternative?<br />\nManny Falcone plays the cleric whose faith goes<br />\nquickly. He gets—everyone gets—a chance to address his<br />\nGod directly, and makes good use of it. Bobby Reiser is<br />\nthe stiff-lipped, stiff-spined One-Eye, who gets off some<br />\nchoice invectives, and carries much of the dramaturgical<br />\nload. Pedro, the coward, the drunk, the Central University<br />\nprofessor, is played by Mark Gallagher. With all his<br />\ncowardice, and his chronic DT's, he spends much of his<br />\ntime trembling. But he also provides the script its<br />\nhallucinatory, quality by lecturing to One-Eye and Lopez<br />\n'n his rumdream conviction that he is running his 11<br />\no'clock class. Manny and Bobby play his students and are<br />\njoined by Tere, Pedro's childhood bride and romantic<br />\nfantasy. There is much that is funny and touching about<br />\nthese sessions. There is much about the last of the set<br />\nwhich is neither.<br />\n<br />\nChris Stutz, as Doctor Nodarse, is less certain than her<br />\nfellows about what character she's playing. She plays a<br />\nfew, anyone of which she might have handled well. Ruth<br />\nBosch has her first brutal role as the guard. We get to see<br />\nher kill, swear and take a bribe. We also see her stabbed.<br />\nHoward Mandell is the obliging sergeant. Audrey Zettick<br />\nis Tere.<br />\nBarbara Smith does the understated make-up, Ian<br />\nSutherland the understated set, with Ed Fancovic.<br />\nPrograms and Publicity by Susan Williams, Producer<br />\nKaren Kaska, Lights by Gene Danko.<br />\nSome questions you may be left with:<br />\nCan a scalpel be accurately thrown?<br />\nCan a man be briefly immortal?<br />\nWhat was Jesus' greatest miracle?<br />\nWhat do we owe to the apostle Pedro?<br />\nWhat's a priest to CO<br />\nCan blood be taken from a man who refuses to make a<br />\nfist?<br />\nWhence Oedipus?<br />\nDo you call half a pint drinking?<br />\nHow will the labels read?<br />\nDo you want sex?<br />\nBy all means go. This is a thoroughly Hopkins<br />\nproduction. Friday and Saturday, April 29 and 30, at<br />\n8:00. Listening-Viewing Room.<br />\n—David Hodges<br />\n<br />\n\f— Tiff fltifl—Ay<br />\n<br />\nNEWS-LETTER<br />\nvol. lxxxi, no. 49<br />\neditor-in-chief<br />\nEric Garland<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editors<br />\nJ.D. Considine<br />\nMike Giuliano<br />\nphoto-production manager<br />\nJennifer Bishop<br />\nsports editor<br />\nDr. M.R. Bongue<br />\ngraphics editor<br />\nScott Marks<br />\nhigher consciousness<br />\nD.H. Warren<br />\ninterior decorating editor<br />\nRhona Lyons<br />\ncirculation manager<br />\n<br />\nHowie<br />\nproduction<br />\nDale Horan<br />\n<br />\ndopes<br />\n<br />\nd<br />\n<br />\nSTEVENS PRODUCT Ycl<br />\n<br />\nust when everyone concluded that Maryland had peeked<br />\nA<br />\nmFaimil<br />\nSHEETS &<br />\ne<br />\nout of the Dark Ages in terms of the decriminalization of<br />\nPILLOWCASES<br />\nBeauh-Blend<br />\nmarijuana, yesterday's Evening Sun headline announced \"29<br />\nBeauticale<br />\n,<br />\nissiEe<br />\nn,erS<br />\nS<br />\nFHip°<br />\nFine Arts<br />\nf afe<br />\nPeanuts<br />\n(Comic strip)<br />\nParkville, Hereford Students Arrested On Marijuana<br />\n-Lets<br />\nHip<br />\nTasternaker<br />\nUtica<br />\nCharges.\" A smaller headline cryptically announced that<br />\nUtica & Mohawk<br />\n:<br />\nt stkyShe<br />\ni WiaS,AIE<br />\n/sce<br />\nFjjiF aitnl<br />\nt<br />\nmore arrests were expected at other county schools. County<br />\nBLANKETS<br />\nBaby Stevens<br />\nForstmann<br />\nschool superintendent Robert Dubel expressed regret at the<br />\nUtica<br />\nwOOLE<br />\nbusts and promised cooperation with the police in handling<br />\nWORSTIf<br />\nCARPETS<br />\nFABRIC/<br />\nContender<br />\n.<br />\n\"our drug problem.\"<br />\nGulistan<br />\nBoldeena<br />\nMerryweather<br />\nForstmans<br />\nTastemaker<br />\nThere is more here than the obvious shallowness of this<br />\nHockanum<br />\nWorumbo<br />\nSLIPPERS<br />\nlatest crackdown by virtuous politicians, school officials, and<br />\nAlways in Step<br />\npolicemen on the pot-smoking high school youths of<br />\nBaltimore County. Those of us with inside sources in these,<br />\n4,f<br />\nhigh schools have been regaled with farcical tales, jokes, and<br />\none-liners about \"drug troubleshooters\" who are brought in<br />\nto close down the \"high school fun trade,\" special<br />\nvice-principals who spy on youths in the playground via<br />\nbinoculars, \"informants\" who whisper to school<br />\nadministrators about fellow student-druggies, and agents of<br />\nmorality who race around high school campuses on<br />\nten-speeds, whizzing up on teenagers before you can say<br />\n\"Reefer Madness\" or \"Yellow Peril.\"<br />\nA crackdown on high school alcoholics, or better yet, their<br />\nalcoholic parents might have been somewhat reasonable.<br />\nThe current and future marijuana arrests merely reek of a,<br />\nIn the Baltimore area, the recently<br />\nhotels, t,<br />\ndouble standard that does no more than gather Sun Citizens Committee forJ ustice forJ P. -formed stores,<br />\nStevens merchants, and 'Is w<br />\nheadlines.<br />\nWorkers has begun to organize activities in line<br />\nwill v oluntemt<br />\n<br />\nletters to the editor<br />\n<br />\nbar editor<br />\na. press<br />\n<br />\nAn Open Letter to Concerned Parties:<br />\nWe have respected The Johns Hopkins University for its<br />\nsupport<br />\nof a creative critic in the field of Chinese and Asian studies, Professor<br />\nRichard M.Pfeffer.<br />\nWe have appreciated his valuable contributions to the field, and<br />\nenjoy his vigorous intellectual—and warmly humanistic—presence as a<br />\ncolleague among us. With respect to the recent issue of his position at<br />\nJohns Hopkins, we think it imperative that he have the opportunity for<br />\nhis scholarship to be evaluated by the leading researchers and writers of<br />\nthe field, which we feel will confirm the high quality of his work.<br />\nWe look forward to his continued presence at Johns Hopkins, as we<br />\ndo to his continued contributions to our knowledge of China, Asia, and<br />\nstill more generally, of the structure and implications of capitalism and<br />\nsocialism.<br />\n<br />\nforeign affairs desk<br />\nMark Hertsgaard<br />\nKenneth Sokolow<br />\n(19091972)t<br />\n<br />\n\"Cheer to the Echo in<br />\nthe eighth. Go home<br />\na winner. Or call a cab.\"<br />\n<br />\nre<br />\nmovement that 10 to<br />\nitio° 1141<br />\n<br />\nJim Peck, Editor<br />\nAsia Library<br />\nPantheon Books<br />\n<br />\nProf. Noam Chomsky<br />\nInstitute Professor<br />\nM.I.T.<br />\nProf. Moss Roberts<br />\nAsian Studies<br />\nNew York University<br />\n<br />\nProf. Ernest P. Young<br />\nDept. of History<br />\nUniversity of Michigan<br />\n<br />\nNotes on thefol<br />\n<br />\nDr. Eqbal Ahmad<br />\nAssociate Fellow<br />\nInstitute for Policy Studies<br />\n<br />\nNOll at<br />\nn September of 1976 I asked permission to<br />\nhad no indica<br />\nk<br />\nteach a yoga class (as taught by the Integral Yoga<br />\ncourse was<br />\nInstitute—a non-profit organization) from the<br />\nday,<br />\nBy the<br />\nOffice of Student Activities. The course was<br />\npre-registered. agi<br />\nco-sponsored by the Office of Student Activities<br />\ndid not registetiolh:aiinuecir:<br />\nand approximately 55 people registered for it, 5070<br />\ncalled Chris u<br />\nof which were members of the Hopkins<br />\nbecadi<br />\nl<br />\nthe cass<br />\ncommunity. No fee was charged for rental space. students wil° kit(<br />\neias<br />\nDue to student demand, I called Chris<br />\nwould attend t\" llow<br />\nColombo's office in November once again and<br />\nclass was Canc<br />\nasked for room space to teach a course during<br />\nsti<br />\nanyway that<br />\nlies<br />\nintersession. Several calls later I was told there was<br />\ncorn°,<br />\nHopkins<br />\nno money available. The budget was tight. Lots of<br />\nwanted some .<br />\nthings ripped off in the Union had to be replaced.<br />\nFinancial? socil<br />\nIn December I called to request space for the<br />\nadditional sal°,<br />\nSpring. I was told that because of the heavy (wetldy<br />\nblack let tere:oi:J Cie<br />\ngroup<br />\ndemand from student organizations (unspecified)<br />\nthey wouldn't know until January. In January, I<br />\na1di<br />\nstudents).\"<br />\nwas informed that the Great Hall would now cost<br />\n5001 of the class proceeds to rent. The matter was not<br />\nThe class<br />\nnegotiable. In addition a stipulation was 'added<br />\nspace large<br />\nthat only members of the Hopkins community<br />\nwho registered in advance of the class at the Office gveitawayo:.<br />\nSupposed1Y<br />\nempyGREA12<br />\nAraPPej:<br />\nSooft1a<br />\nt1h::<br />\ns) 4!°0a,1 ?a1at 1<br />\nof Student Activities could participate.<br />\nWe were assured that the class would be goodesson<br />\nIsYe. i<br />\nOn atleas::i<br />\nadvertised widely throughout the University<br />\nyoga class<br />\nh;Nohardfe1 l (11<br />\nAs it turned out, the advertising was restricted to an<br />\n8\"x14\" sheet of paper that advertised the yoga<br />\nclass and a ballroom dancing class. The description<br />\nlearn about be -e<br />\nof the class was abridged to the point of offering<br />\nno meaningful explanation of the purpose of the<br />\nclass (which is not to learn how to stand on your<br />\nSue<br />\nhead or repeat ancient, mystical sanskrit chants).<br />\nIn addition the advertisement was delivered only o<br />\ntb efi osed<br />\nitonl<br />\nfincl:astritafo<br />\npo<br />\nibcoabutel3<br />\nto the Homewood community an not the medical<br />\ninstitutions.<br />\nFurthermore, the paper<br />\n, was distributed 4 days before the class started and that the Office<br />\n<br />\nJohn S. Service<br />\nCenter for Chinese Studies<br />\nUniversity of California-Berkeley<br />\n<br />\nRichard J. Barnet<br />\nCo-Director<br />\nInstitute for Policy Studies<br />\nProf. Howard Zinn<br />\nDept. of Political Science<br />\nBoston University<br />\n<br />\nProf. John Israel<br />\nDept. of History<br />\nUniversity of Virginia<br />\n<br />\nProf. Joseph W. Esherick, Chairman<br />\nAsian Studies Program<br />\nUniversity of Oregon<br />\n<br />\nI3LACK SOMEDAY?\\<br />\n<br />\nsli,,low,<br />\nStevens-made<br />\nlater plans 0,te s<br />\ndowntown, in 4elti/<br />\nboycott and ed tal p<br />\n01<br />\nThe national 4t<br />\nfltain<br />\nthe<br />\nas part of<br />\nConsistently v1(44an(<br />\nhas .willingly 1 out<br />\n(relatively weaTtill)<br />\nRelations Boaroloas<br />\nStep of providil‘<br />\none Stevens PIP'43 a<br />\nworkers in 0 vo<br />\nunionize. OP,<br />\nunionization P'till<br />\n,; ivh,<br />\nmass firings, P111<br />\nplant<br />\nmoving<br />\nrelatively scattel .a)ld<br />\nBaltimore ore<br />\n<br />\nProf. Morton H. Fried<br />\nDept. of Anthropology<br />\nColumbia University<br />\n<br />\nProf. Victor H. Li<br />\nLaw School<br />\nStanford University<br />\n<br />\nI<br />\n<br />\nwith the national boycott movement againstJ P.<br />\nStevens. The Committee, with University Chaplain<br />\nDr. Chester %ckwire and Congressman Parren<br />\nMitchell as co-chairmen, held an inaugural<br />\nluncheon April 20 in the Metropolitn Baltimore<br />\nCouncil Building, where about 50 people heard<br />\nvarious speakers and saw the local premiere of the<br />\nfilm \"The Testimony,\" a documentary concerning<br />\nthe plight of Stevens textile workers.<br />\nThe speakers, including Wally Orlinsky, Tom<br />\nBradley,(President of the Baltimore AFL-CIO),<br />\nTed Venetoulis, and Erika Outland (local rep of<br />\nthe Almagamated Clothing and Textile Workers),<br />\nrelayed the support of a wide range of political,<br />\nreligi us, and labor groups for the boycott, and<br />\noutlined plans for local activity.<br />\nThe campaign centers on an educational<br />\nprogram to be conducted through area churches<br />\nand other organizations, and, initially, a series of<br />\nvisitation teams to be sent to large department<br />\n<br />\ni<br />\n<br />\nAt'fCh<br />\n<br />\n\fI CT OYCOTT<br />\nPEFI<br />\nOven<br />\n<br />\nTABLE LINEN<br />\nSimtex<br />\n<br />\nIENV<br />\nlame<br />\nse<br />\nof the<br />\neta<br />\n<br />\nCOTTON FABRICS<br />\nAcademy<br />\nlady Twist Twill<br />\nTwist Twill<br />\n<br />\nSas<br />\nmaker<br />\n<br />\nILEN<br />\nSICS<br />\nlrla<br />\nmann<br />\nanum<br />\n,mbo<br />\n<br />\nSY NTHETICS<br />\n&<br />\nBLEND FABRICS<br />\nBlen Tempo<br />\nCoachman<br />\nConsort<br />\nCarousel<br />\nGesture<br />\nStevetex<br />\n20 Below<br />\nLady.Consort<br />\nVVindsheer<br />\nlinebacker<br />\nWaftamatic<br />\nIcotton-nylon knit)<br />\n<br />\n-<br />\n<br />\n004eisett<br />\n<br />\nIs, ltals. The teams hope<br />\nlocal<br />\ngid S who<br />\nuse Stevens products,<br />\nate °t to order the various<br />\nle sll'I°wels, linens etc. Tentative<br />\ns L sornmer call for<br />\nrallies<br />\n..\"t„ling, and strengthening the<br />\nN Program.<br />\n,ilall l of Stevens products comes<br />\nhell.ltainst a company which<br />\nhas<br />\n014'411:lard labor practices, and<br />\nIY 1 °lit Millions of dollare in<br />\nieak throu6unt.<br />\nlost National Labor<br />\n)arrIllas to evade the more costly<br />\nvl ,471unt worker benefits. Not<br />\n5 P17, a union contract, though<br />\nRev voted two<br />\nyears ago to<br />\nOl'el3t, Stevens has<br />\nfought<br />\nI Rll through such<br />\ntactics as<br />\n;, PT Mlites<br />\nagainst blacks, and<br />\nit 9143 that<br />\nresistance has been<br />\ncatt6and ineffective. The<br />\nnew<br />\ncol'ec is<br />\npart<br />\nof<br />\na<br />\nnational<br />\nlat 1° to<br />\nremedy that injustice.<br />\n00°<br />\n<br />\nThe Young Republicans' rebuttal on the Stevens<br />\nCo. issue presents an interesting contradiction and<br />\nshows how truly uninformed they really can be.<br />\nFor years, Americans have been bombarded by<br />\nthe mass media with editorials concerning the<br />\nhorrible conditions of the Asian sweat shops where<br />\nmuch of American clothing is made. Working<br />\nconditions are poor, wages are low, hours are long,<br />\nand there is no job security. Stringent laws have<br />\nbeen passed in many countries forbidding such<br />\nsituations, but bribery and the big stakes involved<br />\nprevent their enforcement. The Young<br />\nRepublicans speak of freedom, of the choice<br />\nAmerican workers have to join a union, but the<br />\nonly way American business can compete with<br />\nsuch competition is to maintain the same<br />\nconditions in order to keep overhead low. I do not<br />\nconcur with the Young Democrats' whplehearted<br />\nsupport of unionization, but it is obvious here that<br />\nthere is something involved beyond the interests of<br />\nthe people. They are just the pawns caught<br />\nbetween the struggles of two power and<br />\nmoney-hungry concerns. To support either the<br />\nunions or the Stevens Company would be to<br />\nneglect those with whom the issue is truly<br />\nconcerned—the workers.<br />\n<br />\n'Working conditions are poor,<br />\nwages are low,<br />\nhours are long...'<br />\nThe St-evens-AFL-CIO conflict serves only as<br />\nfurther evidence that American democracy is<br />\nbeginning to fail. Despite the laudable ideals of the<br />\n- founding fathers, the rights of the masses are being<br />\nforsaken for the enrichment of a few. If nothing<br />\nelse, Watergate should. have shown the public that<br />\nthe efforts of an individual to take more than his<br />\nshare of power are merely hampered by the<br />\nbureaucratic red-tape which we call law. It is too<br />\nearly for anyone to call for an overthrow of the<br />\nsystem, but it has long been time for the public to<br />\ntake action in righting these wrongs. The<br />\nlegislation can act, but without public interest and<br />\ninvolvement it cannot be effective. Instead of<br />\ntaking opposing on all the issues simply for the<br />\nsake of argument, if the Democrats and<br />\nRepublicans are truly concerned with the welfare<br />\nof the people, then let them show it by helping to<br />\nget more people involved in the governing process,<br />\ninstead of maintaining a monopoly for a few<br />\npower brokers.<br />\n--Dante Landucci<br />\n<br />\nBook reviews: Percy and heroes<br />\nLancelot by Walker Percy. Farrar, Straus and<br />\nGiroux; clothbound, 257 pp., $8.95.<br />\nBy JOHN HOLDREN<br />\nHis first wife died unexpectedly. He discovered<br />\nthat his new wife was unfaithful, and that his<br />\ndaughter was not really his. His Southern mansion<br />\nhome burned to the ground with four people in it,<br />\namong them a man whose throat had been slit<br />\nfrom ear to ear with a Bowie knife. He has spent a<br />\nyear in a Center for Aberrant Behavior, trying to<br />\ncommunicate—by knocking on the wall—with the<br />\ngirl in the next cell, withdrawn into herself<br />\n)ecause she was gang-raped.<br />\nWth all those events whirling behind and<br />\naround him, Lancelot Andrewes Lamar, •the<br />\nenigmatic central voice of Walker Percy's Lancelot,<br />\ncan still say,\"There is only one reason I am telling<br />\nyou about these sad old things...It is because the<br />\npast, any past, is intolerable, not because it is<br />\nviolent or terrible or doomstruck or any such<br />\nthing, but just because it is so goddamn banal and<br />\nfeckless and useless.\"<br />\nAn ironic assertion? A madman's raving? The<br />\ntruth? Who can say? Lancelot Andrewes Lamar is<br />\nthe most complex, the most puzzling, and the<br />\nmost worrisome in a series of \"disconnected men\"<br />\nin Percy's novels. Like Binx Bolling in The<br />\nMoviegoer and Will Barrett in The Last Gentleman,<br />\nLance (as he is called) is out of sync with his time<br />\nand place—with reality, if you please. But Lance is<br />\nfurthermore a madman. Perhaps.<br />\nLance, unlike his fictional predecessors, does<br />\nnot readily elicit our sympathetic identification.<br />\nWhen we do recognize ourselves in him, they are<br />\nshocks we might rather deny. .That, however, is<br />\nnot so simple. For Lance, from the very beginning,<br />\nlinks himself to us. He makes us, quite literally, his<br />\ncaptive audience.<br />\n<br />\nfloni use controversy<br />\n<br />\nica a pre<br />\n-registration for the co-operation extended to us by the Dean of<br />\nE.,4111<br />\nStudents and Director of Student Activities<br />\nJay<br />\nClass, 11 students had Offices when they afford us room<br />\nspace for our<br />\nJ. agreed that<br />\nif 25 students many activities and programs.<br />\nster rae<br />\nMy second point, however, is being made<br />\nCO' gild would be cancelled. I<br />\nasked him not to cancel because it was not raised in the News-Letter article<br />\nkn<br />\n.ca<br />\nof at least 20 more last Tuesday. Our office questions the proposed<br />\njel'uNv how to register who room use policy especially regarding the<br />\nsuggested<br />\n1 ji ass. The<br />\nreply was that the guidelines for co-sponsoring events. In the past,<br />\n•w<br />\nWould his office know the Office of the Chaplain has been successful in<br />\nbslodents were from the bringing some prominent<br />\n, stimulating and timely<br />\nesides he stated that he speakers to thet Homewood<br />\ncampus due in part to<br />\ne<br />\nover the class. Legal? the co-sponsoring process. For example,<br />\nCesar<br />\n)ci 6' The<br />\nnight of the class 25 Chavez was brought to Shriver Hall a couple of<br />\nuo neared<br />\nto be greeted by a years ago by way of our office co-sponsoring the<br />\nA CLASS CANCELLED event 'with<br />\nthe Baltimore chapter of the<br />\nif we didn't get 25 AFL-CIO.<br />\nSpeakers such as<br />\n°,:ir.ii .asaY,,e„cl a solitary piano in an the economis<br />\nt from Columbia University,<br />\nI<br />\nstudents read the sign. Seymour Melman, the poet J ohn Ciardi,<br />\nWasirelY held off campus in<br />\na theologians Martin Marty and Harvey Cox, and<br />\nitltIloiiaecommod ate 15 students. Pete Seeger<br />\nand Arlo Guthrie the folk singers,<br />\n'the Nall was to no avail. could not have been sponsored<br />\nby our office alone<br />\nhe ad<br />\nbeen given to a campus because of financial considerations; and these<br />\nprograms might not have been done without the<br />\ni<br />\nrended meetings of the assistance of others. And yet no one can doubt<br />\n'cab, all lay empty...<br />\nthat individuals such as the above-named enhance<br />\n,e1r•<br />\nand<br />\nthe<br />\neducational atmosphere of the university.<br />\nJakie;<br />\nthis<br />\nwas a<br />\nfor Vo.<br />\nAll of us have a bit to<br />\nWe fear that the new room use policy could<br />\n0. as selfish, it's better to make it more difficult for the types of<br />\nforums that<br />\nwe feel well-rounded members of the ,Hopkins<br />\ncommunity should be exposed to. Another look<br />\nRay Rosenthal<br />\n,,,,fiss,<br />\nshould be given to the fee policy for co-sponsoring<br />\nvviie!<br />\ni ,, but rather as a matter<br />\nevents as well as other related factors that could<br />\n1.t 10 'Ice to make a couple<br />\nof possibly make it harder to enjoy the academic<br />\ntli ,<br />\ns,,ed room use policy<br />\nfreedom that has existed up to now.<br />\nall, it should be stated<br />\n,e<br />\nChaplain appreciates the<br />\nRalph Moore, Jr.<br />\n<br />\nki<br />\n<br />\nWalker Percy(and grandson),<br />\nIn Lance's dramatic monologue, Percy has<br />\nabandoned his characteristically smooth style.<br />\nNow, the words both repel and hold us. The<br />\ndignified desperation of the other novels has<br />\nbecome savage outrage. The subtle paring-knife<br />\nhumor has become a guillotine. And we are the<br />\npotential victims.<br />\nA fallen Southern gentleman and souring liberal<br />\nlawyer, Lance is stagnating in a modern age which<br />\naffords him neither direction nor identity. He is<br />\nthe \"Knight of the Unholy Grail,\" fading into<br />\nnon-existence, when suddenly the discovery of his<br />\nwife's infidelity leads him to a critical revelation :<br />\nthat there is a here and now, that it is intolerable,<br />\nand that he can do something about it. The actions<br />\nLance undertakes, and the plans he evolves for a<br />\nNew World, are based upon the \"Great Secret of<br />\nLife 'as he discerns it: 'God's secret design for<br />\nman is that man's happiness lies for men in men<br />\npracticing violence upon women and that women's<br />\nhappiness lies in submitting to it. The secret of life<br />\nis violence and rape.\"<br />\nYou may disagree with Ithat, perhaps violently.<br />\nIt is difficult, in any case, not to concur with<br />\nLance's (Percy's?) grim diagnosis of modern<br />\nAmerican life, especially his bleakly accurate<br />\ndepiction 'of our sexual maladies. The picture is<br />\nshocking, sobering—1 intolerable, Lance would say.<br />\nIf the present is intolerable, the past is even<br />\nmore so. Like many of us, Lance turns to the past<br />\nseeking a reaffirmation of the validity and<br />\ninevitability of his present condition: things just<br />\nhave to be this way. But the past only reveals<br />\nroads not taken, false triumphs, fragments shored<br />\nagainst his ruins. The present receives neither<br />\n<br />\njustification nor clarification from the past. For<br />\nLance, \"the mystery lies in the here and now,\"<br />\nand it grows ever more mysterious as one comes to<br />\nrecognize the overwhelming magnitude of that<br />\ncentral question : \"What is one to do with<br />\noneself?\" \\It may be the case that what Lance<br />\ndoes is in fact his undoing.<br />\nLance's story oscillates between a dark perverse<br />\ndespair and a strange frenzied hope. Reading it is<br />\nlike taking a wild roller coaster ride. As much as<br />\nyou might want to, you can't get off. And in the<br />\nend, you're left both exhausted and exhilarated,<br />\n•and perhaps a bit weak in the knees. That is<br />\nunderstandable. For, if nothing else, the visions of<br />\nLancelot will shake you. Maybe even scare the hell<br />\nout of you.<br />\nSuperfolks by Robert Mayer. (231 pp.; The Dial<br />\nPress. $3.95 in quality paperback format, $8.95 ill<br />\nhardcover.)<br />\nBy GARY SMITH<br />\n\"There were no more heroes.\"<br />\nSo opens \"Superfolks,\" Robert Mayer's comic<br />\nbook in novel form. His first published novel, it is<br />\na funny and often irreverent fiction, written for<br />\nadults who grew up hiding Dell comics in their<br />\ngeography text books, about the one superhero<br />\nleft, the greatest superhero of them all.<br />\nWho might this paragon of power be? Not<br />\nBatman and/or Robin. They were killed in a<br />\ntraffic smash-up. Superman? He's missing,<br />\npresumed dead, after a K ryptonite meteor<br />\nslammed into Metropolis. Wonder Woman? She's<br />\n,voluntarily given up her powers and become a<br />\nspokesperson for Women's Lib. The Lone Ranger<br />\ncaught an arrow in the back, and Tonto ran off to<br />\nWounded iKnee. Which leaves...<br />\n...A creation of Mayer's fertile imagination, one<br />\nvery close to Superman and going by the name of<br />\nDavid Brinkley. In any case, that's his civilian<br />\nname. He was sent to Earth as an infant from the<br />\nplanet Cronk, left a flourishing career as an ace<br />\nyoung reporter at a great metropolitan newspaper<br />\nfor broadcasting, but missed the smell of printer's<br />\nink. Now he's Oven up the airwaves, in both<br />\nsenses, and has his feet tied securely to the copy<br />\ndesk of his old newspaper. He's 42, married, the<br />\nfather of two children, has a nice wife and blue<br />\nhair. He's vulnerable to only one substance:<br />\nCronkite —and perhaps the ravages of time,<br />\nbecause, after eight years of retirement, his<br />\nsuper-powers are definitely on the wane.<br />\nHe has had attacks of weakness and has lost<br />\nconfidence in himself—as well as in the general<br />\norder. What could any superhero do faced with<br />\npolitical assassinations, racial disturbances,<br />\nVietnam and rampant street crime? The world has<br />\ncome of age and the problems seem<br />\ninsurmountable.<br />\nThat is how Brinkley feels until a fateful news<br />\nflash draws him unexpectedly out of his suburban<br />\nshell and back into the real world of crime and<br />\nviolence. But he has been devitalized so much that<br />\nhe crashes into atree in hisfirst attempt to leap tall<br />\nbuildings. Is there a criminal mastermind, and a<br />\nfoul plot to dispose of the last of the superheroes?<br />\nThe plot thickens...<br />\n\"Superfolks\" is a good, old-fashioned<br />\nmis-adventure story made contemporary by liberal<br />\ndoses of political intrigue, sex and some hilarious<br />\nexamples of celebrity malapropisms. Mayer<br />\nhandles it all with grace and ease.<br />\nAnd well he might. First novel or not, his name<br />\nought to have a familiar ring to it. For 10 years he<br />\nwas reporter and later a columnist for Newsday, a<br />\ngreat metropolitan newspaper. While he was there<br />\nhe won numerous awards for writing excellence,<br />\nincluding a National Headliners' Club award.<br />\nMayer seems to have kept his foot on the<br />\naccelerator the whole time in the story. It has a<br />\nsparkling beginning, just the slightest trace of<br />\nmiddle-pages spread and a clever end. The work is<br />\na whole, and a whole lot of fun, due to the<br />\nauthor's skill and imagination. I His gibes at the<br />\nnews industry and other writers have punch and<br />\nstyle, especially the parody on Norman Mailer's highly personal and often excessive style of<br />\nreportage.<br />\n\"Superfolks\" is the kind of book that could give<br />\nlightweight fiction a good name. It is some of the<br />\nbest of recent efforts at the genre, written to<br />\nentertain. Give it a read. It's far better than any<br />\nnight of the week on TV.<br />\n<br />\n\fpage 8'<br />\n<br />\nnews-letter<br />\n<br />\napril 29, 1977<br />\n<br />\nThe new PALANTIR is out! At the Union Desk now.<br />\n\"411.\"OM'\"OW .11111. .11111..00..1110..1/11. .111111. AMP..4116111.<br />\n<br />\n.41ills Amu. am..101. Am.<br />\n<br />\nONE WEEK AIR CHARTERS FROM<br />\n1 !BALTIMORE/WASHINGTON<br />\nINTERNATIONAL<br />\n'CALIFORNIA<br />\nFrom<br />\n<br />\n-..t)f sacred<br />\n<br />\n. ;the altar<br />\n<br />\nThee<br />\n<br />\noutrad„.PhlIei<br />\nretràhingly<br />\n<br />\nI $229<br />\nPerlaerson — Air Oilly<br />\n<br />\ncome<br />\n<br />\nNON-STOP VIA AMERICAN AIRUNU<br />\nDepartum July 8ll'Augu.st<br />\n<br />\n0<br />\n<br />\nThe low price includes round trip jet transportation.<br />\nI appropriate meals and drinks aloft and air taxes. Ideal I<br />\nA forthe person who likes to go on his own or who will<br />\nI stay with friends and relatives.<br />\n<br />\n—Max Reed,{,i6+;*/ York baiiy<br />\n<br />\n\"Pyre gold...<br />\npus and amusing. The screen<br />\n' a Jackson is superb.<br />\nia, '<br />\nSandy Dennis06firii. steals the show,\"<br />\n<br />\nW<br />\n<br />\n—Judith Crlst, Sat day Rev,i.ew<br />\n<br />\n{pG}<br />\n<br />\nBRUT PRODUCTIONS PRESENTS A GEORGE BARRIE — ROBERT ENDERS PRODUCTION<br />\n<br />\nGLENDA JACKSON MELINA MERCOURI GERALDINE PAGE SANDY DENNIS<br />\nANNE JACKSON ANNE MEARA SUSAN PENHALIGON ,„\"NASTY HABITS\"<br />\n<br />\noho<br />\n<br />\nsit,rring<br />\n<br />\nEDITH EVANS<br />\n<br />\nosHildegorde JERRY STILLER 05 PP Pr.es, RIP TORN as moxynikon ELI WALLACH 0,monu9nor<br />\n<br />\nMusic by JOHN CAMERON Executive Producer GEORGE BARRIE adopted from The Abbess of Crewe- by MURIEL SPARK<br />\nWritten ond Produced by ROBERT ENDERS Directed by MICHAEL LINDSAY-HOGG Color by Technicolor (-s-<br />\n<br />\nNOW AT<br />\nWESTVIEW<br />\n<br />\nROTUNDA CINEMA VILLAGE CAMPUS HILLS CINEMA<br />\n40th St. and Keswick Rd.<br />\n235-1800<br />\n<br />\n1RRING PLAZA CINEMA<br />\n<br />\n6026 Balta. Nat'l. Pike I<br />\n788-7311<br />\n<br />\nReisterstown<br />\n1315-0744<br />\n<br />\n).t.1...fs<br />\n<br />\nRt. 22•Campus Hills Shp. Ctr.<br />\n<br />\nCINEMA HARUNDALE<br />\n<br />\nBeltway Exit 30<br />\n668-3111<br />\n<br />\nHarundole Mall Shp. Ctr.<br />\nSO. 1-6055<br />\n<br />\n1<br />\n<br />\n137Q0105<br />\n<br />\n_NORTHPOINT PLAZA<br />\nBlhvy. Ext. 40 Northpoint Hr. Merritt<br />\n288-9294<br />\n<br />\nI ALSO AVAILABLE<br />\n<br />\nWe have special reduced hotel and rent-a-car rates so<br />\n;that you can- plan your own California vacation in any of<br />\nV thirteen great California cities.<br />\n<br />\nI ESCORTED PACKAGE including San Francisco, i<br />\n. I Monterey and Los Angeles with deluxe accommodations, a<br />\n& baggage transfers and handling, deluxe motor coach;<br />\nI transpatation'and sightseeing, full day at Disneyland and,<br />\nAround trip air transportation, S439 per person. double oc- 1<br />\n:cupancy. BURCH TRAVEL LTD<br />\nv<br />\ni<br />\n<br />\n3900 N. Charles St.<br />\n. Oust up the street)<br />\n<br />\n467-3901<br />\n<br />\nIt<br />\nII<br />\n.11111M. AVM. +=Do offiNN. 41111110 41 1 1 P. .1 1 1 1 ,•<br />\n401111. .1111.<br />\n<br />\nIOW .1111. 41111110.<br />\n<br />\nThe<br />\nBLUE KEY SOCIETY<br />\nneeds people to<br />\ngive summer tours<br />\n<br />\nFEATURive-:<br />\nCLIill BA DOMCES<br />\nWIN DHRIDG-E.<br />\n<br />\n4<br />\n<br />\nSPRINGWIND<br />\n<br />\n4,<br />\n114'<br />\n'4.4<br />\n44<br />\n:.<br />\n<br />\n4_<br />\nEVENT<br />\n<br />\n...................<br />\n<br />\nof the homewood<br />\ncampus. If you are<br />\ninterested drop a<br />\nnote with your<br />\nname box and<br />\nphone number in<br />\nbox 784.<br />\n<br />\n\fapril 29, 1977<br />\n<br />\nYOU CAN STILL<br />\nTRAVEL & STUDY<br />\nIN EUROPE<br />\n<br />\nEUROPEAN FLIGHTS<br />\nProvides the academic<br />\n<br />\n.1<br />\n<br />\nwith<br />\nTHE TOWSON STATE UNIVERSITY MIME TROUPE<br />\n<br />\nTonight at 8PM<br />\n<br />\nTRAVEL ARRANGEMENTS<br />\nAVAILABLE FOR<br />\nFOREIGN STUDY<br />\nPROGRAMS THIS FALL<br />\n<br />\nLet us serve you.<br />\n41<br />\n<br />\n\"AN EVENING OF MIME\"<br />\n<br />\nGEAR ED TOWARD<br />\nINDIVIDUAL NEEDS<br />\n<br />\nair travel arrangements.<br />\n<br />\n.1. .1.<br />\n<br />\nThe Office ofSpecial Events<br />\nPresents<br />\n<br />\nCOLLEGE CREDITS<br />\nOF FERED<br />\nFOR<br />\nINDIVIDUAL STUDY AND<br />\nTRAVEL THIS SUMMER<br />\n<br />\ncommunity with discount<br />\n<br />\nSave<br />\n<br />\npage 9<br />\n<br />\nnews-letter<br />\n<br />\nShriver Hall Auditorium<br />\nFREE ADMISSION<br />\n<br />\nThis Ad-Bring This Ad-Bring This Ad-Bring This Ad-Bring This AO<br />\nco<br />\n<br />\nTUITION AND<br />\nROUND TRIP<br />\n<br />\nBe Flexible<br />\n<br />\nsits<br />\nvcordmasters<br />\ndiscount records<br />\n<br />\nAIR TRANSPORTATION<br />\nEAST COAST<br />\nMID WEST<br />\nWEST COAST<br />\n<br />\nCALL US LAST<br />\n<br />\nS350.00<br />\nS365.00<br />\nS455.00<br />\n<br />\n&topes<br />\n<br />\nIA<br />\n<br />\nCALL TOLL FREE:<br />\n<br />\nToll Free 800-223-1722<br />\n<br />\n800-223-1722<br />\nNEW YORK 212-986-7624<br />\n<br />\n•<br />\n<br />\nA<br />\n<br />\nThe<br />\nchallenge.<br />\nYour challenge is to construct the mystery<br />\nword in the boxes below. To do this you must<br />\nfill in the correct missing letter in each of the<br />\nwords listed in the columns.Then transfer the<br />\n<br />\nmissing letters to the corresponding numbered boxes. Keep an eraser handy—it's not<br />\nas easy as it looks!<br />\n<br />\nThe Rotunda<br />\n711 West 40th Street<br />\n366-1250<br />\n<br />\nFULL LINE RECORD STORE<br />\n••• with a complete<br />\nstock of classical, rock,imports,<br />\npopular& --jazz!!!!<br />\n<br />\n\"<br />\n\"<br />\n1 4111111/'<br />\n<br />\nI<br />\n<br />\nDISCOUNT I<br />\nPRICES<br />\n<br />\nEXTRA DISCOUNT<br />\noff on anY<br />\nIpis or tapes<br />\n<br />\nSALE ITEMS I<br />\nEXCLUDED<br />\n<br />\n•Li_<br />\n<br />\nWILii ullS au— --<br />\n<br />\nONE AD PER CUSTOMER<br />\neffective this Fri.(April 29) thru<br />\nThurs. May 5<br />\n<br />\nUBS 1977<br />\n4. FAC S<br />\nOAST<br />\n5.<br />\n6. TEA_ _S<br />\nILS<br />\n7.B<br />\n<br />\n8. TRAI<br />\n9. QU____TE<br />\nio. BR WN<br />\nAILS<br />\n<br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br />\n<br />\nPABST. Since 1844.The quality has always come through.<br />\n1976. PABST BREWING COMPANY Milwaukee, Wis., Peoria Heights. III., Newark, N. J.. Los Angeles. Calif . Pabst, Georgia.<br />\nN011VE1E1313D (Nom AJoisAvy<br />\n<br />\nCharter Tours<br />\nD.C. & Bah. Departures<br />\n1111111111111E•111111111311111■111111111101111111••11111111•111•11<br />\nfrom<br />\n3 week 'charters<br />\nWeekend<br />\nkend<br />\n0_nis<br />\n)<br />\nDepartures.<br />\npars via3 B<br />\n.<br />\n•<br />\nL.aledonuianAirways<br />\nair only<br />\nABC & TGC<br />\n111111110•1111111111111111•1111111111111111111111111111111N1111111•111111<br />\nfrom<br />\nParadise Island<br />\nHoliday Inn<br />\n<br />\n1.2.1<br />\nLondon,<br />\n<br />\n289<br />\n<br />\nBahamas<br />\nMexiC<br />\nHawaii tilJtiodnalfialnwa7afrlica<br />\n<br />\n$299<br />\ne315<br />\n<br />\nJuly—Nov - 3299 '<br />\nMar—Apr<br />\nl7 w ke nd'359<br />\nd e par tures<br />\nAir, Hotel, Tax Pied m<br />\nall inclusive<br />\nOTC<br />\neeo n t Aidin s<br />\n1111111•111•••111_11111111111•111••111••••••1111•1111•1111111•<br />\nAcapulco $315-9 depar- from<br />\ntures Feb-Dec. Tri-Mexicio<br />\n14066-4 departures July-Oct ,9<br />\nLunavdia si a3 jauly/P22uNto<br />\nAir, Hotel, Tax American & United Airlines • all inclusive<br />\nOTC & ITC<br />\n111111111111111••111111111111111•1111111111111111111111•••1111111•111<br />\nfrom<br />\n_ _ Waikiki Village '429<br />\nisllm<br />\n4a9<br />\n6e4-3D499 $345<br />\nV<br />\nrtur<br />\n<br />\nm<br />\n<br />\nAmerican & United Airlines<br />\n<br />\nABC & OTC<br />\nonill<br />\ny MINN<br />\nu ll<br />\n1111111111••111111111111• 111111111111•1111111111111• 1111all<br />\n<br />\nIreland<br />\nPlease call<br />\n<br />\nBURCH.<br />\nTRA:mir„„.<br />\nLTD<br />\nv<br />\n<br />\n467-3900<br />\n<br />\n\fpage 10<br />\n<br />\nnews-letter<br />\n<br />\nYoga Classes at Iloinewood starting<br />\non May 5th at 6:00 P.M. Ray<br />\nRosenthal, M.D. - Johns Hopkins<br />\nSchool of Hygiene and Public health,<br />\nwill offer a Hatha Yoga course that,<br />\nwill meet for four weeks, to be held:<br />\noutdoors on the Homewood Campus..<br />\nAll those interested should meet in.<br />\nfront of the Hopkins Student Union<br />\nat 6:00 P.M. sharp. Bring a blanket.<br />\nwear loose fitting clothes and try not<br />\ndo eat at least 2 hours before the,<br />\nclass. THE CLASS IS FREE! and last<br />\nan hour and twenty minutes.,<br />\nInstruction in Yoga postures,.<br />\nbreathing practices, meditation and.<br />\ndeep relaxation as taught by Sri<br />\nSwami Satchidandnda, founder.<br />\ndirector of the Integtal Yoga<br />\nInstitutes (local institute - 2445 Porter,<br />\nStreet - Washington , D.C. 20008 Tel.(202) 244-5538.<br />\nAttention PRE-LAW STUDENTS:<br />\nMike Kelley, Dean of University of<br />\nMaryland Law School, will give a Law<br />\nDay adress entitled \"Cynicism..<br />\nLawyers, and the Law<br />\non,<br />\nMoriday May 2, at 3:00 P.M. in the,<br />\nGarret Room of the Library. Dr. F.<br />\nDierman will discuss important<br />\ninformation concerning law school<br />\nadmissions and application<br />\nprocedures. Please attend.<br />\n<br />\nThe Return of the<br />\nThin White Notes<br />\nScatter plots for the applicants of<br />\nthe medical school entering class of<br />\n1978 are in the hands of the Health<br />\nProfessions Recommendation<br />\nCommittee members and the Office of<br />\nAdvising and Counseling, Homewood<br />\nHouse.<br />\nLabels are also now available for<br />\nthe medical schools to which you are<br />\napplying. Please bring your list of<br />\nschools by Miss Linda Garren's office,<br />\nHomewood Ilouse, to pull your labels<br />\nand receive instructions as to the<br />\nmailing of y ur recommendation<br />\nletters.<br />\nThe B.I.A. is seeking new members.<br />\nForms are available at the gym and arei<br />\ndue Mon. May 2, at 5 P.M. Interviews<br />\nwill be held Mon. evening. For details<br />\n- 243-2305.<br />\nThe B.I.A will award the G. Wilson<br />\nShaf fe,r Award on May 7th.<br />\nNominations of non- varsity seniors<br />\nwho have been active with athletics at<br />\nHopkins will be considered. Due<br />\ntoday at 5 P.M. in the gym office.<br />\n<br />\nFINALS BAR OF THE WEEK--MAURY'S 25th & Howard<br />\n4.44~44$11~41104,4P•INS4•4-#44<br />\n+111-1N4<br />\n,<br />\n4~4<br />\n,<br />\n.P.P.....-44P4P4A1<br />\n,<br />\n<br />\nliniversiN SandvAchShoppe and Defi<br />\nAl Lamp Crab Cake,<br />\nGeouiae ICodiar Co/aid %of<br />\nDdicioes Roast Bort<br />\nVnia Baked Hero<br />\nVarious Cold Cots<br />\nOwns(Swim Provolooe, Meemele0<br />\nKokes Hot Dogs<br />\nCaesars<br />\nParty Tarr(srecili oldie)<br />\nPlaza<br />\nHowe Made Dome(Chem Cake)<br />\nIce Crew<br />\nSelect Grocay Items<br />\nNeale<br />\n<br />\nRESTAURANT & CARRY OUT<br />\nUPNVIERSITY PARKVVAY<br />\nMem 467-6112<br />\nAT T. PAUL<br />\nNI • Pei: 9:30 - 7:00<br />\nWSW. WHVIORIBITY OP APT..<br />\nSat 930 - 2:00<br />\nDomed Soadays<br />\nFREE SODA WITti TIM A1) AND<br />\nPURCHASE OF $1.00<br />\n<br />\nTHINK SUMMER...<br />\nTowson State University<br />\nSummer Sessions<br />\nOver 500 graduate and undergraduate<br />\ncourses will be offered in three convenient<br />\nsessions.<br />\nFirst five-week day session:<br />\nJune 22-July 26<br />\nSecond five-week day session:<br />\nJuly 27-August 30<br />\nSeven-week evening session:<br />\nJune 22-August 10<br />\n<br />\nThe JHU Gay Caucus will hold<br />\nit's last meeting of the year, Tuesday,<br />\nMay 3, at 8:30 P.M' in Conf. Rm. A<br />\nof the Student Union. All members<br />\nare urged to attend. For more<br />\ninformation, call 366-0488.<br />\nAny undergraduate interested in<br />\nparticipating in the Dept. of Romance<br />\nLanguages' experimental teaching<br />\nprogram (drill and conversation of one<br />\nhour of French Elements per week)<br />\nduring the Fall semester should<br />\ncontact Mrs. Sullivan or Mrs.<br />\nBirnbaum (Gilman 221) on Monday,<br />\nMay 2, 2-4:00 P.M. or Wednesday<br />\nMay 4, 10-12:00 A.M. Requirements: a<br />\ngood knowledge of spoken French<br />\nand of grammatical structures;<br />\ncompletion with a grade of A or B of<br />\nthird -year college French or.<br />\nequivalent.<br />\n<br />\napril 29, 1977<br />\n<br />\nOn Tuesday, April 12, a panel of the<br />\nUndergraduate Academic Ethics<br />\nBoard met to hear charges against a<br />\nstudent who had been accused of<br />\ncheating on an Introductory<br />\nChemistry examination (Chem 3.2).<br />\nThe student pled guilty to the charges<br />\nand received as penalty failure in the<br />\n<br />\nJoyce Carol Oates' will be reading<br />\nselections from her collected<br />\nssortment of fiction in Remsen 1,<br />\nFriday, April 29, at 8 P.M.<br />\n<br />\ncourse.<br />\n<br />\nhe Blue Key Society, in<br />\nconjunction with the Admissions<br />\nOffice, will be offering summer tours<br />\nto prospective students and other<br />\ninterested persons. If you are planning<br />\nto be in Baltimore for the summer (or<br />\npart of it) and would like to give tours<br />\nof the Homewood Campus, contact<br />\nCindy Simon at Box 784 or at<br />\n825-0483 and leave your name, box<br />\nand phone number. ,All Hopkins<br />\nundergraduates are invited to<br />\nparticipate.<br />\nA blue and yellow felt flag<br />\nbelonging to the Alpha Chi Sigma<br />\nChemistry Fraternity was taken from<br />\nroom 101 in Remsen Hall on Friday<br />\nnight, April 22. If it is found, please<br />\nreturn it to us in the Chemistry<br />\nDepartment. Remsen Hall. No<br />\nquestions asked.<br />\n<br />\n•<br />\n<br />\nWill the person who won the golf<br />\ngame with the Chaplain at the<br />\nChaplain's Office Auction please come<br />\nto said office to claim it? Chet has his<br />\nclubs ready and polished.<br />\n<br />\nThe International Studies Forum<br />\nwill hold a vital, but short, meeting to<br />\nelect officers for next year. Meeting<br />\nwill be in Gil. 42, at 7 P.M., on<br />\nTuesday, May 3.<br />\nIf you are a voting member, or just<br />\ndig the Gatehouse scene, come on<br />\ndown to the annual News-Letter<br />\nelections. The action will begin at<br />\n5:30 pm Eastern Standard Time in the<br />\nGatehouse on Tuesday afternoon<br />\n(May 3, 1977).<br />\n<br />\n•••<br />\n<br />\ndasstheds<br />\n<br />\nBURGH TRAVEL LTD<br />\n<br />\nTYPING - Beautiful Work.<br />\nSpecialty: Medical<br />\nTerminology. Call<br />\nS unday-Thursday; 486-8337<br />\nFEMALE ROOMMATE<br />\nWANTED. Quiet townhouse<br />\nnear Hopkins. Call 532-9159<br />\nor 358-3710.<br />\n<br />\n3900 N. Charles St.<br />\n467-3900<br />\n<br />\nI?<br />\n<br />\nWe enjoy helping the<br />\nr/ Hopkins Community fwith<br />\ntheir travel plans.<br />\n•<br />\n<br />\nSPANISH by experienced native<br />\nteachers - All levels, all ages<br />\n366-2056.<br />\nCONSUMER ACTIVIST: Work for<br />\n.social change and earn a living too.<br />\nMaryland Action is interested in<br />\nstudents, college graduates and<br />\ncommunity minded individuals to<br />\nfill canvas-organizing-research<br />\npositions. Call 933-8064.<br />\n<br />\n—•<br />\n<br />\n.ROBINSON'S GORSUCH HOUSE<br />\n11 GORSUCI1 AVENUE 235-2744<br />\n<br />\nTwo students want to take care<br />\nvacationer's home during th<br />\nsummer months Call:366-5286.<br />\n<br />\nrawty-dECORATEd1<br />\nNEW MIANAgE1MIENT!<br />\n<br />\n1<br />\nDear May, At 20 you may<br />\nhay e passed your prime but - I<br />\nstill love you, anyway. Happy.<br />\nbirthday, babe. IBID.<br />\nFran<br />\n<br />\nfEATURiNg...<br />\ngREEk & AMERICAN CUISINE<br />\n<br />\nCOME IN ANd TRy OUR<br />\n*<br />\n*<br />\n•<br />\n*<br />\n<br />\nFlaming shiskabob<br />\nGreek salad<br />\nPastitsio mousaka<br />\nBaklava<br />\n<br />\nGRE • GMAT • SAT<br />\n<br />\n..00ms available for private parties<br />\n--- Banquets --- Catering ---<br />\n<br />\noriginal study materials<br />\nsmall groups • tape center<br />\nsummer & compact course<br />\n<br />\nCALL<br />\n(202)<br />\n244-3010<br />\n<br />\nNONDENO.MhVAT/ONAL<br />\nOFFICE OF THE CHAPLAIN<br />\n<br />\nEDUCATIONAL CENTER<br />\n,<br />\n4201 Connecticut Avenue, N.W.<br />\nWashington, D.C. 20001<br />\n<br />\n\"THE SUNDAY EXPERIENCE\"<br />\n<br />\npresents<br />\n<br />\nJOHN GA ('II BOOKSHOP<br />\nB41 TIMORES LARGEST<br />\nBOOKSTOR<br />\n<br />\nII<br />\n<br />\nRegistration by mail will continue through<br />\nMay 16. For additional information, call or<br />\nwrite:<br />\n<br />\n\"GENETIC RESEARCH AND<br />\nTHE RECOMBINANT DNA CONTROVERSY\"<br />\n<br />\n4<br />\n<br />\nDivision of Continuing Studies<br />\n321-2022<br />\n<br />\nwith<br />\nDR. PHILLIP HARTMAN-Biology Department, J.H.U.<br />\n<br />\n11<br />\n<br />\nGraduate Studies<br />\n321-2501<br />\nTowson State University is an Equal Educational Opportunity Institution in compliance with Titles VI and IX.<br />\n<br />\n1<br />\n<br />\n41111P. .11111. .111111.. 411111.<br />\n<br />\nDR. DONALD BROWN-Carnegie Institute<br />\nDepartment ofEmbryology<br />\n<br />\nI<br />\n61:<br />\n<br />\n11,<br />\n<br />\nMR. TED HO WA RD-Co-Director of The People's<br />\nII<br />\n<br />\nSUNDAY,MAY 1, 11:00 AM<br />\nLISTENING - VIEWING ROOM<br />\nLEVERING HALL<br />\noe.S82.562..S2.525i..S882.5662.56662.Se.5825e..5688254.S668688686esoesaes<br />\n<br />\n3322 .Grecourtount Awe.<br />\n46 74344<br />\nUSED AND RARE<br />\nOLD AND OUT—OF—PRINT<br />\n.411M.<br />\n<br />\n+Mr<br />\n<br />\nROSINESS<br />\n<br />\nBusiness Commission Washington, D.C.<br />\nDR. RICHARD CONE-Biophysics Department, J.H.U.<br />\n<br />\nor-te;)ti<br />\n<br />\n.6111M.<br />\n<br />\nOPPOP TtiNiTN<br />\n<br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\nFranklin Street<br />\nBoston,Mass. 02110<br />\n<br />\n310<br />\nL<br />\n<br />\n\fapril 29 1977<br />\n<br />\nnews-letter<br />\n<br />\npage 11<br />\n<br />\n.41=1111111<br />\n<br />\nSenior Class Film Series<br />\n<br />\nTAe. S.0.P;)11)<br />\n4 Lit (451-rwk?re.6<br />\n<br />\npresents<br />\n<br />\nTib: Oa(<br />\nConccAT<br />\n-lb be 40.0,6 &pie),46/ 9,1(111?<br />\n'ReoT. glut tk-Gjt Cs) s<br />\nt,.)001A mr:61<br />\ni•<br />\nRkE.,-to see,<br />\nkelovi,<br />\n0,1i tic pAeAvt1w I--thlot 5.<br />\n.Y.1 CDraitO<br />\n<br />\nJk31ot1e,61-<br />\n<br />\natlomick NthrA S%11;f1<br />\nIltlec-Tko- teAto<br />\nGvJult<br />\n•<br />\n<br />\nch;p•sa.<br />\ne*BpecoAleij<br />\n<br />\nPols<br />\n<br />\ntofireA<br />\n<br />\nFor questions<br />\nor comments<br />\ncall<br />\nRandy Randazzo<br />\n467-5052<br />\n<br />\nKorn<br />\n?Agit PolvAei<br />\nSew<br />\n<br />\n53:x IAAYJ<br />\nSATAJ<br />\n<br />\nFRI. & SAT.<br />\nApRil 29 & 30<br />\n<br />\nShaffer 3<br />\n<br />\n7:00<br />\n9:00 & 11:00<br />\nAdmissioN s1.00<br />\n<br />\ncotl,tS;&e.lotwn<br />\n<br />\nTt)kP-S<br />\n<br />\nCAT OUT 111E<br />\n•<br />\nlick% RebtOtot Cow.fl12<br />\nIt& loclibt Iwo<br />\n1.A<br />\n6.1.464. owl 1200,A, bl Does mdi,1 them.114s,<br />\n<br />\nSmioRs $.75<br />\n<br />\nThe Student Council<br />\n• Selections Committee<br />\nwill hold selections for<br />\nfour C.U.S. members<br />\nfor 1977-1978<br />\nThe C.U.S. (Committee on<br />\nUndergraduate Studies) is a<br />\npolicy-making committee<br />\n<br />\njumoshcA“<br />\n\"NilE ON...11-IE<br />\nCliE4ArEAKE'<br />\n<br />\nconsisting of five faculty<br />\nmembers & four students.<br />\nSign up for interviews 6:30 p.m.<br />\nTues., May 3,1977 If you have<br />\nquestions , please contact Steve<br />\nLovejoy 523-2461 or Patrice<br />\nGallagher 366-4234<br />\n<br />\n-<br />\n<br />\nFINAL 4ALE. PATE MK<br />\n<br />\nAT1CKEE<br />\nf4#(5. 'A<br />\n<br />\nIA VNION<br />\n<br />\notsave<br />\n<br />\n6$<br />\n<br />\n\fMaking the Fair<br />\nSafe for violence<br />\nBy ERIC GARLAND<br />\nThis year's Spring Fair didn't seem to bring as many<br />\npeople to Hopkins as in the past; it also escaped a rainy<br />\nwashout for three straight days. What the Mardi Gras did<br />\nget, however, was a mixture of violence and police<br />\nactivity that, in retrospect, has been unusually absent<br />\nfrom past fairs.<br />\nNMth anywhere from ten to forty thousand people on<br />\ncampus for a day, drinking beer and smoking dope, taking<br />\nninety-degree heat and waiting in long lines, it should be<br />\nexpected that a few among the crowd will get punchy-by<br />\nlate afternoon. Especially those few that happen to be<br />\nragged local punks or overeager lacrosse players—it<br />\ndoesn't take too many Schlitz lights or poorly-chosen<br />\nwords to bring out the worst in people.<br />\nThe knifing incidents in the freshman quad are general<br />\nknowledge: one Hopkins student slashed and a teenager<br />\ncut in a back-and-forth brawl around the ride area. Along<br />\nwith this well-known melee, there were a number of<br />\nminor scuffles. One in particular took place about a<br />\nhalf-hour before the stabbings, precipitated by the same<br />\ngroup responsible for the later scuffles.<br />\nCharacterizing the Friday night fight was a uniform<br />\nlack of sensible action by the campus police. Those<br />\non-hand for the entire affair, and others involved in<br />\nisolated fistfights, had common complaints about the<br />\nfumblings of the blue-uniformed security force. After the<br />\ninitial outburst in the freshman quad—rather serious with<br />\none man ganged up on by local youths—the campus cops<br />\nfailed to respond to repeated warnings and identifications<br />\nof the troublemakers. Instead, they waited for the arrival<br />\nof city police, making no attempts at crowd control and<br />\nstaying clear of those pointed out as brawlers, the ones<br />\nwho would later start the knife fights. \"The cops were<br />\nIntimidated more. than anything, just scared,\" said one<br />\nobFrvor.<br />\n<br />\nor-<br />\n<br />\n%en the city police got to the freshmen quad they<br />\nreceived little help from campus security in the way of<br />\nrounding up the instigators. Outside of the people stabbed<br />\nor those who actually fought with the city police, the<br />\noriginal gang that had been repeatedly identified to the<br />\ncampus police was relatively ignored (in fact, they<br />\nreappeared Sunday at the Fair, ready for more<br />\nencounters.)<br />\nOnce the city police cleared the amusement area in the<br />\nfreshman quad, they toliped.off a confused evening by<br />\nproceeding to the Gilman Quad, where a jazz band had<br />\nbeen scheduled for a 9:30 show. The band had moved<br />\nindoors to the Glass Pavilion, apparently for fear of rain. •<br />\nUnfortunately, there was little notice given to those<br />\n<br />\nmilling about the Quad, wondering what had become of<br />\nthe performance. The police then came into the Quad,<br />\nsaw the crowd of people that seemed to be loitering for<br />\nno reason, and with the ride-area hubbub fresh in their<br />\nminds, went about kicking everyone out of the area.<br />\nNumerous complaints were voiced about the over-reaction<br />\nof the police, of excessive hassling of those that happened<br />\nto have a plastic beer cup in hand.<br />\nThus the Mardi Gras, with its theme of insanity amid<br />\nrevelry, had an offshoot of violence that was grossly<br />\nmishandled at the start, and then typically over-reacted to<br />\nat the end. Next year's Fair will have that to go on.<br />\n<br />\n\f", "format": "basic_html", "processed": "riLioney<br />\ner<br />\npart two<br />\nPornography<br />\nand Society<br /><br />\nI<br /><br />\nPOCKET<br />\nBOOKS<br />\nJennifer bi<br /><br />\nLast week, in Part One of the News-Letter<br />\ninterview, staff member Rhona Lyons<br />\ndiscussed<br />\nwith Dr. Money the problems<br />\nof gender identity and differentiation. The<br />\nWorld-famous researcher, never at a loss for<br />\nwords, drew on the wealth of his first-hand<br />\nexperience in the frontiers of s:Aology. This<br />\nweek, the interview concludes with Dr.<br />\nMoney giving his observations on<br />\npermissiveness,\" pornography, sex offenders,<br />\nand ethics. The conversation begins with Dr.<br />\nMoney talking about change.<br /><br />\nOK to enter here? What does that indicate? Read on...<br />\nNature<br />\nlien I think about (big feasting and celebration when the families got masturbate and to have visual imagery of it.<br />\nmakes sure about that because she wants the race to<br />\nChange 1 usually think about such an easy change, when together. In that society, which was really dependent on<br />\nall is said and done,as the change to the metric system.<br />\nreproduce. And if you don't think of it yourself then it<br />\nthe family as a farm or fishing unit, if you didn't produce<br />\nWhich has taken ten years?<br />\na baby between you, then your family didn't want you to comes to you in a dream. Well, all of this adds up in the<br />\nYes, and you get a great deal of resistance to it. But the get married. Well we don't get people living together long run to say that the big issue, as many people know,<br />\n‘vaY it's done is that it takes a long period of preparation today while they're at college in order to see whether in vending a magazine like Hustler is the issue of the,<br />\nin Which you get the practical things in order, the they can produce a family or not, but it's the other way<br />\nimplications and freedom of expression. For once you<br />\nmachines that you weigh and measure with, and the costs around. They're using that system because they don't<br />\nallow privilege to certain segments of the population to<br />\nof the change over. You educate the public in how to have to produce a family until they're ready to begin their censor and discipline what others will do, 'then you've<br />\nmanage the new system, which means partly you train parenthood. People nowadays are using the possibility of layed the groundwork that can allow that principle to<br />\nthem at school, partly you train the older ones on separating the beginning of your recreational sex life, and creep until you have a dictatorial society. We've had<br />\nplenty of evidence in the twentieth icentury that you.<br />\ntelevisign or through the public media, and then one night the beginning of your procreational sex life. Now that<br />\nat midnight<br />\nneed great care to protect the growth of freedom. It can<br />\nit's D-Day and anybody who doesn't really isn't permissiveness at all, it's just simply a change<br />\nconform after that is in some way or another punished. of custom...another thing you can say about be exterminated iso easily.<br />\nThey pay some sort of a penalty. Well that's the best way permissiveness is that for probably as far back as history Recently in Manhattan there has been a flurry of<br />\ncontroversy about pornography. ! Do you feel that<br />\n10 bring about change in society. It's so rational that we has been recorded, when people get I older and they see<br />\npornography, in the form of peep shows, Magazines, and<br />\nardly ever do it.<br />\ntheir own end coming, they become doomsayers and<br />\nrioreYOU?consider Western society permissive, and getting they see the young generation as always going to hell, prostitution, is a victimless crime, or does it hurt the<br />\n,so<br />\n(quickly. But that's been going on since time immemorial. community as the critics content?<br />\nPermissive for what?...If you're talking about sex, I think How do you feel about the case of Larry Flint, publisher Well, aren't you just playing with words, the same as they<br />\nwhat's happening is that we are, with great difficulty, of Hustler magazine?Is his publication totally without are? The real issue is not whether it's a crime or whether<br />\nthere are victims or no victims, the real lissue is are you<br />\nadjusting ourselves to the Birth Control Age, which didn't social redeeming value? Should he be in jail?<br />\ngoing to break the taboo or are you not?<br />\nget started until 1930. For it was in the late 1920's that I think the first part of that answer is that there is a<br />\nthe .<br />\nyou feel it should be broken? Should it exist at all?<br />\nDo<br />\nlatex process was invented and that was the first time pretty substantial body of evidence that sex alone doesn't<br />\nThe<br />\ntaboo on sex? Well, when you carry it to its extreme<br />\nthat You<br />\ngot really effective birth control, the condom, do you any harm. However,it is like just about everything<br />\nhave the Inquisition which (we had three and four<br />\nyou<br />\nthat<br />\npeople would use because it didn't interfere with else in human life that is the use that it is put to differs<br />\ncenturies ago, under which circumstance you torture<br />\ntheir sexual gratification. It could be predictable, that you riccording to the principles you have. So, you can show<br />\npeople until they make a false confession that they had a<br />\nw ouldn't get pregnant if you used it, but perhaps even pictures of a crucifixion in order to warn people not to do<br />\ndream of cohabiting with the devil and then you burn<br />\ninore important is that it was cheap enough to be mass it, but you could also use it as lessons in how to do it. I<br />\nat the stake. So, when you overdo the strength of<br />\nthem<br />\nProduced and mass distributed. Everybody knows that use that example because in churches we teach children<br />\nthe taboo it carries you to extremes which are, by I think<br />\nafter 1930, we got the Pill and then the I.U.D. was quite vivid information about how to commit a<br />\nrie<br />\neverybody's 'agreement today, beyond all the bounds of<br />\ndiscovered and brough back into use. Everybody knows crucifixion, but we have a set of moral standards that go<br />\nat We still haven't reached the end of the road on with- it, as well as religious ones, so they don't come<br />\ncommon sense. Now, the basis of the taboo is that it<br />\nrestricts you in something that you do. Nobody's ever<br />\nontraceptive methods, especially those which can be home crucifying their dolls in crucifixion games. By<br />\nUsed<br />\ncounted up all the ethnic societies on earth to find out<br />\nby the mule. Research is .stil under way for that. .contrast on television we have a general cultural<br />\nwhether every single one of them does have a taboo on<br />\ncertainly<br />\nwar<br />\nand<br />\nand<br />\nglorifies<br />\nkilling<br />\nundercurrent<br />\nthat<br />\nMY Point is that from 1930-1977 is not quite half a<br />\nsomething, however it is clear that the taboo of one<br />\nutury yet, and that's not very much time for a change doesn't require to be censored off the television screen or<br />\nsociety is different from that of another. Some people<br />\nth at'S so momentous that it's equivalent to the discovery the magazine pages. So we get the message across to<br />\n°f the usage of fire, because it really hits every person's<br />\nhave a taboo on whom you are allowed to use your vocal<br />\nchildren growing up that it's a good thing to play war<br />\nlife.<br />\nwith. There's a taboo on food, there's a taboo on<br />\nchords<br />\nsoldiers,<br />\nbe<br />\nand<br />\nAnd we human beings have a record of being pretty games and killer games and get ready to<br />\nsl<br />\ncorpses and how you get rid of dead people. There's a<br />\nat being able to make major cultural changes like maybe street killers too, and of course we don't like that,<br />\ntn—<br />\ngi3<br />\nslight taboo on elimination, and many socities on earth<br />\nespecially when they_ involve what we've defined for but it's a by-product price we pay. For sex the message is<br />\noutse<br />\nhave been heir to this great taboo,on sex- What we're<br />\n,<br />\nt<br />\nlves as \"moral issues\". What is actually happening is that it's all right as long as you keep it secret-1 could say<br />\nwith right now in this age of birth control is a<br />\nstruggling<br />\n1141 the older generation has extraordinary difficulty in<br />\ndirty, underground, except then you say that it's sacred<br />\ngreater latitude with regard to what society allows<br />\ntalki to the younger one about it, because one of the and you just keep it for the one you love. We're<br />\nindividuals to define for themselves, as their own<br />\nparts of our sexual taboo is that you're not allowed to '<br />\nhopelessly at odds with ourselves about that. As far as the<br />\nstandards. That's a really far more -important<br />\nebxchange informatiori openly across the generations. public information and open discussion or viewing of sex<br />\nis<br />\narents are very touchy about discussing anything of their is concerned then society's official rule it's a taboo. socio-cultural event in modern history than most people<br />\nLn<br />\now<br />\ncatch on to, because it really is possible to get involved in<br />\nsex life even with their adult children. It's not a And you know a taboo that's good is so good that You<br />\nsexually stimulating activities and to iparticipate with<br />\n4und red percent avoided but it's pretty much so. don't even recognize it in your midst. It's like the air you<br />\nyour own partner without constantly having to prepare<br />\nnerefore we leave the younger generation of teenagers<br />\nbreathe. You just breathe it without asking any<br />\nand .<br />\nof time for the children that will result. So, I guess<br />\nahead<br />\ntaboo<br />\nis<br />\nof<br />\nsuch<br />\nwith<br />\nsex.<br />\nThe<br />\nquestions. That's how it is<br />\nin young adults to work out their own system of how<br />\nback to your question by saying that anything<br />\nget<br />\nI<br />\ncan<br />\nbecomes<br />\nit<br />\nlike<br />\na<br />\nthat<br />\nnative<br />\neffective<br />\nso<br />\nincorporate contraception into the relationship long standing and<br />\nto excess, either negative excess or positive<br />\ncarried<br />\nbe<br />\ncan<br />\nmany<br />\npeople<br />\nmany,<br />\nwhen<br />\ninto<br />\ningrained<br />\nso<br />\nlanguage,<br />\nen the sexes, to, what I've said in one piece I wrote,<br />\nthat's<br />\ntrue for any aspeetof human behavior,<br />\nand<br />\nexcess,<br />\nop a new set of moral principles, ethics of human they're growing up that they never think to question it.<br />\nso what we need to do is to work out a set of<br />\nrelationships in the Birth Control Age. What you do in They get involved in the bureaucracy or the committee or<br />\ncommon-sensical rules, and that's what society in it's<br />\n;fact see if you look around college students, for example, whatever it is that's going to ban magazines. Well, to<br />\nextremely stumbling way is trying; to do now. But, as is<br />\n:s that without having given a name to it, they are turning backtrack the evidence is that it's not harmful. It does<br />\nso commonly the case when change takes place, you get<br />\n1° the old custom that survived in Europe in the far north not induce any particular type of sexual behavior, good<br />\nof Scandinavia,<br />\nbe<br />\nused<br />\nas<br />\nan<br />\nmay<br />\nIt<br />\ngreat pendulum swings from one extreme to the other.<br />\nit.<br />\nor bad, in people who look at<br />\nwhich probably used to cover all of<br />\ngoing<br />\nto<br />\nget<br />\nare<br />\nit's very difficult for the human race just to hit the<br />\nwho<br />\nand<br />\npeople<br />\narousal<br />\nby<br />\n(Aire'Pe<br />\nbefore the Mediterranean customs crept in adjunct to sexual<br />\nand<br />\nexample<br />\nis<br />\nthat<br />\nof the road and find the best answer to the current<br />\ncommon<br />\nmiddle<br />\nThe<br />\nanyway.<br />\naroused<br />\nsexually<br />\ntook over. This is the old custom of betrothal, of<br />\nequality between the sexes, proving that you could get teenage boys will use some pictures out of sexy magazines<br />\nsituation. So, right now, as of the last couple of weeks,<br />\ndon't have the<br />\nthe pendulum has swung all the way over to the negative,<br />\nPrevanant before you got legally married. This old system as masturbation pictures, but.if they<br />\nused the announcement of the intention to get pregnant magazines they have Rile pictures in their imaginations and Times Square is going to be cleaned up, come hell or<br />\nas the betrothal announcement, as the occasion for the anyway !because it is a part of human nature to ihigh water. Well, I'll tell you that the answer to that can<br />\n4<br /><br />\ndevW<br /><br />\ncontinued on page 2<br /><br />\npage 2<br /><br />\nnews-letter<br /><br />\nMONEY FROM OW<br />\nbe found if you look to the history of prohibition. And<br />\nall that will happen is thati when you take it out of the<br />\nopen market place, it will be taken over by the gangsters.<br />\nIt will not leave our society. It will just have a different<br />\nset of owners, and I don't like to see any part of our<br />\ncommercial life . to become the prerogative of the<br />\nunderworld because they don't pay taxes on it and then•<br />\nwe all have to suffer by having, a few people get<br />\nimmensely rich illegaly, and that gives them moreJeverage<br />\non political power because, they can buy off politicians,<br />\nwhich everybody knows they have done.. And,in the end,<br />\nsociety pays much too heavy a price for it.<br />\nWe did that<br />\nwith Prohibition.,We're doing it with marijuana, and next<br />\nwe're going to do it probably with sex. It's been that way<br />\nwith prostitution for practically as far back as you can<br />\nremember.<br />\n-Whati then do you think might be some of the<br />\nprecipitating causes ofsexual crimes?<br />\nExcessive and rigid' application of the taboos to<br />\nchildren and • excessive punishment of them in childhood<br />\nwhen they are developing their sexual status. As far as one<br />\nh s the evidence, it is part of Nature's scheme of things<br />\nfor all primates to rehearse sexuality in sexual play, just<br />\nthe same way as they rehearse speech In babbling before<br />\nthey get ready to talk. If you put total veto on infantile.<br />\nand childhood expressions, of sexuality then you get<br />\nanomalies of sexual expression which take the place of<br />\nthe norm. For example, you can see in the clinic without<br />\ntoo much trouble, that a horrendous experience with sex<br />\nin infancy has long-term aftereffects. One case that<br />\nillustrates this is the case of where a baby is threatened,<br />\nithappens not too infrequently, that his penis will be cut<br />\noff with the scissors or the, kitchen carving knife if he<br />\nplays with it. Well, I've known examples where the<br />\naftermath of that was that the kid couldn't ever see a<br />\nknife without having an impulse to cut somebody with it<br />\nsexually. Couldn't get into a love relationship because he<br />\nwas scared he would cut his girlfriend in a sadistic way.<br />\nWell, every person who is a sex offender who gets picked<br />\nup and put in jail for it, has a very poignant history if you<br /><br />\napril 29, 19<br /><br />\nget them to talk about what's happened to them in the<br />\ncourse of their development from childhood onwards that<br />\ndistorted their sexuality to such an extraordinary degree.<br />\nSo, society, without being aware of what it's doing, is'<br />\nactually producing all of these monstrosities by the very<br />\nact of an attempt at purity.<br />\nWhat do you suggest as treatmentfor sex offenders?<br />\nWell there probably isn't a single answer to your question.<br />\nI can give you two opposite sides of the coin for an<br />\nanswer. Let's take, to illustrate one case, the example of<br />\nthe exhibitionist. If you are riding in a subway late at<br />\nnight and the exhibitionist dares to flash himself to get<br />\nfrom you an expression of surprise, because that's .the<br />\nessential key to the exhibitionist, to get shock or surprise<br />\nfrom the partner, the strangei- who is not expecting to see<br />\nhis penis, and that gets him all geared up and he then can<br />\ngo home with an erection and perform sexually which<br />\nwould not otherwise be possible usually. Well, if you look<br />\nat.that person and don't be surprised, and don't make a<br />\nbig noise and scream, then possibly tell him \"It's too small<br />\n,for me\", then it's such an absolute put-down that he can't<br />\ncontinue anymore, he's finished. So there are ways of<br />\nbeing able to teach the rest of society how to handle the<br />\nperson who's already been sexually crippled by his<br />\nupbringing. If you do have society taught that then it<br />\nrepresents a change towards; sex in our society, so that it<br />\nis possible that within three generations we could bring up<br />\nour children differently that we don't produce anymore<br />\nof these anomalies. Now at the other side of the coin if<br />\nyou're taking the situation as it is today and you've got<br />\nthe person who is a rape murderer, let's say, then<br />\nnobody's going to tolerate him at large. Then you can get<br />\nsome effective relief for that person if you give him a<br />\n- reatment with anti-androgen, Which puts his own male<br />\nsex hormone at rest for as long as you're giving it, also<br />\nprobably has a direct sexual tranquilizing effect of brain<br />\ncells themselves. Then if' you combine that with a<br />\nprogram of counseling you can expect to get that person,<br />\nwell I've used the word, psychically realigned,,in such a<br />\nway that he may not feel safe in this day and age with<br />\nputting him back in society at large, but you certainly<br />\ncould have him on a supervised way of living that is not<br />\nquite so monstrous as complete jail. If you have<br /><br />\nsomeone who's simply an exhibitionist who really doesn<br />\never do any dangerous harm to anyone, except sal;<br />\nthem, then it is possible with this form of treatment<br />\nget them rehabilitated so that they don't do it anymor<br />\nDo you. consider giving drugs or surgery to someotie<br />\njail ethical?<br />\nWell' I'll throw the question back at you. If there's(<br />\nrapist who feels totally incapable of controlling<br />\nbehavior, and<br />\nsay that feeling• that they're no 111°<br />\ncapable of controlling it than an epileptic is Of stoppla<br />\nthe next epileptic attack, and if there. was a reasonabl<br />\ngood chance that by doing brain surgery you could mal,<br />\nit possible for him not to have to be an impulsive rapis<br />\nanymore, and I mean dangerously violent and maYb<br />\nkilling, which would you think is better: to require him t°<br />\ngo into the gas chamber and be dead forever or to take<br />\nthe surgical treatment in the hope that it would all°<br />\nhim to live the rest of his life without sex in it?<br /><br />\n`...we are, with great difficulty,<br />\nadjusting ourselves to the Birth<br />\nControl Age...'<br />\n•<br />\nBut is he being coerced because he doesn't want to die? '<br />\nIs he being coerced into the death chamber? Yes, °<br />\ncourse he is. I mean we have to stop being fools 01<br />\nthis. What's happened now with all of this holy talk\"1<br />\nabout the rights of prisoners, which had a good beginfull<br />\nin so far as prisoners were being offered the chance t<br />\nvolunteer for testing of infectious agents and new drug<br />\nthat had no bearing on their own health. That was oka)<br />\nto talk about respecting the rights of prisoners instead 0<br />\nusing them as Hitler did as guinea pigs, but to tel<br />\nprisoner that he can't sign a paper for his own treatmell<br />\nthat will help his personal sense of well-being, to rne aAri<br />\nexample of the pendulum that swung the other way an'<br />\nit's an example of- the vindictive cruelty of society thad<br />\nsays, \"We've got you now.We're going to keep you, au<br />\nnot, let you go, even if we have to put you in tile g35<br />\nchamber.\"•<br /><br />\n1004<br /><br />\n7e<br /><br />\n17C.<br /><br />\n;<br />\n- sCo712771<br /><br />\nCa-<br /><br />\np7-ese ts<br /><br />\n(ThE JohNs HopkiNs UNIVERSiTy<br />\nWEEKEND WONDER FLIX<br />\nOfficE of ThE ChAplAiN<br /><br />\nSEVEN<br />\nBEAUTIES<br /><br />\nPRESENTS<br /><br />\nAn indelible film, unlike any other I have ever seen. The<br />\nscript, photography, direction and performances are<br />\npractically incomparable. —Gene Shah!, NBC-TV<br /><br />\n7*-icot<br />\nCUM<br />\na•Cja5sical<br />\nutile Rcitctl<br />\ncciturdaL ,4/37430, 1977<br />\n0TN,<br /><br />\nar-rctti. foc;$777<br /><br />\nLibra\"-<br /><br />\n*sU<br />\nAnew film by Lina Wertmuller<br /><br />\nSeven*<br />\nBeauties<br /><br />\n...that's what they call him.<br /><br />\nEll<br /><br />\nstarring Giancarlo Giannini<br /><br />\n7:30*. &amp; 10:00 HomEwood CAmp<br />\nFRIDAY, APRIL 29 GREAT HALL<br />\nSATURDAY,<br />\nAPRIL 30 SHRIVER H41<br />\n!1„dmissioN: $1.00<br /><br />\nDETAILS 318-810<br /><br />\n92<br />\nocsr<br />\nsca<br />\nent<br />\nMOr<br /><br />\nme<br />\n;re's<br />\nig 11.<br />\ntiler<br /><br />\napril 29, 1977<br /><br />\npage 3<br /><br />\nnews-letter<br /><br />\nPeabody news<br /><br />\n•<br />\n•<br /><br />\nOpera premieres<br />\nGalkin bows in<br /><br />\n)nab<br />\nma<br /><br />\nrapis<br />\nnayb<br />\ntale<br />\nalloa<br /><br />\n•<br /><br />\n,s,<br />\nabet)<br />\nLlkin<br />\nnnin<br />\nce t<br />\ndrug<br />\noka)<br />\nad 0<br />\ntell<br />\nnient<br />\nis all<br />\n( and<br />\nthat<br />\n, arid<br />\ne gas<br /><br />\nBy JOSQUIN DESPRES<br />\n#<br />\new operas are not an everyday affair. It used to be<br />\nthere<br />\nthat<br />\nw ould<br />\nbe a new Opera every season for the great opera houses of<br />\nEurope, but those days are long gone. Today the expense,<br />\nthe risk, and the reluctance of major companies to<br />\nperform new works seem to preclude any but the very<br />\nbest of the new composers from the ranks of the opera<br />\nmasters.<br />\nThus, it is no small achievement to bring a new opera<br />\nto Baltimore. Let alone a new Opera by a Peabody<br />\ngradute, and a Pulitzer Prize winner at that. But it will<br />\nhappen, and it will mark the opening of the<br />\nPeabody-Hopkins merger as a benefit for the financially<br />\nbeleaguered conservatory.<br />\nThe Voyage of Edgar Allan Poe is Dominick Argento's<br />\nvision of Poe's last journey. It concerns itself with the last<br />\ndays of the writer's life, which started with a boat trip in<br />\nRichmond and ended in death in a gutter in Baltimore.<br />\nWhat happened in between remains a mystery, and that<br />\nmystery was the spark that lit the idea for the opera. With<br />\na libretto by Argento's colleague at the University of<br />\nMinnesota, Charles Nolte, the Opera had its premiere in<br />\nSt. Paul in 1976 with the Minnesota Opera Company.<br />\nHope Quackenbush, the promotion director for the<br />\nMorris Mechanic Theatre, was one of the audience.<br />\nMrs. Quackenbush knew that Minnesota Opera had the<br />\nsingers and the sets, and felt sure that Baltimore could<br />\nsupply the orchestra and chorus for the work's much<br />\nneeded East Coast premiere, so why not? The Baltimore<br /><br />\n.New Peabody _Director Elliot Galkin in action<br />\nOpera Company proved more than willing, and the 'Johns<br />\nGalkin, whose appointment was confirmed by Hopkins<br />\nHopkins University saw the Opera as the most suitable<br />\nPresident Steve Muller, is the ideal choice for the peabody<br />\nvehicle for a benefit for the Peabody. Thus, ont,June 6, Director, as his comprehension of both the musical and<br />\nThe Voyage of Edgar Allan Poe will receive its East Coast<br />\nacademic should prove invaluable to his efforts to afford a<br />\npremiere.<br />\nsmooth and equitable integration of Hopkins and<br />\nThis performance will also mark the appointment of ' -Peabody students. As he was quoted in the ;Sun(8 April,<br />\nElliot Galkin as the director of the Peabody. Galkin, who<br />\n1977), he will try \"to develop the kinds of programs that<br />\nin addition to his teaching duties at Hopkins, Goucher<br />\nwould exploit to the fullest the resources of both the<br />\n(where he heads the music department), and Peabody, is<br />\nPeabody Institute and theJ ohns Hopkins University.\"<br />\nthe music critic for the Baltimore Sun, as well as the<br />\nWell, an opera is an awfully big event for a<br />\npresident of the Music Critic Assocation.<br />\n-housewarming party, but then, this is an awfully big<br />\n(To expound upon his career would prove almost<br />\nhousewarming. And if an East Coast premiere of a<br />\nfatally lengthy; suffice to say that this former student of<br />\nPeabody student's opera is representative of the kind of<br />\nNadia Boulanger has been involved in almost every form<br />\nthing that will result from the affiliation of Hopkins and<br />\nDf music from country fiddling to Opera, and is one of<br />\nPeabody, then the next years should be something to<br />\nAmerica's most respected critics and musicologists.)<br />\nwatch (or rather listen to) indeed.<br /><br />\n1.<br />\npoputt s\"iVeS<br /><br />\nrhe<br /><br />\nresults are in! An overworked N-L tabulations staff<br />\nworked long into last night, furiously collating the data<br />\nfrom the \"Who is your worst professor?\" poll. The poll,<br />\nissued two weeks ago, received an overwhelming response<br />\n- the heavier mail days required three of the burlier<br />\nmembers of the delivery crew to tote the stacks of<br />\nresponses back to the Gatehouse. Once all the entries<br />\nwere in, the N-L consulted famous social scientist and<br />\namateur pollster M.R. Bongue to select a scientifically<br />\naccurate sampling of the responses. After extensive<br />\ncooperative research with Dr. Bongue, the staff came up<br />\nwith the 33 random entries that most exactly represent<br />\nthe collective Hopkins undergraduate.<br />\nThe entries, on the whole, indicated a creative impulse<br />\nhidden within the deepest pre-med recesses of the average<br />\nHopkins student. Most replies took the liberty of<br />\nproviding answers outside the strict yes/no requests, of<br />\nwriting extensive comments where one word would have<br />\nsufficed, of posing questions in response to questions; in<br />\nshort, it seems a lot of talent on campus has been<br />\nsmothered under multiple-choice exams and<br />\nproblem-gutted homework.<br />\nTo start, the \"Faculty\" section evoked the widest range<br />\nof responses. No less than 29 personages were bestowed<br />\nthe title of \"Favorite Professor,\" coming from all<br />\ndepartments. Multiple nods went to Drs. Gryder, Crenson,<br />\nCone, Pfeffer, Posner, and Russel-Wood. Honorable<br />\nmentions would take too much space to list -- you know<br />\nWho you are, so keep up the good work.<br />\nThe Henny Youngman Award for best jokes went to<br />\nMichael Hooker (Philosophy), in a tight contest with<br />\nthose who found no professor capable of delivering a<br />\none-liner at the appropriate moment. One reply gave a<br />\nbackhanded compliment to Robert Green, \"for stealing<br />\nthe best jokes from Dr. Pond.\"<br />\nDr. Richard Macksey of the Humanities Center took<br />\nhonors'in the art of obsfucation, although a number of<br />\nvoters picked Drs. Ranum and Kenner as masters of the<br />\nverbal footnote. 8s for the worst advisor; well, a plurality<br />\nrecommended staying away from Gilman 155 for course<br />\ncounseling. At the same time, a sizeable vote came in for<br />\nDr. Dierman, even though it wasn't technically his<br />\ncategory (see below).<br />\nThe. \"n o -e duca tion-at-Hopkins-is-complete-without\"<br />\nquerry, which asked \"Have you ever seen John Barth\"(a<br />\nvariation on the \"Have you ever talked with Muller\"<br />\nroutine), found roughly half the undergraduates fulfilled,<br />\nthe other half still searching. This question elicited quite a<br />\nfew riffs, from \"I once caught a glimpse of his head<br /><br />\ntO prO<br /><br />\ngleaming across the quad\" to an ecstatic \"Yes, three times<br />\nin fact!\"<br />\nIn the \"Academic\" category, the Math and Chemistry<br />\n'departments finished a close one-two for the worst<br />\ncollection of graduate students. On the other hand,<br />\nBiology took the \"Worst Nerds\" crown in a runaway.<br />\nThat much-desired Homewood delicacy, the gut course,<br />\nbrought 'a surprisingly varied collection of courses to the<br />\nsurface. Everything from Social Psychology to Organic<br />\nChemistry, from Bioengineering Seminars to .Kenner<br />\nclasses got mention as the Nirvana of TheAcademic set. A<br />\ncouple students protested this question, however, saying<br />\n\"There are guts at Hopkins?\" and \"You think I'm going<br />\nto 'ye that aw. ?!\"<br /><br />\nNoted pollster Dr. M.R. Bongue<br />\nhe choices for worst and best course were likewise<br />\nunclear; many courses got nominated in both categories.<br />\nGenerally, introductory courses and Psychology offerings<br />\ncame under the most criticism. Meanwhile, there was no<br />\nagreement on the best course, a quandary that should<br />\nhave been expected.<br />\nIn \"Campus\" matters, three rooms vied for position as<br />\nbest lecture hall: Remsen 101, Shaffer 3, and Maryland 110.<br />\nRemsen I emerged as the solid choice for worst room on<br />\ncampus. No consensus emerged on library levels; C and B<br />\ndrew strong support as the favorite levels, though DX,<br />\nand M all had their loyal followers. In the case of class<br />\ntimes, the hours before noon were<br />\nprogressively hated, with 9:00 the most despised. The<br />\nreplies evidenced no great love for 4:00 classes, either,<br /><br />\nessors<br /><br />\nand a few found \"anytime\" to be a bad time for a course.<br />\nFood? A brave 10% ,stated they would eat Servomation<br />\nofferings even when endowed with free will, one<br />\ncourageous (or gluttonous) soul writing \"Sure!\"<br />\nThe question of what to do with that perennial<br />\nheadache, Garland Hall, engendered the most imaginative<br />\nsolutions of the poll. The proferred choices all received<br />\nnominal support, with a parking lot edging out the<br />\nproposed bowling alley and tennis courts. Individual calls<br />\ncame for replacement with McDonald's, a Mexican<br />\nrestaurant, a stable and riding course, a sex counseling<br />\ncenter, and an all-night organic lab. Many wanted a \"piece<br />\nof the Block\" on campus, in the form of a combined<br />\nsaloon/brothel. And a canny few thought Garland Hall<br />\nshould be removed in favor of an administration building.<br />\nFinally, in the \"General\" section, respondents were<br />\nasked to rate President Muller's performance (\"I thought<br />\nCarter was President,\" one person noted). \"Say what\"<br />\ntook 32% of the vote, \"Fair\" next at' 21% the rest<br />\nscattered from 'Excellent' to \"Poor\" and one \"Cute.\"<br />\nComplaints Were registered that Muller only paid<br />\nattention to grad students.<br />\nDr. Dierman, a near-winner earlier, handily beat out Dr.<br />\nSuskind 3-1 for disfavor. Whether Hopkins is worth the<br />\nmoney coughed up by undergraduates (that is, their<br />\nparents) was hotly contested, with about equal numbers<br />\nsaying \"Ay and t. Nay.\" One terminally disillusioned<br />\nstudent scribbled little \"Ha-Ha's\" around the border of<br />\nthe entry, while another casually explained \"No... but<br />\nthen again, I'm on financial aid.\"<br />\nBy a 60-40 margin, students found the Hopkins<br />\npastime of lacrosse \"not that big a deal, \"though a<br />\ncouple negative votes had the qualifications \"only when<br />\nbloody\" and \"If you like French cuisine.\"<br />\nFor the last bit of information, the entrants had to try<br />\nto identify themselves (for _untold demographic<br />\npurposes). It seemed self-rated \"derelicts\" sent in the<br />\nmost replies, with a good number of \"jocks\" and \"nerds\"<br />\nalso responding. The plurality; though, went to the<br />\n\"other\" denomination, wherein species ranging from<br />\n\"closet pre-med\" through \"person\" to \"sweet young<br />\nthing\" appeared. One student went so far as to!declare<br />\nthat \"I also look liket Jimmy Carter,\" obviously someone<br />\nfamiliar with the vagaries of poll-taking.<br />\nAs a finale, the headline-cum-title of the poll, \"Who is<br />\nyour worst professor?\", must, for now, remain<br />\nunanswered. It seems the computer broke down on that<br />\none, spewing out names and numbers in an electric<br />\nfrenzy. Sorry.<br /><br />\npage 4<br /><br />\nEar<br /><br />\nl Hines looks amazingly like Bobby Short, thL. New<br />\nYork sophisticate, song interpreter par excellence. Hines,<br />\nresembles Short, except that while Short exudes New<br />\nYork's 'East Side in the best of times, Hines carries with<br />\nhim the Chicago of the forties. Class, but the kind of class<br />\nthat doesn't need the sheer polish of money, like a suit<br />\nthat looks good even off the models who never seem so<br />\nmuch as to sweat.<br />\nHe sits at the piano on the cramped stage and rambles<br />\ninto an introduction, hitting notes and playing runs as if<br />\nhe was just warming up, untiLbefore you reali7e what he's<br />\nplayed, the whole thing falls together as the most intricate<br />\ndevelopment of that tune you've ever heard. Of course,<br />\nit's a tune that you've heard countless times before, but<br />\nnone the less, each chorus sounds different, not merely<br />\nfrom the succeeding choruses, but from any previous<br />\nperformance in memory.<br />\nHines looks about the right age to have grown up<br />\nplaying bebop. Indeed, both Charlie Parker and Dizzy<br />\nGillespie were in his band in Chicago, as was Billy<br />\nEckstine, who put together the first Bop Big Band,<br />\ndrawing heavily from the Hines alumnae (one prize was'<br />\nsinger Sarah Vaughn). Yeah, Hines played with the early<br />\nboppers. He also played with the young Louis Armstrong,<br />\nand not as an apprentice either. As an equal.<br />\n\"I met Louis, and that's what caused us to be friends,'<br />\nsays Hines of his early style. \"We were both playing the<br />\nsame style, only I was playing the piano, and he was<br />\nplaying the trumpet. Now, the reason I was playing it on<br />\npiano is because back in the days when I started, way<br />\nbefore I ever heard Armstrong, I was playing this way in<br />\nPittsburgh, Pennsylvania. I was playing the \"trumpetstyle\" because they couldn't hear ragtime in the classical<br />\nstyle I was using, the fingering... So the only way I could<br />\nget heard was to play what I wanted to play, only instead<br />\nof playing it on trumpet, I played it on piano. That's<br />\nwhere it started.\"<br /><br />\n\"The only hope I see for<br />\nany young musician is to<br />\n'learn your horn.'\"<br />\nHines goes'into a medley: West Side Story. The medley<br />\nform suits Hines to the point that you'd think he invented<br />\nit. In a way he did; as critic and producer Don Schaten<br />\nput it, Hines' improvisations are so full of other songs,<br />\nwhen he slides into anew tunei_it's almost as if the new<br />\ntune had been improvised on the spot. The same happens<br />\nwith West Side Story. Hines trots the melodies out as if<br />\nthey were his own, and plays with them as he wants. For<br />\ninstance, I Feel Pretty sounds suspiciously like it was<br />\nwritten by Fats Wailer;,<br />\nmoreover, Chicago appears<br /><br />\napril 29, 1977<br /><br />\nnews-letter<br /><br />\nFatha Hines:<br />\nOriginaljazz<br />\nBy J.D.Considine<br /><br />\nmysteriously before the finale (\"It was the West Side of<br />\nChicago,\" he says at the end).<br />\nYou might expect the back-up musicians to look pretty<br />\nmuch the same as Hines. Rudy Rutterford, smoothly<br />\ndressed, jocular, easily middle-aged, seems the perfect<br />\nman for the part, as he roars in his best Coleman Hawkins<br />\nsytle through a tenor sax blues. The bandstand displays an<br />\nalto, a tenor, a soprano, a clarinet, a C flute and a G flute.<br />\nOnly four of the six get used.<br />\nThe drum set features a series of tuned toms,just right<br />\nfor those impressive around- the-set paradidles crowds<br />\nlove. Eddie Graham, young, British-looking, sits behind<br />\nthe traps, bursting energy. He's a young drummer, which<br />\nseems good enough excuse for his lengthy solos consisting<br />\nalmost entirely of Buddy Rich/Gene K rupa cliches. He<br />\ngets two fifteen minute solos, which most of the crowd<br /><br />\nlove. In short, he's fast, flashy and fun, which, you guess,<br />\nmakes up for his lack of ideas.<br />\nJ ohnny Orr fools you.. Unlike Graham, whose flurry of<br />\nnotes seem to hide a lack of quality, Orr's basswork seems<br />\nalmost reticent, as if he were afraid to say something.<br />\nUntil he solos. Small children are often told to merely<br />\nspeak when spoken to, and when Or finally speaks, it's<br />\ngenius. Brilliant runs, flawless double-stops, and an<br />\nexquisite melodic sense combine for solos which carry the<br />\nquiet brilliance of a Picasso drawing.<br />\n\"Nobody's backing the young man who decides to<br />\nkeep J azz going as a cultural art... You've got young<br />\npeople coming out of the schools today that are great<br />\nmusicians, but where are they going? Nobody's making<br />\nany openings, nobody.\"<br />\nIt would be easy to dismiss Hines as just another old<br />\nmusician who regrets passing of<br />\nhis time, until you learn about his non-musical life. For<br />\nexample, that he is currently the President of the Overseas<br />\nPress Club. That he speaks frequently with the State<br />\nDepartment's Arts Programs Co-Ordinators. That, while<br />\nplaying at a reception or Gerald Ford and Valery<br />\nGiscard D'Estaing, he spoke to the President about the<br />\nimportance of government involvement in the Arts.<br />\nHe thinks that there should be a Secretary for the Arts;<br />\n\"I've been fighting for that for years, and, God bless the<br />\ndead, Ellington too... But we're just a couple of people...\"<br />\nHe intends to speak to President Carter when he plays for<br />\nhim, but is worried because he is unsure where Carter<br />\nstands.<br />\nBut it is with the young, Hines feels, the answer lies.<br />\n\"There's not a kid you know that's not interested in Bugs<br />\nBunny. So why not open up an avenue for music?\"<br />\nGetting the message across, that music is something<br />\nvaluable in itself--that's what is needed.\"The trouble with<br />\nthe United States is they're commercial...They're trying<br />\nto put music, as far as success is concerned, in the<br />\ncategory of sports.\"<br />\n\"The only hope I see for any young musician is learn<br />\nyour horn.' Learn your instrument. Don't pick it up by<br />\near. Years ago, when we had the big bands, you had to<br />\nknow what to do to be in the band... We went down to<br />\nrecord because we wanted to hear ourselves, perfect<br />\nourselves...\" The drive for excellence, for music for its<br />\nown sake seems all that is needed to make the world run<br />\nsmoothly.<br />\nIt also seems very dry. Dry, until you think back to<br />\nMarva Josie, the band's vocalist, swinging through Jelly,<br />\nJelly in a down home, no holds barred performance, that<br />\nwould have Dinah Washington blushing with envy. It's not<br />\nuntil you realize that these cats4swinging their asses off in<br />\nthe dirtiest down-home blues you ever heard - are all cats<br />\nwho know their aces better than their friends, that what<br />\nHines says really makes sense.<br /><br />\narts calendar<br />\nConcerts<br /><br />\nYou always look in this window but you never go in. You make a point to take the route up 31st Street, letting your<br />\neyes do a quick search to feed your wondering about the perhaps unimaginable kinds of things that take place within.<br />\nYou conjure the pink naked grapefruits dancing, swaying to the amorous undertone you play in your backcorws when<br />\nyou think about Ier and her and them. But the window is black. Your fantasies are not there. You always walk on, not<br />\nunderstanding, not knowing that your images are wrong, your words are wasted, and your mind may never heal. You<br />\nlaugh in.your solitary box now as you leave the window behind.<br />\nBread and Roses Coffeehouse, a Homewood alternative at 426 East 31st Street, will feature a BEER PARTY with live<br />\nmusic by CARL CHATSKY tonight at 9 P.M., and tomorrow evening the incredible ILILI MUSIC EXPERIENCE at 8<br />\nP.M. A donation of one dollar is requested for both events. And don't forget: LUCHA,the inspirational talents of five<br />\nwomen singing of working and poor people from around the world, will appear at Bread and Roses Saturday, May 14 at<br />\n8 P.M.<br />\nYou always look in this window but never go in.<br /><br />\nBaltimore Symphony Orchestra, Lyric Theater, 120 W. Mount<br />\nRoyal Ave. Judith Burganger, pianist, and Arid l Deborah<br />\nRubinstein, soprano, will solo at the Baltimore Symphony's pop<br />\nconcert at 8:15 p.m. on April 30. It will be an all-Tchaikovsky<br />\nprogram.<br />\nGoucher College. Pianist Alfred Brendel will perform in an<br />\nall-Beethoven concert at 8:30 p.m. on May 3 in Kraushaar<br />\nAuditorium.<br />\nLeft Bank Jazz Society, Famous Ballroom, 1717 N. Charles St.<br />\nThe Bill Hardman-Junior Cook Quintet will play on May 1 at 5<br />\np.m.<br />\nThe Urban Philharmonic Orchestra, led by Darrold Hunt, will give<br />\na. benefit concert for the Kidney Foundation of Maryland on May<br />\nI at 8 p.m. in the Lyric Theater. Ticket prices range from $5 to<br />\n$50. For further information call 523-4826 or 653-2639.<br />\nLoyola College. Billy Joel will perform in the gymnasium on May<br />\n4 at 8 p.m. General admission tickets are $7 and are available at<br />\nthe Johns Hopkins Union.<br />\nTheater<br />\nMa-111mile Theater, Hopkins Plaza. Barbara Rush and Tom Troupe<br />\nstar in \"Same Time, Next Year.\" through April 30. Call 727-4103<br />\nfor ticket information.<br />\nCenter Stage, 700 North Calvert St. Jules Feiffer's \"Knock<br />\nKnock.\" through May 15. Student rush tickets are available. Call<br />\n332-0033 for further information.<br />\nKennedy Center Opera House (Washington.) The Tony<br />\nAward-winning musical \"Shenandoah,\" through April 30. Call<br />\n(202) 254-3600 for further inforniation.<br />\nKennedy Center Eisenhower Theater (Washington.) Arthur<br />\nMiller's new play, 'The Archbishop's Ceiling,\" starring Bibi<br />\nAnderson and John Collum will open on May 2 and play through<br />\nJune 4. Call(202) 254-3600 for FURTHER INFORMATION.<br />\nArena Stage, 6th and Maine Ave., S.W.(Washington.) Maxim<br />\nGorki's 'The Lower Depths,\" through May 8.<br />\nArena Players, 801 McCtilloh St. Four plays: Langston Hughes'<br />\n\"Soul Gone Home\" and \"Mother and Child.\" Ted Shine's<br />\n\"Shoes,\" and Clay Goss'\"Of Being flit.\"<br /><br />\napril 29, 1977<br /><br />\nnews-letter<br /><br />\nCity film fare is mighty poor;<br />\nFast relief with the Film Festival<br />\nOffice of the Chaplain to aid this summer<br />\n/By MIKE GIULIANO<br />\nand even the few foreign directors with a popular<br />\n. t has not been a good spring for films and the situation • following-- Wertmuller, Bergman, Fellini, Truffaut--are<br />\nis truly pathetic in<br />\noften unacceptable unless the subtitles have been replaced<br />\nBaltimore, where one can choose between The Eagle Has<br />\nwith a dubbed soundtrack. An example: Wertmuller's<br />\nLanded, Cassandra Crossing, Silver Streak (still doing Swept Away opened at a suburban.theatre with the<br />\ngood business after many months), Airport 77, and<br />\noriginal Italian soundtrack, did lousy business the first<br />\nGodzilla Vs. Bionic Monster. Such films are playing in<br />\nweek and was replaced the second week with a poorly<br />\nWashington and New York, but these cities can actually<br />\ndubbed .<br />\nv ersion which did much better at the box office.<br />\nrill theaters for serious documentaries like Harlan<br />\nMost foreign directors do not exist in Baltimore. The<br />\nCounty<br />\nU.S.A., film biographies like Edvard Munch, and • last Godard film, as far as I know, to play in a commercial<br />\nFassbinder festivals.<br />\nBaltimore theater was Weekend in the late 1960's.<br />\nQuick: What was the last documentary film you saw in<br />\nSatyajit Ray, the prolific Indian director, produces<br />\na commercial Baltimore theater? You probably have not<br />\nmasterpieces on a yearly basis, but the man is a cipher in<br />\nseen even one, because there have been very few. Baltimore. No Japanese director, not even Akira<br />\nBaltimore audiences, while enthusiastic<br />\nabout mindless -iKurosawa, is a hot item in this city.<br />\nentertainment, aren't going to<br />\nstand in line and pay three<br />\nSince the 5 West and 7 East closed a few years ago,<br />\ndollars for intelligent entertainment. The moviegoing<br />\nBaltimore's one remaining art house has been the<br />\nPublic doesn't really know anything about documentary _ Playhouse on 25th St., but the Playhouse plays it safe and<br />\nh.lms, but<br />\nthey do have bitter memories of grainy, dull<br />\npresents us with a mixed bag of art and commercial<br />\nfilms dealing with venereal disease and civil defense 'entertainment, as<br />\nit probably has to do in order to stay in<br />\nPrecautions shown in high school classes, and some<br />\nbusiness. Consequently, we get Bergman and<br />\nPeople, having seen a vintage documentary, a Nanook<br />\nTunnelvision, Sautet and soft pornography, Malle and The<br />\nof<br />\ntile North (1922), conclude that nonfiction films, because<br />\nSeven<br />\nPer Cent Solution. Satyajit Ray, Robert Bresson<br />\nof their<br />\nvalue as social documents, should be preserved in (who?), Akira Kurosawa and Alain Tanner (who?who?),<br />\nmuseums and occasionally dusted.<br />\nare rarely, if ever, found at the Playhouse.<br />\n. A contemporary documentary, no matter how good it is,<br />\n, The situation in Baltimore's commercial theaters is<br />\nslinPly will not make money in a commercial Baltimore<br />\ngenerally rather dismal, but several film series, special<br />\ntheater. Hearts and Minds, even after it won an Academy<br />\nscreenings and festivals provide a welcome alternative to<br />\nAward for best documentary film, played one week at the<br />\nThe Shaggy D.A. and A Star Is Born. Hopkins' Office-of<br />\nCharles theater before disappearing from this metropolis<br />\nthe Chaplain, as a part of its Sunday Experience series,<br />\nof 2,000,000 souls (there are considerably fewer<br />\nwill present Marcel Ophuls' The Memory of Justice<br />\n,<br />\n111(3viegoers, and even fewer documentary filmgoers. I (1976) on May 8 at 11 a.m. in Shriver Hall. A catered<br />\nsnared Hearts and Minds with five, possibly six, people •lunch will be available during intermission; call 338-8187<br />\nc'ne Saturday afternoon.) Harlan County U.S.A., an<br />\nfor luncheon reservations. This documentary examination<br />\nex<br />\nr amination of social injustice in the K entucky coal<br />\nof Nazi crimes was directed by the same man who gave us<br />\nlelds, and Union Maids, which deals with 1930's labor<br />\nThe Sorrow and the Pity. The Memory of Justice has<br />\nrilcivements in Chicago, are thought provoking films about<br />\nnever been commercially released in Baltimore. On May<br />\n°11temporary<br />\nc<br />\nAmerican society. Neither film is playing in<br />\n22 at 11 a.m. in the Listening and Viewing Room, the<br />\nnaltimore. Documentaries with relevance and immediacy<br />\nSunday Experience will screen Ingmar Bergman's Through<br />\nare not despised, but are simply ignored.<br />\na Glass Darkly. The film will be followed by a critique by<br />\nFor most of us, movies are an escape from reality, a<br />\nDr. Rene Girard of the Romance Languages Department.<br />\n.way to forget the fact that people died on picket lines and<br />\nThere is no admission charge for these two films.<br />\nitn Vietnam. We do need, once in a while, to sit in a dark<br />\nThe Office of the Chaplain is also sponsoring its fifth<br />\n,Iteater for two hours and immerse ourselves in the<br />\nannual summer film series, Hollywood Cavalcade, which<br />\nl'Intastic adventures of Shirley Temple and Godzilla, but<br />\nruns from May 8 until August 28, and includes Chaplin's<br />\nwhat is dangerous and damnable is when we assume that 'City Lights, Greta<br />\nGarbo in Anna Christie, Jean Harlow in<br />\nril°vies are no more than an escape medium, when we<br />\nFrank Capra's Platinum Blonde, the Marx Brothers' A<br />\nflegleot the fact that films can, like the Godfather,<br />\nNight at the Opera, Marlene Dietrich in Shanghai Express,<br />\nentertain and offer social commentary.<br />\nTod Browning's Freaks and much much more. Screenings<br />\nniBaltimore audiences receive foreign films with little -Are in Shaffer 3. Reduced<br />\nsubscription rates for 25 or 12<br />\n-°re<br />\n..,..;__..,enthusiasm than they do domestiC documentaries, admissions are available through May 8 from the Office of<br /><br />\nthe Chaplain. Single admission tickets will be available at<br />\neach performance. Stop by the Chaplain's Office for a<br />\nfree brochure and calendar, or call 338-8187.<br />\nThe eighth Baltimore International Film Festival will<br />\nbe held from May 13-21 at the Tower Theater, 2 Charles<br />\nCenter, Charles and Saratoga Sts. The films to be shown<br />\nare: Fernando Arrabal's Guernica(1976) on May 13 at 10<br />\np.m. and May 19 at 7:30 p.m.; Vim Wender's Alice In<br />\nThe Odes(1974) on May 14 at 7:30 p.m. and May 17 at<br />\n9:30 p.m.; Rainer Werner Fassbinder's The Bitter Tears of<br />\nPetra Van Kant (1973) on May 14 at 10 p.m.; Andre<br />\nTechine's French Provincial (1976) on May 15 at 7.30<br />\np.m. and May 18 at 9:30 p.m.; Wim Wender's The<br />\nGoalie Anxiety at the Penalty Kick (1971) on May 16 at<br />\n9:30 p.m. and May 20 at 7:30 p.m.;11ohn Waters' Pink<br />\nFlamingoes (1972) on May 13 at midnight; \\Wham<br />\nMenzies' Invaders From Mars (1953) on May 14 at<br />\nmidnight; Claude Chabrol's La Rupture(1975)on May 15<br />\nat 10 p.m. and May 19 at 7:30 p.m.; David and Al<br />\nMaysles' Grey Gardens (1975) on .May 18 at 7:30 p.m.<br />\nand May 20 at 10 p.m.; Satyajit Ray's The Adversary<br />\n(1971) on May 17 at 7:30 p.m. and May 21 at 7:30 p.m.;<br />\nClaude Whatham's Swallows and Amazons(1974)on May<br />\n13 at 2 p.m. and May 20 at 2 p.m.; Fiedler Cook's From<br />\nThe Mixed-up Files of Mrs. Basil E. Frankweiler (1975)<br />\non May 14 at 2 p.m.; and winners of the Independent<br />\nFilm Competition on May 21 at 10 p.m. For further<br />\ninformation call 539-2187.<br />\nFinally, a film series at IHoward Community College<br />\n(Little Patuxent Parkway in Columbia) presents free films<br />\nevery Sunday night at 7 p.m. The schedule for the next<br />\nfew weeks is as follows: Howard Hawks' Scarface on May<br />\n1; D.W. Griffith's Abraham Lincoln on May 8; Main<br />\nResnais' Hiroshima Mon Amour on May 15; Akira<br />\n.Kurosawa's Seven Samurai on May 22; and !Jean Renoir's<br />\nBoudu Saved From Drowning on May 29.<br /><br />\nArellano's 11 O'CLOCK has a hallucinatory quality<br />\nsh %en you come to the revolution, bring your dancing<br />\ns, Qles•kick a step with the sadistic Doctor Nodarse slide<br />\n'<br />\nc eP dance with the brutal guard the sergeant with his<br />\nwa.rbine and the heart of slush with the mysterious Tere<br />\nElth the drunken Professor of Everything Pedro with One<br />\nisY,!at.be peripheral the Oedipal knife-thrower whose target<br />\nch wtom who's been pinned to the board there are others<br />\nru ange partners hook arms with Pepe Lopez the suicide<br />\nkiartYr in the confessional of mud ask the butcher his<br />\ndneys are shot ask his donor the drunkard his kidneys<br />\nat<br />\nit,e shot by the pistol of the guard with the slashed thigh<br />\ns an orgy of stabbings and song it's a little too long.<br />\ntr And it's touching and lunatic; it's religions<br />\n.vansoendence in a maximum security prison; it's a<br />\n'<br />\nolfalnikaze Castro revolution on a small scale; it's the night<br />\nthe dancing dead; it's wine into water info rum into<br />\n'at<br />\nit occasionally loses its head.<br />\nAr °L1 know Bob Arellano, but you don't know this Bob<br />\ncheisliano unless you've spent some time with him in a<br />\njail. Unless you've peopled his nightmares. These<br />\nare<br />\nbi! ,three corpses and far more casualties at the final<br />\n``belcout. The characters are hopelessly mortal.<br />\ncurb wrote the original script ten years ago before<br />\n'all politics became fixed. It was a philosophical script,<br />\n'rev•<br />\nlth overtones of the academic, the religious, the<br />\np(40dutionary. It showed its date. It had the pace of a<br />\netnio• And Bob was not satisfied.<br /><br />\nIn this new version director Ned Solomon (he's the one<br />\nwith the guitar) gets three characters out from under their<br />\nlabels and sets them on their feet. Everyone gets a chance<br />\nto explain himself, and most of the explanations are<br />\nconvincing. The professor, the priest, and the<br />\nrevolutionary have been condemned to death by an<br />\noverworked count with a ten minute patience, but, for<br />\nthe time being, their bodies are more useful, than their<br />\ncorpses could ever be. I can't tell you why; let your<br />\nimagination run riot. The question becomes: Live and be<br />\n•of service to the state, or—the alternative?<br />\nManny Falcone plays the cleric whose faith goes<br />\nquickly. He gets—everyone gets—a chance to address his<br />\nGod directly, and makes good use of it. Bobby Reiser is<br />\nthe stiff-lipped, stiff-spined One-Eye, who gets off some<br />\nchoice invectives, and carries much of the dramaturgical<br />\nload. Pedro, the coward, the drunk, the Central University<br />\nprofessor, is played by Mark Gallagher. With all his<br />\ncowardice, and his chronic DT's, he spends much of his<br />\ntime trembling. But he also provides the script its<br />\nhallucinatory, quality by lecturing to One-Eye and Lopez<br />\n'n his rumdream conviction that he is running his 11<br />\no'clock class. Manny and Bobby play his students and are<br />\njoined by Tere, Pedro's childhood bride and romantic<br />\nfantasy. There is much that is funny and touching about<br />\nthese sessions. There is much about the last of the set<br />\nwhich is neither.<br /><br />\nChris Stutz, as Doctor Nodarse, is less certain than her<br />\nfellows about what character she's playing. She plays a<br />\nfew, anyone of which she might have handled well. Ruth<br />\nBosch has her first brutal role as the guard. We get to see<br />\nher kill, swear and take a bribe. We also see her stabbed.<br />\nHoward Mandell is the obliging sergeant. Audrey Zettick<br />\nis Tere.<br />\nBarbara Smith does the understated make-up, Ian<br />\nSutherland the understated set, with Ed Fancovic.<br />\nPrograms and Publicity by Susan Williams, Producer<br />\nKaren Kaska, Lights by Gene Danko.<br />\nSome questions you may be left with:<br />\nCan a scalpel be accurately thrown?<br />\nCan a man be briefly immortal?<br />\nWhat was Jesus' greatest miracle?<br />\nWhat do we owe to the apostle Pedro?<br />\nWhat's a priest to CO<br />\nCan blood be taken from a man who refuses to make a<br />\nfist?<br />\nWhence Oedipus?<br />\nDo you call half a pint drinking?<br />\nHow will the labels read?<br />\nDo you want sex?<br />\nBy all means go. This is a thoroughly Hopkins<br />\nproduction. Friday and Saturday, April 29 and 30, at<br />\n8:00. Listening-Viewing Room.<br />\n—David Hodges<br /><br />\n— Tiff fltifl—Ay<br /><br />\nNEWS-LETTER<br />\nvol. lxxxi, no. 49<br />\neditor-in-chief<br />\nEric Garland<br />\nbusiness managers<br />\nVanessa Evan<br />\nCarole Jaffe<br />\nmanaging editor<br />\nDavid Hawk<br />\nfeatures editors<br />\nJ.D. Considine<br />\nMike Giuliano<br />\nphoto-production manager<br />\nJennifer Bishop<br />\nsports editor<br />\nDr. M.R. Bongue<br />\ngraphics editor<br />\nScott Marks<br />\nhigher consciousness<br />\nD.H. Warren<br />\ninterior decorating editor<br />\nRhona Lyons<br />\ncirculation manager<br /><br />\nHowie<br />\nproduction<br />\nDale Horan<br /><br />\ndopes<br /><br />\nd<br /><br />\nSTEVENS PRODUCT Ycl<br /><br />\nust when everyone concluded that Maryland had peeked<br />\nA<br />\nmFaimil<br />\nSHEETS &amp;<br />\ne<br />\nout of the Dark Ages in terms of the decriminalization of<br />\nPILLOWCASES<br />\nBeauh-Blend<br />\nmarijuana, yesterday's Evening Sun headline announced \"29<br />\nBeauticale<br />\n,<br />\nissiEe<br />\nn,erS<br />\nS<br />\nFHip°<br />\nFine Arts<br />\nf afe<br />\nPeanuts<br />\n(Comic strip)<br />\nParkville, Hereford Students Arrested On Marijuana<br />\n-Lets<br />\nHip<br />\nTasternaker<br />\nUtica<br />\nCharges.\" A smaller headline cryptically announced that<br />\nUtica &amp; Mohawk<br />\n:<br />\nt stkyShe<br />\ni WiaS,AIE<br />\n/sce<br />\nFjjiF aitnl<br />\nt<br />\nmore arrests were expected at other county schools. County<br />\nBLANKETS<br />\nBaby Stevens<br />\nForstmann<br />\nschool superintendent Robert Dubel expressed regret at the<br />\nUtica<br />\nwOOLE<br />\nbusts and promised cooperation with the police in handling<br />\nWORSTIf<br />\nCARPETS<br />\nFABRIC/<br />\nContender<br />\n.<br />\n\"our drug problem.\"<br />\nGulistan<br />\nBoldeena<br />\nMerryweather<br />\nForstmans<br />\nTastemaker<br />\nThere is more here than the obvious shallowness of this<br />\nHockanum<br />\nWorumbo<br />\nSLIPPERS<br />\nlatest crackdown by virtuous politicians, school officials, and<br />\nAlways in Step<br />\npolicemen on the pot-smoking high school youths of<br />\nBaltimore County. Those of us with inside sources in these,<br />\n4,f<br />\nhigh schools have been regaled with farcical tales, jokes, and<br />\none-liners about \"drug troubleshooters\" who are brought in<br />\nto close down the \"high school fun trade,\" special<br />\nvice-principals who spy on youths in the playground via<br />\nbinoculars, \"informants\" who whisper to school<br />\nadministrators about fellow student-druggies, and agents of<br />\nmorality who race around high school campuses on<br />\nten-speeds, whizzing up on teenagers before you can say<br />\n\"Reefer Madness\" or \"Yellow Peril.\"<br />\nA crackdown on high school alcoholics, or better yet, their<br />\nalcoholic parents might have been somewhat reasonable.<br />\nThe current and future marijuana arrests merely reek of a,<br />\nIn the Baltimore area, the recently<br />\nhotels, t,<br />\ndouble standard that does no more than gather Sun Citizens Committee forJ ustice forJ P. -formed stores,<br />\nStevens merchants, and 'Is w<br />\nheadlines.<br />\nWorkers has begun to organize activities in line<br />\nwill v oluntemt<br /><br />\nletters to the editor<br /><br />\nbar editor<br />\na. press<br /><br />\nAn Open Letter to Concerned Parties:<br />\nWe have respected The Johns Hopkins University for its<br />\nsupport<br />\nof a creative critic in the field of Chinese and Asian studies, Professor<br />\nRichard M.Pfeffer.<br />\nWe have appreciated his valuable contributions to the field, and<br />\nenjoy his vigorous intellectual—and warmly humanistic—presence as a<br />\ncolleague among us. With respect to the recent issue of his position at<br />\nJohns Hopkins, we think it imperative that he have the opportunity for<br />\nhis scholarship to be evaluated by the leading researchers and writers of<br />\nthe field, which we feel will confirm the high quality of his work.<br />\nWe look forward to his continued presence at Johns Hopkins, as we<br />\ndo to his continued contributions to our knowledge of China, Asia, and<br />\nstill more generally, of the structure and implications of capitalism and<br />\nsocialism.<br /><br />\nforeign affairs desk<br />\nMark Hertsgaard<br />\nKenneth Sokolow<br />\n(19091972)t<br /><br />\n\"Cheer to the Echo in<br />\nthe eighth. Go home<br />\na winner. Or call a cab.\"<br /><br />\nre<br />\nmovement that 10 to<br />\nitio° 1141<br /><br />\nJim Peck, Editor<br />\nAsia Library<br />\nPantheon Books<br /><br />\nProf. Noam Chomsky<br />\nInstitute Professor<br />\nM.I.T.<br />\nProf. Moss Roberts<br />\nAsian Studies<br />\nNew York University<br /><br />\nProf. Ernest P. Young<br />\nDept. of History<br />\nUniversity of Michigan<br /><br />\nNotes on thefol<br /><br />\nDr. Eqbal Ahmad<br />\nAssociate Fellow<br />\nInstitute for Policy Studies<br /><br />\nNOll at<br />\nn September of 1976 I asked permission to<br />\nhad no indica<br />\nk<br />\nteach a yoga class (as taught by the Integral Yoga<br />\ncourse was<br />\nInstitute—a non-profit organization) from the<br />\nday,<br />\nBy the<br />\nOffice of Student Activities. The course was<br />\npre-registered. agi<br />\nco-sponsored by the Office of Student Activities<br />\ndid not registetiolh:aiinuecir:<br />\nand approximately 55 people registered for it, 5070<br />\ncalled Chris u<br />\nof which were members of the Hopkins<br />\nbecadi<br />\nl<br />\nthe cass<br />\ncommunity. No fee was charged for rental space. students wil° kit(<br />\neias<br />\nDue to student demand, I called Chris<br />\nwould attend t\" llow<br />\nColombo's office in November once again and<br />\nclass was Canc<br />\nasked for room space to teach a course during<br />\nsti<br />\nanyway that<br />\nlies<br />\nintersession. Several calls later I was told there was<br />\ncorn°,<br />\nHopkins<br />\nno money available. The budget was tight. Lots of<br />\nwanted some .<br />\nthings ripped off in the Union had to be replaced.<br />\nFinancial? socil<br />\nIn December I called to request space for the<br />\nadditional sal°,<br />\nSpring. I was told that because of the heavy (wetldy<br />\nblack let tere:oi:J Cie<br />\ngroup<br />\ndemand from student organizations (unspecified)<br />\nthey wouldn't know until January. In January, I<br />\na1di<br />\nstudents).\"<br />\nwas informed that the Great Hall would now cost<br />\n5001 of the class proceeds to rent. The matter was not<br />\nThe class<br />\nnegotiable. In addition a stipulation was 'added<br />\nspace large<br />\nthat only members of the Hopkins community<br />\nwho registered in advance of the class at the Office gveitawayo:.<br />\nSupposed1Y<br />\nempyGREA12<br />\nAraPPej:<br />\nSooft1a<br />\nt1h::<br />\ns) 4!°0a,1 ?a1at 1<br />\nof Student Activities could participate.<br />\nWe were assured that the class would be goodesson<br />\nIsYe. i<br />\nOn atleas::i<br />\nadvertised widely throughout the University<br />\nyoga class<br />\nh;Nohardfe1 l (11<br />\nAs it turned out, the advertising was restricted to an<br />\n8\"x14\" sheet of paper that advertised the yoga<br />\nclass and a ballroom dancing class. The description<br />\nlearn about be -e<br />\nof the class was abridged to the point of offering<br />\nno meaningful explanation of the purpose of the<br />\nclass (which is not to learn how to stand on your<br />\nSue<br />\nhead or repeat ancient, mystical sanskrit chants).<br />\nIn addition the advertisement was delivered only o<br />\ntb efi osed<br />\nitonl<br />\nfincl:astritafo<br />\npo<br />\nibcoabutel3<br />\nto the Homewood community an not the medical<br />\ninstitutions.<br />\nFurthermore, the paper<br />\n, was distributed 4 days before the class started and that the Office<br /><br />\nJohn S. Service<br />\nCenter for Chinese Studies<br />\nUniversity of California-Berkeley<br /><br />\nRichard J. Barnet<br />\nCo-Director<br />\nInstitute for Policy Studies<br />\nProf. Howard Zinn<br />\nDept. of Political Science<br />\nBoston University<br /><br />\nProf. John Israel<br />\nDept. of History<br />\nUniversity of Virginia<br /><br />\nProf. Joseph W. Esherick, Chairman<br />\nAsian Studies Program<br />\nUniversity of Oregon<br /><br />\nI3LACK SOMEDAY?\\<br /><br />\nsli,,low,<br />\nStevens-made<br />\nlater plans 0,te s<br />\ndowntown, in 4elti/<br />\nboycott and ed tal p<br />\n01<br />\nThe national 4t<br />\nfltain<br />\nthe<br />\nas part of<br />\nConsistently v1(44an(<br />\nhas .willingly 1 out<br />\n(relatively weaTtill)<br />\nRelations Boaroloas<br />\nStep of providil‘<br />\none Stevens PIP'43 a<br />\nworkers in 0 vo<br />\nunionize. OP,<br />\nunionization P'till<br />\n,; ivh,<br />\nmass firings, P111<br />\nplant<br />\nmoving<br />\nrelatively scattel .a)ld<br />\nBaltimore ore<br /><br />\nProf. Morton H. Fried<br />\nDept. of Anthropology<br />\nColumbia University<br /><br />\nProf. Victor H. Li<br />\nLaw School<br />\nStanford University<br /><br />\nI<br /><br />\nwith the national boycott movement againstJ P.<br />\nStevens. The Committee, with University Chaplain<br />\nDr. Chester %ckwire and Congressman Parren<br />\nMitchell as co-chairmen, held an inaugural<br />\nluncheon April 20 in the Metropolitn Baltimore<br />\nCouncil Building, where about 50 people heard<br />\nvarious speakers and saw the local premiere of the<br />\nfilm \"The Testimony,\" a documentary concerning<br />\nthe plight of Stevens textile workers.<br />\nThe speakers, including Wally Orlinsky, Tom<br />\nBradley,(President of the Baltimore AFL-CIO),<br />\nTed Venetoulis, and Erika Outland (local rep of<br />\nthe Almagamated Clothing and Textile Workers),<br />\nrelayed the support of a wide range of political,<br />\nreligi us, and labor groups for the boycott, and<br />\noutlined plans for local activity.<br />\nThe campaign centers on an educational<br />\nprogram to be conducted through area churches<br />\nand other organizations, and, initially, a series of<br />\nvisitation teams to be sent to large department<br /><br />\ni<br /><br />\nAt'fCh<br /><br />\nI CT OYCOTT<br />\nPEFI<br />\nOven<br /><br />\nTABLE LINEN<br />\nSimtex<br /><br />\nIENV<br />\nlame<br />\nse<br />\nof the<br />\neta<br /><br />\nCOTTON FABRICS<br />\nAcademy<br />\nlady Twist Twill<br />\nTwist Twill<br /><br />\nSas<br />\nmaker<br /><br />\nILEN<br />\nSICS<br />\nlrla<br />\nmann<br />\nanum<br />\n,mbo<br /><br />\nSY NTHETICS<br />\n&amp;<br />\nBLEND FABRICS<br />\nBlen Tempo<br />\nCoachman<br />\nConsort<br />\nCarousel<br />\nGesture<br />\nStevetex<br />\n20 Below<br />\nLady.Consort<br />\nVVindsheer<br />\nlinebacker<br />\nWaftamatic<br />\nIcotton-nylon knit)<br /><br />\n-<br /><br />\n004eisett<br /><br />\nIs, ltals. The teams hope<br />\nlocal<br />\ngid S who<br />\nuse Stevens products,<br />\nate °t to order the various<br />\nle sll'I°wels, linens etc. Tentative<br />\ns L sornmer call for<br />\nrallies<br />\n..\"t„ling, and strengthening the<br />\nN Program.<br />\n,ilall l of Stevens products comes<br />\nhell.ltainst a company which<br />\nhas<br />\n014'411:lard labor practices, and<br />\nIY 1 °lit Millions of dollare in<br />\nieak throu6unt.<br />\nlost National Labor<br />\n)arrIllas to evade the more costly<br />\nvl ,471unt worker benefits. Not<br />\n5 P17, a union contract, though<br />\nRev voted two<br />\nyears ago to<br />\nOl'el3t, Stevens has<br />\nfought<br />\nI Rll through such<br />\ntactics as<br />\n;, PT Mlites<br />\nagainst blacks, and<br />\nit 9143 that<br />\nresistance has been<br />\ncatt6and ineffective. The<br />\nnew<br />\ncol'ec is<br />\npart<br />\nof<br />\na<br />\nnational<br />\nlat 1° to<br />\nremedy that injustice.<br />\n00°<br /><br />\nThe Young Republicans' rebuttal on the Stevens<br />\nCo. issue presents an interesting contradiction and<br />\nshows how truly uninformed they really can be.<br />\nFor years, Americans have been bombarded by<br />\nthe mass media with editorials concerning the<br />\nhorrible conditions of the Asian sweat shops where<br />\nmuch of American clothing is made. Working<br />\nconditions are poor, wages are low, hours are long,<br />\nand there is no job security. Stringent laws have<br />\nbeen passed in many countries forbidding such<br />\nsituations, but bribery and the big stakes involved<br />\nprevent their enforcement. The Young<br />\nRepublicans speak of freedom, of the choice<br />\nAmerican workers have to join a union, but the<br />\nonly way American business can compete with<br />\nsuch competition is to maintain the same<br />\nconditions in order to keep overhead low. I do not<br />\nconcur with the Young Democrats' whplehearted<br />\nsupport of unionization, but it is obvious here that<br />\nthere is something involved beyond the interests of<br />\nthe people. They are just the pawns caught<br />\nbetween the struggles of two power and<br />\nmoney-hungry concerns. To support either the<br />\nunions or the Stevens Company would be to<br />\nneglect those with whom the issue is truly<br />\nconcerned—the workers.<br /><br />\n'Working conditions are poor,<br />\nwages are low,<br />\nhours are long...'<br />\nThe St-evens-AFL-CIO conflict serves only as<br />\nfurther evidence that American democracy is<br />\nbeginning to fail. Despite the laudable ideals of the<br />\n- founding fathers, the rights of the masses are being<br />\nforsaken for the enrichment of a few. If nothing<br />\nelse, Watergate should. have shown the public that<br />\nthe efforts of an individual to take more than his<br />\nshare of power are merely hampered by the<br />\nbureaucratic red-tape which we call law. It is too<br />\nearly for anyone to call for an overthrow of the<br />\nsystem, but it has long been time for the public to<br />\ntake action in righting these wrongs. The<br />\nlegislation can act, but without public interest and<br />\ninvolvement it cannot be effective. Instead of<br />\ntaking opposing on all the issues simply for the<br />\nsake of argument, if the Democrats and<br />\nRepublicans are truly concerned with the welfare<br />\nof the people, then let them show it by helping to<br />\nget more people involved in the governing process,<br />\ninstead of maintaining a monopoly for a few<br />\npower brokers.<br />\n--Dante Landucci<br /><br />\nBook reviews: Percy and heroes<br />\nLancelot by Walker Percy. Farrar, Straus and<br />\nGiroux; clothbound, 257 pp., $8.95.<br />\nBy JOHN HOLDREN<br />\nHis first wife died unexpectedly. He discovered<br />\nthat his new wife was unfaithful, and that his<br />\ndaughter was not really his. His Southern mansion<br />\nhome burned to the ground with four people in it,<br />\namong them a man whose throat had been slit<br />\nfrom ear to ear with a Bowie knife. He has spent a<br />\nyear in a Center for Aberrant Behavior, trying to<br />\ncommunicate—by knocking on the wall—with the<br />\ngirl in the next cell, withdrawn into herself<br />\n)ecause she was gang-raped.<br />\nWth all those events whirling behind and<br />\naround him, Lancelot Andrewes Lamar, •the<br />\nenigmatic central voice of Walker Percy's Lancelot,<br />\ncan still say,\"There is only one reason I am telling<br />\nyou about these sad old things...It is because the<br />\npast, any past, is intolerable, not because it is<br />\nviolent or terrible or doomstruck or any such<br />\nthing, but just because it is so goddamn banal and<br />\nfeckless and useless.\"<br />\nAn ironic assertion? A madman's raving? The<br />\ntruth? Who can say? Lancelot Andrewes Lamar is<br />\nthe most complex, the most puzzling, and the<br />\nmost worrisome in a series of \"disconnected men\"<br />\nin Percy's novels. Like Binx Bolling in The<br />\nMoviegoer and Will Barrett in The Last Gentleman,<br />\nLance (as he is called) is out of sync with his time<br />\nand place—with reality, if you please. But Lance is<br />\nfurthermore a madman. Perhaps.<br />\nLance, unlike his fictional predecessors, does<br />\nnot readily elicit our sympathetic identification.<br />\nWhen we do recognize ourselves in him, they are<br />\nshocks we might rather deny. .That, however, is<br />\nnot so simple. For Lance, from the very beginning,<br />\nlinks himself to us. He makes us, quite literally, his<br />\ncaptive audience.<br /><br />\nfloni use controversy<br /><br />\nica a pre<br />\n-registration for the co-operation extended to us by the Dean of<br />\nE.,4111<br />\nStudents and Director of Student Activities<br />\nJay<br />\nClass, 11 students had Offices when they afford us room<br />\nspace for our<br />\nJ. agreed that<br />\nif 25 students many activities and programs.<br />\nster rae<br />\nMy second point, however, is being made<br />\nCO' gild would be cancelled. I<br />\nasked him not to cancel because it was not raised in the News-Letter article<br />\nkn<br />\n.ca<br />\nof at least 20 more last Tuesday. Our office questions the proposed<br />\njel'uNv how to register who room use policy especially regarding the<br />\nsuggested<br />\n1 ji ass. The<br />\nreply was that the guidelines for co-sponsoring events. In the past,<br />\n•w<br />\nWould his office know the Office of the Chaplain has been successful in<br />\nbslodents were from the bringing some prominent<br />\n, stimulating and timely<br />\nesides he stated that he speakers to thet Homewood<br />\ncampus due in part to<br />\ne<br />\nover the class. Legal? the co-sponsoring process. For example,<br />\nCesar<br />\n)ci 6' The<br />\nnight of the class 25 Chavez was brought to Shriver Hall a couple of<br />\nuo neared<br />\nto be greeted by a years ago by way of our office co-sponsoring the<br />\nA CLASS CANCELLED event 'with<br />\nthe Baltimore chapter of the<br />\nif we didn't get 25 AFL-CIO.<br />\nSpeakers such as<br />\n°,:ir.ii .asaY,,e„cl a solitary piano in an the economis<br />\nt from Columbia University,<br />\nI<br />\nstudents read the sign. Seymour Melman, the poet J ohn Ciardi,<br />\nWasirelY held off campus in<br />\na theologians Martin Marty and Harvey Cox, and<br />\nitltIloiiaecommod ate 15 students. Pete Seeger<br />\nand Arlo Guthrie the folk singers,<br />\n'the Nall was to no avail. could not have been sponsored<br />\nby our office alone<br />\nhe ad<br />\nbeen given to a campus because of financial considerations; and these<br />\nprograms might not have been done without the<br />\ni<br />\nrended meetings of the assistance of others. And yet no one can doubt<br />\n'cab, all lay empty...<br />\nthat individuals such as the above-named enhance<br />\n,e1r•<br />\nand<br />\nthe<br />\neducational atmosphere of the university.<br />\nJakie;<br />\nthis<br />\nwas a<br />\nfor Vo.<br />\nAll of us have a bit to<br />\nWe fear that the new room use policy could<br />\n0. as selfish, it's better to make it more difficult for the types of<br />\nforums that<br />\nwe feel well-rounded members of the ,Hopkins<br />\ncommunity should be exposed to. Another look<br />\nRay Rosenthal<br />\n,,,,fiss,<br />\nshould be given to the fee policy for co-sponsoring<br />\nvviie!<br />\ni ,, but rather as a matter<br />\nevents as well as other related factors that could<br />\n1.t 10 'Ice to make a couple<br />\nof possibly make it harder to enjoy the academic<br />\ntli ,<br />\ns,,ed room use policy<br />\nfreedom that has existed up to now.<br />\nall, it should be stated<br />\n,e<br />\nChaplain appreciates the<br />\nRalph Moore, Jr.<br /><br />\nki<br /><br />\nWalker Percy(and grandson),<br />\nIn Lance's dramatic monologue, Percy has<br />\nabandoned his characteristically smooth style.<br />\nNow, the words both repel and hold us. The<br />\ndignified desperation of the other novels has<br />\nbecome savage outrage. The subtle paring-knife<br />\nhumor has become a guillotine. And we are the<br />\npotential victims.<br />\nA fallen Southern gentleman and souring liberal<br />\nlawyer, Lance is stagnating in a modern age which<br />\naffords him neither direction nor identity. He is<br />\nthe \"Knight of the Unholy Grail,\" fading into<br />\nnon-existence, when suddenly the discovery of his<br />\nwife's infidelity leads him to a critical revelation :<br />\nthat there is a here and now, that it is intolerable,<br />\nand that he can do something about it. The actions<br />\nLance undertakes, and the plans he evolves for a<br />\nNew World, are based upon the \"Great Secret of<br />\nLife 'as he discerns it: 'God's secret design for<br />\nman is that man's happiness lies for men in men<br />\npracticing violence upon women and that women's<br />\nhappiness lies in submitting to it. The secret of life<br />\nis violence and rape.\"<br />\nYou may disagree with Ithat, perhaps violently.<br />\nIt is difficult, in any case, not to concur with<br />\nLance's (Percy's?) grim diagnosis of modern<br />\nAmerican life, especially his bleakly accurate<br />\ndepiction 'of our sexual maladies. The picture is<br />\nshocking, sobering—1 intolerable, Lance would say.<br />\nIf the present is intolerable, the past is even<br />\nmore so. Like many of us, Lance turns to the past<br />\nseeking a reaffirmation of the validity and<br />\ninevitability of his present condition: things just<br />\nhave to be this way. But the past only reveals<br />\nroads not taken, false triumphs, fragments shored<br />\nagainst his ruins. The present receives neither<br /><br />\njustification nor clarification from the past. For<br />\nLance, \"the mystery lies in the here and now,\"<br />\nand it grows ever more mysterious as one comes to<br />\nrecognize the overwhelming magnitude of that<br />\ncentral question : \"What is one to do with<br />\noneself?\" \\It may be the case that what Lance<br />\ndoes is in fact his undoing.<br />\nLance's story oscillates between a dark perverse<br />\ndespair and a strange frenzied hope. Reading it is<br />\nlike taking a wild roller coaster ride. As much as<br />\nyou might want to, you can't get off. And in the<br />\nend, you're left both exhausted and exhilarated,<br />\n•and perhaps a bit weak in the knees. That is<br />\nunderstandable. For, if nothing else, the visions of<br />\nLancelot will shake you. Maybe even scare the hell<br />\nout of you.<br />\nSuperfolks by Robert Mayer. (231 pp.; The Dial<br />\nPress. $3.95 in quality paperback format, $8.95 ill<br />\nhardcover.)<br />\nBy GARY SMITH<br />\n\"There were no more heroes.\"<br />\nSo opens \"Superfolks,\" Robert Mayer's comic<br />\nbook in novel form. His first published novel, it is<br />\na funny and often irreverent fiction, written for<br />\nadults who grew up hiding Dell comics in their<br />\ngeography text books, about the one superhero<br />\nleft, the greatest superhero of them all.<br />\nWho might this paragon of power be? Not<br />\nBatman and/or Robin. They were killed in a<br />\ntraffic smash-up. Superman? He's missing,<br />\npresumed dead, after a K ryptonite meteor<br />\nslammed into Metropolis. Wonder Woman? She's<br />\n,voluntarily given up her powers and become a<br />\nspokesperson for Women's Lib. The Lone Ranger<br />\ncaught an arrow in the back, and Tonto ran off to<br />\nWounded iKnee. Which leaves...<br />\n...A creation of Mayer's fertile imagination, one<br />\nvery close to Superman and going by the name of<br />\nDavid Brinkley. In any case, that's his civilian<br />\nname. He was sent to Earth as an infant from the<br />\nplanet Cronk, left a flourishing career as an ace<br />\nyoung reporter at a great metropolitan newspaper<br />\nfor broadcasting, but missed the smell of printer's<br />\nink. Now he's Oven up the airwaves, in both<br />\nsenses, and has his feet tied securely to the copy<br />\ndesk of his old newspaper. He's 42, married, the<br />\nfather of two children, has a nice wife and blue<br />\nhair. He's vulnerable to only one substance:<br />\nCronkite —and perhaps the ravages of time,<br />\nbecause, after eight years of retirement, his<br />\nsuper-powers are definitely on the wane.<br />\nHe has had attacks of weakness and has lost<br />\nconfidence in himself—as well as in the general<br />\norder. What could any superhero do faced with<br />\npolitical assassinations, racial disturbances,<br />\nVietnam and rampant street crime? The world has<br />\ncome of age and the problems seem<br />\ninsurmountable.<br />\nThat is how Brinkley feels until a fateful news<br />\nflash draws him unexpectedly out of his suburban<br />\nshell and back into the real world of crime and<br />\nviolence. But he has been devitalized so much that<br />\nhe crashes into atree in hisfirst attempt to leap tall<br />\nbuildings. Is there a criminal mastermind, and a<br />\nfoul plot to dispose of the last of the superheroes?<br />\nThe plot thickens...<br />\n\"Superfolks\" is a good, old-fashioned<br />\nmis-adventure story made contemporary by liberal<br />\ndoses of political intrigue, sex and some hilarious<br />\nexamples of celebrity malapropisms. Mayer<br />\nhandles it all with grace and ease.<br />\nAnd well he might. First novel or not, his name<br />\nought to have a familiar ring to it. For 10 years he<br />\nwas reporter and later a columnist for Newsday, a<br />\ngreat metropolitan newspaper. While he was there<br />\nhe won numerous awards for writing excellence,<br />\nincluding a National Headliners' Club award.<br />\nMayer seems to have kept his foot on the<br />\naccelerator the whole time in the story. It has a<br />\nsparkling beginning, just the slightest trace of<br />\nmiddle-pages spread and a clever end. The work is<br />\na whole, and a whole lot of fun, due to the<br />\nauthor's skill and imagination. I His gibes at the<br />\nnews industry and other writers have punch and<br />\nstyle, especially the parody on Norman Mailer's highly personal and often excessive style of<br />\nreportage.<br />\n\"Superfolks\" is the kind of book that could give<br />\nlightweight fiction a good name. It is some of the<br />\nbest of recent efforts at the genre, written to<br />\nentertain. Give it a read. It's far better than any<br />\nnight of the week on TV.<br /><br />\npage 8'<br /><br />\nnews-letter<br /><br />\napril 29, 1977<br /><br />\nThe new PALANTIR is out! At the Union Desk now.<br />\n\"411.\"OM'\"OW .11111. .11111..00..1110..1/11. .111111. AMP..4116111.<br /><br />\n.41ills Amu. am..101. Am.<br /><br />\nONE WEEK AIR CHARTERS FROM<br />\n1 !BALTIMORE/WASHINGTON<br />\nINTERNATIONAL<br />\n'CALIFORNIA<br />\nFrom<br /><br />\n-..t)f sacred<br /><br />\n. ;the altar<br /><br />\nThee<br /><br />\noutrad„.PhlIei<br />\nretràhingly<br /><br />\nI $229<br />\nPerlaerson — Air Oilly<br /><br />\ncome<br /><br />\nNON-STOP VIA AMERICAN AIRUNU<br />\nDepartum July 8ll'Augu.st<br /><br />\n0<br /><br />\nThe low price includes round trip jet transportation.<br />\nI appropriate meals and drinks aloft and air taxes. Ideal I<br />\nA forthe person who likes to go on his own or who will<br />\nI stay with friends and relatives.<br /><br />\n—Max Reed,{,i6+;*/ York baiiy<br /><br />\n\"Pyre gold...<br />\npus and amusing. The screen<br />\n' a Jackson is superb.<br />\nia, '<br />\nSandy Dennis06firii. steals the show,\"<br /><br />\nW<br /><br />\n—Judith Crlst, Sat day Rev,i.ew<br /><br />\n{pG}<br /><br />\nBRUT PRODUCTIONS PRESENTS A GEORGE BARRIE — ROBERT ENDERS PRODUCTION<br /><br />\nGLENDA JACKSON MELINA MERCOURI GERALDINE PAGE SANDY DENNIS<br />\nANNE JACKSON ANNE MEARA SUSAN PENHALIGON ,„\"NASTY HABITS\"<br /><br />\noho<br /><br />\nsit,rring<br /><br />\nEDITH EVANS<br /><br />\nosHildegorde JERRY STILLER 05 PP Pr.es, RIP TORN as moxynikon ELI WALLACH 0,monu9nor<br /><br />\nMusic by JOHN CAMERON Executive Producer GEORGE BARRIE adopted from The Abbess of Crewe- by MURIEL SPARK<br />\nWritten ond Produced by ROBERT ENDERS Directed by MICHAEL LINDSAY-HOGG Color by Technicolor (-s-<br /><br />\nNOW AT<br />\nWESTVIEW<br /><br />\nROTUNDA CINEMA VILLAGE CAMPUS HILLS CINEMA<br />\n40th St. and Keswick Rd.<br />\n235-1800<br /><br />\n1RRING PLAZA CINEMA<br /><br />\n6026 Balta. Nat'l. Pike I<br />\n788-7311<br /><br />\nReisterstown<br />\n1315-0744<br /><br />\n).t.1...fs<br /><br />\nRt. 22•Campus Hills Shp. Ctr.<br /><br />\nCINEMA HARUNDALE<br /><br />\nBeltway Exit 30<br />\n668-3111<br /><br />\nHarundole Mall Shp. Ctr.<br />\nSO. 1-6055<br /><br />\n1<br /><br />\n137Q0105<br /><br />\n_NORTHPOINT PLAZA<br />\nBlhvy. Ext. 40 Northpoint Hr. Merritt<br />\n288-9294<br /><br />\nI ALSO AVAILABLE<br /><br />\nWe have special reduced hotel and rent-a-car rates so<br />\n;that you can- plan your own California vacation in any of<br />\nV thirteen great California cities.<br /><br />\nI ESCORTED PACKAGE including San Francisco, i<br />\n. I Monterey and Los Angeles with deluxe accommodations, a<br />\n&amp; baggage transfers and handling, deluxe motor coach;<br />\nI transpatation'and sightseeing, full day at Disneyland and,<br />\nAround trip air transportation, S439 per person. double oc- 1<br />\n:cupancy. BURCH TRAVEL LTD<br />\nv<br />\ni<br /><br />\n3900 N. Charles St.<br />\n. Oust up the street)<br /><br />\n467-3901<br /><br />\nIt<br />\nII<br />\n.11111M. AVM. +=Do offiNN. 41111110 41 1 1 P. .1 1 1 1 ,•<br />\n401111. .1111.<br /><br />\nIOW .1111. 41111110.<br /><br />\nThe<br />\nBLUE KEY SOCIETY<br />\nneeds people to<br />\ngive summer tours<br /><br />\nFEATURive-:<br />\nCLIill BA DOMCES<br />\nWIN DHRIDG-E.<br /><br />\n4<br /><br />\nSPRINGWIND<br /><br />\n4,<br />\n114'<br />\n'4.4<br />\n44<br />\n:.<br /><br />\n4_<br />\nEVENT<br /><br />\n...................<br /><br />\nof the homewood<br />\ncampus. If you are<br />\ninterested drop a<br />\nnote with your<br />\nname box and<br />\nphone number in<br />\nbox 784.<br /><br />\napril 29, 1977<br /><br />\nYOU CAN STILL<br />\nTRAVEL &amp; STUDY<br />\nIN EUROPE<br /><br />\nEUROPEAN FLIGHTS<br />\nProvides the academic<br /><br />\n.1<br /><br />\nwith<br />\nTHE TOWSON STATE UNIVERSITY MIME TROUPE<br /><br />\nTonight at 8PM<br /><br />\nTRAVEL ARRANGEMENTS<br />\nAVAILABLE FOR<br />\nFOREIGN STUDY<br />\nPROGRAMS THIS FALL<br /><br />\nLet us serve you.<br />\n41<br /><br />\n\"AN EVENING OF MIME\"<br /><br />\nGEAR ED TOWARD<br />\nINDIVIDUAL NEEDS<br /><br />\nair travel arrangements.<br /><br />\n.1. .1.<br /><br />\nThe Office ofSpecial Events<br />\nPresents<br /><br />\nCOLLEGE CREDITS<br />\nOF FERED<br />\nFOR<br />\nINDIVIDUAL STUDY AND<br />\nTRAVEL THIS SUMMER<br /><br />\ncommunity with discount<br /><br />\nSave<br /><br />\npage 9<br /><br />\nnews-letter<br /><br />\nShriver Hall Auditorium<br />\nFREE ADMISSION<br /><br />\nThis Ad-Bring This Ad-Bring This Ad-Bring This Ad-Bring This AO<br />\nco<br /><br />\nTUITION AND<br />\nROUND TRIP<br /><br />\nBe Flexible<br /><br />\nsits<br />\nvcordmasters<br />\ndiscount records<br /><br />\nAIR TRANSPORTATION<br />\nEAST COAST<br />\nMID WEST<br />\nWEST COAST<br /><br />\nCALL US LAST<br /><br />\nS350.00<br />\nS365.00<br />\nS455.00<br /><br />\n&amp;topes<br /><br />\nIA<br /><br />\nCALL TOLL FREE:<br /><br />\nToll Free 800-223-1722<br /><br />\n800-223-1722<br />\nNEW YORK 212-986-7624<br /><br />\n•<br /><br />\nA<br /><br />\nThe<br />\nchallenge.<br />\nYour challenge is to construct the mystery<br />\nword in the boxes below. To do this you must<br />\nfill in the correct missing letter in each of the<br />\nwords listed in the columns.Then transfer the<br /><br />\nmissing letters to the corresponding numbered boxes. Keep an eraser handy—it's not<br />\nas easy as it looks!<br /><br />\nThe Rotunda<br />\n711 West 40th Street<br />\n366-1250<br /><br />\nFULL LINE RECORD STORE<br />\n••• with a complete<br />\nstock of classical, rock,imports,<br />\npopular&amp; --jazz!!!!<br /><br />\n\"<br />\n\"<br />\n1 4111111/'<br /><br />\nI<br /><br />\nDISCOUNT I<br />\nPRICES<br /><br />\nEXTRA DISCOUNT<br />\noff on anY<br />\nIpis or tapes<br /><br />\nSALE ITEMS I<br />\nEXCLUDED<br /><br />\n•Li_<br /><br />\nWILii ullS au— --<br /><br />\nONE AD PER CUSTOMER<br />\neffective this Fri.(April 29) thru<br />\nThurs. May 5<br /><br />\nUBS 1977<br />\n4. FAC S<br />\nOAST<br />\n5.<br />\n6. TEA_ _S<br />\nILS<br />\n7.B<br /><br />\n8. TRAI<br />\n9. QU____TE<br />\nio. BR WN<br />\nAILS<br /><br />\nWhen there's a challenge,<br />\nquality makes the difference.<br />\nWe hope you have some fun with the challenge.<br />\nThere's another challenge we'd like to offer you, too.<br />\nThe Pabst challenge:<br />\nWe welcome the chance to prove the quality of<br />\nour beer. We challenge you to taste and compare<br />\nPabst Blue Ribbon to any other premium beer. You'll<br />\nlike Pabst better. Blue Ribbon quality means the best<br />\ntasting beer you can get. Since 1844 it always has.<br /><br />\nPABST. Since 1844.The quality has always come through.<br />\n1976. PABST BREWING COMPANY Milwaukee, Wis., Peoria Heights. III., Newark, N. J.. Los Angeles. Calif . Pabst, Georgia.<br />\nN011VE1E1313D (Nom AJoisAvy<br /><br />\nCharter Tours<br />\nD.C. &amp; Bah. Departures<br />\n1111111111111E•111111111311111■111111111101111111••11111111•111•11<br />\nfrom<br />\n3 week 'charters<br />\nWeekend<br />\nkend<br />\n0_nis<br />\n)<br />\nDepartures.<br />\npars via3 B<br />\n.<br />\n•<br />\nL.aledonuianAirways<br />\nair only<br />\nABC &amp; TGC<br />\n111111110•1111111111111111•1111111111111111111111111111111N1111111•111111<br />\nfrom<br />\nParadise Island<br />\nHoliday Inn<br /><br />\n1.2.1<br />\nLondon,<br /><br />\n289<br /><br />\nBahamas<br />\nMexiC<br />\nHawaii tilJtiodnalfialnwa7afrlica<br /><br />\n$299<br />\ne315<br /><br />\nJuly—Nov - 3299 '<br />\nMar—Apr<br />\nl7 w ke nd'359<br />\nd e par tures<br />\nAir, Hotel, Tax Pied m<br />\nall inclusive<br />\nOTC<br />\neeo n t Aidin s<br />\n1111111•111•••111_11111111111•111••111••••••1111•1111•1111111•<br />\nAcapulco $315-9 depar- from<br />\ntures Feb-Dec. Tri-Mexicio<br />\n14066-4 departures July-Oct ,9<br />\nLunavdia si a3 jauly/P22uNto<br />\nAir, Hotel, Tax American &amp; United Airlines • all inclusive<br />\nOTC &amp; ITC<br />\n111111111111111••111111111111111•1111111111111111111111•••1111111•111<br />\nfrom<br />\n_ _ Waikiki Village '429<br />\nisllm<br />\n4a9<br />\n6e4-3D499 $345<br />\nV<br />\nrtur<br /><br />\nm<br /><br />\nAmerican &amp; United Airlines<br /><br />\nABC &amp; OTC<br />\nonill<br />\ny MINN<br />\nu ll<br />\n1111111111••111111111111• 111111111111•1111111111111• 1111all<br /><br />\nIreland<br />\nPlease call<br /><br />\nBURCH.<br />\nTRA:mir„„.<br />\nLTD<br />\nv<br /><br />\n467-3900<br /><br />\npage 10<br /><br />\nnews-letter<br /><br />\nYoga Classes at Iloinewood starting<br />\non May 5th at 6:00 P.M. Ray<br />\nRosenthal, M.D. - Johns Hopkins<br />\nSchool of Hygiene and Public health,<br />\nwill offer a Hatha Yoga course that,<br />\nwill meet for four weeks, to be held:<br />\noutdoors on the Homewood Campus..<br />\nAll those interested should meet in.<br />\nfront of the Hopkins Student Union<br />\nat 6:00 P.M. sharp. Bring a blanket.<br />\nwear loose fitting clothes and try not<br />\ndo eat at least 2 hours before the,<br />\nclass. THE CLASS IS FREE! and last<br />\nan hour and twenty minutes.,<br />\nInstruction in Yoga postures,.<br />\nbreathing practices, meditation and.<br />\ndeep relaxation as taught by Sri<br />\nSwami Satchidandnda, founder.<br />\ndirector of the Integtal Yoga<br />\nInstitutes (local institute - 2445 Porter,<br />\nStreet - Washington , D.C. 20008 Tel.(202) 244-5538.<br />\nAttention PRE-LAW STUDENTS:<br />\nMike Kelley, Dean of University of<br />\nMaryland Law School, will give a Law<br />\nDay adress entitled \"Cynicism..<br />\nLawyers, and the Law<br />\non,<br />\nMoriday May 2, at 3:00 P.M. in the,<br />\nGarret Room of the Library. Dr. F.<br />\nDierman will discuss important<br />\ninformation concerning law school<br />\nadmissions and application<br />\nprocedures. Please attend.<br /><br />\nThe Return of the<br />\nThin White Notes<br />\nScatter plots for the applicants of<br />\nthe medical school entering class of<br />\n1978 are in the hands of the Health<br />\nProfessions Recommendation<br />\nCommittee members and the Office of<br />\nAdvising and Counseling, Homewood<br />\nHouse.<br />\nLabels are also now available for<br />\nthe medical schools to which you are<br />\napplying. Please bring your list of<br />\nschools by Miss Linda Garren's office,<br />\nHomewood Ilouse, to pull your labels<br />\nand receive instructions as to the<br />\nmailing of y ur recommendation<br />\nletters.<br />\nThe B.I.A. is seeking new members.<br />\nForms are available at the gym and arei<br />\ndue Mon. May 2, at 5 P.M. Interviews<br />\nwill be held Mon. evening. For details<br />\n- 243-2305.<br />\nThe B.I.A will award the G. Wilson<br />\nShaf fe,r Award on May 7th.<br />\nNominations of non- varsity seniors<br />\nwho have been active with athletics at<br />\nHopkins will be considered. Due<br />\ntoday at 5 P.M. in the gym office.<br /><br />\nFINALS BAR OF THE WEEK--MAURY'S 25th &amp; Howard<br />\n4.44~44$11~41104,4P•INS4•4-#44<br />\n+111-1N4<br />\n,<br />\n4~4<br />\n,<br />\n.P.P.....-44P4P4A1<br />\n,<br /><br />\nliniversiN SandvAchShoppe and Defi<br />\nAl Lamp Crab Cake,<br />\nGeouiae ICodiar Co/aid %of<br />\nDdicioes Roast Bort<br />\nVnia Baked Hero<br />\nVarious Cold Cots<br />\nOwns(Swim Provolooe, Meemele0<br />\nKokes Hot Dogs<br />\nCaesars<br />\nParty Tarr(srecili oldie)<br />\nPlaza<br />\nHowe Made Dome(Chem Cake)<br />\nIce Crew<br />\nSelect Grocay Items<br />\nNeale<br /><br />\nRESTAURANT &amp; CARRY OUT<br />\nUPNVIERSITY PARKVVAY<br />\nMem 467-6112<br />\nAT T. PAUL<br />\nNI • Pei: 9:30 - 7:00<br />\nWSW. WHVIORIBITY OP APT..<br />\nSat 930 - 2:00<br />\nDomed Soadays<br />\nFREE SODA WITti TIM A1) AND<br />\nPURCHASE OF $1.00<br /><br />\nTHINK SUMMER...<br />\nTowson State University<br />\nSummer Sessions<br />\nOver 500 graduate and undergraduate<br />\ncourses will be offered in three convenient<br />\nsessions.<br />\nFirst five-week day session:<br />\nJune 22-July 26<br />\nSecond five-week day session:<br />\nJuly 27-August 30<br />\nSeven-week evening session:<br />\nJune 22-August 10<br /><br />\nThe JHU Gay Caucus will hold<br />\nit's last meeting of the year, Tuesday,<br />\nMay 3, at 8:30 P.M' in Conf. Rm. A<br />\nof the Student Union. All members<br />\nare urged to attend. For more<br />\ninformation, call 366-0488.<br />\nAny undergraduate interested in<br />\nparticipating in the Dept. of Romance<br />\nLanguages' experimental teaching<br />\nprogram (drill and conversation of one<br />\nhour of French Elements per week)<br />\nduring the Fall semester should<br />\ncontact Mrs. Sullivan or Mrs.<br />\nBirnbaum (Gilman 221) on Monday,<br />\nMay 2, 2-4:00 P.M. or Wednesday<br />\nMay 4, 10-12:00 A.M. Requirements: a<br />\ngood knowledge of spoken French<br />\nand of grammatical structures;<br />\ncompletion with a grade of A or B of<br />\nthird -year college French or.<br />\nequivalent.<br /><br />\napril 29, 1977<br /><br />\nOn Tuesday, April 12, a panel of the<br />\nUndergraduate Academic Ethics<br />\nBoard met to hear charges against a<br />\nstudent who had been accused of<br />\ncheating on an Introductory<br />\nChemistry examination (Chem 3.2).<br />\nThe student pled guilty to the charges<br />\nand received as penalty failure in the<br /><br />\nJoyce Carol Oates' will be reading<br />\nselections from her collected<br />\nssortment of fiction in Remsen 1,<br />\nFriday, April 29, at 8 P.M.<br /><br />\ncourse.<br /><br />\nhe Blue Key Society, in<br />\nconjunction with the Admissions<br />\nOffice, will be offering summer tours<br />\nto prospective students and other<br />\ninterested persons. If you are planning<br />\nto be in Baltimore for the summer (or<br />\npart of it) and would like to give tours<br />\nof the Homewood Campus, contact<br />\nCindy Simon at Box 784 or at<br />\n825-0483 and leave your name, box<br />\nand phone number. ,All Hopkins<br />\nundergraduates are invited to<br />\nparticipate.<br />\nA blue and yellow felt flag<br />\nbelonging to the Alpha Chi Sigma<br />\nChemistry Fraternity was taken from<br />\nroom 101 in Remsen Hall on Friday<br />\nnight, April 22. If it is found, please<br />\nreturn it to us in the Chemistry<br />\nDepartment. Remsen Hall. No<br />\nquestions asked.<br /><br />\n•<br /><br />\nWill the person who won the golf<br />\ngame with the Chaplain at the<br />\nChaplain's Office Auction please come<br />\nto said office to claim it? Chet has his<br />\nclubs ready and polished.<br /><br />\nThe International Studies Forum<br />\nwill hold a vital, but short, meeting to<br />\nelect officers for next year. Meeting<br />\nwill be in Gil. 42, at 7 P.M., on<br />\nTuesday, May 3.<br />\nIf you are a voting member, or just<br />\ndig the Gatehouse scene, come on<br />\ndown to the annual News-Letter<br />\nelections. The action will begin at<br />\n5:30 pm Eastern Standard Time in the<br />\nGatehouse on Tuesday afternoon<br />\n(May 3, 1977).<br /><br />\n•••<br /><br />\ndasstheds<br /><br />\nBURGH TRAVEL LTD<br /><br />\nTYPING - Beautiful Work.<br />\nSpecialty: Medical<br />\nTerminology. Call<br />\nS unday-Thursday; 486-8337<br />\nFEMALE ROOMMATE<br />\nWANTED. Quiet townhouse<br />\nnear Hopkins. Call 532-9159<br />\nor 358-3710.<br /><br />\n3900 N. Charles St.<br />\n467-3900<br /><br />\nI?<br /><br />\nWe enjoy helping the<br />\nr/ Hopkins Community fwith<br />\ntheir travel plans.<br />\n•<br /><br />\nSPANISH by experienced native<br />\nteachers - All levels, all ages<br />\n366-2056.<br />\nCONSUMER ACTIVIST: Work for<br />\n.social change and earn a living too.<br />\nMaryland Action is interested in<br />\nstudents, college graduates and<br />\ncommunity minded individuals to<br />\nfill canvas-organizing-research<br />\npositions. Call 933-8064.<br /><br />\n—•<br /><br />\n.ROBINSON'S GORSUCH HOUSE<br />\n11 GORSUCI1 AVENUE 235-2744<br /><br />\nTwo students want to take care<br />\nvacationer's home during th<br />\nsummer months Call:366-5286.<br /><br />\nrawty-dECORATEd1<br />\nNEW MIANAgE1MIENT!<br /><br />\n1<br />\nDear May, At 20 you may<br />\nhay e passed your prime but - I<br />\nstill love you, anyway. Happy.<br />\nbirthday, babe. IBID.<br />\nFran<br /><br />\nfEATURiNg...<br />\ngREEk &amp; AMERICAN CUISINE<br /><br />\nCOME IN ANd TRy OUR<br />\n*<br />\n*<br />\n•<br />\n*<br /><br />\nFlaming shiskabob<br />\nGreek salad<br />\nPastitsio mousaka<br />\nBaklava<br /><br />\nGRE • GMAT • SAT<br /><br />\n..00ms available for private parties<br />\n--- Banquets --- Catering ---<br /><br />\noriginal study materials<br />\nsmall groups • tape center<br />\nsummer &amp; compact course<br /><br />\nCALL<br />\n(202)<br />\n244-3010<br /><br />\nNONDENO.MhVAT/ONAL<br />\nOFFICE OF THE CHAPLAIN<br /><br />\nEDUCATIONAL CENTER<br />\n,<br />\n4201 Connecticut Avenue, N.W.<br />\nWashington, D.C. 20001<br /><br />\n\"THE SUNDAY EXPERIENCE\"<br /><br />\npresents<br /><br />\nJOHN GA ('II BOOKSHOP<br />\nB41 TIMORES LARGEST<br />\nBOOKSTOR<br /><br />\nII<br /><br />\nRegistration by mail will continue through<br />\nMay 16. For additional information, call or<br />\nwrite:<br /><br />\n\"GENETIC RESEARCH AND<br />\nTHE RECOMBINANT DNA CONTROVERSY\"<br /><br />\n4<br /><br />\nDivision of Continuing Studies<br />\n321-2022<br /><br />\nwith<br />\nDR. PHILLIP HARTMAN-Biology Department, J.H.U.<br /><br />\n11<br /><br />\nGraduate Studies<br />\n321-2501<br />\nTowson State University is an Equal Educational Opportunity Institution in compliance with Titles VI and IX.<br /><br />\n1<br /><br />\n41111P. .11111. .111111.. 411111.<br /><br />\nDR. DONALD BROWN-Carnegie Institute<br />\nDepartment ofEmbryology<br /><br />\nI<br />\n61:<br /><br />\n11,<br /><br />\nMR. TED HO WA RD-Co-Director of The People's<br />\nII<br /><br />\nSUNDAY,MAY 1, 11:00 AM<br />\nLISTENING - VIEWING ROOM<br />\nLEVERING HALL<br />\noe.S82.562..S2.525i..S882.5662.56662.Se.5825e..5688254.S668688686esoesaes<br /><br />\n3322 .Grecourtount Awe.<br />\n46 74344<br />\nUSED AND RARE<br />\nOLD AND OUT—OF—PRINT<br />\n.411M.<br /><br />\n+Mr<br /><br />\nROSINESS<br /><br />\nBusiness Commission Washington, D.C.<br />\nDR. RICHARD CONE-Biophysics Department, J.H.U.<br /><br />\nor-te;)ti<br /><br />\n.6111M.<br /><br />\nOPPOP TtiNiTN<br /><br />\nStuff Envelopes<br />\n$25.00 PER HUNDRED<br />\nImmediate Earnings<br />\nSend $1.00 To:<br />\nEnvelopes Dept.339A<br />\nFranklin Street<br />\nBoston,Mass. 02110<br /><br />\n310<br />\nL<br /><br />\napril 29 1977<br /><br />\nnews-letter<br /><br />\npage 11<br /><br />\n.41=1111111<br /><br />\nSenior Class Film Series<br /><br />\nTAe. S.0.P;)11)<br />\n4 Lit (451-rwk?re.6<br /><br />\npresents<br /><br />\nTib: Oa(<br />\nConccAT<br />\n-lb be 40.0,6 &amp;pie),46/ 9,1(111?<br />\n'ReoT. glut tk-Gjt Cs) s<br />\nt,.)001A mr:61<br />\ni•<br />\nRkE.,-to see,<br />\nkelovi,<br />\n0,1i tic pAeAvt1w I--thlot 5.<br />\n.Y.1 CDraitO<br /><br />\nJk31ot1e,61-<br /><br />\natlomick NthrA S%11;f1<br />\nIltlec-Tko- teAto<br />\nGvJult<br />\n•<br /><br />\nch;p•sa.<br />\ne*BpecoAleij<br /><br />\nPols<br /><br />\ntofireA<br /><br />\nFor questions<br />\nor comments<br />\ncall<br />\nRandy Randazzo<br />\n467-5052<br /><br />\nKorn<br />\n?Agit PolvAei<br />\nSew<br /><br />\n53:x IAAYJ<br />\nSATAJ<br /><br />\nFRI. &amp; SAT.<br />\nApRil 29 &amp; 30<br /><br />\nShaffer 3<br /><br />\n7:00<br />\n9:00 &amp; 11:00<br />\nAdmissioN s1.00<br /><br />\ncotl,tS;&amp;e.lotwn<br /><br />\nTt)kP-S<br /><br />\nCAT OUT 111E<br />\n•<br />\nlick% RebtOtot Cow.fl12<br />\nIt&amp; loclibt Iwo<br />\n1.A<br />\n6.1.464. owl 1200,A, bl Does mdi,1 them.114s,<br /><br />\nSmioRs $.75<br /><br />\nThe Student Council<br />\n• Selections Committee<br />\nwill hold selections for<br />\nfour C.U.S. members<br />\nfor 1977-1978<br />\nThe C.U.S. (Committee on<br />\nUndergraduate Studies) is a<br />\npolicy-making committee<br /><br />\njumoshcA“<br />\n\"NilE ON...11-IE<br />\nCliE4ArEAKE'<br /><br />\nconsisting of five faculty<br />\nmembers &amp; four students.<br />\nSign up for interviews 6:30 p.m.<br />\nTues., May 3,1977 If you have<br />\nquestions , please contact Steve<br />\nLovejoy 523-2461 or Patrice<br />\nGallagher 366-4234<br /><br />\n-<br /><br />\nFINAL 4ALE. PATE MK<br /><br />\nAT1CKEE<br />\nf4#(5. 'A<br /><br />\nIA VNION<br /><br />\notsave<br /><br />\n6$<br /><br />\nMaking the Fair<br />\nSafe for violence<br />\nBy ERIC GARLAND<br />\nThis year's Spring Fair didn't seem to bring as many<br />\npeople to Hopkins as in the past; it also escaped a rainy<br />\nwashout for three straight days. What the Mardi Gras did<br />\nget, however, was a mixture of violence and police<br />\nactivity that, in retrospect, has been unusually absent<br />\nfrom past fairs.<br />\nNMth anywhere from ten to forty thousand people on<br />\ncampus for a day, drinking beer and smoking dope, taking<br />\nninety-degree heat and waiting in long lines, it should be<br />\nexpected that a few among the crowd will get punchy-by<br />\nlate afternoon. Especially those few that happen to be<br />\nragged local punks or overeager lacrosse players—it<br />\ndoesn't take too many Schlitz lights or poorly-chosen<br />\nwords to bring out the worst in people.<br />\nThe knifing incidents in the freshman quad are general<br />\nknowledge: one Hopkins student slashed and a teenager<br />\ncut in a back-and-forth brawl around the ride area. Along<br />\nwith this well-known melee, there were a number of<br />\nminor scuffles. One in particular took place about a<br />\nhalf-hour before the stabbings, precipitated by the same<br />\ngroup responsible for the later scuffles.<br />\nCharacterizing the Friday night fight was a uniform<br />\nlack of sensible action by the campus police. Those<br />\non-hand for the entire affair, and others involved in<br />\nisolated fistfights, had common complaints about the<br />\nfumblings of the blue-uniformed security force. After the<br />\ninitial outburst in the freshman quad—rather serious with<br />\none man ganged up on by local youths—the campus cops<br />\nfailed to respond to repeated warnings and identifications<br />\nof the troublemakers. Instead, they waited for the arrival<br />\nof city police, making no attempts at crowd control and<br />\nstaying clear of those pointed out as brawlers, the ones<br />\nwho would later start the knife fights. \"The cops were<br />\nIntimidated more. than anything, just scared,\" said one<br />\nobFrvor.<br /><br />\nor-<br /><br />\n%en the city police got to the freshmen quad they<br />\nreceived little help from campus security in the way of<br />\nrounding up the instigators. Outside of the people stabbed<br />\nor those who actually fought with the city police, the<br />\noriginal gang that had been repeatedly identified to the<br />\ncampus police was relatively ignored (in fact, they<br />\nreappeared Sunday at the Fair, ready for more<br />\nencounters.)<br />\nOnce the city police cleared the amusement area in the<br />\nfreshman quad, they toliped.off a confused evening by<br />\nproceeding to the Gilman Quad, where a jazz band had<br />\nbeen scheduled for a 9:30 show. The band had moved<br />\nindoors to the Glass Pavilion, apparently for fear of rain. •<br />\nUnfortunately, there was little notice given to those<br /><br />\nmilling about the Quad, wondering what had become of<br />\nthe performance. The police then came into the Quad,<br />\nsaw the crowd of people that seemed to be loitering for<br />\nno reason, and with the ride-area hubbub fresh in their<br />\nminds, went about kicking everyone out of the area.<br />\nNumerous complaints were voiced about the over-reaction<br />\nof the police, of excessive hassling of those that happened<br />\nto have a plastic beer cup in hand.<br />\nThus the Mardi Gras, with its theme of insanity amid<br />\nrevelry, had an offshoot of violence that was grossly<br />\nmishandled at the start, and then typically over-reacted to<br />\nat the end. Next year's Fair will have that to go on.<br /><br />"}], "field_media_file": [{"target_id": 41221, "display": null, "description": null, "target_type": "file", "target_uuid": "070080bc-4c03-44ff-bad1-6e855e747af7", "url": "http://digital.library.jhu.edu/system/files/2022-03/14356-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14356, "target_type": "node", "target_uuid": "2875bf01-ff0f-4532-a037-07ef52929f11", "url": "/node/14356"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4b95e323-3e9c-4d81-9873-74b9b4b26a3d"}]}