{"mid": [{"value": 39480}], "uuid": [{"value": "1252f9c2-d56a-4c81-9562-0a182f667c1f"}], "vid": [{"value": 39480}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:34:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "14026-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:34:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:34:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "969<br />\n<br />\nmo/<br />\n<br />\nRemembrance of Things Past<br />\n<br />\nNews-Letter<br />\nthe johns hopkins university<br />\nDecember 15 1969<br />\n<br />\nEND-OF-THE-DECADE SPECIAL<br />\n<br />\n74TH YEAR<br />\n<br />\n•<br />\n<br />\n•••<br />\n<br />\nPhotograph copyright R.L.Haeberle<br />\n<br />\nLife contracts and death is expected,<br />\nAs in a season of autumn.<br />\nThe soldier falls.<br />\n<br />\nDeath is absolute and without memorial,<br />\nAs in a season of autumn,<br />\nWhen the wind stops,<br />\n<br />\nHe does not become a three-day personage,<br />\nImposing his separation,<br />\nCalling for pomp.<br />\n<br />\nWhen the wind stops and, over the heavens,<br />\nThe clouds go, nevertheless,<br />\nIn their direction.<br />\n----Wallace Stevens<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE 2<br />\n<br />\nDecember 15, 1969<br />\n<br />\nJust as Honest as Each Other.You Know.<br />\nThe sun is just beginning to do whatever it does before<br />\nit rises, you know, the part where the clouds start<br />\ngetting tinged and then a little bit of the sky, but still<br />\nno sun itself. That part.<br />\nSloan wrote what this article was originally going to<br />\nbe. He gave it to me at 3:30 or so and went to bed. I<br />\nfinished writing a really poor paper, had some soup and<br />\nlook at this now, as you look at it, but to tell you the<br />\ntruth my mind isn't really on you, the reader. If anything it's on the sun. Sloan says:<br />\n\"The single image that we all shall carry with us<br />\ninto the new decade is the one that was caught, in the<br />\nquaint American fashion, by a home movie camera: the<br />\nskull ofJohn F. Kennedy being fragmented into oblivion<br />\nbeneath an explosion of blood in the back seat of a<br />\nLincoln Continental convertible. The explosion of blood<br />\nin that picture managed to cover the remainder of the<br />\ndecade so that now, at its close, we can remember little<br />\nelse. We can regret only that Haskell Wexler was not<br />\nthere to take a shot, for then, perhaps the image of the<br />\nblood would have been clearer, we might have known<br />\nwhat to expect.\"<br />\nI don't know. I can't say I was bothered by the first<br />\nKennedy assassination at the time--I was more sort of<br />\nnegatively amused. A 15 year old cynic, I thought the<br />\nwhole New Frontier business a lot of PR shit, which a<br />\nlot of it was, and I thought it would probably be more<br />\nexciting to vote for Barry Goldwater who at least flew<br />\njet fighters while the best Kennedy could do was sail his<br />\ndamn yacht with a lot of other rich people.<br />\nI don't know. I remember some commentator saying<br />\nhow it was good that there wasn't any regular TV that<br />\nweekend so that even the youngest child would sense<br />\nthat something was very wrong. Aldous Huxley died that<br />\nweekend and nobody even knew. That there was no TV<br />\nand that everybody ignored Huxley's death was the way I<br />\nwould remember that something had gone wrong.<br />\nAgain, I don't know. Hemingway's death bothered me<br />\nmore, even before everyone started nodding knowingly,<br />\nassuring each other that it was a suicide. I had wanted<br />\nto become part of an American literary culture and was<br />\nhopelessly frustrated that part of that culture could get<br />\naway, one way or another, before I could read all his<br />\nbooks, much less meet him. I was twelve and still going<br />\nto bed at 10 o'clock when Hemingway wrote his final<br />\nstatement on manhood with his shotgun. It amuses me<br />\nthat I must finish this by another 10 o'clock, when<br />\nSloan said he would wake up and take it down to the<br />\nprinters. Hemingway was too virile for Dex.<br />\n\"Now it is all a blur, crepe black and blood and<br />\nmaybe a few faces, not all violence, but all very dead:<br />\nthree Kennedys, three sex symbols, three Mississippi<br />\ncivil rights workers, Lincoln Rockwell, Medgar Evers,<br />\nMartin King, Malcolm X, 40,000 \"American boys\",<br />\nhundreds of thousands of \"oriental human beings\",<br />\nEisenhower and Nehru and Ho and drivers of cars and<br />\nstarving people and on and on and inevitably on.\"<br />\nAnd Sloan's father and my best friend, and three of<br />\nSloan's high school buddies in Vietnam, a few people<br />\nPete Harnik knows, friend's lovers, lover's friends by all<br />\nthe oddities of a sleeping God. I tell you we are as honest<br />\nas each other. I tell you we die by each other in one way<br />\nor another.<br />\nI think it happened this way: In the beginning of<br />\nthis decade, for all purposes as far back as I can go,<br />\nthere started to happen what we then thought of as<br />\nfreak occurrences, incredible things which had never<br />\nhappened to us and/or the world before. Then there<br />\ncame so many of these freak occurrances that soon,<br />\nsometime during the decade, you began to wonder just<br />\nwhat was normal and who was the freak occurrence. I<br />\nthink that I am alive is a freak occurrence--the circumstances are not worth going into—and that is the worst<br />\nfeeling I have had all decade.<br />\n\"Who needs to be reminded of all this and who<br />\nwant to forget? But these were our formative<br />\nnot<br />\ndoes<br />\nyears, the years during which we got our first fuck, the<br />\nyears that you want to remember for all the personal<br />\nthings that happened. You must forget about what<br />\nwent on around you, or at least ignore it: the assassination generation will end up the suicidal generation if it<br />\ndoes not try to forget. That is why we drop, that is why<br />\nwe don't give a damn about the future, that is why we<br />\ndo our best to get laid often. We go to the X movies<br />\nbecause they are about nice things like drugs and sex<br />\nand because the G movies are about war and the American aream ana otner Kinds 01 certain death. We matur-<br />\n<br />\ned surrounded by blood: it has either perverted us or<br />\nsaved our humanity. We have been shocked into the<br />\nsimplicity of shouting j'accuse at the controllers of all<br />\nthis bloodshedding, but we have no idea when and how<br />\nit will all stop. Why should we wish to be a part of a<br />\nworld destroying itself; amid the killing, the natural<br />\ndeath is lost: we shall be grateful just to get the chance.\"<br />\nAs I typed that, I began to think that, perhaps<br />\nbecause of I don't know what, that that paragraph above<br />\nthis one is one of the small enduring things, that the AP<br />\nor UPI might find, that it might make an obscure anthology, that it might be read on a television program about<br />\nour troubled youth and the sometimes ease of their<br />\ndifficult expression. Or it might be shit. Sloan said it<br />\nwas.<br />\nI review it for me:<br />\nFormative years are getting soggy in a Junior High<br />\nDancing class with a girl named Harriet who has overdeveloped breasts for a twelve year old, breasts that<br />\nmight also have pimples on them, like the rest of Harriet,<br />\nbut this is the least of all your shame ridden speculation.<br />\nFormulative years are Drake saying he got laid in Mexico<br />\nwhen he was twelve, an incredible lie. Formulative<br />\n<br />\nyears are reading On the Road and then madly peddling<br />\ntwenty miles on your bicycle just to prove to Kerouac<br />\nthat you're on his side.<br />\nI got laid when I was older at a party;! got raped<br />\nbecause nothing that year happened the way it was<br />\nsupposed to—not even mono. She could have been<br />\nme<br />\nHarriet for all I know. The women who have told<br />\nMost<br />\ns.<br />\ninitiation<br />\ntheir secrets, all claim more pleasant<br />\npeople do. I told my confidant,(there were never more<br />\nI said<br />\nthan six at once). She said it sounded exciting,<br />\nly<br />\nsurprising<br />\nup<br />\ngrew<br />\nshe<br />\nthen<br />\nvicarious,<br />\nbeing<br />\nshe was<br />\nwell. I still think it could have been Harriet.<br />\nWhen dope was still evil we traded it like bubble<br />\nand<br />\ngum cards, looking at it a lot, \"taking\" very little<br />\nhouse,<br />\nGriffen<br />\ndorms,<br />\nthe<br />\nIn<br />\nfast.<br />\ntoo<br />\nmuch<br />\nhigh<br />\ngetting<br />\n(this<br />\ndamn you, shall we call him Anonymnity stood up,<br />\nhe<br />\nsaid<br />\nand<br />\nRevolver)<br />\nod<br />\nwas when nobody understo<br />\ndid.<br />\nhe<br />\nand<br />\nwaited<br />\nWe<br />\nwould float across the room.<br />\nWe tried to get laid but sometimes it was like basethe statistics being more fun than doing the<br />\nkeeping<br />\nball,<br />\nthing itself. Even the tedium of being reminded that<br />\nyou were lonely could be made into a game. Sloan<br />\ncame back from Phillie one weekend looking like he<br />\nhadn't gotten it all the way out yet.<br />\nFormative years: I read a lot of good books at<br />\nHopkins. But most were boring as shit.<br />\nOnce Exodus and Spartacus were really good movies. Once Shame would have been hard to understand.<br />\nI think Bob Dylan the most enduring American poet to<br />\nflourish in the decade but only because Leonard Cohen<br />\nbecause virtually no one else with tais a Canadian and<br />\n..<br />\nlent whatever his nationality, is an American poet. Per-<br />\n<br />\nhaps there hasn't been another American poet since<br />\nRobert Ford in the 1870's. But that's my problem.<br />\nLast Formative years: I wrote my first short story<br />\nwhen I was eight years old, the day someone threw a<br />\nrock through the window, though I forget the connection. In a week, I'm leaving Hopkins for the coast to<br />\nwrite the rest of a novel. Here the connection is more<br />\nobvious.<br />\n\"I think that there is only one salvation, and that<br />\nis art. We can be reasonably certain that once something<br />\nhas been transformed into art, the culture has come to<br />\ngrips with it. The horror of the sixties must somehow<br />\nbe transformed through art into the symbolic, into the<br />\nconcrete and the stable; it must be removed from the<br />\nnightmare of memory and put in plain view before us<br />\nall, the ogre pacified.\"<br />\nI think it unprintably sad to bury death in art-Sloan's novel. I think it pointless to look for creativity<br />\nbeyond yourself and those you love—my problem.<br />\nWith a show of hands now, who knows how to<br />\nspeculate on solutions to the problem of death? One<br />\nhand: on one of the pages of this section, we've given<br />\nbest<br />\nyou a ballot with which you may vote for the<br />\ndeaths of the sixties in no fewer than ten catagories, all<br />\nof which have been made deliberately tasteless, but not<br />\nnearly so tasteless as their subject. Vote a solution<br />\nwith your indignation. But be careful at whom you<br />\nfire that powerful, and oh so rare beauty, indignation.<br />\nTwo hands. On another page, I have written an<br />\nnot<br />\narticle, also tasteless, but mostly cynical, funny or<br />\nbe<br />\nto<br />\nmeant<br />\n(as you choose) reviewing the '70's, not<br />\nertation.<br />\nmisinterp<br />\nof<br />\ntired<br />\nfucking<br />\npretty<br />\naccurrate, I'm<br />\nCynicism is the last refuge of the true believer: the<br />\npoint of it. Also, logic hides the most romantic hearts,<br />\nbrutality holds the greatest love, pathos the most pride,<br />\nBut<br />\nfear the greatest courage--you take it from there.<br />\ntrusted<br />\nbe<br />\ncan<br />\nyou<br />\nif<br />\nthis<br />\nall<br />\nbelieve<br />\nto<br />\nyou only have<br />\nwith the information.<br />\nAnd I don't want to see the 1960's in a cage,<br />\nof<br />\npacified. Those nightmares, those scars, our harem<br />\ndidn't<br />\nwe<br />\nif<br />\nbe<br />\nwould<br />\nwe<br />\ns<br />\nhypocrite<br />\nwhat<br />\nsyphlitic wives,<br />\nlet them live with us, if we didn't flaunt them in public.<br />\nI killed the Kennedys, I killed Vietnam. I was a Chicago<br />\ncop kicking teenage girls long after they stopped screaming, making sure that they would never be mothers. I<br />\nfollowed orders. I elected Nixon. I believed Johnson.<br />\nide<br />\nI dropped Napalm because it worked; I sold Thalydim<br />\nmilked<br />\nDolly,<br />\nHello<br />\nwrote<br />\nI<br />\ndidn't.<br />\neven when I knew it<br />\nit for every cent I .could get. I said \"it's my job\" to<br />\npeople who were dying. I censored television. I forbade<br />\nbirth control, piously, crying all the while that I was infallible. I designed deathtrap cars because I was told<br />\nthat the public demanded them. I invaded Czechoslovakia. My Lai is peanuts compared to what I have done<br />\nbillion.<br />\nto the rest of Vietnam. Have a cigarette? Have a<br />\nfound<br />\nwe<br />\nwell<br />\nsheriff,<br />\nthe<br />\nSome of the boys and me and<br />\nhad<br />\nwe<br />\nand<br />\nagitators<br />\noutside<br />\nthem<br />\nof<br />\ncouple<br />\nourselves a<br />\nlaw<br />\na<br />\nourselves a little fun with them. I got elected on<br />\nthe<br />\non<br />\nArabs<br />\ndead<br />\nand order platform. I stepped over<br />\ncould<br />\nwe<br />\nPresident<br />\nthe<br />\ntold<br />\nI<br />\nWall.<br />\nway to the Wailing<br />\nNorth..<br />\nend the war in six weeks if he'd let us bomb the<br />\nPresident<br />\nthe<br />\ntold<br />\nI<br />\nCuba.<br />\ninvade<br />\nto<br />\nPresident<br />\nthe<br />\nI told<br />\nthink<br />\nto invade the Dominican Republic. Who do you<br />\nThreshthe<br />\nbuild<br />\nI<br />\nold?<br />\nHammersk<br />\nkilled Lumumba? Dag<br />\nmoney<br />\ner, the F-111, the B-70, the GSA and made more<br />\nabout<br />\narticles<br />\nthan you'll ever know. I wrote all the<br />\nhow<br />\nask<br />\nto<br />\nCongress<br />\nin<br />\nJackie Kennedy and I got up<br />\non<br />\nnotch<br />\na<br />\ngot<br />\nI've<br />\ncost.<br />\nwould<br />\nflame<br />\nmuch the eternal<br />\nmy revolver for every black panther. Two for the ones<br />\nthat fired back. I'm the one on your selective service<br />\nboard who keeps them from drafting rich kids. Talk<br />\nabout formative years.<br />\n\"I would like to suggest a new national monument,<br />\na new symbol, not one that will exist only amid the<br />\nratified tombstones of Washington, D.C., but rather a<br />\nmonument which will be erected all across the country<br />\nso that everyone may see it, and frequently. I would<br />\nsuggest that the image on the Zapruder film be transformed into a working model, twenty or more feet high,<br />\nwith a continually exploding skull and a fountain of<br />\nrich red blood that, when the wind blows, will cover all<br />\nwho approach to view the horror...\"<br />\nThen Sloan told me that he was sorry he had<br />\ngotten carried away with the monument idea, for it just<br />\ncontinues for the remainder of his article. I am sorry<br />\ntoo because the monument is a waste. I carry my<br />\nmonument with me. And so do you.<br />\nMeanwhile the sun has long since risen.<br />\nRobert Sloan/Seth Feldman<br />\n<br />\n\fPAGE 3<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPecember 15, 1969<br />\n<br />\nNone of This Will Have Happened<br />\n'My God, why don't you people believe me? I keep<br />\ntelling you, I fell asleep in this chair, right here in the<br />\nGordon barrat.:-s, United States Military Academy at<br />\nBaltimore on Christmas day, 1979. Christ, and I open my<br />\neyes and here I am back in Godawful 1969. Man, I don't<br />\nwant to keep living these ten years over again. Help, get<br />\nme out of here.<br />\nAll right, don't believe me, you stupid bastards. I<br />\ndidn't think I could expect very much from people who<br />\nstill grow hair on their heads, who breathe raw air, who<br />\ndon't even have tape cartridges on their TV's. Let's just<br />\nforget it. Let's go watch the afternoon executions downtown. Oh, that's right, that didn't come until his second<br />\nadministration. Or was it the third? Well, I've got a<br />\ndollar, can someone tell me where I can get a Coke? Six<br />\nof them? Quaint.<br />\nHEY BABY, YOU GOT A PERMIT YOU DON'T<br />\nKNOW WHAT TO DO WITH? But that's right, you<br />\n<br />\ndidn't need a permit in 1969. Animals,just like animals,<br />\nany time you wanted. What do you mean \"not quite<br />\nany time you want\"? You don't need permits, do you?<br />\nYou're animals, animals, all of you are filthy uncivilized<br />\nanimals.<br />\n<br />\nWHAT MY LAI CAN TEACH US about curing our ghetto<br />\n<br />\nProblem, by the Reverend Billy Graham. Just one of 36<br />\nlively and informative articles in the April, 1974 Readers'<br />\nDigest<br />\n<br />\nAll right, all right, I'll calm down. Yeah, I'll \"cool<br />\nit. And twenty-three skiddoo to you, mister. Jesus, I<br />\n<br />\ned. Okay? Been fine meeting you. Fuck off.<br />\nOh you do, do you? All the exciting things that<br />\nhappened in the 1970's? Well, you all got your wellearned degrees and professorships in your second choice<br />\nschools, that is except for those of you who had the<br />\nprivelege of dying for peace with honor in Asia, South<br />\nAmerica, the Union of South Africa or the crime control<br />\ncampaign (ah, there are some blacks over there, aren't<br />\nthere? You still had them back now, didn't you?). Well,<br />\nmost of you survived. Congratulations. Now, if you'll<br />\nlet me get to sleep.<br />\nHey now come on. What else do you want to<br />\nknow? All right, you all married your second choice<br />\nmates.and bought all the cars you swore you would never<br />\nbe caught dead in. Until the Birth Control Act, you had<br />\nabhorrant numbers of offspring you couldn't afford.<br />\nAfter the Glorious Pre-emptive Thermonuclear Strike on<br />\nCuba, you all glowed merrily in the dark from the scattered radiation. Those of you with any integrity were<br />\nharassed by your leftist students in the early '70's and<br />\nostracized by the Commie College Cleanup in '76 (and<br />\nold Hopkins didn't pull any of that Owen Lattimore shit.<br />\nIt knew where its money was coming from). But most of<br />\nyou have had quiet and prosperous academic careers. It's<br />\nbeen years since you stumbled across your last undergraduate.<br />\nYes, of course the inflation continued. We had the<br />\nNixon economic miracle, the first depression in recorded<br />\neconomic history during which prices actually rose. Now<br />\ndon't you think a man who can do that deserves a third<br />\nterm? Which amendment is that? Oh yeah, I remember.<br />\nThe supreme court ruled that the 1976 elections were<br />\nnot covered by that amendment—some technicality.<br />\nAgnew? Jesus, that was a bloody mess.<br />\nNow, come on, you've got to let me get to sleep.<br />\nWhat, what, what is it? Yes, we still have Vietnam.<br />\n300,000 odd troops. But we reached a turning point in<br />\n1979 and I think we have them on the run now. Anyway, I'm not worried about the draft. The war should be<br />\nover by time they call me.<br />\nSo what if. this is an Army uniform? I believe<br />\nHopkins, back in '69, gave every student the academic<br />\nfreedom to choose to take ROTC if he so desired. Well,<br />\nthat freedom's been expanded. I had my choice between<br />\n<br />\nWANT OUT OF HERE.<br />\nI mean it may be all right for you people to live<br />\nlike this, okay. But man, I know what's going to happen,<br />\n<br />\nROTC, NROTC, Air Force ROTC, Coast Guard ROTC,<br />\nCIA ROTC, FBI ROTC, Secret Service ROTC and Post<br />\n<br />\nand! don't want to be around when it does, right. So<br />\nI'll just sit here and you all go away and I'll fall asleep<br />\nagain and when I wake up none of this will have happen-<br />\n<br />\nOffice ROTC. I mean which one of you could possibly<br />\nguess that the Special Forces that pacified the inner city<br />\nwould be trained right here at Hopkins? Huh? I mean<br />\n<br />\nGONE THE WAY of the niclde candybar, the \"Negro\" is<br />\nremembered only in this rare photograph from the 1960's.<br />\n<br />\nthat's America for you.<br />\nWhat do I mean by \"pacified\"? Shhhh, they might<br />\nbe listening.<br />\nYes, I did say something about the South American and South African wars. I mean don't you think the<br />\npeople in South America should be protected from the<br />\noutsiders who ferment all this trouble? I mean what do<br />\nyou think the Monroe Doctrine is all about? Admittedly, we do most of our fighting around the United<br />\nFruit plantatons and Rockefeller Oil refineries. But so<br />\nwhat? Doesn't Rockefeller deserve a. break? And as for<br />\nthe South Africans, well don't you think they should be<br />\nable to determine their own destiny, free from the Commies in the rest of Africa? It makes sense, doesn't it.<br />\nAparthied? I told you, there aren't any more of<br />\nthem.<br />\nWell, don't be offended. It's not my fault. There<br />\njust aren't. Now let me...what now? No, I don't remember any of the movies in the 1970's. Just before the<br />\nCommie and/or Filth Movie Reinforced Voluntary Code<br />\nof Ethics, movies went so far into an art form that only<br />\nlike intellectuals could really understand them. Then<br />\ncame TV cartridges and the Code. Now there aren't<br />\nmany movies at all. We do get a bit of Walt Disney.<br />\nMusic? Yeah, there really have been some changes.<br />\nI mean you people still have rock, don't you. Well that<br />\nwas sort of phased out under the Self-Enforced AntiEroticism on Wax Code. There still is some rock around,<br />\nbut it kind of limits itself to hair combing and hand<br />\n(Continued On Page 4)<br />\n<br />\nHeroes for the 60's--A N-L Poll<br />\nThe 1960's were, without a doubt the decade for death. At<br />\nleast one well-known writer has labelled those coming of age during<br />\nthe last ten years, \"The Assassination Generation.- With this in<br />\nmind, the News-Letter, in accordance with its general policy of<br />\naudience participation, asks you, the reader, to help us chose the<br />\nrecipients of the first annual Croakie Awards. Please check one<br />\nname in each of the ten categories listed below and mail the page<br />\nto the News-Letter, Box 1230, Johns Hopkins University. Winners<br />\nwill be announced in the first issue of the 1970's, should there be<br />\na News-Letter in the 1970's. Should there be a 1970's...<br />\nBest near-miss:<br />\n.......Bob Dylan<br />\n.......Timothy Leary<br />\n.......Bobby Seale<br />\n.......Andy Warhol<br />\n.......Lyndon Johnson<br />\n<br />\nThe murder played<br />\nfor greatest press coverage:<br />\nSirhan B. Sirhan<br />\nLee Harvey Oswald<br />\nJames Earl Ray<br />\nEdward Kennedy<br />\nArt Linkletter<br />\nMelvin Laird<br />\nJack Ruby<br />\nBest-directed cover-up:<br />\nThe Warren Commission<br />\nThe Defense Department<br />\nThe James Earl Ray trial<br />\nAristotle Onassis<br />\n<br />\nMost aesthetically pleasing murderer:<br />\n.......Charles Whitman<br />\n.......Truman Capote<br />\n.......The Boston Strangler<br />\n........The Sharon Tate killers<br />\n.......Dow Chemical Corporation<br />\n<br />\nMost artistic suicide:<br />\nMarilyn Monroe<br />\nErnest Hemingway<br />\nLenny Bruce<br />\nPaul McCartney<br />\nJudy Garland<br />\nChe Guevara<br />\n<br />\nBest group death:<br />\nThe three astronauts<br />\nThe citizens of My Lai<br />\nThe U.S. motorist<br />\nThe crew of the U.S.S. Thresher<br />\nThe Nation of Biafra<br />\nThe Black Panthers<br />\nSeptember I4—J<br />\n<br />\nMost original suicide:<br />\nJohn F. Kennedy<br />\n<br />\n4 Most self-righteous killer:<br />\nMoshe Dayan<br />\nDr. Christian Barnard<br />\nThe entertainment industry<br />\nThe tobacco industry<br />\nThe automobile industry<br />\nPope Paul VI<br />\nMost boring death:<br />\nHo Chi Minh<br />\nMao Tse-Tung<br />\nEverett Dirksen<br />\nWinston Churchill<br />\nThe Saturday Evening Post<br />\nSpiro T. Agnew<br />\nThe novel<br />\nBest killing by an organized group:<br />\nOur Army<br />\nTheir Army<br />\nThe State of Mississippi<br />\nThe state of inanition<br />\n<br />\nU. S. Industry<br />\nThe police<br />\nThe selective service system<br />\n<br />\n\fDecember 15, 1969<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE 4<br />\n<br />\nThe Time Is Ripe--Got to Revolution\"<br />\nMuscially speaking, the sixth decade of this<br />\ncentury ended last month. A decade of revolutionary<br />\nexperimentation with musical theory, harmony, instrumentation and emphasis—ten years which saw the change<br />\nin rock 'n' roll from pop to rock--is over. We now enter<br />\nthe period of revolution in lyrics.<br />\nThe first hint of the changes in store for the<br />\ngeneral blandness of rock lyrics began a few years ago,<br />\nwith the radicalization of several of the San Francisco<br />\ngroups, notably the Grateful Dead and the Jefferson<br />\nAirplane. The significance of this was generally overlooked, however, in the face of the vast musical breakthroughs made in that region, and the continuing influence of the less politically-oriented English groups.<br />\nSomehow, Jorma Kaukonen's guitar hid Grace Slick's<br />\n\"and I'd rather have my country die for me.\"<br />\nAll this began to change in November, a month,<br />\nwhich saw simultaneous tours of the Airplane and the<br />\nRolling Stones, and the release of new albums by both<br />\n..croups.<br />\nThe Airplane concert was held in College Park on<br />\nthe sixth anniversary of John Kennedy's assassination<br />\nand, like most concerts was atrociously organized.<br />\nUnlike most UM concerts, however, both shows were,<br />\nfilled to overflowing, and unlike most performers, the<br />\nAirplane promised to make up for an hour's wait in t<br />\ncold b.y playing longer. And better.<br />\nThe Volunteer album is art<br />\nthe first song, \"We Can Be<br />\nreprise, \"Volunteers\". The„:„..„<br />\nexposition to date of the<br />\nphilosophies:<br />\n\"All your private pro<br />\nTarget for your en<br />\nAnd your enemy<br />\nWe.\"<br />\nIt also<br />\nobscene, law<br />\nyoung/But<br />\nis euphe<br />\n'newspa<br />\nis not 441.4 t<br />\n\"Volunteet ..t i4<br />\nFrantisc o's nsw<br />\n.<br />\nandJn Way<br />\n<br />\ncon<br />\ned s<br />\nnigh<br />\nany<br />\nn<br />\nslimmer at the L,Iniversity<br />\ncr<br />\nWith barely a tnotnen<br />\n«<br />\nspran.r, to it:, feet altd witha roar, joitteu in, luau' cheer'<br />\ning and half inv,iing, Tip, house lights went oil. thf:<br />\nwen: )11 :Ind still the music continued..Then<br />\nligh t<br />\ncame thc. sh-iir<br />\n\"Volunt,..:ers\" and the frenzy begin<br />\nGrace<br />\n()I*,<br />\nvoice and the bass pattern<br />\nearnot.<br />\n<br />\ncould be felt amid the roar. The show ended with a<br />\nstanding cheer, clenched fists held high.<br />\nFour days later the Stones came to town. Again<br />\nthe concert's sponsors failed to live up to expectations<br />\nand again it was up to the main performers to salvage an<br />\nup-to-then shoddy production.<br />\nRolling Stones records have always been of exceptionally high caliber. The Stones have been able<br />\nto avoid the vicissitudes of the Beatles (\"I am the<br />\nWalrus\"/\"Hello Goodbye\"), the demise through inflexibility of the Mama's and Papa's and the Doors, the<br />\ngimmicks of Al Kooper, and Dylan's soul-searching lack<br />\nof continuity.<br />\nDespite everything that can be said about the<br />\nStones' records, nothing they produce in the studio can<br />\ncompare with one of their concerts. And, like the Airplane, they were up for a rollicking concert.<br />\nInstead of following their traditional pattern of<br />\nplaying for only forty minutes (which is all that bigname groups seems to consider necessary these days),<br />\nthey started off by putting on a full hour-long show.<br />\nThen, what seemed to be the end, wasn't.<br />\nThe house lights came on and Jagger told the<br />\naudience that since he wasn't the only one there, he<br />\nshouldn't be the only one taking part in the concert,<br />\nand thAticveryone should \"conic on up and start dancin'<br />\nNo one's a-gonna get hurt, are they?\" He<br />\nand<br />\ntaunte<br />\n\"'C'inon, let's have some fun!\"<br />\nwas:,t,o 13- anti 14-year-old audience he was<br />\nt Jagger 'had done it again. While the<br />\n. • . c°mix ti y and nonchalantly<br />\njsgger had established, in<br />\ncanny W.IY. 1I ekctt'ic rappcKt,A4..,:.p,000 pew<br />\nmPer°nal Civic Center.' No one cared<br />\nthe<br />\n)is<br />\nsy stem being Ina d 'U.': no one rernS,<br />\nsount.<br />\ntat! \"ge<br />\n..the interminable w.it br .S.,116 Stones. Culmir<br />\n\"Midnight Rambler,\" J!:?,gq had become a per4<br />\nitv to each of his viewet.<br />\n'Then came the end, Mick announced \"<br />\nlas',\" and Mick Taylor rke into \"Honky ef;'.<br />\nmen.\" As that drew to ;iJose, though, for some ie'as<br />\nno one believed it was t,e end--and it wasn't. Amid a<br />\ncontinuous roar. the 't or broke into \"Street Fighting<br />\nMart.:' and, like the previous weekend, the clenched fists<br />\nwere raised. .A week earlier Mick had dedicated the song<br />\nto Chicago when the same thing happened there, but it<br />\nwas clear to everyone in the Civic. Center that it was all<br />\nof America's.<br />\ncrywh cr' I hear the sound of mart:11in',<br />\nchafgin'feet, boy,. ...<br />\nThe summer's here and the time.ts ripe for<br />\nfightin' in the street... bo<br />\n0.4:evolution<br />\n\"Think the time is right f6:<br />\nCat,ise where 1 live the game<br />\nay're a<br />\n.compromise solution<br />\ntreer Fighting Man\" is, b „..„. 13...fitly old<br />\nhen it first came out, al:<br />\nwei446nrused by<br />\n,merely an answer to the,,Ileades' hiatant copution 1”? Was it itself a cop-out since it<br />\nu.<br />\nexplie.tt<br />\ntqft boy can do anytt« t<br />\nuti.<br />\n;Op<br />\n,id it lit in with the<br />\n,<br />\nnTheggars B.ritquet?<br />\napolitica so<br />\nother<br />\nFew <fue:Aions were kit un answered at the concert,<br />\n<br />\nhowever. What may have originally been to Mick and<br />\nKeith the logical extension of their more usual social<br />\ncomment/sexual protest songs when it was written (\"Let<br />\nit Bleed\" for instance) undoubtedly took on new meaning when performed before a live, American, anti-establishment audience. Mick, always leering and taunting,<br />\nmilked it for all it was worth.<br />\nThese type of lyrics are something quite foreign<br />\nto the 1960's. When a song's words were at all considered, they dealt mainly with sex or drugs, and at the<br />\nmost extreme, frustration and social protest. It was a<br />\ndecade whose strongest and harshest condemnations<br />\ncame from the poets: Janis Ian's \"Society's Child,\"<br />\nDylan's \"World War III Blues\" and \"Ballad of a Thin<br />\nMan,\" Simon and Garfunkel's \"Save the Life of My<br />\nChild\" and \"Sounds of Silence,\" Richie Havens'\"Handsome Johnny,\" and the Beatles' \"Eleanor Rigby.\"<br />\nMotown completely copped out until the Supremes finally arose themselves to singing about illegitimacy,<br />\nand the other Black groups, including James Brown, restrained themselves to the concept of people having to<br />\nbe free. Elvis added his bit about starving in the ghet-to,<br />\nand Spanky and Our Gang contributed as a promotion,<br />\n\"Give a Damn.\" Whether our younger brothers and<br />\nsisters believe it or not, the decade of the '60's will go<br />\ndown in history as a period in which the strongest protest song was \"I Cant Get No Satisfaction\"--a song<br />\nwhich deals with sex<br />\nThe change,<br />\nThe Airplane<br />\nis one of the mos<br />\n's in the United<br />\nStates these days:*<br />\nstimated that<br />\nPillow.<br />\n.Volunteers will sel.<br />\nSurrealistic<br />\n....4...,.....<br />\nf.<br />\nBeside.ttt<br />\n.tuIttill<br />\n' contains a<br />\nCrosby-Si<br />\neans,hCwiprasor,s,:,eino<br />\nao.irudsyco<br />\n...,. ,,,.iuti:s.i,,i..,eswatdsoci:<br />\nttaeitrti.,t.nt i-.,h.7<br />\n(.1 ,„. :.,. ,hch<br />\no<br />\n..z.,....a. Car.01,e.fie: ta,. y,.t.r‘orcivm<br />\n° o'fii,.ts.;;.\"1<br />\ntll.ts<br />\nN.<br />\nwkikh.<br />\nAll N44'6'<br />\nAnd 4.<br />\n<br />\n11-nr..icii;ce°1uittdgsiedie<br />\n•,:... „. . . .<br />\n.<br />\n<br />\n.ee<br />\n<br />\n„ 4<br />\n<br />\nre.veai toe 1:rtta.rit rebellion and frustng up inside thc .Airplane: \"Consider how<br />\ntration<br />\nscream/The human<br />\nsmall ru are; /Compared to<br />\ndream/Doesn't mean shit to a tree,\" and \"How many<br />\nmachine men will you See before you/Stop your believing that speed /Will slide down on you/Like brakes<br />\nin bad weather.\" Lyrics like these have an infectiousness<br />\nthat, combined with the musical level we have reached<br />\nover the p.ist ten years. promise very exciting times<br />\nahead.<br />\nThe very fact that the 'Rolling Stories have picked<br />\nup on the iniPulse is an *Iication that the time may<br />\nbe ripe, if not for palace i.vplkition, at least for singing<br />\nabout it. The concept of<br />\nution is about as far removed from the Englishnia<br />\nas monarchy is to<br />\nours. It is therefore more cxcuabiit the initial attempts<br />\nthere are less serious than our here.The Stones gave it<br />\na try, and it is highly<br />\nafter their reception here,<br />\nthat they will try it again.<br />\nThe musical place to be as the '70's begin, is on<br />\nthe fringe. The groundwork set down by the Mothers<br />\nand the Fugs is finally bearing fruit.<br />\n—Peter Harnik<br />\n3<br />\n<br />\n...When I Wake Up<br />\n(Continued From Page 3)<br />\n<br />\nSPECULATION VERITABLY ABOUNDS as<br />\nthe first assassination victim of the 1970's.<br />\n<br />\nto who will be the<br />\n<br />\nholding, that sort of thing. Very nostalgic. Pop music<br />\nhas spread out to all different kinds of beats. Samba and<br />\nFrank Sinatra were big in '79. The Beatles? I think they<br />\nwere standing on England when it sank.<br />\nChrist, get that beard, or whatever you call it,<br />\naway from me. What do you want? Yes, it's legal. But<br />\nit's hard to get because all these housewife/truck driver<br />\ntypes keep buying out the supplies.<br />\nNo thank you, I have some of my own.<br />\nNow please, may I get to sleep? After all, you<br />\npeople should get used to the idea that it's not too safe<br />\nto talk in public places. My God, that man right over<br />\nthere is a police informer. How do I know? The wire rim<br />\nglasses are one giveaway—that's how they recognize each<br />\nother. Also, look at that surplus fatigue jacket. Do you<br />\nknow how much recording equipment fits into one of<br />\nthose pockets? It was all explained very nicely in that<br />\nlast issue of Ramparts.<br />\nNo. No. No. Okay, one more question. Of course<br />\nwe landed on Mars. When you spend ten billion a year to<br />\n<br />\nland on Mars, you land on Mars. And let me tell you, the<br />\nRusskies were nowhere in sight. When this country runs<br />\na space race with itself, you better know damn straight<br />\nthat it's going to win. Yeah, we beat them to Mars, all<br />\nright. And when Captain Bland got out of the M&M<br />\n(that's the Martian Module) planted the flag, saluted it,<br />\nread from his bible a bit, talked to Nixon, to Agnew's<br />\nwidow, to the Secretaries of State, Defense and Interior,<br />\nto the minority leaders of both houses and to football<br />\nCommissioner Namath, he then looked around him and<br />\nremembered that he had forgotten his famous first<br />\nwords. Well, Bland went back to the M & M,. cot the<br />\nfamous first words out, looked at them for awhile, came<br />\nout onto the Martian surface again, littered it with the<br />\nfamous first words and right before he could say the<br />\nwords, was eaten by an unforeseen difficulty. But we did<br />\nget there first.<br />\nSo good luck, 1969 people, it's all yours, tough<br />\nbannanas. I'm just gonna close my eyes and...yeahhh,<br />\nthere are these fat little men at ninepins...drinking cider<br />\n...yeah...<br />\n--Seth Feldman<br />\n<br />\n\f", "format": "basic_html", "processed": "969<br /><br />\nmo/<br /><br />\nRemembrance of Things Past<br /><br />\nNews-Letter<br />\nthe johns hopkins university<br />\nDecember 15 1969<br /><br />\nEND-OF-THE-DECADE SPECIAL<br /><br />\n74TH YEAR<br /><br />\n•<br /><br />\n•••<br /><br />\nPhotograph copyright R.L.Haeberle<br /><br />\nLife contracts and death is expected,<br />\nAs in a season of autumn.<br />\nThe soldier falls.<br /><br />\nDeath is absolute and without memorial,<br />\nAs in a season of autumn,<br />\nWhen the wind stops,<br /><br />\nHe does not become a three-day personage,<br />\nImposing his separation,<br />\nCalling for pomp.<br /><br />\nWhen the wind stops and, over the heavens,<br />\nThe clouds go, nevertheless,<br />\nIn their direction.<br />\n----Wallace Stevens<br /><br />\nNEWS-LETTER<br /><br />\nPAGE 2<br /><br />\nDecember 15, 1969<br /><br />\nJust as Honest as Each Other.You Know.<br />\nThe sun is just beginning to do whatever it does before<br />\nit rises, you know, the part where the clouds start<br />\ngetting tinged and then a little bit of the sky, but still<br />\nno sun itself. That part.<br />\nSloan wrote what this article was originally going to<br />\nbe. He gave it to me at 3:30 or so and went to bed. I<br />\nfinished writing a really poor paper, had some soup and<br />\nlook at this now, as you look at it, but to tell you the<br />\ntruth my mind isn't really on you, the reader. If anything it's on the sun. Sloan says:<br />\n\"The single image that we all shall carry with us<br />\ninto the new decade is the one that was caught, in the<br />\nquaint American fashion, by a home movie camera: the<br />\nskull ofJohn F. Kennedy being fragmented into oblivion<br />\nbeneath an explosion of blood in the back seat of a<br />\nLincoln Continental convertible. The explosion of blood<br />\nin that picture managed to cover the remainder of the<br />\ndecade so that now, at its close, we can remember little<br />\nelse. We can regret only that Haskell Wexler was not<br />\nthere to take a shot, for then, perhaps the image of the<br />\nblood would have been clearer, we might have known<br />\nwhat to expect.\"<br />\nI don't know. I can't say I was bothered by the first<br />\nKennedy assassination at the time--I was more sort of<br />\nnegatively amused. A 15 year old cynic, I thought the<br />\nwhole New Frontier business a lot of PR shit, which a<br />\nlot of it was, and I thought it would probably be more<br />\nexciting to vote for Barry Goldwater who at least flew<br />\njet fighters while the best Kennedy could do was sail his<br />\ndamn yacht with a lot of other rich people.<br />\nI don't know. I remember some commentator saying<br />\nhow it was good that there wasn't any regular TV that<br />\nweekend so that even the youngest child would sense<br />\nthat something was very wrong. Aldous Huxley died that<br />\nweekend and nobody even knew. That there was no TV<br />\nand that everybody ignored Huxley's death was the way I<br />\nwould remember that something had gone wrong.<br />\nAgain, I don't know. Hemingway's death bothered me<br />\nmore, even before everyone started nodding knowingly,<br />\nassuring each other that it was a suicide. I had wanted<br />\nto become part of an American literary culture and was<br />\nhopelessly frustrated that part of that culture could get<br />\naway, one way or another, before I could read all his<br />\nbooks, much less meet him. I was twelve and still going<br />\nto bed at 10 o'clock when Hemingway wrote his final<br />\nstatement on manhood with his shotgun. It amuses me<br />\nthat I must finish this by another 10 o'clock, when<br />\nSloan said he would wake up and take it down to the<br />\nprinters. Hemingway was too virile for Dex.<br />\n\"Now it is all a blur, crepe black and blood and<br />\nmaybe a few faces, not all violence, but all very dead:<br />\nthree Kennedys, three sex symbols, three Mississippi<br />\ncivil rights workers, Lincoln Rockwell, Medgar Evers,<br />\nMartin King, Malcolm X, 40,000 \"American boys\",<br />\nhundreds of thousands of \"oriental human beings\",<br />\nEisenhower and Nehru and Ho and drivers of cars and<br />\nstarving people and on and on and inevitably on.\"<br />\nAnd Sloan's father and my best friend, and three of<br />\nSloan's high school buddies in Vietnam, a few people<br />\nPete Harnik knows, friend's lovers, lover's friends by all<br />\nthe oddities of a sleeping God. I tell you we are as honest<br />\nas each other. I tell you we die by each other in one way<br />\nor another.<br />\nI think it happened this way: In the beginning of<br />\nthis decade, for all purposes as far back as I can go,<br />\nthere started to happen what we then thought of as<br />\nfreak occurrences, incredible things which had never<br />\nhappened to us and/or the world before. Then there<br />\ncame so many of these freak occurrances that soon,<br />\nsometime during the decade, you began to wonder just<br />\nwhat was normal and who was the freak occurrence. I<br />\nthink that I am alive is a freak occurrence--the circumstances are not worth going into—and that is the worst<br />\nfeeling I have had all decade.<br />\n\"Who needs to be reminded of all this and who<br />\nwant to forget? But these were our formative<br />\nnot<br />\ndoes<br />\nyears, the years during which we got our first fuck, the<br />\nyears that you want to remember for all the personal<br />\nthings that happened. You must forget about what<br />\nwent on around you, or at least ignore it: the assassination generation will end up the suicidal generation if it<br />\ndoes not try to forget. That is why we drop, that is why<br />\nwe don't give a damn about the future, that is why we<br />\ndo our best to get laid often. We go to the X movies<br />\nbecause they are about nice things like drugs and sex<br />\nand because the G movies are about war and the American aream ana otner Kinds 01 certain death. We matur-<br /><br />\ned surrounded by blood: it has either perverted us or<br />\nsaved our humanity. We have been shocked into the<br />\nsimplicity of shouting j'accuse at the controllers of all<br />\nthis bloodshedding, but we have no idea when and how<br />\nit will all stop. Why should we wish to be a part of a<br />\nworld destroying itself; amid the killing, the natural<br />\ndeath is lost: we shall be grateful just to get the chance.\"<br />\nAs I typed that, I began to think that, perhaps<br />\nbecause of I don't know what, that that paragraph above<br />\nthis one is one of the small enduring things, that the AP<br />\nor UPI might find, that it might make an obscure anthology, that it might be read on a television program about<br />\nour troubled youth and the sometimes ease of their<br />\ndifficult expression. Or it might be shit. Sloan said it<br />\nwas.<br />\nI review it for me:<br />\nFormative years are getting soggy in a Junior High<br />\nDancing class with a girl named Harriet who has overdeveloped breasts for a twelve year old, breasts that<br />\nmight also have pimples on them, like the rest of Harriet,<br />\nbut this is the least of all your shame ridden speculation.<br />\nFormulative years are Drake saying he got laid in Mexico<br />\nwhen he was twelve, an incredible lie. Formulative<br /><br />\nyears are reading On the Road and then madly peddling<br />\ntwenty miles on your bicycle just to prove to Kerouac<br />\nthat you're on his side.<br />\nI got laid when I was older at a party;! got raped<br />\nbecause nothing that year happened the way it was<br />\nsupposed to—not even mono. She could have been<br />\nme<br />\nHarriet for all I know. The women who have told<br />\nMost<br />\ns.<br />\ninitiation<br />\ntheir secrets, all claim more pleasant<br />\npeople do. I told my confidant,(there were never more<br />\nI said<br />\nthan six at once). She said it sounded exciting,<br />\nly<br />\nsurprising<br />\nup<br />\ngrew<br />\nshe<br />\nthen<br />\nvicarious,<br />\nbeing<br />\nshe was<br />\nwell. I still think it could have been Harriet.<br />\nWhen dope was still evil we traded it like bubble<br />\nand<br />\ngum cards, looking at it a lot, \"taking\" very little<br />\nhouse,<br />\nGriffen<br />\ndorms,<br />\nthe<br />\nIn<br />\nfast.<br />\ntoo<br />\nmuch<br />\nhigh<br />\ngetting<br />\n(this<br />\ndamn you, shall we call him Anonymnity stood up,<br />\nhe<br />\nsaid<br />\nand<br />\nRevolver)<br />\nod<br />\nwas when nobody understo<br />\ndid.<br />\nhe<br />\nand<br />\nwaited<br />\nWe<br />\nwould float across the room.<br />\nWe tried to get laid but sometimes it was like basethe statistics being more fun than doing the<br />\nkeeping<br />\nball,<br />\nthing itself. Even the tedium of being reminded that<br />\nyou were lonely could be made into a game. Sloan<br />\ncame back from Phillie one weekend looking like he<br />\nhadn't gotten it all the way out yet.<br />\nFormative years: I read a lot of good books at<br />\nHopkins. But most were boring as shit.<br />\nOnce Exodus and Spartacus were really good movies. Once Shame would have been hard to understand.<br />\nI think Bob Dylan the most enduring American poet to<br />\nflourish in the decade but only because Leonard Cohen<br />\nbecause virtually no one else with tais a Canadian and<br />\n..<br />\nlent whatever his nationality, is an American poet. Per-<br /><br />\nhaps there hasn't been another American poet since<br />\nRobert Ford in the 1870's. But that's my problem.<br />\nLast Formative years: I wrote my first short story<br />\nwhen I was eight years old, the day someone threw a<br />\nrock through the window, though I forget the connection. In a week, I'm leaving Hopkins for the coast to<br />\nwrite the rest of a novel. Here the connection is more<br />\nobvious.<br />\n\"I think that there is only one salvation, and that<br />\nis art. We can be reasonably certain that once something<br />\nhas been transformed into art, the culture has come to<br />\ngrips with it. The horror of the sixties must somehow<br />\nbe transformed through art into the symbolic, into the<br />\nconcrete and the stable; it must be removed from the<br />\nnightmare of memory and put in plain view before us<br />\nall, the ogre pacified.\"<br />\nI think it unprintably sad to bury death in art-Sloan's novel. I think it pointless to look for creativity<br />\nbeyond yourself and those you love—my problem.<br />\nWith a show of hands now, who knows how to<br />\nspeculate on solutions to the problem of death? One<br />\nhand: on one of the pages of this section, we've given<br />\nbest<br />\nyou a ballot with which you may vote for the<br />\ndeaths of the sixties in no fewer than ten catagories, all<br />\nof which have been made deliberately tasteless, but not<br />\nnearly so tasteless as their subject. Vote a solution<br />\nwith your indignation. But be careful at whom you<br />\nfire that powerful, and oh so rare beauty, indignation.<br />\nTwo hands. On another page, I have written an<br />\nnot<br />\narticle, also tasteless, but mostly cynical, funny or<br />\nbe<br />\nto<br />\nmeant<br />\n(as you choose) reviewing the '70's, not<br />\nertation.<br />\nmisinterp<br />\nof<br />\ntired<br />\nfucking<br />\npretty<br />\naccurrate, I'm<br />\nCynicism is the last refuge of the true believer: the<br />\npoint of it. Also, logic hides the most romantic hearts,<br />\nbrutality holds the greatest love, pathos the most pride,<br />\nBut<br />\nfear the greatest courage--you take it from there.<br />\ntrusted<br />\nbe<br />\ncan<br />\nyou<br />\nif<br />\nthis<br />\nall<br />\nbelieve<br />\nto<br />\nyou only have<br />\nwith the information.<br />\nAnd I don't want to see the 1960's in a cage,<br />\nof<br />\npacified. Those nightmares, those scars, our harem<br />\ndidn't<br />\nwe<br />\nif<br />\nbe<br />\nwould<br />\nwe<br />\ns<br />\nhypocrite<br />\nwhat<br />\nsyphlitic wives,<br />\nlet them live with us, if we didn't flaunt them in public.<br />\nI killed the Kennedys, I killed Vietnam. I was a Chicago<br />\ncop kicking teenage girls long after they stopped screaming, making sure that they would never be mothers. I<br />\nfollowed orders. I elected Nixon. I believed Johnson.<br />\nide<br />\nI dropped Napalm because it worked; I sold Thalydim<br />\nmilked<br />\nDolly,<br />\nHello<br />\nwrote<br />\nI<br />\ndidn't.<br />\neven when I knew it<br />\nit for every cent I .could get. I said \"it's my job\" to<br />\npeople who were dying. I censored television. I forbade<br />\nbirth control, piously, crying all the while that I was infallible. I designed deathtrap cars because I was told<br />\nthat the public demanded them. I invaded Czechoslovakia. My Lai is peanuts compared to what I have done<br />\nbillion.<br />\nto the rest of Vietnam. Have a cigarette? Have a<br />\nfound<br />\nwe<br />\nwell<br />\nsheriff,<br />\nthe<br />\nSome of the boys and me and<br />\nhad<br />\nwe<br />\nand<br />\nagitators<br />\noutside<br />\nthem<br />\nof<br />\ncouple<br />\nourselves a<br />\nlaw<br />\na<br />\nourselves a little fun with them. I got elected on<br />\nthe<br />\non<br />\nArabs<br />\ndead<br />\nand order platform. I stepped over<br />\ncould<br />\nwe<br />\nPresident<br />\nthe<br />\ntold<br />\nI<br />\nWall.<br />\nway to the Wailing<br />\nNorth..<br />\nend the war in six weeks if he'd let us bomb the<br />\nPresident<br />\nthe<br />\ntold<br />\nI<br />\nCuba.<br />\ninvade<br />\nto<br />\nPresident<br />\nthe<br />\nI told<br />\nthink<br />\nto invade the Dominican Republic. Who do you<br />\nThreshthe<br />\nbuild<br />\nI<br />\nold?<br />\nHammersk<br />\nkilled Lumumba? Dag<br />\nmoney<br />\ner, the F-111, the B-70, the GSA and made more<br />\nabout<br />\narticles<br />\nthan you'll ever know. I wrote all the<br />\nhow<br />\nask<br />\nto<br />\nCongress<br />\nin<br />\nJackie Kennedy and I got up<br />\non<br />\nnotch<br />\na<br />\ngot<br />\nI've<br />\ncost.<br />\nwould<br />\nflame<br />\nmuch the eternal<br />\nmy revolver for every black panther. Two for the ones<br />\nthat fired back. I'm the one on your selective service<br />\nboard who keeps them from drafting rich kids. Talk<br />\nabout formative years.<br />\n\"I would like to suggest a new national monument,<br />\na new symbol, not one that will exist only amid the<br />\nratified tombstones of Washington, D.C., but rather a<br />\nmonument which will be erected all across the country<br />\nso that everyone may see it, and frequently. I would<br />\nsuggest that the image on the Zapruder film be transformed into a working model, twenty or more feet high,<br />\nwith a continually exploding skull and a fountain of<br />\nrich red blood that, when the wind blows, will cover all<br />\nwho approach to view the horror...\"<br />\nThen Sloan told me that he was sorry he had<br />\ngotten carried away with the monument idea, for it just<br />\ncontinues for the remainder of his article. I am sorry<br />\ntoo because the monument is a waste. I carry my<br />\nmonument with me. And so do you.<br />\nMeanwhile the sun has long since risen.<br />\nRobert Sloan/Seth Feldman<br /><br />\nPAGE 3<br /><br />\nNEWS-LETTER<br /><br />\nPecember 15, 1969<br /><br />\nNone of This Will Have Happened<br />\n'My God, why don't you people believe me? I keep<br />\ntelling you, I fell asleep in this chair, right here in the<br />\nGordon barrat.:-s, United States Military Academy at<br />\nBaltimore on Christmas day, 1979. Christ, and I open my<br />\neyes and here I am back in Godawful 1969. Man, I don't<br />\nwant to keep living these ten years over again. Help, get<br />\nme out of here.<br />\nAll right, don't believe me, you stupid bastards. I<br />\ndidn't think I could expect very much from people who<br />\nstill grow hair on their heads, who breathe raw air, who<br />\ndon't even have tape cartridges on their TV's. Let's just<br />\nforget it. Let's go watch the afternoon executions downtown. Oh, that's right, that didn't come until his second<br />\nadministration. Or was it the third? Well, I've got a<br />\ndollar, can someone tell me where I can get a Coke? Six<br />\nof them? Quaint.<br />\nHEY BABY, YOU GOT A PERMIT YOU DON'T<br />\nKNOW WHAT TO DO WITH? But that's right, you<br /><br />\ndidn't need a permit in 1969. Animals,just like animals,<br />\nany time you wanted. What do you mean \"not quite<br />\nany time you want\"? You don't need permits, do you?<br />\nYou're animals, animals, all of you are filthy uncivilized<br />\nanimals.<br /><br />\nWHAT MY LAI CAN TEACH US about curing our ghetto<br /><br />\nProblem, by the Reverend Billy Graham. Just one of 36<br />\nlively and informative articles in the April, 1974 Readers'<br />\nDigest<br /><br />\nAll right, all right, I'll calm down. Yeah, I'll \"cool<br />\nit. And twenty-three skiddoo to you, mister. Jesus, I<br /><br />\ned. Okay? Been fine meeting you. Fuck off.<br />\nOh you do, do you? All the exciting things that<br />\nhappened in the 1970's? Well, you all got your wellearned degrees and professorships in your second choice<br />\nschools, that is except for those of you who had the<br />\nprivelege of dying for peace with honor in Asia, South<br />\nAmerica, the Union of South Africa or the crime control<br />\ncampaign (ah, there are some blacks over there, aren't<br />\nthere? You still had them back now, didn't you?). Well,<br />\nmost of you survived. Congratulations. Now, if you'll<br />\nlet me get to sleep.<br />\nHey now come on. What else do you want to<br />\nknow? All right, you all married your second choice<br />\nmates.and bought all the cars you swore you would never<br />\nbe caught dead in. Until the Birth Control Act, you had<br />\nabhorrant numbers of offspring you couldn't afford.<br />\nAfter the Glorious Pre-emptive Thermonuclear Strike on<br />\nCuba, you all glowed merrily in the dark from the scattered radiation. Those of you with any integrity were<br />\nharassed by your leftist students in the early '70's and<br />\nostracized by the Commie College Cleanup in '76 (and<br />\nold Hopkins didn't pull any of that Owen Lattimore shit.<br />\nIt knew where its money was coming from). But most of<br />\nyou have had quiet and prosperous academic careers. It's<br />\nbeen years since you stumbled across your last undergraduate.<br />\nYes, of course the inflation continued. We had the<br />\nNixon economic miracle, the first depression in recorded<br />\neconomic history during which prices actually rose. Now<br />\ndon't you think a man who can do that deserves a third<br />\nterm? Which amendment is that? Oh yeah, I remember.<br />\nThe supreme court ruled that the 1976 elections were<br />\nnot covered by that amendment—some technicality.<br />\nAgnew? Jesus, that was a bloody mess.<br />\nNow, come on, you've got to let me get to sleep.<br />\nWhat, what, what is it? Yes, we still have Vietnam.<br />\n300,000 odd troops. But we reached a turning point in<br />\n1979 and I think we have them on the run now. Anyway, I'm not worried about the draft. The war should be<br />\nover by time they call me.<br />\nSo what if. this is an Army uniform? I believe<br />\nHopkins, back in '69, gave every student the academic<br />\nfreedom to choose to take ROTC if he so desired. Well,<br />\nthat freedom's been expanded. I had my choice between<br /><br />\nWANT OUT OF HERE.<br />\nI mean it may be all right for you people to live<br />\nlike this, okay. But man, I know what's going to happen,<br /><br />\nROTC, NROTC, Air Force ROTC, Coast Guard ROTC,<br />\nCIA ROTC, FBI ROTC, Secret Service ROTC and Post<br /><br />\nand! don't want to be around when it does, right. So<br />\nI'll just sit here and you all go away and I'll fall asleep<br />\nagain and when I wake up none of this will have happen-<br /><br />\nOffice ROTC. I mean which one of you could possibly<br />\nguess that the Special Forces that pacified the inner city<br />\nwould be trained right here at Hopkins? Huh? I mean<br /><br />\nGONE THE WAY of the niclde candybar, the \"Negro\" is<br />\nremembered only in this rare photograph from the 1960's.<br /><br />\nthat's America for you.<br />\nWhat do I mean by \"pacified\"? Shhhh, they might<br />\nbe listening.<br />\nYes, I did say something about the South American and South African wars. I mean don't you think the<br />\npeople in South America should be protected from the<br />\noutsiders who ferment all this trouble? I mean what do<br />\nyou think the Monroe Doctrine is all about? Admittedly, we do most of our fighting around the United<br />\nFruit plantatons and Rockefeller Oil refineries. But so<br />\nwhat? Doesn't Rockefeller deserve a. break? And as for<br />\nthe South Africans, well don't you think they should be<br />\nable to determine their own destiny, free from the Commies in the rest of Africa? It makes sense, doesn't it.<br />\nAparthied? I told you, there aren't any more of<br />\nthem.<br />\nWell, don't be offended. It's not my fault. There<br />\njust aren't. Now let me...what now? No, I don't remember any of the movies in the 1970's. Just before the<br />\nCommie and/or Filth Movie Reinforced Voluntary Code<br />\nof Ethics, movies went so far into an art form that only<br />\nlike intellectuals could really understand them. Then<br />\ncame TV cartridges and the Code. Now there aren't<br />\nmany movies at all. We do get a bit of Walt Disney.<br />\nMusic? Yeah, there really have been some changes.<br />\nI mean you people still have rock, don't you. Well that<br />\nwas sort of phased out under the Self-Enforced AntiEroticism on Wax Code. There still is some rock around,<br />\nbut it kind of limits itself to hair combing and hand<br />\n(Continued On Page 4)<br /><br />\nHeroes for the 60's--A N-L Poll<br />\nThe 1960's were, without a doubt the decade for death. At<br />\nleast one well-known writer has labelled those coming of age during<br />\nthe last ten years, \"The Assassination Generation.- With this in<br />\nmind, the News-Letter, in accordance with its general policy of<br />\naudience participation, asks you, the reader, to help us chose the<br />\nrecipients of the first annual Croakie Awards. Please check one<br />\nname in each of the ten categories listed below and mail the page<br />\nto the News-Letter, Box 1230, Johns Hopkins University. Winners<br />\nwill be announced in the first issue of the 1970's, should there be<br />\na News-Letter in the 1970's. Should there be a 1970's...<br />\nBest near-miss:<br />\n.......Bob Dylan<br />\n.......Timothy Leary<br />\n.......Bobby Seale<br />\n.......Andy Warhol<br />\n.......Lyndon Johnson<br /><br />\nThe murder played<br />\nfor greatest press coverage:<br />\nSirhan B. Sirhan<br />\nLee Harvey Oswald<br />\nJames Earl Ray<br />\nEdward Kennedy<br />\nArt Linkletter<br />\nMelvin Laird<br />\nJack Ruby<br />\nBest-directed cover-up:<br />\nThe Warren Commission<br />\nThe Defense Department<br />\nThe James Earl Ray trial<br />\nAristotle Onassis<br /><br />\nMost aesthetically pleasing murderer:<br />\n.......Charles Whitman<br />\n.......Truman Capote<br />\n.......The Boston Strangler<br />\n........The Sharon Tate killers<br />\n.......Dow Chemical Corporation<br /><br />\nMost artistic suicide:<br />\nMarilyn Monroe<br />\nErnest Hemingway<br />\nLenny Bruce<br />\nPaul McCartney<br />\nJudy Garland<br />\nChe Guevara<br /><br />\nBest group death:<br />\nThe three astronauts<br />\nThe citizens of My Lai<br />\nThe U.S. motorist<br />\nThe crew of the U.S.S. Thresher<br />\nThe Nation of Biafra<br />\nThe Black Panthers<br />\nSeptember I4—J<br /><br />\nMost original suicide:<br />\nJohn F. Kennedy<br /><br />\n4 Most self-righteous killer:<br />\nMoshe Dayan<br />\nDr. Christian Barnard<br />\nThe entertainment industry<br />\nThe tobacco industry<br />\nThe automobile industry<br />\nPope Paul VI<br />\nMost boring death:<br />\nHo Chi Minh<br />\nMao Tse-Tung<br />\nEverett Dirksen<br />\nWinston Churchill<br />\nThe Saturday Evening Post<br />\nSpiro T. Agnew<br />\nThe novel<br />\nBest killing by an organized group:<br />\nOur Army<br />\nTheir Army<br />\nThe State of Mississippi<br />\nThe state of inanition<br /><br />\nU. S. Industry<br />\nThe police<br />\nThe selective service system<br /><br />\nDecember 15, 1969<br /><br />\nNEWS-LETTER<br /><br />\nPAGE 4<br /><br />\nThe Time Is Ripe--Got to Revolution\"<br />\nMuscially speaking, the sixth decade of this<br />\ncentury ended last month. A decade of revolutionary<br />\nexperimentation with musical theory, harmony, instrumentation and emphasis—ten years which saw the change<br />\nin rock 'n' roll from pop to rock--is over. We now enter<br />\nthe period of revolution in lyrics.<br />\nThe first hint of the changes in store for the<br />\ngeneral blandness of rock lyrics began a few years ago,<br />\nwith the radicalization of several of the San Francisco<br />\ngroups, notably the Grateful Dead and the Jefferson<br />\nAirplane. The significance of this was generally overlooked, however, in the face of the vast musical breakthroughs made in that region, and the continuing influence of the less politically-oriented English groups.<br />\nSomehow, Jorma Kaukonen's guitar hid Grace Slick's<br />\n\"and I'd rather have my country die for me.\"<br />\nAll this began to change in November, a month,<br />\nwhich saw simultaneous tours of the Airplane and the<br />\nRolling Stones, and the release of new albums by both<br />\n..croups.<br />\nThe Airplane concert was held in College Park on<br />\nthe sixth anniversary of John Kennedy's assassination<br />\nand, like most concerts was atrociously organized.<br />\nUnlike most UM concerts, however, both shows were,<br />\nfilled to overflowing, and unlike most performers, the<br />\nAirplane promised to make up for an hour's wait in t<br />\ncold b.y playing longer. And better.<br />\nThe Volunteer album is art<br />\nthe first song, \"We Can Be<br />\nreprise, \"Volunteers\". The„:„..„<br />\nexposition to date of the<br />\nphilosophies:<br />\n\"All your private pro<br />\nTarget for your en<br />\nAnd your enemy<br />\nWe.\"<br />\nIt also<br />\nobscene, law<br />\nyoung/But<br />\nis euphe<br />\n'newspa<br />\nis not 441.4 t<br />\n\"Volunteet ..t i4<br />\nFrantisc o's nsw<br />\n.<br />\nandJn Way<br /><br />\ncon<br />\ned s<br />\nnigh<br />\nany<br />\nn<br />\nslimmer at the L,Iniversity<br />\ncr<br />\nWith barely a tnotnen<br />\n«<br />\nspran.r, to it:, feet altd witha roar, joitteu in, luau' cheer'<br />\ning and half inv,iing, Tip, house lights went oil. thf:<br />\nwen: )11 :Ind still the music continued..Then<br />\nligh t<br />\ncame thc. sh-iir<br />\n\"Volunt,..:ers\" and the frenzy begin<br />\nGrace<br />\n()I*,<br />\nvoice and the bass pattern<br />\nearnot.<br /><br />\ncould be felt amid the roar. The show ended with a<br />\nstanding cheer, clenched fists held high.<br />\nFour days later the Stones came to town. Again<br />\nthe concert's sponsors failed to live up to expectations<br />\nand again it was up to the main performers to salvage an<br />\nup-to-then shoddy production.<br />\nRolling Stones records have always been of exceptionally high caliber. The Stones have been able<br />\nto avoid the vicissitudes of the Beatles (\"I am the<br />\nWalrus\"/\"Hello Goodbye\"), the demise through inflexibility of the Mama's and Papa's and the Doors, the<br />\ngimmicks of Al Kooper, and Dylan's soul-searching lack<br />\nof continuity.<br />\nDespite everything that can be said about the<br />\nStones' records, nothing they produce in the studio can<br />\ncompare with one of their concerts. And, like the Airplane, they were up for a rollicking concert.<br />\nInstead of following their traditional pattern of<br />\nplaying for only forty minutes (which is all that bigname groups seems to consider necessary these days),<br />\nthey started off by putting on a full hour-long show.<br />\nThen, what seemed to be the end, wasn't.<br />\nThe house lights came on and Jagger told the<br />\naudience that since he wasn't the only one there, he<br />\nshouldn't be the only one taking part in the concert,<br />\nand thAticveryone should \"conic on up and start dancin'<br />\nNo one's a-gonna get hurt, are they?\" He<br />\nand<br />\ntaunte<br />\n\"'C'inon, let's have some fun!\"<br />\nwas:,t,o 13- anti 14-year-old audience he was<br />\nt Jagger 'had done it again. While the<br />\n. • . c°mix ti y and nonchalantly<br />\njsgger had established, in<br />\ncanny W.IY. 1I ekctt'ic rappcKt,A4..,:.p,000 pew<br />\nmPer°nal Civic Center.' No one cared<br />\nthe<br />\n)is<br />\nsy stem being Ina d 'U.': no one rernS,<br />\nsount.<br />\ntat! \"ge<br />\n..the interminable w.it br .S.,116 Stones. Culmir<br />\n\"Midnight Rambler,\" J!:?,gq had become a per4<br />\nitv to each of his viewet.<br />\n'Then came the end, Mick announced \"<br />\nlas',\" and Mick Taylor rke into \"Honky ef;'.<br />\nmen.\" As that drew to ;iJose, though, for some ie'as<br />\nno one believed it was t,e end--and it wasn't. Amid a<br />\ncontinuous roar. the 't or broke into \"Street Fighting<br />\nMart.:' and, like the previous weekend, the clenched fists<br />\nwere raised. .A week earlier Mick had dedicated the song<br />\nto Chicago when the same thing happened there, but it<br />\nwas clear to everyone in the Civic. Center that it was all<br />\nof America's.<br />\ncrywh cr' I hear the sound of mart:11in',<br />\nchafgin'feet, boy,. ...<br />\nThe summer's here and the time.ts ripe for<br />\nfightin' in the street... bo<br />\n0.4:evolution<br />\n\"Think the time is right f6:<br />\nCat,ise where 1 live the game<br />\nay're a<br />\n.compromise solution<br />\ntreer Fighting Man\" is, b „..„. 13...fitly old<br />\nhen it first came out, al:<br />\nwei446nrused by<br />\n,merely an answer to the,,Ileades' hiatant copution 1”? Was it itself a cop-out since it<br />\nu.<br />\nexplie.tt<br />\ntqft boy can do anytt« t<br />\nuti.<br />\n;Op<br />\n,id it lit in with the<br />\n,<br />\nnTheggars B.ritquet?<br />\napolitica so<br />\nother<br />\nFew \n<br />\nhowever. What may have originally been to Mick and<br />\nKeith the logical extension of their more usual social<br />\ncomment/sexual protest songs when it was written (\"Let<br />\nit Bleed\" for instance) undoubtedly took on new meaning when performed before a live, American, anti-establishment audience. Mick, always leering and taunting,<br />\nmilked it for all it was worth.<br />\nThese type of lyrics are something quite foreign<br />\nto the 1960's. When a song's words were at all considered, they dealt mainly with sex or drugs, and at the<br />\nmost extreme, frustration and social protest. It was a<br />\ndecade whose strongest and harshest condemnations<br />\ncame from the poets: Janis Ian's \"Society's Child,\"<br />\nDylan's \"World War III Blues\" and \"Ballad of a Thin<br />\nMan,\" Simon and Garfunkel's \"Save the Life of My<br />\nChild\" and \"Sounds of Silence,\" Richie Havens'\"Handsome Johnny,\" and the Beatles' \"Eleanor Rigby.\"<br />\nMotown completely copped out until the Supremes finally arose themselves to singing about illegitimacy,<br />\nand the other Black groups, including James Brown, restrained themselves to the concept of people having to<br />\nbe free. Elvis added his bit about starving in the ghet-to,<br />\nand Spanky and Our Gang contributed as a promotion,<br />\n\"Give a Damn.\" Whether our younger brothers and<br />\nsisters believe it or not, the decade of the '60's will go<br />\ndown in history as a period in which the strongest protest song was \"I Cant Get No Satisfaction\"--a song<br />\nwhich deals with sex<br />\nThe change,<br />\nThe Airplane<br />\nis one of the mos<br />\n's in the United<br />\nStates these days:*<br />\nstimated that<br />\nPillow.<br />\n.Volunteers will sel.<br />\nSurrealistic<br />\n....4...,.....<br />\nf.<br />\nBeside.ttt<br />\n.tuIttill<br />\n' contains a<br />\nCrosby-Si<br />\neans,hCwiprasor,s,:,eino<br />\nao.irudsyco<br />\n...,. ,,,.iuti:s.i,,i..,eswatdsoci:<br />\nttaeitrti.,t.nt i-.,h.7<br />\n(.1 ,„. :.,. ,hch<br />\no<br />\n..z.,....a. Car.01,e.fie: ta,. y,.t.r‘orcivm<br />\n° o'fii,.ts.;;.\"1<br />\ntll.ts<br />\nN.<br />\nwkikh.<br />\nAll N44'6'<br />\nAnd 4.<br /><br />\n11-nr..icii;ce°1uittdgsiedie<br />\n•,:... „. . . .<br />\n.<br /><br />\n.ee<br /><br />\n„ 4<br /><br />\nre.veai toe 1:rtta.rit rebellion and frustng up inside thc .Airplane: \"Consider how<br />\ntration<br />\nscream/The human<br />\nsmall ru are; /Compared to<br />\ndream/Doesn't mean shit to a tree,\" and \"How many<br />\nmachine men will you See before you/Stop your believing that speed /Will slide down on you/Like brakes<br />\nin bad weather.\" Lyrics like these have an infectiousness<br />\nthat, combined with the musical level we have reached<br />\nover the p.ist ten years. promise very exciting times<br />\nahead.<br />\nThe very fact that the 'Rolling Stories have picked<br />\nup on the iniPulse is an *Iication that the time may<br />\nbe ripe, if not for palace i.vplkition, at least for singing<br />\nabout it. The concept of<br />\nution is about as far removed from the Englishnia<br />\nas monarchy is to<br />\nours. It is therefore more cxcuabiit the initial attempts<br />\nthere are less serious than our here.The Stones gave it<br />\na try, and it is highly<br />\nafter their reception here,<br />\nthat they will try it again.<br />\nThe musical place to be as the '70's begin, is on<br />\nthe fringe. The groundwork set down by the Mothers<br />\nand the Fugs is finally bearing fruit.<br />\n—Peter Harnik<br />\n3<br /><br />\n...When I Wake Up<br />\n(Continued From Page 3)<br /><br />\nSPECULATION VERITABLY ABOUNDS as<br />\nthe first assassination victim of the 1970's.<br /><br />\nto who will be the<br /><br />\nholding, that sort of thing. Very nostalgic. Pop music<br />\nhas spread out to all different kinds of beats. Samba and<br />\nFrank Sinatra were big in '79. The Beatles? I think they<br />\nwere standing on England when it sank.<br />\nChrist, get that beard, or whatever you call it,<br />\naway from me. What do you want? Yes, it's legal. But<br />\nit's hard to get because all these housewife/truck driver<br />\ntypes keep buying out the supplies.<br />\nNo thank you, I have some of my own.<br />\nNow please, may I get to sleep? After all, you<br />\npeople should get used to the idea that it's not too safe<br />\nto talk in public places. My God, that man right over<br />\nthere is a police informer. How do I know? The wire rim<br />\nglasses are one giveaway—that's how they recognize each<br />\nother. Also, look at that surplus fatigue jacket. Do you<br />\nknow how much recording equipment fits into one of<br />\nthose pockets? It was all explained very nicely in that<br />\nlast issue of Ramparts.<br />\nNo. No. No. Okay, one more question. Of course<br />\nwe landed on Mars. When you spend ten billion a year to<br /><br />\nland on Mars, you land on Mars. And let me tell you, the<br />\nRusskies were nowhere in sight. When this country runs<br />\na space race with itself, you better know damn straight<br />\nthat it's going to win. Yeah, we beat them to Mars, all<br />\nright. And when Captain Bland got out of the M&amp;M<br />\n(that's the Martian Module) planted the flag, saluted it,<br />\nread from his bible a bit, talked to Nixon, to Agnew's<br />\nwidow, to the Secretaries of State, Defense and Interior,<br />\nto the minority leaders of both houses and to football<br />\nCommissioner Namath, he then looked around him and<br />\nremembered that he had forgotten his famous first<br />\nwords. Well, Bland went back to the M &amp; M,. cot the<br />\nfamous first words out, looked at them for awhile, came<br />\nout onto the Martian surface again, littered it with the<br />\nfamous first words and right before he could say the<br />\nwords, was eaten by an unforeseen difficulty. But we did<br />\nget there first.<br />\nSo good luck, 1969 people, it's all yours, tough<br />\nbannanas. I'm just gonna close my eyes and...yeahhh,<br />\nthere are these fat little men at ninepins...drinking cider<br />\n...yeah...<br />\n--Seth Feldman<br /><br />"}], "field_media_file": [{"target_id": 40372, "display": null, "description": null, "target_type": "file", "target_uuid": "31741a6f-45aa-4187-98fe-389e2fa3c5eb", "url": "http://digital.library.jhu.edu/system/files/2022-03/14026-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 14026, "target_type": "node", "target_uuid": "319af6e6-f067-484d-9319-fac486fd3787", "url": "/node/14026"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "71813b5e-f094-4a28-ab64-343204085cec"}]}