{"mid": [{"value": 36931}], "uuid": [{"value": "2b087092-3902-4cf2-b878-10a02867f9d2"}], "vid": [{"value": 36931}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13101-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:27+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "3<br />\n<br />\n-4<br />\n<br />\nLA<br />\nVOL. XXVIII, No 28<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 22, 1924<br />\n<br />\nLi<br />\nPRICE 5 CENTS<br />\n<br />\nPRESIDENT OF CLARKE UNI- WORLD COURT FAMED BY BOWERY BALL TO BE SCENIC CONSOLIDATION OF ENGIN- JOHNS HOPKINS<br />\nMERMEN<br />\nVERSITY GIVES ADDRESS<br />\nDR. AINSLIE AT Y. M. C. A.<br />\nMASQUERADE OF LOWER<br />\nEERING STUDENTS IS<br />\nDOWN SWARTHMORE AT<br />\nON SOUTHWESTERN<br />\nFRIENDSHIP DINNER<br />\nWORLD<br />\nPLANNED BY LEADERS<br />\nSVVARTHMORE<br />\nPLATEAU AT ASSEMBLY<br />\nOF<br />\nELECTRIC<br />\nHistorical Precedents and Popular OpinAL<br />\nCLUB<br />\nWith the rumors floating about<br />\nBlack and Blue Natators Win All But<br />\nion Show Success is Possible. Next<br />\nLantern Slides Used tr, Illustrate LecOne First. Final Score is 48 to 24<br />\nEstablishmen<br />\nt<br />\nof<br />\nSemi-secret<br />\nOrganizathe<br />\ncampus<br />\nthat<br />\nthe Bowery Ball<br />\nDinner February 12<br />\nture. Scholarship Cup Awarded<br />\ntion With Definite Purposes Being<br />\nThe Hopkins swimming team,<br />\nthe Junior Class is planning to<br />\nArranged by Committee<br />\nDr. Peter Ainslie, pastor of the<br />\nPresident Goodnow introduced<br />\nin the first dual meet of the seaput on the night of February 22d<br />\nTo bring before the public the<br />\none of the most interesting speak- Christian Temple, spoke in favor<br />\nson, decisively defeated Swarthis going to be the best ever staged<br />\nfact that Johns Hopkins has an<br />\ners of the year in the person of of the World Court at the Y. M.<br />\nmore last Saturday afternoon at<br />\nthe demand for tickets is growing<br />\nEngineering School which ranks<br />\nPresident Atwood, of Clarke Uni- C. A. Friendship Dinner last TuesSwarthmore, Pa. The I3iack anI<br />\napace. The members of the as<br />\nhigh as the Medical School; to<br />\nversity, at the assembly last day. Basing his arguments on hisBlue mermen won every event<br />\nBowery Ball Committee, consist- boost<br />\nthe undergraduate schools<br />\nThursday morning. In his intro- torical precedents and the strength<br />\nbut one, the fancy dive. The<br />\ning of Gump, Urner, Willison<br />\nin general; to bring together the<br />\nduction the Hopkins president of popular opinion, Dr. Ainslie said<br />\nfinal score was 47 to 24.<br />\nand Wales, are under a constant<br />\nstudents of the various engineermentioned that Clarke University the success of the World Court is<br />\nThe relay team composed of<br />\nbarrage of requests to reserve ing<br />\ndepartments into closer union;<br />\nwas founded on the same lines as entirely within the realm of possiSauerwein, Captain Dunning,<br />\ntickets. The demands come in for and to provide<br />\nthe J. H. U., its first president be- bility.<br />\ncertain social funcBahlke and Lord, started off by<br />\none, two, three, and five tickets tions for<br />\ning Dr. Stanley Hall, of this instithe engineering students<br />\nIdea is Historical<br />\ntution. Clarke was closely linked<br />\nand the committee is seriously is the ambitious program planned winning the 200-yard relay in<br />\nThe early Christians first adwith Hopkins, the two universities<br />\nconsidering raising the ticket by the Hopkins Electrical Club for handy fashion. The time of 1 :52<br />\nsharing nation-wide repute as vanced the idea that war is a crime, limit<br />\nfrom 75 to 90. This will an organization of all the engineer- is very slow but this was due to<br />\ngraduate schols. Dr. Goodnow re- and refused to serve in the Roman<br />\nthe lateness of the officials in tapmean, of course, that there will ing students.<br />\nferred to President Atwood as be- armies. Hugo Grotius, in 1625,<br />\nJ.<br />\nV.<br />\nAlfriend<br />\nand<br />\nClinton<br />\nRecping the men.<br />\ning the leading geographer of mod- made the first modern expression of be a large \"gang\" there, but every<br />\ntor, the originators of the plan, aim<br />\nThe only close finishes of the<br />\nern times, his researches and pub- the League of Nations idea in his effort will be made to accommo- to<br />\nattain these endsby establishing afternoon were in<br />\nthe 100 and 220<br />\nlications having won for_ him wide- book on rights in war and peace. date apache and yegg, second<br />\na chapter of the Association of Col- yard swims. In the<br />\nformer Lord<br />\nspread distinction in his profes- The Jay Treaty was the start of story man and shop lifter.<br />\nlegiate Engineers, known also as of Hopkins<br />\nnarrowly<br />\nbeat Kane<br />\nsion.<br />\nthe first practical application of the<br />\nA momentary shade of despair the Guard of the Knights of St. of<br />\nSwarthmor<br />\ne<br />\nand<br />\nin<br />\nthe latter<br />\nThe theme of Dr. Clarke's ad- arbitration plan. One of the out- was thrown over the<br />\nJuniors Patrick. These two men desire Bahlke of Hopkins won by inches<br />\nSouthweste<br />\nrn growths of this treaty was the when some one heard<br />\ndress was the Great<br />\nthat the that their organization, the Elec- over Martin of Swarthmore.<br />\nPlateau of the United States, its Rush-Bagot agreement, which left Ball could not be held in<br />\nthe Civ- trical Club, should be instrumental<br />\nStevens, Bahlke and Calhoun<br />\ngeological formation, climate and unfOrtified the Canadian-American il Engineering Hall. The<br />\nunder- in effecting the consolidation of performing<br />\nfor Hopkins for the<br />\npeople. According to the speaker, boundary for more than one hun- world of the campus was<br />\nin an up- the engineering students, and, ac- first time,<br />\nperformed very favorthat plateau was once a fluorishing, dred years as an example to the roar until Chairman<br />\nGump came cordingly, have taken up the mat- ably.<br />\nStevens won the back<br />\nhilly country, heavily wooded and world of how nations may live to- forth with a statement<br />\nthat the ter of preliminary arrangements stroke, Bahlke<br />\nwon the 220-yard<br />\nabundantly watered with streams gether peaceably. The Hague Court rumor was merely a<br />\nmalicious re- with this society.<br />\nswim and beat his man on the reand rivers. A violent earthquake in the early twentieth century, the port circulated<br />\nby jealous memThe popularity of these consoli- lay team,<br />\nand Calhoun was runlowered this whole section below League of Nations, and finally the bers of the outside circle<br />\nof the dated engineering associations is ner-up in<br />\nthe fancy dive.<br />\nthe level of the sea, the waters World Court, are recent rnanifesti- \"upper crust.\"<br />\nshown by the fact that 15 colleges<br />\nrushed over the forests and cov- tations of the desire to end war.<br />\nLord High Scorer<br />\nAll the campus night hawks have chapters of the Knights of St.<br />\nered the mountains; then through<br />\nThe<br />\nabsence<br />\nof Welsh was not<br />\nwill<br />\nbe<br />\noverjoyed at the state- Patrick, and 12 more have local<br />\nCourt Product of Centuries<br />\nthe ages the ocean of former years<br />\nfelt<br />\nas<br />\nLord<br />\nsucceeded<br />\nin winning<br />\nment<br />\nthat the dance will run un- organizations which are in nature<br />\nConsequently, the World Court,<br />\nwashed away its terestial features<br />\nthe<br />\n50<br />\nand<br />\n100<br />\nyard<br />\ndashes.<br />\nThese<br />\nsaid Dr. Ainslie, is the product of til 2 P. M. Some unrest of recent exactly similar to the national soand deposited over it a thick layer<br />\nvictories made Lord individual<br />\ncenturies of development in the date made its presence known. ciety.<br />\nof silt. Another sudden burst in<br />\nhigh point scorer of the meet.<br />\nOld World and the New. The Further incentive to attend was<br />\nThe history of the formation of<br />\nthe earth's crust caused the rising<br />\nLord<br />\nalso swam anchor man on<br />\nWorld Court is to be a permanent added when a member of the com- the Knights of St. Patrick is a<br />\nup of this great area to a height<br />\nthe<br />\nrelay.<br />\ninstitution; its eleven judges and mittee happened to let it drop that very interesting one. It seems that<br />\nof 7,000 feet above the sea, much<br />\nThe list of events originally infour deputy judges have already there would be a long high ar- on March 17, 1903, the weather at<br />\nhigher than its former level.<br />\nmade decisions in regard to interna- rangement at one end of the room the University of Missouri was cluded a 200-yard breast stroke,<br />\nThrough the course of the followtional differences—for example, in presided over by a broken nosed very warm, and it occurred to sev- and a 150 yard back stroke. The<br />\ning years erosion Has brought<br />\nSwarthmore authorities refused<br />\na Franco-English dispute about the gentleman in a white apron.<br />\neral lazy engineers who were lying<br />\nabout further change's in the toto<br />\nswim these events and made<br />\ncitizenship of certain North Afrioutdoors in the shade of some<br />\npography of this interesting land;<br />\nthem<br />\nboth events of 100 yards.<br />\nFRESHMEN TO HOLD SMOK- trees that it would be an excellent<br />\ncan peoples.<br />\nrivers cutting great canyons in<br />\nThe<br />\nsummary:<br />\nER ON FEB. 15<br />\nThe World Court should not be<br />\nplan to take the day off. It took<br />\nmany places; whole sections wash-.<br />\n200-yd<br />\nRelay—Won by Hopcondemned because it is new, or beAt a meeting held on January little arguing on their part to con- kins<br />\ning away in others, leaving great<br />\n(Sauerwein<br />\n, Dunning, Bahlke<br />\ncause it is meeting obstacles in the 15, the Freshman<br />\nClass decided vince their fellow engineers of the and Lord). Time 1.52.<br />\nflat plains with high mesas of more<br />\nearly days of its existence. The to hold a Class Smoker<br />\nexcellence of their plan and, acon the<br />\nresistable<br />\nsubstance<br />\ntowering<br />\nFancy Diving—Won by Norrise of the Supreme Court of the 15th of February.<br />\nThis decision cordingly, no engineering classes ton, Swarthmore; second,<br />\nabove them like giant temples of<br />\nCalUnited States to its present posi- was made in order<br />\nto avoid con- were held that day. The follow- houn, Hopkins; third,<br />\nstone.<br />\nGraham,<br />\ntion was attended by bitter strug- flicts which might<br />\noccur if the ing day, when the engineers re- Swarthmore.<br />\nCut off from rainfall by the vast<br />\ngles ; and the World Court must event were to be held .later<br />\nin the turned to school they were notified<br />\nexpanse of Texas on the east, and<br />\n50-yd. Dash—Won by Lord,<br />\ndifficulties.<br />\nsimilar<br />\nface<br />\nyear. The latter part of the that they had all been \"canned.\" Hopkins;<br />\nthe Rocky Mountains on the west,<br />\nsecond, Martin, SwarthPopular Opinion Favors Court<br />\nmonth of February is fairly taken Immediately, an organization for more;<br />\nthe Great Southwestern Plateau<br />\nthird,<br />\nSauerwein, Hopkins.<br />\nPopular opinion, said Dr. Ains- up and it was general opinion that self-preservation was formed and Time-27.1.<br />\nhas been reduced to a barren desert of cactus and sage brush. Dr. lie, favors the World Court, in prin- the middle of the month would in consideration of the fact that Plunge—Won by<br />\nHoward,<br />\nAtwood described how, in the ciple at least. The terrible destruc- be far better, more men being the day of their crime was St. Pat- Hopkins,69 1-2 ft.; second, Hamrick's<br />\nbirthday, the engineers<br />\nmonths when clouds manage to tion of life and property in past able to attend the function with<br />\nbleton, Hopkins, 59 ft.; third,<br />\ncalled<br />\nthemselves<br />\nthe Knights of<br />\nthe<br />\npossibility<br />\nwars,<br />\nworse<br />\npromise<br />\neven<br />\nwith<br />\nof<br />\nalso of their havgather in this region, the moisture<br />\nBest, Swarthmore, 56 ft.<br />\ncondenses into rain which never destruction in future wars, is turn- ing more money at that time. St. Patrick. A few days later the<br />\n100-yd. Back Stroke—Won by<br />\noffenders were all reinstated, but<br />\nreaches the ground. The air of the ing people against war as a method Schwinn, chairman of the Smoker<br />\nStevens, Hopkins; second, Stabdesert is so dry that it may absorb of settling disputes. Friendship, Committee, has already gotten the society once formed, decided ler, Swarthmore; third, Hambleheavy rains for several days with- now if ever, must be introduced in- under way with the preparations to continue its existence and to ton, Hopkins. Time-1.27.<br />\nout allowing any water to ap- to international relations. At our and assures an affair to be remem- provide for a holiday every year<br />\n220-yd. Swim—Won by Bahlke<br />\nproach the thirsty soil below. To- own door we have the possibility bered long afterward. Klef, treas- on March 17.<br />\nHopkins;second, Martin, SwarthThe discovery of a peculiar rock<br />\nday there are no forests, no grass of creating more friendly feelings urer, made a report on the finmore; third, Gailey, Swarthmore.<br />\nand no rivers in the high land of between the United States and Ger- ances of the Class in view of the while excavating the foundation Time-2.45.<br />\nfor a new building at the UniverNew Mexico and Arizona. Prai- many, and between the United approaching party.<br />\n100-Yd. Breast Stroke—Won<br />\nCollection was taken up from sity immediately suggested itself by Dunning,<br />\nries stretching for miles yield no States and Japan. The Queen of<br />\nHopkins; second,<br />\nvegetation save unfriendly cacti Holland gave expression to the sen- the Class to pay in the $15 Stu- to these imaginative engineers as Coale, Swarthmore; third, Grafavoring<br />\ninternational dent Council fee. President Nin- the Blarney Stone and about it a ham, Swarthmore<br />\nand dusty sage brush. There are timent<br />\n. Time-122.<br />\nContinued on page 2, col. 4.<br />\nrivers it is true, but they rush friendliness when she excluded mil- er urged every man to support the<br />\n100-yd. Dash—Won by Lord,<br />\nalong many hundreds of feet be- itary men from her twenty-fifth an- tag day sale of stamps for June<br />\nHopkins; second, Kane, Swarth!ow the general surface of the land niversary celebration. Dr. .Ainslie Week. A meeting will be held<br />\nmore; third, Bahlke, Hopkins.<br />\nNOTICE<br />\nin deep gorges with precipitous concluded with an appeal for more next Thursday to carry out a few<br />\nOfficials—Starter, Le Roy MerSlopes.<br />\ncourage such as that displayed by matters left over, and men will<br />\nCotillon to be held at Md.<br />\ncer, Penn. Judges and timers—J.<br />\nbe detailed to cover the meeting.<br />\nThe mesas, protruding above the Queen of Holland.<br />\nCasualty Club House, Feb. 5.<br />\nC. Mais, Philadelphia Swimming<br />\nthe intensely hot atmosphere of<br />\nW. E. Thomsen, chairman of the selling June Week stamps. It is<br />\nTickets may be obtained<br />\nClub; Henry Scott, Philadelphia<br />\nthe plains, receive more rain than meeting, announced that the next especially desired that every man<br />\nfrom members of Cotillon<br />\nTurnegemeinde, and H. Gallaghthe ground below and consequent- Friendship Dinner would be' held in the Class buy at least one<br />\nBoard.<br />\ner, Central High School, Philadelstamp.<br />\nFebruary 12.<br />\nContinued on page 2, col. 4<br />\n,phia.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 22, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nMaybe<br />\no<br />\n<br />\nThe recent journalistic agitation<br />\nabout one of America's child prodigies interested us, among others.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Besides its news value, the story of<br />\nshould be sent to the MANAGING EDITOR.<br />\n\"Young Sidis,\" as he is familiarly<br />\ncalled, was excellent conservative<br />\nHomewood 100<br />\nTelephone<br />\npropaganda. We have made a menEditor-in-Chief<br />\nBusiness Manager<br />\ntal note to observe its effect on pubJOSEPH LEOPOLD, '24<br />\nPHILIP W. HOWARD, '25<br />\nlic opinion. We hope to be able<br />\nManaging Editor<br />\nto<br />\nannounce the passage of ultraAdvertising Mana ver<br />\nWILLIAM G. DEAN, JR., '24<br />\nconservative<br />\nlegislation, the aban'26<br />\nMcKAY;<br />\nJ.<br />\nA.<br />\nAssistant Managing Editor<br />\ndonment of modernism in literature,<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nart and drama the appearance of<br />\nC. LEWIS, JR., '24<br />\nJOHN<br />\nAssociate Editors<br />\nhorse-cars, and a heavy sale of the<br />\nRICHARD C. TILGHMAN, '25<br />\nBusiness Managers<br />\nAssistant<br />\nHare and the Tortoise fable.<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\n* * *<br />\nD. MILES MARRIAN,'25<br />\nDONALD<br />\nGIESKE,<br />\n'25<br />\nG.<br />\nJunior Editors<br />\nIn one of the seldom-read-letters<br />\nJOHN T. DIXON, '24<br />\nARTHUR L. NELSON, '26<br />\nof<br />\nthis paper's \"Mailbag,\" we struck<br />\nC. EUGENE TOVELL,'24<br />\nERNEST A. STRATHMAN, '26<br />\na<br />\ndescription<br />\nof \"the weekly hour<br />\nALGER G. HISS, '26<br />\nOTHO J KET.T.F.R, III, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJ. JACKSON KIDD, '26<br />\nwith the tutor\" in English univerCHARLES G. HUTZLER, '24<br />\nT. STRAN SUMMERS, '25<br />\nsities. This hour \"has the air of<br />\nJAMES YOUNG, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nHENRY R. TURNBULL, '26<br />\na friendly conversation, a smoke, or<br />\nHAROLD S. GOODWIN, '26<br />\nSTANLEY R. LEVY, '27<br />\nperchance it may be a glass of<br />\nport.\" We consider this an ideal<br />\nMember Southern Intercollegiate Newspaper Association<br />\nmodel for all classes; but show us<br />\nthe American undergraduate that<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ncan make a glass of port last for<br />\nan hour.<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 22, 1924<br />\n* * *<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nWe really 'did enjoy reading<br />\n\"Cultural's\" letter; but why do<br />\nVOLSTEAD AND THE COLLEGIAN<br />\nEnglishmen or Anglicized AmeriFour years have passed since the Volstead Act went into effect. cans invariably employ parables?<br />\nOn the anniversary of the so-called \"drying up\" of the United States, We might have forgiven the introeditorial writers pensively inquire whether or not Prohibition has duction of a parable if it had only<br />\nbeen a success. The consensus of opinion, with a minimum of votes been apt. Our Oxford addict comto the contrary, is that it has not. \"Perhaps,\" The Tech, the official pared American education to a safe<br />\nundergraduate news organ of the Massachusetts Institute of Tech- cracker's knowledge. What safes<br />\nnology, argues, \"it has removed the liquor curse from the poor by can an American college graduate<br />\ncausing the price of liquor which is obtainable to soar above their open?<br />\n* * *<br />\nfinancial reach. But . . . the effect has been merely to shift the<br />\ncurse among those who have sufficient means to supply themselves \"The entertainment offered by<br />\nwith it.\"<br />\nthe Homewood Playshop on the<br />\nevenings<br />\nof January 10, 11 and 12,\"<br />\nDrinking has undoubtedly decreased among the poor. Social<br />\nRoss<br />\nThalheimer, \"consisted<br />\nwrites<br />\nworkers report that the problem of the drunkard's family, formerly<br />\norchestra, an unout-of-place<br />\nof<br />\nan<br />\none of the most difficult to solve, has disappeared entirely. More than<br />\nsplash<br />\nof<br />\ncold air from a<br />\nnecessary<br />\nbalancing this decrease, however, is an increase in the number of<br />\nthe<br />\nfront of the<br />\nrestless<br />\nshutter<br />\nat<br />\ndevotees of Bacchus among the upper classes of the country. And<br />\nwell-played<br />\nauditorium,<br />\nthree<br />\nthe college man has not been backward in taking offense at the changviolin<br />\n(between<br />\nselections<br />\non<br />\nthe<br />\ning of \"Thou ought not\" to \"Thou shalt not\" and in demonstrating<br />\nthat the psychology of \"If you want to make a man want something, Plays I and II) by a bashful young<br />\namateur, and the usual triparte<br />\ntake it away from him\" is correct.<br />\nprogram—which included 'MoonThe New York Times says editorially: \"Prior to the Volstead shine, 'Manly Deeds: Womanly<br />\nAct the colleges had their own code regarding drink. It was forbid- Words,' and 'Fancy Free.'<br />\nden to bring intoxicants into university buildings. Drunkenness, if<br />\n\"Though the first and last of the<br />\npublic, was 'conduct unbecoming a scholar and a gentleman.' Moreplays were comedies very poorly<br />\nover, the man who was publicly intoxicated lost caste with his<br />\nacted, and rather crudely staged, it<br />\nfellows,\"<br />\nwas no spirit of indulgence on the<br />\nSince 1919, however, a marked change has been noticeable. A man part of the audience which accountwho has had enough liquor to make him \"feel happy\" now gains ed for their jocular reception. In<br />\nprestige rather than \"loses caste.\" The growing spirit of moderation the last play, the laughing of the<br />\nhas been dealt a severe blow and few college affairs are considered audience (to say nothing of the<br />\ncomplete without their quota of \"drunks.\" \"The result (of the Vol- 'wit' intent in the play itself) apstead Act) was a rapid swinging back from the attitude that a man pealed, it seemed, so strongly to a<br />\nmight drink but owed respect to his fellows in the matter of conduct, certain Miss Loewenson's sense of<br />\nto the boyish point of view that intoxication was a joke, not on one's humor that at her express command<br />\nself, but on the law.\"<br />\nthe procedure of the play was interrupted<br />\nuntil she was able to gain<br />\nUndergraduates at Harvard, Yale and other colleges have been<br />\ncontrol of her nervous<br />\nmore<br />\nperfect<br />\nsomewhat unfortunate in placing their \"ocasional debauches\" before<br />\nsystem.<br />\nthe public eye. At Harvard, it has been announced, that the penalty<br />\nof newspaper publicity is expulsion. And President Hibben, of, Yale, \"The other discouraging showin an address to the Freshmen, made it plain that expulsion would ing, however, by the members of<br />\nfollow the detection of any violation of the rule forbidding liquor in the Homewood Playshop in these<br />\nuniversity buildings.<br />\ntwo plays was more than atoned<br />\nfor<br />\nin the staging of 'Manly Deeds:<br />\nIt would be useless to deny that there is drinking on the Hopkins<br />\nWomanly<br />\nWords.' Wisely selected,<br />\ncampus. Hopkins undergraduates, however, have used discretion<br />\nbeautifully<br />\nstaged, and perfectly<br />\nand what drinking is done is a \"family affair.\" As far as we are<br />\nadapted<br />\nto<br />\nthe<br />\nabilities of its ac•aware, no Hopkins man has awakened to see his name conspicuously<br />\ntors,<br />\nthe<br />\nachievement<br />\nwas such as<br />\ndisplayed in the morning paper in connection with a \"college spree.\"<br />\nis<br />\nseldom<br />\nrealized<br />\nby<br />\namateurs<br />\nlaHopkins authorities have had nothing to complain of in the matter<br />\nboring<br />\nunder<br />\nsuch<br />\nobvious<br />\ndisadof unfavorable publicity and consequently have not found it necessary<br />\nto take any of the drastic steps corresponding to those at Harvard vantages. We cannot do less in<br />\nhonor of Miss Gambrill's histrionic<br />\n:and Yale.<br />\nability than stand on our chairs, toss<br />\nThe Prohibition Amendment has failed to eliminate the liquor our hats, and cry 'superb!' We can'question in the United States. It is extremely unlikely that threats not do more than cry it again,—<br />\n:and restrictions will cause any lessening of drinking in the colleges. and again.\"<br />\n<br />\nPRESIDENT OF CLARKE<br />\nUNIVERSITY AT<br />\nASSEMBLY<br />\nContinued from page 1<br />\n<br />\nly have a growth of small cedars<br />\nand grass. It was under the sheltering ledges of rock near the summits of these mesas that the ancient cliff dwellers built their<br />\ncities. Protected from the marauding Indians of the plains,<br />\nthese people could tend their flocks<br />\non the flat tops of their home<br />\nmountains with comparative safety. Their houses were substantially built and with little trouble<br />\nthey have been partially or totally restored by the government.<br />\nThe present inhabitants of the<br />\nplateau are mostly Indians and<br />\nMexicans. They are a rugged race,<br />\nthe men especially being of unusual stamina. Dr. Atwood described a race in which the contestants kicked small sticks all the<br />\nway around the base of one of the<br />\nmesas with their bare Wes, covering the distance of about ten miles<br />\nin about an hour.<br />\nPresident Atwood closed his<br />\ntalk by giving a graphic' account<br />\nof the wonders of the Grand Canyon of the Colorado. He showed<br />\nnumerous lantern slides during his<br />\nentire talk, those of the Grand<br />\nCanyon being unusually interesting and beautiful.<br />\nAfter the address Tom Jenifer,<br />\nsecretary of the Interfraternity<br />\nBoard, presented the Scholarship<br />\nCup to the Beta Theta Pi fraternity. The cup enters into the permanent possession of this fraternity as they have won it three<br />\ntimes.<br />\n<br />\nexhibition of various engineering<br />\nphenomena.<br />\nThis affair is usually followed<br />\nby a large ball held in a hall decorated in green to represent Blarney Castle and the Blarney Stone<br />\nmysteriously appears to take its<br />\npart in the decorations.<br />\nOne of the mysterious properties of this Blarney Stone is that<br />\nit travels from chapter to chapter,<br />\nappearing and disappearing at the<br />\nmost unexpected times, and it is<br />\nclaimed no one, not even the highest of the Knigths, knows how it<br />\ngets from place to place.<br />\nThe insignia of the organization<br />\nconsists of a green shamrock<br />\nacross which is a little slide-rule,<br />\nThis emblem is usually attached<br />\nby a small gold chain to the regular class pin.<br />\nThe Hopkins chapter, if established before the end of the year<br />\nwill make its first public appearance on March 17.<br />\nFond Parent to Abie—\"How<br />\nmuch is two times two?\"<br />\nAbie—\"Six.\"<br />\nF. P.—\"No, Abie, that's wrong.<br />\nThe answer is four.\"<br />\nAbie—\"I knowed the answer,<br />\nfadder, but I wanted to see you<br />\nbargain.\"—Jack o' Lantern.<br />\n<br />\nETIGRAVERS<br />\n<br />\nPR1UTERS<br />\n<br />\n131UDERS<br />\n<br />\nCollele Literature<br />\n<br />\nENGINEERING STUDENTS<br />\nPLANNING CLUB<br />\nContinued from page 1<br />\n<br />\nritual was built up, secrets were<br />\nprepared, and the organization<br />\nrapidly spread.<br />\nFrom a society of a purely frivolous nature, the Knights of St.<br />\nPatrick has now grown into an organization having as its serious<br />\npurpose the bringing into a closer<br />\nunion of all engineering students.<br />\nAs a part of it's work, each chapter annually holds an \"engineering<br />\nshow\" which consists of all kinds<br />\nof trick electrical displays and the<br />\n<br />\nPrinters of<br />\n<br />\ncrhe Johns Hopkins<br />\nNEWS-LETTER<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nWhen it comes to clothes, we<br />\nknow what the college man<br />\nwants. And we have it.<br />\nelaac<br />\n<br />\nY-yek-ors,<br />\n<br />\nY.M.B.0.D.<br />\n<br />\nBaltimore & Hanover<br />\n<br />\nSafe Deposit & Trust Co.<br />\nOF BALTIMORE<br />\n13 SOUTH ST.<br />\nOrganized 1864<br />\n<br />\nJohn J. Nelligan, President<br />\n<br />\nGet Extra Credits at Home<br />\nMore than 450 courses in History, English, Mathematics,Chemistry,<br />\nZoology, Modern Languages, Economics, Philosophy,Sociology,etc.,<br />\nare given by correspondence. Learn how the credit they yield may<br />\nbe applied on your college program. Catalog describing courses fully,<br />\nfurnished on request. Write today.<br />\n<br />\nTfie Elniber5itp of efiicago<br />\n95 ELLIS HALL<br />\n<br />\nCHICAGO, ILLINOIS<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 22, 1924<br />\nDR. WILLOUGHBY INTERVIEWED ON RECENT INDIAN TRIP<br />\nGives Views on Indian and Egyptian Polaical Affairs. Conducts Course of<br />\nLectures at Univ. of Calcutta<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\nPRESCRIPTION DRUGGISTS<br />\n<br />\nTWO STORES:]<br />\n<br />\nCharles and Chase Sts.<br />\n<br />\nEutaw Place and North Ave.<br />\n<br />\nVernon 0890<br />\n<br />\nDr. Westel Woodbury Willoughby, Professor of Political<br />\nScience at this university, returned<br />\nGERHARD & REED CO.<br />\nfrom India, where he conducted a<br />\ncourse of 12 lectures at the UniTAILORS<br />\nversity of Calcutta on Fundamen1 1 0 N. EUTAW STREET<br />\ntal Concepts of Public Law. He<br />\n2nd Floor<br />\nwas Tagore Professor of Law at<br />\nthat university. The Tagore professorship is endowed and is occupied by different professors,<br />\nusually foreigners, who are invited<br />\nevery year by the university. As<br />\nDr. Willoughby has spent time in<br />\nall of the British Dominions, he<br />\nwas extremely glad to have had an<br />\nopportunity of visiting India and<br />\nrounding out his personal knowledge of the British- Empire. He<br />\n29 E. BALTIMORE ST.<br />\nwill begin lecturing at this uni- Agents for JOHN B. STETSON<br />\nHATS<br />\nversity on February 1 on the suband FRATERNITY BANDS<br />\nject of Ethical Political Theory.<br />\nThis course is complementary to<br />\none which he gave last year on<br />\nJuristic Political Theory.<br />\nLeaving this country in August,<br />\nDr. Willoughby went to England,<br />\nFrance and<br />\nthence through<br />\nthrough the Suez Canal. He<br />\nstopped in Egypt for three weeks<br />\nbefore continuing to Calcutta. On<br />\nleaving India, he returned to<br />\nAmerica by the same route.<br />\n<br />\ne<br />\nAbteXatterivy<br />\n41<br />\n,02,-zzLeoH.alloE<br />\n%.<br />\n10<br />\n-54RsR,4<br />\nw sci.cA<br />\n•<br />\n<br />\nMadison 0405<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\n<br />\n3<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\nManufactured by<br />\n<br />\nWIGHT & HUMPHRIES<br />\n<br />\nCLOTHES<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nVernon 2355<br />\nR. H. Taylor<br />\n<br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\ns erve d, and reasonably<br />\npriced—is at<br />\n<br />\nLIBERTY ST.<br />\nAT SARATOGA<br />\nLUNCHEON<br />\nTEA<br />\nDINNER<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br />\n<br />\n11.30 A. M.<br />\nuntil<br />\n7.30 P. 1V1<br />\n<br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\n$30 up<br />\nReady-to-wear O'Coats . $35 up<br />\n<br />\n211-213 E. Baltimore St.<br />\n<br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br />\n<br />\nNicholas Brown, Mgr.<br />\n<br />\nSomething Happened in 1891<br />\n<br />\nInterested in Political Conditions<br />\n<br />\nDr. Willoughby stopped off in<br />\nEgypt in order to observe politicl condition, his specialty, in<br />\nthat country. While he was in<br />\nEgypt, England lifted her suzerainty, thus making Egypt entire<br />\nsovereign. Before this time it was<br />\nimpossible for anyone to determine the political status of Egypt.<br />\ndeclared<br />\nEngland<br />\nthat<br />\nshe<br />\n(Egypt) was sovereign with the<br />\nexception of certain restrictions<br />\nwhich would eventually be removed. These resstrictions were<br />\nremoved while Dr. Willoughby<br />\nwas in Egypt and England has<br />\nnow only the rights of protecting<br />\nthe Suez Canal and foreign business in the land of the pyramids.<br />\nPolitical Interest in India<br />\n<br />\nIn India, according to Dr. Willoughby, the English government<br />\nis making an honest attempt to<br />\nslowly introduce responsible government. This is being done with<br />\nthe ultimate of British control<br />\nidentical with that of the Other dominions of Canada, Australia,<br />\nSouth Africa and Ireland. Many<br />\nof the Indians insist that the progress toward Indian autonomy is<br />\ntoo slow and should be more rapid.<br />\nThere is, therefore, a great deal of<br />\ndiscontent which makes England's<br />\ntask of introducing responsible<br />\ngovernment much more difficult.<br />\nPROF. PELLIOT TO LECTURE<br />\nON ARCHAEOLOGY<br />\nProfessor Paul Pelliot, of the<br />\nchair of Chinese Civilization in the<br />\nCollege of France, will deliver four<br />\nlectures, open to the public, in the<br />\nCivil Engineering Hall on February<br />\nthe fifth seventh twelfth and fourteenth, at.5 P. M. Professor Pelliot will lecture on the subject of<br />\nhis archaeological work in Chinese<br />\nTurkestan, where many ancient<br />\nmanuscripts, covered and preserved<br />\nby the invading desert, have been<br />\nreclaimed. The field chosen by Professor Pelliot for his archaeological<br />\nresearch rivals Egypt in its abundance of ancient records, so at this<br />\ntime when Central Asia is assuming archaeological importance, the<br />\narchaeologist's message should be<br />\nintensely interesting.<br />\n<br />\nWhat<br />\nEngineering<br />\nOwes To<br />\nSound<br />\nPrinciples<br />\nDERITAPS no phase of electrical development is more<br />\nfascinating than the events<br />\nleading up to the practical use of electricity as the motive power for street<br />\nrailway transportation.<br />\nIt is a story of \"midnight oil\", hard thinking, extreme perseverance. No better example of the value<br />\nof sound principles to present day engineering could<br />\nbe cited than the Westinghouse No. 3 Motor, as introduced in 1891.<br />\nIts design was so fundamentally correct and the<br />\ndetails were so soundly worked out that subsequent<br />\ndevelopments of railway motors all followed the principles embodied in it. Now let's see what bearing this<br />\nhas had on modern transportation.<br />\nIn 1700 the first permanently fixed rails made their<br />\nappearance. In 1831, in New York, horse cars began<br />\noperation. In 1834, after fruitless attempts to apply<br />\nsteam, compressed air, gas, etc., to these cars, a<br />\nVermont blacksmith, one Thomas Davenport, sug-<br />\n<br />\nWestinghouse Motor, No. 3, the Progenitor of the<br />\nPresent Universally-Adopted D.C. Railway Motor.<br />\n<br />\ngested that electricity be used as the motive power.<br />\nThe very first practical commercial dynamo,built by<br />\nGramme, in 1862, made this suggestion a possibility.<br />\nIt was natural that George Westinghouse, with his<br />\nintense interest in transportation, should take up this<br />\nproblem. From 1889 to 1891, he, with his organization, worked continuously to perfect a commercially<br />\npracticable railway motor, and the famous No. 3,<br />\ndaddy of all street railway motors, was the result.<br />\nAs mentioned before,the principles embodied in the<br />\nNo.3, thirty-two years ago,are still in use, and at least<br />\nten prominent features of this remarkable motor are<br />\nto be found in present-day types. A number of these<br />\nearly motors are still in operation—a tribute to sound<br />\n<br />\nengineering principles.<br />\n<br />\nWestinghouse<br />\nACHIEVEMENT 0 OPPORTUNITY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 22, 1924<br />\nNEWS-LETTER REPRODUCES TWO OF DR. GILDERSLEEVE'S<br />\nSONNETS<br />\n<br />\nAil<br />\n<br />\nAll<br />\nSizes<br />\n<br />\nanfordS\"<br />\n<br />\nI Colors<br />\n<br />\nFOUliTAINFENINK<br />\nK<br />\n13<br />\nIC1:0<br />\n<br />\n,3,11<br />\n<br />\nFor real Fountain Pen Satisfaction<br />\nUse<br />\n<br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br />\n<br />\nSANFORDS<br />\nFOUNTAIN PEN INK<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br />\n<br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nqorimeagatl'4 F4<br />\n<br />\n/14 11F141F14,i141/14 FREI Flfart4 /.141/1414,/141 01.4!<br />\n<br />\n,<br />\nT0<br />\n()TOM 0[115<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\nEIRINNTRINIXHIMMEINEENNINigNMEME)<br />\n<br />\nSHIRTS<br />\n<br />\nNECKWEAR<br />\n<br />\nLeFranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nSince the death of Dr. Basil L. Gildersleeve much has been said<br />\nabout the poetry of the departed Greek scholar. Little of his verse<br />\nfound its way to print, but in the last years of his life Dr. Gildersleeve overcame his reluctance to have his verses published and occasionally a local newspaper or a scholar's magazine was fortunate<br />\nenough to obtain permission to print some of \"the last Greek's\" lilting lines. The best known of these, and one of the latest was the<br />\nsonnet on his eighty-eighth birthday. The sonnet was written in 1919,<br />\nfour years before the master's death.<br />\n\"My eyes are dim from age and dull my ears;<br />\nAnd I am left alone to meditate<br />\nUpon the riddles of our mortal state,<br />\nToo sad for laughter, and too deep for tears.<br />\n<br />\nto<br />\n<br />\nO one smokes<br />\nMelachrinos<br />\nwithout liking them<br />\n—for their quality<br />\ninstantly wins appreciation.<br />\n<br />\nN<br />\n<br />\n\"The wane of intellect, and the weight of years,<br />\nSaid one who knew,'you cannot separate,'<br />\nShall I say yea to this at eighty-eight?<br />\nFor truth is truth, what if it irks, not cheers?<br />\n\"No answer to the question can I find,<br />\nNor will I list to friendship's glowing lips,<br />\nWhich can tell me I am now just what I.was.<br />\nThis constant watching for the wane of mind<br />\nIs it not better than the drear eclipse<br />\nWhen senile meanderin,gs pass for Solon's laws?\"<br />\n<br />\nNeatly combed, well-kept hair is a<br />\nbusiness and social asset.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nfor free trial tube.<br />\n<br />\nTubes-35c<br />\n<br />\nJars-75c<br />\n<br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\nStandard Laboratories, Inc.<br />\n750 Stanford Avenue Los Angeles, California<br />\nSend coupon for Free Trial Tube.<br />\nSTANDARD LABORATORIES,Inc.<br />\n750 Stanford Are.. Los Angeles, California. Dept. I<br />\nPlease send me free trial tube.<br />\nName<br />\n<br />\nMELACHRINO<br />\n\"The One Cigarette Sold the World Over\"<br />\n<br />\nThat a professor of Greek should have written poetry of such<br />\ndepth, and feeling is remarkable, for proficiency in the art only comes<br />\nthrough much practice, even if one has the genius in the first place,<br />\nbut that it was written at the age of eighty-eight is still more remarkable. Dr. Gildersleeve did not stop writing, however, until just<br />\nbefore his death in his ninety-third year. On November 24 last Dr.<br />\nGildersleeve's old friend and companion in arms, Mr. Joseph Packard died and Dr. Gildersleeve wrote the following verse in his honor:<br />\n\"The heart knows its own bitterness, 'tis said<br />\nIts inliest joys no stranger ever knows:<br />\nBut from one source the stream of sorrow flows,<br />\nAnd there's one voice for the mourning of the dead.<br />\nWe weep for those of whom we've only read,<br />\nMourners and mourned may long have found repose,<br />\nAnd yet our hearts are deeply stirred for those<br />\nWho in their day would not be comforted.<br />\nAnd so, dear friend of more than fifty years,<br />\nNoble exemplar of a noble age,<br />\nMy tears for thee call forth another's tears<br />\nFrom the sealed fountain of an old Greek page<br />\nThe sorrows of the world encompass me,<br />\nThe plangent music of griefs sad, salt sea.\"<br />\n<br />\nAddress<br />\n<br />\nsid<br />\nun<br />\n<br />\nilie<br />\n<br />\nHub<br />\n<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\nRE<br />\ncol<br />\n<br />\nBc<br />\non<br />\nab<br />\nwi<br />\n<br />\nsoi<br />\n<br />\nN(<br />\nrni<br />\n<br />\nbe<br />\nthc<br />\nPiz<br />\notl<br />\n<br />\nco.<br />\n<br />\nN(<br />\naci<br />\npe<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n411 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nMUSICAL CLUB MEMBERS CA- ference in pitch between the memThe Greetings of a Fine Store<br />\nbers of each pair. In every case<br />\nPABLE IN PITCH<br />\nthe<br />\nclass<br />\nwas<br />\nrequired<br />\nto<br />\ndecide<br />\nDISCRIMINATION<br />\nTo the Students of a Fine University<br />\nwhether<br />\nthe<br />\nsecond<br />\ntone<br />\nin<br />\neach<br />\nThe Johns Hopkins Musical Club<br />\npair was higher or lower than the<br />\nHOCHSCHILD,KOHN 8c CO.<br />\nreceived a boost when twelve of<br />\nfirst.<br />\nIn each pair there was a difits members in the class in Psycholference of from one-half to thirty<br />\nogy I ranked high in a test in<br />\nvibrations.<br />\npitch discrimination. This test, deClub Members Above Average<br />\nvised by Professor Seashore, of the<br />\nThe class took comfort from the<br />\nUniversity of Iowa, has been given statement of Mr. Isaacs, who had<br />\nto several thousand pupils; and in charge of the test, \"There is no corSpecializes in<br />\nthat way \"percental , groupings\" relation between pitch discriminahave been worked out. For ex- tion and intelligence.\" And the few<br />\nample, anyone receiving from 88 Musical Club members in the class<br />\n—the kind that is being sought<br />\nper cent to 100 per cent correct who did not rank so high took comby the exacting college man.<br />\njudgments, ranks among the best fort in hearing that pitch discrim10 per cent. The results of the test ination is not the ultimate factor in<br />\nare given below: The first column, determining musical ability, since<br />\nincluding the returns for the entire some of the rhythm and time and<br />\nclass, the second column for Music- other points must be considered.<br />\nal Club members only.<br />\nHowever, it is a good advertisement<br />\nRENT A CAR<br />\nMusical for the disturbers of the Thursday<br />\nClub night calm that their fellows did<br />\nClass<br />\n4 a shade better than the ordinary run<br />\n19<br />\nBest 10%<br />\nof mortals.<br />\n4<br />\n11<br />\nNext 20%<br />\nDODGES, 18c PER MILE<br />\nFORDS, 12c PER MILE<br />\n3<br />\n5<br />\nNext 40%<br />\n\"I had a nice chat with your<br />\n1<br />\n11<br />\nSpecial Reduced Rates for 50 Miles or More<br />\nNext 20%<br />\nwife in bed this morning.\"<br />\n0<br />\n7<br />\nLast 10%<br />\n\"What?\"<br />\n<br />\nDistinctive Furnishings<br />\n<br />\nHUTZLER BFCffliElt<br />\n<br />\nDRIVE IT YOURSELF<br />\n<br />\nof<br />\n<br />\nth(<br />\nica<br />\n<br />\nLa<br />\n<br />\nDr. Gildersleeve was speaking of Calmachus' poem to Heraclitus<br />\nwhen he spoke of \"an old Greek page,\" and he added to his original FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nverse a transfusion of that poem, translated by himself, to Mr. Pack343 NORTH CHARLES STREET<br />\nard.<br />\nThis is the last poem that Dr. Gildersleeve is known to have<br />\nALWAYS USE A<br />\nwritten. Unfortunately his verses have never been collected, and<br />\nROBBIN'S STYLE BUILT HATS<br />\nYELLOW CAB<br />\nthose which were printed are scattered in various places. However,<br />\nOR PHONE<br />\nFOR YOUNG MEN<br />\nthere has been some talk that Sigma Upsilon intends to collect the<br />\nand<br />\nthem<br />\nin<br />\ninclude<br />\ntheir collection<br />\npoems of Hopkins' great master<br />\nVERNON 1212<br />\n122 W. BALTIMORE ST.<br />\nof Baltimore authors, now in preparation by the fraternity.<br />\nHAIL THEM ANYWHERE<br />\n<br />\nThe test consists of striking one \"Telephonically speaking,<br />\nhundred pairs of tones, with a dif- course.\"—Virginia Reel.<br />\n<br />\nto<br />\n<br />\nORIGINAL<br />\n<br />\nOUR MEN'S SHOP<br />\n<br />\nr)<br />\nUnruly 1air<br />\n<br />\nJai<br />\non<br />\nnig<br />\nfie(<br />\n<br />\nwi:<br />\nsrn<br />\n<br />\nURNER BROTHERS<br />\n1 1 1 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nMi<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n<br />\n1725 NORTH CHARLES ST.<br />\n<br />\nVERNON 4049<br />\n<br />\nof<br />\nGc<br />\nPe<br />\ntu<br />\nbe<br />\nab<br />\nCl<br />\nBc<br />\n<br />\ntw<br />\n<br />\nin;<br />\nFi<br />\not<br />\n<br />\nth,<br />\n<br />\nT1<br />\n'ii,<br />\nof<br />\n<br />\nr]<br />\n<br />\nwi<br />\nse<br />\nPr<br />\nkr<br />\nPr<br />\nca<br />\nPa<br />\n<br />\nSt<br />\nPr<br />\nis<br />\n<br />\nat<br />\n<br />\not:<br />\n<br />\nse<br />\nta<br />\n<br />\nea<br />\nS<br />\n<br />\nIV<br />\n<br />\n\f", "format": "basic_html", "processed": "3<br /><br />\n-4<br /><br />\nLA<br />\nVOL. XXVIII, No 28<br /><br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 22, 1924<br /><br />\nLi<br />\nPRICE 5 CENTS<br /><br />\nPRESIDENT OF CLARKE UNI- WORLD COURT FAMED BY BOWERY BALL TO BE SCENIC CONSOLIDATION OF ENGIN- JOHNS HOPKINS<br />\nMERMEN<br />\nVERSITY GIVES ADDRESS<br />\nDR. AINSLIE AT Y. M. C. A.<br />\nMASQUERADE OF LOWER<br />\nEERING STUDENTS IS<br />\nDOWN SWARTHMORE AT<br />\nON SOUTHWESTERN<br />\nFRIENDSHIP DINNER<br />\nWORLD<br />\nPLANNED BY LEADERS<br />\nSVVARTHMORE<br />\nPLATEAU AT ASSEMBLY<br />\nOF<br />\nELECTRIC<br />\nHistorical Precedents and Popular OpinAL<br />\nCLUB<br />\nWith the rumors floating about<br />\nBlack and Blue Natators Win All But<br />\nion Show Success is Possible. Next<br />\nLantern Slides Used tr, Illustrate LecOne First. Final Score is 48 to 24<br />\nEstablishmen<br />\nt<br />\nof<br />\nSemi-secret<br />\nOrganizathe<br />\ncampus<br />\nthat<br />\nthe Bowery Ball<br />\nDinner February 12<br />\nture. Scholarship Cup Awarded<br />\ntion With Definite Purposes Being<br />\nThe Hopkins swimming team,<br />\nthe Junior Class is planning to<br />\nArranged by Committee<br />\nDr. Peter Ainslie, pastor of the<br />\nPresident Goodnow introduced<br />\nin the first dual meet of the seaput on the night of February 22d<br />\nTo bring before the public the<br />\none of the most interesting speak- Christian Temple, spoke in favor<br />\nson, decisively defeated Swarthis going to be the best ever staged<br />\nfact that Johns Hopkins has an<br />\ners of the year in the person of of the World Court at the Y. M.<br />\nmore last Saturday afternoon at<br />\nthe demand for tickets is growing<br />\nEngineering School which ranks<br />\nPresident Atwood, of Clarke Uni- C. A. Friendship Dinner last TuesSwarthmore, Pa. The I3iack anI<br />\napace. The members of the as<br />\nhigh as the Medical School; to<br />\nversity, at the assembly last day. Basing his arguments on hisBlue mermen won every event<br />\nBowery Ball Committee, consist- boost<br />\nthe undergraduate schools<br />\nThursday morning. In his intro- torical precedents and the strength<br />\nbut one, the fancy dive. The<br />\ning of Gump, Urner, Willison<br />\nin general; to bring together the<br />\nduction the Hopkins president of popular opinion, Dr. Ainslie said<br />\nfinal score was 47 to 24.<br />\nand Wales, are under a constant<br />\nstudents of the various engineermentioned that Clarke University the success of the World Court is<br />\nThe relay team composed of<br />\nbarrage of requests to reserve ing<br />\ndepartments into closer union;<br />\nwas founded on the same lines as entirely within the realm of possiSauerwein, Captain Dunning,<br />\ntickets. The demands come in for and to provide<br />\nthe J. H. U., its first president be- bility.<br />\ncertain social funcBahlke and Lord, started off by<br />\none, two, three, and five tickets tions for<br />\ning Dr. Stanley Hall, of this instithe engineering students<br />\nIdea is Historical<br />\ntution. Clarke was closely linked<br />\nand the committee is seriously is the ambitious program planned winning the 200-yard relay in<br />\nThe early Christians first adwith Hopkins, the two universities<br />\nconsidering raising the ticket by the Hopkins Electrical Club for handy fashion. The time of 1 :52<br />\nsharing nation-wide repute as vanced the idea that war is a crime, limit<br />\nfrom 75 to 90. This will an organization of all the engineer- is very slow but this was due to<br />\ngraduate schols. Dr. Goodnow re- and refused to serve in the Roman<br />\nthe lateness of the officials in tapmean, of course, that there will ing students.<br />\nferred to President Atwood as be- armies. Hugo Grotius, in 1625,<br />\nJ.<br />\nV.<br />\nAlfriend<br />\nand<br />\nClinton<br />\nRecping the men.<br />\ning the leading geographer of mod- made the first modern expression of be a large \"gang\" there, but every<br />\ntor, the originators of the plan, aim<br />\nThe only close finishes of the<br />\nern times, his researches and pub- the League of Nations idea in his effort will be made to accommo- to<br />\nattain these endsby establishing afternoon were in<br />\nthe 100 and 220<br />\nlications having won for_ him wide- book on rights in war and peace. date apache and yegg, second<br />\na chapter of the Association of Col- yard swims. In the<br />\nformer Lord<br />\nspread distinction in his profes- The Jay Treaty was the start of story man and shop lifter.<br />\nlegiate Engineers, known also as of Hopkins<br />\nnarrowly<br />\nbeat Kane<br />\nsion.<br />\nthe first practical application of the<br />\nA momentary shade of despair the Guard of the Knights of St. of<br />\nSwarthmor<br />\ne<br />\nand<br />\nin<br />\nthe latter<br />\nThe theme of Dr. Clarke's ad- arbitration plan. One of the out- was thrown over the<br />\nJuniors Patrick. These two men desire Bahlke of Hopkins won by inches<br />\nSouthweste<br />\nrn growths of this treaty was the when some one heard<br />\ndress was the Great<br />\nthat the that their organization, the Elec- over Martin of Swarthmore.<br />\nPlateau of the United States, its Rush-Bagot agreement, which left Ball could not be held in<br />\nthe Civ- trical Club, should be instrumental<br />\nStevens, Bahlke and Calhoun<br />\ngeological formation, climate and unfOrtified the Canadian-American il Engineering Hall. The<br />\nunder- in effecting the consolidation of performing<br />\nfor Hopkins for the<br />\npeople. According to the speaker, boundary for more than one hun- world of the campus was<br />\nin an up- the engineering students, and, ac- first time,<br />\nperformed very favorthat plateau was once a fluorishing, dred years as an example to the roar until Chairman<br />\nGump came cordingly, have taken up the mat- ably.<br />\nStevens won the back<br />\nhilly country, heavily wooded and world of how nations may live to- forth with a statement<br />\nthat the ter of preliminary arrangements stroke, Bahlke<br />\nwon the 220-yard<br />\nabundantly watered with streams gether peaceably. The Hague Court rumor was merely a<br />\nmalicious re- with this society.<br />\nswim and beat his man on the reand rivers. A violent earthquake in the early twentieth century, the port circulated<br />\nby jealous memThe popularity of these consoli- lay team,<br />\nand Calhoun was runlowered this whole section below League of Nations, and finally the bers of the outside circle<br />\nof the dated engineering associations is ner-up in<br />\nthe fancy dive.<br />\nthe level of the sea, the waters World Court, are recent rnanifesti- \"upper crust.\"<br />\nshown by the fact that 15 colleges<br />\nrushed over the forests and cov- tations of the desire to end war.<br />\nLord High Scorer<br />\nAll the campus night hawks have chapters of the Knights of St.<br />\nered the mountains; then through<br />\nThe<br />\nabsence<br />\nof Welsh was not<br />\nwill<br />\nbe<br />\noverjoyed at the state- Patrick, and 12 more have local<br />\nCourt Product of Centuries<br />\nthe ages the ocean of former years<br />\nfelt<br />\nas<br />\nLord<br />\nsucceeded<br />\nin winning<br />\nment<br />\nthat the dance will run un- organizations which are in nature<br />\nConsequently, the World Court,<br />\nwashed away its terestial features<br />\nthe<br />\n50<br />\nand<br />\n100<br />\nyard<br />\ndashes.<br />\nThese<br />\nsaid Dr. Ainslie, is the product of til 2 P. M. Some unrest of recent exactly similar to the national soand deposited over it a thick layer<br />\nvictories made Lord individual<br />\ncenturies of development in the date made its presence known. ciety.<br />\nof silt. Another sudden burst in<br />\nhigh point scorer of the meet.<br />\nOld World and the New. The Further incentive to attend was<br />\nThe history of the formation of<br />\nthe earth's crust caused the rising<br />\nLord<br />\nalso swam anchor man on<br />\nWorld Court is to be a permanent added when a member of the com- the Knights of St. Patrick is a<br />\nup of this great area to a height<br />\nthe<br />\nrelay.<br />\ninstitution; its eleven judges and mittee happened to let it drop that very interesting one. It seems that<br />\nof 7,000 feet above the sea, much<br />\nThe list of events originally infour deputy judges have already there would be a long high ar- on March 17, 1903, the weather at<br />\nhigher than its former level.<br />\nmade decisions in regard to interna- rangement at one end of the room the University of Missouri was cluded a 200-yard breast stroke,<br />\nThrough the course of the followtional differences—for example, in presided over by a broken nosed very warm, and it occurred to sev- and a 150 yard back stroke. The<br />\ning years erosion Has brought<br />\nSwarthmore authorities refused<br />\na Franco-English dispute about the gentleman in a white apron.<br />\neral lazy engineers who were lying<br />\nabout further change's in the toto<br />\nswim these events and made<br />\ncitizenship of certain North Afrioutdoors in the shade of some<br />\npography of this interesting land;<br />\nthem<br />\nboth events of 100 yards.<br />\nFRESHMEN TO HOLD SMOK- trees that it would be an excellent<br />\ncan peoples.<br />\nrivers cutting great canyons in<br />\nThe<br />\nsummary:<br />\nER ON FEB. 15<br />\nThe World Court should not be<br />\nplan to take the day off. It took<br />\nmany places; whole sections wash-.<br />\n200-yd<br />\nRelay—Won by Hopcondemned because it is new, or beAt a meeting held on January little arguing on their part to con- kins<br />\ning away in others, leaving great<br />\n(Sauerwein<br />\n, Dunning, Bahlke<br />\ncause it is meeting obstacles in the 15, the Freshman<br />\nClass decided vince their fellow engineers of the and Lord). Time 1.52.<br />\nflat plains with high mesas of more<br />\nearly days of its existence. The to hold a Class Smoker<br />\nexcellence of their plan and, acon the<br />\nresistable<br />\nsubstance<br />\ntowering<br />\nFancy Diving—Won by Norrise of the Supreme Court of the 15th of February.<br />\nThis decision cordingly, no engineering classes ton, Swarthmore; second,<br />\nabove them like giant temples of<br />\nCalUnited States to its present posi- was made in order<br />\nto avoid con- were held that day. The follow- houn, Hopkins; third,<br />\nstone.<br />\nGraham,<br />\ntion was attended by bitter strug- flicts which might<br />\noccur if the ing day, when the engineers re- Swarthmore.<br />\nCut off from rainfall by the vast<br />\ngles ; and the World Court must event were to be held .later<br />\nin the turned to school they were notified<br />\nexpanse of Texas on the east, and<br />\n50-yd. Dash—Won by Lord,<br />\ndifficulties.<br />\nsimilar<br />\nface<br />\nyear. The latter part of the that they had all been \"canned.\" Hopkins;<br />\nthe Rocky Mountains on the west,<br />\nsecond, Martin, SwarthPopular Opinion Favors Court<br />\nmonth of February is fairly taken Immediately, an organization for more;<br />\nthe Great Southwestern Plateau<br />\nthird,<br />\nSauerwein, Hopkins.<br />\nPopular opinion, said Dr. Ains- up and it was general opinion that self-preservation was formed and Time-27.1.<br />\nhas been reduced to a barren desert of cactus and sage brush. Dr. lie, favors the World Court, in prin- the middle of the month would in consideration of the fact that Plunge—Won by<br />\nHoward,<br />\nAtwood described how, in the ciple at least. The terrible destruc- be far better, more men being the day of their crime was St. Pat- Hopkins,69 1-2 ft.; second, Hamrick's<br />\nbirthday, the engineers<br />\nmonths when clouds manage to tion of life and property in past able to attend the function with<br />\nbleton, Hopkins, 59 ft.; third,<br />\ncalled<br />\nthemselves<br />\nthe Knights of<br />\nthe<br />\npossibility<br />\nwars,<br />\nworse<br />\npromise<br />\neven<br />\nwith<br />\nof<br />\nalso of their havgather in this region, the moisture<br />\nBest, Swarthmore, 56 ft.<br />\ncondenses into rain which never destruction in future wars, is turn- ing more money at that time. St. Patrick. A few days later the<br />\n100-yd. Back Stroke—Won by<br />\noffenders were all reinstated, but<br />\nreaches the ground. The air of the ing people against war as a method Schwinn, chairman of the Smoker<br />\nStevens, Hopkins; second, Stabdesert is so dry that it may absorb of settling disputes. Friendship, Committee, has already gotten the society once formed, decided ler, Swarthmore; third, Hambleheavy rains for several days with- now if ever, must be introduced in- under way with the preparations to continue its existence and to ton, Hopkins. Time-1.27.<br />\nout allowing any water to ap- to international relations. At our and assures an affair to be remem- provide for a holiday every year<br />\n220-yd. Swim—Won by Bahlke<br />\nproach the thirsty soil below. To- own door we have the possibility bered long afterward. Klef, treas- on March 17.<br />\nHopkins;second, Martin, SwarthThe discovery of a peculiar rock<br />\nday there are no forests, no grass of creating more friendly feelings urer, made a report on the finmore; third, Gailey, Swarthmore.<br />\nand no rivers in the high land of between the United States and Ger- ances of the Class in view of the while excavating the foundation Time-2.45.<br />\nfor a new building at the UniverNew Mexico and Arizona. Prai- many, and between the United approaching party.<br />\n100-Yd. Breast Stroke—Won<br />\nCollection was taken up from sity immediately suggested itself by Dunning,<br />\nries stretching for miles yield no States and Japan. The Queen of<br />\nHopkins; second,<br />\nvegetation save unfriendly cacti Holland gave expression to the sen- the Class to pay in the $15 Stu- to these imaginative engineers as Coale, Swarthmore; third, Grafavoring<br />\ninternational dent Council fee. President Nin- the Blarney Stone and about it a ham, Swarthmore<br />\nand dusty sage brush. There are timent<br />\n. Time-122.<br />\nContinued on page 2, col. 4.<br />\nrivers it is true, but they rush friendliness when she excluded mil- er urged every man to support the<br />\n100-yd. Dash—Won by Lord,<br />\nalong many hundreds of feet be- itary men from her twenty-fifth an- tag day sale of stamps for June<br />\nHopkins; second, Kane, Swarth!ow the general surface of the land niversary celebration. Dr. .Ainslie Week. A meeting will be held<br />\nmore; third, Bahlke, Hopkins.<br />\nNOTICE<br />\nin deep gorges with precipitous concluded with an appeal for more next Thursday to carry out a few<br />\nOfficials—Starter, Le Roy MerSlopes.<br />\ncourage such as that displayed by matters left over, and men will<br />\nCotillon to be held at Md.<br />\ncer, Penn. Judges and timers—J.<br />\nbe detailed to cover the meeting.<br />\nThe mesas, protruding above the Queen of Holland.<br />\nCasualty Club House, Feb. 5.<br />\nC. Mais, Philadelphia Swimming<br />\nthe intensely hot atmosphere of<br />\nW. E. Thomsen, chairman of the selling June Week stamps. It is<br />\nTickets may be obtained<br />\nClub; Henry Scott, Philadelphia<br />\nthe plains, receive more rain than meeting, announced that the next especially desired that every man<br />\nfrom members of Cotillon<br />\nTurnegemeinde, and H. Gallaghthe ground below and consequent- Friendship Dinner would be' held in the Class buy at least one<br />\nBoard.<br />\ner, Central High School, Philadelstamp.<br />\nFebruary 12.<br />\nContinued on page 2, col. 4<br />\n,phia.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 22, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nMaybe<br />\no<br /><br />\nThe recent journalistic agitation<br />\nabout one of America's child prodigies interested us, among others.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Besides its news value, the story of<br />\nshould be sent to the MANAGING EDITOR.<br />\n\"Young Sidis,\" as he is familiarly<br />\ncalled, was excellent conservative<br />\nHomewood 100<br />\nTelephone<br />\npropaganda. We have made a menEditor-in-Chief<br />\nBusiness Manager<br />\ntal note to observe its effect on pubJOSEPH LEOPOLD, '24<br />\nPHILIP W. HOWARD, '25<br />\nlic opinion. We hope to be able<br />\nManaging Editor<br />\nto<br />\nannounce the passage of ultraAdvertising Mana ver<br />\nWILLIAM G. DEAN, JR., '24<br />\nconservative<br />\nlegislation, the aban'26<br />\nMcKAY;<br />\nJ.<br />\nA.<br />\nAssistant Managing Editor<br />\ndonment of modernism in literature,<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nart and drama the appearance of<br />\nC. LEWIS, JR., '24<br />\nJOHN<br />\nAssociate Editors<br />\nhorse-cars, and a heavy sale of the<br />\nRICHARD C. TILGHMAN, '25<br />\nBusiness Managers<br />\nAssistant<br />\nHare and the Tortoise fable.<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\n* * *<br />\nD. MILES MARRIAN,'25<br />\nDONALD<br />\nGIESKE,<br />\n'25<br />\nG.<br />\nJunior Editors<br />\nIn one of the seldom-read-letters<br />\nJOHN T. DIXON, '24<br />\nARTHUR L. NELSON, '26<br />\nof<br />\nthis paper's \"Mailbag,\" we struck<br />\nC. EUGENE TOVELL,'24<br />\nERNEST A. STRATHMAN, '26<br />\na<br />\ndescription<br />\nof \"the weekly hour<br />\nALGER G. HISS, '26<br />\nOTHO J KET.T.F.R, III, '26<br />\nEDWARD 0. MICHEL, '26<br />\nJ. JACKSON KIDD, '26<br />\nwith the tutor\" in English univerCHARLES G. HUTZLER, '24<br />\nT. STRAN SUMMERS, '25<br />\nsities. This hour \"has the air of<br />\nJAMES YOUNG, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nHENRY R. TURNBULL, '26<br />\na friendly conversation, a smoke, or<br />\nHAROLD S. GOODWIN, '26<br />\nSTANLEY R. LEVY, '27<br />\nperchance it may be a glass of<br />\nport.\" We consider this an ideal<br />\nMember Southern Intercollegiate Newspaper Association<br />\nmodel for all classes; but show us<br />\nthe American undergraduate that<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\ncan make a glass of port last for<br />\nan hour.<br />\nHOMEWOOD, BALTIMORE, MD., JANUARY 22, 1924<br />\n* * *<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nWe really 'did enjoy reading<br />\n\"Cultural's\" letter; but why do<br />\nVOLSTEAD AND THE COLLEGIAN<br />\nEnglishmen or Anglicized AmeriFour years have passed since the Volstead Act went into effect. cans invariably employ parables?<br />\nOn the anniversary of the so-called \"drying up\" of the United States, We might have forgiven the introeditorial writers pensively inquire whether or not Prohibition has duction of a parable if it had only<br />\nbeen a success. The consensus of opinion, with a minimum of votes been apt. Our Oxford addict comto the contrary, is that it has not. \"Perhaps,\" The Tech, the official pared American education to a safe<br />\nundergraduate news organ of the Massachusetts Institute of Tech- cracker's knowledge. What safes<br />\nnology, argues, \"it has removed the liquor curse from the poor by can an American college graduate<br />\ncausing the price of liquor which is obtainable to soar above their open?<br />\n* * *<br />\nfinancial reach. But . . . the effect has been merely to shift the<br />\ncurse among those who have sufficient means to supply themselves \"The entertainment offered by<br />\nwith it.\"<br />\nthe Homewood Playshop on the<br />\nevenings<br />\nof January 10, 11 and 12,\"<br />\nDrinking has undoubtedly decreased among the poor. Social<br />\nRoss<br />\nThalheimer, \"consisted<br />\nwrites<br />\nworkers report that the problem of the drunkard's family, formerly<br />\norchestra, an unout-of-place<br />\nof<br />\nan<br />\none of the most difficult to solve, has disappeared entirely. More than<br />\nsplash<br />\nof<br />\ncold air from a<br />\nnecessary<br />\nbalancing this decrease, however, is an increase in the number of<br />\nthe<br />\nfront of the<br />\nrestless<br />\nshutter<br />\nat<br />\ndevotees of Bacchus among the upper classes of the country. And<br />\nwell-played<br />\nauditorium,<br />\nthree<br />\nthe college man has not been backward in taking offense at the changviolin<br />\n(between<br />\nselections<br />\non<br />\nthe<br />\ning of \"Thou ought not\" to \"Thou shalt not\" and in demonstrating<br />\nthat the psychology of \"If you want to make a man want something, Plays I and II) by a bashful young<br />\namateur, and the usual triparte<br />\ntake it away from him\" is correct.<br />\nprogram—which included 'MoonThe New York Times says editorially: \"Prior to the Volstead shine, 'Manly Deeds: Womanly<br />\nAct the colleges had their own code regarding drink. It was forbid- Words,' and 'Fancy Free.'<br />\nden to bring intoxicants into university buildings. Drunkenness, if<br />\n\"Though the first and last of the<br />\npublic, was 'conduct unbecoming a scholar and a gentleman.' Moreplays were comedies very poorly<br />\nover, the man who was publicly intoxicated lost caste with his<br />\nacted, and rather crudely staged, it<br />\nfellows,\"<br />\nwas no spirit of indulgence on the<br />\nSince 1919, however, a marked change has been noticeable. A man part of the audience which accountwho has had enough liquor to make him \"feel happy\" now gains ed for their jocular reception. In<br />\nprestige rather than \"loses caste.\" The growing spirit of moderation the last play, the laughing of the<br />\nhas been dealt a severe blow and few college affairs are considered audience (to say nothing of the<br />\ncomplete without their quota of \"drunks.\" \"The result (of the Vol- 'wit' intent in the play itself) apstead Act) was a rapid swinging back from the attitude that a man pealed, it seemed, so strongly to a<br />\nmight drink but owed respect to his fellows in the matter of conduct, certain Miss Loewenson's sense of<br />\nto the boyish point of view that intoxication was a joke, not on one's humor that at her express command<br />\nself, but on the law.\"<br />\nthe procedure of the play was interrupted<br />\nuntil she was able to gain<br />\nUndergraduates at Harvard, Yale and other colleges have been<br />\ncontrol of her nervous<br />\nmore<br />\nperfect<br />\nsomewhat unfortunate in placing their \"ocasional debauches\" before<br />\nsystem.<br />\nthe public eye. At Harvard, it has been announced, that the penalty<br />\nof newspaper publicity is expulsion. And President Hibben, of, Yale, \"The other discouraging showin an address to the Freshmen, made it plain that expulsion would ing, however, by the members of<br />\nfollow the detection of any violation of the rule forbidding liquor in the Homewood Playshop in these<br />\nuniversity buildings.<br />\ntwo plays was more than atoned<br />\nfor<br />\nin the staging of 'Manly Deeds:<br />\nIt would be useless to deny that there is drinking on the Hopkins<br />\nWomanly<br />\nWords.' Wisely selected,<br />\ncampus. Hopkins undergraduates, however, have used discretion<br />\nbeautifully<br />\nstaged, and perfectly<br />\nand what drinking is done is a \"family affair.\" As far as we are<br />\nadapted<br />\nto<br />\nthe<br />\nabilities of its ac•aware, no Hopkins man has awakened to see his name conspicuously<br />\ntors,<br />\nthe<br />\nachievement<br />\nwas such as<br />\ndisplayed in the morning paper in connection with a \"college spree.\"<br />\nis<br />\nseldom<br />\nrealized<br />\nby<br />\namateurs<br />\nlaHopkins authorities have had nothing to complain of in the matter<br />\nboring<br />\nunder<br />\nsuch<br />\nobvious<br />\ndisadof unfavorable publicity and consequently have not found it necessary<br />\nto take any of the drastic steps corresponding to those at Harvard vantages. We cannot do less in<br />\nhonor of Miss Gambrill's histrionic<br />\n:and Yale.<br />\nability than stand on our chairs, toss<br />\nThe Prohibition Amendment has failed to eliminate the liquor our hats, and cry 'superb!' We can'question in the United States. It is extremely unlikely that threats not do more than cry it again,—<br />\n:and restrictions will cause any lessening of drinking in the colleges. and again.\"<br /><br />\nPRESIDENT OF CLARKE<br />\nUNIVERSITY AT<br />\nASSEMBLY<br />\nContinued from page 1<br /><br />\nly have a growth of small cedars<br />\nand grass. It was under the sheltering ledges of rock near the summits of these mesas that the ancient cliff dwellers built their<br />\ncities. Protected from the marauding Indians of the plains,<br />\nthese people could tend their flocks<br />\non the flat tops of their home<br />\nmountains with comparative safety. Their houses were substantially built and with little trouble<br />\nthey have been partially or totally restored by the government.<br />\nThe present inhabitants of the<br />\nplateau are mostly Indians and<br />\nMexicans. They are a rugged race,<br />\nthe men especially being of unusual stamina. Dr. Atwood described a race in which the contestants kicked small sticks all the<br />\nway around the base of one of the<br />\nmesas with their bare Wes, covering the distance of about ten miles<br />\nin about an hour.<br />\nPresident Atwood closed his<br />\ntalk by giving a graphic' account<br />\nof the wonders of the Grand Canyon of the Colorado. He showed<br />\nnumerous lantern slides during his<br />\nentire talk, those of the Grand<br />\nCanyon being unusually interesting and beautiful.<br />\nAfter the address Tom Jenifer,<br />\nsecretary of the Interfraternity<br />\nBoard, presented the Scholarship<br />\nCup to the Beta Theta Pi fraternity. The cup enters into the permanent possession of this fraternity as they have won it three<br />\ntimes.<br /><br />\nexhibition of various engineering<br />\nphenomena.<br />\nThis affair is usually followed<br />\nby a large ball held in a hall decorated in green to represent Blarney Castle and the Blarney Stone<br />\nmysteriously appears to take its<br />\npart in the decorations.<br />\nOne of the mysterious properties of this Blarney Stone is that<br />\nit travels from chapter to chapter,<br />\nappearing and disappearing at the<br />\nmost unexpected times, and it is<br />\nclaimed no one, not even the highest of the Knigths, knows how it<br />\ngets from place to place.<br />\nThe insignia of the organization<br />\nconsists of a green shamrock<br />\nacross which is a little slide-rule,<br />\nThis emblem is usually attached<br />\nby a small gold chain to the regular class pin.<br />\nThe Hopkins chapter, if established before the end of the year<br />\nwill make its first public appearance on March 17.<br />\nFond Parent to Abie—\"How<br />\nmuch is two times two?\"<br />\nAbie—\"Six.\"<br />\nF. P.—\"No, Abie, that's wrong.<br />\nThe answer is four.\"<br />\nAbie—\"I knowed the answer,<br />\nfadder, but I wanted to see you<br />\nbargain.\"—Jack o' Lantern.<br /><br />\nETIGRAVERS<br /><br />\nPR1UTERS<br /><br />\n131UDERS<br /><br />\nCollele Literature<br /><br />\nENGINEERING STUDENTS<br />\nPLANNING CLUB<br />\nContinued from page 1<br /><br />\nritual was built up, secrets were<br />\nprepared, and the organization<br />\nrapidly spread.<br />\nFrom a society of a purely frivolous nature, the Knights of St.<br />\nPatrick has now grown into an organization having as its serious<br />\npurpose the bringing into a closer<br />\nunion of all engineering students.<br />\nAs a part of it's work, each chapter annually holds an \"engineering<br />\nshow\" which consists of all kinds<br />\nof trick electrical displays and the<br /><br />\nPrinters of<br /><br />\ncrhe Johns Hopkins<br />\nNEWS-LETTER<br />\nLOMBARD and SOUTH STREETS<br /><br />\nWhen it comes to clothes, we<br />\nknow what the college man<br />\nwants. And we have it.<br />\nelaac<br /><br />\nY-yek-ors,<br /><br />\nY.M.B.0.D.<br /><br />\nBaltimore &amp; Hanover<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nOF BALTIMORE<br />\n13 SOUTH ST.<br />\nOrganized 1864<br /><br />\nJohn J. Nelligan, President<br /><br />\nGet Extra Credits at Home<br />\nMore than 450 courses in History, English, Mathematics,Chemistry,<br />\nZoology, Modern Languages, Economics, Philosophy,Sociology,etc.,<br />\nare given by correspondence. Learn how the credit they yield may<br />\nbe applied on your college program. Catalog describing courses fully,<br />\nfurnished on request. Write today.<br /><br />\nTfie Elniber5itp of efiicago<br />\n95 ELLIS HALL<br /><br />\nCHICAGO, ILLINOIS<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 22, 1924<br />\nDR. WILLOUGHBY INTERVIEWED ON RECENT INDIAN TRIP<br />\nGives Views on Indian and Egyptian Polaical Affairs. Conducts Course of<br />\nLectures at Univ. of Calcutta<br /><br />\nHYNSON, WESTCOTT and DUNNING<br />\nPRESCRIPTION DRUGGISTS<br /><br />\nTWO STORES:]<br /><br />\nCharles and Chase Sts.<br /><br />\nEutaw Place and North Ave.<br /><br />\nVernon 0890<br /><br />\nDr. Westel Woodbury Willoughby, Professor of Political<br />\nScience at this university, returned<br />\nGERHARD &amp; REED CO.<br />\nfrom India, where he conducted a<br />\ncourse of 12 lectures at the UniTAILORS<br />\nversity of Calcutta on Fundamen1 1 0 N. EUTAW STREET<br />\ntal Concepts of Public Law. He<br />\n2nd Floor<br />\nwas Tagore Professor of Law at<br />\nthat university. The Tagore professorship is endowed and is occupied by different professors,<br />\nusually foreigners, who are invited<br />\nevery year by the university. As<br />\nDr. Willoughby has spent time in<br />\nall of the British Dominions, he<br />\nwas extremely glad to have had an<br />\nopportunity of visiting India and<br />\nrounding out his personal knowledge of the British- Empire. He<br />\n29 E. BALTIMORE ST.<br />\nwill begin lecturing at this uni- Agents for JOHN B. STETSON<br />\nHATS<br />\nversity on February 1 on the suband FRATERNITY BANDS<br />\nject of Ethical Political Theory.<br />\nThis course is complementary to<br />\none which he gave last year on<br />\nJuristic Political Theory.<br />\nLeaving this country in August,<br />\nDr. Willoughby went to England,<br />\nFrance and<br />\nthence through<br />\nthrough the Suez Canal. He<br />\nstopped in Egypt for three weeks<br />\nbefore continuing to Calcutta. On<br />\nleaving India, he returned to<br />\nAmerica by the same route.<br /><br />\ne<br />\nAbteXatterivy<br />\n41<br />\n,02,-zzLeoH.alloE<br />\n%.<br />\n10<br />\n-54RsR,4<br />\nw sci.cA<br />\n•<br /><br />\nMadison 0405<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br /><br />\n3<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br />\nManufactured by<br /><br />\nWIGHT &amp; HUMPHRIES<br /><br />\nCLOTHES<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD.<br />\nVernon 2355<br />\nR. H. Taylor<br /><br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\ns erve d, and reasonably<br />\npriced—is at<br /><br />\nLIBERTY ST.<br />\nAT SARATOGA<br />\nLUNCHEON<br />\nTEA<br />\nDINNER<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br /><br />\n11.30 A. M.<br />\nuntil<br />\n7.30 P. 1V1<br /><br />\nOf course you know that<br />\nThe Barn is handling orders<br />\nfor our clothes again this<br />\nyear.<br />\nThe plan worked to<br />\nmutual advantage last season, and we're mighty glad<br />\nto continue the relationship.<br />\nReady-to-wear Suits<br />\n$30 up<br />\nReady-to-wear O'Coats . $35 up<br /><br />\n211-213 E. Baltimore St.<br /><br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br /><br />\nNicholas Brown, Mgr.<br /><br />\nSomething Happened in 1891<br /><br />\nInterested in Political Conditions<br /><br />\nDr. Willoughby stopped off in<br />\nEgypt in order to observe politicl condition, his specialty, in<br />\nthat country. While he was in<br />\nEgypt, England lifted her suzerainty, thus making Egypt entire<br />\nsovereign. Before this time it was<br />\nimpossible for anyone to determine the political status of Egypt.<br />\ndeclared<br />\nEngland<br />\nthat<br />\nshe<br />\n(Egypt) was sovereign with the<br />\nexception of certain restrictions<br />\nwhich would eventually be removed. These resstrictions were<br />\nremoved while Dr. Willoughby<br />\nwas in Egypt and England has<br />\nnow only the rights of protecting<br />\nthe Suez Canal and foreign business in the land of the pyramids.<br />\nPolitical Interest in India<br /><br />\nIn India, according to Dr. Willoughby, the English government<br />\nis making an honest attempt to<br />\nslowly introduce responsible government. This is being done with<br />\nthe ultimate of British control<br />\nidentical with that of the Other dominions of Canada, Australia,<br />\nSouth Africa and Ireland. Many<br />\nof the Indians insist that the progress toward Indian autonomy is<br />\ntoo slow and should be more rapid.<br />\nThere is, therefore, a great deal of<br />\ndiscontent which makes England's<br />\ntask of introducing responsible<br />\ngovernment much more difficult.<br />\nPROF. PELLIOT TO LECTURE<br />\nON ARCHAEOLOGY<br />\nProfessor Paul Pelliot, of the<br />\nchair of Chinese Civilization in the<br />\nCollege of France, will deliver four<br />\nlectures, open to the public, in the<br />\nCivil Engineering Hall on February<br />\nthe fifth seventh twelfth and fourteenth, at.5 P. M. Professor Pelliot will lecture on the subject of<br />\nhis archaeological work in Chinese<br />\nTurkestan, where many ancient<br />\nmanuscripts, covered and preserved<br />\nby the invading desert, have been<br />\nreclaimed. The field chosen by Professor Pelliot for his archaeological<br />\nresearch rivals Egypt in its abundance of ancient records, so at this<br />\ntime when Central Asia is assuming archaeological importance, the<br />\narchaeologist's message should be<br />\nintensely interesting.<br /><br />\nWhat<br />\nEngineering<br />\nOwes To<br />\nSound<br />\nPrinciples<br />\nDERITAPS no phase of electrical development is more<br />\nfascinating than the events<br />\nleading up to the practical use of electricity as the motive power for street<br />\nrailway transportation.<br />\nIt is a story of \"midnight oil\", hard thinking, extreme perseverance. No better example of the value<br />\nof sound principles to present day engineering could<br />\nbe cited than the Westinghouse No. 3 Motor, as introduced in 1891.<br />\nIts design was so fundamentally correct and the<br />\ndetails were so soundly worked out that subsequent<br />\ndevelopments of railway motors all followed the principles embodied in it. Now let's see what bearing this<br />\nhas had on modern transportation.<br />\nIn 1700 the first permanently fixed rails made their<br />\nappearance. In 1831, in New York, horse cars began<br />\noperation. In 1834, after fruitless attempts to apply<br />\nsteam, compressed air, gas, etc., to these cars, a<br />\nVermont blacksmith, one Thomas Davenport, sug-<br /><br />\nWestinghouse Motor, No. 3, the Progenitor of the<br />\nPresent Universally-Adopted D.C. Railway Motor.<br /><br />\ngested that electricity be used as the motive power.<br />\nThe very first practical commercial dynamo,built by<br />\nGramme, in 1862, made this suggestion a possibility.<br />\nIt was natural that George Westinghouse, with his<br />\nintense interest in transportation, should take up this<br />\nproblem. From 1889 to 1891, he, with his organization, worked continuously to perfect a commercially<br />\npracticable railway motor, and the famous No. 3,<br />\ndaddy of all street railway motors, was the result.<br />\nAs mentioned before,the principles embodied in the<br />\nNo.3, thirty-two years ago,are still in use, and at least<br />\nten prominent features of this remarkable motor are<br />\nto be found in present-day types. A number of these<br />\nearly motors are still in operation—a tribute to sound<br /><br />\nengineering principles.<br /><br />\nWestinghouse<br />\nACHIEVEMENT 0 OPPORTUNITY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 22, 1924<br />\nNEWS-LETTER REPRODUCES TWO OF DR. GILDERSLEEVE'S<br />\nSONNETS<br /><br />\nAil<br /><br />\nAll<br />\nSizes<br /><br />\nanfordS\"<br /><br />\nI Colors<br /><br />\nFOUliTAINFENINK<br />\nK<br />\n13<br />\nIC1:0<br /><br />\n,3,11<br /><br />\nFor real Fountain Pen Satisfaction<br />\nUse<br /><br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br /><br />\nSANFORDS<br />\nFOUNTAIN PEN INK<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\nLimited<br /><br />\nBARN CAFETERIA<br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nqorimeagatl'4 F4<br /><br />\n/14 11F141F14,i141/14 FREI Flfart4 /.141/1414,/141 01.4!<br /><br />\n,<br />\nT0<br />\n()TOM 0[115<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\nEIRINNTRINIXHIMMEINEENNINigNMEME)<br /><br />\nSHIRTS<br /><br />\nNECKWEAR<br /><br />\nLeFranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nSince the death of Dr. Basil L. Gildersleeve much has been said<br />\nabout the poetry of the departed Greek scholar. Little of his verse<br />\nfound its way to print, but in the last years of his life Dr. Gildersleeve overcame his reluctance to have his verses published and occasionally a local newspaper or a scholar's magazine was fortunate<br />\nenough to obtain permission to print some of \"the last Greek's\" lilting lines. The best known of these, and one of the latest was the<br />\nsonnet on his eighty-eighth birthday. The sonnet was written in 1919,<br />\nfour years before the master's death.<br />\n\"My eyes are dim from age and dull my ears;<br />\nAnd I am left alone to meditate<br />\nUpon the riddles of our mortal state,<br />\nToo sad for laughter, and too deep for tears.<br /><br />\nto<br /><br />\nO one smokes<br />\nMelachrinos<br />\nwithout liking them<br />\n—for their quality<br />\ninstantly wins appreciation.<br /><br />\nN<br /><br />\n\"The wane of intellect, and the weight of years,<br />\nSaid one who knew,'you cannot separate,'<br />\nShall I say yea to this at eighty-eight?<br />\nFor truth is truth, what if it irks, not cheers?<br />\n\"No answer to the question can I find,<br />\nNor will I list to friendship's glowing lips,<br />\nWhich can tell me I am now just what I.was.<br />\nThis constant watching for the wane of mind<br />\nIs it not better than the drear eclipse<br />\nWhen senile meanderin,gs pass for Solon's laws?\"<br /><br />\nNeatly combed, well-kept hair is a<br />\nbusiness and social asset.<br />\nSTACOMB makes the hair stay combed<br />\nin any style you like even after it has<br />\njust been washed.<br />\nSTACOMB—the original—has been<br />\nused for years by stars of stage and<br />\nscreen—leaders of style. Write today<br />\nfor free trial tube.<br /><br />\nTubes-35c<br /><br />\nJars-75c<br /><br />\nInsist on STACOMB—in the black,<br />\nyellow and gold package.<br />\nFor sale at your druggist or wherever<br />\ntoilet goods are sold.<br />\nStandard Laboratories, Inc.<br />\n750 Stanford Avenue Los Angeles, California<br />\nSend coupon for Free Trial Tube.<br />\nSTANDARD LABORATORIES,Inc.<br />\n750 Stanford Are.. Los Angeles, California. Dept. I<br />\nPlease send me free trial tube.<br />\nName<br /><br />\nMELACHRINO<br />\n\"The One Cigarette Sold the World Over\"<br /><br />\nThat a professor of Greek should have written poetry of such<br />\ndepth, and feeling is remarkable, for proficiency in the art only comes<br />\nthrough much practice, even if one has the genius in the first place,<br />\nbut that it was written at the age of eighty-eight is still more remarkable. Dr. Gildersleeve did not stop writing, however, until just<br />\nbefore his death in his ninety-third year. On November 24 last Dr.<br />\nGildersleeve's old friend and companion in arms, Mr. Joseph Packard died and Dr. Gildersleeve wrote the following verse in his honor:<br />\n\"The heart knows its own bitterness, 'tis said<br />\nIts inliest joys no stranger ever knows:<br />\nBut from one source the stream of sorrow flows,<br />\nAnd there's one voice for the mourning of the dead.<br />\nWe weep for those of whom we've only read,<br />\nMourners and mourned may long have found repose,<br />\nAnd yet our hearts are deeply stirred for those<br />\nWho in their day would not be comforted.<br />\nAnd so, dear friend of more than fifty years,<br />\nNoble exemplar of a noble age,<br />\nMy tears for thee call forth another's tears<br />\nFrom the sealed fountain of an old Greek page<br />\nThe sorrows of the world encompass me,<br />\nThe plangent music of griefs sad, salt sea.\"<br /><br />\nAddress<br /><br />\nsid<br />\nun<br /><br />\nilie<br /><br />\nHub<br /><br />\nBaltimore's Great<br />\nMen's Store<br /><br />\nRE<br />\ncol<br /><br />\nBc<br />\non<br />\nab<br />\nwi<br /><br />\nsoi<br /><br />\nN(<br />\nrni<br /><br />\nbe<br />\nthc<br />\nPiz<br />\notl<br /><br />\nco.<br /><br />\nN(<br />\naci<br />\npe<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n411 Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nMUSICAL CLUB MEMBERS CA- ference in pitch between the memThe Greetings of a Fine Store<br />\nbers of each pair. In every case<br />\nPABLE IN PITCH<br />\nthe<br />\nclass<br />\nwas<br />\nrequired<br />\nto<br />\ndecide<br />\nDISCRIMINATION<br />\nTo the Students of a Fine University<br />\nwhether<br />\nthe<br />\nsecond<br />\ntone<br />\nin<br />\neach<br />\nThe Johns Hopkins Musical Club<br />\npair was higher or lower than the<br />\nHOCHSCHILD,KOHN 8c CO.<br />\nreceived a boost when twelve of<br />\nfirst.<br />\nIn each pair there was a difits members in the class in Psycholference of from one-half to thirty<br />\nogy I ranked high in a test in<br />\nvibrations.<br />\npitch discrimination. This test, deClub Members Above Average<br />\nvised by Professor Seashore, of the<br />\nThe class took comfort from the<br />\nUniversity of Iowa, has been given statement of Mr. Isaacs, who had<br />\nto several thousand pupils; and in charge of the test, \"There is no corSpecializes in<br />\nthat way \"percental , groupings\" relation between pitch discriminahave been worked out. For ex- tion and intelligence.\" And the few<br />\nample, anyone receiving from 88 Musical Club members in the class<br />\n—the kind that is being sought<br />\nper cent to 100 per cent correct who did not rank so high took comby the exacting college man.<br />\njudgments, ranks among the best fort in hearing that pitch discrim10 per cent. The results of the test ination is not the ultimate factor in<br />\nare given below: The first column, determining musical ability, since<br />\nincluding the returns for the entire some of the rhythm and time and<br />\nclass, the second column for Music- other points must be considered.<br />\nal Club members only.<br />\nHowever, it is a good advertisement<br />\nRENT A CAR<br />\nMusical for the disturbers of the Thursday<br />\nClub night calm that their fellows did<br />\nClass<br />\n4 a shade better than the ordinary run<br />\n19<br />\nBest 10%<br />\nof mortals.<br />\n4<br />\n11<br />\nNext 20%<br />\nDODGES, 18c PER MILE<br />\nFORDS, 12c PER MILE<br />\n3<br />\n5<br />\nNext 40%<br />\n\"I had a nice chat with your<br />\n1<br />\n11<br />\nSpecial Reduced Rates for 50 Miles or More<br />\nNext 20%<br />\nwife in bed this morning.\"<br />\n0<br />\n7<br />\nLast 10%<br />\n\"What?\"<br /><br />\nDistinctive Furnishings<br /><br />\nHUTZLER BFCffliElt<br /><br />\nDRIVE IT YOURSELF<br /><br />\nof<br /><br />\nth(<br />\nica<br /><br />\nLa<br /><br />\nDr. Gildersleeve was speaking of Calmachus' poem to Heraclitus<br />\nwhen he spoke of \"an old Greek page,\" and he added to his original FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nverse a transfusion of that poem, translated by himself, to Mr. Pack343 NORTH CHARLES STREET<br />\nard.<br />\nThis is the last poem that Dr. Gildersleeve is known to have<br />\nALWAYS USE A<br />\nwritten. Unfortunately his verses have never been collected, and<br />\nROBBIN'S STYLE BUILT HATS<br />\nYELLOW CAB<br />\nthose which were printed are scattered in various places. However,<br />\nOR PHONE<br />\nFOR YOUNG MEN<br />\nthere has been some talk that Sigma Upsilon intends to collect the<br />\nand<br />\nthem<br />\nin<br />\ninclude<br />\ntheir collection<br />\npoems of Hopkins' great master<br />\nVERNON 1212<br />\n122 W. BALTIMORE ST.<br />\nof Baltimore authors, now in preparation by the fraternity.<br />\nHAIL THEM ANYWHERE<br /><br />\nThe test consists of striking one \"Telephonically speaking,<br />\nhundred pairs of tones, with a dif- course.\"—Virginia Reel.<br /><br />\nto<br /><br />\nORIGINAL<br /><br />\nOUR MEN'S SHOP<br /><br />\nr)<br />\nUnruly 1air<br /><br />\nJai<br />\non<br />\nnig<br />\nfie(<br /><br />\nwi:<br />\nsrn<br /><br />\nURNER BROTHERS<br />\n1 1 1 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nMi<br /><br />\nDRIVE IT YOURSELF CO.<br /><br />\n1725 NORTH CHARLES ST.<br /><br />\nVERNON 4049<br /><br />\nof<br />\nGc<br />\nPe<br />\ntu<br />\nbe<br />\nab<br />\nCl<br />\nBc<br /><br />\ntw<br /><br />\nin;<br />\nFi<br />\not<br /><br />\nth,<br /><br />\nT1<br />\n'ii,<br />\nof<br /><br />\nr]<br /><br />\nwi<br />\nse<br />\nPr<br />\nkr<br />\nPr<br />\nca<br />\nPa<br /><br />\nSt<br />\nPr<br />\nis<br /><br />\nat<br /><br />\not:<br /><br />\nse<br />\nta<br /><br />\nea<br />\nS<br /><br />\nIV<br /><br />"}], "field_media_file": [{"target_id": 37821, "display": null, "description": null, "target_type": "file", "target_uuid": "222dd008-c978-4fee-999a-0b46177b1f7b", "url": "http://digital.library.jhu.edu/system/files/2022-03/13101-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13101, "target_type": "node", "target_uuid": "fefbbe44-6d88-4885-9d69-9ea833ef5de2", "url": "/node/13101"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c846d772-0b8d-46a0-af83-9da228a5e3c5"}]}