{"mid": [{"value": 37951}], "uuid": [{"value": "9da9a3da-764b-4181-85d7-766860695f43"}], "vid": [{"value": 37951}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:44:02+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12519-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:44:02+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:44:02+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "3<br />\n<br />\nMEMBER OF THE<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\n<br />\n3Joints iqopkins 'Nrwri-Ertter<br />\n<br />\nOf Middle Atlantic States<br />\n<br />\nTRIBUTES TO<br />\nDR. WILLIAM H. WELCH<br />\nSee Page 2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, MAY 4, 1934.<br />\n<br />\nVol. XXXVIII—No. 48<br />\n<br />\nChemistry<br />\nConference<br />\nMeets Today<br />\n<br />\nGOING TO<br />\nThe Time-Honored<br />\nCry Assumes A<br />\nNeu. Meaning<br />\n<br />\n\"PRESS\"<br />\n<br />\nTwenty-Eight Attend Assembly;<br />\nCompulsory Ruling Readopted<br />\nScoring optional assemblies as<br />\nabsolute failures, Edward Sadtler,<br />\npresident of the Student Council,<br />\nannounced yesterday that next<br />\nweek's assembly, to be devoted to<br />\nthe public initiation of 0. D. K.<br />\nwith Carlyle Barton as guest speaker, will be compulsory.<br />\nBecause he feared a poor attendance, Sadtler cancelled yesterday's<br />\nassembly, which was to feature an<br />\naddress by the Hon. William E.<br />\nSweet, former governor of Colorado, on the \"New Deal.\"<br />\n<br />\nclasses in the affairs of the University, he believed that only<br />\nthrough assemblies could such an<br />\ninterest be revived.<br />\n\"If the students do not take advantage of this weekly opportunity<br />\nto keep in touch with affairs on the<br />\ncampus, the next step is to compel<br />\nthem to come,\" he declared.<br />\n<br />\nPrice, 5 Cents<br />\n<br />\nCHIEF BEER<br />\nTo Lead Attack On<br />\nAle and Pretzels<br />\nTomorrow Eve<br />\n<br />\nGUZZLER<br />\n<br />\nMusical Club<br />\nTaps Frailey,<br />\nEigenbrode<br />\n<br />\nTWO NEWS-LETTER reporters<br />\nwere wearily perambulating down<br />\nGain Respective Positions Of<br />\nFifth Meeting Of Founders the boardwalk from Gilman at 10<br />\nPresident And Business<br />\nOf Fellowship Plan Fea- p. m. last Tuesday, when one of<br />\nManager Of Organization<br />\ntures Langmuir Address them, ever alert in true NEWS-LETTER fashion, espied a light in the<br />\npaper's office.<br />\nNominations Next Week<br />\n\"That's strange,\" quoth he in<br />\nAfter<br />\nnext week's compulsory<br />\ntrue journalese, \"the paper should<br />\nHatfield, Murphy, Reuling,<br />\nthere will be nominations<br />\nassembly,<br />\nFirst Presentation Of Avoga- have been put to bed long before<br />\nthe<br />\npresident<br />\nof<br />\nof<br />\noffice<br />\nfor<br />\nthe<br />\nAnd Cannon Also Secure<br />\ndro Medal Scheduled As thi eery hour. I wonder why the<br />\nimportant<br />\nthis<br />\nAs<br />\nCouncil.<br />\nStudent<br />\nOffices At Annual Election<br />\nlights are still on?\"<br />\nClimax To Proceedings<br />\nof the<br />\nvote<br />\nthe<br />\nelected<br />\nby<br />\nofficer<br />\nis<br />\nOnly<br />\nTwenty-eight<br />\nAttend<br />\nAnd in spite of the admonition of<br />\nCarson G. Frailey and Daniel<br />\nBefore an assembly of only 28 entire undergraduate school, Sadtler<br />\nhis less adventurous companion that<br />\nEigenbrode<br />\nwere elected presiAn address by Dr. Irving Lang- perhaps Dillinger was<br />\nimutmost<br />\nlurking in the students, Sadtler outlined his rea- announced that it is of<br />\ndent<br />\nand<br />\nbusiness<br />\nmanager, rechemistry<br />\nLaureate<br />\nin<br />\nbe<br />\nmuir, Nobel<br />\noffice, this hardy soul succeeded in son for changing the order which portance for the students to<br />\nClub<br />\nspectively,<br />\nof<br />\nthe<br />\nMusical<br />\nfor 1932, will feature the fifth an- gaining the window by working his was instituted two weeks ago. Be- present in order to hear the discusfor<br />\nthe<br />\nannual<br />\nthe<br />\nyear<br />\n1934-35<br />\nat<br />\nnual conference of Founders of way forward on all fours. Then, cause of the lack of interest shown sion of the responsibilities attached<br />\nelection of the organization held<br />\nto this office.<br />\nthe Johns Hopkins National Fel- with reckless abandon, he raised by the sophomore and freshman<br />\nlast night at the Gray Goose Inn.<br />\nhimself up to his full stature, peered<br />\nlowship Plan, which will convene<br />\nMEADE JOHNSON<br />\nFrailey succeeds Norman S.<br />\nin through the window and saw—a<br />\ntoday.<br />\nHopkins<br />\nHeaney, while Eigenrode replaces<br />\nat the<br />\ngirl in the close company of a<br />\nAl Hunt.<br />\nThe complete schedule of events rather prominent member of the<br />\nVice-presidents for the new<br />\neditorial staff.<br />\nfor the conference is:<br />\nyear are Edward Hatfield, Jr., and<br />\nThe two reporters will say no<br />\n10:00 A. M. Meeting in the office<br />\nJohn L. V. Murphy. Bert G. Canmore<br />\nof the incident. They value Fifteen-Line Inscription Is Popular Pennsylvania Players<br />\nof President Joseph S. Ames.<br />\ntheir jobs too much!<br />\nWill Be Featured At June Al Mason To Supply Music non and Louis E. Reuling were<br />\nFound Proclaiming Alli10:30 A. M. Visit to the research<br />\nappointed junior business manWeek Affair, June 7<br />\nFor Affair At Barn; Festiv- agers.<br />\nance of Philip, Olynthians<br />\nlaboratories, Remsen Hall.<br />\nThose elected to the business<br />\nities Begin At 9 O'clock<br />\n12:00 A. M. Luncheon for the<br />\nUnder the direction of Dr. David<br />\nJimmy DeAngelis and \"his 14<br />\nstaff<br />\ninclude James Beck, John<br />\nchemand<br />\nfounders, faculty<br />\nM. Robinson, professor of archae- pieces of rhythm\" have been seFree beer and music furnished by<br />\nCanning,<br />\nBrian Murphy, Paul<br />\nistry students. Levering Hall.<br />\nology and Egyptology, American lected for the Junior Prom which Al Mason's Orchestra will be the<br />\nUmbarger<br />\nand<br />\nRobert Watkins.<br />\n2:00 P. M. Conference on special<br />\nexcavators who are unccvering the will be held on the evening of June featured attraction at the First AnHenry Fensterwald was named<br />\nphases of the National Fellow- Dr. J. C. Merriam Speaks ancient city of Olynthus, have at 7 in the main ball room of the Al- nual Sophomore Beer Bender to be<br />\nship Plan. Levering Hall.<br />\nheld tomorrow night at the Barn leader of the Blacy and Blue Jay<br />\nOn 'Relation Between Art last been rewarded in their long cazar.<br />\nOrchestra to succeed Richard<br />\nsearch for inscriptions and public<br />\na. m.<br />\n4:00 P. M. Lecture, Dr. Irving<br />\nThis band plays regularly at the from 9 p. m. to 1<br />\nAnd Science In Education' buildings.<br />\nTickets are $1.00, \"stag or drag\", Barger.<br />\nLangmuir, Nobel Laureate in<br />\nHershey Ball Room in Hershey,<br />\nConstitution Is Amended<br />\nThey have discovered an inscripany memChemistry. Remsen, 101.<br />\nThat science cannot get along<br />\nPennsylvania, and was recently fea- and can be secured from<br />\nAn amendment was made to<br />\n7:00 P. M. Dinner in honor of the without' art, and art cannot get tion fifteen lines in length proclaim- tured at.a ball given by the senior ber of the committee, composed of the constitution of the organizafounders. Baltimore Country along without science is a truth ing the alliance of Philip with the class of the Virginia Polytechnic Lou Reuling, Bert Cannon, Jerry tion which will allow the selection<br />\nBloom, and John Magill, or from<br />\nClub, Roland Park.<br />\nWhich must be understood if men Olynthians. This find corroborates Institute.<br />\nof an unlimited number of sophoa<br />\nfact<br />\nlong<br />\nknown<br />\nto<br />\nhistorians<br />\nclass officers, Meade Johnson,<br />\nthe<br />\nThe prom is one of the main<br />\n8:00 P. M. Presentation of the are to attain a higher appreciation<br />\nmores to the business staff infrom an account of Olynthus given<br />\nLeCmevents of this year's June Week, Bill Lippman, Abe Edelman,<br />\nAvogadro medal by Dr. of the world about them, was the<br />\nstead of three as has been the case<br />\nthesis of the address on \"The Re- by Diodorus. They also found the which will be held from June 6 to ard Emmart and Jonas Cohen.<br />\nLangmuir.<br />\nin former years.<br />\nIs Unique Affair<br />\nlation Between Art and Science in public stores and the arsenal.<br />\n9, inclusive. The week's activities<br />\nFrailey, recently elected presiPlan Started In 1929<br />\nRecover More Mosaics<br />\nThe Beer Bender, the first social<br />\nEducation\" delivered by Dr. John<br />\nwill be opened on Wednesday evedent<br />\nof the \"Y,\" is a member of<br />\nApparently Olynthus once sufThe National Fellowship Plan, C. Merriam at the annual initiation<br />\nning, June 6, with the Senior Ban- event of its kind in more than four 0. D. K. and has been appointed<br />\nstarted in 1929, \"involves the se- ceremonies of Phi Beta Kappa last fered from a severe epidemic, and<br />\nUniquet at the Baltimore Country Club. years, is expected to become a<br />\nmanager of the 1934-35 football<br />\nthirty victims of the strange malady<br />\nlection and training of chemists Wednesday evening.<br />\ntradition.<br />\nversity<br />\nNight Club Party To Follow<br />\nteam.<br />\n(Continued on Page 3, Col. 3)<br />\nwho are fitted to contribute to<br />\nJohnson, sophomore class presiDr. Merriam, a distinguished<br />\nThe Banquet is to be followed<br />\nfundamental chemical progress, paleontologist, is the president of<br />\nexplained that the class offident,<br />\nimmediately by the Night Club<br />\nstaff and equipment necessary to the Carnegie Institution in Washto give the affair for<br />\ndecided<br />\ncers<br />\nParty at which time copies of the<br />\noffer thorough training in chem- ington. He is also a former chairFirst, the informal<br />\nreasons.<br />\ntwo<br />\nBlue Black Mail will be distributed.<br />\nistry and adequate apparatus to man of the National Research<br />\nentertaintainment,<br />\nit is hoped, will<br />\nThe Mail is the annual senior class<br />\nophomores<br />\nenable students to undertake the Council and a member of numerous<br />\nhe<br />\namong<br />\n\"scandal sheet\", distinguished by its create<br />\ninvestigation of problems of re- scientific academies.<br />\nof confeeling<br />\nlow moral standard and embarras- themselves a closer<br />\nMelvin C. Cabler, a senior in the<br />\nsearch.\" Fellowships are pro\"Art Necessary To Science\"<br />\nSponsored by the Electrical Club sing revelations about class mem- geniality and friendship and better School of Engineering, was awardvided by leading individuals and<br />\ncooperative class spirit. Secondly,<br />\nDefining science as \"that attitude and the American Society of Civil bers.<br />\ned first prize for the best paper<br />\ncorporations throughout t h e of mind which secures facts, and Engineers, a dance or the Engian<br />\nenthusiastic turnout of sophoOn Thursday, Class Day will be<br />\npresented to the convention of the<br />\nUnited States.<br />\norganizes and relates them in order neering Schools will be presented herd at the L'Hirondelle Club, in mores will produce a surplus in the student branch of the<br />\nAmerican InThe Avogadro medal is given to learn the real nature of man and at Levering Hall tomorrow night, Ruxton. The following day will be treasury that will permit a great restitute<br />\nof<br />\nElectrical<br />\nEngineers,<br />\nheld<br />\nyearly to that graduate student or the world,\" and art \"as the way of at 9 p. m.<br />\nspent at the Annapolis Roads Club, duction in senior class dues.<br />\nat Princeton University last Mongraduate of the Hopkins whose thinking about those things which<br />\nJohnson urged that the class \"as<br />\nThe sponsors of this dance have where the annual Regatta is to be<br />\nday. The subject of Cabler's paper<br />\nresearches in the field of chem- science analyzes,\" the speaker de- combined with the Cotillion Board held. The week will be brought to a whole support this function with<br />\nwas \"Copper Oxide Rectifiers.\"<br />\nistry are deemed worthy of espe- clared that science cannot attain its in presenting Bubby Johnson and a close with the Senior Ball, to be their fullest possible attendance.\"<br />\nJ. J. Bockman, of the University<br />\ncial honors. A committee headed highest level without the assistance his orchestra.<br />\nheld Saturday evening, June 9, in<br />\nof Pennsylvania, was the recipient<br />\nby Dr. Langmuir, and consisting of art.<br />\nTickets can be secured from the the grand ball room of the Alcazar.<br />\nof the second award.<br />\nof Dr. J. C. W. Frazer, professor<br />\nIt is not enough merely to secure members of the sponsoring organi- The dance will feature Jan Garber<br />\nA group of 15 seniors, accompanof chemistry, and Dr. K. F. Herz(Continued on Page 3, Col. 1)<br />\nzation for 80 cents a couple.<br />\nand his orchestra.<br />\nied by 'Dr. J. H. Lampe, made up<br />\nfeld, professor of physics, will reMarking his half-year anniver- the first delegation the Hopkins has<br />\nview work submitted by all applisary as a broadcaster, Hyman Le- ever sent to this convention. Other<br />\ncants.<br />\nvin, former editor-in-chief of the institutions represented were Drex•<br />\n•<br />\nSaturday night el, Haverford, Lafayette, PennsylLife Story Succession Of TriPioneer Work Actuates Writ- NEWS-LETTER, last<br />\nAn Editorial<br />\nconcluded his 26-week series of vania, Princeton,<br />\ner To Call Him 'Leaven quarter-hour reviews of the college Besides the and Swarthmore.<br />\numphs — Raised Medicine<br />\npresentation<br />\nOf American Medicine' news of the week over WCBM. pers, the meeting included of paTo An Expanding Science Many of us were not fortunate<br />\ninspecthat<br />\nof<br />\nLast<br />\nweek's<br />\nprogram<br />\nand<br />\ntion<br />\ntrips<br />\nto<br />\nthe<br />\nA number of Hopkins students<br />\nLawrenceville<br />\nBy<br />\nEDGAR<br />\nKEMLER<br />\nenough to now him personally.<br />\nBy JOHN G. LYMAN<br />\nWill take prominent roles in a bill<br />\nYet the very thought that we The memory of Dr. William H. Welch, the previous Saturday both were Transatlantic Wireless Telephone<br />\nof three one-act plays to be pre- \"The dean of American medicine is were in any way connected with according to all indications, will most sent from Baltimore over the Gen- station and to the Walker Gordon<br />\ndead, but will live long in the chronicles<br />\ncertainly encounter the height of eral Broadcasting System, the new dairy plant, where the famous \"rosented by the newly formed Har of<br />\nscience and philanthropy.\" Thus did that University of which Dr.\"Wil- saintly regions. His material accomAtlantic seaboard chain.<br />\ntolocator\" is located.<br />\nPlayshop,<br />\non<br />\nSunday<br />\nSinai<br />\nnight at the New York Times write of Dr. Wil- liam H. Welch was an integral,<br />\nplishments are evidence enough, and<br />\n8:15 p. m., in the Vestry Rooms of liam H. Welch, for fifty years the guid- pulsating part and to whose Med- further, as Dr. Simon Flexner once said,<br />\ning genius of medical research and teachliar Sinai Temple.<br />\nical School he devoted and dedi- \"there is no human being in this country Frats Make Nominations McCollum Given Medal<br />\ning in this country and the man who<br />\nwho is not his debtor, many millions<br />\nThe group, devoted to the study<br />\nDespite the fact that three sus\"raised medicine in the United States cated the greater portion of his<br />\nDr. E. V. McCollum, professor<br />\nand production of liberal and soci- from a beneficent art to an expanding life suffices to awake within us more than have ever heard his name.\"<br />\nFar too much has he done for the health pended fraternities have not as yet of biochemistry at the Johns Hopological plays, has chosen Elmer science.\"<br />\nan undeniable feeling of pride in and happiness of mankind to live on in paid their assessments and been kins School of<br />\nHygiene and Public<br />\nGreensfelder's \"Swing Low\", an Dr. Welch's force of mind and innate his accomplishments and of de- mere mortal form. Americans are too<br />\nInIterfraternity<br />\nthe<br />\nreinstated,<br />\nHealth,<br />\nwas<br />\nawarded<br />\na gold medal<br />\nanti-lynch play; Theodore Dreiser's ability were noticeable characteristics termination to do whatever lies greatly concerned over their personal<br />\non<br />\nBoard<br />\nmeeting<br />\nMonday,<br />\nheld<br />\na<br />\nby<br />\nthe<br />\nAmerican<br />\nInstitute<br />\nof the<br />\n\"The Girl in the Coffin,\" a play during his early youth, but it was not within our power to emulate his welfare to even completely forget one of April 30,<br />\nnominations<br />\nfor<br />\nwhich<br />\nat<br />\nuntil his college days that they made him<br />\nCity<br />\nof<br />\nNew<br />\nYork<br />\nin<br />\nrecognition<br />\nthe most outstanding of their material<br />\nPortraying the struggles of a labor stand out, when he received his bachelor monumental example.<br />\nthe coming election of officers were for his work in the field of nutribenefactors<br />\nleader in a Northern textile strike; of arts degree at Yale in 1870, being secAnd yet it is not so much the<br />\nDr. Welch's position in that history of made.<br />\ntional research.<br />\nand Alter Brody's \"Rapunzel,\" a ond scholastically, in a class of 150. At intelligence of this universal ben- medicine, to which he was so thoroughly<br />\nNominations for president inPresentation of the medal took<br />\nPoetic description of tenement life first he intended to make the classics his efactor which we would extol at devoted, must be fairly unique. Unlike<br />\ncluded Stanley Clark, Roland Mer- place at a dinner held at the Amercareer,<br />\nbut<br />\nat<br />\nthe<br />\nend<br />\nof<br />\na<br />\nyear<br />\nof<br />\nthe names of Pasteur, Koch, Ehrlich, or<br />\nin New York.<br />\nteaching Latin and Greek he changed his this time—each chapter of the Noguchi, which are attached to the more son, and Bayard Williams. Only ican Museum of Natural History in<br />\nThe plays will be followed by mind. Indeed, his real \"profession was book of his life recorded a new,<br />\nobvious pedestals, the name Welch does one man, Richter Wiggall, was New York last night. This marks<br />\ndancing, with music by the South- arranged long before he had imagined it,\" far-reaching triumph in the field not stand for any single discovery, nor named for the position of secretary- the fifth occasion on which<br />\nDr. Mcerners.<br />\n(Continued on Page 2, Col. 2)<br />\n(Continued on Page 2, Col. 1)<br />\n(Continued on Page 2, Col. 6)<br />\ntreasurer.<br />\nCollum has been similarly honored.<br />\n<br />\nPlan Started In 1929<br />\n<br />\nBanquet Last Night<br />\n<br />\nDr.D.Robinson DeAngelisBand<br />\nAnnouncesFind At Junior Prom Sophs Sponsor<br />\nUnique Event<br />\n<br />\nPhi Beta Hears<br />\nNoted Scientist<br />\n<br />\nM. Cabler, Engineer,<br />\nSecures First Prize<br />\nIn A. E. E. Contest<br />\n<br />\nTo Give Dance<br />\nTomorrow Nite<br />\nFor Engineers<br />\n<br />\nLevin Ends Series<br />\nOf Air Broadcast<br />\n<br />\nDR.WELCH...DEAN OF MEDICINE AND MEN<br />\n<br />\nHopkins Students<br />\nPlay At Temple<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., MAY 4, 1934.<br />\n<br />\n2<br />\n<br />\n\"So, friends and colleagues, we launch our bark upon the Patapsco, and send it forth to unknown seas. May its course<br />\nbe guided by looking to the heavens, and the voyage promote the glory of God and the good of mankind.\"<br />\n—DANIEL COIT GILMAN, from his inaugural address, February 22, 1876.<br />\n<br />\nEditorials<br />\n<br />\nZbe 1news4setter<br />\nFOUNDED 1897<br />\n<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n________<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nRemit subscription fees to John Myers,<br />\ntreasurer, Student Activities Council, Gilman<br />\nHall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3,<br />\n1909, at the Postoffice in Baltimore, Md., under<br />\nthe Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June,<br />\nexcept during examination and college holiday<br />\nperiods by undergraduates of the Johns Hopkins University.<br />\n<br />\n:Features<br />\n<br />\nHopkins Mourns Passing Of Dr. Welch<br />\n<br />\nRe<br />\n<br />\nLife Story Colleagues Pay<br />\nTributes<br />\nSuccession High<br />\nTo His Memory<br />\nOf Triumphs \"Great Scientist\"<br />\n<br />\nWas Leaven<br />\nOf Medicine<br />\nIn America<br />\n<br />\nDR. HOWARD A. KELLY,<br />\nEDITORIAL DEPARTMENT<br />\n(Continued from Page 1, Col. 4)<br />\n(Continued from Page 1, Col. 2)<br />\nStanley E. Blumberg__Editor-in-Chief<br />\nthe last survivor of \"The Big Four<br />\neven<br />\nany homogeneous series of refor he had been born at Norfolk, ConRichard Feise, Melvin Goldberg,<br />\nHopkins:<br />\nsearches. It is true that he isolated the<br />\nManaging Editors necticut, on April 8, 1850, the son of a at the Johns<br />\n\"Profound sorrow upon learning<br />\nLeonard WallensteinSports Editor doctor, with four uncles and his grandorganism causing gas gangrene, and<br />\nIrving Leberfeld,<br />\nmade other fine contributions to the scilongtime,<br />\nof<br />\nmy<br />\ndeparture<br />\nthe<br />\nof<br />\nExchange and Filing Editor father also members of the profession.<br />\nence of pathology—discoveries bearing<br />\nThus<br />\nthe<br />\nhe<br />\ncolleague,<br />\nturned<br />\nhis<br />\nfriend<br />\nand<br />\nsteps<br />\nbeloved<br />\ntoward<br />\nmediBUSINESS DEPARTMENT<br />\non malaria, dysentery, rickets, diabetes,<br />\nBusiness Manager cine, entering the College of Physicians dean of the American Medical proRay Goldberg<br />\ndiphtheria, etc. Yet when President<br />\nand<br />\nSurgeons,<br />\nColumbia University. fession as well as one of the great.<br />\nBert Gordon_Advertising Manager<br />\nHoover and the cream of the world's<br />\nOffice Manager There the trifling incident of winning a<br />\nCharles Hastings<br />\nCirculation Manager microscope as a prize convinced him that est scientists our country has ever<br />\nDavid Levy<br />\ngreat scientific societies greeted him<br />\nfour years ago on his eightieth birthday,<br />\nhis life's work lay in the field ,of research. produced. His love for his fellows<br />\nFriday, May 4, 1934<br />\nthese achievements were not the essential<br />\nImmediately he formed the resolution to was one of his Most outstanding<br />\nprods for that superb offering. We must<br />\nbecome a pathologist instead of a prac- characteristics.\"<br />\nDr. Welch — Dean Of<br />\nlook elsewhere for them.<br />\nticing physician—and it was the begin* * *<br />\nMedicine And Men<br />\nDr. Welch,.during the nineties of the<br />\nning of a great career.<br />\n(Continued from Page 1, Col. 3)<br />\n\"Leader Of Men!,<br />\nlast century, turned about from his micDR. JOSEPH S. AMES, presiof medicine and served to advance<br />\nroscope (it had been the award of a<br />\nUpon<br />\nof the Johns Hopkins Univer_<br />\ndent<br />\nmicroscope from the New York College<br />\ncompleting<br />\nhis<br />\nundergraduate<br />\nscience one step nearer- its ultiof<br />\nmedical<br />\nstudies<br />\nand<br />\nPhysicians and Surgeons which in his<br />\nreceiving<br />\nhis<br />\ndegree<br />\nsity<br />\n:<br />\nmate goal. Rather, we wish to<br />\nin medicine at Columbia in 1875, he spent \"The death of Dr. Welch offers<br />\nyouth had determined his career) and<br />\npay even greater homage to the some time as interne in New<br />\nventured forth into the weedy field of<br />\nYork and<br />\nessential, eternal spirit of the man, then went abroad to study. One of his a sad opportunity to recall to the<br />\npublic health. Possessing, as we have<br />\never-present in everything to teachers in Europe was Pasteur, the minds of all students and friends of<br />\nalready seen, an eminent position on the<br />\nfront of medical investigation, and at the<br />\nwhich he turned his fertile mind— French microbe hunter; and another was the Johns Hopkins University what<br />\nsame time naturally endowed with a<br />\na spirit which prompted him to Koch, the tuberculosis germ's discoverer, a great service he did continuously<br />\nwhom he saw demonstrate in Cohn's for fifty years, and what a leader<br />\nquiet, effectual personality, Dr. Welch<br />\nsum up his own all-conquering botanical<br />\nwas admirably designed for the task. A<br />\nlaboratory his discovery of the of men and movements he was, not<br />\nand significant career in the fol- anthrax bacilli and its' obrollary, the<br />\nmember of the State Board of Health,<br />\nlowing manner: \"I have been proof that bacteria could cause disease. only in the University, but also in<br />\npresident from 1898 to 1922, he forged<br />\nnew lines of activity at a time when orlucky. I didn't realize that path- He also studied under Hebra in derma- the whole country. Few men have<br />\ntology,<br />\nunder<br />\nboth<br />\nUniversity<br />\nlife<br />\nand<br />\nMeynert<br />\ninfluenced<br />\nganized<br />\nin<br />\nneurology<br />\neffort in that realm was both<br />\nand<br />\nology would become as important<br />\nhalting and limited. And it was those<br />\npsychiatry, and under Wagner in prac- the life of the community as much<br />\nas it has proved. I simply liked tical medicine<br />\nand pathological anatomy.<br />\nexperimental steps in the Maryland Free<br />\nit.\" To think that a mere pleas- He watched Lister, the founder of anti- as he. He was keenly interested in<br />\nState, which even today influence the<br />\n—Courtesy Sun papers.<br />\nant occupation to this enterpris- septic surgery, at work in his LOndon all sides of life and brought to evhealth of all the various states of the<br />\nDR. WILLIAM HENRY WELCH<br />\ncountry. Even further, his influence exing young scholar developed into clinic, besides studying at one time or ery problem an original mind and<br />\ntended itself in the inspiration of Walter<br />\na science, the effect of which upon another under Chiari, the Viennese path- serious study. He was an adviser<br />\n\"It was the lovable qualities in the greatest boons to the American Reed and James Carroll to expose their<br />\nologist, Waldeyer, Bauman, von Reck- of students, research workers, and<br />\nmillions of Americans is incallinghausen, Ehrlich, and Flugge.<br />\nWelch and in Osler that unified the people, especially to the people of lives in the effort to combat the menace<br />\nculable, makes us marvel at his But after studying at Strasbourg and benevolent corporations. No man<br />\nof yellow fever.<br />\nmedical profession of Maryland.\" the Southern continent.\" \"<br />\nunselfish<br />\nthan<br />\nhe<br />\nand<br />\ncould<br />\nbe<br />\nmore<br />\nindividuality all the more.<br />\nLeipzig, he abandoned his original in4<br />\n!<br />\n*<br />\nPublic health has become, of late, sub*<br />\n* * *<br />\ntention of working with the great Berlin no one's judgment was wiser.<br />\nject to a sort of passive acceptance as an<br />\n\"He was delightful as a comrade<br />\n\"Foremost Citizen\"<br />\n\"Human And Humane), institution very much as eternal and everFor, even if he were to be master of pathology, Virchow, and followed the advice of his teacher, Ludwig, and friend, owing to his universal<br />\nDR. J. M. T.'FINNEY, SR.,<br />\nDEAN E. W. BERRY, College with-us as the weather—it has become<br />\nstripped of all other of his count- going to the University of Breslau.<br />\ninterest and his lack of thought of president of the Maryland Medical of Arts and Sciences:<br />\nsuch an integral part of our culture as<br />\nless merits, there would always There he worked with the brilliant young<br />\nself. He will be remembered by and Chirurgical Faculty:<br />\n\"I like to think of Dr. Welch as to be almost completely unnoticed. Forremain to him that benevolent and experimental pathologist, Cohnheim,<br />\ncountless people, each of whom<br />\n\"In the passing of Dr. William one of the greatest of Americans, gotten are those long dusty centuries of<br />\nOlympian personality .w h ich around whom were gathered a group of<br />\nfilth and pestilence which started with<br />\nprobably owes him a debt of grati_ Henry • Welch, the science of med- not because of his admittedly great<br />\nthe<br />\nbeginning of human aggregates and<br />\ncaused others in all walks of life men who later became highly distin* * *<br />\ntude.\"<br />\nguished.<br />\nicine in America has lost its most contributions to medical research loathfully threatened the cleanliness of<br />\nhearts<br />\n-as<br />\nin<br />\ntheir<br />\nto enshrine him<br />\nillustrious exemplar. His loss will and teaching, but because of his our own twentieth. All that time, men<br />\n\"Progressive Influence\",<br />\none of them. To the poor man<br />\nJOSEPH<br />\nCOLT<br />\nDR.<br />\nBLOODbe felt not alone in this country, for humaneness and humanity, and be had become so much accustomed to the<br />\nDaniel Coit Gilman, the first president<br />\nwhose existence and happiness he<br />\nof the Johns Hopkins University, had GOOD, adjunct professor of sur- his reputation for scholarship and cause of the full life he led, which presence of putrefaction that they were<br />\ndirectly affected he must have gone to Europe in search of a master of<br />\npractically callous to it and only had a<br />\ngery at the Hopkins, who was as- learning was world_wide.<br />\nBalti- was appropriately crowned with dim<br />\ncognizance of its presence when half<br />\nbreathed forth the final refreshing the new medicine to serve as a keystone<br />\nsociated with Dr. Welch since May, more has lost her foremost citizen. honors of all kinds. I doubt if any the community would be swept away.<br />\naroma of a rapidly putrefying so- of the Hopkins medical faculty, then in<br />\n1892:<br />\nThe Johns Hopkins Hospital and, man of his generation had so many What men like Dr. Welch have accomcial order. The connoisseurs of the process of organization. Cohnheim<br />\n\"He was the greatest influence of Medical School, of which from their friends, or deserved them as much plished within the last fifty years in alasked<br />\nhim<br />\nwhy<br />\nhe<br />\nlooked<br />\nin<br />\nEurope,<br />\nthe fine arts and the sciences<br />\npointing out the rising young New Eng- any single individual toward tre_ earliest beginnings he has been the as did Dr. Welch, and I am happy most completely reversing the condition,<br />\nwhile constantly feting him could lander for the position. Thus in<br />\nyou can only appreciate when you visit<br />\n1884 mendous upward progress in this driving spirit, will sorely miss his to be numbered among them.\"<br />\nsuch havens as the Arabs infest in northtake just pride in the fact that he Dr. Welch, then 34 years old, came to<br />\n* * *<br />\ncountry in medical education, and in wise counsel. It will be difficult to<br />\nern Africa and when you sniff the squalid<br />\nsymbolied the glorious outcome Baltimore and to the Hopkins as Baxley<br />\nmedical research he was the out- think of Johns Hopkins without Dr.<br />\n)!<br />\n'streets<br />\nof New York's lower East Side.<br />\nHeart<br />\n\"Kindly<br />\nprofessor<br />\nof<br />\npathology.<br />\nof their secret dreams and matestanding<br />\nconsultant<br />\nin<br />\nall<br />\nmedical<br />\nWelch.<br />\nHe<br />\nwas<br />\n,<br />\nthe<br />\nJohns<br />\nHopDR. JOHN C. FRENCH, LiThe trustees of the University had inrial assistance.<br />\nkins. The great hosts of his for- brarian of the Johns Hopkins Uni_<br />\nvited plans for the development of the problems in this country.<br />\nBut of all the ingredients of Dr.<br />\nHis brother scholars, many of medical school; and<br />\n\"The sooner the people of this mer pupils will carry the image of versity:<br />\nit was Dr. Welch's<br />\nWelch's popular acclaim, I believe the<br />\nwhom achieved prominence in plan, charting the course which was to country realize this they will<br />\nplace their old master forever deeply<br />\n\"Although Dr. Welch was more most important is that which grants tillll<br />\ntheir respective fields only less revolutionize medical education in this in Washington a suitable monument graven<br />\non their hearts and lives. intimately associated with the Hos- the title of \"leaven of American medioutstanding than his own, looked country, which they accepted. The ideas to mark what this man, the<br />\ngreatest His like will not soon be seen pital and the Schools of Medicine cine.\" When Dr. Welch set out on his<br />\nfar-flung career, medicine was a type Of<br />\nto him automatically as their na- set forth in this plan for the future de- medical mind, has done for them. again.\"<br />\nvelopment of the Hopkins, created conand Hygiene than with the depart_ esoteric art. Dr. A. K. Bond, in comtural leader. He represented in sternation in the<br />\n* * *<br />\nmedical profession, Combined with this great interest in<br />\nments at Homewood, he was keenly menting on the practice of the period,<br />\ntheir eyes the heights to which a which did not then regard medicine as a medicine was lovable, affectionate<br />\nin all the activities of the says, \"The long knife of my prize case<br />\n\"Guiding<br />\ninterested<br />\nSpirit\"<br />\nman could lift himself; they con- science, but as an art. But Dr. Welch's and unselfish nature. He has been<br />\nutilize<br />\nDR. W. G. McCALLUM, Dr. University and his death is a per- I tried, by blunting its point, to<br />\nsidered it a priceless privilege to superior wisdom won out: henceforth the performing kind deeds, and kind<br />\nfor a table carving knife; for it was of<br />\nWelch's successor as professor of sonal loss to the entire Homewood<br />\nthe finest steel, shaped to pierce the hip<br />\nbe associated with him. They physician who decided to forego practice thoughts upward into a few days of<br />\npathology<br />\nat the Hopkins:<br />\nand<br />\ninterval<br />\nbetween<br />\ndevote<br />\nhimself<br />\nto<br />\nthe<br />\nresearch<br />\nwas<br />\nIn<br />\nno<br />\nfaculty.<br />\nand cut outward quickly before the parecognized in him the kindred<br />\nhis death, when he became uncon_<br />\nlonger regarded as an eccentric.<br />\n\"With the death of Dr. Welch the resignation of President Rem_ tient had time to bleed to death; but<br />\nspirit of a smouldering passion<br />\nIn 1889, the same year that the Johns scious. America owes him the we who have been his students feel sen in 1912 and the installation of. housekeepers have prejudices, and today<br />\nfor and devotion to the great sci- Hopkins Hospital opened with Dr. Welch greatest tribute that can be given<br />\nthat we are left without the source President Goodnow in the autumn it lies in its case unused.\" Now, although a<br />\nentific ideal, and this in itself was its first pathologist-in-chief, Sir William any one of her greatest citizens.\"<br />\nof<br />\nwisdom and inspiration to which of 1914, Dr. Welch, as chairman of there are still distant horizons to work<br />\nfor the aesthetic, adventurous quality ni<br />\nsufficient to insure their lifelong Osler, Dr. William S. Halstead, and Dr.<br />\n* * *<br />\nwe have so long had access. For this the Administrative Committee, was the practice has for the<br />\nHoward A. Kelly joined him here in<br />\npart passed;<br />\nfidelity and friendship.<br />\n\", country and indeed the world his the chief executive officer of the and a safer and sanermost<br />\nBaltimore, forming the famed \"Big Four\"<br />\n\"Outstanding<br />\nTeacher<br />\nhas rescience<br />\nAnd to the aspiring young stu- around whom the Hopkins Medical School<br />\nDR. THOMAS C. CULLEN, death means the loss of a great University. He was instrumental placed it—much to the joy of all condent he unconsciously served as a was built. Out of this schoot, the first of professor of gynecology at the guiding spirit in niedicine and all<br />\nin carrying into effect Sir William cerned.<br />\nstimulant and an inspiration. In- its kind in America, came the deans and Hopkins, Who was associated with that concerns public health.<br />\nand Lady Osler's generous endow- Fresh from the European incubator Of<br />\nstructors referred to him as typi- leaders of Atnerican research—pupils of Dr. Welch for many years:<br />\n\"But this wonderful personality ment of the Tudor and Stuart Club, a new medical science, of a light valid'<br />\nmagic<br />\nfying the best and noblest in man, Welch himself and Osler, Halstead, Kelly,<br />\n\"William H. Welch came on the will remain ever in our memories and when in 1931 the inadequacy of flooded the age-long darkness and<br />\nHowell, and Abel, all his appointees to<br />\nback<br />\nt°<br />\nof<br />\nhealing,<br />\nDr.<br />\nWelch<br />\ncame<br />\none Whose life's story could be a faculty the like of which had never medical horizon just when the op- as an ideal toward which we<br />\nmay our book_fund led to the organiza- America and served as the bull-dog cif<br />\ntaken as a literal embodiment of been assembled in this country.<br />\nportunity for, scientific work was strive, and the world will realize tion of the Friends of the Library bacteriology on these innocent plains'<br />\nThe remainder of his life was one great ripe. His training both in<br />\nacademic satiety. What other<br />\nthis that it has been enriched by his at Homewood, Dr. Welch was one Recognized by President Gilman, th9t<br />\nbut an uplifting effect could such triumph for Dr. Welch—\"he had his country and abroad had been un_ life.\"<br />\nto tile<br />\nof the founders, giving hearty sup- genius at finding genius, he camehere<br />\napotheosis while living.\" Tirelessly cona tribute carry with itself?<br />\nHopkins, and took his quarters<br />\n* * *<br />\nusually<br />\nthorough,<br />\nand<br />\n.<br />\nbefore<br />\nhe<br />\ntinuing his labors for the advancement of<br />\nport which a less unselfish man Baltimore.<br />\nIII<br />\nscientific medicine, his greatness was reached the Johns Hopkins Univerwould have reserved for the special<br />\n\"Medical Pioneer\"<br />\nWith an ubiquitous inspiration, .he<br />\nThe shades of Osler, Halstead, universally recognized. and he gained sity he was well and most favorably<br />\nDR. DEAN LEWIS, surgeon- library which bears his name.<br />\nspread<br />\nthe new gospel among his PtiPlis.<br />\nGilman, Sylvester, Rowland and honors on every side. In 1930 Dr. known by the leaders of medical in_chief at the Johns Hopkins Hos\"He will long be remembered, At the same time, he revolutionized tile<br />\nWelch's<br />\n80th<br />\nbirthday<br />\nwas<br />\nthe<br />\noccasion<br />\nRemsen have already received<br />\npital:<br />\nand for many things. To those at structure of medical 'education, laY111,g<br />\nof a birthday celebration in all parts thought, both here and abroad.<br />\nhim into their midst.. One more<br />\n\"It was my rare privilege to have<br />\n\"He was the greatest figure in Homewood who were fortunate novel stress on the experimental. A;<br />\nof the world, and all that scientific men<br />\nimposing figure has departed from could do to show their appreciation and been more or less closely associated medicine in this country. He has enough to know him personally, an teaching ability, his numerous, fertile?<br />\ndesign f°`<br />\nthe Hopkins scene, leaving it in- gratitude was done.<br />\nwith him since 1891. His former been particularly great in outlining outstanding characteristic was his contacts, his doctrines, his<br />\nthe new ‘schooling—all have immeasur;<br />\nfinitely the sadder and the poorer. And now his earthly life is over. But pupils are now the leaders of medi_ medical teaching. Besides, his in- instinctive kindness of heart and<br />\nably contributed to a more comPeterld<br />\nYet the indominatable spirit of there will always remain the monument cine all over the United States. The fluence has been felt throughout the the breadth of his interests and sym_ yearly harvest of young healers. An<br />\nDr. Welch still exists among us. of modern medicine he did so much to genial dean of American medicine world, in addition to influencing pathies. These qualities won him there lies his great contribution. FP)/11<br />\nbuild, the bulwark for the benefit of<br />\nsomething low and undeveloped, he OP<br />\nHis is a deathless life; his very<br />\nmankind which stands in memory of \"the sleeps, but he will long live in the medical teaching, more than any friends in all parts of the world plied the leaven to raise it into that loft)<br />\n;<br />\nmention will urge us onward and great architect of American medicine, a hearts and minds of the myriads he one else in developing preventive and made the influence of his perstructure that is modern medicine in til<br />\nupward to greater achievement.<br />\nman whose life is an epic.\"<br />\nhas taught.<br />\nmedicine, which has been one of sonality widespread and enduring.\" New World.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., MAY 4, 1934.<br />\n••••<br />\n<br />\n)r. J. J. Abel<br />\nHonored With<br />\nKober Medal<br />\n<br />\nYes Sir-Old Gebby<br />\nPlayshop To Give Dr. Robinson Finds Inscription<br />\nStringing<br />\n'Hedda Gabler' At<br />\nhus Excavations Keeps<br />\nOlynt<br />\nOf<br />\nSite<br />\nAt<br />\nThe Boys Along<br />\nSalisbury Normal<br />\n<br />\nand sent on their way to the National Composers' contest by their<br />\nhopeful originator.<br />\nAll Gebby did was to annex two<br />\nsecond prizes in a field of 1,500<br />\ncompetitors, this in spite of the fact<br />\nthat he is generally conceded to<br />\nhave won more than his share of<br />\nprizes in the past. He was awarded the runner-up honors for his<br />\nmandolin solo and for one of the<br />\ntwo Hawaiian guitar solos which he<br />\nentered.<br />\n<br />\nAgain our local musical pride,<br />\n(Continued from Page 1, Col. 4) found, made out of the natural pebOf Famous<br />\nhill-coun<br />\nsurrounding<br />\nMr. Conrad Gebelein, has thumbed<br />\ntogether. bles of the<br />\nIbsen Play By Hopkins Group In have been found buried<br />\nrecent of these mo- his way to fame. This time the<br />\nmost<br />\nThe<br />\ntry.<br />\nA beautiful, painted tomb, un•etired Hopkins Pharmacolo- February Was Well Received<br />\nsaics is filled with inscriptions such noted fretted-instrument player's<br />\nof some famous<br />\nthat<br />\ndoubtedly<br />\nLong<br />\nFor<br />\ngist Is Rewarded<br />\nas `Success to the beautiful\" and thumbing was necessarily limited to<br />\nOlynthian, was uncovered. The<br />\nMedical, Research Service Hedda Gabler, with the original excavators have found five more of \"Achievement is a goodly thing.\" \"picking\" out harmonious notes and<br />\ncast, will be presented by members<br />\nsetting them down on paper, after<br />\nStaff Includes Hopkins Men<br />\nthe mosaics, which have already<br />\nthe<br />\nJohns<br />\nHopkins<br />\nPlayshop<br />\ntoprowhich they were duly touched up<br />\nretired<br />\nAbel,<br />\nJacob<br />\nJohn<br />\nDr.<br />\naroused much interest in the scholBesides Professor Robinson the<br />\nin<br />\nmorrow<br />\nthe<br />\nof<br />\nauditorium<br />\nthe<br />\nfessor of pharmacology of the<br />\narly and artistic world, and many staff consists of Dr. J. Walter GraSalisbury Normal School.<br />\nSchool,<br />\nMedical<br />\nfig- ham and Dr. Paul Clement, both<br />\nJohns Hopkins<br />\nThe Ibsen play was produced by more of the graceful Olynthian<br />\nPh.D.'s of the Johns Hopkins Univvas awarded the Dr. George M. the Playshop in February and was urines and vases.<br />\nversity; Dr. Joseph De Waele of<br />\nstarted<br />\nfirst<br />\nof<br />\nRobinson<br />\nAssociation<br />\nProfessor<br />\nober Medal by the<br />\nso well received that two extra perand<br />\nAmerican School in Athens and<br />\n1928,<br />\nthe<br />\nin<br />\nOlynthus<br />\nA merican Physicians, last Wed- formances were required and the excavating at<br />\nor in Holland; Miss'Eleexcaof<br />\n.profess<br />\na<br />\ncampaign<br />\ngroup was invited to come to Sal- this is his third<br />\nnesday.<br />\nof Syracuse University;<br />\nLay<br />\npubanor<br />\nalready<br />\nvation there. He has<br />\nisbury.<br />\nPresentation of the award took<br />\nPackard, a BaltiElizabeth<br />\nfinds,<br />\nMiss<br />\nhis<br />\nlished eight volumes on<br />\nMiss Jordan, Heroine<br />\nplace at Atlantic City, N. J., as part<br />\nof Bryn<br />\ngraduate<br />\na<br />\nand<br />\nvases, terra-cottas, morean<br />\nThe cast is headed by Miss Fran- including coins,<br />\nof the exercises marking the 49th<br />\nMr. Saul<br />\nand<br />\nTravlos,<br />\nMr.<br />\nMwr;<br />\nbronzes, and mosaics.<br />\nannual meeting of the medical as- ces Jordan, 'who plays the part of<br />\nWeinberg.<br />\nHedda, an attractive but impoverUncover Early House<br />\nsociation.<br />\nOlynthus is located near Saloniki,<br />\nished society woman. Unable' to<br />\nPerhaps the most important re- and is in the center of a country<br />\nLauds Service<br />\nmarry within her own set, Hedda<br />\nthe expedition is the dis- which suffered from a severe earthDr. Charles Wallis Edmonds, of becomes the wife of a poor, dull sult of<br />\nthe houses he is bringing quake a few years ago.<br />\nof<br />\ncovery<br />\nthe University of Michigan,, made scholar, played by Robert Gill.<br />\n211-213 E. Baltimore St.<br />\nwere the first. houses<br />\nThese<br />\nlight.<br />\nto<br />\nthe official presentation. He praised<br />\nThe other members of the cast of classical Greece dating before<br />\nDr: Abel's long period of service to include Patty Singewald, Helen<br />\n348 B. C. to have been discovered.<br />\nou3medicine and mentioned as his!<br />\nUsherfeld, Isabel Idov, David Lov- They are arranged in rows in city<br />\nstanding achievement, his work in ett, and Bunt Royce. The producFLORISTS - - DECORATORS<br />\nmuch as they are in modern<br />\nMembers, F. T. D Asso., Inc.<br />\nthe \"crystallization of insulin and tion is directed by Dr. N. Bryllion blocks<br />\nthe floor's are covered<br />\nand<br />\ncities<br />\nBALTIMORE, MD.<br />\n1918 N. CHARLES ST. VEr. 0573<br />\nstudy of its chemistry.\"<br />\nFRANKLIN STREET near HOWARD<br />\nFagin.<br />\nwith mosaics, the earliest ever<br />\nGarage<br />\nRooms—$1.50 Up<br />\nSecond Largest Stage<br />\nThe medal is awarded annually<br />\nTap Room Open from 10:30 to 2 P. M.<br />\nIt<br />\nservice.<br />\nmedical<br />\nd<br />\nfor distinguishe<br />\nThe stage at Salisbury on which<br />\nNO MINIMUM CHARGE<br />\nNO COVER CHARGE<br />\nWas founded nine years ago in Hedda Gabler will be presented is<br />\nSwimming Pool, Gymnasium, Private Rooms and Banquet Halls for<br />\nAll Occasions.<br />\nCALVERT and 30TH STS.<br />\nPrinters of<br />\nhonor of Dr. George M. Kober, reported to be the second largest in<br />\nPINKARD, Manager<br />\nScientific<br />\nC.<br />\nt<br />\nW.<br />\nin<br />\nand<br />\nFirst<br />\n—<br />\nPhilological<br />\nQuality<br />\nin<br />\nFirst<br />\ndean of the Georgetown University the East, being exceeded in size<br />\nPublications<br />\nService<br />\nARABIAN NIGHTS CLUB available for Fraternity Dances.<br />\nMedical School.<br />\nonly by the stage of the Hippo- 12-20 HOPKINS PL. BALTIMORE<br />\nI\\To delivery too small Bel. 53181<br />\ndrome Theatre in New York City.<br />\nOriginal Production<br />\n<br />\nBacks<br />\n<br />\nare the bi features in<br />\ncollege men's suits this<br />\nSpriq—prices from<br />\n<br />\n25<br />\n<br />\nKATZ CLOTHES<br />\n<br />\nI A. RITTER & SON, INC.<br />\n<br />\n411.<br />\n<br />\nCONGRESS HOTEL<br />\n<br />\n0...•••o ••••• 410.•4•••••••••••••••••••........•••••••••••••••••••••••••1<br />\n<br />\nI H. FURST CO.<br />\n<br />\nI<br />\n<br />\nPeabody Pharmacy<br />\n<br />\n••••••••••••••••<br />\n<br />\n•••••••••••••....•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br />\n<br />\nPhi Beta Hears<br />\nNoted Scientist<br />\n<br />\nbin<br />\nrne<br />\nas<br />\n<br />\n,rof<br />\n<br />\nth<br />\nnd<br />\nof<br />\nen<br />\nhe<br />\n<br />\nre<br />\n11f<br />\nL.<br />\nli-<br />\n<br />\nii-<br />\n<br />\n)11,<br />\nsit<br />\n11-<br />\n<br />\nlid<br />\nie.<br />\n)r.<br />\nhe<br />\nmu<br />\n<br />\ndiof<br />\ntry<br />\n)d,<br />\nLse<br />\nize<br />\nof<br />\n)aAlt<br />\nlaY<br />\ngil<br />\n<br />\n(Continued from Page 1,'('o/. 2)<br />\nfacts through research, Dr. Merriam stated. The scientist must be<br />\nable to interpret what he has learned<br />\nby turning the spot light upon it<br />\nand pointing out \"the harmonious<br />\nrelation of an object to its environin mt.\" His ability to report what<br />\nhe has examined may be taken as<br />\na test of whether or not the scientist has seen an object as it really is.<br />\n<br />\nan<br />\n<br />\nInitiate 37 Hopkins Students<br />\n<br />\nand FIRM<br />\nACKED that's why<br />\nfind Luckies do not dry out<br />\n<br />\nAs for art needing science, Dr.<br />\nMerriam explained that the greatest artists and men of letters have<br />\npainted nature as the scientist sees<br />\nit. \"Art is today recognizing that<br />\nthe doors are being opened wide by<br />\nscience, and if science is wise<br />\nenough to bring art into its camp,<br />\nWe may witness some remarkable<br />\ndevelopments in coming years.\"<br />\nIn addition to the 37 Hopkins<br />\nstudents who were initiated at the<br />\nannual ceremonies, Dr. Lawrence<br />\nMisbach, of Northwestern University, and Miss Marjorie Eunice<br />\nGooch of the University of Maine<br />\nwere inducted into the honorary<br />\nfraternity having been elected at<br />\ntheir respective universities. Both<br />\nare doing research work here.<br />\n<br />\nLuckies use the mildest tobaccos—for<br />\nLuckies use only the clean center leaves<br />\n—and these are the mildest leaves.They<br />\ntaste better. Then science plays its part<br />\nin making these choice tobaccos truly<br />\nkind to your throat. “It's toasted\"—for<br />\nthroat protection. These mellow, finetasting tobaccos are cut into long,<br />\n<br />\nOfficials Suggest<br />\nPres. Ames For<br />\nU. S. Air Board<br />\n<br />\n)rk<br />\nOf<br />\n!Cl ;<br />\nre'<br />\n1l<br />\n<br />\nof<br />\nich<br />\ngic<br />\nto<br />\nof<br />\nS.<br />\nlist<br />\n<br />\nthe<br />\nin<br />\nbe<br />\nils•<br />\nthe<br />\njng<br />\n<br />\nJiS<br />\n<br />\ntile<br />\nfor<br />\nerit<br />\nLod<br />\n0111<br />\nLIP<br />\n<br />\n,ftY<br />\n<br />\nthe<br />\n<br />\nsilky, full-bodied shreds and fully<br />\npacked into every Lucky—so round,<br />\nso firm, free from loose ends. That's<br />\nwhy Luckies \"keep in condition\"—<br />\nwhy you'll find that Luckies do not<br />\ndry out, an important point to every<br />\nsmoker. You see, always in all-ways<br />\n—Luckies are kind to your throat.<br />\n<br />\n••:•.1<br />\n<br />\nUrging the appointment of some<br />\nMarylander to the proposed national commission to !study the entire<br />\nfield of aviation in the United<br />\nStates, Senator Tydings and Representative Cole of this state made<br />\na recommendation to President<br />\nRoosevelt this week of those men<br />\nWho would be most acceptable.<br />\nPresident Joseph S. Ames, who is<br />\nchairman of the National Advisory<br />\nBoard for Aeronautics, was among<br />\nthe four named by the Congressmen.<br />\nAsserting that Maryland, and<br />\nBaltimore in particular, are leading other communities in aviation<br />\nmanufacture and development, the<br />\nrecommendation said of the four<br />\nrnen suggested: \"We earnestly urge<br />\nthe choice of one of these, or his<br />\nselection would be an eminently<br />\nOutstanding one and his contribution<br />\nto the cause one of value.\"<br />\n<br />\n••<br />\n<br />\nOnly the Center Leaves—these are the Mildest Leaves<br />\ncopyright, 1934, Tho Amerlcm;Tobacco Company.<br />\n<br />\ncaS 7k7S4<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., MAY 4, 1934.<br />\n<br />\n4,<br />\n<br />\nTENNIS TEAM BEATS GEORGETOWN<br />\nStickmen Face Trackmen Play<br />\nINDELL<br />\nSW<br />\nBASEBALL<br />\nHost To Catholic<br />\nPennsylvania Team Tomorrow First playing lacrosse at the Gil- Netmen Bow To Princeton In First Battle of Trip<br />\nNext Wednesday the informal<br />\nman Country School under the tubaseball team meets its first real<br />\nAt Homewood Jays Will Attempt To Cap- telage of Coach Ned Dukehart, a<br />\nsky added another scalp to his belt<br />\ncompetition in a practice game with<br />\nJays Face Breather For Second Successive Week; Entire Squad To Be Used<br />\nFor the second Consecutive week,<br />\nCoach Van Orman will pit his<br />\ncharges against an opponent which<br />\nis capable of offering little more<br />\nthan a workout for the title-bound<br />\nUn,iversity of PennsylJay ten.<br />\nvania will be the foes at Homewood<br />\ntomorrow.<br />\nTomorrow's game may see the<br />\nreturn of George Packard to the<br />\nBlack and Blue fold at his usual<br />\ncenter position. Packard has not<br />\nbeen out for lacrosse due to intensive work on his graduation thesis.<br />\nGeorge appeared as soon as his<br />\nstudies were completed and will<br />\nprobably see action Saturday. His<br />\nreturn to the Hopkins ten will<br />\ngreatly enhance their chances<br />\nagainst Maryland and St. John's.<br />\nRegulars Back<br />\n<br />\nHenry Beeler, Pete Reynolds,<br />\nand Charley Orth, who missed the<br />\nSwarthmore fray because of the geology trip, will also be in the starting line-up tomorrow.<br />\nSo far this year the stick play of<br />\nPenn has been mediocre and powerless. They opened their current<br />\nseason- by defeating their Alumni,<br />\n3 to 2. They then lost to Lehigh<br />\nand were swamped by Navy. On<br />\npaper the Jays seem to be in for<br />\nanother breather, but as all the<br />\nnorthern teams point for the Hopkins game, an interesting battle will<br />\nprobably be in store for the spectators.<br />\n<br />\nture Their First Victory<br />\nOf The Current Season<br />\nFacing Catholic University at<br />\nHomewood in their fourth meet of<br />\nthe season tomorrow, the Jay track<br />\nteam will attempt to capture its initial victory of the year.<br />\nThe Black and Blue so far has<br />\ndropped encounters to Swarthmore<br />\nand Delaware and has been tied by<br />\nHaverford. The margin of defeat in both cases, however, was<br />\nextremely small and the contest on<br />\nSaturday is expected to be just as<br />\nclose as the preceding ones.<br />\nHopkins has met Catholic U. for<br />\nthe last four years, with the Jays<br />\nwinning in 1930 and last year, and<br />\nCatholic U. triumphing in 1931 and<br />\n1932. Last season, the Washingtonians had only an informal squad,<br />\nbut the sport has been revived and<br />\nit is thought that they will present<br />\ntheir constomarily powerful aggregation.<br />\nCatholic U. has shown its greatest strength in the field events,<br />\nwhile Hopkins is favored to win the<br />\ndistance runs.<br />\n<br />\nAdvice To Car Owners<br />\nA successful remedy to prevent<br />\nautos from cavorting around streets<br />\nwithout consent of the owners has<br />\nbeen placed in use at Southern<br />\nMethodist University.<br />\nA cardboard notice was found<br />\nrecently hanging on one of the cars.<br />\nIt read:<br />\n\"You are welcome to borrow this<br />\ncar, but please have it back at the<br />\ntime agreed above. Please put in it<br />\nat least as much gas as you use.\"<br />\n<br />\nformer Hopkins lacrosse star, it<br />\nwas natural for Philip Wilson<br />\nSwindell, better known as Pete, to<br />\ncome to Hopkins upon his graduation from Gilman.<br />\nBesides being on the stick team<br />\nat Gilman, Swindell also attained<br />\nfirst string berths on the football<br />\nand basketball teams. In his last<br />\nyear Pete captained the Indian team,<br />\nand held down a berth at wing defense.<br />\nSwindell has made a favorable<br />\nshowing for himself, considering<br />\nthe fact that this is his first year<br />\nhere. Last fall he proved himself<br />\nto be a valuable cog in the Hopkins<br />\nfootball team.<br />\nIt was during the Mt. Washington clash that Swindell distinguished himself as wing defense.<br />\nHe and Pasarew saved the day for<br />\nHopkins by stopping the threatening onslaught of Lorne Guild, Hillman star.<br />\nWith the Wolfpack pelts hanging on our belts, says Pete, our two<br />\nremaining threats are St. John's<br />\nand Maryland. Although both the<br />\nTerps and the Johnnies have been<br />\ntaken into camp by the Hillmen,<br />\nthey are still dangerous contenders<br />\nfor the national stick title.<br />\nSwindell bids fair to become one<br />\nof the country's most outstanding<br />\nstickmen in his three remaining<br />\nyears of lacrosse at Hopkins.<br />\nWILL THE PERSON who borrowed<br />\nthe small vacuum cleaner from<br />\nLevering Hall some time Monda)<br />\nplease return it immediately?<br />\nHolmes will have to pay for it.<br />\n<br />\nPrinceton University defeated the<br />\nJohns Hopkins tennis team 9-0 at<br />\nPrinceton Wednesday afternoon on<br />\nthe first wing of the Jays' northern<br />\n<br />\nwhen he trounced Sendel, a former<br />\nmember of Mexico's Davis Cup Gilman Country School. The game<br />\nteam, in straight sets.<br />\nwill be called at about 4:30 at GilFace Army Tomorrow<br />\nman and will be short because of<br />\ntrip.<br />\nTomorrow the journeying Jay<br />\nthe lateness of starting.<br />\nThe Tiger racqueters, coached by<br />\nteam will encounter Army and<br />\nThe Hopkins squad has been<br />\nMercer Beasley, had little trouble in should give the Cadets a close run<br />\nfor three weeks and is<br />\npracticing<br />\nwinning all of the matches. Ladensky<br />\nfor a victory.<br />\nanxious<br />\nto<br />\nBlack<br />\nsee action. A diamond<br />\nthe<br />\nfor<br />\nshowing<br />\nbest<br />\nmade the<br />\nThe probable line-up for Hopin<br />\nDruid<br />\nHill<br />\nPark is used for<br />\nfive<br />\nwinning<br />\nsingles,<br />\nand Blue in the<br />\nkins in the singles include Brooke,<br />\non<br />\nworkouts<br />\nwas<br />\nWednesday, and<br />\ngames in the two-set match. He<br />\nSiverd, Hartman, Ladensky, Blum,<br />\ndefeated by Tilden.<br />\nIn the doubles, Thursday from 4:00 to 6:00.<br />\nand Needle.<br />\nAt present V. C. Kelly is treasBrooke and Siverd, Blum and Mcurer<br />\nLaden-manager of the club and Bill<br />\nand<br />\nand<br />\nHartman<br />\nGregor,<br />\nBefore starting on their northern<br />\nHazlett<br />\nacts as manager-coach.<br />\nsky<br />\nplay.<br />\nto<br />\nare<br />\nslated<br />\ntrip the Hopkins tennis team defeated Georgetown in a close en- Iccounter, five matches to four. The<br />\nrivals split the singles contests but<br />\nthe Jay netmen won two of the<br />\nthree doubles matches to clinch the<br />\ncontest.<br />\nPlay was close in every match.<br />\nThree of the contests went into extra sets, and six sets went into extra<br />\ngames. Morgan Jacobs, former<br />\nMaryland state junior champion,<br />\ndefeated Cliff Siverd in an interesting three-set match. Brooke, Jay<br />\nCrowley,<br />\ncaptain, won from<br />\nGeorgetown 'ace, in another extra<br />\nset match that was productiVe of<br />\nsome good tennis. Milton Laden-<br />\n<br />\nTHE EMERSON HOTEL<br />\n<br />\nPhone Belmont 7908<br />\n<br />\nBIRELY'S<br />\nPHARMACY<br />\nST. PAUL at 33RD STREET<br />\nYour Neighborhood Drug Store<br />\n<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br />\n<br />\nBALTIMORE, MD.<br />\nPrivate Rooms and Banquet Halls<br />\nfor All Occasions<br />\nCuisine and Furnishings<br />\nUnexcelled<br />\nRooms,$3.00 up<br />\n<br />\nAutos Garaged<br />\n<br />\nThe way tobacco is cut has a<br />\nlot to do with the way Chesterfield<br />\nburns and tastes<br />\nThere are many different ways<br />\nof cutting tobacco.<br />\nA long time ago,it used to be<br />\ncut on what was known as a<br />\nPease Cutter, but this darkened the tobacco, and it was<br />\nnot uniform.<br />\nThe cutters today are the<br />\nmost improved, modern,up-tothe-minute type. They cut uniformly, and cut in long shreds.<br />\nThe tobacco in Chesterfield<br />\nis cut right—you can judge for<br />\nyourself how Chesterfields burn<br />\nand how they taste.<br />\nEverything that science knows<br />\nis used to make Chesterfield<br />\nthe cigarette that's milder...<br />\nthe cigarette that tastes better.<br />\n<br />\nthe cigarette that's MILDER<br />\nthe cigarette that TASTES BETTER<br />\n1934, LIGGETT & MYERS TOBACCO CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "3<br /><br />\nMEMBER OF THE<br /><br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br /><br />\n3Joints iqopkins 'Nrwri-Ertter<br /><br />\nOf Middle Atlantic States<br /><br />\nTRIBUTES TO<br />\nDR. WILLIAM H. WELCH<br />\nSee Page 2<br /><br />\nHOME WOOD, BALTIMORE, MD., FRIDAY, MAY 4, 1934.<br /><br />\nVol. XXXVIII—No. 48<br /><br />\nChemistry<br />\nConference<br />\nMeets Today<br /><br />\nGOING TO<br />\nThe Time-Honored<br />\nCry Assumes A<br />\nNeu. Meaning<br /><br />\n\"PRESS\"<br /><br />\nTwenty-Eight Attend Assembly;<br />\nCompulsory Ruling Readopted<br />\nScoring optional assemblies as<br />\nabsolute failures, Edward Sadtler,<br />\npresident of the Student Council,<br />\nannounced yesterday that next<br />\nweek's assembly, to be devoted to<br />\nthe public initiation of 0. D. K.<br />\nwith Carlyle Barton as guest speaker, will be compulsory.<br />\nBecause he feared a poor attendance, Sadtler cancelled yesterday's<br />\nassembly, which was to feature an<br />\naddress by the Hon. William E.<br />\nSweet, former governor of Colorado, on the \"New Deal.\"<br /><br />\nclasses in the affairs of the University, he believed that only<br />\nthrough assemblies could such an<br />\ninterest be revived.<br />\n\"If the students do not take advantage of this weekly opportunity<br />\nto keep in touch with affairs on the<br />\ncampus, the next step is to compel<br />\nthem to come,\" he declared.<br /><br />\nPrice, 5 Cents<br /><br />\nCHIEF BEER<br />\nTo Lead Attack On<br />\nAle and Pretzels<br />\nTomorrow Eve<br /><br />\nGUZZLER<br /><br />\nMusical Club<br />\nTaps Frailey,<br />\nEigenbrode<br /><br />\nTWO NEWS-LETTER reporters<br />\nwere wearily perambulating down<br />\nGain Respective Positions Of<br />\nFifth Meeting Of Founders the boardwalk from Gilman at 10<br />\nPresident And Business<br />\nOf Fellowship Plan Fea- p. m. last Tuesday, when one of<br />\nManager Of Organization<br />\ntures Langmuir Address them, ever alert in true NEWS-LETTER fashion, espied a light in the<br />\npaper's office.<br />\nNominations Next Week<br />\n\"That's strange,\" quoth he in<br />\nAfter<br />\nnext week's compulsory<br />\ntrue journalese, \"the paper should<br />\nHatfield, Murphy, Reuling,<br />\nthere will be nominations<br />\nassembly,<br />\nFirst Presentation Of Avoga- have been put to bed long before<br />\nthe<br />\npresident<br />\nof<br />\nof<br />\noffice<br />\nfor<br />\nthe<br />\nAnd Cannon Also Secure<br />\ndro Medal Scheduled As thi eery hour. I wonder why the<br />\nimportant<br />\nthis<br />\nAs<br />\nCouncil.<br />\nStudent<br />\nOffices At Annual Election<br />\nlights are still on?\"<br />\nClimax To Proceedings<br />\nof the<br />\nvote<br />\nthe<br />\nelected<br />\nby<br />\nofficer<br />\nis<br />\nOnly<br />\nTwenty-eight<br />\nAttend<br />\nAnd in spite of the admonition of<br />\nCarson G. Frailey and Daniel<br />\nBefore an assembly of only 28 entire undergraduate school, Sadtler<br />\nhis less adventurous companion that<br />\nEigenbrode<br />\nwere elected presiAn address by Dr. Irving Lang- perhaps Dillinger was<br />\nimutmost<br />\nlurking in the students, Sadtler outlined his rea- announced that it is of<br />\ndent<br />\nand<br />\nbusiness<br />\nmanager, rechemistry<br />\nLaureate<br />\nin<br />\nbe<br />\nmuir, Nobel<br />\noffice, this hardy soul succeeded in son for changing the order which portance for the students to<br />\nClub<br />\nspectively,<br />\nof<br />\nthe<br />\nMusical<br />\nfor 1932, will feature the fifth an- gaining the window by working his was instituted two weeks ago. Be- present in order to hear the discusfor<br />\nthe<br />\nannual<br />\nthe<br />\nyear<br />\n1934-35<br />\nat<br />\nnual conference of Founders of way forward on all fours. Then, cause of the lack of interest shown sion of the responsibilities attached<br />\nelection of the organization held<br />\nto this office.<br />\nthe Johns Hopkins National Fel- with reckless abandon, he raised by the sophomore and freshman<br />\nlast night at the Gray Goose Inn.<br />\nhimself up to his full stature, peered<br />\nlowship Plan, which will convene<br />\nMEADE JOHNSON<br />\nFrailey succeeds Norman S.<br />\nin through the window and saw—a<br />\ntoday.<br />\nHopkins<br />\nHeaney, while Eigenrode replaces<br />\nat the<br />\ngirl in the close company of a<br />\nAl Hunt.<br />\nThe complete schedule of events rather prominent member of the<br />\nVice-presidents for the new<br />\neditorial staff.<br />\nfor the conference is:<br />\nyear are Edward Hatfield, Jr., and<br />\nThe two reporters will say no<br />\n10:00 A. M. Meeting in the office<br />\nJohn L. V. Murphy. Bert G. Canmore<br />\nof the incident. They value Fifteen-Line Inscription Is Popular Pennsylvania Players<br />\nof President Joseph S. Ames.<br />\ntheir jobs too much!<br />\nWill Be Featured At June Al Mason To Supply Music non and Louis E. Reuling were<br />\nFound Proclaiming Alli10:30 A. M. Visit to the research<br />\nappointed junior business manWeek Affair, June 7<br />\nFor Affair At Barn; Festiv- agers.<br />\nance of Philip, Olynthians<br />\nlaboratories, Remsen Hall.<br />\nThose elected to the business<br />\nities Begin At 9 O'clock<br />\n12:00 A. M. Luncheon for the<br />\nUnder the direction of Dr. David<br />\nJimmy DeAngelis and \"his 14<br />\nstaff<br />\ninclude James Beck, John<br />\nchemand<br />\nfounders, faculty<br />\nM. Robinson, professor of archae- pieces of rhythm\" have been seFree beer and music furnished by<br />\nCanning,<br />\nBrian Murphy, Paul<br />\nistry students. Levering Hall.<br />\nology and Egyptology, American lected for the Junior Prom which Al Mason's Orchestra will be the<br />\nUmbarger<br />\nand<br />\nRobert Watkins.<br />\n2:00 P. M. Conference on special<br />\nexcavators who are unccvering the will be held on the evening of June featured attraction at the First AnHenry Fensterwald was named<br />\nphases of the National Fellow- Dr. J. C. Merriam Speaks ancient city of Olynthus, have at 7 in the main ball room of the Al- nual Sophomore Beer Bender to be<br />\nship Plan. Levering Hall.<br />\nheld tomorrow night at the Barn leader of the Blacy and Blue Jay<br />\nOn 'Relation Between Art last been rewarded in their long cazar.<br />\nOrchestra to succeed Richard<br />\nsearch for inscriptions and public<br />\na. m.<br />\n4:00 P. M. Lecture, Dr. Irving<br />\nThis band plays regularly at the from 9 p. m. to 1<br />\nAnd Science In Education' buildings.<br />\nTickets are $1.00, \"stag or drag\", Barger.<br />\nLangmuir, Nobel Laureate in<br />\nHershey Ball Room in Hershey,<br />\nConstitution Is Amended<br />\nThey have discovered an inscripany memChemistry. Remsen, 101.<br />\nThat science cannot get along<br />\nPennsylvania, and was recently fea- and can be secured from<br />\nAn amendment was made to<br />\n7:00 P. M. Dinner in honor of the without' art, and art cannot get tion fifteen lines in length proclaim- tured at.a ball given by the senior ber of the committee, composed of the constitution of the organizafounders. Baltimore Country along without science is a truth ing the alliance of Philip with the class of the Virginia Polytechnic Lou Reuling, Bert Cannon, Jerry tion which will allow the selection<br />\nBloom, and John Magill, or from<br />\nClub, Roland Park.<br />\nWhich must be understood if men Olynthians. This find corroborates Institute.<br />\nof an unlimited number of sophoa<br />\nfact<br />\nlong<br />\nknown<br />\nto<br />\nhistorians<br />\nclass officers, Meade Johnson,<br />\nthe<br />\nThe prom is one of the main<br />\n8:00 P. M. Presentation of the are to attain a higher appreciation<br />\nmores to the business staff infrom an account of Olynthus given<br />\nLeCmevents of this year's June Week, Bill Lippman, Abe Edelman,<br />\nAvogadro medal by Dr. of the world about them, was the<br />\nstead of three as has been the case<br />\nthesis of the address on \"The Re- by Diodorus. They also found the which will be held from June 6 to ard Emmart and Jonas Cohen.<br />\nLangmuir.<br />\nin former years.<br />\nIs Unique Affair<br />\nlation Between Art and Science in public stores and the arsenal.<br />\n9, inclusive. The week's activities<br />\nFrailey, recently elected presiPlan Started In 1929<br />\nRecover More Mosaics<br />\nThe Beer Bender, the first social<br />\nEducation\" delivered by Dr. John<br />\nwill be opened on Wednesday evedent<br />\nof the \"Y,\" is a member of<br />\nApparently Olynthus once sufThe National Fellowship Plan, C. Merriam at the annual initiation<br />\nning, June 6, with the Senior Ban- event of its kind in more than four 0. D. K. and has been appointed<br />\nstarted in 1929, \"involves the se- ceremonies of Phi Beta Kappa last fered from a severe epidemic, and<br />\nUniquet at the Baltimore Country Club. years, is expected to become a<br />\nmanager of the 1934-35 football<br />\nthirty victims of the strange malady<br />\nlection and training of chemists Wednesday evening.<br />\ntradition.<br />\nversity<br />\nNight Club Party To Follow<br />\nteam.<br />\n(Continued on Page 3, Col. 3)<br />\nwho are fitted to contribute to<br />\nJohnson, sophomore class presiDr. Merriam, a distinguished<br />\nThe Banquet is to be followed<br />\nfundamental chemical progress, paleontologist, is the president of<br />\nexplained that the class offident,<br />\nimmediately by the Night Club<br />\nstaff and equipment necessary to the Carnegie Institution in Washto give the affair for<br />\ndecided<br />\ncers<br />\nParty at which time copies of the<br />\noffer thorough training in chem- ington. He is also a former chairFirst, the informal<br />\nreasons.<br />\ntwo<br />\nBlue Black Mail will be distributed.<br />\nistry and adequate apparatus to man of the National Research<br />\nentertaintainment,<br />\nit is hoped, will<br />\nThe Mail is the annual senior class<br />\nophomores<br />\nenable students to undertake the Council and a member of numerous<br />\nhe<br />\namong<br />\n\"scandal sheet\", distinguished by its create<br />\ninvestigation of problems of re- scientific academies.<br />\nof confeeling<br />\nlow moral standard and embarras- themselves a closer<br />\nMelvin C. Cabler, a senior in the<br />\nsearch.\" Fellowships are pro\"Art Necessary To Science\"<br />\nSponsored by the Electrical Club sing revelations about class mem- geniality and friendship and better School of Engineering, was awardvided by leading individuals and<br />\ncooperative class spirit. Secondly,<br />\nDefining science as \"that attitude and the American Society of Civil bers.<br />\ned first prize for the best paper<br />\ncorporations throughout t h e of mind which secures facts, and Engineers, a dance or the Engian<br />\nenthusiastic turnout of sophoOn Thursday, Class Day will be<br />\npresented to the convention of the<br />\nUnited States.<br />\norganizes and relates them in order neering Schools will be presented herd at the L'Hirondelle Club, in mores will produce a surplus in the student branch of the<br />\nAmerican InThe Avogadro medal is given to learn the real nature of man and at Levering Hall tomorrow night, Ruxton. The following day will be treasury that will permit a great restitute<br />\nof<br />\nElectrical<br />\nEngineers,<br />\nheld<br />\nyearly to that graduate student or the world,\" and art \"as the way of at 9 p. m.<br />\nspent at the Annapolis Roads Club, duction in senior class dues.<br />\nat Princeton University last Mongraduate of the Hopkins whose thinking about those things which<br />\nJohnson urged that the class \"as<br />\nThe sponsors of this dance have where the annual Regatta is to be<br />\nday. The subject of Cabler's paper<br />\nresearches in the field of chem- science analyzes,\" the speaker de- combined with the Cotillion Board held. The week will be brought to a whole support this function with<br />\nwas \"Copper Oxide Rectifiers.\"<br />\nistry are deemed worthy of espe- clared that science cannot attain its in presenting Bubby Johnson and a close with the Senior Ball, to be their fullest possible attendance.\"<br />\nJ. J. Bockman, of the University<br />\ncial honors. A committee headed highest level without the assistance his orchestra.<br />\nheld Saturday evening, June 9, in<br />\nof Pennsylvania, was the recipient<br />\nby Dr. Langmuir, and consisting of art.<br />\nTickets can be secured from the the grand ball room of the Alcazar.<br />\nof the second award.<br />\nof Dr. J. C. W. Frazer, professor<br />\nIt is not enough merely to secure members of the sponsoring organi- The dance will feature Jan Garber<br />\nA group of 15 seniors, accompanof chemistry, and Dr. K. F. Herz(Continued on Page 3, Col. 1)<br />\nzation for 80 cents a couple.<br />\nand his orchestra.<br />\nied by 'Dr. J. H. Lampe, made up<br />\nfeld, professor of physics, will reMarking his half-year anniver- the first delegation the Hopkins has<br />\nview work submitted by all applisary as a broadcaster, Hyman Le- ever sent to this convention. Other<br />\ncants.<br />\nvin, former editor-in-chief of the institutions represented were Drex•<br />\n•<br />\nSaturday night el, Haverford, Lafayette, PennsylLife Story Succession Of TriPioneer Work Actuates Writ- NEWS-LETTER, last<br />\nAn Editorial<br />\nconcluded his 26-week series of vania, Princeton,<br />\ner To Call Him 'Leaven quarter-hour reviews of the college Besides the and Swarthmore.<br />\numphs — Raised Medicine<br />\npresentation<br />\nOf American Medicine' news of the week over WCBM. pers, the meeting included of paTo An Expanding Science Many of us were not fortunate<br />\ninspecthat<br />\nof<br />\nLast<br />\nweek's<br />\nprogram<br />\nand<br />\ntion<br />\ntrips<br />\nto<br />\nthe<br />\nA number of Hopkins students<br />\nLawrenceville<br />\nBy<br />\nEDGAR<br />\nKEMLER<br />\nenough to now him personally.<br />\nBy JOHN G. LYMAN<br />\nWill take prominent roles in a bill<br />\nYet the very thought that we The memory of Dr. William H. Welch, the previous Saturday both were Transatlantic Wireless Telephone<br />\nof three one-act plays to be pre- \"The dean of American medicine is were in any way connected with according to all indications, will most sent from Baltimore over the Gen- station and to the Walker Gordon<br />\ndead, but will live long in the chronicles<br />\ncertainly encounter the height of eral Broadcasting System, the new dairy plant, where the famous \"rosented by the newly formed Har of<br />\nscience and philanthropy.\" Thus did that University of which Dr.\"Wil- saintly regions. His material accomAtlantic seaboard chain.<br />\ntolocator\" is located.<br />\nPlayshop,<br />\non<br />\nSunday<br />\nSinai<br />\nnight at the New York Times write of Dr. Wil- liam H. Welch was an integral,<br />\nplishments are evidence enough, and<br />\n8:15 p. m., in the Vestry Rooms of liam H. Welch, for fifty years the guid- pulsating part and to whose Med- further, as Dr. Simon Flexner once said,<br />\ning genius of medical research and teachliar Sinai Temple.<br />\nical School he devoted and dedi- \"there is no human being in this country Frats Make Nominations McCollum Given Medal<br />\ning in this country and the man who<br />\nwho is not his debtor, many millions<br />\nThe group, devoted to the study<br />\nDespite the fact that three sus\"raised medicine in the United States cated the greater portion of his<br />\nDr. E. V. McCollum, professor<br />\nand production of liberal and soci- from a beneficent art to an expanding life suffices to awake within us more than have ever heard his name.\"<br />\nFar too much has he done for the health pended fraternities have not as yet of biochemistry at the Johns Hopological plays, has chosen Elmer science.\"<br />\nan undeniable feeling of pride in and happiness of mankind to live on in paid their assessments and been kins School of<br />\nHygiene and Public<br />\nGreensfelder's \"Swing Low\", an Dr. Welch's force of mind and innate his accomplishments and of de- mere mortal form. Americans are too<br />\nInIterfraternity<br />\nthe<br />\nreinstated,<br />\nHealth,<br />\nwas<br />\nawarded<br />\na gold medal<br />\nanti-lynch play; Theodore Dreiser's ability were noticeable characteristics termination to do whatever lies greatly concerned over their personal<br />\non<br />\nBoard<br />\nmeeting<br />\nMonday,<br />\nheld<br />\na<br />\nby<br />\nthe<br />\nAmerican<br />\nInstitute<br />\nof the<br />\n\"The Girl in the Coffin,\" a play during his early youth, but it was not within our power to emulate his welfare to even completely forget one of April 30,<br />\nnominations<br />\nfor<br />\nwhich<br />\nat<br />\nuntil his college days that they made him<br />\nCity<br />\nof<br />\nNew<br />\nYork<br />\nin<br />\nrecognition<br />\nthe most outstanding of their material<br />\nPortraying the struggles of a labor stand out, when he received his bachelor monumental example.<br />\nthe coming election of officers were for his work in the field of nutribenefactors<br />\nleader in a Northern textile strike; of arts degree at Yale in 1870, being secAnd yet it is not so much the<br />\nDr. Welch's position in that history of made.<br />\ntional research.<br />\nand Alter Brody's \"Rapunzel,\" a ond scholastically, in a class of 150. At intelligence of this universal ben- medicine, to which he was so thoroughly<br />\nNominations for president inPresentation of the medal took<br />\nPoetic description of tenement life first he intended to make the classics his efactor which we would extol at devoted, must be fairly unique. Unlike<br />\ncluded Stanley Clark, Roland Mer- place at a dinner held at the Amercareer,<br />\nbut<br />\nat<br />\nthe<br />\nend<br />\nof<br />\na<br />\nyear<br />\nof<br />\nthe names of Pasteur, Koch, Ehrlich, or<br />\nin New York.<br />\nteaching Latin and Greek he changed his this time—each chapter of the Noguchi, which are attached to the more son, and Bayard Williams. Only ican Museum of Natural History in<br />\nThe plays will be followed by mind. Indeed, his real \"profession was book of his life recorded a new,<br />\nobvious pedestals, the name Welch does one man, Richter Wiggall, was New York last night. This marks<br />\ndancing, with music by the South- arranged long before he had imagined it,\" far-reaching triumph in the field not stand for any single discovery, nor named for the position of secretary- the fifth occasion on which<br />\nDr. Mcerners.<br />\n(Continued on Page 2, Col. 2)<br />\n(Continued on Page 2, Col. 1)<br />\n(Continued on Page 2, Col. 6)<br />\ntreasurer.<br />\nCollum has been similarly honored.<br /><br />\nPlan Started In 1929<br /><br />\nBanquet Last Night<br /><br />\nDr.D.Robinson DeAngelisBand<br />\nAnnouncesFind At Junior Prom Sophs Sponsor<br />\nUnique Event<br /><br />\nPhi Beta Hears<br />\nNoted Scientist<br /><br />\nM. Cabler, Engineer,<br />\nSecures First Prize<br />\nIn A. E. E. Contest<br /><br />\nTo Give Dance<br />\nTomorrow Nite<br />\nFor Engineers<br /><br />\nLevin Ends Series<br />\nOf Air Broadcast<br /><br />\nDR.WELCH...DEAN OF MEDICINE AND MEN<br /><br />\nHopkins Students<br />\nPlay At Temple<br /><br />\nHOME WOOD, BALTIMORE, MD., MAY 4, 1934.<br /><br />\n2<br /><br />\n\"So, friends and colleagues, we launch our bark upon the Patapsco, and send it forth to unknown seas. May its course<br />\nbe guided by looking to the heavens, and the voyage promote the glory of God and the good of mankind.\"<br />\n—DANIEL COIT GILMAN, from his inaugural address, February 22, 1876.<br /><br />\nEditorials<br /><br />\nZbe 1news4setter<br />\nFOUNDED 1897<br /><br />\nSubscription per year<br />\nBy Mail<br /><br />\n________<br /><br />\n$2.00<br />\n$2.50<br /><br />\nRemit subscription fees to John Myers,<br />\ntreasurer, Student Activities Council, Gilman<br />\nHall, Postoffice, Johns Hopkins University.<br />\nEntered as second-class matter December 3,<br />\n1909, at the Postoffice in Baltimore, Md., under<br />\nthe Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June,<br />\nexcept during examination and college holiday<br />\nperiods by undergraduates of the Johns Hopkins University.<br /><br />\n:Features<br /><br />\nHopkins Mourns Passing Of Dr. Welch<br /><br />\nRe<br /><br />\nLife Story Colleagues Pay<br />\nTributes<br />\nSuccession High<br />\nTo His Memory<br />\nOf Triumphs \"Great Scientist\"<br /><br />\nWas Leaven<br />\nOf Medicine<br />\nIn America<br /><br />\nDR. HOWARD A. KELLY,<br />\nEDITORIAL DEPARTMENT<br />\n(Continued from Page 1, Col. 4)<br />\n(Continued from Page 1, Col. 2)<br />\nStanley E. Blumberg__Editor-in-Chief<br />\nthe last survivor of \"The Big Four<br />\neven<br />\nany homogeneous series of refor he had been born at Norfolk, ConRichard Feise, Melvin Goldberg,<br />\nHopkins:<br />\nsearches. It is true that he isolated the<br />\nManaging Editors necticut, on April 8, 1850, the son of a at the Johns<br />\n\"Profound sorrow upon learning<br />\nLeonard WallensteinSports Editor doctor, with four uncles and his grandorganism causing gas gangrene, and<br />\nIrving Leberfeld,<br />\nmade other fine contributions to the scilongtime,<br />\nof<br />\nmy<br />\ndeparture<br />\nthe<br />\nof<br />\nExchange and Filing Editor father also members of the profession.<br />\nence of pathology—discoveries bearing<br />\nThus<br />\nthe<br />\nhe<br />\ncolleague,<br />\nturned<br />\nhis<br />\nfriend<br />\nand<br />\nsteps<br />\nbeloved<br />\ntoward<br />\nmediBUSINESS DEPARTMENT<br />\non malaria, dysentery, rickets, diabetes,<br />\nBusiness Manager cine, entering the College of Physicians dean of the American Medical proRay Goldberg<br />\ndiphtheria, etc. Yet when President<br />\nand<br />\nSurgeons,<br />\nColumbia University. fession as well as one of the great.<br />\nBert Gordon_Advertising Manager<br />\nHoover and the cream of the world's<br />\nOffice Manager There the trifling incident of winning a<br />\nCharles Hastings<br />\nCirculation Manager microscope as a prize convinced him that est scientists our country has ever<br />\nDavid Levy<br />\ngreat scientific societies greeted him<br />\nfour years ago on his eightieth birthday,<br />\nhis life's work lay in the field ,of research. produced. His love for his fellows<br />\nFriday, May 4, 1934<br />\nthese achievements were not the essential<br />\nImmediately he formed the resolution to was one of his Most outstanding<br />\nprods for that superb offering. We must<br />\nbecome a pathologist instead of a prac- characteristics.\"<br />\nDr. Welch — Dean Of<br />\nlook elsewhere for them.<br />\nticing physician—and it was the begin* * *<br />\nMedicine And Men<br />\nDr. Welch,.during the nineties of the<br />\nning of a great career.<br />\n(Continued from Page 1, Col. 3)<br />\n\"Leader Of Men!,<br />\nlast century, turned about from his micDR. JOSEPH S. AMES, presiof medicine and served to advance<br />\nroscope (it had been the award of a<br />\nUpon<br />\nof the Johns Hopkins Univer_<br />\ndent<br />\nmicroscope from the New York College<br />\ncompleting<br />\nhis<br />\nundergraduate<br />\nscience one step nearer- its ultiof<br />\nmedical<br />\nstudies<br />\nand<br />\nPhysicians and Surgeons which in his<br />\nreceiving<br />\nhis<br />\ndegree<br />\nsity<br />\n:<br />\nmate goal. Rather, we wish to<br />\nin medicine at Columbia in 1875, he spent \"The death of Dr. Welch offers<br />\nyouth had determined his career) and<br />\npay even greater homage to the some time as interne in New<br />\nventured forth into the weedy field of<br />\nYork and<br />\nessential, eternal spirit of the man, then went abroad to study. One of his a sad opportunity to recall to the<br />\npublic health. Possessing, as we have<br />\never-present in everything to teachers in Europe was Pasteur, the minds of all students and friends of<br />\nalready seen, an eminent position on the<br />\nfront of medical investigation, and at the<br />\nwhich he turned his fertile mind— French microbe hunter; and another was the Johns Hopkins University what<br />\nsame time naturally endowed with a<br />\na spirit which prompted him to Koch, the tuberculosis germ's discoverer, a great service he did continuously<br />\nwhom he saw demonstrate in Cohn's for fifty years, and what a leader<br />\nquiet, effectual personality, Dr. Welch<br />\nsum up his own all-conquering botanical<br />\nwas admirably designed for the task. A<br />\nlaboratory his discovery of the of men and movements he was, not<br />\nand significant career in the fol- anthrax bacilli and its' obrollary, the<br />\nmember of the State Board of Health,<br />\nlowing manner: \"I have been proof that bacteria could cause disease. only in the University, but also in<br />\npresident from 1898 to 1922, he forged<br />\nnew lines of activity at a time when orlucky. I didn't realize that path- He also studied under Hebra in derma- the whole country. Few men have<br />\ntology,<br />\nunder<br />\nboth<br />\nUniversity<br />\nlife<br />\nand<br />\nMeynert<br />\ninfluenced<br />\nganized<br />\nin<br />\nneurology<br />\neffort in that realm was both<br />\nand<br />\nology would become as important<br />\nhalting and limited. And it was those<br />\npsychiatry, and under Wagner in prac- the life of the community as much<br />\nas it has proved. I simply liked tical medicine<br />\nand pathological anatomy.<br />\nexperimental steps in the Maryland Free<br />\nit.\" To think that a mere pleas- He watched Lister, the founder of anti- as he. He was keenly interested in<br />\nState, which even today influence the<br />\n—Courtesy Sun papers.<br />\nant occupation to this enterpris- septic surgery, at work in his LOndon all sides of life and brought to evhealth of all the various states of the<br />\nDR. WILLIAM HENRY WELCH<br />\ncountry. Even further, his influence exing young scholar developed into clinic, besides studying at one time or ery problem an original mind and<br />\ntended itself in the inspiration of Walter<br />\na science, the effect of which upon another under Chiari, the Viennese path- serious study. He was an adviser<br />\n\"It was the lovable qualities in the greatest boons to the American Reed and James Carroll to expose their<br />\nologist, Waldeyer, Bauman, von Reck- of students, research workers, and<br />\nmillions of Americans is incallinghausen, Ehrlich, and Flugge.<br />\nWelch and in Osler that unified the people, especially to the people of lives in the effort to combat the menace<br />\nculable, makes us marvel at his But after studying at Strasbourg and benevolent corporations. No man<br />\nof yellow fever.<br />\nmedical profession of Maryland.\" the Southern continent.\" \"<br />\nunselfish<br />\nthan<br />\nhe<br />\nand<br />\ncould<br />\nbe<br />\nmore<br />\nindividuality all the more.<br />\nLeipzig, he abandoned his original in4<br />\n!<br />\n*<br />\nPublic health has become, of late, sub*<br />\n* * *<br />\ntention of working with the great Berlin no one's judgment was wiser.<br />\nject to a sort of passive acceptance as an<br />\n\"He was delightful as a comrade<br />\n\"Foremost Citizen\"<br />\n\"Human And Humane), institution very much as eternal and everFor, even if he were to be master of pathology, Virchow, and followed the advice of his teacher, Ludwig, and friend, owing to his universal<br />\nDR. J. M. T.'FINNEY, SR.,<br />\nDEAN E. W. BERRY, College with-us as the weather—it has become<br />\nstripped of all other of his count- going to the University of Breslau.<br />\ninterest and his lack of thought of president of the Maryland Medical of Arts and Sciences:<br />\nsuch an integral part of our culture as<br />\nless merits, there would always There he worked with the brilliant young<br />\nself. He will be remembered by and Chirurgical Faculty:<br />\n\"I like to think of Dr. Welch as to be almost completely unnoticed. Forremain to him that benevolent and experimental pathologist, Cohnheim,<br />\ncountless people, each of whom<br />\n\"In the passing of Dr. William one of the greatest of Americans, gotten are those long dusty centuries of<br />\nOlympian personality .w h ich around whom were gathered a group of<br />\nfilth and pestilence which started with<br />\nprobably owes him a debt of grati_ Henry • Welch, the science of med- not because of his admittedly great<br />\nthe<br />\nbeginning of human aggregates and<br />\ncaused others in all walks of life men who later became highly distin* * *<br />\ntude.\"<br />\nguished.<br />\nicine in America has lost its most contributions to medical research loathfully threatened the cleanliness of<br />\nhearts<br />\n-as<br />\nin<br />\ntheir<br />\nto enshrine him<br />\nillustrious exemplar. His loss will and teaching, but because of his our own twentieth. All that time, men<br />\n\"Progressive Influence\",<br />\none of them. To the poor man<br />\nJOSEPH<br />\nCOLT<br />\nDR.<br />\nBLOODbe felt not alone in this country, for humaneness and humanity, and be had become so much accustomed to the<br />\nDaniel Coit Gilman, the first president<br />\nwhose existence and happiness he<br />\nof the Johns Hopkins University, had GOOD, adjunct professor of sur- his reputation for scholarship and cause of the full life he led, which presence of putrefaction that they were<br />\ndirectly affected he must have gone to Europe in search of a master of<br />\npractically callous to it and only had a<br />\ngery at the Hopkins, who was as- learning was world_wide.<br />\nBalti- was appropriately crowned with dim<br />\ncognizance of its presence when half<br />\nbreathed forth the final refreshing the new medicine to serve as a keystone<br />\nsociated with Dr. Welch since May, more has lost her foremost citizen. honors of all kinds. I doubt if any the community would be swept away.<br />\naroma of a rapidly putrefying so- of the Hopkins medical faculty, then in<br />\n1892:<br />\nThe Johns Hopkins Hospital and, man of his generation had so many What men like Dr. Welch have accomcial order. The connoisseurs of the process of organization. Cohnheim<br />\n\"He was the greatest influence of Medical School, of which from their friends, or deserved them as much plished within the last fifty years in alasked<br />\nhim<br />\nwhy<br />\nhe<br />\nlooked<br />\nin<br />\nEurope,<br />\nthe fine arts and the sciences<br />\npointing out the rising young New Eng- any single individual toward tre_ earliest beginnings he has been the as did Dr. Welch, and I am happy most completely reversing the condition,<br />\nwhile constantly feting him could lander for the position. Thus in<br />\nyou can only appreciate when you visit<br />\n1884 mendous upward progress in this driving spirit, will sorely miss his to be numbered among them.\"<br />\nsuch havens as the Arabs infest in northtake just pride in the fact that he Dr. Welch, then 34 years old, came to<br />\n* * *<br />\ncountry in medical education, and in wise counsel. It will be difficult to<br />\nern Africa and when you sniff the squalid<br />\nsymbolied the glorious outcome Baltimore and to the Hopkins as Baxley<br />\nmedical research he was the out- think of Johns Hopkins without Dr.<br />\n)!<br />\n'streets<br />\nof New York's lower East Side.<br />\nHeart<br />\n\"Kindly<br />\nprofessor<br />\nof<br />\npathology.<br />\nof their secret dreams and matestanding<br />\nconsultant<br />\nin<br />\nall<br />\nmedical<br />\nWelch.<br />\nHe<br />\nwas<br />\n,<br />\nthe<br />\nJohns<br />\nHopDR. JOHN C. FRENCH, LiThe trustees of the University had inrial assistance.<br />\nkins. The great hosts of his for- brarian of the Johns Hopkins Uni_<br />\nvited plans for the development of the problems in this country.<br />\nBut of all the ingredients of Dr.<br />\nHis brother scholars, many of medical school; and<br />\n\"The sooner the people of this mer pupils will carry the image of versity:<br />\nit was Dr. Welch's<br />\nWelch's popular acclaim, I believe the<br />\nwhom achieved prominence in plan, charting the course which was to country realize this they will<br />\nplace their old master forever deeply<br />\n\"Although Dr. Welch was more most important is that which grants tillll<br />\ntheir respective fields only less revolutionize medical education in this in Washington a suitable monument graven<br />\non their hearts and lives. intimately associated with the Hos- the title of \"leaven of American medioutstanding than his own, looked country, which they accepted. The ideas to mark what this man, the<br />\ngreatest His like will not soon be seen pital and the Schools of Medicine cine.\" When Dr. Welch set out on his<br />\nfar-flung career, medicine was a type Of<br />\nto him automatically as their na- set forth in this plan for the future de- medical mind, has done for them. again.\"<br />\nvelopment of the Hopkins, created conand Hygiene than with the depart_ esoteric art. Dr. A. K. Bond, in comtural leader. He represented in sternation in the<br />\n* * *<br />\nmedical profession, Combined with this great interest in<br />\nments at Homewood, he was keenly menting on the practice of the period,<br />\ntheir eyes the heights to which a which did not then regard medicine as a medicine was lovable, affectionate<br />\nin all the activities of the says, \"The long knife of my prize case<br />\n\"Guiding<br />\ninterested<br />\nSpirit\"<br />\nman could lift himself; they con- science, but as an art. But Dr. Welch's and unselfish nature. He has been<br />\nutilize<br />\nDR. W. G. McCALLUM, Dr. University and his death is a per- I tried, by blunting its point, to<br />\nsidered it a priceless privilege to superior wisdom won out: henceforth the performing kind deeds, and kind<br />\nfor a table carving knife; for it was of<br />\nWelch's successor as professor of sonal loss to the entire Homewood<br />\nthe finest steel, shaped to pierce the hip<br />\nbe associated with him. They physician who decided to forego practice thoughts upward into a few days of<br />\npathology<br />\nat the Hopkins:<br />\nand<br />\ninterval<br />\nbetween<br />\ndevote<br />\nhimself<br />\nto<br />\nthe<br />\nresearch<br />\nwas<br />\nIn<br />\nno<br />\nfaculty.<br />\nand cut outward quickly before the parecognized in him the kindred<br />\nhis death, when he became uncon_<br />\nlonger regarded as an eccentric.<br />\n\"With the death of Dr. Welch the resignation of President Rem_ tient had time to bleed to death; but<br />\nspirit of a smouldering passion<br />\nIn 1889, the same year that the Johns scious. America owes him the we who have been his students feel sen in 1912 and the installation of. housekeepers have prejudices, and today<br />\nfor and devotion to the great sci- Hopkins Hospital opened with Dr. Welch greatest tribute that can be given<br />\nthat we are left without the source President Goodnow in the autumn it lies in its case unused.\" Now, although a<br />\nentific ideal, and this in itself was its first pathologist-in-chief, Sir William any one of her greatest citizens.\"<br />\nof<br />\nwisdom and inspiration to which of 1914, Dr. Welch, as chairman of there are still distant horizons to work<br />\nfor the aesthetic, adventurous quality ni<br />\nsufficient to insure their lifelong Osler, Dr. William S. Halstead, and Dr.<br />\n* * *<br />\nwe have so long had access. For this the Administrative Committee, was the practice has for the<br />\nHoward A. Kelly joined him here in<br />\npart passed;<br />\nfidelity and friendship.<br />\n\", country and indeed the world his the chief executive officer of the and a safer and sanermost<br />\nBaltimore, forming the famed \"Big Four\"<br />\n\"Outstanding<br />\nTeacher<br />\nhas rescience<br />\nAnd to the aspiring young stu- around whom the Hopkins Medical School<br />\nDR. THOMAS C. CULLEN, death means the loss of a great University. He was instrumental placed it—much to the joy of all condent he unconsciously served as a was built. Out of this schoot, the first of professor of gynecology at the guiding spirit in niedicine and all<br />\nin carrying into effect Sir William cerned.<br />\nstimulant and an inspiration. In- its kind in America, came the deans and Hopkins, Who was associated with that concerns public health.<br />\nand Lady Osler's generous endow- Fresh from the European incubator Of<br />\nstructors referred to him as typi- leaders of Atnerican research—pupils of Dr. Welch for many years:<br />\n\"But this wonderful personality ment of the Tudor and Stuart Club, a new medical science, of a light valid'<br />\nmagic<br />\nfying the best and noblest in man, Welch himself and Osler, Halstead, Kelly,<br />\n\"William H. Welch came on the will remain ever in our memories and when in 1931 the inadequacy of flooded the age-long darkness and<br />\nHowell, and Abel, all his appointees to<br />\nback<br />\nt°<br />\nof<br />\nhealing,<br />\nDr.<br />\nWelch<br />\ncame<br />\none Whose life's story could be a faculty the like of which had never medical horizon just when the op- as an ideal toward which we<br />\nmay our book_fund led to the organiza- America and served as the bull-dog cif<br />\ntaken as a literal embodiment of been assembled in this country.<br />\nportunity for, scientific work was strive, and the world will realize tion of the Friends of the Library bacteriology on these innocent plains'<br />\nThe remainder of his life was one great ripe. His training both in<br />\nacademic satiety. What other<br />\nthis that it has been enriched by his at Homewood, Dr. Welch was one Recognized by President Gilman, th9t<br />\nbut an uplifting effect could such triumph for Dr. Welch—\"he had his country and abroad had been un_ life.\"<br />\nto tile<br />\nof the founders, giving hearty sup- genius at finding genius, he camehere<br />\napotheosis while living.\" Tirelessly cona tribute carry with itself?<br />\nHopkins, and took his quarters<br />\n* * *<br />\nusually<br />\nthorough,<br />\nand<br />\n.<br />\nbefore<br />\nhe<br />\ntinuing his labors for the advancement of<br />\nport which a less unselfish man Baltimore.<br />\nIII<br />\nscientific medicine, his greatness was reached the Johns Hopkins Univerwould have reserved for the special<br />\n\"Medical Pioneer\"<br />\nWith an ubiquitous inspiration, .he<br />\nThe shades of Osler, Halstead, universally recognized. and he gained sity he was well and most favorably<br />\nDR. DEAN LEWIS, surgeon- library which bears his name.<br />\nspread<br />\nthe new gospel among his PtiPlis.<br />\nGilman, Sylvester, Rowland and honors on every side. In 1930 Dr. known by the leaders of medical in_chief at the Johns Hopkins Hos\"He will long be remembered, At the same time, he revolutionized tile<br />\nWelch's<br />\n80th<br />\nbirthday<br />\nwas<br />\nthe<br />\noccasion<br />\nRemsen have already received<br />\npital:<br />\nand for many things. To those at structure of medical 'education, laY111,g<br />\nof a birthday celebration in all parts thought, both here and abroad.<br />\nhim into their midst.. One more<br />\n\"It was my rare privilege to have<br />\n\"He was the greatest figure in Homewood who were fortunate novel stress on the experimental. A;<br />\nof the world, and all that scientific men<br />\nimposing figure has departed from could do to show their appreciation and been more or less closely associated medicine in this country. He has enough to know him personally, an teaching ability, his numerous, fertile?<br />\ndesign f°`<br />\nthe Hopkins scene, leaving it in- gratitude was done.<br />\nwith him since 1891. His former been particularly great in outlining outstanding characteristic was his contacts, his doctrines, his<br />\nthe new ‘schooling—all have immeasur;<br />\nfinitely the sadder and the poorer. And now his earthly life is over. But pupils are now the leaders of medi_ medical teaching. Besides, his in- instinctive kindness of heart and<br />\nably contributed to a more comPeterld<br />\nYet the indominatable spirit of there will always remain the monument cine all over the United States. The fluence has been felt throughout the the breadth of his interests and sym_ yearly harvest of young healers. An<br />\nDr. Welch still exists among us. of modern medicine he did so much to genial dean of American medicine world, in addition to influencing pathies. These qualities won him there lies his great contribution. FP)/11<br />\nbuild, the bulwark for the benefit of<br />\nsomething low and undeveloped, he OP<br />\nHis is a deathless life; his very<br />\nmankind which stands in memory of \"the sleeps, but he will long live in the medical teaching, more than any friends in all parts of the world plied the leaven to raise it into that loft)<br />\n;<br />\nmention will urge us onward and great architect of American medicine, a hearts and minds of the myriads he one else in developing preventive and made the influence of his perstructure that is modern medicine in til<br />\nupward to greater achievement.<br />\nman whose life is an epic.\"<br />\nhas taught.<br />\nmedicine, which has been one of sonality widespread and enduring.\" New World.<br /><br />\nHOMEWOOD, BALTIMORE, MD., MAY 4, 1934.<br />\n••••<br /><br />\n)r. J. J. Abel<br />\nHonored With<br />\nKober Medal<br /><br />\nYes Sir-Old Gebby<br />\nPlayshop To Give Dr. Robinson Finds Inscription<br />\nStringing<br />\n'Hedda Gabler' At<br />\nhus Excavations Keeps<br />\nOlynt<br />\nOf<br />\nSite<br />\nAt<br />\nThe Boys Along<br />\nSalisbury Normal<br /><br />\nand sent on their way to the National Composers' contest by their<br />\nhopeful originator.<br />\nAll Gebby did was to annex two<br />\nsecond prizes in a field of 1,500<br />\ncompetitors, this in spite of the fact<br />\nthat he is generally conceded to<br />\nhave won more than his share of<br />\nprizes in the past. He was awarded the runner-up honors for his<br />\nmandolin solo and for one of the<br />\ntwo Hawaiian guitar solos which he<br />\nentered.<br /><br />\nAgain our local musical pride,<br />\n(Continued from Page 1, Col. 4) found, made out of the natural pebOf Famous<br />\nhill-coun<br />\nsurrounding<br />\nMr. Conrad Gebelein, has thumbed<br />\ntogether. bles of the<br />\nIbsen Play By Hopkins Group In have been found buried<br />\nrecent of these mo- his way to fame. This time the<br />\nmost<br />\nThe<br />\ntry.<br />\nA beautiful, painted tomb, un•etired Hopkins Pharmacolo- February Was Well Received<br />\nsaics is filled with inscriptions such noted fretted-instrument player's<br />\nof some famous<br />\nthat<br />\ndoubtedly<br />\nLong<br />\nFor<br />\ngist Is Rewarded<br />\nas `Success to the beautiful\" and thumbing was necessarily limited to<br />\nOlynthian, was uncovered. The<br />\nMedical, Research Service Hedda Gabler, with the original excavators have found five more of \"Achievement is a goodly thing.\" \"picking\" out harmonious notes and<br />\ncast, will be presented by members<br />\nsetting them down on paper, after<br />\nStaff Includes Hopkins Men<br />\nthe mosaics, which have already<br />\nthe<br />\nJohns<br />\nHopkins<br />\nPlayshop<br />\ntoprowhich they were duly touched up<br />\nretired<br />\nAbel,<br />\nJacob<br />\nJohn<br />\nDr.<br />\naroused much interest in the scholBesides Professor Robinson the<br />\nin<br />\nmorrow<br />\nthe<br />\nof<br />\nauditorium<br />\nthe<br />\nfessor of pharmacology of the<br />\narly and artistic world, and many staff consists of Dr. J. Walter GraSalisbury Normal School.<br />\nSchool,<br />\nMedical<br />\nfig- ham and Dr. Paul Clement, both<br />\nJohns Hopkins<br />\nThe Ibsen play was produced by more of the graceful Olynthian<br />\nPh.D.'s of the Johns Hopkins Univvas awarded the Dr. George M. the Playshop in February and was urines and vases.<br />\nversity; Dr. Joseph De Waele of<br />\nstarted<br />\nfirst<br />\nof<br />\nRobinson<br />\nAssociation<br />\nProfessor<br />\nober Medal by the<br />\nso well received that two extra perand<br />\nAmerican School in Athens and<br />\n1928,<br />\nthe<br />\nin<br />\nOlynthus<br />\nA merican Physicians, last Wed- formances were required and the excavating at<br />\nor in Holland; Miss'Eleexcaof<br />\n.profess<br />\na<br />\ncampaign<br />\ngroup was invited to come to Sal- this is his third<br />\nnesday.<br />\nof Syracuse University;<br />\nLay<br />\npubanor<br />\nalready<br />\nvation there. He has<br />\nisbury.<br />\nPresentation of the award took<br />\nPackard, a BaltiElizabeth<br />\nfinds,<br />\nMiss<br />\nhis<br />\nlished eight volumes on<br />\nMiss Jordan, Heroine<br />\nplace at Atlantic City, N. J., as part<br />\nof Bryn<br />\ngraduate<br />\na<br />\nand<br />\nvases, terra-cottas, morean<br />\nThe cast is headed by Miss Fran- including coins,<br />\nof the exercises marking the 49th<br />\nMr. Saul<br />\nand<br />\nTravlos,<br />\nMr.<br />\nMwr;<br />\nbronzes, and mosaics.<br />\nannual meeting of the medical as- ces Jordan, 'who plays the part of<br />\nWeinberg.<br />\nHedda, an attractive but impoverUncover Early House<br />\nsociation.<br />\nOlynthus is located near Saloniki,<br />\nished society woman. Unable' to<br />\nPerhaps the most important re- and is in the center of a country<br />\nLauds Service<br />\nmarry within her own set, Hedda<br />\nthe expedition is the dis- which suffered from a severe earthDr. Charles Wallis Edmonds, of becomes the wife of a poor, dull sult of<br />\nthe houses he is bringing quake a few years ago.<br />\nof<br />\ncovery<br />\nthe University of Michigan,, made scholar, played by Robert Gill.<br />\n211-213 E. Baltimore St.<br />\nwere the first. houses<br />\nThese<br />\nlight.<br />\nto<br />\nthe official presentation. He praised<br />\nThe other members of the cast of classical Greece dating before<br />\nDr: Abel's long period of service to include Patty Singewald, Helen<br />\n348 B. C. to have been discovered.<br />\nou3medicine and mentioned as his!<br />\nUsherfeld, Isabel Idov, David Lov- They are arranged in rows in city<br />\nstanding achievement, his work in ett, and Bunt Royce. The producFLORISTS - - DECORATORS<br />\nmuch as they are in modern<br />\nMembers, F. T. D Asso., Inc.<br />\nthe \"crystallization of insulin and tion is directed by Dr. N. Bryllion blocks<br />\nthe floor's are covered<br />\nand<br />\ncities<br />\nBALTIMORE, MD.<br />\n1918 N. CHARLES ST. VEr. 0573<br />\nstudy of its chemistry.\"<br />\nFRANKLIN STREET near HOWARD<br />\nFagin.<br />\nwith mosaics, the earliest ever<br />\nGarage<br />\nRooms—$1.50 Up<br />\nSecond Largest Stage<br />\nThe medal is awarded annually<br />\nTap Room Open from 10:30 to 2 P. M.<br />\nIt<br />\nservice.<br />\nmedical<br />\nd<br />\nfor distinguishe<br />\nThe stage at Salisbury on which<br />\nNO MINIMUM CHARGE<br />\nNO COVER CHARGE<br />\nWas founded nine years ago in Hedda Gabler will be presented is<br />\nSwimming Pool, Gymnasium, Private Rooms and Banquet Halls for<br />\nAll Occasions.<br />\nCALVERT and 30TH STS.<br />\nPrinters of<br />\nhonor of Dr. George M. Kober, reported to be the second largest in<br />\nPINKARD, Manager<br />\nScientific<br />\nC.<br />\nt<br />\nW.<br />\nin<br />\nand<br />\nFirst<br />\n—<br />\nPhilological<br />\nQuality<br />\nin<br />\nFirst<br />\ndean of the Georgetown University the East, being exceeded in size<br />\nPublications<br />\nService<br />\nARABIAN NIGHTS CLUB available for Fraternity Dances.<br />\nMedical School.<br />\nonly by the stage of the Hippo- 12-20 HOPKINS PL. BALTIMORE<br />\nI\\To delivery too small Bel. 53181<br />\ndrome Theatre in New York City.<br />\nOriginal Production<br /><br />\nBacks<br /><br />\nare the bi features in<br />\ncollege men's suits this<br />\nSpriq—prices from<br /><br />\n25<br /><br />\nKATZ CLOTHES<br /><br />\nI A. RITTER &amp; SON, INC.<br /><br />\n411.<br /><br />\nCONGRESS HOTEL<br /><br />\n0...•••o ••••• 410.•4•••••••••••••••••••........•••••••••••••••••••••••••1<br /><br />\nI H. FURST CO.<br /><br />\nI<br /><br />\nPeabody Pharmacy<br /><br />\n••••••••••••••••<br /><br />\n•••••••••••••....•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••<br /><br />\nPhi Beta Hears<br />\nNoted Scientist<br /><br />\nbin<br />\nrne<br />\nas<br /><br />\n,rof<br /><br />\nth<br />\nnd<br />\nof<br />\nen<br />\nhe<br /><br />\nre<br />\n11f<br />\nL.<br />\nli-<br /><br />\nii-<br /><br />\n)11,<br />\nsit<br />\n11-<br /><br />\nlid<br />\nie.<br />\n)r.<br />\nhe<br />\nmu<br /><br />\ndiof<br />\ntry<br />\n)d,<br />\nLse<br />\nize<br />\nof<br />\n)aAlt<br />\nlaY<br />\ngil<br /><br />\n(Continued from Page 1,'('o/. 2)<br />\nfacts through research, Dr. Merriam stated. The scientist must be<br />\nable to interpret what he has learned<br />\nby turning the spot light upon it<br />\nand pointing out \"the harmonious<br />\nrelation of an object to its environin mt.\" His ability to report what<br />\nhe has examined may be taken as<br />\na test of whether or not the scientist has seen an object as it really is.<br /><br />\nan<br /><br />\nInitiate 37 Hopkins Students<br /><br />\nand FIRM<br />\nACKED that's why<br />\nfind Luckies do not dry out<br /><br />\nAs for art needing science, Dr.<br />\nMerriam explained that the greatest artists and men of letters have<br />\npainted nature as the scientist sees<br />\nit. \"Art is today recognizing that<br />\nthe doors are being opened wide by<br />\nscience, and if science is wise<br />\nenough to bring art into its camp,<br />\nWe may witness some remarkable<br />\ndevelopments in coming years.\"<br />\nIn addition to the 37 Hopkins<br />\nstudents who were initiated at the<br />\nannual ceremonies, Dr. Lawrence<br />\nMisbach, of Northwestern University, and Miss Marjorie Eunice<br />\nGooch of the University of Maine<br />\nwere inducted into the honorary<br />\nfraternity having been elected at<br />\ntheir respective universities. Both<br />\nare doing research work here.<br /><br />\nLuckies use the mildest tobaccos—for<br />\nLuckies use only the clean center leaves<br />\n—and these are the mildest leaves.They<br />\ntaste better. Then science plays its part<br />\nin making these choice tobaccos truly<br />\nkind to your throat. “It's toasted\"—for<br />\nthroat protection. These mellow, finetasting tobaccos are cut into long,<br /><br />\nOfficials Suggest<br />\nPres. Ames For<br />\nU. S. Air Board<br /><br />\n)rk<br />\nOf<br />\n!Cl ;<br />\nre'<br />\n1l<br /><br />\nof<br />\nich<br />\ngic<br />\nto<br />\nof<br />\nS.<br />\nlist<br /><br />\nthe<br />\nin<br />\nbe<br />\nils•<br />\nthe<br />\njng<br /><br />\nJiS<br /><br />\ntile<br />\nfor<br />\nerit<br />\nLod<br />\n0111<br />\nLIP<br /><br />\n,ftY<br /><br />\nthe<br /><br />\nsilky, full-bodied shreds and fully<br />\npacked into every Lucky—so round,<br />\nso firm, free from loose ends. That's<br />\nwhy Luckies \"keep in condition\"—<br />\nwhy you'll find that Luckies do not<br />\ndry out, an important point to every<br />\nsmoker. You see, always in all-ways<br />\n—Luckies are kind to your throat.<br /><br />\n••:•.1<br /><br />\nUrging the appointment of some<br />\nMarylander to the proposed national commission to !study the entire<br />\nfield of aviation in the United<br />\nStates, Senator Tydings and Representative Cole of this state made<br />\na recommendation to President<br />\nRoosevelt this week of those men<br />\nWho would be most acceptable.<br />\nPresident Joseph S. Ames, who is<br />\nchairman of the National Advisory<br />\nBoard for Aeronautics, was among<br />\nthe four named by the Congressmen.<br />\nAsserting that Maryland, and<br />\nBaltimore in particular, are leading other communities in aviation<br />\nmanufacture and development, the<br />\nrecommendation said of the four<br />\nrnen suggested: \"We earnestly urge<br />\nthe choice of one of these, or his<br />\nselection would be an eminently<br />\nOutstanding one and his contribution<br />\nto the cause one of value.\"<br /><br />\n••<br /><br />\nOnly the Center Leaves—these are the Mildest Leaves<br />\ncopyright, 1934, Tho Amerlcm;Tobacco Company.<br /><br />\ncaS 7k7S4<br /><br />\nHOME WOOD, BALTIMORE, MD., MAY 4, 1934.<br /><br />\n4,<br /><br />\nTENNIS TEAM BEATS GEORGETOWN<br />\nStickmen Face Trackmen Play<br />\nINDELL<br />\nSW<br />\nBASEBALL<br />\nHost To Catholic<br />\nPennsylvania Team Tomorrow First playing lacrosse at the Gil- Netmen Bow To Princeton In First Battle of Trip<br />\nNext Wednesday the informal<br />\nman Country School under the tubaseball team meets its first real<br />\nAt Homewood Jays Will Attempt To Cap- telage of Coach Ned Dukehart, a<br />\nsky added another scalp to his belt<br />\ncompetition in a practice game with<br />\nJays Face Breather For Second Successive Week; Entire Squad To Be Used<br />\nFor the second Consecutive week,<br />\nCoach Van Orman will pit his<br />\ncharges against an opponent which<br />\nis capable of offering little more<br />\nthan a workout for the title-bound<br />\nUn,iversity of PennsylJay ten.<br />\nvania will be the foes at Homewood<br />\ntomorrow.<br />\nTomorrow's game may see the<br />\nreturn of George Packard to the<br />\nBlack and Blue fold at his usual<br />\ncenter position. Packard has not<br />\nbeen out for lacrosse due to intensive work on his graduation thesis.<br />\nGeorge appeared as soon as his<br />\nstudies were completed and will<br />\nprobably see action Saturday. His<br />\nreturn to the Hopkins ten will<br />\ngreatly enhance their chances<br />\nagainst Maryland and St. John's.<br />\nRegulars Back<br /><br />\nHenry Beeler, Pete Reynolds,<br />\nand Charley Orth, who missed the<br />\nSwarthmore fray because of the geology trip, will also be in the starting line-up tomorrow.<br />\nSo far this year the stick play of<br />\nPenn has been mediocre and powerless. They opened their current<br />\nseason- by defeating their Alumni,<br />\n3 to 2. They then lost to Lehigh<br />\nand were swamped by Navy. On<br />\npaper the Jays seem to be in for<br />\nanother breather, but as all the<br />\nnorthern teams point for the Hopkins game, an interesting battle will<br />\nprobably be in store for the spectators.<br /><br />\nture Their First Victory<br />\nOf The Current Season<br />\nFacing Catholic University at<br />\nHomewood in their fourth meet of<br />\nthe season tomorrow, the Jay track<br />\nteam will attempt to capture its initial victory of the year.<br />\nThe Black and Blue so far has<br />\ndropped encounters to Swarthmore<br />\nand Delaware and has been tied by<br />\nHaverford. The margin of defeat in both cases, however, was<br />\nextremely small and the contest on<br />\nSaturday is expected to be just as<br />\nclose as the preceding ones.<br />\nHopkins has met Catholic U. for<br />\nthe last four years, with the Jays<br />\nwinning in 1930 and last year, and<br />\nCatholic U. triumphing in 1931 and<br />\n1932. Last season, the Washingtonians had only an informal squad,<br />\nbut the sport has been revived and<br />\nit is thought that they will present<br />\ntheir constomarily powerful aggregation.<br />\nCatholic U. has shown its greatest strength in the field events,<br />\nwhile Hopkins is favored to win the<br />\ndistance runs.<br /><br />\nAdvice To Car Owners<br />\nA successful remedy to prevent<br />\nautos from cavorting around streets<br />\nwithout consent of the owners has<br />\nbeen placed in use at Southern<br />\nMethodist University.<br />\nA cardboard notice was found<br />\nrecently hanging on one of the cars.<br />\nIt read:<br />\n\"You are welcome to borrow this<br />\ncar, but please have it back at the<br />\ntime agreed above. Please put in it<br />\nat least as much gas as you use.\"<br /><br />\nformer Hopkins lacrosse star, it<br />\nwas natural for Philip Wilson<br />\nSwindell, better known as Pete, to<br />\ncome to Hopkins upon his graduation from Gilman.<br />\nBesides being on the stick team<br />\nat Gilman, Swindell also attained<br />\nfirst string berths on the football<br />\nand basketball teams. In his last<br />\nyear Pete captained the Indian team,<br />\nand held down a berth at wing defense.<br />\nSwindell has made a favorable<br />\nshowing for himself, considering<br />\nthe fact that this is his first year<br />\nhere. Last fall he proved himself<br />\nto be a valuable cog in the Hopkins<br />\nfootball team.<br />\nIt was during the Mt. Washington clash that Swindell distinguished himself as wing defense.<br />\nHe and Pasarew saved the day for<br />\nHopkins by stopping the threatening onslaught of Lorne Guild, Hillman star.<br />\nWith the Wolfpack pelts hanging on our belts, says Pete, our two<br />\nremaining threats are St. John's<br />\nand Maryland. Although both the<br />\nTerps and the Johnnies have been<br />\ntaken into camp by the Hillmen,<br />\nthey are still dangerous contenders<br />\nfor the national stick title.<br />\nSwindell bids fair to become one<br />\nof the country's most outstanding<br />\nstickmen in his three remaining<br />\nyears of lacrosse at Hopkins.<br />\nWILL THE PERSON who borrowed<br />\nthe small vacuum cleaner from<br />\nLevering Hall some time Monda)<br />\nplease return it immediately?<br />\nHolmes will have to pay for it.<br /><br />\nPrinceton University defeated the<br />\nJohns Hopkins tennis team 9-0 at<br />\nPrinceton Wednesday afternoon on<br />\nthe first wing of the Jays' northern<br /><br />\nwhen he trounced Sendel, a former<br />\nmember of Mexico's Davis Cup Gilman Country School. The game<br />\nteam, in straight sets.<br />\nwill be called at about 4:30 at GilFace Army Tomorrow<br />\nman and will be short because of<br />\ntrip.<br />\nTomorrow the journeying Jay<br />\nthe lateness of starting.<br />\nThe Tiger racqueters, coached by<br />\nteam will encounter Army and<br />\nThe Hopkins squad has been<br />\nMercer Beasley, had little trouble in should give the Cadets a close run<br />\nfor three weeks and is<br />\npracticing<br />\nwinning all of the matches. Ladensky<br />\nfor a victory.<br />\nanxious<br />\nto<br />\nBlack<br />\nsee action. A diamond<br />\nthe<br />\nfor<br />\nshowing<br />\nbest<br />\nmade the<br />\nThe probable line-up for Hopin<br />\nDruid<br />\nHill<br />\nPark is used for<br />\nfive<br />\nwinning<br />\nsingles,<br />\nand Blue in the<br />\nkins in the singles include Brooke,<br />\non<br />\nworkouts<br />\nwas<br />\nWednesday, and<br />\ngames in the two-set match. He<br />\nSiverd, Hartman, Ladensky, Blum,<br />\ndefeated by Tilden.<br />\nIn the doubles, Thursday from 4:00 to 6:00.<br />\nand Needle.<br />\nAt present V. C. Kelly is treasBrooke and Siverd, Blum and Mcurer<br />\nLaden-manager of the club and Bill<br />\nand<br />\nand<br />\nHartman<br />\nGregor,<br />\nBefore starting on their northern<br />\nHazlett<br />\nacts as manager-coach.<br />\nsky<br />\nplay.<br />\nto<br />\nare<br />\nslated<br />\ntrip the Hopkins tennis team defeated Georgetown in a close en- Iccounter, five matches to four. The<br />\nrivals split the singles contests but<br />\nthe Jay netmen won two of the<br />\nthree doubles matches to clinch the<br />\ncontest.<br />\nPlay was close in every match.<br />\nThree of the contests went into extra sets, and six sets went into extra<br />\ngames. Morgan Jacobs, former<br />\nMaryland state junior champion,<br />\ndefeated Cliff Siverd in an interesting three-set match. Brooke, Jay<br />\nCrowley,<br />\ncaptain, won from<br />\nGeorgetown 'ace, in another extra<br />\nset match that was productiVe of<br />\nsome good tennis. Milton Laden-<br /><br />\nTHE EMERSON HOTEL<br /><br />\nPhone Belmont 7908<br /><br />\nBIRELY'S<br />\nPHARMACY<br />\nST. PAUL at 33RD STREET<br />\nYour Neighborhood Drug Store<br /><br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br /><br />\nBALTIMORE, MD.<br />\nPrivate Rooms and Banquet Halls<br />\nfor All Occasions<br />\nCuisine and Furnishings<br />\nUnexcelled<br />\nRooms,$3.00 up<br /><br />\nAutos Garaged<br /><br />\nThe way tobacco is cut has a<br />\nlot to do with the way Chesterfield<br />\nburns and tastes<br />\nThere are many different ways<br />\nof cutting tobacco.<br />\nA long time ago,it used to be<br />\ncut on what was known as a<br />\nPease Cutter, but this darkened the tobacco, and it was<br />\nnot uniform.<br />\nThe cutters today are the<br />\nmost improved, modern,up-tothe-minute type. They cut uniformly, and cut in long shreds.<br />\nThe tobacco in Chesterfield<br />\nis cut right—you can judge for<br />\nyourself how Chesterfields burn<br />\nand how they taste.<br />\nEverything that science knows<br />\nis used to make Chesterfield<br />\nthe cigarette that's milder...<br />\nthe cigarette that tastes better.<br /><br />\nthe cigarette that's MILDER<br />\nthe cigarette that TASTES BETTER<br />\n1934, LIGGETT &amp; MYERS TOBACCO CO.<br /><br />"}], "field_media_file": [{"target_id": 38842, "display": null, "description": null, "target_type": "file", "target_uuid": "02834985-d9fb-48d3-95a3-651a9aa7f9a5", "url": "http://digital.library.jhu.edu/system/files/2022-03/12519-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12519, "target_type": "node", "target_uuid": "c2c1e517-7fcf-4dde-9b81-2a32cc2524c3", "url": "/node/12519"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "6702e4d8-9c5e-47bd-bc8f-54f5db7142ae"}]}