{"mid": [{"value": 36839}], "uuid": [{"value": "5aa4ec8b-0e96-42da-9b0a-f127c3f938ee"}], "vid": [{"value": 36839}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13055-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 41<br />\n<br />\nBALTIMORE, MD., MARCH 23, 1923<br />\n<br />\nJUNIOR PROM TO BE HELD<br />\nDR. MAGOFFIN ACTIVELY<br />\nTONIGHT IN CIVIL ENGIENGAGED IN HOPKINS<br />\nNEERING BUILDING<br />\nACTIVITIES<br />\nFisher's<br />\nOrchestra to Furnish MuWas Phi Beta Kappa. Won \"H\"<br />\nsic.<br />\nElaborate<br />\nDecorations and<br />\nin Football and Baseball.<br />\nFavors<br />\nPrepared<br />\nY. M. C. A. President<br />\nWith<br />\nthe<br />\nallotment<br />\nof 85 tickets,<br />\nMagoffin,<br />\nwho<br />\nDr. Ralph V. D.<br />\n1 Don't take No for an answer—half the time the other fellow is trying you out to see what<br />\ndepartwhich<br />\nwere<br />\noffered for sale, pracwas appointed head of the<br />\nyour number is.<br />\nment of classics at New York Unitically disposed of, the committee<br />\n2 Don't be afraid to ask for the sale—if you're afraid to sell it, of course, the other chap will<br />\nversity before he learned of his sebe afraid to buy.<br />\nfor the Junior Prom and the perlection as president of St. John's<br />\n3 Don't fall for the bird that wants to wait until Yale, Harvard, Pennsy and Princeton are all<br />\nsons who expect to attend are<br />\non the same schedule—make him come through now.<br />\nCollege, has always been most acawaiting the hour for the beginning<br />\n4 Don't expect to sell them all—it cannot be done. Instead see enough prospects to beat your<br />\ntively engaged in Hopkins activquota.<br />\nof the dance. The committee,<br />\nities.<br />\nwill<br />\nresult—believe<br />\nthat<br />\nyou<br />\nland<br />\nwithout<br />\non<br />\nthree<br />\nor<br />\nfour<br />\ncall<br />\ndiscouraged<br />\nif<br />\nyou<br />\nget<br />\n5<br />\nDon't<br />\nwhich is composed of Kennedy,<br />\n\"Flattered as I was by that ofthe next one and go after him harder than ever. They'll sign.<br />\nfer and recognizing the dignity of<br />\nchairman;<br />\nG. M. Shriver, Mount,<br />\n6 Don't slight this proposition. Average one hour per day for a week—the results will surprise<br />\nthe position,\" said Dr. Magoffin<br />\nHamburger, Deavours, Gardner,<br />\nyou.<br />\nearly this week, \"nevertheless my<br />\n7 Don't overlook that lacrosse schedule—it's a peach of a talking point.<br />\nLeopold and Dunning, have comprevious acceptance of the other of8 Don't get worried over the fellow that prefers to see the Orioles—just tell him they won't be<br />\npleted their extensive plans for the<br />\nfer made it impossible for me to<br />\nhome in May.<br />\nProm<br />\nand proclaim everything in<br />\nconsider the St. John's presidency.\"<br />\n9 Don't forget that a full stand makes a strong and confident team.<br />\nreadiness for one of the best dances<br />\nDr. Magoffin expressed his sin10 Don't be a quitter—The world is full of starters—what the world honors is finishers.<br />\ncere regret that in accepting the<br />\never<br />\nenjoyed at Hopkins. The com11 Don't forget to make returns every day so that the score can be kept right up to the minute.<br />\ncall from the New York institution<br />\nmittee expects this year's Prom to<br />\n12 Don't think selling these tickets is work—it's a game and a worth while game at that, so play<br />\nhe must leave Hopkins.<br />\nthe game to win and yuur chan:.:e at the grand prize iz as good as the other fellow's.<br />\ndwarf all pre,<br />\nions ones, and to 2et<br />\n13 Free lance a bit, go after every good looking prospect you see.<br />\n\"Since 1905, when -1- was a grada new standard for \"hops\" held at<br />\n14 Don't forget the college spirit is a deciding factor, it is co-operation \"each for all, all for each\"<br />\nuate student, I have been wholly a<br />\nthe university.<br />\nthat will put this over.<br />\nHopkins man and to leave my uniDecorations have been made un15 Six thousand dollars; six more days. An hour per day gets a thousand a day.<br />\nversity, even to. assume a better<br />\nder<br />\nthe direction of Hamburger,<br />\n16 Can we do it? Show 'em that we can.<br />\nposition and one which offered<br />\nwho was in charge of this departgreatly increased opportunities,<br />\nment of last year's Senior Prom.<br />\nwas a very hard thing for me to<br />\nThose present at that affair will<br />\ndecide upon. Johns Hopkins and STUDENT COUNCIL TAKES DRAMATIC CLUB PLANNING SPRING COMPETITION FOR remember the<br />\nhumorous portrayal<br />\n\"BLACK AND BLUE JAY\"<br />\nTOUR DURING EASTER<br />\nBaltimore have been very kind to UP QUESTION OF LIMITAof the history of jazz done in imSTAFF TO START<br />\nHOLIDAYS<br />\nTION OF ACTIVITIES<br />\nme in these eighteen years and to<br />\npressionistic futuristic paintings.<br />\nleave the students of my classes Council Again Votes Down Peti- Fourteen Men Elected to Member- Men Wanted for Art and Editorial This year the<br />\ndecorations are origand my advisers and the alumni in<br />\nStaffs. Selections Will Be Based inal and unique.<br />\nship in Club. Annual Bantion for New Magazine. Code<br />\nthe city of these two classes, and alon Quality of Work<br />\nquet on March 27<br />\nof Ethics Being Formed<br />\nLouis Fisher's well-known orso to go away from a student body<br />\nThe beginning of spring compe- chestra of five pieces will furnish<br />\nThe Dramatic Club is planning a<br />\nThe Student Council at a meetwhich both as graduates and under- ing held last Monday took up the tour of Washington, Frederick, tition for positions on the art and the<br />\nmusic. Fourteen dances and<br />\ngraduates were doing such fine question of limitation of activities Hagerstown and Cumberland dur- editorial staffs of the Black and<br />\nfour extras have been arranged by<br />\nwork, was extremely difficult. I but could decide on no definite pro- ing the Easter recess, to present its Blue Jay has been announced. Althe committee. Intermission will<br />\nregret that I felt it necessary to gram for its accomplishment. This successful production, \"The Purple though the competition is open to<br />\nbe held and supper served after the<br />\nmake the change,\" Dr. Magoffin limitation was recommended by the Mask.\" Several members of the all four classes, the underclassmen,<br />\neighth dance. Dancing will last<br />\nsaid.<br />\ncast will be on the geology trip at particularly Sophomores, are espe- from nine until one.<br />\n0. D. K. some time ago.<br />\nProfessor Magoffin is leaving at The Student Council goes on the time, but these will be picked cially urged to try out for the staff. The Prom issue of the Black and<br />\nEaster on a lecture trip of several record as favoring the ispirit of up by the club and will take their There are comparatively few men Blue Jay which was released last<br />\nweeks for the Archaelogical Insti- the idea but no plan that has been parts, then return to their geology on the art and editorial staffs at Wednesday will be distributed to<br />\ntute of America, of which he is suggested so far seems to be prac- group. The part of Fouche will present, and it is necessary that the members of the fair sex attending<br />\npresident, and will visit this insti7 tical. Other plans may be drawn probably have to be taken by an un- number be increased. At least four the affair.<br />\ntute's societies on the-Pacific Coast. up later in the year.<br />\nderstudy, as Fred Rich will be prac- men will be taken on before June, The chaperones for the Prom are<br />\nBesides being President of the<br />\nbut there is no fixed limit to the Dr. and Mrs. Goodnow, Dr. and<br />\nAlbert Musher again appeared ticing with the baseball squad.<br />\nAmerican Archaeological! Insti- before the council to solicit its apBusiness Manager West and Art number of positions open. All who Mrs. Latane, Dr. and Mrs. Whitetute, Dr. Magoffin is Associate Ed- proval for the new literary publi- Director Hamburger made a trip do especially creditable work will head, Major and Mrs. Garey.<br />\nitor of the \"American Journal of cation, but it was once more voted to Washington, on Tuesday aft- have an excellent opportunity to<br />\nDue to the limited space in the<br />\nArchaeology\" and the author of down. The principal objections to ernoon, to arrange for a separate make the staff.<br />\nhall, the sale of the tickets has been<br />\n\"A Study of the Topography and the project are that there is no performance at the Central High<br />\nQuality, rather than quantity, restricted and each of the eight<br />\nMunicipal History of Praeneste,\" room on the campus at this time School before Easter. On Satur- will be the basis for judging the members of the committee has been<br />\n\"The Quinquenales,\" and transla- for a publication of this kind as day they will visit Frederick and candidate's work. Selections for allowed to dispose of but ten tickets.<br />\ntions of Grotius' \"Mare Liberum,\" the present papers are,not support- Hagerstown to make arrange- the staff will be made principally Some of the members already reand Bynkershoek's \"Sovereignty of ed as they should be, and also such ments for the first performance of on the quality of the work turned port that all of their tickets have<br />\nthe Sea.\" After graduating from a publication would take from the the tour.<br />\nin; no one has made any of the open been sold. Anyone desiring tickets<br />\nMichigan in 1902 he continued his staffs of the NEWS—LETTER and the<br />\nAt a meeting held in the studio positions as yet.<br />\nfor this affair should procure them<br />\nstudies in Germany and Italy. He Black and Blue Jay men who are last Monday afternoon, fourteen<br />\nAll copy for the \"Spring Fancies immediately. The subscription is<br />\nwa.s in charge of the school of clas- needed for their management.<br />\nmen were elected to membership in Number,\" which will be out on $3.50 per couple.<br />\nsical studies in the American Acaddrawn<br />\nthe club. These elections came as April 20, must be in on April 5.<br />\nA code of ethics is being<br />\nemy at Rome in 1920-1921.<br />\nup by the Student Council and this a result of efforts made in connec- Although the material does not TRIANGULAR DEBATE TODr. Magoffin is a veteran of the will be published as soon as com- tion with \"The Purple Mask.\" The have to bear directly upon the title,<br />\nMORROW<br />\nWorld pleted.<br />\nSpanish-American - and<br />\nfollowing are the new members: contributions dealing with \"spring<br />\nThe<br />\nTriangular<br />\nDebates with<br />\nWars, serving in the latter as a lieuHoward; scenery, fancies\" are preferred.<br />\nProperties,<br />\nWashington<br />\nand<br />\nLee University<br />\ntenant colonel. He is a native of A.S. M. E. HOLDS INSPECTION Gump; business, Summers; tickand the University of North CaroTOUR AND MEETING<br />\nBRESLAU<br />\nTO<br />\nADDRESS<br />\nKansas and after one year at Coopets, Gardner; cast, Passano, Hiss,<br />\nlina, which were originally schedELECTRICAL CLUB<br />\nThe regular monthly meeting of Hess, Morrill, Kennedy, Sachs<br />\ner College, at Sterling, Kan., he enHarold<br />\nBreslau,<br />\na<br />\nsenior<br />\nin<br />\nthe<br />\nuled for March 17, will be held totered business before getting his the Baltimore section of the Amer- and Englsh ; special merit, HenElectrical<br />\nEngineering<br />\nDepartment<br />\nmorrow, March 24, at 8 o'clock.<br />\nA. B. from the University of Mich- ican Society of Mechanical Engi- sel, Desch and Barton.<br />\nand a member of the Tau Beta Pi The question to be debated is \"Re15,<br />\nand<br />\nThursday,<br />\nMarch<br />\nheld<br />\nLatin<br />\nneers,<br />\ntaught<br />\nHe<br />\nigan in 1902.<br />\nThese men will be formally reHonorary Engineering Fraternity, solved: That the United States<br />\nGreek in Marietta Academy and was held rather than the usual ceived into the club on Tuesday,<br />\nwill<br />\nspeak before the Hopkins Elec- should favor the cancellation of the<br />\nCollege at Marietta, Ohio, from evening meeting. The day was March 27th, at the annual banquet.<br />\nClub at 4 P. M. today. His Inter-Allied war debt on condition<br />\ntrical<br />\n1902 to 1905, when he came to devoted to the subject of chilled The elections for the coming year<br />\nsubject<br />\nwill be \"The Manufacture that the German indemnity be maHopkins as a graduate student. He cast iron wheels. To this effect will be held at that time.<br />\nof<br />\nPower<br />\nTransformers.\" Mr. terially reduced.\"<br />\nmade his \"H\" as left halfback on visits were arranged by Mr. B. C.<br />\nBreslau has had a great deal of Hopkins will uphold the negative<br />\nthe 1905 football team and as an Cromwell, president of the so- DISTINGUISHED LECTURER<br />\npractical<br />\nexperience in this branch against Washington'and Lee Unibaseball<br />\nMarythe<br />\nplants<br />\nof<br />\nthe<br />\nciety, to<br />\noutfielder on the 1906<br />\nTO COME TO HOPKINS<br />\nof<br />\nengineering and has versity at Lexington, Va. Those<br />\nelectrical<br />\ntrack<br />\nCompany,<br />\nand<br />\nthe<br />\nland Car Wheel<br />\nteam and was on the 1906<br />\nHenry Higgs, C. B., F. R. E. S., prepared a very interesting and in- on<br />\nthe team are Charles C. G. Evand<br />\nBaltimore Car and Foundry Comteam. In 1913 and 1914 he<br />\nFinance\"<br />\n\"Post-War<br />\non<br />\nspeak<br />\nwill<br />\non<br />\ntalk<br />\nthe<br />\nstructive<br />\nsubject.<br />\nans,<br />\nSamuel S. Eisenberg and RigJohn Huck won the doubles in the pany, where modern methods in<br />\ninnovation<br />\nof<br />\nP.<br />\nM.,<br />\nThe<br />\n5<br />\nhaving<br />\nstuMarch<br />\n27,<br />\nat<br />\nTuesday,<br />\non<br />\nnal<br />\nW.<br />\nBaldwin, Jr., alternate.<br />\nmanufacturing cast iron wheels<br />\nstudents' tennis tournaments.<br />\nContinued<br />\non<br />\npage<br />\n3<br />\ncol.<br />\n3<br />\nEnThe<br />\nCivil<br />\nof<br />\nthe<br />\naffirmative<br />\nside will be upProfessor Magoffin was elected could be examined at first hand. in the lecture room<br />\nheld against the University of<br />\nThe party met at the Engineers' gineering Building. This lecture<br />\nPhi Beta Kappa as Hopkins FelNorth Carolina. The Hopkins repMeeting of entire Editorial<br />\nlow in Latin in 1908, and also ret- Club, Light and Redwood Streets, should be well attended because of<br />\nresentatives are Frederick L.<br />\nStaff of News-Letter today<br />\nroactitely at Michigan in 1910, at 9 A. M., and at about 9:30 A. M. the immediate interest of the subMoehle, Bernard J. Bamberger and<br />\nat 12.20.<br />\nWhen a chapter was placed there. boarded special cars for Curtis Bay. ject. Cards of admission are not<br />\nWilliam Barnhart, alternate.<br />\nrequisite.<br />\non<br />\npage<br />\n4.<br />\nContinued<br />\ncol.<br />\n3<br />\n3<br />\ncol.<br />\nContinued on page 3,<br />\n<br />\nKEEP GOING!<br />\n<br />\n6,000 NEEDED FOR SPRING SPORTS<br />\n<br />\ning<br />\nM.<br />\n<br />\n:h<br />\n<br />\nts<br />\n<br />\n;<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 23, 1923<br />\n<br />\nOPPORTUNITY FOR GOVERN11<br />\nMENT COMMISSIONS OPEN<br />\n11<br />\nTO ENGINEERS<br />\nCandidates Wanted for Positions<br />\nFOUNDED 1897.<br />\nin Coast and Geodetic<br />\nSurvey<br />\n$2.00<br />\nSubscription<br />\nAn announcement of particular 11<br />\ninterest to civil engineering seniors<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nhas been forwarded to Professor<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nJohn T. Gregory, professor of civil<br />\nPublished semi-weekly from October to June by the students of Johns engineering, by Mr. R. L. Faris,<br />\nHopkins University.<br />\nacting director of the United States<br />\nCoast and Geodetic Survey.<br />\nMore than two hundred college men will spend<br />\nBusiness communications should be addressed to the BUSINESS MANThe United States Civil Service<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nCommission will hold an open com- 11 this summer near and with their<br />\nshould be sent to the MANAGING EDITOR.<br />\nhome-folks,<br />\npetitive examination for positions<br />\nworking for us. .Each one should readily earn<br />\nas junior engineers and deck offiHomewood 100<br />\nEi<br />\nTelephone<br />\ncers. This is an exceptional opporFive Hundred Dollars or more.<br />\ntunity for engineering students who<br />\n!<br />\nfulfill the requirements to enter the<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nII Would.you like to be one of these two hundred?<br />\nservice of the government as field<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nTelephone Plaza 4380 at Once for Appointment<br />\nofficers, commissioned with the<br />\nManaging Echtor<br />\nrank<br />\nof<br />\njunior<br />\nengineer<br />\nand<br />\ndeck<br />\nWILLIAM G. DEAN, JR., '24.<br />\nofficer in the Coast and Geodetic<br />\nAdvertising Manager<br />\nAssistant Managing Editor<br />\nSurvey,<br />\none of the military services<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nof the United States, in which is PHILOLOGICAL ASSOCIAJUDGES FOR SOUTHERN<br />\nAssociate Editor<br />\noffered service afloat and ashore.<br />\nTION MEETS<br />\nRANDOLPH NORWOOD, '24.<br />\nORATORICAL CONTEST<br />\nAssistant Business Managers<br />\nEntering with the temporary<br />\nLast<br />\nThursday,<br />\nMarch<br />\n15,<br />\nProCHOSEN<br />\nJunior Editors<br />\nrank<br />\nof<br />\nMILES MARRIAN, '25.<br />\nD.<br />\njunior<br />\ndeck<br />\nengineer<br />\nand<br />\nfessor<br />\nEmber<br />\nspoke<br />\nbefore<br />\nthe<br />\nRICHARD C. TILGHMAN,'25.<br />\nDr. John C. French has chosen<br />\nG. DONALD GIESKE, '25.<br />\nofficer, those who, after six months Johns Hopkins Philological AssoJOHN W. PARSONS, '25.<br />\nthe<br />\nfollowing judges for the SouthJOHN C. LEWIS, '24.<br />\nBENJAMIN T. ROME, '25.<br />\nexperience in this rank, show abil- ciation. His subject was \"Some<br />\nW. EDWARD THOMSEN, JR., '26.<br />\nJOHN T. DIXON,'24.<br />\nity to perform this work will be Egyptian Etymologies.\" Profes- ern Oratorical Contest: Dr. F. W.<br />\nARTHUR L. NELSON, '26.<br />\nA. J. McKAY, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\npromoted to a correspondingly sor Kurrelmeyer also read a paper Wood, president of the University<br />\nEUGENE A. 'DWELL, '24.<br />\nHARRY W. MERCER,'26.<br />\nhigher one. The age limit for ap- on \"Wieland's Mercur and Eng- of Maryland; Hon. Philips Lee<br />\npointment is twenty-six years, un- lish Periodicals.\"<br />\nAssociation.<br />\nNewspaper<br />\nIntercollegiate<br />\nSouthern<br />\nMember of<br />\nGoldsborough, former Governor of<br />\nless previous service has been given<br />\nMembers are requested to send Maryland, and Mr. Edgar Allen<br />\nin other branches of the military to the Secretary, as soon as possi- Poe, president of the Baltimore Bar<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. forces.<br />\nble, the titles of any communica- Association. This contest will be<br />\nJunior engineer candidates must, tion which they may wish to pre- held at Homewood on April 14th.<br />\nas a prerequisite, have completed sent. Dr. C. W. E. Miller is pres- Mr. Parker C. Williams will repBALTIMORE, MD., MARCH 23, 1923<br />\nat least three and one-half years of ident of the Association.<br />\nresent Hopkins.<br />\na course in civil engineering, leading to the degree C. E. or B. S. in<br />\nIF WE MAY—<br />\nThere is an increasing rumble of disapproval issuing from edu- C. E., in a college, university or THE LAST WORD IN THEATRICAL<br />\nPERFECTION<br />\ncators throughout the country concerning the growing importance technical school of recognized standing.<br />\nWeek<br />\nof<br />\nGraduates<br />\nwith<br />\nMarch 26, 1923<br />\nSecond and Last Week<br />\none<br />\nof<br />\nthese<br />\ninto<br />\na<br />\nresolve<br />\nto<br />\nthreatens<br />\nrumble<br />\nThe<br />\nof undergraduate activities.<br />\nGREAT BIG HOLIDAY BILL OF STARS<br />\ndegrees,<br />\nBeginning<br />\nhowever,<br />\nwill<br />\nbe<br />\nMonday, March 26th<br />\nrequired<br />\nthreatening<br />\nare<br />\nactivities<br />\nsaid<br />\nthat<br />\nAESOP'S FILM FABLES<br />\nroar as noted individuals assert<br />\nbefore<br />\nappointment.<br />\nIt<br />\nis<br />\nfurther<br />\ncolAmerican<br />\nthe<br />\nof<br />\ninterest<br />\nLES SPLENDIDS<br />\nto supplant scholarship as the primary<br />\nChampion Art Roller Skaters<br />\nrequired that the applicant shall, InEuropean<br />\nTheir Latest Novelty on the High Table<br />\nlege.<br />\nfor<br />\nhis<br />\nentire<br />\ncollege<br />\ncourse,<br />\ninproball<br />\nhave,<br />\nin<br />\ncalculations<br />\nExtensive researches and accurate<br />\nANN GRAY<br />\nWith Her Harp<br />\nability, made above-mentioned individuals better qualified than mere cluding the last previous examinations,<br />\nhave<br />\nin<br />\nbeen<br />\nthe<br />\nupper<br />\nhalf<br />\nprebe<br />\nRUNAWAY<br />\nwould<br />\nFOUR<br />\nIt<br />\nundergraduates to speak upon such a subject.<br />\n? ? ? ?<br />\nof<br />\nhis<br />\nclass<br />\nhowever,<br />\nin<br />\neach<br />\nof<br />\nthe<br />\nselected<br />\nbold,<br />\nsumptuous to attempt to dispute. If we may be so<br />\nBroadway's Poular Delineator<br />\nmajor subjects. These subjects are,<br />\nRITA GOULD<br />\nwe would like to be enlightened on a few obscure points.<br />\nThe Aristocrat of Song<br />\nWhy are the advantages to be obtained from participation in (1) Mathematicsr, through trigo- By Jack Baxley<br />\nand Francis Nordstrom<br />\nnometry, analytics and calculus;<br />\nWith<br />\nundergraduate activities ignored?<br />\nMrs. Gene Hughes & Co.<br />\nWith Benton C. Ressler<br />\nKAY<br />\nHAMMOND<br />\nIs scholarship or the fitting of the college man for after life the (2) Physics, including mechanics,<br />\nIn \"YOUTH\"<br />\nheat, ;electricity, magnetism, light<br />\nBy Edgar Allan Woolf<br />\nand<br />\nprimary object of the college?<br />\nINTERMISSION<br />\nWhy is it that the alumni most actively engaged in the support and sound; (3)either design of<br />\nSMITH-DUFFY PLAYERS<br />\nTOPICS OF THE DAY<br />\nof college activities are those who participated in those activities dur- structures, or higher surveying. In<br />\nPrices: Nights, 25-50-75-1.00<br />\nA \"Chauvre-Souris\" in' Vaudeville\"<br />\ning their undergraduate days? One would think that these men, addition to these three selected A Brilliant Company of Fifteen Russian<br />\nActors<br />\nPresent<br />\nWed. Mat., 25 and 50c<br />\nafter entering the world and finding their undergraduate experiences minor subjects are necessary.<br />\n\"SARAFAN\"<br />\nmissame<br />\nthe<br />\nEntertainSat.<br />\nmake<br />\nAs<br />\nMat., 25-50 and 75c<br />\nan<br />\nevidence<br />\nCharacteristic<br />\nRussian<br />\nmen<br />\nof<br />\nqualification,<br />\nDepicting<br />\nother<br />\nhelp<br />\nto<br />\nloath<br />\nbe<br />\nwould<br />\navail,<br />\nno<br />\nof<br />\nment of the Olden and Present Days<br />\neach<br />\napplicant<br />\nmust<br />\nsubmit<br />\nan<br />\nextakes.<br />\nEd Healy and Allan Cross<br />\nCOMING<br />\nWhy is it, if college activity is threatening to supplant scholar- plicit statement of the studies pur- Showing the Smartest Styles in Songs<br />\npercentthe<br />\nlists,<br />\nineligible<br />\non<br />\nappearing<br />\nsued,<br />\ntogether<br />\nwith<br />\na<br />\nstatement<br />\nof<br />\nthe<br />\nmen<br />\namong<br />\nship, that,<br />\nCLIFF NAZARRO & BAND \"The Bird of Paradise\"<br />\nWEEK OF APRIL 2<br />\nage of those men actively engaged in undergraduate activities is ab- ratings received in each subject,<br />\nAn' Entire Week of Special Features<br />\nwhich<br />\nmust<br />\nthe<br />\npropbe<br />\nsigned<br />\nby<br />\nsurdly low?<br />\nWe have no doubt that these questions can be satisfactorily an- er officer of the college attended;<br />\nswered. We shudder that we should dare to ask them. We hope that also a statement from the Dean or<br />\nour presumption will be overlooked and that cognizance of our un- the professor in charge of the desophistication will be .taken. To be convinced, however, we must be partment of civil engineering that<br />\nthat applicant has been in the upenlightened.<br />\n(IN 1774)<br />\nper half of his class in the major<br />\nsubjects throughout his course.<br />\nAPPRECIATION<br />\n\"HAVE<br />\nI<br />\never considered it as the indispensable<br />\nJunior engineers are subject to<br />\ntheir<br />\nduty of every member of society to promote, as<br />\nWhen Hopkins undergraduates find the News-Letter in<br />\nfar as in him lies, the prosperity of every indipostoffice boxes every Tuesday ancl Friday they do not stop to con- assignment as subordinate officers<br />\nvidual, but more especially of the community in<br />\nsider that members of the staff have spent from three to five hours in on parties engaged in geodetic opwhich<br />\nhe belongs.\"<br />\nerations,<br />\nsuch<br />\nas<br />\nprecise<br />\ntriangulathe publication of the issue and in the completion of the various<br />\nLife<br />\ninsurance<br />\nis inseparably bound up with the<br />\ntion<br />\nand<br />\ntraverse,<br />\nprecise<br />\nlevelling,<br />\nduties accompanying its publication. Considering that a copy approsperity ofevery individual,family and community.<br />\netc.<br />\nDeck<br />\nassigned<br />\nofficers<br />\nwill<br />\nbe<br />\npears twice a week for thirty weeks, A man who has passed through<br />\nIt is a secure and prosperous business and satisfactory<br />\nthe various stages on either business or editorial staffs of a college to ships or shore parties engaged in<br />\nto the salesman in every way.<br />\npaper has spent a great deal of time and energy in the service of the hydrographic and topographic surThe JOHN HANCOCK would like to interest a few<br />\nveys, and examination of the coastpaper and his Alma Mater.<br />\nambitious men who graduate this year to make JOHN<br />\nHANCOCK selling their life work.<br />\nWith the last issue of the News-Letter the old Board of Control al waters with the wire drag.<br />\nresigned, turning over the duties of publication to the incoming The duties of the field officers<br />\nStatistics on college graduates who have entered<br />\nlife insurance place it at the very top as a source of<br />\nboard. The resigning members, some of them with four years work take them to all parts of the United<br />\nincome. Before making a decision as to your career<br />\nto their credit, have seen the paper grow from a weekly to a semi- States, as well as to Porto Rico,<br />\nit would be well to make inquiries of the \"Agency<br />\nweekly and become established on a firm financial basis. They have Alasla, Hawaii and the Philippine<br />\nDepartment.\"<br />\nwatched, with anxious eyes, the slow but steady growth of the in- Islands. They have a very wide<br />\nfant and, now that it has become a full-grown child, they give over range of duties as engineers engage in the highest grade of surits future care to others.<br />\nits<br />\ncomparatively<br />\neasy.<br />\nIt<br />\nis<br />\nveying, as navigators, and as scienThe task of the incoming board is<br />\npath;<br />\nupright<br />\ntists. For further partieulars, • apduty to see that the child is nourished and keeps on an<br />\nLIFE INSURANCE COMPANY<br />\nits future steady growth, due to the efforts of the retiring members plicants should at once apply for<br />\nOF BOSTON. MASSACHUSETTS<br />\nForm 1312, stating the title of the<br />\nis assured.<br />\nLargest Fiduciary Institution in New England<br />\nThe new board of the News-Letter wishes to offer its apprecia- examination, to the Civil Service<br />\nCommission, Washington, D. C.<br />\ntion.<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nWhich Is Your Choice?<br />\nWork--and $500<br />\nLoaf - - and ?<br />\n<br />\nMARYLAND THEATRE<br />\n<br />\nAcademy of Music<br />\n<br />\n\"EAST<br />\nIS<br />\nWEST\"<br />\n<br />\n111111111111111111M111111111111111111111111111111111111111<br />\n<br />\nJohn Hancock Said:—<br />\n<br />\naaaaaaaaaaaauaaaaaaaa<br />\n<br />\n\f•••<br />\n<br />\n1<br />\n<br />\n1<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 23, 1923<br />\nSCHOLARSHIPS FOR AMERI- chow, Chengtu, Changsha, and BRESLAU TO ADDRESS ELECTRICAL CLUB<br />\nCAN STUDENTS IN FRANCE Nanking is accomplishing more<br />\nContinued from page 1<br />\nIn appreciation of the scholar- for the peace of the Far East<br />\nships awarded French students in than all the battleships afloat on dents talk at meetings was first introduced last year and proved an<br />\nAmerica, the American Council on the Pacific.<br />\noverwhelming<br />\nsuccess. This plan<br />\nEducation has been notified by the<br />\nI said to that same bunch,<br />\nserves<br />\na<br />\ndouble<br />\npurpose. In the<br />\nOffice National des Universities \"What is the greatest need of<br />\nfirst<br />\nplace,<br />\nit<br />\naffords<br />\nthe members<br />\nFrancaises that graduate scholar- China ?\" They might have said<br />\nof<br />\nthe<br />\nvarsity<br />\nan<br />\nexcellent<br />\nopportuships and fellowships, at the Uni- schools, in the midst of such ilnity<br />\nto<br />\nlearn<br />\nto<br />\nexpress<br />\nthemselves<br />\nversities of Bordeaux, Lyons, Nan- literacy; they mighti have said<br />\ncy, Strasbourg and Toulouse will railroads, in a land where prov- before a large gathering. The need<br />\nof this ability has long been felt in<br />\nbe offered American students.<br />\ninces as large as France depend the various<br />\ngraduate engineering<br />\nThe University of Bordeaux of- upon wheelbarrows and sedan<br />\norganizations.<br />\nIn the second place,<br />\nfers two scholarships, which in- chairs. But they did not. They<br />\nthe<br />\ntalks<br />\nare<br />\ndelivered<br />\nby students<br />\nclude lodging at the Maison des said, \"Leaders—honest, fearless,<br />\nwho<br />\nhave<br />\nhad<br />\npractical<br />\nexperience<br />\nEtudiants and board at a neighbor- able leaders.\"<br />\nin<br />\nsome<br />\nparticular<br />\nphase<br />\nof indusing lycee. Free tuition is also ofHow would you like to take a trial electricity, and,, accordingly,<br />\nfered to eight other American stu- chance on training some of the<br />\nhelp to correlate theory learned in<br />\ndents.<br />\nfuture bankers, statesmen, scien- the class room with actual working<br />\nThe University of Lyons and the tists, and educators of China?<br />\nconditions.<br />\nUniversity of Nancy each offer<br />\nLet us check up and see where<br />\nSome typical talks recently delivtwo scholarships, although the latthe present leaders are coming ered are: \"The Liberty Automatic<br />\nter carries 4,000 to 5,000 francs infrom.<br />\nTelephone Exchange,\" by Glover<br />\nstead of lodging and board. A simthese unquestioned leaders P. Fallon, and \"Thermonic Tubes<br />\nOf<br />\nilar scholarship is offered at the<br />\nof the New China, twenty-five in Radio Telegraphy and TeleUniversity of Strasbourg.<br />\nper cent. are graduates of Chris- phony,\" by Edward J. Schaeffer.<br />\nThe University of Toulouse ofcolleges, whereas only a<br />\ntian<br />\nfers two scholarships covering tuiENGAGED IN HOPof one per cent. of the DR. MAGOFFIN<br />\nquarter<br />\nKINS ACTIVITIES<br />\ntion, board and lodging, and eight<br />\npopulation of China is Christian:<br />\nContinued from page 1<br />\nscholarships carrying free tuition.<br />\nof He is a charter honorary member<br />\ngraduates<br />\nthat<br />\nevidence<br />\ntelling<br />\nThe subjects offered include chemare rapidly of Omicron Delta Kappa and of<br />\nistry, electrical engineering, agri- Christian schools<br />\ninfluence.<br />\nGamma Alpha Pi. He was presiculture, hydrology, provencal and reaching places of<br />\nwith<br />\ncrowded<br />\nis<br />\ncollege<br />\nEvery<br />\ndent of the Hopkins Y. M. C. A.<br />\nromance philology, and French<br />\nfor mem- for five years, president of the<br />\nis<br />\ncall<br />\nThe<br />\nstudents.<br />\nstudies.<br />\nScholarships are open to students bers of the faculty, teachers of Chess Club, faculty member of the<br />\nunder thirty, who are graduates of science, mathematics, agricul- athletic department between the inan accredited college or university, ture, English, philosophy and di- cumbencies of Drs. Renouf and<br />\nAbercrombie, Secretary of the<br />\nand who have a fair knowledge of rectors of athletics.<br />\nThere is a job waiting for you Alumni Association, and organizer<br />\nFrench. Applications and testimonials from two professors with in China. It is the greatest game and Director of the University<br />\nwhich the applicant has studied in the world—a chance to help Bureau of Appointments for a<br />\nshould be sent to Dr. I. L. Kandel, modernize the most ancient civ- number of years.<br />\n525 W. 120th St., New York City. ilization on earth.<br />\nFurther information can be secured<br />\nfrom the American Council on EdTAU BETA PI DINES<br />\nWashPlace,<br />\nJackson<br />\n26<br />\nucation,<br />\nAt 8 o'clock last Monday evenington, D. C.<br />\ning a dinner was given by the Hopkins Alpha Chapter of Tau Beta<br />\nAMERICA'S GREATEST CON- Pi Engineering Fraternity at the<br />\nHopkins Club. At its conclusion,<br />\nTRIBUTION TO CHINA<br />\nC. E.<br />\nJames Maxon Yard is Executive the members retired to the<br />\nSeniors room in the Mechanical EnSecretary of the Eastern<br />\nAsia Movement<br />\ngineering Building and a short bus\"Is America's greatest contri- iness meeting was held.<br />\nbution to China Standard Oil,<br />\nA similar meeting will be held<br />\ncars?'<br />\nFord<br />\nor<br />\nmovies,<br />\ncigarettes,<br />\nnext Thursday at 12:30 in Room<br />\nuniversity<br />\n206, in the Mechanical EngineerI asked a group of<br />\nOU bet he is! He's making a tremendous hit! She has just told<br />\nstudents at Foo-chow last De- ing. Building. The purpose of the<br />\nhim that he has hair like Rudy<br />\nValentino's.<br />\nBut he doesn't know<br />\nsecember. I had assured them be- meeting will be to discuss the<br />\nwhether to pretend that it came that<br />\nhe did it with his<br />\nway<br />\nor<br />\nconfess<br />\nthat<br />\nfore that they might be quite lection of new men from the Junlittle bottle of \"Vaseline\" Hair Tonic.<br />\nmanly beauty to<br />\nof<br />\nhis<br />\nowes<br />\na<br />\nlot<br />\nHe<br />\nfrank with me as I had no con- ior Class. The results of this cog\"Vaseline\" Hair Tonic<br />\nthat bottle.<br />\nthe growth of the hair and<br />\npromotes<br />\nnection with the faculty, and itation, however, will not be ankeeps the scalp i n the healthiest condition. At all drug stores and student<br />\nsince I did not know their names nounced immediately.<br />\nbarber shops.<br />\nCHESEBROUGH MFG. CO.<br />\nAt a meeting some time in May<br />\nI could not report them in any<br />\n(Consolidated)<br />\nto<br />\nreply<br />\nelectinstant<br />\nwill<br />\nbe<br />\nfor<br />\nnext<br />\nyear<br />\nofficers<br />\ncase. The almost<br />\nNew York<br />\nState Street<br />\nthe question was, \"America's ed. Those who will retire at this<br />\ngreatest contribution to China time are: Calvin N. Warfield, president; Edward Schaeffer, vicehas been Christian education.\"<br />\nNow I am aware that not all president; Howard Grace and<br />\nand<br />\nstudents would agree with that, Frank Wilson, secretaries;<br />\nEvery\" Vaseline\" Product is recommended everybut I do not know many stu- Henry H. Vogel, treasurer.<br />\n<br />\nTHRILLED?<br />\ny<br />\n<br />\naseline<br />\n<br />\nHAIR TONIC<br />\n<br />\nwhere because ofits absolute burityandeffectiveness.<br />\n<br />\n3<br />\n<br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n.50<br />\nWARNER & COMPANY<br />\nHATTERS<br />\nup<br />\n222 W. BALTIMORE ST.<br />\n<br />\nYou collegians who stroll along the campus will<br />\nbe among the first to sense the coming of Spring.<br />\nDoesn't that suggest something to you in the<br />\nmatter of clothes?<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nSuits if you want to know college style at its best.<br />\n<br />\nflaile414-andwr<br />\n(Y. M. B. 0. D.)<br />\nBaltimore and Hanover<br />\n<br />\nThe Johns Hopkins Press<br />\nof Baltimore<br />\nAmerican Journal of Mathematics. Edited by Frank Morley, A. Cohen, Assistant Editor, with co-operation of Charlotte A. Scott, A. B. Coble, and<br />\nother mathematicians. Quarterly. 8vo. Volume XLV in progress. $6<br />\nper volume. (Foreign postage fifty cents.)<br />\nAmerican Journal of Philology. Edited by C. W. E. Miller, with the co-operation of M. Bloomfield, H. Collitz, T. Frank, W. P. Mustard, D. M. Robinson. Quarterly. 8vo. Volume XLIV in progress. $5 per volume.<br />\n(Foreign postage, fifty cents.)<br />\nAmerican Journal of Psychiatry. E. N. Brush, J. M. Mosher, C. K. Clarke,<br />\nC. M. Campbell and A. M. Barrett, Editors. Quarterly. 8vo. Volume<br />\nII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nBeitrage zur Assyriologie und semitischen Sprachwissenschaft.<br />\nand Friedrich Delitzsch, Editors. Volume X in progress.<br />\n<br />\nPaul Haupt<br />\n<br />\nHesperia. Hermann Collitz, Henry Wood and James W. Bright, Editors.<br />\nSeventeen numbers have appeared.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4vo. Volume XXXIV in progress. $4 per year. (Foreign postage, fifty cents.)<br />\nJohns Hopkins Hospital Reports. 8vo. Volume XXI in progress. $5 per<br />\nvolume. (Foreign postage, fifty cents.)<br />\nJohns Hopkins University Circular, including the Presidents' Report, Annual<br />\nRegister and Medical Department Catalogue. Seven times a year. 8vo.<br />\n$1 per year.<br />\nJohns Hopkins University Studies in Education. E. F. Buchner, Editor. 8vo.<br />\nSeven numbers have appeared.<br />\nJohns Hopkins University Studies in Geology. E. B. Mathews, Editor. 8vo.<br />\nFour numbers have appeared.<br />\nJohns Hopkins University Studies in Historical and Political Science. Under<br />\nthe direction of the Departments of History, Political Economy and Political Science. Monthly. 8vo. Volume XLI in progress. $5 per volume.<br />\nModern Language Notes. J. W. Bright, Editor-in-Chief, G. Gruenbaum,<br />\nW.<br />\nKurrelmeyer and H. C. Lancaster. Eight times yearly. 8vo. Volume<br />\nXXXVIII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nReprint of Economic Tracts. J. H. Hollander, Editor. Fourth series in progress. $2.00.<br />\nReports of the Maryland Geological<br />\n<br />\nSurvey. Edited by E. B. Mathews.<br />\ngovernment<br />\nin<br />\ndents, even<br />\nTerrestial Magnetism and Atmospheric Electricity. L. A. Bauer, Editor.<br />\nschools, would make that same<br />\nQuarterly. 8vo. Vol. XXVIII in progress. $3.50 per volume. (Foreign<br />\nIt<br />\nIs<br />\nDay<br />\nEvery<br />\npostage, 25 cents.)<br />\nanswer. For ten years I have<br />\nBeing Demonstrated That<br />\nbeen in very close touch with<br />\nstudents in all parts of China,<br />\nWe have purchased 122,000<br />\npair U. S. Army Munson last<br />\nand I know that in spite of the<br />\nThe Eclogues of Baptista Mantuanus. By W. P. Mustard, 156 pp. $1.50.<br />\nvery<br />\nshoes,<br />\nsizes 51<br />\n/<br />\n2 to 12 which<br />\nmovement<br />\nanti-religious<br />\nThe Piscatory Eclogues of Jacopo Sannazaro. By W. P. Mustard. 94 pp. $1.25.<br />\nwas the entire surplus stock<br />\nmany see China's only hope in<br />\nof<br />\none<br />\nof<br />\nthe<br />\nlargest<br />\nU.<br />\nS.<br />\nThe Eclogues of Faustus Andrelinus and Joannes Arnolletus. By W. P. Musthe practise of the principles of<br />\nGovernment shoe contractard. 123 pp. $1.50.<br />\nChrist.<br />\ntors.<br />\nFully Meets Every<br />\nWest Florida Controversy, 1798-1813. By I. J. Cox. 702 pp. $3.<br />\nMark you, I know that Chinese Requirement of The Motorist<br />\nThis shoe is guaranteed one<br />\nAn<br />\nOutline of Psychobiology. By Knight Dunlap. 145 pp. 84 cuts. $2.50.<br />\nhundred per cent. solid leathstudents are on the lookout for<br />\nSHERWOOD BROTHERS, INC.<br />\ner, color dark tan, bellows<br />\nThe Life and Stories of the Jaina Savior Pargvanatha. By M. Bloomfield.<br />\nanything that sounds like super- rirrTrrvIlnrrIvrrrrTrryrrrnmInfrrrIrrrrmrsrg<br />\ntongue, dirt and waterproof.<br />\n256 pp. $3.00.<br />\nstition, but they are quite willThe actual value of this shoe<br />\nAmerican Citizenship and Economic Welfare. By J. H. Hollander. 132 pp. $1.25.<br />\ning to consider religion if they<br />\nis $6.00. Owing to this tremodern<br />\nthe<br />\nfrom<br />\nMartial, the Epigrammist and Other Essays. By K. F. Smith. Edited by<br />\nare approached<br />\nmendous buy we can offer<br />\nW. P. Mustard. 180 pp. $2.<br />\nan<br />\nof<br />\ntask<br />\nsame<br />\nto<br />\n.the<br />\nThe<br />\npublic at $2.95.<br />\npoint of view.<br />\nSend correct size. Pay postman on An Economic History of Rome to the End of the Republic. By Tenney Frank.<br />\nAmerican teacher, whether in a<br />\nSHOES<br />\nMEN'S<br />\n310 pp. $2.50.<br />\ndelivery or send money order. If<br />\nmissionChinese college or in a<br />\nClass<br />\nBetter<br />\nOf the<br />\nshoes are not as represented we Public Health and Insurance: American Addresses. By Sir Arthur Newsary university, is right there to<br />\nholme.284 pp. $2.50.<br />\nwill cheerfully refund your money<br />\nhelp these men solve their mentpromptly upon request.<br />\nChina at the Conference. By W. W. Willoughby. 435 pp. $3.00.<br />\nal difficulties in the spirit of<br />\nTables of q—r2 and 1—r2 for use in Partial Correlation and in Trigonometry.<br />\nhonesty and fearlessness.<br />\nBy J. R. Miner. 50 pp. $1.50.<br />\nBROTHERS<br />\nURNER<br />\nI felieve that the work that<br />\nVector<br />\nAnalysis and the Theory of Relativity. By F. D. Murnaghan. 136 pp.<br />\n111 E. BALTIMORE STREET<br />\n$2.75.<br />\nAmerica's live-wires are doing in<br />\nBALTIMORE<br />\n296 Broadway, New York, N. Y.<br />\nsuch universities as Peking, FooA complete list of publications sent on request.<br />\n<br />\nPUBLIC SALES<br />\n<br />\nMICA-1'0R 011112<br />\n<br />\nURNER'S<br />\n<br />\nNational Bay State<br />\nShoe Company<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MARCH 23, 1923<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nJUNIOR PROM TONIGHT<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\n9.00 P. M.<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n4j Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nC. E. HALL<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n<br />\nSUBSCRIPTION $3.50<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nDECORATIONS<br />\nDRAPERIES<br />\nDR. STEWART ADDRESSES OPPORTUNITIES FOR SUMSTREET<br />\n343 NORTH CHARLES<br />\nCHRISTIAN SERVICE CLUB MER WORK ANNOUNCED BY<br />\nBaltimore, Md.<br />\nAPPOINTMEN'i BUREAU<br />\n\"The Ambassadors of God\" was<br />\n•<br />\nthe subject of an address delivered \"Pictorial Review\" Offers Work<br />\nby Dr. George Craig Stewart, of for Students. Numerous TeachEvanston, Ill., before the last meeting Positions for Next Year<br />\ning of the Christian Service Club Dr. John C. French, Director<br />\nThe Greetings of a Fine Store<br />\nat the Homewood Friends' Meetof the University Bureau of Aping House. Dr. Stewart, who is an<br />\nTo the Students of a Fine University<br />\nEpiscopal )clergyman connected poiptments, has announced that<br />\nwith Northwestern University, has the \"Pictorial Review\" will nire<br />\ne) preached at Old St. Paul's Church,<br />\neXatteri<br />\n5<br />\nCleft<br />\nstudents to work during the<br />\n‘L\"vitS H.& OSCAR G•L Nrf<br />\nCharles and Saratoga Streets, dur- summer as subscription .agents.<br />\nHOCHSCHILD,KOHN<br />\nOWNERS<br />\ning the Lenten season.<br />\nre4 OP°<br />\ntibb *\" •<br />\n7)<br />\nLast year a \"Hopkins Team\"<br />\nA diplomatic ambassador is one<br />\n29 Baltimore St., East<br />\nwas<br />\nvery successful in selling<br />\nwho goes from one country into anOne Door West of LigIrt St.<br />\nConother to take charge of the affairs the \"Pictorial Review.\"<br />\nSOLE AGENTS FOR BALTIMORE<br />\nof the country from which he tracts for the work are on file<br />\nFor College Fraternity Bands<br />\ncomes in the country to which he in the office of the Bureau,<br />\n(Greek Letter Societies)<br />\ngoes. He is a medium or a go-be- where anyone<br />\ninterested may<br />\ntween, between two powers. In<br />\nsee them.<br />\nStudents are also<br />\nmuch the same way, a minister is<br />\nwanted to work as book agents,<br />\nan ambassador, though not diplo518 N. CHARLES STREET,BALTIMORE<br />\nPrinters of Philological and<br />\nparticularly<br />\nto sell such books<br />\nmatically but religiously. He acts<br />\nScientific Works<br />\nas a medium to bring God closer to as encyclopedias and Bibles.<br />\nOrchestra—Dancing<br />\nA number of teaching posi- Telephone, Vernon 3442<br />\n23 S. HANOVER ST.<br />\nman.<br />\n3.30<br />\nto<br />\n5.30<br />\nP.<br />\nM. and 6 to 8 P. M.<br />\nBaltimore, Md.<br />\nThe minister of today, according tions for the next college year<br />\nTABLE D'HOTE<br />\nto Dr. Stewart, is a combination of are open. Information in addiLUNCHEON-60c<br />\nD1NNER—$1.00<br />\ntion<br />\nthe<br />\nfollowto<br />\nthat<br />\ngiven<br />\nin<br />\nthree things. He is a prophet, a<br />\nSARATOGA AT<br />\nSUNDAY<br />\ning<br />\nofDINNER—$1.25<br />\nlist<br />\nat<br />\nthe<br />\nmay<br />\nbe<br />\ngotten<br />\npriest, and a pastor. As a prophet,<br />\nLIBERTY STS.<br />\nhe does not prophesy but preaches fice of the Bureau of Appointso that his flock may see the right- ments. The positions are as folLUNCHEON<br />\neous ways of life. As a priest he lows:<br />\nTEA<br />\nis an intercessor, a mediator to Instructor in German in a<br />\nDINNER reconcile those who differ and keep Pennsylvania College.<br />\nInstructor in<br />\nFrench and<br />\npeace in the hearts of men. As a<br />\nSPECIAL PARTIES pastor, he is a servant of God, a Spanish in a State University in YOU WILL FIND OUR STOCK OF STANDARD MAKE SEIS<br />\n11.30 A. M.<br />\nsocial service worker striving for the East, $1800.<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nuntil<br />\nCivil<br />\nProfessor<br />\nof<br />\nAssistant<br />\nPLAZA 6987 the welfare of all.<br />\n7.30 P. M.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nin<br />\nEngineering<br />\nDr. Stewart then asked for ques- Engineering<br />\ntions and the subject of prayer was School in East, $2700.<br />\nbrought up. A prayer is a coin- Instructor in civil engineering<br />\nFine Clothes<br />\n1724 N. CHARLES ST.<br />\nbination of five things: Adoration, $1800-$2000.<br />\nfinal<br />\ngives<br />\nthe<br />\nLemmert<br />\nA suit by<br />\n10 Minutes from Hopkins<br />\nThanksgiving, Confession, Inter- Instructor in mechanical en- Vernon 3055.<br />\ntouch to the lasting satitsfaction you<br />\ndependable<br />\nderive from thoruly<br />\ncession, Petition. After a discus- gineering, $1800-$2000.<br />\ncloths cut in authentic fashion—<br />\nsion<br />\nof this by the members of the Instructor in physics in a<br />\nwhether for every-day wear or more<br />\nclub, Dr. Stewart asked for more Southern College, $1500-$2700.<br />\nfestive occasions.<br />\nquestions. There were none, where- Instructor in history in a<br />\nPRESCRIPTION DRUGGISTS<br />\nat<br />\nLEMMERT<br />\nupon Dr. Stewart said that he was Southern College, $1500-$2700.<br />\nTWO STORES:<br />\n19 Fayette Street, East<br />\nsurprised but glad that no one asked<br />\nAssistant Professor of Phys- Charles and Chase Sts.<br />\nEutaw Place and North Ave.<br />\nDress Clothes anything about evolution.<br />\nBusiness Suits<br />\nThis ics, $2100.<br />\nMadison 0405<br />\nVernon 0890<br />\nSport Togs<br />\nOvercoats<br />\nproved conclusively that there was Instructor in chemistry, $1800.<br />\nno trouble in reconciling evolution<br />\nAssistant Professor of Histo the Faith.<br />\nSHOES<br />\ntory and Social Sciences, $2100for<br />\n$2800.<br />\n0<br />\nJEWELERS<br />\nMANUFACTURING<br />\n4)<br />\nSEVENTY-FIVE DOLLARS REUNIVERSITY MEN<br />\nLancaster, Pa.<br />\nInstructor in American HisALIZED AT LAST TEA<br />\n4)<br />\nClass Rings, Pins, Fraternity Pins,<br />\n4)<br />\ntory,<br />\n$1800.<br />\nDANCE<br />\nFor Sport Wear<br />\nCups, Medals, Etc.<br />\n4 For Dress<br />\nStationery, Invitations, Programmes<br />\nAt the benefit tea dance held last In addition to these positions,<br />\n\"Makers of the Varsity Seals\"<br />\nSmart Styles—Best Leathers<br />\nSaturday afternoon in the C. E. all of which are for men, there<br />\nOver one hundred years 4<br />\n41<br />\nModerate Price:,<br />\nBuilding, at which the Scranton are two positions open to womof designing and creating 41<br />\nEstablished 1873<br />\nSilverware assures the purSirens, headliners on the Keith en: one as instructor in English,<br />\nof Kirk pieces in 41<br />\nA.il. Fetting Man'fg Jewelry Co. circuit, played, the sum of $75 was at $1800 and another as Assist- chaser<br />\nabsolute<br />\nsilver<br />\ncertainty of 41<br />\n41<br />\nrealized. This money will go to ant Professor of French, $2100.<br />\nManufacturers<br />\n4/<br />\nsuperiority.<br />\n41<br />\n19 W. LEXINGTON ST.<br />\nhelp defray the expenses of June<br />\nGreek Letter Fraternity Jewelry<br />\n4<br />\nweek. It was by far the largest tea A. S. M. E. HOLDS INSPECTION<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nTOUR AND MEETING<br />\ndance of the winter and many alumContinued from page 1<br />\nni were on hand. The orchestra,<br />\n4<br />\nArriving<br />\nhere in about one-half<br />\nwhich was heralded as one of the<br />\nPrinters of the<br />\n0<br />\nhour,<br />\nthe<br />\nmembers<br />\nproceeded<br />\nto<br />\nbest in the country, fully lived up<br />\nJohns Hopkins News-Letter<br />\nto expectations and it was forced the Maryland Car Wheel Company,<br />\nCommercial Photography<br />\n4<br />\nBaltimore, Md.<br />\nto play until 8:30 to satisfy those where the various stages in casting<br />\n4<br />\nCircuit Photography<br />\npatthe<br />\nwheels—from<br />\nforming<br />\ncar<br />\n4<br />\nViews present.<br />\nFlash Lights<br />\nOldest Silversmiths in America<br />\nThe tag days held Wednesday, tern and melting the \"pig\" in the 41<br />\n41<br />\nEnlargements<br />\nGroups<br />\n4<br />\nThursday and Friday of last week copula, to finishing the solidified 4)<br />\nEstablished in 1 81 7<br />\nKODAK FINISHING<br />\nbrought in $70.90. The sale of can- casting—were observed.<br />\n325 N. Howard St.<br />\ndy at the recent performances of In the afternoon the party went<br />\nMt. Vernon 4999<br />\nthe Dramatic Club netted $53.36. -to the plant of the Baltimore Car<br />\nThis brings the total amount col- and Foundry Company, which is lo<br />\nNECKWEAR<br />\nSHIRTS<br />\nlected for June Week to approxi- cated in the same section. Here<br />\nW. Lyndon and Mr.<br />\nthe casting of chilled cast iron by Mr. George<br />\nmately $600.<br />\nboth<br />\nof the Association<br />\nVial,<br />\nK.<br />\nF.<br />\nThe aim of the June Week com- wheels was again observed, but par421 N. HOWARD ST.<br />\nManufacture<br />\nof Chilled Cast<br />\nthe<br />\nof<br />\nmittee is to secure $1,000 during ticular attention was paid to the<br />\nFollowing<br />\nWheels.<br />\nthe<br />\nIron<br />\nGLOVES<br />\nHOSIERY<br />\nthe year. The amount of money foundry side of the operation.<br />\nquestions<br />\nof the members<br />\nspeeches,<br />\nAt 8:15 in the evening the memcollected in this way will determine<br />\nanswered by the speakers.<br />\nwere<br />\nSTRATTON SHIRT MAKER<br />\nto a large extent the elaborateness bers of the society, including some<br />\n226 N. Liberty St.<br />\nCollege Literature<br />\nSeveral members of the Phila$3.00, $3.50 and $4.00 of the functions to be held and price who had not participated in the trip,<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\ngathered at the Engineers' Club, delphia and Washington sections<br />\n$5.25 and $6.25 of the general ticket of admission.<br />\nImported Madras<br />\nLOMBARD and. SOUTH STREETS<br />\nTerms Cash, Less 10% 30 Days on Another series of tag days will be where motion pictures of car wheel of the American Society of MeShirts<br />\nheld shortly after the Easter holi- manufacture were shown. Besides chanical Engineers were present at<br />\nAlso a Full Line of Men's<br />\nthe pictures, addresses were given both the trip and evening meeting.<br />\ndays.<br />\nFurnishings<br />\n301 N. CHARLES ST.<br />\n<br />\nFURNI7 URE<br />\n<br />\n8c Co.<br />\n<br />\nCHANTILLY<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nRestaurant Francais<br />\n<br />\nRAD<br />\n<br />\nf.<br />\n<br />\nRADIO SUPPLY CO.<br />\nHynson, Westcott and Dunning<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nQuality<br />\n<br />\nWYMAN<br />\n<br />\nW.L. Mann<br />\n<br />\nLefranc & Ault<br />\n<br />\nSamuel Kirk<br />\nand Son Co.<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 41<br /><br />\nBALTIMORE, MD., MARCH 23, 1923<br /><br />\nJUNIOR PROM TO BE HELD<br />\nDR. MAGOFFIN ACTIVELY<br />\nTONIGHT IN CIVIL ENGIENGAGED IN HOPKINS<br />\nNEERING BUILDING<br />\nACTIVITIES<br />\nFisher's<br />\nOrchestra to Furnish MuWas Phi Beta Kappa. Won \"H\"<br />\nsic.<br />\nElaborate<br />\nDecorations and<br />\nin Football and Baseball.<br />\nFavors<br />\nPrepared<br />\nY. M. C. A. President<br />\nWith<br />\nthe<br />\nallotment<br />\nof 85 tickets,<br />\nMagoffin,<br />\nwho<br />\nDr. Ralph V. D.<br />\n1 Don't take No for an answer—half the time the other fellow is trying you out to see what<br />\ndepartwhich<br />\nwere<br />\noffered for sale, pracwas appointed head of the<br />\nyour number is.<br />\nment of classics at New York Unitically disposed of, the committee<br />\n2 Don't be afraid to ask for the sale—if you're afraid to sell it, of course, the other chap will<br />\nversity before he learned of his sebe afraid to buy.<br />\nfor the Junior Prom and the perlection as president of St. John's<br />\n3 Don't fall for the bird that wants to wait until Yale, Harvard, Pennsy and Princeton are all<br />\nsons who expect to attend are<br />\non the same schedule—make him come through now.<br />\nCollege, has always been most acawaiting the hour for the beginning<br />\n4 Don't expect to sell them all—it cannot be done. Instead see enough prospects to beat your<br />\ntively engaged in Hopkins activquota.<br />\nof the dance. The committee,<br />\nities.<br />\nwill<br />\nresult—believe<br />\nthat<br />\nyou<br />\nland<br />\nwithout<br />\non<br />\nthree<br />\nor<br />\nfour<br />\ncall<br />\ndiscouraged<br />\nif<br />\nyou<br />\nget<br />\n5<br />\nDon't<br />\nwhich is composed of Kennedy,<br />\n\"Flattered as I was by that ofthe next one and go after him harder than ever. They'll sign.<br />\nfer and recognizing the dignity of<br />\nchairman;<br />\nG. M. Shriver, Mount,<br />\n6 Don't slight this proposition. Average one hour per day for a week—the results will surprise<br />\nthe position,\" said Dr. Magoffin<br />\nHamburger, Deavours, Gardner,<br />\nyou.<br />\nearly this week, \"nevertheless my<br />\n7 Don't overlook that lacrosse schedule—it's a peach of a talking point.<br />\nLeopold and Dunning, have comprevious acceptance of the other of8 Don't get worried over the fellow that prefers to see the Orioles—just tell him they won't be<br />\npleted their extensive plans for the<br />\nfer made it impossible for me to<br />\nhome in May.<br />\nProm<br />\nand proclaim everything in<br />\nconsider the St. John's presidency.\"<br />\n9 Don't forget that a full stand makes a strong and confident team.<br />\nreadiness for one of the best dances<br />\nDr. Magoffin expressed his sin10 Don't be a quitter—The world is full of starters—what the world honors is finishers.<br />\ncere regret that in accepting the<br />\never<br />\nenjoyed at Hopkins. The com11 Don't forget to make returns every day so that the score can be kept right up to the minute.<br />\ncall from the New York institution<br />\nmittee expects this year's Prom to<br />\n12 Don't think selling these tickets is work—it's a game and a worth while game at that, so play<br />\nhe must leave Hopkins.<br />\nthe game to win and yuur chan:.:e at the grand prize iz as good as the other fellow's.<br />\ndwarf all pre,<br />\nions ones, and to 2et<br />\n13 Free lance a bit, go after every good looking prospect you see.<br />\n\"Since 1905, when -1- was a grada new standard for \"hops\" held at<br />\n14 Don't forget the college spirit is a deciding factor, it is co-operation \"each for all, all for each\"<br />\nuate student, I have been wholly a<br />\nthe university.<br />\nthat will put this over.<br />\nHopkins man and to leave my uniDecorations have been made un15 Six thousand dollars; six more days. An hour per day gets a thousand a day.<br />\nversity, even to. assume a better<br />\nder<br />\nthe direction of Hamburger,<br />\n16 Can we do it? Show 'em that we can.<br />\nposition and one which offered<br />\nwho was in charge of this departgreatly increased opportunities,<br />\nment of last year's Senior Prom.<br />\nwas a very hard thing for me to<br />\nThose present at that affair will<br />\ndecide upon. Johns Hopkins and STUDENT COUNCIL TAKES DRAMATIC CLUB PLANNING SPRING COMPETITION FOR remember the<br />\nhumorous portrayal<br />\n\"BLACK AND BLUE JAY\"<br />\nTOUR DURING EASTER<br />\nBaltimore have been very kind to UP QUESTION OF LIMITAof the history of jazz done in imSTAFF TO START<br />\nHOLIDAYS<br />\nTION OF ACTIVITIES<br />\nme in these eighteen years and to<br />\npressionistic futuristic paintings.<br />\nleave the students of my classes Council Again Votes Down Peti- Fourteen Men Elected to Member- Men Wanted for Art and Editorial This year the<br />\ndecorations are origand my advisers and the alumni in<br />\nStaffs. Selections Will Be Based inal and unique.<br />\nship in Club. Annual Bantion for New Magazine. Code<br />\nthe city of these two classes, and alon Quality of Work<br />\nquet on March 27<br />\nof Ethics Being Formed<br />\nLouis Fisher's well-known orso to go away from a student body<br />\nThe beginning of spring compe- chestra of five pieces will furnish<br />\nThe Dramatic Club is planning a<br />\nThe Student Council at a meetwhich both as graduates and under- ing held last Monday took up the tour of Washington, Frederick, tition for positions on the art and the<br />\nmusic. Fourteen dances and<br />\ngraduates were doing such fine question of limitation of activities Hagerstown and Cumberland dur- editorial staffs of the Black and<br />\nfour extras have been arranged by<br />\nwork, was extremely difficult. I but could decide on no definite pro- ing the Easter recess, to present its Blue Jay has been announced. Althe committee. Intermission will<br />\nregret that I felt it necessary to gram for its accomplishment. This successful production, \"The Purple though the competition is open to<br />\nbe held and supper served after the<br />\nmake the change,\" Dr. Magoffin limitation was recommended by the Mask.\" Several members of the all four classes, the underclassmen,<br />\neighth dance. Dancing will last<br />\nsaid.<br />\ncast will be on the geology trip at particularly Sophomores, are espe- from nine until one.<br />\n0. D. K. some time ago.<br />\nProfessor Magoffin is leaving at The Student Council goes on the time, but these will be picked cially urged to try out for the staff. The Prom issue of the Black and<br />\nEaster on a lecture trip of several record as favoring the ispirit of up by the club and will take their There are comparatively few men Blue Jay which was released last<br />\nweeks for the Archaelogical Insti- the idea but no plan that has been parts, then return to their geology on the art and editorial staffs at Wednesday will be distributed to<br />\ntute of America, of which he is suggested so far seems to be prac- group. The part of Fouche will present, and it is necessary that the members of the fair sex attending<br />\npresident, and will visit this insti7 tical. Other plans may be drawn probably have to be taken by an un- number be increased. At least four the affair.<br />\ntute's societies on the-Pacific Coast. up later in the year.<br />\nderstudy, as Fred Rich will be prac- men will be taken on before June, The chaperones for the Prom are<br />\nBesides being President of the<br />\nbut there is no fixed limit to the Dr. and Mrs. Goodnow, Dr. and<br />\nAlbert Musher again appeared ticing with the baseball squad.<br />\nAmerican Archaeological! Insti- before the council to solicit its apBusiness Manager West and Art number of positions open. All who Mrs. Latane, Dr. and Mrs. Whitetute, Dr. Magoffin is Associate Ed- proval for the new literary publi- Director Hamburger made a trip do especially creditable work will head, Major and Mrs. Garey.<br />\nitor of the \"American Journal of cation, but it was once more voted to Washington, on Tuesday aft- have an excellent opportunity to<br />\nDue to the limited space in the<br />\nArchaeology\" and the author of down. The principal objections to ernoon, to arrange for a separate make the staff.<br />\nhall, the sale of the tickets has been<br />\n\"A Study of the Topography and the project are that there is no performance at the Central High<br />\nQuality, rather than quantity, restricted and each of the eight<br />\nMunicipal History of Praeneste,\" room on the campus at this time School before Easter. On Satur- will be the basis for judging the members of the committee has been<br />\n\"The Quinquenales,\" and transla- for a publication of this kind as day they will visit Frederick and candidate's work. Selections for allowed to dispose of but ten tickets.<br />\ntions of Grotius' \"Mare Liberum,\" the present papers are,not support- Hagerstown to make arrange- the staff will be made principally Some of the members already reand Bynkershoek's \"Sovereignty of ed as they should be, and also such ments for the first performance of on the quality of the work turned port that all of their tickets have<br />\nthe Sea.\" After graduating from a publication would take from the the tour.<br />\nin; no one has made any of the open been sold. Anyone desiring tickets<br />\nMichigan in 1902 he continued his staffs of the NEWS—LETTER and the<br />\nAt a meeting held in the studio positions as yet.<br />\nfor this affair should procure them<br />\nstudies in Germany and Italy. He Black and Blue Jay men who are last Monday afternoon, fourteen<br />\nAll copy for the \"Spring Fancies immediately. The subscription is<br />\nwa.s in charge of the school of clas- needed for their management.<br />\nmen were elected to membership in Number,\" which will be out on $3.50 per couple.<br />\nsical studies in the American Acaddrawn<br />\nthe club. These elections came as April 20, must be in on April 5.<br />\nA code of ethics is being<br />\nemy at Rome in 1920-1921.<br />\nup by the Student Council and this a result of efforts made in connec- Although the material does not TRIANGULAR DEBATE TODr. Magoffin is a veteran of the will be published as soon as com- tion with \"The Purple Mask.\" The have to bear directly upon the title,<br />\nMORROW<br />\nWorld pleted.<br />\nSpanish-American - and<br />\nfollowing are the new members: contributions dealing with \"spring<br />\nThe<br />\nTriangular<br />\nDebates with<br />\nWars, serving in the latter as a lieuHoward; scenery, fancies\" are preferred.<br />\nProperties,<br />\nWashington<br />\nand<br />\nLee University<br />\ntenant colonel. He is a native of A.S. M. E. HOLDS INSPECTION Gump; business, Summers; tickand the University of North CaroTOUR AND MEETING<br />\nBRESLAU<br />\nTO<br />\nADDRESS<br />\nKansas and after one year at Coopets, Gardner; cast, Passano, Hiss,<br />\nlina, which were originally schedELECTRICAL CLUB<br />\nThe regular monthly meeting of Hess, Morrill, Kennedy, Sachs<br />\ner College, at Sterling, Kan., he enHarold<br />\nBreslau,<br />\na<br />\nsenior<br />\nin<br />\nthe<br />\nuled for March 17, will be held totered business before getting his the Baltimore section of the Amer- and Englsh ; special merit, HenElectrical<br />\nEngineering<br />\nDepartment<br />\nmorrow, March 24, at 8 o'clock.<br />\nA. B. from the University of Mich- ican Society of Mechanical Engi- sel, Desch and Barton.<br />\nand a member of the Tau Beta Pi The question to be debated is \"Re15,<br />\nand<br />\nThursday,<br />\nMarch<br />\nheld<br />\nLatin<br />\nneers,<br />\ntaught<br />\nHe<br />\nigan in 1902.<br />\nThese men will be formally reHonorary Engineering Fraternity, solved: That the United States<br />\nGreek in Marietta Academy and was held rather than the usual ceived into the club on Tuesday,<br />\nwill<br />\nspeak before the Hopkins Elec- should favor the cancellation of the<br />\nCollege at Marietta, Ohio, from evening meeting. The day was March 27th, at the annual banquet.<br />\nClub at 4 P. M. today. His Inter-Allied war debt on condition<br />\ntrical<br />\n1902 to 1905, when he came to devoted to the subject of chilled The elections for the coming year<br />\nsubject<br />\nwill be \"The Manufacture that the German indemnity be maHopkins as a graduate student. He cast iron wheels. To this effect will be held at that time.<br />\nof<br />\nPower<br />\nTransformers.\" Mr. terially reduced.\"<br />\nmade his \"H\" as left halfback on visits were arranged by Mr. B. C.<br />\nBreslau has had a great deal of Hopkins will uphold the negative<br />\nthe 1905 football team and as an Cromwell, president of the so- DISTINGUISHED LECTURER<br />\npractical<br />\nexperience in this branch against Washington'and Lee Unibaseball<br />\nMarythe<br />\nplants<br />\nof<br />\nthe<br />\nciety, to<br />\noutfielder on the 1906<br />\nTO COME TO HOPKINS<br />\nof<br />\nengineering and has versity at Lexington, Va. Those<br />\nelectrical<br />\ntrack<br />\nCompany,<br />\nand<br />\nthe<br />\nland Car Wheel<br />\nteam and was on the 1906<br />\nHenry Higgs, C. B., F. R. E. S., prepared a very interesting and in- on<br />\nthe team are Charles C. G. Evand<br />\nBaltimore Car and Foundry Comteam. In 1913 and 1914 he<br />\nFinance\"<br />\n\"Post-War<br />\non<br />\nspeak<br />\nwill<br />\non<br />\ntalk<br />\nthe<br />\nstructive<br />\nsubject.<br />\nans,<br />\nSamuel S. Eisenberg and RigJohn Huck won the doubles in the pany, where modern methods in<br />\ninnovation<br />\nof<br />\nP.<br />\nM.,<br />\nThe<br />\n5<br />\nhaving<br />\nstuMarch<br />\n27,<br />\nat<br />\nTuesday,<br />\non<br />\nnal<br />\nW.<br />\nBaldwin, Jr., alternate.<br />\nmanufacturing cast iron wheels<br />\nstudents' tennis tournaments.<br />\nContinued<br />\non<br />\npage<br />\n3<br />\ncol.<br />\n3<br />\nEnThe<br />\nCivil<br />\nof<br />\nthe<br />\naffirmative<br />\nside will be upProfessor Magoffin was elected could be examined at first hand. in the lecture room<br />\nheld against the University of<br />\nThe party met at the Engineers' gineering Building. This lecture<br />\nPhi Beta Kappa as Hopkins FelNorth Carolina. The Hopkins repMeeting of entire Editorial<br />\nlow in Latin in 1908, and also ret- Club, Light and Redwood Streets, should be well attended because of<br />\nresentatives are Frederick L.<br />\nStaff of News-Letter today<br />\nroactitely at Michigan in 1910, at 9 A. M., and at about 9:30 A. M. the immediate interest of the subMoehle, Bernard J. Bamberger and<br />\nat 12.20.<br />\nWhen a chapter was placed there. boarded special cars for Curtis Bay. ject. Cards of admission are not<br />\nWilliam Barnhart, alternate.<br />\nrequisite.<br />\non<br />\npage<br />\n4.<br />\nContinued<br />\ncol.<br />\n3<br />\n3<br />\ncol.<br />\nContinued on page 3,<br /><br />\nKEEP GOING!<br /><br />\n6,000 NEEDED FOR SPRING SPORTS<br /><br />\ning<br />\nM.<br /><br />\n:h<br /><br />\nts<br /><br />\n;<br /><br />\nPRICE 5 CENTS<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 23, 1923<br /><br />\nOPPORTUNITY FOR GOVERN11<br />\nMENT COMMISSIONS OPEN<br />\n11<br />\nTO ENGINEERS<br />\nCandidates Wanted for Positions<br />\nFOUNDED 1897.<br />\nin Coast and Geodetic<br />\nSurvey<br />\n$2.00<br />\nSubscription<br />\nAn announcement of particular 11<br />\ninterest to civil engineering seniors<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nhas been forwarded to Professor<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nJohn T. Gregory, professor of civil<br />\nPublished semi-weekly from October to June by the students of Johns engineering, by Mr. R. L. Faris,<br />\nHopkins University.<br />\nacting director of the United States<br />\nCoast and Geodetic Survey.<br />\nMore than two hundred college men will spend<br />\nBusiness communications should be addressed to the BUSINESS MANThe United States Civil Service<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nCommission will hold an open com- 11 this summer near and with their<br />\nshould be sent to the MANAGING EDITOR.<br />\nhome-folks,<br />\npetitive examination for positions<br />\nworking for us. .Each one should readily earn<br />\nas junior engineers and deck offiHomewood 100<br />\nEi<br />\nTelephone<br />\ncers. This is an exceptional opporFive Hundred Dollars or more.<br />\ntunity for engineering students who<br />\n!<br />\nfulfill the requirements to enter the<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nII Would.you like to be one of these two hundred?<br />\nservice of the government as field<br />\nJOSEPH LEOPOLD, '24.<br />\nPHILIP W. HOWARD, '25.<br />\nTelephone Plaza 4380 at Once for Appointment<br />\nofficers, commissioned with the<br />\nManaging Echtor<br />\nrank<br />\nof<br />\njunior<br />\nengineer<br />\nand<br />\ndeck<br />\nWILLIAM G. DEAN, JR., '24.<br />\nofficer in the Coast and Geodetic<br />\nAdvertising Manager<br />\nAssistant Managing Editor<br />\nSurvey,<br />\none of the military services<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nof the United States, in which is PHILOLOGICAL ASSOCIAJUDGES FOR SOUTHERN<br />\nAssociate Editor<br />\noffered service afloat and ashore.<br />\nTION MEETS<br />\nRANDOLPH NORWOOD, '24.<br />\nORATORICAL CONTEST<br />\nAssistant Business Managers<br />\nEntering with the temporary<br />\nLast<br />\nThursday,<br />\nMarch<br />\n15,<br />\nProCHOSEN<br />\nJunior Editors<br />\nrank<br />\nof<br />\nMILES MARRIAN, '25.<br />\nD.<br />\njunior<br />\ndeck<br />\nengineer<br />\nand<br />\nfessor<br />\nEmber<br />\nspoke<br />\nbefore<br />\nthe<br />\nRICHARD C. TILGHMAN,'25.<br />\nDr. John C. French has chosen<br />\nG. DONALD GIESKE, '25.<br />\nofficer, those who, after six months Johns Hopkins Philological AssoJOHN W. PARSONS, '25.<br />\nthe<br />\nfollowing judges for the SouthJOHN C. LEWIS, '24.<br />\nBENJAMIN T. ROME, '25.<br />\nexperience in this rank, show abil- ciation. His subject was \"Some<br />\nW. EDWARD THOMSEN, JR., '26.<br />\nJOHN T. DIXON,'24.<br />\nity to perform this work will be Egyptian Etymologies.\" Profes- ern Oratorical Contest: Dr. F. W.<br />\nARTHUR L. NELSON, '26.<br />\nA. J. McKAY, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\npromoted to a correspondingly sor Kurrelmeyer also read a paper Wood, president of the University<br />\nEUGENE A. 'DWELL, '24.<br />\nHARRY W. MERCER,'26.<br />\nhigher one. The age limit for ap- on \"Wieland's Mercur and Eng- of Maryland; Hon. Philips Lee<br />\npointment is twenty-six years, un- lish Periodicals.\"<br />\nAssociation.<br />\nNewspaper<br />\nIntercollegiate<br />\nSouthern<br />\nMember of<br />\nGoldsborough, former Governor of<br />\nless previous service has been given<br />\nMembers are requested to send Maryland, and Mr. Edgar Allen<br />\nin other branches of the military to the Secretary, as soon as possi- Poe, president of the Baltimore Bar<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. forces.<br />\nble, the titles of any communica- Association. This contest will be<br />\nJunior engineer candidates must, tion which they may wish to pre- held at Homewood on April 14th.<br />\nas a prerequisite, have completed sent. Dr. C. W. E. Miller is pres- Mr. Parker C. Williams will repBALTIMORE, MD., MARCH 23, 1923<br />\nat least three and one-half years of ident of the Association.<br />\nresent Hopkins.<br />\na course in civil engineering, leading to the degree C. E. or B. S. in<br />\nIF WE MAY—<br />\nThere is an increasing rumble of disapproval issuing from edu- C. E., in a college, university or THE LAST WORD IN THEATRICAL<br />\nPERFECTION<br />\ncators throughout the country concerning the growing importance technical school of recognized standing.<br />\nWeek<br />\nof<br />\nGraduates<br />\nwith<br />\nMarch 26, 1923<br />\nSecond and Last Week<br />\none<br />\nof<br />\nthese<br />\ninto<br />\na<br />\nresolve<br />\nto<br />\nthreatens<br />\nrumble<br />\nThe<br />\nof undergraduate activities.<br />\nGREAT BIG HOLIDAY BILL OF STARS<br />\ndegrees,<br />\nBeginning<br />\nhowever,<br />\nwill<br />\nbe<br />\nMonday, March 26th<br />\nrequired<br />\nthreatening<br />\nare<br />\nactivities<br />\nsaid<br />\nthat<br />\nAESOP'S FILM FABLES<br />\nroar as noted individuals assert<br />\nbefore<br />\nappointment.<br />\nIt<br />\nis<br />\nfurther<br />\ncolAmerican<br />\nthe<br />\nof<br />\ninterest<br />\nLES SPLENDIDS<br />\nto supplant scholarship as the primary<br />\nChampion Art Roller Skaters<br />\nrequired that the applicant shall, InEuropean<br />\nTheir Latest Novelty on the High Table<br />\nlege.<br />\nfor<br />\nhis<br />\nentire<br />\ncollege<br />\ncourse,<br />\ninproball<br />\nhave,<br />\nin<br />\ncalculations<br />\nExtensive researches and accurate<br />\nANN GRAY<br />\nWith Her Harp<br />\nability, made above-mentioned individuals better qualified than mere cluding the last previous examinations,<br />\nhave<br />\nin<br />\nbeen<br />\nthe<br />\nupper<br />\nhalf<br />\nprebe<br />\nRUNAWAY<br />\nwould<br />\nFOUR<br />\nIt<br />\nundergraduates to speak upon such a subject.<br />\n? ? ? ?<br />\nof<br />\nhis<br />\nclass<br />\nhowever,<br />\nin<br />\neach<br />\nof<br />\nthe<br />\nselected<br />\nbold,<br />\nsumptuous to attempt to dispute. If we may be so<br />\nBroadway's Poular Delineator<br />\nmajor subjects. These subjects are,<br />\nRITA GOULD<br />\nwe would like to be enlightened on a few obscure points.<br />\nThe Aristocrat of Song<br />\nWhy are the advantages to be obtained from participation in (1) Mathematicsr, through trigo- By Jack Baxley<br />\nand Francis Nordstrom<br />\nnometry, analytics and calculus;<br />\nWith<br />\nundergraduate activities ignored?<br />\nMrs. Gene Hughes &amp; Co.<br />\nWith Benton C. Ressler<br />\nKAY<br />\nHAMMOND<br />\nIs scholarship or the fitting of the college man for after life the (2) Physics, including mechanics,<br />\nIn \"YOUTH\"<br />\nheat, ;electricity, magnetism, light<br />\nBy Edgar Allan Woolf<br />\nand<br />\nprimary object of the college?<br />\nINTERMISSION<br />\nWhy is it that the alumni most actively engaged in the support and sound; (3)either design of<br />\nSMITH-DUFFY PLAYERS<br />\nTOPICS OF THE DAY<br />\nof college activities are those who participated in those activities dur- structures, or higher surveying. In<br />\nPrices: Nights, 25-50-75-1.00<br />\nA \"Chauvre-Souris\" in' Vaudeville\"<br />\ning their undergraduate days? One would think that these men, addition to these three selected A Brilliant Company of Fifteen Russian<br />\nActors<br />\nPresent<br />\nWed. Mat., 25 and 50c<br />\nafter entering the world and finding their undergraduate experiences minor subjects are necessary.<br />\n\"SARAFAN\"<br />\nmissame<br />\nthe<br />\nEntertainSat.<br />\nmake<br />\nAs<br />\nMat., 25-50 and 75c<br />\nan<br />\nevidence<br />\nCharacteristic<br />\nRussian<br />\nmen<br />\nof<br />\nqualification,<br />\nDepicting<br />\nother<br />\nhelp<br />\nto<br />\nloath<br />\nbe<br />\nwould<br />\navail,<br />\nno<br />\nof<br />\nment of the Olden and Present Days<br />\neach<br />\napplicant<br />\nmust<br />\nsubmit<br />\nan<br />\nextakes.<br />\nEd Healy and Allan Cross<br />\nCOMING<br />\nWhy is it, if college activity is threatening to supplant scholar- plicit statement of the studies pur- Showing the Smartest Styles in Songs<br />\npercentthe<br />\nlists,<br />\nineligible<br />\non<br />\nappearing<br />\nsued,<br />\ntogether<br />\nwith<br />\na<br />\nstatement<br />\nof<br />\nthe<br />\nmen<br />\namong<br />\nship, that,<br />\nCLIFF NAZARRO &amp; BAND \"The Bird of Paradise\"<br />\nWEEK OF APRIL 2<br />\nage of those men actively engaged in undergraduate activities is ab- ratings received in each subject,<br />\nAn' Entire Week of Special Features<br />\nwhich<br />\nmust<br />\nthe<br />\npropbe<br />\nsigned<br />\nby<br />\nsurdly low?<br />\nWe have no doubt that these questions can be satisfactorily an- er officer of the college attended;<br />\nswered. We shudder that we should dare to ask them. We hope that also a statement from the Dean or<br />\nour presumption will be overlooked and that cognizance of our un- the professor in charge of the desophistication will be .taken. To be convinced, however, we must be partment of civil engineering that<br />\nthat applicant has been in the upenlightened.<br />\n(IN 1774)<br />\nper half of his class in the major<br />\nsubjects throughout his course.<br />\nAPPRECIATION<br />\n\"HAVE<br />\nI<br />\never considered it as the indispensable<br />\nJunior engineers are subject to<br />\ntheir<br />\nduty of every member of society to promote, as<br />\nWhen Hopkins undergraduates find the News-Letter in<br />\nfar as in him lies, the prosperity of every indipostoffice boxes every Tuesday ancl Friday they do not stop to con- assignment as subordinate officers<br />\nvidual, but more especially of the community in<br />\nsider that members of the staff have spent from three to five hours in on parties engaged in geodetic opwhich<br />\nhe belongs.\"<br />\nerations,<br />\nsuch<br />\nas<br />\nprecise<br />\ntriangulathe publication of the issue and in the completion of the various<br />\nLife<br />\ninsurance<br />\nis inseparably bound up with the<br />\ntion<br />\nand<br />\ntraverse,<br />\nprecise<br />\nlevelling,<br />\nduties accompanying its publication. Considering that a copy approsperity ofevery individual,family and community.<br />\netc.<br />\nDeck<br />\nassigned<br />\nofficers<br />\nwill<br />\nbe<br />\npears twice a week for thirty weeks, A man who has passed through<br />\nIt is a secure and prosperous business and satisfactory<br />\nthe various stages on either business or editorial staffs of a college to ships or shore parties engaged in<br />\nto the salesman in every way.<br />\npaper has spent a great deal of time and energy in the service of the hydrographic and topographic surThe JOHN HANCOCK would like to interest a few<br />\nveys, and examination of the coastpaper and his Alma Mater.<br />\nambitious men who graduate this year to make JOHN<br />\nHANCOCK selling their life work.<br />\nWith the last issue of the News-Letter the old Board of Control al waters with the wire drag.<br />\nresigned, turning over the duties of publication to the incoming The duties of the field officers<br />\nStatistics on college graduates who have entered<br />\nlife insurance place it at the very top as a source of<br />\nboard. The resigning members, some of them with four years work take them to all parts of the United<br />\nincome. Before making a decision as to your career<br />\nto their credit, have seen the paper grow from a weekly to a semi- States, as well as to Porto Rico,<br />\nit would be well to make inquiries of the \"Agency<br />\nweekly and become established on a firm financial basis. They have Alasla, Hawaii and the Philippine<br />\nDepartment.\"<br />\nwatched, with anxious eyes, the slow but steady growth of the in- Islands. They have a very wide<br />\nfant and, now that it has become a full-grown child, they give over range of duties as engineers engage in the highest grade of surits future care to others.<br />\nits<br />\ncomparatively<br />\neasy.<br />\nIt<br />\nis<br />\nveying, as navigators, and as scienThe task of the incoming board is<br />\npath;<br />\nupright<br />\ntists. For further partieulars, • apduty to see that the child is nourished and keeps on an<br />\nLIFE INSURANCE COMPANY<br />\nits future steady growth, due to the efforts of the retiring members plicants should at once apply for<br />\nOF BOSTON. MASSACHUSETTS<br />\nForm 1312, stating the title of the<br />\nis assured.<br />\nLargest Fiduciary Institution in New England<br />\nThe new board of the News-Letter wishes to offer its apprecia- examination, to the Civil Service<br />\nCommission, Washington, D. C.<br />\ntion.<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nWhich Is Your Choice?<br />\nWork--and $500<br />\nLoaf - - and ?<br /><br />\nMARYLAND THEATRE<br /><br />\nAcademy of Music<br /><br />\n\"EAST<br />\nIS<br />\nWEST\"<br /><br />\n111111111111111111M111111111111111111111111111111111111111<br /><br />\nJohn Hancock Said:—<br /><br />\naaaaaaaaaaaauaaaaaaaa<br /><br />\n•••<br /><br />\n1<br /><br />\n1<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 23, 1923<br />\nSCHOLARSHIPS FOR AMERI- chow, Chengtu, Changsha, and BRESLAU TO ADDRESS ELECTRICAL CLUB<br />\nCAN STUDENTS IN FRANCE Nanking is accomplishing more<br />\nContinued from page 1<br />\nIn appreciation of the scholar- for the peace of the Far East<br />\nships awarded French students in than all the battleships afloat on dents talk at meetings was first introduced last year and proved an<br />\nAmerica, the American Council on the Pacific.<br />\noverwhelming<br />\nsuccess. This plan<br />\nEducation has been notified by the<br />\nI said to that same bunch,<br />\nserves<br />\na<br />\ndouble<br />\npurpose. In the<br />\nOffice National des Universities \"What is the greatest need of<br />\nfirst<br />\nplace,<br />\nit<br />\naffords<br />\nthe members<br />\nFrancaises that graduate scholar- China ?\" They might have said<br />\nof<br />\nthe<br />\nvarsity<br />\nan<br />\nexcellent<br />\nopportuships and fellowships, at the Uni- schools, in the midst of such ilnity<br />\nto<br />\nlearn<br />\nto<br />\nexpress<br />\nthemselves<br />\nversities of Bordeaux, Lyons, Nan- literacy; they mighti have said<br />\ncy, Strasbourg and Toulouse will railroads, in a land where prov- before a large gathering. The need<br />\nof this ability has long been felt in<br />\nbe offered American students.<br />\ninces as large as France depend the various<br />\ngraduate engineering<br />\nThe University of Bordeaux of- upon wheelbarrows and sedan<br />\norganizations.<br />\nIn the second place,<br />\nfers two scholarships, which in- chairs. But they did not. They<br />\nthe<br />\ntalks<br />\nare<br />\ndelivered<br />\nby students<br />\nclude lodging at the Maison des said, \"Leaders—honest, fearless,<br />\nwho<br />\nhave<br />\nhad<br />\npractical<br />\nexperience<br />\nEtudiants and board at a neighbor- able leaders.\"<br />\nin<br />\nsome<br />\nparticular<br />\nphase<br />\nof indusing lycee. Free tuition is also ofHow would you like to take a trial electricity, and,, accordingly,<br />\nfered to eight other American stu- chance on training some of the<br />\nhelp to correlate theory learned in<br />\ndents.<br />\nfuture bankers, statesmen, scien- the class room with actual working<br />\nThe University of Lyons and the tists, and educators of China?<br />\nconditions.<br />\nUniversity of Nancy each offer<br />\nLet us check up and see where<br />\nSome typical talks recently delivtwo scholarships, although the latthe present leaders are coming ered are: \"The Liberty Automatic<br />\nter carries 4,000 to 5,000 francs infrom.<br />\nTelephone Exchange,\" by Glover<br />\nstead of lodging and board. A simthese unquestioned leaders P. Fallon, and \"Thermonic Tubes<br />\nOf<br />\nilar scholarship is offered at the<br />\nof the New China, twenty-five in Radio Telegraphy and TeleUniversity of Strasbourg.<br />\nper cent. are graduates of Chris- phony,\" by Edward J. Schaeffer.<br />\nThe University of Toulouse ofcolleges, whereas only a<br />\ntian<br />\nfers two scholarships covering tuiENGAGED IN HOPof one per cent. of the DR. MAGOFFIN<br />\nquarter<br />\nKINS ACTIVITIES<br />\ntion, board and lodging, and eight<br />\npopulation of China is Christian:<br />\nContinued from page 1<br />\nscholarships carrying free tuition.<br />\nof He is a charter honorary member<br />\ngraduates<br />\nthat<br />\nevidence<br />\ntelling<br />\nThe subjects offered include chemare rapidly of Omicron Delta Kappa and of<br />\nistry, electrical engineering, agri- Christian schools<br />\ninfluence.<br />\nGamma Alpha Pi. He was presiculture, hydrology, provencal and reaching places of<br />\nwith<br />\ncrowded<br />\nis<br />\ncollege<br />\nEvery<br />\ndent of the Hopkins Y. M. C. A.<br />\nromance philology, and French<br />\nfor mem- for five years, president of the<br />\nis<br />\ncall<br />\nThe<br />\nstudents.<br />\nstudies.<br />\nScholarships are open to students bers of the faculty, teachers of Chess Club, faculty member of the<br />\nunder thirty, who are graduates of science, mathematics, agricul- athletic department between the inan accredited college or university, ture, English, philosophy and di- cumbencies of Drs. Renouf and<br />\nAbercrombie, Secretary of the<br />\nand who have a fair knowledge of rectors of athletics.<br />\nThere is a job waiting for you Alumni Association, and organizer<br />\nFrench. Applications and testimonials from two professors with in China. It is the greatest game and Director of the University<br />\nwhich the applicant has studied in the world—a chance to help Bureau of Appointments for a<br />\nshould be sent to Dr. I. L. Kandel, modernize the most ancient civ- number of years.<br />\n525 W. 120th St., New York City. ilization on earth.<br />\nFurther information can be secured<br />\nfrom the American Council on EdTAU BETA PI DINES<br />\nWashPlace,<br />\nJackson<br />\n26<br />\nucation,<br />\nAt 8 o'clock last Monday evenington, D. C.<br />\ning a dinner was given by the Hopkins Alpha Chapter of Tau Beta<br />\nAMERICA'S GREATEST CON- Pi Engineering Fraternity at the<br />\nHopkins Club. At its conclusion,<br />\nTRIBUTION TO CHINA<br />\nC. E.<br />\nJames Maxon Yard is Executive the members retired to the<br />\nSeniors room in the Mechanical EnSecretary of the Eastern<br />\nAsia Movement<br />\ngineering Building and a short bus\"Is America's greatest contri- iness meeting was held.<br />\nbution to China Standard Oil,<br />\nA similar meeting will be held<br />\ncars?'<br />\nFord<br />\nor<br />\nmovies,<br />\ncigarettes,<br />\nnext Thursday at 12:30 in Room<br />\nuniversity<br />\n206, in the Mechanical EngineerI asked a group of<br />\nOU bet he is! He's making a tremendous hit! She has just told<br />\nstudents at Foo-chow last De- ing. Building. The purpose of the<br />\nhim that he has hair like Rudy<br />\nValentino's.<br />\nBut he doesn't know<br />\nsecember. I had assured them be- meeting will be to discuss the<br />\nwhether to pretend that it came that<br />\nhe did it with his<br />\nway<br />\nor<br />\nconfess<br />\nthat<br />\nfore that they might be quite lection of new men from the Junlittle bottle of \"Vaseline\" Hair Tonic.<br />\nmanly beauty to<br />\nof<br />\nhis<br />\nowes<br />\na<br />\nlot<br />\nHe<br />\nfrank with me as I had no con- ior Class. The results of this cog\"Vaseline\" Hair Tonic<br />\nthat bottle.<br />\nthe growth of the hair and<br />\npromotes<br />\nnection with the faculty, and itation, however, will not be ankeeps the scalp i n the healthiest condition. At all drug stores and student<br />\nsince I did not know their names nounced immediately.<br />\nbarber shops.<br />\nCHESEBROUGH MFG. CO.<br />\nAt a meeting some time in May<br />\nI could not report them in any<br />\n(Consolidated)<br />\nto<br />\nreply<br />\nelectinstant<br />\nwill<br />\nbe<br />\nfor<br />\nnext<br />\nyear<br />\nofficers<br />\ncase. The almost<br />\nNew York<br />\nState Street<br />\nthe question was, \"America's ed. Those who will retire at this<br />\ngreatest contribution to China time are: Calvin N. Warfield, president; Edward Schaeffer, vicehas been Christian education.\"<br />\nNow I am aware that not all president; Howard Grace and<br />\nand<br />\nstudents would agree with that, Frank Wilson, secretaries;<br />\nEvery\" Vaseline\" Product is recommended everybut I do not know many stu- Henry H. Vogel, treasurer.<br /><br />\nTHRILLED?<br />\ny<br /><br />\naseline<br /><br />\nHAIR TONIC<br /><br />\nwhere because ofits absolute burityandeffectiveness.<br /><br />\n3<br /><br />\nThe \"COLLEGIAN\"<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n.50<br />\nWARNER &amp; COMPANY<br />\nHATTERS<br />\nup<br />\n222 W. BALTIMORE ST.<br /><br />\nYou collegians who stroll along the campus will<br />\nbe among the first to sense the coming of Spring.<br />\nDoesn't that suggest something to you in the<br />\nmatter of clothes?<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nSuits if you want to know college style at its best.<br /><br />\nflaile414-andwr<br />\n(Y. M. B. 0. D.)<br />\nBaltimore and Hanover<br /><br />\nThe Johns Hopkins Press<br />\nof Baltimore<br />\nAmerican Journal of Mathematics. Edited by Frank Morley, A. Cohen, Assistant Editor, with co-operation of Charlotte A. Scott, A. B. Coble, and<br />\nother mathematicians. Quarterly. 8vo. Volume XLV in progress. $6<br />\nper volume. (Foreign postage fifty cents.)<br />\nAmerican Journal of Philology. Edited by C. W. E. Miller, with the co-operation of M. Bloomfield, H. Collitz, T. Frank, W. P. Mustard, D. M. Robinson. Quarterly. 8vo. Volume XLIV in progress. $5 per volume.<br />\n(Foreign postage, fifty cents.)<br />\nAmerican Journal of Psychiatry. E. N. Brush, J. M. Mosher, C. K. Clarke,<br />\nC. M. Campbell and A. M. Barrett, Editors. Quarterly. 8vo. Volume<br />\nII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nBeitrage zur Assyriologie und semitischen Sprachwissenschaft.<br />\nand Friedrich Delitzsch, Editors. Volume X in progress.<br /><br />\nPaul Haupt<br /><br />\nHesperia. Hermann Collitz, Henry Wood and James W. Bright, Editors.<br />\nSeventeen numbers have appeared.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4vo. Volume XXXIV in progress. $4 per year. (Foreign postage, fifty cents.)<br />\nJohns Hopkins Hospital Reports. 8vo. Volume XXI in progress. $5 per<br />\nvolume. (Foreign postage, fifty cents.)<br />\nJohns Hopkins University Circular, including the Presidents' Report, Annual<br />\nRegister and Medical Department Catalogue. Seven times a year. 8vo.<br />\n$1 per year.<br />\nJohns Hopkins University Studies in Education. E. F. Buchner, Editor. 8vo.<br />\nSeven numbers have appeared.<br />\nJohns Hopkins University Studies in Geology. E. B. Mathews, Editor. 8vo.<br />\nFour numbers have appeared.<br />\nJohns Hopkins University Studies in Historical and Political Science. Under<br />\nthe direction of the Departments of History, Political Economy and Political Science. Monthly. 8vo. Volume XLI in progress. $5 per volume.<br />\nModern Language Notes. J. W. Bright, Editor-in-Chief, G. Gruenbaum,<br />\nW.<br />\nKurrelmeyer and H. C. Lancaster. Eight times yearly. 8vo. Volume<br />\nXXXVIII in progress. $5 per volume. (Foreign postage, fifty cents.)<br />\nReprint of Economic Tracts. J. H. Hollander, Editor. Fourth series in progress. $2.00.<br />\nReports of the Maryland Geological<br /><br />\nSurvey. Edited by E. B. Mathews.<br />\ngovernment<br />\nin<br />\ndents, even<br />\nTerrestial Magnetism and Atmospheric Electricity. L. A. Bauer, Editor.<br />\nschools, would make that same<br />\nQuarterly. 8vo. Vol. XXVIII in progress. $3.50 per volume. (Foreign<br />\nIt<br />\nIs<br />\nDay<br />\nEvery<br />\npostage, 25 cents.)<br />\nanswer. For ten years I have<br />\nBeing Demonstrated That<br />\nbeen in very close touch with<br />\nstudents in all parts of China,<br />\nWe have purchased 122,000<br />\npair U. S. Army Munson last<br />\nand I know that in spite of the<br />\nThe Eclogues of Baptista Mantuanus. By W. P. Mustard, 156 pp. $1.50.<br />\nvery<br />\nshoes,<br />\nsizes 51<br />\n/<br />\n2 to 12 which<br />\nmovement<br />\nanti-religious<br />\nThe Piscatory Eclogues of Jacopo Sannazaro. By W. P. Mustard. 94 pp. $1.25.<br />\nwas the entire surplus stock<br />\nmany see China's only hope in<br />\nof<br />\none<br />\nof<br />\nthe<br />\nlargest<br />\nU.<br />\nS.<br />\nThe Eclogues of Faustus Andrelinus and Joannes Arnolletus. By W. P. Musthe practise of the principles of<br />\nGovernment shoe contractard. 123 pp. $1.50.<br />\nChrist.<br />\ntors.<br />\nFully Meets Every<br />\nWest Florida Controversy, 1798-1813. By I. J. Cox. 702 pp. $3.<br />\nMark you, I know that Chinese Requirement of The Motorist<br />\nThis shoe is guaranteed one<br />\nAn<br />\nOutline of Psychobiology. By Knight Dunlap. 145 pp. 84 cuts. $2.50.<br />\nhundred per cent. solid leathstudents are on the lookout for<br />\nSHERWOOD BROTHERS, INC.<br />\ner, color dark tan, bellows<br />\nThe Life and Stories of the Jaina Savior Pargvanatha. By M. Bloomfield.<br />\nanything that sounds like super- rirrTrrvIlnrrIvrrrrTrryrrrnmInfrrrIrrrrmrsrg<br />\ntongue, dirt and waterproof.<br />\n256 pp. $3.00.<br />\nstition, but they are quite willThe actual value of this shoe<br />\nAmerican Citizenship and Economic Welfare. By J. H. Hollander. 132 pp. $1.25.<br />\ning to consider religion if they<br />\nis $6.00. Owing to this tremodern<br />\nthe<br />\nfrom<br />\nMartial, the Epigrammist and Other Essays. By K. F. Smith. Edited by<br />\nare approached<br />\nmendous buy we can offer<br />\nW. P. Mustard. 180 pp. $2.<br />\nan<br />\nof<br />\ntask<br />\nsame<br />\nto<br />\n.the<br />\nThe<br />\npublic at $2.95.<br />\npoint of view.<br />\nSend correct size. Pay postman on An Economic History of Rome to the End of the Republic. By Tenney Frank.<br />\nAmerican teacher, whether in a<br />\nSHOES<br />\nMEN'S<br />\n310 pp. $2.50.<br />\ndelivery or send money order. If<br />\nmissionChinese college or in a<br />\nClass<br />\nBetter<br />\nOf the<br />\nshoes are not as represented we Public Health and Insurance: American Addresses. By Sir Arthur Newsary university, is right there to<br />\nholme.284 pp. $2.50.<br />\nwill cheerfully refund your money<br />\nhelp these men solve their mentpromptly upon request.<br />\nChina at the Conference. By W. W. Willoughby. 435 pp. $3.00.<br />\nal difficulties in the spirit of<br />\nTables of q—r2 and 1—r2 for use in Partial Correlation and in Trigonometry.<br />\nhonesty and fearlessness.<br />\nBy J. R. Miner. 50 pp. $1.50.<br />\nBROTHERS<br />\nURNER<br />\nI felieve that the work that<br />\nVector<br />\nAnalysis and the Theory of Relativity. By F. D. Murnaghan. 136 pp.<br />\n111 E. BALTIMORE STREET<br />\n$2.75.<br />\nAmerica's live-wires are doing in<br />\nBALTIMORE<br />\n296 Broadway, New York, N. Y.<br />\nsuch universities as Peking, FooA complete list of publications sent on request.<br /><br />\nPUBLIC SALES<br /><br />\nMICA-1'0R 011112<br /><br />\nURNER'S<br /><br />\nNational Bay State<br />\nShoe Company<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 23, 1923<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nJUNIOR PROM TONIGHT<br /><br />\nFURNITURE OF QUALITY<br /><br />\n9.00 P. M.<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n4j Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nC. E. HALL<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br /><br />\nSUBSCRIPTION $3.50<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nDECORATIONS<br />\nDRAPERIES<br />\nDR. STEWART ADDRESSES OPPORTUNITIES FOR SUMSTREET<br />\n343 NORTH CHARLES<br />\nCHRISTIAN SERVICE CLUB MER WORK ANNOUNCED BY<br />\nBaltimore, Md.<br />\nAPPOINTMEN'i BUREAU<br />\n\"The Ambassadors of God\" was<br />\n•<br />\nthe subject of an address delivered \"Pictorial Review\" Offers Work<br />\nby Dr. George Craig Stewart, of for Students. Numerous TeachEvanston, Ill., before the last meeting Positions for Next Year<br />\ning of the Christian Service Club Dr. John C. French, Director<br />\nThe Greetings of a Fine Store<br />\nat the Homewood Friends' Meetof the University Bureau of Aping House. Dr. Stewart, who is an<br />\nTo the Students of a Fine University<br />\nEpiscopal )clergyman connected poiptments, has announced that<br />\nwith Northwestern University, has the \"Pictorial Review\" will nire<br />\ne) preached at Old St. Paul's Church,<br />\neXatteri<br />\n5<br />\nCleft<br />\nstudents to work during the<br />\n‘L\"vitS H.&amp; OSCAR G•L Nrf<br />\nCharles and Saratoga Streets, dur- summer as subscription .agents.<br />\nHOCHSCHILD,KOHN<br />\nOWNERS<br />\ning the Lenten season.<br />\nre4 OP°<br />\ntibb *\" •<br />\n7)<br />\nLast year a \"Hopkins Team\"<br />\nA diplomatic ambassador is one<br />\n29 Baltimore St., East<br />\nwas<br />\nvery successful in selling<br />\nwho goes from one country into anOne Door West of LigIrt St.<br />\nConother to take charge of the affairs the \"Pictorial Review.\"<br />\nSOLE AGENTS FOR BALTIMORE<br />\nof the country from which he tracts for the work are on file<br />\nFor College Fraternity Bands<br />\ncomes in the country to which he in the office of the Bureau,<br />\n(Greek Letter Societies)<br />\ngoes. He is a medium or a go-be- where anyone<br />\ninterested may<br />\ntween, between two powers. In<br />\nsee them.<br />\nStudents are also<br />\nmuch the same way, a minister is<br />\nwanted to work as book agents,<br />\nan ambassador, though not diplo518 N. CHARLES STREET,BALTIMORE<br />\nPrinters of Philological and<br />\nparticularly<br />\nto sell such books<br />\nmatically but religiously. He acts<br />\nScientific Works<br />\nas a medium to bring God closer to as encyclopedias and Bibles.<br />\nOrchestra—Dancing<br />\nA number of teaching posi- Telephone, Vernon 3442<br />\n23 S. HANOVER ST.<br />\nman.<br />\n3.30<br />\nto<br />\n5.30<br />\nP.<br />\nM. and 6 to 8 P. M.<br />\nBaltimore, Md.<br />\nThe minister of today, according tions for the next college year<br />\nTABLE D'HOTE<br />\nto Dr. Stewart, is a combination of are open. Information in addiLUNCHEON-60c<br />\nD1NNER—$1.00<br />\ntion<br />\nthe<br />\nfollowto<br />\nthat<br />\ngiven<br />\nin<br />\nthree things. He is a prophet, a<br />\nSARATOGA AT<br />\nSUNDAY<br />\ning<br />\nofDINNER—$1.25<br />\nlist<br />\nat<br />\nthe<br />\nmay<br />\nbe<br />\ngotten<br />\npriest, and a pastor. As a prophet,<br />\nLIBERTY STS.<br />\nhe does not prophesy but preaches fice of the Bureau of Appointso that his flock may see the right- ments. The positions are as folLUNCHEON<br />\neous ways of life. As a priest he lows:<br />\nTEA<br />\nis an intercessor, a mediator to Instructor in German in a<br />\nDINNER reconcile those who differ and keep Pennsylvania College.<br />\nInstructor in<br />\nFrench and<br />\npeace in the hearts of men. As a<br />\nSPECIAL PARTIES pastor, he is a servant of God, a Spanish in a State University in YOU WILL FIND OUR STOCK OF STANDARD MAKE SEIS<br />\n11.30 A. M.<br />\nsocial service worker striving for the East, $1800.<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nuntil<br />\nCivil<br />\nProfessor<br />\nof<br />\nAssistant<br />\nPLAZA 6987 the welfare of all.<br />\n7.30 P. M.<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nin<br />\nEngineering<br />\nDr. Stewart then asked for ques- Engineering<br />\ntions and the subject of prayer was School in East, $2700.<br />\nbrought up. A prayer is a coin- Instructor in civil engineering<br />\nFine Clothes<br />\n1724 N. CHARLES ST.<br />\nbination of five things: Adoration, $1800-$2000.<br />\nfinal<br />\ngives<br />\nthe<br />\nLemmert<br />\nA suit by<br />\n10 Minutes from Hopkins<br />\nThanksgiving, Confession, Inter- Instructor in mechanical en- Vernon 3055.<br />\ntouch to the lasting satitsfaction you<br />\ndependable<br />\nderive from thoruly<br />\ncession, Petition. After a discus- gineering, $1800-$2000.<br />\ncloths cut in authentic fashion—<br />\nsion<br />\nof this by the members of the Instructor in physics in a<br />\nwhether for every-day wear or more<br />\nclub, Dr. Stewart asked for more Southern College, $1500-$2700.<br />\nfestive occasions.<br />\nquestions. There were none, where- Instructor in history in a<br />\nPRESCRIPTION DRUGGISTS<br />\nat<br />\nLEMMERT<br />\nupon Dr. Stewart said that he was Southern College, $1500-$2700.<br />\nTWO STORES:<br />\n19 Fayette Street, East<br />\nsurprised but glad that no one asked<br />\nAssistant Professor of Phys- Charles and Chase Sts.<br />\nEutaw Place and North Ave.<br />\nDress Clothes anything about evolution.<br />\nBusiness Suits<br />\nThis ics, $2100.<br />\nMadison 0405<br />\nVernon 0890<br />\nSport Togs<br />\nOvercoats<br />\nproved conclusively that there was Instructor in chemistry, $1800.<br />\nno trouble in reconciling evolution<br />\nAssistant Professor of Histo the Faith.<br />\nSHOES<br />\ntory and Social Sciences, $2100for<br />\n$2800.<br />\n0<br />\nJEWELERS<br />\nMANUFACTURING<br />\n4)<br />\nSEVENTY-FIVE DOLLARS REUNIVERSITY MEN<br />\nLancaster, Pa.<br />\nInstructor in American HisALIZED AT LAST TEA<br />\n4)<br />\nClass Rings, Pins, Fraternity Pins,<br />\n4)<br />\ntory,<br />\n$1800.<br />\nDANCE<br />\nFor Sport Wear<br />\nCups, Medals, Etc.<br />\n4 For Dress<br />\nStationery, Invitations, Programmes<br />\nAt the benefit tea dance held last In addition to these positions,<br />\n\"Makers of the Varsity Seals\"<br />\nSmart Styles—Best Leathers<br />\nSaturday afternoon in the C. E. all of which are for men, there<br />\nOver one hundred years 4<br />\n41<br />\nModerate Price:,<br />\nBuilding, at which the Scranton are two positions open to womof designing and creating 41<br />\nEstablished 1873<br />\nSilverware assures the purSirens, headliners on the Keith en: one as instructor in English,<br />\nof Kirk pieces in 41<br />\nA.il. Fetting Man'fg Jewelry Co. circuit, played, the sum of $75 was at $1800 and another as Assist- chaser<br />\nabsolute<br />\nsilver<br />\ncertainty of 41<br />\n41<br />\nrealized. This money will go to ant Professor of French, $2100.<br />\nManufacturers<br />\n4/<br />\nsuperiority.<br />\n41<br />\n19 W. LEXINGTON ST.<br />\nhelp defray the expenses of June<br />\nGreek Letter Fraternity Jewelry<br />\n4<br />\nweek. It was by far the largest tea A. S. M. E. HOLDS INSPECTION<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nTOUR AND MEETING<br />\ndance of the winter and many alumContinued from page 1<br />\nni were on hand. The orchestra,<br />\n4<br />\nArriving<br />\nhere in about one-half<br />\nwhich was heralded as one of the<br />\nPrinters of the<br />\n0<br />\nhour,<br />\nthe<br />\nmembers<br />\nproceeded<br />\nto<br />\nbest in the country, fully lived up<br />\nJohns Hopkins News-Letter<br />\nto expectations and it was forced the Maryland Car Wheel Company,<br />\nCommercial Photography<br />\n4<br />\nBaltimore, Md.<br />\nto play until 8:30 to satisfy those where the various stages in casting<br />\n4<br />\nCircuit Photography<br />\npatthe<br />\nwheels—from<br />\nforming<br />\ncar<br />\n4<br />\nViews present.<br />\nFlash Lights<br />\nOldest Silversmiths in America<br />\nThe tag days held Wednesday, tern and melting the \"pig\" in the 41<br />\n41<br />\nEnlargements<br />\nGroups<br />\n4<br />\nThursday and Friday of last week copula, to finishing the solidified 4)<br />\nEstablished in 1 81 7<br />\nKODAK FINISHING<br />\nbrought in $70.90. The sale of can- casting—were observed.<br />\n325 N. Howard St.<br />\ndy at the recent performances of In the afternoon the party went<br />\nMt. Vernon 4999<br />\nthe Dramatic Club netted $53.36. -to the plant of the Baltimore Car<br />\nThis brings the total amount col- and Foundry Company, which is lo<br />\nNECKWEAR<br />\nSHIRTS<br />\nlected for June Week to approxi- cated in the same section. Here<br />\nW. Lyndon and Mr.<br />\nthe casting of chilled cast iron by Mr. George<br />\nmately $600.<br />\nboth<br />\nof the Association<br />\nVial,<br />\nK.<br />\nF.<br />\nThe aim of the June Week com- wheels was again observed, but par421 N. HOWARD ST.<br />\nManufacture<br />\nof Chilled Cast<br />\nthe<br />\nof<br />\nmittee is to secure $1,000 during ticular attention was paid to the<br />\nFollowing<br />\nWheels.<br />\nthe<br />\nIron<br />\nGLOVES<br />\nHOSIERY<br />\nthe year. The amount of money foundry side of the operation.<br />\nquestions<br />\nof the members<br />\nspeeches,<br />\nAt 8:15 in the evening the memcollected in this way will determine<br />\nanswered by the speakers.<br />\nwere<br />\nSTRATTON SHIRT MAKER<br />\nto a large extent the elaborateness bers of the society, including some<br />\n226 N. Liberty St.<br />\nCollege Literature<br />\nSeveral members of the Phila$3.00, $3.50 and $4.00 of the functions to be held and price who had not participated in the trip,<br />\nDress Shirts<br />\n$3.25 and $4.25<br />\nNegligee<br />\ngathered at the Engineers' Club, delphia and Washington sections<br />\n$5.25 and $6.25 of the general ticket of admission.<br />\nImported Madras<br />\nLOMBARD and. SOUTH STREETS<br />\nTerms Cash, Less 10% 30 Days on Another series of tag days will be where motion pictures of car wheel of the American Society of MeShirts<br />\nheld shortly after the Easter holi- manufacture were shown. Besides chanical Engineers were present at<br />\nAlso a Full Line of Men's<br />\nthe pictures, addresses were given both the trip and evening meeting.<br />\ndays.<br />\nFurnishings<br />\n301 N. CHARLES ST.<br /><br />\nFURNI7 URE<br /><br />\n8c Co.<br /><br />\nCHANTILLY<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nRestaurant Francais<br /><br />\nRAD<br /><br />\nf.<br /><br />\nRADIO SUPPLY CO.<br />\nHynson, Westcott and Dunning<br /><br />\nJ. F. Apple Co.<br /><br />\nQuality<br /><br />\nWYMAN<br /><br />\nW.L. Mann<br /><br />\nLefranc &amp; Ault<br /><br />\nSamuel Kirk<br />\nand Son Co.<br /><br />"}], "field_media_file": [{"target_id": 37729, "display": null, "description": null, "target_type": "file", "target_uuid": "1519297a-3fd8-4d7a-9251-b195b4b53c6a", "url": "http://digital.library.jhu.edu/system/files/2022-03/13055-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13055, "target_type": "node", "target_uuid": "35e56d38-a100-4df9-83c3-35a76413d500", "url": "/node/13055"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "100a917e-0442-441a-9a79-37ea689be096"}]}