{"mid": [{"value": 37237}], "uuid": [{"value": "908917af-e34b-4866-a807-5aacdc7a57b2"}], "vid": [{"value": 37237}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:02:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13253-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:02:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:02:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXI, No. 32<br />\nSTONE TO SWIM AGAINST<br />\nARMY IN FIRST MEET<br />\nOF SEASON<br />\nTen Men to Make Trip to West Point;<br />\nArmy Rules Strong Favorite;<br />\nExcels in Backstroke<br />\n<br />\nHopkins' hopes of making a creditable showing against Army Saturday were raised considerably last<br />\nTuesday when it was announced<br />\nthat Captain Stone will be able to<br />\ncompete. Stone had been previously<br />\nreported as unable to swim because<br />\nof a severe attack of sinus trouble<br />\nand this coupled with the loss. of<br />\nPhilip Lee, former Georgetown<br />\nUniversity star, had dampened the<br />\nardour of the Jay mermen. The<br />\nHopkins captain was expected to resume practice last Tuesday at • the<br />\nKnights of Columbus pool. His return should assure Hopkins of a<br />\nplace in the diving events and possibly in the backstroke: •<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 18, 1927<br />\n<br />\nFEBRUARY 25 IS<br />\nDEADLINE FOR.DUES<br />\n.February 25 has been set as<br />\na deadline for the payment of<br />\nsenior class dues. If dues are<br />\n1101 in on this date it will be<br />\nimpossible .for the management of the Hullabaloo to inchide their individual picture<br />\nand write-up in the year-book.<br />\nAny seniors who still wish<br />\nto have their picture inserted<br />\nm the annual may do so if they.<br />\nhave their picture taken on or<br />\nbefore February 25.<br />\nOnly approximately the<br />\ndues of twenty men are still<br />\noutstanding.<br />\nThese<br />\nmen<br />\nshould pay their dues to Abrahams, Fennimore, or Bolton. .<br />\n<br />\nARCHITECTS NOW DRAWING<br />\nPLANS FOR NEW<br />\nBUILDING<br />\nStatistics Collected by 0. D. K.; Activities to Use Barn After Erection<br />\nof New Building<br />\n<br />\nMaterial collected by the Y. M.<br />\nC. A. and 0. D. K. having a bearing on the proposed student activities building has been turned over<br />\nto local architects,. who are now engaged in drawing up the necessary<br />\nplans. The sketch of the proposed<br />\nbuilding, together with the location<br />\nof desired site, will then be given<br />\nto the University advisory board of<br />\narchitects for their approval.<br />\n0. D. K. Collects Statistics<br />\n<br />\nHEADS EXERCISES<br />\n<br />\nPRICE, 5 CENTS<br />\n<br />\nMUSICAL CLUBS<br />\nARRIVE IN NORFOLK<br />\nNo One Seasick During Journey;<br />\nAdvance Sale Slow<br />\n<br />\nFIFTY-EIGHT MAKE TRIP<br />\nOrchestra Will Give Radio Concert in Norfolk Tonight<br />\nBY A STAFF CORRESPONDENT<br />\nNorfolk, Va., Feb. 18 (Special<br />\nDispatch to the NEWS-LETTER).<br />\nFifty-eight students of the Johns<br />\nHopkins University arrived here at<br />\n7 A. M. this morning on the steamship, State of Virginia, to give their<br />\nmusical concert tonight at the Hotel<br />\nMonticello. No one reported having suffered sea-sickness as the allnight journey was accomplished on<br />\na smooth sea and in calm weather.<br />\nThe group of students left the<br />\ndock immediately, going to the Monticello where they established their<br />\nDr. Frank J. Goodnow<br />\nheadquarters. Advance sale for ,the<br />\nwho will conduct commemoration<br />\nconcert was reported as rather slow,<br />\nprogram.<br />\nbut it is hoped that many will apply<br />\nCOMMEMORATION ADDRESS for tickets during the day.<br />\nBY DR. W. W. COOK<br />\n<br />\n0. D. K. during the past few<br />\ndays has collected statistics dealing<br />\nwith the activities of the students<br />\nthat would in any way affect the<br />\nSeniors Invited To<br />\nproposed building. Material has<br />\nAlumni Smoker been gathered as to where the students enter the University grounds,<br />\nTen Men to Make Trip<br />\nMembers of the Class of 1927 the number of students<br />\n. Only ten men . will he taken to<br />\nentering<br />\nWest Point Saturday. . In the ab- have been invited by the Alumni the Barn during the lunch hours,<br />\nsence of Eddie Hill, due-fo- sickness Association of Johns Hopkins Uni- the location of living quarters of<br />\nin New York, Stone will act as tem- versity to be present, as its guests, the students, the number and situporary coach during the meet. Hiss, at the Annual Meeting and Smoker ation of fraternity houses, and the<br />\nWelsh, Stewart, Sheffield, Davis, of the Association to be held in the number of students dwelling in Dr. Goodnow to Preside at Exercises Bay Boat Leaves<br />\nBaltimore at 6:30<br />\nSmith, Hemmeter, and Muir will Alumni Memorial Dormitory on them. Information has also been<br />\nat Peabody Next Tuesday<br />\nalso probably make the trip. • Ac- Tuesday at 8 P. M.<br />\nsecured as to the amount of food<br />\nDr. Walter Wheeler Cook, Pro- Cheers, howls, whoops, and yells<br />\ncording to Max Armour, assistant Those wishing to attend this sold at the Barn.<br />\nof Equity in Yale Univer- rent the air as the Old Bay Lite<br />\nmanager of the swimmers, Hopkins' smoker are requested to notify LarMr. Schaal stated that the plan fessor<br />\nboat, State of Virginia, left Baltirepresentatives will compete. in six kin Farinholt, president of the Sen- of the building does not call for new sity and Visiting Professor of JurUniversity, will more Harbor last night at •6:30<br />\nevents. Hiss and Welsh are prac- ior class, as soon as possible.<br />\noffices for the student activities on isprudence in this<br />\no'clock, carrying the combined<br />\ntically'certain to swim in the fiftythe campus, as plans are on foot, deliver the address at the Fifty- Johns Hopkins Musical<br />\nClubs to<br />\nCelebration in comyard dash, whereas • Stewart and Junior Dues Being<br />\nto utilize the present building for First Annual<br />\nNorfolk..<br />\nFifty-eight<br />\nstudents<br />\ncommemoration of the founding of<br />\nSheffield will probably handle the<br />\nPaid Rapidly that purpose. At a recent meeting Johns Hopkins. His subject will prised the party that will arrive in<br />\nhundred. Davis is the four-forty<br />\n0. D. K. recommended to the board<br />\n\"Science and the Law.\" As us- Norfolk early tomorrow morning.<br />\nentrant. In the dives Stone will<br />\nJunior Class dues are coming in of architects that the offices of the be<br />\nFifty of them will participate in the<br />\nmost likely be assisted by Hemmeter well, according to Leonard Dalsem- various activities remain in the ual, the exercises will be held at<br />\nconcert<br />\ntonight at the Monticello<br />\neleven o'clock on the morning of<br />\nand Hiss • and Muir are slated for er, treasurer of the class. However. Barn.<br />\nHotel.<br />\nFebruary 22 at the Peabody Instithe backstroke. The team ex- no plans for the class banquet will<br />\nCafeteria to Be Included<br />\nThe last vestige of daylight was<br />\ntute.<br />\npects to leave Baltimore on Fri- be formulated until all members of<br />\nAccording to plans suggested by<br />\nfading away as the boat was seen<br />\nDr. Cook Familiar Figure<br />\nday at two-thirty in the afternoon, the class have paid.<br />\na committee consisting of Dr.<br />\nto disappear amid tlie twinkling<br />\narriving at West Point at eight- The Junior Class has been divided French, Mr. Schaal, and Douglas Dr. Cook, who is a familiar figlights of the bay traffic. Long beure to Hopkins students, took his<br />\nthirty in the evening. The meet is<br />\nfore the last faint shriek had been<br />\ninto eight parts, each one of which C. Turnbull, Jr., the new building<br />\nscheduled for two-thirty the followwill contain a cafeteria, soda foun- A. B. in 1901. Since then he has heard as the ship turned its prow<br />\nhas<br />\nbeen<br />\nassigned<br />\nto<br />\none<br />\nmember<br />\nof<br />\ning day.<br />\ntain, club room, ladies' room, li- taught mathematics at Columbia and toward the south. The skyline of<br />\nthe banquet committee in order that<br />\nArmy Favored to-Win<br />\nbrary lounge, reception room, new various branches of the Law at Co- Baltimore showed faintly against<br />\nlumbia, Nebraska, Michigan, WisAlthough Army rules a strong f every man's dues may be solicited quarters for the \"Y,\" and<br />\nseveral<br />\nthe darker blue of the evening sky,<br />\nand Yale universities. He<br />\nconsin,<br />\nvorite, Jay enthusiasts obtained a personally.<br />\ncommittee rooms.<br />\ndotted with yellow splotches of<br />\nis also a legal writer of note. He<br />\nray of hope last week when the It has been very difficult in the<br />\nMr. Schaal stated that plans are<br />\nlight.<br />\nwill discuss the application of scien•<br />\nTo Give Radio Concert<br />\nnews was received that Penn had past for the committee in charge o going ahead rapidly for financing<br />\ntific method in everyday legal prac- On board the boat, before she<br />\nunexpectedly walloped the cadet class banquets to calculate the num- the building. A committee is being tice. Dr. Cook's address is listed<br />\nleft, there was not a face that failmermen. Army is rather weak in ber of men expected at the banquet. appointed which will begin secur- as the sixth event' on the Commem- ed<br />\nto shine with pleasure and anthe dashes and the breast stroke. so this year no news concerning the ing funds in order that work may oration Day Program.<br />\nticipation. Some tried to find their<br />\nMassachusetts Tech also took a fall banquet will be divulged until the begin as soon as the plans are apstateroom-mates and others were inAcademic Procession<br />\nexercises<br />\nThe<br />\nwill<br />\nopen<br />\nwith<br />\nthe<br />\nclass<br />\nwhole<br />\nhas<br />\nquiring about dinner. Many redues.<br />\npaid<br />\nits<br />\nout of the Cadet natators.<br />\nproved.<br />\nAcademic<br />\nprocession<br />\nwhich<br />\nusual<br />\nmained on the deck to watch the<br />\nThe outstanding Army event<br />\nwill be headed by Dr. Frank J. sailors at work preparing the cables<br />\nDR.<br />\nTURNER<br />\nRECENT<br />\nIN<br />\nMAGAZINE<br />\nARTICLE<br />\nseems to be the 150-yard back<br />\nFIXES BLAME FOR WORLD WAR Goodnow, President of the Univer- for the tug that was to haul the ship<br />\nstroke. Both Finlay and Garton<br />\nWhat is the genesis of the World of powers, Dr. Turner says. On the sity; Governor Albert C. Ritchie, into the harbor.<br />\nhave been making excellent times in<br />\nWar? Is blame to be qualified or one hand was the Triple Alliance, Mayor Howard Jackson, the Chap- President Passano announced<br />\nContinued on. Page 3, Col. 1<br />\nunqualified? Who is to blame? which consisted of the German Em- lain, other distinguished guests and that the Blue Jay Orchestra will<br />\nMany factors contributed to the pire, Austria-Hungary, and Italy. the Trustees of the University give a radio concert of dance music<br />\nDr. Diez To Lecture<br />\nbreaking out of the great struggle. Afterwards Rumania, Bulgaria, and Next will come the University Fac- over station WTAR, Norfolk, toAt C. E. Hall Today Can any one of them be honestly Turkey were added as appendages. ulty followed by the candidates for night from 7:30 until 8 o'clock.<br />\nFrom there they will go to the hotel<br />\npointed out as more important than On the other hand, was the Triple degrees.<br />\nDr. Ernest Diez of Bryn Mawr the rest?<br />\nto take part in the concert.<br />\nEntente, its membership composed<br />\nThe Rev. Ocar Olsen, D. D.,<br />\nThirty-five Return Tomorrow<br />\nCollege will give an illustrated lec<br />\n\"Evidence is clear and decisive,\" of England, France, and Russia.<br />\nPastor of Mt. Vernon Place Meth- Thirty-five men, comprising the<br />\nture on \"The Art of the Borobudur. writes Dr. E. Raymond Turner, Three times within five years<br />\nodist Episcopal Church, will de- Glee Club and Banjo Club, will rethis afternoon at 5 o'clock, in the Professor of European History at war was scarcely avoided. Crises<br />\non the bay boat Saturday night.<br />\nliver the benediction after the mem- turn<br />\nRall of the Civil Engineering Build- Johns Hopkins, in the February is- had arisen in the Balkans in 1909,<br />\nThe orchestra and soloists, together<br />\nsue of Current History. Germany's and between Russia and Austria- bers of the procession have taken<br />\nwith President Passano, will remain<br />\ning. The lecture is open to the pub<br />\nactions, abetted by the ugly part of Hungary in 1912 and 1913. The their places. At this point the<br />\nover<br />\nto carry out their part in the<br />\nlie.<br />\nAustria among other far-reaching final crisis, which was to merge in- Johns Hopkins Orchestra will renprogram given by the hotel's \"WinDr. Diez was formerly professor causes, led immediately into the to a world conflict, was the assasder a melody entitled \"Spring,\" by ter Garden\" every Saturday night.<br />\nof History of Art at the University war. During the war the Allies gen- sination of Archduke Franz FerdiGrieg, to be immediately followed Many of the club's adherents will<br />\nof Vienna and a celebrated author- erally agreed upon Germany's nand, heir to the thrones of Austria<br />\nby the conferring of degrees. Sev- likewise remain over. These men<br />\nity on Oriental Art.<br />\nwill return by train or boat on Sunblame. Official publications of the and Hungary, and his wife, at Saraenty-four will be given to Bachelors<br />\nday.<br />\nThe Borobudur of Java, of which Germans and the Austrians, access jevo in Austria-Hungary. The assassins were subjects of the Dual of Engineering, together with a<br />\nWhether the trip will be a great<br />\nDr. Diez will lecture this afternoon. to government archives, and much<br />\nMonarchy, abetted by Serbian se- number of others in subjects rang- financial success, or failure, one<br />\nis better known as the beautiftil comment have confirmed earlier<br />\ncret societies dreaming of a greater ing from Hygiene and Public Heald- thing is certain—the members of the<br />\n\"Temple of the Thousand Bud- judgments.<br />\nSerbia.<br />\non down to the Bachelors of Arts Musical Clubs are now having fhe<br />\ndhas.\"<br />\nThere were two opposing groups<br />\ntime of their lives!<br />\nContinued on Page 4, Col. 1<br />\nContinued on Page 3, Col. 2<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED<br />\n<br />\n1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the<br />\nGER,<br />\n<br />\nJOHNS HOPKINS UNIVERSITY;<br />\n<br />\nshould be sent to the<br />\n<br />\nall articles and other communications<br />\n<br />\nYES and NO<br />\n<br />\nUniversity 0100<br />\n<br />\nBusiness Manager<br />\n<br />\nEditor-in-Chief<br />\nHENRY JARRETT,<br />\n<br />\n'27<br />\n<br />\nEUGENE O'DUNNE, JR.,<br />\n<br />\n'27<br />\n<br />\nManaging Editor<br />\nF. REESE, '27<br />\n<br />\nCHARLES<br />\n<br />\nAdvertising Manager<br />\nAssistant Managing Editor<br />\nMORTON HAMBURGER, JR., '28<br />\nAssociate Editors<br />\nRICHARD R. GRIFFITH, '28<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '27<br />\n, NORMAN B. GARDINER, JR., '28<br />\n<br />\nJunior Editors<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR.,'29<br />\nLEONARD B. NOLLEY, '29<br />\nJOHN G. TURNBULL, '29<br />\nA. BERNARD CHANCELLOR, JR., '28<br />\nDONALD HISS, '29<br />\nPHILIP NESS, '29<br />\nRICHARD H. WOOD, '29<br />\n<br />\nTHOMAS<br />\n<br />\nF.<br />\n<br />\nMCNEAL, '27<br />\n<br />\nCirculation Manager<br />\nHEYWARD<br />\n<br />\nE. BOYCE,<br />\n<br />\nJR.,<br />\n<br />\n'27<br />\n<br />\nAssistant Business Managers<br />\nLAWRENCE<br />\n<br />\n0.<br />\n<br />\nMCCORMICK, '28<br />\n<br />\nBORTNER, '27<br />\nIRviN B. HOFFMAN,'28<br />\nDONALD C. WEILLER, '28<br />\nSAMUEL M. HECHT, '29<br />\nLouis M. RAWLINS, '28<br />\nZANVYL E. KRIEGER, '28<br />\nGEORGE M. GLAZIER, '29<br />\nH. ADDISON CAMPBELL, '29<br />\nWILLIAM<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by The Read-Taylor Press, South and Lombard Streets<br />\n<br />\nAN OPPORTUNITY<br />\nNext Tuesday will witness the fifty-first Commemoration<br />\nExercises of the University. Such an event needs no recommendation from the NEWS-LETTER. In common with every editor •<br />\nbefore us, we urge the undergraduates to attend. Officials of the<br />\nUniversity have spent months in arranging a program which will<br />\nbe impressive and interesting. Surely the student can forget the<br />\ndaily grind of studies and activities for one day, and be present<br />\nat an event which will bring home to him, perhaps for the first<br />\ntime, the importance and magnitude of his university.<br />\n<br />\nDIME DIPLOMACY<br />\nAgain we take our hats off to the Interfraternity Board.<br />\nIt was generally thought that last year that august body, with its<br />\nquick convictions and dollar fines, had set a shining example of<br />\nwhat not to do. Last Monday, however, the members surpassed<br />\nthemselves. They appear as loath to spend money for cups as<br />\nthey were to collect it in the form of fines. In this effort to<br />\nrival the Coolidge administration in economy, all notions of fair<br />\nplay and all sense of obligation seems to have been forgotten.<br />\nA few years ago the Board instituted an Interfraternity baseball tournament. The plan succeeded famously, and the tournament became an annual event. Not least among the factors in<br />\nthe success of the idea was the silver loving cup presented each<br />\nyear to the winning fraternity.<br />\n.Last year when the appointed time had rolled around the<br />\nbaseball games were played as usual. Delta Gamma Theta put<br />\nout a nine which routfd all of Its rivals and won the championship together with a perfectly valid claim to the cup. The trophy,<br />\nhowever, was not forthcoming; the Board, perhaps, was in financial difficulty, having collected only two dollars in fines.<br />\nThe delegates, proverbially open minded, did not want to see<br />\nbaseball<br />\nvictors cheated out of their cup; so last Monday they<br />\nthe<br />\nproceeded to set matters right by voting them out of it in an<br />\neminently legal manner. Since cups are expensive and since<br />\nthe winner of two years ago naturally refused to give up its trophy,<br />\nthe Board, prudent in money matters, wisely decided that, beginning with last year, there should be but one cup, which should<br />\ncirculate from chapter house to chapter house until the end of<br />\ntime.<br />\nIf the ruling were to go into effect this season, it might deserve commendation. But a retroactive ruling which deprives a<br />\nfraternity of a trophy they won honorably is another matter entirely. Sometime ago we spoke of the \"dollar diplomacy\" of the<br />\nInterfraternity Board;'now, it seems, they have shifted their attention to even smaller denominations.<br />\n<br />\nTHE NEWS-LETTER<br />\n<br />\nMAILBAG<br />\nTHOSE GENTLE SOLDIERS<br />\nTo the Editor of the NEWS-LETTER.<br />\nDear Sir:<br />\nCritics of the R. 0. T. C. have<br />\nseized the opportunity presented by<br />\nthe Frederick Y. M. C. A. conference's hostile resolution to again try<br />\nto blackball and belittle the former<br />\norganization. To call the R. 0. T.<br />\nC. militaristic is patently ridiculous;<br />\non the contrary, the object of the<br />\nmilitary training at this University,<br />\nas expressed by the Hopkins professors of military science and by the<br />\nrepresentative of the Third Corps<br />\nArea at the military exercises last<br />\nspring is to create a strong enough<br />\nreserve force to make aggressive nations chary of attacking the United<br />\nStates.<br />\nFurthermore, it has always been<br />\nthe object of the R. 0. T. C. to<br />\ntrain into its members an antipathy<br />\nto all war and a realization that<br />\nthey themselves will be the first to<br />\nfall in such a war. \"We do not<br />\nwant war\" is the constant cry.<br />\nIn addition to giving training in<br />\npatriotism—particularly respect for<br />\nthe flag, national anthem, etc.—the<br />\ncourse in military training affords<br />\nexercise and disciplinary training<br />\nfor the men. A far greater good<br />\ncomes to the latter from marching<br />\nin a prescribed manner than from<br />\nwalking in a haphazard fashion.<br />\nOpportunities for leadership are<br />\ngiven to all men who show talent<br />\nafter the completion of the first<br />\n<br />\nThere is a quaint tradition extant among our authorities, to<br />\nthe effect that there shall be no smoking in the corridors and classrooms of our various fire-proof buildings. One wonders at their<br />\npersistence in such a patently ridiculous ideal. Polite signs are<br />\nplastered throughout our otherwise dignified hall-ways; keennosed professors have traced the errant smoke-wisps of Camels,<br />\nChesterfields, and the distinctly collegiate Lucky Strikes to their<br />\ninnocent sources; the omnipresent decrepit janitor spends his peaceful hours reminding the undergraduate of rules;—and the undergraduate smokes<br />\nOne reason for the stubbornness of the janitors may be contained in their unwillingness to soil their brooms.<br />\nNo habitual smoker among Hopkins students ever leaves a<br />\n<br />\nMANAGING EDITOR.<br />\n<br />\nTelephone<br />\n<br />\nJ.<br />\n<br />\nBUSINESS MANA-<br />\n<br />\n1<br />\n<br />\nbuilding merely for the purpose of catching a drag. He becomes<br />\nadept at palming his cigarette when passing Dr. Latane's office,<br />\nhe learns to apprehend the moment of the janitor's shuffling appearance, and he makes a habit of opening the windows during<br />\na quiz. Such interruptions to scholastic pursuits, however, as<br />\nthat of a certain spectacled, puny, stupid Ethiope who broke in<br />\non an English examination to enforce the law—such interruptions are inexcusable.<br />\nThis moral obtuseness on the part of the students is not<br />\nmerely an outgrowth of a general disapproval of rules and regulations. Rather, it indicates clearly the need of some loafing place,<br />\nto be enjoyed by the mass. For those who object to walking<br />\nthrough food, sitting on greasy papers; for any who detest the<br />\nmessiness of spilled milk, melted ice-cream, or for those who lack<br />\nsufficient Hopkins spirit to enthuse over ghastly trophies of the<br />\nvintage of 1900, the loft of the Barn constitutes a sty rather than<br />\na retreat. The fortunate \"litterati\" who compose the Tudor and<br />\nStuart Club can escape to the undoubted refuge of their club<br />\nroom; others are permitted to descend to the post-office; but there<br />\nis no smoking-room for the rest of the rabble<br />\nDo Y. M. C.<br />\nA. men smoke? I've never seen one so doing, even in Gilman<br />\n.Hall, where everyone smokes. It must certainly be arranged<br />\nbeforehand that the undergraduate may do as he pleases in the<br />\nnew \"Y\" building.<br />\nJust received a letter from some kind-hearted if mysterious<br />\ncontributor who realizes the value of poetry as a space-filler.<br />\nTo \"Yes and No\"—Some inquiry has been made by your<br />\ncolumn as to what the students think about. Do you really think<br />\nthey think? The majority is a mass of luke-warm morons with,<br />\nat most, three opinions: (1) the relative potency of Paul's gin<br />\nas compared with Light Lunch's,(2) the relative merits of Sarah's<br />\nline as compared with Sally's, and (3) the relative charms of the<br />\nchoruses of \"Lemaire's Affairs\" and the \"Scandals.\"<br />\nNo one knows what the professors think. They seldom think<br />\nout loud, at any rate. ... Speaking of professors, the student body<br />\ndoesn't know them nearly well enough. Advertising is needed.<br />\nHere's a swell lecture to sleep through:<br />\n<br />\nyear.<br />\n<br />\nEven if Morton Hilmburger left<br />\nthe R. 0. T. C. after the second<br />\nyear, a few prominent men remained, among them the President<br />\nof the Junior Class and one of its<br />\nStudent Council Representatives.<br />\nThe decreased government appropriation makes it impossible for any<br />\nto be retained except the ones who<br />\nhave shown the greatest proficiency.<br />\nThe time and summer camp requirements also lead many men to withdraw after the second year.<br />\nAs to Hamburger's charge that<br />\nthe best men on the campus are not<br />\nR. 0. T. C. members, let me suggest that the Hopkins candidates<br />\nfor the last Rhodes Scholarship<br />\nwere both officers in the military<br />\nunit. The Evening Sun please note.<br />\nVery truly yours,<br />\nNORMAN B. GARDINER, JR.<br />\n<br />\nYoung men, I most sincerely trust<br />\nYou'll understand the care I must<br />\nEmploy, to be completely just<br />\nTo all concerned.<br />\nI think I'd better first betray<br />\nThe symptoms of a frank dismay,<br />\nBefore attempting to convey<br />\nWhat I have learned.<br />\n<br />\nSPRING IS HERE?<br />\nTo the Editor of the NEWS-LETTER.<br />\nDear Sir:<br />\nAnd also kindly let me urge<br />\nYes, spring is here. Perhaps not<br />\nYour pardon for whatever surge<br />\nin its entirety—there is still snow<br />\nOf pompous words may now emerge;—<br />\non the ground, on most nights there<br />\nPlease listen well.<br />\nis frost, and the trees and grass do<br />\nnot show a trace of green as yet-The facts of which I now will speak<br />\nbut it is nevertheless here. It haunts<br />\nCan scarce be covered in a week;<br />\nthe sultry atmosphere, it lurks in<br />\nFor out-side reading, one should seek—<br />\nthe sunlight filtering through the<br />\nBut there's the bell.<br />\ngrey bank of clouds, it hovers iu<br />\n—Meander.<br />\nsheltered corners of the campus<br />\nbuildings. But in the thoughts of<br />\nDR. THAYER GIVES BOOK friend of Dr. Osler.<br />\nmany of the students it has already<br />\nThe other three volumes acquired<br />\nTO LITERARY CLUB<br />\nblossomed into .the full, annual<br />\nby the club were: \"Five Stuart<br />\nContinued from Page 6, Cot. 1<br />\nfever.<br />\nmakes it a very valuable possession. Princesses\", edited by Robert S. Charlie Waite settles himself in<br />\nThe work is not the \"Meditations\" Rait, which was sent directly to the his comfortable desk chair to smoke<br />\nof Marcus Aurelius, but a transla- club by Lady Osler; \"The Life and a pipe before starting to do that contion by John Bourchier, second Death of Cardinal Wolsey\", by temptible chemistry home work. It<br />\nBaron Berners, from a French ver- George Cavendish, illustrated with is his firm determination to make<br />\nsion of \"El Relox de Principes\" by portraits by Holbein, which was at least a nine-five in every course<br />\nAntonio de Guevara. It was com- given by Mrs. Rupert Norton, of this half—besides<br />\nstarring in the<br />\npleted only six days before Ber- Baltimore; and a gift of Dr. Barnstormers' play and running off<br />\nners' death and was first published Thomas Richmond Boggs, \"The with the lacrosse honors. By sysUniversal Angler\", published in<br />\nin 1534.<br />\ntematic work he will be able to make<br />\nTo be sure that the rare volume London in 1676, containing three the first string easily; once in that<br />\nwould reach its destination safely, books on fishing, by Izaak Walton, position athletic honors will be easy<br />\nLady Osler gave it into the keeping Charles Cotton, and Colonel Robert for him.<br />\nof Dr.• Thayer, who was a personal Venables, respectively.<br />\nContinued on Page 4, Col. 2<br />\nC<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br />\nDR. FRENCH PICKS TWO<br />\nDEBATING TEAMS<br />\n<br />\nBusiness Assistants<br />\nAppointed To Jay<br />\n<br />\nO'Dunne, Niles and Bull Compose First<br />\nTeam; Triangle Debate Arranged<br />\n<br />\nResults of tryouts for the Johns<br />\nHopkins Intercollegiate Debating<br />\nTeam were announced today by Dr.<br />\nJohn Calvin French, adviser. The<br />\nresults are as follows: Eugene<br />\nO'Dunne, chairman; Donald C.<br />\nNiles and Robert Bull, first team;<br />\nNorman Gardiner, chairman; Carey<br />\nThompson and Irving Hoffman,<br />\nsecond team. Fenimore and Meyers<br />\nwill serve as alternates, if necessary. The members are listed in accordance with their ability as rated<br />\nby Dr. French.<br />\nThe schedule which is being completed will probably include debates<br />\nwith Davison University, Wake<br />\nForest College of North Carolina,<br />\nand William and Mary of Virginia<br />\nDebates with northern colleges will<br />\nalso probably be arranged.<br />\nA triangle debate with Washington and Lee and University of<br />\nNorth Carolina will be held on May<br />\n6 in which both the first and second<br />\nteams will compete.<br />\n<br />\nSWIMMERS MEET- ARMY<br />\nContinued from Page 1, Col. 1<br />\n<br />\nthis race. Finlay recently broke an<br />\nold academy record when he negotiated the distance in two minutes<br />\nflat. This is the Army's fifth meet<br />\nof the season, they having won two<br />\nin addition to the two losses cited<br />\nabove.<br />\nIn spite of the blows dealt their<br />\nhopes by Eddie Hill's sickness and<br />\nthe loss of such promising candidates as Lee, who was to have been<br />\nthe mainstay of the team, the Hopkins swimmers feel confident that<br />\nthey will make a good showing in<br />\nthis, their first meet of the year.<br />\n<br />\nHarry Levine, M. D. Ghent, L.<br />\nA. Covell, C. Reider, and A. Bordley have been elected business assistants to the staff of the Black and<br />\nBlue Jay. The office of business<br />\nassistant has just recently been created and is designed to give credit<br />\nto non-staff members who contribute ads to the Jay. The campus<br />\nhas always given credit to literary<br />\ncontributors by printing their names<br />\nin the issue to which they have contributed and now business contributors will be recognized also.<br />\nThe Jay is running a contest for<br />\nthe member of the business staff doing the most for the magazine, the<br />\nprize being a trip to New York.<br />\nHarry B. Wolf, Jr., with $150 in<br />\nads and much office work to his<br />\ncredit; Richard Wood, with $600<br />\nin ads, and Samuel Hecht, with $800<br />\nin ads, are leading the race at the<br />\npresent time.<br />\nDR. COOK TO SPEAK<br />\nContinued from Page 1, Col. 1<br />\n<br />\n3<br />\n<br />\nTHE ART<br />\nCLEANERS and DYERS<br />\n2442 St. Paul St. cor. 25th St.<br />\nPhone HOmewood 8471<br />\nBaltimore, Md.<br />\nPhone,CAl. 1380<br />\n<br />\nHome—HO. 2095-J<br />\n<br />\nFRANCES T. BANNON<br />\nSuccessor to HARBAUGH Sc BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nBaltimore, Md.<br />\n<br />\nKodaks<br />\nCameras<br />\nSupplies<br />\n<br />\nDeveloping<br />\nPrinting<br />\n<br />\nEnlarging<br />\n<br />\nZepp Photo Supply Co.<br />\n3044 Greemnount Ave.<br />\n<br />\nLet Us Develop Your Films<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br />\n<br />\ncrp<br />\n<br />\n-...ozt Cunard Ma „<br />\ndive for dear old Rutgers'\", and<br />\n'College Specials to<br />\ncl<br />\nbefore<br />\nthe words had left his smiling<br />\nEurope and Return<br />\nlips, Ralph Raritan found himself plunging head foremost from his lofty pinnacle.<br />\n<br />\nPhone UNiversity 3829<br />\n<br />\n$170<br />\nTO S190<br />\n<br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY<br />\nCO.<br />\n<br />\nRound Trip<br />\nTourist Third Cabin<br />\n<br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n213 N. LIBERTY STREET<br />\n<br />\nThe Best Time<br />\nTo Go-Before Mid-June<br />\n<br />\nAfter the degrees have been conferred the Orchestra will render a LAFAYETTE TAILORING CO.<br />\nselection froin Beethoven. Upon the<br />\n1 EAST LAFAYETTE AVE.<br />\ncompletion of this piece Dr. Cook<br />\nWhere Quality Counts<br />\nwill deliver his address and then<br />\nCleaning and Pressing<br />\nPresident Goodnow will follow with<br />\nCall VErnon 6233-J<br />\nthe announcements. The celebration will conclude with the singing<br />\nof the University Ode and a benediction.<br />\nAll classes will be suspended on<br />\nthe day of the Commemoration Celebration and all undergraduates are<br />\nurged to attend.<br />\nThe ushers will be Farinholt,<br />\nGwitm, Jarrett, O'Dunne, Passano,<br />\nV<br />\nE<br />\nReese, Stone, and Warfield.<br />\n<br />\nSounds like a dime novel, but no,<br />\ndear readers, it is merely an episode<br />\nin the cruise of a Cunard College<br />\nSpecial to Europe.<br />\nGood fellows all! Each day aboard<br />\nship abounding in sport and fun —and<br />\nthen London, Paris, the Continent!<br />\nSee your local<br />\nCunard College Representative<br />\nor write<br />\n<br />\nor after Mid-July<br />\nBox 1039<br />\n<br />\nMR. DONALD WHITE<br />\nJohns Hopkins University<br />\nor Local Agents<br />\n<br />\nBalto, Md<br />\n<br />\nCUNARD & ANCHOR LINES<br />\n107 E. BALTO. ST. BALTO,<br />\n<br />\nC<br />\n<br />\nA<br />\n<br />\nMEL<br />\n<br />\n-fr.: 110111111y<br />\n<br />\nTake your Choice<br />\nRich Black and Gold,<br />\nBlack-tipped Lacquer-red, or<br />\n<br />\nGreen Jade<br />\nBlack =tipped<br />\nParker Duofold is made in all 3 effects<br />\nThose who like Green Jade will agree<br />\nit's easy to decide which Jade to buy. For<br />\nhere,in the Parker Duofold,this popular<br />\ncolor is in combination with trim Black<br />\nTips—doubly smart and effective.<br />\nAnd Parker Duofold is the only pen<br />\nwith the Ink-Tight Duo-Sleeve Cap and<br />\nBarrel of Non-Breakable Permanite.The<br />\npen with the Point that's guaranteed 23<br />\nyears, not only for mechanical perfection<br />\nbut for wear!<br />\n• So don't confuse Parker Duofold with<br />\nother pens that are similar in color only.<br />\nLook for the imprint of master craftsmanship—\"Geo. S. Parker —DUOFOLD.\"<br />\n<br />\n1 1 1il it<br />\n•<br />\n<br />\nu 1111,<br />\n1 11111A!'<br />\n,<br />\n,,01.1.7,40reer? .<br />\n<br />\n--444111144112<br />\n!<br />\n. 4H ---<br />\n<br />\nYou are an experienced smoker<br />\nand you know your brand!<br />\nYOU'RE an experienced smoker.<br />\n<br />\nYou know good tobaccos. You<br />\nknow taste and fragrance.<br />\n<br />\nDuofold<br />\n01'3k-1344?<br />\n<br />\nCOMPANY, JANESVILLE, WISCONSIN<br />\n<br />\nwould not be far and away the<br />\nfirst. If Camels weren't quality<br />\nsupreme, they would not be the<br />\noverwhelming preference of smokers who have tried every brand.<br />\n<br />\nAnd you insist on the best —<br />\nthat's Camels. Only the primest<br />\ntobaccos grown are good enough<br />\nYour taste tells you the tobacco<br />\nfor you—the experienced smoker. difference in cigarettes and you're<br />\nWhatever you do you are going to going to smoke the best. Your<br />\ndo right, if you know it.<br />\nadvice to others is — \"Have a<br />\nIf Camels weren't the best, they Camel!\"<br />\n<br />\nOver-size Duofold Pen,$7.<br />\nParker Duofold Jr. or Lady<br />\nDuofold, $5. Pencils to<br />\nmatch, $3, $3.50 and $4,<br />\naccording to size. All good<br />\ndealers have them.<br />\n<br />\nTHE PARKER PEN<br />\n<br />\nStialtr<br />\n111AIIIIIMMenousistuaitiissis•<br />\n. 1. 11114'<br />\n<br />\n[Meeting a train in the Union station]<br />\n<br />\ni'arker<br />\nLucky Curve Feed<br />\nand 25-KarPoint<br />\n<br />\n91h<br />\n<br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM, N. C.<br />\n<br />\n1927<br />\n<br />\n\fTHEAJOHNS HOPKINS NEWS-LETTER; FEBRUARY 18, 1927<br />\n<br />\n4<br />\nINTERFRATERNITY CUPS<br />\nTO BE AWARDED<br />\nScholarship Honors and Baseball Champions to Get Trophies<br />\n<br />\nHOPKINS SWIMMING COACH TELLS<br />\nHOW TO LEARN BACK STROKE<br />\nEDITOR'S NOTE:<br />\n<br />\nEddie Hill, coach of the Jay mermen, discusses<br />\nin this article the art of swimming the back stroke.<br />\n<br />\nIn spite of the fact that Delta<br />\nGamma Theta was acknowledged<br />\nbaseball champion in the tournament conducted by the Interfraterpity Board last year, they have not<br />\nyet received the promised prize.<br />\nThis fact was revealed at last<br />\nMonday's meeting of the board<br />\nwhen representatives of the fraternity complained that they had not<br />\nbeen awarded the cup. An investigation followed and the fraternity<br />\nwho now has possession of• the<br />\nprize refused to relinquish it, arguing that they had been awarded it<br />\npermanently.<br />\n<br />\nThe easiest method for a crawl<br />\nAlthough the back stroke is a recognized stroke with its many advan- swimmer to learn the back stroke<br />\ntageous uses, it is not a popular is to lie flat on the back, as if floatstroke. It is a stroke adaptable to ing, extend arms over the head and<br />\npersons with a long arm reach. It then start the flutter kick.<br />\nis not an easy stroke to master, Palms of the hand should be<br />\nwhich I believe accounts for the slightly turned outward and downfew swimmers adapting themselves ward, with hands cupped. The<br />\nto it. However, it should be encour- arms absolutely rigid are pulled<br />\naged for its usfffulness as a life- down to the side. They alternate, resaving medium as well as its use in sembling a semi-circle, while the<br />\ncompetition, since it is considered legs with toes pointing downward<br />\nas one of the three recognized in, are held close together with the<br />\nstrokes.<br />\nknees bending slightly on each kick.<br />\nBefore attempting to master this A common error is to put the head<br />\nstroke one should be able to swim too far back in the water. The corNew Cup to Be Purchased<br />\nThe secretary of the board was the crawl with the utmost ease and rect position of the head is elevated<br />\nthe correct similar to a person lying down with<br />\nthen instructed to purchase a new relaxation. This gives<br />\nmust be a head rest. Unlike the crawl swimwhich<br />\ndrive<br />\nor<br />\nleg<br />\ncup for the uncrowned victors. kick<br />\narms. mer, the. back stroker should enthe<br />\nof<br />\nThis award will remain the property worked independent<br />\nwhich<br />\nform<br />\nthe correct<br />\ncourage a decided rolling motion of<br />\nof the Interfraternity Board, the To acquire<br />\nswimmers possess, the body which not only is good<br />\nfraternity winning the baseball few back stroke<br />\nspeed at first, form but also is a means to increase<br />\navoid<br />\nshould<br />\none<br />\nchampionship being allowed to have<br />\nonly<br />\nwith practice. the speed.<br />\ncome<br />\nwill<br />\nwhich<br />\nits custody for one year. Every<br />\n<br />\nyear it will have the name of the<br />\nwinner for that year engraved<br />\nupon it.<br />\nAverages for the scholastic year<br />\n1925-26 have been inaccessible to<br />\nthe board, but an effort is being<br />\nmade to procure them and the cup<br />\nwill be awarded in the near future.<br />\nNext week will see the beginning<br />\nof the Interfraternity Bridge Tournament. Two matches will be played a week. The series will be run<br />\nin \"round robin\" form and the winning fraternity will be presented<br />\nwith a cup.<br />\nDR. TURNER ON WAR<br />\nContinued from Page 1, Col. 3<br />\n<br />\nMAILBAG<br />\n<br />\nAustria moved -slowly, knowing<br />\nthat war with Serbia meant wai<br />\nwith Russia. At the same time Germany assured Austria of her full<br />\nsupport should a war come between<br />\nAustria and Russia. Had it not beey<br />\nfor this assurance, Austria would<br />\nnever have attacked Serbia, main.<br />\ntains Dr. Turner.<br />\nCompliance to Austrian demands<br />\nmeant . possible subserviency for<br />\nSerbia. The Serbian governmen'<br />\noffered to yield if the demands were<br />\nmade by a conference of European<br />\nnations. To this and to proposals<br />\nby England for intermediation by a<br />\nconference Germany was opposed.<br />\nMeanwhile Germany assured Italy of compensation in event Austria-Hungary gained Balkan lands<br />\nThe Kaiser informed Russia that<br />\nmobilization meant war. German<br />\nthreats caused Russia to mobilize the class.<br />\nbeen made<br />\nGermany declared war on August .The statement has<br />\ndo not think<br />\n1, 1914. Austria advanced into that undergraduates<br />\nLet us here highly resolve that this<br />\nSerbia.<br />\nzip<br />\nshall not have been in vain, that<br />\nWhen the French government deshall not<br />\ncided that war was preferable to' this studying, under God,<br />\npeace pledged with certain frontier be . . . .<br />\nfortresses, Germany declared war \"Mr. Waite, what do you know<br />\ntheory of<br />\nupon France on August 3. Great about the molecular<br />\n?\"<br />\ngases<br />\nBritain entered the struggle to upNo, spring is not here yet!<br />\nhold the \"scrap of paper\" that neuRUSTY.<br />\ntralized Belgium.<br />\n<br />\nHOLIN<br />\n\"THE WONDER MOTOR FUEC:<br />\n<br />\nSHERWOOD BROS., INC.<br />\n<br />\neight., to<br />\nForyDollars<br />\n<br />\n1<br />\n<br />\nWrite for Interesting Booklet<br />\n'The STETSON HAT in LITERATURE\"<br />\nJohn B.Stetson Company. Phdadelpbia<br />\n<br />\na<br />\n<br />\nAmmormil<br />\n<br />\nCorona has the<br />\nfeatures<br />\nyou want<br />\nYou can't get all these advantages in any other portable!<br />\n<br />\nH<br />\nIS<br />\nOL<br />\nAB<br />\nautointoxication/<br />\n•<br />\n<br />\nStandard keyboard<br />\n12-yard self reversing ribbon<br />\n10-inch carriage<br />\nMargin release on keyboard<br />\nBack spacer on keyboard<br />\nVariable line spacer<br />\nAdjustable paper guide<br />\nSelf-spacing carriage return<br />\n100% visibility<br />\nProved durability<br />\n<br />\nM. W. LUCY & CO.<br />\nAGENTS<br />\n104 W. Fayette St.<br />\n<br />\nNo use trying to rise and shine<br />\nwhile you're keeping yourself<br />\nhalf - dead from self - generated<br />\npoisons.<br />\nPut your system on a paying basis.<br />\nKeep your digestive organs functioning properly. Make an attempt<br />\nto balance your daily diet.<br />\n<br />\neat<br />\n<br />\nSHREDDED<br />\nWHEAT<br />\nYou can put on a corn roast<br />\nbarbecue, weiner party, etc.,<br />\nanytime,anywhere with Saunders System cars. A car for<br />\nfive costs less than rail fare.<br />\nGlad to serve your bunch.<br />\nCoupes, Sedans or Touring.<br />\n<br />\nBRAN,SALTS, VITAMINS,PROTEINS and CARBOHYDRATES are all contained in Shredded Wheat<br />\n<br />\nin appetizing and digestible form. Crisp,delicious.<br />\nshreds of vital body-building nutriments. Two<br />\ndaily biscuits of Shredded Wheat eaten regularly will make you fit and keep you fit. Begin<br />\nnow and see!<br />\n<br />\nSAUNDERS SYSTEM<br />\n<br />\nEven Skeptics<br />\nAren't Doubtful<br />\nAbout This<br />\n<br />\n1BET<br />\n<br />\n70elL dressed gentlemen.ad-knowledge.thepreeminence,<br />\nof Stetson.. smartness...<br />\nand appreciate, the..<br />\neconomiesofStetson,<br />\nqua/4y<br />\n<br />\nc'TETS N H<br />\nefwedjoryounyncen<br />\n<br />\nContinued from Page 2, Col. 5<br />\nIt is obvious that Charlie is not<br />\n<br />\na senior, or he would not have such<br />\nan optimistic view of the second semester, even with spring but a<br />\nmonth off. Damn it all, though, that<br />\npipe has gone out and he must finish it and get to his work. . . Yes,<br />\nnine-fives, Barnstormers, laciosse.<br />\nAnd after that, June 'Week. But<br />\nwho to ask to go with him? He<br />\nhasn't seen Stella for over a year<br />\nnow; she would be a winner at any<br />\nparty, judging from what she was<br />\nlast time he saw her. Then there is<br />\nMarge—the girl he met at the Nu<br />\nEgg dance last week; sparkling blue<br />\neyes, slender, medium height—who<br />\nshall it be! . . .<br />\nConfound that Chemistry! Must<br />\nhave been asleep. Eleven-thirty and<br />\nnothing done. Will have to work till<br />\none to finish. This scientific mess—<br />\natomic theory—molecular weight-combining weights—eleven-fifty and<br />\nno headway made. Better get up<br />\nabout five and do the blasted problems; now, to bed.<br />\nIt is human to err. The five<br />\no'clock alarm is conveniently<br />\nstifled, Charlie sleeps again, and<br />\nawakes to find it seven-forty-five.<br />\nEight-thirties are always a pain.<br />\nBut, oh that Chemistry! If we are<br />\nas 'faithless to our work as this,<br />\nCharlie boy, six-five will be the<br />\nheight of our triumph. Then a mad<br />\nscramble for breakfast, the trolley,<br />\n<br />\n1<br />\n<br />\n11 E. North Ave.<br />\nVErnon 2704<br />\n<br />\nQuick Getaway For<br />\nAn Early Class<br />\n<br />\nMake ita daily habit<br />\n-\"Pwilimaimmimms<br />\n<br />\n\fTH E JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br />\n<br />\nINTERCOLLEGIATE<br />\n<br />\nE. E. ADAMS<br />\n<br />\nESTABLISHED 1818<br />\n<br />\nNEWS<br />\nProvisions were recently made at<br />\nLehigh University to insure a happy beginning of the second semester by the members of the Faculty.<br />\nA Faculty dance was held which<br />\nwas unanimously pronounced a social success. Those not caring to<br />\ndance found amusement in several<br />\nrubbers of bridge and other card<br />\ngames.<br />\n* * *<br />\nTwenty-six out of the twentyseven feminine secretaries at Northwestern University have organized<br />\nto combat the fraternities, whom<br />\nthey claim control the campus politics. The young ladies appear to<br />\nbe out for blood.<br />\n* *<br />\nAn edict prohibiting dancing has<br />\nagain been issued at Ohio Northern<br />\nUniversity. Any student who is observed while indulging in such idle<br />\namusement or any student organization, which gives a dance, is threatened with probable expulsion.<br />\n* * *<br />\nThree campus newspapers have<br />\nbeen issued in as many days at the<br />\nUniversity of Manitoba. The trouble started when Leonard L. Knott,<br />\n.the editor of the Manitobian, the official student paper, was asked to resign by the faculty, as a result of<br />\nthe time-worn question of the freedom of the press. A new staff was<br />\nelected to the Manitobian, while<br />\nKnott proceeded to establish a rival paper which he called the Manitoba Student. These two papers<br />\nappeared on successive days, and<br />\non the third day the other publication appeared under the name of the<br />\nRed Herring, which contained libelous reports involving almost every<br />\noutstanding student at the University; and was printed in true fashion on bright red paper. It was finally disclosed that the students responsible were all members of the<br />\nManinew editorial staff of<br />\n_ the<br />\ntoban, who desired an anonymous<br />\ncomeback at Knott, but unhappily<br />\ntried to bite off a good deal more<br />\nthan they were able to masticate.<br />\nNecking parties and \"guzzling\" in<br />\nbootleggers' dives were among the<br />\nlurid accounts enclosed therein. To<br />\ndate libel action has been threatened<br />\nby several students and the matter<br />\nhas been laid in the hands of the<br />\nproper legal authorities.<br />\n* * *<br />\nA rather unique proposal has re cently been made by an alumnus of<br />\nColumbia University.- This loyal<br />\nson has inaugurated a movement to<br />\nhave every alumnus of the institution leave one-tenth of his estate to<br />\nthe University at his death. At<br />\nPresent the movement does not apPear to be progressing very favorably.<br />\n* * *<br />\nPrizes of $500, $300, and $200<br />\nhave been offered by Harper's Magaz:ine for the three best prose manuscripts written by undergraduates<br />\nin any of the American colleges or<br />\nUniversities. Full information concerning the contest may be obtained<br />\nfrom Harper's Magazine, 49 East<br />\n33rd Street, New York City. Thy<br />\ncontest doses March 5.<br />\n<br />\n5<br />\n<br />\n13.4n 0.cearalu &<br />\n<br />\nBARN CAFETERIA<br />\n<br />\nJIEWThILERS<br />\n<br />\n16 West Texingtoit Street<br />\n<br />\nSWARTHMORE<br />\npaffimore<br />\n<br />\nBRUYERE PIPES<br />\n<br />\n0 S,<br />\n<br />\nRegular Price, $2.00<br />\n<br />\ncalie largestselling<br />\ntpinlity pencil<br />\nin the world<br />\n<br />\nWhile They Last, $1.25<br />\nMADISON AVENUE COP.FORTY-FOURTH STREET<br />\nNEW YORK<br />\n<br />\nThe next visit of our Representative to<br />\n<br />\nTHE BELVEDERE<br />\n<br />\n17<br />\nW. W. WALKER<br />\n<br />\nwill be on<br />\nMonday, Tuesday and Wednesday<br />\n<br />\nConnecticut Mutual Life<br />\n<br />\nFebruary 21, 22 and 23<br />\n<br />\nInsurance Co.<br />\n<br />\nblack<br />\ndegrees Superlative in quality,<br />\nthe world-famous<br />\n3<br />\n-copyin<br />\n<br />\nBaltimore, Md.<br />\n<br />\nAt all<br />\ndealers<br />\nBuy<br />\n<br />\na<br />\nSend for BROOKS'S Miscellany<br />\n<br />\nLife Insurance, Trusts, and<br />\nOld Age Incomes<br />\n<br />\nBOSTON<br />\n<br />\nPALM BEACH<br />\n<br />\nNEWPORT<br />\n<br />\nLITTLE BUILDING<br />\nTREMONT DOR. BOYLSTON<br />\n<br />\nPLAZA BUILDING<br />\nCOUNTY R 0 AD<br />\n<br />\nAUDRAIN BUILDING<br />\n220 BELLEVUE AVENUE<br />\n<br />\ndozen<br />\n<br />\nENUS<br />\nPENCILS<br />\ngive best service and<br />\nlongest wear.<br />\nPlain ends, per doz.<br />\nRubber ends,per doz.<br />\n<br />\n$1.00<br />\n1.20<br />\n<br />\nAmerican Pencil Co., 215 Fifth Ave.,N.Y.<br />\nMakersof UNIQUE Thin Lead<br />\n•<br />\nColored Pencils in 12 colors—$1.00 per doz.<br />\n<br />\nLet old Squire Pipe be<br />\nthe judge...<br />\n<br />\nA Sophomore's<br />\nSoliloquy<br />\nG- To Hamlets In Modern Dress 10<br />\n<br />\n0 call or not to call, that is the question—<br />\nWhether 'tis nobler in the mind to write—<br />\nAnd write—<br />\nWhen speech, poured in the ears<br />\n4. Of sympathetic listeners,<br />\nWould still the pangs of doubt—<br />\nDiscouragement—and woe.<br />\nThis sea of troubles— this welter of woe —<br />\nI'll end it all. I'll hie me hence—<br />\nTo a telephone—<br />\nAnd there unload on the folks at home—<br />\nThese trials and tribulations.<br />\nThey'll understand. The next time you want<br />\nto knock old man gloom for a goal— think<br />\nof the telephone. It won't fail you. ,-47 The<br />\nrates after 8:30 P. M. are very low.<br />\n<br />\nTelephone Home!<br />\n<br />\n(he CHESAPEAKE AND POTOMAC<br />\nTELEPHONE COMPANY<br />\n<br />\nHis HONOR, old Squire Pipe is unquestionably the world's ablest judge of pipe<br />\ntobaccos. Who else is by nature, training<br />\nand experience so well-qualified to try a<br />\ntobacco and hand down a decision on<br />\nit?. . So, in the case of Granger Rough<br />\nCut, the plea is that Judge Pipe's verdict<br />\nbe accepted as FINAL!<br />\nTo make a long brief brief: Character<br />\nwitnesses everywhere have sworn to<br />\nGranger's sterling quality. Experts have<br />\nvouched for the superiority of its rough<br />\ncut. Chemists have testified that the new<br />\n\"glassine-sealed\" foil-pouch keeps the<br />\ntobacco in perfect condition.<br />\nFinally, it has been shown that by<br />\nusing this foil-pouch (instead of a costly<br />\ntin) it is possible to sell Granger at just<br />\nten cents. On these arguments Granger<br />\nrests its case! A couple of pipefuls will<br />\nconvince Squire Pipe that it is the world's<br />\ngreatest pipe tobacco . and any good<br />\njudge oftobaccos will confirm the decision!<br />\n<br />\nR<br />\nRANGE<br />\nCUT<br />\nROUGH<br />\n<br />\nThe half-pound vacuum tin is forty-five<br />\ncents, the foil-pouch<br />\npackage, sealed in<br />\nglassine, is ten cents.<br />\n<br />\nfor pipes only!<br />\n<br />\nGranger Rough Cut is made by the Liggett & Myers Tobacco Company<br />\n<br />\n\f6<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br />\nDANCE TO BE HELD<br />\nMONDAY AT BELVEDERE<br />\nDue to a misunderstanding<br />\nwith the Emerson Hotel in regard to the date there will be<br />\nno dance given by the Cotillon<br />\nClub tomorrow night. However, the Club will hold a<br />\ndance next Monday night at<br />\nthe Belvedere Hotel from 9<br />\nto 1. Bob Iula and his orchestra will furnish the music and<br />\nthe charge for admission will<br />\nbe $1.50 for a couple or stag.<br />\n<br />\nNEW VOLUMES ADDED TO<br />\nCLUB'S COLLECTION<br />\nDr. Thayer Himself Brings Book for<br />\nTudor-Stuart Library<br />\n<br />\nA valuable addition to the library of the Tudor and Stuart Club<br />\nwas made Monday evening when<br />\nDr. William S. Thayer, Hopkins<br />\nprofessor emeritus of medicine, presented the club with a volume of<br />\nMarcus Aurelius on behalf of Lady<br />\nWilliam Osler, who entrusted him<br />\nwith the book when he was visiting in England recently.<br />\nThe same evening Dr. Thayer<br />\n(rave a reading of a number of his<br />\npoems, including some recent delightful translations of several Russian verses, before an audience of<br />\nabout thirty members of the club.<br />\nDr. Thayer also commented on and<br />\npassed around three other books recently given the club.<br />\n<br />\nHIGH SCHOOL STUDENTS lege, Polytechnic, Friends', MarsINVITED TO SMOKER<br />\nton's, Dunham's, Tome and Severn.<br />\nAt the Club meeting committees<br />\nVarsity Club to Give Smoker for Men<br />\nwere appointed to plan the program.<br />\nProminent in Prep Affairs<br />\n<br />\nCOTILLON CLUB DANCE<br />\nAT<br />\n<br />\nand make arrangements for a hall.<br />\n<br />\nPrep 'School Men to Attend<br />\n<br />\nHigh school men, active in both<br />\nathletic and non-athletic organizations, will be invited. According to<br />\nJ. Albert Abraham, undergraduate<br />\ncorrespondent of the Club, the object of the smoker is to have the<br />\nprep school men come into a closer<br />\ncontact with Hopkins undergraduates. In an attempt to create such<br />\na friendly relation, prominent officers of the important campus organizations have also been asked to<br />\nattend.<br />\nAt a meeting of the Varsity Club<br />\non Wednesday, Dr. Ray van Orman told members that the main<br />\npurpose of the proposed smoker is<br />\nto influence men prominent in prep<br />\nschool affairs to come to Hopkins.<br />\nA committee of Varsity Club<br />\nmembers will go to every high<br />\nschool in and near Baltimore. They<br />\nplan to send delegations to City Col-<br />\n<br />\nMonday Evening<br />\n<br />\nBob Iula and His Orchestra<br />\nAdmission $1.50 for Single Tioket or Couple<br />\n<br />\nat the smoker.<br />\n<br />\nTEWART&<br />\n<br />\nHoward & Lexingtor,S<br />\n<br />\nCAlvert 6060<br />\n<br />\nCONFIDENTet<br />\nPUBLIC pRODUCTION,OFF<br />\n<br />\nMEN'S INTERWOVEN SOCKS<br />\n<br />\n,PUBLICATIONs<br />\n<br />\nWe carry a full line of these Nationally known socks- mercerized cotton, rayon and silk, plain colors and fancies; all sizes<br />\nfoi men and young men. Priced according to quality<br />\n35c to $1.00 a pair<br />\n<br />\nDemand<br />\n<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n„<br />\n<br />\nRID TAYLOR<br />\nCOMPANY<br />\n2<br />\n, Eng-rowing Printing Binding<br />\n<br />\n)VMOCO GASI<br />\ntiO•<br />\n<br />\nFirst Book Purchased<br />\n<br />\nSpecial interest attaches to the<br />\nvolume he brought over the ocean<br />\nwith him from the fact that it is the<br />\nbook Dr. William Osler first purchased for the founding of the club<br />\nlibrary at Hopkins in memory of<br />\nhis son, Revere, who died in the recent war. There is a notation in<br />\nthe back in Dr. Osler's hand-writing<br />\nwhich reads: \"This is the first book<br />\nbought for Revere's memorial library. Just the sort of bo.ok he,<br />\nloved.\"<br />\nThe book goes by the title of \"The.<br />\nGolden BOk,e of Marcus Aurelius.<br />\nEmperour and Eloquent Oratour\".<br />\nThis edition of the book is the fifth,<br />\npublished in London in 1559, which<br />\nContinued on Page 2, Col. 3<br />\n<br />\nCommittees Appointed<br />\nFor Junior Bauquet<br />\nPlans for the Junior banquet<br />\nwere given a good start last Monday at a meeting of the committee<br />\nin charge. Sub-committees were<br />\nappointed<br />\n<br />\nto take charge of enter-<br />\n<br />\ntainment, music, prograM, and to<br />\n<br />\ndecide upon the place at which the<br />\nbanquet will be held.<br />\nCharles Harris and Douglas<br />\nPrahl were put in charge of the muentertainment; Fred<br />\nsic<br />\nand<br />\nBauernschmidt, Jack Carroll, and<br />\nRichard Griffith were put in charge<br />\nof arranging the program. David<br />\nWatson was given the job of setting the place the banquet is to be<br />\n<br />\nChte<br />\nAl<br />\noLlkss of<br />\n<br />\nto tb.e<br />\n<br />\naccount of<br />\n<br />\n-<br />\n<br />\n.0.<br />\n<br />\nWE<br />\n<br />\nSERVICE T.SIR<br />\n<br />\ntf.\"<br />\nVI 5<br />\nio<br />\n----1),' '- -.-14<br />\nlikV`'<br />\n407,<br />\n'utx.<br />\neiv,<br />\n<br />\n'ROBINSON<br />\n<br />\nNOR. N<br />\n<br />\n1101-1I(.11IS<br />\n<br />\n.3°ENS<br />\n<br />\n'II<br />\nViD<br />\n<br />\nT IM01-1S<br />\n<br />\nIT<br />\nTOBACcO CO<br />\nS-1,1.03!\".E<br />\nAMERICAN<br />\nTilE<br />\n<br />\nbeen<br />\n<br />\nempowered to collect dues.<br />\nThose who fail to pay their dues<br />\nwill not be permitted to attend the<br />\nbanquet.<br />\n<br />\n,oce-PctEstort4t<br />\nAre3749.--s-r<br />\n<br />\n6<br />\nAIVIONSIIIP AND<br />\n<br />\n-11SASYNEIGET CR<br />\nliOGICA1<br />\nTI2C<br />\nBEA:ILI NO<br />\nrENTI<br />\nIVERSVCS BST<br />\nISERE<br />\n?OR<br />\nTELAT<br />\nr2<br />\nTOBACCO IS<br />\nBI.1.3E BOAR<br />\nIIIGE.<br />\n0?<br />\nA31<br />\nAITIONG<br />\nu33Va.cY<br />\nBIUS BO<br />\ncaaTiotis<br />\n-p<br />\nTrS s<br />\nLONG<br />\nCIIAMPION 0?<br />\nColiTENDEB5 FOR<br />\nDISTURBED AS<br />\nBE<br />\nBEEN TO<br />\nIiI17-SLY TO<br />\n14.A.S<br />\nIT<br />\nYEA335<br />\nS NOT<br />\n--------------____<br />\nA.DI<br />\n11<br />\nS<br />\nTOBACCO<br />\n.e. -rSILOICEIti<br />\nGROS<br />\nG<br />\nCRIMIN ATIN<br />\nTITE1<br />\nDV<br />\n-111-1EN<br />\nAS<br />\nING<br />\nGOOD<br />\n1(110-N. A<br />\nB<br />\n<br />\nbefore examinations start. All memhave<br />\n<br />\nAM<br />\n<br />\nWit<br />\nDO<br />\nE.<br />\nMESSAGE<br />\nGEORGC W.<br />\n77,74-!Ald to<br />\ntitGIVI<br />\neRtsiotril<br />\nImerctfl<br />\nLETTER<br />\nWA.<br />\nCARLTON,<br />\ntAIGVIT<br />\n-which arc<br />\nan X<br />\ndesiredi<br />\nbeveof,<br />\nshould Mark<br />\nNEWCOMB<br />\nPatrons class oi serviceMESSAGF.<br />\nbacla.<br />\nthe<br />\n'NE<br />\nAS P.<br />\nsite<br />\ntertas on<br />\nTRANSMITIED<br />\nOTHERWISE<br />\nthe<br />\nTELEGRAM<br />\nsubject to<br />\nWILL VIILL-RATE<br />\nmessage,<br />\nfollowing<br />\nthe<br />\nSend<br />\n<br />\nheld.<br />\nMonday night, April 26, has been<br />\ndecided upon as the tentative date<br />\nof the dinner. The date has been<br />\nset early enough this year to give<br />\nthe Freshmen and SophomoreF<br />\nplenty of time for their banquets<br />\nbers of the committee<br />\n<br />\nV<br />\n<br />\nBELVEDERE HOTEL<br />\n<br />\nProminent prep school students The program group consists of<br />\nwill be the guests of the Varsity Cone, as chairman; Gwinn and Mc<br />\nClub at a smoker on Saturday. Neal. Broening, Blandi, Day, StraMarch 12. Plans for the entertain- der and Boynton will secure a hall<br />\nment were formed at a meeting of for the entertainment.<br />\nthe Club held Wednesday and atMembers of the football squad<br />\ntended by nineteen members.<br />\nwill probably be awarded certificates<br />\n<br />\nOne man tells another<br />\n<br />\n•<br />\n<br />\n'477s<br />\n•-••<br />\n•l\"\\qt\"1<br />\nIt it<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXI, No. 32<br />\nSTONE TO SWIM AGAINST<br />\nARMY IN FIRST MEET<br />\nOF SEASON<br />\nTen Men to Make Trip to West Point;<br />\nArmy Rules Strong Favorite;<br />\nExcels in Backstroke<br /><br />\nHopkins' hopes of making a creditable showing against Army Saturday were raised considerably last<br />\nTuesday when it was announced<br />\nthat Captain Stone will be able to<br />\ncompete. Stone had been previously<br />\nreported as unable to swim because<br />\nof a severe attack of sinus trouble<br />\nand this coupled with the loss. of<br />\nPhilip Lee, former Georgetown<br />\nUniversity star, had dampened the<br />\nardour of the Jay mermen. The<br />\nHopkins captain was expected to resume practice last Tuesday at • the<br />\nKnights of Columbus pool. His return should assure Hopkins of a<br />\nplace in the diving events and possibly in the backstroke: •<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 18, 1927<br /><br />\nFEBRUARY 25 IS<br />\nDEADLINE FOR.DUES<br />\n.February 25 has been set as<br />\na deadline for the payment of<br />\nsenior class dues. If dues are<br />\n1101 in on this date it will be<br />\nimpossible .for the management of the Hullabaloo to inchide their individual picture<br />\nand write-up in the year-book.<br />\nAny seniors who still wish<br />\nto have their picture inserted<br />\nm the annual may do so if they.<br />\nhave their picture taken on or<br />\nbefore February 25.<br />\nOnly approximately the<br />\ndues of twenty men are still<br />\noutstanding.<br />\nThese<br />\nmen<br />\nshould pay their dues to Abrahams, Fennimore, or Bolton. .<br /><br />\nARCHITECTS NOW DRAWING<br />\nPLANS FOR NEW<br />\nBUILDING<br />\nStatistics Collected by 0. D. K.; Activities to Use Barn After Erection<br />\nof New Building<br /><br />\nMaterial collected by the Y. M.<br />\nC. A. and 0. D. K. having a bearing on the proposed student activities building has been turned over<br />\nto local architects,. who are now engaged in drawing up the necessary<br />\nplans. The sketch of the proposed<br />\nbuilding, together with the location<br />\nof desired site, will then be given<br />\nto the University advisory board of<br />\narchitects for their approval.<br />\n0. D. K. Collects Statistics<br /><br />\nHEADS EXERCISES<br /><br />\nPRICE, 5 CENTS<br /><br />\nMUSICAL CLUBS<br />\nARRIVE IN NORFOLK<br />\nNo One Seasick During Journey;<br />\nAdvance Sale Slow<br /><br />\nFIFTY-EIGHT MAKE TRIP<br />\nOrchestra Will Give Radio Concert in Norfolk Tonight<br />\nBY A STAFF CORRESPONDENT<br />\nNorfolk, Va., Feb. 18 (Special<br />\nDispatch to the NEWS-LETTER).<br />\nFifty-eight students of the Johns<br />\nHopkins University arrived here at<br />\n7 A. M. this morning on the steamship, State of Virginia, to give their<br />\nmusical concert tonight at the Hotel<br />\nMonticello. No one reported having suffered sea-sickness as the allnight journey was accomplished on<br />\na smooth sea and in calm weather.<br />\nThe group of students left the<br />\ndock immediately, going to the Monticello where they established their<br />\nDr. Frank J. Goodnow<br />\nheadquarters. Advance sale for ,the<br />\nwho will conduct commemoration<br />\nconcert was reported as rather slow,<br />\nprogram.<br />\nbut it is hoped that many will apply<br />\nCOMMEMORATION ADDRESS for tickets during the day.<br />\nBY DR. W. W. COOK<br /><br />\n0. D. K. during the past few<br />\ndays has collected statistics dealing<br />\nwith the activities of the students<br />\nthat would in any way affect the<br />\nSeniors Invited To<br />\nproposed building. Material has<br />\nAlumni Smoker been gathered as to where the students enter the University grounds,<br />\nTen Men to Make Trip<br />\nMembers of the Class of 1927 the number of students<br />\n. Only ten men . will he taken to<br />\nentering<br />\nWest Point Saturday. . In the ab- have been invited by the Alumni the Barn during the lunch hours,<br />\nsence of Eddie Hill, due-fo- sickness Association of Johns Hopkins Uni- the location of living quarters of<br />\nin New York, Stone will act as tem- versity to be present, as its guests, the students, the number and situporary coach during the meet. Hiss, at the Annual Meeting and Smoker ation of fraternity houses, and the<br />\nWelsh, Stewart, Sheffield, Davis, of the Association to be held in the number of students dwelling in Dr. Goodnow to Preside at Exercises Bay Boat Leaves<br />\nBaltimore at 6:30<br />\nSmith, Hemmeter, and Muir will Alumni Memorial Dormitory on them. Information has also been<br />\nat Peabody Next Tuesday<br />\nalso probably make the trip. • Ac- Tuesday at 8 P. M.<br />\nsecured as to the amount of food<br />\nDr. Walter Wheeler Cook, Pro- Cheers, howls, whoops, and yells<br />\ncording to Max Armour, assistant Those wishing to attend this sold at the Barn.<br />\nof Equity in Yale Univer- rent the air as the Old Bay Lite<br />\nmanager of the swimmers, Hopkins' smoker are requested to notify LarMr. Schaal stated that the plan fessor<br />\nboat, State of Virginia, left Baltirepresentatives will compete. in six kin Farinholt, president of the Sen- of the building does not call for new sity and Visiting Professor of JurUniversity, will more Harbor last night at •6:30<br />\nevents. Hiss and Welsh are prac- ior class, as soon as possible.<br />\noffices for the student activities on isprudence in this<br />\no'clock, carrying the combined<br />\ntically'certain to swim in the fiftythe campus, as plans are on foot, deliver the address at the Fifty- Johns Hopkins Musical<br />\nClubs to<br />\nCelebration in comyard dash, whereas • Stewart and Junior Dues Being<br />\nto utilize the present building for First Annual<br />\nNorfolk..<br />\nFifty-eight<br />\nstudents<br />\ncommemoration of the founding of<br />\nSheffield will probably handle the<br />\nPaid Rapidly that purpose. At a recent meeting Johns Hopkins. His subject will prised the party that will arrive in<br />\nhundred. Davis is the four-forty<br />\n0. D. K. recommended to the board<br />\n\"Science and the Law.\" As us- Norfolk early tomorrow morning.<br />\nentrant. In the dives Stone will<br />\nJunior Class dues are coming in of architects that the offices of the be<br />\nFifty of them will participate in the<br />\nmost likely be assisted by Hemmeter well, according to Leonard Dalsem- various activities remain in the ual, the exercises will be held at<br />\nconcert<br />\ntonight at the Monticello<br />\neleven o'clock on the morning of<br />\nand Hiss • and Muir are slated for er, treasurer of the class. However. Barn.<br />\nHotel.<br />\nFebruary 22 at the Peabody Instithe backstroke. The team ex- no plans for the class banquet will<br />\nCafeteria to Be Included<br />\nThe last vestige of daylight was<br />\ntute.<br />\npects to leave Baltimore on Fri- be formulated until all members of<br />\nAccording to plans suggested by<br />\nfading away as the boat was seen<br />\nDr. Cook Familiar Figure<br />\nday at two-thirty in the afternoon, the class have paid.<br />\na committee consisting of Dr.<br />\nto disappear amid tlie twinkling<br />\narriving at West Point at eight- The Junior Class has been divided French, Mr. Schaal, and Douglas Dr. Cook, who is a familiar figlights of the bay traffic. Long beure to Hopkins students, took his<br />\nthirty in the evening. The meet is<br />\nfore the last faint shriek had been<br />\ninto eight parts, each one of which C. Turnbull, Jr., the new building<br />\nscheduled for two-thirty the followwill contain a cafeteria, soda foun- A. B. in 1901. Since then he has heard as the ship turned its prow<br />\nhas<br />\nbeen<br />\nassigned<br />\nto<br />\none<br />\nmember<br />\nof<br />\ning day.<br />\ntain, club room, ladies' room, li- taught mathematics at Columbia and toward the south. The skyline of<br />\nthe banquet committee in order that<br />\nArmy Favored to-Win<br />\nbrary lounge, reception room, new various branches of the Law at Co- Baltimore showed faintly against<br />\nlumbia, Nebraska, Michigan, WisAlthough Army rules a strong f every man's dues may be solicited quarters for the \"Y,\" and<br />\nseveral<br />\nthe darker blue of the evening sky,<br />\nand Yale universities. He<br />\nconsin,<br />\nvorite, Jay enthusiasts obtained a personally.<br />\ncommittee rooms.<br />\ndotted with yellow splotches of<br />\nis also a legal writer of note. He<br />\nray of hope last week when the It has been very difficult in the<br />\nMr. Schaal stated that plans are<br />\nlight.<br />\nwill discuss the application of scien•<br />\nTo Give Radio Concert<br />\nnews was received that Penn had past for the committee in charge o going ahead rapidly for financing<br />\ntific method in everyday legal prac- On board the boat, before she<br />\nunexpectedly walloped the cadet class banquets to calculate the num- the building. A committee is being tice. Dr. Cook's address is listed<br />\nleft, there was not a face that failmermen. Army is rather weak in ber of men expected at the banquet. appointed which will begin secur- as the sixth event' on the Commem- ed<br />\nto shine with pleasure and anthe dashes and the breast stroke. so this year no news concerning the ing funds in order that work may oration Day Program.<br />\nticipation. Some tried to find their<br />\nMassachusetts Tech also took a fall banquet will be divulged until the begin as soon as the plans are apstateroom-mates and others were inAcademic Procession<br />\nexercises<br />\nThe<br />\nwill<br />\nopen<br />\nwith<br />\nthe<br />\nclass<br />\nwhole<br />\nhas<br />\nquiring about dinner. Many redues.<br />\npaid<br />\nits<br />\nout of the Cadet natators.<br />\nproved.<br />\nAcademic<br />\nprocession<br />\nwhich<br />\nusual<br />\nmained on the deck to watch the<br />\nThe outstanding Army event<br />\nwill be headed by Dr. Frank J. sailors at work preparing the cables<br />\nDR.<br />\nTURNER<br />\nRECENT<br />\nIN<br />\nMAGAZINE<br />\nARTICLE<br />\nseems to be the 150-yard back<br />\nFIXES BLAME FOR WORLD WAR Goodnow, President of the Univer- for the tug that was to haul the ship<br />\nstroke. Both Finlay and Garton<br />\nWhat is the genesis of the World of powers, Dr. Turner says. On the sity; Governor Albert C. Ritchie, into the harbor.<br />\nhave been making excellent times in<br />\nWar? Is blame to be qualified or one hand was the Triple Alliance, Mayor Howard Jackson, the Chap- President Passano announced<br />\nContinued on. Page 3, Col. 1<br />\nunqualified? Who is to blame? which consisted of the German Em- lain, other distinguished guests and that the Blue Jay Orchestra will<br />\nMany factors contributed to the pire, Austria-Hungary, and Italy. the Trustees of the University give a radio concert of dance music<br />\nDr. Diez To Lecture<br />\nbreaking out of the great struggle. Afterwards Rumania, Bulgaria, and Next will come the University Fac- over station WTAR, Norfolk, toAt C. E. Hall Today Can any one of them be honestly Turkey were added as appendages. ulty followed by the candidates for night from 7:30 until 8 o'clock.<br />\nFrom there they will go to the hotel<br />\npointed out as more important than On the other hand, was the Triple degrees.<br />\nDr. Ernest Diez of Bryn Mawr the rest?<br />\nto take part in the concert.<br />\nEntente, its membership composed<br />\nThe Rev. Ocar Olsen, D. D.,<br />\nThirty-five Return Tomorrow<br />\nCollege will give an illustrated lec<br />\n\"Evidence is clear and decisive,\" of England, France, and Russia.<br />\nPastor of Mt. Vernon Place Meth- Thirty-five men, comprising the<br />\nture on \"The Art of the Borobudur. writes Dr. E. Raymond Turner, Three times within five years<br />\nodist Episcopal Church, will de- Glee Club and Banjo Club, will rethis afternoon at 5 o'clock, in the Professor of European History at war was scarcely avoided. Crises<br />\non the bay boat Saturday night.<br />\nliver the benediction after the mem- turn<br />\nRall of the Civil Engineering Build- Johns Hopkins, in the February is- had arisen in the Balkans in 1909,<br />\nThe orchestra and soloists, together<br />\nsue of Current History. Germany's and between Russia and Austria- bers of the procession have taken<br />\nwith President Passano, will remain<br />\ning. The lecture is open to the pub<br />\nactions, abetted by the ugly part of Hungary in 1912 and 1913. The their places. At this point the<br />\nover<br />\nto carry out their part in the<br />\nlie.<br />\nAustria among other far-reaching final crisis, which was to merge in- Johns Hopkins Orchestra will renprogram given by the hotel's \"WinDr. Diez was formerly professor causes, led immediately into the to a world conflict, was the assasder a melody entitled \"Spring,\" by ter Garden\" every Saturday night.<br />\nof History of Art at the University war. During the war the Allies gen- sination of Archduke Franz FerdiGrieg, to be immediately followed Many of the club's adherents will<br />\nof Vienna and a celebrated author- erally agreed upon Germany's nand, heir to the thrones of Austria<br />\nby the conferring of degrees. Sev- likewise remain over. These men<br />\nity on Oriental Art.<br />\nwill return by train or boat on Sunblame. Official publications of the and Hungary, and his wife, at Saraenty-four will be given to Bachelors<br />\nday.<br />\nThe Borobudur of Java, of which Germans and the Austrians, access jevo in Austria-Hungary. The assassins were subjects of the Dual of Engineering, together with a<br />\nWhether the trip will be a great<br />\nDr. Diez will lecture this afternoon. to government archives, and much<br />\nMonarchy, abetted by Serbian se- number of others in subjects rang- financial success, or failure, one<br />\nis better known as the beautiftil comment have confirmed earlier<br />\ncret societies dreaming of a greater ing from Hygiene and Public Heald- thing is certain—the members of the<br />\n\"Temple of the Thousand Bud- judgments.<br />\nSerbia.<br />\non down to the Bachelors of Arts Musical Clubs are now having fhe<br />\ndhas.\"<br />\nThere were two opposing groups<br />\ntime of their lives!<br />\nContinued on Page 4, Col. 1<br />\nContinued on Page 3, Col. 2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED<br /><br />\n1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the<br />\nGER,<br /><br />\nJOHNS HOPKINS UNIVERSITY;<br /><br />\nshould be sent to the<br /><br />\nall articles and other communications<br /><br />\nYES and NO<br /><br />\nUniversity 0100<br /><br />\nBusiness Manager<br /><br />\nEditor-in-Chief<br />\nHENRY JARRETT,<br /><br />\n'27<br /><br />\nEUGENE O'DUNNE, JR.,<br /><br />\n'27<br /><br />\nManaging Editor<br />\nF. REESE, '27<br /><br />\nCHARLES<br /><br />\nAdvertising Manager<br />\nAssistant Managing Editor<br />\nMORTON HAMBURGER, JR., '28<br />\nAssociate Editors<br />\nRICHARD R. GRIFFITH, '28<br />\nRALPH KIRKLEY, '28<br />\nDONALD C. NILES, '27<br />\n, NORMAN B. GARDINER, JR., '28<br /><br />\nJunior Editors<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nGEORGE E. BANKS, JR.,'29<br />\nLEONARD B. NOLLEY, '29<br />\nJOHN G. TURNBULL, '29<br />\nA. BERNARD CHANCELLOR, JR., '28<br />\nDONALD HISS, '29<br />\nPHILIP NESS, '29<br />\nRICHARD H. WOOD, '29<br /><br />\nTHOMAS<br /><br />\nF.<br /><br />\nMCNEAL, '27<br /><br />\nCirculation Manager<br />\nHEYWARD<br /><br />\nE. BOYCE,<br /><br />\nJR.,<br /><br />\n'27<br /><br />\nAssistant Business Managers<br />\nLAWRENCE<br /><br />\n0.<br /><br />\nMCCORMICK, '28<br /><br />\nBORTNER, '27<br />\nIRviN B. HOFFMAN,'28<br />\nDONALD C. WEILLER, '28<br />\nSAMUEL M. HECHT, '29<br />\nLouis M. RAWLINS, '28<br />\nZANVYL E. KRIEGER, '28<br />\nGEORGE M. GLAZIER, '29<br />\nH. ADDISON CAMPBELL, '29<br />\nWILLIAM<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by The Read-Taylor Press, South and Lombard Streets<br /><br />\nAN OPPORTUNITY<br />\nNext Tuesday will witness the fifty-first Commemoration<br />\nExercises of the University. Such an event needs no recommendation from the NEWS-LETTER. In common with every editor •<br />\nbefore us, we urge the undergraduates to attend. Officials of the<br />\nUniversity have spent months in arranging a program which will<br />\nbe impressive and interesting. Surely the student can forget the<br />\ndaily grind of studies and activities for one day, and be present<br />\nat an event which will bring home to him, perhaps for the first<br />\ntime, the importance and magnitude of his university.<br /><br />\nDIME DIPLOMACY<br />\nAgain we take our hats off to the Interfraternity Board.<br />\nIt was generally thought that last year that august body, with its<br />\nquick convictions and dollar fines, had set a shining example of<br />\nwhat not to do. Last Monday, however, the members surpassed<br />\nthemselves. They appear as loath to spend money for cups as<br />\nthey were to collect it in the form of fines. In this effort to<br />\nrival the Coolidge administration in economy, all notions of fair<br />\nplay and all sense of obligation seems to have been forgotten.<br />\nA few years ago the Board instituted an Interfraternity baseball tournament. The plan succeeded famously, and the tournament became an annual event. Not least among the factors in<br />\nthe success of the idea was the silver loving cup presented each<br />\nyear to the winning fraternity.<br />\n.Last year when the appointed time had rolled around the<br />\nbaseball games were played as usual. Delta Gamma Theta put<br />\nout a nine which routfd all of Its rivals and won the championship together with a perfectly valid claim to the cup. The trophy,<br />\nhowever, was not forthcoming; the Board, perhaps, was in financial difficulty, having collected only two dollars in fines.<br />\nThe delegates, proverbially open minded, did not want to see<br />\nbaseball<br />\nvictors cheated out of their cup; so last Monday they<br />\nthe<br />\nproceeded to set matters right by voting them out of it in an<br />\neminently legal manner. Since cups are expensive and since<br />\nthe winner of two years ago naturally refused to give up its trophy,<br />\nthe Board, prudent in money matters, wisely decided that, beginning with last year, there should be but one cup, which should<br />\ncirculate from chapter house to chapter house until the end of<br />\ntime.<br />\nIf the ruling were to go into effect this season, it might deserve commendation. But a retroactive ruling which deprives a<br />\nfraternity of a trophy they won honorably is another matter entirely. Sometime ago we spoke of the \"dollar diplomacy\" of the<br />\nInterfraternity Board;'now, it seems, they have shifted their attention to even smaller denominations.<br /><br />\nTHE NEWS-LETTER<br /><br />\nMAILBAG<br />\nTHOSE GENTLE SOLDIERS<br />\nTo the Editor of the NEWS-LETTER.<br />\nDear Sir:<br />\nCritics of the R. 0. T. C. have<br />\nseized the opportunity presented by<br />\nthe Frederick Y. M. C. A. conference's hostile resolution to again try<br />\nto blackball and belittle the former<br />\norganization. To call the R. 0. T.<br />\nC. militaristic is patently ridiculous;<br />\non the contrary, the object of the<br />\nmilitary training at this University,<br />\nas expressed by the Hopkins professors of military science and by the<br />\nrepresentative of the Third Corps<br />\nArea at the military exercises last<br />\nspring is to create a strong enough<br />\nreserve force to make aggressive nations chary of attacking the United<br />\nStates.<br />\nFurthermore, it has always been<br />\nthe object of the R. 0. T. C. to<br />\ntrain into its members an antipathy<br />\nto all war and a realization that<br />\nthey themselves will be the first to<br />\nfall in such a war. \"We do not<br />\nwant war\" is the constant cry.<br />\nIn addition to giving training in<br />\npatriotism—particularly respect for<br />\nthe flag, national anthem, etc.—the<br />\ncourse in military training affords<br />\nexercise and disciplinary training<br />\nfor the men. A far greater good<br />\ncomes to the latter from marching<br />\nin a prescribed manner than from<br />\nwalking in a haphazard fashion.<br />\nOpportunities for leadership are<br />\ngiven to all men who show talent<br />\nafter the completion of the first<br /><br />\nThere is a quaint tradition extant among our authorities, to<br />\nthe effect that there shall be no smoking in the corridors and classrooms of our various fire-proof buildings. One wonders at their<br />\npersistence in such a patently ridiculous ideal. Polite signs are<br />\nplastered throughout our otherwise dignified hall-ways; keennosed professors have traced the errant smoke-wisps of Camels,<br />\nChesterfields, and the distinctly collegiate Lucky Strikes to their<br />\ninnocent sources; the omnipresent decrepit janitor spends his peaceful hours reminding the undergraduate of rules;—and the undergraduate smokes<br />\nOne reason for the stubbornness of the janitors may be contained in their unwillingness to soil their brooms.<br />\nNo habitual smoker among Hopkins students ever leaves a<br /><br />\nMANAGING EDITOR.<br /><br />\nTelephone<br /><br />\nJ.<br /><br />\nBUSINESS MANA-<br /><br />\n1<br /><br />\nbuilding merely for the purpose of catching a drag. He becomes<br />\nadept at palming his cigarette when passing Dr. Latane's office,<br />\nhe learns to apprehend the moment of the janitor's shuffling appearance, and he makes a habit of opening the windows during<br />\na quiz. Such interruptions to scholastic pursuits, however, as<br />\nthat of a certain spectacled, puny, stupid Ethiope who broke in<br />\non an English examination to enforce the law—such interruptions are inexcusable.<br />\nThis moral obtuseness on the part of the students is not<br />\nmerely an outgrowth of a general disapproval of rules and regulations. Rather, it indicates clearly the need of some loafing place,<br />\nto be enjoyed by the mass. For those who object to walking<br />\nthrough food, sitting on greasy papers; for any who detest the<br />\nmessiness of spilled milk, melted ice-cream, or for those who lack<br />\nsufficient Hopkins spirit to enthuse over ghastly trophies of the<br />\nvintage of 1900, the loft of the Barn constitutes a sty rather than<br />\na retreat. The fortunate \"litterati\" who compose the Tudor and<br />\nStuart Club can escape to the undoubted refuge of their club<br />\nroom; others are permitted to descend to the post-office; but there<br />\nis no smoking-room for the rest of the rabble<br />\nDo Y. M. C.<br />\nA. men smoke? I've never seen one so doing, even in Gilman<br />\n.Hall, where everyone smokes. It must certainly be arranged<br />\nbeforehand that the undergraduate may do as he pleases in the<br />\nnew \"Y\" building.<br />\nJust received a letter from some kind-hearted if mysterious<br />\ncontributor who realizes the value of poetry as a space-filler.<br />\nTo \"Yes and No\"—Some inquiry has been made by your<br />\ncolumn as to what the students think about. Do you really think<br />\nthey think? The majority is a mass of luke-warm morons with,<br />\nat most, three opinions: (1) the relative potency of Paul's gin<br />\nas compared with Light Lunch's,(2) the relative merits of Sarah's<br />\nline as compared with Sally's, and (3) the relative charms of the<br />\nchoruses of \"Lemaire's Affairs\" and the \"Scandals.\"<br />\nNo one knows what the professors think. They seldom think<br />\nout loud, at any rate. ... Speaking of professors, the student body<br />\ndoesn't know them nearly well enough. Advertising is needed.<br />\nHere's a swell lecture to sleep through:<br /><br />\nyear.<br /><br />\nEven if Morton Hilmburger left<br />\nthe R. 0. T. C. after the second<br />\nyear, a few prominent men remained, among them the President<br />\nof the Junior Class and one of its<br />\nStudent Council Representatives.<br />\nThe decreased government appropriation makes it impossible for any<br />\nto be retained except the ones who<br />\nhave shown the greatest proficiency.<br />\nThe time and summer camp requirements also lead many men to withdraw after the second year.<br />\nAs to Hamburger's charge that<br />\nthe best men on the campus are not<br />\nR. 0. T. C. members, let me suggest that the Hopkins candidates<br />\nfor the last Rhodes Scholarship<br />\nwere both officers in the military<br />\nunit. The Evening Sun please note.<br />\nVery truly yours,<br />\nNORMAN B. GARDINER, JR.<br /><br />\nYoung men, I most sincerely trust<br />\nYou'll understand the care I must<br />\nEmploy, to be completely just<br />\nTo all concerned.<br />\nI think I'd better first betray<br />\nThe symptoms of a frank dismay,<br />\nBefore attempting to convey<br />\nWhat I have learned.<br /><br />\nSPRING IS HERE?<br />\nTo the Editor of the NEWS-LETTER.<br />\nDear Sir:<br />\nAnd also kindly let me urge<br />\nYes, spring is here. Perhaps not<br />\nYour pardon for whatever surge<br />\nin its entirety—there is still snow<br />\nOf pompous words may now emerge;—<br />\non the ground, on most nights there<br />\nPlease listen well.<br />\nis frost, and the trees and grass do<br />\nnot show a trace of green as yet-The facts of which I now will speak<br />\nbut it is nevertheless here. It haunts<br />\nCan scarce be covered in a week;<br />\nthe sultry atmosphere, it lurks in<br />\nFor out-side reading, one should seek—<br />\nthe sunlight filtering through the<br />\nBut there's the bell.<br />\ngrey bank of clouds, it hovers iu<br />\n—Meander.<br />\nsheltered corners of the campus<br />\nbuildings. But in the thoughts of<br />\nDR. THAYER GIVES BOOK friend of Dr. Osler.<br />\nmany of the students it has already<br />\nThe other three volumes acquired<br />\nTO LITERARY CLUB<br />\nblossomed into .the full, annual<br />\nby the club were: \"Five Stuart<br />\nContinued from Page 6, Cot. 1<br />\nfever.<br />\nmakes it a very valuable possession. Princesses\", edited by Robert S. Charlie Waite settles himself in<br />\nThe work is not the \"Meditations\" Rait, which was sent directly to the his comfortable desk chair to smoke<br />\nof Marcus Aurelius, but a transla- club by Lady Osler; \"The Life and a pipe before starting to do that contion by John Bourchier, second Death of Cardinal Wolsey\", by temptible chemistry home work. It<br />\nBaron Berners, from a French ver- George Cavendish, illustrated with is his firm determination to make<br />\nsion of \"El Relox de Principes\" by portraits by Holbein, which was at least a nine-five in every course<br />\nAntonio de Guevara. It was com- given by Mrs. Rupert Norton, of this half—besides<br />\nstarring in the<br />\npleted only six days before Ber- Baltimore; and a gift of Dr. Barnstormers' play and running off<br />\nners' death and was first published Thomas Richmond Boggs, \"The with the lacrosse honors. By sysUniversal Angler\", published in<br />\nin 1534.<br />\ntematic work he will be able to make<br />\nTo be sure that the rare volume London in 1676, containing three the first string easily; once in that<br />\nwould reach its destination safely, books on fishing, by Izaak Walton, position athletic honors will be easy<br />\nLady Osler gave it into the keeping Charles Cotton, and Colonel Robert for him.<br />\nof Dr.• Thayer, who was a personal Venables, respectively.<br />\nContinued on Page 4, Col. 2<br />\nC<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br />\nDR. FRENCH PICKS TWO<br />\nDEBATING TEAMS<br /><br />\nBusiness Assistants<br />\nAppointed To Jay<br /><br />\nO'Dunne, Niles and Bull Compose First<br />\nTeam; Triangle Debate Arranged<br /><br />\nResults of tryouts for the Johns<br />\nHopkins Intercollegiate Debating<br />\nTeam were announced today by Dr.<br />\nJohn Calvin French, adviser. The<br />\nresults are as follows: Eugene<br />\nO'Dunne, chairman; Donald C.<br />\nNiles and Robert Bull, first team;<br />\nNorman Gardiner, chairman; Carey<br />\nThompson and Irving Hoffman,<br />\nsecond team. Fenimore and Meyers<br />\nwill serve as alternates, if necessary. The members are listed in accordance with their ability as rated<br />\nby Dr. French.<br />\nThe schedule which is being completed will probably include debates<br />\nwith Davison University, Wake<br />\nForest College of North Carolina,<br />\nand William and Mary of Virginia<br />\nDebates with northern colleges will<br />\nalso probably be arranged.<br />\nA triangle debate with Washington and Lee and University of<br />\nNorth Carolina will be held on May<br />\n6 in which both the first and second<br />\nteams will compete.<br /><br />\nSWIMMERS MEET- ARMY<br />\nContinued from Page 1, Col. 1<br /><br />\nthis race. Finlay recently broke an<br />\nold academy record when he negotiated the distance in two minutes<br />\nflat. This is the Army's fifth meet<br />\nof the season, they having won two<br />\nin addition to the two losses cited<br />\nabove.<br />\nIn spite of the blows dealt their<br />\nhopes by Eddie Hill's sickness and<br />\nthe loss of such promising candidates as Lee, who was to have been<br />\nthe mainstay of the team, the Hopkins swimmers feel confident that<br />\nthey will make a good showing in<br />\nthis, their first meet of the year.<br /><br />\nHarry Levine, M. D. Ghent, L.<br />\nA. Covell, C. Reider, and A. Bordley have been elected business assistants to the staff of the Black and<br />\nBlue Jay. The office of business<br />\nassistant has just recently been created and is designed to give credit<br />\nto non-staff members who contribute ads to the Jay. The campus<br />\nhas always given credit to literary<br />\ncontributors by printing their names<br />\nin the issue to which they have contributed and now business contributors will be recognized also.<br />\nThe Jay is running a contest for<br />\nthe member of the business staff doing the most for the magazine, the<br />\nprize being a trip to New York.<br />\nHarry B. Wolf, Jr., with $150 in<br />\nads and much office work to his<br />\ncredit; Richard Wood, with $600<br />\nin ads, and Samuel Hecht, with $800<br />\nin ads, are leading the race at the<br />\npresent time.<br />\nDR. COOK TO SPEAK<br />\nContinued from Page 1, Col. 1<br /><br />\n3<br /><br />\nTHE ART<br />\nCLEANERS and DYERS<br />\n2442 St. Paul St. cor. 25th St.<br />\nPhone HOmewood 8471<br />\nBaltimore, Md.<br />\nPhone,CAl. 1380<br /><br />\nHome—HO. 2095-J<br /><br />\nFRANCES T. BANNON<br />\nSuccessor to HARBAUGH Sc BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nBaltimore, Md.<br /><br />\nKodaks<br />\nCameras<br />\nSupplies<br /><br />\nDeveloping<br />\nPrinting<br /><br />\nEnlarging<br /><br />\nZepp Photo Supply Co.<br />\n3044 Greemnount Ave.<br /><br />\nLet Us Develop Your Films<br />\nLeave Them Today—<br />\nGet Them Tomorrow<br /><br />\ncrp<br /><br />\n-...ozt Cunard Ma „<br />\ndive for dear old Rutgers'\", and<br />\n'College Specials to<br />\ncl<br />\nbefore<br />\nthe words had left his smiling<br />\nEurope and Return<br />\nlips, Ralph Raritan found himself plunging head foremost from his lofty pinnacle.<br /><br />\nPhone UNiversity 3829<br /><br />\n$170<br />\nTO S190<br /><br />\nA. H. FETTING<br />\nMANUFACTURING JEWELRY<br />\nCO.<br /><br />\nRound Trip<br />\nTourist Third Cabin<br /><br />\nManufacturers<br />\nGREEK LETTER FRATERNITY<br />\nJEWELRY<br />\n213 N. LIBERTY STREET<br /><br />\nThe Best Time<br />\nTo Go-Before Mid-June<br /><br />\nAfter the degrees have been conferred the Orchestra will render a LAFAYETTE TAILORING CO.<br />\nselection froin Beethoven. Upon the<br />\n1 EAST LAFAYETTE AVE.<br />\ncompletion of this piece Dr. Cook<br />\nWhere Quality Counts<br />\nwill deliver his address and then<br />\nCleaning and Pressing<br />\nPresident Goodnow will follow with<br />\nCall VErnon 6233-J<br />\nthe announcements. The celebration will conclude with the singing<br />\nof the University Ode and a benediction.<br />\nAll classes will be suspended on<br />\nthe day of the Commemoration Celebration and all undergraduates are<br />\nurged to attend.<br />\nThe ushers will be Farinholt,<br />\nGwitm, Jarrett, O'Dunne, Passano,<br />\nV<br />\nE<br />\nReese, Stone, and Warfield.<br /><br />\nSounds like a dime novel, but no,<br />\ndear readers, it is merely an episode<br />\nin the cruise of a Cunard College<br />\nSpecial to Europe.<br />\nGood fellows all! Each day aboard<br />\nship abounding in sport and fun —and<br />\nthen London, Paris, the Continent!<br />\nSee your local<br />\nCunard College Representative<br />\nor write<br /><br />\nor after Mid-July<br />\nBox 1039<br /><br />\nMR. DONALD WHITE<br />\nJohns Hopkins University<br />\nor Local Agents<br /><br />\nBalto, Md<br /><br />\nCUNARD &amp; ANCHOR LINES<br />\n107 E. BALTO. ST. BALTO,<br /><br />\nC<br /><br />\nA<br /><br />\nMEL<br /><br />\n-fr.: 110111111y<br /><br />\nTake your Choice<br />\nRich Black and Gold,<br />\nBlack-tipped Lacquer-red, or<br /><br />\nGreen Jade<br />\nBlack =tipped<br />\nParker Duofold is made in all 3 effects<br />\nThose who like Green Jade will agree<br />\nit's easy to decide which Jade to buy. For<br />\nhere,in the Parker Duofold,this popular<br />\ncolor is in combination with trim Black<br />\nTips—doubly smart and effective.<br />\nAnd Parker Duofold is the only pen<br />\nwith the Ink-Tight Duo-Sleeve Cap and<br />\nBarrel of Non-Breakable Permanite.The<br />\npen with the Point that's guaranteed 23<br />\nyears, not only for mechanical perfection<br />\nbut for wear!<br />\n• So don't confuse Parker Duofold with<br />\nother pens that are similar in color only.<br />\nLook for the imprint of master craftsmanship—\"Geo. S. Parker —DUOFOLD.\"<br /><br />\n1 1 1il it<br />\n•<br /><br />\nu 1111,<br />\n1 11111A!'<br />\n,<br />\n,,01.1.7,40reer? .<br /><br />\n--444111144112<br />\n!<br />\n. 4H ---<br /><br />\nYou are an experienced smoker<br />\nand you know your brand!<br />\nYOU'RE an experienced smoker.<br /><br />\nYou know good tobaccos. You<br />\nknow taste and fragrance.<br /><br />\nDuofold<br />\n01'3k-1344?<br /><br />\nCOMPANY, JANESVILLE, WISCONSIN<br /><br />\nwould not be far and away the<br />\nfirst. If Camels weren't quality<br />\nsupreme, they would not be the<br />\noverwhelming preference of smokers who have tried every brand.<br /><br />\nAnd you insist on the best —<br />\nthat's Camels. Only the primest<br />\ntobaccos grown are good enough<br />\nYour taste tells you the tobacco<br />\nfor you—the experienced smoker. difference in cigarettes and you're<br />\nWhatever you do you are going to going to smoke the best. Your<br />\ndo right, if you know it.<br />\nadvice to others is — \"Have a<br />\nIf Camels weren't the best, they Camel!\"<br /><br />\nOver-size Duofold Pen,$7.<br />\nParker Duofold Jr. or Lady<br />\nDuofold, $5. Pencils to<br />\nmatch, $3, $3.50 and $4,<br />\naccording to size. All good<br />\ndealers have them.<br /><br />\nTHE PARKER PEN<br /><br />\nStialtr<br />\n111AIIIIIMMenousistuaitiissis•<br />\n. 1. 11114'<br /><br />\n[Meeting a train in the Union station]<br /><br />\ni'arker<br />\nLucky Curve Feed<br />\nand 25-KarPoint<br /><br />\n91h<br /><br />\nR. J. REYNOLDS TOBACCO COMPANY, WINSTON-SALEM, N. C.<br /><br />\n1927<br /><br />\nTHEAJOHNS HOPKINS NEWS-LETTER; FEBRUARY 18, 1927<br /><br />\n4<br />\nINTERFRATERNITY CUPS<br />\nTO BE AWARDED<br />\nScholarship Honors and Baseball Champions to Get Trophies<br /><br />\nHOPKINS SWIMMING COACH TELLS<br />\nHOW TO LEARN BACK STROKE<br />\nEDITOR'S NOTE:<br /><br />\nEddie Hill, coach of the Jay mermen, discusses<br />\nin this article the art of swimming the back stroke.<br /><br />\nIn spite of the fact that Delta<br />\nGamma Theta was acknowledged<br />\nbaseball champion in the tournament conducted by the Interfraterpity Board last year, they have not<br />\nyet received the promised prize.<br />\nThis fact was revealed at last<br />\nMonday's meeting of the board<br />\nwhen representatives of the fraternity complained that they had not<br />\nbeen awarded the cup. An investigation followed and the fraternity<br />\nwho now has possession of• the<br />\nprize refused to relinquish it, arguing that they had been awarded it<br />\npermanently.<br /><br />\nThe easiest method for a crawl<br />\nAlthough the back stroke is a recognized stroke with its many advan- swimmer to learn the back stroke<br />\ntageous uses, it is not a popular is to lie flat on the back, as if floatstroke. It is a stroke adaptable to ing, extend arms over the head and<br />\npersons with a long arm reach. It then start the flutter kick.<br />\nis not an easy stroke to master, Palms of the hand should be<br />\nwhich I believe accounts for the slightly turned outward and downfew swimmers adapting themselves ward, with hands cupped. The<br />\nto it. However, it should be encour- arms absolutely rigid are pulled<br />\naged for its usfffulness as a life- down to the side. They alternate, resaving medium as well as its use in sembling a semi-circle, while the<br />\ncompetition, since it is considered legs with toes pointing downward<br />\nas one of the three recognized in, are held close together with the<br />\nstrokes.<br />\nknees bending slightly on each kick.<br />\nBefore attempting to master this A common error is to put the head<br />\nstroke one should be able to swim too far back in the water. The corNew Cup to Be Purchased<br />\nThe secretary of the board was the crawl with the utmost ease and rect position of the head is elevated<br />\nthe correct similar to a person lying down with<br />\nthen instructed to purchase a new relaxation. This gives<br />\nmust be a head rest. Unlike the crawl swimwhich<br />\ndrive<br />\nor<br />\nleg<br />\ncup for the uncrowned victors. kick<br />\narms. mer, the. back stroker should enthe<br />\nof<br />\nThis award will remain the property worked independent<br />\nwhich<br />\nform<br />\nthe correct<br />\ncourage a decided rolling motion of<br />\nof the Interfraternity Board, the To acquire<br />\nswimmers possess, the body which not only is good<br />\nfraternity winning the baseball few back stroke<br />\nspeed at first, form but also is a means to increase<br />\navoid<br />\nshould<br />\none<br />\nchampionship being allowed to have<br />\nonly<br />\nwith practice. the speed.<br />\ncome<br />\nwill<br />\nwhich<br />\nits custody for one year. Every<br /><br />\nyear it will have the name of the<br />\nwinner for that year engraved<br />\nupon it.<br />\nAverages for the scholastic year<br />\n1925-26 have been inaccessible to<br />\nthe board, but an effort is being<br />\nmade to procure them and the cup<br />\nwill be awarded in the near future.<br />\nNext week will see the beginning<br />\nof the Interfraternity Bridge Tournament. Two matches will be played a week. The series will be run<br />\nin \"round robin\" form and the winning fraternity will be presented<br />\nwith a cup.<br />\nDR. TURNER ON WAR<br />\nContinued from Page 1, Col. 3<br /><br />\nMAILBAG<br /><br />\nAustria moved -slowly, knowing<br />\nthat war with Serbia meant wai<br />\nwith Russia. At the same time Germany assured Austria of her full<br />\nsupport should a war come between<br />\nAustria and Russia. Had it not beey<br />\nfor this assurance, Austria would<br />\nnever have attacked Serbia, main.<br />\ntains Dr. Turner.<br />\nCompliance to Austrian demands<br />\nmeant . possible subserviency for<br />\nSerbia. The Serbian governmen'<br />\noffered to yield if the demands were<br />\nmade by a conference of European<br />\nnations. To this and to proposals<br />\nby England for intermediation by a<br />\nconference Germany was opposed.<br />\nMeanwhile Germany assured Italy of compensation in event Austria-Hungary gained Balkan lands<br />\nThe Kaiser informed Russia that<br />\nmobilization meant war. German<br />\nthreats caused Russia to mobilize the class.<br />\nbeen made<br />\nGermany declared war on August .The statement has<br />\ndo not think<br />\n1, 1914. Austria advanced into that undergraduates<br />\nLet us here highly resolve that this<br />\nSerbia.<br />\nzip<br />\nshall not have been in vain, that<br />\nWhen the French government deshall not<br />\ncided that war was preferable to' this studying, under God,<br />\npeace pledged with certain frontier be . . . .<br />\nfortresses, Germany declared war \"Mr. Waite, what do you know<br />\ntheory of<br />\nupon France on August 3. Great about the molecular<br />\n?\"<br />\ngases<br />\nBritain entered the struggle to upNo, spring is not here yet!<br />\nhold the \"scrap of paper\" that neuRUSTY.<br />\ntralized Belgium.<br /><br />\nHOLIN<br />\n\"THE WONDER MOTOR FUEC:<br /><br />\nSHERWOOD BROS., INC.<br /><br />\neight., to<br />\nForyDollars<br /><br />\n1<br /><br />\nWrite for Interesting Booklet<br />\n'The STETSON HAT in LITERATURE\"<br />\nJohn B.Stetson Company. Phdadelpbia<br /><br />\na<br /><br />\nAmmormil<br /><br />\nCorona has the<br />\nfeatures<br />\nyou want<br />\nYou can't get all these advantages in any other portable!<br /><br />\nH<br />\nIS<br />\nOL<br />\nAB<br />\nautointoxication/<br />\n•<br /><br />\nStandard keyboard<br />\n12-yard self reversing ribbon<br />\n10-inch carriage<br />\nMargin release on keyboard<br />\nBack spacer on keyboard<br />\nVariable line spacer<br />\nAdjustable paper guide<br />\nSelf-spacing carriage return<br />\n100% visibility<br />\nProved durability<br /><br />\nM. W. LUCY &amp; CO.<br />\nAGENTS<br />\n104 W. Fayette St.<br /><br />\nNo use trying to rise and shine<br />\nwhile you're keeping yourself<br />\nhalf - dead from self - generated<br />\npoisons.<br />\nPut your system on a paying basis.<br />\nKeep your digestive organs functioning properly. Make an attempt<br />\nto balance your daily diet.<br /><br />\neat<br /><br />\nSHREDDED<br />\nWHEAT<br />\nYou can put on a corn roast<br />\nbarbecue, weiner party, etc.,<br />\nanytime,anywhere with Saunders System cars. A car for<br />\nfive costs less than rail fare.<br />\nGlad to serve your bunch.<br />\nCoupes, Sedans or Touring.<br /><br />\nBRAN,SALTS, VITAMINS,PROTEINS and CARBOHYDRATES are all contained in Shredded Wheat<br /><br />\nin appetizing and digestible form. Crisp,delicious.<br />\nshreds of vital body-building nutriments. Two<br />\ndaily biscuits of Shredded Wheat eaten regularly will make you fit and keep you fit. Begin<br />\nnow and see!<br /><br />\nSAUNDERS SYSTEM<br /><br />\nEven Skeptics<br />\nAren't Doubtful<br />\nAbout This<br /><br />\n1BET<br /><br />\n70elL dressed gentlemen.ad-knowledge.thepreeminence,<br />\nof Stetson.. smartness...<br />\nand appreciate, the..<br />\neconomiesofStetson,<br />\nqua/4y<br /><br />\nc'TETS N H<br />\nefwedjoryounyncen<br /><br />\nContinued from Page 2, Col. 5<br />\nIt is obvious that Charlie is not<br /><br />\na senior, or he would not have such<br />\nan optimistic view of the second semester, even with spring but a<br />\nmonth off. Damn it all, though, that<br />\npipe has gone out and he must finish it and get to his work. . . Yes,<br />\nnine-fives, Barnstormers, laciosse.<br />\nAnd after that, June 'Week. But<br />\nwho to ask to go with him? He<br />\nhasn't seen Stella for over a year<br />\nnow; she would be a winner at any<br />\nparty, judging from what she was<br />\nlast time he saw her. Then there is<br />\nMarge—the girl he met at the Nu<br />\nEgg dance last week; sparkling blue<br />\neyes, slender, medium height—who<br />\nshall it be! . . .<br />\nConfound that Chemistry! Must<br />\nhave been asleep. Eleven-thirty and<br />\nnothing done. Will have to work till<br />\none to finish. This scientific mess—<br />\natomic theory—molecular weight-combining weights—eleven-fifty and<br />\nno headway made. Better get up<br />\nabout five and do the blasted problems; now, to bed.<br />\nIt is human to err. The five<br />\no'clock alarm is conveniently<br />\nstifled, Charlie sleeps again, and<br />\nawakes to find it seven-forty-five.<br />\nEight-thirties are always a pain.<br />\nBut, oh that Chemistry! If we are<br />\nas 'faithless to our work as this,<br />\nCharlie boy, six-five will be the<br />\nheight of our triumph. Then a mad<br />\nscramble for breakfast, the trolley,<br /><br />\n1<br /><br />\n11 E. North Ave.<br />\nVErnon 2704<br /><br />\nQuick Getaway For<br />\nAn Early Class<br /><br />\nMake ita daily habit<br />\n-\"Pwilimaimmimms<br /><br />\nTH E JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br /><br />\nINTERCOLLEGIATE<br /><br />\nE. E. ADAMS<br /><br />\nESTABLISHED 1818<br /><br />\nNEWS<br />\nProvisions were recently made at<br />\nLehigh University to insure a happy beginning of the second semester by the members of the Faculty.<br />\nA Faculty dance was held which<br />\nwas unanimously pronounced a social success. Those not caring to<br />\ndance found amusement in several<br />\nrubbers of bridge and other card<br />\ngames.<br />\n* * *<br />\nTwenty-six out of the twentyseven feminine secretaries at Northwestern University have organized<br />\nto combat the fraternities, whom<br />\nthey claim control the campus politics. The young ladies appear to<br />\nbe out for blood.<br />\n* *<br />\nAn edict prohibiting dancing has<br />\nagain been issued at Ohio Northern<br />\nUniversity. Any student who is observed while indulging in such idle<br />\namusement or any student organization, which gives a dance, is threatened with probable expulsion.<br />\n* * *<br />\nThree campus newspapers have<br />\nbeen issued in as many days at the<br />\nUniversity of Manitoba. The trouble started when Leonard L. Knott,<br />\n.the editor of the Manitobian, the official student paper, was asked to resign by the faculty, as a result of<br />\nthe time-worn question of the freedom of the press. A new staff was<br />\nelected to the Manitobian, while<br />\nKnott proceeded to establish a rival paper which he called the Manitoba Student. These two papers<br />\nappeared on successive days, and<br />\non the third day the other publication appeared under the name of the<br />\nRed Herring, which contained libelous reports involving almost every<br />\noutstanding student at the University; and was printed in true fashion on bright red paper. It was finally disclosed that the students responsible were all members of the<br />\nManinew editorial staff of<br />\n_ the<br />\ntoban, who desired an anonymous<br />\ncomeback at Knott, but unhappily<br />\ntried to bite off a good deal more<br />\nthan they were able to masticate.<br />\nNecking parties and \"guzzling\" in<br />\nbootleggers' dives were among the<br />\nlurid accounts enclosed therein. To<br />\ndate libel action has been threatened<br />\nby several students and the matter<br />\nhas been laid in the hands of the<br />\nproper legal authorities.<br />\n* * *<br />\nA rather unique proposal has re cently been made by an alumnus of<br />\nColumbia University.- This loyal<br />\nson has inaugurated a movement to<br />\nhave every alumnus of the institution leave one-tenth of his estate to<br />\nthe University at his death. At<br />\nPresent the movement does not apPear to be progressing very favorably.<br />\n* * *<br />\nPrizes of $500, $300, and $200<br />\nhave been offered by Harper's Magaz:ine for the three best prose manuscripts written by undergraduates<br />\nin any of the American colleges or<br />\nUniversities. Full information concerning the contest may be obtained<br />\nfrom Harper's Magazine, 49 East<br />\n33rd Street, New York City. Thy<br />\ncontest doses March 5.<br /><br />\n5<br /><br />\n13.4n 0.cearalu &amp;<br /><br />\nBARN CAFETERIA<br /><br />\nJIEWThILERS<br /><br />\n16 West Texingtoit Street<br /><br />\nSWARTHMORE<br />\npaffimore<br /><br />\nBRUYERE PIPES<br /><br />\n0 S,<br /><br />\nRegular Price, $2.00<br /><br />\ncalie largestselling<br />\ntpinlity pencil<br />\nin the world<br /><br />\nWhile They Last, $1.25<br />\nMADISON AVENUE COP.FORTY-FOURTH STREET<br />\nNEW YORK<br /><br />\nThe next visit of our Representative to<br /><br />\nTHE BELVEDERE<br /><br />\n17<br />\nW. W. WALKER<br /><br />\nwill be on<br />\nMonday, Tuesday and Wednesday<br /><br />\nConnecticut Mutual Life<br /><br />\nFebruary 21, 22 and 23<br /><br />\nInsurance Co.<br /><br />\nblack<br />\ndegrees Superlative in quality,<br />\nthe world-famous<br />\n3<br />\n-copyin<br /><br />\nBaltimore, Md.<br /><br />\nAt all<br />\ndealers<br />\nBuy<br /><br />\na<br />\nSend for BROOKS'S Miscellany<br /><br />\nLife Insurance, Trusts, and<br />\nOld Age Incomes<br /><br />\nBOSTON<br /><br />\nPALM BEACH<br /><br />\nNEWPORT<br /><br />\nLITTLE BUILDING<br />\nTREMONT DOR. BOYLSTON<br /><br />\nPLAZA BUILDING<br />\nCOUNTY R 0 AD<br /><br />\nAUDRAIN BUILDING<br />\n220 BELLEVUE AVENUE<br /><br />\ndozen<br /><br />\nENUS<br />\nPENCILS<br />\ngive best service and<br />\nlongest wear.<br />\nPlain ends, per doz.<br />\nRubber ends,per doz.<br /><br />\n$1.00<br />\n1.20<br /><br />\nAmerican Pencil Co., 215 Fifth Ave.,N.Y.<br />\nMakersof UNIQUE Thin Lead<br />\n•<br />\nColored Pencils in 12 colors—$1.00 per doz.<br /><br />\nLet old Squire Pipe be<br />\nthe judge...<br /><br />\nA Sophomore's<br />\nSoliloquy<br />\nG- To Hamlets In Modern Dress 10<br /><br />\n0 call or not to call, that is the question—<br />\nWhether 'tis nobler in the mind to write—<br />\nAnd write—<br />\nWhen speech, poured in the ears<br />\n4. Of sympathetic listeners,<br />\nWould still the pangs of doubt—<br />\nDiscouragement—and woe.<br />\nThis sea of troubles— this welter of woe —<br />\nI'll end it all. I'll hie me hence—<br />\nTo a telephone—<br />\nAnd there unload on the folks at home—<br />\nThese trials and tribulations.<br />\nThey'll understand. The next time you want<br />\nto knock old man gloom for a goal— think<br />\nof the telephone. It won't fail you. ,-47 The<br />\nrates after 8:30 P. M. are very low.<br /><br />\nTelephone Home!<br /><br />\n(he CHESAPEAKE AND POTOMAC<br />\nTELEPHONE COMPANY<br /><br />\nHis HONOR, old Squire Pipe is unquestionably the world's ablest judge of pipe<br />\ntobaccos. Who else is by nature, training<br />\nand experience so well-qualified to try a<br />\ntobacco and hand down a decision on<br />\nit?. . So, in the case of Granger Rough<br />\nCut, the plea is that Judge Pipe's verdict<br />\nbe accepted as FINAL!<br />\nTo make a long brief brief: Character<br />\nwitnesses everywhere have sworn to<br />\nGranger's sterling quality. Experts have<br />\nvouched for the superiority of its rough<br />\ncut. Chemists have testified that the new<br />\n\"glassine-sealed\" foil-pouch keeps the<br />\ntobacco in perfect condition.<br />\nFinally, it has been shown that by<br />\nusing this foil-pouch (instead of a costly<br />\ntin) it is possible to sell Granger at just<br />\nten cents. On these arguments Granger<br />\nrests its case! A couple of pipefuls will<br />\nconvince Squire Pipe that it is the world's<br />\ngreatest pipe tobacco . and any good<br />\njudge oftobaccos will confirm the decision!<br /><br />\nR<br />\nRANGE<br />\nCUT<br />\nROUGH<br /><br />\nThe half-pound vacuum tin is forty-five<br />\ncents, the foil-pouch<br />\npackage, sealed in<br />\nglassine, is ten cents.<br /><br />\nfor pipes only!<br /><br />\nGranger Rough Cut is made by the Liggett &amp; Myers Tobacco Company<br /><br />\n6<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1927<br />\nDANCE TO BE HELD<br />\nMONDAY AT BELVEDERE<br />\nDue to a misunderstanding<br />\nwith the Emerson Hotel in regard to the date there will be<br />\nno dance given by the Cotillon<br />\nClub tomorrow night. However, the Club will hold a<br />\ndance next Monday night at<br />\nthe Belvedere Hotel from 9<br />\nto 1. Bob Iula and his orchestra will furnish the music and<br />\nthe charge for admission will<br />\nbe $1.50 for a couple or stag.<br /><br />\nNEW VOLUMES ADDED TO<br />\nCLUB'S COLLECTION<br />\nDr. Thayer Himself Brings Book for<br />\nTudor-Stuart Library<br /><br />\nA valuable addition to the library of the Tudor and Stuart Club<br />\nwas made Monday evening when<br />\nDr. William S. Thayer, Hopkins<br />\nprofessor emeritus of medicine, presented the club with a volume of<br />\nMarcus Aurelius on behalf of Lady<br />\nWilliam Osler, who entrusted him<br />\nwith the book when he was visiting in England recently.<br />\nThe same evening Dr. Thayer<br />\n(rave a reading of a number of his<br />\npoems, including some recent delightful translations of several Russian verses, before an audience of<br />\nabout thirty members of the club.<br />\nDr. Thayer also commented on and<br />\npassed around three other books recently given the club.<br /><br />\nHIGH SCHOOL STUDENTS lege, Polytechnic, Friends', MarsINVITED TO SMOKER<br />\nton's, Dunham's, Tome and Severn.<br />\nAt the Club meeting committees<br />\nVarsity Club to Give Smoker for Men<br />\nwere appointed to plan the program.<br />\nProminent in Prep Affairs<br /><br />\nCOTILLON CLUB DANCE<br />\nAT<br /><br />\nand make arrangements for a hall.<br /><br />\nPrep 'School Men to Attend<br /><br />\nHigh school men, active in both<br />\nathletic and non-athletic organizations, will be invited. According to<br />\nJ. Albert Abraham, undergraduate<br />\ncorrespondent of the Club, the object of the smoker is to have the<br />\nprep school men come into a closer<br />\ncontact with Hopkins undergraduates. In an attempt to create such<br />\na friendly relation, prominent officers of the important campus organizations have also been asked to<br />\nattend.<br />\nAt a meeting of the Varsity Club<br />\non Wednesday, Dr. Ray van Orman told members that the main<br />\npurpose of the proposed smoker is<br />\nto influence men prominent in prep<br />\nschool affairs to come to Hopkins.<br />\nA committee of Varsity Club<br />\nmembers will go to every high<br />\nschool in and near Baltimore. They<br />\nplan to send delegations to City Col-<br /><br />\nMonday Evening<br /><br />\nBob Iula and His Orchestra<br />\nAdmission $1.50 for Single Tioket or Couple<br /><br />\nat the smoker.<br /><br />\nTEWART&amp;<br /><br />\nHoward &amp; Lexingtor,S<br /><br />\nCAlvert 6060<br /><br />\nCONFIDENTet<br />\nPUBLIC pRODUCTION,OFF<br /><br />\nMEN'S INTERWOVEN SOCKS<br /><br />\n,PUBLICATIONs<br /><br />\nWe carry a full line of these Nationally known socks- mercerized cotton, rayon and silk, plain colors and fancies; all sizes<br />\nfoi men and young men. Priced according to quality<br />\n35c to $1.00 a pair<br /><br />\nDemand<br /><br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n„<br /><br />\nRID TAYLOR<br />\nCOMPANY<br />\n2<br />\n, Eng-rowing Printing Binding<br /><br />\n)VMOCO GASI<br />\ntiO•<br /><br />\nFirst Book Purchased<br /><br />\nSpecial interest attaches to the<br />\nvolume he brought over the ocean<br />\nwith him from the fact that it is the<br />\nbook Dr. William Osler first purchased for the founding of the club<br />\nlibrary at Hopkins in memory of<br />\nhis son, Revere, who died in the recent war. There is a notation in<br />\nthe back in Dr. Osler's hand-writing<br />\nwhich reads: \"This is the first book<br />\nbought for Revere's memorial library. Just the sort of bo.ok he,<br />\nloved.\"<br />\nThe book goes by the title of \"The.<br />\nGolden BOk,e of Marcus Aurelius.<br />\nEmperour and Eloquent Oratour\".<br />\nThis edition of the book is the fifth,<br />\npublished in London in 1559, which<br />\nContinued on Page 2, Col. 3<br /><br />\nCommittees Appointed<br />\nFor Junior Bauquet<br />\nPlans for the Junior banquet<br />\nwere given a good start last Monday at a meeting of the committee<br />\nin charge. Sub-committees were<br />\nappointed<br /><br />\nto take charge of enter-<br /><br />\ntainment, music, prograM, and to<br /><br />\ndecide upon the place at which the<br />\nbanquet will be held.<br />\nCharles Harris and Douglas<br />\nPrahl were put in charge of the muentertainment; Fred<br />\nsic<br />\nand<br />\nBauernschmidt, Jack Carroll, and<br />\nRichard Griffith were put in charge<br />\nof arranging the program. David<br />\nWatson was given the job of setting the place the banquet is to be<br /><br />\nChte<br />\nAl<br />\noLlkss of<br /><br />\nto tb.e<br /><br />\naccount of<br /><br />\n-<br /><br />\n.0.<br /><br />\nWE<br /><br />\nSERVICE T.SIR<br /><br />\ntf.\"<br />\nVI 5<br />\nio<br />\n----1),' '- -.-14<br />\nlikV`'<br />\n407,<br />\n'utx.<br />\neiv,<br /><br />\n'ROBINSON<br /><br />\nNOR. N<br /><br />\n1101-1I(.11IS<br /><br />\n.3°ENS<br /><br />\n'II<br />\nViD<br /><br />\nT IM01-1S<br /><br />\nIT<br />\nTOBACcO CO<br />\nS-1,1.03!\".E<br />\nAMERICAN<br />\nTilE<br /><br />\nbeen<br /><br />\nempowered to collect dues.<br />\nThose who fail to pay their dues<br />\nwill not be permitted to attend the<br />\nbanquet.<br /><br />\n,oce-PctEstort4t<br />\nAre3749.--s-r<br /><br />\n6<br />\nAIVIONSIIIP AND<br /><br />\n-11SASYNEIGET CR<br />\nliOGICA1<br />\nTI2C<br />\nBEA:ILI NO<br />\nrENTI<br />\nIVERSVCS BST<br />\nISERE<br />\n?OR<br />\nTELAT<br />\nr2<br />\nTOBACCO IS<br />\nBI.1.3E BOAR<br />\nIIIGE.<br />\n0?<br />\nA31<br />\nAITIONG<br />\nu33Va.cY<br />\nBIUS BO<br />\ncaaTiotis<br />\n-p<br />\nTrS s<br />\nLONG<br />\nCIIAMPION 0?<br />\nColiTENDEB5 FOR<br />\nDISTURBED AS<br />\nBE<br />\nBEEN TO<br />\nIiI17-SLY TO<br />\n14.A.S<br />\nIT<br />\nYEA335<br />\nS NOT<br />\n--------------____<br />\nA.DI<br />\n11<br />\nS<br />\nTOBACCO<br />\n.e. -rSILOICEIti<br />\nGROS<br />\nG<br />\nCRIMIN ATIN<br />\nTITE1<br />\nDV<br />\n-111-1EN<br />\nAS<br />\nING<br />\nGOOD<br />\n1(110-N. A<br />\nB<br /><br />\nbefore examinations start. All memhave<br /><br />\nAM<br /><br />\nWit<br />\nDO<br />\nE.<br />\nMESSAGE<br />\nGEORGC W.<br />\n77,74-!Ald to<br />\ntitGIVI<br />\neRtsiotril<br />\nImerctfl<br />\nLETTER<br />\nWA.<br />\nCARLTON,<br />\ntAIGVIT<br />\n-which arc<br />\nan X<br />\ndesiredi<br />\nbeveof,<br />\nshould Mark<br />\nNEWCOMB<br />\nPatrons class oi serviceMESSAGF.<br />\nbacla.<br />\nthe<br />\n'NE<br />\nAS P.<br />\nsite<br />\ntertas on<br />\nTRANSMITIED<br />\nOTHERWISE<br />\nthe<br />\nTELEGRAM<br />\nsubject to<br />\nWILL VIILL-RATE<br />\nmessage,<br />\nfollowing<br />\nthe<br />\nSend<br /><br />\nheld.<br />\nMonday night, April 26, has been<br />\ndecided upon as the tentative date<br />\nof the dinner. The date has been<br />\nset early enough this year to give<br />\nthe Freshmen and SophomoreF<br />\nplenty of time for their banquets<br />\nbers of the committee<br /><br />\nV<br /><br />\nBELVEDERE HOTEL<br /><br />\nProminent prep school students The program group consists of<br />\nwill be the guests of the Varsity Cone, as chairman; Gwinn and Mc<br />\nClub at a smoker on Saturday. Neal. Broening, Blandi, Day, StraMarch 12. Plans for the entertain- der and Boynton will secure a hall<br />\nment were formed at a meeting of for the entertainment.<br />\nthe Club held Wednesday and atMembers of the football squad<br />\ntended by nineteen members.<br />\nwill probably be awarded certificates<br /><br />\nOne man tells another<br /><br />\n•<br /><br />\n'477s<br />\n•-••<br />\n•l\"\\qt\"1<br />\nIt it<br /><br />"}], "field_media_file": [{"target_id": 38127, "display": null, "description": null, "target_type": "file", "target_uuid": "5d2bc4c6-e2d8-4c05-aef3-f81c0162809a", "url": "http://digital.library.jhu.edu/system/files/2022-03/13253-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13253, "target_type": "node", "target_uuid": "17e917c8-80e5-4194-a5cd-8231838a9d11", "url": "/node/13253"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e0bd556a-ef81-441e-8cc6-06a0ec5751a9"}]}