{"mid": [{"value": 51397}], "uuid": [{"value": "6a24ba9d-8f50-4064-b953-5ca8935ae514"}], "vid": [{"value": 51397}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T20:25:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "16047-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T20:25:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T20:25:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Chemistry Laboratory :<br />\n<br />\n <br />\n<br />\nRathskellar<br />\n<br />\n <br />\n<br />\nHobkins Union<br />\n<br />\nc A Guide<br />\n“Io (4<br />\n<br />\n“Homewood Gampus<br />\n<br />\nQf e<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n~ THE HOMEWOOD CAMPUS<br />\n<br />\nThé Johns Hopkins University, founded in 1876, was the<br />\nfirst educational institution in this country oriented toward<br />\n<br />\ngraduate study and research — it is often called America’s<br />\n<br />\n1,,..ﬁ.rst,twe.ugi.versiiyr,_.w._4<br />\n<br />\nToday the University comprises six academic divisions:<br />\nthe Faculty of Arts and Sciences and the Evening College<br />\non the Homewood campus; the School of Medicine, the<br />\nSchool of Hygiene and Public Health, and the School of<br />\nHealth Services located together with The Johns Hopkins<br />\nHospital in East Baltimore; and the School of Advanced In-<br />\nternational Studies in Washington, D.C. The Applied Phy-<br />\nsics Laboratory is operated by the University in Howard<br />\nCounty. ' ‘<br />\n<br />\nJohns Hopkins is the smallest of the nation’s front-rank<br />\n<br />\n- universities; full-time enrollment in all divisions is ap-<br />\n<br />\nproximately 4,500 students.<br />\n<br />\n‘The Arts and Sciences and Evening College divisions<br />\n<br />\nmoved in 1916 from downtown Baltimore to Homewood,<br />\nthe 140-acre North Baltimore estate that had been estab-<br />\nlished over a century before by Charles Carroll of Carroll-<br />\nton — a signer of the Declaration of Independence. The<br />\ncampus was planned as a cohesive unit, with most of the<br />\nbuildings designed in the stately Georgian style derived<br />\n<br />\n- from historic Homewood House, built in 1801. Consid-<br />\n<br />\nered one of the most perfect examples of Georgian archi-<br />\ntecture in America, the house stands at the main entrance<br />\nto the University grounds.<br />\n<br />\nThe Faculty of Arts and Sciences, which includes the<br />\nundergraduate division, consists of 27 academic depart-<br />\nments offering baccalaureate, master’s, and doctoral pro-<br />\ngrams in the humanities, natural sciences, physical sci-<br />\nences, engineering, quantitative studies, and social and<br />\nbehavorial sciences. Some 2,000 undergraduate students<br />\n<br />\n- and 1,000 graduate students are taught by a single faculty<br />\n<br />\nof approximately 300 members.<br />\n<br />\nThe oldest of the University’s divisions, the Faculty of Arts<br />\nand Sciences has continuously adhered to the philoso-<br />\nphy of Daniel Coit Gilman, the first president, who be-<br />\nlieved that teaching and research were inseparable con-<br />\nstituents of a university, and that the objective of the insti-<br />\ntution should be the creation as well as the collection and<br />\ndissemination of knowledge.<br />\n<br />\nThe Evening College, founded in 1909, is one of the coun-<br />\ntry’s oldest part-time adult education enterprises and now<br />\nserves some 5,500 students. It consists of five divisions:<br />\n<br />\n~arts and the social sciences; engineering, physical, and<br />\n<br />\nmathematical sciences; education; administrative and<br />\nbusiness sciences; and special interdisciplinary pro-<br />\ngrams. In addition to the associate and baccalaureate de-<br />\ngrees, the Evening College offers programs leading to the<br />\nmaster’'s degree and certificate of advanced study in 15<br />\nmajor areas, including liberal arts, engineering, science,<br />\neducation, urban planning, and administrative science. A<br />\nprogram leading to the doctorate in education is offered in<br />\nhuman communication and its disorders.<br />\n<br />\nThe Milton S. Eisenhower Library<br />\n<br />\nNamed after the University’s eighth president, the Eisen-<br />\n<br />\nhower Library houses more than 1.5 million volumes,<br />\n<br />\nwhich ranks it among the major research libraries in this<br />\ncountry. On the library’s six floors, four of which are<br />\nunderground, are modern study carrels, an audio depart-<br />\nment, the University Archives, the Dwight D. Eisenhower<br />\nPapers Project, and art galleries. The Albert D. Hutzler<br />\nUndergraduate Reading Room in Gilman Hall supple-<br />\nments the Eisenhower Library facility.<br />\n<br />\n <br />\n<br />\nHomewood Field<br />\n<br />\nBy Car to Homewood<br />\n<br />\nFrom the north via Interstate 95 from New York or New Jersey, proceed south on 1-95 until you reach the<br />\nBaltimore Beltway (1-695). Take the Beltway west (toward Towson) to Exit 25. Exit, turn left at the stop<br />\nsign onto Charles Street. Follow Charles Street south for approximately eight miles to University Park-<br />\nway. The University will be ahead of you on your right. Keep in right lane, and enter the curb lane which<br />\nbegins at the corner of Charles and University. The first traffic light beyond University Parkway will be at<br />\nCharles and 34th Streets. The main entrance to the University is on your right.<br />\n<br />\n- EVENTS AT JOHNS HOPKINS |<br />\n<br />\n& Many seminars and lectures organized by the acadefnic<br />\n<br />\ndepartments are open to the public without charge.<br />\n<br />\nThroughout the year, numerous events are offered by stu-<br />\n<br />\n <br />\n<br />\ndent organizations such as the Barnstormers drama<br />\n<br />\ngroup, the University Band, The Hopkins Glee Club, and<br />\nthe Student Activities Council. For information about stu-<br />\ndent activities call extension 1405.<br />\n<br />\nThe Johns Hdpk'ins University Office of Special Events,r lo-<br />\n<br />\ncated in Shriver Hall, presents a variety of cultural, artis-<br />\n<br />\ntic, and educational programs of interest to both the Hop-<br />\nkins and Baltimore communities throughout the school<br />\nyear. Events include concerts (both individual and series),<br />\nlectures (both individual and series), recitals, plays, dra-<br />\nmatic readings, dance performances, other performing<br />\narts events, and all artexhibits in the galleries of the Milton<br />\nS. Eisenhower Library. '<br />\n<br />\n~ Most of the programs presented by this office are free.<br />\n<br />\nWhen tickets are required, they may be purchased by mail<br />\nor in person at the Office of Special Events (extension<br />\n1451 or 1452), the Book Center in Gilman Hall, or at the<br />\nUnion Desk. Special student rates are available.<br />\n<br />\nShriver Hall Concert Series<br />\n<br />\nEach year the Shriver Hall Concert Series, located in<br />\nShriver Hall, presents six concerts of chamber music per-<br />\nformed by internationally famous artists. Subscriptions<br />\nare available at reasonable prices with special student<br />\nrates and may be purchased at the Shriver Hall Concert<br />\nSeries office (extension 755). Single tickets to each per-<br />\nformance may be purchased on the night of the perform-<br />\n<br />\nance at the box office, if available.<br />\n<br />\nTheatre Hopkins<br />\n<br />\nTheatre Hopkins, an adult community theatre sponsored<br />\nby the University with a company of experienced players<br />\nand a professional director, presents four productions<br />\neach year. Three of these are performed in the Barn, built<br />\nin 1803, on what is now the Homewood campus. The final<br />\nproduction is given in the gardens of Evergreen House.<br />\nSubscriptions and individual tickets are available at the<br />\nTheatre Hopkins office located in Shriver Hall (extension<br />\n1095).<br />\n<br />\nAthletics<br />\n<br />\n7~<br />\n<br />\nThe modern and complete facilities of the Newton H.<br />\n<br />\nWhite, Jr. Athletic Center provide a home for intramural<br />\nprograms and for the University’s twelve intercollegiate<br />\nteams in lacrosse, football, soccer, cross-country, bas-<br />\n<br />\n. ketball, wrestling, swimming, fencing, baseball, track,<br />\n<br />\ntennis and golf. For information on admission to athletic<br />\nevents, call extension 791.<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n- EVERGREEN HOUSE<br />\n<br />\nThe Evergreeh House, located at 4545 North Charles<br />\n<br />\nStreet, was bequeathed to the University by John Work<br />\n<br />\nGarrett in 1942. It is maintained by the Evergreen House<br />\n~ Foundation as a research library for the benefitoftheUni-<br />\nversity and the people of Baltimore.<br />\n<br />\nThe house, a classical revival structure, is situated on<br />\ntwenty-six beautifully wooded acres, with a formal garden<br />\nleading from the great rare book library at the rear of the<br />\nhouse. In addition to rare books, the Evergreen House in-<br />\n<br />\ncludes among its possessions rare coin and stamp collec-<br />\n<br />\ntions, Tiffany glass, and the Alice Garrett collection of<br />\nmodern paintings, drawings and sculpture of Dufy, Bon-<br />\n<br />\nnard, Derain, Picasso, Vuillard, Bakst, Sterne, Forain, and<br />\n<br />\nZuloaga.<br />\n<br />\nThe 'Libraﬂry, a rich resource of natural history and Ameri-<br />\ncan and Maryland imprints and incunabula, is open from<br />\n<br />\n2:00 to 5:00 p.m., Monday through Friday. Arrangements<br />\ncan be made for those desiring to do research or forgroup<br />\n<br />\ntours of the mansion by calling 435-3376.<br />\n<br />\nTHE HOMEWOOD COMMUNITY<br />\n<br />\nThe Homewood campus is in the center of an interesting<br />\nand diverse community. Within walking distance are sev-<br />\n<br />\n~eral community business districts, gracious gardens and<br />\n<br />\nparks, numerous churches, three hospitals, the Baltimore<br />\nMuseum of Art, and a branch of the City’s public library.<br />\n<br />\nBaltimore is a city of neighborhoods, and those adjacent<br />\nto the campus include Hampden, on the west, one of the<br />\nvillages which grew around cotton mills and factories that,<br />\nin the 1880’s, provided about four-fifths of the sail canvas<br />\n<br />\n‘used around the world. Guilford, to the northeast, is a<br />\n<br />\nplanned community of elegant single family residences<br />\nbuilt in neo-Georgian architecture, some dating back to<br />\n1920. Charles Village, to the southeast, was named in 1968<br />\nby a group of neighborhood boosters who wanted to give a<br />\nsense of community to “Peabody Heights.” The Charles<br />\nVillage area is the neighborhood with the highest popula-<br />\n<br />\ntion of students and young professionals.<br />\n<br />\nThese neighborhoods and others, i.e., Harwood, Reming-<br />\nton, Roland Park, Oakenshaw, Tuscany-Canterbury and<br />\nWyman Park, comprise the Greater Homewood commu-<br />\nnity and are served by an umbrella or advocacy corpora-<br />\ntion which the University convened and continues to<br />\n<br />\nsupport.<br />\n<br />\nPlaces to Eat<br />\n<br />\nIn the Homewood community, there are many places to<br />\neat ranging from take-out sandwich shops to gourmet res-<br />\ntaurants. On campus, the cafeteria in the Hopkins Union<br />\nand the snack bar in the dormitories are open to the public.<br />\n<br />\nA cafe, open weekdays except Monday, is located on the<br />\n<br />\nground floor of the Baltimore Museum of Art.<br />\nThe Baltimore Museum of Art<br />\n<br />\nThe Baltimore Museum of Art, located on the southern<br />\nedge of the Homewood campus on land donated to the<br />\ncity by the University, is highly regarded in the art world<br />\nfor its famous Cone Collection of nineteenth and early<br />\ntwentieth century paintings, many by Matisse and<br />\nPicasso. On display continuously are works by the old<br />\nmasters, sculpture, contemporary art and fine period fur-<br />\nniture. The Museum is open daily except Monday.<br />\n<br />\n <br />\n<br />\nEvergreen House<br />\n<br />\nBy Car to Medical Institutions<br />\n<br />\nArriving via Interstate 83 from Pennsylvania, stay left as you approach the Beltway (1-695). Take Charles<br />\n<br />\nStreet exit. Proceed as above to the University.<br />\n<br />\nFrom the south via 1-95, proceed north on 1-95 until you reach the Baltimore Beltway (1-695). Take the<br />\n<br />\nTo reach the East Baltimore campus (the Johns Hopkins Medical Institutions) by car, leave the Home-<br />\nwood campus by the Charles Street entrance and proceed south on the inside lane until reaching 29th<br />\nStreet. Turn left on Maryland Avenue (one way south) and proceed to 25th Street. Turn left on 25th Street<br />\nto St. Paul Street and turn right. Take St. Paul Street south until it divides; bear right onto uphill leg. Then<br />\nturn left onto Orleans Street viaduct. Proceed east on Orleans Street to Broadway. The multi-story<br />\nparking garage for the Medical Institutions is on the northeast corner of Broadway and Orleans Street.<br />\n<br />\nHOW TO REACH THE UNIVERSITY<br />\nBy Bu's 7 |<br />\n<br />\nThe Metropolitan TransittAuth’ority operates two bus lines<br />\n<br />\n~which provide access to the University. The Nos. 3and 11<br />\n<br />\nJOHNS HOPKINS HOMEWOOD CAMPUS MILESTONES<br />\n<br />\nThé Johns Hopkins University Press was the first (1878)<br />\nand is the oldest continually operating university pressin<br />\nthe country.<br />\n<br />\n <br />\n<br />\nrun north on Charles Street to Homewood, and south on<br />\n<br />\nCharles, Maryland, and Cathedral Streets to the down-<br />\n<br />\n- town area. Exact fare is required (30¢).<br />\n<br />\nBy Taxi<br />\n<br />\nFrom downtown, ask the driver to go up Ch‘z;rles or<br />\nHoward Street to the Johns Hopkins Homewood campus.<br />\n<br />\nBy Plane<br />\n<br />\n\" Plan to arrive at Baltimore-Washington International Air-<br />\n<br />\nport at least an hour before you wish to arrive at Home-<br />\n<br />\n- wood. You can take a taxi directly to the campus for ap-<br />\nproximately $10.00; however, there is limousine service to<br />\n<br />\nthe downtown area which costs $2.50. Take the limousine<br />\nto the Baltimore Hilton, and from there take a taxi (ap-<br />\nproximately $2.50) north on Howard Street, or the No. 3 or<br />\n11 bus north on Charles to 34th Street (exact change 30¢).<br />\n<br />\nBy Train<br />\n<br />\nFrom Penn Station taxi fare should be approximately<br />\n$2.00. Or, take the No. 3 or 11 bus north on Charles to 34th<br />\n<br />\n- Street (exact change 30¢).<br />\n<br />\nCampus Tours<br />\n<br />\nStudents who conduct the tours of Homewood campus<br />\nare members of The Blue Key Society. Membership in the<br />\nSociety is selective, and candidates for membership are<br />\nchosen on the basis of their knowledge about the Univer-<br />\nsity, scholastic achievement, and extracurricular involve-<br />\nment. Hopkins students consider it an honor to be se-<br />\nlected to membership in The Blue Key Society. Tours of<br />\nthe campus are conducted weekdays only while classes<br />\nare in session; they depart from the Admissions Office in<br />\nGarland Hall at 11:00 a.m. and 3:00 p.m.<br />\n<br />\nShuttle Bus to the Medical Institutions<br />\n<br />\nAccording to the following schedule: (1) buses leave<br />\nHomewood for the medical institutions in East Baltimore<br />\nhourly on the hour, from the southwest corner of Shriver<br />\nHall; (2) buses leave School of Hygiene East Lobby Park-<br />\ning lot for Homewood on the half hour:<br />\n<br />\nSeptember through May; Monday through Friday —<br />\n<br />\n7:00a.m.to 11:30 p.m.<br />\n<br />\nJune through August; Monday through Friday —<br />\n<br />\n7:00 a.m. t0 6:30 p.m.<br />\n<br />\nNo service on Holidays.<br />\nFor further information about the Homewood Campus,<br />\ncall the Office of Public Information (366-3300, ext. 704).<br />\n<br />\n <br />\n<br />\n  <br />\n<br />\nGilman Hall<br />\n<br />\nBy Car to SAIS<br />\n<br />\nBy Carto APL<br />\n<br />\n <br />\n<br />\nDr. Ira Remsen, first professor of:éhér'r’iigtﬁr‘y and second<br />\n<br />\npresident of the University, discovered saccharin in 1879;<br />\nhe also created the American Chemical Journal.<br />\n<br />\nDr. William Foxwell Albright, the “verifier of the Old Tes-<br />\ntament,” determined the authenticity of the Dead Sea<br />\n<br />\n~Scrollsin 1948.<br />\n<br />\nDr. Henry A. Rowland, first professor of physics, invented<br />\nthe concave grating.<br />\n<br />\nA lecturer at Hopkins in 1877, Charles Peirce became<br />\nknown as the “Father of Semiotics” and together with<br />\nWilliam James, was known also as the “Father of Prag-<br />\nmatism.”<br />\n<br />\nThe carbon monoxide eliminator, an oxidizing device to<br />\nreduce the danger of auto exhaust fumes, was developed<br />\nby Dr. Joseph Frazier.<br />\n<br />\nWoodrow Wilson, the first and only U.S. President with an<br />\nearned Ph.D., earned his doctorate in 1886 at Hopkins.<br />\n<br />\nDr. James Sylvester, the first professor of mathematics,<br />\ndeveloped the invariant theory of matter and founded the<br />\nAmerican Journal of Mathematics.<br />\n<br />\nThe modern concepts of research in cell and develop-<br />\nmental biology were established by Dr. Benjamin Willier.<br />\n<br />\nHopkins firsts in psychology include: the first psycho-<br />\nlogical lab in the nation founded at Hopkins in 1883 by G.<br />\nStanley Hall; the first American Ph.D. in psychology<br />\ngranted to Joseph Jastrow in 1886; Dr. John B. Watson’s<br />\nwork in behaviorism.<br />\n<br />\nDr. Walter Patrick in the 1920’s discovered the amazing<br />\nproperties of silica gel and invented an inexpensive and<br />\nsimple method of producing the substance in quantity.<br />\n<br />\nDr. William McElroy began studies in 1948 which un-<br />\n<br />\nlocked the secrets of luciferin and luciferase, compounds<br />\nresponsible for biological luminescence as exemplified by<br />\nthe firefly.<br />\n<br />\nDr. George Huntington Williams developed a revolution-<br />\nary technique of rock sectioning and a microscope that<br />\ncould analyze these thin slices.<br />\n<br />\nDr. Leo Spitzer, internationally known philologist, and Dr.<br />\nGeorges Poulet, critic of French literature, led the Revo-<br />\n<br />\n~ lution in Literary Criticism.<br />\n<br />\nThe country’s firstR.O.T.C. was established at Johns Hop-<br />\nkinsin 1916.<br />\n<br />\nThe phenomenon of resonance radiation, which became a<br />\nmajor technique of 20th century physics, was discovered<br />\nby Dr. Robert W. Wood.<br />\n<br />\nSidney Lanier became the first university poet-in-resi-<br />\ndence in 1879.<br />\n<br />\nThe Writing Seminars, the first graduate program of its<br />\nkind, were established by poet Elliott Coleman.<br />\n<br />\n <br />\n<br />\nLeave the Homewood campus by the south exit on Howard Street near the Baltimore Museum of Art.<br />\nProceed south on Howard Street to Franklin Street. Turn right on Franklin and go four blocks to Greene<br />\nStreet. Turn left on Greene Street and continue to the Baltimore-Washington Parkway, which is a con-<br />\ntinuation of Greene Street. Take the New York Avenue exit off the Baltimore-Washington Parkway and<br />\ncontinue on as Massachusetts Avenue bears right off of New York Avenue. The School of Advanced Inter-<br />\nnational Studies is at 1740 Massachusetts Avenue just beyond 17th Street.<br />\n<br />\nLeave the Homewood campus by the south exit on Howard Street near the Baltimore Museum of Art. Go<br />\n<br />\none block to 29th Street and turn right. Proceed to the Jones Falls Expressway exit North. Take the Jones<br />\nFalls Expressway to the Baltimore Beltway West. Take Exit 70-N off the Beltway to Route 29. (Or, take<br />\nHoward Street south to Franklin Street. Proceed west on Route 40 to Route 29.) Go south on Route 29 to<br />\nJohns Hopkins Road about four miles below the Columbia exits. Turn right on Johns Hopkins Road and<br />\nproceed to APL entrance.<br />\n<br />\nBeltway east (toward Glen Burnie) until you reach the Baltimore-Washington Parkway (approximately<br />\ntwo miles). Take the Parkway exit north toward Baltimore, and follow the Parkway to Paca Street.<br />\nProceed on Paca Street to Mulberry Street and turn right. Follow Mulberry two blocks and turn left onto<br />\nHoward Street; continue north on Howard beyond 29th Street. Get in left lane and stop at stop sign on<br />\nWyman Park Drive. Proceed straight ahead 200 feet and turn right into the south entrance of the<br />\nUniversity.<br />\n<br />\n- Yohns“Hopkins<br />\n- “University<br />\n<br />\n&<br />\n<br />\nFrom U.S. 40 East or West, drive to Howard Street. Turn north on Howard and proceed as above.<br />\n<br />\n    <br />\n    <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n   <br />\n<br />\n <br />\n<br />\n    <br />\n<br />\n <br />\n<br />\n\\83)<br />\n5 = &5<br />\nA x APPLIED<br />\n&) § < PHYSICS<br />\n5 2 > “on. LABGRATORY<br />\n« = % e i o<br />\n-\\ o SHOPK/<br />\n% evercreen BALTIMORE Yo<br />\n® o HOUSE CITY<br />\n‘3‘; COLD SPRING LA<br />\ni k |<br />\nA<br />\n“j l<br />\n><br />\n<<br />\n1 =N<br />\nTHE |E 335<br />\nJOHNS HOPKINS =<br />\nUNIVERSITY |, |=<br />\n3 z<br />\n(HOMEWOOD) 2 |= . THE [403<br />\n. | {<br />\n- NORTH AVE) » |© 2 \"o”ﬁgﬁfc’ﬁfﬂ\"s : \\ N?g\\RI:z:’:I%:AL<br />\nN, 3 INSTITUTIONS TSTUDIES<br />\nN<br />\n<br />\n <br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n4<br />\n<br />\n <br />\n<br />\n4<br />\n<br />\n <br />\n<br />\no<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n5 MADISON ST.<br />\nFRANKLINST. J 2 Yk MONUMENT 5T<br />\n<___WULBERRY ST \"'—E“\"_._ts s<br />\nBALTIMORE ST |n. 1<br />\n5<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n  <br />\n  <br />\n<br />\n <br />\n<br />\nWASHINGTON<br />\n<br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nHomewood House<br />\n\f", "format": "basic_html", "processed": "Chemistry Laboratory :<br /><br /><br /><br />\nRathskellar<br /><br /><br /><br />\nHobkins Union<br /><br />\nc A Guide<br />\n“Io (4<br /><br />\n“Homewood Gampus<br /><br />\nQf e<br /><br /><br /><br /><br /><br />\n~ THE HOMEWOOD CAMPUS<br /><br />\nThé Johns Hopkins University, founded in 1876, was the<br />\nfirst educational institution in this country oriented toward<br /><br />\ngraduate study and research — it is often called America’s<br /><br />\n1,,..ﬁ.rst,twe.ugi.versiiyr,_.w._4<br /><br />\nToday the University comprises six academic divisions:<br />\nthe Faculty of Arts and Sciences and the Evening College<br />\non the Homewood campus; the School of Medicine, the<br />\nSchool of Hygiene and Public Health, and the School of<br />\nHealth Services located together with The Johns Hopkins<br />\nHospital in East Baltimore; and the School of Advanced In-<br />\nternational Studies in Washington, D.C. The Applied Phy-<br />\nsics Laboratory is operated by the University in Howard<br />\nCounty. ' ‘<br /><br />\nJohns Hopkins is the smallest of the nation’s front-rank<br /><br />\n- universities; full-time enrollment in all divisions is ap-<br /><br />\nproximately 4,500 students.<br /><br />\n‘The Arts and Sciences and Evening College divisions<br /><br />\nmoved in 1916 from downtown Baltimore to Homewood,<br />\nthe 140-acre North Baltimore estate that had been estab-<br />\nlished over a century before by Charles Carroll of Carroll-<br />\nton — a signer of the Declaration of Independence. The<br />\ncampus was planned as a cohesive unit, with most of the<br />\nbuildings designed in the stately Georgian style derived<br /><br />\n- from historic Homewood House, built in 1801. Consid-<br /><br />\nered one of the most perfect examples of Georgian archi-<br />\ntecture in America, the house stands at the main entrance<br />\nto the University grounds.<br /><br />\nThe Faculty of Arts and Sciences, which includes the<br />\nundergraduate division, consists of 27 academic depart-<br />\nments offering baccalaureate, master’s, and doctoral pro-<br />\ngrams in the humanities, natural sciences, physical sci-<br />\nences, engineering, quantitative studies, and social and<br />\nbehavorial sciences. Some 2,000 undergraduate students<br /><br />\n- and 1,000 graduate students are taught by a single faculty<br /><br />\nof approximately 300 members.<br /><br />\nThe oldest of the University’s divisions, the Faculty of Arts<br />\nand Sciences has continuously adhered to the philoso-<br />\nphy of Daniel Coit Gilman, the first president, who be-<br />\nlieved that teaching and research were inseparable con-<br />\nstituents of a university, and that the objective of the insti-<br />\ntution should be the creation as well as the collection and<br />\ndissemination of knowledge.<br /><br />\nThe Evening College, founded in 1909, is one of the coun-<br />\ntry’s oldest part-time adult education enterprises and now<br />\nserves some 5,500 students. It consists of five divisions:<br /><br />\n~arts and the social sciences; engineering, physical, and<br /><br />\nmathematical sciences; education; administrative and<br />\nbusiness sciences; and special interdisciplinary pro-<br />\ngrams. In addition to the associate and baccalaureate de-<br />\ngrees, the Evening College offers programs leading to the<br />\nmaster’'s degree and certificate of advanced study in 15<br />\nmajor areas, including liberal arts, engineering, science,<br />\neducation, urban planning, and administrative science. A<br />\nprogram leading to the doctorate in education is offered in<br />\nhuman communication and its disorders.<br /><br />\nThe Milton S. Eisenhower Library<br /><br />\nNamed after the University’s eighth president, the Eisen-<br /><br />\nhower Library houses more than 1.5 million volumes,<br /><br />\nwhich ranks it among the major research libraries in this<br />\ncountry. On the library’s six floors, four of which are<br />\nunderground, are modern study carrels, an audio depart-<br />\nment, the University Archives, the Dwight D. Eisenhower<br />\nPapers Project, and art galleries. The Albert D. Hutzler<br />\nUndergraduate Reading Room in Gilman Hall supple-<br />\nments the Eisenhower Library facility.<br /><br /><br /><br />\nHomewood Field<br /><br />\nBy Car to Homewood<br /><br />\nFrom the north via Interstate 95 from New York or New Jersey, proceed south on 1-95 until you reach the<br />\nBaltimore Beltway (1-695). Take the Beltway west (toward Towson) to Exit 25. Exit, turn left at the stop<br />\nsign onto Charles Street. Follow Charles Street south for approximately eight miles to University Park-<br />\nway. The University will be ahead of you on your right. Keep in right lane, and enter the curb lane which<br />\nbegins at the corner of Charles and University. The first traffic light beyond University Parkway will be at<br />\nCharles and 34th Streets. The main entrance to the University is on your right.<br /><br />\n- EVENTS AT JOHNS HOPKINS |<br /><br />\n&amp; Many seminars and lectures organized by the acadefnic<br /><br />\ndepartments are open to the public without charge.<br /><br />\nThroughout the year, numerous events are offered by stu-<br /><br /><br /><br />\ndent organizations such as the Barnstormers drama<br /><br />\ngroup, the University Band, The Hopkins Glee Club, and<br />\nthe Student Activities Council. For information about stu-<br />\ndent activities call extension 1405.<br /><br />\nThe Johns Hdpk'ins University Office of Special Events,r lo-<br /><br />\ncated in Shriver Hall, presents a variety of cultural, artis-<br /><br />\ntic, and educational programs of interest to both the Hop-<br />\nkins and Baltimore communities throughout the school<br />\nyear. Events include concerts (both individual and series),<br />\nlectures (both individual and series), recitals, plays, dra-<br />\nmatic readings, dance performances, other performing<br />\narts events, and all artexhibits in the galleries of the Milton<br />\nS. Eisenhower Library. '<br /><br />\n~ Most of the programs presented by this office are free.<br /><br />\nWhen tickets are required, they may be purchased by mail<br />\nor in person at the Office of Special Events (extension<br />\n1451 or 1452), the Book Center in Gilman Hall, or at the<br />\nUnion Desk. Special student rates are available.<br /><br />\nShriver Hall Concert Series<br /><br />\nEach year the Shriver Hall Concert Series, located in<br />\nShriver Hall, presents six concerts of chamber music per-<br />\nformed by internationally famous artists. Subscriptions<br />\nare available at reasonable prices with special student<br />\nrates and may be purchased at the Shriver Hall Concert<br />\nSeries office (extension 755). Single tickets to each per-<br />\nformance may be purchased on the night of the perform-<br /><br />\nance at the box office, if available.<br /><br />\nTheatre Hopkins<br /><br />\nTheatre Hopkins, an adult community theatre sponsored<br />\nby the University with a company of experienced players<br />\nand a professional director, presents four productions<br />\neach year. Three of these are performed in the Barn, built<br />\nin 1803, on what is now the Homewood campus. The final<br />\nproduction is given in the gardens of Evergreen House.<br />\nSubscriptions and individual tickets are available at the<br />\nTheatre Hopkins office located in Shriver Hall (extension<br />\n1095).<br /><br />\nAthletics<br /><br />\n7~<br /><br />\nThe modern and complete facilities of the Newton H.<br /><br />\nWhite, Jr. Athletic Center provide a home for intramural<br />\nprograms and for the University’s twelve intercollegiate<br />\nteams in lacrosse, football, soccer, cross-country, bas-<br /><br />\n. ketball, wrestling, swimming, fencing, baseball, track,<br /><br />\ntennis and golf. For information on admission to athletic<br />\nevents, call extension 791.<br /><br /><br /><br /><br /><br />\n- EVERGREEN HOUSE<br /><br />\nThe Evergreeh House, located at 4545 North Charles<br /><br />\nStreet, was bequeathed to the University by John Work<br /><br />\nGarrett in 1942. It is maintained by the Evergreen House<br />\n~ Foundation as a research library for the benefitoftheUni-<br />\nversity and the people of Baltimore.<br /><br />\nThe house, a classical revival structure, is situated on<br />\ntwenty-six beautifully wooded acres, with a formal garden<br />\nleading from the great rare book library at the rear of the<br />\nhouse. In addition to rare books, the Evergreen House in-<br /><br />\ncludes among its possessions rare coin and stamp collec-<br /><br />\ntions, Tiffany glass, and the Alice Garrett collection of<br />\nmodern paintings, drawings and sculpture of Dufy, Bon-<br /><br />\nnard, Derain, Picasso, Vuillard, Bakst, Sterne, Forain, and<br /><br />\nZuloaga.<br /><br />\nThe 'Libraﬂry, a rich resource of natural history and Ameri-<br />\ncan and Maryland imprints and incunabula, is open from<br /><br />\n2:00 to 5:00 p.m., Monday through Friday. Arrangements<br />\ncan be made for those desiring to do research or forgroup<br /><br />\ntours of the mansion by calling 435-3376.<br /><br />\nTHE HOMEWOOD COMMUNITY<br /><br />\nThe Homewood campus is in the center of an interesting<br />\nand diverse community. Within walking distance are sev-<br /><br />\n~eral community business districts, gracious gardens and<br /><br />\nparks, numerous churches, three hospitals, the Baltimore<br />\nMuseum of Art, and a branch of the City’s public library.<br /><br />\nBaltimore is a city of neighborhoods, and those adjacent<br />\nto the campus include Hampden, on the west, one of the<br />\nvillages which grew around cotton mills and factories that,<br />\nin the 1880’s, provided about four-fifths of the sail canvas<br /><br />\n‘used around the world. Guilford, to the northeast, is a<br /><br />\nplanned community of elegant single family residences<br />\nbuilt in neo-Georgian architecture, some dating back to<br />\n1920. Charles Village, to the southeast, was named in 1968<br />\nby a group of neighborhood boosters who wanted to give a<br />\nsense of community to “Peabody Heights.” The Charles<br />\nVillage area is the neighborhood with the highest popula-<br /><br />\ntion of students and young professionals.<br /><br />\nThese neighborhoods and others, i.e., Harwood, Reming-<br />\nton, Roland Park, Oakenshaw, Tuscany-Canterbury and<br />\nWyman Park, comprise the Greater Homewood commu-<br />\nnity and are served by an umbrella or advocacy corpora-<br />\ntion which the University convened and continues to<br /><br />\nsupport.<br /><br />\nPlaces to Eat<br /><br />\nIn the Homewood community, there are many places to<br />\neat ranging from take-out sandwich shops to gourmet res-<br />\ntaurants. On campus, the cafeteria in the Hopkins Union<br />\nand the snack bar in the dormitories are open to the public.<br /><br />\nA cafe, open weekdays except Monday, is located on the<br /><br />\nground floor of the Baltimore Museum of Art.<br />\nThe Baltimore Museum of Art<br /><br />\nThe Baltimore Museum of Art, located on the southern<br />\nedge of the Homewood campus on land donated to the<br />\ncity by the University, is highly regarded in the art world<br />\nfor its famous Cone Collection of nineteenth and early<br />\ntwentieth century paintings, many by Matisse and<br />\nPicasso. On display continuously are works by the old<br />\nmasters, sculpture, contemporary art and fine period fur-<br />\nniture. The Museum is open daily except Monday.<br /><br /><br /><br />\nEvergreen House<br /><br />\nBy Car to Medical Institutions<br /><br />\nArriving via Interstate 83 from Pennsylvania, stay left as you approach the Beltway (1-695). Take Charles<br /><br />\nStreet exit. Proceed as above to the University.<br /><br />\nFrom the south via 1-95, proceed north on 1-95 until you reach the Baltimore Beltway (1-695). Take the<br /><br />\nTo reach the East Baltimore campus (the Johns Hopkins Medical Institutions) by car, leave the Home-<br />\nwood campus by the Charles Street entrance and proceed south on the inside lane until reaching 29th<br />\nStreet. Turn left on Maryland Avenue (one way south) and proceed to 25th Street. Turn left on 25th Street<br />\nto St. Paul Street and turn right. Take St. Paul Street south until it divides; bear right onto uphill leg. Then<br />\nturn left onto Orleans Street viaduct. Proceed east on Orleans Street to Broadway. The multi-story<br />\nparking garage for the Medical Institutions is on the northeast corner of Broadway and Orleans Street.<br /><br />\nHOW TO REACH THE UNIVERSITY<br />\nBy Bu's 7 |<br /><br />\nThe Metropolitan TransittAuth’ority operates two bus lines<br /><br />\n~which provide access to the University. The Nos. 3and 11<br /><br />\nJOHNS HOPKINS HOMEWOOD CAMPUS MILESTONES<br /><br />\nThé Johns Hopkins University Press was the first (1878)<br />\nand is the oldest continually operating university pressin<br />\nthe country.<br /><br /><br /><br />\nrun north on Charles Street to Homewood, and south on<br /><br />\nCharles, Maryland, and Cathedral Streets to the down-<br /><br />\n- town area. Exact fare is required (30¢).<br /><br />\nBy Taxi<br /><br />\nFrom downtown, ask the driver to go up Ch‘z;rles or<br />\nHoward Street to the Johns Hopkins Homewood campus.<br /><br />\nBy Plane<br /><br />\n\" Plan to arrive at Baltimore-Washington International Air-<br /><br />\nport at least an hour before you wish to arrive at Home-<br /><br />\n- wood. You can take a taxi directly to the campus for ap-<br />\nproximately $10.00; however, there is limousine service to<br /><br />\nthe downtown area which costs $2.50. Take the limousine<br />\nto the Baltimore Hilton, and from there take a taxi (ap-<br />\nproximately $2.50) north on Howard Street, or the No. 3 or<br />\n11 bus north on Charles to 34th Street (exact change 30¢).<br /><br />\nBy Train<br /><br />\nFrom Penn Station taxi fare should be approximately<br />\n$2.00. Or, take the No. 3 or 11 bus north on Charles to 34th<br /><br />\n- Street (exact change 30¢).<br /><br />\nCampus Tours<br /><br />\nStudents who conduct the tours of Homewood campus<br />\nare members of The Blue Key Society. Membership in the<br />\nSociety is selective, and candidates for membership are<br />\nchosen on the basis of their knowledge about the Univer-<br />\nsity, scholastic achievement, and extracurricular involve-<br />\nment. Hopkins students consider it an honor to be se-<br />\nlected to membership in The Blue Key Society. Tours of<br />\nthe campus are conducted weekdays only while classes<br />\nare in session; they depart from the Admissions Office in<br />\nGarland Hall at 11:00 a.m. and 3:00 p.m.<br /><br />\nShuttle Bus to the Medical Institutions<br /><br />\nAccording to the following schedule: (1) buses leave<br />\nHomewood for the medical institutions in East Baltimore<br />\nhourly on the hour, from the southwest corner of Shriver<br />\nHall; (2) buses leave School of Hygiene East Lobby Park-<br />\ning lot for Homewood on the half hour:<br /><br />\nSeptember through May; Monday through Friday —<br /><br />\n7:00a.m.to 11:30 p.m.<br /><br />\nJune through August; Monday through Friday —<br /><br />\n7:00 a.m. t0 6:30 p.m.<br /><br />\nNo service on Holidays.<br />\nFor further information about the Homewood Campus,<br />\ncall the Office of Public Information (366-3300, ext. 704).<br /><br /><br /><br /><br /><br />\nGilman Hall<br /><br />\nBy Car to SAIS<br /><br />\nBy Carto APL<br /><br /><br /><br />\nDr. Ira Remsen, first professor of:éhér'r’iigtﬁr‘y and second<br /><br />\npresident of the University, discovered saccharin in 1879;<br />\nhe also created the American Chemical Journal.<br /><br />\nDr. William Foxwell Albright, the “verifier of the Old Tes-<br />\ntament,” determined the authenticity of the Dead Sea<br /><br />\n~Scrollsin 1948.<br /><br />\nDr. Henry A. Rowland, first professor of physics, invented<br />\nthe concave grating.<br /><br />\nA lecturer at Hopkins in 1877, Charles Peirce became<br />\nknown as the “Father of Semiotics” and together with<br />\nWilliam James, was known also as the “Father of Prag-<br />\nmatism.”<br /><br />\nThe carbon monoxide eliminator, an oxidizing device to<br />\nreduce the danger of auto exhaust fumes, was developed<br />\nby Dr. Joseph Frazier.<br /><br />\nWoodrow Wilson, the first and only U.S. President with an<br />\nearned Ph.D., earned his doctorate in 1886 at Hopkins.<br /><br />\nDr. James Sylvester, the first professor of mathematics,<br />\ndeveloped the invariant theory of matter and founded the<br />\nAmerican Journal of Mathematics.<br /><br />\nThe modern concepts of research in cell and develop-<br />\nmental biology were established by Dr. Benjamin Willier.<br /><br />\nHopkins firsts in psychology include: the first psycho-<br />\nlogical lab in the nation founded at Hopkins in 1883 by G.<br />\nStanley Hall; the first American Ph.D. in psychology<br />\ngranted to Joseph Jastrow in 1886; Dr. John B. Watson’s<br />\nwork in behaviorism.<br /><br />\nDr. Walter Patrick in the 1920’s discovered the amazing<br />\nproperties of silica gel and invented an inexpensive and<br />\nsimple method of producing the substance in quantity.<br /><br />\nDr. William McElroy began studies in 1948 which un-<br /><br />\nlocked the secrets of luciferin and luciferase, compounds<br />\nresponsible for biological luminescence as exemplified by<br />\nthe firefly.<br /><br />\nDr. George Huntington Williams developed a revolution-<br />\nary technique of rock sectioning and a microscope that<br />\ncould analyze these thin slices.<br /><br />\nDr. Leo Spitzer, internationally known philologist, and Dr.<br />\nGeorges Poulet, critic of French literature, led the Revo-<br /><br />\n~ lution in Literary Criticism.<br /><br />\nThe country’s firstR.O.T.C. was established at Johns Hop-<br />\nkinsin 1916.<br /><br />\nThe phenomenon of resonance radiation, which became a<br />\nmajor technique of 20th century physics, was discovered<br />\nby Dr. Robert W. Wood.<br /><br />\nSidney Lanier became the first university poet-in-resi-<br />\ndence in 1879.<br /><br />\nThe Writing Seminars, the first graduate program of its<br />\nkind, were established by poet Elliott Coleman.<br /><br /><br /><br />\nLeave the Homewood campus by the south exit on Howard Street near the Baltimore Museum of Art.<br />\nProceed south on Howard Street to Franklin Street. Turn right on Franklin and go four blocks to Greene<br />\nStreet. Turn left on Greene Street and continue to the Baltimore-Washington Parkway, which is a con-<br />\ntinuation of Greene Street. Take the New York Avenue exit off the Baltimore-Washington Parkway and<br />\ncontinue on as Massachusetts Avenue bears right off of New York Avenue. The School of Advanced Inter-<br />\nnational Studies is at 1740 Massachusetts Avenue just beyond 17th Street.<br /><br />\nLeave the Homewood campus by the south exit on Howard Street near the Baltimore Museum of Art. Go<br /><br />\none block to 29th Street and turn right. Proceed to the Jones Falls Expressway exit North. Take the Jones<br />\nFalls Expressway to the Baltimore Beltway West. Take Exit 70-N off the Beltway to Route 29. (Or, take<br />\nHoward Street south to Franklin Street. Proceed west on Route 40 to Route 29.) Go south on Route 29 to<br />\nJohns Hopkins Road about four miles below the Columbia exits. Turn right on Johns Hopkins Road and<br />\nproceed to APL entrance.<br /><br />\nBeltway east (toward Glen Burnie) until you reach the Baltimore-Washington Parkway (approximately<br />\ntwo miles). Take the Parkway exit north toward Baltimore, and follow the Parkway to Paca Street.<br />\nProceed on Paca Street to Mulberry Street and turn right. Follow Mulberry two blocks and turn left onto<br />\nHoward Street; continue north on Howard beyond 29th Street. Get in left lane and stop at stop sign on<br />\nWyman Park Drive. Proceed straight ahead 200 feet and turn right into the south entrance of the<br />\nUniversity.<br /><br />\n- Yohns“Hopkins<br />\n- “University<br /><br />\n&amp;<br /><br />\nFrom U.S. 40 East or West, drive to Howard Street. Turn north on Howard and proceed as above.<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\n\\83)<br />\n5 = &amp;5<br />\nA x APPLIED<br />\n&amp;) § &lt; PHYSICS<br />\n5 2 &gt; “on. LABGRATORY<br />\n« = % e i o<br />\n-\\ o SHOPK/<br />\n% evercreen BALTIMORE Yo<br />\n® o HOUSE CITY<br />\n‘3‘; COLD SPRING LA<br />\ni k |<br />\nA<br />\n“j l<br />\n&gt;<br />\n&lt;<br />\n1 =N<br />\nTHE |E 335<br />\nJOHNS HOPKINS =<br />\nUNIVERSITY |, |=<br />\n3 z<br />\n(HOMEWOOD) 2 |= . THE [403<br />\n. | {<br />\n- NORTH AVE) » |© 2 \"o”ﬁgﬁfc’ﬁfﬂ\"s : \\ N?g\\RI:z:’:I%:AL<br />\nN, 3 INSTITUTIONS TSTUDIES<br />\nN<br /><br /><br /><br /><br /><br /><br /><br />\n4<br /><br /><br /><br />\n4<br /><br /><br /><br />\no<br /><br /><br /><br /><br /><br /><br /><br />\n5 MADISON ST.<br />\nFRANKLINST. J 2 Yk MONUMENT 5T<br />\n&lt;___WULBERRY ST \"'—E“\"_._ts s<br />\nBALTIMORE ST |n. 1<br />\n5<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nWASHINGTON<br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nHomewood House<br />"}], "field_media_file": [{"target_id": 52320, "display": null, "description": null, "target_type": "file", "target_uuid": "f86973ff-ccb5-47a7-a409-9733a874ff0b", "url": "http://digital.library.jhu.edu/system/files/2022-03/16047-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 16047, "target_type": "node", "target_uuid": "f7916943-88e4-4abf-a243-d9471c829ffc", "url": "/node/16047"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "27854a7f-5c08-4979-81d8-608be51c6438"}]}