{"mid": [{"value": 38163}], "uuid": [{"value": "6afff722-89c2-4a89-9f6d-40775a24cb24"}], "vid": [{"value": 38163}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:49:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12730-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:49:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:49:30+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nhdnntivittits Nrinadirttrr<br />\n<br />\nFRESHMAN<br />\nELECTION FINALS<br />\nTODAY<br />\n<br />\nHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br />\n<br />\nvoLumE mar, No. 14<br />\n<br />\nSponsor Of Ball<br />\n<br />\nIntercollegiate Newspaper<br />\nConvention Condemns Faculty<br />\nCensorship Of College Papers<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nJeromeDavis,Yale Sociologist, tr<br />\nWell Known As.Educator And<br />\nLiberal Leader,To Speak Here<br />\n<br />\nf4°1<br />\n<br />\n•<br />\n<br />\nGreen, Hutchcraft<br />\nIn Frosh Finals<br />\n<br />\nSupper Club At 6<br />\nThirty-Five To Get Addresses<br />\nP. M., University LecJHU Varsity Seals ture Tonight At 8.15<br />\n<br />\nDISAGREE Triple Tie For Vice-PresiDelegates From Polytechnic dency; Dickson, Cluster,<br />\nGhent Nominees<br />\nReporter', 'News-Letter',<br />\nPresent Resolution<br />\nApproximately seventy - five per<br />\n<br />\nASKED TO LEAVE YALE<br />\nMaulsby, S. A. C. Chairman,<br />\nAnnounces Eligible<br />\nDismissal From Yale Next<br />\nStudents<br />\nJune Causes National<br />\nControversy<br />\nThe 35 students who are scheduled<br />\n<br />\nResolution Passed To Investigate Witholding Of Editorial Freedom At Schools<br />\nADVISORS<br />\n<br />\n•<br />\n<br />\n.4.<br />\n<br />\n•<br />\ncent of the Freshman Class voted in<br />\nBy MORRIS A. WESSEL<br />\ntheir primary election Wednesday,<br />\nAllentown, Pa.—Climaxing a relaselecting Dick Green, a Delta Phi<br />\ntively uneventful two day conference<br />\npledge and member of the football<br />\nat Muhlenburg College, the Intercolteam, and Don Kirkwood, Kappa Siglegiate Newspaper Association of the<br />\nma neophyte and a Business and EnMiddle Atlantic States passed a resgineering student, to meet in the presolution condemning \"any action of a<br />\nidential finals today. Maurice Conory<br />\nUniversity or College Administration<br />\nand Theodore Frey also ran.<br />\nor Faculty to muzzle student editorLaurie Dickson, Raymond Cluster,<br />\nial freedom in any form whatsoever.\"<br />\nand Victor Ghent tied for the priviTne same resolution provided for a<br />\nlege of going to the vice-presidential<br />\ncommittee to investigate violations<br />\nfinals, eliminating Seymour Pestronk.<br />\nof the Bill of Rights in member colDickson is a Phi Psi neophyte and<br />\nleges of the Association.<br />\nsecretary.<br />\nCommission<br />\nFreshmen<br />\nThe resolution, presented by the<br />\nCluster is pledged to Phi Sigma Delta,<br />\ndelegations from the Polytechnic Reand Victor Ghent, an Alpha Chi Rho.<br />\nporter of the Brooklyn Polytechnical<br />\nCourtwright Running<br />\nInstitute and the Johns Hopkins<br />\nwill go to either<br />\nsecretaryship<br />\nThe<br />\nNEWS-LETTER, and passed at the final<br />\nbusiness session follows:<br />\nBenjamin Courtwright or Arthur RosWhereas, we, the assembled ediset, who topped Robert Molloy, Leontors and business managers of<br />\nar Naurison, and Dean Short. Courtthe college newspapers of the Inwright is a D.U. and a candidate for<br />\ntercollegiate Newspaper Associathe Cotillion Board.<br />\ntion of the Middle Atlantic States<br />\n—Courtesy The Sunpapers<br />\nFive candiates also sought the ofbelieve that freedom of conGLORIA MELLIER<br />\nscience is the foundation of our<br />\nMiss Gloria Meflier, a debutante of this season, has been named sponsor<br />\nfice of treasurer, Lerony Applefeld<br />\ndemocracy and that the basis of<br />\nof<br />\nthe<br />\nFirst Cotillion, to be held Thanksgiving night at the A7cazar. Miss<br />\nKappa<br />\nSig<br />\na<br />\nO'Brien,<br />\nand and Harold<br />\nour civil liberties lies in a free<br />\nLois Jane, of Jamestown, New York, will be guest of honor. The HudsonHall,<br />\nJohn<br />\npledge, leading the field.<br />\npress and free speech; and<br />\nDeLange Orchestra will furnish music from 10 to 3.<br />\nTaynor, and Robert Vernon<br />\nMelvin<br />\nWhereas, we believe that educawere unsuccessful candiates.<br />\ntion is one of the basis of our<br />\ndemocracy and that the greatest<br />\nsingle medium of public education<br />\nis the newspaper; and<br />\nWhereas, we find that many college newspapers of America are<br />\nbeing deprived of their freedom<br />\nof expression by faculty and administration interference; and<br />\nWhereas, it is the avowed purpose of this organiation \"to promote cooperative relations between its members, and to endeavor to develop the highest<br />\nstandards of college journalism.\"<br />\nTherefore, Be is Resolved, that<br />\nwe resent any action of a University Administration or Faculty to muzzle student editorial<br />\nfredom in any manner whatsoever, that we resent and condemn<br />\nany attempt to prescribe what a<br />\nstudent shall or shall not think;<br />\nThat an investigating committee<br />\nbe appointed immediately to determine which of the colleges<br />\nrepresented in this gathering has<br />\nviolated the code of the Bill of<br />\nRights in regard to its student<br />\npapers. By violation we mean any<br />\nattempt by the faculty or administration to control the election of editors or any attempt to<br />\ncensor news columns or editorials, or any attempt to limit the<br />\nsubject matter which lies within<br />\nthe law, or attempt to sway deliberately the editorial opinion of<br />\nan editor;<br />\nThat a letter of condemnation<br />\nfrom the Intercollegiate Newspaper Association of the Middle<br />\nAtlantic States as a unit be sent<br />\nto all offending college administrations expressing the opinion of the united college papers<br />\n(Continued on Page 3, Col. 5)<br />\n<br />\nHullabaloo Photographers<br />\nTo Return December First<br />\nPhotographs for the 1936 Hullabaloo<br />\nWill be taken on Tuesday and Wednesday, December 1st and 2nd, Robert<br />\nAustrian, Editor, announced last week.<br />\nIt will mark the photographers'<br />\nfinal visit to the campus.<br />\n\"We are hoping,\" said Austrian,<br />\n\"to bring in every available picture<br />\nthin time. The photographers will<br />\ndefinitely not return after the first of<br />\nDecember, and anyone who wants his<br />\nPicture taken must be in the office<br />\nat this time.<br />\n\"The office will be open for these<br />\ntwo days from 9.30 A.M. to 5 P.M. The<br />\nPhotographers will be available at all<br />\ntimes.\"<br />\n<br />\nto receive the Johns Hopkins Varsity<br />\nSeal have been announced by Holt<br />\n<br />\nDr. Jerome E. Davis, Associate<br />\nProfessor of Practical Philanthropy<br />\nMaulsby, chairman of the Student<br />\nat Yale University Divinity School,<br />\nActivities Committee.<br />\nwho has been asked to leave at the<br />\nThe candidates for the award, toend of this academic year, will be the<br />\ngether with their positions are as folSupper Club speaker tonight at 6.00<br />\nlows:<br />\nP.M. at Levering Hall. He will also<br />\nHenry Kramer, Business Manager<br />\nspeak at Wilson Memorial Church, on<br />\nof Hullaballoo and Barnstormers;<br />\nUniversity Parkway and charles<br />\nJerry<br />\nBranower,<br />\nBarnstormers;<br />\nStreet at 8.15 P.M.<br />\nMarty Levine, President of BarnBefore coming to Yale in 1924, Dr.<br />\nstormers,<br />\nHu'laballoo;<br />\nHershner Davis was secretary to Dr. Wilfred<br />\nCross, President of Student Council, 1 Grenfell, director of the Grenfell MisHullaballoo; Howard<br />\nReizenstein, sion at Labrador. He came to Yale<br />\nNEWS-LETTER; Roy Hartman, Hulla- from Dartmouth College, where he<br />\nheld the position of assistant profesballoo; Fred Davis, Hullabaloo; Frank<br />\nsor. At Yale he has held the Gilbert<br />\nSilver, Hullaballoo; Jules Hoffman, L. Stark chair of practical philanHullaballoo; Philip Grossman, Presi- thropy for ten years.<br />\ndent of Debating Council; Dave Erck,<br />\nIs Prolific Author<br />\nHe is co-author with Harry Elmer<br />\nPresident of Cotillion Board, Musical<br />\nClub; Brian Murphy, Cotillion Board, Barnes of Readings In Sociology and<br />\nauthor of The Russian Immigrant,<br />\nBarnstormers, Musical Club, Student<br />\nLabor Speaks for Itself in Religion,<br />\nCouncil; J. M. Bradford, Cotillion and The New Russia.<br />\nBoard, Student Council, Chairman of<br />\nDr. Davis, an outspoken critic of<br />\nJune Week.<br />\nfinancal domination of education, has<br />\ncharged that his dismissal from the<br />\nHimes, Ewing Also<br />\nJohn Himes, Barnstormers; Clark University is a direct result of his<br />\nadherence to liberal opinions.<br />\nEwing, Barnstormers; William McLast week a letter to the Yale offiFeely, Business Manager of the Barn- cials signed by seven Yale<br />\nalumni,<br />\nstormers; Oscar Collins, Barnstorm- Including Stephen Vincent Benet,<br />\nWilliam Whitelock, Kappa Alpha,<br />\ners; Robert Watkins, Barnstormers, held the dismissal of Dr. Davis to be<br />\nand Harold Joffe will met in the finStudent Council, NEWS-LE:True Hut- \"tantamount to an expulsion for social and economic views\" and asserts<br />\nals for sereant-at-arms, Daniel Ehrlabd'oo; Pierson M. Checket, Producthat the action \"fills us, as Yale, with<br />\nlich losing out.<br />\ntion Manager of Barnstormers; Leon- greater shame for<br />\nthe name of Yale<br />\nCouncil Position Open<br />\nard Jaffe, NEWS-LETTER, Hullabaloo; than any action of the University<br />\nThe important position of freshJames Morrow, NEws-LETTER; David within our memory.\"<br />\n\"Yale On Trial\"<br />\nman representative to the Student<br />\nCaplan,<br />\nNEWS-LETTER; B. D. Pinck,<br />\nIn light of an incredible misappre- Gentlemen:<br />\nIn a report published as a suppleCouncil is being fought for today by hension on the part of certain memNEWS<br />\n- LETTER;<br />\nJewett Goldsmith, ,<br />\nThe perennial bogey of assemblies<br />\nment to this week's New Republic,<br />\nJames Triplett and Milton Hutch- bers of the Freshman and Sophomore is once again haunting the Hopkins NEWS-LETTER; Julian Adler, NEWSentitled \"Yale On Trial\" an investicraft, students in the College of Arts Classes concerning the position of Campus. The problem is virtually the LETTER; Holt Maulsby, Musical Club, gation by the American Association<br />\nthe Student Council in regard to the Same as it was last year, and the<br />\nand Sciences. Triplett is also a Phi<br />\nPresident of Student Activities Com- of University Professors of his disassemblies, it is felt that a statement year before, and the year before that.<br />\nmissal is recommended by a group<br />\nPsi pledge and a candidate for the of clarification would be<br />\nappropriate. In spite of all the \"desires of the Ad- mittee, Student Council; Ernest J.<br />\nof<br />\ndistinguished educators, headed by<br />\nCotillion Board.<br />\n1. Weekly assemblies are favored ministration,\" and in spite of the Pieper, Musical Club, Student Council.<br />\nDr. Charles A. Beard, eminent historAltogether twenty - six first year by the Administration and the Stu- position and action of the Student<br />\nSteeper Honored<br />\nian. Other members of the committee<br />\nmen entered the lists for the six dent Council as a means of offering Council, your plan to date has been<br />\nJohn Steeper, President of Musical include Dr. Paul H. Douglas of the<br />\nto the students the diversified points a miserable failure.<br />\nClub; Ted Graziano, Musical Club, University of Chicago, Dr. Edward<br />\navailable offices, thirten surviving.<br />\nof view expressed by the various<br />\nThe failure, as always, rests on Student Council; Tom Jay, Musical<br />\nA. Ross of the University of WisconUnusual political activity and inter- speakers, and a place where the un- two<br />\nbases: 1, the ill-conceived plan of Club; W. Jenkins, Musical Club; John<br />\nsin, and Dr. Colston E. Warne of Amest is demonstrated by the fact that<br />\ndergraduates can be reached in a forcing certain classes of students to Soule, Musical Club; Floyd Katsky,<br />\nherst College.<br />\nover one hundred and eighty out of<br />\ngroup for the purpose of disseminat- attend the assemblies; 2, the relative- Musical Club.<br />\n\"The circumstances surrounding the<br />\ntwo hundred and eighty eligible voted.<br />\ning information, making announce- ly poor quality of your assemblies.<br />\nThe Varsity Seal is a key awarded dismissedal of Dr. Davis,\" the report<br />\nBarely half the class voted in the<br />\nments, and reading notices of all types These causes of your failure result to members of the Senior Class who<br />\nSophomore primaries last week.<br />\nsays, \"present positive elements inwhich are of importance to the stu- from the quite apparent misconcep- have served for three years or more<br />\nvolving academic liberties, the rights<br />\ntions which you have ben kind enough in some capacity on a major non-athdent body as a whole.<br />\nof the scholar as a citizen, and the<br />\n2. The Student Council is entrust- to number 1, 2, and 3 in your letter. letic campus activity.<br />\ncorrect procedure of the university<br />\ned with the management of these<br />\nThe assembly is valueless as a<br />\nauthorities in dealing with such lib\"disseminating<br />\ninformaassemblies. Many times in the past medium for<br />\nerties and rights.\"<br />\nyears the then-existing Council placed tion and making announcements.\"<br />\nProtest By Insull<br />\nTryouts<br />\nTeam<br />\nTo<br />\nBe<br />\nan<br />\nRifle<br />\nHeld them on a voluntary basis, only to re- There is no notice made at<br />\nassembIt is alleged that Professor Davis,<br />\nIn Few Weeks After More<br />\nturn to the compulsory system after ly which has not been, or cannot be,<br />\nafter having been promised promoStudents Enroll<br />\nthe attendance had dropped to only made through the NEWS-LETTER. The<br />\ntion from the rank of associate prothirty or forty students—certainly not NEWS-LETTER reaches a wider audi- Grant Going To Hopkins Medical<br />\nfessor<br />\nto that of full professor, was<br />\nSchool Urged By Senator<br />\nWith the smell of powder once a very representative group. Thus, if ence, and, when the announcement is<br />\ndismissed by Yale because of his poRadcliffe<br />\nmore permeating the air of the North assemblies are to continue, as is de- made, you can be sure that the reader<br />\nlitical and economic beliefs and actLoft, the Rifle Club did its first firing sired by the Administration; it ap- is not sleeping or playing tit-tat-toe.<br />\nivities. Protest by Samuel Insull, Jr.,<br />\nTo<br />\nfinance<br />\ncertain<br />\nspecial<br />\naspects<br />\nfor the season on Tuesday, under the pears that the compulsory attendance<br />\nYou misplace the blame for the<br />\na<br />\nYale alumnus, against Dr. Davis'<br />\nsupervision of Sergeant Perry. Thirty- system must be retained.<br />\npoor attendance at voluntary assemb- of research relating to the causes<br />\ncharacterization<br />\nof Samuel Insull,<br />\nand<br />\ntreatment<br />\nof<br />\ninfantile paralysis,<br />\nfive members have signed up so far<br />\n3. Until the latter part of last lies. It lies not with the students, but<br />\nSr., as a \"higher racketeer,\" is said,<br />\nand more are expected. Tryouts for year, assemblies were held weekly. with you. The only attraction of the the Hopkins has received fifteen<br />\nby the report, to have influenced Yale<br />\nthe Rifle Team which represents the The Council then conceived the idea assembly lies in the speaker which thousand dollars from the national<br />\nI in its action.<br />\nUnivrsity will be held in a few weeks that if only two assemblies a month you provide. You have disappointed committee of President Roosevelt's<br />\nWhile at Yale, Dr. Davis has been<br />\nafter more students have enrolled. The were held, better speakers could be and betrayed the student body, for it Birthday Balls, held annually in Jana leader in liberal circles, and accorduary.<br />\nfirst match of 1937 will be with obtained and a more willing and co- hardly seems credible that you could<br />\nThe money was given to the Hop- ing to the following editorial in The<br />\nGeorgetown on January 9 at George- operative feeling toward the assemb- have found a more generally uninterkins<br />\nafter agitation on the part of Yale Alumni Weekly for November<br />\ntown University in Washington, a lies would be manifested by the mem- speakers. It is unfortunate that Leon<br />\n29, 1935, this was beyond the scope<br />\nshoulder to shoulder match, as com- bers of the Freshman and Sophomore Sachs, Broadus Mitchell, and Arthur U.S. Senator George L. Raeliffe who<br />\nof<br />\nYale's standard of academic freepared with postal matches which Classes. Moreover, unless some appre- Garfield Hayes come but once a year. learned that a request made for a<br />\ndom.<br />\ngrant<br />\nby<br />\nDr.<br />\nAlan<br />\nM.<br />\nChesney,<br />\ncomprise most of such firings.<br />\ndean<br />\nciation of the better speakers—made They are lost and forgotten in the genThe editorial condemns any activity<br />\nof the Hopkins Medical School, had<br />\nAll students interested in target possible by the two assembly a month eral run of speakers.<br />\n\"which<br />\npublicly involved a teacher of<br />\nbeen<br />\noverlooked.<br />\nfiring are invited to join the club, as system—were shown by a conduct<br />\nThe plan advanced by those who<br />\nSeventy per cent of the money the University in a political or labor<br />\nmost of last year's team graduated in of common decency at the assemblies, are feverishly circulating petitions<br />\nquarrel where the teacher may find<br />\nJune, and everyone has a chance for it was realized that the two assembly around the Campus is quite as bad as raised by each community in which<br />\nthat he has brought the University<br />\nthe<br />\nBirthday<br />\nBalls<br />\nare<br />\nteam.<br />\nheld<br />\nthe<br />\ngoes<br />\non<br />\nto<br />\nplace<br />\nMembership<br />\nthe<br />\nUnivera<br />\na month plan was not receiving either yours. It is obvious that<br />\n(Continued on Page 3, Col. 1)<br />\ndues are $2 for the first year, and $1 the good will or the cooperation of the sity cannot afford to pay speakers for the local agencies of the community<br />\nfor<br />\nuse<br />\nin<br />\naiding<br />\nthe<br />\ncrippled. The<br />\nfor all other members in previous students and a return to the old sys- student assemblies. Nor should there<br />\nyears. The dues go to pay for cart- tem of four compulsory assemblies a be any need for doing so. The Hop- first year of the balls the remaining<br />\nAll Time Reports Due<br />\nridges, which are furnished members, month would be the only course left kins is fortunate enough to be stra- thirty per cent went to the Warm<br />\nMiss Judge has announced that all<br />\ntargets, and the upkeep of the range. to follow.<br />\ntegically located in a position where Springs Foundation in accordance<br />\nThey may be paid in the Military OfThe present Student Council adopt- qualified, attractive speakers should with the wishes of President Roose- time reports for this month for stuflee, on the fourth floor of Gilman ed the same stand. It has held but be easily attainable. It is unfortunate velt. In past years, however, the dents holding N.Y.A. Jobs here are due<br />\nHall. The range is open from the mid- two assemblies a month and has en- that the Student Council has not made thirty per cent has been forwarded to tomorrow, November 21, by 1:00 P.M.<br />\ndle of November to the second week deavored to obtain interesting and the most of its opportunities; it is a national committee with the un- at the office of the Bureau of Appointin April, five days a week; the hours Instructive speakers. It now reiterates unfortunate that the student body has derstanding that this body appropri- ments.<br />\nNo payment f 'he month can be<br />\nare posted on the bulletin board on the condition under which it can con- been deprived of a weekly experience ate sums to medical schools doing<br />\napproved work ..<br />\nmade if report<br />\nsled in late.<br />\nrange.<br />\n(Continued on Page 3, Col. 6)<br />\n(Continued on Page 3, Col. 3)<br />\n<br />\nTWO OPEN LETTERS<br />\nTo The Student<br />\nBody<br />\n<br />\nRifle Club Ushers In<br />\nSeason; 35 On Roll<br />\n<br />\nTo The Student<br />\nCouncil<br />\n<br />\nRoosevelt Balls Pay<br />\nParalysis Research<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br />\n<br />\n2<br />\nt<br />\n<br />\nVie 3o1ing 34opkincs<br />\n<br />\ntonal freedom means; they are censored in more than one way, but they<br />\n<br />\n1<br />\n<br />\nof administration.\"<br />\n<br />\n•:- UNIVERSITY: - :<br />\n<br />\nCommenting in \"The Journal of<br />\nHigher Education\" upon<br />\n<br />\nPIPES<br />\n<br />\nOF<br />\nALL KINDS<br />\nPIPE REPAIRING —<br />\nTobaccos Specially Blended<br />\n<br />\neligibility<br />\ndon't know it. Many others, even<br />\nfarther withdraw into their micro-1 It was only by dint of great per- I Crouched to spring on us, they fol- recommendations recently made by<br />\nFADER'S<br />\nI got Uncle Humphrey lowed the professor who was edging the president of the University of<br />\n210 EAST BALTIMORE STREET<br />\ncosmic shells, know they are censored suasion that<br />\n•<br />\nPLaut 3061<br />\nto sit in on my graduate class. He had nearer and nearer to us. His knife North Carolina, he said they are \"so<br />\nbut don't care.<br />\nfirm, so rigid, and so reactionary as<br />\nbeen there before and had been exwas longer, keener and much brightto stun those who have been hoping<br />\ntremely uncomfortable, had disliked<br />\n$2.00<br />\ner<br />\n(otherwise he couldn't be a pro- for some mite of liberalism.\"<br />\nSubscrtptiuu per<br />\nthe<br />\nway<br />\nand<br />\nclass<br />\nthe members of th<br />\n$2.50<br />\n.<br />\nMail<br />\nBy<br />\nIt had been conducted. I remember fessor if a student could split hairs<br />\nDr. Oberteuffer pointed out that<br />\nRemit subscription fees to Treasurer, Student<br />\nthat he swore a great deal afterwards, better than he) and made him an ob- \"one is amazed by the number and<br />\nActivities Council, Remsen Hall, Postottice, Julius<br />\nHopkins University.<br />\nbut after burying his face in the foam ject of much apprehension.<br />\ncomplexity\" of constitutions of high<br />\nSizing the position up at a glance,<br />\nEntered as second class matter December 3,<br />\na glass of beer, he forgot it comof<br />\nattackof<br />\npurpose<br />\nthe<br />\nfor<br />\nschool athletic associations and colwas<br />\nIt<br />\n1909, at the Postottice in Baltimore, Md., under<br />\npletely. But after telling him that it Uncle Humphrey leaped on the seat lege<br />\nthe Act of Congress, November .1, 18‘9.<br />\nconferences.<br />\ning this problem of faculty and ad- --—<br />\nwas an especially interesting and of his chair and loudly recited Byron's<br />\nJune,<br />\nto<br />\nOctober<br />\nfrom<br />\nPublished semi-weekly<br />\nare age limits, scholarship<br />\n\"There<br />\nstudent<br />\nin<br />\ninterference<br />\nJewelers and Opticians<br />\nexcept during examination and college holiday ministration<br />\nbrilliant lecture, I finally convinced \"Stop! for thy tread is on an Empire's standards, transfer rules, amateur<br />\nperiods by undergiaduates of the Johns Hopkins newspapers that the INA convention<br />\ndust!\" This gave them quite a shock,<br />\nhim that he ought not to miss it.<br />\nUniversity.<br />\nrules, and freshmen rules. And the<br />\naccepted the resolution presented by<br />\nWe sat down in a corner, away and in that moment, Uncle Humphrey<br />\nPEN and PENCIL SETS<br />\nEDITORIAL STAFF<br />\nhistory of each one is that it is formWilliam Diamond ..... ..... ......... Editor-in-Chiej<br />\ntable where some dozen grabbed my arm and we fled down the<br />\nAssociate Editor the delegations from the Hopkins and from the<br />\nulated to control some troublesome<br />\nStanley Finkel<br />\ngraduate students were seated, mute- hall. Not long they stood transfixed, situation—without counting the cost<br />\n'times Morrow, David Caplan ...Managing Editors<br />\n.. _Sports Editor the Brooklyn Polytechnic Institute.<br />\nBernard D. Pinck<br />\nly staring through the top. Tough but poured out the room screaming of those who might be trying to foster<br />\nBenjamin Root, Wethered Barron, Jr,<br />\n3222 Greenmount Avenue<br />\nAssistant Managing Editors The result is undoubtedly the first their actual faces were not identical, vengeance. Around the corner we ran,<br />\nathletics for the benefit of all boys<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Sports Editors step towards a solution of the great- naturally, inspection showed that banking on the wall and then down<br />\nregardless of age, income, or previous<br />\nReporters--Max Iskowitz. Nathaniel Finkelstein,<br />\nthe echoing corridor when we suddenJewett Goldsmith, Howard Reizenstein, Jul est problem before college editors most of their expre-alon had the<br />\ncondition of servitude.\"<br />\nian Adler, Carl Basin, Floyd Katske,<br />\nportly<br />\ninto<br />\nly<br />\na<br />\nran<br />\ngentleman.<br />\nrather<br />\nwonderful vacant look and that they<br />\nLeonard Rubinger, Morris Wessel, Arthur today.<br />\nSensing that his bowing to decorum<br />\nKatz, Martin Krieger, Lester Rosenthal,<br />\nere prone to go off into trances even<br />\nprobably<br />\nand<br />\nEast,<br />\nthe<br />\nThroughout<br />\nSidney Baum, Murray Kenipion.<br />\nmight be fatal Uncle Humphrey yankposes.<br />\nof<br />\nstudious<br />\nthe<br />\nmost<br />\nin<br />\nwhen<br />\nBUSINESS STAFF<br />\nand Middle West too, the<br />\nBusiness Manager in the West<br />\nWilliam B. Kempton<br />\nOne, I noticed, pencil poised in air, ed the dazed man to his feet and<br />\nAssistant Business Manager freedom of the college press is almost<br />\nMelville Locker<br />\nhad completely forgotten what he somewhat inarticulately choked, \"The<br />\nAdvertising Manager<br />\nWm. C. Erlanger ......<br />\nCirculation Manager non-existent. In many ways the facGerald Willen<br />\nwanted to write and was raptly gas- 1 foe! They come! They come!\" In the<br />\nManager<br />\nOffice<br />\nLinkoff<br />\nHoward<br />\nCopy and Filing Manager ulty keeps an iron clasp on the stu- ing out the window. Others had a next instant I found myself hurdling<br />\nNathaniel Soifer<br />\nthe stair-rail, all other ways being<br />\ndent newspaper: it controls the elec- way of turning pages of a book but<br />\n/436<br />\nMember<br />\n1Q17<br />\nblocked, and proceeded to plunge<br />\non<br />\nnot noticing what was printed<br />\napAssociated Colle5iate Press tion of, or in some cases actually . them, although profoundly interested three stories. Somewhat anxiously I<br />\npoints, the student editor of the paper; in the procedure. Uncle Humphrey be- looked up to see whether we were<br />\nDistrtbutors of<br />\nit censors all copy before it appears in gan to fidget; he told met later that being followed, but our pursuers conCollet5ide Diecest<br />\nprint; it limits the subject matter it had reminded him of a tableau, tented themselves with frenzied beating on the rail.<br />\nwhich the editor may discuss; by an and there is nothing he dislikes more<br />\nIRSPSISENTED FOS NATIONAL ADTILRTISING ay<br />\nWe landed in a cart full of waste<br />\nthan<br />\ntableaux.<br />\nNational Advertising Service, Inc. unambiguous understanding it makes<br />\npaper<br />\nprofessor<br />\nconveniently left there by our<br />\nLike an old stager, the<br />\nCOM le Pu&lishers Representative<br />\nthe editor just what attiNEW YORK. N.Y. known to<br />\n42i, MADISON AVE.<br />\nstrode in the room with something of friend the janitor. We got out and<br />\nC.1c400 . Butirrini . SAN FRANCISCO tudes may or may not be espoused.<br />\nourselves off.<br />\nbrushed<br />\na flourish. The fact that he was three carefully<br />\nStATTLt<br />\n^<br />\n--These are the facts of the condi- minutes late didn't seem to disturb \"Now,\" glowed Uncle Humphrey, \"for<br />\nFriday, November 20, 1936<br />\na glass of beer!\"<br />\ntions which face the majority of the him in the least, in fact I doubt<br />\n\"I can't,\" I said, \" I have a one<br />\n1<br />\nhapwas<br />\nwhat<br />\nhe<br />\nrealized<br />\nwhether<br />\n..41 Mortimer,just look at Stuyvesant—the lone wolf of the Union Club.<br />\ncollegiate press. They can hardly be<br />\npening, his mind was undoubtedly o'clock.\"<br />\nprincithe<br />\nwith<br />\nHe hasn'tjoined Me swing to TWENTY GRAND!\"<br />\nsaid to be consistent<br />\nfocused on some dusty town. It took<br />\nples of the Bill of Rights, which above him some moments to adjust himself<br />\nall things guarantees freedom of to the fact that he was about to lec1911110111111MNIMMINIMUMMINMIIMMIMMINME1111111111111111M1111111111101101111k<br />\nThe decision of the Hullabaloo to press and discussion; nor can they be ture, but he soon began to speak and<br />\nCopr. 1936 The A xton•Fielier Tobacco Co., Inc.<br />\nhold a beauty contest should serve as consistent with the ideals of a uni- immediately plunged into his subColumbus, Ohio (ACP)—Suggestdithe<br />\nin<br />\nstep<br />\na<br />\nof<br />\ncertainly<br />\nis<br />\nnot<br />\nwhich<br />\nannouncement<br />\namong<br />\ninteresthis<br />\nversity,<br />\nan<br />\nlecture very<br />\nject. I found<br />\nWE CERTIFY that we have inspecting a moratorium on complicated<br />\nrection of favorable publicity—if the the formularization of all thinking ing and very scholarly until he lost rules and programs regulating the<br />\ned the Turkish and Domestic Tobaccos<br />\ncompetition is handled properly. Bal- in the ruts of tradition.<br />\nthe thread of his story and began to eligibility of college athletes, Dr.<br />\nblended in TWENTY GRAND cigarettes<br />\nThe resolution passed by the INA wander into the metaphysical over Delbert Oberteuffer, non - coaching<br />\ntimore is traditionally known as the<br />\nand find them as fine in smoking qualcity of beautiful women; any history will not solve the problem completely; the exact meaning of a word, how professor of physical education at<br />\nity as those used in cigarettes costing<br />\nbook will report this reputation. We there are too many factors involved. some contemporary had used it and Ohio State university, recommends<br />\nas much as 50% more.<br />\nhave given to the world Betsy Pater- But it is a step in the right direction. as to how it had been used in other the system of governing used by AmPlua local<br />\n(Signed) Seil,Putt& Rushy Inc. Annlytiral Laboraturies<br />\nson, whose affairs with Jerome BonaPerhaps the greatest obstacle to be notable cases.<br />\ntax la<br />\n(In etillaburation with tobacco expert)<br />\nherst College.<br />\ntax<br />\nMatt*<br />\nparte was the subject of a recent film; overcome is the apathy of the students<br />\nUncle Humphrey and I both began<br />\nFIFTIES<br />\nFLAT<br />\nIN<br />\nOBTAINABLE<br />\nALSO<br />\nall<br />\nsuspend<br />\nshould<br />\n\"Perhaps we<br />\nand now Mrs. Wallis Simpson, another themselves. The majority of the col- to get bored and resorted to finger<br />\nrules and stare over,\" he said. \"Let's<br />\nBaltimore Belle, is crashing headlines. leges represented in the INA are lo- tircks and \"ha.ndies.\" Uncle Humphfind out what college games are for<br />\nCloser to home, previous editors of cated in small towns. The atmosphere rey, I found, had an endless supply of<br />\nreally. For 85 years, more or less, we<br />\nthe NEWS-LE-n.12 have always decid- of such places seems to numb stu- \"handles,\" most of which I couldn't<br />\nhave been piling rule upon rule withed the lack of pulchritude in the dents to the greater problems which get. I thought the voice of the prostopping for a careful analysis.<br />\nout<br />\ntake<br />\ncannot<br />\nWe<br />\nsense<br />\nTheir<br />\nTeachers.<br />\nface them and the nation.<br />\nCollege for<br />\nfessor seernitd strangely soothing,<br />\n\"All this time some over-enthusithis stand and urge several of the of awareness and recognition of the when I suddenly realized it had stopcoaches and directors of athastic<br />\nto<br />\nphotos<br />\nfairer sex there to submit<br />\nproblems of social and political im- ped. I looked up and stifled a terrified<br />\nletics have been responding to the victhe competition. After all the Hulla- port which deprive them of their free- scream.<br />\nby going to all<br />\nbaloo should be given at least local dom of expression seems to be sadly<br />\nThe reamy look on the rest of the tory-hungry public<br />\nwinners.<br />\nproduce<br />\nto<br />\nlengths<br />\nthe<br />\nperhaps<br />\nknows,<br />\neducation<br />\nof<br />\nprocess<br />\nWho<br />\na<br />\nneglected. Only<br />\nsupport.<br />\nstudents' faces had vanished. In its<br />\n\"It is suggested that the solution<br />\ncontest pages of this year's annual can wake them up to their danger.<br />\nplace, without exception, was a hidwill consist of more of the Hopkins'<br />\neous carnal leer, and in each one's of this problem lies in an examination<br />\nfamiliar sights.<br />\nhand was a keen glittering knife that of fundamental concepts (of amateurism) and in a return to simplicity<br />\nThe editors of the Hullabaloo ought<br />\nthey use to split hairs.<br />\nto make a wide-spread concerted efAs the annual football classic with<br />\nfort at putting across this project.<br />\nJohn's becomes more and more<br />\nSt.<br />\neightHopkins<br />\nEnlist the aid of the<br />\na note of<br />\neen fraternities. Search out the pos- imminent, we wish to sound<br />\nthe preto<br />\nreference<br />\nin<br />\nadmonition<br />\nMarysibilities of Goucher, Hood,<br />\nreiterate<br />\nto<br />\nEfforts<br />\nfestivities.<br />\ngame<br />\nothers.<br />\nand<br />\nWomen,<br />\nfor<br />\nland College<br />\npast few years<br />\nHave the contest spread by the local the activities of the<br />\nmisdirected.<br />\nentirely<br />\nare<br />\nedition<br />\nan<br />\nsee<br />\nto<br />\nyet<br />\nnewspapers; we've<br />\nThe kidnappings and raids which<br />\nof the Evening Sun where they failed<br />\nso prominently in recent years<br />\nfigured<br />\nlocal<br />\nthe<br />\nto feature a girl's picture on<br />\nvestigial remnants of the<br />\nare<br />\nmerely<br />\npossible.<br />\nwhenever<br />\npage<br />\ncollege life—an<br />\n\"rah-rah\"<br />\nof<br />\nperiod<br />\nYes, there are countless possibilHERE'S THE MENU!<br />\ncertainly never<br />\nwas<br />\nwhich<br />\nelement<br />\na<br />\ninto<br />\ncontest<br />\nthe<br />\nities of converting<br />\nGo back noose for Thanksgiving — turkey just<br />\nstrong at Hopkins. This sudden<br />\ndoesn't taste as good anywhere else! Make it a<br />\nlively, interesting, and beneficial pro- very<br />\ngala week-end but an inexpensive one — do yout<br />\nannual evolving of hysterical enthu,sject. Yet if the proper supervision is<br />\ntraveling by Greyhound bus. A Greyhound trip<br />\niasm by a student body whose lack<br />\nwill<br />\ncompetition<br />\nthe<br />\nemployed,<br />\ncosts only 1 /3 as much as driving your car—much<br />\nnot<br />\nof spirit at other athletic contests<br />\nless than any other means of travel. You can buy<br />\nprove to be a miserable \"flop.\"<br />\nyour ticket to one of the big out-of-town football<br />\nis well night discouraging is indeed<br />\ngames with the money saved making the trip by<br />\nparadoxical.<br />\nGreyhound. Drop in, or phone for full information.<br />\nLet's show spirit and enthusiasm<br />\nWith the courtesy of Mills Artists,<br />\nGREYHOUND BUS TERMINAL<br />\nthis year, but let's confine our ardor<br />\nPhone, PLaza 0520<br />\n217-221 W. Baltimore St.<br />\nThe Johns Hopkins NEWS-LETTER within the restraints of propriety.<br />\nwe give you:<br />\nfreedom—and<br />\nhas complete editorial<br />\nno one thinks it unusual.<br />\nThe NEws-Lerrial does not pay its<br />\neditors with NYA salaries, or scholarships, or cash, or college credit—and<br />\nno one thinks it strange. In fact, it<br />\nFILTER-COOLED<br />\nFor Your<br />\nJ. H. FURST CO.<br />\nis a subject of pride on the campus.<br />\ntoken,<br />\nLiquors<br />\nPrinters of<br />\nThe University, by the same<br />\n7111442X.<br />\nPHILOLOGICAL and<br />\nmakes no bones of the fact that it<br />\nSeeH ARRY<br />\ndoes not pay its football players. It<br />\nSCIENTIFIC PUBLICATIONS<br />\n3113 GREENMOUNT AVE.<br />\ncolleges<br />\nfew<br />\n[stands out as one of the<br />\n12-20 Hopkins Place Baltimore<br />\nSOMETHING WONDERFUL<br />\nPhone UN. 4883<br />\nDelivery<br />\nFor<br />\nGOES ON INSIDE:<br />\ncan still boast of non-commercialized<br />\n<br />\nLetter<br />\n<br />\nForward To<br />\nFreedom<br />\n<br />\nkale<br />\n<br />\nKIBLER'S<br />\n<br />\nBeauty And The<br />\nBest<br />\n<br />\nIntercollegates<br />\n<br />\nThe<br />\nCotillion<br />\nBoard<br />\n<br />\nWithin Bounds<br />\n<br />\nStrange Interlude<br />\n<br />\nHudson--DeLange<br />\nOrchestra<br />\n<br />\nMEDICO<br />\n<br />\nathletics.<br />\nAt the Hopkins, all these things<br />\nare taken for granted. And yet, in<br />\nthe cases of the great majority of the<br />\ncollege newspapers represented at the<br />\nIntercollegiate Newspaper Association convention last week, just the<br />\nopposite is taken for granted.<br />\nFootball players are paid--because<br />\nit's victory that counts, and not how<br />\nthe game is played. Editors are paid<br />\nfor why should a man spend so<br />\nmuch time and work so hard for an<br />\nextra-curricular activity? Who ever<br />\nheard of a man working on a paper<br />\nbecause he enjoys the work? But<br />\nmore Important and fundamental<br />\nthan these is the fact that not more<br />\nthan one out of ten editors can boast<br />\nof total editorial freedom. The sadnatter is that many<br />\ndest part<br />\nknow what edicn't<br />\nin<br />\nr<br />\nof these<br />\n14 a<br />\n<br />\nVIM I<br />\nSTAMM<br />\nMAPES<br />\nap.mmo•<br />\n<br />\n11<br />\n1Ad<br />\neituPtg—k-\",<br />\nFINEsT<br />\nBRIAR<br />\nMONEY<br />\nCAN BUY<br />\nUNNEARO OF VALUE<br />\n<br />\n01<br />\n<br />\nThis simple appearing yet amazing<br />\nabsorbent filter invention with Cellophane exterior and<br />\nfooling mesh screen<br />\ninter ion keepsjuices<br />\nand Oakes in Filter<br />\n<br />\nand out of mouth.<br />\nPrevents tongus<br />\nbite,raw mouth,<br />\nwet heel, bad<br />\nodor, frequent<br />\nexpectoration.<br />\nNo breaking<br />\nin.Improves<br />\nthe tasteand<br />\naroma=<br />\ntobacco.<br />\n<br />\nALSO CIGANETTE AND<br />\n<br />\nTHE ONLY PATENTED<br />\n\"CELLOPHANE\"- SEALED<br />\n-FILTER—IT REALLY FILTERS<br />\n<br />\nr----<br />\n<br />\nPeabody<br />\nPharmacy<br />\n<br />\nUniversity Barber Shop<br />\nFirst Class Service, 4 Barbers<br />\n3124 Greenmount Avenue<br />\n<br />\nWe Sell Drugs and Give Service<br />\n<br />\nALBERT A. CESKY, Prop.<br />\n<br />\nCALVERT and 30TH STREETS<br />\n<br />\nThanksgiving Night<br />\n<br />\n-1211.1.2<br />\n2111=='1<br />\n.<br />\n<br />\nNORTH<br />\n<br />\nat the Alcazar<br />\n<br />\nINN<br />\n<br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF<br />\nCOLLEGE FRIENDS<br />\n<br />\nfl<br />\nt<br />\n)<br />\nne<br />\nr<br />\niltC<br />\n;<br />\niLgitlPt:eh<br />\nt:<br />\ns<br />\nt:jacr:<br />\no<br />\nen<br />\nle<br />\ngis<br />\nein<br />\nai<br />\nrrs<br />\nrt,<br />\n<br />\n/151T\"IC42111111<br />\n:<br />\nageeninl<br />\nl<br />\ni li<br />\n<br />\nIt ext<br />\n<br />\ne:tsI<br />\n<br />\nnade<br />\n:b:avhj<br />\nlj<br />\nde<br />\nItit:'<br />\nielnta<br />\ne1<br />\n<br />\nel ireida<br />\nrt TIIPire°:::Thanv<br />\nb<br />\nwP4Stn)<br />\nriIN .<br />\nalle<br />\notk<br />\nh<br />\nlir<br />\nc<br />\nkiavalin<br />\nkiaintie?g<br />\n,<br />\nea<br />\nr 4I<br />\netiGertid.<br />\n<br />\ni<br />\nad<br />\nnLaa<br />\nkt<br />\nc<br />\nrni<br />\nit.<br />\n<br />\niv<br />\ntivC<br />\n<br />\nThe<br />\nCIa.h<br />\nke,t<br />\nM<br />\nrhi<br />\n!I4Ifeart a<br />\n: twegl<br />\nYco<br />\ntyih<br />\nitilan<br />\ni14<br />\nin<br />\n<br />\ne<br />\ni<br />\ns<br />\nre<br />\n(<br />\nso<br />\nbhutrh<br />\nee<br />\n1etroh,) if 1a<br />\ni<br />\ndece<br />\nolemAdra<br />\ncedi 4<br />\nttsrt<br />\n<br />\nnarrist<br />\n<br />\nWere<br />\nlure<br />\n<br />\ncame i<br />\nbeen a<br />\n<br />\nto0 be<br />\nthat .,<br />\n<br />\nlook<br />\n,introd<br />\nYears<br />\nHay<br />\n4orrn,<br />\n!time,<br />\n<br />\n,arld A,<br />\n:trayed<br />\n<br />\n,exPreA<br />\nAnd i<br />\nDerfor<br />\n12, wl<br />\n<br />\niltorrn;<br />\nThe<br />\n<br />\nthe<br />\neerne,<br />\nv<br />\n„Eitide<br />\n<br />\n'<br />\nIt: a(1<br />\n'(al<br />\ngold<br />\nwardidtii11<br />\n<br />\nOur Prices are Lower Than Ever<br />\n<br />\n10<br />\n<br />\nNEW YORK LOAN OFFICE<br />\n<br />\ntalkie<br />\n<br />\nto 3<br />\n<br />\nUnredeemed microscopes, cameras, binoculars, musical<br />\ninstruments, slide rules.<br />\n<br />\n118 North Liberty Street<br />\n<br />\nAjun<br />\n<br />\n:<br />\n<br />\nScres Again<br />\n<br />\nCAN'T SMOKE A PIPE?<br />\nTHEN YOU NEVER SMOKED A<br />\n<br />\nFiAS<br />\n<br />\nPlaza 3495<br />\n-wow- -was, -IIIIWI.—.ININSIF—W1111.-\"\\11FP\".410<br />\n<br />\nMan I<br />\n<br />\nThe<br />\ncity's<br />\nThe<br />\n,eow ,<br />\n<br />\n.,iXfter<br />\ni Moth(<br />\n; aeeon<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br />\n<br />\nJerome Davis “Look Before You Sleep\"<br />\nIs New Dormitory Motto<br />\nFalks Tonight<br />\nJoke Played On What Was Thought To Be FreshAd Supper Club Practical<br />\nman; Results In Amusing Consequences; Notes On<br />\nHow To Keep Awake<br />\nYale, Educator Asked To<br />\nLeave New Haven In<br />\nJune<br />\n{AS LIBERAL VIEWS<br />\nKlumni Protest Action; Investigation Being<br />\nConducted<br />\n(Continued from Page 1, Col. 6)<br />\nInto the limelight with himself. In<br />\nhAcit a case it is not the individual's<br />\n)Plilion as a scholar that is at issue;<br />\nI is his public appearance as an<br />\nLgitator. It is this sort of case that<br />\nerits official rebuke, and which if<br />\niIersisted in, makes the offender no<br />\nlonger of use to his University.\"<br />\n!<br />\nNewspaper Attacks<br />\nThis statement was apparently basOn an official address by President<br />\nAzgell in the same issue. The New<br />\nomen Register took up the attack,<br />\nerrning the pronouncement \"a rereshing sign.\" It mentioned Jerome<br />\nDavis by name, and concluded with<br />\n'While those interested in Yale will<br />\nwelcome such a stand by its President and alumni organ, they will find<br />\nIt extremely difficult to condone stateMents by its faculty members urging<br />\nthe destruction of the capitalistic systern which, by its very essence, had<br />\nMade possible endowed educational<br />\ninstitutions.\"<br />\nLetter From President<br />\nThe report includes a letter from<br />\n)resident James R. Angell of Yale<br />\nitniversity to Dean Weigle of the<br />\nI:<br />\n)<br />\nlVinity School, in which he attacks<br />\nDr. Davis for attempting to bring<br />\nSenator Gerald Nye, of the Senate<br />\nMunitions Committee, to Yale as a<br />\nilPeaker and for attempting to arouse<br />\nKildent opinion in favor of Senator<br />\nN3?e's views.<br />\nWithin the report is also included<br />\nPraiseworthy comments of Dr. Davis'<br />\nwork by such leaders as H. R. Niebuhr, John Dewey, Professor Harold<br />\nLaski of the London School of Economics, President Robert Hutchins of<br />\nChicago, and excerpts from an inveatigation of theological seminary<br />\neducation, under the title \"The Education of American Ministers,\" in<br />\nWhich Dr. Davis' course in Christianity and Social Progress was given the<br />\nhighest ranking by the students of<br />\nAny course in the Yale Divinity School.<br />\n......<br />\n<br />\n1<br />\n<br />\nMYSTERY!<br />\n<br />\nIn one of the entries at the dormitory, there is a room in which one<br />\nman, the star in the drama we are<br />\nabout to present, lives. He kept to<br />\nhimself a lot and he was pictured<br />\nby his neighbors, all Freshmen, as<br />\nbeing quiet, well-behaved, orderly, and<br />\nangelic to a point of idiocy. At least<br />\nthat is what the freshmen living in the<br />\nadjoining rooms thought. Well, one<br />\nevening, freshies decided to try to get<br />\na use out of the fellow. He seemed to<br />\nbe a nice sort of companion, and the<br />\nboys felt that they ought to do something calculated to rouse him up a<br />\nbit. Then, they figured, after the apologies were made and the blood cleared<br />\naway, all the men on the floor could<br />\nlive in comparative harmony for the<br />\nduration of the term. In a word, the<br />\nboys were a little irked, and a bit<br />\nself - conscious at their neighbors'<br />\nseeming unwillingness to let loose.<br />\nThey wanted to see, first of all,<br />\nwhether he could \"take it,\" and second<br />\nwhether he was a \"regular fellow\" or<br />\nnot all that the word implies Besides, in their opinion, things in their<br />\nentry had been quiet for several days,<br />\nand it was high time that normalcy be<br />\nrestored.<br />\nSecret Entrance<br />\nTo begin, they managed to secure<br />\nentry to the man's room (by a method<br />\nwhich will not be divulged here, since<br />\nthe author of this article is an \"inhabitant\" of the dorm.) Once there,<br />\nthey \"Frenched\" his bed, turned over<br />\nhis bureau and put the drawers in<br />\nupside down with the effect that when<br />\nthose drawers were opened, their contents would be spread on the floor;<br />\nfinally, they tied strings from the<br />\nhandle of the door-knob to various objects in the room. The expectation<br />\nhere was, of course, that when the unsuspecting victim opened the door,<br />\neverything would be dragged off the<br />\ndesks and bookcase to crash to the<br />\nfloor.<br />\nAccording to his usual custom, they<br />\ncould expect him to come in about<br />\nten-thirty. At twenty minutes after<br />\nten, the freshies were all in the adjoining room awaiting his arrival.<br />\n<br />\nHedgerow Group<br />\nMake Local Bow<br />\nPresent Two Plays At Auditorium Before Large<br />\nGathering<br />\n<br />\nAt ten-thirty punctually, he opened<br />\nhis door. Crash! (That's the lamp!\"<br />\nwhispered one of the freshmen, excited.) Bang! (\"That's the waste-paper<br />\nbasket 'filled with canned food that I<br />\nput on the top of the bookcase!\"<br />\nsmirked a second) Then, undignified,<br />\nbut certainly effective, a-hem, expletives, burned a blue streak in the air<br />\nin the next room. Suddenly all was<br />\nquiet, and to the intense disappoint-<br />\n<br />\nIRCLIN'<br />\nTIIE<br />\nAMPUS<br />\nBy STANLEY FINKEL<br />\n<br />\nWe ran across this announcement<br />\nwhich one of our acquaintances had<br />\nsent out. Because we wish the party<br />\nconcerned to grow up undisturbed by<br />\nbothersome publicity, we are using<br />\nflcticious names.<br />\nMR. and MRS. RAY PRODUCTION<br />\nHave the honor to sponsor the debut<br />\nof<br />\nThe New Arrival<br />\nIN THE HOWLING SUCCESS<br />\nWeight 7 lbs., 2 oz. of tuneful harmony<br />\nBRIGADIER GENERAL HOSPITAL<br />\nTime: 8.45 A.M., October 26, 1936<br />\n<br />\nment of the perpetrators of the mild<br />\n<br />\nFIRST SHOWING<br />\n<br />\n\"hazing,\" everything was peaceful.<br />\n<br />\nNovember 15, 1936<br />\n1234 Davenport Road<br />\n<br />\nThe boys had left a nicely engraved<br />\ncalling card on the desk of the victim,<br />\nwhich identified them both by room,<br />\nand by name, and they were surprised<br />\nat the seeming snub.<br />\nSadly, the boys went to bed and,<br />\nregarding their experiment as a waste<br />\nof time, they discarded any further<br />\n<br />\n\"A RAY PRODUCTION PERFORMANCE\"<br />\nCAST OF CHARACTERS<br />\n<br />\nAda Ova<br />\nHappy Mother<br />\nRay<br />\nProud Father<br />\nThe Central Attraction<br />\nAda Ada Ova<br />\nBottle Holders, Pin Dealers, DiaFolders, Etc.<br />\nMUSICAL NUMBERS<br />\n<br />\nattempts to make the acquaintance of<br />\n<br />\n\"After the Bawl\"<br />\n\"Walking My Baby\"<br />\n\"Sing My Baby Good-Night\"<br />\nAbout three o'clock in the morning,<br />\n\"Crying Myself to Sleep\"<br />\none of the boys awoke out of a deep<br />\nSpecial by Ray Production<br />\nsleep. Something was in the room,<br />\n\"Lord, You Made the Night Too Long\"<br />\nalien and unnatural. As his eyes beCOME AND SEE FOR YOURSELF<br />\ncame adjusted to the gloom, the felAdmission Free<br />\nlow noticed that their neighbor was<br />\nWHERE'S THE FIRE?<br />\nbending over the bed of his roommate.<br />\n* * * *<br />\nWith a wild yell which called in the<br />\nWe see that Dot Huebner has fintwo other boys from the next room,<br />\nhe leaped upon the intruder and bore ally covered up those things that peohim to the floor. Lights were put on, ple are talking about.<br />\nOf course we are referring to her<br />\nthe captore was secured, and explanlegs and those nice new hose. (The<br />\nations came in order.<br />\nquestion now is, does she roll her<br />\nAttempted Revenge<br />\nThe fellow who had sneaked in was own?)<br />\n* * a •<br />\nfound to have some carefully powdered crackers in his robe, which he<br />\n\" I don't go in for the petty things<br />\nhad expected, no doubt, to put in the in life,\" she said as they only necked.<br />\nbeds of his tormentors to give them<br />\n• * *<br />\na taste of their own medicine. Well,<br />\nIt is rumored that the elder Geblike many a similar instance, the inelein is already trying to discourage<br />\ncident ended with a bull-session, and<br />\nhis young son from the dangerous<br />\npeace was declared.<br />\nMusical Club trip to Atlantic City.<br />\nThis, however, was not the end.<br />\n* a<br />\nThe next day one of the freshies saw<br />\nAlthough this incident happened a<br />\nhis new-found acquaintance in the<br />\ndistance, and nudging his companion, little while ago in Atlantic City, it<br />\nhe asked what the fellow's name was. was just picked up while we were<br />\n\"Oh, that's<br />\n. He's a getting dizzy circlin' the campus.<br />\nA loyal Hopkins student had parkgraduate student doing special research now for the chemistry depart- ed his car and was preparing to enjoy a meal in one of the resort's famed<br />\nment!\"<br />\nThe fellow spoke a little while longer eating places. A young girl came up<br />\non the great ability, etc., of the grad- to him as he was sitting down and<br />\nuate student, when suddenly he not- asked,\"Pardon me, but I was looking<br />\niced that there was no one beside at your %cense plate; aren't you Mirhim. He turned around and was con- iam Hopkin's brother?\"<br />\n* a a •<br />\nfronted with the sight of the student<br />\nwhom he had just been walking with<br />\nHe stood on the bridge,and looked<br />\nholding his head and moaning, \"And down. How dark and deep it looked<br />\nwe thought he was a freshman!\"<br />\nbelow. Should he fly away from it all<br />\nor should he plunge down? You<br />\ncould hear him buzzing with excitement.<br />\nThe bridge was shining brightly;<br />\na golden glow was seen. He poised to<br />\nTo the Editor of the NEWS-LETTER: jump down--then changed his mind.<br />\nAway from the teeth with a bridge<br />\nSir:<br />\nHershner Cross made a statement around it flew the mosquito!<br />\n*<br />\nin assembly which he probably reWho was that student who in visgrets; I sincerely hope he does. He<br />\nsaid something like this — If you iting that big house jumped over the<br />\ncan't behave in two assemblies a fence, and climbed up the wall to the<br />\nmonth, perhaps you would like us to fourth floor to see his beloved. Who<br />\nmake you attend four? This outburst said chivalry was dead?<br />\n(We hope that he wasn't poison ivy<br />\nwas occasioned by some talking and<br />\nconfusion, for which I personally was to her.)<br />\n*<br />\n*<br />\npartly responsible, and for which I<br />\nwish to apologize. I had been monAt the Little Theater this week is<br />\nopolizing Dr. Sachs with questions \"Legong: Dance of the Virgins\" fl'mwhich did not interest the rest and ed in technicolor by the Marquis de<br />\nthe answers to which were not ad- Falaise on the Isle of Bali.<br />\ndressed to the whole assembly.<br />\nThe situation is something like the<br />\nCarlyle Barton business last year. It<br />\nthey must be preserved, by compulis from Dr. Mitchell's comments on<br />\nsion if necessary. How does the Counthat subject, as some will remember,<br />\ncil reconcile this with the fact that<br />\nthat I draw my idea that men say<br />\nthe only important Hopkins tradithings publicly in unguarded moments<br />\ntion is that of freedom and liberty in<br />\nwhich they would not say if they<br />\nall things, including the attendance of<br />\nstopped to think.<br />\nclasses and lectures?<br />\nNevertheless, I believe that there is<br />\nWouldn't it be better to abolish the<br />\nis something significant in what Cross<br />\ncompulsory part and throw the assaid. It shows that the Student Counsemblies open to all the classes, the<br />\ncil regards the compulsory assembgraduate students, and the faculty?<br />\nor<br />\nour<br />\nsins,<br />\nfor<br />\npunishment<br />\nas<br />\na<br />\nlies<br />\nneed to be any sperather as a dose of Pluto water which There would not<br />\nmonth, the speaker<br />\nnumber<br />\nper<br />\ncific<br />\nthroats<br />\nhas to be forced down our<br />\ngiven the week which suited<br />\nfor our owngood. They try to make being<br />\nIf the Council enlisted<br />\nus passive to the first two doses by him the best.<br />\nUniversity administrathreatening us with a third and a the aid of the<br />\nspeakers comparobtaining<br />\nin<br />\ntion<br />\nfourth. This is no attitude for the<br />\nSupper Club and<br />\nthe<br />\nthose<br />\nof<br />\nable<br />\nto<br />\ngoverning<br />\nsupposedly representative<br />\ncareful to get the safe NEWSbody of a democratic group. Person- were<br />\nas other imporally, I would rather attend four as- LETTER pre-publicity<br />\nlectures, it seems to me<br />\nsemblies a month; I enjoy them all. tant campus<br />\nwould receive the support of<br />\nBut compulsion never did anything they<br />\nstudent body. Wouldn't such<br />\nentire<br />\nthe<br />\nfeeling<br />\ntobut create distaste and ill<br />\nplace for common interward somethng which might even be a meeting<br />\nlot<br />\nto revive the dying Hopa<br />\nests<br />\ndo<br />\nenjoyable if one were not compelled<br />\nspirit?<br />\nto do it. (Mr. Duce to the contrary kins<br />\nthe stranger.<br />\n<br />\nReprinted from Donald Kieey's<br />\nreview of \"Getting Married,\" in<br />\nThe Twelve Schlepkin Brothers—<br />\nthe Baltimore SUN of Nov. 19th.<br />\nark, Monmouth, Bertram, Maurice,<br />\nMaking their first visit to Baltialthorn, Kernan, Isidor, Zermaxi, more in the thirteen years of their<br />\ncheaI, Isaac, Moses, and Patrick— existence, a group of players from<br />\nrive Saturday for a brief visit at Jasper Deeter's Hedgerow Theater<br />\ne Hopkins. A tense air of mystery presented two plays yesterday at the<br />\nhovered over them as they appeared Auditorium, under the sponsorship<br />\non the campus, but their identity was of the Playshop of the Johns Hopkins<br />\nMade known after they were wel- University. More than 500 children<br />\ncorned at the Barn by officials of the attend9d The Emperor's New Clothes.<br />\naarnstormers.<br />\n. . . Twice that number turned out to<br />\nAccording to an authoritative see the company do Getting Married,<br />\nhoUree, the Schlepkins, visiting Balti- a play which, like its author, is remores on an extended tour of the East, markably spry for its years. At the<br />\nWere several years ago important fig- same time it cannot be denied that<br />\nin Hollywood when talkies first Getting Married, a daring and dynamcatne into being. Since then they have ic gesture in 1908 is petrifying into<br />\nbeen a major factor in developing the a museum piece.<br />\ntheatre in Moscow. They are reputed<br />\nUnder cover of the usual veneer of<br />\nto be among the first who declared witty talk, Mr. Shaw in 1908 unburdthat \"the legitimate stage had better ened himself of opinions regarding<br />\nlook to its laurels\" when they helped marriage and divorce which shocked<br />\nI ntroduce talking pictures, several some of the people of that day. His<br />\nYears ago.<br />\nideas no longer have that effect ...<br />\nIstoRaving been informed of the Barn- they have been repeated too often by<br />\nmiler production of Once in a Life- lesser advocates. It is in the manner<br />\ntitne., in which George S. Kaufman of expression that the comedy shows<br />\ne•nd Mow Hart have satirically por- Its age.<br />\ntrayed the Schlepkins, the brothers<br />\nEven so there remain numerous<br />\n.e3tpressed the hope that they might flashes of prime wit. Ever so often,<br />\narid it possible to attend the only Getting Married flares up with a joke,<br />\nPerformance of the play on December an epigram and a shrewd comment on<br />\n12, When it will be presented at the modern life. . . It is of great value to<br />\nAuditorium Theatre, by the Barn- the historian and one must not foretorrnera.<br />\nget that precious few plays of 1908<br />\nThe plot of Once in a Lifetime, with would stand the test of revival.<br />\nIts time of action back in the days of<br />\nIn making their Baltimore debut<br />\nthe advent of sound pictures, is con- with a play so far back in Shaw's<br />\ncerned with three members of a chronology, the Hedgerow people per'vaudeville act—George Lewis (Ed- haps placed themselves under a disward Bauernschrnidt), May Daniels advantage. However, Mr. Deeter'S<br />\n(Elizabeth Ullman), and Jerry Hyactors ... are performing for (Shaw)<br />\nland (Jerry Branower), who join the the same service the D'Oyly Carte<br />\ngold rush to Hollywood when the Opera Company is performing for<br />\ntalkie rage starts. At the time Her- Gilbert and Sullivan. That is, they adIrian Glogauer (Stanley Prager) and here as closely as they can to tradiThe Schlepkin Brothers are the film<br />\ntion . . . In some departments the<br />\ncity's big men.<br />\ncompany is weak.. . and, in view of<br />\nThe Schlepkins will return to Mos- the work the group has done in keep(*IN some time in the near future ing alive many classic much may be<br />\nafter spending some time With their forgiven them. It is hoped they will notwithstanding.)<br />\nLet's have some other expressions<br />\nmother in upstate New York, that is, visit Baltimore again on their next<br />\nopinion about this.<br />\nof<br />\nthe<br />\nassemblies<br />\nare<br />\nIt is argued that<br />\nacTording to an authoritative source. 1<br />\n--J. E. Thomas, Jr.<br />\nand<br />\ntradition,<br />\nour<br />\nof<br />\nremnant<br />\nonly<br />\ntour.<br />\n<br />\nLETTERS TO<br />\nTHE EDITOR<br />\n<br />\nIntercollegiate Newspaper<br />\nConvention Condemns Faculty<br />\nCensorship Of College Papers<br />\n(Continued from Page 1, Col. 1)<br />\nof the Middle Atlantic States;<br />\nThat, following this letter, each<br />\n<br />\nlution. In reply to this, Mr. Bicknell<br />\nsaid: \"Such an amendment would<br />\ndestroy the value of the entire reso-<br />\n<br />\nindividual paper represented here<br />\n<br />\nlution.<br />\n<br />\nsend an individual notification of<br />\n<br />\n\"The purpose of the resolution is to<br />\nhave the INA act as a unit and set up<br />\nstandards for its members. Further-<br />\n<br />\ncondemnation an resentment to<br />\nthe college involved,<br />\nThat duplicates of all these letters be sent to the President of<br />\nthe Intercollegiate Newspaper<br />\nAssociation who shall combine<br />\nthem in leaflet form for distribution among all member papers<br />\nand the metropolitan press.<br />\nResolution Presented<br />\n<br />\nmore many editors would not be in a<br />\nposition to ask for an investigation,<br />\nfor fear of faculty interference.\"<br />\nCalls For Vote<br />\nAfter great opposition, David Hepford, President of the I.N.A., and Editor of the Diekinsonian, called for a<br />\nvote on this amendment. In a roll call<br />\n<br />\nWilliam Diamond, Editor of the vote, each member<br />\npaper being alNEWS-LETTER, presented the resolu- lowed<br />\ntwo votes, the motion was de-<br />\n<br />\ntion at the Saturday Morning busi- feated by an 18 to 20 vote.<br />\nness session. Considerable discussion<br />\n<br />\nThe Resolution was then voted<br />\ntook place, centering about the para- upon and passed by a 17 to 21<br />\nvote.<br />\ngraph dealing with what constituted<br />\nThe Editorial Sessions of the con-<br />\n<br />\nviolations of the Bill of Rights. Sever- vention were address by John<br />\nAllen,<br />\nal of the faculty advisors present at- Editor of the Linotype News, who<br />\ndistacked the resolution, on the grounds<br />\ncussed the current changes in newsthat the college students are not mature and capable enough to determine paper makeup, and went over the intheir own editorials and select their dividual college papers and gave critown editors. Diamond, replying to icisms in regard to their makeup.<br />\nthe objection, said \"The resolution is Following his address, Mr. Milnor<br />\nbased on the assumption that the<br />\nDorey, of the New York Times dispurpose of a college is to teach how to<br />\ncussed<br />\nthe subject matter of a colthink, not what to think. Since the<br />\npaper is published by undergradu- lege newspaper, and asked college<br />\nates, it should be their thinking and editors to take cognizance of the current national and international probtheir opinions.\"<br />\nAt the evening session, Arnold lems. He asked the editors not to conBicknell, Editor of the Polytechnic fine their editorial work to the narrow<br />\nReporter, presented the resolution limits of the campus, but to discuss<br />\nwith a few minor changes in phrase- the world affairs in light of the stuology. Discussion again took hold and dents' viewpoint.<br />\nDr. Swain Speaks<br />\ncontinued for over an hour. Mr. Dale<br />\nAt the closing banquet, Dr. James<br />\nHartzler Gramley, faculty advisor of<br />\nthe Lehigh Brown and White objected Edgar Swain, Professor of History at<br />\nto the resolution, saying \"This reso- Mylenberg College, spoke on the \"Diplution is based on the presumptions lomatic Conditions In Europe.\"<br />\nAfter his address, the following<br />\nthat the student is always right, and<br />\nthat the faculty is always wrong.\"' prizes were awarded to member<br />\nSeveral members immediately rose to papers:<br />\nAdvertising—First Prize, Lehigh<br />\ntheir feet and demanded the floor.<br />\nBrown and White; Second Prize,<br />\nThe essence of all of their comments<br />\nTemple News; Third Prize, Fiat<br />\nwas that the student should have the<br />\nLux of Alfred College.<br />\nright to his own opinion and the<br />\nNews—First Prize, Temple News;<br />\nmethod of formulating it.<br />\nSecond Prize, George Washington<br />\nAmendment Sought<br />\nHatchet; Third Prize, Lehigh<br />\nThe editor of the Lehigh Brown and<br />\nBrown and White.<br />\nWhite, presented an amendment to<br />\nEditorial Policy — First Prize,<br />\nthe resolution, stating that the editor<br />\nGeorge Washington Hatchet; Secof the college paper should decide<br />\nond Prize, Lehigh Brown and<br />\nwhether or not their relation to their<br />\nWhite; Third Prize, Dulsinson,<br />\ncollege should be investigated by the<br />\nDickinsonian.<br />\ncommittee provided for in the reso-<br />\n<br />\nTWO OPEN LETTERS<br />\nTo The Student Body<br />\n(Continued from Page 1, Col. 3)<br />\ntinue this system: there must be a<br />\ngreater feeling of cooperation and a<br />\ndemonstration of more gentlemanly<br />\nconduct on the part of certain members of the Freshman and Sophomore<br />\nClasses.<br />\nThe Student Council welcomes and<br />\nappreciates any constructive criticism addressed to it at any time.<br />\n—The Student Council<br />\n<br />\nTo The Student Council<br />\n(Continued from Page 1, Col. 4)<br />\nwhich can certainly be entertaining<br />\nand developmental.<br />\nIf we may be permitted the cliche<br />\nused by a correspondent in today's<br />\nOpen Forum, the root of all assembly<br />\nevil lies in your policy of leading a<br />\nhorse to water and making him drink.<br />\nOne wonders how consistent you are<br />\nwith the idea of the liberal college<br />\n<br />\nSpiked Shoe Sponsors<br />\nFifth Annual Contest<br />\nThe Fifth Annual Interscholastic<br />\nCross Country Race sponsored by the<br />\nJohns Hopkins Chapter of the National Collegiate Society of Spiked<br />\nShoe will be held on the course at<br />\nHomewood on Saturday, November<br />\n21, at 12.00 noon.<br />\nThe main prize for the race, which<br />\nwill be two and one-half miles in<br />\nlength, is a team trophy to the<br />\nschool scoring the lowest number of<br />\npoints, with five nien out of a seven<br />\nman team counting in the scoring.<br />\nThe first etght men to finish will receive medals, as will also the five<br />\nscorers on the winning team.<br />\nThe Sponsor of this annual event<br />\nhas as its officers Pete Hughes,<br />\npresident; Ted Graziano, vice-president; Paul Castelle, secretary, and<br />\nTony DiPaula, treasurer.<br />\n<br />\nwhich shuns at enforcing anything,<br />\nan dassemblies least of all, and how<br />\nconsistent with the traditions of the<br />\nHopkins which places even classes<br />\nand lectures on a voluntary basis, One<br />\nwonders why you worry about the un-<br />\n<br />\ngentlemanly conduct of a few unfortunates who have been caught in the<br />\nmeshes of your system, while the<br />\ngreat majority of students awaits<br />\nimpatiently your \"interesting and instructive speakers.\" One wonders by<br />\nwhat reason and logic your threatened<br />\nfour assemblies per month will succeed as an alternative to the present<br />\nunsuccessful plan. The description of<br />\nthe attitude of the Council, as given<br />\nby Mr. Thomas on this page, is probably more truth than fiction.<br />\nThe Student Council asks for suggestions. The following challenge is,<br />\nthen, not out of order. Allow the<br />\nNEWS-LETTER, through its editor, to<br />\nselect all speakers and to sponsor all<br />\nassemblies for two successive months;<br />\nHavens To Read Poetry allow these assemblies to be on a voluntary basis. Watch the attendance.<br />\nHopefully,<br />\nprofesHavens,<br />\nDr. Raymond D.<br />\nThe Johns Hopkins NEWS-LETTER<br />\nsor of English Literature at the Hopkins, will read from the works of<br />\nWilliam Wordsworth this afternoon<br />\nSoph Elections<br />\nat 4 in the Edgar Allen Poe Room of<br />\nThe following were elected to offices<br />\nthe Enoch Pratt Free Library.<br />\nDr. Havens has selected to read in the Sophomore Class last Friday:<br />\nsome of the favorites of his students Robert Ward, incumbent president;<br />\nwhich include Michael, The Solitary Earl Cross, vice-president; Jack WetsReaper and a few less known selec- ler, secretary; and William Banda,<br />\nsergeant-at-arms.<br />\ntion as The Prelude.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br />\n<br />\n4<br />\n<br />\nDelta Upsilon,<br />\n0.K.O.AreTied<br />\nFor First Place<br />\nTeams Battle To Scoreless<br />\nTie — Playoff For Title<br />\nLikely<br />\nK. A. ELIMINATED<br />\nKappa Sigs Win 2—S.P.E.<br />\nTo Face Pi Lams<br />\nTuesday<br />\nPlay in division B was climaxed<br />\nTuesday when Omicron Kappa Omicron met Delta Upsilon. With both<br />\nteams possessing a clean slate and<br />\ntied for first place, this game was<br />\nexpected to decide the winner of the<br />\ndivision. However, after the smoke of<br />\nbattle had cleared, neither team had<br />\nbeen able to score. This scoreless tie<br />\nonly helped to make the league more interesting. Unless an upset occurs,<br />\nD.U. and O.K.O. must meet in a playoff to decide the victor. D.U. has only<br />\nthe lowly Phi Alpha to combat while<br />\nO.K.O. will meet Phi Sigma Delta.<br />\nNeither Phi Alpha nor Phi Sig is<br />\nexrected to offer much competition<br />\nto the leaders.<br />\nAn upset by Kappa Sigma eliminated the other contestant, Kappa<br />\nAlpha. K.A. dropped a 18-0 decision<br />\nto the Kappa Sigs. In this game the<br />\nvictorious frat showed better form<br />\nthan in previous encounters. The entire team functioned well, and two<br />\ntouchdowns by Almquist and one by<br />\nMcGovern gave K.S. its second victory. This win placed Kappa Sigma in<br />\na tie for fifth along with a forfeit win<br />\nover Phi Sigma Delta.<br />\nD.U. Wins Easily<br />\nIn games played the first part of<br />\nthe week. Delta Upsilon,0K.O., Kappa Alpha, and Kappa Sigma netted<br />\nwins. D.U. crushed Phi Sigma Delta<br />\n36-0. Every starting player of D.U.<br />\ntallied, and with Murphy's score a<br />\ntotal of 36 markers were registered.<br />\nPhi Sig fought hard, but the superior<br />\npassing and running attack of the<br />\nvictors was too much. Although receiving unexpected opposition, O.K.O.<br />\nscored over Phi Epsilon Pi. Soifer<br />\nfor<br />\nand Seder marked up 12 points<br />\nLloyd,<br />\nstar,<br />\n0.K.O.'s<br />\nthe Phi Eps, but<br />\nretaliated with three touchdowns. This<br />\nenabled O.K.O. to gain an 18-12 tri-<br />\n<br />\nInterfrat Bowling Franklin And Marshall Harriers<br />\n1urn Back Jay Distancemen<br />\nTourney Under Way<br />\n<br />\n,<br />\n••<br />\nQuintet<br />\nIndia<br />\nSportlight<br />\nIntensive Drill<br />\n<br />\nCarl, more appropriately named the<br />\n\"Paavo Nurmi of Hopkins,\" hails from<br />\n<br />\nThe Interfraternity Board held its<br />\nThe Franklin and Marshall harriers -lot showing the closeness of the<br />\nSilver Springs, Md.... Entered Hopfirst bowling tourney Wednesday, No- handed the Blue Jays their fourth meet, was,<br />\nFranklin and Marshall, 23<br />\nkins as Engineer in '32 after secondvember 11, at 9.30 at the Boulevard consecutive defeat last Saturday. The —Hopkins, 33.<br />\nary schooling at Western High, D.C.<br />\nBowling Alleys. The league is under Lancaster boys, by no means, gained<br />\nThe Hopkins' J.V. team lost to St.<br />\nEstablished name on scholastic<br />\nthe chairmanship of John Ghingher an easy victory. The race was a close Joseph on<br />\nFriday. McCaulvin crossed cinderpath ... Ran \"varsity\" half and<br />\nand the fraternities on the Interfra- one, and was claimed to be the fastest the line first, and<br />\nLewis was the near- mile for 4 years, also played a bit<br />\nternity Board are the participants.<br />\nrun by Hopkins this season. Frey and est Blue Jay man behind him. The of football; participated in almost<br />\nThe Delta Upsilons led with the Howard, both of F. and M. tied for score, smilar to that<br />\nof the F. and M. every outside activity in high school<br />\n. . At Homewood immediately took to<br />\nhighest total when they beat the Phi lrst place. Frey was Middle Atlantic meet, was St. Joseph-21,<br />\nHopkins-34.<br />\nhis first love—the track . . . Earned<br />\nGams 901 to 869. The Alpha Delta champ last year. Capt. Sholtes finThanksgiving morning, the varsity \"H\"<br />\nfirst two years running half and<br />\nPhi Club nosed out the Delta Phi ag- ished right behind them followed by<br />\ntravels to Washington, D.C. to com- mile . . . Now captains cross country<br />\ngregation 873 to 867. Hahn„ having Jennings of F. and M., and fifth and<br />\npete in the National Capital Champ- team after running varsity for 3<br />\nthe highest individual score, rolled sixth places were taken by Brown and ionship. Two trophies are awarded, years . . . Most thrilling race: Hopup 118 points in the second game of Driscoll of the Mack and Blue. Up one to the winner of the division of kins-Virginia 4 mile cross - country<br />\nhis meet to gain a 891 to 875 win for until the last half mile, a Hopkins out of town clubs, and the other to the meet in his Sophomore year when our<br />\nAlpha Chi Rho over Kappa Alpha. The group consisting of Sholtes, Brown, winner of the college division. This own \"Paavo\" beat out his team mate<br />\nannual event was started three years Holtzman in a 100 yard finish by 2<br />\nmost interesting match of the eve- Driscoll, and Warminski held third,<br />\nago, and Hopkins captured the award inches to win the race and meet for<br />\nning was the one in which Sigma Phi fourth, fifth and sixth positions. The each year for its division.<br />\nI the black and blue.<br />\nsllon played a third game to come<br />\ngroup was broken up by Jennings and<br />\nout victors over Kappa Sigma after<br />\nMetschowitz. The remainder of the<br />\ntyng the first two games. Particularly<br />\nplacing was, Lyman-10, Hahn (F.M )D.U. has shown great potentialities.<br />\n11, and Lewis-12. This was the first<br />\nvarsity meet for Lewis, and his running was commendable. The score,<br />\n<br />\nFinalFratSchedule<br />\nDivision A.<br />\nWon Lost Tied<br />\n5<br />\n0<br />\n0<br />\nPi Lambda Pi<br />\nSigma Phi Epsilon 5<br />\n0<br />\n0<br />\n1<br />\n0<br />\n4<br />\nPhi Psi<br />\nDelta Phi<br />\n1<br />\n3<br />\n1<br />\nTau Alpha Phi<br />\n1<br />\n3<br />\n1<br />\nAlpha Epsilon Phi 1<br />\n4<br />\n0<br />\nTau Alpha Omega 0<br />\n3<br />\n2<br />\nBeta Theta Pi<br />\n0<br />\n3<br />\n2<br />\nWorn Lost Tied<br />\nDivision B<br />\nDelta Upsilon<br />\n5<br />\n0<br />\n1<br />\nOmicron Kappa<br />\n4<br />\n0<br />\n1<br />\nOmicron<br />\n3<br />\n2<br />\n0<br />\nKappa Alpha<br />\n3<br />\n0<br />\nAlpha Delta Phi 3<br />\nPhi Sigma Delta 2<br />\n3<br />\n0<br />\n2<br />\n3<br />\n0<br />\nKappa Sigma<br />\n1<br />\n4<br />\n0<br />\nPhi Epsilon Pi<br />\n0<br />\nPhi Alpha<br />\n0<br />\n5<br />\n<br />\nIIIPPOD<br />\n<br />\n0<br />\n<br />\nT ro<br />\nf'fit<br />\n<br />\nWEEK BEG.<br />\nFRIDAY NOV.20<br />\n<br />\n'!rON<br />\n<br />\n4<br />\nOLID STAGE ;<br />\n/<br />\nPA9/1.<br />\n<br />\nTED,'<br />\nTED LEWIS BAND<br />\nRVUE<br />\n<br />\n25E<br />\n<br />\nINE flavor is only<br />\nhalf the story ...<br />\nthere is,in National<br />\nBeer, the deep<br />\ndown wholesomeness of extra costly<br />\ningredients. ....<br />\n<br />\nF<br />\n<br />\n; VOL<br />\nAfter several weeks of b1-weil<br />\nbasketball practices, the court esi<br />\nis now ready for intensive drills WI<br />\nwill begin today at 4 P.M. at the<br />\nand continue until the first game<br />\nAmerican U. on December 11. Al<br />\nlast year's varsity squad men,<br />\nthe exception of Traggis who is I<br />\noccupied with football, have now tt<br />\n<br />\nFamous words of famous college men visiting our store<br />\nfor the first time . . .<br />\n<br />\n°nil/ $35 14 Frie<br />\nMai<br />\n—Yes, only $35 . . . You will<br />\nunderstand their surprise<br />\nwhen you see the kind of<br />\nclothes we're offering at this<br />\nWi<br />\ngenuinely low price. Expert skillf<br />\ntailoring, distinguished fat,F.lddi(<br />\nries and styles that are outstanding but not freakish. ities<br />\nheigh<br />\n<br />\nJos. Schloss<br />\nand Son<br />\n<br />\n'NATIONAL<br />\n<br />\n5 East Lexington S.<br />\nThe Natio ' Brewing CO.<br />\nBALTIMORE, MD.<br />\n<br />\nCot<br />\n<br />\n\"WhaCM<br />\n<br />\nA BIG FEATURE FILM<br />\nSalim/Er ONLY DOWNTOWN<br />\n&hue STAGE SHOW *<br />\n<br />\nAl<br />\n<br />\ned out and high hopes are held<br />\na successful season.<br />\n<br />\nWhorl<br />\nas its<br />\nof tl<br />\nmusic<br />\n<br />\nDel<br />\nthe ii<br />\nWh<br />\n<br />\n(Nowhere else)<br />\n<br />\nN. 3-11<br />\n<br />\nevent<br />\n<br />\nsocial<br />\ndevot<br />\nthe<br />\n<br />\nwhich<br />\nefit<br />\nWill<br />\n<br />\norchet<br />\nbe th<br />\nbut<br />\n<br />\nThe<br />\non a<br />\n<br />\nrathei<br />\n<br />\n.579444e<br />\n<br />\numph.<br />\nKappa Sigma broke in the win column by registering a 32-12 victory<br />\nover Phi Alpha. Bull was the individual star by making four touchdowns.<br />\nAlmquist added another and Clautice<br />\nPhi<br />\na safety for the Kappa Sigs.<br />\nGanz<br />\nby<br />\nmade<br />\nwere<br />\nAlpha a scores<br />\nand Lachman.<br />\nThe game between Pi Lambda Phi<br />\nto<br />\nand Phi Psi, yesterday, helped<br />\ndetermine the winner of division A,<br />\nbut nothing will be definitely settled until the last series of games<br />\nbe<br />\non Tuesday. The vital contest wi'l<br />\nEpPhi<br />\n-Sigma<br />\nPhi<br />\nLambda<br />\nthe Pi<br />\nsilon clash. A win by S.P.E. will give<br />\nthat frat the title, and a win by the<br />\nPi Lambs will also strengthen their<br />\nchances. The winners of both divisions will meet to (etc rmine the chain-<br />\n<br />\nprovi!,<br />\nt:<br />\n<br />\nin<br />\n<br />\nWhich<br />\n—rhy<br />\ntry<br />\n'Eigh<br />\n<br />\nA ty]<br />\ntion I,<br />\n<br />\nYou know that a cigarette<br />\ncan be mild; that is, when you smoke it<br />\nit's not harsh or irritating.<br />\nYou know that a cigarette can<br />\nhave a pleasing taste and aroma.<br />\nWhen you smoke a cigarette and find<br />\nthat it has the right combination of mildness, good taste, and aroma, it just seems<br />\nto satisfy you ...gives you what you want.<br />\n<br />\npionahip outfit.<br />\n<br />\nFraternity Schedule<br />\nThursday, Nov. 19—<br />\nPi Lambda versus Phi Psi<br />\nBeta Theta Pi versus Sigma Phi<br />\n<br />\nI smoke Chesterfield all<br />\nthe time, and they give<br />\nme no end of pleasure.<br />\n<br />\nEpsilon<br />\nFriday, Nov. 20—<br />\nTau Alpha Phi versus Delta Phi<br />\nTau Alpha Omega versus Alpha<br />\nEpsilon Pi<br />\nTuesday, Nov. 24—<br />\nP1 Lambda Phi versus Sigma<br />\nPhi Epsilon<br />\nPhi Psi versus Delta Phi<br />\nBeta Theta Pi versus Alpha Ep-<br />\n<br />\nGrind<br />\nMi<br />\n<br />\natraig<br />\n<br />\nKind,'<br />\nis On<br />\nsued<br />\nlyric's<br />\nson.<br />\n<br />\ni een b<br />\nmor h<br />\nI Prom<br />\n<br />\ntheir<br />\nrepiac<br />\nI elated<br />\n<br />\nbeLar<br />\n<br />\nThe<br />\nbe led<br />\n<br />\nI sor of<br />\nPresid<br />\n<br />\nHeywi<br />\n<br />\nbe Gu<br />\n<br />\nPat]<br />\nthe p<br />\n<br />\nthe (<br />\nBerry,<br />\nDr. al<br />\n<br />\nsilon Pi<br />\nTau Alpha Phi versus Tau Alpha<br />\nOmega<br />\nPhi Sigma Delta versus Omicron<br />\nKappa Omicron<br />\nAlpha Delta Phi versus Kappa<br />\n<br />\nJames<br />\nS. An<br />\n<br />\nCal<br />\nTo<br />\n<br />\nSigma<br />\nDelta Upsilon versus Phi Alpha<br />\nKappa Alpha versus Phi Epsilon<br />\n<br />\nMfrs.<br />\n<br />\nCharles Lander, Prop.<br />\nHair Cutting 40c<br />\n<br />\nBOULEVARD BARBER SHOP<br />\n<br />\nAtm<br />\n( rdina<br />\nteat Ft<br />\nbe cor<br />\nObject<br />\nMany<br />\nthesis.<br />\n<br />\nOn 33rd Street<br />\nBetween St. Paul And Calvert Streets<br />\nSaturday<br />\nWeek Days<br />\n$ A.M. To 7.30 P:Mi 8 A.M. To 9 P.M.<br />\n<br />\nBirely's Pharmacy<br />\n<br />\nThe<br />\nWinne'<br />\n<br />\nST. PAUL AT 33RD STREET<br />\nPrescriptionl—School Supplies<br />\nSandwiches<br />\nUnexcelled Fountain Service<br />\n<br />\neafter<br />\n<br />\ni,...4y.pr4.1opAcccp<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nhdnntivittits Nrinadirttrr<br /><br />\nFRESHMAN<br />\nELECTION FINALS<br />\nTODAY<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br /><br />\nvoLumE mar, No. 14<br /><br />\nSponsor Of Ball<br /><br />\nIntercollegiate Newspaper<br />\nConvention Condemns Faculty<br />\nCensorship Of College Papers<br /><br />\nPRICE 5 CENTS<br /><br />\nJeromeDavis,Yale Sociologist, tr<br />\nWell Known As.Educator And<br />\nLiberal Leader,To Speak Here<br /><br />\nf4°1<br /><br />\n•<br /><br />\nGreen, Hutchcraft<br />\nIn Frosh Finals<br /><br />\nSupper Club At 6<br />\nThirty-Five To Get Addresses<br />\nP. M., University LecJHU Varsity Seals ture Tonight At 8.15<br /><br />\nDISAGREE Triple Tie For Vice-PresiDelegates From Polytechnic dency; Dickson, Cluster,<br />\nGhent Nominees<br />\nReporter', 'News-Letter',<br />\nPresent Resolution<br />\nApproximately seventy - five per<br /><br />\nASKED TO LEAVE YALE<br />\nMaulsby, S. A. C. Chairman,<br />\nAnnounces Eligible<br />\nDismissal From Yale Next<br />\nStudents<br />\nJune Causes National<br />\nControversy<br />\nThe 35 students who are scheduled<br /><br />\nResolution Passed To Investigate Witholding Of Editorial Freedom At Schools<br />\nADVISORS<br /><br />\n•<br /><br />\n.4.<br /><br />\n•<br />\ncent of the Freshman Class voted in<br />\nBy MORRIS A. WESSEL<br />\ntheir primary election Wednesday,<br />\nAllentown, Pa.—Climaxing a relaselecting Dick Green, a Delta Phi<br />\ntively uneventful two day conference<br />\npledge and member of the football<br />\nat Muhlenburg College, the Intercolteam, and Don Kirkwood, Kappa Siglegiate Newspaper Association of the<br />\nma neophyte and a Business and EnMiddle Atlantic States passed a resgineering student, to meet in the presolution condemning \"any action of a<br />\nidential finals today. Maurice Conory<br />\nUniversity or College Administration<br />\nand Theodore Frey also ran.<br />\nor Faculty to muzzle student editorLaurie Dickson, Raymond Cluster,<br />\nial freedom in any form whatsoever.\"<br />\nand Victor Ghent tied for the priviTne same resolution provided for a<br />\nlege of going to the vice-presidential<br />\ncommittee to investigate violations<br />\nfinals, eliminating Seymour Pestronk.<br />\nof the Bill of Rights in member colDickson is a Phi Psi neophyte and<br />\nleges of the Association.<br />\nsecretary.<br />\nCommission<br />\nFreshmen<br />\nThe resolution, presented by the<br />\nCluster is pledged to Phi Sigma Delta,<br />\ndelegations from the Polytechnic Reand Victor Ghent, an Alpha Chi Rho.<br />\nporter of the Brooklyn Polytechnical<br />\nCourtwright Running<br />\nInstitute and the Johns Hopkins<br />\nwill go to either<br />\nsecretaryship<br />\nThe<br />\nNEWS-LETTER, and passed at the final<br />\nbusiness session follows:<br />\nBenjamin Courtwright or Arthur RosWhereas, we, the assembled ediset, who topped Robert Molloy, Leontors and business managers of<br />\nar Naurison, and Dean Short. Courtthe college newspapers of the Inwright is a D.U. and a candidate for<br />\ntercollegiate Newspaper Associathe Cotillion Board.<br />\ntion of the Middle Atlantic States<br />\n—Courtesy The Sunpapers<br />\nFive candiates also sought the ofbelieve that freedom of conGLORIA MELLIER<br />\nscience is the foundation of our<br />\nMiss Gloria Meflier, a debutante of this season, has been named sponsor<br />\nfice of treasurer, Lerony Applefeld<br />\ndemocracy and that the basis of<br />\nof<br />\nthe<br />\nFirst Cotillion, to be held Thanksgiving night at the A7cazar. Miss<br />\nKappa<br />\nSig<br />\na<br />\nO'Brien,<br />\nand and Harold<br />\nour civil liberties lies in a free<br />\nLois Jane, of Jamestown, New York, will be guest of honor. The HudsonHall,<br />\nJohn<br />\npledge, leading the field.<br />\npress and free speech; and<br />\nDeLange Orchestra will furnish music from 10 to 3.<br />\nTaynor, and Robert Vernon<br />\nMelvin<br />\nWhereas, we believe that educawere unsuccessful candiates.<br />\ntion is one of the basis of our<br />\ndemocracy and that the greatest<br />\nsingle medium of public education<br />\nis the newspaper; and<br />\nWhereas, we find that many college newspapers of America are<br />\nbeing deprived of their freedom<br />\nof expression by faculty and administration interference; and<br />\nWhereas, it is the avowed purpose of this organiation \"to promote cooperative relations between its members, and to endeavor to develop the highest<br />\nstandards of college journalism.\"<br />\nTherefore, Be is Resolved, that<br />\nwe resent any action of a University Administration or Faculty to muzzle student editorial<br />\nfredom in any manner whatsoever, that we resent and condemn<br />\nany attempt to prescribe what a<br />\nstudent shall or shall not think;<br />\nThat an investigating committee<br />\nbe appointed immediately to determine which of the colleges<br />\nrepresented in this gathering has<br />\nviolated the code of the Bill of<br />\nRights in regard to its student<br />\npapers. By violation we mean any<br />\nattempt by the faculty or administration to control the election of editors or any attempt to<br />\ncensor news columns or editorials, or any attempt to limit the<br />\nsubject matter which lies within<br />\nthe law, or attempt to sway deliberately the editorial opinion of<br />\nan editor;<br />\nThat a letter of condemnation<br />\nfrom the Intercollegiate Newspaper Association of the Middle<br />\nAtlantic States as a unit be sent<br />\nto all offending college administrations expressing the opinion of the united college papers<br />\n(Continued on Page 3, Col. 5)<br /><br />\nHullabaloo Photographers<br />\nTo Return December First<br />\nPhotographs for the 1936 Hullabaloo<br />\nWill be taken on Tuesday and Wednesday, December 1st and 2nd, Robert<br />\nAustrian, Editor, announced last week.<br />\nIt will mark the photographers'<br />\nfinal visit to the campus.<br />\n\"We are hoping,\" said Austrian,<br />\n\"to bring in every available picture<br />\nthin time. The photographers will<br />\ndefinitely not return after the first of<br />\nDecember, and anyone who wants his<br />\nPicture taken must be in the office<br />\nat this time.<br />\n\"The office will be open for these<br />\ntwo days from 9.30 A.M. to 5 P.M. The<br />\nPhotographers will be available at all<br />\ntimes.\"<br /><br />\nto receive the Johns Hopkins Varsity<br />\nSeal have been announced by Holt<br /><br />\nDr. Jerome E. Davis, Associate<br />\nProfessor of Practical Philanthropy<br />\nMaulsby, chairman of the Student<br />\nat Yale University Divinity School,<br />\nActivities Committee.<br />\nwho has been asked to leave at the<br />\nThe candidates for the award, toend of this academic year, will be the<br />\ngether with their positions are as folSupper Club speaker tonight at 6.00<br />\nlows:<br />\nP.M. at Levering Hall. He will also<br />\nHenry Kramer, Business Manager<br />\nspeak at Wilson Memorial Church, on<br />\nof Hullaballoo and Barnstormers;<br />\nUniversity Parkway and charles<br />\nJerry<br />\nBranower,<br />\nBarnstormers;<br />\nStreet at 8.15 P.M.<br />\nMarty Levine, President of BarnBefore coming to Yale in 1924, Dr.<br />\nstormers,<br />\nHu'laballoo;<br />\nHershner Davis was secretary to Dr. Wilfred<br />\nCross, President of Student Council, 1 Grenfell, director of the Grenfell MisHullaballoo; Howard<br />\nReizenstein, sion at Labrador. He came to Yale<br />\nNEWS-LETTER; Roy Hartman, Hulla- from Dartmouth College, where he<br />\nheld the position of assistant profesballoo; Fred Davis, Hullabaloo; Frank<br />\nsor. At Yale he has held the Gilbert<br />\nSilver, Hullaballoo; Jules Hoffman, L. Stark chair of practical philanHullaballoo; Philip Grossman, Presi- thropy for ten years.<br />\ndent of Debating Council; Dave Erck,<br />\nIs Prolific Author<br />\nHe is co-author with Harry Elmer<br />\nPresident of Cotillion Board, Musical<br />\nClub; Brian Murphy, Cotillion Board, Barnes of Readings In Sociology and<br />\nauthor of The Russian Immigrant,<br />\nBarnstormers, Musical Club, Student<br />\nLabor Speaks for Itself in Religion,<br />\nCouncil; J. M. Bradford, Cotillion and The New Russia.<br />\nBoard, Student Council, Chairman of<br />\nDr. Davis, an outspoken critic of<br />\nJune Week.<br />\nfinancal domination of education, has<br />\ncharged that his dismissal from the<br />\nHimes, Ewing Also<br />\nJohn Himes, Barnstormers; Clark University is a direct result of his<br />\nadherence to liberal opinions.<br />\nEwing, Barnstormers; William McLast week a letter to the Yale offiFeely, Business Manager of the Barn- cials signed by seven Yale<br />\nalumni,<br />\nstormers; Oscar Collins, Barnstorm- Including Stephen Vincent Benet,<br />\nWilliam Whitelock, Kappa Alpha,<br />\ners; Robert Watkins, Barnstormers, held the dismissal of Dr. Davis to be<br />\nand Harold Joffe will met in the finStudent Council, NEWS-LE:True Hut- \"tantamount to an expulsion for social and economic views\" and asserts<br />\nals for sereant-at-arms, Daniel Ehrlabd'oo; Pierson M. Checket, Producthat the action \"fills us, as Yale, with<br />\nlich losing out.<br />\ntion Manager of Barnstormers; Leon- greater shame for<br />\nthe name of Yale<br />\nCouncil Position Open<br />\nard Jaffe, NEWS-LETTER, Hullabaloo; than any action of the University<br />\nThe important position of freshJames Morrow, NEws-LETTER; David within our memory.\"<br />\n\"Yale On Trial\"<br />\nman representative to the Student<br />\nCaplan,<br />\nNEWS-LETTER; B. D. Pinck,<br />\nIn light of an incredible misappre- Gentlemen:<br />\nIn a report published as a suppleCouncil is being fought for today by hension on the part of certain memNEWS<br />\n- LETTER;<br />\nJewett Goldsmith, ,<br />\nThe perennial bogey of assemblies<br />\nment to this week's New Republic,<br />\nJames Triplett and Milton Hutch- bers of the Freshman and Sophomore is once again haunting the Hopkins NEWS-LETTER; Julian Adler, NEWSentitled \"Yale On Trial\" an investicraft, students in the College of Arts Classes concerning the position of Campus. The problem is virtually the LETTER; Holt Maulsby, Musical Club, gation by the American Association<br />\nthe Student Council in regard to the Same as it was last year, and the<br />\nand Sciences. Triplett is also a Phi<br />\nPresident of Student Activities Com- of University Professors of his disassemblies, it is felt that a statement year before, and the year before that.<br />\nmissal is recommended by a group<br />\nPsi pledge and a candidate for the of clarification would be<br />\nappropriate. In spite of all the \"desires of the Ad- mittee, Student Council; Ernest J.<br />\nof<br />\ndistinguished educators, headed by<br />\nCotillion Board.<br />\n1. Weekly assemblies are favored ministration,\" and in spite of the Pieper, Musical Club, Student Council.<br />\nDr. Charles A. Beard, eminent historAltogether twenty - six first year by the Administration and the Stu- position and action of the Student<br />\nSteeper Honored<br />\nian. Other members of the committee<br />\nmen entered the lists for the six dent Council as a means of offering Council, your plan to date has been<br />\nJohn Steeper, President of Musical include Dr. Paul H. Douglas of the<br />\nto the students the diversified points a miserable failure.<br />\nClub; Ted Graziano, Musical Club, University of Chicago, Dr. Edward<br />\navailable offices, thirten surviving.<br />\nof view expressed by the various<br />\nThe failure, as always, rests on Student Council; Tom Jay, Musical<br />\nA. Ross of the University of WisconUnusual political activity and inter- speakers, and a place where the un- two<br />\nbases: 1, the ill-conceived plan of Club; W. Jenkins, Musical Club; John<br />\nsin, and Dr. Colston E. Warne of Amest is demonstrated by the fact that<br />\ndergraduates can be reached in a forcing certain classes of students to Soule, Musical Club; Floyd Katsky,<br />\nherst College.<br />\nover one hundred and eighty out of<br />\ngroup for the purpose of disseminat- attend the assemblies; 2, the relative- Musical Club.<br />\n\"The circumstances surrounding the<br />\ntwo hundred and eighty eligible voted.<br />\ning information, making announce- ly poor quality of your assemblies.<br />\nThe Varsity Seal is a key awarded dismissedal of Dr. Davis,\" the report<br />\nBarely half the class voted in the<br />\nments, and reading notices of all types These causes of your failure result to members of the Senior Class who<br />\nSophomore primaries last week.<br />\nsays, \"present positive elements inwhich are of importance to the stu- from the quite apparent misconcep- have served for three years or more<br />\nvolving academic liberties, the rights<br />\ntions which you have ben kind enough in some capacity on a major non-athdent body as a whole.<br />\nof the scholar as a citizen, and the<br />\n2. The Student Council is entrust- to number 1, 2, and 3 in your letter. letic campus activity.<br />\ncorrect procedure of the university<br />\ned with the management of these<br />\nThe assembly is valueless as a<br />\nauthorities in dealing with such lib\"disseminating<br />\ninformaassemblies. Many times in the past medium for<br />\nerties and rights.\"<br />\nyears the then-existing Council placed tion and making announcements.\"<br />\nProtest By Insull<br />\nTryouts<br />\nTeam<br />\nTo<br />\nBe<br />\nan<br />\nRifle<br />\nHeld them on a voluntary basis, only to re- There is no notice made at<br />\nassembIt is alleged that Professor Davis,<br />\nIn Few Weeks After More<br />\nturn to the compulsory system after ly which has not been, or cannot be,<br />\nafter having been promised promoStudents Enroll<br />\nthe attendance had dropped to only made through the NEWS-LETTER. The<br />\ntion from the rank of associate prothirty or forty students—certainly not NEWS-LETTER reaches a wider audi- Grant Going To Hopkins Medical<br />\nfessor<br />\nto that of full professor, was<br />\nSchool Urged By Senator<br />\nWith the smell of powder once a very representative group. Thus, if ence, and, when the announcement is<br />\ndismissed by Yale because of his poRadcliffe<br />\nmore permeating the air of the North assemblies are to continue, as is de- made, you can be sure that the reader<br />\nlitical and economic beliefs and actLoft, the Rifle Club did its first firing sired by the Administration; it ap- is not sleeping or playing tit-tat-toe.<br />\nivities. Protest by Samuel Insull, Jr.,<br />\nTo<br />\nfinance<br />\ncertain<br />\nspecial<br />\naspects<br />\nfor the season on Tuesday, under the pears that the compulsory attendance<br />\nYou misplace the blame for the<br />\na<br />\nYale alumnus, against Dr. Davis'<br />\nsupervision of Sergeant Perry. Thirty- system must be retained.<br />\npoor attendance at voluntary assemb- of research relating to the causes<br />\ncharacterization<br />\nof Samuel Insull,<br />\nand<br />\ntreatment<br />\nof<br />\ninfantile paralysis,<br />\nfive members have signed up so far<br />\n3. Until the latter part of last lies. It lies not with the students, but<br />\nSr., as a \"higher racketeer,\" is said,<br />\nand more are expected. Tryouts for year, assemblies were held weekly. with you. The only attraction of the the Hopkins has received fifteen<br />\nby the report, to have influenced Yale<br />\nthe Rifle Team which represents the The Council then conceived the idea assembly lies in the speaker which thousand dollars from the national<br />\nI in its action.<br />\nUnivrsity will be held in a few weeks that if only two assemblies a month you provide. You have disappointed committee of President Roosevelt's<br />\nWhile at Yale, Dr. Davis has been<br />\nafter more students have enrolled. The were held, better speakers could be and betrayed the student body, for it Birthday Balls, held annually in Jana leader in liberal circles, and accorduary.<br />\nfirst match of 1937 will be with obtained and a more willing and co- hardly seems credible that you could<br />\nThe money was given to the Hop- ing to the following editorial in The<br />\nGeorgetown on January 9 at George- operative feeling toward the assemb- have found a more generally uninterkins<br />\nafter agitation on the part of Yale Alumni Weekly for November<br />\ntown University in Washington, a lies would be manifested by the mem- speakers. It is unfortunate that Leon<br />\n29, 1935, this was beyond the scope<br />\nshoulder to shoulder match, as com- bers of the Freshman and Sophomore Sachs, Broadus Mitchell, and Arthur U.S. Senator George L. Raeliffe who<br />\nof<br />\nYale's standard of academic freepared with postal matches which Classes. Moreover, unless some appre- Garfield Hayes come but once a year. learned that a request made for a<br />\ndom.<br />\ngrant<br />\nby<br />\nDr.<br />\nAlan<br />\nM.<br />\nChesney,<br />\ncomprise most of such firings.<br />\ndean<br />\nciation of the better speakers—made They are lost and forgotten in the genThe editorial condemns any activity<br />\nof the Hopkins Medical School, had<br />\nAll students interested in target possible by the two assembly a month eral run of speakers.<br />\n\"which<br />\npublicly involved a teacher of<br />\nbeen<br />\noverlooked.<br />\nfiring are invited to join the club, as system—were shown by a conduct<br />\nThe plan advanced by those who<br />\nSeventy per cent of the money the University in a political or labor<br />\nmost of last year's team graduated in of common decency at the assemblies, are feverishly circulating petitions<br />\nquarrel where the teacher may find<br />\nJune, and everyone has a chance for it was realized that the two assembly around the Campus is quite as bad as raised by each community in which<br />\nthat he has brought the University<br />\nthe<br />\nBirthday<br />\nBalls<br />\nare<br />\nteam.<br />\nheld<br />\nthe<br />\ngoes<br />\non<br />\nto<br />\nplace<br />\nMembership<br />\nthe<br />\nUnivera<br />\na month plan was not receiving either yours. It is obvious that<br />\n(Continued on Page 3, Col. 1)<br />\ndues are $2 for the first year, and $1 the good will or the cooperation of the sity cannot afford to pay speakers for the local agencies of the community<br />\nfor<br />\nuse<br />\nin<br />\naiding<br />\nthe<br />\ncrippled. The<br />\nfor all other members in previous students and a return to the old sys- student assemblies. Nor should there<br />\nyears. The dues go to pay for cart- tem of four compulsory assemblies a be any need for doing so. The Hop- first year of the balls the remaining<br />\nAll Time Reports Due<br />\nridges, which are furnished members, month would be the only course left kins is fortunate enough to be stra- thirty per cent went to the Warm<br />\nMiss Judge has announced that all<br />\ntargets, and the upkeep of the range. to follow.<br />\ntegically located in a position where Springs Foundation in accordance<br />\nThey may be paid in the Military OfThe present Student Council adopt- qualified, attractive speakers should with the wishes of President Roose- time reports for this month for stuflee, on the fourth floor of Gilman ed the same stand. It has held but be easily attainable. It is unfortunate velt. In past years, however, the dents holding N.Y.A. Jobs here are due<br />\nHall. The range is open from the mid- two assemblies a month and has en- that the Student Council has not made thirty per cent has been forwarded to tomorrow, November 21, by 1:00 P.M.<br />\ndle of November to the second week deavored to obtain interesting and the most of its opportunities; it is a national committee with the un- at the office of the Bureau of Appointin April, five days a week; the hours Instructive speakers. It now reiterates unfortunate that the student body has derstanding that this body appropri- ments.<br />\nNo payment f 'he month can be<br />\nare posted on the bulletin board on the condition under which it can con- been deprived of a weekly experience ate sums to medical schools doing<br />\napproved work ..<br />\nmade if report<br />\nsled in late.<br />\nrange.<br />\n(Continued on Page 3, Col. 6)<br />\n(Continued on Page 3, Col. 3)<br /><br />\nTWO OPEN LETTERS<br />\nTo The Student<br />\nBody<br /><br />\nRifle Club Ushers In<br />\nSeason; 35 On Roll<br /><br />\nTo The Student<br />\nCouncil<br /><br />\nRoosevelt Balls Pay<br />\nParalysis Research<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br /><br />\n2<br />\nt<br /><br />\nVie 3o1ing 34opkincs<br /><br />\ntonal freedom means; they are censored in more than one way, but they<br /><br />\n1<br /><br />\nof administration.\"<br /><br />\n•:- UNIVERSITY: - :<br /><br />\nCommenting in \"The Journal of<br />\nHigher Education\" upon<br /><br />\nPIPES<br /><br />\nOF<br />\nALL KINDS<br />\nPIPE REPAIRING —<br />\nTobaccos Specially Blended<br /><br />\neligibility<br />\ndon't know it. Many others, even<br />\nfarther withdraw into their micro-1 It was only by dint of great per- I Crouched to spring on us, they fol- recommendations recently made by<br />\nFADER'S<br />\nI got Uncle Humphrey lowed the professor who was edging the president of the University of<br />\n210 EAST BALTIMORE STREET<br />\ncosmic shells, know they are censored suasion that<br />\n•<br />\nPLaut 3061<br />\nto sit in on my graduate class. He had nearer and nearer to us. His knife North Carolina, he said they are \"so<br />\nbut don't care.<br />\nfirm, so rigid, and so reactionary as<br />\nbeen there before and had been exwas longer, keener and much brightto stun those who have been hoping<br />\ntremely uncomfortable, had disliked<br />\n$2.00<br />\ner<br />\n(otherwise he couldn't be a pro- for some mite of liberalism.\"<br />\nSubscrtptiuu per<br />\nthe<br />\nway<br />\nand<br />\nclass<br />\nthe members of th<br />\n$2.50<br />\n.<br />\nMail<br />\nBy<br />\nIt had been conducted. I remember fessor if a student could split hairs<br />\nDr. Oberteuffer pointed out that<br />\nRemit subscription fees to Treasurer, Student<br />\nthat he swore a great deal afterwards, better than he) and made him an ob- \"one is amazed by the number and<br />\nActivities Council, Remsen Hall, Postottice, Julius<br />\nHopkins University.<br />\nbut after burying his face in the foam ject of much apprehension.<br />\ncomplexity\" of constitutions of high<br />\nSizing the position up at a glance,<br />\nEntered as second class matter December 3,<br />\na glass of beer, he forgot it comof<br />\nattackof<br />\npurpose<br />\nthe<br />\nfor<br />\nschool athletic associations and colwas<br />\nIt<br />\n1909, at the Postottice in Baltimore, Md., under<br />\npletely. But after telling him that it Uncle Humphrey leaped on the seat lege<br />\nthe Act of Congress, November .1, 18‘9.<br />\nconferences.<br />\ning this problem of faculty and ad- --—<br />\nwas an especially interesting and of his chair and loudly recited Byron's<br />\nJune,<br />\nto<br />\nOctober<br />\nfrom<br />\nPublished semi-weekly<br />\nare age limits, scholarship<br />\n\"There<br />\nstudent<br />\nin<br />\ninterference<br />\nJewelers and Opticians<br />\nexcept during examination and college holiday ministration<br />\nbrilliant lecture, I finally convinced \"Stop! for thy tread is on an Empire's standards, transfer rules, amateur<br />\nperiods by undergiaduates of the Johns Hopkins newspapers that the INA convention<br />\ndust!\" This gave them quite a shock,<br />\nhim that he ought not to miss it.<br />\nUniversity.<br />\nrules, and freshmen rules. And the<br />\naccepted the resolution presented by<br />\nWe sat down in a corner, away and in that moment, Uncle Humphrey<br />\nPEN and PENCIL SETS<br />\nEDITORIAL STAFF<br />\nhistory of each one is that it is formWilliam Diamond ..... ..... ......... Editor-in-Chiej<br />\ntable where some dozen grabbed my arm and we fled down the<br />\nAssociate Editor the delegations from the Hopkins and from the<br />\nulated to control some troublesome<br />\nStanley Finkel<br />\ngraduate students were seated, mute- hall. Not long they stood transfixed, situation—without counting the cost<br />\n'times Morrow, David Caplan ...Managing Editors<br />\n.. _Sports Editor the Brooklyn Polytechnic Institute.<br />\nBernard D. Pinck<br />\nly staring through the top. Tough but poured out the room screaming of those who might be trying to foster<br />\nBenjamin Root, Wethered Barron, Jr,<br />\n3222 Greenmount Avenue<br />\nAssistant Managing Editors The result is undoubtedly the first their actual faces were not identical, vengeance. Around the corner we ran,<br />\nathletics for the benefit of all boys<br />\nArnold Glantz, Harold Zheutlin<br />\nAssistant Sports Editors step towards a solution of the great- naturally, inspection showed that banking on the wall and then down<br />\nregardless of age, income, or previous<br />\nReporters--Max Iskowitz. Nathaniel Finkelstein,<br />\nthe echoing corridor when we suddenJewett Goldsmith, Howard Reizenstein, Jul est problem before college editors most of their expre-alon had the<br />\ncondition of servitude.\"<br />\nian Adler, Carl Basin, Floyd Katske,<br />\nportly<br />\ninto<br />\nly<br />\na<br />\nran<br />\ngentleman.<br />\nrather<br />\nwonderful vacant look and that they<br />\nLeonard Rubinger, Morris Wessel, Arthur today.<br />\nSensing that his bowing to decorum<br />\nKatz, Martin Krieger, Lester Rosenthal,<br />\nere prone to go off into trances even<br />\nprobably<br />\nand<br />\nEast,<br />\nthe<br />\nThroughout<br />\nSidney Baum, Murray Kenipion.<br />\nmight be fatal Uncle Humphrey yankposes.<br />\nof<br />\nstudious<br />\nthe<br />\nmost<br />\nin<br />\nwhen<br />\nBUSINESS STAFF<br />\nand Middle West too, the<br />\nBusiness Manager in the West<br />\nWilliam B. Kempton<br />\nOne, I noticed, pencil poised in air, ed the dazed man to his feet and<br />\nAssistant Business Manager freedom of the college press is almost<br />\nMelville Locker<br />\nhad completely forgotten what he somewhat inarticulately choked, \"The<br />\nAdvertising Manager<br />\nWm. C. Erlanger ......<br />\nCirculation Manager non-existent. In many ways the facGerald Willen<br />\nwanted to write and was raptly gas- 1 foe! They come! They come!\" In the<br />\nManager<br />\nOffice<br />\nLinkoff<br />\nHoward<br />\nCopy and Filing Manager ulty keeps an iron clasp on the stu- ing out the window. Others had a next instant I found myself hurdling<br />\nNathaniel Soifer<br />\nthe stair-rail, all other ways being<br />\ndent newspaper: it controls the elec- way of turning pages of a book but<br />\n/436<br />\nMember<br />\n1Q17<br />\nblocked, and proceeded to plunge<br />\non<br />\nnot noticing what was printed<br />\napAssociated Colle5iate Press tion of, or in some cases actually . them, although profoundly interested three stories. Somewhat anxiously I<br />\npoints, the student editor of the paper; in the procedure. Uncle Humphrey be- looked up to see whether we were<br />\nDistrtbutors of<br />\nit censors all copy before it appears in gan to fidget; he told met later that being followed, but our pursuers conCollet5ide Diecest<br />\nprint; it limits the subject matter it had reminded him of a tableau, tented themselves with frenzied beating on the rail.<br />\nwhich the editor may discuss; by an and there is nothing he dislikes more<br />\nIRSPSISENTED FOS NATIONAL ADTILRTISING ay<br />\nWe landed in a cart full of waste<br />\nthan<br />\ntableaux.<br />\nNational Advertising Service, Inc. unambiguous understanding it makes<br />\npaper<br />\nprofessor<br />\nconveniently left there by our<br />\nLike an old stager, the<br />\nCOM le Pu&amp;lishers Representative<br />\nthe editor just what attiNEW YORK. N.Y. known to<br />\n42i, MADISON AVE.<br />\nstrode in the room with something of friend the janitor. We got out and<br />\nC.1c400 . Butirrini . SAN FRANCISCO tudes may or may not be espoused.<br />\nourselves off.<br />\nbrushed<br />\na flourish. The fact that he was three carefully<br />\nStATTLt<br />\n^<br />\n--These are the facts of the condi- minutes late didn't seem to disturb \"Now,\" glowed Uncle Humphrey, \"for<br />\nFriday, November 20, 1936<br />\na glass of beer!\"<br />\ntions which face the majority of the him in the least, in fact I doubt<br />\n\"I can't,\" I said, \" I have a one<br />\n1<br />\nhapwas<br />\nwhat<br />\nhe<br />\nrealized<br />\nwhether<br />\n..41 Mortimer,just look at Stuyvesant—the lone wolf of the Union Club.<br />\ncollegiate press. They can hardly be<br />\npening, his mind was undoubtedly o'clock.\"<br />\nprincithe<br />\nwith<br />\nHe hasn'tjoined Me swing to TWENTY GRAND!\"<br />\nsaid to be consistent<br />\nfocused on some dusty town. It took<br />\nples of the Bill of Rights, which above him some moments to adjust himself<br />\nall things guarantees freedom of to the fact that he was about to lec1911110111111MNIMMINIMUMMINMIIMMIMMINME1111111111111111M1111111111101101111k<br />\nThe decision of the Hullabaloo to press and discussion; nor can they be ture, but he soon began to speak and<br />\nCopr. 1936 The A xton•Fielier Tobacco Co., Inc.<br />\nhold a beauty contest should serve as consistent with the ideals of a uni- immediately plunged into his subColumbus, Ohio (ACP)—Suggestdithe<br />\nin<br />\nstep<br />\na<br />\nof<br />\ncertainly<br />\nis<br />\nnot<br />\nwhich<br />\nannouncement<br />\namong<br />\ninteresthis<br />\nversity,<br />\nan<br />\nlecture very<br />\nject. I found<br />\nWE CERTIFY that we have inspecting a moratorium on complicated<br />\nrection of favorable publicity—if the the formularization of all thinking ing and very scholarly until he lost rules and programs regulating the<br />\ned the Turkish and Domestic Tobaccos<br />\ncompetition is handled properly. Bal- in the ruts of tradition.<br />\nthe thread of his story and began to eligibility of college athletes, Dr.<br />\nblended in TWENTY GRAND cigarettes<br />\nThe resolution passed by the INA wander into the metaphysical over Delbert Oberteuffer, non - coaching<br />\ntimore is traditionally known as the<br />\nand find them as fine in smoking qualcity of beautiful women; any history will not solve the problem completely; the exact meaning of a word, how professor of physical education at<br />\nity as those used in cigarettes costing<br />\nbook will report this reputation. We there are too many factors involved. some contemporary had used it and Ohio State university, recommends<br />\nas much as 50% more.<br />\nhave given to the world Betsy Pater- But it is a step in the right direction. as to how it had been used in other the system of governing used by AmPlua local<br />\n(Signed) Seil,Putt&amp; Rushy Inc. Annlytiral Laboraturies<br />\nson, whose affairs with Jerome BonaPerhaps the greatest obstacle to be notable cases.<br />\ntax la<br />\n(In etillaburation with tobacco expert)<br />\nherst College.<br />\ntax<br />\nMatt*<br />\nparte was the subject of a recent film; overcome is the apathy of the students<br />\nUncle Humphrey and I both began<br />\nFIFTIES<br />\nFLAT<br />\nIN<br />\nOBTAINABLE<br />\nALSO<br />\nall<br />\nsuspend<br />\nshould<br />\n\"Perhaps we<br />\nand now Mrs. Wallis Simpson, another themselves. The majority of the col- to get bored and resorted to finger<br />\nrules and stare over,\" he said. \"Let's<br />\nBaltimore Belle, is crashing headlines. leges represented in the INA are lo- tircks and \"ha.ndies.\" Uncle Humphfind out what college games are for<br />\nCloser to home, previous editors of cated in small towns. The atmosphere rey, I found, had an endless supply of<br />\nreally. For 85 years, more or less, we<br />\nthe NEWS-LE-n.12 have always decid- of such places seems to numb stu- \"handles,\" most of which I couldn't<br />\nhave been piling rule upon rule withed the lack of pulchritude in the dents to the greater problems which get. I thought the voice of the prostopping for a careful analysis.<br />\nout<br />\ntake<br />\ncannot<br />\nWe<br />\nsense<br />\nTheir<br />\nTeachers.<br />\nface them and the nation.<br />\nCollege for<br />\nfessor seernitd strangely soothing,<br />\n\"All this time some over-enthusithis stand and urge several of the of awareness and recognition of the when I suddenly realized it had stopcoaches and directors of athastic<br />\nto<br />\nphotos<br />\nfairer sex there to submit<br />\nproblems of social and political im- ped. I looked up and stifled a terrified<br />\nletics have been responding to the victhe competition. After all the Hulla- port which deprive them of their free- scream.<br />\nby going to all<br />\nbaloo should be given at least local dom of expression seems to be sadly<br />\nThe reamy look on the rest of the tory-hungry public<br />\nwinners.<br />\nproduce<br />\nto<br />\nlengths<br />\nthe<br />\nperhaps<br />\nknows,<br />\neducation<br />\nof<br />\nprocess<br />\nWho<br />\na<br />\nneglected. Only<br />\nsupport.<br />\nstudents' faces had vanished. In its<br />\n\"It is suggested that the solution<br />\ncontest pages of this year's annual can wake them up to their danger.<br />\nplace, without exception, was a hidwill consist of more of the Hopkins'<br />\neous carnal leer, and in each one's of this problem lies in an examination<br />\nfamiliar sights.<br />\nhand was a keen glittering knife that of fundamental concepts (of amateurism) and in a return to simplicity<br />\nThe editors of the Hullabaloo ought<br />\nthey use to split hairs.<br />\nto make a wide-spread concerted efAs the annual football classic with<br />\nfort at putting across this project.<br />\nJohn's becomes more and more<br />\nSt.<br />\neightHopkins<br />\nEnlist the aid of the<br />\na note of<br />\neen fraternities. Search out the pos- imminent, we wish to sound<br />\nthe preto<br />\nreference<br />\nin<br />\nadmonition<br />\nMarysibilities of Goucher, Hood,<br />\nreiterate<br />\nto<br />\nEfforts<br />\nfestivities.<br />\ngame<br />\nothers.<br />\nand<br />\nWomen,<br />\nfor<br />\nland College<br />\npast few years<br />\nHave the contest spread by the local the activities of the<br />\nmisdirected.<br />\nentirely<br />\nare<br />\nedition<br />\nan<br />\nsee<br />\nto<br />\nyet<br />\nnewspapers; we've<br />\nThe kidnappings and raids which<br />\nof the Evening Sun where they failed<br />\nso prominently in recent years<br />\nfigured<br />\nlocal<br />\nthe<br />\nto feature a girl's picture on<br />\nvestigial remnants of the<br />\nare<br />\nmerely<br />\npossible.<br />\nwhenever<br />\npage<br />\ncollege life—an<br />\n\"rah-rah\"<br />\nof<br />\nperiod<br />\nYes, there are countless possibilHERE'S THE MENU!<br />\ncertainly never<br />\nwas<br />\nwhich<br />\nelement<br />\na<br />\ninto<br />\ncontest<br />\nthe<br />\nities of converting<br />\nGo back noose for Thanksgiving — turkey just<br />\nstrong at Hopkins. This sudden<br />\ndoesn't taste as good anywhere else! Make it a<br />\nlively, interesting, and beneficial pro- very<br />\ngala week-end but an inexpensive one — do yout<br />\nannual evolving of hysterical enthu,sject. Yet if the proper supervision is<br />\ntraveling by Greyhound bus. A Greyhound trip<br />\niasm by a student body whose lack<br />\nwill<br />\ncompetition<br />\nthe<br />\nemployed,<br />\ncosts only 1 /3 as much as driving your car—much<br />\nnot<br />\nof spirit at other athletic contests<br />\nless than any other means of travel. You can buy<br />\nprove to be a miserable \"flop.\"<br />\nyour ticket to one of the big out-of-town football<br />\nis well night discouraging is indeed<br />\ngames with the money saved making the trip by<br />\nparadoxical.<br />\nGreyhound. Drop in, or phone for full information.<br />\nLet's show spirit and enthusiasm<br />\nWith the courtesy of Mills Artists,<br />\nGREYHOUND BUS TERMINAL<br />\nthis year, but let's confine our ardor<br />\nPhone, PLaza 0520<br />\n217-221 W. Baltimore St.<br />\nThe Johns Hopkins NEWS-LETTER within the restraints of propriety.<br />\nwe give you:<br />\nfreedom—and<br />\nhas complete editorial<br />\nno one thinks it unusual.<br />\nThe NEws-Lerrial does not pay its<br />\neditors with NYA salaries, or scholarships, or cash, or college credit—and<br />\nno one thinks it strange. In fact, it<br />\nFILTER-COOLED<br />\nFor Your<br />\nJ. H. FURST CO.<br />\nis a subject of pride on the campus.<br />\ntoken,<br />\nLiquors<br />\nPrinters of<br />\nThe University, by the same<br />\n7111442X.<br />\nPHILOLOGICAL and<br />\nmakes no bones of the fact that it<br />\nSeeH ARRY<br />\ndoes not pay its football players. It<br />\nSCIENTIFIC PUBLICATIONS<br />\n3113 GREENMOUNT AVE.<br />\ncolleges<br />\nfew<br />\n[stands out as one of the<br />\n12-20 Hopkins Place Baltimore<br />\nSOMETHING WONDERFUL<br />\nPhone UN. 4883<br />\nDelivery<br />\nFor<br />\nGOES ON INSIDE:<br />\ncan still boast of non-commercialized<br /><br />\nLetter<br /><br />\nForward To<br />\nFreedom<br /><br />\nkale<br /><br />\nKIBLER'S<br /><br />\nBeauty And The<br />\nBest<br /><br />\nIntercollegates<br /><br />\nThe<br />\nCotillion<br />\nBoard<br /><br />\nWithin Bounds<br /><br />\nStrange Interlude<br /><br />\nHudson--DeLange<br />\nOrchestra<br /><br />\nMEDICO<br /><br />\nathletics.<br />\nAt the Hopkins, all these things<br />\nare taken for granted. And yet, in<br />\nthe cases of the great majority of the<br />\ncollege newspapers represented at the<br />\nIntercollegiate Newspaper Association convention last week, just the<br />\nopposite is taken for granted.<br />\nFootball players are paid--because<br />\nit's victory that counts, and not how<br />\nthe game is played. Editors are paid<br />\nfor why should a man spend so<br />\nmuch time and work so hard for an<br />\nextra-curricular activity? Who ever<br />\nheard of a man working on a paper<br />\nbecause he enjoys the work? But<br />\nmore Important and fundamental<br />\nthan these is the fact that not more<br />\nthan one out of ten editors can boast<br />\nof total editorial freedom. The sadnatter is that many<br />\ndest part<br />\nknow what edicn't<br />\nin<br />\nr<br />\nof these<br />\n14 a<br /><br />\nVIM I<br />\nSTAMM<br />\nMAPES<br />\nap.mmo•<br /><br />\n11<br />\n1Ad<br />\neituPtg—k-\",<br />\nFINEsT<br />\nBRIAR<br />\nMONEY<br />\nCAN BUY<br />\nUNNEARO OF VALUE<br /><br />\n01<br /><br />\nThis simple appearing yet amazing<br />\nabsorbent filter invention with Cellophane exterior and<br />\nfooling mesh screen<br />\ninter ion keepsjuices<br />\nand Oakes in Filter<br /><br />\nand out of mouth.<br />\nPrevents tongus<br />\nbite,raw mouth,<br />\nwet heel, bad<br />\nodor, frequent<br />\nexpectoration.<br />\nNo breaking<br />\nin.Improves<br />\nthe tasteand<br />\naroma=<br />\ntobacco.<br /><br />\nALSO CIGANETTE AND<br /><br />\nTHE ONLY PATENTED<br />\n\"CELLOPHANE\"- SEALED<br />\n-FILTER—IT REALLY FILTERS<br /><br />\nr----<br /><br />\nPeabody<br />\nPharmacy<br /><br />\nUniversity Barber Shop<br />\nFirst Class Service, 4 Barbers<br />\n3124 Greenmount Avenue<br /><br />\nWe Sell Drugs and Give Service<br /><br />\nALBERT A. CESKY, Prop.<br /><br />\nCALVERT and 30TH STREETS<br /><br />\nThanksgiving Night<br /><br />\n-1211.1.2<br />\n2111=='1<br />\n.<br /><br />\nNORTH<br /><br />\nat the Alcazar<br /><br />\nINN<br /><br />\n3 E. NORTH AVE.<br />\nTHE RENDEZVOUS OF<br />\nCOLLEGE FRIENDS<br /><br />\nfl<br />\nt<br />\n)<br />\nne<br />\nr<br />\niltC<br />\n;<br />\niLgitlPt:eh<br />\nt:<br />\ns<br />\nt:jacr:<br />\no<br />\nen<br />\nle<br />\ngis<br />\nein<br />\nai<br />\nrrs<br />\nrt,<br /><br />\n/151T\"IC42111111<br />\n:<br />\nageeninl<br />\nl<br />\ni li<br /><br />\nIt ext<br /><br />\ne:tsI<br /><br />\nnade<br />\n:b:avhj<br />\nlj<br />\nde<br />\nItit:'<br />\nielnta<br />\ne1<br /><br />\nel ireida<br />\nrt TIIPire°:::Thanv<br />\nb<br />\nwP4Stn)<br />\nriIN .<br />\nalle<br />\notk<br />\nh<br />\nlir<br />\nc<br />\nkiavalin<br />\nkiaintie?g<br />\n,<br />\nea<br />\nr 4I<br />\netiGertid.<br /><br />\ni<br />\nad<br />\nnLaa<br />\nkt<br />\nc<br />\nrni<br />\nit.<br /><br />\niv<br />\ntivC<br /><br />\nThe<br />\nCIa.h<br />\nke,t<br />\nM<br />\nrhi<br />\n!I4Ifeart a<br />\n: twegl<br />\nYco<br />\ntyih<br />\nitilan<br />\ni14<br />\nin<br /><br />\ne<br />\ni<br />\ns<br />\nre<br />\n(<br />\nso<br />\nbhutrh<br />\nee<br />\n1etroh,) if 1a<br />\ni<br />\ndece<br />\nolemAdra<br />\ncedi 4<br />\nttsrt<br /><br />\nnarrist<br /><br />\nWere<br />\nlure<br /><br />\ncame i<br />\nbeen a<br /><br />\nto0 be<br />\nthat .,<br /><br />\nlook<br />\n,introd<br />\nYears<br />\nHay<br />\n4orrn,<br />\n!time,<br /><br />\n,arld A,<br />\n:trayed<br /><br />\n,exPreA<br />\nAnd i<br />\nDerfor<br />\n12, wl<br /><br />\niltorrn;<br />\nThe<br /><br />\nthe<br />\neerne,<br />\nv<br />\n„Eitide<br /><br />\n'<br />\nIt: a(1<br />\n'(al<br />\ngold<br />\nwardidtii11<br /><br />\nOur Prices are Lower Than Ever<br /><br />\n10<br /><br />\nNEW YORK LOAN OFFICE<br /><br />\ntalkie<br /><br />\nto 3<br /><br />\nUnredeemed microscopes, cameras, binoculars, musical<br />\ninstruments, slide rules.<br /><br />\n118 North Liberty Street<br /><br />\nAjun<br /><br />\n:<br /><br />\nScres Again<br /><br />\nCAN'T SMOKE A PIPE?<br />\nTHEN YOU NEVER SMOKED A<br /><br />\nFiAS<br /><br />\nPlaza 3495<br />\n-wow- -was, -IIIIWI.—.ININSIF—W1111.-\"\\11FP\".410<br /><br />\nMan I<br /><br />\nThe<br />\ncity's<br />\nThe<br />\n,eow ,<br /><br />\n.,iXfter<br />\ni Moth(<br />\n; aeeon<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br /><br />\nJerome Davis “Look Before You Sleep\"<br />\nIs New Dormitory Motto<br />\nFalks Tonight<br />\nJoke Played On What Was Thought To Be FreshAd Supper Club Practical<br />\nman; Results In Amusing Consequences; Notes On<br />\nHow To Keep Awake<br />\nYale, Educator Asked To<br />\nLeave New Haven In<br />\nJune<br />\n{AS LIBERAL VIEWS<br />\nKlumni Protest Action; Investigation Being<br />\nConducted<br />\n(Continued from Page 1, Col. 6)<br />\nInto the limelight with himself. In<br />\nhAcit a case it is not the individual's<br />\n)Plilion as a scholar that is at issue;<br />\nI is his public appearance as an<br />\nLgitator. It is this sort of case that<br />\nerits official rebuke, and which if<br />\niIersisted in, makes the offender no<br />\nlonger of use to his University.\"<br />\n!<br />\nNewspaper Attacks<br />\nThis statement was apparently basOn an official address by President<br />\nAzgell in the same issue. The New<br />\nomen Register took up the attack,<br />\nerrning the pronouncement \"a rereshing sign.\" It mentioned Jerome<br />\nDavis by name, and concluded with<br />\n'While those interested in Yale will<br />\nwelcome such a stand by its President and alumni organ, they will find<br />\nIt extremely difficult to condone stateMents by its faculty members urging<br />\nthe destruction of the capitalistic systern which, by its very essence, had<br />\nMade possible endowed educational<br />\ninstitutions.\"<br />\nLetter From President<br />\nThe report includes a letter from<br />\n)resident James R. Angell of Yale<br />\nitniversity to Dean Weigle of the<br />\nI:<br />\n)<br />\nlVinity School, in which he attacks<br />\nDr. Davis for attempting to bring<br />\nSenator Gerald Nye, of the Senate<br />\nMunitions Committee, to Yale as a<br />\nilPeaker and for attempting to arouse<br />\nKildent opinion in favor of Senator<br />\nN3?e's views.<br />\nWithin the report is also included<br />\nPraiseworthy comments of Dr. Davis'<br />\nwork by such leaders as H. R. Niebuhr, John Dewey, Professor Harold<br />\nLaski of the London School of Economics, President Robert Hutchins of<br />\nChicago, and excerpts from an inveatigation of theological seminary<br />\neducation, under the title \"The Education of American Ministers,\" in<br />\nWhich Dr. Davis' course in Christianity and Social Progress was given the<br />\nhighest ranking by the students of<br />\nAny course in the Yale Divinity School.<br />\n......<br /><br />\n1<br /><br />\nMYSTERY!<br /><br />\nIn one of the entries at the dormitory, there is a room in which one<br />\nman, the star in the drama we are<br />\nabout to present, lives. He kept to<br />\nhimself a lot and he was pictured<br />\nby his neighbors, all Freshmen, as<br />\nbeing quiet, well-behaved, orderly, and<br />\nangelic to a point of idiocy. At least<br />\nthat is what the freshmen living in the<br />\nadjoining rooms thought. Well, one<br />\nevening, freshies decided to try to get<br />\na use out of the fellow. He seemed to<br />\nbe a nice sort of companion, and the<br />\nboys felt that they ought to do something calculated to rouse him up a<br />\nbit. Then, they figured, after the apologies were made and the blood cleared<br />\naway, all the men on the floor could<br />\nlive in comparative harmony for the<br />\nduration of the term. In a word, the<br />\nboys were a little irked, and a bit<br />\nself - conscious at their neighbors'<br />\nseeming unwillingness to let loose.<br />\nThey wanted to see, first of all,<br />\nwhether he could \"take it,\" and second<br />\nwhether he was a \"regular fellow\" or<br />\nnot all that the word implies Besides, in their opinion, things in their<br />\nentry had been quiet for several days,<br />\nand it was high time that normalcy be<br />\nrestored.<br />\nSecret Entrance<br />\nTo begin, they managed to secure<br />\nentry to the man's room (by a method<br />\nwhich will not be divulged here, since<br />\nthe author of this article is an \"inhabitant\" of the dorm.) Once there,<br />\nthey \"Frenched\" his bed, turned over<br />\nhis bureau and put the drawers in<br />\nupside down with the effect that when<br />\nthose drawers were opened, their contents would be spread on the floor;<br />\nfinally, they tied strings from the<br />\nhandle of the door-knob to various objects in the room. The expectation<br />\nhere was, of course, that when the unsuspecting victim opened the door,<br />\neverything would be dragged off the<br />\ndesks and bookcase to crash to the<br />\nfloor.<br />\nAccording to his usual custom, they<br />\ncould expect him to come in about<br />\nten-thirty. At twenty minutes after<br />\nten, the freshies were all in the adjoining room awaiting his arrival.<br /><br />\nHedgerow Group<br />\nMake Local Bow<br />\nPresent Two Plays At Auditorium Before Large<br />\nGathering<br /><br />\nAt ten-thirty punctually, he opened<br />\nhis door. Crash! (That's the lamp!\"<br />\nwhispered one of the freshmen, excited.) Bang! (\"That's the waste-paper<br />\nbasket 'filled with canned food that I<br />\nput on the top of the bookcase!\"<br />\nsmirked a second) Then, undignified,<br />\nbut certainly effective, a-hem, expletives, burned a blue streak in the air<br />\nin the next room. Suddenly all was<br />\nquiet, and to the intense disappoint-<br /><br />\nIRCLIN'<br />\nTIIE<br />\nAMPUS<br />\nBy STANLEY FINKEL<br /><br />\nWe ran across this announcement<br />\nwhich one of our acquaintances had<br />\nsent out. Because we wish the party<br />\nconcerned to grow up undisturbed by<br />\nbothersome publicity, we are using<br />\nflcticious names.<br />\nMR. and MRS. RAY PRODUCTION<br />\nHave the honor to sponsor the debut<br />\nof<br />\nThe New Arrival<br />\nIN THE HOWLING SUCCESS<br />\nWeight 7 lbs., 2 oz. of tuneful harmony<br />\nBRIGADIER GENERAL HOSPITAL<br />\nTime: 8.45 A.M., October 26, 1936<br /><br />\nment of the perpetrators of the mild<br /><br />\nFIRST SHOWING<br /><br />\n\"hazing,\" everything was peaceful.<br /><br />\nNovember 15, 1936<br />\n1234 Davenport Road<br /><br />\nThe boys had left a nicely engraved<br />\ncalling card on the desk of the victim,<br />\nwhich identified them both by room,<br />\nand by name, and they were surprised<br />\nat the seeming snub.<br />\nSadly, the boys went to bed and,<br />\nregarding their experiment as a waste<br />\nof time, they discarded any further<br /><br />\n\"A RAY PRODUCTION PERFORMANCE\"<br />\nCAST OF CHARACTERS<br /><br />\nAda Ova<br />\nHappy Mother<br />\nRay<br />\nProud Father<br />\nThe Central Attraction<br />\nAda Ada Ova<br />\nBottle Holders, Pin Dealers, DiaFolders, Etc.<br />\nMUSICAL NUMBERS<br /><br />\nattempts to make the acquaintance of<br /><br />\n\"After the Bawl\"<br />\n\"Walking My Baby\"<br />\n\"Sing My Baby Good-Night\"<br />\nAbout three o'clock in the morning,<br />\n\"Crying Myself to Sleep\"<br />\none of the boys awoke out of a deep<br />\nSpecial by Ray Production<br />\nsleep. Something was in the room,<br />\n\"Lord, You Made the Night Too Long\"<br />\nalien and unnatural. As his eyes beCOME AND SEE FOR YOURSELF<br />\ncame adjusted to the gloom, the felAdmission Free<br />\nlow noticed that their neighbor was<br />\nWHERE'S THE FIRE?<br />\nbending over the bed of his roommate.<br />\n* * * *<br />\nWith a wild yell which called in the<br />\nWe see that Dot Huebner has fintwo other boys from the next room,<br />\nhe leaped upon the intruder and bore ally covered up those things that peohim to the floor. Lights were put on, ple are talking about.<br />\nOf course we are referring to her<br />\nthe captore was secured, and explanlegs and those nice new hose. (The<br />\nations came in order.<br />\nquestion now is, does she roll her<br />\nAttempted Revenge<br />\nThe fellow who had sneaked in was own?)<br />\n* * a •<br />\nfound to have some carefully powdered crackers in his robe, which he<br />\n\" I don't go in for the petty things<br />\nhad expected, no doubt, to put in the in life,\" she said as they only necked.<br />\nbeds of his tormentors to give them<br />\n• * *<br />\na taste of their own medicine. Well,<br />\nIt is rumored that the elder Geblike many a similar instance, the inelein is already trying to discourage<br />\ncident ended with a bull-session, and<br />\nhis young son from the dangerous<br />\npeace was declared.<br />\nMusical Club trip to Atlantic City.<br />\nThis, however, was not the end.<br />\n* a<br />\nThe next day one of the freshies saw<br />\nAlthough this incident happened a<br />\nhis new-found acquaintance in the<br />\ndistance, and nudging his companion, little while ago in Atlantic City, it<br />\nhe asked what the fellow's name was. was just picked up while we were<br />\n\"Oh, that's<br />\n. He's a getting dizzy circlin' the campus.<br />\nA loyal Hopkins student had parkgraduate student doing special research now for the chemistry depart- ed his car and was preparing to enjoy a meal in one of the resort's famed<br />\nment!\"<br />\nThe fellow spoke a little while longer eating places. A young girl came up<br />\non the great ability, etc., of the grad- to him as he was sitting down and<br />\nuate student, when suddenly he not- asked,\"Pardon me, but I was looking<br />\niced that there was no one beside at your %cense plate; aren't you Mirhim. He turned around and was con- iam Hopkin's brother?\"<br />\n* a a •<br />\nfronted with the sight of the student<br />\nwhom he had just been walking with<br />\nHe stood on the bridge,and looked<br />\nholding his head and moaning, \"And down. How dark and deep it looked<br />\nwe thought he was a freshman!\"<br />\nbelow. Should he fly away from it all<br />\nor should he plunge down? You<br />\ncould hear him buzzing with excitement.<br />\nThe bridge was shining brightly;<br />\na golden glow was seen. He poised to<br />\nTo the Editor of the NEWS-LETTER: jump down--then changed his mind.<br />\nAway from the teeth with a bridge<br />\nSir:<br />\nHershner Cross made a statement around it flew the mosquito!<br />\n*<br />\nin assembly which he probably reWho was that student who in visgrets; I sincerely hope he does. He<br />\nsaid something like this — If you iting that big house jumped over the<br />\ncan't behave in two assemblies a fence, and climbed up the wall to the<br />\nmonth, perhaps you would like us to fourth floor to see his beloved. Who<br />\nmake you attend four? This outburst said chivalry was dead?<br />\n(We hope that he wasn't poison ivy<br />\nwas occasioned by some talking and<br />\nconfusion, for which I personally was to her.)<br />\n*<br />\n*<br />\npartly responsible, and for which I<br />\nwish to apologize. I had been monAt the Little Theater this week is<br />\nopolizing Dr. Sachs with questions \"Legong: Dance of the Virgins\" fl'mwhich did not interest the rest and ed in technicolor by the Marquis de<br />\nthe answers to which were not ad- Falaise on the Isle of Bali.<br />\ndressed to the whole assembly.<br />\nThe situation is something like the<br />\nCarlyle Barton business last year. It<br />\nthey must be preserved, by compulis from Dr. Mitchell's comments on<br />\nsion if necessary. How does the Counthat subject, as some will remember,<br />\ncil reconcile this with the fact that<br />\nthat I draw my idea that men say<br />\nthe only important Hopkins tradithings publicly in unguarded moments<br />\ntion is that of freedom and liberty in<br />\nwhich they would not say if they<br />\nall things, including the attendance of<br />\nstopped to think.<br />\nclasses and lectures?<br />\nNevertheless, I believe that there is<br />\nWouldn't it be better to abolish the<br />\nis something significant in what Cross<br />\ncompulsory part and throw the assaid. It shows that the Student Counsemblies open to all the classes, the<br />\ncil regards the compulsory assembgraduate students, and the faculty?<br />\nor<br />\nour<br />\nsins,<br />\nfor<br />\npunishment<br />\nas<br />\na<br />\nlies<br />\nneed to be any sperather as a dose of Pluto water which There would not<br />\nmonth, the speaker<br />\nnumber<br />\nper<br />\ncific<br />\nthroats<br />\nhas to be forced down our<br />\ngiven the week which suited<br />\nfor our owngood. They try to make being<br />\nIf the Council enlisted<br />\nus passive to the first two doses by him the best.<br />\nUniversity administrathreatening us with a third and a the aid of the<br />\nspeakers comparobtaining<br />\nin<br />\ntion<br />\nfourth. This is no attitude for the<br />\nSupper Club and<br />\nthe<br />\nthose<br />\nof<br />\nable<br />\nto<br />\ngoverning<br />\nsupposedly representative<br />\ncareful to get the safe NEWSbody of a democratic group. Person- were<br />\nas other imporally, I would rather attend four as- LETTER pre-publicity<br />\nlectures, it seems to me<br />\nsemblies a month; I enjoy them all. tant campus<br />\nwould receive the support of<br />\nBut compulsion never did anything they<br />\nstudent body. Wouldn't such<br />\nentire<br />\nthe<br />\nfeeling<br />\ntobut create distaste and ill<br />\nplace for common interward somethng which might even be a meeting<br />\nlot<br />\nto revive the dying Hopa<br />\nests<br />\ndo<br />\nenjoyable if one were not compelled<br />\nspirit?<br />\nto do it. (Mr. Duce to the contrary kins<br />\nthe stranger.<br /><br />\nReprinted from Donald Kieey's<br />\nreview of \"Getting Married,\" in<br />\nThe Twelve Schlepkin Brothers—<br />\nthe Baltimore SUN of Nov. 19th.<br />\nark, Monmouth, Bertram, Maurice,<br />\nMaking their first visit to Baltialthorn, Kernan, Isidor, Zermaxi, more in the thirteen years of their<br />\ncheaI, Isaac, Moses, and Patrick— existence, a group of players from<br />\nrive Saturday for a brief visit at Jasper Deeter's Hedgerow Theater<br />\ne Hopkins. A tense air of mystery presented two plays yesterday at the<br />\nhovered over them as they appeared Auditorium, under the sponsorship<br />\non the campus, but their identity was of the Playshop of the Johns Hopkins<br />\nMade known after they were wel- University. More than 500 children<br />\ncorned at the Barn by officials of the attend9d The Emperor's New Clothes.<br />\naarnstormers.<br />\n. . . Twice that number turned out to<br />\nAccording to an authoritative see the company do Getting Married,<br />\nhoUree, the Schlepkins, visiting Balti- a play which, like its author, is remores on an extended tour of the East, markably spry for its years. At the<br />\nWere several years ago important fig- same time it cannot be denied that<br />\nin Hollywood when talkies first Getting Married, a daring and dynamcatne into being. Since then they have ic gesture in 1908 is petrifying into<br />\nbeen a major factor in developing the a museum piece.<br />\ntheatre in Moscow. They are reputed<br />\nUnder cover of the usual veneer of<br />\nto be among the first who declared witty talk, Mr. Shaw in 1908 unburdthat \"the legitimate stage had better ened himself of opinions regarding<br />\nlook to its laurels\" when they helped marriage and divorce which shocked<br />\nI ntroduce talking pictures, several some of the people of that day. His<br />\nYears ago.<br />\nideas no longer have that effect ...<br />\nIstoRaving been informed of the Barn- they have been repeated too often by<br />\nmiler production of Once in a Life- lesser advocates. It is in the manner<br />\ntitne., in which George S. Kaufman of expression that the comedy shows<br />\ne•nd Mow Hart have satirically por- Its age.<br />\ntrayed the Schlepkins, the brothers<br />\nEven so there remain numerous<br />\n.e3tpressed the hope that they might flashes of prime wit. Ever so often,<br />\narid it possible to attend the only Getting Married flares up with a joke,<br />\nPerformance of the play on December an epigram and a shrewd comment on<br />\n12, When it will be presented at the modern life. . . It is of great value to<br />\nAuditorium Theatre, by the Barn- the historian and one must not foretorrnera.<br />\nget that precious few plays of 1908<br />\nThe plot of Once in a Lifetime, with would stand the test of revival.<br />\nIts time of action back in the days of<br />\nIn making their Baltimore debut<br />\nthe advent of sound pictures, is con- with a play so far back in Shaw's<br />\ncerned with three members of a chronology, the Hedgerow people per'vaudeville act—George Lewis (Ed- haps placed themselves under a disward Bauernschrnidt), May Daniels advantage. However, Mr. Deeter'S<br />\n(Elizabeth Ullman), and Jerry Hyactors ... are performing for (Shaw)<br />\nland (Jerry Branower), who join the the same service the D'Oyly Carte<br />\ngold rush to Hollywood when the Opera Company is performing for<br />\ntalkie rage starts. At the time Her- Gilbert and Sullivan. That is, they adIrian Glogauer (Stanley Prager) and here as closely as they can to tradiThe Schlepkin Brothers are the film<br />\ntion . . . In some departments the<br />\ncity's big men.<br />\ncompany is weak.. . and, in view of<br />\nThe Schlepkins will return to Mos- the work the group has done in keep(*IN some time in the near future ing alive many classic much may be<br />\nafter spending some time With their forgiven them. It is hoped they will notwithstanding.)<br />\nLet's have some other expressions<br />\nmother in upstate New York, that is, visit Baltimore again on their next<br />\nopinion about this.<br />\nof<br />\nthe<br />\nassemblies<br />\nare<br />\nIt is argued that<br />\nacTording to an authoritative source. 1<br />\n--J. E. Thomas, Jr.<br />\nand<br />\ntradition,<br />\nour<br />\nof<br />\nremnant<br />\nonly<br />\ntour.<br /><br />\nLETTERS TO<br />\nTHE EDITOR<br /><br />\nIntercollegiate Newspaper<br />\nConvention Condemns Faculty<br />\nCensorship Of College Papers<br />\n(Continued from Page 1, Col. 1)<br />\nof the Middle Atlantic States;<br />\nThat, following this letter, each<br /><br />\nlution. In reply to this, Mr. Bicknell<br />\nsaid: \"Such an amendment would<br />\ndestroy the value of the entire reso-<br /><br />\nindividual paper represented here<br /><br />\nlution.<br /><br />\nsend an individual notification of<br /><br />\n\"The purpose of the resolution is to<br />\nhave the INA act as a unit and set up<br />\nstandards for its members. Further-<br /><br />\ncondemnation an resentment to<br />\nthe college involved,<br />\nThat duplicates of all these letters be sent to the President of<br />\nthe Intercollegiate Newspaper<br />\nAssociation who shall combine<br />\nthem in leaflet form for distribution among all member papers<br />\nand the metropolitan press.<br />\nResolution Presented<br /><br />\nmore many editors would not be in a<br />\nposition to ask for an investigation,<br />\nfor fear of faculty interference.\"<br />\nCalls For Vote<br />\nAfter great opposition, David Hepford, President of the I.N.A., and Editor of the Diekinsonian, called for a<br />\nvote on this amendment. In a roll call<br /><br />\nWilliam Diamond, Editor of the vote, each member<br />\npaper being alNEWS-LETTER, presented the resolu- lowed<br />\ntwo votes, the motion was de-<br /><br />\ntion at the Saturday Morning busi- feated by an 18 to 20 vote.<br />\nness session. Considerable discussion<br /><br />\nThe Resolution was then voted<br />\ntook place, centering about the para- upon and passed by a 17 to 21<br />\nvote.<br />\ngraph dealing with what constituted<br />\nThe Editorial Sessions of the con-<br /><br />\nviolations of the Bill of Rights. Sever- vention were address by John<br />\nAllen,<br />\nal of the faculty advisors present at- Editor of the Linotype News, who<br />\ndistacked the resolution, on the grounds<br />\ncussed the current changes in newsthat the college students are not mature and capable enough to determine paper makeup, and went over the intheir own editorials and select their dividual college papers and gave critown editors. Diamond, replying to icisms in regard to their makeup.<br />\nthe objection, said \"The resolution is Following his address, Mr. Milnor<br />\nbased on the assumption that the<br />\nDorey, of the New York Times dispurpose of a college is to teach how to<br />\ncussed<br />\nthe subject matter of a colthink, not what to think. Since the<br />\npaper is published by undergradu- lege newspaper, and asked college<br />\nates, it should be their thinking and editors to take cognizance of the current national and international probtheir opinions.\"<br />\nAt the evening session, Arnold lems. He asked the editors not to conBicknell, Editor of the Polytechnic fine their editorial work to the narrow<br />\nReporter, presented the resolution limits of the campus, but to discuss<br />\nwith a few minor changes in phrase- the world affairs in light of the stuology. Discussion again took hold and dents' viewpoint.<br />\nDr. Swain Speaks<br />\ncontinued for over an hour. Mr. Dale<br />\nAt the closing banquet, Dr. James<br />\nHartzler Gramley, faculty advisor of<br />\nthe Lehigh Brown and White objected Edgar Swain, Professor of History at<br />\nto the resolution, saying \"This reso- Mylenberg College, spoke on the \"Diplution is based on the presumptions lomatic Conditions In Europe.\"<br />\nAfter his address, the following<br />\nthat the student is always right, and<br />\nthat the faculty is always wrong.\"' prizes were awarded to member<br />\nSeveral members immediately rose to papers:<br />\nAdvertising—First Prize, Lehigh<br />\ntheir feet and demanded the floor.<br />\nBrown and White; Second Prize,<br />\nThe essence of all of their comments<br />\nTemple News; Third Prize, Fiat<br />\nwas that the student should have the<br />\nLux of Alfred College.<br />\nright to his own opinion and the<br />\nNews—First Prize, Temple News;<br />\nmethod of formulating it.<br />\nSecond Prize, George Washington<br />\nAmendment Sought<br />\nHatchet; Third Prize, Lehigh<br />\nThe editor of the Lehigh Brown and<br />\nBrown and White.<br />\nWhite, presented an amendment to<br />\nEditorial Policy — First Prize,<br />\nthe resolution, stating that the editor<br />\nGeorge Washington Hatchet; Secof the college paper should decide<br />\nond Prize, Lehigh Brown and<br />\nwhether or not their relation to their<br />\nWhite; Third Prize, Dulsinson,<br />\ncollege should be investigated by the<br />\nDickinsonian.<br />\ncommittee provided for in the reso-<br /><br />\nTWO OPEN LETTERS<br />\nTo The Student Body<br />\n(Continued from Page 1, Col. 3)<br />\ntinue this system: there must be a<br />\ngreater feeling of cooperation and a<br />\ndemonstration of more gentlemanly<br />\nconduct on the part of certain members of the Freshman and Sophomore<br />\nClasses.<br />\nThe Student Council welcomes and<br />\nappreciates any constructive criticism addressed to it at any time.<br />\n—The Student Council<br /><br />\nTo The Student Council<br />\n(Continued from Page 1, Col. 4)<br />\nwhich can certainly be entertaining<br />\nand developmental.<br />\nIf we may be permitted the cliche<br />\nused by a correspondent in today's<br />\nOpen Forum, the root of all assembly<br />\nevil lies in your policy of leading a<br />\nhorse to water and making him drink.<br />\nOne wonders how consistent you are<br />\nwith the idea of the liberal college<br /><br />\nSpiked Shoe Sponsors<br />\nFifth Annual Contest<br />\nThe Fifth Annual Interscholastic<br />\nCross Country Race sponsored by the<br />\nJohns Hopkins Chapter of the National Collegiate Society of Spiked<br />\nShoe will be held on the course at<br />\nHomewood on Saturday, November<br />\n21, at 12.00 noon.<br />\nThe main prize for the race, which<br />\nwill be two and one-half miles in<br />\nlength, is a team trophy to the<br />\nschool scoring the lowest number of<br />\npoints, with five nien out of a seven<br />\nman team counting in the scoring.<br />\nThe first etght men to finish will receive medals, as will also the five<br />\nscorers on the winning team.<br />\nThe Sponsor of this annual event<br />\nhas as its officers Pete Hughes,<br />\npresident; Ted Graziano, vice-president; Paul Castelle, secretary, and<br />\nTony DiPaula, treasurer.<br /><br />\nwhich shuns at enforcing anything,<br />\nan dassemblies least of all, and how<br />\nconsistent with the traditions of the<br />\nHopkins which places even classes<br />\nand lectures on a voluntary basis, One<br />\nwonders why you worry about the un-<br /><br />\ngentlemanly conduct of a few unfortunates who have been caught in the<br />\nmeshes of your system, while the<br />\ngreat majority of students awaits<br />\nimpatiently your \"interesting and instructive speakers.\" One wonders by<br />\nwhat reason and logic your threatened<br />\nfour assemblies per month will succeed as an alternative to the present<br />\nunsuccessful plan. The description of<br />\nthe attitude of the Council, as given<br />\nby Mr. Thomas on this page, is probably more truth than fiction.<br />\nThe Student Council asks for suggestions. The following challenge is,<br />\nthen, not out of order. Allow the<br />\nNEWS-LETTER, through its editor, to<br />\nselect all speakers and to sponsor all<br />\nassemblies for two successive months;<br />\nHavens To Read Poetry allow these assemblies to be on a voluntary basis. Watch the attendance.<br />\nHopefully,<br />\nprofesHavens,<br />\nDr. Raymond D.<br />\nThe Johns Hopkins NEWS-LETTER<br />\nsor of English Literature at the Hopkins, will read from the works of<br />\nWilliam Wordsworth this afternoon<br />\nSoph Elections<br />\nat 4 in the Edgar Allen Poe Room of<br />\nThe following were elected to offices<br />\nthe Enoch Pratt Free Library.<br />\nDr. Havens has selected to read in the Sophomore Class last Friday:<br />\nsome of the favorites of his students Robert Ward, incumbent president;<br />\nwhich include Michael, The Solitary Earl Cross, vice-president; Jack WetsReaper and a few less known selec- ler, secretary; and William Banda,<br />\nsergeant-at-arms.<br />\ntion as The Prelude.<br /><br />\nHOMEWOOD, BALTIMORE, NOVEMBER 20, 1936<br /><br />\n4<br /><br />\nDelta Upsilon,<br />\n0.K.O.AreTied<br />\nFor First Place<br />\nTeams Battle To Scoreless<br />\nTie — Playoff For Title<br />\nLikely<br />\nK. A. ELIMINATED<br />\nKappa Sigs Win 2—S.P.E.<br />\nTo Face Pi Lams<br />\nTuesday<br />\nPlay in division B was climaxed<br />\nTuesday when Omicron Kappa Omicron met Delta Upsilon. With both<br />\nteams possessing a clean slate and<br />\ntied for first place, this game was<br />\nexpected to decide the winner of the<br />\ndivision. However, after the smoke of<br />\nbattle had cleared, neither team had<br />\nbeen able to score. This scoreless tie<br />\nonly helped to make the league more interesting. Unless an upset occurs,<br />\nD.U. and O.K.O. must meet in a playoff to decide the victor. D.U. has only<br />\nthe lowly Phi Alpha to combat while<br />\nO.K.O. will meet Phi Sigma Delta.<br />\nNeither Phi Alpha nor Phi Sig is<br />\nexrected to offer much competition<br />\nto the leaders.<br />\nAn upset by Kappa Sigma eliminated the other contestant, Kappa<br />\nAlpha. K.A. dropped a 18-0 decision<br />\nto the Kappa Sigs. In this game the<br />\nvictorious frat showed better form<br />\nthan in previous encounters. The entire team functioned well, and two<br />\ntouchdowns by Almquist and one by<br />\nMcGovern gave K.S. its second victory. This win placed Kappa Sigma in<br />\na tie for fifth along with a forfeit win<br />\nover Phi Sigma Delta.<br />\nD.U. Wins Easily<br />\nIn games played the first part of<br />\nthe week. Delta Upsilon,0K.O., Kappa Alpha, and Kappa Sigma netted<br />\nwins. D.U. crushed Phi Sigma Delta<br />\n36-0. Every starting player of D.U.<br />\ntallied, and with Murphy's score a<br />\ntotal of 36 markers were registered.<br />\nPhi Sig fought hard, but the superior<br />\npassing and running attack of the<br />\nvictors was too much. Although receiving unexpected opposition, O.K.O.<br />\nscored over Phi Epsilon Pi. Soifer<br />\nfor<br />\nand Seder marked up 12 points<br />\nLloyd,<br />\nstar,<br />\n0.K.O.'s<br />\nthe Phi Eps, but<br />\nretaliated with three touchdowns. This<br />\nenabled O.K.O. to gain an 18-12 tri-<br /><br />\nInterfrat Bowling Franklin And Marshall Harriers<br />\n1urn Back Jay Distancemen<br />\nTourney Under Way<br /><br />\n,<br />\n••<br />\nQuintet<br />\nIndia<br />\nSportlight<br />\nIntensive Drill<br /><br />\nCarl, more appropriately named the<br />\n\"Paavo Nurmi of Hopkins,\" hails from<br /><br />\nThe Interfraternity Board held its<br />\nThe Franklin and Marshall harriers -lot showing the closeness of the<br />\nSilver Springs, Md.... Entered Hopfirst bowling tourney Wednesday, No- handed the Blue Jays their fourth meet, was,<br />\nFranklin and Marshall, 23<br />\nkins as Engineer in '32 after secondvember 11, at 9.30 at the Boulevard consecutive defeat last Saturday. The —Hopkins, 33.<br />\nary schooling at Western High, D.C.<br />\nBowling Alleys. The league is under Lancaster boys, by no means, gained<br />\nThe Hopkins' J.V. team lost to St.<br />\nEstablished name on scholastic<br />\nthe chairmanship of John Ghingher an easy victory. The race was a close Joseph on<br />\nFriday. McCaulvin crossed cinderpath ... Ran \"varsity\" half and<br />\nand the fraternities on the Interfra- one, and was claimed to be the fastest the line first, and<br />\nLewis was the near- mile for 4 years, also played a bit<br />\nternity Board are the participants.<br />\nrun by Hopkins this season. Frey and est Blue Jay man behind him. The of football; participated in almost<br />\nThe Delta Upsilons led with the Howard, both of F. and M. tied for score, smilar to that<br />\nof the F. and M. every outside activity in high school<br />\n. . At Homewood immediately took to<br />\nhighest total when they beat the Phi lrst place. Frey was Middle Atlantic meet, was St. Joseph-21,<br />\nHopkins-34.<br />\nhis first love—the track . . . Earned<br />\nGams 901 to 869. The Alpha Delta champ last year. Capt. Sholtes finThanksgiving morning, the varsity \"H\"<br />\nfirst two years running half and<br />\nPhi Club nosed out the Delta Phi ag- ished right behind them followed by<br />\ntravels to Washington, D.C. to com- mile . . . Now captains cross country<br />\ngregation 873 to 867. Hahn„ having Jennings of F. and M., and fifth and<br />\npete in the National Capital Champ- team after running varsity for 3<br />\nthe highest individual score, rolled sixth places were taken by Brown and ionship. Two trophies are awarded, years . . . Most thrilling race: Hopup 118 points in the second game of Driscoll of the Mack and Blue. Up one to the winner of the division of kins-Virginia 4 mile cross - country<br />\nhis meet to gain a 891 to 875 win for until the last half mile, a Hopkins out of town clubs, and the other to the meet in his Sophomore year when our<br />\nAlpha Chi Rho over Kappa Alpha. The group consisting of Sholtes, Brown, winner of the college division. This own \"Paavo\" beat out his team mate<br />\nannual event was started three years Holtzman in a 100 yard finish by 2<br />\nmost interesting match of the eve- Driscoll, and Warminski held third,<br />\nago, and Hopkins captured the award inches to win the race and meet for<br />\nning was the one in which Sigma Phi fourth, fifth and sixth positions. The each year for its division.<br />\nI the black and blue.<br />\nsllon played a third game to come<br />\ngroup was broken up by Jennings and<br />\nout victors over Kappa Sigma after<br />\nMetschowitz. The remainder of the<br />\ntyng the first two games. Particularly<br />\nplacing was, Lyman-10, Hahn (F.M )D.U. has shown great potentialities.<br />\n11, and Lewis-12. This was the first<br />\nvarsity meet for Lewis, and his running was commendable. The score,<br /><br />\nFinalFratSchedule<br />\nDivision A.<br />\nWon Lost Tied<br />\n5<br />\n0<br />\n0<br />\nPi Lambda Pi<br />\nSigma Phi Epsilon 5<br />\n0<br />\n0<br />\n1<br />\n0<br />\n4<br />\nPhi Psi<br />\nDelta Phi<br />\n1<br />\n3<br />\n1<br />\nTau Alpha Phi<br />\n1<br />\n3<br />\n1<br />\nAlpha Epsilon Phi 1<br />\n4<br />\n0<br />\nTau Alpha Omega 0<br />\n3<br />\n2<br />\nBeta Theta Pi<br />\n0<br />\n3<br />\n2<br />\nWorn Lost Tied<br />\nDivision B<br />\nDelta Upsilon<br />\n5<br />\n0<br />\n1<br />\nOmicron Kappa<br />\n4<br />\n0<br />\n1<br />\nOmicron<br />\n3<br />\n2<br />\n0<br />\nKappa Alpha<br />\n3<br />\n0<br />\nAlpha Delta Phi 3<br />\nPhi Sigma Delta 2<br />\n3<br />\n0<br />\n2<br />\n3<br />\n0<br />\nKappa Sigma<br />\n1<br />\n4<br />\n0<br />\nPhi Epsilon Pi<br />\n0<br />\nPhi Alpha<br />\n0<br />\n5<br /><br />\nIIIPPOD<br /><br />\n0<br /><br />\nT ro<br />\nf'fit<br /><br />\nWEEK BEG.<br />\nFRIDAY NOV.20<br /><br />\n'!rON<br /><br />\n4<br />\nOLID STAGE ;<br />\n/<br />\nPA9/1.<br /><br />\nTED,'<br />\nTED LEWIS BAND<br />\nRVUE<br /><br />\n25E<br /><br />\nINE flavor is only<br />\nhalf the story ...<br />\nthere is,in National<br />\nBeer, the deep<br />\ndown wholesomeness of extra costly<br />\ningredients. ....<br /><br />\nF<br /><br />\n; VOL<br />\nAfter several weeks of b1-weil<br />\nbasketball practices, the court esi<br />\nis now ready for intensive drills WI<br />\nwill begin today at 4 P.M. at the<br />\nand continue until the first game<br />\nAmerican U. on December 11. Al<br />\nlast year's varsity squad men,<br />\nthe exception of Traggis who is I<br />\noccupied with football, have now tt<br /><br />\nFamous words of famous college men visiting our store<br />\nfor the first time . . .<br /><br />\n°nil/ $35 14 Frie<br />\nMai<br />\n—Yes, only $35 . . . You will<br />\nunderstand their surprise<br />\nwhen you see the kind of<br />\nclothes we're offering at this<br />\nWi<br />\ngenuinely low price. Expert skillf<br />\ntailoring, distinguished fat,F.lddi(<br />\nries and styles that are outstanding but not freakish. ities<br />\nheigh<br /><br />\nJos. Schloss<br />\nand Son<br /><br />\n'NATIONAL<br /><br />\n5 East Lexington S.<br />\nThe Natio ' Brewing CO.<br />\nBALTIMORE, MD.<br /><br />\nCot<br /><br />\n\"WhaCM<br /><br />\nA BIG FEATURE FILM<br />\nSalim/Er ONLY DOWNTOWN<br />\n&amp;hue STAGE SHOW *<br /><br />\nAl<br /><br />\ned out and high hopes are held<br />\na successful season.<br /><br />\nWhorl<br />\nas its<br />\nof tl<br />\nmusic<br /><br />\nDel<br />\nthe ii<br />\nWh<br /><br />\n(Nowhere else)<br /><br />\nN. 3-11<br /><br />\nevent<br /><br />\nsocial<br />\ndevot<br />\nthe<br /><br />\nwhich<br />\nefit<br />\nWill<br /><br />\norchet<br />\nbe th<br />\nbut<br /><br />\nThe<br />\non a<br /><br />\nrathei<br /><br />\n.579444e<br /><br />\numph.<br />\nKappa Sigma broke in the win column by registering a 32-12 victory<br />\nover Phi Alpha. Bull was the individual star by making four touchdowns.<br />\nAlmquist added another and Clautice<br />\nPhi<br />\na safety for the Kappa Sigs.<br />\nGanz<br />\nby<br />\nmade<br />\nwere<br />\nAlpha a scores<br />\nand Lachman.<br />\nThe game between Pi Lambda Phi<br />\nto<br />\nand Phi Psi, yesterday, helped<br />\ndetermine the winner of division A,<br />\nbut nothing will be definitely settled until the last series of games<br />\nbe<br />\non Tuesday. The vital contest wi'l<br />\nEpPhi<br />\n-Sigma<br />\nPhi<br />\nLambda<br />\nthe Pi<br />\nsilon clash. A win by S.P.E. will give<br />\nthat frat the title, and a win by the<br />\nPi Lambs will also strengthen their<br />\nchances. The winners of both divisions will meet to (etc rmine the chain-<br /><br />\nprovi!,<br />\nt:<br /><br />\nin<br /><br />\nWhich<br />\n—rhy<br />\ntry<br />\n'Eigh<br /><br />\nA ty]<br />\ntion I,<br /><br />\nYou know that a cigarette<br />\ncan be mild; that is, when you smoke it<br />\nit's not harsh or irritating.<br />\nYou know that a cigarette can<br />\nhave a pleasing taste and aroma.<br />\nWhen you smoke a cigarette and find<br />\nthat it has the right combination of mildness, good taste, and aroma, it just seems<br />\nto satisfy you ...gives you what you want.<br /><br />\npionahip outfit.<br /><br />\nFraternity Schedule<br />\nThursday, Nov. 19—<br />\nPi Lambda versus Phi Psi<br />\nBeta Theta Pi versus Sigma Phi<br /><br />\nI smoke Chesterfield all<br />\nthe time, and they give<br />\nme no end of pleasure.<br /><br />\nEpsilon<br />\nFriday, Nov. 20—<br />\nTau Alpha Phi versus Delta Phi<br />\nTau Alpha Omega versus Alpha<br />\nEpsilon Pi<br />\nTuesday, Nov. 24—<br />\nP1 Lambda Phi versus Sigma<br />\nPhi Epsilon<br />\nPhi Psi versus Delta Phi<br />\nBeta Theta Pi versus Alpha Ep-<br /><br />\nGrind<br />\nMi<br /><br />\natraig<br /><br />\nKind,'<br />\nis On<br />\nsued<br />\nlyric's<br />\nson.<br /><br />\ni een b<br />\nmor h<br />\nI Prom<br /><br />\ntheir<br />\nrepiac<br />\nI elated<br /><br />\nbeLar<br /><br />\nThe<br />\nbe led<br /><br />\nI sor of<br />\nPresid<br /><br />\nHeywi<br /><br />\nbe Gu<br /><br />\nPat]<br />\nthe p<br /><br />\nthe (<br />\nBerry,<br />\nDr. al<br /><br />\nsilon Pi<br />\nTau Alpha Phi versus Tau Alpha<br />\nOmega<br />\nPhi Sigma Delta versus Omicron<br />\nKappa Omicron<br />\nAlpha Delta Phi versus Kappa<br /><br />\nJames<br />\nS. An<br /><br />\nCal<br />\nTo<br /><br />\nSigma<br />\nDelta Upsilon versus Phi Alpha<br />\nKappa Alpha versus Phi Epsilon<br /><br />\nMfrs.<br /><br />\nCharles Lander, Prop.<br />\nHair Cutting 40c<br /><br />\nBOULEVARD BARBER SHOP<br /><br />\nAtm<br />\n( rdina<br />\nteat Ft<br />\nbe cor<br />\nObject<br />\nMany<br />\nthesis.<br /><br />\nOn 33rd Street<br />\nBetween St. Paul And Calvert Streets<br />\nSaturday<br />\nWeek Days<br />\n$ A.M. To 7.30 P:Mi 8 A.M. To 9 P.M.<br /><br />\nBirely's Pharmacy<br /><br />\nThe<br />\nWinne'<br /><br />\nST. PAUL AT 33RD STREET<br />\nPrescriptionl—School Supplies<br />\nSandwiches<br />\nUnexcelled Fountain Service<br /><br />\neafter<br /><br />\ni,...4y.pr4.1opAcccp<br /><br />"}], "field_media_file": [{"target_id": 39054, "display": null, "description": null, "target_type": "file", "target_uuid": "535e5c01-03c6-4e32-9fbe-f6998acb7b55", "url": "http://digital.library.jhu.edu/system/files/2022-03/12730-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12730, "target_type": "node", "target_uuid": "3d8ee9b5-389f-42e0-9ffd-93984b19218e", "url": "/node/12730"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "348b76a0-2be9-4004-a3f0-5045682d597e"}]}