{"mid": [{"value": 35640}], "uuid": [{"value": "e188cf7d-4d50-4717-8815-2574bfd53597"}], "vid": [{"value": 35640}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12184-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "\fiV!<br />\n<br />\nJOHNS HOPKINS UNIVERSITY.<br />\n<br />\n1i<br />\n<br />\ntiir_51k;Ny,<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nBALTIMORE, MD•<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $5 per volume.<br />\nI I. American Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXVI<br />\nin progress. $5 per volume.<br />\nITT. American Journal of Philology.<br />\nIL L. (ITLDERFALREVE, Editor. Quarterly. 8vo.<br />\nVolume XXII in progress. $1 per volume.<br />\nIV. Studies from the Biological Laboratory. 8vo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies In Historical and Political Science.<br />\nH. B. ADAMS, Editor. Monthly. live. Series X 1 X<br />\nIn progress. $3 per volume.<br />\nVI. Johns Hopkins University Circular&<br />\nContaining reports of s lentific and literary work<br />\nIn progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. El per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie,etc.)<br />\nVol. TV in progress.<br />\nX. Memoirs from the Biological Laboratory,<br />\nW. K. BROOKS, Editor. Volume IV complete. 87.50<br />\nper volume.<br />\nXT. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.60 per volume.<br />\nof Experimental Medicine.<br />\nJournal<br />\nXII.<br />\nW. Fr. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of insanity.<br />\nHENRY M. HURD,Editor. Quarterly. 4 to. 45 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric ElecL. A. BAUER, Editor. Quarterly.<br />\ntricity.<br />\n8vo. Volume VI in progress. $2.50 per volume.<br />\nxvI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academia year.<br />\nI.<br />\n<br />\nTwentieSixth Year.<br />\n<br />\nBeginnIne October 1st, 1901.<br />\n<br />\n.<br />\n.<br />\nPresident,<br />\nDean of the Medical School,<br />\n.<br />\n.<br />\nDean of the College.<br />\n<br />\nIRA RE MS EN.<br />\nWM.H. HOWELL.<br />\nE DW. H. GRIFFIN.<br />\n<br />\nINSTRUCTIO<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\nC) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\n100,000 volumes.<br />\n185,000 volumes.<br />\n200.000 volumes.<br />\n<br />\n.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPhu rmacology,<br />\nPhysiological Chemistry,<br />\nclinical Medicine,<br />\n<br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clan*.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRemit nee,<br />\nEnglish,<br />\nH istory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. M. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br />\n<br />\nUndergraduates Courses (leading B. A.)<br />\nGroups.<br />\n1.<br />\n2.<br />\n8.<br />\n4.<br />\n5.<br />\ntS.<br />\n7.<br />\n<br />\nClassical (the \"Old College Course.\")<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\nChemical-Itiological.<br />\n(leading up to Medicine.)<br />\nGeological-Biological.<br />\nLatin Mathematical.<br />\nHistorical-Political.<br />\n(leading up to Law.)<br />\nModern Languages.<br />\n<br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics(vol. XXIV.)<br />\nRemsen.<br />\nIra<br />\nXXVI).<br />\n(vol.<br />\nChemistry<br />\nBasil L. Gildersleeve.<br />\nPhilologp (vol. XXII.)<br />\nHerbert B. Adams.<br />\nHistory (vol. XIX.)<br />\nModern Languages(vol. XV L) A. Marshall Mott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAssyriology (vol. IV.)<br />\nIV. H. Welch.<br />\nVI.)<br />\n(vol.<br />\nMedicine<br />\nExperimental<br />\n11=1101011<br />\n<br />\nProgrammes of the Cours,s offered to graduate students in Philosophy and the Arts, and in the School of<br />\nMedicine, and ulso of the Undergraduate or Collegiate<br />\nCourses, will he sent on application to the Registrar.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\n\"The Critical 'Edition of the Hebrew Text of the Old<br />\nTestament.\" Edited by Prof. Paul Haupt. Prospectus on application.<br />\n\"‘Rowland's Photograph of the Normal Solar Spectrum.\"<br />\n10 plates. $20.00<br />\n\"Description of the Johns Hopkins Hospital.\" J. S. Billings, Editor. 110 pp. 4to. 60 plates. $7.50 cloth.<br />\n\"The Teaching of the Apostles. Complete fac-simile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\n\"Reproduction in Phototype of Syriac MS with Antilegomena Epistles.\" Edited by I. H. Hall. $8.00.<br />\n\"Bibliographia Hopkinsiensis.\" Part T. Philology. Parts<br />\nII-IIL Chemistry, Minerology and Geology. Parts<br />\nIV-V-V 1 Physics, Astronomy and Mathematics.<br />\n•<br />\n8 vo. 8t,ornts per part.<br />\na lull list ot publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmag be sent to Johns flopkins Press. Baltimore, Md.<br />\n<br />\n4<br />\nI<br />\n'<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nOCTOBER 12, 1901.<br />\n<br />\n•<br />\n<br />\nNo, 1.<br />\n<br />\nHOPKINS MEN AT NORTHFIELD.<br />\nARUN has a place been more favored with natural beauty than Northfield,<br />\nthe fairyland of broad green meadows and woodlands, sweet with the<br />\nsinging of birds or hushed with the stillness of summer noontide ; of<br />\nmountains, forest crowned, now blue, now purple, now golden crested, now<br />\nmantled with low hanging clouds ; of a quiet out-flowing river reflecting the<br />\nSplendid flush of the sunset, the exquisite tints of twilight, or the stars of the<br />\nstill night.<br />\nHere on the east bank of the Connecticut near the northern boundary of<br />\nMassachusetts, on the lower slopes of Notch Mountain stand the Cathedral<br />\nPines Through the aisles of this dim grove we walk with reverent mind.<br />\nStately pines all about us seem to pierce the sky. Beneath our feet the fragrant, slippery needles make us fearful of mishap. For ten remembered days<br />\nten loyal sons of Hopkins dwelt amid this \"solitude of pines with soft brown<br />\nSilences carpeted.\"<br />\n<br />\n(1.3'<br />\n<br />\n\"Yet not for all this beauty would I seek<br />\nThis lovely vale, but for more glorious things;<br />\nThere shines the sun that shall go down no more;<br />\nThere flows the fountain that shall water earth;<br />\nThere bursts the glory that shall never pale ;<br />\nThere springs the life with which death strives in vain;<br />\nThere are the golden chains prepared and forged<br />\nWhich knit our earth to heaven; there also stands<br />\nThe more than golden ladder which connects<br />\nThose lower chambers with the upper halls.\"<br />\n<br />\nAttractive as is the natural beauty of the place, the motive of the seven<br />\nhundred college men who gathered there this summer, not only in the camp but<br />\nin the less attractive dormitories of the Seminary, was rather the hope of spiritual awakening, to which the very beauty of the place itself conduces.<br />\nAt this Sixteenth Annual Conference, twenty-nine different nationalities<br />\nwere represented, and one hundred and forty-nine institutions of learning.<br />\nYale as usual led in attendance (120), with Princeton second. Hopkins was<br />\none of twelve colleges having nine or more delegates presentThe spiritual impressions were made at platform meetings, in the morning<br />\nand at night on each day by thirty-eight speakers of renown. The first few<br />\ndais were especially marked by the addresses of Mr. Morgan, as were the clos-<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ning days by those of Mr. Robert Speer. To conserve and deepen these impressions, Bible classes, a Missionary Institute, and other departments were led by<br />\ncompetent men, among whom were Profs Bosworth and King of Oberlin, and<br />\nSanders of Yale. As there were present twenty-eight foreign delegates, the<br />\nmissionary interest was very strong, and Hopkins should rejoice to know that<br />\ntwo of her ten men volunteered for the foreign field while there.<br />\nAwakened amid the twitter of the early birds by the pulling of your cot<br />\nfrom beneath your weary bones, you bathe your sleepy eyes in mountain dew<br />\nstolen from your neighbor's pail, and are hardly through with your lavations<br />\nbefore the clang of a high-sounding cymbal calls you to the morning \"hashhouse\" meal (if it be not some mischievous chap abusing his wash-basin.)<br />\nAbout you at the table are many men of many minds from many colleges, in<br />\nmany stages of attire, calling lustily for the \"pump\" or the \"cow'S—as their<br />\ntaste or rather thirst may dictate.<br />\nA missionary institute at eight, or a Bible class at nine, calls you across<br />\nfields<br />\ntenanted with bleating sheep to the group of Seminary buildings not<br />\nthe<br />\nfar away. At ten in the large Auditorium you hear such addresses by the very<br />\nforemost religious thinkers as are seldom offered elsewhere. Back to camp for<br />\ndinner, you have the afternoon for personal talks with the leading men of the<br />\nconference, or for sport. If the latter, perhaps today it is a plunge into the<br />\ncool waters of the nearby Connecticut just as Nature made you, tomorrow a<br />\ntramp through the three adjoining states of Vermont, New Hampshire and<br />\nMassachusetts, or perhaps a long drive, with the rest of your delegation, amid<br />\nthe beautiful hills with which the region abounds, and from which vistas of<br />\nnatural beauty present pictures that still linger in your mind. Yet within<br />\nthe Seminary grounds are found abundant opportunities for athletic endeavor.<br />\nRegular match games of base-ball are scheduled between teams of the attending colleges, a tennis tournament, with singles and doubles, a golf tournament,<br />\nand on ,the Fourth of July a special field day. This year Yale won the chain<br />\npionship in these events; R. H. Schauffler of Princeton defeated Ludington of<br />\nYale in a closely contested tennis tournament. These two colleges also played<br />\nthe finals for the baseball championship, Yale winning by a score of ten to<br />\nseven. As yet Hopkins has had no part in these games, but as she is gradually<br />\ncoming into more prominence in other lines, it, behooves the athletic element<br />\namong us to look out for Hopkins' honors in that direction also.<br />\nAt sunset the Conference gathers on 'Round Top\" where rests the body<br />\nof Mr. Moody, and \"Life-work Talks\" are given by men prominent in the different professions. These are perhaps the most stirring addresses in the ten<br />\ndays' program. From \"Round Top\" across the hills to the Auditorium for<br />\nthe platform meeting of the evening, you go amid the glories of a Northfield<br />\nsunset. There below is the calm, green valley, beautiful in its stillness, with<br />\nits meadows, its clustering houses and trees, the shining river curving through<br />\nthe midst, and beyond, the best of all, the everlasting hills with their constantly<br />\nchanging lights and shadows. Presently twilight falls and soon a hundred<br />\nlights from \"Hermon's wooded hill\" flash out, and nearby the Seminary lights<br />\nare also gleaming.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nAt 9.30 you wend your way to the camp guided by the moon's soft rays,<br />\nand there, in the quiet second thought following the evening's address, are held<br />\nDelegation Meetings,\" in which the fellows come to know each other as never<br />\nbefore. Then to peaceful slumbers amid the stately pines—provided no \"rough<br />\nhouse\" is on foot to disturb the wee hours of the morn.<br />\nFourth of July night is a gala occasion never forgotten by those participating. The large Auditorium is profusely decorated with college and state colors,<br />\na certain pro rata space being assigned te each college. Lockstep marching to<br />\ncollege tunes prevails all over the house for half an hour, and then after an ad•<br />\ndress by Pres. Seth Low on \"The Responsibilities of the College Man to the<br />\nState,\" each delegation has an opportunity to give its yell, sing a song, if large<br />\nenough, do any \"stunt\" of special attraction that can be devised. In this Hopkins is in the van; \"the hit\" of the evening being that arranged for the \"Medical Schools of Baltimore.\" A skeleton specially devised and sheeted with skull,<br />\narm, and foot distinctly visible, previously concealed behind the platform suddenly rushes out over the heads of the astonished multitude during the singing<br />\nof our song, along the supporting ropes reaching to the vaulted roof float the<br />\nbanners of the different medical schools of Baltimore.<br />\nThe responses of the foreign delegates form a chief feature of the evening,<br />\nespecially those of the dozen Japanese students, whose singing(?) rivals that of<br />\nthe Hopkins Glee Club. The jolly times with these foreign delegates when they<br />\nvisited the camp will be long remembered. Pastor Hoffman, of Geneva, who<br />\nStyled himself \"The Veldt's Committee,\" a chief justice of Hungary, a native<br />\nlawyer from Labore, and many others of exceedingly attractive personality<br />\nmingled with delightful and helpful freedom among the fellows at our camp.<br />\nOne event worth special mention was the large reception given the entire<br />\nconference by the Yale delegation in East Hall. Another was the \"night shirt<br />\nbrigade\" which arose, like the mushroon, to full strength in a single night.<br />\nStarted by only a handful at the top of the hill in the dead of night, not twenty<br />\nminutes passed before every man in camp had either arisen in response to the<br />\ncall \"everybody out\" or had suffered his cot to depart from under him, and his<br />\nbedclothes to be scattered to the wind.<br />\nA hundred and twenty fellows in pajamas sitting on the top rail of a worm<br />\nfence at one thirty a. m., singing \"Good Night Ladies\" was certainly worthy<br />\nof a flashlight and further investigation.<br />\nTime and space would fail to tell of what we did; all that ten loyal Hopkinsians could devise was done. Is not that enough?<br />\nThose in the delegation, which was the same size as last year, were Dr. P.<br />\nS. Evans, Jr., Med., C. K. Edmunds,'97, A. W. Freeman, G. S., R. L. McAll,<br />\n'00, A. R. Bird,'01, G. E.. Snavely, '01, H. W. Plaggemeyer,'03, R. C. Pagon,<br />\nC. K. E.<br />\n'03, J. H. Addison, '03, R. S. Licking, '04.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nOCTOBER 12, 1901.<br />\n<br />\nSubscription $1 50 per year.<br />\n.<br />\nEditor in Chief,<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n.<br />\n<br />\nWILLIAM B. HILL, 1902.<br />\n. SOL STROUSE, 1902.<br />\nEDEN C. HILL, 11)02.<br />\nRO<br />\nT S. LANIER, 1903.BER<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\n<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 91,<br />\nJ. H. IT.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nHE NEWS LETTER greets its readers in new form. We have deemed it ad-<br />\n<br />\nt<br />\n<br />\nvisable to adopt the present shape for several reasons, the most important<br />\nof which is that we believe our readers will find the present magazine<br />\nform more desirable and less inconvenient to handle than the old design. In<br />\nthe course of the ensuing year the NEWS-LETTER desires to come into close<br />\ntouch with every student of the University, and in order to accomplish this<br />\nevery effort will be made to publish such news as will interest all Hopkins<br />\nstudents. With this end in view we propose to extend our field to the Medical<br />\nSchool, to devote a portion of each issue to Medical School items, and to supplement our present staff of editors by the addition of a Medical School Editor.<br />\nWith the exception of the \"Hullabaloo,\" the NEWS-LETTER is the only<br />\nstudent publication at Hopkins, and for this reason we wish every student to<br />\ntake a personal interest in the paper. It is yours, support it, encourage it, improve it by helpful criticism given in proper spirit, and in return it will endeavor<br />\nto give you a representative college journal.<br />\nURING the past five months misfortune has dealt us several cruel blows.<br />\nNever before in the history of the University has death claimed so many<br />\nof our Faculty in so brief a period of time. Just before the university<br />\nclosed last spring, the whole scientific world was called upon to mourn with us<br />\nthe loss of one its greatest thinkers and inventors—Professor Rowland.<br />\nAs we commence our 26th academic year we find three distinguished names<br />\nmissing from our Faculty roll—Dr. Herbert B. Adams, Professor Emeritus of<br />\nAmerican an? Institutional History; Dr. Sidney Sherwood, Associate Professor<br />\n<br />\ng<br />\n<br />\n\fTHE NEWS—LETTER. -<br />\n<br />\n5<br />\n<br />\nin Political Economy, and Dr. Morris C. Sutphen, Instructor in Latin. The<br />\nloss to an institution, of four such men cannot be estimated, it can, however,<br />\nbe felt—felt most deeply.<br />\n<br />\nt<br />\n<br />\nHE halls of old Johns Hopkins are open for another academic year, and<br />\nanother class, untutored and untrained along the lines of University<br />\nthought and action has entered.<br />\nTo the'class, known in the college world as Freshinan, the NEWS-LETTIM<br />\nextends its greeting and a bit of advice. Remember, first of all, that you are<br />\nnow an integral part of a great University, and the position carries with it a<br />\ncertain amount of responsibility; your alma mater is beginning a great work for<br />\nYOU; in return you owe her something, nor is this duty entirely absolved by<br />\nfaithful and constant effort in class work, for apart from the high standard of<br />\nscholarship necessary in order to be a Hopkins student, there are certain other<br />\nresponsibilities devolving upon you. The first of these is unswerving loyalty<br />\nto the Black and Blue, a loyalty stronger and deeper than a mere preparatory<br />\nschool affiliation, a loyalty which, despite storm and tempest, will never be<br />\nShaken, Perhaps you have some latent talent, beside your natural inclination (?)<br />\nto study. If such be the case now is the time to bring it forth. The students<br />\nmaintain athletic teams, musical clubs, and two publications. If athletically<br />\ninclined try for a place on the foot ball, lacrosse, or track and field team; if<br />\nmusic proves the greater charm there are Glee, Banjo and Mandolin Clubs; if<br />\nYou have a bent for the literary side there is the NEWS-LETTER. Last of all,<br />\nbut by no means least, there is your support which all three of the above named<br />\ndepartments of undergraduate effort need and solicit. Other classes have lived<br />\nUp to expectations, shown college spirit, supported college institutions—now<br />\nlireshmen \"go and do likewise.\"<br />\n<br />\nG<br />\n<br />\nACH year we notice the increasing tendency among American colleges to<br />\nemulate the example of the Johns Hopkins University in two important<br />\nrespects, the first of which is to reduce from four to three years the course<br />\nof study leading to the degree of Bachelor of Arts, and second to require an A.<br />\nB. from students wishing to take up the study of medicine. Within the past<br />\ntwo years the University of Pennsylvania has adopted the latter course, and<br />\nseveral other medical universities now announce the same policy. Beyond<br />\nquestion this is excellent policy. A man taking up medicine as a profession<br />\nShould have something more than a mere elementary knowledge of the first<br />\nPrinciples of education. Yet many medical schools admit men who have not<br />\nCompleted their public school course. As a consequence the finished products<br />\nturned out\" by the institutions of medicine are not of a finished nature. On<br />\nthe other hand it is advisable to reduce the length of the under-graduate course<br />\nand place an A. B. within reach of a man after a period of three instead of four<br />\nYears work. The extra year thus gained means a great deal to many a young<br />\nman who enters the field of medicine, law, or any kindred science requiring a<br />\nSpecial course. At the same time he may feel that he is in no sense a loser, for<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nthe three year curriculum of to-day embraces as much as the four year curriculum of twenty or thirty years ago. More attention is paid to the practical side<br />\nof knowledge, and effort is made to school the college man of to-day in those<br />\nstudies which will be of the greatest use to him in after life. Even to the man<br />\nwho contemplates entering business at the expiration of his undergraduate<br />\ncourse, the three year curriculum will be of advantage, for as the term of college<br />\nlife is shortened every effort will be made to conform the course to the<br />\nstudent's needs,concentrating his energies upon the most useful subjects for his<br />\nbranch of work, and eliminating those which will be of little advantage to him.<br />\nFinally, in an age of hurry, of stimulated energy, and gigantic enterprise, an<br />\nage in which every hour is of importance and value to a man entering a business career, a young man is given the advantage of another year, and thus<br />\nenabled to begin the struggle for existence one year sooner.<br />\nHE Hopkins foot ball season has opened under the most auspicious<br />\ncircumstances. It is true our team has been somewhat crippled by the<br />\nloss of several of last year's best players. Still, judging from the<br />\namount of interest and enthusiasm manifested by the students, and particularly<br />\nthe students of the Medical School, it is probable that this year's team will be<br />\none of the best Hopkins has ever put upon the field. The securing of a firstclass coach is an innovation, the advantages of which cannot be too strongly<br />\nemphasized. In securing Mr. Dickson of University of Pennsylvania, the<br />\nUniversity has taken a step in the right direction, the significance of which will<br />\nbe better appreciated when the foot ball season is more advanced. Through<br />\nthe generosity of the musical clubs in so kindly donating one hundred dollars,<br />\nthe foot ball team will start a training table.<br />\nIn order that the entire student body may have an opportunity to witness<br />\nthe games this fall, the management has decided to issue season tickets, admitting to five games, for one dollar and a half, thus selling admissions to five<br />\ngames for the price of three.<br />\n<br />\nZ<br />\n<br />\nFACULTY VACATIONS.<br />\nR. REMSEN spent a very profitable and refreshing summer in New England. He began with a walking trip through the Berkshire Hills, Massachusetts, as was his habit when a professor at Williams College.<br />\nAfterwards he was at Springfield, Massachusetts, and Northeast Harbor, Maine,<br />\nbeing at the latter place a next door neighbor of Dr. Gilman. Besides this outdoor activity, Dr. Remsen employed his leisure in preparing for the printer<br />\nanother of his series of chemistry text-books.<br />\nDr. Osier, Hopkins professor of medicine, traveled during the summer<br />\nmonths in England and on the Continent, taking time to attend the London<br />\nTuberculosis Congress. Dr. Osler says great physicians no longer think much<br />\nof drugs in the treatment of this disease. It is now regarded as contagious,<br />\nand the best treatment is considered to consist in the proper inspection, sanitation, and other hygienic measures.<br />\n<br />\n9<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nATHLETICS.<br />\n41<br />\n<br />\nFOOT BALL SCHEDULE. Jg<br />\n<br />\nOCTOBER 12.—J. H. U. vs. Rock Hill, at American League Park.<br />\nOCTOBER 19. —J. H. U. vs. Maryland Agricultural College, at American League Park.<br />\nOCTOBER 23.—Princeton Vs. J. H. U., at Princeton.<br />\nNOVEMBER 2.—Haverford vs. J. H. U., at Haverford.<br />\nNOVEMBER 9.—P. M. C. vs. J. H. U., at Chester.<br />\nNOVEMBER 16.—j. H. U. vs. Western Maryland, at American League Park.<br />\nNOVEMBER 23.- -J. H. U. vs. St. John's, at American League Park.<br />\nNOVEMBER 28.—(Thanksgiving Day), j. H. U. vs. U. of M.. at American League Park.<br />\n<br />\nOUTLOOK FOR COMING SEASON.<br />\nT IS always the case at the opening of the scholastic year at the Hopkins<br />\nthat the Athletic outlook is of anything but brightest hue, and the year<br />\njust started has but little more prospect than former ones. In all branches<br />\nmen have been lost,—some by graduation, some by \"quituation,\" and still<br />\nothers have been compelled to forego all sports for the sake of their University<br />\nwork.<br />\nIn football, in track and field work, and in lacrosse heavy losses have been<br />\nsustained. The foot ball team has lost such men as Hancock, Butler, Morse,<br />\nSchmitters, Meadows, Bruton, Riggs, and others who aided us to victory last<br />\nYear. To he sure, their places in part have been filled by the acquisition of new<br />\nmen from the freshmen ranks and the further developement of such stand-bys as<br />\nBlanck, Straus, Yearley and Sayler; but the whipping into shape of the new<br />\nmen gives the team a hard handicap to overcome.<br />\nThe track team has lost Whitman, the man who could sprint, and who<br />\ncould equally well put the shot. Riggs refuses to enter athletics again, saying<br />\nthat his work at the medical school has become of such a nature that he can not<br />\nafford to slight it \"at this stage of the game.\" Others, too, have gone whose<br />\naid in winning victories for the Black and Blue will be sorely missed. But<br />\nmany of the old men have returned who will furnish the bone and sinew for the<br />\nteam, and, no doubt, will get together a team worthy of the University.<br />\nThe lacrosse squad has been diminished by the graduation of Bruton,<br />\nBandel, and Tyler from the collegiate department, and of Maddren from the<br />\nMedical School. Maddren's loss will be most keenly felt, for aside from playing the game in a masterly fashion, he knew all its fine points, and has for a<br />\ncouple of years acted as head coach for our team. Abercrombie, Briscoe, and<br />\nB. M. Bernheim are at the Medical School, and the remainder of the team is<br />\nstill in the undergraduate department. The loss in number does not appear<br />\nespecially great, but when the ability of the men is taken into consideration the<br />\nheavy loss can be appreciated.<br />\nThe incoming class seems very enthusiastic over all sorts of sports, so we<br />\ndo not think that there can he much doubt as to the superiority of our teams for<br />\n<br />\n5<br />\n<br />\n\f4<br />\n<br />\n12<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nthe coming year. But let us impress upon all the necessity of all turning out.<br />\n\"No,\" we hear you say, \"what's the use of my trying to do anything. I am<br />\nworthless, so why should I go to the trouble of 'turning out.'\" No, my friend,<br />\nyou are not \"worthless.\" Come out and show your spirit, and do your best,<br />\nsomething will happen. Some of the best athletes ever produced at this Uni versity were men like you. They had to be coaxed to come out. They thought<br />\nthemselves \"good for nothing,\" but when they got under the care of a trainer,<br />\nthey developed, and showed such magnificent qualities that they really surprised<br />\nthemselves<br />\nSo, young man, come out, and do your level best for her whom we all love—<br />\nour Alma Mater.<br />\nPROSPECT FOR FOOT BALL.<br />\nUST at present Foot Ball is the engrossing topic. This year Hopkins has<br />\ntwo entirely new features to boast of, viz.: a coach and a training table.<br />\nMr. Dickson, of the U. of P., will handle the men during the season, and<br />\nexpresses the opinion that a winning team will do the honors for Old Tom<br />\nHopkins on the gridiron. The team will, no doubt, be lighter than last year's,<br />\naveraging not over 150 lbs., but this feature will be supplemented by speed and<br />\nconcerted team work. There's lots of new material this year and some of it<br />\nappears to be very good, but we can make no prophecies just yet, as the task<br />\nof weeding out the team has not begun. All the candidates are, however, to<br />\nbe congratulated on their enthusiasm and interest as shown by the large<br />\n,numbers which are present for daily practice. There is a rumor afloat that<br />\nseveral Meds, besides those who have already shown up will join these swelling<br />\nranks of Black and Blue Warriors, and there is some splendid material in the<br />\nMedical School. The first game is with Rock Hill, at the American League<br />\nPark, Saturday, and we prophesy that Rock Hill will count her score with<br />\none oval figure. Season tickets will be sold this year at $1.50 for the entire<br />\nschedule of games to be played by J. H. U. in Baltimore, including all the<br />\nchampionship games, also the game with U. of Md. We add in conclusion:<br />\nEverybody out next Saturday, the rooting promises to be something fierce; woe<br />\nunto the freshman whose chubby face is not to be seen there.<br />\n<br />\n3<br />\n<br />\nTHE GALLERY.<br />\nMPROVEMENT is the mark of the age. Last year THE NEWS LETTER<br />\nseveral times called attention to changes being made in and around the<br />\nGymnasium building, and this year, for the first time is it noticed that<br />\naccommodations for visitors and onlookers in the cage are both sufficient and<br />\nconvenient. The gallery was spoken of two years ago and finally built during<br />\nthe last few weeks of last season. So far the gallery leads in the list of<br />\nimprovements to our athletic accommodations which began with the building<br />\nof the cage some few years ago and have continued ever since. Some day we<br />\nwill have a swimming pool, Thanks, Mack!<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n.<br />\n<br />\n13<br />\n<br />\nNow that the gallery is ready for occupancy by interested spectators of<br />\nteam practice, would it be out of place to remind students and others that one<br />\nof the main purposes in building it was to save the running track? Formerly<br />\nthe track was at the mercy of all onlookers in the cage, and it required Mack's<br />\nbest efforts to keep it in any sort of condition for his men to train. Now we<br />\nShould all remember that the cage is for players, the track for runners and the<br />\ngallery for spectators.<br />\nOUR PHILIPPINE DEPARTMENT.<br />\nOHNS Hopkins is the first institution in the country to start a course of<br />\ninstruction in the dialects, manners and customs of our Eastern possessions. For some time past, the University ha been collecting the available<br />\nliterature concerning the habits and language of the Filipinos, and now the library contains practically all the books of any value on these subjects to be had<br />\nin this country. Dr. Haupt, head of the department of Semitic languages, will<br />\nhave immediate supervision of the work. The first course offered is an elective<br />\nin Tagalog, given by Mr. F. R. Blake, formerly a fellow of the University. Mr.<br />\nBlake has specialized in Sanskrit and in the Semitic languages. As the Malay<br />\ndialects are mixtures of Sanskrit and Arabic, he is especially well qualified for<br />\nthe work. Since all the valuable works on this subject are in Spanish or German, Mr. Blake is preparing an English manual of the dialects used on the<br />\nislands, designed both for students and for general use.<br />\nIt is hard to overestimate the importance of this department, and the honor<br />\naccruing to the Hopkins for its enterprise in founding it. In Dr. Haupt's words,<br />\nconcerning the great Sepoy rebellion, \"if the English authorities had consulted<br />\nanybody familiar with the prejudices of the natives, they would never have<br />\ncompelled the use of those bullets greased with the fat that was an abomination<br />\nto Hindoo and Mohommedan alike. The U. S. Bureau of Ethnology has<br />\nalready saved to the Government millions of dollars in its dealings with the<br />\nIndians.\" From this is seen the necessity to our country, soon to be a power<br />\nin the Orient, of such courses and instructions.<br />\nDr. Haupt has also in view an encyclopedia of the industries, the economical, political, and religious life of the Philippines. For this work, also to be<br />\nPublished under the auspices of the Hopkins, there has already been enlisted<br />\nthe assistance of Dr. A. B. Meyer, of Dresden, and Dr. Blumentritt, of Seilmeritz.<br />\n<br />\n3<br />\n<br />\nFRESHMAN PRIMER.<br />\nLESSON HI.<br />\n<br />\nYes, my darlings, always do what the Juniors tell you to do. You may<br />\nwear Sister Maggie's dress skirts as kilts and carry along the baby's feeding<br />\napparatus. The malted milk drops and Mellin's Food Sandwiches must be<br />\ntaken each day for lunch. If you are punched in the mug, say \"goo, goo!'<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nbut don't run away. The Juniors love you, and will make you feel queer. So<br />\nbe happy.<br />\nLESSON IV.<br />\nWhose child is this? It looks around as if it were lost. It really seems to<br />\nhave lost the lower portion of its pantaloons. Hit it with an Indian club and<br />\nsee if it will holler. It is calling for the nurse girl. Shove it into long<br />\ntrousers, place it tenderly in a basket, and send the remains home to dear Papa.<br />\n<br />\n\"IN MEMORIAM.\"<br />\nOh, why will the fortune of life play such pranks?<br />\nAnd why will it out down the young and the brave?<br />\nThe arch-fiend has busied himself in our ranks,<br />\nAnd carried one off like a dastardly knave.<br />\nHad he come, as of yore, with armor and shield,<br />\nA warrior tried, seasoned, bearded and gray,<br />\nWe had fought him and conquered, and forced him to yield<br />\nFor to win every battle is naughty-two's way.<br />\nBut he came as an infant all naked and bare,<br />\nDeserted, alone, in the mystery of night.<br />\nWe clothed him and fondled him, gave him our care,<br />\nThen why should ho harm us? Oh, say was it right?<br />\nFull of treachery and guile with intent to deceive,<br />\nHe fixed upon one of us innocent youths,<br />\nWhispered tales in his ear, that made Law believe,<br />\nAnd made terrible lies, seem like beautiful truths.<br />\nOh, he carried Law off to the false land of dreams,<br />\nDeceived by a kiss so subtle and sly,<br />\nAnd now in my sleep I hear pitiful screams;<br />\nOur poor comrade tortured, and none of us by.<br />\nOh, Law, fare thee well, thou art gone from us now.<br />\nForever and aye to thy destiny tied,<br />\nWe will grieve, and in prayer our knee lightly bow;<br />\nAnd mourn for a comrade who lately has died.<br />\n—F. L. G-. '02.<br />\n<br />\nNEW UNIVERSITY SONGS.<br />\n<br />\n4T<br />\n4j HAS seemed strange to many people outside of the University that the<br />\nHopkins has so few college songs. Some persons have even hinted that<br />\nthe reason for this was a lack of true college spirit. This explanation,<br />\nhowever, is most decidedly erroneous, for to those who have looked into the<br />\nmatter at all it is evident that the true reason could more surely be found in<br />\nthe fact that never before has the attention of the student body been drawn to<br />\nthe subject of college songs.<br />\n\"To this end the musical organizations have determined to open a prize<br />\ncompetition for the best words, set either to original or popular music. Of<br />\ncourse, if a song with original words and music is handed in, it will be given<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\npreference to verses alone—yet if the words are set to some air which can be<br />\nused in the Glee Club or on the athletic grounds, provided neither \"Dixie\" nor<br />\nGeorgia\" is used, it will stand nearly as good a chance of taking a prize as<br />\nthe song with original music.<br />\n\"Three prizes have been offered—the first of $10.00, the second of $5.00,<br />\nand the third of $3.00. The Judges will be Dr. Herbert E. Green and Messrs.<br />\nE. L. Turnbull, J A. E. Eyster, E. Smith and H. Eager. The prizes will be<br />\ndecided by the vote of these men.<br />\n\"It is hoped that every man at present in the University and those formerly<br />\nconnected with it will take part in this contest, either from a desire to win a<br />\nPrize, or from his love for his Alma Mater, or—better yet—from a happy combination of both these incentives.\"<br />\nThe above announcement was published in the May issue of the NEWSLETTER, and the competition was to have closed in June. But, after some<br />\nconsideration, it was decided by those who had charge of the matter to postpone the final decision till the first of November.<br />\nBy this change more men were given an opportunity to compete; and there<br />\nwas a greater chance of composing and writing some really good songs.<br />\nIf a sufficient number of songs are handed in, the committee will have<br />\nthem published in book form, and thus give to the University the first book of<br />\nentirely original Hopkins songs.<br />\nSurely, with such a result to crown his efforts, every student who can make<br />\nthe slightest attempt at poetry should enter the competition, for not only will<br />\nhe be aiding his college, but he may incidentally win an enviable reputation<br />\nand a little cheering' reward.<br />\n\"TROUSERS.\"<br />\nA Very Short Performance.<br />\nPLACE: University P. 0. TIME: Monday, Sept. 30, 1901; ten A. M.<br />\nDRAMATIS PERSONAE.<br />\nHeroine.<br />\nLittle Boy, the Infant Freshman,<br />\nHeroes.<br />\nSome More Freshmen,<br />\n. Spectators.<br />\nSome Juniors,<br />\nOn Lookers.<br />\nSome Seniors,<br />\nAnd<br />\nTHE VILLAIN , IN BLUE.<br />\nScene I.<br />\nSPECTATORS: Ah! Look at the beautiful little child! See its prettily<br />\nformed limbs and the graceful swing of its short pantaloons. Mark their easy<br />\nmovement, unhindered by the lower portion of goods common to man! What<br />\nis it? Let us investigate.<br />\nLITTLE Boy: Leave me alone. Honestly I won't hurt any of you.<br />\nVILLIAN<br />\nCome, my darling child; we fear thy strength and prowess.<br />\nWe fear that thou mighiest harm our Varsity players if thou art allowed to run<br />\nloose. Come, child; tuck thyself to sleep in the arms of the mighty, and when<br />\nthou awakenest, thou wilt find that, like Sampson, thou has been shorn of<br />\nthy strength, and the lower portion of thy anatomy will be adorned with cloth.<br />\nSo be it.<br />\nChorus plays \"Rock a Bye Baby,\" followed by \"Just a Little Bit Off the<br />\nTop.'<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n801 UNION TRUST BUILDING,<br />\nN. E. Cor. Fayette and Charles Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipula.<br />\ntion, by which we remove any abstruction to the nerve and blood supply to<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special at<br />\ntendon is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. D. BOWEN, M. D., D. 0.,<br />\nProst. & Mgr.<br />\n—ESTABLISHED<br />\n<br />\nH. McM A INS, D. 0.,<br />\nSec'y. & Treas.<br />\nJAMES R. PA YNH.<br />\n<br />\n1879.—<br />\n<br />\nUl!ebb ng Zilver vitoserr<br />\nIN GREAT VARIETY.<br />\n<br />\nJACOBI & JENKINS,<br />\n<br />\nMARIA BUM,0.0.,<br />\nV.-Prest. & Asst. Sec'y.<br />\n<br />\n$tIversnittbs.<br />\n<br />\n216 N. CHARLES ST.<br />\n<br />\nHenderson's .0<br />\n<br />\n\"WA FZINE R 8c C..=0.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for Lincoln Bennett and<br />\nWalter Bernard's London Hats.<br />\n824 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 9W. HOPKINS CAPS<br />\n<br />\nUSHING & COMPANY' 13ooksclIces and<br />\nStatiOnCeS.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nMadison & Howard Sts.<br />\nStudent's Supplies.<br />\nttkLkN M. ftOLLYDRY,<br />\n600 N. EUTAW ST..<br />\n<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCI,LANIOUR BOOKI•<br />\n<br />\nKeeps constantly on hand the Text Books used i» Johns<br />\nHopkins University, Johns Hopkins Ul,iversity and<br />\nThe Woman's College of BAltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nB. G EICHELBERGER,<br />\nBOOKS FtND STFtTIONkRY,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nENGRAVING AND STAMPING.<br />\n<br />\nNew and Second-Hand Books Text Rooks, Note Books,<br />\nStudents' Requisites, etc. etc.<br />\nBooks Bought, Sold and Exchanged.<br />\nLawrence B. Kemp,President.<br />\n<br />\nNo. 30S North Charles Street,<br />\nV. M. C. A.BUILDING.<br />\nC. 81 P. Telephone 2351.<br />\nBALTIMORE, MD.<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nCommercial & Farmers National Bank,<br />\nHOWARD & GERMAN STREETS,<br />\nBALTIMORE, MD.<br />\nOffers to Depositors every facility which their Balances,<br />\nBusiness and Responsibility will warrant.<br />\n<br />\nis the noblest part of<br />\nyour body. Improve its<br />\nappearance and corn, fort by wearing OUR<br />\nHATS<br />\n<br />\nYOUR HEAD,SIR<br />\nMINOR'S,<br />\n218 NORTH EUTAW STREC1.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nOrtineral Agents.<br />\n<br />\nP-TO-DATt<br />\nONE PRICE.<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES, GENOA. ETC.<br />\nBAI.TIMORE TO BREMEN,<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN GUITAR AND BANJO 01<br />\nTAUGHT BY<br />\n<br />\n-4 OS<br />\n<br />\nC. J. LEVINt<br />\nwho has made a life<br />\nstudy of those instruments. Mandolin Soloist<br />\nfor Hopkinsof National reputation. Prepares Students<br />\n<br />\nMusical Clubs.<br />\n<br />\nStUdio, 331 N. Ghaelea St.<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br />\n<br />\n6o5 N. Eutaw Street.<br />\n<br />\nWM. V. PIPPEN,<br />\n<br />\nSMITH, DIXON a CO.<br />\n<br />\nflgenitthz Studio<br />\nSuccessor to Ciiinmins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\n<br />\n)F'ft'PER<br />\n<br />\nBaltimore<br />\n<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE cr,<br />\n<br />\nShuts, Neckwear,<br />\n<br />\nHosiery,<br />\nU. Underwew,<br />\nEtc.<br />\n<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n203W. BALTIMORE ST. &. 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nClinton P. Paine<br />\n<br />\nMembers of<br />\n<br />\nGordon P. Paine<br />\n<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange:<br />\nChicago Board of Trade<br />\n<br />\n29-31 N. Charles Steeet„<br />\n<br />\nGlobe<br />\nBrewery 1'<br />\n<br />\nLAGER BEERS<br />\nGoldbrau and Wurzburger,<br />\nA hsolutely Pure and Wholesome. None better on<br />\nAmerican Market.<br />\nWm. B. Oliver.<br />\n<br />\nJ. Win. Middendorf.<br />\n<br />\nMIDDENDORF, OLIVER & CO.<br />\n<br />\nCLINTON P. PAINE & CO.,<br />\n<br />\nVanhers & 16rohere.<br />\n<br />\nBANKERS & BROKERS<br />\n<br />\n-,<br />\n2C:1IS YD.1<br />\n<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\nDROVERS<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br />\n<br />\nMECHANICS NAT'L BANK<br />\nOF<br />\n<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nB. G. EICHELBERGER,<br />\n<br />\nBALTIMORE<br />\n<br />\nCapital Stock, $300,000<br />\n<br />\nSurplus and Profits, $350,000<br />\n<br />\nTransacts a General Banking Business<br />\nSafe Deposit Boxes For Rent $3.00 and Upward<br />\n4arties Clark, President<br />\n<br />\n164,0Pold Htrouse, Vice President<br />\n<br />\nBOOKS AND STATIONERY<br />\nENGRAVING AND STAMPING.<br />\n1%4.c3.. .30E3<br />\n<br />\nJ. D. Wheeler, Cashier<br />\nChas. A. Miller, Ass't cashier<br />\n<br />\nY. M. C. A<br />\n<br />\nBUILDING,<br />\n<br />\nC.& P. and Md.'Phones.<br />\n<br />\nA. H. PETTING,<br />\nManufacturer<br />\n<br />\n(great<br />\n<br />\nleffer ffrafernifp 3etvefrp.<br />\n<br />\n14 & 16 SAINT PAUL STREET<br />\nPlease call and examine our line before purchasing<br />\n<br />\nThe Chas, Willms SurRical Instrumt Company<br />\nBEIVJ A. NELSON. GSN'L MANAGER<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\n<br />\nFine Miorosoopos and Anuossorios.<br />\n300 N. Howard St.,<br />\n<br />\nMueller,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nCAUoN<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nJR'S. It DOWNS,<br />\n229 N. Charles Ste,<br />\nMASONIC TEMPLE.<br />\n<br />\nFOR Class, Fraternity and College Stationery,<br />\n<br />\nBanquet Cards, Invitation, Diplomas,<br />\nPrograms, Visiting Cards, etc<br />\nOur 5013 J. ii. U. Bins and Black Plan Paper—now ready<br />\n<br />\nTHE NEWS LETTER<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\n<br />\n5 West Lexington Street,<br />\nn(ito)<br />\n(Loudon<br />\n<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nBA LTI MORE<br />\nLight and Lombard Streets,<br />\n<br />\nFINEST PHOTOGRAPHIC<br />\nWORK IN THE CITY.<br />\n<br />\nWe carry a full line of Stwdents' Note Books and Stationery<br />\n<br />\nSpecial attention given to Holiday Work<br />\nand Groups, Class Pictures, etc.<br />\n<br />\nBoth 'Phones.<br />\n<br />\n\f\f", "format": "basic_html", "processed": "iV!<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\n1i<br /><br />\ntiir_51k;Ny,<br /><br />\nThe Johns Hopkins Press.<br /><br />\nBALTIMORE, MD•<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $5 per volume.<br />\nI I. American Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXVI<br />\nin progress. $5 per volume.<br />\nITT. American Journal of Philology.<br />\nIL L. (ITLDERFALREVE, Editor. Quarterly. 8vo.<br />\nVolume XXII in progress. $1 per volume.<br />\nIV. Studies from the Biological Laboratory. 8vo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies In Historical and Political Science.<br />\nH. B. ADAMS, Editor. Monthly. live. Series X 1 X<br />\nIn progress. $3 per volume.<br />\nVI. Johns Hopkins University Circular&amp;<br />\nContaining reports of s lentific and literary work<br />\nIn progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. El per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie,etc.)<br />\nVol. TV in progress.<br />\nX. Memoirs from the Biological Laboratory,<br />\nW. K. BROOKS, Editor. Volume IV complete. 87.50<br />\nper volume.<br />\nXT. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.60 per volume.<br />\nof Experimental Medicine.<br />\nJournal<br />\nXII.<br />\nW. Fr. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of insanity.<br />\nHENRY M. HURD,Editor. Quarterly. 4 to. 45 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric ElecL. A. BAUER, Editor. Quarterly.<br />\ntricity.<br />\n8vo. Volume VI in progress. $2.50 per volume.<br />\nxvI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academia year.<br />\nI.<br /><br />\nTwentieSixth Year.<br /><br />\nBeginnIne October 1st, 1901.<br /><br />\n.<br />\n.<br />\nPresident,<br />\nDean of the Medical School,<br />\n.<br />\n.<br />\nDean of the College.<br /><br />\nIRA RE MS EN.<br />\nWM.H. HOWELL.<br />\nE DW. H. GRIFFIN.<br /><br />\nINSTRUCTIO<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\nC) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\n100,000 volumes.<br />\n185,000 volumes.<br />\n200.000 volumes.<br /><br />\n.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPhu rmacology,<br />\nPhysiological Chemistry,<br />\nclinical Medicine,<br /><br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clan*.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRemit nee,<br />\nEnglish,<br />\nH istory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. M. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br /><br />\nUndergraduates Courses (leading B. A.)<br />\nGroups.<br />\n1.<br />\n2.<br />\n8.<br />\n4.<br />\n5.<br />\ntS.<br />\n7.<br /><br />\nClassical (the \"Old College Course.\")<br />\nMathematical-Physical,<br />\n(leading up to Engineering.)<br />\nChemical-Itiological.<br />\n(leading up to Medicine.)<br />\nGeological-Biological.<br />\nLatin Mathematical.<br />\nHistorical-Political.<br />\n(leading up to Law.)<br />\nModern Languages.<br /><br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics(vol. XXIV.)<br />\nRemsen.<br />\nIra<br />\nXXVI).<br />\n(vol.<br />\nChemistry<br />\nBasil L. Gildersleeve.<br />\nPhilologp (vol. XXII.)<br />\nHerbert B. Adams.<br />\nHistory (vol. XIX.)<br />\nModern Languages(vol. XV L) A. Marshall Mott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAssyriology (vol. IV.)<br />\nIV. H. Welch.<br />\nVI.)<br />\n(vol.<br />\nMedicine<br />\nExperimental<br />\n11=1101011<br /><br />\nProgrammes of the Cours,s offered to graduate students in Philosophy and the Arts, and in the School of<br />\nMedicine, and ulso of the Undergraduate or Collegiate<br />\nCourses, will he sent on application to the Registrar.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\n\"The Critical 'Edition of the Hebrew Text of the Old<br />\nTestament.\" Edited by Prof. Paul Haupt. Prospectus on application.<br />\n\"‘Rowland's Photograph of the Normal Solar Spectrum.\"<br />\n10 plates. $20.00<br />\n\"Description of the Johns Hopkins Hospital.\" J. S. Billings, Editor. 110 pp. 4to. 60 plates. $7.50 cloth.<br />\n\"The Teaching of the Apostles. Complete fac-simile edition. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\n\"Reproduction in Phototype of Syriac MS with Antilegomena Epistles.\" Edited by I. H. Hall. $8.00.<br />\n\"Bibliographia Hopkinsiensis.\" Part T. Philology. Parts<br />\nII-IIL Chemistry, Minerology and Geology. Parts<br />\nIV-V-V 1 Physics, Astronomy and Mathematics.<br />\n•<br />\n8 vo. 8t,ornts per part.<br />\na lull list ot publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmag be sent to Johns flopkins Press. Baltimore, Md.<br /><br />\n4<br />\nI<br />\n'<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nOCTOBER 12, 1901.<br /><br />\n•<br /><br />\nNo, 1.<br /><br />\nHOPKINS MEN AT NORTHFIELD.<br />\nARUN has a place been more favored with natural beauty than Northfield,<br />\nthe fairyland of broad green meadows and woodlands, sweet with the<br />\nsinging of birds or hushed with the stillness of summer noontide ; of<br />\nmountains, forest crowned, now blue, now purple, now golden crested, now<br />\nmantled with low hanging clouds ; of a quiet out-flowing river reflecting the<br />\nSplendid flush of the sunset, the exquisite tints of twilight, or the stars of the<br />\nstill night.<br />\nHere on the east bank of the Connecticut near the northern boundary of<br />\nMassachusetts, on the lower slopes of Notch Mountain stand the Cathedral<br />\nPines Through the aisles of this dim grove we walk with reverent mind.<br />\nStately pines all about us seem to pierce the sky. Beneath our feet the fragrant, slippery needles make us fearful of mishap. For ten remembered days<br />\nten loyal sons of Hopkins dwelt amid this \"solitude of pines with soft brown<br />\nSilences carpeted.\"<br /><br />\n(1.3'<br /><br />\n\"Yet not for all this beauty would I seek<br />\nThis lovely vale, but for more glorious things;<br />\nThere shines the sun that shall go down no more;<br />\nThere flows the fountain that shall water earth;<br />\nThere bursts the glory that shall never pale ;<br />\nThere springs the life with which death strives in vain;<br />\nThere are the golden chains prepared and forged<br />\nWhich knit our earth to heaven; there also stands<br />\nThe more than golden ladder which connects<br />\nThose lower chambers with the upper halls.\"<br /><br />\nAttractive as is the natural beauty of the place, the motive of the seven<br />\nhundred college men who gathered there this summer, not only in the camp but<br />\nin the less attractive dormitories of the Seminary, was rather the hope of spiritual awakening, to which the very beauty of the place itself conduces.<br />\nAt this Sixteenth Annual Conference, twenty-nine different nationalities<br />\nwere represented, and one hundred and forty-nine institutions of learning.<br />\nYale as usual led in attendance (120), with Princeton second. Hopkins was<br />\none of twelve colleges having nine or more delegates presentThe spiritual impressions were made at platform meetings, in the morning<br />\nand at night on each day by thirty-eight speakers of renown. The first few<br />\ndais were especially marked by the addresses of Mr. Morgan, as were the clos-<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\ning days by those of Mr. Robert Speer. To conserve and deepen these impressions, Bible classes, a Missionary Institute, and other departments were led by<br />\ncompetent men, among whom were Profs Bosworth and King of Oberlin, and<br />\nSanders of Yale. As there were present twenty-eight foreign delegates, the<br />\nmissionary interest was very strong, and Hopkins should rejoice to know that<br />\ntwo of her ten men volunteered for the foreign field while there.<br />\nAwakened amid the twitter of the early birds by the pulling of your cot<br />\nfrom beneath your weary bones, you bathe your sleepy eyes in mountain dew<br />\nstolen from your neighbor's pail, and are hardly through with your lavations<br />\nbefore the clang of a high-sounding cymbal calls you to the morning \"hashhouse\" meal (if it be not some mischievous chap abusing his wash-basin.)<br />\nAbout you at the table are many men of many minds from many colleges, in<br />\nmany stages of attire, calling lustily for the \"pump\" or the \"cow'S—as their<br />\ntaste or rather thirst may dictate.<br />\nA missionary institute at eight, or a Bible class at nine, calls you across<br />\nfields<br />\ntenanted with bleating sheep to the group of Seminary buildings not<br />\nthe<br />\nfar away. At ten in the large Auditorium you hear such addresses by the very<br />\nforemost religious thinkers as are seldom offered elsewhere. Back to camp for<br />\ndinner, you have the afternoon for personal talks with the leading men of the<br />\nconference, or for sport. If the latter, perhaps today it is a plunge into the<br />\ncool waters of the nearby Connecticut just as Nature made you, tomorrow a<br />\ntramp through the three adjoining states of Vermont, New Hampshire and<br />\nMassachusetts, or perhaps a long drive, with the rest of your delegation, amid<br />\nthe beautiful hills with which the region abounds, and from which vistas of<br />\nnatural beauty present pictures that still linger in your mind. Yet within<br />\nthe Seminary grounds are found abundant opportunities for athletic endeavor.<br />\nRegular match games of base-ball are scheduled between teams of the attending colleges, a tennis tournament, with singles and doubles, a golf tournament,<br />\nand on ,the Fourth of July a special field day. This year Yale won the chain<br />\npionship in these events; R. H. Schauffler of Princeton defeated Ludington of<br />\nYale in a closely contested tennis tournament. These two colleges also played<br />\nthe finals for the baseball championship, Yale winning by a score of ten to<br />\nseven. As yet Hopkins has had no part in these games, but as she is gradually<br />\ncoming into more prominence in other lines, it, behooves the athletic element<br />\namong us to look out for Hopkins' honors in that direction also.<br />\nAt sunset the Conference gathers on 'Round Top\" where rests the body<br />\nof Mr. Moody, and \"Life-work Talks\" are given by men prominent in the different professions. These are perhaps the most stirring addresses in the ten<br />\ndays' program. From \"Round Top\" across the hills to the Auditorium for<br />\nthe platform meeting of the evening, you go amid the glories of a Northfield<br />\nsunset. There below is the calm, green valley, beautiful in its stillness, with<br />\nits meadows, its clustering houses and trees, the shining river curving through<br />\nthe midst, and beyond, the best of all, the everlasting hills with their constantly<br />\nchanging lights and shadows. Presently twilight falls and soon a hundred<br />\nlights from \"Hermon's wooded hill\" flash out, and nearby the Seminary lights<br />\nare also gleaming.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nAt 9.30 you wend your way to the camp guided by the moon's soft rays,<br />\nand there, in the quiet second thought following the evening's address, are held<br />\nDelegation Meetings,\" in which the fellows come to know each other as never<br />\nbefore. Then to peaceful slumbers amid the stately pines—provided no \"rough<br />\nhouse\" is on foot to disturb the wee hours of the morn.<br />\nFourth of July night is a gala occasion never forgotten by those participating. The large Auditorium is profusely decorated with college and state colors,<br />\na certain pro rata space being assigned te each college. Lockstep marching to<br />\ncollege tunes prevails all over the house for half an hour, and then after an ad•<br />\ndress by Pres. Seth Low on \"The Responsibilities of the College Man to the<br />\nState,\" each delegation has an opportunity to give its yell, sing a song, if large<br />\nenough, do any \"stunt\" of special attraction that can be devised. In this Hopkins is in the van; \"the hit\" of the evening being that arranged for the \"Medical Schools of Baltimore.\" A skeleton specially devised and sheeted with skull,<br />\narm, and foot distinctly visible, previously concealed behind the platform suddenly rushes out over the heads of the astonished multitude during the singing<br />\nof our song, along the supporting ropes reaching to the vaulted roof float the<br />\nbanners of the different medical schools of Baltimore.<br />\nThe responses of the foreign delegates form a chief feature of the evening,<br />\nespecially those of the dozen Japanese students, whose singing(?) rivals that of<br />\nthe Hopkins Glee Club. The jolly times with these foreign delegates when they<br />\nvisited the camp will be long remembered. Pastor Hoffman, of Geneva, who<br />\nStyled himself \"The Veldt's Committee,\" a chief justice of Hungary, a native<br />\nlawyer from Labore, and many others of exceedingly attractive personality<br />\nmingled with delightful and helpful freedom among the fellows at our camp.<br />\nOne event worth special mention was the large reception given the entire<br />\nconference by the Yale delegation in East Hall. Another was the \"night shirt<br />\nbrigade\" which arose, like the mushroon, to full strength in a single night.<br />\nStarted by only a handful at the top of the hill in the dead of night, not twenty<br />\nminutes passed before every man in camp had either arisen in response to the<br />\ncall \"everybody out\" or had suffered his cot to depart from under him, and his<br />\nbedclothes to be scattered to the wind.<br />\nA hundred and twenty fellows in pajamas sitting on the top rail of a worm<br />\nfence at one thirty a. m., singing \"Good Night Ladies\" was certainly worthy<br />\nof a flashlight and further investigation.<br />\nTime and space would fail to tell of what we did; all that ten loyal Hopkinsians could devise was done. Is not that enough?<br />\nThose in the delegation, which was the same size as last year, were Dr. P.<br />\nS. Evans, Jr., Med., C. K. Edmunds,'97, A. W. Freeman, G. S., R. L. McAll,<br />\n'00, A. R. Bird,'01, G. E.. Snavely, '01, H. W. Plaggemeyer,'03, R. C. Pagon,<br />\nC. K. E.<br />\n'03, J. H. Addison, '03, R. S. Licking, '04.<br /><br />\n4<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nOCTOBER 12, 1901.<br /><br />\nSubscription $1 50 per year.<br />\n.<br />\nEditor in Chief,<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br />\n.<br /><br />\nWILLIAM B. HILL, 1902.<br />\n. SOL STROUSE, 1902.<br />\nEDEN C. HILL, 11)02.<br />\nRO<br />\nT S. LANIER, 1903.BER<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br /><br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br /><br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 91,<br />\nJ. H. IT.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nHE NEWS LETTER greets its readers in new form. We have deemed it ad-<br /><br />\nt<br /><br />\nvisable to adopt the present shape for several reasons, the most important<br />\nof which is that we believe our readers will find the present magazine<br />\nform more desirable and less inconvenient to handle than the old design. In<br />\nthe course of the ensuing year the NEWS-LETTER desires to come into close<br />\ntouch with every student of the University, and in order to accomplish this<br />\nevery effort will be made to publish such news as will interest all Hopkins<br />\nstudents. With this end in view we propose to extend our field to the Medical<br />\nSchool, to devote a portion of each issue to Medical School items, and to supplement our present staff of editors by the addition of a Medical School Editor.<br />\nWith the exception of the \"Hullabaloo,\" the NEWS-LETTER is the only<br />\nstudent publication at Hopkins, and for this reason we wish every student to<br />\ntake a personal interest in the paper. It is yours, support it, encourage it, improve it by helpful criticism given in proper spirit, and in return it will endeavor<br />\nto give you a representative college journal.<br />\nURING the past five months misfortune has dealt us several cruel blows.<br />\nNever before in the history of the University has death claimed so many<br />\nof our Faculty in so brief a period of time. Just before the university<br />\nclosed last spring, the whole scientific world was called upon to mourn with us<br />\nthe loss of one its greatest thinkers and inventors—Professor Rowland.<br />\nAs we commence our 26th academic year we find three distinguished names<br />\nmissing from our Faculty roll—Dr. Herbert B. Adams, Professor Emeritus of<br />\nAmerican an? Institutional History; Dr. Sidney Sherwood, Associate Professor<br /><br />\ng<br /><br />\nTHE NEWS—LETTER. -<br /><br />\n5<br /><br />\nin Political Economy, and Dr. Morris C. Sutphen, Instructor in Latin. The<br />\nloss to an institution, of four such men cannot be estimated, it can, however,<br />\nbe felt—felt most deeply.<br /><br />\nt<br /><br />\nHE halls of old Johns Hopkins are open for another academic year, and<br />\nanother class, untutored and untrained along the lines of University<br />\nthought and action has entered.<br />\nTo the'class, known in the college world as Freshinan, the NEWS-LETTIM<br />\nextends its greeting and a bit of advice. Remember, first of all, that you are<br />\nnow an integral part of a great University, and the position carries with it a<br />\ncertain amount of responsibility; your alma mater is beginning a great work for<br />\nYOU; in return you owe her something, nor is this duty entirely absolved by<br />\nfaithful and constant effort in class work, for apart from the high standard of<br />\nscholarship necessary in order to be a Hopkins student, there are certain other<br />\nresponsibilities devolving upon you. The first of these is unswerving loyalty<br />\nto the Black and Blue, a loyalty stronger and deeper than a mere preparatory<br />\nschool affiliation, a loyalty which, despite storm and tempest, will never be<br />\nShaken, Perhaps you have some latent talent, beside your natural inclination (?)<br />\nto study. If such be the case now is the time to bring it forth. The students<br />\nmaintain athletic teams, musical clubs, and two publications. If athletically<br />\ninclined try for a place on the foot ball, lacrosse, or track and field team; if<br />\nmusic proves the greater charm there are Glee, Banjo and Mandolin Clubs; if<br />\nYou have a bent for the literary side there is the NEWS-LETTER. Last of all,<br />\nbut by no means least, there is your support which all three of the above named<br />\ndepartments of undergraduate effort need and solicit. Other classes have lived<br />\nUp to expectations, shown college spirit, supported college institutions—now<br />\nlireshmen \"go and do likewise.\"<br /><br />\nG<br /><br />\nACH year we notice the increasing tendency among American colleges to<br />\nemulate the example of the Johns Hopkins University in two important<br />\nrespects, the first of which is to reduce from four to three years the course<br />\nof study leading to the degree of Bachelor of Arts, and second to require an A.<br />\nB. from students wishing to take up the study of medicine. Within the past<br />\ntwo years the University of Pennsylvania has adopted the latter course, and<br />\nseveral other medical universities now announce the same policy. Beyond<br />\nquestion this is excellent policy. A man taking up medicine as a profession<br />\nShould have something more than a mere elementary knowledge of the first<br />\nPrinciples of education. Yet many medical schools admit men who have not<br />\nCompleted their public school course. As a consequence the finished products<br />\nturned out\" by the institutions of medicine are not of a finished nature. On<br />\nthe other hand it is advisable to reduce the length of the under-graduate course<br />\nand place an A. B. within reach of a man after a period of three instead of four<br />\nYears work. The extra year thus gained means a great deal to many a young<br />\nman who enters the field of medicine, law, or any kindred science requiring a<br />\nSpecial course. At the same time he may feel that he is in no sense a loser, for<br /><br />\n6<br /><br />\nTHE NEWS—LETTER.<br /><br />\nthe three year curriculum of to-day embraces as much as the four year curriculum of twenty or thirty years ago. More attention is paid to the practical side<br />\nof knowledge, and effort is made to school the college man of to-day in those<br />\nstudies which will be of the greatest use to him in after life. Even to the man<br />\nwho contemplates entering business at the expiration of his undergraduate<br />\ncourse, the three year curriculum will be of advantage, for as the term of college<br />\nlife is shortened every effort will be made to conform the course to the<br />\nstudent's needs,concentrating his energies upon the most useful subjects for his<br />\nbranch of work, and eliminating those which will be of little advantage to him.<br />\nFinally, in an age of hurry, of stimulated energy, and gigantic enterprise, an<br />\nage in which every hour is of importance and value to a man entering a business career, a young man is given the advantage of another year, and thus<br />\nenabled to begin the struggle for existence one year sooner.<br />\nHE Hopkins foot ball season has opened under the most auspicious<br />\ncircumstances. It is true our team has been somewhat crippled by the<br />\nloss of several of last year's best players. Still, judging from the<br />\namount of interest and enthusiasm manifested by the students, and particularly<br />\nthe students of the Medical School, it is probable that this year's team will be<br />\none of the best Hopkins has ever put upon the field. The securing of a firstclass coach is an innovation, the advantages of which cannot be too strongly<br />\nemphasized. In securing Mr. Dickson of University of Pennsylvania, the<br />\nUniversity has taken a step in the right direction, the significance of which will<br />\nbe better appreciated when the foot ball season is more advanced. Through<br />\nthe generosity of the musical clubs in so kindly donating one hundred dollars,<br />\nthe foot ball team will start a training table.<br />\nIn order that the entire student body may have an opportunity to witness<br />\nthe games this fall, the management has decided to issue season tickets, admitting to five games, for one dollar and a half, thus selling admissions to five<br />\ngames for the price of three.<br /><br />\nZ<br /><br />\nFACULTY VACATIONS.<br />\nR. REMSEN spent a very profitable and refreshing summer in New England. He began with a walking trip through the Berkshire Hills, Massachusetts, as was his habit when a professor at Williams College.<br />\nAfterwards he was at Springfield, Massachusetts, and Northeast Harbor, Maine,<br />\nbeing at the latter place a next door neighbor of Dr. Gilman. Besides this outdoor activity, Dr. Remsen employed his leisure in preparing for the printer<br />\nanother of his series of chemistry text-books.<br />\nDr. Osier, Hopkins professor of medicine, traveled during the summer<br />\nmonths in England and on the Continent, taking time to attend the London<br />\nTuberculosis Congress. Dr. Osler says great physicians no longer think much<br />\nof drugs in the treatment of this disease. It is now regarded as contagious,<br />\nand the best treatment is considered to consist in the proper inspection, sanitation, and other hygienic measures.<br /><br />\n9<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nATHLETICS.<br />\n41<br /><br />\nFOOT BALL SCHEDULE. Jg<br /><br />\nOCTOBER 12.—J. H. U. vs. Rock Hill, at American League Park.<br />\nOCTOBER 19. —J. H. U. vs. Maryland Agricultural College, at American League Park.<br />\nOCTOBER 23.—Princeton Vs. J. H. U., at Princeton.<br />\nNOVEMBER 2.—Haverford vs. J. H. U., at Haverford.<br />\nNOVEMBER 9.—P. M. C. vs. J. H. U., at Chester.<br />\nNOVEMBER 16.—j. H. U. vs. Western Maryland, at American League Park.<br />\nNOVEMBER 23.- -J. H. U. vs. St. John's, at American League Park.<br />\nNOVEMBER 28.—(Thanksgiving Day), j. H. U. vs. U. of M.. at American League Park.<br /><br />\nOUTLOOK FOR COMING SEASON.<br />\nT IS always the case at the opening of the scholastic year at the Hopkins<br />\nthat the Athletic outlook is of anything but brightest hue, and the year<br />\njust started has but little more prospect than former ones. In all branches<br />\nmen have been lost,—some by graduation, some by \"quituation,\" and still<br />\nothers have been compelled to forego all sports for the sake of their University<br />\nwork.<br />\nIn football, in track and field work, and in lacrosse heavy losses have been<br />\nsustained. The foot ball team has lost such men as Hancock, Butler, Morse,<br />\nSchmitters, Meadows, Bruton, Riggs, and others who aided us to victory last<br />\nYear. To he sure, their places in part have been filled by the acquisition of new<br />\nmen from the freshmen ranks and the further developement of such stand-bys as<br />\nBlanck, Straus, Yearley and Sayler; but the whipping into shape of the new<br />\nmen gives the team a hard handicap to overcome.<br />\nThe track team has lost Whitman, the man who could sprint, and who<br />\ncould equally well put the shot. Riggs refuses to enter athletics again, saying<br />\nthat his work at the medical school has become of such a nature that he can not<br />\nafford to slight it \"at this stage of the game.\" Others, too, have gone whose<br />\naid in winning victories for the Black and Blue will be sorely missed. But<br />\nmany of the old men have returned who will furnish the bone and sinew for the<br />\nteam, and, no doubt, will get together a team worthy of the University.<br />\nThe lacrosse squad has been diminished by the graduation of Bruton,<br />\nBandel, and Tyler from the collegiate department, and of Maddren from the<br />\nMedical School. Maddren's loss will be most keenly felt, for aside from playing the game in a masterly fashion, he knew all its fine points, and has for a<br />\ncouple of years acted as head coach for our team. Abercrombie, Briscoe, and<br />\nB. M. Bernheim are at the Medical School, and the remainder of the team is<br />\nstill in the undergraduate department. The loss in number does not appear<br />\nespecially great, but when the ability of the men is taken into consideration the<br />\nheavy loss can be appreciated.<br />\nThe incoming class seems very enthusiastic over all sorts of sports, so we<br />\ndo not think that there can he much doubt as to the superiority of our teams for<br /><br />\n5<br /><br />\n4<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br /><br />\nthe coming year. But let us impress upon all the necessity of all turning out.<br />\n\"No,\" we hear you say, \"what's the use of my trying to do anything. I am<br />\nworthless, so why should I go to the trouble of 'turning out.'\" No, my friend,<br />\nyou are not \"worthless.\" Come out and show your spirit, and do your best,<br />\nsomething will happen. Some of the best athletes ever produced at this Uni versity were men like you. They had to be coaxed to come out. They thought<br />\nthemselves \"good for nothing,\" but when they got under the care of a trainer,<br />\nthey developed, and showed such magnificent qualities that they really surprised<br />\nthemselves<br />\nSo, young man, come out, and do your level best for her whom we all love—<br />\nour Alma Mater.<br />\nPROSPECT FOR FOOT BALL.<br />\nUST at present Foot Ball is the engrossing topic. This year Hopkins has<br />\ntwo entirely new features to boast of, viz.: a coach and a training table.<br />\nMr. Dickson, of the U. of P., will handle the men during the season, and<br />\nexpresses the opinion that a winning team will do the honors for Old Tom<br />\nHopkins on the gridiron. The team will, no doubt, be lighter than last year's,<br />\naveraging not over 150 lbs., but this feature will be supplemented by speed and<br />\nconcerted team work. There's lots of new material this year and some of it<br />\nappears to be very good, but we can make no prophecies just yet, as the task<br />\nof weeding out the team has not begun. All the candidates are, however, to<br />\nbe congratulated on their enthusiasm and interest as shown by the large<br />\n,numbers which are present for daily practice. There is a rumor afloat that<br />\nseveral Meds, besides those who have already shown up will join these swelling<br />\nranks of Black and Blue Warriors, and there is some splendid material in the<br />\nMedical School. The first game is with Rock Hill, at the American League<br />\nPark, Saturday, and we prophesy that Rock Hill will count her score with<br />\none oval figure. Season tickets will be sold this year at $1.50 for the entire<br />\nschedule of games to be played by J. H. U. in Baltimore, including all the<br />\nchampionship games, also the game with U. of Md. We add in conclusion:<br />\nEverybody out next Saturday, the rooting promises to be something fierce; woe<br />\nunto the freshman whose chubby face is not to be seen there.<br /><br />\n3<br /><br />\nTHE GALLERY.<br />\nMPROVEMENT is the mark of the age. Last year THE NEWS LETTER<br />\nseveral times called attention to changes being made in and around the<br />\nGymnasium building, and this year, for the first time is it noticed that<br />\naccommodations for visitors and onlookers in the cage are both sufficient and<br />\nconvenient. The gallery was spoken of two years ago and finally built during<br />\nthe last few weeks of last season. So far the gallery leads in the list of<br />\nimprovements to our athletic accommodations which began with the building<br />\nof the cage some few years ago and have continued ever since. Some day we<br />\nwill have a swimming pool, Thanks, Mack!<br /><br />\n3<br /><br />\nTHE NEWS-LETTER.<br /><br />\n.<br /><br />\n13<br /><br />\nNow that the gallery is ready for occupancy by interested spectators of<br />\nteam practice, would it be out of place to remind students and others that one<br />\nof the main purposes in building it was to save the running track? Formerly<br />\nthe track was at the mercy of all onlookers in the cage, and it required Mack's<br />\nbest efforts to keep it in any sort of condition for his men to train. Now we<br />\nShould all remember that the cage is for players, the track for runners and the<br />\ngallery for spectators.<br />\nOUR PHILIPPINE DEPARTMENT.<br />\nOHNS Hopkins is the first institution in the country to start a course of<br />\ninstruction in the dialects, manners and customs of our Eastern possessions. For some time past, the University ha been collecting the available<br />\nliterature concerning the habits and language of the Filipinos, and now the library contains practically all the books of any value on these subjects to be had<br />\nin this country. Dr. Haupt, head of the department of Semitic languages, will<br />\nhave immediate supervision of the work. The first course offered is an elective<br />\nin Tagalog, given by Mr. F. R. Blake, formerly a fellow of the University. Mr.<br />\nBlake has specialized in Sanskrit and in the Semitic languages. As the Malay<br />\ndialects are mixtures of Sanskrit and Arabic, he is especially well qualified for<br />\nthe work. Since all the valuable works on this subject are in Spanish or German, Mr. Blake is preparing an English manual of the dialects used on the<br />\nislands, designed both for students and for general use.<br />\nIt is hard to overestimate the importance of this department, and the honor<br />\naccruing to the Hopkins for its enterprise in founding it. In Dr. Haupt's words,<br />\nconcerning the great Sepoy rebellion, \"if the English authorities had consulted<br />\nanybody familiar with the prejudices of the natives, they would never have<br />\ncompelled the use of those bullets greased with the fat that was an abomination<br />\nto Hindoo and Mohommedan alike. The U. S. Bureau of Ethnology has<br />\nalready saved to the Government millions of dollars in its dealings with the<br />\nIndians.\" From this is seen the necessity to our country, soon to be a power<br />\nin the Orient, of such courses and instructions.<br />\nDr. Haupt has also in view an encyclopedia of the industries, the economical, political, and religious life of the Philippines. For this work, also to be<br />\nPublished under the auspices of the Hopkins, there has already been enlisted<br />\nthe assistance of Dr. A. B. Meyer, of Dresden, and Dr. Blumentritt, of Seilmeritz.<br /><br />\n3<br /><br />\nFRESHMAN PRIMER.<br />\nLESSON HI.<br /><br />\nYes, my darlings, always do what the Juniors tell you to do. You may<br />\nwear Sister Maggie's dress skirts as kilts and carry along the baby's feeding<br />\napparatus. The malted milk drops and Mellin's Food Sandwiches must be<br />\ntaken each day for lunch. If you are punched in the mug, say \"goo, goo!'<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nbut don't run away. The Juniors love you, and will make you feel queer. So<br />\nbe happy.<br />\nLESSON IV.<br />\nWhose child is this? It looks around as if it were lost. It really seems to<br />\nhave lost the lower portion of its pantaloons. Hit it with an Indian club and<br />\nsee if it will holler. It is calling for the nurse girl. Shove it into long<br />\ntrousers, place it tenderly in a basket, and send the remains home to dear Papa.<br /><br />\n\"IN MEMORIAM.\"<br />\nOh, why will the fortune of life play such pranks?<br />\nAnd why will it out down the young and the brave?<br />\nThe arch-fiend has busied himself in our ranks,<br />\nAnd carried one off like a dastardly knave.<br />\nHad he come, as of yore, with armor and shield,<br />\nA warrior tried, seasoned, bearded and gray,<br />\nWe had fought him and conquered, and forced him to yield<br />\nFor to win every battle is naughty-two's way.<br />\nBut he came as an infant all naked and bare,<br />\nDeserted, alone, in the mystery of night.<br />\nWe clothed him and fondled him, gave him our care,<br />\nThen why should ho harm us? Oh, say was it right?<br />\nFull of treachery and guile with intent to deceive,<br />\nHe fixed upon one of us innocent youths,<br />\nWhispered tales in his ear, that made Law believe,<br />\nAnd made terrible lies, seem like beautiful truths.<br />\nOh, he carried Law off to the false land of dreams,<br />\nDeceived by a kiss so subtle and sly,<br />\nAnd now in my sleep I hear pitiful screams;<br />\nOur poor comrade tortured, and none of us by.<br />\nOh, Law, fare thee well, thou art gone from us now.<br />\nForever and aye to thy destiny tied,<br />\nWe will grieve, and in prayer our knee lightly bow;<br />\nAnd mourn for a comrade who lately has died.<br />\n—F. L. G-. '02.<br /><br />\nNEW UNIVERSITY SONGS.<br /><br />\n4T<br />\n4j HAS seemed strange to many people outside of the University that the<br />\nHopkins has so few college songs. Some persons have even hinted that<br />\nthe reason for this was a lack of true college spirit. This explanation,<br />\nhowever, is most decidedly erroneous, for to those who have looked into the<br />\nmatter at all it is evident that the true reason could more surely be found in<br />\nthe fact that never before has the attention of the student body been drawn to<br />\nthe subject of college songs.<br />\n\"To this end the musical organizations have determined to open a prize<br />\ncompetition for the best words, set either to original or popular music. Of<br />\ncourse, if a song with original words and music is handed in, it will be given<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\npreference to verses alone—yet if the words are set to some air which can be<br />\nused in the Glee Club or on the athletic grounds, provided neither \"Dixie\" nor<br />\nGeorgia\" is used, it will stand nearly as good a chance of taking a prize as<br />\nthe song with original music.<br />\n\"Three prizes have been offered—the first of $10.00, the second of $5.00,<br />\nand the third of $3.00. The Judges will be Dr. Herbert E. Green and Messrs.<br />\nE. L. Turnbull, J A. E. Eyster, E. Smith and H. Eager. The prizes will be<br />\ndecided by the vote of these men.<br />\n\"It is hoped that every man at present in the University and those formerly<br />\nconnected with it will take part in this contest, either from a desire to win a<br />\nPrize, or from his love for his Alma Mater, or—better yet—from a happy combination of both these incentives.\"<br />\nThe above announcement was published in the May issue of the NEWSLETTER, and the competition was to have closed in June. But, after some<br />\nconsideration, it was decided by those who had charge of the matter to postpone the final decision till the first of November.<br />\nBy this change more men were given an opportunity to compete; and there<br />\nwas a greater chance of composing and writing some really good songs.<br />\nIf a sufficient number of songs are handed in, the committee will have<br />\nthem published in book form, and thus give to the University the first book of<br />\nentirely original Hopkins songs.<br />\nSurely, with such a result to crown his efforts, every student who can make<br />\nthe slightest attempt at poetry should enter the competition, for not only will<br />\nhe be aiding his college, but he may incidentally win an enviable reputation<br />\nand a little cheering' reward.<br />\n\"TROUSERS.\"<br />\nA Very Short Performance.<br />\nPLACE: University P. 0. TIME: Monday, Sept. 30, 1901; ten A. M.<br />\nDRAMATIS PERSONAE.<br />\nHeroine.<br />\nLittle Boy, the Infant Freshman,<br />\nHeroes.<br />\nSome More Freshmen,<br />\n. Spectators.<br />\nSome Juniors,<br />\nOn Lookers.<br />\nSome Seniors,<br />\nAnd<br />\nTHE VILLAIN , IN BLUE.<br />\nScene I.<br />\nSPECTATORS: Ah! Look at the beautiful little child! See its prettily<br />\nformed limbs and the graceful swing of its short pantaloons. Mark their easy<br />\nmovement, unhindered by the lower portion of goods common to man! What<br />\nis it? Let us investigate.<br />\nLITTLE Boy: Leave me alone. Honestly I won't hurt any of you.<br />\nVILLIAN<br />\nCome, my darling child; we fear thy strength and prowess.<br />\nWe fear that thou mighiest harm our Varsity players if thou art allowed to run<br />\nloose. Come, child; tuck thyself to sleep in the arms of the mighty, and when<br />\nthou awakenest, thou wilt find that, like Sampson, thou has been shorn of<br />\nthy strength, and the lower portion of thy anatomy will be adorned with cloth.<br />\nSo be it.<br />\nChorus plays \"Rock a Bye Baby,\" followed by \"Just a Little Bit Off the<br />\nTop.'<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n801 UNION TRUST BUILDING,<br />\nN. E. Cor. Fayette and Charles Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipula.<br />\ntion, by which we remove any abstruction to the nerve and blood supply to<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special at<br />\ntendon is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. D. BOWEN, M. D., D. 0.,<br />\nProst. &amp; Mgr.<br />\n—ESTABLISHED<br /><br />\nH. McM A INS, D. 0.,<br />\nSec'y. &amp; Treas.<br />\nJAMES R. PA YNH.<br /><br />\n1879.—<br /><br />\nUl!ebb ng Zilver vitoserr<br />\nIN GREAT VARIETY.<br /><br />\nJACOBI &amp; JENKINS,<br /><br />\nMARIA BUM,0.0.,<br />\nV.-Prest. &amp; Asst. Sec'y.<br /><br />\n$tIversnittbs.<br /><br />\n216 N. CHARLES ST.<br /><br />\nHenderson's .0<br /><br />\n\"WA FZINE R 8c C..=0.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for Lincoln Bennett and<br />\nWalter Bernard's London Hats.<br />\n824 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 9W. HOPKINS CAPS<br /><br />\nUSHING &amp; COMPANY' 13ooksclIces and<br />\nStatiOnCeS.<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Books, Note Books,<br />\nMadison &amp; Howard Sts.<br />\nStudent's Supplies.<br />\nttkLkN M. ftOLLYDRY,<br />\n600 N. EUTAW ST..<br /><br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCI,LANIOUR BOOKI•<br /><br />\nKeeps constantly on hand the Text Books used i» Johns<br />\nHopkins University, Johns Hopkins Ul,iversity and<br />\nThe Woman's College of BAltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nB. G EICHELBERGER,<br />\nBOOKS FtND STFtTIONkRY,<br /><br />\nBALTIMORE, MD.<br /><br />\nENGRAVING AND STAMPING.<br /><br />\nNew and Second-Hand Books Text Rooks, Note Books,<br />\nStudents' Requisites, etc. etc.<br />\nBooks Bought, Sold and Exchanged.<br />\nLawrence B. Kemp,President.<br /><br />\nNo. 30S North Charles Street,<br />\nV. M. C. A.BUILDING.<br />\nC. 81 P. Telephone 2351.<br />\nBALTIMORE, MD.<br /><br />\nWilson Keyser, Cashier.<br /><br />\nCommercial &amp; Farmers National Bank,<br />\nHOWARD &amp; GERMAN STREETS,<br />\nBALTIMORE, MD.<br />\nOffers to Depositors every facility which their Balances,<br />\nBusiness and Responsibility will warrant.<br /><br />\nis the noblest part of<br />\nyour body. Improve its<br />\nappearance and corn, fort by wearing OUR<br />\nHATS<br /><br />\nYOUR HEAD,SIR<br />\nMINOR'S,<br />\n218 NORTH EUTAW STREC1.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nOrtineral Agents.<br /><br />\nP-TO-DATt<br />\nONE PRICE.<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES, GENOA. ETC.<br />\nBAI.TIMORE TO BREMEN,<br />\nDIRECT.<br /><br />\nMANDOLIN GUITAR AND BANJO 01<br />\nTAUGHT BY<br /><br />\n-4 OS<br /><br />\nC. J. LEVINt<br />\nwho has made a life<br />\nstudy of those instruments. Mandolin Soloist<br />\nfor Hopkinsof National reputation. Prepares Students<br /><br />\nMusical Clubs.<br /><br />\nStUdio, 331 N. Ghaelea St.<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br /><br />\n6o5 N. Eutaw Street.<br /><br />\nWM. V. PIPPEN,<br /><br />\nSMITH, DIXON a CO.<br /><br />\nflgenitthz Studio<br />\nSuccessor to Ciiinmins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br /><br />\n)F'ft'PER<br /><br />\nBaltimore<br /><br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE cr,<br /><br />\nShuts, Neckwear,<br /><br />\nHosiery,<br />\nU. Underwew,<br />\nEtc.<br /><br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n203W. BALTIMORE ST. &amp;. 2 S. LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nClinton P. Paine<br /><br />\nMembers of<br /><br />\nGordon P. Paine<br /><br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange:<br />\nChicago Board of Trade<br /><br />\n29-31 N. Charles Steeet„<br /><br />\nGlobe<br />\nBrewery 1'<br /><br />\nLAGER BEERS<br />\nGoldbrau and Wurzburger,<br />\nA hsolutely Pure and Wholesome. None better on<br />\nAmerican Market.<br />\nWm. B. Oliver.<br /><br />\nJ. Win. Middendorf.<br /><br />\nMIDDENDORF, OLIVER &amp; CO.<br /><br />\nCLINTON P. PAINE &amp; CO.,<br /><br />\nVanhers &amp; 16rohere.<br /><br />\nBANKERS &amp; BROKERS<br /><br />\n-,<br />\n2C:1IS YD.1<br /><br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\nDROVERS<br /><br />\n217 E. German Street<br />\nBALTIMORE, MD.<br /><br />\nMECHANICS NAT'L BANK<br />\nOF<br /><br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nBaltimore, Md.<br /><br />\nB. G. EICHELBERGER,<br /><br />\nBALTIMORE<br /><br />\nCapital Stock, $300,000<br /><br />\nSurplus and Profits, $350,000<br /><br />\nTransacts a General Banking Business<br />\nSafe Deposit Boxes For Rent $3.00 and Upward<br />\n4arties Clark, President<br /><br />\n164,0Pold Htrouse, Vice President<br /><br />\nBOOKS AND STATIONERY<br />\nENGRAVING AND STAMPING.<br />\n1%4.c3.. .30E3<br /><br />\nJ. D. Wheeler, Cashier<br />\nChas. A. Miller, Ass't cashier<br /><br />\nY. M. C. A<br /><br />\nBUILDING,<br /><br />\nC.&amp; P. and Md.'Phones.<br /><br />\nA. H. PETTING,<br />\nManufacturer<br /><br />\n(great<br /><br />\nleffer ffrafernifp 3etvefrp.<br /><br />\n14 &amp; 16 SAINT PAUL STREET<br />\nPlease call and examine our line before purchasing<br /><br />\nThe Chas, Willms SurRical Instrumt Company<br />\nBEIVJ A. NELSON. GSN'L MANAGER<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br /><br />\nFine Miorosoopos and Anuossorios.<br />\n300 N. Howard St.,<br /><br />\nMueller,<br /><br />\nBaltimore, Md.<br /><br />\nCAUoN<br /><br />\nBALTIMORE, MD.<br /><br />\nJR'S. It DOWNS,<br />\n229 N. Charles Ste,<br />\nMASONIC TEMPLE.<br /><br />\nFOR Class, Fraternity and College Stationery,<br /><br />\nBanquet Cards, Invitation, Diplomas,<br />\nPrograms, Visiting Cards, etc<br />\nOur 5013 J. ii. U. Bins and Black Plan Paper—now ready<br /><br />\nTHE NEWS LETTER<br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br /><br />\n5 West Lexington Street,<br />\nn(ito)<br />\n(Loudon<br /><br />\nPRINTERS AND<br />\nSTATIONERS<br />\nBA LTI MORE<br />\nLight and Lombard Streets,<br /><br />\nFINEST PHOTOGRAPHIC<br />\nWORK IN THE CITY.<br /><br />\nWe carry a full line of Stwdents' Note Books and Stationery<br /><br />\nSpecial attention given to Holiday Work<br />\nand Groups, Class Pictures, etc.<br /><br />\nBoth 'Phones.<br /><br />"}], "field_media_file": [{"target_id": 36198, "display": null, "description": null, "target_type": "file", "target_uuid": "9ab6ce64-86d5-420f-8acc-1bf9eae356d9", "url": "http://digital.library.jhu.edu/system/files/2022-03/12184-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12184, "target_type": "node", "target_uuid": "e68ed1b0-d4b8-41ca-84e7-bdf285a0bd9e", "url": "/node/12184"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "1489846f-a7d9-4821-a69c-3837cf680b74"}]}