{"mid": [{"value": 39314}], "uuid": [{"value": "5cea9007-d237-44b6-b764-a259b70b0719"}], "vid": [{"value": 39314}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:27:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13917-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:27:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:27:31+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "LRPC Calls for Larger Grad Facilities<br />\nBy WILLIAM PATTEN<br />\nThis is the second in a series of articles on the<br />\nreport issued by the Long Range Planning Committee.<br />\n•<br />\n<br />\nThe Long Range Planning Committee has studied<br />\nGraduate studies at Hopkins in eight different fields<br />\nand has made recommendations and appraisals for<br />\nthe individual needs of each department. These areas<br />\nare: 1. Social Sciences 2. Humanities 3. Biological<br />\nSciences 4. Physical Sciences 5. Engineering Sciences<br />\n6. Earth Sciences 7. The Medical School.<br />\nThe problem that faces Hopkins is one of size. In<br />\nthe past we have been able to maintain excellent departments in spite of relatively small size. Today,<br />\nHopkins loses ground to other major universities, to a great extent, on account of inadequate resources<br />\nin both men and facilities. Much of the problem which<br />\nthe Committee describes stems from the necessity to<br />\nincrease size of the departments without injuring<br />\nthe school's academic excellence.<br />\nHUMANITIES, after long neglect, has been given<br />\ntop priority. Consequently much has already been<br />\naccomplished before the Committee's Report was<br />\never completed. Of a recommended 22 new positions,<br />\n21 have already been authorized by President Eisenhower. A new Humanities Center will offer opportunity for faculty to experiment in approaches to<br />\n<br />\nHumanities study, improve interdepartmental programs and attract new students and scholars. A<br />\nthree-year Ph.D. program in the English Department<br />\nis a bold experiment that, if successful, will be<br />\nadopted by other departments.<br />\nSeveral needs in the Humanities school remain to<br />\nbe settled. With increased faculty, the research facilities of the library will need improving. Secondly,<br />\nfinancial assistance for summer and sabbatical study<br />\nshould be provided by the University.<br />\nTHE SOCIAL SCIENCES will require new coordination between departments to offer stimulating<br />\nprograms and more extensive study.<br />\nIncreased staff will be required in all departments,<br />\nespecially Psychology and Social Relations. Eventually, with larger departments, an individual social<br />\nscience building will be required.<br />\nWith Hopkins situated so near to Washington, D.C.,<br />\nan excellent opportunity exists to initiate a \"National<br />\nPolicy Analysis Center\" in that city. This would be<br />\nmade available not only to Hopkins scholars but to<br />\nthe scholars of the nation as well. It would augment<br />\nHopkins' appeal to outstanding scholars.<br />\nThird, Hopkins must expand its areas of concentration. A crucial need is in the History Department<br />\nwhere there is little attention given to non-Western<br />\n<br />\ncivilizations. Oriental, Latin American and African<br />\nstudies are critically needed.<br />\nThe BIOLOGICAL, PHYSICAL, AND ENGINEERING SCIENCES have needs which are much in* common. New faculty must be added not only to existing<br />\nfields but in order to introduce new areas. Astrophysics, Particle physics and Geophysics must be included. New Laboratory facilities will consequently<br />\nbe needed.<br />\nTo compete with other leading universities Hopkins must place more emphasis on the theoretical<br />\nand experimental studies. To accomplish this, and because of an inordinate teaching load, thirty new positions must be added to the Physical Sciences faculty<br />\nalone.<br />\nAt the MEDICAL SCHOOL the training of Ph.D.'s<br />\nmust either be limited or better organized. If it is<br />\ndecided to adopt a sizable program then steps must<br />\nbe taken to heighten cooperation between Homewood and the Hospital, in schedules, facilities, and<br />\nadministration.<br />\nPOSTDOCTORAL studies should be given a much<br />\nclearer status within the Hopkins Community. Students doing research as associates, to gain recognition of their residence at Hopkins, should be organized into a society of Fellows, to perhaps do some<br />\nteaching yet lose none of their independence.<br />\n<br />\nitirttrr<br />\nVOL. LXX1, NO. 12<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, JANUARY 13, 1967<br />\n<br />\nMandelbaum Given<br />\nNew Appointment<br />\n<br />\nCouncil Wins 10%<br />\nBookstore Discount<br />\n<br />\nA $500,000 anonymous gift to came to Hopkins in 1957 as proSignificant changes in policies administration was very similar<br />\nestablish the Andrew W. Mellon fessor and chairman of the phiof the Hopkins bookstore will go to the one submitted by the StuProfessorship in the Humanities losophy department. He previinto effect February 1, 1967. dent Council in December. Bill<br />\nwas presented to the University ously had taught at Dartmouth<br />\nThe policy changes result from Reinsch, President of the StuCollege and Swarthmore College.<br />\nlaat week.<br />\nthe administration's acceptance dent Council, commented that<br />\nof a faculty committee's re- \"We are very pleased though<br />\nProfessor Maurice MandelIn addition to his duties here,<br />\nbaum of the Philosophy Depart- he is a consultant to the diport on the operations of the we would have liked some stument has been appointed to the vision of arts and humanities of<br />\nbookstore.<br />\ndent representation on the bookchair.<br />\nThe two most significant store committee.\"<br />\nthe U.S. Office of Education, and<br />\nHopkins President Milton S. is a member of the American<br />\nchanges will be a 10ç.i. discount<br />\nIn allowing a 10% discount,<br />\nEisenhower announced the re- Philosophical Association and<br />\non trade books for undergradu- the bookstore will now operate<br />\n*Apt of the gift following a the American Society for<br />\nates, graduate students and fac- on a break-even basis. The<br />\ndismeeting of the Board of Trus- Aesthetics.<br />\nulty members. In addition, a con- counts will effect all books<br />\nwhich<br />\ntee-s on Monday when formal actinuing<br />\ncommittee will be named the publishers allow a<br />\nMandelbaum was a Guggen35-40(:/0<br />\noeptance of the gift and an- heim Fellow in 1946 and,<br />\nto recommend policies and oper- discount. Text books, however,<br />\nbeappointment<br />\nnouncement of the<br />\nating procedures for the book- will not be discounted since<br />\nginning next July 1, will spend<br />\nthe<br />\nWas made.<br />\nstore. Dean Allyn Kimball of the publishers normally allow only<br />\na year at the Center for AdDr. Eisenhower expressed his vanced Study<br />\nFaculty of Arts and Sciences will a 20% discount on those<br />\nin the Behavioral<br />\nbooks.<br />\ngratitude to the unknown donor. Sciences at Palo<br />\nAlto completing<br />\nbe directly responsible for the Therefore, a text such as Sam\"We are indeed grateful to the a<br />\nbook on the history of 19th DR. MAURICE MANDELBAUM operations of the committee.<br />\nuelson's Economics would not be<br />\ngenerous donor, who prefers to Century<br />\nthought.<br />\nThe report accepted by the discounted but Thomas Hobbes'<br />\nremain anonymous, for this<br />\nLeviathan would. A text book is<br />\nmagnificent gift in honor of a<br />\nnot necessarily any book that<br />\nfamous American, and we are<br />\nis required for a course. Publishdoubly proud to be able to asers usually define textbooks as<br />\nsign this chair to one of the<br />\nthe hard-covered introductory.<br />\nUniversity's most distinguished<br />\nThe Baltimore Museum of Art's the back of the paper. The techRauschenberg studied at the<br />\ntype books.<br />\nacholars, Dr. Maurice Mandel- new<br />\nexhibit, \"Rauschenberg: nique has the illusionary effect<br />\nKansas City Art Institute, the<br />\nbaum.\"<br />\nIllustrations for Dante's Inferno\" of collage. The artist also uses<br />\nOn Trial Basis<br />\nAcademic Julien in Paris, with<br />\nComing at the height of a opened January 3 and will re- gouache, watercolor, cr<br />\nThe Committee report caua yo n,<br />\nfund raising drive aimed at main on view until January 29.<br />\nJosef Albers at Black Mountain tioned that the discount is on a<br />\nchalk, pencil, and erasures.<br />\nraising $4.5 million, Dr. EisenCollege, North Carolina and with one year trial basis depending<br />\nThe<br />\nexhibit<br />\nconsists<br />\nParticipated<br />\nShows<br />\nof 34<br />\nin Many<br />\nhower noted the special aid it<br />\nVaclav Vytlacil and Morris Kan- on whether or not the bookstore<br />\nRauschenberg has participated<br />\nsill provide \"to strengthen our drawings by Robert Rauschenbreaks even at the end of the<br />\nberg, a leading avant-garde art- in many important group shows tor at the Art Students League<br />\nposgrams in the humanities.\"<br />\nfiscal year Should the bookstore<br />\nillustrating<br />\neach<br />\nof<br />\nist,<br />\nthe<br />\ncanMellon<br />\npreviously, including \"Sixteen in New York.<br />\nlose money the discount would<br />\nAmericans\" and \"The Art of<br />\nAndrew Mellon was a famous tos of Dante's poem.<br />\nbe reduced in order to guaranDrawings in N.Y. Museum<br />\nAmerican financier who had<br />\nRauschenberg spent two and a Assemblage\" held at the Museum<br />\nHe had his first one man show tee the break-even principle.<br />\nModern<br />\nArt, New York, in<br />\nMajor interests in many Amen- half years in close study of the of<br />\nThe problem of cooperation<br />\nin New York in 1951 and has had<br />\nelan businesses and industries: work before doing the drawings 1959-60 and 1961 respectively.<br />\nbetween the faculty and the<br />\nmany since then in numerous<br />\nbanking, public utilities, coal, in 1959-60.<br />\nHe has participated in many<br />\nbookstore management was also<br />\ncities, including the 1960 showsteel,. and such firms as Gulf Oil<br />\nshows abroad, including \"Docuconsidered in the report. Among<br />\nInterpreting<br />\nDante<br />\ning of the Dante illustrations in<br />\nCompany and Aluminum Comthe points emphasized was the<br />\nAccording to the Baltimore menta II\", Kassel, Germany; \"V New York.<br />\npany of America.<br />\nPaulo,<br />\nBienal\",<br />\nSao<br />\nBrazil;<br />\n\"I<br />\nneed for the faculty to submit<br />\nHe resigned in 1921 as pres- Museum of Art the artist has atBiennale de Paris,\" all in 1959;<br />\nThe Dante drawings were re- \"in good time\" the lists of reident of the Mellon National tempted \"to interpret Dante's<br />\nAmericans\", Stockholm, Am- cently given to the Museum of quired and recommendea books<br />\n\"4<br />\naction<br />\nand<br />\nthought<br />\nthrough<br />\nsymBank to become U.S. Secretary<br />\nof the Treasury. He held that bols taken from modern life.\" sterdam, and Bern in 1962; and Modern Art by an anonymous for the various courses. This was<br />\nposition until 1931 serving un- Dante's imagery is translated by the \"XXXI Biennale,\" Vienna, donor. The exhibit, which is also a major point in the Stutravelling to a number of citie, dent Council's report.<br />\nder President Harding, Coolidge, modern symbols such as racing 1964.<br />\nis directed by .William S. Lieber-cars, athletes, warriors in gas<br />\nShould Not Subsidize<br />\nand Hoover.<br />\nReceived Award in Venice<br />\nIn reference to fiscal policies,<br />\nMellon, on his death, left $10 masks as well as abstract<br />\nThe artist was recently award- man, Curator of Drawings and<br />\nmillion to found the Mellon In- equivalents for the emotional ed the first prize for painting at Prints at the Museum of Modern the committee said that the UnArt, New York.<br />\niversity should not subsidize the<br />\nstitute in Pittsburgh; while Impact of sounds and smells.\"<br />\nthe \"XX.XII Biennale\", Venice.<br />\nThe transfer technique, which He has also received the first<br />\nSother gifts helped to create the<br />\nRauschenberg was commission- bookstore especially at the exNational Gallery of Art in Wash- Rauschenberg has pioneered, is prize at the \"Fifth International ed by Life magazine last year to pense of another part of Unievident in the drawings. The Exhibition of Prints\" in Ljubl- do a piece on Dante's Inferno. versity activity. The report said<br />\nington. He died in 1937.<br />\nPhilosopher's Studies<br />\ntechnique involves placing pho- jana, Yugoslavia, in 1963 and the The result was a full color fold- that \"charges made to the<br />\nProfessor Mandelbaum is one tographic reproductions against Chara Museum Prize at \"Third out in the magazine depicting bookstore should be based diof the leading philosophers in moistened areas of drawing paper International Biennale of Prints\" modern horrors and entitled rectly on cost, as nearly as<br />\nthis<br />\nthe United States today. He and transferring it by rubbing held in Tokyo in 1962.<br />\n\"Modern Dante's Inferno.\"<br />\n(Continued on Page 3)<br />\n<br />\nMuseum Displays Avant-Garde<br />\n<br />\ns<br />\n<br />\n71ST YEAR<br />\n<br />\n\fPAGE TWO<br />\n<br />\nNEWS-LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br />\n<br />\nLearned Societies Council VirginiaDean Chosen<br />\nGoucher President<br />\nTo Hold Symposium Here<br />\nA humanities symposium will<br />\nbe conducted by the American<br />\nCouncil of Learned Societies in<br />\nconnection with the new Hopkins Humanities Center at the<br />\nUniversity January 20.<br />\nThe Society is a private nonprofit federation of thirty-two<br />\nnational scholarly organizations<br />\nconcerned with the humanities<br />\nand the humanistic aspects of<br />\nthe social sciences.<br />\nDr. Charles S. Singleton, professor of humanistic studies and<br />\ndirector of the Center, will welcome the:delegates.<br />\nThe Hopkins Center offers an<br />\nInterdisciplinary approach to<br />\nhumanistic studies at all academic levels, including a program at the post-doctoral level.<br />\nDr. Craig R. Thompson, professor of English literature and<br />\nhistory at Haverford College,<br />\nwill be the symposium chairman.<br />\nDr. Erwin Panofsky, Professor<br />\nEmeritus at Princeton's Institute for Advanced Study and an<br />\nauthority on iconology, medieval,<br />\nRenaissance and baroque art,<br />\nwill speak on \"Erasmus of Rotterdam and the Visual Arts.\"<br />\n\"The Continuity of Erasmus\"<br />\n<br />\nCampus Notes<br />\nPeace Corps Exam<br />\nThe Peace Corps exam will be<br />\ngiven Tuesday, January 17, 1967,<br />\nin Room 201 of the Classroom<br />\nBuilding at 4 P.M. The exam<br />\nwill be administered only to persons who have either held a degree or are currently enrolled<br />\nIn a degree granting program,<br />\nand have completed the Peace<br />\nCorps Application Questionnaire.<br />\nPeace Corps Application Questionnaires are available at the<br />\nPeace Corps Office, located<br />\nin the ground floor of Shriver<br />\nHall. They must be submitted<br />\neither to the Peace Corps, Washington, D.C. 20525 or to the<br />\nCampus Peace Corps Office before the test date.<br />\n<br />\nFebruary Graduates<br />\nSeniors who plan to graduate in February must notify the<br />\n• Office of Undergraduate Studies,<br />\nGilman 238, January 18, 1967.<br />\n<br />\nS.C. Shipwrecked<br />\nThe Shipwreck Ball which was<br />\nscheduled to be held tomorrow<br />\nevening has been cancelled. The<br />\nDSRC found that a dance at that<br />\nparticular time would attract a<br />\nvery small number of couples.<br />\nThe SC, which was to co-sponsor the event, was quite perturbed<br />\nby the DSRC's decision.<br />\nThe next big, big dance to be<br />\nheld will be the Slalom Ball on<br />\nFebruary 10 at the Lord Baltimore Hotel. Tickets for this annual event will be going on sale<br />\nIn the near future.<br />\n<br />\nBridge Club<br />\nThe Johns Hopkins Duplicate<br />\nBridge Club will meet every<br />\nSunday at 1:30 P.M. in Levering<br />\nHall. This Sunday will be the<br />\nfirst full Master Point game.<br />\nWinners receive their entry<br />\nmoney back (50 cents) or a<br />\nfree entry to a future game.<br />\n<br />\nArt Exhibit<br />\nAn Art Exhibit of Established<br />\nMasters will be held in the Eisenhower Library early in January.<br />\nThe exhibit is to be sponsored by<br />\nthe Committee to Rescue Italian<br />\nArt and its chairman, John White,<br />\nProfessor of Art History at Hopkins.<br />\nAll students who possess works<br />\nof art by recognized masters,<br />\nboth past and present, are requested to contact either Gabe<br />\nWeisber or Frank Kowlsky of the<br />\nArt Department in order to lend<br />\nexamples to the show.<br />\n<br />\nwill be the subject of Dr. Roland<br />\nH. Bainton, Professor Emeritus<br />\nof ecclesiastical history at Yale<br />\nUniversity.<br />\nSir Roger Mynors, Corpus<br />\nChristi professor of Latin at Oxford University, will speak on<br />\n\"Erasmus and the Classics\", and<br />\n\"De Moths Disputancli: The<br />\n<br />\nApologetic Works of Erasmus\"<br />\nwill be the title of a talk by Dr.<br />\nMyron Piper Gilmore, the Director of Villa I Tatti in Florence and professor of history at<br />\nHarvard University.<br />\nThe symposium will be held<br />\nIn Shriver Hall and is open to<br />\nthe public at no charge.<br />\n<br />\nDr. Marvin B. Perry, Dean of<br />\nAdmissions and Professor of<br />\nEnglish at the University of Virginia has been named as President of Goucher College.<br />\nThe announcement was made<br />\nlast Saturday by Judge Roszel<br />\nC. Thomas, chairman of the<br />\nGoucher Board of Trustees. Dr.<br />\nPerry will succeed Dr. Otto F.<br />\nKraushaar who is retiring in<br />\nJune of this year. .<br />\nTamara Dahn, editor of the<br />\nGoucher Weekly, stated that<br />\nthe new President comes to<br />\nGoucher with a view that its<br />\nproblems do not differ significantly from any small liberal<br />\narts institution.<br />\n<br />\nNoted Author<br />\n_Dr. Perry is a noted author<br />\nand educator. He received his<br />\nPh.D. from Harvard in 1950 and<br />\nserved as an instructor there<br />\nuntil the following year.<br />\nDr. Perry has no set aims and<br />\nplans for his new position. He<br />\n<br />\n\"AND HERE'S ONE FOR YOU\" — President Milton Eisenhower<br />\ndistributes Distinguished Military Student awards to six Hopkins'<br />\nseniors at his executive office in the Homewood House. Only 10%<br />\nof each year's graduating class gets the honor. The Hopkins ROTC<br />\nhas 17 seniors this year. Souvenir pens were distributed after the<br />\nceremony. Left to right: Steve Mason, Mike Haas, Piece of Paper,<br />\nDr. Eisenhower, Alex Davidoff, Bob Ottesen, Vaughen Stelzenmuller, and Sam Bunge.<br />\n<br />\nhopes to develop all areas of<br />\nstudies equally in increasing the<br />\nacademic excellence of the<br />\nschool.<br />\nAsked about Hopkins-Goucher<br />\nrelationships by the Goucher<br />\nWeekly, the new president expressed a desire to increase interactions between the two institutions.<br />\n<br />\nDR. MARVIN PERRY, JR.<br />\n<br />\nthurs.,<br />\nfri., &<br />\nsat.<br />\n'til 9.<br />\n<br />\nitadel<br />\npeter's frat jacket<br />\nlined for fall and<br />\nwinter, washable,<br />\nwater-repellent in<br />\nnavy and off white,<br />\n14.95<br />\n<br />\nFor interesting, informative reading on<br />\nand off the campus...<br />\n<br />\nTHESE PENGUINS<br />\nCAN'T BE BEAT!<br />\n<br />\nunlined, in 5 colors<br />\n11.95<br />\n<br />\nhen's<br />\n<br />\n•<br />\n<br />\nThese a're the Penguins that are in on campuses all over America. You'll find them in at your local college :bookstore, too.<br />\nPick up a couple today.<br />\nTHE ACCIDENTAL CENTURY. Michael Harrington. The author, whose widely read and discussed book, THE OTHER<br />\nAMERICA (also available in a Penguin paperback) stirred the<br />\nnation to action against poverty, turns now to the cultural<br />\nand intellectual crisis confronting the U.S.. and the rest of the<br />\n$1.25<br />\nWestern world in the 20th century.<br />\nOPINIONS AND PERSPECTIVES.Edited by Francis Brown. A<br />\ncollection of the most memorable essays to appear in The New<br />\nYork Times Book Review during the past decade. Contributors<br />\nInclude: James Baldwin, Lawrence Durrell, Leon Edel, Maxwell Geismar, Sean O'Faolain, Alfred Kazin, Robert Graves,<br />\n$2.23<br />\nSaul Bellow.<br />\nTHE GREAT SALAD OIL SWINDLE. Norman C. Miller. The<br />\namazing story of Tine De Angelis.(\"Put an apron and a clief's<br />\ncap on him and he would have looked right baking pizza,<br />\ndeadpan in the window of a little Italian restaurant.\") His<br />\nmanipulations of millions of gallons of nonexistent salad oil<br />\ncreated financial chaos in many quarters here and abroad.<br />\n$1.25<br />\nSEX AND THE SIGNIFICANT AMERICANS: A Study of<br />\nSexual Behavior Among the Affluent. John F. Caber and Peggy<br />\nB. Harroff. A report on yesterday's college students who are<br />\ntoday's affluent, influential opinion-makers. Based on 437<br />\nIn-depth interviews, this fascinating account reveals how<br />\nthese men and women feel and act with regard to marriage,<br />\npremarital sex, married love and extramarital relationships.<br />\n$1.25<br />\n<br />\nPENGUIN BOOKS INC<br />\n3300 Clipper Mill Road<br />\n<br />\nBaltimore, Md.21211<br />\n<br />\nPENGUIN BOOKS<br />\nAVAILABLE AT<br />\n<br />\nJOHNS HOPKINS<br />\nUNIVERSITY<br />\n<br />\nCHARGE IT:<br />\n<br />\nMEN'S WEAR<br />\n516 S. Broadway<br />\n<br />\nYou Won't Want To Miss The<br />\n<br />\nPremiere Jazz Festival,1<br />\nSUNDAY, Jan. 15th<br />\n8:00, Baltimore Civic Center<br />\nFeaturing:<br />\nMr. \"Take Five\" Dave Brubeck and<br />\nhis Quartet<br />\nComedian Dick Gregory<br />\nArthur Prysock<br />\nThe \"Wac-Wac boys,<br />\nYoung Holt Trio<br />\n(formerly with Ramsey Lewis)<br />\nThe Staple Singers<br />\nBlues Singer<br />\nBig Maybelle<br />\n\"Dont Pass Me By\"<br />\n\"96 Tears\"<br />\nRockin' Robbin<br />\nWEBB Soul Ranger, M.C.<br />\nTickets can be purchased at Your Record Shops<br />\nor at the Baltimore Civic Center Box Office.<br />\n<br />\nTickets $4-$3-$2<br />\na presentation of Premiere Attractions, Inc.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br />\n<br />\nNEWS -LETTER<br />\n<br />\nCouncil Wins 10%<br />\nBookstore Discount<br />\n<br />\nrritag Vag Kihrratitt<br />\n<br />\n•<br />\n<br />\nBy WILLIAM FATTEN<br />\nPresident Johnson began his<br />\nState of the Union address with<br />\nvery little on his side. He never<br />\nlooks well on television and<br />\nwhatever the merits of his<br />\nspeech, his delivery could be<br />\ncounted on to butcher it. For<br />\nmonths discussion of a \"credibility gap\" had created a skeptical and critical audience. His<br />\nbeloved polls had been sliding for<br />\nsome time.<br />\nHowever, I believe that anyone that refused to endure<br />\nall these discomforts did not<br />\nonly himself but his President a disfavor. Regardless of<br />\nwhat emerges from all the rhetoric (if you will) the State of<br />\nthe Union Address presents a<br />\nvaluable look at the position of<br />\nour President.<br />\nIn our current readiness to<br />\ndebunk Lyndon Johnson, we may<br />\nhastily mistaken a well-intended<br />\ncandor for a lack of oratorical,<br />\nor even linguistic, talent. It<br />\nseems to me that Mr.'Johnson<br />\nspoke directly to each issue mentioned. The speech lacked much<br />\nof the \"apple pie and mother\"<br />\nappeals, that the President is<br />\nusually quick to disgorge when<br />\nacumen and honesty are demanded of him.<br />\nTo espouse a tax hike over national Prime Time, two years,<br />\nafter hailing his tax decrease as<br />\na sign of the good times ahead,<br />\nrequired political gut. More especially since the 6% sur-charge<br />\nwill be addressed specifically to<br />\na policy of his own that has<br />\naroused considerable debate and<br />\npolitical risk.<br />\nSecondly, in his discussion of<br />\nthe Vietnam War. Johnson refrained from depicting the rosy<br />\npicture that he so often invokes<br />\nfor his Great Society. As Eric<br />\nSevareid observed, the President<br />\nwas \"depressing\" on the issue<br />\nof the war. He made it clear<br />\nthat while he was President we<br />\nwould endure in Vietnam even<br />\nthough it could take decades.<br />\nFor Prime Time television this<br />\nis a very courageous statement.<br />\nA less obvious indication of<br />\n<br />\nthe President's candor are the<br />\nnumerous issues which he omitted altogether from the 1967<br />\nversion of the Great Society. To<br />\navoid civil rights, for instance,<br />\nfrom the usual panacea was not<br />\nonly politically dangerous but out<br />\nof character. Similarly, he restrained from promising an antimissile defense system that<br />\nwould of course be superior to<br />\nwhatever the Russians might<br />\nhave. This is the reverse of the<br />\nestablished tendency to offer<br />\nsomething for anybody and anything.<br />\nThe fact that Lyndon Johnson was candid for \"one brief<br />\nshining moment\" how eve r,<br />\nshould not cloud the content of<br />\nthe Address, which was the<br />\nState of the Union. If the man<br />\nwas honest with us he can still<br />\nbe in the'wrong. Three questions<br />\nwhich might arise from the talk<br />\nare basic.<br />\nThe first of these concerns<br />\nJohnson's persistent plea for<br />\npartnership in governmen t.<br />\nWhether this was a pipedream or<br />\na serious conviction, it runs<br />\ncounter to every principle on<br />\nwhich our government has persisted. The strength of federalism is the opposition of interdependent elements. While Congress has never recovered from<br />\nthe executive monolith of Frank-<br />\n<br />\nPAGE THREE<br />\n<br />\nlin Roosevelt's Administration, to<br />\nconceive of total cooperation and<br />\ncentralization in our government,<br />\nas Lyndon very well may, is dangerous.<br />\nConcerning Vietnam, Johnson<br />\nseems confused. The fight<br />\nagainst Communism in the hinterland will be an American responsibility. The erection of a<br />\nstable government in South Vietnam will remain a Vietnamese<br />\nconcern. Judging from our record<br />\nof success in either attempt and<br />\nfrom the original objectives with<br />\nwhich Mr. Dulles embroiled us in<br />\nthe war, the President might<br />\nhave confused not only the<br />\nAmerican role but the necessary<br />\npriorities.<br />\nDespite the Immediate issues<br />\nthat will be faced in the next<br />\ntwo years, President Johnson's<br />\naddress affords comfortable relief<br />\nwhen it is remembered that just<br />\nten years ago the President of<br />\nthe United States was espousing<br />\n\"massive retailiation\" against<br />\nCommunist aggression, \"tactical\"<br />\nnuclear bombing for the security<br />\nof Formosa and the \"encirclement\" of Soviet Russia. If Lyndon Johnson is at times befuddled by criticism and over-anxious to implement his sincere<br />\nconvictions, it is not necessarily<br />\nimplied that he is intentionally<br />\ndeceptive.<br />\n<br />\n(Continued from Page 1)<br />\nis practicable, without either<br />\nhidden subsidies being paid by<br />\nthe University or hidden profits accruing to the University?'<br />\n\"This problem stems from the<br />\nCouncil's statement that the<br />\nUniversity was using bookstore<br />\nprofits to subsidize less profitable undertakings. The committee, however, stated that \"in<br />\ncertain respects, we are convinced that the past and present accounting procedures do<br />\nnot entirely reflect this point<br />\nof view.\"<br />\nDr. Milton Eisenhower, commenting on the report, explained<br />\nthat the faculty discounts were<br />\noriginally instituted because salaries were low and tuition for<br />\nstudents was not high. But now<br />\nwith rising tuition, Dr. Eisenhower felt strongly that a student discount was necessary. He<br />\nadded that he was \"extremely<br />\npleased\" with the faculty report.<br />\nThe so-called bookstore controversy was initiated last year<br />\nby a. series of editorialS and articles in the Newsletter calling<br />\nfor a study of bookstore policy.<br />\n<br />\nAt the end of the previous academic year, the Student Council<br />\nappointed Jim Jacobs to do a<br />\nstudy of the situation: Jacobs<br />\nsubmitted his report to the<br />\nCouncil in December which then<br />\nasked the administration to<br />\nstudy it. At the same time, a<br />\nfaculty committee under the direction of Dr. Owen Phillips,<br />\nProfessor of Geophysical Mechanics, undertook their own<br />\nstudy of the situation. Their report was the one which the administration accepted. It should<br />\nbe noted that the faculty report<br />\ncontained the same financial<br />\nrecommendations as the report.<br />\nof the Student Council.<br />\nMembers of the faculty committee. included, John Bertha\",<br />\nthe Johns Hopkins Librarian, Dr.<br />\nJohn Gryder, Associate Professor of Chemistry, Dr. Richard<br />\n1VIacksey, Dean Richard Mumma<br />\nof the Evening College, Dean<br />\nRobert Strider, Associate Dean<br />\nfor Administration, Dean Carl<br />\nSwanson, Associate Dean for<br />\nUudergraduate Studies, and Dr.<br />\nPhillips.<br />\n<br />\n* * * * * * * *<br />\n<br />\nNEED A<br />\nNEW HOME!<br />\n<br />\nWhen you're in the party<br />\nmood<br />\nMake it nice 'n easy with<br />\nHarry Little food<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n<br />\ntwo reasonably wellbehaved cats looking for a<br />\nnice home. We are 6 mo. old<br />\nand housebroken. The male<br />\nis pinkish tan; the female<br />\nblack with brown and orange<br />\nmarkings.<br />\nWe are<br />\n<br />\nSubmarines • Pizza<br />\nSpaghetti • Sour Beef<br />\n<br />\n3320 Greenmount Ave.<br />\nCARRY OUT SERVICE<br />\n<br />\nSPAGHETTI MEALS<br />\n<br />\nCALL 889-3831<br />\n<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\nWe are accustomed to students and tolerate them very<br />\nwell.<br />\n<br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br />\n<br />\nColl Max<br />\n467-9262<br />\n<br />\nSAMPLE-STORE'S SENSATIONAL<br />\n* * * * * * * *<br />\n<br />\nDOLLAR DAYS SALES<br />\n<br />\n$1<br />\n<br />\nCoinplete Bachelor<br />\nService<br />\n<br />\nELECTRICAL ENGINEERS<br />\nMECHANICAL ENGINEERS<br />\nPHYSICISTS<br />\n<br />\n• SPORT COATS • SUITS<br />\n• DRESS SHIRTS • JACKETS<br />\n• SPORT SHIRTS<br />\n<br />\nNorden<br />\nwill<br />\nbe on campus<br />\nJanuary 20, 1967<br />\n<br />\nWhen You Buy One At<br />\nOur Regular Low Price<br />\n<br />\nFLUFF DRY & FOLD<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nAMPLE<br />\n<br />\nS<br />\n<br />\nWaverly Laundromat<br />\n<br />\n3031 Greenmount<br />\n<br />\nTORE<br />\n<br />\n3330 GREENINIOUNT AVE.<br />\n467-2123<br />\n<br />\n(Friday)<br />\n<br />\nOnly A Few Blocks From<br />\nThe Hopkins Campus<br />\n<br />\nGraduating Electrical Engineers, Mechanical Engineers<br />\nand Physicists are invited to discuss career opportunities<br />\nin research, design. development and manufacturing in<br />\nareas such as:<br />\nAirborne Radar Systems / Video Display Systems / Solid<br />\nState Device Development / Precision Components /<br />\nAdvanced Computer Techniques / Advanced Electra.<br />\nmechanical Design Techniques<br />\n<br />\nOpen Every Evening<br />\n<br />\nNorden's location in Norwalk, Connecticut is easily as.<br />\ncessible to the entire New York metropolitan area.<br />\nFor convenient appointment, please make arrangements<br />\nin advance through your Placement Office.<br />\n<br />\nNorden<br />\n<br />\nHOPKINS IS FINDING OUT THAT MEALS<br />\nARE BETTER AND CHEAPER AT . ..<br />\n<br />\n\"Song and Prayer for<br />\nChristian Unity\"<br />\nAn Ecumenical Service<br />\nSpeaker: Rev. John Vannarsdall<br />\n<br />\n32ND & OLD YORK ROAD<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\nChaplain, Gettysburg College<br />\n<br />\nEpiscopal Cathedral<br />\n<br />\n1.95<br />\n<br />\nUnited<br />\nAircraft<br />\n<br />\nAn Equal Opportunity Employer (M&E)<br />\n<br />\nHARLEY'S<br />\nTIDEWATER FARMS<br />\nWITH<br />\nSALAD,<br />\nFR. FRIES<br />\n<br />\nCINVIS1044<br />\n<br />\nFRESH<br />\nBREAD & BUTTER<br />\n<br />\nUniversity and N. Charles<br />\nSponsored by<br />\n<br />\nHARLEY OWNED & OPERATED<br />\n<br />\nThe Episcopal, Lutheran, illethodim and<br />\nRoman Catholic Student Groups af<br />\nJohns Hopkins Univerit)<br />\n<br />\nALSO SANDWICHES, CHILI<br />\n<br />\nALL WELCOME!<br />\n<br />\n-4(<br />\n<br />\n-4( 4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n-0(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\n4(<br />\n<br />\nSUNDAY, JANUARY 15th<br />\n<br />\n7:30 P.M.<br />\n<br />\n\fAEWS-LETTER<br />\n<br />\nPAGE FOUR<br />\n<br />\n1:ipkitts littmi-trittr<br />\nEditors-in-Chisf<br />\nMelvin R. Shuster<br />\n<br />\nHenry 1. Korn<br />\nBusiness Managers<br />\nAllan Elide)!<br />\n<br />\nWilliam Z. Schenck<br />\n<br />\nCoarse Offering<br />\nWith this week's release of the second semester<br />\ncourse schedule, the Hopkins student was once again<br />\nforced to find new, desirable and non-conflicting courses<br />\nin an offering consisting of little originality and poor<br />\nscheduling.<br />\nIt is difficult to blame any one sector of the university for this condition. The Registrar's Office, most<br />\noften the scapegoat, faces a monumental task every<br />\nsemester in scheduling classes of both diverse and correlative natures to the satisfaction of each department,<br />\neach faculty member and each student. The difficulty of<br />\nthe job is compounded when the registrar follows the<br />\ntraditional practice of scheduling low level courses in<br />\nthe morning, labs and electives in the afternoon. The<br />\nRegistrar's Office, responsible to both the faculty's and<br />\nthe students' needs and desires, has limited alternatives in determining the best schedule for each.<br />\nMany faculty members have other obligations than<br />\nteaching at Homewood and because of this can only<br />\nmeet classes one or two days a week. Also, the faculty,<br />\nwith demands and pressures for publishing, must be<br />\nable to choose when they most desire to have classes<br />\nBO their teaching obligations can be met without greatly<br />\ninterfering with their other commitments. Johns Hopkins, established along the lines of the nineteenth century German university, was imbued from the start<br />\nwith the concept of \"lehrfreiheit\"—or academic freedom. Under this system, a professor ideally teaches<br />\nwhat and when he wants, with the assumption that he<br />\nwill be a more effective teacher because he is free to<br />\nsay or do what he pleases. Because this is an ingrained<br />\nbelief at Hopkins-e--and academic freedom has proved<br />\neffective here--there must he no governing power over<br />\nthe faculty dictating what and when it must teach.<br />\nThe students, however, have the explicit right to<br />\ndemand that any wrongs—even if they only seem to<br />\nbe wrong to the students—be examined and rectified if<br />\nthey actually are found to be wrong. This right, \"lehrenfreheit\"—the other half of academic freedom—must<br />\nbe guarded constantly and diligently by the student<br />\nbody, just as the rights of the faculty must be guarded.<br />\nWhere various academic departments at Hopkins<br />\ndeserve the greatest criticism is in their course offerings. The foreign languages, although not a common<br />\nmajor, consistently has a poor and repetitious selection<br />\nof courses beyond the elements. For example, German<br />\noffers one course in literature next semester, while<br />\nFrench has three, only one of which has not been taught<br />\nin the last two years. Political Science, one of the most<br />\npopular majors, offers a mere four courses, as compared to eleven courses offered in that department in<br />\nthe second semester last year. Of all the humanities departments only history has taken an initiative in expanding its program and in starting new courses, notably<br />\n\"The Negro in America\" and \"Germany since 1870.\"<br />\nThe problem of sparse course offerings is due<br />\nsimply to a shortage of professors; an overload of work<br />\nfor any one professor does mere ultimate harm than<br />\ngood for the student.<br />\nConflicts among desired courses are unavoidable to<br />\nsome degree in any large university, but a student<br />\nshould never have to be beset with as many conflicts as<br />\nhas been the case in recent years. It is difficult to find<br />\na solution; perhaps a computer could determine the<br />\nbest of all possible combinations, that which is most<br />\nserviceable to both students and faculty. Perhaps a<br />\nchange in the weekly schedule with more two-hour<br />\ncourses in the 300 level and one-hour-and-fifteen minute courses twice a week in the lower level. If rooms are<br />\navailable, some higher level courses could meet in the<br />\nevening.<br />\n<br />\nBefore any reforms in the system can he made,<br />\nit is up to the Registrar's Office to find out exactly how<br />\nmany students have been affected and to what extent<br />\nconflicts have arisen. The Registrar's Office, as the organizing body in the University, must take a more active<br />\npart in finding where the problems lie and then in<br />\nameliorating them.<br />\n<br />\nExtravagant Praise Dept.<br />\nHurray for the News-Letter that inspired the Reinsch<br />\nwho prodded the Council that frightened the Faculty who<br />\npushed the Administration to junk the house that Vayne<br />\nbuilt.<br />\nJust under a year ago the News-Letter inaugurated<br />\nthe campaign to reform the Bookstore. Its resolution is<br />\na fair one, the bookstore will now be faculty controled<br />\nand students will receive 10% discounts on all but<br />\nformal textbooks.<br />\nIncidental apologies are due Mr. Vayne who served<br />\nas everybody's whipping boy during the high days of<br />\nthe crisis. The News-Letter would like to retract its<br />\nopinion that he is a menace to Western Civilization.<br />\n<br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br />\n<br />\nThe Fall of Adam, 1967<br />\nBy GERALD BRECHER<br />\nNotwithstanding Adam Clayton Powell's perhaps extravagant<br />\nrhetoric after the events of Monday and Tuesday of this week, it<br />\nis still possible to take a view of<br />\nhis situation that may hopefully<br />\navoid extreme positions on either<br />\nside.<br />\nBut then, Adam Clayton Powell<br />\nis an extravagant man, and for<br />\nhis extravagance he is being laid<br />\nlow. When such a man is humbled<br />\nit is too easy for the humblers to<br />\ngloat obscenely, and for the humbled to lash out unreasonably in<br />\npitiful display of a loss of honor.<br />\nBlow to Pride<br />\nAdam Powell has suffered more<br />\nthan mere political setback; he<br />\nhas been dealt as devastating a<br />\nblow to his pride as to his political power. For to a man such as<br />\nPowell, pride is measured in less<br />\nmundane terms than mere voting<br />\npower or the ability to distribute<br />\npatronage.<br />\nTo Powell, who as a young<br />\nchild in Harlem was beaten by<br />\nthe Irish for being too dark, and<br />\nby the Negroes for being too<br />\nlight, pride is measured in the<br />\nseemingly imperceptible, yet terribly significant quivers of uncertainty and anxiety that men—<br />\nboth white and black—must evidence before him. Pride is embodied in the certain knowledge that<br />\nhe, Adam Powell, is on top of<br />\nthose who would put him down.<br />\nKnocked Down<br />\nToday, Adam Powell has been<br />\nknocked down. And because<br />\nAdam Powell is a fighter bred to<br />\nno small degree in a far more<br />\nsavage world than we could care<br />\nadmit exists, we shall not see<br />\nAdam Powell snivel and whimper.<br />\nPowell's sneering retorts to his<br />\ntormentors are not the pitiful<br />\nwhines of a man who knowing he<br />\nis down consents to stay down<br />\nand kicked some more. Adam<br />\nPowell's honor, curious as it may<br />\nseem to those of \"gentler breeding\", is not to be satisfied by<br />\n<br />\nsilent suffering. His pride is not<br />\nAdam Powell would still be the<br />\nto be assuaged by quiet accept- \"flamboyant\" playboy of Congress<br />\nance of his defeat.<br />\nif he hadn't gotten hung up on<br />\nAdam Powell fights back, with that slander charge. But in full<br />\nhis greatest weapon; his almost view of the public, his refusal to<br />\nawe inspiring tongue. Adam Pow- pay—to even acknowledge his<br />\nell at full stride into an address guilt—these were unpardonable<br />\nof significance is a magnificent sins.<br />\nexhibition of the power of human<br />\nPrideful Soul<br />\nspeech to seize upon the mind<br />\nAnd so not for his mis-use of<br />\nand clamp down upon the con- committee funds, and not for missciousness with a golden toned use of his chairman's power—but<br />\ntorrent of words. And these are for getting his prideful soul emnot just dead words and phrases broiled within the glaring view<br />\nthrown at us—these words come of a baleful public, Adam Clayton<br />\nalive with the many nuances of Powell this week is a beaten man.<br />\ninflection that Adam Powell<br />\nThere are too many skeletons<br />\nthrows into his delivery. Powell in Capitol Hill closets to mainis truly of the golden tongued tain with any honesty that Powschool of oratory, and I do not ell's demise is a direct result of<br />\nthink that his voice shall be his committee irregularities. But<br />\nstilled for long.<br />\nonce he exposed himself in the<br />\nJames case, he could no longer<br />\nVocal Undoing<br />\nIronically, perhaps with some claim that special privilege that<br />\nsense of divine justice, Powell's is the politicians to have fiscal<br />\ngreatest strength, his voice, misdeeds hidden from view.<br />\nproved to be his undoing in the<br />\nNegroness<br />\nend. When Adam 'Powell called<br />\nHad Adam Powell been white<br />\nEsther James—Harlem cleaning there is legitimate question<br />\nwoman—a bag woman, a graft whether any of thiS would have<br />\ncollector for the police in 1964, transpired. There is no certainty<br />\nhis luck ran out on him. Strapped to this, but let there be no doubt<br />\nwith a judgement from the court that it is of major importance in<br />\nof close to fifty thousand dollars, this inestance. It is too much to<br />\nPowell chose to ignore the order. ask that we divorce Adam PowPerhaps he should have paid; ell's avowed color from our<br />\nheaven knows the money—if it minds when we take the whole<br />\nwas not there—could have been matter under consideration.<br />\nraised. Adam Powell's people<br />\nAdam Powell, who 'passed' his<br />\nhave been known to support him way through college, and who<br />\nfinancially in the past. Adam could do so npw, chose to live the<br />\nPowell is no pauper. Had he paid, evident lowness of the Negro<br />\nthere is no question but that the life, and climb above it, not as<br />\nactions of this week would never an 'Uncle Tom' as in the case of<br />\nhave transpired.<br />\nthe new senator from Massachusetts, but as 'Whitey's nemesis.<br />\nNo Graft Hanging<br />\nBut political graft is not And it is too much to assume<br />\nenough to hang a man for in this that it is not Whitey who is putcountry—too many would hang; ting Adam down.<br />\nAdam Powell kept the faith. If<br />\nand those who wanted Adam<br />\nPowell's hide tacked up on a wall he did not spread it gently, he is<br />\ncould never get to him without a paying for it now. Do not gloat<br />\ngood enough excuse. Adam's over this fall of Adam. It may<br />\ncrack at a tired old cleaning perhaps in some sense of abwoman gave them their chance. stract morality be right; but ConAnd vultures that they are, they gress this week has done an<br />\nhave moved in to strip his bones. unwise thing.<br />\n<br />\nBook Review<br />\n<br />\nA Ternoignage of Suffering?<br />\nBy MENACHEM ROSENSAFT<br />\nA survivor of the Nazi death<br />\ncamps recently went to the Soviet Union to see for himself if<br />\nthe rumors on the desperate<br />\nstate of Russian Jewry were<br />\ntrue. He knew that there were<br />\nonly two possibilities: Either<br />\nthe entire situation was greatly<br />\nexaggerated, or else, the truth<br />\nwas even more terrible than the<br />\nrumors indicated. He had to<br />\nfind out.<br />\nThe result of his trip, or of<br />\nhis pilgrimage, for it can be<br />\ncalled that, were first a series<br />\nof articles in one of the biggest<br />\nIsraeli newspapers. They were<br />\nthen published as a book in<br />\nParis, and, late in 1966, an English translation of that work<br />\nappeared in the United States.<br />\nIn his introduction to Thp<br />\nJews Of Silence, (Published by<br />\nHolt, Rinehart and Winston;<br />\ntranslated with an Afterward<br />\nby Neal Kozodoy) the author<br />\nexplains his mission: \". . . I act<br />\nas a witness, and my responsibilities are limited to those of<br />\na witness. I went to Russia<br />\ndrawn by the silence of its Jews.<br />\nI brought back their cry.\"<br />\nIn Russia, he did not interview<br />\ncountless officials and leaders of<br />\nthe community, as is the fashion;<br />\nhe was not interested in hearing<br />\nthe stereotype words of the appointed mouthpieces; he did not<br />\nsearch for possible solutions and<br />\nremedies. Rather, he watched.<br />\nHe found that his greatest<br />\nfears were realized, for the persecution of the Jews in Russia<br />\nIs not a physical one. It is a<br />\n<br />\npolicy of assimilating by force,<br />\nof choking any breath of identification with Judaism in the<br />\nyoung. Synagogues still exist,<br />\nbut the Jews are discpuraged<br />\nfrom going. No new prayer books<br />\ncan be published, as is permitted<br />\nto the Christian churches. But<br />\nnevertheless, there is life. In<br />\ntheir passports, they have to<br />\nhave a stamp indicating their<br />\nreligion; they cannot teach the<br />\nhistory of their faith in the<br />\nlanguage of their past; and they<br />\npersist. They refuse to let themselves be liquidated. They defy<br />\nlogic and reason, and continue<br />\nto be. A child cries \"I am a<br />\nJew,\" without knowing why. The<br />\nyouth does not know how to<br />\npray, it does not believe in God.<br />\nit is a proud Russian youth, it Is<br />\ndevotedly Communist, and still it<br />\nis a Jewish youth.<br />\nWhat impressed Elie Wiesel<br />\nthe most? Their eyes. He saw the<br />\ndespair of a people in the depth<br />\nof those pupils, and felt the invisible tears running from them.<br />\n\"Those eyes negate the value of<br />\nwords; they dispose of the need<br />\nfor speech.\" And where did he<br />\ngo to find those eyes? Mostly,<br />\nhe searched for them in the<br />\nplaces of worship. He was there<br />\nat the time of the high holidays.<br />\nand, in opposition to the wishes<br />\nof the authorities, he found the<br />\nsynagogues packed. But the men<br />\nrefused to speak with him at<br />\nfirst. They were afraid of associating with the foreigner. It<br />\nwas only when he, too, started<br />\nto pray, aloud, with the devotion<br />\nand the abandonment to his<br />\n<br />\nspirit which he had learned as a<br />\nboy in Hungary, before the war,<br />\nthat they accepted him. ,They<br />\nfelt that this was not a mere<br />\nobserver. Here, among them, sat<br />\none who could understand.<br />\nAnd they unburdened themselves to him. In a sukka, the<br />\nhut in which the Feast of Tabernacles is celebrated, he heard<br />\ntheir sobs, disguised as song;<br />\nabove all, they wanted him to<br />\ntell their brethren in the other<br />\nworld that they fulfilled the<br />\ncommandment of joy. A captain<br />\nof the Red Army showed him his<br />\nson as he pointed at a crowd<br />\nof young people who were singing Hebrew melodies on the<br />\nnight of Simchat Tora, the Rejoycing of the Tara, minutes<br />\naway from the Kremlin: \"He's<br />\nhere somewhere. Look closely,<br />\nthey are all my son.\"<br />\nThe time came when the author had to return. \"I believe<br />\nwith all my soul,\" he writes at<br />\nthe end of the magnificent volume, \"that despite the suffering,<br />\ndespite the hardship and the<br />\nfear, the Jews of Russia will<br />\nwithstand the pressure and remain victorious. But whether or<br />\nnot we shall ever be worthy of<br />\ntheir trust, whether or not we<br />\nshall overcome the pressures we<br />\nourselves have created, I cannot<br />\nsay. I returned from the Soviet<br />\nUnion disheartened and depressed. But what torments me<br />\nmost is not the Jews of Silence<br />\nI met in Russia, but the silence<br />\nof the Jews I live among today.!'<br />\n<br />\n\f!HOMEWOOD, BALTIMORE, JANUARY 13, 1967<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE FIVE<br />\n<br />\nT*<br />\n<br />\nTHE WEEKLY NEWSMAGAZINE<br />\n<br />\nMAN OF<br />\n<br />\nE YEAR<br />\n<br />\nMAN OF THE YEAR? What kind of man makes a<br />\nMan of the Year? To determine the answer to this<br />\ndifficult and highly complex question, the editors of<br />\nT*ME took many factors into account. The Man of<br />\nthe Year would, of course, have to be representative<br />\nof the new America, the vibrant young America of<br />\n1966. He would have to be a man much in the news,<br />\nmuch with the news—a man who makes the news<br />\nwhile others sit around and wait for news to happen.<br />\nWe wanted, also, the man who has sold the most<br />\nnews, and it was a matter of simple statistics to see<br />\nwho that would be. But there's more to a Man of the<br />\nYear. He has to be the kind of man who has made<br />\n1966 what it was, distinct, different, exciting to be<br />\nalive in. Who could that be?<br />\n.0%1. t<br />\n<br />\n4C •<br />\n<br />\n1;4\"<br />\n<br />\nWell, it wasn't long before the editors saw what<br />\nwas probably plain to all of you out there from the<br />\nbeginning—that is, the Man of the Year for 1966 obviously has to be one of this year's famous mass murderers. It's easy to see why. 1966 was the year of the<br />\nmass murder; it was defined, in fact, by mass murder,<br />\nand its counterpart, the Mass Murder Article in T*ME.<br />\nYes, a mass murderer it had to be, but which one?<br />\nWe must admit, after long deliberation on the<br />\nmatter, that the editors cannot decide which of these<br />\nMen stands out above the rest, and we certainly do<br />\nnot wish to anger any of these men by not awarding<br />\nhim the title—which is not hard to understand. Therefore, the editors have decided to place the decision<br />\nup to the judgment of the readers of T*ME Magazine,<br />\nwho, in the end, must make each and every man of<br />\nthe year, every year. So it's your ball game, our<br />\nfriend! Below we have printed a ballot for your use.<br />\nPlease fill in the name of the mass murderer you prefer and mail it in to us here at T*ME. We will tabulate<br />\nthe votes, and the winner will receive, the title of<br />\nMan of the Year. Please take into account, as you<br />\nvote, that mass murderer whose crime most interested you, either because of its peculiar flair, or possibly because of the large number of victims, or for<br />\nany aspect of his character. Naturally, a good gauge<br />\nof the mass murderer most interesting to you is the<br />\nnumber of times you read our article on him when<br />\nhe was most in the news, but just in case you've for-gotten one or more of this year's crimes, we include,<br />\nbelow, a short recap of each candidate's career.<br />\nPlease vote! It is your right and duty as an American!<br />\n<br />\nso totally repulsed they found it hard to conduct a<br />\nsearch for the killer. \"Who wants to know a man<br />\nlike that?\" as the Captain put it.<br />\n<br />\nLYNDON BAINES JOHNSON<br />\nLast year's top mass murderer was a Texas plowboy who has come a long way in the American crime<br />\nbusiness. Lyndon Baines Johnson of Johnson City,<br />\nTexas graduated from his humble origins of torturing<br />\nhalf caste Indians (\"I reckon honey child the only<br />\ngood Injun is a dead one.\") to the American Presidency where he killed John F. Kennedy, Lee Harvey<br />\nOswald, Jack Ruby and thirteen other people whose<br />\nnames have been withheld by request. Johnson, an<br />\neasy going ex-school teacher whose hobby is bombing defenseless people, culminated a remarkable five<br />\nyears when on December 25 he told Jack Ruby to<br />\nsuddenly die of cancer.<br />\n<br />\nRobert Benjamin Smith<br />\nCHARLES WHITMAN<br />\n<br />\nRICHARD SPECIE<br />\n<br />\nThe Cincinnati Strangler<br />\n<br />\nCHARLES WHITMAN<br />\nCharles Whitman, a brilliant scientist doing research at the University of Texas, in Texas, last<br />\nAugust (or September) terrorized the University<br />\ncampus with a rifle. He stationed himself atop a<br />\ntower overlooking the campus and shot, sniper-style,<br />\ndown on passers-by. Later, when University officials<br />\nand others realized what Whitman was doing, they<br />\nadvised anyone using that portion of the college<br />\ngrounds to \"watch his (or her) step.\" Nevertheless,<br />\nWhitman managed to kill almost twenty in his spree<br />\nof terror, keeping police ducking for cover with his<br />\nshots and running from one part of the tower to<br />\nanother repeatedly, in a manner described by one<br />\nobserver as, \"the way a crazy man would run around.<br />\nLike a crazy person.\" But crazy or not, there is little<br />\ndoubt that Whitman was as effective a marksman as<br />\nhas been seen in this country since the days of Buffalo<br />\nBill Cody and Kit Carson. Experts agree that in this<br />\nage of soft, flabby Americans, riflery is fast becoming<br />\na lost art, and that there are few others in this nation<br />\nwho could have sustained the accuracy displayed by<br />\nWhitman on that day for more than a few shots.<br />\n<br />\nLYNDON BAINES JOHNSON<br />\n<br />\nDr. Hochhausler, famed surgeon and bereaved husband, stepped up to his blue Triumph sports car<br />\nlast October, only to discover his wife, Alice, who<br />\nhad spent much of her time nursing a flower garden in<br />\ntheir spacious backyard in the suburb of Clifton,<br />\nsprawled obscenely in the front seat. She was wearing a red robe. The cord of the robe has been cited<br />\nas the murder weapon.\"We found this red terrycloth<br />\ncord around her throat,\" related a Cincinnati police<br />\nofficer, \"and we suspect that it may be the belt to her<br />\nrobe, which is made of the same material and is the<br />\nsame color.\"<br />\nWhen Mrs. Hochhausler left her new, nine-seater<br />\nstation wagon, she was clubbed from behind, causing<br />\nher dental plates to fall from her mouth. The unfortunate woman was then dragged to the garage<br />\nwhere she was raped and placed in the blue Triumph<br />\nsports car.<br />\nMrs. Hochhausler is not alone. Three other middleage Cincinnati women were strangled during 1966,<br />\nand the Cincinnati Strangler is expected to best himself during 1967.<br />\n<br />\nPlease Vote<br />\nThere you have it! The five top money makers for<br />\nT*ME magazine of the year 1966. The five most<br />\nfamous mass-murderers, in a year that may yet<br />\nprove to be a trend-setter. Tell us your choice, for<br />\nit's only with your cooperation that T*ME will tell.<br />\n<br />\nRICHARD SPECK<br />\nChicago, long maligned as a city filled with crime<br />\nand violence, surprisingly has but one entrant in this<br />\nYear's race for Man of the Year, while Texas boasts<br />\ntwo. Nevertheless, Chicago is ably represented by<br />\nRichard Speck, alleged killer-rapist-botherer of eight<br />\nstudent nurses in a dormitory in Chicago. According<br />\nto the statements of a ninth girl, who escaped his<br />\nwrath (she denied the use of bribery when questioned<br />\nby T*ME), Speck burst in upon the reposing lovelies<br />\none evening \"out of nowhere, through the door,\" and<br />\nproceded to completely bother them,'after which he<br />\nmurdered them.<br />\nPolice arriving at the scene found the girls' room<br />\nFt shamble, the sheets bloody and dragging on the<br />\nfloor, blood covering the floor and walls and windows<br />\nand door and chairs and desk and ceiling. One of the<br />\ngirls was apparently in the middle of a novel when<br />\nthe attack occurred, and it was lying open on the<br />\nfloor, pages 218-219 completely soaked with blood.<br />\nThe lone survivor, said Chicago precinct Captain<br />\nChuck Whitman, \"was all covered with like a lot of<br />\nblood.\" He told T*ME reporters that the police were<br />\n<br />\nBobby Smith was always an impressionable boy,<br />\nand murder impressed him most. \"The only good<br />\ninjun is a dead one,\" said Bobby to a T*ME staff<br />\nreporter while sipping a black and white soda. This<br />\nquiet ambitious high school student had a plan, and<br />\none dry, dusty day in Mesa, Arizona last August he<br />\ncarried it out.<br />\nEarly one morning he set out from home carrying<br />\na small attache case filled with two dozen baggies, a<br />\nblue shower cap, three thousand feet of 50 lb.-test<br />\nnylon cord, and assorted firearms. He was heading<br />\nfor the Rose-Mar College of Beauty.<br />\nHe entered the shop and gained everyone's attention by firing a pistol. He then explained to the five<br />\nwomen and two children present that he was about<br />\nto smother them. Laying down his pistol on a formica<br />\ncounter that had been installed the previous day, he<br />\npulled from his attache case an unopened box of<br />\nbaggies. To his distress, he discovered that the baggies were too small to fit over the heads of the<br />\nwomen. Without delay, he replaced the baggies in the<br />\ncase and ordered the women and children to lie in a<br />\ncircle on the floor. \"Like the spokes of a wheel,\"<br />\nBobby later explained to disgusted policemen. When<br />\nthey had ararnged themselves properly on the floor,<br />\nBobby walked around the circle firing his gun. \"It<br />\nwas easier than shooting pipes in a carnival,\" he later<br />\nstated to interested reporters.<br />\n<br />\nROBERT BENJAMIN SMITH<br />\n<br />\nBALLOT<br />\nT*ME MAN OF THE YEAR<br />\nC/O THE NEWS-Lk:C.1'ER<br />\nBOX 1230 J.H.U.<br />\n<br />\nCHARLES WHITMAN<br />\nRICHARD SPECK<br />\nLYNDON BAINES JOHNSON<br />\n<br />\nEl<br />\n<br />\nROBERT BENJAMIN SMITH<br />\nTHE CINCINNATI STRANGLER 0<br />\nTHE CINCINNATI STRANGLER<br />\n<br />\nPLEASE VOTE!<br />\n4<br />\n<br />\n\fNEWS -LETTER<br />\n<br />\nPAGE SIX<br />\n<br />\nB. I. A. NOTES<br />\nThe Board of Intramural<br />\nAthletic's compci I.:ion resumed<br />\nafter vacation with basketball<br />\ngames on Monday evening.<br />\nFraternity \"A\" games: Phi<br />\nSig 53-Phi Psi 31, AD 50-KA 35,<br />\nPhi Gam 100-Phi Ep 19. Fraternity \"B\" games: DU 25-TEP<br />\n20, ZBT 33-Sig Ep 19, Beta 36ATO 28.<br />\nFreshman dorm games: Adams<br />\n31-Clark 30, Guildersleeve 36Baker 27, Lazear 52-Griffin 40,<br />\nJennings 41-Hollander 30. Uppet-class dorm games: Royce 43Willard 40, Wood 41- Sylvester<br />\n28.<br />\n..B-Ball Info<br />\nIf any questions or problems<br />\narise as to rulings in the basketball competition, the members<br />\nof the BIA are to be consulted;<br />\nFrosh—Gene Detroyer (418). Uppercla.ss—Dave Rodkey, Prat 'A'<br />\n—Charlie Kernan (510), Prat 'B'<br />\n—Bob Carter (528k, Ind.—Joe<br />\nOlk (513).<br />\nThree of the minor sports in<br />\nthe BIA program will be held in<br />\nFebruary. Some of the entries<br />\nmust be made by next week.<br />\n<br />\nfraternities only and entries must<br />\nbe made by January 18 to Box<br />\n123. Players must, supply their<br />\nown equipment.<br />\nEntries for competition in<br />\nhandball must also be made bY<br />\nJanuary 18 to Box 844.<br />\nBowling for all leagues will be<br />\nheld on February 11 and entries<br />\nmust be made to Box 500 by February 8. Each team must have<br />\nfive men.<br />\n<br />\nJays Face Test<br />\n<br />\nVarsily Swimmers irop Two,<br />\nFace MAC Champs Tomorrow<br />\n(Continued from Page 8)<br />\n173.65 points to break Pete Reynolds old record. Rick Wilson<br />\nadded a second place finish in<br />\nthe diving for a Hopkin's sweep.<br />\nLooking over the past two meets,<br />\nCoach' Klarner feels that the<br />\nBluejays have done very well but<br />\ncan even do better. He thinks<br />\nthat the team has shown great<br />\nimprovement as evidenced by<br />\ncomparable scores. Last year<br />\nHopkins last to the Garnets 7024 and to PMC 61-33.<br />\n<br />\nWork 3 evenings 3-10 or<br />\n2 evenings & Saturday 9-5.<br />\n<br />\n$60<br />\nCALL 837-8152<br />\n<br />\nCAREERS<br />\nIN STEEL<br />\n<br />\nOur representative<br />\nwill be on campus<br />\n<br />\nFEB. 13, 14<br />\nto interview undergraduate<br />\nand graduate candidates for<br />\nBethlehem's '67 Loop Course<br />\n—our highly regarded<br />\nmanagement training<br />\nprogram<br />\nOPPORTUNITIES are<br />\navailable in steel plant operations, sales, research, mining, accounting, and other<br />\nactivities.<br />\nDEGREES required are<br />\nmechanical, metallurgical,<br />\nelectrical, chemical, industrial, civil, mining, and<br />\nother engineering specialties; also chemistry, physics, mathematics, business<br />\nadministration, accounting<br />\nand liberal arts.<br />\nIf you would like to discuss<br />\nyour career interest with a<br />\nBethlehem representative,<br />\nsee your placement officer<br />\nto arrange for an interview<br />\n<br />\nJIMMY WU'S<br />\n<br />\nGET A<br />\nHEAD START..<br />\n... As you leave school and begin your working<br />\ncareer, you will be hearing about the changes that<br />\nhave been taking place at Allis-Chalmers. New<br />\nproducts! New markets! New growth!<br />\nBut why not GET THE WORD NOW from our representative who will be on campus. Perhaps you can<br />\nget a head start—be part of tile action.<br />\nToday, Allis-Chalmers has professional career<br />\nopportunities for all engineering graduates with<br />\nemphasis on Electrical, Industrial, and Mechanical<br />\nbackgrounds. Also available are unexcelled opportunities for the Business Administration graduate.<br />\nCONTACT YOUR PLACEMENT OFFICE FOR A<br />\nCAMPUS INTERVIEW ON:<br />\n<br />\nJanuary 20, 1967 (Friday)<br />\n<br />\nAgrim ALL1S-CHALMERS<br />\n<br />\nBETHLEHEM<br />\nSTEEL<br />\n<br />\n11<br />\nP0\"<br />\n—A<br />\n<br />\nThe best race of the day will<br />\nbe in the 200 yd. butterfly where<br />\nHowie Chernick Ls matched<br />\nagainst Dickinson's Paul Stasz.<br />\nChernick, the teath's high scorer<br />\nso far, will have his hardest test<br />\nof the season tomorrow<br />\n<br />\nwith<br />\n011.earnPlig Max ghuIman<br />\n(By the author of\"Rally Round the Flag,Boys!\",<br />\n\"Dobie Gillis,\" etc.)<br />\n<br />\nwinesmomoolliniellk<br />\n<br />\nIT'S A NORTH WIND THAT BLOWS NO GOOD<br />\nCrushed between the twin millstones of January<br />\nweather and final exams, you are saved from total despair, poor devils, only by the knowledge that winter vacation will soon be here.<br />\nWhere will you go this year? Will it be Florida again,<br />\nor are you tired of jails? Then how about Puerto Rico?<br />\nA most excellent notion, say I. A balmy and bounteous<br />\nisland with long white beaches and blue, blue skies and<br />\ngreen, healing seas. And, most pleasant of all, the warm<br />\nand gracious people of Puerto Rico! You don't even have<br />\nto know Spanish to communicate with this friendly folk.<br />\nJust learn three simple phrases and you'll get along<br />\nsplendidly:\"Buenos dias\" which means\"Good morning,\"<br />\n\"Gravies\" which means \"Thank you,\" and \"Que sera<br />\nseed\" which means t'Your llama is on my foot.\"<br />\nIn order to help you enjoy the fabled land of Puerto<br />\nRico it would be well for me to supply a bit of historical<br />\nbackground. (It would also be well for me to say a few<br />\nwords about Personna Super Stainless Steel Blades because the makers of Personna Super Stainless Steel<br />\nBlades pay me to write this column ahd they are inclined<br />\nto sulk if I omit to mention their product. Of course,they<br />\ndon't p!itay gloomy long, for they are kindly, cheery men<br />\nfond of Morris dancing, spelling bees, and temperance<br />\npunch—fine, upright types, as true and gleaming and<br />\ndurable as the blades they make. And if you've tried<br />\nPersonna's,you know how true and gleaming and durable<br />\nthat is! And if you haven't tried Personna's, poor devil,<br />\nyou've cheated both your purse and face, for Personna's<br />\nlast and last, shave after luxury shave, close, clean, nickless, hackless, tugless, gougeless, scratchless, matchless.<br />\nPersonna Super Stainless Steel Blades come in Double<br />\nEdge or Injector style and are made only by the makers<br />\nof Personna Super Stainless Steel Blades.)<br />\nBut I digress. Back to the history of Puerto Rico. The<br />\nIsland was discovered by that popular discoverer Christopher Columbus. Incidentally, considering Columbus'<br />\npopularity, it's odd we know so little about him. What do<br />\nwe really know? Only this:<br />\nHe was born in Genoa on August 25 1451, the son of<br />\nRalph T. Columbus, a knee-cymbal vendor, and Eleanor<br />\n(Swifty) Columbus, a low hurdler. He was an only child<br />\nexcept for his five brothers and eight sisters. From early<br />\nchildhood he was an avid reader and spent all his waking<br />\nhours immersed in a book. Unfortunately,there was only<br />\none book in Genoa at the time—Care of the Horse by<br />\nAristotle—and after 18 years of reading Care of the<br />\nHorse, Columbus grew restless. When rumor reached<br />\nhim there was another book in Madrid, off he ran as fast<br />\nas his little fat legs would carry him.<br />\nDisappointment,alas,awaited him there.The only book<br />\nIn Madrid was Guider un Cabello,which proved to be nothing more than a Spanish translation of Care of the Horse.<br />\nThen one day Columbus heard from a traveller that<br />\nthere were millions of books in India, and he was instantly ablaze to set sail. Off he ran on his little fat legs<br />\nto the court of Ferdinand and Isabella (Columbus,though<br />\nmore than six feet tall, was plagued with little fat legs<br />\nall his life) and, as we all know, he persuaded the Spanish rulers to outfit him with three stout ships,the Popsy,<br />\nthe Mopsy, and the Cottontail, and the rest is history!<br />\n<br />\nAN EQUAL OPPORTUNITY EMPLOYER<br />\n<br />\nNEWMAN HOUSE<br />\nThe Catholic Center for Johns Hopkins<br />\nBE 5-9271<br />\n2941 N. Charles<br />\nRev. Phillip V. Cunningham, CSP, Chaplain<br />\n<br />\n•<br />\nREGULAR MASS SCHEDULE:<br />\nSundays-10:30 A.M. (in Levering Hall)<br />\nWkdays (expt. Sat.)-4:3O P.M. (at Newman House)<br />\n(Confessions are heard before all Masses)<br />\n<br />\nappointment.<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br />\n<br />\nand it is reported to be even<br />\nstronger this year. Coach Klarner<br />\ndoes not plan to do any experimenting or juggling of the lineup tomorrow, and he expects his<br />\nmen to do their bast and improve their times even more.<br />\n<br />\n(Continued from Page 8)<br />\n<br />\nDickinson Outlook<br />\nTomorrow the Jays meet DickWashthe<br />\nin<br />\n74<br />\nfor<br />\n25<br />\nburg and<br />\ninson here at 3 p.m. Dieldn.son<br />\nington game, and allowed 80 and was last year's MAC champion,<br />\n82 points to those two teams.<br />\nNobody can win at that rate.\"<br />\nA Favorite Rendez Wu<br />\nWith 22 and 16 points in Satfor Hopkins Men<br />\nurday's debacle, Jim Call! and<br />\nBrian Berke pushed their teamNEW<br />\nleading scoring averages to 17.0<br />\nand 15.4 respectively; no one<br />\nCHINA INN<br />\nelse is in doug-le figures. Will<br />\nCharles Street below 25th<br />\nLane and Joe Carlton are, as usJIMMY WU'S<br />\nual, pacing the group in reCARRY OUT SHOP<br />\nSquash<br />\nbounds, having grabbed 55 and<br />\n1411 E. Cold Spring Lane<br />\nSquash games will be held for<br />\n47 caroms for five contests.<br />\n<br />\nSTUDENT.PART TIME<br />\n<br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br />\n<br />\nTHIS SUNDAY—JANUARY 15th, 7:30 P.M.<br />\n\"Prayer and Song for Christian Unity\"<br />\nUniversity and N. Charles<br />\nEpiscopal Cathedral<br />\n<br />\n•<br />\nGraduate Seminar—Thurs., Jan. 19th, 8:00 P.M.<br />\n<br />\nWell sir, now you know all about the origins of Puerto<br />\nRico.So get packed and get going! You'll love it! Stroll the<br />\nbeaches,swim the coves, breathe the fragrance of hibiscus<br />\nand bougainvillea. And remember always that the friendly<br />\nPuerto Ricans are delighted to show you their customs,<br />\nteach you their language.Why,I'll wager you'll soon know<br />\nfar more Spanish than the three basic phrases.You'll know<br />\n\"Haste la vista\" which means\"See you later.\"\"Porfavor\"<br />\nwhich means \"Please,\" and \"El tren se pan; en las este(don\" which means \"Your llama has eaten my passport.\"<br />\nel9R6, Max Shulman<br />\n*<br />\nGracias from the makers of Personna for giving our<br />\nblades such a cordial reception, and, par favor, hoes<br />\nabout trying another of our luxury shaving products<br />\n•-• Burma Shave, regular or menthol?<br />\n<br />\n\fHOMEWOOD, BALTIMORE, JANUARY 13. 1967<br />\n<br />\nGrapplers Tangle• Dickinson<br />\nIn Season's Fourth Contest<br />\n(Continued from Page 8)<br />\nods Gotwals led his opponent by<br />\none point, but a one minute time<br />\nadvantage tied the contest.<br />\nStiff Competition<br />\nJude Smith met stiff competition from Bill Yates, a strong<br />\nHaverford wrestler at 152, and<br />\nhad trouble warding off a pin.<br />\n.The score stood 14-2 as Monte<br />\nIkemire, weighing 160, lost a<br />\nclose contest, 6-8. John Gale was<br />\npinned in the first period by 167<br />\npound Lawrence Taylor.<br />\nDennis Estis, who wresteld in<br />\nthe 177 division in the opening<br />\nmeet, may have been glad he<br />\nwas on the sidelines last Saturday. Tim Wex replaced him but<br />\nwas completely overpowered by<br />\nhis opponent. The match ended<br />\nin a fall in the third period. Bill<br />\nHunt captured the only Hopkins'<br />\nvictory on a decision in the<br />\nheavyweight class.<br />\n\"Loss of conditioning during<br />\nvacation was not the major cause<br />\nof defeat,\" opined Coach Kyle<br />\nSmith.\"The squad has picked up<br />\nafter the defeat,\" he continued,<br />\n\"and they should be ready for<br />\nDickinson tomorrow.\" John Peck<br />\nshould be back in the lineup<br />\nsoon, and co-captain Bill Swartz<br />\nhopes to return around February<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE SEVEN<br />\n<br />\nFreshman Mermen<br />\nDrop Season Opener<br />\n<br />\nwill host highly touted Delaware<br />\nBy JEFF LAUREN<br />\nin their second home meet. Delaware sported a 9-0-1 record last<br />\nAfter winning all three of its<br />\nyear and looks to be one of the scrimmage meets, the freshmen<br />\nmost powerful squads on the swimming team dropped its first<br />\nJays' schedule.<br />\nregular meet of the season to<br />\nThe freshmen matmen, with McDonough last Saturday.<br />\nonly nine men on the-rdster, met<br />\nIn losing 67-28, the Baby Jays<br />\nBaltimore Junior College last were a little disappointing. They<br />\nTuesday and was bested 33-10.<br />\ndid not look good after,returnBob Hyde and Charles Coker ing from the Christmas vacation,<br />\nwere the only winners, both pin- and they were a little shaky in<br />\nning their opponents. Coach Ron their first meet of the season.<br />\nBelinko stated, \"The lack of ex- Right from the beginning Hopperience was a big factor, and kins did not do well, and Coach<br />\nthe squad should definitely im- William Klarner then proceeded<br />\nprove in the future.\"<br />\nto experiment, not worrying<br />\nThe frosh lineup ialudes Bob about the final score.<br />\nSwanton, 123 lb.; Paul Ing, 130;<br />\nFisher Excels<br />\nBob Hyde, 137; Charles Coker,<br />\nSpecial mention must be given<br />\n145; Russ Prall; 152; Bill Margrabe, 167; Bob Williams, 177; to Bobby Fisher who broke two<br />\nand Torn O'Toole in the heavy- Hopkins pool records in an<br />\nweight division at 240. Bob Hyam amazing show of swimming abiland Bill LaCorte, top prospects ity. His 2:22.3 in the 200 yd. infor the season, have been lost dividual medley and 1:03.4 in<br />\nthe 100 yd. backstroke were recdue to injury.<br />\nThe frosh, hoping to avenge ord times. Fisher graduated from<br />\ntheir opening defeat, will travel McDonogh so he was trying to<br />\nwith the varsity tomorrow to impress his old coach and team.<br />\ntake on the Dickinson junior<br />\nThree other freshmen also<br />\nvarsity.<br />\ndeserve special notice according<br />\n<br />\n1.<br />\n<br />\nJOHN P. NUGENT, JR.<br />\nLife & Health<br />\nInsurance<br />\n<br />\nto the coach. Steve Giles only<br />\ntook a secOnd in the 200 yard<br />\n243-7961<br />\nfreestyle, but his time of 2:06<br />\nwas one of the fastest at Hopkins. In the sprints, Jeff Bonnet did an outstanding job as<br />\nhis 24 sec. flat performance in<br />\nWe need your head in our<br />\nthe 50 yard freestyle. It was good<br />\nbusiness<br />\nfor a new freshmen team record.<br />\nSteve Yeagle took a first in<br />\nthe 100 yard butterfly in a hotly contested race. He went several seconds faster than he had<br />\n3120 St. Paul St.<br />\never done in practice, and he<br />\nAcross from Eddie.,<br />\nhas shown great improvement<br />\nall season long.<br />\nRx Rx Rx Rx Rx Rx Rx Rx<br />\nNext Meet<br />\nThe freshmen have a chance<br />\nto gain their first victory of the<br />\nCONTACT LENS<br />\nseason tomorrow against Loyola<br />\nHigh. The meet, which is at<br />\nCARRYING CASE<br />\n3:00 p.m. will run along with<br />\nthe varsity's encounter against<br />\nDickinson. Coach Klarner feels<br />\nthat the freshmen have looked<br />\nand up<br />\nmuch better in practice since >4<br />\nthe McDonogh meet, and are<br />\ncoming close to their old form.<br />\nHe expects the Loyola meet to be<br />\n>4 Charles and 34th St. Al<br />\nclaw, and feels the Jays can •<br />\nreally do a job.<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rs<br />\n<br />\nSt. Paul Barber Shop<br />\n<br />\n98c<br />\n<br />\n•<br />\n„ Greenway Pharmacy<br />\n<br />\nENGINEERS AND SCIENTISTS:<br />\n<br />\nNext Wednesday the grapplers<br />\n<br />\nLOOK HERE<br />\n<br />\nBusses To Goucher<br />\nThe Student Council has announced a bus schedule that will<br />\nrun between Goucher and Hopkins on Friday and Saturday<br />\nnights. Busses leave for Goucher<br />\nfrom Hopkins at 7:30, 10:30 and<br />\n12:45. Busses from Goucher to<br />\nHopkins leave at 6:45 (Fridays<br />\nonly), 8:30, 12:00 and 1:40.<br />\n<br />\nWHERE THE ACTION IS!<br />\n<br />\n.<br />\n<br />\nYou and your ideas are needed to help fulfill our many<br />\nand varied programs.<br />\n<br />\nF-111A and B • FB-111<br />\nRF-111 • F-111K<br />\nMARK II AVIONICS<br />\nADVANCED PROGRAMS<br />\n• SPACE SYSTEMS<br />\n• MISSILE SYSTEMS<br />\n• BORON FILAMENT<br />\n• OTHER R AND D<br />\n<br />\nFRED DONNELLY<br />\n(B.S.C.E.)ofthe Bethlehem<br />\nSteel Loop Course knows<br />\nwhere the action is.<br />\nHe's a field engineer for<br />\nour Fabricated Steel<br />\nConstruction Division, one<br />\nof the nation's greatest<br />\nbuilding organizations.<br />\nJoin the action.<br />\nFirst step: pick up<br />\na copy of \"Careers<br />\nwith Bethlehem Steel<br />\nand the Loop Course\"<br />\nat your placement<br />\noffice. Then sign up<br />\nfor a campus interview.<br />\nOur 1967 Loop Class<br />\nhas openings for technical<br />\nand non-technical graduates<br />\n(and post-grads) for<br />\ncareers in steel operations,<br />\nresearch, sales, mining,<br />\naccounting, and other<br />\nactivities.<br />\n<br />\nON-CAMPUS INTERVIEWS<br />\n<br />\nJANUARY 16<br />\n^<br />\n<br />\nSEE YOUR<br />\nPLACEMENT DIRECTOR<br />\n<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br />\n<br />\nBETHLEHEM<br />\nSTEEL<br />\n<br />\nGENERAL DYNAMICS<br />\nFort Worth Division -<br />\n<br />\n\fNEWS<br />\n<br />\nLETTER<br />\nNEWS -LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nQuint Faces Penn<br />\nMilitaryInCrucial<br />\nTest to Title Hopes<br />\n<br />\n'4:e7<br />\n<br />\nTcr e<br />\nTwice<br />\nBy JEFF LAUREN<br />\nThe varsity swimming team<br />\ndropped its first two meets of<br />\nthe season by close margins. Tomorrow afternoon the tankmen<br />\ntake on Dickinson, who should<br />\nprove to be tough.<br />\nIn the -Bluejay's first meet of<br />\nthe season against Swarthmore<br />\nbefore the Christmas vacation,<br />\nthe varsity swimmers came the<br />\nclosest to a victory that any<br />\nHopkins swimming team ever<br />\nhas, as the Garnets edged out<br />\nHopkins 49-46. The meet was not<br />\ndecided until the second to last<br />\nevent.<br />\nHenry High Scorer<br />\nHopkins opened and closed the<br />\nSwarthmore meet well, winning<br />\nboth the opening medly relay<br />\nand the finishing freestyle relay.<br />\nBut they were only able to win<br />\nthree individual events as Al<br />\nHenry won the 50 yd. freestyle<br />\nand soph Howie Chernick the<br />\n200 yd. butterfly. Henry was the<br />\nteam's high scorer with 9%<br />\npoints, but the team showed good<br />\nbalance as they fought hard for<br />\nMany second and third places.<br />\nWhen the Bluejays returned<br />\nfrom their vacation, they had to<br />\nquickly prepare for Pennsylvania<br />\nMilitary College, who defeated<br />\nthe Jays 51-40 last Saturday.<br />\nPMC, greatly improved from last<br />\nyear, started off by beating<br />\nHopkins by less than a second in<br />\nthe medley relay. But Coach<br />\nWilliam Klarner was still happy<br />\nsince the Jays clipped seven seconds off their time from the<br />\nsame relay in the Swarthmore<br />\nmeet.<br />\nBurnham Outstanding<br />\nSophomore Noel Burnham was<br />\ncited by the coach as the swimmer having the best day against<br />\nPMC. Burnham anchored the<br />\nmedley relay that set the new<br />\nschool record of 4:17 and he<br />\nswam one of the fastest 100 yd.<br />\nfreestyle races in Hopkins history<br />\nas he did a speedy 53 flat.<br />\nOther highlights of the meet<br />\nwere Chernick's victory in the<br />\nbutterfly and Gene Linfors diving. Iinfors set a new school and<br />\npool record when he scored<br />\n(Continued on Page 6)<br />\n<br />\nBy MIKE PHILLIPS<br />\nKnocked from its undefeated<br />\nperch, the varsity basketball<br />\nteam concludes a week crucial<br />\nto its Southern Division Middle<br />\nAtlantic Conference title hopes<br />\nwhen it journeys to Pennsylvania Military College tomorrow afternoon.<br />\nSaturday's opponent, about<br />\nwhom there is little current information at this writing, was<br />\n3-3 in M.A.C. play as of Tuesday and returns six lettermen<br />\nfrom an 8-11 (5-8 in the league)<br />\ngroup that, after being demolished 76-51 by the Jays a year<br />\nago, stormed back to win six of<br />\nits final eight games.<br />\n<br />\nCALL! DRIVES — Junior guard Jim Calli, leading Bluejay scorer,<br />\ndrives hard on his way for a layup.<br />\n<br />\nGrapplers Take On<br />\nTough Devil Squad<br />\nFLASH<br />\nThe varsity wrestling team<br />\nMaryland<br />\nWestern<br />\ndefeated<br />\nWednesday 20-16. Rich Dryden,<br />\nSteve Koyama, Harry Gotwals,<br />\nTom Copeland, John Crabbes,<br />\nand Bill Hunt led the grapplers<br />\nto their first victory of the<br />\nseason.<br />\nBy JIM SLOAN<br />\nThe varsity grapplers travel to<br />\nDickinson tomorrow hoping to<br />\navenge last year's 11-18 defeat<br />\nand improve this season's opening slump.<br />\nThe Devils post a rather inexperienced lineup with no seniors,<br />\nbut still promise to provide<br />\nstrong competition.<br />\nHaverford Wins<br />\nAfter dropping their opening<br />\nmeet, the grapplers returned<br />\nfrom the Christmas vacation to<br />\nface a powerful Haverford squad<br />\n<br />\nlast Saturday. The Fords collected two falls and five decisions<br />\nto win the meet, 27-5. Senior<br />\nheavyweight, Bill Hunt, and<br />\nsophomore Harry Gotwals proved<br />\nto be only bright spots in an<br />\notherwise dim afternoon for the<br />\nJays.<br />\nLightweight Dick Dryden almost collected his second fall in<br />\nas many meets, but time ran out<br />\nand he lost by decision. Curt<br />\nConner was next at 130 lb., and<br />\nhe dropped a close match by decision, 1-4.<br />\nJoe Griggs was overpowered<br />\nby opponent in the 137 division,<br />\nand the Fords jumped to an<br />\nearly 0-9 lead. Harry Gotwals, a<br />\nsophomore at 145, was next on<br />\nthe mat. His event was the most<br />\nexciting and perhaps the best of<br />\nthe afternoon. After three pen (Continued on Page 7)<br />\n<br />\nOle's Fencers Battle Lehigh<br />\nThe varsity fencing team meets<br />\nLehigh away tomorrow afternoon<br />\nand it hopes for as easy a win<br />\nas last years 20-7 victory.<br />\nFacing Stevens Institute last<br />\nSaturday, the Jays suffered an<br />\n18-9 defeat. The team had to<br />\nforfeit six bouts because only<br />\nseven men are competing instead of the minimum of nine.<br />\nThe Jays are led by co-captains Jerry Lam (foil) and Mike<br />\nGross (sabre). Lam, a senior, was<br />\nlast years champion in the foil<br />\ncompetiton in both the Middle<br />\nAtlantic and North Atlantic<br />\nconferences.<br />\nReturnees<br />\nOther members of the team<br />\ninclude: in foil, John Austin (jr.)<br />\nand Bill Cowan (soph); in epee,<br />\nJoe Mulinare (senior) and Bob<br />\nLeedom (senior); in sabre, Bernie Tawfik.<br />\nIn intercollegiate fencing three<br />\nmen compete in each weapon<br />\ngroup (foil, epee, sabre) and<br />\neach man fences three times.<br />\nThus, a minimum team should<br />\nconsist of nine men. There are<br />\ntwenty-seven bouts and each win<br />\n<br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br />\n<br />\nAlthough these seven men will<br />\nhave to do the job of nine,<br />\nCoach Dick Oles feels the team<br />\nhas a chance this year.<br />\n* * *<br />\n<br />\nDICK OLES<br />\nis awarded one point. Hopkins<br />\nthen must forfeit six points at<br />\nthe start of every meet.<br />\nTough Season<br />\nBecause Hopkins is down before a meet starts last years 6-3<br />\nrecord may be a tough goal for<br />\nthis season. Last year the Jays<br />\nfinished overall second in the<br />\nMiddle Atlantic Conference and<br />\ntied for third in the North Atlantic conference. The fencers<br />\nalso tied for first for the foil<br />\ntrophy.<br />\n<br />\nThe freshman squad has fourteen men out and several have<br />\nhigh school experience. Although<br />\nthe team dropped its first meet<br />\nto Stevens also 18-9, it showed<br />\npotential for the future, according to Oles.<br />\nExperienced stickers are Aven<br />\nWhittington in sabre and Al<br />\nFung and Ron Remick in foil.<br />\nIn the meet Fung went 3-0<br />\nwhile Whittington went 2-1.<br />\nVarsity Schedule<br />\nSat., Jan. 21.<br />\nLafayette<br />\naway<br />\nWed., Feb. 8<br />\nUniv. of Penn.<br />\n4:00 p.m.<br />\nSat., Feb. 11<br />\nMuhlenberg<br />\n3:00 p.m.<br />\nSat., Feb. 18<br />\nHaverford<br />\naway<br />\nSat., Feb. 25<br />\nTemple<br />\naway<br />\nSat., Mar. 4<br />\nMason-Dixon Championships<br />\nat Lehigh<br />\n<br />\nFrom<br />\npre-season reports,<br />\nP.M.C.'s most probable starters<br />\nare lettermen Ron Arbogast (61 guard, 13.0 average in '65-'66),<br />\nKen Elliott (6-4 center, 11.5),<br />\nand George Shicora (6-3 forward, 12.7), with 6-3 forward<br />\nCharlie Haydt (about 20 points<br />\nper game this season) and 5-10<br />\nguard Bill Selwood rounding out<br />\nthe crew. The chief reserves are<br />\nlettermen Mike Borden, Dick<br />\nCartwright, and Mike LaFlarnme,<br />\nwith soph Bill McCauley (up<br />\nfrom a 12-5 frosh team) pressing Selwocd.<br />\nBig Time Action<br />\nOn Tuesday Hopkins takes a<br />\njump into the big time by traveling to Washington, D.C. to face<br />\nMason-Dixon pacesetter Catholic University. The Cardinals, 51 in that league and 7-5 overall<br />\nas of Wednesday, have defeated<br />\nEvansville<br />\n(the<br />\nthird-ranked<br />\nU.S. small college team going<br />\ninto that game), St. Joseph's of<br />\nPhiladelphia (fifth in the nation a year ago), and perennial<br />\nsmall college power Mount St.<br />\nMary's (twice).<br />\nCatholic U. is paced pointwise<br />\nby 6-0 soph guard Bill Wilson,<br />\nwho, at the end of eight games,<br />\npossessed an 18.7 scoring mark,<br />\nwith Bob Ciofarri (12.7) and<br />\nRon Krasinski (10.5) also in<br />\ndouble figures. The Cards defeated Washington College, their<br />\nlone common opponent with the<br />\nJays, 97-78.<br />\nWin Streak Over<br />\nThe Homewood squad's early<br />\nseason win streak, as expected,<br />\nended before Christmas with a<br />\nreasonably<br />\nwell-played<br />\n80-70<br />\nloss to Gettysburg, but last Saturday's 82-71 upset defeat at the<br />\nhands of a mediocre Washington<br />\nquintet was most unanticipated<br />\nand extremely injurious, since<br />\nthe Sho'men compete in the<br />\nM.A.C.<br />\nAs of Tuesday, second in the<br />\nloop's Southern Division with a<br />\n3-1 mark (Ursinus is 4-1), the<br />\nJays, having faced Western<br />\nMaryland last night and with<br />\nP.M.C. on tap tomorrow, are in<br />\nthe midst of what might prove<br />\nto be a decisive week as regards<br />\ntheir title hopes,<br />\nDown by as much as sixteen<br />\n(35-19) in the first half of the<br />\nWashington<br />\ngame,<br />\nHopkins<br />\nstaged a steady rally, taking the<br />\nlead 65-64 on Bob Spence's basket with 6:01 left, and with<br />\nSho'man starters Frank Marion<br />\n(17 points), Gary Meyers (18),<br />\nand Tom Polvinale out via the<br />\nfoul route, the Jays appeared<br />\nto be in position to move away.<br />\nCollapse<br />\nSuch hardly proved to be the<br />\ncase, as Washington immediate-<br />\n<br />\nly cashed in on a three point<br />\nplay, and steadily outdistanced<br />\na demoralized Hopkins contingent from there. A prime factor<br />\nin the collapse was the Jays' impotence at the free throw line<br />\n(eight for nineteen) in the second half—at least twice in the<br />\nclosing minutes they failed to<br />\nconvert. the first shot of a oneand one situation.<br />\n\"Defense and shooting have<br />\nbeen our problems the last two<br />\ngames,\" commented Coach Henry Ciccarone. \"We were 26 for<br />\n73 from the field against Gettys(Continued on Page 6)<br />\n<br />\nFrosh Hoopsters<br />\nInvade PMC<br />\nBy JIM SLOAN<br />\nThe freshmen basketball team,<br />\nnow averaging 85 points per<br />\ngame to its opponent's 41, will<br />\ntry to add another victory to its<br />\ncredit when it invades Pennsylvania Military College tomorrow.<br />\nThe frosh stretched their winning streak to four games as<br />\nthey trounced Washington College junior varsity last Saturday, 93-41.<br />\nHeight Helps<br />\nWith seven men over 6'3\", the<br />\nBaby Jays are finding few problems under the boards. Their<br />\nheight advantage enabled them<br />\nto completely dominate both the<br />\noffensive and defensive boards<br />\nagainst Washington.<br />\nIn addition a balanced attack has boosted their scoring<br />\npotential. Against Washington,<br />\nfour men were in double figures. These wer 6'5\" Jim Novick<br />\nwith 22 points, Curt Slenken<br />\n(6'5\") with 17, John Judy (6'4\")<br />\nat 13, and Jim Thomas (6'5\")<br />\nwith 12.<br />\nThomas is a starting forward.<br />\nSlenker works at center, and<br />\nJudy and Novick are guards.<br />\nOther standouts are Andy Fisher,<br />\nRichard Thielke, and Bill Piotrowski.<br />\nBarrette Beams<br />\nCoach Gary Barrette was<br />\npleased with his squad's performance and considers the team<br />\nready for much stouter competition than that which Washington provided.<br />\nPMC looks to be strong, and<br />\nit should be a hard fought contest tomorrow. Next Tuesday,<br />\nMt. St. Joseph's will host the<br />\nfrosh. The next home game is<br />\nslated for February 4 against<br />\nFranklin and Marshall. The remaining contests of the fifteen<br />\ngame season are:<br />\nJan. 14<br />\nPMC College<br />\nAway<br />\nJan. 17<br />\nMt. St. Joseph's<br />\nAway<br />\nFeb. 4<br />\nFranklin & Marshall 6:45 p.m.<br />\nFeb. 8<br />\nTowson State J.V.<br />\nAway<br />\nFeb. 11<br />\nDrexel<br />\n6:45 p.m.<br />\nFeb. 15<br />\nUrsinus J.V.<br />\nAway<br />\nFeb. 16<br />\nLoyola J.V.<br />\nAway<br />\nFeb. 18<br />\nDickinson J.V.<br />\nAway<br />\nFeb. 22<br />\nLoyola J.V.<br />\n6:45 pin.<br />\nFeb. 25<br />\nWestern Marylitnd J.V. Away<br />\n<br />\n'Niiook;<br />\n<br />\n1<br />\nj<br />\n<br />\n\f", "format": "basic_html", "processed": "LRPC Calls for Larger Grad Facilities<br />\nBy WILLIAM PATTEN<br />\nThis is the second in a series of articles on the<br />\nreport issued by the Long Range Planning Committee.<br />\n•<br /><br />\nThe Long Range Planning Committee has studied<br />\nGraduate studies at Hopkins in eight different fields<br />\nand has made recommendations and appraisals for<br />\nthe individual needs of each department. These areas<br />\nare: 1. Social Sciences 2. Humanities 3. Biological<br />\nSciences 4. Physical Sciences 5. Engineering Sciences<br />\n6. Earth Sciences 7. The Medical School.<br />\nThe problem that faces Hopkins is one of size. In<br />\nthe past we have been able to maintain excellent departments in spite of relatively small size. Today,<br />\nHopkins loses ground to other major universities, to a great extent, on account of inadequate resources<br />\nin both men and facilities. Much of the problem which<br />\nthe Committee describes stems from the necessity to<br />\nincrease size of the departments without injuring<br />\nthe school's academic excellence.<br />\nHUMANITIES, after long neglect, has been given<br />\ntop priority. Consequently much has already been<br />\naccomplished before the Committee's Report was<br />\never completed. Of a recommended 22 new positions,<br />\n21 have already been authorized by President Eisenhower. A new Humanities Center will offer opportunity for faculty to experiment in approaches to<br /><br />\nHumanities study, improve interdepartmental programs and attract new students and scholars. A<br />\nthree-year Ph.D. program in the English Department<br />\nis a bold experiment that, if successful, will be<br />\nadopted by other departments.<br />\nSeveral needs in the Humanities school remain to<br />\nbe settled. With increased faculty, the research facilities of the library will need improving. Secondly,<br />\nfinancial assistance for summer and sabbatical study<br />\nshould be provided by the University.<br />\nTHE SOCIAL SCIENCES will require new coordination between departments to offer stimulating<br />\nprograms and more extensive study.<br />\nIncreased staff will be required in all departments,<br />\nespecially Psychology and Social Relations. Eventually, with larger departments, an individual social<br />\nscience building will be required.<br />\nWith Hopkins situated so near to Washington, D.C.,<br />\nan excellent opportunity exists to initiate a \"National<br />\nPolicy Analysis Center\" in that city. This would be<br />\nmade available not only to Hopkins scholars but to<br />\nthe scholars of the nation as well. It would augment<br />\nHopkins' appeal to outstanding scholars.<br />\nThird, Hopkins must expand its areas of concentration. A crucial need is in the History Department<br />\nwhere there is little attention given to non-Western<br /><br />\ncivilizations. Oriental, Latin American and African<br />\nstudies are critically needed.<br />\nThe BIOLOGICAL, PHYSICAL, AND ENGINEERING SCIENCES have needs which are much in* common. New faculty must be added not only to existing<br />\nfields but in order to introduce new areas. Astrophysics, Particle physics and Geophysics must be included. New Laboratory facilities will consequently<br />\nbe needed.<br />\nTo compete with other leading universities Hopkins must place more emphasis on the theoretical<br />\nand experimental studies. To accomplish this, and because of an inordinate teaching load, thirty new positions must be added to the Physical Sciences faculty<br />\nalone.<br />\nAt the MEDICAL SCHOOL the training of Ph.D.'s<br />\nmust either be limited or better organized. If it is<br />\ndecided to adopt a sizable program then steps must<br />\nbe taken to heighten cooperation between Homewood and the Hospital, in schedules, facilities, and<br />\nadministration.<br />\nPOSTDOCTORAL studies should be given a much<br />\nclearer status within the Hopkins Community. Students doing research as associates, to gain recognition of their residence at Hopkins, should be organized into a society of Fellows, to perhaps do some<br />\nteaching yet lose none of their independence.<br /><br />\nitirttrr<br />\nVOL. LXX1, NO. 12<br /><br />\nJOHNS HOPKINS UNIVERSITY, MARYLAND, JANUARY 13, 1967<br /><br />\nMandelbaum Given<br />\nNew Appointment<br /><br />\nCouncil Wins 10%<br />\nBookstore Discount<br /><br />\nA $500,000 anonymous gift to came to Hopkins in 1957 as proSignificant changes in policies administration was very similar<br />\nestablish the Andrew W. Mellon fessor and chairman of the phiof the Hopkins bookstore will go to the one submitted by the StuProfessorship in the Humanities losophy department. He previinto effect February 1, 1967. dent Council in December. Bill<br />\nwas presented to the University ously had taught at Dartmouth<br />\nThe policy changes result from Reinsch, President of the StuCollege and Swarthmore College.<br />\nlaat week.<br />\nthe administration's acceptance dent Council, commented that<br />\nof a faculty committee's re- \"We are very pleased though<br />\nProfessor Maurice MandelIn addition to his duties here,<br />\nbaum of the Philosophy Depart- he is a consultant to the diport on the operations of the we would have liked some stument has been appointed to the vision of arts and humanities of<br />\nbookstore.<br />\ndent representation on the bookchair.<br />\nThe two most significant store committee.\"<br />\nthe U.S. Office of Education, and<br />\nHopkins President Milton S. is a member of the American<br />\nchanges will be a 10ç.i. discount<br />\nIn allowing a 10% discount,<br />\nEisenhower announced the re- Philosophical Association and<br />\non trade books for undergradu- the bookstore will now operate<br />\n*Apt of the gift following a the American Society for<br />\nates, graduate students and fac- on a break-even basis. The<br />\ndismeeting of the Board of Trus- Aesthetics.<br />\nulty members. In addition, a con- counts will effect all books<br />\nwhich<br />\ntee-s on Monday when formal actinuing<br />\ncommittee will be named the publishers allow a<br />\nMandelbaum was a Guggen35-40(:/0<br />\noeptance of the gift and an- heim Fellow in 1946 and,<br />\nto recommend policies and oper- discount. Text books, however,<br />\nbeappointment<br />\nnouncement of the<br />\nating procedures for the book- will not be discounted since<br />\nginning next July 1, will spend<br />\nthe<br />\nWas made.<br />\nstore. Dean Allyn Kimball of the publishers normally allow only<br />\na year at the Center for AdDr. Eisenhower expressed his vanced Study<br />\nFaculty of Arts and Sciences will a 20% discount on those<br />\nin the Behavioral<br />\nbooks.<br />\ngratitude to the unknown donor. Sciences at Palo<br />\nAlto completing<br />\nbe directly responsible for the Therefore, a text such as Sam\"We are indeed grateful to the a<br />\nbook on the history of 19th DR. MAURICE MANDELBAUM operations of the committee.<br />\nuelson's Economics would not be<br />\ngenerous donor, who prefers to Century<br />\nthought.<br />\nThe report accepted by the discounted but Thomas Hobbes'<br />\nremain anonymous, for this<br />\nLeviathan would. A text book is<br />\nmagnificent gift in honor of a<br />\nnot necessarily any book that<br />\nfamous American, and we are<br />\nis required for a course. Publishdoubly proud to be able to asers usually define textbooks as<br />\nsign this chair to one of the<br />\nthe hard-covered introductory.<br />\nUniversity's most distinguished<br />\nThe Baltimore Museum of Art's the back of the paper. The techRauschenberg studied at the<br />\ntype books.<br />\nacholars, Dr. Maurice Mandel- new<br />\nexhibit, \"Rauschenberg: nique has the illusionary effect<br />\nKansas City Art Institute, the<br />\nbaum.\"<br />\nIllustrations for Dante's Inferno\" of collage. The artist also uses<br />\nOn Trial Basis<br />\nAcademic Julien in Paris, with<br />\nComing at the height of a opened January 3 and will re- gouache, watercolor, cr<br />\nThe Committee report caua yo n,<br />\nfund raising drive aimed at main on view until January 29.<br />\nJosef Albers at Black Mountain tioned that the discount is on a<br />\nchalk, pencil, and erasures.<br />\nraising $4.5 million, Dr. EisenCollege, North Carolina and with one year trial basis depending<br />\nThe<br />\nexhibit<br />\nconsists<br />\nParticipated<br />\nShows<br />\nof 34<br />\nin Many<br />\nhower noted the special aid it<br />\nVaclav Vytlacil and Morris Kan- on whether or not the bookstore<br />\nRauschenberg has participated<br />\nsill provide \"to strengthen our drawings by Robert Rauschenbreaks even at the end of the<br />\nberg, a leading avant-garde art- in many important group shows tor at the Art Students League<br />\nposgrams in the humanities.\"<br />\nfiscal year Should the bookstore<br />\nillustrating<br />\neach<br />\nof<br />\nist,<br />\nthe<br />\ncanMellon<br />\npreviously, including \"Sixteen in New York.<br />\nlose money the discount would<br />\nAmericans\" and \"The Art of<br />\nAndrew Mellon was a famous tos of Dante's poem.<br />\nbe reduced in order to guaranDrawings in N.Y. Museum<br />\nAmerican financier who had<br />\nRauschenberg spent two and a Assemblage\" held at the Museum<br />\nHe had his first one man show tee the break-even principle.<br />\nModern<br />\nArt, New York, in<br />\nMajor interests in many Amen- half years in close study of the of<br />\nThe problem of cooperation<br />\nin New York in 1951 and has had<br />\nelan businesses and industries: work before doing the drawings 1959-60 and 1961 respectively.<br />\nbetween the faculty and the<br />\nmany since then in numerous<br />\nbanking, public utilities, coal, in 1959-60.<br />\nHe has participated in many<br />\nbookstore management was also<br />\ncities, including the 1960 showsteel,. and such firms as Gulf Oil<br />\nshows abroad, including \"Docuconsidered in the report. Among<br />\nInterpreting<br />\nDante<br />\ning of the Dante illustrations in<br />\nCompany and Aluminum Comthe points emphasized was the<br />\nAccording to the Baltimore menta II\", Kassel, Germany; \"V New York.<br />\npany of America.<br />\nPaulo,<br />\nBienal\",<br />\nSao<br />\nBrazil;<br />\n\"I<br />\nneed for the faculty to submit<br />\nHe resigned in 1921 as pres- Museum of Art the artist has atBiennale de Paris,\" all in 1959;<br />\nThe Dante drawings were re- \"in good time\" the lists of reident of the Mellon National tempted \"to interpret Dante's<br />\nAmericans\", Stockholm, Am- cently given to the Museum of quired and recommendea books<br />\n\"4<br />\naction<br />\nand<br />\nthought<br />\nthrough<br />\nsymBank to become U.S. Secretary<br />\nof the Treasury. He held that bols taken from modern life.\" sterdam, and Bern in 1962; and Modern Art by an anonymous for the various courses. This was<br />\nposition until 1931 serving un- Dante's imagery is translated by the \"XXXI Biennale,\" Vienna, donor. The exhibit, which is also a major point in the Stutravelling to a number of citie, dent Council's report.<br />\nder President Harding, Coolidge, modern symbols such as racing 1964.<br />\nis directed by .William S. Lieber-cars, athletes, warriors in gas<br />\nShould Not Subsidize<br />\nand Hoover.<br />\nReceived Award in Venice<br />\nIn reference to fiscal policies,<br />\nMellon, on his death, left $10 masks as well as abstract<br />\nThe artist was recently award- man, Curator of Drawings and<br />\nmillion to found the Mellon In- equivalents for the emotional ed the first prize for painting at Prints at the Museum of Modern the committee said that the UnArt, New York.<br />\niversity should not subsidize the<br />\nstitute in Pittsburgh; while Impact of sounds and smells.\"<br />\nthe \"XX.XII Biennale\", Venice.<br />\nThe transfer technique, which He has also received the first<br />\nSother gifts helped to create the<br />\nRauschenberg was commission- bookstore especially at the exNational Gallery of Art in Wash- Rauschenberg has pioneered, is prize at the \"Fifth International ed by Life magazine last year to pense of another part of Unievident in the drawings. The Exhibition of Prints\" in Ljubl- do a piece on Dante's Inferno. versity activity. The report said<br />\nington. He died in 1937.<br />\nPhilosopher's Studies<br />\ntechnique involves placing pho- jana, Yugoslavia, in 1963 and the The result was a full color fold- that \"charges made to the<br />\nProfessor Mandelbaum is one tographic reproductions against Chara Museum Prize at \"Third out in the magazine depicting bookstore should be based diof the leading philosophers in moistened areas of drawing paper International Biennale of Prints\" modern horrors and entitled rectly on cost, as nearly as<br />\nthis<br />\nthe United States today. He and transferring it by rubbing held in Tokyo in 1962.<br />\n\"Modern Dante's Inferno.\"<br />\n(Continued on Page 3)<br /><br />\nMuseum Displays Avant-Garde<br /><br />\ns<br /><br />\n71ST YEAR<br /><br />\nPAGE TWO<br /><br />\nNEWS-LETTER<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br /><br />\nLearned Societies Council VirginiaDean Chosen<br />\nGoucher President<br />\nTo Hold Symposium Here<br />\nA humanities symposium will<br />\nbe conducted by the American<br />\nCouncil of Learned Societies in<br />\nconnection with the new Hopkins Humanities Center at the<br />\nUniversity January 20.<br />\nThe Society is a private nonprofit federation of thirty-two<br />\nnational scholarly organizations<br />\nconcerned with the humanities<br />\nand the humanistic aspects of<br />\nthe social sciences.<br />\nDr. Charles S. Singleton, professor of humanistic studies and<br />\ndirector of the Center, will welcome the:delegates.<br />\nThe Hopkins Center offers an<br />\nInterdisciplinary approach to<br />\nhumanistic studies at all academic levels, including a program at the post-doctoral level.<br />\nDr. Craig R. Thompson, professor of English literature and<br />\nhistory at Haverford College,<br />\nwill be the symposium chairman.<br />\nDr. Erwin Panofsky, Professor<br />\nEmeritus at Princeton's Institute for Advanced Study and an<br />\nauthority on iconology, medieval,<br />\nRenaissance and baroque art,<br />\nwill speak on \"Erasmus of Rotterdam and the Visual Arts.\"<br />\n\"The Continuity of Erasmus\"<br /><br />\nCampus Notes<br />\nPeace Corps Exam<br />\nThe Peace Corps exam will be<br />\ngiven Tuesday, January 17, 1967,<br />\nin Room 201 of the Classroom<br />\nBuilding at 4 P.M. The exam<br />\nwill be administered only to persons who have either held a degree or are currently enrolled<br />\nIn a degree granting program,<br />\nand have completed the Peace<br />\nCorps Application Questionnaire.<br />\nPeace Corps Application Questionnaires are available at the<br />\nPeace Corps Office, located<br />\nin the ground floor of Shriver<br />\nHall. They must be submitted<br />\neither to the Peace Corps, Washington, D.C. 20525 or to the<br />\nCampus Peace Corps Office before the test date.<br /><br />\nFebruary Graduates<br />\nSeniors who plan to graduate in February must notify the<br />\n• Office of Undergraduate Studies,<br />\nGilman 238, January 18, 1967.<br /><br />\nS.C. Shipwrecked<br />\nThe Shipwreck Ball which was<br />\nscheduled to be held tomorrow<br />\nevening has been cancelled. The<br />\nDSRC found that a dance at that<br />\nparticular time would attract a<br />\nvery small number of couples.<br />\nThe SC, which was to co-sponsor the event, was quite perturbed<br />\nby the DSRC's decision.<br />\nThe next big, big dance to be<br />\nheld will be the Slalom Ball on<br />\nFebruary 10 at the Lord Baltimore Hotel. Tickets for this annual event will be going on sale<br />\nIn the near future.<br /><br />\nBridge Club<br />\nThe Johns Hopkins Duplicate<br />\nBridge Club will meet every<br />\nSunday at 1:30 P.M. in Levering<br />\nHall. This Sunday will be the<br />\nfirst full Master Point game.<br />\nWinners receive their entry<br />\nmoney back (50 cents) or a<br />\nfree entry to a future game.<br /><br />\nArt Exhibit<br />\nAn Art Exhibit of Established<br />\nMasters will be held in the Eisenhower Library early in January.<br />\nThe exhibit is to be sponsored by<br />\nthe Committee to Rescue Italian<br />\nArt and its chairman, John White,<br />\nProfessor of Art History at Hopkins.<br />\nAll students who possess works<br />\nof art by recognized masters,<br />\nboth past and present, are requested to contact either Gabe<br />\nWeisber or Frank Kowlsky of the<br />\nArt Department in order to lend<br />\nexamples to the show.<br /><br />\nwill be the subject of Dr. Roland<br />\nH. Bainton, Professor Emeritus<br />\nof ecclesiastical history at Yale<br />\nUniversity.<br />\nSir Roger Mynors, Corpus<br />\nChristi professor of Latin at Oxford University, will speak on<br />\n\"Erasmus and the Classics\", and<br />\n\"De Moths Disputancli: The<br /><br />\nApologetic Works of Erasmus\"<br />\nwill be the title of a talk by Dr.<br />\nMyron Piper Gilmore, the Director of Villa I Tatti in Florence and professor of history at<br />\nHarvard University.<br />\nThe symposium will be held<br />\nIn Shriver Hall and is open to<br />\nthe public at no charge.<br /><br />\nDr. Marvin B. Perry, Dean of<br />\nAdmissions and Professor of<br />\nEnglish at the University of Virginia has been named as President of Goucher College.<br />\nThe announcement was made<br />\nlast Saturday by Judge Roszel<br />\nC. Thomas, chairman of the<br />\nGoucher Board of Trustees. Dr.<br />\nPerry will succeed Dr. Otto F.<br />\nKraushaar who is retiring in<br />\nJune of this year. .<br />\nTamara Dahn, editor of the<br />\nGoucher Weekly, stated that<br />\nthe new President comes to<br />\nGoucher with a view that its<br />\nproblems do not differ significantly from any small liberal<br />\narts institution.<br /><br />\nNoted Author<br />\n_Dr. Perry is a noted author<br />\nand educator. He received his<br />\nPh.D. from Harvard in 1950 and<br />\nserved as an instructor there<br />\nuntil the following year.<br />\nDr. Perry has no set aims and<br />\nplans for his new position. He<br /><br />\n\"AND HERE'S ONE FOR YOU\" — President Milton Eisenhower<br />\ndistributes Distinguished Military Student awards to six Hopkins'<br />\nseniors at his executive office in the Homewood House. Only 10%<br />\nof each year's graduating class gets the honor. The Hopkins ROTC<br />\nhas 17 seniors this year. Souvenir pens were distributed after the<br />\nceremony. Left to right: Steve Mason, Mike Haas, Piece of Paper,<br />\nDr. Eisenhower, Alex Davidoff, Bob Ottesen, Vaughen Stelzenmuller, and Sam Bunge.<br /><br />\nhopes to develop all areas of<br />\nstudies equally in increasing the<br />\nacademic excellence of the<br />\nschool.<br />\nAsked about Hopkins-Goucher<br />\nrelationships by the Goucher<br />\nWeekly, the new president expressed a desire to increase interactions between the two institutions.<br /><br />\nDR. MARVIN PERRY, JR.<br /><br />\nthurs.,<br />\nfri., &amp;<br />\nsat.<br />\n'til 9.<br /><br />\nitadel<br />\npeter's frat jacket<br />\nlined for fall and<br />\nwinter, washable,<br />\nwater-repellent in<br />\nnavy and off white,<br />\n14.95<br /><br />\nFor interesting, informative reading on<br />\nand off the campus...<br /><br />\nTHESE PENGUINS<br />\nCAN'T BE BEAT!<br /><br />\nunlined, in 5 colors<br />\n11.95<br /><br />\nhen's<br /><br />\n•<br /><br />\nThese a're the Penguins that are in on campuses all over America. You'll find them in at your local college :bookstore, too.<br />\nPick up a couple today.<br />\nTHE ACCIDENTAL CENTURY. Michael Harrington. The author, whose widely read and discussed book, THE OTHER<br />\nAMERICA (also available in a Penguin paperback) stirred the<br />\nnation to action against poverty, turns now to the cultural<br />\nand intellectual crisis confronting the U.S.. and the rest of the<br />\n$1.25<br />\nWestern world in the 20th century.<br />\nOPINIONS AND PERSPECTIVES.Edited by Francis Brown. A<br />\ncollection of the most memorable essays to appear in The New<br />\nYork Times Book Review during the past decade. Contributors<br />\nInclude: James Baldwin, Lawrence Durrell, Leon Edel, Maxwell Geismar, Sean O'Faolain, Alfred Kazin, Robert Graves,<br />\n$2.23<br />\nSaul Bellow.<br />\nTHE GREAT SALAD OIL SWINDLE. Norman C. Miller. The<br />\namazing story of Tine De Angelis.(\"Put an apron and a clief's<br />\ncap on him and he would have looked right baking pizza,<br />\ndeadpan in the window of a little Italian restaurant.\") His<br />\nmanipulations of millions of gallons of nonexistent salad oil<br />\ncreated financial chaos in many quarters here and abroad.<br />\n$1.25<br />\nSEX AND THE SIGNIFICANT AMERICANS: A Study of<br />\nSexual Behavior Among the Affluent. John F. Caber and Peggy<br />\nB. Harroff. A report on yesterday's college students who are<br />\ntoday's affluent, influential opinion-makers. Based on 437<br />\nIn-depth interviews, this fascinating account reveals how<br />\nthese men and women feel and act with regard to marriage,<br />\npremarital sex, married love and extramarital relationships.<br />\n$1.25<br /><br />\nPENGUIN BOOKS INC<br />\n3300 Clipper Mill Road<br /><br />\nBaltimore, Md.21211<br /><br />\nPENGUIN BOOKS<br />\nAVAILABLE AT<br /><br />\nJOHNS HOPKINS<br />\nUNIVERSITY<br /><br />\nCHARGE IT:<br /><br />\nMEN'S WEAR<br />\n516 S. Broadway<br /><br />\nYou Won't Want To Miss The<br /><br />\nPremiere Jazz Festival,1<br />\nSUNDAY, Jan. 15th<br />\n8:00, Baltimore Civic Center<br />\nFeaturing:<br />\nMr. \"Take Five\" Dave Brubeck and<br />\nhis Quartet<br />\nComedian Dick Gregory<br />\nArthur Prysock<br />\nThe \"Wac-Wac boys,<br />\nYoung Holt Trio<br />\n(formerly with Ramsey Lewis)<br />\nThe Staple Singers<br />\nBlues Singer<br />\nBig Maybelle<br />\n\"Dont Pass Me By\"<br />\n\"96 Tears\"<br />\nRockin' Robbin<br />\nWEBB Soul Ranger, M.C.<br />\nTickets can be purchased at Your Record Shops<br />\nor at the Baltimore Civic Center Box Office.<br /><br />\nTickets $4-$3-$2<br />\na presentation of Premiere Attractions, Inc.<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br /><br />\nNEWS -LETTER<br /><br />\nCouncil Wins 10%<br />\nBookstore Discount<br /><br />\nrritag Vag Kihrratitt<br /><br />\n•<br /><br />\nBy WILLIAM FATTEN<br />\nPresident Johnson began his<br />\nState of the Union address with<br />\nvery little on his side. He never<br />\nlooks well on television and<br />\nwhatever the merits of his<br />\nspeech, his delivery could be<br />\ncounted on to butcher it. For<br />\nmonths discussion of a \"credibility gap\" had created a skeptical and critical audience. His<br />\nbeloved polls had been sliding for<br />\nsome time.<br />\nHowever, I believe that anyone that refused to endure<br />\nall these discomforts did not<br />\nonly himself but his President a disfavor. Regardless of<br />\nwhat emerges from all the rhetoric (if you will) the State of<br />\nthe Union Address presents a<br />\nvaluable look at the position of<br />\nour President.<br />\nIn our current readiness to<br />\ndebunk Lyndon Johnson, we may<br />\nhastily mistaken a well-intended<br />\ncandor for a lack of oratorical,<br />\nor even linguistic, talent. It<br />\nseems to me that Mr.'Johnson<br />\nspoke directly to each issue mentioned. The speech lacked much<br />\nof the \"apple pie and mother\"<br />\nappeals, that the President is<br />\nusually quick to disgorge when<br />\nacumen and honesty are demanded of him.<br />\nTo espouse a tax hike over national Prime Time, two years,<br />\nafter hailing his tax decrease as<br />\na sign of the good times ahead,<br />\nrequired political gut. More especially since the 6% sur-charge<br />\nwill be addressed specifically to<br />\na policy of his own that has<br />\naroused considerable debate and<br />\npolitical risk.<br />\nSecondly, in his discussion of<br />\nthe Vietnam War. Johnson refrained from depicting the rosy<br />\npicture that he so often invokes<br />\nfor his Great Society. As Eric<br />\nSevareid observed, the President<br />\nwas \"depressing\" on the issue<br />\nof the war. He made it clear<br />\nthat while he was President we<br />\nwould endure in Vietnam even<br />\nthough it could take decades.<br />\nFor Prime Time television this<br />\nis a very courageous statement.<br />\nA less obvious indication of<br /><br />\nthe President's candor are the<br />\nnumerous issues which he omitted altogether from the 1967<br />\nversion of the Great Society. To<br />\navoid civil rights, for instance,<br />\nfrom the usual panacea was not<br />\nonly politically dangerous but out<br />\nof character. Similarly, he restrained from promising an antimissile defense system that<br />\nwould of course be superior to<br />\nwhatever the Russians might<br />\nhave. This is the reverse of the<br />\nestablished tendency to offer<br />\nsomething for anybody and anything.<br />\nThe fact that Lyndon Johnson was candid for \"one brief<br />\nshining moment\" how eve r,<br />\nshould not cloud the content of<br />\nthe Address, which was the<br />\nState of the Union. If the man<br />\nwas honest with us he can still<br />\nbe in the'wrong. Three questions<br />\nwhich might arise from the talk<br />\nare basic.<br />\nThe first of these concerns<br />\nJohnson's persistent plea for<br />\npartnership in governmen t.<br />\nWhether this was a pipedream or<br />\na serious conviction, it runs<br />\ncounter to every principle on<br />\nwhich our government has persisted. The strength of federalism is the opposition of interdependent elements. While Congress has never recovered from<br />\nthe executive monolith of Frank-<br /><br />\nPAGE THREE<br /><br />\nlin Roosevelt's Administration, to<br />\nconceive of total cooperation and<br />\ncentralization in our government,<br />\nas Lyndon very well may, is dangerous.<br />\nConcerning Vietnam, Johnson<br />\nseems confused. The fight<br />\nagainst Communism in the hinterland will be an American responsibility. The erection of a<br />\nstable government in South Vietnam will remain a Vietnamese<br />\nconcern. Judging from our record<br />\nof success in either attempt and<br />\nfrom the original objectives with<br />\nwhich Mr. Dulles embroiled us in<br />\nthe war, the President might<br />\nhave confused not only the<br />\nAmerican role but the necessary<br />\npriorities.<br />\nDespite the Immediate issues<br />\nthat will be faced in the next<br />\ntwo years, President Johnson's<br />\naddress affords comfortable relief<br />\nwhen it is remembered that just<br />\nten years ago the President of<br />\nthe United States was espousing<br />\n\"massive retailiation\" against<br />\nCommunist aggression, \"tactical\"<br />\nnuclear bombing for the security<br />\nof Formosa and the \"encirclement\" of Soviet Russia. If Lyndon Johnson is at times befuddled by criticism and over-anxious to implement his sincere<br />\nconvictions, it is not necessarily<br />\nimplied that he is intentionally<br />\ndeceptive.<br /><br />\n(Continued from Page 1)<br />\nis practicable, without either<br />\nhidden subsidies being paid by<br />\nthe University or hidden profits accruing to the University?'<br />\n\"This problem stems from the<br />\nCouncil's statement that the<br />\nUniversity was using bookstore<br />\nprofits to subsidize less profitable undertakings. The committee, however, stated that \"in<br />\ncertain respects, we are convinced that the past and present accounting procedures do<br />\nnot entirely reflect this point<br />\nof view.\"<br />\nDr. Milton Eisenhower, commenting on the report, explained<br />\nthat the faculty discounts were<br />\noriginally instituted because salaries were low and tuition for<br />\nstudents was not high. But now<br />\nwith rising tuition, Dr. Eisenhower felt strongly that a student discount was necessary. He<br />\nadded that he was \"extremely<br />\npleased\" with the faculty report.<br />\nThe so-called bookstore controversy was initiated last year<br />\nby a. series of editorialS and articles in the Newsletter calling<br />\nfor a study of bookstore policy.<br /><br />\nAt the end of the previous academic year, the Student Council<br />\nappointed Jim Jacobs to do a<br />\nstudy of the situation: Jacobs<br />\nsubmitted his report to the<br />\nCouncil in December which then<br />\nasked the administration to<br />\nstudy it. At the same time, a<br />\nfaculty committee under the direction of Dr. Owen Phillips,<br />\nProfessor of Geophysical Mechanics, undertook their own<br />\nstudy of the situation. Their report was the one which the administration accepted. It should<br />\nbe noted that the faculty report<br />\ncontained the same financial<br />\nrecommendations as the report.<br />\nof the Student Council.<br />\nMembers of the faculty committee. included, John Bertha\",<br />\nthe Johns Hopkins Librarian, Dr.<br />\nJohn Gryder, Associate Professor of Chemistry, Dr. Richard<br />\n1VIacksey, Dean Richard Mumma<br />\nof the Evening College, Dean<br />\nRobert Strider, Associate Dean<br />\nfor Administration, Dean Carl<br />\nSwanson, Associate Dean for<br />\nUudergraduate Studies, and Dr.<br />\nPhillips.<br /><br />\n* * * * * * * *<br /><br />\nNEED A<br />\nNEW HOME!<br /><br />\nWhen you're in the party<br />\nmood<br />\nMake it nice 'n easy with<br />\nHarry Little food<br /><br />\nHopkins students, new and old, try:<br /><br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br /><br />\ntwo reasonably wellbehaved cats looking for a<br />\nnice home. We are 6 mo. old<br />\nand housebroken. The male<br />\nis pinkish tan; the female<br />\nblack with brown and orange<br />\nmarkings.<br />\nWe are<br /><br />\nSubmarines • Pizza<br />\nSpaghetti • Sour Beef<br /><br />\n3320 Greenmount Ave.<br />\nCARRY OUT SERVICE<br /><br />\nSPAGHETTI MEALS<br /><br />\nCALL 889-3831<br /><br />\nPIZZA PIE A SPECIALTY<br /><br />\nWe are accustomed to students and tolerate them very<br />\nwell.<br /><br />\nHARRY LITTLE<br />\nCARRY OUT SHOPS<br /><br />\nColl Max<br />\n467-9262<br /><br />\nSAMPLE-STORE'S SENSATIONAL<br />\n* * * * * * * *<br /><br />\nDOLLAR DAYS SALES<br /><br />\n$1<br /><br />\nCoinplete Bachelor<br />\nService<br /><br />\nELECTRICAL ENGINEERS<br />\nMECHANICAL ENGINEERS<br />\nPHYSICISTS<br /><br />\n• SPORT COATS • SUITS<br />\n• DRESS SHIRTS • JACKETS<br />\n• SPORT SHIRTS<br /><br />\nNorden<br />\nwill<br />\nbe on campus<br />\nJanuary 20, 1967<br /><br />\nWhen You Buy One At<br />\nOur Regular Low Price<br /><br />\nFLUFF DRY &amp; FOLD<br />\nSHIRTS—DRY CLEANING<br /><br />\nAMPLE<br /><br />\nS<br /><br />\nWaverly Laundromat<br /><br />\n3031 Greenmount<br /><br />\nTORE<br /><br />\n3330 GREENINIOUNT AVE.<br />\n467-2123<br /><br />\n(Friday)<br /><br />\nOnly A Few Blocks From<br />\nThe Hopkins Campus<br /><br />\nGraduating Electrical Engineers, Mechanical Engineers<br />\nand Physicists are invited to discuss career opportunities<br />\nin research, design. development and manufacturing in<br />\nareas such as:<br />\nAirborne Radar Systems / Video Display Systems / Solid<br />\nState Device Development / Precision Components /<br />\nAdvanced Computer Techniques / Advanced Electra.<br />\nmechanical Design Techniques<br /><br />\nOpen Every Evening<br /><br />\nNorden's location in Norwalk, Connecticut is easily as.<br />\ncessible to the entire New York metropolitan area.<br />\nFor convenient appointment, please make arrangements<br />\nin advance through your Placement Office.<br /><br />\nNorden<br /><br />\nHOPKINS IS FINDING OUT THAT MEALS<br />\nARE BETTER AND CHEAPER AT . ..<br /><br />\n\"Song and Prayer for<br />\nChristian Unity\"<br />\nAn Ecumenical Service<br />\nSpeaker: Rev. John Vannarsdall<br /><br />\n32ND &amp; OLD YORK ROAD<br /><br />\n4(<br /><br />\n4(<br /><br />\nChaplain, Gettysburg College<br /><br />\nEpiscopal Cathedral<br /><br />\n1.95<br /><br />\nUnited<br />\nAircraft<br /><br />\nAn Equal Opportunity Employer (M&amp;E)<br /><br />\nHARLEY'S<br />\nTIDEWATER FARMS<br />\nWITH<br />\nSALAD,<br />\nFR. FRIES<br /><br />\nCINVIS1044<br /><br />\nFRESH<br />\nBREAD &amp; BUTTER<br /><br />\nUniversity and N. Charles<br />\nSponsored by<br /><br />\nHARLEY OWNED &amp; OPERATED<br /><br />\nThe Episcopal, Lutheran, illethodim and<br />\nRoman Catholic Student Groups af<br />\nJohns Hopkins Univerit)<br /><br />\nALSO SANDWICHES, CHILI<br /><br />\nALL WELCOME!<br /><br />\n-4(<br /><br />\n-4( 4(<br /><br />\n4(<br /><br />\n4(<br /><br />\n4(<br /><br />\n4(<br /><br />\n4(<br /><br />\n-0(<br /><br />\n4(<br /><br />\n4(<br /><br />\n4(<br /><br />\n4(<br /><br />\nSUNDAY, JANUARY 15th<br /><br />\n7:30 P.M.<br /><br />\nAEWS-LETTER<br /><br />\nPAGE FOUR<br /><br />\n1:ipkitts littmi-trittr<br />\nEditors-in-Chisf<br />\nMelvin R. Shuster<br /><br />\nHenry 1. Korn<br />\nBusiness Managers<br />\nAllan Elide)!<br /><br />\nWilliam Z. Schenck<br /><br />\nCoarse Offering<br />\nWith this week's release of the second semester<br />\ncourse schedule, the Hopkins student was once again<br />\nforced to find new, desirable and non-conflicting courses<br />\nin an offering consisting of little originality and poor<br />\nscheduling.<br />\nIt is difficult to blame any one sector of the university for this condition. The Registrar's Office, most<br />\noften the scapegoat, faces a monumental task every<br />\nsemester in scheduling classes of both diverse and correlative natures to the satisfaction of each department,<br />\neach faculty member and each student. The difficulty of<br />\nthe job is compounded when the registrar follows the<br />\ntraditional practice of scheduling low level courses in<br />\nthe morning, labs and electives in the afternoon. The<br />\nRegistrar's Office, responsible to both the faculty's and<br />\nthe students' needs and desires, has limited alternatives in determining the best schedule for each.<br />\nMany faculty members have other obligations than<br />\nteaching at Homewood and because of this can only<br />\nmeet classes one or two days a week. Also, the faculty,<br />\nwith demands and pressures for publishing, must be<br />\nable to choose when they most desire to have classes<br />\nBO their teaching obligations can be met without greatly<br />\ninterfering with their other commitments. Johns Hopkins, established along the lines of the nineteenth century German university, was imbued from the start<br />\nwith the concept of \"lehrfreiheit\"—or academic freedom. Under this system, a professor ideally teaches<br />\nwhat and when he wants, with the assumption that he<br />\nwill be a more effective teacher because he is free to<br />\nsay or do what he pleases. Because this is an ingrained<br />\nbelief at Hopkins-e--and academic freedom has proved<br />\neffective here--there must he no governing power over<br />\nthe faculty dictating what and when it must teach.<br />\nThe students, however, have the explicit right to<br />\ndemand that any wrongs—even if they only seem to<br />\nbe wrong to the students—be examined and rectified if<br />\nthey actually are found to be wrong. This right, \"lehrenfreheit\"—the other half of academic freedom—must<br />\nbe guarded constantly and diligently by the student<br />\nbody, just as the rights of the faculty must be guarded.<br />\nWhere various academic departments at Hopkins<br />\ndeserve the greatest criticism is in their course offerings. The foreign languages, although not a common<br />\nmajor, consistently has a poor and repetitious selection<br />\nof courses beyond the elements. For example, German<br />\noffers one course in literature next semester, while<br />\nFrench has three, only one of which has not been taught<br />\nin the last two years. Political Science, one of the most<br />\npopular majors, offers a mere four courses, as compared to eleven courses offered in that department in<br />\nthe second semester last year. Of all the humanities departments only history has taken an initiative in expanding its program and in starting new courses, notably<br />\n\"The Negro in America\" and \"Germany since 1870.\"<br />\nThe problem of sparse course offerings is due<br />\nsimply to a shortage of professors; an overload of work<br />\nfor any one professor does mere ultimate harm than<br />\ngood for the student.<br />\nConflicts among desired courses are unavoidable to<br />\nsome degree in any large university, but a student<br />\nshould never have to be beset with as many conflicts as<br />\nhas been the case in recent years. It is difficult to find<br />\na solution; perhaps a computer could determine the<br />\nbest of all possible combinations, that which is most<br />\nserviceable to both students and faculty. Perhaps a<br />\nchange in the weekly schedule with more two-hour<br />\ncourses in the 300 level and one-hour-and-fifteen minute courses twice a week in the lower level. If rooms are<br />\navailable, some higher level courses could meet in the<br />\nevening.<br /><br />\nBefore any reforms in the system can he made,<br />\nit is up to the Registrar's Office to find out exactly how<br />\nmany students have been affected and to what extent<br />\nconflicts have arisen. The Registrar's Office, as the organizing body in the University, must take a more active<br />\npart in finding where the problems lie and then in<br />\nameliorating them.<br /><br />\nExtravagant Praise Dept.<br />\nHurray for the News-Letter that inspired the Reinsch<br />\nwho prodded the Council that frightened the Faculty who<br />\npushed the Administration to junk the house that Vayne<br />\nbuilt.<br />\nJust under a year ago the News-Letter inaugurated<br />\nthe campaign to reform the Bookstore. Its resolution is<br />\na fair one, the bookstore will now be faculty controled<br />\nand students will receive 10% discounts on all but<br />\nformal textbooks.<br />\nIncidental apologies are due Mr. Vayne who served<br />\nas everybody's whipping boy during the high days of<br />\nthe crisis. The News-Letter would like to retract its<br />\nopinion that he is a menace to Western Civilization.<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br /><br />\nThe Fall of Adam, 1967<br />\nBy GERALD BRECHER<br />\nNotwithstanding Adam Clayton Powell's perhaps extravagant<br />\nrhetoric after the events of Monday and Tuesday of this week, it<br />\nis still possible to take a view of<br />\nhis situation that may hopefully<br />\navoid extreme positions on either<br />\nside.<br />\nBut then, Adam Clayton Powell<br />\nis an extravagant man, and for<br />\nhis extravagance he is being laid<br />\nlow. When such a man is humbled<br />\nit is too easy for the humblers to<br />\ngloat obscenely, and for the humbled to lash out unreasonably in<br />\npitiful display of a loss of honor.<br />\nBlow to Pride<br />\nAdam Powell has suffered more<br />\nthan mere political setback; he<br />\nhas been dealt as devastating a<br />\nblow to his pride as to his political power. For to a man such as<br />\nPowell, pride is measured in less<br />\nmundane terms than mere voting<br />\npower or the ability to distribute<br />\npatronage.<br />\nTo Powell, who as a young<br />\nchild in Harlem was beaten by<br />\nthe Irish for being too dark, and<br />\nby the Negroes for being too<br />\nlight, pride is measured in the<br />\nseemingly imperceptible, yet terribly significant quivers of uncertainty and anxiety that men—<br />\nboth white and black—must evidence before him. Pride is embodied in the certain knowledge that<br />\nhe, Adam Powell, is on top of<br />\nthose who would put him down.<br />\nKnocked Down<br />\nToday, Adam Powell has been<br />\nknocked down. And because<br />\nAdam Powell is a fighter bred to<br />\nno small degree in a far more<br />\nsavage world than we could care<br />\nadmit exists, we shall not see<br />\nAdam Powell snivel and whimper.<br />\nPowell's sneering retorts to his<br />\ntormentors are not the pitiful<br />\nwhines of a man who knowing he<br />\nis down consents to stay down<br />\nand kicked some more. Adam<br />\nPowell's honor, curious as it may<br />\nseem to those of \"gentler breeding\", is not to be satisfied by<br /><br />\nsilent suffering. His pride is not<br />\nAdam Powell would still be the<br />\nto be assuaged by quiet accept- \"flamboyant\" playboy of Congress<br />\nance of his defeat.<br />\nif he hadn't gotten hung up on<br />\nAdam Powell fights back, with that slander charge. But in full<br />\nhis greatest weapon; his almost view of the public, his refusal to<br />\nawe inspiring tongue. Adam Pow- pay—to even acknowledge his<br />\nell at full stride into an address guilt—these were unpardonable<br />\nof significance is a magnificent sins.<br />\nexhibition of the power of human<br />\nPrideful Soul<br />\nspeech to seize upon the mind<br />\nAnd so not for his mis-use of<br />\nand clamp down upon the con- committee funds, and not for missciousness with a golden toned use of his chairman's power—but<br />\ntorrent of words. And these are for getting his prideful soul emnot just dead words and phrases broiled within the glaring view<br />\nthrown at us—these words come of a baleful public, Adam Clayton<br />\nalive with the many nuances of Powell this week is a beaten man.<br />\ninflection that Adam Powell<br />\nThere are too many skeletons<br />\nthrows into his delivery. Powell in Capitol Hill closets to mainis truly of the golden tongued tain with any honesty that Powschool of oratory, and I do not ell's demise is a direct result of<br />\nthink that his voice shall be his committee irregularities. But<br />\nstilled for long.<br />\nonce he exposed himself in the<br />\nJames case, he could no longer<br />\nVocal Undoing<br />\nIronically, perhaps with some claim that special privilege that<br />\nsense of divine justice, Powell's is the politicians to have fiscal<br />\ngreatest strength, his voice, misdeeds hidden from view.<br />\nproved to be his undoing in the<br />\nNegroness<br />\nend. When Adam 'Powell called<br />\nHad Adam Powell been white<br />\nEsther James—Harlem cleaning there is legitimate question<br />\nwoman—a bag woman, a graft whether any of thiS would have<br />\ncollector for the police in 1964, transpired. There is no certainty<br />\nhis luck ran out on him. Strapped to this, but let there be no doubt<br />\nwith a judgement from the court that it is of major importance in<br />\nof close to fifty thousand dollars, this inestance. It is too much to<br />\nPowell chose to ignore the order. ask that we divorce Adam PowPerhaps he should have paid; ell's avowed color from our<br />\nheaven knows the money—if it minds when we take the whole<br />\nwas not there—could have been matter under consideration.<br />\nraised. Adam Powell's people<br />\nAdam Powell, who 'passed' his<br />\nhave been known to support him way through college, and who<br />\nfinancially in the past. Adam could do so npw, chose to live the<br />\nPowell is no pauper. Had he paid, evident lowness of the Negro<br />\nthere is no question but that the life, and climb above it, not as<br />\nactions of this week would never an 'Uncle Tom' as in the case of<br />\nhave transpired.<br />\nthe new senator from Massachusetts, but as 'Whitey's nemesis.<br />\nNo Graft Hanging<br />\nBut political graft is not And it is too much to assume<br />\nenough to hang a man for in this that it is not Whitey who is putcountry—too many would hang; ting Adam down.<br />\nAdam Powell kept the faith. If<br />\nand those who wanted Adam<br />\nPowell's hide tacked up on a wall he did not spread it gently, he is<br />\ncould never get to him without a paying for it now. Do not gloat<br />\ngood enough excuse. Adam's over this fall of Adam. It may<br />\ncrack at a tired old cleaning perhaps in some sense of abwoman gave them their chance. stract morality be right; but ConAnd vultures that they are, they gress this week has done an<br />\nhave moved in to strip his bones. unwise thing.<br /><br />\nBook Review<br /><br />\nA Ternoignage of Suffering?<br />\nBy MENACHEM ROSENSAFT<br />\nA survivor of the Nazi death<br />\ncamps recently went to the Soviet Union to see for himself if<br />\nthe rumors on the desperate<br />\nstate of Russian Jewry were<br />\ntrue. He knew that there were<br />\nonly two possibilities: Either<br />\nthe entire situation was greatly<br />\nexaggerated, or else, the truth<br />\nwas even more terrible than the<br />\nrumors indicated. He had to<br />\nfind out.<br />\nThe result of his trip, or of<br />\nhis pilgrimage, for it can be<br />\ncalled that, were first a series<br />\nof articles in one of the biggest<br />\nIsraeli newspapers. They were<br />\nthen published as a book in<br />\nParis, and, late in 1966, an English translation of that work<br />\nappeared in the United States.<br />\nIn his introduction to Thp<br />\nJews Of Silence, (Published by<br />\nHolt, Rinehart and Winston;<br />\ntranslated with an Afterward<br />\nby Neal Kozodoy) the author<br />\nexplains his mission: \". . . I act<br />\nas a witness, and my responsibilities are limited to those of<br />\na witness. I went to Russia<br />\ndrawn by the silence of its Jews.<br />\nI brought back their cry.\"<br />\nIn Russia, he did not interview<br />\ncountless officials and leaders of<br />\nthe community, as is the fashion;<br />\nhe was not interested in hearing<br />\nthe stereotype words of the appointed mouthpieces; he did not<br />\nsearch for possible solutions and<br />\nremedies. Rather, he watched.<br />\nHe found that his greatest<br />\nfears were realized, for the persecution of the Jews in Russia<br />\nIs not a physical one. It is a<br /><br />\npolicy of assimilating by force,<br />\nof choking any breath of identification with Judaism in the<br />\nyoung. Synagogues still exist,<br />\nbut the Jews are discpuraged<br />\nfrom going. No new prayer books<br />\ncan be published, as is permitted<br />\nto the Christian churches. But<br />\nnevertheless, there is life. In<br />\ntheir passports, they have to<br />\nhave a stamp indicating their<br />\nreligion; they cannot teach the<br />\nhistory of their faith in the<br />\nlanguage of their past; and they<br />\npersist. They refuse to let themselves be liquidated. They defy<br />\nlogic and reason, and continue<br />\nto be. A child cries \"I am a<br />\nJew,\" without knowing why. The<br />\nyouth does not know how to<br />\npray, it does not believe in God.<br />\nit is a proud Russian youth, it Is<br />\ndevotedly Communist, and still it<br />\nis a Jewish youth.<br />\nWhat impressed Elie Wiesel<br />\nthe most? Their eyes. He saw the<br />\ndespair of a people in the depth<br />\nof those pupils, and felt the invisible tears running from them.<br />\n\"Those eyes negate the value of<br />\nwords; they dispose of the need<br />\nfor speech.\" And where did he<br />\ngo to find those eyes? Mostly,<br />\nhe searched for them in the<br />\nplaces of worship. He was there<br />\nat the time of the high holidays.<br />\nand, in opposition to the wishes<br />\nof the authorities, he found the<br />\nsynagogues packed. But the men<br />\nrefused to speak with him at<br />\nfirst. They were afraid of associating with the foreigner. It<br />\nwas only when he, too, started<br />\nto pray, aloud, with the devotion<br />\nand the abandonment to his<br /><br />\nspirit which he had learned as a<br />\nboy in Hungary, before the war,<br />\nthat they accepted him. ,They<br />\nfelt that this was not a mere<br />\nobserver. Here, among them, sat<br />\none who could understand.<br />\nAnd they unburdened themselves to him. In a sukka, the<br />\nhut in which the Feast of Tabernacles is celebrated, he heard<br />\ntheir sobs, disguised as song;<br />\nabove all, they wanted him to<br />\ntell their brethren in the other<br />\nworld that they fulfilled the<br />\ncommandment of joy. A captain<br />\nof the Red Army showed him his<br />\nson as he pointed at a crowd<br />\nof young people who were singing Hebrew melodies on the<br />\nnight of Simchat Tora, the Rejoycing of the Tara, minutes<br />\naway from the Kremlin: \"He's<br />\nhere somewhere. Look closely,<br />\nthey are all my son.\"<br />\nThe time came when the author had to return. \"I believe<br />\nwith all my soul,\" he writes at<br />\nthe end of the magnificent volume, \"that despite the suffering,<br />\ndespite the hardship and the<br />\nfear, the Jews of Russia will<br />\nwithstand the pressure and remain victorious. But whether or<br />\nnot we shall ever be worthy of<br />\ntheir trust, whether or not we<br />\nshall overcome the pressures we<br />\nourselves have created, I cannot<br />\nsay. I returned from the Soviet<br />\nUnion disheartened and depressed. But what torments me<br />\nmost is not the Jews of Silence<br />\nI met in Russia, but the silence<br />\nof the Jews I live among today.!'<br /><br />\n!HOMEWOOD, BALTIMORE, JANUARY 13, 1967<br /><br />\nNEWS-LETTER<br /><br />\nPAGE FIVE<br /><br />\nT*<br /><br />\nTHE WEEKLY NEWSMAGAZINE<br /><br />\nMAN OF<br /><br />\nE YEAR<br /><br />\nMAN OF THE YEAR? What kind of man makes a<br />\nMan of the Year? To determine the answer to this<br />\ndifficult and highly complex question, the editors of<br />\nT*ME took many factors into account. The Man of<br />\nthe Year would, of course, have to be representative<br />\nof the new America, the vibrant young America of<br />\n1966. He would have to be a man much in the news,<br />\nmuch with the news—a man who makes the news<br />\nwhile others sit around and wait for news to happen.<br />\nWe wanted, also, the man who has sold the most<br />\nnews, and it was a matter of simple statistics to see<br />\nwho that would be. But there's more to a Man of the<br />\nYear. He has to be the kind of man who has made<br />\n1966 what it was, distinct, different, exciting to be<br />\nalive in. Who could that be?<br />\n.0%1. t<br /><br />\n4C •<br /><br />\n1;4\"<br /><br />\nWell, it wasn't long before the editors saw what<br />\nwas probably plain to all of you out there from the<br />\nbeginning—that is, the Man of the Year for 1966 obviously has to be one of this year's famous mass murderers. It's easy to see why. 1966 was the year of the<br />\nmass murder; it was defined, in fact, by mass murder,<br />\nand its counterpart, the Mass Murder Article in T*ME.<br />\nYes, a mass murderer it had to be, but which one?<br />\nWe must admit, after long deliberation on the<br />\nmatter, that the editors cannot decide which of these<br />\nMen stands out above the rest, and we certainly do<br />\nnot wish to anger any of these men by not awarding<br />\nhim the title—which is not hard to understand. Therefore, the editors have decided to place the decision<br />\nup to the judgment of the readers of T*ME Magazine,<br />\nwho, in the end, must make each and every man of<br />\nthe year, every year. So it's your ball game, our<br />\nfriend! Below we have printed a ballot for your use.<br />\nPlease fill in the name of the mass murderer you prefer and mail it in to us here at T*ME. We will tabulate<br />\nthe votes, and the winner will receive, the title of<br />\nMan of the Year. Please take into account, as you<br />\nvote, that mass murderer whose crime most interested you, either because of its peculiar flair, or possibly because of the large number of victims, or for<br />\nany aspect of his character. Naturally, a good gauge<br />\nof the mass murderer most interesting to you is the<br />\nnumber of times you read our article on him when<br />\nhe was most in the news, but just in case you've for-gotten one or more of this year's crimes, we include,<br />\nbelow, a short recap of each candidate's career.<br />\nPlease vote! It is your right and duty as an American!<br /><br />\nso totally repulsed they found it hard to conduct a<br />\nsearch for the killer. \"Who wants to know a man<br />\nlike that?\" as the Captain put it.<br /><br />\nLYNDON BAINES JOHNSON<br />\nLast year's top mass murderer was a Texas plowboy who has come a long way in the American crime<br />\nbusiness. Lyndon Baines Johnson of Johnson City,<br />\nTexas graduated from his humble origins of torturing<br />\nhalf caste Indians (\"I reckon honey child the only<br />\ngood Injun is a dead one.\") to the American Presidency where he killed John F. Kennedy, Lee Harvey<br />\nOswald, Jack Ruby and thirteen other people whose<br />\nnames have been withheld by request. Johnson, an<br />\neasy going ex-school teacher whose hobby is bombing defenseless people, culminated a remarkable five<br />\nyears when on December 25 he told Jack Ruby to<br />\nsuddenly die of cancer.<br /><br />\nRobert Benjamin Smith<br />\nCHARLES WHITMAN<br /><br />\nRICHARD SPECIE<br /><br />\nThe Cincinnati Strangler<br /><br />\nCHARLES WHITMAN<br />\nCharles Whitman, a brilliant scientist doing research at the University of Texas, in Texas, last<br />\nAugust (or September) terrorized the University<br />\ncampus with a rifle. He stationed himself atop a<br />\ntower overlooking the campus and shot, sniper-style,<br />\ndown on passers-by. Later, when University officials<br />\nand others realized what Whitman was doing, they<br />\nadvised anyone using that portion of the college<br />\ngrounds to \"watch his (or her) step.\" Nevertheless,<br />\nWhitman managed to kill almost twenty in his spree<br />\nof terror, keeping police ducking for cover with his<br />\nshots and running from one part of the tower to<br />\nanother repeatedly, in a manner described by one<br />\nobserver as, \"the way a crazy man would run around.<br />\nLike a crazy person.\" But crazy or not, there is little<br />\ndoubt that Whitman was as effective a marksman as<br />\nhas been seen in this country since the days of Buffalo<br />\nBill Cody and Kit Carson. Experts agree that in this<br />\nage of soft, flabby Americans, riflery is fast becoming<br />\na lost art, and that there are few others in this nation<br />\nwho could have sustained the accuracy displayed by<br />\nWhitman on that day for more than a few shots.<br /><br />\nLYNDON BAINES JOHNSON<br /><br />\nDr. Hochhausler, famed surgeon and bereaved husband, stepped up to his blue Triumph sports car<br />\nlast October, only to discover his wife, Alice, who<br />\nhad spent much of her time nursing a flower garden in<br />\ntheir spacious backyard in the suburb of Clifton,<br />\nsprawled obscenely in the front seat. She was wearing a red robe. The cord of the robe has been cited<br />\nas the murder weapon.\"We found this red terrycloth<br />\ncord around her throat,\" related a Cincinnati police<br />\nofficer, \"and we suspect that it may be the belt to her<br />\nrobe, which is made of the same material and is the<br />\nsame color.\"<br />\nWhen Mrs. Hochhausler left her new, nine-seater<br />\nstation wagon, she was clubbed from behind, causing<br />\nher dental plates to fall from her mouth. The unfortunate woman was then dragged to the garage<br />\nwhere she was raped and placed in the blue Triumph<br />\nsports car.<br />\nMrs. Hochhausler is not alone. Three other middleage Cincinnati women were strangled during 1966,<br />\nand the Cincinnati Strangler is expected to best himself during 1967.<br /><br />\nPlease Vote<br />\nThere you have it! The five top money makers for<br />\nT*ME magazine of the year 1966. The five most<br />\nfamous mass-murderers, in a year that may yet<br />\nprove to be a trend-setter. Tell us your choice, for<br />\nit's only with your cooperation that T*ME will tell.<br /><br />\nRICHARD SPECK<br />\nChicago, long maligned as a city filled with crime<br />\nand violence, surprisingly has but one entrant in this<br />\nYear's race for Man of the Year, while Texas boasts<br />\ntwo. Nevertheless, Chicago is ably represented by<br />\nRichard Speck, alleged killer-rapist-botherer of eight<br />\nstudent nurses in a dormitory in Chicago. According<br />\nto the statements of a ninth girl, who escaped his<br />\nwrath (she denied the use of bribery when questioned<br />\nby T*ME), Speck burst in upon the reposing lovelies<br />\none evening \"out of nowhere, through the door,\" and<br />\nproceded to completely bother them,'after which he<br />\nmurdered them.<br />\nPolice arriving at the scene found the girls' room<br />\nFt shamble, the sheets bloody and dragging on the<br />\nfloor, blood covering the floor and walls and windows<br />\nand door and chairs and desk and ceiling. One of the<br />\ngirls was apparently in the middle of a novel when<br />\nthe attack occurred, and it was lying open on the<br />\nfloor, pages 218-219 completely soaked with blood.<br />\nThe lone survivor, said Chicago precinct Captain<br />\nChuck Whitman, \"was all covered with like a lot of<br />\nblood.\" He told T*ME reporters that the police were<br /><br />\nBobby Smith was always an impressionable boy,<br />\nand murder impressed him most. \"The only good<br />\ninjun is a dead one,\" said Bobby to a T*ME staff<br />\nreporter while sipping a black and white soda. This<br />\nquiet ambitious high school student had a plan, and<br />\none dry, dusty day in Mesa, Arizona last August he<br />\ncarried it out.<br />\nEarly one morning he set out from home carrying<br />\na small attache case filled with two dozen baggies, a<br />\nblue shower cap, three thousand feet of 50 lb.-test<br />\nnylon cord, and assorted firearms. He was heading<br />\nfor the Rose-Mar College of Beauty.<br />\nHe entered the shop and gained everyone's attention by firing a pistol. He then explained to the five<br />\nwomen and two children present that he was about<br />\nto smother them. Laying down his pistol on a formica<br />\ncounter that had been installed the previous day, he<br />\npulled from his attache case an unopened box of<br />\nbaggies. To his distress, he discovered that the baggies were too small to fit over the heads of the<br />\nwomen. Without delay, he replaced the baggies in the<br />\ncase and ordered the women and children to lie in a<br />\ncircle on the floor. \"Like the spokes of a wheel,\"<br />\nBobby later explained to disgusted policemen. When<br />\nthey had ararnged themselves properly on the floor,<br />\nBobby walked around the circle firing his gun. \"It<br />\nwas easier than shooting pipes in a carnival,\" he later<br />\nstated to interested reporters.<br /><br />\nROBERT BENJAMIN SMITH<br /><br />\nBALLOT<br />\nT*ME MAN OF THE YEAR<br />\nC/O THE NEWS-Lk:C.1'ER<br />\nBOX 1230 J.H.U.<br /><br />\nCHARLES WHITMAN<br />\nRICHARD SPECK<br />\nLYNDON BAINES JOHNSON<br /><br />\nEl<br /><br />\nROBERT BENJAMIN SMITH<br />\nTHE CINCINNATI STRANGLER 0<br />\nTHE CINCINNATI STRANGLER<br /><br />\nPLEASE VOTE!<br />\n4<br /><br />\nNEWS -LETTER<br /><br />\nPAGE SIX<br /><br />\nB. I. A. NOTES<br />\nThe Board of Intramural<br />\nAthletic's compci I.:ion resumed<br />\nafter vacation with basketball<br />\ngames on Monday evening.<br />\nFraternity \"A\" games: Phi<br />\nSig 53-Phi Psi 31, AD 50-KA 35,<br />\nPhi Gam 100-Phi Ep 19. Fraternity \"B\" games: DU 25-TEP<br />\n20, ZBT 33-Sig Ep 19, Beta 36ATO 28.<br />\nFreshman dorm games: Adams<br />\n31-Clark 30, Guildersleeve 36Baker 27, Lazear 52-Griffin 40,<br />\nJennings 41-Hollander 30. Uppet-class dorm games: Royce 43Willard 40, Wood 41- Sylvester<br />\n28.<br />\n..B-Ball Info<br />\nIf any questions or problems<br />\narise as to rulings in the basketball competition, the members<br />\nof the BIA are to be consulted;<br />\nFrosh—Gene Detroyer (418). Uppercla.ss—Dave Rodkey, Prat 'A'<br />\n—Charlie Kernan (510), Prat 'B'<br />\n—Bob Carter (528k, Ind.—Joe<br />\nOlk (513).<br />\nThree of the minor sports in<br />\nthe BIA program will be held in<br />\nFebruary. Some of the entries<br />\nmust be made by next week.<br /><br />\nfraternities only and entries must<br />\nbe made by January 18 to Box<br />\n123. Players must, supply their<br />\nown equipment.<br />\nEntries for competition in<br />\nhandball must also be made bY<br />\nJanuary 18 to Box 844.<br />\nBowling for all leagues will be<br />\nheld on February 11 and entries<br />\nmust be made to Box 500 by February 8. Each team must have<br />\nfive men.<br /><br />\nJays Face Test<br /><br />\nVarsily Swimmers irop Two,<br />\nFace MAC Champs Tomorrow<br />\n(Continued from Page 8)<br />\n173.65 points to break Pete Reynolds old record. Rick Wilson<br />\nadded a second place finish in<br />\nthe diving for a Hopkin's sweep.<br />\nLooking over the past two meets,<br />\nCoach' Klarner feels that the<br />\nBluejays have done very well but<br />\ncan even do better. He thinks<br />\nthat the team has shown great<br />\nimprovement as evidenced by<br />\ncomparable scores. Last year<br />\nHopkins last to the Garnets 7024 and to PMC 61-33.<br /><br />\nWork 3 evenings 3-10 or<br />\n2 evenings &amp; Saturday 9-5.<br /><br />\n$60<br />\nCALL 837-8152<br /><br />\nCAREERS<br />\nIN STEEL<br /><br />\nOur representative<br />\nwill be on campus<br /><br />\nFEB. 13, 14<br />\nto interview undergraduate<br />\nand graduate candidates for<br />\nBethlehem's '67 Loop Course<br />\n—our highly regarded<br />\nmanagement training<br />\nprogram<br />\nOPPORTUNITIES are<br />\navailable in steel plant operations, sales, research, mining, accounting, and other<br />\nactivities.<br />\nDEGREES required are<br />\nmechanical, metallurgical,<br />\nelectrical, chemical, industrial, civil, mining, and<br />\nother engineering specialties; also chemistry, physics, mathematics, business<br />\nadministration, accounting<br />\nand liberal arts.<br />\nIf you would like to discuss<br />\nyour career interest with a<br />\nBethlehem representative,<br />\nsee your placement officer<br />\nto arrange for an interview<br /><br />\nJIMMY WU'S<br /><br />\nGET A<br />\nHEAD START..<br />\n... As you leave school and begin your working<br />\ncareer, you will be hearing about the changes that<br />\nhave been taking place at Allis-Chalmers. New<br />\nproducts! New markets! New growth!<br />\nBut why not GET THE WORD NOW from our representative who will be on campus. Perhaps you can<br />\nget a head start—be part of tile action.<br />\nToday, Allis-Chalmers has professional career<br />\nopportunities for all engineering graduates with<br />\nemphasis on Electrical, Industrial, and Mechanical<br />\nbackgrounds. Also available are unexcelled opportunities for the Business Administration graduate.<br />\nCONTACT YOUR PLACEMENT OFFICE FOR A<br />\nCAMPUS INTERVIEW ON:<br /><br />\nJanuary 20, 1967 (Friday)<br /><br />\nAgrim ALL1S-CHALMERS<br /><br />\nBETHLEHEM<br />\nSTEEL<br /><br />\n11<br />\nP0\"<br />\n—A<br /><br />\nThe best race of the day will<br />\nbe in the 200 yd. butterfly where<br />\nHowie Chernick Ls matched<br />\nagainst Dickinson's Paul Stasz.<br />\nChernick, the teath's high scorer<br />\nso far, will have his hardest test<br />\nof the season tomorrow<br /><br />\nwith<br />\n011.earnPlig Max ghuIman<br />\n(By the author of\"Rally Round the Flag,Boys!\",<br />\n\"Dobie Gillis,\" etc.)<br /><br />\nwinesmomoolliniellk<br /><br />\nIT'S A NORTH WIND THAT BLOWS NO GOOD<br />\nCrushed between the twin millstones of January<br />\nweather and final exams, you are saved from total despair, poor devils, only by the knowledge that winter vacation will soon be here.<br />\nWhere will you go this year? Will it be Florida again,<br />\nor are you tired of jails? Then how about Puerto Rico?<br />\nA most excellent notion, say I. A balmy and bounteous<br />\nisland with long white beaches and blue, blue skies and<br />\ngreen, healing seas. And, most pleasant of all, the warm<br />\nand gracious people of Puerto Rico! You don't even have<br />\nto know Spanish to communicate with this friendly folk.<br />\nJust learn three simple phrases and you'll get along<br />\nsplendidly:\"Buenos dias\" which means\"Good morning,\"<br />\n\"Gravies\" which means \"Thank you,\" and \"Que sera<br />\nseed\" which means t'Your llama is on my foot.\"<br />\nIn order to help you enjoy the fabled land of Puerto<br />\nRico it would be well for me to supply a bit of historical<br />\nbackground. (It would also be well for me to say a few<br />\nwords about Personna Super Stainless Steel Blades because the makers of Personna Super Stainless Steel<br />\nBlades pay me to write this column ahd they are inclined<br />\nto sulk if I omit to mention their product. Of course,they<br />\ndon't p!itay gloomy long, for they are kindly, cheery men<br />\nfond of Morris dancing, spelling bees, and temperance<br />\npunch—fine, upright types, as true and gleaming and<br />\ndurable as the blades they make. And if you've tried<br />\nPersonna's,you know how true and gleaming and durable<br />\nthat is! And if you haven't tried Personna's, poor devil,<br />\nyou've cheated both your purse and face, for Personna's<br />\nlast and last, shave after luxury shave, close, clean, nickless, hackless, tugless, gougeless, scratchless, matchless.<br />\nPersonna Super Stainless Steel Blades come in Double<br />\nEdge or Injector style and are made only by the makers<br />\nof Personna Super Stainless Steel Blades.)<br />\nBut I digress. Back to the history of Puerto Rico. The<br />\nIsland was discovered by that popular discoverer Christopher Columbus. Incidentally, considering Columbus'<br />\npopularity, it's odd we know so little about him. What do<br />\nwe really know? Only this:<br />\nHe was born in Genoa on August 25 1451, the son of<br />\nRalph T. Columbus, a knee-cymbal vendor, and Eleanor<br />\n(Swifty) Columbus, a low hurdler. He was an only child<br />\nexcept for his five brothers and eight sisters. From early<br />\nchildhood he was an avid reader and spent all his waking<br />\nhours immersed in a book. Unfortunately,there was only<br />\none book in Genoa at the time—Care of the Horse by<br />\nAristotle—and after 18 years of reading Care of the<br />\nHorse, Columbus grew restless. When rumor reached<br />\nhim there was another book in Madrid, off he ran as fast<br />\nas his little fat legs would carry him.<br />\nDisappointment,alas,awaited him there.The only book<br />\nIn Madrid was Guider un Cabello,which proved to be nothing more than a Spanish translation of Care of the Horse.<br />\nThen one day Columbus heard from a traveller that<br />\nthere were millions of books in India, and he was instantly ablaze to set sail. Off he ran on his little fat legs<br />\nto the court of Ferdinand and Isabella (Columbus,though<br />\nmore than six feet tall, was plagued with little fat legs<br />\nall his life) and, as we all know, he persuaded the Spanish rulers to outfit him with three stout ships,the Popsy,<br />\nthe Mopsy, and the Cottontail, and the rest is history!<br /><br />\nAN EQUAL OPPORTUNITY EMPLOYER<br /><br />\nNEWMAN HOUSE<br />\nThe Catholic Center for Johns Hopkins<br />\nBE 5-9271<br />\n2941 N. Charles<br />\nRev. Phillip V. Cunningham, CSP, Chaplain<br /><br />\n•<br />\nREGULAR MASS SCHEDULE:<br />\nSundays-10:30 A.M. (in Levering Hall)<br />\nWkdays (expt. Sat.)-4:3O P.M. (at Newman House)<br />\n(Confessions are heard before all Masses)<br /><br />\nappointment.<br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br /><br />\nand it is reported to be even<br />\nstronger this year. Coach Klarner<br />\ndoes not plan to do any experimenting or juggling of the lineup tomorrow, and he expects his<br />\nmen to do their bast and improve their times even more.<br /><br />\n(Continued from Page 8)<br /><br />\nDickinson Outlook<br />\nTomorrow the Jays meet DickWashthe<br />\nin<br />\n74<br />\nfor<br />\n25<br />\nburg and<br />\ninson here at 3 p.m. Dieldn.son<br />\nington game, and allowed 80 and was last year's MAC champion,<br />\n82 points to those two teams.<br />\nNobody can win at that rate.\"<br />\nA Favorite Rendez Wu<br />\nWith 22 and 16 points in Satfor Hopkins Men<br />\nurday's debacle, Jim Call! and<br />\nBrian Berke pushed their teamNEW<br />\nleading scoring averages to 17.0<br />\nand 15.4 respectively; no one<br />\nCHINA INN<br />\nelse is in doug-le figures. Will<br />\nCharles Street below 25th<br />\nLane and Joe Carlton are, as usJIMMY WU'S<br />\nual, pacing the group in reCARRY OUT SHOP<br />\nSquash<br />\nbounds, having grabbed 55 and<br />\n1411 E. Cold Spring Lane<br />\nSquash games will be held for<br />\n47 caroms for five contests.<br /><br />\nSTUDENT.PART TIME<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br /><br />\nTHIS SUNDAY—JANUARY 15th, 7:30 P.M.<br />\n\"Prayer and Song for Christian Unity\"<br />\nUniversity and N. Charles<br />\nEpiscopal Cathedral<br /><br />\n•<br />\nGraduate Seminar—Thurs., Jan. 19th, 8:00 P.M.<br /><br />\nWell sir, now you know all about the origins of Puerto<br />\nRico.So get packed and get going! You'll love it! Stroll the<br />\nbeaches,swim the coves, breathe the fragrance of hibiscus<br />\nand bougainvillea. And remember always that the friendly<br />\nPuerto Ricans are delighted to show you their customs,<br />\nteach you their language.Why,I'll wager you'll soon know<br />\nfar more Spanish than the three basic phrases.You'll know<br />\n\"Haste la vista\" which means\"See you later.\"\"Porfavor\"<br />\nwhich means \"Please,\" and \"El tren se pan; en las este(don\" which means \"Your llama has eaten my passport.\"<br />\nel9R6, Max Shulman<br />\n*<br />\nGracias from the makers of Personna for giving our<br />\nblades such a cordial reception, and, par favor, hoes<br />\nabout trying another of our luxury shaving products<br />\n•-• Burma Shave, regular or menthol?<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 13. 1967<br /><br />\nGrapplers Tangle• Dickinson<br />\nIn Season's Fourth Contest<br />\n(Continued from Page 8)<br />\nods Gotwals led his opponent by<br />\none point, but a one minute time<br />\nadvantage tied the contest.<br />\nStiff Competition<br />\nJude Smith met stiff competition from Bill Yates, a strong<br />\nHaverford wrestler at 152, and<br />\nhad trouble warding off a pin.<br />\n.The score stood 14-2 as Monte<br />\nIkemire, weighing 160, lost a<br />\nclose contest, 6-8. John Gale was<br />\npinned in the first period by 167<br />\npound Lawrence Taylor.<br />\nDennis Estis, who wresteld in<br />\nthe 177 division in the opening<br />\nmeet, may have been glad he<br />\nwas on the sidelines last Saturday. Tim Wex replaced him but<br />\nwas completely overpowered by<br />\nhis opponent. The match ended<br />\nin a fall in the third period. Bill<br />\nHunt captured the only Hopkins'<br />\nvictory on a decision in the<br />\nheavyweight class.<br />\n\"Loss of conditioning during<br />\nvacation was not the major cause<br />\nof defeat,\" opined Coach Kyle<br />\nSmith.\"The squad has picked up<br />\nafter the defeat,\" he continued,<br />\n\"and they should be ready for<br />\nDickinson tomorrow.\" John Peck<br />\nshould be back in the lineup<br />\nsoon, and co-captain Bill Swartz<br />\nhopes to return around February<br /><br />\nNEWS-LETTER<br /><br />\nPAGE SEVEN<br /><br />\nFreshman Mermen<br />\nDrop Season Opener<br /><br />\nwill host highly touted Delaware<br />\nBy JEFF LAUREN<br />\nin their second home meet. Delaware sported a 9-0-1 record last<br />\nAfter winning all three of its<br />\nyear and looks to be one of the scrimmage meets, the freshmen<br />\nmost powerful squads on the swimming team dropped its first<br />\nJays' schedule.<br />\nregular meet of the season to<br />\nThe freshmen matmen, with McDonough last Saturday.<br />\nonly nine men on the-rdster, met<br />\nIn losing 67-28, the Baby Jays<br />\nBaltimore Junior College last were a little disappointing. They<br />\nTuesday and was bested 33-10.<br />\ndid not look good after,returnBob Hyde and Charles Coker ing from the Christmas vacation,<br />\nwere the only winners, both pin- and they were a little shaky in<br />\nning their opponents. Coach Ron their first meet of the season.<br />\nBelinko stated, \"The lack of ex- Right from the beginning Hopperience was a big factor, and kins did not do well, and Coach<br />\nthe squad should definitely im- William Klarner then proceeded<br />\nprove in the future.\"<br />\nto experiment, not worrying<br />\nThe frosh lineup ialudes Bob about the final score.<br />\nSwanton, 123 lb.; Paul Ing, 130;<br />\nFisher Excels<br />\nBob Hyde, 137; Charles Coker,<br />\nSpecial mention must be given<br />\n145; Russ Prall; 152; Bill Margrabe, 167; Bob Williams, 177; to Bobby Fisher who broke two<br />\nand Torn O'Toole in the heavy- Hopkins pool records in an<br />\nweight division at 240. Bob Hyam amazing show of swimming abiland Bill LaCorte, top prospects ity. His 2:22.3 in the 200 yd. infor the season, have been lost dividual medley and 1:03.4 in<br />\nthe 100 yd. backstroke were recdue to injury.<br />\nThe frosh, hoping to avenge ord times. Fisher graduated from<br />\ntheir opening defeat, will travel McDonogh so he was trying to<br />\nwith the varsity tomorrow to impress his old coach and team.<br />\ntake on the Dickinson junior<br />\nThree other freshmen also<br />\nvarsity.<br />\ndeserve special notice according<br /><br />\n1.<br /><br />\nJOHN P. NUGENT, JR.<br />\nLife &amp; Health<br />\nInsurance<br /><br />\nto the coach. Steve Giles only<br />\ntook a secOnd in the 200 yard<br />\n243-7961<br />\nfreestyle, but his time of 2:06<br />\nwas one of the fastest at Hopkins. In the sprints, Jeff Bonnet did an outstanding job as<br />\nhis 24 sec. flat performance in<br />\nWe need your head in our<br />\nthe 50 yard freestyle. It was good<br />\nbusiness<br />\nfor a new freshmen team record.<br />\nSteve Yeagle took a first in<br />\nthe 100 yard butterfly in a hotly contested race. He went several seconds faster than he had<br />\n3120 St. Paul St.<br />\never done in practice, and he<br />\nAcross from Eddie.,<br />\nhas shown great improvement<br />\nall season long.<br />\nRx Rx Rx Rx Rx Rx Rx Rx<br />\nNext Meet<br />\nThe freshmen have a chance<br />\nto gain their first victory of the<br />\nCONTACT LENS<br />\nseason tomorrow against Loyola<br />\nHigh. The meet, which is at<br />\nCARRYING CASE<br />\n3:00 p.m. will run along with<br />\nthe varsity's encounter against<br />\nDickinson. Coach Klarner feels<br />\nthat the freshmen have looked<br />\nand up<br />\nmuch better in practice since &gt;4<br />\nthe McDonogh meet, and are<br />\ncoming close to their old form.<br />\nHe expects the Loyola meet to be<br />\n&gt;4 Charles and 34th St. Al<br />\nclaw, and feels the Jays can •<br />\nreally do a job.<br />\nRx Rx Rx Rx Rx Rx Rx Rx Rs<br /><br />\nSt. Paul Barber Shop<br /><br />\n98c<br /><br />\n•<br />\n„ Greenway Pharmacy<br /><br />\nENGINEERS AND SCIENTISTS:<br /><br />\nNext Wednesday the grapplers<br /><br />\nLOOK HERE<br /><br />\nBusses To Goucher<br />\nThe Student Council has announced a bus schedule that will<br />\nrun between Goucher and Hopkins on Friday and Saturday<br />\nnights. Busses leave for Goucher<br />\nfrom Hopkins at 7:30, 10:30 and<br />\n12:45. Busses from Goucher to<br />\nHopkins leave at 6:45 (Fridays<br />\nonly), 8:30, 12:00 and 1:40.<br /><br />\nWHERE THE ACTION IS!<br /><br />\n.<br /><br />\nYou and your ideas are needed to help fulfill our many<br />\nand varied programs.<br /><br />\nF-111A and B • FB-111<br />\nRF-111 • F-111K<br />\nMARK II AVIONICS<br />\nADVANCED PROGRAMS<br />\n• SPACE SYSTEMS<br />\n• MISSILE SYSTEMS<br />\n• BORON FILAMENT<br />\n• OTHER R AND D<br /><br />\nFRED DONNELLY<br />\n(B.S.C.E.)ofthe Bethlehem<br />\nSteel Loop Course knows<br />\nwhere the action is.<br />\nHe's a field engineer for<br />\nour Fabricated Steel<br />\nConstruction Division, one<br />\nof the nation's greatest<br />\nbuilding organizations.<br />\nJoin the action.<br />\nFirst step: pick up<br />\na copy of \"Careers<br />\nwith Bethlehem Steel<br />\nand the Loop Course\"<br />\nat your placement<br />\noffice. Then sign up<br />\nfor a campus interview.<br />\nOur 1967 Loop Class<br />\nhas openings for technical<br />\nand non-technical graduates<br />\n(and post-grads) for<br />\ncareers in steel operations,<br />\nresearch, sales, mining,<br />\naccounting, and other<br />\nactivities.<br /><br />\nON-CAMPUS INTERVIEWS<br /><br />\nJANUARY 16<br />\n^<br /><br />\nSEE YOUR<br />\nPLACEMENT DIRECTOR<br /><br />\nAn Equal Opportunity<br />\nEmployer in the Plans for<br />\nProgress Program<br /><br />\nBETHLEHEM<br />\nSTEEL<br /><br />\nGENERAL DYNAMICS<br />\nFort Worth Division -<br /><br />\nNEWS<br /><br />\nLETTER<br />\nNEWS -LETTER<br /><br />\nPAGE EIGHT<br /><br />\nQuint Faces Penn<br />\nMilitaryInCrucial<br />\nTest to Title Hopes<br /><br />\n'4:e7<br /><br />\nTcr e<br />\nTwice<br />\nBy JEFF LAUREN<br />\nThe varsity swimming team<br />\ndropped its first two meets of<br />\nthe season by close margins. Tomorrow afternoon the tankmen<br />\ntake on Dickinson, who should<br />\nprove to be tough.<br />\nIn the -Bluejay's first meet of<br />\nthe season against Swarthmore<br />\nbefore the Christmas vacation,<br />\nthe varsity swimmers came the<br />\nclosest to a victory that any<br />\nHopkins swimming team ever<br />\nhas, as the Garnets edged out<br />\nHopkins 49-46. The meet was not<br />\ndecided until the second to last<br />\nevent.<br />\nHenry High Scorer<br />\nHopkins opened and closed the<br />\nSwarthmore meet well, winning<br />\nboth the opening medly relay<br />\nand the finishing freestyle relay.<br />\nBut they were only able to win<br />\nthree individual events as Al<br />\nHenry won the 50 yd. freestyle<br />\nand soph Howie Chernick the<br />\n200 yd. butterfly. Henry was the<br />\nteam's high scorer with 9%<br />\npoints, but the team showed good<br />\nbalance as they fought hard for<br />\nMany second and third places.<br />\nWhen the Bluejays returned<br />\nfrom their vacation, they had to<br />\nquickly prepare for Pennsylvania<br />\nMilitary College, who defeated<br />\nthe Jays 51-40 last Saturday.<br />\nPMC, greatly improved from last<br />\nyear, started off by beating<br />\nHopkins by less than a second in<br />\nthe medley relay. But Coach<br />\nWilliam Klarner was still happy<br />\nsince the Jays clipped seven seconds off their time from the<br />\nsame relay in the Swarthmore<br />\nmeet.<br />\nBurnham Outstanding<br />\nSophomore Noel Burnham was<br />\ncited by the coach as the swimmer having the best day against<br />\nPMC. Burnham anchored the<br />\nmedley relay that set the new<br />\nschool record of 4:17 and he<br />\nswam one of the fastest 100 yd.<br />\nfreestyle races in Hopkins history<br />\nas he did a speedy 53 flat.<br />\nOther highlights of the meet<br />\nwere Chernick's victory in the<br />\nbutterfly and Gene Linfors diving. Iinfors set a new school and<br />\npool record when he scored<br />\n(Continued on Page 6)<br /><br />\nBy MIKE PHILLIPS<br />\nKnocked from its undefeated<br />\nperch, the varsity basketball<br />\nteam concludes a week crucial<br />\nto its Southern Division Middle<br />\nAtlantic Conference title hopes<br />\nwhen it journeys to Pennsylvania Military College tomorrow afternoon.<br />\nSaturday's opponent, about<br />\nwhom there is little current information at this writing, was<br />\n3-3 in M.A.C. play as of Tuesday and returns six lettermen<br />\nfrom an 8-11 (5-8 in the league)<br />\ngroup that, after being demolished 76-51 by the Jays a year<br />\nago, stormed back to win six of<br />\nits final eight games.<br /><br />\nCALL! DRIVES — Junior guard Jim Calli, leading Bluejay scorer,<br />\ndrives hard on his way for a layup.<br /><br />\nGrapplers Take On<br />\nTough Devil Squad<br />\nFLASH<br />\nThe varsity wrestling team<br />\nMaryland<br />\nWestern<br />\ndefeated<br />\nWednesday 20-16. Rich Dryden,<br />\nSteve Koyama, Harry Gotwals,<br />\nTom Copeland, John Crabbes,<br />\nand Bill Hunt led the grapplers<br />\nto their first victory of the<br />\nseason.<br />\nBy JIM SLOAN<br />\nThe varsity grapplers travel to<br />\nDickinson tomorrow hoping to<br />\navenge last year's 11-18 defeat<br />\nand improve this season's opening slump.<br />\nThe Devils post a rather inexperienced lineup with no seniors,<br />\nbut still promise to provide<br />\nstrong competition.<br />\nHaverford Wins<br />\nAfter dropping their opening<br />\nmeet, the grapplers returned<br />\nfrom the Christmas vacation to<br />\nface a powerful Haverford squad<br /><br />\nlast Saturday. The Fords collected two falls and five decisions<br />\nto win the meet, 27-5. Senior<br />\nheavyweight, Bill Hunt, and<br />\nsophomore Harry Gotwals proved<br />\nto be only bright spots in an<br />\notherwise dim afternoon for the<br />\nJays.<br />\nLightweight Dick Dryden almost collected his second fall in<br />\nas many meets, but time ran out<br />\nand he lost by decision. Curt<br />\nConner was next at 130 lb., and<br />\nhe dropped a close match by decision, 1-4.<br />\nJoe Griggs was overpowered<br />\nby opponent in the 137 division,<br />\nand the Fords jumped to an<br />\nearly 0-9 lead. Harry Gotwals, a<br />\nsophomore at 145, was next on<br />\nthe mat. His event was the most<br />\nexciting and perhaps the best of<br />\nthe afternoon. After three pen (Continued on Page 7)<br /><br />\nOle's Fencers Battle Lehigh<br />\nThe varsity fencing team meets<br />\nLehigh away tomorrow afternoon<br />\nand it hopes for as easy a win<br />\nas last years 20-7 victory.<br />\nFacing Stevens Institute last<br />\nSaturday, the Jays suffered an<br />\n18-9 defeat. The team had to<br />\nforfeit six bouts because only<br />\nseven men are competing instead of the minimum of nine.<br />\nThe Jays are led by co-captains Jerry Lam (foil) and Mike<br />\nGross (sabre). Lam, a senior, was<br />\nlast years champion in the foil<br />\ncompetiton in both the Middle<br />\nAtlantic and North Atlantic<br />\nconferences.<br />\nReturnees<br />\nOther members of the team<br />\ninclude: in foil, John Austin (jr.)<br />\nand Bill Cowan (soph); in epee,<br />\nJoe Mulinare (senior) and Bob<br />\nLeedom (senior); in sabre, Bernie Tawfik.<br />\nIn intercollegiate fencing three<br />\nmen compete in each weapon<br />\ngroup (foil, epee, sabre) and<br />\neach man fences three times.<br />\nThus, a minimum team should<br />\nconsist of nine men. There are<br />\ntwenty-seven bouts and each win<br /><br />\nHOMEWOOD, BALTIMORE, JANUARY 13, 1967<br /><br />\nAlthough these seven men will<br />\nhave to do the job of nine,<br />\nCoach Dick Oles feels the team<br />\nhas a chance this year.<br />\n* * *<br /><br />\nDICK OLES<br />\nis awarded one point. Hopkins<br />\nthen must forfeit six points at<br />\nthe start of every meet.<br />\nTough Season<br />\nBecause Hopkins is down before a meet starts last years 6-3<br />\nrecord may be a tough goal for<br />\nthis season. Last year the Jays<br />\nfinished overall second in the<br />\nMiddle Atlantic Conference and<br />\ntied for third in the North Atlantic conference. The fencers<br />\nalso tied for first for the foil<br />\ntrophy.<br /><br />\nThe freshman squad has fourteen men out and several have<br />\nhigh school experience. Although<br />\nthe team dropped its first meet<br />\nto Stevens also 18-9, it showed<br />\npotential for the future, according to Oles.<br />\nExperienced stickers are Aven<br />\nWhittington in sabre and Al<br />\nFung and Ron Remick in foil.<br />\nIn the meet Fung went 3-0<br />\nwhile Whittington went 2-1.<br />\nVarsity Schedule<br />\nSat., Jan. 21.<br />\nLafayette<br />\naway<br />\nWed., Feb. 8<br />\nUniv. of Penn.<br />\n4:00 p.m.<br />\nSat., Feb. 11<br />\nMuhlenberg<br />\n3:00 p.m.<br />\nSat., Feb. 18<br />\nHaverford<br />\naway<br />\nSat., Feb. 25<br />\nTemple<br />\naway<br />\nSat., Mar. 4<br />\nMason-Dixon Championships<br />\nat Lehigh<br /><br />\nFrom<br />\npre-season reports,<br />\nP.M.C.'s most probable starters<br />\nare lettermen Ron Arbogast (61 guard, 13.0 average in '65-'66),<br />\nKen Elliott (6-4 center, 11.5),<br />\nand George Shicora (6-3 forward, 12.7), with 6-3 forward<br />\nCharlie Haydt (about 20 points<br />\nper game this season) and 5-10<br />\nguard Bill Selwood rounding out<br />\nthe crew. The chief reserves are<br />\nlettermen Mike Borden, Dick<br />\nCartwright, and Mike LaFlarnme,<br />\nwith soph Bill McCauley (up<br />\nfrom a 12-5 frosh team) pressing Selwocd.<br />\nBig Time Action<br />\nOn Tuesday Hopkins takes a<br />\njump into the big time by traveling to Washington, D.C. to face<br />\nMason-Dixon pacesetter Catholic University. The Cardinals, 51 in that league and 7-5 overall<br />\nas of Wednesday, have defeated<br />\nEvansville<br />\n(the<br />\nthird-ranked<br />\nU.S. small college team going<br />\ninto that game), St. Joseph's of<br />\nPhiladelphia (fifth in the nation a year ago), and perennial<br />\nsmall college power Mount St.<br />\nMary's (twice).<br />\nCatholic U. is paced pointwise<br />\nby 6-0 soph guard Bill Wilson,<br />\nwho, at the end of eight games,<br />\npossessed an 18.7 scoring mark,<br />\nwith Bob Ciofarri (12.7) and<br />\nRon Krasinski (10.5) also in<br />\ndouble figures. The Cards defeated Washington College, their<br />\nlone common opponent with the<br />\nJays, 97-78.<br />\nWin Streak Over<br />\nThe Homewood squad's early<br />\nseason win streak, as expected,<br />\nended before Christmas with a<br />\nreasonably<br />\nwell-played<br />\n80-70<br />\nloss to Gettysburg, but last Saturday's 82-71 upset defeat at the<br />\nhands of a mediocre Washington<br />\nquintet was most unanticipated<br />\nand extremely injurious, since<br />\nthe Sho'men compete in the<br />\nM.A.C.<br />\nAs of Tuesday, second in the<br />\nloop's Southern Division with a<br />\n3-1 mark (Ursinus is 4-1), the<br />\nJays, having faced Western<br />\nMaryland last night and with<br />\nP.M.C. on tap tomorrow, are in<br />\nthe midst of what might prove<br />\nto be a decisive week as regards<br />\ntheir title hopes,<br />\nDown by as much as sixteen<br />\n(35-19) in the first half of the<br />\nWashington<br />\ngame,<br />\nHopkins<br />\nstaged a steady rally, taking the<br />\nlead 65-64 on Bob Spence's basket with 6:01 left, and with<br />\nSho'man starters Frank Marion<br />\n(17 points), Gary Meyers (18),<br />\nand Tom Polvinale out via the<br />\nfoul route, the Jays appeared<br />\nto be in position to move away.<br />\nCollapse<br />\nSuch hardly proved to be the<br />\ncase, as Washington immediate-<br /><br />\nly cashed in on a three point<br />\nplay, and steadily outdistanced<br />\na demoralized Hopkins contingent from there. A prime factor<br />\nin the collapse was the Jays' impotence at the free throw line<br />\n(eight for nineteen) in the second half—at least twice in the<br />\nclosing minutes they failed to<br />\nconvert. the first shot of a oneand one situation.<br />\n\"Defense and shooting have<br />\nbeen our problems the last two<br />\ngames,\" commented Coach Henry Ciccarone. \"We were 26 for<br />\n73 from the field against Gettys(Continued on Page 6)<br /><br />\nFrosh Hoopsters<br />\nInvade PMC<br />\nBy JIM SLOAN<br />\nThe freshmen basketball team,<br />\nnow averaging 85 points per<br />\ngame to its opponent's 41, will<br />\ntry to add another victory to its<br />\ncredit when it invades Pennsylvania Military College tomorrow.<br />\nThe frosh stretched their winning streak to four games as<br />\nthey trounced Washington College junior varsity last Saturday, 93-41.<br />\nHeight Helps<br />\nWith seven men over 6'3\", the<br />\nBaby Jays are finding few problems under the boards. Their<br />\nheight advantage enabled them<br />\nto completely dominate both the<br />\noffensive and defensive boards<br />\nagainst Washington.<br />\nIn addition a balanced attack has boosted their scoring<br />\npotential. Against Washington,<br />\nfour men were in double figures. These wer 6'5\" Jim Novick<br />\nwith 22 points, Curt Slenken<br />\n(6'5\") with 17, John Judy (6'4\")<br />\nat 13, and Jim Thomas (6'5\")<br />\nwith 12.<br />\nThomas is a starting forward.<br />\nSlenker works at center, and<br />\nJudy and Novick are guards.<br />\nOther standouts are Andy Fisher,<br />\nRichard Thielke, and Bill Piotrowski.<br />\nBarrette Beams<br />\nCoach Gary Barrette was<br />\npleased with his squad's performance and considers the team<br />\nready for much stouter competition than that which Washington provided.<br />\nPMC looks to be strong, and<br />\nit should be a hard fought contest tomorrow. Next Tuesday,<br />\nMt. St. Joseph's will host the<br />\nfrosh. The next home game is<br />\nslated for February 4 against<br />\nFranklin and Marshall. The remaining contests of the fifteen<br />\ngame season are:<br />\nJan. 14<br />\nPMC College<br />\nAway<br />\nJan. 17<br />\nMt. St. Joseph's<br />\nAway<br />\nFeb. 4<br />\nFranklin &amp; Marshall 6:45 p.m.<br />\nFeb. 8<br />\nTowson State J.V.<br />\nAway<br />\nFeb. 11<br />\nDrexel<br />\n6:45 p.m.<br />\nFeb. 15<br />\nUrsinus J.V.<br />\nAway<br />\nFeb. 16<br />\nLoyola J.V.<br />\nAway<br />\nFeb. 18<br />\nDickinson J.V.<br />\nAway<br />\nFeb. 22<br />\nLoyola J.V.<br />\n6:45 pin.<br />\nFeb. 25<br />\nWestern Marylitnd J.V. Away<br /><br />\n'Niiook;<br /><br />\n1<br />\nj<br /><br />"}], "field_media_file": [{"target_id": 40206, "display": null, "description": null, "target_type": "file", "target_uuid": "f3146975-536b-4248-b079-3c686d40a3da", "url": "http://digital.library.jhu.edu/system/files/2022-03/13917-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13917, "target_type": "node", "target_uuid": "8fdbb966-c2ba-4928-84b5-b41cfc07efbc", "url": "/node/13917"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "eac1fa5d-dcd8-45ec-804c-4a9a62e6593b"}]}