{"mid": [{"value": 38137}], "uuid": [{"value": "7da7c115-b9d7-46f5-a43e-22de4f0338e9"}], "vid": [{"value": 38137}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:48:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12704-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:48:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:48:53+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\n:11aInto ifinpkitts ,Nrtuff-Erttrr<br />\n<br />\nVOLUME XLI, NO. 2<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 6, 1936<br />\n<br />\nButtner Named MusicMeetClubAtCandidates<br />\nRecord Turnout<br />\nNew Batallion<br />\nR.O.T.C. Major<br />\n<br />\nEditorial<br />\n<br />\nOver one hundred prospective mem-<br />\n<br />\nShortly the people of the United States are to cast their votes in a<br />\nThursday's presidential election. Upon their choice depends the welfare of a great nation,<br />\nmeeting of the Johns Hopkins Musical and the future, perhaps, of the. ideal of democracy. Students<br />\nof America are<br />\n<br />\nbers<br />\n<br />\nappeared<br />\n<br />\nat last<br />\n<br />\nLAST TRYOUTS FOR<br />\nMUSICAL CLUB<br />\nTONIGHT<br />\nPRICE 5 CENTS<br />\n<br />\n\"Phenomena of Color',<br />\nSenior Essay Topic<br />\n----The topic of the essay required<br />\nof all Seniors in the Natural Science<br />\nGroup for 1936-37 is \"The Phenomenon of Color,\" according to an announcement made through the<br />\nDean's Office.<br />\nThe essay is to include \"The<br />\nphenomenon of color: what causes<br />\nit, how it is perceived, how it is<br />\ndistributed in the universe, how it<br />\nis made use of in scientific work,<br />\nwhat effect it has on living organisms, and what its practical value<br />\nis in the arts and sciences.\"<br />\nThe papers, which are to be between 3000 and 5000 words should<br />\nbe handed to Dr. R. P. Cowles,<br />\nChairman of the Natural Science<br />\nGroup, on or before March 1, 1937.<br />\n<br />\nLarge Social<br />\nSport Program<br />\nFor Dorm Men<br />\n<br />\nClub. Candidates eager for coveted not exempt from the necessity of expressing their choice.<br />\nThe NEWS-LETTER,<br />\npositions on the Hawaiian Troupe, because it attempts to reach the ear of an enlightened group<br />\nin an enlightened<br />\nMajor Barrett To Fill the Banjo Club, the Glee Club, or the University and because it tries to guide, if not to lead, its thought, not only<br />\nMusicales, Dances, TournaBlue Jay Band, the dance orchestra<br />\nVacancy Caused By<br />\nrealizes the necessity but also considers it a duty to make public its policies<br />\nof the group, as well as those interestments To Features Plans<br />\nCoffin's Removal<br />\ned in the organization solely from the and opinions.<br />\nAnnounced By Pinck<br />\nThe NEWS-LETTER not only finds it impossible to support Governor<br />\nadministrative viewpoint, were welcomed by President John Steeper and Landon for the presidency of the United States but warns as well that his<br />\nOscar Steinwald, director of the Glee election would deliver a paralytic stroke to<br />\nAmerican democracy and liberty.<br />\nAll Officers Except Corporals Club. At the meeting the officers told<br />\nThe NEWS-LETTER objects in part to the man himself, but primarily to the<br />\nall the candidates present what comAnnounced<br />\nLate<br />\nProfs To Deliver Series Of<br />\nprise the principles, ideals, purposes, tendencies and groups which he represents. It is not the personality of the<br />\nman which the NEWS-LETTER finds wanting, but his record of intellectual<br />\nYesterday<br />\nand standards of the Music Club.<br />\nInformal Talks To<br />\nIn spite of the large turnout there honesty, his record of consistency, his record as an administrator. For it is,<br />\nThe appointment of W. D. Buttner,<br />\nResidents<br />\nis still room for anyone of musical after all, only by his record that one can know what is to be expected from<br />\nas Major, Battalion Commander of talent or<br />\nadministrative ability to him in the future. So far there has been no sign of intelligence, no sign of<br />\nTouch football, ping pong, and chess<br />\nthe Johns Hopkins Reserve Officers join any of the units of the club.<br />\nany intelligent grasp of national affairs, from Governor Landon. But far<br />\ntournaments; musicales, dances, and<br />\nThis evening at 7:30 P. M., final try- more serious than this is Mr. Landon's allegiance to the forces of reaction and<br />\nTraining Corps, for the coming year<br />\ninformal addresses are but a few of<br />\nwas officially announced late yester- outs for all positions yet open will fascism in America.<br />\nthe events planned by The Dormitory<br />\nbe held for all interested students.<br />\nday by the Department of Military<br />\nActivities Committee, a one year old<br />\nThese are times in which we must not base our opinions upon the details<br />\norganization which has been reorganScience and Tactics.<br />\nof a man's work or thoughts. This is an era in which social movements are<br />\nized for the purpose of giving to the<br />\nJ. M. Bradford was promoted to<br />\ndominating our national life and they cannot be denied. The selection of a<br />\nresident men \"by far the most extenCaptain, Battalion Adjutant. Other<br />\nnational administrator must be compatible with one's beliefs in those tendensive social program that the dormitory<br />\nnewly appointed officers are as<br />\ncies which are clashing in the world today.<br />\nhas had in many a year,\" in the words<br />\nfollows:<br />\nThe economic life of a nation is constantly in a state of flux, of restless<br />\nof Bernard Pinck, chairman of the<br />\nCOMPANY A<br />\nmovement. Nothing is static; nothing is certain but change. Today, America, Professors Christie, Retalliata group.<br />\nJ. H. Skeen, Captain; H. M. Diver,<br />\naccording to the nature of things, is moving forward. Every man is faced with<br />\nThe committee is composed of<br />\nKouwenhoven Figure In<br />\nW. 0. Nelson, and J. W. Sause, First<br />\nthe problem of choosing the direction in which he wishes to go. It is unfortunrepresentatives of the Freshman,<br />\nLieutenants; G. G. Duce, M. McCord, Refurnished Cafeteria Will ate but true that the Republican party is being led today by a group which is<br />\nSummer Conferences<br />\nSophomore, Junior, Senior, and<br />\nS. R. Orem, andC. E. Sholtes, Second<br />\ndirecting<br />\nthe<br />\ncourse<br />\nof<br />\neconomic<br />\nand<br />\npolitical<br />\nprogress<br />\ntoward<br />\nfascism.<br />\nHave<br />\nMore<br />\ngraduate dormitory men. The proctors<br />\nPleasant<br />\nforfaculty<br />\nand<br />\nHopkins men, both<br />\nLieutenants; W. J. Dickey and C. T.<br />\nMr. Landon and his supporters are in the van of American reaction, and they<br />\nare members with Dr. Donald Hatch<br />\nAtmosphere<br />\nThan<br />\nEver<br />\nEnginL.<br />\nSergeants;<br />\nB.<br />\nMewshaw, First<br />\npoint the way directly to fascism. There is no claim that they desire a return mer students in the Schols of<br />\nAndrews, Senior proctor, chairman,<br />\nStinchcomb, Color Sergeant.<br />\nto the days of Harding-Coolidge-Hoover. They could not turn time back if they eering, have been doing prominent ex-officio. Each of the committee<br />\nThe<br />\nHall<br />\nLevering<br />\nwill<br />\ncafeteria<br />\nin<br />\nCOMPANY B<br />\nwished. They are leading the way to the ultramonopolistic totalitanian state work this past summer. Either rep- members is personally responsible<br />\nW. 0. Peale, Captain; J. R. Gallo- again strive to offer superlative serv- of Germany and Italy.<br />\nresenting the University at the various for the<br />\norganization and direction of<br />\nway, H. J. Hofmann, and D. W. Thom- ice to the student body this year.<br />\nEngineering conferences and Society some<br />\nactivity, social event, or series<br />\nas, First Lieutenats; J. J. Gronicki, According to Mrs. Lucy P. Johnson,<br />\nMr. Landon raises the banner of false liberalism in the attempt to divert meetings or engaged in research, of cultural events. The committee<br />\nC. Reinoldi, E. L. Rowny, and J. the manager of the cafe, every effort votes to his<br />\ncause. It is not only error but actual danger to be taken in by several of the most able men in their members are Messrs. Dickson, KasTampico, Second Lieutenants; W. G. will be made to make it a pleasant, these false professions<br />\nof liberalism and personal liberty. The same weasel respective fields have brought credit par, Kelten, Graham, Baratz, and<br />\nKeir and H. R. Strobel, First Serge- economical place in which the students<br />\nto the University.<br />\nwords were heard in Germany and in Italy.<br />\nEd. Lotz. The committee was under<br />\nmay take their meals.<br />\nants.<br />\nAt the World Power Conference, the<br />\nThe NEWS-LETTER finds itself unalterably opposed to the economic and<br />\nsponsorship of the student coun\"I should like to take this opporCOMPANY C<br />\npolitical philosophy which Mr. Landon protects. The NEWS-LETTER has always held last September in Washington, cil last year.<br />\nR. E. Nopper, Captain; E. S. Bern- tunity to welcome back the uppermaintained a profound reverence for freedom and personal liberty. To many Professors A. G. Christie of the MechAccording to Dr. Andrews, \"the<br />\ngartt, 0. L. Collins, and N. P. Kemp, classmen, as well as to greet the new<br />\nthe<br />\nfreedom cherised by the American democracy is purely political. Eco- anical Engineering department and idea underlying the program of The<br />\nFirst Lieutenants; W. E. H. Maulsby, students,\" said Mrs. Johnson. \"I shall<br />\nnomic freedom and liberty are now essential as well. Political freedom is Cooper of the Political Economy group Dormitory Activities Committee is<br />\nS. A. Rittenhouse, A. I. Spear, and R. always welcome your suggestions for<br />\nmeaningless without the other. The NEWS-LETTER believes the two are insep- were representatives in the large the bringing about of a greater<br />\nH. Tubman, Second Lieutenants; M. the improvement of our service,\" she<br />\ngroup of eminent scientists and engin- friendliness<br />\narable<br />\nand that they are among the inalienable rights of man.<br />\nbetween the students in<br />\nJ. Hartke and H. R. Hranicka, First continued,\" and you may feel free at<br />\neers,<br />\nwho gather together every sixth the<br />\ncontradiction<br />\nterms<br />\nIt<br />\nto<br />\nis<br />\nbelieve<br />\na<br />\nin<br />\nthis<br />\nand<br />\nto<br />\nbelieve<br />\nin<br />\nthe<br />\nfalse<br />\ndormitory,<br />\nand, also, the serving<br />\nall times to come to my office and<br />\nSergeants.<br />\nliberalism professed by Mr. Landon. It is to this reaction that the NEW- year from all parts of the globe to as a group capable of assisting the<br />\nhave a chat with me.\"<br />\nCOMPANY D<br />\ndiscuss topics of vital and mutual<br />\nThe surroundings of the cafeteria LETTER objects first. And in the second place, it is convinced that, although interest and to further the cause of residents to utilize their recreative<br />\nH. H. Leber, Captain; C. P. Manger,<br />\nprofessions<br />\nmay<br />\nthe<br />\npossibly<br />\nhave<br />\nbeen<br />\nmade<br />\nin<br />\ngood faith, their execution<br />\ntime more fully, and according to<br />\nE. V. Pieper, and L. 0. Wallis, First will be even more pleasant this year;<br />\nwould be impossible when one considers the aggregate of reactionary economic pooling the civilized world's knowl- their desires.<br />\nLieutenants; G. C. Jones, J. P. Schles- the dining room having been painted<br />\nedge of power generation, utilization,<br />\nforces which support Mr. Landon.<br />\nFaculty Speakers<br />\ninger, and G. F. Stark, Second Lieu- in a cheerful color scheme, new curan dconservation. At this gathering,<br />\nIn an effort to give the opportunitenants; R. B. Stegmaier and W. E. tains having been procured, and new<br />\nthe paper read by Professor Christie,<br />\nty to lower-classmen to know better<br />\nThat is the transcendent issue of this campaign. We must not elect to the<br />\nchair-backs ordered. Something special<br />\nWindsor, First Sergeants.<br />\nentitled \"Development and Performthe leading men of the Johns Hopkins<br />\nand attractive has been planned for presidency a man who would abolish civil liberties—who represents a kept<br />\nBAND<br />\nance of American Power Plants,\"<br />\nUniversity,<br />\nthe committee will invite<br />\npress,<br />\ndiscussion.<br />\nHallowe'en<br />\nwho<br />\nwould<br />\nMr.<br />\nand<br />\nLandon<br />\nis<br />\nbeing<br />\nhas<br />\nfree<br />\nheld in the<br />\nsilence<br />\nbeen built-up as a was very well received and much disJ. W. Soule and G. J. R. Weigand,<br />\nsuch men to dinner, after which the<br />\npresidential candidate of unheard-of proportions by the Hearst press. He has<br />\nstrictest secrecy.<br />\nFirst Lieutenants.<br />\ncussed, gaining prominent place in<br />\nresidents will retire to the common's<br />\nMrs. Johnson also stated that a been brought to the top as a result of an undercurrent campaign of race<br />\nCorporals will not be appointed until<br />\nthe September issue of Mechanical<br />\nroom and the open fireplace to engage<br />\nprize contest will be held at some date hatred, and of religious intolerance, and of intense nationalism. Mr. Landon— Engineering.<br />\nafter six weeks of intensive drill.<br />\nin informal chats with the guests,<br />\nMajor Lawrence J. I. Barrett, who in the near future by the management he promises to protect labor from unions and union organizers—would abolish<br />\nAt the annual meeting of the Ameror to hear them speak under much<br />\nhas been appointd to fill th vacancy of the cafeteria. The object of this the right of labor to organize and to bargain collectively.<br />\nican Society of Mechanical Engineers,<br />\nMr. Landon represents and is supported by those interests and men which three papers by members of the staff more informal conditions than exist<br />\ncaused by Major Frank Coffin's trans- contest will be to construct as many<br />\nferral, will be in charge of the group words as possible from a key word compose the \"special interests,\" the \"economic royalists.\" These men are of the Engineering school were read, in a class or lecture room.<br />\nIn consideration of the large numthis year. Major Barrett graduated which will be announced. The winner aligned without exception behind Mr. Landon; and with them is Mr. Hearst— starting with Dr. J. T. Retalliata's<br />\nber<br />\nof musically inclined dormitory<br />\nfrom West Point in 1914 and served of the contest will receive free meals the symbol of all that is low, and narrow, and ignorant, and dangerous in treatise \"Undercooled Steam,\" which<br />\nIn the army during the war. He re- in the cafeteria for a given time. In American life. Mr. Landon is their Man Friday. It is difficult to believe that also was his dissertation for his degree men, musicales are being planned.<br />\nThey will take place at regular inceived an honorable discharge in 1919 addition, free meals will be awarded Mr. Landon, no matter how honest of heart, could withstand their pressure.<br />\nin graduate work. Others were A. H.<br />\nand went to the Infantry Officers to the student who brings in the most<br />\nMr. Landon's first allegiance is to his supporters; it must be so; without Senner, \"Domestic Oil Burners,\" and tervals throughout the year. The<br />\nTraining School at Fort Benning. customers.<br />\ntheir intervention it is beyond the realm of imagination that he should have Professor Christie, \"Early Allis-Chal- affairs were suggested by Dr. An(Continued on page 3, col. 1)<br />\nIn 1921 he was made a member of<br />\nAlso of interest to the student body been chosen to the Republican candidacy. The power behind the Landon mers Steam Engines,\" a historical<br />\nof the staff at Fort Benning and he is the fact that Miss Nona Johnson candidacy is a fascist newspaper propagandist, and an equally fascist survey.<br />\ncomes to Hopkins directly from that will be back at the cash register. This Liberty League.<br />\nIn the Electrical Engineering conshould make payment less painful.<br />\nschool.<br />\nvention at San Francisco, early in<br />\nAs far as cost is concerned, Mrs.<br />\nThe smoke screen of counter-Communism is raised by the Landon-Hearst- the summer, Dr. William B. KouwenJohnson stated that although food Liberty League Coughlin-Townsend-Smith alliance. It was<br />\npointed out by a hoven presented a paper, later pubprices have risen, the prices in the presidential candidate recently that every election since 1792 has had its red<br />\nlished in the Electrical Engineering.<br />\ncafeteria have not. Toasted sandwiches herrings. But people believe. Mr. Landon is represented as<br />\nPublications Include<br />\nthe man who will entitled \"Electric Shop.\" At the same First<br />\nice-cream<br />\nsandwiches will be save America from Communism—as Hitler saved Germany and as Mussoand<br />\nmeeting papers by A. Seletzky, '27,<br />\nSurvey Of Early State<br />\nDr. Havens To Finish featured.<br />\nlini saved Italy from Communism.<br />\nand Davidge Rowland, '22; \"Circuits\"<br />\nTobacco Problems<br />\nThe methods of European fascism are being reproduced here to the and \"Electric Porcelain,\" respectively,<br />\nIntensive Work Of<br />\nminutest detail.<br />\nFour books, containing a variety of<br />\nwere presented.<br />\nTen Years<br />\nhave been published this year<br />\ntopics,<br />\n(Continued<br />\nPage<br />\n2,<br />\nCol.<br />\non<br />\n1)<br />\nBusy<br />\nsummer<br />\nduring<br />\nat<br />\nthe<br />\nother<br />\nHopkins Men Attend<br />\nThe work of ten years will see a<br />\nforms of research and work, were Dr. by the Johns Hopkins Universit<br />\nsuccessful conclusion this winter for<br />\nHanson, who has completed his book, Press.<br />\nWilliams Centenary<br />\nDr. Havens, when he plans to finish<br />\nThe first, Mani and Beast in Fret/<br />\n\"Heating, Ventilating and Air Conhis book, The Growth of a Poet's<br />\nTwo Johns Hopkins men, Professor<br />\nditioning,\" after months of serious Thought of the Eighteenth Cent<br />\nMind. While taking the second half W. Mansfield Clark and Newton D.<br />\nwork, and Dr. Carol Reike, who, at was written by Hester Hastings<br />\nof a year's leave of absence, starting Baker, helped<br />\nWilliams College<br />\nthe request of Professor J. H. Keenan supervised in its exposition by<br />\nthis February, he plans to complete here hold a four day program in honor<br />\nof the Massachusetts Institute of fessor Gilbert Chinard, former<br />\ntin book abroad, and leave it in Eng- of the centenary of the induction into<br />\nTechnology, has been provided with fessor in the French Departmei<br />\nComes<br />\nTo<br />\nUsing<br />\nHopkins<br />\nOf<br />\nSkeptical<br />\nShock<br />\nElectrical<br />\nFor<br />\nland for publication.<br />\noffice of one of the institution's most<br />\nmeans to complete the large diagram the Hopkins.<br />\nResuscitation; Leaves Convinced Of Its Value<br />\nThe book is a study of the poet famous presidents, Mark Hopkins.<br />\nDiffering considerably in tex<br />\nshowing the properties of steam RS<br />\nWordsworth, as shown in the long<br />\nThe daily program consisted of the<br />\nagreed upon by a recent international second, The Syntax of the G<br />\nLife<br />\nIn<br />\nSaving<br />\npoem The Prelude, considered by presentation of papers and theses on<br />\nconfeernce at New York. This will be Cast in Aristophanes, writte)<br />\nmany the greatest long English poem the various arts by men known<br />\nOnce more man, through the dis- very sceptical of the theory, left two of great value to designers, teachers, James Wilson Poultney, is a sttu<br />\nsince Milton's Paradise Lost. The throughout the academic field for their<br />\nthe examples of the genitive<br />\ncoveries made in his laboratories has days later convince of the vast possi- and engineers.<br />\npoem is unique in that it furnishes knowledge. Professor W. Mansfield<br />\nworks of Aristophane.<br />\nbilities of the new concept. A few<br />\nfound<br />\nanother<br />\nbarricade<br />\nto<br />\nconfound<br />\nmore material for the study of the Clark, Delmar professor of PhysiologiNext, a volume on the poet, P<br />\ndays later, the surgeon was operating<br />\nmind and imagination of the poet than cal Chemistry at Hopkins, led a morn- the attacks of the Grim Reaper. This on a man who had been stabbed in Night School Enrollment<br />\nwas published. It emphasizes Pin<br />\nperhaps any other piece of work. ing session in a \"Science Symposium\" time the powers of electricity are the heart with a knife. While working<br />\nShows Nearly 100% Rise influence on later literature and p<br />\nFourteen manuscripts are available while Newton D. Baker spoke at the employed to 'sustain and lengthen on the patient, the doctor saw fibrilthat he is of interest to this so\"this mortal coil\" of man.<br />\nfor study, extending over a long pe- Centenary Luncheon.<br />\nAn increase in the enrollment in the Modern Age by virtue of his<br />\nlations of the heart, signs that death<br />\nriod of time, as the poet revised and<br />\nSeveral months ago an eminent was near. Immediately, as a last re- Night Courses for Technical Workers and eternal ideas. The name<br />\nAmong other speakers at the four<br />\nrewrote the work. These separate ver- day program were James Rowland surgeon visited the laboratory of Dr. source, he gave the patient several this year has been announced by the book is Pindar: A Poet of<br />\nsions are studied for fundamental Angell, President of Yale University; William Kouwenhoven, assistant Dean electrical shocks; in a short time the Engineering Department. In some of Ideas, by David Moore<br />\nRobinsor<br />\nideas and growth, in addition to the Lotus Delta Coffman, President of the of Engineering, and discussed with patient recovered strength, lasted the basic courses, the figures show an<br />\nThe last book delves deeply<br />\ndevelopment of the imagination, the University of Minnesota; Karl Taylor him the use of electric currents for throughout the operation, and is now increase of almost 100 per cent over vital economic phase<br />\nof the at<br />\nChief gift of every poet.<br />\nCompton, President of the Massachu- resuscitation after heart failure. Dr. perfectly healthy, having made a com- last year's enrollment. According to Maryland in colonial times. Pro<br />\nDr. Havens has devoted every spare setts Institute of Technology; Livings- Kouwenhoven had been working on plete recovery.<br />\nmembers of the faculty, this is especi- of agriculture of that time are tr<br />\nminute to the work for some years ton Farrand, President of Cornell this problem for several years, using<br />\nThis is the first time in medical ally encouraging inasmuch as it is especially those problems still<br />\nPast and has now a manuscript of University; and Mildred Helen McAfee dogs in his experiments.<br />\nhistory that electrical shock has been indicative of the fact that men taking ent in modern agriculture. Vert<br />\nsome 600 pages, which will be the newly elected President of Wellesley<br />\nThe surgeon, who, previous to his used for resucitation of patients ex- these basic courses will take the more Wycoff wrote this opus, Tobacc(<br />\nsize of the book when finished.<br />\nCollege.<br />\ntalk with Dr. Kouwenhoven had been piring from heart difficulties.<br />\nadvanced ones in subsequent years.<br />\nulation in Colonial Maryland,<br />\n<br />\nBradford Captain<br />\n<br />\nProctors Aid Group<br />\n<br />\nAddresses, Papers<br />\nFeature Summer<br />\nEngineer's Work<br />\n<br />\nBetter Service,<br />\nEconomy Goal<br />\nOf Cafeteria<br />\n<br />\nHopkins Press Has<br />\nFour New Volumes<br />\n<br />\nPlans To Complete<br />\nHis Book Abroad<br />\n<br />\nSurgeonVisitsDr.Kouwenhoven;<br />\nLater Saves A Human Life<br />\nv.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER 6, 1936<br />\n<br />\n2<br />\n<br />\nObt jobrig Tippkitui<br />\n<br />\nThe NEWS-LETTER cannot support a<br />\nman who is not only mobile but who<br />\nis actually favorable to the forces of<br />\nfascism in America, to those forces<br />\n<br />\nPetioz<br />\n<br />\nletter<br />\n<br />\nwhich would destroy every last vestige<br />\nof freedom. That man is Mr. Landon:<br />\nhe is undoubtedly a political puppet,<br />\n<br />\nI'll Still Take Roosevelt<br />\nThis is the first of a series of articles by students of the University on the<br />\ncandidates for the presidential election of 1936. Following the last article the<br />\nNEWS-LETTER will conduct its quadrennial Straw Vote. The NEWS-LETTER<br />\ninvites comment and criticism.--THE EDITOR<br />\nBy J. MURRAY KEMPTON<br />\nAfter four years of it, I'll still take side which the services held under<br />\nRoosevelt.<br />\nthe auspices of the late Billy Sunday<br />\niSuch a position is, I suppose, an in- take on the color of Witches' Holidication of the most arrant stupidity.<br />\ndays.<br />\nKindlier critics might call it divine<br />\nIt is a glorious picture, and we can<br />\nmadness. For a few have had so many<br />\n<br />\nIRCLIN<br />\nTHE<br />\n<br />\nAMPUS<br />\n<br />\nLiterary Horizon<br />\nGreen Apple Harvest. By Sheila<br />\nKaye-Smith. 312 pp. New York;<br />\nDutton & Company, $1.00.<br />\nIn Green Apple Harvest, by Sheila<br />\n<br />\nKaye-Smith, we have a fine, panoWith STANLEY MORTON FINKEL ramic novel of Sussex. The fiction is<br />\n$2.00<br />\nSubscription per year<br />\nA TOAST TO THE NEW SEASON on a grand scale, but the writing is<br />\n$2.50<br />\nBy Mail<br />\nbetween capitalism and socialism, but<br />\nWell as the college fellows have not in the grand manner; it is simple,<br />\nchanged Tennyson; drink out the old,<br />\nbetween Democracy and Fascism. Redirect, forward. Yet, in the sharp and<br />\nRemit subscription fees to Treasur- action is growing stronger. Fascism is<br />\ndrink in the new! As we take our cup,<br />\ndepiction of persons and epihuman<br />\ner, Student Activities Council, Rempurchased when we were a freshmanstiffing democracy. Intellectually GerHopkins<br />\nlibthe<br />\nJohns<br />\nin<br />\nsodes projected against the backsen Hall, Postoffice,<br />\nopportunities to see the light as have almost see Abraham Lincoln and iac, from its hiding place<br />\nmany and Italy are dead. Free speech been granted me. Embryonic captains<br />\ndrink<br />\nand<br />\nX's<br />\nunder<br />\nUniversity.<br />\ncases<br />\nfile<br />\nrary<br />\nground of one of England's oldest<br />\nTheodore Roosevelt beaming paternalhas been suppressed, and free thought, of industry, rich in the expediences of ly in the background.<br />\nour fill—here goes another season and most historic diversions, the book<br />\nof our column.<br />\nis as memorable as it is interesting.<br />\nEntered as second-class matter De- and a free press, and religious toler- two summers of bank-running, have<br />\nNow I am not one of those who<br />\n*<br />\n*<br />\n*<br />\ntheir<br />\nin<br />\nall<br />\nbare,<br />\nto<br />\nlay<br />\nme<br />\naside<br />\ntaken<br />\nGreen Apple Harvest follows the<br />\ncember 3, 1909, at the Postoffice in ance, and academic freedom, almost<br />\nhold to polemic as the sole weapon<br />\nGreetings to my Nd readers (the career of Bob Fuller, the wastrel<br />\nhorror, the mysteries of New Deal of debate. I hope I will never be one<br />\nBaltimore, Md., under the Act of Con- life itself.<br />\nfinance. Alcoholic viewers-with-alarm of those who thinks all the sheep are proofreader and my mother) and the son a a wild farmer, who was first<br />\ngress, November 3, 1879.<br />\nThat stagnation and intellectual<br />\nhave backed me into corners and have on my side and all the goats or yours. new ones ( ?.) Once again we're get- converted at a revival meeting, seemdeath ultimately threatens America raked me fore and aft as a betrayer<br />\nting dizzy circlin' the square...we've ingly against his will, and then drawn<br />\nThis is not intended as an apokigia<br />\nPublished semi-weekly from Octo- if Mr. Landon is elected. The NEWSof the Flag, the Bible, and the Found- for Joe Robinson and Paul McNutt. tried in the past to give you origin- into an all-consuming love for a gypsy<br />\nber to June, except during examinaing Fathers. And yet here I am, with Nevertheless, I feel that it is impor- ality and variety and hope to continue girl. Since Bob had always been known<br />\nLETTER chooses democracy.<br />\ntion and college holiday periods by<br />\nour civilization crumbling into dust, tant to examine the present state thus. Disturb the dust in Box 313 with to be a carefree fellow who liked his<br />\nundergraduates of the Johns Hopkins (The NEWS-LETTER will present its<br />\na contribution or suggestion, and re- whiskey as well as, or better than, the<br />\nsitting, as in the ivory tower, still of Republican morality.<br />\nchoice for the presidency Friday. It<br />\nUniversity.<br />\nceive an autographed copy of this next person, and because he suddenly<br />\npeacefully surveying the desolation<br />\nThere are men—and Al Smith is<br />\nwill support its statments on Mr. wrought by Tugwell, Ickes and Frankcolumn.<br />\ndeclared himself converted, he incurone of them—of whose honesty and<br />\n*<br />\n*<br />\n*<br />\nLandon in future issues.)<br />\nred the wrath of the neighboring<br />\nfurter.<br />\nEDITORIAL STAFF<br />\nsincerity I have no doubt, who have<br />\nfarmers, whose opinions of him beIt is a good thing to sit down and set their faoSs against the New Deal. CAMPUS NOTES<br />\nEditor-in-Chief<br />\nWilliam Diamond<br />\nActivities are, with all the latest came only more forceful when he went<br />\nonce<br />\nevery<br />\nof<br />\nopinions<br />\none's<br />\ntake<br />\nstock<br />\nhas<br />\nEditor<br />\nstand<br />\nAssociate<br />\nthe<br />\nthem<br />\nOf<br />\nStanley Finkel<br />\nFor many<br />\nin a while. I suppose it is a good been a painful one, and they should orchestras, in full swing . . . the through successive stages of religious<br />\nJames Morrow, David Caplan<br />\nthing even when one's opinion is really be honored by all parties for taking NEWS-LETTER will appear steadily ,exaltation and beer-guzzling, culminManaging Editors<br />\ntwice a week . . . about 35 boys are ating in his death. Bob's one uncoman emotion. For any opinion grounded<br />\nSports Editor<br />\nBernard D. Pinck<br />\nRegardless of how many or how few on a ideal rather than a business in- it.<br />\nout for it . . . Musical Club attracted promising passion, which probably<br />\nMurray Kempton, Benjamin Root<br />\nBut there are other men, still sit- over 100 at its first tryouts . .. Negogames the football team may win this dex is, in our time, really an emotion.<br />\nwas inherited from his Bible-reading<br />\nAssistant Managing Editors<br />\nting in the high councils qf the Re- tiations are in the air to hold a joint<br />\nwas his efforts to achieve<br />\ncerfather,<br />\nis<br />\nI<br />\nthat<br />\nthe<br />\nthink<br />\nfact,<br />\none<br />\nthing<br />\na<br />\nof<br />\nis<br />\nmatter<br />\nAs<br />\nthere<br />\nyear,<br />\nArnold Glantz, Harold Zheutlin<br />\npublican party and still heavy con- concert with Goucher . . . about 30 Grace. These attempts led him<br />\nAssistant Sports Editors tain. The fine spirit and cooperation Roosevelt case is pretty strong even tributors to its war chest, who have<br />\nmen are out for the Hullabaloo . . . through a life of combined ecstacy and<br />\nThe latest indices form<br />\nIsadore Gertman, Wethered Barroll<br />\nexhibited by both coaches and players statistically.<br />\nfought with every resource at their cross-country, football<br />\ncandidates torment, and he finally renounced his<br />\nof<br />\n\"fumbthe<br />\nresults<br />\nof<br />\nfair<br />\nsample<br />\na<br />\nNews Editors since the start of practice some two<br />\ncommand, every attempt at social well-seasoned for opening meets . . . religion at his death, as his father<br />\nling with recovery.\" And those who<br />\nin the last decade. They frats selling themselves to bewildered<br />\nhad done before him.<br />\nReporters—Sigmund Safier, Max Is- weeks ago will make it a team worthy talk so glibly of the coming inflation legislation<br />\nmen to whom the eight hour frosh . . . Faculty Club nearing comThe characterization of Robert Fullkowitz, Nathaniel Finkelstein, Jew- of bearing the name of Hopkins and and national bankruptcy would prof- are the<br />\na Communistic plot, and to pletion.<br />\ner is Miss Haye-Smith's greatest<br />\nett Goldsmith, Howard Reizenstein, worthy of the whole-hearted support it from the works of such able New day was<br />\n* * *<br />\nwhom any form of social security is a<br />\nachievement. His abnorma personJulian Adler, Carl Rasin, Floyd<br />\nof everyone connected with the Uni- Deal apologists as Chester Crowell reflection on the individualism and<br />\nwho<br />\ntold the pond next ality and tragic life are portrayed with<br />\nWe wonder<br />\nKatske, Malcolm Boshnack, Leonard<br />\nand Joseph P. Kennedy.<br />\nversity.<br />\nself-reliance of the American worker to Gilman Hall to \"dry up\". Looks simplicity, and his paradoxical conRubinger, Morris Wessel, Arthur<br />\nBut, for myself as well as the<br />\nand his employer. For the last four like Frosh-Soph week will not be \"all duct is the logical reaction to a perthis<br />\nappreciate<br />\nIn order to fully<br />\nKatz, Martin Krieger, Lester RosenBaltimore Sun there is \"little satisyears, they have been roaring down wet\" this year.<br />\nto<br />\nback<br />\nsonality warped and twisted by disthal, Sidney Baum.<br />\nattitude, one need only look<br />\nfaction in a merely frugal Roosevelt.\"<br />\n* * *<br />\nFranklin Roosevelt in every Union<br />\nappointments and lacking the courfootI'd probably be for him if he were as<br />\nthe fall of 1934. At that time<br />\nBUSINESS STAFF<br />\nLeague Club in the land. I am not<br />\nWhen \"The New Guliver\" opens at age with which both could have been<br />\nhis<br />\ncontend.<br />\ncritics<br />\nas<br />\nwasteful<br />\nball at the Hopkins had reached a<br />\nnaive enough to believe that these the Little Theatre this Saturday, it conquered. His association with the<br />\nWilliam B. Kempton....<br />\nFor there are two kinds of waste<br />\nBusiness Manager new low. The undergrads were rapidly<br />\nmen are now apostles of the \"New will reveal the Russians in a waggish beautiful gypsy, Hannah, and his un--the waste of money and the waste of<br />\nFreedom.\"<br />\nMelville Locker<br />\nbecoming disgusted, the team itself<br />\nmood. The fascinating, niagica,1 story successful marriage to Mabel are<br />\nhuman resources. Through the last<br />\nAssistant Business Manager was becoming discouraged, and the<br />\non the part Is acted by 3,000 little Cigarettes cre- both caused by an intense hunger and<br />\neffort<br />\nevery<br />\nof<br />\nspite<br />\nIn<br />\nup<br />\npiling<br />\nbeen<br />\nwe<br />\nhave<br />\nhalf-century<br />\nWm. C. Erlanger<br />\nrubber, metal, wood 4nd need for affection and companionship.<br />\nadministration was seriously consider- for our posterity a heavier load than of Mr. Landon and the ridiculous ated from<br />\nAdvertising Manager<br />\nfigure being about When these failed, his strength and<br />\nOut\")<br />\ncompleted<br />\na<br />\ncloth,<br />\nScoundrels<br />\nThe<br />\n(\"Turn<br />\nFrank<br />\ning the complete abolition of the any debt Roosevelt can create. Our<br />\nhand. One central desires went into his attempts to<br />\nman's<br />\na<br />\nGerald Willen......Circulation Manager<br />\nfailed<br />\nof<br />\nsize<br />\nhas<br />\nthe<br />\nparty<br />\nRepublican<br />\nwaste of material resources is reflect- Knox, the<br />\nOffice Manager sport. Then it was suggested that a<br />\nfourteen-year-old old achieve Grace and \"get religion.\" This<br />\na<br />\nHoward Linkoff<br />\nsupthe<br />\ncharacter,<br />\nof<br />\nincubus<br />\nthe<br />\nof<br />\nitself<br />\nrid<br />\nto<br />\ned in the shifting sands of the great<br />\npoll be taken to determine opinion of<br />\nNathaniel Soifer<br />\noutstanding who does a remarkable piece of acting, ,became his only means of expression<br />\nagricultural Middle West, our waste port of practically every<br />\nCopy and Filing Manager the matter. The results of the poll<br />\nsays plays the very human Gulliver. For and it resulted finally in his death,<br />\nLandon<br />\nreactionary.<br />\nAmerican<br />\nof human resources in the faces of<br />\nflgurettes portray for he died of the injuries inflicted by<br />\nprovided the first ray of hope, for it the men who file by the office of the that Roosevelt is fostering Monopoly; the rest, the little<br />\nthe hates, the a group of fed-up ,parishoners to<br />\nloves,<br />\nthe<br />\ndrama,<br />\nis<br />\nTuesday, October 6, 1936<br />\nthe<br />\nInstitute<br />\nSteel<br />\nand<br />\nIron<br />\nthe<br />\nService. yet<br />\nReemployment<br />\nshowed that the students were over- National<br />\nhypocrisy and the heroism of a tiny, whom he was preaching.<br />\nthat<br />\nsays<br />\nKnox<br />\nRepublican.<br />\nsolidly<br />\nwhelmingly in favor of the retention Some call any desire to better such<br />\nthe civil lib- miniature world where kings and<br />\nAll in all, Green Apple Harvest is<br />\nconditions Communism. Personally Roosevelt has attacked<br />\nMember<br />\n1937<br />\n1936<br />\nof the game. Relying on this expresqueens, radio crooners and members of vibrantly alive and interesting. It<br />\nWilliam<br />\nyet<br />\nindividual;<br />\nthe<br />\nof<br />\nerty<br />\nI prefer to call it common decency.<br />\nmost Parliament live their miniature lives. gives Bob Fuller the dignity of an<br />\nsion of student opinion, the athletic<br />\nThe New Deal represents the first Randolph Hearst is Landon's<br />\n* * *<br />\nLandon<br />\nAnd<br />\ninward conviction and he inexorably<br />\nsupporter.<br />\nconspicuous<br />\nfor<br />\nplans<br />\nlay<br />\nto<br />\ndepartment began<br />\nDistributors of<br />\nattempt of an enlightened liberalism<br />\ndepartment informs pursues it.<br />\nstatistics<br />\nOur<br />\nrich<br />\nthe<br />\nRoosevelt,<br />\nunder<br />\nthat,<br />\nsays<br />\nwas<br />\natThe<br />\nthese<br />\nschedule<br />\nproblems.<br />\nwith<br />\nto deal<br />\nthe future. A five-game<br />\nare en—Sigmund Diamond<br />\ngrow richer and the poor grow poorer. us that about 650 colleges<br />\nworked out for the '35 season, a tempt has often been a faltering one,<br />\ncomgridiron<br />\nvarsity<br />\nin<br />\ngaged<br />\nactive<br />\nas<br />\nstatement<br />\nastounding<br />\nthis<br />\nsubmit<br />\nI<br />\nseven-game program for the follow- but, in any aspect, it is a thousand<br />\nNo, the facts petition, with 2,000 scheduled games<br />\ntimes better than What went before. needing no comment.<br />\ning year. The fine turnout for footline between and over 25,000 men participating.<br />\nthe<br />\ninescapable,<br />\ntoo<br />\nare<br />\nAnd that's why I'm still for Roose* * *<br />\nwisthe<br />\nproven<br />\nhas<br />\nseason<br />\ntoo clearthis<br />\nball<br />\nreactionary<br />\n(Continued from Page 1, Col. 3, 4)<br />\nvelt. We did not secure the blessings progressive and<br />\nA NEW KNOCK-KNOCK TALE<br />\nCoughlin - Townsend - Smith dom of the optimistic steps taken by of Utopia for ourselves and our pos- ly drawn.<br />\nThe<br />\ndetermined looking freshman<br />\nA<br />\nI spoke a while ago of \"a crisis<br />\nmovement is a phenomena of the the Athletic Department.<br />\nterity by his election in 1932, and we<br />\nslowly up to the fourth floor<br />\nplodded<br />\nA good motto suggested for this<br />\ngreatest importance and it must not<br />\nAt the time of this writing there will hardly secure them this time. in world democracy.\" By the time of Gilman Hall, gave a faint recollec- column is \"Duce goes around and<br />\nlibthe<br />\nconcerted<br />\nprint,<br />\nin<br />\na<br />\nAs<br />\nappear<br />\nwill and have had is a pro- these words<br />\nbe underestimated.<br />\nare more than sixty-five men out for What we<br />\ntion of a Thank-God-forgotten fad as around, and it comes out here\". Howmovement —radical of method and<br />\nressively liberal government, recog- eral popular government of Spain—<br />\n... and walked ever, greetings to all of youse guys<br />\nhe knocked on the door.<br />\nexpected.<br />\nstill<br />\nthe team with ten more<br />\nnizing and in some measure facing our Which Mr. Hamilton calls \"Communof speech—it is being used to direct<br />\nmilitaristic air new at the Hopkins, and may you get<br />\na<br />\nWith<br />\noffice.<br />\nthe<br />\nin<br />\nthe<br />\nprsent problems. And that, in a ma- ist\"--may have fallen before the comvotes into the Landon Camp. It is at- Such spirit certainly deserves<br />\nthis<br />\nfrom<br />\nof an R.O.T.C. neophyte, he inquired, indigestion<br />\nreading<br />\nthe<br />\nof<br />\ntempting to play up the false issue of backing and encouragement<br />\njor crisis of world democracy, is about bined onslaught of the Fascist pow\"What uniform must I have for this column . .<br />\ners. The inevitable capitulation of<br />\ncommunism versus capitalism. It is student body. We feel sure it will be the best we can reasonably expect.<br />\ncourse\"? Came the quick reply, \"You Two of our prominent seniors are<br />\nPeople are constantly telling me Madrid will leave England and France<br />\ntrying to prove that progressivism is a team worth supporting.<br />\ndon't need a darn one to take fresh- still blushing 'midst their contempormajor democratically<br />\nabout the \"purge\" of the Republican as the only<br />\nreaction by some of the most blatant<br />\nman history\"!<br />\naries after having their photographs<br />\nparty. The Old Guard, hitherto unrec- constituted nations in Europe.<br />\n*<br />\ndemagoguery in American history, by<br />\n*<br />\n*<br />\nplastered on the back page of a promvictory<br />\nclear-cut<br />\nand<br />\nAt such a time a<br />\nognized, was, according to their acempty promises of Impractical<br />\nAnd now a communication from inent Baltimore paper under the<br />\ncount off its collective feet and carried over the forces that make for reac- our illustrious predecessor, whom we heading \"Freshmen All\"! ! ! We wish<br />\nimpracticable proposals.<br />\naway by a new (Republican) liberal- tion in America will be of incalculable found behind a desk and a moustache: Monsieurs Davis and Raine a<br />\nThis group is the greatest obstacle<br />\npleasant<br />\nThe decision of the authorities to<br />\neneven<br />\nhas<br />\nliberties<br />\nism, nurtured and brought to flower importance. The repudiation of these<br />\nAmerican oil<br />\nWhile quietly walking tending my four more years here . . .<br />\nthe<br />\nfrom<br />\naid<br />\nfinancial<br />\nbe<br />\nin Topeka and personified in the men and their philosophy cannot<br />\ncountered. It is fascism pure and sim- withdraw<br />\nown affairs, rejoicing in solitude, one,<br />\nEmbarassing Moments<br />\ntoo overwhelming. I am hoping with Stanley Finkel, worthy NEWS-LETTER<br />\nple. It is exactly parallel to the rise Hullabaloo comes as no surprise to sturdy figure of Alf Landon.<br />\nWhen the slightly tipsy but beautiThe Kansas gang seems to have all my heart for that repudiation. As slave, approached me from nowhere— ful blonde approached me wagging<br />\nof German and Italian fascism.<br />\nthose who have watched the UniversiMr. Landon is a shell--and a poor ty in its forced retrenchment during turned an ordinary Republican wake one who calls himself a liberal, I as good news hounds should.,--and re- her graceful finger at my carefully<br />\ninto a colossal evangelical orgy, be- couldn't hope for anything else.<br />\none at that—a sheep's clothing for<br />\nquested my obituary;\"a brief account groomed hair saying, \"Oh look! The<br />\nthe past three years. The only wonder,<br />\nHearst and fascism. He is the Ameriof the life of a recently deceased per- Glory That Was Greece\" . . .<br />\nthat it did not happen<br />\ncan Lorelei. He must be judged more perhaps, is<br />\nson.\" I hadn't time to demur; however;<br />\nCollegiate Comment<br />\nby what he does not say and by his earlier.<br />\nA lazy man is a guy who marries<br />\nthose who knew me delighted in unuendoes than by his record. And<br />\nAs a matter of fact, the cutting off<br />\nearthing my innermost secrets, and a widow with five children .. .<br />\nis record, certainly, is no model of of appropriations from the Student<br />\nLocal Color<br />\nthose to whom I am a stranger would<br />\nberal action.<br />\nfancies. However and this is the rub not benefit by the acquaintanceship—<br />\nA comely colored girl had just been<br />\n(By Associated Collegiate Press)<br />\nActivities Committee is no little boon<br />\nt is a commonplace to associate<br />\nWould you believe it? Here we --the committee of judges at a liar's therefore, no obituary, but my WILL: baptized in the river. As she came to<br />\nof the yearbook. Of late<br />\nLiberty League and Mr. Hearst to the staff<br />\npreserver- the surface, she cried, \"Bless de Lawd,<br />\nliterary lights had contest staged at the University of —To the Frosh, courage,<br />\neconomic slavery and dictator- the appropriations have been so small thought that the<br />\nI'se saved. Las' nite I was in the<br />\nsince, and a good dictionary.<br />\nthe<br />\nare<br />\nof<br />\nblown out of sports. Bill Shakespeare California, conceding that women<br />\n). The suggestion, and the warning that the greatest problem<br />\n—To the Sophs, female senior high ahms of Satan, but tonite Ah'm in<br />\nthat they form as well the threat Hullabaloo editor has been the reduc- graduated from Notre Dame, and superior in this sinful art, refused<br />\ndates who would rather love than de ahms of de Lawd.\"<br />\nolitical slavery is often pooh- tion of his original plans. Placing the Henry Wadsworth Longfellow left to let the questionably fairer sex<br />\n\"Sistuh,\" came a baritone voice<br />\neat.<br />\ned. The NEWS-LETTER believes book on a subscription basis will defithe opportunity of competing --To the Juniors, a full day's work, from the shore, \"how is you fixed for<br />\nhave<br />\n\"The<br />\nNow<br />\nno.<br />\nBut<br />\nNorthwestern.<br />\nthese men do compose a tangible nitely serve to provide a better book:<br />\nand the sophisticated date who ap- tomorra ebening?\"<br />\nLast of the Mohicans\", James Feni- against the men. Now they have their<br />\nt to the American tradition of not only because of the increased inpreciates finesse and necks only in<br />\nthe<br />\n\"lie-ing-sun\".<br />\nin<br />\nown<br />\nplace<br />\nMarat<br />\nmore Cooper has popped up<br />\ndom, in short, that they are the come for the Hullabaloo, but also<br />\nHIX AND HOPKINS<br />\nthe dark.<br />\nif<br />\ntimes<br />\na<br />\nit<br />\nhundred<br />\nheard<br />\nYou've<br />\nU.<br />\nquette<br />\nearly<br />\nknow<br />\nbecause the managers will<br />\nerican apostles of fascism.<br />\nin his syndicated coluian,<br />\nHix,<br />\n\"EyeJohn<br />\nleisure,<br />\nmuch<br />\nseniors,<br />\ntho<br />\n--To<br />\n*<br />\n*<br />\n*<br />\nin<br />\nits<br />\nis<br />\nit<br />\nagain<br />\nhere<br />\nnot<br />\nbut<br />\nmore,<br />\nis not meant to imply by all this in the season just how they are to<br />\nGaza,\" \"Steps Going Down,\" Strange As It Seems, reported the<br />\nIn<br />\nless<br />\nBites<br />\n\"Boy<br />\nguise:<br />\nfall-model<br />\nnew<br />\nUniat<br />\nthe<br />\nstudents<br />\nthe<br />\nof<br />\nSome<br />\ngo<br />\nt Mr. Landon is himself a fascist. stand financially and can thus<br />\ndisinclination toward women, and J. H. U.'s possession of the Polygot<br />\nad- versity of Kentucky go to great Beast!\"<br />\nadvocacy of a politico-economic ahead with their work and take<br />\nBible—printed in 1599 with twelve<br />\nmy summer in Massachusetts.<br />\ntrainstate<br />\nnear<br />\nthe<br />\nall<br />\nhappened<br />\nIt<br />\nImagine<br />\nan<br />\neducation.<br />\nlengths for<br />\ntorship not so many months ago vantage of discounts.<br />\ndifferent translating the text on each<br />\nKropman<br />\nM.<br />\n—Harold<br />\nWing, Minnesota<br />\nIt was unfortunate but inevitable covering 11,800 miles just to go to ing school of Red<br />\nbe put down as a frantic appeal<br />\npage.<br />\nMethuselaic<br />\nof<br />\nthe<br />\ndramatization<br />\nthis<br />\nthey<br />\nwould school. From China? India? No,<br />\ne protection of his oil interests. that undergraduate activities<br />\nFor the new man here as well as<br />\ngag.<br />\n\"man-bite-dog\"<br />\nthe<br />\nfrom<br />\nmiles<br />\nodd<br />\n30<br />\nabout<br />\nlive<br />\nonly<br />\nsufgeneral<br />\nLandon is putty, soft, formless have to participate in the<br />\nWe think that the new hats(?)<br />\nRay Billy gave rookie Journalism the old let us hasten to recommend<br />\nthe campus, but they commute daily.<br />\nthe hands of Mr. Hearst and of fering of the University during<br />\nour fair city's best worn by the fairer (to say \"weaker\",<br />\nof<br />\none<br />\nyou<br />\nas<br />\nto<br />\nhe<br />\nwhen<br />\nversion<br />\nthe<br />\nlatest<br />\ninstructors<br />\nhe<br />\nthat<br />\nfigures<br />\nfellows<br />\nthe<br />\nof<br />\nOne<br />\nnothiberty League. The alliance of past few years. There is little or<br />\nthe Bubble Room at the we feel would be ambiguous) sex<br />\npraying burns approximately 785 gallons of tried to capture a liberty-loving weas- dance places<br />\ngroups with fascism is familiar ing that can be done beyond<br />\nHotel. This popular make them conceited—with all those<br />\nBaltimore<br />\nLord<br />\nsimdo<br />\nin<br />\nwill<br />\nweasels<br />\nall<br />\ngoot<br />\nAs<br />\nel.<br />\nwhich<br />\nyear,<br />\nschool<br />\nthe<br />\nin its fi- gas during<br />\n1. The aid given by them directly that the University succeed<br />\nJohnny Johnson feathers in their caps. Not to mention<br />\nfeaturing<br />\nnow<br />\nis<br />\nroom<br />\nquite evident, amounts to . . . let's see . . . maybe ilar circumstances, this one wrapped<br />\ne fascist nations of Europe—in nancial campaigns. It is<br />\nheard on the the barriers to dancing and romance<br />\nnow<br />\nhis<br />\norchestra,<br />\nand<br />\nhand.<br />\nright<br />\nBilly's<br />\naround<br />\nmouth<br />\nits<br />\nyourself.<br />\nthe Hullabaloo you'd better figure it out for<br />\nform of credit, munitions, and in the meantime, that<br />\nentire fall they create. It used to be that your girl<br />\nthe<br />\nfor<br />\nprogram,<br />\nTastyeast<br />\n* * *<br />\nWhen the \"fur-fang\" showed mule<br />\nthe management<br />\nble newspaper publicity—is of Is in a spot. So far as<br />\nfrom would make eyes at the other fellows;<br />\nreturned<br />\njust<br />\nhas<br />\nJohnny<br />\nseason.<br />\nloose,<br />\npried<br />\nbe<br />\nto<br />\nrefusing<br />\nMaiden-Munchausens are in a class tendencies,<br />\ndone everything<br />\n✓ importance when compared of the yearbook has<br />\nsuccesses at the Hotel now she takes his eyes—out, with<br />\nsensational<br />\nstrong<br />\nhis<br />\nwith<br />\nhard<br />\nhim<br />\nbit<br />\nBilly<br />\nhad<br />\nwe<br />\nhere<br />\nAnd<br />\nthemselves.<br />\nby<br />\nin<br />\nup for the lack<br />\nthe similarity in argument and possible to make<br />\nCommodore in New York and the New those protruding feathers.<br />\nThey deserve the aid of thought all along that men were the teeth until the animal passed out.<br />\nd of American and European resources.<br />\nOh well, feather your own jest!<br />\nHotel in New Jersey.<br />\nMonmouth<br />\nyou,<br />\nsir!<br />\nto<br />\nhat<br />\nits<br />\ndoffs<br />\nJournalism<br />\nand<br />\nfables<br />\nof<br />\ngreatest fabricators<br />\nthe entire student body.<br />\ns and ultra-nationalists.<br />\nand therefore an incubator of fascism.<br />\nThe issue of 1936 is not a struggle<br />\n<br />\nOne Sure Thing<br />\n<br />\n!Associated Colletsiate Press<br />\n<br />\nColleeiate Dieest<br />\n<br />\nHalf-Wit And<br />\nWisdom<br />\n<br />\nEditorial<br />\n<br />\nToo Bad But<br />\n<br />\nTHIS COLLEGIATE WORLD<br />\n<br />\n.1:<br />\n<br />\n\fHOMEWOOD, BALTIMORE, MD., OCTOBER 6, 1936<br />\n<br />\na<br />\n<br />\n(1<br />\n<br />\nLarge Social<br />\nSport Program<br />\nFor Dorm Men<br />\n<br />\nStars At Fords<br />\n<br />\nThe Intrafraternity Board has an-<br />\n<br />\n4<br />\n<br />\nEighty Prospective Engineers<br />\nStart Training In Varied<br />\nFields<br />\n<br />\nProctors Aid Group<br />\nProfs To Deliver Series Of<br />\nInformal Talks To<br />\nResidents<br />\n—Courtesy News-Post<br />\nIna<br />\n<br />\nClaire<br />\n<br />\noperation of the Peabody Institute<br />\n<br />\nSummer's End<br />\n<br />\nBaltimore's theatrical season swings<br />\nand jurisdiction of Ed Lotz, member into its height, when the New York<br />\nof the athletic department of The Theatre Guild brings its production of<br />\nUniversity. The program will consist End of Summer to the Ford's for a<br />\nof all forms of team and individual three day's engagement. With Ina<br />\nplay in their respective seasons. Suit- Claire and Osgood Perkins in the leadable awards will be given to winning ing roles, one of last season's most<br />\nsophisticated comedies will present<br />\nteams and persons.<br />\nA group of over fifteen chess play- the first of four performances Thursers have been organized for the pur- day evening, October 8.<br />\nEnd of Summer was a pronounced<br />\npose of mutual enjoyment of the game<br />\nand the discovery of the dormitory hit in New York last season. It was<br />\nchess champion. Dormitory dances written for Ina Claire by S. N. Behrare also being planned, and will be man, author of Biograph, in Which<br />\nin Baltimore two<br />\nheld if sufficient support can be guar- Miss Claire starred<br />\nyears ago. Behrman also wrote Rain<br />\nresidents.<br />\nanteed by the<br />\nFrom Heaven and The Second Man.<br />\nSummed up by Charles Squires,<br />\nPhilip Moeller, well-known director<br />\nproctor, \"The Committee is an excel- of numerous Theatre Guild performlent move in that it stimulates the ances, is responsible for End of Suman<br />\ntype of college life that we want here mer. The play is described as<br />\nAmerican comedy, the scenes of which<br />\nat Hopkins!\"<br />\nare laid in the summer home of a<br />\nwealthy, attractive, and much-spoiled<br />\nsociety matron whose current amusement is a friendship with a polished<br />\npsychoanalyst.<br />\n<br />\nDr. Mitchell Acts<br />\nAs Toastmaster<br />\nv1/47- •<br />\n<br />\nMayor Hoan Of Milwaukee Debating Team To<br />\nGuest Of Honor At<br />\nReorganize Squad<br />\nBanquest<br />\n<br />\nREMSEN CLUB TI:214EET<br />\nThe Remsen Chemical Society will<br />\nhold the first meeting of the 1936-'37<br />\nseason Thursday afternoon at 4:00<br />\no'clock in Room 221, Remsen Hall.<br />\nThis meeting will be occupied with<br />\nthe discussion several problems, very<br />\nimportant to the organization. It is<br />\nurged that all memebrs be present.<br />\nLOST!<br />\nOrange Parker Duofold<br />\nPlease Return To<br />\n<br />\nPHIL HAMBLETON<br />\nRowland 109<br />\nReward<br />\n<br />\nthat Freshmen may be entertained at<br />\nfraternity houses. This year the Intrafraternity Board and The Student<br />\nCouncil and Dean Berry are cooperat-<br />\n<br />\ning to make the Intrafraternity RushAt the first meeting of the General<br />\ning<br />\nRules more stringent.<br />\nEngineering class last Wednesday<br />\nJohn Ghinger of Phi Gamma Delta,<br />\nthere were some eighty aspirant engi- has been elected Secretary-Treasurer<br />\nneers, representing the entering class of the Intrafraternity Board, succeedin all the various Engineering Schools. ing Bernie Vincent.<br />\nThe following dates are open house<br />\nThe course, which is conducted by the<br />\ndates<br />\nfor the fraternities mentioned:<br />\nfaculties of the several departments,<br />\nFriday, October 16, Beta Theta Pi<br />\nin the introductory course for those<br />\nwho have either some doubt as to and Alpha Chi Rho.<br />\n<br />\n(Continued from page 1, col. 6)<br />\nclrews, and he has offered the use<br />\nof his piano for the events. The co-<br />\n<br />\nDr. Broadus Mitchell, Associate Professor of Political Economy at the<br />\nJohns Hopkins University, acted as<br />\ntoastmaster at a gathering of the<br />\nSocialist Party of Baltimore last Wednesday night when Mayor Daniel W.<br />\nHoan, Socialist Mayor of Milwaukee,<br />\nspoke.<br />\n\"The most interesting development<br />\nof the meeting,\" said Dr. Mitchell, was<br />\nthat there were a good number of nonSocialists there who were interested<br />\nin Mayor Hoan's administrative<br />\nsuccess\".<br />\nMayor Hoan has lowered the debt of<br />\nMilwaukee by investing the city's<br />\nmoney in United States Government<br />\nBonds at an interest rate of 5 per<br />\ncent. This rate, much above that of<br />\ncommercial banks, has given the city<br />\nenough surplus to partially reduce the<br />\ncity deficit, and at the present rate<br />\nthis deficit will completely be wiped<br />\nout within seven years.<br />\n<br />\nxford,England<br />\nymA/<br />\n<br />\nfraternities. These are the only dates<br />\n<br />\n41.80<br />\n.11tVo<br />\n<br />\nA wide and diversified athletic program is under the general supervision<br />\n<br />\nLarge Freshman Open House Dates Dr. D. M. Robinson Dr. Jennings<br />\nEnrollment For Released By Board Returns After Returns From<br />\nEuropean journey<br />\nEngineering Classes<br />\nnounced open house dates for the<br />\n<br />\n/ Musicales, Dances, Tournaments To Feature Plans<br />\nAnnounced By Pinck<br />\n<br />\nmay be obtained.<br />\nAthletic Program<br />\n<br />\n3<br />\n<br />\nPlans Southen Trip During<br />\nSpring Vacation<br />\nAs the curtain rises for another<br />\nyear of activities on the Hopkins campus, the debating team under the<br />\nleadership of Mr. Earl Reeves Wasserman hopes to enjoy as successful a<br />\nseason this year as they have enjoyed<br />\nin previous years. The debating team<br />\ncaptain, Mr. Phillip Grosman, delivered an explanatory address before<br />\nthe freshmen and sophomores telling<br />\nof the advantages and pleasures which<br />\nprospective members of the team may<br />\nenjoy.<br />\nThe debating team will have a private meeting of all members of last<br />\nyears squad ths week. A notice will<br />\nlater e printed in The NEWS-LETTER<br />\nencouraging prospective members to<br />\ntry out. The team wishes that the student body will cooperate with them in<br />\nforming a strong team and in providing a fairly large audience for each<br />\ndebate.<br />\n<br />\n1936 Cecil B. Rhodes<br />\nScholarship Now Open<br />\nCompetition for the 1936 Rhodes<br />\nScholarships assigned to the United<br />\nStates has been opened by the Committee of Selection, it was announced<br />\nby the Dean's office last week. These<br />\nscholarships, providing for two years<br />\nstudy at the University of Oxford,<br />\nwere provided by the will of the late<br />\nCecil ohn Rhodes. Thirty-two appointments, of value of four hundred<br />\npounds a year each, are available to<br />\nAmerican students between the ages<br />\nof nineteen and twenty-five, who are<br />\nunmarried and have completed at<br />\nleast their Sophomore year..<br />\n<br />\ntheir ultimate field of studies, or who<br />\nMonday, October 19, Phi Kappa Psi<br />\nare to be familiarized with the sort and Kappa Sigma.<br />\nof work demanded of the men of the<br />\nTuesday, October 20, Delta Phi and<br />\nvarious parts of the Engineering pro- Sigma Phi Epsilon.<br />\nfession; the Civil, Mechanical, Gas,<br />\nWed*esday, October 21, Phi Gamma<br />\nElectrical, and Chemical divisions.<br />\nDelta and Kappa Alpha.<br />\nThe School of Mechanical EngineerThursday, October 22, Delta Upsilon<br />\ning received the largest enlistment,<br />\nand Tau Alpha Phi.<br />\ntwenty-two students. This is always<br />\nFriday, October 23, Alpha Delta Phi<br />\none of the most popular branches, due<br />\nand Alpha Tu Omeg.<br />\nin no small measure to the efficiency<br />\nAfter Oct. 15, Thursdays from 8 to<br />\nof the manner in which some phases<br />\n10 p. m. and Saturdays from 3 to 5<br />\nof Mechanical Engineering art taught<br />\np. m. will be open house dates for all<br />\nat the Baltimore Polytechnic Institute,<br />\nthe aforementioned<br />\nthe high school which has the most fraternities, but<br />\nscheduled<br />\nfor the open house<br />\ndates<br />\nare<br />\nalumni at the Johns Hopkins College<br />\nparties.<br />\nof Engineering.<br />\nAs a close second was Chemical<br />\nEngineering, with nineteen students,<br />\nan increase of almost 100 per cent over Rev. Clinchy To Speak<br />\nlast year. This growth may be well<br />\nAt Thursday Assembly<br />\nattributed to the increased publicity<br />\nand opportunity in the field of EnginSpeaker Represents Emergency<br />\neering Chemistry. This is a new<br />\nPeace Campaign<br />\ncourse at the University, one which<br />\nidentically parallels for the first three<br />\nDr. Russell Clinchy, Minister of the<br />\nyears the work in Gas Enginering, an Mount<br />\nCongregational<br />\nPleasant<br />\nolder established course. Therefore, Church in Washington, D. C. will be<br />\nthere has been no formal instruction the speaker at the Thursday Assembly,<br />\nin this branch as yet, although it is held under the sponsorship of the<br />\nexpected that as new equipment is Johns Hopkins YMCA. This meeting<br />\nmade possible, the two will be sep- will be the first in a series sponsored<br />\narated within the next two years. by the Emergency Peace Campaign<br />\nThis new branch of Chemical study tnrough the YMCA's on various<br />\npromises to add to the record of the campuses.<br />\nmen trained at the Hopkins, which<br />\nA graduate of Drew Seminary, Dr.<br />\nstands as one of the finest in the Clinchy has been known for many<br />\ncountry.<br />\nyears throughout as a liberal<br />\nThe other branches of engineering religious leader, interested in all phasaccounted for the remained of the stu- es of social welfare. He is a director of<br />\ndents as follows; Electrical, fifteen;<br />\nCivil, ten and Gas, four. Besides these,<br />\nare those who are taking the combination courses, with work in either<br />\nthe Arts and Science group or in the<br />\nBusiness School along with the Engineering, and those in the graduate<br />\nschool.<br />\n<br />\nfamed humanist, Erasmus, who was<br />\nthe first professor of Greek at King's<br />\nCollege more than three hundred<br />\nyears ago.<br />\nA tour of Ireland, where Dr. Robinson stopped at the Lakes of Kilarney,<br />\nthe Giant's Causeway, Belfast, and<br />\nDublin, and then took time to kiss the<br />\nBlarney Stone, ended his junket. Before leaving Ireland, however, he<br />\nspent some time visiting the archaeological ruins at Tara.<br />\nDr. Robinson, before his departure<br />\nfor Europe, published his latest book,<br />\nPindar, A Poet of Eternal Ideas and<br />\nhand published in The Art Bulletin an<br />\narticle concerning the discovery of<br />\nan ancient Greek statue.<br />\n<br />\nSweet<br />\n<br />\nas<br />\nHoney<br />\n<br />\nT<br />\nhoney ip<br />\nthe brio?<br />\nkeeps the pipe'<br />\nsweet.<br />\nHigh-efficiency<br />\nCondensor cleans,putif1•11<br />\nsmoke.Traps moisture. No clog.;<br />\nsing.No trouble. Prove ityourseak<br />\n<br />\nthe American Peace Society, the<br />\nAmerican Council for Prevention of<br />\nWar and of the Middle Atlantic Council of Congregational Ministers<br />\n<br />\nAt Your Dealer\"<br />\n<br />\nMUSIC<br />\nASSOCIATION<br />\nHOLDS FIRST MEETING<br />\nThe first meeting of the Johns<br />\nHopkins Musical Association, which<br />\nsupports the Johns Hopkins Orchestra,<br />\nwill be held in the main hall of the<br />\nPeabody Institute, at 8 P. M. on<br />\nTuesday, October sixth. All members<br />\nof the University who find interest in<br />\nmusic are invited to join. The first<br />\nrehearsal is scheduled for the same<br />\nevening.<br />\nInformation is to be made available<br />\nbefore the first rehearsal, and may<br />\nbe obtained from Mr. Philip S. Morgan, 514 St. Paul Street. Phone Vernon<br />\n6906.<br />\n<br />\nPipes<br />\n<br />\nLW<br />\n<br />\nthan<br />\nactual<br />\n5t7e)<br />\n<br />\nMagazines<br />\n<br />\nTHE SPOT<br />\n3120 GREENMOUNT AVE.<br />\nNovelties<br />\n<br />\nTobaccos<br />\n<br />\nFor Your<br />\nLiquors<br />\n<br />\nSeeHARRY<br />\n3113 GAEENMOUNT AVE.<br />\nFor Delivery<br />\nPhone UN. 4883<br />\n----<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br />\n<br />\nBOULEVARD<br />\nHardware Co.<br />\n<br />\n2815 GREENMOUNT AVE.<br />\nCHesapeake 5474<br />\n<br />\nWhat you want is easy to find.<br />\n<br />\nHUTZLER BKITHEM IC)<br />\n<br />\nProfessor Herbert Spencer Jennings,<br />\nreturned to Baltimore, September 21, Henry Walters Professor of Zoology<br />\nafter a tour of Europe aboard the S.S. and Head of the Johns Hopkins University Zoology Department, has just<br />\nTransplvania.<br />\nreturned<br />\nfrom a year in England,<br />\nThe tour, which began July 30, when<br />\nwhere he held the George Eastman<br />\nDr. Robinson left the city aboard the<br />\nVisiting Professorship at Oxford.<br />\nS.S. City of Baltimore, carried him<br />\nWhile there, Dr. Jennings directed<br />\nthrough France, Belgium, Holland, research of the students and gave<br />\nlectures on the topics: \"Behavior of<br />\nand Ireland.<br />\nLower Organisms\", \"Genetics of ProIn Belgium, the scientist visited a<br />\ntozoa\", and \"The Relation of Endonew museum which is in the course<br />\nmexis to Vitality in Parameceum<br />\nof erection and came away with the Aurelia\".<br />\nimpression that that small nation is<br />\nHe was official delegate of the<br />\nenjoying a thriving economic secur- American Association for Advancement of Science at the British Associity which is not evident in France.<br />\nation for Advancement of Science<br />\nFrom Belgium, Dr. Robinson trav- Meetings<br />\nheld last fall at Norwich,<br />\neled to Holland, but remained only a England. At the Thirteenth Internashort time because of the exorbitant tional Congress of Zoology, held at<br />\nLisbon, he was the official delegate<br />\nprices.<br />\nof the United States, and of The Johns<br />\nThe next country visited was EngHopkins University. He was made a<br />\nland, where he spent short periods at<br />\nFellow of Balliol College at Oxford,<br />\nthe great university towns, Oxford and received an honorary Master's<br />\nand Cambridge. It was at the latter Degree from that College.<br />\nDr. Jenning's latest book, Genetics,<br />\ncity that he occupied the room which<br />\nwas<br />\npublished last year in England.<br />\nthe<br />\nhad once been the residence of<br />\n<br />\nGet the Pen That Never Runs Dry in Classes or Exams<br />\n<br />\nSpecial Prices For Hopkins Men<br />\n<br />\nPrices are reasonable.<br />\n<br />\nfamous Johns Hopkins archaeonlogist,<br />\n<br />\nFOR HIGHER GRADES IN COLLEGE<br />\n<br />\nWillie Hugh Laundry<br />\n<br />\nYou get efficient service.<br />\n<br />\nProlonged Cruise Takes<br />\nHopkins Archaeologist Held George Eastman ProThrough Western Europe<br />\nfessorship In Biology<br />\nDepartment<br />\nDr. David Moore Robinson, world<br />\n<br />\n432 E. 42ND STREET<br />\n<br />\nThe All-American College Favorite<br />\nWith Double Ink Capacity and<br />\nFull-length Visible Ink Supply<br />\nShows DAYS AHEAD When It's<br />\nRunning Low<br />\nDo the thing that you know is the<br />\nthing to do—replace your old-style<br />\npen with this miracle Vacumatic—<br />\nParker's revolutionary invention<br />\nthat holds 102% more ink WITHOUT INCREASE IN SIZE—that<br />\nshows the ENTIRE ink supply, not<br />\nmerely the last drop—shows not<br />\nonly when your pen is empty, but<br />\nshows DAYS AHEAD when it's<br />\nrunning low, so it CAN'T run dry<br />\nagainst your will!<br />\n<br />\nUNiversity 0749<br />\nHouse Furnishings<br />\nHardware<br />\nPaints<br />\nElectrical Supplies<br />\n<br />\nA Full<br />\nSupply<br />\nOf<br />\nQuink<br />\n<br />\nToday the Parker Vacumatic is<br />\nthe world's long-distance writer and<br />\nStyle and Beauty Winner—the sacless marvel whose simple working<br />\nparts are sealed in the top—never<br />\ntouched by ink, hence won't corrode or fail. That's why it's GUARANTEED Mechanically Perfect.<br />\nIn the hands of millions of users,<br />\nusing all kinds of ink, this marvelous<br />\npen has repeatedly proved that it<br />\n\"can take it\" anywhere and any time<br />\n—it never leaves its owner gasping<br />\nfor ink in classes or exams.<br />\nIf you'll go and try its marvelous<br />\n<br />\nSCRATCH-PROOF Point of precious Platinum and Solid Gold, you'll<br />\ngive your old-style pen to the rummage sale. Look for the smart<br />\nARROW clip—this ARROW identifies the genuine. The Parker Pen<br />\nCo., Janesville, Wis.<br />\n<br />\naricer<br />\n..1 )<br />\n4 --1/ACUMATIC:111><br />\nGUARANTEED MECHANICALLY PERFECT<br />\n<br />\nJunior, $5<br />\nOver-Size, $10<br />\n<br />\nPencils, $2.50,<br />\n$3.50 and $5<br />\n<br />\nYour Nearest Dealer is<br />\n<br />\nKIBLER'S<br />\nJEWELERS and OPTICIANS<br />\n3222 GREENMOUNT AVENUE<br />\n<br />\nGet Your<br />\nJ. H. U.<br />\nRing Here<br />\n<br />\n\fHOMEVVOOD, BALTIMORE, MD., OCTOBER 6, 1936<br />\n<br />\n4<br />\n<br />\nHill And Dalers Well Organized<br />\nFootball Team BLACKAND<br />\nComplete Series Teams To Compete<br />\nStages Initial<br />\nBLUE<br />\nOf Warm-up Drills In Intramurals<br />\nTest Scrimmage Football Men<br />\nSquad To Use Homewood Football To Start Oct. 12 —<br />\nBy BERNARD I'INCK<br />\n<br />\nGridiron Squad Put Through<br />\nHard Fast Practice<br />\nSkirmish<br />\n<br />\nBlucher Injured<br />\nKahl,<br />\n<br />\nBaetjer<br />\nGreene,<br />\nStand Out As<br />\nKickers<br />\n<br />\nFor two hours Saturday in glorious football weather, the Blue Jay<br />\ngirkkiers engaged in a hard, fast<br />\nscrimmage. Actually, this was the<br />\nfirst real test the gridiron hopefuls<br />\nhave faced and it was of invaluable<br />\naid to the members of the coaching<br />\nstaff.<br />\nPlay was confined in the main to<br />\nstraight football. Off tackle slant, center plunges and sweeping end runs<br />\nwere employed consistently. However,<br />\non certain occasions, cleverly conceived laterals and forward passes<br />\nwere brought into play.<br />\nAction For All<br />\nEvery uniformed candidate saw<br />\naction in this make-believe contest.<br />\nSeveral individuals brought to light<br />\ntheir football potentialities; while<br />\nothers aptly illustrated their apparent flaws.<br />\nFortified with a charging aggressive<br />\nline, the first string backfield turned<br />\nin a creditable exhibition. Driving low<br />\nand fast, blocking briskly, they reeled<br />\noff a number of long gains on the batling second eleven.<br />\nKicking Good<br />\nIn at. least one department, the Blue<br />\nJay huskies won't be outclassed,<br />\ntwo<br />\nwith<br />\nEquipped<br />\nkickin.<br />\nmen, Kahl and Greene, whose long,<br />\nhigh spirals carry far down the<br />\nfield, the Jays should hold their own<br />\nagainst the best punters of the opposition. For gaining point after<br />\ntouchdowns, the Jays have Baetjer,<br />\nwhose accurate place-kicking would<br />\nfulfill the dreams of any gridiron<br />\n<br />\nPractice Daily<br />\nAs the curtain rises on the current<br />\nfootball season, some 59 candidates<br />\nare putting in daily appearances at<br />\nthe practice field. Striving fervently<br />\nto acquire coveted varsity berths the<br />\nfootball hopefuls are doing their utmost to favorably impress the high<br />\nand mighty coaching staff. The sight<br />\nof footballs spiralling through the<br />\nair, the thud of bodies hitting the<br />\nturf, the shrieking exhortations of<br />\ncoaches all present testimony that<br />\nthe active organization of a Blue<br />\nJay eleven is under way at Homewood<br />\nField.<br />\nBlessed with a plethora of good material, Coach Manonce is hopeful of<br />\nturning out one of the strongest<br />\nHopkins teams of recent years.<br />\nThe return of a number of veteran<br />\nbacks, led by Captain Ted Graziano,<br />\nand the appearance of several new<br />\npromising candidates presage a versatile and capable backfield. As for the<br />\nline, Ed Lotz, line coach, does not feel<br />\nthe slightest doubt concerning the<br />\npotentialities of his charges.<br />\n<br />\nAttractive Card<br />\nArranged<br />\nA rapid glance at the 1936 schedule reveals that games have been arranged with teams of approximately<br />\nthe same calibre and strength as the<br />\nHopkins aggregation. High pressure<br />\nelevens, suspected of being subsidized<br />\nhave been dropped from the list of<br />\nBlue Jay opponents. The reasons for<br />\nthis action are obvious. The Malonee<br />\nsquad does not seek to march through<br />\na victorious season by season of a<br />\nschedule of set-ups. But certainly the<br />\n<br />\nCourse — Moxley,<br />\nCastelle Drop<br />\n<br />\nLast Year's Strongest<br />\nTeams Return<br />\n<br />\nAfter a week's practice of limberThe first intramural football game<br />\ning up exercises, the Blue Jay harriers of this year will be played on Monday,<br />\nare rounding up into what may prove October 12. This will inaugurate the<br />\nto<br />\n<br />\nbe a formidable<br />\n<br />\ncross-country<br />\n<br />\nteam. Within a few days the hill and<br />\ndalers will swing out over the gruelling 4/2 mile Homewood course, which<br />\nwinds its way over the many hills of<br />\nWyman Park and finally ends, where<br />\nit started, on the Hopkins cinder<br />\npath.<br />\nA bit of a blow was sustained when<br />\nCastelle, who was recently operated<br />\non, and Moxley announced that they<br />\nwill be unable to take part this season.<br />\nCoach Waldo Hambleton is endeavoring to replace these two men who<br />\nwere consistent point getters from a<br />\nlarge squad of new men. At present<br />\nthe following have reported for equipment: Captain Sholtes, Brown, Briscoe, Lyman, Warminski, Driscoll, Jacobs, Lloyd, Lamb, Lefstein, Mace,<br />\nMlacht, Lewis, Norton, Scharpf, Rasin,<br />\nRosenthal, Rubinger, and Zheutlin.<br />\nManager Needed<br />\nManager Saul stated that there are<br />\nopenings for Freshmen and Sophomores who wish to become managers.<br />\nAnyone interested in seeking the job<br />\nmay report at the gym any afternoon<br />\nafter 4 o'clock.<br />\nstudents team of Hopkins cannot hope<br />\nto derive any pleasure or physical<br />\nbenefit by serving as tackling dummies for teams too vastly superior<br />\nIn strength and playing ability.<br />\n<br />\nthird<br />\n<br />\nyear of intramurals at the<br />\n<br />\nHopkins.<br />\nThe teams which will participate<br />\nthis year are all definitely organized,<br />\nall of them, except the freshman<br />\nteams, being carried over from last<br />\nyear. Both teams which tied for first<br />\nplace last year, namely the SeniorGas-Civils, captained this year by<br />\nWeisman, and the Senior Business,<br />\ncaptained by Reynolds, will participate again this year. The New Jersey<br />\nAll-Stars, led by Carl Resin and Harold Zheutlin, who took second place<br />\nlast year, is determined to win the<br />\nmedals this year. This team was<br />\nthe medalist in basketball and runner<br />\nup in baseball last year, losing first<br />\nplace in baseball to the Senior Dorms.<br />\nStrong Clubs<br />\nOther strong teams which will also<br />\nstrive for victory are the Senior Mechanicals led •by Gallowey, the Senior<br />\nElectricals led by Dicker, the Junior<br />\nAll-Stars led by Josh Perman, and the<br />\nSenior Businessmen led by Reynolds<br />\nand Geraldsienis. The freshmen teams<br />\nare still dark horses but are expected<br />\nto provide plenty of competition for<br />\nthe upperclassmen.<br />\nBaer Expects Much<br />\nReuben Baer who expects to make<br />\nthis his banner year as director of<br />\nthe intramural competitions, promises very good equipment for all.<br />\n<br />\nSport Light<br />\nOur new backfield coach—dear al'<br />\n\"Wats,\" that's him . . . Experienced<br />\nan active scholastic athletic career at<br />\nPoly—football, baseball, and track .. .<br />\nGraduated in '25 .. . Entered Hopkins<br />\nto establish a name for himself on<br />\nthe gridiron and track . . . Played<br />\nat \"half\" and full for three years as<br />\nan excellent left handed passing and<br />\nblocking back . . . On the cinderpath<br />\nWats ran a fine \"100\" and \"220\" . . .<br />\nReceived sheepskin as a full fledged<br />\nengineer in '28—a three year man ...<br />\nWats and \"Mal\" Gardner \"do or<br />\ndied\" for dear old Johnny Hopkins on<br />\nthe same team during '26, 27, and '28<br />\n. . . Both hold the distinction the first<br />\nand last Hopkins team to beat Maryland since 1915 (score 14-13) . ..<br />\nPrevious to his recent appointment<br />\nas backfield coach at Homewood,<br />\nWats tutered the Boy's Latin Gridders . . . His warm reception is indicative how our boys took to Wats<br />\n—just like a duck tages to water. . .<br />\nLet's take our hats off to Wats—<br />\na peachy guy.<br />\n<br />\nIn their first hard scrimmage of the<br />\nseason, the junior varsity soccer team<br />\ndropped a close 3 to 1 decision to a<br />\nvisiting Kenwood High School Varsity. The skirmish provided Coach<br />\nDotterweich an ample opportunity to<br />\nview the merits of all the newcomers<br />\nout for the varsity squad.<br />\nNeither of the aggregations produced any me soccer, but after only<br />\nseveral days of drilling, this was to<br />\nbe expected. However, Coach Dotterweich appeared well satisfied.<br />\n<br />\non<br />\n<br />\nSaturday.<br />\n<br />\nCoach<br />\n<br />\nDotterweich<br />\n<br />\ndon fundamentals and really settle<br />\non defensive work, and sharpening<br />\nshooting eyes. The line up is still very<br />\nindefinite and all candidates are being<br />\ngiven an opportunity to exhibit their<br />\nwares and to make the first team.<br />\n<br />\n\"Do me a favor, dad.<br />\nget my suit at Jos.<br />\nSchloss & Son. It<br />\nwon't cost any more,<br />\nand it will look betand lust longer.<br />\nter<br />\n'<br />\nThe best-dressed fellows at school wear<br />\nSchloss clothes.\"<br />\nI said the very same<br />\nthing to my dad when<br />\nI was your age, and<br />\nhe told me he had<br />\nsaid the same thing<br />\nto his dad. For 81<br />\nyears, Jos. Schloss &<br />\nMon have kept a step<br />\nahead in style. They're<br />\nOldest<br />\n\"Baltimore's<br />\nCustom-Tailors with<br />\nthe Newest Ideas.\" \"All right. It's a<br />\ngo!\"<br />\n<br />\nReady to Wear Suits of<br />\nRecognized Quality<br />\nfrom $35<br />\n<br />\nJos. Schloss & Son<br />\n5 East Lexington St.<br />\n(Nowhere Else)<br />\n<br />\nYou who go in for sports... and you who<br />\ndon't... you both have reason to treat yourselves well...to reach for a light smoke... a<br />\nLucky. For a light smoke is gentle with you.<br />\nEasy on you when you inhale. Kind to your<br />\nthroat. And since your Lucky . . . a light<br />\nsmoke ... is made from the choicest center-leaf<br />\ntobacco, it tastes good, too, even when you<br />\nsmoke all day long. So, for a smoke that<br />\ntreats you right it's wise to reach for a Lucky.<br />\nAnd remember, the protection of the famous<br />\n\"Toasting\" process is enjoyed only by those<br />\nwho smoke Luckies.<br />\n<br />\n\"SWEEPSTAKES\" RASH!<br />\n17)<br />\n<br />\nFRESH AIR—EXERCISE<br />\n—SUNSHINE<br />\n—and a light smoke!<br />\n<br />\n-.-there's<br />\n<br />\nYouwholiketotakecare<br />\nof yourselves, but who<br />\nlove life's pleasures,<br />\na cigatoo<br />\nrette just made for you.<br />\nA smoke of fine richtasting tobacco—but<br />\ngentle with you, too.<br />\nA light smoke. A Lucky!<br />\n<br />\ntNIN<br />\n<br />\nOver 1760 tons of paper<br />\nbought so far!<br />\nSince the start of Your Lucky Strike<br />\n\"Sweepstakes\" more than 1760 tons of<br />\npaper have been purchased to print<br />\n\"Sweepstakes\" entry cards. Just think<br />\nof it! That's enough paper to fill about<br />\n88 freight cars.<br />\nHave you entered yet? Have you won<br />\nyour delicious Lucky Strikes? Tune in<br />\n\"Your Hit Parade\"—Wednesday and<br />\nSaturday evenings. Listen, judge, and<br />\ncomparethe tunes—then tryYour Lucky<br />\nStrike\"Sweepstakes.\" And if you're not<br />\nalready smoking Luckies,huy a pack today and try them,too.Maybe you've been<br />\nmissing something. You'll appreciate<br />\nthe advantages of Luckies— a Light<br />\nSmoke of rich, ripe-bodied tobacco.<br />\n<br />\na4ZeL<br />\nOF RICH, RIPE-BODIED<br />\nCopyright 1936, Ti.. American Tobacco Company<br />\n<br />\nTe:<br />\n<br />\ndown to learning plays, brushing up<br />\n<br />\nA smoke that treats you right!<br />\n<br />\nFuture Gridiron<br />\nRivals Look Good<br />\n<br />\nTi<br />\n<br />\nthinks the team is now ready to aban-<br />\n<br />\n611<br />\nV<br />\nIfs a Light Smoke!<br />\n<br />\nself.<br />\nLess than a week of intensive work<br />\nis ahead for this year's Hopkins eleven<br />\nbefore it entrains for Lehigh. Which<br />\nmen will start against the Brown and<br />\nWhite is not known definitely.<br />\n<br />\nMANAGER NEEDED<br />\n--Once again Manager Brian<br />\nMurphy has issued a call to all<br />\nfreshmen eager to gain the position of football manager. There<br />\nis an excellent opportunity awaiting a capable man. All those<br />\nInterested should report at the<br />\nfootball field at 4 o'clock today.<br />\n<br />\nbefore the first game with Gettysburg<br />\n<br />\n•<br />\n<br />\nGraziano Missing<br />\nMissing from Saturday's tussle was<br />\nCapthe sturdy Jay back and leader,<br />\nsuffering<br />\ntain Ted Graziano. Still<br />\nfrom a physical infirmity, the stocky<br />\ncaptain was unable to participate, but<br />\nduring this week he will once again<br />\nbe out for each practice session.<br />\nOnly one casualty marked the day's<br />\nproceedings and that a minor one.<br />\nBlucher, candidate for a tackle post,<br />\nsustained a sprained ankle which<br />\nforced him to the side-lines. But withagain<br />\nin a few days he will be back<br />\nberth.<br />\nvarsity<br />\na<br />\nfor<br />\nstruggling<br />\nBack Joins Squad<br />\nrecently<br />\nA. promising back has<br />\njoined the squad. This is Kerstetter, a<br />\ntransfer student from Canisius. For<br />\nseveral days now he has been limberring up with the other members of<br />\nscrimthe squad, and in Saturday's<br />\nmage he gave a good account of him-<br />\n<br />\n25 to 7.<br />\n<br />\ntempt to round the men into condition<br />\n<br />\n\"ilhal History repeats!<br />\n<br />\nKenwoodHigh'Tops<br />\nJay Vee Booters 3-1<br />\n<br />\nVOI<br />\n<br />\nThe varsity soccer squad is being<br />\nput through its paces daily in an at-<br />\n<br />\n•<br />\n<br />\nmentor.<br />\n<br />\nLehigh University and Washington<br />\nCollege, the first two rivals of<br />\nhave<br />\nthe Hopkins football team,<br />\ngridiron<br />\ntheir<br />\nlaunched<br />\nalready<br />\nschedules and have shown that<br />\nthey are to be feared. With a<br />\nscrappy line and a powerful balkfield, the Bethlehem aggregation has<br />\npounded out one victory in two<br />\ngames. Against the Case Rough Riders, the Brown and White crashed<br />\nthrough to a 16 to 7 victory. But<br />\nAgainst the strong Dickinson balltoters their attack and defense were<br />\nIneffective and they succumbed 20-6.<br />\nPaced by the fleet Gibbons Young,<br />\nflashy quarterback, Washington College turned back American niversity,<br />\n<br />\nVarsity Soccer<br />\nSquad Prepares<br />\nFor Gettysburg<br />\n<br />\nTOBACCO—\"IT'S TOASTED\"<br />\n<br />\nVI<br />\n<br />\nZI<br />\n<br />\noffi<br />\nmen<br />\ntoui<br />\nits<br />\nsea<br />\nhim<br />\nthe<br />\ngari<br />\n<br />\ntest<br />\nunt<br />\nand<br />\nag<br />\nper<br />\nHo,<br />\nequ<br />\nele,<br />\nsea<br />\n<br />\nrno<br />\n<br />\npoi<br />\n<br />\ngai<br />\ntea<br />\ning<br />\nHa<br />\nstr<br />\nba4<br />\nwa<br />\nCul<br />\nof<br />\ntic<br />\nan<br />\nBc<br />\nhil<br />\nSi'<br />\n<br />\nsh<br />\nha<br />\nSt<br />\nor<br />\nPC<br />\ne3<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\n:11aInto ifinpkitts ,Nrtuff-Erttrr<br /><br />\nVOLUME XLI, NO. 2<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 6, 1936<br /><br />\nButtner Named MusicMeetClubAtCandidates<br />\nRecord Turnout<br />\nNew Batallion<br />\nR.O.T.C. Major<br /><br />\nEditorial<br /><br />\nOver one hundred prospective mem-<br /><br />\nShortly the people of the United States are to cast their votes in a<br />\nThursday's presidential election. Upon their choice depends the welfare of a great nation,<br />\nmeeting of the Johns Hopkins Musical and the future, perhaps, of the. ideal of democracy. Students<br />\nof America are<br /><br />\nbers<br /><br />\nappeared<br /><br />\nat last<br /><br />\nLAST TRYOUTS FOR<br />\nMUSICAL CLUB<br />\nTONIGHT<br />\nPRICE 5 CENTS<br /><br />\n\"Phenomena of Color',<br />\nSenior Essay Topic<br />\n----The topic of the essay required<br />\nof all Seniors in the Natural Science<br />\nGroup for 1936-37 is \"The Phenomenon of Color,\" according to an announcement made through the<br />\nDean's Office.<br />\nThe essay is to include \"The<br />\nphenomenon of color: what causes<br />\nit, how it is perceived, how it is<br />\ndistributed in the universe, how it<br />\nis made use of in scientific work,<br />\nwhat effect it has on living organisms, and what its practical value<br />\nis in the arts and sciences.\"<br />\nThe papers, which are to be between 3000 and 5000 words should<br />\nbe handed to Dr. R. P. Cowles,<br />\nChairman of the Natural Science<br />\nGroup, on or before March 1, 1937.<br /><br />\nLarge Social<br />\nSport Program<br />\nFor Dorm Men<br /><br />\nClub. Candidates eager for coveted not exempt from the necessity of expressing their choice.<br />\nThe NEWS-LETTER,<br />\npositions on the Hawaiian Troupe, because it attempts to reach the ear of an enlightened group<br />\nin an enlightened<br />\nMajor Barrett To Fill the Banjo Club, the Glee Club, or the University and because it tries to guide, if not to lead, its thought, not only<br />\nMusicales, Dances, TournaBlue Jay Band, the dance orchestra<br />\nVacancy Caused By<br />\nrealizes the necessity but also considers it a duty to make public its policies<br />\nof the group, as well as those interestments To Features Plans<br />\nCoffin's Removal<br />\ned in the organization solely from the and opinions.<br />\nAnnounced By Pinck<br />\nThe NEWS-LETTER not only finds it impossible to support Governor<br />\nadministrative viewpoint, were welcomed by President John Steeper and Landon for the presidency of the United States but warns as well that his<br />\nOscar Steinwald, director of the Glee election would deliver a paralytic stroke to<br />\nAmerican democracy and liberty.<br />\nAll Officers Except Corporals Club. At the meeting the officers told<br />\nThe NEWS-LETTER objects in part to the man himself, but primarily to the<br />\nall the candidates present what comAnnounced<br />\nLate<br />\nProfs To Deliver Series Of<br />\nprise the principles, ideals, purposes, tendencies and groups which he represents. It is not the personality of the<br />\nman which the NEWS-LETTER finds wanting, but his record of intellectual<br />\nYesterday<br />\nand standards of the Music Club.<br />\nInformal Talks To<br />\nIn spite of the large turnout there honesty, his record of consistency, his record as an administrator. For it is,<br />\nThe appointment of W. D. Buttner,<br />\nResidents<br />\nis still room for anyone of musical after all, only by his record that one can know what is to be expected from<br />\nas Major, Battalion Commander of talent or<br />\nadministrative ability to him in the future. So far there has been no sign of intelligence, no sign of<br />\nTouch football, ping pong, and chess<br />\nthe Johns Hopkins Reserve Officers join any of the units of the club.<br />\nany intelligent grasp of national affairs, from Governor Landon. But far<br />\ntournaments; musicales, dances, and<br />\nThis evening at 7:30 P. M., final try- more serious than this is Mr. Landon's allegiance to the forces of reaction and<br />\nTraining Corps, for the coming year<br />\ninformal addresses are but a few of<br />\nwas officially announced late yester- outs for all positions yet open will fascism in America.<br />\nthe events planned by The Dormitory<br />\nbe held for all interested students.<br />\nday by the Department of Military<br />\nActivities Committee, a one year old<br />\nThese are times in which we must not base our opinions upon the details<br />\norganization which has been reorganScience and Tactics.<br />\nof a man's work or thoughts. This is an era in which social movements are<br />\nized for the purpose of giving to the<br />\nJ. M. Bradford was promoted to<br />\ndominating our national life and they cannot be denied. The selection of a<br />\nresident men \"by far the most extenCaptain, Battalion Adjutant. Other<br />\nnational administrator must be compatible with one's beliefs in those tendensive social program that the dormitory<br />\nnewly appointed officers are as<br />\ncies which are clashing in the world today.<br />\nhas had in many a year,\" in the words<br />\nfollows:<br />\nThe economic life of a nation is constantly in a state of flux, of restless<br />\nof Bernard Pinck, chairman of the<br />\nCOMPANY A<br />\nmovement. Nothing is static; nothing is certain but change. Today, America, Professors Christie, Retalliata group.<br />\nJ. H. Skeen, Captain; H. M. Diver,<br />\naccording to the nature of things, is moving forward. Every man is faced with<br />\nThe committee is composed of<br />\nKouwenhoven Figure In<br />\nW. 0. Nelson, and J. W. Sause, First<br />\nthe problem of choosing the direction in which he wishes to go. It is unfortunrepresentatives of the Freshman,<br />\nLieutenants; G. G. Duce, M. McCord, Refurnished Cafeteria Will ate but true that the Republican party is being led today by a group which is<br />\nSummer Conferences<br />\nSophomore, Junior, Senior, and<br />\nS. R. Orem, andC. E. Sholtes, Second<br />\ndirecting<br />\nthe<br />\ncourse<br />\nof<br />\neconomic<br />\nand<br />\npolitical<br />\nprogress<br />\ntoward<br />\nfascism.<br />\nHave<br />\nMore<br />\ngraduate dormitory men. The proctors<br />\nPleasant<br />\nforfaculty<br />\nand<br />\nHopkins men, both<br />\nLieutenants; W. J. Dickey and C. T.<br />\nMr. Landon and his supporters are in the van of American reaction, and they<br />\nare members with Dr. Donald Hatch<br />\nAtmosphere<br />\nThan<br />\nEver<br />\nEnginL.<br />\nSergeants;<br />\nB.<br />\nMewshaw, First<br />\npoint the way directly to fascism. There is no claim that they desire a return mer students in the Schols of<br />\nAndrews, Senior proctor, chairman,<br />\nStinchcomb, Color Sergeant.<br />\nto the days of Harding-Coolidge-Hoover. They could not turn time back if they eering, have been doing prominent ex-officio. Each of the committee<br />\nThe<br />\nHall<br />\nLevering<br />\nwill<br />\ncafeteria<br />\nin<br />\nCOMPANY B<br />\nwished. They are leading the way to the ultramonopolistic totalitanian state work this past summer. Either rep- members is personally responsible<br />\nW. 0. Peale, Captain; J. R. Gallo- again strive to offer superlative serv- of Germany and Italy.<br />\nresenting the University at the various for the<br />\norganization and direction of<br />\nway, H. J. Hofmann, and D. W. Thom- ice to the student body this year.<br />\nEngineering conferences and Society some<br />\nactivity, social event, or series<br />\nas, First Lieutenats; J. J. Gronicki, According to Mrs. Lucy P. Johnson,<br />\nMr. Landon raises the banner of false liberalism in the attempt to divert meetings or engaged in research, of cultural events. The committee<br />\nC. Reinoldi, E. L. Rowny, and J. the manager of the cafe, every effort votes to his<br />\ncause. It is not only error but actual danger to be taken in by several of the most able men in their members are Messrs. Dickson, KasTampico, Second Lieutenants; W. G. will be made to make it a pleasant, these false professions<br />\nof liberalism and personal liberty. The same weasel respective fields have brought credit par, Kelten, Graham, Baratz, and<br />\nKeir and H. R. Strobel, First Serge- economical place in which the students<br />\nto the University.<br />\nwords were heard in Germany and in Italy.<br />\nEd. Lotz. The committee was under<br />\nmay take their meals.<br />\nants.<br />\nAt the World Power Conference, the<br />\nThe NEWS-LETTER finds itself unalterably opposed to the economic and<br />\nsponsorship of the student coun\"I should like to take this opporCOMPANY C<br />\npolitical philosophy which Mr. Landon protects. The NEWS-LETTER has always held last September in Washington, cil last year.<br />\nR. E. Nopper, Captain; E. S. Bern- tunity to welcome back the uppermaintained a profound reverence for freedom and personal liberty. To many Professors A. G. Christie of the MechAccording to Dr. Andrews, \"the<br />\ngartt, 0. L. Collins, and N. P. Kemp, classmen, as well as to greet the new<br />\nthe<br />\nfreedom cherised by the American democracy is purely political. Eco- anical Engineering department and idea underlying the program of The<br />\nFirst Lieutenants; W. E. H. Maulsby, students,\" said Mrs. Johnson. \"I shall<br />\nnomic freedom and liberty are now essential as well. Political freedom is Cooper of the Political Economy group Dormitory Activities Committee is<br />\nS. A. Rittenhouse, A. I. Spear, and R. always welcome your suggestions for<br />\nmeaningless without the other. The NEWS-LETTER believes the two are insep- were representatives in the large the bringing about of a greater<br />\nH. Tubman, Second Lieutenants; M. the improvement of our service,\" she<br />\ngroup of eminent scientists and engin- friendliness<br />\narable<br />\nand that they are among the inalienable rights of man.<br />\nbetween the students in<br />\nJ. Hartke and H. R. Hranicka, First continued,\" and you may feel free at<br />\neers,<br />\nwho gather together every sixth the<br />\ncontradiction<br />\nterms<br />\nIt<br />\nto<br />\nis<br />\nbelieve<br />\na<br />\nin<br />\nthis<br />\nand<br />\nto<br />\nbelieve<br />\nin<br />\nthe<br />\nfalse<br />\ndormitory,<br />\nand, also, the serving<br />\nall times to come to my office and<br />\nSergeants.<br />\nliberalism professed by Mr. Landon. It is to this reaction that the NEW- year from all parts of the globe to as a group capable of assisting the<br />\nhave a chat with me.\"<br />\nCOMPANY D<br />\ndiscuss topics of vital and mutual<br />\nThe surroundings of the cafeteria LETTER objects first. And in the second place, it is convinced that, although interest and to further the cause of residents to utilize their recreative<br />\nH. H. Leber, Captain; C. P. Manger,<br />\nprofessions<br />\nmay<br />\nthe<br />\npossibly<br />\nhave<br />\nbeen<br />\nmade<br />\nin<br />\ngood faith, their execution<br />\ntime more fully, and according to<br />\nE. V. Pieper, and L. 0. Wallis, First will be even more pleasant this year;<br />\nwould be impossible when one considers the aggregate of reactionary economic pooling the civilized world's knowl- their desires.<br />\nLieutenants; G. C. Jones, J. P. Schles- the dining room having been painted<br />\nedge of power generation, utilization,<br />\nforces which support Mr. Landon.<br />\nFaculty Speakers<br />\ninger, and G. F. Stark, Second Lieu- in a cheerful color scheme, new curan dconservation. At this gathering,<br />\nIn an effort to give the opportunitenants; R. B. Stegmaier and W. E. tains having been procured, and new<br />\nthe paper read by Professor Christie,<br />\nty to lower-classmen to know better<br />\nThat is the transcendent issue of this campaign. We must not elect to the<br />\nchair-backs ordered. Something special<br />\nWindsor, First Sergeants.<br />\nentitled \"Development and Performthe leading men of the Johns Hopkins<br />\nand attractive has been planned for presidency a man who would abolish civil liberties—who represents a kept<br />\nBAND<br />\nance of American Power Plants,\"<br />\nUniversity,<br />\nthe committee will invite<br />\npress,<br />\ndiscussion.<br />\nHallowe'en<br />\nwho<br />\nwould<br />\nMr.<br />\nand<br />\nLandon<br />\nis<br />\nbeing<br />\nhas<br />\nfree<br />\nheld in the<br />\nsilence<br />\nbeen built-up as a was very well received and much disJ. W. Soule and G. J. R. Weigand,<br />\nsuch men to dinner, after which the<br />\npresidential candidate of unheard-of proportions by the Hearst press. He has<br />\nstrictest secrecy.<br />\nFirst Lieutenants.<br />\ncussed, gaining prominent place in<br />\nresidents will retire to the common's<br />\nMrs. Johnson also stated that a been brought to the top as a result of an undercurrent campaign of race<br />\nCorporals will not be appointed until<br />\nthe September issue of Mechanical<br />\nroom and the open fireplace to engage<br />\nprize contest will be held at some date hatred, and of religious intolerance, and of intense nationalism. Mr. Landon— Engineering.<br />\nafter six weeks of intensive drill.<br />\nin informal chats with the guests,<br />\nMajor Lawrence J. I. Barrett, who in the near future by the management he promises to protect labor from unions and union organizers—would abolish<br />\nAt the annual meeting of the Ameror to hear them speak under much<br />\nhas been appointd to fill th vacancy of the cafeteria. The object of this the right of labor to organize and to bargain collectively.<br />\nican Society of Mechanical Engineers,<br />\nMr. Landon represents and is supported by those interests and men which three papers by members of the staff more informal conditions than exist<br />\ncaused by Major Frank Coffin's trans- contest will be to construct as many<br />\nferral, will be in charge of the group words as possible from a key word compose the \"special interests,\" the \"economic royalists.\" These men are of the Engineering school were read, in a class or lecture room.<br />\nIn consideration of the large numthis year. Major Barrett graduated which will be announced. The winner aligned without exception behind Mr. Landon; and with them is Mr. Hearst— starting with Dr. J. T. Retalliata's<br />\nber<br />\nof musically inclined dormitory<br />\nfrom West Point in 1914 and served of the contest will receive free meals the symbol of all that is low, and narrow, and ignorant, and dangerous in treatise \"Undercooled Steam,\" which<br />\nIn the army during the war. He re- in the cafeteria for a given time. In American life. Mr. Landon is their Man Friday. It is difficult to believe that also was his dissertation for his degree men, musicales are being planned.<br />\nThey will take place at regular inceived an honorable discharge in 1919 addition, free meals will be awarded Mr. Landon, no matter how honest of heart, could withstand their pressure.<br />\nin graduate work. Others were A. H.<br />\nand went to the Infantry Officers to the student who brings in the most<br />\nMr. Landon's first allegiance is to his supporters; it must be so; without Senner, \"Domestic Oil Burners,\" and tervals throughout the year. The<br />\nTraining School at Fort Benning. customers.<br />\ntheir intervention it is beyond the realm of imagination that he should have Professor Christie, \"Early Allis-Chal- affairs were suggested by Dr. An(Continued on page 3, col. 1)<br />\nIn 1921 he was made a member of<br />\nAlso of interest to the student body been chosen to the Republican candidacy. The power behind the Landon mers Steam Engines,\" a historical<br />\nof the staff at Fort Benning and he is the fact that Miss Nona Johnson candidacy is a fascist newspaper propagandist, and an equally fascist survey.<br />\ncomes to Hopkins directly from that will be back at the cash register. This Liberty League.<br />\nIn the Electrical Engineering conshould make payment less painful.<br />\nschool.<br />\nvention at San Francisco, early in<br />\nAs far as cost is concerned, Mrs.<br />\nThe smoke screen of counter-Communism is raised by the Landon-Hearst- the summer, Dr. William B. KouwenJohnson stated that although food Liberty League Coughlin-Townsend-Smith alliance. It was<br />\npointed out by a hoven presented a paper, later pubprices have risen, the prices in the presidential candidate recently that every election since 1792 has had its red<br />\nlished in the Electrical Engineering.<br />\ncafeteria have not. Toasted sandwiches herrings. But people believe. Mr. Landon is represented as<br />\nPublications Include<br />\nthe man who will entitled \"Electric Shop.\" At the same First<br />\nice-cream<br />\nsandwiches will be save America from Communism—as Hitler saved Germany and as Mussoand<br />\nmeeting papers by A. Seletzky, '27,<br />\nSurvey Of Early State<br />\nDr. Havens To Finish featured.<br />\nlini saved Italy from Communism.<br />\nand Davidge Rowland, '22; \"Circuits\"<br />\nTobacco Problems<br />\nThe methods of European fascism are being reproduced here to the and \"Electric Porcelain,\" respectively,<br />\nIntensive Work Of<br />\nminutest detail.<br />\nFour books, containing a variety of<br />\nwere presented.<br />\nTen Years<br />\nhave been published this year<br />\ntopics,<br />\n(Continued<br />\nPage<br />\n2,<br />\nCol.<br />\non<br />\n1)<br />\nBusy<br />\nsummer<br />\nduring<br />\nat<br />\nthe<br />\nother<br />\nHopkins Men Attend<br />\nThe work of ten years will see a<br />\nforms of research and work, were Dr. by the Johns Hopkins Universit<br />\nsuccessful conclusion this winter for<br />\nHanson, who has completed his book, Press.<br />\nWilliams Centenary<br />\nDr. Havens, when he plans to finish<br />\nThe first, Mani and Beast in Fret/<br />\n\"Heating, Ventilating and Air Conhis book, The Growth of a Poet's<br />\nTwo Johns Hopkins men, Professor<br />\nditioning,\" after months of serious Thought of the Eighteenth Cent<br />\nMind. While taking the second half W. Mansfield Clark and Newton D.<br />\nwork, and Dr. Carol Reike, who, at was written by Hester Hastings<br />\nof a year's leave of absence, starting Baker, helped<br />\nWilliams College<br />\nthe request of Professor J. H. Keenan supervised in its exposition by<br />\nthis February, he plans to complete here hold a four day program in honor<br />\nof the Massachusetts Institute of fessor Gilbert Chinard, former<br />\ntin book abroad, and leave it in Eng- of the centenary of the induction into<br />\nTechnology, has been provided with fessor in the French Departmei<br />\nComes<br />\nTo<br />\nUsing<br />\nHopkins<br />\nOf<br />\nSkeptical<br />\nShock<br />\nElectrical<br />\nFor<br />\nland for publication.<br />\noffice of one of the institution's most<br />\nmeans to complete the large diagram the Hopkins.<br />\nResuscitation; Leaves Convinced Of Its Value<br />\nThe book is a study of the poet famous presidents, Mark Hopkins.<br />\nDiffering considerably in tex<br />\nshowing the properties of steam RS<br />\nWordsworth, as shown in the long<br />\nThe daily program consisted of the<br />\nagreed upon by a recent international second, The Syntax of the G<br />\nLife<br />\nIn<br />\nSaving<br />\npoem The Prelude, considered by presentation of papers and theses on<br />\nconfeernce at New York. This will be Cast in Aristophanes, writte)<br />\nmany the greatest long English poem the various arts by men known<br />\nOnce more man, through the dis- very sceptical of the theory, left two of great value to designers, teachers, James Wilson Poultney, is a sttu<br />\nsince Milton's Paradise Lost. The throughout the academic field for their<br />\nthe examples of the genitive<br />\ncoveries made in his laboratories has days later convince of the vast possi- and engineers.<br />\npoem is unique in that it furnishes knowledge. Professor W. Mansfield<br />\nworks of Aristophane.<br />\nbilities of the new concept. A few<br />\nfound<br />\nanother<br />\nbarricade<br />\nto<br />\nconfound<br />\nmore material for the study of the Clark, Delmar professor of PhysiologiNext, a volume on the poet, P<br />\ndays later, the surgeon was operating<br />\nmind and imagination of the poet than cal Chemistry at Hopkins, led a morn- the attacks of the Grim Reaper. This on a man who had been stabbed in Night School Enrollment<br />\nwas published. It emphasizes Pin<br />\nperhaps any other piece of work. ing session in a \"Science Symposium\" time the powers of electricity are the heart with a knife. While working<br />\nShows Nearly 100% Rise influence on later literature and p<br />\nFourteen manuscripts are available while Newton D. Baker spoke at the employed to 'sustain and lengthen on the patient, the doctor saw fibrilthat he is of interest to this so\"this mortal coil\" of man.<br />\nfor study, extending over a long pe- Centenary Luncheon.<br />\nAn increase in the enrollment in the Modern Age by virtue of his<br />\nlations of the heart, signs that death<br />\nriod of time, as the poet revised and<br />\nSeveral months ago an eminent was near. Immediately, as a last re- Night Courses for Technical Workers and eternal ideas. The name<br />\nAmong other speakers at the four<br />\nrewrote the work. These separate ver- day program were James Rowland surgeon visited the laboratory of Dr. source, he gave the patient several this year has been announced by the book is Pindar: A Poet of<br />\nsions are studied for fundamental Angell, President of Yale University; William Kouwenhoven, assistant Dean electrical shocks; in a short time the Engineering Department. In some of Ideas, by David Moore<br />\nRobinsor<br />\nideas and growth, in addition to the Lotus Delta Coffman, President of the of Engineering, and discussed with patient recovered strength, lasted the basic courses, the figures show an<br />\nThe last book delves deeply<br />\ndevelopment of the imagination, the University of Minnesota; Karl Taylor him the use of electric currents for throughout the operation, and is now increase of almost 100 per cent over vital economic phase<br />\nof the at<br />\nChief gift of every poet.<br />\nCompton, President of the Massachu- resuscitation after heart failure. Dr. perfectly healthy, having made a com- last year's enrollment. According to Maryland in colonial times. Pro<br />\nDr. Havens has devoted every spare setts Institute of Technology; Livings- Kouwenhoven had been working on plete recovery.<br />\nmembers of the faculty, this is especi- of agriculture of that time are tr<br />\nminute to the work for some years ton Farrand, President of Cornell this problem for several years, using<br />\nThis is the first time in medical ally encouraging inasmuch as it is especially those problems still<br />\nPast and has now a manuscript of University; and Mildred Helen McAfee dogs in his experiments.<br />\nhistory that electrical shock has been indicative of the fact that men taking ent in modern agriculture. Vert<br />\nsome 600 pages, which will be the newly elected President of Wellesley<br />\nThe surgeon, who, previous to his used for resucitation of patients ex- these basic courses will take the more Wycoff wrote this opus, Tobacc(<br />\nsize of the book when finished.<br />\nCollege.<br />\ntalk with Dr. Kouwenhoven had been piring from heart difficulties.<br />\nadvanced ones in subsequent years.<br />\nulation in Colonial Maryland,<br /><br />\nBradford Captain<br /><br />\nProctors Aid Group<br /><br />\nAddresses, Papers<br />\nFeature Summer<br />\nEngineer's Work<br /><br />\nBetter Service,<br />\nEconomy Goal<br />\nOf Cafeteria<br /><br />\nHopkins Press Has<br />\nFour New Volumes<br /><br />\nPlans To Complete<br />\nHis Book Abroad<br /><br />\nSurgeonVisitsDr.Kouwenhoven;<br />\nLater Saves A Human Life<br />\nv.<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 6, 1936<br /><br />\n2<br /><br />\nObt jobrig Tippkitui<br /><br />\nThe NEWS-LETTER cannot support a<br />\nman who is not only mobile but who<br />\nis actually favorable to the forces of<br />\nfascism in America, to those forces<br /><br />\nPetioz<br /><br />\nletter<br /><br />\nwhich would destroy every last vestige<br />\nof freedom. That man is Mr. Landon:<br />\nhe is undoubtedly a political puppet,<br /><br />\nI'll Still Take Roosevelt<br />\nThis is the first of a series of articles by students of the University on the<br />\ncandidates for the presidential election of 1936. Following the last article the<br />\nNEWS-LETTER will conduct its quadrennial Straw Vote. The NEWS-LETTER<br />\ninvites comment and criticism.--THE EDITOR<br />\nBy J. MURRAY KEMPTON<br />\nAfter four years of it, I'll still take side which the services held under<br />\nRoosevelt.<br />\nthe auspices of the late Billy Sunday<br />\niSuch a position is, I suppose, an in- take on the color of Witches' Holidication of the most arrant stupidity.<br />\ndays.<br />\nKindlier critics might call it divine<br />\nIt is a glorious picture, and we can<br />\nmadness. For a few have had so many<br /><br />\nIRCLIN<br />\nTHE<br /><br />\nAMPUS<br /><br />\nLiterary Horizon<br />\nGreen Apple Harvest. By Sheila<br />\nKaye-Smith. 312 pp. New York;<br />\nDutton &amp; Company, $1.00.<br />\nIn Green Apple Harvest, by Sheila<br /><br />\nKaye-Smith, we have a fine, panoWith STANLEY MORTON FINKEL ramic novel of Sussex. The fiction is<br />\n$2.00<br />\nSubscription per year<br />\nA TOAST TO THE NEW SEASON on a grand scale, but the writing is<br />\n$2.50<br />\nBy Mail<br />\nbetween capitalism and socialism, but<br />\nWell as the college fellows have not in the grand manner; it is simple,<br />\nchanged Tennyson; drink out the old,<br />\nbetween Democracy and Fascism. Redirect, forward. Yet, in the sharp and<br />\nRemit subscription fees to Treasur- action is growing stronger. Fascism is<br />\ndrink in the new! As we take our cup,<br />\ndepiction of persons and epihuman<br />\ner, Student Activities Council, Rempurchased when we were a freshmanstiffing democracy. Intellectually GerHopkins<br />\nlibthe<br />\nJohns<br />\nin<br />\nsodes projected against the backsen Hall, Postoffice,<br />\nopportunities to see the light as have almost see Abraham Lincoln and iac, from its hiding place<br />\nmany and Italy are dead. Free speech been granted me. Embryonic captains<br />\ndrink<br />\nand<br />\nX's<br />\nunder<br />\nUniversity.<br />\ncases<br />\nfile<br />\nrary<br />\nground of one of England's oldest<br />\nTheodore Roosevelt beaming paternalhas been suppressed, and free thought, of industry, rich in the expediences of ly in the background.<br />\nour fill—here goes another season and most historic diversions, the book<br />\nof our column.<br />\nis as memorable as it is interesting.<br />\nEntered as second-class matter De- and a free press, and religious toler- two summers of bank-running, have<br />\nNow I am not one of those who<br />\n*<br />\n*<br />\n*<br />\ntheir<br />\nin<br />\nall<br />\nbare,<br />\nto<br />\nlay<br />\nme<br />\naside<br />\ntaken<br />\nGreen Apple Harvest follows the<br />\ncember 3, 1909, at the Postoffice in ance, and academic freedom, almost<br />\nhold to polemic as the sole weapon<br />\nGreetings to my Nd readers (the career of Bob Fuller, the wastrel<br />\nhorror, the mysteries of New Deal of debate. I hope I will never be one<br />\nBaltimore, Md., under the Act of Con- life itself.<br />\nfinance. Alcoholic viewers-with-alarm of those who thinks all the sheep are proofreader and my mother) and the son a a wild farmer, who was first<br />\ngress, November 3, 1879.<br />\nThat stagnation and intellectual<br />\nhave backed me into corners and have on my side and all the goats or yours. new ones ( ?.) Once again we're get- converted at a revival meeting, seemdeath ultimately threatens America raked me fore and aft as a betrayer<br />\nting dizzy circlin' the square...we've ingly against his will, and then drawn<br />\nThis is not intended as an apokigia<br />\nPublished semi-weekly from Octo- if Mr. Landon is elected. The NEWSof the Flag, the Bible, and the Found- for Joe Robinson and Paul McNutt. tried in the past to give you origin- into an all-consuming love for a gypsy<br />\nber to June, except during examinaing Fathers. And yet here I am, with Nevertheless, I feel that it is impor- ality and variety and hope to continue girl. Since Bob had always been known<br />\nLETTER chooses democracy.<br />\ntion and college holiday periods by<br />\nour civilization crumbling into dust, tant to examine the present state thus. Disturb the dust in Box 313 with to be a carefree fellow who liked his<br />\nundergraduates of the Johns Hopkins (The NEWS-LETTER will present its<br />\na contribution or suggestion, and re- whiskey as well as, or better than, the<br />\nsitting, as in the ivory tower, still of Republican morality.<br />\nchoice for the presidency Friday. It<br />\nUniversity.<br />\nceive an autographed copy of this next person, and because he suddenly<br />\npeacefully surveying the desolation<br />\nThere are men—and Al Smith is<br />\nwill support its statments on Mr. wrought by Tugwell, Ickes and Frankcolumn.<br />\ndeclared himself converted, he incurone of them—of whose honesty and<br />\n*<br />\n*<br />\n*<br />\nLandon in future issues.)<br />\nred the wrath of the neighboring<br />\nfurter.<br />\nEDITORIAL STAFF<br />\nsincerity I have no doubt, who have<br />\nfarmers, whose opinions of him beIt is a good thing to sit down and set their faoSs against the New Deal. CAMPUS NOTES<br />\nEditor-in-Chief<br />\nWilliam Diamond<br />\nActivities are, with all the latest came only more forceful when he went<br />\nonce<br />\nevery<br />\nof<br />\nopinions<br />\none's<br />\ntake<br />\nstock<br />\nhas<br />\nEditor<br />\nstand<br />\nAssociate<br />\nthe<br />\nthem<br />\nOf<br />\nStanley Finkel<br />\nFor many<br />\nin a while. I suppose it is a good been a painful one, and they should orchestras, in full swing . . . the through successive stages of religious<br />\nJames Morrow, David Caplan<br />\nthing even when one's opinion is really be honored by all parties for taking NEWS-LETTER will appear steadily ,exaltation and beer-guzzling, culminManaging Editors<br />\ntwice a week . . . about 35 boys are ating in his death. Bob's one uncoman emotion. For any opinion grounded<br />\nSports Editor<br />\nBernard D. Pinck<br />\nRegardless of how many or how few on a ideal rather than a business in- it.<br />\nout for it . . . Musical Club attracted promising passion, which probably<br />\nMurray Kempton, Benjamin Root<br />\nBut there are other men, still sit- over 100 at its first tryouts . .. Negogames the football team may win this dex is, in our time, really an emotion.<br />\nwas inherited from his Bible-reading<br />\nAssistant Managing Editors<br />\nting in the high councils qf the Re- tiations are in the air to hold a joint<br />\nwas his efforts to achieve<br />\ncerfather,<br />\nis<br />\nI<br />\nthat<br />\nthe<br />\nthink<br />\nfact,<br />\none<br />\nthing<br />\na<br />\nof<br />\nis<br />\nmatter<br />\nAs<br />\nthere<br />\nyear,<br />\nArnold Glantz, Harold Zheutlin<br />\npublican party and still heavy con- concert with Goucher . . . about 30 Grace. These attempts led him<br />\nAssistant Sports Editors tain. The fine spirit and cooperation Roosevelt case is pretty strong even tributors to its war chest, who have<br />\nmen are out for the Hullabaloo . . . through a life of combined ecstacy and<br />\nThe latest indices form<br />\nIsadore Gertman, Wethered Barroll<br />\nexhibited by both coaches and players statistically.<br />\nfought with every resource at their cross-country, football<br />\ncandidates torment, and he finally renounced his<br />\nof<br />\n\"fumbthe<br />\nresults<br />\nof<br />\nfair<br />\nsample<br />\na<br />\nNews Editors since the start of practice some two<br />\ncommand, every attempt at social well-seasoned for opening meets . . . religion at his death, as his father<br />\nling with recovery.\" And those who<br />\nin the last decade. They frats selling themselves to bewildered<br />\nhad done before him.<br />\nReporters—Sigmund Safier, Max Is- weeks ago will make it a team worthy talk so glibly of the coming inflation legislation<br />\nmen to whom the eight hour frosh . . . Faculty Club nearing comThe characterization of Robert Fullkowitz, Nathaniel Finkelstein, Jew- of bearing the name of Hopkins and and national bankruptcy would prof- are the<br />\na Communistic plot, and to pletion.<br />\ner is Miss Haye-Smith's greatest<br />\nett Goldsmith, Howard Reizenstein, worthy of the whole-hearted support it from the works of such able New day was<br />\n* * *<br />\nwhom any form of social security is a<br />\nachievement. His abnorma personJulian Adler, Carl Rasin, Floyd<br />\nof everyone connected with the Uni- Deal apologists as Chester Crowell reflection on the individualism and<br />\nwho<br />\ntold the pond next ality and tragic life are portrayed with<br />\nWe wonder<br />\nKatske, Malcolm Boshnack, Leonard<br />\nand Joseph P. Kennedy.<br />\nversity.<br />\nself-reliance of the American worker to Gilman Hall to \"dry up\". Looks simplicity, and his paradoxical conRubinger, Morris Wessel, Arthur<br />\nBut, for myself as well as the<br />\nand his employer. For the last four like Frosh-Soph week will not be \"all duct is the logical reaction to a perthis<br />\nappreciate<br />\nIn order to fully<br />\nKatz, Martin Krieger, Lester RosenBaltimore Sun there is \"little satisyears, they have been roaring down wet\" this year.<br />\nto<br />\nback<br />\nsonality warped and twisted by disthal, Sidney Baum.<br />\nattitude, one need only look<br />\nfaction in a merely frugal Roosevelt.\"<br />\n* * *<br />\nFranklin Roosevelt in every Union<br />\nappointments and lacking the courfootI'd probably be for him if he were as<br />\nthe fall of 1934. At that time<br />\nBUSINESS STAFF<br />\nLeague Club in the land. I am not<br />\nWhen \"The New Guliver\" opens at age with which both could have been<br />\nhis<br />\ncontend.<br />\ncritics<br />\nas<br />\nwasteful<br />\nball at the Hopkins had reached a<br />\nnaive enough to believe that these the Little Theatre this Saturday, it conquered. His association with the<br />\nWilliam B. Kempton....<br />\nFor there are two kinds of waste<br />\nBusiness Manager new low. The undergrads were rapidly<br />\nmen are now apostles of the \"New will reveal the Russians in a waggish beautiful gypsy, Hannah, and his un--the waste of money and the waste of<br />\nFreedom.\"<br />\nMelville Locker<br />\nbecoming disgusted, the team itself<br />\nmood. The fascinating, niagica,1 story successful marriage to Mabel are<br />\nhuman resources. Through the last<br />\nAssistant Business Manager was becoming discouraged, and the<br />\non the part Is acted by 3,000 little Cigarettes cre- both caused by an intense hunger and<br />\neffort<br />\nevery<br />\nof<br />\nspite<br />\nIn<br />\nup<br />\npiling<br />\nbeen<br />\nwe<br />\nhave<br />\nhalf-century<br />\nWm. C. Erlanger<br />\nrubber, metal, wood 4nd need for affection and companionship.<br />\nadministration was seriously consider- for our posterity a heavier load than of Mr. Landon and the ridiculous ated from<br />\nAdvertising Manager<br />\nfigure being about When these failed, his strength and<br />\nOut\")<br />\ncompleted<br />\na<br />\ncloth,<br />\nScoundrels<br />\nThe<br />\n(\"Turn<br />\nFrank<br />\ning the complete abolition of the any debt Roosevelt can create. Our<br />\nhand. One central desires went into his attempts to<br />\nman's<br />\na<br />\nGerald Willen......Circulation Manager<br />\nfailed<br />\nof<br />\nsize<br />\nhas<br />\nthe<br />\nparty<br />\nRepublican<br />\nwaste of material resources is reflect- Knox, the<br />\nOffice Manager sport. Then it was suggested that a<br />\nfourteen-year-old old achieve Grace and \"get religion.\" This<br />\na<br />\nHoward Linkoff<br />\nsupthe<br />\ncharacter,<br />\nof<br />\nincubus<br />\nthe<br />\nof<br />\nitself<br />\nrid<br />\nto<br />\ned in the shifting sands of the great<br />\npoll be taken to determine opinion of<br />\nNathaniel Soifer<br />\noutstanding who does a remarkable piece of acting, ,became his only means of expression<br />\nagricultural Middle West, our waste port of practically every<br />\nCopy and Filing Manager the matter. The results of the poll<br />\nsays plays the very human Gulliver. For and it resulted finally in his death,<br />\nLandon<br />\nreactionary.<br />\nAmerican<br />\nof human resources in the faces of<br />\nflgurettes portray for he died of the injuries inflicted by<br />\nprovided the first ray of hope, for it the men who file by the office of the that Roosevelt is fostering Monopoly; the rest, the little<br />\nthe hates, the a group of fed-up ,parishoners to<br />\nloves,<br />\nthe<br />\ndrama,<br />\nis<br />\nTuesday, October 6, 1936<br />\nthe<br />\nInstitute<br />\nSteel<br />\nand<br />\nIron<br />\nthe<br />\nService. yet<br />\nReemployment<br />\nshowed that the students were over- National<br />\nhypocrisy and the heroism of a tiny, whom he was preaching.<br />\nthat<br />\nsays<br />\nKnox<br />\nRepublican.<br />\nsolidly<br />\nwhelmingly in favor of the retention Some call any desire to better such<br />\nthe civil lib- miniature world where kings and<br />\nAll in all, Green Apple Harvest is<br />\nconditions Communism. Personally Roosevelt has attacked<br />\nMember<br />\n1937<br />\n1936<br />\nof the game. Relying on this expresqueens, radio crooners and members of vibrantly alive and interesting. It<br />\nWilliam<br />\nyet<br />\nindividual;<br />\nthe<br />\nof<br />\nerty<br />\nI prefer to call it common decency.<br />\nmost Parliament live their miniature lives. gives Bob Fuller the dignity of an<br />\nsion of student opinion, the athletic<br />\nThe New Deal represents the first Randolph Hearst is Landon's<br />\n* * *<br />\nLandon<br />\nAnd<br />\ninward conviction and he inexorably<br />\nsupporter.<br />\nconspicuous<br />\nfor<br />\nplans<br />\nlay<br />\nto<br />\ndepartment began<br />\nDistributors of<br />\nattempt of an enlightened liberalism<br />\ndepartment informs pursues it.<br />\nstatistics<br />\nOur<br />\nrich<br />\nthe<br />\nRoosevelt,<br />\nunder<br />\nthat,<br />\nsays<br />\nwas<br />\natThe<br />\nthese<br />\nschedule<br />\nproblems.<br />\nwith<br />\nto deal<br />\nthe future. A five-game<br />\nare en—Sigmund Diamond<br />\ngrow richer and the poor grow poorer. us that about 650 colleges<br />\nworked out for the '35 season, a tempt has often been a faltering one,<br />\ncomgridiron<br />\nvarsity<br />\nin<br />\ngaged<br />\nactive<br />\nas<br />\nstatement<br />\nastounding<br />\nthis<br />\nsubmit<br />\nI<br />\nseven-game program for the follow- but, in any aspect, it is a thousand<br />\nNo, the facts petition, with 2,000 scheduled games<br />\ntimes better than What went before. needing no comment.<br />\ning year. The fine turnout for footline between and over 25,000 men participating.<br />\nthe<br />\ninescapable,<br />\ntoo<br />\nare<br />\nAnd that's why I'm still for Roose* * *<br />\nwisthe<br />\nproven<br />\nhas<br />\nseason<br />\ntoo clearthis<br />\nball<br />\nreactionary<br />\n(Continued from Page 1, Col. 3, 4)<br />\nvelt. We did not secure the blessings progressive and<br />\nA NEW KNOCK-KNOCK TALE<br />\nCoughlin - Townsend - Smith dom of the optimistic steps taken by of Utopia for ourselves and our pos- ly drawn.<br />\nThe<br />\ndetermined looking freshman<br />\nA<br />\nI spoke a while ago of \"a crisis<br />\nmovement is a phenomena of the the Athletic Department.<br />\nterity by his election in 1932, and we<br />\nslowly up to the fourth floor<br />\nplodded<br />\nA good motto suggested for this<br />\ngreatest importance and it must not<br />\nAt the time of this writing there will hardly secure them this time. in world democracy.\" By the time of Gilman Hall, gave a faint recollec- column is \"Duce goes around and<br />\nlibthe<br />\nconcerted<br />\nprint,<br />\nin<br />\na<br />\nAs<br />\nappear<br />\nwill and have had is a pro- these words<br />\nbe underestimated.<br />\nare more than sixty-five men out for What we<br />\ntion of a Thank-God-forgotten fad as around, and it comes out here\". Howmovement —radical of method and<br />\nressively liberal government, recog- eral popular government of Spain—<br />\n... and walked ever, greetings to all of youse guys<br />\nhe knocked on the door.<br />\nexpected.<br />\nstill<br />\nthe team with ten more<br />\nnizing and in some measure facing our Which Mr. Hamilton calls \"Communof speech—it is being used to direct<br />\nmilitaristic air new at the Hopkins, and may you get<br />\na<br />\nWith<br />\noffice.<br />\nthe<br />\nin<br />\nthe<br />\nprsent problems. And that, in a ma- ist\"--may have fallen before the comvotes into the Landon Camp. It is at- Such spirit certainly deserves<br />\nthis<br />\nfrom<br />\nof an R.O.T.C. neophyte, he inquired, indigestion<br />\nreading<br />\nthe<br />\nof<br />\ntempting to play up the false issue of backing and encouragement<br />\njor crisis of world democracy, is about bined onslaught of the Fascist pow\"What uniform must I have for this column . .<br />\ners. The inevitable capitulation of<br />\ncommunism versus capitalism. It is student body. We feel sure it will be the best we can reasonably expect.<br />\ncourse\"? Came the quick reply, \"You Two of our prominent seniors are<br />\nPeople are constantly telling me Madrid will leave England and France<br />\ntrying to prove that progressivism is a team worth supporting.<br />\ndon't need a darn one to take fresh- still blushing 'midst their contempormajor democratically<br />\nabout the \"purge\" of the Republican as the only<br />\nreaction by some of the most blatant<br />\nman history\"!<br />\naries after having their photographs<br />\nparty. The Old Guard, hitherto unrec- constituted nations in Europe.<br />\n*<br />\ndemagoguery in American history, by<br />\n*<br />\n*<br />\nplastered on the back page of a promvictory<br />\nclear-cut<br />\nand<br />\nAt such a time a<br />\nognized, was, according to their acempty promises of Impractical<br />\nAnd now a communication from inent Baltimore paper under the<br />\ncount off its collective feet and carried over the forces that make for reac- our illustrious predecessor, whom we heading \"Freshmen All\"! ! ! We wish<br />\nimpracticable proposals.<br />\naway by a new (Republican) liberal- tion in America will be of incalculable found behind a desk and a moustache: Monsieurs Davis and Raine a<br />\nThis group is the greatest obstacle<br />\npleasant<br />\nThe decision of the authorities to<br />\neneven<br />\nhas<br />\nliberties<br />\nism, nurtured and brought to flower importance. The repudiation of these<br />\nAmerican oil<br />\nWhile quietly walking tending my four more years here . . .<br />\nthe<br />\nfrom<br />\naid<br />\nfinancial<br />\nbe<br />\nin Topeka and personified in the men and their philosophy cannot<br />\ncountered. It is fascism pure and sim- withdraw<br />\nown affairs, rejoicing in solitude, one,<br />\nEmbarassing Moments<br />\ntoo overwhelming. I am hoping with Stanley Finkel, worthy NEWS-LETTER<br />\nple. It is exactly parallel to the rise Hullabaloo comes as no surprise to sturdy figure of Alf Landon.<br />\nWhen the slightly tipsy but beautiThe Kansas gang seems to have all my heart for that repudiation. As slave, approached me from nowhere— ful blonde approached me wagging<br />\nof German and Italian fascism.<br />\nthose who have watched the UniversiMr. Landon is a shell--and a poor ty in its forced retrenchment during turned an ordinary Republican wake one who calls himself a liberal, I as good news hounds should.,--and re- her graceful finger at my carefully<br />\ninto a colossal evangelical orgy, be- couldn't hope for anything else.<br />\none at that—a sheep's clothing for<br />\nquested my obituary;\"a brief account groomed hair saying, \"Oh look! The<br />\nthe past three years. The only wonder,<br />\nHearst and fascism. He is the Ameriof the life of a recently deceased per- Glory That Was Greece\" . . .<br />\nthat it did not happen<br />\ncan Lorelei. He must be judged more perhaps, is<br />\nson.\" I hadn't time to demur; however;<br />\nCollegiate Comment<br />\nby what he does not say and by his earlier.<br />\nA lazy man is a guy who marries<br />\nthose who knew me delighted in unuendoes than by his record. And<br />\nAs a matter of fact, the cutting off<br />\nearthing my innermost secrets, and a widow with five children .. .<br />\nis record, certainly, is no model of of appropriations from the Student<br />\nLocal Color<br />\nthose to whom I am a stranger would<br />\nberal action.<br />\nfancies. However and this is the rub not benefit by the acquaintanceship—<br />\nA comely colored girl had just been<br />\n(By Associated Collegiate Press)<br />\nActivities Committee is no little boon<br />\nt is a commonplace to associate<br />\nWould you believe it? Here we --the committee of judges at a liar's therefore, no obituary, but my WILL: baptized in the river. As she came to<br />\nof the yearbook. Of late<br />\nLiberty League and Mr. Hearst to the staff<br />\npreserver- the surface, she cried, \"Bless de Lawd,<br />\nliterary lights had contest staged at the University of —To the Frosh, courage,<br />\neconomic slavery and dictator- the appropriations have been so small thought that the<br />\nI'se saved. Las' nite I was in the<br />\nsince, and a good dictionary.<br />\nthe<br />\nare<br />\nof<br />\nblown out of sports. Bill Shakespeare California, conceding that women<br />\n). The suggestion, and the warning that the greatest problem<br />\n—To the Sophs, female senior high ahms of Satan, but tonite Ah'm in<br />\nthat they form as well the threat Hullabaloo editor has been the reduc- graduated from Notre Dame, and superior in this sinful art, refused<br />\ndates who would rather love than de ahms of de Lawd.\"<br />\nolitical slavery is often pooh- tion of his original plans. Placing the Henry Wadsworth Longfellow left to let the questionably fairer sex<br />\n\"Sistuh,\" came a baritone voice<br />\neat.<br />\ned. The NEWS-LETTER believes book on a subscription basis will defithe opportunity of competing --To the Juniors, a full day's work, from the shore, \"how is you fixed for<br />\nhave<br />\n\"The<br />\nNow<br />\nno.<br />\nBut<br />\nNorthwestern.<br />\nthese men do compose a tangible nitely serve to provide a better book:<br />\nand the sophisticated date who ap- tomorra ebening?\"<br />\nLast of the Mohicans\", James Feni- against the men. Now they have their<br />\nt to the American tradition of not only because of the increased inpreciates finesse and necks only in<br />\nthe<br />\n\"lie-ing-sun\".<br />\nin<br />\nown<br />\nplace<br />\nMarat<br />\nmore Cooper has popped up<br />\ndom, in short, that they are the come for the Hullabaloo, but also<br />\nHIX AND HOPKINS<br />\nthe dark.<br />\nif<br />\ntimes<br />\na<br />\nit<br />\nhundred<br />\nheard<br />\nYou've<br />\nU.<br />\nquette<br />\nearly<br />\nknow<br />\nbecause the managers will<br />\nerican apostles of fascism.<br />\nin his syndicated coluian,<br />\nHix,<br />\n\"EyeJohn<br />\nleisure,<br />\nmuch<br />\nseniors,<br />\ntho<br />\n--To<br />\n*<br />\n*<br />\n*<br />\nin<br />\nits<br />\nis<br />\nit<br />\nagain<br />\nhere<br />\nnot<br />\nbut<br />\nmore,<br />\nis not meant to imply by all this in the season just how they are to<br />\nGaza,\" \"Steps Going Down,\" Strange As It Seems, reported the<br />\nIn<br />\nless<br />\nBites<br />\n\"Boy<br />\nguise:<br />\nfall-model<br />\nnew<br />\nUniat<br />\nthe<br />\nstudents<br />\nthe<br />\nof<br />\nSome<br />\ngo<br />\nt Mr. Landon is himself a fascist. stand financially and can thus<br />\ndisinclination toward women, and J. H. U.'s possession of the Polygot<br />\nad- versity of Kentucky go to great Beast!\"<br />\nadvocacy of a politico-economic ahead with their work and take<br />\nBible—printed in 1599 with twelve<br />\nmy summer in Massachusetts.<br />\ntrainstate<br />\nnear<br />\nthe<br />\nall<br />\nhappened<br />\nIt<br />\nImagine<br />\nan<br />\neducation.<br />\nlengths for<br />\ntorship not so many months ago vantage of discounts.<br />\ndifferent translating the text on each<br />\nKropman<br />\nM.<br />\n—Harold<br />\nWing, Minnesota<br />\nIt was unfortunate but inevitable covering 11,800 miles just to go to ing school of Red<br />\nbe put down as a frantic appeal<br />\npage.<br />\nMethuselaic<br />\nof<br />\nthe<br />\ndramatization<br />\nthis<br />\nthey<br />\nwould school. From China? India? No,<br />\ne protection of his oil interests. that undergraduate activities<br />\nFor the new man here as well as<br />\ngag.<br />\n\"man-bite-dog\"<br />\nthe<br />\nfrom<br />\nmiles<br />\nodd<br />\n30<br />\nabout<br />\nlive<br />\nonly<br />\nsufgeneral<br />\nLandon is putty, soft, formless have to participate in the<br />\nWe think that the new hats(?)<br />\nRay Billy gave rookie Journalism the old let us hasten to recommend<br />\nthe campus, but they commute daily.<br />\nthe hands of Mr. Hearst and of fering of the University during<br />\nour fair city's best worn by the fairer (to say \"weaker\",<br />\nof<br />\none<br />\nyou<br />\nas<br />\nto<br />\nhe<br />\nwhen<br />\nversion<br />\nthe<br />\nlatest<br />\ninstructors<br />\nhe<br />\nthat<br />\nfigures<br />\nfellows<br />\nthe<br />\nof<br />\nOne<br />\nnothiberty League. The alliance of past few years. There is little or<br />\nthe Bubble Room at the we feel would be ambiguous) sex<br />\npraying burns approximately 785 gallons of tried to capture a liberty-loving weas- dance places<br />\ngroups with fascism is familiar ing that can be done beyond<br />\nHotel. This popular make them conceited—with all those<br />\nBaltimore<br />\nLord<br />\nsimdo<br />\nin<br />\nwill<br />\nweasels<br />\nall<br />\ngoot<br />\nAs<br />\nel.<br />\nwhich<br />\nyear,<br />\nschool<br />\nthe<br />\nin its fi- gas during<br />\n1. The aid given by them directly that the University succeed<br />\nJohnny Johnson feathers in their caps. Not to mention<br />\nfeaturing<br />\nnow<br />\nis<br />\nroom<br />\nquite evident, amounts to . . . let's see . . . maybe ilar circumstances, this one wrapped<br />\ne fascist nations of Europe—in nancial campaigns. It is<br />\nheard on the the barriers to dancing and romance<br />\nnow<br />\nhis<br />\norchestra,<br />\nand<br />\nhand.<br />\nright<br />\nBilly's<br />\naround<br />\nmouth<br />\nits<br />\nyourself.<br />\nthe Hullabaloo you'd better figure it out for<br />\nform of credit, munitions, and in the meantime, that<br />\nentire fall they create. It used to be that your girl<br />\nthe<br />\nfor<br />\nprogram,<br />\nTastyeast<br />\n* * *<br />\nWhen the \"fur-fang\" showed mule<br />\nthe management<br />\nble newspaper publicity—is of Is in a spot. So far as<br />\nfrom would make eyes at the other fellows;<br />\nreturned<br />\njust<br />\nhas<br />\nJohnny<br />\nseason.<br />\nloose,<br />\npried<br />\nbe<br />\nto<br />\nrefusing<br />\nMaiden-Munchausens are in a class tendencies,<br />\ndone everything<br />\n✓ importance when compared of the yearbook has<br />\nsuccesses at the Hotel now she takes his eyes—out, with<br />\nsensational<br />\nstrong<br />\nhis<br />\nwith<br />\nhard<br />\nhim<br />\nbit<br />\nBilly<br />\nhad<br />\nwe<br />\nhere<br />\nAnd<br />\nthemselves.<br />\nby<br />\nin<br />\nup for the lack<br />\nthe similarity in argument and possible to make<br />\nCommodore in New York and the New those protruding feathers.<br />\nThey deserve the aid of thought all along that men were the teeth until the animal passed out.<br />\nd of American and European resources.<br />\nOh well, feather your own jest!<br />\nHotel in New Jersey.<br />\nMonmouth<br />\nyou,<br />\nsir!<br />\nto<br />\nhat<br />\nits<br />\ndoffs<br />\nJournalism<br />\nand<br />\nfables<br />\nof<br />\ngreatest fabricators<br />\nthe entire student body.<br />\ns and ultra-nationalists.<br />\nand therefore an incubator of fascism.<br />\nThe issue of 1936 is not a struggle<br /><br />\nOne Sure Thing<br /><br />\n!Associated Colletsiate Press<br /><br />\nColleeiate Dieest<br /><br />\nHalf-Wit And<br />\nWisdom<br /><br />\nEditorial<br /><br />\nToo Bad But<br /><br />\nTHIS COLLEGIATE WORLD<br /><br />\n.1:<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 6, 1936<br /><br />\na<br /><br />\n(1<br /><br />\nLarge Social<br />\nSport Program<br />\nFor Dorm Men<br /><br />\nStars At Fords<br /><br />\nThe Intrafraternity Board has an-<br /><br />\n4<br /><br />\nEighty Prospective Engineers<br />\nStart Training In Varied<br />\nFields<br /><br />\nProctors Aid Group<br />\nProfs To Deliver Series Of<br />\nInformal Talks To<br />\nResidents<br />\n—Courtesy News-Post<br />\nIna<br /><br />\nClaire<br /><br />\noperation of the Peabody Institute<br /><br />\nSummer's End<br /><br />\nBaltimore's theatrical season swings<br />\nand jurisdiction of Ed Lotz, member into its height, when the New York<br />\nof the athletic department of The Theatre Guild brings its production of<br />\nUniversity. The program will consist End of Summer to the Ford's for a<br />\nof all forms of team and individual three day's engagement. With Ina<br />\nplay in their respective seasons. Suit- Claire and Osgood Perkins in the leadable awards will be given to winning ing roles, one of last season's most<br />\nsophisticated comedies will present<br />\nteams and persons.<br />\nA group of over fifteen chess play- the first of four performances Thursers have been organized for the pur- day evening, October 8.<br />\nEnd of Summer was a pronounced<br />\npose of mutual enjoyment of the game<br />\nand the discovery of the dormitory hit in New York last season. It was<br />\nchess champion. Dormitory dances written for Ina Claire by S. N. Behrare also being planned, and will be man, author of Biograph, in Which<br />\nin Baltimore two<br />\nheld if sufficient support can be guar- Miss Claire starred<br />\nyears ago. Behrman also wrote Rain<br />\nresidents.<br />\nanteed by the<br />\nFrom Heaven and The Second Man.<br />\nSummed up by Charles Squires,<br />\nPhilip Moeller, well-known director<br />\nproctor, \"The Committee is an excel- of numerous Theatre Guild performlent move in that it stimulates the ances, is responsible for End of Suman<br />\ntype of college life that we want here mer. The play is described as<br />\nAmerican comedy, the scenes of which<br />\nat Hopkins!\"<br />\nare laid in the summer home of a<br />\nwealthy, attractive, and much-spoiled<br />\nsociety matron whose current amusement is a friendship with a polished<br />\npsychoanalyst.<br /><br />\nDr. Mitchell Acts<br />\nAs Toastmaster<br />\nv1/47- •<br /><br />\nMayor Hoan Of Milwaukee Debating Team To<br />\nGuest Of Honor At<br />\nReorganize Squad<br />\nBanquest<br /><br />\nREMSEN CLUB TI:214EET<br />\nThe Remsen Chemical Society will<br />\nhold the first meeting of the 1936-'37<br />\nseason Thursday afternoon at 4:00<br />\no'clock in Room 221, Remsen Hall.<br />\nThis meeting will be occupied with<br />\nthe discussion several problems, very<br />\nimportant to the organization. It is<br />\nurged that all memebrs be present.<br />\nLOST!<br />\nOrange Parker Duofold<br />\nPlease Return To<br /><br />\nPHIL HAMBLETON<br />\nRowland 109<br />\nReward<br /><br />\nthat Freshmen may be entertained at<br />\nfraternity houses. This year the Intrafraternity Board and The Student<br />\nCouncil and Dean Berry are cooperat-<br /><br />\ning to make the Intrafraternity RushAt the first meeting of the General<br />\ning<br />\nRules more stringent.<br />\nEngineering class last Wednesday<br />\nJohn Ghinger of Phi Gamma Delta,<br />\nthere were some eighty aspirant engi- has been elected Secretary-Treasurer<br />\nneers, representing the entering class of the Intrafraternity Board, succeedin all the various Engineering Schools. ing Bernie Vincent.<br />\nThe following dates are open house<br />\nThe course, which is conducted by the<br />\ndates<br />\nfor the fraternities mentioned:<br />\nfaculties of the several departments,<br />\nFriday, October 16, Beta Theta Pi<br />\nin the introductory course for those<br />\nwho have either some doubt as to and Alpha Chi Rho.<br /><br />\n(Continued from page 1, col. 6)<br />\nclrews, and he has offered the use<br />\nof his piano for the events. The co-<br /><br />\nDr. Broadus Mitchell, Associate Professor of Political Economy at the<br />\nJohns Hopkins University, acted as<br />\ntoastmaster at a gathering of the<br />\nSocialist Party of Baltimore last Wednesday night when Mayor Daniel W.<br />\nHoan, Socialist Mayor of Milwaukee,<br />\nspoke.<br />\n\"The most interesting development<br />\nof the meeting,\" said Dr. Mitchell, was<br />\nthat there were a good number of nonSocialists there who were interested<br />\nin Mayor Hoan's administrative<br />\nsuccess\".<br />\nMayor Hoan has lowered the debt of<br />\nMilwaukee by investing the city's<br />\nmoney in United States Government<br />\nBonds at an interest rate of 5 per<br />\ncent. This rate, much above that of<br />\ncommercial banks, has given the city<br />\nenough surplus to partially reduce the<br />\ncity deficit, and at the present rate<br />\nthis deficit will completely be wiped<br />\nout within seven years.<br /><br />\nxford,England<br />\nymA/<br /><br />\nfraternities. These are the only dates<br /><br />\n41.80<br />\n.11tVo<br /><br />\nA wide and diversified athletic program is under the general supervision<br /><br />\nLarge Freshman Open House Dates Dr. D. M. Robinson Dr. Jennings<br />\nEnrollment For Released By Board Returns After Returns From<br />\nEuropean journey<br />\nEngineering Classes<br />\nnounced open house dates for the<br /><br />\n/ Musicales, Dances, Tournaments To Feature Plans<br />\nAnnounced By Pinck<br /><br />\nmay be obtained.<br />\nAthletic Program<br /><br />\n3<br /><br />\nPlans Southen Trip During<br />\nSpring Vacation<br />\nAs the curtain rises for another<br />\nyear of activities on the Hopkins campus, the debating team under the<br />\nleadership of Mr. Earl Reeves Wasserman hopes to enjoy as successful a<br />\nseason this year as they have enjoyed<br />\nin previous years. The debating team<br />\ncaptain, Mr. Phillip Grosman, delivered an explanatory address before<br />\nthe freshmen and sophomores telling<br />\nof the advantages and pleasures which<br />\nprospective members of the team may<br />\nenjoy.<br />\nThe debating team will have a private meeting of all members of last<br />\nyears squad ths week. A notice will<br />\nlater e printed in The NEWS-LETTER<br />\nencouraging prospective members to<br />\ntry out. The team wishes that the student body will cooperate with them in<br />\nforming a strong team and in providing a fairly large audience for each<br />\ndebate.<br /><br />\n1936 Cecil B. Rhodes<br />\nScholarship Now Open<br />\nCompetition for the 1936 Rhodes<br />\nScholarships assigned to the United<br />\nStates has been opened by the Committee of Selection, it was announced<br />\nby the Dean's office last week. These<br />\nscholarships, providing for two years<br />\nstudy at the University of Oxford,<br />\nwere provided by the will of the late<br />\nCecil ohn Rhodes. Thirty-two appointments, of value of four hundred<br />\npounds a year each, are available to<br />\nAmerican students between the ages<br />\nof nineteen and twenty-five, who are<br />\nunmarried and have completed at<br />\nleast their Sophomore year..<br /><br />\ntheir ultimate field of studies, or who<br />\nMonday, October 19, Phi Kappa Psi<br />\nare to be familiarized with the sort and Kappa Sigma.<br />\nof work demanded of the men of the<br />\nTuesday, October 20, Delta Phi and<br />\nvarious parts of the Engineering pro- Sigma Phi Epsilon.<br />\nfession; the Civil, Mechanical, Gas,<br />\nWed*esday, October 21, Phi Gamma<br />\nElectrical, and Chemical divisions.<br />\nDelta and Kappa Alpha.<br />\nThe School of Mechanical EngineerThursday, October 22, Delta Upsilon<br />\ning received the largest enlistment,<br />\nand Tau Alpha Phi.<br />\ntwenty-two students. This is always<br />\nFriday, October 23, Alpha Delta Phi<br />\none of the most popular branches, due<br />\nand Alpha Tu Omeg.<br />\nin no small measure to the efficiency<br />\nAfter Oct. 15, Thursdays from 8 to<br />\nof the manner in which some phases<br />\n10 p. m. and Saturdays from 3 to 5<br />\nof Mechanical Engineering art taught<br />\np. m. will be open house dates for all<br />\nat the Baltimore Polytechnic Institute,<br />\nthe aforementioned<br />\nthe high school which has the most fraternities, but<br />\nscheduled<br />\nfor the open house<br />\ndates<br />\nare<br />\nalumni at the Johns Hopkins College<br />\nparties.<br />\nof Engineering.<br />\nAs a close second was Chemical<br />\nEngineering, with nineteen students,<br />\nan increase of almost 100 per cent over Rev. Clinchy To Speak<br />\nlast year. This growth may be well<br />\nAt Thursday Assembly<br />\nattributed to the increased publicity<br />\nand opportunity in the field of EnginSpeaker Represents Emergency<br />\neering Chemistry. This is a new<br />\nPeace Campaign<br />\ncourse at the University, one which<br />\nidentically parallels for the first three<br />\nDr. Russell Clinchy, Minister of the<br />\nyears the work in Gas Enginering, an Mount<br />\nCongregational<br />\nPleasant<br />\nolder established course. Therefore, Church in Washington, D. C. will be<br />\nthere has been no formal instruction the speaker at the Thursday Assembly,<br />\nin this branch as yet, although it is held under the sponsorship of the<br />\nexpected that as new equipment is Johns Hopkins YMCA. This meeting<br />\nmade possible, the two will be sep- will be the first in a series sponsored<br />\narated within the next two years. by the Emergency Peace Campaign<br />\nThis new branch of Chemical study tnrough the YMCA's on various<br />\npromises to add to the record of the campuses.<br />\nmen trained at the Hopkins, which<br />\nA graduate of Drew Seminary, Dr.<br />\nstands as one of the finest in the Clinchy has been known for many<br />\ncountry.<br />\nyears throughout as a liberal<br />\nThe other branches of engineering religious leader, interested in all phasaccounted for the remained of the stu- es of social welfare. He is a director of<br />\ndents as follows; Electrical, fifteen;<br />\nCivil, ten and Gas, four. Besides these,<br />\nare those who are taking the combination courses, with work in either<br />\nthe Arts and Science group or in the<br />\nBusiness School along with the Engineering, and those in the graduate<br />\nschool.<br /><br />\nfamed humanist, Erasmus, who was<br />\nthe first professor of Greek at King's<br />\nCollege more than three hundred<br />\nyears ago.<br />\nA tour of Ireland, where Dr. Robinson stopped at the Lakes of Kilarney,<br />\nthe Giant's Causeway, Belfast, and<br />\nDublin, and then took time to kiss the<br />\nBlarney Stone, ended his junket. Before leaving Ireland, however, he<br />\nspent some time visiting the archaeological ruins at Tara.<br />\nDr. Robinson, before his departure<br />\nfor Europe, published his latest book,<br />\nPindar, A Poet of Eternal Ideas and<br />\nhand published in The Art Bulletin an<br />\narticle concerning the discovery of<br />\nan ancient Greek statue.<br /><br />\nSweet<br /><br />\nas<br />\nHoney<br /><br />\nT<br />\nhoney ip<br />\nthe brio?<br />\nkeeps the pipe'<br />\nsweet.<br />\nHigh-efficiency<br />\nCondensor cleans,putif1•11<br />\nsmoke.Traps moisture. No clog.;<br />\nsing.No trouble. Prove ityourseak<br /><br />\nthe American Peace Society, the<br />\nAmerican Council for Prevention of<br />\nWar and of the Middle Atlantic Council of Congregational Ministers<br /><br />\nAt Your Dealer\"<br /><br />\nMUSIC<br />\nASSOCIATION<br />\nHOLDS FIRST MEETING<br />\nThe first meeting of the Johns<br />\nHopkins Musical Association, which<br />\nsupports the Johns Hopkins Orchestra,<br />\nwill be held in the main hall of the<br />\nPeabody Institute, at 8 P. M. on<br />\nTuesday, October sixth. All members<br />\nof the University who find interest in<br />\nmusic are invited to join. The first<br />\nrehearsal is scheduled for the same<br />\nevening.<br />\nInformation is to be made available<br />\nbefore the first rehearsal, and may<br />\nbe obtained from Mr. Philip S. Morgan, 514 St. Paul Street. Phone Vernon<br />\n6906.<br /><br />\nPipes<br /><br />\nLW<br /><br />\nthan<br />\nactual<br />\n5t7e)<br /><br />\nMagazines<br /><br />\nTHE SPOT<br />\n3120 GREENMOUNT AVE.<br />\nNovelties<br /><br />\nTobaccos<br /><br />\nFor Your<br />\nLiquors<br /><br />\nSeeHARRY<br />\n3113 GAEENMOUNT AVE.<br />\nFor Delivery<br />\nPhone UN. 4883<br />\n----<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br /><br />\nBOULEVARD<br />\nHardware Co.<br /><br />\n2815 GREENMOUNT AVE.<br />\nCHesapeake 5474<br /><br />\nWhat you want is easy to find.<br /><br />\nHUTZLER BKITHEM IC)<br /><br />\nProfessor Herbert Spencer Jennings,<br />\nreturned to Baltimore, September 21, Henry Walters Professor of Zoology<br />\nafter a tour of Europe aboard the S.S. and Head of the Johns Hopkins University Zoology Department, has just<br />\nTransplvania.<br />\nreturned<br />\nfrom a year in England,<br />\nThe tour, which began July 30, when<br />\nwhere he held the George Eastman<br />\nDr. Robinson left the city aboard the<br />\nVisiting Professorship at Oxford.<br />\nS.S. City of Baltimore, carried him<br />\nWhile there, Dr. Jennings directed<br />\nthrough France, Belgium, Holland, research of the students and gave<br />\nlectures on the topics: \"Behavior of<br />\nand Ireland.<br />\nLower Organisms\", \"Genetics of ProIn Belgium, the scientist visited a<br />\ntozoa\", and \"The Relation of Endonew museum which is in the course<br />\nmexis to Vitality in Parameceum<br />\nof erection and came away with the Aurelia\".<br />\nimpression that that small nation is<br />\nHe was official delegate of the<br />\nenjoying a thriving economic secur- American Association for Advancement of Science at the British Associity which is not evident in France.<br />\nation for Advancement of Science<br />\nFrom Belgium, Dr. Robinson trav- Meetings<br />\nheld last fall at Norwich,<br />\neled to Holland, but remained only a England. At the Thirteenth Internashort time because of the exorbitant tional Congress of Zoology, held at<br />\nLisbon, he was the official delegate<br />\nprices.<br />\nof the United States, and of The Johns<br />\nThe next country visited was EngHopkins University. He was made a<br />\nland, where he spent short periods at<br />\nFellow of Balliol College at Oxford,<br />\nthe great university towns, Oxford and received an honorary Master's<br />\nand Cambridge. It was at the latter Degree from that College.<br />\nDr. Jenning's latest book, Genetics,<br />\ncity that he occupied the room which<br />\nwas<br />\npublished last year in England.<br />\nthe<br />\nhad once been the residence of<br /><br />\nGet the Pen That Never Runs Dry in Classes or Exams<br /><br />\nSpecial Prices For Hopkins Men<br /><br />\nPrices are reasonable.<br /><br />\nfamous Johns Hopkins archaeonlogist,<br /><br />\nFOR HIGHER GRADES IN COLLEGE<br /><br />\nWillie Hugh Laundry<br /><br />\nYou get efficient service.<br /><br />\nProlonged Cruise Takes<br />\nHopkins Archaeologist Held George Eastman ProThrough Western Europe<br />\nfessorship In Biology<br />\nDepartment<br />\nDr. David Moore Robinson, world<br /><br />\n432 E. 42ND STREET<br /><br />\nThe All-American College Favorite<br />\nWith Double Ink Capacity and<br />\nFull-length Visible Ink Supply<br />\nShows DAYS AHEAD When It's<br />\nRunning Low<br />\nDo the thing that you know is the<br />\nthing to do—replace your old-style<br />\npen with this miracle Vacumatic—<br />\nParker's revolutionary invention<br />\nthat holds 102% more ink WITHOUT INCREASE IN SIZE—that<br />\nshows the ENTIRE ink supply, not<br />\nmerely the last drop—shows not<br />\nonly when your pen is empty, but<br />\nshows DAYS AHEAD when it's<br />\nrunning low, so it CAN'T run dry<br />\nagainst your will!<br /><br />\nUNiversity 0749<br />\nHouse Furnishings<br />\nHardware<br />\nPaints<br />\nElectrical Supplies<br /><br />\nA Full<br />\nSupply<br />\nOf<br />\nQuink<br /><br />\nToday the Parker Vacumatic is<br />\nthe world's long-distance writer and<br />\nStyle and Beauty Winner—the sacless marvel whose simple working<br />\nparts are sealed in the top—never<br />\ntouched by ink, hence won't corrode or fail. That's why it's GUARANTEED Mechanically Perfect.<br />\nIn the hands of millions of users,<br />\nusing all kinds of ink, this marvelous<br />\npen has repeatedly proved that it<br />\n\"can take it\" anywhere and any time<br />\n—it never leaves its owner gasping<br />\nfor ink in classes or exams.<br />\nIf you'll go and try its marvelous<br /><br />\nSCRATCH-PROOF Point of precious Platinum and Solid Gold, you'll<br />\ngive your old-style pen to the rummage sale. Look for the smart<br />\nARROW clip—this ARROW identifies the genuine. The Parker Pen<br />\nCo., Janesville, Wis.<br /><br />\naricer<br />\n..1 )<br />\n4 --1/ACUMATIC:111&gt;<br />\nGUARANTEED MECHANICALLY PERFECT<br /><br />\nJunior, $5<br />\nOver-Size, $10<br /><br />\nPencils, $2.50,<br />\n$3.50 and $5<br /><br />\nYour Nearest Dealer is<br /><br />\nKIBLER'S<br />\nJEWELERS and OPTICIANS<br />\n3222 GREENMOUNT AVENUE<br /><br />\nGet Your<br />\nJ. H. U.<br />\nRing Here<br /><br />\nHOMEVVOOD, BALTIMORE, MD., OCTOBER 6, 1936<br /><br />\n4<br /><br />\nHill And Dalers Well Organized<br />\nFootball Team BLACKAND<br />\nComplete Series Teams To Compete<br />\nStages Initial<br />\nBLUE<br />\nOf Warm-up Drills In Intramurals<br />\nTest Scrimmage Football Men<br />\nSquad To Use Homewood Football To Start Oct. 12 —<br />\nBy BERNARD I'INCK<br /><br />\nGridiron Squad Put Through<br />\nHard Fast Practice<br />\nSkirmish<br /><br />\nBlucher Injured<br />\nKahl,<br /><br />\nBaetjer<br />\nGreene,<br />\nStand Out As<br />\nKickers<br /><br />\nFor two hours Saturday in glorious football weather, the Blue Jay<br />\ngirkkiers engaged in a hard, fast<br />\nscrimmage. Actually, this was the<br />\nfirst real test the gridiron hopefuls<br />\nhave faced and it was of invaluable<br />\naid to the members of the coaching<br />\nstaff.<br />\nPlay was confined in the main to<br />\nstraight football. Off tackle slant, center plunges and sweeping end runs<br />\nwere employed consistently. However,<br />\non certain occasions, cleverly conceived laterals and forward passes<br />\nwere brought into play.<br />\nAction For All<br />\nEvery uniformed candidate saw<br />\naction in this make-believe contest.<br />\nSeveral individuals brought to light<br />\ntheir football potentialities; while<br />\nothers aptly illustrated their apparent flaws.<br />\nFortified with a charging aggressive<br />\nline, the first string backfield turned<br />\nin a creditable exhibition. Driving low<br />\nand fast, blocking briskly, they reeled<br />\noff a number of long gains on the batling second eleven.<br />\nKicking Good<br />\nIn at. least one department, the Blue<br />\nJay huskies won't be outclassed,<br />\ntwo<br />\nwith<br />\nEquipped<br />\nkickin.<br />\nmen, Kahl and Greene, whose long,<br />\nhigh spirals carry far down the<br />\nfield, the Jays should hold their own<br />\nagainst the best punters of the opposition. For gaining point after<br />\ntouchdowns, the Jays have Baetjer,<br />\nwhose accurate place-kicking would<br />\nfulfill the dreams of any gridiron<br /><br />\nPractice Daily<br />\nAs the curtain rises on the current<br />\nfootball season, some 59 candidates<br />\nare putting in daily appearances at<br />\nthe practice field. Striving fervently<br />\nto acquire coveted varsity berths the<br />\nfootball hopefuls are doing their utmost to favorably impress the high<br />\nand mighty coaching staff. The sight<br />\nof footballs spiralling through the<br />\nair, the thud of bodies hitting the<br />\nturf, the shrieking exhortations of<br />\ncoaches all present testimony that<br />\nthe active organization of a Blue<br />\nJay eleven is under way at Homewood<br />\nField.<br />\nBlessed with a plethora of good material, Coach Manonce is hopeful of<br />\nturning out one of the strongest<br />\nHopkins teams of recent years.<br />\nThe return of a number of veteran<br />\nbacks, led by Captain Ted Graziano,<br />\nand the appearance of several new<br />\npromising candidates presage a versatile and capable backfield. As for the<br />\nline, Ed Lotz, line coach, does not feel<br />\nthe slightest doubt concerning the<br />\npotentialities of his charges.<br /><br />\nAttractive Card<br />\nArranged<br />\nA rapid glance at the 1936 schedule reveals that games have been arranged with teams of approximately<br />\nthe same calibre and strength as the<br />\nHopkins aggregation. High pressure<br />\nelevens, suspected of being subsidized<br />\nhave been dropped from the list of<br />\nBlue Jay opponents. The reasons for<br />\nthis action are obvious. The Malonee<br />\nsquad does not seek to march through<br />\na victorious season by season of a<br />\nschedule of set-ups. But certainly the<br /><br />\nCourse — Moxley,<br />\nCastelle Drop<br /><br />\nLast Year's Strongest<br />\nTeams Return<br /><br />\nAfter a week's practice of limberThe first intramural football game<br />\ning up exercises, the Blue Jay harriers of this year will be played on Monday,<br />\nare rounding up into what may prove October 12. This will inaugurate the<br />\nto<br /><br />\nbe a formidable<br /><br />\ncross-country<br /><br />\nteam. Within a few days the hill and<br />\ndalers will swing out over the gruelling 4/2 mile Homewood course, which<br />\nwinds its way over the many hills of<br />\nWyman Park and finally ends, where<br />\nit started, on the Hopkins cinder<br />\npath.<br />\nA bit of a blow was sustained when<br />\nCastelle, who was recently operated<br />\non, and Moxley announced that they<br />\nwill be unable to take part this season.<br />\nCoach Waldo Hambleton is endeavoring to replace these two men who<br />\nwere consistent point getters from a<br />\nlarge squad of new men. At present<br />\nthe following have reported for equipment: Captain Sholtes, Brown, Briscoe, Lyman, Warminski, Driscoll, Jacobs, Lloyd, Lamb, Lefstein, Mace,<br />\nMlacht, Lewis, Norton, Scharpf, Rasin,<br />\nRosenthal, Rubinger, and Zheutlin.<br />\nManager Needed<br />\nManager Saul stated that there are<br />\nopenings for Freshmen and Sophomores who wish to become managers.<br />\nAnyone interested in seeking the job<br />\nmay report at the gym any afternoon<br />\nafter 4 o'clock.<br />\nstudents team of Hopkins cannot hope<br />\nto derive any pleasure or physical<br />\nbenefit by serving as tackling dummies for teams too vastly superior<br />\nIn strength and playing ability.<br /><br />\nthird<br /><br />\nyear of intramurals at the<br /><br />\nHopkins.<br />\nThe teams which will participate<br />\nthis year are all definitely organized,<br />\nall of them, except the freshman<br />\nteams, being carried over from last<br />\nyear. Both teams which tied for first<br />\nplace last year, namely the SeniorGas-Civils, captained this year by<br />\nWeisman, and the Senior Business,<br />\ncaptained by Reynolds, will participate again this year. The New Jersey<br />\nAll-Stars, led by Carl Resin and Harold Zheutlin, who took second place<br />\nlast year, is determined to win the<br />\nmedals this year. This team was<br />\nthe medalist in basketball and runner<br />\nup in baseball last year, losing first<br />\nplace in baseball to the Senior Dorms.<br />\nStrong Clubs<br />\nOther strong teams which will also<br />\nstrive for victory are the Senior Mechanicals led •by Gallowey, the Senior<br />\nElectricals led by Dicker, the Junior<br />\nAll-Stars led by Josh Perman, and the<br />\nSenior Businessmen led by Reynolds<br />\nand Geraldsienis. The freshmen teams<br />\nare still dark horses but are expected<br />\nto provide plenty of competition for<br />\nthe upperclassmen.<br />\nBaer Expects Much<br />\nReuben Baer who expects to make<br />\nthis his banner year as director of<br />\nthe intramural competitions, promises very good equipment for all.<br /><br />\nSport Light<br />\nOur new backfield coach—dear al'<br />\n\"Wats,\" that's him . . . Experienced<br />\nan active scholastic athletic career at<br />\nPoly—football, baseball, and track .. .<br />\nGraduated in '25 .. . Entered Hopkins<br />\nto establish a name for himself on<br />\nthe gridiron and track . . . Played<br />\nat \"half\" and full for three years as<br />\nan excellent left handed passing and<br />\nblocking back . . . On the cinderpath<br />\nWats ran a fine \"100\" and \"220\" . . .<br />\nReceived sheepskin as a full fledged<br />\nengineer in '28—a three year man ...<br />\nWats and \"Mal\" Gardner \"do or<br />\ndied\" for dear old Johnny Hopkins on<br />\nthe same team during '26, 27, and '28<br />\n. . . Both hold the distinction the first<br />\nand last Hopkins team to beat Maryland since 1915 (score 14-13) . ..<br />\nPrevious to his recent appointment<br />\nas backfield coach at Homewood,<br />\nWats tutered the Boy's Latin Gridders . . . His warm reception is indicative how our boys took to Wats<br />\n—just like a duck tages to water. . .<br />\nLet's take our hats off to Wats—<br />\na peachy guy.<br /><br />\nIn their first hard scrimmage of the<br />\nseason, the junior varsity soccer team<br />\ndropped a close 3 to 1 decision to a<br />\nvisiting Kenwood High School Varsity. The skirmish provided Coach<br />\nDotterweich an ample opportunity to<br />\nview the merits of all the newcomers<br />\nout for the varsity squad.<br />\nNeither of the aggregations produced any me soccer, but after only<br />\nseveral days of drilling, this was to<br />\nbe expected. However, Coach Dotterweich appeared well satisfied.<br /><br />\non<br /><br />\nSaturday.<br /><br />\nCoach<br /><br />\nDotterweich<br /><br />\ndon fundamentals and really settle<br />\non defensive work, and sharpening<br />\nshooting eyes. The line up is still very<br />\nindefinite and all candidates are being<br />\ngiven an opportunity to exhibit their<br />\nwares and to make the first team.<br /><br />\n\"Do me a favor, dad.<br />\nget my suit at Jos.<br />\nSchloss &amp; Son. It<br />\nwon't cost any more,<br />\nand it will look betand lust longer.<br />\nter<br />\n'<br />\nThe best-dressed fellows at school wear<br />\nSchloss clothes.\"<br />\nI said the very same<br />\nthing to my dad when<br />\nI was your age, and<br />\nhe told me he had<br />\nsaid the same thing<br />\nto his dad. For 81<br />\nyears, Jos. Schloss &amp;<br />\nMon have kept a step<br />\nahead in style. They're<br />\nOldest<br />\n\"Baltimore's<br />\nCustom-Tailors with<br />\nthe Newest Ideas.\" \"All right. It's a<br />\ngo!\"<br /><br />\nReady to Wear Suits of<br />\nRecognized Quality<br />\nfrom $35<br /><br />\nJos. Schloss &amp; Son<br />\n5 East Lexington St.<br />\n(Nowhere Else)<br /><br />\nYou who go in for sports... and you who<br />\ndon't... you both have reason to treat yourselves well...to reach for a light smoke... a<br />\nLucky. For a light smoke is gentle with you.<br />\nEasy on you when you inhale. Kind to your<br />\nthroat. And since your Lucky . . . a light<br />\nsmoke ... is made from the choicest center-leaf<br />\ntobacco, it tastes good, too, even when you<br />\nsmoke all day long. So, for a smoke that<br />\ntreats you right it's wise to reach for a Lucky.<br />\nAnd remember, the protection of the famous<br />\n\"Toasting\" process is enjoyed only by those<br />\nwho smoke Luckies.<br /><br />\n\"SWEEPSTAKES\" RASH!<br />\n17)<br /><br />\nFRESH AIR—EXERCISE<br />\n—SUNSHINE<br />\n—and a light smoke!<br /><br />\n-.-there's<br /><br />\nYouwholiketotakecare<br />\nof yourselves, but who<br />\nlove life's pleasures,<br />\na cigatoo<br />\nrette just made for you.<br />\nA smoke of fine richtasting tobacco—but<br />\ngentle with you, too.<br />\nA light smoke. A Lucky!<br /><br />\ntNIN<br /><br />\nOver 1760 tons of paper<br />\nbought so far!<br />\nSince the start of Your Lucky Strike<br />\n\"Sweepstakes\" more than 1760 tons of<br />\npaper have been purchased to print<br />\n\"Sweepstakes\" entry cards. Just think<br />\nof it! That's enough paper to fill about<br />\n88 freight cars.<br />\nHave you entered yet? Have you won<br />\nyour delicious Lucky Strikes? Tune in<br />\n\"Your Hit Parade\"—Wednesday and<br />\nSaturday evenings. Listen, judge, and<br />\ncomparethe tunes—then tryYour Lucky<br />\nStrike\"Sweepstakes.\" And if you're not<br />\nalready smoking Luckies,huy a pack today and try them,too.Maybe you've been<br />\nmissing something. You'll appreciate<br />\nthe advantages of Luckies— a Light<br />\nSmoke of rich, ripe-bodied tobacco.<br /><br />\na4ZeL<br />\nOF RICH, RIPE-BODIED<br />\nCopyright 1936, Ti.. American Tobacco Company<br /><br />\nTe:<br /><br />\ndown to learning plays, brushing up<br /><br />\nA smoke that treats you right!<br /><br />\nFuture Gridiron<br />\nRivals Look Good<br /><br />\nTi<br /><br />\nthinks the team is now ready to aban-<br /><br />\n611<br />\nV<br />\nIfs a Light Smoke!<br /><br />\nself.<br />\nLess than a week of intensive work<br />\nis ahead for this year's Hopkins eleven<br />\nbefore it entrains for Lehigh. Which<br />\nmen will start against the Brown and<br />\nWhite is not known definitely.<br /><br />\nMANAGER NEEDED<br />\n--Once again Manager Brian<br />\nMurphy has issued a call to all<br />\nfreshmen eager to gain the position of football manager. There<br />\nis an excellent opportunity awaiting a capable man. All those<br />\nInterested should report at the<br />\nfootball field at 4 o'clock today.<br /><br />\nbefore the first game with Gettysburg<br /><br />\n•<br /><br />\nGraziano Missing<br />\nMissing from Saturday's tussle was<br />\nCapthe sturdy Jay back and leader,<br />\nsuffering<br />\ntain Ted Graziano. Still<br />\nfrom a physical infirmity, the stocky<br />\ncaptain was unable to participate, but<br />\nduring this week he will once again<br />\nbe out for each practice session.<br />\nOnly one casualty marked the day's<br />\nproceedings and that a minor one.<br />\nBlucher, candidate for a tackle post,<br />\nsustained a sprained ankle which<br />\nforced him to the side-lines. But withagain<br />\nin a few days he will be back<br />\nberth.<br />\nvarsity<br />\na<br />\nfor<br />\nstruggling<br />\nBack Joins Squad<br />\nrecently<br />\nA. promising back has<br />\njoined the squad. This is Kerstetter, a<br />\ntransfer student from Canisius. For<br />\nseveral days now he has been limberring up with the other members of<br />\nscrimthe squad, and in Saturday's<br />\nmage he gave a good account of him-<br /><br />\n25 to 7.<br /><br />\ntempt to round the men into condition<br /><br />\n\"ilhal History repeats!<br /><br />\nKenwoodHigh'Tops<br />\nJay Vee Booters 3-1<br /><br />\nVOI<br /><br />\nThe varsity soccer squad is being<br />\nput through its paces daily in an at-<br /><br />\n•<br /><br />\nmentor.<br /><br />\nLehigh University and Washington<br />\nCollege, the first two rivals of<br />\nhave<br />\nthe Hopkins football team,<br />\ngridiron<br />\ntheir<br />\nlaunched<br />\nalready<br />\nschedules and have shown that<br />\nthey are to be feared. With a<br />\nscrappy line and a powerful balkfield, the Bethlehem aggregation has<br />\npounded out one victory in two<br />\ngames. Against the Case Rough Riders, the Brown and White crashed<br />\nthrough to a 16 to 7 victory. But<br />\nAgainst the strong Dickinson balltoters their attack and defense were<br />\nIneffective and they succumbed 20-6.<br />\nPaced by the fleet Gibbons Young,<br />\nflashy quarterback, Washington College turned back American niversity,<br /><br />\nVarsity Soccer<br />\nSquad Prepares<br />\nFor Gettysburg<br /><br />\nTOBACCO—\"IT'S TOASTED\"<br /><br />\nVI<br /><br />\nZI<br /><br />\noffi<br />\nmen<br />\ntoui<br />\nits<br />\nsea<br />\nhim<br />\nthe<br />\ngari<br /><br />\ntest<br />\nunt<br />\nand<br />\nag<br />\nper<br />\nHo,<br />\nequ<br />\nele,<br />\nsea<br /><br />\nrno<br /><br />\npoi<br /><br />\ngai<br />\ntea<br />\ning<br />\nHa<br />\nstr<br />\nba4<br />\nwa<br />\nCul<br />\nof<br />\ntic<br />\nan<br />\nBc<br />\nhil<br />\nSi'<br /><br />\nsh<br />\nha<br />\nSt<br />\nor<br />\nPC<br />\ne3<br /><br />"}], "field_media_file": [{"target_id": 39028, "display": null, "description": null, "target_type": "file", "target_uuid": "fec9d495-fc3c-4215-82b3-1e39866053d7", "url": "http://digital.library.jhu.edu/system/files/2022-03/12704-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12704, "target_type": "node", "target_uuid": "31aeb7c3-4e6e-4d90-a1e3-ba988eea9d45", "url": "/node/12704"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "86a6b213-f4fc-4070-b8d9-d194ed1a8297"}]}