{"mid": [{"value": 36649}], "uuid": [{"value": "324eeed2-246e-4b1a-a3a4-e1653326c6d3"}], "vid": [{"value": 36649}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12959-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVI. No. 5<br />\n<br />\nBALTIMORE, MD., OCTOBER 18, 1921<br />\n<br />\nENGINEERING UNIT AT HOP- INTERCOLLEGIATE CONFER- COMPETITIVE<br />\nATHLETIC<br />\nKINS IS 20th TO BE ESTABENCE TO BE HELD AT<br />\nCONTESTS TO BE<br />\nLISHED IN COUNTRY<br />\nPRINCETON<br />\nHELD WEEKLY<br />\nBasic Year Same As Infantry Units. Representatives from Over 60 Colleges Will Embrace Competition in All Recognized Sports at University. First<br />\nWill Start With Present Sophand Universities in the East<br />\nTrial Wednesday.<br />\nomore Class.<br />\nWill Meet.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS WINS FROM DICKINSON<br />\nIN THRILLING GAME<br />\nSCORE<br />\n<br />\nDOUBTFUL UNTIL FINAL WHISTLE. LOCALS<br />\nSHOWED GREAT FORM AND INSPIRED CONSTANT CHEERING FROM THE STANDS.<br />\n<br />\nIn a game replete with thrills, Johns Hopkins defeated Dickinson<br />\nCompetitive weekly contests,<br />\nAn Engineering Unit of the R. Steps have been taken by the<br />\nCollege, 6-0, at Homewood Saturday. The entire game was so in0. T. C. is being organized at the Senior Council of Princeton Uni- open to all students, and embracing teresting and the final score so in doubt<br />\nthat the cheering was almost<br />\nUniversity which will have as its versity to call an inter-collegiate all sports recognized at the Univer- continuous. Probably the largest crowd which<br />\nhas gathered at HomePurpose the training of reserve conference on the subject of dis- sity, will be held throughout the wood this season came out to witness<br />\nthe game and they were in no<br />\nEngineering officers just as the in- armament, to be held in Princeton coming year, according to Coach way disappointed. The contest<br />\nwas full of good football, every methLe Cato, of the track team. At the<br />\nfantry unit trains men for reserve on October 26th.<br />\nod almost being exploited at one time or another. Dickinson was<br />\ncommissions in the Infantry. This<br />\nThe proposal is to invite two rep- end of the year, five specially de- known to be strong in the overhead game, but most of her gained teris the twentieth organization of its resentatives each from over 60 col- signed medals will be awarded as<br />\nritory was on plunging, while Hopkins showed her adequate prepkind to be established in this leges and universities throughout prizes to the winners. The first aration for the collegians' attack by<br />\nmaking her only touchdown on a<br />\ncountry. Last year there were the East, and it is hoped in this trials will be held next Wednesday. forward pass. It was. a tense<br />\nmoment as the ball sped down from<br />\n3,300 students enrolled in similar manner to stimulate discussion<br />\nCoach Le Cato arranged for this Eric Calkins to \"Happy\" Middleton, standing<br />\nover the goal line with<br />\nengineering units _ at American among the undergraduate bodies of new feature of college athletics. Hopkins only score. The Black<br />\nand Blue continues to show improved<br />\ncolleges and universities. The these colleges and to deepen the in- The plan affords a splendid oppor- form and will give a good account<br />\non November 17th when St. John's<br />\ncourses prescribed by the Military terest in the whole question of the tunity for development of whatever fails to score. Much credit is due<br />\nthe Class of '25 and to Gilson Engel<br />\nDepartment are based upon the limitation of armaments.<br />\nlatent athletic ability may lie, un- for the splendid organized cheering Saturday both<br />\nin the stands and<br />\nassumption that the training of The duty of organizing<br />\nthe con- realized, in any student. It is on the field.<br />\ncivil and that of army engineers ference has been assumed<br />\nDuring the first quarter both and blocked the kick. Middleton<br />\nby the thought that the contests will tend<br />\nare much the same in character,<br />\nSenior Council of the University, to create a more universal interest teams seemed unable to gain and recovered the ball and ran 35<br />\nand will endeavor to instruct en- under whose auspices<br />\nit is to be in all-round sports, and will pro- kicked back and forth, Calkins yards to Dickinson's 11-yard line<br />\ngineering students in Military held. The Council has<br />\nappointed a vide more material for use on the having the edge on the visitors' before being downed. The fourth<br />\nEngineering subjects of funda- committee of six undergraduat<br />\npunter. The ball stayed in midfield down found five yards between<br />\nes various teams.<br />\nmental military importance. They who are to take charge<br />\nThe following events will be par- or in Dickinson territory and it the ball and the goal line, so Calof the orare to be made practical as far as<br />\nticipated in:<br />\nganization of this conference.<br />\nwas the middle of the second quar- kins made a pretty pass to MidPossible rather than theoretical. Invitations have<br />\ngone out to all<br />\nFootball: Punt for distance; ter before the Pennsylvanians dleton behind the goal for the lone<br />\nThe subjects which will be taught<br />\nmanaged to get the ball on Hop- touchdown. Calkins failed to kick<br />\nthe important colleges and univer- drop kick, and pass for distance.<br />\nthe first year are basic and will not<br />\nkins<br />\nground.<br />\nsities in the East, and a prospectus<br />\ngoal. The spectacular work of<br />\nBasket-ball: Foul shooting and<br />\ndiffer much from those of the InDickinson<br />\nwas forced to punt Middleton and McGill and the<br />\nand the proposed program have goal shooting back of 20-foot mark.<br />\nfantry Unit. The following is a list<br />\nagain, and McGill broke through consistent tackling of Knecht and<br />\nbeen sent to all who are expected<br />\nLacrosse: Goals at angle.<br />\nof the engineering courses to be<br />\nto participate in this conference. Swimming:<br />\nOne - lap swim DRAMATIC CLUB CANDI- Landy featured the half for the<br />\nstudied in addition to the courses<br />\nThe chief features consist of an (against time)<br />\nlocals, while Dailey, Templin and<br />\n;4-lap swim (against<br />\nof infantry instruction during the<br />\nDATES TO REPORT<br />\nPipa shone for the Carlisle Colleafternoon and an evening meeting, time).<br />\nsophomore, junior and senior<br />\nWEDNESDAY<br />\nto be addressed by prominent men<br />\ngians.<br />\nBaseball:<br />\nRunninc, bases Try-outs for One-act Plays to Be Held<br />\nyears:<br />\nwho have been invited to come for<br />\nIn the second half the CollegThursday. Three to Be Given<br />\n(against time) ; throw for distance.<br />\nSophomore—Engineer Organi- this purpose; and banquet<br />\nians<br />\ncame back strong and looked<br />\na<br />\nin the<br />\nin December.<br />\nTrack and Field. 100, 440, mile<br />\nzation, Care of Animals, Roads University dining halls. At the<br />\ndangerous several times. Captain<br />\nThe first meeting of candidates<br />\nand Bridges.<br />\nPipa made several first downs<br />\nafternoon meeting a resolution will runs; 120 low hurdles; discus<br />\nfor parts in the Dramatic Club<br />\nJunior—Coast Defenses, Demo- be introduced expressing to the throw; javelin throw: shot put;<br />\nhimself. Through the plunging of<br />\nlition, Military Railroads, General Government the sympathy of the high jump; broad jump, and pole productions will be held Wednes- Pipa and Templin and the Pipaday at 12.30 in its studio on the<br />\nConstruction.<br />\ncolleges of the country with the pur- vault.<br />\nGoetz passing, Dickinson penetop floor of the Barn. At this<br />\nContests in each sport will be held<br />\nSenior—Engineering Tactics, pose of the coming Washington<br />\ntrated to Hopkins' two-yard line,<br />\nmeeting the candidates will be<br />\nbut failed to score and the ball<br />\nConference, and solicitation for its during the season of that sport. The<br />\nMechanical Equipment.<br />\ngiven final instructions concernfootball<br />\ntrials<br />\nwill<br />\nbe<br />\nbegun<br />\nwent over. The spectacular feanext<br />\nNo engineering work will be successful conclusion.<br />\ning the try-outs which will be held<br />\ntures of the fourth quarter were<br />\ngiven juniors or seniors this year<br />\nThe gathering of college repre- Wednesday. Ten points will be Thursday afternoon.<br />\nthe gains of McCullough and the<br />\nbecause it is felt that they have sentatives, it is hoped, will stimulate counted for first place, nine points<br />\nAt these try-outs men will be<br />\nnot sufficient time left at the Uni- public interest in the coming Con- for second place, eight points for selected to enact the roles in the 55-yard run of Which Willis made<br />\nversity to complete the course of ference, and serve as a basis for third place and so on down to tenth one-act plays to be produced on before being downed by Shields<br />\non Dickinson's five-yard line.<br />\ninstruction. When a student fin- crystallization of public opinion in place, which will count one point.<br />\nthe night of December 7. The<br />\nHopkins was unable to turn anNo student will be eligible for plays will be \"Roadhouse<br />\nishes the training he will be given support of the Government. One<br />\nin Arother<br />\ntouchdown and after an exthe<br />\nlast<br />\nfive<br />\nevents<br />\nunless he has den\" and \"Death in Feber Flat.\"<br />\na commission in the Reserve of the chief results should be to enchange of kicks the end of the<br />\nCorps and assigned to a regiment gender wider discussion of the vital completed in eight of the first fif- Joseph<br />\nA. Moran has written a<br />\ngame found Dickinson with the<br />\nin this corps area. It is hoped that question of the limitation of arma- teen.<br />\nvery good sketch which will probthe students and faculty will co- ments in the colleges as well as outBecause of the wide range of the ably be produced at the same ball on their own 20-yard line.<br />\noPerate with the Military Depart- side through the wide publicity tests, it is thought that every man time.<br />\nSCORE BY QUARTERS<br />\nment in building up this branch of which will doubtless be given to the will have a chance to win a medal. It is essential that all<br />\n0 6 0 0— 6<br />\nmen who Hopkins<br />\nDickinson<br />\nthe R.0. T. C. to the present high movement in the college papers and Even if no prize is won, the con- want to become members of<br />\n0 0 0 0— 0<br />\nthe<br />\nLINEUP<br />\nstanding of the Infantry Unit.<br />\nthe metropolitan press.<br />\ntests should act as a fine mental and club attend the meeting WednesJOHNS<br />\nHOPKINS<br />\nDICKINSON.<br />\nphysical<br />\ntonic, and should stimu- day. The qualifications for mem- 1<br />\nIt is felt that on account of the<br />\nMiddleton ..L.E..... Crowley 16<br />\nMIDDLETON UNANIMOUSLY ELECTfact that during the war it was late a spirit of clean and healthful bership are hard to fill but par- 21 Westerman .L.T.. Blumenthal 24<br />\nED PRESIDENT OF JUNIORS<br />\nMagill<br />\nL G<br />\nCook 30<br />\nlargely the college men who com- competition greatly to the benefit ticipation in these plays will be 13<br />\n0 Totterdale<br />\nC<br />\nSmith 4<br />\nAt a meeting of the Junior Class<br />\nposed our army and bore the brunt of the individual and of Johns Hop- the stepping stone to biggel 8 Landy<br />\nR G<br />\nSayes 12<br />\nheld last Friday in the M. E. Hall,<br />\n4.Knecht ....R.T.... Sharpe 8<br />\nof the conflict, their endorsement of kins.<br />\nthings.<br />\n11<br />\nRich<br />\nR<br />\nE<br />\nGoeltz 10<br />\n\"Happy\" Middleton was unani6 Darley . .Q.B.... Pipa (c) 2<br />\na program of disarmament cannot<br />\nAll students, and especially the<br />\nmously elected president. The fol7<br />\nSpinney<br />\nL H B<br />\nDailey 36<br />\nbe misinterpreted and their ex- Freshmen, are invited by Coach Le DEAN<br />\nWARNS PHYSICAL 29 Willis ....R<br />\n.H.B. . Templin 18<br />\nlowing men were also elected class<br />\n14<br />\npressed opinion should carry con- Cato to appear at 5 o'clock next<br />\nCalkins ....F.B...Wertacni<br />\nTRAINING DODGERS<br />\n.•<br />\nk 22<br />\nofficers: Somerville, vice-president;<br />\nsiderable weight.<br />\nWednesday at the athletic field. It Coach Van Orman Makes Fiery<br />\nSubstitutions:<br />\nHopkins—Non<br />\ne. DickFenneman, secretary; Zoller, treasinson—Shields for Blumenthal, McCulSpeech.<br />\nJohns Hopkins has been request- is believed that the little time reurer; Cromwell, sergeant-at-arms.<br />\nlough for Dailey, Davis for McCullough,<br />\ned to send two representatives to quired will be more than compen- Dean Latane again addressed the Beighle for Wertacnik. Referee—<br />\nAt the same meeting 0. D. Col- the conference.<br />\nO'Brien. Umpire—Hogsett. Linesman<br />\nsated by the results.<br />\nstudent body on the question of —Hoban.<br />\nlins was elected associate business<br />\nphysical training at the mass-meetmanager of the Hullabaloo and Joe<br />\nheld last Thursday in the C. E.<br />\ning<br />\nENGEL TO HEAD SENIORS<br />\nJOHNSTON ELECTED PRESIDENT OF<br />\nMoran was elected associate editor.<br />\nCALLARD TO HEAD SOPHS<br />\nHall.<br />\nHe opened his talk by readCOTILLON BOARD<br />\nEngel<br />\nGilson<br />\nwas<br />\nelected presiBefore the elections the retiring<br />\nHenry Callard was elected the<br />\ning a list of men who had absences<br />\nChristopher Johnston was elected<br />\npresident, 0. D. Collins, read a let- dent of the Senior Class at a meetfrom physical training classes and president of the Sophomore Class<br />\nter from Dr. E. 0. Hulburt, honorpresident of the Cotillon Board,<br />\ning held in the Civil Engineering<br />\nsaid that all of these men must re- at the meeting held Thursday, Ocary president of the class last year.<br />\nwhich held the first meeting of the<br />\nport at ten o'clock Saturday morn- tober 13. Other officers are \"Buck\"<br />\nHall on Thursday, at 12:20. The<br />\nseason last Friday. Frederick W.<br />\nDr. Hulburt expressed his gratiing, prepared to make these up. Grace, vice president; Fitz Duntude for a pipe given him by the vice-presidency was garnered by Lipps was elected secretary and<br />\nFailure to report will mean suspen- ning, secretary, and George M.<br />\nclass last spring, and said that he \"Bill\" Totterdale, and Dorsey Wat- treasurer.<br />\nsion and positively no men will be Shriver, treasurer. It is possible<br />\ngreatly regretted not being back kins was successful in the race for<br />\nIt was decided to hold the first excused. In the future all absences that a re-election may be held, as<br />\n•<br />\nWith the class this year.<br />\nthese men were elected by a plusecretary. A. J. Noviasky<br />\nwas dance some time near Thanks- must be made up on Saturdays.<br />\ngiving.<br />\nmade treasurer and A. H. Knecht,<br />\nThe meeting, at this point, was rality and not a majority vote.<br />\nProfessor X—Who's there?<br />\nMembers of the board are J. B. turned over to the Student Council.<br />\nsergeant-at-arms.<br />\nBurglar—Lie still and keep quiet.<br />\nPowell,<br />\nD. K. Vanneman, David Emil Smith and Gilson Engel made<br />\nHe—Ruth is a mighty curious<br />\nAt the same meeting about 30<br />\nm looking for money.<br />\nThomas, Pierre Ghent, Theodore appeals for the support of the stu- girl, don't you think?<br />\nProfessor X—Wait, and I'll get men who are making their ,college Whitely and Brent Wells. The dent band and asked for a collecHim—I haven't found her so.<br />\nIT and look with you.—Orange course in three years were admitted non-fraternity member has not yet tion to be used for instruments<br />\nand<br />\nHe—That's<br />\nit. Neither have I.—<br />\nPeel.<br />\n..to the class.<br />\nbeen elected.<br />\nContinued on page 2, col. 1<br />\nTiger.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 18, 1921<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\nFOUNDED 1897.<br />\n<br />\nNews-Letter<br />\n<br />\nSTUDENT ACTIVITIES COUNCIL HAS GREAT DEAL<br />\nOF POWER<br />\n<br />\n$2.50 Administers Money of All Non-athletic<br />\nActivities. Awards Varsity Seal. Six<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nMen Given Seals This Year.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nSubscription<br />\n<br />\nOur<br />\n<br />\nprep<br />\n<br />\nroom on the<br />\n<br />\n1.<br />\n<br />\nthird floor specializes in<br />\nclothes for young men.<br />\n<br />\nThe Varsity Seal Voting CounPublished semi-weekly from October to June by the students of Johns<br />\ncil, or as it has been recently reHopkins University.<br />\nStudent Affairs<br />\nBusiness communications should be addressed to the BUSINESS MAN- named, the<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Council, is an organization the exshould be sent to the MANAGING EDITOR.<br />\n<br />\n.2.<br />\n<br />\nHub<br />\n<br />\nistence and purpose of which is<br />\nBaltimore. Charles and Fayette<br />\nwhich<br />\nwields considerable influence and<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\npower.<br />\nFREDERICK W. LIPPS, '22.<br />\nActing Managing Editor:<br />\nThe Varsity Seal Voting Coun- GOOD SQUAD OUT FOR<br />\nYoung Men's Clothing<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR.<br />\ncil was formed in 1920 to provide<br />\nFOOTBALL<br />\nFRESHMAN<br />\nGLOVER P. FALLON, '23.<br />\nand Furnishings<br />\nAssociate Editors:<br />\nfor the recognition of college acGames<br />\nNo<br />\nEDWARD G. HUEY, '22.<br />\nReport.<br />\nTwenty-eight<br />\nMen<br />\nAdvertising Manager:<br />\ntivities other than athletic. There<br />\nELI FRANK, JR., '22.<br />\nScheduled Yet. Armstrong<br />\nDONALD K. VANNEMAN, '23.<br />\nAre made a special feature of<br />\nwas a tendency prior to the incorto Coach.<br />\nJunior Editors:<br />\nAssistant Business Managers:<br />\nhere.<br />\nporation of the council for each<br />\nCHARLES C. MARBURY, '22.<br />\nTwenty-eight first year men reBERNARD C. HEARN, '23.<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nof the non-athletic activities to<br />\nJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nsponded last week to Coach Herb<br />\nmake separate awards to men<br />\nE.<br />\nCRAIG<br />\nTAYLOR, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nArmstrong's call for candidates Give us a call and let us become<br />\nwho had distinguished themselves<br />\nfor the Freshman football team. better acquainted for mutual<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nin their particular line of endeaAlthough the majority of the men<br />\nbenefit.<br />\nvor.<br />\nthe game,<br />\npractically<br />\nnew<br />\nat<br />\nare<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nTo offset this tendency, to pro- several of those who signed up<br />\nvide for a uniform award to all have made enviable records in<br />\nBALTIMORE, MD., OCTOBER 18, 1921<br />\nnon-athletic activities and to re- prep school. Coach Van Orman<br />\nstrict the distribution of this has delegated several first year<br />\naward the present Student Af- men who were out for the Varsity<br />\nFRICTION AGAIN<br />\nHoward at Lexington<br />\nOnce again the old friction between the Students and the Varsity fairs Council was instituted the to the Freshman squad and with<br />\nClub has broken out. That the A. A. Board was thoughtless and tact- award of the Student Affairs these as a nucleus the remainder<br />\nless at its last meeting we freely admit, but any symiathy we felt for Council is a miniature reproduc- should quickly develop under<br />\nthe Varsity Club was squelched by the speech made to the football tion of the University seal in gold Coach Armstrong's able tutelage<br />\nsquad by their representative. Many conflicting reports of this ad- mounted on a rectangular back- into a well-balanced combination.<br />\ndress have been received, but all unite in condemning it as the most ground, upon the back of which is<br />\nUY or rent a Corona<br />\nAt Dr. Van Orman's request<br />\ntypewriter on easy<br />\ntactless and insulting oratorical effusian ever heard on Homewood engraved the name of the recipient<br />\narbeen<br />\nno games as yet have<br />\npayments. Carry it to<br />\nField, and the extent to which it has damaged the morale of the team along with that of the activity in<br />\nschool every day in its<br />\nranged for the Freshmen. Weekly<br />\nneat case. Make extra<br />\nwhich he won the seal.<br />\ncan not be estimated.<br />\nscrimmages, however, will be armoney writing articles or<br />\nThe Varsity Club and the Students must pull together for HopWith the establishment of the an 0-ed with local hioth schools and<br />\ndoing typing for others!<br />\n6<br />\nCall today at the nearest<br />\nkins, but we do not believe that they will ever succeed in doing so non-athletic fee the powers of the<br />\nit is probable that several games<br />\nCorona store—or telewhile the club is under the present management.<br />\nStudent Affairs Council were will be scheduled before the anptione for a demonstration at your home.<br />\ngreatly increased. Besides the du- nual Freshman-Sophomore tilt.<br />\nties previously stated the council The following Freshmen have sigCOACH LE CATO'S PLAN<br />\nM. W. LUCY & CO.<br />\nAn excellent method of discovering hidden athletic ability is now has charge of the collection, nified their intention of trying foi<br />\n118 W. Fayette St.<br />\nshown in Coach Le Cato's plan for weekly competitive athletic con- distribution and disbursement of the team:<br />\nWeir,-hs GM lbs.<br />\ntests. Many men come to college imbued with the idea that they all funds received by the HullabaFolds and fits<br />\nBolsam, Bates, Berkeley, Brewin a neat carryhave no ability in the athletic line. Many men have discovered too oo, News-Letter, Black and Blue<br />\ning case.<br />\ner, Brawner, Calhoun, Carper,<br />\nBulletin,<br />\nDramatic<br />\nDaily<br />\nJay,<br />\nlate that they have a natural capacity in some sport.<br />\n$nn<br />\nDorsey, Fargo, Frazer, Gump,<br />\nu‘i case<br />\nBesides providing material for Varsity teams these contests Club, Musical Club, Debating<br />\nJones, Kirkeley, Koff, Lockwood,<br />\npurand<br />\nY.<br />\nM.<br />\nC.<br />\nA.<br />\nNo<br />\nshould stimulate a spirit of clean and healthful competition that -Will Council<br />\nMcCleary, Moehle, Richardson,<br />\nprove to the advantage of Hopkins and the individual. All Hopkins chases. can be made by any of<br />\nSkinner, M., Skinner, R., Spurstudents should take advantage of the opportunity and respond to these activities without the ap- rier, Steck, Summers, Towner,<br />\nThe Personal Wnting Machtne<br />\nCoach Le Cato's invitation and compete weekly in these contests. proval of the chairman and treas- Watson, Willison, Larzeux; Berurer of the council.<br />\ngen.<br />\nATTENTION TO RULE I, FRESHMEN<br />\nAn accurate system of bookThe first rule of the Freshmen regulations requires that \"within keeping is kept by the treasurer,<br />\nand with the approval of the Vottwo weeks after the beginning of the college year every Freshman John Myers, under which each ac- editor, the associate editor who,<br />\ning Council.<br />\nmust be actively participating in some recognized student activity or tivity has an account, the liabili- at the time of receiving the seal,<br />\ne. Debating Team: The followmust present to the Student Council some logical excuse for not ties and assets of which may be shall have been active members<br />\nmen shall be awarded the Varng<br />\nof the editorial board for at least<br />\ndoing so.\" Today is the last day of the two weeks allowed, yet there ascertained at any time.<br />\nsity Seal: Those members who,<br />\nare a number of Freshmen who have failed to report for any ac- The Student Activities Council is two years. From the Business through competition,<br />\nwin a place<br />\ntivity. The regulation certainly imposes a hardship upon no one. composed of representatives from Board: the business manager, the<br />\nUniversity<br />\nDebating Team<br />\non the<br />\nThose offenders who have purposely evaded the law should be dealt the six accredited nonathletic ac- circulation manager, the assistant<br />\nand represent the university in<br />\nwith ,if anything, more severely than those who have merely broken tivities and the Daily Bulletin and business managers who at time<br />\none or more intercollegiate desome minor rule. The list of activities at Hopkins offers opportuni- V. M. C. A. The officers are H. of receiving the seal shall have<br />\nbates in one yew'.<br />\nties to every man—infant prodigies and near-Methuselahs as well. Douglas Cotton, chairman; Fred been active members of the busif. Dramatic Club: The followWorse than the conscientious objector is the man who hands in W. Lipps, Jr., secretary, and John ness staff for at least two years.<br />\ning men shall be awarded the Varhis name for an activity, having at the time no intention of giving that Myers, treasurer. The members<br />\nb. Hullabaloo: The following sity Seal: The president, treasactivity his ablest support. Several such men have announced their are Dorsey Watkins and E. G. men shall be awarded the Varsity<br />\nurer and production manager;<br />\ncandidacy for positions on both the editorial and the business boards Huey of the Hullabaloo, Paul S. Seal at the end of their junior<br />\nthose members who have made a<br />\nof the News-Letter. Unless these men give satisfactory support to Jones and Quentin Singewald of year, provided they have gained<br />\npart of at least 25 lines, standard<br />\ntheir respective boards they will be reported to the Student Council the Black and Blue Jay, William their offices through the usual<br />\nrehearsal edition and have pareditorand will fail to receive their protective activities button.<br />\nH. Moore and Fred W. Lipps, Jr. public class elections: The<br />\nticipated and appeared in the pubIt's a case of dodging the prevention or dodging the cure, of the News-Letter; Lawrence B. in-chief, the business manager and<br />\nlic presentation of the club, for<br />\nFreshie, so we'd suggest dodging the paddles.<br />\nFenneman and Parker C. Wil- two more senior members of the two collegiate years.<br />\nliams of the Debating Council, board (at the end of junior year,<br />\nDEAN WARNS PHYSICAL<br />\nCouncil next Monday and Tuesday Gilson Engel and H. Pierce Brow- or when nominated by the editorTRAINING DODGERS<br />\nDan—Let's elope—<br />\nat the Barn.<br />\nner of the Dramatic Club, and in-chief), upon the nomination of<br />\nContinued from page I, col. 4<br />\nAnn—Sure.<br />\nCoach Van Orman made a short Waldo Hambleton and Hugh the editor-in-chief and with the<br />\ncouncil. And get married.<br />\nuniforms. \"A collection for the and somewhat fiery appeal, urging Smallwood of the Musical Club. approval of the voting<br />\nOh, dear! How conventional you<br />\nIt is the desire of the council to Section 3, Art. 2a.<br />\nstudent band,\" Engel said, \"will riot all undergraduates to come out to<br />\nC. Black and Blue Jay: The fol- are.—Froth.<br />\nhe gone in one week, as one for a the games and give the team some have the Varsity Seal a coveted<br />\nhired band, but would remain as a real support. The cheer leaders honor representing in nonathletic lowing men shall be awarded the<br />\nHe—Woman is loveliest in her<br />\npermanent investment.\" The stu- then took charge of the meeting. activities what the \"H\" does in Varsity Seal: The editor-in-chief,<br />\nthirties.<br />\ndent body responded to this appeal Gilson Engel said that the coach athletics. Recently Varsity Seals managing editor, business manShe—Thank—I mean, do you<br />\nto the tune of seventy dollars. An- wanted the students to come out to were voted to Lawrence B. Fen- ager, circulation manager and not<br />\nthink so?—Purple Cow.<br />\nnouncements were then made call- the field and cheer the team every neman, Joseph A. Moran, H. more than three from the ediing for men for the dramatic and Friday afternoon. He and Joe Douglas Cotton, Quentin Singe- torial staff and two from the busiBarber (to sleepy customer)—I<br />\nmusical clubs, and Mr. Kistler asked Thompson outlined a plan for ar- wald and Paul L. Jones of the ness staff upon the nomination of cannot shave you, sir, unless you<br />\nfor men who would try to sell sea- ranging the student body in the Black and Blue Jay and Moreno the Board of Control.<br />\nhold up your head.<br />\nd. Musical Clubs: The followson tickets for the remaining foot- form of a large H. both in the stand Badello of the Dramatic Club.<br />\nSleepy Customer—All right, give<br />\nThe qualifications for the award ing men shall be awarded the Var- me a hair cut, then.—Jcster.<br />\nball games. Dick Wood announced and on the field between the halves,<br />\nthat by next Tuesday all Freshmen at Saturday's game. A new Hul- of the Varsity Seal are as follows: sity Seal: The president, the dia. News-Letter: The following rector and the manager, and not \"Mary, are you going to wear an<br />\nmust be engaged in some under- labaloo yell with several pauses and<br />\ngraduate activity and all those who a whistle-boom yell, which would men shall be awarded the Varsity more than four members of two evening gown to the Prom?\"<br />\nwant advice or have any excuses follow up the kick-off, were pre- Seal. From the Editorial Board: years' standing, upon the nomina- \"Not so you could notice it\"—<br />\nthe editor-in-chief, the managing tion of the president and director, Wag Jag.<br />\ncan meet members of the Student sented and both made a big hit.<br />\nTelephone<br />\n<br />\nHomewood 100 not widely known, but<br />\n<br />\n3<br />\n<br />\n4.<br />\n<br />\ns.<br />\n<br />\n6.<br />\n<br />\nTEWART&G,<br />\n<br />\n03 Cartitection With James AftCrien/(3 CO-.<br />\n<br />\nYork<br />\n<br />\nTeachers.<br />\n<br />\n8<br />\n<br />\nB<br />\n<br />\n10<br />\n<br />\n11<br />\n<br />\nCopoNA<br />\n<br />\n12<br />\n<br />\n1,<br />\n<br />\n1<br />\n<br />\n\fTHE JOHNS H0PKINS NEWS-LETTER, OCTOBER 18, 1921<br />\n<br />\n22. That the one-act plays written<br />\nORDERS RECEIVED FOR<br />\nthe<br />\nmembers<br />\nby<br />\nof<br />\nthe Dramat(With apologies to Drs. H. L. Mencken<br />\n. COGGINS'<br />\nic Club are all worthy of publi- Transfer and Baggage<br />\nand George Jean Nathan.)<br />\nExpress<br />\ncation in the Smart Set maga1. That Dr. Goodnow is the real<br />\nAUTOMOBILE SERVICE<br />\nzine.<br />\nPHONE, HOME WOOD 2645-W<br />\ndictator of the Republic of China, and manages affairs there 23. That histrionically, Holmes<br />\nthrough Dr. Willoughby.<br />\nBoyd is a second Julian Eltinge.' ANNUAL DEBATE MAY BE HELD<br />\n2. That Physics is the hardest<br />\nMARCH 4th<br />\n24. That the freshman who gets a<br />\ncourse in the university, and<br />\nhigh mark in an intelligence test<br />\nThe Debating Council held a<br />\nthat seven-eights of those who<br />\nis necessarily a superior sort of meeting Friday at which the protake it fail.<br />\nindividual.<br />\nposal of North Carolina University<br />\nThat the NEWS-LETTER iS the<br />\nto<br />\nhold the annual triangular debate<br />\nbest college newspaper in the 25. That Mr. Ball has a memory as<br />\nlong as an elephant's, and can between Johns Hopkins, WashingUnited States.<br />\nremember the full name of ton and Lee, and North Carolina on<br />\n4. That if you say Harvard or<br />\nevery student that has been at March 4th, was passed upon favorPrinceton or Yale to a,savage<br />\nably. Charles C. Marbury was apin darkest Africa, he will shake<br />\nHopkins since 1887.<br />\nhis head; but if you mention<br />\npointed chairman of a committee<br />\nnotwithstanding<br />\nDr.<br />\nHopkins he will immediately 26. That<br />\nto arrange the Freshman-SophoSwartz's somewhat advanced<br />\nsmile and draw a picture of a<br />\nmore debate. Since it is planned<br />\nphysician and a saw.<br />\nyears he can outwalk any athlete<br />\nto hold the debate early in Decems. That the undergraduate who in the university.<br />\nber, the presidents of these classes<br />\ndoes not speak disparagingly of<br />\n27. That the compilers of this Credo will be asked to appoint committees<br />\nhis professors is wholly lacking<br />\nare damned idiots, and have pe- to confer with Marbury concerning<br />\nin sophistication.<br />\nculiar notions of what's funny. the arrangement of the debate.<br />\n6- That Dr. Broadus Mitchell is<br />\na Baptist and attends church<br />\nregularly.<br />\n7. That the freshman who gets an<br />\nA on an English composition<br />\ntheme is _a coming literary<br />\ngenius.<br />\nTHE HOPKINS CREDO<br />\n<br />\n-ne<br />\n<br />\nORTMAN'S<br />\n\"Queen Quality\" Home Made Chocolates<br />\nVISIT OUR ICE CREAM PARLORS<br />\n<br />\n3<br />\nMt. Vernon 4999<br />\n<br />\nW.L. Mann<br />\n<br />\n518 N. CHARLES STREET<br />\n<br />\nCommercial Photography<br />\n<br />\nChelsea Pharmacy<br />\nCharles and 22nd Sts.<br />\nDelicious Sodas and Sundaes<br />\nThe Best of Candies<br />\nPrompt 8z Efficient Service<br />\n<br />\nCircuit Photography<br />\nFlash Lights<br />\nViews<br />\nGroups<br />\nEnlargements<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br />\n<br />\nThe College Drug Store R.G.Loy & Company<br />\nST. PAUL & 24th STS.<br />\n<br />\n1 W. University Parkway<br />\n<br />\nC. D. Wolfe, Prop.<br />\n<br />\nOpposite J. H. U. Athletic Field<br />\n<br />\nDELICIOUS SODAS & SUNDAES<br />\nMade With<br />\nJersey Special Ice Cream<br />\n\"The Velvet Finish\"<br />\n<br />\nDRUG STORE for J. H. U. BOYS<br />\n<br />\nKODAKS<br />\n<br />\nPHONE, HOMEWOOD 2121<br />\n<br />\nCAMERAS<br />\n<br />\nSUPPLIES Buy an (11) Pipe made special<br />\nfor the Boys<br />\nWhitman's Chocolates and Bon Bons<br />\n<br />\nHe—How do you like my voice \"John, what is a synonym ?\"<br />\nin comparison with Caruso's ?<br />\n\"A synonym is a word you use<br />\nShe—He is good but your's is when you can't spell another.\"—<br />\nbetter still.—Mugwunzp.<br />\nMedley.<br />\n•<br />\n<br />\n8- That a great many of the professors of Hopkins are wealthy<br />\nmen and serve without accepting salaries<br />\n9- That the Black and Blue Jay is<br />\nstill very young and immature.<br />\nbut that by the end of this year<br />\nit will surpass the Princeton Tiger and the Harvard Lampoon.<br />\n10. That since Dr. French once<br />\nPlaced Kipling's \"Years Between\" and Ibanez's \"Four<br />\nHorsemen\" on the reading shelf<br />\nthey are to be regarded as classics.<br />\n11. That the student who goes to<br />\nHighlandtown to see a girl is<br />\nan apt subject for ridicule.<br />\n12. That while it takes great perseverance and hard work to get<br />\nan engineering degree, almost<br />\nany fool can loaf through the<br />\nacademic department.<br />\n13- That the Hopkins R. 0. T. C.<br />\nunit is the best in the United<br />\nStates.<br />\n14- That Gilman Hall looks exactly<br />\nlike Independence Hall in Philadelphia.<br />\n15- That Adike Bowers is highly<br />\nproficient in the art of swearing, and on one occasion cussed<br />\nfor half an hour straight without repeating when informed<br />\nthat \"Ma\" Greene had flunked<br />\nhim in English Lit. 1.<br />\n16.<br />\nThat while students go to other<br />\nuniversities to have a good time,<br />\neveryone comes to Hopkins to<br />\ngain an education by hard work.<br />\n17- That the Black and Blue Jay<br />\nis a humorous periodical.<br />\n18.<br />\nThat Dr. Francis Dominic Murnaghan is a secret agent for the<br />\nSinn Fein, and signals his coconspirators with various colored ties.<br />\n19- That all Goucher girls, with the<br />\nexception of a very few freshmen, are uniformly ugly.<br />\n20. That anyone seen in the botanical gardens after nine o'clock<br />\nat night is there for nefarious<br />\nand unethical purposes.<br />\n21. That anyone who has passed an<br />\nentire evening at the M-u-t<br />\nR-y-1 C-n-t-y C-b is a sophisticated man of the world and will<br />\nnot be shocked by any debaucheries.<br />\n<br />\nNikola Tesla<br />\nHE NAME of Nikola Tesla, will always<br />\nbe associated with the invention and earlier<br />\ndevelopments of the induction motor. In fact,<br />\nat one time this type of apparatus was known<br />\nalmost exclusively as the \"Tesla\" motor.<br />\nTesla devised this motor back near the beginnings of the electrical business, when practically everything was built by \"cut and try\"<br />\nmethods,and none of the accurate analytical processes of later days had been developed. It may be<br />\nsaid broadly that Tesla knew two fundamental<br />\nfacts—first, that if a magnet were moved across<br />\na sheet of conducting metal, it would tend to<br />\ndrag this metal along; and,—second, that the<br />\neffects of such a moving magnet could be produced by suitably disposed polyphase currents<br />\nacting on a stationary magnetic structure.<br />\nPerhaps others, at that time, also knew these<br />\ntwo facts, but if so, apparently they knew them<br />\nonly as two isolated facts. Tesla considered<br />\n,them in combination and the result was the<br />\nTesla motor, or what is now known broadly as<br />\nthe \"induction motor.\" These two facts, in<br />\ncombination, represent a fundamental conception, and all of the many millions of horsepower<br />\nof induction motors in use today throughout the<br />\nworld, are based upon these two fundamentals.<br />\nNaturally, Westinghouse, having fought single<br />\nhanded to advance the alternating current system,<br />\nwas supremely interested in the new type of<br />\nmotor. What if the new motor did require<br />\n<br />\nT<br />\n<br />\npolyphase circuits, while all existing circuits<br />\nwere single phase? What if it did require<br />\nlower frequency than any existing commercial<br />\ncircuits? These were merely details of the future<br />\nuniversal alternating system. The important<br />\nthing was to obtain an ideally simple type of<br />\nalternating current motor, which Tesla's invention offered. Tesla furnished the fundamentalidea.<br />\nHe and his associates, working for Mr. Westinghouse, proved that thoroughly operative<br />\ninduction motors could be built, provided suitable<br />\nfrequencies and phases were available. What<br />\nmatter if they did not produce an operative<br />\ncommercial system at the time? What matter if<br />\nit needed the powerful analytical engineers of<br />\nlater date to bring the system to a truly practicable stage—men with intimate constructive<br />\nknowledge of magnetic circuits—men on intimate<br />\nterms with reactive coefficients and other magnetic<br />\nattributes totally unknown to Tesla and his coworkers? In time the motor was made commercial, and it has been a tremendous factor in<br />\nrevolutionizing the electrical industry.<br />\nProbably no one electrical device has had more<br />\nhigh-power analytical and mathematical ability<br />\nexpended upon it than the induction motor.<br />\nThe practical result has been one of the simplest<br />\nand most effective types of power machinery in<br />\nuse today. Thus Tesla's fundamental ideas and<br />\nWestinghouse's foresight have led to an enormous<br />\nadvance in the world's development.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET TER, OCTOBER 18, 1921<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br />\n<br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br />\n<br />\nClit eXatterele)<br />\n\"14MES H.& OSCAR G.1-5Nri<br />\nOWNERS<br />\nilbE*1111.0e4 VIPS*<br />\n<br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\n<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\n<br />\nIt's time for a<br />\n<br />\nATTENTION ALUMNI!<br />\nTHE NEWS-LETTER NEEDS YOUR SUPPORT<br />\n<br />\nFALL SUIT<br />\n<br />\nThe News-Letter, as you know, is edited and published by<br />\nit gives the University news, and it gives all of it.<br />\nstudents;<br />\nthe<br />\nfew years in which the University has been<br />\nlast<br />\nDuring the<br />\nsteadily growing it has been very loyally supported by the student body. We have reached the time now, where the Board<br />\nfeels it is desirable to issue the NEWS-LETTER each Tuesday<br />\nand Friday during the collegiate year. And so, for the first time, it<br />\nis being done this year, at a cost of about $4,800.<br />\nAppearing twice a week will enable the editors to give advance notice of all games, meetings, lectures and other interesting gatherings, as well as an immediate and complete account<br />\nfor the benefit of those unable to attend. We know you are interested in Hopkins' activities, in the progress of the dorms, in<br />\nthe football team, lacrosse team, debating team, Dramatic Club,<br />\netc. Perhaps you were a member of one of our championship<br />\nlacrosse teams—at any rate, you cherish fond memories of your<br />\ncollege days, and you have an interest in the activities of today<br />\nat Homewood; for that reason we have taken the liberty of<br />\nplacing you on our subscription list, and your name will continue<br />\nthere unless you send in the coupon below.<br />\nSubscription price is $2.50 per year, payable on or before<br />\nJanuary 1, 1922. Won't you back us up and help make the new<br />\nsemi-weekly a tremendous success?<br />\nG. P. Fallon,<br />\nCirculation Manager,<br />\nHomewood.<br />\nPlease remove my name from the subscription list of the<br />\nNews-Letter.<br />\n<br />\nWe're ready<br />\n$30 up<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\n<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\n<br />\nName<br />\n<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br />\n<br />\nDANCES<br />\n<br />\nBALTIMORE<br />\n<br />\nTelephone St. Paul 6987<br />\n<br />\nAddress<br />\nIT HAPPENS IN THE BEST OF<br />\nCOMEDY<br />\n<br />\n\"I'm afraid Jazzberry isn't a very<br />\ngood student.\"<br />\nFrosh—I know more about this \"What makes you think that?\"<br />\nthan the editor does.<br />\njoke<br />\nHe—We are coming to a tunnel;<br />\n\"I played him a practical joke last<br />\nHe—How long have you lived<br />\nSoph—That's possible.<br />\nare you afraid?<br />\nin this house?<br />\nFrosh—Sure ; he thought the Hallowe'en, and it wasn't until yescigar<br />\nthat<br />\ntake<br />\nyou<br />\nif<br />\nShe—Not<br />\nI<br />\nShe—None of your business.<br />\nstuff I submitted was original.— terday that he missed them!—<br />\nout of your mouth.—Awgwan.<br />\nFrivol.<br />\nChaparrel.<br />\nwas born here.—Jester.<br />\nFIRST MEETING OF THE J. H. U.<br />\nZIONIST SOCIETY TOMORROW<br />\n<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nThe first meeting of the Johns<br />\nHopkins Zionist Society will be held<br />\nWednesday, October 12, 1921, in<br />\nRoom 112, Gilman Hall, at 12:30.<br />\nDr. French will give an address.<br />\nHours will be arranged for holding<br />\na study circle in Zionist problems.<br />\nIt is also planned to organize a Hebrew-speaking group. During the<br />\ncourse of the year the Zionist society expects to have a series of<br />\nlectures or addresses by well-known<br />\nspeakers on topics of Zionist or general Jewish interest. Social affairs<br />\nwill also be provided for.<br />\nCollege Literature<br />\nJust at this time, when the ZionLOMBARD and SOUTH STREETS ists of the world are stirred to fever<br />\nheat over the apparently irreconcilable differences of outlook between the European and American<br />\nZionists, a study circle should be<br />\nTeach a Lesson in Style<br />\nespecially interesting. Then, too,<br />\nThey possess the \"dash\" that<br />\nis the question of the \"open<br />\nthere<br />\ntoned<br />\nappeals to college men,<br />\ndown to distinctiveness. And<br />\ndoor\" into Palestine, along with the<br />\nwearing qualities that provoke<br />\npressing problem of working out<br />\nenthusiasm.<br />\nrelations between the Arabs, BritN. HESS' SONS<br />\nish, native Christians and Jews. All<br />\n8 E. BALTIMORE ST.<br />\nthese questions will make food for<br />\nlively and interesting discussions at<br />\nthe weekly meetings. Everybody is<br />\nwelcome, and a large attendance is<br />\nconfidently expected.<br />\nMADE TO ORDER<br />\n<br />\nHess Shoes<br />\n<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nto you —Of all the other tobaccos NATURE has produced—none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\n<br />\nT<br />\n<br />\nel NI<br />\nNI<br />\n....................<br />\n<br />\n.•<br />\nIN ••<br />\n<br />\nUII MI' 0<br />\nNI • IllIII<br />\n<br />\n••••<br />\n..<br />\n<br />\n.<br />\n<br />\n4<br />\n<br />\nNone has the delicious<br />\nFLAVOR of the finestTurkish—<br />\nNone gives the ENJOYMENT cf the finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\nNone but the highest grade<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\nMURAD.<br />\n<br />\n74;Jf<br />\n<br />\nAll<br />\n<br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST—to reach<br />\nthe PEAK of Cigarette Quality<br />\n— you have but to smoke<br />\n<br />\n,<br />\n<br />\n. „ilstAlii\\NIIII.kw.,AILMII1Tia<br />\n<br />\n111<br />\n.-2\"tiliaVtill1111<br />\nI U IIII IPd III<br />\n<br />\n'1111<br />\n<br />\nS. ANARGYR0S.<br />\nW2viWol<br />\ntAk.\"..ifutii.k0h44.4ff-NWPCMVWW~ftlF,<br />\n<br />\nMURAD—<br />\n<br />\nTry<br />\n<br />\nMURAD<br />\n<br />\ntoday and<br />\n\"Judge for<br />\nYourself—!\"<br />\n<br />\n20c<br />\n<br />\nLEMMERT<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n<br />\n19 and 21 EAST FAYETTE ST.<br />\n<br />\n\"Have you 'The Truth About<br />\nthe Peace Conference ?'\"<br />\n\"Yes, madame, over in the Fiction Department.\"—Froth.<br />\n<br />\n\"I'm some wild boy. They<br />\nlet me in a cabaret last<br />\nwouldn't<br />\nir<br />\nnight.\"<br />\nUNIVERSITY MEN<br />\n\"How's that?\"<br />\nFor Sport Wear \"Closing time.\"—Jack o' LanFor Dress<br />\nSmart Styles—Best Leathers tern.<br />\nModerate Prices<br />\nSHOES<br />\n<br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br />\n<br />\nShe—No, John, you can't kiss<br />\nme. The Chimes are ringing twelve<br />\nand this is Sunday.—Gargoyle.<br />\n<br />\n„<br />\n<br />\nAlakasilkileqtyliatagiriA<br />\nwid Eiyowi-cipit..dhaat<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVI. No. 5<br /><br />\nBALTIMORE, MD., OCTOBER 18, 1921<br /><br />\nENGINEERING UNIT AT HOP- INTERCOLLEGIATE CONFER- COMPETITIVE<br />\nATHLETIC<br />\nKINS IS 20th TO BE ESTABENCE TO BE HELD AT<br />\nCONTESTS TO BE<br />\nLISHED IN COUNTRY<br />\nPRINCETON<br />\nHELD WEEKLY<br />\nBasic Year Same As Infantry Units. Representatives from Over 60 Colleges Will Embrace Competition in All Recognized Sports at University. First<br />\nWill Start With Present Sophand Universities in the East<br />\nTrial Wednesday.<br />\nomore Class.<br />\nWill Meet.<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS WINS FROM DICKINSON<br />\nIN THRILLING GAME<br />\nSCORE<br /><br />\nDOUBTFUL UNTIL FINAL WHISTLE. LOCALS<br />\nSHOWED GREAT FORM AND INSPIRED CONSTANT CHEERING FROM THE STANDS.<br /><br />\nIn a game replete with thrills, Johns Hopkins defeated Dickinson<br />\nCompetitive weekly contests,<br />\nAn Engineering Unit of the R. Steps have been taken by the<br />\nCollege, 6-0, at Homewood Saturday. The entire game was so in0. T. C. is being organized at the Senior Council of Princeton Uni- open to all students, and embracing teresting and the final score so in doubt<br />\nthat the cheering was almost<br />\nUniversity which will have as its versity to call an inter-collegiate all sports recognized at the Univer- continuous. Probably the largest crowd which<br />\nhas gathered at HomePurpose the training of reserve conference on the subject of dis- sity, will be held throughout the wood this season came out to witness<br />\nthe game and they were in no<br />\nEngineering officers just as the in- armament, to be held in Princeton coming year, according to Coach way disappointed. The contest<br />\nwas full of good football, every methLe Cato, of the track team. At the<br />\nfantry unit trains men for reserve on October 26th.<br />\nod almost being exploited at one time or another. Dickinson was<br />\ncommissions in the Infantry. This<br />\nThe proposal is to invite two rep- end of the year, five specially de- known to be strong in the overhead game, but most of her gained teris the twentieth organization of its resentatives each from over 60 col- signed medals will be awarded as<br />\nritory was on plunging, while Hopkins showed her adequate prepkind to be established in this leges and universities throughout prizes to the winners. The first aration for the collegians' attack by<br />\nmaking her only touchdown on a<br />\ncountry. Last year there were the East, and it is hoped in this trials will be held next Wednesday. forward pass. It was. a tense<br />\nmoment as the ball sped down from<br />\n3,300 students enrolled in similar manner to stimulate discussion<br />\nCoach Le Cato arranged for this Eric Calkins to \"Happy\" Middleton, standing<br />\nover the goal line with<br />\nengineering units _ at American among the undergraduate bodies of new feature of college athletics. Hopkins only score. The Black<br />\nand Blue continues to show improved<br />\ncolleges and universities. The these colleges and to deepen the in- The plan affords a splendid oppor- form and will give a good account<br />\non November 17th when St. John's<br />\ncourses prescribed by the Military terest in the whole question of the tunity for development of whatever fails to score. Much credit is due<br />\nthe Class of '25 and to Gilson Engel<br />\nDepartment are based upon the limitation of armaments.<br />\nlatent athletic ability may lie, un- for the splendid organized cheering Saturday both<br />\nin the stands and<br />\nassumption that the training of The duty of organizing<br />\nthe con- realized, in any student. It is on the field.<br />\ncivil and that of army engineers ference has been assumed<br />\nDuring the first quarter both and blocked the kick. Middleton<br />\nby the thought that the contests will tend<br />\nare much the same in character,<br />\nSenior Council of the University, to create a more universal interest teams seemed unable to gain and recovered the ball and ran 35<br />\nand will endeavor to instruct en- under whose auspices<br />\nit is to be in all-round sports, and will pro- kicked back and forth, Calkins yards to Dickinson's 11-yard line<br />\ngineering students in Military held. The Council has<br />\nappointed a vide more material for use on the having the edge on the visitors' before being downed. The fourth<br />\nEngineering subjects of funda- committee of six undergraduat<br />\npunter. The ball stayed in midfield down found five yards between<br />\nes various teams.<br />\nmental military importance. They who are to take charge<br />\nThe following events will be par- or in Dickinson territory and it the ball and the goal line, so Calof the orare to be made practical as far as<br />\nticipated in:<br />\nganization of this conference.<br />\nwas the middle of the second quar- kins made a pretty pass to MidPossible rather than theoretical. Invitations have<br />\ngone out to all<br />\nFootball: Punt for distance; ter before the Pennsylvanians dleton behind the goal for the lone<br />\nThe subjects which will be taught<br />\nmanaged to get the ball on Hop- touchdown. Calkins failed to kick<br />\nthe important colleges and univer- drop kick, and pass for distance.<br />\nthe first year are basic and will not<br />\nkins<br />\nground.<br />\nsities in the East, and a prospectus<br />\ngoal. The spectacular work of<br />\nBasket-ball: Foul shooting and<br />\ndiffer much from those of the InDickinson<br />\nwas forced to punt Middleton and McGill and the<br />\nand the proposed program have goal shooting back of 20-foot mark.<br />\nfantry Unit. The following is a list<br />\nagain, and McGill broke through consistent tackling of Knecht and<br />\nbeen sent to all who are expected<br />\nLacrosse: Goals at angle.<br />\nof the engineering courses to be<br />\nto participate in this conference. Swimming:<br />\nOne - lap swim DRAMATIC CLUB CANDI- Landy featured the half for the<br />\nstudied in addition to the courses<br />\nThe chief features consist of an (against time)<br />\nlocals, while Dailey, Templin and<br />\n;4-lap swim (against<br />\nof infantry instruction during the<br />\nDATES TO REPORT<br />\nPipa shone for the Carlisle Colleafternoon and an evening meeting, time).<br />\nsophomore, junior and senior<br />\nWEDNESDAY<br />\nto be addressed by prominent men<br />\ngians.<br />\nBaseball:<br />\nRunninc, bases Try-outs for One-act Plays to Be Held<br />\nyears:<br />\nwho have been invited to come for<br />\nIn the second half the CollegThursday. Three to Be Given<br />\n(against time) ; throw for distance.<br />\nSophomore—Engineer Organi- this purpose; and banquet<br />\nians<br />\ncame back strong and looked<br />\na<br />\nin the<br />\nin December.<br />\nTrack and Field. 100, 440, mile<br />\nzation, Care of Animals, Roads University dining halls. At the<br />\ndangerous several times. Captain<br />\nThe first meeting of candidates<br />\nand Bridges.<br />\nPipa made several first downs<br />\nafternoon meeting a resolution will runs; 120 low hurdles; discus<br />\nfor parts in the Dramatic Club<br />\nJunior—Coast Defenses, Demo- be introduced expressing to the throw; javelin throw: shot put;<br />\nhimself. Through the plunging of<br />\nlition, Military Railroads, General Government the sympathy of the high jump; broad jump, and pole productions will be held Wednes- Pipa and Templin and the Pipaday at 12.30 in its studio on the<br />\nConstruction.<br />\ncolleges of the country with the pur- vault.<br />\nGoetz passing, Dickinson penetop floor of the Barn. At this<br />\nContests in each sport will be held<br />\nSenior—Engineering Tactics, pose of the coming Washington<br />\ntrated to Hopkins' two-yard line,<br />\nmeeting the candidates will be<br />\nbut failed to score and the ball<br />\nConference, and solicitation for its during the season of that sport. The<br />\nMechanical Equipment.<br />\ngiven final instructions concernfootball<br />\ntrials<br />\nwill<br />\nbe<br />\nbegun<br />\nwent over. The spectacular feanext<br />\nNo engineering work will be successful conclusion.<br />\ning the try-outs which will be held<br />\ntures of the fourth quarter were<br />\ngiven juniors or seniors this year<br />\nThe gathering of college repre- Wednesday. Ten points will be Thursday afternoon.<br />\nthe gains of McCullough and the<br />\nbecause it is felt that they have sentatives, it is hoped, will stimulate counted for first place, nine points<br />\nAt these try-outs men will be<br />\nnot sufficient time left at the Uni- public interest in the coming Con- for second place, eight points for selected to enact the roles in the 55-yard run of Which Willis made<br />\nversity to complete the course of ference, and serve as a basis for third place and so on down to tenth one-act plays to be produced on before being downed by Shields<br />\non Dickinson's five-yard line.<br />\ninstruction. When a student fin- crystallization of public opinion in place, which will count one point.<br />\nthe night of December 7. The<br />\nHopkins was unable to turn anNo student will be eligible for plays will be \"Roadhouse<br />\nishes the training he will be given support of the Government. One<br />\nin Arother<br />\ntouchdown and after an exthe<br />\nlast<br />\nfive<br />\nevents<br />\nunless he has den\" and \"Death in Feber Flat.\"<br />\na commission in the Reserve of the chief results should be to enchange of kicks the end of the<br />\nCorps and assigned to a regiment gender wider discussion of the vital completed in eight of the first fif- Joseph<br />\nA. Moran has written a<br />\ngame found Dickinson with the<br />\nin this corps area. It is hoped that question of the limitation of arma- teen.<br />\nvery good sketch which will probthe students and faculty will co- ments in the colleges as well as outBecause of the wide range of the ably be produced at the same ball on their own 20-yard line.<br />\noPerate with the Military Depart- side through the wide publicity tests, it is thought that every man time.<br />\nSCORE BY QUARTERS<br />\nment in building up this branch of which will doubtless be given to the will have a chance to win a medal. It is essential that all<br />\n0 6 0 0— 6<br />\nmen who Hopkins<br />\nDickinson<br />\nthe R.0. T. C. to the present high movement in the college papers and Even if no prize is won, the con- want to become members of<br />\n0 0 0 0— 0<br />\nthe<br />\nLINEUP<br />\nstanding of the Infantry Unit.<br />\nthe metropolitan press.<br />\ntests should act as a fine mental and club attend the meeting WednesJOHNS<br />\nHOPKINS<br />\nDICKINSON.<br />\nphysical<br />\ntonic, and should stimu- day. The qualifications for mem- 1<br />\nIt is felt that on account of the<br />\nMiddleton ..L.E..... Crowley 16<br />\nMIDDLETON UNANIMOUSLY ELECTfact that during the war it was late a spirit of clean and healthful bership are hard to fill but par- 21 Westerman .L.T.. Blumenthal 24<br />\nED PRESIDENT OF JUNIORS<br />\nMagill<br />\nL G<br />\nCook 30<br />\nlargely the college men who com- competition greatly to the benefit ticipation in these plays will be 13<br />\n0 Totterdale<br />\nC<br />\nSmith 4<br />\nAt a meeting of the Junior Class<br />\nposed our army and bore the brunt of the individual and of Johns Hop- the stepping stone to biggel 8 Landy<br />\nR G<br />\nSayes 12<br />\nheld last Friday in the M. E. Hall,<br />\n4.Knecht ....R.T.... Sharpe 8<br />\nof the conflict, their endorsement of kins.<br />\nthings.<br />\n11<br />\nRich<br />\nR<br />\nE<br />\nGoeltz 10<br />\n\"Happy\" Middleton was unani6 Darley . .Q.B.... Pipa (c) 2<br />\na program of disarmament cannot<br />\nAll students, and especially the<br />\nmously elected president. The fol7<br />\nSpinney<br />\nL H B<br />\nDailey 36<br />\nbe misinterpreted and their ex- Freshmen, are invited by Coach Le DEAN<br />\nWARNS PHYSICAL 29 Willis ....R<br />\n.H.B. . Templin 18<br />\nlowing men were also elected class<br />\n14<br />\npressed opinion should carry con- Cato to appear at 5 o'clock next<br />\nCalkins ....F.B...Wertacni<br />\nTRAINING DODGERS<br />\n.•<br />\nk 22<br />\nofficers: Somerville, vice-president;<br />\nsiderable weight.<br />\nWednesday at the athletic field. It Coach Van Orman Makes Fiery<br />\nSubstitutions:<br />\nHopkins—Non<br />\ne. DickFenneman, secretary; Zoller, treasinson—Shields for Blumenthal, McCulSpeech.<br />\nJohns Hopkins has been request- is believed that the little time reurer; Cromwell, sergeant-at-arms.<br />\nlough for Dailey, Davis for McCullough,<br />\ned to send two representatives to quired will be more than compen- Dean Latane again addressed the Beighle for Wertacnik. Referee—<br />\nAt the same meeting 0. D. Col- the conference.<br />\nO'Brien. Umpire—Hogsett. Linesman<br />\nsated by the results.<br />\nstudent body on the question of —Hoban.<br />\nlins was elected associate business<br />\nphysical training at the mass-meetmanager of the Hullabaloo and Joe<br />\nheld last Thursday in the C. E.<br />\ning<br />\nENGEL TO HEAD SENIORS<br />\nJOHNSTON ELECTED PRESIDENT OF<br />\nMoran was elected associate editor.<br />\nCALLARD TO HEAD SOPHS<br />\nHall.<br />\nHe opened his talk by readCOTILLON BOARD<br />\nEngel<br />\nGilson<br />\nwas<br />\nelected presiBefore the elections the retiring<br />\nHenry Callard was elected the<br />\ning a list of men who had absences<br />\nChristopher Johnston was elected<br />\npresident, 0. D. Collins, read a let- dent of the Senior Class at a meetfrom physical training classes and president of the Sophomore Class<br />\nter from Dr. E. 0. Hulburt, honorpresident of the Cotillon Board,<br />\ning held in the Civil Engineering<br />\nsaid that all of these men must re- at the meeting held Thursday, Ocary president of the class last year.<br />\nwhich held the first meeting of the<br />\nport at ten o'clock Saturday morn- tober 13. Other officers are \"Buck\"<br />\nHall on Thursday, at 12:20. The<br />\nseason last Friday. Frederick W.<br />\nDr. Hulburt expressed his gratiing, prepared to make these up. Grace, vice president; Fitz Duntude for a pipe given him by the vice-presidency was garnered by Lipps was elected secretary and<br />\nFailure to report will mean suspen- ning, secretary, and George M.<br />\nclass last spring, and said that he \"Bill\" Totterdale, and Dorsey Wat- treasurer.<br />\nsion and positively no men will be Shriver, treasurer. It is possible<br />\ngreatly regretted not being back kins was successful in the race for<br />\nIt was decided to hold the first excused. In the future all absences that a re-election may be held, as<br />\n•<br />\nWith the class this year.<br />\nthese men were elected by a plusecretary. A. J. Noviasky<br />\nwas dance some time near Thanks- must be made up on Saturdays.<br />\ngiving.<br />\nmade treasurer and A. H. Knecht,<br />\nThe meeting, at this point, was rality and not a majority vote.<br />\nProfessor X—Who's there?<br />\nMembers of the board are J. B. turned over to the Student Council.<br />\nsergeant-at-arms.<br />\nBurglar—Lie still and keep quiet.<br />\nPowell,<br />\nD. K. Vanneman, David Emil Smith and Gilson Engel made<br />\nHe—Ruth is a mighty curious<br />\nAt the same meeting about 30<br />\nm looking for money.<br />\nThomas, Pierre Ghent, Theodore appeals for the support of the stu- girl, don't you think?<br />\nProfessor X—Wait, and I'll get men who are making their ,college Whitely and Brent Wells. The dent band and asked for a collecHim—I haven't found her so.<br />\nIT and look with you.—Orange course in three years were admitted non-fraternity member has not yet tion to be used for instruments<br />\nand<br />\nHe—That's<br />\nit. Neither have I.—<br />\nPeel.<br />\n..to the class.<br />\nbeen elected.<br />\nContinued on page 2, col. 1<br />\nTiger.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 18, 1921<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins<br />\nFOUNDED 1897.<br /><br />\nNews-Letter<br /><br />\nSTUDENT ACTIVITIES COUNCIL HAS GREAT DEAL<br />\nOF POWER<br /><br />\n$2.50 Administers Money of All Non-athletic<br />\nActivities. Awards Varsity Seal. Six<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nMen Given Seals This Year.<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nSubscription<br /><br />\nOur<br /><br />\nprep<br /><br />\nroom on the<br /><br />\n1.<br /><br />\nthird floor specializes in<br />\nclothes for young men.<br /><br />\nThe Varsity Seal Voting CounPublished semi-weekly from October to June by the students of Johns<br />\ncil, or as it has been recently reHopkins University.<br />\nStudent Affairs<br />\nBusiness communications should be addressed to the BUSINESS MAN- named, the<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Council, is an organization the exshould be sent to the MANAGING EDITOR.<br /><br />\n.2.<br /><br />\nHub<br /><br />\nistence and purpose of which is<br />\nBaltimore. Charles and Fayette<br />\nwhich<br />\nwields considerable influence and<br />\nBusiness Manager:<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON,'22<br />\npower.<br />\nFREDERICK W. LIPPS, '22.<br />\nActing Managing Editor:<br />\nThe Varsity Seal Voting Coun- GOOD SQUAD OUT FOR<br />\nYoung Men's Clothing<br />\nCirculation Manager:<br />\nWILLIAM H. MOORE, JR.<br />\ncil was formed in 1920 to provide<br />\nFOOTBALL<br />\nFRESHMAN<br />\nGLOVER P. FALLON, '23.<br />\nand Furnishings<br />\nAssociate Editors:<br />\nfor the recognition of college acGames<br />\nNo<br />\nEDWARD G. HUEY, '22.<br />\nReport.<br />\nTwenty-eight<br />\nMen<br />\nAdvertising Manager:<br />\ntivities other than athletic. There<br />\nELI FRANK, JR., '22.<br />\nScheduled Yet. Armstrong<br />\nDONALD K. VANNEMAN, '23.<br />\nAre made a special feature of<br />\nwas a tendency prior to the incorto Coach.<br />\nJunior Editors:<br />\nAssistant Business Managers:<br />\nhere.<br />\nporation of the council for each<br />\nCHARLES C. MARBURY, '22.<br />\nTwenty-eight first year men reBERNARD C. HEARN, '23.<br />\nLAWRENCE B. FENNEMAN, '23.<br />\nof the non-athletic activities to<br />\nJOHN C. LEWIS, '23.<br />\nJ. BRENTNALL POWELL, '23.<br />\nsponded last week to Coach Herb<br />\nmake separate awards to men<br />\nE.<br />\nCRAIG<br />\nTAYLOR, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nArmstrong's call for candidates Give us a call and let us become<br />\nwho had distinguished themselves<br />\nfor the Freshman football team. better acquainted for mutual<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nin their particular line of endeaAlthough the majority of the men<br />\nbenefit.<br />\nvor.<br />\nthe game,<br />\npractically<br />\nnew<br />\nat<br />\nare<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nTo offset this tendency, to pro- several of those who signed up<br />\nvide for a uniform award to all have made enviable records in<br />\nBALTIMORE, MD., OCTOBER 18, 1921<br />\nnon-athletic activities and to re- prep school. Coach Van Orman<br />\nstrict the distribution of this has delegated several first year<br />\naward the present Student Af- men who were out for the Varsity<br />\nFRICTION AGAIN<br />\nHoward at Lexington<br />\nOnce again the old friction between the Students and the Varsity fairs Council was instituted the to the Freshman squad and with<br />\nClub has broken out. That the A. A. Board was thoughtless and tact- award of the Student Affairs these as a nucleus the remainder<br />\nless at its last meeting we freely admit, but any symiathy we felt for Council is a miniature reproduc- should quickly develop under<br />\nthe Varsity Club was squelched by the speech made to the football tion of the University seal in gold Coach Armstrong's able tutelage<br />\nsquad by their representative. Many conflicting reports of this ad- mounted on a rectangular back- into a well-balanced combination.<br />\ndress have been received, but all unite in condemning it as the most ground, upon the back of which is<br />\nUY or rent a Corona<br />\nAt Dr. Van Orman's request<br />\ntypewriter on easy<br />\ntactless and insulting oratorical effusian ever heard on Homewood engraved the name of the recipient<br />\narbeen<br />\nno games as yet have<br />\npayments. Carry it to<br />\nField, and the extent to which it has damaged the morale of the team along with that of the activity in<br />\nschool every day in its<br />\nranged for the Freshmen. Weekly<br />\nneat case. Make extra<br />\nwhich he won the seal.<br />\ncan not be estimated.<br />\nscrimmages, however, will be armoney writing articles or<br />\nThe Varsity Club and the Students must pull together for HopWith the establishment of the an 0-ed with local hioth schools and<br />\ndoing typing for others!<br />\n6<br />\nCall today at the nearest<br />\nkins, but we do not believe that they will ever succeed in doing so non-athletic fee the powers of the<br />\nit is probable that several games<br />\nCorona store—or telewhile the club is under the present management.<br />\nStudent Affairs Council were will be scheduled before the anptione for a demonstration at your home.<br />\ngreatly increased. Besides the du- nual Freshman-Sophomore tilt.<br />\nties previously stated the council The following Freshmen have sigCOACH LE CATO'S PLAN<br />\nM. W. LUCY &amp; CO.<br />\nAn excellent method of discovering hidden athletic ability is now has charge of the collection, nified their intention of trying foi<br />\n118 W. Fayette St.<br />\nshown in Coach Le Cato's plan for weekly competitive athletic con- distribution and disbursement of the team:<br />\nWeir,-hs GM lbs.<br />\ntests. Many men come to college imbued with the idea that they all funds received by the HullabaFolds and fits<br />\nBolsam, Bates, Berkeley, Brewin a neat carryhave no ability in the athletic line. Many men have discovered too oo, News-Letter, Black and Blue<br />\ning case.<br />\ner, Brawner, Calhoun, Carper,<br />\nBulletin,<br />\nDramatic<br />\nDaily<br />\nJay,<br />\nlate that they have a natural capacity in some sport.<br />\n$nn<br />\nDorsey, Fargo, Frazer, Gump,<br />\nu‘i case<br />\nBesides providing material for Varsity teams these contests Club, Musical Club, Debating<br />\nJones, Kirkeley, Koff, Lockwood,<br />\npurand<br />\nY.<br />\nM.<br />\nC.<br />\nA.<br />\nNo<br />\nshould stimulate a spirit of clean and healthful competition that -Will Council<br />\nMcCleary, Moehle, Richardson,<br />\nprove to the advantage of Hopkins and the individual. All Hopkins chases. can be made by any of<br />\nSkinner, M., Skinner, R., Spurstudents should take advantage of the opportunity and respond to these activities without the ap- rier, Steck, Summers, Towner,<br />\nThe Personal Wnting Machtne<br />\nCoach Le Cato's invitation and compete weekly in these contests. proval of the chairman and treas- Watson, Willison, Larzeux; Berurer of the council.<br />\ngen.<br />\nATTENTION TO RULE I, FRESHMEN<br />\nAn accurate system of bookThe first rule of the Freshmen regulations requires that \"within keeping is kept by the treasurer,<br />\nand with the approval of the Vottwo weeks after the beginning of the college year every Freshman John Myers, under which each ac- editor, the associate editor who,<br />\ning Council.<br />\nmust be actively participating in some recognized student activity or tivity has an account, the liabili- at the time of receiving the seal,<br />\ne. Debating Team: The followmust present to the Student Council some logical excuse for not ties and assets of which may be shall have been active members<br />\nmen shall be awarded the Varng<br />\nof the editorial board for at least<br />\ndoing so.\" Today is the last day of the two weeks allowed, yet there ascertained at any time.<br />\nsity Seal: Those members who,<br />\nare a number of Freshmen who have failed to report for any ac- The Student Activities Council is two years. From the Business through competition,<br />\nwin a place<br />\ntivity. The regulation certainly imposes a hardship upon no one. composed of representatives from Board: the business manager, the<br />\nUniversity<br />\nDebating Team<br />\non the<br />\nThose offenders who have purposely evaded the law should be dealt the six accredited nonathletic ac- circulation manager, the assistant<br />\nand represent the university in<br />\nwith ,if anything, more severely than those who have merely broken tivities and the Daily Bulletin and business managers who at time<br />\none or more intercollegiate desome minor rule. The list of activities at Hopkins offers opportuni- V. M. C. A. The officers are H. of receiving the seal shall have<br />\nbates in one yew'.<br />\nties to every man—infant prodigies and near-Methuselahs as well. Douglas Cotton, chairman; Fred been active members of the busif. Dramatic Club: The followWorse than the conscientious objector is the man who hands in W. Lipps, Jr., secretary, and John ness staff for at least two years.<br />\ning men shall be awarded the Varhis name for an activity, having at the time no intention of giving that Myers, treasurer. The members<br />\nb. Hullabaloo: The following sity Seal: The president, treasactivity his ablest support. Several such men have announced their are Dorsey Watkins and E. G. men shall be awarded the Varsity<br />\nurer and production manager;<br />\ncandidacy for positions on both the editorial and the business boards Huey of the Hullabaloo, Paul S. Seal at the end of their junior<br />\nthose members who have made a<br />\nof the News-Letter. Unless these men give satisfactory support to Jones and Quentin Singewald of year, provided they have gained<br />\npart of at least 25 lines, standard<br />\ntheir respective boards they will be reported to the Student Council the Black and Blue Jay, William their offices through the usual<br />\nrehearsal edition and have pareditorand will fail to receive their protective activities button.<br />\nH. Moore and Fred W. Lipps, Jr. public class elections: The<br />\nticipated and appeared in the pubIt's a case of dodging the prevention or dodging the cure, of the News-Letter; Lawrence B. in-chief, the business manager and<br />\nlic presentation of the club, for<br />\nFreshie, so we'd suggest dodging the paddles.<br />\nFenneman and Parker C. Wil- two more senior members of the two collegiate years.<br />\nliams of the Debating Council, board (at the end of junior year,<br />\nDEAN WARNS PHYSICAL<br />\nCouncil next Monday and Tuesday Gilson Engel and H. Pierce Brow- or when nominated by the editorTRAINING DODGERS<br />\nDan—Let's elope—<br />\nat the Barn.<br />\nner of the Dramatic Club, and in-chief), upon the nomination of<br />\nContinued from page I, col. 4<br />\nAnn—Sure.<br />\nCoach Van Orman made a short Waldo Hambleton and Hugh the editor-in-chief and with the<br />\ncouncil. And get married.<br />\nuniforms. \"A collection for the and somewhat fiery appeal, urging Smallwood of the Musical Club. approval of the voting<br />\nOh, dear! How conventional you<br />\nIt is the desire of the council to Section 3, Art. 2a.<br />\nstudent band,\" Engel said, \"will riot all undergraduates to come out to<br />\nC. Black and Blue Jay: The fol- are.—Froth.<br />\nhe gone in one week, as one for a the games and give the team some have the Varsity Seal a coveted<br />\nhired band, but would remain as a real support. The cheer leaders honor representing in nonathletic lowing men shall be awarded the<br />\nHe—Woman is loveliest in her<br />\npermanent investment.\" The stu- then took charge of the meeting. activities what the \"H\" does in Varsity Seal: The editor-in-chief,<br />\nthirties.<br />\ndent body responded to this appeal Gilson Engel said that the coach athletics. Recently Varsity Seals managing editor, business manShe—Thank—I mean, do you<br />\nto the tune of seventy dollars. An- wanted the students to come out to were voted to Lawrence B. Fen- ager, circulation manager and not<br />\nthink so?—Purple Cow.<br />\nnouncements were then made call- the field and cheer the team every neman, Joseph A. Moran, H. more than three from the ediing for men for the dramatic and Friday afternoon. He and Joe Douglas Cotton, Quentin Singe- torial staff and two from the busiBarber (to sleepy customer)—I<br />\nmusical clubs, and Mr. Kistler asked Thompson outlined a plan for ar- wald and Paul L. Jones of the ness staff upon the nomination of cannot shave you, sir, unless you<br />\nfor men who would try to sell sea- ranging the student body in the Black and Blue Jay and Moreno the Board of Control.<br />\nhold up your head.<br />\nd. Musical Clubs: The followson tickets for the remaining foot- form of a large H. both in the stand Badello of the Dramatic Club.<br />\nSleepy Customer—All right, give<br />\nThe qualifications for the award ing men shall be awarded the Var- me a hair cut, then.—Jcster.<br />\nball games. Dick Wood announced and on the field between the halves,<br />\nthat by next Tuesday all Freshmen at Saturday's game. A new Hul- of the Varsity Seal are as follows: sity Seal: The president, the dia. News-Letter: The following rector and the manager, and not \"Mary, are you going to wear an<br />\nmust be engaged in some under- labaloo yell with several pauses and<br />\ngraduate activity and all those who a whistle-boom yell, which would men shall be awarded the Varsity more than four members of two evening gown to the Prom?\"<br />\nwant advice or have any excuses follow up the kick-off, were pre- Seal. From the Editorial Board: years' standing, upon the nomina- \"Not so you could notice it\"—<br />\nthe editor-in-chief, the managing tion of the president and director, Wag Jag.<br />\ncan meet members of the Student sented and both made a big hit.<br />\nTelephone<br /><br />\nHomewood 100 not widely known, but<br /><br />\n3<br /><br />\n4.<br /><br />\ns.<br /><br />\n6.<br /><br />\nTEWART&amp;G,<br /><br />\n03 Cartitection With James AftCrien/(3 CO-.<br /><br />\nYork<br /><br />\nTeachers.<br /><br />\n8<br /><br />\nB<br /><br />\n10<br /><br />\n11<br /><br />\nCopoNA<br /><br />\n12<br /><br />\n1,<br /><br />\n1<br /><br />\nTHE JOHNS H0PKINS NEWS-LETTER, OCTOBER 18, 1921<br /><br />\n22. That the one-act plays written<br />\nORDERS RECEIVED FOR<br />\nthe<br />\nmembers<br />\nby<br />\nof<br />\nthe Dramat(With apologies to Drs. H. L. Mencken<br />\n. COGGINS'<br />\nic Club are all worthy of publi- Transfer and Baggage<br />\nand George Jean Nathan.)<br />\nExpress<br />\ncation in the Smart Set maga1. That Dr. Goodnow is the real<br />\nAUTOMOBILE SERVICE<br />\nzine.<br />\nPHONE, HOME WOOD 2645-W<br />\ndictator of the Republic of China, and manages affairs there 23. That histrionically, Holmes<br />\nthrough Dr. Willoughby.<br />\nBoyd is a second Julian Eltinge.' ANNUAL DEBATE MAY BE HELD<br />\n2. That Physics is the hardest<br />\nMARCH 4th<br />\n24. That the freshman who gets a<br />\ncourse in the university, and<br />\nhigh mark in an intelligence test<br />\nThe Debating Council held a<br />\nthat seven-eights of those who<br />\nis necessarily a superior sort of meeting Friday at which the protake it fail.<br />\nindividual.<br />\nposal of North Carolina University<br />\nThat the NEWS-LETTER iS the<br />\nto<br />\nhold the annual triangular debate<br />\nbest college newspaper in the 25. That Mr. Ball has a memory as<br />\nlong as an elephant's, and can between Johns Hopkins, WashingUnited States.<br />\nremember the full name of ton and Lee, and North Carolina on<br />\n4. That if you say Harvard or<br />\nevery student that has been at March 4th, was passed upon favorPrinceton or Yale to a,savage<br />\nably. Charles C. Marbury was apin darkest Africa, he will shake<br />\nHopkins since 1887.<br />\nhis head; but if you mention<br />\npointed chairman of a committee<br />\nnotwithstanding<br />\nDr.<br />\nHopkins he will immediately 26. That<br />\nto arrange the Freshman-SophoSwartz's somewhat advanced<br />\nsmile and draw a picture of a<br />\nmore debate. Since it is planned<br />\nphysician and a saw.<br />\nyears he can outwalk any athlete<br />\nto hold the debate early in Decems. That the undergraduate who in the university.<br />\nber, the presidents of these classes<br />\ndoes not speak disparagingly of<br />\n27. That the compilers of this Credo will be asked to appoint committees<br />\nhis professors is wholly lacking<br />\nare damned idiots, and have pe- to confer with Marbury concerning<br />\nin sophistication.<br />\nculiar notions of what's funny. the arrangement of the debate.<br />\n6- That Dr. Broadus Mitchell is<br />\na Baptist and attends church<br />\nregularly.<br />\n7. That the freshman who gets an<br />\nA on an English composition<br />\ntheme is _a coming literary<br />\ngenius.<br />\nTHE HOPKINS CREDO<br /><br />\n-ne<br /><br />\nORTMAN'S<br />\n\"Queen Quality\" Home Made Chocolates<br />\nVISIT OUR ICE CREAM PARLORS<br /><br />\n3<br />\nMt. Vernon 4999<br /><br />\nW.L. Mann<br /><br />\n518 N. CHARLES STREET<br /><br />\nCommercial Photography<br /><br />\nChelsea Pharmacy<br />\nCharles and 22nd Sts.<br />\nDelicious Sodas and Sundaes<br />\nThe Best of Candies<br />\nPrompt 8z Efficient Service<br /><br />\nCircuit Photography<br />\nFlash Lights<br />\nViews<br />\nGroups<br />\nEnlargements<br />\nKODAK FINISHING<br />\n325 N. Howard St.<br /><br />\nThe College Drug Store R.G.Loy &amp; Company<br />\nST. PAUL &amp; 24th STS.<br /><br />\n1 W. University Parkway<br /><br />\nC. D. Wolfe, Prop.<br /><br />\nOpposite J. H. U. Athletic Field<br /><br />\nDELICIOUS SODAS &amp; SUNDAES<br />\nMade With<br />\nJersey Special Ice Cream<br />\n\"The Velvet Finish\"<br /><br />\nDRUG STORE for J. H. U. BOYS<br /><br />\nKODAKS<br /><br />\nPHONE, HOMEWOOD 2121<br /><br />\nCAMERAS<br /><br />\nSUPPLIES Buy an (11) Pipe made special<br />\nfor the Boys<br />\nWhitman's Chocolates and Bon Bons<br /><br />\nHe—How do you like my voice \"John, what is a synonym ?\"<br />\nin comparison with Caruso's ?<br />\n\"A synonym is a word you use<br />\nShe—He is good but your's is when you can't spell another.\"—<br />\nbetter still.—Mugwunzp.<br />\nMedley.<br />\n•<br /><br />\n8- That a great many of the professors of Hopkins are wealthy<br />\nmen and serve without accepting salaries<br />\n9- That the Black and Blue Jay is<br />\nstill very young and immature.<br />\nbut that by the end of this year<br />\nit will surpass the Princeton Tiger and the Harvard Lampoon.<br />\n10. That since Dr. French once<br />\nPlaced Kipling's \"Years Between\" and Ibanez's \"Four<br />\nHorsemen\" on the reading shelf<br />\nthey are to be regarded as classics.<br />\n11. That the student who goes to<br />\nHighlandtown to see a girl is<br />\nan apt subject for ridicule.<br />\n12. That while it takes great perseverance and hard work to get<br />\nan engineering degree, almost<br />\nany fool can loaf through the<br />\nacademic department.<br />\n13- That the Hopkins R. 0. T. C.<br />\nunit is the best in the United<br />\nStates.<br />\n14- That Gilman Hall looks exactly<br />\nlike Independence Hall in Philadelphia.<br />\n15- That Adike Bowers is highly<br />\nproficient in the art of swearing, and on one occasion cussed<br />\nfor half an hour straight without repeating when informed<br />\nthat \"Ma\" Greene had flunked<br />\nhim in English Lit. 1.<br />\n16.<br />\nThat while students go to other<br />\nuniversities to have a good time,<br />\neveryone comes to Hopkins to<br />\ngain an education by hard work.<br />\n17- That the Black and Blue Jay<br />\nis a humorous periodical.<br />\n18.<br />\nThat Dr. Francis Dominic Murnaghan is a secret agent for the<br />\nSinn Fein, and signals his coconspirators with various colored ties.<br />\n19- That all Goucher girls, with the<br />\nexception of a very few freshmen, are uniformly ugly.<br />\n20. That anyone seen in the botanical gardens after nine o'clock<br />\nat night is there for nefarious<br />\nand unethical purposes.<br />\n21. That anyone who has passed an<br />\nentire evening at the M-u-t<br />\nR-y-1 C-n-t-y C-b is a sophisticated man of the world and will<br />\nnot be shocked by any debaucheries.<br /><br />\nNikola Tesla<br />\nHE NAME of Nikola Tesla, will always<br />\nbe associated with the invention and earlier<br />\ndevelopments of the induction motor. In fact,<br />\nat one time this type of apparatus was known<br />\nalmost exclusively as the \"Tesla\" motor.<br />\nTesla devised this motor back near the beginnings of the electrical business, when practically everything was built by \"cut and try\"<br />\nmethods,and none of the accurate analytical processes of later days had been developed. It may be<br />\nsaid broadly that Tesla knew two fundamental<br />\nfacts—first, that if a magnet were moved across<br />\na sheet of conducting metal, it would tend to<br />\ndrag this metal along; and,—second, that the<br />\neffects of such a moving magnet could be produced by suitably disposed polyphase currents<br />\nacting on a stationary magnetic structure.<br />\nPerhaps others, at that time, also knew these<br />\ntwo facts, but if so, apparently they knew them<br />\nonly as two isolated facts. Tesla considered<br />\n,them in combination and the result was the<br />\nTesla motor, or what is now known broadly as<br />\nthe \"induction motor.\" These two facts, in<br />\ncombination, represent a fundamental conception, and all of the many millions of horsepower<br />\nof induction motors in use today throughout the<br />\nworld, are based upon these two fundamentals.<br />\nNaturally, Westinghouse, having fought single<br />\nhanded to advance the alternating current system,<br />\nwas supremely interested in the new type of<br />\nmotor. What if the new motor did require<br /><br />\nT<br /><br />\npolyphase circuits, while all existing circuits<br />\nwere single phase? What if it did require<br />\nlower frequency than any existing commercial<br />\ncircuits? These were merely details of the future<br />\nuniversal alternating system. The important<br />\nthing was to obtain an ideally simple type of<br />\nalternating current motor, which Tesla's invention offered. Tesla furnished the fundamentalidea.<br />\nHe and his associates, working for Mr. Westinghouse, proved that thoroughly operative<br />\ninduction motors could be built, provided suitable<br />\nfrequencies and phases were available. What<br />\nmatter if they did not produce an operative<br />\ncommercial system at the time? What matter if<br />\nit needed the powerful analytical engineers of<br />\nlater date to bring the system to a truly practicable stage—men with intimate constructive<br />\nknowledge of magnetic circuits—men on intimate<br />\nterms with reactive coefficients and other magnetic<br />\nattributes totally unknown to Tesla and his coworkers? In time the motor was made commercial, and it has been a tremendous factor in<br />\nrevolutionizing the electrical industry.<br />\nProbably no one electrical device has had more<br />\nhigh-power analytical and mathematical ability<br />\nexpended upon it than the induction motor.<br />\nThe practical result has been one of the simplest<br />\nand most effective types of power machinery in<br />\nuse today. Thus Tesla's fundamental ideas and<br />\nWestinghouse's foresight have led to an enormous<br />\nadvance in the world's development.<br /><br />\nTHE JOHNS HOPKINS NEWS-LET TER, OCTOBER 18, 1921<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\nImporters and Dealers in Fine Books<br /><br />\n301 N. CHARLES ST.<br />\nBaltimore, Md.<br /><br />\nClit eXatterele)<br />\n\"14MES H.&amp; OSCAR G.1-5Nri<br />\nOWNERS<br />\nilbE*1111.0e4 VIPS*<br /><br />\n29 Baltimore St., East<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br /><br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\n300 N. HOWARD ST., Baltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br /><br />\nIt's time for a<br /><br />\nATTENTION ALUMNI!<br />\nTHE NEWS-LETTER NEEDS YOUR SUPPORT<br /><br />\nFALL SUIT<br /><br />\nThe News-Letter, as you know, is edited and published by<br />\nit gives the University news, and it gives all of it.<br />\nstudents;<br />\nthe<br />\nfew years in which the University has been<br />\nlast<br />\nDuring the<br />\nsteadily growing it has been very loyally supported by the student body. We have reached the time now, where the Board<br />\nfeels it is desirable to issue the NEWS-LETTER each Tuesday<br />\nand Friday during the collegiate year. And so, for the first time, it<br />\nis being done this year, at a cost of about $4,800.<br />\nAppearing twice a week will enable the editors to give advance notice of all games, meetings, lectures and other interesting gatherings, as well as an immediate and complete account<br />\nfor the benefit of those unable to attend. We know you are interested in Hopkins' activities, in the progress of the dorms, in<br />\nthe football team, lacrosse team, debating team, Dramatic Club,<br />\netc. Perhaps you were a member of one of our championship<br />\nlacrosse teams—at any rate, you cherish fond memories of your<br />\ncollege days, and you have an interest in the activities of today<br />\nat Homewood; for that reason we have taken the liberty of<br />\nplacing you on our subscription list, and your name will continue<br />\nthere unless you send in the coupon below.<br />\nSubscription price is $2.50 per year, payable on or before<br />\nJanuary 1, 1922. Won't you back us up and help make the new<br />\nsemi-weekly a tremendous success?<br />\nG. P. Fallon,<br />\nCirculation Manager,<br />\nHomewood.<br />\nPlease remove my name from the subscription list of the<br />\nNews-Letter.<br /><br />\nWe're ready<br />\n$30 up<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br /><br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br /><br />\nName<br /><br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br /><br />\nDANCES<br /><br />\nBALTIMORE<br /><br />\nTelephone St. Paul 6987<br /><br />\nAddress<br />\nIT HAPPENS IN THE BEST OF<br />\nCOMEDY<br /><br />\n\"I'm afraid Jazzberry isn't a very<br />\ngood student.\"<br />\nFrosh—I know more about this \"What makes you think that?\"<br />\nthan the editor does.<br />\njoke<br />\nHe—We are coming to a tunnel;<br />\n\"I played him a practical joke last<br />\nHe—How long have you lived<br />\nSoph—That's possible.<br />\nare you afraid?<br />\nin this house?<br />\nFrosh—Sure ; he thought the Hallowe'en, and it wasn't until yescigar<br />\nthat<br />\ntake<br />\nyou<br />\nif<br />\nShe—Not<br />\nI<br />\nShe—None of your business.<br />\nstuff I submitted was original.— terday that he missed them!—<br />\nout of your mouth.—Awgwan.<br />\nFrivol.<br />\nChaparrel.<br />\nwas born here.—Jester.<br />\nFIRST MEETING OF THE J. H. U.<br />\nZIONIST SOCIETY TOMORROW<br /><br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nThe first meeting of the Johns<br />\nHopkins Zionist Society will be held<br />\nWednesday, October 12, 1921, in<br />\nRoom 112, Gilman Hall, at 12:30.<br />\nDr. French will give an address.<br />\nHours will be arranged for holding<br />\na study circle in Zionist problems.<br />\nIt is also planned to organize a Hebrew-speaking group. During the<br />\ncourse of the year the Zionist society expects to have a series of<br />\nlectures or addresses by well-known<br />\nspeakers on topics of Zionist or general Jewish interest. Social affairs<br />\nwill also be provided for.<br />\nCollege Literature<br />\nJust at this time, when the ZionLOMBARD and SOUTH STREETS ists of the world are stirred to fever<br />\nheat over the apparently irreconcilable differences of outlook between the European and American<br />\nZionists, a study circle should be<br />\nTeach a Lesson in Style<br />\nespecially interesting. Then, too,<br />\nThey possess the \"dash\" that<br />\nis the question of the \"open<br />\nthere<br />\ntoned<br />\nappeals to college men,<br />\ndown to distinctiveness. And<br />\ndoor\" into Palestine, along with the<br />\nwearing qualities that provoke<br />\npressing problem of working out<br />\nenthusiasm.<br />\nrelations between the Arabs, BritN. HESS' SONS<br />\nish, native Christians and Jews. All<br />\n8 E. BALTIMORE ST.<br />\nthese questions will make food for<br />\nlively and interesting discussions at<br />\nthe weekly meetings. Everybody is<br />\nwelcome, and a large attendance is<br />\nconfidently expected.<br />\nMADE TO ORDER<br /><br />\nHess Shoes<br /><br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nto you —Of all the other tobaccos NATURE has produced—none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br /><br />\nT<br /><br />\nel NI<br />\nNI<br />\n....................<br /><br />\n.•<br />\nIN ••<br /><br />\nUII MI' 0<br />\nNI • IllIII<br /><br />\n••••<br />\n..<br /><br />\n.<br /><br />\n4<br /><br />\nNone has the delicious<br />\nFLAVOR of the finestTurkish—<br />\nNone gives the ENJOYMENT cf the finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\nNone but the highest grade<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\nMURAD.<br /><br />\n74;Jf<br /><br />\nAll<br /><br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST—to reach<br />\nthe PEAK of Cigarette Quality<br />\n— you have but to smoke<br /><br />\n,<br /><br />\n. „ilstAlii\\NIIII.kw.,AILMII1Tia<br /><br />\n111<br />\n.-2\"tiliaVtill1111<br />\nI U IIII IPd III<br /><br />\n'1111<br /><br />\nS. ANARGYR0S.<br />\nW2viWol<br />\ntAk.\"..ifutii.k0h44.4ff-NWPCMVWW~ftlF,<br /><br />\nMURAD—<br /><br />\nTry<br /><br />\nMURAD<br /><br />\ntoday and<br />\n\"Judge for<br />\nYourself—!\"<br /><br />\n20c<br /><br />\nLEMMERT<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br /><br />\n19 and 21 EAST FAYETTE ST.<br /><br />\n\"Have you 'The Truth About<br />\nthe Peace Conference ?'\"<br />\n\"Yes, madame, over in the Fiction Department.\"—Froth.<br /><br />\n\"I'm some wild boy. They<br />\nlet me in a cabaret last<br />\nwouldn't<br />\nir<br />\nnight.\"<br />\nUNIVERSITY MEN<br />\n\"How's that?\"<br />\nFor Sport Wear \"Closing time.\"—Jack o' LanFor Dress<br />\nSmart Styles—Best Leathers tern.<br />\nModerate Prices<br />\nSHOES<br /><br />\nWYMAN<br />\n19 W. LEXINGTON ST.<br /><br />\nShe—No, John, you can't kiss<br />\nme. The Chimes are ringing twelve<br />\nand this is Sunday.—Gargoyle.<br /><br />\n„<br /><br />\nAlakasilkileqtyliatagiriA<br />\nwid Eiyowi-cipit..dhaat<br /><br />"}], "field_media_file": [{"target_id": 37539, "display": null, "description": null, "target_type": "file", "target_uuid": "217844e9-67df-4ff4-bc0a-4d9a1acfb1d9", "url": "http://digital.library.jhu.edu/system/files/2022-03/12959-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12959, "target_type": "node", "target_uuid": "9cc939d9-5eb3-4d28-88e8-cc89788373c4", "url": "/node/12959"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3a5b53a1-dc20-4d9f-8596-5f83e57b3bad"}]}