{"mid": [{"value": 35642}], "uuid": [{"value": "ca5454a7-7ba4-4012-90e8-82c31674b4fc"}], "vid": [{"value": 35642}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12188-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "October 23/ 1901.<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press,<br />\n<br />\nMIALTimORE, PAD.<br />\nI.<br />\n<br />\nTwenty-Si xth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n.<br />\n<br />\nIRA REMSEN.<br />\nWM. H. HOWELL.<br />\nEDW. II. GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n•<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree Of IL A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\n..... .<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n100,000 volumes.<br />\n135,(0) volumes.<br />\n200.000 volumes.<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nBernsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfkld<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. II. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br />\n<br />\nIra<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\n<br />\nAmerican Journal of Mathematics,<br />\nF. MOlt LEY, Editor. Quarterly. 4th. Volume XXIV<br />\nin progress. $5 per volume.<br />\nII. American Chemical Journal.<br />\nI. HEMMEN, Editor. Monthly. 8vo. Volume XXVI<br />\nIn progress. $5 per volume.<br />\nIII. American Journal of Philology.'<br />\nB. L. GILDERSLEEVE., Editor. Quarterly. 8vo.<br />\nVolume X XII in progress. ti per volume.<br />\nIV. Studies from the Biological. Laboratory. 8vo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. fivo. Series X IX In progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of sAentific awl literary work<br />\nin progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. $1 per year.<br />\nyin. Johns Hopkins Hospital Reports. 4th. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Ileitrage znr A ssyriologie, etc.)<br />\nVol. TV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. Illi(X)KS, Editor. Volume IV complete. $7.60<br />\nper volume.<br />\nXL Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.60 per volume,<br />\nXil. Journal of Experimental Medicine.<br />\nW. FT. WELCH, Editor.<br />\n8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nH EN RY M. H U D, Editor. Quarterly. 4to., th per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\n' WILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\nSvo. Volume VI in progress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by tho President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academie year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic 'year.<br />\n<br />\nGroups.<br />\nI. Classical (the \"Old College Course.\")<br />\n2. Mathematical Physical, •<br />\n(leading up tA) Engineering.)<br />\n3. Chernical-Biological.<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5, Latin Mathematical.<br />\nIS, Historical- Political.<br />\n(leading up to Law.)<br />\n1, Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics (vol. XXIV.)<br />\nPrank. Morley.<br />\nChemistry (vol. XXVI).<br />\nIra Bentsen.<br />\nPhilology (vol. XXII.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. XIX.)<br />\nJ. M. Vincent.<br />\nModern Languages(vol. XVI.)<br />\nA. Marshall Elliott.<br />\nBiology (vol. IV.)<br />\nWilliam K. Brooks.<br />\nAmmyriology (vol. IV.)<br />\nPaul Haupt.<br />\nExperimental Medicine(vol. VI.) W. H. Welch.<br />\n<br />\nIn addition to the seria Is above named,copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowlantrs Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fnc-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MS with Antilegomena Epistles. Edited by!. H. Hall. $3.00.<br />\nIlibliographia Hopkinsiensis. Pert I. Philology. Parts<br />\nChemistry, Mineralogy and neology. Parts<br />\nIV- V7 VI.Physics, Astronomy and Mathematics.<br />\n8 ye. 81) cents per part.<br />\nfl full list of publications will be sent on application.<br />\n<br />\nProgrammes of the Courses offered to graduate students in Philosophy and the Arts, and In the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nCommunications in respect to exchanges and remittands<br />\nman be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nOCTOBER 23, 1901.<br />\n<br />\nNo, 2.<br />\n<br />\nTHE SAVING SENSE OF HUMOR.<br />\nHERE are certain gifts which are necessary to the writer of poetry or<br />\nfiction. These need not he enumerated, since they are of common<br />\nknowledge; but among them is one which is seldom recognized as a<br />\nneed, yet without which no man or woman ever did consistently great work.<br />\nThis is the sense of humor, or, to put it more clearly for our purpose, the<br />\nrecognition and appreciatior of the ridiculous.<br />\nThere have been great writers who have been great and yet lacked the sense<br />\nof humor; but this was in despite of such lack. Wordsworth is a conspicuous<br />\nexample. Had he been possessed of appreciation of the ridiculous, he had never<br />\nwritten \"The Idiot Boy- or \"We Are Seven\"—that apotheosis of the absurdly<br />\nso can<br />\nmawkish. Yet we could ill have spared Wordsworth at his best, and<br />\nof a<br />\nexample<br />\nforgive and try to forget his worst. Tennyson furnishes another<br />\nsufproof<br />\nis<br />\ngreat poet destitute of the sense of humor; \"The Skipping Rope\"<br />\nas<br />\nmen<br />\nsuch<br />\nficient that he did not know the ridiculous when he saw it. Upon<br />\nand<br />\n,<br />\npernicious<br />\nthese, the effect of the lack of this desirable sense was rarely<br />\nwas often actually admirable by adding to their self-seriousness and therefore<br />\nto their earnestness. Byron, on the other hand, who had a keen sense of the<br />\nwhich<br />\nridiculous, was often betrayed by that sense into a flippancy and unreality<br />\nhimtake<br />\ndetracted from the value of his work. We feel that the poet did not<br />\nThe<br />\nexample.<br />\nself seriously, and we are therefore constrained to follow his<br />\nhumor.<br />\nof<br />\nhighest earnestness does not seem to be compatible with an acute sens<br />\nminor<br />\nBut we have no Wordsworths and Tennysons today; and in the<br />\nWithout<br />\nranks sense of humor is absolutely necessary to avoid fatal error.<br />\nthis saving grace, there is always peril of the sublime overstepping the space<br />\nwhich separates it from the ridiculous. Earnestness is a most admirable<br />\nand<br />\nquality, and, when coupled with overwhelming power, may sweep over<br />\ncommenpast all obstacles without let or hindrance; but if the strength be not<br />\nsurate with the earnestness, sense of humor is absolutely requisite to guard<br />\nhis<br />\nagainst failure. Unless poet or novelist is able and quick to see where<br />\nLet<br />\nwork trenches on the absurd, he is in constant peril of flaunt and jeer.<br />\nhim but offend in one point, and he is guilty in all; nothing will save his work<br />\nfrom death when it has given fair cause, though in but one instance, for ridicule. Nothing is so fatal as laughter; scathing shafts of criticism, even scoff<br />\nand sneer, may be the welcome of a book, and yet that book live; but let it<br />\nis<br />\nunintentionally provoke but one hearty laugh from its readers, and its doom<br />\nas<br />\nattack<br />\nof<br />\nweapon<br />\na<br />\nbeing<br />\nas<br />\nrecognized<br />\nbeen<br />\nsealed. Ridicule has always<br />\nPotent as it is often unfair; but ridicule itself is nothing beside the effect of one<br />\ngeneral laugh raised by some intrinsic absurdity in the work itself. Though<br />\n<br />\nZ<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nthe rest of the book be not open to any blame—though it be possible to bestow<br />\nnothing but praise—the one flaw will be remembered when all the beauties are<br />\nforgotten.<br />\nIt is this fact which is especially the tripping stone of women writers.<br />\nSome of them, as George Eliot, possess keen sense of humor, and so are saved<br />\nfrom pitfalls; but the majority are unable to appreciate the ridiculous, especially in their own works, and thus are betrayed into absurdities which utterly<br />\ninvalidate the desired effect of their writings. Often again they are saved from<br />\nthis by the lack of sense of humor in their readers; but this, though frequently<br />\noccurring, is a dangerous dependence. There have been not a few romances<br />\nwritten by the sex which is most romantic but knows least of romance, which<br />\nhave attained a fleeting popularity solely because the absurdities therein contained have not been patent to the mass of readers; but sooner or later the<br />\nauthor of such work is sure to make a fatal slip which cannot be overlooked,<br />\nand then comes the end.<br />\nHad certain young lady romancists been possessed of a sense of humor—<br />\nhardly, however, to be expected at their tender years—several of the most pop<br />\nular books of the day would not have been written, or at least would have been<br />\nwritten in widely different form. Had a certain popular author been possessed<br />\nof a sense of humor, her works of fiction, now read by thousands with intense<br />\npleasure, would never have been submitted to a publisher or given to the<br />\npublic. But the works were issued, and gained instant and marvelous popularity; and this leads us to another thought—what of the sense of humor in the<br />\npublic which sets on such work the seal of its approbation? How is it that such<br />\nwork is received with applause instead of laughter? Have critics and readers,<br />\nas well as authors, lost perception of the ridiculous, that such books are confidently issued and implicitly accepted as worthy.<br />\nThe answer is to be found in the indubitable fact that he who takes himself<br />\nseriously will for a time be taken at his own valuation. Self-confidence is<br />\nalways impressive; there are many literary Pecksniffs who have only to tell us<br />\nin impressive style that twice two is four to gain an audience of gaping admirers, and who do tell us these things and are duly admired for their depth of<br />\nthought and breadth of knowledge. Had they sense of humor, they would not<br />\ninflict upon us their veteran vaporings; had we sense of humor we would not<br />\nreceive them as prophets and sages; but the sense is lacking in both, and so<br />\nthe farce goes on.<br />\nBut we have somewhat wandered from the intended subject of this article,<br />\nhaving been betrayed into generalities where we meant to confine ourselves to<br />\nparticular examples. And this very lapse illustrates our meaning; for a truer<br />\nsense of humor would have held us hack from thus tilting against windmills.<br />\nIn that last phrase we have found a text for our discourse. Never was a<br />\nman more thoroughly destitute of sense of humor than the Knight of La Mancha<br />\nand it was this alone which constituted his madness. Being thus destitute, he<br />\nsaw everything as it was not, and he was led by his illusions into various perilous and ridiculous adventures. Had Don Quixote been an author instead of<br />\na knight-errant, he would have written with as much earnestness as he dis-<br />\n<br />\n\f^ THE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nplayed in his attempt to redress wrongs, and he would have been betrayed at<br />\nevery page into extravagances which would have rendered his writings as useless as was his chivalry.<br />\nMany are the Don Quixotes of poetry and fiction. For their earnestness and<br />\nfaith we must needs respect them; but for their absurdities we cannot choose but<br />\nlaugh at them, and the laughter is our abiding thought of their works. These<br />\nare they whose extravagances and absurdities are patent to all save themselves,<br />\nWhose earnestness cannot impress because of its patent errors of presentation.<br />\nKnights of the Rueful Countenance, they go forth in rusty and ill-fitting armor,<br />\nand do not see how grotesque are their figures when they would fain be aweinspiring. And yet, all of us laugh at Don Quixote, but there are some of us<br />\nWho love him and laugh with tears of pity not far away, grieving that the noble impulses and high purposes should fail because of fault of method; and so<br />\nthese earnest writers sometimes win respect for purpose even with the laughter<br />\nthat greets their mis-directed efforts. But those who have no claim upon our<br />\ntolerance because of purpose, and give rise to our laughter by absurdity, win<br />\nneither respect nor pity. Of these is that host of writers who write without<br />\nknowledge or talent, tellers of monstrous tales, gymnasts of words, who think<br />\nto cloak their ignorance and inability by means of a certain ingenuity of incident and phrase, both false to truth. They may have their day of popularity,<br />\nthese writers; but it will be a short one, and the night will be that of utter forgetfulness,<br />\nLack of sense of humor always shows at last; and its showing is generally<br />\nfatal. Examples of recent years are not wanting. Hardy managed to conceal<br />\nthis defect until he wrote \"Jude the Obscure;\" then he betrayed himself, and<br />\nthe result is patent to all those who note the fluctuations of the literary pulse.<br />\nMeredith for long years hid his lack of this sense under ponderous phrase and<br />\ncarefully wrought-out thought; but \"Lord Ormonde and His Aminta\" convicted<br />\nhim at last, and, though by many placed at the head of contemporary novelists,<br />\nhis fame will not increase in the future. Richard Le Gallienne is entirely devoid of sense of humor; only in this fact will his work find excuse, but the fact<br />\nwill make that work inutile and ineffective. Gissing and Hewlett, Miss<br />\nCorelli and Mrs. Ward all lack the saving sense which makes for proportion<br />\nand lasting influence; they may enjoy their popularity for a space, but it cannot<br />\nlast. Sooner or later the public, now hanging admiringly upon their words,<br />\nwill suddenly find cause for laughter in some extravagance so great that it cannot pass notice; and then the idol will fall from its pedestal.<br />\nIt is unfortunately true that of late years the reading public has sanctioned<br />\nextravagance and absurdity in literature, particularly in poetry and fiction, and<br />\nhas craved for more; but in this very fact lies the chief peril for those who lack<br />\nthe saving sense. For there is a fixed line even to the credulity of the public;<br />\npass that, and the public laughs. Sense of humor will define that line and give<br />\nsafety; without that sense, the line is sure to be over-passed. It is less to know<br />\nwhat the public wants than how much the public will stand; the want may be<br />\ncreated, but the line of toleration cannot be crossed without ruin. The writer<br />\nmay strut and mouth upon the stage, and still hold his audience; but if he ever<br />\ngrimace where he thinks to frown impressively, the audience will laugh, and<br />\nhis spell over them be ended. And then follows hissing mingled with the<br />\nG. C. L.<br />\nlaughter, and the poor mime is driven from the stage.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nIN HONOR OF DR. ROWLAND.<br />\nNVITATIONS have been issued for the memorial meeting to the late Prof.<br />\nHenry Rowland, which will be held in the Johns Hopkins physical laboratory. The meeting will take place at noon on October 26. The address<br />\nof the occasion will be delivered by Dr. T. C. Mendenhall, formerly president<br />\nof the Worcester Polytechnic Institute. The Faculty of the University and all<br />\nthose interested in the life and scientific researches of Dr. Rowland will be invited to attend.<br />\n<br />\n3<br />\n<br />\nMEMORIAL TO DR. HENRY N. MARTIN.<br />\nLARGE bronze tablet to the late Prof. Henry Newell Martin was erected<br />\nlast week in the corridor of the Johns Hopkins biological laboratory,<br />\nwhich he founded, and over which he presided for many years. The<br />\ntablet is set in a heavy frame of dark wood.<br />\nA formal unveiling will take place sometime during the coming week.<br />\n<br />\n4<br />\n<br />\nASPIRANTS TO DEGREE OF A. B.<br />\nEAN GRIFFIN has announced the following men as eligible to the degree of A. B.: Messrs. E. B. Beasley, H. Beauwkes, E. P. Bernheim,<br />\nW. J. Butner, J. G. Campbell, R. T. Crane, A. G. Dew, Ross Miles<br />\nDiggs, R. S. Duck, J. T. England, H. C. Gillespie, John Sharshall Grasty,<br />\nFred L. Guggenheimer, W. H. Harris, Jr., H. H. Hazen, L. E. Hilderbrandt,<br />\nEben C. Hill, William B. Hill, William E. Hoffman, Jr., William Kirk, W.<br />\nH. Koppelman, D. I. Macht, Ogle Marbury, Charles Markell, Bartgis McGlone,<br />\nR. E. Moore, Lyman C. Murphy, Charles A. Myers, Marbury B. Ogle, Aubrey<br />\nPearre, Jr., I. R. Pels, Thomas C. Pinkerton, M. W. Powell, B. Swayne Putts,<br />\nC. F Ranft, H. B. Raffel, W. F. Reynolds, J. Abner Sayler, Jr., W. C. Schmeisser, Ralph C. Sharretts, L. P. Shippen, G. E. Sisco, John A. Slemmons,<br />\nSidney Smith, Harvey B. stone, H. P. Straus, Sol Strouse, Samuel Wolman,<br />\nPeregrine Wroth, Jr., and Elliot Strouse.<br />\n<br />\ncp<br />\n<br />\nJOHNS HOPKINS SCHOLARSHIPS.<br />\n<br />\nZ<br />\n<br />\nHE board of collegiate advisers has recommended the awarding of Hopkins Scholarships to the following Maryland men: Messrs. G. B. Rosenheim, S. H. Shapiro, and Reginald Opie.<br />\nThese scholarships are awarded by competitive examination to Maryland<br />\nmen who have passed all entrance examinations and have matriculated.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\nJOHNS HOPK.INS CLUB.<br />\n<br />\nZ<br />\n<br />\nHE formation of the Johns Hopkins Club is so recent an event that no<br />\ndetailed account of it seems necessary. But still it might he interesting<br />\nto mention briefly the aims which its founders had in mind, and which<br />\nthey have faithfully tried to realize.<br />\nFirst and foremost, is that of binding all former students of the University,<br />\nnot only to each other, but also to their Alma Mater. And unless something<br />\ndoes this successfully, the prestige of Johns Hopkins can never remain secure.<br />\nEvery man it sends out should be an enthusiastic partisan—always loyal, and<br />\nalways practical. If the club can keep these in touch with their University it<br />\nhas done a lasting service.<br />\nFor those who come from other colleges for advanced work the Club has a<br />\nspecial welcome. It balances the tendency to specialize by affording congenial<br />\nrelaxation and intercourse. Men from each department can become acquainted<br />\nwith men from the others, and all meet on neutral ground. All are welcome as<br />\nindividuals, and each stands on his own merits. It is the one place in our fair<br />\nland that is entirely exempt from politics in any form or shape, unless, perchance hypothetical discussions about outside affairs take place under its roof!<br />\nThe significance of this statement will be apparent to all who know the intricacies of a class election, or the \"points\" that must be possessed by many a man<br />\nwho \"makes\" his college athletic teams.<br />\nNot only for the graduate student, but also for the members of the faculty<br />\ndoes the Club offer a quiet retreat. It also furnishes an opportunity for the<br />\nfaculty to mingle with the graduate students, thus increasing the social atmosphere surrounding our teaching staff. Of immense value to the student is this<br />\nintimate and different relationship to his leaders, and those of the latter who<br />\nwish to make the most of their chance to develope the men who come under them<br />\nwill desire to enlarge their influence thus.<br />\nIn these ways the educational value of such a resort is immense, but there<br />\nare also other points of view.. In bidding for the support of all J. H. U. men. the<br />\nClub offers the neatest and coziest little house in the city,—so close to the<br />\nUniversity that distance does not count. There are all the usual facilities for<br />\namusement and recreation, to say nothing of eating and drinking, etc. The<br />\nlibrary and reading rooms are comfortable and inviting, and there is an excel<br />\nlent billiard table.<br />\nThe house is always open for inspection, and there will be an enthusiastic<br />\nhouse-warming on Saturday, October 26th, at which the faculty, alumni and<br />\ngraduate students, will all find a hearty welcome.<br />\n<br />\nR. L. McALL, '00.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nOCTOBER 23, 1901.<br />\nSubscription $1.50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902.<br />\n. SOL STROUSE, 1902.<br />\nEBEN C. HILL, 1902.<br />\n.<br />\nROBERT S. LANIER, 1903.<br />\nW.S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483.<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nFTER the Senior class election, the president of the class spoke a few<br />\nwords concerning a \"policy\" for the year. Progressiveness and life<br />\nwere the keynotes to his remarks, and if proper support is given to the<br />\nclass officers, each student can anticipate a most pleasant year. A series of<br />\nclass meetings, to be informally held outside of the University, on Friday or<br />\nSaturday evenings, has already been arranged. Seniors—and all other Hopkinsonians—can welcome the prospect of these class reunions, for they will be<br />\na potent factor in unifying the Senior class, and thus exerting powerful influence<br />\nin bringing together factions in other classes. Incidentally, we can all have a<br />\n\"corking good time,\" and as it is a matter of open house for all, without the<br />\nformality of admission tickets, it is to be hoped that all naughty-two will be<br />\npresent on these occasions. Success along this line means more ambitious<br />\nschemes, and success in the more ambitious schemes means real college life at<br />\nHopkins, started by the class of 1902, and kept up by following classes. The<br />\npraiseworthiness of this object is apparent.<br />\n<br />\n4<br />\n<br />\nWORD regarding the cancellation of the Hopkins-Princeton game is perhaps in order. Our foot ball team has suffered not a little this year<br />\nfrom lack of material, or, perhaps . we had better say, lack of proper<br />\nspirit, for it is certain that there are a number of eligible men, especially in the<br />\nMedical School, who, if they chose to take the time, could very easily manage<br />\nto devote a few hours a week to foot ball practice. Other men in past years<br />\nhave found it no hardship to sacrifice a little of their time for the sake of Black<br />\nand Blue, and, in the end, have considered themselves repaid by seeing our<br />\n<br />\ngt<br />\n<br />\n_AMIN<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nUniversity come off victorious. This year, however, much of that spirit appears lacking, for despite the fact that the present Freshman class in the Medical School is larger than ever before the foot ball candidates from it are fewer in<br />\nnumber. During the past week several men have come over and practiced, and<br />\nwe appreciate and commend their spirit, and wish more would imitate it. Besides this, we had the misfortune, in our first game, to have three of our players disabled. Our team is light, raw, lacking in practice, and without an<br />\norganized \"scrub\" against which it can practice. All these things taken into<br />\nconsideration, it was deemed most inadvisable to venture against such a team as<br />\nPrinceton, whose superior weight, discipline, and experience would completely<br />\ndisorganize our team in its present condition. However, we have still several<br />\nweeks in which to constantly improve, and if our men will only come out, and<br />\nwork with a will, there is every reason to believe that we may end the season<br />\nwith the Maryland Interconegate League championship banner in our posses<br />\nsion.<br />\nEPORTS from other colleges that the \"lacrosse squad is out for practice\"<br />\ncontinually reach us even thus early in the season. This means that<br />\nmore interest is being shown in the sport, and that the colleges are now<br />\ngetting to work in earnest trying to develop strong lacrosse teams, where formerly the game was only au experiment. Each year has shown new rivals in<br />\nthe field, and each year has Hopkins been compelled to play for all she was<br />\nworth to keep her laurels. It is true that last year's championship banner does<br />\nnot adorn our trophy room, but nevertheless the record of the team was one to<br />\nbe proud of. Hopkins is going to try hard to win back that title this year, and<br />\nwe must work like trojans to do it, Therefore, when the captain of the lacrosse<br />\nteam calls for men, all who intend to go out with the team—and may your<br />\nnumbers be great—begin now. If you are \"green\" take your stick and ball<br />\nand learn to throw and catch; use up all your spare moments by tossing in the<br />\ncage, and try in every way to become proficient with the stick. Then when<br />\nregular practice commences, you will be ready to learn the game; and the<br />\nquicker you learn the game, the better are the prospects for Hopkins lacrosse.<br />\nShall we put out a great lacrosse team, again, as usual? \"It's up to you,\"<br />\n<br />\nIR<br />\n<br />\nDear Mr. Editor:<br />\nMy ambition is to become one of the editors of the NEWS-LKTTER, and, as<br />\nI believe that \"the early bird catches the worm,\" I am going to write a letter<br />\nright off in the hope of increasing my chances by so doing. I am now a student<br />\nof a big University, and am beginning to realize that there are other duties<br />\nincumbent upon tue besides cramming like I did when at the preparatory school.<br />\nLast Saturday I went out to the foot ball game, and yelled for Johns Hopkins. I certainly think my classmates should show a better college spirit, and<br />\nturn out more rooters at the games. I didn't see any of the Faculty members<br />\nthat I know out there. Do they ever get tickets, or go out to encourage the<br />\nattempts to uphold the athletic reputation of Johns Hopkins? They ought to,<br />\noughtn't they?<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n8<br />\n<br />\nI think the Juniors are extremely rough at times. They seem to be an illmannered class. Maybe it is because I don't know them. I hear that they are<br />\ngoing to take advantage of us in the cane rush. I reckon there will be lots of<br />\nwhat they call \"rough house.\"<br />\nI think Dr. Greene is an awfully nice old man. He seems to have such a<br />\nquiet, motherly way about him. He makes its write a lot of papers, though.<br />\nI am very fond of writing poetry, and have written several sonnets, which<br />\nI consider very good. I may send some in for the next issue. I want you to<br />\nsee that I am at least making an effort.<br />\nI think I shall try for the Glee Club, I have sung for the students upon<br />\nseveral occasions, but not in the University.<br />\nI promised my mother and father that I wouldn't learn to drink when I<br />\ncame to Hopkins. I saw two of our fellows going in Gordon's the other day,<br />\nso I turned ray head the other way and walked real fast. I think that's a<br />\nterrible habit, and very injurious. Mister McDermot says so.<br />\nI'll close now, hoping that my first attempt will meet with a favorite<br />\nYour humble servant,<br />\nreception.<br />\n<br />\nA FRESHMAN.<br />\nWe wish to call particular attention to the above letter, because the writer,<br />\nthough exhibiting a certain pardonable greenness, has, nevertheless some very<br />\ngood ideas concerning college spirit. We commend his first attempt, and by<br />\nhard work and diligence he may secure a position on the paper in the course of<br />\na few years. We would reco imend that his classmates follow his example in<br />\nattending the foot ball games, and rooting lustily for Hopkins. After he has<br />\nbeen here a little longer he will learn that our Faculty, with one or two notable<br />\nexceptions, have their minds so far elevated above this terrestrial sphere that<br />\nthey are hardly aware of the existence of college athletics. We also commend<br />\nthis freshman s noble resolve in shunning \"spiritual refreshment.\" We have<br />\nseveral horrible examples of the effects of the habit in our midst.<br />\n<br />\nDEPARTMENT NOTES.<br />\n<br />\nt<br />\n<br />\nHE Johns Hopkins Biological Department has more graduate students this<br />\nseason than for many years. There are about a dozen of them, seven or<br />\neight being newly entered.<br />\n<br />\nProf. E. A. Andrews worked all summer on the Massachusetts coast, not<br />\nfar from Woods Holl. He was busied with a study of protoplasm. Most of<br />\nhis work was microscopic, and dealt with marine forms, which he collected<br />\nhimself.<br />\nDr. Duncan S. Johnson, associate in botany, is still abroad. He has been<br />\nstudying in the University of Bonn. Before Christmas he will return to Baltimore.<br />\nDr. Caswell Grave, the instructor in zoology, was at Wood's Holl and at<br />\nBeaufort at different times during the summer. In addition to his private work<br />\n<br />\n-AMIN<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nhe also engaged upon studies of the North Carolina oyster for the State of<br />\nNorth Carolina.<br />\nDr. J. E. Duerden, who is curator of the Institute of Jamaica, has been<br />\nworking in Baltimore all sumtner upon an investigation into the developement<br />\nof corals. He brought most of his subjects with him from Jamacia when he<br />\ncame to study at Johns Hopkins.<br />\nMr. H. F. Perkins brought back with him from the Bahama Islands many<br />\ninteresting specimens of jelly fishes. He went to collect for purposes of special<br />\nstudy.<br />\nTwelve graduates are working in the department of history snd politics.<br />\nAmong them are Mr. E. J. Benton, who left the University three years ago to<br />\nteach in Lafayette, Ind., where he has passed a very successful residence. Mr.<br />\nRobert Garrett is another of the number. Mr. J. W. Harry, fellow, has returned to the department.<br />\n<br />\nSTUDENT NOTES.<br />\nHURSDAY of last week the Glee Club had its first rehearsal of the season.<br />\nMany of last year's men came out, and the ranks were further reinforced<br />\nby eight or nine aspirants from the entering class; so there seems to be no<br />\nlack of material. Members and candidates at present are: Leader, Howard<br />\nEager; first tenors, Eyster, Humrichouse, Carver, Cowles, and Kinnane ;<br />\nsecond tenors, Warner, Nelson, Wright, Surrell, Converse, Dickey, and Stubbs ;<br />\nfirst basses, Eager, Hill, Meyers, King, Bryan, Stollemwerck, Thomas, Jackson,<br />\nand Snowden; second basses, Licking, Dochez, Mason, Gilman, Bost, Wroth,<br />\n<br />\ne<br />\n<br />\nand Marshall.<br />\nWilson Snowden, '03, has been chosen leader of the Mandolin Club, in<br />\nplace of Krager, '99, resigned.<br />\nThe Chess Club held its first meeting in the Trophy Room Thursday of<br />\nlast week. The following officers were elected: President, Markell,'02 ; Secretary and Treasurer, Sharretts, '02. A committee is now prepared to receive<br />\nentries for the tournament. It is intended that the Club this year shall extend<br />\nits victories to wider circles than in the past, and matches are to be arranged<br />\nwith some of the larger colleges.<br />\nPresent membership of the Club, 1901--Machen, Shippen, Booker, Slireve ;<br />\n1902—Markell, Sharrettt ; 1903, Sparrow, Addison, Glocker.<br />\nThe Senior Class Executive Committee consists of Beeuskes, Campbell,<br />\nCrane, Diggs, Gillespie, McGlone, Moore, Pels, together with Stone, president,<br />\nand Strouse, vice-president, ex-officio.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nATHLETICS.<br />\nATHLETIC BOARD NOMINEES.<br />\nVERY student should attend the meeting of the general Athletic Association, held Friday, October 25th, for the purpose of electing the Board<br />\nof Directors for the ensuing year. The following are the nominees:<br />\nFor President—Abercrombie, Garrett.<br />\nFor Vice-President—Sayler, Garrett.<br />\nFor Treasurer—Gillespie, Sidney Smith.<br />\nFor Recording Secretary—Jos. Smith, W. B. Hill.<br />\nFor Corresponding Secretary—Pagon, W. B. Hill, Hazelhurst.<br />\nFor Graduate Delegate--Converse, Artaud, Weedon.<br />\nFor Medical School Delegate--Houghton, Whipple, Casler, Riggs.<br />\nFor Alumni Delegate--Dr. Lanier.<br />\nFor Senior Delegates (2)—Campbell, Sharretts, Schmeisser, Bernbeim, S.<br />\nSmith, Putts, Gillespie.<br />\nFor Junior Delegates (2)—R. C. Hoffman, Tootle, Blauck, E. Schmeisser,<br />\nPlaggemeyer, P. Straus, H. Baetjer, Passagno, Hazelhurst.<br />\nFor Freshman Delegate (1)—N utnsen, Pearre, Wallis, Erlanger, Humrichouse.<br />\nThe two Faculty Delegates, appointed by the Trustees, are Dr. Renouf and<br />\nProf. Wm. M. Mackdermott.<br />\nJe FOOT BALL SCHEDULE. ,4<br />\nOCTOBER 26.—Gallaudet vs. J. H. U., at Washington.<br />\nNOVEMBER 2.—Haverford vs. J. H. U., at Ha,verford.<br />\nNOVEMBER 9.—P. M. C. vs. J. H. U., at Chester.<br />\nNOVEMBER 16.—J. H. U. vs. Western Maryland, at American League Park.<br />\nNOVEMBER 23.—J. H. U. vs. St. John's, at American League Park.<br />\nNOVEMBER 28.—(Thanksgiving Day), J. H. U. Vs. U. of M.. at American<br />\nLeague Park.<br />\n<br />\nJ. H. U., 24. ROCK HILL, 5.<br />\n<br />\nZ<br />\n<br />\nIIE foot ball season was opened Saturday 12th, at the American League Park,<br />\nwhen the wearers of the Black and Blue defeated a husky bunch of youngsters from Rock Hill College, by a score of twenty-four to five. The game<br />\nwas by no means such a walk-over as the score seems to indicate. The<br />\nvisitors<br />\nat times showed such pluck which would have taken all the heart out<br />\nof a<br />\nweaker team than the Hopkins team, and had it not been for the grim determination to win which was shown by Captain Gillespie's warriors, so imposing<br />\na score would not have been rolled up.<br />\nThe Collegians were much heavier than they were last year, several men in<br />\ntheir line being veritable stone walls. The Hopkins team, on the other<br />\nhand,<br />\nwas much lighter than in former years, but such work was done by them<br />\nthat no<br />\n<br />\n\fCOACH<br />\n<br />\nALEXANDER<br />\n<br />\nKING<br />\n<br />\nDIXON<br />\n<br />\nFOOT BALL SQUAD.<br />\n<br />\n\f\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nloyal Hopkinsian should be ashamed of it. On the ends Captain Gillespie and<br />\ned<br />\nSharretts did most creditable work, Sharretts is to be especially commend<br />\nline,<br />\nthe<br />\nof<br />\nBack<br />\nend.<br />\nfor the beautiful run he made around Rock Hill's right<br />\nfor<br />\nall the men are to be lauded. To be sure, at times the backs ran high, but<br />\nforbe<br />\ncan<br />\nmistakes<br />\nthese<br />\nthe most part their work was of such character that<br />\nwas,<br />\ngotten if they promise to do it no more. Taken as a whole, the game<br />\nGilCaptain<br />\nand<br />\nseason,<br />\nindeed, as good as could be expected that early in the<br />\nland<br />\nwill<br />\nwho<br />\nmen<br />\nof<br />\nlespie can rightly think he has gotten together a crowd<br />\nanother inter-collegiate banner for the trophy room.<br />\nleft<br />\nFor the visitors, the most creditable work was done by Hernandez at<br />\n.<br />\nLaurence<br />\nand<br />\n),<br />\nend, and by the backs, Wall, Springer, McCool,(captain<br />\nThe game was started with a kick off by Sayler. After a couple of downs<br />\nof play a<br />\nand a fumble, Hopkins secured the ball, and in less than three minutes<br />\npassed<br />\nhad<br />\nminutes<br />\nfive<br />\ntouchdown had been scored by Blanck. And before<br />\nof<br />\nfavor<br />\nin<br />\nnothing<br />\nto<br />\nanother one had been made and the score stood twelve<br />\nbut<br />\nspirited,<br />\nquite<br />\nwas<br />\nplay<br />\nold \"Toni\" Hopkins. For a while after this the<br />\nran threesoon on a fumble of Beruheim's the ball was taken by Springer who<br />\nvisitors.<br />\nthe<br />\nfor<br />\nwn<br />\ntouchdo<br />\nquarters of the length of the field and scored the only<br />\n.<br />\nHopkins<br />\nby<br />\nsecured<br />\nJust before the half finished another touchdown was<br />\nintently<br />\nwas<br />\nand<br />\nspirited,<br />\nIn the second half, the play was much more<br />\nunable<br />\nwatched. Rock Hill put up a strong game, and the local warriors were<br />\nhad<br />\nwho<br />\nCrane,<br />\nhalf,<br />\nthe<br />\nto score more than one other touchdown. During<br />\ngot<br />\nmixed<br />\nWall,<br />\ntackle<br />\nto<br />\nng<br />\nbeen playing right tackle for Hopkins, in attempti<br />\nLazenby<br />\nup in a scrimmage and had his right shoulder dislocated. Mr. Maurice<br />\ntook<br />\nwho<br />\nLawson,<br />\naid.<br />\nmedical<br />\ny<br />\nof the Medical School, rendered the necessar<br />\nserious.<br />\nnot<br />\nwere<br />\ninjuries<br />\nhis<br />\nbut<br />\nCrane's place, had his knee cap wrenched,<br />\nThe line-up of the teams was:<br />\nROCK HILL.<br />\n<br />\nHOPKINS.<br />\n<br />\nGillespie (capt.)<br />\nWhipple<br />\nStone<br />\nCampbell<br />\nYearley<br />\nCrane, L,awson, Converse<br />\nSharretts<br />\nBernheim<br />\nStraus.<br />\nSayler<br />\nBlanck<br />\n<br />\n1. e.<br />\n1. t.<br />\n1. g.<br />\nc.<br />\nr. g.<br />\nr. t.<br />\nr. e.<br />\nq b<br />\n1 h b.<br />\nr. h b<br />\nf. b<br />\n<br />\nHernandez<br />\nDavis<br />\nCullen<br />\nDonaghy<br />\nBarnes<br />\nWetzler.<br />\nBrown<br />\nWall<br />\nSpringer<br />\nI,aurence<br />\nMcCool (capt.)<br />\n<br />\nEdward<br />\nReferee—William G. Lavelle, Rock Hill College. Umpire—J.<br />\nNeer,<br />\nF.<br />\nN<br />\nand<br />\nHill.<br />\nRock<br />\nEdelen,<br />\nE.<br />\nen—R.<br />\nLinesm<br />\nTyler, Johns Hopkins.<br />\nB. Atkinson, J.<br />\nJ. H. U. Timekeepers—J. B. Fink, Rock Hill, and Allman<br />\nH. U. Halves of 15 minutes.<br />\nJ. H. U.<br />\nTouchdowns—Sayler, 1; Straus, 1; Sharretts, 1; Blanck, 1, for<br />\nFor Rock Hill College, Springer, 1.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER.<br />\nHOPKINS, 6; M. A. C., 0.<br />\n<br />\nATURDAY'S game did not bring the expected score of 24-0 or someth<br />\ning<br />\nlike that. Still, it was a victory for Hopkins,not easily earned,<br />\nhowever.<br />\nSharretts kicked off for Hopkins, and M. A. C., failing in three<br />\ndowns to<br />\nlessen the distance between the pigskin and the goal posts,<br />\npunted. From<br />\nwhat followed it seemed that touchdowns by the Black and<br />\nBlue would be the<br />\nmost noticeable feature of the game. Hopkins started by<br />\nshoving the oval<br />\nbetween M. A. C.'s tackle and end for appreciable gains;<br />\nthen Sayler sailed<br />\nround left end, and received no hostile embraces until he had<br />\ngained ten yards.<br />\nGillespie now circled the other end, and with two good runs<br />\nscored the first<br />\ntouchdown for Hopkins, after the ball had been in play only<br />\nabout eight minutes. Sayler kicked a goal.<br />\nM. A. C. then kicked off, and shortly thereafter Hopkins<br />\nhad the ball on<br />\nM. A. C.'s five yard line again, the main feature of this advanc<br />\ne being a thirty<br />\nyard dash round left end by Sayler. Sayler then went through<br />\nright tackle for<br />\nanother touchdown, but as it seemed that the Hopkins right<br />\ntackle held his<br />\nopponent, the ball was brought back and given to M. A. C.<br />\nTurner then did the honors for M. A. C. to the extent of<br />\nabout thirteen<br />\nyards, and the ball then went to Hopkins on downs. The Black<br />\nand Blue soon<br />\nhad the oval within easy scoring distance, but were penaliz<br />\ned ten yards for an<br />\noff side play, and soon lost the ball on downs. After a short end<br />\nrun M. A. C.<br />\npunted to Sayler, who made a nice start, but had the ill luck<br />\nto fumble. Hopkins kept the oval, however,and after a twenty-five yard end<br />\nrun by Houghton,<br />\nthe first half ended with the ball on M. A. C.'s forty yard<br />\nline.<br />\nAt the beginning of the second half, Fesmeyer for M. A.<br />\nC. sent the ball<br />\nwhizzing to Yearly, who hugged it, and let himself go as far<br />\nas the forty-five<br />\nyard line. Houghton and Sharretts then travelled around<br />\nthe ends for good<br />\ngains, but on the next play Hopkins fumbled to M. A. C.<br />\nAfter a few mass<br />\nplays, the ball was punted to Bernheim, and soon thereafter<br />\nWhipple attempted<br />\na punt for Hopkins, but was blocked by M. A. C. Hopki<br />\nns kept the oval,<br />\nhowever, and by long end runs and mass plays put it within<br />\nfive yards of<br />\nanother touchdown. But it was \"so far and no farther,\"<br />\nand the ball again<br />\nwent over on downs. The pigskin now started the other way<br />\nwith M. A. C.<br />\nbehind it, but they lacked about two hours' time for a<br />\ntouchdown at the rate<br />\nthey were goiug, and the game was soon over with the<br />\nball on M. A. C.'s<br />\ntwenty yard line.<br />\nHopkins might have done better; still, she might have done<br />\nworse. In the<br />\nfirst half the Black and Blue held together well. in the<br />\nsecond half the team<br />\nwork was not so good. Fumbles were rather numerous<br />\non our side, but still<br />\nworse so on the part of M. A. C. Hopkins needs more<br />\npractice in catching<br />\npunts, as the work in this line was not quite up to the<br />\nnotch, also in open<br />\ntackling.<br />\nOne generally encouraging feature, however, during the<br />\nseason thus far is<br />\nthe way in which the men help each other, thus playing as<br />\na whole rather than<br />\nas individuals. Hopkins has shown great development in<br />\nthis line in the short<br />\n<br />\np<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\ntime the team has been working. Everything considered, the Black and Blue<br />\nhas shown up well thus far, and has not yet been defeated. Let us hope that<br />\nwe shall see the winning banner in our common-room after Western Maryland<br />\nand St. Johns have come and gone.<br />\nThe line-up of the teams was as follows:<br />\nM. A. C.<br />\n<br />\nHOPKINS.<br />\n<br />\nMitchell<br />\n.<br />\nc.<br />\nCampbell<br />\nDunbar<br />\nr g<br />\nYearly<br />\nSimmons<br />\n1. g.<br />\nStein<br />\nNaylor<br />\nr t.<br />\nHill<br />\nFesmeyer<br />\n1. t.<br />\nWhipple<br />\nSmith<br />\nr. e<br />\nSharretts, Houghton<br />\nPage<br />\n1. e.<br />\nGillespie (Capt.)<br />\nBryan<br />\nq.<br />\nBernheim<br />\nTurner<br />\nr. h. b.<br />\nSayler<br />\nPalmer<br />\nI. h. b.<br />\nStrause<br />\nWarfield<br />\nf. b.<br />\nPlaggemeyer.<br />\nLinesmen—Smith and Ewell. Umpire—Luthardt. Referee--Mackall.<br />\nTimekeepers--Riggs and Richards. Twenty minute halves. Attendance good.<br />\nMARYLAND INTER-COLLEGIATE MEETING.<br />\nHE Maryland Inter-Collegiate Association held its annual meeting at the<br />\nJohns Hopkins University last week. After the usual preliminary business of reading reports of officers and committees, the championship was<br />\nawarded to the Johns Hopkins University for the base ball, tennis, and track<br />\nand field teams. In reality the Hopkins was also entitled to the foot ball<br />\nchampionship, but there was no rule which applied to cases of the tie, and so<br />\nthe championship was not awarded to any college.<br />\nAs is well known, the Johns Hopkins team and the team from St. Johns<br />\nwon the same number of points, but as Hopkins held the championship for the<br />\nprevious year, it was evident that she was again entitled to it. However there<br />\nwas no provision for such an emergency, so the championship could not be<br />\nawarded to either team.<br />\nThe athletic committee was instructed to adopt a certain specific set of<br />\ntrack and field events, and to decide where to hold them. The lot fell to the<br />\nWestern Maryland College, in Westminister. So they will be held there if<br />\nconvenient, if not, they will take place at the Hopkins. One provision was<br />\nadopted which should recommend itself most highly. The relay race will not<br />\nbe run the same day as the other events, so that the relay men will be fresh,<br />\nand in good trim for the trial.<br />\nJust before the meeting adjourned the following officers were elected: James<br />\nA. Fectig, president, St. Johns; Ronald T. Abercrombie, vice-president, J. H.<br />\nU.; Wm. M. Macdermott, secretary, J. H. U.; and Charles A. Hotten, treasurer, Western Maryland.<br />\n<br />\nt<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE MUSICAL CLUBS.<br />\nT length the trial of candidates is finished, and the clubs are beginning to<br />\npull together once more. On the whole, the prospect is encouraging,<br />\nthough there are a few places that are still vacant. More tenors are<br />\nneeded, and the Mandolin Club could find a place for a good cornetist if one is<br />\navailable. The schedule of trips is interesting, and should bring the clubs out<br />\nat the end of the year with a good surplus and many pleasant memories. Old<br />\nPoint is once more booked, and the Hopkins Clubs will have the best night of<br />\nthe week on which to give their concert. So far the schedule is: Johns Hopkins Hospital, November 29; Roland Park, December 6; Hannah More Academy, December 13; Christmas trip; Baltimore Concert, February; Bryn Marr<br />\nCollege, Pa., February; Annapolis; and Easter trip, March 29-April 3. Of<br />\ncourse this schedule is not entirely completed, and, perhap,, certain of these<br />\nconcerts may not be given, in which case others will be substituted. The<br />\nChristmas trip will probably include Winchester, Va., Charleston, W. V.,<br />\nHagerstown and Frederick. Any Hopkins men, graduates, medical school men,<br />\nor undergraduates, if musically inclined, are urged to come forward, and aid in<br />\nkeeping up the reputation that the clubs have won for themselves in previous<br />\nyears. The trips are delightful, the practice is beneficial, the acquaintances<br />\nformed are most pleasant, and the University will be aided by your effort.<br />\n<br />\ngI<br />\n<br />\nCOLLEGE NOTES.<br />\nUR old rival, Lehigh, has already begun lacrosse practice.<br />\n<br />\nO<br />\n<br />\nThe University of California, which is interesting to Hopkins men because<br />\nof Dr. Gilman's former connection with it, is actively engaged in organizing<br />\nmany student enterprises, and putting finishing touches to those already organ<br />\nized. The large number of men, and the great resources of the Western colleges<br />\ninevitably produce success in student undertakings. \"California has organized<br />\na rooters' club. Great enthusiasm is reported as a result.\" A good hint<br />\nfor us.<br />\n<br />\nY. M. C. A. NOTES.<br />\n<br />\nt<br />\n<br />\nHE Northfield Echo meeting which was held Tuesday, October 15, in Levering Hall, proved quite a success. It was held for the purpose of telling<br />\nthose who did not attend the conference about the daily routine while at<br />\nNorthfield, Mass., and of the great amount of fun to be had out of the ten days<br />\ncamp life while there. Thrilling tales were told of perilous climbs among the<br />\nmountains, and of jolly tramps through the surrounding country. From all accounts, the ten men who represented Hopkins at the conference must have had<br />\na howling good time while partaking daily of wholesome spiritual food. The<br />\ndelegation promises to be much larger next summer. The expenses of the out-<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\ning are comparatively small, and the experience is one never to be forgotten.<br />\nAmong those who spoke of the benefits and pleasures to be derived from attending the conference were: Messrs. Plaggemeyer, Addison, Pagon, Licking,<br />\nWood, Graft. Grove, Edmunds and Freeman. Dean Griffin was an interested<br />\nlistener at the meeting.<br />\nTHE AUCTION SALE;<br />\nor,<br />\nDog and Freshman.<br />\ntNDER the auspices of the Class of 1903, an interesting auction was held<br />\nlast Thursday in McCoy Hall basement. Just as the nine o'clock period<br />\nended, a young fox terrier appeared, and made himself so popular that<br />\nthe juniors decided on an auction as the only way of determining who should<br />\nbe his owner. A dozen Freshmen were eager for the honor of serving the<br />\nJuniors. Finally, a long, thin one was picked out, and elevated on a box. To<br />\nshow his appreciation of the dog's value and his own humbleness, he kneeled<br />\nreverently before the animal, muttering odes of praise. Then, to the intense<br />\ngratification of the Juniors, who enthusiastically crowded around him, he ran<br />\nthe bids up to 2S cents; and even more fabulous amounts might have been<br />\noffered, had not Mr. Christhilf, bereft and grief-stricken, suddenly appeared to<br />\nclaim his long-lost pet.<br />\nWe are glad to notice men of such intelligence and appreciation in the<br />\n<br />\nq<br />\n<br />\nentering class.<br />\nCLIPPED FROM THE EXCHANGES.<br />\nFor the benefit of the general student body, all our exchanges will again be placed on<br />\nthe table in the Y. M. C. A. reading room.<br />\n<br />\nTEMPORA MUTANTUR !<br />\nA maiden, to wedlock inclined,<br />\nBore always this saying in mind,<br />\nIn our grandmothers, time, long ago,—<br />\n\"Have more than One String to your Bow.\"<br />\nBut the Modern Maid of to-day<br />\nPuts the thought in another way;<br />\nShe says that this is the Thing,<br />\n\"Have more than One Beau on the String.\"<br />\n<br />\n—Occident.<br />\n<br />\nThere is more college love in the sacrifice of a penny, than a ton of words.<br />\n—The Occident, U. of Can.<br />\n<br />\nELEANOR ---\"I hear that the Geisha girls wear stockingettes instead of<br />\nstockings.\"<br />\nLusLIE---'`Oh, that's going too far, I think.\"<br />\nELEANOR—\"Not far enough, 1 think.' —Princeion Tier.<br />\n<br />\n\fr-<br />\n<br />\n16<br />\n<br />\nTHE NEWS-LETTER.<br />\nA REGULAR CONTRIBUTOR.<br />\n<br />\nA hot sea-dog whom nothing could phase was sitting alongside the rail of<br />\nan Old Dominion liner one day reading the Atlantic Monthly, when a pale-faced<br />\nland lubber hailed him and drew rapidly alongside.<br />\nGlancing at the periodical in the H. S. D's lap, the new comer remarked<br />\nsadly, `Ah,me! I never wrote anything for the Atlantic Monthly, but I am,<br />\nnevertheless, contributing to the Atlantic Daily.\"—Tiger.<br />\n<br />\nJ. H. U., P. G.<br />\nDwelling on the heights of Science,<br />\nChewing hash at three a week,<br />\nBidding gaiety defiance,<br />\nReady on the world to wreak<br />\nTheories that cannot leak;<br />\nClad in trousers bright high water,<br />\nThus to symbolize a sorter<br />\nElevated tone of life;<br />\nMost emphatically rife<br />\nWith intellect's divinity:<br />\nWho can scorn all common strife?<br />\nNone other than the great P. G.<br />\nWhence doth come this great reliance?—<br />\nA harder word's not hard to seek—<br />\nFrom living in so close alliance<br />\nWith clouds upon a lonesome peak?<br />\nTo Learning has he sworn affiance:<br />\n\"No thesis to establish! Freak!<br />\nMan's chief end you'd surely orter<br />\nGrasp. (His grammar's often slaughter)<br />\nEt cetera; we'd like to knife<br />\nThe f— philosopher, but quick relief<br />\nComes in a laugh. Enormously<br />\nWe smile at him and his belief—<br />\nNone other than the great P. G.<br />\nPrince, the status quo's not one for grief,<br />\nNot all the world would just as lief<br />\nConsider things so stupidly<br />\nAs this queer bird and pleasure thief—<br />\nNone other than the great P. G.<br />\n—The Treadmiller.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n1'T E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the iterve and blood supply to<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. T). BOWEN, M. D., T). 0.,<br />\nProst. & Mgr.<br />\n-ESTABLISHED<br />\n<br />\n1879.—<br />\n<br />\nwooing zi[tor<br />\n<br />\nOittstor<br />\nVetOes<br />\n<br />\nIN GREAT VARIETY.<br />\n<br />\nJACOBI & JENKINS,<br />\n215 N. CHARLES ST.<br />\n<br />\n$tiversinttbo.<br />\n<br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE<br />\nText Books. Note Books.<br />\nMadison&HowardSts.<br />\nstudent's Su pplies.<br />\nIrtkLkN M. itOLLYDRY,<br />\n<br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. & Asst. Soc'y.<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nAgent for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 W EST 13A111'I M0R<br />\nSTREET.<br />\nManufacturers of<br />\ndir<br />\nSilk arid Cassiniere Hats. \" HOPKINS CAPS<br />\n<br />\n& COLLEGE<br />\nSMITH'S SCHOOL<br />\nTEXT BOOKS.<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\nSTORF.<br />\n3rd door from Madison.<br />\nH. R. EISENBRANDT SONS,<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nNew and Second<br />\n<br />\nliand Books Text Books, Note Books,<br />\nStudents' Requisites, etc. etc.<br />\n<br />\n201-203 N. CHARLES ST.<br />\n<br />\nBooks Bought, Sold and Exchanged.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nWilson Keyser, Cashier.<br />\n<br />\nCommercial & farmers Nalmal Bank,<br />\nHOWARD & GERMAN STREETS,<br />\nBALTIMORE. MD.<br />\nOffers to<br />\nDepositors every facility which their Balances,<br />\nBusiness and Responsibility will warrant.<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER<br />\n<br />\nAPPLY TO<br />\n<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS,<br />\n<br />\nNORTII GERMAN LLOYD S. S. Co.<br />\nCABIN PASSAUE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nJAMES R. PA INK<br />\n<br />\nNNT A F-4Z 11 R &CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\n<br />\n000 N. ElY.17AW<br />\n<br />\nLawrence B. Kemp, President.<br />\n<br />\nH. McMATNS, D. 0.,<br />\nSoc'y. & Treas.<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nNEW YORK 'I 0 BREMUN.<br />\nLONDON, PARIS,GIBRALTER,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO ..+1<br />\nTAUGHT<br />\n<br />\nMi!<br />\n<br />\nC. J. LIEYIN,<br />\nwho has made a life study of these nstruments. Mandolin Soloist of National reputation. Preparem Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. Ghafles St.<br />\n<br />\nBOOKS<br />\n<br />\nOLD A ND NEW<br />\n<br />\n1111<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New BoOks In the City.<br />\nBooks Bought, Sold and Exchanged. . . .<br />\nWM. V. PIPPEN,<br />\n<br />\n605 N. Eutaw Street.<br />\n<br />\nSMITH, DIXON & CO.<br />\n<br />\nilgenfraz &tuck.<br />\n°<br />\nSuccessor to Cummins<br />\n<br />\nPftPiji<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nStudents<br />\nnt to S<br />\nSpecial Discount<br />\n<br />\nTHE BLAKE Co.<br />\n<br />\nBaltimore<br />\n<br />\nshifiArtBsEND<br />\nNe<br />\nAS<br />\nckilvv<br />\nElt<br />\neS<br />\na:rroy,<br />\n<br />\nEtc.<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\n203 W. BALTIMORE ST.& 2 S• LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE & CO.,<br />\nBANKERS BROKERS<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br />\n<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\nThe Chas. Wills Surgical Instrument Company<br />\nBENJ<br />\n<br />\n29-31 N. Charles Street.<br />\n<br />\nA NELSON. GEN'L MANAGER<br />\n<br />\nPhysicians,' Surgeons,' Hoapital and Invalid Supplies.<br />\nFine Miorosoopes and Accessories.<br />\n<br />\nGoldbrau and Wurzburger,<br />\nAbsolutely Pure and Whole-some. None better on<br />\nAmerican Market.<br />\n<br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br />\n<br />\nA. H. Rutherfoord.<br />\nF. Lentz.<br />\n<br />\nJ, WM, MIDDENDORF & CO.<br />\nVanfzers & 1Brohere.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore, Md.<br />\nBaltimore Stock Exchange.<br />\n<br />\nB. G. EICI-IELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n.30E4 1`.3.cJir-t1-x (Fxesrlc,i<br />\nY. M. C. A. BUILDING.<br />\n<br />\nBaltimore, Md.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nLAGER BEERS<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\nC. & P. and Md.'Phones.<br />\n<br />\nNOM and Mechanics National Bank, CAR ON<br />\nOF BALTIMORE. MD.<br />\n<br />\nCapital Stock, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\nYOUR<br />\n<br />\nARE<br />\niiETWITtltliF<br />\nLAVEIA<br />\nN(11<br />\n)<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nJR'S. It. DOWNS,<br />\n<br />\n41<br />\n-<br />\n<br />\n229 M. Charles St.,<br />\nMASONIC TAMPLA•<br />\n<br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitation, Diplomas,<br />\nPrograms, Visiting t.7ards, etc<br />\nOur tiOa J.<br />\nU. Blue and Black Nag Paper—now reads<br />\n<br />\nEYLS<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br />\n<br />\nTHE NEWS LETTER<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n<br />\nis from the Press of<br />\n<br />\n921 North Charles Street. (Masonic Temple.)<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\n<br />\nIcXl+MINING<br />\n<br />\nMueller,<br />\n<br />\n5 West Lexington Street,<br />\n(London Studio)<br />\nFINEST PHOTOGRAPHIC<br />\nWORK IN THE CITY.<br />\n<br />\nSpecial attention given to Holiday Work<br />\nand Groups, Class Pictures, etc.<br />\n<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nBALTIMORE<br />\nLight and Lombard Streets,<br />\nWe carry a full line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\nL.<br />\n<br />\n\f", "format": "basic_html", "processed": "October 23/ 1901.<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press,<br /><br />\nMIALTimORE, PAD.<br />\nI.<br /><br />\nTwenty-Si xth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n.<br /><br />\nIRA REMSEN.<br />\nWM. H. HOWELL.<br />\nEDW. II. GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n•<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree Of IL A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\n..... .<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n100,000 volumes.<br />\n135,(0) volumes.<br />\n200.000 volumes.<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nBernsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomies,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfkld<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJ. M. Vincent.<br />\nJ. II. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames,<br /><br />\nIra<br /><br />\nUndergraduates Courses (leading to B. A.)<br /><br />\nAmerican Journal of Mathematics,<br />\nF. MOlt LEY, Editor. Quarterly. 4th. Volume XXIV<br />\nin progress. $5 per volume.<br />\nII. American Chemical Journal.<br />\nI. HEMMEN, Editor. Monthly. 8vo. Volume XXVI<br />\nIn progress. $5 per volume.<br />\nIII. American Journal of Philology.'<br />\nB. L. GILDERSLEEVE., Editor. Quarterly. 8vo.<br />\nVolume X XII in progress. ti per volume.<br />\nIV. Studies from the Biological. Laboratory. 8vo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. fivo. Series X IX In progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of sAentific awl literary work<br />\nin progress in Baltimore. 4to. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. $1 per year.<br />\nyin. Johns Hopkins Hospital Reports. 4th. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Ileitrage znr A ssyriologie, etc.)<br />\nVol. TV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. Illi(X)KS, Editor. Volume IV complete. $7.60<br />\nper volume.<br />\nXL Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVI in progress. $1.60 per volume,<br />\nXil. Journal of Experimental Medicine.<br />\nW. FT. WELCH, Editor.<br />\n8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nH EN RY M. H U D, Editor. Quarterly. 4to., th per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\n' WILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\nSvo. Volume VI in progress. $2.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by tho President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academie year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic 'year.<br /><br />\nGroups.<br />\nI. Classical (the \"Old College Course.\")<br />\n2. Mathematical Physical, •<br />\n(leading up tA) Engineering.)<br />\n3. Chernical-Biological.<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5, Latin Mathematical.<br />\nIS, Historical- Political.<br />\n(leading up to Law.)<br />\n1, Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics (vol. XXIV.)<br />\nPrank. Morley.<br />\nChemistry (vol. XXVI).<br />\nIra Bentsen.<br />\nPhilology (vol. XXII.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. XIX.)<br />\nJ. M. Vincent.<br />\nModern Languages(vol. XVI.)<br />\nA. Marshall Elliott.<br />\nBiology (vol. IV.)<br />\nWilliam K. Brooks.<br />\nAmmyriology (vol. IV.)<br />\nPaul Haupt.<br />\nExperimental Medicine(vol. VI.) W. H. Welch.<br /><br />\nIn addition to the seria Is above named,copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowlantrs Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fnc-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MS with Antilegomena Epistles. Edited by!. H. Hall. $3.00.<br />\nIlibliographia Hopkinsiensis. Pert I. Philology. Parts<br />\nChemistry, Mineralogy and neology. Parts<br />\nIV- V7 VI.Physics, Astronomy and Mathematics.<br />\n8 ye. 81) cents per part.<br />\nfl full list of publications will be sent on application.<br /><br />\nProgrammes of the Courses offered to graduate students in Philosophy and the Arts, and In the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nCommunications in respect to exchanges and remittands<br />\nman be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nOCTOBER 23, 1901.<br /><br />\nNo, 2.<br /><br />\nTHE SAVING SENSE OF HUMOR.<br />\nHERE are certain gifts which are necessary to the writer of poetry or<br />\nfiction. These need not he enumerated, since they are of common<br />\nknowledge; but among them is one which is seldom recognized as a<br />\nneed, yet without which no man or woman ever did consistently great work.<br />\nThis is the sense of humor, or, to put it more clearly for our purpose, the<br />\nrecognition and appreciatior of the ridiculous.<br />\nThere have been great writers who have been great and yet lacked the sense<br />\nof humor; but this was in despite of such lack. Wordsworth is a conspicuous<br />\nexample. Had he been possessed of appreciation of the ridiculous, he had never<br />\nwritten \"The Idiot Boy- or \"We Are Seven\"—that apotheosis of the absurdly<br />\nso can<br />\nmawkish. Yet we could ill have spared Wordsworth at his best, and<br />\nof a<br />\nexample<br />\nforgive and try to forget his worst. Tennyson furnishes another<br />\nsufproof<br />\nis<br />\ngreat poet destitute of the sense of humor; \"The Skipping Rope\"<br />\nas<br />\nmen<br />\nsuch<br />\nficient that he did not know the ridiculous when he saw it. Upon<br />\nand<br />\n,<br />\npernicious<br />\nthese, the effect of the lack of this desirable sense was rarely<br />\nwas often actually admirable by adding to their self-seriousness and therefore<br />\nto their earnestness. Byron, on the other hand, who had a keen sense of the<br />\nwhich<br />\nridiculous, was often betrayed by that sense into a flippancy and unreality<br />\nhimtake<br />\ndetracted from the value of his work. We feel that the poet did not<br />\nThe<br />\nexample.<br />\nself seriously, and we are therefore constrained to follow his<br />\nhumor.<br />\nof<br />\nhighest earnestness does not seem to be compatible with an acute sens<br />\nminor<br />\nBut we have no Wordsworths and Tennysons today; and in the<br />\nWithout<br />\nranks sense of humor is absolutely necessary to avoid fatal error.<br />\nthis saving grace, there is always peril of the sublime overstepping the space<br />\nwhich separates it from the ridiculous. Earnestness is a most admirable<br />\nand<br />\nquality, and, when coupled with overwhelming power, may sweep over<br />\ncommenpast all obstacles without let or hindrance; but if the strength be not<br />\nsurate with the earnestness, sense of humor is absolutely requisite to guard<br />\nhis<br />\nagainst failure. Unless poet or novelist is able and quick to see where<br />\nLet<br />\nwork trenches on the absurd, he is in constant peril of flaunt and jeer.<br />\nhim but offend in one point, and he is guilty in all; nothing will save his work<br />\nfrom death when it has given fair cause, though in but one instance, for ridicule. Nothing is so fatal as laughter; scathing shafts of criticism, even scoff<br />\nand sneer, may be the welcome of a book, and yet that book live; but let it<br />\nis<br />\nunintentionally provoke but one hearty laugh from its readers, and its doom<br />\nas<br />\nattack<br />\nof<br />\nweapon<br />\na<br />\nbeing<br />\nas<br />\nrecognized<br />\nbeen<br />\nsealed. Ridicule has always<br />\nPotent as it is often unfair; but ridicule itself is nothing beside the effect of one<br />\ngeneral laugh raised by some intrinsic absurdity in the work itself. Though<br /><br />\nZ<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\nthe rest of the book be not open to any blame—though it be possible to bestow<br />\nnothing but praise—the one flaw will be remembered when all the beauties are<br />\nforgotten.<br />\nIt is this fact which is especially the tripping stone of women writers.<br />\nSome of them, as George Eliot, possess keen sense of humor, and so are saved<br />\nfrom pitfalls; but the majority are unable to appreciate the ridiculous, especially in their own works, and thus are betrayed into absurdities which utterly<br />\ninvalidate the desired effect of their writings. Often again they are saved from<br />\nthis by the lack of sense of humor in their readers; but this, though frequently<br />\noccurring, is a dangerous dependence. There have been not a few romances<br />\nwritten by the sex which is most romantic but knows least of romance, which<br />\nhave attained a fleeting popularity solely because the absurdities therein contained have not been patent to the mass of readers; but sooner or later the<br />\nauthor of such work is sure to make a fatal slip which cannot be overlooked,<br />\nand then comes the end.<br />\nHad certain young lady romancists been possessed of a sense of humor—<br />\nhardly, however, to be expected at their tender years—several of the most pop<br />\nular books of the day would not have been written, or at least would have been<br />\nwritten in widely different form. Had a certain popular author been possessed<br />\nof a sense of humor, her works of fiction, now read by thousands with intense<br />\npleasure, would never have been submitted to a publisher or given to the<br />\npublic. But the works were issued, and gained instant and marvelous popularity; and this leads us to another thought—what of the sense of humor in the<br />\npublic which sets on such work the seal of its approbation? How is it that such<br />\nwork is received with applause instead of laughter? Have critics and readers,<br />\nas well as authors, lost perception of the ridiculous, that such books are confidently issued and implicitly accepted as worthy.<br />\nThe answer is to be found in the indubitable fact that he who takes himself<br />\nseriously will for a time be taken at his own valuation. Self-confidence is<br />\nalways impressive; there are many literary Pecksniffs who have only to tell us<br />\nin impressive style that twice two is four to gain an audience of gaping admirers, and who do tell us these things and are duly admired for their depth of<br />\nthought and breadth of knowledge. Had they sense of humor, they would not<br />\ninflict upon us their veteran vaporings; had we sense of humor we would not<br />\nreceive them as prophets and sages; but the sense is lacking in both, and so<br />\nthe farce goes on.<br />\nBut we have somewhat wandered from the intended subject of this article,<br />\nhaving been betrayed into generalities where we meant to confine ourselves to<br />\nparticular examples. And this very lapse illustrates our meaning; for a truer<br />\nsense of humor would have held us hack from thus tilting against windmills.<br />\nIn that last phrase we have found a text for our discourse. Never was a<br />\nman more thoroughly destitute of sense of humor than the Knight of La Mancha<br />\nand it was this alone which constituted his madness. Being thus destitute, he<br />\nsaw everything as it was not, and he was led by his illusions into various perilous and ridiculous adventures. Had Don Quixote been an author instead of<br />\na knight-errant, he would have written with as much earnestness as he dis-<br /><br />\n^ THE NEWS—LETTER.<br /><br />\n3<br /><br />\nplayed in his attempt to redress wrongs, and he would have been betrayed at<br />\nevery page into extravagances which would have rendered his writings as useless as was his chivalry.<br />\nMany are the Don Quixotes of poetry and fiction. For their earnestness and<br />\nfaith we must needs respect them; but for their absurdities we cannot choose but<br />\nlaugh at them, and the laughter is our abiding thought of their works. These<br />\nare they whose extravagances and absurdities are patent to all save themselves,<br />\nWhose earnestness cannot impress because of its patent errors of presentation.<br />\nKnights of the Rueful Countenance, they go forth in rusty and ill-fitting armor,<br />\nand do not see how grotesque are their figures when they would fain be aweinspiring. And yet, all of us laugh at Don Quixote, but there are some of us<br />\nWho love him and laugh with tears of pity not far away, grieving that the noble impulses and high purposes should fail because of fault of method; and so<br />\nthese earnest writers sometimes win respect for purpose even with the laughter<br />\nthat greets their mis-directed efforts. But those who have no claim upon our<br />\ntolerance because of purpose, and give rise to our laughter by absurdity, win<br />\nneither respect nor pity. Of these is that host of writers who write without<br />\nknowledge or talent, tellers of monstrous tales, gymnasts of words, who think<br />\nto cloak their ignorance and inability by means of a certain ingenuity of incident and phrase, both false to truth. They may have their day of popularity,<br />\nthese writers; but it will be a short one, and the night will be that of utter forgetfulness,<br />\nLack of sense of humor always shows at last; and its showing is generally<br />\nfatal. Examples of recent years are not wanting. Hardy managed to conceal<br />\nthis defect until he wrote \"Jude the Obscure;\" then he betrayed himself, and<br />\nthe result is patent to all those who note the fluctuations of the literary pulse.<br />\nMeredith for long years hid his lack of this sense under ponderous phrase and<br />\ncarefully wrought-out thought; but \"Lord Ormonde and His Aminta\" convicted<br />\nhim at last, and, though by many placed at the head of contemporary novelists,<br />\nhis fame will not increase in the future. Richard Le Gallienne is entirely devoid of sense of humor; only in this fact will his work find excuse, but the fact<br />\nwill make that work inutile and ineffective. Gissing and Hewlett, Miss<br />\nCorelli and Mrs. Ward all lack the saving sense which makes for proportion<br />\nand lasting influence; they may enjoy their popularity for a space, but it cannot<br />\nlast. Sooner or later the public, now hanging admiringly upon their words,<br />\nwill suddenly find cause for laughter in some extravagance so great that it cannot pass notice; and then the idol will fall from its pedestal.<br />\nIt is unfortunately true that of late years the reading public has sanctioned<br />\nextravagance and absurdity in literature, particularly in poetry and fiction, and<br />\nhas craved for more; but in this very fact lies the chief peril for those who lack<br />\nthe saving sense. For there is a fixed line even to the credulity of the public;<br />\npass that, and the public laughs. Sense of humor will define that line and give<br />\nsafety; without that sense, the line is sure to be over-passed. It is less to know<br />\nwhat the public wants than how much the public will stand; the want may be<br />\ncreated, but the line of toleration cannot be crossed without ruin. The writer<br />\nmay strut and mouth upon the stage, and still hold his audience; but if he ever<br />\ngrimace where he thinks to frown impressively, the audience will laugh, and<br />\nhis spell over them be ended. And then follows hissing mingled with the<br />\nG. C. L.<br />\nlaughter, and the poor mime is driven from the stage.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nIN HONOR OF DR. ROWLAND.<br />\nNVITATIONS have been issued for the memorial meeting to the late Prof.<br />\nHenry Rowland, which will be held in the Johns Hopkins physical laboratory. The meeting will take place at noon on October 26. The address<br />\nof the occasion will be delivered by Dr. T. C. Mendenhall, formerly president<br />\nof the Worcester Polytechnic Institute. The Faculty of the University and all<br />\nthose interested in the life and scientific researches of Dr. Rowland will be invited to attend.<br /><br />\n3<br /><br />\nMEMORIAL TO DR. HENRY N. MARTIN.<br />\nLARGE bronze tablet to the late Prof. Henry Newell Martin was erected<br />\nlast week in the corridor of the Johns Hopkins biological laboratory,<br />\nwhich he founded, and over which he presided for many years. The<br />\ntablet is set in a heavy frame of dark wood.<br />\nA formal unveiling will take place sometime during the coming week.<br /><br />\n4<br /><br />\nASPIRANTS TO DEGREE OF A. B.<br />\nEAN GRIFFIN has announced the following men as eligible to the degree of A. B.: Messrs. E. B. Beasley, H. Beauwkes, E. P. Bernheim,<br />\nW. J. Butner, J. G. Campbell, R. T. Crane, A. G. Dew, Ross Miles<br />\nDiggs, R. S. Duck, J. T. England, H. C. Gillespie, John Sharshall Grasty,<br />\nFred L. Guggenheimer, W. H. Harris, Jr., H. H. Hazen, L. E. Hilderbrandt,<br />\nEben C. Hill, William B. Hill, William E. Hoffman, Jr., William Kirk, W.<br />\nH. Koppelman, D. I. Macht, Ogle Marbury, Charles Markell, Bartgis McGlone,<br />\nR. E. Moore, Lyman C. Murphy, Charles A. Myers, Marbury B. Ogle, Aubrey<br />\nPearre, Jr., I. R. Pels, Thomas C. Pinkerton, M. W. Powell, B. Swayne Putts,<br />\nC. F Ranft, H. B. Raffel, W. F. Reynolds, J. Abner Sayler, Jr., W. C. Schmeisser, Ralph C. Sharretts, L. P. Shippen, G. E. Sisco, John A. Slemmons,<br />\nSidney Smith, Harvey B. stone, H. P. Straus, Sol Strouse, Samuel Wolman,<br />\nPeregrine Wroth, Jr., and Elliot Strouse.<br /><br />\ncp<br /><br />\nJOHNS HOPKINS SCHOLARSHIPS.<br /><br />\nZ<br /><br />\nHE board of collegiate advisers has recommended the awarding of Hopkins Scholarships to the following Maryland men: Messrs. G. B. Rosenheim, S. H. Shapiro, and Reginald Opie.<br />\nThese scholarships are awarded by competitive examination to Maryland<br />\nmen who have passed all entrance examinations and have matriculated.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\nJOHNS HOPK.INS CLUB.<br /><br />\nZ<br /><br />\nHE formation of the Johns Hopkins Club is so recent an event that no<br />\ndetailed account of it seems necessary. But still it might he interesting<br />\nto mention briefly the aims which its founders had in mind, and which<br />\nthey have faithfully tried to realize.<br />\nFirst and foremost, is that of binding all former students of the University,<br />\nnot only to each other, but also to their Alma Mater. And unless something<br />\ndoes this successfully, the prestige of Johns Hopkins can never remain secure.<br />\nEvery man it sends out should be an enthusiastic partisan—always loyal, and<br />\nalways practical. If the club can keep these in touch with their University it<br />\nhas done a lasting service.<br />\nFor those who come from other colleges for advanced work the Club has a<br />\nspecial welcome. It balances the tendency to specialize by affording congenial<br />\nrelaxation and intercourse. Men from each department can become acquainted<br />\nwith men from the others, and all meet on neutral ground. All are welcome as<br />\nindividuals, and each stands on his own merits. It is the one place in our fair<br />\nland that is entirely exempt from politics in any form or shape, unless, perchance hypothetical discussions about outside affairs take place under its roof!<br />\nThe significance of this statement will be apparent to all who know the intricacies of a class election, or the \"points\" that must be possessed by many a man<br />\nwho \"makes\" his college athletic teams.<br />\nNot only for the graduate student, but also for the members of the faculty<br />\ndoes the Club offer a quiet retreat. It also furnishes an opportunity for the<br />\nfaculty to mingle with the graduate students, thus increasing the social atmosphere surrounding our teaching staff. Of immense value to the student is this<br />\nintimate and different relationship to his leaders, and those of the latter who<br />\nwish to make the most of their chance to develope the men who come under them<br />\nwill desire to enlarge their influence thus.<br />\nIn these ways the educational value of such a resort is immense, but there<br />\nare also other points of view.. In bidding for the support of all J. H. U. men. the<br />\nClub offers the neatest and coziest little house in the city,—so close to the<br />\nUniversity that distance does not count. There are all the usual facilities for<br />\namusement and recreation, to say nothing of eating and drinking, etc. The<br />\nlibrary and reading rooms are comfortable and inviting, and there is an excel<br />\nlent billiard table.<br />\nThe house is always open for inspection, and there will be an enthusiastic<br />\nhouse-warming on Saturday, October 26th, at which the faculty, alumni and<br />\ngraduate students, will all find a hearty welcome.<br /><br />\nR. L. McALL, '00.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nOCTOBER 23, 1901.<br />\nSubscription $1.50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902.<br />\n. SOL STROUSE, 1902.<br />\nEBEN C. HILL, 1902.<br />\n.<br />\nROBERT S. LANIER, 1903.<br />\nW.S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br /><br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483.<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nFTER the Senior class election, the president of the class spoke a few<br />\nwords concerning a \"policy\" for the year. Progressiveness and life<br />\nwere the keynotes to his remarks, and if proper support is given to the<br />\nclass officers, each student can anticipate a most pleasant year. A series of<br />\nclass meetings, to be informally held outside of the University, on Friday or<br />\nSaturday evenings, has already been arranged. Seniors—and all other Hopkinsonians—can welcome the prospect of these class reunions, for they will be<br />\na potent factor in unifying the Senior class, and thus exerting powerful influence<br />\nin bringing together factions in other classes. Incidentally, we can all have a<br />\n\"corking good time,\" and as it is a matter of open house for all, without the<br />\nformality of admission tickets, it is to be hoped that all naughty-two will be<br />\npresent on these occasions. Success along this line means more ambitious<br />\nschemes, and success in the more ambitious schemes means real college life at<br />\nHopkins, started by the class of 1902, and kept up by following classes. The<br />\npraiseworthiness of this object is apparent.<br /><br />\n4<br /><br />\nWORD regarding the cancellation of the Hopkins-Princeton game is perhaps in order. Our foot ball team has suffered not a little this year<br />\nfrom lack of material, or, perhaps . we had better say, lack of proper<br />\nspirit, for it is certain that there are a number of eligible men, especially in the<br />\nMedical School, who, if they chose to take the time, could very easily manage<br />\nto devote a few hours a week to foot ball practice. Other men in past years<br />\nhave found it no hardship to sacrifice a little of their time for the sake of Black<br />\nand Blue, and, in the end, have considered themselves repaid by seeing our<br /><br />\ngt<br /><br />\n_AMIN<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nUniversity come off victorious. This year, however, much of that spirit appears lacking, for despite the fact that the present Freshman class in the Medical School is larger than ever before the foot ball candidates from it are fewer in<br />\nnumber. During the past week several men have come over and practiced, and<br />\nwe appreciate and commend their spirit, and wish more would imitate it. Besides this, we had the misfortune, in our first game, to have three of our players disabled. Our team is light, raw, lacking in practice, and without an<br />\norganized \"scrub\" against which it can practice. All these things taken into<br />\nconsideration, it was deemed most inadvisable to venture against such a team as<br />\nPrinceton, whose superior weight, discipline, and experience would completely<br />\ndisorganize our team in its present condition. However, we have still several<br />\nweeks in which to constantly improve, and if our men will only come out, and<br />\nwork with a will, there is every reason to believe that we may end the season<br />\nwith the Maryland Interconegate League championship banner in our posses<br />\nsion.<br />\nEPORTS from other colleges that the \"lacrosse squad is out for practice\"<br />\ncontinually reach us even thus early in the season. This means that<br />\nmore interest is being shown in the sport, and that the colleges are now<br />\ngetting to work in earnest trying to develop strong lacrosse teams, where formerly the game was only au experiment. Each year has shown new rivals in<br />\nthe field, and each year has Hopkins been compelled to play for all she was<br />\nworth to keep her laurels. It is true that last year's championship banner does<br />\nnot adorn our trophy room, but nevertheless the record of the team was one to<br />\nbe proud of. Hopkins is going to try hard to win back that title this year, and<br />\nwe must work like trojans to do it, Therefore, when the captain of the lacrosse<br />\nteam calls for men, all who intend to go out with the team—and may your<br />\nnumbers be great—begin now. If you are \"green\" take your stick and ball<br />\nand learn to throw and catch; use up all your spare moments by tossing in the<br />\ncage, and try in every way to become proficient with the stick. Then when<br />\nregular practice commences, you will be ready to learn the game; and the<br />\nquicker you learn the game, the better are the prospects for Hopkins lacrosse.<br />\nShall we put out a great lacrosse team, again, as usual? \"It's up to you,\"<br /><br />\nIR<br /><br />\nDear Mr. Editor:<br />\nMy ambition is to become one of the editors of the NEWS-LKTTER, and, as<br />\nI believe that \"the early bird catches the worm,\" I am going to write a letter<br />\nright off in the hope of increasing my chances by so doing. I am now a student<br />\nof a big University, and am beginning to realize that there are other duties<br />\nincumbent upon tue besides cramming like I did when at the preparatory school.<br />\nLast Saturday I went out to the foot ball game, and yelled for Johns Hopkins. I certainly think my classmates should show a better college spirit, and<br />\nturn out more rooters at the games. I didn't see any of the Faculty members<br />\nthat I know out there. Do they ever get tickets, or go out to encourage the<br />\nattempts to uphold the athletic reputation of Johns Hopkins? They ought to,<br />\noughtn't they?<br /><br />\nTHE NEWS—LETTER.<br /><br />\n8<br /><br />\nI think the Juniors are extremely rough at times. They seem to be an illmannered class. Maybe it is because I don't know them. I hear that they are<br />\ngoing to take advantage of us in the cane rush. I reckon there will be lots of<br />\nwhat they call \"rough house.\"<br />\nI think Dr. Greene is an awfully nice old man. He seems to have such a<br />\nquiet, motherly way about him. He makes its write a lot of papers, though.<br />\nI am very fond of writing poetry, and have written several sonnets, which<br />\nI consider very good. I may send some in for the next issue. I want you to<br />\nsee that I am at least making an effort.<br />\nI think I shall try for the Glee Club, I have sung for the students upon<br />\nseveral occasions, but not in the University.<br />\nI promised my mother and father that I wouldn't learn to drink when I<br />\ncame to Hopkins. I saw two of our fellows going in Gordon's the other day,<br />\nso I turned ray head the other way and walked real fast. I think that's a<br />\nterrible habit, and very injurious. Mister McDermot says so.<br />\nI'll close now, hoping that my first attempt will meet with a favorite<br />\nYour humble servant,<br />\nreception.<br /><br />\nA FRESHMAN.<br />\nWe wish to call particular attention to the above letter, because the writer,<br />\nthough exhibiting a certain pardonable greenness, has, nevertheless some very<br />\ngood ideas concerning college spirit. We commend his first attempt, and by<br />\nhard work and diligence he may secure a position on the paper in the course of<br />\na few years. We would reco imend that his classmates follow his example in<br />\nattending the foot ball games, and rooting lustily for Hopkins. After he has<br />\nbeen here a little longer he will learn that our Faculty, with one or two notable<br />\nexceptions, have their minds so far elevated above this terrestrial sphere that<br />\nthey are hardly aware of the existence of college athletics. We also commend<br />\nthis freshman s noble resolve in shunning \"spiritual refreshment.\" We have<br />\nseveral horrible examples of the effects of the habit in our midst.<br /><br />\nDEPARTMENT NOTES.<br /><br />\nt<br /><br />\nHE Johns Hopkins Biological Department has more graduate students this<br />\nseason than for many years. There are about a dozen of them, seven or<br />\neight being newly entered.<br /><br />\nProf. E. A. Andrews worked all summer on the Massachusetts coast, not<br />\nfar from Woods Holl. He was busied with a study of protoplasm. Most of<br />\nhis work was microscopic, and dealt with marine forms, which he collected<br />\nhimself.<br />\nDr. Duncan S. Johnson, associate in botany, is still abroad. He has been<br />\nstudying in the University of Bonn. Before Christmas he will return to Baltimore.<br />\nDr. Caswell Grave, the instructor in zoology, was at Wood's Holl and at<br />\nBeaufort at different times during the summer. In addition to his private work<br /><br />\n-AMIN<br /><br />\nTHE NEWS—LETTER.<br />\nhe also engaged upon studies of the North Carolina oyster for the State of<br />\nNorth Carolina.<br />\nDr. J. E. Duerden, who is curator of the Institute of Jamaica, has been<br />\nworking in Baltimore all sumtner upon an investigation into the developement<br />\nof corals. He brought most of his subjects with him from Jamacia when he<br />\ncame to study at Johns Hopkins.<br />\nMr. H. F. Perkins brought back with him from the Bahama Islands many<br />\ninteresting specimens of jelly fishes. He went to collect for purposes of special<br />\nstudy.<br />\nTwelve graduates are working in the department of history snd politics.<br />\nAmong them are Mr. E. J. Benton, who left the University three years ago to<br />\nteach in Lafayette, Ind., where he has passed a very successful residence. Mr.<br />\nRobert Garrett is another of the number. Mr. J. W. Harry, fellow, has returned to the department.<br /><br />\nSTUDENT NOTES.<br />\nHURSDAY of last week the Glee Club had its first rehearsal of the season.<br />\nMany of last year's men came out, and the ranks were further reinforced<br />\nby eight or nine aspirants from the entering class; so there seems to be no<br />\nlack of material. Members and candidates at present are: Leader, Howard<br />\nEager; first tenors, Eyster, Humrichouse, Carver, Cowles, and Kinnane ;<br />\nsecond tenors, Warner, Nelson, Wright, Surrell, Converse, Dickey, and Stubbs ;<br />\nfirst basses, Eager, Hill, Meyers, King, Bryan, Stollemwerck, Thomas, Jackson,<br />\nand Snowden; second basses, Licking, Dochez, Mason, Gilman, Bost, Wroth,<br /><br />\ne<br /><br />\nand Marshall.<br />\nWilson Snowden, '03, has been chosen leader of the Mandolin Club, in<br />\nplace of Krager, '99, resigned.<br />\nThe Chess Club held its first meeting in the Trophy Room Thursday of<br />\nlast week. The following officers were elected: President, Markell,'02 ; Secretary and Treasurer, Sharretts, '02. A committee is now prepared to receive<br />\nentries for the tournament. It is intended that the Club this year shall extend<br />\nits victories to wider circles than in the past, and matches are to be arranged<br />\nwith some of the larger colleges.<br />\nPresent membership of the Club, 1901--Machen, Shippen, Booker, Slireve ;<br />\n1902—Markell, Sharrettt ; 1903, Sparrow, Addison, Glocker.<br />\nThe Senior Class Executive Committee consists of Beeuskes, Campbell,<br />\nCrane, Diggs, Gillespie, McGlone, Moore, Pels, together with Stone, president,<br />\nand Strouse, vice-president, ex-officio.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nATHLETICS.<br />\nATHLETIC BOARD NOMINEES.<br />\nVERY student should attend the meeting of the general Athletic Association, held Friday, October 25th, for the purpose of electing the Board<br />\nof Directors for the ensuing year. The following are the nominees:<br />\nFor President—Abercrombie, Garrett.<br />\nFor Vice-President—Sayler, Garrett.<br />\nFor Treasurer—Gillespie, Sidney Smith.<br />\nFor Recording Secretary—Jos. Smith, W. B. Hill.<br />\nFor Corresponding Secretary—Pagon, W. B. Hill, Hazelhurst.<br />\nFor Graduate Delegate--Converse, Artaud, Weedon.<br />\nFor Medical School Delegate--Houghton, Whipple, Casler, Riggs.<br />\nFor Alumni Delegate--Dr. Lanier.<br />\nFor Senior Delegates (2)—Campbell, Sharretts, Schmeisser, Bernbeim, S.<br />\nSmith, Putts, Gillespie.<br />\nFor Junior Delegates (2)—R. C. Hoffman, Tootle, Blauck, E. Schmeisser,<br />\nPlaggemeyer, P. Straus, H. Baetjer, Passagno, Hazelhurst.<br />\nFor Freshman Delegate (1)—N utnsen, Pearre, Wallis, Erlanger, Humrichouse.<br />\nThe two Faculty Delegates, appointed by the Trustees, are Dr. Renouf and<br />\nProf. Wm. M. Mackdermott.<br />\nJe FOOT BALL SCHEDULE. ,4<br />\nOCTOBER 26.—Gallaudet vs. J. H. U., at Washington.<br />\nNOVEMBER 2.—Haverford vs. J. H. U., at Ha,verford.<br />\nNOVEMBER 9.—P. M. C. vs. J. H. U., at Chester.<br />\nNOVEMBER 16.—J. H. U. vs. Western Maryland, at American League Park.<br />\nNOVEMBER 23.—J. H. U. vs. St. John's, at American League Park.<br />\nNOVEMBER 28.—(Thanksgiving Day), J. H. U. Vs. U. of M.. at American<br />\nLeague Park.<br /><br />\nJ. H. U., 24. ROCK HILL, 5.<br /><br />\nZ<br /><br />\nIIE foot ball season was opened Saturday 12th, at the American League Park,<br />\nwhen the wearers of the Black and Blue defeated a husky bunch of youngsters from Rock Hill College, by a score of twenty-four to five. The game<br />\nwas by no means such a walk-over as the score seems to indicate. The<br />\nvisitors<br />\nat times showed such pluck which would have taken all the heart out<br />\nof a<br />\nweaker team than the Hopkins team, and had it not been for the grim determination to win which was shown by Captain Gillespie's warriors, so imposing<br />\na score would not have been rolled up.<br />\nThe Collegians were much heavier than they were last year, several men in<br />\ntheir line being veritable stone walls. The Hopkins team, on the other<br />\nhand,<br />\nwas much lighter than in former years, but such work was done by them<br />\nthat no<br /><br />\nCOACH<br /><br />\nALEXANDER<br /><br />\nKING<br /><br />\nDIXON<br /><br />\nFOOT BALL SQUAD.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nloyal Hopkinsian should be ashamed of it. On the ends Captain Gillespie and<br />\ned<br />\nSharretts did most creditable work, Sharretts is to be especially commend<br />\nline,<br />\nthe<br />\nof<br />\nBack<br />\nend.<br />\nfor the beautiful run he made around Rock Hill's right<br />\nfor<br />\nall the men are to be lauded. To be sure, at times the backs ran high, but<br />\nforbe<br />\ncan<br />\nmistakes<br />\nthese<br />\nthe most part their work was of such character that<br />\nwas,<br />\ngotten if they promise to do it no more. Taken as a whole, the game<br />\nGilCaptain<br />\nand<br />\nseason,<br />\nindeed, as good as could be expected that early in the<br />\nland<br />\nwill<br />\nwho<br />\nmen<br />\nof<br />\nlespie can rightly think he has gotten together a crowd<br />\nanother inter-collegiate banner for the trophy room.<br />\nleft<br />\nFor the visitors, the most creditable work was done by Hernandez at<br />\n.<br />\nLaurence<br />\nand<br />\n),<br />\nend, and by the backs, Wall, Springer, McCool,(captain<br />\nThe game was started with a kick off by Sayler. After a couple of downs<br />\nof play a<br />\nand a fumble, Hopkins secured the ball, and in less than three minutes<br />\npassed<br />\nhad<br />\nminutes<br />\nfive<br />\ntouchdown had been scored by Blanck. And before<br />\nof<br />\nfavor<br />\nin<br />\nnothing<br />\nto<br />\nanother one had been made and the score stood twelve<br />\nbut<br />\nspirited,<br />\nquite<br />\nwas<br />\nplay<br />\nold \"Toni\" Hopkins. For a while after this the<br />\nran threesoon on a fumble of Beruheim's the ball was taken by Springer who<br />\nvisitors.<br />\nthe<br />\nfor<br />\nwn<br />\ntouchdo<br />\nquarters of the length of the field and scored the only<br />\n.<br />\nHopkins<br />\nby<br />\nsecured<br />\nJust before the half finished another touchdown was<br />\nintently<br />\nwas<br />\nand<br />\nspirited,<br />\nIn the second half, the play was much more<br />\nunable<br />\nwatched. Rock Hill put up a strong game, and the local warriors were<br />\nhad<br />\nwho<br />\nCrane,<br />\nhalf,<br />\nthe<br />\nto score more than one other touchdown. During<br />\ngot<br />\nmixed<br />\nWall,<br />\ntackle<br />\nto<br />\nng<br />\nbeen playing right tackle for Hopkins, in attempti<br />\nLazenby<br />\nup in a scrimmage and had his right shoulder dislocated. Mr. Maurice<br />\ntook<br />\nwho<br />\nLawson,<br />\naid.<br />\nmedical<br />\ny<br />\nof the Medical School, rendered the necessar<br />\nserious.<br />\nnot<br />\nwere<br />\ninjuries<br />\nhis<br />\nbut<br />\nCrane's place, had his knee cap wrenched,<br />\nThe line-up of the teams was:<br />\nROCK HILL.<br /><br />\nHOPKINS.<br /><br />\nGillespie (capt.)<br />\nWhipple<br />\nStone<br />\nCampbell<br />\nYearley<br />\nCrane, L,awson, Converse<br />\nSharretts<br />\nBernheim<br />\nStraus.<br />\nSayler<br />\nBlanck<br /><br />\n1. e.<br />\n1. t.<br />\n1. g.<br />\nc.<br />\nr. g.<br />\nr. t.<br />\nr. e.<br />\nq b<br />\n1 h b.<br />\nr. h b<br />\nf. b<br /><br />\nHernandez<br />\nDavis<br />\nCullen<br />\nDonaghy<br />\nBarnes<br />\nWetzler.<br />\nBrown<br />\nWall<br />\nSpringer<br />\nI,aurence<br />\nMcCool (capt.)<br /><br />\nEdward<br />\nReferee—William G. Lavelle, Rock Hill College. Umpire—J.<br />\nNeer,<br />\nF.<br />\nN<br />\nand<br />\nHill.<br />\nRock<br />\nEdelen,<br />\nE.<br />\nen—R.<br />\nLinesm<br />\nTyler, Johns Hopkins.<br />\nB. Atkinson, J.<br />\nJ. H. U. Timekeepers—J. B. Fink, Rock Hill, and Allman<br />\nH. U. Halves of 15 minutes.<br />\nJ. H. U.<br />\nTouchdowns—Sayler, 1; Straus, 1; Sharretts, 1; Blanck, 1, for<br />\nFor Rock Hill College, Springer, 1.<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br />\nHOPKINS, 6; M. A. C., 0.<br /><br />\nATURDAY'S game did not bring the expected score of 24-0 or someth<br />\ning<br />\nlike that. Still, it was a victory for Hopkins,not easily earned,<br />\nhowever.<br />\nSharretts kicked off for Hopkins, and M. A. C., failing in three<br />\ndowns to<br />\nlessen the distance between the pigskin and the goal posts,<br />\npunted. From<br />\nwhat followed it seemed that touchdowns by the Black and<br />\nBlue would be the<br />\nmost noticeable feature of the game. Hopkins started by<br />\nshoving the oval<br />\nbetween M. A. C.'s tackle and end for appreciable gains;<br />\nthen Sayler sailed<br />\nround left end, and received no hostile embraces until he had<br />\ngained ten yards.<br />\nGillespie now circled the other end, and with two good runs<br />\nscored the first<br />\ntouchdown for Hopkins, after the ball had been in play only<br />\nabout eight minutes. Sayler kicked a goal.<br />\nM. A. C. then kicked off, and shortly thereafter Hopkins<br />\nhad the ball on<br />\nM. A. C.'s five yard line again, the main feature of this advanc<br />\ne being a thirty<br />\nyard dash round left end by Sayler. Sayler then went through<br />\nright tackle for<br />\nanother touchdown, but as it seemed that the Hopkins right<br />\ntackle held his<br />\nopponent, the ball was brought back and given to M. A. C.<br />\nTurner then did the honors for M. A. C. to the extent of<br />\nabout thirteen<br />\nyards, and the ball then went to Hopkins on downs. The Black<br />\nand Blue soon<br />\nhad the oval within easy scoring distance, but were penaliz<br />\ned ten yards for an<br />\noff side play, and soon lost the ball on downs. After a short end<br />\nrun M. A. C.<br />\npunted to Sayler, who made a nice start, but had the ill luck<br />\nto fumble. Hopkins kept the oval, however,and after a twenty-five yard end<br />\nrun by Houghton,<br />\nthe first half ended with the ball on M. A. C.'s forty yard<br />\nline.<br />\nAt the beginning of the second half, Fesmeyer for M. A.<br />\nC. sent the ball<br />\nwhizzing to Yearly, who hugged it, and let himself go as far<br />\nas the forty-five<br />\nyard line. Houghton and Sharretts then travelled around<br />\nthe ends for good<br />\ngains, but on the next play Hopkins fumbled to M. A. C.<br />\nAfter a few mass<br />\nplays, the ball was punted to Bernheim, and soon thereafter<br />\nWhipple attempted<br />\na punt for Hopkins, but was blocked by M. A. C. Hopki<br />\nns kept the oval,<br />\nhowever, and by long end runs and mass plays put it within<br />\nfive yards of<br />\nanother touchdown. But it was \"so far and no farther,\"<br />\nand the ball again<br />\nwent over on downs. The pigskin now started the other way<br />\nwith M. A. C.<br />\nbehind it, but they lacked about two hours' time for a<br />\ntouchdown at the rate<br />\nthey were goiug, and the game was soon over with the<br />\nball on M. A. C.'s<br />\ntwenty yard line.<br />\nHopkins might have done better; still, she might have done<br />\nworse. In the<br />\nfirst half the Black and Blue held together well. in the<br />\nsecond half the team<br />\nwork was not so good. Fumbles were rather numerous<br />\non our side, but still<br />\nworse so on the part of M. A. C. Hopkins needs more<br />\npractice in catching<br />\npunts, as the work in this line was not quite up to the<br />\nnotch, also in open<br />\ntackling.<br />\nOne generally encouraging feature, however, during the<br />\nseason thus far is<br />\nthe way in which the men help each other, thus playing as<br />\na whole rather than<br />\nas individuals. Hopkins has shown great development in<br />\nthis line in the short<br /><br />\np<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\ntime the team has been working. Everything considered, the Black and Blue<br />\nhas shown up well thus far, and has not yet been defeated. Let us hope that<br />\nwe shall see the winning banner in our common-room after Western Maryland<br />\nand St. Johns have come and gone.<br />\nThe line-up of the teams was as follows:<br />\nM. A. C.<br /><br />\nHOPKINS.<br /><br />\nMitchell<br />\n.<br />\nc.<br />\nCampbell<br />\nDunbar<br />\nr g<br />\nYearly<br />\nSimmons<br />\n1. g.<br />\nStein<br />\nNaylor<br />\nr t.<br />\nHill<br />\nFesmeyer<br />\n1. t.<br />\nWhipple<br />\nSmith<br />\nr. e<br />\nSharretts, Houghton<br />\nPage<br />\n1. e.<br />\nGillespie (Capt.)<br />\nBryan<br />\nq.<br />\nBernheim<br />\nTurner<br />\nr. h. b.<br />\nSayler<br />\nPalmer<br />\nI. h. b.<br />\nStrause<br />\nWarfield<br />\nf. b.<br />\nPlaggemeyer.<br />\nLinesmen—Smith and Ewell. Umpire—Luthardt. Referee--Mackall.<br />\nTimekeepers--Riggs and Richards. Twenty minute halves. Attendance good.<br />\nMARYLAND INTER-COLLEGIATE MEETING.<br />\nHE Maryland Inter-Collegiate Association held its annual meeting at the<br />\nJohns Hopkins University last week. After the usual preliminary business of reading reports of officers and committees, the championship was<br />\nawarded to the Johns Hopkins University for the base ball, tennis, and track<br />\nand field teams. In reality the Hopkins was also entitled to the foot ball<br />\nchampionship, but there was no rule which applied to cases of the tie, and so<br />\nthe championship was not awarded to any college.<br />\nAs is well known, the Johns Hopkins team and the team from St. Johns<br />\nwon the same number of points, but as Hopkins held the championship for the<br />\nprevious year, it was evident that she was again entitled to it. However there<br />\nwas no provision for such an emergency, so the championship could not be<br />\nawarded to either team.<br />\nThe athletic committee was instructed to adopt a certain specific set of<br />\ntrack and field events, and to decide where to hold them. The lot fell to the<br />\nWestern Maryland College, in Westminister. So they will be held there if<br />\nconvenient, if not, they will take place at the Hopkins. One provision was<br />\nadopted which should recommend itself most highly. The relay race will not<br />\nbe run the same day as the other events, so that the relay men will be fresh,<br />\nand in good trim for the trial.<br />\nJust before the meeting adjourned the following officers were elected: James<br />\nA. Fectig, president, St. Johns; Ronald T. Abercrombie, vice-president, J. H.<br />\nU.; Wm. M. Macdermott, secretary, J. H. U.; and Charles A. Hotten, treasurer, Western Maryland.<br /><br />\nt<br /><br />\n14<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE MUSICAL CLUBS.<br />\nT length the trial of candidates is finished, and the clubs are beginning to<br />\npull together once more. On the whole, the prospect is encouraging,<br />\nthough there are a few places that are still vacant. More tenors are<br />\nneeded, and the Mandolin Club could find a place for a good cornetist if one is<br />\navailable. The schedule of trips is interesting, and should bring the clubs out<br />\nat the end of the year with a good surplus and many pleasant memories. Old<br />\nPoint is once more booked, and the Hopkins Clubs will have the best night of<br />\nthe week on which to give their concert. So far the schedule is: Johns Hopkins Hospital, November 29; Roland Park, December 6; Hannah More Academy, December 13; Christmas trip; Baltimore Concert, February; Bryn Marr<br />\nCollege, Pa., February; Annapolis; and Easter trip, March 29-April 3. Of<br />\ncourse this schedule is not entirely completed, and, perhap,, certain of these<br />\nconcerts may not be given, in which case others will be substituted. The<br />\nChristmas trip will probably include Winchester, Va., Charleston, W. V.,<br />\nHagerstown and Frederick. Any Hopkins men, graduates, medical school men,<br />\nor undergraduates, if musically inclined, are urged to come forward, and aid in<br />\nkeeping up the reputation that the clubs have won for themselves in previous<br />\nyears. The trips are delightful, the practice is beneficial, the acquaintances<br />\nformed are most pleasant, and the University will be aided by your effort.<br /><br />\ngI<br /><br />\nCOLLEGE NOTES.<br />\nUR old rival, Lehigh, has already begun lacrosse practice.<br /><br />\nO<br /><br />\nThe University of California, which is interesting to Hopkins men because<br />\nof Dr. Gilman's former connection with it, is actively engaged in organizing<br />\nmany student enterprises, and putting finishing touches to those already organ<br />\nized. The large number of men, and the great resources of the Western colleges<br />\ninevitably produce success in student undertakings. \"California has organized<br />\na rooters' club. Great enthusiasm is reported as a result.\" A good hint<br />\nfor us.<br /><br />\nY. M. C. A. NOTES.<br /><br />\nt<br /><br />\nHE Northfield Echo meeting which was held Tuesday, October 15, in Levering Hall, proved quite a success. It was held for the purpose of telling<br />\nthose who did not attend the conference about the daily routine while at<br />\nNorthfield, Mass., and of the great amount of fun to be had out of the ten days<br />\ncamp life while there. Thrilling tales were told of perilous climbs among the<br />\nmountains, and of jolly tramps through the surrounding country. From all accounts, the ten men who represented Hopkins at the conference must have had<br />\na howling good time while partaking daily of wholesome spiritual food. The<br />\ndelegation promises to be much larger next summer. The expenses of the out-<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\ning are comparatively small, and the experience is one never to be forgotten.<br />\nAmong those who spoke of the benefits and pleasures to be derived from attending the conference were: Messrs. Plaggemeyer, Addison, Pagon, Licking,<br />\nWood, Graft. Grove, Edmunds and Freeman. Dean Griffin was an interested<br />\nlistener at the meeting.<br />\nTHE AUCTION SALE;<br />\nor,<br />\nDog and Freshman.<br />\ntNDER the auspices of the Class of 1903, an interesting auction was held<br />\nlast Thursday in McCoy Hall basement. Just as the nine o'clock period<br />\nended, a young fox terrier appeared, and made himself so popular that<br />\nthe juniors decided on an auction as the only way of determining who should<br />\nbe his owner. A dozen Freshmen were eager for the honor of serving the<br />\nJuniors. Finally, a long, thin one was picked out, and elevated on a box. To<br />\nshow his appreciation of the dog's value and his own humbleness, he kneeled<br />\nreverently before the animal, muttering odes of praise. Then, to the intense<br />\ngratification of the Juniors, who enthusiastically crowded around him, he ran<br />\nthe bids up to 2S cents; and even more fabulous amounts might have been<br />\noffered, had not Mr. Christhilf, bereft and grief-stricken, suddenly appeared to<br />\nclaim his long-lost pet.<br />\nWe are glad to notice men of such intelligence and appreciation in the<br /><br />\nq<br /><br />\nentering class.<br />\nCLIPPED FROM THE EXCHANGES.<br />\nFor the benefit of the general student body, all our exchanges will again be placed on<br />\nthe table in the Y. M. C. A. reading room.<br /><br />\nTEMPORA MUTANTUR !<br />\nA maiden, to wedlock inclined,<br />\nBore always this saying in mind,<br />\nIn our grandmothers, time, long ago,—<br />\n\"Have more than One String to your Bow.\"<br />\nBut the Modern Maid of to-day<br />\nPuts the thought in another way;<br />\nShe says that this is the Thing,<br />\n\"Have more than One Beau on the String.\"<br /><br />\n—Occident.<br /><br />\nThere is more college love in the sacrifice of a penny, than a ton of words.<br />\n—The Occident, U. of Can.<br /><br />\nELEANOR ---\"I hear that the Geisha girls wear stockingettes instead of<br />\nstockings.\"<br />\nLusLIE---'`Oh, that's going too far, I think.\"<br />\nELEANOR—\"Not far enough, 1 think.' —Princeion Tier.<br /><br />\nr-<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br />\nA REGULAR CONTRIBUTOR.<br /><br />\nA hot sea-dog whom nothing could phase was sitting alongside the rail of<br />\nan Old Dominion liner one day reading the Atlantic Monthly, when a pale-faced<br />\nland lubber hailed him and drew rapidly alongside.<br />\nGlancing at the periodical in the H. S. D's lap, the new comer remarked<br />\nsadly, `Ah,me! I never wrote anything for the Atlantic Monthly, but I am,<br />\nnevertheless, contributing to the Atlantic Daily.\"—Tiger.<br /><br />\nJ. H. U., P. G.<br />\nDwelling on the heights of Science,<br />\nChewing hash at three a week,<br />\nBidding gaiety defiance,<br />\nReady on the world to wreak<br />\nTheories that cannot leak;<br />\nClad in trousers bright high water,<br />\nThus to symbolize a sorter<br />\nElevated tone of life;<br />\nMost emphatically rife<br />\nWith intellect's divinity:<br />\nWho can scorn all common strife?<br />\nNone other than the great P. G.<br />\nWhence doth come this great reliance?—<br />\nA harder word's not hard to seek—<br />\nFrom living in so close alliance<br />\nWith clouds upon a lonesome peak?<br />\nTo Learning has he sworn affiance:<br />\n\"No thesis to establish! Freak!<br />\nMan's chief end you'd surely orter<br />\nGrasp. (His grammar's often slaughter)<br />\nEt cetera; we'd like to knife<br />\nThe f— philosopher, but quick relief<br />\nComes in a laugh. Enormously<br />\nWe smile at him and his belief—<br />\nNone other than the great P. G.<br />\nPrince, the status quo's not one for grief,<br />\nNot all the world would just as lief<br />\nConsider things so stupidly<br />\nAs this queer bird and pleasure thief—<br />\nNone other than the great P. G.<br />\n—The Treadmiller.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n1'T E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the iterve and blood supply to<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\nW. T). BOWEN, M. D., T). 0.,<br />\nProst. &amp; Mgr.<br />\n-ESTABLISHED<br /><br />\n1879.—<br /><br />\nwooing zi[tor<br /><br />\nOittstor<br />\nVetOes<br /><br />\nIN GREAT VARIETY.<br /><br />\nJACOBI &amp; JENKINS,<br />\n215 N. CHARLES ST.<br /><br />\n$tiversinttbo.<br /><br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE<br />\nText Books. Note Books.<br />\nMadison&amp;HowardSts.<br />\nstudent's Su pplies.<br />\nIrtkLkN M. itOLLYDRY,<br /><br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. &amp; Asst. Soc'y.<br /><br />\nTHEO. WARNER.<br /><br />\nAgent for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 W EST 13A111'I M0R<br />\nSTREET.<br />\nManufacturers of<br />\ndir<br />\nSilk arid Cassiniere Hats. \" HOPKINS CAPS<br /><br />\n&amp; COLLEGE<br />\nSMITH'S SCHOOL<br />\nTEXT BOOKS.<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\nSTORF.<br />\n3rd door from Madison.<br />\nH. R. EISENBRANDT SONS,<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nBALTIMORE, MD.<br /><br />\nNew and Second<br /><br />\nliand Books Text Books, Note Books,<br />\nStudents' Requisites, etc. etc.<br /><br />\n201-203 N. CHARLES ST.<br /><br />\nBooks Bought, Sold and Exchanged.<br /><br />\nBALTIMORE, MD.<br /><br />\nWilson Keyser, Cashier.<br /><br />\nCommercial &amp; farmers Nalmal Bank,<br />\nHOWARD &amp; GERMAN STREETS,<br />\nBALTIMORE. MD.<br />\nOffers to<br />\nDepositors every facility which their Balances,<br />\nBusiness and Responsibility will warrant.<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER<br /><br />\nAPPLY TO<br /><br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS,<br /><br />\nNORTII GERMAN LLOYD S. S. Co.<br />\nCABIN PASSAUE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nJAMES R. PA INK<br /><br />\nNNT A F-4Z 11 R &amp;CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br /><br />\n000 N. ElY.17AW<br /><br />\nLawrence B. Kemp, President.<br /><br />\nH. McMATNS, D. 0.,<br />\nSoc'y. &amp; Treas.<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nBALTIMORE, MD.<br /><br />\nNEW YORK 'I 0 BREMUN.<br />\nLONDON, PARIS,GIBRALTER,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br /><br />\nMANDOLIN. GUITAR AND BANJO ..+1<br />\nTAUGHT<br /><br />\nMi!<br /><br />\nC. J. LIEYIN,<br />\nwho has made a life study of these nstruments. Mandolin Soloist of National reputation. Preparem Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. Ghafles St.<br /><br />\nBOOKS<br /><br />\nOLD A ND NEW<br /><br />\n1111<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New BoOks In the City.<br />\nBooks Bought, Sold and Exchanged. . . .<br />\nWM. V. PIPPEN,<br /><br />\n605 N. Eutaw Street.<br /><br />\nSMITH, DIXON &amp; CO.<br /><br />\nilgenfraz &amp;tuck.<br />\n°<br />\nSuccessor to Cummins<br /><br />\nPftPiji<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nStudents<br />\nnt to S<br />\nSpecial Discount<br /><br />\nTHE BLAKE Co.<br /><br />\nBaltimore<br /><br />\nshifiArtBsEND<br />\nNe<br />\nAS<br />\nckilvv<br />\nElt<br />\neS<br />\na:rroy,<br /><br />\nEtc.<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\n203 W. BALTIMORE ST.&amp; 2 S• LIBERTY ST.<br />\nBALTIMORE, MD.<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE &amp; CO.,<br />\nBANKERS BROKERS<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br /><br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\nThe Chas. Wills Surgical Instrument Company<br />\nBENJ<br /><br />\n29-31 N. Charles Street.<br /><br />\nA NELSON. GEN'L MANAGER<br /><br />\nPhysicians,' Surgeons,' Hoapital and Invalid Supplies.<br />\nFine Miorosoopes and Accessories.<br /><br />\nGoldbrau and Wurzburger,<br />\nAbsolutely Pure and Whole-some. None better on<br />\nAmerican Market.<br /><br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br /><br />\nA. H. Rutherfoord.<br />\nF. Lentz.<br /><br />\nJ, WM, MIDDENDORF &amp; CO.<br />\nVanfzers &amp; 1Brohere.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore, Md.<br />\nBaltimore Stock Exchange.<br /><br />\nB. G. EICI-IELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n.30E4 1`.3.cJir-t1-x (Fxesrlc,i<br />\nY. M. C. A. BUILDING.<br /><br />\nBaltimore, Md.<br /><br />\n300 N. Howard St.,<br /><br />\nLAGER BEERS<br /><br />\nGlobe<br />\nBrewery<br /><br />\nC. &amp; P. and Md.'Phones.<br /><br />\nNOM and Mechanics National Bank, CAR ON<br />\nOF BALTIMORE. MD.<br /><br />\nCapital Stock, $300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\nYOUR<br /><br />\nARE<br />\niiETWITtltliF<br />\nLAVEIA<br />\nN(11<br />\n)<br /><br />\nBALTIMORE, MD.<br /><br />\nJR'S. It. DOWNS,<br /><br />\n41<br />\n-<br /><br />\n229 M. Charles St.,<br />\nMASONIC TAMPLA•<br /><br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitation, Diplomas,<br />\nPrograms, Visiting t.7ards, etc<br />\nOur tiOa J.<br />\nU. Blue and Black Nag Paper—now reads<br /><br />\nEYLS<br />\nTHAN BLIND.<br />\nTHINK IT OVER.<br /><br />\nTHE NEWS LETTER<br /><br />\nSAYRE OPTICAL COMPANY,<br /><br />\nis from the Press of<br /><br />\n921 North Charles Street. (Masonic Temple.)<br /><br />\nPEARRE E.CROWL COMPANY<br /><br />\nIcXl+MINING<br /><br />\nMueller,<br /><br />\n5 West Lexington Street,<br />\n(London Studio)<br />\nFINEST PHOTOGRAPHIC<br />\nWORK IN THE CITY.<br /><br />\nSpecial attention given to Holiday Work<br />\nand Groups, Class Pictures, etc.<br /><br />\nPRINTERS AND<br />\nSTATIONERS<br />\nBALTIMORE<br />\nLight and Lombard Streets,<br />\nWe carry a full line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\nL.<br /><br />"}], "field_media_file": [{"target_id": 36200, "display": null, "description": null, "target_type": "file", "target_uuid": "78fe80fd-9c71-4a08-82c6-a8dbc13f547f", "url": "http://digital.library.jhu.edu/system/files/2022-03/12188-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12188, "target_type": "node", "target_uuid": "6915efc9-d261-469e-8529-8c0772eac5ef", "url": "/node/12188"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "3010a620-2ec2-4a58-8c6e-b789a6cf0f81"}]}