{"mid": [{"value": 36869}], "uuid": [{"value": "aaa80d84-0e37-4631-b892-6f6d0f33478f"}], "vid": [{"value": 36869}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:55:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13069-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:55:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:55:14+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 56<br />\n<br />\nBALTIMORE, MD., MAY 22, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nTOQUEVILLE MEDAL IN PUB- BIG FIFTH INNING GIVES HOPKINS<br />\nWINS<br />\nMIDDLE HOPKINS STICKMEN OVERCOME UNIVERSITY OF MARYMARYLAND 7-3 VICTORY<br />\nLIC SPEAKING WON BY B.<br />\nSTATES TRACK MEET AT<br />\nLAND BEFORE RECORD CROWD<br />\nOVER J. H. U.<br />\nJ. BAMBERGER<br />\nALLENTOWN<br />\nBlack and Blue Displays Greater Ability in 4-2 Victory Over Its<br />\nContest Held at Assembly Before Maryland Scores in But One In- Booth Scores Two Firsts. HamAncient Rivals<br />\nning. Marrian Relieved by<br />\n0. D. K. Initiation. Dr. Mableton Wins Shot and ProcUniversity of Maryland's hopes for an unusually brilliant lagoffin Speaker for Day<br />\nMaccubbin in Sixth<br />\ntor the High Jump<br />\ncrosse season were shattered last Saturday when the College Park<br />\nThough Maryland scored in but<br />\nThe annual Tocqueville Contest<br />\nJohns Hopkins track artists twelve bowed to the Black and Blue stickmen at Homewood Field.<br />\nin public speaking, held at last one inning against H.opmns, the won the eleventh annual Middle Playing before the largest crowd that has been seen at a lacrosse<br />\nThursday's assembly, ,A h Pro- home team lost 7-3. Marrian and States Collegiate Athletic Asso- game this year, the Hopkins team out-generaled the visitors in a<br />\nfessor Gilbert Chinard presiding-. Nihiser both pitched fine ball until<br />\nciation track and field meet last hard fought and exciting contest. For several minutes it seemed<br />\nwas won by Bernard J. Bamberg- the fifth, when a base on balls,<br />\nthe State team would take a large share of the spoils of the day,<br />\nSaturday at Allentown, Pa. La- that<br />\nCr, '23. The award for the con- four hits, three stolen bases, a hit<br />\nbut Coach Schmiesser's men proved their superiority in the Indian<br />\ntest is the Tocqueville Medal, of- batsman and a fielder's choce fayette finished second with 25 game by increasing their own score at a time when Maryland's attack<br />\nfered annually since 1898, by gave the College Parkers seven points. The other teams finished was staging a last-minute rally.<br />\nBaron Pierre de Coubertin, and runs. Saturday's encounter took in the following order: New York<br />\nCaptain John Murphy started<br />\nnamed after Alexis de Tocque- Marrian to the mound for his tr.'rd University, 16½; Rutgers, 16; MUSICAL CLUB CLOSES SUC- the point winning for the local<br />\nCESSFUL SEASON<br />\nville, a well krrown author of his- game this week, and had the Blue Washington and Jefferson, 15;<br />\nteam about five minutes after the<br />\nhis<br />\nhave<br />\nbeen<br />\nit<br />\nwould<br />\nJays<br />\nwon<br />\nFinal Concert Held at St. Michael opening of hostilities. The ball<br />\ntorical and political works. The<br />\nDickinson, 10; Haverford, 8; Leand All Angels' Church<br />\nhad passed from the possession of<br />\ngeneral topic for discussion this third. consecutive victory; but to<br />\nhigh, 6; Bucknell, 6; Juniata, 5;<br />\nThe Musical Club closed a most the J. H. U. players to Curly<br />\nyear was the French educational pitch three games in one week is<br />\nSwarthmore, 4; Delaware, 1½;<br />\nByrd's warriors when Hopkins'<br />\nsystem, with special attention to more than any arm can stand.<br />\nFranklin and Marshall, I. 5even successful season with the presMcCubbin<br />\nwent<br />\nto<br />\nthe<br />\nbox<br />\nin<br />\ncenter intercepted a throw<br />\nclever<br />\nthose features that might be imithe sixth. Marrian was moved to Black and Blue entries scored 46 entation of a concert before the from Marden to Branner, ran half<br />\ntated in America. As usual, the<br />\nMen's Club of St. Michael and All<br />\nhis regular position at third and points for their alma mater.<br />\nway down the field and shot a goal<br />\nspeeches were delivered in EngTwo records were hung up and Angels' Church last Friday even- from<br />\nSchacht•to center field.<br />\na distance of thirty yards.<br />\nlish.<br />\nIn the first Wallis and Semler one tied at this meet. Meyer of ing. The club at this time ap- Soon after Murphy made the initial<br />\nThe contestants-in the order in both went out 2-1, while Burdette Rutgers ran the 220-yard low hurtally he showed evidences of an inwhich they spoke and their sub- received a strike-out. In Hop- dles in the splendid time of 24.5 peared at its best, giving a concert<br />\nranking second only to the one jured leg. He limped on until<br />\njects were as follows:<br />\nkins' half, with two outs, Schacht seconds. This is one-tenth of a<br />\nHopkins scored again by a pretty<br />\n(1) George B. McCandless: singled. Marrian followed with a second better than the former given at the Maryland Casualty play from<br />\nTurnbull to Almy when<br />\n\"French Elements in the Towner- base-hit, advancing Schacht to Middle States record. Haslam, Clubhouse, thus sweeping away Stran Summers was<br />\nsent in to reStirling Bill.\"<br />\nthird, who scored on a wild pitch. pole-vaulter from Bucknell, broke all ideas of doubt as to the success lieve him. The remainder of the<br />\n(2) Edgar F. Wolf: \"ThorThe second, third and fourth the record in the pole vault, jump- of a concert so late in the season. first half was an unsuccessful bat1<br />\n2 inch higher than the preoughness in French Secondary saw no scoring by either side. In ing /<br />\nThe Glee Club started the con- tle of the Black and Gold to even<br />\n/<br />\n2inches.<br />\nEducation.\"<br />\nthe fifth the trouble was started vious record of 11 feet 111<br />\nby singing \"Honey I Wants up the score which the better<br />\ncert<br />\n(3) Bernard J. Bamberger : with the first batter when Marrian Leconey, of Lafayette, tied the<br />\nhad gathered against them.<br />\nYer Now\" and \"Old Black Joe.\" team<br />\n\"Aspects of the Intellectual and hit Simmons. Gardner ranned 220-yard dash mark of 21 3-5 secThe second period saw the reThe Mandolin Club played as its<br />\nMoral Training in French Pub- and Simmons stole second. Nihi- onds.<br />\nturn of Murphy to the contest and<br />\nThe individual honors resulted part of the program \"Minute<br />\nser trippled. Wallis was safe on<br />\nlic Schools.\"<br />\nthe substitution of Griffiss for AlThe judges, chosen from the a fielder's choice, but Nihiser in a triple tie for first between March,\" \"Last Game March\" and my. As soon as the play started<br />\nfaculty, were Dr. Francis E. A. scored. Burdette and Semler sin- Booth of Hopkins, Leconey of La- \"Favorite<br />\nSelections.\" Other Griffiss carried the ball up the<br />\nLitz, chairman; Dr. Fowler D. gled. Semler stole second and fayette and Myer of Rutgers. Each numbers on the program included side of the field, dodged past a U.<br />\nBrooks; and Professor Charles I. Pollock walked, Remsburg flied won two events. •<br />\nof M.defense man and shot a third<br />\nThe feature race of the day \"Golliwog,g's Cakewalk,\" a piano<br />\nSilen. The-decision in - favor of to second base. With the bases<br />\ngoal fcr the J. H. U. Next it V:P.S<br />\ndrunk, Watkins hit for a home turned out to be the 220-yard dash. solo by Mr. Sater; Impersonation Maryland's turn to score. The<br />\nBamberg-er was unanimous.<br />\nLeconey and Clarke easily led the of Joe Cook by Joe Moran and<br />\nAfter the Tocqueville Contest, run and Simmons went out third<br />\nvisitors worked the ball into their<br />\nfield<br />\nat this distance. Less than a popular selections by the Blue Jay<br />\nand before the initiation of new to first. Hopkins went out in the<br />\nterritory where they held it until<br />\nfoot separated them at the finish. Six.<br />\nThe concert ended with Branner slipped it past Routson<br />\nmembers into the Omicron Delta one, two, three order.<br />\nIn the 100 Clarke was put back a<br />\nNext<br />\ninning<br />\nGardner<br />\ndrew<br />\na<br />\nKappa Honorary Society, Dr.<br />\n\"Winter Song\" and the \"Univer- for their first tally. Branner reyard and could not catch the<br />\nContinued on page 3, col. 2<br />\npeated this within the next five<br />\nRalph V. D. Magoffin, a faculty<br />\nspeedy Leconey. Dorcus in the sity Ode,\" by the Glee Club.<br />\nminutes. After that the Black and<br />\nmember of the Society, spoke of<br />\nDuring the year the Musical<br />\nquarter-mile was badly spiked and<br />\nBlue defense was airtight.<br />\nthe importance and high standing BLACK AND BLUE TENNIS<br />\nClub filled a schedule larger than<br />\nconsequently<br />\nthe<br />\nfinished<br />\nout<br />\nof<br />\nTEAM TIES MARYLAND<br />\n\"Tex\" Barton prevented the<br />\nof the 0. D. K. The Phi Beta<br />\nmoney. West of Washington and had ever before been attempted.<br />\nTHREE-ALL<br />\nCollege Park boys from getting<br />\nKappa and several scientific soJefferson, won the event, but was Concerts were given at McDoncieties like it, according to Dr. Led by Captain Hofrneister, the disqualified for pushing. The push ogh, Franklin High School, Bel- too dangerous by keeping HiedelMagoffin, do not meet the need J ohns Hopkins tennis team bat- resulted in Dorcus being spiked. air, Westminster and First Meth- bach, their best bet, entirely out of<br />\nfor such organization altogether, tled to a draw in the match with Proctor won the high jump from odist Church. The first formal the play. The big Texan contrasted strangely with the might<br />\nbecause they do not give men rec- the University of Maryland last a poor field.<br />\nhome concert ever to be presentof<br />\na man against whom he played<br />\nSaturday<br />\non<br />\nthe<br />\nHomewood<br />\nognition until just before they<br />\nBooth was the Hopkins star ed was held at the Maryland Casbut<br />\nthe superior size won out for<br />\ncourts.<br />\nEach<br />\nteam<br />\nwon<br />\ntwo<br />\nof<br />\nleave college and because they<br />\nwith 10 points to his credit. Aar- ualty Clubhouse. Critics considHiedelbach<br />\ndid not break loose<br />\nthe<br />\nsingles<br />\nand<br />\none<br />\nof<br />\nthe<br />\ndouare not widely known among the<br />\nonson and Hambleton were next, ered the club at this time to be of<br />\nonce.<br />\nBenedict<br />\nand Middleton<br />\nbles<br />\nmatches.<br />\nunderclassmen. Not knowing of<br />\nwith 7 each; Clarke, 6; Proctor, equal standing with the famous<br />\nplayed<br />\nwell<br />\non<br />\nthe<br />\nBlack and Blue<br />\nThe hardest fought setto was 5; Hearn, 3; Norwood, 2.<br />\nPhi Beta Kappa, Freshmen often<br />\nDartmouth Club, which club has<br />\ndefense,<br />\nboth<br />\nof<br />\nthem<br />\nplaying on<br />\nmake little slips in their studies that between Hofmeister and ' The summary:<br />\ngiven numerous concerts in the<br />\nthe<br />\nattack<br />\nfor<br />\nthe<br />\ntime as<br />\npart<br />\nof<br />\nthat might have been avoided had Kimbrough, playing number one<br />\ncity.<br />\nTrack<br />\nEvents<br />\nwell<br />\nas<br />\ncovering<br />\nthe<br />\nopponents<br />\nthey known of the possibility of for their respective teams. HofThe new officers of the club are<br />\n100-yard Dash—Won by Lecowho were pitted against them<br />\nwinning the honor that goes with meister raced through the first set ney,<br />\narranging the schedule<br />\nalready<br />\nClarke,<br />\nsecond,<br />\nLafayette;<br />\nRoutson<br />\nand Sleasman, the rival<br />\nthe P. B. K. key, but which, nev- in easy fashion, winning it 6-1, Johns Hopkins; third, Aaronson, for next season.<br />\ngoalkeepers,<br />\nboth played well in<br />\nertheless, count against them in with Kimbrough seldom getting Johns Hopkins; fourth, Carol, Letheir<br />\nrespective<br />\npositions.<br />\nSOPHOMORES HOLD CLASS<br />\nthe end. The 0. D. K., having more than to points a game. In high. Time, 10 sec.<br />\nHopkins'<br />\nfourth<br />\ncount came tothe<br />\nsecond<br />\nset<br />\nKitnbrough's<br />\nMEETING<br />\nmore than the single standard,<br />\n120-yard Hurdles—Won by<br />\nward the end of th egame. Coady,<br />\nsteadiness<br />\nand<br />\nHofmeister's<br />\nerscholarship, as a basis for elecMeyer, Rutgers; second, Allen, At a meeting of the Sophomore after innumerable attempts to<br />\ntion, gives the underclassmen a rors gave the Marylander the first Haverford ; third, Allen, Lafay- Class held Thursday at 12:30 in<br />\ndodge his man, finally succeeded<br />\nfair chance for honors. The 0. three game. The Hopkins cap- ette; fourth, Riddaugh, Lafayette. the M. E. Building, Klinefelter,<br />\nand<br />\nplaced the rubber pellet into<br />\ntain<br />\nthen<br />\nmade<br />\na<br />\nmomentary.stand<br />\nD. K. counts five points in contreasurer of the class, reported a<br />\nTime, 10 1-10 sec.<br />\nContinued on Page 4, col. 3<br />\nand<br />\npulled<br />\nup<br />\nto<br />\n3-2, but Kim<br />\nsidering men for admission: scholRun—Won by Booth, surplus of thirteen dollars in the<br />\nOne-mile<br />\nbrough<br />\nran<br />\nthe set out 6-2. In<br />\narship, athletics, social leaderHopkins; second, Work- treasury. All outstanding debts, TURNBULL ELECTED PRESIthe<br />\nthird<br />\nand<br />\ndeciding frame Hof- Johns<br />\nship, debating and publications.<br />\nthird, Furbeck, including the deficit on the dance,<br />\nDickinson;<br />\nman,<br />\nDENT OF O. D. K.<br />\nmeister was unable to stroke the<br />\nDr. Magoffin emphasized the fact<br />\nfourth, have been paid. Sophomores who<br />\nYork<br />\nUniversity;<br />\nThe election of officers of the<br />\nball because of his opponent's pe- New<br />\nhave not paid their class dues,<br />\nthat a man's work, not the memculiar style of play. The lead in Wheeler, Washington and Jefferwill<br />\nhave the full amount taken local Beta Circle of the Omicron<br />\nbers of the society, is really what<br />\nthis set see-sawed back and forth, son. Time, 4.28 2-10.<br />\nDelta Kappa Honorary Society for<br />\nwins for him admission to the or440-yard Dash—Won by Mac- out of their caution money, it was<br />\nContinued on page 4, col. 3<br />\nthe coming year was held last<br />\nganization. In regard to the valdonald, Lafayette; second, Croll, further announced.<br />\nMorrill,<br />\nchairman<br />\nof<br />\nthe<br />\nKelso<br />\nue of the 0. D. K., Dr. Magoffin<br />\nThursday, May 17, at the Hopkins<br />\nLafayette; third, Malick, LafayPin Committee, reported that the Club, following the initiations of<br />\ntold of its rapid growth and the<br />\nSPECIAL<br />\nette. Time, 50 9-10 sec. ,<br />\nIt was learned at a late hour<br />\nenthusiasm with which the idea<br />\nTwo-mile Run—Won by Booth, matter of rings would be deferred new members.<br />\nyesterday that Major Garey<br />\nwas received whenever he menJohns Hopkins; second, Powell, until next year.<br />\nThe newly elected officers are:<br />\nhas been tendered the presiRutgers; third, Mullon, Dickin- President Klein suggested that<br />\ntioned it to college men on a redency of St. John's College.<br />\nson; fourth, Yater, New York the class have its own ring in the Douglas Turnbull, president;<br />\ncent trip to the West. The public<br />\nUniversity. Time, 9m. 55 6-I0s. June Week Circus. He is mak- James I. Bonner, vice-president;<br />\ninitiation of new members into<br />\nMeeting of entire News220-yard<br />\nHurdle—Won<br />\nby ing plans, at present, to carry out Pearce Coady, secretary; J. Edthe to. D. K. concluded the asLetter•staff 12.20 Friday.<br />\nsembly.<br />\nthis idea.<br />\nward Mount, treasurer.<br />\nContinued on page 3, col.3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 22, 1923<br />\n<br />\n2<br />\n<br />\n0. D. K. MAKES SUGGESTIONS NEW COLLEGIATE REGULA- DR. DUNLAP GIVES LECTURE<br />\nIN C. F.. HALL<br />\nTIONS ANNOUNCED BY<br />\nAS TO ELECTION OF A.-A.<br />\nREGISTRAR<br />\nBOARD OF CONTROL<br />\nDr. Knight Dunlap, professor of<br />\nFOUNDED 1897.<br />\nIn order for every member in experimental psychology at HopWhen the dust of the last meetUniversity to be thoroughly kins, has added his voice to the<br />\nthe<br />\ning of the Omicron Delta Kappa<br />\n$2.00<br />\nwith the new colleSubscription<br />\nHonorary Fraternity had blown acquainted<br />\nchorus of academic protests<br />\ngiate regulations, the News-Letter,<br />\na<br />\naway<br />\nof<br />\nnumber<br />\nsuggestions<br />\nupon suggestion of the Registrar, against the present mania for psyEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nhad been made to various organ- has thought it advisable to pub- cho-analysis. At a well attended<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nlecture last Thursday in the C. E.<br />\nizations on the campus which the lish extracts from the catalog.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nSociety believes will prove beneThe tuition fee in the College Hall on \"Behaviorism, FreudianHopkins University.<br />\nof<br />\nArts and Sciences is $230.00 ism and Instinct-Psychology,\" he<br />\nficial.<br />\nBusiness communications should be addressed to the BUSINESS MANannum, payable in two install- declared, \"Nothing could be more<br />\nper<br />\nReports of several committees<br />\nhGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nments<br />\n($150.00 October 1, $100.00 vicious or absurd<br />\nihould be sent to the MANAGING EDITOR.<br />\nthan the Freudwere made at this meeting. A<br />\nFebruary 1. Students who enian<br />\ndoctrine<br />\nthat<br />\nis bad.<br />\nrepression<br />\nHomewood 100 recommendation was made to the tered prior to October, 1921, pay<br />\nCelephone<br />\nGraduate Manager that some sys- $200.00 in two equal installments.) Repression is the Freudian term<br />\nManager<br />\nBusiness<br />\ntem of \"Calendarization\" be de- No one is at liberty to attend for the attempt to withdraw the<br />\nEditor-in-Chief<br />\n'24.<br />\n'25.<br />\nLEOPOLD,<br />\nHOWARD,<br />\nJOSEPH<br />\nPHILIP W.<br />\nvised by which managers of all classes until he has settled with attention from desires which are<br />\nteams will be required to set the Treasurer. For the use of the unethical or whose satisfaction is<br />\nManaging Editor<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\ndown in a specified book, at least library or reading room no addi- inadvisable. Parents and teachers<br />\nFITZGERALD DUNNING, '24.<br />\nAssistant Managing Editor<br />\na week before hand, information tional charge is made.<br />\nare urged to teach children not to<br />\nT. REESE MARSH, '24.<br />\nNo student will be enrolled unregarding time and place of<br />\nrepress.<br />\nCirculation Manager<br />\ngames, referees, and other infor- til he presents a receipt from the \"Actual<br />\nAssociate Editors<br />\nrepression; however, is<br />\nJOHN C. LEWIS, JR., '24.<br />\nRICHARD C. TILGHMAN,'25.<br />\nmation of this kind. This book is Treasurer.<br />\nthe<br />\nonly<br />\nof man if civilisalvation<br />\n'25.<br />\nPARSONS,<br />\nW.<br />\nJOHN<br />\nMembers of the upper classes<br />\nto be kept in the Athletic Office<br />\nBENJAMIN T. ROME, '25.<br />\nzation<br />\nto<br />\nis<br />\ncontinue,<br />\nand the abilManagers<br />\nBusiness<br />\nAssistant<br />\nand will be available to anyone must enroll in the forenoon of Sep- ity to repress effectively is the<br />\nJunior Editors<br />\nD. MILES MARRIAN, '25.<br />\nseeking this knowledge over tember 28 or September 29. A fine greatest asset a human individual<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nARTHUR L. NELSON, '26.<br />\nG. DONALD, GIESKE, '25.<br />\nphone or calling in person. This of $3.00 will be levied against can have. It is true that constant<br />\nERNEST A. STRATHMAN, '26.<br />\nJOHN T. DIXON,'24.<br />\nLEO C. MUTH,'24.<br />\nwill eliminate, it is believed, any those failing to enroll on the days struggle is bad and the struggler<br />\nA. J. McKAYf '26.<br />\nALGER G. Hiss, '26<br />\ninaccurate statements given over named.<br />\nC. EUGENE TOVELL, '24.<br />\nneeds aid in repressing. In partiEDWARD 0. MICHEL, '26.<br />\nIf, for any reason, a student<br />\nthe phone or otherwise, by percular<br />\nthe adolescent need to have<br />\nabsolve a course<br />\nsons who may be present in the does not repeat or<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\ntheir attention drawn away from<br />\nin which he has failed, he may,<br />\nAthletic Office in the absence of<br />\nsurging desire and turned in other<br />\nwith the consent of his Adviser,<br />\nor<br />\nthe<br />\ncoaches.<br />\nmanagers<br />\nMd.<br />\nBaltimore,<br />\nSts.,<br />\nSouth<br />\nand<br />\nLombard<br />\nCo.,<br />\nPrinted by The Read-Taylor<br />\nsubstitute another course of equal directions.<br />\nIt was also recommended to<br />\n\"It is just those features of the<br />\nvalue, but in every case he will be<br />\nthe Publicity Board that it will<br />\nmovies<br />\nand other details of modrequired, as a penalty for leaving<br />\nBALTIMORE, MD., MAY 22, 1923<br />\nappoint one person, whose sole<br />\nlife<br />\nern<br />\nwhich interfere with the<br />\na course uncompleted, to take an<br />\nduty it will be, to keep in a pubrepressions<br />\nwhich are most deploradditional course which will not<br />\nlic place a chart of the day, with<br />\nable.<br />\nbe credited toward the 125 points<br />\nA LOSS<br />\nall the hours, which will be filled<br />\n\"So far as I can make out Freud<br />\nrequired for graduation.<br />\nand<br />\nhis disciples have contributed<br />\nThe words \"professor\" and \"faculty\" are often pet aversions of in with the names of the organiNo student may count for gradthe college student. They bring to mind wearisome lectures, lack of zations having future meetings. uation more than two courses in nothing of value to psychology,<br />\nunderstanding and lack of sympathy. The average undergraduate This chart is to be posted in the which his grade for the year is be- and if they have contributed anything to medicine it is rather discannot see why the professor does not realize that one cannot study most prominent place possible. low 7.<br />\nthe<br />\nto medicine to have<br />\nbefore<br />\ncreditable<br />\ndates<br />\nthese<br />\nHaving<br />\nthe<br />\non<br />\nheld<br />\nbe<br />\nnot<br />\nshould<br />\nlectures<br />\nthat<br />\nand<br />\nparty<br />\nafter an all-night<br />\nA student transferring from one<br />\nfar<br />\nit<br />\nbeen<br />\nso<br />\nbehind the progress of<br />\nbeforehand,<br />\nposted<br />\nand<br />\npublic<br />\nfaculty<br />\nthe<br />\nof<br />\ninterests<br />\nThe<br />\ngame.<br />\nfootball<br />\nday of a championship<br />\nundergraduate school to another<br />\nthat it could profit by<br />\npsychology<br />\nall<br />\nwith<br />\naway<br />\ndo<br />\nwill<br />\nhoped<br />\nis<br />\nextremes.<br />\nopposite<br />\nat<br />\noften<br />\ntoo<br />\nare<br />\nstudent<br />\nmember and those of the<br />\nand having a failure in the former.<br />\nthis<br />\nmixture<br />\nof psychology and<br />\nmeetings<br />\nthe<br />\nbetween<br />\nconflicts,<br />\nmust, in addition, to the regular<br />\nEvery now and then, however, a faculty member appears who<br />\nsuperstititon.\"<br />\nwish<br />\nwill<br />\nmen<br />\nsame<br />\nthe<br />\nwhich<br />\nat<br />\nrequirements for a degree in the<br />\ncan see the undergraduate's point of view and can sympathize with<br />\nDr. Dunlap, who has been called<br />\nall future school which he is entering, make<br />\nof<br />\nNotices<br />\nattend.<br />\nto<br />\nplace<br />\na<br />\nwins<br />\ninvariably<br />\nand excuse his many shortcomings. This man<br />\nthe<br />\n\"father of Behaviorism,\" deposted<br />\nbe<br />\nto<br />\nhave<br />\nwill<br />\nmeetings<br />\nup the failure or offer an additionfor himself in the hearts of the usually undemonstrative college studal<br />\ned<br />\nthat it was not intended enof<br />\nthe<br />\nadvance<br />\nat least a week in<br />\nal equivalent course.<br />\ndents.<br />\ntirely<br />\nto supplant introspection.<br />\ntime of the meeting.<br />\nSuch a man is Major Enoch B. Garey, and it is .with a feeling of<br />\nHe<br />\nalso<br />\nremarked that BehaviorAnother recommendation is to CHRISTIAN SERVICE CLUB<br />\ndeep regret that the undergraduates learn that, at the expiration of the be sent to the A. A. Board, which<br />\nism carried to the extreme, that is<br />\nHOLDS ELECTION<br />\nnow popular among experimentpresent collegiate year, he will sever connections with the University. provides that a new method of<br />\nTuesday, May 15, the ers, becomes almost ridiculous.<br />\nLast<br />\nMajor Garey's term of service at Johns Hopkins has not been a long elections be devised which would<br />\nHis principal attack was directone. In the few years, however, that he has been at Homewood he avoid the elimination of men who Christian Service Club elected the<br />\nhas been a staunch supporter of activities, has worked tirelessly in have received the second and following officers for the next ed at Instinct-Psychology, which<br />\nthe interests of Johns Hopkins and has conic to be admired and third highest number of votes for scholastic year: President, Paul he declared to be practically meanrespected by the undergraduate body. The esteem in, which the stu- a certain office. This man might Sylvester,'24; vice-president, Wil- ingless. His argument was that<br />\nReno the terms<br />\ndents hold him is demonstrated by the fact that Major Garey was be better able to fill another of- liam McVaul,'24; secretary,<br />\n\"instinct\" and \"UnconAllison<br />\nscious\" are both merely classificaelected to the Honorary Presidency of the Class of 1924 and as an fice than the person who has ac- Harp, '26; treasurer,<br />\nLong, '25.<br />\nactive faculty member of Omicron Delta Kappa.<br />\ntions which are applied to psychotually been elected. This might<br />\nThe club is preparing plans for logical phenomena which cannot<br />\nthe<br />\nto<br />\nloss<br />\nundoubted<br />\nan<br />\nprove<br />\nwill<br />\nMajor Garey's departure<br />\nlikewise, eliminate to some ex- its activities for next year on a<br />\nUniversity and it will be keenly felt by all Who knew him and, espe- tent, men who are not connected larger scale because of the stu- be explained. Consequently, he<br />\npointed out, it is absurd to call a<br />\ncially, by those who were associated with him.<br />\nwith Athletics. It is planned to dents who will reside in the new<br />\nan explanation.<br />\nclassification<br />\nnominate 15 seniors, 10 juniors, 5 dormitory.<br />\nsophomores and to have a vote<br />\nThe Christian Service Club is a<br />\nLAST ELECTRICAL CLUB<br />\nENTER: THE BARNSTORMERS<br />\ntaken on these men. The highest Hopkins religious organization<br />\nMEETING HELD<br />\nThe last regular meeting of the<br />\nSupporters of Hopkins undergraduate activities have noted with man in the senior group will be that is interested in religious and<br />\nJohns Hopkins Electrical Club<br />\npleasure the rapid expansion and improvement in the condition of the President of the A. A. Board social topics.<br />\nwas held last Friday afternoon,<br />\nthese activities within the last few years. Under a new athletic or Student council. The second<br />\nregime the Varsity teams have at last found themselves established highest would be President of \"CAMPUS CLUB\" FORMED May 1 8, in the Mechanical Engiupon a firm financial basis and are advertising the name of Hopkins the one of these two considered<br />\nWorking under the belief that neering Building. The address:<br />\nThis<br />\nin Hydroelectric<br />\nthroughout the collegiate world. Non-athletic activities, too, through of second importance.<br />\nJohns Hopkins needs an under- \"Precautions<br />\nthe medium of a Student Activities Fee, have found a means of sup- method of determination is to be graduate club to further school Operation,\" was given by J. T.<br />\nport. This year it is more than probable that, for the first time, none worked out later.<br />\nspirit and to bind students togeth- Dixon, a junior in the Electrical<br />\nA further recommendation was er, a body of upper classmen met Engineering Department.<br />\nof the undergraduate organizations will show a deficit at the close of<br />\nthe collegiate year.<br />\nMr. Dixon traced the gradual<br />\nmade that the Athletic Council after last week's assembly and<br />\nBand,<br />\nthe<br />\nsupport<br />\nimprovement in hydroelectric<br />\nWith this improvement, however, the expansion of the activities be asked to<br />\nformed the \"Campus Club.\"<br />\nto<br />\nmuch<br />\nso<br />\ncontribute<br />\nthey<br />\nsince<br />\nlookthe<br />\non<br />\never<br />\nis<br />\norganization<br />\nEach<br />\nstandstill.<br />\na<br />\nto<br />\nhas not come<br />\nUnder this tentative name the power station operation, laying<br />\nteams.<br />\nthe<br />\nof<br />\nsuccess<br />\nthe<br />\na<br />\nat<br />\ndemonstrated<br />\nwas<br />\nThis<br />\nfact<br />\nconquer.<br />\nto<br />\nout for new worlds<br />\nmembers set to work to draw up particular stress on safety in opand<br />\nappropriately<br />\nnow<br />\nClub,<br />\nDramatic<br />\nerstwhile<br />\nrecent meeting of the<br />\nplans for their future work on the eration. A large number of elecTO<br />\nannounced<br />\nJAY<br />\nwas<br />\nBLUE<br />\nit<br />\nAND<br />\nwhen<br />\nBLACK<br />\nBarnstormers,\"<br />\ncolloquially known as \"The<br />\ncampus. Upper classmen only will trical engineering students heard<br />\npresented:<br />\nbe<br />\nwould<br />\n1<br />\nJUNE<br />\ncomedy<br />\nAPPEAR<br />\nmusical<br />\nins<br />\nbe eligible and at present it is in- the talk.<br />\nthat next year an all-Hopk<br />\nalso<br />\nThis meeting closed one of the<br />\nwas<br />\nIt<br />\nundergradutes.<br />\nwritten, staged, and acted by Hopkins<br />\nThe next and final issue of the tended to have the members chostrip,<br />\nroad<br />\nsuccessful seasons since the<br />\nmost<br />\nextensive<br />\nannounced that the production would take an<br />\nBlack and Blue Jay will appear en from the student body at large<br />\n•<br />\ncovering, perhaps, some of the larger cities of the East and South.<br />\nabout June 1. The issue is to be with rules limiting the number of organization of the local society.<br />\nThe benefit which a University derives from a trip such as is called \"June Week,\" and its con- fraternity men to one-third of the One of the most important feataken yearly by the Pennsylvania \"Mask and Wig\" and the Princeton tents have been prepared with ref- total membership. This, it is tures during the post scholastic<br />\n\"Triangle Club\" is seldom realized. If the \"Barnstormers\" are able erence to this celebration. Five hoped, will create better school year has been the address given<br />\nto place a creditable production on the road, it will raise immeasurably hundred additional copies have spirit and comradeship between by the student members of the<br />\nbeen ordered as a supply for the non-fraternity men and the mem- club. These speeches were all<br />\nthe prestige of Hopkins undergraduate activities.<br />\nThe News-Letter wishes the Barnstormers all sorts of good young ladies' entertainment dur- bers of the various chapters at the given on topics on which the talkers have had actual experience.<br />\ning the week.<br />\nUniversity.<br />\nfortune.<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 22, 1923<br />\n0. D. K. TO FORMULATE DOR- CIVIL ENGINEERING SOCIETY<br />\nMITORY REGULATIONS<br />\nPLANS ELABORATE<br />\n\"BLOWOUT<br />\nFaculty representatives have reThe<br />\nJohns<br />\nHopkins' student<br />\ncently appeared before the Omicron Delta Kappa Honorary Soci- chapter of the American Society<br />\nety and requested that the society of Civil Engineers is planning an<br />\nformulate rules for the new dormi- elaborate \"blowout\" to come off<br />\ntories. A committee, of which D. some time in the near future. This<br />\nK. Vanneman is chairman, is now affair vill be held as a sort of climax to one of the most successworking on the matter.<br />\nful<br />\nseasons that the organization<br />\nQuestions to be considered by<br />\nthis committee include: the entire has yet enjoyed. Those in charge<br />\ngovernment of the dormitory; the of the affair are James H. Wills,<br />\nrequirements for living in the dor- president of the Society, and<br />\nmitories; the advisability of al- Frederick F. Moehle, treasurer.<br />\nThe members of the organization<br />\nlowing certain organizations to,<br />\nwill not be asked to contribute<br />\ntake suites; whether classes shall anything for the \"blowout\", for it<br />\nbe segregated or mixed; and the is<br />\nplanned to use the surplus<br />\nlike.<br />\nfunds of the Society for this purThe O. D. K. also announces<br />\npose.<br />\nthat it will probably be of interest<br />\nThe last meeting of the Socito the student body that represenety for the current season was<br />\ntaties of the faculty have appeared<br />\nheld last Tuesday evening, May<br />\nseveral times before the circle dur8, at the Baltimore Engineer's<br />\ning the last scholastic year and reClub, Redwood and Light streets.<br />\nquested aid in matters important<br />\nThis<br />\nmeeting was held in conto the university. junction<br />\nwith the Baltimore secMuch of the most important<br />\ntion of the American Society of<br />\nwork of the society_ this year has<br />\nCivil<br />\nEngineers. The speaker of<br />\nbeen of such a nature that it has<br />\nthe<br />\noccasion<br />\nwas J. H. Waterman<br />\nnot been advisable to make it pubsuperintendent of Timber Preserlic.<br />\nvation of the Chicago, Burlington<br />\nand<br />\nQuincy Railroad. His subPUBLIC HEALTH WORK OF\"The Preservative Treatject<br />\nwas<br />\nFERED HOPKINS STUDENTS<br />\nCross Ties and Strucment<br />\nof<br />\nW. F. Draper, Assistant Surtural<br />\nTimbers.\"<br />\ngeon General of the United States<br />\nPublic Health Service, Washing- Big Fifth Inning Gives Maryland<br />\nton, D. C., has issued a call for<br />\n7-3 Victory Over J. H. U.<br />\nuniversity students to engage in<br />\nContinued from page 1<br />\npublic health work during the base on balls, Nihiser hit into a<br />\ncoming summer vacation. Johns double-play, short to second to<br />\nHopkins undergraduates were in- first, Wallace singled, going to<br />\nvited to participate in this work in second on Smith's error, and Bura letter from Al r. Draper to Dr. dette hit to pitcher. For HopWilliam H. \\\\Teich, Director of the kins,. Grace walked, Rich flied to<br />\nJohns Hopkins School of -Hygiene right and Schacht singled, advancand Public Health.<br />\ning Grace to third. Schacht stole<br />\nThe Public Health Service has second, but when Marrian was out<br />\nrecently received from the West at first, the former was caught<br />\nVirginia Department of Health a with too big a lead.<br />\nrequest for information regarding<br />\nAgain in the seventh neither<br />\nthe availability of college students team scored. The eighth brought<br />\nin public health work during the Hopkins another tally. Rich sinsummer. The need in this state gled and Schacht was hit by pitchfor men is particularly urgent. er. Marrian singled, scoring<br />\nThe Chief Engineer of the Divi- Rich, but Schacht was put out at<br />\nsion of Sanitary Engineering de- the plate.<br />\nclares that he needs a number of<br />\nMaryland failed to score in the<br />\nmen to carry on rural sanitation last inning, while Hopkins shoved<br />\nactivities in his department.<br />\nacross another run. Merrick tripThe State Departments of led and scored on error by the secHealth of South Carolina, Michi- ond-baseman.<br />\ngan, Pennsylvania, Alabama, and<br />\nThe score:<br />\nConnecticut also expressed an inMARYLAND<br />\nAB. R. H. 0. A. E.<br />\nterest some weeks ago in the posWallis, 3b<br />\n4 1<br />\n1<br />\n1 0 0<br />\nsibility of being able to obtain stu- Burdette,<br />\nss<br />\n5 1 2 2 1 0<br />\ndents for short term positions.<br />\nSemler, cf<br />\n5 I<br />\n1<br />\n1 0 0<br />\n2 1<br />\n1 11 1 0<br />\nCompensation in most states is Pollock, lb<br />\nRemsburg, If..<br />\n4 0 0 0 0 0<br />\nnot large. However, Hopkins un- Watkins, c<br />\n1 10 1 0<br />\n4 1<br />\n1 0<br />\n2 I 0 1<br />\ndergraduates who contemplate en- Simmons, rf<br />\nGardner, 26<br />\n1<br />\n3 0 0 0 1<br />\nprofit<br />\nwork<br />\nwill<br />\nof<br />\nline<br />\ntering this<br />\nNihiser, p...<br />\n4 1 2 1 6 0<br />\ngreatly by the vast amount of<br />\nTotals<br />\n33 7 8 27 II<br />\nI<br />\npractical experience this type of<br />\nHOPKINS<br />\nwork offers.<br />\nAB. R. H. 0. A. E.<br />\nTAU BETA PI HOLDS ELECTION OF OFFICERS<br />\nAn election of officers for next<br />\nyear was held at a dinner last<br />\nMonday night by the Tau Beta Pi<br />\nHonorary Engineering Fraternity.<br />\nThe dinner, held at 8 o'clock in<br />\nthe Barn, was the last affair of the<br />\nscholastic year for Tau Beta Pi.<br />\nNew officers elected at this time<br />\nwere: Edward J. Mount, president; Lawrason Riggs Kent, vicepresident; Hugh M. Smallwood,<br />\ncorrespotding secretary; Lee Kinsey, recording secretary; John<br />\nThomas Dixon, treasurer.<br />\nWilliam North Crout was elected arif associate editor of the national publication of the society,<br />\n\"The Bent.\"<br />\n<br />\nGrace, ss<br />\nRich, rf<br />\nSchacht, 3b, cf.<br />\n.<br />\nMarrian, p, 3b.<br />\nMerrick, lb<br />\nSmith, If<br />\nThomas, 26<br />\nHolland, c<br />\n.. • •<br />\nDannatell, cf.<br />\nMcCubbin, p.. • .<br />\n1 Asendorf<br />\n<br />\n2<br />\n4<br />\n3<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n1<br />\n1<br />\n1<br />\n<br />\n0<br />\n1<br />\n1<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n<br />\n0 1<br />\n1 0<br />\n2 2<br />\n2 0<br />\n1 11<br />\n1 2<br />\n0 4<br />\n0 5<br />\n0 2<br />\n0 0<br />\n0 0<br />\n<br />\n4<br />\n0<br />\n2<br />\n0<br />\n1<br />\n0<br />\n4<br />\n1<br />\n0<br />\n1<br />\n0<br />\n<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n1<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br />\n<br />\nTotals<br />\n32 3 7 27 13 2<br />\n1 Batted for McCubbin in ninth.<br />\nMaryland ... .0 0 0 0 7 0 0 0 0-7<br />\nHopkins<br />\n.1 0 0 0 0 0 0 1 1-3<br />\nThree-base hits—Nihiser, Merrick.<br />\nHome run—Watkins. Stolen bases—<br />\nSimmons, Wallis, Semler, Pollock, Burdette. Sacrifice hit—Grace, Double play<br />\n—Grace to Thomas to Merrick; Grace<br />\nto Thomas to Merrick. Left on bases—<br />\nHopkins, 6; Maryland, 6. Bases on balls<br />\n—Off Marrian, 4; off Nihiser, 2; off<br />\nMcCubbin, I. Hits —Off Marrian, 6 in<br />\n5 innings; off McCubbin, 2 in 4 innings. Hit by pitcher—By Marrian (Sim<br />\nmons); by Nihiser (Schacht). Struck<br />\nout—By Nihiser, 10; by Marrian, 2.<br />\nWild pitch—Nihiser. Losing pitcher—<br />\nMarrian. Umpire—Davern.<br />\n<br />\n3<br />\n<br />\nDamon-\"Do you really think that a<br />\ngood pencil helps you to do<br />\nbetter work?\"<br />\n<br />\nf Custom. Quality.<br />\n<br />\nPythias—<br />\n\"I know it does! Why, I'm<br />\neven able to read my own<br />\nhandwriting, now that I've<br />\nstarted using a Dixon's<br />\nEldorado!\"<br />\n<br />\nairoVArbo<br />\n7he masterdrawikkpeizdl<br />\n17 leads—all dealers<br />\n<br />\nN.Charles Street.<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nTOM LANDY,<br />\nManager<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nThe Flag, Banner & Pennant Shop<br />\n<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools, Transfer and Baggage Express<br />\nSocieties and Fraternities<br />\nAUTOMOBILE SERVICE<br />\n302 PARK AVE., BALTIMORE, MD. PHONE, HOMEWOOD 6886<br />\nVernon 2355<br />\nR. H. Taylor<br />\n<br />\nCOGGINS'<br />\n<br />\nA. FADER<br />\n& SON<br />\nPIPES<br />\n<br />\nR.G. by & Company<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br />\n<br />\nAll the Popular Makes and Styles DRUG STORE for J. H. U. BOYS<br />\n<br />\nThe BARN<br />\nCAFETERIA<br />\nHot Dinners, Sandwiches,<br />\nCandies, Sodas, Cigarettes,<br />\nTobacco, etc.<br />\nAT THE BARN<br />\n<br />\nPHONE, HOMEWOOD 2121<br />\n<br />\n210 E. Baltimore St.<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of the<br />\nJohns Hopkins News..Letter<br />\n<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\n,Ar<br />\n<br />\nGuarantees More Power and<br />\nMileage to Every Gallon<br />\n<br />\nLUeXatterif<br />\nJAT,A<br />\nH.& OSCAR G.L.—<br />\nOWNERS<br />\nw<br />\n<br />\n40r-<br />\n<br />\n29 E. Baltimore St.<br />\n-The Wonder Motor Fuel\"<br />\nSherwood Brothers, Inc.<br />\n<br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\n<br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nHopkins Wins Middle States<br />\nTrack Meet<br />\nContinued from page 1<br />\n<br />\nMeyer, Rutgers; second, Hearn,<br />\nJohns Hopkins; third, Allen, Haverford ; fourth, Alderetta, W. &<br />\nJ. Time, 24 5-10s.<br />\n220-yard Dash—Won by Leconey, Lafayette; second, Clarke,<br />\nJohns Hopkins; third, Carol, Lehigh; fourth, Macdonald, Lafayette. Time, 21 6-10s.<br />\nHalf-mile Run—Won by Furbeck, N. Y. U.; second, Williams,<br />\nLafayette; third, R. Norwood,<br />\nJohns Hopkins; fourth, Zozel, N.<br />\nV. U. Time, 2m. 1 2-10s.<br />\nField Events<br />\nShot-put—Won by Hambleton,<br />\nJohns Hopkins; second, Wilgohs,<br />\nW.& J.,; third, Asplundh, Swarthmore; fourth, Loehler, Lafayette.<br />\nDistance, 37 ft. 10/<br />\n1<br />\n2 in.<br />\nJavelin Throw—Won by West,<br />\nW.& J.; second, Carpenter, Dickinson ; third, Asplundh, Swarthmore; fourth, Ginsburg, N. Y. U.<br />\nDistance, 174 ft. 9 in.<br />\nPole Vault—Won by Haslam,<br />\nBucknell ; second, Aaronson,<br />\nJohns Hopkins; third, Throop, N.<br />\nV. U.; fourth, Kenworthy, Dickinson. Height, 12 ft.<br />\nHigh Jump—Won by Proctor,<br />\nJohns Hopkins; Cullen, N. Y. U.,<br />\nBaxter, Delaware; Gibson, Rutgers, and Innet, Rutgers, tied for<br />\nsecond. Height, 5 ft. 9 in.<br />\nDiscus Throw—Won by Thomas, W.& J.; second, R. M. Thomas, Haverford ; third, Hambleton,<br />\nJohns Hopkins; fourth, Delhaven,<br />\nF. & M. Distance, 117 ft./<br />\n1<br />\n2 in.<br />\nBroad Jump—Won by Engel,<br />\nJuniata ; second, Courtois, N. Y.<br />\nU.; third, Aaronson, Johns Hopkins; fourth, Tamplin, Dickinson.<br />\nDistance, 23 ft. 3<br />\n/<br />\n4 in.<br />\n<br />\nNeatly<br />\nCombed Hair<br />\nNeatly combed in the morning—<br />\nbut what about three o'clock in the<br />\nafternoon?<br />\nFor wiry, unruly hair—for soft,<br />\nfluffy hair—for any kind of hair<br />\nthat won't stay combed all day use<br />\nStacomb—then your hair will stay<br />\ncombed just as you want it.<br />\nIdeal after washing your hair.<br />\nLeaves the hair soft and lustrous.<br />\nAsk your barber for a Stacomb<br />\nRub.<br />\nAt all druggists.<br />\n<br />\nREC. U.S. PAT. OFFICE<br />\n<br />\nMakes the Hair Stay Combed<br />\n<br />\nRENT A CAR!<br />\nDRIVE IT YOURSELF<br />\nHups and Dodges, 18c per Mile<br />\n<br />\nFords, 12c per Mile<br />\n<br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\nVERNON 4049<br />\n(One block South of North Ave.)<br />\nOPEN ON SUNDAY<br />\n<br />\nGet Sun<br />\n<br />\nOlAilib/f/<br />\nV<br />\n<br />\nTAN<br />\nWithout<br />\n<br />\nSORENESS<br />\nor Blisters<br />\n<br />\nDame Nature Cream<br />\nSemi Liquid<br />\n<br />\nRubbed in BEFOREHAND<br />\nfortifies skin so it tans without any soreness or<br />\nblisters. Harmless. Does not leave skin greasy.<br />\nSmooths skin wonderfully. Sample 10c. All<br />\nleading drug or dept. stores 35e, double size 60c,<br />\nor Dame Nature Co. Address<br />\n937 Wellington Street, Chicago.<br />\n<br />\nJOHN<br />\n<br />\nHEIDELBACH<br />\n\"'TIN<br />\n<br />\nFINE<br />\n<br />\nGROCERIES<br />\n<br />\nFRESH<br />\nCatonsville<br />\n<br />\nMEATS<br />\nMaryland<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 22, 1923<br />\n<br />\nTHE NEWS LETTER'S<br />\nJOHNS HOPKINS ORCHESTRA<br />\nMAILBAG<br />\nDELIGHTS WITH CONCERT<br />\nA<br />\nColumn<br />\nin<br />\nWhich the Correspondents<br />\nOn Monday, May 14, the Johns<br />\n(THE BOOK MART)<br />\nAre<br />\nAllowed<br />\nLatitude, But ShoulHopkins Orchestra, under the<br />\nder the Responsibility.<br />\nComplete Stock of<br />\nleadership of Charles H. Bochau,<br />\nAll letters intended for publication<br />\nMedical Books and College<br />\nmust be concise, written in ink oi.<br />\nwfir th Ethel Dryden, pianist, and<br />\nregular letter size paper, on one side<br />\nRequisites<br />\nonly.<br />\nClarence Hihn, tenor, as soloists,<br />\nImporters and Dealers in Fine Books again demonstrated the high poNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nsition held by this organization in<br />\nprinted if request is made that they be<br />\n301 N. CHARLES ST.<br />\nomitted.<br />\nlocal musical circle.<br />\nBaltimore, Md.<br />\nThe publication of a letter is not to<br />\nThe orchestra, composed chiefbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nly of amateur, players, achieved<br />\nfreest discussion of matters of general<br />\nInterest.<br />\nthe unique distinction of rendering<br />\nCollege and Fraternity Stiitionery<br />\nBanquet and Dance Cards, Invitations in true professional style a concert<br />\nopen to the public free of charge. Y. M. C. A. Secretary Objects to<br />\nJAS. H. DOWNS<br />\nMany foreign-born music lovers<br />\nSacrilegious Paragraph in<br />\nENGRAVER PRINTER STATIONER<br />\nbeen unable because of<br />\n\"Black and Blue Jay\"<br />\nwho<br />\nhave<br />\n229 N. CHARLES ST.<br />\nthe high prices to attend events of To the Editor of the Newts-Letter,<br />\nmusical importance, were able to Dear Sir:<br />\ntake advantage of the unusual opIn the \"Spring Fancy\" Number<br />\nportunity offered to them.<br />\nof the Black and Blue Jay there<br />\nOur New Spring Suits and Topcoats at $30 Up<br />\nThe program contained the fol- appeared a paragraph that atWe have purchased 122,000 lowing<br />\nselections:<br />\npair U. S. Army Munson last<br />\ntempted to make a joke from a<br />\n2 to 12 which<br />\nshoes, sizes 51/<br />\nThe Prize Song,from Die Meis- Biblical verse that has in itself<br />\nwas the entire surplus stock<br />\ntersinger, familiar to the Balti- a certain sacredness. While there<br />\nof one of the largest U. S.<br />\nmore public because of the recent may be those to whom the<br />\nGovernment shoe contrac\"Wagnerian<br />\ninvasion ;\" two movetors.<br />\nChristian faith, and the Name and<br />\nments<br />\nfrom.<br />\nMendeIssohn's<br />\nFigure of Jesus Christ mean litThis shoe is guaranteed one<br />\n\"Hymn of Praise\" Symphony;<br />\nhundred per cent, solid leathtle, there are many on the campus<br />\ntwo Greig Elegiac Melodies, beauer, color dark tan, bellows<br />\nwho have a very different feeling<br />\ntifully rendered by the strings; a<br />\ntongue, dirt and waterproof.<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nin<br />\nthe matter. As a representaThe actual value of this shoe<br />\nSymphonic Poem by Bendel, and<br />\nOrchestra—Dancing<br />\ntive of the Hopkins Y. IL C. A. Telephone, Vernon 3442<br />\nis $6.00. Owing to this treGustav Strube's Academic Epioffer<br />\ncan<br />\nmendous buy we<br />\nand many Hopkins students, I<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nlogue.\"<br />\nsame to the public at $2.95.<br />\nshould<br />\nlike<br />\nto<br />\nprotest<br />\nfeel<br />\nsure,<br />\nI<br />\nTABLE<br />\nD'HOTE<br />\nMiss Dryden played, with unSend correct size. Pay postman on<br />\neditorial<br />\nthe<br />\npolicy<br />\nof<br />\nthe<br />\nagainst<br />\nLUNCHEON-60c<br />\nDINNER—$1.00<br />\nusual vividness, Liszt's Hungarian<br />\ndelivery or send money order. If<br />\nmatesuch<br />\nallows<br />\nboard<br />\nwhich<br />\nSUNDAY DINNER—$1.25<br />\nshoes are not as represented we Fantasie. Mr. Hihn sang the Cehardly seems that such<br />\nwill cheerfully refund your money leste Aida aria from \"Aida\" so rial. It<br />\npromptly upon request.<br />\nthat it lost none of its beauty contributions can add to the tone<br />\nof the paper, can win a larger<br />\nthrough its English rendition.<br />\nAt the Washington Monument<br />\nThe Baltimore press was enthu- popularity with the students, or<br />\nrecognition<br />\na favorable<br />\nsiastic in its praise of the concert. gain<br />\nOscar Thomas Olson, D.D.<br />\neither from the alumni or from<br />\nMinister<br />\n296 Broadway, New York, N. Y. COSMOPOLITAN CLUB HOLDS other universities.<br />\nYours very truly<br />\nDANCE<br />\nHopkins Students Are Invited to<br />\nV. J. WYCKOFF,<br />\nTo the haunting strains proMake This Their Church Home<br />\nORTMAN<br />\nGen. Sec'y., Y. M. C. A.<br />\nduced by \"Bob\" Iula's \"Happy<br />\n\"Queen Quality\" Home-made Five\" the Cosmopolitan Club gave<br />\nThe Sunday afternoon -At Horne\"<br />\nChocolates<br />\nDefeat<br />\nStickmen<br />\nHopkins<br />\nin the \"Blue and Grey Room- from<br />\na<br />\nsuccessful<br />\ndance<br />\nin<br />\nthe<br />\nC.<br />\nL.<br />\nLuncheonette<br />\nIces<br />\nIce Cream<br />\nof M.<br />\nU.<br />\nfive<br />\nto seven, followed by the young<br />\nHall<br />\nlast<br />\nFriday.<br />\nCharles<br />\nN.<br />\n227 N. Howard 518<br />\nContinued from page 1<br />\npeople's service will appeal to you.<br />\nDr. Flores of Goucher College,<br />\nDancing Every Afternoon a'<br />\nCharles St.<br />\nYou are invited.<br />\nDr. and Mrs. Latane and Dr. and the net for the last goal Of the<br />\nMrs. Robles were the chaperons. game.<br />\nSunday morning worship at 11 o'clock—<br />\nThe lineup :<br />\nThe committee composed of Miss<br />\nSunday evening service at 8 o'clock—<br />\nMaryland<br />\nMusic by vested chorus-choir of soloists<br />\nMildred Schaeffer, J. M. Rolon, H. Hopkins<br />\nSleasman<br />\nG<br />\nRoutson<br />\nBiosca<br />\nand<br />\nMcFaul,<br />\nJr.,<br />\nW.<br />\nN.<br />\nSTAGMERS PHARMACY<br />\nALL SEATS FREE<br />\nBurger<br />\nP<br />\nhad extensive decorations rival- Bachman<br />\nMarty<br />\nCP<br />\nPRESCRIPTIONS<br />\ning in effect the works of even Zoller<br />\nMcQuade<br />\nF.D<br />\nBarton<br />\nGump or Hamburger.<br />\nCandy<br />\nCigars<br />\nDrugs<br />\nHough<br />\nSD<br />\nThe Cosmopolitan Club is com- Middleton<br />\nBrewer<br />\nTD<br />\nposed of all foreign students at Benedict<br />\nTAILORS<br />\n5308 York Road<br />\nSmith<br />\nthe University and has recently Murphy<br />\nUniforms<br />\nand Liveries<br />\nMarden<br />\nT A.<br />\nspread to other colleges in Mary- Huey<br />\nBaltimore, Md.<br />\n128<br />\nW.<br />\nFayette<br />\nSt.,<br />\nNear Liberty St.<br />\nRowe<br />\nSA<br />\nland. Friday night representa- Coady<br />\nMd.<br />\nBaltimore,<br />\nHiedelbach<br />\nFA<br />\ntives from the University of Mary- Turnbull<br />\nBranner<br />\n0H<br />\nEXPERT RACKET RESTRINGING land vied with Goucher Club Almy<br />\nMyers<br />\nmembers for the honor of being McDaniel<br />\nPrices<br />\n$3.00 \"distinguished guests.\" The club<br />\nNo. 2 Oriental<br />\nfor<br />\nSummers<br />\nSubstitutions —<br />\n4.00<br />\nNo. 3 White Lambs Gut<br />\nSummers,<br />\n$5.00 plans to give several social func- Murphy, Murphy for<br />\nNo. 4 Red Tournament<br />\nand individuality is offered here at prices that are not<br />\nNo. 4A English Tournament... 5.50 tions in the next collegiate year Griffiss for Almy, Almy for Grif6.00<br />\nNo. 5 Armour Orange<br />\nand cannot be underquoted by any house atany time.<br />\n.50 and, under the leadership of Presi- fiss. Goals—Murphy, Almy, GrifWright & Ditson Tennis Balls<br />\nal Besides the reputation of an old-established firm<br />\ndent Rolon, intend to increase fiss, Coady, Branner (2). Referee<br />\nBACHRACH RASIN CO.<br />\nis<br />\nback of each sale with a guarantee.<br />\nTHE WRIGHT & DITSON STORE their activities.<br />\n—Wylie, of Mt. Washington. As14 N. HOWARD ST.<br />\nsistant referee—Baker.<br />\nDR. AMES TO SAIL FOR<br />\nDRAPERIES<br />\nDECORA7IONS<br />\nBlack and Blue Tennis Team Ties FURNITURE<br />\nENGLAND<br />\nMaryland Three-All<br />\n343 NORTH CHARLES STREET<br />\nDr. Joseph S. Ames, Professor<br />\nContinued from page 1<br />\nof Physics, and Director of the<br />\nnearly every game went to deuce,<br />\nPhysical Laboratory, will sail on and both players made some reMay 22 for London, England, markable \"gets.\" With the score<br />\nwhere he will address the Royal 4-all the Hopkins net captain won<br />\nAeronautical Society on May 31. the last two games for the set and<br />\nSend for catalog describing over 400 courses in History, English,<br />\nMathematics,Chemistry,Zoology, Modern Languages,Economics,<br />\nThe theme of Professor Ames' match.<br />\nPhilosophy, Sociology, etc., given by correspondence. Inquire<br />\npaper will be on \"The Connection<br />\nhow credits earned may be applied on present college program.<br />\nSimmons, of Maryland, disBetween Scientific Investigation posed of Kaufholz, 6-0, 6-1, and<br />\nIn Aeronautics and the Design of Wilson, the Med. School captain,<br />\n31st<br />\n%HOME STUDY DEPT.<br />\nCHICAGO. ILLINOIS<br />\nYear<br />\nAircraft.\"<br />\nin a well played match by scores<br />\nThe privilege of lecturing be- of 7-5, 6-3. Wilson's hard hitting<br />\nfore such a distinguished body of and forceful play caused Weber been the \\\\ inner at Washington enough to win both of the dou\\JOU need this little 63<br />\nscientists is a signal honor. Dr. to make errors which lost him the and he also won the second meet- bles, so that the match ended 3-3.<br />\n1 lb. typewriter. $5.00<br />\nAmes is the first American to ad- match.<br />\ning, although only after he had Phillips and Simmons, the Black<br />\na month buys it. See<br />\nCorona today.<br />\nfour<br />\nyears.<br />\ndress the Society in<br />\nThe prettiest encounter of the been extended to the limit. In and Golds' first doubles team, won<br />\nM. W. LUCY & CO.<br />\nAfter delivering the lecture, Dr. entire day whs between the num- the opening- set Phillips was trail- from Hofmeister and Wasser118 W. Fayette St.<br />\nBaltimore<br />\nAmes will attend the Internation- ber two men. Phillips, of Mary- ing 7-8, but by a beautiful spurt man 6-3, 8-6. .Wilson and Bural Aeronautical Congress, which land, was an old foe of Wasser- he won the next three games and linghof, the latter also from the<br />\nwill meet in June.<br />\nman's, having met him in Wash- then won the next set with the Medical School, met Knick and<br />\nKimbrough ; the doctors proved<br />\nProfessor Ames will sail on ington when the two were on rival loss of only one game.<br />\nNeither team was strong strong enough to win 6-2, 7-5.<br />\nprep school teams. Phillips had<br />\nJuly 7 for home.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nClothes for men<br />\nwho like<br />\nthe best style<br />\nand quality<br />\n<br />\nPUBLIC SALES<br />\n<br />\n211-213 E. BALTIMORE ST.<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n<br />\nMount Vernon Place Methodist Episcopal Church<br />\n<br />\nNational Bay State<br />\nShoe Company<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\n'D<br />\no<br />\n<br />\nYou Need Extra Courses?<br />\nlittimrsity tfCiltragn<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 56<br /><br />\nBALTIMORE, MD., MAY 22, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nTOQUEVILLE MEDAL IN PUB- BIG FIFTH INNING GIVES HOPKINS<br />\nWINS<br />\nMIDDLE HOPKINS STICKMEN OVERCOME UNIVERSITY OF MARYMARYLAND 7-3 VICTORY<br />\nLIC SPEAKING WON BY B.<br />\nSTATES TRACK MEET AT<br />\nLAND BEFORE RECORD CROWD<br />\nOVER J. H. U.<br />\nJ. BAMBERGER<br />\nALLENTOWN<br />\nBlack and Blue Displays Greater Ability in 4-2 Victory Over Its<br />\nContest Held at Assembly Before Maryland Scores in But One In- Booth Scores Two Firsts. HamAncient Rivals<br />\nning. Marrian Relieved by<br />\n0. D. K. Initiation. Dr. Mableton Wins Shot and ProcUniversity of Maryland's hopes for an unusually brilliant lagoffin Speaker for Day<br />\nMaccubbin in Sixth<br />\ntor the High Jump<br />\ncrosse season were shattered last Saturday when the College Park<br />\nThough Maryland scored in but<br />\nThe annual Tocqueville Contest<br />\nJohns Hopkins track artists twelve bowed to the Black and Blue stickmen at Homewood Field.<br />\nin public speaking, held at last one inning against H.opmns, the won the eleventh annual Middle Playing before the largest crowd that has been seen at a lacrosse<br />\nThursday's assembly, ,A h Pro- home team lost 7-3. Marrian and States Collegiate Athletic Asso- game this year, the Hopkins team out-generaled the visitors in a<br />\nfessor Gilbert Chinard presiding-. Nihiser both pitched fine ball until<br />\nciation track and field meet last hard fought and exciting contest. For several minutes it seemed<br />\nwas won by Bernard J. Bamberg- the fifth, when a base on balls,<br />\nthe State team would take a large share of the spoils of the day,<br />\nSaturday at Allentown, Pa. La- that<br />\nCr, '23. The award for the con- four hits, three stolen bases, a hit<br />\nbut Coach Schmiesser's men proved their superiority in the Indian<br />\ntest is the Tocqueville Medal, of- batsman and a fielder's choce fayette finished second with 25 game by increasing their own score at a time when Maryland's attack<br />\nfered annually since 1898, by gave the College Parkers seven points. The other teams finished was staging a last-minute rally.<br />\nBaron Pierre de Coubertin, and runs. Saturday's encounter took in the following order: New York<br />\nCaptain John Murphy started<br />\nnamed after Alexis de Tocque- Marrian to the mound for his tr.'rd University, 16½; Rutgers, 16; MUSICAL CLUB CLOSES SUC- the point winning for the local<br />\nCESSFUL SEASON<br />\nville, a well krrown author of his- game this week, and had the Blue Washington and Jefferson, 15;<br />\nteam about five minutes after the<br />\nhis<br />\nhave<br />\nbeen<br />\nit<br />\nwould<br />\nJays<br />\nwon<br />\nFinal Concert Held at St. Michael opening of hostilities. The ball<br />\ntorical and political works. The<br />\nDickinson, 10; Haverford, 8; Leand All Angels' Church<br />\nhad passed from the possession of<br />\ngeneral topic for discussion this third. consecutive victory; but to<br />\nhigh, 6; Bucknell, 6; Juniata, 5;<br />\nThe Musical Club closed a most the J. H. U. players to Curly<br />\nyear was the French educational pitch three games in one week is<br />\nSwarthmore, 4; Delaware, 1½;<br />\nByrd's warriors when Hopkins'<br />\nsystem, with special attention to more than any arm can stand.<br />\nFranklin and Marshall, I. 5even successful season with the presMcCubbin<br />\nwent<br />\nto<br />\nthe<br />\nbox<br />\nin<br />\ncenter intercepted a throw<br />\nclever<br />\nthose features that might be imithe sixth. Marrian was moved to Black and Blue entries scored 46 entation of a concert before the from Marden to Branner, ran half<br />\ntated in America. As usual, the<br />\nMen's Club of St. Michael and All<br />\nhis regular position at third and points for their alma mater.<br />\nway down the field and shot a goal<br />\nspeeches were delivered in EngTwo records were hung up and Angels' Church last Friday even- from<br />\nSchacht•to center field.<br />\na distance of thirty yards.<br />\nlish.<br />\nIn the first Wallis and Semler one tied at this meet. Meyer of ing. The club at this time ap- Soon after Murphy made the initial<br />\nThe contestants-in the order in both went out 2-1, while Burdette Rutgers ran the 220-yard low hurtally he showed evidences of an inwhich they spoke and their sub- received a strike-out. In Hop- dles in the splendid time of 24.5 peared at its best, giving a concert<br />\nranking second only to the one jured leg. He limped on until<br />\njects were as follows:<br />\nkins' half, with two outs, Schacht seconds. This is one-tenth of a<br />\nHopkins scored again by a pretty<br />\n(1) George B. McCandless: singled. Marrian followed with a second better than the former given at the Maryland Casualty play from<br />\nTurnbull to Almy when<br />\n\"French Elements in the Towner- base-hit, advancing Schacht to Middle States record. Haslam, Clubhouse, thus sweeping away Stran Summers was<br />\nsent in to reStirling Bill.\"<br />\nthird, who scored on a wild pitch. pole-vaulter from Bucknell, broke all ideas of doubt as to the success lieve him. The remainder of the<br />\n(2) Edgar F. Wolf: \"ThorThe second, third and fourth the record in the pole vault, jump- of a concert so late in the season. first half was an unsuccessful bat1<br />\n2 inch higher than the preoughness in French Secondary saw no scoring by either side. In ing /<br />\nThe Glee Club started the con- tle of the Black and Gold to even<br />\n/<br />\n2inches.<br />\nEducation.\"<br />\nthe fifth the trouble was started vious record of 11 feet 111<br />\nby singing \"Honey I Wants up the score which the better<br />\ncert<br />\n(3) Bernard J. Bamberger : with the first batter when Marrian Leconey, of Lafayette, tied the<br />\nhad gathered against them.<br />\nYer Now\" and \"Old Black Joe.\" team<br />\n\"Aspects of the Intellectual and hit Simmons. Gardner ranned 220-yard dash mark of 21 3-5 secThe second period saw the reThe Mandolin Club played as its<br />\nMoral Training in French Pub- and Simmons stole second. Nihi- onds.<br />\nturn of Murphy to the contest and<br />\nThe individual honors resulted part of the program \"Minute<br />\nser trippled. Wallis was safe on<br />\nlic Schools.\"<br />\nthe substitution of Griffiss for AlThe judges, chosen from the a fielder's choice, but Nihiser in a triple tie for first between March,\" \"Last Game March\" and my. As soon as the play started<br />\nfaculty, were Dr. Francis E. A. scored. Burdette and Semler sin- Booth of Hopkins, Leconey of La- \"Favorite<br />\nSelections.\" Other Griffiss carried the ball up the<br />\nLitz, chairman; Dr. Fowler D. gled. Semler stole second and fayette and Myer of Rutgers. Each numbers on the program included side of the field, dodged past a U.<br />\nBrooks; and Professor Charles I. Pollock walked, Remsburg flied won two events. •<br />\nof M.defense man and shot a third<br />\nThe feature race of the day \"Golliwog,g's Cakewalk,\" a piano<br />\nSilen. The-decision in - favor of to second base. With the bases<br />\ngoal fcr the J. H. U. Next it V:P.S<br />\ndrunk, Watkins hit for a home turned out to be the 220-yard dash. solo by Mr. Sater; Impersonation Maryland's turn to score. The<br />\nBamberg-er was unanimous.<br />\nLeconey and Clarke easily led the of Joe Cook by Joe Moran and<br />\nAfter the Tocqueville Contest, run and Simmons went out third<br />\nvisitors worked the ball into their<br />\nfield<br />\nat this distance. Less than a popular selections by the Blue Jay<br />\nand before the initiation of new to first. Hopkins went out in the<br />\nterritory where they held it until<br />\nfoot separated them at the finish. Six.<br />\nThe concert ended with Branner slipped it past Routson<br />\nmembers into the Omicron Delta one, two, three order.<br />\nIn the 100 Clarke was put back a<br />\nNext<br />\ninning<br />\nGardner<br />\ndrew<br />\na<br />\nKappa Honorary Society, Dr.<br />\n\"Winter Song\" and the \"Univer- for their first tally. Branner reyard and could not catch the<br />\nContinued on page 3, col. 2<br />\npeated this within the next five<br />\nRalph V. D. Magoffin, a faculty<br />\nspeedy Leconey. Dorcus in the sity Ode,\" by the Glee Club.<br />\nminutes. After that the Black and<br />\nmember of the Society, spoke of<br />\nDuring the year the Musical<br />\nquarter-mile was badly spiked and<br />\nBlue defense was airtight.<br />\nthe importance and high standing BLACK AND BLUE TENNIS<br />\nClub filled a schedule larger than<br />\nconsequently<br />\nthe<br />\nfinished<br />\nout<br />\nof<br />\nTEAM TIES MARYLAND<br />\n\"Tex\" Barton prevented the<br />\nof the 0. D. K. The Phi Beta<br />\nmoney. West of Washington and had ever before been attempted.<br />\nTHREE-ALL<br />\nCollege Park boys from getting<br />\nKappa and several scientific soJefferson, won the event, but was Concerts were given at McDoncieties like it, according to Dr. Led by Captain Hofrneister, the disqualified for pushing. The push ogh, Franklin High School, Bel- too dangerous by keeping HiedelMagoffin, do not meet the need J ohns Hopkins tennis team bat- resulted in Dorcus being spiked. air, Westminster and First Meth- bach, their best bet, entirely out of<br />\nfor such organization altogether, tled to a draw in the match with Proctor won the high jump from odist Church. The first formal the play. The big Texan contrasted strangely with the might<br />\nbecause they do not give men rec- the University of Maryland last a poor field.<br />\nhome concert ever to be presentof<br />\na man against whom he played<br />\nSaturday<br />\non<br />\nthe<br />\nHomewood<br />\nognition until just before they<br />\nBooth was the Hopkins star ed was held at the Maryland Casbut<br />\nthe superior size won out for<br />\ncourts.<br />\nEach<br />\nteam<br />\nwon<br />\ntwo<br />\nof<br />\nleave college and because they<br />\nwith 10 points to his credit. Aar- ualty Clubhouse. Critics considHiedelbach<br />\ndid not break loose<br />\nthe<br />\nsingles<br />\nand<br />\none<br />\nof<br />\nthe<br />\ndouare not widely known among the<br />\nonson and Hambleton were next, ered the club at this time to be of<br />\nonce.<br />\nBenedict<br />\nand Middleton<br />\nbles<br />\nmatches.<br />\nunderclassmen. Not knowing of<br />\nwith 7 each; Clarke, 6; Proctor, equal standing with the famous<br />\nplayed<br />\nwell<br />\non<br />\nthe<br />\nBlack and Blue<br />\nThe hardest fought setto was 5; Hearn, 3; Norwood, 2.<br />\nPhi Beta Kappa, Freshmen often<br />\nDartmouth Club, which club has<br />\ndefense,<br />\nboth<br />\nof<br />\nthem<br />\nplaying on<br />\nmake little slips in their studies that between Hofmeister and ' The summary:<br />\ngiven numerous concerts in the<br />\nthe<br />\nattack<br />\nfor<br />\nthe<br />\ntime as<br />\npart<br />\nof<br />\nthat might have been avoided had Kimbrough, playing number one<br />\ncity.<br />\nTrack<br />\nEvents<br />\nwell<br />\nas<br />\ncovering<br />\nthe<br />\nopponents<br />\nthey known of the possibility of for their respective teams. HofThe new officers of the club are<br />\n100-yard Dash—Won by Lecowho were pitted against them<br />\nwinning the honor that goes with meister raced through the first set ney,<br />\narranging the schedule<br />\nalready<br />\nClarke,<br />\nsecond,<br />\nLafayette;<br />\nRoutson<br />\nand Sleasman, the rival<br />\nthe P. B. K. key, but which, nev- in easy fashion, winning it 6-1, Johns Hopkins; third, Aaronson, for next season.<br />\ngoalkeepers,<br />\nboth played well in<br />\nertheless, count against them in with Kimbrough seldom getting Johns Hopkins; fourth, Carol, Letheir<br />\nrespective<br />\npositions.<br />\nSOPHOMORES HOLD CLASS<br />\nthe end. The 0. D. K., having more than to points a game. In high. Time, 10 sec.<br />\nHopkins'<br />\nfourth<br />\ncount came tothe<br />\nsecond<br />\nset<br />\nKitnbrough's<br />\nMEETING<br />\nmore than the single standard,<br />\n120-yard Hurdles—Won by<br />\nward the end of th egame. Coady,<br />\nsteadiness<br />\nand<br />\nHofmeister's<br />\nerscholarship, as a basis for elecMeyer, Rutgers; second, Allen, At a meeting of the Sophomore after innumerable attempts to<br />\ntion, gives the underclassmen a rors gave the Marylander the first Haverford ; third, Allen, Lafay- Class held Thursday at 12:30 in<br />\ndodge his man, finally succeeded<br />\nfair chance for honors. The 0. three game. The Hopkins cap- ette; fourth, Riddaugh, Lafayette. the M. E. Building, Klinefelter,<br />\nand<br />\nplaced the rubber pellet into<br />\ntain<br />\nthen<br />\nmade<br />\na<br />\nmomentary.stand<br />\nD. K. counts five points in contreasurer of the class, reported a<br />\nTime, 10 1-10 sec.<br />\nContinued on Page 4, col. 3<br />\nand<br />\npulled<br />\nup<br />\nto<br />\n3-2, but Kim<br />\nsidering men for admission: scholRun—Won by Booth, surplus of thirteen dollars in the<br />\nOne-mile<br />\nbrough<br />\nran<br />\nthe set out 6-2. In<br />\narship, athletics, social leaderHopkins; second, Work- treasury. All outstanding debts, TURNBULL ELECTED PRESIthe<br />\nthird<br />\nand<br />\ndeciding frame Hof- Johns<br />\nship, debating and publications.<br />\nthird, Furbeck, including the deficit on the dance,<br />\nDickinson;<br />\nman,<br />\nDENT OF O. D. K.<br />\nmeister was unable to stroke the<br />\nDr. Magoffin emphasized the fact<br />\nfourth, have been paid. Sophomores who<br />\nYork<br />\nUniversity;<br />\nThe election of officers of the<br />\nball because of his opponent's pe- New<br />\nhave not paid their class dues,<br />\nthat a man's work, not the memculiar style of play. The lead in Wheeler, Washington and Jefferwill<br />\nhave the full amount taken local Beta Circle of the Omicron<br />\nbers of the society, is really what<br />\nthis set see-sawed back and forth, son. Time, 4.28 2-10.<br />\nDelta Kappa Honorary Society for<br />\nwins for him admission to the or440-yard Dash—Won by Mac- out of their caution money, it was<br />\nContinued on page 4, col. 3<br />\nthe coming year was held last<br />\nganization. In regard to the valdonald, Lafayette; second, Croll, further announced.<br />\nMorrill,<br />\nchairman<br />\nof<br />\nthe<br />\nKelso<br />\nue of the 0. D. K., Dr. Magoffin<br />\nThursday, May 17, at the Hopkins<br />\nLafayette; third, Malick, LafayPin Committee, reported that the Club, following the initiations of<br />\ntold of its rapid growth and the<br />\nSPECIAL<br />\nette. Time, 50 9-10 sec. ,<br />\nIt was learned at a late hour<br />\nenthusiasm with which the idea<br />\nTwo-mile Run—Won by Booth, matter of rings would be deferred new members.<br />\nyesterday that Major Garey<br />\nwas received whenever he menJohns Hopkins; second, Powell, until next year.<br />\nThe newly elected officers are:<br />\nhas been tendered the presiRutgers; third, Mullon, Dickin- President Klein suggested that<br />\ntioned it to college men on a redency of St. John's College.<br />\nson; fourth, Yater, New York the class have its own ring in the Douglas Turnbull, president;<br />\ncent trip to the West. The public<br />\nUniversity. Time, 9m. 55 6-I0s. June Week Circus. He is mak- James I. Bonner, vice-president;<br />\ninitiation of new members into<br />\nMeeting of entire News220-yard<br />\nHurdle—Won<br />\nby ing plans, at present, to carry out Pearce Coady, secretary; J. Edthe to. D. K. concluded the asLetter•staff 12.20 Friday.<br />\nsembly.<br />\nthis idea.<br />\nward Mount, treasurer.<br />\nContinued on page 3, col.3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 22, 1923<br /><br />\n2<br /><br />\n0. D. K. MAKES SUGGESTIONS NEW COLLEGIATE REGULA- DR. DUNLAP GIVES LECTURE<br />\nIN C. F.. HALL<br />\nTIONS ANNOUNCED BY<br />\nAS TO ELECTION OF A.-A.<br />\nREGISTRAR<br />\nBOARD OF CONTROL<br />\nDr. Knight Dunlap, professor of<br />\nFOUNDED 1897.<br />\nIn order for every member in experimental psychology at HopWhen the dust of the last meetUniversity to be thoroughly kins, has added his voice to the<br />\nthe<br />\ning of the Omicron Delta Kappa<br />\n$2.00<br />\nwith the new colleSubscription<br />\nHonorary Fraternity had blown acquainted<br />\nchorus of academic protests<br />\ngiate regulations, the News-Letter,<br />\na<br />\naway<br />\nof<br />\nnumber<br />\nsuggestions<br />\nupon suggestion of the Registrar, against the present mania for psyEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nhad been made to various organ- has thought it advisable to pub- cho-analysis. At a well attended<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nlecture last Thursday in the C. E.<br />\nizations on the campus which the lish extracts from the catalog.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nSociety believes will prove beneThe tuition fee in the College Hall on \"Behaviorism, FreudianHopkins University.<br />\nof<br />\nArts and Sciences is $230.00 ism and Instinct-Psychology,\" he<br />\nficial.<br />\nBusiness communications should be addressed to the BUSINESS MANannum, payable in two install- declared, \"Nothing could be more<br />\nper<br />\nReports of several committees<br />\nhGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nments<br />\n($150.00 October 1, $100.00 vicious or absurd<br />\nihould be sent to the MANAGING EDITOR.<br />\nthan the Freudwere made at this meeting. A<br />\nFebruary 1. Students who enian<br />\ndoctrine<br />\nthat<br />\nis bad.<br />\nrepression<br />\nHomewood 100 recommendation was made to the tered prior to October, 1921, pay<br />\nCelephone<br />\nGraduate Manager that some sys- $200.00 in two equal installments.) Repression is the Freudian term<br />\nManager<br />\nBusiness<br />\ntem of \"Calendarization\" be de- No one is at liberty to attend for the attempt to withdraw the<br />\nEditor-in-Chief<br />\n'24.<br />\n'25.<br />\nLEOPOLD,<br />\nHOWARD,<br />\nJOSEPH<br />\nPHILIP W.<br />\nvised by which managers of all classes until he has settled with attention from desires which are<br />\nteams will be required to set the Treasurer. For the use of the unethical or whose satisfaction is<br />\nManaging Editor<br />\nAdvertising Manager<br />\nWILLIAM G. DEAN, JR., '24.<br />\ndown in a specified book, at least library or reading room no addi- inadvisable. Parents and teachers<br />\nFITZGERALD DUNNING, '24.<br />\nAssistant Managing Editor<br />\na week before hand, information tional charge is made.<br />\nare urged to teach children not to<br />\nT. REESE MARSH, '24.<br />\nNo student will be enrolled unregarding time and place of<br />\nrepress.<br />\nCirculation Manager<br />\ngames, referees, and other infor- til he presents a receipt from the \"Actual<br />\nAssociate Editors<br />\nrepression; however, is<br />\nJOHN C. LEWIS, JR., '24.<br />\nRICHARD C. TILGHMAN,'25.<br />\nmation of this kind. This book is Treasurer.<br />\nthe<br />\nonly<br />\nof man if civilisalvation<br />\n'25.<br />\nPARSONS,<br />\nW.<br />\nJOHN<br />\nMembers of the upper classes<br />\nto be kept in the Athletic Office<br />\nBENJAMIN T. ROME, '25.<br />\nzation<br />\nto<br />\nis<br />\ncontinue,<br />\nand the abilManagers<br />\nBusiness<br />\nAssistant<br />\nand will be available to anyone must enroll in the forenoon of Sep- ity to repress effectively is the<br />\nJunior Editors<br />\nD. MILES MARRIAN, '25.<br />\nseeking this knowledge over tember 28 or September 29. A fine greatest asset a human individual<br />\nV. EDWARD THOMSEN, JR., '26.<br />\nARTHUR L. NELSON, '26.<br />\nG. DONALD, GIESKE, '25.<br />\nphone or calling in person. This of $3.00 will be levied against can have. It is true that constant<br />\nERNEST A. STRATHMAN, '26.<br />\nJOHN T. DIXON,'24.<br />\nLEO C. MUTH,'24.<br />\nwill eliminate, it is believed, any those failing to enroll on the days struggle is bad and the struggler<br />\nA. J. McKAYf '26.<br />\nALGER G. Hiss, '26<br />\ninaccurate statements given over named.<br />\nC. EUGENE TOVELL, '24.<br />\nneeds aid in repressing. In partiEDWARD 0. MICHEL, '26.<br />\nIf, for any reason, a student<br />\nthe phone or otherwise, by percular<br />\nthe adolescent need to have<br />\nabsolve a course<br />\nsons who may be present in the does not repeat or<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\ntheir attention drawn away from<br />\nin which he has failed, he may,<br />\nAthletic Office in the absence of<br />\nsurging desire and turned in other<br />\nwith the consent of his Adviser,<br />\nor<br />\nthe<br />\ncoaches.<br />\nmanagers<br />\nMd.<br />\nBaltimore,<br />\nSts.,<br />\nSouth<br />\nand<br />\nLombard<br />\nCo.,<br />\nPrinted by The Read-Taylor<br />\nsubstitute another course of equal directions.<br />\nIt was also recommended to<br />\n\"It is just those features of the<br />\nvalue, but in every case he will be<br />\nthe Publicity Board that it will<br />\nmovies<br />\nand other details of modrequired, as a penalty for leaving<br />\nBALTIMORE, MD., MAY 22, 1923<br />\nappoint one person, whose sole<br />\nlife<br />\nern<br />\nwhich interfere with the<br />\na course uncompleted, to take an<br />\nduty it will be, to keep in a pubrepressions<br />\nwhich are most deploradditional course which will not<br />\nlic place a chart of the day, with<br />\nable.<br />\nbe credited toward the 125 points<br />\nA LOSS<br />\nall the hours, which will be filled<br />\n\"So far as I can make out Freud<br />\nrequired for graduation.<br />\nand<br />\nhis disciples have contributed<br />\nThe words \"professor\" and \"faculty\" are often pet aversions of in with the names of the organiNo student may count for gradthe college student. They bring to mind wearisome lectures, lack of zations having future meetings. uation more than two courses in nothing of value to psychology,<br />\nunderstanding and lack of sympathy. The average undergraduate This chart is to be posted in the which his grade for the year is be- and if they have contributed anything to medicine it is rather discannot see why the professor does not realize that one cannot study most prominent place possible. low 7.<br />\nthe<br />\nto medicine to have<br />\nbefore<br />\ncreditable<br />\ndates<br />\nthese<br />\nHaving<br />\nthe<br />\non<br />\nheld<br />\nbe<br />\nnot<br />\nshould<br />\nlectures<br />\nthat<br />\nand<br />\nparty<br />\nafter an all-night<br />\nA student transferring from one<br />\nfar<br />\nit<br />\nbeen<br />\nso<br />\nbehind the progress of<br />\nbeforehand,<br />\nposted<br />\nand<br />\npublic<br />\nfaculty<br />\nthe<br />\nof<br />\ninterests<br />\nThe<br />\ngame.<br />\nfootball<br />\nday of a championship<br />\nundergraduate school to another<br />\nthat it could profit by<br />\npsychology<br />\nall<br />\nwith<br />\naway<br />\ndo<br />\nwill<br />\nhoped<br />\nis<br />\nextremes.<br />\nopposite<br />\nat<br />\noften<br />\ntoo<br />\nare<br />\nstudent<br />\nmember and those of the<br />\nand having a failure in the former.<br />\nthis<br />\nmixture<br />\nof psychology and<br />\nmeetings<br />\nthe<br />\nbetween<br />\nconflicts,<br />\nmust, in addition, to the regular<br />\nEvery now and then, however, a faculty member appears who<br />\nsuperstititon.\"<br />\nwish<br />\nwill<br />\nmen<br />\nsame<br />\nthe<br />\nwhich<br />\nat<br />\nrequirements for a degree in the<br />\ncan see the undergraduate's point of view and can sympathize with<br />\nDr. Dunlap, who has been called<br />\nall future school which he is entering, make<br />\nof<br />\nNotices<br />\nattend.<br />\nto<br />\nplace<br />\na<br />\nwins<br />\ninvariably<br />\nand excuse his many shortcomings. This man<br />\nthe<br />\n\"father of Behaviorism,\" deposted<br />\nbe<br />\nto<br />\nhave<br />\nwill<br />\nmeetings<br />\nup the failure or offer an additionfor himself in the hearts of the usually undemonstrative college studal<br />\ned<br />\nthat it was not intended enof<br />\nthe<br />\nadvance<br />\nat least a week in<br />\nal equivalent course.<br />\ndents.<br />\ntirely<br />\nto supplant introspection.<br />\ntime of the meeting.<br />\nSuch a man is Major Enoch B. Garey, and it is .with a feeling of<br />\nHe<br />\nalso<br />\nremarked that BehaviorAnother recommendation is to CHRISTIAN SERVICE CLUB<br />\ndeep regret that the undergraduates learn that, at the expiration of the be sent to the A. A. Board, which<br />\nism carried to the extreme, that is<br />\nHOLDS ELECTION<br />\nnow popular among experimentpresent collegiate year, he will sever connections with the University. provides that a new method of<br />\nTuesday, May 15, the ers, becomes almost ridiculous.<br />\nLast<br />\nMajor Garey's term of service at Johns Hopkins has not been a long elections be devised which would<br />\nHis principal attack was directone. In the few years, however, that he has been at Homewood he avoid the elimination of men who Christian Service Club elected the<br />\nhas been a staunch supporter of activities, has worked tirelessly in have received the second and following officers for the next ed at Instinct-Psychology, which<br />\nthe interests of Johns Hopkins and has conic to be admired and third highest number of votes for scholastic year: President, Paul he declared to be practically meanrespected by the undergraduate body. The esteem in, which the stu- a certain office. This man might Sylvester,'24; vice-president, Wil- ingless. His argument was that<br />\nReno the terms<br />\ndents hold him is demonstrated by the fact that Major Garey was be better able to fill another of- liam McVaul,'24; secretary,<br />\n\"instinct\" and \"UnconAllison<br />\nscious\" are both merely classificaelected to the Honorary Presidency of the Class of 1924 and as an fice than the person who has ac- Harp, '26; treasurer,<br />\nLong, '25.<br />\nactive faculty member of Omicron Delta Kappa.<br />\ntions which are applied to psychotually been elected. This might<br />\nThe club is preparing plans for logical phenomena which cannot<br />\nthe<br />\nto<br />\nloss<br />\nundoubted<br />\nan<br />\nprove<br />\nwill<br />\nMajor Garey's departure<br />\nlikewise, eliminate to some ex- its activities for next year on a<br />\nUniversity and it will be keenly felt by all Who knew him and, espe- tent, men who are not connected larger scale because of the stu- be explained. Consequently, he<br />\npointed out, it is absurd to call a<br />\ncially, by those who were associated with him.<br />\nwith Athletics. It is planned to dents who will reside in the new<br />\nan explanation.<br />\nclassification<br />\nnominate 15 seniors, 10 juniors, 5 dormitory.<br />\nsophomores and to have a vote<br />\nThe Christian Service Club is a<br />\nLAST ELECTRICAL CLUB<br />\nENTER: THE BARNSTORMERS<br />\ntaken on these men. The highest Hopkins religious organization<br />\nMEETING HELD<br />\nThe last regular meeting of the<br />\nSupporters of Hopkins undergraduate activities have noted with man in the senior group will be that is interested in religious and<br />\nJohns Hopkins Electrical Club<br />\npleasure the rapid expansion and improvement in the condition of the President of the A. A. Board social topics.<br />\nwas held last Friday afternoon,<br />\nthese activities within the last few years. Under a new athletic or Student council. The second<br />\nregime the Varsity teams have at last found themselves established highest would be President of \"CAMPUS CLUB\" FORMED May 1 8, in the Mechanical Engiupon a firm financial basis and are advertising the name of Hopkins the one of these two considered<br />\nWorking under the belief that neering Building. The address:<br />\nThis<br />\nin Hydroelectric<br />\nthroughout the collegiate world. Non-athletic activities, too, through of second importance.<br />\nJohns Hopkins needs an under- \"Precautions<br />\nthe medium of a Student Activities Fee, have found a means of sup- method of determination is to be graduate club to further school Operation,\" was given by J. T.<br />\nport. This year it is more than probable that, for the first time, none worked out later.<br />\nspirit and to bind students togeth- Dixon, a junior in the Electrical<br />\nA further recommendation was er, a body of upper classmen met Engineering Department.<br />\nof the undergraduate organizations will show a deficit at the close of<br />\nthe collegiate year.<br />\nMr. Dixon traced the gradual<br />\nmade that the Athletic Council after last week's assembly and<br />\nBand,<br />\nthe<br />\nsupport<br />\nimprovement in hydroelectric<br />\nWith this improvement, however, the expansion of the activities be asked to<br />\nformed the \"Campus Club.\"<br />\nto<br />\nmuch<br />\nso<br />\ncontribute<br />\nthey<br />\nsince<br />\nlookthe<br />\non<br />\never<br />\nis<br />\norganization<br />\nEach<br />\nstandstill.<br />\na<br />\nto<br />\nhas not come<br />\nUnder this tentative name the power station operation, laying<br />\nteams.<br />\nthe<br />\nof<br />\nsuccess<br />\nthe<br />\na<br />\nat<br />\ndemonstrated<br />\nwas<br />\nThis<br />\nfact<br />\nconquer.<br />\nto<br />\nout for new worlds<br />\nmembers set to work to draw up particular stress on safety in opand<br />\nappropriately<br />\nnow<br />\nClub,<br />\nDramatic<br />\nerstwhile<br />\nrecent meeting of the<br />\nplans for their future work on the eration. A large number of elecTO<br />\nannounced<br />\nJAY<br />\nwas<br />\nBLUE<br />\nit<br />\nAND<br />\nwhen<br />\nBLACK<br />\nBarnstormers,\"<br />\ncolloquially known as \"The<br />\ncampus. Upper classmen only will trical engineering students heard<br />\npresented:<br />\nbe<br />\nwould<br />\n1<br />\nJUNE<br />\ncomedy<br />\nAPPEAR<br />\nmusical<br />\nins<br />\nbe eligible and at present it is in- the talk.<br />\nthat next year an all-Hopk<br />\nalso<br />\nThis meeting closed one of the<br />\nwas<br />\nIt<br />\nundergradutes.<br />\nwritten, staged, and acted by Hopkins<br />\nThe next and final issue of the tended to have the members chostrip,<br />\nroad<br />\nsuccessful seasons since the<br />\nmost<br />\nextensive<br />\nannounced that the production would take an<br />\nBlack and Blue Jay will appear en from the student body at large<br />\n•<br />\ncovering, perhaps, some of the larger cities of the East and South.<br />\nabout June 1. The issue is to be with rules limiting the number of organization of the local society.<br />\nThe benefit which a University derives from a trip such as is called \"June Week,\" and its con- fraternity men to one-third of the One of the most important feataken yearly by the Pennsylvania \"Mask and Wig\" and the Princeton tents have been prepared with ref- total membership. This, it is tures during the post scholastic<br />\n\"Triangle Club\" is seldom realized. If the \"Barnstormers\" are able erence to this celebration. Five hoped, will create better school year has been the address given<br />\nto place a creditable production on the road, it will raise immeasurably hundred additional copies have spirit and comradeship between by the student members of the<br />\nbeen ordered as a supply for the non-fraternity men and the mem- club. These speeches were all<br />\nthe prestige of Hopkins undergraduate activities.<br />\nThe News-Letter wishes the Barnstormers all sorts of good young ladies' entertainment dur- bers of the various chapters at the given on topics on which the talkers have had actual experience.<br />\ning the week.<br />\nUniversity.<br />\nfortune.<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 22, 1923<br />\n0. D. K. TO FORMULATE DOR- CIVIL ENGINEERING SOCIETY<br />\nMITORY REGULATIONS<br />\nPLANS ELABORATE<br />\n\"BLOWOUT<br />\nFaculty representatives have reThe<br />\nJohns<br />\nHopkins' student<br />\ncently appeared before the Omicron Delta Kappa Honorary Soci- chapter of the American Society<br />\nety and requested that the society of Civil Engineers is planning an<br />\nformulate rules for the new dormi- elaborate \"blowout\" to come off<br />\ntories. A committee, of which D. some time in the near future. This<br />\nK. Vanneman is chairman, is now affair vill be held as a sort of climax to one of the most successworking on the matter.<br />\nful<br />\nseasons that the organization<br />\nQuestions to be considered by<br />\nthis committee include: the entire has yet enjoyed. Those in charge<br />\ngovernment of the dormitory; the of the affair are James H. Wills,<br />\nrequirements for living in the dor- president of the Society, and<br />\nmitories; the advisability of al- Frederick F. Moehle, treasurer.<br />\nThe members of the organization<br />\nlowing certain organizations to,<br />\nwill not be asked to contribute<br />\ntake suites; whether classes shall anything for the \"blowout\", for it<br />\nbe segregated or mixed; and the is<br />\nplanned to use the surplus<br />\nlike.<br />\nfunds of the Society for this purThe O. D. K. also announces<br />\npose.<br />\nthat it will probably be of interest<br />\nThe last meeting of the Socito the student body that represenety for the current season was<br />\ntaties of the faculty have appeared<br />\nheld last Tuesday evening, May<br />\nseveral times before the circle dur8, at the Baltimore Engineer's<br />\ning the last scholastic year and reClub, Redwood and Light streets.<br />\nquested aid in matters important<br />\nThis<br />\nmeeting was held in conto the university. junction<br />\nwith the Baltimore secMuch of the most important<br />\ntion of the American Society of<br />\nwork of the society_ this year has<br />\nCivil<br />\nEngineers. The speaker of<br />\nbeen of such a nature that it has<br />\nthe<br />\noccasion<br />\nwas J. H. Waterman<br />\nnot been advisable to make it pubsuperintendent of Timber Preserlic.<br />\nvation of the Chicago, Burlington<br />\nand<br />\nQuincy Railroad. His subPUBLIC HEALTH WORK OF\"The Preservative Treatject<br />\nwas<br />\nFERED HOPKINS STUDENTS<br />\nCross Ties and Strucment<br />\nof<br />\nW. F. Draper, Assistant Surtural<br />\nTimbers.\"<br />\ngeon General of the United States<br />\nPublic Health Service, Washing- Big Fifth Inning Gives Maryland<br />\nton, D. C., has issued a call for<br />\n7-3 Victory Over J. H. U.<br />\nuniversity students to engage in<br />\nContinued from page 1<br />\npublic health work during the base on balls, Nihiser hit into a<br />\ncoming summer vacation. Johns double-play, short to second to<br />\nHopkins undergraduates were in- first, Wallace singled, going to<br />\nvited to participate in this work in second on Smith's error, and Bura letter from Al r. Draper to Dr. dette hit to pitcher. For HopWilliam H. \\\\Teich, Director of the kins,. Grace walked, Rich flied to<br />\nJohns Hopkins School of -Hygiene right and Schacht singled, advancand Public Health.<br />\ning Grace to third. Schacht stole<br />\nThe Public Health Service has second, but when Marrian was out<br />\nrecently received from the West at first, the former was caught<br />\nVirginia Department of Health a with too big a lead.<br />\nrequest for information regarding<br />\nAgain in the seventh neither<br />\nthe availability of college students team scored. The eighth brought<br />\nin public health work during the Hopkins another tally. Rich sinsummer. The need in this state gled and Schacht was hit by pitchfor men is particularly urgent. er. Marrian singled, scoring<br />\nThe Chief Engineer of the Divi- Rich, but Schacht was put out at<br />\nsion of Sanitary Engineering de- the plate.<br />\nclares that he needs a number of<br />\nMaryland failed to score in the<br />\nmen to carry on rural sanitation last inning, while Hopkins shoved<br />\nactivities in his department.<br />\nacross another run. Merrick tripThe State Departments of led and scored on error by the secHealth of South Carolina, Michi- ond-baseman.<br />\ngan, Pennsylvania, Alabama, and<br />\nThe score:<br />\nConnecticut also expressed an inMARYLAND<br />\nAB. R. H. 0. A. E.<br />\nterest some weeks ago in the posWallis, 3b<br />\n4 1<br />\n1<br />\n1 0 0<br />\nsibility of being able to obtain stu- Burdette,<br />\nss<br />\n5 1 2 2 1 0<br />\ndents for short term positions.<br />\nSemler, cf<br />\n5 I<br />\n1<br />\n1 0 0<br />\n2 1<br />\n1 11 1 0<br />\nCompensation in most states is Pollock, lb<br />\nRemsburg, If..<br />\n4 0 0 0 0 0<br />\nnot large. However, Hopkins un- Watkins, c<br />\n1 10 1 0<br />\n4 1<br />\n1 0<br />\n2 I 0 1<br />\ndergraduates who contemplate en- Simmons, rf<br />\nGardner, 26<br />\n1<br />\n3 0 0 0 1<br />\nprofit<br />\nwork<br />\nwill<br />\nof<br />\nline<br />\ntering this<br />\nNihiser, p...<br />\n4 1 2 1 6 0<br />\ngreatly by the vast amount of<br />\nTotals<br />\n33 7 8 27 II<br />\nI<br />\npractical experience this type of<br />\nHOPKINS<br />\nwork offers.<br />\nAB. R. H. 0. A. E.<br />\nTAU BETA PI HOLDS ELECTION OF OFFICERS<br />\nAn election of officers for next<br />\nyear was held at a dinner last<br />\nMonday night by the Tau Beta Pi<br />\nHonorary Engineering Fraternity.<br />\nThe dinner, held at 8 o'clock in<br />\nthe Barn, was the last affair of the<br />\nscholastic year for Tau Beta Pi.<br />\nNew officers elected at this time<br />\nwere: Edward J. Mount, president; Lawrason Riggs Kent, vicepresident; Hugh M. Smallwood,<br />\ncorrespotding secretary; Lee Kinsey, recording secretary; John<br />\nThomas Dixon, treasurer.<br />\nWilliam North Crout was elected arif associate editor of the national publication of the society,<br />\n\"The Bent.\"<br /><br />\nGrace, ss<br />\nRich, rf<br />\nSchacht, 3b, cf.<br />\n.<br />\nMarrian, p, 3b.<br />\nMerrick, lb<br />\nSmith, If<br />\nThomas, 26<br />\nHolland, c<br />\n.. • •<br />\nDannatell, cf.<br />\nMcCubbin, p.. • .<br />\n1 Asendorf<br /><br />\n2<br />\n4<br />\n3<br />\n4<br />\n4<br />\n4<br />\n4<br />\n4<br />\n1<br />\n1<br />\n1<br /><br />\n0<br />\n1<br />\n1<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br /><br />\n0 1<br />\n1 0<br />\n2 2<br />\n2 0<br />\n1 11<br />\n1 2<br />\n0 4<br />\n0 5<br />\n0 2<br />\n0 0<br />\n0 0<br /><br />\n4<br />\n0<br />\n2<br />\n0<br />\n1<br />\n0<br />\n4<br />\n1<br />\n0<br />\n1<br />\n0<br /><br />\n0<br />\n0<br />\n0<br />\n0<br />\n0<br />\n1<br />\n0<br />\n1<br />\n0<br />\n0<br />\n0<br /><br />\nTotals<br />\n32 3 7 27 13 2<br />\n1 Batted for McCubbin in ninth.<br />\nMaryland ... .0 0 0 0 7 0 0 0 0-7<br />\nHopkins<br />\n.1 0 0 0 0 0 0 1 1-3<br />\nThree-base hits—Nihiser, Merrick.<br />\nHome run—Watkins. Stolen bases—<br />\nSimmons, Wallis, Semler, Pollock, Burdette. Sacrifice hit—Grace, Double play<br />\n—Grace to Thomas to Merrick; Grace<br />\nto Thomas to Merrick. Left on bases—<br />\nHopkins, 6; Maryland, 6. Bases on balls<br />\n—Off Marrian, 4; off Nihiser, 2; off<br />\nMcCubbin, I. Hits —Off Marrian, 6 in<br />\n5 innings; off McCubbin, 2 in 4 innings. Hit by pitcher—By Marrian (Sim<br />\nmons); by Nihiser (Schacht). Struck<br />\nout—By Nihiser, 10; by Marrian, 2.<br />\nWild pitch—Nihiser. Losing pitcher—<br />\nMarrian. Umpire—Davern.<br /><br />\n3<br /><br />\nDamon-\"Do you really think that a<br />\ngood pencil helps you to do<br />\nbetter work?\"<br /><br />\nf Custom. Quality.<br /><br />\nPythias—<br />\n\"I know it does! Why, I'm<br />\neven able to read my own<br />\nhandwriting, now that I've<br />\nstarted using a Dixon's<br />\nEldorado!\"<br /><br />\nairoVArbo<br />\n7he masterdrawikkpeizdl<br />\n17 leads—all dealers<br /><br />\nN.Charles Street.<br />\nBRANCH<br />\nAT THE BARN<br /><br />\nTOM LANDY,<br />\nManager<br /><br />\nORDERS RECEIVED FOR<br /><br />\nThe Flag, Banner &amp; Pennant Shop<br /><br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools, Transfer and Baggage Express<br />\nSocieties and Fraternities<br />\nAUTOMOBILE SERVICE<br />\n302 PARK AVE., BALTIMORE, MD. PHONE, HOMEWOOD 6886<br />\nVernon 2355<br />\nR. H. Taylor<br /><br />\nCOGGINS'<br /><br />\nA. FADER<br />\n&amp; SON<br />\nPIPES<br /><br />\nR.G. by &amp; Company<br />\n1 W. University Parkway<br />\nOpposite J. H. U. Athletic Field<br /><br />\nAll the Popular Makes and Styles DRUG STORE for J. H. U. BOYS<br /><br />\nThe BARN<br />\nCAFETERIA<br />\nHot Dinners, Sandwiches,<br />\nCandies, Sodas, Cigarettes,<br />\nTobacco, etc.<br />\nAT THE BARN<br /><br />\nPHONE, HOMEWOOD 2121<br /><br />\n210 E. Baltimore St.<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of the<br />\nJohns Hopkins News..Letter<br /><br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\n,Ar<br /><br />\nGuarantees More Power and<br />\nMileage to Every Gallon<br /><br />\nLUeXatterif<br />\nJAT,A<br />\nH.&amp; OSCAR G.L.—<br />\nOWNERS<br />\nw<br /><br />\n40r-<br /><br />\n29 E. Baltimore St.<br />\n-The Wonder Motor Fuel\"<br />\nSherwood Brothers, Inc.<br /><br />\nOne Door West of Light St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br /><br />\nCollege Literature<br />\nLOMBARD and SOUTH STREETS<br /><br />\nHopkins Wins Middle States<br />\nTrack Meet<br />\nContinued from page 1<br /><br />\nMeyer, Rutgers; second, Hearn,<br />\nJohns Hopkins; third, Allen, Haverford ; fourth, Alderetta, W. &amp;<br />\nJ. Time, 24 5-10s.<br />\n220-yard Dash—Won by Leconey, Lafayette; second, Clarke,<br />\nJohns Hopkins; third, Carol, Lehigh; fourth, Macdonald, Lafayette. Time, 21 6-10s.<br />\nHalf-mile Run—Won by Furbeck, N. Y. U.; second, Williams,<br />\nLafayette; third, R. Norwood,<br />\nJohns Hopkins; fourth, Zozel, N.<br />\nV. U. Time, 2m. 1 2-10s.<br />\nField Events<br />\nShot-put—Won by Hambleton,<br />\nJohns Hopkins; second, Wilgohs,<br />\nW.&amp; J.,; third, Asplundh, Swarthmore; fourth, Loehler, Lafayette.<br />\nDistance, 37 ft. 10/<br />\n1<br />\n2 in.<br />\nJavelin Throw—Won by West,<br />\nW.&amp; J.; second, Carpenter, Dickinson ; third, Asplundh, Swarthmore; fourth, Ginsburg, N. Y. U.<br />\nDistance, 174 ft. 9 in.<br />\nPole Vault—Won by Haslam,<br />\nBucknell ; second, Aaronson,<br />\nJohns Hopkins; third, Throop, N.<br />\nV. U.; fourth, Kenworthy, Dickinson. Height, 12 ft.<br />\nHigh Jump—Won by Proctor,<br />\nJohns Hopkins; Cullen, N. Y. U.,<br />\nBaxter, Delaware; Gibson, Rutgers, and Innet, Rutgers, tied for<br />\nsecond. Height, 5 ft. 9 in.<br />\nDiscus Throw—Won by Thomas, W.&amp; J.; second, R. M. Thomas, Haverford ; third, Hambleton,<br />\nJohns Hopkins; fourth, Delhaven,<br />\nF. &amp; M. Distance, 117 ft./<br />\n1<br />\n2 in.<br />\nBroad Jump—Won by Engel,<br />\nJuniata ; second, Courtois, N. Y.<br />\nU.; third, Aaronson, Johns Hopkins; fourth, Tamplin, Dickinson.<br />\nDistance, 23 ft. 3<br />\n/<br />\n4 in.<br /><br />\nNeatly<br />\nCombed Hair<br />\nNeatly combed in the morning—<br />\nbut what about three o'clock in the<br />\nafternoon?<br />\nFor wiry, unruly hair—for soft,<br />\nfluffy hair—for any kind of hair<br />\nthat won't stay combed all day use<br />\nStacomb—then your hair will stay<br />\ncombed just as you want it.<br />\nIdeal after washing your hair.<br />\nLeaves the hair soft and lustrous.<br />\nAsk your barber for a Stacomb<br />\nRub.<br />\nAt all druggists.<br /><br />\nREC. U.S. PAT. OFFICE<br /><br />\nMakes the Hair Stay Combed<br /><br />\nRENT A CAR!<br />\nDRIVE IT YOURSELF<br />\nHups and Dodges, 18c per Mile<br /><br />\nFords, 12c per Mile<br /><br />\nDRIVE IT YOURSELF CO.<br />\n1725 N. CHARLES ST.<br />\nVERNON 4049<br />\n(One block South of North Ave.)<br />\nOPEN ON SUNDAY<br /><br />\nGet Sun<br /><br />\nOlAilib/f/<br />\nV<br /><br />\nTAN<br />\nWithout<br /><br />\nSORENESS<br />\nor Blisters<br /><br />\nDame Nature Cream<br />\nSemi Liquid<br /><br />\nRubbed in BEFOREHAND<br />\nfortifies skin so it tans without any soreness or<br />\nblisters. Harmless. Does not leave skin greasy.<br />\nSmooths skin wonderfully. Sample 10c. All<br />\nleading drug or dept. stores 35e, double size 60c,<br />\nor Dame Nature Co. Address<br />\n937 Wellington Street, Chicago.<br /><br />\nJOHN<br /><br />\nHEIDELBACH<br />\n\"'TIN<br /><br />\nFINE<br /><br />\nGROCERIES<br /><br />\nFRESH<br />\nCatonsville<br /><br />\nMEATS<br />\nMaryland<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 22, 1923<br /><br />\nTHE NEWS LETTER'S<br />\nJOHNS HOPKINS ORCHESTRA<br />\nMAILBAG<br />\nDELIGHTS WITH CONCERT<br />\nA<br />\nColumn<br />\nin<br />\nWhich the Correspondents<br />\nOn Monday, May 14, the Johns<br />\n(THE BOOK MART)<br />\nAre<br />\nAllowed<br />\nLatitude, But ShoulHopkins Orchestra, under the<br />\nder the Responsibility.<br />\nComplete Stock of<br />\nleadership of Charles H. Bochau,<br />\nAll letters intended for publication<br />\nMedical Books and College<br />\nmust be concise, written in ink oi.<br />\nwfir th Ethel Dryden, pianist, and<br />\nregular letter size paper, on one side<br />\nRequisites<br />\nonly.<br />\nClarence Hihn, tenor, as soloists,<br />\nImporters and Dealers in Fine Books again demonstrated the high poNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nsition held by this organization in<br />\nprinted if request is made that they be<br />\n301 N. CHARLES ST.<br />\nomitted.<br />\nlocal musical circle.<br />\nBaltimore, Md.<br />\nThe publication of a letter is not to<br />\nThe orchestra, composed chiefbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nly of amateur, players, achieved<br />\nfreest discussion of matters of general<br />\nInterest.<br />\nthe unique distinction of rendering<br />\nCollege and Fraternity Stiitionery<br />\nBanquet and Dance Cards, Invitations in true professional style a concert<br />\nopen to the public free of charge. Y. M. C. A. Secretary Objects to<br />\nJAS. H. DOWNS<br />\nMany foreign-born music lovers<br />\nSacrilegious Paragraph in<br />\nENGRAVER PRINTER STATIONER<br />\nbeen unable because of<br />\n\"Black and Blue Jay\"<br />\nwho<br />\nhave<br />\n229 N. CHARLES ST.<br />\nthe high prices to attend events of To the Editor of the Newts-Letter,<br />\nmusical importance, were able to Dear Sir:<br />\ntake advantage of the unusual opIn the \"Spring Fancy\" Number<br />\nportunity offered to them.<br />\nof the Black and Blue Jay there<br />\nOur New Spring Suits and Topcoats at $30 Up<br />\nThe program contained the fol- appeared a paragraph that atWe have purchased 122,000 lowing<br />\nselections:<br />\npair U. S. Army Munson last<br />\ntempted to make a joke from a<br />\n2 to 12 which<br />\nshoes, sizes 51/<br />\nThe Prize Song,from Die Meis- Biblical verse that has in itself<br />\nwas the entire surplus stock<br />\ntersinger, familiar to the Balti- a certain sacredness. While there<br />\nof one of the largest U. S.<br />\nmore public because of the recent may be those to whom the<br />\nGovernment shoe contrac\"Wagnerian<br />\ninvasion ;\" two movetors.<br />\nChristian faith, and the Name and<br />\nments<br />\nfrom.<br />\nMendeIssohn's<br />\nFigure of Jesus Christ mean litThis shoe is guaranteed one<br />\n\"Hymn of Praise\" Symphony;<br />\nhundred per cent, solid leathtle, there are many on the campus<br />\ntwo Greig Elegiac Melodies, beauer, color dark tan, bellows<br />\nwho have a very different feeling<br />\ntifully rendered by the strings; a<br />\ntongue, dirt and waterproof.<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nin<br />\nthe matter. As a representaThe actual value of this shoe<br />\nSymphonic Poem by Bendel, and<br />\nOrchestra—Dancing<br />\ntive of the Hopkins Y. IL C. A. Telephone, Vernon 3442<br />\nis $6.00. Owing to this treGustav Strube's Academic Epioffer<br />\ncan<br />\nmendous buy we<br />\nand many Hopkins students, I<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nlogue.\"<br />\nsame to the public at $2.95.<br />\nshould<br />\nlike<br />\nto<br />\nprotest<br />\nfeel<br />\nsure,<br />\nI<br />\nTABLE<br />\nD'HOTE<br />\nMiss Dryden played, with unSend correct size. Pay postman on<br />\neditorial<br />\nthe<br />\npolicy<br />\nof<br />\nthe<br />\nagainst<br />\nLUNCHEON-60c<br />\nDINNER—$1.00<br />\nusual vividness, Liszt's Hungarian<br />\ndelivery or send money order. If<br />\nmatesuch<br />\nallows<br />\nboard<br />\nwhich<br />\nSUNDAY DINNER—$1.25<br />\nshoes are not as represented we Fantasie. Mr. Hihn sang the Cehardly seems that such<br />\nwill cheerfully refund your money leste Aida aria from \"Aida\" so rial. It<br />\npromptly upon request.<br />\nthat it lost none of its beauty contributions can add to the tone<br />\nof the paper, can win a larger<br />\nthrough its English rendition.<br />\nAt the Washington Monument<br />\nThe Baltimore press was enthu- popularity with the students, or<br />\nrecognition<br />\na favorable<br />\nsiastic in its praise of the concert. gain<br />\nOscar Thomas Olson, D.D.<br />\neither from the alumni or from<br />\nMinister<br />\n296 Broadway, New York, N. Y. COSMOPOLITAN CLUB HOLDS other universities.<br />\nYours very truly<br />\nDANCE<br />\nHopkins Students Are Invited to<br />\nV. J. WYCKOFF,<br />\nTo the haunting strains proMake This Their Church Home<br />\nORTMAN<br />\nGen. Sec'y., Y. M. C. A.<br />\nduced by \"Bob\" Iula's \"Happy<br />\n\"Queen Quality\" Home-made Five\" the Cosmopolitan Club gave<br />\nThe Sunday afternoon -At Horne\"<br />\nChocolates<br />\nDefeat<br />\nStickmen<br />\nHopkins<br />\nin the \"Blue and Grey Room- from<br />\na<br />\nsuccessful<br />\ndance<br />\nin<br />\nthe<br />\nC.<br />\nL.<br />\nLuncheonette<br />\nIces<br />\nIce Cream<br />\nof M.<br />\nU.<br />\nfive<br />\nto seven, followed by the young<br />\nHall<br />\nlast<br />\nFriday.<br />\nCharles<br />\nN.<br />\n227 N. Howard 518<br />\nContinued from page 1<br />\npeople's service will appeal to you.<br />\nDr. Flores of Goucher College,<br />\nDancing Every Afternoon a'<br />\nCharles St.<br />\nYou are invited.<br />\nDr. and Mrs. Latane and Dr. and the net for the last goal Of the<br />\nMrs. Robles were the chaperons. game.<br />\nSunday morning worship at 11 o'clock—<br />\nThe lineup :<br />\nThe committee composed of Miss<br />\nSunday evening service at 8 o'clock—<br />\nMaryland<br />\nMusic by vested chorus-choir of soloists<br />\nMildred Schaeffer, J. M. Rolon, H. Hopkins<br />\nSleasman<br />\nG<br />\nRoutson<br />\nBiosca<br />\nand<br />\nMcFaul,<br />\nJr.,<br />\nW.<br />\nN.<br />\nSTAGMERS PHARMACY<br />\nALL SEATS FREE<br />\nBurger<br />\nP<br />\nhad extensive decorations rival- Bachman<br />\nMarty<br />\nCP<br />\nPRESCRIPTIONS<br />\ning in effect the works of even Zoller<br />\nMcQuade<br />\nF.D<br />\nBarton<br />\nGump or Hamburger.<br />\nCandy<br />\nCigars<br />\nDrugs<br />\nHough<br />\nSD<br />\nThe Cosmopolitan Club is com- Middleton<br />\nBrewer<br />\nTD<br />\nposed of all foreign students at Benedict<br />\nTAILORS<br />\n5308 York Road<br />\nSmith<br />\nthe University and has recently Murphy<br />\nUniforms<br />\nand Liveries<br />\nMarden<br />\nT A.<br />\nspread to other colleges in Mary- Huey<br />\nBaltimore, Md.<br />\n128<br />\nW.<br />\nFayette<br />\nSt.,<br />\nNear Liberty St.<br />\nRowe<br />\nSA<br />\nland. Friday night representa- Coady<br />\nMd.<br />\nBaltimore,<br />\nHiedelbach<br />\nFA<br />\ntives from the University of Mary- Turnbull<br />\nBranner<br />\n0H<br />\nEXPERT RACKET RESTRINGING land vied with Goucher Club Almy<br />\nMyers<br />\nmembers for the honor of being McDaniel<br />\nPrices<br />\n$3.00 \"distinguished guests.\" The club<br />\nNo. 2 Oriental<br />\nfor<br />\nSummers<br />\nSubstitutions —<br />\n4.00<br />\nNo. 3 White Lambs Gut<br />\nSummers,<br />\n$5.00 plans to give several social func- Murphy, Murphy for<br />\nNo. 4 Red Tournament<br />\nand individuality is offered here at prices that are not<br />\nNo. 4A English Tournament... 5.50 tions in the next collegiate year Griffiss for Almy, Almy for Grif6.00<br />\nNo. 5 Armour Orange<br />\nand cannot be underquoted by any house atany time.<br />\n.50 and, under the leadership of Presi- fiss. Goals—Murphy, Almy, GrifWright &amp; Ditson Tennis Balls<br />\nal Besides the reputation of an old-established firm<br />\ndent Rolon, intend to increase fiss, Coady, Branner (2). Referee<br />\nBACHRACH RASIN CO.<br />\nis<br />\nback of each sale with a guarantee.<br />\nTHE WRIGHT &amp; DITSON STORE their activities.<br />\n—Wylie, of Mt. Washington. As14 N. HOWARD ST.<br />\nsistant referee—Baker.<br />\nDR. AMES TO SAIL FOR<br />\nDRAPERIES<br />\nDECORA7IONS<br />\nBlack and Blue Tennis Team Ties FURNITURE<br />\nENGLAND<br />\nMaryland Three-All<br />\n343 NORTH CHARLES STREET<br />\nDr. Joseph S. Ames, Professor<br />\nContinued from page 1<br />\nof Physics, and Director of the<br />\nnearly every game went to deuce,<br />\nPhysical Laboratory, will sail on and both players made some reMay 22 for London, England, markable \"gets.\" With the score<br />\nwhere he will address the Royal 4-all the Hopkins net captain won<br />\nAeronautical Society on May 31. the last two games for the set and<br />\nSend for catalog describing over 400 courses in History, English,<br />\nMathematics,Chemistry,Zoology, Modern Languages,Economics,<br />\nThe theme of Professor Ames' match.<br />\nPhilosophy, Sociology, etc., given by correspondence. Inquire<br />\npaper will be on \"The Connection<br />\nhow credits earned may be applied on present college program.<br />\nSimmons, of Maryland, disBetween Scientific Investigation posed of Kaufholz, 6-0, 6-1, and<br />\nIn Aeronautics and the Design of Wilson, the Med. School captain,<br />\n31st<br />\n%HOME STUDY DEPT.<br />\nCHICAGO. ILLINOIS<br />\nYear<br />\nAircraft.\"<br />\nin a well played match by scores<br />\nThe privilege of lecturing be- of 7-5, 6-3. Wilson's hard hitting<br />\nfore such a distinguished body of and forceful play caused Weber been the \\\\ inner at Washington enough to win both of the dou\\JOU need this little 63<br />\nscientists is a signal honor. Dr. to make errors which lost him the and he also won the second meet- bles, so that the match ended 3-3.<br />\n1 lb. typewriter. $5.00<br />\nAmes is the first American to ad- match.<br />\ning, although only after he had Phillips and Simmons, the Black<br />\na month buys it. See<br />\nCorona today.<br />\nfour<br />\nyears.<br />\ndress the Society in<br />\nThe prettiest encounter of the been extended to the limit. In and Golds' first doubles team, won<br />\nM. W. LUCY &amp; CO.<br />\nAfter delivering the lecture, Dr. entire day whs between the num- the opening- set Phillips was trail- from Hofmeister and Wasser118 W. Fayette St.<br />\nBaltimore<br />\nAmes will attend the Internation- ber two men. Phillips, of Mary- ing 7-8, but by a beautiful spurt man 6-3, 8-6. .Wilson and Bural Aeronautical Congress, which land, was an old foe of Wasser- he won the next three games and linghof, the latter also from the<br />\nwill meet in June.<br />\nman's, having met him in Wash- then won the next set with the Medical School, met Knick and<br />\nKimbrough ; the doctors proved<br />\nProfessor Ames will sail on ington when the two were on rival loss of only one game.<br />\nNeither team was strong strong enough to win 6-2, 7-5.<br />\nprep school teams. Phillips had<br />\nJuly 7 for home.<br /><br />\nThe Medical Standard Book Co.<br /><br />\nClothes for men<br />\nwho like<br />\nthe best style<br />\nand quality<br /><br />\nPUBLIC SALES<br /><br />\n211-213 E. BALTIMORE ST.<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br /><br />\nMount Vernon Place Methodist Episcopal Church<br /><br />\nNational Bay State<br />\nShoe Company<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\n'D<br />\no<br /><br />\nYou Need Extra Courses?<br />\nlittimrsity tfCiltragn<br /><br />"}], "field_media_file": [{"target_id": 37759, "display": null, "description": null, "target_type": "file", "target_uuid": "a2c6cfbd-7e8f-469d-a342-aef3fcb00f08", "url": "http://digital.library.jhu.edu/system/files/2022-03/13069-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13069, "target_type": "node", "target_uuid": "abca863c-9c3c-4ed7-89e7-d26558a1ec1f", "url": "/node/13069"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "8d7e6832-6109-4a12-a04c-0e6c4ac7b67b"}]}