{"mid": [{"value": 38107}], "uuid": [{"value": "ba744647-c0f2-4695-b798-5db81ff4c89e"}], "vid": [{"value": 38107}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:48:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12674-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:48:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:48:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "iqopkins Nrius-Kettrr<br />\n<br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\n<br />\nOlynthus His Topic<br />\n<br />\nHOPKINS QUINTET<br />\nRALLY DEFEATS<br />\nSt JOHN'S SQUAD<br />\n<br />\nON PAGE 3<br />\nPrice Five Cents<br />\n<br />\nHOME WOOD, BALTIMORE, MD., WEDNESDAY, JANUARY 15, 1936<br />\n<br />\nVol XL—No. 24.<br />\n<br />\nEXAM SCHEDULE<br />\n<br />\nASSEMBLY TO HEAR TOYOHIKO KAGAWA Barnstormers Elect<br />\nDR. D. M. ROBINSON TO ADDRESS SUPPER<br />\nIn<br />\nSPEAK ON OLYNTHUS CLUB TUESDAY NGIHT Levine President<br />\n<br />\nStorm Of Defiances<br />\n<br />\nIs At Present Working On Japanese Author Will Speak<br />\nAt University Lecture<br />\nBook Dealing With Old<br />\nSeries Afterwards<br />\nGreek Art<br />\nElection Climaxed Political Jockeying Of Some Time;<br />\n0. D. K. Fraternity Is Accused Of Trying To<br />\nArchaeologist Has Led Two \"World's Foremost ChrisControl The ,Voting<br />\ntian\" Is Philanthropist<br />\nExpeditions To ExcaAnd Churchman<br />\nvate In Greece<br />\n<br />\nJohnnies Conquered By 31-29<br />\nScore After Loss Of<br />\nTwo Players<br />\n<br />\nJohn limes Made Secretary-Treasurer<br />\n<br />\nGenerally titled as the \"foremost<br />\nChristian of the world,\" Dr. Toyohiko Clark Ewings Gets Position Of Business Manager; Lester<br />\nor of art and archaeology at the Johns<br />\nKagawa, renowned Japanese author,<br />\nCaplan Becomes The Production Manager;<br />\nHopkins Uniersity will delivem his philanthropist, churchman, and lec-Watkins Withdraws<br />\nannual lecture to the University turer, will be the speaker at the next<br />\nHarry Woodrow Sinks DeSupper<br />\nUniversity<br />\nthe<br />\nof<br />\nmeeting<br />\nstudent body tomorrow morning at<br />\nAt approximately four-thirty yesterciding Goal In Last<br />\nClub, to be held next Tuesday, Janu11.30 ,in Latrobe Hall. Dr. Robinson<br />\nafternoon Martie Levine defeated<br />\nday<br />\nLevering<br />\nin<br />\nm.,<br />\np.<br />\n6:30<br />\nat<br />\nary 21,<br />\nSeconds<br />\nwill speak on \"Olynthus\", and will<br />\nJerry Branover for the presidency of<br />\nDR. DAVID M. ROBINSON<br />\nHall. Following his address there he<br />\nthe Barnstormers; and, immediately<br />\nillustrate his lecture with slides of will proceed to the Lyric Theater,<br />\nBy MARTIN KRIEGER<br />\nafterwards, there burst over the<br />\nin the<br />\nanother<br />\ndeliver<br />\nexcavation.<br />\nthe<br />\nwill<br />\nhe<br />\nwhere<br />\nLast night a .thousand spectators<br />\ndome of the Barn, such a<br />\nshingled<br />\nDr. Robinson, while on a recent series of University Lectures on rewere given a thrill when they saw<br />\nprotests and recriminations<br />\nof<br />\nstorm<br />\nmoved<br />\nwas<br />\nevent<br />\nDr. Charles Edmunds, Po- as that temple<br />\nlecture tour, pronounced as forgeries, ligious topics. This<br />\nthe Hopkins basketers rally to conof the arts has never<br />\nFirst<br />\nthe<br />\nlocation,<br />\nits<br />\nordinary<br />\nfrom<br />\nquer the St. John's quintet in a hardTo<br />\nHead,<br />\nseveral pieces of supposedly authenCollege<br />\nmona<br />\nclimaxed a week<br />\nelection<br />\nThe<br />\nseen.<br />\nMethodist Episcopal Church, because<br />\nfought and earned victory in baskettic pottery in the Pittsburgh mu- of the extraordinary demand for tickor more of political jockeying, durMonday<br />\nLecture<br />\nball at the Homewood gym.<br />\ning which, it is charged, on one side<br />\nFormer Financial Director seum. He has conducted two expe- ets. However, three hundred pasteIn the last six minutes of playing<br />\nthat \"an unholy alliance ganged up\"<br />\nJohns<br />\nthe<br />\nof<br />\nprovost<br />\nformer<br />\nA<br />\nditions to Olynthus, and is noted for boards, available to students of the<br />\nOf League Of Nations;<br />\ntime victory seemed assured for the<br />\nBranover and on the other that<br />\non<br />\nhis scholarly works on art and arch- Hopkins, are on sale at the Y. M. C. Hopkins will return to the srene of<br />\nThey were leading the<br />\nJohnnies.<br />\nDelta Kappa had attempted<br />\nOmicron<br />\nIs Also An M. P.<br />\nA. office in Levering Hall.<br />\nhis undergraduate, graduate, teach- to control the voting.<br />\nHe is well known in the<br />\naeology.<br />\nJays 25 to 21—a narrow margin,<br />\nBorn forty-seven years ago in Kobe, ing, and administrative work when<br />\nwhich they held throughout the earSir Herbert Brown Ames will de- writing field, contributing frequently<br />\nThe other results were less exJapan, Dr. Kagawa was orphaned at<br />\nlier part of the game. In these last liver the George Huntington WilDr. Charles K. Edmunds, nom pres- citing. John Himes, a member of the<br />\nto magazines of a scientific nature.<br />\nfour. He was educated in his more<br />\nfew minutes Hopkins pushed ahead. liams Memorial lecture tadoy, JanKappi Psi,<br />\nHis latest writings appeared a month tender years at a Buddhist temple. ident of Pomona College, delivers an lacrosse team and Phi<br />\nThen in the next two minutes St. uary 15, at 5 p. m., in the Lecture<br />\nbecome secreto<br />\nBranover,<br />\ndefeated<br />\non \"Flying Over<br />\nJohn's tied the score. With 21 seconds Room at Latrobe Hall. He has chosen ago, in the German magazine, At fourteen he came under the influ- illustrated lecture<br />\nwhich, by<br />\n20, tary-treasurer, an office<br />\nto play, Harry Woodrow shot the as his subject, \"The Countries of Die Antike. The topic of the article, ence of an English missionary and the Andes\", this Monday, January<br />\nconstituthe<br />\nin<br />\nchange<br />\na<br />\nof<br />\nvirtue<br />\nhad his Confucian precepts blended at 5 p. m., in Latrobe Hall. This talk<br />\ndeciding goal, thus ending the game<br />\nwas Excavations at Olynthus.<br />\ntakes presedence over the<br />\nnow<br />\ntion,<br />\nCentral Europe.\"<br />\nwith the doctrines of Christ. Without is open to the public.<br />\nwith Hopkins triumphant.<br />\nOn Academic Council<br />\nBusiness manager. Clark Ewing, a<br />\nSir Herbert, is a Canadian being<br />\nBorn in Baltimore during the same<br />\nthe knowledge of his family he emSt. John's Men Ejected<br />\nSig Ep, bested Bill McFeely for this<br />\nseveral<br />\nJune<br />\n27,<br />\nconducting<br />\nto<br />\naddition<br />\n1863.<br />\nIn<br />\non<br />\nMontreal<br />\nin<br />\nborn<br />\nbraced the new religion by baptism year that the Hopkins was founded,<br />\nThe ejection of two St. John's men, He received his education at AmCaplan became<br />\nat the University, Professor and was soon teaching a Sunday 1876, Dr. Edmunds attended this position, while Lester<br />\ncourses<br />\nLambros and Korgle, in the final herst College and received his Docproduction manager without opposithrilling period of play because of tor of Law degree from there. In Robinson is a member of the aca- school class. When his relatives University to redeive his A.B. de- tion.<br />\ndemic council. He received the post learned this, he was disinherited and gree. In 1895 he was a prize essaypersonal fouls was probably the facThe attacks on O.D.K. mainly cen1915, Sir Herbert, was knighted by<br />\ntor which caused the collapse of all the<br />\nsucceeding Professor Tenny Frank, put out of the house. This was a se- ist, and from 1897 to 1898 he was a tererd around the withdrawal of Bob<br />\ncrown.<br />\nvere blow to family prestige, as Dr. University sdholar. He was appointthe Johnnies' aims and hopes.<br />\nwhose ter mexpired in October.<br />\nWatkins, a pre-election favorite, from<br />\nMember Of Parliament<br />\nKagawa's father had come from a ed as adting professor of physids at<br />\nSt. John's drew first blood at the<br />\nfigure<br />\na<br />\nPresidential lists. In some qdarbeen<br />\nthe<br />\nSir Herbert has long<br />\nDr. Robinson is looked upon as one<br />\nvery rich family and had himself the University of Utah from 1898 to<br />\nonset of the game when Lambros fed<br />\nters it was openly charged that his<br />\nin the public eye. At the age of 31, of the outstanding authorities on<br />\nformerly been Secretary to the Privy 1899.<br />\nthe fast-stepping Ross a perfect pass<br />\nsudden retirement was part of an athe was elected to membership in the<br />\nancient Greek art in the country to- Council of the Emperor.<br />\nwhich went for an equally perfect<br />\nAs a magnetic observer, Dr. Ed- tempt to clear the path for BranoHouse of Commons in Montreal. He<br />\nshot. Siegel netted the rebound of his<br />\nHad Hard Knocks<br />\nmunds aided in making the U. S. ver's election. Watkins pleaded the<br />\nserved in this position from 1904- day. A review of his achievements<br />\nown long try at the basket, to tie the<br />\nA period of hard knocks followed. Coast and Geological Survey from pressure of other activities as a rea1921, a period of seventeen years, were printed early last October in<br />\nscore. From this time until the draKagawa entered and studied for two 1899 to 1900. From 1900 to 1901 he son for his refusal.<br />\nhe was President of Volunteer Elec- the Sunday American Magazine.<br />\nmatic finale, neither team held a<br />\nyears at the Kobe Theological Sem- was an instructor in physics in Washof<br />\ntoral League, and was chairman<br />\n\"O.D.K. is fooling no one,\" a bitter<br />\nAt present, he is hard at work on<br />\ngreater margin than four points. The<br />\ninary. A few years later he was liv- ington and Columbian University. member of the opposition, said im'the Select Standing Committee on<br />\na book on Greek Art, which he hopes ing amongst the poor of the slums.<br />\nJohnnies gained a small advantage<br />\nWhile general secretary for the Hop- mediately after the election. \"We all<br />\n1917, Sir Herbert was honored by<br />\nof 7-4 but the Jays tied it at 9-all.<br />\nBanking and Commerce in 1910. In to have completed in time to be He had a disciple, a skin-and-bones kins Y. M. C. A., Dr. Edmunds was a know that Watkins only acted on<br />\nThe lead wavered between the teams<br />\nbeing appointed chairman of a Spec- shown at the Commemoration Day rice-gatherer, and his policy of non- fellow in physics from 1902 to 1903. orders. If O.D.K. thought it could inuntil at half time St. John's was in<br />\nresistance cost him his front teeth.<br />\nWas Physics Professor<br />\nial Committee of the House of Com- activities, February 22.<br />\nject politics into the Barnstormers<br />\nthe lead, 15-14.<br />\nFor that reason, his enunciation is<br />\nmons, on the care and treatment of<br />\nHe was profesor of physics and it's certainly disillusioned now.\"<br />\nJohnnies Set Pace<br />\nnot all that it might be, on account of electrical engineering in 1903.<br />\nrecalled soldiers.<br />\nThis idyllic picture of the BarnDuring the second half the St.<br />\nSpeak<br />\nTo<br />\na four-gold tooth job done by a midFinancial Expert<br />\nPsychologist<br />\nDr. Edmunds has been American stormers as a united front against<br />\nthe<br />\nas<br />\ncontinued<br />\naggregation<br />\nJohn's<br />\n(Continued on Page 3, Cioi 1)<br />\nNo doubt, the position of Finandirector of the Canton Christian Col- invasion was not entireiy ln keeping<br />\nOn War Here Tonight<br />\npace setter, with leads varying from<br />\nlege since 1926. While provost at the with that conceived by the Branower<br />\ncial Director of the League of NaThe<br />\nadvantage<br />\npoints.<br />\nfour<br />\none to<br />\nHopkins from 1924 to 1927, he was camp.<br />\npost he held from 1919<br />\nProfessor H. Knight Dunlap will Cotillion Board To Hold<br />\nwas held until with ten minutes of tions, which<br />\ninternaalumni director.<br />\nfor<br />\nalso<br />\nto<br />\nresponsible<br />\n1926,<br />\nwas<br />\nsina<br />\nshot<br />\nlecture on the subject of \"War As<br />\nvote today reflects the work<br />\nplaying time left, Melvin<br />\nDance Saturday Night He is a member of a number of \"The<br />\nto his<br />\nindividuals who have been<br />\nfew<br />\na<br />\nof<br />\ngle foul to tie the score at 20-all. tional recognition being given<br />\nViewed by a Psychologist\" tonight at<br />\nscientific societies, among them the \"ganging up\" on Jerry since last<br />\nKrogle placed the Johnnies in the ability as an authority on world fi- 8 p. m. in Room 117, Gilman Hall.<br />\nOn Saturday night, January 18, the<br />\nPacific Geographical Society, of which Friday to fill the staff with their<br />\nlead again with free throws, but Les nancial and political problems.<br />\nCotillion Board will have its first<br />\nis<br />\nThis<br />\nprobably<br />\nthe<br />\nlast<br />\nappearance<br />\nDr. Edmunds is president. Phi Beta supporters. It is this pack from withKnight<br />\nSir Herbert is a member of<br />\nMargolis retaliated for the Jay quindance of the new year. They have<br />\nDr.<br />\non<br />\nDunlap<br />\nof<br />\nKappa and Phi Gamma Delta are his in rather than O.D.K. from without<br />\nof<br />\ncamthe<br />\nHopkins<br />\nHospital<br />\ntries.<br />\nthe<br />\nof<br />\nOrder<br />\nGrace,<br />\ntwo<br />\nof<br />\nin<br />\nfoul<br />\none<br />\ntet by making<br />\nengaged the Townsmen, Baltimore's<br />\ntwo fraternities. He is the author which is turning the club into a poSt. John of Jerusalem, as well as a pus before his departure for CaliforJays Take Time Out<br />\nleading orchestra, for the affair.<br />\nof a number of papers.<br />\nLambros,<br />\nRoss, on a pass from<br />\nlitical battlefield.\"<br />\nlecturer for the Carnegie Endow- nia.<br />\nThe dance will begin at nine p. rn<br />\nsank a basket and later repeated, to ment for International Peace.<br />\nFrom a prominent member of the<br />\nThis lecture will be delivered before and last until twelve. President Algive the Johnnies the advantage by<br />\ncommittee came a solemn<br />\nexecutive<br />\nthe course on war which is being- len Delevett said, \"We want to start<br />\na margin of 25 to 21. The Blue Jays<br />\nwhole affair is as dis\"The<br />\nwarning:<br />\nEv1936 off with a bang-up dance.<br />\nconducted under the joint leadership<br />\n(Continued on Page 3, Col. 6)<br />\ngraceful a sanything in my memory.<br />\nerybody is urged to come and is asof Professor Lovejoy and Dr. Hart. sured a good time.\" The price of adThe range of the little man who 'on])'<br />\nAll members of the University are mission will be one dollar stag or Levering Hall To Be The Scene wants one activity' is getting narrower. If the Barnstormers repeat<br />\ndrag.<br />\ncordially invited to attend.<br />\nOf Monthly Gathering Next<br />\nthis performance, I would strongly<br />\nFriday Night<br />\nA concert by the Johns Hopkins<br />\nrecommend a sharp curtailment of<br />\nMusical Club was given at the MaryThe fourth Faculty and Graduate their activities.\"<br />\nSherwood Anderson To See J. H.<br />\nland College for Women, in Towson<br />\nIn the meanwhile the various cenDance will be held in LeverStudent<br />\nU. Playshop Produce His<br />\nMd. on Friday January 10. The coning Hall Friday evening, from 9 to ters of the storm were riding it out<br />\nPlay, \"Mother\"<br />\n1. Ed Norwood's Continentals, who in grim silence. Levinne preferred to<br />\ncert was followed by a dance in a<br />\nplayed at the last dance of this se- wait deelopments before committing<br />\nThis Saturday evening at 8:30 p. hall immediately behind the college<br />\nSomewhere in this small world of by virtue of her having hinted in her<br />\nries, will again provide the music. himself, while Dave Levy, president<br />\nme the long-awaited arrival of Sher- chapel.<br />\nours, resides a person (a she person letter that our fair college is no<br />\nAdmission is one dollar, stag or of 0.D.K., could not be found for a<br />\nwood Anderson, one of America's<br />\nThe extra features of the concert to be more exact) whom we will re- longer in Baltimore, the J. H. U. has<br />\nstatement.<br />\ncouple.<br />\nleading literary lights to a Baltimore were an organ solo by Duncan Brown<br />\nfer to hereinafter as Miss Z. Well, to simply got to be in Cleveland, Ohio.<br />\nlecture platform will take place in and a special arrangement of the popThe<br />\nComSocial<br />\nGraduate<br />\nStudent<br />\nmake a long story more disgusting, Also she has upset and made agog<br />\nLatrobe Hall. Mr. Anderson, whose ular song. \"The Music Goes Round<br />\nthis hunk of femininity writes letters. the Literati and intelligentsia of this mittee, which has charge of the<br />\nwritings are among the most widely and Round' presented impromptu by<br />\nUpon this fact alone we base two and many other nations by intimating monthly dances, is planning a special<br />\nread of the better American authors, the members of the Blue Jay Orchesdance,<br />\nbrilliant assumptions—first that she that Sir Willam Osler (celebrated celebration at the February<br />\nhas lately exhibited an interest in the tra.<br />\nThere<br />\nDay.<br />\nwhich<br />\non<br />\nValentine<br />\ncomes<br />\n\"Big<br />\nthe<br />\nof<br />\nvery<br />\nis<br />\nthat<br />\nsecond<br />\nshe<br />\nhead<br />\nand<br />\nand<br />\nmember<br />\nmedico<br />\ncan write<br />\ndrama and in the dramatizaation of<br />\nAn infected finger withheld Con- probably able to read!<br />\nFour,\" founders of the Hopkins Med- are rumors that there will be an un- Class Treasurer Says Figures Dehis work. His brilliant collection of<br />\nand a<br />\nrad Gebelein from active participapend On Payment Of PreOne of our brilliant NEWS-LETTER ical School) is no longer deceased, usual scheme of decoration,<br />\nstories, Winesburg, Ohio, has recenttion with the Banjo Club of which he colleagues has jokingly but truly said but liveth, that he was not a physi- special program will be featured.<br />\nvious Class Dues<br />\nwith<br />\nly been produced in play form<br />\nis the director. He did, however, per- of this female lunk-head--hereinafter cian, and that, on the contrary he is Other dances fall on March 13 and<br />\na large measure of success. Mr. An- form with the Hawaiian Troupe, play17th.<br />\nThe latest reports from the Senior<br />\nreferred to as Z party of Z first part a professor in the department of April<br />\nderson will explain this interest of ing only with three fingers.<br />\nSponsors invited for the dance Class officers and from John Murphy,<br />\n(heh! heh!)—that if brains was soap English literature at the Hopkins.<br />\nhis in the theatre in a topic entitled,<br />\nMiss Z wouldn't be able to lather a This whole stupid treatise boils down Friday night: Dr. R. B. Loucks, Dr. chairman of June Week, reveals that<br />\n\"The Writer and the Theatre.\"<br />\nto the fact that, not so very long ago and Mrs. E. B. Mathews, Dr. and the June Week program will, as usgnat.<br />\nAfter his address, the Playshop of<br />\ncase of Miss Z a letter arrived at the University on Mrs. D. R. McKee, Dr. E. T. Norris, ual, cost the graduating students<br />\nthe<br />\nIn<br />\ndiagnosing<br />\nthe Johns Hopkins University, under<br />\nwe have come to the conclusion that the envelope of which was written Dr. and Mrs. G. F. Otto, Dr. J. W. about $15 to $20 each.<br />\nwhose auspices Mr. Anderson is here,<br />\nAbe Edelman, class treasurer, said<br />\nPoultney, Dr. and Mrs. M. W. Puleither she is the innocent victim of the following phony address:<br />\nwill present a one-act play by the<br />\nprice of June Week would range<br />\nthe<br />\nG.<br />\nW.<br />\nand<br />\nlen,<br />\nMrs.<br />\nShaffer.<br />\nand<br />\nDr.<br />\nOsler,<br />\nWilliam<br />\nMr.<br />\nthe<br />\neffect<br />\nto<br />\nrumors<br />\n(ugly<br />\nrumors<br />\nStates<br />\nA report on the third United<br />\nlatter. This play, Mother, has never<br />\nbetween these figures, according to<br />\nof English Literature<br />\nProf.<br />\nUniversity<br />\nthe<br />\nHopkins<br />\nJohns<br />\nthat<br />\nFascism<br />\nand<br />\nWar<br />\nagainst<br />\nCongress<br />\nbeen produced before anywhere, and<br />\nwhether the individual members of<br />\nJohns Hopkins University,<br />\nHopkins is situated in Cleveland, Ohio) or that<br />\nits performance is therefore of great will be delivered by the two<br />\nSophs To Meet<br />\nthe class have paid their class dues<br />\nOhio.<br />\nCleveland,<br />\nwho<br />\nperson<br />\nvery<br />\negotistical<br />\na<br />\nis<br />\nshe<br />\nH.<br />\nand<br />\ninterest, especially to those inter- delegates—Russell Burghardt<br />\nin previous years.<br />\nOn the back of the envelope was<br />\nluncheon ain't had no schooling and has deThere will be a meeting of the<br />\nested in modern drama. The cast in- H Shapiro at the regular<br />\nMurphy expects to complete apEvin<br />\nsomewhere<br />\naddress<br />\nan<br />\nwritten<br />\nthe<br />\nremotest<br />\nhasn't<br />\nshe<br />\nif<br />\ncided<br />\nthat,<br />\nSophomore Class after the ascludes Mary Alvey, S. Vannort Chap- discusison meeting of the Hopkins<br />\npointments to his committee in the<br />\nthe<br />\nthis<br />\nabove<br />\nand<br />\nIndiana,<br />\nansville,<br />\nplace<br />\nits<br />\nhas<br />\nthe<br />\nHopkins<br />\nwhere<br />\nidea<br />\nLevin<br />\nm.<br />\np.<br />\n12:30<br />\nat<br />\nsembly tomorrow.<br />\nman and Kenneth Silver. Tickets for chapter today<br />\nnear future, after which plans will<br />\nof residence and if it tickles her name, Miss — (no, we must continue<br />\nFRANK CRIST„<br />\nboth the play and the lecture may be ering Hall.<br />\nget<br />\nunder way for the seniors' spring<br />\nas<br />\nperson<br />\nmysterious<br />\nthis<br />\nto<br />\nrefer<br />\nto<br />\nUnivergood<br />\nol'<br />\nthis<br />\nto<br />\nplace<br />\nfancy<br />\nthe<br />\nLuncheon 'will be served for<br />\nSecretary.<br />\nobtained at the reading room desk<br />\nevents.<br />\nZ.)<br />\nMiss<br />\nmerely<br />\nOhio,<br />\nthen,<br />\nCleveland,<br />\nsity<br />\nin<br />\ncents.<br />\nthirty-five<br />\nof<br />\nnominal fee<br />\nin the library for 50 cents.<br />\n<br />\nFANS WITNESS A<br />\nTHRILLING TILT<br />\n<br />\nDr. David Moore Robinson, Profes-<br />\n<br />\nH. B. AMES TO SPEAK<br />\nON \"CENTRAL EUROPE\"<br />\n<br />\nHOPMNS EX-PROVOST<br />\nTO SPEAK ON ANDES<br />\n<br />\nED. NOR WOOD TO PLAY<br />\nAT FACULTY-GRAD DANCE<br />\n<br />\nCOLLEGE FOR WOMEN<br />\nRENOWNED PLAYWRIGHT HEARS MUSICAL CLUB<br />\n<br />\nTO SPEAK SATURDAY<br />\n<br />\nlVIissZ Writes Letter To William<br />\nOsier, English Literature Prof<br />\n<br />\nJUNE WEEK TO COST<br />\nBETWEEN $15 & $16<br />\n<br />\nANTI-WAR LEAGUE TO HEAR<br />\nREPORTS ON CONVENTION<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., JANUARY 15, 1936<br />\n<br />\nMbc Rms./Letter<br />\n<br />\nQUAD QUIPS<br />\n<br />\nIntercollegiates<br />\n<br />\nON THE BOOK HORIZON<br />\n<br />\nFounded 1897<br />\nBy JACK STEIN<br />\nMiami appears to be the hangout for Hopkins students over their Christmas vacation. I met Eddie Abrams, and Arthur Gordon at a dance down there, and<br />\nI understand that here were some there that I didn't<br />\nsee. The only solution to the question as to why so<br />\nmany students go there, lies in the fact that beautiful<br />\nwomen are so much in evidence down here. If you<br />\ndon't believe it, just see any current newsreel.<br />\n*<br />\n*<br />\n*<br />\n<br />\nIn a recent issue of the Richmond OLD JULES, by Mari Sandros. Lit- the storms, the wind and isolation.<br />\nCollegian, the letters-to-the-editor<br />\nBrown and Company. 1935. $3.00. But the most impressive stories were<br />\ncolumn was headed \"Forum, or agin<br />\npp. 424.<br />\nthose told me by Old Jules himself,<br />\n'em.\"<br />\n\"You know, I consider artists and perhaps on the top of Indian Hill,<br />\nRemit subscription fees to Treasurer, Student Acwriters the maggots of society,\" overlooking the spot where he helped<br />\ntivities Council, Remsen Hall, Postoffice, Johns Hopwrote Jules Sandros to his daughter hang a man. Perhaps he limped<br />\nkins University.<br />\nThe Swarthmore Phoenix is very Mari, when he was told that she had<br />\nthrough the orchard as he talked,<br />\nworried. No wonder. Listen to their been awarded an honorable mention<br />\nEntered as second-class matter December 3, 1909,<br />\nwith me close behind, my hand full<br />\ntrouble:<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\nin the Harper's Intercollegiate Con- of ducks or grouse or quail . . . and<br />\n\"We wonder what this collitch is test.<br />\nCongress, November 3, 1879.<br />\nalways I was too frightened of him<br />\nOn point that I noticed in the letter which the coming to when a female who manOne cannot but wonder whether he to voice either approval or surprise.\"<br />\nPublished semi-weekly from October to June, exStudent Council sent to the NEWS-LETTER in regard to aged to get her feet wet removes her would have held the same opinion<br />\n* * *<br />\ncept during examination and college holiday periods<br />\nassemblies, tickled my dubious sense of humor. In one shoes and socks in the library and al- when, ten years later, her story of<br />\nAN AUTHOR LOOKS AT WIWI<br />\nby undergraduates of the Johns Hopkins University.<br />\nparagraph they state, The ultimate penalty for absence lows her tootsies to adorn the top of hir, life was awarded the Atlantic<br />\nHUNGARIAN THEATRE<br />\na library table.\"<br />\nwill be indefinite suspension from the University.<br />\nNon-Fiction prize of $5,000. But more<br />\nEDITORIAL DEPARTMENT<br />\nA. E. Wilson is a dramatic critic<br />\nPreceeding this paragraph is a list of rules and reg*<br />\nthan likely he would have changed of the<br />\nKenneth Zierler<br />\nEditor-in-Chief<br />\nLondon Star and the author of<br />\nulations having to do with the fool-proof system of<br />\nLrvizg Leberfeld<br />\nThe law students of the University his mind, for this was quite a differ- King Panto, the History of PantoManaging Editor<br />\ntaking attendance.<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nof Texas do not wear a cap and gown ent matter. In Old Jules, his daugh- mime, which E. P. Dutton and ComThe last paragraph of the letter asks for our coAssistant Managing Editors<br />\nat graduation, but they put a sun- ter, who was closest to him and yet pany published recently. He reports<br />\noperation. I think it was damned decent of them to<br />\nDavid Caplan, Bernard D. Pinck,<br />\nflower in their lapel, instead. This most afraid of him, had set down that he has just returned from a holask for our cooperation.<br />\nSports Editors<br />\ncustom dates back to the '90s, when tfne record of his struggles as a pio- iday trip to Budapest where he went<br />\n*<br />\n*<br />\nEdgar Kemler<br />\nMagazine Editor<br />\na professor of law suggested that neer, and a builder of communities. \"to get a glimpse of the native draCONGRATULATIONS!<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\n\"just as the sunflower . . . turns its For \"Old Jules\" was, above all things, ma.\" He was not exactly lucky, he<br />\nTo Bernard Lewis, biology instructor who was the<br />\nColumnists<br />\nhead toward the sun, so we want our a supreme egotist—with that fanat- says, as he found only one theatre<br />\nJesse N. Borden<br />\nAdvisory Editor<br />\nonly person connected with this University to be awardlawyers to turn to the light and to ical egotism that is born of the con- cpen during his visit—the summer<br />\nEDITORIAL STAFF<br />\ned a Rhodes Scholarship this year.<br />\nbring justice to all people every- sciousness of a mission.<br />\ntheatre on St. Margaret Island where<br />\n*<br />\n*<br />\n*<br />\nSigmund Safier, Max Lskowitz, Nathaniel FinkOld Jules is the biography of an<br />\nwhere.\"<br />\nthey put on a revival of Wunder Bar.<br />\nelstein, Murray Kempton, Wethered Barro11, Jr.,<br />\nSince the New Deal and its \"Professors\" seem to be<br />\nAmerican by choice. Jules Sandros,<br />\n*<br />\n*<br />\n*<br />\n\"My impressions of Magyar drama<br />\nIsadore Gertman, Jewett Goldsmith, Leonard<br />\ngetting one long beautiful sleigh ride down, this letter<br />\nthe son of a Swiss veterinary, was<br />\nJaffe, Red Glantz, Lester Caplan, Howard ReizSixty co-eds at Iowa State Univer- being educated to join the medical in the original- are therefore limited<br />\nwill probably not hurt their feelings. The following<br />\nenstain, Julian Adler.<br />\nletter was received by the Bureau of Home Economics, sity were bedridden recently after profession, when, after a sudden rift though enjoyable,\" he says. \"But I<br />\nsampling some of the \"food\" they had with his father, he decided to come WP S certainly rewarded by seeing one<br />\nof the Department of Agriculture:<br />\nBUSINESS DEPARTMENT<br />\ncooked in the home economics class. to America. So he left the blue wa- of the most beautiful women I have<br />\nDanville, Indiana<br />\nDavid H. Levy<br />\nBusiness Manager<br />\never seen in Ilona Titkos, who is one<br />\n*<br />\n*<br />\nSept.<br />\n7,<br />\n19<br />\nters of Lake Neuchatel, crossed the<br />\nRobert Watkins;<br />\nAdvertising Manager<br />\nof the leading actresses of Budapest<br />\nBureau<br />\nof<br />\nHome<br />\nEconomies<br />\nocean;<br />\nand<br />\nwith<br />\nno<br />\nother<br />\nRobert Levi<br />\nassets but<br />\nThe ticket director of the Ohio<br />\nCirculation Manager<br />\nand by the extraordinary hospitality<br />\nU. S. Department of Agriculture<br />\nWilliam. B. Kempton<br />\nOffice Manager<br />\nState University says that he re- twenty dollars, a stamp collection, a<br />\nof Hungarian journalists and the<br />\nMelville Locker<br />\nDear Uncle Sam:<br />\nCopy and Filing Manager<br />\nquires a staff of 2,500 persons at ev- Swiss army rifle, and a spade, he<br />\nHungarian people generally. When I<br />\nPlease tell if vitamins A B and C are real things or ery big football game.<br />\ntravelled as far west as he could and<br />\nvisited a smart cabaret in Buda the<br />\nBUSINESS STAFF<br />\njust hypothetical substances like members of the Holy<br />\n* * *<br />\nfinally filed on a homestead in northS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\nrtoprietor, apprised of my presence,<br />\nTrinity.<br />\neastern Nebraska.<br />\nN. Soifer, S. Tinley<br />\nThe Saturday Evening Post is the<br />\nactually stopped the floor show in<br />\nDon't refer this to just any school boy, but have it<br />\nFor fifteen years his life was one<br />\nfirst choice in the magazine field of<br />\npresence of `Mr. Winston (sic) in<br />\nanswered by a guy who is the real cheese in this line.<br />\nlong, hard struggle. In his determiWednesday, January 15, 1936<br />\nthe students at Harvard. Next in<br />\norder to announce to the assembly the<br />\nMRS. ANDREW P<br />\nnation to found a community in the<br />\nrank are Time, Collier's Reader's Dic,•!lebrated dramatic critic from Lon*<br />\n*<br />\n*<br />\nsandhills of the region, Old Jules<br />\ndon!'<br />\nA new affiliation has hit the major part of the Soph- gest, Esquire, and New Yorker.<br />\nran against the interests first of the<br />\n*<br />\n\"The audience cheered like mad,<br />\nomore student body. Just as everyone was about to<br />\ncattlemen and later of the sheepmen.<br />\nWe know Marty Levine and think he's a very fine breathe easier over the thought that their English<br />\nFor the first time in 11 years a With gun in hand he was forced to the gypsy band played 'Smoke Gets<br />\nfellow, but we don't imagine that, up until a week or paper, and their History paper, were almost finished, woman entered the varsity football<br />\nprotect his rights and those of the in your eyes'—presumably under the<br />\nso ago, he ever saw himself as president of the Barn- they were told of a new animal, an Economics paper. dressing room at Minnesota Univernumerous settlers whom he helped in impression that that is the English<br />\nstormers. With the somewhat general knowledge of This was no small animal, either. From three to five sity when a co-ed reporter was perestablishing themselves. Jules was a national air—and I was photographed<br />\nthe individual merits of the case that we have, we'd say thousand words was the size. That, my friends, is one mitted entrance recently to get a<br />\nhard man—brutal—masculine clean in three different attitudes for the ilthat Gerald Branower would seem to have been a more<br />\nof a lot of words.<br />\ncolor story for the school paper.<br />\nthrough. These years saw him ar- lustrated press. I'm afraid we don't<br />\nnatural choice for the job.<br />\n*<br />\n*<br />\n*<br />\n* * *<br />\nrested several times, for incendiar- make so much fuss in London over<br />\nBranower's trouble was that he was an 0. D. K., and<br />\nThe following is in memoriam to a blind date arism,<br />\nand on suspicion of murder the visit of Hungarian dramatic critStudents at Colgate have been<br />\n0. D. K., like some other social fraternities, tried to ranged by telephone:<br />\namong<br />\nother things, not to mention ics.\"<br />\nasked to register any firearms which<br />\n*<br />\nrun things. They wanted Brother Branower to have a<br />\nHer laugh was very pretty<br />\nthree divorces.<br />\nthey keep in their rooms.<br />\nmajor office so they could give excuse for having iniHer diction was divine—<br />\nE. P. Dutton and Company will<br />\nMiss Sandros, in explaining how<br />\n*<br />\n*<br />\n*<br />\ntiated him. In order to do this they induced Brother<br />\nSo how the heck was I to know<br />\nshe came to write the biography of publish next month In Quest of Lost<br />\nAn Eastern women's college com0. D. K. Bob Watkins to decline the nomination for the<br />\nTha t she looked like Gertrude Stein.<br />\nher father, says that \"it grew out of Worlds. The author, Count Byron<br />\npiled a report saying that men get<br />\npresidency. It was generally believed that the two can*<br />\n*<br />\n*<br />\nthe long hours in the smoky old kit- de Prorok, is a brilliant young andidates would be Brother Branower and Brother WatI witnessed a strange phenomena coming to Balti- angry on an average of six times a chen on the Running Water, the si- thropologist and a member of the<br />\nkins.<br />\nmore on the train from New York, following a recent week while women get angry only lent hours of listening behind the Royal Geographical Society. In trailThe Barnstormers are a spirited bunch. They re- vacation.<br />\nhalf as many times. A men's college<br />\nstove or the wood box, when it was ing the path of Alexander to Jupiter<br />\nsented 0. D. K.'s attempt to \"fix\" things. They decided<br />\nThe train was the 6:30 out of Pennsy, a popular came back with, \"True enough, but assumed that I was in bed. So it Ammon and in exploring the wilds of<br />\nto fight politics with politics. Therefore, we have Marty Hopkins train. True to custom,<br />\nHopkins was very well who makes us mad?\"<br />\nwas that I heard the accounts of the Central America, Count Prorok has<br />\nLevine president on an anti-O. D. K. vote.<br />\n*<br />\n*<br />\n*<br />\nrepresented. Goucher had a number of very nice girls<br />\nhunts, of the well accident, of the uncovered a great amount of new<br />\nIt's another indication of 0. D. K.'s ranking on this<br />\non the train. Bernie Pinck, whose Mother thoughtfully<br />\nTwo Michigan co-eds pawned their fights with cattlemen and the sheep- facts concerning sexual cults, jungle<br />\ncampus. The boys have been indicted again!<br />\nsent along a bag of sandwiches with him (he lives in violins in order to buy a ticket to the men, of the tragic scarcity of women, fires, harems, Lancadon pygmies who<br />\nthe Dorms) was very busy trying to make an impres- last Michigan football game of the when a man had to \"marry anything eat clay, blood-drinkers and sacrifision on ye Goucher Gals. So Bernie straightened his season.<br />\nthat got off the train,\" of the drouths, cial raping of virgins.<br />\nnecktie, plunked his bag of food on the seat, and walked<br />\n*<br />\n*<br />\nAs a general rule we oppose steamroller education. over to the women. Immediately three or four (Dorm)<br />\nAd in the Syraeuse Daily Orange:<br />\nPeople don't learn against their will. Sometimes, though, students made a dive for the bag. Three sandwiches<br />\n\"A prayer book was found at the<br />\nthey need a shove—something to overcome their iner- gone. When Mr. Pinck returned and discovered his<br />\ntia. Therefore, we favor compulsory assembly attend- loss, he pleaded with the fellows not to take any more, freshman dance. Owner nif.y have<br />\nsame by calling at the Administraance for the underclassmen.<br />\nKRA_MPUS GENERALS<br />\nBy HAROLD M. KROPMAN<br />\nThe Student Council's and then went back to Goucher.<br />\ntion Building.\"<br />\nplan for checking attendance seems to be necessary if<br />\nJOHN MYERS—now in charge of the<br />\nPUBLIC NOTICE:<br />\n'Twas not very long before Goucher was surrounded<br />\ncompulsory attendance is to be anything but a farce.<br />\nby Hopkins. This is the phenomena. I don't believe that<br />\nWill \"California\" Jean, \"Kitty\" Post Office. Here is a man who has<br />\nBy emphasizing the wrong element, however, the since the days of Daniel Gilman, have Hopkins<br />\nfellows<br />\nStrange, and \"Killer\" Hutch please seen them come and go at this UniStudent Council has apparently given a bad reason for been attracted by Goucher<br />\nGals.<br />\ntake notice of the change in sched- versity. In 1891 he was first cona good thing. Elsewhere on this page, a letter to the<br />\nWhile on the subject of Goucher, it may be interestule of the appearance of the NEWS- nected with the University in the<br />\neditor calls attention to the Council's error in wanting ing to<br />\nprint a notice which appeared a short while ago<br />\nLETTER.<br />\nThe weekly Wednesday physics laboratory under Dr. Rowto compel attendance because a speaker \"feels a bit in<br />\na national college magazine. For the past ten years, To the Editor of the NEWS-LETTER<br />\nnight meetings will probably now be<br />\nchagrined at the small audience.\" It is true that he will<br />\nonly 30 per cent of Goucher graduates have married!<br />\nland, who was then head of the deDear Sir:<br />\nheld on Monday night. I hope you<br />\nnot be complimented by a drafted audience.<br />\n*<br />\n*<br />\ng.<br />\nNow, although everybody knows that the NEWSThe Student Government's letter find this convenient. I presume I am partment. In 1921 he was appointMilton Tuerk, and Joe Skyer, both lived in the<br />\nLETTER doesn't like to hurt anybody's feelings, we don't<br />\nconcerning compulsory attendance at saying the right thing, although ed secretary of Student Activity<br />\nDorms last year, occupying a suite of rooms. Feeling<br />\nsometimes I have to convince the Council, which position he held until<br />\nthink that the speakers' disappointment should guide<br />\nassemblies certainly is weak.<br />\nthe need for comfort, they purchased some second<br />\nparty in question.<br />\nour decision in forcing attendance. Inasmuch as the<br />\n1934. He is a holder of the Varsity<br />\nthe<br />\nIf<br />\nthe<br />\nspeaker<br />\nis<br />\n\"chagrined<br />\nat<br />\nhand easy chairs. When the term ended, instead of<br />\nassemblies are for the students, it seems to us that it is<br />\nOh, pardon me. I thought you all Seal, the Barnstormer<br />\nam<br />\nI<br />\npresence<br />\nof<br />\nsmall<br />\naudience,<br />\na<br />\ncharm, the<br />\nselling the chairs, they figured it would be cheaper to<br />\ntheir interests that are to be considered.<br />\nsure that he would absolutely and knew the girls. Didn't you know they Musical Club pin, and a member of<br />\nstore them away, and use them again next year.<br />\nSo we say that the students' getting into the habit<br />\ntype for the editorial staff? I'm sorAccordingly they put their chairs in storage, and positively be insulted, if he knew that<br />\nof using some of their spare time listening to discusry. You didn't ever see Jean and C. D. K. He gained all these recwas<br />\naudience<br />\nthe<br />\npresence<br />\nof<br />\na<br />\nlarge<br />\nsions on a range of subjects and learning to appreciate along with them they stored some Physics notes, which due to compulsion.<br />\nKitty sing, dance, and play the pi- ognitions through years of honorable<br />\nvarious viewpoints on these matters is a step towards had been given them by a fellow to use this year.<br />\nano in Levering Hall on Wednesday ble service and is proud of them. I<br />\nI am certain that any speaker<br />\nWhen this term opened, the two young men inquired<br />\nthe University's turning out full men—living men. Narnight in between articles?<br />\nWhere wonder if he could make 0, D. K.<br />\nof the storage company what their bill amounted to. would rather have a small, enthusiasrow men don't seem to get along.<br />\nhave you been? Just ask Glantz or<br />\nnow?<br />\nWhen they were told what the sum was, they decided tic and attentive audience, rather Safier<br />\nor O'Brian or Finkel to tell<br />\nit was cheaper to leave the chairs in storage, along then a large, unattentive one.<br />\n0-0<br />\nyou all about those weekly parties in<br />\nwith their Physics notes.<br />\nI think that the Student Govern- the office. Swell time, eh boys!<br />\nREMEMBERING PEOPLE'S NAMES<br />\n. . . and now they have to do their own Physics ment should make the assemblies so<br />\no—o<br />\ncontinues to cause me a great deal<br />\nMore important than the letter about assemblies is —and on hard chairs.<br />\ninteresting that no student would<br />\nFOUND in my postoffice box one of trouble and embarrassment.<br />\nthe Student Council's letter about the handling of class<br />\nI<br />\nwant to miss one.<br />\nmorning surrounded on all four sides can speak to a person concerning a<br />\nfunds through the Student Activities Committee, known<br />\npartments, a special department to handle class affairs,<br />\nThis is a challenge! Can't the Stu- by dust—I pay fifty cents a year for very personal matter,<br />\nto us who love it as the S. A. C.<br />\nand tell him I<br />\netc.<br />\ndent Government meet it?<br />\nthe privilege of collecting dust in will let him know what happens. He<br />\nThe purpose is to cool the ebullition of youthful enSecond, will the S. A. C. always be more capable<br />\nthis specially designed box. All the leaves and I have to go around askthusiasm that has driven class officers to gamble so<br />\nMORRIS A. WESSEL.<br />\nthan class officers? Not necessarily. The S. A. C. is virsmall particles are sifted out. No one ing people in the room \"To whom<br />\nmuch on putting on the \"biggest affair ever\" that they've<br />\ntually self-perpetuating. The dean makes the appointwas I talking?\" so that I will know<br />\nelse can have it except me:<br />\nhad to pawn their underwear, mortgage their roomments, but he makes them from a panel of suggestions Tc, the Editor of the NEWS-LETTER:<br />\nIt<br />\nthe<br />\nCity<br />\nexpenses.<br />\nwith whom to get in touch. Many<br />\noff<br />\nHall<br />\nto meet<br />\nmates, and raffle<br />\n\"For your column—<br />\nothers profess the same trouble in a<br />\nis believed that the more business-like heads of th S. A. furnished him by the retiring chairman. Thus it is quite Dear Sir:<br />\nThe only man who can run around<br />\nCommitteemen will dissuade them from letting ambition possible that the S. A. C. may become a political body,<br />\nIn view of the fact of the increas- with a bag all night and not get greater or lesser degree—so let's not<br />\nwith<br />\nmembership<br />\nin<br />\nit<br />\nand<br />\npromised<br />\nbargained for and<br />\ntake offense when a close friend turns<br />\nover-vault cash limits.<br />\ning importance of the handball team talked about is Santa Claus.\"<br />\nto you and says, \"What's your name<br />\nIn view of past p erformances it would seem that bartered in deals. The dean could never be expected to and its installation as a minor sport<br />\nI thought it very clever but a little<br />\nbe familiar with the intimate intricacies of campus polthe class officers could stand a quieting influence. There<br />\nI wish to call attention to the playing untimely since the fellows had al- again?\" Just tell him and forget all<br />\nis little doubt but that the S. A. C. could do this job itics known only by a few high priests. The politicians wall.<br />\nready dragged bags to the Barn- about it. Or perhaps you would like<br />\nwell. The present S. A. C. has done so well in its reg- might get away with it for a while—at least long<br />\nThe playing wall is of bare red stormer affair, and had probably small name-plates on the order of<br />\nulation of funds that it has incurred the undying en- enough to do some damage.<br />\nbrick and in such nature it is hard dated the same bags for New Year's license plates to be hooked on one's<br />\nThere are ways to check this. One would be to put<br />\nI'm for it in a big way.<br />\nmity of the business heads of the various activities—a<br />\non the eyes of players and makes the Eve. Very good advice for the fu- clothing.<br />\nsure sign of a careful fiscal administration. But in the S. A. C. up for popular election with a complete ball soon difficult to follow.<br />\nture, though.<br />\n0-0<br />\nspite of this, we want to be cautious. We want to look reformation of the present system of election qualifica0-0<br />\nsuggest<br />\nthat<br />\nAs<br />\none<br />\ninterested,<br />\nI<br />\nTHOSE<br />\nTO<br />\nFEW<br />\nwho have noticed<br />\ntions. Another would be to have it appointed by a facahead and ask questions and make sure.<br />\ncoat<br />\ngiven<br />\na<br />\nthe<br />\nwall<br />\nbeing<br />\nnecessity<br />\npeculiar<br />\na<br />\nodor<br />\nabout<br />\nthe campus, let<br />\nNOW<br />\nFROM<br />\nON,<br />\nfellows,<br />\nquit<br />\ngivFirst, will the S. A. C. be able to stand this extra ulty committee of the School of Business Economics<br />\nof white paint or white wash. This ing Mr. Dittus all kinds of bad me explain that it is just the stink of<br />\nfrom<br />\namong<br />\nthose<br />\nstudents<br />\nwhose<br />\nscholastic<br />\ninterests<br />\nof<br />\nmade<br />\nup<br />\nC.<br />\nis<br />\nS.<br />\nA.<br />\nthat<br />\nthe<br />\nwork? Remember<br />\nwould be kind consideration to our names because of the book-store politics, of which the campus is supstudents—three students. As it is, their tasks are hard are along the lines of the S. A. C.'s work. Perhaps that<br />\nteam as well as a courtesy to the prices. The book-store is owned and posed to be entirely free. Give you<br />\nown<br />\nis<br />\nthe<br />\nbest<br />\nway.<br />\non<br />\nits<br />\nand consuming. It looks as though the S. A. C. is<br />\nvisiting<br />\nsquads.<br />\nrun by the University through their three guesses who it was this time—<br />\nAt any rate, before we put too much authority in the<br />\nway towards becoming a full-time job.<br />\nMr. Dittus. I think quite none other than—oh, you wouldn't<br />\nemployee,<br />\nYours<br />\nsincerely<br />\nC.<br />\nwe<br />\nwant<br />\nto<br />\nS.<br />\nA.<br />\nbe<br />\nas<br />\ncertain<br />\nas<br />\nposThis could be remedied, for example, by enlarging hands of the<br />\nyou owe him an apology. care, anyway.<br />\na<br />\nfew<br />\nof<br />\nEnthusiast.<br />\nHandball<br />\nA<br />\nwant<br />\nit<br />\nto<br />\nbe.<br />\ndoesn't<br />\nbecome<br />\nsomething<br />\nwe<br />\ndon't<br />\nsible<br />\nit<br />\ndeit<br />\ninto<br />\nC.<br />\nand<br />\ndividing<br />\nthe<br />\nS.<br />\nA.<br />\nof<br />\nmembership<br />\nthe<br />\nSubscription per year<br />\nBy Mail<br />\n<br />\n$2.00<br />\n$2.50<br />\n<br />\nIndicted Again<br />\n<br />\nChagrin And Bear It<br />\n<br />\nDeaf, Dumb And Blind<br />\n<br />\nLETTERS TO<br />\nTHE EDITOR<br />\n<br />\nHorrible Thought<br />\n<br />\ndli<br />\ntic<br />\npa:<br />\nmt<br />\nty.<br />\nup<br />\nan<br />\n<br />\nWil<br />\n<br />\nwe<br />\nSe:<br />\nstoo<br />\ncr(<br />\nize<br />\nwIi<br />\nslu<br />\nco]<br />\nTh<br />\nwh<br />\nanE<br />\npr<br />\n<br />\nSG(<br />\n<br />\nSOI<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD., JANUARY 15, 1936<br />\n<br />\nWOOD DESCRIBES<br />\nJAPAN'S LEADING DR.<br />\nNEW HIGH EXPLOSIVE<br />\nCHRISTIAN WILL<br />\nTALK AT HOPKINS<br />\nIs<br />\n<br />\nToyohiko Kagawa To Speak<br />\nAt Supper Club Meeting<br />\nNext Tuesday<br />\nUNIVERSITY SERIES<br />\nWILL FOLLOW<br />\nLyric Is Chartered To Hold<br />\nThe Unusually Large<br />\nAudience<br />\n(Continued from Page 1, Col. 4)<br />\ndling dentist. He continued to practice philanthropy, until it became apparent that he could not thus make<br />\nmuch headway in diminishing poverty. On the advice of a friend he pulled<br />\nup his stakes and went to America<br />\nand returned a couple of years later<br />\nwith a Bachelor of Divinity degree<br />\nwon at the Princeton Theological<br />\nSeminary. He married and soon<br />\nstarted on a new tack towards decreasing the poor. This was to organize and assist the industrial workers,<br />\nwho were better able to care for the<br />\nslums' \"down-and-outers\", and in this<br />\nconnection he wrote his first book,<br />\nThe Adoration of the Laborer, in<br />\nwhich he propounded a remark, a<br />\n•masic axiom to him: \"The laborer<br />\nproduces the things which the rest of<br />\nsociety needs; therefore, his status in<br />\nsociety is more essential to it than<br />\nthat of the king.\"<br />\nHelped Laborers Greatly<br />\nIn the Japanese rice riots of 1919<br />\nthe thirty-year-old cleric obtained<br />\ngreat gains for the workers. Working<br />\nhand-in-glove with the governor of<br />\nKobe, he secured plenty of food for<br />\nthe poor people. Two years later, by<br />\nhis magnificent personality and great<br />\nhold over the people, he prayed and,<br />\nin so doing, put down a Communist<br />\nuprising. For his pains, he was jailed<br />\nfor a fortnight, but during that time<br />\nhad an opportunity to finish his third<br />\nautobiographical book, Listening to<br />\nthe Voice of the Wall.<br />\nHis previous tales of his experiences and expressions of his philosophies were best sellers and captured<br />\nthe hearts of the progressive young<br />\nintellectuals of the nation. A few<br />\nmonths later he was called upon by<br />\nthe Tokyo government to settle another \"reign of terror.\" He'later assisted the Premier, who was Chairman of the Reconstruction Commission.<br />\nPreached Twice Nightly<br />\nPreaching twice nightly, he later became the organizer and leader of the<br />\nKingdom of God movement and converted many thousands of Nipponese<br />\nto Christianity. In fact, 65,000 of Japan's youth signed cards affirming<br />\ntheir faith. Together with his evangelistic work he acted as head of the<br />\nSocial Bureau of Tokyo, having the<br />\nmayor himself as a subordinate. He<br />\ngreatly aided a citizens' cooperative<br />\nprogram and was materially responsible for opening Tokyo's first inexpensive hospital. Ever since 1923 he has<br />\nbeen a highly-esteemed adviser of<br />\nthe Japanese government.<br />\nAlthough his royalties from his<br />\nbooks amount to more than $10,000<br />\na year and his other sources of income are equally profitable, Dr. Kagawa is said to live on $40 a week,<br />\nsupporting a wife and three children.<br />\n<br />\nDEBATING TEAM OPENS<br />\nSEASON THIS FRIDAY<br />\n<br />\nSensitive Enough To<br />\nBe Detonated By A<br />\nHousefly<br />\n<br />\nAn explosive so sensitive that it<br />\nexplodes by the weight of a housefly<br />\nalighting on it was described by Prof.<br />\nR. W. Wood to the American Association for the Advancement of Science.<br />\nIt is the iodide of nitrogen, which<br />\ncan be detonated by the gentlest of<br />\nforces.<br />\nProfessor Wood gave this as one<br />\nexample of striking physical effects<br />\nof certain high explosives. He stressed<br />\nthe fact that \"too much publicity cannot be given to the disastrous effects<br />\nproduced by detonators which project a copper pellet with a velocity<br />\nof 6,000 feet per second, three times<br />\nthe velocity of a rifle bullet and<br />\ngreater than the velocity of the shells<br />\nwhich were fired on Paris from a distance of 75 miles during the World<br />\nWar.\"<br />\nAs an example, he cited the almost<br />\ninstant death of a Baltimore woman<br />\nwho was struck by a small pellet of<br />\nmetal, which, as Dr. Wood, to whom<br />\nit was submitted for investigation,<br />\nlater proved, turned out to be a detonator left in the coal by some careless miner.<br />\nHe gave accounts of the experiments of earlier investigatort, including a lantern slide showing the<br />\niinpressions of even the smallest<br />\nveins of the leaf of an apple tree<br />\nmade on a block of steel by exploding gun-cotton above it. In his own<br />\ninvestigations, Dr. Wood said two<br />\nsuperposed telephone directories were<br />\nrequired to stop one detonator, the<br />\npellet going through 1200 pages.<br />\nProfessor Wood has also made a<br />\nspectroscopic study of several high<br />\nexplosives.<br />\n<br />\nDR. GARTNER DELIVERS<br />\nTHIRD DOHME LECTURE<br />\nEvidence For The Existence<br />\nOf Bound Water Is<br />\nHis Topic<br />\n<br />\nExamination Schedule HOPKINS LEADERS AT<br />\nHOPKINS QUINTET<br />\n•<br />\nJANUARY 27 TO FEBRUARY 4, 1936<br />\nThe morning sessions begin at 9 A. M.; the afternoon sessions at<br />\n1 P. M. The time allowed is as follows: in a three- or four-hour course,<br />\nthree hours; in a one,- or two-hours course, two hours.<br />\nAll conflicts should be reported to the Registrar's office by January 17.<br />\n<br />\nMONDAY MORNING, JAN. 27<br />\nAdvanced Electricity & Magnetism<br />\nM201<br />\nBiology IC<br />\nA to L<br />\nMain Lib.<br />\nM to Z<br />\nG112<br />\nEnglish 3C<br />\nG312<br />\nFrench 3C<br />\nG205<br />\nGas and Fuel Analysis<br />\nM104<br />\nLatin 3C<br />\nClass. Lib.<br />\nMatchematics 1C<br />\nMr. Turpin<br />\nM114<br />\nMathematics 2C<br />\nDr. Cohen<br />\nRo100<br />\nDr. Morrill<br />\n,Ro58<br />\nMr. Popow<br />\nRo58<br />\nDr. Zariski<br />\nRo101<br />\nPolitical Economy 6B ....G313 and 314<br />\nPsychology 1C<br />\nR101<br />\nSanitary Engineering<br />\nL307<br />\nMONDAY AFTERNOON, JAN. 27<br />\nElements of Electrical Eng....M109M110<br />\nEnglish 1C<br />\nDr. Miles<br />\nR1<br />\nMr. Kilbourne<br />\nM221<br />\nFi ench 4C<br />\nG305<br />\nGerman Reading (9:30 a. m. sec.)<br />\nDr. Prahl<br />\nMain Lib.<br />\nDr. Rosenberg<br />\nMain Lib.<br />\nDr. Roulston<br />\nMain Lib.<br />\nMathematics of Finance<br />\nG311<br />\nTUESDAY MORNING, JAN. 28<br />\nElectrical Measurements<br />\nM220<br />\nFrench IC<br />\nMr. Shapiro<br />\nR301<br />\nFrench 2C<br />\nMr. Spurlin<br />\nG205<br />\nGeology 1C<br />\nL120<br />\nLatin 1C<br />\nClass. Lib.<br />\nMaterials of Engineering....M109-110<br />\nMathematics 4C<br />\nRo100<br />\nMathematics 5C<br />\nRo101<br />\nPhilosophy 1C<br />\n0314<br />\nPolitical Economy 3B<br />\nG311<br />\nPolitical Economy 12B<br />\nR1<br />\nPolitical Economy 21B<br />\nG313<br />\nPsychology 2C<br />\nG312<br />\nZoology 4P (Genetics)<br />\nG112<br />\nTUESDAY AFTERNOON, JAN 28<br />\nFrench Reading<br />\nDr. Rice (3 p. m. sec.)....Main. Lib.<br />\nGerman Reading<br />\nDr. Roulston (3 p. m. sec.),<br />\nMain Lib.<br />\nLatin 6C and 7C<br />\nClass. Lib.<br />\nUnit Processes in Gas Eng<br />\nM114<br />\nWEDNESDAY MORNING, JAN. 29<br />\nChemistry 2Ca<br />\nR1<br />\nHeat Gen. and Transmission<br />\nM119<br />\nHistory (Freshman)<br />\nDr. Lane's and Mr. M,archant's<br />\nSections<br />\nMain Lib.<br />\nMr. Goldman's Sections<br />\nG112<br />\nDr. Bowen's Sections<br />\nR101<br />\nPolitical Economy 1C<br />\nDr. Evans<br />\nM110<br />\nPolitical Economy 22B<br />\nG311<br />\nStructural Engineering<br />\nL307<br />\nSurveying<br />\nL210<br />\nWEDNESDAY AFTERNOON<br />\nJANUARY 29<br />\nEnglish 11E<br />\nL120<br />\nGerman Reading (2 p. m. sec.)<br />\nDr. Prahl<br />\nMain Lib.<br />\nDr. Roulston<br />\nMain Lib.<br />\nLatin 5C<br />\nClass. Lib.<br />\nMathematics 1C<br />\nMr. Hartman<br />\nM110<br />\nMr. Rawhouser<br />\nM109<br />\nMr. Umberger<br />\nRo102<br />\nMathematics 2C<br />\nMr. Fox<br />\nRo100<br />\nPolitical Science 2C<br />\nR1<br />\nSpanish 1C<br />\nR303<br />\n<br />\nDr. Ross A. Gartner of the University of Minnesota spoke on \"Evidence for the Existence of Bound<br />\nWater\" last Friday in Remsen Hall.<br />\nThis was the third Dohme lecture to<br />\nbe delivered.<br />\nHe described how the colloidal<br />\nstate is characterized by intense surface forces. It is this surface energy<br />\nwhich is utilized for the processes<br />\nof adsorption.<br />\nIn the biological organism most of<br />\nthe \"dry matter\" constituents exist<br />\nin the colloidal state with water as<br />\nthe dispersion medium. The proteins<br />\nparticularly are highly hydrophilic.<br />\nIn 1922, Newton and Gortner first<br />\nsuggested a method for measuring<br />\n\"bound water,\" i.e., water which was<br />\nso strongly held upon colloid interfaces as to be differentiated in its<br />\ncolligative properties from water-inbulk. Since 1922 other technics have<br />\nbeen developed for making similar<br />\nmeasurements so that *today we have<br />\nthe methods which are known respectively as the cryoscopic method,<br />\nthe calorimetric method, the dilatometric method, the direct pressure<br />\nmethod, the refractometric method,<br />\nthe polarimetric method, the dielectric constant method, and the vapor DR. ADEL TO ADDRESS<br />\nPHYSICS JOURNAL CLUB<br />\npressure method.<br />\n<br />\nJay Musical Club To<br />\n'Present Two Concerts<br />\n<br />\nTHURSDAY MORNING, JAN. 30<br />\nBiology 2C<br />\nMain Lib.<br />\nElectric Railways and Electrical Illumination<br />\nM217<br />\nEnglish 8C<br />\nG312<br />\nFrench Reading<br />\nMr. David<br />\nR1<br />\nDr. Rice<br />\nR1<br />\nMr. Schweitzer<br />\nR1<br />\nDr. McKee<br />\nR1<br />\nFrench 1C<br />\nMr. Morrissette<br />\nR301<br />\nMr. Spurlin<br />\nM218<br />\nGas Engineering<br />\nM314<br />\nGerman 1C<br />\nG314<br />\nHistory 4C<br />\nM119<br />\nItalian 1C<br />\nG311<br />\nMachine Design<br />\nM121.<br />\nMathematics 3C<br />\nMr. Curtiss<br />\nRo58-Dr. Morrill<br />\nRo100<br />\nDr. van Kampen<br />\nRo102<br />\nDr. Williamson<br />\nRo58<br />\nPhilosophy 3C<br />\nG313<br />\nPolitical Economy 1C<br />\nDr. Weyforth<br />\nR101<br />\nPsychology 3C<br />\nR302<br />\nRailroad Engineering<br />\nL307<br />\nTheory of Structures<br />\nL115<br />\nTHURSDAY AFTERNOON, JAN. 30<br />\nChemistry 7CP<br />\nR301<br />\nMilitary Science, Basic 1<br />\nL120<br />\nMilitary Science, Basic 2<br />\nL120<br />\nMilitary Science, Adv. 1....South Loft<br />\nMilitary Science, Adv. 2....South Loft<br />\nFRIDAY MORNING, JAN. 31<br />\nAlternating Current Theory<br />\nElectrical Section<br />\nM220<br />\nMechanical Section<br />\nM218<br />\nApplied Mechanics<br />\nL120 and Draw. Room<br />\nEnglish • 7Ca<br />\nG311<br />\nHistory (Sophomore)<br />\nR1<br />\nMathematics 2C<br />\nMr. Curtiss<br />\nM114<br />\nMr. Kersimer<br />\nRo100<br />\nPolitical Economy 2C<br />\nM110<br />\nFRIDAY Ak-rh_IRNOON, JAN. 31<br />\nChemistry 1013<br />\nR221<br />\nEnglish 9C<br />\nG311<br />\nHistory 1C<br />\nG108<br />\nMathematics 5E<br />\nDr. Cohen<br />\nRo100<br />\nDr. Morrill<br />\nRo104<br />\nPolitical Science 3C<br />\nG313<br />\nSATURDAY MORNING, FEB. 1<br />\nChemistry 2Cb<br />\nR101<br />\nEnglish 30C<br />\nG314<br />\nGreek 1C<br />\nG312<br />\nHeat Engines<br />\nM109 and 221<br />\nPolitical Economy 11B and 14B,<br />\nMain Lib.<br />\nPower Plant Calculations<br />\nM110<br />\nMONDAY MORNING, FEB. 3<br />\nChemistry 1C<br />\nR1<br />\nGerman 1TC (8:30 sec.)<br />\nG314<br />\nPhysics 1Ca<br />\nRo104<br />\nPhysics 1C<br />\nStudents in Arts & Sciences L120<br />\nStudents in Engineering<br />\nRo58<br />\nPolitical Economy 1C<br />\nDr. Mitchell ....Main Lib. and G112<br />\nPolitical Economy 20B<br />\n0313<br />\nMONDAY AFTERNOON, FEB. 3<br />\nEnglish 6C<br />\nG117<br />\nPolitical Science 1C<br />\nR101<br />\nChemistry 9CP<br />\nR219<br />\nTUESDAY MORNING, FEB 4<br />\nFrench 5C<br />\n(Conversation and Composition,<br />\nG312<br />\nHighway Engineering<br />\nL115<br />\nHistory 2C<br />\nG313<br />\n<br />\nPhilological Society To<br />\nHear Dr. R. D. Havens<br />\n<br />\nAt a meeting of the Physics JourThe Johns Hopkins Philological Asnal Club in Roland Hall on Thurssociation<br />\nwill meet Thursday, Januday, January 16, Dr. Adel will speak<br />\nary<br />\n16,<br />\nat<br />\n11:30 a. m., in ROGIll 216,<br />\non \"The Absorption of Sunlight in<br />\n<br />\nGroup Will Play At Clifton Ave. M.<br />\nthe Earth's Atmosphere.\" Dr. Adel ilman Hall. Professor Raymond D.<br />\nE. Church And At AnnapThe debating team will hold its<br />\nis a fellow-by-courtesy of the Phys- Havens will read a paper entitled,<br />\nolis High School<br />\nfirst debate of the season this Fiday<br />\nics Department and is Professor of \"Solitude, Silence, and Lonely Places<br />\nThe Johns Hopkins Musical Club,<br />\nat 4 p. m. in room 305, Gilman Hall.<br />\nin the Poetry of Wordsworth.\"<br />\nAstronomy.<br />\nof which John Murphy, Jr., is presThe subject of the debate will be:<br />\nResolved: That Congress be allowed ident, will present two concerts on 12MMIK111111<br />\nby a two-thirds majority to overrule Thursday and Friday of this week.<br />\nThe first concert will be rendered<br />\ndecisions or the Supreme Court declaring acts of Congress unconstitu- here in Baltimore at ClifMton Avetional. Johns Hopkins will, support nue M. E. Church. The solo for the<br />\nthe negative side. The team will &in- evening will be the \"Liebstrom\", by<br />\nsist of two men. Moses B. Macht will Franz Liszt. The solo will be preAll Topcoats<br />\nbe first speaker and rebuttalist and sented by Brian Murphy.<br />\nWere $22.50 to $55<br />\nOn Friday the Musical Club will<br />\nPhillip Grossman Will be second<br />\n$18.75 to $44.75<br />\nspeaker. Team is coached by Dr. travel to Annapolis where they will<br />\nAll Overcoats<br />\nLynn.<br />\nglve a concert at the Annapolis High<br />\nWere $25 to $100<br />\nThe question for debate is of special School. The dance orchestra will play<br />\n$20.75 to $79.75<br />\ninterest in view of the recent A.A.A. for a dance after the concert.<br />\nand N.R.A. decision by the supreme<br />\ncourt.<br />\nThis will be the last debate until<br />\nafter exams when many strong teams<br />\nPrinters of<br />\nsuch as Yale, Pennsylvania and<br />\nPHILOLOGICAL and<br />\nPrinceton will be met<br />\nSCIENTIFIC PUBLICATIONS<br />\nTwo Hours Free Parking, Mid-City Garage, 27 8. Charles<br />\nThis debate is open to the student<br />\nBaltimore<br />\n12-20 Hopkins Place<br />\nbody.<br />\n<br />\n1<br />\n<br />\nentire stock of<br />\nKatz Fall and<br />\nWinter Suits<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\nKATZ CLOTHES<br />\n7 & 9 E. Baltimore St., at Charles<br />\n<br />\nFIRST A. S. U. MEETING<br />\n<br />\nOrganization Aims To Fuse<br />\nCampus Opinion Of All<br />\nColleges<br />\nAs the first step in the formation<br />\nof the Hopkins chapter of the American Students' Union, through which<br />\n<br />\nRALLY DEFEATS<br />\nST. JOHN'S SQUAD<br />\n<br />\nit s planned to fuse all elements of<br />\nprogressive campus opinion, a closed<br />\n<br />\nMargolis, Melvin, Woodrow<br />\nStar; Jays Play Well<br />\nThroughout Tilt<br />\n<br />\ndiscussion, attended by several Hopkins leaders, was held in the board<br />\nroom in Levering Hall last Friday.<br />\n<br />\nLAMBROS, KOOGLE<br />\nLOSS TO JOHNNIES<br />\n<br />\nAnother such session to clarify points<br />\nraised last week will be held day after tomorrow.<br />\n<br />\nRoss Is Outstanding Performer With High Score<br />\nOf 18 Points<br />\n<br />\nChief point of controversy in the<br />\ndiscussion was the peace program of (Continued from Page<br />\n1, Col. 1)<br />\nthe new union. Already a storm cen- now called time out. Six minutes of<br />\nter at its inception, the A. S. U., in playing time remained and a victory<br />\nwas not apparently in store for them.<br />\nconvention at Columbus, recommendTime in, Woodrow shot successed both the abolition of the R. 0. T.<br />\nfully and was fouled by Ross. The<br />\nC. and the adoption of the famous Hopkins fans groaned when he missOxford Oath. Many foresaw an early ed his extra point. Herb Siegel and<br />\nschism unless the two opposing ele- Lambros charged together and the<br />\nlatter left the game on personal<br />\nments come to some agreement. If<br />\nfouls.<br />\nthe constitution of the national orNeither made his single free throw.<br />\nganization permits individual chap- Krogle then fouled Melvin<br />\nand was<br />\nters to be autonomous, some compro- also ejected for the same reason,<br />\nwhile Melvin, the captain of the Jay<br />\nmise may be reached.<br />\nsquad,<br />\nsank two goals to tie the<br />\nThe meeting was opened by Morscore at 25-all. Galloway, substitute<br />\ntis Shils, representative of the Naforward, lost the ball by staying with<br />\ntional Student League at the con- his back to the basket for more than<br />\nvention with the reading of the Union the 3 seconds allowed in the free<br />\nplatform. Chief points on the pro- throw lane. This ruling is one which<br />\ngram were (1) Drastic peace meas- was installed this year. Next Harry<br />\nures, with the Oxford Oath and R. 0. Woodrow shot from the middle of the<br />\nT. C. abolition advocated particular- floor to put Hopkins ahead, 27-25.<br />\nly; (2) Democratization of education;<br />\nWith an apparently safe and as(3) a militant campaign against sured lead after Les Margolis sank<br />\nFascism and against repression of the ball on a pass from his brother,<br />\nacademic freedom. Shils stressed in George, the Hopkins squad entered<br />\nhis conclusion the clause which wel- the final three minutes of play.<br />\ncomes into the fold any person seriHard-Fought Finish<br />\nously interested in any one feature<br />\nBut Ross, one of the outstanding<br />\nof the program.<br />\nindividual players, shot a single foul<br />\nAmong those attending the session out of two attempts and then placed<br />\nwere Jesse Borden, Sidney. Levy, a goal through the netting. He was<br />\nClifford Bruck, Brian Murphy, Her- fouled on this shot and added an<br />\nschel Halbert, Maus Darling, Ralph extra point to tie the score, 29-all.<br />\nNordstrom, Murry Kempton, and The remaining twenty-one seconds<br />\nRussell Burghardt. Irving Cohen pre- was tense and filled with whirlwind<br />\naction.<br />\nsided.<br />\nLester Margolis passed to Harry<br />\nWoodrow unheeded under the basket<br />\nand Guard Woodrow netted the final<br />\nand decisive tally unopposed.<br />\nIn the last few seconds of play St.<br />\nJohn's'got the jump, and when Greer<br />\nshot from the outside Les Margolis<br />\nIn cases where it is impossible fouled him. Les was ejected because<br />\nfor a fraternity team to play at the it was his fourth foul.<br />\nscheduled time, the ame will be postRoss was particularly outstanding<br />\nponed until a later date, providing for the Johnnies, scoring a total of<br />\nthe excuse is acceptable to Mr. Lotz 18 points. Lambros and Koogle were<br />\nand Mr. Dotterwiech, and notice is also outstanding St. John's men.<br />\ngiven to these men 48 hours in adFor Hopkins Melvin, Woodrow and<br />\nvance of game-time. Games which Les Margolis put in fine and comare post-poned by the fraternities mendable performances. Siegel, G.<br />\nwithout notifying the men in charge Margolis could not have been spared<br />\n48 hours ahead of game time will from the line-up because of their exbe dropped from the schedule and no cellent showing.<br />\npoints allowed for the game.<br />\nAny team which is not dressed and<br />\non the floor ready to play within<br />\nOn<br />\nfifteen minutes after the scheduled<br />\ntime of the game will loose the game<br />\nDr. David M. Robinson, professor<br />\nby forfeit.<br />\nof art and archaeology at the Johns<br />\nHopkins University, will deliver two<br />\noutside lectures in the near future.<br />\nDr. Robinson will speak to the<br />\nGoethe Society, Saturday, January<br />\nProfessor Horace Wright, profes- 18, at 8:15 p. m., at the home of<br />\nsor of classics at Lehigh University, one of the members. His topic will<br />\nwill lecture here next Wednesday, be, \"The Influence of Greek Poetry<br />\nJanuary 22, at 5 p. m., in Latrobe on Goethe.\"<br />\nHall, Homewood.<br />\nOn Monday, January 27, at 11:30<br />\nProfessor Wright will speak on a. m. Professor Robinson will deliver<br />\n\"Early Rome.\" His lecture will be a lecture to the Arundel Club on<br />\nillustrated by lantern slides.<br />\n\"Olynthus.\"<br />\n<br />\nLOH INTERPRETS<br />\nINTERFRAT RULES<br />\n<br />\nDr. Robinson To Speak<br />\nGoethe And Olynthus<br />\n<br />\nProfessor Wright To<br />\n,Talk On \"Early Rome\"<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br />\n<br />\nWhat you want is easy to find.<br />\nYou get efficient service.<br />\nPrices are reasonable.<br />\n<br />\nHUTZLER 13FCffilEM e<br />\n...real<br />\n.<br />\n11 0.4..<br />\n4.<br />\n0<br />\n•••••••••••••••••••410•41.1.111.11.111.11.1111.4.<br />\n.<br />\n4.<br />\n<br />\nHAIRCUTS-40c<br />\n<br />\nBoulevard<br />\n<br />\nChas. Landler, Prop.<br />\n<br />\nBarber' Shop<br />\n<br />\nS. E. Corner Saint Paul & 33rd Streets<br />\nEntrance on 33rd Street<br />\nWeek Days-8 A. M. to 7:30 P. M.<br />\nSaturday-8 A. M. to 9 P. M.<br />\n<br />\nI<br />\n<br />\nBirely's Pharmacy<br />\nST. PAUL at 33RD STREET<br />\nPrescriptions—School Supplies<br />\n.<br />\nCandy-Cigars<br />\nUnexcelled Fountain Service<br />\n<br />\n11.0.11.4.0.111.0.111.0.41.41.0.0.111.46.11.11.0.111.4.0.4.11•••••••<br />\n<br />\n\fHOME WOOD, BALTIMORE, MD.. JANUARY 15, 1936<br />\n<br />\n4<br />\n<br />\nCOURTN1EN LOSE<br />\nTO WASHINGTON<br />\nIN HOME DEBUT<br />\nChestertown Shoremen Triumph Over Homewood<br />\nArray, 47 To 35<br />\nBLUE JAYS TRAIL<br />\nFOE AT HALFTIME<br />\nSiegel, High Scorer Of Contest With 14 Points;<br />\nFrosh Over J. V.<br />\nThe Johns Hopkins courtmen lost<br />\ntheir first game in the Maryland Intercollegiate Basketball League series to an aggregation from Washisgton College last Friday night at<br />\nHomewood by a score of 47 to 35.<br />\nAlthough the Jays were defeated, the<br />\ncontest in no way suggested the affair would be repeated often.<br />\n<br />\nBLACK<br />\nAND<br />\n<br />\n-<br />\n<br />\nBLUE<br />\n<br />\nBy BERNARD PINCK<br />\n<br />\nWashington Has<br />\nFormidable Quint<br />\nIf their performance last Friday<br />\nnight against the Blue Jay cagers is<br />\nrepresentative of their customary<br />\ngame, the Shoremen from Chestertown bid fair to cop the league bunting this year. A cool, cooperative outfit, the Maroon and Black are also<br />\nblessed with the height, weight, and<br />\nstamina so helpful to a basketball<br />\nteam.<br />\nThe Chestertown lads are a scrappy bunch who fight every minute of<br />\nthe game. They pass exceedingly<br />\nwell, cut fast, and make their shots<br />\ncount. Bolstered by a capable second<br />\nteam, it would seem that the Washington quint is the team to beat in<br />\nthe Maryland League.<br />\nHopkins appears to be suffering<br />\nfrom a paucity of capable reserves.<br />\nTowards the end of the Washington<br />\nencounter, the starting players were<br />\nIf the subs are<br />\nreally exhausted.<br />\nworthy of enteriing a hard close fray<br />\nthey haven't proved themselves yet<br />\nto Coach Mallonee.<br />\n0-0<br />\n<br />\nThe play during the first period<br />\nwas fast, exact, and the scoring was<br />\n<br />\nGrapplers Open<br />\nSeason Tonight<br />\n<br />\nfairly even, with Washington leading<br />\nGus Van Sant's mighty wrestlers<br />\nby only three points at the conclu- inaugurate the current season tonight<br />\nsion of that half. The score then was at the gymnasium when they en22-19. Playing masterly ball, and counter the grunters and groaners<br />\ncompletely dominating the affair, from Maryland. The Jay rnatmen<br />\nhave been training for some time and<br />\nWashington College tossed in 25<br />\nare a well conditioned group. Having<br />\npoints to the 15 by the Hopkins team<br />\na number of veterans and several<br />\nin the second period, to complete the promising candidates in the line-up,<br />\nscoring for the game.<br />\nthe grapplers are hopeful of a sucGame Starts Slowly<br />\ncessful season.<br />\nWrestling is one of the most gruelThe fray started with the customary \"feeling out\" process by both ling sports on the campus. Hitherto it<br />\nhas not received its due support. Dearrays, with Melvin putting away a<br />\npractice sessions,<br />\nspite their hard<br />\nfield goal to give first blood to Hoptheir bruised bones, and their mat<br />\nkins. Washington countered with 5 burns, the grapplers are very enpoints on three free throws and a re- thusiastic about their activity. Cerbound shot. Hopping Herbie Siegel tainly then, student support at the<br />\nand Norm Melvin rearranged the matches should be more readily<br />\nscore with a field goal apiece. Hop- forhcoming.<br />\nkins leading, 6 to 5, one of the Chestertown<br />\n<br />\nstalwarts<br />\n<br />\nswished<br />\n<br />\none<br />\n<br />\nthrough the netting to alter the situation a bit. Carl Rasin tied the score<br />\nwith a foul shot.<br />\n<br />\nAfter Siegel in-<br />\n<br />\ncreased the home lead with another<br />\nfield goal, the Maroon and Black aggregation set up a barrage of shots,<br />\nscoring nine points. At this point<br />\nin the tussle, Harry Woodrow went in<br />\nfor Les Margolis. Les had a bleeding<br />\nnose. The Washington center put in<br />\ntwo shots from the foul line to be<br />\nfollowed by Melvin dribbling through<br />\nfor two points. A long shot by the<br />\nvisitors was atoned for by a series of<br />\nHopkins goals, adding eight points<br />\nto its total, just before the half ended_ At half time Hopkins was trailing<br />\nby 19-22.<br />\nThe Shoremen opened the last period with three points, from a long<br />\nshot and a foul. Siegel, playing an excellent all-around game, followed with<br />\nanother long shot. A Washington<br />\nforward added to the score with an<br />\nunder-basket shot. Both teams then<br />\nshot and were effective, in turn, the<br />\nChestertown array getting 11 points<br />\nto Hopkins's nine. The Homewood<br />\nfans were then disappointed to see<br />\nfour enemy field goals in succession.<br />\nSiegel and George Margolis rang up<br />\ntwo scores, aided by Woodrow's free<br />\nthrow. A Washington College foul<br />\nshot ended the contest.<br />\nSiegel High Scorer<br />\nHerbie Siegel was the high scorer<br />\nfor the local team with a total of 14<br />\npoints, followed by Norm Melvin, his<br />\nteammate, who accounted for eight of<br />\nthe Hopkins markers. The Chestertown point-setter was their giant<br />\ncenter, Zebrowski, with 12 points,<br />\nwith Smith close behind with 11.<br />\nCharacterized by smooth passing,<br />\nmiraculous shooting, and what is<br />\nmore important, a fighting spirit, the<br />\nfray indicated that the horde from<br />\nSt. John's would be in for a battle<br />\nwhen they invaded the Hopkins campus.<br />\nIn a preliminary game, the Freshman basketball team beat the Junior<br />\nVarsity organization by a score of<br />\nis to 11 . . . two swell shots were<br />\nmde during the varsity game by Siegel and Rasin . . . Herb's went in<br />\nfrom a point to the side and behind<br />\nthe basket, while Carl stood on the<br />\ncenter line and dropped the ball in<br />\nwithout its hitting the rim . . . the<br />\nlatter shot was disallowed due to a<br />\ntechnicality . . . the crowd was entertained during the half by the trick<br />\nshooting of the varsity substitutes,<br />\n\"Chubby\" Rubinger, \"Hal\" Zheutlin,<br />\n\"Dimmy\" Traggis, and \"Cold Turkey\" Rosenthal.<br />\n<br />\nHANDBALL TOURNEY Jay Matmen<br />\nBeat Maryland<br />\nIN SECOND ROUND Hopkins Wins 5 Of Tilts<br />\n<br />\nSportlight<br />\nC. BERNARD LEWIS, JR.<br />\n<br />\n8<br />\n<br />\nWinners Of Tournament To<br />\nBecome Members Of<br />\nVarsity Outfit<br />\nThe first round of the handball<br />\ntournament ended yesterday and the<br />\nsecond round has begun. This second<br />\nround will extend until January 17.<br />\nThe quarter-finals, semi-finals, and<br />\nfinals are all scheduled to follow immediately after so that the entire<br />\ntournament will be completed before<br />\nthe exams.<br />\nDick Pasternak, manager of the<br />\nteam, has been arranging a heavy<br />\nschedule. Since all of last Year's<br />\nvarsity team returned this year under the leadership of co-captains Joe<br />\nKrell and Joaquin Hernandez, it is<br />\nexpected that the team will give a<br />\ngood account of itself.<br />\nThis year, the Johns Hopkins<br />\nhandball team is a recognized minor<br />\nsport and competition for first team<br />\nberths has been keen. Coach Reuben<br />\nBaer announced that the winners of<br />\nthe tournament and last year's varsity members will constitute the varsity squad.<br />\nResults of the first round were as<br />\nfollows:<br />\nI. Milberg defeated Kasselbrauer,<br />\n21-11, 21-12.<br />\nJ Krell defeated Windsor, 21-17,<br />\n21-13.<br />\nHarrell defeated Goldberg, 21-11,<br />\n22-20.<br />\nN. Finkelstein defeated M. Tuerk,<br />\n21-14, 21-14.<br />\nR. Byer defeated L. Rubinger, 21-11.<br />\n21-13.<br />\nM. Lazarus defeated Newhall, 21-12,<br />\n24-26, 21-12.<br />\n<br />\nTo Defeat Maryland<br />\nIn Opener<br />\n<br />\nA close-knit V-neck white<br />\nsweater of 1900 vintage, was reported missing last week by Bernard Lewis.<br />\nThe sweater has his name on it.<br />\nThe garment has no real value<br />\nother than sentimental attachment.<br />\n<br />\nthat's Bernie . . . A product of Prov-<br />\n<br />\nidence, R. I. . . . Came to Hopkins as<br />\nThe Hopkins wrestlers conquered<br />\nthe University of Maryland team Brown University grad of '35 . . .<br />\n2 in the first match of Enrolled as instructor and grad stu2 to 101/<br />\n/<br />\n251<br />\nthe season for both teams at the dent in Biology department.<br />\nHomewood gym.<br />\nBernie's quite a trackster--fourThe Blue Jays won five of the eight<br />\nvarsity man at high school . . .<br />\nyear<br />\ncontests, one by default. They drew<br />\none and lost two. Three of the Hop- Captain last two years . . . Held<br />\nkins victories were by falls. Mary- state championship of both broad<br />\nland earned one by a fall and one by jump and high jump . . . Also played<br />\ntime advantage decision.<br />\nfcur• years of varsity soccer . . .<br />\nA real exhibition of their brawn<br />\nand wrestling prowess and ability Picked All-State center-half . . . At<br />\nwas put on by the Jay men. The Brown: Frosh football and track, 155<br />\nquickest fall was registered by L. pound Brown wrestling champ, varEdwards when he toppled Brady<br />\nsity track three years . . . Captained<br />\nwith a double bar in 48 seconds.<br />\nteam last year . . . Ad lib: (1) In<br />\nSUMMARY<br />\neight years of high school and col1/8 Pounds—Grauer by default<br />\ndual meets, Bernie was undelegiate<br />\n126 Pounds—Rosenstein over Rouse<br />\nbroad jump . . . (2) He avin<br />\nfeated<br />\nwith bar and half-nelson-7m. 38s.<br />\nevents per meet throughsix<br />\neraged<br />\n135 Pounds—Gelber and Foremen<br />\ncareer . . . Competed in every<br />\nout<br />\n(Md.) drew.<br />\ntrack event except pole vault and<br />\n145 Pounds—Edwards threw Brady.<br />\ndouble bar-45s.<br />\n155 Pounds—McDaniel threw Edwards (Md.), crotch and halfnelson-6m. 46s.<br />\n165 Pounds—Dippel (Md.) defeated<br />\nClautice by time advantage of<br />\n5m. 55s.<br />\n175 Pounds—Barnett defeated Jones<br />\nby time advantage of 5m. 31s.<br />\nHeavyweight—Males (Md.) threw<br />\nLamble with double arm lack--7m. 38s.<br />\nN. B.—All Hopkins men won unless<br />\notherwise noted.<br />\n<br />\nW<br />\n<br />\nS. P. E., 29; Alpha Delta Phi, 5<br />\nD. U., 29; 0. K. 0., 14<br />\nPhi Gamma Delta, 21; Delta Phi, 9<br />\nPhi Sigma Delta, 9; T. A. 0., 4<br />\nPhi Lambda Phi, 21; Phi Kappa<br />\nPsi, 7<br />\nBeta Theta Pi won by forfeit from<br />\nTau Alpha Phi<br />\nKappa Alpha, 13; A. T. 0., 9<br />\nVOLLEYBALL RESULTS:<br />\nS. P. E., 15; Alpha Delta Phi, 7<br />\nD. U., 15; 0. K. 0., 11<br />\nDelta Phi, 15; Phi Gamma Delta 10<br />\nT. A. 0., 15; Phi Sigma Delta, 11<br />\nPhi Lambda Phi, 15; Phi Kappa<br />\nPsi, 0<br />\nBeta Theta Pi, 15; T. A. Phi, 0<br />\n(forfeit)<br />\nA. T. 0.0.5; Kappa Alpha, 6.<br />\ntwo-mile . . . Specialty is broad jump.<br />\nTook fourth place in Intercollegiates<br />\nbroad jump last winter . . . So far<br />\nhas bettered Hopkins broad jump and<br />\njevelin records . . . Recipient of the<br />\nRhodes Scholarship for '36 . . .<br />\nBernie's the nearest thing to perfect yet.<br />\n<br />\nHERE'S THE BOWL, AND<br />\n<br />\nDUKE<br />\n<br />\nUNIVERSITY<br />\n<br />\nDURHAM, N. C.<br />\nFour terms of eleven weeks are given<br />\neach year. These may be taken consecutively (graduation in three years)<br />\nor three terms may be taken each year<br />\n(graduation M four years). The entrance requirements are intelligence,<br />\ncharacter and at least two years of<br />\ncollege work, including the subjects<br />\nspecified for Grade A Medical Schools.<br />\nCatalogues and application forms may<br />\nbe obtained from the Dean<br />\n<br />\n98e<br />\n<br />\nHERE'S THE FILTER THAT<br />\nMAKE THE IMPORTED BRITISH<br />\n<br />\nBUTTNER<br />\n<br />\nTHE COOLEST,<br />\nSWEETEST<br />\n<br />\nSCHOOL OF MEDICINE<br />\n<br />\nLost, Strayed, Or Stolen<br />\n<br />\nY owsah, folks, an athlete, scholar,<br />\nand prince, if there ever was one- -<br />\n<br />\nINTER-FRATERNITY BASKETBALL RESULTS:<br />\n<br />\nMail orders<br />\nfilled or call<br />\nCalvert1166<br />\n<br />\nPIPE SMOKE YOU EVER HAD.<br />\n<br />\n7<br />\n<br />\nC<br />\n<br />\nCigar, Cigarette and<br />\nPipe Smokers all say<br />\nthat a \"Buttner<br />\nSmoke S' gives the<br />\ngreatest enjoyment<br />\nof any. Try it today.<br />\nPricewith extra filters<br />\n<br />\nPipe Shop,<br />\nFirst Floor<br />\n<br />\nHOCIIISCIHRLD,KOIHIN 4,V CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "iqopkins Nrius-Kettrr<br /><br />\nMember Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br /><br />\nOlynthus His Topic<br /><br />\nHOPKINS QUINTET<br />\nRALLY DEFEATS<br />\nSt JOHN'S SQUAD<br /><br />\nON PAGE 3<br />\nPrice Five Cents<br /><br />\nHOME WOOD, BALTIMORE, MD., WEDNESDAY, JANUARY 15, 1936<br /><br />\nVol XL—No. 24.<br /><br />\nEXAM SCHEDULE<br /><br />\nASSEMBLY TO HEAR TOYOHIKO KAGAWA Barnstormers Elect<br />\nDR. D. M. ROBINSON TO ADDRESS SUPPER<br />\nIn<br />\nSPEAK ON OLYNTHUS CLUB TUESDAY NGIHT Levine President<br /><br />\nStorm Of Defiances<br /><br />\nIs At Present Working On Japanese Author Will Speak<br />\nAt University Lecture<br />\nBook Dealing With Old<br />\nSeries Afterwards<br />\nGreek Art<br />\nElection Climaxed Political Jockeying Of Some Time;<br />\n0. D. K. Fraternity Is Accused Of Trying To<br />\nArchaeologist Has Led Two \"World's Foremost ChrisControl The ,Voting<br />\ntian\" Is Philanthropist<br />\nExpeditions To ExcaAnd Churchman<br />\nvate In Greece<br /><br />\nJohnnies Conquered By 31-29<br />\nScore After Loss Of<br />\nTwo Players<br /><br />\nJohn limes Made Secretary-Treasurer<br /><br />\nGenerally titled as the \"foremost<br />\nChristian of the world,\" Dr. Toyohiko Clark Ewings Gets Position Of Business Manager; Lester<br />\nor of art and archaeology at the Johns<br />\nKagawa, renowned Japanese author,<br />\nCaplan Becomes The Production Manager;<br />\nHopkins Uniersity will delivem his philanthropist, churchman, and lec-Watkins Withdraws<br />\nannual lecture to the University turer, will be the speaker at the next<br />\nHarry Woodrow Sinks DeSupper<br />\nUniversity<br />\nthe<br />\nof<br />\nmeeting<br />\nstudent body tomorrow morning at<br />\nAt approximately four-thirty yesterciding Goal In Last<br />\nClub, to be held next Tuesday, Janu11.30 ,in Latrobe Hall. Dr. Robinson<br />\nafternoon Martie Levine defeated<br />\nday<br />\nLevering<br />\nin<br />\nm.,<br />\np.<br />\n6:30<br />\nat<br />\nary 21,<br />\nSeconds<br />\nwill speak on \"Olynthus\", and will<br />\nJerry Branover for the presidency of<br />\nDR. DAVID M. ROBINSON<br />\nHall. Following his address there he<br />\nthe Barnstormers; and, immediately<br />\nillustrate his lecture with slides of will proceed to the Lyric Theater,<br />\nBy MARTIN KRIEGER<br />\nafterwards, there burst over the<br />\nin the<br />\nanother<br />\ndeliver<br />\nexcavation.<br />\nthe<br />\nwill<br />\nhe<br />\nwhere<br />\nLast night a .thousand spectators<br />\ndome of the Barn, such a<br />\nshingled<br />\nDr. Robinson, while on a recent series of University Lectures on rewere given a thrill when they saw<br />\nprotests and recriminations<br />\nof<br />\nstorm<br />\nmoved<br />\nwas<br />\nevent<br />\nDr. Charles Edmunds, Po- as that temple<br />\nlecture tour, pronounced as forgeries, ligious topics. This<br />\nthe Hopkins basketers rally to conof the arts has never<br />\nFirst<br />\nthe<br />\nlocation,<br />\nits<br />\nordinary<br />\nfrom<br />\nquer the St. John's quintet in a hardTo<br />\nHead,<br />\nseveral pieces of supposedly authenCollege<br />\nmona<br />\nclimaxed a week<br />\nelection<br />\nThe<br />\nseen.<br />\nMethodist Episcopal Church, because<br />\nfought and earned victory in baskettic pottery in the Pittsburgh mu- of the extraordinary demand for tickor more of political jockeying, durMonday<br />\nLecture<br />\nball at the Homewood gym.<br />\ning which, it is charged, on one side<br />\nFormer Financial Director seum. He has conducted two expe- ets. However, three hundred pasteIn the last six minutes of playing<br />\nthat \"an unholy alliance ganged up\"<br />\nJohns<br />\nthe<br />\nof<br />\nprovost<br />\nformer<br />\nA<br />\nditions to Olynthus, and is noted for boards, available to students of the<br />\nOf League Of Nations;<br />\ntime victory seemed assured for the<br />\nBranover and on the other that<br />\non<br />\nhis scholarly works on art and arch- Hopkins, are on sale at the Y. M. C. Hopkins will return to the srene of<br />\nThey were leading the<br />\nJohnnies.<br />\nDelta Kappa had attempted<br />\nOmicron<br />\nIs Also An M. P.<br />\nA. office in Levering Hall.<br />\nhis undergraduate, graduate, teach- to control the voting.<br />\nHe is well known in the<br />\naeology.<br />\nJays 25 to 21—a narrow margin,<br />\nBorn forty-seven years ago in Kobe, ing, and administrative work when<br />\nwhich they held throughout the earSir Herbert Brown Ames will de- writing field, contributing frequently<br />\nThe other results were less exJapan, Dr. Kagawa was orphaned at<br />\nlier part of the game. In these last liver the George Huntington WilDr. Charles K. Edmunds, nom pres- citing. John Himes, a member of the<br />\nto magazines of a scientific nature.<br />\nfour. He was educated in his more<br />\nfew minutes Hopkins pushed ahead. liams Memorial lecture tadoy, JanKappi Psi,<br />\nHis latest writings appeared a month tender years at a Buddhist temple. ident of Pomona College, delivers an lacrosse team and Phi<br />\nThen in the next two minutes St. uary 15, at 5 p. m., in the Lecture<br />\nbecome secreto<br />\nBranover,<br />\ndefeated<br />\non \"Flying Over<br />\nJohn's tied the score. With 21 seconds Room at Latrobe Hall. He has chosen ago, in the German magazine, At fourteen he came under the influ- illustrated lecture<br />\nwhich, by<br />\n20, tary-treasurer, an office<br />\nto play, Harry Woodrow shot the as his subject, \"The Countries of Die Antike. The topic of the article, ence of an English missionary and the Andes\", this Monday, January<br />\nconstituthe<br />\nin<br />\nchange<br />\na<br />\nof<br />\nvirtue<br />\nhad his Confucian precepts blended at 5 p. m., in Latrobe Hall. This talk<br />\ndeciding goal, thus ending the game<br />\nwas Excavations at Olynthus.<br />\ntakes presedence over the<br />\nnow<br />\ntion,<br />\nCentral Europe.\"<br />\nwith the doctrines of Christ. Without is open to the public.<br />\nwith Hopkins triumphant.<br />\nOn Academic Council<br />\nBusiness manager. Clark Ewing, a<br />\nSir Herbert, is a Canadian being<br />\nBorn in Baltimore during the same<br />\nthe knowledge of his family he emSt. John's Men Ejected<br />\nSig Ep, bested Bill McFeely for this<br />\nseveral<br />\nJune<br />\n27,<br />\nconducting<br />\nto<br />\naddition<br />\n1863.<br />\nIn<br />\non<br />\nMontreal<br />\nin<br />\nborn<br />\nbraced the new religion by baptism year that the Hopkins was founded,<br />\nThe ejection of two St. John's men, He received his education at AmCaplan became<br />\nat the University, Professor and was soon teaching a Sunday 1876, Dr. Edmunds attended this position, while Lester<br />\ncourses<br />\nLambros and Korgle, in the final herst College and received his Docproduction manager without opposithrilling period of play because of tor of Law degree from there. In Robinson is a member of the aca- school class. When his relatives University to redeive his A.B. de- tion.<br />\ndemic council. He received the post learned this, he was disinherited and gree. In 1895 he was a prize essaypersonal fouls was probably the facThe attacks on O.D.K. mainly cen1915, Sir Herbert, was knighted by<br />\ntor which caused the collapse of all the<br />\nsucceeding Professor Tenny Frank, put out of the house. This was a se- ist, and from 1897 to 1898 he was a tererd around the withdrawal of Bob<br />\ncrown.<br />\nvere blow to family prestige, as Dr. University sdholar. He was appointthe Johnnies' aims and hopes.<br />\nwhose ter mexpired in October.<br />\nWatkins, a pre-election favorite, from<br />\nMember Of Parliament<br />\nKagawa's father had come from a ed as adting professor of physids at<br />\nSt. John's drew first blood at the<br />\nfigure<br />\na<br />\nPresidential lists. In some qdarbeen<br />\nthe<br />\nSir Herbert has long<br />\nDr. Robinson is looked upon as one<br />\nvery rich family and had himself the University of Utah from 1898 to<br />\nonset of the game when Lambros fed<br />\nters it was openly charged that his<br />\nin the public eye. At the age of 31, of the outstanding authorities on<br />\nformerly been Secretary to the Privy 1899.<br />\nthe fast-stepping Ross a perfect pass<br />\nsudden retirement was part of an athe was elected to membership in the<br />\nancient Greek art in the country to- Council of the Emperor.<br />\nwhich went for an equally perfect<br />\nAs a magnetic observer, Dr. Ed- tempt to clear the path for BranoHouse of Commons in Montreal. He<br />\nshot. Siegel netted the rebound of his<br />\nHad Hard Knocks<br />\nmunds aided in making the U. S. ver's election. Watkins pleaded the<br />\nserved in this position from 1904- day. A review of his achievements<br />\nown long try at the basket, to tie the<br />\nA period of hard knocks followed. Coast and Geological Survey from pressure of other activities as a rea1921, a period of seventeen years, were printed early last October in<br />\nscore. From this time until the draKagawa entered and studied for two 1899 to 1900. From 1900 to 1901 he son for his refusal.<br />\nhe was President of Volunteer Elec- the Sunday American Magazine.<br />\nmatic finale, neither team held a<br />\nyears at the Kobe Theological Sem- was an instructor in physics in Washof<br />\ntoral League, and was chairman<br />\n\"O.D.K. is fooling no one,\" a bitter<br />\nAt present, he is hard at work on<br />\ngreater margin than four points. The<br />\ninary. A few years later he was liv- ington and Columbian University. member of the opposition, said im'the Select Standing Committee on<br />\na book on Greek Art, which he hopes ing amongst the poor of the slums.<br />\nJohnnies gained a small advantage<br />\nWhile general secretary for the Hop- mediately after the election. \"We all<br />\n1917, Sir Herbert was honored by<br />\nof 7-4 but the Jays tied it at 9-all.<br />\nBanking and Commerce in 1910. In to have completed in time to be He had a disciple, a skin-and-bones kins Y. M. C. A., Dr. Edmunds was a know that Watkins only acted on<br />\nThe lead wavered between the teams<br />\nbeing appointed chairman of a Spec- shown at the Commemoration Day rice-gatherer, and his policy of non- fellow in physics from 1902 to 1903. orders. If O.D.K. thought it could inuntil at half time St. John's was in<br />\nresistance cost him his front teeth.<br />\nWas Physics Professor<br />\nial Committee of the House of Com- activities, February 22.<br />\nject politics into the Barnstormers<br />\nthe lead, 15-14.<br />\nFor that reason, his enunciation is<br />\nmons, on the care and treatment of<br />\nHe was profesor of physics and it's certainly disillusioned now.\"<br />\nJohnnies Set Pace<br />\nnot all that it might be, on account of electrical engineering in 1903.<br />\nrecalled soldiers.<br />\nThis idyllic picture of the BarnDuring the second half the St.<br />\nSpeak<br />\nTo<br />\na four-gold tooth job done by a midFinancial Expert<br />\nPsychologist<br />\nDr. Edmunds has been American stormers as a united front against<br />\nthe<br />\nas<br />\ncontinued<br />\naggregation<br />\nJohn's<br />\n(Continued on Page 3, Cioi 1)<br />\nNo doubt, the position of Finandirector of the Canton Christian Col- invasion was not entireiy ln keeping<br />\nOn War Here Tonight<br />\npace setter, with leads varying from<br />\nlege since 1926. While provost at the with that conceived by the Branower<br />\ncial Director of the League of NaThe<br />\nadvantage<br />\npoints.<br />\nfour<br />\none to<br />\nHopkins from 1924 to 1927, he was camp.<br />\npost he held from 1919<br />\nProfessor H. Knight Dunlap will Cotillion Board To Hold<br />\nwas held until with ten minutes of tions, which<br />\ninternaalumni director.<br />\nfor<br />\nalso<br />\nto<br />\nresponsible<br />\n1926,<br />\nwas<br />\nsina<br />\nshot<br />\nlecture on the subject of \"War As<br />\nvote today reflects the work<br />\nplaying time left, Melvin<br />\nDance Saturday Night He is a member of a number of \"The<br />\nto his<br />\nindividuals who have been<br />\nfew<br />\na<br />\nof<br />\ngle foul to tie the score at 20-all. tional recognition being given<br />\nViewed by a Psychologist\" tonight at<br />\nscientific societies, among them the \"ganging up\" on Jerry since last<br />\nKrogle placed the Johnnies in the ability as an authority on world fi- 8 p. m. in Room 117, Gilman Hall.<br />\nOn Saturday night, January 18, the<br />\nPacific Geographical Society, of which Friday to fill the staff with their<br />\nlead again with free throws, but Les nancial and political problems.<br />\nCotillion Board will have its first<br />\nis<br />\nThis<br />\nprobably<br />\nthe<br />\nlast<br />\nappearance<br />\nDr. Edmunds is president. Phi Beta supporters. It is this pack from withKnight<br />\nSir Herbert is a member of<br />\nMargolis retaliated for the Jay quindance of the new year. They have<br />\nDr.<br />\non<br />\nDunlap<br />\nof<br />\nKappa and Phi Gamma Delta are his in rather than O.D.K. from without<br />\nof<br />\ncamthe<br />\nHopkins<br />\nHospital<br />\ntries.<br />\nthe<br />\nof<br />\nOrder<br />\nGrace,<br />\ntwo<br />\nof<br />\nin<br />\nfoul<br />\none<br />\ntet by making<br />\nengaged the Townsmen, Baltimore's<br />\ntwo fraternities. He is the author which is turning the club into a poSt. John of Jerusalem, as well as a pus before his departure for CaliforJays Take Time Out<br />\nleading orchestra, for the affair.<br />\nof a number of papers.<br />\nLambros,<br />\nRoss, on a pass from<br />\nlitical battlefield.\"<br />\nlecturer for the Carnegie Endow- nia.<br />\nThe dance will begin at nine p. rn<br />\nsank a basket and later repeated, to ment for International Peace.<br />\nFrom a prominent member of the<br />\nThis lecture will be delivered before and last until twelve. President Algive the Johnnies the advantage by<br />\ncommittee came a solemn<br />\nexecutive<br />\nthe course on war which is being- len Delevett said, \"We want to start<br />\na margin of 25 to 21. The Blue Jays<br />\nwhole affair is as dis\"The<br />\nwarning:<br />\nEv1936 off with a bang-up dance.<br />\nconducted under the joint leadership<br />\n(Continued on Page 3, Col. 6)<br />\ngraceful a sanything in my memory.<br />\nerybody is urged to come and is asof Professor Lovejoy and Dr. Hart. sured a good time.\" The price of adThe range of the little man who 'on])'<br />\nAll members of the University are mission will be one dollar stag or Levering Hall To Be The Scene wants one activity' is getting narrower. If the Barnstormers repeat<br />\ndrag.<br />\ncordially invited to attend.<br />\nOf Monthly Gathering Next<br />\nthis performance, I would strongly<br />\nFriday Night<br />\nA concert by the Johns Hopkins<br />\nrecommend a sharp curtailment of<br />\nMusical Club was given at the MaryThe fourth Faculty and Graduate their activities.\"<br />\nSherwood Anderson To See J. H.<br />\nland College for Women, in Towson<br />\nIn the meanwhile the various cenDance will be held in LeverStudent<br />\nU. Playshop Produce His<br />\nMd. on Friday January 10. The coning Hall Friday evening, from 9 to ters of the storm were riding it out<br />\nPlay, \"Mother\"<br />\n1. Ed Norwood's Continentals, who in grim silence. Levinne preferred to<br />\ncert was followed by a dance in a<br />\nplayed at the last dance of this se- wait deelopments before committing<br />\nThis Saturday evening at 8:30 p. hall immediately behind the college<br />\nSomewhere in this small world of by virtue of her having hinted in her<br />\nries, will again provide the music. himself, while Dave Levy, president<br />\nme the long-awaited arrival of Sher- chapel.<br />\nours, resides a person (a she person letter that our fair college is no<br />\nAdmission is one dollar, stag or of 0.D.K., could not be found for a<br />\nwood Anderson, one of America's<br />\nThe extra features of the concert to be more exact) whom we will re- longer in Baltimore, the J. H. U. has<br />\nstatement.<br />\ncouple.<br />\nleading literary lights to a Baltimore were an organ solo by Duncan Brown<br />\nfer to hereinafter as Miss Z. Well, to simply got to be in Cleveland, Ohio.<br />\nlecture platform will take place in and a special arrangement of the popThe<br />\nComSocial<br />\nGraduate<br />\nStudent<br />\nmake a long story more disgusting, Also she has upset and made agog<br />\nLatrobe Hall. Mr. Anderson, whose ular song. \"The Music Goes Round<br />\nthis hunk of femininity writes letters. the Literati and intelligentsia of this mittee, which has charge of the<br />\nwritings are among the most widely and Round' presented impromptu by<br />\nUpon this fact alone we base two and many other nations by intimating monthly dances, is planning a special<br />\nread of the better American authors, the members of the Blue Jay Orchesdance,<br />\nbrilliant assumptions—first that she that Sir Willam Osler (celebrated celebration at the February<br />\nhas lately exhibited an interest in the tra.<br />\nThere<br />\nDay.<br />\nwhich<br />\non<br />\nValentine<br />\ncomes<br />\n\"Big<br />\nthe<br />\nof<br />\nvery<br />\nis<br />\nthat<br />\nsecond<br />\nshe<br />\nhead<br />\nand<br />\nand<br />\nmember<br />\nmedico<br />\ncan write<br />\ndrama and in the dramatizaation of<br />\nAn infected finger withheld Con- probably able to read!<br />\nFour,\" founders of the Hopkins Med- are rumors that there will be an un- Class Treasurer Says Figures Dehis work. His brilliant collection of<br />\nand a<br />\nrad Gebelein from active participapend On Payment Of PreOne of our brilliant NEWS-LETTER ical School) is no longer deceased, usual scheme of decoration,<br />\nstories, Winesburg, Ohio, has recenttion with the Banjo Club of which he colleagues has jokingly but truly said but liveth, that he was not a physi- special program will be featured.<br />\nvious Class Dues<br />\nwith<br />\nly been produced in play form<br />\nis the director. He did, however, per- of this female lunk-head--hereinafter cian, and that, on the contrary he is Other dances fall on March 13 and<br />\na large measure of success. Mr. An- form with the Hawaiian Troupe, play17th.<br />\nThe latest reports from the Senior<br />\nreferred to as Z party of Z first part a professor in the department of April<br />\nderson will explain this interest of ing only with three fingers.<br />\nSponsors invited for the dance Class officers and from John Murphy,<br />\n(heh! heh!)—that if brains was soap English literature at the Hopkins.<br />\nhis in the theatre in a topic entitled,<br />\nMiss Z wouldn't be able to lather a This whole stupid treatise boils down Friday night: Dr. R. B. Loucks, Dr. chairman of June Week, reveals that<br />\n\"The Writer and the Theatre.\"<br />\nto the fact that, not so very long ago and Mrs. E. B. Mathews, Dr. and the June Week program will, as usgnat.<br />\nAfter his address, the Playshop of<br />\ncase of Miss Z a letter arrived at the University on Mrs. D. R. McKee, Dr. E. T. Norris, ual, cost the graduating students<br />\nthe<br />\nIn<br />\ndiagnosing<br />\nthe Johns Hopkins University, under<br />\nwe have come to the conclusion that the envelope of which was written Dr. and Mrs. G. F. Otto, Dr. J. W. about $15 to $20 each.<br />\nwhose auspices Mr. Anderson is here,<br />\nAbe Edelman, class treasurer, said<br />\nPoultney, Dr. and Mrs. M. W. Puleither she is the innocent victim of the following phony address:<br />\nwill present a one-act play by the<br />\nprice of June Week would range<br />\nthe<br />\nG.<br />\nW.<br />\nand<br />\nlen,<br />\nMrs.<br />\nShaffer.<br />\nand<br />\nDr.<br />\nOsler,<br />\nWilliam<br />\nMr.<br />\nthe<br />\neffect<br />\nto<br />\nrumors<br />\n(ugly<br />\nrumors<br />\nStates<br />\nA report on the third United<br />\nlatter. This play, Mother, has never<br />\nbetween these figures, according to<br />\nof English Literature<br />\nProf.<br />\nUniversity<br />\nthe<br />\nHopkins<br />\nJohns<br />\nthat<br />\nFascism<br />\nand<br />\nWar<br />\nagainst<br />\nCongress<br />\nbeen produced before anywhere, and<br />\nwhether the individual members of<br />\nJohns Hopkins University,<br />\nHopkins is situated in Cleveland, Ohio) or that<br />\nits performance is therefore of great will be delivered by the two<br />\nSophs To Meet<br />\nthe class have paid their class dues<br />\nOhio.<br />\nCleveland,<br />\nwho<br />\nperson<br />\nvery<br />\negotistical<br />\na<br />\nis<br />\nshe<br />\nH.<br />\nand<br />\ninterest, especially to those inter- delegates—Russell Burghardt<br />\nin previous years.<br />\nOn the back of the envelope was<br />\nluncheon ain't had no schooling and has deThere will be a meeting of the<br />\nested in modern drama. The cast in- H Shapiro at the regular<br />\nMurphy expects to complete apEvin<br />\nsomewhere<br />\naddress<br />\nan<br />\nwritten<br />\nthe<br />\nremotest<br />\nhasn't<br />\nshe<br />\nif<br />\ncided<br />\nthat,<br />\nSophomore Class after the ascludes Mary Alvey, S. Vannort Chap- discusison meeting of the Hopkins<br />\npointments to his committee in the<br />\nthe<br />\nthis<br />\nabove<br />\nand<br />\nIndiana,<br />\nansville,<br />\nplace<br />\nits<br />\nhas<br />\nthe<br />\nHopkins<br />\nwhere<br />\nidea<br />\nLevin<br />\nm.<br />\np.<br />\n12:30<br />\nat<br />\nsembly tomorrow.<br />\nman and Kenneth Silver. Tickets for chapter today<br />\nnear future, after which plans will<br />\nof residence and if it tickles her name, Miss — (no, we must continue<br />\nFRANK CRIST„<br />\nboth the play and the lecture may be ering Hall.<br />\nget<br />\nunder way for the seniors' spring<br />\nas<br />\nperson<br />\nmysterious<br />\nthis<br />\nto<br />\nrefer<br />\nto<br />\nUnivergood<br />\nol'<br />\nthis<br />\nto<br />\nplace<br />\nfancy<br />\nthe<br />\nLuncheon 'will be served for<br />\nSecretary.<br />\nobtained at the reading room desk<br />\nevents.<br />\nZ.)<br />\nMiss<br />\nmerely<br />\nOhio,<br />\nthen,<br />\nCleveland,<br />\nsity<br />\nin<br />\ncents.<br />\nthirty-five<br />\nof<br />\nnominal fee<br />\nin the library for 50 cents.<br /><br />\nFANS WITNESS A<br />\nTHRILLING TILT<br /><br />\nDr. David Moore Robinson, Profes-<br /><br />\nH. B. AMES TO SPEAK<br />\nON \"CENTRAL EUROPE\"<br /><br />\nHOPMNS EX-PROVOST<br />\nTO SPEAK ON ANDES<br /><br />\nED. NOR WOOD TO PLAY<br />\nAT FACULTY-GRAD DANCE<br /><br />\nCOLLEGE FOR WOMEN<br />\nRENOWNED PLAYWRIGHT HEARS MUSICAL CLUB<br /><br />\nTO SPEAK SATURDAY<br /><br />\nlVIissZ Writes Letter To William<br />\nOsier, English Literature Prof<br /><br />\nJUNE WEEK TO COST<br />\nBETWEEN $15 &amp; $16<br /><br />\nANTI-WAR LEAGUE TO HEAR<br />\nREPORTS ON CONVENTION<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 15, 1936<br /><br />\nMbc Rms./Letter<br /><br />\nQUAD QUIPS<br /><br />\nIntercollegiates<br /><br />\nON THE BOOK HORIZON<br /><br />\nFounded 1897<br />\nBy JACK STEIN<br />\nMiami appears to be the hangout for Hopkins students over their Christmas vacation. I met Eddie Abrams, and Arthur Gordon at a dance down there, and<br />\nI understand that here were some there that I didn't<br />\nsee. The only solution to the question as to why so<br />\nmany students go there, lies in the fact that beautiful<br />\nwomen are so much in evidence down here. If you<br />\ndon't believe it, just see any current newsreel.<br />\n*<br />\n*<br />\n*<br /><br />\nIn a recent issue of the Richmond OLD JULES, by Mari Sandros. Lit- the storms, the wind and isolation.<br />\nCollegian, the letters-to-the-editor<br />\nBrown and Company. 1935. $3.00. But the most impressive stories were<br />\ncolumn was headed \"Forum, or agin<br />\npp. 424.<br />\nthose told me by Old Jules himself,<br />\n'em.\"<br />\n\"You know, I consider artists and perhaps on the top of Indian Hill,<br />\nRemit subscription fees to Treasurer, Student Acwriters the maggots of society,\" overlooking the spot where he helped<br />\ntivities Council, Remsen Hall, Postoffice, Johns Hopwrote Jules Sandros to his daughter hang a man. Perhaps he limped<br />\nkins University.<br />\nThe Swarthmore Phoenix is very Mari, when he was told that she had<br />\nthrough the orchard as he talked,<br />\nworried. No wonder. Listen to their been awarded an honorable mention<br />\nEntered as second-class matter December 3, 1909,<br />\nwith me close behind, my hand full<br />\ntrouble:<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\nin the Harper's Intercollegiate Con- of ducks or grouse or quail . . . and<br />\n\"We wonder what this collitch is test.<br />\nCongress, November 3, 1879.<br />\nalways I was too frightened of him<br />\nOn point that I noticed in the letter which the coming to when a female who manOne cannot but wonder whether he to voice either approval or surprise.\"<br />\nPublished semi-weekly from October to June, exStudent Council sent to the NEWS-LETTER in regard to aged to get her feet wet removes her would have held the same opinion<br />\n* * *<br />\ncept during examination and college holiday periods<br />\nassemblies, tickled my dubious sense of humor. In one shoes and socks in the library and al- when, ten years later, her story of<br />\nAN AUTHOR LOOKS AT WIWI<br />\nby undergraduates of the Johns Hopkins University.<br />\nparagraph they state, The ultimate penalty for absence lows her tootsies to adorn the top of hir, life was awarded the Atlantic<br />\nHUNGARIAN THEATRE<br />\na library table.\"<br />\nwill be indefinite suspension from the University.<br />\nNon-Fiction prize of $5,000. But more<br />\nEDITORIAL DEPARTMENT<br />\nA. E. Wilson is a dramatic critic<br />\nPreceeding this paragraph is a list of rules and reg*<br />\nthan likely he would have changed of the<br />\nKenneth Zierler<br />\nEditor-in-Chief<br />\nLondon Star and the author of<br />\nulations having to do with the fool-proof system of<br />\nLrvizg Leberfeld<br />\nThe law students of the University his mind, for this was quite a differ- King Panto, the History of PantoManaging Editor<br />\ntaking attendance.<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nof Texas do not wear a cap and gown ent matter. In Old Jules, his daugh- mime, which E. P. Dutton and ComThe last paragraph of the letter asks for our coAssistant Managing Editors<br />\nat graduation, but they put a sun- ter, who was closest to him and yet pany published recently. He reports<br />\noperation. I think it was damned decent of them to<br />\nDavid Caplan, Bernard D. Pinck,<br />\nflower in their lapel, instead. This most afraid of him, had set down that he has just returned from a holask for our cooperation.<br />\nSports Editors<br />\ncustom dates back to the '90s, when tfne record of his struggles as a pio- iday trip to Budapest where he went<br />\n*<br />\n*<br />\nEdgar Kemler<br />\nMagazine Editor<br />\na professor of law suggested that neer, and a builder of communities. \"to get a glimpse of the native draCONGRATULATIONS!<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\n\"just as the sunflower . . . turns its For \"Old Jules\" was, above all things, ma.\" He was not exactly lucky, he<br />\nTo Bernard Lewis, biology instructor who was the<br />\nColumnists<br />\nhead toward the sun, so we want our a supreme egotist—with that fanat- says, as he found only one theatre<br />\nJesse N. Borden<br />\nAdvisory Editor<br />\nonly person connected with this University to be awardlawyers to turn to the light and to ical egotism that is born of the con- cpen during his visit—the summer<br />\nEDITORIAL STAFF<br />\ned a Rhodes Scholarship this year.<br />\nbring justice to all people every- sciousness of a mission.<br />\ntheatre on St. Margaret Island where<br />\n*<br />\n*<br />\n*<br />\nSigmund Safier, Max Lskowitz, Nathaniel FinkOld Jules is the biography of an<br />\nwhere.\"<br />\nthey put on a revival of Wunder Bar.<br />\nelstein, Murray Kempton, Wethered Barro11, Jr.,<br />\nSince the New Deal and its \"Professors\" seem to be<br />\nAmerican by choice. Jules Sandros,<br />\n*<br />\n*<br />\n*<br />\n\"My impressions of Magyar drama<br />\nIsadore Gertman, Jewett Goldsmith, Leonard<br />\ngetting one long beautiful sleigh ride down, this letter<br />\nthe son of a Swiss veterinary, was<br />\nJaffe, Red Glantz, Lester Caplan, Howard ReizSixty co-eds at Iowa State Univer- being educated to join the medical in the original- are therefore limited<br />\nwill probably not hurt their feelings. The following<br />\nenstain, Julian Adler.<br />\nletter was received by the Bureau of Home Economics, sity were bedridden recently after profession, when, after a sudden rift though enjoyable,\" he says. \"But I<br />\nsampling some of the \"food\" they had with his father, he decided to come WP S certainly rewarded by seeing one<br />\nof the Department of Agriculture:<br />\nBUSINESS DEPARTMENT<br />\ncooked in the home economics class. to America. So he left the blue wa- of the most beautiful women I have<br />\nDanville, Indiana<br />\nDavid H. Levy<br />\nBusiness Manager<br />\never seen in Ilona Titkos, who is one<br />\n*<br />\n*<br />\nSept.<br />\n7,<br />\n19<br />\nters of Lake Neuchatel, crossed the<br />\nRobert Watkins;<br />\nAdvertising Manager<br />\nof the leading actresses of Budapest<br />\nBureau<br />\nof<br />\nHome<br />\nEconomies<br />\nocean;<br />\nand<br />\nwith<br />\nno<br />\nother<br />\nRobert Levi<br />\nassets but<br />\nThe ticket director of the Ohio<br />\nCirculation Manager<br />\nand by the extraordinary hospitality<br />\nU. S. Department of Agriculture<br />\nWilliam. B. Kempton<br />\nOffice Manager<br />\nState University says that he re- twenty dollars, a stamp collection, a<br />\nof Hungarian journalists and the<br />\nMelville Locker<br />\nDear Uncle Sam:<br />\nCopy and Filing Manager<br />\nquires a staff of 2,500 persons at ev- Swiss army rifle, and a spade, he<br />\nHungarian people generally. When I<br />\nPlease tell if vitamins A B and C are real things or ery big football game.<br />\ntravelled as far west as he could and<br />\nvisited a smart cabaret in Buda the<br />\nBUSINESS STAFF<br />\njust hypothetical substances like members of the Holy<br />\n* * *<br />\nfinally filed on a homestead in northS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\nrtoprietor, apprised of my presence,<br />\nTrinity.<br />\neastern Nebraska.<br />\nN. Soifer, S. Tinley<br />\nThe Saturday Evening Post is the<br />\nactually stopped the floor show in<br />\nDon't refer this to just any school boy, but have it<br />\nFor fifteen years his life was one<br />\nfirst choice in the magazine field of<br />\npresence of `Mr. Winston (sic) in<br />\nanswered by a guy who is the real cheese in this line.<br />\nlong, hard struggle. In his determiWednesday, January 15, 1936<br />\nthe students at Harvard. Next in<br />\norder to announce to the assembly the<br />\nMRS. ANDREW P<br />\nnation to found a community in the<br />\nrank are Time, Collier's Reader's Dic,•!lebrated dramatic critic from Lon*<br />\n*<br />\n*<br />\nsandhills of the region, Old Jules<br />\ndon!'<br />\nA new affiliation has hit the major part of the Soph- gest, Esquire, and New Yorker.<br />\nran against the interests first of the<br />\n*<br />\n\"The audience cheered like mad,<br />\nomore student body. Just as everyone was about to<br />\ncattlemen and later of the sheepmen.<br />\nWe know Marty Levine and think he's a very fine breathe easier over the thought that their English<br />\nFor the first time in 11 years a With gun in hand he was forced to the gypsy band played 'Smoke Gets<br />\nfellow, but we don't imagine that, up until a week or paper, and their History paper, were almost finished, woman entered the varsity football<br />\nprotect his rights and those of the in your eyes'—presumably under the<br />\nso ago, he ever saw himself as president of the Barn- they were told of a new animal, an Economics paper. dressing room at Minnesota Univernumerous settlers whom he helped in impression that that is the English<br />\nstormers. With the somewhat general knowledge of This was no small animal, either. From three to five sity when a co-ed reporter was perestablishing themselves. Jules was a national air—and I was photographed<br />\nthe individual merits of the case that we have, we'd say thousand words was the size. That, my friends, is one mitted entrance recently to get a<br />\nhard man—brutal—masculine clean in three different attitudes for the ilthat Gerald Branower would seem to have been a more<br />\nof a lot of words.<br />\ncolor story for the school paper.<br />\nthrough. These years saw him ar- lustrated press. I'm afraid we don't<br />\nnatural choice for the job.<br />\n*<br />\n*<br />\n*<br />\n* * *<br />\nrested several times, for incendiar- make so much fuss in London over<br />\nBranower's trouble was that he was an 0. D. K., and<br />\nThe following is in memoriam to a blind date arism,<br />\nand on suspicion of murder the visit of Hungarian dramatic critStudents at Colgate have been<br />\n0. D. K., like some other social fraternities, tried to ranged by telephone:<br />\namong<br />\nother things, not to mention ics.\"<br />\nasked to register any firearms which<br />\n*<br />\nrun things. They wanted Brother Branower to have a<br />\nHer laugh was very pretty<br />\nthree divorces.<br />\nthey keep in their rooms.<br />\nmajor office so they could give excuse for having iniHer diction was divine—<br />\nE. P. Dutton and Company will<br />\nMiss Sandros, in explaining how<br />\n*<br />\n*<br />\n*<br />\ntiated him. In order to do this they induced Brother<br />\nSo how the heck was I to know<br />\nshe came to write the biography of publish next month In Quest of Lost<br />\nAn Eastern women's college com0. D. K. Bob Watkins to decline the nomination for the<br />\nTha t she looked like Gertrude Stein.<br />\nher father, says that \"it grew out of Worlds. The author, Count Byron<br />\npiled a report saying that men get<br />\npresidency. It was generally believed that the two can*<br />\n*<br />\n*<br />\nthe long hours in the smoky old kit- de Prorok, is a brilliant young andidates would be Brother Branower and Brother WatI witnessed a strange phenomena coming to Balti- angry on an average of six times a chen on the Running Water, the si- thropologist and a member of the<br />\nkins.<br />\nmore on the train from New York, following a recent week while women get angry only lent hours of listening behind the Royal Geographical Society. In trailThe Barnstormers are a spirited bunch. They re- vacation.<br />\nhalf as many times. A men's college<br />\nstove or the wood box, when it was ing the path of Alexander to Jupiter<br />\nsented 0. D. K.'s attempt to \"fix\" things. They decided<br />\nThe train was the 6:30 out of Pennsy, a popular came back with, \"True enough, but assumed that I was in bed. So it Ammon and in exploring the wilds of<br />\nto fight politics with politics. Therefore, we have Marty Hopkins train. True to custom,<br />\nHopkins was very well who makes us mad?\"<br />\nwas that I heard the accounts of the Central America, Count Prorok has<br />\nLevine president on an anti-O. D. K. vote.<br />\n*<br />\n*<br />\n*<br />\nrepresented. Goucher had a number of very nice girls<br />\nhunts, of the well accident, of the uncovered a great amount of new<br />\nIt's another indication of 0. D. K.'s ranking on this<br />\non the train. Bernie Pinck, whose Mother thoughtfully<br />\nTwo Michigan co-eds pawned their fights with cattlemen and the sheep- facts concerning sexual cults, jungle<br />\ncampus. The boys have been indicted again!<br />\nsent along a bag of sandwiches with him (he lives in violins in order to buy a ticket to the men, of the tragic scarcity of women, fires, harems, Lancadon pygmies who<br />\nthe Dorms) was very busy trying to make an impres- last Michigan football game of the when a man had to \"marry anything eat clay, blood-drinkers and sacrifision on ye Goucher Gals. So Bernie straightened his season.<br />\nthat got off the train,\" of the drouths, cial raping of virgins.<br />\nnecktie, plunked his bag of food on the seat, and walked<br />\n*<br />\n*<br />\nAs a general rule we oppose steamroller education. over to the women. Immediately three or four (Dorm)<br />\nAd in the Syraeuse Daily Orange:<br />\nPeople don't learn against their will. Sometimes, though, students made a dive for the bag. Three sandwiches<br />\n\"A prayer book was found at the<br />\nthey need a shove—something to overcome their iner- gone. When Mr. Pinck returned and discovered his<br />\ntia. Therefore, we favor compulsory assembly attend- loss, he pleaded with the fellows not to take any more, freshman dance. Owner nif.y have<br />\nsame by calling at the Administraance for the underclassmen.<br />\nKRA_MPUS GENERALS<br />\nBy HAROLD M. KROPMAN<br />\nThe Student Council's and then went back to Goucher.<br />\ntion Building.\"<br />\nplan for checking attendance seems to be necessary if<br />\nJOHN MYERS—now in charge of the<br />\nPUBLIC NOTICE:<br />\n'Twas not very long before Goucher was surrounded<br />\ncompulsory attendance is to be anything but a farce.<br />\nby Hopkins. This is the phenomena. I don't believe that<br />\nWill \"California\" Jean, \"Kitty\" Post Office. Here is a man who has<br />\nBy emphasizing the wrong element, however, the since the days of Daniel Gilman, have Hopkins<br />\nfellows<br />\nStrange, and \"Killer\" Hutch please seen them come and go at this UniStudent Council has apparently given a bad reason for been attracted by Goucher<br />\nGals.<br />\ntake notice of the change in sched- versity. In 1891 he was first cona good thing. Elsewhere on this page, a letter to the<br />\nWhile on the subject of Goucher, it may be interestule of the appearance of the NEWS- nected with the University in the<br />\neditor calls attention to the Council's error in wanting ing to<br />\nprint a notice which appeared a short while ago<br />\nLETTER.<br />\nThe weekly Wednesday physics laboratory under Dr. Rowto compel attendance because a speaker \"feels a bit in<br />\na national college magazine. For the past ten years, To the Editor of the NEWS-LETTER<br />\nnight meetings will probably now be<br />\nchagrined at the small audience.\" It is true that he will<br />\nonly 30 per cent of Goucher graduates have married!<br />\nland, who was then head of the deDear Sir:<br />\nheld on Monday night. I hope you<br />\nnot be complimented by a drafted audience.<br />\n*<br />\n*<br />\ng.<br />\nNow, although everybody knows that the NEWSThe Student Government's letter find this convenient. I presume I am partment. In 1921 he was appointMilton Tuerk, and Joe Skyer, both lived in the<br />\nLETTER doesn't like to hurt anybody's feelings, we don't<br />\nconcerning compulsory attendance at saying the right thing, although ed secretary of Student Activity<br />\nDorms last year, occupying a suite of rooms. Feeling<br />\nsometimes I have to convince the Council, which position he held until<br />\nthink that the speakers' disappointment should guide<br />\nassemblies certainly is weak.<br />\nthe need for comfort, they purchased some second<br />\nparty in question.<br />\nour decision in forcing attendance. Inasmuch as the<br />\n1934. He is a holder of the Varsity<br />\nthe<br />\nIf<br />\nthe<br />\nspeaker<br />\nis<br />\n\"chagrined<br />\nat<br />\nhand easy chairs. When the term ended, instead of<br />\nassemblies are for the students, it seems to us that it is<br />\nOh, pardon me. I thought you all Seal, the Barnstormer<br />\nam<br />\nI<br />\npresence<br />\nof<br />\nsmall<br />\naudience,<br />\na<br />\ncharm, the<br />\nselling the chairs, they figured it would be cheaper to<br />\ntheir interests that are to be considered.<br />\nsure that he would absolutely and knew the girls. Didn't you know they Musical Club pin, and a member of<br />\nstore them away, and use them again next year.<br />\nSo we say that the students' getting into the habit<br />\ntype for the editorial staff? I'm sorAccordingly they put their chairs in storage, and positively be insulted, if he knew that<br />\nof using some of their spare time listening to discusry. You didn't ever see Jean and C. D. K. He gained all these recwas<br />\naudience<br />\nthe<br />\npresence<br />\nof<br />\na<br />\nlarge<br />\nsions on a range of subjects and learning to appreciate along with them they stored some Physics notes, which due to compulsion.<br />\nKitty sing, dance, and play the pi- ognitions through years of honorable<br />\nvarious viewpoints on these matters is a step towards had been given them by a fellow to use this year.<br />\nano in Levering Hall on Wednesday ble service and is proud of them. I<br />\nI am certain that any speaker<br />\nWhen this term opened, the two young men inquired<br />\nthe University's turning out full men—living men. Narnight in between articles?<br />\nWhere wonder if he could make 0, D. K.<br />\nof the storage company what their bill amounted to. would rather have a small, enthusiasrow men don't seem to get along.<br />\nhave you been? Just ask Glantz or<br />\nnow?<br />\nWhen they were told what the sum was, they decided tic and attentive audience, rather Safier<br />\nor O'Brian or Finkel to tell<br />\nit was cheaper to leave the chairs in storage, along then a large, unattentive one.<br />\n0-0<br />\nyou all about those weekly parties in<br />\nwith their Physics notes.<br />\nI think that the Student Govern- the office. Swell time, eh boys!<br />\nREMEMBERING PEOPLE'S NAMES<br />\n. . . and now they have to do their own Physics ment should make the assemblies so<br />\no—o<br />\ncontinues to cause me a great deal<br />\nMore important than the letter about assemblies is —and on hard chairs.<br />\ninteresting that no student would<br />\nFOUND in my postoffice box one of trouble and embarrassment.<br />\nthe Student Council's letter about the handling of class<br />\nI<br />\nwant to miss one.<br />\nmorning surrounded on all four sides can speak to a person concerning a<br />\nfunds through the Student Activities Committee, known<br />\npartments, a special department to handle class affairs,<br />\nThis is a challenge! Can't the Stu- by dust—I pay fifty cents a year for very personal matter,<br />\nto us who love it as the S. A. C.<br />\nand tell him I<br />\netc.<br />\ndent Government meet it?<br />\nthe privilege of collecting dust in will let him know what happens. He<br />\nThe purpose is to cool the ebullition of youthful enSecond, will the S. A. C. always be more capable<br />\nthis specially designed box. All the leaves and I have to go around askthusiasm that has driven class officers to gamble so<br />\nMORRIS A. WESSEL.<br />\nthan class officers? Not necessarily. The S. A. C. is virsmall particles are sifted out. No one ing people in the room \"To whom<br />\nmuch on putting on the \"biggest affair ever\" that they've<br />\ntually self-perpetuating. The dean makes the appointwas I talking?\" so that I will know<br />\nelse can have it except me:<br />\nhad to pawn their underwear, mortgage their roomments, but he makes them from a panel of suggestions Tc, the Editor of the NEWS-LETTER:<br />\nIt<br />\nthe<br />\nCity<br />\nexpenses.<br />\nwith whom to get in touch. Many<br />\noff<br />\nHall<br />\nto meet<br />\nmates, and raffle<br />\n\"For your column—<br />\nothers profess the same trouble in a<br />\nis believed that the more business-like heads of th S. A. furnished him by the retiring chairman. Thus it is quite Dear Sir:<br />\nThe only man who can run around<br />\nCommitteemen will dissuade them from letting ambition possible that the S. A. C. may become a political body,<br />\nIn view of the fact of the increas- with a bag all night and not get greater or lesser degree—so let's not<br />\nwith<br />\nmembership<br />\nin<br />\nit<br />\nand<br />\npromised<br />\nbargained for and<br />\ntake offense when a close friend turns<br />\nover-vault cash limits.<br />\ning importance of the handball team talked about is Santa Claus.\"<br />\nto you and says, \"What's your name<br />\nIn view of past p erformances it would seem that bartered in deals. The dean could never be expected to and its installation as a minor sport<br />\nI thought it very clever but a little<br />\nbe familiar with the intimate intricacies of campus polthe class officers could stand a quieting influence. There<br />\nI wish to call attention to the playing untimely since the fellows had al- again?\" Just tell him and forget all<br />\nis little doubt but that the S. A. C. could do this job itics known only by a few high priests. The politicians wall.<br />\nready dragged bags to the Barn- about it. Or perhaps you would like<br />\nwell. The present S. A. C. has done so well in its reg- might get away with it for a while—at least long<br />\nThe playing wall is of bare red stormer affair, and had probably small name-plates on the order of<br />\nulation of funds that it has incurred the undying en- enough to do some damage.<br />\nbrick and in such nature it is hard dated the same bags for New Year's license plates to be hooked on one's<br />\nThere are ways to check this. One would be to put<br />\nI'm for it in a big way.<br />\nmity of the business heads of the various activities—a<br />\non the eyes of players and makes the Eve. Very good advice for the fu- clothing.<br />\nsure sign of a careful fiscal administration. But in the S. A. C. up for popular election with a complete ball soon difficult to follow.<br />\nture, though.<br />\n0-0<br />\nspite of this, we want to be cautious. We want to look reformation of the present system of election qualifica0-0<br />\nsuggest<br />\nthat<br />\nAs<br />\none<br />\ninterested,<br />\nI<br />\nTHOSE<br />\nTO<br />\nFEW<br />\nwho have noticed<br />\ntions. Another would be to have it appointed by a facahead and ask questions and make sure.<br />\ncoat<br />\ngiven<br />\na<br />\nthe<br />\nwall<br />\nbeing<br />\nnecessity<br />\npeculiar<br />\na<br />\nodor<br />\nabout<br />\nthe campus, let<br />\nNOW<br />\nFROM<br />\nON,<br />\nfellows,<br />\nquit<br />\ngivFirst, will the S. A. C. be able to stand this extra ulty committee of the School of Business Economics<br />\nof white paint or white wash. This ing Mr. Dittus all kinds of bad me explain that it is just the stink of<br />\nfrom<br />\namong<br />\nthose<br />\nstudents<br />\nwhose<br />\nscholastic<br />\ninterests<br />\nof<br />\nmade<br />\nup<br />\nC.<br />\nis<br />\nS.<br />\nA.<br />\nthat<br />\nthe<br />\nwork? Remember<br />\nwould be kind consideration to our names because of the book-store politics, of which the campus is supstudents—three students. As it is, their tasks are hard are along the lines of the S. A. C.'s work. Perhaps that<br />\nteam as well as a courtesy to the prices. The book-store is owned and posed to be entirely free. Give you<br />\nown<br />\nis<br />\nthe<br />\nbest<br />\nway.<br />\non<br />\nits<br />\nand consuming. It looks as though the S. A. C. is<br />\nvisiting<br />\nsquads.<br />\nrun by the University through their three guesses who it was this time—<br />\nAt any rate, before we put too much authority in the<br />\nway towards becoming a full-time job.<br />\nMr. Dittus. I think quite none other than—oh, you wouldn't<br />\nemployee,<br />\nYours<br />\nsincerely<br />\nC.<br />\nwe<br />\nwant<br />\nto<br />\nS.<br />\nA.<br />\nbe<br />\nas<br />\ncertain<br />\nas<br />\nposThis could be remedied, for example, by enlarging hands of the<br />\nyou owe him an apology. care, anyway.<br />\na<br />\nfew<br />\nof<br />\nEnthusiast.<br />\nHandball<br />\nA<br />\nwant<br />\nit<br />\nto<br />\nbe.<br />\ndoesn't<br />\nbecome<br />\nsomething<br />\nwe<br />\ndon't<br />\nsible<br />\nit<br />\ndeit<br />\ninto<br />\nC.<br />\nand<br />\ndividing<br />\nthe<br />\nS.<br />\nA.<br />\nof<br />\nmembership<br />\nthe<br />\nSubscription per year<br />\nBy Mail<br /><br />\n$2.00<br />\n$2.50<br /><br />\nIndicted Again<br /><br />\nChagrin And Bear It<br /><br />\nDeaf, Dumb And Blind<br /><br />\nLETTERS TO<br />\nTHE EDITOR<br /><br />\nHorrible Thought<br /><br />\ndli<br />\ntic<br />\npa:<br />\nmt<br />\nty.<br />\nup<br />\nan<br /><br />\nWil<br /><br />\nwe<br />\nSe:<br />\nstoo<br />\ncr(<br />\nize<br />\nwIi<br />\nslu<br />\nco]<br />\nTh<br />\nwh<br />\nanE<br />\npr<br /><br />\nSG(<br /><br />\nSOI<br /><br />\nHOME WOOD, BALTIMORE, MD., JANUARY 15, 1936<br /><br />\nWOOD DESCRIBES<br />\nJAPAN'S LEADING DR.<br />\nNEW HIGH EXPLOSIVE<br />\nCHRISTIAN WILL<br />\nTALK AT HOPKINS<br />\nIs<br /><br />\nToyohiko Kagawa To Speak<br />\nAt Supper Club Meeting<br />\nNext Tuesday<br />\nUNIVERSITY SERIES<br />\nWILL FOLLOW<br />\nLyric Is Chartered To Hold<br />\nThe Unusually Large<br />\nAudience<br />\n(Continued from Page 1, Col. 4)<br />\ndling dentist. He continued to practice philanthropy, until it became apparent that he could not thus make<br />\nmuch headway in diminishing poverty. On the advice of a friend he pulled<br />\nup his stakes and went to America<br />\nand returned a couple of years later<br />\nwith a Bachelor of Divinity degree<br />\nwon at the Princeton Theological<br />\nSeminary. He married and soon<br />\nstarted on a new tack towards decreasing the poor. This was to organize and assist the industrial workers,<br />\nwho were better able to care for the<br />\nslums' \"down-and-outers\", and in this<br />\nconnection he wrote his first book,<br />\nThe Adoration of the Laborer, in<br />\nwhich he propounded a remark, a<br />\n•masic axiom to him: \"The laborer<br />\nproduces the things which the rest of<br />\nsociety needs; therefore, his status in<br />\nsociety is more essential to it than<br />\nthat of the king.\"<br />\nHelped Laborers Greatly<br />\nIn the Japanese rice riots of 1919<br />\nthe thirty-year-old cleric obtained<br />\ngreat gains for the workers. Working<br />\nhand-in-glove with the governor of<br />\nKobe, he secured plenty of food for<br />\nthe poor people. Two years later, by<br />\nhis magnificent personality and great<br />\nhold over the people, he prayed and,<br />\nin so doing, put down a Communist<br />\nuprising. For his pains, he was jailed<br />\nfor a fortnight, but during that time<br />\nhad an opportunity to finish his third<br />\nautobiographical book, Listening to<br />\nthe Voice of the Wall.<br />\nHis previous tales of his experiences and expressions of his philosophies were best sellers and captured<br />\nthe hearts of the progressive young<br />\nintellectuals of the nation. A few<br />\nmonths later he was called upon by<br />\nthe Tokyo government to settle another \"reign of terror.\" He'later assisted the Premier, who was Chairman of the Reconstruction Commission.<br />\nPreached Twice Nightly<br />\nPreaching twice nightly, he later became the organizer and leader of the<br />\nKingdom of God movement and converted many thousands of Nipponese<br />\nto Christianity. In fact, 65,000 of Japan's youth signed cards affirming<br />\ntheir faith. Together with his evangelistic work he acted as head of the<br />\nSocial Bureau of Tokyo, having the<br />\nmayor himself as a subordinate. He<br />\ngreatly aided a citizens' cooperative<br />\nprogram and was materially responsible for opening Tokyo's first inexpensive hospital. Ever since 1923 he has<br />\nbeen a highly-esteemed adviser of<br />\nthe Japanese government.<br />\nAlthough his royalties from his<br />\nbooks amount to more than $10,000<br />\na year and his other sources of income are equally profitable, Dr. Kagawa is said to live on $40 a week,<br />\nsupporting a wife and three children.<br /><br />\nDEBATING TEAM OPENS<br />\nSEASON THIS FRIDAY<br /><br />\nSensitive Enough To<br />\nBe Detonated By A<br />\nHousefly<br /><br />\nAn explosive so sensitive that it<br />\nexplodes by the weight of a housefly<br />\nalighting on it was described by Prof.<br />\nR. W. Wood to the American Association for the Advancement of Science.<br />\nIt is the iodide of nitrogen, which<br />\ncan be detonated by the gentlest of<br />\nforces.<br />\nProfessor Wood gave this as one<br />\nexample of striking physical effects<br />\nof certain high explosives. He stressed<br />\nthe fact that \"too much publicity cannot be given to the disastrous effects<br />\nproduced by detonators which project a copper pellet with a velocity<br />\nof 6,000 feet per second, three times<br />\nthe velocity of a rifle bullet and<br />\ngreater than the velocity of the shells<br />\nwhich were fired on Paris from a distance of 75 miles during the World<br />\nWar.\"<br />\nAs an example, he cited the almost<br />\ninstant death of a Baltimore woman<br />\nwho was struck by a small pellet of<br />\nmetal, which, as Dr. Wood, to whom<br />\nit was submitted for investigation,<br />\nlater proved, turned out to be a detonator left in the coal by some careless miner.<br />\nHe gave accounts of the experiments of earlier investigatort, including a lantern slide showing the<br />\niinpressions of even the smallest<br />\nveins of the leaf of an apple tree<br />\nmade on a block of steel by exploding gun-cotton above it. In his own<br />\ninvestigations, Dr. Wood said two<br />\nsuperposed telephone directories were<br />\nrequired to stop one detonator, the<br />\npellet going through 1200 pages.<br />\nProfessor Wood has also made a<br />\nspectroscopic study of several high<br />\nexplosives.<br /><br />\nDR. GARTNER DELIVERS<br />\nTHIRD DOHME LECTURE<br />\nEvidence For The Existence<br />\nOf Bound Water Is<br />\nHis Topic<br /><br />\nExamination Schedule HOPKINS LEADERS AT<br />\nHOPKINS QUINTET<br />\n•<br />\nJANUARY 27 TO FEBRUARY 4, 1936<br />\nThe morning sessions begin at 9 A. M.; the afternoon sessions at<br />\n1 P. M. The time allowed is as follows: in a three- or four-hour course,<br />\nthree hours; in a one,- or two-hours course, two hours.<br />\nAll conflicts should be reported to the Registrar's office by January 17.<br /><br />\nMONDAY MORNING, JAN. 27<br />\nAdvanced Electricity &amp; Magnetism<br />\nM201<br />\nBiology IC<br />\nA to L<br />\nMain Lib.<br />\nM to Z<br />\nG112<br />\nEnglish 3C<br />\nG312<br />\nFrench 3C<br />\nG205<br />\nGas and Fuel Analysis<br />\nM104<br />\nLatin 3C<br />\nClass. Lib.<br />\nMatchematics 1C<br />\nMr. Turpin<br />\nM114<br />\nMathematics 2C<br />\nDr. Cohen<br />\nRo100<br />\nDr. Morrill<br />\n,Ro58<br />\nMr. Popow<br />\nRo58<br />\nDr. Zariski<br />\nRo101<br />\nPolitical Economy 6B ....G313 and 314<br />\nPsychology 1C<br />\nR101<br />\nSanitary Engineering<br />\nL307<br />\nMONDAY AFTERNOON, JAN. 27<br />\nElements of Electrical Eng....M109M110<br />\nEnglish 1C<br />\nDr. Miles<br />\nR1<br />\nMr. Kilbourne<br />\nM221<br />\nFi ench 4C<br />\nG305<br />\nGerman Reading (9:30 a. m. sec.)<br />\nDr. Prahl<br />\nMain Lib.<br />\nDr. Rosenberg<br />\nMain Lib.<br />\nDr. Roulston<br />\nMain Lib.<br />\nMathematics of Finance<br />\nG311<br />\nTUESDAY MORNING, JAN. 28<br />\nElectrical Measurements<br />\nM220<br />\nFrench IC<br />\nMr. Shapiro<br />\nR301<br />\nFrench 2C<br />\nMr. Spurlin<br />\nG205<br />\nGeology 1C<br />\nL120<br />\nLatin 1C<br />\nClass. Lib.<br />\nMaterials of Engineering....M109-110<br />\nMathematics 4C<br />\nRo100<br />\nMathematics 5C<br />\nRo101<br />\nPhilosophy 1C<br />\n0314<br />\nPolitical Economy 3B<br />\nG311<br />\nPolitical Economy 12B<br />\nR1<br />\nPolitical Economy 21B<br />\nG313<br />\nPsychology 2C<br />\nG312<br />\nZoology 4P (Genetics)<br />\nG112<br />\nTUESDAY AFTERNOON, JAN 28<br />\nFrench Reading<br />\nDr. Rice (3 p. m. sec.)....Main. Lib.<br />\nGerman Reading<br />\nDr. Roulston (3 p. m. sec.),<br />\nMain Lib.<br />\nLatin 6C and 7C<br />\nClass. Lib.<br />\nUnit Processes in Gas Eng<br />\nM114<br />\nWEDNESDAY MORNING, JAN. 29<br />\nChemistry 2Ca<br />\nR1<br />\nHeat Gen. and Transmission<br />\nM119<br />\nHistory (Freshman)<br />\nDr. Lane's and Mr. M,archant's<br />\nSections<br />\nMain Lib.<br />\nMr. Goldman's Sections<br />\nG112<br />\nDr. Bowen's Sections<br />\nR101<br />\nPolitical Economy 1C<br />\nDr. Evans<br />\nM110<br />\nPolitical Economy 22B<br />\nG311<br />\nStructural Engineering<br />\nL307<br />\nSurveying<br />\nL210<br />\nWEDNESDAY AFTERNOON<br />\nJANUARY 29<br />\nEnglish 11E<br />\nL120<br />\nGerman Reading (2 p. m. sec.)<br />\nDr. Prahl<br />\nMain Lib.<br />\nDr. Roulston<br />\nMain Lib.<br />\nLatin 5C<br />\nClass. Lib.<br />\nMathematics 1C<br />\nMr. Hartman<br />\nM110<br />\nMr. Rawhouser<br />\nM109<br />\nMr. Umberger<br />\nRo102<br />\nMathematics 2C<br />\nMr. Fox<br />\nRo100<br />\nPolitical Science 2C<br />\nR1<br />\nSpanish 1C<br />\nR303<br /><br />\nDr. Ross A. Gartner of the University of Minnesota spoke on \"Evidence for the Existence of Bound<br />\nWater\" last Friday in Remsen Hall.<br />\nThis was the third Dohme lecture to<br />\nbe delivered.<br />\nHe described how the colloidal<br />\nstate is characterized by intense surface forces. It is this surface energy<br />\nwhich is utilized for the processes<br />\nof adsorption.<br />\nIn the biological organism most of<br />\nthe \"dry matter\" constituents exist<br />\nin the colloidal state with water as<br />\nthe dispersion medium. The proteins<br />\nparticularly are highly hydrophilic.<br />\nIn 1922, Newton and Gortner first<br />\nsuggested a method for measuring<br />\n\"bound water,\" i.e., water which was<br />\nso strongly held upon colloid interfaces as to be differentiated in its<br />\ncolligative properties from water-inbulk. Since 1922 other technics have<br />\nbeen developed for making similar<br />\nmeasurements so that *today we have<br />\nthe methods which are known respectively as the cryoscopic method,<br />\nthe calorimetric method, the dilatometric method, the direct pressure<br />\nmethod, the refractometric method,<br />\nthe polarimetric method, the dielectric constant method, and the vapor DR. ADEL TO ADDRESS<br />\nPHYSICS JOURNAL CLUB<br />\npressure method.<br /><br />\nJay Musical Club To<br />\n'Present Two Concerts<br /><br />\nTHURSDAY MORNING, JAN. 30<br />\nBiology 2C<br />\nMain Lib.<br />\nElectric Railways and Electrical Illumination<br />\nM217<br />\nEnglish 8C<br />\nG312<br />\nFrench Reading<br />\nMr. David<br />\nR1<br />\nDr. Rice<br />\nR1<br />\nMr. Schweitzer<br />\nR1<br />\nDr. McKee<br />\nR1<br />\nFrench 1C<br />\nMr. Morrissette<br />\nR301<br />\nMr. Spurlin<br />\nM218<br />\nGas Engineering<br />\nM314<br />\nGerman 1C<br />\nG314<br />\nHistory 4C<br />\nM119<br />\nItalian 1C<br />\nG311<br />\nMachine Design<br />\nM121.<br />\nMathematics 3C<br />\nMr. Curtiss<br />\nRo58-Dr. Morrill<br />\nRo100<br />\nDr. van Kampen<br />\nRo102<br />\nDr. Williamson<br />\nRo58<br />\nPhilosophy 3C<br />\nG313<br />\nPolitical Economy 1C<br />\nDr. Weyforth<br />\nR101<br />\nPsychology 3C<br />\nR302<br />\nRailroad Engineering<br />\nL307<br />\nTheory of Structures<br />\nL115<br />\nTHURSDAY AFTERNOON, JAN. 30<br />\nChemistry 7CP<br />\nR301<br />\nMilitary Science, Basic 1<br />\nL120<br />\nMilitary Science, Basic 2<br />\nL120<br />\nMilitary Science, Adv. 1....South Loft<br />\nMilitary Science, Adv. 2....South Loft<br />\nFRIDAY MORNING, JAN. 31<br />\nAlternating Current Theory<br />\nElectrical Section<br />\nM220<br />\nMechanical Section<br />\nM218<br />\nApplied Mechanics<br />\nL120 and Draw. Room<br />\nEnglish • 7Ca<br />\nG311<br />\nHistory (Sophomore)<br />\nR1<br />\nMathematics 2C<br />\nMr. Curtiss<br />\nM114<br />\nMr. Kersimer<br />\nRo100<br />\nPolitical Economy 2C<br />\nM110<br />\nFRIDAY Ak-rh_IRNOON, JAN. 31<br />\nChemistry 1013<br />\nR221<br />\nEnglish 9C<br />\nG311<br />\nHistory 1C<br />\nG108<br />\nMathematics 5E<br />\nDr. Cohen<br />\nRo100<br />\nDr. Morrill<br />\nRo104<br />\nPolitical Science 3C<br />\nG313<br />\nSATURDAY MORNING, FEB. 1<br />\nChemistry 2Cb<br />\nR101<br />\nEnglish 30C<br />\nG314<br />\nGreek 1C<br />\nG312<br />\nHeat Engines<br />\nM109 and 221<br />\nPolitical Economy 11B and 14B,<br />\nMain Lib.<br />\nPower Plant Calculations<br />\nM110<br />\nMONDAY MORNING, FEB. 3<br />\nChemistry 1C<br />\nR1<br />\nGerman 1TC (8:30 sec.)<br />\nG314<br />\nPhysics 1Ca<br />\nRo104<br />\nPhysics 1C<br />\nStudents in Arts &amp; Sciences L120<br />\nStudents in Engineering<br />\nRo58<br />\nPolitical Economy 1C<br />\nDr. Mitchell ....Main Lib. and G112<br />\nPolitical Economy 20B<br />\n0313<br />\nMONDAY AFTERNOON, FEB. 3<br />\nEnglish 6C<br />\nG117<br />\nPolitical Science 1C<br />\nR101<br />\nChemistry 9CP<br />\nR219<br />\nTUESDAY MORNING, FEB 4<br />\nFrench 5C<br />\n(Conversation and Composition,<br />\nG312<br />\nHighway Engineering<br />\nL115<br />\nHistory 2C<br />\nG313<br /><br />\nPhilological Society To<br />\nHear Dr. R. D. Havens<br /><br />\nAt a meeting of the Physics JourThe Johns Hopkins Philological Asnal Club in Roland Hall on Thurssociation<br />\nwill meet Thursday, Januday, January 16, Dr. Adel will speak<br />\nary<br />\n16,<br />\nat<br />\n11:30 a. m., in ROGIll 216,<br />\non \"The Absorption of Sunlight in<br /><br />\nGroup Will Play At Clifton Ave. M.<br />\nthe Earth's Atmosphere.\" Dr. Adel ilman Hall. Professor Raymond D.<br />\nE. Church And At AnnapThe debating team will hold its<br />\nis a fellow-by-courtesy of the Phys- Havens will read a paper entitled,<br />\nolis High School<br />\nfirst debate of the season this Fiday<br />\nics Department and is Professor of \"Solitude, Silence, and Lonely Places<br />\nThe Johns Hopkins Musical Club,<br />\nat 4 p. m. in room 305, Gilman Hall.<br />\nin the Poetry of Wordsworth.\"<br />\nAstronomy.<br />\nof which John Murphy, Jr., is presThe subject of the debate will be:<br />\nResolved: That Congress be allowed ident, will present two concerts on 12MMIK111111<br />\nby a two-thirds majority to overrule Thursday and Friday of this week.<br />\nThe first concert will be rendered<br />\ndecisions or the Supreme Court declaring acts of Congress unconstitu- here in Baltimore at ClifMton Avetional. Johns Hopkins will, support nue M. E. Church. The solo for the<br />\nthe negative side. The team will &amp;in- evening will be the \"Liebstrom\", by<br />\nsist of two men. Moses B. Macht will Franz Liszt. The solo will be preAll Topcoats<br />\nbe first speaker and rebuttalist and sented by Brian Murphy.<br />\nWere $22.50 to $55<br />\nOn Friday the Musical Club will<br />\nPhillip Grossman Will be second<br />\n$18.75 to $44.75<br />\nspeaker. Team is coached by Dr. travel to Annapolis where they will<br />\nAll Overcoats<br />\nLynn.<br />\nglve a concert at the Annapolis High<br />\nWere $25 to $100<br />\nThe question for debate is of special School. The dance orchestra will play<br />\n$20.75 to $79.75<br />\ninterest in view of the recent A.A.A. for a dance after the concert.<br />\nand N.R.A. decision by the supreme<br />\ncourt.<br />\nThis will be the last debate until<br />\nafter exams when many strong teams<br />\nPrinters of<br />\nsuch as Yale, Pennsylvania and<br />\nPHILOLOGICAL and<br />\nPrinceton will be met<br />\nSCIENTIFIC PUBLICATIONS<br />\nTwo Hours Free Parking, Mid-City Garage, 27 8. Charles<br />\nThis debate is open to the student<br />\nBaltimore<br />\n12-20 Hopkins Place<br />\nbody.<br /><br />\n1<br /><br />\nentire stock of<br />\nKatz Fall and<br />\nWinter Suits<br /><br />\nJ. H. FURST CO.<br /><br />\nKATZ CLOTHES<br />\n7 &amp; 9 E. Baltimore St., at Charles<br /><br />\nFIRST A. S. U. MEETING<br /><br />\nOrganization Aims To Fuse<br />\nCampus Opinion Of All<br />\nColleges<br />\nAs the first step in the formation<br />\nof the Hopkins chapter of the American Students' Union, through which<br /><br />\nRALLY DEFEATS<br />\nST. JOHN'S SQUAD<br /><br />\nit s planned to fuse all elements of<br />\nprogressive campus opinion, a closed<br /><br />\nMargolis, Melvin, Woodrow<br />\nStar; Jays Play Well<br />\nThroughout Tilt<br /><br />\ndiscussion, attended by several Hopkins leaders, was held in the board<br />\nroom in Levering Hall last Friday.<br /><br />\nLAMBROS, KOOGLE<br />\nLOSS TO JOHNNIES<br /><br />\nAnother such session to clarify points<br />\nraised last week will be held day after tomorrow.<br /><br />\nRoss Is Outstanding Performer With High Score<br />\nOf 18 Points<br /><br />\nChief point of controversy in the<br />\ndiscussion was the peace program of (Continued from Page<br />\n1, Col. 1)<br />\nthe new union. Already a storm cen- now called time out. Six minutes of<br />\nter at its inception, the A. S. U., in playing time remained and a victory<br />\nwas not apparently in store for them.<br />\nconvention at Columbus, recommendTime in, Woodrow shot successed both the abolition of the R. 0. T.<br />\nfully and was fouled by Ross. The<br />\nC. and the adoption of the famous Hopkins fans groaned when he missOxford Oath. Many foresaw an early ed his extra point. Herb Siegel and<br />\nschism unless the two opposing ele- Lambros charged together and the<br />\nlatter left the game on personal<br />\nments come to some agreement. If<br />\nfouls.<br />\nthe constitution of the national orNeither made his single free throw.<br />\nganization permits individual chap- Krogle then fouled Melvin<br />\nand was<br />\nters to be autonomous, some compro- also ejected for the same reason,<br />\nwhile Melvin, the captain of the Jay<br />\nmise may be reached.<br />\nsquad,<br />\nsank two goals to tie the<br />\nThe meeting was opened by Morscore at 25-all. Galloway, substitute<br />\ntis Shils, representative of the Naforward, lost the ball by staying with<br />\ntional Student League at the con- his back to the basket for more than<br />\nvention with the reading of the Union the 3 seconds allowed in the free<br />\nplatform. Chief points on the pro- throw lane. This ruling is one which<br />\ngram were (1) Drastic peace meas- was installed this year. Next Harry<br />\nures, with the Oxford Oath and R. 0. Woodrow shot from the middle of the<br />\nT. C. abolition advocated particular- floor to put Hopkins ahead, 27-25.<br />\nly; (2) Democratization of education;<br />\nWith an apparently safe and as(3) a militant campaign against sured lead after Les Margolis sank<br />\nFascism and against repression of the ball on a pass from his brother,<br />\nacademic freedom. Shils stressed in George, the Hopkins squad entered<br />\nhis conclusion the clause which wel- the final three minutes of play.<br />\ncomes into the fold any person seriHard-Fought Finish<br />\nously interested in any one feature<br />\nBut Ross, one of the outstanding<br />\nof the program.<br />\nindividual players, shot a single foul<br />\nAmong those attending the session out of two attempts and then placed<br />\nwere Jesse Borden, Sidney. Levy, a goal through the netting. He was<br />\nClifford Bruck, Brian Murphy, Her- fouled on this shot and added an<br />\nschel Halbert, Maus Darling, Ralph extra point to tie the score, 29-all.<br />\nNordstrom, Murry Kempton, and The remaining twenty-one seconds<br />\nRussell Burghardt. Irving Cohen pre- was tense and filled with whirlwind<br />\naction.<br />\nsided.<br />\nLester Margolis passed to Harry<br />\nWoodrow unheeded under the basket<br />\nand Guard Woodrow netted the final<br />\nand decisive tally unopposed.<br />\nIn the last few seconds of play St.<br />\nJohn's'got the jump, and when Greer<br />\nshot from the outside Les Margolis<br />\nIn cases where it is impossible fouled him. Les was ejected because<br />\nfor a fraternity team to play at the it was his fourth foul.<br />\nscheduled time, the ame will be postRoss was particularly outstanding<br />\nponed until a later date, providing for the Johnnies, scoring a total of<br />\nthe excuse is acceptable to Mr. Lotz 18 points. Lambros and Koogle were<br />\nand Mr. Dotterwiech, and notice is also outstanding St. John's men.<br />\ngiven to these men 48 hours in adFor Hopkins Melvin, Woodrow and<br />\nvance of game-time. Games which Les Margolis put in fine and comare post-poned by the fraternities mendable performances. Siegel, G.<br />\nwithout notifying the men in charge Margolis could not have been spared<br />\n48 hours ahead of game time will from the line-up because of their exbe dropped from the schedule and no cellent showing.<br />\npoints allowed for the game.<br />\nAny team which is not dressed and<br />\non the floor ready to play within<br />\nOn<br />\nfifteen minutes after the scheduled<br />\ntime of the game will loose the game<br />\nDr. David M. Robinson, professor<br />\nby forfeit.<br />\nof art and archaeology at the Johns<br />\nHopkins University, will deliver two<br />\noutside lectures in the near future.<br />\nDr. Robinson will speak to the<br />\nGoethe Society, Saturday, January<br />\nProfessor Horace Wright, profes- 18, at 8:15 p. m., at the home of<br />\nsor of classics at Lehigh University, one of the members. His topic will<br />\nwill lecture here next Wednesday, be, \"The Influence of Greek Poetry<br />\nJanuary 22, at 5 p. m., in Latrobe on Goethe.\"<br />\nHall, Homewood.<br />\nOn Monday, January 27, at 11:30<br />\nProfessor Wright will speak on a. m. Professor Robinson will deliver<br />\n\"Early Rome.\" His lecture will be a lecture to the Arundel Club on<br />\nillustrated by lantern slides.<br />\n\"Olynthus.\"<br /><br />\nLOH INTERPRETS<br />\nINTERFRAT RULES<br /><br />\nDr. Robinson To Speak<br />\nGoethe And Olynthus<br /><br />\nProfessor Wright To<br />\n,Talk On \"Early Rome\"<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br /><br />\nWhat you want is easy to find.<br />\nYou get efficient service.<br />\nPrices are reasonable.<br /><br />\nHUTZLER 13FCffilEM e<br />\n...real<br />\n.<br />\n11 0.4..<br />\n4.<br />\n0<br />\n•••••••••••••••••••410•41.1.111.11.111.11.1111.4.<br />\n.<br />\n4.<br /><br />\nHAIRCUTS-40c<br /><br />\nBoulevard<br /><br />\nChas. Landler, Prop.<br /><br />\nBarber' Shop<br /><br />\nS. E. Corner Saint Paul &amp; 33rd Streets<br />\nEntrance on 33rd Street<br />\nWeek Days-8 A. M. to 7:30 P. M.<br />\nSaturday-8 A. M. to 9 P. M.<br /><br />\nI<br /><br />\nBirely's Pharmacy<br />\nST. PAUL at 33RD STREET<br />\nPrescriptions—School Supplies<br />\n.<br />\nCandy-Cigars<br />\nUnexcelled Fountain Service<br /><br />\n11.0.11.4.0.111.0.111.0.41.41.0.0.111.46.11.11.0.111.4.0.4.11•••••••<br /><br />\nHOME WOOD, BALTIMORE, MD.. JANUARY 15, 1936<br /><br />\n4<br /><br />\nCOURTN1EN LOSE<br />\nTO WASHINGTON<br />\nIN HOME DEBUT<br />\nChestertown Shoremen Triumph Over Homewood<br />\nArray, 47 To 35<br />\nBLUE JAYS TRAIL<br />\nFOE AT HALFTIME<br />\nSiegel, High Scorer Of Contest With 14 Points;<br />\nFrosh Over J. V.<br />\nThe Johns Hopkins courtmen lost<br />\ntheir first game in the Maryland Intercollegiate Basketball League series to an aggregation from Washisgton College last Friday night at<br />\nHomewood by a score of 47 to 35.<br />\nAlthough the Jays were defeated, the<br />\ncontest in no way suggested the affair would be repeated often.<br /><br />\nBLACK<br />\nAND<br /><br />\n-<br /><br />\nBLUE<br /><br />\nBy BERNARD PINCK<br /><br />\nWashington Has<br />\nFormidable Quint<br />\nIf their performance last Friday<br />\nnight against the Blue Jay cagers is<br />\nrepresentative of their customary<br />\ngame, the Shoremen from Chestertown bid fair to cop the league bunting this year. A cool, cooperative outfit, the Maroon and Black are also<br />\nblessed with the height, weight, and<br />\nstamina so helpful to a basketball<br />\nteam.<br />\nThe Chestertown lads are a scrappy bunch who fight every minute of<br />\nthe game. They pass exceedingly<br />\nwell, cut fast, and make their shots<br />\ncount. Bolstered by a capable second<br />\nteam, it would seem that the Washington quint is the team to beat in<br />\nthe Maryland League.<br />\nHopkins appears to be suffering<br />\nfrom a paucity of capable reserves.<br />\nTowards the end of the Washington<br />\nencounter, the starting players were<br />\nIf the subs are<br />\nreally exhausted.<br />\nworthy of enteriing a hard close fray<br />\nthey haven't proved themselves yet<br />\nto Coach Mallonee.<br />\n0-0<br /><br />\nThe play during the first period<br />\nwas fast, exact, and the scoring was<br /><br />\nGrapplers Open<br />\nSeason Tonight<br /><br />\nfairly even, with Washington leading<br />\nGus Van Sant's mighty wrestlers<br />\nby only three points at the conclu- inaugurate the current season tonight<br />\nsion of that half. The score then was at the gymnasium when they en22-19. Playing masterly ball, and counter the grunters and groaners<br />\ncompletely dominating the affair, from Maryland. The Jay rnatmen<br />\nhave been training for some time and<br />\nWashington College tossed in 25<br />\nare a well conditioned group. Having<br />\npoints to the 15 by the Hopkins team<br />\na number of veterans and several<br />\nin the second period, to complete the promising candidates in the line-up,<br />\nscoring for the game.<br />\nthe grapplers are hopeful of a sucGame Starts Slowly<br />\ncessful season.<br />\nWrestling is one of the most gruelThe fray started with the customary \"feeling out\" process by both ling sports on the campus. Hitherto it<br />\nhas not received its due support. Dearrays, with Melvin putting away a<br />\npractice sessions,<br />\nspite their hard<br />\nfield goal to give first blood to Hoptheir bruised bones, and their mat<br />\nkins. Washington countered with 5 burns, the grapplers are very enpoints on three free throws and a re- thusiastic about their activity. Cerbound shot. Hopping Herbie Siegel tainly then, student support at the<br />\nand Norm Melvin rearranged the matches should be more readily<br />\nscore with a field goal apiece. Hop- forhcoming.<br />\nkins leading, 6 to 5, one of the Chestertown<br /><br />\nstalwarts<br /><br />\nswished<br /><br />\none<br /><br />\nthrough the netting to alter the situation a bit. Carl Rasin tied the score<br />\nwith a foul shot.<br /><br />\nAfter Siegel in-<br /><br />\ncreased the home lead with another<br />\nfield goal, the Maroon and Black aggregation set up a barrage of shots,<br />\nscoring nine points. At this point<br />\nin the tussle, Harry Woodrow went in<br />\nfor Les Margolis. Les had a bleeding<br />\nnose. The Washington center put in<br />\ntwo shots from the foul line to be<br />\nfollowed by Melvin dribbling through<br />\nfor two points. A long shot by the<br />\nvisitors was atoned for by a series of<br />\nHopkins goals, adding eight points<br />\nto its total, just before the half ended_ At half time Hopkins was trailing<br />\nby 19-22.<br />\nThe Shoremen opened the last period with three points, from a long<br />\nshot and a foul. Siegel, playing an excellent all-around game, followed with<br />\nanother long shot. A Washington<br />\nforward added to the score with an<br />\nunder-basket shot. Both teams then<br />\nshot and were effective, in turn, the<br />\nChestertown array getting 11 points<br />\nto Hopkins's nine. The Homewood<br />\nfans were then disappointed to see<br />\nfour enemy field goals in succession.<br />\nSiegel and George Margolis rang up<br />\ntwo scores, aided by Woodrow's free<br />\nthrow. A Washington College foul<br />\nshot ended the contest.<br />\nSiegel High Scorer<br />\nHerbie Siegel was the high scorer<br />\nfor the local team with a total of 14<br />\npoints, followed by Norm Melvin, his<br />\nteammate, who accounted for eight of<br />\nthe Hopkins markers. The Chestertown point-setter was their giant<br />\ncenter, Zebrowski, with 12 points,<br />\nwith Smith close behind with 11.<br />\nCharacterized by smooth passing,<br />\nmiraculous shooting, and what is<br />\nmore important, a fighting spirit, the<br />\nfray indicated that the horde from<br />\nSt. John's would be in for a battle<br />\nwhen they invaded the Hopkins campus.<br />\nIn a preliminary game, the Freshman basketball team beat the Junior<br />\nVarsity organization by a score of<br />\nis to 11 . . . two swell shots were<br />\nmde during the varsity game by Siegel and Rasin . . . Herb's went in<br />\nfrom a point to the side and behind<br />\nthe basket, while Carl stood on the<br />\ncenter line and dropped the ball in<br />\nwithout its hitting the rim . . . the<br />\nlatter shot was disallowed due to a<br />\ntechnicality . . . the crowd was entertained during the half by the trick<br />\nshooting of the varsity substitutes,<br />\n\"Chubby\" Rubinger, \"Hal\" Zheutlin,<br />\n\"Dimmy\" Traggis, and \"Cold Turkey\" Rosenthal.<br /><br />\nHANDBALL TOURNEY Jay Matmen<br />\nBeat Maryland<br />\nIN SECOND ROUND Hopkins Wins 5 Of Tilts<br /><br />\nSportlight<br />\nC. BERNARD LEWIS, JR.<br /><br />\n8<br /><br />\nWinners Of Tournament To<br />\nBecome Members Of<br />\nVarsity Outfit<br />\nThe first round of the handball<br />\ntournament ended yesterday and the<br />\nsecond round has begun. This second<br />\nround will extend until January 17.<br />\nThe quarter-finals, semi-finals, and<br />\nfinals are all scheduled to follow immediately after so that the entire<br />\ntournament will be completed before<br />\nthe exams.<br />\nDick Pasternak, manager of the<br />\nteam, has been arranging a heavy<br />\nschedule. Since all of last Year's<br />\nvarsity team returned this year under the leadership of co-captains Joe<br />\nKrell and Joaquin Hernandez, it is<br />\nexpected that the team will give a<br />\ngood account of itself.<br />\nThis year, the Johns Hopkins<br />\nhandball team is a recognized minor<br />\nsport and competition for first team<br />\nberths has been keen. Coach Reuben<br />\nBaer announced that the winners of<br />\nthe tournament and last year's varsity members will constitute the varsity squad.<br />\nResults of the first round were as<br />\nfollows:<br />\nI. Milberg defeated Kasselbrauer,<br />\n21-11, 21-12.<br />\nJ Krell defeated Windsor, 21-17,<br />\n21-13.<br />\nHarrell defeated Goldberg, 21-11,<br />\n22-20.<br />\nN. Finkelstein defeated M. Tuerk,<br />\n21-14, 21-14.<br />\nR. Byer defeated L. Rubinger, 21-11.<br />\n21-13.<br />\nM. Lazarus defeated Newhall, 21-12,<br />\n24-26, 21-12.<br /><br />\nTo Defeat Maryland<br />\nIn Opener<br /><br />\nA close-knit V-neck white<br />\nsweater of 1900 vintage, was reported missing last week by Bernard Lewis.<br />\nThe sweater has his name on it.<br />\nThe garment has no real value<br />\nother than sentimental attachment.<br /><br />\nthat's Bernie . . . A product of Prov-<br /><br />\nidence, R. I. . . . Came to Hopkins as<br />\nThe Hopkins wrestlers conquered<br />\nthe University of Maryland team Brown University grad of '35 . . .<br />\n2 in the first match of Enrolled as instructor and grad stu2 to 101/<br />\n/<br />\n251<br />\nthe season for both teams at the dent in Biology department.<br />\nHomewood gym.<br />\nBernie's quite a trackster--fourThe Blue Jays won five of the eight<br />\nvarsity man at high school . . .<br />\nyear<br />\ncontests, one by default. They drew<br />\none and lost two. Three of the Hop- Captain last two years . . . Held<br />\nkins victories were by falls. Mary- state championship of both broad<br />\nland earned one by a fall and one by jump and high jump . . . Also played<br />\ntime advantage decision.<br />\nfcur• years of varsity soccer . . .<br />\nA real exhibition of their brawn<br />\nand wrestling prowess and ability Picked All-State center-half . . . At<br />\nwas put on by the Jay men. The Brown: Frosh football and track, 155<br />\nquickest fall was registered by L. pound Brown wrestling champ, varEdwards when he toppled Brady<br />\nsity track three years . . . Captained<br />\nwith a double bar in 48 seconds.<br />\nteam last year . . . Ad lib: (1) In<br />\nSUMMARY<br />\neight years of high school and col1/8 Pounds—Grauer by default<br />\ndual meets, Bernie was undelegiate<br />\n126 Pounds—Rosenstein over Rouse<br />\nbroad jump . . . (2) He avin<br />\nfeated<br />\nwith bar and half-nelson-7m. 38s.<br />\nevents per meet throughsix<br />\neraged<br />\n135 Pounds—Gelber and Foremen<br />\ncareer . . . Competed in every<br />\nout<br />\n(Md.) drew.<br />\ntrack event except pole vault and<br />\n145 Pounds—Edwards threw Brady.<br />\ndouble bar-45s.<br />\n155 Pounds—McDaniel threw Edwards (Md.), crotch and halfnelson-6m. 46s.<br />\n165 Pounds—Dippel (Md.) defeated<br />\nClautice by time advantage of<br />\n5m. 55s.<br />\n175 Pounds—Barnett defeated Jones<br />\nby time advantage of 5m. 31s.<br />\nHeavyweight—Males (Md.) threw<br />\nLamble with double arm lack--7m. 38s.<br />\nN. B.—All Hopkins men won unless<br />\notherwise noted.<br /><br />\nW<br /><br />\nS. P. E., 29; Alpha Delta Phi, 5<br />\nD. U., 29; 0. K. 0., 14<br />\nPhi Gamma Delta, 21; Delta Phi, 9<br />\nPhi Sigma Delta, 9; T. A. 0., 4<br />\nPhi Lambda Phi, 21; Phi Kappa<br />\nPsi, 7<br />\nBeta Theta Pi won by forfeit from<br />\nTau Alpha Phi<br />\nKappa Alpha, 13; A. T. 0., 9<br />\nVOLLEYBALL RESULTS:<br />\nS. P. E., 15; Alpha Delta Phi, 7<br />\nD. U., 15; 0. K. 0., 11<br />\nDelta Phi, 15; Phi Gamma Delta 10<br />\nT. A. 0., 15; Phi Sigma Delta, 11<br />\nPhi Lambda Phi, 15; Phi Kappa<br />\nPsi, 0<br />\nBeta Theta Pi, 15; T. A. Phi, 0<br />\n(forfeit)<br />\nA. T. 0.0.5; Kappa Alpha, 6.<br />\ntwo-mile . . . Specialty is broad jump.<br />\nTook fourth place in Intercollegiates<br />\nbroad jump last winter . . . So far<br />\nhas bettered Hopkins broad jump and<br />\njevelin records . . . Recipient of the<br />\nRhodes Scholarship for '36 . . .<br />\nBernie's the nearest thing to perfect yet.<br /><br />\nHERE'S THE BOWL, AND<br /><br />\nDUKE<br /><br />\nUNIVERSITY<br /><br />\nDURHAM, N. C.<br />\nFour terms of eleven weeks are given<br />\neach year. These may be taken consecutively (graduation in three years)<br />\nor three terms may be taken each year<br />\n(graduation M four years). The entrance requirements are intelligence,<br />\ncharacter and at least two years of<br />\ncollege work, including the subjects<br />\nspecified for Grade A Medical Schools.<br />\nCatalogues and application forms may<br />\nbe obtained from the Dean<br /><br />\n98e<br /><br />\nHERE'S THE FILTER THAT<br />\nMAKE THE IMPORTED BRITISH<br /><br />\nBUTTNER<br /><br />\nTHE COOLEST,<br />\nSWEETEST<br /><br />\nSCHOOL OF MEDICINE<br /><br />\nLost, Strayed, Or Stolen<br /><br />\nY owsah, folks, an athlete, scholar,<br />\nand prince, if there ever was one- -<br /><br />\nINTER-FRATERNITY BASKETBALL RESULTS:<br /><br />\nMail orders<br />\nfilled or call<br />\nCalvert1166<br /><br />\nPIPE SMOKE YOU EVER HAD.<br /><br />\n7<br /><br />\nC<br /><br />\nCigar, Cigarette and<br />\nPipe Smokers all say<br />\nthat a \"Buttner<br />\nSmoke S' gives the<br />\ngreatest enjoyment<br />\nof any. Try it today.<br />\nPricewith extra filters<br /><br />\nPipe Shop,<br />\nFirst Floor<br /><br />\nHOCIIISCIHRLD,KOIHIN 4,V CO.<br /><br />"}], "field_media_file": [{"target_id": 38998, "display": null, "description": null, "target_type": "file", "target_uuid": "070e1943-0d75-46c6-a555-b5eacaf58db1", "url": "http://digital.library.jhu.edu/system/files/2022-03/12674-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12674, "target_type": "node", "target_uuid": "f31900a1-6567-45f0-9e49-8a14b70cd9c9", "url": "/node/12674"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "fc59c790-f771-4a8b-b287-e2304d82544e"}]}