{"mid": [{"value": 35547}], "uuid": [{"value": "db85be6a-a268-4fba-aa33-06215990d819"}], "vid": [{"value": 35547}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:08:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12102-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:08:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:08:24+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "mug<br />\n<br />\nvol. H. I 1. I I. I t<br />\n<br />\nJANUARY 13th, 1898. ItItIti No.7.<br />\n<br />\ntbe<br />\n<br />\n3ry)<br />\n<br />\nNicuisAirfettcr<br />\n<br />\n).<br />\n<br />\n• V•<br />\n<br />\n•<br />\n<br />\nPublished by Students of<br />\n<br />\n:0'<br />\nPress of<br />\nGuggenheimer, Well & Co.<br />\n<br />\nhe°<br />\nF.<br />\n<br />\nflo THE JOHNS HOPKINS<br />\n+ UNIVERSITY<br />\n<br />\n01((<br />\n_<br />\n<br />\n—<br />\n<br />\n•<br />\n11° it*<br />\n<br />\nMoor._<br />\n<br />\nBALTIMORE<br />\n<br />\nItIt<br />\n<br />\nFORTNIGHTLY<br />\n<br />\n\fTHE UNIVERSITY SCHOOL 1.21(BOYS<br />\nW. 8. MARSTON, A. II and C. R..<br />\n710 and 712 Madison Ave.<br />\nPrincipal.<br />\nils scisoot. prop.el boys for &Williston to the John. Hopkins or any Ulitrorsity or<br />\nHopkins alone.<br />\nar Scientific School. It hari tittret more than one hundred tor the Joh.Technology.<br />\nthe<br />\n1, Yak, Princeton, the Hamsechneette Institute of<br />\n.I. and many for H<br />\nTroy Polytechnic and other College+ and Schools. In October, 11511441, two of the flee<br />\nsallolarahlpa givell at the John. Hopkins to new inetriouletes, were aw•I'lleil to Its pupils. It<br />\nhe a good laboratory •nri a well equipped gyinnaellint, Whiall is under the charge of•<br />\ntent histructor. Po, further I nfornistion or for catalogues, address the Principal, at No. mil<br />\nN. Calvert Street.<br />\n<br />\nB. G. ElCHELBERGER,<br />\nBOOKS AND FINE 8TATIONBRY.<br />\n308 N. CHARLES ST.<br />\n<br />\nOak/noire<br />\n<br />\n!initiator°, Md.<br />\n<br />\n•<br />\n<br />\nThe professors and students of the johns Hopkins<br />\nto examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701,703 and<br />\n705 Madison avenue, cor. Eutaw st.<br />\nTelephones—B. & P. 817; Home 6083.<br />\n<br />\nUniversity will find it to their advantage<br />\n<br />\n(400000 maw wstacksor.)<br />\n<br />\nCushing & Company<br />\n<br />\nThe Society Paper of Baltimore.<br />\n<br />\nBOOKSELLERS<br />\n<br />\nANU<br />\n<br />\nSTATIONERS<br />\n<br />\n34 WEST BALTIMORE STREET.<br />\nICIROOL, LAW, MIDIOAL, AND OLASSIOAL AND NINOILLANNOU8 11001Lt.<br />\nused In Johns Hopkins University, Julius<br />\nLiloapitel, and The Woman's 001100 or Bann....<br />\n<br />\nKeep constantly on hand the Text Hooks<br />\n<br />\nBRIGHT AND BREEZY.<br />\n<br />\nIll'AlIONSitif..--1,11<br />\n<br />\nSchool,<br />\n<br />\nlilopkias<br />\n<br />\nValidly. Wino and<br />\n<br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\nThejohns Hopkins University. Circular containing announcement.<br />\n. . of the Collegiate and Graduate courses offered for the aca-<br />\n<br />\n. . demic_year beginnin October tsti_xl, maybe had on application to the Registrar of thejohns Ho_akins University.<br />\n<br />\nJUST<br />\nTWO THOUGHTS<br />\n<br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of the Johns Hopkins Medical School mai also<br />\n. . be had on application to the Registrars.<br />\n<br />\nINTERESTING TO GOOD DRESSERS.<br />\nThe<br />\n<br />\nTUXEDO<br />\nSUIT<br />\n<br />\nis comfort, style and service in cloth. We studied<br />\nto make them beautiful<br />\nand have succeeded.<br />\n<br />\nOur OVERCOATS<br />\nare their own argument<br />\nfor warmth, wear and<br />\nstyle. Off-and-On easy<br />\nis our idea that helps<br />\nmake them popular.<br />\n<br />\nI?„a#a<br />\n<br />\nI°.<br />\n<br />\nde<br />\n<br />\np.<br />\n<br />\nDeveloping<br />\nand<br />\nPrinting.<br />\n<br />\noe<br />\n<br />\nTHE CUMMINS.<br />\nPHOTO-STOCK CO,<br />\n<br />\n,<br />\n4„N CHARLES....<br />\n<br />\nYou Fairly Fly on<br />\n<br />\na \"Keating<br />\n111111011/111<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br />\n<br />\n_ .<br />\n. Text Books<br />\n. Note Books .<br />\n<br />\nStudents' Supplies<br />\n<br />\nMadison & Howard Sts.<br />\n<br />\n106 N. Charles St.<br />\n<br />\nBALTIMORE Mb.<br />\n<br />\nDOMESTIC -<br />\n<br />\nOPPOSITE UNIVERSITY.<br />\n<br />\nCameras & Supplies.,<br />\n<br />\nhi<br />\n<br />\nCigars -<br />\n<br />\nNo. 402 DRUID HILL AVENUE,<br />\n<br />\nTAILOR *No DRAPER<br />\n<br />\nPNotoGRAPH Icsu ppo Es fo.<br />\n<br />\n- IMPORTED<br />\n<br />\nCisarettele and Tobacco,Smokers'Articles.<br />\n<br />\nJOHN R. LEMMERT,<br />\n14 E. FAYETTE Si-.<br />\n<br />\nJ. HARRY RICHTER,<br />\n<br />\n41<br />\n<br />\nGrand\"<br />\n<br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain \"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO„ m N. Charles St.<br />\nBaltimore Hardware Co., Baltimore & Greene Sts.-Branch.<br />\n<br />\n\fANN.—<br />\n<br />\nI5<br />\nOr<br />\nORO,<br />\nthe<br />\n<br />\nZbe liFtewe raetter.<br />\nVol. II.<br />\n<br />\nFortnightly<br />\n<br />\nThe bathroom will contain two needle baths<br />\nand six shower baths.<br />\nThere was some disappointment among the<br />\nThe large second-story room will be used<br />\nstudents, when they found after the Xmas re- for various purposes. The trophies won by the<br />\ncess that the Gymnasium building was still un- Hopkins athletes, and especially those won by<br />\ncompleted. Their patience will have to be ex- the teams, will here be permanently exhibited.<br />\ntended over two more weeks, for not until then The Athletic Association will hold its meeting<br />\nwill the cage and locker-room be ready for use. in this room, and from it visitors can overlook<br />\nMeanwhile it may be a consolation to the stu- the gymnasium and the cage. It is an ideal<br />\ndents to see on paper all the advantages pro- room for fencing, with its large sky-light and<br />\nvided by generosity of the students. Many of windows on three sides. Fencing lessons will<br />\nthe facts about the building have been pub- be given by Dr. Crenshaw's assistant in gymlished before, and we shall avoid, as far as pos- nastics, a member of the German Turnverein.<br />\nsible, any repetition.<br />\nThe whole building can be lighted either by<br />\nThe track will be 233 1-2 feet long,thus mak- gas or electricity. As soon as the University<br />\ning 18 laps to a mile. It will have a coarse cin- gets a larger plant of its own, the gas burners<br />\nder foundation with finer strata of cinders will probably be entirely displaced by arc lamps<br />\nabove, and a surface layer of fine cinders and and incandescent lamps. The heating is done<br />\nclay. The ends and turns of the track will be by the Flenum system of indirect heating in an<br />\nbanked one foot, and the curves will form \"indirect\" chamber, the air constantly driven<br />\nsemi-circles, with diameters of 52 feet.<br />\nin by a fan, and distributed over the building<br />\nOn the North wall of the cage there will be through galvanized iron ducts.<br />\nAttendance on gymnasium work is compulSpace for three or four handball courts. The<br />\nfor the Freshmen, and we hope that it may<br />\nsory<br />\ntennis courts will be laid out later in the season,<br />\nfor all undergraduates. All men playing<br />\nso<br />\nbe<br />\nwhen the floor will be worn smooth and hard<br />\nby constant use. A box for the vaulting poles on teams have to come up to a certain standard<br />\nof gymnasium work, and any undergraduate<br />\nwill be placed in the cage.<br />\nThe gymnasium proper has somewhat less who is not able to reach a fixed standard of<br />\narea than the former building, but is practi- strength, will be compelled to attend the gymcally roomier, since all running and jumping nasium regularly.<br />\nThe students'smoking room is one of the<br />\nwill be done in the cage. Three hundred dolpleasing features of the new building.<br />\nmost<br />\nlars' worth of new apparatus has been purapparently knew the charms of<br />\narchitects<br />\nThe<br />\nchased. The two striking bags, the inclines,<br />\nand the new arrangements of the ladders de- an open fire, when they designed the handsome<br />\nserve special attention. Two ladders in the fireplace. It remains for the students to make<br />\nnorth corners of the gymnasium reach directly proper use of the room, and to improve it as<br />\ndown into the large locker room. Two hun- much as possible. Several proposals have been<br />\ndred and fifty lockers will be provided for the made to this effect. It seems to us that a pair<br />\npresent, and more can be added at convenience. of old andirons, a fender and some hickory<br />\nwood are the first things needed to complete<br />\nThey will be four feet high, 15 inches wide, and<br />\n18 inches deep; while 50lockers will be five feet the room. The several classes would earn the<br />\nhigh for the purpose of holding lacrosse sticks. gratitude of hosts of future. students by proNear the east window of the basement Profes- viding these requisites for the fireplace. The<br />\nsor Doyle of the B. A. C. will give wrestling les- hickory wood could be furnished by subscription among all the lovers of an open fire.<br />\nsons twice a week.<br />\n<br />\nSOME FACTS ABOUT THE CAGE.<br />\n<br />\n,140<br />\n<br />\nA.<br />\n<br />\ntta.o.<br />\nit-<br />\n<br />\nNo. 7<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS -LETTER.<br />\n<br />\nSingle students can make their names immortal by giving pictures, curtains, and all the<br />\nother things that make a room look cheerful<br />\nand hospitable. Each class can add to the wall<br />\ndecorations its shield in shape of an enlarged<br />\nclass pin.<br />\nSome men may contend that the ornaments<br />\nwould be broken in the course of pot socials or<br />\nclass fights. The wise and far-seeing faculty<br />\nprevents all damages by forbidding any kind of<br />\nclass rush, fighting or boxing under the roof<br />\nof the gymnasium.<br />\nHOPKINS AND HARVARD.<br />\nIn the columns of THE NEWS-LETTER several articles have appeared offering various<br />\nsuggestions for the promotion of college spirit<br />\nand mutual fellowship among the students at<br />\nthe University. However admirable these suggestions may be, they will surely prove useless<br />\nunless they fall upon fruitful soil. All of us are<br />\naware of a certain diffidence on the part of<br />\nHopkins men, whenever a comparison is<br />\ndrawn between their own institution and the<br />\nlarge and wealthy colleges of the North. Of<br />\ncourse, they are proud of the position occupied<br />\nby Johns Hopkins in the field of learning; but<br />\nas soon as the conversation turns upon those<br />\nqualities that go to make up a college in the<br />\npopular sense, they assume an apologetic attitude. Until this distrust has been removed,<br />\nwe cannot execute with any zest the schemes<br />\nfor improving our athletic standing and advancing the interests of the University by<br />\nother means, and the best way to remove it is<br />\nto show that it is unwarranted by the facts.<br />\nLet us take Harvard as an example. It is<br />\nthe largest, the oldest, the wealthiest of American universities ; it has more students in a<br />\nsingle class than the Hopkins in all its departments ; it has a beautiful campus and magnificent dormitories; and yet most Hopkins men<br />\nwould be surprised to see in how many respects it is inferior as a college to their own<br />\nAlma Mater.<br />\nThe chronic state of affairs<br />\namong the students at Cambridge is what a<br />\nwriter in Scribner's has termed \"Harvard indifference.\" \"If the football team has been<br />\nbeaten, we are sorry, to be sure ; but, after all,<br />\n<br />\nthe loss falls upon the University, and not<br />\nupon us \"—that is the sentiment which their<br />\nactions and sometimes their words express.<br />\nThis fact is easily accounted for by the immense size of the institution, by the complicated system of social clubs, with its \"inner<br />\ncircles\" and wheels within wheels, and perhaps by a certain Northern stolidity of temperament. The important point for us is that<br />\nnone of these causes exists or is every likely to<br />\nexist at the Johns Hopkins.<br />\nIf, then, this is the condition which prevails<br />\nat so old and celebrated a college as Harvard,<br />\ncan we not disabuse our minds of the notion,<br />\nfostered by Yankee school teachers, that, in<br />\ncomparison with our larger rivals, the Hopkins has no college spirit ? Doubtless, we<br />\nhave still much room for improvement; but<br />\nwe are far better, relatively speaking, than we<br />\nhave been artfully led to believe.<br />\nARTHUR W. MACHEN, JR.<br />\nTHE PASSING OF THE YEAR.<br />\nI.<br />\n<br />\nTwilight—<br />\nOf the darkening firelight ;<br />\nSilence — thickening with the thickening<br />\ngloom.<br />\nRevery—<br />\nGiving soul to every<br />\nFlickering shadow in the dusky room.<br />\nJarring—<br />\nIts way through hush-clouds, warring—<br />\nA sound bursts forth—for heavy the charring<br />\nlog has sunk.<br />\nAnd elate<br />\nO'er their victim prostrate<br />\nThe fire-worms madly gnaw along its trunk.<br />\nFlaring,<br />\nA thin blue flame, despairing,<br />\nLeaps from the log; and upward and away<br />\nHas darted.<br />\nAnd so—their soul departed—<br />\nGather the ashes up, all cold and gray—<br />\nCast them away.<br />\nit<br />\n<br />\nS.,1,<br />\n<br />\n.<br />\n198<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\niot<br />\neir<br />\n!ss.<br />\nm)1iler<br />\nereriat<br />\nto<br />\nus<br />\n7d,<br />\nin<br />\np-<br />\n<br />\nAre<br />\nut<br />\nve<br />\n<br />\n.<br />\n<br />\nc<br />\n<br />\nNEWS OF A FORTNIGHT.<br />\nTHE PUBLIC DEBATE AT EASTER.<br />\nAt the meeting of the House of Representatives Wednesday, January 5, Mr. Censor announced that there would be a public debate<br />\nat Easter between the classes of '98 and '99.<br />\n\"Dr. Adams,\" he said, \"has kindly given, as<br />\nprizes for the contest, three gold medals and a<br />\ntrophy, in the form of a mahogany tablet, with<br />\nSilver trimmings.\" A vote of thanks was extended by the House to Dr. Adams for his<br />\nmunificent gifts. The House voted that there<br />\nShould be nine men to represent the class in<br />\nthis debate. Six, who will be regulars or alternates, will be chosen by the Censor, purely on<br />\ntheir merits, and three, who are to act as advisers, will be elected by the House. The<br />\nnames of all nine, if they are successful, will be<br />\nengraved on the trophy, which is to be placed<br />\nin the Donovan Room, McCoy Hall. The<br />\nquestion which is to be debated at Easter will<br />\nbe debated three times in the House, to insure<br />\na clear interpretation and forcible presentation of the subject.<br />\nThe impeachment of Mr. Kaufman created<br />\nquite a stir in the House. The charges are,<br />\nbriefly, that Mr. Kaufman is, as a freshman,<br />\nnot eligible to attend the meetings of the<br />\nHouse; that he has not the consent of the<br />\nCensor, which would enable him to attend.<br />\nThe attorneys appointed for the defense are<br />\nCongressmen Fisher, Guggenheimer and<br />\nRoss ; for the prosecution, Congressmen Mullen and Grimes. The trial, which will take<br />\nPlace at the next meeting of the House, will<br />\nbe open to members of other classes, only by<br />\nspecial permission of the Censor.<br />\nThe regular debate proved interesting, and<br />\nwas debated with considerable zeal and dexterity. The question was : \"Resolved, That<br />\ncapital punishment ought to be abolished.\"<br />\nThe affirmative was taken by Congressmen<br />\nR emsen and Keidel ; the negative by Congressmen Krager, Murkland and Davinson.<br />\nThe negative side, by their better presentation,<br />\nwon the debate. The affirmative side was,<br />\nhowever, somewhat handicapped by the absence of one of their number.<br />\n<br />\n3<br />\n<br />\nTHE AMERICAN HISTORICAL ASSOCIATION.<br />\nThe American Historical Association held<br />\nits thirteenth annual convention in Cleveland<br />\nduring the Christmas holidays. A number of<br />\nHopkins men attended. Out of 35 different<br />\nannouncements of papers on the programme,<br />\nno less than 14. were by representatives, past<br />\nand present, of the Johns Hopkins University.<br />\nRecent graduates of the University, who had<br />\na place on the Cleveland programme were Dr.<br />\nJ. M. Callahan, who this month assumes the<br />\nduties of Historical Professor at Hamilton<br />\nCollege, Clinton, N. Y.; Dr. Franklin L. Riley,<br />\nwho has lately become Professor of History in<br />\nthe University of Mississippi; and Doctors B.<br />\nC. Steiner, J. C. Ballagh, and John H. Latane,<br />\nnow resident in Baltimore.<br />\nThe Association now numbers about one<br />\nthousand picked members, all chosen on nomination by existing members. There are over<br />\none hundred life members. Among these are<br />\nPresident McKinley and ex-President Cleveland. The chosen President for the current<br />\nyear is George P. Fisher, of Yale University.<br />\nDr. James Schouler, of the Johns Hopkins<br />\nUniversity, retires from the Presidency of the<br />\nAssociation into the Executive Council for<br />\nlife. Chief Justice Fuller, already a member<br />\nof the Association and a regent of the Smithsonian Institution, was elected a member of<br />\nthe Executive Council. The next meeting<br />\nwill be held in the new building of the New<br />\nHaven Historical Society during the Christmas holidays of the current year.<br />\nProfessor Moore, instructor here in economics for the year 1896-'97, and now Professor at Smith College, is delivering a course of<br />\ntwelve lectures on the \"Mathematical Methods<br />\nin Economics\" at the Hopkins. Professor<br />\nMoore was one of the most popular of the<br />\nyounger instructors while at the Hopkins, and<br />\nhis resignation was a source of universal regret, though his call to fill a very prominent<br />\nchair at Smith afforded a pleasing instance of<br />\nhis popularity and showed his recognized<br />\nability.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\nebe Petupletter.<br />\nPublished Portnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe greater the number of men who take regular exercise, the greater will be the interest in<br />\nall forms of athletics.<br />\n<br />\nJANUARY 13, 1898.<br />\nSubscription $1.50 per year. Is cents a single copy.<br />\nEditor in Chief,<br />\nAssistant Editor in Chief, Consulting Editors, -<br />\n<br />\nEDGEWORTH SMITH,'98.<br />\nALBERT C. DIEFFENBACH,'98.<br />\nProf. KIRBY P. SMITH.<br />\nGm C. MORRISON,'90.<br />\n<br />\nDEPARTMENT EDITORS.<br />\nG. L. P. RADcLiFys,<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nH. V. BLACK,<br />\nW.T. LONOCOPE, 1. Medical School.<br />\nC. K. Wusms,JR.<br />\nY. A. RENour,'98.<br />\nR. D. MILLER,'98.<br />\nP. J. CLTINET,'98.<br />\nJ. C. FRENCH,'99.<br />\nJ. H. KING, '99.<br />\nE. A. SPILMAN, 99.<br />\nBusiness Manager,<br />\nR. H.GRIMES,'99.<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 238, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br />\n<br />\nA petition has recently appeared which recites the difficulties heretofore met with in the<br />\nequipment of teams, and the raising of guarantees, and seeks to provide a remedy. The<br />\ntrustees are asked to charge a locker rent of<br />\nfive dollars, to prohibit the use of the gymnasium and cage to all who do not rent lockers, and to devote the money so raised to the<br />\nneedy cause of team athletics. This is a wellmeant, but misguided, effort. The possibility<br />\nthat the trustees would grant such a petition,<br />\neven if it were generally signed, seems very<br />\nremote.<br />\nIt rests upon a complete misconception of<br />\nthe purpose of college athletics. The gymnasium is designed to give to students, whose<br />\nlives are sedentary, the exercise necessary to<br />\ngood health. Inter-collegiate sport is a legitimate, hut by no means essential, outgrowth<br />\nof this principle. It would be unreasonable<br />\nand unjust to enforce from a student who<br />\nchooses to confine his exercise to chestweights and clubs, a contribution to the expenses of the teams. The lockers should be<br />\nfree, and every encouragement should be offered to the use of the gymnasium and cage.<br />\n<br />\nPresident Gilman.has presented his twentysecond annual report, of which we can only say,<br />\nread it. Many students have but vague ideas<br />\nof the work which is being done at this University. Often they are those very ones who<br />\nare always crying out on the lack of college<br />\nspirit. College spirit is a word which, we believe has never been defined, and which is accompanied by conceptions in different minds.<br />\nFor some men it is merely a form of rowdyism,<br />\nfor others, athletic enthusiasm, for many both<br />\nof these. Again, the different forms of class<br />\nfeeling are by many believed to constitute the<br />\nessence of college spirit. To us it seems that<br />\nloyalty to the University in all of its phases is<br />\ntrue college spirit. Uphold the honor of your<br />\nAlma Mater in all possible ways, spread her<br />\nfame wherever you may live, at present or in<br />\nthe future. This can be well done only by men<br />\nwho know of the work accomplished in all the<br />\ndepartments, and the quickest way of gaining<br />\nthis knowledge consists in reading over such<br />\npublications as the President's report.<br />\nTHE NEWS-LETTER remarks a growing anxiety among certain seniors lest those good old<br />\nclays when the \"pot social\" was in our midst<br />\n(or we in its) may have already gone into history, and taken with them, also, those rejuvenating times when juniors, in spite of freshmen,<br />\nand freshmen on the sly, got together to make<br />\na joyful noise about the board, under the special inspiration of a clever deduction of Vinunt<br />\nvos liberabit from the University motto and the<br />\ngenerally accepted proverb, In vino veritas.<br />\nIs there any ground for this anxiety? Have<br />\nfreshmen and juniors at last succumbed to the<br />\nomni-stifling power of respectability ? Will<br />\nno more gallant youths make \"hairbreadth<br />\n'scapes i' the imminent deadly breach\" of a<br />\ncar window, or boldly scour the country 'round<br />\nin search of some windmill to attack? 'Tis<br />\npity ! We must have some little excitement<br />\nto break the dull monotony of the knowledgesyphous ceaseless flow. The sight of red-<br />\n<br />\n\fTHE NEWS—LETTER.<br />\negt in<br />\n<br />\n;ay,<br />\n[eas<br />\nTnivho<br />\nege<br />\nbeacids.<br />\n3m,<br />\nDth<br />\nass<br />\nthe<br />\nhat<br />\n; is<br />\n)Ur<br />\ner<br />\nin<br />\nten<br />\n:he<br />\nng<br />\n[ch<br />\n<br />\nsweatered young gladiators scurrying down<br />\nthe deserted streets in the stillness that precedes the dawn cannot fail to quicken the pulse<br />\nof the most sluggish, while to the imaginative<br />\nit suggests very vividly those grand old days<br />\nWhen Claudius and Milo were under contract<br />\nto show Rome a good time.<br />\nWhat means this shameful lethargy ? Is<br />\nninety and nine safe within the fold, and will<br />\nnaughty naught do naught that's naughty?<br />\nRobinson and McGraw have consented to<br />\ncoach the baseball team. Hopkins has not<br />\nhad such an opportunity before, and all candidates should take advantage of such coaching and develop rapidly. At present Robinson<br />\nand McGraw know more of baseball than any<br />\nother two men in the business. There is no<br />\nreason why Hopkins cannot win the State<br />\nchampionship or do even better under,such<br />\ncoaches and such a reliable captain.<br />\nDISCOVERED AT LAST.<br />\nTHE NEWS LETTER, a new exchange from<br />\n<br />\nthe Johns Hopkins University, is an attractive<br />\nand readable little paper.—Normal College<br />\nEcho.<br />\n<br />\n[x-<br />\n<br />\nlst<br />\nisn-<br />\n<br />\nke<br />\n)ent<br />\nhe<br />\n<br />\n%re<br />\nhe<br />\nill<br />\nth<br />\na<br />\n<br />\na<br />\nht<br />\nC1-<br />\n<br />\n5<br />\n<br />\nwe owe to our University in return for the<br />\nbenefits she bestows on us is to prove ourselves in all respects her worthy representatives. Yet the men here persistently neglect<br />\nthe one thing which will both improve themselves physically and at the same time add to<br />\nHopkins' reputation.<br />\nPerhaps it may be said that Hopkins needs<br />\nno athletic standing. True, we might not be<br />\nseriously injured as a College by the loss of<br />\nour teams, though the loss to the individual<br />\nmen would be great.<br />\nBut there is a consideration more important<br />\nthan that. In fact, the johns Hopkins does<br />\nplace teams on the field every year, and it is a<br />\nwoeful fact that we have to submit to defeat<br />\nat the hands of second-rate colleges. This<br />\nshould move every student to make all possible efforts for the improvement of our athletic standard.<br />\n<br />\nA GRADUATE STUDENT.<br />\nThe class of 'goo held A meeting Wednesday, January 5. The class elected Carroll<br />\nWight captain of the indoor baseball team,<br />\nwith the authority to choose a manager. Roland Abercrombie was elected member of the<br />\nHouse Committee of the new gymnasium.<br />\nThe meeting was well attended.<br />\n<br />\nA GRADUATE ON GRADUATES.<br />\n<br />\nThere seems to be an idea among the graduate students of the Hopkins that they have<br />\nno part in the affairs of the College in general.<br />\nThere was never a greater mistake. Graduates, as well as undergraduates, should, as<br />\nstudents of the Hopkins, lend aid to everything which concerns our College. Why<br />\nshould graduate students who are here to<br />\nenjoy the splendid advantages offered by the<br />\nUniversity feel that it is not their duty to do<br />\nwhat they can to advance her interests ? This<br />\nwe fail in many ways to do probably most<br />\nnoticeably in the line of athletics. To be sure,<br />\nthis is not the main end of a graduate student's<br />\nexistence, Other things should, as they do,<br />\nclaim our first attention. But anyone must<br />\nadmit the value of a trained body, such as is<br />\ngained through outdoor sports, and the least<br />\n<br />\nINTERESTING STATISTICS.<br />\n<br />\nProfessor S—.<br />\nIn reply to Mill's theory, statistics show that<br />\nwomen who are college graduates marry as<br />\noften as other women.<br />\n(Prolonged break in the lecture while the<br />\nProfessor makes laborious efforts to explain<br />\nwhat he means, and the class makes as laborious efforts to follow his tangled line of<br />\nthought).<br />\nMary had a little wheel,<br />\nIt wobbled so at random<br />\nShe gave it up and hired a man<br />\nTo haul her on a tandem.<br />\n—Exchange.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\nATHLETICS.<br />\nGYMNASTICS AND ATHLETICS.<br />\n<br />\nOn the 31st of December, 1897, there met at<br />\nthe Knickerbocker Club in New York, the directors of the gymnasiums of many of the<br />\nlarger colleges and universities.<br />\nA preliminary meeting had been held on<br />\nNov. 6, and invitations issued to the principal<br />\ncolleges and universities in the country to send<br />\nrepresentatives on the above date. Almost all<br />\nsent letters expressing a thorough sympathy<br />\nwith, and great interest in, the meeting. It was<br />\nsufficient, however, that the pioneers in this<br />\nwork, Dr. Dudley A. Sargent, of Harvard; Dr.<br />\nEdward Hitchcock, of Amherst; Dr. W. G.<br />\nAnderson, of Yale; and men from colleges<br />\nwhich are following in the footsteps of these institutions were present.<br />\nThe object of this meeting was to organize<br />\nan association to be known as the \"Society for<br />\nthe Advancement of Physical Culture in Colleges.\" For some time past gymnasium directors have felt that the \"American Association<br />\nfor the Advancement of Physical Education,\"<br />\ncovered too broad a field and was not giving<br />\nthem just what they needed, and what they expected. To fill this much-felt requirement, the<br />\n\"Society for the Advancement of Physical<br />\nCulture in Colleges\" had been organized. The<br />\nmen who compose it, must be members of the<br />\nparent organization and no gymnasium in,structor can become a member who has not<br />\nfollowed gymnastics as a profession for at least<br />\ntwo years. The new society will concern itself<br />\nwith gymnasium work alone, and thus directors will be brought closer together, methods<br />\nwill be criticised, and, best of all, a common<br />\nstandard will be adopted and arrived at by all.<br />\nA constitution and by-laws were adopted,<br />\nunder which Dr. Jay Seaver, of Yale, was elected President; Dr. Watson Savage, of Columbia, Secretary-Treasurer. These officers, with<br />\nDr. Sargent, of Harvard, and Prof. Cann, New<br />\nYork University, will constitute the council, or<br />\nmanaging board.<br />\nTwo papers were read—one by Dr. Anderson, on \"Terminology,\" the other by Dr. Sar-<br />\n<br />\ngent on \"Strength Tests.\" Dr. Sargent, who<br />\nwas chairman of the committee appointed at<br />\nthe first meeting, read a report which, after<br />\nconsiderable discussion, was adopted by the society. This report -adopts the following<br />\nstrength tests:<br />\nr. Strength of right and left hands.<br />\n2. Strength of back.<br />\n3. Strength of legs.<br />\n4. Strength of lungs.<br />\n5. Strength of biceps and triceps, as shown<br />\nby the number of times a person can pull up<br />\non a horizontal bar, and push up on the parallel<br />\nbars. These two, added together, multiplied<br />\nby his weight in kilos and divided by ten is considered the strength of the chest and arms. Instead of strength of lungs. As no machine for<br />\ntesting the lung strength has been found at all<br />\nsatisfactory so far, one twentieth of lung capacity will be generally used.<br />\nThese measurements have all been taken at<br />\nHopkins University since the gymnasium was<br />\nfirst built. The main point of interest to gymnasium directors and to students is that Dr.<br />\nSargent and the Faculty of Harvard have enforced a certain standard of strength based in<br />\nthese tests as a condition of playing on teams.<br />\nThus in. order to play on a football team, or<br />\nrow in a boat crew, or contest in heavyweight<br />\nthrowing, a student must show a total<br />\nstrength test of 700 or over. In order to play<br />\nlacrosse or baseball, he must reach 600 or over,<br />\nand for track athletics, 500 or over. The directors who were present were asked to work on<br />\nthis basis in their colleges, and all agreed to do<br />\nso. When a student falls below these requirements he is debarred from a team, and no<br />\namount of favoritism can put him on instead of<br />\na man who has come up to the standard. The<br />\nonly thing for him to do then, is to work in the<br />\ngymnasium and bring his strength up to standard. In order to create interest in the \"strong<br />\nman\" the Society will offer a banner or medal<br />\nto the highest or greatest \"total strength\" made<br />\nby any one in the colleges. As an incentive to<br />\nour students, 1, Mr. Editor, will offer a prize to<br />\nbe competed for by the three classes.<br />\nIn your next edition, Mr. Editor, if you will<br />\n<br />\n\fTHE NEWS-LETTER.<br />\ngrant me space, I hope to present from my records the strength tests of some of the best<br />\nteams in the history of the University.<br />\nJ. B. CRENSHAW,<br />\nInstructor in Physical Culture.<br />\nrIARYLAND STATE RECORDS HELD Ent<br />\nHOPKINS STUDENTS.<br />\n<br />\n7<br />\n<br />\ncharacterized by a lack of team work, and<br />\nslugging was frequent on both sides.<br />\nIn the first half the puck was batted back<br />\nand forth from one end of the rink to the other, and neither side was able to score.<br />\nThroughout this half Walbrook showed a tendency to fall on the puck when it came near the<br />\ngoal, at one time as many as three men going<br />\ndown at once, Hodges' head was cut by the<br />\npuck.<br />\n. In the second half the puck stayed in Walbrook's territory most of the time, only going<br />\nonce or twice near Hopkins goal, and giving<br />\nScholl a chance to make a couple of brilliant<br />\nstops. Toward the end of the half Hopkins<br />\nmanaged to use a little team work, and in the<br />\nlast five minutes of play McInnes and Hodges<br />\neach made a goal for Hopkins.<br />\nIn the second half Wilson, Walbrook's<br />\npoint, sprained his ankle and Turner took his<br />\nplace. Purnell put up the best game for Walbrook, but had a bad way of running over the<br />\npuck; in fact both teams found it very hard<br />\nnot to leave the puck behind, in their haste to<br />\nscore. The defense was good on both teams,<br />\nand Scholl in particular put up a great game.<br />\nHodges and McInnes did best for Hopkins<br />\non the attack.<br />\nThe previous game with Walbrook, Dec. 21,<br />\nalso resulted in a victory for Hopkins, the<br />\nscore being 3 to 1. Hopkins is now tied for<br />\nsecond place, with a record of two gaiines won<br />\nand one lost.<br />\n<br />\nThe annual meeting of the Board of Amateur Athletic Records of Maryland was held at<br />\nCentral Branch, 17. M. C. A. Building, Friday<br />\nevening, Jan. 7. Among the best records made<br />\nHopkins men hold a goodly number.<br />\nFor indoor records, Robert Garrett holds the<br />\nrecord for putting 12-pound shot-46 feet 2<br />\n'inches; for standing broad jump, 9 feet 7 1-2<br />\ninches; for fence-vault, 6 feet ii inches; i6Pound shot, 43 feet 1-2 inches. Geo. Knapp<br />\nties with E. R. Owens for the best record for<br />\n35-yard dash, both having made the distance<br />\nIn 4 1-5 seconds. Henry M. Wilson holds the<br />\nrecord for one-half mile run, two minutes, fifteen and four-fifth seconds.<br />\nIn out-door records our boys have done well.<br />\nHenry M. Wilson holds the record for onehalf mile run, with two minutes nine and onehalf seconds; A. D. Gantz, two hundred and<br />\ntwenty yard dash, twenty-four and three-fifths<br />\nseconds;four hundred and forty yard dash also<br />\nheld by A. D. Gantz, fifty-five and three-fifths<br />\nseconds; Robert Garrett, Jr., the running<br />\nbroad jump,twenty-one feet eleven inches, and<br />\nthrowing the discus, one hundred and seven<br />\nfeet seven inches.<br />\nWhile in New York during the holidays<br />\nThis is quite a nice list of records and shows<br />\nwhat may be accomplished if the spirit in ath- William Maddren, captain of last year's<br />\nlacrosse team, chose five dozen lacrosse sticks,<br />\nletics is kept up.<br />\nwhich will be sold to students interested in that<br />\nMr. Maddren selected the best sticks<br />\ngame.<br />\nHOCKEY.<br />\nFlannery<br />\nhad, which fact is sufficient<br />\nthat<br />\nOn January 6th Hopkins defeated Walworth. Practice will begin<br />\ntheir<br />\nguarantee<br />\nof<br />\nbrook by a score of 2 to o. There was a very<br />\nsticks<br />\nas<br />\nthe<br />\nsoon<br />\narrive.<br />\nas<br />\nPoor attendance and the lusty Hopkins rooting, which was<br />\nlast year a feature of the games,<br />\nwas conspicuous only by its absence.<br />\nMessrs. Maddren and Simmons, who were<br />\nThe attendance was rather slim, but a few to represent Hopkins in the handball tournaHopkins rooters got up courage enough to ment in Brooklyn, thought it better to wait<br />\nyell in the second half. The whole game was and enter the Easter tournament in that city.<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\nDR. BAKER ON 11UNIC1I.<br />\n<br />\nMunich was the subject of an address delivered by Dr. Baker of the Modern Language<br />\nDepartment before the Historical and Political<br />\nScience Association last Friday evening. Dr.<br />\nBaker considers Munich the greatest art centre<br />\nin the world, easily outstripping Berlin, and<br />\nprobably even Paris. The growing supremacy<br />\nof Berlin in art is due partly to Emperor William's imperious interference in such matters in<br />\nBerlin, and partly to the impetus given to art<br />\nby the romantic and deeply lamented Ludwig.<br />\nTo say that a city is in Germany is equivalent<br />\nto saying that it is well governed. Munich is<br />\nno exception to this rule, and the business<br />\nmethods by which the internal government of<br />\nthe city are managed are a source of pride to<br />\nits inhabitants. The Mayors serve their apprenticeships, as it were, in smaller towns and<br />\ncities before they are called to the control of<br />\naffairs in Munich.<br />\nBusiness activity in Munich is noticeably absent. Almost the only signs of a brisk commercial life are shown by the one hundred<br />\nbreweries, which are taxed to their uttermost<br />\nto provide for the proverbial Teutonic thirst<br />\nfor \"Das Bier.\"<br />\nThe two features of Munich, which make<br />\nusually the most impression upon foreigners,<br />\nare the prevalence of cafe life and the numbers<br />\nof princes and implied connection between<br />\nthese is not necessarily inferred, yet they manage to exist very harmoniously together.<br />\nPrinces may be seen of all grades, classes and<br />\nconditions.<br />\nThe cafes constitute the principal \"rendezvous\" for all classes. One of the most perplexing questions for an unsophisticated American<br />\nis to know what title to use in addressing a native. It is a mortal offense to employ anything<br />\nelse than a person's highest title. A man's title<br />\nis always used in addressing his frau.<br />\nAt the conclusion of the address Mr. Renouf, of the class of '98, and the editorial staff<br />\nof the NEWS LETTER made a short talk based<br />\nupon personal reminiscences of a long residence in Munich. Mr. Renouf spoke df the<br />\nGerman fondness for Sunday picnics and ex-<br />\n<br />\ncursions. Whole families together go out in<br />\nthe country for several miles, and spend the<br />\nday wandering around and climbing mountains, and while occupied in the latter pursuit<br />\nquite a number fall and break their necks,<br />\n\"which pastime,\" Mr. Renouf curiously remarked, \"they enjoyed very much.\"<br />\nHERE AND THERE.<br />\nThe Business Manager of THE NEWS-LETTER can be seen at the office of the paper,<br />\nRoom 15, in the Administration Building on<br />\nHoward street, every Wednesday from 12 to<br />\nBills for this year's subscription<br />\n2 o'clock.<br />\nare out, and it is desired that returns be<br />\nR. H. GRIMES,<br />\nprompt.<br />\nBusiness Manager.<br />\nThe man who refuses to subscribe for a college paper and then reads it over the shoulders of his neighbor is short enough to tie his<br />\nshoe tring to his neck-tie.—Drury Mirror.<br />\nExcellent authority says that the kicking of<br />\ngoals after touchdowns will be eliminated by<br />\nthe rules committee at its next meeting, and<br />\nthe scoring will be changed to five points for a<br />\ntouchdown, four for a goal from the field, and<br />\ntwo for a safety.—Exchange.<br />\n\"This world,\" the liar to the laggard cried,<br />\n\"Owes you a living. Snatch it if you can!\"<br />\n\"An earlier debt,\" the voice of truth replied,<br />\nMust first be paid. You owe the world a<br />\nman!\"—Exchange<br />\nSamson, the strongest man whom we read<br />\nabout in the good Book, was the first to advertise. He took two solid columns to demonstrate his stength, when several thousand people tumbled to his scheme, and he brought<br />\ndown the house.—The Miami Student.<br />\nMiss Allegro—He said I was a harp of a<br />\nthousand strings.<br />\nMiss Dolce—And what did you say?<br />\nMiss Allegro—I called him a lyre.<br />\nExchange.<br />\n<br />\n\fThe Bo'Lmtim SG hoot,<br />\n<br />\nRstatIi.shed<br />\n<br />\n.ARTHUR F. LAWRENCE & CO.<br />\n<br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. H., Hood Al ,Fst<br />\n<br />\nTelephone Call 182B.<br />\n<br />\nISMO.<br />\n<br />\nLeading Dealers in<br />\nscrovnisur<br />\n<br />\nThis school has a continuous history of over fifty years<br />\nIt was reorganized under its present management<br />\nin 1894.<br />\n<br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br />\n<br />\n6 W. SARATOGA STREET,<br />\nY. C. C<br />\n<br />\n5. SUILOIN,:,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMarpland CHU Insurance and Crust Co.<br />\n<br />\nN. ROSENBAUM,<br />\n<br />\nEQUITABLE BUILDING, BALTIMORE.<br />\nTELEPHONE 1376.<br />\n<br />\nPine Custom Tailor,<br />\nCLEANING AND REPAIRING.<br />\n<br />\nT. K. WORTHINGTON,<br />\nI,. M. DUVALL,<br />\nJESSE HILLRS<br />\nVice-Presideut.<br />\nPresident.<br />\nSec'v-Treas.<br />\n<br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br />\n<br />\nNo. 812 NORTH HOWARD STREET,<br />\nNear Madison Street,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br />\n<br />\nGIFFORD de JERSEY MESNY,<br />\n<br />\nDIRECTORS:<br />\nAlexander Brown.<br />\nEdgar 0. Miller,<br />\nrohn A. Whitridge,<br />\nJesse Mlles,<br />\nThomas Hill,<br />\nGeorge whitelock,<br />\nJacob I. Cohen,<br />\nC. C. Shriver,<br />\nE. H. Perkins,<br />\nIA. Goldenberg,<br />\nT. K. Worthington.<br />\nRates for Title Insurance furnished on application,<br />\n<br />\nTomorrow Is First Cousle to<br />\nThe sweet, sweet by and bye;<br />\nToday's the time for you to grab<br />\nThe bargains on the fly.<br />\nY. M. R.0. D.<br />\nThis great Reduction Sale of ours offers you the following bargains in Suits;<br />\nCheviot and Worsted Suits, made up in the most approved styles<br />\n—carefully lined throughout—sold for $22—redueed to $14.75.<br />\nCheviot and Worsted Suits that were bargains at $20—reduced<br />\nto $13.40.<br />\nCassimere and Cheviot Suits that attracted attention when sold<br />\nfor $18--reduced to $11.76.<br />\nCassimere and Cheviot Suits that pleased many patrons when<br />\nsold for 815—reduced to $10.75.<br />\nAnd than we have really excellent Suits that we have reduced<br />\nto 86.75.<br />\nPatent Beaver and Kersey Overcoats, beautiful goods, lined<br />\nthroughout with pure silk—sold for $15—reduced to $18.20.<br />\n820 Overcoats reduced to $14.75.<br />\n$16 Overcoats reduced to $10.75.<br />\nOvercoats of real goodness and durability reduced to 86.75.<br />\nA \"leader\" from our Furnishings Department for to-day only;<br />\nA surprising value in Stockings that formerly sold for 15e. per pair<br />\n—reduced to go. per pair; 3 for 260.<br />\n<br />\ntlea. L. Harrison,<br />\nPresident.<br />\n<br />\n226 NORTH CHARLES STREET.<br />\n<br />\nBuy your CIGARS, CIGARETTES AND SMOKING TOBACCO from<br />\n<br />\nHBFILD &<br />\nNORTH EUTAW ST., Ncxr Ooon re HOOHIN• UNIVIROITY<br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\notvE ns A CALL.<br />\n<br />\n639<br />\n<br />\nGENT'S<br />\nFINE FURNISHINGS<br />\n<br />\nIce<br />\n<br />\nhe Eutaw<br />\nA<br />\n<br />\nINAGINIER.<br />\n<br />\nLADIES'<br />\nFINE FURNISHINGS.<br />\nReduced Prices to suit the times<br />\n<br />\nLAnBuRa'S<br />\n611 N. HOWARD STREET,<br />\nBALTIMORE. MD.<br />\n<br />\nHAMBURGERS'<br />\n<br />\nrierchant Tailor.<br />\nSuits made to Order as Cheap as<br />\nReady-made Clothing.<br />\n<br />\nUse. P. Mordecai,<br />\nViee-President .<br />\n<br />\nArthur H. Hall,<br />\nSee'y and Treas.<br />\n<br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\nBALTIMORE, MD.<br />\nTelephone 2573.<br />\n<br />\nFlorist<br />\n<br />\n•<br />\n<br />\nBaltimore and Howard<br />\n'Ste.<br />\n<br />\nThe A.G. Alford Sporting Goods Co.<br />\n<br />\nNews<br />\nMusic?'<br />\nStore is<br />\n<br />\nArtist Photographer,<br />\n<br />\nA few doors South of Johns Hopkins University<br />\nS1ECIAL DISCOUNTS to Students<br />\nmentioning this advertisement.<br />\n<br />\nI. SON COHEN,<br />\n521 N. EUTAW ST.<br />\n<br />\n•<br />\n<br />\nArtistic Floral Arrangements.<br />\nChoice Cut Flowers.<br />\n<br />\nMRS. OTTO SCHULER,<br />\n322 WEST SARATOGA ST.,<br />\n<br />\nNEAR EUTAW,<br />\n<br />\nBALTIMORE.<br />\n<br />\nF1149s<br />\n<br />\nocaniters<br />\n<br />\nRepairing of any description at<br />\nReduced Prices.<br />\nSuits Pressed While You Walt.<br />\nPants Pressed.<br />\n15c.<br />\nSuits Pressed<br />\n50c.<br />\nSuits Cleaned<br />\n.0.00<br />\nWork called for and delivered.<br />\n<br />\nSISCO<br />\n218<br />\n<br />\n134J9es<br />\n<br />\nBROS.<br />\n<br />\nN. Charles Street,<br />\nBALTIMORE, MD<br />\n<br />\nOYSTERS I<br />\nMAC FARLANE'S<br />\nOYSTERS!• No. 740 N. EUTAW STREET,<br />\nMeals at All Hours.<br />\nOysters a Specialty.<br />\nBILL OF FAKE.<br />\nAT TABLE:<br />\n<br />\n10 with trimmings<br />\nB with trimmings<br />\n4 with trimmings<br />\n<br />\nIN BOXES:<br />\n<br />\n. 25c<br />\n15e.<br />\n10e.<br />\n<br />\n13 Large Fried<br />\n8 Largo Fried<br />\nti Large Fried<br />\n<br />\n.250.<br />\n10e<br />\n<br />\nMadison Cycle Co.—m.0mm •••<br />\n315 Madison St.<br />\nPOOL PARLOR,<br />\nNEAR<br />\n<br />\nRepairing. Sundries. Bicycles For Hire 25 cents per hour.<br />\nSpecial rates to Students.<br />\nNicely furnished rooms for Students.<br />\n<br />\n••••.,<br />\n<br />\nLucke ex Sons, Merchant Tailors,<br />\nNO. 205 E. FAYETTE STREET.<br />\nOPPOSITE THE NEW POST OFFICE.<br />\n<br />\nBALTIMORE.<br />\n<br />\nWe will insure the finest workmanship and styles in Tailoring as<br />\nalso well-fitting garments<br />\nThe latest varieties of goods always on hand.<br />\n<br />\nFine Goods at<br />\nMBROSE d.:1?ERRY,<br />\nPopular Prices.<br />\n... Merchant Tailors ...<br />\n221 W.<br />\n<br />\nFayette Street, near Howard,<br />\nBALT1f1ORE, MD.<br />\n<br />\n\fBARTHOLOMAY BREWERY CO.<br />\nNUM<br />\n<br />\nJRO. Hal NZCR LIEU •<br />\n<br />\nW. J. WICKHAM<br />\n<br />\nHEINZERLING<br />\n<br />\nROCHESTER, N. Y.<br />\n<br />\n& coOffice & Factory,<br />\n<br />\nCHALLENGE<br />\n<br />\nGINGER ALE<br />\nOur<br />\nCLUB GINGER ALE<br />\nSpecialties: CHAMPAGNE CIDER(ExtraDry)<br />\n<br />\nBohemian or<br />\nBavarian ..ot<br />\nMaerzen<br />\nApollo ot ult<br />\n<br />\nSPARKLING KOLAFRA<br />\nTHONE • • •<br />\n<br />\n041<br />\n<br />\n1000—Telephone -2000<br />\n<br />\nBALTIMORE BRANCH:<br />\n<br />\nOffice and Depot, - 227-239 S.Central Ave.<br />\nGEO. C. SUCRO, MANSOER.<br />\n<br />\nMandolins<br />\nGuitars • •<br />\nBanjos.. •<br />\n<br />\nWashburn<br />\n<br />\n21-8-23 W. Conway St.<br />\n<br />\nare recommended<br />\nI, y the highest musical authorities<br />\nall over the world.<br />\n<br />\nNOW READY<br />\n. i.„),<br />\n,<br />\n<br />\n411 , •<br />\n<br />\niiLii<br />\n<br />\n898<br />\n<br />\n.4c1r). VAlitL06111<br />\n\"<br />\n)<br />\n.<br />\n4.<br />\n3<br />\n.k.<br />\n(Ok`»r<br />\n<br />\n;<br />\n;VGSVMA<br />\n<br />\nH. R. EISENBRANDT SONS,<br />\n<br />\n\"•-/t( ;.,04<br />\n,<br />\nP4V1<br />\n<br />\nSOLE AGIENTS,<br />\n<br />\na Month.<br />\nPianos$5 Low<br />\nPrices<br />\nEasiest Terms.<br />\n<br />\nSEND 6 IN STAMPS ACTUALCOST OF MAILING ANDGET ONE.<br />\n<br />\nN. E. Corner<br />\n<br />\nCHARLES AND LEXINGTON STS.<br />\n<br />\nTHE CHLORIDE oFSILVER DRY CELL BATTERYCO:<br />\nBALTIMORE, MD. U.S.A.<br />\n<br />\nWEST MADISON STREET SHOE REPAIRING COMPANY<br />\nis REPAIRING 8H0E8 FOR<br />\n85 CENTS -HAND SEWED.<br />\n'Phi same work that you pay 81.00 to $1.55.<br />\nMen's Half-soled and Heeled, Sewed, . . .<br />\n.<br />\n▪<br />\nNailed and Pegged, .<br />\n•<br />\nLadies' Half-soled said Hee.led,<br />\n. . . . .<br />\n.<br />\nChildren's \"<br />\n<br />\n700.<br />\n53c.<br />\nSSe.<br />\n<br />\nREMEMBER THE PLACE.<br />\n<br />\nNO. 217 W. MADISON STREET, BET. HOWARD ST. AND PARK AVE.<br />\nPostal Cards Receive Prompt Attention.<br />\nDelivered.<br />\n<br />\nOrders Called For and<br />\n<br />\nTYPEWRITER INSPECTION & SUPPLY CO,<br />\n15 NORTH STREET.<br />\n<br />\nPrice Innovation I Cash Consideration<br />\n25 per cent. off each sale from this date. Our<br />\nimmense stock of Imported Woolens must<br />\nbe closed out by December 31st to accomplish important changes for our spring purchases.<br />\nJNO. M. KEELER,<br />\nMaker of Men's Garments.<br />\n<br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and f• Standard Machines<br />\nMimeograph Work.<br />\nrented at $1 per week<br />\n<br />\nThe Chas. Mims Surgical Instrument Co.<br />\nBENJ. A. NELSON, WWI Manager.<br />\n<br />\nMaannertgrlarrit of<br />\n<br />\nFINE StIRQICAL iNSTINMENTS,<br />\n<br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\nElastic Hosiery, Trusses, Rubber Goods, dr.e.<br />\n<br />\n300 N. HOWARD ST.,<br />\n<br />\n6 N. CALVERT ST., Opp. P. 0.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nTELEPHONE 771.<br />\n<br />\nNORTH GERMAN LLOYD'S.S. CO<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER & CO.<br />\nFor particulars apply to<br />\nGeneral Agents.<br />\n<br />\n4<br />\n. NEW YORK TO BREMEN. ••••<br />\nLONDON, PARIS, CIBRALTAR,<br />\nNAPLES, CENOA, ETC.<br />\n4u BALTIMORE TO BREMEN •...<br />\nDIRECT.<br />\n<br />\nevery description.. .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br />\n<br />\nF. H. DAVIDSON & C.<br />\n<br />\n509 W. Franklin Street,<br />\n<br />\nBaltimore. Rd.<br />\n<br />\nTelephone 2093.<br />\n<br />\nATLANTIO TRANSPORT LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br />\n<br />\nBaltimore Storage & Lighterage Co.,<br />\n<br />\nNew York Shipping Co.,<br />\n<br />\n403-409 WATER STREET,<br />\nBALTIMORE.<br />\n<br />\nI BROADWAY,<br />\nNEW YORK.<br />\n<br />\nJOHN V. RUPPERT,<br />\nMERCHANT TAILOR,<br />\n<br />\nNo. 617 N. EUTAW STREET, BALTIMORE, MD.<br />\nSuits to Order for 1110.00 and upwards.<br />\nScouring, Altering and Repairing a Specialty,<br />\n<br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 415 Water Street,[Second St.]<br />\nAdjoining Custom Houseon the West<br />\nShort Insurance for a Day<br />\nTHOMAS I. CARET, Prof.<br />\n.. or Longer Period.<br />\nBOARD OF<br />\n<br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nILIUM)t. POT,leo'ty<br />\n<br />\nDIRECTORS.<br />\n<br />\nA. J. Ulman,<br />\nJoshua G. Harvey,<br />\nHenry James,<br />\nAndrew D. Joules.<br />\n<br />\nFerd. C. Latrobe,<br />\nWilliam Harvey<br />\nJames W. Bates<br />\nknit.<br />\n<br />\nGU(143ENHEIrIER, WEIL. & CO.<br />\n<br />\nStudents'...<br />\nRequisites.<br />\n<br />\n\f", "format": "basic_html", "processed": "mug<br /><br />\nvol. H. I 1. I I. I t<br /><br />\nJANUARY 13th, 1898. ItItIti No.7.<br /><br />\ntbe<br /><br />\n3ry)<br /><br />\nNicuisAirfettcr<br /><br />\n).<br /><br />\n• V•<br /><br />\n•<br /><br />\nPublished by Students of<br /><br />\n:0'<br />\nPress of<br />\nGuggenheimer, Well &amp; Co.<br /><br />\nhe°<br />\nF.<br /><br />\nflo THE JOHNS HOPKINS<br />\n+ UNIVERSITY<br /><br />\n01((<br />\n_<br /><br />\n—<br /><br />\n•<br />\n11° it*<br /><br />\nMoor._<br /><br />\nBALTIMORE<br /><br />\nItIt<br /><br />\nFORTNIGHTLY<br /><br />\nTHE UNIVERSITY SCHOOL 1.21(BOYS<br />\nW. 8. MARSTON, A. II and C. R..<br />\n710 and 712 Madison Ave.<br />\nPrincipal.<br />\nils scisoot. prop.el boys for &amp;Williston to the John. Hopkins or any Ulitrorsity or<br />\nHopkins alone.<br />\nar Scientific School. It hari tittret more than one hundred tor the Joh.Technology.<br />\nthe<br />\n1, Yak, Princeton, the Hamsechneette Institute of<br />\n.I. and many for H<br />\nTroy Polytechnic and other College+ and Schools. In October, 11511441, two of the flee<br />\nsallolarahlpa givell at the John. Hopkins to new inetriouletes, were aw•I'lleil to Its pupils. It<br />\nhe a good laboratory •nri a well equipped gyinnaellint, Whiall is under the charge of•<br />\ntent histructor. Po, further I nfornistion or for catalogues, address the Principal, at No. mil<br />\nN. Calvert Street.<br /><br />\nB. G. ElCHELBERGER,<br />\nBOOKS AND FINE 8TATIONBRY.<br />\n308 N. CHARLES ST.<br /><br />\nOak/noire<br /><br />\n!initiator°, Md.<br /><br />\n•<br /><br />\nThe professors and students of the johns Hopkins<br />\nto examine<br />\nstock and make purchases from the following old<br />\nestablished house, Jordan Stabler, importer, jobber<br />\nand retailer of staple and fancy groceries, 701,703 and<br />\n705 Madison avenue, cor. Eutaw st.<br />\nTelephones—B. &amp; P. 817; Home 6083.<br /><br />\nUniversity will find it to their advantage<br /><br />\n(400000 maw wstacksor.)<br /><br />\nCushing &amp; Company<br /><br />\nThe Society Paper of Baltimore.<br /><br />\nBOOKSELLERS<br /><br />\nANU<br /><br />\nSTATIONERS<br /><br />\n34 WEST BALTIMORE STREET.<br />\nICIROOL, LAW, MIDIOAL, AND OLASSIOAL AND NINOILLANNOU8 11001Lt.<br />\nused In Johns Hopkins University, Julius<br />\nLiloapitel, and The Woman's 001100 or Bann....<br /><br />\nKeep constantly on hand the Text Hooks<br /><br />\nBRIGHT AND BREEZY.<br /><br />\nIll'AlIONSitif..--1,11<br /><br />\nSchool,<br /><br />\nlilopkias<br /><br />\nValidly. Wino and<br /><br />\nJohns Hopkins University.<br />\nPROGRAMMES FOR 1897-98.<br />\nThejohns Hopkins University. Circular containing announcement.<br />\n. . of the Collegiate and Graduate courses offered for the aca-<br /><br />\n. . demic_year beginnin October tsti_xl, maybe had on application to the Registrar of thejohns Ho_akins University.<br /><br />\nJUST<br />\nTWO THOUGHTS<br /><br />\nTHE JOHNS HOPKINS MEDICAL SCHOOL.<br />\nThe announcements of the Johns Hopkins Medical School mai also<br />\n. . be had on application to the Registrars.<br /><br />\nINTERESTING TO GOOD DRESSERS.<br />\nThe<br /><br />\nTUXEDO<br />\nSUIT<br /><br />\nis comfort, style and service in cloth. We studied<br />\nto make them beautiful<br />\nand have succeeded.<br /><br />\nOur OVERCOATS<br />\nare their own argument<br />\nfor warmth, wear and<br />\nstyle. Off-and-On easy<br />\nis our idea that helps<br />\nmake them popular.<br /><br />\nI?„a#a<br /><br />\nI°.<br /><br />\nde<br /><br />\np.<br /><br />\nDeveloping<br />\nand<br />\nPrinting.<br /><br />\noe<br /><br />\nTHE CUMMINS.<br />\nPHOTO-STOCK CO,<br /><br />\n,<br />\n4„N CHARLES....<br /><br />\nYou Fairly Fly on<br /><br />\na \"Keating<br />\n111111011/111<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br />\nBOOK STORE<br /><br />\n_ .<br />\n. Text Books<br />\n. Note Books .<br /><br />\nStudents' Supplies<br /><br />\nMadison &amp; Howard Sts.<br /><br />\n106 N. Charles St.<br /><br />\nBALTIMORE Mb.<br /><br />\nDOMESTIC -<br /><br />\nOPPOSITE UNIVERSITY.<br /><br />\nCameras &amp; Supplies.,<br /><br />\nhi<br /><br />\nCigars -<br /><br />\nNo. 402 DRUID HILL AVENUE,<br /><br />\nTAILOR *No DRAPER<br /><br />\nPNotoGRAPH Icsu ppo Es fo.<br /><br />\n- IMPORTED<br /><br />\nCisarettele and Tobacco,Smokers'Articles.<br /><br />\nJOHN R. LEMMERT,<br />\n14 E. FAYETTE Si-.<br /><br />\nJ. HARRY RICHTER,<br /><br />\n41<br /><br />\nGrand\"<br /><br />\nIt's the Wheel of Wheels, with its<br />\nDouble Roller Chain \"that curve\"<br />\nand many other \"365 days ahead<br />\nof all others \"--advantages.<br />\nDIAMOND WHEEL CO„ m N. Charles St.<br />\nBaltimore Hardware Co., Baltimore &amp; Greene Sts.-Branch.<br /><br />\nANN.—<br /><br />\nI5<br />\nOr<br />\nORO,<br />\nthe<br /><br />\nZbe liFtewe raetter.<br />\nVol. II.<br /><br />\nFortnightly<br /><br />\nThe bathroom will contain two needle baths<br />\nand six shower baths.<br />\nThere was some disappointment among the<br />\nThe large second-story room will be used<br />\nstudents, when they found after the Xmas re- for various purposes. The trophies won by the<br />\ncess that the Gymnasium building was still un- Hopkins athletes, and especially those won by<br />\ncompleted. Their patience will have to be ex- the teams, will here be permanently exhibited.<br />\ntended over two more weeks, for not until then The Athletic Association will hold its meeting<br />\nwill the cage and locker-room be ready for use. in this room, and from it visitors can overlook<br />\nMeanwhile it may be a consolation to the stu- the gymnasium and the cage. It is an ideal<br />\ndents to see on paper all the advantages pro- room for fencing, with its large sky-light and<br />\nvided by generosity of the students. Many of windows on three sides. Fencing lessons will<br />\nthe facts about the building have been pub- be given by Dr. Crenshaw's assistant in gymlished before, and we shall avoid, as far as pos- nastics, a member of the German Turnverein.<br />\nsible, any repetition.<br />\nThe whole building can be lighted either by<br />\nThe track will be 233 1-2 feet long,thus mak- gas or electricity. As soon as the University<br />\ning 18 laps to a mile. It will have a coarse cin- gets a larger plant of its own, the gas burners<br />\nder foundation with finer strata of cinders will probably be entirely displaced by arc lamps<br />\nabove, and a surface layer of fine cinders and and incandescent lamps. The heating is done<br />\nclay. The ends and turns of the track will be by the Flenum system of indirect heating in an<br />\nbanked one foot, and the curves will form \"indirect\" chamber, the air constantly driven<br />\nsemi-circles, with diameters of 52 feet.<br />\nin by a fan, and distributed over the building<br />\nOn the North wall of the cage there will be through galvanized iron ducts.<br />\nAttendance on gymnasium work is compulSpace for three or four handball courts. The<br />\nfor the Freshmen, and we hope that it may<br />\nsory<br />\ntennis courts will be laid out later in the season,<br />\nfor all undergraduates. All men playing<br />\nso<br />\nbe<br />\nwhen the floor will be worn smooth and hard<br />\nby constant use. A box for the vaulting poles on teams have to come up to a certain standard<br />\nof gymnasium work, and any undergraduate<br />\nwill be placed in the cage.<br />\nThe gymnasium proper has somewhat less who is not able to reach a fixed standard of<br />\narea than the former building, but is practi- strength, will be compelled to attend the gymcally roomier, since all running and jumping nasium regularly.<br />\nThe students'smoking room is one of the<br />\nwill be done in the cage. Three hundred dolpleasing features of the new building.<br />\nmost<br />\nlars' worth of new apparatus has been purapparently knew the charms of<br />\narchitects<br />\nThe<br />\nchased. The two striking bags, the inclines,<br />\nand the new arrangements of the ladders de- an open fire, when they designed the handsome<br />\nserve special attention. Two ladders in the fireplace. It remains for the students to make<br />\nnorth corners of the gymnasium reach directly proper use of the room, and to improve it as<br />\ndown into the large locker room. Two hun- much as possible. Several proposals have been<br />\ndred and fifty lockers will be provided for the made to this effect. It seems to us that a pair<br />\npresent, and more can be added at convenience. of old andirons, a fender and some hickory<br />\nwood are the first things needed to complete<br />\nThey will be four feet high, 15 inches wide, and<br />\n18 inches deep; while 50lockers will be five feet the room. The several classes would earn the<br />\nhigh for the purpose of holding lacrosse sticks. gratitude of hosts of future. students by proNear the east window of the basement Profes- viding these requisites for the fireplace. The<br />\nsor Doyle of the B. A. C. will give wrestling les- hickory wood could be furnished by subscription among all the lovers of an open fire.<br />\nsons twice a week.<br /><br />\nSOME FACTS ABOUT THE CAGE.<br /><br />\n,140<br /><br />\nA.<br /><br />\ntta.o.<br />\nit-<br /><br />\nNo. 7<br /><br />\n2<br /><br />\nTHE NEWS -LETTER.<br /><br />\nSingle students can make their names immortal by giving pictures, curtains, and all the<br />\nother things that make a room look cheerful<br />\nand hospitable. Each class can add to the wall<br />\ndecorations its shield in shape of an enlarged<br />\nclass pin.<br />\nSome men may contend that the ornaments<br />\nwould be broken in the course of pot socials or<br />\nclass fights. The wise and far-seeing faculty<br />\nprevents all damages by forbidding any kind of<br />\nclass rush, fighting or boxing under the roof<br />\nof the gymnasium.<br />\nHOPKINS AND HARVARD.<br />\nIn the columns of THE NEWS-LETTER several articles have appeared offering various<br />\nsuggestions for the promotion of college spirit<br />\nand mutual fellowship among the students at<br />\nthe University. However admirable these suggestions may be, they will surely prove useless<br />\nunless they fall upon fruitful soil. All of us are<br />\naware of a certain diffidence on the part of<br />\nHopkins men, whenever a comparison is<br />\ndrawn between their own institution and the<br />\nlarge and wealthy colleges of the North. Of<br />\ncourse, they are proud of the position occupied<br />\nby Johns Hopkins in the field of learning; but<br />\nas soon as the conversation turns upon those<br />\nqualities that go to make up a college in the<br />\npopular sense, they assume an apologetic attitude. Until this distrust has been removed,<br />\nwe cannot execute with any zest the schemes<br />\nfor improving our athletic standing and advancing the interests of the University by<br />\nother means, and the best way to remove it is<br />\nto show that it is unwarranted by the facts.<br />\nLet us take Harvard as an example. It is<br />\nthe largest, the oldest, the wealthiest of American universities ; it has more students in a<br />\nsingle class than the Hopkins in all its departments ; it has a beautiful campus and magnificent dormitories; and yet most Hopkins men<br />\nwould be surprised to see in how many respects it is inferior as a college to their own<br />\nAlma Mater.<br />\nThe chronic state of affairs<br />\namong the students at Cambridge is what a<br />\nwriter in Scribner's has termed \"Harvard indifference.\" \"If the football team has been<br />\nbeaten, we are sorry, to be sure ; but, after all,<br /><br />\nthe loss falls upon the University, and not<br />\nupon us \"—that is the sentiment which their<br />\nactions and sometimes their words express.<br />\nThis fact is easily accounted for by the immense size of the institution, by the complicated system of social clubs, with its \"inner<br />\ncircles\" and wheels within wheels, and perhaps by a certain Northern stolidity of temperament. The important point for us is that<br />\nnone of these causes exists or is every likely to<br />\nexist at the Johns Hopkins.<br />\nIf, then, this is the condition which prevails<br />\nat so old and celebrated a college as Harvard,<br />\ncan we not disabuse our minds of the notion,<br />\nfostered by Yankee school teachers, that, in<br />\ncomparison with our larger rivals, the Hopkins has no college spirit ? Doubtless, we<br />\nhave still much room for improvement; but<br />\nwe are far better, relatively speaking, than we<br />\nhave been artfully led to believe.<br />\nARTHUR W. MACHEN, JR.<br />\nTHE PASSING OF THE YEAR.<br />\nI.<br /><br />\nTwilight—<br />\nOf the darkening firelight ;<br />\nSilence — thickening with the thickening<br />\ngloom.<br />\nRevery—<br />\nGiving soul to every<br />\nFlickering shadow in the dusky room.<br />\nJarring—<br />\nIts way through hush-clouds, warring—<br />\nA sound bursts forth—for heavy the charring<br />\nlog has sunk.<br />\nAnd elate<br />\nO'er their victim prostrate<br />\nThe fire-worms madly gnaw along its trunk.<br />\nFlaring,<br />\nA thin blue flame, despairing,<br />\nLeaps from the log; and upward and away<br />\nHas darted.<br />\nAnd so—their soul departed—<br />\nGather the ashes up, all cold and gray—<br />\nCast them away.<br />\nit<br /><br />\nS.,1,<br /><br />\n.<br />\n198<br /><br />\nTHE NEWS-LETTER.<br /><br />\niot<br />\neir<br />\n!ss.<br />\nm)1iler<br />\nereriat<br />\nto<br />\nus<br />\n7d,<br />\nin<br />\np-<br /><br />\nAre<br />\nut<br />\nve<br /><br />\n.<br /><br />\nc<br /><br />\nNEWS OF A FORTNIGHT.<br />\nTHE PUBLIC DEBATE AT EASTER.<br />\nAt the meeting of the House of Representatives Wednesday, January 5, Mr. Censor announced that there would be a public debate<br />\nat Easter between the classes of '98 and '99.<br />\n\"Dr. Adams,\" he said, \"has kindly given, as<br />\nprizes for the contest, three gold medals and a<br />\ntrophy, in the form of a mahogany tablet, with<br />\nSilver trimmings.\" A vote of thanks was extended by the House to Dr. Adams for his<br />\nmunificent gifts. The House voted that there<br />\nShould be nine men to represent the class in<br />\nthis debate. Six, who will be regulars or alternates, will be chosen by the Censor, purely on<br />\ntheir merits, and three, who are to act as advisers, will be elected by the House. The<br />\nnames of all nine, if they are successful, will be<br />\nengraved on the trophy, which is to be placed<br />\nin the Donovan Room, McCoy Hall. The<br />\nquestion which is to be debated at Easter will<br />\nbe debated three times in the House, to insure<br />\na clear interpretation and forcible presentation of the subject.<br />\nThe impeachment of Mr. Kaufman created<br />\nquite a stir in the House. The charges are,<br />\nbriefly, that Mr. Kaufman is, as a freshman,<br />\nnot eligible to attend the meetings of the<br />\nHouse; that he has not the consent of the<br />\nCensor, which would enable him to attend.<br />\nThe attorneys appointed for the defense are<br />\nCongressmen Fisher, Guggenheimer and<br />\nRoss ; for the prosecution, Congressmen Mullen and Grimes. The trial, which will take<br />\nPlace at the next meeting of the House, will<br />\nbe open to members of other classes, only by<br />\nspecial permission of the Censor.<br />\nThe regular debate proved interesting, and<br />\nwas debated with considerable zeal and dexterity. The question was : \"Resolved, That<br />\ncapital punishment ought to be abolished.\"<br />\nThe affirmative was taken by Congressmen<br />\nR emsen and Keidel ; the negative by Congressmen Krager, Murkland and Davinson.<br />\nThe negative side, by their better presentation,<br />\nwon the debate. The affirmative side was,<br />\nhowever, somewhat handicapped by the absence of one of their number.<br /><br />\n3<br /><br />\nTHE AMERICAN HISTORICAL ASSOCIATION.<br />\nThe American Historical Association held<br />\nits thirteenth annual convention in Cleveland<br />\nduring the Christmas holidays. A number of<br />\nHopkins men attended. Out of 35 different<br />\nannouncements of papers on the programme,<br />\nno less than 14. were by representatives, past<br />\nand present, of the Johns Hopkins University.<br />\nRecent graduates of the University, who had<br />\na place on the Cleveland programme were Dr.<br />\nJ. M. Callahan, who this month assumes the<br />\nduties of Historical Professor at Hamilton<br />\nCollege, Clinton, N. Y.; Dr. Franklin L. Riley,<br />\nwho has lately become Professor of History in<br />\nthe University of Mississippi; and Doctors B.<br />\nC. Steiner, J. C. Ballagh, and John H. Latane,<br />\nnow resident in Baltimore.<br />\nThe Association now numbers about one<br />\nthousand picked members, all chosen on nomination by existing members. There are over<br />\none hundred life members. Among these are<br />\nPresident McKinley and ex-President Cleveland. The chosen President for the current<br />\nyear is George P. Fisher, of Yale University.<br />\nDr. James Schouler, of the Johns Hopkins<br />\nUniversity, retires from the Presidency of the<br />\nAssociation into the Executive Council for<br />\nlife. Chief Justice Fuller, already a member<br />\nof the Association and a regent of the Smithsonian Institution, was elected a member of<br />\nthe Executive Council. The next meeting<br />\nwill be held in the new building of the New<br />\nHaven Historical Society during the Christmas holidays of the current year.<br />\nProfessor Moore, instructor here in economics for the year 1896-'97, and now Professor at Smith College, is delivering a course of<br />\ntwelve lectures on the \"Mathematical Methods<br />\nin Economics\" at the Hopkins. Professor<br />\nMoore was one of the most popular of the<br />\nyounger instructors while at the Hopkins, and<br />\nhis resignation was a source of universal regret, though his call to fill a very prominent<br />\nchair at Smith afforded a pleasing instance of<br />\nhis popularity and showed his recognized<br />\nability.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\nebe Petupletter.<br />\nPublished Portnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nThe greater the number of men who take regular exercise, the greater will be the interest in<br />\nall forms of athletics.<br /><br />\nJANUARY 13, 1898.<br />\nSubscription $1.50 per year. Is cents a single copy.<br />\nEditor in Chief,<br />\nAssistant Editor in Chief, Consulting Editors, -<br /><br />\nEDGEWORTH SMITH,'98.<br />\nALBERT C. DIEFFENBACH,'98.<br />\nProf. KIRBY P. SMITH.<br />\nGm C. MORRISON,'90.<br /><br />\nDEPARTMENT EDITORS.<br />\nG. L. P. RADcLiFys,<br />\nGraduates.<br />\nC. K. EDMUNDS,<br />\nH. V. BLACK,<br />\nW.T. LONOCOPE, 1. Medical School.<br />\nC. K. Wusms,JR.<br />\nY. A. RENour,'98.<br />\nR. D. MILLER,'98.<br />\nP. J. CLTINET,'98.<br />\nJ. C. FRENCH,'99.<br />\nJ. H. KING, '99.<br />\nE. A. SPILMAN, 99.<br />\nBusiness Manager,<br />\nR. H.GRIMES,'99.<br />\nAddress all articles, communications, etc. to EDGEWORTH<br />\nSMITH. box 707, Johns Hopkins University. Baltimore, Md.<br />\nSubscriptions and business communications must be sent<br />\nto R. H. GRIMES, box 238, J. H. U.; or box 398, Medical School<br />\nof Johns Hopkins Hospital.<br /><br />\nA petition has recently appeared which recites the difficulties heretofore met with in the<br />\nequipment of teams, and the raising of guarantees, and seeks to provide a remedy. The<br />\ntrustees are asked to charge a locker rent of<br />\nfive dollars, to prohibit the use of the gymnasium and cage to all who do not rent lockers, and to devote the money so raised to the<br />\nneedy cause of team athletics. This is a wellmeant, but misguided, effort. The possibility<br />\nthat the trustees would grant such a petition,<br />\neven if it were generally signed, seems very<br />\nremote.<br />\nIt rests upon a complete misconception of<br />\nthe purpose of college athletics. The gymnasium is designed to give to students, whose<br />\nlives are sedentary, the exercise necessary to<br />\ngood health. Inter-collegiate sport is a legitimate, hut by no means essential, outgrowth<br />\nof this principle. It would be unreasonable<br />\nand unjust to enforce from a student who<br />\nchooses to confine his exercise to chestweights and clubs, a contribution to the expenses of the teams. The lockers should be<br />\nfree, and every encouragement should be offered to the use of the gymnasium and cage.<br /><br />\nPresident Gilman.has presented his twentysecond annual report, of which we can only say,<br />\nread it. Many students have but vague ideas<br />\nof the work which is being done at this University. Often they are those very ones who<br />\nare always crying out on the lack of college<br />\nspirit. College spirit is a word which, we believe has never been defined, and which is accompanied by conceptions in different minds.<br />\nFor some men it is merely a form of rowdyism,<br />\nfor others, athletic enthusiasm, for many both<br />\nof these. Again, the different forms of class<br />\nfeeling are by many believed to constitute the<br />\nessence of college spirit. To us it seems that<br />\nloyalty to the University in all of its phases is<br />\ntrue college spirit. Uphold the honor of your<br />\nAlma Mater in all possible ways, spread her<br />\nfame wherever you may live, at present or in<br />\nthe future. This can be well done only by men<br />\nwho know of the work accomplished in all the<br />\ndepartments, and the quickest way of gaining<br />\nthis knowledge consists in reading over such<br />\npublications as the President's report.<br />\nTHE NEWS-LETTER remarks a growing anxiety among certain seniors lest those good old<br />\nclays when the \"pot social\" was in our midst<br />\n(or we in its) may have already gone into history, and taken with them, also, those rejuvenating times when juniors, in spite of freshmen,<br />\nand freshmen on the sly, got together to make<br />\na joyful noise about the board, under the special inspiration of a clever deduction of Vinunt<br />\nvos liberabit from the University motto and the<br />\ngenerally accepted proverb, In vino veritas.<br />\nIs there any ground for this anxiety? Have<br />\nfreshmen and juniors at last succumbed to the<br />\nomni-stifling power of respectability ? Will<br />\nno more gallant youths make \"hairbreadth<br />\n'scapes i' the imminent deadly breach\" of a<br />\ncar window, or boldly scour the country 'round<br />\nin search of some windmill to attack? 'Tis<br />\npity ! We must have some little excitement<br />\nto break the dull monotony of the knowledgesyphous ceaseless flow. The sight of red-<br /><br />\nTHE NEWS—LETTER.<br />\negt in<br /><br />\n;ay,<br />\n[eas<br />\nTnivho<br />\nege<br />\nbeacids.<br />\n3m,<br />\nDth<br />\nass<br />\nthe<br />\nhat<br />\n; is<br />\n)Ur<br />\ner<br />\nin<br />\nten<br />\n:he<br />\nng<br />\n[ch<br /><br />\nsweatered young gladiators scurrying down<br />\nthe deserted streets in the stillness that precedes the dawn cannot fail to quicken the pulse<br />\nof the most sluggish, while to the imaginative<br />\nit suggests very vividly those grand old days<br />\nWhen Claudius and Milo were under contract<br />\nto show Rome a good time.<br />\nWhat means this shameful lethargy ? Is<br />\nninety and nine safe within the fold, and will<br />\nnaughty naught do naught that's naughty?<br />\nRobinson and McGraw have consented to<br />\ncoach the baseball team. Hopkins has not<br />\nhad such an opportunity before, and all candidates should take advantage of such coaching and develop rapidly. At present Robinson<br />\nand McGraw know more of baseball than any<br />\nother two men in the business. There is no<br />\nreason why Hopkins cannot win the State<br />\nchampionship or do even better under,such<br />\ncoaches and such a reliable captain.<br />\nDISCOVERED AT LAST.<br />\nTHE NEWS LETTER, a new exchange from<br /><br />\nthe Johns Hopkins University, is an attractive<br />\nand readable little paper.—Normal College<br />\nEcho.<br /><br />\n[x-<br /><br />\nlst<br />\nisn-<br /><br />\nke<br />\n)ent<br />\nhe<br /><br />\n%re<br />\nhe<br />\nill<br />\nth<br />\na<br /><br />\na<br />\nht<br />\nC1-<br /><br />\n5<br /><br />\nwe owe to our University in return for the<br />\nbenefits she bestows on us is to prove ourselves in all respects her worthy representatives. Yet the men here persistently neglect<br />\nthe one thing which will both improve themselves physically and at the same time add to<br />\nHopkins' reputation.<br />\nPerhaps it may be said that Hopkins needs<br />\nno athletic standing. True, we might not be<br />\nseriously injured as a College by the loss of<br />\nour teams, though the loss to the individual<br />\nmen would be great.<br />\nBut there is a consideration more important<br />\nthan that. In fact, the johns Hopkins does<br />\nplace teams on the field every year, and it is a<br />\nwoeful fact that we have to submit to defeat<br />\nat the hands of second-rate colleges. This<br />\nshould move every student to make all possible efforts for the improvement of our athletic standard.<br /><br />\nA GRADUATE STUDENT.<br />\nThe class of 'goo held A meeting Wednesday, January 5. The class elected Carroll<br />\nWight captain of the indoor baseball team,<br />\nwith the authority to choose a manager. Roland Abercrombie was elected member of the<br />\nHouse Committee of the new gymnasium.<br />\nThe meeting was well attended.<br /><br />\nA GRADUATE ON GRADUATES.<br /><br />\nThere seems to be an idea among the graduate students of the Hopkins that they have<br />\nno part in the affairs of the College in general.<br />\nThere was never a greater mistake. Graduates, as well as undergraduates, should, as<br />\nstudents of the Hopkins, lend aid to everything which concerns our College. Why<br />\nshould graduate students who are here to<br />\nenjoy the splendid advantages offered by the<br />\nUniversity feel that it is not their duty to do<br />\nwhat they can to advance her interests ? This<br />\nwe fail in many ways to do probably most<br />\nnoticeably in the line of athletics. To be sure,<br />\nthis is not the main end of a graduate student's<br />\nexistence, Other things should, as they do,<br />\nclaim our first attention. But anyone must<br />\nadmit the value of a trained body, such as is<br />\ngained through outdoor sports, and the least<br /><br />\nINTERESTING STATISTICS.<br /><br />\nProfessor S—.<br />\nIn reply to Mill's theory, statistics show that<br />\nwomen who are college graduates marry as<br />\noften as other women.<br />\n(Prolonged break in the lecture while the<br />\nProfessor makes laborious efforts to explain<br />\nwhat he means, and the class makes as laborious efforts to follow his tangled line of<br />\nthought).<br />\nMary had a little wheel,<br />\nIt wobbled so at random<br />\nShe gave it up and hired a man<br />\nTo haul her on a tandem.<br />\n—Exchange.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nATHLETICS.<br />\nGYMNASTICS AND ATHLETICS.<br /><br />\nOn the 31st of December, 1897, there met at<br />\nthe Knickerbocker Club in New York, the directors of the gymnasiums of many of the<br />\nlarger colleges and universities.<br />\nA preliminary meeting had been held on<br />\nNov. 6, and invitations issued to the principal<br />\ncolleges and universities in the country to send<br />\nrepresentatives on the above date. Almost all<br />\nsent letters expressing a thorough sympathy<br />\nwith, and great interest in, the meeting. It was<br />\nsufficient, however, that the pioneers in this<br />\nwork, Dr. Dudley A. Sargent, of Harvard; Dr.<br />\nEdward Hitchcock, of Amherst; Dr. W. G.<br />\nAnderson, of Yale; and men from colleges<br />\nwhich are following in the footsteps of these institutions were present.<br />\nThe object of this meeting was to organize<br />\nan association to be known as the \"Society for<br />\nthe Advancement of Physical Culture in Colleges.\" For some time past gymnasium directors have felt that the \"American Association<br />\nfor the Advancement of Physical Education,\"<br />\ncovered too broad a field and was not giving<br />\nthem just what they needed, and what they expected. To fill this much-felt requirement, the<br />\n\"Society for the Advancement of Physical<br />\nCulture in Colleges\" had been organized. The<br />\nmen who compose it, must be members of the<br />\nparent organization and no gymnasium in,structor can become a member who has not<br />\nfollowed gymnastics as a profession for at least<br />\ntwo years. The new society will concern itself<br />\nwith gymnasium work alone, and thus directors will be brought closer together, methods<br />\nwill be criticised, and, best of all, a common<br />\nstandard will be adopted and arrived at by all.<br />\nA constitution and by-laws were adopted,<br />\nunder which Dr. Jay Seaver, of Yale, was elected President; Dr. Watson Savage, of Columbia, Secretary-Treasurer. These officers, with<br />\nDr. Sargent, of Harvard, and Prof. Cann, New<br />\nYork University, will constitute the council, or<br />\nmanaging board.<br />\nTwo papers were read—one by Dr. Anderson, on \"Terminology,\" the other by Dr. Sar-<br /><br />\ngent on \"Strength Tests.\" Dr. Sargent, who<br />\nwas chairman of the committee appointed at<br />\nthe first meeting, read a report which, after<br />\nconsiderable discussion, was adopted by the society. This report -adopts the following<br />\nstrength tests:<br />\nr. Strength of right and left hands.<br />\n2. Strength of back.<br />\n3. Strength of legs.<br />\n4. Strength of lungs.<br />\n5. Strength of biceps and triceps, as shown<br />\nby the number of times a person can pull up<br />\non a horizontal bar, and push up on the parallel<br />\nbars. These two, added together, multiplied<br />\nby his weight in kilos and divided by ten is considered the strength of the chest and arms. Instead of strength of lungs. As no machine for<br />\ntesting the lung strength has been found at all<br />\nsatisfactory so far, one twentieth of lung capacity will be generally used.<br />\nThese measurements have all been taken at<br />\nHopkins University since the gymnasium was<br />\nfirst built. The main point of interest to gymnasium directors and to students is that Dr.<br />\nSargent and the Faculty of Harvard have enforced a certain standard of strength based in<br />\nthese tests as a condition of playing on teams.<br />\nThus in. order to play on a football team, or<br />\nrow in a boat crew, or contest in heavyweight<br />\nthrowing, a student must show a total<br />\nstrength test of 700 or over. In order to play<br />\nlacrosse or baseball, he must reach 600 or over,<br />\nand for track athletics, 500 or over. The directors who were present were asked to work on<br />\nthis basis in their colleges, and all agreed to do<br />\nso. When a student falls below these requirements he is debarred from a team, and no<br />\namount of favoritism can put him on instead of<br />\na man who has come up to the standard. The<br />\nonly thing for him to do then, is to work in the<br />\ngymnasium and bring his strength up to standard. In order to create interest in the \"strong<br />\nman\" the Society will offer a banner or medal<br />\nto the highest or greatest \"total strength\" made<br />\nby any one in the colleges. As an incentive to<br />\nour students, 1, Mr. Editor, will offer a prize to<br />\nbe competed for by the three classes.<br />\nIn your next edition, Mr. Editor, if you will<br /><br />\nTHE NEWS-LETTER.<br />\ngrant me space, I hope to present from my records the strength tests of some of the best<br />\nteams in the history of the University.<br />\nJ. B. CRENSHAW,<br />\nInstructor in Physical Culture.<br />\nrIARYLAND STATE RECORDS HELD Ent<br />\nHOPKINS STUDENTS.<br /><br />\n7<br /><br />\ncharacterized by a lack of team work, and<br />\nslugging was frequent on both sides.<br />\nIn the first half the puck was batted back<br />\nand forth from one end of the rink to the other, and neither side was able to score.<br />\nThroughout this half Walbrook showed a tendency to fall on the puck when it came near the<br />\ngoal, at one time as many as three men going<br />\ndown at once, Hodges' head was cut by the<br />\npuck.<br />\n. In the second half the puck stayed in Walbrook's territory most of the time, only going<br />\nonce or twice near Hopkins goal, and giving<br />\nScholl a chance to make a couple of brilliant<br />\nstops. Toward the end of the half Hopkins<br />\nmanaged to use a little team work, and in the<br />\nlast five minutes of play McInnes and Hodges<br />\neach made a goal for Hopkins.<br />\nIn the second half Wilson, Walbrook's<br />\npoint, sprained his ankle and Turner took his<br />\nplace. Purnell put up the best game for Walbrook, but had a bad way of running over the<br />\npuck; in fact both teams found it very hard<br />\nnot to leave the puck behind, in their haste to<br />\nscore. The defense was good on both teams,<br />\nand Scholl in particular put up a great game.<br />\nHodges and McInnes did best for Hopkins<br />\non the attack.<br />\nThe previous game with Walbrook, Dec. 21,<br />\nalso resulted in a victory for Hopkins, the<br />\nscore being 3 to 1. Hopkins is now tied for<br />\nsecond place, with a record of two gaiines won<br />\nand one lost.<br /><br />\nThe annual meeting of the Board of Amateur Athletic Records of Maryland was held at<br />\nCentral Branch, 17. M. C. A. Building, Friday<br />\nevening, Jan. 7. Among the best records made<br />\nHopkins men hold a goodly number.<br />\nFor indoor records, Robert Garrett holds the<br />\nrecord for putting 12-pound shot-46 feet 2<br />\n'inches; for standing broad jump, 9 feet 7 1-2<br />\ninches; for fence-vault, 6 feet ii inches; i6Pound shot, 43 feet 1-2 inches. Geo. Knapp<br />\nties with E. R. Owens for the best record for<br />\n35-yard dash, both having made the distance<br />\nIn 4 1-5 seconds. Henry M. Wilson holds the<br />\nrecord for one-half mile run, two minutes, fifteen and four-fifth seconds.<br />\nIn out-door records our boys have done well.<br />\nHenry M. Wilson holds the record for onehalf mile run, with two minutes nine and onehalf seconds; A. D. Gantz, two hundred and<br />\ntwenty yard dash, twenty-four and three-fifths<br />\nseconds;four hundred and forty yard dash also<br />\nheld by A. D. Gantz, fifty-five and three-fifths<br />\nseconds; Robert Garrett, Jr., the running<br />\nbroad jump,twenty-one feet eleven inches, and<br />\nthrowing the discus, one hundred and seven<br />\nfeet seven inches.<br />\nWhile in New York during the holidays<br />\nThis is quite a nice list of records and shows<br />\nwhat may be accomplished if the spirit in ath- William Maddren, captain of last year's<br />\nlacrosse team, chose five dozen lacrosse sticks,<br />\nletics is kept up.<br />\nwhich will be sold to students interested in that<br />\nMr. Maddren selected the best sticks<br />\ngame.<br />\nHOCKEY.<br />\nFlannery<br />\nhad, which fact is sufficient<br />\nthat<br />\nOn January 6th Hopkins defeated Walworth. Practice will begin<br />\ntheir<br />\nguarantee<br />\nof<br />\nbrook by a score of 2 to o. There was a very<br />\nsticks<br />\nas<br />\nthe<br />\nsoon<br />\narrive.<br />\nas<br />\nPoor attendance and the lusty Hopkins rooting, which was<br />\nlast year a feature of the games,<br />\nwas conspicuous only by its absence.<br />\nMessrs. Maddren and Simmons, who were<br />\nThe attendance was rather slim, but a few to represent Hopkins in the handball tournaHopkins rooters got up courage enough to ment in Brooklyn, thought it better to wait<br />\nyell in the second half. The whole game was and enter the Easter tournament in that city.<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br />\nDR. BAKER ON 11UNIC1I.<br /><br />\nMunich was the subject of an address delivered by Dr. Baker of the Modern Language<br />\nDepartment before the Historical and Political<br />\nScience Association last Friday evening. Dr.<br />\nBaker considers Munich the greatest art centre<br />\nin the world, easily outstripping Berlin, and<br />\nprobably even Paris. The growing supremacy<br />\nof Berlin in art is due partly to Emperor William's imperious interference in such matters in<br />\nBerlin, and partly to the impetus given to art<br />\nby the romantic and deeply lamented Ludwig.<br />\nTo say that a city is in Germany is equivalent<br />\nto saying that it is well governed. Munich is<br />\nno exception to this rule, and the business<br />\nmethods by which the internal government of<br />\nthe city are managed are a source of pride to<br />\nits inhabitants. The Mayors serve their apprenticeships, as it were, in smaller towns and<br />\ncities before they are called to the control of<br />\naffairs in Munich.<br />\nBusiness activity in Munich is noticeably absent. Almost the only signs of a brisk commercial life are shown by the one hundred<br />\nbreweries, which are taxed to their uttermost<br />\nto provide for the proverbial Teutonic thirst<br />\nfor \"Das Bier.\"<br />\nThe two features of Munich, which make<br />\nusually the most impression upon foreigners,<br />\nare the prevalence of cafe life and the numbers<br />\nof princes and implied connection between<br />\nthese is not necessarily inferred, yet they manage to exist very harmoniously together.<br />\nPrinces may be seen of all grades, classes and<br />\nconditions.<br />\nThe cafes constitute the principal \"rendezvous\" for all classes. One of the most perplexing questions for an unsophisticated American<br />\nis to know what title to use in addressing a native. It is a mortal offense to employ anything<br />\nelse than a person's highest title. A man's title<br />\nis always used in addressing his frau.<br />\nAt the conclusion of the address Mr. Renouf, of the class of '98, and the editorial staff<br />\nof the NEWS LETTER made a short talk based<br />\nupon personal reminiscences of a long residence in Munich. Mr. Renouf spoke df the<br />\nGerman fondness for Sunday picnics and ex-<br /><br />\ncursions. Whole families together go out in<br />\nthe country for several miles, and spend the<br />\nday wandering around and climbing mountains, and while occupied in the latter pursuit<br />\nquite a number fall and break their necks,<br />\n\"which pastime,\" Mr. Renouf curiously remarked, \"they enjoyed very much.\"<br />\nHERE AND THERE.<br />\nThe Business Manager of THE NEWS-LETTER can be seen at the office of the paper,<br />\nRoom 15, in the Administration Building on<br />\nHoward street, every Wednesday from 12 to<br />\nBills for this year's subscription<br />\n2 o'clock.<br />\nare out, and it is desired that returns be<br />\nR. H. GRIMES,<br />\nprompt.<br />\nBusiness Manager.<br />\nThe man who refuses to subscribe for a college paper and then reads it over the shoulders of his neighbor is short enough to tie his<br />\nshoe tring to his neck-tie.—Drury Mirror.<br />\nExcellent authority says that the kicking of<br />\ngoals after touchdowns will be eliminated by<br />\nthe rules committee at its next meeting, and<br />\nthe scoring will be changed to five points for a<br />\ntouchdown, four for a goal from the field, and<br />\ntwo for a safety.—Exchange.<br />\n\"This world,\" the liar to the laggard cried,<br />\n\"Owes you a living. Snatch it if you can!\"<br />\n\"An earlier debt,\" the voice of truth replied,<br />\nMust first be paid. You owe the world a<br />\nman!\"—Exchange<br />\nSamson, the strongest man whom we read<br />\nabout in the good Book, was the first to advertise. He took two solid columns to demonstrate his stength, when several thousand people tumbled to his scheme, and he brought<br />\ndown the house.—The Miami Student.<br />\nMiss Allegro—He said I was a harp of a<br />\nthousand strings.<br />\nMiss Dolce—And what did you say?<br />\nMiss Allegro—I called him a lyre.<br />\nExchange.<br /><br />\nThe Bo'Lmtim SG hoot,<br /><br />\nRstatIi.shed<br /><br />\n.ARTHUR F. LAWRENCE &amp; CO.<br /><br />\n870 LINDEN AVENUE,<br />\nJ. A. DUNHAM, A. H., Hood Al ,Fst<br /><br />\nTelephone Call 182B.<br /><br />\nISMO.<br /><br />\nLeading Dealers in<br />\nscrovnisur<br /><br />\nThis school has a continuous history of over fifty years<br />\nIt was reorganized under its present management<br />\nin 1894.<br /><br />\nCOAL and WOOD<br />\nCENTRAL OFFICE,<br /><br />\n6 W. SARATOGA STREET,<br />\nY. C. C<br /><br />\n5. SUILOIN,:,<br /><br />\nBALTIMORE, MD.<br /><br />\nMarpland CHU Insurance and Crust Co.<br /><br />\nN. ROSENBAUM,<br /><br />\nEQUITABLE BUILDING, BALTIMORE.<br />\nTELEPHONE 1376.<br /><br />\nPine Custom Tailor,<br />\nCLEANING AND REPAIRING.<br /><br />\nT. K. WORTHINGTON,<br />\nI,. M. DUVALL,<br />\nJESSE HILLRS<br />\nVice-Presideut.<br />\nPresident.<br />\nSec'v-Treas.<br /><br />\nEXAMINES AND INSURES TITLES TO REAL AND<br />\nLEASEHOLD PROPERTY.<br /><br />\nNo. 812 NORTH HOWARD STREET,<br />\nNear Madison Street,<br /><br />\nBALTIMORE, MD.<br /><br />\nMoney to Loan on Mortgage (no commissions). Mortgages<br />\nand Ground Rents for Sale. Conveyancing.<br /><br />\nGIFFORD de JERSEY MESNY,<br /><br />\nDIRECTORS:<br />\nAlexander Brown.<br />\nEdgar 0. Miller,<br />\nrohn A. Whitridge,<br />\nJesse Mlles,<br />\nThomas Hill,<br />\nGeorge whitelock,<br />\nJacob I. Cohen,<br />\nC. C. Shriver,<br />\nE. H. Perkins,<br />\nIA. Goldenberg,<br />\nT. K. Worthington.<br />\nRates for Title Insurance furnished on application,<br /><br />\nTomorrow Is First Cousle to<br />\nThe sweet, sweet by and bye;<br />\nToday's the time for you to grab<br />\nThe bargains on the fly.<br />\nY. M. R.0. D.<br />\nThis great Reduction Sale of ours offers you the following bargains in Suits;<br />\nCheviot and Worsted Suits, made up in the most approved styles<br />\n—carefully lined throughout—sold for $22—redueed to $14.75.<br />\nCheviot and Worsted Suits that were bargains at $20—reduced<br />\nto $13.40.<br />\nCassimere and Cheviot Suits that attracted attention when sold<br />\nfor $18--reduced to $11.76.<br />\nCassimere and Cheviot Suits that pleased many patrons when<br />\nsold for 815—reduced to $10.75.<br />\nAnd than we have really excellent Suits that we have reduced<br />\nto 86.75.<br />\nPatent Beaver and Kersey Overcoats, beautiful goods, lined<br />\nthroughout with pure silk—sold for $15—reduced to $18.20.<br />\n820 Overcoats reduced to $14.75.<br />\n$16 Overcoats reduced to $10.75.<br />\nOvercoats of real goodness and durability reduced to 86.75.<br />\nA \"leader\" from our Furnishings Department for to-day only;<br />\nA surprising value in Stockings that formerly sold for 15e. per pair<br />\n—reduced to go. per pair; 3 for 260.<br /><br />\ntlea. L. Harrison,<br />\nPresident.<br /><br />\n226 NORTH CHARLES STREET.<br /><br />\nBuy your CIGARS, CIGARETTES AND SMOKING TOBACCO from<br /><br />\nHBFILD &amp;<br />\nNORTH EUTAW ST., Ncxr Ooon re HOOHIN• UNIVIROITY<br />\nWe carry a full line of Stationery,<br />\nalso New York and Baltimore Daily and Sunday Papers.<br />\notvE ns A CALL.<br /><br />\n639<br /><br />\nGENT'S<br />\nFINE FURNISHINGS<br /><br />\nIce<br /><br />\nhe Eutaw<br />\nA<br /><br />\nINAGINIER.<br /><br />\nLADIES'<br />\nFINE FURNISHINGS.<br />\nReduced Prices to suit the times<br /><br />\nLAnBuRa'S<br />\n611 N. HOWARD STREET,<br />\nBALTIMORE. MD.<br /><br />\nHAMBURGERS'<br /><br />\nrierchant Tailor.<br />\nSuits made to Order as Cheap as<br />\nReady-made Clothing.<br /><br />\nUse. P. Mordecai,<br />\nViee-President .<br /><br />\nArthur H. Hall,<br />\nSee'y and Treas.<br /><br />\nFOOT-BALL AND HOCKEY SUPPLIES.<br />\n120 E. BALTIMORE STREET.<br />\nBALTIMORE, MD.<br />\nTelephone 2573.<br /><br />\nFlorist<br /><br />\n•<br /><br />\nBaltimore and Howard<br />\n'Ste.<br /><br />\nThe A.G. Alford Sporting Goods Co.<br /><br />\nNews<br />\nMusic?'<br />\nStore is<br /><br />\nArtist Photographer,<br /><br />\nA few doors South of Johns Hopkins University<br />\nS1ECIAL DISCOUNTS to Students<br />\nmentioning this advertisement.<br /><br />\nI. SON COHEN,<br />\n521 N. EUTAW ST.<br /><br />\n•<br /><br />\nArtistic Floral Arrangements.<br />\nChoice Cut Flowers.<br /><br />\nMRS. OTTO SCHULER,<br />\n322 WEST SARATOGA ST.,<br /><br />\nNEAR EUTAW,<br /><br />\nBALTIMORE.<br /><br />\nF1149s<br /><br />\nocaniters<br /><br />\nRepairing of any description at<br />\nReduced Prices.<br />\nSuits Pressed While You Walt.<br />\nPants Pressed.<br />\n15c.<br />\nSuits Pressed<br />\n50c.<br />\nSuits Cleaned<br />\n.0.00<br />\nWork called for and delivered.<br /><br />\nSISCO<br />\n218<br /><br />\n134J9es<br /><br />\nBROS.<br /><br />\nN. Charles Street,<br />\nBALTIMORE, MD<br /><br />\nOYSTERS I<br />\nMAC FARLANE'S<br />\nOYSTERS!• No. 740 N. EUTAW STREET,<br />\nMeals at All Hours.<br />\nOysters a Specialty.<br />\nBILL OF FAKE.<br />\nAT TABLE:<br /><br />\n10 with trimmings<br />\nB with trimmings<br />\n4 with trimmings<br /><br />\nIN BOXES:<br /><br />\n. 25c<br />\n15e.<br />\n10e.<br /><br />\n13 Large Fried<br />\n8 Largo Fried<br />\nti Large Fried<br /><br />\n.250.<br />\n10e<br /><br />\nMadison Cycle Co.—m.0mm •••<br />\n315 Madison St.<br />\nPOOL PARLOR,<br />\nNEAR<br /><br />\nRepairing. Sundries. Bicycles For Hire 25 cents per hour.<br />\nSpecial rates to Students.<br />\nNicely furnished rooms for Students.<br /><br />\n••••.,<br /><br />\nLucke ex Sons, Merchant Tailors,<br />\nNO. 205 E. FAYETTE STREET.<br />\nOPPOSITE THE NEW POST OFFICE.<br /><br />\nBALTIMORE.<br /><br />\nWe will insure the finest workmanship and styles in Tailoring as<br />\nalso well-fitting garments<br />\nThe latest varieties of goods always on hand.<br /><br />\nFine Goods at<br />\nMBROSE d.:1?ERRY,<br />\nPopular Prices.<br />\n... Merchant Tailors ...<br />\n221 W.<br /><br />\nFayette Street, near Howard,<br />\nBALT1f1ORE, MD.<br /><br />\nBARTHOLOMAY BREWERY CO.<br />\nNUM<br /><br />\nJRO. Hal NZCR LIEU •<br /><br />\nW. J. WICKHAM<br /><br />\nHEINZERLING<br /><br />\nROCHESTER, N. Y.<br /><br />\n&amp; coOffice &amp; Factory,<br /><br />\nCHALLENGE<br /><br />\nGINGER ALE<br />\nOur<br />\nCLUB GINGER ALE<br />\nSpecialties: CHAMPAGNE CIDER(ExtraDry)<br /><br />\nBohemian or<br />\nBavarian ..ot<br />\nMaerzen<br />\nApollo ot ult<br /><br />\nSPARKLING KOLAFRA<br />\nTHONE • • •<br /><br />\n041<br /><br />\n1000—Telephone -2000<br /><br />\nBALTIMORE BRANCH:<br /><br />\nOffice and Depot, - 227-239 S.Central Ave.<br />\nGEO. C. SUCRO, MANSOER.<br /><br />\nMandolins<br />\nGuitars • •<br />\nBanjos.. •<br /><br />\nWashburn<br /><br />\n21-8-23 W. Conway St.<br /><br />\nare recommended<br />\nI, y the highest musical authorities<br />\nall over the world.<br /><br />\nNOW READY<br />\n. i.„),<br />\n,<br /><br />\n411 , •<br /><br />\niiLii<br /><br />\n898<br /><br />\n.4c1r). VAlitL06111<br />\n\"<br />\n)<br />\n.<br />\n4.<br />\n3<br />\n.k.<br />\n(Ok`»r<br /><br />\n;<br />\n;VGSVMA<br /><br />\nH. R. EISENBRANDT SONS,<br /><br />\n\"•-/t( ;.,04<br />\n,<br />\nP4V1<br /><br />\nSOLE AGIENTS,<br /><br />\na Month.<br />\nPianos$5 Low<br />\nPrices<br />\nEasiest Terms.<br /><br />\nSEND 6 IN STAMPS ACTUALCOST OF MAILING ANDGET ONE.<br /><br />\nN. E. Corner<br /><br />\nCHARLES AND LEXINGTON STS.<br /><br />\nTHE CHLORIDE oFSILVER DRY CELL BATTERYCO:<br />\nBALTIMORE, MD. U.S.A.<br /><br />\nWEST MADISON STREET SHOE REPAIRING COMPANY<br />\nis REPAIRING 8H0E8 FOR<br />\n85 CENTS -HAND SEWED.<br />\n'Phi same work that you pay 81.00 to $1.55.<br />\nMen's Half-soled and Heeled, Sewed, . . .<br />\n.<br />\n▪<br />\nNailed and Pegged, .<br />\n•<br />\nLadies' Half-soled said Hee.led,<br />\n. . . . .<br />\n.<br />\nChildren's \"<br /><br />\n700.<br />\n53c.<br />\nSSe.<br /><br />\nREMEMBER THE PLACE.<br /><br />\nNO. 217 W. MADISON STREET, BET. HOWARD ST. AND PARK AVE.<br />\nPostal Cards Receive Prompt Attention.<br />\nDelivered.<br /><br />\nOrders Called For and<br /><br />\nTYPEWRITER INSPECTION &amp; SUPPLY CO,<br />\n15 NORTH STREET.<br /><br />\nPrice Innovation I Cash Consideration<br />\n25 per cent. off each sale from this date. Our<br />\nimmense stock of Imported Woolens must<br />\nbe closed out by December 31st to accomplish important changes for our spring purchases.<br />\nJNO. M. KEELER,<br />\nMaker of Men's Garments.<br /><br />\nWe Sell or Rent all makes of Typewriters<br />\nat Lowest Prices.<br />\nTypewriter Supplies and f• Standard Machines<br />\nMimeograph Work.<br />\nrented at $1 per week<br /><br />\nThe Chas. Mims Surgical Instrument Co.<br />\nBENJ. A. NELSON, WWI Manager.<br /><br />\nMaannertgrlarrit of<br /><br />\nFINE StIRQICAL iNSTINMENTS,<br /><br />\nPhysicians', Surgeons', Hospital and Invalid Supplies,<br />\nElastic Hosiery, Trusses, Rubber Goods, dr.e.<br /><br />\n300 N. HOWARD ST.,<br /><br />\n6 N. CALVERT ST., Opp. P. 0.<br /><br />\nBALTIMORE, MD.<br /><br />\nTELEPHONE 771.<br /><br />\nNORTH GERMAN LLOYD'S.S. CO<br />\nCABIN PASSAGE AT LOW RATES.<br />\nA. SCHUMACHER &amp; CO.<br />\nFor particulars apply to<br />\nGeneral Agents.<br /><br />\n4<br />\n. NEW YORK TO BREMEN. ••••<br />\nLONDON, PARIS, CIBRALTAR,<br />\nNAPLES, CENOA, ETC.<br />\n4u BALTIMORE TO BREMEN •...<br />\nDIRECT.<br /><br />\nevery description.. .<br />\nBuilding Hardware ofWood<br />\nMantels and Tiling. Rolling Partitions, for dividing Sunday-School<br />\nrooms. Corbin's Door Check and Spring, to prevent<br />\ndoors from slamming. Electric Bells, Locksmithing,<br />\nKeys Fitted.<br /><br />\nF. H. DAVIDSON &amp; C.<br /><br />\n509 W. Franklin Street,<br /><br />\nBaltimore. Rd.<br /><br />\nTelephone 2093.<br /><br />\nATLANTIO TRANSPORT LINE.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers from<br />\nNew York to London at reasonable rates.<br /><br />\nBaltimore Storage &amp; Lighterage Co.,<br /><br />\nNew York Shipping Co.,<br /><br />\n403-409 WATER STREET,<br />\nBALTIMORE.<br /><br />\nI BROADWAY,<br />\nNEW YORK.<br /><br />\nJOHN V. RUPPERT,<br />\nMERCHANT TAILOR,<br /><br />\nNo. 617 N. EUTAW STREET, BALTIMORE, MD.<br />\nSuits to Order for 1110.00 and upwards.<br />\nScouring, Altering and Repairing a Specialty,<br /><br />\nPEABODY FIRE INSURANCE CO.<br />\nOffice 415 Water Street,[Second St.]<br />\nAdjoining Custom Houseon the West<br />\nShort Insurance for a Day<br />\nTHOMAS I. CARET, Prof.<br />\n.. or Longer Period.<br />\nBOARD OF<br /><br />\nJesse Tyson,<br />\nFrancis White,<br />\nRichard Cromwell,<br />\nILIUM)t. POT,leo'ty<br /><br />\nDIRECTORS.<br /><br />\nA. J. Ulman,<br />\nJoshua G. Harvey,<br />\nHenry James,<br />\nAndrew D. Joules.<br /><br />\nFerd. C. Latrobe,<br />\nWilliam Harvey<br />\nJames W. Bates<br />\nknit.<br /><br />\nGU(143ENHEIrIER, WEIL. &amp; CO.<br /><br />\nStudents'...<br />\nRequisites.<br /><br />"}], "field_media_file": [{"target_id": 36105, "display": null, "description": null, "target_type": "file", "target_uuid": "6d6c99d9-8448-44d6-8d5a-c86500d68446", "url": "http://digital.library.jhu.edu/system/files/2022-03/12102-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12102, "target_type": "node", "target_uuid": "40c917e0-05e6-41e6-8476-97cd3ee389f1", "url": "/node/12102"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "bcd1f336-5b31-441b-98ee-184d1c77511a"}]}