{"mid": [{"value": 35699}], "uuid": [{"value": "8d3a55ad-a110-4322-98b5-4b719f7f7ff2"}], "vid": [{"value": 35699}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12236-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VII, No. 10<br />\n<br />\nMarch 5, 1903<br />\n<br />\nTHE<br />\n<br />\nNEWS •LETTER<br />\n2 0W3<br />\nOZ9,<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns tionkins Universitil<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nTWENTY.SEVENTI-1 YEAR Beginning October 1, 1902.<br />\nPresident: Inn ItEmsEN. Dean of the Medical Faculty:<br />\nW 1LLIAM H. How KI.1.• Doi it j the Collette Faculty:<br />\nEimmtp H. GRIFFIN.<br />\n<br />\nInstruction.<br />\nFoR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(a) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nThe Johns Hopkins Pre.<br />\nlimerican 3ournal of Mat bematics.<br />\nF. Molt LEY, Editor. Quarterly. 4to.<br />\nXX V in progreas. $5 per \\ 0111010.<br />\n<br />\nVolume<br />\n<br />\nlimerican Cbcmical aournal.<br />\nI. RENSEN, Editor Monthly. Svo. Volume<br />\nXXIX in progress. $5 per volume.<br />\nlimerican *journal of Philology.<br />\nIt. L. G I LItERSLF,E V E, Editor. Quarterly. aro.<br />\nVolume XXIII in progress. 8 per volume.<br />\n%Witco from the liiological laboratory.<br />\nVolume V complete. $5 per volume.:<br />\n<br />\naye.<br />\n<br />\n%tubice in historicai nob Volttical SCiellCe.<br />\nMonthly. 8vo. Series XXI in progress. $8 per<br />\nvolume.<br />\n3ohns topkins 'University Circulars.<br />\nContaining reports of scientific and literary work<br />\nIn progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\njobns'WOMB 'hospital Sulletin. Monthly. On.<br />\nVolume XIV in progress $1 per year.<br />\n3obna hopkins hospital lleports. 4to. Volume IA<br />\nin progress. $5 per volume.<br />\n<br />\nLibraries.<br />\n<br />\nContributions to Essyriolo(y sob Comparatim<br />\n93ernitic Philology, Belt rage zur Assyriologie. etc.))<br />\nVol. IV complete.<br />\n<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nMemoirs from tbe Sioloatcal laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nIra liemsen.<br />\nJoseph S. Ames.<br />\nWiltinm B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit,.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nhistory,<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.).<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirin, F. Smith.<br />\nMaurice Bloomfield.<br />\nl'aul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\n..fames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n1. Chemical-Biologioal<br />\n(leading UP to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journai of Philology (vol<br />\nStudies in I listorical and Political Science(vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology_(vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\nMobern lanauage 'Motes.<br />\nA. M ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1.50 per volume.<br />\n:Journal of Experitnental flnebicine.<br />\nW. II. WELCH, Editor. lii-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\n2tmerican 'Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.41o. $5 per<br />\nvolume.<br />\n1Reports of finarylanb Ocoloatal Survey.<br />\nWILLIAM B.('LA RE, Editor.<br />\nterrestrial Magnetism anti litmospberic Elec.<br />\nWatt,<br />\n. L. A. BA IT ER, Editor. Quarterly. livo.<br />\nVolume VII in progress. $2.50 per volume.<br />\nIfteport.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\ntinnualllegtster.<br />\n(living the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academie year.<br />\n<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Howland.<br />\n<br />\n$7.50.<br />\n<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Mood. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Holikins Hospital. .1. 8. Billings, Editor. 116 pp. 4to. rkti plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Completti fac-simile edition. Edited by .1. kende' Harris. 110 pp. 4to. 10<br />\nplates. MAKI<br />\nReproduction in Phototype of Syriac MSS. with Antilegomena Epistles. Edited by I. H. Hall. $8.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\nII-III. Chemistry, Mineralogy and Geology. Parte<br />\nIV-V-Vi. Physics.Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\n11 full list of publications will be sent on<br />\n<br />\napplication.<br />\n<br />\nGommutioations in respect to exchanges and remittansei<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nMARCH 5, 1903.<br />\n<br />\nNo. 10.<br />\n<br />\nCOMMEMORATION DAY CELEBRATION.<br />\nOHNS HOPKINS celebrated the twenty-seventh anniversary of her foundation on Monday, February 23, by the customary commemoration exercises<br />\nwith which her birthdays have been regularly observed in the past. On<br />\nseveral recent occasions these exercises have been marked by announcements<br />\nof such importance as to excite interest wherever men are who concern themselves with the progress of American education. First came the University's •<br />\napplication for aid from the State of Maryland; then various statements concerning the movements set going to restore her to the stabler position of the<br />\nfore-time, movements gradually centering in that final one by which the endowment fund of $1,000,000 was completed last summer, and last of all, the opening<br />\nof \"The Promised Land\" on upper Charles street. The optimists who<br />\nexpected President Remsen to acknowledge the gift of funds ample to cover the<br />\nHomewood acres with stately buildings in which the great fame of Hopkins<br />\nshall grow greater, as a proper culmination to the double quick of earlier events,<br />\nwere not fully gratified. President Remsen's own remarks indicated that he<br />\nhimself knew of many such.<br />\n\"A gentleman stopped me on .the street the other day and declared he<br />\nwould^be sorely disappointed unless I announced that we have enough money<br />\nin hand to build at. Homewood,\" he said. \"I could only smile then, and I can<br />\ndo nothing better now.\"<br />\n\"If you ask,'what, then are you going to do with Homewood?' I should<br />\nreply, that we shall for the present study it—learn how it will best serve our<br />\nPurpose, and none but the ,best advice will suit us. You know already that<br />\nthe president of our Board, Mr. R. Brent Keyser, has provided funds to enable<br />\nus to secure expert advice. I may also tell you that the trustees, as many as<br />\ncan leave, will go this spring upon a tour of observation to learn what other<br />\nuniversities can teach us for the development of the Homewood land. They<br />\nwill visit Harvard, Yale, Princeton, Columbia, Cornell, Virginia and other<br />\nplaces, too, perhaps.\"<br />\nThe memory of Henry A. Rowland, whose researches in physics, contributing a great measure to the renown of Johns Hopkins, will endure of their<br />\nown merit, is assured of fuller perpetuation in the University itself by a gift •<br />\nannounced at the exercises. A student of the late Professor Rowland has<br />\noffered to buy a complete library covering the field of spectroscopy, which was<br />\n..<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\none of the special branches of science which Dr. Rowland cultivated for many<br />\nyears with great success. \"The Rowland Memorial Library of Spectroscopy\"<br />\nwill he the name of the new collection, and Mrs. Rowland has contributed to it<br />\nall of the Professor's own books on that subject.<br />\nBy the gift of $25,000 from Dr. and Mrs. Christian H. Herter, of New York,<br />\nthe University will be able to invite some eminent professor of that branch of<br />\nscience to lecture in Baltimore each year hereafter.<br />\nThe commemoration exercises were those which are generally familiar to<br />\nall who have ever been students at Johns Hopkins. The Academic procession,<br />\nthis year under the Chief Marshalship of Dr. Harry L Wilson, entered the<br />\nauditorium to a march rendered by an orchestra under the direction of Prof. W.<br />\nEdward Heimendahl of the Peabody Conservatory. President Remsen headed<br />\nthe line in company with the orator of the day, President Edwin A. Alderman,<br />\nof Tulane University, President Emeritus D. C. Gilman following with the<br />\nchaplain, Dr. Arthur Chilton Powell. The guests and several academic bodies<br />\ncoming after in the usual order.<br />\nThe President, the President Emeritus, and the Orator, occupied the center<br />\nof the stage, Dr. Remsen seated in the President Chair presented two years ago<br />\nby the Harvard Club of Maryland.<br />\nIn introducing the speaker of the day, President Remsen said: \"A year<br />\nago a company in Music Hall, at a banquet memorable in the annals of Johns<br />\nHopkins, weary, perhaps, with the lapse of hours, suddenly woke up. It was<br />\nnear midnight, but an electric shock had passed—a speech generated it. It<br />\ncould not last long, however, because the next day was Sunday. When we<br />\ncame to prepare for this occasion it occurred to us that we could do no better<br />\nthan invite the man who made that speech a year ago to continue it here this<br />\nmorning. It gives me great pleasure, accordingly, to present to you President<br />\nAlderman of Tulane University, New Orleans\"<br />\nPresident Alderman's address was devoted for the most part to a retrospective and prospective view of the South. In the most glowing manner he<br />\nspoke of the splendid and noble attributes of the old South, not, however,<br />\nneglecting to acknowledge those defects and vices which have disappeared<br />\nbefore the forces of modern civilization. Referring to the present time, Dr.<br />\nAlderman told of the great change that has now progressed so far, the passing<br />\nof the traditional and agricultural South into the active, modern industrial community. Believing that the South has before it a great future, along with the<br />\nrest of the nation, President Alderman feels that the great need of the South is<br />\nthe placing of its educational system upon an equal footing with that which<br />\nexists in the most advanced and prosperous parts of the land.<br />\nThe degree of Doctor of Philosophy was conferred upon Mr. Frederick<br />\nHutton Getman, University of Virginia; Mr. Benjamin Leroy Miller, A. B.,<br />\nUniversity of Kansas, 1897; Mr. Henry Nevi11 Sanders, A. B., Trinity University, Toronto, 1894, and Mr. Daniel Naylor Shoemaker, S. B., Earlham College, 1895.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nAs previously noted in THrt NEWS-LETTER, Dr. Getman will enter next<br />\nSeptember upon a physical chemical investigation under a recent grant from<br />\nthe Carnegie Institute.<br />\nThe growing interest in the exercises caused such a demand for tickets that<br />\nmany persons were unable to obtain them and even a number of those holding<br />\ntickets were unable to gain admittance into the assembly room. Referring to<br />\nthe necessity of having a larger auditorium in which to hold the Commemo<br />\nration Day exercises, Dr. Remsen said: \"I do not know whether or not this<br />\nhall will serve us another year for our present purposes. There are too many<br />\nin it at this moment; but notwithstanding this we have been obliged to turn<br />\naway a great many of those we should like to see here. This could not be<br />\navoided, but we will try to devise means by which we may have all our friends<br />\nwith us on future occasions of this sort.\"<br />\n<br />\nTHE ALUMNI BANQUET.<br />\n<br />\nt<br />\n<br />\nH E annual banquet of the Alumni Association held at the Carrollton Hotel<br />\non the night of the 23rd, made a fitting close for the day's celebration.<br />\nAt a short business meeting before the banquet, the gentlemen who had<br />\nbeen nominated by the Executive Committee, as announced in the last issue of<br />\nthe “liftws-LETTHR,\" were elected to hold office for the ensuing year. The<br />\ncompany then proceeded to the banquet hall, where an excellent dinner was<br />\nthoroughly enjoyed. At the conclusion, toast-master Dr. W. T. Sedgwick, the<br />\nretiring president of the association, made a short address of welcome to the<br />\nAlumni, in which he dwelt strongly on the national character of the University,<br />\nwhich he said was the pioneer in the work of nationalizing the educational field<br />\nof the country. He also spoke of the vast amount of useful work which the<br />\nUniversity could do if only the requisite funds were provided. Those who responded to toasts were:—<br />\nDr. Gilman. introduced as the \"Master of Johns Hopkins,\" who<br />\nspoke of the national influence exerted by the Univetsity, and mentioned many<br />\nof its graduates who have attained distinction in the various paths of life, es-,<br />\npecially in the province of higher education.<br />\nPresident Remsen, who emphasized the fact that the true purpose of a university was to train men for scientific investigation. He said that, as the de<br />\nmand for investigators in this country far exceeded the supply, he believed such<br />\ninstitutions as the Carnegie and Rockefellet Institutes to be detrimental; for<br />\nthey tend to draw away from the universities men fitted to train these investigators<br />\nDr. Alderman, who depicted the noble grander of the \"scholar-patriot.\"<br />\nMr. Theodore Marburg, who spoke on behalf of the trustees.<br />\nProfessor H. H. Donaldson, Ph. D., 1885, dean of graduate school of the<br />\nUniversity of Chicago.<br />\n.<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS—LETTER.<br />\nUNIVERSITY NOTES.<br />\n<br />\nHE School Board has asked President Remsen to select some one to chose<br />\n140 names of Marylatv'ers which may be appropriately used to designate<br />\nthe public schools of the city, and has appropriated the sum of $100 as<br />\ncompensation.<br />\n<br />\nt<br />\n<br />\n\"The Capacity of the Porto Ricans for Citizenship\" was the subject of a<br />\nlecture delivered by Dr. J. W. Hollander before the members of the \"Lend-aHand Club,\" on February 23.<br />\nAt the twenty-first anniversary of the founding of the Woman's Medical<br />\nCollege, on February 21, Dr. Henry M. Hurd delivered an address on \"The<br />\nStudy of Medicine.\"<br />\nDr. Wm. H. Howell was the guest of honor at the annual reunion and dinner of the New England Alumni Association held in Boston on the night of<br />\nFebruary 21.<br />\nDr. Paul Shorey, professor of Greek Literature at the University of Chicago,<br />\nwill lecture upon \"Realism and Idealism in Greek Literature\" in McCoy Hall<br />\non the evening of March 18. The lecture will be delivered under the auspices<br />\nof the Baltimore Society of the Archaeological Institute of America.<br />\nAt a meeting of the alumni and students of the Southern Home School held<br />\nin the Franklin Street Presbyterian Church, on February 26, it was decided, if<br />\n$5,000 could be raised, to establish a lectureship at the University as a fitting<br />\nmemorial to Mrs. Jane M. Cary, who died on January 22, and who was the<br />\nfounder of the school, and for many years its principal.<br />\n\"The Tale of Gyges and the King of Lydia\" by Dr. Kirby F. Smith which<br />\nwas published in The. American Journal of Philology, Vol. xxiii, No 3, has<br />\nbeen reprinted in a neat pamphlet.<br />\nBartgis McGlone, who, since receiving his A. B. last June, had been a<br />\ngraduate student in biology has been appointed instructor of biology at Illinois<br />\nWesleyan College.<br />\n• Dr. Olner L. Fassig delivered a lecture on \"Weather Forecasting, Ancient<br />\nand Modern\" before the members of the Philosophical Society of the Woman's<br />\nCollege on February 19. The lecture was illustrated with charts and designs.<br />\nThe New York Alumni Association held its annual banquet on the night<br />\nof February 28. Dean Griffin was the guest of honor, and delivered the principal address. Dr. J. M. Vincent, who was also in attendance, made a short<br />\nspeech<br />\nThe name of Professor Joseph S. Ames appears in a committee memoralizing Father Angelo Secchi, S. J., on the occasion of the twenty-fifth anniversary<br />\nof the death of the great Jesuit astronomer and physicist. Dr. Ames lately received from Rome a fine photo engraving of Secchi.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n5<br />\n<br />\nThe director of the Physical Labatory recently requested the co-operation<br />\nof other labatories, observatories, and investigators in the completion and<br />\nmaintenance Cif the \"Rowland Memorial Library of Spectroscopy,\" the founda<br />\ntion of which was announced on Commemoration Day. In reply he has re<br />\nceived several hundred promises of assistance, many of them accompanied by<br />\nvaluable books and reprints.<br />\nUNDERGRADUATE NOTES.<br />\nCCORDING to a report about the University the increased interest in<br />\nathletics and debating that several Seniors have recently shown is due to<br />\ntheir desire to be voted the most versatile man in the class.<br />\n<br />\n4<br />\n<br />\n•1<br />\n<br />\nOn the night of Monday, February 23, the Senior Class held its annual<br />\nbanquet at the St. James Hotel. This year's gathering was the occasion of<br />\neven a more glorious time than the Junior banquet of last year. Toastmaster<br />\nH. W. Plaggetneyer called upon Harry K. Tootle, Wm. S. Bird and W. M.<br />\nHunley, who responded in their most happy vein.<br />\nDr J. M. Vincent is delivering a series of illustrated lectures on \"Mediae,ral<br />\nArchitecture,\" before the members of the major history class.<br />\nMr. Howard Matthai has been appointed chairman of the Committee ot<br />\nArrangements for the inter-class debate. The date of the inter-collegiate debate<br />\nhas not been definitely announced, but it will not occur until after Easter.<br />\nR. Gordon Dulany was in New York on last Saturday where he represented<br />\nthe University at the annual meeting of the I. C. A. A. A. A.<br />\nALUMNI NOTES.<br />\nDr. N. A. Kent, who had been assistant in the Yerkes Observatory since<br />\nreceiving his doctor's degree two years ago, has resigned, in order to accept the<br />\nprofessorship of physic in Wabash College, Ind. Professor Kent will visit<br />\nfriends in this city next week.<br />\nA text-book of \"Practical Physics for Students of Science and Engineering,\" in four volumes, has just been published by Dr. Erwin S. Ferry, of<br />\nPurdue University. Professor Ferry at one time held a fellowship at the<br />\nUniversity.<br />\n'95<br />\nMr. Reuben C. Foster will be married to Miss Effie Tuttle, of Boston,<br />\non Wednesday, March 11<br />\nMr. Foster was elected treasurer of the Alumni<br />\nAssociation at its annual meeting on February 23.<br />\n98<br />\nRev. Albert C. Dieffenbach is pastor of a flourishing congregation which<br />\nhe established at Allegheny, Pa , in 1901.<br />\n\"98<br />\nHenry J. Lucke has resigned his professorship in physics at Lafayette<br />\nCollege in order to accept a position in the Patent Office at Washington..<br />\n<br />\n\fTHE,' NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tug JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nMARCH 5, 1903.<br />\n.Subscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\n<br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nW.S. BIRD 1908.<br />\nJ. NEWMAN NUMBER, 1904.<br />\nHARRY BAZTJER, 1903.<br />\nRiGOIN BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hop_<br />\nkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY liAETJER,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nECENTLY a great scare was given the men who make the barber shop their<br />\nofficial headquarters when not attending classes. Owing to an order<br />\nwhich emanated from some unknown source all the chairs were removed<br />\nfrom the room. Fortunately for those tired mortals who settle all the great<br />\nquestions of the day, while seated in the chairs which have been provided for<br />\nWalter's patrons, on the following day the chairs were returned, and the dove<br />\nof peace settled once more above the doorway. Had the chairs not been returned, although the NEWS.LETTER would have objected, yet it would have<br />\nbeen honest enough to acknowledge that there was wisdom in the order which<br />\nemanated from the aforesaid unseen source. We cannot deny that the barber<br />\nshop is most conducive to that most catching of college diseases—loafing. We<br />\ncannot deny that as a result of the above mentioned disease the place at times<br />\ndoes not present the most tidy appearance. We cannot deny that at times the<br />\natmosphere is dense with .the smoke of the vile weed. We cannot deny that<br />\nWalter some times gets so interested in a story or a colloquy that he inadvertently chips off a corner of the face of some trusting, unwary patron. In all<br />\nthis there is danger. But on the other hand there is one thing which, to our<br />\nmind, overbalances these drawbacks and turns the scales in favor of providing<br />\nseats for those men who prefer idleness to industry, and the freedom of a barber<br />\nshop debate to the august solemnness of the house or the senate. It is this<br />\n<br />\ng<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n7<br />\n<br />\nCollege life at best is but for a shOrt season. Soon the men who now are engaged<br />\nin looking at life from what we may call a theoretical view point will be looking<br />\nat the same problem from its practical side, and in mmory they will live over<br />\nagain their college days They will not think of the days spent in the laboratory as much EIS they will of the days spent in chasing the pigskin over the<br />\nfield, they will not think of the dry lectures as much as the wet banquets, and<br />\nthey will not think of the papers they read in class as much as they will of the<br />\nhours stolen from study to spend in the midst of that bohemian organization<br />\nknown as the Fernandig Club. In a word, it is not the memory of the duh<br />\nfaithfully done which brings the same pleasure in after years as the mcmory of<br />\nthose moments of relaxation when we .pause in the harness to take breath before continuing the steady pull up the hill. We have no historic \"fence\" upon<br />\nwhich the upper classmen may perch, we have no historic steps upon which the<br />\nmen may sing college ballads, we have nothing but Walter's barbershop. So<br />\nlet us try and preserve that intact. And may every man, when his day comes<br />\nto leave, carry away with him no darker view of college life than that he obtains in Walter's tonsorial parlor!<br />\nN an article in the last issue of the NEWS—LETTER under the heading of<br />\n\"Base Ball for 1903,\" it was stated that the \"statement may now be accepted as authoritative that Hopkins will have a base ball team this<br />\nseason.\" This was erroneous, and the NEWS LETTER regrets that it was given<br />\nto the public in a manner which seemed to vouch for the authenticity of the report. As long ago as the holidays the Athletic Board declared that there<br />\nwould be no representative team this season. It is true that a team composed<br />\nof Hopkins men will play during the season; but they have not the sanction ot<br />\nthe Athletic Board, nor are they at liberty to use Hopkins' name as has been<br />\ndone in several newspaper articles and in the last issue of the NEWS-LETTER.<br />\nThe base ball enthusiasts are in the main men from the Medical School, and if<br />\nthe team takes the field as an independent, self-supporting organization it might<br />\nwell be called the Johns Hopkins Medical School Base Ball Team, as at Yale<br />\nthere is a Yale Law School Base Ball Team. This would relieve the men from<br />\nbeing under the authority and discipline of the Athletic Association. Although<br />\nthe team will be composed of University men it must be understood that the<br />\nAthletic Association offers no guarantee for the fulfillment of their pledges<br />\n<br />\nj<br />\n<br />\nWING to the inclement weather the annual concert by the Musical Clubs<br />\nat Lehmann's Hall was not as largely attended as it would have been<br />\nunder more favorable conditions, But the management are well content<br />\nwith the financial result of the concert. From an artistic point of view the concert<br />\nwas a veritable triumph. The leaders showed excellent discrimination in their<br />\nselection of pieces,•and the men sang and played with that hearty good will<br />\nwhich characterizes college men when they have an apprecia'ive audience.<br />\nThe Easter trip is not far distant, and the men are certain of an enthusiastic reception wherever they appear if they keep up to the high mark set by<br />\ntheir Baltimore performance.<br />\n<br />\nO<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n8<br />\n<br />\nPROSPECTS FOR THE COMING DEBATE.<br />\nS the time draws nearer for the inter-class debate which will probably he<br />\nheld on March 2 1 st, interest on the part of those who are contesting for<br />\nthe various places on the teams is perceptibly increasing. Both Juniors<br />\nand Seniors are buckling down to work. and are sifting out all the material they<br />\ncan find on the subject of the debate. Practice is held every day under the<br />\ndirection of Dr. Lee and Mr. Burgess of the Baltimore School of Oratory, at<br />\nwhich times the echoes of McCoy Hall are rudely awakened by the impassioned<br />\neloquence of aspiring orators. Indeed, every indication seems to show that<br />\nboth sides will put up a stiff fight on the.night of the twenty-first.<br />\nThe cbntest has, however, narrowed down to six men on each side from<br />\nwhich the speakers and alternates of the two teams will be chosen.<br />\nFor the Seniors, these are Plaggemeyer, Blum, Strayer, Tootle, Addison,<br />\nGlocker.<br />\nFor the Juniors, they are Licking, Humrichouse, Foster, Rosenheim,<br />\nStollenwerck, Crozier.<br />\nIt has also been decided to have adviEers as in former years. The advisers<br />\nfor the Seniors will probably be Custis, Ammen, Parsons, and Hopper. Those<br />\nfor the Juniors wiil be chosen from Loyd, Emig, Geiger, Wallis, and Opie<br />\nThe Freshmen who will contest on the night of the debate for the medal<br />\noffered by Dr. Lee, will be selected from Strauglin, Boyce, Ziegler and Goldman.<br />\nAfter the inter-class contest, comes the debate with North Carolina. The<br />\nsouthern university has, so report says, put us down as one of their regular<br />\nannular scalps, but we want to disappoint them, and wipe out the defeat of<br />\nlast year by carrying victory into the heart of the Carolinas. To do this, every<br />\nman must come out and work. It is probable that the speakers who will represent Hopkins will be selected from the inter-class debating teams, but every<br />\nundergraduate is eligible, and, if he only makes manifest his latent ability, will<br />\nreceive due consideration. But those who do not possess the gift of eloquence<br />\nare not absolved. Valuable assistance can be rendered by a squad of enthusiastic workers who will help to write speeches,, run down material, and, above<br />\nall, criticise the arguments of the speakers, instead of waiting, as usual, for<br />\ndefeat to he announced before letting forth a stored.up flood of criticism.<br />\n<br />\nIIC<br />\n<br />\nCOLLEGE TAILOR PRIZES WON BY HOPKINS MEN.<br />\nHE February number of the College Tailor, which, we recall, is being Published by Lemmert, should be of especial interest to Hopkins men, not<br />\nonly because it is dedicated to the University of North Carolina with<br />\nwhom we have been on the most intimate terms, but because both the prize<br />\nstories therein were written by Hopkins men. In the first issue of the College<br />\nTailor, prizes were offered for the best football and hunting stories. These<br />\nwere captured by Mr. Walter B. Carver, leader of the Hopkins Glee Club, and<br />\nMr. Charles W. Kolb, who also studied at Hopkins.<br />\n<br />\nt<br />\n<br />\n\f9<br />\n<br />\nTHE-NEWS-LETTER.<br />\n<br />\nBesides the prize stories, the present issue contains several very clear half<br />\ntone cuts of the buildings at the University of North Carolina, a picture of<br />\nPresident F. P. Venable and a general article on the growth of the university<br />\nsince its foundation 108 years ago.<br />\nThe College Tailor is being edited by a clever young newspaper man of<br />\nBaltimore, who is far-sighted enough to make each issue of particular interest<br />\nto college men without sacrificing too much the interests of Lemmert, the<br />\npromoter.<br />\nThe idea is a novel and effective one for reaching the students at the dif'Trent institutions and promises to accomplish its purpose.<br />\n<br />\nOUR BARBER SHOP CHAIRS.<br />\n41.0.11.•••••-<br />\n<br />\nI love it, I love it, and who shall dare<br />\nTo chide me for loving my barber shop chair?<br />\nWe've treasured them long, and now they are ours<br />\nIf true squatter sovereignty gives any powers.<br />\nWe're bound by a thousand fond ties to our seats,<br />\nFor there ev'ry day the Fernandis Club meets.<br />\nWould you learn the spell?—'tis there we talk scandal,<br />\nAnd matters of state we can easily handle.<br />\nIn freshman days I lingered near<br />\nThose hallowed seats with listening ear;<br />\nAnd warm were the words which the club would give<br />\nIn teaching the way a man best should live.<br />\nThere heard I the freshest of things from society,<br />\nWith a dash of the green room to give them variety.<br />\n0 nothing I now recall ever compares<br />\nWith the wisdom I learned from those barber shop chairs.<br />\nI sat in my chair for many a day<br />\nWhen all thought of study had vanished away;<br />\nWhen youth was most rosy and nature most mild,<br />\nThe first of the month—when Dame Fortune had smiled—<br />\nIn poker I still was ahead of the game,<br />\nIn tossing up nickels my luck was the same;<br />\nFor then I was king, and the world was my own,<br />\nAnd I ruled it right well from my barber shop throne.<br />\n'Tis past. 'tis past, and hard is the rule<br />\nWhich leaves in the shop not even a stool.<br />\n'Tis there that we gossiped, and there we felt sure<br />\nFrom the faculty's onslaughts we were most secure.<br />\nLet Us rise in a body, insist on our right<br />\nOf having our chairs or of having a tight;<br />\nFor I love it, I love it, and I cannot tear<br />\nMy soul from the seat of my barber shop chair.<br />\n'03.<br />\n<br />\n\fir)<br />\n<br />\nTHE NEWS—LETTER..<br />\nLAST FRIDAY NIGHT'S CONCERT.<br />\n<br />\nt<br />\n<br />\nHE annual concert of our Glee, Banjo and Mandolin Clubs at Lehmann's<br />\nHall on February 27 was a great success. That the Baltimore public<br />\nappreciate a '`good thing\" when they see it was proved by the large audience which greeted them, and which enthusiastically applauded the various<br />\nselections.<br />\nThe concert hall was tastefully decorated with Southern smilax; the stage,<br />\nbanked with flowers and surmounted with the University motto in huge letters,<br />\nproduced a very pleasing effect. Placed at intervals on the walls were the different class flags, and the athletic banners,—reminders of 'varsity successes.<br />\nThe large number of patronesses, outside friends of the University, as well<br />\nas the wives of the members of the faculty, contributed much to the success of<br />\nthe evening.<br />\nThe program opened with the University Ode. Then came some rollicking<br />\nsongs, and marches by the banjo and mandolin clubs. Selections by the quartette appeared twice on the program, and each time the members, T. H. Coffin,<br />\nF. J. Hall, F. R. Ford and P. K. Gilman. received a warm reception from the<br />\naudience. The Glee Club was greatly appreciated in the 1902 and 1903 medleys, arranged by W. B Carver.<br />\nThe selection \"Violets\" was particularly well rendered by the mandolin<br />\nclub, as was also the \"Baltimore Centennial,\" in which \"Dixie\" was played as<br />\na clarionet solo, while the mandolins and violins played \"Maryland. My Maryland.\" The program ended with a new Hopkins song. \"The Toast Song,\" of<br />\nwhich the words and music were composed by R. S. Lanier, our ex-editor-inchief.<br />\nThe Mandolin Club is deserving of much praise. It surpasses last year's<br />\nclub in volume and unity of tone, and the members show that they have been<br />\nwell trained under their leader, J. W. Bryan. The Glee Club, under the able<br />\nleadership of W. B. Carver, did very satisfactory work, and is to be commended. The Banjo Club, with C. A. Marshall as leader, was excellent. They<br />\nplayed with the same spirit and dash that characterized last year's club.<br />\nAltogether the concert was successful from every point of view. The management and players are to be congratulated on their efforts. Most encouraging of all is the fact that the concert was a financial success, insuring the clubs<br />\na<br />\ngood Easter trip.<br />\n<br />\nY. M. C. A NOTES.<br />\n<br />\nO<br />\n<br />\nN Saturday evening, February 21, eight Hopkins men joined with about<br />\nfifty other men of Baltimore colleges in a Northfield supper at the invi •<br />\ntation of the Baltimore Mt. Hermon Club. The Mt. Hermon Club is<br />\nthe organization of the alumni of Mr Moody's school, just across the river<br />\nfrom Northfield, Mass. The object of the gathering was to arouse interest in<br />\nthe summer student conference at Northfield next summer, June 26 to July 5.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n11<br />\n<br />\nThis object tvas accomplished by six brief talks on the various sides of Northfield life and by much fun and reminiscing during the supper. There is always a strong feeling of friendship and enthusiasm among a party of men who<br />\nhave been to Northfield.<br />\nThe State convention for Delaware, Maryland and District of Columbia, in<br />\nBaltimore, March 6, 7 and 8, bids fair to be of interest to college men. The<br />\nSaturday sessions will be of special interest, and the afternoon, with possibly<br />\nthe morning session, will be held in Levering Hall. Mr. A. B. Williams, Jr.,<br />\nsecretary of college work of the east, will have charge of the student conference.<br />\nHe comes to us from a visit to the U. of P. and other institutions in the east,<br />\nand Hopkins should give him a good welcome. St. John's, Western Maryland<br />\nand other colleges expect to send large delegations. Hazlehurst, J. T. Smith,<br />\nJr., Sandrock, Hildt and Lloyd are a committee looking after the entertainment<br />\nof some of these men. It is desired that as many Hopkins men as possible<br />\nwill come to the Saturday afternoon session.<br />\nMr. Williams will remain a few days after the convention to meet the Hop •<br />\nkins men here and at the Medical School, and will lead the meeting Tuesday,<br />\nMarch 10, at 5 o'clock. He is a Yale man of considerable experience in college<br />\nassociation work.<br />\nThe attendance at morning prayers has fallen off lately. It is hoped that<br />\nChristian men who have the nine o'clock period on will avail themselves of<br />\nG.<br />\nthis little opportunity for quiet worship.<br />\n<br />\nAMONG THE COLLEGES.<br />\nThe University of Michigan has 15,000 alumni, Harvard has 14,000 and<br />\nYale 11,436.<br />\nThe new gymnasium which is beitig built at Princeton will be the largest<br />\nbuilding of its kind in the world, the main floor being 100 by 166 feet.<br />\nThe Yale Football Association bid a surplus in the treasury this year of<br />\n$17,077.<br />\nThe University of Leipsig will celebrate its five hundredth anniversary in<br />\n1909.<br />\nPresident Eliot of Harvard recommends the following plan for a student's<br />\nday: Ten hours for study, eight for sleep, two for exercise and four for meals<br />\nand social duties.—Ex. Is this a joke?<br />\nOne of the features of Yale's dining hall is the \"international table\" at<br />\nwhich are tren from almost all countries of Europe, from the Philippines,<br />\nJapan, and the Hawaiian Islands.<br />\nThe Carnegie Institute has granted $10,000 to the University of Chicago<br />\nYerfor research work, $6,000 goes to the department of geology and $4,000 to<br />\nkes observatory.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nLACROSSE DOINGS.<br />\niloPKINS LACROSSE SCHEDULE, 1903.<br />\nApril 4—University of Pennsylvania.<br />\nApril 1 I—Hobart College.<br />\nApril 18—Stevens Institute.<br />\nApril 25—Lehigh U niversity.<br />\nMay 2—Swarthnkme College.<br />\nMay 7—Crescent A. C.<br />\nJune fi—Toronto University.<br />\n<br />\nHEN we consider the fact that by this time next month the first game of<br />\nthe lacrosse season will have been played, it may readily be seen that<br />\nno little work must he done between now and then. Harvard, it is<br />\nsaid, has been playing in two inches of snow for the past two weeks and Lehigh<br />\nand Swarthmore have both heen doing outdoor work despite the weather. No<br />\nmatter how great an advantage the cage may be, the practice within its walls<br />\nmust nece,sarily be on a small scale and it is very important. that the squad<br />\nshould be gotten out as soon as possible in order to give the men an idea of the<br />\npositions and distances to be covered on a field of regulation size.<br />\nEx-Captain Schmeisser and Coach Abercrombie were much pleased with<br />\npractice<br />\nin the cage last Saturday. They both laid particular stress upon<br />\nthe<br />\nthe fact that the schedule this year is unquestionably the hardest ever arrayed<br />\nby the management, and urged the candidates to stop all smoking and drinking<br />\npreparatory to signing the training pledge which will probably be required next<br />\nweek. The remarkable work done by the 'Varsity twelve last year was mainly<br />\ndue to the fine condition of the men throughout the season. In a game requiring such a great amount of wind and endurance too much stress cannot be laid<br />\nupon the necessity of conscientious training. The absence of a training table<br />\nmake each player responsible in a large measure for his own condition. The<br />\ntrust should be rigidly lived up to by every man who has any chance to make<br />\nthe team.<br />\nRegarding the vacancies, there will be at least three attack and one defense positions to be filled by new men. The candidates who are at all promising have a good opportunity to figure in one or two, if not all the games. Just<br />\nat present the most promising men seem to be Custis, Matthai, Strobbar, Tay-<br />\n<br />\n(W<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n13<br />\n<br />\nUnforseen accidents allor, Pearre, FeoSenheim, HazlehUrst, Straus and<br />\nforegoing men are apt<br />\nthe<br />\nof<br />\nall<br />\nand<br />\nseason<br />\nthe<br />\nof<br />\nways occur during the course<br />\nis a good one.<br />\nchance<br />\nthe<br />\noys;<br />\nb<br />\nbusy,<br />\nto figure in one or more games. Get<br />\nHOPKINS AT GEORGETOWN GAMES.<br />\nUDGING from the list of Hopkins men who are to take part in the Georgetown games on Saturday night, we should carry off at least a few medals. Captain R. C. Hoffman has been putting the squad through all<br />\nkinds of preparatory stunts since the B. A. C. games. and should the handicapping be reasonable, we may expect to get a liberal share of the honors.<br />\nThe men who are to wear our cobors will be taken from the following: Dashes—<br />\nFreeze, Sladen, Bond, •Pessagno, Tootle, LeCron, Knight, Helmholz, Super.<br />\nMiddle Distance—England, Tootle, LeCron, C L. Stone, Boyce, Morse, Goode•<br />\nnow, Super, Freese, Captain R. C. Hoffman. Distance—Aedewell, Porter,<br />\nMorse, England. Shot Put— H. B. Stone, Lawson. Jumps—Taylor, Pessagno, Knight. Hurdles—Freese,•Heltuholz. Relay Race—England, Capt. Hoffman, Freeze, C. L. Stone, Sladen, Tootle; Morse, Redewell. Somewhat to Hopkins' disappointment, the relay race will be run with Villa Nova College. The<br />\nlatter institutions always turns out a, well trained team, but Captain Hoffman<br />\nwas greatly in hope that a contest could be arranged either with the Carlisle<br />\nIndians or the United States Naval Academy. The Indian management very<br />\nfrankly wrote Manag r Dulaney that the team was not in sufficiently good condition to run against Hopkins, while the Navy has not developed a relay team<br />\nthis season.<br />\nThe games w ill be both handicap and scratch, and altogether Hopkins ex<br />\npects a reasonab y fair chance in all the events.<br />\nFor several days past Manager Dulany and Physical Director McDermott<br />\nhave been tryi ng to secure special rates for the occasion. Even if they do not<br />\nsucceed, the usual Saturday fare is opzii to all, and there is no reason why<br />\na bunch of rooters should not go with the team. The games will be held in<br />\nConvention Hall, at 8 o'clock.<br />\n• In m ost of the events Hopkins will have our old friends, the Maryland and<br />\nthe Balti more Athletic Clubs to down. The Boys' Latin School and Marston's<br />\nhave also entered teams.<br />\n<br />\n3<br />\n<br />\nA piece of exceptional good fortune, which is not generally known to the<br />\nDirector MackderStiident body, was announced a few days ago by Physical<br />\nott. It is this: The Maryland Athletic Club has very kindly offered the<br />\nohns Hopkins track and field team the use of the Maryland Oval for training<br />\npurposes during the coming season.<br />\nThis is certainly a piece of genuine good luck, for the Oval is not only<br />\nmuch nearer town than Electric Park, but it is circled by a first-class quartermile cinder track. Besides this the grounds are strictly private and contain a<br />\nspacious club house equipped with,several shower baths.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nHopkins and M. A. C. have been on very intimate terms during the winter, and the present courtesy is simply a token of the good feeling which it is<br />\nhoped will continue to exist between Baltimore's most prominent institution of<br />\nlearning and her leading athletic organization.<br />\n<br />\nIf circumstances are favorable, Hopkins will hold her annual indoor games<br />\nat the Fifth Regiment Armory on March 28. No definite arrangements have as<br />\nyet been made.<br />\nBASE BALL ENTHUSIASTS.<br />\nASE BALL affairs began to assume a truly formidable aspect last Saturday afternoon, when 15 candidates showed up for the first regular practice of the season; and from now on they will report every Tuesday and<br />\nThursday, as well as on Saturday, for a little warming-up exercise. With the<br />\nfirst game only about two weeks off, it will be necessary for the men to attend<br />\nstrictly to business during the short time they can be together. As regards<br />\npractice, the base ball team is singularly unfortunate, in that the candidates are<br />\nso scattered that it is almost impossible to get them all together for practice,<br />\neven when grounds can be procured for the purpose. The team is further<br />\nhandicapped by the very limited amount of time that the \"medicos\" can spare.<br />\nIt is scarcely possible at this time to give with any great degree of accuracy the candidates for the several positions; therefore, too great faith must not<br />\nbe put in the following remarks Captain Whipple will again be seen doing<br />\nbusiness at the old stand in the box, with Ricksher, Wright, Crozier, and<br />\nPitcher as candidates for the same position. Constantine, who will give up<br />\nfirst base for a place behind the hat, may be succeeded by Ingraham or Goldman. Hand or Sladen will probably do the honors at second, with Marine or<br />\nNelson at third. Short will again be ably filled by Moore. For the outfield,<br />\n'the selection may be made from Wright, Marshall, Hand or Goldman. The<br />\nabove leaves Meloy, Campbell, and Straughn unaccounted for, as they cannot<br />\nyet be definitely located.<br />\nThe candidates who reported Saturday were: Whipple, Constantine, Ricksher, Ingraham, Meloy, Wright, Marine, Moore, Hand, Crozier, Sladen, Campbell, Goldman, Straughn and Pitcher. After the practice, a short, informal<br />\nbusiness meeting was held in the Trophy Room. The present prospects of the<br />\nteam are very bright, and all look forward to a successful season.<br />\n<br />\n(g<br />\n<br />\nThe relative numerical standing of the universities of the world, is as follows: First, Berlin, 13,070; second, Paris, 12,171; third. Cairo, 10,003; fourth,<br />\nVienna, 6,000; fifth, Budapest, 5,940; sixth, Naples, 5,165; seventh, Madrid,<br />\n5,118; eighth, Moscow, 4,691; ninth, Columbia, 4,499; tenth, Munich, 4,459;<br />\neleventh. Leipzig, 4,220; twelfth, Harvard, 4,142; thirteenth, California, 4,008.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nSOLILOQUY OF A BANQUETER.<br />\n<br />\nIr<br />\n<br />\nOW ! How that water sizzled going down! I am not going to make any<br />\nexcuses for myself. But really now, did I fall or was I pushed?<br />\nAnyway, the water-gon'<br />\ndrove off and left me. As an idiot, I deserve<br />\nthe can of salmon, the box of mustard plasters, and any other old prize that is<br />\nyearning for a nice unintelligent owner. Ouch! I didn't know that my head<br />\nwas so big. I wonder if some one sneaked up behind me and hit me with a<br />\nbrick? Pocketbook? That went long ago. I am vaguely conscious that I<br />\nhave put my name to more bills of lading—for booze---than I ever signed to<br />\nexamination papers. On my'honor, that's a fact.<br />\nHow did it start? Don't ask me. How do I know? I imagine that every<br />\none started in the afternoon, just to test their capacity. By evening we could<br />\njust manage to see the.dozen oysters spinning about on our plates. I don't<br />\nthink that I was worse than anyone else. I know I wasn't; I didn't sing.<br />\nYes, I did too. Something foolish about \"Did the Goat Eat the Spinach off<br />\nSister Susie's Hat?\" It must have been pathetic; the man next to me wept on<br />\nmy shoulder and gurgled something about losing one dearer than a sister.<br />\nI am trying to find the man who said that I hit a waiter on the eye with a<br />\nroll. and compromised for a dollar. I can't remember it. The only evidence<br />\nthat I have that it might be so is in the fact that I am minus the dollar. That's<br />\nnothing; I'm minus several of them. I must have been awful reckless. I<br />\nfound a champagne cork in my pocket. I hope some one gave it to me for a<br />\nsouvenir; I hope I didn't have the hardihood to do it myself. Four Bones! A<br />\nweek's board! Sixteen times to the Auditorium! Thirty two—lemonades!<br />\nWho'd have thought it?<br />\nIt's me to economize. Never tell me that wine is a mocker. I know it<br />\nalready. It is the only original tanglefoot. It took three of us to navigate. I<br />\nhad to hold the other two up. Them hold ME up! I guess not. I was the<br />\nmain support of that Complete Combination of Curiosities. Although there<br />\nwas no sleet on the pavement, I am well aware of the fact that there were distinct seismic sensations at different times. I wanted to take those two Indians<br />\n'home. They wanted' to take ME home. We compromised; none of us went<br />\nhome. We saw the cold gray dawn break, but we were broke first; we saw the<br />\nstars go out, but we had gone out first; we saw the moon grow pale, but we<br />\nwere paler than she. Today you can't hand me too many pledges to sign.<br />\nGood bye, I'm off to get some ice. for my head.<br />\n<br />\nCornell is the first American University to have a university club in England. The club, composed of graduates of Cornell, consists of forty members,<br />\nand is known as the Cornell Club of England.<br />\nThe following wail is heard from the \"Texan.\" \"Pretty soon you will<br />\nonly be able to look at the co-eds.through a glass cage.\"<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS—LETTER.<br />\nEXCHANGES.<br />\n<br />\nThe Princeton \" er'' calls attention to the following dainty bit from the<br />\nWellesley Magazine\":<br />\n\"The nightgown was very light. Millicent lifted it with surprise. Her<br />\nown felt quite different as she took them out of the bureau drawer—stiff and<br />\nsmooth in their white starchedness. This was a slim, soft thing. Her own<br />\nwere of unbleached muslin, plenty long, with a yoke, and a square collar, buttoning neatly at the throat. A little thrill of doubt ran over her as she slipped<br />\ninto this bit of softness. It fell around her ankles lingeringly; her throat rose<br />\nout of it with a sweet sense of freedom; the soft embroidery caressed her wrists.<br />\nShe drew her breath with a little doubting sense of immodesty and tingled anew<br />\nas she felt the cool folds She put out the light and stood in the shadow of a<br />\nmoonbeam, trembling in this keen. new consciousness of her own body. She<br />\ncould feel every curve of it under the thin, clinging thing. She had a strange,<br />\nsweet sympathy with her own warm flesh, and an apprehension of beautiful<br />\nthings, known to her before only through her eyes, seemed diffused through her<br />\nwhole body.\"<br />\nCOURT TALES.<br />\n<br />\n\"Well,\" observed the Merry Monarch as he playfully directed the Hose at<br />\nthe Pillory, \"I guess that is Watering Stocks a few!\"<br />\n\"Let me recommend,\" cried the Kindly Khedive, as his executioner submerged a victim in the Balkan, \"my perfected submarine craft,\"<br />\n\"I think I will hold the World's Fair here,\" remarked the Sententious<br />\nSolomon; \"bring on number 999, first.\"<br />\n\"That lightning calculator knows almost every chorus girl in town by<br />\nsight.\"<br />\n\"He has such a marvelous memory for figures.\"—Tier.<br />\nWidow (tearfully)—Yes, my daughters are now my only resources.<br />\nFriend—Take my advice, and husband your resources well.— Tiger.<br />\n<br />\nA WINTER IDYLL.<br />\n<br />\nThe moon was softly shining<br />\nIn the dark blue firmament,<br />\nAnd the stars were brightly twinkling,<br />\nAs in gleaming wonderment;<br />\nAnd the wind was softly sighing<br />\nAs they glided o'er the ice,<br />\nWhile she whispered to him gently,<br />\n\"Oh, say! Jimmie—ain't this nice?\"<br />\n—Cobrnilria Jester.<br />\n<br />\n\fOPEN ALL. NIGHT.<br />\n<br />\nWILIAXSON<br />\n<br />\nWATTS,<br />\n<br />\n4-,IDrug %-tores.<br />\nliinpard and Franklin Streets.<br />\n<br />\nBaltimore and Eutaw Streets.<br />\n<br />\n1Druge, ffancr aoobe. Verfunierp, troller /Articles, etgar)3, SoOa Water.<br />\n<br />\nse' se<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN BA LTI MOR E FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber tioods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT c4c.<br />\n<br />\nsr<br />\nC. & 13. 'Phone 03541-1'..‹.<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments.<br />\nDraughtsmen's and Engineers' Supplies<br />\nN. W. Corner<br />\nLexington and Liberty Sts. ISAI.TIM01-4L.<br />\n<br />\n704 MADISON AVE<br />\n<br />\nD.<br />\n<br />\nAgent for Kenffel 4. Esser Co., of New Fork.<br />\n<br />\nu-c<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nHenderson's<br />\n<br />\n.!‘<br />\n<br />\nUNIVERSITY<br />\nBOOK STORK<br />\nText Hooks, Note Hooks,<br />\nStudents' Supplies.<br />\n<br />\nmadison @ Howard Sts.<br />\n<br />\nIllieorporated 1 W714.<br />\n<br />\nSteona as the Stronaest.\"<br />\n<br />\nTItE FIDELITY MUTUilL LIFE INSUIVINGE<br />\nOF PtilLArDEI,PHiln%<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nFur Agency in Maryland or West<br />\n<br />\nIrgInhi,<br />\n<br />\nAddress,<br />\n<br />\nc. GRAttAnt, Manager<br />\n1400-8 Merchants Bank Bldg,, Baltimore, Md,<br />\n<br />\nFor Advertising Space in this Paper<br />\nAPPLY TO<br />\n<br />\n/<br />\nI<br />\n<br />\nV4<br />\nA7<br />\ndr4e0<br />\nI.<br />\nItE cOR. BAIN/mime 614a47/11<br />\nnrr.r.cc't,,lAi'e,7eowar..:0•<br />\n<br />\n,*.tf.<br />\n,<br />\na6r,Oeil(etw<br />\nPUBLISHERS.<br />\n<br />\n\fS600,000. Surplus aal Undluirlerl PHA $400,000<br />\n<br />\nSTIEFF PIANOS<br />\nMADE OP<br />\n<br />\nTsiric Ititsvr<br />\n<br />\nDrovers Sc MechaniGs Nat'l Bank,<br />\n<br />\nMATERIALS MCINEIF<br />\n<br />\nAND EXPERIENCE CAN<br />\nWAD...paw<br />\n<br />\nOF •ALTIMORE.<br />\n<br />\nHUY.<br />\n<br />\n9 N. 141 I l' IATY sT.<br />\n<br />\nrs an('<br />\nGUSHING EcGOMPfINY'8Botaotkiselle<br />\noners.<br />\n<br />\nJas. Clark, Prost<br />\nChas. 8. Miller, Cashier.<br />\n<br />\nL. Strouse, Via-Prod.<br />\nEdw. P. Hayden.'isn't Cashier.<br />\n<br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p,r year and upward.<br />\n<br />\nficcounts Solicited.<br />\n<br />\n34 W. BilLTIMORE STREET.<br />\nand Miscellaneous Books.<br />\nKelp constantly on hand the Text Hooks used<br />\nand the Woman's<br />\nUniversity<br />\nHopkins<br />\nJohns<br />\nin<br />\n#<br />\nglk<br />\nCollege of Baltimore.<br />\nSTATIONBRY—For School, Ninny, Office and Bank.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON,<br />\n<br />\nt.Ghool, Law, Medical, GlaSsical<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\n1101111111111111111111.111M111111111111111M111 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nall 0111(1 College<br />\n<br />\nOn Bale The .1. If. U. Pennants,<br />\nPennants.<br />\n<br />\nFOR<br />\n<br />\n\".<br />\n11St<br />\n;<br />\nj:N711<br />\nM A71(<br />\nR GO,submitted<br />\nSTRBLESamples<br />\nJOIlDfiN<br />\nof<br />\nReads as follows:<br />\nFrench Brandy—no adulterants,no coloring, tine quality.<br />\nOporto Fort -absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye WhImkey—no Fusel oil, no caramel, strictly pare<br />\nand old.<br />\nOlive 011—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nA<br />\n<br />\nllgenfritz Studio<br />\n<br />\nH. FETTING,<br />\nMANUFACTURER<br />\n<br />\nSuccessor to Cummins.<br />\n<br />\nOF<br />\n<br />\n(Brea Metter fraternitv 3ewe1rr,<br />\nplow<br />\n<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nCall anb ilixaMine our /Me 313efore Purehaeing.<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC.<br />\n<br />\n.ININNINUS & 11012SITY.<br />\nMERCHANT<br />\n<br />\n'rATILMRSI,<br />\n<br />\n'21 W. FA YETTM STREET.<br />\n<br />\na p. telephone 445-.<br />\nLibraries arranged and put in<br />\norder without removal. Of If<br />\n<br />\n.4# to R UZICKA<br />\nu,<br />\nBookbinder,<br />\n<br />\nlaot<br />\n,<br />\n•••••••,111.\"<br />\n<br />\nBOOKS!!<br />\n!!<br />\nSECOND=FIAND<br />\ns,<br />\nSchool, Medical and Miscellaneou<br />\nExchanged.<br />\nBought, Sold and<br />\n<br />\nPIPPEN'S 1300K STORE,<br />\n605 N. EliTiVW ST.<br />\nNtlar the University.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE.<br />\n<br />\nTHEO. WARNER-<br />\n<br />\nWARNER eic CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nTi<br />\nManufacturers of<br />\n11 S Caps<br />\nSilk and Cassimere Hats. 4°'\"<br />\n<br />\nop<br />\n<br />\nNORTH GERMAN LLOYD S. S. GO.<br />\n<br />\ni<br />\n<br />\nCABIN PASSAGE fiT LOW RATES.<br />\n<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBfiLTIMORE TO BRE,MEN DIRECT.<br />\n<br />\nft. SGHUNifiGHER Sc GO., General<br />\n<br />\nFor particulars applu to<br />\n<br />\nISAAC H. DIXON,<br />\nJAS. R<br />\n<br />\nTHE<br />\n<br />\nChas. Willms Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICRO-SSORI ES.<br />\nSCOPES AND ACCr-<br />\n<br />\n300 N. Howard St.,<br />\n<br />\n'Baltimore, Md.<br />\n<br />\nAgents.<br />\n<br />\n.JAS. MEIKLE, Vucc-PResr.<br />\nRICHARDS, TREAS.<br />\n<br />\nSmith, Dixon Co.<br />\n29 31 S. Charles Street.<br />\n<br />\n1\\<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VII, No. 10<br /><br />\nMarch 5, 1903<br /><br />\nTHE<br /><br />\nNEWS •LETTER<br />\n2 0W3<br />\nOZ9,<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns tionkins Universitil<br />\nBALTIMORE, MARYLAND.<br /><br />\nTWENTY.SEVENTI-1 YEAR Beginning October 1, 1902.<br />\nPresident: Inn ItEmsEN. Dean of the Medical Faculty:<br />\nW 1LLIAM H. How KI.1.• Doi it j the Collette Faculty:<br />\nEimmtp H. GRIFFIN.<br /><br />\nInstruction.<br />\nFoR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(a) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nThe Johns Hopkins Pre.<br />\nlimerican 3ournal of Mat bematics.<br />\nF. Molt LEY, Editor. Quarterly. 4to.<br />\nXX V in progreas. $5 per \\ 0111010.<br /><br />\nVolume<br /><br />\nlimerican Cbcmical aournal.<br />\nI. RENSEN, Editor Monthly. Svo. Volume<br />\nXXIX in progress. $5 per volume.<br />\nlimerican *journal of Philology.<br />\nIt. L. G I LItERSLF,E V E, Editor. Quarterly. aro.<br />\nVolume XXIII in progress. 8 per volume.<br />\n%Witco from the liiological laboratory.<br />\nVolume V complete. $5 per volume.:<br /><br />\naye.<br /><br />\n%tubice in historicai nob Volttical SCiellCe.<br />\nMonthly. 8vo. Series XXI in progress. $8 per<br />\nvolume.<br />\n3ohns topkins 'University Circulars.<br />\nContaining reports of scientific and literary work<br />\nIn progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\njobns'WOMB 'hospital Sulletin. Monthly. On.<br />\nVolume XIV in progress $1 per year.<br />\n3obna hopkins hospital lleports. 4to. Volume IA<br />\nin progress. $5 per volume.<br /><br />\nLibraries.<br /><br />\nContributions to Essyriolo(y sob Comparatim<br />\n93ernitic Philology, Belt rage zur Assyriologie. etc.))<br />\nVol. IV complete.<br /><br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nMemoirs from tbe Sioloatcal laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\nLaboratories.<br /><br />\nDirectors.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nIra liemsen.<br />\nJoseph S. Ames.<br />\nWiltinm B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Osier.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit,.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nhistory,<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.).<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirin, F. Smith.<br />\nMaurice Bloomfield.<br />\nl'aul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\n..fames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n1. Chemical-Biologioal<br />\n(leading UP to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journai of Philology (vol<br />\nStudies in I listorical and Political Science(vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology_(vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars(vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\nMobern lanauage 'Motes.<br />\nA. M ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1.50 per volume.<br />\n:Journal of Experitnental flnebicine.<br />\nW. II. WELCH, Editor. lii-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\n2tmerican 'Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.41o. $5 per<br />\nvolume.<br />\n1Reports of finarylanb Ocoloatal Survey.<br />\nWILLIAM B.('LA RE, Editor.<br />\nterrestrial Magnetism anti litmospberic Elec.<br />\nWatt,<br />\n. L. A. BA IT ER, Editor. Quarterly. livo.<br />\nVolume VII in progress. $2.50 per volume.<br />\nIfteport.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\ntinnualllegtster.<br />\n(living the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academie year.<br /><br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Howland.<br /><br />\n$7.50.<br /><br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Mood. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Holikins Hospital. .1. 8. Billings, Editor. 116 pp. 4to. rkti plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Completti fac-simile edition. Edited by .1. kende' Harris. 110 pp. 4to. 10<br />\nplates. MAKI<br />\nReproduction in Phototype of Syriac MSS. with Antilegomena Epistles. Edited by I. H. Hall. $8.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\nII-III. Chemistry, Mineralogy and Geology. Parte<br />\nIV-V-Vi. Physics.Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\n11 full list of publications will be sent on<br /><br />\napplication.<br /><br />\nGommutioations in respect to exchanges and remittansei<br />\nmay be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nMARCH 5, 1903.<br /><br />\nNo. 10.<br /><br />\nCOMMEMORATION DAY CELEBRATION.<br />\nOHNS HOPKINS celebrated the twenty-seventh anniversary of her foundation on Monday, February 23, by the customary commemoration exercises<br />\nwith which her birthdays have been regularly observed in the past. On<br />\nseveral recent occasions these exercises have been marked by announcements<br />\nof such importance as to excite interest wherever men are who concern themselves with the progress of American education. First came the University's •<br />\napplication for aid from the State of Maryland; then various statements concerning the movements set going to restore her to the stabler position of the<br />\nfore-time, movements gradually centering in that final one by which the endowment fund of $1,000,000 was completed last summer, and last of all, the opening<br />\nof \"The Promised Land\" on upper Charles street. The optimists who<br />\nexpected President Remsen to acknowledge the gift of funds ample to cover the<br />\nHomewood acres with stately buildings in which the great fame of Hopkins<br />\nshall grow greater, as a proper culmination to the double quick of earlier events,<br />\nwere not fully gratified. President Remsen's own remarks indicated that he<br />\nhimself knew of many such.<br />\n\"A gentleman stopped me on .the street the other day and declared he<br />\nwould^be sorely disappointed unless I announced that we have enough money<br />\nin hand to build at. Homewood,\" he said. \"I could only smile then, and I can<br />\ndo nothing better now.\"<br />\n\"If you ask,'what, then are you going to do with Homewood?' I should<br />\nreply, that we shall for the present study it—learn how it will best serve our<br />\nPurpose, and none but the ,best advice will suit us. You know already that<br />\nthe president of our Board, Mr. R. Brent Keyser, has provided funds to enable<br />\nus to secure expert advice. I may also tell you that the trustees, as many as<br />\ncan leave, will go this spring upon a tour of observation to learn what other<br />\nuniversities can teach us for the development of the Homewood land. They<br />\nwill visit Harvard, Yale, Princeton, Columbia, Cornell, Virginia and other<br />\nplaces, too, perhaps.\"<br />\nThe memory of Henry A. Rowland, whose researches in physics, contributing a great measure to the renown of Johns Hopkins, will endure of their<br />\nown merit, is assured of fuller perpetuation in the University itself by a gift •<br />\nannounced at the exercises. A student of the late Professor Rowland has<br />\noffered to buy a complete library covering the field of spectroscopy, which was<br />\n..<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\none of the special branches of science which Dr. Rowland cultivated for many<br />\nyears with great success. \"The Rowland Memorial Library of Spectroscopy\"<br />\nwill he the name of the new collection, and Mrs. Rowland has contributed to it<br />\nall of the Professor's own books on that subject.<br />\nBy the gift of $25,000 from Dr. and Mrs. Christian H. Herter, of New York,<br />\nthe University will be able to invite some eminent professor of that branch of<br />\nscience to lecture in Baltimore each year hereafter.<br />\nThe commemoration exercises were those which are generally familiar to<br />\nall who have ever been students at Johns Hopkins. The Academic procession,<br />\nthis year under the Chief Marshalship of Dr. Harry L Wilson, entered the<br />\nauditorium to a march rendered by an orchestra under the direction of Prof. W.<br />\nEdward Heimendahl of the Peabody Conservatory. President Remsen headed<br />\nthe line in company with the orator of the day, President Edwin A. Alderman,<br />\nof Tulane University, President Emeritus D. C. Gilman following with the<br />\nchaplain, Dr. Arthur Chilton Powell. The guests and several academic bodies<br />\ncoming after in the usual order.<br />\nThe President, the President Emeritus, and the Orator, occupied the center<br />\nof the stage, Dr. Remsen seated in the President Chair presented two years ago<br />\nby the Harvard Club of Maryland.<br />\nIn introducing the speaker of the day, President Remsen said: \"A year<br />\nago a company in Music Hall, at a banquet memorable in the annals of Johns<br />\nHopkins, weary, perhaps, with the lapse of hours, suddenly woke up. It was<br />\nnear midnight, but an electric shock had passed—a speech generated it. It<br />\ncould not last long, however, because the next day was Sunday. When we<br />\ncame to prepare for this occasion it occurred to us that we could do no better<br />\nthan invite the man who made that speech a year ago to continue it here this<br />\nmorning. It gives me great pleasure, accordingly, to present to you President<br />\nAlderman of Tulane University, New Orleans\"<br />\nPresident Alderman's address was devoted for the most part to a retrospective and prospective view of the South. In the most glowing manner he<br />\nspoke of the splendid and noble attributes of the old South, not, however,<br />\nneglecting to acknowledge those defects and vices which have disappeared<br />\nbefore the forces of modern civilization. Referring to the present time, Dr.<br />\nAlderman told of the great change that has now progressed so far, the passing<br />\nof the traditional and agricultural South into the active, modern industrial community. Believing that the South has before it a great future, along with the<br />\nrest of the nation, President Alderman feels that the great need of the South is<br />\nthe placing of its educational system upon an equal footing with that which<br />\nexists in the most advanced and prosperous parts of the land.<br />\nThe degree of Doctor of Philosophy was conferred upon Mr. Frederick<br />\nHutton Getman, University of Virginia; Mr. Benjamin Leroy Miller, A. B.,<br />\nUniversity of Kansas, 1897; Mr. Henry Nevi11 Sanders, A. B., Trinity University, Toronto, 1894, and Mr. Daniel Naylor Shoemaker, S. B., Earlham College, 1895.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nAs previously noted in THrt NEWS-LETTER, Dr. Getman will enter next<br />\nSeptember upon a physical chemical investigation under a recent grant from<br />\nthe Carnegie Institute.<br />\nThe growing interest in the exercises caused such a demand for tickets that<br />\nmany persons were unable to obtain them and even a number of those holding<br />\ntickets were unable to gain admittance into the assembly room. Referring to<br />\nthe necessity of having a larger auditorium in which to hold the Commemo<br />\nration Day exercises, Dr. Remsen said: \"I do not know whether or not this<br />\nhall will serve us another year for our present purposes. There are too many<br />\nin it at this moment; but notwithstanding this we have been obliged to turn<br />\naway a great many of those we should like to see here. This could not be<br />\navoided, but we will try to devise means by which we may have all our friends<br />\nwith us on future occasions of this sort.\"<br /><br />\nTHE ALUMNI BANQUET.<br /><br />\nt<br /><br />\nH E annual banquet of the Alumni Association held at the Carrollton Hotel<br />\non the night of the 23rd, made a fitting close for the day's celebration.<br />\nAt a short business meeting before the banquet, the gentlemen who had<br />\nbeen nominated by the Executive Committee, as announced in the last issue of<br />\nthe “liftws-LETTHR,\" were elected to hold office for the ensuing year. The<br />\ncompany then proceeded to the banquet hall, where an excellent dinner was<br />\nthoroughly enjoyed. At the conclusion, toast-master Dr. W. T. Sedgwick, the<br />\nretiring president of the association, made a short address of welcome to the<br />\nAlumni, in which he dwelt strongly on the national character of the University,<br />\nwhich he said was the pioneer in the work of nationalizing the educational field<br />\nof the country. He also spoke of the vast amount of useful work which the<br />\nUniversity could do if only the requisite funds were provided. Those who responded to toasts were:—<br />\nDr. Gilman. introduced as the \"Master of Johns Hopkins,\" who<br />\nspoke of the national influence exerted by the Univetsity, and mentioned many<br />\nof its graduates who have attained distinction in the various paths of life, es-,<br />\npecially in the province of higher education.<br />\nPresident Remsen, who emphasized the fact that the true purpose of a university was to train men for scientific investigation. He said that, as the de<br />\nmand for investigators in this country far exceeded the supply, he believed such<br />\ninstitutions as the Carnegie and Rockefellet Institutes to be detrimental; for<br />\nthey tend to draw away from the universities men fitted to train these investigators<br />\nDr. Alderman, who depicted the noble grander of the \"scholar-patriot.\"<br />\nMr. Theodore Marburg, who spoke on behalf of the trustees.<br />\nProfessor H. H. Donaldson, Ph. D., 1885, dean of graduate school of the<br />\nUniversity of Chicago.<br />\n.<br /><br />\n4<br /><br />\nTHE NEWS—LETTER.<br />\nUNIVERSITY NOTES.<br /><br />\nHE School Board has asked President Remsen to select some one to chose<br />\n140 names of Marylatv'ers which may be appropriately used to designate<br />\nthe public schools of the city, and has appropriated the sum of $100 as<br />\ncompensation.<br /><br />\nt<br /><br />\n\"The Capacity of the Porto Ricans for Citizenship\" was the subject of a<br />\nlecture delivered by Dr. J. W. Hollander before the members of the \"Lend-aHand Club,\" on February 23.<br />\nAt the twenty-first anniversary of the founding of the Woman's Medical<br />\nCollege, on February 21, Dr. Henry M. Hurd delivered an address on \"The<br />\nStudy of Medicine.\"<br />\nDr. Wm. H. Howell was the guest of honor at the annual reunion and dinner of the New England Alumni Association held in Boston on the night of<br />\nFebruary 21.<br />\nDr. Paul Shorey, professor of Greek Literature at the University of Chicago,<br />\nwill lecture upon \"Realism and Idealism in Greek Literature\" in McCoy Hall<br />\non the evening of March 18. The lecture will be delivered under the auspices<br />\nof the Baltimore Society of the Archaeological Institute of America.<br />\nAt a meeting of the alumni and students of the Southern Home School held<br />\nin the Franklin Street Presbyterian Church, on February 26, it was decided, if<br />\n$5,000 could be raised, to establish a lectureship at the University as a fitting<br />\nmemorial to Mrs. Jane M. Cary, who died on January 22, and who was the<br />\nfounder of the school, and for many years its principal.<br />\n\"The Tale of Gyges and the King of Lydia\" by Dr. Kirby F. Smith which<br />\nwas published in The. American Journal of Philology, Vol. xxiii, No 3, has<br />\nbeen reprinted in a neat pamphlet.<br />\nBartgis McGlone, who, since receiving his A. B. last June, had been a<br />\ngraduate student in biology has been appointed instructor of biology at Illinois<br />\nWesleyan College.<br />\n• Dr. Olner L. Fassig delivered a lecture on \"Weather Forecasting, Ancient<br />\nand Modern\" before the members of the Philosophical Society of the Woman's<br />\nCollege on February 19. The lecture was illustrated with charts and designs.<br />\nThe New York Alumni Association held its annual banquet on the night<br />\nof February 28. Dean Griffin was the guest of honor, and delivered the principal address. Dr. J. M. Vincent, who was also in attendance, made a short<br />\nspeech<br />\nThe name of Professor Joseph S. Ames appears in a committee memoralizing Father Angelo Secchi, S. J., on the occasion of the twenty-fifth anniversary<br />\nof the death of the great Jesuit astronomer and physicist. Dr. Ames lately received from Rome a fine photo engraving of Secchi.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n5<br /><br />\nThe director of the Physical Labatory recently requested the co-operation<br />\nof other labatories, observatories, and investigators in the completion and<br />\nmaintenance Cif the \"Rowland Memorial Library of Spectroscopy,\" the founda<br />\ntion of which was announced on Commemoration Day. In reply he has re<br />\nceived several hundred promises of assistance, many of them accompanied by<br />\nvaluable books and reprints.<br />\nUNDERGRADUATE NOTES.<br />\nCCORDING to a report about the University the increased interest in<br />\nathletics and debating that several Seniors have recently shown is due to<br />\ntheir desire to be voted the most versatile man in the class.<br /><br />\n4<br /><br />\n•1<br /><br />\nOn the night of Monday, February 23, the Senior Class held its annual<br />\nbanquet at the St. James Hotel. This year's gathering was the occasion of<br />\neven a more glorious time than the Junior banquet of last year. Toastmaster<br />\nH. W. Plaggetneyer called upon Harry K. Tootle, Wm. S. Bird and W. M.<br />\nHunley, who responded in their most happy vein.<br />\nDr J. M. Vincent is delivering a series of illustrated lectures on \"Mediae,ral<br />\nArchitecture,\" before the members of the major history class.<br />\nMr. Howard Matthai has been appointed chairman of the Committee ot<br />\nArrangements for the inter-class debate. The date of the inter-collegiate debate<br />\nhas not been definitely announced, but it will not occur until after Easter.<br />\nR. Gordon Dulany was in New York on last Saturday where he represented<br />\nthe University at the annual meeting of the I. C. A. A. A. A.<br />\nALUMNI NOTES.<br />\nDr. N. A. Kent, who had been assistant in the Yerkes Observatory since<br />\nreceiving his doctor's degree two years ago, has resigned, in order to accept the<br />\nprofessorship of physic in Wabash College, Ind. Professor Kent will visit<br />\nfriends in this city next week.<br />\nA text-book of \"Practical Physics for Students of Science and Engineering,\" in four volumes, has just been published by Dr. Erwin S. Ferry, of<br />\nPurdue University. Professor Ferry at one time held a fellowship at the<br />\nUniversity.<br />\n'95<br />\nMr. Reuben C. Foster will be married to Miss Effie Tuttle, of Boston,<br />\non Wednesday, March 11<br />\nMr. Foster was elected treasurer of the Alumni<br />\nAssociation at its annual meeting on February 23.<br />\n98<br />\nRev. Albert C. Dieffenbach is pastor of a flourishing congregation which<br />\nhe established at Allegheny, Pa , in 1901.<br />\n\"98<br />\nHenry J. Lucke has resigned his professorship in physics at Lafayette<br />\nCollege in order to accept a position in the Patent Office at Washington..<br /><br />\nTHE,' NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of Tug JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nMARCH 5, 1903.<br />\n.Subscription $1.50 per year.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br /><br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br /><br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nW.S. BIRD 1908.<br />\nJ. NEWMAN NUMBER, 1904.<br />\nHARRY BAZTJER, 1903.<br />\nRiGOIN BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hop_<br />\nkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY liAETJER,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nECENTLY a great scare was given the men who make the barber shop their<br />\nofficial headquarters when not attending classes. Owing to an order<br />\nwhich emanated from some unknown source all the chairs were removed<br />\nfrom the room. Fortunately for those tired mortals who settle all the great<br />\nquestions of the day, while seated in the chairs which have been provided for<br />\nWalter's patrons, on the following day the chairs were returned, and the dove<br />\nof peace settled once more above the doorway. Had the chairs not been returned, although the NEWS.LETTER would have objected, yet it would have<br />\nbeen honest enough to acknowledge that there was wisdom in the order which<br />\nemanated from the aforesaid unseen source. We cannot deny that the barber<br />\nshop is most conducive to that most catching of college diseases—loafing. We<br />\ncannot deny that as a result of the above mentioned disease the place at times<br />\ndoes not present the most tidy appearance. We cannot deny that at times the<br />\natmosphere is dense with .the smoke of the vile weed. We cannot deny that<br />\nWalter some times gets so interested in a story or a colloquy that he inadvertently chips off a corner of the face of some trusting, unwary patron. In all<br />\nthis there is danger. But on the other hand there is one thing which, to our<br />\nmind, overbalances these drawbacks and turns the scales in favor of providing<br />\nseats for those men who prefer idleness to industry, and the freedom of a barber<br />\nshop debate to the august solemnness of the house or the senate. It is this<br /><br />\ng<br /><br />\nTHE NEWS LETTER.<br /><br />\n7<br /><br />\nCollege life at best is but for a shOrt season. Soon the men who now are engaged<br />\nin looking at life from what we may call a theoretical view point will be looking<br />\nat the same problem from its practical side, and in mmory they will live over<br />\nagain their college days They will not think of the days spent in the laboratory as much EIS they will of the days spent in chasing the pigskin over the<br />\nfield, they will not think of the dry lectures as much as the wet banquets, and<br />\nthey will not think of the papers they read in class as much as they will of the<br />\nhours stolen from study to spend in the midst of that bohemian organization<br />\nknown as the Fernandig Club. In a word, it is not the memory of the duh<br />\nfaithfully done which brings the same pleasure in after years as the mcmory of<br />\nthose moments of relaxation when we .pause in the harness to take breath before continuing the steady pull up the hill. We have no historic \"fence\" upon<br />\nwhich the upper classmen may perch, we have no historic steps upon which the<br />\nmen may sing college ballads, we have nothing but Walter's barbershop. So<br />\nlet us try and preserve that intact. And may every man, when his day comes<br />\nto leave, carry away with him no darker view of college life than that he obtains in Walter's tonsorial parlor!<br />\nN an article in the last issue of the NEWS—LETTER under the heading of<br />\n\"Base Ball for 1903,\" it was stated that the \"statement may now be accepted as authoritative that Hopkins will have a base ball team this<br />\nseason.\" This was erroneous, and the NEWS LETTER regrets that it was given<br />\nto the public in a manner which seemed to vouch for the authenticity of the report. As long ago as the holidays the Athletic Board declared that there<br />\nwould be no representative team this season. It is true that a team composed<br />\nof Hopkins men will play during the season; but they have not the sanction ot<br />\nthe Athletic Board, nor are they at liberty to use Hopkins' name as has been<br />\ndone in several newspaper articles and in the last issue of the NEWS-LETTER.<br />\nThe base ball enthusiasts are in the main men from the Medical School, and if<br />\nthe team takes the field as an independent, self-supporting organization it might<br />\nwell be called the Johns Hopkins Medical School Base Ball Team, as at Yale<br />\nthere is a Yale Law School Base Ball Team. This would relieve the men from<br />\nbeing under the authority and discipline of the Athletic Association. Although<br />\nthe team will be composed of University men it must be understood that the<br />\nAthletic Association offers no guarantee for the fulfillment of their pledges<br /><br />\nj<br /><br />\nWING to the inclement weather the annual concert by the Musical Clubs<br />\nat Lehmann's Hall was not as largely attended as it would have been<br />\nunder more favorable conditions, But the management are well content<br />\nwith the financial result of the concert. From an artistic point of view the concert<br />\nwas a veritable triumph. The leaders showed excellent discrimination in their<br />\nselection of pieces,•and the men sang and played with that hearty good will<br />\nwhich characterizes college men when they have an apprecia'ive audience.<br />\nThe Easter trip is not far distant, and the men are certain of an enthusiastic reception wherever they appear if they keep up to the high mark set by<br />\ntheir Baltimore performance.<br /><br />\nO<br /><br />\nTHE NEWS—LETTER.<br /><br />\n8<br /><br />\nPROSPECTS FOR THE COMING DEBATE.<br />\nS the time draws nearer for the inter-class debate which will probably he<br />\nheld on March 2 1 st, interest on the part of those who are contesting for<br />\nthe various places on the teams is perceptibly increasing. Both Juniors<br />\nand Seniors are buckling down to work. and are sifting out all the material they<br />\ncan find on the subject of the debate. Practice is held every day under the<br />\ndirection of Dr. Lee and Mr. Burgess of the Baltimore School of Oratory, at<br />\nwhich times the echoes of McCoy Hall are rudely awakened by the impassioned<br />\neloquence of aspiring orators. Indeed, every indication seems to show that<br />\nboth sides will put up a stiff fight on the.night of the twenty-first.<br />\nThe cbntest has, however, narrowed down to six men on each side from<br />\nwhich the speakers and alternates of the two teams will be chosen.<br />\nFor the Seniors, these are Plaggemeyer, Blum, Strayer, Tootle, Addison,<br />\nGlocker.<br />\nFor the Juniors, they are Licking, Humrichouse, Foster, Rosenheim,<br />\nStollenwerck, Crozier.<br />\nIt has also been decided to have adviEers as in former years. The advisers<br />\nfor the Seniors will probably be Custis, Ammen, Parsons, and Hopper. Those<br />\nfor the Juniors wiil be chosen from Loyd, Emig, Geiger, Wallis, and Opie<br />\nThe Freshmen who will contest on the night of the debate for the medal<br />\noffered by Dr. Lee, will be selected from Strauglin, Boyce, Ziegler and Goldman.<br />\nAfter the inter-class contest, comes the debate with North Carolina. The<br />\nsouthern university has, so report says, put us down as one of their regular<br />\nannular scalps, but we want to disappoint them, and wipe out the defeat of<br />\nlast year by carrying victory into the heart of the Carolinas. To do this, every<br />\nman must come out and work. It is probable that the speakers who will represent Hopkins will be selected from the inter-class debating teams, but every<br />\nundergraduate is eligible, and, if he only makes manifest his latent ability, will<br />\nreceive due consideration. But those who do not possess the gift of eloquence<br />\nare not absolved. Valuable assistance can be rendered by a squad of enthusiastic workers who will help to write speeches,, run down material, and, above<br />\nall, criticise the arguments of the speakers, instead of waiting, as usual, for<br />\ndefeat to he announced before letting forth a stored.up flood of criticism.<br /><br />\nIIC<br /><br />\nCOLLEGE TAILOR PRIZES WON BY HOPKINS MEN.<br />\nHE February number of the College Tailor, which, we recall, is being Published by Lemmert, should be of especial interest to Hopkins men, not<br />\nonly because it is dedicated to the University of North Carolina with<br />\nwhom we have been on the most intimate terms, but because both the prize<br />\nstories therein were written by Hopkins men. In the first issue of the College<br />\nTailor, prizes were offered for the best football and hunting stories. These<br />\nwere captured by Mr. Walter B. Carver, leader of the Hopkins Glee Club, and<br />\nMr. Charles W. Kolb, who also studied at Hopkins.<br /><br />\nt<br /><br />\n9<br /><br />\nTHE-NEWS-LETTER.<br /><br />\nBesides the prize stories, the present issue contains several very clear half<br />\ntone cuts of the buildings at the University of North Carolina, a picture of<br />\nPresident F. P. Venable and a general article on the growth of the university<br />\nsince its foundation 108 years ago.<br />\nThe College Tailor is being edited by a clever young newspaper man of<br />\nBaltimore, who is far-sighted enough to make each issue of particular interest<br />\nto college men without sacrificing too much the interests of Lemmert, the<br />\npromoter.<br />\nThe idea is a novel and effective one for reaching the students at the dif'Trent institutions and promises to accomplish its purpose.<br /><br />\nOUR BARBER SHOP CHAIRS.<br />\n41.0.11.•••••-<br /><br />\nI love it, I love it, and who shall dare<br />\nTo chide me for loving my barber shop chair?<br />\nWe've treasured them long, and now they are ours<br />\nIf true squatter sovereignty gives any powers.<br />\nWe're bound by a thousand fond ties to our seats,<br />\nFor there ev'ry day the Fernandis Club meets.<br />\nWould you learn the spell?—'tis there we talk scandal,<br />\nAnd matters of state we can easily handle.<br />\nIn freshman days I lingered near<br />\nThose hallowed seats with listening ear;<br />\nAnd warm were the words which the club would give<br />\nIn teaching the way a man best should live.<br />\nThere heard I the freshest of things from society,<br />\nWith a dash of the green room to give them variety.<br />\n0 nothing I now recall ever compares<br />\nWith the wisdom I learned from those barber shop chairs.<br />\nI sat in my chair for many a day<br />\nWhen all thought of study had vanished away;<br />\nWhen youth was most rosy and nature most mild,<br />\nThe first of the month—when Dame Fortune had smiled—<br />\nIn poker I still was ahead of the game,<br />\nIn tossing up nickels my luck was the same;<br />\nFor then I was king, and the world was my own,<br />\nAnd I ruled it right well from my barber shop throne.<br />\n'Tis past. 'tis past, and hard is the rule<br />\nWhich leaves in the shop not even a stool.<br />\n'Tis there that we gossiped, and there we felt sure<br />\nFrom the faculty's onslaughts we were most secure.<br />\nLet Us rise in a body, insist on our right<br />\nOf having our chairs or of having a tight;<br />\nFor I love it, I love it, and I cannot tear<br />\nMy soul from the seat of my barber shop chair.<br />\n'03.<br /><br />\nir)<br /><br />\nTHE NEWS—LETTER..<br />\nLAST FRIDAY NIGHT'S CONCERT.<br /><br />\nt<br /><br />\nHE annual concert of our Glee, Banjo and Mandolin Clubs at Lehmann's<br />\nHall on February 27 was a great success. That the Baltimore public<br />\nappreciate a '`good thing\" when they see it was proved by the large audience which greeted them, and which enthusiastically applauded the various<br />\nselections.<br />\nThe concert hall was tastefully decorated with Southern smilax; the stage,<br />\nbanked with flowers and surmounted with the University motto in huge letters,<br />\nproduced a very pleasing effect. Placed at intervals on the walls were the different class flags, and the athletic banners,—reminders of 'varsity successes.<br />\nThe large number of patronesses, outside friends of the University, as well<br />\nas the wives of the members of the faculty, contributed much to the success of<br />\nthe evening.<br />\nThe program opened with the University Ode. Then came some rollicking<br />\nsongs, and marches by the banjo and mandolin clubs. Selections by the quartette appeared twice on the program, and each time the members, T. H. Coffin,<br />\nF. J. Hall, F. R. Ford and P. K. Gilman. received a warm reception from the<br />\naudience. The Glee Club was greatly appreciated in the 1902 and 1903 medleys, arranged by W. B Carver.<br />\nThe selection \"Violets\" was particularly well rendered by the mandolin<br />\nclub, as was also the \"Baltimore Centennial,\" in which \"Dixie\" was played as<br />\na clarionet solo, while the mandolins and violins played \"Maryland. My Maryland.\" The program ended with a new Hopkins song. \"The Toast Song,\" of<br />\nwhich the words and music were composed by R. S. Lanier, our ex-editor-inchief.<br />\nThe Mandolin Club is deserving of much praise. It surpasses last year's<br />\nclub in volume and unity of tone, and the members show that they have been<br />\nwell trained under their leader, J. W. Bryan. The Glee Club, under the able<br />\nleadership of W. B. Carver, did very satisfactory work, and is to be commended. The Banjo Club, with C. A. Marshall as leader, was excellent. They<br />\nplayed with the same spirit and dash that characterized last year's club.<br />\nAltogether the concert was successful from every point of view. The management and players are to be congratulated on their efforts. Most encouraging of all is the fact that the concert was a financial success, insuring the clubs<br />\na<br />\ngood Easter trip.<br /><br />\nY. M. C. A NOTES.<br /><br />\nO<br /><br />\nN Saturday evening, February 21, eight Hopkins men joined with about<br />\nfifty other men of Baltimore colleges in a Northfield supper at the invi •<br />\ntation of the Baltimore Mt. Hermon Club. The Mt. Hermon Club is<br />\nthe organization of the alumni of Mr Moody's school, just across the river<br />\nfrom Northfield, Mass. The object of the gathering was to arouse interest in<br />\nthe summer student conference at Northfield next summer, June 26 to July 5.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n11<br /><br />\nThis object tvas accomplished by six brief talks on the various sides of Northfield life and by much fun and reminiscing during the supper. There is always a strong feeling of friendship and enthusiasm among a party of men who<br />\nhave been to Northfield.<br />\nThe State convention for Delaware, Maryland and District of Columbia, in<br />\nBaltimore, March 6, 7 and 8, bids fair to be of interest to college men. The<br />\nSaturday sessions will be of special interest, and the afternoon, with possibly<br />\nthe morning session, will be held in Levering Hall. Mr. A. B. Williams, Jr.,<br />\nsecretary of college work of the east, will have charge of the student conference.<br />\nHe comes to us from a visit to the U. of P. and other institutions in the east,<br />\nand Hopkins should give him a good welcome. St. John's, Western Maryland<br />\nand other colleges expect to send large delegations. Hazlehurst, J. T. Smith,<br />\nJr., Sandrock, Hildt and Lloyd are a committee looking after the entertainment<br />\nof some of these men. It is desired that as many Hopkins men as possible<br />\nwill come to the Saturday afternoon session.<br />\nMr. Williams will remain a few days after the convention to meet the Hop •<br />\nkins men here and at the Medical School, and will lead the meeting Tuesday,<br />\nMarch 10, at 5 o'clock. He is a Yale man of considerable experience in college<br />\nassociation work.<br />\nThe attendance at morning prayers has fallen off lately. It is hoped that<br />\nChristian men who have the nine o'clock period on will avail themselves of<br />\nG.<br />\nthis little opportunity for quiet worship.<br /><br />\nAMONG THE COLLEGES.<br />\nThe University of Michigan has 15,000 alumni, Harvard has 14,000 and<br />\nYale 11,436.<br />\nThe new gymnasium which is beitig built at Princeton will be the largest<br />\nbuilding of its kind in the world, the main floor being 100 by 166 feet.<br />\nThe Yale Football Association bid a surplus in the treasury this year of<br />\n$17,077.<br />\nThe University of Leipsig will celebrate its five hundredth anniversary in<br />\n1909.<br />\nPresident Eliot of Harvard recommends the following plan for a student's<br />\nday: Ten hours for study, eight for sleep, two for exercise and four for meals<br />\nand social duties.—Ex. Is this a joke?<br />\nOne of the features of Yale's dining hall is the \"international table\" at<br />\nwhich are tren from almost all countries of Europe, from the Philippines,<br />\nJapan, and the Hawaiian Islands.<br />\nThe Carnegie Institute has granted $10,000 to the University of Chicago<br />\nYerfor research work, $6,000 goes to the department of geology and $4,000 to<br />\nkes observatory.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nLACROSSE DOINGS.<br />\niloPKINS LACROSSE SCHEDULE, 1903.<br />\nApril 4—University of Pennsylvania.<br />\nApril 1 I—Hobart College.<br />\nApril 18—Stevens Institute.<br />\nApril 25—Lehigh U niversity.<br />\nMay 2—Swarthnkme College.<br />\nMay 7—Crescent A. C.<br />\nJune fi—Toronto University.<br /><br />\nHEN we consider the fact that by this time next month the first game of<br />\nthe lacrosse season will have been played, it may readily be seen that<br />\nno little work must he done between now and then. Harvard, it is<br />\nsaid, has been playing in two inches of snow for the past two weeks and Lehigh<br />\nand Swarthmore have both heen doing outdoor work despite the weather. No<br />\nmatter how great an advantage the cage may be, the practice within its walls<br />\nmust nece,sarily be on a small scale and it is very important. that the squad<br />\nshould be gotten out as soon as possible in order to give the men an idea of the<br />\npositions and distances to be covered on a field of regulation size.<br />\nEx-Captain Schmeisser and Coach Abercrombie were much pleased with<br />\npractice<br />\nin the cage last Saturday. They both laid particular stress upon<br />\nthe<br />\nthe fact that the schedule this year is unquestionably the hardest ever arrayed<br />\nby the management, and urged the candidates to stop all smoking and drinking<br />\npreparatory to signing the training pledge which will probably be required next<br />\nweek. The remarkable work done by the 'Varsity twelve last year was mainly<br />\ndue to the fine condition of the men throughout the season. In a game requiring such a great amount of wind and endurance too much stress cannot be laid<br />\nupon the necessity of conscientious training. The absence of a training table<br />\nmake each player responsible in a large measure for his own condition. The<br />\ntrust should be rigidly lived up to by every man who has any chance to make<br />\nthe team.<br />\nRegarding the vacancies, there will be at least three attack and one defense positions to be filled by new men. The candidates who are at all promising have a good opportunity to figure in one or two, if not all the games. Just<br />\nat present the most promising men seem to be Custis, Matthai, Strobbar, Tay-<br /><br />\n(W<br /><br />\nTHE NEWS-LETTER.<br /><br />\n13<br /><br />\nUnforseen accidents allor, Pearre, FeoSenheim, HazlehUrst, Straus and<br />\nforegoing men are apt<br />\nthe<br />\nof<br />\nall<br />\nand<br />\nseason<br />\nthe<br />\nof<br />\nways occur during the course<br />\nis a good one.<br />\nchance<br />\nthe<br />\noys;<br />\nb<br />\nbusy,<br />\nto figure in one or more games. Get<br />\nHOPKINS AT GEORGETOWN GAMES.<br />\nUDGING from the list of Hopkins men who are to take part in the Georgetown games on Saturday night, we should carry off at least a few medals. Captain R. C. Hoffman has been putting the squad through all<br />\nkinds of preparatory stunts since the B. A. C. games. and should the handicapping be reasonable, we may expect to get a liberal share of the honors.<br />\nThe men who are to wear our cobors will be taken from the following: Dashes—<br />\nFreeze, Sladen, Bond, •Pessagno, Tootle, LeCron, Knight, Helmholz, Super.<br />\nMiddle Distance—England, Tootle, LeCron, C L. Stone, Boyce, Morse, Goode•<br />\nnow, Super, Freese, Captain R. C. Hoffman. Distance—Aedewell, Porter,<br />\nMorse, England. Shot Put— H. B. Stone, Lawson. Jumps—Taylor, Pessagno, Knight. Hurdles—Freese,•Heltuholz. Relay Race—England, Capt. Hoffman, Freeze, C. L. Stone, Sladen, Tootle; Morse, Redewell. Somewhat to Hopkins' disappointment, the relay race will be run with Villa Nova College. The<br />\nlatter institutions always turns out a, well trained team, but Captain Hoffman<br />\nwas greatly in hope that a contest could be arranged either with the Carlisle<br />\nIndians or the United States Naval Academy. The Indian management very<br />\nfrankly wrote Manag r Dulaney that the team was not in sufficiently good condition to run against Hopkins, while the Navy has not developed a relay team<br />\nthis season.<br />\nThe games w ill be both handicap and scratch, and altogether Hopkins ex<br />\npects a reasonab y fair chance in all the events.<br />\nFor several days past Manager Dulany and Physical Director McDermott<br />\nhave been tryi ng to secure special rates for the occasion. Even if they do not<br />\nsucceed, the usual Saturday fare is opzii to all, and there is no reason why<br />\na bunch of rooters should not go with the team. The games will be held in<br />\nConvention Hall, at 8 o'clock.<br />\n• In m ost of the events Hopkins will have our old friends, the Maryland and<br />\nthe Balti more Athletic Clubs to down. The Boys' Latin School and Marston's<br />\nhave also entered teams.<br /><br />\n3<br /><br />\nA piece of exceptional good fortune, which is not generally known to the<br />\nDirector MackderStiident body, was announced a few days ago by Physical<br />\nott. It is this: The Maryland Athletic Club has very kindly offered the<br />\nohns Hopkins track and field team the use of the Maryland Oval for training<br />\npurposes during the coming season.<br />\nThis is certainly a piece of genuine good luck, for the Oval is not only<br />\nmuch nearer town than Electric Park, but it is circled by a first-class quartermile cinder track. Besides this the grounds are strictly private and contain a<br />\nspacious club house equipped with,several shower baths.<br /><br />\n14<br /><br />\nTHE NEWS—LETTER.<br /><br />\nHopkins and M. A. C. have been on very intimate terms during the winter, and the present courtesy is simply a token of the good feeling which it is<br />\nhoped will continue to exist between Baltimore's most prominent institution of<br />\nlearning and her leading athletic organization.<br /><br />\nIf circumstances are favorable, Hopkins will hold her annual indoor games<br />\nat the Fifth Regiment Armory on March 28. No definite arrangements have as<br />\nyet been made.<br />\nBASE BALL ENTHUSIASTS.<br />\nASE BALL affairs began to assume a truly formidable aspect last Saturday afternoon, when 15 candidates showed up for the first regular practice of the season; and from now on they will report every Tuesday and<br />\nThursday, as well as on Saturday, for a little warming-up exercise. With the<br />\nfirst game only about two weeks off, it will be necessary for the men to attend<br />\nstrictly to business during the short time they can be together. As regards<br />\npractice, the base ball team is singularly unfortunate, in that the candidates are<br />\nso scattered that it is almost impossible to get them all together for practice,<br />\neven when grounds can be procured for the purpose. The team is further<br />\nhandicapped by the very limited amount of time that the \"medicos\" can spare.<br />\nIt is scarcely possible at this time to give with any great degree of accuracy the candidates for the several positions; therefore, too great faith must not<br />\nbe put in the following remarks Captain Whipple will again be seen doing<br />\nbusiness at the old stand in the box, with Ricksher, Wright, Crozier, and<br />\nPitcher as candidates for the same position. Constantine, who will give up<br />\nfirst base for a place behind the hat, may be succeeded by Ingraham or Goldman. Hand or Sladen will probably do the honors at second, with Marine or<br />\nNelson at third. Short will again be ably filled by Moore. For the outfield,<br />\n'the selection may be made from Wright, Marshall, Hand or Goldman. The<br />\nabove leaves Meloy, Campbell, and Straughn unaccounted for, as they cannot<br />\nyet be definitely located.<br />\nThe candidates who reported Saturday were: Whipple, Constantine, Ricksher, Ingraham, Meloy, Wright, Marine, Moore, Hand, Crozier, Sladen, Campbell, Goldman, Straughn and Pitcher. After the practice, a short, informal<br />\nbusiness meeting was held in the Trophy Room. The present prospects of the<br />\nteam are very bright, and all look forward to a successful season.<br /><br />\n(g<br /><br />\nThe relative numerical standing of the universities of the world, is as follows: First, Berlin, 13,070; second, Paris, 12,171; third. Cairo, 10,003; fourth,<br />\nVienna, 6,000; fifth, Budapest, 5,940; sixth, Naples, 5,165; seventh, Madrid,<br />\n5,118; eighth, Moscow, 4,691; ninth, Columbia, 4,499; tenth, Munich, 4,459;<br />\neleventh. Leipzig, 4,220; twelfth, Harvard, 4,142; thirteenth, California, 4,008.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nSOLILOQUY OF A BANQUETER.<br /><br />\nIr<br /><br />\nOW ! How that water sizzled going down! I am not going to make any<br />\nexcuses for myself. But really now, did I fall or was I pushed?<br />\nAnyway, the water-gon'<br />\ndrove off and left me. As an idiot, I deserve<br />\nthe can of salmon, the box of mustard plasters, and any other old prize that is<br />\nyearning for a nice unintelligent owner. Ouch! I didn't know that my head<br />\nwas so big. I wonder if some one sneaked up behind me and hit me with a<br />\nbrick? Pocketbook? That went long ago. I am vaguely conscious that I<br />\nhave put my name to more bills of lading—for booze---than I ever signed to<br />\nexamination papers. On my'honor, that's a fact.<br />\nHow did it start? Don't ask me. How do I know? I imagine that every<br />\none started in the afternoon, just to test their capacity. By evening we could<br />\njust manage to see the.dozen oysters spinning about on our plates. I don't<br />\nthink that I was worse than anyone else. I know I wasn't; I didn't sing.<br />\nYes, I did too. Something foolish about \"Did the Goat Eat the Spinach off<br />\nSister Susie's Hat?\" It must have been pathetic; the man next to me wept on<br />\nmy shoulder and gurgled something about losing one dearer than a sister.<br />\nI am trying to find the man who said that I hit a waiter on the eye with a<br />\nroll. and compromised for a dollar. I can't remember it. The only evidence<br />\nthat I have that it might be so is in the fact that I am minus the dollar. That's<br />\nnothing; I'm minus several of them. I must have been awful reckless. I<br />\nfound a champagne cork in my pocket. I hope some one gave it to me for a<br />\nsouvenir; I hope I didn't have the hardihood to do it myself. Four Bones! A<br />\nweek's board! Sixteen times to the Auditorium! Thirty two—lemonades!<br />\nWho'd have thought it?<br />\nIt's me to economize. Never tell me that wine is a mocker. I know it<br />\nalready. It is the only original tanglefoot. It took three of us to navigate. I<br />\nhad to hold the other two up. Them hold ME up! I guess not. I was the<br />\nmain support of that Complete Combination of Curiosities. Although there<br />\nwas no sleet on the pavement, I am well aware of the fact that there were distinct seismic sensations at different times. I wanted to take those two Indians<br />\n'home. They wanted' to take ME home. We compromised; none of us went<br />\nhome. We saw the cold gray dawn break, but we were broke first; we saw the<br />\nstars go out, but we had gone out first; we saw the moon grow pale, but we<br />\nwere paler than she. Today you can't hand me too many pledges to sign.<br />\nGood bye, I'm off to get some ice. for my head.<br /><br />\nCornell is the first American University to have a university club in England. The club, composed of graduates of Cornell, consists of forty members,<br />\nand is known as the Cornell Club of England.<br />\nThe following wail is heard from the \"Texan.\" \"Pretty soon you will<br />\nonly be able to look at the co-eds.through a glass cage.\"<br /><br />\n16<br /><br />\nTHE NEWS—LETTER.<br />\nEXCHANGES.<br /><br />\nThe Princeton \" er'' calls attention to the following dainty bit from the<br />\nWellesley Magazine\":<br />\n\"The nightgown was very light. Millicent lifted it with surprise. Her<br />\nown felt quite different as she took them out of the bureau drawer—stiff and<br />\nsmooth in their white starchedness. This was a slim, soft thing. Her own<br />\nwere of unbleached muslin, plenty long, with a yoke, and a square collar, buttoning neatly at the throat. A little thrill of doubt ran over her as she slipped<br />\ninto this bit of softness. It fell around her ankles lingeringly; her throat rose<br />\nout of it with a sweet sense of freedom; the soft embroidery caressed her wrists.<br />\nShe drew her breath with a little doubting sense of immodesty and tingled anew<br />\nas she felt the cool folds She put out the light and stood in the shadow of a<br />\nmoonbeam, trembling in this keen. new consciousness of her own body. She<br />\ncould feel every curve of it under the thin, clinging thing. She had a strange,<br />\nsweet sympathy with her own warm flesh, and an apprehension of beautiful<br />\nthings, known to her before only through her eyes, seemed diffused through her<br />\nwhole body.\"<br />\nCOURT TALES.<br /><br />\n\"Well,\" observed the Merry Monarch as he playfully directed the Hose at<br />\nthe Pillory, \"I guess that is Watering Stocks a few!\"<br />\n\"Let me recommend,\" cried the Kindly Khedive, as his executioner submerged a victim in the Balkan, \"my perfected submarine craft,\"<br />\n\"I think I will hold the World's Fair here,\" remarked the Sententious<br />\nSolomon; \"bring on number 999, first.\"<br />\n\"That lightning calculator knows almost every chorus girl in town by<br />\nsight.\"<br />\n\"He has such a marvelous memory for figures.\"—Tier.<br />\nWidow (tearfully)—Yes, my daughters are now my only resources.<br />\nFriend—Take my advice, and husband your resources well.— Tiger.<br /><br />\nA WINTER IDYLL.<br /><br />\nThe moon was softly shining<br />\nIn the dark blue firmament,<br />\nAnd the stars were brightly twinkling,<br />\nAs in gleaming wonderment;<br />\nAnd the wind was softly sighing<br />\nAs they glided o'er the ice,<br />\nWhile she whispered to him gently,<br />\n\"Oh, say! Jimmie—ain't this nice?\"<br />\n—Cobrnilria Jester.<br /><br />\nOPEN ALL. NIGHT.<br /><br />\nWILIAXSON<br /><br />\nWATTS,<br /><br />\n4-,IDrug %-tores.<br />\nliinpard and Franklin Streets.<br /><br />\nBaltimore and Eutaw Streets.<br /><br />\n1Druge, ffancr aoobe. Verfunierp, troller /Articles, etgar)3, SoOa Water.<br /><br />\nse' se<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BA LTI MOR E FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber tioods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT c4c.<br /><br />\nsr<br />\nC. &amp; 13. 'Phone 03541-1'..‹.<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying Instruments.<br />\nDraughtsmen's and Engineers' Supplies<br />\nN. W. Corner<br />\nLexington and Liberty Sts. ISAI.TIM01-4L.<br /><br />\n704 MADISON AVE<br /><br />\nD.<br /><br />\nAgent for Kenffel 4. Esser Co., of New Fork.<br /><br />\nu-c<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nHenderson's<br /><br />\n.!‘<br /><br />\nUNIVERSITY<br />\nBOOK STORK<br />\nText Hooks, Note Hooks,<br />\nStudents' Supplies.<br /><br />\nmadison @ Howard Sts.<br /><br />\nIllieorporated 1 W714.<br /><br />\nSteona as the Stronaest.\"<br /><br />\nTItE FIDELITY MUTUilL LIFE INSUIVINGE<br />\nOF PtilLArDEI,PHiln%<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nFur Agency in Maryland or West<br /><br />\nIrgInhi,<br /><br />\nAddress,<br /><br />\nc. GRAttAnt, Manager<br />\n1400-8 Merchants Bank Bldg,, Baltimore, Md,<br /><br />\nFor Advertising Space in this Paper<br />\nAPPLY TO<br /><br />\n/<br />\nI<br /><br />\nV4<br />\nA7<br />\ndr4e0<br />\nI.<br />\nItE cOR. BAIN/mime 614a47/11<br />\nnrr.r.cc't,,lAi'e,7eowar..:0•<br /><br />\n,*.tf.<br />\n,<br />\na6r,Oeil(etw<br />\nPUBLISHERS.<br /><br />\nS600,000. Surplus aal Undluirlerl PHA $400,000<br /><br />\nSTIEFF PIANOS<br />\nMADE OP<br /><br />\nTsiric Ititsvr<br /><br />\nDrovers Sc MechaniGs Nat'l Bank,<br /><br />\nMATERIALS MCINEIF<br /><br />\nAND EXPERIENCE CAN<br />\nWAD...paw<br /><br />\nOF •ALTIMORE.<br /><br />\nHUY.<br /><br />\n9 N. 141 I l' IATY sT.<br /><br />\nrs an('<br />\nGUSHING EcGOMPfINY'8Botaotkiselle<br />\noners.<br /><br />\nJas. Clark, Prost<br />\nChas. 8. Miller, Cashier.<br /><br />\nL. Strouse, Via-Prod.<br />\nEdw. P. Hayden.'isn't Cashier.<br /><br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p,r year and upward.<br /><br />\nficcounts Solicited.<br /><br />\n34 W. BilLTIMORE STREET.<br />\nand Miscellaneous Books.<br />\nKelp constantly on hand the Text Hooks used<br />\nand the Woman's<br />\nUniversity<br />\nHopkins<br />\nJohns<br />\nin<br />\n#<br />\nglk<br />\nCollege of Baltimore.<br />\nSTATIONBRY—For School, Ninny, Office and Bank.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON,<br /><br />\nt.Ghool, Law, Medical, GlaSsical<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\n1101111111111111111111.111M111111111111111M111 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br /><br />\nTHOS.BLAKE CO<br /><br />\nall 0111(1 College<br /><br />\nOn Bale The .1. If. U. Pennants,<br />\nPennants.<br /><br />\nFOR<br /><br />\n\".<br />\n11St<br />\n;<br />\nj:N711<br />\nM A71(<br />\nR GO,submitted<br />\nSTRBLESamples<br />\nJOIlDfiN<br />\nof<br />\nReads as follows:<br />\nFrench Brandy—no adulterants,no coloring, tine quality.<br />\nOporto Fort -absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye WhImkey—no Fusel oil, no caramel, strictly pare<br />\nand old.<br />\nOlive 011—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\n219 EAST BALTIMORE ST.<br />\nA<br /><br />\nllgenfritz Studio<br /><br />\nH. FETTING,<br />\nMANUFACTURER<br /><br />\nSuccessor to Cummins.<br /><br />\nOF<br /><br />\n(Brea Metter fraternitv 3ewe1rr,<br />\nplow<br /><br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\nCall anb ilixaMine our /Me 313efore Purehaeing.<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC.<br /><br />\n.ININNINUS &amp; 11012SITY.<br />\nMERCHANT<br /><br />\n'rATILMRSI,<br /><br />\n'21 W. FA YETTM STREET.<br /><br />\na p. telephone 445-.<br />\nLibraries arranged and put in<br />\norder without removal. Of If<br /><br />\n.4# to R UZICKA<br />\nu,<br />\nBookbinder,<br /><br />\nlaot<br />\n,<br />\n•••••••,111.\"<br /><br />\nBOOKS!!<br />\n!!<br />\nSECOND=FIAND<br />\ns,<br />\nSchool, Medical and Miscellaneou<br />\nExchanged.<br />\nBought, Sold and<br /><br />\nPIPPEN'S 1300K STORE,<br />\n605 N. EliTiVW ST.<br />\nNtlar the University.<br />\nBaltimore's Largest Old Book Store.<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE.<br /><br />\nTHEO. WARNER-<br /><br />\nWARNER eic CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nTi<br />\nManufacturers of<br />\n11 S Caps<br />\nSilk and Cassimere Hats. 4°'\"<br /><br />\nop<br /><br />\nNORTH GERMAN LLOYD S. S. GO.<br /><br />\ni<br /><br />\nCABIN PASSAGE fiT LOW RATES.<br /><br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBfiLTIMORE TO BRE,MEN DIRECT.<br /><br />\nft. SGHUNifiGHER Sc GO., General<br /><br />\nFor particulars applu to<br /><br />\nISAAC H. DIXON,<br />\nJAS. R<br /><br />\nTHE<br /><br />\nChas. Willms Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICRO-SSORI ES.<br />\nSCOPES AND ACCr-<br /><br />\n300 N. Howard St.,<br /><br />\n'Baltimore, Md.<br /><br />\nAgents.<br /><br />\n.JAS. MEIKLE, Vucc-PResr.<br />\nRICHARDS, TREAS.<br /><br />\nSmith, Dixon Co.<br />\n29 31 S. Charles Street.<br /><br />\n1\\<br /><br />"}], "field_media_file": [{"target_id": 36257, "display": null, "description": null, "target_type": "file", "target_uuid": "3584ff3b-0faf-456f-b30b-3d79587b042f", "url": "http://digital.library.jhu.edu/system/files/2022-03/12236-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12236, "target_type": "node", "target_uuid": "43a11648-3e04-44e7-a49f-b5e94f265029", "url": "/node/12236"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "9d6ec612-13e6-4259-bb26-5ba76a7c543b"}]}