{"mid": [{"value": 38267}], "uuid": [{"value": "650b51df-40b2-45ef-955e-47603c9d9540"}], "vid": [{"value": 38267}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:51:47+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13395-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:51:47+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:51:47+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Nrun-krtirr<br />\n<br />\nVOTE IN THE<br />\nPOLL!<br />\n<br />\nSEE JAYS<br />\nFINISH SEASON<br />\n<br />\nHOMEWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br />\n<br />\nVOL. XLII, No. 24<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nJune Week Committeemen Announced<br />\n•<br />\n<br />\nHOPKINS QUINTET Pon 0n Y. C. L. Issue Op e n CRIST, CHAIRMAN,<br />\n_piniop on League Status,<br />\nMEETS JOHNNIES I CNZL RASIN I Q<br />\nEDITORIAL l_PICIS SENIORS;<br />\nCommunist Speaker Asked<br />\nJUNIOR LACKING<br />\nIN FINAL CLASH<br />\n<br />\nThe Young Communist League,<br />\nlike the poor, we always have with us.<br />\n_ _<br />\nTo this writer It has been the subject<br />\nRepresentative Consensus Of Student Opinion Desired; Poll of lengthy discussion during<br />\nwhich, Sixteen-Man Group Named;<br />\nJays Seek Revenge After<br />\nTo Be Open Until Monday Afternoon<br />\nit seems to us that some of the fundsCrist Explains Large<br />\nOne-Point Defeat Of<br />\nmental principles of a liberal universon<br />\nwhy<br />\nit<br />\nwas<br />\nrefusing<br />\nopens<br />\nunwhich<br />\ntoday<br />\nIn<br />\na<br />\n\"legitithe<br />\npoll<br />\nsity's<br />\nbeing have been' called into<br />\nNumber<br />\nLast Month<br />\nder NEWS-LETTER sponsorship, two mate campus organization\" the right question.<br />\nquestions on the Young Communist to sponsor an assembly.<br />\nWe need not recite the history of COMMITTEE WANTS<br />\nGAME AT ANNAPOLIS<br />\nLeague Assembly issue will be put<br />\nthe Y. C. L. controversy at too great<br />\nSTUDENT REACTION<br />\nIn answer to the Young Communbefore the campus. The poll is an<br />\nTOMORROW NIIGHT<br />\nlength. Suffice it to say that,the issue<br />\nattempt to determine student opin- ist League, both majority and minor- has been in the air Since; January,<br />\nMember From Junior Class<br />\nion on a point of conflict which split ity submitted reports. The five-man when the Student Council made pubBoth Teams Confident After<br />\nTo Be Named<br />\nthe Student Council five to four in a majority cited the secrecy and the lic its reasons for refusing the league<br />\nVictories In Recent<br />\nvote in January. The poll will be political bent of the organzation as an assembly. Last week the discusLater<br />\nopen until Monday afternoon; ballots a basis for its opinion; the four-man sion flared up anew when it was openSkirmishes<br />\nAs soon as it appeared that the<br />\nhave been distributed with this issue minority based its opinion on the ly charged that the University adSecond Cotillion was a financial sucfact that the Young Communist<br />\nof the NEWS-LETTER.<br />\nThe Frank Merriwells of Annapministration' had prevented the Y. C.<br />\nDo you object allowing the Young League was a campus organization L. \"from holding an open meeting cess, Frank Crist, '38, Chairman of<br />\nolis will play host to the Hopkins<br />\nthe June Week Committee, decided to<br />\nCommunist League to sponsor open and had as much right to have an on the campus.<br />\nhoopst,ers tomorrow night, when the<br />\ngo ahead with plans for the year-end<br />\nmeetings *on the campus? and Do assembly as organizations like Tau<br />\n(Continued on Page 2, Col. 1)<br />\nJays invade the state capitol with<br />\nHe announced the meleefestivities.<br />\nKappa,<br />\nand<br />\nOmicron<br />\nPi,<br />\nDelta<br />\nBeta<br />\nyou object to having a Communist<br />\nlion of the following fellow-classmen<br />\nsweet thoughts of revenge prominent<br />\nspeaker at a Hopkins assembly not the American Student Union.<br />\nCaptain of the Hopkins basketers<br />\nto form his committee: Hugh JohnIn their minds. Last month's enunder the sponsorship of the Young<br />\nThe Young Communist League,<br />\nston, Ned Obrecht, Billy Wagner,Harcounter with the St. John's five cer- who will meet the Bt. John's powerful Communist League! are the two continuing the discussion in another<br />\nIan Graham, John Royster, Alvin<br />\ntainly has left quite an imprint on quint ir their last encounter of the questions on which the poll will be letter, published in last Friday's<br />\nSavage, Charles Stegmaier, Royce<br />\nthe Hopkins five, and a correction of season tomorrow night:<br />\nconducted. In a letter to the NEWS- News-LETTER, charged the adminis..\"-rthur<br />\npoint, lastywrinetrA's__:,_-__‘_,,<br />\n...uriary 21, Wfilkei%-chles- tration of the Hopkins with \"violaman, Edward Bauernsehmidt, Walt<br />\nvictory of last month will turn what<br />\nsinger speaking for the Young Com- tions of civil liberties on the camWindsor, Archy Bowersox, Will<br />\nis not more than just a passable seamunist League, charged the Council pus,\" and specifically with the with,<br />\nPrice, _Carl Basin, and Cy Romanofson into a successful one.<br />\nwith \"dilatory\" action on the organ- drawal of the use of Levering Hall<br />\nsky.<br />\nization's<br />\nrequest for an assembly, and for a Young Communist League \"Relation Of A. S. U. To<br />\nAs usual, anything may happen in<br />\nThe Junior class member will be<br />\ndemanded that the Council show rea- meeting.<br />\na St. John's encounter. Rivalry has no<br />\nCampus\" Is Lash's<br />\nappointed latter by Harry Hopkins,<br />\nlimits and with practically no holds<br />\n'39, president, upon the approval of<br />\nTopic<br />\nbarred the Jays will be out after<br />\nJudge Mehling, president of the CoJohnnie's scalps. How easily those<br />\nSherwood Room In Levering tillion Board; William Kempton,<br />\nscalps will be gottefn is - hard to tell. Glen Gray And Company<br />\nStudent Council head; John Royster,<br />\nIt seems that the Annapolis five have<br />\nHall Will Be Scene<br />\nacting Student Activities Committee<br />\nSend Cats, Ickies, Jitterimproved their brand of play in represident; and Crist. At present<br />\nOf Talk<br />\ncent frays. The strong Washington<br />\nbugs Into Ecstacy<br />\nthese seventeen Seniors and their<br />\nCollege quint fell before the onSix Offices Change Hands Songsters Entrain For Anofficers,<br />\nas ex-officio members, will<br />\nJoseph P. Lash, National Secreslaught of the Annapolis five by a<br />\nBert Hecht Stars As Winner<br />\nnual Trip Today; Home<br />\nIn Annual<br />\ntary of the American Student Union, go ahead with plans.<br />\nlarge margin. And thus, the Johnnies<br />\nChrist Comments On Plans<br />\nOf Limerick Contest;<br />\nwill be In trim for the Jays, against<br />\nhas been obtained as speaker at a<br />\nConcert Well Received<br />\nElections<br />\nChrist, when releasing the commitwhom they always show their better<br />\npublic meeting at the' Hopkins on tee list, added his comments<br />\nAttendance Large<br />\non the<br />\nside. This is the final game of the Jay<br />\nby K. F. MAXCY,JR.<br />\nHarold Ricards, '39, was elected<br />\nThursday, March 10, by the Hopkins coming event. \"This committee<br />\nseason.<br />\nby J. C. HANDELSMAN<br />\nFollowing up their triumph at the Branch<br />\npresident of the campus branch of<br />\nof the A. S. U., it was an- seems unwieldy, I know; but I believe<br />\nIf the Black and Blue basketeers<br />\nThe Big Apple is dead!<br />\nthe Y.M.C.A. at the annual elections Home Concert last Friday, the Musi- nounced<br />\nWednesday. He will be heard that the more men working the more<br />\ncan show the form they displayed<br />\nIt was 3:30 in the morning, March held on Tuesday, March 1. The other cal Club boards the train today to fill<br />\ntickets will be sold.<br />\nat 11:30 in the Sherwood Room of<br />\nagainst Wilson Teachers this week,<br />\nWants Student Reaction<br />\n2. We were in the Alcazar, tired, successful candidates were: Jeffer- engagements in New York and<br />\nLevering Hall on \"The Relation of<br />\nthey will be much closer to victory.<br />\n\"I would like to know how studhappy, but perplexed. Glenn Gray son Hamilton, '40, and Laurie Dick- Atlantic City. Their performance<br />\n,The last ten minutes saw the Jays<br />\nthe A. S. U. to the Campus.\"<br />\nents feel about the time arrangement<br />\nnight at Mantic City will<br />\ntally twenty-four markers to their had escaped the autograph hounds. son, '40, vice-president, George El- Saturday<br />\n\"Mr. Lash, who is one of the most of the Week. In the past all the<br />\nbroadcast.<br />\nopponents' six. The game showed the Kenny Sargent had finally eluded liot, '40, secretary, Charles Flagle,'40, be<br />\nparties have been held from Monday<br />\nTonight in the Warwick hotel the prominent student leaders in the<br />\nchange in the Blue attack. Few long the last fair damsel who wanted<br />\nthrough Saturday of the week preassistant secretary, and John Henry sixty songsters will serenade the<br />\ncountry, will discuss in his talk some<br />\nshots with a fast breaking and pass- \"just one more chorus of \"For You'\".<br />\nceeding Graduation Day. Some seem<br />\nBlucher,<br />\n'39,<br />\ntreasurer.<br />\nReplacing<br />\nthe<br />\nPee-Wee<br />\nCotillion<br />\nthe<br />\nYork Alumni. Tomorrow they of the most important problems facHunt,<br />\nNew<br />\nBoard,<br />\ning attack to work the ball under the<br />\nto think that it's beginning ought to<br />\nbasket will be the offense the Jays Bob, the campus cop had all gone present officers, Huntley Lloyd, pros- travel on to the Chalfonte-Hatton ing the world today and, will show ,<br />\npostponed until Wednesday so<br />\nhome: There was-law-/:--,- Ieft but us<br />\nhotel in Atlaeityit,\"\"--- whose<br />\nwill employ.<br />\nhip to studeadisec-L___ tt the Senior Ball may wind up<br />\n_3watz<br />\nand `an old colored janitor, having a<br />\nguests will hear the vocaliSts in their Benjamin Root, '38, chairman of the<br />\nSt. John's will make use Of the<br />\nHanawalt, vice-president, C. Hamfestivities<br />\nCommencement<br />\nnight.<br />\nlittle private peckin' party in a corner.<br />\nbroadcast performance at eight over membership committee of the A.S.U.<br />\nsame sort of attack. Their speed has<br />\nPlease\" write me at Box 123 or write<br />\nYet, we couldn't move; we just stood mond Brown, secretary, and Boyd station WGP.<br />\n\"His talk will be a part of a broad the News-IATTER.\"<br />\nalready been witnessed by the HopFrey, treasurer these officers for the<br />\nthere . ..<br />\nWhen the Musical club finally A.S.U. program on the Hopkins cam- \"Subscription for the Week<br />\nkins supporters. The newly-employed<br />\nwill be<br />\nFor five solid hours we had seen Year 1938-39 will take office immedi- straggles home Sunday night they, pus which will attempt to<br />\nshow<br />\nzone defense of the Hornewood hoopley* Seniors and some less amount<br />\nthe -eari,-st?ie'ickies, the jitterbugs, ately and will probably be formally will have completed a season Whose the student body that the<br />\nsters is expected however to offset<br />\nA.S.U. is not yet decided upon for lower classthe alligators shriek and stomp and<br />\nor could be an important force in men. The committeemen bringing in<br />\nthe Annapolis speed considerably.<br />\ninstalled at the meeting of the Supper success is already beyond doubt.<br />\ntear their hair in frenzy while Casa<br />\nBetter playing in past encounters has<br />\nThe Home Concert last Friday in helping to solve the problems which the largest number of ticket sales in<br />\nClub<br />\non Tuesday,.March 8.<br />\nLoma dished out some of the smooththe Maryland Casualty auditorium are faced commonly by all students pledge form before April 30 will be<br />\nbeen sacrificed to develop the curest stuff ever served to Hopkins men<br />\nHarold Ricards, the new president, deserves a long list of superlatives. today.\"<br />\nrent mode of defense of the Jays,<br />\nselected as an executive committee.<br />\n. but no Big Apple.<br />\nholds several other posts in various Perhaps it is enough to note that no<br />\nand the Johnny fray will witness the<br />\nAt the third annual convention of They will be chairman of various<br />\nBut why discuss fruit when there<br />\nperformance<br />\nwithout<br />\nwent<br />\nfull extent of such a defense.<br />\ncampus organizations. He is one of individual<br />\nthe American Student Union held subcommittees arranging features of<br />\nare more important things?<br />\nCarl Rasin will play his final game<br />\nthe junior representatives on the Stu- several curtain calls and an encore, last Christmas at Vassar College, the program. June Week parties will<br />\nSwell Affair<br />\nand that every number was applaud- Mr. Lash<br />\nin a Blue uniform and with him at<br />\nwas a leading figure. His run along the usual !ines.\"<br />\nTo put the whole matter in a nut,. dent Council, assistant managing<br />\ned loud and long.<br />\nThe program of June Week usualthe other guard post will be Joe Mc- shell: —<br />\ntalk on the policy of the A. S. U. was<br />\nAt 10 o'clock last Tuesday editor of the Hullabaloo, and editor<br />\nThe enthusiastic reception accord- considered one of the highlights of ly consists of a Senior Ball, either an<br />\nLain. Dimmy Traggis, also playing eve, the<br />\nfirst swing fans, anxious of the .'Y' Handbook.<br />\nInterfraternity<br />\nBoard diepce or a<br />\ned a solo by Richard Sharretts early that convention, and it has been<br />\nhis last game for Hopkins will give lest the<br />\nleast bit escape, stepped aphis all at one of the forward slots prehensively<br />\nCandidates for \"Y\" offices are nom- in the program struck a key note. He printed since in pamphlet form un- Junior Prom, or both4ibeach party,<br />\nout onto<br />\nfloor. At<br />\ntook two bows on his performance of der the title The Campus: A Fort- a lacrosse game the Senior Banquet,<br />\n,with Norm Melvin as his running 10:03, a<br />\nsoft sigh of appreciat e pas- inated' by a nominating Commission<br />\nand various beer feats. The com\"Invictus\", and at the insistence of ress of Democracy.<br />\n'mate. Lee Moore will again serve as sion was hear from them.<br />\nselected by the \"Y\" Cabinet, which<br />\nmittee held its first meeting yesterthe audience sang \"The Big Brown<br />\nthe pivot:<br />\nThree hours later, over a thousand is the board of control of the organ\"The American Student Union be- day to discuss plans for<br />\nHis<br />\nsecond<br />\nwas<br />\nBear.\"<br />\nreceived<br />\nsong<br />\nincluding<br />\nJohnny Lambros and Bill Ross will cotillioners, ranking with the highlieves,\" he said at Vassar in refer- these affairs.<br />\nbe in there at forward positions for est, and certainly the merriest, crowd ization. The present nominating corn- nearly as heartily as the first.<br />\nence to war, \"and the campus beThose who thought the height of<br />\nThe Annapolis _quint. ,Nelson • Strawn ever -assembled -4 the-Board,- were mis:sion consists of Dr. E. B. ,Matlieves,• that world war can still be<br />\nand Len Delisio will handle the guard dancing, shagging, sugar-footing, thews, Huntley Lloyd, Hammond the program had been reached had a<br />\nprevented. All our efforts are bent<br />\nassignment and Jim Rowe will square and otherwise contorting their bodies Brown, and Boyd Frey. Once the surprise in store. The concert soared<br />\ntoward averting the outbreak of that<br />\noff at center.<br />\nin rhythm with the inimitable Gray. candidates are selected, they are vot- through a performance of Gebelein's holacaust which spells the end of<br />\nHawaiian Troupe and his Banjo club<br />\nCasa Loma Cocktail<br />\ned on by all active members who with their usual top-flight entertain- human civilization. We will not deThe Casa Loma musical cocktails<br />\nThe University of Virginia debatspair of peace. Our convictions, all<br />\nsubstribe<br />\nto<br />\nthe<br />\npurposes<br />\nof the Y.M. ment.<br />\nwent to the head of more than one.<br />\nour actions are motivated by the ing team returned a visit of the HopUnder the direction of Osmar<br />\nConsider: Hot take-offs in clarinet, C.A. and who give of their time,<br />\nsincere and passionate aspiration to kins Council yesterday and debated<br />\ntrumpet, trombone, and drum, plus a tri;ley, and services to the organiza- Steinwald, the Glee club blended defend the peace we have and to help the subject: \"Resolved that the Na- -voices in the spirited sea chanteys,<br />\nfew Sargent vocals, for body; couple<br />\nbring peace to the peoples that have tional Labor Relations Board be emThe Johns Hopkins Playshop under<br />\n(Continued on Page 4, (2ol. 1)<br />\nand stir well with plenty of Glen<br />\nben plunged . into war by Fascist powered to enforce compulsory arbithe direction of Dr. N. Bryhion<br />\nGray personality; a musical versatiltration of industrial disputes.\" Franaggression.\"<br />\n'<br />\nFagin, associate in English, is proity which few outfits can match; for<br />\nAnnual Gymboree Set<br />\ncis Brodbine and William Zeulser upducing this week The Dance of Death,<br />\n\"We stated last year in the case<br />\nicy refreshments a sprig (or shall we<br />\nheld the affirmative for the Hopkins,<br />\nFor Next Wednesday<br />\na play by the Swedish dramatist<br />\nof Spain and we repeat it in the case<br />\nsay a log?) of Pee-Wee Hunt, to<br />\nwhile John Herald and Jeffrey Bevins<br />\nJohann August Strindberg. The play,<br />\nof China: retreat before aggression<br />\ngarnish the glass; stir well . . . the<br />\nannual<br />\nsecond<br />\nexhibit<br />\nThe<br />\nof<br />\nthe<br />\npresented<br />\nthe negative case for the<br />\nThe annual )Gymboree will be<br />\nwhich started last Tuesday night at<br />\ndoes not enthrone goodwill in the<br />\nCotillion. And few indeed were the<br />\nUniversity of Virginia.<br />\nheld Wednesday night, March 9 John's Hopkins University Photo- world, does not insure<br />\nthe Playshop, will be given far five<br />\npeace,<br />\ndoes<br />\ntee-totalers when it came to this<br />\ngraphic<br />\nsociety has been on view for<br />\nBrodbine and Zeulser pointed to<br />\nat the Hopkins Gym. Admission<br />\nsuccessive nights.<br />\nnot pave the way for justice. Only the<br />\ncocktail.<br />\nthe past week in the library window<br />\nbloodshed anti ill feeling as resultantwill be fr'ee, and all students and<br />\ncreation of an international anti' The Dance of Death, one of the<br />\nThings we'll never forget: Bert<br />\nof<br />\nGilman<br />\nThe<br />\nExhibit<br />\narHall.<br />\nwas<br />\nants<br />\nfrom disputes not arbitrated friends and parents of students<br />\nFascist front, in which the leadership<br />\nmasterpieces of the great Scandinav- Hecht winning the $10, limerick<br />\nranged in time for the commemoraciting especially the \"Massacre\" at<br />\nmay attend. The Gymboree will<br />\nof<br />\nStates<br />\nthe<br />\nUnited<br />\nIs<br />\nessential,<br />\nian writer, is a realistic tragedy of prize, and the presentation by Brian<br />\ncan<br />\ntion day activities at Homewood. It<br />\nChicago last lay. They defended<br />\nfeature a kaleidoscope of sports<br />\nmarried life. Strindberg is noted for Murphy. . . . The Grand March, as<br />\nwas praised for its clear cut and well assure these ends.\"<br />\nAustralia's compulsory system as<br />\nevents, which will be climaxed<br />\nhis stark, almost gruesome portryal led by Judge and Bud Mehling . . .<br />\nordered<br />\nappearance<br />\nwell<br />\nas<br />\nfor<br />\nas<br />\nthe<br />\nMr.<br />\nLash,<br />\nwho<br />\nbloodless, despite the Virginia's conwas<br />\nin<br />\nSpain<br />\nduring<br />\nby a basketball game between the<br />\nof life, and The Dance of Death is Kenny Sargent, singing \"For You\"<br />\nfine quality of many of the prints part of last year, is co-author with tention that it was wasteful in many<br />\ninter-fraternity and Inter-class<br />\nconsidered to be an excellent example<br />\n. . That good-night medly . . . all<br />\nshown.<br />\nJanYes Wechsler of the book, War: hours of labor. The guests attacked<br />\nchampions.<br />\nof this realism.<br />\nthe pretty girls,<br />\n(Continued on Page 4, Col. 2)<br />\nOur Heritage.<br />\nthe N. L. R. B. a-s biased.<br />\n<br />\n\"816 APPLE\" DIES;<br />\nCOTILLION IS HUGH,<br />\nYOWLING SUCCESS<br />\n<br />\nNATIONAL OFFI:CER<br />\nOF A. S. U. TO TALK<br />\nAT HOPKINS THURSDAY<br />\n<br />\nRICARDS ELECTED MUSICAL CLUB<br />\nNEW Y.M.C.A. HEAD NEW YORK BOUND<br />\n<br />\nDEBATING COUNCIL ARGUES<br />\nLABOR ARBITRATION TOPIC<br />\n<br />\nPLAYSHOP PRESENTING<br />\n'THE DANCE OF DEATH'<br />\n<br />\nPhoto Display Held<br />\nIn Library Corridor<br />\n<br />\n\fHOMEWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br />\n2<br />\n<br />\nTbe jobns lOophins<br />\n<br />\ne<br />\n<br />\nletter<br />\n<br />\nsound policy.<br />\nWe think Crist is Showing the proper spirit in calling<br />\nfor suggestions for the time of the parties. If the committe.e carries on in this spirit it will be something<br />\nmore than a hospital for decayed politicians.<br />\n<br />\npotpourri<br />\nBy BUDDY MACHT<br />\n<br />\nHaven<br />\n<br />\nLETTERS TO<br />\nThE EDITOR<br />\n<br />\nengineering and that means - \"to<br />\nIn defense of Buddy Macht.\"<br />\nNEW YORK-4As we look down on<br />\nThe deiril, is never so danwork\".<br />\nTo the Editor of the<br />\nI realize that this letter is a little<br />\ngerous as when he puts on a Broadway today from our twenty- NEws-LETTER:<br />\nFounded 1897<br />\nusually<br />\nand that nothing can be done.<br />\nthe<br />\nroom<br />\nlate<br />\nhotel<br />\nstory<br />\nhalo. Some such process lei second<br />\nSir,<br />\nDear<br />\n$2.00<br />\nYet, I should like to address my<br />\nSulmcription per year<br />\nCongress nerve-wracking roar of Times Square<br />\nin<br />\nplace<br />\n.50<br />\n.<br />\n2<br />\n.$<br />\ntaking<br />\nthe<br />\nof<br />\nsideii<br />\nboth<br />\nMai<br />\nAfter reading<br />\nBy<br />\nclosing remarks to the future memright now where the May doesn't affect us; in fact it seems Hutchinson-Macht feud, I came to bers of the Cotillion Board—may<br />\nStudent Activities Council.<br />\nRemit subscription fees to Treuurer,University.<br />\nBill, \"to take the profits out) quite soothing. But then, of course, the conclusion Mr. Macht deserVes they be more considerate than the<br />\nRemsen Hall. Postoffice, Jana Hopkins<br />\n,<br />\nthe_ postoffice<br />\npresent ones — with the hope that<br />\nof war\", is being considered it's only a matter of relativity. After the orchid.<br />\nEntered as second class matter December 3. 1909. at -3,<br />\n1879,<br />\nNovember<br />\nCongreso,<br />\nof<br />\nAct<br />\nthe<br />\nunder<br />\nIdd.,<br />\nin Baltimore<br />\nmy effort will not be in vain. Thereour recent part in the Macht vs.<br />\nin committee.<br />\ntheme<br />\nthat<br />\nhim<br />\nwith<br />\neataininscan<br />\nI<br />\nagree<br />\nduring<br />\nexcept<br />\nJune,<br />\nto<br />\nOctober<br />\nfore, to them I say, \"Consider what<br />\nPublished aemi-vreeldy from<br />\nlike<br />\nfeel<br />\nwe<br />\nbattle<br />\nTeachers<br />\nFoetal<br />\nShepthe<br />\nHopkins<br />\nas<br />\njohns<br />\nShe<br />\nof<br />\nfamiliar<br />\nnon and college holiday periods by undergraduates<br />\nThe May Bill is probably more<br />\n\"armies\" who loiter in the soda-shop an engineer expressing the thoughts<br />\npnivensity.<br />\nwho's been transported from<br />\nof the Johns<br />\npard-Hill Bill which died ingloriously in committee someone<br />\nin the early morning hours, come of many of the students<br />\n1938<br />\nMEMBER<br />\n937<br />\nrate<br />\nany<br />\nAt<br />\nto<br />\nCatonsville.<br />\nMadrid<br />\nHopkins University—has to say<br />\nI xreacoLtilltits Nowsesrait ASSOCIATION<br />\nlast spring. This new version, like its predecesor,<br />\nthere with no, intentions of improvwould<br />\nscene<br />\nof<br />\na<br />\nchange<br />\nthought<br />\nCotillion.\"<br />\nwe<br />\nHopkins<br />\nabout a<br />\nEDITORIAL STAFF<br />\ncommonly referred to as the Industrial Mobilizatio<br />\nIf their intenSincerely,<br />\nmentally and ing their -homework.<br />\nJ. Murray RemptonJr.<br />\nCirEditor Plan. It proposes \"to equalize the burden of warfare\" be more stimulating<br />\n.<br />\nWetherell Barron,<br />\nM. N.<br />\ntions were good, they would find<br />\nEditors<br />\nManaging<br />\nJr.<br />\nMassy,<br />\nat<br />\nKenneth<br />\nBaltimore<br />\nthan<br />\nHandelsman,<br />\nsafer physically<br />\nJ. C.<br />\nbe<br />\ncan<br />\nprogram<br />\na<br />\nsuch<br />\nEditors<br />\nhow<br />\n4ifamaging<br />\n:Arsistam<br />\nindicating<br />\nQuitt<br />\nquite<br />\nLeonard<br />\nwithout<br />\nThomas MrElhiney,<br />\nmuch better .atmosphere in our li- Bet. I am not an engineer.<br />\nFeature Editor<br />\nthe present moment so here we _are.<br />\nSeymour Sxlcs.<br />\nother<br />\non<br />\nhowever,<br />\nprecise,<br />\nEditor<br />\nmore<br />\nSports<br />\nis<br />\n'It<br />\nd.<br />\naccomplishe<br />\nMilton Alperstein<br />\nbrary or in the closet assigned t<br />\nAssistant Sports Editor<br />\nCharles Digo<br />\nFor the benefit of those of you who<br />\nBarltonoe Editor partifulars.<br />\nthem in Levering Hall, instea<br />\nMal Boshnack,<br />\nREPORTERS<br />\nsay<br />\nwe<br />\nmight<br />\nThe Church<br />\nworried<br />\nbeen<br />\nhave<br />\nmay<br />\ncontrol<br />\nMel Tsymor, 40; Morris Wessel, '39; Daniel Stone. '39,<br />\nwandering about in search of\"<br />\nFor example, the President is given entire<br />\nTo the Editor of the<br />\nvery<br />\n7.eane Baum. '38; Carl Rosin, '38: Lester Rosenthal, '311:<br />\nand civil life. He-can set prices, cen- that Manhattan has changed<br />\neconomic<br />\nour<br />\n1,eonard Rubinger. '35; Seymour Rubin, '40; Irving Mil.<br />\nbe Casanovas.\"<br />\nover<br />\nNEWS-LETTER:<br />\nberg. '39; Herbert Rleinfeld. '41; John Highans, '411:<br />\nlittle since Christmas. There have<br />\nAn open letter to a history proSheldon Fuchs, '35.<br />\nour<br />\nsor the press, dictate to trade unions, and deal sumon<br />\nr<br />\nThis is Hutch's last y<br />\nis<br />\nsubway<br />\nthe<br />\n,<br />\nno<br />\nearthquakes<br />\nBUSINESS STAFF<br />\nfor conduct less than patriotic. You been<br />\nshe is not fessor:<br />\nshe hopes, and<br />\nBusiness Mower marily with citizens<br />\ncampus,<br />\nMelville Locker ...<br />\npeoof<br />\nthe<br />\nand<br />\nmost<br />\nstill a nickel,<br />\nReferring to your history lecture<br />\ncan call that \"Industrial Mobilization\" if you please,.<br />\ne of our<br />\nin adopting<br />\n1 938<br />\nMEMBER<br />\n1 937<br />\nof Thursday the seventeenth I feel<br />\nple still read The Daily News which successful<br />\nASSOCIATED COLLEGIATE Pars, Itistribotors, COLLEGIATE Drum<br />\nbut it sounds like Rome and Jersey Cif), to us.<br />\n\" *holars, she that I must say something about<br />\n\"adolescent<br />\nso-called<br />\nstill features headlines like \"PentRetro:tided for National Advertirina by<br />\nRep. Samuel P. Pettiogill 'of Indiana is one of the house Love Nest Discovered On Park will have to resort to a post-gradu- the unjust and untrue comments<br />\nNAVONAT ADVIIIISINC SERVICE. INC.<br />\n429 Mnirliqon A Venue ; New York City. New York<br />\nwhich you made concerning the docate course.<br />\nmost outspoken of anti-New Deal Democrats. He can Ave.\"<br />\ntrines of the religion which you seem<br />\nAll in fun,<br />\nFRIDAY, MARCH 4, 1938<br />\nhardly be considered as a proponent of anything other<br />\nWe did -glean quite a bit, though,<br />\nto hold in the utmost contempt. Had<br />\nPaul Huette<br />\nthan the Americano Way:<br />\nyou denounced Christianity in the<br />\nand to conserve space we'll have to<br />\nIt appears to us that there<br />\nhe had to say about the May Bill:<br />\nis<br />\nHere 'what<br />\nstrongest manner, you could not have<br />\nPut it down in rather jumbled form, Ditto<br />\nhad best be an end to pur'lowered it more in the estimation of<br />\n\"I will gladly support a bill to tax war profits into Sorry.<br />\nTo the Editor of the NEWS-LETTER<br />\nposeless talk about the<br />\nthe listeners than you did by your<br />\nexethe<br />\ngive<br />\nwill<br />\nwhich<br />\none<br />\nnot<br />\nbut<br />\ntreasury,<br />\nSir:<br />\nthe public<br />\nsubtle and stinging sarcasm. Instead<br />\nwhole business. And for that<br />\nPlay<br />\nThe<br />\nwhich<br />\n•<br />\nfrom<br />\nwar,<br />\nof<br />\ntime<br />\nthat<br />\nnote<br />\nin<br />\nto<br />\npowers'<br />\nIt is very encouraging<br />\ncutive dictatorial<br />\nof presenting your subject in a fair<br />\nreason, we have decided to'<br />\nSaw Father Maktchy's Miracle—<br />\nwe might not emerge when the business of war is over.\" simple play, very well _acted and you have a man On your staff fho is_and unbiased maner, you ,ssmed to<br />\nsubmit the issue to the deciittrct one<br />\na<br />\nis<br />\n-Z.-(urea every vfitnistr<br />\natIsert the riertif<br />\nThe idea of taking a war out of Wall Street<br />\n,<br />\n-Wet,o02 it. that<br />\ntrilreert<br />\nsir of the student body it-rit' it will close this week though. Too his fellow males. I'm referring, of purpose, to show the Church in the<br />\npoint in usu<br />\nno<br />\ncertainly<br />\nis<br />\nthere<br />\nBut,<br />\none.<br />\nsound<br />\nvery worst possible light. Not only<br />\nseit We ho to get the answer the poll which begins<br />\nas a screen for setting up a military dictatorship. It was simple for Broadway . . . Frederick course, to. Mr. Macht whose - subtle did your remarks lack the clarity<br />\ntoday.<br />\nnew play Once is Enough attack on our,\"college widows\" has<br />\nBerlin<br />\nof<br />\nLousdale's<br />\nhero<br />\npresent<br />\nthe<br />\nthat<br />\nuster<br />\nand accuracy that usually comes from<br />\nas a monopoly-b<br />\n_is as we expected, affords a fairly paused many of the College for<br />\n. Of course, the News-Lem:it has its own ideas about<br />\nthorough understanding but they also<br />\ninto power,<br />\nrocked<br />\nthe<br />\nthat<br />\nproving<br />\ncona<br />\nevening<br />\npleasant<br />\nexpressed<br />\nthe question. We have many times<br />\n'Teachers \"students\" no end of cha- lacked the respect and decency beof<br />\nfull<br />\nis<br />\nstill<br />\nclass<br />\nruling<br />\nEnglish<br />\nrather<br />\njust<br />\nEleven new men have<br />\ncoming a professor in a university.<br />\nviction that the Y. C. L. has been the victim of<br />\ndull men and catty women . . . At grin.<br />\nbeen elected to the Barn- the premiere of Al Woods' new Cen- I too have -felt the pangs of dis- I will give an example: Your dis,shabby treatment.<br />\ncussion of the sacrament of penance<br />\nstormers Club, the Univer- sored the audience nearly fell out<br />\nBut, we hope to conduct the poll as fairly as possible.<br />\ngust at the ever increasing number<br />\nScandalsity dramatic society. They of their seats when ten policemen of young females who find it neces- consisted almost entirely of such as<br />\nFor that reason, there will be just as big a display for<br />\ninstances of its abuse,<br />\nous<br />\nyelling \"stop the<br />\naisle<br />\nthe<br />\nions.<br />\ndown<br />\nran<br />\ncongratulat<br />\nour<br />\nfavorable<br />\na<br />\nfor<br />\nhave<br />\nas<br />\ndecision<br />\nwhat we consider an adverse<br />\nof the sary to make an appearance on the the exemption of prostitutes from<br />\nAnd, what is more, if they show!\" It was all part<br />\nby papal decree. (This<br />\none. And, for that reason, we will concern ourselves for<br />\nplay, though, and everybody went -campus at about 8:30 a.m. and in- confession<br />\ndethey<br />\ns,<br />\nwith<br />\nbut<br />\nissue<br />\nconscientiou<br />\nare<br />\nfoundation of truth). No defthe nonce, not with the merits of the<br />\nhome happy. It may go over big if yade the portals of Levering and has no<br />\nwas given. The .<br />\nThey<br />\npenance<br />\nof<br />\ntask.<br />\ninition<br />\nthe munitions makers don't buy Gilman Halls until 4:00 p.m. when<br />\nthe mechanic's ,and, in some measure, with the implica- serve some sympathy, for theirs is a difficult<br />\nfundamentals of this important sacwill be called upon to rebuild an organization, which; ''t up —one of the best anti-war many have their first clizia<br />\ntions'of today's voting.<br />\nrament which are examination of<br />\nto the campus as a rztmas we've seen . . . The general<br />\nand<br />\nThere are two questions on the ballot. Con4etely as it exists today, is hardly an asset<br />\nHopkins is still a man's school. If conscience, contrition, resolution,<br />\nopinion around here of Frances<br />\nunder<br />\nissues<br />\nbasic<br />\nthe<br />\nwhole.<br />\nus<br />\nabsolution were not so much as mento<br />\nSeem<br />\nthey deal with what<br />\nFarmer is that as a blonde she's the girls find it imperative to come<br />\nThese are harsh words, and we realize it. The NEWS- perfect but as an actress—well, she's here to do what they imagine to be tioned.<br />\ndiscussion—(I whether the Young Communist League<br />\nover-aggressive in this just another blonde.<br />\n. However, since you spoke of sacitself has the right to sponsor meetings and assemblies LETTER does not wish to appear<br />\nstudying, then let them crawl into<br />\nraments as the mystical powers of<br />\nbut is merely voicing the opinion of many Hoptheir various cubby holes and stay<br />\non the campus and (2) whether Communists should be matter,<br />\ndecay<br />\nthe Church instead of the channels<br />\nThe Spots<br />\nkins undergraduates who have watched the slow<br />\nthere.<br />\nare<br />\nallowed to speak out here.<br />\nthey<br />\nwhere<br />\nstate,<br />\nof divine grace, one could hardly exof the 'Stormers into their present<br />\nLeon and Eddie's 'still the same<br />\nMacht will keep<br />\nMuch of,the recent controversy has centered about content to wear their keys and present only one offering except for a new series of wise I hope that Mr. he has started. pect you to know anything about<br />\nup the crusade that<br />\nthem. You stated that the theologthe allegedly secret, conspiratorial, -and .mysterious in an entire school year.<br />\ntracks painted on the walls. Over<br />\nexcellent<br />\ngenerally<br />\nis<br />\ncolumn<br />\nHis<br />\nians of the church were continually<br />\nnature of the Y. C. L.'s activities. For instance, the<br />\nAt the outset of this term a tentative program was out- the door of Leon's office is the la- and has many readers among the up- \"squirming\" to conciliate purity<br />\nbut actually ment, \"Through these portals the'<br />\nLong may he rave!<br />\nmajority of the Student Council, in its statement on the lined which included not only two shows,<br />\nbrackets.<br />\nper<br />\nwith marriage and that the Church<br />\nhave our S. A. C. cards to remind most beautiful checks in the world<br />\nYours,<br />\nassembly issue, concerned itself with the character of a state-wide tour. We<br />\nme finally forced to maLtviarriage<br />\nVeloz and<br />\nbounce back.\"<br />\nproject.<br />\nS.<br />\nS.<br />\nthis<br />\nS.<br />\nof<br />\nus<br />\nto<br />\n\"<br />\n2 sac/Ai-tient. If you •`(,zer—tit.'<br />\nthe League rather than to the right of \"extremists<br />\nwho ,become sensations aboutplans<br />\n4ned<br />\nhailie4:3<br />\nrs<br />\n3arnstorrne<br />\nChrist's teachings at the Sermon on<br />\n1414W-.%'.::.free exprEsit)t.:'<br />\nonce every six months, are the cause<br />\nsecond show. Monetary disability is the favqrite ex- of bated breath at the Persian Room To the Editor, ,<br />\nthe Mount you will find that it was<br />\norder<br />\nin<br />\nfashion<br />\nthis<br />\nin<br />\nquestions<br />\nWe phrased our<br />\ncuse. But, to our way of thinking, the group would have of The plaza . . . Ivan Frank, whose While reading over the \"Letter to he who elevated matrimony to the<br />\ndistincsame<br />\nallowthat<br />\nmake<br />\nits<br />\nof<br />\nwho<br />\nNEWS-to give full play to those<br />\nthe Editor\" column in the<br />\ndignity of a sacrament, a position<br />\ndone better to relegated certain portions<br />\nplace in Baltimore is usually half<br />\nLETTER of Friday February 18, 1938 which it continued to hold. Purity is<br />\nance to each of the two productions.<br />\ntion.<br />\nempty, is paPking 'em in at his<br />\nI<br />\nMtMions:<br />\naboutthink<br />\nto<br />\n-LETTER<br />\nbegan<br />\nonly because it is an abI<br />\nNEWS<br />\nThe ballots need not be signed. The<br />\n---FranklyTwe find hard to- believe that the plan was Austrian beer stube on Seventh Ave. saw a letter from an engineer to the a virtue<br />\n^<br />\na fleshly desire and<br />\never seriously considered in the first place. The reasons They sing smutty songs in German Judge, below it a reply, and I won- stinence from<br />\nwelcomes comment written on the ballots.<br />\nthus exalts the spirit. It is not one<br />\nschedule have a more so that the girls won't be embaroften<br />\nUnless there is a representative vote, the poll can given by the club for changing its<br />\nhad<br />\nI<br />\nis<br />\ntruth<br />\ndered — the<br />\nof the cardinal virtues of the Church.<br />\nhollow ring.<br />\nrassed, then they translate them inwondered—just What is' a Cotillion? The sacraments of the Medieval<br />\nprove nothing. We hope, therefore, that those who are than faintly<br />\nsuch a grandiose pro- to English so the boys can under- Whom is it for? I had always had an<br />\nthat<br />\n,<br />\n.<br />\nbusimoreover<br />\ntheir<br />\nit<br />\nthink,<br />\nmake<br />\ndon't<br />\nwill<br />\nWe<br />\ncontroversy<br />\nthe<br />\nof<br />\nsick<br />\nbit<br />\nChurch (the Catholic Church of toa<br />\nfor anyway. The Barnstormers are not stand them.<br />\nidea that Hopkins Cotillion is a dance day) have remained fundamentally<br />\nness to vote just as those to whom it is still a live issue. ject was called Their purpose should'be to provide the<br />\nHopJohns<br />\nthe<br />\nof<br />\na social group.<br />\nfor the students<br />\nthe same in nature and unlike outTheoretically, of course, the poll doesn't mean much. campus with the best available dramatic offerings. The The Party<br />\nkins University. (It's strange how ward church customs, have not gone<br />\nBut, if the decision 'runs against the Y. C. L., it will so-called \"glamour\" of Barnstormer night should be The current party story now go- one can get such queer ideas). In his through a period of evolution.<br />\ning the rounds here is one about letter, the Judge made the enlightenserve the purpose of lending weight to the status quo. sec'ondary.<br />\nThe main point is that in continElsa Maxwell (they're always about<br />\nthat \"we could have<br />\nAnd, if the result is favorable, perhaps this and future<br />\nually emphasizing and exaggerating<br />\nThe club would do well, we think, tq revise its ideas. Elsa Maxwell). This time she wanted ing statement<br />\ndepended<br />\nand<br />\nband,<br />\nsmaller<br />\na<br />\ngotten<br />\nproStudent Councils at least may lend an ear.<br />\nthe immorality ,of Churchmen you<br />\nIt should acquaint itself with the activities of<br />\nblocks of ice in a conupon the enthusiasm of the student<br />\neye to its to lay down<br />\nIn the opinion of a majority of the Council, re- gressive university dramatic societies with an the pre- tinuous path from the Waldorf to body alone for support.\" Note the failed to mention the universally recseriously<br />\nconsider<br />\nshould<br />\nthat there was no degown improvement. It<br />\nRadio City, a. distance of five blocks, word alone; it's quite interesting. ognized fact<br />\nleased on January 24, we find this sentence.<br />\nsentation of at least three qr four smaller productions so that her guests could ice skate Well as one would philosophically radation in the teachings of the<br />\n\"To you of the undergradutte body ...., who may<br />\nchurch regarding faith and morals.<br />\nin addition to the main show. Such modest offerings<br />\nthere. In fact she had already say, \"We live and we learn.\"<br />\nbe interested in and who have evey right to know the may not provide either the color or the revenue of over<br />\nIn other words, you confuse the morengaged an ice company when the<br />\ngovernstudent<br />\nclub<br />\nelected<br />\nthe<br />\nof<br />\nthe<br />\nyour<br />\nbring<br />\nparagraph<br />\nof<br />\nwould<br />\nsecond<br />\nIn the<br />\nmotives and actions<br />\n\"Barnstomer night\". But, they<br />\nals of the people in the Church with<br />\ncops found out about it and objected<br />\nJudge's letter he suggested to our the morals of the Church itself. Accloser to its real purpose.<br />\nmeat, the Student Council makes this statement.\"<br />\nvehemently, pointing out that traffact would ceres doubtless sincere engineer, that the<br />\nIt is a very real and sober world of. facts 'Clt the fic on five principal thoroughfar latter stop writing \"icute\" letters, curate and specific in the place of<br />\nIt is in accordance with this sentiment that we open<br />\neleven new 'Stormers must face today. Thcfv lave to would 'be tied up for several hours. and in addition that he take a course tainly be appreciated<br />\nour poll today.<br />\nand<br />\nhazy generalizations and dirty Jokes.<br />\nmake the choice between a Barnstormer Club d a uni- Elsa, however, was very angry<br />\nin English Writing. I would. just like<br />\n—A. F. Commiskey<br />\nThe June Week Committee versit dramatic society. We sincerely hope that they said her party would be a flop.<br />\nfor which they \"I'm sure no one would have to sit , down and write \"fancy anda<br />\npurposes<br />\nreal<br />\nthe<br />\nmind<br />\nin<br />\nbear<br />\nplease<br />\nwill<br />\nto<br />\nenough<br />\nlarge<br />\n'seems<br />\npretty\" letters to the NEWS-LlerrE Anent Baseball<br />\nminded, she remarked.<br />\nto convey their ideas, as do the Ma- To the Editor of the<br />\nevery political clique in the were constituted.<br />\nof business and arts students. NEws-LE.-m.R•<br />\njority<br />\nhappiSenior Class. With<br />\nThe NEWS-LETTER submits The Met<br />\nEd..-- •<br />\nEngineers come to college to study Dear<br />\nan unsolicited apology to<br />\nness and harmony at the<br />\nof<br />\nslice<br />\nbiggest<br />\nIn our opinion the<br />\nsoccer, basketball, and<br />\nweek's<br />\nLacrosse,<br />\nlast<br />\nfor<br />\nFrank Butt<br />\noutset the three months life<br />\nentertainment offered in New York<br />\nhandball all have their own fields to<br />\neditorial entitled, \"Notes on<br />\nit will enjoy may be beneany one night are the Metropoli- In General<br />\non<br />\nplay on. The baseball team; howthe Sophomore RepresentaHeard in Lindy's: \"You're just a<br />\nOpera gala Sunday eve concerts.<br />\nficial to all of us. All auguries point in this direction<br />\ntive.\" The talon dealt with tan program lasts for about three fugitive from a charm bracelet\" . . . ever, is found to exists without a<br />\n—the financial success of last year's June Week, the<br />\na statement by Mr. Butt on The includes acts in costumes from New Yorkers are so tired of double diamond, a cage, or even adequate<br />\nhours,<br />\nThat baseball<br />\nclose tabs kept by the S. A. C. on its_management, and the question of allowing the Young Communist League various operas, solos, duets, etc, by features that someone has suggested practicing facilities.<br />\nhas lasted as long as it has is due to<br />\nthe popularity of the recent Cotillion. All this committee an assembly.<br />\nthe biggest operatic stars, whole acts running them both at the same time.<br />\nthe activities of Coach Owings and a<br />\nwill have to bear in mind is the causes of ,his, and hence<br />\nWe still cannot agree with his point of view. But by the entire company of the Ameri- \"The people in Brooklyn wouldn't few undergraduates who are vitally<br />\nOrchesunjustifi.<br />\nin'<br />\nMet<br />\nweek<br />\nthe<br />\nlast<br />\nby<br />\nhe<br />\nknow the difference anyway,\"<br />\ncan Ballet, music<br />\nour sentiments were expressed<br />\nprofit accordingly.<br />\nin this game.<br />\nthis particu- tra and just about anything else you said . . . Yes, it's still the same. This Interested<br />\nMost important is efficient supervision of the S. A. C. ably personal terms. We can only say that<br />\nof a musi- evening we saw two Columbia boys<br />\nwinning team with the support<br />\nand<br />\nA<br />\ninserted<br />\nway<br />\nhaste<br />\nthe<br />\nin<br />\nin<br />\nfor<br />\nconceived<br />\nwas<br />\nask<br />\ncould<br />\ngown<br />\neditorial<br />\nlar<br />\nand<br />\ntown<br />\n—both bodies should recognize that<br />\ngranted<br />\npainting over the Deanery sign in of the student body will be<br />\ncal feast.<br />\nthrough carelessness.<br />\nwill<br />\nhereabouts like 'name' bands and the greatest profit<br />\nfront of Barnard College. They sub- proper facilTes. This years team<br />\nmissin<br />\nd<br />\ncolumns.<br />\nin<br />\nthese<br />\ndisappointe<br />\nplace<br />\nno<br />\nonly<br />\nhave<br />\nwere<br />\nshould<br />\n....We<br />\nTo<br />\nspirit<br />\na<br />\nSuch<br />\nwin — the reseponsibillty, therefore,<br />\nand enjoyment will come front engaging the best.<br />\nto<br />\nadmit<br />\nashamed<br />\nis<br />\nwho was forced. to stituted a B for the D . . . Oh,Well,<br />\nwhich<br />\nMartinelli<br />\nspirit<br />\nthe<br />\ning<br />\nshould<br />\nNeither<br />\nand<br />\nBack to the wars rests with the student body.<br />\ndo so means that the committee must star, early<br />\nforego his role because of nervous times never change.<br />\nits own Mistakes.<br />\nA. R.<br />\nagain—and we mean that literally.<br />\ndeliver for them. First, however, they ought to consult<br />\nindigestion.<br />\nButt will accept our apology.<br />\n<br />\nInt<br />\n<br />\nA Surrender<br />\n-To The<br />\nWarmongers<br />\n<br />\nThe Y. C. L.<br />\ncontinued<br />\nfrom page 1<br />\n<br />\nThe Stormers<br />\nFace<br />\nThe Future<br />\n<br />\nJune Weck<br />\nCommittee<br />\nIs Chosen<br />\n<br />\nas a matter of<br />\nthe student body as to their choice,<br />\n•<br />\n<br />\nAn Apology<br />\n<br />\nWe hope Mr.<br />\n<br />\nPla<br />\n<br />\nA.<br />\nnigh<br />\nBae<br />\ntati<br />\nques<br />\n001-11,<br />\nbore<br />\neven<br />\nnam<br />\n.A.<br />\nfenc<br />\na pl<br />\nbask<br />\nSigs<br />\npha<br />\nstall<br />\n<br />\nterf<br />\ned o<br />\nbe<br />\nnity<br />\nthe<br />\n.poin<br />\nty-n<br />\npio<br />\nof h<br />\nrens<br />\n<br />\nA<br />\nbore<br />\ntwe•<br />\nall-c<br />\nand<br />\nthe<br />\nday,<br />\nbe<br />\npoin ,<br />\npoin ,<br />\nthe<br />\nthe<br />\ntea<br />\n10 p<br />\nIn<br />\nsoftthat<br />\nstar<br />\nvars<br />\nbarr.<br />\nball.<br />\npetit<br />\n21<br />\nfor<br />\n<br />\n\fHOMEWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br />\n<br />\nGYMBOREE TO OFFER<br />\nVARIED ATTRACTIONS<br />\nInterfrat Tug Of War, Badminton Match Are<br />\nHighlights Of Event<br />\nPlans For Volley-Ball And<br />\nSoft-Ball Competition<br />\nDiscussed At Meeting<br />\n<br />\nBall Club Practices<br />\nThe 1938 baseball season will<br />\nget officially under way with the<br />\nfirst practice on Saturday, March<br />\n12. Coach Bob Owings, in an effort<br />\nto get his charges in shape for<br />\nthe opening game with Drew University has called an intensive<br />\npractice at the Gilman Hall cage.<br />\nA .squad of 40 rookies and veterans is expected to answer the<br />\n,call.<br />\nMore Candidates Needed<br />\n<br />\n3<br />\n<br />\nHopkins Quint Defeats Wilson<br />\nTeachers and Drew University<br />\n<br />\nJAY FISH TO MEET<br />\nMANHATTAN TONIGHT<br />\nWill Complete Season With<br />\nVeteran New Yorkers<br />\nAt Home<br />\n— —<br />\nHill, Jacobs, Radner, Weiner<br />\nTo Bear Burden Of<br />\nJays Hopes<br />\n<br />\nTrounce Washington Team Take Madison N. J. Five<br />\nInto Camp 56-30<br />\n- By 59-37 Score TuesAt Homewood<br />\nday Night<br />\nMelvin, Rasin, McLain Lead Second Stringers See Action<br />\nAs Opponents Defense<br />\nTeam In Late Scoring<br />\nVery Ragged<br />\nSpree<br />\n<br />\nThe Johns Hopkins swimming team<br />\n<br />\nwill close its 1937-1938 tank season<br />\nThe Johns Hopkins cagemen won<br />\ntonight against Manhattan College<br />\nnight at Levering Hall, with Reuben<br />\n-Ye its second smashing victory so-far<br />\npoints in the last ten minute/CU<br />\nof New York at the City College<br />\nBaer presiding, fraternity' representhis week by crushing the Drew UniHopkins varsity five trounced the<br />\npool. The Jays after winning their<br />\nversity quintet, 56-30. The Blue Jays<br />\ntatives talked over some pertinent<br />\nquintet<br />\nof<br />\nCollege'<br />\nWilson Teachers'<br />\nwere in the lead from the start, and<br />\nfirst two meets struck a losing streak,<br />\nquestions about the interfraternity<br />\nlast<br />\n5937,<br />\nWashington, by a score of<br />\nthe outcome of the game was never<br />\nand hope to end the year with a<br />\ncompetition yet to come. The GymTuesday night at the Homewood gym- In doubt.<br />\nsmashing victory over their New<br />\nboree was also discussed and the<br />\nJays<br />\nScore<br />\ngasily<br />\n,<br />\nnasium.<br />\n. events that will take place were<br />\nYork rivals.<br />\nFrom the beginning it was a mat- COACH WALDO HAMIWEToN<br />\n•<br />\nnamed.<br />\nSecond Half Spree<br />\nMeet Will Be Close<br />\nter of, how many points the team<br />\nThe times Of the Manhattanites are<br />\n•<br />\nAt the Gymboree, there will be<br />\nIn the second half, leading this could score with Melvin, Rasin and<br />\nvery near the average times of the<br />\nfencing, tumbling and wrestling. In<br />\nscoring spurt, were Norm Melvin, McLain leading the way.<br />\nJay mermen, and the Meet -promises<br />\na play-off game to decide fraternity<br />\nCaptain Carl Resin and Joe McLain.<br />\nThe lineups:<br />\nto be a close one, with the Black and<br />\n. basketball champions, the Kappa<br />\nDREW<br />\nThis trio accounted for thirteen field<br />\nBlue favored.<br />\nSigs will oppose the Epsilon Tau AlOF.<br />\nT:<br />\ngame.<br />\nsecond<br />\nhalf<br />\nof<br />\nthe<br />\ngoals<br />\nin<br />\nthe<br />\nSmall Group Competes<br />\npha five. •<br />\nStanert, g<br />\n4 0 8<br />\nThe Blue Jays will again depend<br />\nWith ten minutes to go, the Jay passThe Kappa Sigs have been inCiardi, f<br />\nO 0 0 E. T. A. Wins First Playoff upon their handful of 'stars to carry<br />\nstalled as favorites to win the game.<br />\nwork started to click smoothly, the Haugh, f<br />\n2 3 7<br />\nthe bulk of ,the work. Co-Captains<br />\nGame By Score<br />\nPasternack Outstanding As shooters broke sharply for the bas- Winch, f<br />\nD. U. Favorites<br />\n1 0 2<br />\nHarold Jacobs and Alan 14111 will take<br />\n. The next attraction will be. the in15-10<br />\nket at the right moments, and the Stem, c<br />\nHopkins Avenges Lone<br />\n4 1 9<br />\ncare of the diving, the 220, and the<br />\nterfraternity tug of war. Baer pointO 1 1<br />\nshots kept dropping through the Eskesem, c<br />\nvarious<br />\nrelays..<br />\nDefeat<br />\nSeason's<br />\ned out that only eight man teams will<br />\nBaugby, g<br />\n0 1 1 ' Kappa Sigma, heavy favorites to<br />\nHill has been improving in the midhoop with regularity.<br />\n• be allowed to compete. Any fraterinter-fraternity basket<br />\ncapture<br />\nthe<br />\nBackstrom,<br />\n0<br />\n2<br />\n1<br />\nthe<br />\ndefeat<br />\nof<br />\nAvenging their only<br />\ndle distance and hopes to end up the<br />\nTeam Starts Slow<br />\nnity entering will receive ten points,<br />\n_ ball championship, meets T. A. 0.<br />\nyear with a clean-cut victory. Jacobs<br />\noarrent season, the Jay handball team, The game started fairly slowly and<br />\nthe runner-ups will receive fifteen<br />\nTotals<br />\n12 6 30 tomorrow in the second of the three will take care of the diving, although<br />\ndefeated the George Washington<br />\n'points, the winners will receiv4 tWenfirst<br />\nfive<br />\nminutes<br />\nat<br />\nthe<br />\nend<br />\nof<br />\nthe<br />\nHOPKINS<br />\nUniversity team last Thursday by a<br />\ngame playoffs which will decide'the the competition that the New York<br />\nty-nve points. D. U., defending chamG. F. T.<br />\n,<br />\naccording<br />\ndivers will offer might be.<br />\nscore of 5-1. The match was played the score was tied at 8-8, The Washinter-fra.t cage championship.<br />\npions, are seeded first in this tussle<br />\n1 4 6<br />\nington team fought on fairly even Traggis, f<br />\non the courts at Homewood.<br />\nto records, too much for him.<br />\nKappa Sig Favored<br />\nof brawn and muscle.<br />\nCross, f<br />\n0 4<br />\nRadner And Weiner Favored<br />\nIn the first match, Gus Erskine, terms...pi the remainder of the haZic.3.,_<br />\nKappa'Sig, led by Frank Butt, Bill<br />\n. _ Another bright spot of the Gym- Hopkins, defeated Walt.<br />\n15 Day and Frank McGovern, was OW<br />\n-T,Ibwboree will be a badminton match be- hardt in two straight games, 15-16, but after score stood at ten to tell, Schwartzman, ik<br />\n1 1- 3 tically the same team which carried year on the aquas by participating in<br />\ntween Jimmy Benson and a former 15-8. Erskine, a freshman, has been the Hopkins five started to forge Moore,.c<br />\n3 0 6 them to the finals last year and which the 440 yard free style. He has been<br />\nall-city champ.<br />\n1 0 2 will probably give them this year's more than successful during the year,<br />\nplaying consistently good ball, this ahead. Capturing most of the re- Carlfleton, c<br />\nRasin,<br />\ng<br />\n5 0 10 title. However, T. A. 0., led by little and handed in many excellent times.<br />\nEverybody is urged to support it season, and did not have much diffi- bound because of their superior<br />\nRubinger, g<br />\n1 0 2 Marty Srebnik, has a victory over the He will also anchor the relay.<br />\nand make it a success.<br />\n•<br />\nculty defeating Engehhardt.<br />\nheight, the Jay quintet outscored<br />\n4 0 8 strong Phi Psi quintet to its credit,<br />\nVeteran Danny Weiner and Bill<br />\nThe result of the second match their opponents from then on. At the McLain, g<br />\nThen, it was decided to run off all<br />\nRobinson, g<br />\n0 0 0 and will in all probability give the Dunlap will take care of the backthe volley-ball competition in one found Dick Pasternack the victor<br />\nhalf, the score stood at 25-17 in<br />\n— — — Kappa Sigs a tough game<br />\nstroking event with Weiner expecting<br />\nday, Saturday, March 12. There will over Charles Walden by score of 15-9,<br />\nTotals<br />\n24 8 56<br />\nlittle difficulty in his favorite event.<br />\nbe a double round-robin, and the 19-4. Pasternack played his usual favor of the Black and Blue.<br />\nE. T. A. Defeats T. A.0,<br />\nScore at half—Hopkins,• 29; Drew,<br />\nTeachers<br />\nStiffen<br />\nAttack<br />\naggressive<br />\ngame:<br />\nWaldo Hambleton has expressed an<br />\nfine<br />\nand<br />\nformer,<br />\nPhi<br />\npoint score will be as follows: 45<br />\nE. T. A.,<br />\nAlpha, de20.<br />\nPlaying in the third Slot, Iry Milpoints for the winner, 35 points for<br />\nfeated T. A. 0., 15-10, in the first , optimistic outlook upon the season's<br />\nThe Teachers rallied in the second<br />\nthe consolation prize, 25 points for berg disposed of Charles Engelhardt half until the score-board showed<br />\nplayoff game for the championship. finale.<br />\nThe lineup:<br />\nthe runner-up, 20 points for the third in two games, blanking his opponHopkins leading at 35-31. Then Melscores<br />\ngame.<br />\nThe<br />\nsecond<br />\nent<br />\nin<br />\nthe<br />\nteam, 15 points for the fourth, and<br />\nWILSON TEACHERS<br />\nvin, Rasin and McLain started the<br />\nwere 15-6, 15-0.<br />\n10 points for all entering teams.<br />\nG. F. T.<br />\nrally. In ten minutes, the score rose<br />\nIn the first doubles match Red<br />\n. Soft Ball To Start<br />\npardon,<br />\nf<br />\n2 1-3 5<br />\nto 59 points for Hopkins, when the<br />\nIn the discussion of the coming Glantz and Nat Finkelstein defeated<br />\nGilliam,<br />\nf<br />\n2<br />\n2-2 6<br />\ngame ended.<br />\nsoft-ball league, it was brought out W. Engelhardt and , Walden, 15-10,<br />\nGa., c<br />\n0 0-1<br />\n0<br />\nMelvin High Scorer<br />\nthat the competition will probably 15-11. Finkelstein was brilliant in this<br />\n1 0-1<br />\n2<br />\nNorman Melvin, sharp-shooting for- Ervin, g<br />\nstart before the Spring vacation. All match, and his killer shots and serLewis,<br />\ng<br />\nO 0-1<br />\n1<br />\nward, led the Black and Blue scoring<br />\nvarsity baseball players will be vice were too good forhis opponents<br />\nClark,<br />\ng<br />\n10<br />\n1-2<br />\n21<br />\nwith 18 points.<br />\nbarred from playing interfraternity to handle.<br />\nHart, g<br />\n1<br />\n0-1<br />\n0<br />\nCaptain Carl Rasin was next with.<br />\nPlaying the number two doubles<br />\nball. The winner of the soft-ball comFairall, g<br />\nO 0-0' 0<br />\npetition will receive 105 points, with team, Milt Alperstein and Dick Pas- 15 points, while \"Dimi\" Traggis fol— — -with 14 markers.<br />\nlowed<br />\n21 points for every win, and 5 points ternack won handily by a score of<br />\nTotals<br />\n16<br />\n5-10 37<br />\nHowever, Clark the high scorer of<br />\nfor every loss.<br />\n15-10, 15-13.<br />\nHOPKINS<br />\nthe evening score 21 points, putting 6<br />\nG. F. T.<br />\nfield goals through the hoop in the<br />\nTraggis, f<br />\nWe Carry A Full Line Of<br />\n5 4-5 14<br />\nfirst half, and accounting for four<br />\nMelvin, f<br />\nAtrow Shirts And Collars<br />\n8<br />\n2-6 15<br />\nfield goals and one foul shot in the<br />\nSchwartzman,<br />\n0 0-0 0<br />\nsecond half:- This one-man team<br />\nMooreiGe 44<br />\n_41;?\"<br />\nscored more than half of the total of<br />\nCross'<br />\n,c<br />\nO 0-0 0<br />\nthe Teachers' points.<br />\n11 East Baltimore Street<br />\nResin, g<br />\n7 7-1 15<br />\nThe Hopkins five were substituted Robinson, g<br />\n1 -0-0 2<br />\nfreely throughout the game. Those McLain, g<br />\n• 40-0 8<br />\nwho saw action were Schwartzman, Carleton, •g<br />\n1 0-0<br />\nMoore, Robinson, Carleton and Cross..-.— —<br />\n—<br />\nThe reserves played very well on the<br />\nTotals<br />\n26 7-12 59<br />\ndefense and held their own on the<br />\nScore at half—Hopkins, 23; Wilson,<br />\noffense.<br />\n17.<br />\nAt a<br />\n<br />\nmeeting<br />\n<br />\nheld<br />\n<br />\nWednesday<br />\n<br />\nAny student who did not attend the organization meeting and<br />\nwho wishes to try out for the team<br />\nshould send his name immediately to Manager Mal Boshnack at<br />\nthe postoffice. All candidates for<br />\npitching and catching berths are<br />\nrequested to limber up at the gym<br />\nthis week as batting practice will<br />\nbe held as soon as possible.<br />\n<br />\nUnleashing<br />\n<br />\na<br />\n<br />\nterrific<br />\n<br />\ndrivve. for<br />\n<br />\nKAPPA SIGS TO FACE<br />\nT. A. 0. IN PLAYOFFS<br />\n<br />\nBLUE JAY WALLMEN<br />\nDEFEAT G.W.SQUAD 5-1<br />\n<br />\n—<br />\n<br />\nSwim Coach<br />\n<br />\nRE-SMING<br />\nCORONADO'S<br />\nTRAIL<br />\n<br />\n\"cPherkstr;7's<br />\n<br />\nBilltELEV'S<br />\n<br />\nKIBLER'S'<br />\n<br />\nPHARMACY<br />\n<br />\nJewelers and Opticians<br />\nParker Pens and Pencils<br />\n<br />\nST. PAUL AT 33RD STREET<br />\n<br />\nJewelry and Watches<br />\nEyes Examined<br />\nLens Repaired<br />\n<br />\nPrescriptions—School<br />\n<br />\nSupplies<br />\n<br />\nSandwiches<br />\n<br />\n3222 Greetunount Ave.<br />\n<br />\nUnexcelled Fountain Service<br />\n<br />\n•<br />\n<br />\n•<br />\nOnly Down Town Stag<br />\n'<br />\ne Show<br />\n<br />\nHIPPODROME<br />\n<br />\nNOW<br />\nPLAYING<br />\n<br />\nA Schloss Suit<br />\nToday Costs You<br />\n<br />\nHELD OVER!<br />\n<br />\nOnly $26.25.<br />\n<br />\n4th BIG WEEK!<br />\n<br />\nMonday That<br />\n<br />\nWALT DISNEY'S<br />\nFirst full length feature<br />\n<br />\n\"S N 0 W<br />\nWHITE<br />\n<br />\n\"What shirt on the market absolutely defies<br />\nshrinkage — is known for high style, and is<br />\nreputed to give lasting wear?\"<br />\n<br />\nCost You $35!<br />\n<br />\ntelephone poles!<br />\n<br />\nagainst the<br />\nMasked and goggled<br />\ntelephone men have<br />\ndust,<br />\ndesert<br />\nyear -old trail<br />\nfollowed the 400<br />\nbuilding the new<br />\nin<br />\nCoronado<br />\nof<br />\nline<br />\ntranscontinental telephone<br />\nThe Spancomplete&<br />\nrecently<br />\ndays to cross<br />\niards took many<br />\ndriving<br />\nSouthwest:,<br />\nthe trackless<br />\ntheir return.<br />\nstakes to guide<br />\nthis desert inYou can span<br />\nnew line,because<br />\nstantly over the<br />\nspirit of Coronado<br />\nthe pioneering<br />\nlives.<br />\nstill<br />\nOceans,rnountains,deserts yield<br />\nbringing<br />\nspirit,<br />\none by one to that System goal:<br />\nBell<br />\nthe<br />\ncloser<br />\never<br />\ncommunidependable telephone<br />\nanywhere!<br />\nanyone,<br />\nwith<br />\ncation<br />\n<br />\nand the<br />\n<br />\nSeven Dwarfs\"<br />\n<br />\nSale<br />\n<br />\nof<br />\n<br />\nto-war<br />\n<br />\n\"Why. Arrow, of course. Your Arrow dealer<br />\nhas a large assortment — $2. and up.\"<br />\n<br />\nin the new<br />\nMultiplane Technicolor<br />\n—.—<br />\n<br />\nARROW SHIRTS<br />\nA<br />\n<br />\nSame Suit Will<br />\n<br />\n.... with<br />\n<br />\nEXTRA ADDED<br />\nThe N.<br />\n<br />\nnewest<br />\n<br />\nReady-<br />\n<br />\nends tomorrow<br />\n<br />\nJos. Schloss & Son<br />\n<br />\nMarch of Time<br />\n<br />\nnew shirt if one ever shrinks.<br />\n<br />\nPI,—ALL NE*<br />\n<br />\nStage Show<br />\n•<br />\n<br />\n5 EAST LEXINGTON ST.<br />\n(Nowhere else<br />\n<br />\nItEILL TIELE1'1111NE SYSTE1<br />\n<br />\n\fHOM:EWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br />\n<br />\nMONDAY LECTURE DR, HAROLD HOUGH<br />\nGIVE LAST GROUP<br />\nMARKS FINISH OF;TO<br />\nOF RELIGIOUS TALKS<br />\nCATHOLIC SERIES<br />\nDrew Professor Will Close<br />\n1937-1938 Season With<br />\nDr. Fenwick Of Bryn Mawr<br />\nThree Lectures<br />\nDeals With Church<br />\nAnd State<br />\n\"Protestant View On Social<br />\nIssues\" Is To Be<br />\nOpens Talk By Alluding To<br />\nSubject<br />\nViews Of Former<br />\nTheologians<br />\nDr. Lynn Harold Hough, professor<br />\nOn Monday evening. February 28,<br />\nat 8:15 P.M., Professor Charles G.<br />\nFenwick of Bryn Mawr College, Pennsylvania, lectured on \"Church and<br />\nState and the International Ordcz,\"<br />\nThe lecture Was given in Latrobe Hall<br />\nand was,the third and concluding talk<br />\nby Catholic professors on outstanding<br />\ncurrent problems.<br />\nDr. Fenwick opened his talk by alluding to the views of former theologians on the possibilities of a \"just\"<br />\nwar and indicating the irrelevance of<br />\ntheir discussions to the terrifying<br />\nproblems of modern scientific warfare. Continuing along this theme, he<br />\nbrought the situation from renaissance times up to 1920. In this period<br />\nhe showed how the \"bankruptcy of<br />\nthe balance of power scheme had<br />\nbeen painfully demonstrated\" and<br />\nhow the world, under the influence of<br />\nWilsonian idealism, had looked to<br />\nthe fresh hopes of world organization.<br />\n<br />\nDr. Graham To Talk<br />\nTo Supper Clubmen.<br />\n<br />\nCAMPUS CAVORTINGS<br />\nJoe College reads like an 8-year-old third-grader, and at. least one<br />\ncollege professor is doing something about it.<br />\nDr. Emmett A. Betts of Pennsylvania State College has conducted exhaustive researches which proves his point, and he is now treating 31<br />\nstudents in his \"reading clinic.\"<br />\n\"Persons who have the reading abilities of children in the third grade of<br />\npublic schools have been found among college students,\" Dr. Betts said.<br />\n\"The fact that they are doing acceptable college work, although handicapped by rudimentary reading, is a glowing testimonial to their-general<br />\nintelligence.<br />\n<br />\n• • • .<br />\n<br />\nA national shrine for the study of science and religion and for the<br />\ntraining of modern youth in these two courses has been established at<br />\nFlorida Southern College,<br />\nThe E. Stanley Jones Educational Foundation,_as_it will be called, is<br />\nnamed after the famed missionary to India, the man who conceived the idea<br />\nof homiletics and comprehensive of the new center.<br />\nThe structure which will house the foundation will contain five religious<br />\nscholkrship at Drew Theological Seminary, will give the last three lec- departments, scientific laboratories, a library, an auditorium, administrative<br />\ntures on religion, sponsored jointly offices nd classrooms.<br />\n• • • •<br />\nby the University, the Baltimore<br />\nNow that you are all nicely settled in your dormitory room and have<br />\nRound Table of the National Conference of Jews and Christians. These been attending classes for at least five months this school year, we are<br />\nlectures will be held in Latrobe Hall giving you a gentle jolt from an educating easterner that maybe it's all<br />\nat 8.15 p. m., on March 7, 14, and 21, a waste of time.<br />\nSimmons College's president is the jolter, and here's the jolt: \"Don't<br />\nand will deal with the Protestant<br />\nView; on Social Issues Confronting assume that your, • life is blighted . . . if (you don't) go to college.\" But,<br />\nif you're already there, says he, \"college work should be above all, an intelthe Religious Groups.<br />\n•<br />\nGraduating from Drew Theological lectual experience\"<br />\n• • •<br />\nSeminary in 1905, Dr. Hough entered<br />\nAs long as we're on research, you'll be interested in this bit from the<br />\nthe ministry. During the period<br />\n1902-12, he Was minister of the Mt. University of Oklahoma's men's counselor: \"The popular opinion is that<br />\nVernon Place Church in Baltimore. the university is society mad. But the fact is the -boys who have -thre<br />\n,<br />\nIn 1919 he was elected. President of four dates a week are•isolated cases.\"<br />\nSee! This kind of research really does seem to be Wanted.<br />\nNorthwestern University, but left<br />\n<br />\nV.<br />\nDr. Frank Porter Graham,<br />\nPresident of the University of<br />\nNorth Carolina, will give the sixth<br />\nUniversity Supper Club lecture<br />\nnext Tuesday evening, March 8.<br />\nA specialist in history and economics, Dr. Graham will talk on<br />\nsome phase of the social philosophy of today. Dr. Graham is<br />\nChairman of the National Advisory Council on Social Security<br />\nand Vice Chairman of the NaAdvisory<br />\nConsumer's<br />\ntional<br />\nBoard:<br />\nThe lecture will be given in the<br />\nUniversity Baptist Church at 8:15<br />\np. m. It will be preceded by a private dinner of the members of<br />\nthe Supper Club.<br />\n<br />\nThe<br />\n<br />\nOFFICER'S CLUB<br />\nPresents The<br />\n<br />\n1<br />\n<br />\nMILITARY BALL<br />\nFeaturing<br />\n<br />\nWaiter Routson's Orchestra<br />\nat<br />\nLEVERING HALL<br />\n<br />\nPatronize Our<br />\nAdvertisers<br />\n<br />\non<br />\nMARCH 26<br />\n<br />\nBILLIARDS<br />\nPing Pong<br />\nManaged by Maryland',<br />\nSiete Champions<br />\nFinest Tables—Reasonable Prices<br />\n<br />\nGreenmount Ave & Slat St.<br />\n<br />\n9 to<br />\n*<br />\n<br />\n$1.50<br />\n<br />\n1<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nHe is generally recognized as a<br />\nleader in education and religious<br />\nmatters, and has written scores of<br />\nbooks in the field.<br />\nThe lectures will close the 1937-38<br />\nseries on religion. The public is in-<br />\n<br />\nzorr 1,e;<br />\n<br />\nALUMNI ASS. AWARDS<br />\n$1000 SCHOLARSHIP<br />\n<br />\nMusical Club<br />\n'I<br />\nNew York Bound<br />\n<br />\nPhillips sat down to the piano and<br />\nsoloed- the Second Hungarian Rhapsody by Franz Lizt. He responded to<br />\ntwo curtain calls, and reappeared<br />\nFifth,Concerto by Chopin.<br />\nto play the‘<br />\nHis performance was recognized as<br />\none of the outstanding of the, eveningc<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nthis position in 1920.<br />\n<br />\n. t46<br />\n.̀ \"'en<br />\nelf<br />\ne<br />\n,<br />\n44,Tr<br />\n1.The speaker indicated the benefident attitude of the late pope, Benedict XV, to the enactment of a<br />\nscheme for the furtherance of international organization and relations,<br />\nprovided that the plan is based on the<br />\ntwo principles of justice and charity.<br />\nThe Johns Hopkins University<br />\nThe complete failure of an attempt at Alumni Association has announced<br />\nsuch a plan, namely the League of the presentation of,<br />\n$1000 dollar<br />\nNations, has been occasioned by the scholarship fund to the University,<br />\nand<br />\ninadvertence<br />\ncomplete ignorance<br />\nproceeds of which will be distributed<br />\nof the statesmen participating in it, at the discretion of President Bowwho refused to consider the economic man. The announcement was made,<br />\nbasis of any lasting political peace.<br />\nat the Alumni Association Dinner at<br />\nConcluding his argument on the re- the Chesapeake Club on February 22.<br />\nsults of poor statesmanship in the<br />\nThe gift is'a result of the memLeague's attempt, Professor Fenwick bership dive recently instituted by<br />\npointed out that the errors of the J. A. Dushane Penniman, president<br />\nLeague members more or less direct- of the Association, and Which resultly caused the rise of totalitarian dic- ed in increase of membership by two<br />\nin<br />\nEuropean hundred. The fund is also indicative<br />\nseveral<br />\ntatorships<br />\ncountries which extort the conces- of the improved financial condition<br />\nsions that might well have been of the association.<br />\ngranted in less tense and more reaPresident's Report<br />\nsonable times without the use of<br />\nThe gift seems to be in answer<br />\n\"armed\" force.<br />\nto a plea set forth by President Bowman in his recently issued 1936-1937<br />\nTesta International Bond<br />\nreport. In his report the president<br />\n—the fact remains,' inescapable on<br />\nstated, \". . . it is highly desirable<br />\non any Catholic or Christian princithat men and women of large means<br />\nple, that public and private moralit<br />\n'edlicatiotf<br />\nrest on the same abik.-Aste obligations<br />\nguarantee of our social welfare,'<br />\nof justice, precluding the use of force<br />\nshould provide additional funds to<br />\non any save the strictest grounds of<br />\nthe extent of forty thousand dollars<br />\ndefense; certainly not on any false<br />\nanrivall or the income on a capital<br />\nplea of a have-and-have-not ,basis.\"<br />\none million dollars. Half this<br />\nThus the speaker formulated his con- sum of<br />\nshould be eXiim..n-ptsat-- cept concerning an international sunr<br />\ndoctorate group, all too small at the<br />\nbond and the method necessary to obpresent time, and the remainder uptain it. He tried to show to the audigraduate students and the best<br />\nence that a plan based on justice and on<br />\nsenior group.\"<br />\ncharity would be the most plausible of the<br />\nAs to whether the gift wquld be<br />\none and one most likely to succeed.<br />\nincreased or continued in future<br />\nHis conclusion was that the world<br />\nyears, the officers of the Associamust face at the present time, under<br />\ntion stated that it depends upon<br />\nextremely difficult but not impossible<br />\nthe financial and numerical capacity<br />\ncircumstances, the economic quesof the Association.<br />\ntions that should have been recognized two decades ago.<br />\n<br />\n(Continued from Page 1, (ol. 4)<br />\nand the quartet was recalled after<br />\nof \"Whistle<br />\ntheir interpretation<br />\nWhile You Work,\" and \"We're Working Our Way Through College.\" A<br />\nblonde in row R said \"the quartet is<br />\n`tops,\" but she had yet to hear Otto<br />\nPhillips. •<br />\n<br />\nJ<br />\n<br />\nhe<br />\nt'<br />\nCr<br />\ngi<br />\nW:<br />\nm.<br />\nme<br />\nho<br />\nof<br />\nfo<br />\nBa<br />\nse<br />\nOb<br />\nSa<br />\nLa<br />\nPr'<br />\n<br />\nJo<br />\nhel<br />\nre.<br />\nr..<br />\nBa<br />\nan<br />\nthe<br />\n<br />\nstatetnent-tel1<br />\nis to tbat<br />\n-ct<br />\nrVhe oPievt‘siog,Vcoc).-tI<br />\n••<br />\n10:10Seki •<br />\no,<br />\nbest oboo,t tof<br />\nthat<br />\ntVe<br />\nsoo-vetkii,of, vvo-ce<br />\nood<br />\nhave f they like<br />\nco.o<br />\nsnlokers, taste<br />\ntl-veysec<br />\nDER.<br />\nMIL<br />\n.<br />\nhave a<br />\nof<br />\n<br />\nstrongest<br />\n<br />\nlot<br />\nare<br />\nChesterfields<br />\nields yourself<br />\nChesterf<br />\n...that rove forSATISFY.<br />\ncan<br />\n-ft Chesterfrelds<br />\nthat<br />\n<br />\nPHOTO DISPLAY HELD<br />\nIN LIBRARY CORRIDOR<br />\n<br />\nme<br />\nse<br />\nex<br />\nthe<br />\nthe<br />\npri<br />\nca<br />\ndi<br />\nha<br />\n<br />\nit<br />\n<br />\n(continued from Page 1, Col. 4)<br />\nThose who have seen the previous<br />\nexhibits of the club noticed that the<br />\nsame persons have been exhibiting<br />\neach time. Eugene Wallms president of the club explained this by<br />\npaying that \"The small number of<br />\nmembers represented in this exhibit<br />\nis due to the fact. that many other<br />\nmembers do not have their own darkroom. and the club rooms were. not<br />\ncompleted' in time for this exhibit.<br />\nTherefore, many meml:Zrs found it<br />\nimpossible to make prints for the exhibit. This obstacle will have been removed when we hold our next exhibit in May.\"<br />\n<br />\nthe<br />\nDr.<br />\nJo<br />\ntor<br />\nfirs<br />\nthe<br />\ntee<br />\noer<br />\nthe<br />\nFr.<br />\nrni•<br />\n<br />\ncal<br />\nape<br />\nass,<br />\nthe<br />\nDr.<br />\n<br />\nHaving dallied in the heights of the<br />\nnumber<br />\norchestra<br />\nclassical, , the<br />\n,earth<br />\nbrought the audience back to'<br />\nwith down-beat swing. Aided by Don<br />\nhis<br />\nOlsen<br />\nand<br />\nPete<br />\nquips,<br />\nHamilton's<br />\nclarinet playing with the quartet<br />\nwere so enthusiastically applauded,<br />\nit threatened with upset the whole<br />\nschedule of numbers.<br />\n<br />\nImmediately following the program, Bradford Johnson was introduced as business manager of a financially sucCessful season, by John<br />\nGhinger, president of' the Musical<br />\nClub. The sponsor, Miss Evelyn Janet<br />\nRoop, and the guest of honor, Miss<br />\npresented<br />\nwere<br />\nFickner<br />\nHelen<br />\nflowers.<br />\nWhen the final curtain dropped.<br />\nOsmar Steinwald again directed<br />\nthe Glee club harmony as they work. couples drifted across the hall to be<br />\ned up a brilliant final with a rousing entertained at a dance by Billy Isaac<br />\nand his Command6rs in the ballroom.<br />\n.<br />\nJ. H. U. medely.<br />\n<br />\nan<br />\ntio<br />\nco<br />\nwe<br />\nkn<br />\noe<br />\nad,<br />\nwi<br />\n<br />\n..youllfind MORE PLEASURE<br />\nin Chesterfieldi milder&tier taste<br />\nCopyrigOt 1938. LGGirr<br />\n<br />\nMYR].1 up,<br />\n<br />\nt<br />\n<br />\nRo<br />\nJoh<br />\nFri,<br />\nGo<br />\nyer<br />\nGre<br />\n<br />\n\f", "format": "basic_html", "processed": "Nrun-krtirr<br /><br />\nVOTE IN THE<br />\nPOLL!<br /><br />\nSEE JAYS<br />\nFINISH SEASON<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br /><br />\nVOL. XLII, No. 24<br /><br />\nPRICE 5 CENTS<br /><br />\nJune Week Committeemen Announced<br />\n•<br /><br />\nHOPKINS QUINTET Pon 0n Y. C. L. Issue Op e n CRIST, CHAIRMAN,<br />\n_piniop on League Status,<br />\nMEETS JOHNNIES I CNZL RASIN I Q<br />\nEDITORIAL l_PICIS SENIORS;<br />\nCommunist Speaker Asked<br />\nJUNIOR LACKING<br />\nIN FINAL CLASH<br /><br />\nThe Young Communist League,<br />\nlike the poor, we always have with us.<br />\n_ _<br />\nTo this writer It has been the subject<br />\nRepresentative Consensus Of Student Opinion Desired; Poll of lengthy discussion during<br />\nwhich, Sixteen-Man Group Named;<br />\nJays Seek Revenge After<br />\nTo Be Open Until Monday Afternoon<br />\nit seems to us that some of the fundsCrist Explains Large<br />\nOne-Point Defeat Of<br />\nmental principles of a liberal universon<br />\nwhy<br />\nit<br />\nwas<br />\nrefusing<br />\nopens<br />\nunwhich<br />\ntoday<br />\nIn<br />\na<br />\n\"legitithe<br />\npoll<br />\nsity's<br />\nbeing have been' called into<br />\nNumber<br />\nLast Month<br />\nder NEWS-LETTER sponsorship, two mate campus organization\" the right question.<br />\nquestions on the Young Communist to sponsor an assembly.<br />\nWe need not recite the history of COMMITTEE WANTS<br />\nGAME AT ANNAPOLIS<br />\nLeague Assembly issue will be put<br />\nthe Y. C. L. controversy at too great<br />\nSTUDENT REACTION<br />\nIn answer to the Young Communbefore the campus. The poll is an<br />\nTOMORROW NIIGHT<br />\nlength. Suffice it to say that,the issue<br />\nattempt to determine student opin- ist League, both majority and minor- has been in the air Since; January,<br />\nMember From Junior Class<br />\nion on a point of conflict which split ity submitted reports. The five-man when the Student Council made pubBoth Teams Confident After<br />\nTo Be Named<br />\nthe Student Council five to four in a majority cited the secrecy and the lic its reasons for refusing the league<br />\nVictories In Recent<br />\nvote in January. The poll will be political bent of the organzation as an assembly. Last week the discusLater<br />\nopen until Monday afternoon; ballots a basis for its opinion; the four-man sion flared up anew when it was openSkirmishes<br />\nAs soon as it appeared that the<br />\nhave been distributed with this issue minority based its opinion on the ly charged that the University adSecond Cotillion was a financial sucfact that the Young Communist<br />\nof the NEWS-LETTER.<br />\nThe Frank Merriwells of Annapministration' had prevented the Y. C.<br />\nDo you object allowing the Young League was a campus organization L. \"from holding an open meeting cess, Frank Crist, '38, Chairman of<br />\nolis will play host to the Hopkins<br />\nthe June Week Committee, decided to<br />\nCommunist League to sponsor open and had as much right to have an on the campus.<br />\nhoopst,ers tomorrow night, when the<br />\ngo ahead with plans for the year-end<br />\nmeetings *on the campus? and Do assembly as organizations like Tau<br />\n(Continued on Page 2, Col. 1)<br />\nJays invade the state capitol with<br />\nHe announced the meleefestivities.<br />\nKappa,<br />\nand<br />\nOmicron<br />\nPi,<br />\nDelta<br />\nBeta<br />\nyou object to having a Communist<br />\nlion of the following fellow-classmen<br />\nsweet thoughts of revenge prominent<br />\nspeaker at a Hopkins assembly not the American Student Union.<br />\nCaptain of the Hopkins basketers<br />\nto form his committee: Hugh JohnIn their minds. Last month's enunder the sponsorship of the Young<br />\nThe Young Communist League,<br />\nston, Ned Obrecht, Billy Wagner,Harcounter with the St. John's five cer- who will meet the Bt. John's powerful Communist League! are the two continuing the discussion in another<br />\nIan Graham, John Royster, Alvin<br />\ntainly has left quite an imprint on quint ir their last encounter of the questions on which the poll will be letter, published in last Friday's<br />\nSavage, Charles Stegmaier, Royce<br />\nthe Hopkins five, and a correction of season tomorrow night:<br />\nconducted. In a letter to the NEWS- News-LETTER, charged the adminis..\"-rthur<br />\npoint, lastywrinetrA's__:,_-__‘_,,<br />\n...uriary 21, Wfilkei%-chles- tration of the Hopkins with \"violaman, Edward Bauernsehmidt, Walt<br />\nvictory of last month will turn what<br />\nsinger speaking for the Young Com- tions of civil liberties on the camWindsor, Archy Bowersox, Will<br />\nis not more than just a passable seamunist League, charged the Council pus,\" and specifically with the with,<br />\nPrice, _Carl Basin, and Cy Romanofson into a successful one.<br />\nwith \"dilatory\" action on the organ- drawal of the use of Levering Hall<br />\nsky.<br />\nization's<br />\nrequest for an assembly, and for a Young Communist League \"Relation Of A. S. U. To<br />\nAs usual, anything may happen in<br />\nThe Junior class member will be<br />\ndemanded that the Council show rea- meeting.<br />\na St. John's encounter. Rivalry has no<br />\nCampus\" Is Lash's<br />\nappointed latter by Harry Hopkins,<br />\nlimits and with practically no holds<br />\n'39, president, upon the approval of<br />\nTopic<br />\nbarred the Jays will be out after<br />\nJudge Mehling, president of the CoJohnnie's scalps. How easily those<br />\nSherwood Room In Levering tillion Board; William Kempton,<br />\nscalps will be gottefn is - hard to tell. Glen Gray And Company<br />\nStudent Council head; John Royster,<br />\nIt seems that the Annapolis five have<br />\nHall Will Be Scene<br />\nacting Student Activities Committee<br />\nSend Cats, Ickies, Jitterimproved their brand of play in represident; and Crist. At present<br />\nOf Talk<br />\ncent frays. The strong Washington<br />\nbugs Into Ecstacy<br />\nthese seventeen Seniors and their<br />\nCollege quint fell before the onSix Offices Change Hands Songsters Entrain For Anofficers,<br />\nas ex-officio members, will<br />\nJoseph P. Lash, National Secreslaught of the Annapolis five by a<br />\nBert Hecht Stars As Winner<br />\nnual Trip Today; Home<br />\nIn Annual<br />\ntary of the American Student Union, go ahead with plans.<br />\nlarge margin. And thus, the Johnnies<br />\nChrist Comments On Plans<br />\nOf Limerick Contest;<br />\nwill be In trim for the Jays, against<br />\nhas been obtained as speaker at a<br />\nConcert Well Received<br />\nElections<br />\nChrist, when releasing the commitwhom they always show their better<br />\npublic meeting at the' Hopkins on tee list, added his comments<br />\nAttendance Large<br />\non the<br />\nside. This is the final game of the Jay<br />\nby K. F. MAXCY,JR.<br />\nHarold Ricards, '39, was elected<br />\nThursday, March 10, by the Hopkins coming event. \"This committee<br />\nseason.<br />\nby J. C. HANDELSMAN<br />\nFollowing up their triumph at the Branch<br />\npresident of the campus branch of<br />\nof the A. S. U., it was an- seems unwieldy, I know; but I believe<br />\nIf the Black and Blue basketeers<br />\nThe Big Apple is dead!<br />\nthe Y.M.C.A. at the annual elections Home Concert last Friday, the Musi- nounced<br />\nWednesday. He will be heard that the more men working the more<br />\ncan show the form they displayed<br />\nIt was 3:30 in the morning, March held on Tuesday, March 1. The other cal Club boards the train today to fill<br />\ntickets will be sold.<br />\nat 11:30 in the Sherwood Room of<br />\nagainst Wilson Teachers this week,<br />\nWants Student Reaction<br />\n2. We were in the Alcazar, tired, successful candidates were: Jeffer- engagements in New York and<br />\nLevering Hall on \"The Relation of<br />\nthey will be much closer to victory.<br />\n\"I would like to know how studhappy, but perplexed. Glenn Gray son Hamilton, '40, and Laurie Dick- Atlantic City. Their performance<br />\n,The last ten minutes saw the Jays<br />\nthe A. S. U. to the Campus.\"<br />\nents feel about the time arrangement<br />\nnight at Mantic City will<br />\ntally twenty-four markers to their had escaped the autograph hounds. son, '40, vice-president, George El- Saturday<br />\n\"Mr. Lash, who is one of the most of the Week. In the past all the<br />\nbroadcast.<br />\nopponents' six. The game showed the Kenny Sargent had finally eluded liot, '40, secretary, Charles Flagle,'40, be<br />\nparties have been held from Monday<br />\nTonight in the Warwick hotel the prominent student leaders in the<br />\nchange in the Blue attack. Few long the last fair damsel who wanted<br />\nthrough Saturday of the week preassistant secretary, and John Henry sixty songsters will serenade the<br />\ncountry, will discuss in his talk some<br />\nshots with a fast breaking and pass- \"just one more chorus of \"For You'\".<br />\nceeding Graduation Day. Some seem<br />\nBlucher,<br />\n'39,<br />\ntreasurer.<br />\nReplacing<br />\nthe<br />\nPee-Wee<br />\nCotillion<br />\nthe<br />\nYork Alumni. Tomorrow they of the most important problems facHunt,<br />\nNew<br />\nBoard,<br />\ning attack to work the ball under the<br />\nto think that it's beginning ought to<br />\nbasket will be the offense the Jays Bob, the campus cop had all gone present officers, Huntley Lloyd, pros- travel on to the Chalfonte-Hatton ing the world today and, will show ,<br />\npostponed until Wednesday so<br />\nhome: There was-law-/:--,- Ieft but us<br />\nhotel in Atlaeityit,\"\"--- whose<br />\nwill employ.<br />\nhip to studeadisec-L___ tt the Senior Ball may wind up<br />\n_3watz<br />\nand `an old colored janitor, having a<br />\nguests will hear the vocaliSts in their Benjamin Root, '38, chairman of the<br />\nSt. John's will make use Of the<br />\nHanawalt, vice-president, C. Hamfestivities<br />\nCommencement<br />\nnight.<br />\nlittle private peckin' party in a corner.<br />\nbroadcast performance at eight over membership committee of the A.S.U.<br />\nsame sort of attack. Their speed has<br />\nPlease\" write me at Box 123 or write<br />\nYet, we couldn't move; we just stood mond Brown, secretary, and Boyd station WGP.<br />\n\"His talk will be a part of a broad the News-IATTER.\"<br />\nalready been witnessed by the HopFrey, treasurer these officers for the<br />\nthere . ..<br />\nWhen the Musical club finally A.S.U. program on the Hopkins cam- \"Subscription for the Week<br />\nkins supporters. The newly-employed<br />\nwill be<br />\nFor five solid hours we had seen Year 1938-39 will take office immedi- straggles home Sunday night they, pus which will attempt to<br />\nshow<br />\nzone defense of the Hornewood hoopley* Seniors and some less amount<br />\nthe -eari,-st?ie'ickies, the jitterbugs, ately and will probably be formally will have completed a season Whose the student body that the<br />\nsters is expected however to offset<br />\nA.S.U. is not yet decided upon for lower classthe alligators shriek and stomp and<br />\nor could be an important force in men. The committeemen bringing in<br />\nthe Annapolis speed considerably.<br />\ninstalled at the meeting of the Supper success is already beyond doubt.<br />\ntear their hair in frenzy while Casa<br />\nBetter playing in past encounters has<br />\nThe Home Concert last Friday in helping to solve the problems which the largest number of ticket sales in<br />\nClub<br />\non Tuesday,.March 8.<br />\nLoma dished out some of the smooththe Maryland Casualty auditorium are faced commonly by all students pledge form before April 30 will be<br />\nbeen sacrificed to develop the curest stuff ever served to Hopkins men<br />\nHarold Ricards, the new president, deserves a long list of superlatives. today.\"<br />\nrent mode of defense of the Jays,<br />\nselected as an executive committee.<br />\n. but no Big Apple.<br />\nholds several other posts in various Perhaps it is enough to note that no<br />\nand the Johnny fray will witness the<br />\nAt the third annual convention of They will be chairman of various<br />\nBut why discuss fruit when there<br />\nperformance<br />\nwithout<br />\nwent<br />\nfull extent of such a defense.<br />\ncampus organizations. He is one of individual<br />\nthe American Student Union held subcommittees arranging features of<br />\nare more important things?<br />\nCarl Rasin will play his final game<br />\nthe junior representatives on the Stu- several curtain calls and an encore, last Christmas at Vassar College, the program. June Week parties will<br />\nSwell Affair<br />\nand that every number was applaud- Mr. Lash<br />\nin a Blue uniform and with him at<br />\nwas a leading figure. His run along the usual !ines.\"<br />\nTo put the whole matter in a nut,. dent Council, assistant managing<br />\ned loud and long.<br />\nThe program of June Week usualthe other guard post will be Joe Mc- shell: —<br />\ntalk on the policy of the A. S. U. was<br />\nAt 10 o'clock last Tuesday editor of the Hullabaloo, and editor<br />\nThe enthusiastic reception accord- considered one of the highlights of ly consists of a Senior Ball, either an<br />\nLain. Dimmy Traggis, also playing eve, the<br />\nfirst swing fans, anxious of the .'Y' Handbook.<br />\nInterfraternity<br />\nBoard diepce or a<br />\ned a solo by Richard Sharretts early that convention, and it has been<br />\nhis last game for Hopkins will give lest the<br />\nleast bit escape, stepped aphis all at one of the forward slots prehensively<br />\nCandidates for \"Y\" offices are nom- in the program struck a key note. He printed since in pamphlet form un- Junior Prom, or both4ibeach party,<br />\nout onto<br />\nfloor. At<br />\ntook two bows on his performance of der the title The Campus: A Fort- a lacrosse game the Senior Banquet,<br />\n,with Norm Melvin as his running 10:03, a<br />\nsoft sigh of appreciat e pas- inated' by a nominating Commission<br />\nand various beer feats. The com\"Invictus\", and at the insistence of ress of Democracy.<br />\n'mate. Lee Moore will again serve as sion was hear from them.<br />\nselected by the \"Y\" Cabinet, which<br />\nmittee held its first meeting yesterthe audience sang \"The Big Brown<br />\nthe pivot:<br />\nThree hours later, over a thousand is the board of control of the organ\"The American Student Union be- day to discuss plans for<br />\nHis<br />\nsecond<br />\nwas<br />\nBear.\"<br />\nreceived<br />\nsong<br />\nincluding<br />\nJohnny Lambros and Bill Ross will cotillioners, ranking with the highlieves,\" he said at Vassar in refer- these affairs.<br />\nbe in there at forward positions for est, and certainly the merriest, crowd ization. The present nominating corn- nearly as heartily as the first.<br />\nence to war, \"and the campus beThose who thought the height of<br />\nThe Annapolis _quint. ,Nelson • Strawn ever -assembled -4 the-Board,- were mis:sion consists of Dr. E. B. ,Matlieves,• that world war can still be<br />\nand Len Delisio will handle the guard dancing, shagging, sugar-footing, thews, Huntley Lloyd, Hammond the program had been reached had a<br />\nprevented. All our efforts are bent<br />\nassignment and Jim Rowe will square and otherwise contorting their bodies Brown, and Boyd Frey. Once the surprise in store. The concert soared<br />\ntoward averting the outbreak of that<br />\noff at center.<br />\nin rhythm with the inimitable Gray. candidates are selected, they are vot- through a performance of Gebelein's holacaust which spells the end of<br />\nHawaiian Troupe and his Banjo club<br />\nCasa Loma Cocktail<br />\ned on by all active members who with their usual top-flight entertain- human civilization. We will not deThe Casa Loma musical cocktails<br />\nThe University of Virginia debatspair of peace. Our convictions, all<br />\nsubstribe<br />\nto<br />\nthe<br />\npurposes<br />\nof the Y.M. ment.<br />\nwent to the head of more than one.<br />\nour actions are motivated by the ing team returned a visit of the HopUnder the direction of Osmar<br />\nConsider: Hot take-offs in clarinet, C.A. and who give of their time,<br />\nsincere and passionate aspiration to kins Council yesterday and debated<br />\ntrumpet, trombone, and drum, plus a tri;ley, and services to the organiza- Steinwald, the Glee club blended defend the peace we have and to help the subject: \"Resolved that the Na- -voices in the spirited sea chanteys,<br />\nfew Sargent vocals, for body; couple<br />\nbring peace to the peoples that have tional Labor Relations Board be emThe Johns Hopkins Playshop under<br />\n(Continued on Page 4, (2ol. 1)<br />\nand stir well with plenty of Glen<br />\nben plunged . into war by Fascist powered to enforce compulsory arbithe direction of Dr. N. Bryhion<br />\nGray personality; a musical versatiltration of industrial disputes.\" Franaggression.\"<br />\n'<br />\nFagin, associate in English, is proity which few outfits can match; for<br />\nAnnual Gymboree Set<br />\ncis Brodbine and William Zeulser upducing this week The Dance of Death,<br />\n\"We stated last year in the case<br />\nicy refreshments a sprig (or shall we<br />\nheld the affirmative for the Hopkins,<br />\nFor Next Wednesday<br />\na play by the Swedish dramatist<br />\nof Spain and we repeat it in the case<br />\nsay a log?) of Pee-Wee Hunt, to<br />\nwhile John Herald and Jeffrey Bevins<br />\nJohann August Strindberg. The play,<br />\nof China: retreat before aggression<br />\ngarnish the glass; stir well . . . the<br />\nannual<br />\nsecond<br />\nexhibit<br />\nThe<br />\nof<br />\nthe<br />\npresented<br />\nthe negative case for the<br />\nThe annual )Gymboree will be<br />\nwhich started last Tuesday night at<br />\ndoes not enthrone goodwill in the<br />\nCotillion. And few indeed were the<br />\nUniversity of Virginia.<br />\nheld Wednesday night, March 9 John's Hopkins University Photo- world, does not insure<br />\nthe Playshop, will be given far five<br />\npeace,<br />\ndoes<br />\ntee-totalers when it came to this<br />\ngraphic<br />\nsociety has been on view for<br />\nBrodbine and Zeulser pointed to<br />\nat the Hopkins Gym. Admission<br />\nsuccessive nights.<br />\nnot pave the way for justice. Only the<br />\ncocktail.<br />\nthe past week in the library window<br />\nbloodshed anti ill feeling as resultantwill be fr'ee, and all students and<br />\ncreation of an international anti' The Dance of Death, one of the<br />\nThings we'll never forget: Bert<br />\nof<br />\nGilman<br />\nThe<br />\nExhibit<br />\narHall.<br />\nwas<br />\nants<br />\nfrom disputes not arbitrated friends and parents of students<br />\nFascist front, in which the leadership<br />\nmasterpieces of the great Scandinav- Hecht winning the $10, limerick<br />\nranged in time for the commemoraciting especially the \"Massacre\" at<br />\nmay attend. The Gymboree will<br />\nof<br />\nStates<br />\nthe<br />\nUnited<br />\nIs<br />\nessential,<br />\nian writer, is a realistic tragedy of prize, and the presentation by Brian<br />\ncan<br />\ntion day activities at Homewood. It<br />\nChicago last lay. They defended<br />\nfeature a kaleidoscope of sports<br />\nmarried life. Strindberg is noted for Murphy. . . . The Grand March, as<br />\nwas praised for its clear cut and well assure these ends.\"<br />\nAustralia's compulsory system as<br />\nevents, which will be climaxed<br />\nhis stark, almost gruesome portryal led by Judge and Bud Mehling . . .<br />\nordered<br />\nappearance<br />\nwell<br />\nas<br />\nfor<br />\nas<br />\nthe<br />\nMr.<br />\nLash,<br />\nwho<br />\nbloodless, despite the Virginia's conwas<br />\nin<br />\nSpain<br />\nduring<br />\nby a basketball game between the<br />\nof life, and The Dance of Death is Kenny Sargent, singing \"For You\"<br />\nfine quality of many of the prints part of last year, is co-author with tention that it was wasteful in many<br />\ninter-fraternity and Inter-class<br />\nconsidered to be an excellent example<br />\n. . That good-night medly . . . all<br />\nshown.<br />\nJanYes Wechsler of the book, War: hours of labor. The guests attacked<br />\nchampions.<br />\nof this realism.<br />\nthe pretty girls,<br />\n(Continued on Page 4, Col. 2)<br />\nOur Heritage.<br />\nthe N. L. R. B. a-s biased.<br /><br />\n\"816 APPLE\" DIES;<br />\nCOTILLION IS HUGH,<br />\nYOWLING SUCCESS<br /><br />\nNATIONAL OFFI:CER<br />\nOF A. S. U. TO TALK<br />\nAT HOPKINS THURSDAY<br /><br />\nRICARDS ELECTED MUSICAL CLUB<br />\nNEW Y.M.C.A. HEAD NEW YORK BOUND<br /><br />\nDEBATING COUNCIL ARGUES<br />\nLABOR ARBITRATION TOPIC<br /><br />\nPLAYSHOP PRESENTING<br />\n'THE DANCE OF DEATH'<br /><br />\nPhoto Display Held<br />\nIn Library Corridor<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br />\n2<br /><br />\nTbe jobns lOophins<br /><br />\ne<br /><br />\nletter<br /><br />\nsound policy.<br />\nWe think Crist is Showing the proper spirit in calling<br />\nfor suggestions for the time of the parties. If the committe.e carries on in this spirit it will be something<br />\nmore than a hospital for decayed politicians.<br /><br />\npotpourri<br />\nBy BUDDY MACHT<br /><br />\nHaven<br /><br />\nLETTERS TO<br />\nThE EDITOR<br /><br />\nengineering and that means - \"to<br />\nIn defense of Buddy Macht.\"<br />\nNEW YORK-4As we look down on<br />\nThe deiril, is never so danwork\".<br />\nTo the Editor of the<br />\nI realize that this letter is a little<br />\ngerous as when he puts on a Broadway today from our twenty- NEws-LETTER:<br />\nFounded 1897<br />\nusually<br />\nand that nothing can be done.<br />\nthe<br />\nroom<br />\nlate<br />\nhotel<br />\nstory<br />\nhalo. Some such process lei second<br />\nSir,<br />\nDear<br />\n$2.00<br />\nYet, I should like to address my<br />\nSulmcription per year<br />\nCongress nerve-wracking roar of Times Square<br />\nin<br />\nplace<br />\n.50<br />\n.<br />\n2<br />\n.$<br />\ntaking<br />\nthe<br />\nof<br />\nsideii<br />\nboth<br />\nMai<br />\nAfter reading<br />\nBy<br />\nclosing remarks to the future memright now where the May doesn't affect us; in fact it seems Hutchinson-Macht feud, I came to bers of the Cotillion Board—may<br />\nStudent Activities Council.<br />\nRemit subscription fees to Treuurer,University.<br />\nBill, \"to take the profits out) quite soothing. But then, of course, the conclusion Mr. Macht deserVes they be more considerate than the<br />\nRemsen Hall. Postoffice, Jana Hopkins<br />\n,<br />\nthe_ postoffice<br />\npresent ones — with the hope that<br />\nof war\", is being considered it's only a matter of relativity. After the orchid.<br />\nEntered as second class matter December 3. 1909. at -3,<br />\n1879,<br />\nNovember<br />\nCongreso,<br />\nof<br />\nAct<br />\nthe<br />\nunder<br />\nIdd.,<br />\nin Baltimore<br />\nmy effort will not be in vain. Thereour recent part in the Macht vs.<br />\nin committee.<br />\ntheme<br />\nthat<br />\nhim<br />\nwith<br />\neataininscan<br />\nI<br />\nagree<br />\nduring<br />\nexcept<br />\nJune,<br />\nto<br />\nOctober<br />\nfore, to them I say, \"Consider what<br />\nPublished aemi-vreeldy from<br />\nlike<br />\nfeel<br />\nwe<br />\nbattle<br />\nTeachers<br />\nFoetal<br />\nShepthe<br />\nHopkins<br />\nas<br />\njohns<br />\nShe<br />\nof<br />\nfamiliar<br />\nnon and college holiday periods by undergraduates<br />\nThe May Bill is probably more<br />\n\"armies\" who loiter in the soda-shop an engineer expressing the thoughts<br />\npnivensity.<br />\nwho's been transported from<br />\nof the Johns<br />\npard-Hill Bill which died ingloriously in committee someone<br />\nin the early morning hours, come of many of the students<br />\n1938<br />\nMEMBER<br />\n937<br />\nrate<br />\nany<br />\nAt<br />\nto<br />\nCatonsville.<br />\nMadrid<br />\nHopkins University—has to say<br />\nI xreacoLtilltits Nowsesrait ASSOCIATION<br />\nlast spring. This new version, like its predecesor,<br />\nthere with no, intentions of improvwould<br />\nscene<br />\nof<br />\na<br />\nchange<br />\nthought<br />\nCotillion.\"<br />\nwe<br />\nHopkins<br />\nabout a<br />\nEDITORIAL STAFF<br />\ncommonly referred to as the Industrial Mobilizatio<br />\nIf their intenSincerely,<br />\nmentally and ing their -homework.<br />\nJ. Murray RemptonJr.<br />\nCirEditor Plan. It proposes \"to equalize the burden of warfare\" be more stimulating<br />\n.<br />\nWetherell Barron,<br />\nM. N.<br />\ntions were good, they would find<br />\nEditors<br />\nManaging<br />\nJr.<br />\nMassy,<br />\nat<br />\nKenneth<br />\nBaltimore<br />\nthan<br />\nHandelsman,<br />\nsafer physically<br />\nJ. C.<br />\nbe<br />\ncan<br />\nprogram<br />\na<br />\nsuch<br />\nEditors<br />\nhow<br />\n4ifamaging<br />\n:Arsistam<br />\nindicating<br />\nQuitt<br />\nquite<br />\nLeonard<br />\nwithout<br />\nThomas MrElhiney,<br />\nmuch better .atmosphere in our li- Bet. I am not an engineer.<br />\nFeature Editor<br />\nthe present moment so here we _are.<br />\nSeymour Sxlcs.<br />\nother<br />\non<br />\nhowever,<br />\nprecise,<br />\nEditor<br />\nmore<br />\nSports<br />\nis<br />\n'It<br />\nd.<br />\naccomplishe<br />\nMilton Alperstein<br />\nbrary or in the closet assigned t<br />\nAssistant Sports Editor<br />\nCharles Digo<br />\nFor the benefit of those of you who<br />\nBarltonoe Editor partifulars.<br />\nthem in Levering Hall, instea<br />\nMal Boshnack,<br />\nREPORTERS<br />\nsay<br />\nwe<br />\nmight<br />\nThe Church<br />\nworried<br />\nbeen<br />\nhave<br />\nmay<br />\ncontrol<br />\nMel Tsymor, 40; Morris Wessel, '39; Daniel Stone. '39,<br />\nwandering about in search of\"<br />\nFor example, the President is given entire<br />\nTo the Editor of the<br />\nvery<br />\n7.eane Baum. '38; Carl Rosin, '38: Lester Rosenthal, '311:<br />\nand civil life. He-can set prices, cen- that Manhattan has changed<br />\neconomic<br />\nour<br />\n1,eonard Rubinger. '35; Seymour Rubin, '40; Irving Mil.<br />\nbe Casanovas.\"<br />\nover<br />\nNEWS-LETTER:<br />\nberg. '39; Herbert Rleinfeld. '41; John Highans, '411:<br />\nlittle since Christmas. There have<br />\nAn open letter to a history proSheldon Fuchs, '35.<br />\nour<br />\nsor the press, dictate to trade unions, and deal sumon<br />\nr<br />\nThis is Hutch's last y<br />\nis<br />\nsubway<br />\nthe<br />\n,<br />\nno<br />\nearthquakes<br />\nBUSINESS STAFF<br />\nfor conduct less than patriotic. You been<br />\nshe is not fessor:<br />\nshe hopes, and<br />\nBusiness Mower marily with citizens<br />\ncampus,<br />\nMelville Locker ...<br />\npeoof<br />\nthe<br />\nand<br />\nmost<br />\nstill a nickel,<br />\nReferring to your history lecture<br />\ncan call that \"Industrial Mobilization\" if you please,.<br />\ne of our<br />\nin adopting<br />\n1 938<br />\nMEMBER<br />\n1 937<br />\nof Thursday the seventeenth I feel<br />\nple still read The Daily News which successful<br />\nASSOCIATED COLLEGIATE Pars, Itistribotors, COLLEGIATE Drum<br />\nbut it sounds like Rome and Jersey Cif), to us.<br />\n\" *holars, she that I must say something about<br />\n\"adolescent<br />\nso-called<br />\nstill features headlines like \"PentRetro:tided for National Advertirina by<br />\nRep. Samuel P. Pettiogill 'of Indiana is one of the house Love Nest Discovered On Park will have to resort to a post-gradu- the unjust and untrue comments<br />\nNAVONAT ADVIIIISINC SERVICE. INC.<br />\n429 Mnirliqon A Venue ; New York City. New York<br />\nwhich you made concerning the docate course.<br />\nmost outspoken of anti-New Deal Democrats. He can Ave.\"<br />\ntrines of the religion which you seem<br />\nAll in fun,<br />\nFRIDAY, MARCH 4, 1938<br />\nhardly be considered as a proponent of anything other<br />\nWe did -glean quite a bit, though,<br />\nto hold in the utmost contempt. Had<br />\nPaul Huette<br />\nthan the Americano Way:<br />\nyou denounced Christianity in the<br />\nand to conserve space we'll have to<br />\nIt appears to us that there<br />\nhe had to say about the May Bill:<br />\nis<br />\nHere 'what<br />\nstrongest manner, you could not have<br />\nPut it down in rather jumbled form, Ditto<br />\nhad best be an end to pur'lowered it more in the estimation of<br />\n\"I will gladly support a bill to tax war profits into Sorry.<br />\nTo the Editor of the NEWS-LETTER<br />\nposeless talk about the<br />\nthe listeners than you did by your<br />\nexethe<br />\ngive<br />\nwill<br />\nwhich<br />\none<br />\nnot<br />\nbut<br />\ntreasury,<br />\nSir:<br />\nthe public<br />\nsubtle and stinging sarcasm. Instead<br />\nwhole business. And for that<br />\nPlay<br />\nThe<br />\nwhich<br />\n•<br />\nfrom<br />\nwar,<br />\nof<br />\ntime<br />\nthat<br />\nnote<br />\nin<br />\nto<br />\npowers'<br />\nIt is very encouraging<br />\ncutive dictatorial<br />\nof presenting your subject in a fair<br />\nreason, we have decided to'<br />\nSaw Father Maktchy's Miracle—<br />\nwe might not emerge when the business of war is over.\" simple play, very well _acted and you have a man On your staff fho is_and unbiased maner, you ,ssmed to<br />\nsubmit the issue to the deciittrct one<br />\na<br />\nis<br />\n-Z.-(urea every vfitnistr<br />\natIsert the riertif<br />\nThe idea of taking a war out of Wall Street<br />\n,<br />\n-Wet,o02 it. that<br />\ntrilreert<br />\nsir of the student body it-rit' it will close this week though. Too his fellow males. I'm referring, of purpose, to show the Church in the<br />\npoint in usu<br />\nno<br />\ncertainly<br />\nis<br />\nthere<br />\nBut,<br />\none.<br />\nsound<br />\nvery worst possible light. Not only<br />\nseit We ho to get the answer the poll which begins<br />\nas a screen for setting up a military dictatorship. It was simple for Broadway . . . Frederick course, to. Mr. Macht whose - subtle did your remarks lack the clarity<br />\ntoday.<br />\nnew play Once is Enough attack on our,\"college widows\" has<br />\nBerlin<br />\nof<br />\nLousdale's<br />\nhero<br />\npresent<br />\nthe<br />\nthat<br />\nuster<br />\nand accuracy that usually comes from<br />\nas a monopoly-b<br />\n_is as we expected, affords a fairly paused many of the College for<br />\n. Of course, the News-Lem:it has its own ideas about<br />\nthorough understanding but they also<br />\ninto power,<br />\nrocked<br />\nthe<br />\nthat<br />\nproving<br />\ncona<br />\nevening<br />\npleasant<br />\nexpressed<br />\nthe question. We have many times<br />\n'Teachers \"students\" no end of cha- lacked the respect and decency beof<br />\nfull<br />\nis<br />\nstill<br />\nclass<br />\nruling<br />\nEnglish<br />\nrather<br />\njust<br />\nEleven new men have<br />\ncoming a professor in a university.<br />\nviction that the Y. C. L. has been the victim of<br />\ndull men and catty women . . . At grin.<br />\nbeen elected to the Barn- the premiere of Al Woods' new Cen- I too have -felt the pangs of dis- I will give an example: Your dis,shabby treatment.<br />\ncussion of the sacrament of penance<br />\nstormers Club, the Univer- sored the audience nearly fell out<br />\nBut, we hope to conduct the poll as fairly as possible.<br />\ngust at the ever increasing number<br />\nScandalsity dramatic society. They of their seats when ten policemen of young females who find it neces- consisted almost entirely of such as<br />\nFor that reason, there will be just as big a display for<br />\ninstances of its abuse,<br />\nous<br />\nyelling \"stop the<br />\naisle<br />\nthe<br />\nions.<br />\ndown<br />\nran<br />\ncongratulat<br />\nour<br />\nfavorable<br />\na<br />\nfor<br />\nhave<br />\nas<br />\ndecision<br />\nwhat we consider an adverse<br />\nof the sary to make an appearance on the the exemption of prostitutes from<br />\nAnd, what is more, if they show!\" It was all part<br />\nby papal decree. (This<br />\none. And, for that reason, we will concern ourselves for<br />\nplay, though, and everybody went -campus at about 8:30 a.m. and in- confession<br />\ndethey<br />\ns,<br />\nwith<br />\nbut<br />\nissue<br />\nconscientiou<br />\nare<br />\nfoundation of truth). No defthe nonce, not with the merits of the<br />\nhome happy. It may go over big if yade the portals of Levering and has no<br />\nwas given. The .<br />\nThey<br />\npenance<br />\nof<br />\ntask.<br />\ninition<br />\nthe munitions makers don't buy Gilman Halls until 4:00 p.m. when<br />\nthe mechanic's ,and, in some measure, with the implica- serve some sympathy, for theirs is a difficult<br />\nfundamentals of this important sacwill be called upon to rebuild an organization, which; ''t up —one of the best anti-war many have their first clizia<br />\ntions'of today's voting.<br />\nrament which are examination of<br />\nto the campus as a rztmas we've seen . . . The general<br />\nand<br />\nThere are two questions on the ballot. Con4etely as it exists today, is hardly an asset<br />\nHopkins is still a man's school. If conscience, contrition, resolution,<br />\nopinion around here of Frances<br />\nunder<br />\nissues<br />\nbasic<br />\nthe<br />\nwhole.<br />\nus<br />\nabsolution were not so much as mento<br />\nSeem<br />\nthey deal with what<br />\nFarmer is that as a blonde she's the girls find it imperative to come<br />\nThese are harsh words, and we realize it. The NEWS- perfect but as an actress—well, she's here to do what they imagine to be tioned.<br />\ndiscussion—(I whether the Young Communist League<br />\nover-aggressive in this just another blonde.<br />\n. However, since you spoke of sacitself has the right to sponsor meetings and assemblies LETTER does not wish to appear<br />\nstudying, then let them crawl into<br />\nraments as the mystical powers of<br />\nbut is merely voicing the opinion of many Hoptheir various cubby holes and stay<br />\non the campus and (2) whether Communists should be matter,<br />\ndecay<br />\nthe Church instead of the channels<br />\nThe Spots<br />\nkins undergraduates who have watched the slow<br />\nthere.<br />\nare<br />\nallowed to speak out here.<br />\nthey<br />\nwhere<br />\nstate,<br />\nof divine grace, one could hardly exof the 'Stormers into their present<br />\nLeon and Eddie's 'still the same<br />\nMacht will keep<br />\nMuch of,the recent controversy has centered about content to wear their keys and present only one offering except for a new series of wise I hope that Mr. he has started. pect you to know anything about<br />\nup the crusade that<br />\nthem. You stated that the theologthe allegedly secret, conspiratorial, -and .mysterious in an entire school year.<br />\ntracks painted on the walls. Over<br />\nexcellent<br />\ngenerally<br />\nis<br />\ncolumn<br />\nHis<br />\nians of the church were continually<br />\nnature of the Y. C. L.'s activities. For instance, the<br />\nAt the outset of this term a tentative program was out- the door of Leon's office is the la- and has many readers among the up- \"squirming\" to conciliate purity<br />\nbut actually ment, \"Through these portals the'<br />\nLong may he rave!<br />\nmajority of the Student Council, in its statement on the lined which included not only two shows,<br />\nbrackets.<br />\nper<br />\nwith marriage and that the Church<br />\nhave our S. A. C. cards to remind most beautiful checks in the world<br />\nYours,<br />\nassembly issue, concerned itself with the character of a state-wide tour. We<br />\nme finally forced to maLtviarriage<br />\nVeloz and<br />\nbounce back.\"<br />\nproject.<br />\nS.<br />\nS.<br />\nthis<br />\nS.<br />\nof<br />\nus<br />\nto<br />\n\"<br />\n2 sac/Ai-tient. If you •`(,zer—tit.'<br />\nthe League rather than to the right of \"extremists<br />\nwho ,become sensations aboutplans<br />\n4ned<br />\nhailie4:3<br />\nrs<br />\n3arnstorrne<br />\nChrist's teachings at the Sermon on<br />\n1414W-.%'.::.free exprEsit)t.:'<br />\nonce every six months, are the cause<br />\nsecond show. Monetary disability is the favqrite ex- of bated breath at the Persian Room To the Editor, ,<br />\nthe Mount you will find that it was<br />\norder<br />\nin<br />\nfashion<br />\nthis<br />\nin<br />\nquestions<br />\nWe phrased our<br />\ncuse. But, to our way of thinking, the group would have of The plaza . . . Ivan Frank, whose While reading over the \"Letter to he who elevated matrimony to the<br />\ndistincsame<br />\nallowthat<br />\nmake<br />\nits<br />\nof<br />\nwho<br />\nNEWS-to give full play to those<br />\nthe Editor\" column in the<br />\ndignity of a sacrament, a position<br />\ndone better to relegated certain portions<br />\nplace in Baltimore is usually half<br />\nLETTER of Friday February 18, 1938 which it continued to hold. Purity is<br />\nance to each of the two productions.<br />\ntion.<br />\nempty, is paPking 'em in at his<br />\nI<br />\nMtMions:<br />\naboutthink<br />\nto<br />\n-LETTER<br />\nbegan<br />\nonly because it is an abI<br />\nNEWS<br />\nThe ballots need not be signed. The<br />\n---FranklyTwe find hard to- believe that the plan was Austrian beer stube on Seventh Ave. saw a letter from an engineer to the a virtue<br />\n^<br />\na fleshly desire and<br />\never seriously considered in the first place. The reasons They sing smutty songs in German Judge, below it a reply, and I won- stinence from<br />\nwelcomes comment written on the ballots.<br />\nthus exalts the spirit. It is not one<br />\nschedule have a more so that the girls won't be embaroften<br />\nUnless there is a representative vote, the poll can given by the club for changing its<br />\nhad<br />\nI<br />\nis<br />\ntruth<br />\ndered — the<br />\nof the cardinal virtues of the Church.<br />\nhollow ring.<br />\nrassed, then they translate them inwondered—just What is' a Cotillion? The sacraments of the Medieval<br />\nprove nothing. We hope, therefore, that those who are than faintly<br />\nsuch a grandiose pro- to English so the boys can under- Whom is it for? I had always had an<br />\nthat<br />\n,<br />\n.<br />\nbusimoreover<br />\ntheir<br />\nit<br />\nthink,<br />\nmake<br />\ndon't<br />\nwill<br />\nWe<br />\ncontroversy<br />\nthe<br />\nof<br />\nsick<br />\nbit<br />\nChurch (the Catholic Church of toa<br />\nfor anyway. The Barnstormers are not stand them.<br />\nidea that Hopkins Cotillion is a dance day) have remained fundamentally<br />\nness to vote just as those to whom it is still a live issue. ject was called Their purpose should'be to provide the<br />\nHopJohns<br />\nthe<br />\nof<br />\na social group.<br />\nfor the students<br />\nthe same in nature and unlike outTheoretically, of course, the poll doesn't mean much. campus with the best available dramatic offerings. The The Party<br />\nkins University. (It's strange how ward church customs, have not gone<br />\nBut, if the decision 'runs against the Y. C. L., it will so-called \"glamour\" of Barnstormer night should be The current party story now go- one can get such queer ideas). In his through a period of evolution.<br />\ning the rounds here is one about letter, the Judge made the enlightenserve the purpose of lending weight to the status quo. sec'ondary.<br />\nThe main point is that in continElsa Maxwell (they're always about<br />\nthat \"we could have<br />\nAnd, if the result is favorable, perhaps this and future<br />\nually emphasizing and exaggerating<br />\nThe club would do well, we think, tq revise its ideas. Elsa Maxwell). This time she wanted ing statement<br />\ndepended<br />\nand<br />\nband,<br />\nsmaller<br />\na<br />\ngotten<br />\nproStudent Councils at least may lend an ear.<br />\nthe immorality ,of Churchmen you<br />\nIt should acquaint itself with the activities of<br />\nblocks of ice in a conupon the enthusiasm of the student<br />\neye to its to lay down<br />\nIn the opinion of a majority of the Council, re- gressive university dramatic societies with an the pre- tinuous path from the Waldorf to body alone for support.\" Note the failed to mention the universally recseriously<br />\nconsider<br />\nshould<br />\nthat there was no degown improvement. It<br />\nRadio City, a. distance of five blocks, word alone; it's quite interesting. ognized fact<br />\nleased on January 24, we find this sentence.<br />\nsentation of at least three qr four smaller productions so that her guests could ice skate Well as one would philosophically radation in the teachings of the<br />\n\"To you of the undergradutte body ...., who may<br />\nchurch regarding faith and morals.<br />\nin addition to the main show. Such modest offerings<br />\nthere. In fact she had already say, \"We live and we learn.\"<br />\nbe interested in and who have evey right to know the may not provide either the color or the revenue of over<br />\nIn other words, you confuse the morengaged an ice company when the<br />\ngovernstudent<br />\nclub<br />\nelected<br />\nthe<br />\nof<br />\nthe<br />\nyour<br />\nbring<br />\nparagraph<br />\nof<br />\nwould<br />\nsecond<br />\nIn the<br />\nmotives and actions<br />\n\"Barnstomer night\". But, they<br />\nals of the people in the Church with<br />\ncops found out about it and objected<br />\nJudge's letter he suggested to our the morals of the Church itself. Accloser to its real purpose.<br />\nmeat, the Student Council makes this statement.\"<br />\nvehemently, pointing out that traffact would ceres doubtless sincere engineer, that the<br />\nIt is a very real and sober world of. facts 'Clt the fic on five principal thoroughfar latter stop writing \"icute\" letters, curate and specific in the place of<br />\nIt is in accordance with this sentiment that we open<br />\neleven new 'Stormers must face today. Thcfv lave to would 'be tied up for several hours. and in addition that he take a course tainly be appreciated<br />\nour poll today.<br />\nand<br />\nhazy generalizations and dirty Jokes.<br />\nmake the choice between a Barnstormer Club d a uni- Elsa, however, was very angry<br />\nin English Writing. I would. just like<br />\n—A. F. Commiskey<br />\nThe June Week Committee versit dramatic society. We sincerely hope that they said her party would be a flop.<br />\nfor which they \"I'm sure no one would have to sit , down and write \"fancy anda<br />\npurposes<br />\nreal<br />\nthe<br />\nmind<br />\nin<br />\nbear<br />\nplease<br />\nwill<br />\nto<br />\nenough<br />\nlarge<br />\n'seems<br />\npretty\" letters to the NEWS-LlerrE Anent Baseball<br />\nminded, she remarked.<br />\nto convey their ideas, as do the Ma- To the Editor of the<br />\nevery political clique in the were constituted.<br />\nof business and arts students. NEws-LE.-m.R•<br />\njority<br />\nhappiSenior Class. With<br />\nThe NEWS-LETTER submits The Met<br />\nEd..-- •<br />\nEngineers come to college to study Dear<br />\nan unsolicited apology to<br />\nness and harmony at the<br />\nof<br />\nslice<br />\nbiggest<br />\nIn our opinion the<br />\nsoccer, basketball, and<br />\nweek's<br />\nLacrosse,<br />\nlast<br />\nfor<br />\nFrank Butt<br />\noutset the three months life<br />\nentertainment offered in New York<br />\nhandball all have their own fields to<br />\neditorial entitled, \"Notes on<br />\nit will enjoy may be beneany one night are the Metropoli- In General<br />\non<br />\nplay on. The baseball team; howthe Sophomore RepresentaHeard in Lindy's: \"You're just a<br />\nOpera gala Sunday eve concerts.<br />\nficial to all of us. All auguries point in this direction<br />\ntive.\" The talon dealt with tan program lasts for about three fugitive from a charm bracelet\" . . . ever, is found to exists without a<br />\n—the financial success of last year's June Week, the<br />\na statement by Mr. Butt on The includes acts in costumes from New Yorkers are so tired of double diamond, a cage, or even adequate<br />\nhours,<br />\nThat baseball<br />\nclose tabs kept by the S. A. C. on its_management, and the question of allowing the Young Communist League various operas, solos, duets, etc, by features that someone has suggested practicing facilities.<br />\nhas lasted as long as it has is due to<br />\nthe popularity of the recent Cotillion. All this committee an assembly.<br />\nthe biggest operatic stars, whole acts running them both at the same time.<br />\nthe activities of Coach Owings and a<br />\nwill have to bear in mind is the causes of ,his, and hence<br />\nWe still cannot agree with his point of view. But by the entire company of the Ameri- \"The people in Brooklyn wouldn't few undergraduates who are vitally<br />\nOrchesunjustifi.<br />\nin'<br />\nMet<br />\nweek<br />\nthe<br />\nlast<br />\nby<br />\nhe<br />\nknow the difference anyway,\"<br />\ncan Ballet, music<br />\nour sentiments were expressed<br />\nprofit accordingly.<br />\nin this game.<br />\nthis particu- tra and just about anything else you said . . . Yes, it's still the same. This Interested<br />\nMost important is efficient supervision of the S. A. C. ably personal terms. We can only say that<br />\nof a musi- evening we saw two Columbia boys<br />\nwinning team with the support<br />\nand<br />\nA<br />\ninserted<br />\nway<br />\nhaste<br />\nthe<br />\nin<br />\nin<br />\nfor<br />\nconceived<br />\nwas<br />\nask<br />\ncould<br />\ngown<br />\neditorial<br />\nlar<br />\nand<br />\ntown<br />\n—both bodies should recognize that<br />\ngranted<br />\npainting over the Deanery sign in of the student body will be<br />\ncal feast.<br />\nthrough carelessness.<br />\nwill<br />\nhereabouts like 'name' bands and the greatest profit<br />\nfront of Barnard College. They sub- proper facilTes. This years team<br />\nmissin<br />\nd<br />\ncolumns.<br />\nin<br />\nthese<br />\ndisappointe<br />\nplace<br />\nno<br />\nonly<br />\nhave<br />\nwere<br />\nshould<br />\n....We<br />\nTo<br />\nspirit<br />\na<br />\nSuch<br />\nwin — the reseponsibillty, therefore,<br />\nand enjoyment will come front engaging the best.<br />\nto<br />\nadmit<br />\nashamed<br />\nis<br />\nwho was forced. to stituted a B for the D . . . Oh,Well,<br />\nwhich<br />\nMartinelli<br />\nspirit<br />\nthe<br />\ning<br />\nshould<br />\nNeither<br />\nand<br />\nBack to the wars rests with the student body.<br />\ndo so means that the committee must star, early<br />\nforego his role because of nervous times never change.<br />\nits own Mistakes.<br />\nA. R.<br />\nagain—and we mean that literally.<br />\ndeliver for them. First, however, they ought to consult<br />\nindigestion.<br />\nButt will accept our apology.<br /><br />\nInt<br /><br />\nA Surrender<br />\n-To The<br />\nWarmongers<br /><br />\nThe Y. C. L.<br />\ncontinued<br />\nfrom page 1<br /><br />\nThe Stormers<br />\nFace<br />\nThe Future<br /><br />\nJune Weck<br />\nCommittee<br />\nIs Chosen<br /><br />\nas a matter of<br />\nthe student body as to their choice,<br />\n•<br /><br />\nAn Apology<br /><br />\nWe hope Mr.<br /><br />\nPla<br /><br />\nA.<br />\nnigh<br />\nBae<br />\ntati<br />\nques<br />\n001-11,<br />\nbore<br />\neven<br />\nnam<br />\n.A.<br />\nfenc<br />\na pl<br />\nbask<br />\nSigs<br />\npha<br />\nstall<br /><br />\nterf<br />\ned o<br />\nbe<br />\nnity<br />\nthe<br />\n.poin<br />\nty-n<br />\npio<br />\nof h<br />\nrens<br /><br />\nA<br />\nbore<br />\ntwe•<br />\nall-c<br />\nand<br />\nthe<br />\nday,<br />\nbe<br />\npoin ,<br />\npoin ,<br />\nthe<br />\nthe<br />\ntea<br />\n10 p<br />\nIn<br />\nsoftthat<br />\nstar<br />\nvars<br />\nbarr.<br />\nball.<br />\npetit<br />\n21<br />\nfor<br /><br />\nHOMEWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br /><br />\nGYMBOREE TO OFFER<br />\nVARIED ATTRACTIONS<br />\nInterfrat Tug Of War, Badminton Match Are<br />\nHighlights Of Event<br />\nPlans For Volley-Ball And<br />\nSoft-Ball Competition<br />\nDiscussed At Meeting<br /><br />\nBall Club Practices<br />\nThe 1938 baseball season will<br />\nget officially under way with the<br />\nfirst practice on Saturday, March<br />\n12. Coach Bob Owings, in an effort<br />\nto get his charges in shape for<br />\nthe opening game with Drew University has called an intensive<br />\npractice at the Gilman Hall cage.<br />\nA .squad of 40 rookies and veterans is expected to answer the<br />\n,call.<br />\nMore Candidates Needed<br /><br />\n3<br /><br />\nHopkins Quint Defeats Wilson<br />\nTeachers and Drew University<br /><br />\nJAY FISH TO MEET<br />\nMANHATTAN TONIGHT<br />\nWill Complete Season With<br />\nVeteran New Yorkers<br />\nAt Home<br />\n— —<br />\nHill, Jacobs, Radner, Weiner<br />\nTo Bear Burden Of<br />\nJays Hopes<br /><br />\nTrounce Washington Team Take Madison N. J. Five<br />\nInto Camp 56-30<br />\n- By 59-37 Score TuesAt Homewood<br />\nday Night<br />\nMelvin, Rasin, McLain Lead Second Stringers See Action<br />\nAs Opponents Defense<br />\nTeam In Late Scoring<br />\nVery Ragged<br />\nSpree<br /><br />\nThe Johns Hopkins swimming team<br /><br />\nwill close its 1937-1938 tank season<br />\nThe Johns Hopkins cagemen won<br />\ntonight against Manhattan College<br />\nnight at Levering Hall, with Reuben<br />\n-Ye its second smashing victory so-far<br />\npoints in the last ten minute/CU<br />\nof New York at the City College<br />\nBaer presiding, fraternity' representhis week by crushing the Drew UniHopkins varsity five trounced the<br />\npool. The Jays after winning their<br />\nversity quintet, 56-30. The Blue Jays<br />\ntatives talked over some pertinent<br />\nquintet<br />\nof<br />\nCollege'<br />\nWilson Teachers'<br />\nwere in the lead from the start, and<br />\nfirst two meets struck a losing streak,<br />\nquestions about the interfraternity<br />\nlast<br />\n5937,<br />\nWashington, by a score of<br />\nthe outcome of the game was never<br />\nand hope to end the year with a<br />\ncompetition yet to come. The GymTuesday night at the Homewood gym- In doubt.<br />\nsmashing victory over their New<br />\nboree was also discussed and the<br />\nJays<br />\nScore<br />\ngasily<br />\n,<br />\nnasium.<br />\n. events that will take place were<br />\nYork rivals.<br />\nFrom the beginning it was a mat- COACH WALDO HAMIWEToN<br />\n•<br />\nnamed.<br />\nSecond Half Spree<br />\nMeet Will Be Close<br />\nter of, how many points the team<br />\nThe times Of the Manhattanites are<br />\n•<br />\nAt the Gymboree, there will be<br />\nIn the second half, leading this could score with Melvin, Rasin and<br />\nvery near the average times of the<br />\nfencing, tumbling and wrestling. In<br />\nscoring spurt, were Norm Melvin, McLain leading the way.<br />\nJay mermen, and the Meet -promises<br />\na play-off game to decide fraternity<br />\nCaptain Carl Resin and Joe McLain.<br />\nThe lineups:<br />\nto be a close one, with the Black and<br />\n. basketball champions, the Kappa<br />\nDREW<br />\nThis trio accounted for thirteen field<br />\nBlue favored.<br />\nSigs will oppose the Epsilon Tau AlOF.<br />\nT:<br />\ngame.<br />\nsecond<br />\nhalf<br />\nof<br />\nthe<br />\ngoals<br />\nin<br />\nthe<br />\nSmall Group Competes<br />\npha five. •<br />\nStanert, g<br />\n4 0 8<br />\nThe Blue Jays will again depend<br />\nWith ten minutes to go, the Jay passThe Kappa Sigs have been inCiardi, f<br />\nO 0 0 E. T. A. Wins First Playoff upon their handful of 'stars to carry<br />\nstalled as favorites to win the game.<br />\nwork started to click smoothly, the Haugh, f<br />\n2 3 7<br />\nthe bulk of ,the work. Co-Captains<br />\nGame By Score<br />\nPasternack Outstanding As shooters broke sharply for the bas- Winch, f<br />\nD. U. Favorites<br />\n1 0 2<br />\nHarold Jacobs and Alan 14111 will take<br />\n. The next attraction will be. the in15-10<br />\nket at the right moments, and the Stem, c<br />\nHopkins Avenges Lone<br />\n4 1 9<br />\ncare of the diving, the 220, and the<br />\nterfraternity tug of war. Baer pointO 1 1<br />\nshots kept dropping through the Eskesem, c<br />\nvarious<br />\nrelays..<br />\nDefeat<br />\nSeason's<br />\ned out that only eight man teams will<br />\nBaugby, g<br />\n0 1 1 ' Kappa Sigma, heavy favorites to<br />\nHill has been improving in the midhoop with regularity.<br />\n• be allowed to compete. Any fraterinter-fraternity basket<br />\ncapture<br />\nthe<br />\nBackstrom,<br />\n0<br />\n2<br />\n1<br />\nthe<br />\ndefeat<br />\nof<br />\nAvenging their only<br />\ndle distance and hopes to end up the<br />\nTeam Starts Slow<br />\nnity entering will receive ten points,<br />\n_ ball championship, meets T. A. 0.<br />\nyear with a clean-cut victory. Jacobs<br />\noarrent season, the Jay handball team, The game started fairly slowly and<br />\nthe runner-ups will receive fifteen<br />\nTotals<br />\n12 6 30 tomorrow in the second of the three will take care of the diving, although<br />\ndefeated the George Washington<br />\n'points, the winners will receiv4 tWenfirst<br />\nfive<br />\nminutes<br />\nat<br />\nthe<br />\nend<br />\nof<br />\nthe<br />\nHOPKINS<br />\nUniversity team last Thursday by a<br />\ngame playoffs which will decide'the the competition that the New York<br />\nty-nve points. D. U., defending chamG. F. T.<br />\n,<br />\naccording<br />\ndivers will offer might be.<br />\nscore of 5-1. The match was played the score was tied at 8-8, The Washinter-fra.t cage championship.<br />\npions, are seeded first in this tussle<br />\n1 4 6<br />\nington team fought on fairly even Traggis, f<br />\non the courts at Homewood.<br />\nto records, too much for him.<br />\nKappa Sig Favored<br />\nof brawn and muscle.<br />\nCross, f<br />\n0 4<br />\nRadner And Weiner Favored<br />\nIn the first match, Gus Erskine, terms...pi the remainder of the haZic.3.,_<br />\nKappa'Sig, led by Frank Butt, Bill<br />\n. _ Another bright spot of the Gym- Hopkins, defeated Walt.<br />\n15 Day and Frank McGovern, was OW<br />\n-T,Ibwboree will be a badminton match be- hardt in two straight games, 15-16, but after score stood at ten to tell, Schwartzman, ik<br />\n1 1- 3 tically the same team which carried year on the aquas by participating in<br />\ntween Jimmy Benson and a former 15-8. Erskine, a freshman, has been the Hopkins five started to forge Moore,.c<br />\n3 0 6 them to the finals last year and which the 440 yard free style. He has been<br />\nall-city champ.<br />\n1 0 2 will probably give them this year's more than successful during the year,<br />\nplaying consistently good ball, this ahead. Capturing most of the re- Carlfleton, c<br />\nRasin,<br />\ng<br />\n5 0 10 title. However, T. A. 0., led by little and handed in many excellent times.<br />\nEverybody is urged to support it season, and did not have much diffi- bound because of their superior<br />\nRubinger, g<br />\n1 0 2 Marty Srebnik, has a victory over the He will also anchor the relay.<br />\nand make it a success.<br />\n•<br />\nculty defeating Engehhardt.<br />\nheight, the Jay quintet outscored<br />\n4 0 8 strong Phi Psi quintet to its credit,<br />\nVeteran Danny Weiner and Bill<br />\nThe result of the second match their opponents from then on. At the McLain, g<br />\nThen, it was decided to run off all<br />\nRobinson, g<br />\n0 0 0 and will in all probability give the Dunlap will take care of the backthe volley-ball competition in one found Dick Pasternack the victor<br />\nhalf, the score stood at 25-17 in<br />\n— — — Kappa Sigs a tough game<br />\nstroking event with Weiner expecting<br />\nday, Saturday, March 12. There will over Charles Walden by score of 15-9,<br />\nTotals<br />\n24 8 56<br />\nlittle difficulty in his favorite event.<br />\nbe a double round-robin, and the 19-4. Pasternack played his usual favor of the Black and Blue.<br />\nE. T. A. Defeats T. A.0,<br />\nScore at half—Hopkins,• 29; Drew,<br />\nTeachers<br />\nStiffen<br />\nAttack<br />\naggressive<br />\ngame:<br />\nWaldo Hambleton has expressed an<br />\nfine<br />\nand<br />\nformer,<br />\nPhi<br />\npoint score will be as follows: 45<br />\nE. T. A.,<br />\nAlpha, de20.<br />\nPlaying in the third Slot, Iry Milpoints for the winner, 35 points for<br />\nfeated T. A. 0., 15-10, in the first , optimistic outlook upon the season's<br />\nThe Teachers rallied in the second<br />\nthe consolation prize, 25 points for berg disposed of Charles Engelhardt half until the score-board showed<br />\nplayoff game for the championship. finale.<br />\nThe lineup:<br />\nthe runner-up, 20 points for the third in two games, blanking his opponHopkins leading at 35-31. Then Melscores<br />\ngame.<br />\nThe<br />\nsecond<br />\nent<br />\nin<br />\nthe<br />\nteam, 15 points for the fourth, and<br />\nWILSON TEACHERS<br />\nvin, Rasin and McLain started the<br />\nwere 15-6, 15-0.<br />\n10 points for all entering teams.<br />\nG. F. T.<br />\nrally. In ten minutes, the score rose<br />\nIn the first doubles match Red<br />\n. Soft Ball To Start<br />\npardon,<br />\nf<br />\n2 1-3 5<br />\nto 59 points for Hopkins, when the<br />\nIn the discussion of the coming Glantz and Nat Finkelstein defeated<br />\nGilliam,<br />\nf<br />\n2<br />\n2-2 6<br />\ngame ended.<br />\nsoft-ball league, it was brought out W. Engelhardt and , Walden, 15-10,<br />\nGa., c<br />\n0 0-1<br />\n0<br />\nMelvin High Scorer<br />\nthat the competition will probably 15-11. Finkelstein was brilliant in this<br />\n1 0-1<br />\n2<br />\nNorman Melvin, sharp-shooting for- Ervin, g<br />\nstart before the Spring vacation. All match, and his killer shots and serLewis,<br />\ng<br />\nO 0-1<br />\n1<br />\nward, led the Black and Blue scoring<br />\nvarsity baseball players will be vice were too good forhis opponents<br />\nClark,<br />\ng<br />\n10<br />\n1-2<br />\n21<br />\nwith 18 points.<br />\nbarred from playing interfraternity to handle.<br />\nHart, g<br />\n1<br />\n0-1<br />\n0<br />\nCaptain Carl Rasin was next with.<br />\nPlaying the number two doubles<br />\nball. The winner of the soft-ball comFairall, g<br />\nO 0-0' 0<br />\npetition will receive 105 points, with team, Milt Alperstein and Dick Pas- 15 points, while \"Dimi\" Traggis fol— — -with 14 markers.<br />\nlowed<br />\n21 points for every win, and 5 points ternack won handily by a score of<br />\nTotals<br />\n16<br />\n5-10 37<br />\nHowever, Clark the high scorer of<br />\nfor every loss.<br />\n15-10, 15-13.<br />\nHOPKINS<br />\nthe evening score 21 points, putting 6<br />\nG. F. T.<br />\nfield goals through the hoop in the<br />\nTraggis, f<br />\nWe Carry A Full Line Of<br />\n5 4-5 14<br />\nfirst half, and accounting for four<br />\nMelvin, f<br />\nAtrow Shirts And Collars<br />\n8<br />\n2-6 15<br />\nfield goals and one foul shot in the<br />\nSchwartzman,<br />\n0 0-0 0<br />\nsecond half:- This one-man team<br />\nMooreiGe 44<br />\n_41;?\"<br />\nscored more than half of the total of<br />\nCross'<br />\n,c<br />\nO 0-0 0<br />\nthe Teachers' points.<br />\n11 East Baltimore Street<br />\nResin, g<br />\n7 7-1 15<br />\nThe Hopkins five were substituted Robinson, g<br />\n1 -0-0 2<br />\nfreely throughout the game. Those McLain, g<br />\n• 40-0 8<br />\nwho saw action were Schwartzman, Carleton, •g<br />\n1 0-0<br />\nMoore, Robinson, Carleton and Cross..-.— —<br />\n—<br />\nThe reserves played very well on the<br />\nTotals<br />\n26 7-12 59<br />\ndefense and held their own on the<br />\nScore at half—Hopkins, 23; Wilson,<br />\noffense.<br />\n17.<br />\nAt a<br /><br />\nmeeting<br /><br />\nheld<br /><br />\nWednesday<br /><br />\nAny student who did not attend the organization meeting and<br />\nwho wishes to try out for the team<br />\nshould send his name immediately to Manager Mal Boshnack at<br />\nthe postoffice. All candidates for<br />\npitching and catching berths are<br />\nrequested to limber up at the gym<br />\nthis week as batting practice will<br />\nbe held as soon as possible.<br /><br />\nUnleashing<br /><br />\na<br /><br />\nterrific<br /><br />\ndrivve. for<br /><br />\nKAPPA SIGS TO FACE<br />\nT. A. 0. IN PLAYOFFS<br /><br />\nBLUE JAY WALLMEN<br />\nDEFEAT G.W.SQUAD 5-1<br /><br />\n—<br /><br />\nSwim Coach<br /><br />\nRE-SMING<br />\nCORONADO'S<br />\nTRAIL<br /><br />\n\"cPherkstr;7's<br /><br />\nBilltELEV'S<br /><br />\nKIBLER'S'<br /><br />\nPHARMACY<br /><br />\nJewelers and Opticians<br />\nParker Pens and Pencils<br /><br />\nST. PAUL AT 33RD STREET<br /><br />\nJewelry and Watches<br />\nEyes Examined<br />\nLens Repaired<br /><br />\nPrescriptions—School<br /><br />\nSupplies<br /><br />\nSandwiches<br /><br />\n3222 Greetunount Ave.<br /><br />\nUnexcelled Fountain Service<br /><br />\n•<br /><br />\n•<br />\nOnly Down Town Stag<br />\n'<br />\ne Show<br /><br />\nHIPPODROME<br /><br />\nNOW<br />\nPLAYING<br /><br />\nA Schloss Suit<br />\nToday Costs You<br /><br />\nHELD OVER!<br /><br />\nOnly $26.25.<br /><br />\n4th BIG WEEK!<br /><br />\nMonday That<br /><br />\nWALT DISNEY'S<br />\nFirst full length feature<br /><br />\n\"S N 0 W<br />\nWHITE<br /><br />\n\"What shirt on the market absolutely defies<br />\nshrinkage — is known for high style, and is<br />\nreputed to give lasting wear?\"<br /><br />\nCost You $35!<br /><br />\ntelephone poles!<br /><br />\nagainst the<br />\nMasked and goggled<br />\ntelephone men have<br />\ndust,<br />\ndesert<br />\nyear -old trail<br />\nfollowed the 400<br />\nbuilding the new<br />\nin<br />\nCoronado<br />\nof<br />\nline<br />\ntranscontinental telephone<br />\nThe Spancomplete&amp;<br />\nrecently<br />\ndays to cross<br />\niards took many<br />\ndriving<br />\nSouthwest:,<br />\nthe trackless<br />\ntheir return.<br />\nstakes to guide<br />\nthis desert inYou can span<br />\nnew line,because<br />\nstantly over the<br />\nspirit of Coronado<br />\nthe pioneering<br />\nlives.<br />\nstill<br />\nOceans,rnountains,deserts yield<br />\nbringing<br />\nspirit,<br />\none by one to that System goal:<br />\nBell<br />\nthe<br />\ncloser<br />\never<br />\ncommunidependable telephone<br />\nanywhere!<br />\nanyone,<br />\nwith<br />\ncation<br /><br />\nand the<br /><br />\nSeven Dwarfs\"<br /><br />\nSale<br /><br />\nof<br /><br />\nto-war<br /><br />\n\"Why. Arrow, of course. Your Arrow dealer<br />\nhas a large assortment — $2. and up.\"<br /><br />\nin the new<br />\nMultiplane Technicolor<br />\n—.—<br /><br />\nARROW SHIRTS<br />\nA<br /><br />\nSame Suit Will<br /><br />\n.... with<br /><br />\nEXTRA ADDED<br />\nThe N.<br /><br />\nnewest<br /><br />\nReady-<br /><br />\nends tomorrow<br /><br />\nJos. Schloss &amp; Son<br /><br />\nMarch of Time<br /><br />\nnew shirt if one ever shrinks.<br /><br />\nPI,—ALL NE*<br /><br />\nStage Show<br />\n•<br /><br />\n5 EAST LEXINGTON ST.<br />\n(Nowhere else<br /><br />\nItEILL TIELE1'1111NE SYSTE1<br /><br />\nHOM:EWOOD, BALTIMORE, FRIDAY, MARCH 4, 1938<br /><br />\nMONDAY LECTURE DR, HAROLD HOUGH<br />\nGIVE LAST GROUP<br />\nMARKS FINISH OF;TO<br />\nOF RELIGIOUS TALKS<br />\nCATHOLIC SERIES<br />\nDrew Professor Will Close<br />\n1937-1938 Season With<br />\nDr. Fenwick Of Bryn Mawr<br />\nThree Lectures<br />\nDeals With Church<br />\nAnd State<br />\n\"Protestant View On Social<br />\nIssues\" Is To Be<br />\nOpens Talk By Alluding To<br />\nSubject<br />\nViews Of Former<br />\nTheologians<br />\nDr. Lynn Harold Hough, professor<br />\nOn Monday evening. February 28,<br />\nat 8:15 P.M., Professor Charles G.<br />\nFenwick of Bryn Mawr College, Pennsylvania, lectured on \"Church and<br />\nState and the International Ordcz,\"<br />\nThe lecture Was given in Latrobe Hall<br />\nand was,the third and concluding talk<br />\nby Catholic professors on outstanding<br />\ncurrent problems.<br />\nDr. Fenwick opened his talk by alluding to the views of former theologians on the possibilities of a \"just\"<br />\nwar and indicating the irrelevance of<br />\ntheir discussions to the terrifying<br />\nproblems of modern scientific warfare. Continuing along this theme, he<br />\nbrought the situation from renaissance times up to 1920. In this period<br />\nhe showed how the \"bankruptcy of<br />\nthe balance of power scheme had<br />\nbeen painfully demonstrated\" and<br />\nhow the world, under the influence of<br />\nWilsonian idealism, had looked to<br />\nthe fresh hopes of world organization.<br /><br />\nDr. Graham To Talk<br />\nTo Supper Clubmen.<br /><br />\nCAMPUS CAVORTINGS<br />\nJoe College reads like an 8-year-old third-grader, and at. least one<br />\ncollege professor is doing something about it.<br />\nDr. Emmett A. Betts of Pennsylvania State College has conducted exhaustive researches which proves his point, and he is now treating 31<br />\nstudents in his \"reading clinic.\"<br />\n\"Persons who have the reading abilities of children in the third grade of<br />\npublic schools have been found among college students,\" Dr. Betts said.<br />\n\"The fact that they are doing acceptable college work, although handicapped by rudimentary reading, is a glowing testimonial to their-general<br />\nintelligence.<br /><br />\n• • • .<br /><br />\nA national shrine for the study of science and religion and for the<br />\ntraining of modern youth in these two courses has been established at<br />\nFlorida Southern College,<br />\nThe E. Stanley Jones Educational Foundation,_as_it will be called, is<br />\nnamed after the famed missionary to India, the man who conceived the idea<br />\nof homiletics and comprehensive of the new center.<br />\nThe structure which will house the foundation will contain five religious<br />\nscholkrship at Drew Theological Seminary, will give the last three lec- departments, scientific laboratories, a library, an auditorium, administrative<br />\ntures on religion, sponsored jointly offices nd classrooms.<br />\n• • • •<br />\nby the University, the Baltimore<br />\nNow that you are all nicely settled in your dormitory room and have<br />\nRound Table of the National Conference of Jews and Christians. These been attending classes for at least five months this school year, we are<br />\nlectures will be held in Latrobe Hall giving you a gentle jolt from an educating easterner that maybe it's all<br />\nat 8.15 p. m., on March 7, 14, and 21, a waste of time.<br />\nSimmons College's president is the jolter, and here's the jolt: \"Don't<br />\nand will deal with the Protestant<br />\nView; on Social Issues Confronting assume that your, • life is blighted . . . if (you don't) go to college.\" But,<br />\nif you're already there, says he, \"college work should be above all, an intelthe Religious Groups.<br />\n•<br />\nGraduating from Drew Theological lectual experience\"<br />\n• • •<br />\nSeminary in 1905, Dr. Hough entered<br />\nAs long as we're on research, you'll be interested in this bit from the<br />\nthe ministry. During the period<br />\n1902-12, he Was minister of the Mt. University of Oklahoma's men's counselor: \"The popular opinion is that<br />\nVernon Place Church in Baltimore. the university is society mad. But the fact is the -boys who have -thre<br />\n,<br />\nIn 1919 he was elected. President of four dates a week are•isolated cases.\"<br />\nSee! This kind of research really does seem to be Wanted.<br />\nNorthwestern University, but left<br /><br />\nV.<br />\nDr. Frank Porter Graham,<br />\nPresident of the University of<br />\nNorth Carolina, will give the sixth<br />\nUniversity Supper Club lecture<br />\nnext Tuesday evening, March 8.<br />\nA specialist in history and economics, Dr. Graham will talk on<br />\nsome phase of the social philosophy of today. Dr. Graham is<br />\nChairman of the National Advisory Council on Social Security<br />\nand Vice Chairman of the NaAdvisory<br />\nConsumer's<br />\ntional<br />\nBoard:<br />\nThe lecture will be given in the<br />\nUniversity Baptist Church at 8:15<br />\np. m. It will be preceded by a private dinner of the members of<br />\nthe Supper Club.<br /><br />\nThe<br /><br />\nOFFICER'S CLUB<br />\nPresents The<br /><br />\n1<br /><br />\nMILITARY BALL<br />\nFeaturing<br /><br />\nWaiter Routson's Orchestra<br />\nat<br />\nLEVERING HALL<br /><br />\nPatronize Our<br />\nAdvertisers<br /><br />\non<br />\nMARCH 26<br /><br />\nBILLIARDS<br />\nPing Pong<br />\nManaged by Maryland',<br />\nSiete Champions<br />\nFinest Tables—Reasonable Prices<br /><br />\nGreenmount Ave &amp; Slat St.<br /><br />\n9 to<br />\n*<br /><br />\n$1.50<br /><br />\n1<br /><br />\n*<br /><br />\n*<br /><br />\nHe is generally recognized as a<br />\nleader in education and religious<br />\nmatters, and has written scores of<br />\nbooks in the field.<br />\nThe lectures will close the 1937-38<br />\nseries on religion. The public is in-<br /><br />\nzorr 1,e;<br /><br />\nALUMNI ASS. AWARDS<br />\n$1000 SCHOLARSHIP<br /><br />\nMusical Club<br />\n'I<br />\nNew York Bound<br /><br />\nPhillips sat down to the piano and<br />\nsoloed- the Second Hungarian Rhapsody by Franz Lizt. He responded to<br />\ntwo curtain calls, and reappeared<br />\nFifth,Concerto by Chopin.<br />\nto play the‘<br />\nHis performance was recognized as<br />\none of the outstanding of the, eveningc<br /><br />\n*<br /><br />\n*<br /><br />\nthis position in 1920.<br /><br />\n. t46<br />\n.̀ \"'en<br />\nelf<br />\ne<br />\n,<br />\n44,Tr<br />\n1.The speaker indicated the benefident attitude of the late pope, Benedict XV, to the enactment of a<br />\nscheme for the furtherance of international organization and relations,<br />\nprovided that the plan is based on the<br />\ntwo principles of justice and charity.<br />\nThe Johns Hopkins University<br />\nThe complete failure of an attempt at Alumni Association has announced<br />\nsuch a plan, namely the League of the presentation of,<br />\n$1000 dollar<br />\nNations, has been occasioned by the scholarship fund to the University,<br />\nand<br />\ninadvertence<br />\ncomplete ignorance<br />\nproceeds of which will be distributed<br />\nof the statesmen participating in it, at the discretion of President Bowwho refused to consider the economic man. The announcement was made,<br />\nbasis of any lasting political peace.<br />\nat the Alumni Association Dinner at<br />\nConcluding his argument on the re- the Chesapeake Club on February 22.<br />\nsults of poor statesmanship in the<br />\nThe gift is'a result of the memLeague's attempt, Professor Fenwick bership dive recently instituted by<br />\npointed out that the errors of the J. A. Dushane Penniman, president<br />\nLeague members more or less direct- of the Association, and Which resultly caused the rise of totalitarian dic- ed in increase of membership by two<br />\nin<br />\nEuropean hundred. The fund is also indicative<br />\nseveral<br />\ntatorships<br />\ncountries which extort the conces- of the improved financial condition<br />\nsions that might well have been of the association.<br />\ngranted in less tense and more reaPresident's Report<br />\nsonable times without the use of<br />\nThe gift seems to be in answer<br />\n\"armed\" force.<br />\nto a plea set forth by President Bowman in his recently issued 1936-1937<br />\nTesta International Bond<br />\nreport. In his report the president<br />\n—the fact remains,' inescapable on<br />\nstated, \". . . it is highly desirable<br />\non any Catholic or Christian princithat men and women of large means<br />\nple, that public and private moralit<br />\n'edlicatiotf<br />\nrest on the same abik.-Aste obligations<br />\nguarantee of our social welfare,'<br />\nof justice, precluding the use of force<br />\nshould provide additional funds to<br />\non any save the strictest grounds of<br />\nthe extent of forty thousand dollars<br />\ndefense; certainly not on any false<br />\nanrivall or the income on a capital<br />\nplea of a have-and-have-not ,basis.\"<br />\none million dollars. Half this<br />\nThus the speaker formulated his con- sum of<br />\nshould be eXiim..n-ptsat-- cept concerning an international sunr<br />\ndoctorate group, all too small at the<br />\nbond and the method necessary to obpresent time, and the remainder uptain it. He tried to show to the audigraduate students and the best<br />\nence that a plan based on justice and on<br />\nsenior group.\"<br />\ncharity would be the most plausible of the<br />\nAs to whether the gift wquld be<br />\none and one most likely to succeed.<br />\nincreased or continued in future<br />\nHis conclusion was that the world<br />\nyears, the officers of the Associamust face at the present time, under<br />\ntion stated that it depends upon<br />\nextremely difficult but not impossible<br />\nthe financial and numerical capacity<br />\ncircumstances, the economic quesof the Association.<br />\ntions that should have been recognized two decades ago.<br /><br />\n(Continued from Page 1, (ol. 4)<br />\nand the quartet was recalled after<br />\nof \"Whistle<br />\ntheir interpretation<br />\nWhile You Work,\" and \"We're Working Our Way Through College.\" A<br />\nblonde in row R said \"the quartet is<br />\n`tops,\" but she had yet to hear Otto<br />\nPhillips. •<br /><br />\nJ<br /><br />\nhe<br />\nt'<br />\nCr<br />\ngi<br />\nW:<br />\nm.<br />\nme<br />\nho<br />\nof<br />\nfo<br />\nBa<br />\nse<br />\nOb<br />\nSa<br />\nLa<br />\nPr'<br /><br />\nJo<br />\nhel<br />\nre.<br />\nr..<br />\nBa<br />\nan<br />\nthe<br /><br />\nstatetnent-tel1<br />\nis to tbat<br />\n-ct<br />\nrVhe oPievt‘siog,Vcoc).-tI<br />\n••<br />\n10:10Seki •<br />\no,<br />\nbest oboo,t tof<br />\nthat<br />\ntVe<br />\nsoo-vetkii,of, vvo-ce<br />\nood<br />\nhave f they like<br />\nco.o<br />\nsnlokers, taste<br />\ntl-veysec<br />\nDER.<br />\nMIL<br />\n.<br />\nhave a<br />\nof<br /><br />\nstrongest<br /><br />\nlot<br />\nare<br />\nChesterfields<br />\nields yourself<br />\nChesterf<br />\n...that rove forSATISFY.<br />\ncan<br />\n-ft Chesterfrelds<br />\nthat<br /><br />\nPHOTO DISPLAY HELD<br />\nIN LIBRARY CORRIDOR<br /><br />\nme<br />\nse<br />\nex<br />\nthe<br />\nthe<br />\npri<br />\nca<br />\ndi<br />\nha<br /><br />\nit<br /><br />\n(continued from Page 1, Col. 4)<br />\nThose who have seen the previous<br />\nexhibits of the club noticed that the<br />\nsame persons have been exhibiting<br />\neach time. Eugene Wallms president of the club explained this by<br />\npaying that \"The small number of<br />\nmembers represented in this exhibit<br />\nis due to the fact. that many other<br />\nmembers do not have their own darkroom. and the club rooms were. not<br />\ncompleted' in time for this exhibit.<br />\nTherefore, many meml:Zrs found it<br />\nimpossible to make prints for the exhibit. This obstacle will have been removed when we hold our next exhibit in May.\"<br /><br />\nthe<br />\nDr.<br />\nJo<br />\ntor<br />\nfirs<br />\nthe<br />\ntee<br />\noer<br />\nthe<br />\nFr.<br />\nrni•<br /><br />\ncal<br />\nape<br />\nass,<br />\nthe<br />\nDr.<br /><br />\nHaving dallied in the heights of the<br />\nnumber<br />\norchestra<br />\nclassical, , the<br />\n,earth<br />\nbrought the audience back to'<br />\nwith down-beat swing. Aided by Don<br />\nhis<br />\nOlsen<br />\nand<br />\nPete<br />\nquips,<br />\nHamilton's<br />\nclarinet playing with the quartet<br />\nwere so enthusiastically applauded,<br />\nit threatened with upset the whole<br />\nschedule of numbers.<br /><br />\nImmediately following the program, Bradford Johnson was introduced as business manager of a financially sucCessful season, by John<br />\nGhinger, president of' the Musical<br />\nClub. The sponsor, Miss Evelyn Janet<br />\nRoop, and the guest of honor, Miss<br />\npresented<br />\nwere<br />\nFickner<br />\nHelen<br />\nflowers.<br />\nWhen the final curtain dropped.<br />\nOsmar Steinwald again directed<br />\nthe Glee club harmony as they work. couples drifted across the hall to be<br />\ned up a brilliant final with a rousing entertained at a dance by Billy Isaac<br />\nand his Command6rs in the ballroom.<br />\n.<br />\nJ. H. U. medely.<br /><br />\nan<br />\ntio<br />\nco<br />\nwe<br />\nkn<br />\noe<br />\nad,<br />\nwi<br /><br />\n..youllfind MORE PLEASURE<br />\nin Chesterfieldi milder&amp;tier taste<br />\nCopyrigOt 1938. LGGirr<br /><br />\nMYR].1 up,<br /><br />\nt<br /><br />\nRo<br />\nJoh<br />\nFri,<br />\nGo<br />\nyer<br />\nGre<br /><br />"}], "field_media_file": [{"target_id": 39158, "display": null, "description": null, "target_type": "file", "target_uuid": "55d7a89d-3512-4d2f-94f4-e35c775a921c", "url": "http://digital.library.jhu.edu/system/files/2022-03/13395-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13395, "target_type": "node", "target_uuid": "b53e7d16-8d24-4bcd-9393-88780a110bcc", "url": "/node/13395"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0a745252-30bc-4678-af08-6b5936ad5a42"}]}