{"mid": [{"value": 37405}], "uuid": [{"value": "3716b327-d190-410c-b5ed-3d6fd23027a1"}], "vid": [{"value": 37405}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:31:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13337-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:31:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:31:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXIII No. 9<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 30, 1928<br />\n<br />\nHOOVER-SMITH<br />\nWOMEN'S CLUB TO GIVE<br />\nDANCE<br />\nDEBATE THURSDAY \"- HALLOWE'EN<br />\nToniFht, in the<br />\nHall.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nR. 0. T. C. DECREES-MUMBLING AS<br />\nSMITH'S HOMEWOOD VISIT<br />\nLATEST FALL FAD ON CAMPUS CANCELED AT LAST MINUTE<br />\n•<br />\n<br />\nHOPKINS LOSES TO<br />\nSWARTHMORE ELEVEN<br />\nSmith's -visit-to- the<br />\n<br />\nHe stepped sullenly from the people who folrowed him is he de,basement door of.Gilman Hall into scended to the lower drill field were Hopkins campus was canceled<br />\nat the<br />\nPass, Lyons to Zimmerman,<br />\nthe tunnel, walked to the south end, more than an accidental audience. last minute due to the excessive<br />\nGives Jays First Score<br />\nturned about,. and, with measured •Doubtless they were by curiosity or number of functions on his schedule.<br />\nSPEAKERS KEPT SECRET<br />\nstride made his way to the opposite even by the mysterious appeal of Dr. John H. Latane was- chairman HOWARD CAPLAN STARS<br />\n-end, his lips, opening at every step, fear impelled to go behind him.<br />\nNews-Letter Will Take Poll to<br />\nof the committee which had arbut no sound issuing from them. On the lower field, he picked lie ranged for the presidential nomi- Last Quarter Rally by Garnets<br />\nDetermine Campus Opinion<br />\nBeats Jays<br />\nThere he hesitated a moment, nearer. .of the defunct basketball nee's visit to the University.<br />\nThis week's assembly will be<br />\nwheeled around again, and once goals as his new starting point,<br />\nand<br />\nIt was expected that the DemoHopkins' football team lost to<br />\ndevoted to a political debate acmore directed himself toward the aWay he went, evenly, silently,<br />\nun- cratic candidate would come to Swarthmore last Saturday, 13-9,<br />\nsouthern opening, all the time hurriedly as before, and as before<br />\ncording to Donald Hiss, president<br />\nHomewood until Monday morning's making the third consecutive defeat<br />\nmarching at the same even gait, al- moving his almost quivering lips<br />\nof the Student Council. The perin, papers announced the sudden change for the Blue Jay eleven. Despite the<br />\nways moving his lips in the same was it in wordless prayer?<br />\nsonalities of the two candidates<br />\nSurely of plans which so mucfi disappoint- fact that the Jay team has dropped<br />\nsoundless manner.<br />\nfor the Presidency, Hoover and<br />\nsomething desperate was about to ed the ardent Smith supporters the last three contests, Hopkins'<br />\nArrived a second time at the take place. Theclitnax was about<br />\nSmith, will be discussed, and<br />\namong the -students and faculty. rooters who saw the game last Satsouth end, he, halted sharply and to occur. The tragedy was on<br />\nsome •of the more important isthe Rreparations had been made to re- urday were far from discouraged at<br />\nlooked back with an uncomprehend- eve, of befalling. Nerves<br />\nsues of the campaign will be gone<br />\nwere ceive the Governor and his party the showing made by the Black and<br />\ning, troubled expression. Then he drawn taut as his hand slid to his,<br />\nover. The prohibition issue is tp<br />\nin front of Gilman Hall, where Drs. Blue club,-,,<br />\nunhurriedly<br />\nup<br />\nthe<br />\nscrambled:<br />\nhill pocket, and his eyes scanned—sor- Latane, Goodnow<br />\nbe one of the main topics. Donand Ames were<br />\nA last-minute rally featured by<br />\nto the upper quadrangle,. and'made rowfully, it seemed—the ground he to welcome<br />\nald Hiss will preside during the<br />\nhim, and the R. 0. T. C. two long passes gave the -Garnet<br />\nfor the lone, big, gaunt tree half- had but now traversed.<br />\ndebate. -Each 'debator will be alUnit was to be lined up along the eleven their second and winning<br />\nway to the bowl. From it 'he startlowed twenty minutes in which<br />\nAs the hand came our of the sides of the quadrangle.<br />\nscore. It was during this fourth<br />\ned back toward Gilinan Hall, folto present his case and five minquarter rally that the Jay team dislowing a straight course. The same pocket, it drew with it—a notebook<br />\nutes,. for the rebuttal.<br />\nplayed a remarkable amount of powuniform -step, the same moving but and a pencil r With these hewrote<br />\nSurprise Attack<br />\ner which indicates good chances for<br />\na word or two, and then quickly disunspeaking<br />\nSlimly,<br />\nlips.<br />\nalmost<br />\nThe speakers have not been an- Retirement Marks End of 28<br />\nfinishing out the remaining four<br />\ncarefully, he mounted the first three appeared acrOss the campus, all his<br />\nYears at Teaching<br />\nnounced as yet, each party keepformer slow and puzzled bearing<br />\ngames in a creditable manner.<br />\ning its plans from the other in<br />\nDr. Frank Morley has formally or four steps leading from the cam- gone. The disappointed onlookers Famous Behaviorist Psychologist<br />\nLyons to Zimmerman Scores<br />\norder to 'spring a surprise attack retired as head of the mathemat- pus to the piazza- in front of the were<br />\nWill Attract Many<br />\nleft to their own explanations.<br />\nHopkins' first score came early in<br />\non its opponent. The Republicans ics department at the Johns Hop- portico. Faltering upon one of<br />\nthe first quarter on a pass from<br />\nare sending to Washington for kins Unive ity and has been ap- them, he turned about and stood ir- (Editor's Note: Last week the<br />\nHopkins students are given an Lyons to Zimmerman.<br />\nThe pass<br />\ntheir champion, while the Demo- pointed as ofessor emeritus of resolutely for, some minutes rather sophomore R. 0. T. C. classes had opportunity to hear Dr. John B. was<br />\nas well executed, both on the<br />\nthe<br />\nback<br />\ntree<br />\nupon<br />\ntheir-practical<br />\ngazing<br />\nintently<br />\nexercises<br />\nin<br />\nrange<br />\nesfighting<br />\ncrats,<br />\nfire with fire, say mathematics. This retirement<br />\nWatson,'father of \"Behaviorism,\"<br />\ntimation over level and rolling at a special price of fifty cents, passing and receiving end, as one<br />\nthey \"can match any man the Re- marks the end o 8 years at act- from which he had just come.<br />\ncould wish to see. Lyons dropped<br />\nanyone<br />\nhim<br />\nseeing<br />\ntime<br />\nBy<br />\nthis<br />\nground.'<br />\nThe<br />\nNEWS<br />\n-LETTER,<br />\nir.<br />\npublicans produce.\" Al Smith ive teaching and re arch spent at<br />\nwhen he lectures at the Alcazar the ball into Zimmerman's hands<br />\non<br />\nconvinced<br />\nbeen<br />\nprinting<br />\nsurely<br />\nhave<br />\nwould<br />\nthis<br />\naccount,<br />\nassumes<br />\nnc<br />\nsupporters_olaim that the.. Gover- this university. Thr ghout this<br />\non November 12, at 8.15 P. M. the five-yard line<br />\nand with a few<br />\nnor's visit,. to the campus has period he has acted a editor of that he was a maniac and ought to responsibility for the veracity of the The address, which is sponsored steps the lank Jayman<br />\nwas over the<br />\ngained hint the victory among the American Journal, o Mathe- be watched. Perhaps then those story.)<br />\nby the Baltimore District, Child line for Hopkins' first score.<br />\nHopkins men. The friends of matics -and has made v uabfe<br />\nStudy Association, is on the topic<br />\n• The aerial combination of LyonsDebating Council To<br />\n\"The Social and Ethical ImpliHerbert Hoover deny this, -claim- 'contributions toward the adv nee Musical Club Looks<br />\nto-Zimmerman has been,working excations<br />\nof<br />\ning that iii spite of Smith's alleged )f his subject.<br />\nBehaviorism.\"<br />\nForward To Big Year<br />\nBe Given Dinner<br />\n.<br />\nceedingly. well and._by the time „St.<br />\n-Victory among the faculty the Re- His ability as a geometrician is<br />\nDr. Watson is said to be the John's comes to Homewood things<br />\ngoing<br />\nhave<br />\nbeen<br />\nthings<br />\nThe<br />\nway<br />\nNorman.<br />\nB.<br />\nGardiner,<br />\nJr.,<br />\nwho<br />\npublican sentiment at Homewood universally recognized and remost widely discussed phychol- should be happening along those<br />\nis as overwhelming_as the major- spected. He is a former presi- with the Musical Club it -seems as was head of last year's Debating ogist of the day, and the large lines which<br />\nwill give the Annapolyear.<br />\nBen<br />\na<br />\nbig<br />\nare<br />\nout<br />\nif<br />\nfor<br />\nthey<br />\nCouncil;<br />\nas<br />\nwell<br />\nas<br />\nmanaging<br />\nedities received by the G. 0. P. in dent of the American Mathematcirculation of his books is urged itans something to think about.<br />\nthe last two presidential electioria. ical Society, a fellow of the Amer- Kolb, who is heading the club this itor of the NEWS-LETTER, is giv- in substantiation of this claim.<br />\nAfter the first score the game<br />\nyear, infoins us that on Thursday ing a dinner at his home in RiderHis premisi, to quote from infot- lapsed<br />\nMeanwhiletThe undergraduates ican Association of Arts and Sciinto a kicking duel between<br />\nnight they had the biggest turnout wood-tonight to the members of<br />\nmation supplied by the associa- the two<br />\nare doing their best to settle the ences, and a member of the Amerpunters, neither side havin the .history of the organization. this year's Debating Council. The<br />\ntion, \"is that a child comes into ing a noticeable<br />\nissue prematurely. The News- ican Philosophical Society, Lonadvantage, until the<br />\nSeventy fellows showed up for the purpose of this dinner is to. orthe world provided with no tem- end of the half.<br />\nLETTER is being shaken by inter- -don Mathematical Society and<br />\nSoon after the berehearsal! Kolb put the boys ganize the men elected to the<br />\nperamental or mental instincts, ginning of the<br />\nnal dissention. . The business Palermo Circolo Mathematico.<br />\nfinal half the Swarththrough two pieces.and.oyas pleas- Council last. spring.<br />\nand that all such are created and more outfit tore its way<br />\nstaff threatens to insert a full In collaboration with Professor antly surprised to ffitd• some very<br />\nthrough the<br />\nA very attractive -schedule is instilled in him:\"<br />\npage adverlisement for Smith if James Harkness, Dr. Morley has fine Material among the crowd. The<br />\nJay eleven and aided by a long pass<br />\nthe editorial department doesn't written several treatises on the numbers they are planning to use being arranged, including many The doctrine is said to attract suc,c6eded in putting the ball over<br />\nstop making articles so pro-Hoov- \"Theory - of Functions\" and 'has exclusively this Year are: Kipling's out-of-town trips. The Council some as insistently as it repels which, after McGuire's excellent<br />\ner. The editors replied to this been engaged for some time in \"Recessional Ode,\" put to music by shall soon issue a call for candi- others. Dr. Watson is now lec- kick, made the score 7-6 in favor of<br />\nwould writing a book on inversive ge- Reginald De Koven ; the \"Heidel- dates for the Freshman and turer at the New York School for Swarthmore.<br />\nthey<br />\nthat<br />\nultimatum<br />\nSophomore teams. ,The annual Social Research and editor 'of the<br />\nthrow out the ad in question ometry.<br />\nhurg Song,\" from the \"Prince of<br />\nDIMINITINIUZ for Lyons<br />\nwhen pasting up the dummy. The Professor Morley was born at Pilsener,\" and \"Deep River,\" bv debate between these two classes Journal of Experimental PsycholAt this point Lyons was removed<br />\nnorth side of Gilman Hall is the Woodbridge, Suffolk, England, Harry C. Burleigh, the famous ne- will take place some time in the ogy. , His hooks include \"Psy- from the game, Ashton<br />\nDevereaux<br />\nRepublican headquarters on the September 9, 1869. He received gro spiritualist. The club has been near future.<br />\nchology from the Standpoint of taking his place at quarter.<br />\nSwarthcaitipus, for there Dr. Vs ilfough- his B. A, M. A., and D. Sc. from fortunate enough to secure as direcFor the last two years the Frosh- the Behaviorist,\" \"Behaviorism,\" more kicked to Hopkins and soon<br />\nFrom<br />\nCambridge.<br />\nCollege,<br />\nKings<br />\nd<br />\ne<br />\n-Sithe<br />\nsouth<br />\n-by holds sway. On<br />\ntor the services of Osmar Stein- Soph debates have been won by the \"Psychological Care of Infant and after a long pass, this time to<br />\n• Dr. Latane.• and his fellow Vir- 1884 to 1888 he was on the staff wald.. Llewellyn will again sing the present Junior class. The Sopho- Child,\" and \"Ways of Behavior- Htunie Houston, put the<br />\nball on.the<br />\n.In<br />\nEngland.<br />\nCollege,<br />\nginians hold a Democratic earn- of Bath<br />\nmores of this year will attempt to ism.\"<br />\nPennsylvanian's 20-yard line. Sevpaign headquarters. Due to the 1888 he became professor of math,<br />\novercome last year's set-back by de'<br />\neral<br />\nrushes<br />\nwhich<br />\nnetted the Jays a<br />\nThe reduced rate tickets may<br />\nIn_ acid iti, _tO___Iast year*.s1trips<br />\nfd-ct that Dr:-Willoughby's-offteelema Lk, at II.,ei foi d-Cvllege, refeating the yearlings\"' this season.<br />\nfirst down were followed by a beauuntil 1900, when he the boys are planning to give con- Among those tnemars of the lass be obtained by students of the tiful kick by<br />\nfaces on the front while the Pro- nmaiiig<br />\nHoward Caplan which<br />\ncerts at both Goucher and the Maryfessor of -American History only entered upon his duties at Hopof '30 who participated in the de- university from the Library of made the score 9-7 in the Black<br />\nland College for Women. These<br />\nhas a side corridor, the elephant kins.<br />\nbate last year were Paul Spear, and Education, on the first floor of and Blue favor.<br />\nconcerts will probably be followed<br />\nis considered to have an edge The Mathematics department<br />\nDal Ghent.<br />\nGilman Hall.<br />\n•<br />\nThe fourth quarter, in which the<br />\n• loss by dances. over the donkey. Meanwhile the at Johns<br />\nand<br />\nGarnets snatched victory, was full<br />\nfar<br />\nlooked<br />\nhas<br />\n'Strange<br />\nto<br />\nfew<br />\nsay,<br />\nfootand<br />\nquite<br />\na<br />\n\"Y\" office is Socialist headquar- ke<br />\nHOPKINS<br />\nALUMNUS<br />\nRISES<br />\nHIGH IN<br />\nof exciting<br />\nters, with Mr. Schaal having a ide for additions to the depart- ball men are out for this activity.<br />\nA fumble reCHOSEN PROFESSION IN- THIS CIT1 covered by moments.<br />\nAccording to latest reports Swarthhard time holding out agains a ment. They ,beeergnally selec<br />\nBesore, a 25-yard run<br />\nre's been blown to Hell! Rather<br />\n, strongly Republican \"Y\" ca net. Dr. John Williamson of St. AnFormer Hopkins men have, gone \"It's a long day though,\" said by—kktplaris a blocked punt' by<br />\ndrews College, Scotland, and Dr. a \"You can go more than twenty far and wide—Morton Hamburger, Croll to<br />\nA Heat Ten<br />\nthe NEWS-LETTER reporter, ,TWarthmore, two beautiful passes<br />\nThe voices of the e gineers Oscar Zariski of the University 'les on a gallon—use Carbona\" af- Enoch Light, and Bill Rodgers have \"we get on the field at about sixby the Garnets, another fumble by<br />\nfloat out across the road as they of Rome, Italy. Both have ac fair for some of Swarthmore's reg even gotten as far as Paris. But,a thirty in the morning and don't<br />\nHopkins, and a 23-yard run by<br />\nulars<br />\nwill<br />\nswear<br />\nthat<br />\ntwenty<br />\nmiles<br />\nis<br />\ncall.<br />\nthe<br />\nthe<br />\ncepted<br />\nof<br />\nmen<br />\ni<br />\nthe<br />\ndiscuss<br />\nwarmly<br />\nformer member of the Class of '29 leave until dark. We make long<br />\na minimum distaice.<br />\ntwo candidates. After a they<br />\nhas \"gone higher\" than any billion flights to New York, Philadelphia, Swarthmore, provided all the excite. *.<br />\nsay, Teapot Dopte and<br />\necial JtaSer:firtained<br />\nIt seems that the unemployed stu- without leaving Baltimore. His Washington, and the South, and two ment and gave the Pennsylvanians<br />\nnothingon the<br />\nmany<br />\nFans dents on the campus had to play with name is Lockman Croll and he's classes of shorter ones. Flights of their second and winning score.<br />\nFor Football<br />\n•<br />\nstunt that the Arts and Science<br />\nfire, they just would have bonfire entefed the field of commercial avi- the first class are about seven minLine-up:<br />\nrates have been obseniors tried to pull off on the Special<br />\nand have a real hot time. They did ation.<br />\nutes in length and we charge three<br />\nHotel<br />\nCommodore<br />\nthe<br />\nat<br />\ntained<br />\nHopkins<br />\nSwarthmore<br />\nthree-year engineers in the class<br />\n—until<br />\nsome<br />\nhappy<br />\nsoul<br />\ntossed<br />\na<br />\nAbout a year ago \"Lock\" became dollars. The second class or 'five Houston<br />\nfor those- who go to New York<br />\nL.E<br />\nHeward<br />\nwhole can of gasoline right into the<br />\nelection. But for the-moment<br />\ndollar<br />\nflight'<br />\nincludes<br />\na<br />\nfifteen<br />\nminCothe<br />\nsee<br />\nto<br />\none of the chief stockholders in the<br />\non the special car<br />\nL.T<br />\nKeefer<br />\nthe feuds between \"mechanicals, lumbia game on Nov-ember 10. All middle of the fire, where strange to Park Heights Avenue Flying ute trip over the University, Sta- Love ..,<br />\nTobin<br />\nL.G. (C.) Hallowell<br />\nelectricals and \"AB's\" are forgot- those who wish to go should see say it exploded and, -oh well, pick School, Inc., on Park Heights Ave- dium, and Guilford.<br />\nMcFeely<br />\nten as the \"practical minded men\" Purnell Hall at the barn at 12.20 up the pieces. Their star player on nue and Seven Mile Lane. Today \"An aviator really needs a sense Strader (Capi.).0<br />\nR.G<br />\nllockth<br />\nenthusiastically apply \"a heat any day ,before November 5. If the football team was --picked up he is secretary-treasurer and chief of humor to get along,\" he added. kegan<br />\nDellmuth<br />\ntest\" to the political situation. sixty men have not paid by that thirty feet away, his clothes blazing mechanic of the corporatir which On one flight Lieutenant Melamet Bialoskorsky ....R.T<br />\nthe trip will have to be and his face and hands burned.'The boasts of two Challenger planes and stopped his motor in order to talk to Zimmerman<br />\nR.E<br />\nHaviland<br />\nThe NEws-Lerree, in 'order to time,<br />\na passenger. The man turned pale<br />\ncalled off, as the Athletic AssoTestwide<br />\nQ.B<br />\nsettle the dispute and determine ciation will not be responsible in bystanders put out the flames and a most' encturaging volume of busi- when the roar of the propeller Lyons<br />\nMcDarmond<br />\n„F.B<br />\npublic opinion at Hopkins, is go- this case. If the trip proves a rescued the man.. Many other squad ness. The president and chief pilot ceased and yelled hoarsely, \"For Caplan<br />\nH.B<br />\nAtkinson<br />\nGod's sake, can't you get her started Lang<br />\n6i/to hold a poll of those attend- success, the same thing will be members were hurt as well a,: per- is Lieutenant Otto Melamet,<br />\nBesore<br />\nBarnes<br />\nH.B<br />\nWorld War veteran.<br />\nagain?\"<br />\ndone for all the games next year. fectly common collegians.<br />\ning the assembly.<br />\nPersonalities of Candidates and<br />\nIssues to Be Discussed<br />\n<br />\nthe Women's Club of the<br />\nUniversity will hold a dance<br />\nin celebration of Hallowe'en.<br />\nThe Blue Jay Orchestra will<br />\nstart rendering the music at<br />\n9 P. M.; the admission will<br />\nbe $1 per couple and 50 cents ,<br />\nstag.<br />\nThe dance is to be a costume affair, significant ot the<br />\nOccasion, while the C. E.<br />\nHall will correspondingly<br />\ntale on the appearance of an<br />\nautumn scene.<br />\nAlthough sponsored by<br />\nthe Women's Club, the<br />\ndance will be given for the<br />\nenjoyment of all,students<br />\nand their friends.<br />\n<br />\nDR. MORLEY RETIRES<br />\nAS MATHEMATICS HEAD<br />\n<br />\nDR. JOHN B. WATSON TO<br />\nLECTURE ON NOV. 12<br />\n<br />\n\f1928<br />\n-LETTER, OCTOBER 30,<br />\nTHE JOHNS HOPKINS NEWS<br />\n<br />\nCAMPBELL<br />\nlux-FORDYCE E. C.<br />\npeople who were accustomed to<br />\nDR. ROBINSON<br />\nALUMNUS<br />\nideal<br />\nan<br />\nhave<br />\nWe<br />\nS<br />\nbeauty.<br />\nHOPKIN<br />\nand<br />\nGIVES LECTURE ury<br />\nof<br />\n,Insurance<br />\ncity in its best age. Private life<br />\nAll Lines ofl<br />\nContinued from Page 3, Col. 1<br />\nunPLaza 1062<br />\nthese people had never _Dem<br />\nPhone,<br />\nwere<br />\nlamps<br />\n+oil<br />\nCrude<br />\nof Olympus.<br />\nof<br />\nfolded before. Now by means<br />\nfound and beautiful vase fragments<br />\nFOUNDED 1897<br />\nions we may delve into<br />\nexcavat<br />\nthese<br />\nciv.high<br />\n'just<br />\n.pointing towards a rather<br />\ntheir very homes and find out<br />\n$2.00<br />\nINTERIOR WOOD WORK<br />\nilization. Beautiful statuettes were<br />\nSubscription<br />\nlived. We find in sotile<br />\ntheY<br />\nhow<br />\nin<br />\ninches,<br />\ntwo<br />\nATIONS<br />\nmerely<br />\nDECOR<br />\nin<br />\nce<br />\nSome<br />\nPostoffi<br />\nfound,<br />\nthe<br />\nfine<br />\nat<br />\n,<br />\nof<br />\n3,1909<br />\ner<br />\nhomes -an. musu 1 amount<br />\nEntered ps second-class matter Decemb<br />\nNovember 3,4879.<br />\neigIit -aud-made-ottere_<br />\nin some,<br />\nBaltimore, Md., under Act of Comp ess<br />\nSONS •<br />\ncotta art wcgksf We find<br />\nterra<br />\nof<br />\nds<br />\nhundre<br />\nalso<br />\nJOHN C. KNIPP &<br />\nwere<br />\nJohns<br />\nof<br />\n'Art—that of<br />\nby the students<br />\nne<br />\nJune<br />\nByzanti<br />\nto<br />\nof<br />\nOctober<br />\ndeuces<br />\nfrom<br />\nekly<br />\nsemi-we<br />\nPublished<br />\nand women shown:<br />\nmen<br />\nof<br />\ns<br />\nmasque<br />\nor winged lions usually<br />\nHopkins University.<br />\nFURNITURE<br />\nart had to' be very the griffins<br />\nare<br />\nR, These'vYorks of<br />\ncarrying off some prey. We<br />\nbe addressed to the BUSINESS MANAGENG<br />\nany<br />\nprevent<br />\nto<br />\nas<br />\nSo<br />\nBusiness communications should<br />\n'dug<br />\nMANAGI<br />\nly<br />\nthe<br />\nto<br />\ncareful<br />\ne<br />\narticles should be sent.<br />\nBALTIMORE, MD<br />\neven acquainted with the intricat<br />\nJohns Hopkins University. All<br />\nEDITOR-IN-CHIEF.<br />\ninjury to the statue. Evidence of<br />\nWe<br />\nEDITOR; other communieations to the<br />\nFactory.<br />\nliving habits he these people.<br />\nis<br />\nvanity<br />\ns<br />\nwoman'<br />\nnown<br />\ntile well-k<br />\n600 S. Pulaski Street<br />\nUniversity 0100<br />\nShow Rooms<br />\nfind in one room of a large house,<br />\nul<br />\nbeautif<br />\na<br />\nof<br />\nform<br />\nshown in the<br />\nbe<br />\nTelephone<br />\n343 N. Charles Street<br />\nsmall bath-tubs which had . to<br />\nlittle vanity lox containing beauin a sitting -position. One<br />\ned<br />\nemploy<br />\ncover.<br />\nthe<br />\non<br />\ntiful work in refuge<br />\nEDITORIAL DEPARTMENT<br />\nof the fair co-eds is shown sitting<br />\nIt was,brought' out here that the in one and seeming to enjoy herEditor-in-ChiAt<br />\nGEORGE E. BAN x§,—Itt.., '29<br />\nmen Shown 'digging among the self enormously. There' are imNEW LIFE<br />\nAssistant Managing Editor<br />\nruins-were refugees and were paid pression; at the bottom of the tub<br />\nFOR MOTORS<br />\nTHE GIANT<br />\nManaging Editor<br />\n40<br />\nGUMP,<br />\nwere<br />\nGEOVE<br />\nmen<br />\nThese<br />\n.<br />\nday.<br />\na<br />\n'29<br />\nFUEL<br />\npre40 cents<br />\nPOWER<br />\nPHILIP W. Ness,<br />\nthe feet. possibly to<br />\nplacing<br />\nfor<br />\ngrateful to get the work and. the vent slipping. A humorous suggesAssociate Editors<br />\nRICHARD H. WOOD, '29<br />\ning was in this way doubly<br />\nexcavat<br />\nWILMER H. DRIVER, '29<br />\ntion by Dr. Robinson was that mod\"STANDARD\" MOTOR OIL<br />\nROBERT S. BAIRD, '30<br />\nadopt<br />\nI eneficial to humanity.<br />\nreally<br />\n.<br />\nshould<br />\nents<br />\napartm<br />\nern<br />\nJunior Editors<br />\nNumerous Bronzes<br />\n.<br />\nthese tubs as a saving .of space.<br />\nW. Purnell Hall, Jr.. '30<br />\nThe Measure of Oil Value<br />\nNumerous intricately designed<br />\nStewart L. Smith, '30<br />\n'29<br />\nDowell,<br />\nFoster<br />\nE.<br />\nPetting Party<br />\nng<br />\n•<br />\nincludi<br />\nshown<br />\nLeonard B. Nolley, '29<br />\nwere<br />\nbronze works<br />\nRehard G. Hunt,.31<br />\nCOMPANY OF N.<br />\nH. Garland Hershey, '29<br />\nSeveral life-size statues : lyere<br />\nHarwood F. Mullikin, Jr., '31<br />\nSTANDARD • OIL<br />\nan interesting set Of \"Epaulets\" or<br />\nPaul W. Spear, '30<br />\n•<br />\nIrving IC. Gordon, '29<br />\nthing seems to<br />\nn<br />\ncommo<br />\na<br />\nand<br />\n'31<br />\nfound<br />\nThey<br />\nDowell,<br />\n.pads.<br />\nr<br />\nH.<br />\n•<br />\nGeorge<br />\nGreek football shoulde<br />\nheadS. Dr.<br />\nCharles Harry, '31<br />\nwith leather and eon- be that the statues lack<br />\npadded<br />\nwere<br />\nTMENT<br />\nBUSINESS DEPAR<br />\nthat Philip'<br />\nfid designs on the Robinson suggested<br />\n-mined<br />\n- Business Manager ----have 'gone to the trinifile<br />\nbronze. Several tall vases . were 'army must<br />\nHARRY 0. Scinkss, JR., '29<br />\ng off the heads of all the<br />\n\"<br />\nshown which by thrir inscriptions of breakin<br />\nCirculation Manager<br />\n\"Friend of the Hopkins Man<br />\nAdvertising Manager<br />\nstatues. One group is shown of a<br />\n'29<br />\nthey<br />\nthat<br />\ned<br />\nMYERS,<br />\nindicat<br />\nROBERT<br />\ns<br />\nJ.<br />\npicture<br />\nand<br />\nusual<br />\nGsoacat M. GIARIER, '29<br />\nthe<br />\nwith<br />\ngirl<br />\nboy .and<br />\nAdvertising Staff<br />\nwere prizes 'from the Olympic Young<br />\nland<br />\nOfficio Staff<br />\nof head and it was called<br />\nAlvin H. Blum. '30<br />\nUnion Trust Company ofs. Mary<br />\ngames at Athens. One was distinct- absence<br />\nTheodore A. Fleishman, '31<br />\nParty.\" Several negro<br />\nBurke, '31<br />\nGus<br />\nPetting<br />\n\"The<br />\ncould<br />\none<br />\nas<br />\n,<br />\n'31<br />\nboxing<br />\nd,<br />\nfor<br />\nRothchil<br />\nly a prize<br />\nRandolph<br />\nJohn Lots, '30<br />\nShown and they resemble<br />\nTS<br />\nLeroy Shwas, '31<br />\nGeorge S. Robertson, '31<br />\ndistinguish readily the design of two heads are<br />\nCHARLES AND FAYETTE STREE<br />\nJohn A. Jantle•on, '30<br />\nof today. They were<br />\nnegro<br />\n.<br />\nthe<br />\npractice<br />\nSidney Rata '31<br />\nartful<br />\nmen engaged in the<br />\nprOgaidy slaves of that day.<br />\nBus\"<br />\nStaff Photographer<br />\nof self-defense. Interesting Coins of 'most<br />\nOn the Route °Like Charles Street<br />\nWALTER D. SCHEIDT, '30<br />\nThe ,evidence of the capture and<br />\nvarious hues and shapes were flashof<br />\nPhilip<br />\nby<br />\ns<br />\nOlympu<br />\n-'<br />\ned on the screen and it was explain pillaging of<br />\nLombard and South Streets,<br />\nPrinted by The Read-Taylor Company,<br />\nby the finding<br />\ned that over 1500 of • these were Macedonia is proven<br />\nBaltimore, Md.<br />\neach coAtatfound in the. vicinity. One horde of small sling stones,<br />\n.\" Some<br />\nof 35 was found in one place, un- ing inscriptions of \"Philip<br />\nned thenariCe<br />\n7Ontai<br />\n\"shots4<br />\nperson<br />\nsome<br />\nthese<br />\nby<br />\nd<br />\nof<br />\ndroppe<br />\ndly<br />\ndeitibte<br />\nwas discovered'<br />\nin falling under the ,fire of Phillip's of Chalcidice. It<br />\nheavier—Ind<br />\nbesieging horde. This attack by. that Philip's were.much<br />\ned for his<br />\nPhillip of Macedonia was interest- that fact probably account<br />\nstones, it<br />\nNo Deposit Required<br />\nproven by certain things victory. Some of 'these<br />\ningly<br />\nnts<br />\nTS!<br />\nlittle<br />\nned<br />\n:contai<br />\nGIVE TILL IT HUR<br />\ned,<br />\nwas<br />\nmention<br />\nThis<br />\nwas<br />\nof Johns Hopkins Univers4 Stude<br />\nfound in the territory.<br />\n\"Take<br />\nthese<br />\nas<br />\nin<br />\nsuch<br />\nwords<br />\nnt<br />\nassault<br />\nlecof trencha<br />\nphrases Of<br />\nshown towards the end of the<br />\nAST I?, through the medium<br />\nLight and LomBuicks<br />\nstudent body to give<br />\n-arrowheads<br />\ncolumns, we exhorted the members of the<br />\nture and Will be brought out later. that you!\" Several<br />\nbard Sts.<br />\nerection of<br />\nthe<br />\nfor<br />\ngn<br />\nalso<br />\ncampai<br />\nthe<br />\nwas<br />\nto<br />\nsupport<br />\nname<br />\nPhilip's<br />\nets<br />\nbearing<br />\nChevrol<br />\nSupply<br />\nboth financial and moral<br />\n6000<br />\nWater<br />\nPLaza<br />\nGood<br />\nexpendal and literary efforts<br />\na new cage. In spite of much oratoric<br />\nAmong the ruins of the Olympian found.<br />\n1723-25 N.<br />\ncolumns of this journal,<br />\nrs<br />\nthe<br />\nChrysle<br />\nin<br />\nand<br />\nm<br />\nplatfor<br />\nHall<br />\nE.<br />\nC.<br />\nDoctor<br />\nthe<br />\n,<br />\nof<br />\ned on<br />\nCharles St .<br />\nWe all. Wish to acclaim<br />\nhouses were found evidences<br />\nstudents. The lack,of underonly $5,250 has been subscribed by the<br />\nHupmobiles<br />\nTerra Robinson's talk one of,the most in- — Vernon 4049<br />\none<br />\nwhen<br />\nsystem.<br />\nzed<br />\nsupply<br />\nemphasi<br />\nwater<br />\ngood<br />\nfurther<br />\nis<br />\nse<br />\ngraduate interest in the enterpri<br />\n2402 Pennsy:<br />\nquota of $25,000 has been<br />\ncotta pipes were found in such po- teresting ever given at. Hopkins and<br />\nWillys-Knights<br />\nconsiders that'but one-fifth of the campus<br />\nvania Ave.<br />\ndein<br />\ns<br />\nkindnes<br />\nOlympthe<br />\nhis<br />\nfor<br />\nthat<br />\nhim<br />\nshow<br />\nto<br />\nas<br />\nthank<br />\nto<br />\nsitions<br />\nsubscribed.<br />\n2000<br />\nte<br />\nLAfayet<br />\nwas<br />\nfor subscriptions<br />\nians knew ,and employed the fact livering it.<br />\nAt the assembly last Thursday, the drive of student pledges.<br />\nBaltimore Concedes Milestone Supremacy<br />\nthe form<br />\nresumed with the collection of $300 in<br />\nthat water rises to its own level.<br />\nthe<br />\nng<br />\nattendi<br />\naduates<br />\nundergr<br />\nIn view of the fact that many of the<br />\nMany cisterns were also found. It<br />\nbeen solicited before by the<br />\nCommercial<br />\nNewspapers,<br />\nassembly were freshmen who had not<br />\nshould have<br />\nptions<br />\nbe added here that many of<br />\nmay<br />\nsubscri<br />\nof<br />\nnumber<br />\nthe<br />\nWork<br />\nthat<br />\nseem<br />\nBooks<br />\ncommittee it would<br />\na<br />\nof<br />\nvicinity<br />\nsigning<br />\none<br />\ner that the<br />\nthe coins found were in<br />\n_<br />\n.<br />\nbeen far greater. Students should remembte outlay of money. These<br />\n1880<br />\nhed<br />\nun,Establ.<br />\nfound<br />\npledge card does not necessitate an immedia three years in installments • and many Of them were<br />\nof<br />\nstruck, unlike the others bearing<br />\ncage pledges may be paidover a period<br />\nutor.<br />\ncontrib<br />\nThomas & Evans<br />\nual<br />\nindivid<br />\nthe<br />\nto suit the convenience of<br />\nbeautiful metal work of heads of<br />\nod has become a vital<br />\nunThese<br />\nday.<br />\nThis question of a gymnasium at Homewo<br />\nthat<br />\nof<br />\nmen<br />\ngreat<br />\ninPrinting Company<br />\nnever boasted of an<br />\nmatter. Baltimore, as everyone knows, has odate 'a large crowd of<br />\nstruCk- coins led the men to- suspect<br />\naccomm<br />\n-to<br />\nsize<br />\nnt<br />\nsufficie<br />\nof<br />\narena<br />\n1506-1508 Guilford Avenue<br />\ndoor sports<br />\nof Homewood which will<br />\nthat there was some sort of mint<br />\nfans. There is no hall in the neighborhood<br />\nBaltimore, Mcl.'<br />\ns<br />\nCarlin'<br />\nat<br />\nof<br />\nfloor<br />\nmolds<br />\nThe<br />\nMany<br />\nteam.<br />\nll<br />\n/district.<br />\nin • that<br />\nsuit the needs of a Hopkins basketba<br />\nto be ,<br />\ncarrtfgs<br />\nthe<br />\nfrom<br />\nfarlarnon 5691<br />\nwhich<br />\ntoo<br />\nis<br />\nPhone<br />\nyear,<br />\nfound<br />\nlast<br />\nwere<br />\nterra. cotta.<br />\nPark, which was used<br />\nn, the large sum paid out<br />\naccessible for practice Sessions. In additio the team on a profitable'<br />\ntheklheautiful<br />\nfor%)<br />\nto<br />\nused<br />\nwere<br />\nfor rent makes it almost impossible to finance<br />\n_<br />\nheads- which _ were<br />\n-_ Reodivirlacief A<br />\n.:<br />\nL\\t, ;.-,::<br />\nbasis.<br />\nadequate home court<br />\nten' Robinson inentiiined,thatthe had<br />\n:<br />\niCtd 'Clit to Oi<br />\neler,<br />\nThe proposed cage will not only provide an .the rather anemic<br />\nalso permit<br />\nof _these<br />\nfor the basketball squad, but<br />\nity to extend its pro- . cast .a head out of one<br />\nESTABIJOH- Eb ENGLISHI.UNIVERSITY<br />\nl'hysical Training Department of the Univers the R. 0. T. C. unit<br />\nfolind the result a piee.,<br />\nby<br />\nand<br />\nused<br />\nmolds<br />\nbe<br />\nwill<br />\ng<br />\nSTYLES, TAILOREO -OVER YOUTHFUL<br />\nbuildin<br />\nThe<br />\n.<br />\nactivity<br />\n• - gram of<br />\nplays<br />\ns,<br />\nConcert<br />\nior<br />\ne<br />\navailabl<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nof artistical work, and the figure<br />\nduring inclimate weather and will also be<br />\nand other student gatherings.<br />\nSERVICE I THC.UNITtLp STATES.<br />\nof dignity. These heads date<br />\nfull<br />\nNew<br />\nthe<br />\ngame,<br />\n<<br />\nbia<br />\ns-Colum<br />\nU. S. Army<br />\nAt a smoker, following the Hopkin<br />\nFort Robinson, Nebr.<br />\ns of the campaign on the<br />\nback to about 400 B. C. One peYork alumni will be informed of the progres<br />\n1928<br />\n29,<br />\nMay<br />\ngradinfluential body of<br />\nculiar looking ugly head was found Larus & Bro. Co.<br />\nHomewood campus. The attitude of this<br />\non the interest manid, Va.<br />\nuates toward the project will depend largelys of the proposed cage<br />\nwhich appears to lack all the beauty Richmon<br />\nGentlemen:<br />\nfested' by the undergraduates. If the sponsor enthusiastically sup'.<br />\n--Greek<br />\ng of champion long- time<br />\nSpeakin<br />\nother<br />\nare<br />\ns<br />\nwhich<br />\nry<br />\nstudent<br />\nsymmet<br />\nthe<br />\n•and<br />\ncan report to the alumni that<br />\nmembers of the EDGEWORTH Club,<br />\ncommittee to get subscrippossess. Finally, it was say:—itisn't how long you havesmoked<br />\nporting the drive, the news will assist the<br />\nworks<br />\nin-.<br />\nare<br />\nalumni<br />\nYork<br />\nEdgeworth, it's how well you have ention pledgs in Manhattan. But if the New apathetic interest; it<br />\nSuits MO,945 '50 Overcoats<br />\n•<br />\ncleaned out and found that inside joie I the smoke.<br />\nan<br />\nformed that the students are exhibiting only<br />\nes.<br />\nWhy,I have walked out of many a<br />\ngraduat<br />\nthe<br />\nof<br />\nwomul<br />\na<br />\nsupport<br />\nbeautif<br />\nhead of<br />\nthe<br />\nwas<br />\nto<br />\ng,<br />\nwill be a difficult task to win the<br />\ntravelin<br />\nwhen<br />\nly<br />\nespecial<br />\nstctre,<br />\nedge fund, fill out a<br />\none-horse town and buy<br />\nIf you have not, as yet, subscribed to the subscribed, increase<br />\nan. Probably some child had plas- stop at some<br />\nEdgeworth. A good pipe deserves<br />\npledge card immediately. If you have already<br />\nl<br />\norigina<br />\nthe<br />\nand<br />\nEdgeworth mine gets.<br />\nover<br />\nth,<br />\nEdgewor<br />\nhurts!<br />\ntered at random<br />\nthe size of your contribution. ,Give till it<br />\nI would not insult it with any other.<br />\nBY SPECIAL APPOINTMENT 14<br />\nhead and had produced the gro\"The familiar blue cans are everywhere,\" and usually you fiDd men of<br />\n•<br />\nOUR STORE IS THE<br />\none.<br />\ntesque<br />\ntaste carrying them, whicirproves it is<br />\nnot the price-that determines a good<br />\nThe Guilford 'Section<br />\nO'ER<br />\nIS<br />\nand<br />\nCare<br />\n\"smoky' tobacco, but the<br />\nTHE FIGHT<br />\nThat section of the city which method that produce it.<br />\nstruggling along the fraternity<br />\nI would rather go days without<br />\nresiwealthy<br />\nthe<br />\nFTER four weeks of strenuous<br />\nedly<br />\nundoubt<br />\nwas<br />\naway. In<br />\nEdgeworth and at the end draw a deep<br />\nwar front the smoke of battle is gradually driftingchanting of<br />\nnext.<br />\nof that cool \"smelly\" aroma,<br />\ninhale<br />\nshown<br />\nwas<br />\ndistrict<br />\ndential<br />\ng and<br />\nsome of the chapter houses, there is much rejoicin contentedly and<br />\nsatisfying to the last puff, than punish<br />\nback<br />\nOF BALTIMORE<br />\nThere were great wide streets, and my throat and lungs and nostrils with<br />\nhalleluiahs as nerve wracked upper classmen sit<br />\ntheir labor. To these<br />\ninferior grades.<br />\ninspect, with an air of satisfaction, the fruits of<br />\nlarge courts around' which the<br />\nth is \"The Smoke With a<br />\nother<br />\nthe<br />\nof<br />\nEdgewor<br />\nsome<br />\nFrom<br />\nlations.<br />\ncongratu<br />\nour<br />\noffer<br />\nfortunate souls we<br />\nThe character of the suits and<br />\nPersonality,\" like an old friend, you<br />\nand gnashing<br />\nhouses Were built. In digging down learn<br />\nto know and understand, and<br />\nstrongholds of brotherly love come sounds of wailing a satisfactory<br />\nsecure<br />\novercoats tailored by Charter House<br />\nyou have a<br />\ninto the floor of the rooms of these when troubled or when seek<br />\nof molars as the fraters lament their failure to are heavy laden, we<br />\nits sol\"thinky\" problem—you<br />\nwill earn your most sincere liking.<br />\ncrowd of pledges. To those who mourn and<br />\nhouses beautiful mosaics were un- ace and companionship.<br />\nseason.<br />\noffer our condolence with the hope of better luck next<br />\nyours,<br />\ntruly<br />\nVery<br />\nbeen<br />\nwhite<br />\nof<br />\nhas<br />\ned<br />\nMud<br />\nconsist<br />\nThey,<br />\n.<br />\nhistory.<br />\nin<br />\ncovered<br />\ndown<br />\nH.<br />\nE.<br />\nFulmer<br />\ngoes<br />\n(signed)<br />\nseason<br />\nAnother rushing<br />\nwater has<br />\nslung, theatre \"peanut galleries\" have been visited, soda have been<br />\nand blue stones with cement in bes<br />\nbeen sipped by the gallon, yards and yards of statistic have held<br />\ntween, forming intricate and beaualumni<br />\ntongued<br />\nsilver<br />\nBaltimore. Charles and Fayette<br />\nunfurled before the freshmen's eyes,<br />\ntiful designs and figures describing<br />\nExtra High Grade(<br />\nthe frosh spellbound with the force of their oratory.<br />\nthe<br />\ng<br />\nup<br />\ncleanin<br />\nbusy<br />\nare<br />\npledges<br />\nThe<br />\nnow.<br />\nthese<br />\nBut Ws all over<br />\nhistorical events. We see by<br />\nbooks<br />\nfraternity houses and the brothers are blowing the dust off their<br />\nfloors that we are dealing with a<br />\ng to study.<br />\n<br />\n2<br />\n<br />\nl\\GENSel TTER<br />\n<br />\n1111,10li1S<br />\n<br />\nof<br />\nthe<br />\n. arc]<br />\nai 1<br />\nC.<br />\nRol<br />\nan<br />\nkep<br />\nwitl<br />\nyea<br />\nin 1<br />\nof<br />\nThi<br />\nfsin,<br />\nuf<br />\n<br />\nESSO<br />\n<br />\nthe,<br />\nDr.<br />\nSabi<br />\nyea)<br />\nable<br />\nin tl<br />\nazici<br />\nand<br />\nsuch<br />\nsite,<br />\natter<br />\nditio<br />\ninter<br />\nthis<br />\ndenti<br />\nIn<br />\nRobi<br />\n-<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nswhoiw<br />\nhci<br />\nwoul,<br />\nassen<br />\n<br />\nL<br />\n<br />\ntv..)1•tai- olYv'<br />\nik<br />\not<br />\ncate<br />\n<br />\ntsewhrer7<br />\nn .t<br />\ntoiIfeoa<br />\n\"no<br />\nwas<br />\n<br />\nsett m<br />\no<br />\nin wl<br />\nlow-t<br />\nfd<br />\nspeak<br />\n<br />\nstay:o<br />\n<br />\nPM.<br />\n<br />\n,i5.<br />\n1en<br />\n1,Y(.r<br />\n,c11<br />\ning<br />\n<br />\nArmy Man finds<br />\nTobacco \"Like<br />\nOhl Friend\"<br />\n<br />\n'harteti<br />\n<br />\n• suma<br />\ning c<br />\nthe si<br />\nWas r<br />\n<br />\nhad I<br />\nwh<br />\nthisii-1<br />\nbe th<br />\nei<br />\net)va<br />\nOn<br />\nthe a<br />\n<br />\nuze<br />\no<br />\n<br />\ngfvo5ifo<br />\n<br />\nancie<br />\n<br />\nntcovetvery<br />\nbeen<br />\nfrom<br />\nsurfa<br />\nsameinter.<br />\nare b,<br />\n<br />\n•<br />\n<br />\nitrixter house<br />\n<br />\nA<br />\n<br />\nEdgeworth<br />\nSmoking Tobacco<br />\n<br />\n-<br />\n<br />\n1? Hub<br />\nlile\"Z4.'<br />\n<br />\nceid<br />\nne<br />\nwg<br />\n•<br />\nlive<br />\n<br />\nany<br />\nlayer<br />\nbelos<br />\nimph<br />\nmen<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 30, 1928<br />\n<br />\nDR. D. M. ROBINSON<br />\nADDRESSES ASSEMBLY<br />\n<br />\nFRANK'S.<br />\n<br />\nSIGN YOUR CAGE PLEDGE<br />\n<br />\nGives Illustrated Lecture on<br />\nExcavations<br />\n<br />\nLight Lunch<br />\n5 W. Twenty-first St.<br />\nOpen 9.30 A. M. to Midnight<br />\n<br />\nGWYNN LEASE<br />\nOrchestras of Distinction<br />\n<br />\nProducers of<br />\n<br />\nDESCRIBES EXPERIENCES<br />\n<br />\n'<br />\nTUTORING<br />\n<br />\nGnIE NEWS-LETTER<br />\n<br />\n1944 EDMONDSON AVENUE<br />\n<br />\nAlgebra—Geometry—Trigonometry<br />\n<br />\nSpeaker Did Resesirch Work<br />\nin Sabattical Year '<br />\nDoctor David Mpore Robinson,<br />\nof Johns Hopkins Faculty, one of<br />\nthe world's most famous figures in<br />\narchaeological research, spoke before<br />\na, large group of students in the<br />\nC. E. Hall last Thursday. Doctor<br />\nRobinson with the aid of slides and<br />\n_Tremendously important anthropa marvellously versatile deliverance<br />\nkept the assembly fairly entranted ological note. -- A freshman who<br />\nwith his description of his trip last lives in B entry, but whose name<br />\nyear to Greece and'his excavations must be withheld for reasons obviin bringing to light the hidden ruins ous to all who eat' in the Alumni<br />\nof the ancient city of Olympus. Memorial Hall, reports he has lost<br />\nThis trip; financed by a Baltimore six of his 131 pounds since -he<br />\nthrough the efforts came to liye 'here. A combination<br />\nfund,' obtained ;<br />\nof Doctor Yourtg of the Hopkins of circumstances is blamed.<br />\n. Medical School; was_tte: acme of<br />\nthe, wenderful research trips wIlich • When two' men 'run for President<br />\nDr. Robinson has taken during his of the United States, and at the<br />\nSabbatical period set aside every two same time two men run for one poyear's for this Work. The remark- sition on the Hall board of goverable_part of these excavations is nors, something—of great -political<br />\nin the fact that the location of this moment is almost certain to occur.<br />\nancient city had never been settled, They did and it did, the other night<br />\nand the Work .was carried on with in the Dorm.<br />\nsuch exactitude of research that the<br />\nCrammed with the 'technique to<br />\nsite. was struck exactly at the first<br />\nbe learned from the articles of Kent,<br />\nattempt. In the course of thexpeMencken and- Hyde, and filled with<br />\ndition 2,000 slides were taken of<br />\nthe sense of their solemn duty'<br />\ninteresting scenes to be shown in<br />\ngood residents, the students here.<br />\nthis country to history-loVing stuin the best electoral manner.<br />\n• -- acted<br />\ndents.<br />\nThe freshman bloc was out in force,<br />\nCertain Slides Taboo<br />\nan undergraduate;<br />\nIn introducing his subject, Doctor as usual, backing<br />\nunappreciated in<br />\nRobinson mentioned that certain but he, a prophet<br />\nhis own country, failed to. win the<br />\n- slides which he had planned on<br />\nof the upperclassmen away<br />\n*showing and certain interesting tales' support<br />\nfrom his graduate opponent.<br />\nwhich he had planned on -relating<br />\nA tie resulted on the first ballot,<br />\nwould have to be. excluded As the<br />\nassemblage contained several co-eds with the ba:lance of power held by a<br />\nwho had wandered in in search of tall dark horse. On .the secOnd<br />\nremaining<br />\nknowledge or perhaps merely oiis- vote, the freshman 1..7loc<br />\n• pany. The first set of slides showed solid, one candidate published a<br />\nthe territory, in the form of intri- platform which was followed immecate maps, in which the excavations diately by a victory. , It was:<br />\nwei't -carried on. There was also<br />\n\"CollP.ge life is an experiment noshown a 'map of the surrounding ble in purpose' and far reaching in<br />\nterritory of Macedonia and the site consequences. It must be worked<br />\nof a temple was pointed out where out constructively.- Therefore I ap\"no women were. allowed.\" There peal to you good men and true to<br />\nwas an evident uneasiness among elect me on my single plank of a<br />\nthe female section in the rear, bin quiet hour in the dormitories after<br />\nno movement to be sure. The next breakfast.\"<br />\nset of pictures showed the houses<br />\nIt was close even at that, but the<br />\nin which Dr. Robinson and his felprosperity ,and sanctity of the<br />\nlow-travelers resided during their<br />\nAmerican.Dormitory was effectivestay in the excavating district. The<br />\nly protected and preserved, to the<br />\nspeaker brought out the prevalence<br />\naccompaniment of thunderous huzof discomfort in these houses mainzahs.<br />\nly consisting of lack of heat and<br />\nchimneys and a multitude of \"ci•awlAs the national election draws<br />\ning animals\" which insisted on<br />\n\"crawling\"! into the wriing places. near, the disfranchised voter' living<br />\nin the Hall, who. will be detained<br />\nHopkins Co-Ed Shown<br />\ntheir native precincts on<br />\nAuaroosing incident was shown far from<br />\nelection day, axe -wondering what<br />\n'-oiext in the 'form of a co-ed,...pre,<br />\n-the excitement is all about.<br />\n..'suinahly a fair Hopkins student, he,<br />\nHaving at present no hotries,.they<br />\nbig carried over the river bed on<br />\nthe shoulders of a mighty Turk. It cannot become urfcluly enthusiastic<br />\nwas mentioned that the girls enjoyed over the learned Di-. Hoover's platithis practice very %yell. This river tudes on the American Home. Dehad to be crossed to reach the site tached from their own states, they<br />\nwhii'chi will believed by the party to are not greatly attracted by Pro-,<br />\nbe that uf Olyint4s. The site lies fessor Smith's plan for state enbetween.twO ill'Ils:\"ektending upward forcement of. the Eighteenth<br />\non each side. The nekt•set showed Amendment., Being for the Most<br />\nthe actual digging at the imagined part atheists—correct me if I am in<br />\nsite and then the triumphant dis- error here—they are not concerned<br />\ncovery. of Walls and roads,,and boles over fhi great religious issue in the<br />\nof grain, giving evidence of some. present campaign.<br />\nancient civilization. The actual digThe candidates, then, have nothging necessary, as brought out, was ing to offer the Dorm resident, exvery small, for most of the city had cept ,matter for reading at breakbeen buried only td the extent of fast. When, therefore, one of their<br />\nfrom one to two feet below .the own number stands for office on a<br />\nsurface. Deeper down Were found platform so soul stirring, so directinteresting stone implements which ly interesting as a \"quiet hour after<br />\nare believed to date back to the Stone<br />\nbreakfast\" one 'can readily underAge. These implements include<br />\ntheir enthusiasm. It touches<br />\nstand<br />\nloom<br />\nstones,<br />\nneedles, grain grinding<br />\nweight, and yarn spools. At this them, you see! it is something they<br />\nsame'depth was found ultra-primi- can uderstand ; it is fundamental.<br />\ntive stone idols which did not have like the sanctity of the American<br />\nany human shape. 17 the upper<br />\nHome.<br />\nlayer, that is the one to two feet<br />\n.below the surface, were found many'<br />\nWhich, according to one of our<br />\nimplements which convinced the<br />\nmost erudite professors, is perhaps<br />\nmen that they had found the city<br />\njust as well.<br />\nContinued on Page 2, Col. 8<br />\n<br />\nCOMMUNITY INN<br />\n<br />\nPLANTATION<br />\n<br />\npie, READ-TAYLOR co.<br />\n<br />\n-<br />\n<br />\nPhone GAmor<br />\n<br />\n• WILLIAM H. JOLLY<br />\n<br />\n2766 -pwynn<br />\n<br />\nLombard & South Sts<br />\n<br />\n6886<br />\n<br />\nOak Ave,<br />\n<br />\nTel. Woodlawn 276.W<br />\nA<br />\n<br />\nPhone CAlvert 5975<br />\n<br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths since 1857<br />\n<br />\nTHE CHARLES E. MYERS CO.<br />\nIncorporated<br />\n<br />\n(RUBBER STAMPS<br />\n<br />\nHOMEWOOD FIELD<br />\n<br />\nThe Service Shop<br />\n319 W. Redwood, St.<br />\n<br />\nNo Charge for Extra Passengers<br />\n<br />\nTHE SOUTHERN<br />\nHOTEL<br />\n<br />\nVERNON 1 2 1 2<br />\n<br />\nfor 'evening wear.<br />\n9<br />\n<br />\nAT<br />\n<br />\nManufacturer of<br />\n<br />\nDRESS SETS<br />\n<br />\n7 and<br />\n<br />\nYELLOW CAB STAND<br />\n<br />\nBaltimore's Newest<br />\n:-: and Finest :•:<br />\n\"A Hotel of Atmosphere<br />\n<br />\nEast Baltimore Street<br />\n<br />\n'PHONE<br />\n<br />\nFOR A<br />\n<br />\nYELLOW<br />\n<br />\nCAB<br />\n<br />\nand Environment\"<br />\n<br />\n-Diiih<br />\n<br />\n1 If<br />\n<br />\nPRIVATE SALE<br />\nof<br />\n<br />\ncilnlite-TashionedOxfonis<br />\n<br />\nMERCHANT<br />\nTugselfassurance and confidencethai<br />\ncorrect clothes and correct foot gear<br />\ngive are as vital for success in college<br />\nas in the business world. Nunn•Bush<br />\nAnkle-Fashioned Oxfords are built<br />\nto fit the ankle as well as the foot—<br />\nno gapping, no slipping at the heel.<br />\n<br />\nTAILORING '<br />\nTo Get Acquainted with the<br />\nBoys of<br />\n<br />\nShoes<br />\nfor<br />\nI en<br />\n<br />\nJOHNS HOPKINS<br />\nWe just bought a<br />\n<br />\ndon<br />\nTH E<br />\n<br />\nBOSTONW4S<br />\n<br />\nmill's overproduc,<br />\n<br />\nof woolens at a price that en,<br />\n<br />\nr<br />\n<br />\nDUTY aHofr<br />\n<br />\nables us to<br />\nvalue at<br />\n<br />\nCollar Hug Clothes<br />\nBait/morn<br />\ntthelyStieets<br />\n<br />\n$38.75<br />\n<br />\ngive 'you our .$38.75<br />\n<br />\n$28.75,<br />\nvalue<br />\n<br />\nand<br />\n<br />\nequals<br />\n<br />\nCollege Men!<br />\n<br />\nour , regular<br />\nany<br />\n<br />\n860.00<br />\n<br />\nsuit in Baltimore.<br />\n<br />\nCome In and Look Them Over<br />\n<br />\nIn style and quality \"Bostonians\"<br />\nequal the most expensive footwear<br />\nproduced today.<br />\nAnd the saving is a big item.<br />\n<br />\n1556<br />\nThe Whitehall<br />\nImported Black<br />\nScotch Grain.<br />\n<br />\n.<br />\n...IOW,<br />\n<br />\nWILLARD<br />\nTAILORING CORP.<br />\nFAYETTE Si'. AT HANOVER<br />\nFIRST FLOOR<br />\n<br />\nClub Lourige<br />\n<br />\nCigarettes<br />\n<br />\nMostly $7.50 to $10<br />\nExclusively in Baltimore<br />\n<br />\nBOSTONIAN<br />\nSHOE STORE<br />\n<br />\nFree Phone<br />\n<br />\n112 E. Baltimore Street<br />\n<br />\n6<br />\n<br />\n\"le/ rather have a<br />\nChesterfield!\"<br />\n<br />\n&We-a<br />\n<br />\nIt is considered the height of bad form, they<br />\nsay, to carry your own sandwiches to a tea—or<br />\nto pack your own blanket for the week-end—<br />\nbut luckily, no such outlandish conventions<br />\nsurround the smoking of your own cigarette.<br />\n\"I'd rather have a Chesterfield,\" fortunately,<br />\nis a phrase which not only remains \"good<br />\ncricket\" in polite circles—but at the same<br />\ntime brands the smoker as a person of rare<br />\n<br />\ndiscernment and excellent discrimination.<br />\nAnd small wonder, considering all the remark implies. Good taste, top quality, the rare<br />\nsparkle of tobacco goodness—all these combine<br />\nto justify the choice of that man who thus<br />\nshows his keen judgment.<br />\n\"I'd rather have a Chesterfield\"—a neat line,<br />\nthat—the mark of a real connoisseur and the<br />\npassword of six million smokers.<br />\n<br />\nIH ESIFIEVFI HUD<br />\nMILD enough for anybody.. and yet.. THEY SATISFY<br />\nLIGGETT ot sagasTobacco co.<br />\n<br />\n1<br />\n<br />\n\fOCTOBER 30, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br />\n<br />\nEIGHTY-THREE FRESHMEN PLEDGED<br />\nBY GREEKS ON RUSHING DAY<br />\nEighty-three men had been<br />\npledged by eleven fraternities when<br />\nthe NEWS-LETTER went to pressiast<br />\n-Monday afternoon. No reports<br />\nwere received from SigrueriTau Delta-and the Buccaneers. Delta.Gamma Theta pledged die most me ,<br />\nsixteen. The list is as follows:<br />\n<br />\nrSAUNDERS<br />\n,S It Yours<br />\n<br />\n, Beta, Theta Pi (5)<br />\nReeder<br />\n• 'Casey<br />\nGruver<br />\nSteel<br />\nCarter<br />\n<br />\nSYSTEM<br />\nUGILID<br />\nSTIAIPES<br />\n1-1AVIE<br />\nCONE<br />\n<br />\nPhone HOmewpod 7908<br />\n<br />\ncBirely's Pharmacy'<br />\nST. PAUL at .33rd STREET<br />\nTour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service '<br />\nMake Our Store Your Store<br />\n<br />\nTo Leavenworth<br />\nperhaps or,if you<br />\nprefer a southern exposure, to<br />\nAtlanta.<br />\nStripes for university men this<br />\nfall are subdued,<br />\nsoft rich bleeds<br />\nwhich savor of<br />\ngentility.<br />\n<br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br />\n<br />\nBraeburn has exactly expressed<br />\nthis spirit.<br />\nThe Newest<br />\n£35 $40 $45<br />\n<br />\nPlease Patronize<br />\nClothiers and Haberdashers<br />\n<br />\nOur<br />\nAdvertisers<br />\n<br />\n17 E. BALTIMORE ST<br />\n<br />\nPhi• Kappa Psi (§)<br />\nHurlock<br />\nDukehart<br />\nTippett<br />\nKump<br />\nCromwell<br />\nWatts<br />\nBrandau<br />\nConey<br />\nDelta Phi (7)<br />\nGoff<br />\nForbes<br />\nPassano<br />\nDevilliers<br />\nCrowther<br />\nReese<br />\nJackson, M.<br />\nPhi Gamma Delta (12)<br />\nBesore<br />\nWood, G. ,<br />\nFisher<br />\nKneit<br />\nBick<br />\nShirley<br />\nCochran<br />\nSharrets, K.<br />\nMietee<br />\nFrey<br />\nLukanitsch<br />\nCaldwell •<br />\nKappa Alpha t$)<br />\nBoedie<br />\nSkinner<br />\nHoffman. T.<br />\nSeipel<br />\nParr<br />\nDelta Gamma Theta (16)<br />\nGetting<br />\nO'Connel<br />\n<br />\nEvans<br />\nParks •<br />\nKjell<br />\nEagan, I..<br />\nHannock<br />\n•<br />\n•Du Val<br />\nhgooper<br />\nOrtman<br />\nStrong<br />\nJany<br />\nJohnson<br />\n• Pearce j<br />\nj Meidling<br />\n- Delhi Upsilon (6)<br />\nBradley<br />\nLevy<br />\nLinch<br />\nMiller •<br />\nPerkins<br />\nPerry<br />\nKappa Signia (8)<br />\nGray. 7--Gundry<br />\n, linden<br />\nMartin<br />\nOwings<br />\nRank<br />\nSaunders<br />\nSchmidt<br />\n•<br />\n.Alpha Tan Omega (55<br />\n. Barrett<br />\n'Whitby<br />\nQuick<br />\nLamont<br />\nNess, R.<br />\nAlpha Kappa Phi (2)<br />\nKrause, F.<br />\nElliott, J., ,<br />\nOmicron Kappa Omicron (5)<br />\n' Collier<br />\nDoellor<br />\nClark<br />\n'Donovan<br />\nMills<br />\nAlpha Delta Phi (4)<br />\nSnyder<br />\n* England<br />\nShreeve<br />\nLitchfield<br />\nSigma Tau Delta<br />\nXa report<br />\nBucaneers'<br />\nNo report<br />\n<br />\nCAGE COMMITTEE<br />\nTO MEET THURSDAY<br />\nImmediately 'after assemmeeting ad<br />\nbly Thursday a<br />\nCommittee<br />\nthe Cage Fund<br />\nE.<br />\nwill be held in the C.<br />\nare<br />\nHall. All members<br />\nimurged to be present, as<br />\nportant liustnts is to ht<br />\nbrought ur. The necessity<br />\neveryof the co-operation of<br />\none on the campus can not<br />\nbe overemphasized, as nothing can be done off the Cainpus until the support of the<br />\nstudents .is•guaranteed.<br />\n<br />\nBOOKS<br />\nBOUGHT, SOLD<br />\nEXCHANGED<br />\nand<br />\nPippen's Book Store<br />\n605 N. EUTAW ST.<br />\nAbove Franklin<br />\n<br />\nRA!<br />\nLyor<br />\n<br />\nPhone, CAL 1380 Home—HO. 2099<br />\nFRANCES T. BANNON<br />\nSuccessor to HARBAUGH es? BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nMaryland<br />\nBaltimore<br />\n<br />\nFRANK BROTHERS<br />\no<br />\nlinfrAvenue Boot Shop<br />\n1 and 48,12 SueettNew York<br />\nBer.een 4 ,<br />\n<br />\n•<br />\nand :<br />\ndistiriluished<br />\nstyle And<br />\n<br />\ntar<br />\n<br />\nFIDELITY AND DEPOSIT CO.<br />\nNf.:,yland<br />\n<br />\nFid.ehty and Surety Bonds<br />\nBurgla-iy and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nD. C<br />\n<br />\n-GR:—.:ND FLOOR. FIDELITY BLDG.<br />\nPhone PLaza 0800<br />\n<br />\nFETTING<br />\ncA.<br />\n. JEWELRY CO.<br />\nACTURING<br />\n,ckkNITF<br />\n<br />\nGreek Le:-.:er Fraternity Jewelry<br />\nNORTH CHARLES STREET<br />\n<br />\nStep Out From The Crowd!<br />\nBe an exception—Be a Successful Somebody<br />\nWith a Savings Account you are on the highroad<br />\nto succesa--Orportunity waits beyond.<br />\n<br />\nPARK BANK<br />\nLexington Street at Liberty<br />\nNorth Avenue at Charles<br />\nBelair Road at Southern<br />\n<br />\n4819<br />\n<br />\n\"When you see my new United Artists'<br />\npicture, 'The Woman Disputed,' you<br />\nwill notice that I smoke cigarettes in<br />\nseveral scenes.<br />\n\"Not wanting to show partiality to any<br />\none of the four leading brands, I decided<br />\nto make my choice via the blindfold test,<br />\nwhich I had heard Of many times<br />\nHappily, I picked OLD GOLDS.<br />\n\"I found the smooth, mild and delightfully cool ... Hereafter, when I am<br />\nrequired to smoke I shall naturally insist on OLD GOLDS. There's not a cough<br />\nin a film-fu!!\"<br />\n<br />\nbest kind<br />\nof<br />\nRoommate<br />\n<br />\ntendency to<br />\ngive this kind<br />\nof work better<br />\nmarks.<br />\nRemington Portable is the<br />\nrecognized leader in sales and<br />\npopularity. Smallest, lightest,<br />\nmost dependable, most compact standard keyboard portable. Weighs only 8 pounds,<br />\nnet. Carrying case only 4<br />\ninches high.<br />\nYou can buy it on easy<br />\n<br />\nREMINGTON RAND<br />\nBUSINESS SERVICE, INC.,<br />\n130 W. Fayette Street<br />\nBALTIMORE, MD.<br />\n<br />\nTo<br />\ndolpb<br />\nfirst<br />\nWith<br />\nthe 11<br />\ncalled<br />\nthe r<br />\nteam<br />\nwon<br />\nare fa<br />\nJaytni<br />\n<br />\npoweshowi<br />\ncry<br />\nstaff's<br />\nfar a:<br />\ning ti<br />\nthe b.<br />\nprogr<br />\nweeks<br />\n<br />\nFm<br />\nOrma<br />\neasy<br />\ning at<br />\nat SIN<br />\nclever<br />\nand it<br />\n- row I<br />\n<br />\nThe<br />\nbe. ter<br />\nthat t<br />\n1 Iopk<br />\n• action<br />\nBobb)<br />\na con.<br />\nteam<br />\ngreat<br />\nheld<br />\nknee<br />\nmond<br />\nan inj<br />\nthe F<br />\nfearet<br />\nLyons<br />\nwhen.<br />\nbut lc<br />\ncompl<br />\nHis inj<br />\nfcaret<br />\n<br />\nAs1<br />\nquart(<br />\nin tilt<br />\ngame<br />\n<br />\npayments.<br />\n<br />\nIkmington<br />\nPortable<br />\n<br />\nD,<br />\n<br />\nSo<br />\nponen<br />\nstreng<br />\nto all<br />\nsiStan<br />\nbeat P<br />\ndowrn<br />\nJohns<br />\nthey I<br />\nSons,<br />\nVirgis<br />\n<br />\nih<br />\n<br />\nRooming with<br />\na Remington<br />\nPortable adds<br />\nto the enjoyment of college life. It is always ready to help With your<br />\nwork. Long reports and<br />\ntheses can be turned out in'far<br />\nless time, as compared with<br />\nlaborious long-hand methods.<br />\nThen, too, think of the rester<br />\nneatness and legibility of typewritten work ! Any prof,<br />\nbeing human, will have a<br />\n<br />\nVOl<br />\n<br />\n1 II<br />\n<br />\none to the beat loved actresses in the<br />\nI.ntunno tor her 'riles in \"Camille\" and \"Mkt.\"<br />\n<br />\ni!• S.MA<br />\n<br />\nec,tun<br />\n<br />\nNORMA TALMADGE .. celebrated screen afar<br />\nOLD GOLDS on • scene from her lateat United A<br />\n<br />\nvehicle, \"The Woman Disputed.\"<br />\n<br />\n•<br />\n<br />\nsmoking<br />\n'starring<br />\n<br />\n0P. Lorillard<br />\n<br />\nCo., Est IMO<br />\n<br />\nMade from the heart-leaves of<br />\nthe tobacco Plant . . . that's the reason for<br />\ntheir honey-like smoothness ... and that's why<br />\nyou can pick them with your eyes<br />\nclosed.<br />\n<br />\nLin<br />\nHo,<br />\nHousi<br />\nLove<br />\nKegat<br />\nPowe<br />\nBerna<br />\nBialos<br />\nZimm<br />\nDever<br />\nMills<br />\nBesor<br />\nCapla<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXIII No. 9<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 30, 1928<br /><br />\nHOOVER-SMITH<br />\nWOMEN'S CLUB TO GIVE<br />\nDANCE<br />\nDEBATE THURSDAY \"- HALLOWE'EN<br />\nToniFht, in the<br />\nHall.<br /><br />\nPRICE 5 CENTS<br /><br />\nR. 0. T. C. DECREES-MUMBLING AS<br />\nSMITH'S HOMEWOOD VISIT<br />\nLATEST FALL FAD ON CAMPUS CANCELED AT LAST MINUTE<br />\n•<br /><br />\nHOPKINS LOSES TO<br />\nSWARTHMORE ELEVEN<br />\nSmith's -visit-to- the<br /><br />\nHe stepped sullenly from the people who folrowed him is he de,basement door of.Gilman Hall into scended to the lower drill field were Hopkins campus was canceled<br />\nat the<br />\nPass, Lyons to Zimmerman,<br />\nthe tunnel, walked to the south end, more than an accidental audience. last minute due to the excessive<br />\nGives Jays First Score<br />\nturned about,. and, with measured •Doubtless they were by curiosity or number of functions on his schedule.<br />\nSPEAKERS KEPT SECRET<br />\nstride made his way to the opposite even by the mysterious appeal of Dr. John H. Latane was- chairman HOWARD CAPLAN STARS<br />\n-end, his lips, opening at every step, fear impelled to go behind him.<br />\nNews-Letter Will Take Poll to<br />\nof the committee which had arbut no sound issuing from them. On the lower field, he picked lie ranged for the presidential nomi- Last Quarter Rally by Garnets<br />\nDetermine Campus Opinion<br />\nBeats Jays<br />\nThere he hesitated a moment, nearer. .of the defunct basketball nee's visit to the University.<br />\nThis week's assembly will be<br />\nwheeled around again, and once goals as his new starting point,<br />\nand<br />\nIt was expected that the DemoHopkins' football team lost to<br />\ndevoted to a political debate acmore directed himself toward the aWay he went, evenly, silently,<br />\nun- cratic candidate would come to Swarthmore last Saturday, 13-9,<br />\nsouthern opening, all the time hurriedly as before, and as before<br />\ncording to Donald Hiss, president<br />\nHomewood until Monday morning's making the third consecutive defeat<br />\nmarching at the same even gait, al- moving his almost quivering lips<br />\nof the Student Council. The perin, papers announced the sudden change for the Blue Jay eleven. Despite the<br />\nways moving his lips in the same was it in wordless prayer?<br />\nsonalities of the two candidates<br />\nSurely of plans which so mucfi disappoint- fact that the Jay team has dropped<br />\nsoundless manner.<br />\nfor the Presidency, Hoover and<br />\nsomething desperate was about to ed the ardent Smith supporters the last three contests, Hopkins'<br />\nArrived a second time at the take place. Theclitnax was about<br />\nSmith, will be discussed, and<br />\namong the -students and faculty. rooters who saw the game last Satsouth end, he, halted sharply and to occur. The tragedy was on<br />\nsome •of the more important isthe Rreparations had been made to re- urday were far from discouraged at<br />\nlooked back with an uncomprehend- eve, of befalling. Nerves<br />\nsues of the campaign will be gone<br />\nwere ceive the Governor and his party the showing made by the Black and<br />\ning, troubled expression. Then he drawn taut as his hand slid to his,<br />\nover. The prohibition issue is tp<br />\nin front of Gilman Hall, where Drs. Blue club,-,,<br />\nunhurriedly<br />\nup<br />\nthe<br />\nscrambled:<br />\nhill pocket, and his eyes scanned—sor- Latane, Goodnow<br />\nbe one of the main topics. Donand Ames were<br />\nA last-minute rally featured by<br />\nto the upper quadrangle,. and'made rowfully, it seemed—the ground he to welcome<br />\nald Hiss will preside during the<br />\nhim, and the R. 0. T. C. two long passes gave the -Garnet<br />\nfor the lone, big, gaunt tree half- had but now traversed.<br />\ndebate. -Each 'debator will be alUnit was to be lined up along the eleven their second and winning<br />\nway to the bowl. From it 'he startlowed twenty minutes in which<br />\nAs the hand came our of the sides of the quadrangle.<br />\nscore. It was during this fourth<br />\ned back toward Gilinan Hall, folto present his case and five minquarter rally that the Jay team dislowing a straight course. The same pocket, it drew with it—a notebook<br />\nutes,. for the rebuttal.<br />\nplayed a remarkable amount of powuniform -step, the same moving but and a pencil r With these hewrote<br />\nSurprise Attack<br />\ner which indicates good chances for<br />\na word or two, and then quickly disunspeaking<br />\nSlimly,<br />\nlips.<br />\nalmost<br />\nThe speakers have not been an- Retirement Marks End of 28<br />\nfinishing out the remaining four<br />\ncarefully, he mounted the first three appeared acrOss the campus, all his<br />\nYears at Teaching<br />\nnounced as yet, each party keepformer slow and puzzled bearing<br />\ngames in a creditable manner.<br />\ning its plans from the other in<br />\nDr. Frank Morley has formally or four steps leading from the cam- gone. The disappointed onlookers Famous Behaviorist Psychologist<br />\nLyons to Zimmerman Scores<br />\norder to 'spring a surprise attack retired as head of the mathemat- pus to the piazza- in front of the were<br />\nWill Attract Many<br />\nleft to their own explanations.<br />\nHopkins' first score came early in<br />\non its opponent. The Republicans ics department at the Johns Hop- portico. Faltering upon one of<br />\nthe first quarter on a pass from<br />\nare sending to Washington for kins Unive ity and has been ap- them, he turned about and stood ir- (Editor's Note: Last week the<br />\nHopkins students are given an Lyons to Zimmerman.<br />\nThe pass<br />\ntheir champion, while the Demo- pointed as ofessor emeritus of resolutely for, some minutes rather sophomore R. 0. T. C. classes had opportunity to hear Dr. John B. was<br />\nas well executed, both on the<br />\nthe<br />\nback<br />\ntree<br />\nupon<br />\ntheir-practical<br />\ngazing<br />\nintently<br />\nexercises<br />\nin<br />\nrange<br />\nesfighting<br />\ncrats,<br />\nfire with fire, say mathematics. This retirement<br />\nWatson,'father of \"Behaviorism,\"<br />\ntimation over level and rolling at a special price of fifty cents, passing and receiving end, as one<br />\nthey \"can match any man the Re- marks the end o 8 years at act- from which he had just come.<br />\ncould wish to see. Lyons dropped<br />\nanyone<br />\nhim<br />\nseeing<br />\ntime<br />\nBy<br />\nthis<br />\nground.'<br />\nThe<br />\nNEWS<br />\n-LETTER,<br />\nir.<br />\npublicans produce.\" Al Smith ive teaching and re arch spent at<br />\nwhen he lectures at the Alcazar the ball into Zimmerman's hands<br />\non<br />\nconvinced<br />\nbeen<br />\nprinting<br />\nsurely<br />\nhave<br />\nwould<br />\nthis<br />\naccount,<br />\nassumes<br />\nnc<br />\nsupporters_olaim that the.. Gover- this university. Thr ghout this<br />\non November 12, at 8.15 P. M. the five-yard line<br />\nand with a few<br />\nnor's visit,. to the campus has period he has acted a editor of that he was a maniac and ought to responsibility for the veracity of the The address, which is sponsored steps the lank Jayman<br />\nwas over the<br />\ngained hint the victory among the American Journal, o Mathe- be watched. Perhaps then those story.)<br />\nby the Baltimore District, Child line for Hopkins' first score.<br />\nHopkins men. The friends of matics -and has made v uabfe<br />\nStudy Association, is on the topic<br />\n• The aerial combination of LyonsDebating Council To<br />\n\"The Social and Ethical ImpliHerbert Hoover deny this, -claim- 'contributions toward the adv nee Musical Club Looks<br />\nto-Zimmerman has been,working excations<br />\nof<br />\ning that iii spite of Smith's alleged )f his subject.<br />\nBehaviorism.\"<br />\nForward To Big Year<br />\nBe Given Dinner<br />\n.<br />\nceedingly. well and._by the time „St.<br />\n-Victory among the faculty the Re- His ability as a geometrician is<br />\nDr. Watson is said to be the John's comes to Homewood things<br />\ngoing<br />\nhave<br />\nbeen<br />\nthings<br />\nThe<br />\nway<br />\nNorman.<br />\nB.<br />\nGardiner,<br />\nJr.,<br />\nwho<br />\npublican sentiment at Homewood universally recognized and remost widely discussed phychol- should be happening along those<br />\nis as overwhelming_as the major- spected. He is a former presi- with the Musical Club it -seems as was head of last year's Debating ogist of the day, and the large lines which<br />\nwill give the Annapolyear.<br />\nBen<br />\na<br />\nbig<br />\nare<br />\nout<br />\nif<br />\nfor<br />\nthey<br />\nCouncil;<br />\nas<br />\nwell<br />\nas<br />\nmanaging<br />\nedities received by the G. 0. P. in dent of the American Mathematcirculation of his books is urged itans something to think about.<br />\nthe last two presidential electioria. ical Society, a fellow of the Amer- Kolb, who is heading the club this itor of the NEWS-LETTER, is giv- in substantiation of this claim.<br />\nAfter the first score the game<br />\nyear, infoins us that on Thursday ing a dinner at his home in RiderHis premisi, to quote from infot- lapsed<br />\nMeanwhiletThe undergraduates ican Association of Arts and Sciinto a kicking duel between<br />\nnight they had the biggest turnout wood-tonight to the members of<br />\nmation supplied by the associa- the two<br />\nare doing their best to settle the ences, and a member of the Amerpunters, neither side havin the .history of the organization. this year's Debating Council. The<br />\ntion, \"is that a child comes into ing a noticeable<br />\nissue prematurely. The News- ican Philosophical Society, Lonadvantage, until the<br />\nSeventy fellows showed up for the purpose of this dinner is to. orthe world provided with no tem- end of the half.<br />\nLETTER is being shaken by inter- -don Mathematical Society and<br />\nSoon after the berehearsal! Kolb put the boys ganize the men elected to the<br />\nperamental or mental instincts, ginning of the<br />\nnal dissention. . The business Palermo Circolo Mathematico.<br />\nfinal half the Swarththrough two pieces.and.oyas pleas- Council last. spring.<br />\nand that all such are created and more outfit tore its way<br />\nstaff threatens to insert a full In collaboration with Professor antly surprised to ffitd• some very<br />\nthrough the<br />\nA very attractive -schedule is instilled in him:\"<br />\npage adverlisement for Smith if James Harkness, Dr. Morley has fine Material among the crowd. The<br />\nJay eleven and aided by a long pass<br />\nthe editorial department doesn't written several treatises on the numbers they are planning to use being arranged, including many The doctrine is said to attract suc,c6eded in putting the ball over<br />\nstop making articles so pro-Hoov- \"Theory - of Functions\" and 'has exclusively this Year are: Kipling's out-of-town trips. The Council some as insistently as it repels which, after McGuire's excellent<br />\ner. The editors replied to this been engaged for some time in \"Recessional Ode,\" put to music by shall soon issue a call for candi- others. Dr. Watson is now lec- kick, made the score 7-6 in favor of<br />\nwould writing a book on inversive ge- Reginald De Koven ; the \"Heidel- dates for the Freshman and turer at the New York School for Swarthmore.<br />\nthey<br />\nthat<br />\nultimatum<br />\nSophomore teams. ,The annual Social Research and editor 'of the<br />\nthrow out the ad in question ometry.<br />\nhurg Song,\" from the \"Prince of<br />\nDIMINITINIUZ for Lyons<br />\nwhen pasting up the dummy. The Professor Morley was born at Pilsener,\" and \"Deep River,\" bv debate between these two classes Journal of Experimental PsycholAt this point Lyons was removed<br />\nnorth side of Gilman Hall is the Woodbridge, Suffolk, England, Harry C. Burleigh, the famous ne- will take place some time in the ogy. , His hooks include \"Psy- from the game, Ashton<br />\nDevereaux<br />\nRepublican headquarters on the September 9, 1869. He received gro spiritualist. The club has been near future.<br />\nchology from the Standpoint of taking his place at quarter.<br />\nSwarthcaitipus, for there Dr. Vs ilfough- his B. A, M. A., and D. Sc. from fortunate enough to secure as direcFor the last two years the Frosh- the Behaviorist,\" \"Behaviorism,\" more kicked to Hopkins and soon<br />\nFrom<br />\nCambridge.<br />\nCollege,<br />\nKings<br />\nd<br />\ne<br />\n-Sithe<br />\nsouth<br />\n-by holds sway. On<br />\ntor the services of Osmar Stein- Soph debates have been won by the \"Psychological Care of Infant and after a long pass, this time to<br />\n• Dr. Latane.• and his fellow Vir- 1884 to 1888 he was on the staff wald.. Llewellyn will again sing the present Junior class. The Sopho- Child,\" and \"Ways of Behavior- Htunie Houston, put the<br />\nball on.the<br />\n.In<br />\nEngland.<br />\nCollege,<br />\nginians hold a Democratic earn- of Bath<br />\nmores of this year will attempt to ism.\"<br />\nPennsylvanian's 20-yard line. Sevpaign headquarters. Due to the 1888 he became professor of math,<br />\novercome last year's set-back by de'<br />\neral<br />\nrushes<br />\nwhich<br />\nnetted the Jays a<br />\nThe reduced rate tickets may<br />\nIn_ acid iti, _tO___Iast year*.s1trips<br />\nfd-ct that Dr:-Willoughby's-offteelema Lk, at II.,ei foi d-Cvllege, refeating the yearlings\"' this season.<br />\nfirst down were followed by a beauuntil 1900, when he the boys are planning to give con- Among those tnemars of the lass be obtained by students of the tiful kick by<br />\nfaces on the front while the Pro- nmaiiig<br />\nHoward Caplan which<br />\ncerts at both Goucher and the Maryfessor of -American History only entered upon his duties at Hopof '30 who participated in the de- university from the Library of made the score 9-7 in the Black<br />\nland College for Women. These<br />\nhas a side corridor, the elephant kins.<br />\nbate last year were Paul Spear, and Education, on the first floor of and Blue favor.<br />\nconcerts will probably be followed<br />\nis considered to have an edge The Mathematics department<br />\nDal Ghent.<br />\nGilman Hall.<br />\n•<br />\nThe fourth quarter, in which the<br />\n• loss by dances. over the donkey. Meanwhile the at Johns<br />\nand<br />\nGarnets snatched victory, was full<br />\nfar<br />\nlooked<br />\nhas<br />\n'Strange<br />\nto<br />\nfew<br />\nsay,<br />\nfootand<br />\nquite<br />\na<br />\n\"Y\" office is Socialist headquar- ke<br />\nHOPKINS<br />\nALUMNUS<br />\nRISES<br />\nHIGH IN<br />\nof exciting<br />\nters, with Mr. Schaal having a ide for additions to the depart- ball men are out for this activity.<br />\nA fumble reCHOSEN PROFESSION IN- THIS CIT1 covered by moments.<br />\nAccording to latest reports Swarthhard time holding out agains a ment. They ,beeergnally selec<br />\nBesore, a 25-yard run<br />\nre's been blown to Hell! Rather<br />\n, strongly Republican \"Y\" ca net. Dr. John Williamson of St. AnFormer Hopkins men have, gone \"It's a long day though,\" said by—kktplaris a blocked punt' by<br />\ndrews College, Scotland, and Dr. a \"You can go more than twenty far and wide—Morton Hamburger, Croll to<br />\nA Heat Ten<br />\nthe NEWS-LETTER reporter, ,TWarthmore, two beautiful passes<br />\nThe voices of the e gineers Oscar Zariski of the University 'les on a gallon—use Carbona\" af- Enoch Light, and Bill Rodgers have \"we get on the field at about sixby the Garnets, another fumble by<br />\nfloat out across the road as they of Rome, Italy. Both have ac fair for some of Swarthmore's reg even gotten as far as Paris. But,a thirty in the morning and don't<br />\nHopkins, and a 23-yard run by<br />\nulars<br />\nwill<br />\nswear<br />\nthat<br />\ntwenty<br />\nmiles<br />\nis<br />\ncall.<br />\nthe<br />\nthe<br />\ncepted<br />\nof<br />\nmen<br />\ni<br />\nthe<br />\ndiscuss<br />\nwarmly<br />\nformer member of the Class of '29 leave until dark. We make long<br />\na minimum distaice.<br />\ntwo candidates. After a they<br />\nhas \"gone higher\" than any billion flights to New York, Philadelphia, Swarthmore, provided all the excite. *.<br />\nsay, Teapot Dopte and<br />\necial JtaSer:firtained<br />\nIt seems that the unemployed stu- without leaving Baltimore. His Washington, and the South, and two ment and gave the Pennsylvanians<br />\nnothingon the<br />\nmany<br />\nFans dents on the campus had to play with name is Lockman Croll and he's classes of shorter ones. Flights of their second and winning score.<br />\nFor Football<br />\n•<br />\nstunt that the Arts and Science<br />\nfire, they just would have bonfire entefed the field of commercial avi- the first class are about seven minLine-up:<br />\nrates have been obseniors tried to pull off on the Special<br />\nand have a real hot time. They did ation.<br />\nutes in length and we charge three<br />\nHotel<br />\nCommodore<br />\nthe<br />\nat<br />\ntained<br />\nHopkins<br />\nSwarthmore<br />\nthree-year engineers in the class<br />\n—until<br />\nsome<br />\nhappy<br />\nsoul<br />\ntossed<br />\na<br />\nAbout a year ago \"Lock\" became dollars. The second class or 'five Houston<br />\nfor those- who go to New York<br />\nL.E<br />\nHeward<br />\nwhole can of gasoline right into the<br />\nelection. But for the-moment<br />\ndollar<br />\nflight'<br />\nincludes<br />\na<br />\nfifteen<br />\nminCothe<br />\nsee<br />\nto<br />\none of the chief stockholders in the<br />\non the special car<br />\nL.T<br />\nKeefer<br />\nthe feuds between \"mechanicals, lumbia game on Nov-ember 10. All middle of the fire, where strange to Park Heights Avenue Flying ute trip over the University, Sta- Love ..,<br />\nTobin<br />\nL.G. (C.) Hallowell<br />\nelectricals and \"AB's\" are forgot- those who wish to go should see say it exploded and, -oh well, pick School, Inc., on Park Heights Ave- dium, and Guilford.<br />\nMcFeely<br />\nten as the \"practical minded men\" Purnell Hall at the barn at 12.20 up the pieces. Their star player on nue and Seven Mile Lane. Today \"An aviator really needs a sense Strader (Capi.).0<br />\nR.G<br />\nllockth<br />\nenthusiastically apply \"a heat any day ,before November 5. If the football team was --picked up he is secretary-treasurer and chief of humor to get along,\" he added. kegan<br />\nDellmuth<br />\ntest\" to the political situation. sixty men have not paid by that thirty feet away, his clothes blazing mechanic of the corporatir which On one flight Lieutenant Melamet Bialoskorsky ....R.T<br />\nthe trip will have to be and his face and hands burned.'The boasts of two Challenger planes and stopped his motor in order to talk to Zimmerman<br />\nR.E<br />\nHaviland<br />\nThe NEws-Lerree, in 'order to time,<br />\na passenger. The man turned pale<br />\ncalled off, as the Athletic AssoTestwide<br />\nQ.B<br />\nsettle the dispute and determine ciation will not be responsible in bystanders put out the flames and a most' encturaging volume of busi- when the roar of the propeller Lyons<br />\nMcDarmond<br />\n„F.B<br />\npublic opinion at Hopkins, is go- this case. If the trip proves a rescued the man.. Many other squad ness. The president and chief pilot ceased and yelled hoarsely, \"For Caplan<br />\nH.B<br />\nAtkinson<br />\nGod's sake, can't you get her started Lang<br />\n6i/to hold a poll of those attend- success, the same thing will be members were hurt as well a,: per- is Lieutenant Otto Melamet,<br />\nBesore<br />\nBarnes<br />\nH.B<br />\nWorld War veteran.<br />\nagain?\"<br />\ndone for all the games next year. fectly common collegians.<br />\ning the assembly.<br />\nPersonalities of Candidates and<br />\nIssues to Be Discussed<br /><br />\nthe Women's Club of the<br />\nUniversity will hold a dance<br />\nin celebration of Hallowe'en.<br />\nThe Blue Jay Orchestra will<br />\nstart rendering the music at<br />\n9 P. M.; the admission will<br />\nbe $1 per couple and 50 cents ,<br />\nstag.<br />\nThe dance is to be a costume affair, significant ot the<br />\nOccasion, while the C. E.<br />\nHall will correspondingly<br />\ntale on the appearance of an<br />\nautumn scene.<br />\nAlthough sponsored by<br />\nthe Women's Club, the<br />\ndance will be given for the<br />\nenjoyment of all,students<br />\nand their friends.<br /><br />\nDR. MORLEY RETIRES<br />\nAS MATHEMATICS HEAD<br /><br />\nDR. JOHN B. WATSON TO<br />\nLECTURE ON NOV. 12<br /><br />\n1928<br />\n-LETTER, OCTOBER 30,<br />\nTHE JOHNS HOPKINS NEWS<br /><br />\nCAMPBELL<br />\nlux-FORDYCE E. C.<br />\npeople who were accustomed to<br />\nDR. ROBINSON<br />\nALUMNUS<br />\nideal<br />\nan<br />\nhave<br />\nWe<br />\nS<br />\nbeauty.<br />\nHOPKIN<br />\nand<br />\nGIVES LECTURE ury<br />\nof<br />\n,Insurance<br />\ncity in its best age. Private life<br />\nAll Lines ofl<br />\nContinued from Page 3, Col. 1<br />\nunPLaza 1062<br />\nthese people had never _Dem<br />\nPhone,<br />\nwere<br />\nlamps<br />\n+oil<br />\nCrude<br />\nof Olympus.<br />\nof<br />\nfolded before. Now by means<br />\nfound and beautiful vase fragments<br />\nFOUNDED 1897<br />\nions we may delve into<br />\nexcavat<br />\nthese<br />\nciv.high<br />\n'just<br />\n.pointing towards a rather<br />\ntheir very homes and find out<br />\n$2.00<br />\nINTERIOR WOOD WORK<br />\nilization. Beautiful statuettes were<br />\nSubscription<br />\nlived. We find in sotile<br />\ntheY<br />\nhow<br />\nin<br />\ninches,<br />\ntwo<br />\nATIONS<br />\nmerely<br />\nDECOR<br />\nin<br />\nce<br />\nSome<br />\nPostoffi<br />\nfound,<br />\nthe<br />\nfine<br />\nat<br />\n,<br />\nof<br />\n3,1909<br />\ner<br />\nhomes -an. musu 1 amount<br />\nEntered ps second-class matter Decemb<br />\nNovember 3,4879.<br />\neigIit -aud-made-ottere_<br />\nin some,<br />\nBaltimore, Md., under Act of Comp ess<br />\nSONS •<br />\ncotta art wcgksf We find<br />\nterra<br />\nof<br />\nds<br />\nhundre<br />\nalso<br />\nJOHN C. KNIPP &amp;<br />\nwere<br />\nJohns<br />\nof<br />\n'Art—that of<br />\nby the students<br />\nne<br />\nJune<br />\nByzanti<br />\nto<br />\nof<br />\nOctober<br />\ndeuces<br />\nfrom<br />\nekly<br />\nsemi-we<br />\nPublished<br />\nand women shown:<br />\nmen<br />\nof<br />\ns<br />\nmasque<br />\nor winged lions usually<br />\nHopkins University.<br />\nFURNITURE<br />\nart had to' be very the griffins<br />\nare<br />\nR, These'vYorks of<br />\ncarrying off some prey. We<br />\nbe addressed to the BUSINESS MANAGENG<br />\nany<br />\nprevent<br />\nto<br />\nas<br />\nSo<br />\nBusiness communications should<br />\n'dug<br />\nMANAGI<br />\nly<br />\nthe<br />\nto<br />\ncareful<br />\ne<br />\narticles should be sent.<br />\nBALTIMORE, MD<br />\neven acquainted with the intricat<br />\nJohns Hopkins University. All<br />\nEDITOR-IN-CHIEF.<br />\ninjury to the statue. Evidence of<br />\nWe<br />\nEDITOR; other communieations to the<br />\nFactory.<br />\nliving habits he these people.<br />\nis<br />\nvanity<br />\ns<br />\nwoman'<br />\nnown<br />\ntile well-k<br />\n600 S. Pulaski Street<br />\nUniversity 0100<br />\nShow Rooms<br />\nfind in one room of a large house,<br />\nul<br />\nbeautif<br />\na<br />\nof<br />\nform<br />\nshown in the<br />\nbe<br />\nTelephone<br />\n343 N. Charles Street<br />\nsmall bath-tubs which had . to<br />\nlittle vanity lox containing beauin a sitting -position. One<br />\ned<br />\nemploy<br />\ncover.<br />\nthe<br />\non<br />\ntiful work in refuge<br />\nEDITORIAL DEPARTMENT<br />\nof the fair co-eds is shown sitting<br />\nIt was,brought' out here that the in one and seeming to enjoy herEditor-in-ChiAt<br />\nGEORGE E. BAN x§,—Itt.., '29<br />\nmen Shown 'digging among the self enormously. There' are imNEW LIFE<br />\nAssistant Managing Editor<br />\nruins-were refugees and were paid pression; at the bottom of the tub<br />\nFOR MOTORS<br />\nTHE GIANT<br />\nManaging Editor<br />\n40<br />\nGUMP,<br />\nwere<br />\nGEOVE<br />\nmen<br />\nThese<br />\n.<br />\nday.<br />\na<br />\n'29<br />\nFUEL<br />\npre40 cents<br />\nPOWER<br />\nPHILIP W. Ness,<br />\nthe feet. possibly to<br />\nplacing<br />\nfor<br />\ngrateful to get the work and. the vent slipping. A humorous suggesAssociate Editors<br />\nRICHARD H. WOOD, '29<br />\ning was in this way doubly<br />\nexcavat<br />\nWILMER H. DRIVER, '29<br />\ntion by Dr. Robinson was that mod\"STANDARD\" MOTOR OIL<br />\nROBERT S. BAIRD, '30<br />\nadopt<br />\nI eneficial to humanity.<br />\nreally<br />\n.<br />\nshould<br />\nents<br />\napartm<br />\nern<br />\nJunior Editors<br />\nNumerous Bronzes<br />\n.<br />\nthese tubs as a saving .of space.<br />\nW. Purnell Hall, Jr.. '30<br />\nThe Measure of Oil Value<br />\nNumerous intricately designed<br />\nStewart L. Smith, '30<br />\n'29<br />\nDowell,<br />\nFoster<br />\nE.<br />\nPetting Party<br />\nng<br />\n•<br />\nincludi<br />\nshown<br />\nLeonard B. Nolley, '29<br />\nwere<br />\nbronze works<br />\nRehard G. Hunt,.31<br />\nCOMPANY OF N.<br />\nH. Garland Hershey, '29<br />\nSeveral life-size statues : lyere<br />\nHarwood F. Mullikin, Jr., '31<br />\nSTANDARD • OIL<br />\nan interesting set Of \"Epaulets\" or<br />\nPaul W. Spear, '30<br />\n•<br />\nIrving IC. Gordon, '29<br />\nthing seems to<br />\nn<br />\ncommo<br />\na<br />\nand<br />\n'31<br />\nfound<br />\nThey<br />\nDowell,<br />\n.pads.<br />\nr<br />\nH.<br />\n•<br />\nGeorge<br />\nGreek football shoulde<br />\nheadS. Dr.<br />\nCharles Harry, '31<br />\nwith leather and eon- be that the statues lack<br />\npadded<br />\nwere<br />\nTMENT<br />\nBUSINESS DEPAR<br />\nthat Philip'<br />\nfid designs on the Robinson suggested<br />\n-mined<br />\n- Business Manager ----have 'gone to the trinifile<br />\nbronze. Several tall vases . were 'army must<br />\nHARRY 0. Scinkss, JR., '29<br />\ng off the heads of all the<br />\n\"<br />\nshown which by thrir inscriptions of breakin<br />\nCirculation Manager<br />\n\"Friend of the Hopkins Man<br />\nAdvertising Manager<br />\nstatues. One group is shown of a<br />\n'29<br />\nthey<br />\nthat<br />\ned<br />\nMYERS,<br />\nindicat<br />\nROBERT<br />\ns<br />\nJ.<br />\npicture<br />\nand<br />\nusual<br />\nGsoacat M. GIARIER, '29<br />\nthe<br />\nwith<br />\ngirl<br />\nboy .and<br />\nAdvertising Staff<br />\nwere prizes 'from the Olympic Young<br />\nland<br />\nOfficio Staff<br />\nof head and it was called<br />\nAlvin H. Blum. '30<br />\nUnion Trust Company ofs. Mary<br />\ngames at Athens. One was distinct- absence<br />\nTheodore A. Fleishman, '31<br />\nParty.\" Several negro<br />\nBurke, '31<br />\nGus<br />\nPetting<br />\n\"The<br />\ncould<br />\none<br />\nas<br />\n,<br />\n'31<br />\nboxing<br />\nd,<br />\nfor<br />\nRothchil<br />\nly a prize<br />\nRandolph<br />\nJohn Lots, '30<br />\nShown and they resemble<br />\nTS<br />\nLeroy Shwas, '31<br />\nGeorge S. Robertson, '31<br />\ndistinguish readily the design of two heads are<br />\nCHARLES AND FAYETTE STREE<br />\nJohn A. Jantle•on, '30<br />\nof today. They were<br />\nnegro<br />\n.<br />\nthe<br />\npractice<br />\nSidney Rata '31<br />\nartful<br />\nmen engaged in the<br />\nprOgaidy slaves of that day.<br />\nBus\"<br />\nStaff Photographer<br />\nof self-defense. Interesting Coins of 'most<br />\nOn the Route °Like Charles Street<br />\nWALTER D. SCHEIDT, '30<br />\nThe ,evidence of the capture and<br />\nvarious hues and shapes were flashof<br />\nPhilip<br />\nby<br />\ns<br />\nOlympu<br />\n-'<br />\ned on the screen and it was explain pillaging of<br />\nLombard and South Streets,<br />\nPrinted by The Read-Taylor Company,<br />\nby the finding<br />\ned that over 1500 of • these were Macedonia is proven<br />\nBaltimore, Md.<br />\neach coAtatfound in the. vicinity. One horde of small sling stones,<br />\n.\" Some<br />\nof 35 was found in one place, un- ing inscriptions of \"Philip<br />\nned thenariCe<br />\n7Ontai<br />\n\"shots4<br />\nperson<br />\nsome<br />\nthese<br />\nby<br />\nd<br />\nof<br />\ndroppe<br />\ndly<br />\ndeitibte<br />\nwas discovered'<br />\nin falling under the ,fire of Phillip's of Chalcidice. It<br />\nheavier—Ind<br />\nbesieging horde. This attack by. that Philip's were.much<br />\ned for his<br />\nPhillip of Macedonia was interest- that fact probably account<br />\nstones, it<br />\nNo Deposit Required<br />\nproven by certain things victory. Some of 'these<br />\ningly<br />\nnts<br />\nTS!<br />\nlittle<br />\nned<br />\n:contai<br />\nGIVE TILL IT HUR<br />\ned,<br />\nwas<br />\nmention<br />\nThis<br />\nwas<br />\nof Johns Hopkins Univers4 Stude<br />\nfound in the territory.<br />\n\"Take<br />\nthese<br />\nas<br />\nin<br />\nsuch<br />\nwords<br />\nnt<br />\nassault<br />\nlecof trencha<br />\nphrases Of<br />\nshown towards the end of the<br />\nAST I?, through the medium<br />\nLight and LomBuicks<br />\nstudent body to give<br />\n-arrowheads<br />\ncolumns, we exhorted the members of the<br />\nture and Will be brought out later. that you!\" Several<br />\nbard Sts.<br />\nerection of<br />\nthe<br />\nfor<br />\ngn<br />\nalso<br />\ncampai<br />\nthe<br />\nwas<br />\nto<br />\nsupport<br />\nname<br />\nPhilip's<br />\nets<br />\nbearing<br />\nChevrol<br />\nSupply<br />\nboth financial and moral<br />\n6000<br />\nWater<br />\nPLaza<br />\nGood<br />\nexpendal and literary efforts<br />\na new cage. In spite of much oratoric<br />\nAmong the ruins of the Olympian found.<br />\n1723-25 N.<br />\ncolumns of this journal,<br />\nrs<br />\nthe<br />\nChrysle<br />\nin<br />\nand<br />\nm<br />\nplatfor<br />\nHall<br />\nE.<br />\nC.<br />\nDoctor<br />\nthe<br />\n,<br />\nof<br />\ned on<br />\nCharles St .<br />\nWe all. Wish to acclaim<br />\nhouses were found evidences<br />\nstudents. The lack,of underonly $5,250 has been subscribed by the<br />\nHupmobiles<br />\nTerra Robinson's talk one of,the most in- — Vernon 4049<br />\none<br />\nwhen<br />\nsystem.<br />\nzed<br />\nsupply<br />\nemphasi<br />\nwater<br />\ngood<br />\nfurther<br />\nis<br />\nse<br />\ngraduate interest in the enterpri<br />\n2402 Pennsy:<br />\nquota of $25,000 has been<br />\ncotta pipes were found in such po- teresting ever given at. Hopkins and<br />\nWillys-Knights<br />\nconsiders that'but one-fifth of the campus<br />\nvania Ave.<br />\ndein<br />\ns<br />\nkindnes<br />\nOlympthe<br />\nhis<br />\nfor<br />\nthat<br />\nhim<br />\nshow<br />\nto<br />\nas<br />\nthank<br />\nto<br />\nsitions<br />\nsubscribed.<br />\n2000<br />\nte<br />\nLAfayet<br />\nwas<br />\nfor subscriptions<br />\nians knew ,and employed the fact livering it.<br />\nAt the assembly last Thursday, the drive of student pledges.<br />\nBaltimore Concedes Milestone Supremacy<br />\nthe form<br />\nresumed with the collection of $300 in<br />\nthat water rises to its own level.<br />\nthe<br />\nng<br />\nattendi<br />\naduates<br />\nundergr<br />\nIn view of the fact that many of the<br />\nMany cisterns were also found. It<br />\nbeen solicited before by the<br />\nCommercial<br />\nNewspapers,<br />\nassembly were freshmen who had not<br />\nshould have<br />\nptions<br />\nbe added here that many of<br />\nmay<br />\nsubscri<br />\nof<br />\nnumber<br />\nthe<br />\nWork<br />\nthat<br />\nseem<br />\nBooks<br />\ncommittee it would<br />\na<br />\nof<br />\nvicinity<br />\nsigning<br />\none<br />\ner that the<br />\nthe coins found were in<br />\n_<br />\n.<br />\nbeen far greater. Students should remembte outlay of money. These<br />\n1880<br />\nhed<br />\nun,Establ.<br />\nfound<br />\npledge card does not necessitate an immedia three years in installments • and many Of them were<br />\nof<br />\nstruck, unlike the others bearing<br />\ncage pledges may be paidover a period<br />\nutor.<br />\ncontrib<br />\nThomas &amp; Evans<br />\nual<br />\nindivid<br />\nthe<br />\nto suit the convenience of<br />\nbeautiful metal work of heads of<br />\nod has become a vital<br />\nunThese<br />\nday.<br />\nThis question of a gymnasium at Homewo<br />\nthat<br />\nof<br />\nmen<br />\ngreat<br />\ninPrinting Company<br />\nnever boasted of an<br />\nmatter. Baltimore, as everyone knows, has odate 'a large crowd of<br />\nstruCk- coins led the men to- suspect<br />\naccomm<br />\n-to<br />\nsize<br />\nnt<br />\nsufficie<br />\nof<br />\narena<br />\n1506-1508 Guilford Avenue<br />\ndoor sports<br />\nof Homewood which will<br />\nthat there was some sort of mint<br />\nfans. There is no hall in the neighborhood<br />\nBaltimore, Mcl.'<br />\ns<br />\nCarlin'<br />\nat<br />\nof<br />\nfloor<br />\nmolds<br />\nThe<br />\nMany<br />\nteam.<br />\nll<br />\n/district.<br />\nin • that<br />\nsuit the needs of a Hopkins basketba<br />\nto be ,<br />\ncarrtfgs<br />\nthe<br />\nfrom<br />\nfarlarnon 5691<br />\nwhich<br />\ntoo<br />\nis<br />\nPhone<br />\nyear,<br />\nfound<br />\nlast<br />\nwere<br />\nterra. cotta.<br />\nPark, which was used<br />\nn, the large sum paid out<br />\naccessible for practice Sessions. In additio the team on a profitable'<br />\ntheklheautiful<br />\nfor%)<br />\nto<br />\nused<br />\nwere<br />\nfor rent makes it almost impossible to finance<br />\n_<br />\nheads- which _ were<br />\n-_ Reodivirlacief A<br />\n.:<br />\nL\\t, ;.-,::<br />\nbasis.<br />\nadequate home court<br />\nten' Robinson inentiiined,thatthe had<br />\n:<br />\niCtd 'Clit to Oi<br />\neler,<br />\nThe proposed cage will not only provide an .the rather anemic<br />\nalso permit<br />\nof _these<br />\nfor the basketball squad, but<br />\nity to extend its pro- . cast .a head out of one<br />\nESTABIJOH- Eb ENGLISHI.UNIVERSITY<br />\nl'hysical Training Department of the Univers the R. 0. T. C. unit<br />\nfolind the result a piee.,<br />\nby<br />\nand<br />\nused<br />\nmolds<br />\nbe<br />\nwill<br />\ng<br />\nSTYLES, TAILOREO -OVER YOUTHFUL<br />\nbuildin<br />\nThe<br />\n.<br />\nactivity<br />\n• - gram of<br />\nplays<br />\ns,<br />\nConcert<br />\nior<br />\ne<br />\navailabl<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nof artistical work, and the figure<br />\nduring inclimate weather and will also be<br />\nand other student gatherings.<br />\nSERVICE I THC.UNITtLp STATES.<br />\nof dignity. These heads date<br />\nfull<br />\nNew<br />\nthe<br />\ngame,<br />\n&lt;<br />\nbia<br />\ns-Colum<br />\nU. S. Army<br />\nAt a smoker, following the Hopkin<br />\nFort Robinson, Nebr.<br />\ns of the campaign on the<br />\nback to about 400 B. C. One peYork alumni will be informed of the progres<br />\n1928<br />\n29,<br />\nMay<br />\ngradinfluential body of<br />\nculiar looking ugly head was found Larus &amp; Bro. Co.<br />\nHomewood campus. The attitude of this<br />\non the interest manid, Va.<br />\nuates toward the project will depend largelys of the proposed cage<br />\nwhich appears to lack all the beauty Richmon<br />\nGentlemen:<br />\nfested' by the undergraduates. If the sponsor enthusiastically sup'.<br />\n--Greek<br />\ng of champion long- time<br />\nSpeakin<br />\nother<br />\nare<br />\ns<br />\nwhich<br />\nry<br />\nstudent<br />\nsymmet<br />\nthe<br />\n•and<br />\ncan report to the alumni that<br />\nmembers of the EDGEWORTH Club,<br />\ncommittee to get subscrippossess. Finally, it was say:—itisn't how long you havesmoked<br />\nporting the drive, the news will assist the<br />\nworks<br />\nin-.<br />\nare<br />\nalumni<br />\nYork<br />\nEdgeworth, it's how well you have ention pledgs in Manhattan. But if the New apathetic interest; it<br />\nSuits MO,945 '50 Overcoats<br />\n•<br />\ncleaned out and found that inside joie I the smoke.<br />\nan<br />\nformed that the students are exhibiting only<br />\nes.<br />\nWhy,I have walked out of many a<br />\ngraduat<br />\nthe<br />\nof<br />\nwomul<br />\na<br />\nsupport<br />\nbeautif<br />\nhead of<br />\nthe<br />\nwas<br />\nto<br />\ng,<br />\nwill be a difficult task to win the<br />\ntravelin<br />\nwhen<br />\nly<br />\nespecial<br />\nstctre,<br />\nedge fund, fill out a<br />\none-horse town and buy<br />\nIf you have not, as yet, subscribed to the subscribed, increase<br />\nan. Probably some child had plas- stop at some<br />\nEdgeworth. A good pipe deserves<br />\npledge card immediately. If you have already<br />\nl<br />\norigina<br />\nthe<br />\nand<br />\nEdgeworth mine gets.<br />\nover<br />\nth,<br />\nEdgewor<br />\nhurts!<br />\ntered at random<br />\nthe size of your contribution. ,Give till it<br />\nI would not insult it with any other.<br />\nBY SPECIAL APPOINTMENT 14<br />\nhead and had produced the gro\"The familiar blue cans are everywhere,\" and usually you fiDd men of<br />\n•<br />\nOUR STORE IS THE<br />\none.<br />\ntesque<br />\ntaste carrying them, whicirproves it is<br />\nnot the price-that determines a good<br />\nThe Guilford 'Section<br />\nO'ER<br />\nIS<br />\nand<br />\nCare<br />\n\"smoky' tobacco, but the<br />\nTHE FIGHT<br />\nThat section of the city which method that produce it.<br />\nstruggling along the fraternity<br />\nI would rather go days without<br />\nresiwealthy<br />\nthe<br />\nFTER four weeks of strenuous<br />\nedly<br />\nundoubt<br />\nwas<br />\naway. In<br />\nEdgeworth and at the end draw a deep<br />\nwar front the smoke of battle is gradually driftingchanting of<br />\nnext.<br />\nof that cool \"smelly\" aroma,<br />\ninhale<br />\nshown<br />\nwas<br />\ndistrict<br />\ndential<br />\ng and<br />\nsome of the chapter houses, there is much rejoicin contentedly and<br />\nsatisfying to the last puff, than punish<br />\nback<br />\nOF BALTIMORE<br />\nThere were great wide streets, and my throat and lungs and nostrils with<br />\nhalleluiahs as nerve wracked upper classmen sit<br />\ntheir labor. To these<br />\ninferior grades.<br />\ninspect, with an air of satisfaction, the fruits of<br />\nlarge courts around' which the<br />\nth is \"The Smoke With a<br />\nother<br />\nthe<br />\nof<br />\nEdgewor<br />\nsome<br />\nFrom<br />\nlations.<br />\ncongratu<br />\nour<br />\noffer<br />\nfortunate souls we<br />\nThe character of the suits and<br />\nPersonality,\" like an old friend, you<br />\nand gnashing<br />\nhouses Were built. In digging down learn<br />\nto know and understand, and<br />\nstrongholds of brotherly love come sounds of wailing a satisfactory<br />\nsecure<br />\novercoats tailored by Charter House<br />\nyou have a<br />\ninto the floor of the rooms of these when troubled or when seek<br />\nof molars as the fraters lament their failure to are heavy laden, we<br />\nits sol\"thinky\" problem—you<br />\nwill earn your most sincere liking.<br />\ncrowd of pledges. To those who mourn and<br />\nhouses beautiful mosaics were un- ace and companionship.<br />\nseason.<br />\noffer our condolence with the hope of better luck next<br />\nyours,<br />\ntruly<br />\nVery<br />\nbeen<br />\nwhite<br />\nof<br />\nhas<br />\ned<br />\nMud<br />\nconsist<br />\nThey,<br />\n.<br />\nhistory.<br />\nin<br />\ncovered<br />\ndown<br />\nH.<br />\nE.<br />\nFulmer<br />\ngoes<br />\n(signed)<br />\nseason<br />\nAnother rushing<br />\nwater has<br />\nslung, theatre \"peanut galleries\" have been visited, soda have been<br />\nand blue stones with cement in bes<br />\nbeen sipped by the gallon, yards and yards of statistic have held<br />\ntween, forming intricate and beaualumni<br />\ntongued<br />\nsilver<br />\nBaltimore. Charles and Fayette<br />\nunfurled before the freshmen's eyes,<br />\ntiful designs and figures describing<br />\nExtra High Grade(<br />\nthe frosh spellbound with the force of their oratory.<br />\nthe<br />\ng<br />\nup<br />\ncleanin<br />\nbusy<br />\nare<br />\npledges<br />\nThe<br />\nnow.<br />\nthese<br />\nBut Ws all over<br />\nhistorical events. We see by<br />\nbooks<br />\nfraternity houses and the brothers are blowing the dust off their<br />\nfloors that we are dealing with a<br />\ng to study.<br /><br />\n2<br /><br />\nl\\GENSel TTER<br /><br />\n1111,10li1S<br /><br />\nof<br />\nthe<br />\n. arc]<br />\nai 1<br />\nC.<br />\nRol<br />\nan<br />\nkep<br />\nwitl<br />\nyea<br />\nin 1<br />\nof<br />\nThi<br />\nfsin,<br />\nuf<br /><br />\nESSO<br /><br />\nthe,<br />\nDr.<br />\nSabi<br />\nyea)<br />\nable<br />\nin tl<br />\nazici<br />\nand<br />\nsuch<br />\nsite,<br />\natter<br />\nditio<br />\ninter<br />\nthis<br />\ndenti<br />\nIn<br />\nRobi<br />\n-<br /><br />\nEDITORIAL COMMENT<br /><br />\nswhoiw<br />\nhci<br />\nwoul,<br />\nassen<br /><br />\nL<br /><br />\ntv..)1•tai- olYv'<br />\nik<br />\not<br />\ncate<br /><br />\ntsewhrer7<br />\nn .t<br />\ntoiIfeoa<br />\n\"no<br />\nwas<br /><br />\nsett m<br />\no<br />\nin wl<br />\nlow-t<br />\nfd<br />\nspeak<br /><br />\nstay:o<br /><br />\nPM.<br /><br />\n,i5.<br />\n1en<br />\n1,Y(.r<br />\n,c11<br />\ning<br /><br />\nArmy Man finds<br />\nTobacco \"Like<br />\nOhl Friend\"<br /><br />\n'harteti<br /><br />\n• suma<br />\ning c<br />\nthe si<br />\nWas r<br /><br />\nhad I<br />\nwh<br />\nthisii-1<br />\nbe th<br />\nei<br />\net)va<br />\nOn<br />\nthe a<br /><br />\nuze<br />\no<br /><br />\ngfvo5ifo<br /><br />\nancie<br /><br />\nntcovetvery<br />\nbeen<br />\nfrom<br />\nsurfa<br />\nsameinter.<br />\nare b,<br /><br />\n•<br /><br />\nitrixter house<br /><br />\nA<br /><br />\nEdgeworth<br />\nSmoking Tobacco<br /><br />\n-<br /><br />\n1? Hub<br />\nlile\"Z4.'<br /><br />\nceid<br />\nne<br />\nwg<br />\n•<br />\nlive<br /><br />\nany<br />\nlayer<br />\nbelos<br />\nimph<br />\nmen<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 30, 1928<br /><br />\nDR. D. M. ROBINSON<br />\nADDRESSES ASSEMBLY<br /><br />\nFRANK'S.<br /><br />\nSIGN YOUR CAGE PLEDGE<br /><br />\nGives Illustrated Lecture on<br />\nExcavations<br /><br />\nLight Lunch<br />\n5 W. Twenty-first St.<br />\nOpen 9.30 A. M. to Midnight<br /><br />\nGWYNN LEASE<br />\nOrchestras of Distinction<br /><br />\nProducers of<br /><br />\nDESCRIBES EXPERIENCES<br /><br />\n'<br />\nTUTORING<br /><br />\nGnIE NEWS-LETTER<br /><br />\n1944 EDMONDSON AVENUE<br /><br />\nAlgebra—Geometry—Trigonometry<br /><br />\nSpeaker Did Resesirch Work<br />\nin Sabattical Year '<br />\nDoctor David Mpore Robinson,<br />\nof Johns Hopkins Faculty, one of<br />\nthe world's most famous figures in<br />\narchaeological research, spoke before<br />\na, large group of students in the<br />\nC. E. Hall last Thursday. Doctor<br />\nRobinson with the aid of slides and<br />\n_Tremendously important anthropa marvellously versatile deliverance<br />\nkept the assembly fairly entranted ological note. -- A freshman who<br />\nwith his description of his trip last lives in B entry, but whose name<br />\nyear to Greece and'his excavations must be withheld for reasons obviin bringing to light the hidden ruins ous to all who eat' in the Alumni<br />\nof the ancient city of Olympus. Memorial Hall, reports he has lost<br />\nThis trip; financed by a Baltimore six of his 131 pounds since -he<br />\nthrough the efforts came to liye 'here. A combination<br />\nfund,' obtained ;<br />\nof Doctor Yourtg of the Hopkins of circumstances is blamed.<br />\n. Medical School; was_tte: acme of<br />\nthe, wenderful research trips wIlich • When two' men 'run for President<br />\nDr. Robinson has taken during his of the United States, and at the<br />\nSabbatical period set aside every two same time two men run for one poyear's for this Work. The remark- sition on the Hall board of goverable_part of these excavations is nors, something—of great -political<br />\nin the fact that the location of this moment is almost certain to occur.<br />\nancient city had never been settled, They did and it did, the other night<br />\nand the Work .was carried on with in the Dorm.<br />\nsuch exactitude of research that the<br />\nCrammed with the 'technique to<br />\nsite. was struck exactly at the first<br />\nbe learned from the articles of Kent,<br />\nattempt. In the course of thexpeMencken and- Hyde, and filled with<br />\ndition 2,000 slides were taken of<br />\nthe sense of their solemn duty'<br />\ninteresting scenes to be shown in<br />\ngood residents, the students here.<br />\nthis country to history-loVing stuin the best electoral manner.<br />\n• -- acted<br />\ndents.<br />\nThe freshman bloc was out in force,<br />\nCertain Slides Taboo<br />\nan undergraduate;<br />\nIn introducing his subject, Doctor as usual, backing<br />\nunappreciated in<br />\nRobinson mentioned that certain but he, a prophet<br />\nhis own country, failed to. win the<br />\n- slides which he had planned on<br />\nof the upperclassmen away<br />\n*showing and certain interesting tales' support<br />\nfrom his graduate opponent.<br />\nwhich he had planned on -relating<br />\nA tie resulted on the first ballot,<br />\nwould have to be. excluded As the<br />\nassemblage contained several co-eds with the ba:lance of power held by a<br />\nwho had wandered in in search of tall dark horse. On .the secOnd<br />\nremaining<br />\nknowledge or perhaps merely oiis- vote, the freshman 1..7loc<br />\n• pany. The first set of slides showed solid, one candidate published a<br />\nthe territory, in the form of intri- platform which was followed immecate maps, in which the excavations diately by a victory. , It was:<br />\nwei't -carried on. There was also<br />\n\"CollP.ge life is an experiment noshown a 'map of the surrounding ble in purpose' and far reaching in<br />\nterritory of Macedonia and the site consequences. It must be worked<br />\nof a temple was pointed out where out constructively.- Therefore I ap\"no women were. allowed.\" There peal to you good men and true to<br />\nwas an evident uneasiness among elect me on my single plank of a<br />\nthe female section in the rear, bin quiet hour in the dormitories after<br />\nno movement to be sure. The next breakfast.\"<br />\nset of pictures showed the houses<br />\nIt was close even at that, but the<br />\nin which Dr. Robinson and his felprosperity ,and sanctity of the<br />\nlow-travelers resided during their<br />\nAmerican.Dormitory was effectivestay in the excavating district. The<br />\nly protected and preserved, to the<br />\nspeaker brought out the prevalence<br />\naccompaniment of thunderous huzof discomfort in these houses mainzahs.<br />\nly consisting of lack of heat and<br />\nchimneys and a multitude of \"ci•awlAs the national election draws<br />\ning animals\" which insisted on<br />\n\"crawling\"! into the wriing places. near, the disfranchised voter' living<br />\nin the Hall, who. will be detained<br />\nHopkins Co-Ed Shown<br />\ntheir native precincts on<br />\nAuaroosing incident was shown far from<br />\nelection day, axe -wondering what<br />\n'-oiext in the 'form of a co-ed,...pre,<br />\n-the excitement is all about.<br />\n..'suinahly a fair Hopkins student, he,<br />\nHaving at present no hotries,.they<br />\nbig carried over the river bed on<br />\nthe shoulders of a mighty Turk. It cannot become urfcluly enthusiastic<br />\nwas mentioned that the girls enjoyed over the learned Di-. Hoover's platithis practice very %yell. This river tudes on the American Home. Dehad to be crossed to reach the site tached from their own states, they<br />\nwhii'chi will believed by the party to are not greatly attracted by Pro-,<br />\nbe that uf Olyint4s. The site lies fessor Smith's plan for state enbetween.twO ill'Ils:\"ektending upward forcement of. the Eighteenth<br />\non each side. The nekt•set showed Amendment., Being for the Most<br />\nthe actual digging at the imagined part atheists—correct me if I am in<br />\nsite and then the triumphant dis- error here—they are not concerned<br />\ncovery. of Walls and roads,,and boles over fhi great religious issue in the<br />\nof grain, giving evidence of some. present campaign.<br />\nancient civilization. The actual digThe candidates, then, have nothging necessary, as brought out, was ing to offer the Dorm resident, exvery small, for most of the city had cept ,matter for reading at breakbeen buried only td the extent of fast. When, therefore, one of their<br />\nfrom one to two feet below .the own number stands for office on a<br />\nsurface. Deeper down Were found platform so soul stirring, so directinteresting stone implements which ly interesting as a \"quiet hour after<br />\nare believed to date back to the Stone<br />\nbreakfast\" one 'can readily underAge. These implements include<br />\ntheir enthusiasm. It touches<br />\nstand<br />\nloom<br />\nstones,<br />\nneedles, grain grinding<br />\nweight, and yarn spools. At this them, you see! it is something they<br />\nsame'depth was found ultra-primi- can uderstand ; it is fundamental.<br />\ntive stone idols which did not have like the sanctity of the American<br />\nany human shape. 17 the upper<br />\nHome.<br />\nlayer, that is the one to two feet<br />\n.below the surface, were found many'<br />\nWhich, according to one of our<br />\nimplements which convinced the<br />\nmost erudite professors, is perhaps<br />\nmen that they had found the city<br />\njust as well.<br />\nContinued on Page 2, Col. 8<br /><br />\nCOMMUNITY INN<br /><br />\nPLANTATION<br /><br />\npie, READ-TAYLOR co.<br /><br />\n-<br /><br />\nPhone GAmor<br /><br />\n• WILLIAM H. JOLLY<br /><br />\n2766 -pwynn<br /><br />\nLombard &amp; South Sts<br /><br />\n6886<br /><br />\nOak Ave,<br /><br />\nTel. Woodlawn 276.W<br />\nA<br /><br />\nPhone CAlvert 5975<br /><br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths since 1857<br /><br />\nTHE CHARLES E. MYERS CO.<br />\nIncorporated<br /><br />\n(RUBBER STAMPS<br /><br />\nHOMEWOOD FIELD<br /><br />\nThe Service Shop<br />\n319 W. Redwood, St.<br /><br />\nNo Charge for Extra Passengers<br /><br />\nTHE SOUTHERN<br />\nHOTEL<br /><br />\nVERNON 1 2 1 2<br /><br />\nfor 'evening wear.<br />\n9<br /><br />\nAT<br /><br />\nManufacturer of<br /><br />\nDRESS SETS<br /><br />\n7 and<br /><br />\nYELLOW CAB STAND<br /><br />\nBaltimore's Newest<br />\n:-: and Finest :•:<br />\n\"A Hotel of Atmosphere<br /><br />\nEast Baltimore Street<br /><br />\n'PHONE<br /><br />\nFOR A<br /><br />\nYELLOW<br /><br />\nCAB<br /><br />\nand Environment\"<br /><br />\n-Diiih<br /><br />\n1 If<br /><br />\nPRIVATE SALE<br />\nof<br /><br />\ncilnlite-TashionedOxfonis<br /><br />\nMERCHANT<br />\nTugselfassurance and confidencethai<br />\ncorrect clothes and correct foot gear<br />\ngive are as vital for success in college<br />\nas in the business world. Nunn•Bush<br />\nAnkle-Fashioned Oxfords are built<br />\nto fit the ankle as well as the foot—<br />\nno gapping, no slipping at the heel.<br /><br />\nTAILORING '<br />\nTo Get Acquainted with the<br />\nBoys of<br /><br />\nShoes<br />\nfor<br />\nI en<br /><br />\nJOHNS HOPKINS<br />\nWe just bought a<br /><br />\ndon<br />\nTH E<br /><br />\nBOSTONW4S<br /><br />\nmill's overproduc,<br /><br />\nof woolens at a price that en,<br /><br />\nr<br /><br />\nDUTY aHofr<br /><br />\nables us to<br />\nvalue at<br /><br />\nCollar Hug Clothes<br />\nBait/morn<br />\ntthelyStieets<br /><br />\n$38.75<br /><br />\ngive 'you our .$38.75<br /><br />\n$28.75,<br />\nvalue<br /><br />\nand<br /><br />\nequals<br /><br />\nCollege Men!<br /><br />\nour , regular<br />\nany<br /><br />\n860.00<br /><br />\nsuit in Baltimore.<br /><br />\nCome In and Look Them Over<br /><br />\nIn style and quality \"Bostonians\"<br />\nequal the most expensive footwear<br />\nproduced today.<br />\nAnd the saving is a big item.<br /><br />\n1556<br />\nThe Whitehall<br />\nImported Black<br />\nScotch Grain.<br /><br />\n.<br />\n...IOW,<br /><br />\nWILLARD<br />\nTAILORING CORP.<br />\nFAYETTE Si'. AT HANOVER<br />\nFIRST FLOOR<br /><br />\nClub Lourige<br /><br />\nCigarettes<br /><br />\nMostly $7.50 to $10<br />\nExclusively in Baltimore<br /><br />\nBOSTONIAN<br />\nSHOE STORE<br /><br />\nFree Phone<br /><br />\n112 E. Baltimore Street<br /><br />\n6<br /><br />\n\"le/ rather have a<br />\nChesterfield!\"<br /><br />\n&amp;We-a<br /><br />\nIt is considered the height of bad form, they<br />\nsay, to carry your own sandwiches to a tea—or<br />\nto pack your own blanket for the week-end—<br />\nbut luckily, no such outlandish conventions<br />\nsurround the smoking of your own cigarette.<br />\n\"I'd rather have a Chesterfield,\" fortunately,<br />\nis a phrase which not only remains \"good<br />\ncricket\" in polite circles—but at the same<br />\ntime brands the smoker as a person of rare<br /><br />\ndiscernment and excellent discrimination.<br />\nAnd small wonder, considering all the remark implies. Good taste, top quality, the rare<br />\nsparkle of tobacco goodness—all these combine<br />\nto justify the choice of that man who thus<br />\nshows his keen judgment.<br />\n\"I'd rather have a Chesterfield\"—a neat line,<br />\nthat—the mark of a real connoisseur and the<br />\npassword of six million smokers.<br /><br />\nIH ESIFIEVFI HUD<br />\nMILD enough for anybody.. and yet.. THEY SATISFY<br />\nLIGGETT ot sagasTobacco co.<br /><br />\n1<br /><br />\nOCTOBER 30, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br /><br />\nEIGHTY-THREE FRESHMEN PLEDGED<br />\nBY GREEKS ON RUSHING DAY<br />\nEighty-three men had been<br />\npledged by eleven fraternities when<br />\nthe NEWS-LETTER went to pressiast<br />\n-Monday afternoon. No reports<br />\nwere received from SigrueriTau Delta-and the Buccaneers. Delta.Gamma Theta pledged die most me ,<br />\nsixteen. The list is as follows:<br /><br />\nrSAUNDERS<br />\n,S It Yours<br /><br />\n, Beta, Theta Pi (5)<br />\nReeder<br />\n• 'Casey<br />\nGruver<br />\nSteel<br />\nCarter<br /><br />\nSYSTEM<br />\nUGILID<br />\nSTIAIPES<br />\n1-1AVIE<br />\nCONE<br /><br />\nPhone HOmewpod 7908<br /><br />\ncBirely's Pharmacy'<br />\nST. PAUL at .33rd STREET<br />\nTour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service '<br />\nMake Our Store Your Store<br /><br />\nTo Leavenworth<br />\nperhaps or,if you<br />\nprefer a southern exposure, to<br />\nAtlanta.<br />\nStripes for university men this<br />\nfall are subdued,<br />\nsoft rich bleeds<br />\nwhich savor of<br />\ngentility.<br /><br />\nE. E. ADAMS<br />\nBARN CAFETERIA<br /><br />\nBraeburn has exactly expressed<br />\nthis spirit.<br />\nThe Newest<br />\n£35 $40 $45<br /><br />\nPlease Patronize<br />\nClothiers and Haberdashers<br /><br />\nOur<br />\nAdvertisers<br /><br />\n17 E. BALTIMORE ST<br /><br />\nPhi• Kappa Psi (§)<br />\nHurlock<br />\nDukehart<br />\nTippett<br />\nKump<br />\nCromwell<br />\nWatts<br />\nBrandau<br />\nConey<br />\nDelta Phi (7)<br />\nGoff<br />\nForbes<br />\nPassano<br />\nDevilliers<br />\nCrowther<br />\nReese<br />\nJackson, M.<br />\nPhi Gamma Delta (12)<br />\nBesore<br />\nWood, G. ,<br />\nFisher<br />\nKneit<br />\nBick<br />\nShirley<br />\nCochran<br />\nSharrets, K.<br />\nMietee<br />\nFrey<br />\nLukanitsch<br />\nCaldwell •<br />\nKappa Alpha t$)<br />\nBoedie<br />\nSkinner<br />\nHoffman. T.<br />\nSeipel<br />\nParr<br />\nDelta Gamma Theta (16)<br />\nGetting<br />\nO'Connel<br /><br />\nEvans<br />\nParks •<br />\nKjell<br />\nEagan, I..<br />\nHannock<br />\n•<br />\n•Du Val<br />\nhgooper<br />\nOrtman<br />\nStrong<br />\nJany<br />\nJohnson<br />\n• Pearce j<br />\nj Meidling<br />\n- Delhi Upsilon (6)<br />\nBradley<br />\nLevy<br />\nLinch<br />\nMiller •<br />\nPerkins<br />\nPerry<br />\nKappa Signia (8)<br />\nGray. 7--Gundry<br />\n, linden<br />\nMartin<br />\nOwings<br />\nRank<br />\nSaunders<br />\nSchmidt<br />\n•<br />\n.Alpha Tan Omega (55<br />\n. Barrett<br />\n'Whitby<br />\nQuick<br />\nLamont<br />\nNess, R.<br />\nAlpha Kappa Phi (2)<br />\nKrause, F.<br />\nElliott, J., ,<br />\nOmicron Kappa Omicron (5)<br />\n' Collier<br />\nDoellor<br />\nClark<br />\n'Donovan<br />\nMills<br />\nAlpha Delta Phi (4)<br />\nSnyder<br />\n* England<br />\nShreeve<br />\nLitchfield<br />\nSigma Tau Delta<br />\nXa report<br />\nBucaneers'<br />\nNo report<br /><br />\nCAGE COMMITTEE<br />\nTO MEET THURSDAY<br />\nImmediately 'after assemmeeting ad<br />\nbly Thursday a<br />\nCommittee<br />\nthe Cage Fund<br />\nE.<br />\nwill be held in the C.<br />\nare<br />\nHall. All members<br />\nimurged to be present, as<br />\nportant liustnts is to ht<br />\nbrought ur. The necessity<br />\neveryof the co-operation of<br />\none on the campus can not<br />\nbe overemphasized, as nothing can be done off the Cainpus until the support of the<br />\nstudents .is•guaranteed.<br /><br />\nBOOKS<br />\nBOUGHT, SOLD<br />\nEXCHANGED<br />\nand<br />\nPippen's Book Store<br />\n605 N. EUTAW ST.<br />\nAbove Franklin<br /><br />\nRA!<br />\nLyor<br /><br />\nPhone, CAL 1380 Home—HO. 2099<br />\nFRANCES T. BANNON<br />\nSuccessor to HARBAUGH es? BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nMaryland<br />\nBaltimore<br /><br />\nFRANK BROTHERS<br />\no<br />\nlinfrAvenue Boot Shop<br />\n1 and 48,12 SueettNew York<br />\nBer.een 4 ,<br /><br />\n•<br />\nand :<br />\ndistiriluished<br />\nstyle And<br /><br />\ntar<br /><br />\nFIDELITY AND DEPOSIT CO.<br />\nNf.:,yland<br /><br />\nFid.ehty and Surety Bonds<br />\nBurgla-iy and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nD. C<br /><br />\n-GR:—.:ND FLOOR. FIDELITY BLDG.<br />\nPhone PLaza 0800<br /><br />\nFETTING<br />\ncA.<br />\n. JEWELRY CO.<br />\nACTURING<br />\n,ckkNITF<br /><br />\nGreek Le:-.:er Fraternity Jewelry<br />\nNORTH CHARLES STREET<br /><br />\nStep Out From The Crowd!<br />\nBe an exception—Be a Successful Somebody<br />\nWith a Savings Account you are on the highroad<br />\nto succesa--Orportunity waits beyond.<br /><br />\nPARK BANK<br />\nLexington Street at Liberty<br />\nNorth Avenue at Charles<br />\nBelair Road at Southern<br /><br />\n4819<br /><br />\n\"When you see my new United Artists'<br />\npicture, 'The Woman Disputed,' you<br />\nwill notice that I smoke cigarettes in<br />\nseveral scenes.<br />\n\"Not wanting to show partiality to any<br />\none of the four leading brands, I decided<br />\nto make my choice via the blindfold test,<br />\nwhich I had heard Of many times<br />\nHappily, I picked OLD GOLDS.<br />\n\"I found the smooth, mild and delightfully cool ... Hereafter, when I am<br />\nrequired to smoke I shall naturally insist on OLD GOLDS. There's not a cough<br />\nin a film-fu!!\"<br /><br />\nbest kind<br />\nof<br />\nRoommate<br /><br />\ntendency to<br />\ngive this kind<br />\nof work better<br />\nmarks.<br />\nRemington Portable is the<br />\nrecognized leader in sales and<br />\npopularity. Smallest, lightest,<br />\nmost dependable, most compact standard keyboard portable. Weighs only 8 pounds,<br />\nnet. Carrying case only 4<br />\ninches high.<br />\nYou can buy it on easy<br /><br />\nREMINGTON RAND<br />\nBUSINESS SERVICE, INC.,<br />\n130 W. Fayette Street<br />\nBALTIMORE, MD.<br /><br />\nTo<br />\ndolpb<br />\nfirst<br />\nWith<br />\nthe 11<br />\ncalled<br />\nthe r<br />\nteam<br />\nwon<br />\nare fa<br />\nJaytni<br /><br />\npoweshowi<br />\ncry<br />\nstaff's<br />\nfar a:<br />\ning ti<br />\nthe b.<br />\nprogr<br />\nweeks<br /><br />\nFm<br />\nOrma<br />\neasy<br />\ning at<br />\nat SIN<br />\nclever<br />\nand it<br />\n- row I<br /><br />\nThe<br />\nbe. ter<br />\nthat t<br />\n1 Iopk<br />\n• action<br />\nBobb)<br />\na con.<br />\nteam<br />\ngreat<br />\nheld<br />\nknee<br />\nmond<br />\nan inj<br />\nthe F<br />\nfearet<br />\nLyons<br />\nwhen.<br />\nbut lc<br />\ncompl<br />\nHis inj<br />\nfcaret<br /><br />\nAs1<br />\nquart(<br />\nin tilt<br />\ngame<br /><br />\npayments.<br /><br />\nIkmington<br />\nPortable<br /><br />\nD,<br /><br />\nSo<br />\nponen<br />\nstreng<br />\nto all<br />\nsiStan<br />\nbeat P<br />\ndowrn<br />\nJohns<br />\nthey I<br />\nSons,<br />\nVirgis<br /><br />\nih<br /><br />\nRooming with<br />\na Remington<br />\nPortable adds<br />\nto the enjoyment of college life. It is always ready to help With your<br />\nwork. Long reports and<br />\ntheses can be turned out in'far<br />\nless time, as compared with<br />\nlaborious long-hand methods.<br />\nThen, too, think of the rester<br />\nneatness and legibility of typewritten work ! Any prof,<br />\nbeing human, will have a<br /><br />\nVOl<br /><br />\n1 II<br /><br />\none to the beat loved actresses in the<br />\nI.ntunno tor her 'riles in \"Camille\" and \"Mkt.\"<br /><br />\ni!• S.MA<br /><br />\nec,tun<br /><br />\nNORMA TALMADGE .. celebrated screen afar<br />\nOLD GOLDS on • scene from her lateat United A<br /><br />\nvehicle, \"The Woman Disputed.\"<br /><br />\n•<br /><br />\nsmoking<br />\n'starring<br /><br />\n0P. Lorillard<br /><br />\nCo., Est IMO<br /><br />\nMade from the heart-leaves of<br />\nthe tobacco Plant . . . that's the reason for<br />\ntheir honey-like smoothness ... and that's why<br />\nyou can pick them with your eyes<br />\nclosed.<br /><br />\nLin<br />\nHo,<br />\nHousi<br />\nLove<br />\nKegat<br />\nPowe<br />\nBerna<br />\nBialos<br />\nZimm<br />\nDever<br />\nMills<br />\nBesor<br />\nCapla<br /><br />"}], "field_media_file": [{"target_id": 38296, "display": null, "description": null, "target_type": "file", "target_uuid": "802d68ca-67c8-4503-b249-30d740f9bfec", "url": "http://digital.library.jhu.edu/system/files/2022-03/13337-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13337, "target_type": "node", "target_uuid": "ee5b980e-3047-46d0-980d-2ce23b5be369", "url": "/node/13337"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "229f0c9c-9f91-4ee7-960c-0183253c649b"}]}