{"mid": [{"value": 35649}], "uuid": [{"value": "83efd655-4f20-47ca-b76d-55b6214cfe44"}], "vid": [{"value": 35649}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12192-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol VI. Nos 5<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nSIALTiMoRE. MO.<br />\nI.<br />\n<br />\n.11.111.1.01.11111M<br />\n<br />\nTwentg-61xth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\n.<br />\nPresident,<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n•<br />\n<br />\nIRA REMSEN.<br />\nWM. H. HOWELL.<br />\nROW. H. GRIFFIN.<br />\n<br />\n•<br />\n<br />\nINSTRUCTION<br />\nPor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(h) In Medicine. (Courses for candidates for the degree of M. D.; cours.:s for physician9.)<br />\nFor Undergraduates:<br />\n(0) As candidstem for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody institute<br />\nPratt Library<br />\n<br />\n. .<br />\n<br />\n100,000 volumes.<br />\n135,000 volumes.<br />\n...... 200.000 volumes.<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysies,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nA nutorny,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph N. Ames.<br />\nWilliam B. Mark.<br />\nWilliam K. nrw,ks.<br />\nFranklin P. Mall.<br />\nWilliam 11. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Older.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,:<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\n<br />\nAmerican Journal of Mathematics,<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XX IV<br />\nIn progress. $5 per volume.<br />\nII. American Chemical Journal.<br />\nI. ItEMSEN, Editor. Monthly. 8vo. Volume X XV1<br />\nin progress. $5 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERALFIEVR, Editor. Quarterly. livo.<br />\nVolume XXII in progress. $1 per volume.<br />\nIV. Studies from the Biological Laboratory. 8vo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. ;8 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XX In progress. $1 per year.<br />\nVU. John Hopkins Hospital Bulletin. Monthly. 4th.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to A scsyrIology and Comparative<br />\nSemitic,Philology,(Ifeltrage zur Assyriologie, etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume TV complete. $7.50<br />\nper volume.<br />\nXl. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthlr. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nX i I. Journal of Experimental Medicine.<br />\nW. H.<br />\nEditor. Bi-monthly. See. Volume<br />\nVI in progrems. SA per volume.<br />\nXIII. American Journal of Insanity.<br />\nEN RY M. HU Li D, Editor. Quarterly. 4to.,$5 per<br />\nvolume.<br />\nX IV. Reports of Maryland Geological Survey,<br />\nWILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nC. A. DAUBS, Editor. Quarterly.<br />\navo. Volume VI in progress. $1.50 per volumo.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nGroups.<br />\nI. classical(the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.)<br />\n3. hefuleal-Biological.<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n0. Historical-Political.<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics(vol. X X I V.)<br />\nFrank Morley.<br />\nIra Bentsen.<br />\nChemistry (vol. X X V I).<br />\n•<br />\nPhilology (vol. XX II.)<br />\nBasil L. Gildersleeve.<br />\nHiatory vol. XIX.)<br />\nJ. .31. Vincent,<br />\nMoiOpi Anguages(vol. XVI.) A. Marshall Elliot I.<br />\nWilliam K. Brooks.<br />\nBiolo k (vol. 1V.)<br />\nPaul Haupt.<br />\nAss)r oldgy (vol. IV.)<br />\nExperimental Medicine (vol. VI.) W. H. Welch.<br />\n<br />\nProgrammes Of the Courses offered to graduate studontsla Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiste<br />\nCourses, will be sent on appliaa Mon to the Registry r.<br />\n<br />\nIn addition to the aerials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the 01(1<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 110 pp. 4to. La plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. oendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with Antilegomena Epistles. Edited by 1. H. Hall. $3.00.<br />\nBibliographla Hopkinsiensis. Part I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nIV-V-vi.Physies, Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nR lull list of publications will be sent on application.<br />\nCommunications In respeo`, to exchanges and remittances<br />\n,nag be sent to Johns Hopkins Press, Baltimore. Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nDECEMBER 6, 1901.<br />\n<br />\nNo. 5.<br />\n<br />\nHOW ARTHUR ROWED.— A JOHNS HOPKINS STORY.<br />\nRTHUR Hugh Harrison,\" he wrote with a leisurely flourish on the<br />\nlast sheet of the folded examination papers before him. Then he laid<br />\nthem on a green covered table behind which the Dean sat regarding<br />\nhint with benign countenance, and strolled through the broad corridor of McCoy<br />\nHall, glancing at the bulletins and portraits with an air of new-found proprietorship. Under the red arch at the entrance he paused to bask in the placid<br />\nJune sunshine, looking with idle interest at the queer apparatus in the laboratory<br />\nwindows and asking himself what he should do next.<br />\nAll this was clear temptation of fate. In the ante-appropriation days at<br />\nHopkins, before hazing had become a forbidden and forgotten art, it was the<br />\nPlain duty of a new-fledged freshman on finishing his June examinations, to go<br />\nstraight homeward looking both to the right and to the left ready to run and<br />\nloath to parley. While Arthur lingered Macy came up and saluted him with<br />\ncordial and hearty interest in his welfare. Arthur was pleased; he thought for<br />\na flitting moment of certain warnings of his fellow-freshmen, but Macy was a<br />\nlittle fellow and alone, and he talked guilelessly. So Arthur banished suspicion.<br />\nHe opened his heart about the Vergil \"exam.\" He had \"hit it hard.\" \"How<br />\nwas it last year?\" he asked.<br />\nJust then Arthur was conscious of a touch on his arm and gentle jostling<br />\nfrom behind, and of Macy pleasantly inviting him to walk around the corner<br />\nfor a little informal further examination.<br />\n\"Yes, do!\" said voices behind and on both sides, with more gentle jost64<br />\n<br />\nling.<br />\nNow Arthur tempted fate no longer. He wisely concluded that he could not<br />\nafford to neglect so importunate an invitation, and he went along, though somewhat unwillingly. His hosts piloted him with care and close attention through<br />\nlittle Garden street and up the dusty stairs of a vacant house to the second<br />\nfloor. The first room was crowded by boisterous juniors who made the air<br />\ndense with the smoke of their pipes and the dust of their stamping. Before Arthur had time to see what was going on, he was hurried into the next room and<br />\nPut under guard in the corner.<br />\nHere, above the confusion he heard questions asked in a fierce voice punctuated by raps of a cane on the floor and answered timidl y.<br />\n\"What's your name?\" asked the voice. \"What school do you come from?<br />\n— What did your mamma send you to Hopkins for?—What, you don't know!<br />\nSing us a song.—Now bark like a terrier. There's a rat under that pile of<br />\nboards. After him! Gnaw there with your teeth!\"<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nPresently it was Arthur's turn to be examined. As he was led into the<br />\nroom, curses and the confused sound of stumbling feet came up the stairway.<br />\n\"Gangway!\" yelled Macy leading the way, and half a dozen juniors followed him lugging an exasperated, incoherent burden which Arthur recognized<br />\nas Gary, a Virginia student of tempestuous temper and wiry frame. He was<br />\nnot put in the corner but on a pile of old lumber in the first room where a man<br />\nsat on each end of him, and where. as one of his captors remarked all might<br />\nenjoy the choice flavor of his profanity.<br />\nNow the examiners turned their attention to Arthur. Billy Lawson, president of his class, glib of tongue and fleet of foot, a \"bully\" goal at lacrosse<br />\nand \"no slouch\" with the gloves, was seated in the only chgir the room afforded,<br />\nwielding a heavy cane.<br />\n\"Your name, sir!\" he thundered with a resounding tap on the floor. Arthur answered meekly enough.<br />\n\"Do give the poor dear some milk, he looks pale,\" drawled a lanky junior<br />\nwith a Carolina twang in his voice; and Arthur wore a bib and sucked at the<br />\nblack nipple of a nursing bottle while the juniors stamped approval. He danced<br />\nfor them, sang \"Annie Rooney,\" then a recent favorite, purred like a cat,<br />\nsalaamed to the crowd in turn, and answered foolish questions until his patience<br />\nsuffered under the strain, and he longed to strike out right and left. A glance<br />\nat Gary, uncomfortably prostrate and still sullenly rebellious, told him that<br />\nwould be a blunder, and once more he forebore to tempt his fate.<br />\nPresently he became cooler. The joke was on him, he thought, hut it was<br />\nnot altogether without its humor; and he began to answer Billy's questions a<br />\nbit flippantly. Then in a moment of forgetfulness he ventured to be a trifle<br />\nwitty.<br />\nThe lapse was fateful. In those ante-appropriation days it was a fact<br />\nknown to the wise that the nearer a hazed freshman could approach to a state<br />\nof uninspired idiocy the briefer his ordeal would be. It was also well known<br />\nthat the least attempt to be facetious, above all at the expense of the hazers,<br />\nwas morally certain to prolong it.<br />\nBilly looked stern for a moment and then went on with his questions.<br />\n\"Can you row?\" he asked, smiling his sweetest.<br />\n\"Yes, a little,\" replied Arthur innocently.<br />\n'Ah, indeed. You must show us how well you can row. Boys, two of<br />\nyou take the gentleman into the next room and help him put on his rowing<br />\nsuit,' commanded Billy.<br />\nIn the next room Arthur stripped somewhat reluctantly, taking off everything except one blue garter. This was left because, as one of his attendants<br />\nremarked, \"it would hardly be proper for him to take off all his clothes.\"<br />\nWhen they came in again a tin basin full of ice water—made of ice filched<br />\nfrom the McCoy Hall water cooler—had been set in the middle of the floor.<br />\nTwo match sticks were brought forward with much deliberation and put into<br />\nhis hands for oars. Then Billy rose, and pointing to the basin said politely :<br />\n`Will you be good enough to take your seat in the lake and row?\"<br />\n<br />\n\f3<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nArthur hesitated, but a dozen ungentle hands were ready to help him to<br />\nhis seat, and he decided to comply. Down he sat with a splash, gripping the<br />\nmatch sticks tightly, and stretched-out his sunburned arms for the word.<br />\n\"Go!\" yelled Billy, and Arthur, bending his naked back to the labor and<br />\nfanning the smoke-laden air with mighty strokes, while the juniors howled and<br />\nstamped, rowed his way into worthy freshmanhood at Hopkins. J. C. F. '99.<br />\n<br />\nTHE 1902 HULLABALOO.<br />\n<br />\nT IS the purpose of the Board of Editors to<br />\n<br />\nmake the Hullabaloo for 1902,<br />\nthoroughly representative of all the various interests at the University;<br />\nand iii order to accomplish this purpose, we require the active and hearty<br />\nco-operation of all true Hopkins men. The Hullabaloo, though published by<br />\nthe Senior Class, is not a mere class- book; it is the University annual, and as<br />\nsuch should be supported by the members of all the various classes. Seniors,<br />\nJuniors, freshmen, sub freshmen, graduates, and special students, all should<br />\ngive it their earnest support, and with their support and co-operation we hope<br />\nto produce a book well worthy of a place in the first rank of Hopkins Hullaba-<br />\n<br />\n3<br />\n<br />\noos.<br />\nLet every man try to prepare a story, or a poem, or a drawing, expressing<br />\nsome phase of Hopkins life, or of college life in general. There are assuredly<br />\namong the Hopkins students men capable of preparing enough contributions of<br />\nthis sort to fill a book twice the size of the Hullabaloo, and we want every man<br />\nto feel that it is his duty to put forth his best efforts in working for this book.<br />\nSome of the best work in previous Hullabaloos has been done by men not members of the respective classes which published these books; and though as<br />\nSeniors we should regret being excelled by members of other classes, as editors,<br />\nand as men interested in the welfare of all Hopkins' enterprises, we should be<br />\nonly too glad to receive contributions surpassing anything which we could do<br />\nin the same line. No man knows of what work he is capable, until he makes<br />\nan earnest and determined effort. Therefore, let every man do his best, and<br />\nsend us the results of his work.<br />\nWith the loyal support of the Hopkins students we shall be able to produce a book that will be as good as, if not better than, any college or university annual in this country. Reader, we need your co-operation to attain this<br />\nend. Summon up all your college spirit, and help us to show that in college<br />\ndePublications, as well as in study, and in athletics, the Johns Hopkins<br />\nserves a prominent place.<br />\n<br />\nCHARLES A. MYERS,<br />\nBox 449, J. H. U.<br />\n<br />\nEditor in Chief.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n4<br />\n<br />\nMUSICAL CLUBS.<br />\n<br />\nt<br />\n<br />\nIIE first concert of the Musical Clubs was given at the Hopkins Hospital<br />\nFriday afternoon of last week. The result of the work of the Glee Club<br />\nshould be most encouraging to its members and leader; rarely for many<br />\nyears has a club shown up so well at the first concert. The men held together<br />\nadmirably, with only one or two exceptions; they seemed to know the pieces,<br />\nand put plenty of spirit and go into the songs.<br />\nThe Mandolin Club played only one new piece—the \"Tell Me, Pretty<br />\nMaiden,\" from \"Florodora.\" They went at it with fairly good snap, but need<br />\nto get more accuracy and delicacy into the complicated runs. The cello and<br />\nclarinet, and the horn, which helped to hold up the mandolins the two seasons<br />\npast, are much missed, and there are places on the club ready for players of<br />\nthese instruments.<br />\nThe Banjo Club took a sadly needed brace in the second piece—\"Policy<br />\nSam,\" by Sousa,—and did itself some credit. This last is more than could be<br />\nsaid of the \"Mosquito Parade\" with which they started. However, the verdict<br />\nof the grads. in the back of the hall was favorable: \"Just the way it always is<br />\nthe first time;\" \"They're on the road to improvement.\"<br />\nA program of the numbers was issued, which was cheerfully disregarded<br />\nby all but the Glee Club.<br />\nOn the whole, the concert was not unsuccessful, but the Clubs have their<br />\nwork cut out for them before their next appearance, which is at Roland Park,<br />\nDecember 8th.<br />\n<br />\nMAKING A CHEERFUL NOISE.<br />\nURING the stress of the recent football excitement, several new songs and<br />\nyells have been produced by the College talent. Good interest has been<br />\nshown in learning them, and the rooters' repertory is now much increased. Of the songs, the most popular is W. B. Carver's \"Our College in<br />\nDixie Land,\" closely followed by one to the tune of \"A Hot Time\";<br />\nHoo with hoo! Johns Hopkins has the ball,<br />\nMaryland, you're rip against a wall,<br />\nAnd when we hit your line, you'll have no him at all;<br />\nThere'll be a hot time in the old town to-night.<br />\nDog-gone it! (Repeat).<br />\n<br />\nAmong the yells, the one which is said by its hearers to produce the most<br />\n<br />\neffect is as follows:<br />\n(Slow)<br />\nRay ! Ray! Ray!<br />\n(Gradually faster) Rah ! rah ! rah ! rah ! rah ! rah ! rah ! rah! rah 1<br />\nJohns Hopkins!<br />\n<br />\nIn this connection, it is interesting to notice the yelling done by the Army<br />\nand Navy Cadets at the game Saturday last. Every man was armed with a<br />\nsmall megaphone, and yelled high, keeping his eye on the leader, not on the<br />\ngame. In drill and time the Cadets were, of course, remarkably good; but several<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\nBaltimore people were heard to say that they had heard more and better songs<br />\nand yells from the Hopkins rooters. The only new song given was one by the<br />\nArmy boys, to the tune of \"Dolly Gray:' The finest feature of the day was<br />\nthe continuance of the Navy's rooting. The sailor boys showed as much enthusiasm when the blue and gold was being shoved back as when it was<br />\nplunging forward.<br />\n\"THE SENIOR FEED.'<br />\nWe have much to be thankful for, for didn't we just draw the gore,<br />\nAs Freshmen and as doughty Juniors toa ?<br />\nBut now that we must settle down and cease to play the jolly clown,<br />\nThere's still a lot of work for us to do.<br />\nWe'll wake old Hopkins from its nap, and close our life here with a snap,—<br />\nFor 'tis very plain that we must take the lead,<br />\nWe have set a new example, and have made ourselves a sample,<br />\nBy having a very jolly Senior feed.<br />\nWe have broken the tradition, that at Hopkins our position<br />\nIs only to imbibe from wisdom's well.<br />\nWisdom's well enough, 'tie true, but we've other interests too,<br />\nAnd what they are I scarcely need to tell.<br />\nNow it may sound very trivial to be jolly and convivial,<br />\nTo neglect our work just for a social feed.<br />\nBut in after life you'll find just such things that stay in mind—<br />\nFor a happy, useful life they sow the seed.<br />\nJust such friendships that we form may prepare us for the storm,<br />\nAnd the men we've known may teach us noble thought,<br />\nBut unless we're thrown perforce into social intercourse,<br />\nOur knowledge of our class-men is as naught.<br />\nIn the dignity of class we may let a fellow pass,<br />\nNot knowing of his best and noblest traits<br />\nTo our class we go in haste, never having time to waste,<br />\nTrying hard to jam some knowledge in our pates.<br />\nIt is only out of college, when we're not engaged with knowledge<br />\nThat we have time to know a man's true worth,<br />\nIt is over pipe and bowl that soul finds kindred soul,<br />\nAnd everlasting friendship finds its birth.<br />\nLet our excellent example to underclassmen be a sample,<br />\nAnd teach them 'tis the very thing to do.<br />\nGet together, have a feed—you'll enjoy it indeed,<br />\nAnd will start a fellow-feeling here that's new.<br />\nWith a rousing hullabaloo for the Seniors tried and true,<br />\n(Pardon us for singing our own glory.)<br />\nI will close these dissertations which I'm sure have tried your patience,—<br />\nAnd trust you've found the moral in my story.<br />\n—F. L. G., '02.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nDECEMBER 6, 1901.<br />\nSubscription $1 50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br />\n<br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902<br />\n. SOL STROUSE, 1902.<br />\n<br />\n.<br />\n<br />\nEBEN C. HILL, 1902.<br />\n<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANIPT, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n<br />\nArt Editor,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nHE foot ball season, which ended last Thursday, was a most successful one.<br />\nThe team made a record of which we are proud, and for which we desire<br />\nto extend heartiest congratulations to the men on the team, to Captain<br />\nGillespie, Coach Dixon, and all who helped in any way to make the season such<br />\na good one. The records stand with but two defeats out of eight games played,<br />\nthe Maryland Inter-Collegiate banner in our trophy room, and the University of<br />\nMaryland, though outweighing our team seven pounds to the man, held to a tie<br />\nscore. The Haverford contest was a glory in defeat; and in the Gallaudet<br />\ngame, which was the only game in which Hopkins was outplayed, five of the<br />\nregular 'Varsity players were absent.<br />\nIn looking over the personnel of this year's championship team the strong<br />\nshowing made by the medical students is at once remarked. In fact, though<br />\nsome of our best men are from the 'undergraduate body, it would be difficult to<br />\nestimate where Hopkins foot ball would be without the'4 meds.\" The \"scrubs\"<br />\nalso should come in for their well earned share of praise, for they have put up<br />\na stiff fight all year against the 'Varsity, and have shown themselves as full of<br />\ngrit and self sacrifice as the men who made the team.<br />\n<br />\nt<br />\n<br />\nt<br />\n<br />\nHE spectators who witnessed the game of foot ball played between Hopkins and St. Johns, were doubtless surprised beyond measure at the unwarranted action of Captain Spates of St. Johns, in ordering his team off<br />\nbecause of an objection to a decision of the referee. Captain Spates<br />\nfield,<br />\nthe<br />\nhas been playing foot ball long enough to know that such a course as the one<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n7<br />\n<br />\npursued by him upon that occasion reflects discredit not only upon him, but<br />\nalso upon the institution which he represents; and particularly does this apply<br />\nin the present case since Hopkins had advanced the ball within a yard of St.<br />\nJohns' goal line. When a team agrees to an official they agree to accept his<br />\ndecisions, and few indeed are the cases when a captain is justified in removing<br />\nhis team from the field. The referee who officiated in the Hopkins—St. Johns<br />\ngame was a man whose absolute fairness, and perfect knowledge of foot ball<br />\ncould not for a moment be questioned. He filled his position with the highest<br />\ndegree of good judgment, and justice, and owing to certain prevailing conditions he was obliged to do all the work of referee, and about three-fourths of<br />\nthat of umpire. The policy Captain Spates pursued was that of doing anything<br />\nto prevent Hopkins scoring, and to prevent this took his team off. To say the<br />\nleast his action was infantile.<br />\n<br />\nO<br />\n<br />\nN another page of this issue of THE NEWS-LETTER is a letter from Mr.<br />\nMyers, the Editor-in Chief of the 1902 Hullabaloo, calling on the whole<br />\nstudent body for assistance in editing this year's book. We desire to<br />\ncall the attention of everybody to the urgent need for all men to work for the<br />\nstudent publications in a sincere and hearty manner. The editorial board on<br />\nthe Hullabaloo consists of seven men, and were the book to contain naught but<br />\nthe work of these men there would be an atmosphere of tameness about it that<br />\nwould necessarily render its literary excellence somewhat inferior to that of a<br />\nproduction containing more varied styles. The plea to work for college spirit<br />\nwill appeal to men who have college spirit; to those who have no inclination to<br />\nwork, but for themselves all appeals will be in vain. No one wants to be<br />\nranked in that class of men, but unless work is done for the student publications, the charge must be laid. It is about time for the men to \"get up and<br />\nwork; the NEWS-LETTER has been very poorly supported this year; and \"The<br />\nHullabaloo\" also calls for aid.<br />\n<br />\nINTERCOLLEGIATE DEBATES.<br />\n<br />\nZ<br />\n<br />\nHE House of Representatives will this week elect their two delegates on the<br />\nAdvisory Board for Intercollegiate Debates. The two senior members of<br />\nthe Board are J. G. Campbell and H. B. Stone; Dr. G. C. Lee is chairman. The Board is to consider all propositions and make all arrangements for<br />\ndebates with other colleges. So far, the only date decided is with the University of North Carolina, early in April; but negotiations are on foot with six<br />\nother institutions, including Columbia and Harvard.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n• iiiwInommigionititimminiumuimuillilliiluinitimmilmilnitaiiiiflimmiummiumnonimmomiummilimmtonwoututhii<br />\n<br />\nI<br />\n<br />\niIN<br />\n<br />\n•<br />\n<br />\n-<br />\n<br />\nI•<br />\n<br />\n•<br />\n<br />\nDr. Frederick M. Warren, Ph. D., of the University in '87, now professor of<br />\nRomance Languages at Yale, will give six lectures on \"The French Realists and<br />\nNaturalists of the 19th Century,\" beginning Monday. December 9, in the<br />\nDonovan Room at 5 P. M. The remaining lectures will be delivered on December 11, 13, 18 and 20. To these lectures the public will be admitted upon payment of $1.50 for the season ticket.<br />\nSaturday last there was a geological expedition to Chautauqua Beach in<br />\ncharge of Dr. George B. Shattuck, associate professor of physiographic geology.<br />\nThe party, including the local teachers who are taking Dr. Shattuck's course,<br />\nwas conveyed down the bay in the steamer Emma Giles, and spent their time<br />\nlooking for fossils in the adjacent swamps.<br />\nFebruary 5, 1902, has been announced as the date of the meeting to commemorate the life and services of the late Dr. H. B. Adams. As previously<br />\nmentioned in the NEWS-LETTRR, the principal address will be by Dr. Richard<br />\nT. Ely, of the University of Wisconsin,<br />\nAt the twelfth annual session of the Morphological Association of America,<br />\nto be held at the University of Chicago, January 1 and 2, the Hopkins will be<br />\nwell represented. Among the professors who will go are Dr. E A. Andrews,<br />\nassociate professor of biology, vice-president of the Association; Dr. Ross G.<br />\nHarrison, associate professor of anatomy; Dr. Caswell Grave, instructor in<br />\nbiology, and Dr. H. McE. Knower, instructor in anatomy. The program for<br />\nthe convention will be announced about December 10 by Dr. Thos. J. Montgomery, of the University of Pennsylvania.<br />\n<br />\nHOSPITAL IMPROVEMENTS.<br />\n<br />\nqp<br />\n<br />\nROGRESS is the word at the Hopkins Hospital, and as a result there have<br />\nrecently been several notable additions to the working plant. First<br />\nshould come the private ward, costing several thousand dollars. Then<br />\nthe telegraph office, in the administration building, which carries on an extensive business, and is a great convenience and money-saver. Then the great ice<br />\nplant, now in course of construction, with a capacity of 15 tons per day, and an<br />\nestimated cost of $10,000. And there is on foot a plan to build a dynamo of<br />\nsufficient power to light the hospital with all its adjuncts. A machine of extraordinary size and power will be needed.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nSIR ROBERT BALL'S LECTURE.<br />\nAST Saturday night a lecture was given in McCoy Hall by Sir Robert Ball,<br />\nF R. S., the greatest living authority in Europe on astronomical science,<br />\nand the man who has done more than any other Englishman to popularize<br />\nthe wonders of astronomical research and discovery. The subject of Professor<br />\nBall's lecture was \"Time and Tide.\" In it he treated the question of<br />\nhow much the influence of the tides and the atmosphere retards the earth's<br />\nprogress, and its tendency to revolve more slowly, causing the days to become longer and longer. This increased length, however, as Professor Ball<br />\ntells us, amounts to only one second in 1000 years, so that there is some chance<br />\nof getting the University out to Homewood before the earth stops running<br />\nentirely.<br />\nProfessor Ball is the Lowndean professor of astronomy and geometry in<br />\nthe University of Cambridge, England, and director of the Cambridge Univer<br />\nsity. During his stay in Baltimore, he was the guest of Dr. Daniel C. Gilman.<br />\n<br />\nt<br />\n<br />\nUNDERGRADUATE HAPPENINGS.<br />\nHE House and Senate will debate this week on the question: \"Resolved,<br />\nThat the Monroe Doctrine should not be defended at the cost of war with<br />\na first-class European power.\" In the House,the teams are: affirmative,<br />\nLanier, Atnmen, Bamberger; negative, Pessagno, Steubenrauch, Hoffman.<br />\n<br />\nt<br />\n<br />\nThe Junior-Freshmen football game and cane rush is to take place Saturday<br />\nof this week. A provisional line up of the two teams is as follows: 1903,1. e.,<br />\nParsons or Winternitz; 1. t., Riley; 1. g., Straus or Treide; c., Marshall or<br />\nHoffman; r. g., Yearley; r. t., Custis or Marshall; r. e., Hazlehurst; 1. h. b.,<br />\nBird; f. b., Plaggemeyer; r. h. b., Blanck (captain). 1904: Ends, Emig and<br />\nStrohbar; tackles, Numsen and Foster; guards, Kohn and Erlanger; center,<br />\nBuckler, 1. h. h., Dickey (captain); f. b., Rosenfeld; 1. h. b., Pearre.<br />\nAMONG THE COLLEGES.<br />\nHE University of Pennsylvania will probably send another crew to England next year to compete in the Henley regatta.<br />\nOne hundred thousand dollars has been appropriated by the War Department for the establishment of the new War College at Washington.<br />\n<br />\nt<br />\n<br />\nColumbia University has offered to grant free tuition to at least five Filipinos, to be recommended by the Government.<br />\nThe smallest University in the world is in Africa. It has five students and<br />\nfifteen instructors.<br />\nWashington and Lee is going to adopt the academic cap and gown as the<br />\nofficial garb of the Faculty and Seniors.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nHarvard, Yale and Princeton have an inter-collegiate news bureau. Nightly<br />\nspecials are wired from each of these Universities to the other two, giving the<br />\nnews of the day.<br />\nThe headmaster of Eton receives $30,000, which is $5,000 more than the<br />\nsalary of Great Britain's Prime Minister.<br />\nHarvard owns an income producing property of ten million dollars, and<br />\nYale one of five million dollars.<br />\nTwo hundred and thirteen scholarships, worth $62,730 per annum, may be<br />\nobtained at Harvard.<br />\nThe University of Oxford has the reputation of having been founded by<br />\nKing Alfred in 872.<br />\nA movement is being agitated to form inter-collegiate \"Fencing Association,\" consisting of Harvard, Columbia, Pennsylvania, Yale, Annapolis, and<br />\nCornell.<br />\nIn a recently completed list, from the most accurate figures obtainable, the<br />\ncolleges in order of size are as follows: Harvard, 6,740; Columbia, 4,392; University of Michigan, 3,813; University of Chicago, 3,774; University of Minnesota, 3,423; University of California, 3,216; Cornell, 3,004; Yale, 2,584; Pennsylvania, 2,573.<br />\nThe students of Lehigh will produce a minstrel show at South Bethlehem<br />\non the evening of December 14.<br />\n<br />\nCornell's Athletic Association has restricted the wearing of college colors<br />\non caps to those members of teams or crews who have engaged in intercollegiate contests.<br />\nThe year at the Yale Co-operative Corporation which ended last June was<br />\none of the most successful in the history of the corporation. A statement of its<br />\nfinances, recently published, shows that during the year a cash business of<br />\n$48,362.97 was done.<br />\nThe famous Yale Boola song, by A. M. Hirsh who caught on the Varsity<br />\nbaseball team last year, is said to have arisen during the Yale-Harvard foot ball<br />\ngame in New Haven, November, 1900.<br />\n<br />\nSpates is a young man and tall,<br />\nHates to be beat in football,<br />\nWith our team near his goal<br />\nAnd his team in a hole<br />\nAll his men off the field he did call.<br />\n—X.,'02.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nJOHNS HOPKINS WINS FROM ST. JOHN'S.<br />\nOHNS HOPKINS is again champion of the Maryland Inter-Collegiate<br />\nLeague, having won the final game, in the championship series, against<br />\nSt. John's on Saturday, November 23, and another championship banner<br />\nwill soon ornament the wall of the trophy room.<br />\nDespite the steady downpour of rain on that afternoon a good sized crowd<br />\nassembled and notwithstanding the fact that the grounds resembled a lake more<br />\nthan a gridiron, it was determined to play the game. Throughout the first<br />\nhalf and up to the last five minutes of play, the game was one of the pluckiest<br />\nfights ever put up by two teams in Baltimore.<br />\nAt that time the ball was on St. John's five-yard line when first down was<br />\ncalled. In the next two downs four yards were gained, and the teams lined up<br />\non the one-yard line. Bernheim called the signals for Hopkins, and, just as<br />\nthe ball was about to be passed, a St. John's man jumped into Campbell. He<br />\nWas just in the act of passing the ball, and the interference caused the oval to<br />\nbe fumbled. In a moment the teams piled upon the sphere. Referee Rich saw<br />\nthe interference by the St. John's player and promptly penalized St. John's by allowing Hopkins a first down. This gave her three downs to make one yard,<br />\nand St. John's refused to play the game out. Only a few minutes of play now<br />\nremained, and undoubtedly Hopkins could have easily scored a touchdown, but<br />\nOwing to St. John's refusal to play, the game was given to the Black and Blue<br />\nby default.<br />\n.<br />\nDuring the first half, St. John's had a slight advantage. They were playlug with the wind and down grade, so that for the most part the oval was in<br />\nHopkins territory. In the second half things were reversed, and from the start<br />\nthe wearers of the Black and Blue were aggressive, and the ball was gradually<br />\ncarried down the field towards the St. John's goal line. Owing to the wind,<br />\nseveral fumbles were made which marred, to some extent, the good character of<br />\nthe play of both sides.<br />\nHopkins kicked off in the first half, and on the line up Randall hit tackle<br />\nfor six yards. Spates gained five through the opposite tackle, but Hopkins<br />\ntook a brace and the ball went over on downs. Blanck and Sayler made slight<br />\ngains through the line and Hopkins got 10 yards for offside play. Blanck went<br />\nthrough for five more, and by going five through left tackle Faris carried the<br />\nball to the 20-yard line. At this point the first fumble gave St. John's the ball.<br />\n<br />\n3<br />\n<br />\n,.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n12<br />\n<br />\nOn the second down the visitors got 10 yards on an offside play, and slight<br />\ngains through the line by the backs advanced the ball about 20 yards, when it<br />\nwent over on downs. Hopkins made several small gains and the visitors again<br />\ntook the ball on an offside play, only to lose it shortly after on downs. Hopkins began to make comfortable gains, when another fumble relersed its fortune.<br />\nThe half ended with the ball in St. John's possession, and in Hopkins territory.<br />\nAt the beginning of the second half, St. John's kicked off, and, upon a<br />\nfumble by Hopkins, a St. John's man fell on the ball. The visitors were soon<br />\nforced to punt, and Blanck downed the hall on Hopkins' 14 yard line. Things<br />\nlooked somewhat blue for the 'Varsity, but 10 yards were gained on an offside<br />\nplay, and Sayler, Gillespie and Faris made gains enough to carry the ball out<br />\nof danger before it was lost on downs. Seth made a pretty gain of eight yards<br />\naround right end, but Hopkins braced and forced Randall to punt. Sayler cut<br />\ninside left end for five yards, and Blanck and Faris made slight gains through<br />\nthe line. The visitors then braced and got the ball on downs. Beatty made<br />\nfive yards on a left end run, and Hopkins took the ball for off-side play.<br />\nFumbles delayed the 'Varsity in nearing St. John's goal, but after several successive punts by the visitors Hopkins went down to their five yard line. A<br />\nfumble again gave St. John's the ball, but her punt out was very poor, and the<br />\n'Varsity again lined up on the visitors' eight yard line.<br />\nFrom here the ball was advanced to the one-yard line where Captain<br />\nSpates acted most unsportsmanslike by withdrawing his team from the field.<br />\nThe line up was as follows:<br />\nHOPKINS.<br />\n<br />\nST. JOHN'S.<br />\n<br />\nGilllespie(captain)<br />\nHill<br />\nGarwood<br />\n<br />\n1. e<br />\n1. t.<br />\n1, g<br />\n<br />\nCampbell<br />\nYearley<br />\nBacon<br />\nRiggs<br />\n<br />\nc.<br />\nr, g<br />\nr. t.<br />\nr. e<br />\n<br />\nBernheim,<br />\nFaris<br />\nSayler<br />\n<br />\nq. b<br />\nI. h. h<br />\nr. h<br />\n<br />\nSeth<br />\nCooper<br />\nHutchins<br />\nBrown<br />\nSpates (capt.)<br />\nBaker<br />\nHoward<br />\nTarbutton<br />\nBeatty<br />\nGarey<br />\nRandall<br />\n<br />\nUmpire—W. B. Izard, U. S. N. A. Referee—E. A. Rich, Trinity College.<br />\nLinesmen—Joel Butler, J. H. U.; Mr. Rohrer, St. John's. Timers—Mr. Melvin, St. John's; W. E. Hoffman, J. H. U. Time—Two 25 minute halves.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n13<br />\n<br />\nUNIVERSITY OF MARYLAND,5. HOPKINS, 5.<br />\nN THE most exciting game of football seen at American League Park this<br />\nseason, Hopkins played her old antagonist, the University of Maryland,<br />\nto a standstill. It was an ideal afternoon for football, and Baltimore<br />\nShowed her appreciation of home talent by an attendance which was highly<br />\ngratifying to the management of both teams.<br />\nMaryland kicked off to Bernheim, who succeeded in advancing the oval 12<br />\nyards, and after one attempt at hitting the line, Hopkins lost on a fumble.<br />\nThe Black and Blue held firmly, however, and soon forced their opponents to<br />\nreturn the pigskin on downs, but, being unable to make the required distance,<br />\nPunted, Gillespie nailed the opposing runner in his tracks, and Maryland then<br />\ntried her little trick of punt by the quarterback which proved unsuccessful in<br />\nthis instance, Hopkins getting the ball. Sayler now made an end run of five<br />\nyards, and Stanek was sent through the line for four more. An offside play by<br />\nMaryland added 10 yards thereto, when Hopkins, finding the leather slippery,<br />\ngave it up on a fumble.<br />\nMaryland then got into the game in a manner which plainly showed that<br />\nshe was putting up her best game of the season. She hit our line for keeps,<br />\nnever failing to make the required distance, and was further helped by getting<br />\n10 yards on an offside play by Hopkins. Mann now made the prettiest run of<br />\nthe day, finding 25 yards around right end an easy mark. Our line was then<br />\nPierced for three more, and on the next play the ball was carried over for a<br />\ntouchdown. Mitchell punted out, but as the punt was not successfully heeled,<br />\nthe score stood 5-0 in Maryland's favor.<br />\nHopkins now kicked off, and Maryland began to attack our line with<br />\nsteady perseverance, making very little more than the required distance each<br />\ntime. This style of play being too slow, Mann again proffered his services to<br />\nthe extent of 15 yards, but was tackled so hard in making the run, that he went<br />\nout of the game considerably injured, and the half ended with the oval on Hopkins' 28 yard line.<br />\nBetween the halves the field was at the disposal of the rooters, who were<br />\nnot slow to make themselves both seen and heard. The Hopkins bunch marched<br />\naround four deep, giving the new locomotive yell, and songs, while the other<br />\nside promenaded to the tune of \"Maryland, My Maryland,\" by a brass band<br />\nWhich they brought with them. Cheers were given for the ladies, Dean Griffin,<br />\nthe teams, and \"our royal selves,\" then both squads returned to opposite<br />\nbleachers to watch the finish.<br />\nSayler kicked off for Hopkins, and the ball was brought to the 20 yard line.<br />\nMaryland, now finding the Hopkins line impenetrable, surrendered the pigskin<br />\non downs. Hopkins in turn keeping up her reputation for a much better game<br />\nIn the second half than in the first, went to work in dead earnest. Faris started<br />\nwith 20 yards around left end, and Sayler followed with five, round the opposite<br />\nend. Blanck was shoved through the line for two, and Faris tore off seven<br />\nmore around right end. Blanck was now sent through twice in succession,<br />\n<br />\n5<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ncarrying the ball over for a touchdown on the second play. Sayler did his best<br />\nbut failed, and the score stood 5-5.<br />\nDuring the remainder of the game, the ball stayed in Hopkins' territory<br />\nmost of the time, and punts seemed to he the order of the day, the pigskin<br />\nbeing punted back and forth by each side, at short intervals, with little gain to<br />\neither side. The second half ended with the ball in Maryland's possession, on<br />\nher eight yard line.<br />\nBoth teams played fast, clean football from start to finish, and it was only<br />\nby the hardest and most desperate work of either side that the other was prevented<br />\nfrom winning the victory. The University of Maryland has good reason to be<br />\nproud of the game which her team put up, and the Hopkins men are well satisfied with the results which good coaching and hard, earnest practice have<br />\naccomplished.<br />\nFor the Black and Blue, Sayler, Gillespie, Garwood, Blanck, and Faris<br />\nplayed in great shape, while Mann, Rudolph, and Mitchell seemed to do the<br />\nbest work for the other side. The rooting was first class in every respect, being<br />\ndecidedly the best of the season. Bets were few and far between, as the supporters of the Black and Blue wanted slight odds.<br />\nThe line up was as follows:<br />\nHOPKINS.<br />\n<br />\nUNIV. OF MD.<br />\n<br />\nGillespie<br />\n1. e.<br />\nDan ne<br />\n.•<br />\nHoughton<br />\nr. e<br />\nWinslow<br />\nYoutz<br />\n1. t•<br />\nScott<br />\nBacon.<br />\nr. t<br />\nDrewery<br />\nGarwood<br />\n1. g.<br />\nGribble<br />\nYearley.<br />\nr. g.<br />\nMitchell<br />\nCampbell<br />\nc.<br />\nBuck<br />\nBernheim<br />\nq b<br />\nCoffey<br />\nFaris.<br />\n1. h. b.<br />\nMann, McCordell<br />\nSayler<br />\nr. h<br />\nSappington<br />\nBlanck<br />\nf. b<br />\nRudolph<br />\nReferee—Gresham Poe. Umpire—Cassler.<br />\nLinesmen—Weil and Franklin. Timers—Hoffman and Burns.<br />\nTime—Two 20 minute halves.<br />\n<br />\nFOOT BALL SCORES.<br />\nOct. 12—J. H. U<br />\n.24, Rock Hill<br />\n5<br />\n\" 19—J. H. U<br />\n6, Md. Ag. College<br />\n0<br />\n\" 26—J. H. U<br />\n0, Gallaudet<br />\n12<br />\nNov. 2—J H U<br />\n0, Haverford<br />\n5<br />\nI<br />\n1)<br />\nJ. H<br />\nU<br />\n21, Delaware College<br />\n0<br />\nI6—J H U<br />\n11, Western Md. College<br />\n213—.3 H<br />\n, St. Johns<br />\n.(won by default).<br />\n28—J. H U<br />\n5, University of Maryland<br />\n5<br />\nTotal points won- 73. Total points lost-27.<br />\nTouch downs—Gillespie 4, Blanck 3, Sayler 2, Faris 1, Riggs 1, Straus 1, Sharrett 1.<br />\nGoals kicked by Sayler —8. No. of chalices, 13.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\nA NEW LACROSSE LEAGUE.<br />\n<br />\nt<br />\n<br />\nHE Lacrosse problem was brought to a successful issue last Saturday in<br />\nPhiladelphia. The convention assembled at Hotel Lafayette, and delegates met from Lehigh, Swarthmore, and Hopkins. Ex-Captain<br />\nAbercrombie and Capt. Schmeisser represented the University.<br />\nOn the ninth of November a preliminary meeting was held, at which the<br />\nquestion of forming a new league was proposed by Hopkins. In the meantime<br />\nthe writing of the rules and the constitution was left in the hands of Abercrombie<br />\nLast Saturday the proposed rules were formally adopted, and a permanent<br />\nleague formed, under the name of the Inter-Collegiate Lacrosse Association of<br />\nthe United States.<br />\nThe first officers of the new league for the ensuing year were elected as<br />\nfollows:<br />\nPresident—R. T. Abercrombie, Johns Hopkins University.<br />\nVice President—W. K. Shivelly, Lehigh.<br />\nSecretary and Treasurer—Nathan C. Manakee, Swarthmore.<br />\nThe schedule for the league games was arranged as follows:<br />\nApril 26—Hopkins vs. Lehigh, at Lehigh.<br />\nMay 3—Swarthmore vs. Lehigh, at Swarthmore.<br />\nMay 10—Swarthmore vs. Hopkins, at Baltimore.<br />\nThe University has just reason to be proud of the successful accomplishment of this effort to form a new league, as the incentive when fighting for<br />\nsomething is much greater than when playing random games. The first league<br />\nwas formed in 1891, and lasted till 1900, when it was broken up on account of<br />\nsome difficulty between Stevens and Hopkins. It was solely at the instigation<br />\nof the latter that the leagne was dissolved, and at the same time it was through<br />\nthe earnest efforts of our lacrosse representatives that the new league was formed.<br />\nThe fact that Abercrombie was President of the old league and has bsen elected<br />\nto the same office in the new one, is the highest evidence of the confidence and<br />\ngood- will of the other members of the league toward us, and we feel that such a<br />\nleague, with Stevens debarred on account of her misbehavior, is the best thing<br />\nthat could happen for lacrosse as a national institution.<br />\n<br />\nA NEW WORLD'S HISTORY.<br />\nPublished 1950.<br />\nExtract Vol. II.<br />\n<br />\nPa. 92, Caption \"Sport.\"<br />\n<br />\nN the year 1901, when the game of foot ball was a great sport at the American colleges, there entered the city of Baltimore a crowd of young men,<br />\nwith good looking clothes, and good looking girls. These men hailed<br />\nfrom Annapolis, a town consisting of St. John's College and a government<br />\nnaval training school, and they belonge I to the College. They had entered the<br />\ntown in great numbers, among whom were some fifteen warriors, who were to<br />\n<br />\n43<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nbattle on the gridiron with the Johns Hopkins University for the championship<br />\nof the pigskin. These doughty men were so sure of victory over their rivals<br />\nthat they had assured the pretty ladies accompanying them that they would<br />\nbring nought but a crown of glory for their locks. Ah, it was a knightly gathering for a knightly purpose! It was a revival of the time of Richard.<br />\nOn the afternoon of that eventful day the heavens even were so proud of<br />\nthis knightly array that they wept tears of joy. But these unexpected tears<br />\nonly acted as a damper on the canvas clad knights, who were used to open<br />\npractice in fair weather; and when they lined up against the big men from<br />\nthe Hopkins, they had a faint suspicion that perhaps the crown of glory was<br />\nnot for their hands to crown their maidens fair. When the whistle blew, the<br />\ntwo teams 1:ned up amidst vociferous cheering from the stands, in which the<br />\nmany pretty maidens from Annapolis joined. Thus they urged their knights<br />\nto victory; and the knights of St. John's had determined that unless they<br />\ncould bring victory they would bring nothing. The men of the Hopkins fought<br />\na grim, hard battle against these bold warriors, until, at the end of the first<br />\nhalf, both the teams had the same round egg against their names.<br />\nIn the second part of this game, the men of Hopkins had evidently become<br />\nstronger, whereas the St. John's team was losing ground on every line-up.<br />\nTherefore, believing that everything is fair in war and love, the foreign knights<br />\nwere guilty of several unknightly misdemeanors against their opponents, who,<br />\ndespite these actions, gradually carried the ball near the goal St. John's was<br />\ndefending. The pigskin knights could not let the pretty ladies see defeat on<br />\ntheir banner, so when the referee of the contest penalized them for unknightly<br />\naction, they did the only thing real sportsmen could do,—they ran off the field.<br />\nThus they gave the game to the other side, and were not defeated! They could<br />\nstill look their ladies straight in the face without blushing over shameful defeat,<br />\nand with manly pride could tell of their sportsmanlike action in saving them<br />\nthe disgrace of seeing the better team win, Such noble acts helped to keep a<br />\nhigh level in Maryland sports, and the St. John's men deserve the thanks of<br />\nour ages for thus establishing an unexpectedly noble precedent.<br />\nA PARADOX.<br />\nDan Cupid is a marksman poor<br />\nDospites his loves and kisses,<br />\nFor while he always hits the mark,<br />\nHe's always making Mrs.—Widow.<br />\nBreathes there a man with soul a)dead,<br />\nWho never to himself has said,<br />\nAs he stubbed his toe against the bed,<br />\n! ! —?—Ex.<br />\n—? —?<br />\nLives of foot-ball men remind us<br />\nThat they write their names in blood;<br />\nAnd, departing, leave behind them,<br />\nHalf their faces in the mud.—Kr.<br />\n<br />\n—as&<br />\n<br />\n\f17<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nLJERY—Were the \"honeyed words\" of Homer the same as the candid<br />\ntruths of to-day.—Lamboon.<br />\n<br />\n(r),<br />\n<br />\nTHE SOPHOMORE—I hear 1902 has music at the class game.<br />\nTHE JUNIOR —Yes, but 1903 has the score.—Lampoon.<br />\nLACROSSE PRACTICE.<br />\n(As seen from the sidewalk.)<br />\nFIRST MUCKER —Say, Mike, woes dat de Charlie-boys are passin' de time<br />\nwid now?<br />\nSECOND MUCKER — Ah, dat's just de Bughunter Club trying to catch butterflies.—Lampoon.<br />\nThis road of life is thick with clogging dust,<br />\nAnd we, the drudges, bend to duty's \"must!\"<br />\nThen ho! for every chance, my trusty,<br />\nTo snatch a song and a glass of musty! —Lampoon.<br />\n<br />\nETHEL— (coyly):<br />\n<br />\n\"What a pretty mouth you have.<br />\n<br />\nIt ought to be on a<br />\n<br />\ngirl's face.\"<br />\n<br />\nJACK—\"I seldom miss an opportunity.\"—Tiger.<br />\nTRuESPORT—\"Let's<br />\n<br />\nmatch for the cigars.\"<br />\n<br />\nCOLDFEET—\"Naw. I've got a headache.\"<br />\nTRUESPORT—\"Let's match for the beers.\"<br />\nCOLDFEET—\"Naw. I've got a headache\"'<br />\nTRUESPORT—(triumphantly)—''Well then, I'll match you to see who buys<br />\nthe headache cures*\"— Widow.<br />\nThere once were some co-eds they Hay,<br />\nWho wore caps and gowns every day,<br />\nFor, as every one knows,<br />\nIt's a saving in clothes,<br />\nWhen their place is supplied in this way.— Widow.<br />\n<br />\n\f18<br />\n<br />\nTHE NEWS-LETTER.<br />\nS.<br />\n<br />\n8c<br />\n675 West Baltimore Street,<br />\n• Between Arch and Pine Sta. Baltimore, Md.<br />\n<br />\nL1M3Et'_''75<br />\n<br />\nWEST BALTIMORE LOAN CO<br />\n<br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIA MON DS A SPECIALTY.<br />\n<br />\nOPEN<br />\n<br />\nFROM<br />\n<br />\n7<br />\n<br />\nA.<br />\n<br />\nM. TO<br />\n<br />\nP.<br />\n<br />\n6<br />\n<br />\nM.<br />\n<br />\nSATURDAYS<br />\n<br />\nSIDE ENTRANCE<br />\n<br />\nWITH<br />\n<br />\nDIXON Lc CO.<br />\n<br />\no PPt•PLIi 6<br />\n29-31<br />\n<br />\nS. Charles St<br />\n<br />\nA, [I, EETTING<br />\n<br />\nF36ltirnore, Md.<br />\nMANUFACTURER<br />\n<br />\nUNTIL 10 P<br />\n<br />\nM.<br />\n<br />\nPRIVATE WAITING ROOM.<br />\n<br />\nPi6turcs.<br />\n<br />\nFRANKE &<br />\nPURNELLCO.<br />\n<br />\npp2minn<br />\nurnilly.<br />\n<br />\n224 N. HOWARD ST.<br />\n<br />\nOF<br />\n<br />\n(Breen Setter<br />\nfraternitv aewelrp.<br />\n<br />\n14 A N D 16 ST. PAUL STREET,<br />\n<br />\nBALTIMORE,<br />\nAAAAAA<br />\n<br />\nCALL AND EXAMINE OUR<br />\n<br />\nMD.<br />\n<br />\nLINE 11110151<br />\n<br />\nNNE<br />\n<br />\nPURCHASING.<br />\n<br />\nBonbons, Chocolates,<br />\n<br />\n.1. 11. ROBINSON.<br />\nINANI/FACTURNR<br />\n<br />\n• FINE<br />\n<br />\n4)<br />\n<br />\nCONFECTIONS.<br />\n<br />\nOF<br />\n<br />\nCIGARS,<br />\n<br />\nDII.11.1.1<br />\n<br />\nFRESH EVERY HOUR. SENT BY MAIL OR EXPRESS.<br />\n<br />\nIX<br />\n<br />\nPO RAMO, CIGARS AND FINIOKIORS' ARpter.acs,<br />\nSTATIONERY.<br />\n626 N. )1ITJTAW ST.<br />\nBALTIMORE, MD.<br />\nBaltimore, New York & Philadelphia Papers.<br />\nC. & P. Public Telephone, Madison 1185Y.<br />\n<br />\n14<br />\n<br />\nEAST<br />\n<br />\nBALTIMORE STREET.<br />\n<br />\nDesigning and Cutting by E. Michaelson.<br />\n<br />\nE. MIGRIIELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n<br />\nALTERING AND REPAIRING.<br />\n<br />\n821 Iladison Avenue,<br />\n<br />\nSpecial discount to Students.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nA. D. SMITH & SONS,<br />\nyolinerly<br />\nLEVERING & SMITH,<br />\n104<br />\n<br />\nWEST<br />\n<br />\nLEXINGTON<br />\n<br />\nSTREET.<br />\n<br />\nREADY TO WEAR HATS for Ladies, Misses<br />\nand Children.<br />\nIn the Latent Desturts.<br />\nMEN'S HATS--Derbys and Soft Felts.<br />\n<br />\nCO<br />\n'1<br />\nr<br />\nIN I.(oir ult 7IMQ Pt I N91,71113T6.<br />\nMO POOOf. COO kIAOII<br />\n<br />\n7in<br />\n<br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENMEYER, Prop.<br />\n<br />\nCHOICE WINES, LIQUORS AND CIGARS<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET<br />\nLadies' and Gentlemen's Dining Rooms.<br />\nMeals Served at All Hours,<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\n<br />\nProst. & Mgr.<br />\n<br />\nWedding Silver Gifts<br />\nsilversmiths.<br />\n<br />\nderSOn<br />\n'<br />\nS<br />\n<br />\nManufacturers of<br />\nSilk and Cassiinere Hats. if<br />\n<br />\nHOPKINS CAPS<br />\n<br />\nF3<br />\n1211111G & COMPANY' St<br />\nation<br />\n<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nCertificate of Analysis from<br />\n<br />\nII. R. EISENBRANDT SONS,<br />\n<br />\nfor<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\n<br />\nN STRBLER GO.<br />\n<br />\n701 to 705<br />\n\"..JORDA<br />\nMADISON AVE.<br />\nReads as follows: Samples submitted of<br />\n!Prom% 'randy—no<br />\nadulterants, no coloring,fine quality.<br />\nttporto Port—absolutely pure of superior quality.<br />\n.,PerrY—no coloring or adulterants,<br />\nabsolutely pure wine.<br />\n'<br />\nWhiskey—no Fusel oil, no caramel, strictly pure<br />\na\"(1 old,<br />\n011y<br />\nvid 6(<br />\n\"I—all tests show pure olive oil.<br />\n-er<br />\n\"gar—natural cider vinegar, strictly pure and<br />\nsa<br />\n—roux.<br />\n81x Orounal Spiess —no adulteration, all strictly pure.<br />\nADVERTISING SPACE IN THIS PAPER<br />\n<br />\nMUSIC, PIANOS, ORGANS.<br />\nN.CHARLES ST.<br />\nBALTIMORE, MD.<br />\n<br />\n201-203<br />\n<br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br />\n<br />\nSouth<br />\n<br />\nPEARRE E. GROWL COMPANY.<br />\nPUBLISHERS.<br />\n<br />\nand Lombard Sts., Baltimore.<br />\n<br />\nSurplus and Profits $450,000.<br />\nCapital, $650,000<br />\nAccounts of Hanks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\nLIGHT AND LOMBARD STREETS<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier,<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\n<br />\nAPPLY To<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nORTII GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nPor particulars apply to<br />\n<br />\nand<br />\n<br />\n.<br />\n<br />\nes.<br />\ner's<br />\n<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law MEDICAL, CLASSICAL AND MiSOILLANCOU• BOOK*<br />\nKeeps constantly on hand the Text Books used in Johns<br />\n<br />\nPeofs. G. W. Lehman & Son,<br />\n<br />\nFOR<br />\n<br />\nETC.<br />\n<br />\n824 WEST 13AL/FIMORE STREET.<br />\n<br />\nC<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText hooka. Note Rooks.<br />\n3tudent's<br />\nMadison &Howard Sts.<br />\n&applies.<br />\n<br />\nOM<br />\n<br />\nR & LC).<br />\n<br />\nFZ.11<br />\n<br />\nNV<br />\n<br />\nUMBRELLAS, HATTERS, CANES,<br />\nAgent for Lincoln& Bennett and<br />\nWalter Barnard's London Hata.<br />\n<br />\nIN GREAT VARIETY.<br />\n<br />\ntien<br />\n<br />\nJAMES R. PAINE.<br />\n<br />\nTHEO. \\\\* MINNA.<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\n.5t JENKINS.<br />\nCHARLES ST.<br />\n<br />\nH. MoMAIN9, D.0.,<br />\nSeciy. & Treas.<br />\n<br />\nMARIA BUIE, D. 0.,<br />\nV.-Prod.& Asst. See'y.<br />\n<br />\nW. D. BOWEN, M. D., D.0.,<br />\n<br />\nA. SCHUMACHER Zir<br />\n<br />\nGeneral Agents.<br />\n<br />\n00.,<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES, GENOA, ETC.<br />\nBALTI.MORE TO BREMEN<br />\nDIRECT,.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO of rt<br />\nTAUGHT SY<br />\n<br />\nC. J. LEVIN,<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStndio, 331 N. Charles St.<br />\n<br />\nthe Itran3g:Znifth<br />\npiano CO.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nilgenfritz Studio<br />\n<br />\nCbicker1ng, 313rabburp anb relebstei<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nBaltimore<br />\n<br />\n20 West Lexington St.<br />\n<br />\nSpecial Discount to Students<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\n<br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n203 W.BALTIMORE ST.& 2 S.<br />\nBALTIMORE, MD.<br />\n<br />\nLIBERTY<br />\n<br />\nSr.<br />\n<br />\nMembers of<br />\nNew York Stock Exchange<br />\n.<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE & CO.,<br />\nBANKERS & BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n'Pianos.<br />\n<br />\n0<br />\nJA .<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Willms Surgical Instrument Company<br />\nBENJ. A. NELSON, OIN'L MANAGER<br />\n<br />\nPhysicians,' Surgeons, Hospital and Invalid Supplies.<br />\nFine Microscopes and Aooessories.<br />\n<br />\nFactory Prices<br />\n<br />\nC. & P.'Phone 2322-2.<br />\n<br />\nGE<br />\nSMITH'S s0Hr?<br />\nOLD<br />\nBOOK<br />\n805 N.<br />\nSTORE<br />\nE<br />\njaT&<br />\nBOOKS<br />\n<br />\nHOWARD STREET,<br />\n3rd door from Madison.<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEW<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged, ...<br />\n605 N. Eutaw Street.<br />\n<br />\nWM. V.PIPPEN,<br />\n<br />\nA. H Rutherfoord<br />\nF. Lents.<br />\n<br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br />\n<br />\nJ. WM. MIDDENDORF & CO.<br />\n36anhero &16rohers.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore, Md.<br />\nBaltimore Stock It xchange.<br />\n<br />\nDrovers and Mechanics National Dank,<br />\n<br />\nBOOKS AND STATIONERY<br />\n<br />\n300<br />\n<br />\nN. Howard St.,<br />\n<br />\nOF BALTIMORE, MD.<br />\n<br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\nYOUIR EVLS<br />\n<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\n<br />\nTHINK IT OVER.<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n521 North Charles Street, (Masonic Temple.)<br />\n<br />\nKXFVMINING OPTICIFMNS.<br />\nTHE NEWS LETTER<br />\n<br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\n144c'. 308 1\\I c.i.x.t<br />\n<br />\nCl-ies.s-liems mt.,<br />\n<br />\nY. M. C. A. 'BUILDING,<br />\nBALTIMORE, MD.<br />\nC.& P. and Md.'Phones.<br />\n<br />\nCALL ON<br />\n<br />\n(HIS. It. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC<br />\n<br />\nWalrle •<br />\n<br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitations, Diplomas,<br />\n.<br />\nPrograms, V hitting Cards, ete<br />\nOur 50o J. ft. U. Mae and Black Plea Paper—now rsadil.<br />\nThere Is very little entertainment at home without a Plane<br />\n<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nBALTIMORE<br />\nLight and Lombard Streets,<br />\nWe carry a full line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br />\n<br />\n5TIEFF<br />\nPIANos<br />\nlire The Best.<br />\n9 N. Libertu St.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol VI. Nos 5<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\nSIALTiMoRE. MO.<br />\nI.<br /><br />\n.11.111.1.01.11111M<br /><br />\nTwentg-61xth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\n.<br />\nPresident,<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n•<br /><br />\nIRA REMSEN.<br />\nWM. H. HOWELL.<br />\nROW. H. GRIFFIN.<br /><br />\n•<br /><br />\nINSTRUCTION<br />\nPor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(h) In Medicine. (Courses for candidates for the degree of M. D.; cours.:s for physician9.)<br />\nFor Undergraduates:<br />\n(0) As candidstem for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody institute<br />\nPratt Library<br /><br />\n. .<br /><br />\n100,000 volumes.<br />\n135,000 volumes.<br />\n...... 200.000 volumes.<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysies,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nA nutorny,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nIra Remsen.<br />\nJoseph N. Ames.<br />\nWilliam B. Mark.<br />\nWilliam K. nrw,ks.<br />\nFranklin P. Mall.<br />\nWilliam 11. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Older.<br /><br />\nSeminaries.<br />\nGreek,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,:<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nUndergraduates Courses (leading to B. A.)<br /><br />\nAmerican Journal of Mathematics,<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XX IV<br />\nIn progress. $5 per volume.<br />\nII. American Chemical Journal.<br />\nI. ItEMSEN, Editor. Monthly. 8vo. Volume X XV1<br />\nin progress. $5 per volume.<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERALFIEVR, Editor. Quarterly. livo.<br />\nVolume XXII in progress. $1 per volume.<br />\nIV. Studies from the Biological Laboratory. 8vo.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. ;8 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XX In progress. $1 per year.<br />\nVU. John Hopkins Hospital Bulletin. Monthly. 4th.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nIX. Contributions to A scsyrIology and Comparative<br />\nSemitic,Philology,(Ifeltrage zur Assyriologie, etc.)<br />\nVol. IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume TV complete. $7.50<br />\nper volume.<br />\nXl. Modern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthlr. 4to. Volume<br />\nXVI in progress. $1.50 per volume.<br />\nX i I. Journal of Experimental Medicine.<br />\nW. H.<br />\nEditor. Bi-monthly. See. Volume<br />\nVI in progrems. SA per volume.<br />\nXIII. American Journal of Insanity.<br />\nEN RY M. HU Li D, Editor. Quarterly. 4to.,$5 per<br />\nvolume.<br />\nX IV. Reports of Maryland Geological Survey,<br />\nWILLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nC. A. DAUBS, Editor. Quarterly.<br />\navo. Volume VI in progress. $1.50 per volumo.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nGroups.<br />\nI. classical(the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.)<br />\n3. hefuleal-Biological.<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n0. Historical-Political.<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nEditors.<br />\nMathematics(vol. X X I V.)<br />\nFrank Morley.<br />\nIra Bentsen.<br />\nChemistry (vol. X X V I).<br />\n•<br />\nPhilology (vol. XX II.)<br />\nBasil L. Gildersleeve.<br />\nHiatory vol. XIX.)<br />\nJ. .31. Vincent,<br />\nMoiOpi Anguages(vol. XVI.) A. Marshall Elliot I.<br />\nWilliam K. Brooks.<br />\nBiolo k (vol. 1V.)<br />\nPaul Haupt.<br />\nAss)r oldgy (vol. IV.)<br />\nExperimental Medicine (vol. VI.) W. H. Welch.<br /><br />\nProgrammes Of the Courses offered to graduate studontsla Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiste<br />\nCourses, will be sent on appliaa Mon to the Registry r.<br /><br />\nIn addition to the aerials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the 01(1<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectrum.<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 110 pp. 4to. La plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. oendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MSS. with Antilegomena Epistles. Edited by 1. H. Hall. $3.00.<br />\nBibliographla Hopkinsiensis. Part I. Philology. Parts<br />\nChemistry, Mineralogy and Geology. Parts<br />\nIV-V-vi.Physies, Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nR lull list of publications will be sent on application.<br />\nCommunications In respeo`, to exchanges and remittances<br />\n,nag be sent to Johns Hopkins Press, Baltimore. Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nDECEMBER 6, 1901.<br /><br />\nNo. 5.<br /><br />\nHOW ARTHUR ROWED.— A JOHNS HOPKINS STORY.<br />\nRTHUR Hugh Harrison,\" he wrote with a leisurely flourish on the<br />\nlast sheet of the folded examination papers before him. Then he laid<br />\nthem on a green covered table behind which the Dean sat regarding<br />\nhint with benign countenance, and strolled through the broad corridor of McCoy<br />\nHall, glancing at the bulletins and portraits with an air of new-found proprietorship. Under the red arch at the entrance he paused to bask in the placid<br />\nJune sunshine, looking with idle interest at the queer apparatus in the laboratory<br />\nwindows and asking himself what he should do next.<br />\nAll this was clear temptation of fate. In the ante-appropriation days at<br />\nHopkins, before hazing had become a forbidden and forgotten art, it was the<br />\nPlain duty of a new-fledged freshman on finishing his June examinations, to go<br />\nstraight homeward looking both to the right and to the left ready to run and<br />\nloath to parley. While Arthur lingered Macy came up and saluted him with<br />\ncordial and hearty interest in his welfare. Arthur was pleased; he thought for<br />\na flitting moment of certain warnings of his fellow-freshmen, but Macy was a<br />\nlittle fellow and alone, and he talked guilelessly. So Arthur banished suspicion.<br />\nHe opened his heart about the Vergil \"exam.\" He had \"hit it hard.\" \"How<br />\nwas it last year?\" he asked.<br />\nJust then Arthur was conscious of a touch on his arm and gentle jostling<br />\nfrom behind, and of Macy pleasantly inviting him to walk around the corner<br />\nfor a little informal further examination.<br />\n\"Yes, do!\" said voices behind and on both sides, with more gentle jost64<br /><br />\nling.<br />\nNow Arthur tempted fate no longer. He wisely concluded that he could not<br />\nafford to neglect so importunate an invitation, and he went along, though somewhat unwillingly. His hosts piloted him with care and close attention through<br />\nlittle Garden street and up the dusty stairs of a vacant house to the second<br />\nfloor. The first room was crowded by boisterous juniors who made the air<br />\ndense with the smoke of their pipes and the dust of their stamping. Before Arthur had time to see what was going on, he was hurried into the next room and<br />\nPut under guard in the corner.<br />\nHere, above the confusion he heard questions asked in a fierce voice punctuated by raps of a cane on the floor and answered timidl y.<br />\n\"What's your name?\" asked the voice. \"What school do you come from?<br />\n— What did your mamma send you to Hopkins for?—What, you don't know!<br />\nSing us a song.—Now bark like a terrier. There's a rat under that pile of<br />\nboards. After him! Gnaw there with your teeth!\"<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nPresently it was Arthur's turn to be examined. As he was led into the<br />\nroom, curses and the confused sound of stumbling feet came up the stairway.<br />\n\"Gangway!\" yelled Macy leading the way, and half a dozen juniors followed him lugging an exasperated, incoherent burden which Arthur recognized<br />\nas Gary, a Virginia student of tempestuous temper and wiry frame. He was<br />\nnot put in the corner but on a pile of old lumber in the first room where a man<br />\nsat on each end of him, and where. as one of his captors remarked all might<br />\nenjoy the choice flavor of his profanity.<br />\nNow the examiners turned their attention to Arthur. Billy Lawson, president of his class, glib of tongue and fleet of foot, a \"bully\" goal at lacrosse<br />\nand \"no slouch\" with the gloves, was seated in the only chgir the room afforded,<br />\nwielding a heavy cane.<br />\n\"Your name, sir!\" he thundered with a resounding tap on the floor. Arthur answered meekly enough.<br />\n\"Do give the poor dear some milk, he looks pale,\" drawled a lanky junior<br />\nwith a Carolina twang in his voice; and Arthur wore a bib and sucked at the<br />\nblack nipple of a nursing bottle while the juniors stamped approval. He danced<br />\nfor them, sang \"Annie Rooney,\" then a recent favorite, purred like a cat,<br />\nsalaamed to the crowd in turn, and answered foolish questions until his patience<br />\nsuffered under the strain, and he longed to strike out right and left. A glance<br />\nat Gary, uncomfortably prostrate and still sullenly rebellious, told him that<br />\nwould be a blunder, and once more he forebore to tempt his fate.<br />\nPresently he became cooler. The joke was on him, he thought, hut it was<br />\nnot altogether without its humor; and he began to answer Billy's questions a<br />\nbit flippantly. Then in a moment of forgetfulness he ventured to be a trifle<br />\nwitty.<br />\nThe lapse was fateful. In those ante-appropriation days it was a fact<br />\nknown to the wise that the nearer a hazed freshman could approach to a state<br />\nof uninspired idiocy the briefer his ordeal would be. It was also well known<br />\nthat the least attempt to be facetious, above all at the expense of the hazers,<br />\nwas morally certain to prolong it.<br />\nBilly looked stern for a moment and then went on with his questions.<br />\n\"Can you row?\" he asked, smiling his sweetest.<br />\n\"Yes, a little,\" replied Arthur innocently.<br />\n'Ah, indeed. You must show us how well you can row. Boys, two of<br />\nyou take the gentleman into the next room and help him put on his rowing<br />\nsuit,' commanded Billy.<br />\nIn the next room Arthur stripped somewhat reluctantly, taking off everything except one blue garter. This was left because, as one of his attendants<br />\nremarked, \"it would hardly be proper for him to take off all his clothes.\"<br />\nWhen they came in again a tin basin full of ice water—made of ice filched<br />\nfrom the McCoy Hall water cooler—had been set in the middle of the floor.<br />\nTwo match sticks were brought forward with much deliberation and put into<br />\nhis hands for oars. Then Billy rose, and pointing to the basin said politely :<br />\n`Will you be good enough to take your seat in the lake and row?\"<br /><br />\n3<br /><br />\nTHE NEWS-LETTER.<br /><br />\nArthur hesitated, but a dozen ungentle hands were ready to help him to<br />\nhis seat, and he decided to comply. Down he sat with a splash, gripping the<br />\nmatch sticks tightly, and stretched-out his sunburned arms for the word.<br />\n\"Go!\" yelled Billy, and Arthur, bending his naked back to the labor and<br />\nfanning the smoke-laden air with mighty strokes, while the juniors howled and<br />\nstamped, rowed his way into worthy freshmanhood at Hopkins. J. C. F. '99.<br /><br />\nTHE 1902 HULLABALOO.<br /><br />\nT IS the purpose of the Board of Editors to<br /><br />\nmake the Hullabaloo for 1902,<br />\nthoroughly representative of all the various interests at the University;<br />\nand iii order to accomplish this purpose, we require the active and hearty<br />\nco-operation of all true Hopkins men. The Hullabaloo, though published by<br />\nthe Senior Class, is not a mere class- book; it is the University annual, and as<br />\nsuch should be supported by the members of all the various classes. Seniors,<br />\nJuniors, freshmen, sub freshmen, graduates, and special students, all should<br />\ngive it their earnest support, and with their support and co-operation we hope<br />\nto produce a book well worthy of a place in the first rank of Hopkins Hullaba-<br /><br />\n3<br /><br />\noos.<br />\nLet every man try to prepare a story, or a poem, or a drawing, expressing<br />\nsome phase of Hopkins life, or of college life in general. There are assuredly<br />\namong the Hopkins students men capable of preparing enough contributions of<br />\nthis sort to fill a book twice the size of the Hullabaloo, and we want every man<br />\nto feel that it is his duty to put forth his best efforts in working for this book.<br />\nSome of the best work in previous Hullabaloos has been done by men not members of the respective classes which published these books; and though as<br />\nSeniors we should regret being excelled by members of other classes, as editors,<br />\nand as men interested in the welfare of all Hopkins' enterprises, we should be<br />\nonly too glad to receive contributions surpassing anything which we could do<br />\nin the same line. No man knows of what work he is capable, until he makes<br />\nan earnest and determined effort. Therefore, let every man do his best, and<br />\nsend us the results of his work.<br />\nWith the loyal support of the Hopkins students we shall be able to produce a book that will be as good as, if not better than, any college or university annual in this country. Reader, we need your co-operation to attain this<br />\nend. Summon up all your college spirit, and help us to show that in college<br />\ndePublications, as well as in study, and in athletics, the Johns Hopkins<br />\nserves a prominent place.<br /><br />\nCHARLES A. MYERS,<br />\nBox 449, J. H. U.<br /><br />\nEditor in Chief.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n4<br /><br />\nMUSICAL CLUBS.<br /><br />\nt<br /><br />\nIIE first concert of the Musical Clubs was given at the Hopkins Hospital<br />\nFriday afternoon of last week. The result of the work of the Glee Club<br />\nshould be most encouraging to its members and leader; rarely for many<br />\nyears has a club shown up so well at the first concert. The men held together<br />\nadmirably, with only one or two exceptions; they seemed to know the pieces,<br />\nand put plenty of spirit and go into the songs.<br />\nThe Mandolin Club played only one new piece—the \"Tell Me, Pretty<br />\nMaiden,\" from \"Florodora.\" They went at it with fairly good snap, but need<br />\nto get more accuracy and delicacy into the complicated runs. The cello and<br />\nclarinet, and the horn, which helped to hold up the mandolins the two seasons<br />\npast, are much missed, and there are places on the club ready for players of<br />\nthese instruments.<br />\nThe Banjo Club took a sadly needed brace in the second piece—\"Policy<br />\nSam,\" by Sousa,—and did itself some credit. This last is more than could be<br />\nsaid of the \"Mosquito Parade\" with which they started. However, the verdict<br />\nof the grads. in the back of the hall was favorable: \"Just the way it always is<br />\nthe first time;\" \"They're on the road to improvement.\"<br />\nA program of the numbers was issued, which was cheerfully disregarded<br />\nby all but the Glee Club.<br />\nOn the whole, the concert was not unsuccessful, but the Clubs have their<br />\nwork cut out for them before their next appearance, which is at Roland Park,<br />\nDecember 8th.<br /><br />\nMAKING A CHEERFUL NOISE.<br />\nURING the stress of the recent football excitement, several new songs and<br />\nyells have been produced by the College talent. Good interest has been<br />\nshown in learning them, and the rooters' repertory is now much increased. Of the songs, the most popular is W. B. Carver's \"Our College in<br />\nDixie Land,\" closely followed by one to the tune of \"A Hot Time\";<br />\nHoo with hoo! Johns Hopkins has the ball,<br />\nMaryland, you're rip against a wall,<br />\nAnd when we hit your line, you'll have no him at all;<br />\nThere'll be a hot time in the old town to-night.<br />\nDog-gone it! (Repeat).<br /><br />\nAmong the yells, the one which is said by its hearers to produce the most<br /><br />\neffect is as follows:<br />\n(Slow)<br />\nRay ! Ray! Ray!<br />\n(Gradually faster) Rah ! rah ! rah ! rah ! rah ! rah ! rah ! rah! rah 1<br />\nJohns Hopkins!<br /><br />\nIn this connection, it is interesting to notice the yelling done by the Army<br />\nand Navy Cadets at the game Saturday last. Every man was armed with a<br />\nsmall megaphone, and yelled high, keeping his eye on the leader, not on the<br />\ngame. In drill and time the Cadets were, of course, remarkably good; but several<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\nBaltimore people were heard to say that they had heard more and better songs<br />\nand yells from the Hopkins rooters. The only new song given was one by the<br />\nArmy boys, to the tune of \"Dolly Gray:' The finest feature of the day was<br />\nthe continuance of the Navy's rooting. The sailor boys showed as much enthusiasm when the blue and gold was being shoved back as when it was<br />\nplunging forward.<br />\n\"THE SENIOR FEED.'<br />\nWe have much to be thankful for, for didn't we just draw the gore,<br />\nAs Freshmen and as doughty Juniors toa ?<br />\nBut now that we must settle down and cease to play the jolly clown,<br />\nThere's still a lot of work for us to do.<br />\nWe'll wake old Hopkins from its nap, and close our life here with a snap,—<br />\nFor 'tis very plain that we must take the lead,<br />\nWe have set a new example, and have made ourselves a sample,<br />\nBy having a very jolly Senior feed.<br />\nWe have broken the tradition, that at Hopkins our position<br />\nIs only to imbibe from wisdom's well.<br />\nWisdom's well enough, 'tie true, but we've other interests too,<br />\nAnd what they are I scarcely need to tell.<br />\nNow it may sound very trivial to be jolly and convivial,<br />\nTo neglect our work just for a social feed.<br />\nBut in after life you'll find just such things that stay in mind—<br />\nFor a happy, useful life they sow the seed.<br />\nJust such friendships that we form may prepare us for the storm,<br />\nAnd the men we've known may teach us noble thought,<br />\nBut unless we're thrown perforce into social intercourse,<br />\nOur knowledge of our class-men is as naught.<br />\nIn the dignity of class we may let a fellow pass,<br />\nNot knowing of his best and noblest traits<br />\nTo our class we go in haste, never having time to waste,<br />\nTrying hard to jam some knowledge in our pates.<br />\nIt is only out of college, when we're not engaged with knowledge<br />\nThat we have time to know a man's true worth,<br />\nIt is over pipe and bowl that soul finds kindred soul,<br />\nAnd everlasting friendship finds its birth.<br />\nLet our excellent example to underclassmen be a sample,<br />\nAnd teach them 'tis the very thing to do.<br />\nGet together, have a feed—you'll enjoy it indeed,<br />\nAnd will start a fellow-feeling here that's new.<br />\nWith a rousing hullabaloo for the Seniors tried and true,<br />\n(Pardon us for singing our own glory.)<br />\nI will close these dissertations which I'm sure have tried your patience,—<br />\nAnd trust you've found the moral in my story.<br />\n—F. L. G., '02.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nDECEMBER 6, 1901.<br />\nSubscription $1 50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editors,<br /><br />\n10 Cents a single copy.<br />\nWILLIAM B. HILL, 1902<br />\n. SOL STROUSE, 1902.<br /><br />\n.<br /><br />\nEBEN C. HILL, 1902.<br /><br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nCHARLES F. RANIPT, 1902.<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br /><br />\nArt Editor,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to WILLIAM B. HILL, box 269, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nHE foot ball season, which ended last Thursday, was a most successful one.<br />\nThe team made a record of which we are proud, and for which we desire<br />\nto extend heartiest congratulations to the men on the team, to Captain<br />\nGillespie, Coach Dixon, and all who helped in any way to make the season such<br />\na good one. The records stand with but two defeats out of eight games played,<br />\nthe Maryland Inter-Collegiate banner in our trophy room, and the University of<br />\nMaryland, though outweighing our team seven pounds to the man, held to a tie<br />\nscore. The Haverford contest was a glory in defeat; and in the Gallaudet<br />\ngame, which was the only game in which Hopkins was outplayed, five of the<br />\nregular 'Varsity players were absent.<br />\nIn looking over the personnel of this year's championship team the strong<br />\nshowing made by the medical students is at once remarked. In fact, though<br />\nsome of our best men are from the 'undergraduate body, it would be difficult to<br />\nestimate where Hopkins foot ball would be without the'4 meds.\" The \"scrubs\"<br />\nalso should come in for their well earned share of praise, for they have put up<br />\na stiff fight all year against the 'Varsity, and have shown themselves as full of<br />\ngrit and self sacrifice as the men who made the team.<br /><br />\nt<br /><br />\nt<br /><br />\nHE spectators who witnessed the game of foot ball played between Hopkins and St. Johns, were doubtless surprised beyond measure at the unwarranted action of Captain Spates of St. Johns, in ordering his team off<br />\nbecause of an objection to a decision of the referee. Captain Spates<br />\nfield,<br />\nthe<br />\nhas been playing foot ball long enough to know that such a course as the one<br /><br />\nTHE NEWS—LETTER.<br /><br />\n7<br /><br />\npursued by him upon that occasion reflects discredit not only upon him, but<br />\nalso upon the institution which he represents; and particularly does this apply<br />\nin the present case since Hopkins had advanced the ball within a yard of St.<br />\nJohns' goal line. When a team agrees to an official they agree to accept his<br />\ndecisions, and few indeed are the cases when a captain is justified in removing<br />\nhis team from the field. The referee who officiated in the Hopkins—St. Johns<br />\ngame was a man whose absolute fairness, and perfect knowledge of foot ball<br />\ncould not for a moment be questioned. He filled his position with the highest<br />\ndegree of good judgment, and justice, and owing to certain prevailing conditions he was obliged to do all the work of referee, and about three-fourths of<br />\nthat of umpire. The policy Captain Spates pursued was that of doing anything<br />\nto prevent Hopkins scoring, and to prevent this took his team off. To say the<br />\nleast his action was infantile.<br /><br />\nO<br /><br />\nN another page of this issue of THE NEWS-LETTER is a letter from Mr.<br />\nMyers, the Editor-in Chief of the 1902 Hullabaloo, calling on the whole<br />\nstudent body for assistance in editing this year's book. We desire to<br />\ncall the attention of everybody to the urgent need for all men to work for the<br />\nstudent publications in a sincere and hearty manner. The editorial board on<br />\nthe Hullabaloo consists of seven men, and were the book to contain naught but<br />\nthe work of these men there would be an atmosphere of tameness about it that<br />\nwould necessarily render its literary excellence somewhat inferior to that of a<br />\nproduction containing more varied styles. The plea to work for college spirit<br />\nwill appeal to men who have college spirit; to those who have no inclination to<br />\nwork, but for themselves all appeals will be in vain. No one wants to be<br />\nranked in that class of men, but unless work is done for the student publications, the charge must be laid. It is about time for the men to \"get up and<br />\nwork; the NEWS-LETTER has been very poorly supported this year; and \"The<br />\nHullabaloo\" also calls for aid.<br /><br />\nINTERCOLLEGIATE DEBATES.<br /><br />\nZ<br /><br />\nHE House of Representatives will this week elect their two delegates on the<br />\nAdvisory Board for Intercollegiate Debates. The two senior members of<br />\nthe Board are J. G. Campbell and H. B. Stone; Dr. G. C. Lee is chairman. The Board is to consider all propositions and make all arrangements for<br />\ndebates with other colleges. So far, the only date decided is with the University of North Carolina, early in April; but negotiations are on foot with six<br />\nother institutions, including Columbia and Harvard.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n• iiiwInommigionititimminiumuimuillilliiluinitimmilmilnitaiiiiflimmiummiumnonimmomiummilimmtonwoututhii<br /><br />\nI<br /><br />\niIN<br /><br />\n•<br /><br />\n-<br /><br />\nI•<br /><br />\n•<br /><br />\nDr. Frederick M. Warren, Ph. D., of the University in '87, now professor of<br />\nRomance Languages at Yale, will give six lectures on \"The French Realists and<br />\nNaturalists of the 19th Century,\" beginning Monday. December 9, in the<br />\nDonovan Room at 5 P. M. The remaining lectures will be delivered on December 11, 13, 18 and 20. To these lectures the public will be admitted upon payment of $1.50 for the season ticket.<br />\nSaturday last there was a geological expedition to Chautauqua Beach in<br />\ncharge of Dr. George B. Shattuck, associate professor of physiographic geology.<br />\nThe party, including the local teachers who are taking Dr. Shattuck's course,<br />\nwas conveyed down the bay in the steamer Emma Giles, and spent their time<br />\nlooking for fossils in the adjacent swamps.<br />\nFebruary 5, 1902, has been announced as the date of the meeting to commemorate the life and services of the late Dr. H. B. Adams. As previously<br />\nmentioned in the NEWS-LETTRR, the principal address will be by Dr. Richard<br />\nT. Ely, of the University of Wisconsin,<br />\nAt the twelfth annual session of the Morphological Association of America,<br />\nto be held at the University of Chicago, January 1 and 2, the Hopkins will be<br />\nwell represented. Among the professors who will go are Dr. E A. Andrews,<br />\nassociate professor of biology, vice-president of the Association; Dr. Ross G.<br />\nHarrison, associate professor of anatomy; Dr. Caswell Grave, instructor in<br />\nbiology, and Dr. H. McE. Knower, instructor in anatomy. The program for<br />\nthe convention will be announced about December 10 by Dr. Thos. J. Montgomery, of the University of Pennsylvania.<br /><br />\nHOSPITAL IMPROVEMENTS.<br /><br />\nqp<br /><br />\nROGRESS is the word at the Hopkins Hospital, and as a result there have<br />\nrecently been several notable additions to the working plant. First<br />\nshould come the private ward, costing several thousand dollars. Then<br />\nthe telegraph office, in the administration building, which carries on an extensive business, and is a great convenience and money-saver. Then the great ice<br />\nplant, now in course of construction, with a capacity of 15 tons per day, and an<br />\nestimated cost of $10,000. And there is on foot a plan to build a dynamo of<br />\nsufficient power to light the hospital with all its adjuncts. A machine of extraordinary size and power will be needed.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nSIR ROBERT BALL'S LECTURE.<br />\nAST Saturday night a lecture was given in McCoy Hall by Sir Robert Ball,<br />\nF R. S., the greatest living authority in Europe on astronomical science,<br />\nand the man who has done more than any other Englishman to popularize<br />\nthe wonders of astronomical research and discovery. The subject of Professor<br />\nBall's lecture was \"Time and Tide.\" In it he treated the question of<br />\nhow much the influence of the tides and the atmosphere retards the earth's<br />\nprogress, and its tendency to revolve more slowly, causing the days to become longer and longer. This increased length, however, as Professor Ball<br />\ntells us, amounts to only one second in 1000 years, so that there is some chance<br />\nof getting the University out to Homewood before the earth stops running<br />\nentirely.<br />\nProfessor Ball is the Lowndean professor of astronomy and geometry in<br />\nthe University of Cambridge, England, and director of the Cambridge Univer<br />\nsity. During his stay in Baltimore, he was the guest of Dr. Daniel C. Gilman.<br /><br />\nt<br /><br />\nUNDERGRADUATE HAPPENINGS.<br />\nHE House and Senate will debate this week on the question: \"Resolved,<br />\nThat the Monroe Doctrine should not be defended at the cost of war with<br />\na first-class European power.\" In the House,the teams are: affirmative,<br />\nLanier, Atnmen, Bamberger; negative, Pessagno, Steubenrauch, Hoffman.<br /><br />\nt<br /><br />\nThe Junior-Freshmen football game and cane rush is to take place Saturday<br />\nof this week. A provisional line up of the two teams is as follows: 1903,1. e.,<br />\nParsons or Winternitz; 1. t., Riley; 1. g., Straus or Treide; c., Marshall or<br />\nHoffman; r. g., Yearley; r. t., Custis or Marshall; r. e., Hazlehurst; 1. h. b.,<br />\nBird; f. b., Plaggemeyer; r. h. b., Blanck (captain). 1904: Ends, Emig and<br />\nStrohbar; tackles, Numsen and Foster; guards, Kohn and Erlanger; center,<br />\nBuckler, 1. h. h., Dickey (captain); f. b., Rosenfeld; 1. h. b., Pearre.<br />\nAMONG THE COLLEGES.<br />\nHE University of Pennsylvania will probably send another crew to England next year to compete in the Henley regatta.<br />\nOne hundred thousand dollars has been appropriated by the War Department for the establishment of the new War College at Washington.<br /><br />\nt<br /><br />\nColumbia University has offered to grant free tuition to at least five Filipinos, to be recommended by the Government.<br />\nThe smallest University in the world is in Africa. It has five students and<br />\nfifteen instructors.<br />\nWashington and Lee is going to adopt the academic cap and gown as the<br />\nofficial garb of the Faculty and Seniors.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nHarvard, Yale and Princeton have an inter-collegiate news bureau. Nightly<br />\nspecials are wired from each of these Universities to the other two, giving the<br />\nnews of the day.<br />\nThe headmaster of Eton receives $30,000, which is $5,000 more than the<br />\nsalary of Great Britain's Prime Minister.<br />\nHarvard owns an income producing property of ten million dollars, and<br />\nYale one of five million dollars.<br />\nTwo hundred and thirteen scholarships, worth $62,730 per annum, may be<br />\nobtained at Harvard.<br />\nThe University of Oxford has the reputation of having been founded by<br />\nKing Alfred in 872.<br />\nA movement is being agitated to form inter-collegiate \"Fencing Association,\" consisting of Harvard, Columbia, Pennsylvania, Yale, Annapolis, and<br />\nCornell.<br />\nIn a recently completed list, from the most accurate figures obtainable, the<br />\ncolleges in order of size are as follows: Harvard, 6,740; Columbia, 4,392; University of Michigan, 3,813; University of Chicago, 3,774; University of Minnesota, 3,423; University of California, 3,216; Cornell, 3,004; Yale, 2,584; Pennsylvania, 2,573.<br />\nThe students of Lehigh will produce a minstrel show at South Bethlehem<br />\non the evening of December 14.<br /><br />\nCornell's Athletic Association has restricted the wearing of college colors<br />\non caps to those members of teams or crews who have engaged in intercollegiate contests.<br />\nThe year at the Yale Co-operative Corporation which ended last June was<br />\none of the most successful in the history of the corporation. A statement of its<br />\nfinances, recently published, shows that during the year a cash business of<br />\n$48,362.97 was done.<br />\nThe famous Yale Boola song, by A. M. Hirsh who caught on the Varsity<br />\nbaseball team last year, is said to have arisen during the Yale-Harvard foot ball<br />\ngame in New Haven, November, 1900.<br /><br />\nSpates is a young man and tall,<br />\nHates to be beat in football,<br />\nWith our team near his goal<br />\nAnd his team in a hole<br />\nAll his men off the field he did call.<br />\n—X.,'02.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nJOHNS HOPKINS WINS FROM ST. JOHN'S.<br />\nOHNS HOPKINS is again champion of the Maryland Inter-Collegiate<br />\nLeague, having won the final game, in the championship series, against<br />\nSt. John's on Saturday, November 23, and another championship banner<br />\nwill soon ornament the wall of the trophy room.<br />\nDespite the steady downpour of rain on that afternoon a good sized crowd<br />\nassembled and notwithstanding the fact that the grounds resembled a lake more<br />\nthan a gridiron, it was determined to play the game. Throughout the first<br />\nhalf and up to the last five minutes of play, the game was one of the pluckiest<br />\nfights ever put up by two teams in Baltimore.<br />\nAt that time the ball was on St. John's five-yard line when first down was<br />\ncalled. In the next two downs four yards were gained, and the teams lined up<br />\non the one-yard line. Bernheim called the signals for Hopkins, and, just as<br />\nthe ball was about to be passed, a St. John's man jumped into Campbell. He<br />\nWas just in the act of passing the ball, and the interference caused the oval to<br />\nbe fumbled. In a moment the teams piled upon the sphere. Referee Rich saw<br />\nthe interference by the St. John's player and promptly penalized St. John's by allowing Hopkins a first down. This gave her three downs to make one yard,<br />\nand St. John's refused to play the game out. Only a few minutes of play now<br />\nremained, and undoubtedly Hopkins could have easily scored a touchdown, but<br />\nOwing to St. John's refusal to play, the game was given to the Black and Blue<br />\nby default.<br />\n.<br />\nDuring the first half, St. John's had a slight advantage. They were playlug with the wind and down grade, so that for the most part the oval was in<br />\nHopkins territory. In the second half things were reversed, and from the start<br />\nthe wearers of the Black and Blue were aggressive, and the ball was gradually<br />\ncarried down the field towards the St. John's goal line. Owing to the wind,<br />\nseveral fumbles were made which marred, to some extent, the good character of<br />\nthe play of both sides.<br />\nHopkins kicked off in the first half, and on the line up Randall hit tackle<br />\nfor six yards. Spates gained five through the opposite tackle, but Hopkins<br />\ntook a brace and the ball went over on downs. Blanck and Sayler made slight<br />\ngains through the line and Hopkins got 10 yards for offside play. Blanck went<br />\nthrough for five more, and by going five through left tackle Faris carried the<br />\nball to the 20-yard line. At this point the first fumble gave St. John's the ball.<br /><br />\n3<br /><br />\n,.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n12<br /><br />\nOn the second down the visitors got 10 yards on an offside play, and slight<br />\ngains through the line by the backs advanced the ball about 20 yards, when it<br />\nwent over on downs. Hopkins made several small gains and the visitors again<br />\ntook the ball on an offside play, only to lose it shortly after on downs. Hopkins began to make comfortable gains, when another fumble relersed its fortune.<br />\nThe half ended with the ball in St. John's possession, and in Hopkins territory.<br />\nAt the beginning of the second half, St. John's kicked off, and, upon a<br />\nfumble by Hopkins, a St. John's man fell on the ball. The visitors were soon<br />\nforced to punt, and Blanck downed the hall on Hopkins' 14 yard line. Things<br />\nlooked somewhat blue for the 'Varsity, but 10 yards were gained on an offside<br />\nplay, and Sayler, Gillespie and Faris made gains enough to carry the ball out<br />\nof danger before it was lost on downs. Seth made a pretty gain of eight yards<br />\naround right end, but Hopkins braced and forced Randall to punt. Sayler cut<br />\ninside left end for five yards, and Blanck and Faris made slight gains through<br />\nthe line. The visitors then braced and got the ball on downs. Beatty made<br />\nfive yards on a left end run, and Hopkins took the ball for off-side play.<br />\nFumbles delayed the 'Varsity in nearing St. John's goal, but after several successive punts by the visitors Hopkins went down to their five yard line. A<br />\nfumble again gave St. John's the ball, but her punt out was very poor, and the<br />\n'Varsity again lined up on the visitors' eight yard line.<br />\nFrom here the ball was advanced to the one-yard line where Captain<br />\nSpates acted most unsportsmanslike by withdrawing his team from the field.<br />\nThe line up was as follows:<br />\nHOPKINS.<br /><br />\nST. JOHN'S.<br /><br />\nGilllespie(captain)<br />\nHill<br />\nGarwood<br /><br />\n1. e<br />\n1. t.<br />\n1, g<br /><br />\nCampbell<br />\nYearley<br />\nBacon<br />\nRiggs<br /><br />\nc.<br />\nr, g<br />\nr. t.<br />\nr. e<br /><br />\nBernheim,<br />\nFaris<br />\nSayler<br /><br />\nq. b<br />\nI. h. h<br />\nr. h<br /><br />\nSeth<br />\nCooper<br />\nHutchins<br />\nBrown<br />\nSpates (capt.)<br />\nBaker<br />\nHoward<br />\nTarbutton<br />\nBeatty<br />\nGarey<br />\nRandall<br /><br />\nUmpire—W. B. Izard, U. S. N. A. Referee—E. A. Rich, Trinity College.<br />\nLinesmen—Joel Butler, J. H. U.; Mr. Rohrer, St. John's. Timers—Mr. Melvin, St. John's; W. E. Hoffman, J. H. U. Time—Two 25 minute halves.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n13<br /><br />\nUNIVERSITY OF MARYLAND,5. HOPKINS, 5.<br />\nN THE most exciting game of football seen at American League Park this<br />\nseason, Hopkins played her old antagonist, the University of Maryland,<br />\nto a standstill. It was an ideal afternoon for football, and Baltimore<br />\nShowed her appreciation of home talent by an attendance which was highly<br />\ngratifying to the management of both teams.<br />\nMaryland kicked off to Bernheim, who succeeded in advancing the oval 12<br />\nyards, and after one attempt at hitting the line, Hopkins lost on a fumble.<br />\nThe Black and Blue held firmly, however, and soon forced their opponents to<br />\nreturn the pigskin on downs, but, being unable to make the required distance,<br />\nPunted, Gillespie nailed the opposing runner in his tracks, and Maryland then<br />\ntried her little trick of punt by the quarterback which proved unsuccessful in<br />\nthis instance, Hopkins getting the ball. Sayler now made an end run of five<br />\nyards, and Stanek was sent through the line for four more. An offside play by<br />\nMaryland added 10 yards thereto, when Hopkins, finding the leather slippery,<br />\ngave it up on a fumble.<br />\nMaryland then got into the game in a manner which plainly showed that<br />\nshe was putting up her best game of the season. She hit our line for keeps,<br />\nnever failing to make the required distance, and was further helped by getting<br />\n10 yards on an offside play by Hopkins. Mann now made the prettiest run of<br />\nthe day, finding 25 yards around right end an easy mark. Our line was then<br />\nPierced for three more, and on the next play the ball was carried over for a<br />\ntouchdown. Mitchell punted out, but as the punt was not successfully heeled,<br />\nthe score stood 5-0 in Maryland's favor.<br />\nHopkins now kicked off, and Maryland began to attack our line with<br />\nsteady perseverance, making very little more than the required distance each<br />\ntime. This style of play being too slow, Mann again proffered his services to<br />\nthe extent of 15 yards, but was tackled so hard in making the run, that he went<br />\nout of the game considerably injured, and the half ended with the oval on Hopkins' 28 yard line.<br />\nBetween the halves the field was at the disposal of the rooters, who were<br />\nnot slow to make themselves both seen and heard. The Hopkins bunch marched<br />\naround four deep, giving the new locomotive yell, and songs, while the other<br />\nside promenaded to the tune of \"Maryland, My Maryland,\" by a brass band<br />\nWhich they brought with them. Cheers were given for the ladies, Dean Griffin,<br />\nthe teams, and \"our royal selves,\" then both squads returned to opposite<br />\nbleachers to watch the finish.<br />\nSayler kicked off for Hopkins, and the ball was brought to the 20 yard line.<br />\nMaryland, now finding the Hopkins line impenetrable, surrendered the pigskin<br />\non downs. Hopkins in turn keeping up her reputation for a much better game<br />\nIn the second half than in the first, went to work in dead earnest. Faris started<br />\nwith 20 yards around left end, and Sayler followed with five, round the opposite<br />\nend. Blanck was shoved through the line for two, and Faris tore off seven<br />\nmore around right end. Blanck was now sent through twice in succession,<br /><br />\n5<br /><br />\n14<br /><br />\nTHE NEWS-LETTER.<br /><br />\ncarrying the ball over for a touchdown on the second play. Sayler did his best<br />\nbut failed, and the score stood 5-5.<br />\nDuring the remainder of the game, the ball stayed in Hopkins' territory<br />\nmost of the time, and punts seemed to he the order of the day, the pigskin<br />\nbeing punted back and forth by each side, at short intervals, with little gain to<br />\neither side. The second half ended with the ball in Maryland's possession, on<br />\nher eight yard line.<br />\nBoth teams played fast, clean football from start to finish, and it was only<br />\nby the hardest and most desperate work of either side that the other was prevented<br />\nfrom winning the victory. The University of Maryland has good reason to be<br />\nproud of the game which her team put up, and the Hopkins men are well satisfied with the results which good coaching and hard, earnest practice have<br />\naccomplished.<br />\nFor the Black and Blue, Sayler, Gillespie, Garwood, Blanck, and Faris<br />\nplayed in great shape, while Mann, Rudolph, and Mitchell seemed to do the<br />\nbest work for the other side. The rooting was first class in every respect, being<br />\ndecidedly the best of the season. Bets were few and far between, as the supporters of the Black and Blue wanted slight odds.<br />\nThe line up was as follows:<br />\nHOPKINS.<br /><br />\nUNIV. OF MD.<br /><br />\nGillespie<br />\n1. e.<br />\nDan ne<br />\n.•<br />\nHoughton<br />\nr. e<br />\nWinslow<br />\nYoutz<br />\n1. t•<br />\nScott<br />\nBacon.<br />\nr. t<br />\nDrewery<br />\nGarwood<br />\n1. g.<br />\nGribble<br />\nYearley.<br />\nr. g.<br />\nMitchell<br />\nCampbell<br />\nc.<br />\nBuck<br />\nBernheim<br />\nq b<br />\nCoffey<br />\nFaris.<br />\n1. h. b.<br />\nMann, McCordell<br />\nSayler<br />\nr. h<br />\nSappington<br />\nBlanck<br />\nf. b<br />\nRudolph<br />\nReferee—Gresham Poe. Umpire—Cassler.<br />\nLinesmen—Weil and Franklin. Timers—Hoffman and Burns.<br />\nTime—Two 20 minute halves.<br /><br />\nFOOT BALL SCORES.<br />\nOct. 12—J. H. U<br />\n.24, Rock Hill<br />\n5<br />\n\" 19—J. H. U<br />\n6, Md. Ag. College<br />\n0<br />\n\" 26—J. H. U<br />\n0, Gallaudet<br />\n12<br />\nNov. 2—J H U<br />\n0, Haverford<br />\n5<br />\nI<br />\n1)<br />\nJ. H<br />\nU<br />\n21, Delaware College<br />\n0<br />\nI6—J H U<br />\n11, Western Md. College<br />\n213—.3 H<br />\n, St. Johns<br />\n.(won by default).<br />\n28—J. H U<br />\n5, University of Maryland<br />\n5<br />\nTotal points won- 73. Total points lost-27.<br />\nTouch downs—Gillespie 4, Blanck 3, Sayler 2, Faris 1, Riggs 1, Straus 1, Sharrett 1.<br />\nGoals kicked by Sayler —8. No. of chalices, 13.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\nA NEW LACROSSE LEAGUE.<br /><br />\nt<br /><br />\nHE Lacrosse problem was brought to a successful issue last Saturday in<br />\nPhiladelphia. The convention assembled at Hotel Lafayette, and delegates met from Lehigh, Swarthmore, and Hopkins. Ex-Captain<br />\nAbercrombie and Capt. Schmeisser represented the University.<br />\nOn the ninth of November a preliminary meeting was held, at which the<br />\nquestion of forming a new league was proposed by Hopkins. In the meantime<br />\nthe writing of the rules and the constitution was left in the hands of Abercrombie<br />\nLast Saturday the proposed rules were formally adopted, and a permanent<br />\nleague formed, under the name of the Inter-Collegiate Lacrosse Association of<br />\nthe United States.<br />\nThe first officers of the new league for the ensuing year were elected as<br />\nfollows:<br />\nPresident—R. T. Abercrombie, Johns Hopkins University.<br />\nVice President—W. K. Shivelly, Lehigh.<br />\nSecretary and Treasurer—Nathan C. Manakee, Swarthmore.<br />\nThe schedule for the league games was arranged as follows:<br />\nApril 26—Hopkins vs. Lehigh, at Lehigh.<br />\nMay 3—Swarthmore vs. Lehigh, at Swarthmore.<br />\nMay 10—Swarthmore vs. Hopkins, at Baltimore.<br />\nThe University has just reason to be proud of the successful accomplishment of this effort to form a new league, as the incentive when fighting for<br />\nsomething is much greater than when playing random games. The first league<br />\nwas formed in 1891, and lasted till 1900, when it was broken up on account of<br />\nsome difficulty between Stevens and Hopkins. It was solely at the instigation<br />\nof the latter that the leagne was dissolved, and at the same time it was through<br />\nthe earnest efforts of our lacrosse representatives that the new league was formed.<br />\nThe fact that Abercrombie was President of the old league and has bsen elected<br />\nto the same office in the new one, is the highest evidence of the confidence and<br />\ngood- will of the other members of the league toward us, and we feel that such a<br />\nleague, with Stevens debarred on account of her misbehavior, is the best thing<br />\nthat could happen for lacrosse as a national institution.<br /><br />\nA NEW WORLD'S HISTORY.<br />\nPublished 1950.<br />\nExtract Vol. II.<br /><br />\nPa. 92, Caption \"Sport.\"<br /><br />\nN the year 1901, when the game of foot ball was a great sport at the American colleges, there entered the city of Baltimore a crowd of young men,<br />\nwith good looking clothes, and good looking girls. These men hailed<br />\nfrom Annapolis, a town consisting of St. John's College and a government<br />\nnaval training school, and they belonge I to the College. They had entered the<br />\ntown in great numbers, among whom were some fifteen warriors, who were to<br /><br />\n43<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br /><br />\nbattle on the gridiron with the Johns Hopkins University for the championship<br />\nof the pigskin. These doughty men were so sure of victory over their rivals<br />\nthat they had assured the pretty ladies accompanying them that they would<br />\nbring nought but a crown of glory for their locks. Ah, it was a knightly gathering for a knightly purpose! It was a revival of the time of Richard.<br />\nOn the afternoon of that eventful day the heavens even were so proud of<br />\nthis knightly array that they wept tears of joy. But these unexpected tears<br />\nonly acted as a damper on the canvas clad knights, who were used to open<br />\npractice in fair weather; and when they lined up against the big men from<br />\nthe Hopkins, they had a faint suspicion that perhaps the crown of glory was<br />\nnot for their hands to crown their maidens fair. When the whistle blew, the<br />\ntwo teams 1:ned up amidst vociferous cheering from the stands, in which the<br />\nmany pretty maidens from Annapolis joined. Thus they urged their knights<br />\nto victory; and the knights of St. John's had determined that unless they<br />\ncould bring victory they would bring nothing. The men of the Hopkins fought<br />\na grim, hard battle against these bold warriors, until, at the end of the first<br />\nhalf, both the teams had the same round egg against their names.<br />\nIn the second part of this game, the men of Hopkins had evidently become<br />\nstronger, whereas the St. John's team was losing ground on every line-up.<br />\nTherefore, believing that everything is fair in war and love, the foreign knights<br />\nwere guilty of several unknightly misdemeanors against their opponents, who,<br />\ndespite these actions, gradually carried the ball near the goal St. John's was<br />\ndefending. The pigskin knights could not let the pretty ladies see defeat on<br />\ntheir banner, so when the referee of the contest penalized them for unknightly<br />\naction, they did the only thing real sportsmen could do,—they ran off the field.<br />\nThus they gave the game to the other side, and were not defeated! They could<br />\nstill look their ladies straight in the face without blushing over shameful defeat,<br />\nand with manly pride could tell of their sportsmanlike action in saving them<br />\nthe disgrace of seeing the better team win, Such noble acts helped to keep a<br />\nhigh level in Maryland sports, and the St. John's men deserve the thanks of<br />\nour ages for thus establishing an unexpectedly noble precedent.<br />\nA PARADOX.<br />\nDan Cupid is a marksman poor<br />\nDospites his loves and kisses,<br />\nFor while he always hits the mark,<br />\nHe's always making Mrs.—Widow.<br />\nBreathes there a man with soul a)dead,<br />\nWho never to himself has said,<br />\nAs he stubbed his toe against the bed,<br />\n! ! —?—Ex.<br />\n—? —?<br />\nLives of foot-ball men remind us<br />\nThat they write their names in blood;<br />\nAnd, departing, leave behind them,<br />\nHalf their faces in the mud.—Kr.<br /><br />\n—as&amp;<br /><br />\n17<br /><br />\nTHE NEWS—LETTER.<br /><br />\nLJERY—Were the \"honeyed words\" of Homer the same as the candid<br />\ntruths of to-day.—Lamboon.<br /><br />\n(r),<br /><br />\nTHE SOPHOMORE—I hear 1902 has music at the class game.<br />\nTHE JUNIOR —Yes, but 1903 has the score.—Lampoon.<br />\nLACROSSE PRACTICE.<br />\n(As seen from the sidewalk.)<br />\nFIRST MUCKER —Say, Mike, woes dat de Charlie-boys are passin' de time<br />\nwid now?<br />\nSECOND MUCKER — Ah, dat's just de Bughunter Club trying to catch butterflies.—Lampoon.<br />\nThis road of life is thick with clogging dust,<br />\nAnd we, the drudges, bend to duty's \"must!\"<br />\nThen ho! for every chance, my trusty,<br />\nTo snatch a song and a glass of musty! —Lampoon.<br /><br />\nETHEL— (coyly):<br /><br />\n\"What a pretty mouth you have.<br /><br />\nIt ought to be on a<br /><br />\ngirl's face.\"<br /><br />\nJACK—\"I seldom miss an opportunity.\"—Tiger.<br />\nTRuESPORT—\"Let's<br /><br />\nmatch for the cigars.\"<br /><br />\nCOLDFEET—\"Naw. I've got a headache.\"<br />\nTRUESPORT—\"Let's match for the beers.\"<br />\nCOLDFEET—\"Naw. I've got a headache\"'<br />\nTRUESPORT—(triumphantly)—''Well then, I'll match you to see who buys<br />\nthe headache cures*\"— Widow.<br />\nThere once were some co-eds they Hay,<br />\nWho wore caps and gowns every day,<br />\nFor, as every one knows,<br />\nIt's a saving in clothes,<br />\nWhen their place is supplied in this way.— Widow.<br /><br />\n18<br /><br />\nTHE NEWS-LETTER.<br />\nS.<br /><br />\n8c<br />\n675 West Baltimore Street,<br />\n• Between Arch and Pine Sta. Baltimore, Md.<br /><br />\nL1M3Et'_''75<br /><br />\nWEST BALTIMORE LOAN CO<br /><br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIA MON DS A SPECIALTY.<br /><br />\nOPEN<br /><br />\nFROM<br /><br />\n7<br /><br />\nA.<br /><br />\nM. TO<br /><br />\nP.<br /><br />\n6<br /><br />\nM.<br /><br />\nSATURDAYS<br /><br />\nSIDE ENTRANCE<br /><br />\nWITH<br /><br />\nDIXON Lc CO.<br /><br />\no PPt•PLIi 6<br />\n29-31<br /><br />\nS. Charles St<br /><br />\nA, [I, EETTING<br /><br />\nF36ltirnore, Md.<br />\nMANUFACTURER<br /><br />\nUNTIL 10 P<br /><br />\nM.<br /><br />\nPRIVATE WAITING ROOM.<br /><br />\nPi6turcs.<br /><br />\nFRANKE &amp;<br />\nPURNELLCO.<br /><br />\npp2minn<br />\nurnilly.<br /><br />\n224 N. HOWARD ST.<br /><br />\nOF<br /><br />\n(Breen Setter<br />\nfraternitv aewelrp.<br /><br />\n14 A N D 16 ST. PAUL STREET,<br /><br />\nBALTIMORE,<br />\nAAAAAA<br /><br />\nCALL AND EXAMINE OUR<br /><br />\nMD.<br /><br />\nLINE 11110151<br /><br />\nNNE<br /><br />\nPURCHASING.<br /><br />\nBonbons, Chocolates,<br /><br />\n.1. 11. ROBINSON.<br />\nINANI/FACTURNR<br /><br />\n• FINE<br /><br />\n4)<br /><br />\nCONFECTIONS.<br /><br />\nOF<br /><br />\nCIGARS,<br /><br />\nDII.11.1.1<br /><br />\nFRESH EVERY HOUR. SENT BY MAIL OR EXPRESS.<br /><br />\nIX<br /><br />\nPO RAMO, CIGARS AND FINIOKIORS' ARpter.acs,<br />\nSTATIONERY.<br />\n626 N. )1ITJTAW ST.<br />\nBALTIMORE, MD.<br />\nBaltimore, New York &amp; Philadelphia Papers.<br />\nC. &amp; P. Public Telephone, Madison 1185Y.<br /><br />\n14<br /><br />\nEAST<br /><br />\nBALTIMORE STREET.<br /><br />\nDesigning and Cutting by E. Michaelson.<br /><br />\nE. MIGRIIELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br /><br />\nALTERING AND REPAIRING.<br /><br />\n821 Iladison Avenue,<br /><br />\nSpecial discount to Students.<br /><br />\nBALTIMORE, MD.<br /><br />\nA. D. SMITH &amp; SONS,<br />\nyolinerly<br />\nLEVERING &amp; SMITH,<br />\n104<br /><br />\nWEST<br /><br />\nLEXINGTON<br /><br />\nSTREET.<br /><br />\nREADY TO WEAR HATS for Ladies, Misses<br />\nand Children.<br />\nIn the Latent Desturts.<br />\nMEN'S HATS--Derbys and Soft Felts.<br /><br />\nCO<br />\n'1<br />\nr<br />\nIN I.(oir ult 7IMQ Pt I N91,71113T6.<br />\nMO POOOf. COO kIAOII<br /><br />\n7in<br /><br />\nUNIVERSITY CAFE.<br />\nCHAS. LINDENMEYER, Prop.<br /><br />\nCHOICE WINES, LIQUORS AND CIGARS<br />\nRAW BOX NOW OPEN.<br />\n506 NORTH EUTAW STREET<br />\nLadies' and Gentlemen's Dining Rooms.<br />\nMeals Served at All Hours,<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br /><br />\nProst. &amp; Mgr.<br /><br />\nWedding Silver Gifts<br />\nsilversmiths.<br /><br />\nderSOn<br />\n'<br />\nS<br /><br />\nManufacturers of<br />\nSilk and Cassiinere Hats. if<br /><br />\nHOPKINS CAPS<br /><br />\nF3<br />\n1211111G &amp; COMPANY' St<br />\nation<br /><br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nCertificate of Analysis from<br /><br />\nII. R. EISENBRANDT SONS,<br /><br />\nfor<br /><br />\nMUSICAL INSTRUMENTS.<br /><br />\nN STRBLER GO.<br /><br />\n701 to 705<br />\n\"..JORDA<br />\nMADISON AVE.<br />\nReads as follows: Samples submitted of<br />\n!Prom% 'randy—no<br />\nadulterants, no coloring,fine quality.<br />\nttporto Port—absolutely pure of superior quality.<br />\n.,PerrY—no coloring or adulterants,<br />\nabsolutely pure wine.<br />\n'<br />\nWhiskey—no Fusel oil, no caramel, strictly pure<br />\na\"(1 old,<br />\n011y<br />\nvid 6(<br />\n\"I—all tests show pure olive oil.<br />\n-er<br />\n\"gar—natural cider vinegar, strictly pure and<br />\nsa<br />\n—roux.<br />\n81x Orounal Spiess —no adulteration, all strictly pure.<br />\nADVERTISING SPACE IN THIS PAPER<br /><br />\nMUSIC, PIANOS, ORGANS.<br />\nN.CHARLES ST.<br />\nBALTIMORE, MD.<br /><br />\n201-203<br /><br />\nCharles T. Crane,<br />\nPresident.<br />\nCarter G. Osburn, Cashier.<br /><br />\nSouth<br /><br />\nPEARRE E. GROWL COMPANY.<br />\nPUBLISHERS.<br /><br />\nand Lombard Sts., Baltimore.<br /><br />\nSurplus and Profits $450,000.<br />\nCapital, $650,000<br />\nAccounts of Hanks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\nLIGHT AND LOMBARD STREETS<br /><br />\nBALTIMORE, MD.<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier,<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br /><br />\nAPPLY To<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nORTII GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nPor particulars apply to<br /><br />\nand<br /><br />\n.<br /><br />\nes.<br />\ner's<br /><br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, Law MEDICAL, CLASSICAL AND MiSOILLANCOU• BOOK*<br />\nKeeps constantly on hand the Text Books used in Johns<br /><br />\nPeofs. G. W. Lehman &amp; Son,<br /><br />\nFOR<br /><br />\nETC.<br /><br />\n824 WEST 13AL/FIMORE STREET.<br /><br />\nC<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText hooka. Note Rooks.<br />\n3tudent's<br />\nMadison &amp;Howard Sts.<br />\n&amp;applies.<br /><br />\nOM<br /><br />\nR &amp; LC).<br /><br />\nFZ.11<br /><br />\nNV<br /><br />\nUMBRELLAS, HATTERS, CANES,<br />\nAgent for Lincoln&amp; Bennett and<br />\nWalter Barnard's London Hata.<br /><br />\nIN GREAT VARIETY.<br /><br />\ntien<br /><br />\nJAMES R. PAINE.<br /><br />\nTHEO. \\\\* MINNA.<br /><br />\nESTABLISHED 1879.<br /><br />\n.5t JENKINS.<br />\nCHARLES ST.<br /><br />\nH. MoMAIN9, D.0.,<br />\nSeciy. &amp; Treas.<br /><br />\nMARIA BUIE, D. 0.,<br />\nV.-Prod.&amp; Asst. See'y.<br /><br />\nW. D. BOWEN, M. D., D.0.,<br /><br />\nA. SCHUMACHER Zir<br /><br />\nGeneral Agents.<br /><br />\n00.,<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER.<br />\nNAPLES, GENOA, ETC.<br />\nBALTI.MORE TO BREMEN<br />\nDIRECT,.<br /><br />\nMANDOLIN. GUITAR AND BANJO of rt<br />\nTAUGHT SY<br /><br />\nC. J. LEVIN,<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStndio, 331 N. Charles St.<br /><br />\nthe Itran3g:Znifth<br />\npiano CO.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nilgenfritz Studio<br /><br />\nCbicker1ng, 313rabburp anb relebstei<br /><br />\nSuccessor to Cummins<br /><br />\nBaltimore<br /><br />\n20 West Lexington St.<br /><br />\nSpecial Discount to Students<br /><br />\nTHE BLAKE CO<br /><br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br /><br />\nON SALE THE J. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n203 W.BALTIMORE ST.&amp; 2 S.<br />\nBALTIMORE, MD.<br /><br />\nLIBERTY<br /><br />\nSr.<br /><br />\nMembers of<br />\nNew York Stock Exchange<br />\n.<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE &amp; CO.,<br />\nBANKERS &amp; BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n'Pianos.<br /><br />\n0<br />\nJA .<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\n217 E. German Street<br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Willms Surgical Instrument Company<br />\nBENJ. A. NELSON, OIN'L MANAGER<br /><br />\nPhysicians,' Surgeons, Hospital and Invalid Supplies.<br />\nFine Microscopes and Aooessories.<br /><br />\nFactory Prices<br /><br />\nC. &amp; P.'Phone 2322-2.<br /><br />\nGE<br />\nSMITH'S s0Hr?<br />\nOLD<br />\nBOOK<br />\n805 N.<br />\nSTORE<br />\nE<br />\njaT&amp;<br />\nBOOKS<br /><br />\nHOWARD STREET,<br />\n3rd door from Madison.<br /><br />\nBOOKS<br /><br />\nOLD AND NEW<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks Bought, Sold and Exchanged, ...<br />\n605 N. Eutaw Street.<br /><br />\nWM. V.PIPPEN,<br /><br />\nA. H Rutherfoord<br />\nF. Lents.<br /><br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br /><br />\nJ. WM. MIDDENDORF &amp; CO.<br />\n36anhero &amp;16rohers.<br /><br />\nBaltimore, Md.<br /><br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nMembers<br />\nBaltimore, Md.<br />\nBaltimore Stock It xchange.<br /><br />\nDrovers and Mechanics National Dank,<br /><br />\nBOOKS AND STATIONERY<br /><br />\n300<br /><br />\nN. Howard St.,<br /><br />\nOF BALTIMORE, MD.<br /><br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\nYOUIR EVLS<br /><br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br /><br />\nTHINK IT OVER.<br /><br />\nSAYRE OPTICAL COMPANY,<br />\n521 North Charles Street, (Masonic Temple.)<br /><br />\nKXFVMINING OPTICIFMNS.<br />\nTHE NEWS LETTER<br /><br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\n144c'. 308 1\\I c.i.x.t<br /><br />\nCl-ies.s-liems mt.,<br /><br />\nY. M. C. A. 'BUILDING,<br />\nBALTIMORE, MD.<br />\nC.&amp; P. and Md.'Phones.<br /><br />\nCALL ON<br /><br />\n(HIS. It. DOWNS,<br />\n229 N. Charles St.,<br />\nMASONIC<br /><br />\nWalrle •<br /><br />\nFOR Class, Fraternity and College Stationery,<br />\nBanquet Cards, Invitations, Diplomas,<br />\n.<br />\nPrograms, V hitting Cards, ete<br />\nOur 50o J. ft. U. Mae and Black Plea Paper—now rsadil.<br />\nThere Is very little entertainment at home without a Plane<br /><br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nBALTIMORE<br />\nLight and Lombard Streets,<br />\nWe carry a full line of Students' Note Books and Stationery<br />\nBoth 'Phones.<br /><br />\n5TIEFF<br />\nPIANos<br />\nlire The Best.<br />\n9 N. Libertu St.<br /><br />"}], "field_media_file": [{"target_id": 36207, "display": null, "description": null, "target_type": "file", "target_uuid": "c636451f-dc6b-43d6-b9ac-77d58155f75c", "url": "http://digital.library.jhu.edu/system/files/2022-03/12192-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12192, "target_type": "node", "target_uuid": "1717681d-56d5-45cf-b982-a67809ccffa4", "url": "/node/12192"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "5ff7a6ca-4e35-472f-b1bf-b22ecda9a3d9"}]}