{"mid": [{"value": 38087}], "uuid": [{"value": "850ea781-6f45-4cc6-8f14-58ae92772ff3"}], "vid": [{"value": 38087}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:47:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12655-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:47:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:47:33+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\nth<br />\n<br />\naritItt,5 Ikjøpkinz Nrius-tritrr<br />\nRat Routs Esquire<br />\n<br />\nAthletic Board<br />\nDecided On A<br />\nReorganization<br />\n<br />\nlent<br />\n<br />\nPresident Hazlett Studies Randolph the Rat, for years an inConstitution Alterations habitant of the basement and the<br />\nSuggested By 0. D. K. boon companion of many a pale,<br />\n<br />\nathbar-<br />\n<br />\ncul-<br />\n<br />\ntitly<br />\nvish<br />\n<br />\nverof<br />\nork<br />\ncook<br />\nwee<br />\nugs<br />\nout<br />\na<br />\n<br />\nent<br />\nde-<br />\n<br />\nars<br />\nHe<br />\nof<br />\npus<br />\nion<br />\n<br />\na<br />\nto<br />\nviii<br />\ne,,,<br />\none<br />\nerLed<br />\n<br />\nrd<br />\nof<br />\nLce<br />\nhe<br />\n<br />\nN.<br />\nts,<br />\nnost<br />\nN.<br />\n<br />\n11-<br />\n<br />\nnt<br />\nLs-<br />\n<br />\nis<br />\nY-<br />\n<br />\nL5<br />\n<br />\nin<br />\nr,<br />\n<br />\n;0<br />\n<br />\nte<br />\n<br />\nHe stood outside the NEWS-LETTER<br />\noffice, his two hundred pounds resting comfortably<br />\n<br />\nin<br />\n<br />\nsize<br />\n<br />\n20<br />\n<br />\ncorduroy coat, his<br />\n<br />\nsix<br />\n<br />\nfeet<br />\n<br />\nthree<br />\n<br />\nAttracted by the brilliant spectacle,<br />\n<br />\nsleepy reporter, honored it with one<br />\nof his rare daylight appearances. As<br />\nthe beautiful creature gazed toler-<br />\n<br />\nRepetition Of \"Gymboree\" antly at him, Randolph, perhaps from<br />\nfear, perhaps from jealousy, bared<br />\nPlanned To Solve Sweater his teeth and let loose the bellow<br />\nProblem; New Filing Index that has presaged a thousand combats. At which Mr. Esquire pulled up<br />\nThe \"New Deal\" in Hopkins ath- his striped pants and lifted his<br />\nletics once more showed its hand brawny legs rapidly for Red Schaal's<br />\nlast week with the announcement of office.<br />\nplans for reorganization of the two<br />\nbodies which are the ultimate student arbiters of<br />\n<br />\nsports policy, the<br />\n<br />\nAthletic Association and the Varsity<br />\nClub. William Hazlitt, president of<br />\nthe Association, is also studying further alterations in the Constitution,<br />\nas suggested by Omicron Delta Kappa.<br />\n<br />\nPi D. E. Speaker<br />\n<br />\nAll Quiet On Levering Front<br />\nAs Smoke OfFrat Battle Clears<br />\n<br />\nsuede<br />\n<br />\nshoes, his wide shoulders splitting a<br />\ncrowned by a befeathered Hofberg.<br />\n<br />\nToHave5-ManBoard<br />\n<br />\nPrice Five Cents<br />\n<br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, NOVEMBER 5, 1935<br />\n<br />\nVol. XL—No. 11<br />\n<br />\nnci<br />\n'iota<br />\nipu<br />\nletici<br />\nargel<br />\nsot<br />\nI on<br />\nek0<br />\nd in<br />\n<br />\nKept<br />\n<br />\nTHINK ABOUT YOUR<br />\nPEACE POLL VOTE<br />\nSEE EDITORIAL,PAGE 2<br />\n<br />\nAnti-War Meeting<br />\nHeld Last Friday<br />\nLong, Davis, Detzer, Halgren, Rabbi Israel Among<br />\nSpeakers At Gathering<br />\n<br />\nHope Of Word From Official Sources Dies Away; Fraternity<br />\nMen Turn To Football To Secure Revenge; Phi<br />\nGams Walk Over Campus Unmolested<br />\nAll was quiet over Levering Hall prove a broken reed, as it now apyesterday, and flying mud no longer pears, the curtain will go down forever on one of the most highly drafilled the air, as embattled fraternity<br />\nmatic fraternity melees in recent<br />\nmen stood as one with bated breath<br />\nyears<br />\nawaiting some word from official<br />\nHope for an era of reform and<br />\nsources.<br />\npeace was still high in the hearts of<br />\nBut alas, the word has yet to come<br />\nthose earnest spirits who direct the<br />\n—nor can it be expected for some<br />\naffairs of the Hopkins from the card<br />\nlittle time. Any hope for sensational<br />\ntables at Levering Hall. It seems<br />\npronouncement from this source was<br />\ncertain, moreover, that some attempt<br />\nkilled last Friday when Dean Berry<br />\nwill be made to realize their dream.<br />\nremarked, \"<br />\n- I haven't talked with Mr.<br />\nA thousand schemes for reform have<br />\nWigall for some little time, and am<br />\nalready been put forward.<br />\nnot really conversant with the situSmoke Of Battle Clears<br />\nation.\"<br />\nAs a matter of fact, interfraternal<br />\nFraters Turn To Football<br />\namity, as the smoke of battle dies<br />\nThus the fraters are contenting away, has once more revealed itself.<br />\nthemselves with minor blood-lettings Even the Phi Gams, the sight of<br />\non the touch football field and rest whom less than two weeks ago, was<br />\ntheir hopes on the next Interfrater- an incitement to riot, now walks the<br />\nnity Board meeting. Should this campus unmolested.<br />\n<br />\nHays,PeacePoll<br />\nWill Be Feature<br />\nNext Assembly<br />\nFamous Criminal Lawyer To<br />\nBe Tapped By Pi D. E.<br />\nAfter Address On \"Peace\"<br />\n<br />\nBallot To Follow<br />\nUndergraduates To Vote On<br />\nQuestions Involving R. 0.<br />\nT. C. And War Abolition<br />\n—Courtesy News-Post<br />\n<br />\nARTHUR GARFIELD HAYS<br />\n<br />\nCommittees Study<br />\nFascism And War<br />\nIn Cause, Effects<br />\n<br />\nLane, Blumberg Tommy Dorsey To<br />\nDistrict Conference Against<br />\nTo Talk To NSL In Play At Cotillion; War And Fascism Held In<br />\nLevering Today Delevett Announces Levering On Week-End<br />\n<br />\nLong a militant champion of the<br />\nrights of man and the tireless foe<br />\nof legal and social injustice, Arthur<br />\nGarfield Hays, a familiar figure on<br />\nthe Latrobe platform, will take up<br />\nhis cudgel in the cause of \"Peace\" for<br />\nhis annual assembly address next<br />\nThursday. As the chief guest of its<br />\nprogram, Pi Delta Epsilon, honorary<br />\njournalistic society and sponsor of<br />\nthe assembly, will formally induct<br />\nMr. Hays into its order. Kenneth<br />\nZierler, president of Pi D. E., will introduce the speaker.<br />\n<br />\nMr. Hays' fondness for live and<br />\ncontroversial issues is well demonThe opening of the Anti-War Constrated by his choice of a problem<br />\nference sponsored by the League<br />\nand<br />\ncaptains<br />\ned every spring by the<br />\nwhich, at the moment, is probably<br />\nAgainst War and Fascism was held<br />\nmore important than any other in<br />\nManagers. In addition to three of- last Friday night<br />\nat the Knights of<br />\nthe minds of Hopkins men. His adficers, the president, vice-president, Pythias Hall. This inaugurated the<br />\ndress is particularly pertinent beand secretary-treasurer, there will be subsequent conferences held Saturday<br />\ncause of the Peace Resolutions poll<br />\nand<br />\nSunday<br />\nat<br />\nLevering<br />\nHall<br />\ntwo members at large. The president<br />\nwhich is to follow it. The ballot will<br />\nThe first speaker was Franklin<br />\nof the Varsity Club is automatically<br />\ntake the form of a series of resoluIn<br />\nNational<br />\npreparation for the<br />\nLong of the Baltimore Youth CounAllen F. Delevett, president of the<br />\ntions to be presented to the assemelected to the Board. Representation<br />\ncil. He stressed the danger to youth Student Mobilization for Peace, the Cotillion Board, announced today<br />\nbled student body. The resolutions, in<br />\nLS limited to three from the major of war and the causes pending ne- National Student League will be ad- that Toriamy Dorsey and his orchesThe dogs of war come in for a se- their essence,. raise the following<br />\nminor.<br />\nfrom<br />\nthe<br />\ntwo<br />\nsports and<br />\ndressed by Dr. Frederic C. Lane, as- tra have definitely been signed to<br />\ncessity of their fighting war.<br />\nvere flaying at the hands of the Dis- points:<br />\nGymboree Planned<br />\nJohn P. Davis, of the National Ne- sociate professor of history, and Dr. play at the annual Cotillion to be<br />\n1—To support, by any means at<br />\ntrict Conference against War and<br />\nThe new Board will continue to gro Congress, was the isext speaker. Albert E. Blumberg, instructor in held in the Alcazar on Thanksgiving<br />\nour disposal, genuine neutrality legFascism, in its sessions in Levering<br />\noccupy itself with the questions of He spoke of negroes in relation to philosophy, at four oclock today in Night.<br />\nislation to prevent entanglement of<br />\nIt had been previously announced Hall over the week-end. From the<br />\nletters, sweaters, and eligibility. It is war and Fascism, and of negro indig- Levering Hall, Room B. The two<br />\nthe United States in war—no loans,<br />\nspeakers will discuss the resolutions that Benny Goodman and his orhoped that a repetition of last year's nation at the rape of Ethiopia.<br />\nkeynote speech of John Franklin, a credits, munitions or secondary war<br />\nto<br />\nbe<br />\nvoted<br />\non<br />\nby<br />\nthe<br />\nstudent<br />\nbody<br />\nknotty<br />\nRabbi<br />\nEdward<br />\nthe<br />\nIsrael<br />\ncalled<br />\nfor<br />\n“Gymboree\" will solve<br />\nchestra would appear on that date,<br />\nmember of the New York branch of materials to belligerents;<br />\nproblem of sweater cost. Plans for unity of the middle and lower class- at this Thursday's assembly. The but it was later discovered that<br />\n2—To work for the demilitization<br />\nthe<br />\nAmerican League Against War<br />\nspeeches<br />\nwill<br />\nbe<br />\nfollowed<br />\nby<br />\nquestions<br />\na definite system of eligibility are es against war<br />\nGoodman had signed a contract for<br />\nof our colleges and schools, especially<br />\nDorothy Detzer of the Women's from the floor, and all students are a long engagement in Chicago that and Fascism, on the \"Causes and<br />\nalso taking form. The Varsity Club<br />\nby assuring the passage of the Nyeis mainly occupied with the cases of International League for Peace and urged to attend and participate in would conflict with the Thanksgiving Prevention of War,\" down to the final<br />\nKvale Bill to make the R. 0. T. C.<br />\nFreedom, told of the weakness of the the discussion.<br />\ndeserving, but needy, students.<br />\ndate.<br />\nreport of the General Commission of optional instead of compulsory;<br />\nAnother innovation is the installa- League of Nations in combatting<br />\nRichard Whitten To Speak<br />\nAlthough Tommy Dorsey has been<br />\n3—To insist on opportunities in the<br />\nthe Conference, the great god Mars<br />\nOn Friday, November 8 at three conducting his own band for a comtion of a new, and more efficient, fil- war. She also exposed the quasi-radand out for relating our<br />\ncurriculum<br />\nsearching<br />\nclinical<br />\ning system in Dr. Schaffer's office. ical persuasions of Fascists by citing p. m. there will be a meeting in Lev- paratively short time, his popularity was the object of<br />\neducation to these crucial problems;<br />\nAll correspondence will in the future the example of Mussolini's change ering Hall which will be addressed has been increasing by leaps and scrutiny. The Levering Hall meeting<br />\n4—To refuse to support the govby Richard Babb Vaiitten, director bounds. He plays once a week on the was preceded by a Peace Rally at<br />\npass through this point. With this from Socialist to Fascist.<br />\nernment of the United States in any<br />\nTo Share Ethiopia<br />\nof Commonwealth College, in Mena, Columbia Broadcasting System, bechange the Athletic Director comes<br />\nwhich Roger Baldwin, of the Civil war it may undertake.<br />\nMauritz<br />\nA. Halgren, of the Balti- Arkansas. Representatives from Gott- sides furnishing the music for the<br />\ncontrol<br />\nof<br />\nH<br />\nopinto almost complete<br />\nThe poll is sponsored by the Y. M.<br />\nLiberties<br />\nUnion, was the chief speakmore Sus, told of how, before the cher College, Morgan College, and French Casino in New York City.<br />\nkins sports.<br />\nC. A., the National Students League,<br />\ncoming of Hitler, he had asked the Baltimore city high schools will also<br />\nThe Dorsey brothers are among the er.<br />\nFour Members Now<br />\nthe American League Against War<br />\nGerman people if they were not attend.,<br />\nbest-known popular musicians in the<br />\nImmediately after the opening of and Fascism, and the NEWS-LETTER.<br />\nIn addition to Hazlett the other<br />\nafraid of Hitler. They had had not<br />\nMr. Whitten is a former member country. For several years their band<br />\nmembers of the A. A. Board are<br />\nproper at 10 a. m., Such sponsorship does not signify, or<br />\nthe slightest fear of his gaining of the varsity debating team of Tu- has been \"tops\" in the East. It was the Conference<br />\nof the resoluGeorge Margolis, captain of basketelected chairman even imply, approval<br />\npower.<br />\nlane University and of the executive a band which also leaned to the Foster Dowell was<br />\ntion, but rather the realization of its<br />\nball; Carl Hartman, a member of the<br />\nRoger Baldwin first talked about committee of the Student League for \"swing\" style. They were first fea- and Samuel Swerdloff, secretary. In importance. The Student Mobilization<br />\ntennis team, and Clarence Weimer,<br />\nhis<br />\nexperiences with the Peoples' Industrial Democracy. At the pres- tured on the American Oil program the address which followed, Mr. for Peace, scheduled for Filday, has<br />\nmanager of lacrosse. Hazlett is capFront in France last summer. \"The ent time he is on the national er- with Ethel Waters a few years ago, Franklin discussed mainly the possi- been moved up one day because of<br />\ntain of swimming and baseball. The<br />\nsituation in Europe is more develop- ecutive committee of the American and from then on their rise was me- bilities of preventing a world conflict. the assembly.<br />\npresident of the Varsity Club has yet<br />\ned than it is over here—Fascism over League Against War and Fascism. teoric.<br />\nThe resolution, involving as it<br />\nto be elected.<br />\nThe key to the situation, he declared,<br />\nthere is not subtle and embryonic; it As a leading member of the Socialist<br />\nhowever, differences<br />\nAugust,<br />\nIn<br />\ndoes,<br />\nsuch highly controversial issues<br />\nreorganization,\"<br />\nthis<br />\n\"Our idea in<br />\nhas become a crude reality.\" \"It has Party, Mr. Whitten was recently in caused a split and each of the boys is to be found in the subsidization of as the R. 0. T. C. and the Oxford<br />\nsaid Hazlett, in discussing his plans,<br />\nbeen already agreed upon that Italy, charge of the projected trip of Nor- now has his own band. For the past industry which follows every declar- Oath,'shuld provide Mr. Hays with<br />\n\"is to make the most compact, effiEngland, and France are to share man Thomas through the realm of few weeks Tommy has been kept ation of war. A general strike would a wide field for discussion. In his<br />\ncient system possible. The A. A.<br />\nEthiopia. The Bank of Ethiopia is a the \"Kingfish\", before the assassina- busy at private dances in the East.<br />\ncripple any military organization. previous assembly addresses to the<br />\nBoard is far too important a thing<br />\nsubsidiary of the Bank of Egypt tion of Senator Long.<br />\nAside from; the bqind itself, Tommy<br />\nassembly and throughout his career,<br />\nnot to be gone over and strengthened<br />\nMore than three hundred and fifty<br />\nwhich in turn is subsidiary to the<br />\nDorsey is known as one of the great\"Red Activities\" Probed<br />\nhe has shown no disposition to dodge<br />\nas often as possible.\"<br />\nBank of England.\"<br />\nThe college which Mr. Whitten est trombone players in the country. persons heard the address.<br />\nthe issue.<br />\nHe told of the Peoples' Front heads was recently under investigaHis five Hopkins speeches reflect<br />\nAt two o'clock the session was redemonstration on Bastille Day, of tion by the State Legislature of Arclearly<br />\nhis long fight for civil liberty<br />\nmeeting<br />\nof<br />\nsumed in the form of the<br />\nthe small Fascist demonstration and kansas for alleged \"radical activiand education against prejudices.<br />\ncommissions to investigate the relathe tremendous one of the Front ties.\" Commonwealth is a labor colThey have covered a scope which intion of Fascism to certain special cludes the Sacco-Vanzetti case, the<br />\nPopulaire, well disciplined and order- lege and has played a leading role<br />\nDr. Oscar Zariski, Associate Pro- groups of humanity. The commissions Russian collectivist system, the probPaul Hinrichs, Hopkins Graduate, ly—\"from that day to this, there has in the organization of share-cropnot been a single public Fascist meet- pers in Arkansas.<br />\nfessor of Mathematics, is returning and their chairmen were: Youth, Rev.<br />\n(Continued on Page 3, Col. 6)<br />\nThose<br />\nPresent<br />\nAmong<br />\nIs<br />\ning in the whole of France. You get<br />\nto the University after a year's leave<br />\nMrs.<br />\nEdHutchison;<br />\nWomen,<br />\nJohn<br />\nDinner<br />\nAt<br />\nthe spirit of the French working<br />\nof absence. During the first part of<br />\nclass when you talk to porter or<br />\nhis leave of absence, Dr. Zariski was ward Lewis; Education and Religion,<br />\nThe Barnstormers Club last Satur- peasant, factory-worker o shopgirl. I<br />\nconnected with the Institute of Ad- Rev. A. W. Gottschall; and Racial<br />\nday evening held a banquet at the saw the members of the United<br />\nvanced Studies at Princeton Univer- Minorities, Edward Lewis. The comStafford Hotel in honor of out-going Front, ranging from Catholic Libersity.<br />\nmittees discussed recent researches<br />\nOther Classes Scheduled To Pick<br />\nco-directors William Banks and als to Communists work in unity and<br />\nDuring the past summer he trav- into the effects of Fascism on their International Lecturer Chooses \"InOfficers During The Coming<br />\nternational Situation In Far<br />\nharmony.<br />\neled in Europe, and for the last six special fields.<br />\nHoward Caplan.<br />\nMonth<br />\nEast\" As Topic<br />\nLeague Not Communistic<br />\nweeks he has been lecturing on AlOn Sunday the results of their<br />\nThis acknowledgement of the apAs for the American League<br />\ngebraic Geometry at Moscow Univer- findings were presented in the forms<br />\nFall politics will come again to the<br />\npreciation of the Barnstormers of the Against<br />\nDr. T. Z. Koo, Oriental lecturer of<br />\nWar and Fascism, he said,<br />\nsity. Dr. Zariski also participated in of resolutions to the General Comnote and Secretary of the World's<br />\nfine work and devotion of the two \"the League must mold the middle Hopkins tomorrow with the an- the Conference of Ontopology held<br />\nmission on Developments Towards<br />\ncoaches in the past was well attend- class outlook, for American work- nounced nominations for Senior Class recently at the Moscow University. War and Fascism under the direction Student Christian Association, will<br />\naddress the University Supper Club<br />\ned. The entire present membershi'p ers think in terms of the middle officers. If necessary there will be<br />\nof Mauritz A. Halgren. The Education<br />\nthis evening in Levering Hall on the<br />\nclass\"<br />\n.<br />\n.<br />\n.<br />\n\"It<br />\nis<br />\nfalse<br />\nthat<br />\nthe<br />\nLeague<br />\nCommittee called for a new fight<br />\nof the Barnstbrmers attended as a<br />\nprimaries tomorrow and finals on<br />\nSituation in the Far<br />\n\"International<br />\nis a Communist organization, only<br />\nagainst the Teachers' Oath Bill and<br />\nbody. Also among those present<br />\nFriday. The Student Council is conEast\" with special reference to our<br />\nthree out of nine members of the<br />\nThe Bdrnstormer Club firmly<br />\nthe abolition of military propaganda<br />\nrecent peace demonstrations. This<br />\nwere such alumni or former Barn- executive board are Communists. ducting the elections. Seniors will be<br />\nbelieves that in \"The Firebrand\" in schools and endorsed the Student<br />\nwill be the second meeting of the<br />\nstormers as Talbot Banks, Warren The chairman, Dr. Ward, is a profes- called upon to choose a president,<br />\nthey have secured the finest play<br />\nMobilization for Peace. All four Supper Club this year.<br />\nColgan and Bert Gordon. Paul Hin- sor at Union Theological Seminary. vice-president, secretary, treasurer,<br />\nthey have ever atterhpted to put<br />\ncommittees presented hearty approvA graduate of St. John's Univeron the boards. There are splendid<br />\nrichs, who was graduated from the Answering the question why we do and sergeant-at-arms.<br />\nal of the coming Third National ConShanghai, China, Dr. Koo was<br />\nsity,<br />\nnot say that we are against war,<br />\nthe<br />\nopportunities for every man at<br />\ngress Against War and Fascism at<br />\nJohns Hopkins University in 1920,<br />\nOn succeeding weeks throughout<br />\nfor nine years an official in the AdFascism, and Communism, Mr. BaldUniversity to take part in the<br />\nCleveland on July 4, 5, 6.<br />\nand has been appointed coach for win, illustrating<br />\nministrative Department of the Chithat fact that the November the lower classmen will<br />\nproduction, from acting, business,<br />\nJust before the adjournment of the nese Railway Service before joining<br />\nthe group for this season, was pres- Communist and Fascist programs are<br />\nand production point of view. I<br />\nchoose their - representatives. PayConference a committee was formed the staff of the National Committee<br />\nent.<br />\ndiametrically opposed, that Commuurge everyone to consider the<br />\nment of class dues for this and preto continue the investigations begun of the Young Men's Christian AssoBarnstormer Club as one of their<br />\nZenas Sears, the president of The nism stands for peace while Fascism<br />\nby the group studies. The committee ciation of China, with special releads inevitably to war, quoted John vious years is required.<br />\nactivities. It is one of the oldest<br />\nBarnstormers, acted as the Master<br />\nis made up of H. H. Shapiro, A. E. sponsibilities for colleges and uniThe absence of Lou Reuling from<br />\nStrachey: \"Communism and Fascism<br />\ncolleges<br />\nof<br />\ndramatic<br />\nclubs<br />\nin<br />\nthe<br />\nOf Ceremonies. Short valedictory<br />\nBlumberg, Mauritz Halgren, Mrs. Ed- versities. In 1925 he was a mempber<br />\nas much alike as two express trains the ballot makes the Senior poll a<br />\nthe country.<br />\nLewis, Gough McDaniels, Rev. of the Second Opium Conference<br />\nSpeeches of thanks were delivered by on parallel tracks going in opposite wide-open one. Vernon Grove is the<br />\nALLEN DELEVETT. ward<br />\nJoseph Novak, Rev. John Hutchison.<br />\n(Continued on Page 3, Col. 2)<br />\npresident of the Junior Class.<br />\nboth Banks and Caplan.<br />\ndirections.\"<br />\nStudent control of sports will be<br />\nbuilt around a five-man board elect-<br />\n<br />\nResearchesContinue<br />\n<br />\nWill Discuss Peace Question; Replaces Benny Goodman's<br />\nOpen Forum From Floor<br />\nOrchestra At Thanksgiv- Dr. Blumberg On CommisTo Follow Principal Talks<br />\ning Affair, November 28<br />\nsion Formed To Seek Fascism Effects On Groups<br />\n<br />\nBarnstormers Hold<br />\nBanquet At Stafford<br />\n<br />\nDr. Zariski Returns After<br />\nLecturing At Moscow U.<br />\n<br />\nSenior Elections<br />\nBegin Tomorrow<br />\n<br />\nSupper Club Will<br />\nHear Koo Tonight<br />\n<br />\nAN OPEN LETTER<br />\n<br />\n\f2<br />\n<br />\nHOME WOOD, BALTIMORE, MD., NOVEMBER 5, 1935<br />\n<br />\nMbt Pewslidetter<br />\nFounded 1897<br />\nSubscription per year______.........._42.00<br />\nBy Mall<br />\n$2.50<br />\n<br />\nQuad Quips<br />\nBy JACK STEIN<br />\nI happened to be looking over the NEWS-LETTER finances the other day, and came upon the startling discovery that it costs over $65 to print one issue of the<br />\nNEWS-LETTER. That figure set me to work. Invoking<br />\ncalculus, algebra, solid and plane geometry, trig, and<br />\nother sundry forms of the mathematical science, I was<br />\nable to learn that it costs over $4.00 every time this<br />\ncolumn is printed. Four crisp bills, plus change, is represented in these weighty words of wisdom.<br />\nDoing a little more figuring I find that every time<br />\nthe paper uses the picture of a professor it costs over<br />\n$.50. (When pictures of students are used it may cost<br />\nmore than ordinary, because they require more space<br />\nin view of their swell heads.) An ordinary headline on<br />\nthe front page alone runs into more than $.60.<br />\nI think it about time the student body awakened<br />\nto the fact that the NEWS-LETTER represents a good<br />\ndeal of cold cash, and instead of tossing your NEWSLETTER in the waste basket, why not refund it at the<br />\nNEWS-LETTER office? Yeah! Why not?<br />\nAt present the paper is running a terrific deficit,<br />\nand the Editor asks that all students who would like<br />\nto see the paper become financially \"on its feet,\" please<br />\ngive slugs, lead nickels, Defend Ethiopia buttons, collar<br />\nbuttons, etc., all of which will be melted into a heap—<br />\nthe silver extracted—and a bright shiny two-bit piece<br />\nmade which will be used to reduce the deficit. Thank<br />\nyou.<br />\n<br />\nON THE BOOK HORIZON<br />\n<br />\nREVOLT ON THE CAMPUS, by<br />\nThe recent movement on the end up with \"incipient delirium treJames Wechsler. Covici-Freide. campus which has brought the stu- men, loss of appetite,<br />\nsurfeit of oy$3.00.<br />\ndent face to face' with the realities sters, gout and cirrhosis of the livRemit subscription fees to Treasurer, Student AcWithin recent years, an upsurge of the day has resulted in numerous er\"; and, although he makes<br />\nseveral<br />\ntivities Council, Remsen Hall, Postoffice, Johns Hophas occurred on the American cam- cases of violation of academic free- comments that touch us<br />\nrather deepkins University.<br />\npus that has attracted the attention dom, countless expulsions, vigilante ly, his observations are<br />\nprimarily obof everyone, and no time could be groups in California, censorship of jective. Where he<br />\ndoes express an<br />\nEntered as second-class matter December 3, 1909,<br />\nmore opportune for an evaluation of college publications—instances are opinion, he is<br />\nsympathetic rather<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\nthis movement than the present. Mr. mentioned in which R. 0. T. C. men than devastating (as<br />\nthe custom<br />\nCongress, November 3, 1879.<br />\nWechsler, the former editor of the led attacks on protesting students goes).<br />\nPublished semi-weekly from October to June, exColumbia Spectator, has undertaken (which will lead one to ask, what<br />\nThe author's observations on our<br />\ncept during examination and college holiday periods<br />\nthe task, in a volume which, for its Robert Morse Lovett has asked in fair state and on our<br />\nstill fairer city<br />\nby undergraduates of the Johns Hopkins University.<br />\nbroa'i and comprehensive view, should the introduction—where is the obe- are of great<br />\ninterest. Baltimore, he<br />\nbe carefully studied by those who dience, discipline, and conduct ex- finds, is a city of<br />\ntransition and of<br />\nare not only interested in, but are pected of officers and gentlemen\" synthesis — a<br />\nsynthesis of old and<br />\nEDITORIAL DEPARTMENT<br />\nparticipating in, the student move- that the advocates of the R. 0. T. C. new, of North and South,<br />\nof the demEditor-in-Chief<br />\nJesse N. Borden<br />\nment against war, as well as by are always using as arguments in ocratic and aristocratic.<br />\nHe is struck<br />\nManaging Editor<br />\nIrving Leberfeld<br />\nthose who still believe in academic favor of that institution). In out- first of all by the<br />\narchtectural mofreedom and the sanctity of the Uni- standing cases Mr. Wechsler dis- tifs of the city.<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nversity.<br />\nAssistant Managing Editors<br />\ncusses the college or university inIn the -Baltimore Trust BuildWe have all been aware of iso- dividually.<br />\ning is the contribution of ManSports Editor<br />\nKenneth Zierler<br />\nlated cases of the violation of acadhattan with its desire to be big<br />\nUpton Sinclair in the Goose Step,<br />\nAssistant Sports Editor<br />\nDavid Caplan<br />\nemic freedom, of censorship on the<br />\nand startling . . . The architecyears back, made the first expose of<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\ncampus, of anti-semitism, red-baittural contribution of the South is<br />\nthe university, its pretenses to culColumnists<br />\ning, and Fascism, but there are those<br />\nthe<br />\nsupremely beautiful Colonial<br />\nture<br />\nand<br />\nfreedom.<br />\nHe<br />\nconcerned<br />\nEDITORIAL STAFF<br />\namong us who have been at a loss<br />\nstyle of building which finds its<br />\nhimself<br />\nmainly<br />\nwith<br />\nthe<br />\nfaculty,<br />\nand<br />\nBernard Pinck, Sigmund Safier, Max Iskowitz,<br />\nto explain these isolated incidents<br />\nperfection in Homewood.<br />\nbig business domination through the<br />\nNathaniel Finkelstein, Murray Kempton, Wethand to comprehend their meaning<br />\nTheir influences have made Baltitrustees. He did not mention the<br />\n*<br />\n*<br />\n*<br />\nered Barroll. Jr., Isadore Gertman.<br />\nand relationship to other developstudent movement because there was more a city of commerce and of<br />\nKRAMPUS GENERALS<br />\nments throughout the country. Mr.<br />\nnot any—at the time, the student \"Beethoven string quartettes, of oil<br />\nBUSINESS DEPARTMENT<br />\nPresenting the mosta of the besta.<br />\nWechsler has drawn a picture of the<br />\nwas still soundly sleeping \"it off\" refineries and one of the greatest<br />\nBusiness Manager<br />\nDavid H. Levy<br />\nrevolt and reaction as a whole, citHarold Merle Kropman<br />\nin a Greek Letter House, unaware medical schools in the world, of modAdvertising Manager<br />\nRobert Watkins<br />\n. . . yes, his middle name is Merle—no relation to ing numerous examples from pracof the fact that certain professors ern American democracy and of oldCirculation Manager<br />\nBerle . . . for thirteen years Baltimore bred—still a tically every college in the ountry.<br />\nRobert Levi<br />\nwere being dismissed from his uni- world Cavalier culture, of vast wareThe author reviews the aclivities<br />\nhalf-baked loaf . . . spends free time thinking of how<br />\nOffice Manager<br />\nWilliam Kempton_<br />\nversity because of the unorthodox houses and of packs of fox-hounds.<br />\n2 shoe—size 19 headsize. Three on the campus beginning with the<br />\nbusy he is . . . size 31/<br />\nCopy and Flung Manager<br />\nMelville Locker<br />\nIt is the beauty of Homewood<br />\nviews that they held.<br />\nchildren-21 years married—expects to remain single World War. Briefly re-states facts<br />\nwhich throws Mr. Macdonnell literJames<br />\nWechsler<br />\nhas<br />\npicked<br />\nup<br />\nBUSINESS STAFF<br />\n. . . Those are his own statements, so don't look at me well known, but often forgotten—<br />\nwhere The Goose Step left off, has ally into fits of ecstacy; but we find,<br />\nlike that . . . still thinks he has the makings of an how the universities were put on a<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\ncarried the story further than an nevertheless, that he is also interactor—but is alone in his thoughts . . . favorite pastime war basis, how professors like Royce<br />\nested in the mean and ordinary<br />\nN. Soifer, S. Tinley<br />\nexpose of the trustees, and the role<br />\nis hunting weeds behind Levering Hall with which to of Harvard, \"the meditative protoof big business; he has carried the things in life.<br />\nmake his own pipe mixture .. . religious beliefs—Clark type of the philosophic spirit\", joined<br />\nA Visit To America is, however,<br />\nstory to a point far beyond that conTuesday, November 5, 1935<br />\nGable, Jean Harlow, and Claudette Colbert . . . favorite with the militarists and the profitceived of in Sinclair's day, for in not so serious as this might indicate.<br />\nsubjert is abnormal sikologee (is that spelled write?)-- eers in the war \"to save democracy.\"<br />\nthose days students were not inter- When Mr. Macdonell's friendly wit<br />\nwants to be able to understand his friends. Lucky num- He continues with the post-war peested in learning and culture; i now is brought to bear upon some subber is Berwyn 422 . . . known to his intimate friends riod, into the revolt of the jazz age<br />\nthey are, and now they are forced ject, a hearty laugh is inevitable.<br />\nas Deaf, Dumb, and Blind Kropman . . . to those that —which F. Scott Fitzgerald so well<br />\n,Speaking of Fort McHenry, the<br />\nto defend those very ideals for which<br />\nBecause of their particular importance, two points really know, he's known as just plain Krop . ..<br />\ndepicted. On one hand, the revolt<br />\nwhether or not the British cona<br />\nuniversity<br />\nis<br />\nsupposed<br />\nto<br />\nstand,<br />\nin the anti-war resolution were held for special disagainst all old sex traditions and<br />\n*<br />\n*<br />\n*<br />\ntributed<br />\nto the poetical advanceVictorian propriety; and the mild but which are being stolen from that<br />\ncussion.<br />\nment of the world by providing<br />\nThere are deep, dark sinister plots against the<br />\ninstitution<br />\nby<br />\ntrusteeships<br />\nand<br />\ncauliberal protest that expressed itself,<br />\nan inspiration for the \"StarFirst:<br />\nfreshmen this year in regard to Freshman Regulations.<br />\nwith its illusions and misguided tious, pious, reactionary academiciSpangled Banner\" is a matter of<br />\nIt appears as though in the very near future, this paper<br />\nans, who are careful 'enough to adResolved:<br />\nhopes, in the New Student, and the<br />\nopinion. Certainly it might have<br />\n2 (b) That R. 0. T. C. at the Johns Hopkins Univer- will support the Sophomore class in demanding the en- intellectuals' adherence to Mencken, here to every wish of the trustees<br />\nbeen better for both countries if<br />\nforcement of Freshman Regulations. A hint to the wise<br />\nof big business, and to lend a willon the other. The era in which the<br />\nshould be abolished.<br />\nBaltimore had been captured on<br />\nwould be sufficient, but I guess the Freshman need<br />\ning ear to the words of the D. A. R.<br />\ncampus dis-associated itself from<br />\nthe occasion and humanity thus<br />\nmore than a hint. Forewarned is forearmed.<br />\nTESSIM ZORACH.<br />\nculture and won for itself an asdociWe feel that in a liberal institution opportunities<br />\nspared such lines as \"Their blood<br />\n*<br />\n*<br />\n*<br />\nation with jazz and gin and petting<br />\nhas washed out their foul footfor varied endeavors should be offered. If some people<br />\nThe lexicography department of the \"Quad Quip and a general ignorance of anything A VISIT TO<br />\nAMERICA, by A. G.<br />\nsteps' pollution.\"<br />\nfeel that there is a need for preparedness against ma-' Qwazy Qwiptionary division of this column received<br />\na else going on in the world aside exMacdonnell. The Macillan<br />\nSomewhere on the wharves he saw<br />\nlicious attacks by the Yellow Peril or by the Red letter the other day from a student of philosophy ask- cept for the \"big game\" and the<br />\n1935. 274 pp.<br />\nthe name Piankata.nk.<br />\nMenace, and if they feel that colleges are the place ing how to define the stoicA and cynic. The department morning after the night before. One<br />\nPiankatank! What a name!<br />\nMr. Macdonnell has broken a<br />\npassed his time with jazz, gin, and<br />\nfor that, they should be given every opportunity to give gladly gives the following information:<br />\nPerhaps some damned scholar<br />\nhoary, time-honored tradition. DeStoic—that which brings babies<br />\nwomen until he received a diploma— liberately<br />\ncan prove in a jiffy that it is Inhe has turned against the<br />\ncollege men a chance to take advantage of a course in<br />\nCynic—that in which one washes the dishes.<br />\nafter the diploma a fat-salaried job norm<br />\ndian for Stinking-Bison Gulch.<br />\nof in English conventionality<br />\nmilitary training.<br />\nThis department will be glad to answer all other as a commencement present.<br />\nMr. Macdonnell returned to Engwhich, during the past one hundred<br />\nThe course should be presented with all its ghastly questions of a similar nature without charge.<br />\nWith the depression the student years, has irked Americans—to the land, fatigued by too fast a life, but<br />\n*<br />\n*<br />\nimplications—with no aura of a romantic brass-button*<br />\nawoke. Some overslept, to be sure, advantage of the packet of every content with the knowledge that he<br />\ned uniform — with a true picture of soldiers (once Heard in the Cafeteria:<br />\nand Wechsler points out, with regret, well-known English author.<br />\nhad sampled every type of life that<br />\nworkers and college men) gassed and maimed, of headStude 1—This butter is so strong it could walk over the left-overs of the Age of Jazz,<br />\nThere is an epidemic which Eng- America has to offer.<br />\nless bodies and of limbless trunks, of sightless eyes and and say \"hello\" to your coffee.<br />\nwith its \"syncopated embrace,\" and lish authors seem to contract at a<br />\n'WILLIAM DIAMOND.<br />\nof hacking coughs eternally tearing at lungs and throat,<br />\nStude 2—Yes, and my coffee is too weak to answer. antipathy to the world at large. But certain period in their careers. Inof diseases worse than death and of minds deranged—<br />\n*<br />\n*<br />\n*<br />\nthe fact remains that a vast revolt variably they get the itch to come DEATH AND<br />\nGENERAL PUTNAM,<br />\nonce gullible minds that believed what they were told<br />\nThe letters which appeared in last week's column has occurred on the campus during to America, look around, write a<br />\nAND 101 OTHER POEMS, by<br />\nabout, war while they were workers or college men— were so eagerly received, that upon requst I will print the past few years and it is to an book about what they saw,<br />\nand sell<br />\nArthur Guiterman. E. P. Dutton,<br />\nminds with abnormal desires, or minds that feel pain in another one. This an actual letter written in a serious understanding of this revolt, its con- it to Americans—who have a singu1935.<br />\na leg that isn't there any more. And let them be told mood, without any attempt of humor on the part of the sequences and implications, that lar penchant toward hearing themIf our marking scheme were apthe futility of fighting.<br />\nWechsler directs his attention.<br />\nperson writing it.<br />\nselves lampooned and derided. Al- plied to poetry the present reviewer<br />\nHe has gathered together a vast most invariably the Englishman would give the present volume an<br />\nManila, P. I.<br />\nThen, there is another side to this R. 0. T. C. quesarray of material, but in a fashion thinks up awful things to say about \"S\". And this does not mean that it<br />\nAugust 4, 1929<br />\ntion. Suppose that the R. 0. T. C. doesn't really provide<br />\nthat does not overwhelm the reader Us.<br />\nadequate military training. Suppose you don't learn any S. S. President Wilson<br />\nmerely belongs to that unhappy class<br />\nor discourage him. In fact, the reciMr. Macdonnell is an exception, and of poets who are hateful alike to<br />\nmore in two years of R. 0. T. C. than you could in a Dollar Steamship Lines<br />\ntation of the activities of the stu- he has written an exception. That is, gods and men—the mediocre. Medimonth of study in case of war. Suppose you can be Mydear Mr. Hart:<br />\nMy second wife is pretending to have a baby and so dents throughout the country, in de- he seems to have enjoyed his so- ocre poets fall in the \"F\" groups,<br />\nbetter drilled in the National Guards in two months<br />\nthan you can in two years of R. 0. T. C.? If that is we would like to borrow pesos 10 as there is a large fense of peace, freedom, and culture, journ in the States in spite of the and Mr. Guiterman's place is neither<br />\nfact that English visitors invariably<br />\n(Continued on Page 3, Col. 1)<br />\nthe case—and we present it as a point that has been family. We are 4 adults, and 5 sAultresses, so you can is something to inspire one.<br />\nadvanced—then there can be but one excuse for the see, Mr. Hart, that we need the money bad.<br />\nYour true servant,<br />\ncontinued existence .of the R. 0. T. C. on this—or any—<br />\nEmilio Del M<br />\ncampus.<br />\n<br />\nR.O.T.C. And War<br />\n<br />\n*<br />\n<br />\n*<br />\n<br />\nJust one. Granting the above, the R. 0. T. C. is<br />\npurely a weapon of indoctrination. Though not preparing men for war, it prepares them for the idea of war—<br />\nit prepares them to accept the bearing of arms against<br />\ntotal strangers as not an irrational practice. It is an<br />\nexpensive piece of propaganda.<br />\n<br />\nI received this piece of poetry anonymously. After<br />\nreading the poem, I can see that some day, if he develops his taint, he will be listed among America's leading poets. You will notice certain unmistakable signs<br />\nof genius contained here.<br />\nOnce there were three girls<br />\nIf it does not indoctrinate or if it does not train,<br />\nWho didn't know what to do.<br />\nthen there is no reason to keep the R. 0. T. C. in colThey decided to take up Bio,<br />\nleges.<br />\nAnd to learn about something new.<br />\nThe second point:<br />\n4 (a)—That we refuse to support the government<br />\nof the United States in any war in which it may engage.<br />\n(b)—That we refuse to support the government of<br />\nthe United States in any aggressive war it may undertake.<br />\nWe refuse to support the government of the United<br />\nStates in any aggressive war it may undertake.<br />\nFurthermore, with the treacherous development of<br />\nmodern diplomacy—hypocrisy, no distinction can be<br />\nmade between an offensive and a defensive war between powers of equal strength.<br />\nWe will not fight for somebody else.<br />\nWe will fight to preserve principles we have or<br />\nthink we have. If some nation were to invade our country and attempt to impose upon us certain doctrines<br />\nor practices that we hold irrevocably untenable, we<br />\nwould risk our lives against an unlivable condition.<br />\nIf Germany were to land troops on our shores, we<br />\nbelieve that those of us who feel that there would be<br />\nno living under the Nazi system of restrictions should<br />\ngamble our lives. There are those who look upon Fascism (including Naziism) as but a form of capitalism,<br />\nand who feel that there is not enough difference between any two forms of capitalism to excuse a drop<br />\nof spilled blood.<br />\nWe cannot deny the legitimacy of that view.<br />\n<br />\nFirst they attended the lectures<br />\nAnd then they went to Lab,<br />\nThey learned about the amoeba<br />\nThe Lobster and the Crab.<br />\nAnd then a lecture on sex came along—<br />\nOn how and what to do,<br />\nOut dropped a girl who was very shy<br />\nAnd thus there were only two.<br />\nThe course continued right along<br />\nStudying the forms of life,<br />\nA Bio boy loved a Bio girl,<br />\nAnd soon became man and wife..<br />\n<br />\nCOME ONE, COME ALL<br />\nST. JOHNS<br />\nFOOTBALL RALLY<br />\n• BIG PARADE DOWN CHARLES STREET<br />\n• BONFIRE<br />\n• TALKS BY THE TEAM MEMBERS<br />\n• TALKS BY THE ATHLETIC COACHES<br />\n• YELLS, SONGS<br />\n<br />\nNow there is but one in the class<br />\nWhere formerly there were three.<br />\nThat Bio's not a course for girls<br />\nIs very plaffi to see.<br />\nFive years from now I see this girl<br />\nTeaching her Bio classes,<br />\nIt's easy to see her name's still Miss,<br />\n(Sorry, I can't think of a last line.)<br />\n. . . the poet evidently became disgusted at this<br />\npoint, and decided to let the reader concoct his own<br />\nlast verse. He also explains anything that may not be<br />\n\"according to Hoyle\" on the grounds that he possess a<br />\npoet's license ending with -000.<br />\n<br />\nFRIDAY BEFORE THE<br />\nST. JOHNS GAME 8 P. M.<br />\n<br />\nFa<br />\n<br />\niWh<br />\nf<br />\nl<br />\na<br />\nit<br />\ng<br />\nf<br />\nT<br />\nn<br />\ne<br />\nv<br />\n<br />\ncorn<br />\n<br />\nPap<br />\n<br />\nSte<br />\nma<br />\nHa<br />\nthe<br />\nby<br />\ncer<br />\n<br />\nlam<br />\ndrE<br />\neh],<br />\n<br />\nthe;<br />\niss.<br />\n<br />\n7<br />\nod I<br />\n<br />\nSue<br />\n<br />\nove<br />\n<br />\nve<br />\nce<br />\n<br />\nthe<br />\n<br />\near<br />\nrea<br />\nWa,<br />\n<br />\nI<br />\nsee<br />\nind<br />\nPE I<br />\nSul<br />\nof<br />\nel<br />\nstc<br />\nan<br />\nWe<br />\nan<br />\n<br />\nMt<br />\n<br />\n1,<br />\n1Ri<br />\n<br />\nPe.<br />\n<br />\nSp<br />\n<br />\nSo:<br />\n<br />\nCO,<br />\n<br />\nWI<br />\n<br />\nth<br />\n<br />\nev<br />\n<br />\nof<br />\nI<br />\n<br />\nat<br />\n<br />\n\f3<br />\n<br />\nHOME WOOD, BALTIMORE, MD., NOVEMBER 5, 1935<br />\n<br />\nMemorial Fund<br />\nBuys Addison,<br />\nSteele Papers<br />\n<br />\nA Letter To<br />\nThe Editor<br />\n<br />\nVIEWS AND REVIEWS<br />\n<br />\nAbout The<br />\nAlumni Office<br />\n<br />\nHays,PeacePoll<br />\nWill Be Feature<br />\nNext Assembly<br />\n<br />\nsary party for an engaging couple<br />\nThe Alumni Office as we know it<br />\nadeptly by Constance CumTonight's performance of the Pet- played<br />\nDear Editor:<br />\nfounded a little less than ten<br />\nwas<br />\nthe<br />\nIn<br />\nYoung.<br />\nRobert<br />\nand<br />\nmings<br />\nI find it hard to restrain myself rified Forest, will mark the local preago. Since then its functions<br />\nyears<br />\nFurColonel<br />\nHenLouise<br />\non<br />\nEilers,<br />\nSally<br />\ncommenting<br />\nare<br />\ngroup<br />\nfrom<br />\nmiere of the show at the Maryland<br />\nlong's talk on \"Ethiopia.\" Let me Theatre, and will star Kenneth Mc- ry, George Meeker, Monroe Owsley have been many. There is in the offirst say, that I thought the slides Kenna. Pour of the members of the and Reginald Denny, who carry their fice a complex system of files, in<br />\nwhich are kept records of the names<br />\nof his water-colors were very fine, original Broadway cast that supportroles as slightly inebriated society and addresses of all Hopkins graduand I was delighted to find him ed Leslie Howard have been engaged<br />\nshowing real appreciation for the by Mr. Moore for this production-- folk excellently. Rounds of drinks, ates since the system was started,<br />\nantelope. \"I call this one the Queen Esther Leeming, Milo Boulton, James rounds of estates, and a roadside inn there being something like 13,000<br />\nof Antelopes.\" The antelope has been Doody and Ross Hertz. The other end in oblivion for all. The next morn- graduates in all the schools of the<br />\n(Continued from Page 1, Col. 6)<br />\ntoo long relegated to limbo, and I roles will be played by permanent ing, it is found that one of the group University in' that period. Every day<br />\nThe trustees of the Gordon Huntvarious papers are read through and lem of success, German Naziism,<br />\nappreciate the Colonel's effort to put members of the Cape Playhouse<br />\nhas been murdered.<br />\nington Harper Memorial Fund of her once more before the public. He<br />\nall mention of Hopkins graduates is and, last year, intolerance in the<br />\ngroup: Forrest Orr, Flora Campbell,<br />\nTo give any of the plot away at clipped out and retained for future United States.<br />\nWhich Dr. H. D. Havens is chairman, also showed us a splendid picture of Ernest Decker, Dorothy Blackburn,<br />\nhave announced the purchase of a a lion, \"it is no wonder that Haille Philip HUston and Dudley Hawley. this time would be unfair to those reference. These records include as<br />\nStrong convictions have Marked<br />\ncalls himself The Lion of<br />\nwho are eager to see the beautifully aforementioned, those of all other<br />\nBurk Symon will direct.<br />\ncomplete collection of The Spectator Selassie<br />\nhis career since the day he was jailed<br />\nmounted production. However, a sin- schools of the University, none of<br />\nJudah.\" Yes, I thought so, too.<br />\nof The Petrified Forest,<br />\nsucces<br />\nThe<br />\nPapers, published by Addison and<br />\nister hypnotist, Gustav von Seyffer- which have such an extensive sys- in a Pennsylvania mining town for<br />\nConsidering that the Colonel is a<br />\nan enterSteele. The collection, now in the member of the Intelligence Service it is said, was the result of<br />\nhis assertion of the right of free<br />\nArnold, playing an ace tem.<br />\nprob- titz, Edward<br />\nMain room of the library in Gilman of the TT. S. Army, I was not sur- taining discussion of serious<br />\nlaughhis<br />\nBrophy,<br />\nEdward<br />\ngradudetective;<br />\nRecords of the University's<br />\nspeech. Perhaps his greatest fame<br />\nmelodrama,<br />\nHall, contains the various issues on prised or even grieved to find him lems. It is a vigorous<br />\nGregory Ratoff, as ates have been kept year by year was achieved in 1925, when he served<br />\nassistant;<br />\nable<br />\nthe original paper as they were read working in an argument for bigger with an absorbing story that pro- the roadhouse proprietor; Robert since 1874, there being a case full of<br />\nas one of the defense attorneys in the<br />\nvokes thought. The scene is a remote<br />\nby the elite of the early eighteenth<br />\nArmstrong and Jack LaRue, as chau- these old books continuing right Scopes evolution trial. He took his<br />\nand better war preparations. The<br />\nthe<br />\ndesert;<br />\nArizona<br />\nthe<br />\nof<br />\ncentury. There are five hundred and delicacy with which the military are section<br />\nffeurs; Arthur Treacher, as a cold through 1927-1928. However, the-old- law degree from Columbia in 1905.<br />\nwhole of society<br />\nfifty-four issues, all well preserved, able to make none-too-subtle propa- _ale implies that the<br />\nand forbidding butler, and other char- er records are not very comprehenEven a Hays address does not ovbound in book form. The five hun- ganda sound like cold logic has al- is figuratively a petrified forest.<br />\nacters serve to make the plot move sive.<br />\nthe importance of the<br />\nershadow<br />\nbrings<br />\nperformance<br />\nThe Maryland<br />\ndred and fifty-fifth issue was not in- ways been a great source of admirafaster, the dialog to become more<br />\nAnother important activity of the peace poll. Coming at a time of included for some reason, forgotten tion to me. He began by saying, \"Stu- Mr. McKenna back to Baltimore for brilliant, and the clues and deducAlumni Association is the production creasing tension, it will provide an<br />\nthese two centuries since it was last pid thing, this business of war, BUT, the first time as a stage star since tions which lead to the apprehension<br />\nthe Johns Hopkins Alumni Maga- insight of the opinion of the men<br />\nof<br />\n20 weeks with tie of the killer to be revealed.<br />\nissued.<br />\nnational defense, and by that I mean he played for<br />\nzine, which is reaching at present who will fight the next world war.<br />\nAudithe<br />\nat<br />\nPublished In 1711<br />\ngood national defense . . . is the Knopf Stock Company<br />\napproximately 1,500 Hopkins gradu- For this reason, the poll has been<br />\ntorium in 1i (-28 during which he<br />\nates. The book, of which there are given considerable discussion in the<br />\nThe Spectator was an English peri- best measure of keeping peace. AnyFORD'S<br />\nCardHer<br />\nappeared in such plays as<br />\nfour copies per year, is edited by Dr. NEWS-LETTER with the object of creodical, published in London and is- one who does not insist on good naBig Pond, and ft ne<br />\nboard Lover,<br />\nTickets are now on sale at the box Roulston of the German department.<br />\nsued daily. The circulation was well tional defense is a . . .\" and here I<br />\nating a definite student opinion. Nalater went to Hol- office of Ford's Theatre for the Eva<br />\nHe<br />\nRome.<br />\nto<br />\nRoad<br />\nColonel<br />\nthe<br />\nwhat<br />\nover ten thousand daily, which was forget just exactly<br />\ntionally the Student Mobilization for<br />\novalmost<br />\nstar<br />\na<br />\nbecame<br />\nand<br />\nlywood<br />\nLe Gallienne engagement which<br />\nvery good for the early eighteenth did say, perhaps, \"is a baby or a<br />\nThe Maine Intercollegiate Athletic Peace is sponsored by the Committee<br />\nTrouble,<br />\nMan<br />\nin<br />\nacted<br />\nhe<br />\nernight;<br />\nreiterhim<br />\nThursday.<br />\nopens next<br />\ncentury. The first issue appeared on sissy.\" I was glad to hear<br />\nAssociation has decided to set a rate on Militarism in Education, AmeriDorothy Mackail; Sin Takes a<br />\nthe streets March 1, 1711. The last ating that familiar gag which is so with<br />\nThe LeGallienne engagement is for of 55 cents on visiting student tickets can League Against War and FasHoliday, with Constance Bennett, and<br />\nthree days only, opening November at football games.<br />\ncame out on December 6, 1712. The dear to the heart of any army man<br />\ncism, Student League for Industrial<br />\nMen , nout Women, to mention a<br />\nam<br />\n\"I<br />\nthis,<br />\nlike<br />\nsomething<br />\nruns<br />\n—it<br />\n7 and ending after the Saturday night<br />\nreason it was forced out of business<br />\n*<br />\n*<br />\n*<br />\nDemocracy, Y. M. C. A., National<br />\nthat<br />\ncinemas<br />\nmany<br />\ndirected<br />\nand<br />\nfew,<br />\nknow<br />\nwho<br />\na pacifist, only those of us<br />\nWas the newly passed Stamp Act.<br />\nperformance, November 9.<br />\nLeague, Y. W. C. A., NaStudent<br />\nappeared<br />\nRobert<br />\nhas<br />\nhe<br />\nseason<br />\nCollege<br />\nHaverford<br />\n(ready: Army scored hits. This<br />\nIn perusing the collection one may what war really is<br />\nThe plays to be presented during Louis Stevenson's geometry note- tional Student Federation of AmeriCoopGladys'<br />\nwith<br />\nsuccess<br />\nmuch<br />\nwith<br />\nsee these stamps in the corner of the men) can be true pacifists.\"<br />\nas Iago and the brief stay are Camile, Rosmer- book and Maxfield Parrish's chemis- ca, Student Federation, and .IntercolInasmuch as the present adminis- er and Philip Merifale<br />\nindividual sheets. The aim of the<br />\nlegiate Council.<br />\nin<br />\ntello and sholm, The Women Have Their Way, try notebook.<br />\nrespectiyely,<br />\nMacduff,<br />\nthe largest<br />\nPaper was to discuss non-political tration is forwarding<br />\nhe played the and A Sunny Morning.<br />\nyear<br />\nLast<br />\nMacbeth.<br />\nhistory,<br />\nour<br />\nall<br />\nin<br />\nbudget<br />\npeace time<br />\nsubjects and \"bring philosophy out<br />\nCamille will be presented at one<br />\ncentral role in George Kaugman's<br />\nOf the closet and schools to dwell in I do think that the Colonel might be<br />\nBy Your performance only, Saturday matinee,<br />\nAlong,<br />\nRoll<br />\nWe<br />\nMerrily<br />\ngratitude.<br />\nof<br />\nlack<br />\naccused of some<br />\nclubs and at coffee-house tables.\" It<br />\nand Accent November 9.<br />\nDuring all this, it was quite evi- Leave, Wife Insurance,<br />\nStood for reason and moderation in<br />\nhe played<br />\nLeave<br />\nYour<br />\nRosmersholm is to be played for<br />\nBy<br />\nin<br />\nYouth<br />\non<br />\nfailgross<br />\nthe<br />\nin spite of<br />\nEighty percent of Skidmore girls Law School, was once blacklisted by<br />\nan age of party strife. The frame- dent that<br />\nmake the world opposite Dorothy Gish, who at that two performances, Friday and Saturto<br />\n\"war<br />\nthe<br />\nof<br />\nure<br />\nWork of The Spectator is supplied by<br />\nsay<br />\nthat they have never been kissed the Daughters of the American Revday evenings, November 8 and 9.<br />\ndemocracy,\" Colonel Fur- time was his wife.<br />\nolution.<br />\nan imaginary club grouped around safe for<br />\nby<br />\nboys.<br />\nThe Women Have Their Way and<br />\nHe is a brother of Jo Mielziner,<br />\n* * *<br />\nlong would still adhere to such<br />\n* * *<br />\nMr. Spectator.<br />\na myth. He would go to war with one of the best-known stage desig- a Sunny Morning are both played in<br />\nat the University of<br />\nprofessor<br />\nA<br />\nSeveral frat men at Stanford were<br />\nThe role of Mr. Spectator was<br />\nthe full realization that he was fight- ers of this country, who assisted in one evening as a double bill and this<br />\ngah a difficult<br />\nrecently<br />\nCalifornia<br />\npranks. Among other things,<br />\ntaken by both Joseph Addison and<br />\nthe decorations of the cinema thea- performance will be given once only, playing<br />\ning to save his country.<br />\nassignment to his class. One of the<br />\nthe<br />\nlooking<br />\nof<br />\nrealistic<br />\npublishers<br />\nvery<br />\na<br />\nthe<br />\nplaced<br />\nSteele,<br />\nthey<br />\nRichard<br />\nThat a military man is able to tre at Mr. Moore's dramatic head- on the opening night of the engagestudents, disgusted, said, \"Who indummy on the road, hoping to have<br />\nPeriodical, in turn, whenever one of believe he is actually fighting for quarters on Cape Cod at Dennis He ment, Thursday next.<br />\nvented work, anyway?\"<br />\nwould<br />\nwho<br />\nperson<br />\nthe<br />\nwith<br />\nfun<br />\nthem was to write an article. Mr.<br />\nsome<br />\nhis country, must give much com- is the son of the late Leo sMielziner,<br />\nDuring her engagement at Ford's<br />\n\"You should worry,\" the Prof. rerun over it. But there was no fun.<br />\nSpectator was a learned, serious per- fort to those controlling interests famous portrait painter, but as his<br />\nTheatre which begins November 7th,<br />\nplied, \"you Will never infringe on<br />\nMrs.<br />\nby<br />\nvivisected<br />\nwas<br />\nof<br />\ndummy<br />\nfrequenter<br />\nThe<br />\nson who was a constant<br />\nwho are unromantic enough to regard mother's name was McKenna, he Eva Le Gallienne will give two perhis patent.\"<br />\nHerbert Hoover and the boys just<br />\ncoffee-houses. In this way he \"had<br />\n* * *<br />\nwar as simply a good business prop- chose it for stage purposes.<br />\nformances of Henrik Ibsen's Rosmer\"tell<br />\nbeat it.<br />\nhis ear to the ground\" and could<br />\nosition. If one told this to the Colonel,<br />\nFraternities at the University of<br />\nsholm. This will be the first time that<br />\n*<br />\n*<br />\n*<br />\nWhich way the wind was blowing.\"<br />\nI'm sure he would just blink at you<br />\nRosmersholm has been seen here<br />\nUtah debated on the subject: \"ReThe Boston Herald has gathered<br />\nNEW<br />\nDr. John C. French, the Johns in a rather bovine fashion, and then,<br />\nsolved, that the shiny nose is preferwithin the memory of present-day<br />\nthe following answers from school<br />\nHopkins librarian, has stated that on finding himself, he would say, as<br />\nable to a hole of the stocking.\"<br />\nThe magic of great song is the theatre-goers.<br />\npapers:<br />\nthe collection will be kept lockefl at he said last Thursday, \"I regard wars,<br />\n*<br />\n*<br />\n*<br />\nLe<br />\nMiss<br />\nprincipal attraction at the New Thefollowing<br />\nImmediately<br />\nBenjamin Franklin's father was a<br />\nall times as it was so valuable. How- not as an economic measure, but, as<br />\nprofespsychology<br />\ncura<br />\nby<br />\nA survey<br />\natre, where Lawrence Tibbett is<br />\nGallienne, Mme. Nazimova, celebrat- tallow chandelier.<br />\never, it will be available for the use a moral one,\" and then go on to adsor at Temple showed that one of<br />\nrently starring in 20th Century's ed Theatre Guild star, will appear at<br />\nThe ancient Greeks planted coloOf students. Dr. French plans to dis- vocate anylising, \"one's spiritual<br />\nthe major fears of the men students<br />\nMetropolitan, the bright and :harm- Ford's as Mrs. Alving in Ibsen's<br />\nfor their food supply.<br />\nnists<br />\nin<br />\ncase<br />\nglass<br />\na<br />\nin<br />\nPlay the collection<br />\nself, and the spiritual objective.\" The ing romance of a young singer.<br />\nwas getting a taller girl on a blind<br />\nbeGhosts, for four performances,<br />\nThe heart is located on the west<br />\nGilman Hall. The exact date will be fact that Haille Selassie, \"dropped to<br />\ndate.<br />\nand<br />\n11th.<br />\nvigor<br />\nNovember<br />\nginning<br />\nsympathy,<br />\nwith<br />\nPictured<br />\nside of the body.<br />\n* * *<br />\nannounced in the NEWS-LETTER.<br />\nhis knees and prayed to his God for an abundance of sparkling comedy,<br />\nMme. Nazimova first made her<br />\nwas once put<br />\nRaleigh<br />\nWalter<br />\nSir<br />\nto<br />\nseemed,<br />\ntake,\"<br />\nto<br />\n\"Who was Talleyrand?\"<br />\nthe right road<br />\nMetropolitan traces Tibbett's career reputation in this country as an in- out when a servant found him with<br />\n\"She was a fan dancer, and cut out<br />\nthe Colonel, to give him an edge on as a young singer who can brook no<br />\nan<br />\nin<br />\nit<br />\nwas<br />\nand<br />\nIbsen<br />\nof<br />\nterpreter<br />\na fire in his head.<br />\nthat baby talk.\"<br />\nMussolini, who has not yet indicated delay, launches out on the world on<br />\nIbsen drama that .Eva Le Gallienne<br />\nThe Romans were too thickly pop—Ohio State Lantern.<br />\nany signs of praying. The Colonel<br />\nhis own.<br />\nforth as an actress-mana- ulated to be very. comfortable.<br />\nbranched<br />\n* * *<br />\nbe<br />\nwould<br />\n\"wondered\" if the situation<br />\n* * *<br />\nHis trail crosses that of Virginia ger.<br />\nA professor at the University of<br />\nthe same if Mussolini had been<br />\nTime has added greatly to the lusBruce, and there is affection between<br />\nThe average frosh at Harvard this Washington, when asked why he was<br />\nthoughtful enough to secure a tete(Continued from Page 2, Col. 6)<br />\nAlice<br />\nBut<br />\nbecause<br />\nand importance of Ibsen. His plays year is named John, comes from<br />\nimmediately.<br />\ntre<br />\nthem<br />\nloafing outside during the class pea-tete with his God before embarkWith these nor with the Honor men.<br />\nBrady, who controls the money in are as vital and interesting today as Pennsylvania, prepared at Mercers- riod, replied that he was giving his<br />\ning for Ethiopia.<br />\nThe author's verses, often appeartheir operatic company, is jealously when first written, and he has gone burg, is the son of a college grad- class a final examination. When<br />\nI should also like to ask the Col- fond of him, they must conceal their down in history as a great dramatist, uate, and has a middle name.<br />\ning in contemporary magazines, are<br />\nasked whether he was not afraid the<br />\nthe so-called \"adequate fa* * *<br />\na great reformer and a great man.<br />\nusually humorous in nature. The onel if<br />\naffection.<br />\nstudents would crib, he answered<br />\ndefense\" have<br />\nnational<br />\nof<br />\ncilities<br />\nThe opportunity to see two plays<br />\nPresent collection contains some huProfessor Kipp, of the law faculty that he had fooled them, and turned<br />\ntBut ingenuity and courage solves<br />\nbrought with them anything apof modern play- of Bonn University, Germany, was in the grades the day before.<br />\nforemost<br />\nthe<br />\nby<br />\nMorous specimens, but mdre are fan- ever<br />\npeace? \"Yes,\" I can hear the problem, and the climax presents<br />\n* * *<br />\nciful or tender in quality. A number proaching<br />\nwrights, in such close juxtatposition, forced to resign because his maid<br />\nsay, \"but we've never Tibbett as the hero of the evening,<br />\nColonel<br />\nthe<br />\nnaand<br />\nair<br />\nof the most cele- patronized a Jewish butcher.<br />\ntwo<br />\nby<br />\ninterpreted<br />\ntreat of life in the open<br />\nat Vassar has been<br />\nskunk<br />\npet<br />\nThe<br />\nfacilities of national wildly applauded after his sensation* * *<br />\nbrated actresses of the day is an imture. The reader, looking for cere- had adequate<br />\nexchanged for a black cat.<br />\ndebut.<br />\nal<br />\n*<br />\n*<br />\nportant and unique event and one of<br />\nbral, bitter, and ironic stuff must defense.\"<br />\nFor the first time in the history of<br />\nMAUS V. DARLING.<br />\nIn the course of the action, Tibbett which Baltimore theatre-goers and<br />\ncontinue his search, but for one who<br />\nPrinceton, more freshmen turned out<br />\nprofessor at Westphilosophy<br />\nA<br />\nsings selections from Pagliacci, Car- particularly students should take adlikes simpler subjects in more mufor the rowing crew than for foot- wood was expounding at length on<br />\nmen and The Barber of Seville, as vantage.<br />\nsical measure here is something<br />\nball.<br />\nthe popular belief that \"time heals<br />\nwell as a number of popular compoWorth while. Thus the title poem tells<br />\nThe Dickinsonian tells what's what all things.\" At the close of the lecsitions.<br />\nthe eternal story of a brave man<br />\nin a college education:<br />\nture, he asked if there were any quesWAVERLY<br />\nExams Periods of Unusual eye- tions. Came a voice from the rear<br />\nMeeting death bravely. I don't know<br />\nthe<br />\nwas<br />\ncamera<br />\nfor<br />\na<br />\nA windshield<br />\nKEITH'S<br />\n(Continued from Page 1, Col. 6)<br />\nstrain.<br />\nWhether General Putnam has (like<br />\nof the room, \"How about a leaky<br />\nunusual device resorted to by studio<br />\nmost of our national heroes, ever called in Switzerland by the League<br />\nRe-exam—A second chance to see radiator?\"<br />\nBright in dialog, flashing in set- technicians to permit an actor to<br />\n* * *<br />\nbeen debunked). At any rate the old- of Nations.<br />\nbetter.<br />\ntings and with an absolutely new idea throw a box of snuff at the lens.<br />\ner estimate is here stirringly, if<br />\nDr. Koo's more recent years have as a mystery plot, Remember Last<br />\nat the University<br />\nmajor<br />\ndrum<br />\nhour.<br />\nThe<br />\nber<br />\nLecture—Slum<br />\nThis was the odd expedient embeen spent, first as Associate Gen- Night?, which opened at Keith's TheGame played by pro- of Minnesota does not practice with<br />\nsimply, sung.<br />\nProctoring—<br />\nployed in The Bishop Misbehaves,<br />\nPoems which best pleased the re- eral Secretary of the China National atre last Thursday, is based on the Metro - Goldwyn - Mayer's whimsical fessors and students during exams, the band, but each Saturday morning<br />\nviewer were \"Lament for the Alamo,\" Committee of the Y. M. C. A., and best-selling novel of the same title comedy-mystery, coming Tuesday to similar to children's games, \"I spy he studies diagrams and must know<br />\n\"When Falstaff Met the Wife of later after resignation from this po- by Adam Hobhouse, and produced as the Waverly Theatre. In the amusing you.\" Very annoying to those partic- exactly where to be in relation to the<br />\nmarkers and when to be there in reipating in the exams.<br />\nIlath,\" \"Education,\" and \"Blessings sition he has given most of his time one of Universal's outstanding prostory of the bishop who turns detecOh Little Boys.\" But the titles of to work among students both in ductions of the season, was directed<br />\nRoscoe Pound, dean of the Harvard lation to the music.<br />\ntive, Edmund Gwenn, plaNIng the<br />\nPoems are only the names of dishes China and in foreign countries such by James Whale. Whale outdid him- mystery-solving bishop, had to halt<br />\nFor<br />\nand<br />\nEurope.<br />\nOn a bill of fare. Here is an example as India, Australia,<br />\nself, for he injected almost as many four crooks by throwing snuff in<br />\nOf the author's rhymes from \"This the fourth time he comes to North laughs into the screen play as there<br />\ntheir faces. In the closeup it had to<br />\nAmerica.<br />\nia She\":<br />\nwere exciting moments.<br />\nbe directed at the camera. A piece of<br />\nA. Schaal, loE.<br />\nto<br />\nDr.<br />\nAccording<br />\n\"Then, having a moment to spare,<br />\nscreen tale opens with the so- plate glass was used to keep it out<br />\n'The<br />\ncal Y. M. C. A. secretary, Dr. Koo<br />\nWe turn our attention to hair;<br />\ncially prominent \"fast set\" of Long of the delicatd lenses and mechanism.<br />\nwill be asked to speak on ways of<br />\ntive,<br />\ntendrilly-curla<br />\nHer<br />\ngiving a progressive anniverIsland<br />\n—J. S.<br />\npreserving peace in these times, with<br />\nTumbly and whirlative,<br />\nEuHere is a Katz Topcoat tailored especially for the wellin<br />\nimminent<br />\nthe uireat of war<br />\nSuper-superlative<br />\n1<br />\ndressed college man. It has quality—it has style—a Topcoat<br />\nrope and in the Orient.<br />\n_mproved Indicator<br />\nhair.\"<br />\nthat promises to be a campus favorite.<br />\nAt the University Lecture Series<br />\nAnd this is from \"Education\":<br />\nheld at 8 p. m. this evening at the<br />\n\"Theology, languages, medicine,<br />\nFirst Methodist Episcopal Church<br />\nlaw,<br />\n$25<br />\nAre peacock feathers to deck the Dr. Koo has chosen as his topic \"Avethe<br />\nof<br />\nGod.\"<br />\nReality<br />\nto<br />\nunes<br />\n$4.50<br />\nCorduroy Slacks for Campus Wear<br />\ndaw<br />\nA.<br />\nMARYLAND<br />\n<br />\nFamous Criminal Lawyer To<br />\nBe Tapped by Pi D. E.<br />\nAfter Address On \"Peace\"<br />\n<br />\nFamous \"Spectator\" Papers<br />\nOf 18th Century Now In<br />\nThe Hopkins Library<br />\n<br />\nINTERCOLLEGIATES<br />\n<br />\nON THE BOOK<br />\nHORIZON<br />\n<br />\nSupper Club Will<br />\nHear Koo Tonight<br />\n<br />\nThe Fashion for College MenTheWrap-Around Topcoat<br />\n<br />\nK & E ,roctiaRvikliCellge<br />\n<br />\n,<br />\n<br />\n..<br />\n<br />\nSLIDE RULES<br />\nMADI 114 U. S.<br />\n<br />\nIf the boys who come from yOur<br />\nsplendid schools<br />\nAre well-trained sharpers or flippant fools.\"<br />\nX think those four lines almost deserve an \"H.\"<br />\nL. WARDLAW MILES.<br />\n<br />\nPEABODY<br />\nPHARMACY<br />\nCALVERT and BOTH STREETS<br />\nWe Sell Drugs and Give Service<br />\n<br />\nBack of Every Achievement of<br />\nModern Engineering<br />\n<br />\nKATZ CLOTHES<br />\n<br />\nKEUFFEL & ESSER CO.<br />\nN. J.<br />\n<br />\n211 - 213 E. Baltimore Street<br />\n<br />\nCHICAGO ST.LOUIS SAN FRANCISCO MONTREAL.<br />\nAmerica's Foremost Manufacturer of Drawing Materials,<br />\nSurveying Instruments and Measuring Tapes<br />\n<br />\nMoving Soon to 7 & 9 E. Baltimore, at Charles<br />\n<br />\nNEW YORK<br />\n<br />\nHOBOKEN,<br />\n<br />\n\f4<br />\n<br />\nHOME WOOD, BALTIMORE, MD., NOVEMBER 5, 1935<br />\n<br />\nHopkins Beaten<br />\nBy Powerful Mt.<br />\nSt. Mary's Outfit<br />\n<br />\nSportlight<br />\n<br />\nBlue-Jay Harriers Defeated By<br />\nSwarthmore In Close Encounter<br />\n<br />\nState Scores<br />\n<br />\nE Overwhelmed By<br />\nF In Dorm Combat<br />\n<br />\nED LOTZ<br />\nBorn in Ellicott City. (Yes, the<br />\ntown has a horse) . . . Learned his<br />\nMt. St. Mary's, 47; Hopkins, 0<br />\nfootball playing with his brothers on Sholtes And Emmert Again Tie For First Place But<br />\nSuClose 17-13 Baseball Game<br />\nhills near Ellicott City . . . Attended<br />\nHampden-Sydney, 27; St. John's,<br />\nperior<br />\nBalance<br />\nOf<br />\nVisiting<br />\nSwarthm<br />\nore<br />\nTeam<br />\nlocal schools . . . Entered St. John's<br />\nCulminates Week's Pro14<br />\n. . Rather odd—at high school he<br />\nNets Them Victory<br />\ngram;Lo<br />\nL tz<br />\ntz Shines For<br />\nPrinceton, 26; Navy, 0<br />\nJays Defeated By 47 To 0 In played basketball, soccer, and base- For the second consecutive time, front<br />\npositions to end up on the light<br />\nball; while at the Annapolis instituLopsided Game; Teams tion he engaged in football, lacrosse, the Blue Jay cross-country team lost end of the score. However, there is Western Maryland, 24; Baltimore, \"F\" entry met its rival of old, \"E\"<br />\nentry, in a game of indoor baseball<br />\nAre Unevenly Matched and boxing . . . Couldn't make the last Saturday by the close score of plenty of good material in the squad<br />\no.<br />\nlast Sunday morning. This contest,<br />\n27-28.<br />\nAlthough<br />\nCaptain<br />\nEmmert<br />\nand to be worked on,<br />\nJohnnies' basketball team; and so<br />\nthe culmination of a long and bitter<br />\nand it is hoped that<br />\nMaryland, 14; Virginia, 7.<br />\nturned to boxing. . . Was undefeated Cart Sholtes, both of Hopkins, again the other men will increase their<br />\nseries of altercations as to relative<br />\ntied<br />\nfor<br />\nfirst,<br />\nthe<br />\nstrong<br />\nSwarthmore speed<br />\nin three years of boxing competition<br />\nsufficiently to balance off the<br />\nabilities, clearly showed the far suSusquehanna, 13; Washington, 6.<br />\n. . . Unanimous choice for All-Mary- group placed in enough of the other squad.<br />\nperiority and skilled achievement of<br />\npositions<br />\ngain<br />\nto<br />\nvictory<br />\nfor them.<br />\nland football . . . All-American lathe<br />\nvictors. \"F\" entry emerged vicThe<br />\norder<br />\nin<br />\nwhich<br />\nthe<br />\nTeam Goes Down Fighting; crosse<br />\nrunners<br />\nfinA few minutes after the first quar(and all-universe parchesi)<br />\ntoriously, 17-13.<br />\nished was as follows:<br />\nBasketba<br />\nll<br />\nPractice<br />\nJays Not In The Least Bit ... Considers making All-Maryland ter of the football game between Tie for first place—Captain Leonard<br />\nAmong the athletes who competed<br />\ngreater achievement than Hopkins and Mt. St. Mary's had befor the glory of \"F\" entry was Ed<br />\nWith<br />\nthe<br />\nDiscouraged At Outcome football<br />\nidea<br />\nin<br />\nmind<br />\nthat<br />\nEmmert<br />\n\"pracand<br />\nCarl<br />\nSholtes<br />\nof the<br />\nAll-American lacrosse . . . \"Hit the gun, the harriers of both squads<br />\nHopkins. Time-22:39.<br />\ntice makes perfect\", the Hopkins Lotz, who is in charge of the dormibooks\" just like he hit the line. And made their appearance. The track<br />\ntory athletics. By dint of his fine<br />\nBy LEONARD RUBINGER<br />\nbasketball aspirants went through a<br />\nwhat gains! A.B. from St. John's; was cleared, and after a few minutes 3. Loeb, Swarthmore.<br />\nplaying,<br />\nand encouraging presence,<br />\nA vastly superior Emmitsburg<br />\ngood workout yesterday under the his team was able to nose out its<br />\nM.E. from Hopkins and next year it'll of warming up by means of trotting 4. Cadwalader, Swarthmore.<br />\nold<br />\n5. Bose, Swarthmore.<br />\nsquad took our own g-ridmen into be \"Doc\" . . Was the sports<br />\neditor and calisthenics, the signal for the<br />\nguidance of Captain George Margo- rival. Assisting Lotz were Lewis, of<br />\n6.<br />\nHendley,<br />\nSwarthmore.<br />\ncamp Saturday by the overwhelming of St. John's Collegian . . . President start was given. Immediately Carl<br />\nlis. The newcomers, along with a few the Biology Department, Haushe,1<br />\nSholtes took the lead with a swift, 7 G. Brown, Hopkins.<br />\nscore of 47-0.<br />\nThe Jay team was of S. P. E. chapter for two years . . .<br />\nvarsity men from last season, went Miller, Krell, and Romanofsky froml<br />\n8.<br />\nLyman,<br />\neven stride. Captain Emmert soon<br />\nHopkins.<br />\n\"B\" entry, who donated his services<br />\nhopelessly outclassed from the start But say, Ed, who is that women I<br />\nthrough a passing drill and finished<br />\nalways see you with—no scandal, caught up to him, and the two held 9. Meader, Swarthmore.<br />\nfreely for the contest, being the first,<br />\nby a heavier, faster, more experienc10.<br />\nMoxley, Hopkins.<br />\nthe practice session with a brief ringer to actually aid his outfit<br />\nWinchell—it's Mrs. Vanneman, lead- their lead throughout, showing a fine<br />\nand<br />\n11. Warnecke, Hopkins.<br />\ned squad of Saints, which only a week ing lady at the Dorms<br />\n. . . Raise your cross-country style. In the home<br />\nscrimmage.<br />\nnot the opposition.<br />\n12.<br />\nStevens, Swarthmore.<br />\nbefore had held Western Maryland steins, Hopkins men (gentlemen) to stretch Emmert showed the way,<br />\nEd—athlete, scholar, and all-around closely followed by Carl, who gave 13. Schultz, Hopkins.<br />\nto a one-touchdown victory.<br />\na beautiful spurt to end up tied for 14. Castelle, Hopkins.<br />\nDespite the discouragement which good fellow.<br />\nfirst. The time of the winners was 15. Bradbury, Swarthmore.<br />\nmust have prevailed among them, the<br />\n22:39. A few moment later, Loeb,<br />\nThe next home contest takes place<br />\nHopkins boys, fighting hard and St. John's Trounced By<br />\nCadwalader, Bose and Hendley, all of on November 9, when the harriers<br />\ncourageously throughout, had the<br />\nHampden-Sydney, 27-14 Swarthmore, pased the finish line in meet Drexel Institute.<br />\nthe order mentioned, just as the first<br />\nspectators wondering at their spirit<br />\n•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••11.11.1<br />\nIn a game chock full of surprises, half of the football game ended. These<br />\nand determined striving.<br />\nSt. John's, Hopkins' traditional rival four positions were enough to ser<br />\nEarly Game Close<br />\nNEW YORK<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br />\nand next opponent, dropped a 27 to cure the victory for the visitors. Ly- t<br />\nThe visiting team, after receiving 14 tussle to Hampden-Sydney. The man of Hopkins brought the specta- iL0AN<br />\nOFFICIO<br />\nthe kick-off and retrieving the ball Virginia team scored its points on tors to their feet with a brilliant<br />\nLOANS<br />\nWhat you want is easy to find.<br />\nto its own 35-yard stripe, immediate- two sustained drives, a recovered final sprint. He placed eighth.<br />\n1<br />\n—.---fumble, and an intercepted pass.<br />\nThus Swarthmore, possessing an<br />\nYou get efficient service.<br />\nly commenced to hack away at the<br />\nUnredeemed Microscopes<br />\nThree extra points were made by evenly balanced squad, repeated the I<br />\nPrices<br />\nare reasonable.<br />\nHopkins line. For a moment it seem- placement<br />\nCameras, Binoculars, Musical<br />\nkicks. The Johnnies scored act which Lehigh had performed the<br />\nInstruments, Typewriters<br />\ned as if the game would be a nip-and- on an old fashioned sleeper play and week preceding.<br />\nThe Hopkins, with<br />\ntuck affair, for the Jays held; and an equally antiquated play, the two outstanding individuals in the<br />\nHopkins' hopes soared high when spread. Two points were also ob- form of Sholtes and Emmert, showed<br />\n118 N. LIBERTY STREET<br />\ntained by a blocked kick in the end a lack of balance, in that the team<br />\nKahl set the Mountaineers back on<br />\nPLaza 3495<br />\nzone.<br />\ncould not hold enough of the other<br />\n171..11•••••••••••••••••••••••••••••••••••••••••11.0.1.1.••••••••••11.41.1...<br />\ntheir own 15-yard marker with a<br />\nbeautiful end over end punt. From<br />\nthen on, however, it was veritably a<br />\nwalk-away. The Mounts moved 85<br />\nyards in a sustained drive for their<br />\nfirst touchdown. The kick was good,<br />\nand the score was 7-0. The quarter<br />\nended with the ball on Hopkins' 35yard line in Mt. St. Mary's possession.<br />\nScore Rolls Up<br />\nThe second period AV, the powerhouse from the Mount really put on<br />\nthe pressure. It ripped its opponent's<br />\nforward wall wide open time and<br />\ntime again. Its single, double, and<br />\ntriple reverses, executed by a set of<br />\nfast, hard-plunging, shifty backs,<br />\nbehind a line which outweighed Hopkins by 20 pounds to the man, were<br />\ntoo much for the Jay defense. When<br />\nthe half was over, four more touchdowns had been added to the Mt. St.<br />\nMary's score. Ward, the Jays' fullback, and left tackle Pinsky, by their<br />\nsparkling defensive play, made the<br />\nburden a little easier -for Coach<br />\nGeorge Darley.<br />\n<br />\nJays Play Bravely<br />\n<br />\nWE KNOW<br />\nMEN HATE TO SHOP<br />\n<br />\nHUTZLER 13FOTHEM<br />\n<br />\nhaf.zyd-9<br />\n<br />\nLu'tz yoa<br />\n<br />\nfklt,<br />\n9<br />\n<br />\nWell, to start with, we take tobacco<br />\n<br />\nfrom our own Southland — mild ripe<br />\ntobacco with lots of natural flavor but<br />\nno harshness or bitterness.<br />\n<br />\nA team consisting mostly of second-stringers began the second half<br />\nfor Hopkins against an opposition of<br />\nreserves. With the removal of its<br />\nfirst team backfield, which included<br />\nits two stars—Apichella and Kuratnick, Mt. St. Mary's power was very<br />\nmuch reduced. Nevertheless, the Emmitsburg boys managed to score<br />\ntwice more before the end of the<br />\ngame.<br />\nHowever,<br />\nthe<br />\nHopkins'<br />\nends and tackles played brilliantly<br />\non the defense, forcing the Saints to<br />\ndirect their attack to the center of<br />\nthe line. Tommy Ellis, left tackle,<br />\nplugged up the holes on the left end.<br />\nwhile speedy Zeeny Baum kept the<br />\nSaints' attack from<br />\nfunctioning<br />\naround the right. Vincenti proved<br />\nhimself the surest tackler in the<br />\nsecondary.<br />\nThe opening home game was not<br />\ntaken too much to heart by the<br />\nHopkins squad. The team is now<br />\nlooking forward to its game with St.<br />\nJohn's a week from next Saturday.<br />\nLool,. out for the Jays this time; they<br />\nare raving mad and rarin' to go!<br />\n<br />\nTHEN AS A SECOND STEP—<br />\n<br />\nWe blend this home-grown tobacco<br />\nwith spicy, aromatic Turkish tobaccos<br />\nfrom across the seas. These Turkish<br />\ntobaccos, you may know, have a flavor<br />\nand fragrance entirely different from<br />\nour own.<br />\nAS A THIRD STEP—<br />\n<br />\nThese tobaccos are cross-blended—<br />\nwelded together—the best way we've<br />\nfound to get a more pleasing flavor<br />\nand a better taste in a cigarette.<br />\nTHAT'S WHY CHESTERFIELDS<br />\nARE MILD AND YET<br />\nTHEY SATISFY<br />\n<br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and 33RD STREETS<br />\nNext To Blrely's<br />\n<br />\nCall PLaza 1696<br />\nFor QUICK LOANS On<br />\nAUTOMOBILES<br />\n<br />\nPUBLIC LOAN CO.<br />\n232 - 34 EQUITABLE BUILDING<br />\n<br />\n—..........—............,<br />\n1 Birely's Pharmacy I<br />\nST. PAUL at 33RD STREET<br />\nPrescriptions—School Supplies<br />\nCandy-Cigars<br />\nUnexcelled Fountain Service<br />\n<br />\nIn a single day people from ten different<br />\nstates visited our Chesterfield factories.<br />\n8,200 visitors during the past year saw<br />\nChesterfields made.<br />\n<br />\n(0 1935, LIGGETT & MYERS TOBACCO CO.<br />\n<br />\n\f", "format": "basic_html", "processed": "Member Of The<br />\nINTERCOLLEGIATE<br />\nNEWSPAPER ASSOCIATION<br />\nOf Middle Atlantic States<br />\nth<br /><br />\naritItt,5 Ikjøpkinz Nrius-tritrr<br />\nRat Routs Esquire<br /><br />\nAthletic Board<br />\nDecided On A<br />\nReorganization<br /><br />\nlent<br /><br />\nPresident Hazlett Studies Randolph the Rat, for years an inConstitution Alterations habitant of the basement and the<br />\nSuggested By 0. D. K. boon companion of many a pale,<br /><br />\nathbar-<br /><br />\ncul-<br /><br />\ntitly<br />\nvish<br /><br />\nverof<br />\nork<br />\ncook<br />\nwee<br />\nugs<br />\nout<br />\na<br /><br />\nent<br />\nde-<br /><br />\nars<br />\nHe<br />\nof<br />\npus<br />\nion<br /><br />\na<br />\nto<br />\nviii<br />\ne,,,<br />\none<br />\nerLed<br /><br />\nrd<br />\nof<br />\nLce<br />\nhe<br /><br />\nN.<br />\nts,<br />\nnost<br />\nN.<br /><br />\n11-<br /><br />\nnt<br />\nLs-<br /><br />\nis<br />\nY-<br /><br />\nL5<br /><br />\nin<br />\nr,<br /><br />\n;0<br /><br />\nte<br /><br />\nHe stood outside the NEWS-LETTER<br />\noffice, his two hundred pounds resting comfortably<br /><br />\nin<br /><br />\nsize<br /><br />\n20<br /><br />\ncorduroy coat, his<br /><br />\nsix<br /><br />\nfeet<br /><br />\nthree<br /><br />\nAttracted by the brilliant spectacle,<br /><br />\nsleepy reporter, honored it with one<br />\nof his rare daylight appearances. As<br />\nthe beautiful creature gazed toler-<br /><br />\nRepetition Of \"Gymboree\" antly at him, Randolph, perhaps from<br />\nfear, perhaps from jealousy, bared<br />\nPlanned To Solve Sweater his teeth and let loose the bellow<br />\nProblem; New Filing Index that has presaged a thousand combats. At which Mr. Esquire pulled up<br />\nThe \"New Deal\" in Hopkins ath- his striped pants and lifted his<br />\nletics once more showed its hand brawny legs rapidly for Red Schaal's<br />\nlast week with the announcement of office.<br />\nplans for reorganization of the two<br />\nbodies which are the ultimate student arbiters of<br /><br />\nsports policy, the<br /><br />\nAthletic Association and the Varsity<br />\nClub. William Hazlitt, president of<br />\nthe Association, is also studying further alterations in the Constitution,<br />\nas suggested by Omicron Delta Kappa.<br /><br />\nPi D. E. Speaker<br /><br />\nAll Quiet On Levering Front<br />\nAs Smoke OfFrat Battle Clears<br /><br />\nsuede<br /><br />\nshoes, his wide shoulders splitting a<br />\ncrowned by a befeathered Hofberg.<br /><br />\nToHave5-ManBoard<br /><br />\nPrice Five Cents<br /><br />\nHOME WOOD, BALTIMORE, MD., TUESDAY, NOVEMBER 5, 1935<br /><br />\nVol. XL—No. 11<br /><br />\nnci<br />\n'iota<br />\nipu<br />\nletici<br />\nargel<br />\nsot<br />\nI on<br />\nek0<br />\nd in<br /><br />\nKept<br /><br />\nTHINK ABOUT YOUR<br />\nPEACE POLL VOTE<br />\nSEE EDITORIAL,PAGE 2<br /><br />\nAnti-War Meeting<br />\nHeld Last Friday<br />\nLong, Davis, Detzer, Halgren, Rabbi Israel Among<br />\nSpeakers At Gathering<br /><br />\nHope Of Word From Official Sources Dies Away; Fraternity<br />\nMen Turn To Football To Secure Revenge; Phi<br />\nGams Walk Over Campus Unmolested<br />\nAll was quiet over Levering Hall prove a broken reed, as it now apyesterday, and flying mud no longer pears, the curtain will go down forever on one of the most highly drafilled the air, as embattled fraternity<br />\nmatic fraternity melees in recent<br />\nmen stood as one with bated breath<br />\nyears<br />\nawaiting some word from official<br />\nHope for an era of reform and<br />\nsources.<br />\npeace was still high in the hearts of<br />\nBut alas, the word has yet to come<br />\nthose earnest spirits who direct the<br />\n—nor can it be expected for some<br />\naffairs of the Hopkins from the card<br />\nlittle time. Any hope for sensational<br />\ntables at Levering Hall. It seems<br />\npronouncement from this source was<br />\ncertain, moreover, that some attempt<br />\nkilled last Friday when Dean Berry<br />\nwill be made to realize their dream.<br />\nremarked, \"<br />\n- I haven't talked with Mr.<br />\nA thousand schemes for reform have<br />\nWigall for some little time, and am<br />\nalready been put forward.<br />\nnot really conversant with the situSmoke Of Battle Clears<br />\nation.\"<br />\nAs a matter of fact, interfraternal<br />\nFraters Turn To Football<br />\namity, as the smoke of battle dies<br />\nThus the fraters are contenting away, has once more revealed itself.<br />\nthemselves with minor blood-lettings Even the Phi Gams, the sight of<br />\non the touch football field and rest whom less than two weeks ago, was<br />\ntheir hopes on the next Interfrater- an incitement to riot, now walks the<br />\nnity Board meeting. Should this campus unmolested.<br /><br />\nHays,PeacePoll<br />\nWill Be Feature<br />\nNext Assembly<br />\nFamous Criminal Lawyer To<br />\nBe Tapped By Pi D. E.<br />\nAfter Address On \"Peace\"<br /><br />\nBallot To Follow<br />\nUndergraduates To Vote On<br />\nQuestions Involving R. 0.<br />\nT. C. And War Abolition<br />\n—Courtesy News-Post<br /><br />\nARTHUR GARFIELD HAYS<br /><br />\nCommittees Study<br />\nFascism And War<br />\nIn Cause, Effects<br /><br />\nLane, Blumberg Tommy Dorsey To<br />\nDistrict Conference Against<br />\nTo Talk To NSL In Play At Cotillion; War And Fascism Held In<br />\nLevering Today Delevett Announces Levering On Week-End<br /><br />\nLong a militant champion of the<br />\nrights of man and the tireless foe<br />\nof legal and social injustice, Arthur<br />\nGarfield Hays, a familiar figure on<br />\nthe Latrobe platform, will take up<br />\nhis cudgel in the cause of \"Peace\" for<br />\nhis annual assembly address next<br />\nThursday. As the chief guest of its<br />\nprogram, Pi Delta Epsilon, honorary<br />\njournalistic society and sponsor of<br />\nthe assembly, will formally induct<br />\nMr. Hays into its order. Kenneth<br />\nZierler, president of Pi D. E., will introduce the speaker.<br /><br />\nMr. Hays' fondness for live and<br />\ncontroversial issues is well demonThe opening of the Anti-War Constrated by his choice of a problem<br />\nference sponsored by the League<br />\nand<br />\ncaptains<br />\ned every spring by the<br />\nwhich, at the moment, is probably<br />\nAgainst War and Fascism was held<br />\nmore important than any other in<br />\nManagers. In addition to three of- last Friday night<br />\nat the Knights of<br />\nthe minds of Hopkins men. His adficers, the president, vice-president, Pythias Hall. This inaugurated the<br />\ndress is particularly pertinent beand secretary-treasurer, there will be subsequent conferences held Saturday<br />\ncause of the Peace Resolutions poll<br />\nand<br />\nSunday<br />\nat<br />\nLevering<br />\nHall<br />\ntwo members at large. The president<br />\nwhich is to follow it. The ballot will<br />\nThe first speaker was Franklin<br />\nof the Varsity Club is automatically<br />\ntake the form of a series of resoluIn<br />\nNational<br />\npreparation for the<br />\nLong of the Baltimore Youth CounAllen F. Delevett, president of the<br />\ntions to be presented to the assemelected to the Board. Representation<br />\ncil. He stressed the danger to youth Student Mobilization for Peace, the Cotillion Board, announced today<br />\nbled student body. The resolutions, in<br />\nLS limited to three from the major of war and the causes pending ne- National Student League will be ad- that Toriamy Dorsey and his orchesThe dogs of war come in for a se- their essence,. raise the following<br />\nminor.<br />\nfrom<br />\nthe<br />\ntwo<br />\nsports and<br />\ndressed by Dr. Frederic C. Lane, as- tra have definitely been signed to<br />\ncessity of their fighting war.<br />\nvere flaying at the hands of the Dis- points:<br />\nGymboree Planned<br />\nJohn P. Davis, of the National Ne- sociate professor of history, and Dr. play at the annual Cotillion to be<br />\n1—To support, by any means at<br />\ntrict Conference against War and<br />\nThe new Board will continue to gro Congress, was the isext speaker. Albert E. Blumberg, instructor in held in the Alcazar on Thanksgiving<br />\nour disposal, genuine neutrality legFascism, in its sessions in Levering<br />\noccupy itself with the questions of He spoke of negroes in relation to philosophy, at four oclock today in Night.<br />\nislation to prevent entanglement of<br />\nIt had been previously announced Hall over the week-end. From the<br />\nletters, sweaters, and eligibility. It is war and Fascism, and of negro indig- Levering Hall, Room B. The two<br />\nthe United States in war—no loans,<br />\nspeakers will discuss the resolutions that Benny Goodman and his orhoped that a repetition of last year's nation at the rape of Ethiopia.<br />\nkeynote speech of John Franklin, a credits, munitions or secondary war<br />\nto<br />\nbe<br />\nvoted<br />\non<br />\nby<br />\nthe<br />\nstudent<br />\nbody<br />\nknotty<br />\nRabbi<br />\nEdward<br />\nthe<br />\nIsrael<br />\ncalled<br />\nfor<br />\n“Gymboree\" will solve<br />\nchestra would appear on that date,<br />\nmember of the New York branch of materials to belligerents;<br />\nproblem of sweater cost. Plans for unity of the middle and lower class- at this Thursday's assembly. The but it was later discovered that<br />\n2—To work for the demilitization<br />\nthe<br />\nAmerican League Against War<br />\nspeeches<br />\nwill<br />\nbe<br />\nfollowed<br />\nby<br />\nquestions<br />\na definite system of eligibility are es against war<br />\nGoodman had signed a contract for<br />\nof our colleges and schools, especially<br />\nDorothy Detzer of the Women's from the floor, and all students are a long engagement in Chicago that and Fascism, on the \"Causes and<br />\nalso taking form. The Varsity Club<br />\nby assuring the passage of the Nyeis mainly occupied with the cases of International League for Peace and urged to attend and participate in would conflict with the Thanksgiving Prevention of War,\" down to the final<br />\nKvale Bill to make the R. 0. T. C.<br />\nFreedom, told of the weakness of the the discussion.<br />\ndeserving, but needy, students.<br />\ndate.<br />\nreport of the General Commission of optional instead of compulsory;<br />\nAnother innovation is the installa- League of Nations in combatting<br />\nRichard Whitten To Speak<br />\nAlthough Tommy Dorsey has been<br />\n3—To insist on opportunities in the<br />\nthe Conference, the great god Mars<br />\nOn Friday, November 8 at three conducting his own band for a comtion of a new, and more efficient, fil- war. She also exposed the quasi-radand out for relating our<br />\ncurriculum<br />\nsearching<br />\nclinical<br />\ning system in Dr. Schaffer's office. ical persuasions of Fascists by citing p. m. there will be a meeting in Lev- paratively short time, his popularity was the object of<br />\neducation to these crucial problems;<br />\nAll correspondence will in the future the example of Mussolini's change ering Hall which will be addressed has been increasing by leaps and scrutiny. The Levering Hall meeting<br />\n4—To refuse to support the govby Richard Babb Vaiitten, director bounds. He plays once a week on the was preceded by a Peace Rally at<br />\npass through this point. With this from Socialist to Fascist.<br />\nernment of the United States in any<br />\nTo Share Ethiopia<br />\nof Commonwealth College, in Mena, Columbia Broadcasting System, bechange the Athletic Director comes<br />\nwhich Roger Baldwin, of the Civil war it may undertake.<br />\nMauritz<br />\nA. Halgren, of the Balti- Arkansas. Representatives from Gott- sides furnishing the music for the<br />\ncontrol<br />\nof<br />\nH<br />\nopinto almost complete<br />\nThe poll is sponsored by the Y. M.<br />\nLiberties<br />\nUnion, was the chief speakmore Sus, told of how, before the cher College, Morgan College, and French Casino in New York City.<br />\nkins sports.<br />\nC. A., the National Students League,<br />\ncoming of Hitler, he had asked the Baltimore city high schools will also<br />\nThe Dorsey brothers are among the er.<br />\nFour Members Now<br />\nthe American League Against War<br />\nGerman people if they were not attend.,<br />\nbest-known popular musicians in the<br />\nImmediately after the opening of and Fascism, and the NEWS-LETTER.<br />\nIn addition to Hazlett the other<br />\nafraid of Hitler. They had had not<br />\nMr. Whitten is a former member country. For several years their band<br />\nmembers of the A. A. Board are<br />\nproper at 10 a. m., Such sponsorship does not signify, or<br />\nthe slightest fear of his gaining of the varsity debating team of Tu- has been \"tops\" in the East. It was the Conference<br />\nof the resoluGeorge Margolis, captain of basketelected chairman even imply, approval<br />\npower.<br />\nlane University and of the executive a band which also leaned to the Foster Dowell was<br />\ntion, but rather the realization of its<br />\nball; Carl Hartman, a member of the<br />\nRoger Baldwin first talked about committee of the Student League for \"swing\" style. They were first fea- and Samuel Swerdloff, secretary. In importance. The Student Mobilization<br />\ntennis team, and Clarence Weimer,<br />\nhis<br />\nexperiences with the Peoples' Industrial Democracy. At the pres- tured on the American Oil program the address which followed, Mr. for Peace, scheduled for Filday, has<br />\nmanager of lacrosse. Hazlett is capFront in France last summer. \"The ent time he is on the national er- with Ethel Waters a few years ago, Franklin discussed mainly the possi- been moved up one day because of<br />\ntain of swimming and baseball. The<br />\nsituation in Europe is more develop- ecutive committee of the American and from then on their rise was me- bilities of preventing a world conflict. the assembly.<br />\npresident of the Varsity Club has yet<br />\ned than it is over here—Fascism over League Against War and Fascism. teoric.<br />\nThe resolution, involving as it<br />\nto be elected.<br />\nThe key to the situation, he declared,<br />\nthere is not subtle and embryonic; it As a leading member of the Socialist<br />\nhowever, differences<br />\nAugust,<br />\nIn<br />\ndoes,<br />\nsuch highly controversial issues<br />\nreorganization,\"<br />\nthis<br />\n\"Our idea in<br />\nhas become a crude reality.\" \"It has Party, Mr. Whitten was recently in caused a split and each of the boys is to be found in the subsidization of as the R. 0. T. C. and the Oxford<br />\nsaid Hazlett, in discussing his plans,<br />\nbeen already agreed upon that Italy, charge of the projected trip of Nor- now has his own band. For the past industry which follows every declar- Oath,'shuld provide Mr. Hays with<br />\n\"is to make the most compact, effiEngland, and France are to share man Thomas through the realm of few weeks Tommy has been kept ation of war. A general strike would a wide field for discussion. In his<br />\ncient system possible. The A. A.<br />\nEthiopia. The Bank of Ethiopia is a the \"Kingfish\", before the assassina- busy at private dances in the East.<br />\ncripple any military organization. previous assembly addresses to the<br />\nBoard is far too important a thing<br />\nsubsidiary of the Bank of Egypt tion of Senator Long.<br />\nAside from; the bqind itself, Tommy<br />\nassembly and throughout his career,<br />\nnot to be gone over and strengthened<br />\nMore than three hundred and fifty<br />\nwhich in turn is subsidiary to the<br />\nDorsey is known as one of the great\"Red Activities\" Probed<br />\nhe has shown no disposition to dodge<br />\nas often as possible.\"<br />\nBank of England.\"<br />\nThe college which Mr. Whitten est trombone players in the country. persons heard the address.<br />\nthe issue.<br />\nHe told of the Peoples' Front heads was recently under investigaHis five Hopkins speeches reflect<br />\nAt two o'clock the session was redemonstration on Bastille Day, of tion by the State Legislature of Arclearly<br />\nhis long fight for civil liberty<br />\nmeeting<br />\nof<br />\nsumed in the form of the<br />\nthe small Fascist demonstration and kansas for alleged \"radical activiand education against prejudices.<br />\ncommissions to investigate the relathe tremendous one of the Front ties.\" Commonwealth is a labor colThey have covered a scope which intion of Fascism to certain special cludes the Sacco-Vanzetti case, the<br />\nPopulaire, well disciplined and order- lege and has played a leading role<br />\nDr. Oscar Zariski, Associate Pro- groups of humanity. The commissions Russian collectivist system, the probPaul Hinrichs, Hopkins Graduate, ly—\"from that day to this, there has in the organization of share-cropnot been a single public Fascist meet- pers in Arkansas.<br />\nfessor of Mathematics, is returning and their chairmen were: Youth, Rev.<br />\n(Continued on Page 3, Col. 6)<br />\nThose<br />\nPresent<br />\nAmong<br />\nIs<br />\ning in the whole of France. You get<br />\nto the University after a year's leave<br />\nMrs.<br />\nEdHutchison;<br />\nWomen,<br />\nJohn<br />\nDinner<br />\nAt<br />\nthe spirit of the French working<br />\nof absence. During the first part of<br />\nclass when you talk to porter or<br />\nhis leave of absence, Dr. Zariski was ward Lewis; Education and Religion,<br />\nThe Barnstormers Club last Satur- peasant, factory-worker o shopgirl. I<br />\nconnected with the Institute of Ad- Rev. A. W. Gottschall; and Racial<br />\nday evening held a banquet at the saw the members of the United<br />\nvanced Studies at Princeton Univer- Minorities, Edward Lewis. The comStafford Hotel in honor of out-going Front, ranging from Catholic Libersity.<br />\nmittees discussed recent researches<br />\nOther Classes Scheduled To Pick<br />\nco-directors William Banks and als to Communists work in unity and<br />\nDuring the past summer he trav- into the effects of Fascism on their International Lecturer Chooses \"InOfficers During The Coming<br />\nternational Situation In Far<br />\nharmony.<br />\neled in Europe, and for the last six special fields.<br />\nHoward Caplan.<br />\nMonth<br />\nEast\" As Topic<br />\nLeague Not Communistic<br />\nweeks he has been lecturing on AlOn Sunday the results of their<br />\nThis acknowledgement of the apAs for the American League<br />\ngebraic Geometry at Moscow Univer- findings were presented in the forms<br />\nFall politics will come again to the<br />\npreciation of the Barnstormers of the Against<br />\nDr. T. Z. Koo, Oriental lecturer of<br />\nWar and Fascism, he said,<br />\nsity. Dr. Zariski also participated in of resolutions to the General Comnote and Secretary of the World's<br />\nfine work and devotion of the two \"the League must mold the middle Hopkins tomorrow with the an- the Conference of Ontopology held<br />\nmission on Developments Towards<br />\ncoaches in the past was well attend- class outlook, for American work- nounced nominations for Senior Class recently at the Moscow University. War and Fascism under the direction Student Christian Association, will<br />\naddress the University Supper Club<br />\ned. The entire present membershi'p ers think in terms of the middle officers. If necessary there will be<br />\nof Mauritz A. Halgren. The Education<br />\nthis evening in Levering Hall on the<br />\nclass\"<br />\n.<br />\n.<br />\n.<br />\n\"It<br />\nis<br />\nfalse<br />\nthat<br />\nthe<br />\nLeague<br />\nCommittee called for a new fight<br />\nof the Barnstbrmers attended as a<br />\nprimaries tomorrow and finals on<br />\nSituation in the Far<br />\n\"International<br />\nis a Communist organization, only<br />\nagainst the Teachers' Oath Bill and<br />\nbody. Also among those present<br />\nFriday. The Student Council is conEast\" with special reference to our<br />\nthree out of nine members of the<br />\nThe Bdrnstormer Club firmly<br />\nthe abolition of military propaganda<br />\nrecent peace demonstrations. This<br />\nwere such alumni or former Barn- executive board are Communists. ducting the elections. Seniors will be<br />\nbelieves that in \"The Firebrand\" in schools and endorsed the Student<br />\nwill be the second meeting of the<br />\nstormers as Talbot Banks, Warren The chairman, Dr. Ward, is a profes- called upon to choose a president,<br />\nthey have secured the finest play<br />\nMobilization for Peace. All four Supper Club this year.<br />\nColgan and Bert Gordon. Paul Hin- sor at Union Theological Seminary. vice-president, secretary, treasurer,<br />\nthey have ever atterhpted to put<br />\ncommittees presented hearty approvA graduate of St. John's Univeron the boards. There are splendid<br />\nrichs, who was graduated from the Answering the question why we do and sergeant-at-arms.<br />\nal of the coming Third National ConShanghai, China, Dr. Koo was<br />\nsity,<br />\nnot say that we are against war,<br />\nthe<br />\nopportunities for every man at<br />\ngress Against War and Fascism at<br />\nJohns Hopkins University in 1920,<br />\nOn succeeding weeks throughout<br />\nfor nine years an official in the AdFascism, and Communism, Mr. BaldUniversity to take part in the<br />\nCleveland on July 4, 5, 6.<br />\nand has been appointed coach for win, illustrating<br />\nministrative Department of the Chithat fact that the November the lower classmen will<br />\nproduction, from acting, business,<br />\nJust before the adjournment of the nese Railway Service before joining<br />\nthe group for this season, was pres- Communist and Fascist programs are<br />\nand production point of view. I<br />\nchoose their - representatives. PayConference a committee was formed the staff of the National Committee<br />\nent.<br />\ndiametrically opposed, that Commuurge everyone to consider the<br />\nment of class dues for this and preto continue the investigations begun of the Young Men's Christian AssoBarnstormer Club as one of their<br />\nZenas Sears, the president of The nism stands for peace while Fascism<br />\nby the group studies. The committee ciation of China, with special releads inevitably to war, quoted John vious years is required.<br />\nactivities. It is one of the oldest<br />\nBarnstormers, acted as the Master<br />\nis made up of H. H. Shapiro, A. E. sponsibilities for colleges and uniThe absence of Lou Reuling from<br />\nStrachey: \"Communism and Fascism<br />\ncolleges<br />\nof<br />\ndramatic<br />\nclubs<br />\nin<br />\nthe<br />\nOf Ceremonies. Short valedictory<br />\nBlumberg, Mauritz Halgren, Mrs. Ed- versities. In 1925 he was a mempber<br />\nas much alike as two express trains the ballot makes the Senior poll a<br />\nthe country.<br />\nLewis, Gough McDaniels, Rev. of the Second Opium Conference<br />\nSpeeches of thanks were delivered by on parallel tracks going in opposite wide-open one. Vernon Grove is the<br />\nALLEN DELEVETT. ward<br />\nJoseph Novak, Rev. John Hutchison.<br />\n(Continued on Page 3, Col. 2)<br />\npresident of the Junior Class.<br />\nboth Banks and Caplan.<br />\ndirections.\"<br />\nStudent control of sports will be<br />\nbuilt around a five-man board elect-<br /><br />\nResearchesContinue<br /><br />\nWill Discuss Peace Question; Replaces Benny Goodman's<br />\nOpen Forum From Floor<br />\nOrchestra At Thanksgiv- Dr. Blumberg On CommisTo Follow Principal Talks<br />\ning Affair, November 28<br />\nsion Formed To Seek Fascism Effects On Groups<br /><br />\nBarnstormers Hold<br />\nBanquet At Stafford<br /><br />\nDr. Zariski Returns After<br />\nLecturing At Moscow U.<br /><br />\nSenior Elections<br />\nBegin Tomorrow<br /><br />\nSupper Club Will<br />\nHear Koo Tonight<br /><br />\nAN OPEN LETTER<br /><br />\n2<br /><br />\nHOME WOOD, BALTIMORE, MD., NOVEMBER 5, 1935<br /><br />\nMbt Pewslidetter<br />\nFounded 1897<br />\nSubscription per year______.........._42.00<br />\nBy Mall<br />\n$2.50<br /><br />\nQuad Quips<br />\nBy JACK STEIN<br />\nI happened to be looking over the NEWS-LETTER finances the other day, and came upon the startling discovery that it costs over $65 to print one issue of the<br />\nNEWS-LETTER. That figure set me to work. Invoking<br />\ncalculus, algebra, solid and plane geometry, trig, and<br />\nother sundry forms of the mathematical science, I was<br />\nable to learn that it costs over $4.00 every time this<br />\ncolumn is printed. Four crisp bills, plus change, is represented in these weighty words of wisdom.<br />\nDoing a little more figuring I find that every time<br />\nthe paper uses the picture of a professor it costs over<br />\n$.50. (When pictures of students are used it may cost<br />\nmore than ordinary, because they require more space<br />\nin view of their swell heads.) An ordinary headline on<br />\nthe front page alone runs into more than $.60.<br />\nI think it about time the student body awakened<br />\nto the fact that the NEWS-LETTER represents a good<br />\ndeal of cold cash, and instead of tossing your NEWSLETTER in the waste basket, why not refund it at the<br />\nNEWS-LETTER office? Yeah! Why not?<br />\nAt present the paper is running a terrific deficit,<br />\nand the Editor asks that all students who would like<br />\nto see the paper become financially \"on its feet,\" please<br />\ngive slugs, lead nickels, Defend Ethiopia buttons, collar<br />\nbuttons, etc., all of which will be melted into a heap—<br />\nthe silver extracted—and a bright shiny two-bit piece<br />\nmade which will be used to reduce the deficit. Thank<br />\nyou.<br /><br />\nON THE BOOK HORIZON<br /><br />\nREVOLT ON THE CAMPUS, by<br />\nThe recent movement on the end up with \"incipient delirium treJames Wechsler. Covici-Freide. campus which has brought the stu- men, loss of appetite,<br />\nsurfeit of oy$3.00.<br />\ndent face to face' with the realities sters, gout and cirrhosis of the livRemit subscription fees to Treasurer, Student AcWithin recent years, an upsurge of the day has resulted in numerous er\"; and, although he makes<br />\nseveral<br />\ntivities Council, Remsen Hall, Postoffice, Johns Hophas occurred on the American cam- cases of violation of academic free- comments that touch us<br />\nrather deepkins University.<br />\npus that has attracted the attention dom, countless expulsions, vigilante ly, his observations are<br />\nprimarily obof everyone, and no time could be groups in California, censorship of jective. Where he<br />\ndoes express an<br />\nEntered as second-class matter December 3, 1909,<br />\nmore opportune for an evaluation of college publications—instances are opinion, he is<br />\nsympathetic rather<br />\nat the Postoffice in Baltimore, Md., under the Act of<br />\nthis movement than the present. Mr. mentioned in which R. 0. T. C. men than devastating (as<br />\nthe custom<br />\nCongress, November 3, 1879.<br />\nWechsler, the former editor of the led attacks on protesting students goes).<br />\nPublished semi-weekly from October to June, exColumbia Spectator, has undertaken (which will lead one to ask, what<br />\nThe author's observations on our<br />\ncept during examination and college holiday periods<br />\nthe task, in a volume which, for its Robert Morse Lovett has asked in fair state and on our<br />\nstill fairer city<br />\nby undergraduates of the Johns Hopkins University.<br />\nbroa'i and comprehensive view, should the introduction—where is the obe- are of great<br />\ninterest. Baltimore, he<br />\nbe carefully studied by those who dience, discipline, and conduct ex- finds, is a city of<br />\ntransition and of<br />\nare not only interested in, but are pected of officers and gentlemen\" synthesis — a<br />\nsynthesis of old and<br />\nEDITORIAL DEPARTMENT<br />\nparticipating in, the student move- that the advocates of the R. 0. T. C. new, of North and South,<br />\nof the demEditor-in-Chief<br />\nJesse N. Borden<br />\nment against war, as well as by are always using as arguments in ocratic and aristocratic.<br />\nHe is struck<br />\nManaging Editor<br />\nIrving Leberfeld<br />\nthose who still believe in academic favor of that institution). In out- first of all by the<br />\narchtectural mofreedom and the sanctity of the Uni- standing cases Mr. Wechsler dis- tifs of the city.<br />\nWilliam Diamond, Stanley M. Finkel,<br />\nversity.<br />\nAssistant Managing Editors<br />\ncusses the college or university inIn the -Baltimore Trust BuildWe have all been aware of iso- dividually.<br />\ning is the contribution of ManSports Editor<br />\nKenneth Zierler<br />\nlated cases of the violation of acadhattan with its desire to be big<br />\nUpton Sinclair in the Goose Step,<br />\nAssistant Sports Editor<br />\nDavid Caplan<br />\nemic freedom, of censorship on the<br />\nand startling . . . The architecyears back, made the first expose of<br />\nHarold Kropman, Jack Stein, Sidney Green,<br />\ncampus, of anti-semitism, red-baittural contribution of the South is<br />\nthe university, its pretenses to culColumnists<br />\ning, and Fascism, but there are those<br />\nthe<br />\nsupremely beautiful Colonial<br />\nture<br />\nand<br />\nfreedom.<br />\nHe<br />\nconcerned<br />\nEDITORIAL STAFF<br />\namong us who have been at a loss<br />\nstyle of building which finds its<br />\nhimself<br />\nmainly<br />\nwith<br />\nthe<br />\nfaculty,<br />\nand<br />\nBernard Pinck, Sigmund Safier, Max Iskowitz,<br />\nto explain these isolated incidents<br />\nperfection in Homewood.<br />\nbig business domination through the<br />\nNathaniel Finkelstein, Murray Kempton, Wethand to comprehend their meaning<br />\nTheir influences have made Baltitrustees. He did not mention the<br />\n*<br />\n*<br />\n*<br />\nered Barroll. Jr., Isadore Gertman.<br />\nand relationship to other developstudent movement because there was more a city of commerce and of<br />\nKRAMPUS GENERALS<br />\nments throughout the country. Mr.<br />\nnot any—at the time, the student \"Beethoven string quartettes, of oil<br />\nBUSINESS DEPARTMENT<br />\nPresenting the mosta of the besta.<br />\nWechsler has drawn a picture of the<br />\nwas still soundly sleeping \"it off\" refineries and one of the greatest<br />\nBusiness Manager<br />\nDavid H. Levy<br />\nrevolt and reaction as a whole, citHarold Merle Kropman<br />\nin a Greek Letter House, unaware medical schools in the world, of modAdvertising Manager<br />\nRobert Watkins<br />\n. . . yes, his middle name is Merle—no relation to ing numerous examples from pracof the fact that certain professors ern American democracy and of oldCirculation Manager<br />\nBerle . . . for thirteen years Baltimore bred—still a tically every college in the ountry.<br />\nRobert Levi<br />\nwere being dismissed from his uni- world Cavalier culture, of vast wareThe author reviews the aclivities<br />\nhalf-baked loaf . . . spends free time thinking of how<br />\nOffice Manager<br />\nWilliam Kempton_<br />\nversity because of the unorthodox houses and of packs of fox-hounds.<br />\n2 shoe—size 19 headsize. Three on the campus beginning with the<br />\nbusy he is . . . size 31/<br />\nCopy and Flung Manager<br />\nMelville Locker<br />\nIt is the beauty of Homewood<br />\nviews that they held.<br />\nchildren-21 years married—expects to remain single World War. Briefly re-states facts<br />\nwhich throws Mr. Macdonnell literJames<br />\nWechsler<br />\nhas<br />\npicked<br />\nup<br />\nBUSINESS STAFF<br />\n. . . Those are his own statements, so don't look at me well known, but often forgotten—<br />\nwhere The Goose Step left off, has ally into fits of ecstacy; but we find,<br />\nlike that . . . still thinks he has the makings of an how the universities were put on a<br />\nS. Prager, G. Willen, H. Linkoff, W. Erlanger,<br />\ncarried the story further than an nevertheless, that he is also interactor—but is alone in his thoughts . . . favorite pastime war basis, how professors like Royce<br />\nested in the mean and ordinary<br />\nN. Soifer, S. Tinley<br />\nexpose of the trustees, and the role<br />\nis hunting weeds behind Levering Hall with which to of Harvard, \"the meditative protoof big business; he has carried the things in life.<br />\nmake his own pipe mixture .. . religious beliefs—Clark type of the philosophic spirit\", joined<br />\nA Visit To America is, however,<br />\nstory to a point far beyond that conTuesday, November 5, 1935<br />\nGable, Jean Harlow, and Claudette Colbert . . . favorite with the militarists and the profitceived of in Sinclair's day, for in not so serious as this might indicate.<br />\nsubjert is abnormal sikologee (is that spelled write?)-- eers in the war \"to save democracy.\"<br />\nthose days students were not inter- When Mr. Macdonell's friendly wit<br />\nwants to be able to understand his friends. Lucky num- He continues with the post-war peested in learning and culture; i now is brought to bear upon some subber is Berwyn 422 . . . known to his intimate friends riod, into the revolt of the jazz age<br />\nthey are, and now they are forced ject, a hearty laugh is inevitable.<br />\nas Deaf, Dumb, and Blind Kropman . . . to those that —which F. Scott Fitzgerald so well<br />\n,Speaking of Fort McHenry, the<br />\nto defend those very ideals for which<br />\nBecause of their particular importance, two points really know, he's known as just plain Krop . ..<br />\ndepicted. On one hand, the revolt<br />\nwhether or not the British cona<br />\nuniversity<br />\nis<br />\nsupposed<br />\nto<br />\nstand,<br />\nin the anti-war resolution were held for special disagainst all old sex traditions and<br />\n*<br />\n*<br />\n*<br />\ntributed<br />\nto the poetical advanceVictorian propriety; and the mild but which are being stolen from that<br />\ncussion.<br />\nment of the world by providing<br />\nThere are deep, dark sinister plots against the<br />\ninstitution<br />\nby<br />\ntrusteeships<br />\nand<br />\ncauliberal protest that expressed itself,<br />\nan inspiration for the \"StarFirst:<br />\nfreshmen this year in regard to Freshman Regulations.<br />\nwith its illusions and misguided tious, pious, reactionary academiciSpangled Banner\" is a matter of<br />\nIt appears as though in the very near future, this paper<br />\nans, who are careful 'enough to adResolved:<br />\nhopes, in the New Student, and the<br />\nopinion. Certainly it might have<br />\n2 (b) That R. 0. T. C. at the Johns Hopkins Univer- will support the Sophomore class in demanding the en- intellectuals' adherence to Mencken, here to every wish of the trustees<br />\nbeen better for both countries if<br />\nforcement of Freshman Regulations. A hint to the wise<br />\nof big business, and to lend a willon the other. The era in which the<br />\nshould be abolished.<br />\nBaltimore had been captured on<br />\nwould be sufficient, but I guess the Freshman need<br />\ning ear to the words of the D. A. R.<br />\ncampus dis-associated itself from<br />\nthe occasion and humanity thus<br />\nmore than a hint. Forewarned is forearmed.<br />\nTESSIM ZORACH.<br />\nculture and won for itself an asdociWe feel that in a liberal institution opportunities<br />\nspared such lines as \"Their blood<br />\n*<br />\n*<br />\n*<br />\nation with jazz and gin and petting<br />\nhas washed out their foul footfor varied endeavors should be offered. If some people<br />\nThe lexicography department of the \"Quad Quip and a general ignorance of anything A VISIT TO<br />\nAMERICA, by A. G.<br />\nsteps' pollution.\"<br />\nfeel that there is a need for preparedness against ma-' Qwazy Qwiptionary division of this column received<br />\na else going on in the world aside exMacdonnell. The Macillan<br />\nSomewhere on the wharves he saw<br />\nlicious attacks by the Yellow Peril or by the Red letter the other day from a student of philosophy ask- cept for the \"big game\" and the<br />\n1935. 274 pp.<br />\nthe name Piankata.nk.<br />\nMenace, and if they feel that colleges are the place ing how to define the stoicA and cynic. The department morning after the night before. One<br />\nPiankatank! What a name!<br />\nMr. Macdonnell has broken a<br />\npassed his time with jazz, gin, and<br />\nfor that, they should be given every opportunity to give gladly gives the following information:<br />\nPerhaps some damned scholar<br />\nhoary, time-honored tradition. DeStoic—that which brings babies<br />\nwomen until he received a diploma— liberately<br />\ncan prove in a jiffy that it is Inhe has turned against the<br />\ncollege men a chance to take advantage of a course in<br />\nCynic—that in which one washes the dishes.<br />\nafter the diploma a fat-salaried job norm<br />\ndian for Stinking-Bison Gulch.<br />\nof in English conventionality<br />\nmilitary training.<br />\nThis department will be glad to answer all other as a commencement present.<br />\nMr. Macdonnell returned to Engwhich, during the past one hundred<br />\nThe course should be presented with all its ghastly questions of a similar nature without charge.<br />\nWith the depression the student years, has irked Americans—to the land, fatigued by too fast a life, but<br />\n*<br />\n*<br />\nimplications—with no aura of a romantic brass-button*<br />\nawoke. Some overslept, to be sure, advantage of the packet of every content with the knowledge that he<br />\ned uniform — with a true picture of soldiers (once Heard in the Cafeteria:<br />\nand Wechsler points out, with regret, well-known English author.<br />\nhad sampled every type of life that<br />\nworkers and college men) gassed and maimed, of headStude 1—This butter is so strong it could walk over the left-overs of the Age of Jazz,<br />\nThere is an epidemic which Eng- America has to offer.<br />\nless bodies and of limbless trunks, of sightless eyes and and say \"hello\" to your coffee.<br />\nwith its \"syncopated embrace,\" and lish authors seem to contract at a<br />\n'WILLIAM DIAMOND.<br />\nof hacking coughs eternally tearing at lungs and throat,<br />\nStude 2—Yes, and my coffee is too weak to answer. antipathy to the world at large. But certain period in their careers. Inof diseases worse than death and of minds deranged—<br />\n*<br />\n*<br />\n*<br />\nthe fact remains that a vast revolt variably they get the itch to come DEATH AND<br />\nGENERAL PUTNAM,<br />\nonce gullible minds that believed what they were told<br />\nThe letters which appeared in last week's column has occurred on the campus during to America, look around, write a<br />\nAND 101 OTHER POEMS, by<br />\nabout, war while they were workers or college men— were so eagerly received, that upon requst I will print the past few years and it is to an book about what they saw,<br />\nand sell<br />\nArthur Guiterman. E. P. Dutton,<br />\nminds with abnormal desires, or minds that feel pain in another one. This an actual letter written in a serious understanding of this revolt, its con- it to Americans—who have a singu1935.<br />\na leg that isn't there any more. And let them be told mood, without any attempt of humor on the part of the sequences and implications, that lar penchant toward hearing themIf our marking scheme were apthe futility of fighting.<br />\nWechsler directs his attention.<br />\nperson writing it.<br />\nselves lampooned and derided. Al- plied to poetry the present reviewer<br />\nHe has gathered together a vast most invariably the Englishman would give the present volume an<br />\nManila, P. I.<br />\nThen, there is another side to this R. 0. T. C. quesarray of material, but in a fashion thinks up awful things to say about \"S\". And this does not mean that it<br />\nAugust 4, 1929<br />\ntion. Suppose that the R. 0. T. C. doesn't really provide<br />\nthat does not overwhelm the reader Us.<br />\nadequate military training. Suppose you don't learn any S. S. President Wilson<br />\nmerely belongs to that unhappy class<br />\nor discourage him. In fact, the reciMr. Macdonnell is an exception, and of poets who are hateful alike to<br />\nmore in two years of R. 0. T. C. than you could in a Dollar Steamship Lines<br />\ntation of the activities of the stu- he has written an exception. That is, gods and men—the mediocre. Medimonth of study in case of war. Suppose you can be Mydear Mr. Hart:<br />\nMy second wife is pretending to have a baby and so dents throughout the country, in de- he seems to have enjoyed his so- ocre poets fall in the \"F\" groups,<br />\nbetter drilled in the National Guards in two months<br />\nthan you can in two years of R. 0. T. C.? If that is we would like to borrow pesos 10 as there is a large fense of peace, freedom, and culture, journ in the States in spite of the and Mr. Guiterman's place is neither<br />\nfact that English visitors invariably<br />\n(Continued on Page 3, Col. 1)<br />\nthe case—and we present it as a point that has been family. We are 4 adults, and 5 sAultresses, so you can is something to inspire one.<br />\nadvanced—then there can be but one excuse for the see, Mr. Hart, that we need the money bad.<br />\nYour true servant,<br />\ncontinued existence .of the R. 0. T. C. on this—or any—<br />\nEmilio Del M<br />\ncampus.<br /><br />\nR.O.T.C. And War<br /><br />\n*<br /><br />\n*<br /><br />\nJust one. Granting the above, the R. 0. T. C. is<br />\npurely a weapon of indoctrination. Though not preparing men for war, it prepares them for the idea of war—<br />\nit prepares them to accept the bearing of arms against<br />\ntotal strangers as not an irrational practice. It is an<br />\nexpensive piece of propaganda.<br /><br />\nI received this piece of poetry anonymously. After<br />\nreading the poem, I can see that some day, if he develops his taint, he will be listed among America's leading poets. You will notice certain unmistakable signs<br />\nof genius contained here.<br />\nOnce there were three girls<br />\nIf it does not indoctrinate or if it does not train,<br />\nWho didn't know what to do.<br />\nthen there is no reason to keep the R. 0. T. C. in colThey decided to take up Bio,<br />\nleges.<br />\nAnd to learn about something new.<br />\nThe second point:<br />\n4 (a)—That we refuse to support the government<br />\nof the United States in any war in which it may engage.<br />\n(b)—That we refuse to support the government of<br />\nthe United States in any aggressive war it may undertake.<br />\nWe refuse to support the government of the United<br />\nStates in any aggressive war it may undertake.<br />\nFurthermore, with the treacherous development of<br />\nmodern diplomacy—hypocrisy, no distinction can be<br />\nmade between an offensive and a defensive war between powers of equal strength.<br />\nWe will not fight for somebody else.<br />\nWe will fight to preserve principles we have or<br />\nthink we have. If some nation were to invade our country and attempt to impose upon us certain doctrines<br />\nor practices that we hold irrevocably untenable, we<br />\nwould risk our lives against an unlivable condition.<br />\nIf Germany were to land troops on our shores, we<br />\nbelieve that those of us who feel that there would be<br />\nno living under the Nazi system of restrictions should<br />\ngamble our lives. There are those who look upon Fascism (including Naziism) as but a form of capitalism,<br />\nand who feel that there is not enough difference between any two forms of capitalism to excuse a drop<br />\nof spilled blood.<br />\nWe cannot deny the legitimacy of that view.<br /><br />\nFirst they attended the lectures<br />\nAnd then they went to Lab,<br />\nThey learned about the amoeba<br />\nThe Lobster and the Crab.<br />\nAnd then a lecture on sex came along—<br />\nOn how and what to do,<br />\nOut dropped a girl who was very shy<br />\nAnd thus there were only two.<br />\nThe course continued right along<br />\nStudying the forms of life,<br />\nA Bio boy loved a Bio girl,<br />\nAnd soon became man and wife..<br /><br />\nCOME ONE, COME ALL<br />\nST. JOHNS<br />\nFOOTBALL RALLY<br />\n• BIG PARADE DOWN CHARLES STREET<br />\n• BONFIRE<br />\n• TALKS BY THE TEAM MEMBERS<br />\n• TALKS BY THE ATHLETIC COACHES<br />\n• YELLS, SONGS<br /><br />\nNow there is but one in the class<br />\nWhere formerly there were three.<br />\nThat Bio's not a course for girls<br />\nIs very plaffi to see.<br />\nFive years from now I see this girl<br />\nTeaching her Bio classes,<br />\nIt's easy to see her name's still Miss,<br />\n(Sorry, I can't think of a last line.)<br />\n. . . the poet evidently became disgusted at this<br />\npoint, and decided to let the reader concoct his own<br />\nlast verse. He also explains anything that may not be<br />\n\"according to Hoyle\" on the grounds that he possess a<br />\npoet's license ending with -000.<br /><br />\nFRIDAY BEFORE THE<br />\nST. JOHNS GAME 8 P. M.<br /><br />\nFa<br /><br />\niWh<br />\nf<br />\nl<br />\na<br />\nit<br />\ng<br />\nf<br />\nT<br />\nn<br />\ne<br />\nv<br /><br />\ncorn<br /><br />\nPap<br /><br />\nSte<br />\nma<br />\nHa<br />\nthe<br />\nby<br />\ncer<br /><br />\nlam<br />\ndrE<br />\neh],<br /><br />\nthe;<br />\niss.<br /><br />\n7<br />\nod I<br /><br />\nSue<br /><br />\nove<br /><br />\nve<br />\nce<br /><br />\nthe<br /><br />\near<br />\nrea<br />\nWa,<br /><br />\nI<br />\nsee<br />\nind<br />\nPE I<br />\nSul<br />\nof<br />\nel<br />\nstc<br />\nan<br />\nWe<br />\nan<br /><br />\nMt<br /><br />\n1,<br />\n1Ri<br /><br />\nPe.<br /><br />\nSp<br /><br />\nSo:<br /><br />\nCO,<br /><br />\nWI<br /><br />\nth<br /><br />\nev<br /><br />\nof<br />\nI<br /><br />\nat<br /><br />\n3<br /><br />\nHOME WOOD, BALTIMORE, MD., NOVEMBER 5, 1935<br /><br />\nMemorial Fund<br />\nBuys Addison,<br />\nSteele Papers<br /><br />\nA Letter To<br />\nThe Editor<br /><br />\nVIEWS AND REVIEWS<br /><br />\nAbout The<br />\nAlumni Office<br /><br />\nHays,PeacePoll<br />\nWill Be Feature<br />\nNext Assembly<br /><br />\nsary party for an engaging couple<br />\nThe Alumni Office as we know it<br />\nadeptly by Constance CumTonight's performance of the Pet- played<br />\nDear Editor:<br />\nfounded a little less than ten<br />\nwas<br />\nthe<br />\nIn<br />\nYoung.<br />\nRobert<br />\nand<br />\nmings<br />\nI find it hard to restrain myself rified Forest, will mark the local preago. Since then its functions<br />\nyears<br />\nFurColonel<br />\nHenLouise<br />\non<br />\nEilers,<br />\nSally<br />\ncommenting<br />\nare<br />\ngroup<br />\nfrom<br />\nmiere of the show at the Maryland<br />\nlong's talk on \"Ethiopia.\" Let me Theatre, and will star Kenneth Mc- ry, George Meeker, Monroe Owsley have been many. There is in the offirst say, that I thought the slides Kenna. Pour of the members of the and Reginald Denny, who carry their fice a complex system of files, in<br />\nwhich are kept records of the names<br />\nof his water-colors were very fine, original Broadway cast that supportroles as slightly inebriated society and addresses of all Hopkins graduand I was delighted to find him ed Leslie Howard have been engaged<br />\nshowing real appreciation for the by Mr. Moore for this production-- folk excellently. Rounds of drinks, ates since the system was started,<br />\nantelope. \"I call this one the Queen Esther Leeming, Milo Boulton, James rounds of estates, and a roadside inn there being something like 13,000<br />\nof Antelopes.\" The antelope has been Doody and Ross Hertz. The other end in oblivion for all. The next morn- graduates in all the schools of the<br />\n(Continued from Page 1, Col. 6)<br />\ntoo long relegated to limbo, and I roles will be played by permanent ing, it is found that one of the group University in' that period. Every day<br />\nThe trustees of the Gordon Huntvarious papers are read through and lem of success, German Naziism,<br />\nappreciate the Colonel's effort to put members of the Cape Playhouse<br />\nhas been murdered.<br />\nington Harper Memorial Fund of her once more before the public. He<br />\nall mention of Hopkins graduates is and, last year, intolerance in the<br />\ngroup: Forrest Orr, Flora Campbell,<br />\nTo give any of the plot away at clipped out and retained for future United States.<br />\nWhich Dr. H. D. Havens is chairman, also showed us a splendid picture of Ernest Decker, Dorothy Blackburn,<br />\nhave announced the purchase of a a lion, \"it is no wonder that Haille Philip HUston and Dudley Hawley. this time would be unfair to those reference. These records include as<br />\nStrong convictions have Marked<br />\ncalls himself The Lion of<br />\nwho are eager to see the beautifully aforementioned, those of all other<br />\nBurk Symon will direct.<br />\ncomplete collection of The Spectator Selassie<br />\nhis career since the day he was jailed<br />\nmounted production. However, a sin- schools of the University, none of<br />\nJudah.\" Yes, I thought so, too.<br />\nof The Petrified Forest,<br />\nsucces<br />\nThe<br />\nPapers, published by Addison and<br />\nister hypnotist, Gustav von Seyffer- which have such an extensive sys- in a Pennsylvania mining town for<br />\nConsidering that the Colonel is a<br />\nan enterSteele. The collection, now in the member of the Intelligence Service it is said, was the result of<br />\nhis assertion of the right of free<br />\nArnold, playing an ace tem.<br />\nprob- titz, Edward<br />\nMain room of the library in Gilman of the TT. S. Army, I was not sur- taining discussion of serious<br />\nlaughhis<br />\nBrophy,<br />\nEdward<br />\ngradudetective;<br />\nRecords of the University's<br />\nspeech. Perhaps his greatest fame<br />\nmelodrama,<br />\nHall, contains the various issues on prised or even grieved to find him lems. It is a vigorous<br />\nGregory Ratoff, as ates have been kept year by year was achieved in 1925, when he served<br />\nassistant;<br />\nable<br />\nthe original paper as they were read working in an argument for bigger with an absorbing story that pro- the roadhouse proprietor; Robert since 1874, there being a case full of<br />\nas one of the defense attorneys in the<br />\nvokes thought. The scene is a remote<br />\nby the elite of the early eighteenth<br />\nArmstrong and Jack LaRue, as chau- these old books continuing right Scopes evolution trial. He took his<br />\nand better war preparations. The<br />\nthe<br />\ndesert;<br />\nArizona<br />\nthe<br />\nof<br />\ncentury. There are five hundred and delicacy with which the military are section<br />\nffeurs; Arthur Treacher, as a cold through 1927-1928. However, the-old- law degree from Columbia in 1905.<br />\nwhole of society<br />\nfifty-four issues, all well preserved, able to make none-too-subtle propa- _ale implies that the<br />\nand forbidding butler, and other char- er records are not very comprehenEven a Hays address does not ovbound in book form. The five hun- ganda sound like cold logic has al- is figuratively a petrified forest.<br />\nacters serve to make the plot move sive.<br />\nthe importance of the<br />\nershadow<br />\nbrings<br />\nperformance<br />\nThe Maryland<br />\ndred and fifty-fifth issue was not in- ways been a great source of admirafaster, the dialog to become more<br />\nAnother important activity of the peace poll. Coming at a time of included for some reason, forgotten tion to me. He began by saying, \"Stu- Mr. McKenna back to Baltimore for brilliant, and the clues and deducAlumni Association is the production creasing tension, it will provide an<br />\nthese two centuries since it was last pid thing, this business of war, BUT, the first time as a stage star since tions which lead to the apprehension<br />\nthe Johns Hopkins Alumni Maga- insight of the opinion of the men<br />\nof<br />\n20 weeks with tie of the killer to be revealed.<br />\nissued.<br />\nnational defense, and by that I mean he played for<br />\nzine, which is reaching at present who will fight the next world war.<br />\nAudithe<br />\nat<br />\nPublished In 1711<br />\ngood national defense . . . is the Knopf Stock Company<br />\napproximately 1,500 Hopkins gradu- For this reason, the poll has been<br />\ntorium in 1i (-28 during which he<br />\nates. The book, of which there are given considerable discussion in the<br />\nThe Spectator was an English peri- best measure of keeping peace. AnyFORD'S<br />\nCardHer<br />\nappeared in such plays as<br />\nfour copies per year, is edited by Dr. NEWS-LETTER with the object of creodical, published in London and is- one who does not insist on good naBig Pond, and ft ne<br />\nboard Lover,<br />\nTickets are now on sale at the box Roulston of the German department.<br />\nsued daily. The circulation was well tional defense is a . . .\" and here I<br />\nating a definite student opinion. Nalater went to Hol- office of Ford's Theatre for the Eva<br />\nHe<br />\nRome.<br />\nto<br />\nRoad<br />\nColonel<br />\nthe<br />\nwhat<br />\nover ten thousand daily, which was forget just exactly<br />\ntionally the Student Mobilization for<br />\novalmost<br />\nstar<br />\na<br />\nbecame<br />\nand<br />\nlywood<br />\nLe Gallienne engagement which<br />\nvery good for the early eighteenth did say, perhaps, \"is a baby or a<br />\nThe Maine Intercollegiate Athletic Peace is sponsored by the Committee<br />\nTrouble,<br />\nMan<br />\nin<br />\nacted<br />\nhe<br />\nernight;<br />\nreiterhim<br />\nThursday.<br />\nopens next<br />\ncentury. The first issue appeared on sissy.\" I was glad to hear<br />\nAssociation has decided to set a rate on Militarism in Education, AmeriDorothy Mackail; Sin Takes a<br />\nthe streets March 1, 1711. The last ating that familiar gag which is so with<br />\nThe LeGallienne engagement is for of 55 cents on visiting student tickets can League Against War and FasHoliday, with Constance Bennett, and<br />\nthree days only, opening November at football games.<br />\ncame out on December 6, 1712. The dear to the heart of any army man<br />\ncism, Student League for Industrial<br />\nMen , nout Women, to mention a<br />\nam<br />\n\"I<br />\nthis,<br />\nlike<br />\nsomething<br />\nruns<br />\n—it<br />\n7 and ending after the Saturday night<br />\nreason it was forced out of business<br />\n*<br />\n*<br />\n*<br />\nDemocracy, Y. M. C. A., National<br />\nthat<br />\ncinemas<br />\nmany<br />\ndirected<br />\nand<br />\nfew,<br />\nknow<br />\nwho<br />\na pacifist, only those of us<br />\nWas the newly passed Stamp Act.<br />\nperformance, November 9.<br />\nLeague, Y. W. C. A., NaStudent<br />\nappeared<br />\nRobert<br />\nhas<br />\nhe<br />\nseason<br />\nCollege<br />\nHaverford<br />\n(ready: Army scored hits. This<br />\nIn perusing the collection one may what war really is<br />\nThe plays to be presented during Louis Stevenson's geometry note- tional Student Federation of AmeriCoopGladys'<br />\nwith<br />\nsuccess<br />\nmuch<br />\nwith<br />\nsee these stamps in the corner of the men) can be true pacifists.\"<br />\nas Iago and the brief stay are Camile, Rosmer- book and Maxfield Parrish's chemis- ca, Student Federation, and .IntercolInasmuch as the present adminis- er and Philip Merifale<br />\nindividual sheets. The aim of the<br />\nlegiate Council.<br />\nin<br />\ntello and sholm, The Women Have Their Way, try notebook.<br />\nrespectiyely,<br />\nMacduff,<br />\nthe largest<br />\nPaper was to discuss non-political tration is forwarding<br />\nhe played the and A Sunny Morning.<br />\nyear<br />\nLast<br />\nMacbeth.<br />\nhistory,<br />\nour<br />\nall<br />\nin<br />\nbudget<br />\npeace time<br />\nsubjects and \"bring philosophy out<br />\nCamille will be presented at one<br />\ncentral role in George Kaugman's<br />\nOf the closet and schools to dwell in I do think that the Colonel might be<br />\nBy Your performance only, Saturday matinee,<br />\nAlong,<br />\nRoll<br />\nWe<br />\nMerrily<br />\ngratitude.<br />\nof<br />\nlack<br />\naccused of some<br />\nclubs and at coffee-house tables.\" It<br />\nand Accent November 9.<br />\nDuring all this, it was quite evi- Leave, Wife Insurance,<br />\nStood for reason and moderation in<br />\nhe played<br />\nLeave<br />\nYour<br />\nRosmersholm is to be played for<br />\nBy<br />\nin<br />\nYouth<br />\non<br />\nfailgross<br />\nthe<br />\nin spite of<br />\nEighty percent of Skidmore girls Law School, was once blacklisted by<br />\nan age of party strife. The frame- dent that<br />\nmake the world opposite Dorothy Gish, who at that two performances, Friday and Saturto<br />\n\"war<br />\nthe<br />\nof<br />\nure<br />\nWork of The Spectator is supplied by<br />\nsay<br />\nthat they have never been kissed the Daughters of the American Revday evenings, November 8 and 9.<br />\ndemocracy,\" Colonel Fur- time was his wife.<br />\nolution.<br />\nan imaginary club grouped around safe for<br />\nby<br />\nboys.<br />\nThe Women Have Their Way and<br />\nHe is a brother of Jo Mielziner,<br />\n* * *<br />\nlong would still adhere to such<br />\n* * *<br />\nMr. Spectator.<br />\na myth. He would go to war with one of the best-known stage desig- a Sunny Morning are both played in<br />\nat the University of<br />\nprofessor<br />\nA<br />\nSeveral frat men at Stanford were<br />\nThe role of Mr. Spectator was<br />\nthe full realization that he was fight- ers of this country, who assisted in one evening as a double bill and this<br />\ngah a difficult<br />\nrecently<br />\nCalifornia<br />\npranks. Among other things,<br />\ntaken by both Joseph Addison and<br />\nthe decorations of the cinema thea- performance will be given once only, playing<br />\ning to save his country.<br />\nassignment to his class. One of the<br />\nthe<br />\nlooking<br />\nof<br />\nrealistic<br />\npublishers<br />\nvery<br />\na<br />\nthe<br />\nplaced<br />\nSteele,<br />\nthey<br />\nRichard<br />\nThat a military man is able to tre at Mr. Moore's dramatic head- on the opening night of the engagestudents, disgusted, said, \"Who indummy on the road, hoping to have<br />\nPeriodical, in turn, whenever one of believe he is actually fighting for quarters on Cape Cod at Dennis He ment, Thursday next.<br />\nvented work, anyway?\"<br />\nwould<br />\nwho<br />\nperson<br />\nthe<br />\nwith<br />\nfun<br />\nthem was to write an article. Mr.<br />\nsome<br />\nhis country, must give much com- is the son of the late Leo sMielziner,<br />\nDuring her engagement at Ford's<br />\n\"You should worry,\" the Prof. rerun over it. But there was no fun.<br />\nSpectator was a learned, serious per- fort to those controlling interests famous portrait painter, but as his<br />\nTheatre which begins November 7th,<br />\nplied, \"you Will never infringe on<br />\nMrs.<br />\nby<br />\nvivisected<br />\nwas<br />\nof<br />\ndummy<br />\nfrequenter<br />\nThe<br />\nson who was a constant<br />\nwho are unromantic enough to regard mother's name was McKenna, he Eva Le Gallienne will give two perhis patent.\"<br />\nHerbert Hoover and the boys just<br />\ncoffee-houses. In this way he \"had<br />\n* * *<br />\nwar as simply a good business prop- chose it for stage purposes.<br />\nformances of Henrik Ibsen's Rosmer\"tell<br />\nbeat it.<br />\nhis ear to the ground\" and could<br />\nosition. If one told this to the Colonel,<br />\nFraternities at the University of<br />\nsholm. This will be the first time that<br />\n*<br />\n*<br />\n*<br />\nWhich way the wind was blowing.\"<br />\nI'm sure he would just blink at you<br />\nRosmersholm has been seen here<br />\nUtah debated on the subject: \"ReThe Boston Herald has gathered<br />\nNEW<br />\nDr. John C. French, the Johns in a rather bovine fashion, and then,<br />\nsolved, that the shiny nose is preferwithin the memory of present-day<br />\nthe following answers from school<br />\nHopkins librarian, has stated that on finding himself, he would say, as<br />\nable to a hole of the stocking.\"<br />\nThe magic of great song is the theatre-goers.<br />\npapers:<br />\nthe collection will be kept lockefl at he said last Thursday, \"I regard wars,<br />\n*<br />\n*<br />\n*<br />\nLe<br />\nMiss<br />\nprincipal attraction at the New Thefollowing<br />\nImmediately<br />\nBenjamin Franklin's father was a<br />\nall times as it was so valuable. How- not as an economic measure, but, as<br />\nprofespsychology<br />\ncura<br />\nby<br />\nA survey<br />\natre, where Lawrence Tibbett is<br />\nGallienne, Mme. Nazimova, celebrat- tallow chandelier.<br />\never, it will be available for the use a moral one,\" and then go on to adsor at Temple showed that one of<br />\nrently starring in 20th Century's ed Theatre Guild star, will appear at<br />\nThe ancient Greeks planted coloOf students. Dr. French plans to dis- vocate anylising, \"one's spiritual<br />\nthe major fears of the men students<br />\nMetropolitan, the bright and :harm- Ford's as Mrs. Alving in Ibsen's<br />\nfor their food supply.<br />\nnists<br />\nin<br />\ncase<br />\nglass<br />\na<br />\nin<br />\nPlay the collection<br />\nself, and the spiritual objective.\" The ing romance of a young singer.<br />\nwas getting a taller girl on a blind<br />\nbeGhosts, for four performances,<br />\nThe heart is located on the west<br />\nGilman Hall. The exact date will be fact that Haille Selassie, \"dropped to<br />\ndate.<br />\nand<br />\n11th.<br />\nvigor<br />\nNovember<br />\nginning<br />\nsympathy,<br />\nwith<br />\nPictured<br />\nside of the body.<br />\n* * *<br />\nannounced in the NEWS-LETTER.<br />\nhis knees and prayed to his God for an abundance of sparkling comedy,<br />\nMme. Nazimova first made her<br />\nwas once put<br />\nRaleigh<br />\nWalter<br />\nSir<br />\nto<br />\nseemed,<br />\ntake,\"<br />\nto<br />\n\"Who was Talleyrand?\"<br />\nthe right road<br />\nMetropolitan traces Tibbett's career reputation in this country as an in- out when a servant found him with<br />\n\"She was a fan dancer, and cut out<br />\nthe Colonel, to give him an edge on as a young singer who can brook no<br />\nan<br />\nin<br />\nit<br />\nwas<br />\nand<br />\nIbsen<br />\nof<br />\nterpreter<br />\na fire in his head.<br />\nthat baby talk.\"<br />\nMussolini, who has not yet indicated delay, launches out on the world on<br />\nIbsen drama that .Eva Le Gallienne<br />\nThe Romans were too thickly pop—Ohio State Lantern.<br />\nany signs of praying. The Colonel<br />\nhis own.<br />\nforth as an actress-mana- ulated to be very. comfortable.<br />\nbranched<br />\n* * *<br />\nbe<br />\nwould<br />\n\"wondered\" if the situation<br />\n* * *<br />\nHis trail crosses that of Virginia ger.<br />\nA professor at the University of<br />\nthe same if Mussolini had been<br />\nTime has added greatly to the lusBruce, and there is affection between<br />\nThe average frosh at Harvard this Washington, when asked why he was<br />\nthoughtful enough to secure a tete(Continued from Page 2, Col. 6)<br />\nAlice<br />\nBut<br />\nbecause<br />\nand importance of Ibsen. His plays year is named John, comes from<br />\nimmediately.<br />\ntre<br />\nthem<br />\nloafing outside during the class pea-tete with his God before embarkWith these nor with the Honor men.<br />\nBrady, who controls the money in are as vital and interesting today as Pennsylvania, prepared at Mercers- riod, replied that he was giving his<br />\ning for Ethiopia.<br />\nThe author's verses, often appeartheir operatic company, is jealously when first written, and he has gone burg, is the son of a college grad- class a final examination. When<br />\nI should also like to ask the Col- fond of him, they must conceal their down in history as a great dramatist, uate, and has a middle name.<br />\ning in contemporary magazines, are<br />\nasked whether he was not afraid the<br />\nthe so-called \"adequate fa* * *<br />\na great reformer and a great man.<br />\nusually humorous in nature. The onel if<br />\naffection.<br />\nstudents would crib, he answered<br />\ndefense\" have<br />\nnational<br />\nof<br />\ncilities<br />\nThe opportunity to see two plays<br />\nPresent collection contains some huProfessor Kipp, of the law faculty that he had fooled them, and turned<br />\ntBut ingenuity and courage solves<br />\nbrought with them anything apof modern play- of Bonn University, Germany, was in the grades the day before.<br />\nforemost<br />\nthe<br />\nby<br />\nMorous specimens, but mdre are fan- ever<br />\npeace? \"Yes,\" I can hear the problem, and the climax presents<br />\n* * *<br />\nciful or tender in quality. A number proaching<br />\nwrights, in such close juxtatposition, forced to resign because his maid<br />\nsay, \"but we've never Tibbett as the hero of the evening,<br />\nColonel<br />\nthe<br />\nnaand<br />\nair<br />\nof the most cele- patronized a Jewish butcher.<br />\ntwo<br />\nby<br />\ninterpreted<br />\ntreat of life in the open<br />\nat Vassar has been<br />\nskunk<br />\npet<br />\nThe<br />\nfacilities of national wildly applauded after his sensation* * *<br />\nbrated actresses of the day is an imture. The reader, looking for cere- had adequate<br />\nexchanged for a black cat.<br />\ndebut.<br />\nal<br />\n*<br />\n*<br />\nportant and unique event and one of<br />\nbral, bitter, and ironic stuff must defense.\"<br />\nFor the first time in the history of<br />\nMAUS V. DARLING.<br />\nIn the course of the action, Tibbett which Baltimore theatre-goers and<br />\ncontinue his search, but for one who<br />\nPrinceton, more freshmen turned out<br />\nprofessor at Westphilosophy<br />\nA<br />\nsings selections from Pagliacci, Car- particularly students should take adlikes simpler subjects in more mufor the rowing crew than for foot- wood was expounding at length on<br />\nmen and The Barber of Seville, as vantage.<br />\nsical measure here is something<br />\nball.<br />\nthe popular belief that \"time heals<br />\nwell as a number of popular compoWorth while. Thus the title poem tells<br />\nThe Dickinsonian tells what's what all things.\" At the close of the lecsitions.<br />\nthe eternal story of a brave man<br />\nin a college education:<br />\nture, he asked if there were any quesWAVERLY<br />\nExams Periods of Unusual eye- tions. Came a voice from the rear<br />\nMeeting death bravely. I don't know<br />\nthe<br />\nwas<br />\ncamera<br />\nfor<br />\na<br />\nA windshield<br />\nKEITH'S<br />\n(Continued from Page 1, Col. 6)<br />\nstrain.<br />\nWhether General Putnam has (like<br />\nof the room, \"How about a leaky<br />\nunusual device resorted to by studio<br />\nmost of our national heroes, ever called in Switzerland by the League<br />\nRe-exam—A second chance to see radiator?\"<br />\nBright in dialog, flashing in set- technicians to permit an actor to<br />\n* * *<br />\nbeen debunked). At any rate the old- of Nations.<br />\nbetter.<br />\ntings and with an absolutely new idea throw a box of snuff at the lens.<br />\ner estimate is here stirringly, if<br />\nDr. Koo's more recent years have as a mystery plot, Remember Last<br />\nat the University<br />\nmajor<br />\ndrum<br />\nhour.<br />\nThe<br />\nber<br />\nLecture—Slum<br />\nThis was the odd expedient embeen spent, first as Associate Gen- Night?, which opened at Keith's TheGame played by pro- of Minnesota does not practice with<br />\nsimply, sung.<br />\nProctoring—<br />\nployed in The Bishop Misbehaves,<br />\nPoems which best pleased the re- eral Secretary of the China National atre last Thursday, is based on the Metro - Goldwyn - Mayer's whimsical fessors and students during exams, the band, but each Saturday morning<br />\nviewer were \"Lament for the Alamo,\" Committee of the Y. M. C. A., and best-selling novel of the same title comedy-mystery, coming Tuesday to similar to children's games, \"I spy he studies diagrams and must know<br />\n\"When Falstaff Met the Wife of later after resignation from this po- by Adam Hobhouse, and produced as the Waverly Theatre. In the amusing you.\" Very annoying to those partic- exactly where to be in relation to the<br />\nmarkers and when to be there in reipating in the exams.<br />\nIlath,\" \"Education,\" and \"Blessings sition he has given most of his time one of Universal's outstanding prostory of the bishop who turns detecOh Little Boys.\" But the titles of to work among students both in ductions of the season, was directed<br />\nRoscoe Pound, dean of the Harvard lation to the music.<br />\ntive, Edmund Gwenn, plaNIng the<br />\nPoems are only the names of dishes China and in foreign countries such by James Whale. Whale outdid him- mystery-solving bishop, had to halt<br />\nFor<br />\nand<br />\nEurope.<br />\nOn a bill of fare. Here is an example as India, Australia,<br />\nself, for he injected almost as many four crooks by throwing snuff in<br />\nOf the author's rhymes from \"This the fourth time he comes to North laughs into the screen play as there<br />\ntheir faces. In the closeup it had to<br />\nAmerica.<br />\nia She\":<br />\nwere exciting moments.<br />\nbe directed at the camera. A piece of<br />\nA. Schaal, loE.<br />\nto<br />\nDr.<br />\nAccording<br />\n\"Then, having a moment to spare,<br />\nscreen tale opens with the so- plate glass was used to keep it out<br />\n'The<br />\ncal Y. M. C. A. secretary, Dr. Koo<br />\nWe turn our attention to hair;<br />\ncially prominent \"fast set\" of Long of the delicatd lenses and mechanism.<br />\nwill be asked to speak on ways of<br />\ntive,<br />\ntendrilly-curla<br />\nHer<br />\ngiving a progressive anniverIsland<br />\n—J. S.<br />\npreserving peace in these times, with<br />\nTumbly and whirlative,<br />\nEuHere is a Katz Topcoat tailored especially for the wellin<br />\nimminent<br />\nthe uireat of war<br />\nSuper-superlative<br />\n1<br />\ndressed college man. It has quality—it has style—a Topcoat<br />\nrope and in the Orient.<br />\n_mproved Indicator<br />\nhair.\"<br />\nthat promises to be a campus favorite.<br />\nAt the University Lecture Series<br />\nAnd this is from \"Education\":<br />\nheld at 8 p. m. this evening at the<br />\n\"Theology, languages, medicine,<br />\nFirst Methodist Episcopal Church<br />\nlaw,<br />\n$25<br />\nAre peacock feathers to deck the Dr. Koo has chosen as his topic \"Avethe<br />\nof<br />\nGod.\"<br />\nReality<br />\nto<br />\nunes<br />\n$4.50<br />\nCorduroy Slacks for Campus Wear<br />\ndaw<br />\nA.<br />\nMARYLAND<br /><br />\nFamous Criminal Lawyer To<br />\nBe Tapped by Pi D. E.<br />\nAfter Address On \"Peace\"<br /><br />\nFamous \"Spectator\" Papers<br />\nOf 18th Century Now In<br />\nThe Hopkins Library<br /><br />\nINTERCOLLEGIATES<br /><br />\nON THE BOOK<br />\nHORIZON<br /><br />\nSupper Club Will<br />\nHear Koo Tonight<br /><br />\nThe Fashion for College MenTheWrap-Around Topcoat<br /><br />\nK &amp; E ,roctiaRvikliCellge<br /><br />\n,<br /><br />\n..<br /><br />\nSLIDE RULES<br />\nMADI 114 U. S.<br /><br />\nIf the boys who come from yOur<br />\nsplendid schools<br />\nAre well-trained sharpers or flippant fools.\"<br />\nX think those four lines almost deserve an \"H.\"<br />\nL. WARDLAW MILES.<br /><br />\nPEABODY<br />\nPHARMACY<br />\nCALVERT and BOTH STREETS<br />\nWe Sell Drugs and Give Service<br /><br />\nBack of Every Achievement of<br />\nModern Engineering<br /><br />\nKATZ CLOTHES<br /><br />\nKEUFFEL &amp; ESSER CO.<br />\nN. J.<br /><br />\n211 - 213 E. Baltimore Street<br /><br />\nCHICAGO ST.LOUIS SAN FRANCISCO MONTREAL.<br />\nAmerica's Foremost Manufacturer of Drawing Materials,<br />\nSurveying Instruments and Measuring Tapes<br /><br />\nMoving Soon to 7 &amp; 9 E. Baltimore, at Charles<br /><br />\nNEW YORK<br /><br />\nHOBOKEN,<br /><br />\n4<br /><br />\nHOME WOOD, BALTIMORE, MD., NOVEMBER 5, 1935<br /><br />\nHopkins Beaten<br />\nBy Powerful Mt.<br />\nSt. Mary's Outfit<br /><br />\nSportlight<br /><br />\nBlue-Jay Harriers Defeated By<br />\nSwarthmore In Close Encounter<br /><br />\nState Scores<br /><br />\nE Overwhelmed By<br />\nF In Dorm Combat<br /><br />\nED LOTZ<br />\nBorn in Ellicott City. (Yes, the<br />\ntown has a horse) . . . Learned his<br />\nMt. St. Mary's, 47; Hopkins, 0<br />\nfootball playing with his brothers on Sholtes And Emmert Again Tie For First Place But<br />\nSuClose 17-13 Baseball Game<br />\nhills near Ellicott City . . . Attended<br />\nHampden-Sydney, 27; St. John's,<br />\nperior<br />\nBalance<br />\nOf<br />\nVisiting<br />\nSwarthm<br />\nore<br />\nTeam<br />\nlocal schools . . . Entered St. John's<br />\nCulminates Week's Pro14<br />\n. . Rather odd—at high school he<br />\nNets Them Victory<br />\ngram;Lo<br />\nL tz<br />\ntz Shines For<br />\nPrinceton, 26; Navy, 0<br />\nJays Defeated By 47 To 0 In played basketball, soccer, and base- For the second consecutive time, front<br />\npositions to end up on the light<br />\nball; while at the Annapolis instituLopsided Game; Teams tion he engaged in football, lacrosse, the Blue Jay cross-country team lost end of the score. However, there is Western Maryland, 24; Baltimore, \"F\" entry met its rival of old, \"E\"<br />\nentry, in a game of indoor baseball<br />\nAre Unevenly Matched and boxing . . . Couldn't make the last Saturday by the close score of plenty of good material in the squad<br />\no.<br />\nlast Sunday morning. This contest,<br />\n27-28.<br />\nAlthough<br />\nCaptain<br />\nEmmert<br />\nand to be worked on,<br />\nJohnnies' basketball team; and so<br />\nthe culmination of a long and bitter<br />\nand it is hoped that<br />\nMaryland, 14; Virginia, 7.<br />\nturned to boxing. . . Was undefeated Cart Sholtes, both of Hopkins, again the other men will increase their<br />\nseries of altercations as to relative<br />\ntied<br />\nfor<br />\nfirst,<br />\nthe<br />\nstrong<br />\nSwarthmore speed<br />\nin three years of boxing competition<br />\nsufficiently to balance off the<br />\nabilities, clearly showed the far suSusquehanna, 13; Washington, 6.<br />\n. . . Unanimous choice for All-Mary- group placed in enough of the other squad.<br />\nperiority and skilled achievement of<br />\npositions<br />\ngain<br />\nto<br />\nvictory<br />\nfor them.<br />\nland football . . . All-American lathe<br />\nvictors. \"F\" entry emerged vicThe<br />\norder<br />\nin<br />\nwhich<br />\nthe<br />\nTeam Goes Down Fighting; crosse<br />\nrunners<br />\nfinA few minutes after the first quar(and all-universe parchesi)<br />\ntoriously, 17-13.<br />\nished was as follows:<br />\nBasketba<br />\nll<br />\nPractice<br />\nJays Not In The Least Bit ... Considers making All-Maryland ter of the football game between Tie for first place—Captain Leonard<br />\nAmong the athletes who competed<br />\ngreater achievement than Hopkins and Mt. St. Mary's had befor the glory of \"F\" entry was Ed<br />\nWith<br />\nthe<br />\nDiscouraged At Outcome football<br />\nidea<br />\nin<br />\nmind<br />\nthat<br />\nEmmert<br />\n\"pracand<br />\nCarl<br />\nSholtes<br />\nof the<br />\nAll-American lacrosse . . . \"Hit the gun, the harriers of both squads<br />\nHopkins. Time-22:39.<br />\ntice makes perfect\", the Hopkins Lotz, who is in charge of the dormibooks\" just like he hit the line. And made their appearance. The track<br />\ntory athletics. By dint of his fine<br />\nBy LEONARD RUBINGER<br />\nbasketball aspirants went through a<br />\nwhat gains! A.B. from St. John's; was cleared, and after a few minutes 3. Loeb, Swarthmore.<br />\nplaying,<br />\nand encouraging presence,<br />\nA vastly superior Emmitsburg<br />\ngood workout yesterday under the his team was able to nose out its<br />\nM.E. from Hopkins and next year it'll of warming up by means of trotting 4. Cadwalader, Swarthmore.<br />\nold<br />\n5. Bose, Swarthmore.<br />\nsquad took our own g-ridmen into be \"Doc\" . . Was the sports<br />\neditor and calisthenics, the signal for the<br />\nguidance of Captain George Margo- rival. Assisting Lotz were Lewis, of<br />\n6.<br />\nHendley,<br />\nSwarthmore.<br />\ncamp Saturday by the overwhelming of St. John's Collegian . . . President start was given. Immediately Carl<br />\nlis. The newcomers, along with a few the Biology Department, Haushe,1<br />\nSholtes took the lead with a swift, 7 G. Brown, Hopkins.<br />\nscore of 47-0.<br />\nThe Jay team was of S. P. E. chapter for two years . . .<br />\nvarsity men from last season, went Miller, Krell, and Romanofsky froml<br />\n8.<br />\nLyman,<br />\neven stride. Captain Emmert soon<br />\nHopkins.<br />\n\"B\" entry, who donated his services<br />\nhopelessly outclassed from the start But say, Ed, who is that women I<br />\nthrough a passing drill and finished<br />\nalways see you with—no scandal, caught up to him, and the two held 9. Meader, Swarthmore.<br />\nfreely for the contest, being the first,<br />\nby a heavier, faster, more experienc10.<br />\nMoxley, Hopkins.<br />\nthe practice session with a brief ringer to actually aid his outfit<br />\nWinchell—it's Mrs. Vanneman, lead- their lead throughout, showing a fine<br />\nand<br />\n11. Warnecke, Hopkins.<br />\ned squad of Saints, which only a week ing lady at the Dorms<br />\n. . . Raise your cross-country style. In the home<br />\nscrimmage.<br />\nnot the opposition.<br />\n12.<br />\nStevens, Swarthmore.<br />\nbefore had held Western Maryland steins, Hopkins men (gentlemen) to stretch Emmert showed the way,<br />\nEd—athlete, scholar, and all-around closely followed by Carl, who gave 13. Schultz, Hopkins.<br />\nto a one-touchdown victory.<br />\na beautiful spurt to end up tied for 14. Castelle, Hopkins.<br />\nDespite the discouragement which good fellow.<br />\nfirst. The time of the winners was 15. Bradbury, Swarthmore.<br />\nmust have prevailed among them, the<br />\n22:39. A few moment later, Loeb,<br />\nThe next home contest takes place<br />\nHopkins boys, fighting hard and St. John's Trounced By<br />\nCadwalader, Bose and Hendley, all of on November 9, when the harriers<br />\ncourageously throughout, had the<br />\nHampden-Sydney, 27-14 Swarthmore, pased the finish line in meet Drexel Institute.<br />\nthe order mentioned, just as the first<br />\nspectators wondering at their spirit<br />\n•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••11.11.1<br />\nIn a game chock full of surprises, half of the football game ended. These<br />\nand determined striving.<br />\nSt. John's, Hopkins' traditional rival four positions were enough to ser<br />\nEarly Game Close<br />\nNEW YORK<br />\nBut they tell us they don't mind it half so much at Hutzler's where—<br />\nand next opponent, dropped a 27 to cure the victory for the visitors. Ly- t<br />\nThe visiting team, after receiving 14 tussle to Hampden-Sydney. The man of Hopkins brought the specta- iL0AN<br />\nOFFICIO<br />\nthe kick-off and retrieving the ball Virginia team scored its points on tors to their feet with a brilliant<br />\nLOANS<br />\nWhat you want is easy to find.<br />\nto its own 35-yard stripe, immediate- two sustained drives, a recovered final sprint. He placed eighth.<br />\n1<br />\n—.---fumble, and an intercepted pass.<br />\nThus Swarthmore, possessing an<br />\nYou get efficient service.<br />\nly commenced to hack away at the<br />\nUnredeemed Microscopes<br />\nThree extra points were made by evenly balanced squad, repeated the I<br />\nPrices<br />\nare reasonable.<br />\nHopkins line. For a moment it seem- placement<br />\nCameras, Binoculars, Musical<br />\nkicks. The Johnnies scored act which Lehigh had performed the<br />\nInstruments, Typewriters<br />\ned as if the game would be a nip-and- on an old fashioned sleeper play and week preceding.<br />\nThe Hopkins, with<br />\ntuck affair, for the Jays held; and an equally antiquated play, the two outstanding individuals in the<br />\nHopkins' hopes soared high when spread. Two points were also ob- form of Sholtes and Emmert, showed<br />\n118 N. LIBERTY STREET<br />\ntained by a blocked kick in the end a lack of balance, in that the team<br />\nKahl set the Mountaineers back on<br />\nPLaza 3495<br />\nzone.<br />\ncould not hold enough of the other<br />\n171..11•••••••••••••••••••••••••••••••••••••••••11.0.1.1.••••••••••11.41.1...<br />\ntheir own 15-yard marker with a<br />\nbeautiful end over end punt. From<br />\nthen on, however, it was veritably a<br />\nwalk-away. The Mounts moved 85<br />\nyards in a sustained drive for their<br />\nfirst touchdown. The kick was good,<br />\nand the score was 7-0. The quarter<br />\nended with the ball on Hopkins' 35yard line in Mt. St. Mary's possession.<br />\nScore Rolls Up<br />\nThe second period AV, the powerhouse from the Mount really put on<br />\nthe pressure. It ripped its opponent's<br />\nforward wall wide open time and<br />\ntime again. Its single, double, and<br />\ntriple reverses, executed by a set of<br />\nfast, hard-plunging, shifty backs,<br />\nbehind a line which outweighed Hopkins by 20 pounds to the man, were<br />\ntoo much for the Jay defense. When<br />\nthe half was over, four more touchdowns had been added to the Mt. St.<br />\nMary's score. Ward, the Jays' fullback, and left tackle Pinsky, by their<br />\nsparkling defensive play, made the<br />\nburden a little easier -for Coach<br />\nGeorge Darley.<br /><br />\nJays Play Bravely<br /><br />\nWE KNOW<br />\nMEN HATE TO SHOP<br /><br />\nHUTZLER 13FOTHEM<br /><br />\nhaf.zyd-9<br /><br />\nLu'tz yoa<br /><br />\nfklt,<br />\n9<br /><br />\nWell, to start with, we take tobacco<br /><br />\nfrom our own Southland — mild ripe<br />\ntobacco with lots of natural flavor but<br />\nno harshness or bitterness.<br /><br />\nA team consisting mostly of second-stringers began the second half<br />\nfor Hopkins against an opposition of<br />\nreserves. With the removal of its<br />\nfirst team backfield, which included<br />\nits two stars—Apichella and Kuratnick, Mt. St. Mary's power was very<br />\nmuch reduced. Nevertheless, the Emmitsburg boys managed to score<br />\ntwice more before the end of the<br />\ngame.<br />\nHowever,<br />\nthe<br />\nHopkins'<br />\nends and tackles played brilliantly<br />\non the defense, forcing the Saints to<br />\ndirect their attack to the center of<br />\nthe line. Tommy Ellis, left tackle,<br />\nplugged up the holes on the left end.<br />\nwhile speedy Zeeny Baum kept the<br />\nSaints' attack from<br />\nfunctioning<br />\naround the right. Vincenti proved<br />\nhimself the surest tackler in the<br />\nsecondary.<br />\nThe opening home game was not<br />\ntaken too much to heart by the<br />\nHopkins squad. The team is now<br />\nlooking forward to its game with St.<br />\nJohn's a week from next Saturday.<br />\nLool,. out for the Jays this time; they<br />\nare raving mad and rarin' to go!<br /><br />\nTHEN AS A SECOND STEP—<br /><br />\nWe blend this home-grown tobacco<br />\nwith spicy, aromatic Turkish tobaccos<br />\nfrom across the seas. These Turkish<br />\ntobaccos, you may know, have a flavor<br />\nand fragrance entirely different from<br />\nour own.<br />\nAS A THIRD STEP—<br /><br />\nThese tobaccos are cross-blended—<br />\nwelded together—the best way we've<br />\nfound to get a more pleasing flavor<br />\nand a better taste in a cigarette.<br />\nTHAT'S WHY CHESTERFIELDS<br />\nARE MILD AND YET<br />\nTHEY SATISFY<br /><br />\nBARBER SHOP<br />\nTheodore's<br />\nST. PAUL and 33RD STREETS<br />\nNext To Blrely's<br /><br />\nCall PLaza 1696<br />\nFor QUICK LOANS On<br />\nAUTOMOBILES<br /><br />\nPUBLIC LOAN CO.<br />\n232 - 34 EQUITABLE BUILDING<br /><br />\n—..........—............,<br />\n1 Birely's Pharmacy I<br />\nST. PAUL at 33RD STREET<br />\nPrescriptions—School Supplies<br />\nCandy-Cigars<br />\nUnexcelled Fountain Service<br /><br />\nIn a single day people from ten different<br />\nstates visited our Chesterfield factories.<br />\n8,200 visitors during the past year saw<br />\nChesterfields made.<br /><br />\n(0 1935, LIGGETT &amp; MYERS TOBACCO CO.<br /><br />"}], "field_media_file": [{"target_id": 38978, "display": null, "description": null, "target_type": "file", "target_uuid": "5634fe8c-0e02-45a2-b052-bb0160e5d87d", "url": "http://digital.library.jhu.edu/system/files/2022-03/12655-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12655, "target_type": "node", "target_uuid": "14e74c25-c0af-45bb-b845-6c8b73b973db", "url": "/node/12655"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0d94ae33-25c8-4aa1-bc78-d2a6e2553855"}]}