{"mid": [{"value": 36749}], "uuid": [{"value": "92aff9e0-872e-44bc-9228-add2e5014947"}], "vid": [{"value": 36749}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:52:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13009-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:52:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:52:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "PRICE 5 CENT<br />\n<br />\nBALTIMORE, MD., MAY 19, 1922<br />\n<br />\nVOL. XXVI. No 55<br />\n<br />\nNINE TO MEET ST. JOHN'S<br />\nBLACK AND BLUE TRACK- LONG-AWAITED 0. D. K. VARSITY TWELVE TO VISIT FRESHMEN HOLD ANNUAL<br />\nAND MARYLAND IN BARBANQUET AT STATE'S<br />\nSWARTHMORE FOR ANSONG BOOK MAKES APMEN TO RUN MARYLAND<br />\nGAIN ATTRACTION<br />\nCAPITAL<br />\nNUAL CLASH<br />\nPEARANCE ON CAMPUS<br />\nTOMORROW AFTERNOON<br />\nMarks Resumption of Athletic Rela- Old<br />\ntions. Thompson and Clark Out<br />\nof the Running.<br />\n<br />\nFavorites Included in Volume. Coaches Hope for Recovery from Sophomores Scour Country in Vain. Owings and Knecht Scheduled to<br />\nTwirl. State Championship at Stake.<br />\nAttractive Program Offered. Soph<br />\nSlump. Comparative Scores Point<br />\nFive Men Initiated Last<br />\nMaryland Team Strong.<br />\nCapture.<br />\nEscape<br />\nLeaders<br />\nto<br />\nVictory.<br />\nWeek.<br />\n<br />\nTomorrow afternoon, when<br />\nBelieving that \"Discretion is<br />\nThe hamlet of Swarthmore will<br />\nAfter many postponements and<br />\nsundry delays the 0. D. K. Song- be the scene of the Black and Blue the better part of valor,\" the University of Maryland and St.<br />\nbook was finally put into circula- twelve's activities tomorrow after- Freshman Class packed into eight- John's will be met at Homewood<br />\ntion last Monday. The long- noon, when the Hopkins stickmen een automobiles, journeyed to will mark the first double-header<br />\nlooked-for volume, published by line up against the Garnet. Bright<br />\nhistoric Carvel Hall at Annap- in which the baseball team has<br />\nthe Omicron Delta Kappa Hon- hopes point to the recovery of the<br />\nolis last Monday, where their an- participated this year. U. of M.<br />\norary Fraternity, is very popular, form which has been lacking in the<br />\nnual class banquet was held with- will engage the Black and Blue in<br />\nlations have been renewed, it should as is attested by the number of last few games the Black and Blue<br />\n(the sign of a pur- has played. Swarthmore was easy out a semblance, of interference. first contest at 2.30 P. M., while<br />\nbe of especial interest to everybody green tags<br />\nthe prey for Mt. Washington three The first-year men had as their the tossers from the state's capiupon<br />\nchaser) appearing<br />\nconnected with Hopkins. From all<br />\nweeks ago.<br />\ncampus.<br />\nunwilling guests Buck Bonner tal will cross bats with the Hopindications, Hopkins should win<br />\nPenn pulled a big surprise on<br />\nThe attractive blue books conand Ed Mount, of the Sophomore kins team at 4 P. M.<br />\nwithout difficulty, even thoUgh tain nearly all songs identified with local lacrosse fans in Baltimore by<br />\nMaryland is represented by an<br />\nClass. The Sophomore officers,<br />\nThompson and Clarke will prob- the Black and Blue. Besides those defeating J. H. U. Swarthmore,<br />\nexceptionally strong team, and<br />\nClarke songs which are well known today too, fell before the Franklin Field expecting an assault, had outwitably not be in harness.<br />\nnot been stick wielders in a hot game. By ted their pursuers in the after- has been a consistent winner.<br />\npulled a tendon last Friday in the are several which have<br />\nwidely, sung on the campus for comparative scores, Hopkins holds noon. The two captives, however, Their recent victory over West<br />\nheats of the South Atlantic meet at<br />\nmany years. The scores for the the odds on the Swarthmore play- were caught unawares and car- Virginia by a score of 8 to 2 was<br />\nCharlottesfrille, Va., and Thompsongs were arranged by Douglas ers, as Penn made one more point ried away in triumph to grace the a noteworthy feat. \"Eddie\" Semson has been under the weather Coulter, '21, with the able assist- against the Garnet than against board of the feasters.<br />\nler, one of the star backs of the<br />\nsince the Navy meet. Maryland's ance of Mr. Louis Fisher. The Captain Zoller's men.<br />\nSo well did the Frosh keep College Parkers, will be seen in<br />\nCoach Knipp started last Tues- their plans secret that it was not centerfield for the visitors. Baibest bets are Beers, in the weight songs are selected 'as best repreon a vigorous training sched- until 4.30 P. M. on Monday that ley, U. of M.'s catcher, is a heavy<br />\nday<br />\nthe<br />\nsenting<br />\nuniversity.<br />\nevents; Robertson, in the 880;<br />\nHard drilling at practice is the Sophomores realized that hitter and will bear watching at<br />\nule.<br />\nmembers<br />\nnew<br />\nof<br />\nPugh, in the hurdles, and Crooks, The initiation<br />\nthe rule.from now on. The the banquet was on. The Fresh- all times. It is likely that \"Andy\"<br />\nbe<br />\nto<br />\nK.<br />\nD.<br />\nto the J. H. U. circle of 0.<br />\nin the distance runs. Hopkins will<br />\nmentor believes that it is men feast had been daily await- Nisbet will twirl for Maryland,<br />\nHopkins<br />\ntook place last Thursday night. The<br />\ndepend on Booth in the 880 and<br />\ninitiates were Major Garey, Emil the let-down in practice that is re- ed since the second-year men's and if the big boy is right, the<br />\ntwo mile; Aaronson in the sprints<br />\nSmith, Pierce Brawner, Lawrence sponsible for the ,recent defeats. celebration last Thursday. Ru- Black and Blue will have no easy<br />\nand pole vault, to run up a high<br />\nFenneman, Wm. H. Moore and The most important games of the mors were afloat on Friday, Sat- time solving his slants.<br />\nscore. The 440-yard run will be<br />\nTom Landy. The last three named season lie ahead of the team, so urday and Sunday that the banSt. John's was weakened con-.<br />\ntaken care of by Dorcas, Norwood<br />\nD. Collins and S. A. Mid- every effort will be put forth to quet, was to be held, and upon siderably when Porter, their cap0.<br />\nwith<br />\nand Skinner, as will also the 220.<br />\ndleton will constitute the 0. D. K. come through the remainder of the each occasion were proved false. tain, left to join Jack Dunn's OriSomerville and Milligan, in the disseason with flying colors.<br />\nnext year.<br />\nWhen Monday morning and early oles. They have, however, had a<br />\ncircle<br />\ntance runs, and Hearn, in the high<br />\nThe hard practice this week has afternoon passed without disturb- successful season and St. John's<br />\na<br />\nmen<br />\nrepresent<br />\ngreat<br />\nThese<br />\nfive<br />\nhurdles, should come through in<br />\nnumber of activities. Fenneman is put the team into fine condition. ance it was believed by the Soph can always be counted on to put<br />\ntheir events.<br />\n,Aitor-in-cllief of the Hullabaloo Two men, Coady i-it,r1 Calkins, are leaders that the evening, too, up their best game against HopVerne Booth, fresh from his<br />\nkins. It is interesting to note that<br />\nand president of the Social Science still on the injured list. Pearce would prove without event.<br />\nrecord-breaking performance in<br />\nCoady is still suffering from the<br />\nScouts, however, discovered a former Hopkins student, \"Ed\"<br />\nbe-Dinty\"<br />\nbesides<br />\nMoore,<br />\nClub.<br />\nthe two-mile run last Saturday, will ing editor-in-chief of the NEWS- blow he received a month ago. several carloads of Freshmen sur- Cashell, who made his letter in<br />\ngive Hopkins rooters a chance to<br />\nLETTER, is president of the Dramat- Several new men have shown con- rounding the house of Henry Cal- football last year at Homewood,<br />\nsee him in mid-season form. Beers, ic Club, and the. Publicity Board. siderable skill in the past few weeks lard, president of the second- is covering first base for the St.<br />\nof Maryland, has showed fine form Landy and Middleton are both and their services will be available year men. The word was broad- John's. Opposing Hopkins on the<br />\nall season in the shot put and discus members of the football team and tomorrow.<br />\ncasted and the Sophomore officers mound will be seen either Gray<br />\nand the spectators can depend on a the lacrosse squad. 0. D. Collins<br />\nCromwell played well in the Penn proceeded to make themselves or Tall. There is also a 'possibiligenuine first-class performance in will be manager of lacrosse next game last week. Tom Landy made conspicuous by their scarcity. ty that Smith, the Orange and<br />\nthese events. Robertson has been year, as well as being a member of use of his football ability against Fitzgerald Dunning, secretary of Black shortstop, will hurl, in<br />\ngoing well in the half-mile run, but<br />\nthe Blue Jay business staff and the Navy. Another of Dr. Van Or- the class, had a narrow escape which case Aldrich will move in<br />\nBooth or Edwards will be sure to.<br />\nman's linemen, Middleton, is doing when an automobile load of from right to short and Holmes<br />\nHullabaloo Board.<br />\ngive him a real tussle for first honwell under Johnny Knipp's tute- Freshmen trailed the bus in will cover the right garden.<br />\nors. With Thompson absent in the<br />\nwhich he was riding. The driver, \"Bob\" Owings in all probabililage.<br />\nNEW PUBLICATION TO MAKE<br />\nhurdles, Hopkins will lose some<br />\nAPPEARANCE<br />\nThe lineup will be very much the however, possessed Sophomoris- ty will pitch against the College<br />\nsure points unless another man<br />\nThe editors of Horizons, the new same as in the game against Navy, tic tendencies and he and Gard- Parkers. Bobby has had ten days'<br />\nsteps in and picks up the loose<br />\nner Packard held back the assail- rest since the Navy game and can<br />\nrecently inaugurated by with probable use of some reserves.<br />\npoints. In the other track events the magazine<br />\nbe looked to to give a good acThe whole team is aroused on ac- ants while Dunning 'escaped.<br />\nBlack and Blue should run up such a group of men interested in a field count of the defeat by U. of P.,<br />\nThe Sophomores soon had the count of himself. His battery mate<br />\na heavy score that the final results of ideas and interests which they and are determined to win tomor- wires humming, and automobiles will, probably be Carl Wilson. It<br />\nwill constitute a real victory for felt was not exploited by the ex- row at any cost.<br />\nand men were assembled. While would not be surprising to see<br />\nHopkins over her old rival. The istent Hopkins publications, an<br />\nthis work of organization was Captain \"Andy\" Knecht take the<br />\nLineup:<br />\nHopkins entries are:<br />\nHopkins.<br />\nproceeding the Freshmen were mound in the second game against<br />\nSwarthmore.<br />\nthat their periodical will apRoutson<br />\nAyors<br />\nserenely<br />\nproceding to their des- the Annapolitans. \"Andy\" turned'<br />\n100-yard Dash—Aaronson, Dor- pear on Thursday, May .25, 1922.<br />\nBachman<br />\n.P<br />\nCornell<br />\nTurner<br />\ntination, rending the quiet hills back the St. Johnnies in a tenC P<br />\nLong<br />\ncas.<br />\nThe project is a purely tentative<br />\nZoller<br />\nMiller ......F. D<br />\nand vales of Anne Arundel coun- inning game last year by a 3-2<br />\n220-yard Dash—Dorcas, NorLandy<br />\nSD<br />\nTaylor<br />\none, and its reception by the stuMurphy<br />\nty with Hopkins songs and yells, score and, after his fine showing<br />\n.D<br />\n.T<br />\nJackson<br />\nwood.<br />\nBurnham<br />\nHowell<br />\nwill<br />\nbody<br />\ndent<br />\nits<br />\ncondition<br />\nlargely<br />\nand breathing defiance to the far- against Western Maryland last<br />\nTurnbull<br />\nT A<br />\nBaxter<br />\n440-yard Dash—Dorcas, Norreappearance next fall as an estabdistant Sophomores. At Annap- Saturday, feels capable of repeatBenedict<br />\n...S. A.<br />\nPollard<br />\nwood, Skinner.<br />\nGriffiss<br />\nF A<br />\nLewis<br />\nlished feature of campus activities.<br />\nolis the Freshmen were met by ing the trick this year: In the<br />\nMcDaniel<br />\nClyde .. .0.H.<br />\n880-yard Dash — Edwards, All that the present editorial staff<br />\nParsons<br />\nPage<br />\n..<br />\nH..<br />\n.....I.<br />\nO'Connor and their other event of Knecht pitching, \"Bill\"<br />\nHolmes<br />\nBooth.<br />\ndo<br />\nis<br />\nto<br />\nto<br />\nexattempt<br />\nmeet<br />\nwho had been in seclu- Merrick will cover first. Should<br />\nofficers,<br />\nwill<br />\nTO APPEAR NEXT<br />\n1-mile, Run—Booth, Somerville, 'penses; and, as a result, subscrip- \"HULLABALOO\"<br />\nsion<br />\nin<br />\nthat secluded town since Andy not receive the assignment,<br />\nWEEK<br />\nFenton.<br />\nappear<br />\nfor<br />\nonly<br />\nthe<br />\nwill<br />\nin<br />\ncurthe morning.<br />\nearly<br />\ntaken<br />\nThe 1922 Hullabaloo<br />\ntions will be<br />\nhe will play first and Clayton<br />\nSomerville,<br />\nkun—Booth,<br />\nIn the meantime, the Sopho- will probably take the mound.<br />\n2-mile<br />\nrent number, and at a price of 35 on the campus during the early<br />\npart of next week. R. Dorsey Wat- mores had collected five machines<br />\nMilligan.<br />\ncents.<br />\nLineup:<br />\nThe magazine has so far been kins, editor-in-chief, will distribute and about 40 classmates and had<br />\n120-yard Hurdles—Hearn, CornHOPKINS—Grace, 26.; Reifschneifinanced by private subscription copies of the publication at the begun a systematic search of the der, 3b.; Hayter, rf.; Sharretts, If.;<br />\ning.<br />\namong the editorial board, and it Postoffice from 12:20 to 1 :30 and city. When no traces of the frosh Rich, cf.; Knecht, lb.; Thomas, ss.;<br />\nNorwood,<br />\n220-yard Hurdles —<br />\nappeared, telephone calls were Wilson, c.; Owings, p.<br />\nis hoped that sufficient support on from 3:30 to 4:30.<br />\n_aronson.<br />\nU. OF M.—Paganucci, 2b.; Semler,<br />\nthe campus will be found to insure<br />\nThe Student Activities Card will sent to neighboring points in an<br />\ncf.; Pollock, lb.; Bailey, c.; Burdette,<br />\nBroad Jump—Aaronson, Wickthat these men will not stiffer loss be collected *at the time that the effort to gain information con- rf.; Beachley, If.; Moran, 3b.; Besley,<br />\nham.<br />\nin their attempt to add a distinctive Hullabaloo is given out. These will cerning the missing class. Par- ss.; Nisbet, p.<br />\nHigh Jump—Hearn, Wickham.<br />\nfeature to the life of the Univer- then be tinned over to the Black ents were telephoned, pleaded<br />\nHOPK1NS—Grace, 2b.; ReifschneiPole Vault—Aaronson, Ander- sity.<br />\nand Blue Jay and THE NEWS-LET- with, lied to, all to no avail ; the der, 3b.; Hayter, rf.; Sharretts, If.;<br />\nson.<br />\nSubscriptions may be registered TER for the purpose of checking. Freshmen had covered their Rich, cf.; Knecht, p.; Thomas, ss.; Holland, c.; Merrick, lb.<br />\nGil,<br />\nThrow—Hambleton<br />\nDiscus<br />\nwith Mr. A. D. Emmart, Mr. John<br />\nAll students are requested to traces well.<br />\nST. JOHN'S—Puller, If.; Matthews,<br />\nlonely<br />\na<br />\non<br />\nchase<br />\nAfter a wild<br />\nn.<br />\nHubner, Mr. Savington Crampton, bring their cards Monday so as to<br />\n2b.; Engelke, 3b.; Brown, cf.; Aldrich,<br />\navail<br />\nno<br />\nto<br />\nP. 0. Box 87, or Mr. T. M. Landy, be ready for Hullabaloo's appear- country road proved<br />\nJavelin—Aaronson, Gilpin.<br />\n<br />\nTomorrow afternoon at 1 P. M.<br />\nthe Black and Blue track team will<br />\nget into action against Maryland<br />\nState's aggregation of runners. As<br />\nthis contest will be the first clash<br />\nwith Maryland since athletic re-<br />\n<br />\nShot Put—Hambleton, Gilpin.<br />\n<br />\nat the Athletic Store in the Barn. ance.<br />\n<br />\nContinued on Page 2, Col. 5<br />\n<br />\nrf.; Smith, ss.; Cashel!, b.; Boston or<br />\nWeaver, c.; Gray or Tall, p.<br />\n<br />\n\f2<br />\n<br />\nThe Johns<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 19, 1922<br />\nSOUTHERN<br />\nINTERCOLLEGIATE CONTRIBUTIONS OF THE<br />\nCOLLEGE NEWSPAPER<br />\nNEWSPAPER ASSOCIATION<br />\nHOLDS SECOND ANNUAL<br />\nTO COLLEGE LIFE<br />\n<br />\nHopkins News-Letter<br />\n<br />\nSENIOR CLASS TO HONOR HEROES<br />\n<br />\nClass Day, with its more or less<br />\nimportant elections, is drawing<br />\nCONVENTION<br />\nThe following editorial won first<br />\nnear. A great deal of thought<br />\n(By Southern Intercollegiate News<br />\nprize in the recent contest conductSubscription<br />\n$2.50<br />\nService)<br />\ned by the Southern Intercollegiate should be given these elections in<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\norder that the best man shall, in<br />\nGreenville, S. C.—Southern col- Newspaper Association:<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\neach case, be chosen. As a guide<br />\nlegiate journalists, who met at FurBy WM. SWOLL SAWYER<br />\nPublished semi-weekly from October to June by the students of Johns man University, Greenville WomManaging Editor, The Emory to those seniors who hesitate, the<br />\nHopkins University.<br />\nNEWS-LETTER recommends the folWheel, Emory University, Ga.<br />\nan's College co-operating, 'April<br />\nBusiness communications should be addressed to the BUSINESS MANIn five distinct fields the college lowing:<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications 28 and 29, in the second annual<br />\nshould be sent to the MANAGING EDITOR.<br />\nHandsomest Man—H. Douglas<br />\nconvention of the Southern Inter- newspaper contributes to college<br />\nTelephone<br />\nHomewood 100 collegiate Newspaper Association, life. These are the student body, Cotton, former All-American quarby sound legislation insured the faculty, alumni, prospective stu- terback on the team representing<br />\npermanency of that infant organi- dents and intercollegiate relation- the American School of CorreBusiness Manager:<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23<br />\nGLOVER P. FALLON, '23.<br />\nzation which had its birth at Rich- ships. The newspaper is a strong spondence. The original siren of<br />\nManaging Editor:<br />\nmond last spring.<br />\nfactor in developing student opin- the geology trip.<br />\nJ. HUDSON HUFFARD,'23<br />\nIn the two-day meeting speakers<br />\nClass Politician—J. A. Bauernion, and simultaneously is a potent<br />\nAssistant Managing Editor:<br />\nAdvertising Manager:<br />\nof note were heard on different<br />\nJOSEPH S. LEOPOLD, '24.<br />\nschmidt,<br />\nwhose dirty political methDONALD K. VANNEMAN, '23.<br />\nphases of newspaperism, round ta- agency in developing student ods, clever stump<br />\nAssociate Editors:<br />\nspeeches and<br />\nble discussions took place, business thought. Without the college news- never-tiring campaigns<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nhave atsessions were held, and the annual paper the proper college spirit tracted the attention<br />\nJunior Editors:<br />\nof every conAssistant Business Managers:<br />\nbanquet with other lighter features would be difficult to develop and gressman and have<br />\nRANDOLPH NORWOOD, '24.<br />\neven inspired<br />\nBERNARD C. HEARN,'23.<br />\nwere enjoyed.<br />\nT. REESE MARSH, '24.<br />\nconserve. The appeal of actual ac- His Honor, the municipal stadium<br />\nFITZGERALD DUNNING, '24.<br />\nG. COCHRAN DOUB, '23.<br />\nEmory University, Ga., won first<br />\nPHILIP. W. HOWARD, '25.<br />\nT. CLYDE ROUTSON, '23.<br />\ncomplishments, as /related in the builder.<br />\nD. MILES MARRIAN, '25.<br />\nplace<br />\nin<br />\nboth<br />\nthe<br />\nR. C. TILGHMAN,'25.<br />\nEditorial<br />\nContest<br />\nBest Athlete—H, Peirce BrawG. DONALD GIESKE, '25.<br />\nnewspaper, gives the college newsWILLIAM G. DEAN, '24.<br />\nand Journalistic Contest, and, likeD. H. STEVENSON, JR., '25.<br />\nner (\"H.\" for Horses), former<br />\nJOHN W. PARSONS,'25.<br />\nJ. D. SLAUGHTER, '23.<br />\nwise, the convention selected paper predominance for this pur- street cleaner in the<br />\nBENJAMIN T. ROME, '25.<br />\none-horse town<br />\nCharles H. Deterly, of the same pose over all other mean's. The of Shovelsburg.<br />\nQualified through<br />\nschool, as president, to succeed disseminating of news and infor- his ability to toss<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nthe male of the<br />\nChas. F. Leek, of the University of mation tends to promote unity in species bovina.<br />\nRichmond. Other winners in con- student body,<br />\nMost Popular Man—Treasurer<br />\nand it brings about<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nMd. tests were: Editorial, C. J. Broome,<br />\nNaviasky,<br />\nof Spanish blood, but of<br />\na closer bond between the students<br />\nof Mercer University, Ga., second,<br />\ngood heart. Elected treasurer beBALTIMORE, MD., MAY 19, 1922<br />\nand Seth M. Mimming, of Pied- themselves. Through no other cause of the \"ask\"<br />\nin his name—<br />\nmont College, Ga., third; Journal- means can all or any part of the and he has been<br />\nasking ever since.<br />\nistic, The Richmond Collegian, students be reached as effectively<br />\nMost Active Man—J. B. Wells,<br />\nANOTHER STEP IN THE RIGHT DIRECTION<br />\nUniversity of Richmond, Va., sec- or as quickly as through the news- formerly of tank<br />\ncorps, though he<br />\nThe decision of the Freshman Class to hold the annual Freshman- ond, and The Orange<br />\nand White, paper.<br />\nsaw most of service on the foam<br />\nSophomore fight on some night, next year, other than that of the Y. IN I. Cniversity of Tennessee, third.<br />\nThe college newspaper fosters a with the good schooner Red-Eye.<br />\nThe Henry Grady District, comHe is a track man and .won his<br />\nC. A. reception, is a commendable one. It has always been very disprising States of North Carolina, closet and more intimate relation- \"H\" in his first<br />\nyear (Havre de<br />\nconcerting to the speakers at this reception to face a crowd of eager, South<br />\nCarolina, Georgia and Flor- ship between the students and fac- Grace). Future<br />\nvocation—christenexpectant firstirear men—eager and anticipatory of the conflict which<br />\nis ida, took first place in the member- ulty. The faculty can exert a con- ing battleships.<br />\nto follow. Little wonder that these uninformed greenies return the ship drive with the admittance of trolling and disciplining influence<br />\nMove nominations be closed!<br />\nnine new members, namely: Geor- over the students through advising,<br />\nweek later to inquire innocently \"What is the Student Council?':<br />\nor gia Tech, Mercer, Piedmont and<br />\nsuggesting and requesting certain FRESHMEN HOLD BANQUET AT<br />\n\"What is the 0. D. K.?\"<br />\nAgnes Scott, of Georgia; Furman,<br />\nANNAPOLIS<br />\npolicies and material for the newsContinued from page 1<br />\nFurthermore, a number of the trembling freshies absent themselves Presbyterian and Greenville Wom- paper. This opportunity properly<br />\nthe time was growing short and,<br />\nan's College, of South Carolina;<br />\nembraced is unsurpassed in it pos- as some<br />\nfrom the reception through mortal fear of the paddle.<br />\nof the murderous tendenand Rollins and Southern, of Florsibilities by any other agency.<br />\ncies of the group had been alleWith the postponement of the encounter, attendance next year ida. Martha Washington, of VirAgain, through the medium of viated by<br />\nthe brisk country air,<br />\nginia; St. John's, of Maryland;<br />\nshould near the 100 per cent. mark. As an introduction to<br />\nthe college newspaper, the love of it was decided<br />\ncollege life Bethany,<br />\nto adjourn.<br />\nof West Virginia, and<br />\nalumni can be fostered, and college<br />\nand institutions, it is imperative that every first-year man attend<br />\nThe<br />\nFreshmen<br />\nthe Trinity, of Washington, were adhad a varied and<br />\nneeds can be presented to them. attractive program<br />\nwelcoming meeting.<br />\nat their celemitted in the Woodrow Wilson disIt is a hit of their Alma Mater that bration which<br />\nproceeded after an<br />\ntrict. From the Henry Watterson<br />\nTo the minds of many, it would be a great improveme<br />\nenables them to keep in touch with enjoyable dinner had<br />\nnt if the<br />\nbeen served.<br />\ndistrict, Georgetown College, of<br />\ncollege life. The college that loses George Darley acted<br />\nClass of '25 would endeavor to schedule the underclass<br />\nbanquets, for Kentucky, was taken in. Virginia<br />\nas toastmastouch with its alumni suffers under ter, and speeches were<br />\nnext year, at some time farther in advance of the examinatio<br />\ndelivered<br />\nns. The had the largest delegation, with unnecessary handicaps.<br />\nby<br />\nR.<br />\nPage<br />\nO'Connor,<br />\npresident<br />\neleven.<br />\nSenior and Junior classes would probably be glad to waive the<br />\nThe newspaper is a tangible ex- of the class; Daniel E.<br />\nold senKlein,<br />\nA Southern Intercollegiate News<br />\niority rule in exchange for the peace of mind that would result.<br />\npression of the activities of college chairman of the banquet commitService for member papers was<br />\nlife which speaks for the college tee; Howard A. Reaney, Nelson<br />\nestablished, with \"centrals\" at Emwherever it goes. The \"High Young and Mr. Justinius Q. Gold,<br />\nory University, Ga., and University<br />\nSchool Special- of some college the latter speaking extemporanof Richmond, Va. Many changes<br />\nnewspapers is a valuable contribu- eously and receiving much apSPEED UP THE JOURNALISTIC CONTEST<br />\nwere made to the original constition, because it reaches the prospec- plause from a good-natured asWould-be Hollander Prize winners continue to turn in their tution, one of the chief being that tive student at the time when first semblage. The program<br />\nconcludeach State be represented on subimpressions are made and the ed with outside. entertainment, inessays for judgment, but there has been, as yet, no great work of<br />\n-ommittees under the chairmanship<br />\nfoundation is laid for college loy- cluding a quartet of dancers, a<br />\ngenius disclosed. A number of these essays have been published in of the three regional vice-presialty and pride. Decisions for a sleight-of-hand performer and an<br />\nour columns as regular News-Letter material, and some of them dents. Wm. Ellyson, Jr., editor of college are often made because of orchestra. Attractive<br />\nsouvenir<br />\nThe Richmond Collegian, was the<br />\nthe appeal which a copy of the col- programs -were distributed.<br />\ncaused comment. Several of these have been satirical essays; sev-,n1y vice-president chosen, and the<br />\nnewspaper had made. The imeral broader attempts at humor, lacking the finer subtleties of the executive committee will select re- lege<br />\nmediate effect on the prospect is SCABBARD AND BLADE TO DINE<br />\ngional heads for the Henry Grady<br />\nformer.<br />\nunlimited in its value to the future<br />\nA dinner will be given by the<br />\nand Henry Watterson districts<br />\ncollege life.<br />\nAny article appearing in the News-Letter from the time of the<br />\nScabbard & Blade Honorary Mililater.<br />\nFurthermore, for the regulatin?,<br />\nannouncement of the contest until the end of the year is eligible in<br />\ntary Society at the Hopkins Club<br />\nThe association incorporated in<br />\nand shaping of college life, some-on Tuesday, May 23, at 6 P. M.<br />\nthe contest. The identity of the writer of any article will be guarded its immediate policy the fostering thing should be known<br />\nof other<br />\nof the organization of State assounless the author gives permission to use his name. This guarantee<br />\ncolleges and their campus life. The This is the last meeting of the year<br />\nciation si that would operate harof secrecy should draw out the most reticent of our budding lit- moniously with the larger Southern college newspaper has limitless op- and a large attendance is expected.<br />\nportunities to print from other colbody.<br />\nerary lights.<br />\nlege newspapers facts and innova- rounding of a student's education.<br />\nAtlanta will be the meeting place<br />\nIt will be interesting to note that of the contestants to date, few<br />\ntions which will tend towards the The printing of reports of differfor the association, April, 1923.<br />\nbetterment and development of the ent society meetings that are of<br />\n-are members of the literary circles of the University. Strange to say,<br />\ncollege life. The spirit and in- an educational value gives to the<br />\nthose who would be expected to be among the foremost to hand in<br />\nAt the recent spring elections, spiration of thought<br />\nfrom another non-member and absentee an intheir contributions have failed, so far, to take active part. Perhaps held at Syracuse University, Allen campus often reacts on college life valuable advantage. The careful<br />\nreporting of public lectures which<br />\nthese and other contestants are holding back their work. It would \\Voodring and George Fisher both to the advantage of all.<br />\nThe educational value of the col- are given on the campus keeps alive<br />\nreceived<br />\n497<br />\nvotes<br />\nfor<br />\nthe<br />\noffice<br />\nof<br />\nbe to their advantage, however, to turn in their article or articles<br />\nPresident of the Student Body. lege newspaper is to be found in all interest in these and extends the<br />\nat an early date, if for no other reason than because Of the everthe fields of its influence. The re- scope of their influence. The eduThe votes will be recounted, and,<br />\nprinting from various sources of cational value depends to a large<br />\napproaching exams. Let us have your literary effort as soon as<br />\nif found to be correct, the vote will<br />\nspeeches, articles and lectures hold extent on the standards and polpossible. The prize is waiting.<br />\nbe retaken.<br />\nhigh value in the polishing and icies of the editorial staff.<br />\nFOUNDED 1897.<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 19, 1922<br />\nHOPKINS HISTORY REVEALS<br />\nSOME STRANGE<br />\nFACTS<br />\n<br />\nPENN HOLDS ANNUAL PANTS<br />\nFIGHT<br />\n<br />\nIn the annual Pants Fight held<br />\n<br />\nSeveral Men Lacking Hopkins Diplo- recently at Penn, between the first<br />\nmas Succeed in Ranking<br />\nand second year classes-, the SophFame.<br />\n<br />\nThe Johns Hopkins University<br />\noccupies all of the town of Baltimore exCept the small portion set<br />\naside for the working class.<br />\nIt is the center of brain power<br />\nand the home of original schemes.<br />\nIt shelters the machinery of the<br />\nChinese Government, as well as the<br />\nmayor of the hidden cities of Rome.<br />\nReal Hopkinsians believe that the<br />\ncity of Boston is a low-brow prep<br />\nschool for the Homewood Utopia.<br />\nThey believe that the Hopkins man<br />\nwho does graduate work at Yale,<br />\nHarvard or Princeton is doing missionary work.<br />\nHopkins satisfied- itself with the<br />\ntitle of state football champion because Lafayette, Washington and<br />\nJefferson did not challenge it for<br />\nthe Atlantic coast title.<br />\nIt will be remembered that<br />\nshortly after the Hopkins unit of<br />\nthe S. A. T. C. was formed, Ger-many surrendered.<br />\nredistinctly<br />\nbe<br />\nalso<br />\nIt should<br />\nwas<br />\nWilson<br />\nMr.<br />\nthat<br />\nmembered<br />\nelected President - of the United<br />\nStates only after he had several<br />\nyears before done historical work<br />\nat Hopkins with Dr. Latane.<br />\nIt is pointed out by students of<br />\nlogic that Mr. Cox, who never attended this university, was defeated<br />\nat the polls.<br />\nIf all of Hopkins' famous men<br />\ncould be stretched out head to foot<br />\nin a chain they would extend from<br />\nthe main entrance of Andy-Landy<br />\nCo. to the Island of Yap, with a<br />\ndetour through Hoboken.<br />\nAmong the famous men not associated with Hopkins are listed<br />\nJack Johnson, Fatty Arbuckle, Pussyfoot Johnson, Curley Byrd, Bill<br />\nStillman,<br />\nHohenzollern, James<br />\nof<br />\nPrince<br />\nPoultney,<br />\nC.<br />\nde<br />\nWalter<br />\nMayor<br />\nand<br />\nArnstein<br />\nWales, Nickey<br />\nBroening.<br />\n<br />\nomores emerged with a victory.<br />\nAccording to the regulations of the<br />\nfight, if the Sophomores finished<br />\nthe fray with seven or more men<br />\nwearing pants, or what might be<br />\nconsidered as pants, they were to<br />\nbe awarded the fight. This was the<br />\ncase, as thirteen Sophomores with<br />\npants attached were located on the<br />\nfield after the battle.<br />\nNo violations of the rules were<br />\nnoticed either before or after the<br />\nfight. This was especially true in<br />\nthe regulation prohibiting kidnapping until 1 o'clock. But immediately after this time the kidnapping was wholesale on the part of<br />\nboth classes.<br />\nMany individual scraps were<br />\nseen on all parts of the campus,<br />\nusually followed by a kidnapping<br />\nparty. The undergraduates, arElkridge Farms Dairy<br />\nrayed in old and peculiar clothing, Some girls ought to wear speedSTRICTLY FRESH MILK<br />\nstampeded every street in the vi- ometers instead of wrist watches.<br />\nW. University Parkway<br />\nProduced,<br />\nPasteurized and Bottled<br />\ncinity of the University, giving the<br />\nOpposite J. H. U. Athletic Field<br />\nin Howard County<br />\nnumerous spectators many unusual ••• MEM IN II • IN •• III<br />\nEllicott City 23I-R DRUG STORE for J. H. U. BOYS<br />\n111<br />\nI II • • II II II<br />\n• CLARK BROS.<br />\nsights.<br />\n1•41Mmik<br />\n<br />\nClothes f<br />\n14<br />\n<br />\nORTMAN'S<br />\n<br />\nW.L. Mann<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nR.G.by& Company<br />\n1<br />\nPHONE, HOMEWOOD 2121<br />\n<br />\nURNER'S<br />\n<br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br />\n<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\n<br />\nAsiteknir<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\n5he apex<br />\ninfashronable<br />\nneclurffear<br />\n<br />\nCHAS. E. HERRING<br />\nYour Caterer at Hopkins Dances<br />\nMeet Your Friends in my<br />\n<br />\nBalcony—Soda Booths<br />\nS. E. Cor. Maryland and North Ayes.<br />\nMUSIC<br />\n<br />\nDANCING<br />\n<br />\nAre You Planning A<br />\nJUNIOR CLASS ENDS SEASON WITH<br />\nQUIET BANQUET<br />\n<br />\nFULL DRESS<br />\nThe fight started promptly at SPORT WEAR<br />\n5:15, and after the Freshman class<br />\nhad placed itself along all four sides<br />\nof the enclosed arena, the Sophomores filed in singly. Many of<br />\nthem were dripping with oil, so<br />\nthoroughly were they saturated.<br />\nThey then formed a circle, with<br />\nCustom<br />\nPresident Bailey in the center.<br />\nIskaurles Street.<br />\nAt the shot of the gun the enEnglish Clothes Tailored in America<br />\n$30to $45<br />\ntire Freshman class closed in on the<br />\nsolid group ,of second-year men.<br />\nThe Sophomores moved in a body<br />\nMt. Vernon 4999<br />\nto a corner of the arena. Here<br />\nMade<br />\nHome<br />\nQuality\"<br />\nthey tried to protect themselves \"Queen<br />\nChocolates<br />\nagainst the advancing Freshmen,<br />\nVISIT OUR ICE CREAM PARLORS<br />\nbut out of the 500 second-year men<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\nwho entered with pants on, only<br />\nCircuit Photography<br />\nthirteen succeeded in coming out<br />\nViews<br />\nFlash Lights<br />\nof the battle wearing anything<br />\nEnlargements<br />\nGroups<br />\nwhich resembled pants.<br />\nKODAK FINISHING<br />\nCharles and 22nd Sts.<br />\n325 N. Howard St.<br />\nOur Greenwich Village friends Delicious Sodas and Sundaes<br />\ntell us that the soul kiss is often.<br />\n• The Best of Candies<br />\nunceremoniously interrupted and<br />\nPrompt & Efficient Service<br />\nabruptly ended by the sole kiss.<br />\n<br />\nVACATION ABROAD?<br />\n<br />\nThe tie that<br />\nbinds,<br />\nThere's something<br />\nabout a well selected<br />\nscarf that binds the<br />\nman who buys it to<br />\nthe store which sold it.<br />\nThere's nothing like<br />\na fashion knit tie for<br />\nstyle, for distinction,<br />\nfor wear.<br />\nThey come in plain<br />\ncolors, and in stripes.<br />\n$2.50 and $3.<br />\n<br />\nIf So, Call on<br />\nAt a banquet, whose savor<br />\nstrongly contrasted with that of<br />\nA. SCHUMACHER & CO.<br />\nthe one of the previous year, the<br />\nPASSENGER<br />\nClass of 1923 made merry on the<br />\nAGENTS<br />\nas<br />\nComing<br />\nTuesday.<br />\nlast<br />\nof<br />\nnight<br />\nits<br />\npostponement,<br />\nto<br />\ndue<br />\nfor all<br />\nit did,<br />\nTrans-Atlantic • Lines<br />\nat the end of the season, the Junior banquet served as a fitting<br />\nCharles & Redwood Sts.<br />\nclimax. The Seniors broke up<br />\nthe<br />\nwhile<br />\nbanquet,<br />\ntheir own<br />\nFreshmen and Sophs did their<br />\nCO<br />\nTHE<br />\n\"derndest\" to break up each<br />\nknow<br />\nhow<br />\nDo<br />\nyou<br />\nbest<br />\nto<br />\nprovide<br />\nwere<br />\nJuniors<br />\nother's feast, but the<br />\nan income for your old age?<br />\nCollar Hug ClotheS<br />\ncalm and sedate. Only two glasses<br />\nConsult with<br />\nwhen<br />\nBaltimore and LiberyStreets<br />\nwere broken, and these<br />\nW. W. WALKER<br />\nJohnny Stump, perfectly sober,<br />\nII •<br />\n••• II 111 II • II 1111 111<br />\nPLaza 2581 IN 111 II •• eim ass•ss<br />\njumped on a table to lead a final 909 Calvert Bldg.<br />\nHullabaloo for '23.<br />\nFestivities began at 7.45 and<br />\nthe trick menu card had everybody guessing. Some didn't even<br />\nand individuality is offered here at prices that are not<br />\nrecognize the food when it was<br />\nand cannot be underquoted by any house atany time.<br />\nbrought on. After the meal \"Vel11 Besides the reputation of an old-established firm<br />\nvet\" Joe Moran gave a few toasts<br />\nis back of each sale with a guarantee.<br />\nand then brought on the speakJohnny<br />\nMiddleton,<br />\ners. Happy<br />\nSherwood, chairman of the comDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nmittee; Tom Landy, Larry PenneSTREET<br />\nCHARLES<br />\nNORTH<br />\n343<br />\nman and 0. D. Collins gave talks<br />\non college topics, while Dr.<br />\nCharles K. Schwartz, honorary<br />\nclass president, gave a fine manto man talk on ''The Young Man,<br />\nthe Finest Thing in the World.\"<br />\nAnd Medicines and Dressings are required or other Real<br />\nBaughLeRoy<br />\nand<br />\nKirwan<br />\nDallas<br />\nPharmaceutical Service is Needed<br />\nminyoung<br />\na<br />\nwith<br />\nMan scored<br />\nTHINK OF<br />\nstrel show, while Joe Moran,<br />\nIsaac Hamburger and Kirwan<br />\ngave an original sketch which<br />\nTWO STORES:<br />\nMade a big hit while it progressed,<br />\nEutaw Place and North Ave.<br />\nFranklin Sts.<br />\nand<br />\nCharles<br />\nbut ended so abruptly that HarMadison 405<br />\nVernon 890<br />\nMt.<br />\nry Wills almost passed out.<br />\n<br />\nUALITY<br />\n<br />\naHOP<br />\n<br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nORDERS RECEIVED FOR<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\nTransfer and Baggage Express<br />\nBANQUETS<br />\nSMOKERS<br />\nDANCES<br />\nAUTOMOBILE SERVICE<br />\nBy Arrangement<br />\nPHONE. HOMEWOOD 2645-W<br />\nTelephone St. Paul 6987<br />\n<br />\nCOGGINS'<br />\n<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\n<br />\nWhat's this<br />\nNo More Cuts?<br />\nNOT CHAPEL CUTS.<br />\nNOT RECITATION CUTS.<br />\nBut no more shaving cuts. Williams' Shaving Cream has helped abolish them.<br />\n<br />\nYou can '`go into high\" when you climb your<br />\nface with Williams' Shaving Cream. It lathers<br />\ninstantly. And lathers right. Thick and<br />\ncreamy. It softens the meanest bristle. Quick.<br />\nRight down to the very base of every hair.<br />\nNo need to cut chapel,<br />\nrecitation or face when<br />\nyou use a keen razor and<br />\nWilliams' Shavinc,Cream.<br />\nBe skeptical. Prove it<br />\nfor yourself.<br />\nTry it—<br />\ntomorrow<br />\n<br />\nIf an Accident Occurs<br />\n<br />\nFlynson, Westcott and Dunning<br />\n<br />\nu<br />\n<br />\na<br />\n<br />\nrns<br />\n<br />\nlb<br />\n<br />\nShaving Cream<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 19.. 1922<br />\nELECTRICAL ENGINEERING SOCIETY HOLDS SMOKER<br />\n(THE BOOK MART)<br />\nThe Hopkins student branch of<br />\nComplete Stock of<br />\nthe American Institute of Electrical<br />\nMedical Books and College<br />\nEngineers held a smoker last FriRequisites<br />\nday afternoon in the Junior ElecImporters and Dealers in Fine Books trical Engineers' Room, in the Me301 N. CHARLES ST.<br />\nchanical Engineering Building.<br />\nDean John B. Whitehead, Dr. WilBaltimore, Md.<br />\nliam B. Kouwenhoven, Mr. Frederick W. Lee and Mr. John H.<br />\nLampe were the guests of honor.<br />\nt-ft<br />\nBefore the banquet a short business meeting was held in an adjoining room. Here plans were<br />\ndiscussed for forming an alumni<br />\nassociation of the Hopkins A. I.<br />\nI-Ib<br />\nt eXatteriee) E. E. The purpose of this is to<br />\nsecure closer relations between the<br />\nL34m Es H.& OSCAR .1-5\\rif<br />\nundergraduate and practicing elecGOWN<br />\nEre4<br />\nFR<br />\noxie<br />\n6<br />\ntrical engineers.<br />\n29 Baltimore St., East<br />\nDuring the smoker the faculty<br />\nOne Door West of Light St.<br />\nguests delivered short talks of adSOLE AGENTS FOR BALTIMORE<br />\nvice and encouragen-ent. After<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nthis the seniors rendered the Electrical Engineers' Song. Followin<br />\nSurgical<br />\nWhims<br />\nThe Chas.<br />\ninstrument Co.<br />\nSOO N. HOWARD ST., Baltimore, Md.<br />\n<br />\nThe Medical Standard Book Co.<br />\n<br />\nCI<br />\n<br />\nCHECKER TOURNAMENT REACHES<br />\nSEMI-FINALS<br />\nThe checker tournament is speeding up and will be finished in a<br />\nfew days. The semi-finals have<br />\nbeen reached and are being played<br />\nat this writing, the matches between<br />\nI. Scherr vs. Gerber, and Dorcus<br />\nvs. Wilen. The second of these<br />\nmatches has been played, Dorcus<br />\nbeing the lucky mover of the discs.<br />\nAs soon as the finals have been<br />\nsettled, the \"Y\" will award the<br />\nprizes for the tournament.<br />\nthis outburst of humorous music,<br />\nan instrumental quartet was rendered by Kuder, Perlman, Holsopple and Kinnamon.<br />\n<br />\nCLOTHES<br />\n<br />\nSport Clothes<br />\nYou are going to want a sport<br />\nsuit. Ask to see our Newport<br />\nand Brighton models. With<br />\nknickers if desired. $30 to:$40.<br />\n211-213 E. BALTIMORE ST.<br />\nJ. F. APPLE CO.<br />\n<br />\n\"So I'm tolled,\" quoth the bell<br />\nas the sexton grasped the rope.<br />\nSilence is the college yell in the<br />\nschool of experience.<br />\n<br />\nAFTER THE SENIOR BANQUET<br />\n<br />\nLancaster, Pa.<br />\nMANUFACTURING JEWELERS<br />\nMakers of Hopkins Jewelry.<br />\nWrite for Special Designs and Prices<br />\nCall at University P. 0. for<br />\nInformation.<br />\n<br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br />\n<br />\nJ. H. Furst & Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br />\n<br />\nNikola. Tesla<br />\n<br />\nCollege Literature<br />\nL0 VS 4RD and SOUTH STREETS<br />\n<br />\nHess Shoes<br />\nTeach a Lesson in Style<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br />\n<br />\nN. HESS' SONS<br />\n8 E. BALTIMORE ST.<br />\n<br />\nLEMMERT<br />\nMADE TO ORDER<br />\n•<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n19 AND 21 EAST FAYETTE ST.<br />\nSHOES<br />\nfor<br />\nUNIVERSITY MEN<br />\nFor Dress<br />\nFor Sport Wear<br />\nSmart Styles—Best Leathers<br />\nModerate Price:.<br />\n<br />\nWYMAN<br />\nIS W. LEXINGTON ST.<br />\n<br />\n'THE NAME of Nikola Tesla will always<br />\nI be associated with the invention and earlier<br />\n. developments of the induction motor. In fact,<br />\nat one time this type of apparatus was known<br />\nalmost exclusively as the \"Tesla\" motor.<br />\nTesla devised . this motor back near the beginnings of the electrical business, when practically everything was built by \"cut and try\"<br />\nmethods,and none of the accurate analytical processes of later days had been developed. It may be<br />\nsaid broadly that Tesla knew two fundamental<br />\nfacts—first, that if a magnet were moved across<br />\na sheet of conducting metal, it would tend to<br />\ndrag this metal along; and,—second, that the<br />\neffects of such a moving magnet could be produced by suitably disposed polyphase currents<br />\nacting on a stationary magnetic structure.<br />\nPerhaps others, at that time, also knew these<br />\ntwo facts, but if so, apparently they knew them<br />\nonly as two isolated facts. Tesla considered<br />\nthem in combination and the result was the<br />\nTesla motor, or what is now known broadly as<br />\nthe \"induction motor.\" These two facts, in<br />\ncombination, represent a fundamental conception, and all of the many millions of horsepower<br />\nof induction motors in use today throughout the<br />\nworld, are based upon these two fundamentals.<br />\nNaturally, Westinghouse, having fought single<br />\nhanded to advance the alternating current system,<br />\nwas supremely interested in the new type of<br />\nmotor. What if the, new motor did require<br />\n<br />\npolyphase circuits, while all existing circuits<br />\nwere single phase? What if it did require<br />\nlower frequency than any existing commercial<br />\ncircuits? These were merely details of the future<br />\nuniversal alternating system. The important<br />\nthing was to obtain an ideally simple type of<br />\nalternating current motor, which Tesla's invention offered. Tesla furnished the fundamentalidea.<br />\nHe and his associates, working for Mr. Westinghouse, proved that thoroughly operative<br />\ninduction motors could be built, provided suitable<br />\nfrequencies and phases were available. What<br />\nmatter if they did not produce an operative<br />\ncommercial system at the time? What matter if<br />\nit needed the powerful analytical engineers of<br />\nlater date to bring the system to a truly practicable stage—men with intimate constructive<br />\nknowledge of magnetic circuits—men on intimate<br />\nterms with reactive coefficients and other magnetic<br />\nattributes totally unknown to Tesla and his coworkers? In time the motor was made commercial, and it has been a tremendous factor in<br />\nrevolutionizing the electrical industry.<br />\nProbably no one electrical device has had more<br />\nhigh-power analytical and mathematical ability<br />\nexpended upon it than the induction motor.<br />\nThe practical result has been one of the simplest<br />\nand most effective types of power machinery in<br />\nuse-today. Thus Tesla's fundamental ideas and<br />\nWestinghouse'sforesight have led to an enormous<br />\nadvance in the world's development.<br />\n<br />\n\f", "format": "basic_html", "processed": "PRICE 5 CENT<br /><br />\nBALTIMORE, MD., MAY 19, 1922<br /><br />\nVOL. XXVI. No 55<br /><br />\nNINE TO MEET ST. JOHN'S<br />\nBLACK AND BLUE TRACK- LONG-AWAITED 0. D. K. VARSITY TWELVE TO VISIT FRESHMEN HOLD ANNUAL<br />\nAND MARYLAND IN BARBANQUET AT STATE'S<br />\nSWARTHMORE FOR ANSONG BOOK MAKES APMEN TO RUN MARYLAND<br />\nGAIN ATTRACTION<br />\nCAPITAL<br />\nNUAL CLASH<br />\nPEARANCE ON CAMPUS<br />\nTOMORROW AFTERNOON<br />\nMarks Resumption of Athletic Rela- Old<br />\ntions. Thompson and Clark Out<br />\nof the Running.<br /><br />\nFavorites Included in Volume. Coaches Hope for Recovery from Sophomores Scour Country in Vain. Owings and Knecht Scheduled to<br />\nTwirl. State Championship at Stake.<br />\nAttractive Program Offered. Soph<br />\nSlump. Comparative Scores Point<br />\nFive Men Initiated Last<br />\nMaryland Team Strong.<br />\nCapture.<br />\nEscape<br />\nLeaders<br />\nto<br />\nVictory.<br />\nWeek.<br /><br />\nTomorrow afternoon, when<br />\nBelieving that \"Discretion is<br />\nThe hamlet of Swarthmore will<br />\nAfter many postponements and<br />\nsundry delays the 0. D. K. Song- be the scene of the Black and Blue the better part of valor,\" the University of Maryland and St.<br />\nbook was finally put into circula- twelve's activities tomorrow after- Freshman Class packed into eight- John's will be met at Homewood<br />\ntion last Monday. The long- noon, when the Hopkins stickmen een automobiles, journeyed to will mark the first double-header<br />\nlooked-for volume, published by line up against the Garnet. Bright<br />\nhistoric Carvel Hall at Annap- in which the baseball team has<br />\nthe Omicron Delta Kappa Hon- hopes point to the recovery of the<br />\nolis last Monday, where their an- participated this year. U. of M.<br />\norary Fraternity, is very popular, form which has been lacking in the<br />\nnual class banquet was held with- will engage the Black and Blue in<br />\nlations have been renewed, it should as is attested by the number of last few games the Black and Blue<br />\n(the sign of a pur- has played. Swarthmore was easy out a semblance, of interference. first contest at 2.30 P. M., while<br />\nbe of especial interest to everybody green tags<br />\nthe prey for Mt. Washington three The first-year men had as their the tossers from the state's capiupon<br />\nchaser) appearing<br />\nconnected with Hopkins. From all<br />\nweeks ago.<br />\ncampus.<br />\nunwilling guests Buck Bonner tal will cross bats with the Hopindications, Hopkins should win<br />\nPenn pulled a big surprise on<br />\nThe attractive blue books conand Ed Mount, of the Sophomore kins team at 4 P. M.<br />\nwithout difficulty, even thoUgh tain nearly all songs identified with local lacrosse fans in Baltimore by<br />\nMaryland is represented by an<br />\nClass. The Sophomore officers,<br />\nThompson and Clarke will prob- the Black and Blue. Besides those defeating J. H. U. Swarthmore,<br />\nexceptionally strong team, and<br />\nClarke songs which are well known today too, fell before the Franklin Field expecting an assault, had outwitably not be in harness.<br />\nnot been stick wielders in a hot game. By ted their pursuers in the after- has been a consistent winner.<br />\npulled a tendon last Friday in the are several which have<br />\nwidely, sung on the campus for comparative scores, Hopkins holds noon. The two captives, however, Their recent victory over West<br />\nheats of the South Atlantic meet at<br />\nmany years. The scores for the the odds on the Swarthmore play- were caught unawares and car- Virginia by a score of 8 to 2 was<br />\nCharlottesfrille, Va., and Thompsongs were arranged by Douglas ers, as Penn made one more point ried away in triumph to grace the a noteworthy feat. \"Eddie\" Semson has been under the weather Coulter, '21, with the able assist- against the Garnet than against board of the feasters.<br />\nler, one of the star backs of the<br />\nsince the Navy meet. Maryland's ance of Mr. Louis Fisher. The Captain Zoller's men.<br />\nSo well did the Frosh keep College Parkers, will be seen in<br />\nCoach Knipp started last Tues- their plans secret that it was not centerfield for the visitors. Baibest bets are Beers, in the weight songs are selected 'as best repreon a vigorous training sched- until 4.30 P. M. on Monday that ley, U. of M.'s catcher, is a heavy<br />\nday<br />\nthe<br />\nsenting<br />\nuniversity.<br />\nevents; Robertson, in the 880;<br />\nHard drilling at practice is the Sophomores realized that hitter and will bear watching at<br />\nule.<br />\nmembers<br />\nnew<br />\nof<br />\nPugh, in the hurdles, and Crooks, The initiation<br />\nthe rule.from now on. The the banquet was on. The Fresh- all times. It is likely that \"Andy\"<br />\nbe<br />\nto<br />\nK.<br />\nD.<br />\nto the J. H. U. circle of 0.<br />\nin the distance runs. Hopkins will<br />\nmentor believes that it is men feast had been daily await- Nisbet will twirl for Maryland,<br />\nHopkins<br />\ntook place last Thursday night. The<br />\ndepend on Booth in the 880 and<br />\ninitiates were Major Garey, Emil the let-down in practice that is re- ed since the second-year men's and if the big boy is right, the<br />\ntwo mile; Aaronson in the sprints<br />\nSmith, Pierce Brawner, Lawrence sponsible for the ,recent defeats. celebration last Thursday. Ru- Black and Blue will have no easy<br />\nand pole vault, to run up a high<br />\nFenneman, Wm. H. Moore and The most important games of the mors were afloat on Friday, Sat- time solving his slants.<br />\nscore. The 440-yard run will be<br />\nTom Landy. The last three named season lie ahead of the team, so urday and Sunday that the banSt. John's was weakened con-.<br />\ntaken care of by Dorcas, Norwood<br />\nD. Collins and S. A. Mid- every effort will be put forth to quet, was to be held, and upon siderably when Porter, their cap0.<br />\nwith<br />\nand Skinner, as will also the 220.<br />\ndleton will constitute the 0. D. K. come through the remainder of the each occasion were proved false. tain, left to join Jack Dunn's OriSomerville and Milligan, in the disseason with flying colors.<br />\nnext year.<br />\nWhen Monday morning and early oles. They have, however, had a<br />\ncircle<br />\ntance runs, and Hearn, in the high<br />\nThe hard practice this week has afternoon passed without disturb- successful season and St. John's<br />\na<br />\nmen<br />\nrepresent<br />\ngreat<br />\nThese<br />\nfive<br />\nhurdles, should come through in<br />\nnumber of activities. Fenneman is put the team into fine condition. ance it was believed by the Soph can always be counted on to put<br />\ntheir events.<br />\n,Aitor-in-cllief of the Hullabaloo Two men, Coady i-it,r1 Calkins, are leaders that the evening, too, up their best game against HopVerne Booth, fresh from his<br />\nkins. It is interesting to note that<br />\nand president of the Social Science still on the injured list. Pearce would prove without event.<br />\nrecord-breaking performance in<br />\nCoady is still suffering from the<br />\nScouts, however, discovered a former Hopkins student, \"Ed\"<br />\nbe-Dinty\"<br />\nbesides<br />\nMoore,<br />\nClub.<br />\nthe two-mile run last Saturday, will ing editor-in-chief of the NEWS- blow he received a month ago. several carloads of Freshmen sur- Cashell, who made his letter in<br />\ngive Hopkins rooters a chance to<br />\nLETTER, is president of the Dramat- Several new men have shown con- rounding the house of Henry Cal- football last year at Homewood,<br />\nsee him in mid-season form. Beers, ic Club, and the. Publicity Board. siderable skill in the past few weeks lard, president of the second- is covering first base for the St.<br />\nof Maryland, has showed fine form Landy and Middleton are both and their services will be available year men. The word was broad- John's. Opposing Hopkins on the<br />\nall season in the shot put and discus members of the football team and tomorrow.<br />\ncasted and the Sophomore officers mound will be seen either Gray<br />\nand the spectators can depend on a the lacrosse squad. 0. D. Collins<br />\nCromwell played well in the Penn proceeded to make themselves or Tall. There is also a 'possibiligenuine first-class performance in will be manager of lacrosse next game last week. Tom Landy made conspicuous by their scarcity. ty that Smith, the Orange and<br />\nthese events. Robertson has been year, as well as being a member of use of his football ability against Fitzgerald Dunning, secretary of Black shortstop, will hurl, in<br />\ngoing well in the half-mile run, but<br />\nthe Blue Jay business staff and the Navy. Another of Dr. Van Or- the class, had a narrow escape which case Aldrich will move in<br />\nBooth or Edwards will be sure to.<br />\nman's linemen, Middleton, is doing when an automobile load of from right to short and Holmes<br />\nHullabaloo Board.<br />\ngive him a real tussle for first honwell under Johnny Knipp's tute- Freshmen trailed the bus in will cover the right garden.<br />\nors. With Thompson absent in the<br />\nwhich he was riding. The driver, \"Bob\" Owings in all probabililage.<br />\nNEW PUBLICATION TO MAKE<br />\nhurdles, Hopkins will lose some<br />\nAPPEARANCE<br />\nThe lineup will be very much the however, possessed Sophomoris- ty will pitch against the College<br />\nsure points unless another man<br />\nThe editors of Horizons, the new same as in the game against Navy, tic tendencies and he and Gard- Parkers. Bobby has had ten days'<br />\nsteps in and picks up the loose<br />\nner Packard held back the assail- rest since the Navy game and can<br />\nrecently inaugurated by with probable use of some reserves.<br />\npoints. In the other track events the magazine<br />\nbe looked to to give a good acThe whole team is aroused on ac- ants while Dunning 'escaped.<br />\nBlack and Blue should run up such a group of men interested in a field count of the defeat by U. of P.,<br />\nThe Sophomores soon had the count of himself. His battery mate<br />\na heavy score that the final results of ideas and interests which they and are determined to win tomor- wires humming, and automobiles will, probably be Carl Wilson. It<br />\nwill constitute a real victory for felt was not exploited by the ex- row at any cost.<br />\nand men were assembled. While would not be surprising to see<br />\nHopkins over her old rival. The istent Hopkins publications, an<br />\nthis work of organization was Captain \"Andy\" Knecht take the<br />\nLineup:<br />\nHopkins entries are:<br />\nHopkins.<br />\nproceeding the Freshmen were mound in the second game against<br />\nSwarthmore.<br />\nthat their periodical will apRoutson<br />\nAyors<br />\nserenely<br />\nproceding to their des- the Annapolitans. \"Andy\" turned'<br />\n100-yard Dash—Aaronson, Dor- pear on Thursday, May .25, 1922.<br />\nBachman<br />\n.P<br />\nCornell<br />\nTurner<br />\ntination, rending the quiet hills back the St. Johnnies in a tenC P<br />\nLong<br />\ncas.<br />\nThe project is a purely tentative<br />\nZoller<br />\nMiller ......F. D<br />\nand vales of Anne Arundel coun- inning game last year by a 3-2<br />\n220-yard Dash—Dorcas, NorLandy<br />\nSD<br />\nTaylor<br />\none, and its reception by the stuMurphy<br />\nty with Hopkins songs and yells, score and, after his fine showing<br />\n.D<br />\n.T<br />\nJackson<br />\nwood.<br />\nBurnham<br />\nHowell<br />\nwill<br />\nbody<br />\ndent<br />\nits<br />\ncondition<br />\nlargely<br />\nand breathing defiance to the far- against Western Maryland last<br />\nTurnbull<br />\nT A<br />\nBaxter<br />\n440-yard Dash—Dorcas, Norreappearance next fall as an estabdistant Sophomores. At Annap- Saturday, feels capable of repeatBenedict<br />\n...S. A.<br />\nPollard<br />\nwood, Skinner.<br />\nGriffiss<br />\nF A<br />\nLewis<br />\nlished feature of campus activities.<br />\nolis the Freshmen were met by ing the trick this year: In the<br />\nMcDaniel<br />\nClyde .. .0.H.<br />\n880-yard Dash — Edwards, All that the present editorial staff<br />\nParsons<br />\nPage<br />\n..<br />\nH..<br />\n.....I.<br />\nO'Connor and their other event of Knecht pitching, \"Bill\"<br />\nHolmes<br />\nBooth.<br />\ndo<br />\nis<br />\nto<br />\nto<br />\nexattempt<br />\nmeet<br />\nwho had been in seclu- Merrick will cover first. Should<br />\nofficers,<br />\nwill<br />\nTO APPEAR NEXT<br />\n1-mile, Run—Booth, Somerville, 'penses; and, as a result, subscrip- \"HULLABALOO\"<br />\nsion<br />\nin<br />\nthat secluded town since Andy not receive the assignment,<br />\nWEEK<br />\nFenton.<br />\nappear<br />\nfor<br />\nonly<br />\nthe<br />\nwill<br />\nin<br />\ncurthe morning.<br />\nearly<br />\ntaken<br />\nThe 1922 Hullabaloo<br />\ntions will be<br />\nhe will play first and Clayton<br />\nSomerville,<br />\nkun—Booth,<br />\nIn the meantime, the Sopho- will probably take the mound.<br />\n2-mile<br />\nrent number, and at a price of 35 on the campus during the early<br />\npart of next week. R. Dorsey Wat- mores had collected five machines<br />\nMilligan.<br />\ncents.<br />\nLineup:<br />\nThe magazine has so far been kins, editor-in-chief, will distribute and about 40 classmates and had<br />\n120-yard Hurdles—Hearn, CornHOPKINS—Grace, 26.; Reifschneifinanced by private subscription copies of the publication at the begun a systematic search of the der, 3b.; Hayter, rf.; Sharretts, If.;<br />\ning.<br />\namong the editorial board, and it Postoffice from 12:20 to 1 :30 and city. When no traces of the frosh Rich, cf.; Knecht, lb.; Thomas, ss.;<br />\nNorwood,<br />\n220-yard Hurdles —<br />\nappeared, telephone calls were Wilson, c.; Owings, p.<br />\nis hoped that sufficient support on from 3:30 to 4:30.<br />\n_aronson.<br />\nU. OF M.—Paganucci, 2b.; Semler,<br />\nthe campus will be found to insure<br />\nThe Student Activities Card will sent to neighboring points in an<br />\ncf.; Pollock, lb.; Bailey, c.; Burdette,<br />\nBroad Jump—Aaronson, Wickthat these men will not stiffer loss be collected *at the time that the effort to gain information con- rf.; Beachley, If.; Moran, 3b.; Besley,<br />\nham.<br />\nin their attempt to add a distinctive Hullabaloo is given out. These will cerning the missing class. Par- ss.; Nisbet, p.<br />\nHigh Jump—Hearn, Wickham.<br />\nfeature to the life of the Univer- then be tinned over to the Black ents were telephoned, pleaded<br />\nHOPK1NS—Grace, 2b.; ReifschneiPole Vault—Aaronson, Ander- sity.<br />\nand Blue Jay and THE NEWS-LET- with, lied to, all to no avail ; the der, 3b.; Hayter, rf.; Sharretts, If.;<br />\nson.<br />\nSubscriptions may be registered TER for the purpose of checking. Freshmen had covered their Rich, cf.; Knecht, p.; Thomas, ss.; Holland, c.; Merrick, lb.<br />\nGil,<br />\nThrow—Hambleton<br />\nDiscus<br />\nwith Mr. A. D. Emmart, Mr. John<br />\nAll students are requested to traces well.<br />\nST. JOHN'S—Puller, If.; Matthews,<br />\nlonely<br />\na<br />\non<br />\nchase<br />\nAfter a wild<br />\nn.<br />\nHubner, Mr. Savington Crampton, bring their cards Monday so as to<br />\n2b.; Engelke, 3b.; Brown, cf.; Aldrich,<br />\navail<br />\nno<br />\nto<br />\nP. 0. Box 87, or Mr. T. M. Landy, be ready for Hullabaloo's appear- country road proved<br />\nJavelin—Aaronson, Gilpin.<br /><br />\nTomorrow afternoon at 1 P. M.<br />\nthe Black and Blue track team will<br />\nget into action against Maryland<br />\nState's aggregation of runners. As<br />\nthis contest will be the first clash<br />\nwith Maryland since athletic re-<br /><br />\nShot Put—Hambleton, Gilpin.<br /><br />\nat the Athletic Store in the Barn. ance.<br /><br />\nContinued on Page 2, Col. 5<br /><br />\nrf.; Smith, ss.; Cashel!, b.; Boston or<br />\nWeaver, c.; Gray or Tall, p.<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 19, 1922<br />\nSOUTHERN<br />\nINTERCOLLEGIATE CONTRIBUTIONS OF THE<br />\nCOLLEGE NEWSPAPER<br />\nNEWSPAPER ASSOCIATION<br />\nHOLDS SECOND ANNUAL<br />\nTO COLLEGE LIFE<br /><br />\nHopkins News-Letter<br /><br />\nSENIOR CLASS TO HONOR HEROES<br /><br />\nClass Day, with its more or less<br />\nimportant elections, is drawing<br />\nCONVENTION<br />\nThe following editorial won first<br />\nnear. A great deal of thought<br />\n(By Southern Intercollegiate News<br />\nprize in the recent contest conductSubscription<br />\n$2.50<br />\nService)<br />\ned by the Southern Intercollegiate should be given these elections in<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\norder that the best man shall, in<br />\nGreenville, S. C.—Southern col- Newspaper Association:<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\neach case, be chosen. As a guide<br />\nlegiate journalists, who met at FurBy WM. SWOLL SAWYER<br />\nPublished semi-weekly from October to June by the students of Johns man University, Greenville WomManaging Editor, The Emory to those seniors who hesitate, the<br />\nHopkins University.<br />\nNEWS-LETTER recommends the folWheel, Emory University, Ga.<br />\nan's College co-operating, 'April<br />\nBusiness communications should be addressed to the BUSINESS MANIn five distinct fields the college lowing:<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications 28 and 29, in the second annual<br />\nshould be sent to the MANAGING EDITOR.<br />\nHandsomest Man—H. Douglas<br />\nconvention of the Southern Inter- newspaper contributes to college<br />\nTelephone<br />\nHomewood 100 collegiate Newspaper Association, life. These are the student body, Cotton, former All-American quarby sound legislation insured the faculty, alumni, prospective stu- terback on the team representing<br />\npermanency of that infant organi- dents and intercollegiate relation- the American School of CorreBusiness Manager:<br />\nEditor-in-Chief:<br />\nWILLIAM H. MOORE, JR., '23<br />\nGLOVER P. FALLON, '23.<br />\nzation which had its birth at Rich- ships. The newspaper is a strong spondence. The original siren of<br />\nManaging Editor:<br />\nmond last spring.<br />\nfactor in developing student opin- the geology trip.<br />\nJ. HUDSON HUFFARD,'23<br />\nIn the two-day meeting speakers<br />\nClass Politician—J. A. Bauernion, and simultaneously is a potent<br />\nAssistant Managing Editor:<br />\nAdvertising Manager:<br />\nof note were heard on different<br />\nJOSEPH S. LEOPOLD, '24.<br />\nschmidt,<br />\nwhose dirty political methDONALD K. VANNEMAN, '23.<br />\nphases of newspaperism, round ta- agency in developing student ods, clever stump<br />\nAssociate Editors:<br />\nspeeches and<br />\nble discussions took place, business thought. Without the college news- never-tiring campaigns<br />\nRIGNAL W. BALDWIN, JR., '23<br />\nhave atsessions were held, and the annual paper the proper college spirit tracted the attention<br />\nJunior Editors:<br />\nof every conAssistant Business Managers:<br />\nbanquet with other lighter features would be difficult to develop and gressman and have<br />\nRANDOLPH NORWOOD, '24.<br />\neven inspired<br />\nBERNARD C. HEARN,'23.<br />\nwere enjoyed.<br />\nT. REESE MARSH, '24.<br />\nconserve. The appeal of actual ac- His Honor, the municipal stadium<br />\nFITZGERALD DUNNING, '24.<br />\nG. COCHRAN DOUB, '23.<br />\nEmory University, Ga., won first<br />\nPHILIP. W. HOWARD, '25.<br />\nT. CLYDE ROUTSON, '23.<br />\ncomplishments, as /related in the builder.<br />\nD. MILES MARRIAN, '25.<br />\nplace<br />\nin<br />\nboth<br />\nthe<br />\nR. C. TILGHMAN,'25.<br />\nEditorial<br />\nContest<br />\nBest Athlete—H, Peirce BrawG. DONALD GIESKE, '25.<br />\nnewspaper, gives the college newsWILLIAM G. DEAN, '24.<br />\nand Journalistic Contest, and, likeD. H. STEVENSON, JR., '25.<br />\nner (\"H.\" for Horses), former<br />\nJOHN W. PARSONS,'25.<br />\nJ. D. SLAUGHTER, '23.<br />\nwise, the convention selected paper predominance for this pur- street cleaner in the<br />\nBENJAMIN T. ROME, '25.<br />\none-horse town<br />\nCharles H. Deterly, of the same pose over all other mean's. The of Shovelsburg.<br />\nQualified through<br />\nschool, as president, to succeed disseminating of news and infor- his ability to toss<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nthe male of the<br />\nChas. F. Leek, of the University of mation tends to promote unity in species bovina.<br />\nRichmond. Other winners in con- student body,<br />\nMost Popular Man—Treasurer<br />\nand it brings about<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nMd. tests were: Editorial, C. J. Broome,<br />\nNaviasky,<br />\nof Spanish blood, but of<br />\na closer bond between the students<br />\nof Mercer University, Ga., second,<br />\ngood heart. Elected treasurer beBALTIMORE, MD., MAY 19, 1922<br />\nand Seth M. Mimming, of Pied- themselves. Through no other cause of the \"ask\"<br />\nin his name—<br />\nmont College, Ga., third; Journal- means can all or any part of the and he has been<br />\nasking ever since.<br />\nistic, The Richmond Collegian, students be reached as effectively<br />\nMost Active Man—J. B. Wells,<br />\nANOTHER STEP IN THE RIGHT DIRECTION<br />\nUniversity of Richmond, Va., sec- or as quickly as through the news- formerly of tank<br />\ncorps, though he<br />\nThe decision of the Freshman Class to hold the annual Freshman- ond, and The Orange<br />\nand White, paper.<br />\nsaw most of service on the foam<br />\nSophomore fight on some night, next year, other than that of the Y. IN I. Cniversity of Tennessee, third.<br />\nThe college newspaper fosters a with the good schooner Red-Eye.<br />\nThe Henry Grady District, comHe is a track man and .won his<br />\nC. A. reception, is a commendable one. It has always been very disprising States of North Carolina, closet and more intimate relation- \"H\" in his first<br />\nyear (Havre de<br />\nconcerting to the speakers at this reception to face a crowd of eager, South<br />\nCarolina, Georgia and Flor- ship between the students and fac- Grace). Future<br />\nvocation—christenexpectant firstirear men—eager and anticipatory of the conflict which<br />\nis ida, took first place in the member- ulty. The faculty can exert a con- ing battleships.<br />\nto follow. Little wonder that these uninformed greenies return the ship drive with the admittance of trolling and disciplining influence<br />\nMove nominations be closed!<br />\nnine new members, namely: Geor- over the students through advising,<br />\nweek later to inquire innocently \"What is the Student Council?':<br />\nor gia Tech, Mercer, Piedmont and<br />\nsuggesting and requesting certain FRESHMEN HOLD BANQUET AT<br />\n\"What is the 0. D. K.?\"<br />\nAgnes Scott, of Georgia; Furman,<br />\nANNAPOLIS<br />\npolicies and material for the newsContinued from page 1<br />\nFurthermore, a number of the trembling freshies absent themselves Presbyterian and Greenville Wom- paper. This opportunity properly<br />\nthe time was growing short and,<br />\nan's College, of South Carolina;<br />\nembraced is unsurpassed in it pos- as some<br />\nfrom the reception through mortal fear of the paddle.<br />\nof the murderous tendenand Rollins and Southern, of Florsibilities by any other agency.<br />\ncies of the group had been alleWith the postponement of the encounter, attendance next year ida. Martha Washington, of VirAgain, through the medium of viated by<br />\nthe brisk country air,<br />\nginia; St. John's, of Maryland;<br />\nshould near the 100 per cent. mark. As an introduction to<br />\nthe college newspaper, the love of it was decided<br />\ncollege life Bethany,<br />\nto adjourn.<br />\nof West Virginia, and<br />\nalumni can be fostered, and college<br />\nand institutions, it is imperative that every first-year man attend<br />\nThe<br />\nFreshmen<br />\nthe Trinity, of Washington, were adhad a varied and<br />\nneeds can be presented to them. attractive program<br />\nwelcoming meeting.<br />\nat their celemitted in the Woodrow Wilson disIt is a hit of their Alma Mater that bration which<br />\nproceeded after an<br />\ntrict. From the Henry Watterson<br />\nTo the minds of many, it would be a great improveme<br />\nenables them to keep in touch with enjoyable dinner had<br />\nnt if the<br />\nbeen served.<br />\ndistrict, Georgetown College, of<br />\ncollege life. The college that loses George Darley acted<br />\nClass of '25 would endeavor to schedule the underclass<br />\nbanquets, for Kentucky, was taken in. Virginia<br />\nas toastmastouch with its alumni suffers under ter, and speeches were<br />\nnext year, at some time farther in advance of the examinatio<br />\ndelivered<br />\nns. The had the largest delegation, with unnecessary handicaps.<br />\nby<br />\nR.<br />\nPage<br />\nO'Connor,<br />\npresident<br />\neleven.<br />\nSenior and Junior classes would probably be glad to waive the<br />\nThe newspaper is a tangible ex- of the class; Daniel E.<br />\nold senKlein,<br />\nA Southern Intercollegiate News<br />\niority rule in exchange for the peace of mind that would result.<br />\npression of the activities of college chairman of the banquet commitService for member papers was<br />\nlife which speaks for the college tee; Howard A. Reaney, Nelson<br />\nestablished, with \"centrals\" at Emwherever it goes. The \"High Young and Mr. Justinius Q. Gold,<br />\nory University, Ga., and University<br />\nSchool Special- of some college the latter speaking extemporanof Richmond, Va. Many changes<br />\nnewspapers is a valuable contribu- eously and receiving much apSPEED UP THE JOURNALISTIC CONTEST<br />\nwere made to the original constition, because it reaches the prospec- plause from a good-natured asWould-be Hollander Prize winners continue to turn in their tution, one of the chief being that tive student at the time when first semblage. The program<br />\nconcludeach State be represented on subimpressions are made and the ed with outside. entertainment, inessays for judgment, but there has been, as yet, no great work of<br />\n-ommittees under the chairmanship<br />\nfoundation is laid for college loy- cluding a quartet of dancers, a<br />\ngenius disclosed. A number of these essays have been published in of the three regional vice-presialty and pride. Decisions for a sleight-of-hand performer and an<br />\nour columns as regular News-Letter material, and some of them dents. Wm. Ellyson, Jr., editor of college are often made because of orchestra. Attractive<br />\nsouvenir<br />\nThe Richmond Collegian, was the<br />\nthe appeal which a copy of the col- programs -were distributed.<br />\ncaused comment. Several of these have been satirical essays; sev-,n1y vice-president chosen, and the<br />\nnewspaper had made. The imeral broader attempts at humor, lacking the finer subtleties of the executive committee will select re- lege<br />\nmediate effect on the prospect is SCABBARD AND BLADE TO DINE<br />\ngional heads for the Henry Grady<br />\nformer.<br />\nunlimited in its value to the future<br />\nA dinner will be given by the<br />\nand Henry Watterson districts<br />\ncollege life.<br />\nAny article appearing in the News-Letter from the time of the<br />\nScabbard &amp; Blade Honorary Mililater.<br />\nFurthermore, for the regulatin?,<br />\nannouncement of the contest until the end of the year is eligible in<br />\ntary Society at the Hopkins Club<br />\nThe association incorporated in<br />\nand shaping of college life, some-on Tuesday, May 23, at 6 P. M.<br />\nthe contest. The identity of the writer of any article will be guarded its immediate policy the fostering thing should be known<br />\nof other<br />\nof the organization of State assounless the author gives permission to use his name. This guarantee<br />\ncolleges and their campus life. The This is the last meeting of the year<br />\nciation si that would operate harof secrecy should draw out the most reticent of our budding lit- moniously with the larger Southern college newspaper has limitless op- and a large attendance is expected.<br />\nportunities to print from other colbody.<br />\nerary lights.<br />\nlege newspapers facts and innova- rounding of a student's education.<br />\nAtlanta will be the meeting place<br />\nIt will be interesting to note that of the contestants to date, few<br />\ntions which will tend towards the The printing of reports of differfor the association, April, 1923.<br />\nbetterment and development of the ent society meetings that are of<br />\n-are members of the literary circles of the University. Strange to say,<br />\ncollege life. The spirit and in- an educational value gives to the<br />\nthose who would be expected to be among the foremost to hand in<br />\nAt the recent spring elections, spiration of thought<br />\nfrom another non-member and absentee an intheir contributions have failed, so far, to take active part. Perhaps held at Syracuse University, Allen campus often reacts on college life valuable advantage. The careful<br />\nreporting of public lectures which<br />\nthese and other contestants are holding back their work. It would \\Voodring and George Fisher both to the advantage of all.<br />\nThe educational value of the col- are given on the campus keeps alive<br />\nreceived<br />\n497<br />\nvotes<br />\nfor<br />\nthe<br />\noffice<br />\nof<br />\nbe to their advantage, however, to turn in their article or articles<br />\nPresident of the Student Body. lege newspaper is to be found in all interest in these and extends the<br />\nat an early date, if for no other reason than because Of the everthe fields of its influence. The re- scope of their influence. The eduThe votes will be recounted, and,<br />\nprinting from various sources of cational value depends to a large<br />\napproaching exams. Let us have your literary effort as soon as<br />\nif found to be correct, the vote will<br />\nspeeches, articles and lectures hold extent on the standards and polpossible. The prize is waiting.<br />\nbe retaken.<br />\nhigh value in the polishing and icies of the editorial staff.<br />\nFOUNDED 1897.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 19, 1922<br />\nHOPKINS HISTORY REVEALS<br />\nSOME STRANGE<br />\nFACTS<br /><br />\nPENN HOLDS ANNUAL PANTS<br />\nFIGHT<br /><br />\nIn the annual Pants Fight held<br /><br />\nSeveral Men Lacking Hopkins Diplo- recently at Penn, between the first<br />\nmas Succeed in Ranking<br />\nand second year classes-, the SophFame.<br /><br />\nThe Johns Hopkins University<br />\noccupies all of the town of Baltimore exCept the small portion set<br />\naside for the working class.<br />\nIt is the center of brain power<br />\nand the home of original schemes.<br />\nIt shelters the machinery of the<br />\nChinese Government, as well as the<br />\nmayor of the hidden cities of Rome.<br />\nReal Hopkinsians believe that the<br />\ncity of Boston is a low-brow prep<br />\nschool for the Homewood Utopia.<br />\nThey believe that the Hopkins man<br />\nwho does graduate work at Yale,<br />\nHarvard or Princeton is doing missionary work.<br />\nHopkins satisfied- itself with the<br />\ntitle of state football champion because Lafayette, Washington and<br />\nJefferson did not challenge it for<br />\nthe Atlantic coast title.<br />\nIt will be remembered that<br />\nshortly after the Hopkins unit of<br />\nthe S. A. T. C. was formed, Ger-many surrendered.<br />\nredistinctly<br />\nbe<br />\nalso<br />\nIt should<br />\nwas<br />\nWilson<br />\nMr.<br />\nthat<br />\nmembered<br />\nelected President - of the United<br />\nStates only after he had several<br />\nyears before done historical work<br />\nat Hopkins with Dr. Latane.<br />\nIt is pointed out by students of<br />\nlogic that Mr. Cox, who never attended this university, was defeated<br />\nat the polls.<br />\nIf all of Hopkins' famous men<br />\ncould be stretched out head to foot<br />\nin a chain they would extend from<br />\nthe main entrance of Andy-Landy<br />\nCo. to the Island of Yap, with a<br />\ndetour through Hoboken.<br />\nAmong the famous men not associated with Hopkins are listed<br />\nJack Johnson, Fatty Arbuckle, Pussyfoot Johnson, Curley Byrd, Bill<br />\nStillman,<br />\nHohenzollern, James<br />\nof<br />\nPrince<br />\nPoultney,<br />\nC.<br />\nde<br />\nWalter<br />\nMayor<br />\nand<br />\nArnstein<br />\nWales, Nickey<br />\nBroening.<br /><br />\nomores emerged with a victory.<br />\nAccording to the regulations of the<br />\nfight, if the Sophomores finished<br />\nthe fray with seven or more men<br />\nwearing pants, or what might be<br />\nconsidered as pants, they were to<br />\nbe awarded the fight. This was the<br />\ncase, as thirteen Sophomores with<br />\npants attached were located on the<br />\nfield after the battle.<br />\nNo violations of the rules were<br />\nnoticed either before or after the<br />\nfight. This was especially true in<br />\nthe regulation prohibiting kidnapping until 1 o'clock. But immediately after this time the kidnapping was wholesale on the part of<br />\nboth classes.<br />\nMany individual scraps were<br />\nseen on all parts of the campus,<br />\nusually followed by a kidnapping<br />\nparty. The undergraduates, arElkridge Farms Dairy<br />\nrayed in old and peculiar clothing, Some girls ought to wear speedSTRICTLY FRESH MILK<br />\nstampeded every street in the vi- ometers instead of wrist watches.<br />\nW. University Parkway<br />\nProduced,<br />\nPasteurized and Bottled<br />\ncinity of the University, giving the<br />\nOpposite J. H. U. Athletic Field<br />\nin Howard County<br />\nnumerous spectators many unusual ••• MEM IN II • IN •• III<br />\nEllicott City 23I-R DRUG STORE for J. H. U. BOYS<br />\n111<br />\nI II • • II II II<br />\n• CLARK BROS.<br />\nsights.<br />\n1•41Mmik<br /><br />\nClothes f<br />\n14<br /><br />\nORTMAN'S<br /><br />\nW.L. Mann<br /><br />\nChelsea Pharmacy<br /><br />\nR.G.by&amp; Company<br />\n1<br />\nPHONE, HOMEWOOD 2121<br /><br />\nURNER'S<br /><br />\nBuy an (H) Pipe made special<br />\nfor the Boys<br /><br />\nMEN'S SHOES<br />\nOf the Better Class<br /><br />\nAsiteknir<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\n5he apex<br />\ninfashronable<br />\nneclurffear<br /><br />\nCHAS. E. HERRING<br />\nYour Caterer at Hopkins Dances<br />\nMeet Your Friends in my<br /><br />\nBalcony—Soda Booths<br />\nS. E. Cor. Maryland and North Ayes.<br />\nMUSIC<br /><br />\nDANCING<br /><br />\nAre You Planning A<br />\nJUNIOR CLASS ENDS SEASON WITH<br />\nQUIET BANQUET<br /><br />\nFULL DRESS<br />\nThe fight started promptly at SPORT WEAR<br />\n5:15, and after the Freshman class<br />\nhad placed itself along all four sides<br />\nof the enclosed arena, the Sophomores filed in singly. Many of<br />\nthem were dripping with oil, so<br />\nthoroughly were they saturated.<br />\nThey then formed a circle, with<br />\nCustom<br />\nPresident Bailey in the center.<br />\nIskaurles Street.<br />\nAt the shot of the gun the enEnglish Clothes Tailored in America<br />\n$30to $45<br />\ntire Freshman class closed in on the<br />\nsolid group ,of second-year men.<br />\nThe Sophomores moved in a body<br />\nMt. Vernon 4999<br />\nto a corner of the arena. Here<br />\nMade<br />\nHome<br />\nQuality\"<br />\nthey tried to protect themselves \"Queen<br />\nChocolates<br />\nagainst the advancing Freshmen,<br />\nVISIT OUR ICE CREAM PARLORS<br />\nbut out of the 500 second-year men<br />\n518 N. CHARLES ST.<br />\nCommercial Photography<br />\nwho entered with pants on, only<br />\nCircuit Photography<br />\nthirteen succeeded in coming out<br />\nViews<br />\nFlash Lights<br />\nof the battle wearing anything<br />\nEnlargements<br />\nGroups<br />\nwhich resembled pants.<br />\nKODAK FINISHING<br />\nCharles and 22nd Sts.<br />\n325 N. Howard St.<br />\nOur Greenwich Village friends Delicious Sodas and Sundaes<br />\ntell us that the soul kiss is often.<br />\n• The Best of Candies<br />\nunceremoniously interrupted and<br />\nPrompt &amp; Efficient Service<br />\nabruptly ended by the sole kiss.<br /><br />\nVACATION ABROAD?<br /><br />\nThe tie that<br />\nbinds,<br />\nThere's something<br />\nabout a well selected<br />\nscarf that binds the<br />\nman who buys it to<br />\nthe store which sold it.<br />\nThere's nothing like<br />\na fashion knit tie for<br />\nstyle, for distinction,<br />\nfor wear.<br />\nThey come in plain<br />\ncolors, and in stripes.<br />\n$2.50 and $3.<br /><br />\nIf So, Call on<br />\nAt a banquet, whose savor<br />\nstrongly contrasted with that of<br />\nA. SCHUMACHER &amp; CO.<br />\nthe one of the previous year, the<br />\nPASSENGER<br />\nClass of 1923 made merry on the<br />\nAGENTS<br />\nas<br />\nComing<br />\nTuesday.<br />\nlast<br />\nof<br />\nnight<br />\nits<br />\npostponement,<br />\nto<br />\ndue<br />\nfor all<br />\nit did,<br />\nTrans-Atlantic • Lines<br />\nat the end of the season, the Junior banquet served as a fitting<br />\nCharles &amp; Redwood Sts.<br />\nclimax. The Seniors broke up<br />\nthe<br />\nwhile<br />\nbanquet,<br />\ntheir own<br />\nFreshmen and Sophs did their<br />\nCO<br />\nTHE<br />\n\"derndest\" to break up each<br />\nknow<br />\nhow<br />\nDo<br />\nyou<br />\nbest<br />\nto<br />\nprovide<br />\nwere<br />\nJuniors<br />\nother's feast, but the<br />\nan income for your old age?<br />\nCollar Hug ClotheS<br />\ncalm and sedate. Only two glasses<br />\nConsult with<br />\nwhen<br />\nBaltimore and LiberyStreets<br />\nwere broken, and these<br />\nW. W. WALKER<br />\nJohnny Stump, perfectly sober,<br />\nII •<br />\n••• II 111 II • II 1111 111<br />\nPLaza 2581 IN 111 II •• eim ass•ss<br />\njumped on a table to lead a final 909 Calvert Bldg.<br />\nHullabaloo for '23.<br />\nFestivities began at 7.45 and<br />\nthe trick menu card had everybody guessing. Some didn't even<br />\nand individuality is offered here at prices that are not<br />\nrecognize the food when it was<br />\nand cannot be underquoted by any house atany time.<br />\nbrought on. After the meal \"Vel11 Besides the reputation of an old-established firm<br />\nvet\" Joe Moran gave a few toasts<br />\nis back of each sale with a guarantee.<br />\nand then brought on the speakJohnny<br />\nMiddleton,<br />\ners. Happy<br />\nSherwood, chairman of the comDRAPERIES<br />\nDECORATIONS<br />\nFURNITURE<br />\nmittee; Tom Landy, Larry PenneSTREET<br />\nCHARLES<br />\nNORTH<br />\n343<br />\nman and 0. D. Collins gave talks<br />\non college topics, while Dr.<br />\nCharles K. Schwartz, honorary<br />\nclass president, gave a fine manto man talk on ''The Young Man,<br />\nthe Finest Thing in the World.\"<br />\nAnd Medicines and Dressings are required or other Real<br />\nBaughLeRoy<br />\nand<br />\nKirwan<br />\nDallas<br />\nPharmaceutical Service is Needed<br />\nminyoung<br />\na<br />\nwith<br />\nMan scored<br />\nTHINK OF<br />\nstrel show, while Joe Moran,<br />\nIsaac Hamburger and Kirwan<br />\ngave an original sketch which<br />\nTWO STORES:<br />\nMade a big hit while it progressed,<br />\nEutaw Place and North Ave.<br />\nFranklin Sts.<br />\nand<br />\nCharles<br />\nbut ended so abruptly that HarMadison 405<br />\nVernon 890<br />\nMt.<br />\nry Wills almost passed out.<br /><br />\nUALITY<br /><br />\naHOP<br /><br />\nFURNITURE OF QUALITY<br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nORDERS RECEIVED FOR<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Rennert)<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\nTransfer and Baggage Express<br />\nBANQUETS<br />\nSMOKERS<br />\nDANCES<br />\nAUTOMOBILE SERVICE<br />\nBy Arrangement<br />\nPHONE. HOMEWOOD 2645-W<br />\nTelephone St. Paul 6987<br /><br />\nCOGGINS'<br /><br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br /><br />\nWhat's this<br />\nNo More Cuts?<br />\nNOT CHAPEL CUTS.<br />\nNOT RECITATION CUTS.<br />\nBut no more shaving cuts. Williams' Shaving Cream has helped abolish them.<br /><br />\nYou can '`go into high\" when you climb your<br />\nface with Williams' Shaving Cream. It lathers<br />\ninstantly. And lathers right. Thick and<br />\ncreamy. It softens the meanest bristle. Quick.<br />\nRight down to the very base of every hair.<br />\nNo need to cut chapel,<br />\nrecitation or face when<br />\nyou use a keen razor and<br />\nWilliams' Shavinc,Cream.<br />\nBe skeptical. Prove it<br />\nfor yourself.<br />\nTry it—<br />\ntomorrow<br /><br />\nIf an Accident Occurs<br /><br />\nFlynson, Westcott and Dunning<br /><br />\nu<br /><br />\na<br /><br />\nrns<br /><br />\nlb<br /><br />\nShaving Cream<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 19.. 1922<br />\nELECTRICAL ENGINEERING SOCIETY HOLDS SMOKER<br />\n(THE BOOK MART)<br />\nThe Hopkins student branch of<br />\nComplete Stock of<br />\nthe American Institute of Electrical<br />\nMedical Books and College<br />\nEngineers held a smoker last FriRequisites<br />\nday afternoon in the Junior ElecImporters and Dealers in Fine Books trical Engineers' Room, in the Me301 N. CHARLES ST.<br />\nchanical Engineering Building.<br />\nDean John B. Whitehead, Dr. WilBaltimore, Md.<br />\nliam B. Kouwenhoven, Mr. Frederick W. Lee and Mr. John H.<br />\nLampe were the guests of honor.<br />\nt-ft<br />\nBefore the banquet a short business meeting was held in an adjoining room. Here plans were<br />\ndiscussed for forming an alumni<br />\nassociation of the Hopkins A. I.<br />\nI-Ib<br />\nt eXatteriee) E. E. The purpose of this is to<br />\nsecure closer relations between the<br />\nL34m Es H.&amp; OSCAR .1-5\\rif<br />\nundergraduate and practicing elecGOWN<br />\nEre4<br />\nFR<br />\noxie<br />\n6<br />\ntrical engineers.<br />\n29 Baltimore St., East<br />\nDuring the smoker the faculty<br />\nOne Door West of Light St.<br />\nguests delivered short talks of adSOLE AGENTS FOR BALTIMORE<br />\nvice and encouragen-ent. After<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\nthis the seniors rendered the Electrical Engineers' Song. Followin<br />\nSurgical<br />\nWhims<br />\nThe Chas.<br />\ninstrument Co.<br />\nSOO N. HOWARD ST., Baltimore, Md.<br /><br />\nThe Medical Standard Book Co.<br /><br />\nCI<br /><br />\nCHECKER TOURNAMENT REACHES<br />\nSEMI-FINALS<br />\nThe checker tournament is speeding up and will be finished in a<br />\nfew days. The semi-finals have<br />\nbeen reached and are being played<br />\nat this writing, the matches between<br />\nI. Scherr vs. Gerber, and Dorcus<br />\nvs. Wilen. The second of these<br />\nmatches has been played, Dorcus<br />\nbeing the lucky mover of the discs.<br />\nAs soon as the finals have been<br />\nsettled, the \"Y\" will award the<br />\nprizes for the tournament.<br />\nthis outburst of humorous music,<br />\nan instrumental quartet was rendered by Kuder, Perlman, Holsopple and Kinnamon.<br /><br />\nCLOTHES<br /><br />\nSport Clothes<br />\nYou are going to want a sport<br />\nsuit. Ask to see our Newport<br />\nand Brighton models. With<br />\nknickers if desired. $30 to:$40.<br />\n211-213 E. BALTIMORE ST.<br />\nJ. F. APPLE CO.<br /><br />\n\"So I'm tolled,\" quoth the bell<br />\nas the sexton grasped the rope.<br />\nSilence is the college yell in the<br />\nschool of experience.<br /><br />\nAFTER THE SENIOR BANQUET<br /><br />\nLancaster, Pa.<br />\nMANUFACTURING JEWELERS<br />\nMakers of Hopkins Jewelry.<br />\nWrite for Special Designs and Prices<br />\nCall at University P. 0. for<br />\nInformation.<br /><br />\nSURGICAL INSTRUMENTS<br />\nMicroscopes and Supplies,<br />\nStethoscopes<br />\nBlood Lancets<br />\nBlood Counters<br /><br />\nJ. H. Furst &amp; Co.<br />\nPrinters of Philological and<br />\nScientific Works<br />\n23 S. HANOVER ST.<br />\nBaltimore, Md.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n17 E. Baltimore St.<br />\nPrinters of the<br />\nJohns Hopkins News-Letter<br /><br />\nNikola. Tesla<br /><br />\nCollege Literature<br />\nL0 VS 4RD and SOUTH STREETS<br /><br />\nHess Shoes<br />\nTeach a Lesson in Style<br />\nThey possess the \"dash\" that<br />\nappeals to college men, toned<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nenthusiasm.<br /><br />\nN. HESS' SONS<br />\n8 E. BALTIMORE ST.<br /><br />\nLEMMERT<br />\nMADE TO ORDER<br />\n•<br />\nAND<br />\nFINISHED CLOTHES<br />\nPLAZA BUILDING<br />\n19 AND 21 EAST FAYETTE ST.<br />\nSHOES<br />\nfor<br />\nUNIVERSITY MEN<br />\nFor Dress<br />\nFor Sport Wear<br />\nSmart Styles—Best Leathers<br />\nModerate Price:.<br /><br />\nWYMAN<br />\nIS W. LEXINGTON ST.<br /><br />\n'THE NAME of Nikola Tesla will always<br />\nI be associated with the invention and earlier<br />\n. developments of the induction motor. In fact,<br />\nat one time this type of apparatus was known<br />\nalmost exclusively as the \"Tesla\" motor.<br />\nTesla devised . this motor back near the beginnings of the electrical business, when practically everything was built by \"cut and try\"<br />\nmethods,and none of the accurate analytical processes of later days had been developed. It may be<br />\nsaid broadly that Tesla knew two fundamental<br />\nfacts—first, that if a magnet were moved across<br />\na sheet of conducting metal, it would tend to<br />\ndrag this metal along; and,—second, that the<br />\neffects of such a moving magnet could be produced by suitably disposed polyphase currents<br />\nacting on a stationary magnetic structure.<br />\nPerhaps others, at that time, also knew these<br />\ntwo facts, but if so, apparently they knew them<br />\nonly as two isolated facts. Tesla considered<br />\nthem in combination and the result was the<br />\nTesla motor, or what is now known broadly as<br />\nthe \"induction motor.\" These two facts, in<br />\ncombination, represent a fundamental conception, and all of the many millions of horsepower<br />\nof induction motors in use today throughout the<br />\nworld, are based upon these two fundamentals.<br />\nNaturally, Westinghouse, having fought single<br />\nhanded to advance the alternating current system,<br />\nwas supremely interested in the new type of<br />\nmotor. What if the, new motor did require<br /><br />\npolyphase circuits, while all existing circuits<br />\nwere single phase? What if it did require<br />\nlower frequency than any existing commercial<br />\ncircuits? These were merely details of the future<br />\nuniversal alternating system. The important<br />\nthing was to obtain an ideally simple type of<br />\nalternating current motor, which Tesla's invention offered. Tesla furnished the fundamentalidea.<br />\nHe and his associates, working for Mr. Westinghouse, proved that thoroughly operative<br />\ninduction motors could be built, provided suitable<br />\nfrequencies and phases were available. What<br />\nmatter if they did not produce an operative<br />\ncommercial system at the time? What matter if<br />\nit needed the powerful analytical engineers of<br />\nlater date to bring the system to a truly practicable stage—men with intimate constructive<br />\nknowledge of magnetic circuits—men on intimate<br />\nterms with reactive coefficients and other magnetic<br />\nattributes totally unknown to Tesla and his coworkers? In time the motor was made commercial, and it has been a tremendous factor in<br />\nrevolutionizing the electrical industry.<br />\nProbably no one electrical device has had more<br />\nhigh-power analytical and mathematical ability<br />\nexpended upon it than the induction motor.<br />\nThe practical result has been one of the simplest<br />\nand most effective types of power machinery in<br />\nuse-today. Thus Tesla's fundamental ideas and<br />\nWestinghouse'sforesight have led to an enormous<br />\nadvance in the world's development.<br /><br />"}], "field_media_file": [{"target_id": 37639, "display": null, "description": null, "target_type": "file", "target_uuid": "f5576d2d-2d4c-412c-8210-6aed59a3f4c4", "url": "http://digital.library.jhu.edu/system/files/2022-03/13009-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13009, "target_type": "node", "target_uuid": "58d41941-2d51-4608-8b00-283874760f5e", "url": "/node/13009"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0122f0b4-c78d-4363-8f3d-4895e7dc5ed7"}]}