{"mid": [{"value": 36945}], "uuid": [{"value": "6c0f9f73-e4d1-47c6-8624-449d06c9ac51"}], "vid": [{"value": 36945}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:56:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13107-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:56:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:56:42+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVIII, No 35<br />\n<br />\nHaMEWOOD, BALTIMORE, MD., FEBRUARY 21, 1924<br />\n<br />\nCOMMEMORATION DAY EXERCISES TO<br />\nBE HELD FRIDAY MORNING AT LYRIC<br />\nDr. Herbert Spencer Hadley, Chancellor of Washington University,<br />\nto Be Principal Speaker<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMUSICAL CLUB CONCERT TONIGHT AT MD. CASUALTY CLUB HOUSE<br />\n<br />\n600 ATHLETES OF 30 ORGANIZATIONS<br />\nTO COMPETE IN INDOOR GAMES<br />\nHome Concert of Musical Club Biggest<br />\nFeature in Its Season. Formal Dance<br />\nSATURDAY NIGHT AT ARMORY<br />\nFollowing Concert Important Event<br />\nin University Social Calendar<br />\n<br />\nMeet to Contain 48 Events. Booth, J. H. U., and Lermonde, Boston<br />\nCommemoration Day exercises will be held at the Lyric at 11<br />\nCollege, to Meet in 5,000 Meter Run. Numerous<br />\nEverything is in readiness for<br />\nA. M., on Friday, February 27. The exercises, in conformity with<br />\nOther Features<br />\nthose of previous years, will be of great interest and importance not the annual home concert of the<br />\nAlmost six hundred athletes, including about twenty-five young<br />\nonly to the Johns Hopkins University, but to thousands who have Johns Hopkins University Musibeen influenced by the Baltimore institution. The program, while cal Club, which will be presented women, will compete in the Johns Hopkins-Fifth Regiment Indoor<br />\nnot definitely arranged, will probably be similar to those of other tonight in the auditorium of the Games Saturday night at the Fifth Regiment Armory. These athletes are the representatives of about fifteen universities and the same<br />\nYears. First will be the procession, that most impressive ceremony<br />\nMaryland Casualty Club House.<br />\nnumber of clubs. They include national A. A. U. and intercollegiate<br />\nthat adds a dignity worthy of the occasion. Invocation will be followed by the conferring of degrees. A portrait of Mr. Thomas R. Reports of the ticket sales indi- stars of the first rank. The entries, about 100 more than those of last<br />\nBall, former registrar, will be presented to the University.. The cate that the hall will be filled year's meet, insure one of the most successful meets in recent years—<br />\nand overflowing. Last year the both from a standpoint of interest and of records. The program inprincipal address will be delivered by Dr. Herbert Spencer BARNSTORMERS ADOPT NEW custom was started of holding the cludes forty-three track and five field events.<br />\nHadley, Chancellor of the WashIt is hard to say just what the<br />\nhome concert on the evening beARRANGEMENT FOR<br />\nUniversity. President<br />\nington<br />\nfeature<br />\nrace of the evening will be.<br />\nCASTING<br />\nfore Commemoration Day and it HOPKINS TANKMEN TO ENGoodnow will conclude the exerThere<br />\nwill<br />\nbe features in almost<br />\nCOUNTER RUTGERS AT<br />\nTwo Casts to Be Chosen to Compete is hoped that this custom will beevery<br />\ncises with general announcements. With Each Other for Parts. Keys<br />\nrace.<br />\nThe 100, 220, 440, 880,<br />\nNEW BRUNSWICK<br />\ncome a traditional thing.<br />\nMusic lovers may rejoice in the<br />\n100 low hurdles, 5000 meter run,<br />\nof Club Arrive. Daily Rehearsals<br />\nThe home concert is the big This Meet to Have Important Bearing<br />\nannouncement that the Johns<br />\nhigh jump, shot put, Medley ReA ccording to R recent anon E. I. C. S. A. Championship.<br />\nevent in the season of the Musical<br />\nHopkins Orchestra will render a<br />\nlay<br />\nfor championship of America,<br />\nExpected<br />\nScore<br />\nClose<br />\nnouncement, Coach Swindell, of Club. While it is .not the last<br />\nnumber of selections. The ComPhi<br />\nEpsilon Pi Cup race, South<br />\nthe Barnstormers Club, has adopted concert of the year it is the climax When the Johns Hopkins swimmemoration Day exercises have<br />\nAtlantic<br />\nRelay, and scholastic reof the season and the affair for ming team lines up against Rutnever failed to arouse the enthusi- a new plan for casting this year's<br />\nlays<br />\nall<br />\ncontain star performers<br />\ngers College tomorrow afternoon<br />\nasm of graduates and undergradu- play, which will be \"The Galloper,\" which the club has been earnestly at New Brunswick, plenty of ac- worthy of attention. Past, present,<br />\nates alike, and forms an impressive by Richard Harding Davis. The practicing since October. The tion will follow. This dual meet and future champion's will comoccasion in the life of the univer- main feature of the new arrange- other concerts, those given at Ev- t1<br />\npete in these events.<br />\n1e have an important bearing on<br />\nergreen, McDonogh School, Bel- will<br />\nsity.<br />\nment is the intention of casting two<br />\nIn the 100 and 220 dashes, the<br />\nInter-collegiate<br />\nEastern<br />\nair, Frederick and others, have<br />\nmost formidable men are Clarke,<br />\nPortrait of T. R. Ball to Be Presented candidates for each part.<br />\nChampionship.<br />\nteams<br />\nThese<br />\ntwo<br />\nbeen only preliminaries toward<br />\nto University<br />\nJohns Hopkins; Hill, PennsylvaThe casting in the past has difthe grand finale. Previous to last met last year at the Baltimore<br />\nnia; Bures, Princeton; Barker,<br />\nTo Mr. Thomas R. Ball, former fered from the new system in the<br />\nyear the home concerts were held Athletic Club to decide this honor<br />\nPenn State; Patterson, B. A. C.;<br />\nwill<br />\nrespect<br />\nthat<br />\nHopkins,<br />\nwhile<br />\ntwo<br />\nmen<br />\nJohns<br />\nhave<br />\nregistrar of<br />\nin the Civil Engineering Build- and Rutgers emerged the victor.<br />\nand<br />\nDowding, Georgetown. Of<br />\nbeen<br />\ncast<br />\nfor<br />\neach<br />\npart,<br />\nhitherto<br />\nfall the chief honors of the day.<br />\ning but with the growth and im- This year the Hopkins tankmen<br />\nthese<br />\nClarke is undoubtedly the<br />\none<br />\nhas<br />\nbeen<br />\nregarded as purely an<br />\nThe man that has won the admiraprovement of the Musical Club it believe themselves to have a betfavorite.<br />\nPatterson, B. A. C., won<br />\nunderstudy. This understudy usThe Rutgers<br />\nwas necessary to get a larger hall ter opportunity.<br />\ntion and love of a multitude of<br />\nthe<br />\n100-meter<br />\ndash at the Olymually played some minor part, and<br />\nvictory last year was largely due<br />\nmen now scattered in all parts of his only chance to play the impor- in order to accommodate the<br />\npics in Stockholm in 1912.<br />\neffort<br />\nindividual<br />\nto<br />\nof<br />\ntheir<br />\nthe<br />\nthe world, will be doubly honored tant role was for some accident to crowd. Accordingly the Maryland captain and<br />\nDashes Contain Stars<br />\nstar swimmer, Leo<br />\nCasualty Club House with a seatOn Washington's Birthday. He happen to the regular actor.<br />\nthe<br />\nGiebel,<br />\ncaptured<br />\nbackwho<br />\nThe must formidable athlete in<br />\ning capacity of 1281 was rented<br />\nUnder the new plan, two men for the occasion. That building stroke, the 220-yard swim and the 440 and 880 will be Larry<br />\nWill receive an honorary degree of<br />\nMaster of Arts, and his portrait will be cast for each role, but no proved ideal for such an affair, the succeeding in nosing out the Hop- Brown, Penn A. C., I. C. A. A. A.<br />\nWill be presented to the university. choice will be made between the acoustic properties of the audito- kins anchor man in the last lap of title-holder in 1922. He will optwo until about two weeks before rium are excellent and the ball- the relay. Over 600 subscriptions from all<br />\npose, Edward's, Fifth Regiment,<br />\nthe presentation of the play, which room directly across the hall afThe relay will again play an<br />\nParts of the country wer received will be on March 28 and 29. Thus<br />\nformer Hopkins star; Kerr and<br />\nfords ample space for the lovers important part in the encounter<br />\nMartin, Penn; Klumpp and Crofts,<br />\nas contributions for the portrait. each one will have an equal oppor- of<br />\nand the team winning it will have<br />\nTerpsichore, muse of dance.<br />\nPrinceton; Ascher and Marsters,<br />\nThe presentation will be made by tunity to contest for the part, and<br />\nThe club is under the guidance its advantage.<br />\nGeorgetown; and 'Tammany, NaProfessor St. George L. Sioussat, each one will have ample time to do of the most capable directors in<br />\nFitz Dunning, the Homewood vy. Ascher,<br />\nGeorgetown, is naWho received his A. B. degree in justice to himself and his part be- Baltimore. Mr. Charles H. Bo- captain, is anxious to meet Potts<br />\ntional junior A. A. U. quarter-mile<br />\nfore<br />\nthe<br />\nfinal<br />\nchoice.<br />\nchau, director of the Glee Club, of Rutgers in the breast stroke.<br />\n1896, and Ph. D. in 1899. Profeschamp, and Marsters, his teamPlay Well Adapted<br />\nenjoys<br />\na national reputation as a The Garnet swimmer won from<br />\nsor Sioussat is now Professor of<br />\nAfter having a chance to observe choral leader and instructor on Dunning by inches last year, and mate, ran third to Helfrich and<br />\nEuck, of Penn State, in the half<br />\nAmerican History at the Univer- the candidates for the Club, Mr.<br />\nthe violin and piano as well. Mr. administered the' only defeat sufin last year's intercollegiates.<br />\nsity of Pennsylvania. Dr. Robert Swindell declared the. Barnstorm- Bochau has been associated<br />\nwith fered by the Black and Blue nataThe 5,000-meter run contains<br />\nBruce Roulston, Associate Profes- ers' choice of a play a wise one, the Peabody Conservatory of tor in a dual meet during the past<br />\ntwo men of national reputation in<br />\nsor of German at Johns Hopkins, and exceptionally adapted to a fine Music for over twenty-five years. two seasons.<br />\nBooth, of Johns Hopkins, and Lerchairman of the committee on the presentation by the local talent. Al- Mr. George H. McCauley, leader<br />\nIn the backstroke McCleary monde, of Boston College. This<br />\nPortrait, stated that men in all sec- though a good quota of candidates of the Banjo Club, plays with<br />\nand Hambleton will represent the race should prove a thriller as it<br />\ntions of the United States are have come out for the show, the Fisher's Orchestra and is considBlue Jays. This will be Mc- may have a direct bearing on the<br />\neager to attend the presentation. adoption of the new plan makes an ered one of the best banjo players<br />\nCleary's second appearance in Olympic team selections. FarnDr. Herbert Spencer Hadley, unusually large number of openings in Baltimore.<br />\nevent. He won top honors ham, Lafayette, is another entry<br />\nthis<br />\nChancellor of the Washington available. It is not yet too late for<br />\nSeveral solo numbers will ap- against Catholic U.<br />\nin this race worthy of mention.<br />\nUniversity, will be the principal those that are interested to come pear on the program.<br />\nMr. Sater<br />\nwinning<br />\nsucceeded<br />\nin<br />\nWelch<br />\nThe mile run includes Newhall,<br />\nSpeaker. Dr. Hadley -was born at out.<br />\nwill give a piano solo, Mr. Light<br />\nlast<br />\ndashes<br />\nand<br />\n100-yard<br />\nthe<br />\n40<br />\nNavy; Skane and Helme, GeorgeOlathe, Kansas, on February 20, All positions on the property and one on the violin, Mr. McCauley<br />\nagain<br />\nrepeat<br />\nthis<br />\nyear<br />\nand<br />\ntown; Kerr, Penn; and Cavashould<br />\n1872. He received his A. B. de- business boards are not yet filled.<br />\non the banjo, Mr. Boyd on the<br />\nHambleton<br />\nand<br />\nHoward<br />\nyear.<br />\nnaugh,<br />\nBoston College.<br />\ngree from the University of Kan- All who are interested in scenery xylophone,<br />\nand Mr. Scherr on the<br />\nshould register a first and second<br />\nThe 100-yard low hurdles will<br />\nsas in 1892, his LL. B. from the should see Isaac Hamburger, and saxophone.<br />\nMessrs. Hambleton<br />\nNorthwestern University in 1894, those who prefer the business end and Fargo will play a guitar duet. in the 75-foot plunge. Swanson bring together Tom Macdonogh,<br />\nand his LL. D. in 1909. He prac- should apply to George Shriver. Last year the club lost its comedi- has been doing well in the breast C. C. C., co-holder of the world's<br />\nstroke and he is expected to place. record for this event; Al Moore,<br />\nticed law in Kansas City, where he Regular and prompt attendance at ans, Joe Moran and<br />\nDal Kirwan,<br />\nFrom<br />\nGalbraith and Subin are sure Penn State, winner of 120 high<br />\nrehearsals,<br />\nreputation.<br />\nunderstudying and suc- but their place<br />\nwon an enviable<br />\nwill be filled by<br />\nof<br />\ngovernor<br />\nwinners<br />\ncessful as well as unsuccessful tryin the fancy diving. Gal- hurdles at the 1923 Penn Relays;<br />\n1909 to 1913 he was<br />\nWilson Shaffer, who will give a<br />\nbraith is one of the best divers in Aaronson, Y. M. H. A., former<br />\nMissouri, and became, in 1917, Mg-out for parts all count towards dancing stunt.<br />\nthe country and Sabin was Met- Hopkins star; and<br />\nProfessor in Law at the Universi- election to the Club.<br />\nNorton,<br />\nThe program will he as fol- ropolitan champion in high dive Georgetown.<br />\nty of Colorado.<br />\nBarnstormers Keys Arrive<br />\nin 1922. Stone will be the only<br />\nJohns Hopkins students are re- The expectantly awaited keys of lows:<br />\nStars in Field Events<br />\nBlue Jay entrant in this event.<br />\nquested to meet at 10.30 A. M. in the Barnstormers Club finally ar- 1. Glee Club<br />\nThe field events include an open<br />\nthe room under the stage, where rived last Thursday. They are ex- The University Ode<br />\nDevries<br />\nThe following will represent and scholastic high jump and shotthe procession will begin at 10.40 pected to serve as an emllem of 2. Banjo Club<br />\nthe Black and Blue:<br />\nput and a pole vault. Hills, PrinceA. M. The faculty will meet in recognition on the watch chain of Enchantment Waltz<br />\nAlberti 220-yard Relay—Dunning, Lord, intercollegiate shot-put champion;<br />\nMr. Sater<br />\nthe room over the stage at the each member of the Club. Each 3. Piano Solo<br />\nBahlke, and Welch.<br />\nBeers, Maryland, South Atlantic<br />\nactive member of the Club is now Nocturne in F Major<br />\nsame time.<br />\nChopin Fancy Diving—Stone.<br />\nshot-put champion; Plansky, Nor4. Glee Club<br />\nThe exercises will be followed in possession of his key.<br />\n50-yard Dash—Lord and Welch. ton, and Volkmere, Georgetown;<br />\nThe keys were made by Balfour, (a) John Anderson, My<br />\nby a meeting of the Alumni AssoPlunge—Hambleton and Howard. Needs, Penn; Flahive, Boston<br />\nJo<br />\nTurnbull 100-yard Backstroke-7-M cCleary College; Proctor, B. A. C., former<br />\nciation at the dormitory at 8 P. M. after a design chosen by Isaac<br />\nContinued on page 3, col. 2<br />\nOn the same day.<br />\nContinued on page 3, col. 2<br />\nContinued on page 3, col. 1<br />\nContinued on page 4 col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 21, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nMIDWINTER<br />\n<br />\nSUGGESTIONS FOR HOLLANDER PRIZE CONTEST<br />\nContest Open to Whole Undergraduate<br />\nBody<br />\n<br />\nAs has been anounced before, Dr. Jacob Hollander, Pro$2.00<br />\nSubscription<br />\nfessor of Economics, is again offering the Hollander prize for<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nJournalism this year. This is the<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nthird season that the medal has<br />\nbeen offered.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nThe contest will not be conHopkins University.<br />\nfined to the staff of the News-LetVerne Booth and Louis Clarke, ter, but is open to any student at<br />\nBusiness communications should be addressed to the BU.SINESS MANOU bet he is! He's making a trecommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nrepresenting Johns Hopkins at the Johns Hopkins. Any news story,<br />\nmendous hit! She has just told<br />\nshould be sent to the MANAGING EDITOR.<br />\nhim that he has hair like Rudy<br />\nopen letter, poem, or light essay,<br />\nBut he doesn't know<br />\nValentino's.<br />\nWilco Games in New York last<br />\nwhether to pretend that it came that<br />\nsubmitted by an undergraduate<br />\nhe did it with his<br />\nconfess<br />\nthat<br />\nway<br />\nor<br />\nSaturday night, ran second and during the .college year will<br />\nlittle bottle of \"Vaseline\" Hair Tonic.<br />\nbe<br />\nHomewood 100<br />\nTelephone<br />\nHe owes a lot of his manly beauty to<br />\nthird in the 3000 meter run and .100- considered. Dr. John C. French,<br />\nthat bottle. \"Vaseline\" Hair Tonic<br />\npromotes the growth of the hair and<br />\nkeeps the scalp in the healthiest conyard dash, respectively. Booth suc- of the Department of English,<br />\ndition. At all drug stores and student<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nbarber shops.<br />\ncumbed to the speed of Joie Ray. will act as judge of the contest.<br />\nPHILIP W. HOWARD, '25<br />\nJOSEPH LEOPOLD, '24<br />\nCHESEBROUGH MFG. CO.<br />\nIn order to facilitate competiClarke ran third to Murchison and<br />\n(Consolidated)<br />\nManaging Editor<br />\nNew York<br />\nState<br />\nStreet<br />\nAdvertising Mana ger<br />\nMcAllister in the century. Inches tion the News-Letter again offers<br />\nWILLIAM G. DEAN, JR., '24<br />\nA. J. McKAY,'26<br />\nthe following suggestions for arseparated the first two men and<br />\nAssistant Managing Editor<br />\nticles,<br />\nwhich may or may not be<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nClarke was no more than a foot be- followed as the contestant sees fit.<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\nhind. Two yards in the rear of All articles must be written legiRICHARD C. TILGHMAN, '25<br />\nAssistant Business Managers<br />\nClarke was \"Boots\" Lever, ex-Penn bly on one side of the paper<br />\nJOHN W. PARSONS, '25<br />\nD. MILES MARRIAN,'25<br />\nBENJAMIN T. ROME, '25<br />\nEvery\"Vaseline\" Product is recommended everycaptain, and Hill, of Pennsylvania. (typewritten if possible) and<br />\nwhere becizuse ofits absolute purityandeffectiveness.<br />\nCHARLES G. HUTZLER, '24<br />\nG. DONALD GIESKE,'25<br />\nmarked<br />\n\"For<br />\nthe<br />\nMurchison's<br />\ntime<br />\n10<br />\nseconds<br />\nHollander<br />\nwas<br />\nPrize\"<br />\nJOHN T. DixoN, '24<br />\nJunior Editors<br />\nflat, equaling the world's record with the name of the author. ArC. EUC.ENE TOVELL,'24<br />\nARTHUR L. NELSON, '26<br />\nfor 100 yards indoors.<br />\nticles should not exceed 500<br />\nERNEST A. STRATHmAisi, '26<br />\nOTHO J. KELLER, III, '26<br />\nALGER G. Hiss, '26<br />\nJ. JACKSON KIDD, '26<br />\nwords in length. Contributions BOWERY BALL TOMORROW<br />\n* * *<br />\nEDWARD 0. MICHEL, '26 •<br />\nT. STRAN SUMMERS, '25<br />\nNIGHT<br />\nmay be placed in the News-LetJAMES YOUNG, '25<br />\nClarke may repeat Murchison's<br />\nHEYWARD E. BOYCE, JR., '27<br />\nHENRY R. TURNBULL, '26<br />\nter<br />\nBox<br />\nat<br />\nthe<br />\nUniversity<br />\nPostThe<br />\nBowery<br />\nBall tomorrow night<br />\nHAROLD S. GOODWIN, '26<br />\nperformance of 10 seconds at the<br />\noffice.<br />\npromises to be a most unique afJohns Hopkins-Fifth Regiment<br />\nSuggestions<br />\nfor<br />\narticles<br />\nfair.<br />\nare<br />\nThis year's Junior Class inias<br />\nMeet on Saturday night. Coach Le<br />\nMember Southern Intercollegiate Newspaper Association<br />\nfollows:<br />\nCato clocked Clarke at that time in<br />\nated the idea of substituting somePractice this week. In the 100 Sat1. A'news story on:(a) Life at thing new for the usual formal<br />\nurday night, the event is handi- the Memorial Dormitory; (b) Junior Dance,<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nand its venture bids<br />\ncapped, and this should press New Chemical Laboratory, based<br />\nfair to be a success. \"Bowery\" is<br />\nClarke to his best indoor effort.<br />\nn interviews and first hand obHOMEWOOD, BALTIMORE, MD., FEBRUARY 21, 1924<br />\nthe keynote of the whole affair, and<br />\nservation.<br />\n* * *<br />\nthe staid Civil Engineering Hall<br />\n2. A special feature article on:<br />\nIn trying to compare the swimwill have the appearance of a downming teams of Rutgers and Johns (a) How Hopkins Students earn<br />\n\"YOU'RE STUDYING MEDICINE!\"<br />\nHopkins, who engage tomorrow money in the summer; (b) How town dance hall. In addition to<br />\nDespite the fact that the undergraduate school has grown enor- night at New Brunswick in the Hopkins Alumni are,serving the regular rough-neck\" costumes<br />\nmously, that undergraduate activities on a large scale have risen over- meet which undoubtedly will de- city and state; (c) Music at Johns there will be other typically \"hard\"<br />\ncide the championship of the E. I. Hopkins; (d) What former Ad- features. The orchestra will stage<br />\nnight, and that these activities have been widely advertised, 'still<br />\nC. S. A. this colyumist reached the ams prize winners are doing.<br />\na full-fledged union strike, and<br />\nHopkins often connotes only \"medicine.\" The knowledge that Arts conclusion<br />\n3. An account (in journalistic during the course of the evening<br />\nthat the winner of the<br />\nand Science and Engineering courses may be obtained at Homewood relay will be the winner of the style) of a lacrosse or baseball \"de joint\" will be raided (maybe<br />\nhas not been broadcasted to a sufficient degree.<br />\nmeet. The events ought to run game.<br />\nwith good cause). Appropriate fafairly close. The relay makes a<br />\nthe Mailbag on: vors are to be given, the exact na4.<br />\nA<br />\nletter<br />\nto<br />\nWe have all heard the retort, \"Oh, you're studying medicine !\"<br />\ndifference of 16 points, enough to (a) Free speech in the classroom; ture of which is a jealously guardafter informing some well-meaning soul that we were attending Johns<br />\nwin the meet for either team.<br />\n(b) the humorous or whimsical ed secret. No doubt the refreshHopkins. And we have all shuddered with disgust. Until this retort<br />\naspect of some student customs ments will be corn beef and cab* * *<br />\nis eliminated from all vocabularies, each Hopkins undergraduate has<br />\nor experience.<br />\nbage.<br />\nCornell is still leading the Intera duty to fulfill.<br />\ncollegiate Basketball League, having registered four wins against<br />\none beating. Columbia is second,<br />\nwith three victories and one deREMEMBER THANKSGIVING<br />\nfeat.<br />\nDartmouth, Pennsylvania,<br />\nFrom the first of September until Thanksgiving Day the football<br />\nYale and Princeton follow in that<br />\nteam was served a never-changing diet. \"Beat Maryland\" was order. Cornell has a scrappy, welldrilled into the eleven daily. Repetition must have had its effect for drilled team this year and should<br />\nthe Black and Blue surprised even its coaches by its never-to-be-for- win the title by defeating Columbia. It would be Cornell's first<br />\ngotten exhibition on November 29.<br />\nchampionship in this branch of<br />\nWith the remembrance of this feat in mind we want to inaugusport.<br />\nrate, two months in advance, another slogan, a slogan to be repeated<br />\n* * *<br />\nnot only by members of the lacrosse team, but by the entire underIt seems more than rumor that<br />\ngraduate body. And as the football team planned weeks ahead and next winter will see the inaugurasubordinated everything to the Maryland game, so should the la- tion of a new collegiate basketball<br />\nleague composed of Rutgers,<br />\ncrosse twelve's main object always be to BEAT NAVY.<br />\nSwarthmore, Lehigh, New York<br />\nFor years Hopkins stood supreme and practically unrivalled in University, Lafayette and Johns<br />\nthe lacrosse world. And then Navy rose. Possessing unlimited Hopkins. These. teams seem to be<br />\nmaterial, the Sailors took up the Indian game and, in a short time, evenly matched and a hard-fought<br />\nwere disposing of all opponents in quick order. The Hopkins twelve schedule should result. According<br />\nto Ray Van Orman, Athletic Dihas been defeated by the Midshipmen for the last seven years.<br />\nrector at J. H. U., Hopkins would<br />\nBeating Navy seems to be a difficult task. And so was holding more than favor this project. Lack<br />\nNotice the hats that still look<br />\nthe conquerors of Penn a difficult task. In fact, it seemed well-nigh of a suitable place to practice and<br />\nimpossible to all except the eleven men who started in the game. to hold games is the only thing that<br />\nfresh and new. Inside you<br />\nNavy is strong. And so was Maryland strong; so strong that the would prevent Hopkins from having a basketball team.<br />\nwill see the word Stetson.<br />\nYale eleven, said to be the most powerful in the East, nearly succumbed. Maryland undoubtedly possessed better material. It was<br />\nthat intangible something called \"spirit,\" the determination not to be<br />\nFRATERNITY NOTICE<br />\nbeaten that made the 1923 football team famous.<br />\nAll fraternity data for HulIf any member of the lacrosse squad feels the least bit squeamlabaloo must be given to<br />\nish at thoughts of the Navy contest, we would advise him to rememLeopold by Monday, Februber Thanksgiving. Navy at lacrosse could not loom more formidable<br />\nary 25.<br />\nawarrxrimorarrwriwrromunrvnemftrwrinertorrirowsvamemnemvii6,<br />\nthan Maryland at football. And look what happened.<br />\n<br />\nSPORTING<br />\nBUNK<br />\n<br />\nTHRILLED?<br />\ny<br />\n<br />\nasehne<br />\nREG. U.S. PAT. OFF.<br />\n<br />\nHAIR TONIC<br />\n<br />\nAMAIIII.101111.1•101161AMMINNI........110,11N+11.1.dii1C-11<br />\n<br />\n11•161/1•MWOWNY11111.41411.1.1T,..........<br />\n.111.1<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n<br />\n1<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, FEBRUARY 21, 1924<br />\n<br />\n3<br />\n<br />\nROBBIN'S STYLE BUILT HATS<br />\n<br />\nMID-YEAR COMMENCEMENT WEEK SCHEDULE<br />\n<br />\nFOR YOUNG MEN<br />\n<br />\nFEBRUARY 21<br />\n<br />\n122 W. BALTIMORE ST.<br />\n<br />\n8.00 P. M.—Musical Club Concert at Md. Casualty Club House.<br />\nFEBRUARY 22<br />\n10.15 A. M.—Students assemble in Lower Hall of Lyric.<br />\n10.30 A. M.—Alumni and candidates for degrees assemble in lower hall on Md. Ave.. Trustees<br />\nand Faculty assemble in hall over main lobby (Little Lyric). Official guests<br />\ninvited to join procession in same hall.<br />\n<br />\nALWAYS USE A<br />\n<br />\nYELLOW CAB<br />\nOR PHONE<br />\n<br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br />\n<br />\n10.45 A. M.—Procession enters auditorium.<br />\n11.00 A. M.—Commemoration Exercises begin.<br />\n<br />\nLIBERTY ST.<br />\n<br />\n8.00 P. M.—Eighteenth Annual Alumni Bang uet at Alumni Memorial Dormitory.<br />\n9.00 P. M.—Bowery Ball in C. E. Hall.<br />\n<br />\nAT SARATOGA<br />\n<br />\nSALESMAN:<br />\nWe want a live wire salesman<br />\nto represent us on the campus.<br />\nOne who wishes to make some<br />\neasy money putting in a few<br />\nhours of spare time—interviewing<br />\n-profs- and students—to sell<br />\nFord Cars. To the right man we<br />\nhave a regular position when college closes. Call immediately at<br />\n325 Park Avenue. Ask for Mr.<br />\nLong or Mr. Watson.<br />\n<br />\nC. A. GOODWIN<br />\n325 PARK AVENUE<br />\n<br />\nLUNCHEON<br />\nTEA<br />\n<br />\nFEBRUARY 23<br />\n<br />\nDINNER<br />\n<br />\n7.30 P. M.—Johns Hopkins-Fifth Regiment In door Games.<br />\n11.30 A. M.<br />\nuntil<br />\n7.30 P. M<br />\n<br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br />\n<br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\ns er v e d, and reasonably<br />\npriced—is at<br />\n<br />\nPLAYSHOP GIVES MONTHLY BARNSTORMERS ADOPT NEW POLI- BETA CIRCLE TO BE REPRECY FOR CASTING<br />\nPRODUCTION. DR.<br />\nSENTED AT 0. D. K.<br />\nThe Flag, Banner & Pennant Shop<br />\nContinued<br />\nfrom page 1<br />\nLITZ STARS<br />\nCONVENTION<br />\n(Successors to Sisco Brothers)<br />\nHamburger, manager of the Club.<br />\nThe Homewood ,Playshop proG. M. Shriver, Jr., will be the Flags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nduced three one act plays in its They are square, black enameled delegate of<br />\nBeta Circle at the anSocieties and Fraternities<br />\nkeys,<br />\nbearing<br />\nraised<br />\na<br />\ntragic<br />\nmask<br />\nmonthly performances last Thurs302<br />\nPARK<br />\nAVE., BALTIMORE, MD.<br />\nnual<br />\nOmicron<br />\nDelta Kappa convenday, Friday and Saturday nights. in gold in the center. Across the<br />\nVernon 2355<br />\nR. H. Taylor<br />\nLady Gregory's \"The Rising of the bottom is the word \"Barnstormers\" tion to be held at Centre College,<br />\nMoon,\" \"Ati-nosphere,\"- and \"For in raised gold letters. On the back February 22 and 23. The HopFor<br />\nFor<br />\n1817 N. Charles St.<br />\nDistinguished Service\" were on the is engraved the name of the owner kins Circle will be further repreand<br />\nthe<br />\ndate<br />\nof<br />\nFOUNTAIN<br />\nhis<br />\nelection<br />\nthe<br />\n,to<br />\nGENERAL<br />\n(Half Block below North Ave.)<br />\nbill.<br />\nsented at Danville by H. D. Cotton,<br />\nClub.<br />\nPENS<br />\n,<br />\nUSE<br />\n\"The Rising of the Moon\" was<br />\nRehearsals will be held six times '22, who is the National Publicity<br />\nManufactured by<br />\nNicholas Brown, Mgr.<br />\neasily the best of the three, in acta week for all members of the cast: Secretary of 0. D. K. At least<br />\nWIGHT & HUMPHRIES<br />\ning, production, and as a piece of<br />\nMonday, Tuesday, Thursday and one delegate from each circle will<br />\nplay writing. Dr. Francis Litz litFriday at 7:30 P. M.; Saturday af- be at the convention, including a<br />\nerally \"walked off with the show\"<br />\nternoon at 2 o'clock, and Sunday at representative<br />\nfrom the University<br />\nin this piece. His acting of the<br />\n3 P. M. The principles will probof Alabama, which was recently<br />\nwandering ballad singer's role was<br />\nably have three or four extra reexcellent. The policemen, how0-ranted a charter.<br />\n6<br />\nhearsals a week.<br />\never, appeared to be unnecessarily<br />\nAt the last meeting of Beta CirThere will be a rehearsal and<br />\nawkward. And, as Katrinka says,<br />\ntryout after the Commemoration cle on February 17, the officers of<br />\n\"My Gawd, they are some dumb<br />\nExercises on Friday afternoon, at the circle were re-elected for the<br />\ncops.\"<br />\n2 o'clock.<br />\nsecond half year. Douglas C. TurnFORTY-EIGHTH YEAR OF INSTRUCTION 1923-1924<br />\n\"Atmosphere,\" by a member of<br />\nbull, Jr., President; J. I. Bonner,<br />\nthe Playshop, was a pleasing bit of MUSICAL CLUB CONCERT<br />\nTOnothing. A little of the dialogue<br />\nVice-President; J. E. Mount,<br />\nNIGHT AT MD. CASUALTY<br />\nwas really witty, but nine-tenths of<br />\nCLUB HOUSE<br />\nTreasurer, and Joseph Leopold,<br />\nit appeared to be a bit forced. The<br />\nContinued from page 1<br />\nINSTRUCTION<br />\nSecretary, were again chosen for<br />\nproduction and acting were not es- (b) All Thru the Night<br />\nthese offices.<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of<br />\npecially good.<br />\nBochau<br />\nJ.<br />\nH.<br />\nArts; Doctor of Philosophy.<br />\nCroker<br />\nwas<br />\nappointed<br />\nchair\"For Distinguished Service\" is<br />\n(Mr. Clinton White, Soloist)<br />\nman<br />\nof a committee which is to tour MEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nour idea of a real one.-act play. This 5. Violin Solo<br />\nIMr. Light<br />\nwas well produced, the play is more On Wings of Song..Mendelssohn Maryland prep schools in the COLLEGE OF ARTS AND SCIENC ES. Degree: Bachelor of Arts.<br />\nthan mere talk, and the acting of<br />\nspring. Joe Leopold heads a com- SCHOOL OF ENGINEERING. Degrees: Doctor of Engineering; Mas6 Guitar Duet<br />\nthe two principals was \"just right.\"<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nMessrs. Hambleton and Fargo mittee which is to publish a revised<br />\nChemistry.<br />\nHowever, Miss Brandau at times<br />\nand enlarged edition of the Hopdid appear to be a little too bored. 7. The Blue Jay Six<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Pub(a) Popular Selections.<br />\nkins Song-Book.<br />\nlic Health; Doctor of Science and Bachelor of Science in Hygiene; CerThe stage setting looked like Coles<br />\n(b)<br />\nDancing<br />\ntificate in .Public Health.<br />\nMr. Shaffer<br />\nPhillip's latest stocking \"ad.\" But<br />\n(c)<br />\nXylophone<br />\nSolo____Mr. Boyd<br />\nSCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nit was good.<br />\nBLACK AND BLUE JAY TO<br />\n8.<br />\nTenor<br />\nBanjo<br />\nSolo<br />\nCOLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nOne thing to be noticed at all of<br />\nAPPEAR MARCH FIRST.<br />\nMr. McCauley<br />\nthe Playshop's performances is the<br />\nSUMMER<br />\nCOURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nNEW POLICY ADOPTED<br />\nTosti<br />\nArts or of Science.<br />\nentire absence of undergrads. Right Goodbye<br />\nThe next Black and Blue Jay will<br />\nunder their nose is the best \"little 9. Banjo Club<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nappear on the Campus about March<br />\ntheater\" in the South. Yet not a Coming Thru<br />\nMcCauley<br />\nfirst. The copy has been submitted EVENING COURSES in Business Economics and for Technical Workers.<br />\nglance is given the Playshop as ye 10. Saxophone Solo Mr. Scherr<br />\nand the editors are busy on the macollegiate theater-goer heads for the Saxophobia<br />\nWiedoeft terial. This is<br />\nthe Jay's fourth, and<br />\nMaryland. A little support would 11. Glee Club<br />\naccording to members of the staff,<br />\nhurt neither the student nor the Beautiful Blue Danube<br />\nbest issue. Seven issues will be the<br />\nPlayshop.<br />\nWaltz<br />\nStraus limit for the year, every effort be- JOHNS HOPKINS PRESS PUBLICATIONS.<br />\ning directed to make the last or<br />\nHOPKINS TANKMEN TO ENCOUNTER RUTGERS<br />\nLACROSSE TEAM HARD HIT June Week number a record<br />\nbreaker.<br />\nContinued from page 1<br />\nBY BLACK LIST<br />\nIt is now decided that each memand Hambleton.<br />\nThe Black and Blue team was<br />\nber<br />\nof the Jay's staff will be alswim—Bahlke<br />\n220-yard<br />\nand hit a hard blow by the recent black<br />\nlowed<br />\na key to the office in the MECHANICAL AND ELECTRICAL ENGINEERING—Housing also Physics<br />\nStone.<br />\nlist which bars the activity of<br />\nBUILDINGS<br />\n100-yard Breaststroke—Dunning about a dozen players, among Barn. Formerly keys were held by<br />\nthe Editor-in-Chief and other mem- GILMAN HALL—General library, class rooms, biology, administration.<br />\n(Captain) and Swanson.<br />\nwhom are several that had been<br />\nand College Chemistry.<br />\n100-yard Dash—Welch and Lord. considered as likely candidates by bers of the Board of Control only.<br />\nThis hampered the work of the CIVIL ENGINEERING—Housing also Geology.<br />\nthe coaching staff. Included in<br />\nstaff,<br />\nas free access to the office POWER HOUSE.<br />\nthe list of ineligibles for the spring<br />\ncould not readily be obtained when BOTANY AND PLANT PHYSIOLOGY<br />\n—With Greenhouses and Botanical<br />\nseason are Almy, Bassin, Berndt,<br />\nit was necessary to work., Not to<br />\nGarden.<br />\nBesore, Middleton, Steck, Townbe behind other organizations with CHEMICAL LABORATORY—For graduate<br />\nwork.<br />\nsend, Taylor and W. N. Young.<br />\noffices in the Barn, that allow all PHYSIOLOGI<br />\nCAL BUILDING.<br />\nof their members keys to the rooms,<br />\nANATOMICAL LABORATORY.<br />\nthe Jay has decided on this policy.<br />\nHUNTERIAN LABORATORIES.<br />\nNOTICE<br />\nThe announcement of several apH.& OSCAR G•1-5`<br />\nPATHOLOGI<br />\nCAL LABORATORY.<br />\nSwimming Meet, Hopkins<br />\npointments to the staff of the Jay<br />\nOWN ER<br />\nvs. Lehigh, B. A. C., Februwill be made either at this or the SCHOOL OF HYGIENE.<br />\nki<br />\n:<br />\n)<br />\nl 41\"<br />\nC14141/<br />\nary 29, 8.00 P. M. Dancing<br />\nnext issue. Several places are CARROLL MANSION—Johns Hopkins Club.<br />\n29 E. BALTIMORE ST.<br />\nafter the meet.<br />\nto be filled as soon as the work of STUDENT ACTIVITIES BUILDING.<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\nthe various candidates warrant it. ALUMNI MEMORIAL DORMITORY<br />\n.<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\n;-ht<br />\nif-<br />\n<br />\nni-<br />\n<br />\nleaal<br />\nids<br />\nis<br />\nnd<br />\nall<br />\n<br />\nIn-<br />\n<br />\nto<br />\nles<br />\nd\"<br />\nLge<br />\nnd<br />\n<br />\nng<br />\n<br />\nbe<br />\n[ala•d>11Lb-<br />\n<br />\nThe Johns Hopkins University<br />\n<br />\nLI,AbeX,atierify)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 21, 1924<br />\n<br />\n4<br />\n<br />\nSCHOLARSHIPS OFFERED BY tice. Since the exams a squad of<br />\nabout 30. players has been reporting for practice each afternoon and<br />\nthat number is .steadily growing.<br />\nThe coaches are expected to pick<br />\na tentative list of first string playcan schools and colleges for its fifth ers during the next week in order<br />\nsummer session, July and August to have a definite group with<br />\nwhich to work. This squad is<br />\nof 1924.<br />\nbe liable to change during the<br />\n'to<br />\na<br />\npicturTheatre,<br />\ntheir<br />\nLittle<br />\nIn<br />\naccording to the coaches.<br />\nseason,<br />\nnestling<br />\nbuilding<br />\nesque old wharf<br />\n<br />\nSHIRT MAKER<br />\nLITTLE THEATRE<br />\n226 N. Liberty St.<br />\nDress Shirts...$3.00, $3.50 and $4.00<br />\nThe Gloucester School of the<br />\n$3.30 and $4.40<br />\nNegligee<br />\n$5.50 and $6.60 Little Theatre, Gloucester, MassaImported Madras<br />\nrerms Cash, Less 1 0% 30 days on Shirts chusetts, is offering two scholarAlso a Full Line of Men's<br />\nships to undergraduates of AmeriFurnishings<br />\n<br />\nSTRATTON<br />\n<br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br />\n<br />\nrects<br />\n<br />\nid Lobeorg .. tier<br />\n0011<br />\ncritical.<br />\n<br />\n60,000,000<br />\nPOUNDS<br />\nIN ONE<br />\nTRANSACTION<br />\n<br />\nthe<br />\nor<br />\nin'de<br />\n<br />\nOfl<br />\n<br />\nseetris<br />\n<br />\nRECORD<br />\nOF PURCHASE<br />\nBURLEY<br />\nLouisvr,LE,<br />\ngle sale<br />\nof leafkr.;Jan. 18. TOBACCO<br />\nThe large<br />\nbeen<br />\n<br />\nbids<br />\nco/lec<br />\ncow.<br />\n<br />\nst sintobacco on<br />\nrg<br />\nannounced by<br />\nthe record has just of Ve<br />\nGrowers'<br />\nBurley<br />\nsold to<br />\nCooperative<br />\nTobacco mer<br />\nsixty Liggett & Itlyers Association, which bee,<br />\nmillion<br />\na<br />\nTobacco<br />\nIncluded M thepounds of<br />\nCompany<br />\nBurley Leaf. bee<br />\nquantity ofo/d purchase was<br />\nCig<br />\na very<br />\ns, —the best<br />\nBurley<br />\n.ar possessing Burley ever Tobacco..1922 large priv<br />\nCrop Lef<br />\nan<br />\ngrown<br />\nen Liggett<br />\nunusual qualityin Kentucky, ve<br />\n&<br />\nw- use<br />\nMyers<br />\nand<br />\nit<br />\nin the<br />\nTobacco<br />\nflavor. if<br />\na t.<br />\nknown<br />\nmanufacture ofCompany win<br />\nbrands.<br />\ntheir widely c<br />\nTobacco.<br />\nespeciaily Velvet<br />\ninsuring a<br />\nPull<br />\nSmoking of<br />\nsuperior<br />\nquality.<br />\nA. large<br />\n'delegation of local<br />\nManagers met to and<br />\n• •,.<br />\n<br />\namong the ship-yards and studios,<br />\nATHLETES TO COMPETE IN<br />\nthe Gloucester Players last summer NOTED<br />\nHOPKINS-FIFTH REGIMENT<br />\nproduced almost thirty plays, which<br />\nGAMES<br />\nincluded such pieecs as:<br />\nContinued from page 1<br />\nA Night At An Inn, Dunsany ; Hopkins star high jumper and<br />\nTVurzel-Flummery, Milne ; Riders South and Middle Atlantic chamLimited<br />\nto the Sea, Synge; The Land of pion in this event, and Aaronson,<br />\nBARN CAFETERIA Heart's Desire, Yeats; and Moon Y. M. H. A., Hopkins record holdTide, Clemnets. The school con- er in the pole vault, are some of<br />\nThe year 1922 was a \"vintage chase included a big<br />\ncarry-over<br />\nnected with the theatre offers the men entered in the field events.<br />\nyear\" for Burley tobacco—the from this fine crop.<br />\n,e414.<br />\ne<br />\n.144414q4E EITIEEINEF10101014,1146411'110111114#1014,<br />\ncourses in stage lighting, scenery, Norton, Georgetown, competed for<br />\nbest Kentucky ever grew.<br />\nFine quality—mild, full, mellow<br />\nmake-up,. dancing, public speaking Kansas last year and won the high<br />\nFavored all through the season flavor—this is nothing new for<br />\nwith exceptional tobacco weather Velvetsmokers;but this big supplyand acting. The seven members of jump at the Penn Relays. He was<br />\n—just<br />\nenough warmth and not too is an extra safeguard. The same<br />\nthe faculty include: Mrs. Florence all-around man in the Western inmuch rain—the crop developed a price—mark this well—the same<br />\nEvans, Director of The Boston door season last year.<br />\n\"body\" and character seldom quality as always: \"The best<br />\nSchool of Public Speaking and The<br />\nbefore equaled.<br />\nSpecial Match Relays<br />\nBurley grown in Kentucky.\"<br />\nFlorence Evans Players; Miss<br />\nOur<br />\nrecent<br />\n60-million<br />\n-pound<br />\npurLIGGETT & MYERS TOBACCO CO.<br />\nA number of prominent teams<br />\nFlorence Cunningham, of the Vieux<br />\nare<br />\nengaging<br />\nin<br />\nmatch<br />\nrelays.<br />\n\"The King of Lubricants\" Colombier and founder of The<br />\nThe Medley Relay Championship<br />\nPlayhouse-On-The-Moors and Coof<br />\nAmerica race for the Civitan<br />\nSHERWOOD BROTHERS, INC.<br />\nlin Campbell Clements (author of<br />\nPlays For A Folding Theatre, etc.) Cup will bring together Hopkins<br />\nfiagNgEtERNT4.'NEglff„NIKEINIUMg=g12:=1<br />\nwho with Edna St. Vincent Millay (last year's champion), Boston<br />\nand Eugene O'Neill has been called College, New York University,<br />\none of the founders of a new school Pennsylvania and Pittsburgh. The<br />\nA. JACOBS & SONS<br />\nof American playwriting.<br />\nSouth Atlantic Mile Relay ChamTailors<br />\nLetters for information concern- pionship race will be decided by<br />\nUniforms and Liveries<br />\ning the scholarships to the Glou- the University of Richmond, Wil128 W. FAYETTE ST.<br />\ncester School of the Little Theatre liam and Mary College, Maryland,<br />\nBaltimore, Md.<br />\nNear Liberty St.<br />\nshould be addressed to Miss Flor- and George Washington. Navy<br />\nence Cunningham, 112 Charles St., will meet Lafayette and N. Y. U.<br />\nRoston.<br />\nin a special mile relay. Navy, Baltimore Atheltic Club, and WashLACROSSE TEAM PRACTICING FOR<br />\nCanoe Club meet in a twoington<br />\nCOMING SEASON<br />\nmile<br />\nrelay.<br />\nPoly and City meet<br />\ndry<br />\nwarm,<br />\nComparatively<br />\nfor<br />\nmile<br />\nrelay<br />\nscholastic chamthe<br />\nweather in the last few weeks has<br />\nMEN'S SHOES<br />\npionship<br />\nof<br />\nBaltimore<br />\ncity. Poly,<br />\nenabled the lacrosse squad to put<br />\nOf the Better Class<br />\nEpiscopal<br />\nHigh,<br />\nof Alexanin a good deal of beneficial prac- City,<br />\ndria, Va., and McKinley High, of<br />\nURNER BROTHERS<br />\nand individuality is offered here at prices that are not<br />\nWashington, compete in a halfBMDERS<br />\nPRiBTERS<br />\nEllGRAVERS<br />\nand cannot be underquoted by any house at any time.<br />\n111 E. BALTIMORE STREET<br />\nmile relay. Fork Union Military<br />\nBaltimore<br />\nC.<br />\nBesides the reputation of an old-established firm<br />\nAcademy and Episcopal High<br />\nis<br />\nback<br />\nof each sale with a guarantee.<br />\nSchool meet in a championship<br />\nCollecje Literature<br />\nmile relay for the Phi Epsilon Pi<br />\nCup.<br />\nORDERS RECEIVED FOR<br />\nOther features of the meet in- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nCOGGINS'<br />\nclude a 3,000-meter walk and a<br />\n343 NORTH CHARLES STREET<br />\n75-yard dash for girls. The R.0<br />\nTransfer & Baggage Express<br />\nT. C. will have entire charge of the<br />\nAUTOMOBILE SERVICE<br />\nushering at the meet.<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nEKCIL<br />\n<br />\nHO OM OHO<br />\n<br />\nTfie<br />\n<br />\nHub<br />\n<br />\nBaltiore's Great<br />\nMen's Store<br />\n<br />\nURNER'S<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nOFFICIALS<br />\nHonorary Referee—Hon. Howard<br />\nEstablished 1873<br />\nW. Jackson, Mayor of BaltiA. H. FETTING MAN'FG<br />\nmore.<br />\nJEWELRY CO.<br />\nReferee—Lawson Robertson.<br />\nManufacturers<br />\nStarter—J. V. Mulligan.<br />\nGreek Letter Fraternity Jewelry<br />\nTimers—J. E. Tyler, J. H. Lloyd,<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nJames McCallister, Herbert<br />\nSadtler, Charles Ornstein.<br />\nInspectors — Edward Kirkness,<br />\nPrinters of<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\nGeorge Loos, J. H. Parran, J.<br />\ncrhe Johns Hopkins<br />\nTrueman<br />\nThompson, \\V. R. EdJAS. H. DOWNS<br />\nNE1DS.-LETTER<br />\nwards, Sr., Charles \\Valbert.<br />\nENGRAVER PRINTER STATIONER<br />\nClerk of Course—Latrobe Cogs229 N. CHARLES ST.<br />\nLOMBARD and SOUTH STREETS<br />\nwell.<br />\nChief Relay Clerk—P. K. Moisan.<br />\nAssistant Clerks of Course—J. F.<br />\nBE A NEWSPAPER CORRESPONDENT<br />\nHouck, Dallas Kirwan.<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nTrack<br />\nJudges—George J. Turner,<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nTheodore Straus, G A. Stewart,<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nJ. C. Patterson.<br />\nNEWSWRITERS TRAINING BUREAU<br />\nField<br />\nJudges—Chief: Benjamin<br />\nBuffalo, N. Y.<br />\nTappan, Harry Oehrl, Alexander Cummings, H. H. Lloyd,<br />\nGeorge Hoban, S. J. Poe, L. M.<br />\nPRESCRIPTION DRUGGISTS<br />\nElphinstone.<br />\nScorer—\\V. J. Leimkuhler ; assistTWO STORES:'<br />\nant, R. T. Cox.<br />\nNorth<br />\nAve.<br />\nEutaw<br />\nPlace<br />\nand<br />\nCharles and Chase Sts<br />\nCustodian<br />\nof Prizes—J. F. Kellner.<br />\nMadison<br />\n0405<br />\nVernon 0890<br />\nAnnouncer—William Meyer.<br />\nMarshal—H. H. Lepper.<br />\nThe Greetings of a Fine Store<br />\nHandicapper — Warren Freeburger, A. A. U.<br />\nTo the Students of a Fine University<br />\nChief Medical Officer—Dr. R. T.<br />\nA bercrombie.<br />\n8c<br />\nChief Usher—W. S. Paul.<br />\n<br />\nWhen it comes to clothes, we<br />\nknow what the college man<br />\nwants. And we have it.<br />\n<br />\ny-y4o-rps,<br />\nY.M.B.0.D.<br />\n<br />\nBaltimore & Hanover<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n,X5 Corner c.<br />\nJayelle and 6Putaw Sts.<br />\n-Where Wholesale and Retail Districts Meet-<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\n<br />\n- HOCHSCHILD.KOHN CO.<br />\n<br />\nSafe Deposit & Trust Co.<br />\nOF BALTIMORE<br />\n13 SOUTH ST.<br />\n<br />\nOrganized 1864<br />\n<br />\nJohn J. Nelligan, President<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVIII, No 35<br /><br />\nHaMEWOOD, BALTIMORE, MD., FEBRUARY 21, 1924<br /><br />\nCOMMEMORATION DAY EXERCISES TO<br />\nBE HELD FRIDAY MORNING AT LYRIC<br />\nDr. Herbert Spencer Hadley, Chancellor of Washington University,<br />\nto Be Principal Speaker<br /><br />\nPRICE 5 CENTS<br /><br />\nMUSICAL CLUB CONCERT TONIGHT AT MD. CASUALTY CLUB HOUSE<br /><br />\n600 ATHLETES OF 30 ORGANIZATIONS<br />\nTO COMPETE IN INDOOR GAMES<br />\nHome Concert of Musical Club Biggest<br />\nFeature in Its Season. Formal Dance<br />\nSATURDAY NIGHT AT ARMORY<br />\nFollowing Concert Important Event<br />\nin University Social Calendar<br /><br />\nMeet to Contain 48 Events. Booth, J. H. U., and Lermonde, Boston<br />\nCommemoration Day exercises will be held at the Lyric at 11<br />\nCollege, to Meet in 5,000 Meter Run. Numerous<br />\nEverything is in readiness for<br />\nA. M., on Friday, February 27. The exercises, in conformity with<br />\nOther Features<br />\nthose of previous years, will be of great interest and importance not the annual home concert of the<br />\nAlmost six hundred athletes, including about twenty-five young<br />\nonly to the Johns Hopkins University, but to thousands who have Johns Hopkins University Musibeen influenced by the Baltimore institution. The program, while cal Club, which will be presented women, will compete in the Johns Hopkins-Fifth Regiment Indoor<br />\nnot definitely arranged, will probably be similar to those of other tonight in the auditorium of the Games Saturday night at the Fifth Regiment Armory. These athletes are the representatives of about fifteen universities and the same<br />\nYears. First will be the procession, that most impressive ceremony<br />\nMaryland Casualty Club House.<br />\nnumber of clubs. They include national A. A. U. and intercollegiate<br />\nthat adds a dignity worthy of the occasion. Invocation will be followed by the conferring of degrees. A portrait of Mr. Thomas R. Reports of the ticket sales indi- stars of the first rank. The entries, about 100 more than those of last<br />\nBall, former registrar, will be presented to the University.. The cate that the hall will be filled year's meet, insure one of the most successful meets in recent years—<br />\nand overflowing. Last year the both from a standpoint of interest and of records. The program inprincipal address will be delivered by Dr. Herbert Spencer BARNSTORMERS ADOPT NEW custom was started of holding the cludes forty-three track and five field events.<br />\nHadley, Chancellor of the WashIt is hard to say just what the<br />\nhome concert on the evening beARRANGEMENT FOR<br />\nUniversity. President<br />\nington<br />\nfeature<br />\nrace of the evening will be.<br />\nCASTING<br />\nfore Commemoration Day and it HOPKINS TANKMEN TO ENGoodnow will conclude the exerThere<br />\nwill<br />\nbe features in almost<br />\nCOUNTER RUTGERS AT<br />\nTwo Casts to Be Chosen to Compete is hoped that this custom will beevery<br />\ncises with general announcements. With Each Other for Parts. Keys<br />\nrace.<br />\nThe 100, 220, 440, 880,<br />\nNEW BRUNSWICK<br />\ncome a traditional thing.<br />\nMusic lovers may rejoice in the<br />\n100 low hurdles, 5000 meter run,<br />\nof Club Arrive. Daily Rehearsals<br />\nThe home concert is the big This Meet to Have Important Bearing<br />\nannouncement that the Johns<br />\nhigh jump, shot put, Medley ReA ccording to R recent anon E. I. C. S. A. Championship.<br />\nevent in the season of the Musical<br />\nHopkins Orchestra will render a<br />\nlay<br />\nfor championship of America,<br />\nExpected<br />\nScore<br />\nClose<br />\nnouncement, Coach Swindell, of Club. While it is .not the last<br />\nnumber of selections. The ComPhi<br />\nEpsilon Pi Cup race, South<br />\nthe Barnstormers Club, has adopted concert of the year it is the climax When the Johns Hopkins swimmemoration Day exercises have<br />\nAtlantic<br />\nRelay, and scholastic reof the season and the affair for ming team lines up against Rutnever failed to arouse the enthusi- a new plan for casting this year's<br />\nlays<br />\nall<br />\ncontain star performers<br />\ngers College tomorrow afternoon<br />\nasm of graduates and undergradu- play, which will be \"The Galloper,\" which the club has been earnestly at New Brunswick, plenty of ac- worthy of attention. Past, present,<br />\nates alike, and forms an impressive by Richard Harding Davis. The practicing since October. The tion will follow. This dual meet and future champion's will comoccasion in the life of the univer- main feature of the new arrange- other concerts, those given at Ev- t1<br />\npete in these events.<br />\n1e have an important bearing on<br />\nergreen, McDonogh School, Bel- will<br />\nsity.<br />\nment is the intention of casting two<br />\nIn the 100 and 220 dashes, the<br />\nInter-collegiate<br />\nEastern<br />\nair, Frederick and others, have<br />\nmost formidable men are Clarke,<br />\nPortrait of T. R. Ball to Be Presented candidates for each part.<br />\nChampionship.<br />\nteams<br />\nThese<br />\ntwo<br />\nbeen only preliminaries toward<br />\nto University<br />\nJohns Hopkins; Hill, PennsylvaThe casting in the past has difthe grand finale. Previous to last met last year at the Baltimore<br />\nnia; Bures, Princeton; Barker,<br />\nTo Mr. Thomas R. Ball, former fered from the new system in the<br />\nyear the home concerts were held Athletic Club to decide this honor<br />\nPenn State; Patterson, B. A. C.;<br />\nwill<br />\nrespect<br />\nthat<br />\nHopkins,<br />\nwhile<br />\ntwo<br />\nmen<br />\nJohns<br />\nhave<br />\nregistrar of<br />\nin the Civil Engineering Build- and Rutgers emerged the victor.<br />\nand<br />\nDowding, Georgetown. Of<br />\nbeen<br />\ncast<br />\nfor<br />\neach<br />\npart,<br />\nhitherto<br />\nfall the chief honors of the day.<br />\ning but with the growth and im- This year the Hopkins tankmen<br />\nthese<br />\nClarke is undoubtedly the<br />\none<br />\nhas<br />\nbeen<br />\nregarded as purely an<br />\nThe man that has won the admiraprovement of the Musical Club it believe themselves to have a betfavorite.<br />\nPatterson, B. A. C., won<br />\nunderstudy. This understudy usThe Rutgers<br />\nwas necessary to get a larger hall ter opportunity.<br />\ntion and love of a multitude of<br />\nthe<br />\n100-meter<br />\ndash at the Olymually played some minor part, and<br />\nvictory last year was largely due<br />\nmen now scattered in all parts of his only chance to play the impor- in order to accommodate the<br />\npics in Stockholm in 1912.<br />\neffort<br />\nindividual<br />\nto<br />\nof<br />\ntheir<br />\nthe<br />\nthe world, will be doubly honored tant role was for some accident to crowd. Accordingly the Maryland captain and<br />\nDashes Contain Stars<br />\nstar swimmer, Leo<br />\nCasualty Club House with a seatOn Washington's Birthday. He happen to the regular actor.<br />\nthe<br />\nGiebel,<br />\ncaptured<br />\nbackwho<br />\nThe must formidable athlete in<br />\ning capacity of 1281 was rented<br />\nUnder the new plan, two men for the occasion. That building stroke, the 220-yard swim and the 440 and 880 will be Larry<br />\nWill receive an honorary degree of<br />\nMaster of Arts, and his portrait will be cast for each role, but no proved ideal for such an affair, the succeeding in nosing out the Hop- Brown, Penn A. C., I. C. A. A. A.<br />\nWill be presented to the university. choice will be made between the acoustic properties of the audito- kins anchor man in the last lap of title-holder in 1922. He will optwo until about two weeks before rium are excellent and the ball- the relay. Over 600 subscriptions from all<br />\npose, Edward's, Fifth Regiment,<br />\nthe presentation of the play, which room directly across the hall afThe relay will again play an<br />\nParts of the country wer received will be on March 28 and 29. Thus<br />\nformer Hopkins star; Kerr and<br />\nfords ample space for the lovers important part in the encounter<br />\nMartin, Penn; Klumpp and Crofts,<br />\nas contributions for the portrait. each one will have an equal oppor- of<br />\nand the team winning it will have<br />\nTerpsichore, muse of dance.<br />\nPrinceton; Ascher and Marsters,<br />\nThe presentation will be made by tunity to contest for the part, and<br />\nThe club is under the guidance its advantage.<br />\nGeorgetown; and 'Tammany, NaProfessor St. George L. Sioussat, each one will have ample time to do of the most capable directors in<br />\nFitz Dunning, the Homewood vy. Ascher,<br />\nGeorgetown, is naWho received his A. B. degree in justice to himself and his part be- Baltimore. Mr. Charles H. Bo- captain, is anxious to meet Potts<br />\ntional junior A. A. U. quarter-mile<br />\nfore<br />\nthe<br />\nfinal<br />\nchoice.<br />\nchau, director of the Glee Club, of Rutgers in the breast stroke.<br />\n1896, and Ph. D. in 1899. Profeschamp, and Marsters, his teamPlay Well Adapted<br />\nenjoys<br />\na national reputation as a The Garnet swimmer won from<br />\nsor Sioussat is now Professor of<br />\nAfter having a chance to observe choral leader and instructor on Dunning by inches last year, and mate, ran third to Helfrich and<br />\nEuck, of Penn State, in the half<br />\nAmerican History at the Univer- the candidates for the Club, Mr.<br />\nthe violin and piano as well. Mr. administered the' only defeat sufin last year's intercollegiates.<br />\nsity of Pennsylvania. Dr. Robert Swindell declared the. Barnstorm- Bochau has been associated<br />\nwith fered by the Black and Blue nataThe 5,000-meter run contains<br />\nBruce Roulston, Associate Profes- ers' choice of a play a wise one, the Peabody Conservatory of tor in a dual meet during the past<br />\ntwo men of national reputation in<br />\nsor of German at Johns Hopkins, and exceptionally adapted to a fine Music for over twenty-five years. two seasons.<br />\nBooth, of Johns Hopkins, and Lerchairman of the committee on the presentation by the local talent. Al- Mr. George H. McCauley, leader<br />\nIn the backstroke McCleary monde, of Boston College. This<br />\nPortrait, stated that men in all sec- though a good quota of candidates of the Banjo Club, plays with<br />\nand Hambleton will represent the race should prove a thriller as it<br />\ntions of the United States are have come out for the show, the Fisher's Orchestra and is considBlue Jays. This will be Mc- may have a direct bearing on the<br />\neager to attend the presentation. adoption of the new plan makes an ered one of the best banjo players<br />\nCleary's second appearance in Olympic team selections. FarnDr. Herbert Spencer Hadley, unusually large number of openings in Baltimore.<br />\nevent. He won top honors ham, Lafayette, is another entry<br />\nthis<br />\nChancellor of the Washington available. It is not yet too late for<br />\nSeveral solo numbers will ap- against Catholic U.<br />\nin this race worthy of mention.<br />\nUniversity, will be the principal those that are interested to come pear on the program.<br />\nMr. Sater<br />\nwinning<br />\nsucceeded<br />\nin<br />\nWelch<br />\nThe mile run includes Newhall,<br />\nSpeaker. Dr. Hadley -was born at out.<br />\nwill give a piano solo, Mr. Light<br />\nlast<br />\ndashes<br />\nand<br />\n100-yard<br />\nthe<br />\n40<br />\nNavy; Skane and Helme, GeorgeOlathe, Kansas, on February 20, All positions on the property and one on the violin, Mr. McCauley<br />\nagain<br />\nrepeat<br />\nthis<br />\nyear<br />\nand<br />\ntown; Kerr, Penn; and Cavashould<br />\n1872. He received his A. B. de- business boards are not yet filled.<br />\non the banjo, Mr. Boyd on the<br />\nHambleton<br />\nand<br />\nHoward<br />\nyear.<br />\nnaugh,<br />\nBoston College.<br />\ngree from the University of Kan- All who are interested in scenery xylophone,<br />\nand Mr. Scherr on the<br />\nshould register a first and second<br />\nThe 100-yard low hurdles will<br />\nsas in 1892, his LL. B. from the should see Isaac Hamburger, and saxophone.<br />\nMessrs. Hambleton<br />\nNorthwestern University in 1894, those who prefer the business end and Fargo will play a guitar duet. in the 75-foot plunge. Swanson bring together Tom Macdonogh,<br />\nand his LL. D. in 1909. He prac- should apply to George Shriver. Last year the club lost its comedi- has been doing well in the breast C. C. C., co-holder of the world's<br />\nstroke and he is expected to place. record for this event; Al Moore,<br />\nticed law in Kansas City, where he Regular and prompt attendance at ans, Joe Moran and<br />\nDal Kirwan,<br />\nFrom<br />\nGalbraith and Subin are sure Penn State, winner of 120 high<br />\nrehearsals,<br />\nreputation.<br />\nunderstudying and suc- but their place<br />\nwon an enviable<br />\nwill be filled by<br />\nof<br />\ngovernor<br />\nwinners<br />\ncessful as well as unsuccessful tryin the fancy diving. Gal- hurdles at the 1923 Penn Relays;<br />\n1909 to 1913 he was<br />\nWilson Shaffer, who will give a<br />\nbraith is one of the best divers in Aaronson, Y. M. H. A., former<br />\nMissouri, and became, in 1917, Mg-out for parts all count towards dancing stunt.<br />\nthe country and Sabin was Met- Hopkins star; and<br />\nProfessor in Law at the Universi- election to the Club.<br />\nNorton,<br />\nThe program will he as fol- ropolitan champion in high dive Georgetown.<br />\nty of Colorado.<br />\nBarnstormers Keys Arrive<br />\nin 1922. Stone will be the only<br />\nJohns Hopkins students are re- The expectantly awaited keys of lows:<br />\nStars in Field Events<br />\nBlue Jay entrant in this event.<br />\nquested to meet at 10.30 A. M. in the Barnstormers Club finally ar- 1. Glee Club<br />\nThe field events include an open<br />\nthe room under the stage, where rived last Thursday. They are ex- The University Ode<br />\nDevries<br />\nThe following will represent and scholastic high jump and shotthe procession will begin at 10.40 pected to serve as an emllem of 2. Banjo Club<br />\nthe Black and Blue:<br />\nput and a pole vault. Hills, PrinceA. M. The faculty will meet in recognition on the watch chain of Enchantment Waltz<br />\nAlberti 220-yard Relay—Dunning, Lord, intercollegiate shot-put champion;<br />\nMr. Sater<br />\nthe room over the stage at the each member of the Club. Each 3. Piano Solo<br />\nBahlke, and Welch.<br />\nBeers, Maryland, South Atlantic<br />\nactive member of the Club is now Nocturne in F Major<br />\nsame time.<br />\nChopin Fancy Diving—Stone.<br />\nshot-put champion; Plansky, Nor4. Glee Club<br />\nThe exercises will be followed in possession of his key.<br />\n50-yard Dash—Lord and Welch. ton, and Volkmere, Georgetown;<br />\nThe keys were made by Balfour, (a) John Anderson, My<br />\nby a meeting of the Alumni AssoPlunge—Hambleton and Howard. Needs, Penn; Flahive, Boston<br />\nJo<br />\nTurnbull 100-yard Backstroke-7-M cCleary College; Proctor, B. A. C., former<br />\nciation at the dormitory at 8 P. M. after a design chosen by Isaac<br />\nContinued on page 3, col. 2<br />\nOn the same day.<br />\nContinued on page 3, col. 2<br />\nContinued on page 3, col. 1<br />\nContinued on page 4 col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 21, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nMIDWINTER<br /><br />\nSUGGESTIONS FOR HOLLANDER PRIZE CONTEST<br />\nContest Open to Whole Undergraduate<br />\nBody<br /><br />\nAs has been anounced before, Dr. Jacob Hollander, Pro$2.00<br />\nSubscription<br />\nfessor of Economics, is again offering the Hollander prize for<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nJournalism this year. This is the<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nthird season that the medal has<br />\nbeen offered.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nThe contest will not be conHopkins University.<br />\nfined to the staff of the News-LetVerne Booth and Louis Clarke, ter, but is open to any student at<br />\nBusiness communications should be addressed to the BU.SINESS MANOU bet he is! He's making a trecommunications<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other<br />\nrepresenting Johns Hopkins at the Johns Hopkins. Any news story,<br />\nmendous hit! She has just told<br />\nshould be sent to the MANAGING EDITOR.<br />\nhim that he has hair like Rudy<br />\nopen letter, poem, or light essay,<br />\nBut he doesn't know<br />\nValentino's.<br />\nWilco Games in New York last<br />\nwhether to pretend that it came that<br />\nsubmitted by an undergraduate<br />\nhe did it with his<br />\nconfess<br />\nthat<br />\nway<br />\nor<br />\nSaturday night, ran second and during the .college year will<br />\nlittle bottle of \"Vaseline\" Hair Tonic.<br />\nbe<br />\nHomewood 100<br />\nTelephone<br />\nHe owes a lot of his manly beauty to<br />\nthird in the 3000 meter run and .100- considered. Dr. John C. French,<br />\nthat bottle. \"Vaseline\" Hair Tonic<br />\npromotes the growth of the hair and<br />\nkeeps the scalp in the healthiest conyard dash, respectively. Booth suc- of the Department of English,<br />\ndition. At all drug stores and student<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\nbarber shops.<br />\ncumbed to the speed of Joie Ray. will act as judge of the contest.<br />\nPHILIP W. HOWARD, '25<br />\nJOSEPH LEOPOLD, '24<br />\nCHESEBROUGH MFG. CO.<br />\nIn order to facilitate competiClarke ran third to Murchison and<br />\n(Consolidated)<br />\nManaging Editor<br />\nNew York<br />\nState<br />\nStreet<br />\nAdvertising Mana ger<br />\nMcAllister in the century. Inches tion the News-Letter again offers<br />\nWILLIAM G. DEAN, JR., '24<br />\nA. J. McKAY,'26<br />\nthe following suggestions for arseparated the first two men and<br />\nAssistant Managing Editor<br />\nticles,<br />\nwhich may or may not be<br />\nCirculation Manager<br />\nT. REESE MARSH, '24<br />\nClarke was no more than a foot be- followed as the contestant sees fit.<br />\nJOHN C. LEWIS, JR., '24<br />\nAssociate Editors<br />\nhind. Two yards in the rear of All articles must be written legiRICHARD C. TILGHMAN, '25<br />\nAssistant Business Managers<br />\nClarke was \"Boots\" Lever, ex-Penn bly on one side of the paper<br />\nJOHN W. PARSONS, '25<br />\nD. MILES MARRIAN,'25<br />\nBENJAMIN T. ROME, '25<br />\nEvery\"Vaseline\" Product is recommended everycaptain, and Hill, of Pennsylvania. (typewritten if possible) and<br />\nwhere becizuse ofits absolute purityandeffectiveness.<br />\nCHARLES G. HUTZLER, '24<br />\nG. DONALD GIESKE,'25<br />\nmarked<br />\n\"For<br />\nthe<br />\nMurchison's<br />\ntime<br />\n10<br />\nseconds<br />\nHollander<br />\nwas<br />\nPrize\"<br />\nJOHN T. DixoN, '24<br />\nJunior Editors<br />\nflat, equaling the world's record with the name of the author. ArC. EUC.ENE TOVELL,'24<br />\nARTHUR L. NELSON, '26<br />\nfor 100 yards indoors.<br />\nticles should not exceed 500<br />\nERNEST A. STRATHmAisi, '26<br />\nOTHO J. KELLER, III, '26<br />\nALGER G. Hiss, '26<br />\nJ. JACKSON KIDD, '26<br />\nwords in length. Contributions BOWERY BALL TOMORROW<br />\n* * *<br />\nEDWARD 0. MICHEL, '26 •<br />\nT. STRAN SUMMERS, '25<br />\nNIGHT<br />\nmay be placed in the News-LetJAMES YOUNG, '25<br />\nClarke may repeat Murchison's<br />\nHEYWARD E. BOYCE, JR., '27<br />\nHENRY R. TURNBULL, '26<br />\nter<br />\nBox<br />\nat<br />\nthe<br />\nUniversity<br />\nPostThe<br />\nBowery<br />\nBall tomorrow night<br />\nHAROLD S. GOODWIN, '26<br />\nperformance of 10 seconds at the<br />\noffice.<br />\npromises to be a most unique afJohns Hopkins-Fifth Regiment<br />\nSuggestions<br />\nfor<br />\narticles<br />\nfair.<br />\nare<br />\nThis year's Junior Class inias<br />\nMeet on Saturday night. Coach Le<br />\nMember Southern Intercollegiate Newspaper Association<br />\nfollows:<br />\nCato clocked Clarke at that time in<br />\nated the idea of substituting somePractice this week. In the 100 Sat1. A'news story on:(a) Life at thing new for the usual formal<br />\nurday night, the event is handi- the Memorial Dormitory; (b) Junior Dance,<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nand its venture bids<br />\ncapped, and this should press New Chemical Laboratory, based<br />\nfair to be a success. \"Bowery\" is<br />\nClarke to his best indoor effort.<br />\nn interviews and first hand obHOMEWOOD, BALTIMORE, MD., FEBRUARY 21, 1924<br />\nthe keynote of the whole affair, and<br />\nservation.<br />\n* * *<br />\nthe staid Civil Engineering Hall<br />\n2. A special feature article on:<br />\nIn trying to compare the swimwill have the appearance of a downming teams of Rutgers and Johns (a) How Hopkins Students earn<br />\n\"YOU'RE STUDYING MEDICINE!\"<br />\nHopkins, who engage tomorrow money in the summer; (b) How town dance hall. In addition to<br />\nDespite the fact that the undergraduate school has grown enor- night at New Brunswick in the Hopkins Alumni are,serving the regular rough-neck\" costumes<br />\nmously, that undergraduate activities on a large scale have risen over- meet which undoubtedly will de- city and state; (c) Music at Johns there will be other typically \"hard\"<br />\ncide the championship of the E. I. Hopkins; (d) What former Ad- features. The orchestra will stage<br />\nnight, and that these activities have been widely advertised, 'still<br />\nC. S. A. this colyumist reached the ams prize winners are doing.<br />\na full-fledged union strike, and<br />\nHopkins often connotes only \"medicine.\" The knowledge that Arts conclusion<br />\n3. An account (in journalistic during the course of the evening<br />\nthat the winner of the<br />\nand Science and Engineering courses may be obtained at Homewood relay will be the winner of the style) of a lacrosse or baseball \"de joint\" will be raided (maybe<br />\nhas not been broadcasted to a sufficient degree.<br />\nmeet. The events ought to run game.<br />\nwith good cause). Appropriate fafairly close. The relay makes a<br />\nthe Mailbag on: vors are to be given, the exact na4.<br />\nA<br />\nletter<br />\nto<br />\nWe have all heard the retort, \"Oh, you're studying medicine !\"<br />\ndifference of 16 points, enough to (a) Free speech in the classroom; ture of which is a jealously guardafter informing some well-meaning soul that we were attending Johns<br />\nwin the meet for either team.<br />\n(b) the humorous or whimsical ed secret. No doubt the refreshHopkins. And we have all shuddered with disgust. Until this retort<br />\naspect of some student customs ments will be corn beef and cab* * *<br />\nis eliminated from all vocabularies, each Hopkins undergraduate has<br />\nor experience.<br />\nbage.<br />\nCornell is still leading the Intera duty to fulfill.<br />\ncollegiate Basketball League, having registered four wins against<br />\none beating. Columbia is second,<br />\nwith three victories and one deREMEMBER THANKSGIVING<br />\nfeat.<br />\nDartmouth, Pennsylvania,<br />\nFrom the first of September until Thanksgiving Day the football<br />\nYale and Princeton follow in that<br />\nteam was served a never-changing diet. \"Beat Maryland\" was order. Cornell has a scrappy, welldrilled into the eleven daily. Repetition must have had its effect for drilled team this year and should<br />\nthe Black and Blue surprised even its coaches by its never-to-be-for- win the title by defeating Columbia. It would be Cornell's first<br />\ngotten exhibition on November 29.<br />\nchampionship in this branch of<br />\nWith the remembrance of this feat in mind we want to inaugusport.<br />\nrate, two months in advance, another slogan, a slogan to be repeated<br />\n* * *<br />\nnot only by members of the lacrosse team, but by the entire underIt seems more than rumor that<br />\ngraduate body. And as the football team planned weeks ahead and next winter will see the inaugurasubordinated everything to the Maryland game, so should the la- tion of a new collegiate basketball<br />\nleague composed of Rutgers,<br />\ncrosse twelve's main object always be to BEAT NAVY.<br />\nSwarthmore, Lehigh, New York<br />\nFor years Hopkins stood supreme and practically unrivalled in University, Lafayette and Johns<br />\nthe lacrosse world. And then Navy rose. Possessing unlimited Hopkins. These. teams seem to be<br />\nmaterial, the Sailors took up the Indian game and, in a short time, evenly matched and a hard-fought<br />\nwere disposing of all opponents in quick order. The Hopkins twelve schedule should result. According<br />\nto Ray Van Orman, Athletic Dihas been defeated by the Midshipmen for the last seven years.<br />\nrector at J. H. U., Hopkins would<br />\nBeating Navy seems to be a difficult task. And so was holding more than favor this project. Lack<br />\nNotice the hats that still look<br />\nthe conquerors of Penn a difficult task. In fact, it seemed well-nigh of a suitable place to practice and<br />\nimpossible to all except the eleven men who started in the game. to hold games is the only thing that<br />\nfresh and new. Inside you<br />\nNavy is strong. And so was Maryland strong; so strong that the would prevent Hopkins from having a basketball team.<br />\nwill see the word Stetson.<br />\nYale eleven, said to be the most powerful in the East, nearly succumbed. Maryland undoubtedly possessed better material. It was<br />\nthat intangible something called \"spirit,\" the determination not to be<br />\nFRATERNITY NOTICE<br />\nbeaten that made the 1923 football team famous.<br />\nAll fraternity data for HulIf any member of the lacrosse squad feels the least bit squeamlabaloo must be given to<br />\nish at thoughts of the Navy contest, we would advise him to rememLeopold by Monday, Februber Thanksgiving. Navy at lacrosse could not loom more formidable<br />\nary 25.<br />\nawarrxrimorarrwriwrromunrvnemftrwrinertorrirowsvamemnemvii6,<br />\nthan Maryland at football. And look what happened.<br /><br />\nSPORTING<br />\nBUNK<br /><br />\nTHRILLED?<br />\ny<br /><br />\nasehne<br />\nREG. U.S. PAT. OFF.<br /><br />\nHAIR TONIC<br /><br />\nAMAIIII.101111.1•101161AMMINNI........110,11N+11.1.dii1C-11<br /><br />\n11•161/1•MWOWNY11111.41411.1.1T,..........<br />\n.111.1<br /><br />\nSTETSON HATS<br />\nStyled for young men<br /><br />\n1<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, FEBRUARY 21, 1924<br /><br />\n3<br /><br />\nROBBIN'S STYLE BUILT HATS<br /><br />\nMID-YEAR COMMENCEMENT WEEK SCHEDULE<br /><br />\nFOR YOUNG MEN<br /><br />\nFEBRUARY 21<br /><br />\n122 W. BALTIMORE ST.<br /><br />\n8.00 P. M.—Musical Club Concert at Md. Casualty Club House.<br />\nFEBRUARY 22<br />\n10.15 A. M.—Students assemble in Lower Hall of Lyric.<br />\n10.30 A. M.—Alumni and candidates for degrees assemble in lower hall on Md. Ave.. Trustees<br />\nand Faculty assemble in hall over main lobby (Little Lyric). Official guests<br />\ninvited to join procession in same hall.<br /><br />\nALWAYS USE A<br /><br />\nYELLOW CAB<br />\nOR PHONE<br /><br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br /><br />\n10.45 A. M.—Procession enters auditorium.<br />\n11.00 A. M.—Commemoration Exercises begin.<br /><br />\nLIBERTY ST.<br /><br />\n8.00 P. M.—Eighteenth Annual Alumni Bang uet at Alumni Memorial Dormitory.<br />\n9.00 P. M.—Bowery Ball in C. E. Hall.<br /><br />\nAT SARATOGA<br /><br />\nSALESMAN:<br />\nWe want a live wire salesman<br />\nto represent us on the campus.<br />\nOne who wishes to make some<br />\neasy money putting in a few<br />\nhours of spare time—interviewing<br />\n-profs- and students—to sell<br />\nFord Cars. To the right man we<br />\nhave a regular position when college closes. Call immediately at<br />\n325 Park Avenue. Ask for Mr.<br />\nLong or Mr. Watson.<br /><br />\nC. A. GOODWIN<br />\n325 PARK AVENUE<br /><br />\nLUNCHEON<br />\nTEA<br /><br />\nFEBRUARY 23<br /><br />\nDINNER<br /><br />\n7.30 P. M.—Johns Hopkins-Fifth Regiment In door Games.<br />\n11.30 A. M.<br />\nuntil<br />\n7.30 P. M<br /><br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br /><br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\ns er v e d, and reasonably<br />\npriced—is at<br /><br />\nPLAYSHOP GIVES MONTHLY BARNSTORMERS ADOPT NEW POLI- BETA CIRCLE TO BE REPRECY FOR CASTING<br />\nPRODUCTION. DR.<br />\nSENTED AT 0. D. K.<br />\nThe Flag, Banner &amp; Pennant Shop<br />\nContinued<br />\nfrom page 1<br />\nLITZ STARS<br />\nCONVENTION<br />\n(Successors to Sisco Brothers)<br />\nHamburger, manager of the Club.<br />\nThe Homewood ,Playshop proG. M. Shriver, Jr., will be the Flags, Banners, Pennants, Arm Bands,<br />\nEmblems, Silk Banners for Schools,<br />\nduced three one act plays in its They are square, black enameled delegate of<br />\nBeta Circle at the anSocieties and Fraternities<br />\nkeys,<br />\nbearing<br />\nraised<br />\na<br />\ntragic<br />\nmask<br />\nmonthly performances last Thurs302<br />\nPARK<br />\nAVE., BALTIMORE, MD.<br />\nnual<br />\nOmicron<br />\nDelta Kappa convenday, Friday and Saturday nights. in gold in the center. Across the<br />\nVernon 2355<br />\nR. H. Taylor<br />\nLady Gregory's \"The Rising of the bottom is the word \"Barnstormers\" tion to be held at Centre College,<br />\nMoon,\" \"Ati-nosphere,\"- and \"For in raised gold letters. On the back February 22 and 23. The HopFor<br />\nFor<br />\n1817 N. Charles St.<br />\nDistinguished Service\" were on the is engraved the name of the owner kins Circle will be further repreand<br />\nthe<br />\ndate<br />\nof<br />\nFOUNTAIN<br />\nhis<br />\nelection<br />\nthe<br />\n,to<br />\nGENERAL<br />\n(Half Block below North Ave.)<br />\nbill.<br />\nsented at Danville by H. D. Cotton,<br />\nClub.<br />\nPENS<br />\n,<br />\nUSE<br />\n\"The Rising of the Moon\" was<br />\nRehearsals will be held six times '22, who is the National Publicity<br />\nManufactured by<br />\nNicholas Brown, Mgr.<br />\neasily the best of the three, in acta week for all members of the cast: Secretary of 0. D. K. At least<br />\nWIGHT &amp; HUMPHRIES<br />\ning, production, and as a piece of<br />\nMonday, Tuesday, Thursday and one delegate from each circle will<br />\nplay writing. Dr. Francis Litz litFriday at 7:30 P. M.; Saturday af- be at the convention, including a<br />\nerally \"walked off with the show\"<br />\nternoon at 2 o'clock, and Sunday at representative<br />\nfrom the University<br />\nin this piece. His acting of the<br />\n3 P. M. The principles will probof Alabama, which was recently<br />\nwandering ballad singer's role was<br />\nably have three or four extra reexcellent. The policemen, how0-ranted a charter.<br />\n6<br />\nhearsals a week.<br />\never, appeared to be unnecessarily<br />\nAt the last meeting of Beta CirThere will be a rehearsal and<br />\nawkward. And, as Katrinka says,<br />\ntryout after the Commemoration cle on February 17, the officers of<br />\n\"My Gawd, they are some dumb<br />\nExercises on Friday afternoon, at the circle were re-elected for the<br />\ncops.\"<br />\n2 o'clock.<br />\nsecond half year. Douglas C. TurnFORTY-EIGHTH YEAR OF INSTRUCTION 1923-1924<br />\n\"Atmosphere,\" by a member of<br />\nbull, Jr., President; J. I. Bonner,<br />\nthe Playshop, was a pleasing bit of MUSICAL CLUB CONCERT<br />\nTOnothing. A little of the dialogue<br />\nVice-President; J. E. Mount,<br />\nNIGHT AT MD. CASUALTY<br />\nwas really witty, but nine-tenths of<br />\nCLUB HOUSE<br />\nTreasurer, and Joseph Leopold,<br />\nit appeared to be a bit forced. The<br />\nContinued from page 1<br />\nINSTRUCTION<br />\nSecretary, were again chosen for<br />\nproduction and acting were not es- (b) All Thru the Night<br />\nthese offices.<br />\nGRADUATE SCHOOL OF ARTS AND SCIENCES. Degrees: Master of<br />\npecially good.<br />\nBochau<br />\nJ.<br />\nH.<br />\nArts; Doctor of Philosophy.<br />\nCroker<br />\nwas<br />\nappointed<br />\nchair\"For Distinguished Service\" is<br />\n(Mr. Clinton White, Soloist)<br />\nman<br />\nof a committee which is to tour MEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nour idea of a real one.-act play. This 5. Violin Solo<br />\nIMr. Light<br />\nwas well produced, the play is more On Wings of Song..Mendelssohn Maryland prep schools in the COLLEGE OF ARTS AND SCIENC ES. Degree: Bachelor of Arts.<br />\nthan mere talk, and the acting of<br />\nspring. Joe Leopold heads a com- SCHOOL OF ENGINEERING. Degrees: Doctor of Engineering; Mas6 Guitar Duet<br />\nthe two principals was \"just right.\"<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\nMessrs. Hambleton and Fargo mittee which is to publish a revised<br />\nChemistry.<br />\nHowever, Miss Brandau at times<br />\nand enlarged edition of the Hopdid appear to be a little too bored. 7. The Blue Jay Six<br />\nSCHOOL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of Pub(a) Popular Selections.<br />\nkins Song-Book.<br />\nlic Health; Doctor of Science and Bachelor of Science in Hygiene; CerThe stage setting looked like Coles<br />\n(b)<br />\nDancing<br />\ntificate in .Public Health.<br />\nMr. Shaffer<br />\nPhillip's latest stocking \"ad.\" But<br />\n(c)<br />\nXylophone<br />\nSolo____Mr. Boyd<br />\nSCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nit was good.<br />\nBLACK AND BLUE JAY TO<br />\n8.<br />\nTenor<br />\nBanjo<br />\nSolo<br />\nCOLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nOne thing to be noticed at all of<br />\nAPPEAR MARCH FIRST.<br />\nMr. McCauley<br />\nthe Playshop's performances is the<br />\nSUMMER<br />\nCOURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nNEW POLICY ADOPTED<br />\nTosti<br />\nArts or of Science.<br />\nentire absence of undergrads. Right Goodbye<br />\nThe next Black and Blue Jay will<br />\nunder their nose is the best \"little 9. Banjo Club<br />\nCOURSES IN SOCIAL ECONOMICS.<br />\nappear on the Campus about March<br />\ntheater\" in the South. Yet not a Coming Thru<br />\nMcCauley<br />\nfirst. The copy has been submitted EVENING COURSES in Business Economics and for Technical Workers.<br />\nglance is given the Playshop as ye 10. Saxophone Solo Mr. Scherr<br />\nand the editors are busy on the macollegiate theater-goer heads for the Saxophobia<br />\nWiedoeft terial. This is<br />\nthe Jay's fourth, and<br />\nMaryland. A little support would 11. Glee Club<br />\naccording to members of the staff,<br />\nhurt neither the student nor the Beautiful Blue Danube<br />\nbest issue. Seven issues will be the<br />\nPlayshop.<br />\nWaltz<br />\nStraus limit for the year, every effort be- JOHNS HOPKINS PRESS PUBLICATIONS.<br />\ning directed to make the last or<br />\nHOPKINS TANKMEN TO ENCOUNTER RUTGERS<br />\nLACROSSE TEAM HARD HIT June Week number a record<br />\nbreaker.<br />\nContinued from page 1<br />\nBY BLACK LIST<br />\nIt is now decided that each memand Hambleton.<br />\nThe Black and Blue team was<br />\nber<br />\nof the Jay's staff will be alswim—Bahlke<br />\n220-yard<br />\nand hit a hard blow by the recent black<br />\nlowed<br />\na key to the office in the MECHANICAL AND ELECTRICAL ENGINEERING—Housing also Physics<br />\nStone.<br />\nlist which bars the activity of<br />\nBUILDINGS<br />\n100-yard Breaststroke—Dunning about a dozen players, among Barn. Formerly keys were held by<br />\nthe Editor-in-Chief and other mem- GILMAN HALL—General library, class rooms, biology, administration.<br />\n(Captain) and Swanson.<br />\nwhom are several that had been<br />\nand College Chemistry.<br />\n100-yard Dash—Welch and Lord. considered as likely candidates by bers of the Board of Control only.<br />\nThis hampered the work of the CIVIL ENGINEERING—Housing also Geology.<br />\nthe coaching staff. Included in<br />\nstaff,<br />\nas free access to the office POWER HOUSE.<br />\nthe list of ineligibles for the spring<br />\ncould not readily be obtained when BOTANY AND PLANT PHYSIOLOGY<br />\n—With Greenhouses and Botanical<br />\nseason are Almy, Bassin, Berndt,<br />\nit was necessary to work., Not to<br />\nGarden.<br />\nBesore, Middleton, Steck, Townbe behind other organizations with CHEMICAL LABORATORY—For graduate<br />\nwork.<br />\nsend, Taylor and W. N. Young.<br />\noffices in the Barn, that allow all PHYSIOLOGI<br />\nCAL BUILDING.<br />\nof their members keys to the rooms,<br />\nANATOMICAL LABORATORY.<br />\nthe Jay has decided on this policy.<br />\nHUNTERIAN LABORATORIES.<br />\nNOTICE<br />\nThe announcement of several apH.&amp; OSCAR G•1-5`<br />\nPATHOLOGI<br />\nCAL LABORATORY.<br />\nSwimming Meet, Hopkins<br />\npointments to the staff of the Jay<br />\nOWN ER<br />\nvs. Lehigh, B. A. C., Februwill be made either at this or the SCHOOL OF HYGIENE.<br />\nki<br />\n:<br />\n)<br />\nl 41\"<br />\nC14141/<br />\nary 29, 8.00 P. M. Dancing<br />\nnext issue. Several places are CARROLL MANSION—Johns Hopkins Club.<br />\n29 E. BALTIMORE ST.<br />\nafter the meet.<br />\nto be filled as soon as the work of STUDENT ACTIVITIES BUILDING.<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\nthe various candidates warrant it. ALUMNI MEMORIAL DORMITORY<br />\n.<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\n;-ht<br />\nif-<br /><br />\nni-<br /><br />\nleaal<br />\nids<br />\nis<br />\nnd<br />\nall<br /><br />\nIn-<br /><br />\nto<br />\nles<br />\nd\"<br />\nLge<br />\nnd<br /><br />\nng<br /><br />\nbe<br />\n[ala•d&gt;11Lb-<br /><br />\nThe Johns Hopkins University<br /><br />\nLI,AbeX,atierify)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 21, 1924<br /><br />\n4<br /><br />\nSCHOLARSHIPS OFFERED BY tice. Since the exams a squad of<br />\nabout 30. players has been reporting for practice each afternoon and<br />\nthat number is .steadily growing.<br />\nThe coaches are expected to pick<br />\na tentative list of first string playcan schools and colleges for its fifth ers during the next week in order<br />\nsummer session, July and August to have a definite group with<br />\nwhich to work. This squad is<br />\nof 1924.<br />\nbe liable to change during the<br />\n'to<br />\na<br />\npicturTheatre,<br />\ntheir<br />\nLittle<br />\nIn<br />\naccording to the coaches.<br />\nseason,<br />\nnestling<br />\nbuilding<br />\nesque old wharf<br /><br />\nSHIRT MAKER<br />\nLITTLE THEATRE<br />\n226 N. Liberty St.<br />\nDress Shirts...$3.00, $3.50 and $4.00<br />\nThe Gloucester School of the<br />\n$3.30 and $4.40<br />\nNegligee<br />\n$5.50 and $6.60 Little Theatre, Gloucester, MassaImported Madras<br />\nrerms Cash, Less 1 0% 30 days on Shirts chusetts, is offering two scholarAlso a Full Line of Men's<br />\nships to undergraduates of AmeriFurnishings<br /><br />\nSTRATTON<br /><br />\nSpecial<br />\nPipe and Pouch<br />\n$1.25<br /><br />\nrects<br /><br />\nid Lobeorg .. tier<br />\n0011<br />\ncritical.<br /><br />\n60,000,000<br />\nPOUNDS<br />\nIN ONE<br />\nTRANSACTION<br /><br />\nthe<br />\nor<br />\nin'de<br /><br />\nOfl<br /><br />\nseetris<br /><br />\nRECORD<br />\nOF PURCHASE<br />\nBURLEY<br />\nLouisvr,LE,<br />\ngle sale<br />\nof leafkr.;Jan. 18. TOBACCO<br />\nThe large<br />\nbeen<br /><br />\nbids<br />\nco/lec<br />\ncow.<br /><br />\nst sintobacco on<br />\nrg<br />\nannounced by<br />\nthe record has just of Ve<br />\nGrowers'<br />\nBurley<br />\nsold to<br />\nCooperative<br />\nTobacco mer<br />\nsixty Liggett &amp; Itlyers Association, which bee,<br />\nmillion<br />\na<br />\nTobacco<br />\nIncluded M thepounds of<br />\nCompany<br />\nBurley Leaf. bee<br />\nquantity ofo/d purchase was<br />\nCig<br />\na very<br />\ns, —the best<br />\nBurley<br />\n.ar possessing Burley ever Tobacco..1922 large priv<br />\nCrop Lef<br />\nan<br />\ngrown<br />\nen Liggett<br />\nunusual qualityin Kentucky, ve<br />\n&amp;<br />\nw- use<br />\nMyers<br />\nand<br />\nit<br />\nin the<br />\nTobacco<br />\nflavor. if<br />\na t.<br />\nknown<br />\nmanufacture ofCompany win<br />\nbrands.<br />\ntheir widely c<br />\nTobacco.<br />\nespeciaily Velvet<br />\ninsuring a<br />\nPull<br />\nSmoking of<br />\nsuperior<br />\nquality.<br />\nA. large<br />\n'delegation of local<br />\nManagers met to and<br />\n• •,.<br /><br />\namong the ship-yards and studios,<br />\nATHLETES TO COMPETE IN<br />\nthe Gloucester Players last summer NOTED<br />\nHOPKINS-FIFTH REGIMENT<br />\nproduced almost thirty plays, which<br />\nGAMES<br />\nincluded such pieecs as:<br />\nContinued from page 1<br />\nA Night At An Inn, Dunsany ; Hopkins star high jumper and<br />\nTVurzel-Flummery, Milne ; Riders South and Middle Atlantic chamLimited<br />\nto the Sea, Synge; The Land of pion in this event, and Aaronson,<br />\nBARN CAFETERIA Heart's Desire, Yeats; and Moon Y. M. H. A., Hopkins record holdTide, Clemnets. The school con- er in the pole vault, are some of<br />\nThe year 1922 was a \"vintage chase included a big<br />\ncarry-over<br />\nnected with the theatre offers the men entered in the field events.<br />\nyear\" for Burley tobacco—the from this fine crop.<br />\n,e414.<br />\ne<br />\n.144414q4E EITIEEINEF10101014,1146411'110111114#1014,<br />\ncourses in stage lighting, scenery, Norton, Georgetown, competed for<br />\nbest Kentucky ever grew.<br />\nFine quality—mild, full, mellow<br />\nmake-up,. dancing, public speaking Kansas last year and won the high<br />\nFavored all through the season flavor—this is nothing new for<br />\nwith exceptional tobacco weather Velvetsmokers;but this big supplyand acting. The seven members of jump at the Penn Relays. He was<br />\n—just<br />\nenough warmth and not too is an extra safeguard. The same<br />\nthe faculty include: Mrs. Florence all-around man in the Western inmuch rain—the crop developed a price—mark this well—the same<br />\nEvans, Director of The Boston door season last year.<br />\n\"body\" and character seldom quality as always: \"The best<br />\nSchool of Public Speaking and The<br />\nbefore equaled.<br />\nSpecial Match Relays<br />\nBurley grown in Kentucky.\"<br />\nFlorence Evans Players; Miss<br />\nOur<br />\nrecent<br />\n60-million<br />\n-pound<br />\npurLIGGETT &amp; MYERS TOBACCO CO.<br />\nA number of prominent teams<br />\nFlorence Cunningham, of the Vieux<br />\nare<br />\nengaging<br />\nin<br />\nmatch<br />\nrelays.<br />\n\"The King of Lubricants\" Colombier and founder of The<br />\nThe Medley Relay Championship<br />\nPlayhouse-On-The-Moors and Coof<br />\nAmerica race for the Civitan<br />\nSHERWOOD BROTHERS, INC.<br />\nlin Campbell Clements (author of<br />\nPlays For A Folding Theatre, etc.) Cup will bring together Hopkins<br />\nfiagNgEtERNT4.'NEglff„NIKEINIUMg=g12:=1<br />\nwho with Edna St. Vincent Millay (last year's champion), Boston<br />\nand Eugene O'Neill has been called College, New York University,<br />\none of the founders of a new school Pennsylvania and Pittsburgh. The<br />\nA. JACOBS &amp; SONS<br />\nof American playwriting.<br />\nSouth Atlantic Mile Relay ChamTailors<br />\nLetters for information concern- pionship race will be decided by<br />\nUniforms and Liveries<br />\ning the scholarships to the Glou- the University of Richmond, Wil128 W. FAYETTE ST.<br />\ncester School of the Little Theatre liam and Mary College, Maryland,<br />\nBaltimore, Md.<br />\nNear Liberty St.<br />\nshould be addressed to Miss Flor- and George Washington. Navy<br />\nence Cunningham, 112 Charles St., will meet Lafayette and N. Y. U.<br />\nRoston.<br />\nin a special mile relay. Navy, Baltimore Atheltic Club, and WashLACROSSE TEAM PRACTICING FOR<br />\nCanoe Club meet in a twoington<br />\nCOMING SEASON<br />\nmile<br />\nrelay.<br />\nPoly and City meet<br />\ndry<br />\nwarm,<br />\nComparatively<br />\nfor<br />\nmile<br />\nrelay<br />\nscholastic chamthe<br />\nweather in the last few weeks has<br />\nMEN'S SHOES<br />\npionship<br />\nof<br />\nBaltimore<br />\ncity. Poly,<br />\nenabled the lacrosse squad to put<br />\nOf the Better Class<br />\nEpiscopal<br />\nHigh,<br />\nof Alexanin a good deal of beneficial prac- City,<br />\ndria, Va., and McKinley High, of<br />\nURNER BROTHERS<br />\nand individuality is offered here at prices that are not<br />\nWashington, compete in a halfBMDERS<br />\nPRiBTERS<br />\nEllGRAVERS<br />\nand cannot be underquoted by any house at any time.<br />\n111 E. BALTIMORE STREET<br />\nmile relay. Fork Union Military<br />\nBaltimore<br />\nC.<br />\nBesides the reputation of an old-established firm<br />\nAcademy and Episcopal High<br />\nis<br />\nback<br />\nof each sale with a guarantee.<br />\nSchool meet in a championship<br />\nCollecje Literature<br />\nmile relay for the Phi Epsilon Pi<br />\nCup.<br />\nORDERS RECEIVED FOR<br />\nOther features of the meet in- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nCOGGINS'<br />\nclude a 3,000-meter walk and a<br />\n343 NORTH CHARLES STREET<br />\n75-yard dash for girls. The R.0<br />\nTransfer &amp; Baggage Express<br />\nT. C. will have entire charge of the<br />\nAUTOMOBILE SERVICE<br />\nushering at the meet.<br />\nPHONE, HOMEWOOD 6886<br /><br />\nEKCIL<br /><br />\nHO OM OHO<br /><br />\nTfie<br /><br />\nHub<br /><br />\nBaltiore's Great<br />\nMen's Store<br /><br />\nURNER'S<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nOFFICIALS<br />\nHonorary Referee—Hon. Howard<br />\nEstablished 1873<br />\nW. Jackson, Mayor of BaltiA. H. FETTING MAN'FG<br />\nmore.<br />\nJEWELRY CO.<br />\nReferee—Lawson Robertson.<br />\nManufacturers<br />\nStarter—J. V. Mulligan.<br />\nGreek Letter Fraternity Jewelry<br />\nTimers—J. E. Tyler, J. H. Lloyd,<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nJames McCallister, Herbert<br />\nSadtler, Charles Ornstein.<br />\nInspectors — Edward Kirkness,<br />\nPrinters of<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\nGeorge Loos, J. H. Parran, J.<br />\ncrhe Johns Hopkins<br />\nTrueman<br />\nThompson, \\V. R. EdJAS. H. DOWNS<br />\nNE1DS.-LETTER<br />\nwards, Sr., Charles \\Valbert.<br />\nENGRAVER PRINTER STATIONER<br />\nClerk of Course—Latrobe Cogs229 N. CHARLES ST.<br />\nLOMBARD and SOUTH STREETS<br />\nwell.<br />\nChief Relay Clerk—P. K. Moisan.<br />\nAssistant Clerks of Course—J. F.<br />\nBE A NEWSPAPER CORRESPONDENT<br />\nHouck, Dallas Kirwan.<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nTrack<br />\nJudges—George J. Turner,<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nTheodore Straus, G A. Stewart,<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nJ. C. Patterson.<br />\nNEWSWRITERS TRAINING BUREAU<br />\nField<br />\nJudges—Chief: Benjamin<br />\nBuffalo, N. Y.<br />\nTappan, Harry Oehrl, Alexander Cummings, H. H. Lloyd,<br />\nGeorge Hoban, S. J. Poe, L. M.<br />\nPRESCRIPTION DRUGGISTS<br />\nElphinstone.<br />\nScorer—\\V. J. Leimkuhler ; assistTWO STORES:'<br />\nant, R. T. Cox.<br />\nNorth<br />\nAve.<br />\nEutaw<br />\nPlace<br />\nand<br />\nCharles and Chase Sts<br />\nCustodian<br />\nof Prizes—J. F. Kellner.<br />\nMadison<br />\n0405<br />\nVernon 0890<br />\nAnnouncer—William Meyer.<br />\nMarshal—H. H. Lepper.<br />\nThe Greetings of a Fine Store<br />\nHandicapper — Warren Freeburger, A. A. U.<br />\nTo the Students of a Fine University<br />\nChief Medical Officer—Dr. R. T.<br />\nA bercrombie.<br />\n8c<br />\nChief Usher—W. S. Paul.<br /><br />\nWhen it comes to clothes, we<br />\nknow what the college man<br />\nwants. And we have it.<br /><br />\ny-y4o-rps,<br />\nY.M.B.0.D.<br /><br />\nBaltimore &amp; Hanover<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\n,X5 Corner c.<br />\nJayelle and 6Putaw Sts.<br />\n-Where Wholesale and Retail Districts Meet-<br /><br />\nHYNSON, WESTCOTT and DUNNING<br /><br />\n- HOCHSCHILD.KOHN CO.<br /><br />\nSafe Deposit &amp; Trust Co.<br />\nOF BALTIMORE<br />\n13 SOUTH ST.<br /><br />\nOrganized 1864<br /><br />\nJohn J. Nelligan, President<br /><br />"}], "field_media_file": [{"target_id": 37835, "display": null, "description": null, "target_type": "file", "target_uuid": "67bdc41b-4401-46f6-a2bb-b7abba35b685", "url": "http://digital.library.jhu.edu/system/files/2022-03/13107-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13107, "target_type": "node", "target_uuid": "1339ba51-e620-47a1-8ce0-ce100ec38b7b", "url": "/node/13107"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "74bdeecc-8b19-412b-9078-7ee5c34ee0af"}]}