{"mid": [{"value": 36573}], "uuid": [{"value": "1788af6c-05cb-4829-812b-43e724fe680e"}], "vid": [{"value": 36573}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:49:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12921-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:49:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:49:25+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MRS NOTENSHUM :,j[riln<br />\nVOL. XXIV, NO. 27<br />\n<br />\nBALTIMORE, MD., MAY 11, 1920.<br />\n<br />\nBLACK AND BLUE LOSES TWICE<br />\n<br />\nCONVENTION WELL ATTENDED<br />\n<br />\nMASS MEETING THURSDAY<br />\n<br />\nWesleyan and Stevens Tech Defeat<br />\nOur Nine in Last Two Games<br />\nof Northern Trip.<br />\n<br />\nSixty College Journalists Answer Roll<br />\nCall—Thirty Colleges Represented—<br />\nNews Association Formed.<br />\n<br />\n'Varsity Club to Explain its Status to<br />\nFaculty and Student Body—<br />\nAll Urged to Come.<br />\n<br />\nPRICE, FIVE CENTS<br />\n<br />\nSIX MEN ELECTED TO 0. D. K.<br />\nPublicly Initiated at Mass-meeting<br />\nFaculty Action on Unauthorized<br />\nBaseball Trips Announced.<br />\n<br />\nThe Johns Hopkins baseball<br />\nIn order to place the position<br />\nThe first convention of college<br />\nOn last Friday<br />\nnine, on May 3, lost to Wesleyan journalists held since 1916 was of the club clearly before the fac- suspended at 9.30 classes were<br />\no'clock in orCollege the third straight game a decided success. It was held ulty and student body and thus der to permit all<br />\nundergradu<br />\nates<br />\nOf its northern trip. The game in New York under the auspices settle the many rumors which to attend the<br />\nmass-meeting at<br />\nwas listless throughout, and was of the Columbia Spectator and have been floating about the cam- that hour, at .which<br />\nsix newly<br />\nmarked by wretched fielding on Columbia School of Journalism. pus, a large mass-meeting will be .chosen members of<br />\n0. D. K. rethe part of the Black and Blue. The following colleges were rep- held on Thursday. May 13, at ceived the public<br />\ninitiation and<br />\nBoth teams hit the ball hard, but resented: Hamilton, Colgate, Cor- 12.20 o'clock. A member of the the Dean made sonic<br />\nimportant<br />\nthe Wesleyan nine had it over the . nell, Brown, Williams, Johns 'Varsity Club will address those announcements.<br />\n'Varsity here, as well as in the Hopkins. Rochester, Georgetown, 1mmsmit. It is vitally important<br />\nDr. French presided and pinned<br />\nfield. \"Doc\" Love, who toed the Wesleyan, Middleburg, Dart- ti nit all students and members of the 0. D. K. laurel<br />\nleaf on<br />\nrubber for Hopkins, proved no mouth, Rhode Island State, Am- thtt faculty attend and thus learn following initiates: Dr. Georgethe<br />\nE.<br />\npuzzle for the Connecticut nine, herst, Massachusetts of Technol- the plans of the club definitely.<br />\nBarnett, professor of slat 1st ics ;<br />\nfor they pounded out 11 safeties ogy, Richmond College, Columbia,<br />\nIn accordance with its plan to Dr. Alexander Graham christie,<br />\noff his delivery. \"Andy\" Knecht, Delaware College, Rutgers, Get- form a company to take over the professor of mechanical<br />\nengineerwho relieved him, fared little bet- tysburg,<br />\nSimmons, management of the finances of ing; Richard T. Cox, manager of<br />\nSyracuse,<br />\nter during the short time he was Franklin and Marshall, Inlay- the University Athletic Associa- track, art editor of<br />\nHullabaloo;<br />\non the mound.<br />\ncite, SWarthmore, Haverford. tion, the 'Varsity Club has taken Edmund S. Wood, president of<br />\nWesleyan piled up a four-run Penn State, Muhlenburg, Ursin- steps for the formation of such Jun ior .ags, b ad hail, lacrosse,<br />\nlead in the first two innings, but us, Princeton and Yale.<br />\nan organization. The $10,000 baseball, basket -ball : William H.<br />\nthe Black and Blue came back in<br />\nlt was decided to revive the old necessary for 'the incorporation Wood, president of Class of 1922<br />\nthe second and third and took the Association Of College News- of the 'Varsity lIolding Company in freshman year.<br />\nfootball, baselead by sending five markers papers, which had gone out of has been subscribed, and the in- ball, basket-ball, Si<br />\nudent Council;<br />\nacross the pan: After this, how- existence (hiring the war. A new corporation papers drawn up. Bascom K. Kennady,<br />\nbasket-ball,<br />\never, the home pitcher, Connolly, constitution was drawn up and Officials of the club are now wait- business manager of<br />\nHullabaloo<br />\ntightened and held Hopkins in the name Eastern collegiate News ing only for the decision from for next year. Dr.<br />\nFrench delivcheck during the remainder of the Association selected. The pur- Washington as to whether the ered a shaft address<br />\nabout the 0.<br />\nfray. The Wesleyan team put the pose of this organization is to admission to University games D. K. fraternity.<br />\nHe explained<br />\ngame on ice in the fifth inning, bind the college publications more will be exempt from tax. Accord- that Omicron Delta<br />\nKappa stood<br />\nwhen they staged a rally and closely together, and to facilitate ing to the local income tax au- for the Greek,<br />\n\"The laurel crowns<br />\nscored four tunes.<br />\nthe better exchange of news and thorities, no tax will be charged, the circle,\" and that the<br />\nsociety<br />\nFor the Black and Blue, Ben- advance notices. The constitu- since the money is obviously to be was an organizatio<br />\nn existing prison, Cox, Knecht and Bloomsburg tion and by-laws were ratified at used for the benefit of a public marily for the<br />\npromotion of colstarred at the bat, each hitting once by the Syracuse Daily Or- institution of learning. It was, lege spirit.<br />\nCollege spirit, as Dr.<br />\nsafely twice, while Camp, Raines ange, Amherst Student, Hamilton, however, thought best to consult French defined<br />\nit, is made up of<br />\nand Bateman showed the way for Life, Dart mouth, •1 all NS HOPKINS the Federal officials before taking three things:<br />\nloyalty, co-operathe home team. In the field, Cox NEWS-LETTER, ROO/('Sfri CO in pilS, definite action. As soon as the tion and<br />\nservice. He charged the<br />\nplayed a good game and made sev- 'VCR/C./Mil A igi/S,<br />\nHy Fri/Wedesired information is obtained, undergraduates to be ever careeral spectacular catches.<br />\nl-00a a. Co/ant bia Spectator, The<br />\nthe formalities of incorporation ful of the good name of the UniThe Johns Hopkins balltossers Tech ( M. I. T.) and The Middle- will be completed and the 'Var- versity, not<br />\nto make hasty judgbrought their northern trip to a bury digits.<br />\nsity Holding Company will be- ments and to do their very best.<br />\nclose by losing to Stevens Tech<br />\nThe delegates of the other col- come an active organization.<br />\nearly next year, to assimilate a<br />\nill a thrilling game. It was a leges were not empowered to act,<br />\nAt the last meeting of the 'Var- very large freshman class.<br />\npitchers' battle from start to fin- but \\yin recommend that their pa- sity Club, Carroll Stollenwerck,<br />\nDr. Lantane followed Dr.<br />\nish, only five hits being registered pers join the association. It is because of his continued absence French.<br />\nHe said that at the last<br />\nby the combined efforts of the two expected that the association will from the city, resigned his posi- meeting<br />\nof the Board of Collegiteams. The game was marked by number at least 40 colleges by tion as chairman of the Football ate<br />\nStudies the freshman-sopholoose playing in the field, which June, since the advantages are Committee. Dr. Eleveth Bridg- more<br />\nbanquet affair had been reon two occasions proved very cost- numerous and the attending ex- man, who is also. president of.the ferred<br />\nto a ccamittee of the facly for the Black and Blue, while, pense slight. The ratifying pa- club, was chosen to take his place.<br />\nulty, who would report definite<br />\non the other hand, all the breaks pers will hold the first meeting Both of these men were formerly<br />\nrules for next fall. Several years<br />\nof the game went to the winners. of the association and elected Mc- prominent members of the Hopago, the Student Council had<br />\n\" Welliver, although rather wild Knight, of Columbia, president; kins football team, and both<br />\nagreed that hazing hind class<br />\nat times, nevertheless struck out Wood, of Amherst, vice-president; served as !Varsity coaches during fights<br />\nwould be done away with.<br />\nthree men in the short time he and Dallas, of Princeton, secre- the past season.<br />\nAs it was not a definite written<br />\nwas on the mound. The third tary. They also decided that the<br />\nIt is the present plan to hold statute, the members of the presinning, however, proved his un- next annual convention should be a \"joint meeting of the<br />\n'Varsity ent Student Council were ignordoing, when he walked Farrari held in May of the following Club and the undergradu<br />\nate body ant that such an agreement exWeigele.<br />\nand hit<br />\nKurtz then year.<br />\nof the University some time in isted and so more drastic action<br />\nbunted to the pitcher, and when<br />\nWhile the formation of the as- . the near future for the purpose was not taken; but next fall the<br />\nthe latter threw the ball far over sociation is the most important of stimulating interest in the profaculty will take some definite<br />\nEgerton's head, Farrari counted. result of the copvention, the edi- posed summer training camp<br />\nfor stand.<br />\nIn the following frame, Donnelly torial and business meetings were the football team. This<br />\nis the<br />\nDr. Lantane next announced<br />\ndoubled off of Love, who relieved exceedingly valuable to all dele- first time such a thing has ever<br />\nthat the rule requiring athletic<br />\nWelliver, and scored a moment gates. Plans and customs were been attempted at Hopkins,<br />\nand schedules to be submitted to Dr.<br />\nlater on Egger's single. In the exchanged, and many new and it is hoped that a large number<br />\nAbercrombie for approval must<br />\nsame inning, with men on first practical ideas brought forth.<br />\nof men will attend. For those be more strictly observed. The<br />\nand'third, a double steal resulted<br />\nThe banquet held on Friday men who would otherwise work matter had reached a head, he<br />\nin another run. After this in- evening at the McAlpin, was a during the summer vacation, emsaid, with the northern trip of<br />\ning, Love tightened up and held very pleasant affair and was at- ployment will be found in the<br />\nthe baseball team, which had<br />\n(('ontinued on page 9, col. 2)<br />\n<br />\n(Continued on pace 9, col. 3)<br />\n<br />\n(Continued on page 3, col. 3)<br />\n<br />\n(Continued on page 2, col. I)<br />\n<br />\n\fe,<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\n2<br />\n<br />\nSOCIAL SCIENCE CLUB ELECTS<br />\nOfficers Unanimously Chosen—Plans<br />\nFor a Supper and Smoker Laid Next<br />\nYear Expected to be Successful.<br />\n<br />\n3frrbrrirk<br />\n<br />\nKipp (Co.<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nHIGH GRADE CHOCOLATES.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br />\n<br />\nJohn C. Knipp e? Sons<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nATTENTION! J. H. U. STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br />\n<br />\nPRINTERS<br />\n<br />\nPUBLISHERS<br />\n<br />\nmEYFHRALTIEIMER<br />\nThe Big Stationery Store<br />\n1 0- I 2 N. HOWARD STREET<br />\nSIX MEN ELECTED TO 0. D. K.<br />\n<br />\nBALTIMORE<br />\n<br />\nMusical Club Closes Season.<br />\n<br />\nThe Johns Hopkins Musical<br />\n(Continued from fiage 1)<br />\nClub<br />\nclosed a very successful seathe<br />\nunauthorized.<br />\nfall<br />\nbeen<br />\nLast<br />\nmanager had askeij to be allowed son with its annual banquet at<br />\nto schedule this spring's northern the Southern Hotel on Monday,<br />\ntrip for May 12-15, as Easter came May 3. All members of the club<br />\nso early. Permission was granted<br />\nfor this. The games, however, and, in addition, Prof. C. C.<br />\nwere scheduled two weeks ahead Thomas, the honorary guest, who<br />\nof the date of the original per- was later elected honorary presimission, and f)r. Abercrombie dent, were present. W. L. Merriwas not notified of the change. ken was chairman of the Banquet<br />\nMoreover, the team missed classes Committee, and Paul Wiggins<br />\nfor a week, instead of three days. acted as toastmaster. Among<br />\nDr. Lantane stated that Mr. the speakers were Coulter, CattaMurphy and Manager Field were nach, Defandorf and Weaver.<br />\nAfter the banquet, a new conequally culpable, although each<br />\nwas under the impression that stitution was read and passed,<br />\nthe other had full authority to go and the election of next year's<br />\n'ahead. Field has been removed officers was held. The following<br />\nfrom managership and placed on nominees were chosen: Coulter,<br />\npresident; Prince, treasurer;<br />\nprobation.<br />\nThe meeting' closed with a short Hubbard, business manager; and<br />\naddress by Dean Whitehead, who R. D. Parsons, secretary. ,<br />\nAfter the customary high orwas much applauded when he said<br />\nthere was \"no such thing as a der of jokes and songs, the.club<br />\ndisbanded for the year.<br />\ndishonest engineer.\"<br />\n<br />\nThe Social Science Club herd<br />\none of its most successful meetings of the year on Friday, May<br />\n7. The meeting was very well attended and was characterized by<br />\na surprising amount of enthusiasm. The officers for the coming<br />\nyear were all unanimously elected.<br />\n(;eorge Goetz was elected president; Lawrence Fenneman, vicepresident; and Fulton Bramble,<br />\nsecretary-treasurer. Tlie officers<br />\nare all men who have manifested<br />\na profound interest in the activities of the club—men who will<br />\ngive it a stimulus and an urge<br />\nthat will make it one of the most<br />\npotent organizations in the University.<br />\nPlans for a supper and a smoker to follow the last meeting of<br />\nthe year, on May 21, were laid,<br />\nand the hope was earnestly expressed that all regular members<br />\nof the society, including those who<br />\nwere not present at the last meeting, would be able to attend this<br />\nconvivial gathering. Some interesting stories and some sparkling;<br />\nliiiiiiot. is bound to put in its appearance on this occasion.<br />\nDr. Lovejoy, the counselor of<br />\nthe club, and the newly elected<br />\nofficers have already gotten eagerly to work in laying down the<br />\nplans for next year. The discussion meetings next year, according to present indications, are to<br />\nbe stamped by an enticing freshness and variety. Such live-wire<br />\ntopics as \"Freedom of Speech.\"<br />\n\"The Inalienable Rights of Minorities Under it System of Popular Government,\" -Co-operation<br />\nas Opposed to Competition as a<br />\nRational Principle,\" will constitute the subjects for discussion<br />\nfop the first few- meetings of the<br />\nyear.<br />\nThe public lectures again will<br />\nloom up as a conspicuous feature<br />\nin the club's program. Dr. McCabe, of Princeton, will probably<br />\nbe the first public lecturer of the<br />\ncoining year. and it is hoped that<br />\nDr. Harold Laski, of Harvard,<br />\nwill consent to deliver the second<br />\nlecture.<br />\nAll indications lend to the belief that next year will be a banner • year in the history of the<br />\nSocial Science Club.<br />\n<br />\nthe university of Michigan<br />\nStudent Council put itself on<br />\nrecord as being in favor of the<br />\nold clothes movement. An active<br />\ncampaign began recently to obi a in pledges.front the undergradua tes that they would wear nothing but old clothing on the campus<br />\nand at classes. Disreputable attire will be discouraged, but old<br />\ngarments which are decent in appearance will meet with the approval of the undergraduate body.<br />\n<br />\nOlgb Joinis iqopking<br />\nuittittrr Toutsrg<br />\n<br />\nTENTH SESSION<br />\n<br />\nJuly 6th - August 13th, 1920<br />\n<br />\nCourses of Instruction<br />\n<br />\nBiology<br />\nBusiness<br />\nChemistry<br />\nClassical Literature<br />\nEconomics<br />\nEducation<br />\nEnglish<br />\nFrench<br />\nGerman<br />\nHistory<br />\nJournalism<br />\nManual Training<br />\nMathematics<br />\nPolitics<br />\nPsychology<br />\nSpanish<br />\n<br />\nFor further information, see<br />\n<br />\nAl<br />\n<br />\nthe<br />\n<br />\nDR. BUCHNER,<br />\nRoom 217,<br />\n<br />\n-<br />\n<br />\nGilman Hall<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\n11<br />\n<br />\n11<br />\n<br />\n1<br />\n<br />\n1 1 !I<br />\n<br />\n1<br />\n<br />\n3<br />\n<br />\n11<br />\n<br />\nf ,m1<br />\nI<br />\n<br />\nYOUNG MAN<br />\nYour Suit or Overcoat<br />\n<br />\n.9, lin<br />\n<br />\nwill have those smart dapper kinks if<br />\nit comes from here where a specialty is<br />\nbeing made of clothing for college boys<br />\nand young men<br />\n<br />\n• •<br />\n<br />\nPrices, $25.00 to $65.00<br />\n<br />\nON'T take a fellow's pipe. Take some other possession.<br />\nBecause wrapped up in his pipe is a fellow's peace of<br />\nmind, his relaxation, his contentment. This is more than<br />\ntrue if it's aWDC Pipe, because then a good smoke is multiplied many times over. Our special seasoning process takes<br />\ncare of this by bringing out all the sweetness and mellowness<br />\nof the genuine French briar. Just you go to any good dealer<br />\nand select several good shapes. Put them in your rack.<br />\nSmoke a cool one every time, and you'll be well on your<br />\nway to pipe-happiness.<br />\n<br />\nD<br />\n<br />\nTEWART8a,<br />\nCannerinn Wt.10111fl 11,-Creerp<br />\nt<br />\n<br />\nTHE HATTERIE<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of Light Street<br />\n<br />\nSole Agents for Baltimore for College Fraternity Bands (Greek Letter Societies).<br />\nSHIRTS<br />\n<br />\nWm. DEMUTH at<br />\nWORLD'S<br />\n<br />\nLARGEST<br />\n<br />\nCO., NEW YORK<br />\n<br />\nPIPE<br />\n<br />\nroil<br />\n<br />\nHOWARD AND LEXINGTON STS.<br />\n<br />\nARROW COLLARS<br />\n<br />\nn_<br />\n<br />\nco.<br />\n<br />\nQuality<br />\n<br />\nMANUFACTURERS<br />\n<br />\ns Ski<br />\nCV61\\e'N't.<br />\n<br />\nc<br />\n4c(1AV‘<br />\n<br />\n11<br />\n<br />\n[I<br />\n<br />\n1 11<br />\n<br />\n1<br />\n<br />\nil I I<br />\n<br />\n1<br />\n<br />\nk)*<br />\n<br />\nil 1 1<br />\n<br />\nMerchandise<br />\nNominations for Athletic Board and<br />\nPresidency of Student Council.<br />\n<br />\nAt the mass-meeting held on<br />\nMonday at 12.20 o'clock, the following men were nominated for<br />\nthe Athletic Board:<br />\nFor President — Ed. Wood,<br />\nKeyes and Mullikin.<br />\nFor Vice-President—E. Jones,<br />\nW. B. Collins, Kennady and<br />\nTrew.<br />\nFor Secretary — Heiner, J.<br />\nJones, Trew, Marcuse and Hardin.<br />\nFor Alumni Delegate—Reaney<br />\nWolf, Dr.- Bla-nk and Mr. England.<br />\n• For Graduate Delegate—Griffiss.; Merrick, Evans, C. Benson<br />\nand Wyckoff.<br />\nFor Medical Delegate—Williams, Calkins and Egerton.<br />\nFor Senior Delegates (three to<br />\nbe elected)—Marcuse, Mullikin,<br />\n<br />\ncashell, E. Jones. J. Benson,<br />\nPickford and Reins.<br />\nFor Junior Delegates (two to<br />\nbe elected)—W. Wood, Turner,<br />\nFrank, Sharretts, J. Miller, Hardin, R. Wood and Hall.<br />\nFor Sophomore Delegate (one<br />\nto be elected)—Thompson, W.<br />\nHoffman and Dodson.<br />\nAt the same meeting, Marcuse,<br />\nTrew, J. Jones and Stansbury<br />\nwere nominated for the presidency of the Student Council.<br />\nThe election will be held at the<br />\nmass-meeting scheduled for Monday. May 17, at 12.20 o'clock. All<br />\nout!<br />\nThe following men have been<br />\nrecently appointed managers for<br />\nnext year:<br />\nBaseball—Biemiller.<br />\nLacrosse—Keyes. •<br />\nBasket-ball—Reed.<br />\n<br />\nMASS MEETING THURSDAY<br />\n<br />\n(Continuedfrom page 1)<br />\nneighborhood of the camp, so that<br />\nit will be possible not only to<br />\nclear expenses, but to make a little money besides. If possible,<br />\nthere will also be at the camp<br />\nsOme preparatory school men, who<br />\nare contemplating coming to Hopkins. In this manner, the camp<br />\nwill lie made to serve the double<br />\npurpose of developing a football<br />\nteam and of interesting men in<br />\nthe University.<br />\nThe lightning bug is a beautiful bird,<br />\nBut he really has no mind:<br />\nHe dashes through this world of ours<br />\n• With his headlight on behind.<br />\n—Ex.<br />\nHe squeezed her in the dark and kissed<br />\nher;<br />\nAnd for a moment bliss was his.<br />\n\"Excuse me, but I thought it was my<br />\nsister!\"<br />\nHe said. She smiled and cooed, \"It<br />\nIs.\"<br />\n—Ex.<br />\n<br />\nHATS<br />\n<br />\nHOSIERY<br />\n<br />\nTHE HOSIERY SHOP<br />\n215 N. CHARLES ST.<br />\n,Daltimore's Oest Shop For<br />\nMen's Sox and Ties.<br />\n<br />\n75 Cents and Up.<br />\n<br />\nBOOK = BINDING<br />\nJoseph Ruzicka<br />\n106-108 CLAN ST.<br />\n<br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\npkins Seals in Silver and<br />\nGold,<br />\nCollege Jewelry o Specioky<br />\n<br />\n28 E BALTIMORE STREET<br />\n<br />\n1<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\n4<br />\n<br />\n[10111g897NOWS101101.<br />\n1110 J011113,OUNDED<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Post Office at<br />\nBaltimore, Md., under Act of Congress,<br />\nNovember 3, 1879.<br />\nPublished weekly, from October to<br />\nJune, by the students of Johns Hopkins University.<br />\nBusiness communications should be<br />\naddressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSIT'Y; all articles and other communications should<br />\nbe sent to the MANAGING EDITOR.<br />\nTeleph.cri<br />\n<br />\nHomewood 100<br />\n<br />\nEditor-in-Chief.<br />\nLlewellyn W. Lord, '21.<br />\n. Managing Editor.<br />\nH. Douglas Cotton, '22.<br />\nAssociate Editors.<br />\nWarren W. Driver, '20.<br />\nEdward G. Huey, '22.<br />\nJunior Editors.<br />\nRichard Dallam, Jr., '22.<br />\nCharles C. Marbury, '22.<br />\nRichard M. Wood, '22.<br />\nNorvell E. Miller, Jr., '23.<br />\nWilliam F. Passano. '23.<br />\nBusiness Manager.<br />\nGeorge Deichman, '21.<br />\nCirculation Manager.<br />\nFrederick W. Lipps, '22.<br />\nAssistant Business Managers.<br />\nFrederick Abbott, '22.<br />\nLawrence K. Wagner, '22.<br />\nBALTIMORE;MD.,<br />\n<br />\nMAY 11, 1920<br />\n<br />\nThe close of the Easter vacation brings us to the last lap of<br />\nthe college year; commencement<br />\nand final examinations already<br />\nloom largely upon the horizon. At<br />\nsuch a tune it is only natural<br />\nthat a discussion of the Honor<br />\nSystem should take place.<br />\nTHE NEWS-LETTER regretted at<br />\nthe time of the mid-year exams to<br />\nhear the many rumors of cheating<br />\nwhich were then flying around the<br />\ncampus; and it regretted still<br />\nmore the inability of those in authority to trace these rumors and<br />\nto punish the offenders—for there<br />\nwere many breaches of the Honor<br />\nSystem. The inability of the Student Council and of the Omicron<br />\nDelta Kappa to get facts and evidence is the more lamentable,<br />\nsince it was caused by the general<br />\nattitude of indifference on the<br />\npart of the student body—a feelthat it was none of your business<br />\nwhether the other fellow cheated;<br />\nthat you would be a tale-bearer<br />\nif you reported him. This was<br />\nthe attitude which the investigators found it impossible to<br />\ncombat.<br />\nThere is no use to bemoan or<br />\nto attempt to condone this attitude. It is true that there. was<br />\nan unprecedented amount of<br />\ncheating at mid-years, and that<br />\nthe offenders could not be brought<br />\nto justice on account of the unwillingness of the students to<br />\nprosecute them. The issue is<br />\nsquarely before us, and the ques-<br />\n<br />\nthm arises. -What are you going<br />\nto do about it?\"<br />\nThere seems but two possible<br />\nalternatives to THE NEWS-LETTER:<br />\nReturn to the Proctor System of<br />\na bygone day or an Honor System<br />\nwhich is enforced to the letter.<br />\nThe way in which the present system operates, namely, leaving it<br />\nup to the individual whether or<br />\nnot he is to cheat, is, in the opinion of THE NEWS-LEWER, out of<br />\nthe question, since it is fair<br />\nneither to the faculty nor to the<br />\nhonest student.<br />\nA return to the Proctor System would be a disgrace to the<br />\nUniversity and to the student<br />\nbody. It would amount to the<br />\nstatement that we are unworthy of any confidence which might be<br />\nplaced ill us. It would be a confession that we are unfit to be<br />\ncalled college men. It would be<br />\nthe honest giving away before the<br />\ndishonest, the humbling of the<br />\nvust majority before the small<br />\n<br />\neditors when asked and in most<br />\ncases they furnish this information of their own accord.<br />\nSuch co-operation, unfortunately, does not exist at _Hopkins.<br />\nTHE NEWS-LETTER plays practically a lone hand in the collee:<br />\nlion of news.. It covers what has<br />\noccurred and seldom knows what<br />\nis to occur in the future. The<br />\nfault is not with the editors, but<br />\nwith the managers of the various<br />\nteams and the officers of the various organizations. who, far from<br />\nvolunteering any information, begrudge any assistance whatever.<br />\nTHE NEWS-LEVIER regrets the<br />\ncollapse Of the Publicity Board.<br />\nIt, more than any other activity,<br />\nrecognizes the need of some bureau of information which is iii<br />\nIt position to know all . that has<br />\nhappened and is to happen at the<br />\nUniversity. The Publicity Board<br />\nfailed 1:or the sante reason that<br />\nTIIE NEWS-LE-17ER fails,. to enntain all the news—lack of cooperation.<br />\nThe past year has been a successful one for THE NEWS-LETTER.<br />\nVi'oiuiSTO() in debt it has come<br />\nII/ a 1111Sition of financial security. It is refusing advertisements,<br />\ninstead of soliciting them. It<br />\nplans to publish a daily bulletin<br />\nnext year and also to expand into<br />\na send-weekly. To do this, however. it must be assured of the<br />\nco-operation of the stullents. It<br />\n<br />\nThee facts—patent as they are<br />\nto the rational observer—were<br />\nnot manifest to the New York<br />\nAssembly. But there is yet another fact, weightier by far, which<br />\nwas still less manifest to the Assembly. This fact is that there<br />\nare attempts being made to foist<br />\nupon us the insidious doctrine of<br />\nclass-war, which has envenomed<br />\nRussia, and that such autocratic<br />\nacts as that of the New York<br />\nAssembly cannot but inflame the<br />\npeople, and thus make way for<br />\nthe Bolshevist serpent.<br />\nHeretofore, we have very ofteti<br />\nliven afflicted with men who were<br />\nwont to perch themselves upop<br />\nthe soap-box and by dint of fiery<br />\nspeech and bloody words incite<br />\nthe 1)01)111:ace to rise .up in arms<br />\nagainst our th)vernment.. What<br />\nhas been our reply to such agitators? Our reply has amounted<br />\nto this:<br />\n\"Attention, you who wotild<br />\nilreach revolution! Yoh' are misdirecting your energies here. It<br />\nis all well and good to preach<br />\nrevolution in an absolute monarchy, where revolution is the<br />\nonly means whereby a suppressed<br />\nand discontented people may improve its condition. But this<br />\ncountry of ours is not an absolute monarchy; it is a republic.<br />\nwhere representative government<br />\nprevails. Every citizen in this<br />\nhind has his representative in the<br />\n;Him inistration of his town and of<br />\nhis State and in the Federal<br />\nGovernment itself. If men want<br />\nanything here, they elect as they<br />\nrepresentatives other men who.<br />\nalso want the same thing, and who<br />\npromise to try to secure it. Therefore, we say, you are Misdirecting your energies. If you WW1<br />\nto obtain certain reforms, then<br />\ndo not try to obtain them through<br />\narms, but instead nominate for<br />\noffice candidates who desire these<br />\nsame reforms, and then convince<br />\nthe voters that they ought to<br />\nelect these candidates. Remember, once and for all, that this<br />\ncountry is ruled by ballots, and<br />\nnot by bullets!\"<br />\nShall we permit such actions<br />\nas that of the New York Assembly? Shall we tell these same<br />\nagitators, who have nominated<br />\ntheir candidates and gotten the<br />\nvoters to elect them, that ballots<br />\nwill no longer avail, and that<br />\nhenceforth bullets will have to be<br />\nemployed? Shall we open the<br />\ngates and invite the serpent that<br />\nis surely lurking without?<br />\nlEditor's Note: The above editorial,<br />\nwritten by Max Levin, was selected as<br />\nthe best presented In the recent contest,<br />\nand has been forwarded to New York<br />\nto represent THE NEWS-LETTER in the<br />\neditorial contest in which the prominent universities of the East are participating.1<br />\n<br />\nAre we going back to this system? Let us hope not. But unless an efficient HOnor System is<br />\nestablished shortly, the choice will<br />\nnot be left with us—the faculty<br />\nwill order us to return .to the<br />\nProctor System.<br />\nThus we see that it is up to<br />\nus to support the Honor System,<br />\nand to make it one that is serviceable.<br />\nly if<br />\nsem<br />\nTIIE NEWS-LETTER here takes V:11111(11 1)1111)1 ish<br />\nhas to dig for news, as it has<br />\nthe opportunity of announcing to<br />\nin the past.<br />\nthe University that it has pledged hadFlIto do<br />\nF: NEws.LErrEit would like<br />\nitself as a body and as individuals to report any infringement of to make the few issues that rethe Honor System, however main this year a success. It<br />\nslight, which may come under the would like to receive co-operation<br />\nobservation of any member of the such as would justify it in beBoard in the coming examina; coming a semi-weekly next year.<br />\nIt asks for such support, and feels<br />\ntions.<br />\nIn taking this step, THE NEWS- snre that it will get it.<br />\nLETTER hopes that it will be the<br />\nInviting the Serpent.<br />\nfirst of a long train of activities<br />\nwhich will pledge themselves to<br />\nOn April 1, 1920, the Assembly<br />\nreport any violations—the Omi- of the State of New York expelled<br />\ncron Delta Kappa, the Athletic from its midst five duly elected<br />\nBoard, the fraternities, the Jew- assemblymen, members of the Soish societies, etc.<br />\ncialist Party., .This action grew<br />\nIf the Honor System receives out of charges preferred by the<br />\nthe whole-hearted and honest sup- Judiciary Committee of the Asport .of all these activities, we sembly, which claimed that the<br />\ncan assure ourselves that there five men were \"engaged with<br />\nwill be no more talk of abolish- others in a large, well-organized<br />\ning it.<br />\nconspiracy to weaken the family<br />\nties, destroy the influence of the<br />\nThe exchange of ideas and prac- church and overturn the whole<br />\ntical experiences at the conven- fabric of a constitutional form of<br />\ntion of eastern college news- government.\" The .1 ud iciary Compapers has taught much to THE mittee tried the men on these<br />\nNEWS-LETTER, and it expects to charges, and presented a report<br />\nprofit by its increased knowledge to the Assembly, whereupon the<br />\nin the near future. One of the men were expelled.<br />\nLet us for the present not emmost important revelations was<br />\nthe existence of co-operation be- phasize the fact that, however retween the publications, the vari- pnlsive the Socialist doctrine may<br />\nous organizations, athletic office be, Socialists do not wish to<br />\nand faculty which exists at other weaken the family ties (witness<br />\nThe Harvard Glee Club, comcolleges. All happenings of in- the ideal family life of Karl<br />\nare<br />\nthey<br />\n53 men, returned recently<br />\nprising<br />\nmoreover,<br />\nthat,<br />\n;<br />\nto<br />\nMarx)<br />\nin<br />\nadvance<br />\nterest are reported<br />\nthe publication, which is thus in not interested in the influence of from its spring trip. The club<br />\nposition to cover the event thor- the church; and, finally, that they was gone a week, and during its<br />\noughly and accurately. Those do not wish to destroy constitu- tour visited Philadelphia and<br />\nwho are in a position of author- tional government, but do wish, 'Washington, and invaded the Midity are always willing to give the if anything, to extend the scope dle West as far as Cleveland, Cinbenefit of their knowledge to the of constitmi tional government. cin a Ii and I /etroit.<br />\n<br />\n\f6<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\nTHE NEWS-LETTER'S MAILBAG<br />\n<br />\nHOPKINS DOWNS SWARTHMORE<br />\n<br />\nHOPKINS HAS POOR LUCK<br />\n<br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulder the Responsibility.<br />\n<br />\nHolds Pennsylvanians Scoreless While<br />\nIt RoHs Up 12 Tal ies—Bauernschmidt and Silberstein Star.<br />\n<br />\nPlaces Fifth in S. A. I. A. A.—Hard<br />\nTrip and Small Size of Squad Responsible—To Run Saturday.<br />\n<br />\nHopkins' record in the Intercollegiate League is still unbroken, Swarthmore's *lacrosse<br />\nteam went down to a bad defeat<br />\nat the liall(ls of the Black and<br />\nBlue twelve last Saturday. The<br />\ngame, which was played at<br />\nSwarthmore, followed a very severe rain, and the field was in<br />\nsuch a condition as to slow down.<br />\nthe playing considerably. Despite this fact, the final score was<br />\n12 to 0 in favor of Hopkins, Silberstein and Bauernschmidt caging most of the goals.<br />\nFour tallies were scored up for<br />\nHopkins in the first half, and<br />\ndouble that amount in the second<br />\nperiod, although extra men, which<br />\nwere taken along with the team,<br />\nwere put in. Hopkins' team work<br />\nand passing was the same excellent brand that was shown<br />\nagainst Rutgers. The team was<br />\nsuperior to their opponents in<br />\nevery branch of the game. On<br />\nthe defense, which as a whole<br />\nplayed air-tight lacrosse, Frank<br />\nMorley and Dougherty were the<br />\nstars, the latter stopping some<br />\nmighty pretty shots.<br />\nThis is the lacrosse team's first<br />\ntrip, and the entire squad is confident that the ones to follow will<br />\nbe just as successful.<br />\nThe line-up:<br />\n<br />\nA ftey an uncomfortable and<br />\ntiring trip, seven men of the<br />\nJohns Hopkins track team fared<br />\nrai her 10101iy in the S. A. I. A. A.<br />\nchampionships, held at . Blacksburg, Va. Virginia won the meet,<br />\nwit hi T2 points; Hopkins was<br />\nfifth, with 17. The rather unsatisfactory showing Of the team was<br />\ncaused by the strenuous trip, the<br />\nchange in climatic conditions and<br />\nthe' cost of the journey, which<br />\nnecessitated pruning the team to<br />\nonly seven men. Those who made<br />\nthe trip were: Captain Bartels,<br />\nAaronson,<br />\nliriVer,<br />\nEdwards,<br />\n(;rave. Thompson, Van Ness and<br />\nAssistant Coach Lloyd.<br />\nThe best individual showing<br />\nmade by,a Hopkins man was that<br />\nof Aaronson, who in winning<br />\nthird in the 100:ya1'd dash and<br />\nsecond ill the pole vault, got<br />\nnearly half of Hopkins' points.<br />\nBartels, who was just a little out<br />\nof his form, did very well to get<br />\nthird in the mile, which was won<br />\non a slow track in the very good<br />\ntime of 4 minutes 34<br />\nseconds.<br />\nThompson, who ran second in<br />\nthe quarter, had no easy time of<br />\nit. Forced to run a fast quarter<br />\non Friday to qualify, he could not<br />\nquite come through on Saturday.<br />\nRobbins' time of 51 seconds was<br />\nfast for the slow track. Driver<br />\nfailed to qualify in this event.<br />\nEdwards, after running a 2.05<br />\nhalf to qualify, showed real form<br />\nin coining back on Saturday and<br />\ngetting third in the finals, which<br />\nwere run in 2 minutes 2 5 seconds. Van Ness, in the 100 and<br />\n220, and Thompson, in the low<br />\nhurdles, each finished just out of<br />\nplaces in their heats. Grave had<br />\nequally hard luck in the two-mile.<br />\nThe following is a summary of<br />\nthe events in which Hopkins<br />\nfigured.<br />\n<br />\nAll letters intended for publication<br />\nmust be concise.<br />\n•<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be printed<br />\nif request is made that they be omitted.<br />\nThe publication of a letter is not to be<br />\ntaken as an indorsement of its views by<br />\nTHE NEWS-LETTER, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nTo the Editor of THE NEWS-LETTER:<br />\nSir—Has the memory of one of<br />\nour heroes been so easily forgotten? ha ye we forgotten that the<br />\nflagpoles in front of thboon Hall<br />\nwere erected several years ago as<br />\na \"Layfield Memorial,\" and that<br />\nan American and a Maryland flag<br />\nwere suiqmsed to be hung from<br />\nthem ?- I have only seen an American flag hung there occasionally,<br />\nand with no regularity. The University has all H. 0. T. C. whose<br />\n\"resprit de corps\" ought to be<br />\nsuch that they should wish to have<br />\nthe flags flying at all formations,<br />\naside from the fact that they were<br />\nmemorial. I<br />\nplaced there as<br />\n5110111(1 suggest that a freshman<br />\nguava of honor be appointed,<br />\nWhose duty it shall be to see that<br />\nthe flags are put up every (lay<br />\nand taken down at sundown. This<br />\nwill till the double purpose of<br />\nkeeping the memorial alive in our<br />\nminds and the splendor of having<br />\nthe flags as an'emblem of a military organization.<br />\n<br />\nMEMBER 01.' MONUMENTAL CLUB.<br />\nTo the Editor of. THE NEWS-LETTER:<br />\nSir—Don't we realize any more<br />\nwhat our University song it?<br />\n0m't we appreciate that \"Veritas<br />\nVOS Liberabit\" is to Johns Hopkins what \"The Star-Spangled<br />\nBanner\" should be to the United<br />\nStates? And yet we sit as still<br />\nand quiet when we hear it played<br />\nas though it were just some other<br />\nsong for Hopkins' men to sing.<br />\nThere ought to be no one sitting<br />\ndown when they hear it—everyone<br />\nought to jump to his feet on the<br />\nfirst note. The. old McCoy Hall<br />\ncrowd used to do it always. And<br />\nhardly a. meeting, a debate or a<br />\nconference was. begun Without<br />\nsinging that song. .<br />\n1 am writing this particularly<br />\nafter the Hoinewood concert,<br />\n'When only a few of the student<br />\nbody arose wlwn \"Veritas vos<br />\nLiberabit\" was sung, and several<br />\nothers whom I asked afterward<br />\nsaid that they did not appreciate<br />\nthat it WIlS the ode of the University. It is, whether you realize it<br />\nor not! It is certainly entitled to<br />\nthe respect accorded others of the<br />\nsame nature. You men, who would<br />\nkeep all Hopkins' traditions, stand<br />\nup the next time it is played!<br />\n<br />\nMEMBER OP MONUMENTAL CLUB.<br />\nAn Excellent Idea.<br />\n<br />\nTo the Editor of THE NEWS-LETTER:<br />\nSir—The very favorable review<br />\nof \"The Admirable Crichton\" in<br />\nthe Baltimore Sun of April 28,<br />\n<br />\nHopkins.<br />\nPos.<br />\nSwarthmore.<br />\nDougherty<br />\nG.<br />\nPugh<br />\nMorley<br />\nr.<br />\nJoseph<br />\nTurner<br />\nVqlentine<br />\nC. P<br />\nMeyer..<br />\nD<br />\nGillam<br />\nHoffman<br />\nS. D.<br />\nJohnson<br />\nHinrichs<br />\nT. D.<br />\n.Willis<br />\nBenjamin<br />\nBloom<br />\nC<br />\nGriffiss<br />\nT. A. ........Atkinson<br />\nKauffman<br />\nJackson<br />\nS A<br />\nDefandorf.<br />\nKatzenbao<br />\nF. A<br />\nBauernschmidt...O. H.....<br />\nAlberston<br />\nStuart<br />\nI. H<br />\nMammel<br />\nSubstitutions — Hopkins: Toiler for<br />\nHoffman, Williams for Bloom, Wood for<br />\nGriffiss, Silberstein for Defandorf, Defandorf for Stuart; Swarthmore: Albertson for Pugh, Christenson for Willis, Geiges for Albertson.<br />\n<br />\n1920, by J. 0. L., Baltimore's foremost dramatic critic,reflects much<br />\ncredit on the really praiseworthy<br />\nefforts of the Johns Hopkins Dramatic Club. Moreover, it shows<br />\nin a straightforward manner the<br />\napparent lark of interest shown<br />\nby Hopkins' men in supporting<br />\ntheir ow-n activitie,. While Mr.<br />\nJ. O. Lambdin's words are encouraging and optimistic, so far<br />\naS the production itself is concerned, he is very rightfully indignant at the lacadaisical attitude<br />\nof the students and the alumni,<br />\nand he deplores the seeming lack<br />\nof appreciation of literary and<br />\ndramatic talent here at the University.<br />\nJ. 0. L. is right. That such a<br />\ntruly<br />\nadmirable<br />\nperformance<br />\n5110111(1 receive such half-hearted<br />\nsupport by the students does seem<br />\nto .indicate a lack of appreciation<br />\namong us, yet the writer hesitates<br />\nto say that we are unable to appreciate the good things of- literature and the drama. The reason<br />\n(Continued on page 12, col. 1)<br />\n<br />\nDash—Seward, Virginia;<br />\n100-Yard<br />\nThomas, Washington and Lee; Aaronson, Hopkins; Delaverge, Catholic University; Thompson, Washington and<br />\nLee. Time, 10 1-5 seconds.<br />\n440-Yard Run—Robbins, Washington<br />\nand Lee; Thompson, Hopkins; Baker,<br />\nVirginia; Glascott, Catholic University;<br />\nRoyall, Carolina. Time, 51 seconds.<br />\nMile Run—Linkous, Tech; Wharton,<br />\nTech; Bartels, Hopkins; Ranson, Carolina; Green, Virginia, Time, 4 minutes<br />\n34 3-5 seconds.<br />\n880-Yard Run—Wh•firton, Tech; Yellot. Virginia; Edwards, Hopkins; Edmunds, Virginia; Shands, Virginia. Time,<br />\n2 minutes 2 1-5 seconds.<br />\nPole Vault—Spencer, Carolina; Aaronson, Hopkins;.•Hines, Washington and<br />\nLep; Rutledge, Catholic University;<br />\npyrd and Silberstein tied for fifth place.<br />\nHeight, 10 feet 5 inches.<br />\n<br />\n5<br />\n<br />\nAT OTHER COLLEGES<br />\nIartinouth has started her<br />\nspring football practice and had<br />\n40 men out the first day. Among<br />\nthis number, there are, however,<br />\nvery few 'varsity players, since<br />\nmost of the 1919 team are now<br />\nengaged in other sports.<br />\nAssistant Coach Jack Cannell<br />\nplans to drill the men thoroughly<br />\nin the fundamentals of the game,<br />\nespecially the passing 0101 kicking<br />\ndepartments. No scrimmages will<br />\nbe held. Thus he hopes to have,<br />\nin addition to the men from last<br />\nseason's eleven, a large number of<br />\nplayers who will be ready to take<br />\nIll)the more advanced work in the<br />\nfall.<br />\nThe Athletic Board of Control<br />\nat Dartmouth has announced that<br />\nEdward E. Martin bas been appointed coach of the freshman<br />\nbaseball squad. Martin was for<br />\nthree seasons third baseman on<br />\nthe Hanover team and One of their<br />\nstar players.<br />\nCuts at Williams ape allowed<br />\non a basis of scholastic standing.<br />\nAs high as 10 per cent. allowed<br />\nabsemps iii iv be secured. Dartmouth has a similar system; a<br />\nstudent above a certain grade may<br />\nhave unlimited cuts.<br />\nColumbia has a 'I\" club for all<br />\nmen,students or alumni, who have<br />\nwon their letters in any 'varsity<br />\nsports. Its object is to instil<br />\ndeeper respect for men who have<br />\nearned Columbia's highest honors<br />\nin athletics.<br />\nThat Cornell students are supporting. the Cornell endowment<br />\ndrive is shown by the latest reports of the campus campaign.<br />\nAlready the undergraduates have<br />\nsubscribed $600,000, and the average subscription is s166.<br />\nMoving pictures as an advertising scheme are being seriously<br />\nconsidered at Harvard, where tentative plans have already been<br />\nmade with film companies to present scenarios dealing with Harvard life and men. Eight companies are said to have bid for<br />\nthe privilege, and one Itas gone so<br />\nfar as to offer to expend from<br />\n$60,000 to $80,000 on 0 five or sixreel dramatic film with all the fixings in exchange for the indorsement of the university and distribution rights.<br />\n<br />\nThe United States' representatives in the competition for the<br />\nAll industrial university to cost<br />\nDavis Cup will leave this country $5,000,000 will be erected in<br />\nfor England on May 29, to com- Shanghai, if the plans of Chinese<br />\npete in the matches which will be- educators and industrial leaders<br />\ngill on .Tune 21. Three players are attained. A novel feature of<br />\nhave been chosen already, and the the proposed university will be<br />\nfourth will be decided on shortly. the incorporation in it of a comJohnston, Tildeil and Williams plete cotton mill which will emare definite, and the remaining ploy its students and require<br />\nchoice lies between Garland, :them to perform productive toil,<br />\nJohnson and Harte.<br />\nas well as school work.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\nWARDLOW MILES TO SPEAK<br />\n<br />\nDEAN FOR ENGINEERS<br />\n<br />\nOTHER PLAYS ON THE WAY<br />\n<br />\nMATII CLUB HOLDS MEETING<br />\n<br />\nWill Address Literary Club on Thursday, May 20th at 4:30—Levin and<br />\nWiscott Read Papers.<br />\n<br />\nAppointment of Dr. Whitehead ruts<br />\nDepartment of Engineering on an<br />\nEquality with Arts and Sciences.<br />\n<br />\nAll Hopkins Productions May Appear<br />\nInformally McCleary and \"Miti.h\"<br />\nCarroll Are The Authors.<br />\n<br />\nDr. Hulburt Addresses This Year's<br />\nLargest Audience- \"1 he Circular<br />\nPoints at Infinity\" His Subject.<br />\n<br />\n• The Literary Club has been very<br />\nfortunate in securing Dr. L.<br />\nWardlow Miles, headmaster of<br />\nGilman School, to deliver a public lecture on the afternoon of<br />\nThursday, May 20, in the Civil<br />\nEngineering Hall, at 4.15 o'clock.<br />\nThe subject of the lecture will<br />\nbe \"Poetry of the War,\" a theme<br />\nwhich Dr. Mile is admirably<br />\nqualified to speak upon, as he<br />\nwas a captain with the 307th Infantry and received the Congressional Medal for bravery.<br />\nAt the meeting of the Literary<br />\nClub on Friday night, May 7, two<br />\nexcellent papers were read by<br />\nWiscott and Max Levin on \"Andreyer\" and \"The Jews and Their<br />\nLiterature,\" respectively.<br />\nIn speaking of this great Russian, Wiscott said: \"In the writings of Andreyer may be seen the<br />\npen of Tolstoy, Dostoievsky,<br />\nTchekov and Gorky. From Tolstoy, he seems to have learned how<br />\nto see things and how .to convey<br />\nthem to the reader; from Dostoievsky, he seems to have learned how<br />\nto penetrate the hidden recesses<br />\nof the human soul and to lay bare<br />\nits secrets without skame or fear;<br />\nfrom Tchekov he has acquired that<br />\nbrevity and power to depict in a<br />\nfew bold strokes the whole drama of life.\" And yet he acknowledged the Bible as his greatest<br />\nteacher.<br />\n'Madness and Horror,'the first<br />\ntwo words of 'The Red Laugh,'<br />\n\\\\ hiell is classed by many critics<br />\nas his master piece, might well<br />\nserve as the text for Andreyer's<br />\ncomplete works. Solitude, silence<br />\nand death are his themes. He<br />\nis a symbolist and an impressionist. He is a musician of the Russian soul, who, with a technique<br />\nmore dazzlingly brilliant than a<br />\nKreisler,•produces from the soulstring of Russian character a<br />\nmelancholy minor melody which<br />\nis eternally haunting.\"<br />\nMax Levin, in discussim, the<br />\nJews and their literature, 71ivided his subject into four literary<br />\nperiods. He traced Hebrew literature from its growth down to<br />\nthe present day. \"The flourishing<br />\ncondition of modern Hebrew literature is directly due to a movement known as the Haskalah<br />\nmovement, meaning 'enlightenment.' Thanks to this movement,<br />\nwe find today a literature in the<br />\nHebrew language which will undoubtedly some day attain the<br />\nsize and importance of English,<br />\nFrench or German literature.\"<br />\nThe chiefs among the Hebrew<br />\nwriters of today are: Asher Ginsberg, who is probably the greatest master of Hebrew writers;<br />\nLeon Gordon and H. N. Bialik,<br />\nboth poets; Shololom Alaichen,<br />\nthe Jewish Mark Twain; and Is-<br />\n<br />\n- The Dramatic Club expects to<br />\nWith the appointment of Dr.<br />\nJohn Boswell Whitehead, profes- end its season of 1920 with an insor of electrical engineering, to formal production of two all-.<br />\nthe new office of Dean of the De- Hopkins plays; that is, plays<br />\npartment of Engineering, the written, produced and attended<br />\nTrustees placed the Engineering by Hopkins' men. These two<br />\nSchool on equality with the Col- plays are: \"Mosaics,\" by Mclege of Arts and Sciences and the Cleary, and \"Burning the MidSchool of Medicine, each of which night Oil,\" by Mitchell Carroll.<br />\nhas its own Dean for administra- 130th of them are snappy little<br />\n'farces, well written, and especialtive work.<br />\nThe appointment of Dr. White- ly adapted to a college presentahead is regarded as an official tion.<br />\nWork on the two plays has been<br />\nrecognition of the part he has<br />\nplayed in the rapid growth and suspended for some time, because<br />\ndevelopment of the School of En- of the second production of \"The<br />\ngineering, which, since its foun- Admirable Crichton,\" but now<br />\ndation six years afro, has forged that has passed, all efforts are<br />\n\" of technical bent on making these last presento the front rani:<br />\nschools of the country, and is tations a successful termination<br />\nnow in a class with the engineer- of the year.<br />\nThe object of this performance<br />\ning schools of Cornell, Lehigh,<br />\nCarnegie Institute and others of is not to raise money, but to inlike calibre. Of the 2,750 stu- terest the Hopkins student body<br />\ndents enrolled in the University, and st inotlate a greater interest<br />\n675 are taking engineering in llopl,ins' dramatics for the<br />\nnext yea v. No admission will be<br />\ncourses.<br />\nDr. Whitehead now ranks with charged, and the farces will be<br />\nDr. Latane and Dr. .T. Whitridge presented without costume, either<br />\nWilliams, Dean of the School of in the Barn or the Civil EngineerMedicine. As yet the School of ing Lecture Hall, and probably<br />\nhygiene and Public Health has for the student body only. Alno Dean, its administrative af- though none of \"The Admirable<br />\nfairs being handled by Drs. Will- Crichton\" cast will be included,<br />\niam Welch and William H. How- yet the careful selection from a<br />\nell, Director and Assistant Di- goodly number of candidates insures a well-portrayed presentarector, respectively.<br />\ntion.<br />\nadminand<br />\nn<br />\nIn the organizatio<br />\nistration of the courses, Dr.<br />\nIn their first showing of the<br />\nWhitehead has been extremely active, and since 1914 has been season, the Princeton crews took<br />\nsecretary of the Advisory Com- two out of three races in the Harmittee of the department, dis- vard spring regatta on. the<br />\ncharging many duties of a Dean. Charles River, winning the 'varHe was largely responsible for the sity and freshman contests, but<br />\nsuccess of the evening courses and losing to Harvard in the junior<br />\nthe Department of Marine Engi- 'varsity race. In all three events,<br />\nneering and Navigation, esta%- the Princeton crews trailed the<br />\nlished in 1917 at the request of Harvard boats for the first mile<br />\nand a-half. At this • point the •<br />\nthe Shil)ping Board.<br />\nThe teaching methods and per- Princeton coxswains called for<br />\nsonnel of the evening classes are sprints, which spelled victory for<br />\nresults of the policy of Dr. the 'varsity and freshman boats,<br />\nWhitehead and his associates in while the junior 'varsity crossed<br />\nforming a close relationship be- the line a quarter of a length between the department and the hind the Crimson shell's prow.<br />\nvarious industries in the city<br />\nand State. This year nearly 350<br />\nThe University of Michigan is<br />\nstudents are enrolled, most of to have a Sunday college paper.<br />\nI hem young men and women em- It will contain feature articles<br />\nployed in the industries of Bal- written by the students and factimore, who desire to extend their ulty. It is the only paper of its<br />\ntechnical training.<br />\nkind known.<br />\nDr. Whitehead was graduated. --------from the old Department of Elec- lowship in Carnegie Institute of<br />\ntrical Engineering, headed by Techliology.<br />\nProf. Henry Rowland, in 1893.<br />\nSeveral years later he formed<br />\nPoi- three years he was employed a partnership with Charles R.<br />\nby the Westiiighotise Electric Reeder. He served as consulting<br />\nCompany at Pittsburgh, and then engineer successively for the<br />\nwent to the Niagara Falls Power Maryland Electric Railway, State<br />\nCompany, New York.<br />\nHospital at Crownsville, Md.,<br />\nIn 1897 he returned to Hopkins, Gilman Country School and the<br />\nand in 1898 he received the de- power plant here. In 1914 he was<br />\ngree of bachelor of arts. In 1902 appointed professor of electrical<br />\nhe was made a doctor of philoso- engineering in the new Engineerphy and received a research fel- ing Department.<br />\n<br />\n(continued on page 10, col. 11<br />\n<br />\nOn Thursday. May 6, the largest<br />\nmeeting this year of the Undergraduate Mathematics Club was<br />\naddressed by Professor Lorraine<br />\nS. Hulburt. Dr. Hulburt's subject was, \"The Circular Points at<br />\nInfinity.\" In order to make the<br />\nsubject intelligible to the uninitiated, he only skirted the misty<br />\nmid-region of projective geometry<br />\nand approached the two circular<br />\npoints by the open road of analytics. Thus these points, altogether imaginary and infinitely<br />\nremote though they are, were<br />\nbrought, under the skilful handling of the speaker, into the mental touch of the undergraduates<br />\npresent. Time failed before the<br />\nprofessor could take up any of<br />\nthe ramifications of the subject,<br />\nbut he consented to continue the<br />\nexposition at the next weekly<br />\nmeeting.<br />\nIt is the purpose of the Undergraduate Mathematics Club to<br />\ntake up those points sufficiently<br />\nelementary to be understood by<br />\nall members, but which are not<br />\ninchuled in any subject in the undergraduate mathematics curriculum. Dr. Hulburt has declared<br />\nhis intention of giving a course<br />\nin projective geometry next year,<br />\nso that students who were enough<br />\ninterested in his address to wish<br />\nto go deeper into the subject will<br />\nhave this opportunity. At present, however, the subject is not<br />\ntaught. The meetings of the club<br />\nare held weekly at 12.30 o'clock on<br />\nthat day when fewest competing<br />\nattractions are offered. Since the<br />\ndiscussion generally lasts during<br />\nmost of the lunch period, the<br />\nproper, procedure is for members<br />\nto bring their sandwiches with<br />\nthem to the meeting place and eat<br />\nthem some tune between the principle theorem and its corollaries.<br />\nThe Memorial Dormitory Fund.<br />\n<br />\nThe Alumni Memorial Dormitory Fund had reached the total<br />\n$200,000 by the end of the Commemoration Day dinner, February 2:t, 1920. On May 4, the commit tee in charge of the campaign<br />\n!mule arrangements to complete<br />\nthe fund, so that the $300,000<br />\nneeded for the dormitory would<br />\nla raised by Commemoration<br />\nDay. Every effort will be made<br />\nIt) 'secure subscriptions from the<br />\nalumni and friends of the University. A number of special memorials are being planned by several classes. These will take the<br />\nform of suites of rooms, the Commons Hall, the dining hall, etc.,<br />\nin the proposed dormitory.<br />\nIf two red, lips were upturned to your<br />\n<br />\nown,<br />\nWith no one to gossip about it.<br />\nWould you pray for endurance to leave<br />\nthem alone?<br />\nWell—maybe you would, but I doubt<br />\n—Ex.<br />\nit.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\nNa,<br />\n<br />\nGEOLOGISTS BACK FROM ,PERU<br />\nDr. Singewald Returns From Third Expedition to South America Much<br />\nAdditional Knowledge Obtained.<br />\n<br />\n.. and at the Naval<br />\nAcademy, Annapolis<br />\neAr fact:<br />\nAt Annapolis, as with Navy<br />\nOfficers generally, Fatima is by<br />\nfar the -largest-selling cigarette.<br />\nThis is true both at the Officers'<br />\nMess in the Academy and in the<br />\ntown itself, while among the<br />\nmid3hipmen Fatima is especially<br />\npopular.<br />\nrievalrA4.,...4-4.<br />\n<br />\nT<br />\nI<br />\nM<br />\nA Sensible Cigarette<br />\n<br />\n,<br />\n<br />\n'just enough Turkish\"<br />\n<br />\n, tgrAtt--<br />\n<br />\nAck,<br />\n<br />\n•<br />\n<br />\nA<br />\n<br />\nThe fact that the Naval Cadets are<br />\npicked men, representing every<br />\nState in the Union, makes this one<br />\nof Fatima's strongest endorsements.<br />\nHere at Annapolis as elsewhere,<br />\nmen have discovered that cigarette<br />\ncharacter depends on the right proportioning of Turkish tobacco.<br />\nSo Fatima owes its popularity to<br />\nthe fact that it contains not too<br />\nmuch, i- lor too little, but just enough<br />\nTurkish—just enough to taste right,<br />\n<br />\ne •<br />\n<br />\nI.1<br />\n<br />\n.S.<br />\n<br />\n—mut_<br />\n—<br />\nArlieglart<br />\n<br />\n•<br />\n<br />\n4-!•.,4**<br />\n4<br />\n<br />\n.. :..x.c....1_-:,-..i\".,•;:' ,<br />\n1<br />\n<br />\n- • --<br />\n<br />\nY<br />\n11'e<br />\n<br />\n;-(<br />\n<br />\nDr. Joseph T. Singewald, Jr.,<br />\nassociate professor of economic<br />\ngeology, returned to the University on Friday, after a fivemonths' trip to Peru, where he<br />\nhas been engaged in geologic investigations. Dr. Singewald was<br />\ngranted leave of absence to return to South America early last<br />\nDecember, shortly after his return<br />\nfrom the George Huntington<br />\nWilliams' Memorial Expeditions<br />\nto South America, which was sent<br />\nout by the University toward the<br />\nclose of the last academic year.<br />\nOn that expedition, Professors<br />\nBerry and Singewald were unable<br />\nto visit the northern part of Peru,<br />\na region of considerable importance in the geologic history of<br />\nthe west coast of South America.<br />\nOn this trip, Dr. Singewald spent<br />\nconsiderable time in an exhaustive investigation of that part of<br />\nthat region. In addition to making a careful study of the stratigraphy of the area, Dr. Singewald<br />\nsecured a large collection of fos.:<br />\nsils, which he has brought with<br />\nhim for the Department of Geology, and which will be the object of further researches in that<br />\ndepartment.<br />\nThis riew study of some of the geologic problems of -South America<br />\nfits in excellently with the work of<br />\nthe Williams' Expedition and will<br />\npermit of more comprehensive interpretation of the South American work previously done by<br />\nmembers of the Geologic Department. This is Dr. Singewald's<br />\nthird geologic expedition to South<br />\nAmerica. For five years he has<br />\nbeen specializing in the geology<br />\nand mineral resources of that continent and now ranks among the<br />\nhighest authorities in that field.<br />\nThe region in which Dr. Singewald worked is close to the sea<br />\nand at less than 4° S. latitude,<br />\nso that he avoided the unusually<br />\nsevere winter of the United States<br />\nand instead suffered extremely hot<br />\nweather. So intense were the rays<br />\nof the tropical sun, that the members of the party were tanned<br />\nthrough their shirts and in the<br />\nafternoon, the ground frequently<br />\nbecame so hot that it burned<br />\nthrough the soles of the shoes to<br />\nsuch an extent as to make it almost impossible to remain tanding at one spot. The region is<br />\nalso such an arid one that no<br />\nfresh water is naturally available,<br />\nand the party had to be supplied<br />\n,with distilled sea water. Since<br />\nthey. were able to enjoy a magnificent surf bath at the close of<br />\nthe day's work and spend the<br />\nevenings on a porch overlooking<br />\nthe sea and fanned by cooling sea<br />\nbreezes, the heat of the day was<br />\nbearable.<br />\nThe work itself consisted of an<br />\nexamination of one of the oil<br />\n(Continued on page 8, col. 4)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\n8<br />\nORME!<br />\n<br />\nottittgl6ranis<br />\n(Mahn<br />\n<br />\nFOR YOUNG MEN AND MEN<br />\nWHO STAY YOUNG<br />\n<br />\nNOTED SOCIALIST TO SPEAK HERE<br />\nJohn Spargo to Lectut e Under Auspices<br />\nof Social Science Club—The Public<br />\nIs Cordially Invited.<br />\n<br />\nOn Tuesday, May 11, at 4.1:;<br />\nP.- M., in the Civil Engineering<br />\nLecture Hall, John Spargo, of international reputation as Socialistic lecturer, writer and worker.<br />\nwill deliver a lecture, entitled<br />\n\"The Social Problem After the<br />\nWar.\"<br />\nMr. Spargo has been identified with the Socialistic cause in<br />\nEngland since 1895. Coming to<br />\nAmerica in 1901, he entered upon<br />\nhis present career of writer and<br />\norganizer. He was prominent in<br />\nthe founding of the American Alliance for Labor and Democracy,<br />\nand in 1917 assisted in the formation of the National Socialistic<br />\nParty. Ile is the author of over<br />\na score of books, the latest of<br />\nwhich is upon the subject of Bolshevism. hi short, he iA one of<br />\nthe foremost Socialists in America.<br />\nThe lecture is under the a us<br />\npices of the Social Science Club.<br />\nThe public are cordially invited<br />\nto attend.<br />\n\"Sun\" Man Gives Talk.<br />\n<br />\nand workmanship are as important as the all-wool fabric<br />\nyou select if you wish to add to your<br />\nself respect and the confidence of<br />\nothers in you. Society Brand Clothes<br />\nhave a national reputation as the leader in<br />\ncorrect style and careful hand -workmanship.<br />\nWITH THE VARIED GRADES OF CLOTHING FLOODING<br />\nTHE MARKET, LOOK FOR THE LABEL AS YOUR GUIDE<br />\nALFRED DECKER & COHN, Makers<br />\n<br />\nChics:o<br />\n<br />\nSOCIE'l Y ERAND CLOTHES, Limited, for Canada<br />\n<br />\nNew Yc.rk<br />\n<br />\nHub<br />\n<br />\nMontreal<br />\n<br />\nBALTIMORE, CHARLES<br />\nAND FAYETTE STREETS<br />\n<br />\nFollowing the practice of having outsiders give talks on their<br />\nrespective professions, Dr. French<br />\nsucceeded in procuring Mr. Porn r, of The Sun staff, to speak to<br />\nthe Freshman English composition class. After explaining the<br />\nopportunity for Hopkins' men to<br />\nwork on The Suit during the sumMr. Porter went on to speak<br />\nabout the newspaper \"game\" as a<br />\nwhole. In part, he said: \"The<br />\nreal object of a newspaper is its<br />\nnews, not the features, entertainments or editorials.\" Local news<br />\nis of paramount importance, and<br />\na \"spicy divorce story is desired<br />\nabove all.\" Mr. Porter pointed<br />\nout that everyone starts as a<br />\n\"cub\" reporter, and is usually assigned to police news at first. He<br />\nexplained the general workings of<br />\nthe news-collecting agency of a<br />\nbig metropolitan newspaper, and<br />\nin ending, assured the freshmen<br />\nthat \"no one but a millionaire<br />\ncan own a big paper today.\"<br />\nConcerning college football teams,<br />\nToo oft it comes to pass,<br />\nThe man who's halfback in the field,<br />\nIs fullback in his class.<br />\n<br />\nGEOLOGISTS BACK FORM PERU<br />\n•<br />\n<br />\n(Continuedfrom page 8)<br />\n<br />\nfields of the northern coastal region of Peru. The geology of the<br />\nregion proved to be unusually<br />\nComplicated and difficult, making<br />\nthe problem of unraveling it of<br />\nintense interest. The work showed<br />\nthe incompleteness and incorrectness of •previous work in the region. and has resulted in the- first<br />\ncorrect interpretation of its geology. Consequently it furnishes<br />\nquite an addition to the knowledge of South American ricreolo\"V-<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, MAY 11, 1920.<br />\n<br />\n9.<br />\n<br />\nORATORS TO HOLD MEETING<br />\n<br />\nA good guess for<br />\nyou would be—<br />\n<br />\n—There's style<br />\nto them<br />\n<br />\nhub<br />\n'Baltimore, Charles and Fayette<br />\n<br />\n— AMUSEMENTS —<br />\n<br />\nAUDITORIUM<br />\nAT 8.15<br />\n50c to $2.00<br />\n<br />\nl'uN1GHT<br />\n<br />\nThe Oratorical Society will<br />\nmeet in Room 112, Gilman Hall,<br />\non Friday, May 14, at 1.30 P. M.<br />\nIt is planned to make this the<br />\nbanner meeting of this year. Mr.<br />\nAlbert Hammond will deliver a<br />\nspeeeli upon some current topic<br />\nand there will also be an address<br />\nby a representative of the 0. P.<br />\nK.At this meeting pl-u us will be<br />\ndiscussed, and a committee probably appointed to 'aid iii increast...<br />\n• the, membership by urging<br />\npersons specially qualified in oratory to join. This meeting will he<br />\none of general interest, and everyone is invited.<br />\nBLACK AND BLUE LOSES TWICE<br />\n<br />\n(Colitinitrdfrqin page<br />\nthe Engineers runless: during the<br />\neinainder of the game.<br />\nWeigele was the individual star<br />\nof the game, for his twirling completely baffled the visitors.. Hopkins threatened .only in the eighth,<br />\nwhen 'men were on second and<br />\nthird with only one out, but Weigele tightened and the rally ended. Daly starred in the field for<br />\nStevens, while Broomsburg played<br />\na good game for the Black find<br />\nBlue, making several spectacular<br />\nplays.<br />\nThe score:<br />\n<br />\nThe SELWYNS Serve<br />\n<br />\nTEA FOR 3<br />\nWith the original company, including<br />\nARTHUR BRYON,<br />\nLAURA HOPE CREWS,<br />\nFREDERICK PERRY.<br />\n<br />\nKurtz, rf<br />\nDaley, 3b<br />\nBarry 9S<br />\nHuneke, 2b<br />\nLast, cf<br />\nDonnelly, If<br />\nEgger, lb<br />\nFerrari, c<br />\nWetgele, p<br />\n.Tobin, rf<br />\nHurst, cf<br />\nTotals<br />\n<br />\nNext Week—Seats Now.<br />\nOliver Morosco Presents<br />\nTHE BIRD OF PARADISE<br />\n<br />\nSpring practice for the Army<br />\nfootball men has started at West<br />\nPoint. The training will be under the management of Capt.<br />\nCharles D. Daly, head coach last<br />\nyear, who will act again in this<br />\ncapacity in the fall. A limited<br />\nnumber of cadets reported for the<br />\nfirst work-out, but a large squad<br />\nwill be started drilling in a few<br />\ndays.<br />\n<br />\nIN THE YOUNG MEN'S SHOP—<br />\n<br />\nMr. Hammond and an 0. D. K.<br />\nRepresentative Will Speak—All<br />\nStudents Are Urged to Attend.<br />\n<br />\nSTEVENS.<br />\nAb. 11. 1-1. 0.'A. E.<br />\n1 1 0 0 0 0<br />\n4 O 0 3 4 0<br />\n4 0 0 1 9 1<br />\n1<br />\n4 O 0 1<br />\n3 0 0 1 0 0<br />\n4 1 9 0 0 0<br />\n'0 1 12 0 0<br />\no 1 0 9 1 0<br />\n'O 0 0 2 0<br />\n1 0 0 0 0 1<br />\n1 0 0 1 0 0<br />\n,28<br />\n<br />\n3<br />\n<br />\n3 28 13<br />\n<br />\nJOHNS HOPKINS.<br />\nAb. R. H. 0.<br />\nBenson, cf<br />\n.. 3 0 0 3<br />\nBarchet. 2b<br />\n4 0 0 4<br />\nEgerton, lb<br />\n3 0 1 5<br />\nCox, If<br />\n4 0 0 0<br />\nKnecht. rf<br />\n4 0 0 1<br />\nBloomsburg, 3b....... 3 0 0 3<br />\nReifsneider, ss<br />\n3 0 1 0<br />\nWood, c<br />\n3 0 0 8<br />\nWelliver, p.<br />\n1 0 0 0<br />\nLove, p<br />\n2 0 0 0<br />\n<br />\n3<br />\n<br />\nA. E.<br />\n0 0<br />\n2 0<br />\n0 0<br />\n0 0<br />\n0 0<br />\n3 2<br />\n1 0<br />\n2 0<br />\n0 1<br />\n2 1<br />\n<br />\nTotals<br />\n30 0 2 30 10 4<br />\nScore by innings:<br />\nStevens<br />\n0 0 1 2 0 0 0 0 0-3<br />\nJohns Hopkins<br />\n0 0 0 0 0 0 0 0 0-0<br />\nEarned Run—Stevens, 1. Bases on<br />\nBalls—Off Weigele, 1; off Welliver, 4.<br />\nFirst Base on Errors—Stevens. 3; Johns<br />\nHopkins, 2. Two-base Hit—Donnelly.<br />\nStruck Out—By Weigele, 9; by Welliver,<br />\n3: by Love, 2.. Passed Balls—Wood (2).<br />\nHit by Pitcher—By Welliver (Weigele).<br />\nUmpire—McMahon. Time of Game-1<br />\nhour and 15 minutes.<br />\n<br />\n\"DERBY'—a new Spring Suit; double-breasted, high-waisted skirt<br />\neffect, with outside change pocket. In plain colors and novelty<br />\nmixtures.<br />\nBALTIMORE'S BEST STORE<br />\n<br />\n,./thirnee<br />\nHOWARD AND LEXINGTON<br />\n<br />\nSHIRTS<br />\n<br />\nThe score:<br />\nWESLEYAN.<br />\nAb. R. H. 0.<br />\nJones,: :lb<br />\n5 1 2 1<br />\nBateman, cf<br />\n4 3 2 2<br />\nBoote,<br />\n4 0 1 3<br />\nWeb<br />\n.ss<br />\n4 1 1 8<br />\nJacobs, lb<br />\n4 0 • 1 12<br />\nCamp, 21,<br />\n3 1<br />\nRaines, If<br />\n3'2. 0<br />\nTomlinson. rf<br />\n3 0 0 0<br />\nConnolly. p<br />\n4 1 1 0<br />\nThornton, if<br />\n1 0 0 0<br />\n<br />\nA. E.<br />\n2 0<br />\n0<br />\n1 0<br />\n4 2<br />\n0<br />\n1<br />\n0<br />\nO 0<br />\n6 0<br />\nO 0<br />\n<br />\nNECKWEAR<br />\n<br />\nLelranc & Ault<br />\n421 N. Noward St.<br />\nHOSIERY<br />\n<br />\nGLOVES<br />\n<br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br />\n<br />\n• Totals<br />\n<br />\n35 10 13 27 14 2<br />\nJOHNS HOPKINS.<br />\nAl). R. H. 0. A. E.<br />\nBenson. 'cf<br />\na 0 2 2 0 0<br />\nI:arehot, 21,<br />\n5 1 0 4 2 1<br />\nEgerton, lb<br />\n4 1 0 7 1 1<br />\ncox, if '<br />\n4 1 2 5 0 1<br />\nKnecht. rf., p<br />\n3 1 2 0 0 0<br />\nBloomsburg, 313<br />\n4 0 2 0 5 3<br />\nReifpneider, as<br />\n4 1 0 2 1 0<br />\nWood, 'C<br />\n4 0 1 3 1 0<br />\nLove, p., rf<br />\n4 0 0 0 1 0<br />\nTotals<br />\n37 5 9 24 11 G<br />\nScore by innings:<br />\nWesleyan<br />\n1 3 0 0 4 1 0 1 x-10<br />\nJohns Hopkins<br />\n0 1 4 0 0 0 0 0 0— 5<br />\nThree base<br />\nHits —Wood, Raines,<br />\nWebb.Two - base<br />\nHits—Connolly,<br />\nKnecht. .Sacrifice HitsJacobs, Webb.<br />\nLefton Bases—Johns Hopkins, 6; Wesleyan, 3. Stolen Bases—Bateman (3),<br />\nCamp (2). Webb, Jones, Bloomsburg.<br />\nBases on Balls—Off Love, 2; off Knecht,<br />\n1: off Connolly, 1.<br />\nStruck Out—By<br />\nKnecht. 1; by Connolly, 1.<br />\nHit by.<br />\nPitcher—By Love, 1. Double Play—<br />\nWebb to Jacobs. Hits—Off Love, 11;<br />\noff Knecht, 2; off Connolly, 9, Umpire—<br />\nRerty. Time of Game-2 hours and 15<br />\nminutes.<br />\n<br />\nLuncheon<br />\n<br />\nAfternoon Tea<br />\n<br />\nSODAS AND SUNDAES<br />\n<br />\nMUSIC<br />\n<br />\nR.G.LOY & COMPANY<br />\n1 W. UNIVERSITY PARKWAY<br />\n<br />\n••<br />\n<br />\nOPPOSITE J. H. U. ATHLETIC FIELD<br />\n<br />\nDrug Store for J. H. U. Boys<br />\nPHONE HOMEWOOD 2121<br />\n<br />\nBuy an (H) Pipe made special<br />\nfor the Boys.<br />\n<br />\nLEMMERT<br />\n<br />\nCONVENTION WEI L ATTENDED<br />\n(Continuedfrom page 1)<br />\nMADE TO ORDER<br />\ntended by over 60 men. The<br />\nAND<br />\nspeakers were men of well-known<br />\nreputation in the newspaper<br />\nFINISHED CLOTHES<br />\nworld : Mr. Herbert Swope and<br />\nMr. Don Carlos Seitz, of the New<br />\nPLAZA BUILDING<br />\nYork World; Mr. J. L. Heaton,<br />\nof the New York Times; Mr. Ar- 19 AND 21 EAST FAYETTE STREET<br />\nthur Brisbane, of the New York<br />\nEvening Journal; and Mr. Franklin G. Dunham, ex-president of<br />\nORTMAN'S<br />\nthe Pi Delta Epsilon, the honorary journalistic fraternity. At \"Queen Quality\" Home-Made Candies<br />\n80c. a pound<br />\nthe banquet it was announced that<br />\nthe Cornell Sun, was the winner<br />\nVISIT OUR ICE CREAM PARLORS<br />\nof the editorial contest.<br />\n227 N. HOWARD STREET<br />\nAfter the banquet, the delegates were taken on a tour of in- ARTISTIC PHOTOGRAPHS<br />\nspection through the offices of the<br />\nNeu- York World. Here • they<br />\naw froni.start to finish the prep319 North Charles Street<br />\naration of one of the largest papers in the. country.<br />\nSPECIAL DISCOUNT TO I. H.U. STUDENTS<br />\n<br />\nIlgenfritz<br />\n<br />\nROBERT PAUL IULA<br />\nTHE LAFAYETTE<br />\nCHOCOLATE SHOP<br />\n<br />\nORCHESTRA DE LUXE<br />\n<br />\nCharles and Lafayette Ave.<br />\nTELEPHONE. GILMOR 2929<br />\n<br />\nTHE ARCADE<br />\nTEA ROO/A<br />\n524 N. Charles St.<br />\n<br />\n/v\\USIC FOR DANCES, RECEPTIONS, ETC.<br />\nRESIDENCE, 014 FULTON AVENUE<br />\n<br />\n\fTHE. JOHNS<br />\n<br />\n10<br />\n<br />\nHOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\nAll the world<br />\nloves a lover —<br />\nAnd all discriminating<br />\nlovers of cigarettes love<br />\nMurads<br />\nBecause Murads are pure Turkish, the world's most famous tobacco<br />\nfor cigarettes.<br />\nAnd the Fame of Murads grows<br />\nand grows and grows—they are 100<br />\nper cent Turkish, and they are 100<br />\nper cent popular with connoisseurs<br />\neverywhere.<br />\n<br />\nis true that \"ordinary<br />\ncigarettes cost a trifle less.<br />\nIt<br />\n<br />\nJudge for yourself—!<br />\n<br />\n-<br />\n<br />\nDramatic Club.<br />\n<br />\nThe officers of the Dramatic<br />\nClub (Charles Leber, president;<br />\nHarry Morriss, secretary; Bartus<br />\nTrew, business manager) wish to<br />\nheartily thank all the members of<br />\nthe University who offered their<br />\niiervices to the club to assist in<br />\nproducing the second performance<br />\n'of \"The Admirable Crichton.\"<br />\nThis is especially meant for the<br />\nmen who took parts as 'servants<br />\nin the first act. These men made<br />\npossible the whole show, and by<br />\ntheir thorough attention to the<br />\nparts assigned to them, made the<br />\n\"tea scene\" a finished piece of actg. The constitution of the Dramatic Club requires a man who<br />\n<br />\nhas not a speaking part of over 25<br />\nlines to serve for two collegiate<br />\nyears before being admitted to<br />\nmembership in the club. To the<br />\nproperty men, also, much success<br />\nis to be attributed. Their work<br />\nbehind the scenes and in gathering together the necessary properties was done with as much<br />\nsmoothness and carefulness as<br />\nthough they were accustomed to<br />\nput a play on every week.<br />\nThe ranks of the club will be<br />\ngreatly depleted by graduation<br />\nthis year. Charles Leber, Harry<br />\nMorriss, John Bartels, all founders of the club; John Lewin, Paul<br />\nHinrichs, Aylett Coleman, Mitchell Carroll and Terry Burger,<br />\n<br />\nall of whom held important places<br />\nin the cast both this year and<br />\nlast, are all members of the graduating class.<br />\nFive events have been arranged<br />\nin the tentative program for the<br />\nInter-collegiate Flying Carnival<br />\non<br />\nto be held at Mineola<br />\nMay 7. The feature contest will<br />\nbe the cross-country race, in which<br />\n11 colleges have entered planes.<br />\nThe other events will be: Landing<br />\nfor mark, slow speed landing, an<br />\nobstacle race, and maneuver and<br />\nstunt flying.<br />\n<br />\nWARDLOW MILES TO SPEAK<br />\n<br />\n(Continuedfrom page 5)<br />\n<br />\nrael Zangwill, that master portrayer of Jewish Ghetto life.<br />\n\"With such a brilliant past behind then?,, may not the Jews<br />\n'hope for a, still more brilliant future in the fifth period of their<br />\nhistory—a period which was born<br />\nout of the World War, a period<br />\nin which once again a Jewish nation will live in a Jewish land r<br />\nRocks on the mountains,<br />\nFish in the sea,<br />\nLook how the profs<br />\nMake a .fool o.uter_ine.<br />\n—Ex.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 192().<br />\n13 SOUTH STREET<br />\nSafe Deposit and<br />\nCrus<br />\nt<br />\nBaltimoreSurplusCaanditaPlr<br />\nCompany of<br />\n<br />\n600$,0<br />\n2070<br />\n50 000<br />\nProfits,<br />\n<br />\nActs as Trustee of Corporation Mortgages. Fiscal Agent for Corporations and<br />\nIndividuals, Transfer Agent and Registrar. Depository under plans of reorganization.<br />\n<br />\n11<br />\n<br />\nR. 0. T. C. READY FOR INSPECTION<br />\nBattalion Keyed Up to Make Hopkins<br />\na \"Distinguished\" Institution - A<br />\nLarge Number Drill Voluntarily.<br />\n<br />\nActs as Executor, Administrator, Guardian, Trustee, Receiver, Attorney and<br />\n<br />\nAgent, being especially organized for careful management and settlement of estates<br />\nof every character.<br />\nOne-story fireproof building, with latest and best equipment for safety of<br />\ncontents. •<br />\nSafes for rent in its large fire and burglar proof vaults, with spacious and welllighted coupon rooms for use of patrons.<br />\nSecurities held on deposit for Out-of-Town Corporations and persons.<br />\n<br />\nThe IL 0. T.. F. has been working hard lately to put on the finishing touches for the inspection<br />\nthat is to come on Wednesday and<br />\nThursday of this week.<br />\nOn Tuesday afternoon of last<br />\nH. WALTERS, Chairman of Board.<br />\nJOHN J. NELLIGAN, Pres.<br />\nJOHN W. MARSHALL. Vice-Pres.<br />\nweek the entire unit had a setting-up drill on the oval in front<br />\nJ. W. BREEDLOVE & CO.<br />\nTRAYER<br />\nWilbut F. Parker<br />\nCarl H. Nocke<br />\nof<br />\nthe Hopkins Club. Captain<br />\nBusiness Colleae<br />\nEllis, who has the ability of a<br />\nIncorporated<br />\nMerchant Tailors<br />\nborn gymnasium instructor, was<br />\nCharles and Fayette Sts., Baltimore, Md.<br />\nGAITHER BUILDING, 111 N. CHARLES ST.<br />\nin charge; the cadet officers makA distinctive business school. Day and night<br />\nPhone St. Paul 2625<br />\nclasses now open. You are cordiaily invited to<br />\ning corrections. After the exercall and talk with us.<br />\nPhone St. Paul 5626.<br />\nSpring Styles<br />\nFine Goods at ,`,71Coderale Prices<br />\ncises, the companies. went to different parts of the campus to<br />\npractice some work in open order<br />\nTHE<br />\nsignals.<br />\nCalvert and 'Thirtieth Sts.<br />\nThursday's drill was by classes,<br />\nCollar Hug Clothes<br />\nthe sophomores in map-making<br />\nBaltimore (mg<br />\nAllows J. H. U.students special discounts and the freshmen<br />\nyStrects<br />\nwith another<br />\npractical machine gun problem.<br />\n. . very<br />\nAt the close of the period a speHAND<br />\nCollege Text-Books SECOND<br />\nand NEW<br />\ncial appeal was made to. the men<br />\n.. best<br />\nto turn out for an hour's volunSMITH'S BOOK STORE<br />\ntary drill on Monday. A large<br />\n805 N. HOWARD ST.<br />\nnumber responded, but several<br />\n2 Doors Above Madison<br />\nCANNED FOODS<br />\npleaded engagements.<br />\nAgent for the Harvard Loose-Leaf Note Book<br />\nWinning the honor of a place<br />\nFor nfen Who<br />\non the distinguished list will<br />\nVhink<br />\n-make\" Hopkins in a military<br />\nThe Johns Hopkins University sense. As practically every man<br />\nU nnounces the following graduate in the battalion is keyed up to a<br />\nscholarships and fellowships for high pitch, it will indeed go hard<br />\nN. HESS' SONS<br />\n• 1920-1921:<br />\nwitli anyone who makes a break<br />\n8 E. Baltimore St.<br />\nJohnston Scholarships—W. N. Brown,<br />\nbefore the inspectors through eviThe Personal 1Vriting Machine<br />\nSanskrit; E. H. Sehrt, Germanic philology; C. V. Taylor, zoology. '<br />\ndent unpreparedness.<br />\nEdmund Law Rogers Fellowships—<br />\nEdith<br />\nA.<br />\nBeck,<br />\nclassical<br />\nphilology;<br />\nC.<br />\nSo light you can hold in<br />\nV. B. Wight, classical philology.<br />\nSecond Team Wins.<br />\nAdam T. Bruce Fellowship—J. F. Edone hand 13:u t.. heavy<br />\nwards, zoology.<br />\nOn Monday, May 3, Baltimore<br />\nDuPont Fellowships—W.<br />\nBahlke,<br />\nenough for the hardest<br />\nStationers Engravers Printers<br />\nchemistry; B. S. Neuhausen, chemistry.<br />\nPoly went down to defeat at the<br />\nCharles<br />\nA. W. Vogeler Fellowship—<br />\nkind of work.<br />\nFountain<br />\nPens I. P. Note Books<br />\nhands of the second 'Varsity tenF. P. Johnson, archaeology.<br />\nGeorge Peabody Scholarship — J.<br />\nteam,<br />\nnis<br />\nhencefort<br />\nh to be known 229 Park Avenue - Baltimor<br />\nLet us prove it here in<br />\nGrape, education.<br />\ne<br />\n• Hopkins' Scholarships (for students<br />\nas the -White Eagles.\" The<br />\nour office.<br />\nfrom the Southern states and Maryland)<br />\nscore was six matches to one and<br />\n—E . H. Barclay, chemistry; A. S.<br />\nBarnes, chemistry; A. B. Brown, chemPoly was outclassed all through<br />\nistry• R. A. Castleman, Jr., physics; M.<br />\nLunches, Cigars,<br />\nM. W. LUCY & CO.<br />\nE. Day,<br />\n'<br />\npsychology; R. N. Dempster,<br />\nthe match.<br />\neducation; F. Diehl, philosophy; J. B.<br />\nAgents<br />\nsummary<br />\nThe<br />\n:<br />\nEby, geology; G. H. Evans, Jr. ecoCigarettes, Candy,<br />\n<br />\nS<br />\n<br />\nBACON DRUG STORE<br />\n<br />\nUALITY SHOP<br />\n<br />\nWAGNER'S<br />\n<br />\nHESS SHOES<br />\n<br />\n..=<br />\n<br />\nCORONA<br />\n<br />\nJ. H.SAUMENIG & CO.<br />\n<br />\n118 W. Fayette St.<br />\n<br />\n•<br />\n<br />\nnomics; S. R. Gammon, history;'<br />\nW. B.<br />\nGates, romance; P. F. Gottling, physics;<br />\nT. B. Grave, chemistry; C. M. Hall, Latin; S. J. Hart, political science; L. M.<br />\nLatane, political science; E. M. Lawton,<br />\nEnglish; M. A. Mechanic, economies; R.<br />\nG. Merrick, economics; E. L. Moore,<br />\nzoology; L. H. Naylor, romance; H. Redfield, zoology; J. K. Roberts. geology;<br />\nW. S. Rusk, archaeology: G. E. SChiaVO,<br />\npolitical science; J. D. Sisler, geology;<br />\nS. A. Small, English; G. W. Small, English; E. M. Spieker, geology; C. S. Snydor, history; R. K. Taylor, chemistry;<br />\nH. M. Thompson, chemistry; W. R.<br />\nWest, history; R. J. Whalen, Latin; W.<br />\nK. Wollery, history; J. B. Woosley. history; F. L. Wren, mathematics; W. M.<br />\nYork, history; C. T. Zahn, physics.<br />\n<br />\nSINGLES.<br />\nBurger (Hopkins) defeated<br />\nNeer<br />\n(Poly), 6-1,<br />\nDorsey (Hopkins) defeated O'Connor<br />\n(Poly), 6-1, 6-3.<br />\nPiekford (Hopkins)' defeated Krug<br />\n(Poly), 6-0. 6-3.<br />\nSmith (Hopkins) defeated Howser<br />\n(Poly). 6-2, 6-4.<br />\nDOUBLES.<br />\nColeman and Guggenheim (Hopkins)<br />\ndefeated Krug and Messersmith (Poly),<br />\n8-6, 6-2.<br />\nKesting and Rowland (Hopkins) defeated Howser and O'Connor (Poly),<br />\n6-3. 1-6, 6-3.<br />\n<br />\nCotillion Notice.<br />\nA foreign woman went into a<br />\ndrug store., She asked for talcum<br />\n.The last cotillion of the year<br />\npowder.<br />\nwill be held on Saturday, May 15.<br />\n\"Mennen's?\" asked the clerk.<br />\nIt will last from 8.30 to 1'2<br />\n\"No, vimmen's.\"<br />\no'clock. Music will be furnished<br />\nnt it scented?\"<br />\nby Iula's orchestra. Tickets may<br />\n\"N().<br />\nlaid: ay better take it be obtained from any member of<br />\n'it<br />\nthe Cotillion Board.<br />\n<br />\n(aroy Jailored<br />\n<br />\nSOFT COLLARS<br />\n<br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br />\n<br />\nE. E. ADAMS<br />\nThe Chas, Whims Surgical Instrument Co,<br />\n300 N. Howard St.,<br />\nBaltimore, Md.<br />\nSURGICAL INSTRUMENTS<br />\n<br />\nHospital, Invalid and Microscopic<br />\nSupplies.<br />\nORTHOPEDIC APPLIANCES.<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards—Invitations<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER — PRINTER — STATIONER<br />\n229 N. Charles Street<br />\n<br />\nCollars—Dozens of Styles and Other Furnishings<br />\n<br />\nTHE TORE HUT<br />\nZLEK BRITIE1Z,C<br />\n<br />\nHoward Street<br />\nNear Saratoga<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\n<br />\n12<br />\n<br />\n40-i:Olf0ifOCIOE011,'Off0ECC:02_1011017.0.g.GEOEIOrg<br />\n710-110':<br />\n10-'<br />\nOrz0IfOrtOr:Or:0:=•01:0:<br />\n<br />\nBudweiser<br />\n<br />\nSPRING SUITS FOR YOUNG MEN,<br />\nin patterns and models not to be had elsewhere.<br />\n<br />\ncrAt<br />\n<br />\nis with you once again!<br />\nThe famous fiiend of<br />\nold—made by the<br />\noriginal process in conformity with the present<br />\nregulations—on sale<br />\n<br />\nClothes of Custom Quality<br />\n14 N. CHARLES ST.<br />\n<br />\n0::0:-1-0 .0:0TIO:'9\"00r___1:0=aorlogOr%00TIOTIOROA0330;a0/101fOi1C):._;.0::0:10:,0-'f'<br />\nCOME TO<br />\n<br />\nNarttimingtrr tirMilltrrian<br />\nST. PAUL ST. AND NORTH AVE.<br />\n(Cars pass in front of door)<br />\n<br />\nServices. 11 A. M. and 8 P. M.<br />\nMen's Bible Class. 9.45 A. M.<br />\n<br />\neverywhere.<br />\n<br />\nCORDIAL WE LCO M E<br />\nTO ALL STUDENTS<br />\n<br />\nRev. David Carson Bayless<br />\nMinister<br />\n<br />\nThe Men of Johns Hopkins University Are Most Cordially Invited to Attend the Services at<br />\n<br />\n•(!rare<br />\n<br />\nrapes Episcopal PurrIl<br />\n<br />\nMONUMENT ST. AND PARK AVE.<br />\nlJ The services on Sunday are at 11 o'clock and 8 o'clock.<br />\nSeats will be reserved for Johns<br />\nHopkins men up to the hour of service. We want to have the privilege of having you associated with us in our worship, and we hope that the benefit may be reciprocal.<br />\n<br />\nESTABLISHED 1873<br />\n<br />\nA. H. FETTING MAN'FG JEWELRY CO.<br />\n<br />\nThe Medical Standard Book Co,<br />\n(THE<br />\n<br />\nMANUFACTURERS<br />\n<br />\nBOOK<br />\n<br />\nMART)<br />\n<br />\nGREEK LETTER FRATERNITY JEWELRY<br />\n213 N. LIBERTY STREET<br />\nMARYLAND<br />\nBALTIMORE,<br />\n<br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nAND COLLEGE REQUISITES<br />\n<br />\nEstablished 1811<br />\n<br />\nIMPORTERS AND DEALERS IN<br />\nFINE BOOKS<br />\n<br />\nIC<br />\n-<br />\n<br />\nOldest Musical Instrument House In U. S.<br />\n<br />\nH. R. EISENBRANDT SONS, Inc.<br />\n\"ALL THINGS MUSICAL\"<br />\n417 North Howard Street<br />\n-<br />\n<br />\nriomm<br />\n<br />\nafter<br />\n<br />\n•<br />\nratAa140)<br />\n<br />\nBALTIMORE, MD.<br />\nBAND AND ORCHESTRA INSTRUMENTS<br />\nVICTROLA SPECIALISTS<br />\n<br />\nTo the Editor a THE NEWS-LETTER:<br />\n,<br />\n.4.1.4.4611.44,006,47.4../ 1z)<br />\n<br />\nsin4ear4i-gdfadc,c.<br />\n4.0.4St9<br />\n<br />\n_<br />\n<br />\nMAP<br />\nANHEUSER-BUSCH,INC. ST.LOUIS<br />\n<br />\nTHE NEWS-LETTER'S MAILBAG<br />\n(Continued from /age 5)<br />\n<br />\nfor the apparent listlessness is<br />\nprobably due more to a lack of<br />\ninterest than to a lack of appreciation, and, in my opinion, if the<br />\nmajority of the fellows were once<br />\ninterested in the thing, there<br />\nwould be no trouble whatever in<br />\nmaking a smashing success of the<br />\nplay. The only thing necessary,<br />\ntherefore, is to interest the fellows in the next production, and<br />\nif it is possible to secure the backing and co-operation of the students and student organizations<br />\nsuccess will be easy.<br />\nHopkins should go into dramatics more seriously, as suggested by J. 0. L., and take its place<br />\nin the creative art life of Maryland in the same way that Harvard University has its Workshop<br />\nTheatre. The stimulating lectures<br />\n<br />\ngiven before the members of our<br />\ndramatic talent and the Literary<br />\nClub by Florence Lewis Speare,<br />\ntogether with the interest she is<br />\narousing in this city as president<br />\nof the newly organized Drama<br />\nLeague, merely goes to show how<br />\nquickly and earnestly students<br />\nand citizens respond to any serious movement when the right people are connected with it. Johns<br />\nHopkins has a unique opportunity. South of the Mason and Dixon Line no university has established the laboratory theatre.<br />\nThere is abundant histronic talent among the undergraduate students of the University, and with<br />\nthe valuable training that Miss<br />\nWalter gives us, Johns Hopkins<br />\nought to take a prominent place<br />\nin the student dramatics of the<br />\nEast. With the backing of the<br />\nstudents, this will be easy 'of accomplishment. Think it over, felJ. 0. Ti.,<br />\nlows!<br />\n<br />\nSir—.l wish to call your attention to a small matter in regard<br />\nto the use of the tennis courts,<br />\nwhich I have frequently observed<br />\nduring the last two weeks. A<br />\ngreat deal of interest has been<br />\nshown in this game recently and,<br />\nconsequently, the courts have<br />\nbeen in great demand. Now, it<br />\nis only fair that all those who<br />\ndesire to play should have a fair<br />\nchance, and this is absolutely impossible when four of five men<br />\nget possession of the courts and<br />\nhold them about four hours at<br />\na time.<br />\nThe other day I noticed two<br />\nfellows who started at 9 o'clock<br />\nin the morning and whom I saw<br />\non the same court every one of<br />\nthe eight times I passed throughout the day. These men played<br />\nat least three hours in the morning and four in the afternoon,<br />\nand then repeatedly refused to<br />\n-double up\" with anyone.<br />\nNearly all clubs possessing<br />\ntennis courts have a written or<br />\nunwritten rule that only the best<br />\ntwo out of three sets may be<br />\nplayed when others are waiting<br />\nto use the courts. I understand<br />\nthat such a rule was formerly<br />\nobserved on our courts, but if it<br />\nis so, it has certainly been forgotten or disregarded by a number<br />\nof students,<br />\nAN<br />\n<br />\nOBSERVER.<br />\n<br />\n301<br />\n<br />\nN. CHARLES STREET<br />\nBaltimore, Md.<br />\n<br />\nThe<br />\nNorman Remington Co,<br />\n<br />\nBOOKS<br />\n<br />\nYou're Interested In<br />\nEvery Student Should Own<br />\n<br />\nSend Your Name for Monthly List<br />\nCharles Street, at Mulberry<br />\n<br />\nJ. H. FURST CO.<br />\n23 S. HANOVER ST.<br />\nBALTIMORE, MD.<br />\n<br />\nPrinters of Philological and<br />\nScientific Works<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America, \"Johns Hopkins University Circulars,\"\"Modern Language Notes,\"\"Maryland Historical Magazine,\" University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nsimilar character. Special attention given to the<br />\nprinting of<br />\n<br />\nDOCTORS' DISSERTATIONS<br />\nin Greek, Latin, Anglo-Saxon, Old English, and<br />\nRomance and Germanic Languages.<br />\n<br />\nWyman's<br />\n<br />\nThe Largest &<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\n<br />\nMen's<br />\nShoes<br />\n<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br />\n<br />\n19 Lexington St.<br />\n<br />\nSole Agent for<br />\nthe Johnston Sr<br />\nMurphy Shoes.<br />\n<br />\n1.<br />\n<br />\n\f", "format": "basic_html", "processed": "MRS NOTENSHUM :,j[riln<br />\nVOL. XXIV, NO. 27<br /><br />\nBALTIMORE, MD., MAY 11, 1920.<br /><br />\nBLACK AND BLUE LOSES TWICE<br /><br />\nCONVENTION WELL ATTENDED<br /><br />\nMASS MEETING THURSDAY<br /><br />\nWesleyan and Stevens Tech Defeat<br />\nOur Nine in Last Two Games<br />\nof Northern Trip.<br /><br />\nSixty College Journalists Answer Roll<br />\nCall—Thirty Colleges Represented—<br />\nNews Association Formed.<br /><br />\n'Varsity Club to Explain its Status to<br />\nFaculty and Student Body—<br />\nAll Urged to Come.<br /><br />\nPRICE, FIVE CENTS<br /><br />\nSIX MEN ELECTED TO 0. D. K.<br />\nPublicly Initiated at Mass-meeting<br />\nFaculty Action on Unauthorized<br />\nBaseball Trips Announced.<br /><br />\nThe Johns Hopkins baseball<br />\nIn order to place the position<br />\nThe first convention of college<br />\nOn last Friday<br />\nnine, on May 3, lost to Wesleyan journalists held since 1916 was of the club clearly before the fac- suspended at 9.30 classes were<br />\no'clock in orCollege the third straight game a decided success. It was held ulty and student body and thus der to permit all<br />\nundergradu<br />\nates<br />\nOf its northern trip. The game in New York under the auspices settle the many rumors which to attend the<br />\nmass-meeting at<br />\nwas listless throughout, and was of the Columbia Spectator and have been floating about the cam- that hour, at .which<br />\nsix newly<br />\nmarked by wretched fielding on Columbia School of Journalism. pus, a large mass-meeting will be .chosen members of<br />\n0. D. K. rethe part of the Black and Blue. The following colleges were rep- held on Thursday. May 13, at ceived the public<br />\ninitiation and<br />\nBoth teams hit the ball hard, but resented: Hamilton, Colgate, Cor- 12.20 o'clock. A member of the the Dean made sonic<br />\nimportant<br />\nthe Wesleyan nine had it over the . nell, Brown, Williams, Johns 'Varsity Club will address those announcements.<br />\n'Varsity here, as well as in the Hopkins. Rochester, Georgetown, 1mmsmit. It is vitally important<br />\nDr. French presided and pinned<br />\nfield. \"Doc\" Love, who toed the Wesleyan, Middleburg, Dart- ti nit all students and members of the 0. D. K. laurel<br />\nleaf on<br />\nrubber for Hopkins, proved no mouth, Rhode Island State, Am- thtt faculty attend and thus learn following initiates: Dr. Georgethe<br />\nE.<br />\npuzzle for the Connecticut nine, herst, Massachusetts of Technol- the plans of the club definitely.<br />\nBarnett, professor of slat 1st ics ;<br />\nfor they pounded out 11 safeties ogy, Richmond College, Columbia,<br />\nIn accordance with its plan to Dr. Alexander Graham christie,<br />\noff his delivery. \"Andy\" Knecht, Delaware College, Rutgers, Get- form a company to take over the professor of mechanical<br />\nengineerwho relieved him, fared little bet- tysburg,<br />\nSimmons, management of the finances of ing; Richard T. Cox, manager of<br />\nSyracuse,<br />\nter during the short time he was Franklin and Marshall, Inlay- the University Athletic Associa- track, art editor of<br />\nHullabaloo;<br />\non the mound.<br />\ncite, SWarthmore, Haverford. tion, the 'Varsity Club has taken Edmund S. Wood, president of<br />\nWesleyan piled up a four-run Penn State, Muhlenburg, Ursin- steps for the formation of such Jun ior .ags, b ad hail, lacrosse,<br />\nlead in the first two innings, but us, Princeton and Yale.<br />\nan organization. The $10,000 baseball, basket -ball : William H.<br />\nthe Black and Blue came back in<br />\nlt was decided to revive the old necessary for 'the incorporation Wood, president of Class of 1922<br />\nthe second and third and took the Association Of College News- of the 'Varsity lIolding Company in freshman year.<br />\nfootball, baselead by sending five markers papers, which had gone out of has been subscribed, and the in- ball, basket-ball, Si<br />\nudent Council;<br />\nacross the pan: After this, how- existence (hiring the war. A new corporation papers drawn up. Bascom K. Kennady,<br />\nbasket-ball,<br />\never, the home pitcher, Connolly, constitution was drawn up and Officials of the club are now wait- business manager of<br />\nHullabaloo<br />\ntightened and held Hopkins in the name Eastern collegiate News ing only for the decision from for next year. Dr.<br />\nFrench delivcheck during the remainder of the Association selected. The pur- Washington as to whether the ered a shaft address<br />\nabout the 0.<br />\nfray. The Wesleyan team put the pose of this organization is to admission to University games D. K. fraternity.<br />\nHe explained<br />\ngame on ice in the fifth inning, bind the college publications more will be exempt from tax. Accord- that Omicron Delta<br />\nKappa stood<br />\nwhen they staged a rally and closely together, and to facilitate ing to the local income tax au- for the Greek,<br />\n\"The laurel crowns<br />\nscored four tunes.<br />\nthe better exchange of news and thorities, no tax will be charged, the circle,\" and that the<br />\nsociety<br />\nFor the Black and Blue, Ben- advance notices. The constitu- since the money is obviously to be was an organizatio<br />\nn existing prison, Cox, Knecht and Bloomsburg tion and by-laws were ratified at used for the benefit of a public marily for the<br />\npromotion of colstarred at the bat, each hitting once by the Syracuse Daily Or- institution of learning. It was, lege spirit.<br />\nCollege spirit, as Dr.<br />\nsafely twice, while Camp, Raines ange, Amherst Student, Hamilton, however, thought best to consult French defined<br />\nit, is made up of<br />\nand Bateman showed the way for Life, Dart mouth, •1 all NS HOPKINS the Federal officials before taking three things:<br />\nloyalty, co-operathe home team. In the field, Cox NEWS-LETTER, ROO/('Sfri CO in pilS, definite action. As soon as the tion and<br />\nservice. He charged the<br />\nplayed a good game and made sev- 'VCR/C./Mil A igi/S,<br />\nHy Fri/Wedesired information is obtained, undergraduates to be ever careeral spectacular catches.<br />\nl-00a a. Co/ant bia Spectator, The<br />\nthe formalities of incorporation ful of the good name of the UniThe Johns Hopkins balltossers Tech ( M. I. T.) and The Middle- will be completed and the 'Var- versity, not<br />\nto make hasty judgbrought their northern trip to a bury digits.<br />\nsity Holding Company will be- ments and to do their very best.<br />\nclose by losing to Stevens Tech<br />\nThe delegates of the other col- come an active organization.<br />\nearly next year, to assimilate a<br />\nill a thrilling game. It was a leges were not empowered to act,<br />\nAt the last meeting of the 'Var- very large freshman class.<br />\npitchers' battle from start to fin- but \\yin recommend that their pa- sity Club, Carroll Stollenwerck,<br />\nDr. Lantane followed Dr.<br />\nish, only five hits being registered pers join the association. It is because of his continued absence French.<br />\nHe said that at the last<br />\nby the combined efforts of the two expected that the association will from the city, resigned his posi- meeting<br />\nof the Board of Collegiteams. The game was marked by number at least 40 colleges by tion as chairman of the Football ate<br />\nStudies the freshman-sopholoose playing in the field, which June, since the advantages are Committee. Dr. Eleveth Bridg- more<br />\nbanquet affair had been reon two occasions proved very cost- numerous and the attending ex- man, who is also. president of.the ferred<br />\nto a ccamittee of the facly for the Black and Blue, while, pense slight. The ratifying pa- club, was chosen to take his place.<br />\nulty, who would report definite<br />\non the other hand, all the breaks pers will hold the first meeting Both of these men were formerly<br />\nrules for next fall. Several years<br />\nof the game went to the winners. of the association and elected Mc- prominent members of the Hopago, the Student Council had<br />\n\" Welliver, although rather wild Knight, of Columbia, president; kins football team, and both<br />\nagreed that hazing hind class<br />\nat times, nevertheless struck out Wood, of Amherst, vice-president; served as !Varsity coaches during fights<br />\nwould be done away with.<br />\nthree men in the short time he and Dallas, of Princeton, secre- the past season.<br />\nAs it was not a definite written<br />\nwas on the mound. The third tary. They also decided that the<br />\nIt is the present plan to hold statute, the members of the presinning, however, proved his un- next annual convention should be a \"joint meeting of the<br />\n'Varsity ent Student Council were ignordoing, when he walked Farrari held in May of the following Club and the undergradu<br />\nate body ant that such an agreement exWeigele.<br />\nand hit<br />\nKurtz then year.<br />\nof the University some time in isted and so more drastic action<br />\nbunted to the pitcher, and when<br />\nWhile the formation of the as- . the near future for the purpose was not taken; but next fall the<br />\nthe latter threw the ball far over sociation is the most important of stimulating interest in the profaculty will take some definite<br />\nEgerton's head, Farrari counted. result of the copvention, the edi- posed summer training camp<br />\nfor stand.<br />\nIn the following frame, Donnelly torial and business meetings were the football team. This<br />\nis the<br />\nDr. Lantane next announced<br />\ndoubled off of Love, who relieved exceedingly valuable to all dele- first time such a thing has ever<br />\nthat the rule requiring athletic<br />\nWelliver, and scored a moment gates. Plans and customs were been attempted at Hopkins,<br />\nand schedules to be submitted to Dr.<br />\nlater on Egger's single. In the exchanged, and many new and it is hoped that a large number<br />\nAbercrombie for approval must<br />\nsame inning, with men on first practical ideas brought forth.<br />\nof men will attend. For those be more strictly observed. The<br />\nand'third, a double steal resulted<br />\nThe banquet held on Friday men who would otherwise work matter had reached a head, he<br />\nin another run. After this in- evening at the McAlpin, was a during the summer vacation, emsaid, with the northern trip of<br />\ning, Love tightened up and held very pleasant affair and was at- ployment will be found in the<br />\nthe baseball team, which had<br />\n(('ontinued on page 9, col. 2)<br /><br />\n(Continued on pace 9, col. 3)<br /><br />\n(Continued on page 3, col. 3)<br /><br />\n(Continued on page 2, col. I)<br /><br />\ne,<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\n2<br /><br />\nSOCIAL SCIENCE CLUB ELECTS<br />\nOfficers Unanimously Chosen—Plans<br />\nFor a Supper and Smoker Laid Next<br />\nYear Expected to be Successful.<br /><br />\n3frrbrrirk<br /><br />\nKipp (Co.<br /><br />\nMANUFACTURERS OF<br /><br />\nHIGH GRADE CHOCOLATES.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41 Besides, the reputation of an old-established firm is<br />\nback of each sale with a guarantee.<br /><br />\nJohn C. Knipp e? Sons<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nATTENTION! J. H. U. STUDENTS:<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nDevices and Card Index Outfits!<br /><br />\nPRINTERS<br /><br />\nPUBLISHERS<br /><br />\nmEYFHRALTIEIMER<br />\nThe Big Stationery Store<br />\n1 0- I 2 N. HOWARD STREET<br />\nSIX MEN ELECTED TO 0. D. K.<br /><br />\nBALTIMORE<br /><br />\nMusical Club Closes Season.<br /><br />\nThe Johns Hopkins Musical<br />\n(Continued from fiage 1)<br />\nClub<br />\nclosed a very successful seathe<br />\nunauthorized.<br />\nfall<br />\nbeen<br />\nLast<br />\nmanager had askeij to be allowed son with its annual banquet at<br />\nto schedule this spring's northern the Southern Hotel on Monday,<br />\ntrip for May 12-15, as Easter came May 3. All members of the club<br />\nso early. Permission was granted<br />\nfor this. The games, however, and, in addition, Prof. C. C.<br />\nwere scheduled two weeks ahead Thomas, the honorary guest, who<br />\nof the date of the original per- was later elected honorary presimission, and f)r. Abercrombie dent, were present. W. L. Merriwas not notified of the change. ken was chairman of the Banquet<br />\nMoreover, the team missed classes Committee, and Paul Wiggins<br />\nfor a week, instead of three days. acted as toastmaster. Among<br />\nDr. Lantane stated that Mr. the speakers were Coulter, CattaMurphy and Manager Field were nach, Defandorf and Weaver.<br />\nAfter the banquet, a new conequally culpable, although each<br />\nwas under the impression that stitution was read and passed,<br />\nthe other had full authority to go and the election of next year's<br />\n'ahead. Field has been removed officers was held. The following<br />\nfrom managership and placed on nominees were chosen: Coulter,<br />\npresident; Prince, treasurer;<br />\nprobation.<br />\nThe meeting' closed with a short Hubbard, business manager; and<br />\naddress by Dean Whitehead, who R. D. Parsons, secretary. ,<br />\nAfter the customary high orwas much applauded when he said<br />\nthere was \"no such thing as a der of jokes and songs, the.club<br />\ndisbanded for the year.<br />\ndishonest engineer.\"<br /><br />\nThe Social Science Club herd<br />\none of its most successful meetings of the year on Friday, May<br />\n7. The meeting was very well attended and was characterized by<br />\na surprising amount of enthusiasm. The officers for the coming<br />\nyear were all unanimously elected.<br />\n(;eorge Goetz was elected president; Lawrence Fenneman, vicepresident; and Fulton Bramble,<br />\nsecretary-treasurer. Tlie officers<br />\nare all men who have manifested<br />\na profound interest in the activities of the club—men who will<br />\ngive it a stimulus and an urge<br />\nthat will make it one of the most<br />\npotent organizations in the University.<br />\nPlans for a supper and a smoker to follow the last meeting of<br />\nthe year, on May 21, were laid,<br />\nand the hope was earnestly expressed that all regular members<br />\nof the society, including those who<br />\nwere not present at the last meeting, would be able to attend this<br />\nconvivial gathering. Some interesting stories and some sparkling;<br />\nliiiiiiot. is bound to put in its appearance on this occasion.<br />\nDr. Lovejoy, the counselor of<br />\nthe club, and the newly elected<br />\nofficers have already gotten eagerly to work in laying down the<br />\nplans for next year. The discussion meetings next year, according to present indications, are to<br />\nbe stamped by an enticing freshness and variety. Such live-wire<br />\ntopics as \"Freedom of Speech.\"<br />\n\"The Inalienable Rights of Minorities Under it System of Popular Government,\" -Co-operation<br />\nas Opposed to Competition as a<br />\nRational Principle,\" will constitute the subjects for discussion<br />\nfop the first few- meetings of the<br />\nyear.<br />\nThe public lectures again will<br />\nloom up as a conspicuous feature<br />\nin the club's program. Dr. McCabe, of Princeton, will probably<br />\nbe the first public lecturer of the<br />\ncoining year. and it is hoped that<br />\nDr. Harold Laski, of Harvard,<br />\nwill consent to deliver the second<br />\nlecture.<br />\nAll indications lend to the belief that next year will be a banner • year in the history of the<br />\nSocial Science Club.<br /><br />\nthe university of Michigan<br />\nStudent Council put itself on<br />\nrecord as being in favor of the<br />\nold clothes movement. An active<br />\ncampaign began recently to obi a in pledges.front the undergradua tes that they would wear nothing but old clothing on the campus<br />\nand at classes. Disreputable attire will be discouraged, but old<br />\ngarments which are decent in appearance will meet with the approval of the undergraduate body.<br /><br />\nOlgb Joinis iqopking<br />\nuittittrr Toutsrg<br /><br />\nTENTH SESSION<br /><br />\nJuly 6th - August 13th, 1920<br /><br />\nCourses of Instruction<br /><br />\nBiology<br />\nBusiness<br />\nChemistry<br />\nClassical Literature<br />\nEconomics<br />\nEducation<br />\nEnglish<br />\nFrench<br />\nGerman<br />\nHistory<br />\nJournalism<br />\nManual Training<br />\nMathematics<br />\nPolitics<br />\nPsychology<br />\nSpanish<br /><br />\nFor further information, see<br /><br />\nAl<br /><br />\nthe<br /><br />\nDR. BUCHNER,<br />\nRoom 217,<br /><br />\n-<br /><br />\nGilman Hall<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\n11<br /><br />\n11<br /><br />\n1<br /><br />\n1 1 !I<br /><br />\n1<br /><br />\n3<br /><br />\n11<br /><br />\nf ,m1<br />\nI<br /><br />\nYOUNG MAN<br />\nYour Suit or Overcoat<br /><br />\n.9, lin<br /><br />\nwill have those smart dapper kinks if<br />\nit comes from here where a specialty is<br />\nbeing made of clothing for college boys<br />\nand young men<br /><br />\n• •<br /><br />\nPrices, $25.00 to $65.00<br /><br />\nON'T take a fellow's pipe. Take some other possession.<br />\nBecause wrapped up in his pipe is a fellow's peace of<br />\nmind, his relaxation, his contentment. This is more than<br />\ntrue if it's aWDC Pipe, because then a good smoke is multiplied many times over. Our special seasoning process takes<br />\ncare of this by bringing out all the sweetness and mellowness<br />\nof the genuine French briar. Just you go to any good dealer<br />\nand select several good shapes. Put them in your rack.<br />\nSmoke a cool one every time, and you'll be well on your<br />\nway to pipe-happiness.<br /><br />\nD<br /><br />\nTEWART8a,<br />\nCannerinn Wt.10111fl 11,-Creerp<br />\nt<br /><br />\nTHE HATTERIE<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of Light Street<br /><br />\nSole Agents for Baltimore for College Fraternity Bands (Greek Letter Societies).<br />\nSHIRTS<br /><br />\nWm. DEMUTH at<br />\nWORLD'S<br /><br />\nLARGEST<br /><br />\nCO., NEW YORK<br /><br />\nPIPE<br /><br />\nroil<br /><br />\nHOWARD AND LEXINGTON STS.<br /><br />\nARROW COLLARS<br /><br />\nn_<br /><br />\nco.<br /><br />\nQuality<br /><br />\nMANUFACTURERS<br /><br />\ns Ski<br />\nCV61\\e'N't.<br /><br />\nc<br />\n4c(1AV‘<br /><br />\n11<br /><br />\n[I<br /><br />\n1 11<br /><br />\n1<br /><br />\nil I I<br /><br />\n1<br /><br />\nk)*<br /><br />\nil 1 1<br /><br />\nMerchandise<br />\nNominations for Athletic Board and<br />\nPresidency of Student Council.<br /><br />\nAt the mass-meeting held on<br />\nMonday at 12.20 o'clock, the following men were nominated for<br />\nthe Athletic Board:<br />\nFor President — Ed. Wood,<br />\nKeyes and Mullikin.<br />\nFor Vice-President—E. Jones,<br />\nW. B. Collins, Kennady and<br />\nTrew.<br />\nFor Secretary — Heiner, J.<br />\nJones, Trew, Marcuse and Hardin.<br />\nFor Alumni Delegate—Reaney<br />\nWolf, Dr.- Bla-nk and Mr. England.<br />\n• For Graduate Delegate—Griffiss.; Merrick, Evans, C. Benson<br />\nand Wyckoff.<br />\nFor Medical Delegate—Williams, Calkins and Egerton.<br />\nFor Senior Delegates (three to<br />\nbe elected)—Marcuse, Mullikin,<br /><br />\ncashell, E. Jones. J. Benson,<br />\nPickford and Reins.<br />\nFor Junior Delegates (two to<br />\nbe elected)—W. Wood, Turner,<br />\nFrank, Sharretts, J. Miller, Hardin, R. Wood and Hall.<br />\nFor Sophomore Delegate (one<br />\nto be elected)—Thompson, W.<br />\nHoffman and Dodson.<br />\nAt the same meeting, Marcuse,<br />\nTrew, J. Jones and Stansbury<br />\nwere nominated for the presidency of the Student Council.<br />\nThe election will be held at the<br />\nmass-meeting scheduled for Monday. May 17, at 12.20 o'clock. All<br />\nout!<br />\nThe following men have been<br />\nrecently appointed managers for<br />\nnext year:<br />\nBaseball—Biemiller.<br />\nLacrosse—Keyes. •<br />\nBasket-ball—Reed.<br /><br />\nMASS MEETING THURSDAY<br /><br />\n(Continuedfrom page 1)<br />\nneighborhood of the camp, so that<br />\nit will be possible not only to<br />\nclear expenses, but to make a little money besides. If possible,<br />\nthere will also be at the camp<br />\nsOme preparatory school men, who<br />\nare contemplating coming to Hopkins. In this manner, the camp<br />\nwill lie made to serve the double<br />\npurpose of developing a football<br />\nteam and of interesting men in<br />\nthe University.<br />\nThe lightning bug is a beautiful bird,<br />\nBut he really has no mind:<br />\nHe dashes through this world of ours<br />\n• With his headlight on behind.<br />\n—Ex.<br />\nHe squeezed her in the dark and kissed<br />\nher;<br />\nAnd for a moment bliss was his.<br />\n\"Excuse me, but I thought it was my<br />\nsister!\"<br />\nHe said. She smiled and cooed, \"It<br />\nIs.\"<br />\n—Ex.<br /><br />\nHATS<br /><br />\nHOSIERY<br /><br />\nTHE HOSIERY SHOP<br />\n215 N. CHARLES ST.<br />\n,Daltimore's Oest Shop For<br />\nMen's Sox and Ties.<br /><br />\n75 Cents and Up.<br /><br />\nBOOK = BINDING<br />\nJoseph Ruzicka<br />\n106-108 CLAN ST.<br /><br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\npkins Seals in Silver and<br />\nGold,<br />\nCollege Jewelry o Specioky<br /><br />\n28 E BALTIMORE STREET<br /><br />\n1<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\n4<br /><br />\n[10111g897NOWS101101.<br />\n1110 J011113,OUNDED<br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Post Office at<br />\nBaltimore, Md., under Act of Congress,<br />\nNovember 3, 1879.<br />\nPublished weekly, from October to<br />\nJune, by the students of Johns Hopkins University.<br />\nBusiness communications should be<br />\naddressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSIT'Y; all articles and other communications should<br />\nbe sent to the MANAGING EDITOR.<br />\nTeleph.cri<br /><br />\nHomewood 100<br /><br />\nEditor-in-Chief.<br />\nLlewellyn W. Lord, '21.<br />\n. Managing Editor.<br />\nH. Douglas Cotton, '22.<br />\nAssociate Editors.<br />\nWarren W. Driver, '20.<br />\nEdward G. Huey, '22.<br />\nJunior Editors.<br />\nRichard Dallam, Jr., '22.<br />\nCharles C. Marbury, '22.<br />\nRichard M. Wood, '22.<br />\nNorvell E. Miller, Jr., '23.<br />\nWilliam F. Passano. '23.<br />\nBusiness Manager.<br />\nGeorge Deichman, '21.<br />\nCirculation Manager.<br />\nFrederick W. Lipps, '22.<br />\nAssistant Business Managers.<br />\nFrederick Abbott, '22.<br />\nLawrence K. Wagner, '22.<br />\nBALTIMORE;MD.,<br /><br />\nMAY 11, 1920<br /><br />\nThe close of the Easter vacation brings us to the last lap of<br />\nthe college year; commencement<br />\nand final examinations already<br />\nloom largely upon the horizon. At<br />\nsuch a tune it is only natural<br />\nthat a discussion of the Honor<br />\nSystem should take place.<br />\nTHE NEWS-LETTER regretted at<br />\nthe time of the mid-year exams to<br />\nhear the many rumors of cheating<br />\nwhich were then flying around the<br />\ncampus; and it regretted still<br />\nmore the inability of those in authority to trace these rumors and<br />\nto punish the offenders—for there<br />\nwere many breaches of the Honor<br />\nSystem. The inability of the Student Council and of the Omicron<br />\nDelta Kappa to get facts and evidence is the more lamentable,<br />\nsince it was caused by the general<br />\nattitude of indifference on the<br />\npart of the student body—a feelthat it was none of your business<br />\nwhether the other fellow cheated;<br />\nthat you would be a tale-bearer<br />\nif you reported him. This was<br />\nthe attitude which the investigators found it impossible to<br />\ncombat.<br />\nThere is no use to bemoan or<br />\nto attempt to condone this attitude. It is true that there. was<br />\nan unprecedented amount of<br />\ncheating at mid-years, and that<br />\nthe offenders could not be brought<br />\nto justice on account of the unwillingness of the students to<br />\nprosecute them. The issue is<br />\nsquarely before us, and the ques-<br /><br />\nthm arises. -What are you going<br />\nto do about it?\"<br />\nThere seems but two possible<br />\nalternatives to THE NEWS-LETTER:<br />\nReturn to the Proctor System of<br />\na bygone day or an Honor System<br />\nwhich is enforced to the letter.<br />\nThe way in which the present system operates, namely, leaving it<br />\nup to the individual whether or<br />\nnot he is to cheat, is, in the opinion of THE NEWS-LEWER, out of<br />\nthe question, since it is fair<br />\nneither to the faculty nor to the<br />\nhonest student.<br />\nA return to the Proctor System would be a disgrace to the<br />\nUniversity and to the student<br />\nbody. It would amount to the<br />\nstatement that we are unworthy of any confidence which might be<br />\nplaced ill us. It would be a confession that we are unfit to be<br />\ncalled college men. It would be<br />\nthe honest giving away before the<br />\ndishonest, the humbling of the<br />\nvust majority before the small<br /><br />\neditors when asked and in most<br />\ncases they furnish this information of their own accord.<br />\nSuch co-operation, unfortunately, does not exist at _Hopkins.<br />\nTHE NEWS-LETTER plays practically a lone hand in the collee:<br />\nlion of news.. It covers what has<br />\noccurred and seldom knows what<br />\nis to occur in the future. The<br />\nfault is not with the editors, but<br />\nwith the managers of the various<br />\nteams and the officers of the various organizations. who, far from<br />\nvolunteering any information, begrudge any assistance whatever.<br />\nTHE NEWS-LEVIER regrets the<br />\ncollapse Of the Publicity Board.<br />\nIt, more than any other activity,<br />\nrecognizes the need of some bureau of information which is iii<br />\nIt position to know all . that has<br />\nhappened and is to happen at the<br />\nUniversity. The Publicity Board<br />\nfailed 1:or the sante reason that<br />\nTIIE NEWS-LE-17ER fails,. to enntain all the news—lack of cooperation.<br />\nThe past year has been a successful one for THE NEWS-LETTER.<br />\nVi'oiuiSTO() in debt it has come<br />\nII/ a 1111Sition of financial security. It is refusing advertisements,<br />\ninstead of soliciting them. It<br />\nplans to publish a daily bulletin<br />\nnext year and also to expand into<br />\na send-weekly. To do this, however. it must be assured of the<br />\nco-operation of the stullents. It<br /><br />\nThee facts—patent as they are<br />\nto the rational observer—were<br />\nnot manifest to the New York<br />\nAssembly. But there is yet another fact, weightier by far, which<br />\nwas still less manifest to the Assembly. This fact is that there<br />\nare attempts being made to foist<br />\nupon us the insidious doctrine of<br />\nclass-war, which has envenomed<br />\nRussia, and that such autocratic<br />\nacts as that of the New York<br />\nAssembly cannot but inflame the<br />\npeople, and thus make way for<br />\nthe Bolshevist serpent.<br />\nHeretofore, we have very ofteti<br />\nliven afflicted with men who were<br />\nwont to perch themselves upop<br />\nthe soap-box and by dint of fiery<br />\nspeech and bloody words incite<br />\nthe 1)01)111:ace to rise .up in arms<br />\nagainst our th)vernment.. What<br />\nhas been our reply to such agitators? Our reply has amounted<br />\nto this:<br />\n\"Attention, you who wotild<br />\nilreach revolution! Yoh' are misdirecting your energies here. It<br />\nis all well and good to preach<br />\nrevolution in an absolute monarchy, where revolution is the<br />\nonly means whereby a suppressed<br />\nand discontented people may improve its condition. But this<br />\ncountry of ours is not an absolute monarchy; it is a republic.<br />\nwhere representative government<br />\nprevails. Every citizen in this<br />\nhind has his representative in the<br />\n;Him inistration of his town and of<br />\nhis State and in the Federal<br />\nGovernment itself. If men want<br />\nanything here, they elect as they<br />\nrepresentatives other men who.<br />\nalso want the same thing, and who<br />\npromise to try to secure it. Therefore, we say, you are Misdirecting your energies. If you WW1<br />\nto obtain certain reforms, then<br />\ndo not try to obtain them through<br />\narms, but instead nominate for<br />\noffice candidates who desire these<br />\nsame reforms, and then convince<br />\nthe voters that they ought to<br />\nelect these candidates. Remember, once and for all, that this<br />\ncountry is ruled by ballots, and<br />\nnot by bullets!\"<br />\nShall we permit such actions<br />\nas that of the New York Assembly? Shall we tell these same<br />\nagitators, who have nominated<br />\ntheir candidates and gotten the<br />\nvoters to elect them, that ballots<br />\nwill no longer avail, and that<br />\nhenceforth bullets will have to be<br />\nemployed? Shall we open the<br />\ngates and invite the serpent that<br />\nis surely lurking without?<br />\nlEditor's Note: The above editorial,<br />\nwritten by Max Levin, was selected as<br />\nthe best presented In the recent contest,<br />\nand has been forwarded to New York<br />\nto represent THE NEWS-LETTER in the<br />\neditorial contest in which the prominent universities of the East are participating.1<br /><br />\nAre we going back to this system? Let us hope not. But unless an efficient HOnor System is<br />\nestablished shortly, the choice will<br />\nnot be left with us—the faculty<br />\nwill order us to return .to the<br />\nProctor System.<br />\nThus we see that it is up to<br />\nus to support the Honor System,<br />\nand to make it one that is serviceable.<br />\nly if<br />\nsem<br />\nTIIE NEWS-LETTER here takes V:11111(11 1)1111)1 ish<br />\nhas to dig for news, as it has<br />\nthe opportunity of announcing to<br />\nin the past.<br />\nthe University that it has pledged hadFlIto do<br />\nF: NEws.LErrEit would like<br />\nitself as a body and as individuals to report any infringement of to make the few issues that rethe Honor System, however main this year a success. It<br />\nslight, which may come under the would like to receive co-operation<br />\nobservation of any member of the such as would justify it in beBoard in the coming examina; coming a semi-weekly next year.<br />\nIt asks for such support, and feels<br />\ntions.<br />\nIn taking this step, THE NEWS- snre that it will get it.<br />\nLETTER hopes that it will be the<br />\nInviting the Serpent.<br />\nfirst of a long train of activities<br />\nwhich will pledge themselves to<br />\nOn April 1, 1920, the Assembly<br />\nreport any violations—the Omi- of the State of New York expelled<br />\ncron Delta Kappa, the Athletic from its midst five duly elected<br />\nBoard, the fraternities, the Jew- assemblymen, members of the Soish societies, etc.<br />\ncialist Party., .This action grew<br />\nIf the Honor System receives out of charges preferred by the<br />\nthe whole-hearted and honest sup- Judiciary Committee of the Asport .of all these activities, we sembly, which claimed that the<br />\ncan assure ourselves that there five men were \"engaged with<br />\nwill be no more talk of abolish- others in a large, well-organized<br />\ning it.<br />\nconspiracy to weaken the family<br />\nties, destroy the influence of the<br />\nThe exchange of ideas and prac- church and overturn the whole<br />\ntical experiences at the conven- fabric of a constitutional form of<br />\ntion of eastern college news- government.\" The .1 ud iciary Compapers has taught much to THE mittee tried the men on these<br />\nNEWS-LETTER, and it expects to charges, and presented a report<br />\nprofit by its increased knowledge to the Assembly, whereupon the<br />\nin the near future. One of the men were expelled.<br />\nLet us for the present not emmost important revelations was<br />\nthe existence of co-operation be- phasize the fact that, however retween the publications, the vari- pnlsive the Socialist doctrine may<br />\nous organizations, athletic office be, Socialists do not wish to<br />\nand faculty which exists at other weaken the family ties (witness<br />\nThe Harvard Glee Club, comcolleges. All happenings of in- the ideal family life of Karl<br />\nare<br />\nthey<br />\n53 men, returned recently<br />\nprising<br />\nmoreover,<br />\nthat,<br />\n;<br />\nto<br />\nMarx)<br />\nin<br />\nadvance<br />\nterest are reported<br />\nthe publication, which is thus in not interested in the influence of from its spring trip. The club<br />\nposition to cover the event thor- the church; and, finally, that they was gone a week, and during its<br />\noughly and accurately. Those do not wish to destroy constitu- tour visited Philadelphia and<br />\nwho are in a position of author- tional government, but do wish, 'Washington, and invaded the Midity are always willing to give the if anything, to extend the scope dle West as far as Cleveland, Cinbenefit of their knowledge to the of constitmi tional government. cin a Ii and I /etroit.<br /><br />\n6<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\nTHE NEWS-LETTER'S MAILBAG<br /><br />\nHOPKINS DOWNS SWARTHMORE<br /><br />\nHOPKINS HAS POOR LUCK<br /><br />\nA Column in Which the Correspondents<br />\nAre Allowed Latitude, but Shoulder the Responsibility.<br /><br />\nHolds Pennsylvanians Scoreless While<br />\nIt RoHs Up 12 Tal ies—Bauernschmidt and Silberstein Star.<br /><br />\nPlaces Fifth in S. A. I. A. A.—Hard<br />\nTrip and Small Size of Squad Responsible—To Run Saturday.<br /><br />\nHopkins' record in the Intercollegiate League is still unbroken, Swarthmore's *lacrosse<br />\nteam went down to a bad defeat<br />\nat the liall(ls of the Black and<br />\nBlue twelve last Saturday. The<br />\ngame, which was played at<br />\nSwarthmore, followed a very severe rain, and the field was in<br />\nsuch a condition as to slow down.<br />\nthe playing considerably. Despite this fact, the final score was<br />\n12 to 0 in favor of Hopkins, Silberstein and Bauernschmidt caging most of the goals.<br />\nFour tallies were scored up for<br />\nHopkins in the first half, and<br />\ndouble that amount in the second<br />\nperiod, although extra men, which<br />\nwere taken along with the team,<br />\nwere put in. Hopkins' team work<br />\nand passing was the same excellent brand that was shown<br />\nagainst Rutgers. The team was<br />\nsuperior to their opponents in<br />\nevery branch of the game. On<br />\nthe defense, which as a whole<br />\nplayed air-tight lacrosse, Frank<br />\nMorley and Dougherty were the<br />\nstars, the latter stopping some<br />\nmighty pretty shots.<br />\nThis is the lacrosse team's first<br />\ntrip, and the entire squad is confident that the ones to follow will<br />\nbe just as successful.<br />\nThe line-up:<br /><br />\nA ftey an uncomfortable and<br />\ntiring trip, seven men of the<br />\nJohns Hopkins track team fared<br />\nrai her 10101iy in the S. A. I. A. A.<br />\nchampionships, held at . Blacksburg, Va. Virginia won the meet,<br />\nwit hi T2 points; Hopkins was<br />\nfifth, with 17. The rather unsatisfactory showing Of the team was<br />\ncaused by the strenuous trip, the<br />\nchange in climatic conditions and<br />\nthe' cost of the journey, which<br />\nnecessitated pruning the team to<br />\nonly seven men. Those who made<br />\nthe trip were: Captain Bartels,<br />\nAaronson,<br />\nliriVer,<br />\nEdwards,<br />\n(;rave. Thompson, Van Ness and<br />\nAssistant Coach Lloyd.<br />\nThe best individual showing<br />\nmade by,a Hopkins man was that<br />\nof Aaronson, who in winning<br />\nthird in the 100:ya1'd dash and<br />\nsecond ill the pole vault, got<br />\nnearly half of Hopkins' points.<br />\nBartels, who was just a little out<br />\nof his form, did very well to get<br />\nthird in the mile, which was won<br />\non a slow track in the very good<br />\ntime of 4 minutes 34<br />\nseconds.<br />\nThompson, who ran second in<br />\nthe quarter, had no easy time of<br />\nit. Forced to run a fast quarter<br />\non Friday to qualify, he could not<br />\nquite come through on Saturday.<br />\nRobbins' time of 51 seconds was<br />\nfast for the slow track. Driver<br />\nfailed to qualify in this event.<br />\nEdwards, after running a 2.05<br />\nhalf to qualify, showed real form<br />\nin coining back on Saturday and<br />\ngetting third in the finals, which<br />\nwere run in 2 minutes 2 5 seconds. Van Ness, in the 100 and<br />\n220, and Thompson, in the low<br />\nhurdles, each finished just out of<br />\nplaces in their heats. Grave had<br />\nequally hard luck in the two-mile.<br />\nThe following is a summary of<br />\nthe events in which Hopkins<br />\nfigured.<br /><br />\nAll letters intended for publication<br />\nmust be concise.<br />\n•<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be printed<br />\nif request is made that they be omitted.<br />\nThe publication of a letter is not to be<br />\ntaken as an indorsement of its views by<br />\nTHE NEWS-LETTER, which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nTo the Editor of THE NEWS-LETTER:<br />\nSir—Has the memory of one of<br />\nour heroes been so easily forgotten? ha ye we forgotten that the<br />\nflagpoles in front of thboon Hall<br />\nwere erected several years ago as<br />\na \"Layfield Memorial,\" and that<br />\nan American and a Maryland flag<br />\nwere suiqmsed to be hung from<br />\nthem ?- I have only seen an American flag hung there occasionally,<br />\nand with no regularity. The University has all H. 0. T. C. whose<br />\n\"resprit de corps\" ought to be<br />\nsuch that they should wish to have<br />\nthe flags flying at all formations,<br />\naside from the fact that they were<br />\nmemorial. I<br />\nplaced there as<br />\n5110111(1 suggest that a freshman<br />\nguava of honor be appointed,<br />\nWhose duty it shall be to see that<br />\nthe flags are put up every (lay<br />\nand taken down at sundown. This<br />\nwill till the double purpose of<br />\nkeeping the memorial alive in our<br />\nminds and the splendor of having<br />\nthe flags as an'emblem of a military organization.<br /><br />\nMEMBER 01.' MONUMENTAL CLUB.<br />\nTo the Editor of. THE NEWS-LETTER:<br />\nSir—Don't we realize any more<br />\nwhat our University song it?<br />\n0m't we appreciate that \"Veritas<br />\nVOS Liberabit\" is to Johns Hopkins what \"The Star-Spangled<br />\nBanner\" should be to the United<br />\nStates? And yet we sit as still<br />\nand quiet when we hear it played<br />\nas though it were just some other<br />\nsong for Hopkins' men to sing.<br />\nThere ought to be no one sitting<br />\ndown when they hear it—everyone<br />\nought to jump to his feet on the<br />\nfirst note. The. old McCoy Hall<br />\ncrowd used to do it always. And<br />\nhardly a. meeting, a debate or a<br />\nconference was. begun Without<br />\nsinging that song. .<br />\n1 am writing this particularly<br />\nafter the Hoinewood concert,<br />\n'When only a few of the student<br />\nbody arose wlwn \"Veritas vos<br />\nLiberabit\" was sung, and several<br />\nothers whom I asked afterward<br />\nsaid that they did not appreciate<br />\nthat it WIlS the ode of the University. It is, whether you realize it<br />\nor not! It is certainly entitled to<br />\nthe respect accorded others of the<br />\nsame nature. You men, who would<br />\nkeep all Hopkins' traditions, stand<br />\nup the next time it is played!<br /><br />\nMEMBER OP MONUMENTAL CLUB.<br />\nAn Excellent Idea.<br /><br />\nTo the Editor of THE NEWS-LETTER:<br />\nSir—The very favorable review<br />\nof \"The Admirable Crichton\" in<br />\nthe Baltimore Sun of April 28,<br /><br />\nHopkins.<br />\nPos.<br />\nSwarthmore.<br />\nDougherty<br />\nG.<br />\nPugh<br />\nMorley<br />\nr.<br />\nJoseph<br />\nTurner<br />\nVqlentine<br />\nC. P<br />\nMeyer..<br />\nD<br />\nGillam<br />\nHoffman<br />\nS. D.<br />\nJohnson<br />\nHinrichs<br />\nT. D.<br />\n.Willis<br />\nBenjamin<br />\nBloom<br />\nC<br />\nGriffiss<br />\nT. A. ........Atkinson<br />\nKauffman<br />\nJackson<br />\nS A<br />\nDefandorf.<br />\nKatzenbao<br />\nF. A<br />\nBauernschmidt...O. H.....<br />\nAlberston<br />\nStuart<br />\nI. H<br />\nMammel<br />\nSubstitutions — Hopkins: Toiler for<br />\nHoffman, Williams for Bloom, Wood for<br />\nGriffiss, Silberstein for Defandorf, Defandorf for Stuart; Swarthmore: Albertson for Pugh, Christenson for Willis, Geiges for Albertson.<br /><br />\n1920, by J. 0. L., Baltimore's foremost dramatic critic,reflects much<br />\ncredit on the really praiseworthy<br />\nefforts of the Johns Hopkins Dramatic Club. Moreover, it shows<br />\nin a straightforward manner the<br />\napparent lark of interest shown<br />\nby Hopkins' men in supporting<br />\ntheir ow-n activitie,. While Mr.<br />\nJ. O. Lambdin's words are encouraging and optimistic, so far<br />\naS the production itself is concerned, he is very rightfully indignant at the lacadaisical attitude<br />\nof the students and the alumni,<br />\nand he deplores the seeming lack<br />\nof appreciation of literary and<br />\ndramatic talent here at the University.<br />\nJ. 0. L. is right. That such a<br />\ntruly<br />\nadmirable<br />\nperformance<br />\n5110111(1 receive such half-hearted<br />\nsupport by the students does seem<br />\nto .indicate a lack of appreciation<br />\namong us, yet the writer hesitates<br />\nto say that we are unable to appreciate the good things of- literature and the drama. The reason<br />\n(Continued on page 12, col. 1)<br /><br />\nDash—Seward, Virginia;<br />\n100-Yard<br />\nThomas, Washington and Lee; Aaronson, Hopkins; Delaverge, Catholic University; Thompson, Washington and<br />\nLee. Time, 10 1-5 seconds.<br />\n440-Yard Run—Robbins, Washington<br />\nand Lee; Thompson, Hopkins; Baker,<br />\nVirginia; Glascott, Catholic University;<br />\nRoyall, Carolina. Time, 51 seconds.<br />\nMile Run—Linkous, Tech; Wharton,<br />\nTech; Bartels, Hopkins; Ranson, Carolina; Green, Virginia, Time, 4 minutes<br />\n34 3-5 seconds.<br />\n880-Yard Run—Wh•firton, Tech; Yellot. Virginia; Edwards, Hopkins; Edmunds, Virginia; Shands, Virginia. Time,<br />\n2 minutes 2 1-5 seconds.<br />\nPole Vault—Spencer, Carolina; Aaronson, Hopkins;.•Hines, Washington and<br />\nLep; Rutledge, Catholic University;<br />\npyrd and Silberstein tied for fifth place.<br />\nHeight, 10 feet 5 inches.<br /><br />\n5<br /><br />\nAT OTHER COLLEGES<br />\nIartinouth has started her<br />\nspring football practice and had<br />\n40 men out the first day. Among<br />\nthis number, there are, however,<br />\nvery few 'varsity players, since<br />\nmost of the 1919 team are now<br />\nengaged in other sports.<br />\nAssistant Coach Jack Cannell<br />\nplans to drill the men thoroughly<br />\nin the fundamentals of the game,<br />\nespecially the passing 0101 kicking<br />\ndepartments. No scrimmages will<br />\nbe held. Thus he hopes to have,<br />\nin addition to the men from last<br />\nseason's eleven, a large number of<br />\nplayers who will be ready to take<br />\nIll)the more advanced work in the<br />\nfall.<br />\nThe Athletic Board of Control<br />\nat Dartmouth has announced that<br />\nEdward E. Martin bas been appointed coach of the freshman<br />\nbaseball squad. Martin was for<br />\nthree seasons third baseman on<br />\nthe Hanover team and One of their<br />\nstar players.<br />\nCuts at Williams ape allowed<br />\non a basis of scholastic standing.<br />\nAs high as 10 per cent. allowed<br />\nabsemps iii iv be secured. Dartmouth has a similar system; a<br />\nstudent above a certain grade may<br />\nhave unlimited cuts.<br />\nColumbia has a 'I\" club for all<br />\nmen,students or alumni, who have<br />\nwon their letters in any 'varsity<br />\nsports. Its object is to instil<br />\ndeeper respect for men who have<br />\nearned Columbia's highest honors<br />\nin athletics.<br />\nThat Cornell students are supporting. the Cornell endowment<br />\ndrive is shown by the latest reports of the campus campaign.<br />\nAlready the undergraduates have<br />\nsubscribed $600,000, and the average subscription is s166.<br />\nMoving pictures as an advertising scheme are being seriously<br />\nconsidered at Harvard, where tentative plans have already been<br />\nmade with film companies to present scenarios dealing with Harvard life and men. Eight companies are said to have bid for<br />\nthe privilege, and one Itas gone so<br />\nfar as to offer to expend from<br />\n$60,000 to $80,000 on 0 five or sixreel dramatic film with all the fixings in exchange for the indorsement of the university and distribution rights.<br /><br />\nThe United States' representatives in the competition for the<br />\nAll industrial university to cost<br />\nDavis Cup will leave this country $5,000,000 will be erected in<br />\nfor England on May 29, to com- Shanghai, if the plans of Chinese<br />\npete in the matches which will be- educators and industrial leaders<br />\ngill on .Tune 21. Three players are attained. A novel feature of<br />\nhave been chosen already, and the the proposed university will be<br />\nfourth will be decided on shortly. the incorporation in it of a comJohnston, Tildeil and Williams plete cotton mill which will emare definite, and the remaining ploy its students and require<br />\nchoice lies between Garland, :them to perform productive toil,<br />\nJohnson and Harte.<br />\nas well as school work.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\nWARDLOW MILES TO SPEAK<br /><br />\nDEAN FOR ENGINEERS<br /><br />\nOTHER PLAYS ON THE WAY<br /><br />\nMATII CLUB HOLDS MEETING<br /><br />\nWill Address Literary Club on Thursday, May 20th at 4:30—Levin and<br />\nWiscott Read Papers.<br /><br />\nAppointment of Dr. Whitehead ruts<br />\nDepartment of Engineering on an<br />\nEquality with Arts and Sciences.<br /><br />\nAll Hopkins Productions May Appear<br />\nInformally McCleary and \"Miti.h\"<br />\nCarroll Are The Authors.<br /><br />\nDr. Hulburt Addresses This Year's<br />\nLargest Audience- \"1 he Circular<br />\nPoints at Infinity\" His Subject.<br /><br />\n• The Literary Club has been very<br />\nfortunate in securing Dr. L.<br />\nWardlow Miles, headmaster of<br />\nGilman School, to deliver a public lecture on the afternoon of<br />\nThursday, May 20, in the Civil<br />\nEngineering Hall, at 4.15 o'clock.<br />\nThe subject of the lecture will<br />\nbe \"Poetry of the War,\" a theme<br />\nwhich Dr. Mile is admirably<br />\nqualified to speak upon, as he<br />\nwas a captain with the 307th Infantry and received the Congressional Medal for bravery.<br />\nAt the meeting of the Literary<br />\nClub on Friday night, May 7, two<br />\nexcellent papers were read by<br />\nWiscott and Max Levin on \"Andreyer\" and \"The Jews and Their<br />\nLiterature,\" respectively.<br />\nIn speaking of this great Russian, Wiscott said: \"In the writings of Andreyer may be seen the<br />\npen of Tolstoy, Dostoievsky,<br />\nTchekov and Gorky. From Tolstoy, he seems to have learned how<br />\nto see things and how .to convey<br />\nthem to the reader; from Dostoievsky, he seems to have learned how<br />\nto penetrate the hidden recesses<br />\nof the human soul and to lay bare<br />\nits secrets without skame or fear;<br />\nfrom Tchekov he has acquired that<br />\nbrevity and power to depict in a<br />\nfew bold strokes the whole drama of life.\" And yet he acknowledged the Bible as his greatest<br />\nteacher.<br />\n'Madness and Horror,'the first<br />\ntwo words of 'The Red Laugh,'<br />\n\\\\ hiell is classed by many critics<br />\nas his master piece, might well<br />\nserve as the text for Andreyer's<br />\ncomplete works. Solitude, silence<br />\nand death are his themes. He<br />\nis a symbolist and an impressionist. He is a musician of the Russian soul, who, with a technique<br />\nmore dazzlingly brilliant than a<br />\nKreisler,•produces from the soulstring of Russian character a<br />\nmelancholy minor melody which<br />\nis eternally haunting.\"<br />\nMax Levin, in discussim, the<br />\nJews and their literature, 71ivided his subject into four literary<br />\nperiods. He traced Hebrew literature from its growth down to<br />\nthe present day. \"The flourishing<br />\ncondition of modern Hebrew literature is directly due to a movement known as the Haskalah<br />\nmovement, meaning 'enlightenment.' Thanks to this movement,<br />\nwe find today a literature in the<br />\nHebrew language which will undoubtedly some day attain the<br />\nsize and importance of English,<br />\nFrench or German literature.\"<br />\nThe chiefs among the Hebrew<br />\nwriters of today are: Asher Ginsberg, who is probably the greatest master of Hebrew writers;<br />\nLeon Gordon and H. N. Bialik,<br />\nboth poets; Shololom Alaichen,<br />\nthe Jewish Mark Twain; and Is-<br /><br />\n- The Dramatic Club expects to<br />\nWith the appointment of Dr.<br />\nJohn Boswell Whitehead, profes- end its season of 1920 with an insor of electrical engineering, to formal production of two all-.<br />\nthe new office of Dean of the De- Hopkins plays; that is, plays<br />\npartment of Engineering, the written, produced and attended<br />\nTrustees placed the Engineering by Hopkins' men. These two<br />\nSchool on equality with the Col- plays are: \"Mosaics,\" by Mclege of Arts and Sciences and the Cleary, and \"Burning the MidSchool of Medicine, each of which night Oil,\" by Mitchell Carroll.<br />\nhas its own Dean for administra- 130th of them are snappy little<br />\n'farces, well written, and especialtive work.<br />\nThe appointment of Dr. White- ly adapted to a college presentahead is regarded as an official tion.<br />\nWork on the two plays has been<br />\nrecognition of the part he has<br />\nplayed in the rapid growth and suspended for some time, because<br />\ndevelopment of the School of En- of the second production of \"The<br />\ngineering, which, since its foun- Admirable Crichton,\" but now<br />\ndation six years afro, has forged that has passed, all efforts are<br />\n\" of technical bent on making these last presento the front rani:<br />\nschools of the country, and is tations a successful termination<br />\nnow in a class with the engineer- of the year.<br />\nThe object of this performance<br />\ning schools of Cornell, Lehigh,<br />\nCarnegie Institute and others of is not to raise money, but to inlike calibre. Of the 2,750 stu- terest the Hopkins student body<br />\ndents enrolled in the University, and st inotlate a greater interest<br />\n675 are taking engineering in llopl,ins' dramatics for the<br />\nnext yea v. No admission will be<br />\ncourses.<br />\nDr. Whitehead now ranks with charged, and the farces will be<br />\nDr. Latane and Dr. .T. Whitridge presented without costume, either<br />\nWilliams, Dean of the School of in the Barn or the Civil EngineerMedicine. As yet the School of ing Lecture Hall, and probably<br />\nhygiene and Public Health has for the student body only. Alno Dean, its administrative af- though none of \"The Admirable<br />\nfairs being handled by Drs. Will- Crichton\" cast will be included,<br />\niam Welch and William H. How- yet the careful selection from a<br />\nell, Director and Assistant Di- goodly number of candidates insures a well-portrayed presentarector, respectively.<br />\ntion.<br />\nadminand<br />\nn<br />\nIn the organizatio<br />\nistration of the courses, Dr.<br />\nIn their first showing of the<br />\nWhitehead has been extremely active, and since 1914 has been season, the Princeton crews took<br />\nsecretary of the Advisory Com- two out of three races in the Harmittee of the department, dis- vard spring regatta on. the<br />\ncharging many duties of a Dean. Charles River, winning the 'varHe was largely responsible for the sity and freshman contests, but<br />\nsuccess of the evening courses and losing to Harvard in the junior<br />\nthe Department of Marine Engi- 'varsity race. In all three events,<br />\nneering and Navigation, esta%- the Princeton crews trailed the<br />\nlished in 1917 at the request of Harvard boats for the first mile<br />\nand a-half. At this • point the •<br />\nthe Shil)ping Board.<br />\nThe teaching methods and per- Princeton coxswains called for<br />\nsonnel of the evening classes are sprints, which spelled victory for<br />\nresults of the policy of Dr. the 'varsity and freshman boats,<br />\nWhitehead and his associates in while the junior 'varsity crossed<br />\nforming a close relationship be- the line a quarter of a length between the department and the hind the Crimson shell's prow.<br />\nvarious industries in the city<br />\nand State. This year nearly 350<br />\nThe University of Michigan is<br />\nstudents are enrolled, most of to have a Sunday college paper.<br />\nI hem young men and women em- It will contain feature articles<br />\nployed in the industries of Bal- written by the students and factimore, who desire to extend their ulty. It is the only paper of its<br />\ntechnical training.<br />\nkind known.<br />\nDr. Whitehead was graduated. --------from the old Department of Elec- lowship in Carnegie Institute of<br />\ntrical Engineering, headed by Techliology.<br />\nProf. Henry Rowland, in 1893.<br />\nSeveral years later he formed<br />\nPoi- three years he was employed a partnership with Charles R.<br />\nby the Westiiighotise Electric Reeder. He served as consulting<br />\nCompany at Pittsburgh, and then engineer successively for the<br />\nwent to the Niagara Falls Power Maryland Electric Railway, State<br />\nCompany, New York.<br />\nHospital at Crownsville, Md.,<br />\nIn 1897 he returned to Hopkins, Gilman Country School and the<br />\nand in 1898 he received the de- power plant here. In 1914 he was<br />\ngree of bachelor of arts. In 1902 appointed professor of electrical<br />\nhe was made a doctor of philoso- engineering in the new Engineerphy and received a research fel- ing Department.<br /><br />\n(continued on page 10, col. 11<br /><br />\nOn Thursday. May 6, the largest<br />\nmeeting this year of the Undergraduate Mathematics Club was<br />\naddressed by Professor Lorraine<br />\nS. Hulburt. Dr. Hulburt's subject was, \"The Circular Points at<br />\nInfinity.\" In order to make the<br />\nsubject intelligible to the uninitiated, he only skirted the misty<br />\nmid-region of projective geometry<br />\nand approached the two circular<br />\npoints by the open road of analytics. Thus these points, altogether imaginary and infinitely<br />\nremote though they are, were<br />\nbrought, under the skilful handling of the speaker, into the mental touch of the undergraduates<br />\npresent. Time failed before the<br />\nprofessor could take up any of<br />\nthe ramifications of the subject,<br />\nbut he consented to continue the<br />\nexposition at the next weekly<br />\nmeeting.<br />\nIt is the purpose of the Undergraduate Mathematics Club to<br />\ntake up those points sufficiently<br />\nelementary to be understood by<br />\nall members, but which are not<br />\ninchuled in any subject in the undergraduate mathematics curriculum. Dr. Hulburt has declared<br />\nhis intention of giving a course<br />\nin projective geometry next year,<br />\nso that students who were enough<br />\ninterested in his address to wish<br />\nto go deeper into the subject will<br />\nhave this opportunity. At present, however, the subject is not<br />\ntaught. The meetings of the club<br />\nare held weekly at 12.30 o'clock on<br />\nthat day when fewest competing<br />\nattractions are offered. Since the<br />\ndiscussion generally lasts during<br />\nmost of the lunch period, the<br />\nproper, procedure is for members<br />\nto bring their sandwiches with<br />\nthem to the meeting place and eat<br />\nthem some tune between the principle theorem and its corollaries.<br />\nThe Memorial Dormitory Fund.<br /><br />\nThe Alumni Memorial Dormitory Fund had reached the total<br />\n$200,000 by the end of the Commemoration Day dinner, February 2:t, 1920. On May 4, the commit tee in charge of the campaign<br />\n!mule arrangements to complete<br />\nthe fund, so that the $300,000<br />\nneeded for the dormitory would<br />\nla raised by Commemoration<br />\nDay. Every effort will be made<br />\nIt) 'secure subscriptions from the<br />\nalumni and friends of the University. A number of special memorials are being planned by several classes. These will take the<br />\nform of suites of rooms, the Commons Hall, the dining hall, etc.,<br />\nin the proposed dormitory.<br />\nIf two red, lips were upturned to your<br /><br />\nown,<br />\nWith no one to gossip about it.<br />\nWould you pray for endurance to leave<br />\nthem alone?<br />\nWell—maybe you would, but I doubt<br />\n—Ex.<br />\nit.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br />\nNa,<br /><br />\nGEOLOGISTS BACK FROM ,PERU<br />\nDr. Singewald Returns From Third Expedition to South America Much<br />\nAdditional Knowledge Obtained.<br /><br />\n.. and at the Naval<br />\nAcademy, Annapolis<br />\neAr fact:<br />\nAt Annapolis, as with Navy<br />\nOfficers generally, Fatima is by<br />\nfar the -largest-selling cigarette.<br />\nThis is true both at the Officers'<br />\nMess in the Academy and in the<br />\ntown itself, while among the<br />\nmid3hipmen Fatima is especially<br />\npopular.<br />\nrievalrA4.,...4-4.<br /><br />\nT<br />\nI<br />\nM<br />\nA Sensible Cigarette<br /><br />\n,<br /><br />\n'just enough Turkish\"<br /><br />\n, tgrAtt--<br /><br />\nAck,<br /><br />\n•<br /><br />\nA<br /><br />\nThe fact that the Naval Cadets are<br />\npicked men, representing every<br />\nState in the Union, makes this one<br />\nof Fatima's strongest endorsements.<br />\nHere at Annapolis as elsewhere,<br />\nmen have discovered that cigarette<br />\ncharacter depends on the right proportioning of Turkish tobacco.<br />\nSo Fatima owes its popularity to<br />\nthe fact that it contains not too<br />\nmuch, i- lor too little, but just enough<br />\nTurkish—just enough to taste right,<br /><br />\ne •<br /><br />\nI.1<br /><br />\n.S.<br /><br />\n—mut_<br />\n—<br />\nArlieglart<br /><br />\n•<br /><br />\n4-!•.,4**<br />\n4<br /><br />\n.. :..x.c....1_-:,-..i\".,•;:' ,<br />\n1<br /><br />\n- • --<br /><br />\nY<br />\n11'e<br /><br />\n;-(<br /><br />\nDr. Joseph T. Singewald, Jr.,<br />\nassociate professor of economic<br />\ngeology, returned to the University on Friday, after a fivemonths' trip to Peru, where he<br />\nhas been engaged in geologic investigations. Dr. Singewald was<br />\ngranted leave of absence to return to South America early last<br />\nDecember, shortly after his return<br />\nfrom the George Huntington<br />\nWilliams' Memorial Expeditions<br />\nto South America, which was sent<br />\nout by the University toward the<br />\nclose of the last academic year.<br />\nOn that expedition, Professors<br />\nBerry and Singewald were unable<br />\nto visit the northern part of Peru,<br />\na region of considerable importance in the geologic history of<br />\nthe west coast of South America.<br />\nOn this trip, Dr. Singewald spent<br />\nconsiderable time in an exhaustive investigation of that part of<br />\nthat region. In addition to making a careful study of the stratigraphy of the area, Dr. Singewald<br />\nsecured a large collection of fos.:<br />\nsils, which he has brought with<br />\nhim for the Department of Geology, and which will be the object of further researches in that<br />\ndepartment.<br />\nThis riew study of some of the geologic problems of -South America<br />\nfits in excellently with the work of<br />\nthe Williams' Expedition and will<br />\npermit of more comprehensive interpretation of the South American work previously done by<br />\nmembers of the Geologic Department. This is Dr. Singewald's<br />\nthird geologic expedition to South<br />\nAmerica. For five years he has<br />\nbeen specializing in the geology<br />\nand mineral resources of that continent and now ranks among the<br />\nhighest authorities in that field.<br />\nThe region in which Dr. Singewald worked is close to the sea<br />\nand at less than 4° S. latitude,<br />\nso that he avoided the unusually<br />\nsevere winter of the United States<br />\nand instead suffered extremely hot<br />\nweather. So intense were the rays<br />\nof the tropical sun, that the members of the party were tanned<br />\nthrough their shirts and in the<br />\nafternoon, the ground frequently<br />\nbecame so hot that it burned<br />\nthrough the soles of the shoes to<br />\nsuch an extent as to make it almost impossible to remain tanding at one spot. The region is<br />\nalso such an arid one that no<br />\nfresh water is naturally available,<br />\nand the party had to be supplied<br />\n,with distilled sea water. Since<br />\nthey. were able to enjoy a magnificent surf bath at the close of<br />\nthe day's work and spend the<br />\nevenings on a porch overlooking<br />\nthe sea and fanned by cooling sea<br />\nbreezes, the heat of the day was<br />\nbearable.<br />\nThe work itself consisted of an<br />\nexamination of one of the oil<br />\n(Continued on page 8, col. 4)<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\n8<br />\nORME!<br /><br />\nottittgl6ranis<br />\n(Mahn<br /><br />\nFOR YOUNG MEN AND MEN<br />\nWHO STAY YOUNG<br /><br />\nNOTED SOCIALIST TO SPEAK HERE<br />\nJohn Spargo to Lectut e Under Auspices<br />\nof Social Science Club—The Public<br />\nIs Cordially Invited.<br /><br />\nOn Tuesday, May 11, at 4.1:;<br />\nP.- M., in the Civil Engineering<br />\nLecture Hall, John Spargo, of international reputation as Socialistic lecturer, writer and worker.<br />\nwill deliver a lecture, entitled<br />\n\"The Social Problem After the<br />\nWar.\"<br />\nMr. Spargo has been identified with the Socialistic cause in<br />\nEngland since 1895. Coming to<br />\nAmerica in 1901, he entered upon<br />\nhis present career of writer and<br />\norganizer. He was prominent in<br />\nthe founding of the American Alliance for Labor and Democracy,<br />\nand in 1917 assisted in the formation of the National Socialistic<br />\nParty. Ile is the author of over<br />\na score of books, the latest of<br />\nwhich is upon the subject of Bolshevism. hi short, he iA one of<br />\nthe foremost Socialists in America.<br />\nThe lecture is under the a us<br />\npices of the Social Science Club.<br />\nThe public are cordially invited<br />\nto attend.<br />\n\"Sun\" Man Gives Talk.<br /><br />\nand workmanship are as important as the all-wool fabric<br />\nyou select if you wish to add to your<br />\nself respect and the confidence of<br />\nothers in you. Society Brand Clothes<br />\nhave a national reputation as the leader in<br />\ncorrect style and careful hand -workmanship.<br />\nWITH THE VARIED GRADES OF CLOTHING FLOODING<br />\nTHE MARKET, LOOK FOR THE LABEL AS YOUR GUIDE<br />\nALFRED DECKER &amp; COHN, Makers<br /><br />\nChics:o<br /><br />\nSOCIE'l Y ERAND CLOTHES, Limited, for Canada<br /><br />\nNew Yc.rk<br /><br />\nHub<br /><br />\nMontreal<br /><br />\nBALTIMORE, CHARLES<br />\nAND FAYETTE STREETS<br /><br />\nFollowing the practice of having outsiders give talks on their<br />\nrespective professions, Dr. French<br />\nsucceeded in procuring Mr. Porn r, of The Sun staff, to speak to<br />\nthe Freshman English composition class. After explaining the<br />\nopportunity for Hopkins' men to<br />\nwork on The Suit during the sumMr. Porter went on to speak<br />\nabout the newspaper \"game\" as a<br />\nwhole. In part, he said: \"The<br />\nreal object of a newspaper is its<br />\nnews, not the features, entertainments or editorials.\" Local news<br />\nis of paramount importance, and<br />\na \"spicy divorce story is desired<br />\nabove all.\" Mr. Porter pointed<br />\nout that everyone starts as a<br />\n\"cub\" reporter, and is usually assigned to police news at first. He<br />\nexplained the general workings of<br />\nthe news-collecting agency of a<br />\nbig metropolitan newspaper, and<br />\nin ending, assured the freshmen<br />\nthat \"no one but a millionaire<br />\ncan own a big paper today.\"<br />\nConcerning college football teams,<br />\nToo oft it comes to pass,<br />\nThe man who's halfback in the field,<br />\nIs fullback in his class.<br /><br />\nGEOLOGISTS BACK FORM PERU<br />\n•<br /><br />\n(Continuedfrom page 8)<br /><br />\nfields of the northern coastal region of Peru. The geology of the<br />\nregion proved to be unusually<br />\nComplicated and difficult, making<br />\nthe problem of unraveling it of<br />\nintense interest. The work showed<br />\nthe incompleteness and incorrectness of •previous work in the region. and has resulted in the- first<br />\ncorrect interpretation of its geology. Consequently it furnishes<br />\nquite an addition to the knowledge of South American ricreolo\"V-<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, MAY 11, 1920.<br /><br />\n9.<br /><br />\nORATORS TO HOLD MEETING<br /><br />\nA good guess for<br />\nyou would be—<br /><br />\n—There's style<br />\nto them<br /><br />\nhub<br />\n'Baltimore, Charles and Fayette<br /><br />\n— AMUSEMENTS —<br /><br />\nAUDITORIUM<br />\nAT 8.15<br />\n50c to $2.00<br /><br />\nl'uN1GHT<br /><br />\nThe Oratorical Society will<br />\nmeet in Room 112, Gilman Hall,<br />\non Friday, May 14, at 1.30 P. M.<br />\nIt is planned to make this the<br />\nbanner meeting of this year. Mr.<br />\nAlbert Hammond will deliver a<br />\nspeeeli upon some current topic<br />\nand there will also be an address<br />\nby a representative of the 0. P.<br />\nK.At this meeting pl-u us will be<br />\ndiscussed, and a committee probably appointed to 'aid iii increast...<br />\n• the, membership by urging<br />\npersons specially qualified in oratory to join. This meeting will he<br />\none of general interest, and everyone is invited.<br />\nBLACK AND BLUE LOSES TWICE<br /><br />\n(Colitinitrdfrqin page<br />\nthe Engineers runless: during the<br />\neinainder of the game.<br />\nWeigele was the individual star<br />\nof the game, for his twirling completely baffled the visitors.. Hopkins threatened .only in the eighth,<br />\nwhen 'men were on second and<br />\nthird with only one out, but Weigele tightened and the rally ended. Daly starred in the field for<br />\nStevens, while Broomsburg played<br />\na good game for the Black find<br />\nBlue, making several spectacular<br />\nplays.<br />\nThe score:<br /><br />\nThe SELWYNS Serve<br /><br />\nTEA FOR 3<br />\nWith the original company, including<br />\nARTHUR BRYON,<br />\nLAURA HOPE CREWS,<br />\nFREDERICK PERRY.<br /><br />\nKurtz, rf<br />\nDaley, 3b<br />\nBarry 9S<br />\nHuneke, 2b<br />\nLast, cf<br />\nDonnelly, If<br />\nEgger, lb<br />\nFerrari, c<br />\nWetgele, p<br />\n.Tobin, rf<br />\nHurst, cf<br />\nTotals<br /><br />\nNext Week—Seats Now.<br />\nOliver Morosco Presents<br />\nTHE BIRD OF PARADISE<br /><br />\nSpring practice for the Army<br />\nfootball men has started at West<br />\nPoint. The training will be under the management of Capt.<br />\nCharles D. Daly, head coach last<br />\nyear, who will act again in this<br />\ncapacity in the fall. A limited<br />\nnumber of cadets reported for the<br />\nfirst work-out, but a large squad<br />\nwill be started drilling in a few<br />\ndays.<br /><br />\nIN THE YOUNG MEN'S SHOP—<br /><br />\nMr. Hammond and an 0. D. K.<br />\nRepresentative Will Speak—All<br />\nStudents Are Urged to Attend.<br /><br />\nSTEVENS.<br />\nAb. 11. 1-1. 0.'A. E.<br />\n1 1 0 0 0 0<br />\n4 O 0 3 4 0<br />\n4 0 0 1 9 1<br />\n1<br />\n4 O 0 1<br />\n3 0 0 1 0 0<br />\n4 1 9 0 0 0<br />\n'0 1 12 0 0<br />\no 1 0 9 1 0<br />\n'O 0 0 2 0<br />\n1 0 0 0 0 1<br />\n1 0 0 1 0 0<br />\n,28<br /><br />\n3<br /><br />\n3 28 13<br /><br />\nJOHNS HOPKINS.<br />\nAb. R. H. 0.<br />\nBenson, cf<br />\n.. 3 0 0 3<br />\nBarchet. 2b<br />\n4 0 0 4<br />\nEgerton, lb<br />\n3 0 1 5<br />\nCox, If<br />\n4 0 0 0<br />\nKnecht. rf<br />\n4 0 0 1<br />\nBloomsburg, 3b....... 3 0 0 3<br />\nReifsneider, ss<br />\n3 0 1 0<br />\nWood, c<br />\n3 0 0 8<br />\nWelliver, p.<br />\n1 0 0 0<br />\nLove, p<br />\n2 0 0 0<br /><br />\n3<br /><br />\nA. E.<br />\n0 0<br />\n2 0<br />\n0 0<br />\n0 0<br />\n0 0<br />\n3 2<br />\n1 0<br />\n2 0<br />\n0 1<br />\n2 1<br /><br />\nTotals<br />\n30 0 2 30 10 4<br />\nScore by innings:<br />\nStevens<br />\n0 0 1 2 0 0 0 0 0-3<br />\nJohns Hopkins<br />\n0 0 0 0 0 0 0 0 0-0<br />\nEarned Run—Stevens, 1. Bases on<br />\nBalls—Off Weigele, 1; off Welliver, 4.<br />\nFirst Base on Errors—Stevens. 3; Johns<br />\nHopkins, 2. Two-base Hit—Donnelly.<br />\nStruck Out—By Weigele, 9; by Welliver,<br />\n3: by Love, 2.. Passed Balls—Wood (2).<br />\nHit by Pitcher—By Welliver (Weigele).<br />\nUmpire—McMahon. Time of Game-1<br />\nhour and 15 minutes.<br /><br />\n\"DERBY'—a new Spring Suit; double-breasted, high-waisted skirt<br />\neffect, with outside change pocket. In plain colors and novelty<br />\nmixtures.<br />\nBALTIMORE'S BEST STORE<br /><br />\n,./thirnee<br />\nHOWARD AND LEXINGTON<br /><br />\nSHIRTS<br /><br />\nThe score:<br />\nWESLEYAN.<br />\nAb. R. H. 0.<br />\nJones,: :lb<br />\n5 1 2 1<br />\nBateman, cf<br />\n4 3 2 2<br />\nBoote,<br />\n4 0 1 3<br />\nWeb<br />\n.ss<br />\n4 1 1 8<br />\nJacobs, lb<br />\n4 0 • 1 12<br />\nCamp, 21,<br />\n3 1<br />\nRaines, If<br />\n3'2. 0<br />\nTomlinson. rf<br />\n3 0 0 0<br />\nConnolly. p<br />\n4 1 1 0<br />\nThornton, if<br />\n1 0 0 0<br /><br />\nA. E.<br />\n2 0<br />\n0<br />\n1 0<br />\n4 2<br />\n0<br />\n1<br />\n0<br />\nO 0<br />\n6 0<br />\nO 0<br /><br />\nNECKWEAR<br /><br />\nLelranc &amp; Ault<br />\n421 N. Noward St.<br />\nHOSIERY<br /><br />\nGLOVES<br /><br />\nTHE ARCADE TEA ROOM<br />\n324 N. CHARLES ST.<br /><br />\n• Totals<br /><br />\n35 10 13 27 14 2<br />\nJOHNS HOPKINS.<br />\nAl). R. H. 0. A. E.<br />\nBenson. 'cf<br />\na 0 2 2 0 0<br />\nI:arehot, 21,<br />\n5 1 0 4 2 1<br />\nEgerton, lb<br />\n4 1 0 7 1 1<br />\ncox, if '<br />\n4 1 2 5 0 1<br />\nKnecht. rf., p<br />\n3 1 2 0 0 0<br />\nBloomsburg, 313<br />\n4 0 2 0 5 3<br />\nReifpneider, as<br />\n4 1 0 2 1 0<br />\nWood, 'C<br />\n4 0 1 3 1 0<br />\nLove, p., rf<br />\n4 0 0 0 1 0<br />\nTotals<br />\n37 5 9 24 11 G<br />\nScore by innings:<br />\nWesleyan<br />\n1 3 0 0 4 1 0 1 x-10<br />\nJohns Hopkins<br />\n0 1 4 0 0 0 0 0 0— 5<br />\nThree base<br />\nHits —Wood, Raines,<br />\nWebb.Two - base<br />\nHits—Connolly,<br />\nKnecht. .Sacrifice HitsJacobs, Webb.<br />\nLefton Bases—Johns Hopkins, 6; Wesleyan, 3. Stolen Bases—Bateman (3),<br />\nCamp (2). Webb, Jones, Bloomsburg.<br />\nBases on Balls—Off Love, 2; off Knecht,<br />\n1: off Connolly, 1.<br />\nStruck Out—By<br />\nKnecht. 1; by Connolly, 1.<br />\nHit by.<br />\nPitcher—By Love, 1. Double Play—<br />\nWebb to Jacobs. Hits—Off Love, 11;<br />\noff Knecht, 2; off Connolly, 9, Umpire—<br />\nRerty. Time of Game-2 hours and 15<br />\nminutes.<br /><br />\nLuncheon<br /><br />\nAfternoon Tea<br /><br />\nSODAS AND SUNDAES<br /><br />\nMUSIC<br /><br />\nR.G.LOY &amp; COMPANY<br />\n1 W. UNIVERSITY PARKWAY<br /><br />\n••<br /><br />\nOPPOSITE J. H. U. ATHLETIC FIELD<br /><br />\nDrug Store for J. H. U. Boys<br />\nPHONE HOMEWOOD 2121<br /><br />\nBuy an (H) Pipe made special<br />\nfor the Boys.<br /><br />\nLEMMERT<br /><br />\nCONVENTION WEI L ATTENDED<br />\n(Continuedfrom page 1)<br />\nMADE TO ORDER<br />\ntended by over 60 men. The<br />\nAND<br />\nspeakers were men of well-known<br />\nreputation in the newspaper<br />\nFINISHED CLOTHES<br />\nworld : Mr. Herbert Swope and<br />\nMr. Don Carlos Seitz, of the New<br />\nPLAZA BUILDING<br />\nYork World; Mr. J. L. Heaton,<br />\nof the New York Times; Mr. Ar- 19 AND 21 EAST FAYETTE STREET<br />\nthur Brisbane, of the New York<br />\nEvening Journal; and Mr. Franklin G. Dunham, ex-president of<br />\nORTMAN'S<br />\nthe Pi Delta Epsilon, the honorary journalistic fraternity. At \"Queen Quality\" Home-Made Candies<br />\n80c. a pound<br />\nthe banquet it was announced that<br />\nthe Cornell Sun, was the winner<br />\nVISIT OUR ICE CREAM PARLORS<br />\nof the editorial contest.<br />\n227 N. HOWARD STREET<br />\nAfter the banquet, the delegates were taken on a tour of in- ARTISTIC PHOTOGRAPHS<br />\nspection through the offices of the<br />\nNeu- York World. Here • they<br />\naw froni.start to finish the prep319 North Charles Street<br />\naration of one of the largest papers in the. country.<br />\nSPECIAL DISCOUNT TO I. H.U. STUDENTS<br /><br />\nIlgenfritz<br /><br />\nROBERT PAUL IULA<br />\nTHE LAFAYETTE<br />\nCHOCOLATE SHOP<br /><br />\nORCHESTRA DE LUXE<br /><br />\nCharles and Lafayette Ave.<br />\nTELEPHONE. GILMOR 2929<br /><br />\nTHE ARCADE<br />\nTEA ROO/A<br />\n524 N. Charles St.<br /><br />\n/v\\USIC FOR DANCES, RECEPTIONS, ETC.<br />\nRESIDENCE, 014 FULTON AVENUE<br /><br />\nTHE. JOHNS<br /><br />\n10<br /><br />\nHOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\nAll the world<br />\nloves a lover —<br />\nAnd all discriminating<br />\nlovers of cigarettes love<br />\nMurads<br />\nBecause Murads are pure Turkish, the world's most famous tobacco<br />\nfor cigarettes.<br />\nAnd the Fame of Murads grows<br />\nand grows and grows—they are 100<br />\nper cent Turkish, and they are 100<br />\nper cent popular with connoisseurs<br />\neverywhere.<br /><br />\nis true that \"ordinary<br />\ncigarettes cost a trifle less.<br />\nIt<br /><br />\nJudge for yourself—!<br /><br />\n-<br /><br />\nDramatic Club.<br /><br />\nThe officers of the Dramatic<br />\nClub (Charles Leber, president;<br />\nHarry Morriss, secretary; Bartus<br />\nTrew, business manager) wish to<br />\nheartily thank all the members of<br />\nthe University who offered their<br />\niiervices to the club to assist in<br />\nproducing the second performance<br />\n'of \"The Admirable Crichton.\"<br />\nThis is especially meant for the<br />\nmen who took parts as 'servants<br />\nin the first act. These men made<br />\npossible the whole show, and by<br />\ntheir thorough attention to the<br />\nparts assigned to them, made the<br />\n\"tea scene\" a finished piece of actg. The constitution of the Dramatic Club requires a man who<br /><br />\nhas not a speaking part of over 25<br />\nlines to serve for two collegiate<br />\nyears before being admitted to<br />\nmembership in the club. To the<br />\nproperty men, also, much success<br />\nis to be attributed. Their work<br />\nbehind the scenes and in gathering together the necessary properties was done with as much<br />\nsmoothness and carefulness as<br />\nthough they were accustomed to<br />\nput a play on every week.<br />\nThe ranks of the club will be<br />\ngreatly depleted by graduation<br />\nthis year. Charles Leber, Harry<br />\nMorriss, John Bartels, all founders of the club; John Lewin, Paul<br />\nHinrichs, Aylett Coleman, Mitchell Carroll and Terry Burger,<br /><br />\nall of whom held important places<br />\nin the cast both this year and<br />\nlast, are all members of the graduating class.<br />\nFive events have been arranged<br />\nin the tentative program for the<br />\nInter-collegiate Flying Carnival<br />\non<br />\nto be held at Mineola<br />\nMay 7. The feature contest will<br />\nbe the cross-country race, in which<br />\n11 colleges have entered planes.<br />\nThe other events will be: Landing<br />\nfor mark, slow speed landing, an<br />\nobstacle race, and maneuver and<br />\nstunt flying.<br /><br />\nWARDLOW MILES TO SPEAK<br /><br />\n(Continuedfrom page 5)<br /><br />\nrael Zangwill, that master portrayer of Jewish Ghetto life.<br />\n\"With such a brilliant past behind then?,, may not the Jews<br />\n'hope for a, still more brilliant future in the fifth period of their<br />\nhistory—a period which was born<br />\nout of the World War, a period<br />\nin which once again a Jewish nation will live in a Jewish land r<br />\nRocks on the mountains,<br />\nFish in the sea,<br />\nLook how the profs<br />\nMake a .fool o.uter_ine.<br />\n—Ex.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 192().<br />\n13 SOUTH STREET<br />\nSafe Deposit and<br />\nCrus<br />\nt<br />\nBaltimoreSurplusCaanditaPlr<br />\nCompany of<br /><br />\n600$,0<br />\n2070<br />\n50 000<br />\nProfits,<br /><br />\nActs as Trustee of Corporation Mortgages. Fiscal Agent for Corporations and<br />\nIndividuals, Transfer Agent and Registrar. Depository under plans of reorganization.<br /><br />\n11<br /><br />\nR. 0. T. C. READY FOR INSPECTION<br />\nBattalion Keyed Up to Make Hopkins<br />\na \"Distinguished\" Institution - A<br />\nLarge Number Drill Voluntarily.<br /><br />\nActs as Executor, Administrator, Guardian, Trustee, Receiver, Attorney and<br /><br />\nAgent, being especially organized for careful management and settlement of estates<br />\nof every character.<br />\nOne-story fireproof building, with latest and best equipment for safety of<br />\ncontents. •<br />\nSafes for rent in its large fire and burglar proof vaults, with spacious and welllighted coupon rooms for use of patrons.<br />\nSecurities held on deposit for Out-of-Town Corporations and persons.<br /><br />\nThe IL 0. T.. F. has been working hard lately to put on the finishing touches for the inspection<br />\nthat is to come on Wednesday and<br />\nThursday of this week.<br />\nOn Tuesday afternoon of last<br />\nH. WALTERS, Chairman of Board.<br />\nJOHN J. NELLIGAN, Pres.<br />\nJOHN W. MARSHALL. Vice-Pres.<br />\nweek the entire unit had a setting-up drill on the oval in front<br />\nJ. W. BREEDLOVE &amp; CO.<br />\nTRAYER<br />\nWilbut F. Parker<br />\nCarl H. Nocke<br />\nof<br />\nthe Hopkins Club. Captain<br />\nBusiness Colleae<br />\nEllis, who has the ability of a<br />\nIncorporated<br />\nMerchant Tailors<br />\nborn gymnasium instructor, was<br />\nCharles and Fayette Sts., Baltimore, Md.<br />\nGAITHER BUILDING, 111 N. CHARLES ST.<br />\nin charge; the cadet officers makA distinctive business school. Day and night<br />\nPhone St. Paul 2625<br />\nclasses now open. You are cordiaily invited to<br />\ning corrections. After the exercall and talk with us.<br />\nPhone St. Paul 5626.<br />\nSpring Styles<br />\nFine Goods at ,`,71Coderale Prices<br />\ncises, the companies. went to different parts of the campus to<br />\npractice some work in open order<br />\nTHE<br />\nsignals.<br />\nCalvert and 'Thirtieth Sts.<br />\nThursday's drill was by classes,<br />\nCollar Hug Clothes<br />\nthe sophomores in map-making<br />\nBaltimore (mg<br />\nAllows J. H. U.students special discounts and the freshmen<br />\nyStrects<br />\nwith another<br />\npractical machine gun problem.<br />\n. . very<br />\nAt the close of the period a speHAND<br />\nCollege Text-Books SECOND<br />\nand NEW<br />\ncial appeal was made to. the men<br />\n.. best<br />\nto turn out for an hour's volunSMITH'S BOOK STORE<br />\ntary drill on Monday. A large<br />\n805 N. HOWARD ST.<br />\nnumber responded, but several<br />\n2 Doors Above Madison<br />\nCANNED FOODS<br />\npleaded engagements.<br />\nAgent for the Harvard Loose-Leaf Note Book<br />\nWinning the honor of a place<br />\nFor nfen Who<br />\non the distinguished list will<br />\nVhink<br />\n-make\" Hopkins in a military<br />\nThe Johns Hopkins University sense. As practically every man<br />\nU nnounces the following graduate in the battalion is keyed up to a<br />\nscholarships and fellowships for high pitch, it will indeed go hard<br />\nN. HESS' SONS<br />\n• 1920-1921:<br />\nwitli anyone who makes a break<br />\n8 E. Baltimore St.<br />\nJohnston Scholarships—W. N. Brown,<br />\nbefore the inspectors through eviThe Personal 1Vriting Machine<br />\nSanskrit; E. H. Sehrt, Germanic philology; C. V. Taylor, zoology. '<br />\ndent unpreparedness.<br />\nEdmund Law Rogers Fellowships—<br />\nEdith<br />\nA.<br />\nBeck,<br />\nclassical<br />\nphilology;<br />\nC.<br />\nSo light you can hold in<br />\nV. B. Wight, classical philology.<br />\nSecond Team Wins.<br />\nAdam T. Bruce Fellowship—J. F. Edone hand 13:u t.. heavy<br />\nwards, zoology.<br />\nOn Monday, May 3, Baltimore<br />\nDuPont Fellowships—W.<br />\nBahlke,<br />\nenough for the hardest<br />\nStationers Engravers Printers<br />\nchemistry; B. S. Neuhausen, chemistry.<br />\nPoly went down to defeat at the<br />\nCharles<br />\nA. W. Vogeler Fellowship—<br />\nkind of work.<br />\nFountain<br />\nPens I. P. Note Books<br />\nhands of the second 'Varsity tenF. P. Johnson, archaeology.<br />\nGeorge Peabody Scholarship — J.<br />\nteam,<br />\nnis<br />\nhencefort<br />\nh to be known 229 Park Avenue - Baltimor<br />\nLet us prove it here in<br />\nGrape, education.<br />\ne<br />\n• Hopkins' Scholarships (for students<br />\nas the -White Eagles.\" The<br />\nour office.<br />\nfrom the Southern states and Maryland)<br />\nscore was six matches to one and<br />\n—E . H. Barclay, chemistry; A. S.<br />\nBarnes, chemistry; A. B. Brown, chemPoly was outclassed all through<br />\nistry• R. A. Castleman, Jr., physics; M.<br />\nLunches, Cigars,<br />\nM. W. LUCY &amp; CO.<br />\nE. Day,<br />\n'<br />\npsychology; R. N. Dempster,<br />\nthe match.<br />\neducation; F. Diehl, philosophy; J. B.<br />\nAgents<br />\nsummary<br />\nThe<br />\n:<br />\nEby, geology; G. H. Evans, Jr. ecoCigarettes, Candy,<br /><br />\nS<br /><br />\nBACON DRUG STORE<br /><br />\nUALITY SHOP<br /><br />\nWAGNER'S<br /><br />\nHESS SHOES<br /><br />\n..=<br /><br />\nCORONA<br /><br />\nJ. H.SAUMENIG &amp; CO.<br /><br />\n118 W. Fayette St.<br /><br />\n•<br /><br />\nnomics; S. R. Gammon, history;'<br />\nW. B.<br />\nGates, romance; P. F. Gottling, physics;<br />\nT. B. Grave, chemistry; C. M. Hall, Latin; S. J. Hart, political science; L. M.<br />\nLatane, political science; E. M. Lawton,<br />\nEnglish; M. A. Mechanic, economies; R.<br />\nG. Merrick, economics; E. L. Moore,<br />\nzoology; L. H. Naylor, romance; H. Redfield, zoology; J. K. Roberts. geology;<br />\nW. S. Rusk, archaeology: G. E. SChiaVO,<br />\npolitical science; J. D. Sisler, geology;<br />\nS. A. Small, English; G. W. Small, English; E. M. Spieker, geology; C. S. Snydor, history; R. K. Taylor, chemistry;<br />\nH. M. Thompson, chemistry; W. R.<br />\nWest, history; R. J. Whalen, Latin; W.<br />\nK. Wollery, history; J. B. Woosley. history; F. L. Wren, mathematics; W. M.<br />\nYork, history; C. T. Zahn, physics.<br /><br />\nSINGLES.<br />\nBurger (Hopkins) defeated<br />\nNeer<br />\n(Poly), 6-1,<br />\nDorsey (Hopkins) defeated O'Connor<br />\n(Poly), 6-1, 6-3.<br />\nPiekford (Hopkins)' defeated Krug<br />\n(Poly), 6-0. 6-3.<br />\nSmith (Hopkins) defeated Howser<br />\n(Poly). 6-2, 6-4.<br />\nDOUBLES.<br />\nColeman and Guggenheim (Hopkins)<br />\ndefeated Krug and Messersmith (Poly),<br />\n8-6, 6-2.<br />\nKesting and Rowland (Hopkins) defeated Howser and O'Connor (Poly),<br />\n6-3. 1-6, 6-3.<br /><br />\nCotillion Notice.<br />\nA foreign woman went into a<br />\ndrug store., She asked for talcum<br />\n.The last cotillion of the year<br />\npowder.<br />\nwill be held on Saturday, May 15.<br />\n\"Mennen's?\" asked the clerk.<br />\nIt will last from 8.30 to 1'2<br />\n\"No, vimmen's.\"<br />\no'clock. Music will be furnished<br />\nnt it scented?\"<br />\nby Iula's orchestra. Tickets may<br />\n\"N().<br />\nlaid: ay better take it be obtained from any member of<br />\n'it<br />\nthe Cotillion Board.<br /><br />\n(aroy Jailored<br /><br />\nSOFT COLLARS<br /><br />\nSoda, and Toilet<br />\nArticles at the<br />\nBarn<br /><br />\nE. E. ADAMS<br />\nThe Chas, Whims Surgical Instrument Co,<br />\n300 N. Howard St.,<br />\nBaltimore, Md.<br />\nSURGICAL INSTRUMENTS<br /><br />\nHospital, Invalid and Microscopic<br />\nSupplies.<br />\nORTHOPEDIC APPLIANCES.<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards—Invitations<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER — PRINTER — STATIONER<br />\n229 N. Charles Street<br /><br />\nCollars—Dozens of Styles and Other Furnishings<br /><br />\nTHE TORE HUT<br />\nZLEK BRITIE1Z,C<br /><br />\nHoward Street<br />\nNear Saratoga<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MAY 11, 1920.<br /><br />\n12<br /><br />\n40-i:Olf0ifOCIOE011,'Off0ECC:02_1011017.0.g.GEOEIOrg<br />\n710-110':<br />\n10-'<br />\nOrz0IfOrtOr:Or:0:=•01:0:<br /><br />\nBudweiser<br /><br />\nSPRING SUITS FOR YOUNG MEN,<br />\nin patterns and models not to be had elsewhere.<br /><br />\ncrAt<br /><br />\nis with you once again!<br />\nThe famous fiiend of<br />\nold—made by the<br />\noriginal process in conformity with the present<br />\nregulations—on sale<br /><br />\nClothes of Custom Quality<br />\n14 N. CHARLES ST.<br /><br />\n0::0:-1-0 .0:0TIO:'9\"00r___1:0=aorlogOr%00TIOTIOROA0330;a0/101fOi1C):._;.0::0:10:,0-'f'<br />\nCOME TO<br /><br />\nNarttimingtrr tirMilltrrian<br />\nST. PAUL ST. AND NORTH AVE.<br />\n(Cars pass in front of door)<br /><br />\nServices. 11 A. M. and 8 P. M.<br />\nMen's Bible Class. 9.45 A. M.<br /><br />\neverywhere.<br /><br />\nCORDIAL WE LCO M E<br />\nTO ALL STUDENTS<br /><br />\nRev. David Carson Bayless<br />\nMinister<br /><br />\nThe Men of Johns Hopkins University Are Most Cordially Invited to Attend the Services at<br /><br />\n•(!rare<br /><br />\nrapes Episcopal PurrIl<br /><br />\nMONUMENT ST. AND PARK AVE.<br />\nlJ The services on Sunday are at 11 o'clock and 8 o'clock.<br />\nSeats will be reserved for Johns<br />\nHopkins men up to the hour of service. We want to have the privilege of having you associated with us in our worship, and we hope that the benefit may be reciprocal.<br /><br />\nESTABLISHED 1873<br /><br />\nA. H. FETTING MAN'FG JEWELRY CO.<br /><br />\nThe Medical Standard Book Co,<br />\n(THE<br /><br />\nMANUFACTURERS<br /><br />\nBOOK<br /><br />\nMART)<br /><br />\nGREEK LETTER FRATERNITY JEWELRY<br />\n213 N. LIBERTY STREET<br />\nMARYLAND<br />\nBALTIMORE,<br /><br />\nCOMPLETE STOCK MEDICAL BOOKS<br />\nAND COLLEGE REQUISITES<br /><br />\nEstablished 1811<br /><br />\nIMPORTERS AND DEALERS IN<br />\nFINE BOOKS<br /><br />\nIC<br />\n-<br /><br />\nOldest Musical Instrument House In U. S.<br /><br />\nH. R. EISENBRANDT SONS, Inc.<br />\n\"ALL THINGS MUSICAL\"<br />\n417 North Howard Street<br />\n-<br /><br />\nriomm<br /><br />\nafter<br /><br />\n•<br />\nratAa140)<br /><br />\nBALTIMORE, MD.<br />\nBAND AND ORCHESTRA INSTRUMENTS<br />\nVICTROLA SPECIALISTS<br /><br />\nTo the Editor a THE NEWS-LETTER:<br />\n,<br />\n.4.1.4.4611.44,006,47.4../ 1z)<br /><br />\nsin4ear4i-gdfadc,c.<br />\n4.0.4St9<br /><br />\n_<br /><br />\nMAP<br />\nANHEUSER-BUSCH,INC. ST.LOUIS<br /><br />\nTHE NEWS-LETTER'S MAILBAG<br />\n(Continued from /age 5)<br /><br />\nfor the apparent listlessness is<br />\nprobably due more to a lack of<br />\ninterest than to a lack of appreciation, and, in my opinion, if the<br />\nmajority of the fellows were once<br />\ninterested in the thing, there<br />\nwould be no trouble whatever in<br />\nmaking a smashing success of the<br />\nplay. The only thing necessary,<br />\ntherefore, is to interest the fellows in the next production, and<br />\nif it is possible to secure the backing and co-operation of the students and student organizations<br />\nsuccess will be easy.<br />\nHopkins should go into dramatics more seriously, as suggested by J. 0. L., and take its place<br />\nin the creative art life of Maryland in the same way that Harvard University has its Workshop<br />\nTheatre. The stimulating lectures<br /><br />\ngiven before the members of our<br />\ndramatic talent and the Literary<br />\nClub by Florence Lewis Speare,<br />\ntogether with the interest she is<br />\narousing in this city as president<br />\nof the newly organized Drama<br />\nLeague, merely goes to show how<br />\nquickly and earnestly students<br />\nand citizens respond to any serious movement when the right people are connected with it. Johns<br />\nHopkins has a unique opportunity. South of the Mason and Dixon Line no university has established the laboratory theatre.<br />\nThere is abundant histronic talent among the undergraduate students of the University, and with<br />\nthe valuable training that Miss<br />\nWalter gives us, Johns Hopkins<br />\nought to take a prominent place<br />\nin the student dramatics of the<br />\nEast. With the backing of the<br />\nstudents, this will be easy 'of accomplishment. Think it over, felJ. 0. Ti.,<br />\nlows!<br /><br />\nSir—.l wish to call your attention to a small matter in regard<br />\nto the use of the tennis courts,<br />\nwhich I have frequently observed<br />\nduring the last two weeks. A<br />\ngreat deal of interest has been<br />\nshown in this game recently and,<br />\nconsequently, the courts have<br />\nbeen in great demand. Now, it<br />\nis only fair that all those who<br />\ndesire to play should have a fair<br />\nchance, and this is absolutely impossible when four of five men<br />\nget possession of the courts and<br />\nhold them about four hours at<br />\na time.<br />\nThe other day I noticed two<br />\nfellows who started at 9 o'clock<br />\nin the morning and whom I saw<br />\non the same court every one of<br />\nthe eight times I passed throughout the day. These men played<br />\nat least three hours in the morning and four in the afternoon,<br />\nand then repeatedly refused to<br />\n-double up\" with anyone.<br />\nNearly all clubs possessing<br />\ntennis courts have a written or<br />\nunwritten rule that only the best<br />\ntwo out of three sets may be<br />\nplayed when others are waiting<br />\nto use the courts. I understand<br />\nthat such a rule was formerly<br />\nobserved on our courts, but if it<br />\nis so, it has certainly been forgotten or disregarded by a number<br />\nof students,<br />\nAN<br /><br />\nOBSERVER.<br /><br />\n301<br /><br />\nN. CHARLES STREET<br />\nBaltimore, Md.<br /><br />\nThe<br />\nNorman Remington Co,<br /><br />\nBOOKS<br /><br />\nYou're Interested In<br />\nEvery Student Should Own<br /><br />\nSend Your Name for Monthly List<br />\nCharles Street, at Mulberry<br /><br />\nJ. H. FURST CO.<br />\n23 S. HANOVER ST.<br />\nBALTIMORE, MD.<br /><br />\nPrinters of Philological and<br />\nScientific Works<br />\nAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nof America, \"Johns Hopkins University Circulars,\"\"Modern Language Notes,\"\"Maryland Historical Magazine,\" University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nsimilar character. Special attention given to the<br />\nprinting of<br /><br />\nDOCTORS' DISSERTATIONS<br />\nin Greek, Latin, Anglo-Saxon, Old English, and<br />\nRomance and Germanic Languages.<br /><br />\nWyman's<br /><br />\nThe Largest &amp;<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br /><br />\nMen's<br />\nShoes<br /><br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br /><br />\n19 Lexington St.<br /><br />\nSole Agent for<br />\nthe Johnston Sr<br />\nMurphy Shoes.<br /><br />\n1.<br /><br />"}], "field_media_file": [{"target_id": 37463, "display": null, "description": null, "target_type": "file", "target_uuid": "21d330cc-c65e-4f22-829b-6c5d7f18d74d", "url": "http://digital.library.jhu.edu/system/files/2022-03/12921-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12921, "target_type": "node", "target_uuid": "839e4707-6771-4bf0-8467-241448491687", "url": "/node/12921"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "70346d98-9357-4214-bf6b-d2907b63e1dc"}]}