{"mid": [{"value": 36961}], "uuid": [{"value": "fa70f753-4e37-431c-a59a-cb468c6dc0d2"}], "vid": [{"value": 36961}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13094-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:01+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MEMIL<br />\n<br />\nTS<br />\n<br />\n;A<br />\n<br />\nVOL. XXVIII, No 43<br />\nENGINEERING STUDENTS<br />\nLEARN OF IMPORTANCE<br />\nOF PORTLAND CEMENT<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 21, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nDR. LITZ TO GO TO BALTI- FEMALE PARTS IN \"THE GAL- FORTY CANDIDATES RE- CABINET OFFICERS FOR Y. M.<br />\nC. A. ANNOUNCED AT<br />\nLOPER\" HOTLY CONPORT FOR BASEBALL<br />\nMORE CITY COLLEGE AS<br />\nFRIENDS HOUSE<br />\nTESTED<br />\nPRACTICE<br />\nA MEMBER OF FACULTY<br />\n<br />\nMr. Moore, Secretary of the Friends<br />\nRichard K. Meade Begins Series of Received Degree of Doctor of Philoso- Parts of \"Sybil Schwartz,\" \"Grace Coach Brockman Pleased at Turn-out.<br />\nMeeting House, Makes Short<br />\nProspects Bright for Pitchers<br />\nphy at Johns Hopkins in 1921<br />\nLectures on \"Engineering<br />\nWhitney\" and \"Blanche Bailey\"<br />\nAddress<br />\nPractice\"<br />\nStill Tentative.<br />\n<br />\nAbout 40 baseball candidates reDr. Francis A. Litz of the EngA meeting of cabinet officers<br />\nThe tremendous importance o<br />\nbeing<br />\nnow<br />\nare<br />\nFinal<br />\ntryouts<br />\nsponded Monday to the first call and<br />\nish Department has been appointothers interested in \"Y\" work<br />\nPortland cement was explained by<br />\ned to a position on the faculty of held by the Barnstormers for the issued by Coach Brockman. Led on the<br />\ncampus, was held at the<br />\nRichard K. Meade, a prominent<br />\nimportant part of \"Blanche Bai- by Captain Ben Thomas, the men<br />\nthe Baltimore City College.<br />\nFriends<br />\nMeeting House Monday,<br />\nchemical and industrial engineer<br />\nDr. Litz was educated at St. ley\" in \"The Galloper,\" to be given had a fast workout consisting of March 17. Formal<br />\ninstallation of<br />\nof Baltimore, when he addressed<br />\nCharles' College. While a student at the Lyric by the club on March throwing and batting, while late officers for the coming year took<br />\nan audience of engineering upperin the afternoon, the new coach place, and cabinet<br />\nat this institution he frequently 28 and 29.<br />\nmembers and<br />\nclassmen last Monday, March 17,<br />\nThe fight has narrowed down to had a short infield practice. With<br />\ncame into contact with John Banassistants<br />\nwere<br />\nMr.<br />\nannounced.<br />\nin the auditorium of the Mechaninister Tabb, for whom he acquired two candidates who are working plenty of material on hand, Coach Moore, Secretary of the Friends<br />\ncal Engineering Building. The leca sincere admiration, and with hard for the role, which is proba- Brockman hopes to produce the Meeting House, who has been in<br />\n\"The<br />\ntitle,<br />\nits<br />\nas<br />\nhad<br />\nture, which<br />\nwhom he formed an unending bly next to the \"female lead\" in best team in recent years. Pros- close contact with the campus life<br />\nManufacture of Portland Cement,\"<br />\nfriendship. This acquaintance con- importance. They are Leslie pects for pitchers—our usual han- for the past several years, conwas the first of a series of adSchwinn and Douglas Frantz,<br />\ndicap—however, are especially ducted the ceremony. In a brief<br />\ntinued until the death of Father<br />\nboth freshmen. Announcement of<br />\ndresses on \"Erigineering PracTabb in 1909. In this year Dr. the choice<br />\nbright; for, in Winkenwerder, a address given at the close of the<br />\nwill be made in the<br />\ntice,\" during which several wellLitz went to St. Mary's College, near future.<br />\nmedical student, Hopkins pos- dinner, Mr. Moore stated that notknown engineers will be brought<br />\nsesses one of the best twirlers in withstanding the excellent beginwhere he completed his underSlatkin Favored<br />\nto Johns Hopkins to speak before<br />\ngraduate course, receiving the dePresent opinion favors Morti- collegiate ranks, while Marrian, nings made in past years, the start<br />\nthe engineering undergraduates.<br />\ngree of Bachelor of Arts. After mer Slatkin for the female lead, Schacht and McNeil will complete this year is most encouraging and<br />\nThe history of the development<br />\ntwo years of graduate work at the which is \"Grace Whitney.\" This a fine staff from which to select. bids fair to be a banner year in<br />\nof cement from the relatively<br />\npart was hotly contested for, and<br />\nsame college he received his deThere will be much competition the annals of the Y. M. C. A. on<br />\neven now there is no small uncercrude form used by the ancient<br />\ngree of Master of Arts. During tainty<br />\nregarding it. Mr. Slatkin for the infield, a large number of the Hopkins campus.<br />\nEgyptians and Romans was briefIn a short talk given by Mr.<br />\nthe several years that followed, is now almost assured of the role candidates having their eyes on<br />\nly outlined by the speaker. The<br />\nKarl<br />\nMiller, the new president, the<br />\nEgyptians found that by calciming Dr. Litz devoted the major part of if he is successful in surviving the the positions left vacant by gradutwo<br />\noutstanding features of the<br />\ngypsum they would obtain as a his time to the study of English voice tryouts, which will be held ation. Captain Thomas will probremaining<br />\nsemester were outresultant product plaster of Paris. Literature and Composition at the at the Lyric next Tuesday during ably be seen at second again, with<br />\nthe<br />\nlined,<br />\nSilver<br />\nBay Conference<br />\nThis material was used as a ce- Johns Hopkins University, receiv- lunch hour. Every candidate for Bonner, Boswell, and Gwinn as and the<br />\nretreats,<br />\nor<br />\nundergraduate<br />\nment when they constructed the ing a Fellowship. Upon comple- the cast is expected to attend these<br />\nconferences.<br />\nfirst<br />\nThe<br />\nbase<br />\nsubstitutes.<br />\ncapable<br />\ntryouts.<br />\nPyramids. Similarly, during the tion of this work, which served as<br />\nAs usual Hopkins will be well<br />\nAnother call has been issued by position is receiving strong bids<br />\nsame period, the Romans mixed a suitable foundation for future rerepresented<br />\nat the annual Silver<br />\nlime with volcanic ash and ob- search in English Literature, he the club for 15 or 20 extras. The from Gilpin and O'Connor, both Bay Conference. The delegation<br />\ntained a cement which could be was granted an appointment to extras will be used for the mob discovered in the interfraternity will be headed this year by Mauused hydraulically, that is, one the faculty of the University of scene, soldiers and other minor and interclass games. At short- rice Skinner; anyone interested or<br />\nTexas, where he fulfilled his duties parts. All who are interested<br />\nwhich will set under water.<br />\nstop, Keen and Wasserman will desiring to go as a delegate should<br />\nas teacher of English until 1920. should be on hand at the first reand<br />\nslides<br />\nprofuse<br />\nBy means of<br />\nfight it out with Crawford, the get in touch with him.<br />\ndiagrams the modern method of However, in this year he returned hearsal for extras, which will be<br />\nbrilliant infielder from Tome. The first of the undergraduate<br />\nmanufacturing Portland cement to Baltimore and began to teach held at the Barn tonight. All exbase is also receiving atten- conferences is to be held on April<br />\nThird<br />\nwas explained by the engineer. English in this university, where tras will be required to attend four<br />\na number of candidates 12 at Camp Conoy on the South<br />\nfrom<br />\ntion<br />\nThe methods of crushing the raw he has remained until the present other rehearsals.<br />\nCalhoun, and Jacobs River. The men will leave for<br />\nAshton,<br />\nwith<br />\nDress Rehearsal Thursday<br />\nmaterial in the modern industrial time. In 1921 he received the decamp on Saturday at noon returnform.<br />\ngood<br />\nshowing<br />\nThe final dress rehearsal will bt<br />\nplant were first shown. Follow- gree of Doctor of Philosophy, and<br />\ning<br />\nlate Sunday afternoon. This<br />\nSchacht and Marrian will form<br />\ning this, in order, occur the dry- was also elected to the Phi Beta held at the Lyric on Thursday arwill<br />\ngive them ample time to get<br />\nthe outfield, and<br />\ning, grinding, proportioning, and Kappa with an unusually high av- ternoon, beginning at 1 o'clock. It a nucleus for<br />\nacquainted,<br />\nand to form closer<br />\n\"Dutch\" Holland, the hard-hitting<br />\nfinally, the pulverizing of these erage. As a requirement for the will continue throughout the afterfriendships<br />\nwhich<br />\nshould engendegree of Ph. D., Dr. Litz wrote noon, and the evening if neces- catcher of last year, will again do<br />\nmaterials.<br />\nder<br />\nco-operation.<br />\nreceiving, although Day, AsenCrushing of the hard materials a thesis on the life and works of sary, until Mr. Swindell, the the<br />\nThe cabinet members are as folCook, and Oates are furnishdorf,<br />\nis largely done in gyratory crush- John B. Tabb, which was later coach, is satisfied with the perforlows:<br />\nCoach<br />\ncompetition.<br />\ners, although a few plants pass, published under the title of \"Fa- mance of the club. The costumes, ing close<br />\nMembership—Baldwin.<br />\nfact<br />\nthe<br />\nemphasized<br />\nBrockman<br />\nmaterial from the quarry through ther Tabb.\" Dr. Litz is prominent which are being made by Jones,<br />\nFinance—McKay.<br />\nin literary circles, being a mem- will be available for use on Mon- that no positions are filled, but<br />\ntoothed rolls.<br />\nPublicity—Grafflin.<br />\nthat hard work by every man on<br />\nThe next important step in the ber of the Kottabas Club and also day afternoon.<br />\nChurch Co-operation—Trout.<br />\nthe best<br />\nIt was recently announced by the squad will develop<br />\npreparation of the raw materials is secretary of the Modern Language<br />\nNew Students—Harp.<br />\nproduced.<br />\nthe properties staff that the set- team Hopkins has ever<br />\nthe burning. This is followed by Association of America.<br />\nSocial Service—Hunter.<br />\nDr. Litz assumes his new duties tings for the entire play are practithe cooling of the clinker, adulterSpeakers Bureau—Bull.<br />\nSIGMA CHI BETA HOLDS<br />\ncally completed.<br />\nation to retard set, and the reduc- immediately.<br />\nVocational Guidance—Pease.<br />\nMEETING AT HOPKINS<br />\ntion of this clinker to an impalpaPlay Rounding Into Shape<br />\nFriendly Relations—Chambers.<br />\nCLUB<br />\nble powder. Having gone through BALTIMORE SUN OFFICES TO<br />\nReligious Education—Wales.<br />\nMr. Swindell has frequently<br />\nPUBBY<br />\nINSPECTED<br />\nBE<br />\nteams<br />\nvisiting<br />\nof<br />\nThe<br />\nreception<br />\nthese processes, it only remains to<br />\nConferences and Conventions—<br />\nvoiced his satisfaction regarding<br />\nLICITY BOARD<br />\nseason the cement, and to bag it.<br />\nthe manner in which the play has was discussed at a Sigma Chi Thomsen.<br />\nA trip will be made through the been recently rounding into shape, Beta meeting held at the HopReading Room—Asendorf.<br />\n\"If all the cement and concrete<br />\noffice<br />\nMr.<br />\nof the Baltimore Sunpapers although the illness of Tom Jen- kins Club after a dinner given<br />\ndeclared<br />\nThe men who have just commade in the world,\"<br />\nMeade,\"was made into a concrete at 2.30 o'clock today by the Pub- ifer, who is portraying one of the last Monday. Plans were organ- pleted a very successful term as<br />\npavement 24 feet wide, it would licity Board members under the principal female parts, has some- ized for entertaining the members Y. M. C. A. officers' are Reese<br />\nstretch entirely around the world direction of Henry Edward War- what slowed up rehearsals in the of visiting athletic teams, and a Marsh, president; Paul Sylvester,<br />\nRandolph<br />\nat the equator.\" The lecture was ner, promotion manager of the last two weeks. He has been con- committee headed by Mr. Kenne- vice-president; and<br />\nconcluded with the striking state- Sun. Members of the News-Letter fined to his bed with an infected dy reported the scheme of recogni- Norwood, treasurer. Karl Miller,<br />\nment that every day a train 10 staff are also requested to make throat, and although it was report- tion that had been made for the the new president, was secretary<br />\ned that he was able to walk about members of the visiting teams. of the association during the past<br />\nmiles long, filled with cement, the trip.<br />\nThe tour will include inspection a little last Monday, he is not ex- They also explained that each man term.<br />\ngoes out of the mills of this counand instruction in the publishing pected to be able to attend rehear- of a visiting team is to wear a tag<br />\nThe next fellowship dinner will<br />\ntry.<br />\nof a newspaper, with particular sals until next week, a short rest which will admit hirn to the be held on April 1 at the meeting<br />\nIDES OF MARCH DANCE emphasis on handling newspaper being necessary for his complete dances or whatever other enter- house. Dr. P. C. Chan, one of the<br />\nGIVEN BY CANE CLUB AT copy, which is of vital interest to recuperation. Meanwhile the part tainment that may be held at that popular speakers at the Hood Colmembers of the Publicity Board of Sybil Swartz, the heiress, is be- time, and that each member of lege Conference, and graduate of<br />\nCHIMNEY CORNER<br />\nNews-Letter who are writing ing read by young hopefuls.<br />\nand<br />\nSigma Chi Beta is to wear another the George Washington Medical<br />\nLast Saturday evening, on the<br />\nnews.<br />\nof tag so that the visiting School, will be the speaker of the<br />\ntype<br />\nIdes of March, the Cane Club held<br />\nknow to whom to go in evening.<br />\nwill<br />\nmen<br />\nThose who will go should be in<br />\none of its dances at the Chimney<br />\nobtain any information.<br />\nto<br />\norder<br />\nDr. Chan, who has been in this<br />\nCorner. The club realized the lack the lobby of the Sun Building by<br />\nRichmond<br />\nDebate<br />\ncalled<br />\nreception<br />\nthat<br />\nresolved<br />\nIt<br />\nfor nine years, and is now<br />\nwas<br />\nmen<br />\ncountry<br />\nBoard<br />\nPublicity<br />\ntoday.<br />\n2.15<br />\nof<br />\ntime<br />\nthis<br />\nat<br />\nof social functions<br />\noff. Through misunderappointed, doing interne work at George<br />\nbe<br />\nshould<br />\ncommittees<br />\nis<br />\nexcuse<br />\ngood<br />\na<br />\nunless<br />\ngo<br />\nmust<br />\na<br />\nhave<br />\nto<br />\ndecided<br />\nthe year and so<br />\nstanding both sides prepared<br />\nof<br />\neach to have a term of two weeks. Washington, will deliver somegala occasion at that time. The given. R. C. Tilghman, editor<br />\nnegative. Will be held<br />\nthe<br />\nThe season ticket campaign was thing of a farewell speech since<br />\nas<br />\nthat<br />\nrequests<br />\ner,<br />\nNews-Lett<br />\nthe<br />\nlarge<br />\na<br />\nparty was attended by<br />\nin the near future.<br />\nheartily endorsed and every he is returning to China at the<br />\nNews-Letalso<br />\nthe<br />\nof<br />\nmembers<br />\nmany<br />\n,<br />\npres<br />\nnumber of alumni; everyone<br />\nend of this year.<br />\naid was urged.<br />\npossible<br />\npossible.<br />\nas<br />\nattend<br />\nstaff<br />\nter<br />\non page 4, co/. 3.<br />\nContinued<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 21, 1924<br />\n<br />\nENGINEERING PROBLEMS TO<br />\nLIBERTY ST.<br />\nBE DISCUSSED IN LECTURE SERIES<br />\nAT SARATOGA<br />\nFOUNDED 1897<br />\nThe annual series of lectures on<br />\nLUNCHEON<br />\n\"Engineering Practice,\" comprisSubscription<br />\n$2.00<br />\nTEA<br />\ning four addresses, will be held<br />\nDINNER<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at weekly this year during the period<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nfrom Monday, March 17, to MonSPECIAL PARTIES<br />\n11.30 A. M.<br />\nday,<br />\nApril 7. One lecture in each<br />\nsemi-weekly<br />\nPublished<br />\nfrom October to June by the students of Johns<br />\nuntil<br />\nOf course you know that<br />\nHopkins University.<br />\nPLAZA 6987<br />\nof the general fields of Civil, Gas, 7.30 P. M<br />\nThe Barn is handling orders<br />\nElectrical<br />\nand<br />\nMechanical<br />\nEngifor<br />\nour clothes again this<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications neering, will be given by engineers<br />\nyear.<br />\nshould be sent to the MANAGING EDITOR.<br />\nprominent in their respective fields.<br />\nThe plan worked to<br />\nThe course of lectures, which is<br />\nmutual advantage last seaTelephone<br />\nHomewood 100 given annually, is one feature of<br />\na<br />\nson, and we're mighty glad<br />\ngeneral plan for furthering underto continue the relationEditor-in-Chief<br />\nBusiness Manager<br />\ngraduate<br />\ninstruction<br />\nin<br />\nthe<br />\nmethship.<br />\nRICHARD C. TILGHMAN, '25<br />\nPHILIP W. HOWARD, '25<br />\nCLOTHIERS<br />\nods and problems of the practice<br />\nReady-to-wear Suits<br />\n$30 up<br />\nManaging Editor<br />\nof engineering. Accordingly, the<br />\nAdvertising Mana per<br />\nHABERDASHERS<br />\nReady-to-wear O'Coats . $35 up<br />\nAUGER G. Hiss, '26<br />\nA. J. McKAY,'26<br />\nlectures deal with the practical<br />\nAssistant Managing Editor<br />\nphases of engineering problems.<br />\n211-213 E. Baltimore St.<br />\nCirculation Manager<br />\n315 Charles St. North<br />\nERNEST A. STRATHMAN, '26<br />\nWorking<br />\nmethods<br />\nof<br />\nengineering<br />\nOTHO J. KELLER, III, '26<br />\nAssociate Editors<br />\ndesign, operation, and construction<br />\nTA'EfOr<br />\nJOHN W. PARSONS, '25<br />\nAssistant Business Managers<br />\ndiscussed.<br />\nare<br />\nBENJAMIN T. ROME, '25<br />\nD. MILES MARRIAN,'25<br />\n•<br />\nPlanned primarily' for underJunior Editors<br />\nG. DONALD GIESKE,'25<br />\ngraduates, the lectures presuppose<br />\nARTHUR L. NELSON, '26<br />\nJOHN T. DIXON, '24<br />\nEDWARD 0. MICHEL, '26<br />\nan<br />\nelementary rather than an intenC. EUGE.NE TOVELL,'24<br />\nJAMES YOUNG, '25<br />\nsive<br />\ntheoretical knowledge, and parJ. JACKSON KIDD, '26<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\nticular<br />\nSTRAN<br />\nT.<br />\nSUMMERS, '25<br />\nstress will be laid on the<br />\nA. RISLEY ENSOR, '26<br />\nHEYWARD E. BOYCE, JR., '27<br />\nmore important features and principles of practical engineering of<br />\nMember Southern Intercollegiate Newspaper Association<br />\nthe present day.<br />\nThe lectures are an integral part<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nof the engineering course for junMd.<br />\niors and seniors. However, they<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 21, 1924<br />\nwill be open to the general public,<br />\nand tickets of admission are not required.<br />\nThe addresses are as follows:<br />\nSPRING COMPETITION<br />\nMonday, March 17, \"The ManuA journalist need not necessarily be a literary genius. Success<br />\nfacture of Portland Cement,\" by<br />\nin one field of writing does not imply success in another. Robert<br />\nMr. Richard K. Meade, Chemical<br />\nLouis Stevenson, early in life, adventured into news reporting but<br />\nand Industrial Engineer, Baltimore,<br />\nafter three weeks of this work was dismissed as incapable. ThackMd.<br />\neray underwent the same experience.<br />\nMonday, March 24—Supplying<br />\nAs far as we are aware, the Hopkins undergraduate body can Gas to Baltimore. Mr. H. R. Cook,<br />\nboast of no possible Stevensons or Thackerays. We feel, however, Jr., General Superintendent, Gas<br />\ntyle: \"Distinctive or characterthat there are a large number of men who, with experience, would Operating Division, Consolidated<br />\nistic mode\" (Webster). Might<br />\ndevelop into finished college journalists. Writing for a newspaper Gas Electric Light and Power<br />\nrequires no flowery style, no learned or extraordinary vocabulary. Company, Baltimore, Md.<br />\nbe shortened to \"Stetson\" in<br />\nIt necessitates only clear, accurate expression,\"a nose for news,\" and<br />\nMonday, March 31. The Engispeaking of hats.<br />\na desire to work.<br />\nneer in a Large Railroad OrganiExperience on a college paper is not without compensation. It zation. Mr. Earl Stimson, Chief<br />\nenables one to form intimate associations with campus leaders and Engineer, Maintenance, Baltimore<br />\nto view college problems from all angles. Above all, it helps one to and Ohio Railroad, Baltimore, Md.<br />\nMonday, April 7—The High<br />\nsalvage definite ideas from a conglomerate mass of facts. Men who<br />\nhave spent four years in college journalism have said they would not Tension Cable Problem. Mr. Wm.<br />\nsubstitute any three courses for the experience gained.<br />\nA. Del Mar, Chief Engineer, Habirshaw<br />\nElectric Cable Company,<br />\nThree periods of competition for candidates for the News-Letter<br />\nYonkers,<br />\nNew York.<br />\nare provided in its constitution. The spring competition starts with<br />\nthis issue and ends May 25. An opportunity is here offered candidates<br />\nto be selected to the staff before the close of the year. Candidates<br />\nare requested to report for assignments at the News-Letter office on<br />\nTuesdays and Fridays.<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nPayne &Merrill<br />\n<br />\nS<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n<br />\nAPPRECIATION!<br />\nWith this issue the 1924-25 Board assumes control of the NewsLetter. It takes up its tasks with a feeling of appreciation of the<br />\nuntiring efforts and perseverance of the outgoing staff. Under<br />\nthe<br />\nguidance of its members the paper has prospered and has been<br />\nled<br />\nthrough a banner year.<br />\nDuring the administration of the old editors many important<br />\nchanges have taken place on the Hopkins campus. Our \"Fairy<br />\nGodmother\" has been unusually kind to us by erecting a dormitory<br />\nand<br />\na new chemical laboratory. Athletic and non-athletic activities<br />\nhave<br />\nshown improvement under efficient management. Our teams—foot<br />\nball, lacrosse, swimming, track--have become famous and bear enviable reputations. Two possible candidates for the Olympic<br />\nGames<br />\nhave been developed. The Barnstormers have been ushered in and<br />\nhave paved the way for a probable all-Hopkins production. The<br />\nprestige of the Musical Club has increased.- On the whole campus<br />\nactivities have progressed and have been constantly brought<br />\nbefore<br />\nthe public eye. Many campus changes can be attributed directly<br />\nor<br />\nindirectly to suggestions and criticisms from the editorial column<br />\nof the News-Letter.<br />\nWe, the incoming board, are attempting to carry on the work<br />\nstarted by our predecessors. Our aim is to give a \"newsier\"<br />\nand<br />\nbetter paper. We endeavor to reflect, impartially, as best we<br />\ncan,<br />\nthe correct undergraduate sentiment. If criticism and<br />\ndiscussion<br />\nresult, we accomplish our purpose to stimulate thought.<br />\nThe News-Letter is proud of its twenty-seven years of<br />\nservice.<br />\nIt is more interested, however, in the years of the future. It is<br />\nwith<br />\nthis interest and a sincere hope for progress that the new board<br />\nof<br />\neditors assumes its duties.<br />\n<br />\n—all the difference<br />\nbetween just an ordinary cigarette<br />\nand — FATIMA,the most skillful<br />\nblend in cigarette history.<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS LETTER, MARCH 21, 1924<br />\n<br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nBE A NEWSPAPER CORRESPONDENT<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nNEWSWRITERS TRAINING BUREAU<br />\nBuffalo, N. Y.<br />\n<br />\nHub<br />\n<br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br />\n<br />\nBaltimore's Great Men's Store<br />\n<br />\nNicholas Brown, Mgr.<br />\n<br />\nA Hess Shoe \"Goes to Hopkins\"<br />\nHere's a shoe that's a pippin—get Buck Bonner, at the Barn, to show it to you. Black and<br />\ntan Russia; broad college toe; good lines; a<br />\n-quality- look—and comfortable? Say!<br />\nSets you back just $8.50—reasonable enough.<br />\n<br />\nN. HESS' SONS<br />\n8 E. BALTIMORE STREET<br />\n<br />\n—Photo by 13achrach-<br />\n<br />\nThomas M. Jenifer, as the \"angel-faced Sybil\" in the<br />\nBarnstormers' farce.<br />\nDEBATE ANNOUNCED BETWEEN HOPKINS AND U.<br />\nOF RICHMOND<br />\nA debate on March 25 between<br />\nHopkins and the University of<br />\nRichmond was recently announced<br />\n<br />\nby the Debating Council. The following subject has been chosen:<br />\n\"Resolved, That the United States<br />\nshould enter the World Court.\"<br />\nThe Hopkins debaters will take<br />\nthe affirmative side of the argument.<br />\n<br />\nThe Hopkins team will consist<br />\nof<br />\nWilliam Gross, Owens Rea and<br />\nBIDDERS<br />\nPRMTERS<br />\nEllgRAVERS<br />\nElmer Mylander, alternate. The<br />\nvisitors have not yet announced<br />\ntheir team.<br />\nCollele Literature<br />\nThe choice of a Tuesday night<br />\nfor the debate will mark an innovation in Hopkins debating. The<br />\nreason given for this action is the<br />\ndrive on the part of the Debating<br />\nCouncil to get larger audiences at<br />\nthe debates. It is felt that a larger<br />\nattendance can be expected on<br />\nevenings when there is no other<br />\nimportant social event in progress.<br />\nAs an added attraction, an informal dance will immediately follow<br />\nthe debate, which will be held in<br />\nthe C. E. Hall.<br />\n<br />\nAnother call for<br />\ncandidates<br />\n<br />\nALWAYS USE A<br />\n<br />\nPrinters of<br />\n<br />\ncThe Johns Hopkins<br />\nNEWS,LETTER.<br />\n<br />\nYELLOW CAB<br />\nOR PHONE<br />\n<br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br />\n<br />\nLOMBARD and SOUTH STREETS<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\nPRESCRIPTION DRUGGISTS<br />\n:TWO ISTORES1<br />\n<br />\nCharles and Chase Sts.<br />\n<br />\nEutaw Place and North Ave.<br />\n<br />\nVernon 0890<br />\n<br />\nMadison 0405<br />\n<br />\nf?<br />\n5<br />\n:<br />\nG. 1<br />\ner<br />\nH.<br />\nsX<br />\ne<br />\n0Amt<br />\n)<br />\n111<br />\nas<br />\nOSCARi<br />\nR6 eipbo<br />\n.ml emi4<br />\nzito OWNE<br />\n29 E. BALTIMORE ST.<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br />\n<br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br />\n<br />\nIn this season of try-outs, seniors will do well<br />\nto respond to the call for candidates which progressive business organizations are making.<br />\nThe visit of the various company representatives<br />\noffers a mutual opportunity. It puts you in position to judge whether a particular company offers<br />\nsufficient scope to your ability and ambition.<br />\nThe representative can judge, after conversing<br />\nwith you and studying your record, whether you<br />\nwould be well placed in his company.<br />\nDo not ignore the invitation to these interviews.<br />\nDo not be one of those—and they are many—<br />\nwho next Fall will write to the larger companies,<br />\n\"At the time your representative visited my<br />\ncollege I did not think that I was interested in the<br />\nwork of your company and so did not meet him\".<br />\nMen who are earnest in wanting to make the<br />\nteam usually respond to first call<br />\n<br />\ngtrn Electric a<br />\nSince 1869 makers and distributors ofelectrical equipment<br />\n<br />\nNumber 37 of a series<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 21, 1924<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\n<br />\nSOPHISTICATED<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from\"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br />\n<br />\nVaseline<br />\nHAIR TONIC<br />\nChesebrough idlfg.Co<br />\n(consolidated)<br />\n,<br />\n<br />\n. • ..44<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\n<br />\nBLACK AND BLUE JAY COPY DUE<br />\nTODAY<br />\n<br />\nCopy for the next number of<br />\nthe \"Black and Blue Jay\" will be<br />\ndue Friday, March 21, it was anManufactured by<br />\nnounced at a staff meeting last<br />\nWIGHT & HUMPHRIES<br />\nThursday. The number will be<br />\ncalled the \"Caveman Number,\"<br />\nEstablished 1873<br />\nand copy pertaining to the title<br />\nA. H. FETTING MAN'FG<br />\nwill be especially welcome. ConJEWELRY CO.<br />\nManufacturers<br />\ntributions are wanted for both the<br />\nGreek Letter Fraternity Jewelry<br />\nart and editorial departments.<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nEditor-in-Chief Dunning has<br />\npointed out that the recent additions to the art and editorial staffs<br />\nwill lighten the work considerIs Taking the Country by Storm<br />\nably;<br />\nand, with more material to<br />\nA complete set in bright<br />\ncolors. 144 tiles. 116 countchoose from, a better brand of huers, 8 racks. 2 dice, book of<br />\nrules and instructions: any<br />\none can learn the game in<br />\nmor is expected. The Caveman<br />\nten minutes. All in attractive box, sent prepaid on<br />\nNumber<br />\nwill be the last issue put<br />\nreceipt of $1.00 (Canada<br />\n25c extra).<br />\nout under the direction of the<br />\npresent bbard of control. ConseVery Attractive Black Satquently,<br />\nevery effort will be made<br />\neen Mah-Jong Table Cover,<br />\nwith colored dragon deto<br />\nmake<br />\nthe<br />\nnumber the best pubsigns, adjustable to any<br />\nsize card table: 16 counter<br />\nlished<br />\nthis<br />\nyear.<br />\nPockets. striking colored<br />\nstitched edges. ExtraorShortly after copy is turned in<br />\ndinary value. Special price<br />\nfor the next number, and probably<br />\nCOMBINATION OFFER: We will<br />\nsend prepaid one complete Mahbefore the issue comes from the<br />\njong set and table cover as depress, the \"Black and Blue Jay\"<br />\nscribed above on receipt of $2.50.<br />\nstaff<br />\nwill hold its annual dinner,<br />\nCHINA-AMERICAN IMPORTING<br />\nCOMPANY<br />\nat which a new board of control<br />\n111 West 68th St.<br />\nNew York<br />\n\\vill be elected.<br />\n<br />\n-i<br />\n<br />\n'Yes, it does cost more to make VELVET<br />\nTobacco and for this reason—<br />\nIt's tile best Kentucky Burley tobacco<br />\nmoney can buy and then it's aged in wood.<br />\nAll harshness and bitterness are removed.<br />\nIt's mild and mellow. You will readily<br />\nnotice the difference.<br />\n<br />\nMah-Jong<br />\n<br />\n1<br />\n<br />\nTable Covers<br />\n<br />\nCAMPUS CLUB MEETS<br />\nTwenty-three campus lights,<br />\n\"Queen Quality\" Home-made<br />\nthe<br />\nCampus Club, gathered to414I4lq+11:4,4014R44.14leq41.1411I4 FPIEOPIFIteTAik,4:.<br />\nChocolates<br />\nIce Cream<br />\nIces<br />\nLuncheonette gether in the Dormitory Monday<br />\n227 N. Howard 518 N. Charles night. They held a smoker and<br />\nDancing Every Afternoon at<br />\nthere was plenty of smoke. Cigars<br />\nCharles St.<br />\nand cigarettes were in abundance,<br />\nnot to speak of Prince Wales' private pipe mixture.<br />\nEntertainment was furnished by<br />\n\"The King of Lubricants\"<br />\ndivers members of the club; some<br />\noffered music, but the hits of the<br />\nSHERWOOD BROTHERS, INC.<br />\nevening were impersonations of<br />\nseveral<br />\nHopkins celebrities, stuORMININEXffigNEINEMNIEffnagl<br />\ndents and others. Naturally everyone enjoyed the chicken salad and<br />\nA. JACOBS & SONS<br />\nice cream served at 10 o'clock. By<br />\nTailors<br />\nthe way, the club adjourned at<br />\nUniforms and Liveries<br />\n10.30—quite decent of them.<br />\nA business meeting was held<br />\n128 W. FAYETTE ST.<br />\nNear Liberty St.<br />\nBaltimore, Md.<br />\nafter the party. Various members<br />\ninterviewed could not be persuaded to divulge any of the business<br />\n(Something new in portable<br />\ntransacted.<br />\ntypewriters.<br />\n<br />\nORTMAN<br />\n<br />\nBEK<br />\nci<br />\nma-son ono<br />\n<br />\nLIGGETT & MYERS TOI3ACCO CO.<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD.KOHN &CO.<br />\n<br />\nMount Vernon Place M.E.Church<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nPROGRAM FOR STUDENTS<br />\nBIBLE CLASS, 10 A. M.<br />\nAn Interesting Discussion of<br />\nVital Topics Under<br />\nDR. HOWARD A. KELLY, Leader<br />\n<br />\n\"XC\"<br />\nCORONA<br />\n<br />\nYOUNG PEOPLES AT-HOME<br />\n5-7 P. M.<br />\nTEA SERVED AT 6 O'CLOCK<br />\n<br />\nEPWOR1H LEAGUE<br />\n<br />\nHave you<br />\nseen it?<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br />\n<br />\nClt writes nearly all languages.<br />\n41Has 90 characters.<br />\nSee Fred Rich, College<br />\nRepresentative<br />\n118 W. FAYETTE ST.<br />\nBALTIMORE, MD.<br />\n<br />\n• DROVERS &MECHANICS<br />\nNATIONAL BANK<br />\nearner c.. ciyetie and nztaw 81s.<br />\n-Where Wholesale and Retail Districts Meet\"<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nCANE CLUB DANCE<br />\nContinued from page 1<br />\n<br />\nent proclaimed it the best dance<br />\never.<br />\nSometime ago W. Gardner<br />\nPackard succeeded J. S. V. B.<br />\nShriver as president of the club.<br />\nIn the near future the Cane Club<br />\nwill hold a supper at which time<br />\nDRAPERIES elections will take place and the<br />\ntraditional tapping will come with<br />\nwarmer weather.<br />\n<br />\nand individuality is offered here at prices that are not<br />\nand cannot be tmderquoted by any house at any time.<br />\nlas Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nFURNITURE<br />\n<br />\nSENIOR CLASS MEETING<br />\nDetails for the Senior banquet<br />\nare still hazily indefinite, but one<br />\npoint has been decided: the banquet is to be a credit to the class,<br />\nnot a disgrace. This decision,<br />\nreached in a Senior Class meeting,<br />\nlast Tuesday, does not, according<br />\nto its exponents, mean that the affair will be 'bone dry,\" but it does<br />\nimply \"safe and sane\" conditions<br />\nwill prevail for the most part. The<br />\ncommittee, headed by John Shriver, is now making actual arrangements for the banquet.<br />\nAt the close of the discussion of<br />\nthe banquet, June Week plans<br />\nwere outlined. A committee of<br />\nSeniors is to arrange for the electrical illumination of the campus.<br />\nStep-singing also was discussed<br />\nand suitable selections are now<br />\nbeing sought for the occasion.<br />\n<br />\n7-8 P. M.<br />\nSPECIAL STUDENTS AT-HOME<br />\nFEBRUARY 17<br />\n<br />\nAt the Washington Monument<br />\n<br />\nCOME DOWN AND<br />\nGET ACQUAINTED<br />\n<br />\nCOLLEGE 3rd CABIN<br />\nCUNARDER<br />\n\"SAXONIA\"<br />\n$160<br />\nRound Trip<br />\n<br />\n/<br />\nJUNE 21<br />\n<br />\nCamaraderie<br />\nwill be the keynote of this exceptional voyage,the entire 3rd<br />\nclass accommodations of the Cunarder \"Saxonia\" having<br />\nbeen reserved exclusively for college men. Men from every<br />\ncorner of the country are availing themselves of the low tariff, special service<br />\nand restricted reservation to satisfy their<br />\nheart's desire to travel. Climb on the<br />\nband wagon! It will be the most glorious<br />\nsummer you will ever know. Apply at<br />\nnearest Cunard Office, or write —<br />\nCOLLEGE CABIN COMMITTEE<br />\nB. D. ADAMS, Chairman<br />\n<br />\nTHE OAKS<br />\n<br />\nITHACA, N. Y.<br />\n<br />\nCUNARD LINE<br />\n<br />\n\f", "format": "basic_html", "processed": "MEMIL<br /><br />\nTS<br /><br />\n;A<br /><br />\nVOL. XXVIII, No 43<br />\nENGINEERING STUDENTS<br />\nLEARN OF IMPORTANCE<br />\nOF PORTLAND CEMENT<br /><br />\nHOMEWOOD, BALTIMORE, MD., MARCH 21, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nDR. LITZ TO GO TO BALTI- FEMALE PARTS IN \"THE GAL- FORTY CANDIDATES RE- CABINET OFFICERS FOR Y. M.<br />\nC. A. ANNOUNCED AT<br />\nLOPER\" HOTLY CONPORT FOR BASEBALL<br />\nMORE CITY COLLEGE AS<br />\nFRIENDS HOUSE<br />\nTESTED<br />\nPRACTICE<br />\nA MEMBER OF FACULTY<br /><br />\nMr. Moore, Secretary of the Friends<br />\nRichard K. Meade Begins Series of Received Degree of Doctor of Philoso- Parts of \"Sybil Schwartz,\" \"Grace Coach Brockman Pleased at Turn-out.<br />\nMeeting House, Makes Short<br />\nProspects Bright for Pitchers<br />\nphy at Johns Hopkins in 1921<br />\nLectures on \"Engineering<br />\nWhitney\" and \"Blanche Bailey\"<br />\nAddress<br />\nPractice\"<br />\nStill Tentative.<br /><br />\nAbout 40 baseball candidates reDr. Francis A. Litz of the EngA meeting of cabinet officers<br />\nThe tremendous importance o<br />\nbeing<br />\nnow<br />\nare<br />\nFinal<br />\ntryouts<br />\nsponded Monday to the first call and<br />\nish Department has been appointothers interested in \"Y\" work<br />\nPortland cement was explained by<br />\ned to a position on the faculty of held by the Barnstormers for the issued by Coach Brockman. Led on the<br />\ncampus, was held at the<br />\nRichard K. Meade, a prominent<br />\nimportant part of \"Blanche Bai- by Captain Ben Thomas, the men<br />\nthe Baltimore City College.<br />\nFriends<br />\nMeeting House Monday,<br />\nchemical and industrial engineer<br />\nDr. Litz was educated at St. ley\" in \"The Galloper,\" to be given had a fast workout consisting of March 17. Formal<br />\ninstallation of<br />\nof Baltimore, when he addressed<br />\nCharles' College. While a student at the Lyric by the club on March throwing and batting, while late officers for the coming year took<br />\nan audience of engineering upperin the afternoon, the new coach place, and cabinet<br />\nat this institution he frequently 28 and 29.<br />\nmembers and<br />\nclassmen last Monday, March 17,<br />\nThe fight has narrowed down to had a short infield practice. With<br />\ncame into contact with John Banassistants<br />\nwere<br />\nMr.<br />\nannounced.<br />\nin the auditorium of the Mechaninister Tabb, for whom he acquired two candidates who are working plenty of material on hand, Coach Moore, Secretary of the Friends<br />\ncal Engineering Building. The leca sincere admiration, and with hard for the role, which is proba- Brockman hopes to produce the Meeting House, who has been in<br />\n\"The<br />\ntitle,<br />\nits<br />\nas<br />\nhad<br />\nture, which<br />\nwhom he formed an unending bly next to the \"female lead\" in best team in recent years. Pros- close contact with the campus life<br />\nManufacture of Portland Cement,\"<br />\nfriendship. This acquaintance con- importance. They are Leslie pects for pitchers—our usual han- for the past several years, conwas the first of a series of adSchwinn and Douglas Frantz,<br />\ndicap—however, are especially ducted the ceremony. In a brief<br />\ntinued until the death of Father<br />\nboth freshmen. Announcement of<br />\ndresses on \"Erigineering PracTabb in 1909. In this year Dr. the choice<br />\nbright; for, in Winkenwerder, a address given at the close of the<br />\nwill be made in the<br />\ntice,\" during which several wellLitz went to St. Mary's College, near future.<br />\nmedical student, Hopkins pos- dinner, Mr. Moore stated that notknown engineers will be brought<br />\nsesses one of the best twirlers in withstanding the excellent beginwhere he completed his underSlatkin Favored<br />\nto Johns Hopkins to speak before<br />\ngraduate course, receiving the dePresent opinion favors Morti- collegiate ranks, while Marrian, nings made in past years, the start<br />\nthe engineering undergraduates.<br />\ngree of Bachelor of Arts. After mer Slatkin for the female lead, Schacht and McNeil will complete this year is most encouraging and<br />\nThe history of the development<br />\ntwo years of graduate work at the which is \"Grace Whitney.\" This a fine staff from which to select. bids fair to be a banner year in<br />\nof cement from the relatively<br />\npart was hotly contested for, and<br />\nsame college he received his deThere will be much competition the annals of the Y. M. C. A. on<br />\neven now there is no small uncercrude form used by the ancient<br />\ngree of Master of Arts. During tainty<br />\nregarding it. Mr. Slatkin for the infield, a large number of the Hopkins campus.<br />\nEgyptians and Romans was briefIn a short talk given by Mr.<br />\nthe several years that followed, is now almost assured of the role candidates having their eyes on<br />\nly outlined by the speaker. The<br />\nKarl<br />\nMiller, the new president, the<br />\nEgyptians found that by calciming Dr. Litz devoted the major part of if he is successful in surviving the the positions left vacant by gradutwo<br />\noutstanding features of the<br />\ngypsum they would obtain as a his time to the study of English voice tryouts, which will be held ation. Captain Thomas will probremaining<br />\nsemester were outresultant product plaster of Paris. Literature and Composition at the at the Lyric next Tuesday during ably be seen at second again, with<br />\nthe<br />\nlined,<br />\nSilver<br />\nBay Conference<br />\nThis material was used as a ce- Johns Hopkins University, receiv- lunch hour. Every candidate for Bonner, Boswell, and Gwinn as and the<br />\nretreats,<br />\nor<br />\nundergraduate<br />\nment when they constructed the ing a Fellowship. Upon comple- the cast is expected to attend these<br />\nconferences.<br />\nfirst<br />\nThe<br />\nbase<br />\nsubstitutes.<br />\ncapable<br />\ntryouts.<br />\nPyramids. Similarly, during the tion of this work, which served as<br />\nAs usual Hopkins will be well<br />\nAnother call has been issued by position is receiving strong bids<br />\nsame period, the Romans mixed a suitable foundation for future rerepresented<br />\nat the annual Silver<br />\nlime with volcanic ash and ob- search in English Literature, he the club for 15 or 20 extras. The from Gilpin and O'Connor, both Bay Conference. The delegation<br />\ntained a cement which could be was granted an appointment to extras will be used for the mob discovered in the interfraternity will be headed this year by Mauused hydraulically, that is, one the faculty of the University of scene, soldiers and other minor and interclass games. At short- rice Skinner; anyone interested or<br />\nTexas, where he fulfilled his duties parts. All who are interested<br />\nwhich will set under water.<br />\nstop, Keen and Wasserman will desiring to go as a delegate should<br />\nas teacher of English until 1920. should be on hand at the first reand<br />\nslides<br />\nprofuse<br />\nBy means of<br />\nfight it out with Crawford, the get in touch with him.<br />\ndiagrams the modern method of However, in this year he returned hearsal for extras, which will be<br />\nbrilliant infielder from Tome. The first of the undergraduate<br />\nmanufacturing Portland cement to Baltimore and began to teach held at the Barn tonight. All exbase is also receiving atten- conferences is to be held on April<br />\nThird<br />\nwas explained by the engineer. English in this university, where tras will be required to attend four<br />\na number of candidates 12 at Camp Conoy on the South<br />\nfrom<br />\ntion<br />\nThe methods of crushing the raw he has remained until the present other rehearsals.<br />\nCalhoun, and Jacobs River. The men will leave for<br />\nAshton,<br />\nwith<br />\nDress Rehearsal Thursday<br />\nmaterial in the modern industrial time. In 1921 he received the decamp on Saturday at noon returnform.<br />\ngood<br />\nshowing<br />\nThe final dress rehearsal will bt<br />\nplant were first shown. Follow- gree of Doctor of Philosophy, and<br />\ning<br />\nlate Sunday afternoon. This<br />\nSchacht and Marrian will form<br />\ning this, in order, occur the dry- was also elected to the Phi Beta held at the Lyric on Thursday arwill<br />\ngive them ample time to get<br />\nthe outfield, and<br />\ning, grinding, proportioning, and Kappa with an unusually high av- ternoon, beginning at 1 o'clock. It a nucleus for<br />\nacquainted,<br />\nand to form closer<br />\n\"Dutch\" Holland, the hard-hitting<br />\nfinally, the pulverizing of these erage. As a requirement for the will continue throughout the afterfriendships<br />\nwhich<br />\nshould engendegree of Ph. D., Dr. Litz wrote noon, and the evening if neces- catcher of last year, will again do<br />\nmaterials.<br />\nder<br />\nco-operation.<br />\nreceiving, although Day, AsenCrushing of the hard materials a thesis on the life and works of sary, until Mr. Swindell, the the<br />\nThe cabinet members are as folCook, and Oates are furnishdorf,<br />\nis largely done in gyratory crush- John B. Tabb, which was later coach, is satisfied with the perforlows:<br />\nCoach<br />\ncompetition.<br />\ners, although a few plants pass, published under the title of \"Fa- mance of the club. The costumes, ing close<br />\nMembership—Baldwin.<br />\nfact<br />\nthe<br />\nemphasized<br />\nBrockman<br />\nmaterial from the quarry through ther Tabb.\" Dr. Litz is prominent which are being made by Jones,<br />\nFinance—McKay.<br />\nin literary circles, being a mem- will be available for use on Mon- that no positions are filled, but<br />\ntoothed rolls.<br />\nPublicity—Grafflin.<br />\nthat hard work by every man on<br />\nThe next important step in the ber of the Kottabas Club and also day afternoon.<br />\nChurch Co-operation—Trout.<br />\nthe best<br />\nIt was recently announced by the squad will develop<br />\npreparation of the raw materials is secretary of the Modern Language<br />\nNew Students—Harp.<br />\nproduced.<br />\nthe properties staff that the set- team Hopkins has ever<br />\nthe burning. This is followed by Association of America.<br />\nSocial Service—Hunter.<br />\nDr. Litz assumes his new duties tings for the entire play are practithe cooling of the clinker, adulterSpeakers Bureau—Bull.<br />\nSIGMA CHI BETA HOLDS<br />\ncally completed.<br />\nation to retard set, and the reduc- immediately.<br />\nVocational Guidance—Pease.<br />\nMEETING AT HOPKINS<br />\ntion of this clinker to an impalpaPlay Rounding Into Shape<br />\nFriendly Relations—Chambers.<br />\nCLUB<br />\nble powder. Having gone through BALTIMORE SUN OFFICES TO<br />\nReligious Education—Wales.<br />\nMr. Swindell has frequently<br />\nPUBBY<br />\nINSPECTED<br />\nBE<br />\nteams<br />\nvisiting<br />\nof<br />\nThe<br />\nreception<br />\nthese processes, it only remains to<br />\nConferences and Conventions—<br />\nvoiced his satisfaction regarding<br />\nLICITY BOARD<br />\nseason the cement, and to bag it.<br />\nthe manner in which the play has was discussed at a Sigma Chi Thomsen.<br />\nA trip will be made through the been recently rounding into shape, Beta meeting held at the HopReading Room—Asendorf.<br />\n\"If all the cement and concrete<br />\noffice<br />\nMr.<br />\nof the Baltimore Sunpapers although the illness of Tom Jen- kins Club after a dinner given<br />\ndeclared<br />\nThe men who have just commade in the world,\"<br />\nMeade,\"was made into a concrete at 2.30 o'clock today by the Pub- ifer, who is portraying one of the last Monday. Plans were organ- pleted a very successful term as<br />\npavement 24 feet wide, it would licity Board members under the principal female parts, has some- ized for entertaining the members Y. M. C. A. officers' are Reese<br />\nstretch entirely around the world direction of Henry Edward War- what slowed up rehearsals in the of visiting athletic teams, and a Marsh, president; Paul Sylvester,<br />\nRandolph<br />\nat the equator.\" The lecture was ner, promotion manager of the last two weeks. He has been con- committee headed by Mr. Kenne- vice-president; and<br />\nconcluded with the striking state- Sun. Members of the News-Letter fined to his bed with an infected dy reported the scheme of recogni- Norwood, treasurer. Karl Miller,<br />\nment that every day a train 10 staff are also requested to make throat, and although it was report- tion that had been made for the the new president, was secretary<br />\ned that he was able to walk about members of the visiting teams. of the association during the past<br />\nmiles long, filled with cement, the trip.<br />\nThe tour will include inspection a little last Monday, he is not ex- They also explained that each man term.<br />\ngoes out of the mills of this counand instruction in the publishing pected to be able to attend rehear- of a visiting team is to wear a tag<br />\nThe next fellowship dinner will<br />\ntry.<br />\nof a newspaper, with particular sals until next week, a short rest which will admit hirn to the be held on April 1 at the meeting<br />\nIDES OF MARCH DANCE emphasis on handling newspaper being necessary for his complete dances or whatever other enter- house. Dr. P. C. Chan, one of the<br />\nGIVEN BY CANE CLUB AT copy, which is of vital interest to recuperation. Meanwhile the part tainment that may be held at that popular speakers at the Hood Colmembers of the Publicity Board of Sybil Swartz, the heiress, is be- time, and that each member of lege Conference, and graduate of<br />\nCHIMNEY CORNER<br />\nNews-Letter who are writing ing read by young hopefuls.<br />\nand<br />\nSigma Chi Beta is to wear another the George Washington Medical<br />\nLast Saturday evening, on the<br />\nnews.<br />\nof tag so that the visiting School, will be the speaker of the<br />\ntype<br />\nIdes of March, the Cane Club held<br />\nknow to whom to go in evening.<br />\nwill<br />\nmen<br />\nThose who will go should be in<br />\none of its dances at the Chimney<br />\nobtain any information.<br />\nto<br />\norder<br />\nDr. Chan, who has been in this<br />\nCorner. The club realized the lack the lobby of the Sun Building by<br />\nRichmond<br />\nDebate<br />\ncalled<br />\nreception<br />\nthat<br />\nresolved<br />\nIt<br />\nfor nine years, and is now<br />\nwas<br />\nmen<br />\ncountry<br />\nBoard<br />\nPublicity<br />\ntoday.<br />\n2.15<br />\nof<br />\ntime<br />\nthis<br />\nat<br />\nof social functions<br />\noff. Through misunderappointed, doing interne work at George<br />\nbe<br />\nshould<br />\ncommittees<br />\nis<br />\nexcuse<br />\ngood<br />\na<br />\nunless<br />\ngo<br />\nmust<br />\na<br />\nhave<br />\nto<br />\ndecided<br />\nthe year and so<br />\nstanding both sides prepared<br />\nof<br />\neach to have a term of two weeks. Washington, will deliver somegala occasion at that time. The given. R. C. Tilghman, editor<br />\nnegative. Will be held<br />\nthe<br />\nThe season ticket campaign was thing of a farewell speech since<br />\nas<br />\nthat<br />\nrequests<br />\ner,<br />\nNews-Lett<br />\nthe<br />\nlarge<br />\na<br />\nparty was attended by<br />\nin the near future.<br />\nheartily endorsed and every he is returning to China at the<br />\nNews-Letalso<br />\nthe<br />\nof<br />\nmembers<br />\nmany<br />\n,<br />\npres<br />\nnumber of alumni; everyone<br />\nend of this year.<br />\naid was urged.<br />\npossible<br />\npossible.<br />\nas<br />\nattend<br />\nstaff<br />\nter<br />\non page 4, co/. 3.<br />\nContinued<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 21, 1924<br /><br />\nENGINEERING PROBLEMS TO<br />\nLIBERTY ST.<br />\nBE DISCUSSED IN LECTURE SERIES<br />\nAT SARATOGA<br />\nFOUNDED 1897<br />\nThe annual series of lectures on<br />\nLUNCHEON<br />\n\"Engineering Practice,\" comprisSubscription<br />\n$2.00<br />\nTEA<br />\ning four addresses, will be held<br />\nDINNER<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at weekly this year during the period<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nfrom Monday, March 17, to MonSPECIAL PARTIES<br />\n11.30 A. M.<br />\nday,<br />\nApril 7. One lecture in each<br />\nsemi-weekly<br />\nPublished<br />\nfrom October to June by the students of Johns<br />\nuntil<br />\nOf course you know that<br />\nHopkins University.<br />\nPLAZA 6987<br />\nof the general fields of Civil, Gas, 7.30 P. M<br />\nThe Barn is handling orders<br />\nElectrical<br />\nand<br />\nMechanical<br />\nEngifor<br />\nour clothes again this<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications neering, will be given by engineers<br />\nyear.<br />\nshould be sent to the MANAGING EDITOR.<br />\nprominent in their respective fields.<br />\nThe plan worked to<br />\nThe course of lectures, which is<br />\nmutual advantage last seaTelephone<br />\nHomewood 100 given annually, is one feature of<br />\na<br />\nson, and we're mighty glad<br />\ngeneral plan for furthering underto continue the relationEditor-in-Chief<br />\nBusiness Manager<br />\ngraduate<br />\ninstruction<br />\nin<br />\nthe<br />\nmethship.<br />\nRICHARD C. TILGHMAN, '25<br />\nPHILIP W. HOWARD, '25<br />\nCLOTHIERS<br />\nods and problems of the practice<br />\nReady-to-wear Suits<br />\n$30 up<br />\nManaging Editor<br />\nof engineering. Accordingly, the<br />\nAdvertising Mana per<br />\nHABERDASHERS<br />\nReady-to-wear O'Coats . $35 up<br />\nAUGER G. Hiss, '26<br />\nA. J. McKAY,'26<br />\nlectures deal with the practical<br />\nAssistant Managing Editor<br />\nphases of engineering problems.<br />\n211-213 E. Baltimore St.<br />\nCirculation Manager<br />\n315 Charles St. North<br />\nERNEST A. STRATHMAN, '26<br />\nWorking<br />\nmethods<br />\nof<br />\nengineering<br />\nOTHO J. KELLER, III, '26<br />\nAssociate Editors<br />\ndesign, operation, and construction<br />\nTA'EfOr<br />\nJOHN W. PARSONS, '25<br />\nAssistant Business Managers<br />\ndiscussed.<br />\nare<br />\nBENJAMIN T. ROME, '25<br />\nD. MILES MARRIAN,'25<br />\n•<br />\nPlanned primarily' for underJunior Editors<br />\nG. DONALD GIESKE,'25<br />\ngraduates, the lectures presuppose<br />\nARTHUR L. NELSON, '26<br />\nJOHN T. DIXON, '24<br />\nEDWARD 0. MICHEL, '26<br />\nan<br />\nelementary rather than an intenC. EUGE.NE TOVELL,'24<br />\nJAMES YOUNG, '25<br />\nsive<br />\ntheoretical knowledge, and parJ. JACKSON KIDD, '26<br />\nHENRY R. TURNBULL, '26<br />\nHAROLD S. GOODWIN, '26<br />\nticular<br />\nSTRAN<br />\nT.<br />\nSUMMERS, '25<br />\nstress will be laid on the<br />\nA. RISLEY ENSOR, '26<br />\nHEYWARD E. BOYCE, JR., '27<br />\nmore important features and principles of practical engineering of<br />\nMember Southern Intercollegiate Newspaper Association<br />\nthe present day.<br />\nThe lectures are an integral part<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore,<br />\nof the engineering course for junMd.<br />\niors and seniors. However, they<br />\nHOMEWOOD, BALTIMORE, MD., MARCH 21, 1924<br />\nwill be open to the general public,<br />\nand tickets of admission are not required.<br />\nThe addresses are as follows:<br />\nSPRING COMPETITION<br />\nMonday, March 17, \"The ManuA journalist need not necessarily be a literary genius. Success<br />\nfacture of Portland Cement,\" by<br />\nin one field of writing does not imply success in another. Robert<br />\nMr. Richard K. Meade, Chemical<br />\nLouis Stevenson, early in life, adventured into news reporting but<br />\nand Industrial Engineer, Baltimore,<br />\nafter three weeks of this work was dismissed as incapable. ThackMd.<br />\neray underwent the same experience.<br />\nMonday, March 24—Supplying<br />\nAs far as we are aware, the Hopkins undergraduate body can Gas to Baltimore. Mr. H. R. Cook,<br />\nboast of no possible Stevensons or Thackerays. We feel, however, Jr., General Superintendent, Gas<br />\ntyle: \"Distinctive or characterthat there are a large number of men who, with experience, would Operating Division, Consolidated<br />\nistic mode\" (Webster). Might<br />\ndevelop into finished college journalists. Writing for a newspaper Gas Electric Light and Power<br />\nrequires no flowery style, no learned or extraordinary vocabulary. Company, Baltimore, Md.<br />\nbe shortened to \"Stetson\" in<br />\nIt necessitates only clear, accurate expression,\"a nose for news,\" and<br />\nMonday, March 31. The Engispeaking of hats.<br />\na desire to work.<br />\nneer in a Large Railroad OrganiExperience on a college paper is not without compensation. It zation. Mr. Earl Stimson, Chief<br />\nenables one to form intimate associations with campus leaders and Engineer, Maintenance, Baltimore<br />\nto view college problems from all angles. Above all, it helps one to and Ohio Railroad, Baltimore, Md.<br />\nMonday, April 7—The High<br />\nsalvage definite ideas from a conglomerate mass of facts. Men who<br />\nhave spent four years in college journalism have said they would not Tension Cable Problem. Mr. Wm.<br />\nsubstitute any three courses for the experience gained.<br />\nA. Del Mar, Chief Engineer, Habirshaw<br />\nElectric Cable Company,<br />\nThree periods of competition for candidates for the News-Letter<br />\nYonkers,<br />\nNew York.<br />\nare provided in its constitution. The spring competition starts with<br />\nthis issue and ends May 25. An opportunity is here offered candidates<br />\nto be selected to the staff before the close of the year. Candidates<br />\nare requested to report for assignments at the News-Letter office on<br />\nTuesdays and Fridays.<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nPayne &amp;Merrill<br /><br />\nS<br /><br />\nSTETSON HATS<br />\nStyled for young men<br /><br />\nAPPRECIATION!<br />\nWith this issue the 1924-25 Board assumes control of the NewsLetter. It takes up its tasks with a feeling of appreciation of the<br />\nuntiring efforts and perseverance of the outgoing staff. Under<br />\nthe<br />\nguidance of its members the paper has prospered and has been<br />\nled<br />\nthrough a banner year.<br />\nDuring the administration of the old editors many important<br />\nchanges have taken place on the Hopkins campus. Our \"Fairy<br />\nGodmother\" has been unusually kind to us by erecting a dormitory<br />\nand<br />\na new chemical laboratory. Athletic and non-athletic activities<br />\nhave<br />\nshown improvement under efficient management. Our teams—foot<br />\nball, lacrosse, swimming, track--have become famous and bear enviable reputations. Two possible candidates for the Olympic<br />\nGames<br />\nhave been developed. The Barnstormers have been ushered in and<br />\nhave paved the way for a probable all-Hopkins production. The<br />\nprestige of the Musical Club has increased.- On the whole campus<br />\nactivities have progressed and have been constantly brought<br />\nbefore<br />\nthe public eye. Many campus changes can be attributed directly<br />\nor<br />\nindirectly to suggestions and criticisms from the editorial column<br />\nof the News-Letter.<br />\nWe, the incoming board, are attempting to carry on the work<br />\nstarted by our predecessors. Our aim is to give a \"newsier\"<br />\nand<br />\nbetter paper. We endeavor to reflect, impartially, as best we<br />\ncan,<br />\nthe correct undergraduate sentiment. If criticism and<br />\ndiscussion<br />\nresult, we accomplish our purpose to stimulate thought.<br />\nThe News-Letter is proud of its twenty-seven years of<br />\nservice.<br />\nIt is more interested, however, in the years of the future. It is<br />\nwith<br />\nthis interest and a sincere hope for progress that the new board<br />\nof<br />\neditors assumes its duties.<br /><br />\n—all the difference<br />\nbetween just an ordinary cigarette<br />\nand — FATIMA,the most skillful<br />\nblend in cigarette history.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, MARCH 21, 1924<br /><br />\nBoys, the place to get your<br />\nmeals—and they are honest-to-goodness meals, well<br />\nserve d, and reasonably<br />\npriced—is at<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nBE A NEWSPAPER CORRESPONDENT<br />\nwith the Heacock Plan and earn a good income while learning;<br />\nwe show you how; begin actual work at once; all or spare time;<br />\nexperience unnecessary; no canvassing; send for particulars.<br />\nNEWSWRITERS TRAINING BUREAU<br />\nBuffalo, N. Y.<br /><br />\nHub<br /><br />\n1817 N. Charles St.<br />\n(Half Block below North Ave.)<br /><br />\nBaltimore's Great Men's Store<br /><br />\nNicholas Brown, Mgr.<br /><br />\nA Hess Shoe \"Goes to Hopkins\"<br />\nHere's a shoe that's a pippin—get Buck Bonner, at the Barn, to show it to you. Black and<br />\ntan Russia; broad college toe; good lines; a<br />\n-quality- look—and comfortable? Say!<br />\nSets you back just $8.50—reasonable enough.<br /><br />\nN. HESS' SONS<br />\n8 E. BALTIMORE STREET<br /><br />\n—Photo by 13achrach-<br /><br />\nThomas M. Jenifer, as the \"angel-faced Sybil\" in the<br />\nBarnstormers' farce.<br />\nDEBATE ANNOUNCED BETWEEN HOPKINS AND U.<br />\nOF RICHMOND<br />\nA debate on March 25 between<br />\nHopkins and the University of<br />\nRichmond was recently announced<br /><br />\nby the Debating Council. The following subject has been chosen:<br />\n\"Resolved, That the United States<br />\nshould enter the World Court.\"<br />\nThe Hopkins debaters will take<br />\nthe affirmative side of the argument.<br /><br />\nThe Hopkins team will consist<br />\nof<br />\nWilliam Gross, Owens Rea and<br />\nBIDDERS<br />\nPRMTERS<br />\nEllgRAVERS<br />\nElmer Mylander, alternate. The<br />\nvisitors have not yet announced<br />\ntheir team.<br />\nCollele Literature<br />\nThe choice of a Tuesday night<br />\nfor the debate will mark an innovation in Hopkins debating. The<br />\nreason given for this action is the<br />\ndrive on the part of the Debating<br />\nCouncil to get larger audiences at<br />\nthe debates. It is felt that a larger<br />\nattendance can be expected on<br />\nevenings when there is no other<br />\nimportant social event in progress.<br />\nAs an added attraction, an informal dance will immediately follow<br />\nthe debate, which will be held in<br />\nthe C. E. Hall.<br /><br />\nAnother call for<br />\ncandidates<br /><br />\nALWAYS USE A<br /><br />\nPrinters of<br /><br />\ncThe Johns Hopkins<br />\nNEWS,LETTER.<br /><br />\nYELLOW CAB<br />\nOR PHONE<br /><br />\nVERNON 1212<br />\nHAIL THEM ANYWHERE<br /><br />\nLOMBARD and SOUTH STREETS<br /><br />\nHYNSON, WESTCOTT and DUNNING<br />\nPRESCRIPTION DRUGGISTS<br />\n:TWO ISTORES1<br /><br />\nCharles and Chase Sts.<br /><br />\nEutaw Place and North Ave.<br /><br />\nVernon 0890<br /><br />\nMadison 0405<br /><br />\nf?<br />\n5<br />\n:<br />\nG. 1<br />\ner<br />\nH.<br />\nsX<br />\ne<br />\n0Amt<br />\n)<br />\n111<br />\nas<br />\nOSCARi<br />\nR6 eipbo<br />\n.ml emi4<br />\nzito OWNE<br />\n29 E. BALTIMORE ST.<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br /><br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by whatever helps the<br />\nIndustry.<br /><br />\nIn this season of try-outs, seniors will do well<br />\nto respond to the call for candidates which progressive business organizations are making.<br />\nThe visit of the various company representatives<br />\noffers a mutual opportunity. It puts you in position to judge whether a particular company offers<br />\nsufficient scope to your ability and ambition.<br />\nThe representative can judge, after conversing<br />\nwith you and studying your record, whether you<br />\nwould be well placed in his company.<br />\nDo not ignore the invitation to these interviews.<br />\nDo not be one of those—and they are many—<br />\nwho next Fall will write to the larger companies,<br />\n\"At the time your representative visited my<br />\ncollege I did not think that I was interested in the<br />\nwork of your company and so did not meet him\".<br />\nMen who are earnest in wanting to make the<br />\nteam usually respond to first call<br /><br />\ngtrn Electric a<br />\nSince 1869 makers and distributors ofelectrical equipment<br /><br />\nNumber 37 of a series<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, MARCH 21, 1924<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br /><br />\nSOPHISTICATED<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from\"Vaseline\"HairTonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br /><br />\nVaseline<br />\nHAIR TONIC<br />\nChesebrough idlfg.Co<br />\n(consolidated)<br />\n,<br /><br />\n. • ..44<br /><br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br /><br />\nBLACK AND BLUE JAY COPY DUE<br />\nTODAY<br /><br />\nCopy for the next number of<br />\nthe \"Black and Blue Jay\" will be<br />\ndue Friday, March 21, it was anManufactured by<br />\nnounced at a staff meeting last<br />\nWIGHT &amp; HUMPHRIES<br />\nThursday. The number will be<br />\ncalled the \"Caveman Number,\"<br />\nEstablished 1873<br />\nand copy pertaining to the title<br />\nA. H. FETTING MAN'FG<br />\nwill be especially welcome. ConJEWELRY CO.<br />\nManufacturers<br />\ntributions are wanted for both the<br />\nGreek Letter Fraternity Jewelry<br />\nart and editorial departments.<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nEditor-in-Chief Dunning has<br />\npointed out that the recent additions to the art and editorial staffs<br />\nwill lighten the work considerIs Taking the Country by Storm<br />\nably;<br />\nand, with more material to<br />\nA complete set in bright<br />\ncolors. 144 tiles. 116 countchoose from, a better brand of huers, 8 racks. 2 dice, book of<br />\nrules and instructions: any<br />\none can learn the game in<br />\nmor is expected. The Caveman<br />\nten minutes. All in attractive box, sent prepaid on<br />\nNumber<br />\nwill be the last issue put<br />\nreceipt of $1.00 (Canada<br />\n25c extra).<br />\nout under the direction of the<br />\npresent bbard of control. ConseVery Attractive Black Satquently,<br />\nevery effort will be made<br />\neen Mah-Jong Table Cover,<br />\nwith colored dragon deto<br />\nmake<br />\nthe<br />\nnumber the best pubsigns, adjustable to any<br />\nsize card table: 16 counter<br />\nlished<br />\nthis<br />\nyear.<br />\nPockets. striking colored<br />\nstitched edges. ExtraorShortly after copy is turned in<br />\ndinary value. Special price<br />\nfor the next number, and probably<br />\nCOMBINATION OFFER: We will<br />\nsend prepaid one complete Mahbefore the issue comes from the<br />\njong set and table cover as depress, the \"Black and Blue Jay\"<br />\nscribed above on receipt of $2.50.<br />\nstaff<br />\nwill hold its annual dinner,<br />\nCHINA-AMERICAN IMPORTING<br />\nCOMPANY<br />\nat which a new board of control<br />\n111 West 68th St.<br />\nNew York<br />\n\\vill be elected.<br /><br />\n-i<br /><br />\n'Yes, it does cost more to make VELVET<br />\nTobacco and for this reason—<br />\nIt's tile best Kentucky Burley tobacco<br />\nmoney can buy and then it's aged in wood.<br />\nAll harshness and bitterness are removed.<br />\nIt's mild and mellow. You will readily<br />\nnotice the difference.<br /><br />\nMah-Jong<br /><br />\n1<br /><br />\nTable Covers<br /><br />\nCAMPUS CLUB MEETS<br />\nTwenty-three campus lights,<br />\n\"Queen Quality\" Home-made<br />\nthe<br />\nCampus Club, gathered to414I4lq+11:4,4014R44.14leq41.1411I4 FPIEOPIFIteTAik,4:.<br />\nChocolates<br />\nIce Cream<br />\nIces<br />\nLuncheonette gether in the Dormitory Monday<br />\n227 N. Howard 518 N. Charles night. They held a smoker and<br />\nDancing Every Afternoon at<br />\nthere was plenty of smoke. Cigars<br />\nCharles St.<br />\nand cigarettes were in abundance,<br />\nnot to speak of Prince Wales' private pipe mixture.<br />\nEntertainment was furnished by<br />\n\"The King of Lubricants\"<br />\ndivers members of the club; some<br />\noffered music, but the hits of the<br />\nSHERWOOD BROTHERS, INC.<br />\nevening were impersonations of<br />\nseveral<br />\nHopkins celebrities, stuORMININEXffigNEINEMNIEffnagl<br />\ndents and others. Naturally everyone enjoyed the chicken salad and<br />\nA. JACOBS &amp; SONS<br />\nice cream served at 10 o'clock. By<br />\nTailors<br />\nthe way, the club adjourned at<br />\nUniforms and Liveries<br />\n10.30—quite decent of them.<br />\nA business meeting was held<br />\n128 W. FAYETTE ST.<br />\nNear Liberty St.<br />\nBaltimore, Md.<br />\nafter the party. Various members<br />\ninterviewed could not be persuaded to divulge any of the business<br />\n(Something new in portable<br />\ntransacted.<br />\ntypewriters.<br /><br />\nORTMAN<br /><br />\nBEK<br />\nci<br />\nma-son ono<br /><br />\nLIGGETT &amp; MYERS TOI3ACCO CO.<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD.KOHN &amp;CO.<br /><br />\nMount Vernon Place M.E.Church<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nPROGRAM FOR STUDENTS<br />\nBIBLE CLASS, 10 A. M.<br />\nAn Interesting Discussion of<br />\nVital Topics Under<br />\nDR. HOWARD A. KELLY, Leader<br /><br />\n\"XC\"<br />\nCORONA<br /><br />\nYOUNG PEOPLES AT-HOME<br />\n5-7 P. M.<br />\nTEA SERVED AT 6 O'CLOCK<br /><br />\nEPWOR1H LEAGUE<br /><br />\nHave you<br />\nseen it?<br /><br />\nURNER'S<br />\nMEN'S SHOES<br />\nOf the Better Class<br />\nURNER BROTHERS<br />\n111 E. BALTIMORE STREET<br />\nBaltimore<br /><br />\nClt writes nearly all languages.<br />\n41Has 90 characters.<br />\nSee Fred Rich, College<br />\nRepresentative<br />\n118 W. FAYETTE ST.<br />\nBALTIMORE, MD.<br /><br />\n• DROVERS &amp;MECHANICS<br />\nNATIONAL BANK<br />\nearner c.. ciyetie and nztaw 81s.<br />\n-Where Wholesale and Retail Districts Meet\"<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nCANE CLUB DANCE<br />\nContinued from page 1<br /><br />\nent proclaimed it the best dance<br />\never.<br />\nSometime ago W. Gardner<br />\nPackard succeeded J. S. V. B.<br />\nShriver as president of the club.<br />\nIn the near future the Cane Club<br />\nwill hold a supper at which time<br />\nDRAPERIES elections will take place and the<br />\ntraditional tapping will come with<br />\nwarmer weather.<br /><br />\nand individuality is offered here at prices that are not<br />\nand cannot be tmderquoted by any house at any time.<br />\nlas Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nFURNITURE<br /><br />\nSENIOR CLASS MEETING<br />\nDetails for the Senior banquet<br />\nare still hazily indefinite, but one<br />\npoint has been decided: the banquet is to be a credit to the class,<br />\nnot a disgrace. This decision,<br />\nreached in a Senior Class meeting,<br />\nlast Tuesday, does not, according<br />\nto its exponents, mean that the affair will be 'bone dry,\" but it does<br />\nimply \"safe and sane\" conditions<br />\nwill prevail for the most part. The<br />\ncommittee, headed by John Shriver, is now making actual arrangements for the banquet.<br />\nAt the close of the discussion of<br />\nthe banquet, June Week plans<br />\nwere outlined. A committee of<br />\nSeniors is to arrange for the electrical illumination of the campus.<br />\nStep-singing also was discussed<br />\nand suitable selections are now<br />\nbeing sought for the occasion.<br /><br />\n7-8 P. M.<br />\nSPECIAL STUDENTS AT-HOME<br />\nFEBRUARY 17<br /><br />\nAt the Washington Monument<br /><br />\nCOME DOWN AND<br />\nGET ACQUAINTED<br /><br />\nCOLLEGE 3rd CABIN<br />\nCUNARDER<br />\n\"SAXONIA\"<br />\n$160<br />\nRound Trip<br /><br />\n/<br />\nJUNE 21<br /><br />\nCamaraderie<br />\nwill be the keynote of this exceptional voyage,the entire 3rd<br />\nclass accommodations of the Cunarder \"Saxonia\" having<br />\nbeen reserved exclusively for college men. Men from every<br />\ncorner of the country are availing themselves of the low tariff, special service<br />\nand restricted reservation to satisfy their<br />\nheart's desire to travel. Climb on the<br />\nband wagon! It will be the most glorious<br />\nsummer you will ever know. Apply at<br />\nnearest Cunard Office, or write —<br />\nCOLLEGE CABIN COMMITTEE<br />\nB. D. ADAMS, Chairman<br /><br />\nTHE OAKS<br /><br />\nITHACA, N. Y.<br /><br />\nCUNARD LINE<br /><br />"}], "field_media_file": [{"target_id": 37851, "display": null, "description": null, "target_type": "file", "target_uuid": "734bdeda-03e8-4d4f-aeaf-db649f6d1df8", "url": "http://digital.library.jhu.edu/system/files/2022-03/13094-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13094, "target_type": "node", "target_uuid": "aec9d8c3-7dc7-4cfc-aba3-20e0becb105e", "url": "/node/13094"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "0914859f-784c-461e-b932-d035c5a642b6"}]}