{"mid": [{"value": 35615}], "uuid": [{"value": "a96f4f2e-a8ad-49c1-ad16-8db62901bce8"}], "vid": [{"value": 35615}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:09:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12162-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:09:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:09:46+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "/N<br />\n<br />\n0<br />\n<br />\nPRt•S OF<br />\n<br />\nSTONEBRAKEPI BRO., kIALIIMORE<br />\n<br />\n\fJOHNS HOPKINS I The Johns Hopkins Press.<br />\nUNIVERSITY.<br />\nP. MORLEY,<br />\n<br />\nAmerican Journal of Mathematics.<br />\nEditor. Quarterly. 4to. Volume X XIII.'<br />\nin progress. $5 per volume.<br />\nII.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per vOlume.<br />\nStudies in Historical and Political Science.<br />\nV.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series X IX<br />\nin progress. $3 per volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Anyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\n<br />\nI.<br />\n<br />\nBALTIMORE, MD.<br />\n1 111<br />\n•<br />\n1.1•111M•110..<br />\n<br />\nTwenty-Fifth Year.<br />\n<br />\nBeginning October 1st, 1900.<br />\n<br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br />\n<br />\nDANIEL C. GILMAN<br />\nWm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\ndegree<br />\n(b) In Medicine. (Courses for candidates for the<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special.students.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\n<br />\nX.<br />\n<br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam If. Howell.<br />\nWilliam H. Wekh.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oskr.<br />\n<br />\nXI.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the -Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br />\n<br />\nEditors.<br />\nFrank Morley.<br />\nIra Remsen,<br />\nBasil L. Gihkrslec c<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br />\n<br />\nXII.<br />\n<br />\nXIII.<br />\n<br />\nXIV.<br />\nXV.<br />\n<br />\nXVI.<br />\n<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nV in progress. $5 per volume.<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nAnnual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\n<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc.,of the University. Published at the<br />\nclose ofthe academic year.<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOINS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edi:<br />\ntion. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. II. Hall. $3.00.<br />\nBIBLIOGRAPHIA HOPKINSIENSIS. Part I. Philology. Parts<br />\nII-III. Chemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br />\n<br />\n\f•the news= Letter. *<br />\nVol. V.<br />\n<br />\nJanuary 24, 1901.<br />\n<br />\nPOSTMARKED \"THE CONTINENT.\"<br />\nS. S. Tarter Prince, Feb'y. 18, 1900.<br />\n<br />\nESTERDAY noon,just two weeks out from<br />\nNew York, we sailed past the impregnable<br />\nrock, and there could read, with our own very<br />\neyes:<br />\n<br />\ny<br />\n<br />\nTHE PRUDENTIAL HAS THE STRENGTH<br />\nOP GIBRALTAR.<br />\n<br />\nWhen I came up on deck in the morning to<br />\nsee the gray line of the mountains of Morocco<br />\non the one hand and the hills of\"Sunny Spain\"<br />\non the other (truly sunny) I began to get it<br />\nthrough my doubting head that we were veritably crossing \"the great pond\" and that our<br />\nlong voyage was coming to some end.<br />\nIt has been a rare voyage. Two great storms<br />\nand much fine sailing. It was biting cold as<br />\nwe.were hauled out of the Brooklyn slip. But<br />\nwhen the pilot was dropped and the land lost<br />\nto view, the air came mild and we were tucked<br />\nup in our rugs in the steamer-chairs on deck.<br />\nThere we have lived, to all unpractical ends<br />\ntwo solid weeks, a lazy, loafing, good for nothing lot,—tho' just a trifle chipper now that we<br />\nare on the Mediterranean, with fine sunny days<br />\nand a famous moon at night.<br />\n<br />\nNo. 7.<br />\n<br />\nthe dining-room. The little wooden racks were<br />\nsttetched along the tables: to help you keep<br />\nthe identity of your plate and knife and fork,<br />\nand as a needed precaution against the summary landing of your breakfast,tout and scramble, in your lap. I took my first lesson in balancing a cup of coffee in one hand while I<br />\nstabbed for a piece of steak with the other.<br />\nThis, however, is a trifle rhetorical. I did do it<br />\nagain! This first morning I made my breakfast<br />\non a bit of dry toast, and cleared out of the<br />\nstuffy cabin post haste. I knew my safety was<br />\nin fresh air, in deep and copious breaths. At<br />\nthe risk of a ducking I spent the day on deck,<br />\nlashed to my steamer-chair.<br />\nThe ocean was glorious. I have lived for<br />\nthis. The low and scudding clouds. The sea<br />\nlashed to a fury. Now raised up in a great<br />\nwall, then levelled, torn in a thousand scraps<br />\nof foaming white. Up, Up, UP! and the eye<br />\nlooks out alone on the wet, gray sky. The<br />\nsurge and rush of the wave,and the black water<br />\nis hissing at your feet. You clutch the arms of<br />\nyour chair. Vast, illimitable, lonely waters.<br />\nMajestic. Powerful. The Living Sea.<br />\nser W W<br />\n<br />\nThe worst of it was over with the second<br />\nAi<br />\nnight, and the day following we had the wind<br />\nSunday, our third day out, was pleasant sail- in the west, abaft, with the long swells pressing<br />\ning. A sermon from one of the four ministers after us, and chasing on and past us, while the<br />\naboard! (There are mutterings in the \"fo' screw threshed out a snarl.<br />\ncastle.\" The steward predicts \"tough luck!\")<br />\nThe \"ship's company\" crawled up on deck<br />\nAlong about sun-down we got a little motion like half-drowned rats, and entered into the felon. It is breezing up a bit. Several passengers lowship of a common misery.<br />\ngo down with the sun. The visible list is<br />\nWe had two or three days of fine sailing then.<br />\ndepleted.<br />\nI 'ried to read. What foolishness to have loaded<br />\nWhen I came up on deck the following morn- down my bag with books! Your eyes steal<br />\ning, Blue Monday! A heavy gale was on from furtively from the page to the broad sea, and<br />\nthe south. It was blowing like a nautical you come back with a start after a half-hour's<br />\nnovel. As our course was due east we were dreaming. (0, foolish first voyager! As if<br />\nright in the trough of the sea and rolling on Old Ocean were not better than a book.) The<br />\nour scuppers. Five or six only of our forty sky and the sea, but multitude changes! A bit<br />\npassengers answered the breakfast call. The of sun, a rainbow, a matchless green in the<br />\nberth-cabin is in a state of collapse! It was breaking of a wave, a group of gulls.<br />\nnext door to impossible to serve anything in<br />\nww<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThat second storm came on the eighth day.<br />\nWith waves topping forty feet and the wind at<br />\nsixty knots it outlived the first in fierceness. It<br />\nwas a nor'easter. The mate called it \"a<br />\nbreeze.\" We lost a rail. There was a boat<br />\nstove in.<br />\nUntil you get out on the ocean, a thousand<br />\nmiles from anywhere, with the wind howling<br />\nlike a dervish and the seas smashing on the<br />\nbow, in the long, black night: to feel your shell<br />\nof a ship lifted up, the pound of the sea, the<br />\nmighty shudder of the frame, the creaking of<br />\ntimbers, the sullen rush of waters on the deck,—<br />\ntill then, you have two or three emotions<br />\nunrealized. And when, after three days of this,<br />\nthe sea conies calm and you make out the first<br />\nbit of land you have seen for near a fortnight,<br />\nthen if never before, you are glad for the good<br />\ngift of life, and you go out on deck, alone, and<br />\nlift up your eyes unto the hills.<br />\n.116 .116.A6<br />\nHere we are in Naples! Safe and sound,happy<br />\nand hungry! Eighteen days from New York!<br />\nI am simply upset with delight. It is all so<br />\nforeign, so fascinating. We have our own wheels<br />\nthrough the customs, uncrated, and ready for<br />\nthe start. I am convicted of seven months<br />\ncrammed full of live interest and experience, and<br />\nI see that at the start we shall pay for it!<br />\nFleeced three times to-day. Our first. This is<br />\nNaples.<br />\nor or or<br />\nTravel abroad, travel in Italy any rate, is<br />\nanother story from jogging across the States.<br />\nTo the novice it isn't any joke. We are paying<br />\nthe penalty of not speaking the language. Just<br />\nthe difference it makes, you will never understand until you try it. Don't! But we arc<br />\npicking up some phrases. In self-defense. Our<br />\nfirst: quanto costa? \"how much?\" And then,<br />\nits correlative, c troppo! \"Not on your life.\"<br />\nWe get along pretty well in the shops and can<br />\nhaggle 'em down. It is the waiter at the<br />\ncafe who beats you out. You eat your luncheon<br />\nand then he springs the surprise. It is a matter<br />\nof a franc. You swear it was not included in<br />\nthe order. He chatters at you nastily and<br />\nturns his back. You get mad. He shrugs his<br />\nshoulders. \"Non intendo.\" He does not understand you. What under heavens can you do?<br />\n<br />\nYou have your choice: pay up, or get in a row.<br />\nAnd there he has you dead. You have eaten his<br />\nWILLIAM P. SHRIVER.<br />\ncakes!<br />\n911- W<br />\n<br />\nTHE BALTIMORE CONCERT OF THE<br />\nMUSICAL CLUBS.<br />\nON Friday the 11th, the Baltimore Concert of<br />\nthe Musical Clubs was successfully given.<br />\nIn spite of the very unfavorable weather, a<br />\ngoodly number of Hopkinsonians and their<br />\nfriends was present. Every selection given received applause enough to justify an encore;<br />\nand, indeed the most severe criticism of the<br />\nconcert WaS made with reference to the length<br />\nof the program. A great many encores were<br />\nresponded to, and the evening was thereby<br />\nprolonged.<br />\nThe men were inspired by this encouragement,<br />\nand enthusiasm succeeded the anxiety at first<br />\napparent behind the scenes. The Clubs sang and<br />\nplayed with a spirit that put to rout the heavy<br />\npredictions of failure, aroused by the early date<br />\nset for the concert. Last year it was held March<br />\n23. In no year have the Clubs played in Baltimore<br />\nbelbre Lent. A great deal of credit is due to the<br />\nmanagement and to the individual members of<br />\nthe 1901 Clubs for the hard work they have<br />\ndone during the fall. On this evening Stephen<br />\nHarwood sang his last songs for the J H. U.<br />\nThe audience did not seem satisfied, even after<br />\nhe had appeared on the stage five times. Swindell was also warmly applauded for his \"Miss<br />\nPeoebe\" and for other selections.<br />\nThe Glee Club, with \"My Bed is like a Little<br />\nBoat,\" seemed to cause the greatest pleasure of<br />\nthe evening. This Club is now in fine form as a<br />\nresult of its good training. More first tenors,<br />\nhowever, would help the balance of the Club;<br />\nand every Hopkins man who can make a high<br />\nG is urged to apply.<br />\nThe Banjo and Mandolin Clubs gave excellent<br />\nperformances. They contain much good material, which will be even better next year, as a<br />\nlarge proportion of the men are now in their<br />\nfirst season.<br />\nThe next trip of the Clubs will be made to<br />\nAnnapolis on the 26th. The management is<br />\nbeing besieged .by requests for another Baltimore Concert, and it is hoped that one can be<br />\narranged<br />\n—R. S. L.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nHOPKINS IN THE INAUGURAL<br />\nPARADE.<br />\nTo all Hopkins Men:—<br />\njust a word now seems in order as regards our<br />\ndelegation to the Inaugural Parade of March<br />\n4th. Since it was unanimously decided at the<br />\nmeeting held in Hopkins Hall, Friday, January<br />\n11th, that we should contribute a delegation to<br />\nthe intercollegiate part of the parade, now is<br />\nthe time for every loyal Hopkins man to stand<br />\nby his University and help the good cause. And<br />\nnow that we have so enthusiastically started<br />\nout,let us do it right,and in such a manner that<br />\nevery one of us will feel proud to say that the<br />\nJ. H. U. delegation was the largest, the best<br />\nequipped, the best drilled, and altogether the<br />\nfinest body of college men in line. Many of the<br />\nother colleges have already signified their intention of being represented,so I am quite confident<br />\nthat we shall have many worthy associates with<br />\nus in line. When it is considered what are our<br />\nadvantages over the more distant colleges, it<br />\nshould make every fellow feel ashamed after the<br />\nfourth of March to admit that he was not one<br />\nof the sturdy grenadiers.<br />\nThe benefits arising from such a display are<br />\nmany. The most important of all is the advertisement and public notice that will be given our<br />\nUniversity. This in itself should be enough to<br />\narouse any latent feelings in knowing that by<br />\nthus exposing himself to the most enjoyable<br />\ntime of his life he is at the same time upholding<br />\nthe dignity and bringing renown to his college.<br />\nHere is where an excellent chance is afforded for<br />\ndisplaying our far-famed intellectual abilities.<br />\nBesides, the cost of the whole affair will amount<br />\nto so very little that the good time offered will<br />\namply repay the expenditure.<br />\nThe intention of the Committee is to provide a<br />\nbrass band to accompany us.—Right now let it<br />\nbe understood that the route of the parade will<br />\nextend only from the Capitol to the White House,<br />\nso there is no need of training for long distance<br />\nwalking.—To insure a quick passage to Washington special cars or a train if necessary, will<br />\nbe secured for our accommodation,and arrangements will be made with some restaurant so<br />\n<br />\n3<br />\n<br />\nthat dinner will be served immediately before<br />\nthe starting of the procession. The official uniform will be black and blue jerseys or sweaters,<br />\nand Hopkins hats, and a cane.<br />\nIf possible, small flags to be fastened on the<br />\ncanes will be presented each man, and banners<br />\nwill be secured for the festivous occasion.<br />\nTo do all this, more or less capital is absolutely required, hence the need of generous contribution from every man in the University. Even if<br />\nyou can't go you are interested in the welfare;<br />\ntherefore the need for a little generosity. Remember the only expense, outside of the purchasing of your costume, will be the dollar railroad fare and the price of a Washington dinner.<br />\nAnd now, dear sirs, I sincerely trust you comprehend the gravity of our cause and will notify<br />\nmembers of the committee at once that you will<br />\nmarch with us and help carry the glorious banner of our dear Alma Mater, giving evidence<br />\nthereby to President Mac. that we will stand<br />\nby him, even if some of us don't entirely believe<br />\nin his principles.<br />\n<br />\nJ. ABNER SAYLER,JR.,<br />\nChairman.<br />\n<br />\nA LIBERAL OFFER.<br />\nTrustees of the University have decided to<br />\nTHE<br />\noffer twenty Maryland Scholarships, in addition to those already offered in the catalogue.<br />\nThe offer is made for the academic year beginning September, 1901, and is for the benefit of<br />\nall parts ofthe State. Accordingly not more than<br />\none-half of the number will be awarded to residents of the city and county of Baltimore, and<br />\nnot more than one-half to those who are now<br />\nmembers of the University, as is seen by the last<br />\nclause. This offer is a rich one for next year's<br />\nFreshman class, as it is that class that will be<br />\nlargely benefitted by it. Considering the present financial condition of Hopkins, the offer is a<br />\nmost generous one, and it is to be hoped will go<br />\ntoward bringing the rural residents of Maryland to a realization of the fact that such a University as this extends its influence, not only<br />\nover Baltimore and Maryland, but over America<br />\n—ay, and over the world.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\n\"C be Ilews.ILetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nJANUARY 24, 1901.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief,<br />\n<br />\n10 cents a single copy.<br />\n.<br />\n<br />\n.<br />\n<br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br />\n<br />\n.<br />\n<br />\nNORMAN BOYER, 1901.<br />\n<br />\nJOHN M. BOOKER, 1901.<br />\n<br />\nI WILLIAM B. HILL, 1902.<br />\nEDEN C. HILL, 1902.<br />\nSOL STROME, 1902.<br />\nJOHN A. SLEMONS, 1902.<br />\n<br />\n1. .YMAN C. MURPHY, 1902.<br />\n.<br />\nJOHN M. BANDEL, 1901<br />\n<br />\n. AUBREY PEARRE,JR., 1902.<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to NORMAN BOYER.<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJoin; M. BANDEL, box 94,J H. U.; or box 395, Medical School of<br />\nJohns Hopkins Hospital.<br />\n<br />\nO<br />\n<br />\nUR withdrawal from the Intercollegiate<br />\nLacrosse Association this year has placed<br />\nus in a position of some embarrassment. We<br />\ncan not enter a league with Swarthmore and<br />\nLehigh, as some of our men would perhaps like,<br />\nbecause Lehigh is going to stick to Stevens, and<br />\nwe may not he able to accept the invitation of<br />\nthe northern Inter-University League on account<br />\nof some strange relations which we have with<br />\nSwarthmore. So we may be forced this season<br />\nto follow a policy of independence, and attempt<br />\nto maintain our previous standing as the superior of any college team that may be sent against<br />\nUS.<br />\n<br />\nTo do this will require the hardest kind of<br />\nwork, faithful and consistent practice, and intelligent following of the instructions of the<br />\ncoaches. The practice that has been going on<br />\nin the cage since the beginning of the term has<br />\nbeen very good in its way, but it has been desultory and participated in by too few men who<br />\nhave real ability and ambition to make the<br />\nteam. Captain Tyler is trying to interest the<br />\nmen in the work,but he is very much dissatisfied<br />\nwith the way in which they respond to his appeals. The Freshmen have always been very<br />\nenthusiastic supporters of lacrosse, and the<br />\npresent Senior and Junior classes furnished a<br />\nnumber of extremely valuable players to the<br />\nwinning teams of 1899 and 1900. The Freshmen this year have not as yet measured up<br />\n<br />\nto their opportunities, and only one or two men<br />\nfrom that class have done work sufficient to<br />\nwarrant serious consideration.<br />\nThe class of 1903 owes it to itself not to be<br />\nfound deficient in interest and to the University<br />\nnot to be remiss in its athletic duty.<br />\n-U<br />\nN another column we print a letterfrom J. Abner<br />\nSayler, Jr., Chairman of the Committee of Arrangements of the proposed Hopkins representation in the Inaugural Parade at Washington. We<br />\ntake pleasure in publishing his appeal for support of this movement. It is especially proper<br />\nthat we should have a fine representation there<br />\nor none at all. That we are to send a body of<br />\nmen to Washington to march has been determined upon. It would have been humiliating if<br />\nwe had not so determined, and will be if that<br />\ndetermination is not carried out. Being but<br />\nforty miles from the Capital, we should be able<br />\nto send a delegation equal to those of Harvard<br />\nand Yale, which are hundreds of miles distant,<br />\nand the absence of any place at all in the line<br />\nwould reflect badly upon our energy and importance as a college body.<br />\nThere is, too,one other most important reason<br />\nwhy Hopkins should be represented. It may not<br />\nbe known to all that credit for the suggestion of<br />\nthis whole scheme of intercollegiate participation is given to the McKinley Club of this<br />\nUniversity, which wrote some weeks ago asking<br />\nfor a place in line. To suggest a movement and<br />\nthen be unable to follow it up is not an encouraging state of affairs. Let the McKinley Club<br />\nlook to it that the movement is successfully<br />\ncarried out.<br />\nor w<br />\nThe concert of the Musical Clubs given at<br />\nLehmann's Hall on the eleventh was a very<br />\nenjoyable affair, and was generally considered<br />\nan improvement over that of last season. All<br />\nthe numbers were well rendered, and the progra.11 was arranged with evident taste. Harwood was in his best form, and his songs were<br />\nrendered in a style that proves that his voice has<br />\nlost none of its charm.<br />\nBut in the *ay of what may be helpful criticism, does it not seem that a little less of the<br />\nboisterous element might do just as well? Not<br />\n<br />\nI<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nthat we want the formality of a Boston Symphony by any means, but then you know things<br />\ncan be a little overdone sometimes.<br />\nsr sr sr<br />\nThe committee which is making arrankements<br />\nfor the Feed expects to introduce some new<br />\nfeatures which will make this year's affair differ<br />\nmarkedly from those of the past two seasons.<br />\nIt is to be hoped that they may be enabled to<br />\ncarry out their ideas, and that they may not be<br />\nimpeded by any false modesty on the part of<br />\nthose who are desired to participate. Every<br />\nfellow, especially the Freshman, should feel it a<br />\npleasant duty to assist in any way to make the<br />\nevening enjoyable. A determined effort is to be<br />\nmade to interest the Alumni in the affair,and no<br />\nstudent should remain away if it is possible for<br />\nhim to attend.<br />\nslif sir ser<br />\n<br />\nLONDON OPINIONS OF HOPKINS.<br />\n<br />\nONE,<br />\n<br />\nof the editors of this paper was the<br />\ncompanion for a brief hour one<br />\nnight last week of Mr. Alfred Harmsworth, the<br />\ndistinguished millionaire-editor of the London<br />\nDaily Mail, as he journeyed southward in his<br />\nparlor car attached to the special train enroute<br />\nfor St. Augustine, Florida.<br />\nMr. Harmsworth asserted his familiarity with<br />\nthe fame of the Johns Hopkins University and<br />\nits Medical School, and paid a tribute to the<br />\nrenown of Dr. William Osler of the Medical<br />\nFaculty. \"Your Medical School,\" he said, \"is<br />\nwithout doubt the best in this country, and as<br />\na heart specialist I believe that Dr. Osler is<br />\nperhaps the best in the world.\" Mr. Harmsworth asked a number of interesting questions<br />\nrelative to the actions of Hopkins students, and<br />\ninquired particularly where they rowed and had<br />\ntheir cricket field. He should have been invited<br />\nto stop off in this city and visit the University,<br />\nwhere no doubt any number of men would have<br />\nbeen only too willing to conduct their guest over<br />\nthe broad expanse of our magnificent athletic<br />\ngrounds and show him our champion crews<br />\npracticing their stroke on the bosom of that<br />\ngentle stream where the waters softly lap the<br />\npiers of Union Station and the Charles Street<br />\nbridge.<br />\n<br />\n5<br />\n<br />\nA STRAIN OF MUSIC.<br />\nMusic, they say, has charms to soothe the breast<br />\nOf savage beasts, or bend the knotted oak,<br />\nTo wake the soul that slumbers in its shell,<br />\nAnd noble hearts to noble deeds convoke.<br />\nThere is a strain of music, which at times<br />\nFloats to my ear from some dim,unknown source,<br />\nBefore whose pulsing notes my soul doth sink,<br />\nO'ercotne with sadness, longing and remorse.<br />\nTo free myself I cannot, nor yet would;<br />\nA fascination holds me in its power,<br />\nThis strange, wild sadness charms while yet it chides,<br />\nAnd sweetly mournful seems the flitting hour.<br />\nAnd then a change comes o'er this strange, wierd<br />\ndream;<br />\nI hear the roaring of the lonely woods,<br />\nThe north wind soughs with melancholy wail,<br />\nAnd nature shows the saddest of her moods.<br />\nIt is the long-stilled music of the past<br />\nThat strikes its mournful chord within my soul;<br />\nThough wild the source, yet pleasant are the notes,<br />\nThe tides of thought, how strange their ceaseless<br />\nflow<br />\n—N. B.<br />\n<br />\n\"HAS CHIVALRY DISAPPEARED?\"<br />\nTrIIE good knights of old<br />\nFought tournaments bold<br />\nFor prizes and praise and their<br />\nfair lady-loves;<br />\nEach brave man today<br />\nIs fighting his way<br />\nTowards riches and fame and<br />\nthe one maid he loves.—<br />\nIf the steel-clad and sword girted men<br />\nAnd we weaklings who wield but the pen,<br />\nBoth were asked if the gold or<br />\nthe girl or the glory<br />\nWere most worth our pain,<br />\nFrom fighters and scribblers would<br />\ncome the same story:—<br />\n\"The deeds arc the gain !\"<br />\nR. S. L.<br />\n.A6 .A6 JJ6<br />\n<br />\nThe trip of the Yale Glee, Banjo and Mandolin<br />\nClubs covered 8,000 miles, and concerts were<br />\ngiven at Pittsburg, Louisville, St. Louis,<br />\nChicago, Des Moines, Denver,Colorado Springs,<br />\nSalt Lake City, Oakland, San Francisco, Los<br />\nAngeles, Kansas City, Cleveland, and Albany.<br />\n—Yale Alumni Weekly.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS-LETTER.<br />\nHEARD IN THE REAR.<br />\n<br />\n44 IT'S too bad that the Clubs should have<br />\nsuch rainy weather to contend with; it<br />\nkeeps so many people away.\" Though Lehmann's Hall was not overflowing, the audience<br />\ncertainly was appreciative, and the Clubs met<br />\nwith a warm reception. Mr. Harwood's selections were especially well received, and remarks<br />\namong the 50—cent critics were in abundance<br />\nabout the easy time he would have on the stage.<br />\n\"We'll miss Harwood next year, he is going<br />\nto be—i. e.; he is going to resign from the<br />\nClubs; but say isn't he great? why did they<br />\never place him before Swindell on the program?<br />\nSwindell is good, even excellent; but then,<br />\nHarwood is great, and they ought to have<br />\nknown the difficulty Swindell would have in<br />\novercoming comparisons with Harwood. Swindell is working hard, and is doing fine work:<br />\nhe will be a good end man next year.\"<br />\nw or or<br />\nWhen the Soldier Song from Princess Chic<br />\nwas rendered by the Glee and Mandolin Clubs,<br />\nensemble, Mr. Swindell sang with great spirit<br />\nand enthusiasm. Several of the rear enders<br />\nimmediately took up the air, and still we hear<br />\nit. \"That's a great air for a college song. I<br />\nwish I could write lyrics, I would put words to<br />\nit. That is just the kind of air we need.\" The<br />\nsuggestion was good, and there are others with<br />\ndesires to write lyrics.<br />\n<br />\n\"The quartet is excellent, and those new<br />\nsongs are delightfully funny. Sorry that they<br />\nhave no more.\" That was the consensus of<br />\nopinion of the standing roomers,and apparently<br />\nof the whole audience. In fact the Glee Club<br />\nstood at the head of the performance both in<br />\nquality and quantity. All their selections except<br />\nMy Lady Lu were modern, and what that<br />\nlacked in newness was made up by its melody<br />\nand spirit. So early in the season when so few<br />\nof the comic operas have stood the test of<br />\nBaltimore audiences,it is difficult to select pieces<br />\nthat are \"catchy,\" without recourse to resurrecting by-gone successes, and when so many<br />\nencores are demanded the difficulty is made<br />\ndouble.<br />\nWW<br />\n<br />\nThe gentleman from whom the Mandola was<br />\nprocured made his appearance late in the evening,<br />\nand was much surprised at the efficient manner<br />\nin which Mr. Edgeworth Smith handled it.<br />\n\"That is the only one in the country, in fact,<br />\nthe only one ever made here, and we were lucky<br />\nin getting hold of it. Mr. Smith came down<br />\ntwo days ago, and wanted to tackle it in the<br />\nconcert, and though we very much feared that<br />\nthe undertaking was too difficult we willingly<br />\noffered the Mandola to him. So there he is<br />\nplaying it now, and playing it well.\" It certainly sounded weird and odd to hear the deeptoned instrument play a solo for the first few<br />\nbars of Slippery Quaker, but it was a novelty<br />\nthat pleased.<br />\nOr<br />\n<br />\n\"The Banjo Club is playing in great time, and<br />\nis getting more music out of the instruments<br />\nthan you generally hear from a banjo. It seems<br />\nto me that they are beating last year's work.<br />\nLast year the Mandolin Club was far superior<br />\nto the Banjo Club, but this year the Mandolin<br />\nClub has fallen off somewhat. They do not<br />\nplay as softly, or with such continuity; there<br />\nis too much individual work, and too many<br />\nstrums'—to use Stephen Crane's word. The<br />\ntime is good, but the result does not give one<br />\nthe orchestral effect that it did last year.\" The<br />\nman who uttered these remarks just then went<br />\nout, and I do not know whether he was a<br />\nmusical critic or not.<br />\n<br />\nW<br />\n<br />\nAfter the concert was over, it was the general<br />\nopinion that on the whole it was a most enjoyable and creditable performance. The selections<br />\nwere good; the renditions with so little training<br />\nexcellent; and as for quantity, the thirty pieces<br />\nshould have furnished a variety fit for all sorts<br />\nand conditions of hearers. Again the University<br />\nmust thank the men and the leaders for their<br />\nefficient work.<br />\nS., '02.<br />\nor or or<br />\nIt is a good • thing to heap coals of fire on the<br />\nheads of your enemies, but don't burn your<br />\nTiger.<br />\nfingers doing it.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nHULLABALOO, 1901.<br />\ndesire to register a<br />\nWE\"Hullabaloo.\"<br />\n<br />\nplea for the 1901<br />\n<br />\n7<br />\n<br />\nbelieve that if we look closely we shall discover<br />\na definite place for 1901. That place is at the<br />\ntop.<br />\nJ.<br />\n<br />\nGRESHAM MACHEN,<br />\n<br />\nEditor-in-Chief of 1901 \"Hullabaloo.\"<br />\n<br />\nIn every institution, the college annu'al regis.116 .116 .A6<br />\ntering as it does the various student activities,<br />\nSEE,<br />\nTHE<br />\nCONQUERING<br />\nHERO COMES!<br />\nfills a considerable place in forming the opinions<br />\nof outsiders with regard to the enterprise and AT this, the dawn of the twenty-fifth anniverpublic spirit of the students.<br />\nsary of the founding of the Johns Hopkins<br />\nA well arranged Hullabaloo with plenty of University, there enters its portals one whose<br />\nclever drawings and plenty of bright \"stunts\" name has reached across the continent,and penof all kinds will induce an outsider to believe etrated the hearts of the capitals of Europe.<br />\nthat the student body at Hopkins is also bright One, who tho' born in a foreign clime, and<br />\nand clever; but a Hullabaloo that seems to whose ancestors were of obscure and lowly<br />\nhave great difficulty in filling out its allotted origin, has surmounted all obstacles, climbed,<br />\nnumber of pages and that shows a scarcity of rung by rung, the ladder of fame, and now<br />\nwit both in drawings and in contributions, will stands at the topmost pinnacle of glory. One<br />\nbe attributed either to the dullness or to the lazi- whose achievements have been the result of<br />\nness of the student body. Now the board of edi- years of patient toil and unceasing diligence,<br />\ntors does not desire to shirk any responsibility, and whose name has become a household word<br />\nbut we believe that bv an outsider,the success or alike in the palaces of the rich, and in the hovels<br />\nfailure of the book will be attributed largely to of the poor. The wonders of this being have<br />\nthe students in general; therefore we urge every occupied the minds of all, from the crowned<br />\none of every class and every department to try heads of Europe, to the school boy bending o'er<br />\nhis hand at some form of contribution. It is no his task. Yet no monument of literary fame has<br />\nhe bequeathed the world. No sculptured bust<br />\nexcuse to say that you don't believe you have or shrined urn bear testimony of a life devoted<br />\nthe talent. You will never know unless you try. to art. No far reaching and beneficent reforms<br />\nIn a publication like the Hullabaloo, if the book tell of a life spent in the uplifting of mankind.<br />\nis practically written by a few men, no matter But despite all this, fame is his reward. And<br />\nhow bright tliey may be, there is apt to be a how does he receive these outbursts of applause,<br />\nthese approbations of the masses? With calm<br />\n• wearing sameness. In the Hullabaloo, more and unruffled dignity, he gazes down upon the<br />\nthan anywhere else, there must be variety, and \"madding crowd,\" with mind no longer intent<br />\nvariety can only be secured by a large number upon earthly and material things,and with ears<br />\nof contributors. If the editors are forced to do deaf to praise.<br />\nWho is the mighty one ?—even HAM JR.<br />\nall the work themselves, their supply of ideas<br />\nW. B. H.<br />\nwill inevitably run dry, and the results will be<br />\ngoir<br />\ndisastrous. In many cases variety will supplant<br />\nTHE MODERN VERSION.<br />\nintrinsic merit. Contributions from outsiders<br />\nin some cases may be welcomed instead of better<br />\nLittle Miss Muffet,<br />\nShe sat on a tuffet<br />\ncontributions from the editors, because the forBating her curds and whey.<br />\nmer have the inestimable merit of being different.<br />\nBut a boa constrictor<br />\nCame along and kicked her,<br />\nAccordingly in the next few weeks (which will<br />\nAnd frightened Miss Muffet away.<br />\ndecide the character of the book), we urge every—Y. Y. Y.<br />\nsr sr sr<br />\none to do his best. If we all pull together in a<br />\nA STOCK TICKER.<br />\nhearty, enterprising way we can make the 1901<br />\nHullabaloo even better than the succession of<br />\n\"Mr. Rockfeller makes a dollar every time his<br />\nexcellent books which have gone before. Our clock ticks.\"<br />\nannuals have always compared very favorably<br />\n\"I'd like to own that clock!<br />\n—Harvard Lampoon.<br />\nwith those of any college in the country, but I<br />\n<br />\n411/<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\nTHE COMING FEED.<br />\n<br />\nannual athletic feed, in honor of recent<br />\nTHE<br />\nvictories in various branches of sport will<br />\n<br />\nuary,the titles of which are still secret, will then<br />\nbe presented.<br />\nThe famous Hopkins Trans-Oceanic Star<br />\nSpecialty Company of Presdigitateurs, composed largely of Messrs. Swindell and Sayler,<br />\nwill present one of their latest original creations, the title of which will be known later.<br />\nThere will also be various stunts in the Cage,<br />\nprominent among which is an amateur fisticuff<br />\naffair with blackened gloves. Then all present<br />\nwill adjourn to the \"Palm Garden\" (or rather<br />\nthe Gym), where an extensive variety of tempting delicacies prepared specially for the occasion<br />\nwill be served. After this there will be a rousing<br />\nsong to dear old J. H. U., and the amusement<br />\nfor the evening will be complete.<br />\nThis entertainment is one of the events in connection with our University which every member of the student body should consider it his<br />\nduty to attend, as its success will be greatly dependent upon a large attendance.<br />\nBegin saving up now.<br />\n<br />\ntake place in the Gymnasium on Friday evening,<br />\nFeb. 1st.<br />\nNothing very definite as to the \"modus operandi\" has yet been learned, but from certain<br />\nreports which have leaked out, the program<br />\npromises to be very entertaining, and will probably be arranged somewhat in the following<br />\nmanner:<br />\n1st. Addresses by President Gilman, Dean<br />\nGriffin, Professor Remsen, and Dr. Renouf.<br />\nAfter these addresses, the Musical Clubs will<br />\nrender a few \"sacred\" airs apropos of the<br />\noccasion. Then Billy Maddren will hypnotize<br />\nsome of his colored friends, and thus compel<br />\nthem to perform feats, the nature of which is<br />\nstill unknown. Next comes the presentation of<br />\nthe \"H's\" to those men whom the Athletic<br />\nBoard has deemed worthy of this honor. To<br />\nVi 91W<br />\nfollow this solemn ceremony, certain features<br />\nTEAM.<br />\nTRACK<br />\nTHE<br />\nhave been proposed, which if carried out will<br />\nprobably be the star features of the program.<br />\ntrack-and-field squad is beginning to<br />\nThe following \"pieces\" have been selected, and<br />\nshow the first indications of individual prowill be presented in the form of tableaux with<br />\ngress. The old men still in the University are<br />\nall modern attachments and apparatus, which<br />\nbeginning to appear for regular practice, but<br />\nthe committee has spent a considerable amount<br />\nthe new ones under the direction of Messrs.<br />\nof time and money in procuring.<br />\nMackdermott and Garrett,Hoffman and Wroth<br />\nThe actors involved will appear for the first<br />\nhave been working religiously for some time<br />\ntime in America, to the great delight of their<br />\npast. Mr. Garrett has been out several times<br />\nmany enthusiastic admirers, who will be present<br />\nin the past two weeks with the candidates<br />\nto welcome them. The proposed selections are:<br />\nfor the weight events, and the prospects in<br />\n1st. \"The Stair Scene from Sapho,\" a brilthis department are a little brighter than in<br />\nliant scenic production with latest Parisian<br />\npast seasons. Among the heavy men at work<br />\nalterations.<br />\nare Blanck and Finck, who played on this sea2nd. \"The Death of Little Eva.\" (Uncle<br />\nson's foot-ball team, and Stone and Scholl of<br />\nTom's Cabin.) A word to the wise is suffilast year's team.<br />\ncient, and it need only be added that each man<br />\nIt is to be expected that at least one of them<br />\nshould bring an extra handkerchieffor the tears<br />\nwill develop enough form to win some place<br />\nthat will issue forth as Eva \"shuffles off this<br />\namong the weight men of the other clubs of<br />\nmortal coil.\"<br />\nBaltimore. Mr. Garrett himself will, of course,<br />\n3d. \"The Dying Gladiator,\" a truly prosaic<br />\nhe a competitor in the coming meets.<br />\nreproduction of Grecian art with some material<br />\nIn track work, among the new candidates<br />\nalterations.<br />\nHoward Matthai, a Freshman, shows good<br />\n4th. \"The Discus-Thrower in Repose,\" by starting form and others of the Freshman squad<br />\nthe best living representative of the original are doing well. Pessagno, the broad jumper, is<br />\nOlympian hero. Other specimens of Greek stat- also running with the track squad.<br />\n<br />\nTHE<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nGEORGETOWN AND B. A. C. GAMES. be a very slow event owing to the fact that the<br />\nANNOUNCEMENTS have been made of the<br />\nannual indoor athletic meet of the Georgetown University and of the annual games of the<br />\nBaltimore Athletic Club.<br />\nThe Georgetown games are scheduled to be<br />\nheld in Convention Hall, Washington, on Saturday, March 2nd. The games are under the<br />\nmanagement of Messrs. C. M. Barry and M.<br />\nJ. Thompson.<br />\nThe completion of Georgetown's new indoor<br />\ntrack has added no little enthusiasm to the<br />\ntrack men. The path, which is laid in the basement, is 75 yards straight-away, and is considered by many an innovation far in advance<br />\nof college indoor tracks elsewhere.<br />\nThe games of the Baltimore Athletic Club<br />\nwill be given in the Fifth Regiment Armory on<br />\nthe night of Saturday, February 16th. The<br />\nevents will be both open and inter-scholastic<br />\nand will probably be as follows:<br />\n40-yard dash.<br />\nRelay race.<br />\n220-yard dash, inter-scholastic.<br />\n440-yard run.<br />\nRunning high jump.<br />\nPole Vault.<br />\nStanding broad jump.<br />\n16 pound shot.<br />\nWrestling.<br />\n125 pound special.<br />\nLight weight.<br />\nMiddle weight.<br />\nHeavy weight.<br />\nIt is most probable that the track and field<br />\nevents will be handicap, and first and second<br />\nprizes, which will be handsome gold medals,<br />\nwill be awarded. The wrestling will be for the<br />\nchampionship of the Atlantic Division of the A.<br />\nA. U.<br />\nThe committee in charge consists of the following: G. E. Lamb, chairman; P. L. Small,<br />\nA. G. Lawrence, Dr. B. Merrill Hopkinson,<br />\nand LeRoy Gresham.<br />\nHopkins will enter men in all the track and<br />\nfield events except the 220-yard dash which is<br />\npurely interscholastic, and the standing broad<br />\njump which Director Mackdermott thinks will<br />\n<br />\nonly man in the Union who is able to do anything in this line is Glenny of the B. A. C., who<br />\nwas defeated last year in the annual games by<br />\na Washingtonian.<br />\nThe team will be chosen from the following<br />\nmen:<br />\n40-yard dash,—Watson, Matthew, Brem,<br />\nHazlehurst,Garret,Beeuwkees,Tootle,Pessagno,<br />\nRiggs.<br />\n440-yard run,—W. E. Hoffman, Jr., Captain;<br />\nEngland, Weedon, Smith, Tyler, Beeuwkees,<br />\nBarret, Plaggmeyer, Thatcher, Riggs.<br />\n880-yard run,—Wroth, Hayden, Thatcher,<br />\nZimmerman, Abercrombie, Riggs.<br />\nRelay Race,—Hoffman, England, Thatcher,<br />\nTyler, Smith, Beeuwkees, Plaggmeyer, Pessagno.<br />\nRunning high jump,—Scholl, Brem, Weed on<br />\nSimmons, Garrett, Pessagno.<br />\nPole Vault,—Brem, Simmons, Fishach.<br />\n16-pound shot.—Garrett,Finck,Stone, Blanck,<br />\nScholl.<br />\nOther men who are working hard but have not<br />\nas yet been assigned to any of the events are:<br />\nBaetjer, Branch, Koppleman, Miller, Adler,<br />\nWinternitz, and Moore. As soon as possible<br />\nMr. Mackdermott will decide what these men<br />\nare able to do and will then say what their part<br />\nshall be in helping to \\vin places for \"old Tommy<br />\nHopkins.\"<br />\nThe men who will go to Georgetown will also<br />\nhe picked from the above mentioned.<br />\nRev. Julius Hoffmann, who instructs the class<br />\nin Major German, is now giving a course of<br />\nlectures at the Polytechnic Institute on the<br />\nhistory of Germany, her great men, etc. The<br />\ncourse is for the benefit of the teachers of the<br />\nEnglish-German schools of this city.<br />\nslIr sir Of<br />\n<br />\nThere has been a new system formed at<br />\nHarvard under which retired professors may<br />\nreceive pensions.<br />\n,A6<br />\n<br />\n.116<br />\n<br />\nSyracuse University has offered six free scholarships to Filipinos, and the University of Chicago offers free tuition to ten Porto Ricans.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nHOPKINS HAPPENINGS.<br />\n<br />\nON Saturday January 19th, at a Field Night<br />\nof the Johns Hopkins Club, Dr. Harry<br />\nFielding Reid gave an illustrated lecture on<br />\nMaryland roads.<br />\nw w<br />\nOn January 18th, Mr. Howard Crosby Butler,<br />\nLecturer on Architecture at Princeton University, delivered a lecture on \"The Deserted Cities<br />\nof Syria.\" This was the beginning of the second<br />\nseries inaugurated by the Baltimore Society of<br />\nthe Archwological Institute of America.<br />\nwww<br />\nA new class in Italian Conversation has been<br />\nstarted under the directorship of Father Gabriel<br />\nUrsani, of Bagdad. The class is divided into<br />\ntwo sections: one, on Monday at 5 P. M. for<br />\nbeginners, and one on Thursday and Friday<br />\nafternoons for those who have a rudimentary<br />\nknowledge of the language.<br />\nww<br />\nThe following gentlemen have been awarded<br />\nUniversity Scholarships for the current year:<br />\nG. 0. Berg, Minnesota; A. E. Curdy, Michigan;<br />\nP. H. Edwards, Baltimore; J. Embry, Texas;<br />\nJ. A. E. Eyster, Maryland; J. G. Hun,New York;<br />\nJ. W. Harry, Maryland; H. Kurrelmeyer, Maryland; G. W. Middlelcauff, Maryland; B. LeRoy<br />\nMiller, Iowa.<br />\nwww<br />\nDr. James W. Bright, director of the department of English, has received from England<br />\nseveral copies of photographs of the great bronze<br />\nstatue of Alfred The Great that is soon to be<br />\nerected in honor of the great Saxon.<br />\nw sor w<br />\nProf. Ernst von Halle of the University of<br />\nBerlin was a visitor here last week. He was<br />\nshown over the buildings and introduced to the<br />\nheads of the departments by President Gilman.<br />\nProf. von Halle is distinguished in Europe for<br />\nhis work in Economics, and is here to study the<br />\nconditions in the South.<br />\nwww<br />\nThe current number of the Review of Reviews<br />\nedited by Dr. Albert Shaw, a Hopkins graduate,<br />\ncontains an interesting account of \"Dr. Gilman<br />\nand the Johns Hopkins University.\"<br />\n<br />\nAt a meeting held on Tuesday last, Mr. Machen<br />\nand Mr. Stone, chairmen of the Senate and<br />\nHouse Debating Teams respectively, agreed on<br />\nthe following question for the Inter-class debate<br />\nin March: Resolved, \"That the United States<br />\nshould construct, own, operate, and control an<br />\ninter-oceanic canal by way of Nicaragua.\"<br />\n<br />\nMr. John G. Campbell, Speaker of the Hotise<br />\nof Representatives, has selected the following<br />\ncommittee to arrange the annual trip of the<br />\nHouse to the session of Congress at Washington:<br />\nPeregrine Wroth, Chairman; John A. Slemons<br />\nand Ross M. Diggs.<br />\nWWW<br />\n<br />\nNext Tuesday, January 29, the first lecture of<br />\nthe series on Maryland Colonial History, provided for by the liberality of \"The Maryland<br />\nSociety of The Colonial Dames of America\"<br />\nwill be delivered by Prof. Charles W.Sommerville,<br />\na graduate of Hopkins,on \"Francis Nicholson.\"<br />\nDr. Sommerville will deliver five more lectures<br />\non Maryland men of Colonial days in McCoy<br />\nHall, on the following Tuesdays at 5 P. M.<br />\nWWW<br />\n<br />\nIt was decided at the mass-meeting held on<br />\nFriday, January 11,that, provided a sufficiently<br />\nlarge delegation would go, Hopkins should be<br />\nrepresented in the Inaugural Parade at Washington on March 4. Dr. Renouf, who called the<br />\nmeeting,impressed upon the students the advisability of a large body of students in the parade,<br />\nor none at all, for in that long review we shall,<br />\nfiguratively speaking, be marching before the<br />\neyes of the whole country. J. Abner Sayler,<br />\n1901, was elected chairman of the committee<br />\non arrangements, with power to choose associate<br />\nmembers. He has appointed Harry S. Byrne,<br />\n1901, R. T. Crane, 1902, and R. C. Hoffman,<br />\n1903, members of the committee, and will announce the graduate and medical members later.<br />\n<br />\nWilliam Payne Shriver, 1901, has been elected<br />\nto the editot:ial board of the Hullabaloo to fill<br />\nthe vacancy caused by the withdrawal of William McCully James.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nTHE UNIVERSITY COLORS.<br />\n<br />\nI1<br />\n<br />\nTHE MOMENTS THAT HAVE PASSED.<br />\n<br />\nISTEN, as the clock is ticking,<br />\nTo the Editor:—<br />\nThrough the live long day,<br />\nOn page 45 of the little Y. M. C. A. year book<br />\nWatch the hands move slowly onward,<br />\nis the sentence: \"Gold and Sable have been<br />\nAs each hour doth wear away.<br />\nofficially adopted by the trustees as the colors<br />\nSlowly sinks God's golden courier,<br />\nof the University, but, by usage of the students<br />\nSwiftly gathers twilight's gloom,<br />\nHomeward wends the weary reaper,<br />\nin their athletic organizations, Black and Blue<br />\nAnd another day is gone:<br />\nhave come to be considered the distinctive<br />\nGone, and so are others going,<br />\ncolors.\" Such a state of affairs necessarily gives<br />\nAnd will go, while time doth last,<br />\nus two sets of colors; the Black and Gold which<br />\n'Tis the present should concern us, not<br />\na student, until he sees some official notice,<br />\nThe moments that have passed.<br />\nwould not recognize as belonging to his Alma<br />\nTicking, ticking, ticking, slowly,<br />\nMater, and our own distinctive Black and Blue,<br />\nYet how swiftly moments fly,<br />\nEver passing onward, onward,<br />\nat sight of which every true Hopkins lad will<br />\nAnd we do not question why ?<br />\ndoff his hat and is ready to shout a \"Hullabaloo.\"<br />\nAre we moving past as driftwood,<br />\nIt is no wonder that Hopkinsians should feel<br />\nListless, heedless of the time,<br />\nthat the Black and Blue is their emblem—Black<br />\nAre we bending like the Sapling,<br />\nand Blue that for years has been waving on our<br />\nOr resisting, like the Pine?<br />\nIn the garden of God's wisdom,<br />\nathletic teams to hard-won victory, or comTake firm root and hold it fast.<br />\nforting them in case of defeat; Black and Blue<br />\nNow's the time, too late to trouble,<br />\nintercollegiate<br />\nlacrosse<br />\nthat has landed the<br />\nWith the moments that have passed.<br />\nchampionship of the United States for three<br />\nIn the springtime of existence,<br />\nsuccessive years; Black and Blue that each prosThat's the time to sow the seed,<br />\npective Hopkins Freshman, while yet grinding<br />\nWork thy field with care and patience,<br />\nat the prep. school, salutes in love and awe!<br />\nPass by not a single weed.<br />\nEven single roots of thistle,<br />\nBlack and Blue belongs to us, and to no one<br />\nMay spread trouble all about,<br />\nelse. We can have no feeling for colors that,<br />\nSo in life, small things cause sorrow,<br />\nbelong<br />\nto<br />\nBlack,<br />\nunder the name of Orange and<br />\nNow's the time to root them out.<br />\nat least three are four other Colleges. Yet<br />\nOpportunity conies kldorn,<br />\neverytime a Hopkins fellow desires to purchase<br />\nIt may not, cannot last,<br />\nTake it, do not let it Mingle,<br />\na flag, a cushion or a picture he is shown the<br />\nWith the moments that have passed.<br />\ninevitable Gold and Sable, and he must either<br />\nor<br />\nTake<br />\nthis lesson to thy heart,<br />\ntake colors for which he has no enthusiasm<br />\nIt<br />\nis<br />\nsad but true,<br />\nthe<br />\ndo without any. We go to the games, see<br />\nAll thy life cannot be springtime,<br />\ndown<br />\nthe<br />\nBlack and Blue jerseys moving up and<br />\nThere must come a winter too.<br />\nfield in battle for a Black and Blue banner, we<br />\nIf thou hast done thy duty,<br />\nwave our hats of Black and Blue silk; but if<br />\nCahn and peaceful wilt thou sleep,<br />\nFor 'tis written in the scriptures,<br />\naccidentally we lose a wager to one we escort,<br />\n\"As thou sowest, thou shalt reap.\"<br />\nand wish to pay it in something Hopkins, the<br />\nLife<br />\nis ever ebbing onward;<br />\nstore—keeper politely shows us the Gold and<br />\nVainly, vainly, we may ask<br />\nSable.<br />\nFor the chances swept far from us,<br />\nTo say the very least, this double set of colors<br />\nWith the moments that have passed.<br />\nN. F. N., JR.,'02.<br />\nis inconvenient to the students. Perhaps it was<br />\nWW<br />\nBlue<br />\nwrong for the students to use Black and<br />\nTEACHER.—\"John, where is the rock of Gibralin athletics, but now that we have done so, is it<br />\ntar, and to whom does it belong?\"<br />\nnot possible for those colors to be ours not only<br />\nJOHNNY (after deep thought).—\"It's in Newark,<br />\nin athletics,but also officially? this is a question<br />\nbelongs to the Prudential Life Insurance<br />\nand<br />\nwhich is respectfully submitted to those who<br />\nCo.\"—Princeton Tiger.<br />\n—B. O. K.<br />\nmay have charge of the matter.<br />\n<br />\nL<br />\n<br />\n\fCLINTON P. PAINE<br />\nGORDON P. PAINE<br />\n<br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br />\n<br />\nCLINTON P. PAINE<br />\nBANKERS<br />\n<br />\nAND<br />\n<br />\nNEW YORK AND CHICAGO.<br />\n<br />\nBROKERS,<br />\n<br />\nSMOKE UP! RAH! RAH! RAH! HOPKINS!!<br />\nIF<br />\n<br />\nANYTHING IN TOBACCO YOU WANT<br />\n<br />\n17OR Class, Fraternity and College Stationery, Banquet Cards,<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nThe Chas. Willms Surgical Instrument Co.<br />\nBENJ. A. NELSON, GEN'L MANAGER.<br />\n<br />\n'Physicians,' Surgeons,' Hosplial and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n<br />\n833 MADISON AVENUE<br />\nBOX TRADE A SPECIALTY.<br />\n<br />\nDrovers & Mechanics National Bank of Baltimore.<br />\nCapital.Stock $300,000.<br />\n<br />\n229 N. eHARLES ST.<br />\nMASONIC TEMPLE.<br />\n<br />\nI. D. LANG, TOBACCONIST,<br />\n<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br />\n<br />\nJAS. H. DOWNS,<br />\n<br />\nCO,<br />\n<br />\n(Sr<br />\n<br />\n217 EAST GERMAN STREET,<br />\nBALTIMORE, MD.<br />\n<br />\nPR1VAIE WIRES TO<br />\n<br />\nGO TO<br />\n<br />\nCALL<br />\n<br />\n300 N. HOWARD ST.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMUELLER,<br />\n<br />\n5 WEST LEXINGTON ST.<br />\nI LONDON STUDIO.)<br />\n<br />\nSurplus and Profits, $350,000.<br />\n<br />\nFINEST PHOTOGRAPIC WORK<br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\nSew/a<br />\n<br />\n270,oosit ...910-tros -For<br />\n<br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br />\n<br />\nA. FL FETTING,<br />\n14<br />\n<br />\nAND 16<br />\n<br />\nIN THE CITY.<br />\n<br />\nPcn, yra.00 0,1o,21„u ton.rd.<br />\n<br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br />\n<br />\nJ. D. Wheeler, Cashier.<br />\nChas. S. Miller, Ass't Cashier.<br />\n<br />\nMANUFACTURER OF<br />\n<br />\ncreek Letter Fraternity<br />\njewelry.<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes RS follows regarding the<br />\n<br />\nMASON & HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nrank.\"<br />\n(Signed)<br />\nMoarrz MoszKoWSKI.<br />\n<br />\nST. PAUL STREET.<br />\n<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\nC. H. Hildebrandt & Son, Sole Agts.<br />\n<br />\nNLW YORK TO BREMEN,<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nof 9r or CABIN PASSAGE AT LOW RATES.<br />\n<br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA. ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nA. SCHUMACHER & CO<br />\nGeneral Agents.<br />\n<br />\nFor particulars apply to<br />\nk3 k3 SURETY BONDS<br />\n<br />\nkJ<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nDIRECT.<br />\n<br />\nthe Kranz-Smith<br />\npiano CO.<br />\n<br />\nAO<br />\n<br />\n'Fidelity and Deposit Company of Maryland,<br />\n<br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br />\n<br />\nDickering, Bradbury and Webster<br />\n<br />\nite Pianos. itit<br />\nC. eic. P. Phone 2322-2.<br />\n<br />\nFactory Price.,<br />\n<br />\nBARTLETT, HAYWARD IS0 CO.<br />\n+ 'founders and Engineers, *.<br />\nWorks, Pratt and Scott Sts.<br />\nOffice Calvert and German Sts.<br />\nManufacturers ofCast and Wrought Iron Work fiir Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults 111111 Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, lint Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers, etc. Columns, Plates, Girders. Beams and Beam<br />\nGirders, Wrought Iron Roof rratning and Road Bridges.<br />\nCHARLES AND LEXINGTON STS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES.<br />\n<br />\nEDWIN WARVIELD, Pres't.<br />\nist Vice-Pres't, II. Crawford Black.<br />\n2nd<br />\n\"<br />\nJos. R. litonebraker.<br />\n\"<br />\n3rd<br />\n'rhos. A. Whelan.<br />\n<br />\nH. E. BOSLER, Sec'y-Treas.<br />\n11 arry Nicodem us,<br />\nAss't Sec'y-Trcas<br />\n<br />\nBOOKS<br />\n<br />\nOld and<br />\n<br />\nThe oldest Old Book Store, and thc largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\nW M. V. PIPPF.N,<br />\n<br />\n605 N. Eutaw St.<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\n44figelus,P Automatic Attachments for<br />\nPianos.<br />\nREGINA MUSIC BOXES.<br />\nGRAMOPHONES, ETC,<br />\n<br />\n\"Washburn\"<br />\n<br />\n201-203 N. CHARLES STREET<br />\n<br />\nLUNCH ROOMS!<br />\n<br />\nHARRY T. mUlTh'S<br />\n<br />\nTIlE<br />\n1.IC11-IT LUNCH ROOM,<br />\n<br />\n122 NORTH HOWARD STREET,<br />\nOYSTERS IN ALL STYLES.<br />\n<br />\nYOUR PATRONAGE SOLICITED.<br />\n<br />\n\fSNVITH, DIXON & CO.<br />\n<br />\noe PAPER 04<br />\n<br />\n311 N.CHARLES ST<br />\n')<br />\n'rLiZ9<br />\n.<br />\n21f<br />\n;<br />\n<br />\n29-31 S_ CHARLES ST_<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\n<55-7<br />\n<br />\nLAGER BEERS<br />\n'<br />\n4P)<br />\n(V;<br />\n'<br />\n<br />\nBoldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market,<br />\n<br />\nWm. B. Oliver.<br />\n<br />\nJ. Wm. Middendorf.<br />\n<br />\nMIDDENDORF OLIVER & CO.<br />\n<br />\nROCHESTER, N. Y.<br />\n<br />\nBARTHO LOMAY'S Is THE Bohemian<br />\n• ORIGINALAND FAMOUS<br />\n<br />\nROCHESTER B EE R-. Bavarian<br />\nfflaerzen 13tfau<br />\nApollo<br />\n<br />\nBALTIMORE<br />\n• B RA NC H<br />\n,GEO.C•S LICRO•<br />\nMANAGER • •• •<br />\n<br />\n2015 EAST GECRIVIA.N STHEIECT,<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br />\n<br />\nOffice and Depot, 227-239 S. Central Avenue.<br />\n<br />\nMD.<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\n6111s for<br />\nBrides<br />\n<br />\nGEO. C. SUCRO, Sole Agent.<br />\nC. & P. Telephone 1060<br />\nHome Telephone 2060<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br />\n<br />\nIN GREAT VARIETY.<br />\n<br />\nJAC0113I 4* JENKINS,<br />\n216 N. CHARLES ST.<br />\n<br />\n®<br />\n<br />\n217-239S.1ENTILlid:AVE<br />\n<br />\nBankers and Brokers,<br />\n<br />\nWedding SilverI<br />\n<br />\nBartholomay Brewery eo.<br />\n<br />\nATLANTIC TRANSPORT CO.<br />\n<br />\nit<br />\n<br />\nSilversmiths.<br />\n<br />\n1 BROADWAY<br />\n<br />\n403-409 WATER ST.<br />\n<br />\nNEW YORK.<br />\n<br />\nBALTIMORE.<br />\n<br />\nHENDERSON'S<br />\nUNIVERSITY<br />\n<br />\nLawrence B. Kemp, President.<br />\n<br />\nWilson<br />\n<br />\nKeyser, Cashier.<br />\n<br />\nCaffiffiEliCIFIL & FARRIERS NOTIONFIL BANK,<br />\n<br />\nBOOK STORE,<br />\n<br />\nHOWARD<br />\n<br />\nAND<br />\n<br />\nGERMAN<br />\n<br />\nSTREETS,<br />\n<br />\nBALTIMORE, MD.<br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENTS SUPPLIES.<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nHABERDASHERS<br />\n<br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nJAMES<br />\n<br />\nTHEO. WARNER,<br />\n<br />\nR. PAINE.<br />\n<br />\nWARNER & CO.<br />\n<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nUMBRELLAS, Q HATTERS, Q CANES, ETC<br />\nHIGH GRADE C.4.9e1DS LOW PIIICF.S.<br />\n203<br />\n<br />\nAgents for Lincoln& Bennett and Walter Barnerd,s London Hats.<br />\n324 W. 13A.1../TINI0RE STREET.<br />\n<br />\nW. BALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nSilk and Cassimere Hats.<br />\n<br />\nphotographs<br />\n<br />\nligenfritz<br />\nStudio.<br />\n<br />\nGushing st companu,<br />\n<br />\n<Air<br />\n'CHOPKINS<br />\n<br />\nnil:.<br />\n<br />\nCAPS.<br />\n<br />\nLELREs<br />\nRS A<br />\n<br />\n34 W. BALTIMORE STREET.<br />\n<br />\nSUCCESSOR<br />\n20<br />\n<br />\nWEST<br />\n<br />\nTO<br />\n<br />\nCUMMINS<br />\n<br />\nLEXINOTON<br />\n<br />\nwriaeT.<br />\n<br />\n•PIECIAL DISCOUNT TO STUDENTS.<br />\n<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS SOOKS.<br />\n<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University, Johns Hopkins Hospital and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nFIEL,EN 14. 1-101-,LEYDAY,<br />\n800 N. EUTAW<br />\n<br />\nST.,<br />\n<br />\nB ALTIMORE, MD.<br />\n<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br />\n<br />\niinbeuser-Busch<br />\nBrewing )Iss'n<br />\nSt. Louis, Mo.<br />\n<br />\nYou get the benefit of<br />\nall this labor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cata[logue.<br />\nCHAS. M. STIEIPP,<br />\n9 N. Liberty St., Baltimore, Md. 521 nth St., N. W., Washington, I). C.<br />\n<br />\nB. 0. EICHELBERGER,<br />\nBOOKS AND STATIONERY,<br />\nENGRAVING AND STAMPING.<br />\nNo. 308 North elli_trlexa Street,<br />\n<br />\nBrew the Best Beers<br />\nin the World.<br />\n<br />\nY. M. C. A. BUILDING,<br />\n<br />\n•ALTIMOPIE SPIANCH<br />\n<br />\nLOUIS ILLMER,<br />\n•<br />\n<br />\nAgent :Ln.1<br />\n<br />\nMg.<br />\n<br />\nC. ci P. Telephone<br />\n2314.<br />\n<br />\nC.& P. Telephone 2351.<br />\n<br />\nTONEBRAKER<br />\nBROS.,<br />\n_<br />\n<br />\nS<br />\n<br />\n21Z E. Baltimore St.<br />\n<br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY F.NGRAVED<br />\nSHORT NOTICE.<br />\n<br />\n\fFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nHOLIDAY SEASON,<br />\n<br />\nFORD'S!<br />\n<br />\nTHE THEATRE OF BALTIMORE.,r)<br />\n<br />\nLes1.4116<br />\n<br />\nJAN. 21,<br />\nONE<br />\nWEEK.<br />\n<br />\nLEMMERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br />\n<br />\nCARTER,<br />\nIN \"ZAZA.\"<br />\n<br />\nJANIEZ<br />\n- S O'NEILL<br />\nIN \"MONTE CRISTO.\"<br />\n<br />\nJAN. 28.<br />\nONE<br />\nWEEK.<br />\n<br />\nNIXON 6c<br />\nZIMMURMAN'S<br />\n<br />\nACADEMY OF MUSIC!<br />\n<br />\nWEEK OF<br />\nJAN. 21.<br />\n<br />\nHENRY 1V1ll..44BR<br />\nIN \"RICHARD SAVAGE.\"<br />\n<br />\nWEEK OF<br />\nJAN 28.<br />\n<br />\nIN \":-.WEET ANNIE PAGE.\"<br />\n<br />\nLULU ()LASER<br />\n<br />\nLEMMERT<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br />\n<br />\nLEMMERT.<br />\n<br />\n14 E. FAYETTE STREET.<br />\n<br />\nPECIAL DISCOUNT<br />\n<br />\nS<br />\n<br />\nSPACE TO LET.<br />\n<br />\njt<br />\n0<br />\n<br />\nTo the Students and Nurses of Johns II OpkinS We will make a<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n<br />\nOUR HEAD, SIR,<br />\n<br />\nis the noblest part of your<br />\nbody. Inijrovetit.;4)3aITe<br />\n417.-ing OUR HATS.<br />\n<br />\nMINOR'S,<br />\n<br />\n.IEFFRES STUDIO, gtv<br />\n<br />\nUP-TO-DATE,<br />\n<br />\n218 NORTH EUTAW STREET,<br />\n06 N. CHARLES STREET.<br />\n<br />\nBALTIMORE, MD<br />\n<br />\n4<br />\n1.1011,APFEL 6 8E17,<br />\n<br />\nmandolins<br />\n<br />\n4,5,„<br />\n<br />\nONE PRICE.<br />\n<br />\nb.Z.ZZZaktimaziteatiteepaiteaeeiteiteeeiteeitee,e4:<br />\nMANDOLINS, GUITARS an<br />\n\"Have a tone<br />\n<br />\nH.&B.<br />\n<br />\nBANJOS<br />\n<br />\nThat's all their own.\"<br />\n<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\n<br />\nGUITARS AND BANJOS.<br />\n<br />\nNEAR SARATOGA ST.<br />\nOPEN EVENINGS.<br />\nINSTRUMENTS TAKEN IN EXCHANCE<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\nJ. SMITH,<br />\nSTATO NM=WM MON=NTOZNASNUSWTRUZWATOMOM/a<br />\nDealkw In<br />\n<br />\nBOOKS<br />\n<br />\nOld solid<br />\n<br />\nNeW<br />\n<br />\nrint,VOLS'aviTHAUMT/SMAY020322=0E,SWESTANSMATAWAN<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE<br />\n<br />\nBOOKS.<br />\n<br />\nCall at 805 North Howard Street,<br />\n3 DOORS ABOVE MADISON.<br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br />\n<br />\nCOLLARS.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n125 EAST, NEAR CALVERT STREET.<br />\n<br />\nS. hSICRECRSCU000nRQDSCOR 111<br />\nCUFFS<br />\n<br />\nGLOVES.<br />\n<br />\n(ISIONEBRA<br />\nKER DPOS<br />\n•<br />\n')k<br />\nI<br />\n<br />\nr\\tet-5<br />\n<br />\nLT\\<br />\n<br />\nvor<br />\n<br />\n217 E.BALTO.e5T.<br />\nE MD.13ALTIMO<br />\n<br />\nBRACES.<br />\n<br />\nUMBRELLAS.<br />\n<br />\nCANES.<br />\n<br />\nTIES.<br />\n<br />\nETC.<br />\n<br />\nNovember 7th, Iwo.<br />\nWhile visiting the Paris Exposition of 1901, the wonderful display o I<br />\nwines from all parts of the world was made a special study by our representative, who secured some very tine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Canet, Chateau Larose, Chateau Lalitte, Chatcau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nfind Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s Deinhard & Co.'s celebrated Rhine<br />\n\\Vines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Olney Forrester & Co.'s exhibit; It very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br />\n<br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\nSTONEBRAKER BROTHERS,<br />\n217 E. BALTIMORE ST.,<br />\n<br />\not<br />\n<br />\nADVERTISE IN THE \"NEWS LETTER.\"<br />\n<br />\nBALTIMORE, MD,<br />\n<br />\n04 ot<br />\n<br />\n\f", "format": "basic_html", "processed": "/N<br /><br />\n0<br /><br />\nPRt•S OF<br /><br />\nSTONEBRAKEPI BRO., kIALIIMORE<br /><br />\nJOHNS HOPKINS I The Johns Hopkins Press.<br />\nUNIVERSITY.<br />\nP. MORLEY,<br /><br />\nAmerican Journal of Mathematics.<br />\nEditor. Quarterly. 4to. Volume X XIII.'<br />\nin progress. $5 per volume.<br />\nII.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per vOlume.<br />\nStudies in Historical and Political Science.<br />\nV.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series X IX<br />\nin progress. $3 per volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Anyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br /><br />\nI.<br /><br />\nBALTIMORE, MD.<br />\n1 111<br />\n•<br />\n1.1•111M•110..<br /><br />\nTwenty-Fifth Year.<br /><br />\nBeginning October 1st, 1900.<br /><br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br /><br />\nDANIEL C. GILMAN<br />\nWm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION.<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates<br />\nfor the degree of Ph. D.)<br />\ndegree<br />\n(b) In Medicine. (Courses for candidates for the<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special.students.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br /><br />\nX.<br /><br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam If. Howell.<br />\nWilliam H. Wekh.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oskr.<br /><br />\nXI.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the -Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssyriology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br /><br />\nEditors.<br />\nFrank Morley.<br />\nIra Remsen,<br />\nBasil L. Gihkrslec c<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br /><br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br /><br />\nXII.<br /><br />\nXIII.<br /><br />\nXIV.<br />\nXV.<br /><br />\nXVI.<br /><br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nJournal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. 8vo. Volume<br />\nV in progress. $5 per volume.<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nReports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nTerrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume.<br />\nAnnual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br /><br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc.,of the University. Published at the<br />\nclose ofthe academic year.<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 10 plates. $20.00.<br />\nDESCRIPTION OF THE JOINS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edi:<br />\ntion. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH ANTILEGOMENA EPISTLES. Edited by I. II. Hall. $3.00.<br />\nBIBLIOGRAPHIA HOPKINSIENSIS. Part I. Philology. Parts<br />\nII-III. Chemistry, Minerology and Geology. Parts<br />\nIV-V-VI Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press, Baltimore, Maryland.<br /><br />\n•the news= Letter. *<br />\nVol. V.<br /><br />\nJanuary 24, 1901.<br /><br />\nPOSTMARKED \"THE CONTINENT.\"<br />\nS. S. Tarter Prince, Feb'y. 18, 1900.<br /><br />\nESTERDAY noon,just two weeks out from<br />\nNew York, we sailed past the impregnable<br />\nrock, and there could read, with our own very<br />\neyes:<br /><br />\ny<br /><br />\nTHE PRUDENTIAL HAS THE STRENGTH<br />\nOP GIBRALTAR.<br /><br />\nWhen I came up on deck in the morning to<br />\nsee the gray line of the mountains of Morocco<br />\non the one hand and the hills of\"Sunny Spain\"<br />\non the other (truly sunny) I began to get it<br />\nthrough my doubting head that we were veritably crossing \"the great pond\" and that our<br />\nlong voyage was coming to some end.<br />\nIt has been a rare voyage. Two great storms<br />\nand much fine sailing. It was biting cold as<br />\nwe.were hauled out of the Brooklyn slip. But<br />\nwhen the pilot was dropped and the land lost<br />\nto view, the air came mild and we were tucked<br />\nup in our rugs in the steamer-chairs on deck.<br />\nThere we have lived, to all unpractical ends<br />\ntwo solid weeks, a lazy, loafing, good for nothing lot,—tho' just a trifle chipper now that we<br />\nare on the Mediterranean, with fine sunny days<br />\nand a famous moon at night.<br /><br />\nNo. 7.<br /><br />\nthe dining-room. The little wooden racks were<br />\nsttetched along the tables: to help you keep<br />\nthe identity of your plate and knife and fork,<br />\nand as a needed precaution against the summary landing of your breakfast,tout and scramble, in your lap. I took my first lesson in balancing a cup of coffee in one hand while I<br />\nstabbed for a piece of steak with the other.<br />\nThis, however, is a trifle rhetorical. I did do it<br />\nagain! This first morning I made my breakfast<br />\non a bit of dry toast, and cleared out of the<br />\nstuffy cabin post haste. I knew my safety was<br />\nin fresh air, in deep and copious breaths. At<br />\nthe risk of a ducking I spent the day on deck,<br />\nlashed to my steamer-chair.<br />\nThe ocean was glorious. I have lived for<br />\nthis. The low and scudding clouds. The sea<br />\nlashed to a fury. Now raised up in a great<br />\nwall, then levelled, torn in a thousand scraps<br />\nof foaming white. Up, Up, UP! and the eye<br />\nlooks out alone on the wet, gray sky. The<br />\nsurge and rush of the wave,and the black water<br />\nis hissing at your feet. You clutch the arms of<br />\nyour chair. Vast, illimitable, lonely waters.<br />\nMajestic. Powerful. The Living Sea.<br />\nser W W<br /><br />\nThe worst of it was over with the second<br />\nAi<br />\nnight, and the day following we had the wind<br />\nSunday, our third day out, was pleasant sail- in the west, abaft, with the long swells pressing<br />\ning. A sermon from one of the four ministers after us, and chasing on and past us, while the<br />\naboard! (There are mutterings in the \"fo' screw threshed out a snarl.<br />\ncastle.\" The steward predicts \"tough luck!\")<br />\nThe \"ship's company\" crawled up on deck<br />\nAlong about sun-down we got a little motion like half-drowned rats, and entered into the felon. It is breezing up a bit. Several passengers lowship of a common misery.<br />\ngo down with the sun. The visible list is<br />\nWe had two or three days of fine sailing then.<br />\ndepleted.<br />\nI 'ried to read. What foolishness to have loaded<br />\nWhen I came up on deck the following morn- down my bag with books! Your eyes steal<br />\ning, Blue Monday! A heavy gale was on from furtively from the page to the broad sea, and<br />\nthe south. It was blowing like a nautical you come back with a start after a half-hour's<br />\nnovel. As our course was due east we were dreaming. (0, foolish first voyager! As if<br />\nright in the trough of the sea and rolling on Old Ocean were not better than a book.) The<br />\nour scuppers. Five or six only of our forty sky and the sea, but multitude changes! A bit<br />\npassengers answered the breakfast call. The of sun, a rainbow, a matchless green in the<br />\nberth-cabin is in a state of collapse! It was breaking of a wave, a group of gulls.<br />\nnext door to impossible to serve anything in<br />\nww<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThat second storm came on the eighth day.<br />\nWith waves topping forty feet and the wind at<br />\nsixty knots it outlived the first in fierceness. It<br />\nwas a nor'easter. The mate called it \"a<br />\nbreeze.\" We lost a rail. There was a boat<br />\nstove in.<br />\nUntil you get out on the ocean, a thousand<br />\nmiles from anywhere, with the wind howling<br />\nlike a dervish and the seas smashing on the<br />\nbow, in the long, black night: to feel your shell<br />\nof a ship lifted up, the pound of the sea, the<br />\nmighty shudder of the frame, the creaking of<br />\ntimbers, the sullen rush of waters on the deck,—<br />\ntill then, you have two or three emotions<br />\nunrealized. And when, after three days of this,<br />\nthe sea conies calm and you make out the first<br />\nbit of land you have seen for near a fortnight,<br />\nthen if never before, you are glad for the good<br />\ngift of life, and you go out on deck, alone, and<br />\nlift up your eyes unto the hills.<br />\n.116 .116.A6<br />\nHere we are in Naples! Safe and sound,happy<br />\nand hungry! Eighteen days from New York!<br />\nI am simply upset with delight. It is all so<br />\nforeign, so fascinating. We have our own wheels<br />\nthrough the customs, uncrated, and ready for<br />\nthe start. I am convicted of seven months<br />\ncrammed full of live interest and experience, and<br />\nI see that at the start we shall pay for it!<br />\nFleeced three times to-day. Our first. This is<br />\nNaples.<br />\nor or or<br />\nTravel abroad, travel in Italy any rate, is<br />\nanother story from jogging across the States.<br />\nTo the novice it isn't any joke. We are paying<br />\nthe penalty of not speaking the language. Just<br />\nthe difference it makes, you will never understand until you try it. Don't! But we arc<br />\npicking up some phrases. In self-defense. Our<br />\nfirst: quanto costa? \"how much?\" And then,<br />\nits correlative, c troppo! \"Not on your life.\"<br />\nWe get along pretty well in the shops and can<br />\nhaggle 'em down. It is the waiter at the<br />\ncafe who beats you out. You eat your luncheon<br />\nand then he springs the surprise. It is a matter<br />\nof a franc. You swear it was not included in<br />\nthe order. He chatters at you nastily and<br />\nturns his back. You get mad. He shrugs his<br />\nshoulders. \"Non intendo.\" He does not understand you. What under heavens can you do?<br /><br />\nYou have your choice: pay up, or get in a row.<br />\nAnd there he has you dead. You have eaten his<br />\nWILLIAM P. SHRIVER.<br />\ncakes!<br />\n911- W<br /><br />\nTHE BALTIMORE CONCERT OF THE<br />\nMUSICAL CLUBS.<br />\nON Friday the 11th, the Baltimore Concert of<br />\nthe Musical Clubs was successfully given.<br />\nIn spite of the very unfavorable weather, a<br />\ngoodly number of Hopkinsonians and their<br />\nfriends was present. Every selection given received applause enough to justify an encore;<br />\nand, indeed the most severe criticism of the<br />\nconcert WaS made with reference to the length<br />\nof the program. A great many encores were<br />\nresponded to, and the evening was thereby<br />\nprolonged.<br />\nThe men were inspired by this encouragement,<br />\nand enthusiasm succeeded the anxiety at first<br />\napparent behind the scenes. The Clubs sang and<br />\nplayed with a spirit that put to rout the heavy<br />\npredictions of failure, aroused by the early date<br />\nset for the concert. Last year it was held March<br />\n23. In no year have the Clubs played in Baltimore<br />\nbelbre Lent. A great deal of credit is due to the<br />\nmanagement and to the individual members of<br />\nthe 1901 Clubs for the hard work they have<br />\ndone during the fall. On this evening Stephen<br />\nHarwood sang his last songs for the J H. U.<br />\nThe audience did not seem satisfied, even after<br />\nhe had appeared on the stage five times. Swindell was also warmly applauded for his \"Miss<br />\nPeoebe\" and for other selections.<br />\nThe Glee Club, with \"My Bed is like a Little<br />\nBoat,\" seemed to cause the greatest pleasure of<br />\nthe evening. This Club is now in fine form as a<br />\nresult of its good training. More first tenors,<br />\nhowever, would help the balance of the Club;<br />\nand every Hopkins man who can make a high<br />\nG is urged to apply.<br />\nThe Banjo and Mandolin Clubs gave excellent<br />\nperformances. They contain much good material, which will be even better next year, as a<br />\nlarge proportion of the men are now in their<br />\nfirst season.<br />\nThe next trip of the Clubs will be made to<br />\nAnnapolis on the 26th. The management is<br />\nbeing besieged .by requests for another Baltimore Concert, and it is hoped that one can be<br />\narranged<br />\n—R. S. L.<br /><br />\nTHE NEWS-LETTER.<br />\nHOPKINS IN THE INAUGURAL<br />\nPARADE.<br />\nTo all Hopkins Men:—<br />\njust a word now seems in order as regards our<br />\ndelegation to the Inaugural Parade of March<br />\n4th. Since it was unanimously decided at the<br />\nmeeting held in Hopkins Hall, Friday, January<br />\n11th, that we should contribute a delegation to<br />\nthe intercollegiate part of the parade, now is<br />\nthe time for every loyal Hopkins man to stand<br />\nby his University and help the good cause. And<br />\nnow that we have so enthusiastically started<br />\nout,let us do it right,and in such a manner that<br />\nevery one of us will feel proud to say that the<br />\nJ. H. U. delegation was the largest, the best<br />\nequipped, the best drilled, and altogether the<br />\nfinest body of college men in line. Many of the<br />\nother colleges have already signified their intention of being represented,so I am quite confident<br />\nthat we shall have many worthy associates with<br />\nus in line. When it is considered what are our<br />\nadvantages over the more distant colleges, it<br />\nshould make every fellow feel ashamed after the<br />\nfourth of March to admit that he was not one<br />\nof the sturdy grenadiers.<br />\nThe benefits arising from such a display are<br />\nmany. The most important of all is the advertisement and public notice that will be given our<br />\nUniversity. This in itself should be enough to<br />\narouse any latent feelings in knowing that by<br />\nthus exposing himself to the most enjoyable<br />\ntime of his life he is at the same time upholding<br />\nthe dignity and bringing renown to his college.<br />\nHere is where an excellent chance is afforded for<br />\ndisplaying our far-famed intellectual abilities.<br />\nBesides, the cost of the whole affair will amount<br />\nto so very little that the good time offered will<br />\namply repay the expenditure.<br />\nThe intention of the Committee is to provide a<br />\nbrass band to accompany us.—Right now let it<br />\nbe understood that the route of the parade will<br />\nextend only from the Capitol to the White House,<br />\nso there is no need of training for long distance<br />\nwalking.—To insure a quick passage to Washington special cars or a train if necessary, will<br />\nbe secured for our accommodation,and arrangements will be made with some restaurant so<br /><br />\n3<br /><br />\nthat dinner will be served immediately before<br />\nthe starting of the procession. The official uniform will be black and blue jerseys or sweaters,<br />\nand Hopkins hats, and a cane.<br />\nIf possible, small flags to be fastened on the<br />\ncanes will be presented each man, and banners<br />\nwill be secured for the festivous occasion.<br />\nTo do all this, more or less capital is absolutely required, hence the need of generous contribution from every man in the University. Even if<br />\nyou can't go you are interested in the welfare;<br />\ntherefore the need for a little generosity. Remember the only expense, outside of the purchasing of your costume, will be the dollar railroad fare and the price of a Washington dinner.<br />\nAnd now, dear sirs, I sincerely trust you comprehend the gravity of our cause and will notify<br />\nmembers of the committee at once that you will<br />\nmarch with us and help carry the glorious banner of our dear Alma Mater, giving evidence<br />\nthereby to President Mac. that we will stand<br />\nby him, even if some of us don't entirely believe<br />\nin his principles.<br /><br />\nJ. ABNER SAYLER,JR.,<br />\nChairman.<br /><br />\nA LIBERAL OFFER.<br />\nTrustees of the University have decided to<br />\nTHE<br />\noffer twenty Maryland Scholarships, in addition to those already offered in the catalogue.<br />\nThe offer is made for the academic year beginning September, 1901, and is for the benefit of<br />\nall parts ofthe State. Accordingly not more than<br />\none-half of the number will be awarded to residents of the city and county of Baltimore, and<br />\nnot more than one-half to those who are now<br />\nmembers of the University, as is seen by the last<br />\nclause. This offer is a rich one for next year's<br />\nFreshman class, as it is that class that will be<br />\nlargely benefitted by it. Considering the present financial condition of Hopkins, the offer is a<br />\nmost generous one, and it is to be hoped will go<br />\ntoward bringing the rural residents of Maryland to a realization of the fact that such a University as this extends its influence, not only<br />\nover Baltimore and Maryland, but over America<br />\n—ay, and over the world.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\n\"C be Ilews.ILetter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nJANUARY 24, 1901.<br />\nSubscription $1.50 per year.<br />\nEditor in Chief,<br /><br />\n10 cents a single copy.<br />\n.<br /><br />\n.<br /><br />\nAssociate Editor in Chief,<br />\nNews Editors,<br />\nAthletic Editors,<br />\nBusiness Manager,<br /><br />\n.<br /><br />\nNORMAN BOYER, 1901.<br /><br />\nJOHN M. BOOKER, 1901.<br /><br />\nI WILLIAM B. HILL, 1902.<br />\nEDEN C. HILL, 1902.<br />\nSOL STROME, 1902.<br />\nJOHN A. SLEMONS, 1902.<br /><br />\n1. .YMAN C. MURPHY, 1902.<br />\n.<br />\nJOHN M. BANDEL, 1901<br /><br />\n. AUBREY PEARRE,JR., 1902.<br />\nAssistant Business Manager,<br />\nAddress all articles, communications, etc., to NORMAN BOYER.<br />\nbox 96,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJoin; M. BANDEL, box 94,J H. U.; or box 395, Medical School of<br />\nJohns Hopkins Hospital.<br /><br />\nO<br /><br />\nUR withdrawal from the Intercollegiate<br />\nLacrosse Association this year has placed<br />\nus in a position of some embarrassment. We<br />\ncan not enter a league with Swarthmore and<br />\nLehigh, as some of our men would perhaps like,<br />\nbecause Lehigh is going to stick to Stevens, and<br />\nwe may not he able to accept the invitation of<br />\nthe northern Inter-University League on account<br />\nof some strange relations which we have with<br />\nSwarthmore. So we may be forced this season<br />\nto follow a policy of independence, and attempt<br />\nto maintain our previous standing as the superior of any college team that may be sent against<br />\nUS.<br /><br />\nTo do this will require the hardest kind of<br />\nwork, faithful and consistent practice, and intelligent following of the instructions of the<br />\ncoaches. The practice that has been going on<br />\nin the cage since the beginning of the term has<br />\nbeen very good in its way, but it has been desultory and participated in by too few men who<br />\nhave real ability and ambition to make the<br />\nteam. Captain Tyler is trying to interest the<br />\nmen in the work,but he is very much dissatisfied<br />\nwith the way in which they respond to his appeals. The Freshmen have always been very<br />\nenthusiastic supporters of lacrosse, and the<br />\npresent Senior and Junior classes furnished a<br />\nnumber of extremely valuable players to the<br />\nwinning teams of 1899 and 1900. The Freshmen this year have not as yet measured up<br /><br />\nto their opportunities, and only one or two men<br />\nfrom that class have done work sufficient to<br />\nwarrant serious consideration.<br />\nThe class of 1903 owes it to itself not to be<br />\nfound deficient in interest and to the University<br />\nnot to be remiss in its athletic duty.<br />\n-U<br />\nN another column we print a letterfrom J. Abner<br />\nSayler, Jr., Chairman of the Committee of Arrangements of the proposed Hopkins representation in the Inaugural Parade at Washington. We<br />\ntake pleasure in publishing his appeal for support of this movement. It is especially proper<br />\nthat we should have a fine representation there<br />\nor none at all. That we are to send a body of<br />\nmen to Washington to march has been determined upon. It would have been humiliating if<br />\nwe had not so determined, and will be if that<br />\ndetermination is not carried out. Being but<br />\nforty miles from the Capital, we should be able<br />\nto send a delegation equal to those of Harvard<br />\nand Yale, which are hundreds of miles distant,<br />\nand the absence of any place at all in the line<br />\nwould reflect badly upon our energy and importance as a college body.<br />\nThere is, too,one other most important reason<br />\nwhy Hopkins should be represented. It may not<br />\nbe known to all that credit for the suggestion of<br />\nthis whole scheme of intercollegiate participation is given to the McKinley Club of this<br />\nUniversity, which wrote some weeks ago asking<br />\nfor a place in line. To suggest a movement and<br />\nthen be unable to follow it up is not an encouraging state of affairs. Let the McKinley Club<br />\nlook to it that the movement is successfully<br />\ncarried out.<br />\nor w<br />\nThe concert of the Musical Clubs given at<br />\nLehmann's Hall on the eleventh was a very<br />\nenjoyable affair, and was generally considered<br />\nan improvement over that of last season. All<br />\nthe numbers were well rendered, and the progra.11 was arranged with evident taste. Harwood was in his best form, and his songs were<br />\nrendered in a style that proves that his voice has<br />\nlost none of its charm.<br />\nBut in the *ay of what may be helpful criticism, does it not seem that a little less of the<br />\nboisterous element might do just as well? Not<br /><br />\nI<br /><br />\nTHE NEWS-LETTER.<br />\nthat we want the formality of a Boston Symphony by any means, but then you know things<br />\ncan be a little overdone sometimes.<br />\nsr sr sr<br />\nThe committee which is making arrankements<br />\nfor the Feed expects to introduce some new<br />\nfeatures which will make this year's affair differ<br />\nmarkedly from those of the past two seasons.<br />\nIt is to be hoped that they may be enabled to<br />\ncarry out their ideas, and that they may not be<br />\nimpeded by any false modesty on the part of<br />\nthose who are desired to participate. Every<br />\nfellow, especially the Freshman, should feel it a<br />\npleasant duty to assist in any way to make the<br />\nevening enjoyable. A determined effort is to be<br />\nmade to interest the Alumni in the affair,and no<br />\nstudent should remain away if it is possible for<br />\nhim to attend.<br />\nslif sir ser<br /><br />\nLONDON OPINIONS OF HOPKINS.<br /><br />\nONE,<br /><br />\nof the editors of this paper was the<br />\ncompanion for a brief hour one<br />\nnight last week of Mr. Alfred Harmsworth, the<br />\ndistinguished millionaire-editor of the London<br />\nDaily Mail, as he journeyed southward in his<br />\nparlor car attached to the special train enroute<br />\nfor St. Augustine, Florida.<br />\nMr. Harmsworth asserted his familiarity with<br />\nthe fame of the Johns Hopkins University and<br />\nits Medical School, and paid a tribute to the<br />\nrenown of Dr. William Osler of the Medical<br />\nFaculty. \"Your Medical School,\" he said, \"is<br />\nwithout doubt the best in this country, and as<br />\na heart specialist I believe that Dr. Osler is<br />\nperhaps the best in the world.\" Mr. Harmsworth asked a number of interesting questions<br />\nrelative to the actions of Hopkins students, and<br />\ninquired particularly where they rowed and had<br />\ntheir cricket field. He should have been invited<br />\nto stop off in this city and visit the University,<br />\nwhere no doubt any number of men would have<br />\nbeen only too willing to conduct their guest over<br />\nthe broad expanse of our magnificent athletic<br />\ngrounds and show him our champion crews<br />\npracticing their stroke on the bosom of that<br />\ngentle stream where the waters softly lap the<br />\npiers of Union Station and the Charles Street<br />\nbridge.<br /><br />\n5<br /><br />\nA STRAIN OF MUSIC.<br />\nMusic, they say, has charms to soothe the breast<br />\nOf savage beasts, or bend the knotted oak,<br />\nTo wake the soul that slumbers in its shell,<br />\nAnd noble hearts to noble deeds convoke.<br />\nThere is a strain of music, which at times<br />\nFloats to my ear from some dim,unknown source,<br />\nBefore whose pulsing notes my soul doth sink,<br />\nO'ercotne with sadness, longing and remorse.<br />\nTo free myself I cannot, nor yet would;<br />\nA fascination holds me in its power,<br />\nThis strange, wild sadness charms while yet it chides,<br />\nAnd sweetly mournful seems the flitting hour.<br />\nAnd then a change comes o'er this strange, wierd<br />\ndream;<br />\nI hear the roaring of the lonely woods,<br />\nThe north wind soughs with melancholy wail,<br />\nAnd nature shows the saddest of her moods.<br />\nIt is the long-stilled music of the past<br />\nThat strikes its mournful chord within my soul;<br />\nThough wild the source, yet pleasant are the notes,<br />\nThe tides of thought, how strange their ceaseless<br />\nflow<br />\n—N. B.<br /><br />\n\"HAS CHIVALRY DISAPPEARED?\"<br />\nTrIIE good knights of old<br />\nFought tournaments bold<br />\nFor prizes and praise and their<br />\nfair lady-loves;<br />\nEach brave man today<br />\nIs fighting his way<br />\nTowards riches and fame and<br />\nthe one maid he loves.—<br />\nIf the steel-clad and sword girted men<br />\nAnd we weaklings who wield but the pen,<br />\nBoth were asked if the gold or<br />\nthe girl or the glory<br />\nWere most worth our pain,<br />\nFrom fighters and scribblers would<br />\ncome the same story:—<br />\n\"The deeds arc the gain !\"<br />\nR. S. L.<br />\n.A6 .A6 JJ6<br /><br />\nThe trip of the Yale Glee, Banjo and Mandolin<br />\nClubs covered 8,000 miles, and concerts were<br />\ngiven at Pittsburg, Louisville, St. Louis,<br />\nChicago, Des Moines, Denver,Colorado Springs,<br />\nSalt Lake City, Oakland, San Francisco, Los<br />\nAngeles, Kansas City, Cleveland, and Albany.<br />\n—Yale Alumni Weekly.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nHEARD IN THE REAR.<br /><br />\n44 IT'S too bad that the Clubs should have<br />\nsuch rainy weather to contend with; it<br />\nkeeps so many people away.\" Though Lehmann's Hall was not overflowing, the audience<br />\ncertainly was appreciative, and the Clubs met<br />\nwith a warm reception. Mr. Harwood's selections were especially well received, and remarks<br />\namong the 50—cent critics were in abundance<br />\nabout the easy time he would have on the stage.<br />\n\"We'll miss Harwood next year, he is going<br />\nto be—i. e.; he is going to resign from the<br />\nClubs; but say isn't he great? why did they<br />\never place him before Swindell on the program?<br />\nSwindell is good, even excellent; but then,<br />\nHarwood is great, and they ought to have<br />\nknown the difficulty Swindell would have in<br />\novercoming comparisons with Harwood. Swindell is working hard, and is doing fine work:<br />\nhe will be a good end man next year.\"<br />\nw or or<br />\nWhen the Soldier Song from Princess Chic<br />\nwas rendered by the Glee and Mandolin Clubs,<br />\nensemble, Mr. Swindell sang with great spirit<br />\nand enthusiasm. Several of the rear enders<br />\nimmediately took up the air, and still we hear<br />\nit. \"That's a great air for a college song. I<br />\nwish I could write lyrics, I would put words to<br />\nit. That is just the kind of air we need.\" The<br />\nsuggestion was good, and there are others with<br />\ndesires to write lyrics.<br /><br />\n\"The quartet is excellent, and those new<br />\nsongs are delightfully funny. Sorry that they<br />\nhave no more.\" That was the consensus of<br />\nopinion of the standing roomers,and apparently<br />\nof the whole audience. In fact the Glee Club<br />\nstood at the head of the performance both in<br />\nquality and quantity. All their selections except<br />\nMy Lady Lu were modern, and what that<br />\nlacked in newness was made up by its melody<br />\nand spirit. So early in the season when so few<br />\nof the comic operas have stood the test of<br />\nBaltimore audiences,it is difficult to select pieces<br />\nthat are \"catchy,\" without recourse to resurrecting by-gone successes, and when so many<br />\nencores are demanded the difficulty is made<br />\ndouble.<br />\nWW<br /><br />\nThe gentleman from whom the Mandola was<br />\nprocured made his appearance late in the evening,<br />\nand was much surprised at the efficient manner<br />\nin which Mr. Edgeworth Smith handled it.<br />\n\"That is the only one in the country, in fact,<br />\nthe only one ever made here, and we were lucky<br />\nin getting hold of it. Mr. Smith came down<br />\ntwo days ago, and wanted to tackle it in the<br />\nconcert, and though we very much feared that<br />\nthe undertaking was too difficult we willingly<br />\noffered the Mandola to him. So there he is<br />\nplaying it now, and playing it well.\" It certainly sounded weird and odd to hear the deeptoned instrument play a solo for the first few<br />\nbars of Slippery Quaker, but it was a novelty<br />\nthat pleased.<br />\nOr<br /><br />\n\"The Banjo Club is playing in great time, and<br />\nis getting more music out of the instruments<br />\nthan you generally hear from a banjo. It seems<br />\nto me that they are beating last year's work.<br />\nLast year the Mandolin Club was far superior<br />\nto the Banjo Club, but this year the Mandolin<br />\nClub has fallen off somewhat. They do not<br />\nplay as softly, or with such continuity; there<br />\nis too much individual work, and too many<br />\nstrums'—to use Stephen Crane's word. The<br />\ntime is good, but the result does not give one<br />\nthe orchestral effect that it did last year.\" The<br />\nman who uttered these remarks just then went<br />\nout, and I do not know whether he was a<br />\nmusical critic or not.<br /><br />\nW<br /><br />\nAfter the concert was over, it was the general<br />\nopinion that on the whole it was a most enjoyable and creditable performance. The selections<br />\nwere good; the renditions with so little training<br />\nexcellent; and as for quantity, the thirty pieces<br />\nshould have furnished a variety fit for all sorts<br />\nand conditions of hearers. Again the University<br />\nmust thank the men and the leaders for their<br />\nefficient work.<br />\nS., '02.<br />\nor or or<br />\nIt is a good • thing to heap coals of fire on the<br />\nheads of your enemies, but don't burn your<br />\nTiger.<br />\nfingers doing it.<br /><br />\nTHE NEWS-LETTER.<br />\nHULLABALOO, 1901.<br />\ndesire to register a<br />\nWE\"Hullabaloo.\"<br /><br />\nplea for the 1901<br /><br />\n7<br /><br />\nbelieve that if we look closely we shall discover<br />\na definite place for 1901. That place is at the<br />\ntop.<br />\nJ.<br /><br />\nGRESHAM MACHEN,<br /><br />\nEditor-in-Chief of 1901 \"Hullabaloo.\"<br /><br />\nIn every institution, the college annu'al regis.116 .116 .A6<br />\ntering as it does the various student activities,<br />\nSEE,<br />\nTHE<br />\nCONQUERING<br />\nHERO COMES!<br />\nfills a considerable place in forming the opinions<br />\nof outsiders with regard to the enterprise and AT this, the dawn of the twenty-fifth anniverpublic spirit of the students.<br />\nsary of the founding of the Johns Hopkins<br />\nA well arranged Hullabaloo with plenty of University, there enters its portals one whose<br />\nclever drawings and plenty of bright \"stunts\" name has reached across the continent,and penof all kinds will induce an outsider to believe etrated the hearts of the capitals of Europe.<br />\nthat the student body at Hopkins is also bright One, who tho' born in a foreign clime, and<br />\nand clever; but a Hullabaloo that seems to whose ancestors were of obscure and lowly<br />\nhave great difficulty in filling out its allotted origin, has surmounted all obstacles, climbed,<br />\nnumber of pages and that shows a scarcity of rung by rung, the ladder of fame, and now<br />\nwit both in drawings and in contributions, will stands at the topmost pinnacle of glory. One<br />\nbe attributed either to the dullness or to the lazi- whose achievements have been the result of<br />\nness of the student body. Now the board of edi- years of patient toil and unceasing diligence,<br />\ntors does not desire to shirk any responsibility, and whose name has become a household word<br />\nbut we believe that bv an outsider,the success or alike in the palaces of the rich, and in the hovels<br />\nfailure of the book will be attributed largely to of the poor. The wonders of this being have<br />\nthe students in general; therefore we urge every occupied the minds of all, from the crowned<br />\none of every class and every department to try heads of Europe, to the school boy bending o'er<br />\nhis hand at some form of contribution. It is no his task. Yet no monument of literary fame has<br />\nhe bequeathed the world. No sculptured bust<br />\nexcuse to say that you don't believe you have or shrined urn bear testimony of a life devoted<br />\nthe talent. You will never know unless you try. to art. No far reaching and beneficent reforms<br />\nIn a publication like the Hullabaloo, if the book tell of a life spent in the uplifting of mankind.<br />\nis practically written by a few men, no matter But despite all this, fame is his reward. And<br />\nhow bright tliey may be, there is apt to be a how does he receive these outbursts of applause,<br />\nthese approbations of the masses? With calm<br />\n• wearing sameness. In the Hullabaloo, more and unruffled dignity, he gazes down upon the<br />\nthan anywhere else, there must be variety, and \"madding crowd,\" with mind no longer intent<br />\nvariety can only be secured by a large number upon earthly and material things,and with ears<br />\nof contributors. If the editors are forced to do deaf to praise.<br />\nWho is the mighty one ?—even HAM JR.<br />\nall the work themselves, their supply of ideas<br />\nW. B. H.<br />\nwill inevitably run dry, and the results will be<br />\ngoir<br />\ndisastrous. In many cases variety will supplant<br />\nTHE MODERN VERSION.<br />\nintrinsic merit. Contributions from outsiders<br />\nin some cases may be welcomed instead of better<br />\nLittle Miss Muffet,<br />\nShe sat on a tuffet<br />\ncontributions from the editors, because the forBating her curds and whey.<br />\nmer have the inestimable merit of being different.<br />\nBut a boa constrictor<br />\nCame along and kicked her,<br />\nAccordingly in the next few weeks (which will<br />\nAnd frightened Miss Muffet away.<br />\ndecide the character of the book), we urge every—Y. Y. Y.<br />\nsr sr sr<br />\none to do his best. If we all pull together in a<br />\nA STOCK TICKER.<br />\nhearty, enterprising way we can make the 1901<br />\nHullabaloo even better than the succession of<br />\n\"Mr. Rockfeller makes a dollar every time his<br />\nexcellent books which have gone before. Our clock ticks.\"<br />\nannuals have always compared very favorably<br />\n\"I'd like to own that clock!<br />\n—Harvard Lampoon.<br />\nwith those of any college in the country, but I<br /><br />\n411/<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br />\nTHE COMING FEED.<br /><br />\nannual athletic feed, in honor of recent<br />\nTHE<br />\nvictories in various branches of sport will<br /><br />\nuary,the titles of which are still secret, will then<br />\nbe presented.<br />\nThe famous Hopkins Trans-Oceanic Star<br />\nSpecialty Company of Presdigitateurs, composed largely of Messrs. Swindell and Sayler,<br />\nwill present one of their latest original creations, the title of which will be known later.<br />\nThere will also be various stunts in the Cage,<br />\nprominent among which is an amateur fisticuff<br />\naffair with blackened gloves. Then all present<br />\nwill adjourn to the \"Palm Garden\" (or rather<br />\nthe Gym), where an extensive variety of tempting delicacies prepared specially for the occasion<br />\nwill be served. After this there will be a rousing<br />\nsong to dear old J. H. U., and the amusement<br />\nfor the evening will be complete.<br />\nThis entertainment is one of the events in connection with our University which every member of the student body should consider it his<br />\nduty to attend, as its success will be greatly dependent upon a large attendance.<br />\nBegin saving up now.<br /><br />\ntake place in the Gymnasium on Friday evening,<br />\nFeb. 1st.<br />\nNothing very definite as to the \"modus operandi\" has yet been learned, but from certain<br />\nreports which have leaked out, the program<br />\npromises to be very entertaining, and will probably be arranged somewhat in the following<br />\nmanner:<br />\n1st. Addresses by President Gilman, Dean<br />\nGriffin, Professor Remsen, and Dr. Renouf.<br />\nAfter these addresses, the Musical Clubs will<br />\nrender a few \"sacred\" airs apropos of the<br />\noccasion. Then Billy Maddren will hypnotize<br />\nsome of his colored friends, and thus compel<br />\nthem to perform feats, the nature of which is<br />\nstill unknown. Next comes the presentation of<br />\nthe \"H's\" to those men whom the Athletic<br />\nBoard has deemed worthy of this honor. To<br />\nVi 91W<br />\nfollow this solemn ceremony, certain features<br />\nTEAM.<br />\nTRACK<br />\nTHE<br />\nhave been proposed, which if carried out will<br />\nprobably be the star features of the program.<br />\ntrack-and-field squad is beginning to<br />\nThe following \"pieces\" have been selected, and<br />\nshow the first indications of individual prowill be presented in the form of tableaux with<br />\ngress. The old men still in the University are<br />\nall modern attachments and apparatus, which<br />\nbeginning to appear for regular practice, but<br />\nthe committee has spent a considerable amount<br />\nthe new ones under the direction of Messrs.<br />\nof time and money in procuring.<br />\nMackdermott and Garrett,Hoffman and Wroth<br />\nThe actors involved will appear for the first<br />\nhave been working religiously for some time<br />\ntime in America, to the great delight of their<br />\npast. Mr. Garrett has been out several times<br />\nmany enthusiastic admirers, who will be present<br />\nin the past two weeks with the candidates<br />\nto welcome them. The proposed selections are:<br />\nfor the weight events, and the prospects in<br />\n1st. \"The Stair Scene from Sapho,\" a brilthis department are a little brighter than in<br />\nliant scenic production with latest Parisian<br />\npast seasons. Among the heavy men at work<br />\nalterations.<br />\nare Blanck and Finck, who played on this sea2nd. \"The Death of Little Eva.\" (Uncle<br />\nson's foot-ball team, and Stone and Scholl of<br />\nTom's Cabin.) A word to the wise is suffilast year's team.<br />\ncient, and it need only be added that each man<br />\nIt is to be expected that at least one of them<br />\nshould bring an extra handkerchieffor the tears<br />\nwill develop enough form to win some place<br />\nthat will issue forth as Eva \"shuffles off this<br />\namong the weight men of the other clubs of<br />\nmortal coil.\"<br />\nBaltimore. Mr. Garrett himself will, of course,<br />\n3d. \"The Dying Gladiator,\" a truly prosaic<br />\nhe a competitor in the coming meets.<br />\nreproduction of Grecian art with some material<br />\nIn track work, among the new candidates<br />\nalterations.<br />\nHoward Matthai, a Freshman, shows good<br />\n4th. \"The Discus-Thrower in Repose,\" by starting form and others of the Freshman squad<br />\nthe best living representative of the original are doing well. Pessagno, the broad jumper, is<br />\nOlympian hero. Other specimens of Greek stat- also running with the track squad.<br /><br />\nTHE<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nGEORGETOWN AND B. A. C. GAMES. be a very slow event owing to the fact that the<br />\nANNOUNCEMENTS have been made of the<br />\nannual indoor athletic meet of the Georgetown University and of the annual games of the<br />\nBaltimore Athletic Club.<br />\nThe Georgetown games are scheduled to be<br />\nheld in Convention Hall, Washington, on Saturday, March 2nd. The games are under the<br />\nmanagement of Messrs. C. M. Barry and M.<br />\nJ. Thompson.<br />\nThe completion of Georgetown's new indoor<br />\ntrack has added no little enthusiasm to the<br />\ntrack men. The path, which is laid in the basement, is 75 yards straight-away, and is considered by many an innovation far in advance<br />\nof college indoor tracks elsewhere.<br />\nThe games of the Baltimore Athletic Club<br />\nwill be given in the Fifth Regiment Armory on<br />\nthe night of Saturday, February 16th. The<br />\nevents will be both open and inter-scholastic<br />\nand will probably be as follows:<br />\n40-yard dash.<br />\nRelay race.<br />\n220-yard dash, inter-scholastic.<br />\n440-yard run.<br />\nRunning high jump.<br />\nPole Vault.<br />\nStanding broad jump.<br />\n16 pound shot.<br />\nWrestling.<br />\n125 pound special.<br />\nLight weight.<br />\nMiddle weight.<br />\nHeavy weight.<br />\nIt is most probable that the track and field<br />\nevents will be handicap, and first and second<br />\nprizes, which will be handsome gold medals,<br />\nwill be awarded. The wrestling will be for the<br />\nchampionship of the Atlantic Division of the A.<br />\nA. U.<br />\nThe committee in charge consists of the following: G. E. Lamb, chairman; P. L. Small,<br />\nA. G. Lawrence, Dr. B. Merrill Hopkinson,<br />\nand LeRoy Gresham.<br />\nHopkins will enter men in all the track and<br />\nfield events except the 220-yard dash which is<br />\npurely interscholastic, and the standing broad<br />\njump which Director Mackdermott thinks will<br /><br />\nonly man in the Union who is able to do anything in this line is Glenny of the B. A. C., who<br />\nwas defeated last year in the annual games by<br />\na Washingtonian.<br />\nThe team will be chosen from the following<br />\nmen:<br />\n40-yard dash,—Watson, Matthew, Brem,<br />\nHazlehurst,Garret,Beeuwkees,Tootle,Pessagno,<br />\nRiggs.<br />\n440-yard run,—W. E. Hoffman, Jr., Captain;<br />\nEngland, Weedon, Smith, Tyler, Beeuwkees,<br />\nBarret, Plaggmeyer, Thatcher, Riggs.<br />\n880-yard run,—Wroth, Hayden, Thatcher,<br />\nZimmerman, Abercrombie, Riggs.<br />\nRelay Race,—Hoffman, England, Thatcher,<br />\nTyler, Smith, Beeuwkees, Plaggmeyer, Pessagno.<br />\nRunning high jump,—Scholl, Brem, Weed on<br />\nSimmons, Garrett, Pessagno.<br />\nPole Vault,—Brem, Simmons, Fishach.<br />\n16-pound shot.—Garrett,Finck,Stone, Blanck,<br />\nScholl.<br />\nOther men who are working hard but have not<br />\nas yet been assigned to any of the events are:<br />\nBaetjer, Branch, Koppleman, Miller, Adler,<br />\nWinternitz, and Moore. As soon as possible<br />\nMr. Mackdermott will decide what these men<br />\nare able to do and will then say what their part<br />\nshall be in helping to \\vin places for \"old Tommy<br />\nHopkins.\"<br />\nThe men who will go to Georgetown will also<br />\nhe picked from the above mentioned.<br />\nRev. Julius Hoffmann, who instructs the class<br />\nin Major German, is now giving a course of<br />\nlectures at the Polytechnic Institute on the<br />\nhistory of Germany, her great men, etc. The<br />\ncourse is for the benefit of the teachers of the<br />\nEnglish-German schools of this city.<br />\nslIr sir Of<br /><br />\nThere has been a new system formed at<br />\nHarvard under which retired professors may<br />\nreceive pensions.<br />\n,A6<br /><br />\n.116<br /><br />\nSyracuse University has offered six free scholarships to Filipinos, and the University of Chicago offers free tuition to ten Porto Ricans.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nHOPKINS HAPPENINGS.<br /><br />\nON Saturday January 19th, at a Field Night<br />\nof the Johns Hopkins Club, Dr. Harry<br />\nFielding Reid gave an illustrated lecture on<br />\nMaryland roads.<br />\nw w<br />\nOn January 18th, Mr. Howard Crosby Butler,<br />\nLecturer on Architecture at Princeton University, delivered a lecture on \"The Deserted Cities<br />\nof Syria.\" This was the beginning of the second<br />\nseries inaugurated by the Baltimore Society of<br />\nthe Archwological Institute of America.<br />\nwww<br />\nA new class in Italian Conversation has been<br />\nstarted under the directorship of Father Gabriel<br />\nUrsani, of Bagdad. The class is divided into<br />\ntwo sections: one, on Monday at 5 P. M. for<br />\nbeginners, and one on Thursday and Friday<br />\nafternoons for those who have a rudimentary<br />\nknowledge of the language.<br />\nww<br />\nThe following gentlemen have been awarded<br />\nUniversity Scholarships for the current year:<br />\nG. 0. Berg, Minnesota; A. E. Curdy, Michigan;<br />\nP. H. Edwards, Baltimore; J. Embry, Texas;<br />\nJ. A. E. Eyster, Maryland; J. G. Hun,New York;<br />\nJ. W. Harry, Maryland; H. Kurrelmeyer, Maryland; G. W. Middlelcauff, Maryland; B. LeRoy<br />\nMiller, Iowa.<br />\nwww<br />\nDr. James W. Bright, director of the department of English, has received from England<br />\nseveral copies of photographs of the great bronze<br />\nstatue of Alfred The Great that is soon to be<br />\nerected in honor of the great Saxon.<br />\nw sor w<br />\nProf. Ernst von Halle of the University of<br />\nBerlin was a visitor here last week. He was<br />\nshown over the buildings and introduced to the<br />\nheads of the departments by President Gilman.<br />\nProf. von Halle is distinguished in Europe for<br />\nhis work in Economics, and is here to study the<br />\nconditions in the South.<br />\nwww<br />\nThe current number of the Review of Reviews<br />\nedited by Dr. Albert Shaw, a Hopkins graduate,<br />\ncontains an interesting account of \"Dr. Gilman<br />\nand the Johns Hopkins University.\"<br /><br />\nAt a meeting held on Tuesday last, Mr. Machen<br />\nand Mr. Stone, chairmen of the Senate and<br />\nHouse Debating Teams respectively, agreed on<br />\nthe following question for the Inter-class debate<br />\nin March: Resolved, \"That the United States<br />\nshould construct, own, operate, and control an<br />\ninter-oceanic canal by way of Nicaragua.\"<br /><br />\nMr. John G. Campbell, Speaker of the Hotise<br />\nof Representatives, has selected the following<br />\ncommittee to arrange the annual trip of the<br />\nHouse to the session of Congress at Washington:<br />\nPeregrine Wroth, Chairman; John A. Slemons<br />\nand Ross M. Diggs.<br />\nWWW<br /><br />\nNext Tuesday, January 29, the first lecture of<br />\nthe series on Maryland Colonial History, provided for by the liberality of \"The Maryland<br />\nSociety of The Colonial Dames of America\"<br />\nwill be delivered by Prof. Charles W.Sommerville,<br />\na graduate of Hopkins,on \"Francis Nicholson.\"<br />\nDr. Sommerville will deliver five more lectures<br />\non Maryland men of Colonial days in McCoy<br />\nHall, on the following Tuesdays at 5 P. M.<br />\nWWW<br /><br />\nIt was decided at the mass-meeting held on<br />\nFriday, January 11,that, provided a sufficiently<br />\nlarge delegation would go, Hopkins should be<br />\nrepresented in the Inaugural Parade at Washington on March 4. Dr. Renouf, who called the<br />\nmeeting,impressed upon the students the advisability of a large body of students in the parade,<br />\nor none at all, for in that long review we shall,<br />\nfiguratively speaking, be marching before the<br />\neyes of the whole country. J. Abner Sayler,<br />\n1901, was elected chairman of the committee<br />\non arrangements, with power to choose associate<br />\nmembers. He has appointed Harry S. Byrne,<br />\n1901, R. T. Crane, 1902, and R. C. Hoffman,<br />\n1903, members of the committee, and will announce the graduate and medical members later.<br /><br />\nWilliam Payne Shriver, 1901, has been elected<br />\nto the editot:ial board of the Hullabaloo to fill<br />\nthe vacancy caused by the withdrawal of William McCully James.<br /><br />\nTHE NEWS-LETTER.<br />\nTHE UNIVERSITY COLORS.<br /><br />\nI1<br /><br />\nTHE MOMENTS THAT HAVE PASSED.<br /><br />\nISTEN, as the clock is ticking,<br />\nTo the Editor:—<br />\nThrough the live long day,<br />\nOn page 45 of the little Y. M. C. A. year book<br />\nWatch the hands move slowly onward,<br />\nis the sentence: \"Gold and Sable have been<br />\nAs each hour doth wear away.<br />\nofficially adopted by the trustees as the colors<br />\nSlowly sinks God's golden courier,<br />\nof the University, but, by usage of the students<br />\nSwiftly gathers twilight's gloom,<br />\nHomeward wends the weary reaper,<br />\nin their athletic organizations, Black and Blue<br />\nAnd another day is gone:<br />\nhave come to be considered the distinctive<br />\nGone, and so are others going,<br />\ncolors.\" Such a state of affairs necessarily gives<br />\nAnd will go, while time doth last,<br />\nus two sets of colors; the Black and Gold which<br />\n'Tis the present should concern us, not<br />\na student, until he sees some official notice,<br />\nThe moments that have passed.<br />\nwould not recognize as belonging to his Alma<br />\nTicking, ticking, ticking, slowly,<br />\nMater, and our own distinctive Black and Blue,<br />\nYet how swiftly moments fly,<br />\nEver passing onward, onward,<br />\nat sight of which every true Hopkins lad will<br />\nAnd we do not question why ?<br />\ndoff his hat and is ready to shout a \"Hullabaloo.\"<br />\nAre we moving past as driftwood,<br />\nIt is no wonder that Hopkinsians should feel<br />\nListless, heedless of the time,<br />\nthat the Black and Blue is their emblem—Black<br />\nAre we bending like the Sapling,<br />\nand Blue that for years has been waving on our<br />\nOr resisting, like the Pine?<br />\nIn the garden of God's wisdom,<br />\nathletic teams to hard-won victory, or comTake firm root and hold it fast.<br />\nforting them in case of defeat; Black and Blue<br />\nNow's the time, too late to trouble,<br />\nintercollegiate<br />\nlacrosse<br />\nthat has landed the<br />\nWith the moments that have passed.<br />\nchampionship of the United States for three<br />\nIn the springtime of existence,<br />\nsuccessive years; Black and Blue that each prosThat's the time to sow the seed,<br />\npective Hopkins Freshman, while yet grinding<br />\nWork thy field with care and patience,<br />\nat the prep. school, salutes in love and awe!<br />\nPass by not a single weed.<br />\nEven single roots of thistle,<br />\nBlack and Blue belongs to us, and to no one<br />\nMay spread trouble all about,<br />\nelse. We can have no feeling for colors that,<br />\nSo in life, small things cause sorrow,<br />\nbelong<br />\nto<br />\nBlack,<br />\nunder the name of Orange and<br />\nNow's the time to root them out.<br />\nat least three are four other Colleges. Yet<br />\nOpportunity conies kldorn,<br />\neverytime a Hopkins fellow desires to purchase<br />\nIt may not, cannot last,<br />\nTake it, do not let it Mingle,<br />\na flag, a cushion or a picture he is shown the<br />\nWith the moments that have passed.<br />\ninevitable Gold and Sable, and he must either<br />\nor<br />\nTake<br />\nthis lesson to thy heart,<br />\ntake colors for which he has no enthusiasm<br />\nIt<br />\nis<br />\nsad but true,<br />\nthe<br />\ndo without any. We go to the games, see<br />\nAll thy life cannot be springtime,<br />\ndown<br />\nthe<br />\nBlack and Blue jerseys moving up and<br />\nThere must come a winter too.<br />\nfield in battle for a Black and Blue banner, we<br />\nIf thou hast done thy duty,<br />\nwave our hats of Black and Blue silk; but if<br />\nCahn and peaceful wilt thou sleep,<br />\nFor 'tis written in the scriptures,<br />\naccidentally we lose a wager to one we escort,<br />\n\"As thou sowest, thou shalt reap.\"<br />\nand wish to pay it in something Hopkins, the<br />\nLife<br />\nis ever ebbing onward;<br />\nstore—keeper politely shows us the Gold and<br />\nVainly, vainly, we may ask<br />\nSable.<br />\nFor the chances swept far from us,<br />\nTo say the very least, this double set of colors<br />\nWith the moments that have passed.<br />\nN. F. N., JR.,'02.<br />\nis inconvenient to the students. Perhaps it was<br />\nWW<br />\nBlue<br />\nwrong for the students to use Black and<br />\nTEACHER.—\"John, where is the rock of Gibralin athletics, but now that we have done so, is it<br />\ntar, and to whom does it belong?\"<br />\nnot possible for those colors to be ours not only<br />\nJOHNNY (after deep thought).—\"It's in Newark,<br />\nin athletics,but also officially? this is a question<br />\nbelongs to the Prudential Life Insurance<br />\nand<br />\nwhich is respectfully submitted to those who<br />\nCo.\"—Princeton Tiger.<br />\n—B. O. K.<br />\nmay have charge of the matter.<br /><br />\nL<br /><br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br /><br />\nMEMBERS OF<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD OF TRADE.<br /><br />\nCLINTON P. PAINE<br />\nBANKERS<br /><br />\nAND<br /><br />\nNEW YORK AND CHICAGO.<br /><br />\nBROKERS,<br /><br />\nSMOKE UP! RAH! RAH! RAH! HOPKINS!!<br />\nIF<br /><br />\nANYTHING IN TOBACCO YOU WANT<br /><br />\n17OR Class, Fraternity and College Stationery, Banquet Cards,<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nThe Chas. Willms Surgical Instrument Co.<br />\nBENJ. A. NELSON, GEN'L MANAGER.<br /><br />\n'Physicians,' Surgeons,' Hosplial and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br /><br />\n833 MADISON AVENUE<br />\nBOX TRADE A SPECIALTY.<br /><br />\nDrovers &amp; Mechanics National Bank of Baltimore.<br />\nCapital.Stock $300,000.<br /><br />\n229 N. eHARLES ST.<br />\nMASONIC TEMPLE.<br /><br />\nI. D. LANG, TOBACCONIST,<br /><br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br /><br />\nJAS. H. DOWNS,<br /><br />\nCO,<br /><br />\n(Sr<br /><br />\n217 EAST GERMAN STREET,<br />\nBALTIMORE, MD.<br /><br />\nPR1VAIE WIRES TO<br /><br />\nGO TO<br /><br />\nCALL<br /><br />\n300 N. HOWARD ST.<br /><br />\nBALTIMORE, MD.<br /><br />\nMUELLER,<br /><br />\n5 WEST LEXINGTON ST.<br />\nI LONDON STUDIO.)<br /><br />\nSurplus and Profits, $350,000.<br /><br />\nFINEST PHOTOGRAPIC WORK<br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\nSew/a<br /><br />\n270,oosit ...910-tros -For<br /><br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br /><br />\nA. FL FETTING,<br />\n14<br /><br />\nAND 16<br /><br />\nIN THE CITY.<br /><br />\nPcn, yra.00 0,1o,21„u ton.rd.<br /><br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br /><br />\nJ. D. Wheeler, Cashier.<br />\nChas. S. Miller, Ass't Cashier.<br /><br />\nMANUFACTURER OF<br /><br />\ncreek Letter Fraternity<br />\njewelry.<br /><br />\nMORITZ MOSZKOWSKI,<br />\nThe distinguished musician, composer, pianist, and teacher, of<br />\nParis, writes RS follows regarding the<br /><br />\nMASON &amp; HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nrank.\"<br />\n(Signed)<br />\nMoarrz MoszKoWSKI.<br /><br />\nST. PAUL STREET.<br /><br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\nC. H. Hildebrandt &amp; Son, Sole Agts.<br /><br />\nNLW YORK TO BREMEN,<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nof 9r or CABIN PASSAGE AT LOW RATES.<br /><br />\nLONDON, PARIS, GIBRALTAR,<br />\nNAPLES, GENOA. ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nA. SCHUMACHER &amp; CO<br />\nGeneral Agents.<br /><br />\nFor particulars apply to<br />\nk3 k3 SURETY BONDS<br /><br />\nkJ<br /><br />\n321 N. Howard Street.<br /><br />\nDIRECT.<br /><br />\nthe Kranz-Smith<br />\npiano CO.<br /><br />\nAO<br /><br />\n'Fidelity and Deposit Company of Maryland,<br /><br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br /><br />\nDickering, Bradbury and Webster<br /><br />\nite Pianos. itit<br />\nC. eic. P. Phone 2322-2.<br /><br />\nFactory Price.,<br /><br />\nBARTLETT, HAYWARD IS0 CO.<br />\n+ 'founders and Engineers, *.<br />\nWorks, Pratt and Scott Sts.<br />\nOffice Calvert and German Sts.<br />\nManufacturers ofCast and Wrought Iron Work fiir Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults 111111 Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, lint Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers, etc. Columns, Plates, Girders. Beams and Beam<br />\nGirders, Wrought Iron Roof rratning and Road Bridges.<br />\nCHARLES AND LEXINGTON STS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT BOXES.<br /><br />\nEDWIN WARVIELD, Pres't.<br />\nist Vice-Pres't, II. Crawford Black.<br />\n2nd<br />\n\"<br />\nJos. R. litonebraker.<br />\n\"<br />\n3rd<br />\n'rhos. A. Whelan.<br /><br />\nH. E. BOSLER, Sec'y-Treas.<br />\n11 arry Nicodem us,<br />\nAss't Sec'y-Trcas<br /><br />\nBOOKS<br /><br />\nOld and<br /><br />\nThe oldest Old Book Store, and thc largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\nW M. V. PIPPF.N,<br /><br />\n605 N. Eutaw St.<br /><br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\n44figelus,P Automatic Attachments for<br />\nPianos.<br />\nREGINA MUSIC BOXES.<br />\nGRAMOPHONES, ETC,<br /><br />\n\"Washburn\"<br /><br />\n201-203 N. CHARLES STREET<br /><br />\nLUNCH ROOMS!<br /><br />\nHARRY T. mUlTh'S<br /><br />\nTIlE<br />\n1.IC11-IT LUNCH ROOM,<br /><br />\n122 NORTH HOWARD STREET,<br />\nOYSTERS IN ALL STYLES.<br /><br />\nYOUR PATRONAGE SOLICITED.<br /><br />\nSNVITH, DIXON &amp; CO.<br /><br />\noe PAPER 04<br /><br />\n311 N.CHARLES ST<br />\n')<br />\n'rLiZ9<br />\n.<br />\n21f<br />\n;<br /><br />\n29-31 S_ CHARLES ST_<br /><br />\nGlobe<br />\nBrewery<br /><br />\n&lt;55-7<br /><br />\nLAGER BEERS<br />\n'<br />\n4P)<br />\n(V;<br />\n'<br /><br />\nBoldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market,<br /><br />\nWm. B. Oliver.<br /><br />\nJ. Wm. Middendorf.<br /><br />\nMIDDENDORF OLIVER &amp; CO.<br /><br />\nROCHESTER, N. Y.<br /><br />\nBARTHO LOMAY'S Is THE Bohemian<br />\n• ORIGINALAND FAMOUS<br /><br />\nROCHESTER B EE R-. Bavarian<br />\nfflaerzen 13tfau<br />\nApollo<br /><br />\nBALTIMORE<br />\n• B RA NC H<br />\n,GEO.C•S LICRO•<br />\nMANAGER • •• •<br /><br />\n2015 EAST GECRIVIA.N STHEIECT,<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br /><br />\nOffice and Depot, 227-239 S. Central Avenue.<br /><br />\nMD.<br /><br />\nESTABLISHED 1879.<br /><br />\n6111s for<br />\nBrides<br /><br />\nGEO. C. SUCRO, Sole Agent.<br />\nC. &amp; P. Telephone 1060<br />\nHome Telephone 2060<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br /><br />\nIN GREAT VARIETY.<br /><br />\nJAC0113I 4* JENKINS,<br />\n216 N. CHARLES ST.<br /><br />\n®<br /><br />\n217-239S.1ENTILlid:AVE<br /><br />\nBankers and Brokers,<br /><br />\nWedding SilverI<br /><br />\nBartholomay Brewery eo.<br /><br />\nATLANTIC TRANSPORT CO.<br /><br />\nit<br /><br />\nSilversmiths.<br /><br />\n1 BROADWAY<br /><br />\n403-409 WATER ST.<br /><br />\nNEW YORK.<br /><br />\nBALTIMORE.<br /><br />\nHENDERSON'S<br />\nUNIVERSITY<br /><br />\nLawrence B. Kemp, President.<br /><br />\nWilson<br /><br />\nKeyser, Cashier.<br /><br />\nCaffiffiEliCIFIL &amp; FARRIERS NOTIONFIL BANK,<br /><br />\nBOOK STORE,<br /><br />\nHOWARD<br /><br />\nAND<br /><br />\nGERMAN<br /><br />\nSTREETS,<br /><br />\nBALTIMORE, MD.<br />\nTEXT BOOKS, NOTE BOOKS,<br />\nSTUDENTS SUPPLIES.<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nTHE BLAKE CO<br /><br />\nHABERDASHERS<br /><br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nJAMES<br /><br />\nTHEO. WARNER,<br /><br />\nR. PAINE.<br /><br />\nWARNER &amp; CO.<br /><br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nUMBRELLAS, Q HATTERS, Q CANES, ETC<br />\nHIGH GRADE C.4.9e1DS LOW PIIICF.S.<br />\n203<br /><br />\nAgents for Lincoln&amp; Bennett and Walter Barnerd,s London Hats.<br />\n324 W. 13A.1../TINI0RE STREET.<br /><br />\nW. BALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\nMANUFACTURERS OF<br /><br />\nSilk and Cassimere Hats.<br /><br />\nphotographs<br /><br />\nligenfritz<br />\nStudio.<br /><br />\nGushing st companu,<br /><br />\n\n'CHOPKINS<br /><br />\nnil:.<br /><br />\nCAPS.<br /><br />\nLELREs<br />\nRS A<br /><br />\n34 W. BALTIMORE STREET.<br /><br />\nSUCCESSOR<br />\n20<br /><br />\nWEST<br /><br />\nTO<br /><br />\nCUMMINS<br /><br />\nLEXINOTON<br /><br />\nwriaeT.<br /><br />\n•PIECIAL DISCOUNT TO STUDENTS.<br /><br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS SOOKS.<br /><br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University, Johns Hopkins Hospital and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nFIEL,EN 14. 1-101-,LEYDAY,<br />\n800 N. EUTAW<br /><br />\nST.,<br /><br />\nB ALTIMORE, MD.<br /><br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br /><br />\niinbeuser-Busch<br />\nBrewing )Iss'n<br />\nSt. Louis, Mo.<br /><br />\nYou get the benefit of<br />\nall this labor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cata[logue.<br />\nCHAS. M. STIEIPP,<br />\n9 N. Liberty St., Baltimore, Md. 521 nth St., N. W., Washington, I). C.<br /><br />\nB. 0. EICHELBERGER,<br />\nBOOKS AND STATIONERY,<br />\nENGRAVING AND STAMPING.<br />\nNo. 308 North elli_trlexa Street,<br /><br />\nBrew the Best Beers<br />\nin the World.<br /><br />\nY. M. C. A. BUILDING,<br /><br />\n•ALTIMOPIE SPIANCH<br /><br />\nLOUIS ILLMER,<br />\n•<br /><br />\nAgent :Ln.1<br /><br />\nMg.<br /><br />\nC. ci P. Telephone<br />\n2314.<br /><br />\nC.&amp; P. Telephone 2351.<br /><br />\nTONEBRAKER<br />\nBROS.,<br />\n_<br /><br />\nS<br /><br />\n21Z E. Baltimore St.<br /><br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY F.NGRAVED<br />\nSHORT NOTICE.<br /><br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nHOLIDAY SEASON,<br /><br />\nFORD'S!<br /><br />\nTHE THEATRE OF BALTIMORE.,r)<br /><br />\nLes1.4116<br /><br />\nJAN. 21,<br />\nONE<br />\nWEEK.<br /><br />\nLEMMERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br /><br />\nCARTER,<br />\nIN \"ZAZA.\"<br /><br />\nJANIEZ<br />\n- S O'NEILL<br />\nIN \"MONTE CRISTO.\"<br /><br />\nJAN. 28.<br />\nONE<br />\nWEEK.<br /><br />\nNIXON 6c<br />\nZIMMURMAN'S<br /><br />\nACADEMY OF MUSIC!<br /><br />\nWEEK OF<br />\nJAN. 21.<br /><br />\nHENRY 1V1ll..44BR<br />\nIN \"RICHARD SAVAGE.\"<br /><br />\nWEEK OF<br />\nJAN 28.<br /><br />\nIN \":-.WEET ANNIE PAGE.\"<br /><br />\nLULU ()LASER<br /><br />\nLEMMERT<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE.<br /><br />\nLEMMERT.<br /><br />\n14 E. FAYETTE STREET.<br /><br />\nPECIAL DISCOUNT<br /><br />\nS<br /><br />\nSPACE TO LET.<br /><br />\njt<br />\n0<br /><br />\nTo the Students and Nurses of Johns II OpkinS We will make a<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br /><br />\nOUR HEAD, SIR,<br /><br />\nis the noblest part of your<br />\nbody. Inijrovetit.;4)3aITe<br />\n417.-ing OUR HATS.<br /><br />\nMINOR'S,<br /><br />\n.IEFFRES STUDIO, gtv<br /><br />\nUP-TO-DATE,<br /><br />\n218 NORTH EUTAW STREET,<br />\n06 N. CHARLES STREET.<br /><br />\nBALTIMORE, MD<br /><br />\n4<br />\n1.1011,APFEL 6 8E17,<br /><br />\nmandolins<br /><br />\n4,5,„<br /><br />\nONE PRICE.<br /><br />\nb.Z.ZZZaktimaziteatiteepaiteaeeiteiteeeiteeitee,e4:<br />\nMANDOLINS, GUITARS an<br />\n\"Have a tone<br /><br />\nH.&amp;B.<br /><br />\nBANJOS<br /><br />\nThat's all their own.\"<br /><br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br /><br />\nGUITARS AND BANJOS.<br /><br />\nNEAR SARATOGA ST.<br />\nOPEN EVENINGS.<br />\nINSTRUMENTS TAKEN IN EXCHANCE<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\nJ. SMITH,<br />\nSTATO NM=WM MON=NTOZNASNUSWTRUZWATOMOM/a<br />\nDealkw In<br /><br />\nBOOKS<br /><br />\nOld solid<br /><br />\nNeW<br /><br />\nrint,VOLS'aviTHAUMT/SMAY020322=0E,SWESTANSMATAWAN<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE<br /><br />\nBOOKS.<br /><br />\nCall at 805 North Howard Street,<br />\n3 DOORS ABOVE MADISON.<br />\nIT'S RIGHT DOWN ON BALTIMORE STREET.<br /><br />\nCOLLARS.<br /><br />\nBALTIMORE, MD.<br /><br />\n125 EAST, NEAR CALVERT STREET.<br /><br />\nS. hSICRECRSCU000nRQDSCOR 111<br />\nCUFFS<br /><br />\nGLOVES.<br /><br />\n(ISIONEBRA<br />\nKER DPOS<br />\n•<br />\n')k<br />\nI<br /><br />\nr\\tet-5<br /><br />\nLT\\<br /><br />\nvor<br /><br />\n217 E.BALTO.e5T.<br />\nE MD.13ALTIMO<br /><br />\nBRACES.<br /><br />\nUMBRELLAS.<br /><br />\nCANES.<br /><br />\nTIES.<br /><br />\nETC.<br /><br />\nNovember 7th, Iwo.<br />\nWhile visiting the Paris Exposition of 1901, the wonderful display o I<br />\nwines from all parts of the world was made a special study by our representative, who secured some very tine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Canet, Chateau Larose, Chateau Lalitte, Chatcau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nfind Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintag.s Deinhard &amp; Co.'s celebrated Rhine<br />\n\\Vines selected while visiting their great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Olney Forrester &amp; Co.'s exhibit; It very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br /><br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\nSTONEBRAKER BROTHERS,<br />\n217 E. BALTIMORE ST.,<br /><br />\not<br /><br />\nADVERTISE IN THE \"NEWS LETTER.\"<br /><br />\nBALTIMORE, MD,<br /><br />\n04 ot<br /><br />"}], "field_media_file": [{"target_id": 36173, "display": null, "description": null, "target_type": "file", "target_uuid": "ca861b77-ec67-4f82-80a2-58eb12c3852d", "url": "http://digital.library.jhu.edu/system/files/2022-03/12162-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12162, "target_type": "node", "target_uuid": "29d159de-b85a-4a53-85fa-9a23d3bacba7", "url": "/node/12162"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "583a086e-ee62-4cd9-a45e-6bfb714beddb"}]}