{"mid": [{"value": 37031}], "uuid": [{"value": "01ecfb46-e582-4f05-9ba3-db5983a27553"}], "vid": [{"value": 37031}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:58:18+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13149-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:58:18+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:58:18+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXIX, No 19<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 9, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\n••••••<br />\n<br />\nHOPKINS ASSUMES ROLE OF UNCERTAINTY MARKS LULL MORAL MESSAGE BROUGHT<br />\nNATION-WIDE<br />\nPRECEDING OPENING OF<br />\nTO ASSEMBLY BY DR.<br />\nTEACHER<br />\nVAN DEUSEN<br />\nWINTER SPORTS<br />\nJohns Hopkins Alumni Represented in Lacrosse, Track and Rifle Teams Only Speaks in Place of Sherwood Eddy<br />\n19 States on Faculties of LeadAudience Stirred by Appeal for<br />\nAssured Sports in Cold<br />\ning Institutions<br />\nSpiritual Revival<br />\nSeason<br />\n<br />\nLOWLY FRESHMEN BEAT<br />\nSOPHS IN FOOTBALL AND<br />\nRUSH AT HOMEWOOD FIELD<br />\n<br />\nRegulations Remain Because of Sophomore's Victory in Baseball;<br />\nTaking the place of Mr. SherJohns Hopkins University takes<br />\nNow that the cheers of football<br />\nFrosh Upset Dope by Winning Game<br />\non the aspect of a national training fandom have resounded through wood Eddy, who was unexpectschool for college professors when the foliage-bereft woods of Home- edly prevented from attending the Superiority in Numbers Gives First Passes Pave Way for Freshman VicYear Men Big Advantage in<br />\ntory. Brown and McNeal Play<br />\nthe number of Hopkins men on the wood for the last time this year, the Assembly last Thursday, Dr. Pitt<br />\nDefending Flag<br />\nBest for Sophs<br />\nfaculties of the leading universi- campus of the Johns Hopkins Uni- Van Deusen addressed the stuStriving to regain their former<br />\nA well drilled Freshman team<br />\nties are considered. The Half- versity is pervaded with a silent and dent body on the importance of prestige over the usually downemerged victorious last Saturday<br />\nCentury Book, a little publication expectant air. •That idle interval in the attitude taken toward the se- trodden Freshmen, the Sophofrom a close but loosely played<br />\nof live statistics gotten out by the collegiate sports which invariably rious problems of the present day. mores battled with a desperate<br />\ncontest with the Sophomores.<br />\nHalf-Century Committee, states that follows the climax of the football Dean Ames presented him and pertinaciousness last Saturday at<br />\nWhen they entered the second<br />\nsaid that, although the unavoid985 Johns Hopkins graduates are season, is not lacking this year in<br />\nHomewood<br />\nin<br />\nthe<br />\nannual<br />\nclass<br />\nhalf<br />\nthey were trailing by a 6-0<br />\nnow on the faculties' of colleges, uncertainty and speculation regard- able absence of Mr. Eddy was ex- rush. As arranged<br />\nby<br />\nthe<br />\nStuscore, and had shown nothing in<br />\ntremely disappointing, he was<br />\ntechnical schools, and universities ing winter sports.<br />\nfortunate in securing the services dent Council the goal was a strip the way of a consistant attack.<br />\nthroughout the United States. Over<br />\nPresent conditions indicate that of the speaker, who is a graduate of canvas tied to a greased pole, About the middle of me third<br />\n350 men are with 24 of the forethe only sports which are certain to of Princeton and of the Union and surrounded by a band of quarter they launched a series of<br />\nmost educational centres of the<br />\nTheological<br />\nSeminary,<br />\nNew sturdy Freshmen outnumbering<br />\nbe active this winter are lacrosse,<br />\nperfectly-executed forward passes<br />\ncountry.<br />\nYork.<br />\ntheir seniors three to one.<br />\n17 Hopkins Teachers at Maryland track, and rifle. As has been the<br />\nwith Reed on the receiving end,<br />\nContrasts Powers of Imagination<br />\nOdds Against Sophomores<br />\nPrinceton's faculty contains 23 case in previous years, there will be<br />\nwhich<br />\nbrought them, by the last<br />\nIf the address were put in writFacing such odds, however,<br />\nHopkins graduates, Yale has 22, no abatement in the lacrosse prac- ing, an<br />\nillustrative title would be was a mere trifle to the Sopho- period, to the opponents' two-yard<br />\nColumbia 21, and Harvard, Stan- tice which will continue to be held \"On Our<br />\nBlindness\". With free- mores. With the sound of Ref- line. Here the Soph defense<br />\nford, Minnesota, and Wisconsin 20<br />\nly<br />\nflowing<br />\nFriphrases and a certain eree Tom Magill's whistle, they tightened and held for two downs,<br />\nand<br />\nWednesdays,<br />\nTuesdays,<br />\non<br />\neach.<br />\ngracefulness<br />\nof expression,. Dr. set about \"getting that flag\" with but on the third attempt Calidays. The Black and Blue squad<br />\nThe great surprise is the fact that<br />\nwill be augmented by the men re- Van Deusen warned against shut- a will. One after another would brissi carried the ball<br />\nover. •With<br />\nHopkins has bestowed 17 of her<br />\nleased from football. Lacrosse, ting our eyes to the meanings of work his way through the seeth- the excitement of both<br />\nrooting<br />\nsons on her greatest rival—the Uniwhen it comes to weathering the facts about us; to the spiritual ing mob milling about the pole sections at a fever heat, he<br />\nsettled<br />\nversity of Maryland.<br />\nelements, has proved itself the stur- meaning of life; and, most vital of until he actually had started to the outcome of the game by dropThere are 10 or more Johns Hopdiest of sports.<br />\nall, to the destiny of our own lives. ascend it, only to have his shirt kicking for the extra point.<br />\nkins alumni on the teaching staffs<br />\nThe speaker dwelt particularly on or sweater ripped off by clutching<br />\nIndoor Track Started<br />\nof the most important colleges of<br />\nSophs Get Touchdown<br />\nimportance of a person's point hands. When at last his strength<br />\nthe<br />\n19 different states. From Texas This 'week indoor track practice<br />\nIn the first half the Sophoin the South to Minnesota in the is being held at the Fifth Regiment of view. For instance, two peo- forced him to release his grasp, he mores held the edge. Although<br />\nple look at the same beautiful ob- went hurtling through the air to<br />\n.North, from California in the West Armory, which building has served<br />\nland ignominiously at the outside their attack lacked punch, and<br />\nto a solid band of the Eastern this purpose for a number of years. ject. One is stirred deeply; the<br />\nthey were guilty of frequent fumother remains unmoved. The dif- rim of hostilities. Only once durStates the U. S. A. is being edu- Robert Heyn, captain of the track<br />\nbles, McNeal constantly gained<br />\nference lies \"not in the seeing ca- ing the two halves did a Sophocated in a large measure by Johns team, is busy preparing his teamground<br />\nin exchanges of punts, and<br />\nmates for the coming tests. The pacity of the two people, but in more get his head and shoulders managed to keep the ball for<br />\nHopkins.<br />\nthe<br />\nthe power of their imaginations.\" above the crowd. He, too, soon<br />\nThe figures of the Handbook, rifle team is entering into one of the<br />\nmost<br />\npart<br />\nin<br />\nFreshman<br />\nterritory.<br />\nsuffered the same fate as his combased on 5.000 living alumni, are most active seasons in its history. Cites Eddy's Fear of Class Strife<br />\nThe Sophomores' touchdown<br />\nRumors and counter-rumors are<br />\nDr. Van Deusen seemed con- panions.<br />\nas follows:<br />\ncome in the second period. With<br />\nSome Sophs Forcibly Ejected<br />\nswimming<br />\ncirculating<br />\nthe<br />\nvinced<br />\nabout<br />\nlive<br />\nin<br />\none<br />\nwe<br />\nof<br />\nthe<br />\nthat<br />\nthe<br />\nball on the Frosh 30-yard line,<br />\nPrinceton<br />\n23<br />\nteam. According to Norman Chase great crisis periods of the world. Several Freshmen took partic- Brown, whose defensive work was<br />\nYale<br />\n22<br />\n21<br />\nColumbia<br />\nKeyes, Graduate Manager of Ath- He quotes Mr. Eddy: \"My most ular glee in trailing those second one of the features throughout<br />\n20<br />\nHarvard<br />\nletics, no success has been met in outstanding impression of the year men that had enforced reg- the entire game, broke through,<br />\n20<br />\nStanford<br />\nMinnesota<br />\n20<br />\nthe search for an available swim- world today is a sense of the wide ulations more than the others. and for the second time in the<br />\nWisconsin<br />\n20<br />\n_<br />\nming pool. For this reason, he in- spread misunderstanding, strife, Time and again three or four of afternoon, blocked a punt which<br />\nCalifornia<br />\n18<br />\nMaryland<br />\n17<br />\ntimates, the 1925 swimming team and industrial unrest.\" \"This the Freshies would dump one of Gibson recovered. With a score<br />\nCornell<br />\n15<br />\nis an uncertainty. Campus opinion, condition,\" the speaker went on, these Sophs in the mud and in their grasp, the Sophs fumIllinois<br />\n15<br />\nChicago<br />\n14<br />\nhowever, expresses little fear of \"is the result of a fearful race be- scamper back to the onslaught. bled on the first play and lost the<br />\nPennsylvania<br />\n14<br />\ntween two great forces; the grad- As soon as the Sophomore re- ball. The Freshmen, however,<br />\nthe<br />\nloss of this important sport.<br />\nVirginia<br />\n14<br />\nEmory<br />\n13<br />\nual uprising of discontent among (rained his breath he would run were unable to gain, and when<br />\nRumors Unfounded<br />\nOhio State<br />\n12<br />\nunderprivileged and leap over the heads of the they again attempted to punt,<br />\nThere will be no basketball, soc- the so-called<br />\nNorth Carolina<br />\n11<br />\nRochester<br />\n11<br />\ncer, or golf 'teams at Johns Hop- classes and the slow concession of others in an erideavor to reach Brown raced in for his third<br />\nWashington Univ., St. Louis 11<br />\nblocked kick, putting the ball in<br />\nkins this year. Rumors of the re- opportunity. of the higher orders the much-desired pole.<br />\n11<br />\nWestern Reserve<br />\nEach half of the melee was like the possession of his own team.<br />\nNaval Academy<br />\nYou men will no<br />\n10<br />\nvival of the former sport and of of society.<br />\nTexas<br />\n10<br />\nthe initiation of the others are un- doubt live to see the outcome of the other with the exception of With about five yards to go, McTulane<br />\n10<br />\nchange in spirit. The first Neal, on two plays through cenVanderbilt<br />\n10<br />\nfounded, according to Graduate this race. If the reconstruction the<br />\nsaw the Sophomores at the ter, took the ball over. His drophalf<br />\nManager Keyes, who was not pre- of the industrial order can keep<br />\nTotal<br />\n362<br />\nheight<br />\nof their glory. They were kick failed, but at that stage<br />\nIn other institutions<br />\n623<br />\nof<br />\npared to release definite informa- pace with the growing dissatisleading<br />\nthe Freshies 6 to 0 in the the game it did not seem imporof<br />\nthe<br />\nfaction<br />\nlower<br />\nclasses,<br />\nthe<br />\ntion concerning the \"certain\" sports.<br />\nGRAND TOTAL<br />\n985<br />\nresult will be peace and prosper- game and were planning to lose tant, since the Sophomores<br />\nity. If the race is lost—who no time in gaining the flag. All seemed to have the better team.<br />\nSERVICE<br />\nSEEN<br />\nYEARS<br />\nTWENTY-EIGHT<br />\nknows? The breakdown or the their schemes Went amiss, how-. Neither side threatened from the<br />\nBY NIGHT WATCHMAN OF UNIVERSITY progress of civilization is the is- ever, and after the game at the time play was resumed until the<br />\nstart of the second half of the second half.<br />\nsue.\"<br />\nJames J. McCall, veteran night said, \"I work twelve hours a day.<br />\nrush it was the Freshmen who<br />\nSpiritual Revival to the Rescue<br />\nAlthough the crowd and the<br />\nwatchman of the University, who is In the Old days at McCoy Hall I \"As I. see the situation,\" the were bubbling over with configame itself may have lacked some<br />\ndelighted with a change in working had long hours, from 7 to 7, but speaker continued,\"a spiritual re- dence, while the Sophs presented of the<br />\ncolor of the Varsity games,<br />\nhours made nine years ago, walks now, for the last nine years, I only vival is the only power that can woeful faces.<br />\nthe officials didn't. Not in regard<br />\ndailY, rain or shine, from his home work from 6 to 6.\"<br />\nsave civilization. In any age,<br />\nFreshmen Want to Keep Flag<br />\nto their work, which was excelat 4907 Crawson Avenue, in the viEach evening, near the hour of there is the eternal struggle beWhen, at last, the final whistle lent, hut to their costumes, which<br />\ncinity of Harford Road, to Home- six, the white-haired old gentleman tween right and wrong, with 'truth blew, a Freshman shinneyed up may have been excellent, but<br />\nW.00d.<br />\nmay be seen trudging toward GilContinued on page 2, col. 4.<br />\nthe pole and retrieved the flag; were also original. Magill was<br />\nTwenty-eight years ago McCall, man Hall. In the first glow of<br />\nbut as he alighted he was pounced within time limits of convention,<br />\nMade physically unfit by the busi- dawn, or if there is no sunrise,<br />\nby several Sophs and another but it has never been the custom<br />\non<br />\nNOTICE<br />\nness of<br />\nhouse painting, entered the through a mist of rain or a veil of<br />\nbattle<br />\nwas in the making. Magill at Homewood for an umpire to<br />\nThe Johns Hopkins Musical<br />\nClubs will give a concert for the<br />\neinPloy of Johns Hopkins Univer- snow one may see him retracing his<br />\nthen saved the day by taking the appear in a lacrosse hat, or a head<br />\nbenefit of the Bryn Mawr<br />\nsity. His recollections of McCoy steps, walking less spryly than on<br />\nlinesman to wear a baseball cap<br />\ncloth himself.<br />\nLeague, at the Hotel Belvedere,<br />\n-tsiall and the old Hopkins buildings the preceeding evening, but.if one<br />\non Thursday, December 18, at<br />\nAfter the rush the Sophomores and supplement his linesman's<br />\n8.30 P. M. Dancing until 2 P.<br />\nrecently destroyed by fire, are joy- can get close enough to him, greetdecided upon an unusually stren- stick with a cane.<br />\nM. Tickets may be obtained from<br />\nful ones of restored health.<br />\ning the world with same kindly<br />\nuous \"pep\" week for the Frosh, The period between the halves<br />\nR. C. Tilghman.<br />\nWhen interviewed by the report- twinkle in his eye. When the roads<br />\nto keep them from becoming was marked by the absence of the<br />\nC. M. Ripley, E.E., will lec\"swell-headed\".<br />\nThe Sophomore usual vocal duel of rival rooting<br />\ner, of the NEWS-LETTER for his are covered with snow the old vetture at 4.15 P. M. on Friday, in<br />\n°Pinion of his term in the Univer- eran picks his way through the<br />\nRoom 110, M. E. Building, on<br />\nvictory, over the Freshmen in sections, as both the Freshman<br />\n\"The Romance of the Electric<br />\nsitY employ, McCall was inclined tracks made by early vehicular trafbaseball prevented the removal hordes and the thin red line of<br />\nMotor.\"<br />\nof their regulations.<br />\nt° appear well pleased. \"Well,\" he fic.<br />\nContinued on page 4, col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS- LETTER, DECEMBER 9, 1924<br />\n<br />\n2<br />\n<br />\nINTRAMURAL MATCH HELD;<br />\nRIFLE CLUB TO BEGIN<br />\nVernon 4986<br />\nSCHEDULE SOON<br />\nAt the rifle match held last Sat-Say It With Flowers\"<br />\nBARNSTORMERS<br />\nFOUNDED 1897<br />\nurday in the North Loft prizes<br />\nPresent<br />\nwere awarded tl-le three best shots.<br />\n$2.00<br />\nSubscription<br />\n\"THE TRUTH WILL There was a tie for third place bePREVAIL\"<br />\ntween Graf and Armstrong, which<br />\n\"COATS\"<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nnecessitated drawing lots for the<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n\"THE MANEATERS' winner. Fate smiled upon Graf<br />\n1822 N. CHARLES STREET<br />\nas Armstrong drew out the short<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nstick.<br />\nHopkins University.<br />\nA mood is a queer thing; it can<br />\nCollege and Fraternity Stationery<br />\ndictate one's feelings toward his<br />\nThe match was shot from the Banquet and Dance Cards, Invitations<br />\nsurroundings, making things sad kneeling position, and 100 was<br />\nJAS. H. DOWNS<br />\nBusiness communications should be addressed to the BUSINESS MANor<br />\nbright, pleasant or unpleasant. the highest possible score. The<br />\nAGER, JOHNS HbPKINS UNIVERSITY; all articles and other communications<br />\nENGRAVER PRINTER STATIONER<br />\nshould be sent to the MANAGING EDITOR.<br />\nSaturday night at the Barnstormresults were as follows:<br />\n229 N. CHARLES ST.<br />\ners' try-outs everything was<br />\nFirst place—T. H. T. Brady, 89.<br />\ndownright pleasant. We sat with<br />\nHomewood 0100<br />\nTelephone<br />\nfeet on chairs, smoking cigarettes<br />\nSecond place—L. M. Rawlings,<br />\n(bummed from the President of 88<br />\nthe Club) and made ourselves<br />\nThird piace—W. Graf and J. G.<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\ncomfortable. And so we viewed<br />\nArmstrong,<br />\nR. CARMICHAEL TILGHMAN, '25<br />\n83.<br />\nPHILIP W. HOWARD, '25<br />\nthe one-act plays in a more or<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nSMITH & CO.<br />\nFlorists<br />\n<br />\nManaging Editor<br />\nALGER HISS, '26<br />\n<br />\nless rosy light.<br />\nThe Rifle Club is working hard<br />\n\"The Truth Will Prevail\" is a in preparation for its first interAssistant Managing Editor<br />\nclever little skit by Mr. G. Pon- collegiate match, with the UniverERNEST A. STRATHMAN, '26<br />\nder, of Playshop fame. It was sity of Chicago, to be held this<br />\nAssociate Editors<br />\n(lone<br />\nrather well by the Fresh- week. Fines for the use of proCirculation Manager<br />\nBENJAMIN T. ROME, '25<br />\nman<br />\nactors,<br />\nand on the whole pre- fanity and -trial matches are bringARTHUR L. NELSON, '26<br />\nOTHO J. KELLER, III, '26<br />\nHENRY R. TURNBULL, '26<br />\nsented fair entertainment. \"Bill\" ing about strict observance of regA. RISLEY ENSOR, '26<br />\nRodgers was a decent enough ulations and a high grade of acJunior Editors<br />\nAssistant Business Managers<br />\nwoman; the rest were so-so, the curacy in practice shooting.<br />\nEDWARD 0. MICHEI„ '26<br />\nWatch him at the \"Prom.\" He's<br />\nKIDD,<br />\n'26<br />\nJACKSON<br />\nJ.<br />\nplaylet<br />\nwas good enough to carry<br />\nJAMES YOUNG, '25<br />\nthere with perfect ballroom conThe match team will consist of<br />\nJ. HENRY JARRETT, '27<br />\nT. STRAN SUMMERS, '25<br />\ndition from soles of his patent<br />\nthe characters, as acted, along.<br />\nfifteen men. Four positions will<br />\nCHARLES F. REESE, '27<br />\npumps to top of his glossy dome.<br />\nHEYWARD E. BOYCE, JR., '27<br />\nW. BARNES HALL, '27<br />\n\"Coats,\" an effort by Lady be used: prone, sitting, standing,<br />\nHe's just as neat after the twentieth<br />\nSAUF.RWEIN, '26<br />\nROBERT<br />\nP.<br />\nWILLIAM E. THOMSEN, JR., '26<br />\ndance as during the first fox trot. There's<br />\nGregory, who must have been ill and kneeling. The final score will<br />\nARTHUR SWANSON, '27<br />\nRICHARD R. GRIFFITH, '28<br />\nno secret about his method. \"Vaseline\"<br />\nHair Tonic goes to his head regularly.<br />\nROBERT S. JACOBS, '25<br />\nRALPH KIRKLEY, '28<br />\nwith the bubonic plague when she be the totals of the ten highest<br />\nIt makes his hair silky and manageable<br />\nwrote it, was next. This sketch scores on each team.<br />\nand prevents dandruff. At all drug stores<br />\nand student barber shops.<br />\nwould give me a fine chance to<br />\nEvery\"Vaseline\"Product is recomA<br />\nprize<br />\nmatch has been schedmended everywhere because of its<br />\nMember Southern Intercollegiate Newspaper Association<br />\nWaX sarcastic, to make plenty oi<br />\nabsolute Purity and effectiveness.<br />\nmean cracks about the play and uled for December 23, which will<br />\nthe cast, but I'm too hellish lazy. be the final meeting of the team<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nThe play was too much for the before Christmas. It has been<br />\nREG.U.S. PAT.OPP.<br />\nactors' powers; a dialogue is a agreed •that the eight men who<br />\ntroublesome thing to put across. make the lowest score will give a<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 9, 1924<br />\nFurthermore, while I am not an theatre party t6 the seven highest<br />\nFor the Health and<br />\nAppearance of the Hair<br />\nscorers.<br />\nexponent of realism, I think it's<br />\nChesebrough Mfg. Co.,(Cons'd)<br />\nstretching things a bit too far<br />\nState Street<br />\nNew York<br />\nTo bring about a stricter ob—<br />\nwhen a gentleman of Hebrew deservance of the minor rules of the<br />\nscent is cast as an Irishman. He<br />\nrange a fine of five cents a word<br />\nA WISE RULING<br />\nis temperamentally unfit for the<br />\nhas been placed upon profanity.<br />\nThe action of the Student Council in adopting a fixed policy on Part.<br />\nThe box, which is steadily increasthe question of proxies is certainly wise and warranted. At the last<br />\nThe final play was the best.<br />\ning in weight, will be emptied into<br />\nStudent Council meeting a ruling was passed which prohibits the use \"Maneaters\" was written, accordthe pocket of the winner of the<br />\nof proxies in all elections. However, the new ruling provides that ing to President Hiss, by \"God<br />\nPrize Match.<br />\nin the event it is necessary for a student to be absent from an .elec- knows who.\" Gordon Stick, who<br />\nghe &west selling augat<br />\npencilin the world<br />\ntion, he is permitted to cast his vote, provided he presents a proper directed the play, deserves credit<br />\nPOR thestudentor prof.,the<br />\nexcuse, prior to the election, to a member of the Student Council and for an imaginative piece of work.<br />\nsuperb VENUS out-rivals<br />\nDR. VAN DEUSEN MAKES<br />\nall for perfect pencil work.<br />\nvotes the ballot in the presence of the Student Council member. Oscar Giese gets honorable menADDRESS<br />\n17 black degrees-3 copying.<br />\nThe Student Council will count only those proxies that are handled tion for really good acting, as<br />\nContinued from page 1<br />\nAmerican Lead<br />\nby its members previous to the election.<br />\ndoes Jerome Shapiro. This was a forever on the scaffold' and<br />\nPencil Co.<br />\n220 Fifth Ave.<br />\nwell worthwhile effort.<br />\nNew York<br />\n'wrong forever on the throne.' The<br />\nIt is obvious that in the future the power of campus political<br />\nThe<br />\nBarnstormers<br />\nare<br />\ndoing<br />\npresence<br />\nof<br />\nthis<br />\nstruggle<br />\nis<br />\nexconspiracies will be lessened. At the same time, under the provisions of the new ruling, a student having conflicting engagements is good work; may the Lord pre- emplified in the slums of a great<br />\nWrite for<br />\nallowed to vote. The News-Letter, voicing the general campus vent them from becoming too city, in history, in your own life.<br />\nbooklet on<br />\nVENUS Pencils and<br />\nopinion, feels that by the passage of this ruling on proxies a great serious. In spite of the lack of What are you going to do about<br />\nVENUS EVERPOINTED<br />\nMechanical Pencils<br />\nwomen, there was one in the cast, it?\"<br />\nstep toward \"clearing up\" campus elections has been made.<br />\nthe \"Maneaters\" almost came up<br />\nBefore concluding his talk, Dr.<br />\nto the standard of the rival \"PlayVan<br />\nDeusen laid special stress on<br />\nshop\" production of the same<br />\nvalue<br />\nthe<br />\nof a Christian interprepiece last spring.<br />\nTHE INFORMALS<br />\ntation of life. \"Can you not feel<br />\nFinally, President Hiss anthe presence of a Divine Power?\"<br />\nThe change in the system of work and study from \"prep\" nounced that no<br />\nhigh standard of<br />\nhe asked. \"Go outdoors on a<br />\nschool to college is very marked. Several weeks for adjustment to production was being<br />\nattempted,<br />\n,the new methods in the institution of higher learning are necessary no scenic or lighting effects were clear night; stretch your imagi'be mama,nation. Do you feel no meaning<br />\nfor the first year men. Whether or not the freshmen are \"learning the result of<br />\nspecial effort. After<br />\ndandivpmayConsider the<br />\nthe ropes\" and the upperclassmen are applying their acquired knowl- looking at scenery, costumes and in the universe?<br />\n17 leads—all dealers<br />\nsmallest wild-flower of the field.<br />\nedge is determined 1.3y giving inf6rma1 grades.<br />\nlighting, we believe the gentleDo you place no significance in<br />\nAn informal mark is not in every case an indication of failure. man spoke true in every particits beauty? God reveals himself,<br />\nIt is more of a warning. That the early months of the college year ular. They were terrible.<br />\nif you want to see him. What<br />\nH. R. O.<br />\nare filled with activity—football, fraternity rushing and so on, is<br />\nare ybu going to do with your<br />\nDamon—<br />\ntrue. But that's all over now. With these distractions behind us<br />\n\"What was the name of that pencil<br />\nlife?<br />\nWhere<br />\nwill<br />\nyour<br />\nsocial<br />\ninProfessor Williams was recomwe can perhaps settle down to less interrupted study. There is still<br />\nmending this morning?\"<br />\nterests<br />\nlie?<br />\nWill<br />\nyour<br />\nvocation<br />\nHave You Ever Tried It?<br />\na month and a half before the midyear examinations.<br />\nPythias—<br />\nbe a career of service? In the<br />\n\"Eldorado—my boy, Eldorado!<br />\nYou see a pretty girl walking<br />\nJust think of a fabled land of<br />\nFreshmen especially should take warning. Theirs is the largest<br />\nwords of Carlyle, 'Wilt thou be a<br />\nease and happiness—where no one<br />\ndown the street. She is singular,<br />\nflunks—where pencils are the magic<br />\nclass in the University and will be extensively weeded out. If we<br />\ncoward, or wilt thou be a hero?'<br />\nsticks of achievement. Then you<br />\nyou nominative. You walk across<br />\ncan never forget it.\"<br />\nare permitted to make use of a trite expression, we simply say, \"A<br />\nWhat we want today is men of<br />\nto<br />\nher,<br />\nyou<br />\nchange<br />\nto<br />\nplural,<br />\nthen<br />\nwise<br />\nis<br />\nthe<br />\nsufficient.\"<br />\nword to<br />\nmoral and spiritual vision.\"<br />\nit becomes dative. You walk<br />\nhome with her. Her mother beAt the conclusion of the ad- SHIRTS<br />\nNECKWEAR<br />\ncomes accusative and you become dress it was announced that tickThe News-Letter regrets to announce the resignation of C. Donald Geiske,<br />\nimperative. You kiss her and she et booklet returns must be made<br />\n25, from the position of Assistant Business Manager.<br />\nbecomes masculine. .Things are to the June Week Committee by<br />\nThe News-Letter is pleased to announce the election of Henry R. Turn- tense,<br />\n421 N. HOWARD ST.<br />\nher father becomes pres- Wednesday, December<br />\n10th.<br />\nbull, '26, and A. Risley Ensor, '26, to the position of Associate Editor; of Richent, and you become a past prin- There was no yell practice. No<br />\nard R. Griffith, '28, and Ralph Kirkley, '28, to the position of Junior Editor;<br />\nHOSIERY<br />\nGLOVES<br />\nciple.—Obelisk.<br />\npandemonium.<br />\nand of Robert S. Jacobs, '25, to the position of Assistant Business Manager.<br />\n<br />\nar<br />\nat<br />\nft<br />\n<br />\n111<br />\n<br />\ntli<br />\n<br />\ntC<br />\n<br />\nit<br />\n<br />\nii<br />\n<br />\nit<br />\nii<br />\n<br />\n31<br />\n<br />\nti<br />\nf;<br />\n<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\n<br />\nThe winnint!<br />\n<br />\nstrideu<br />\n<br />\naseline<br />\n<br />\nHAIR TONIC<br />\n<br />\nENUS<br />\nPENCILS<br />\n<br />\nLeFranc & Ault<br />\n<br />\n1<br />\n<br />\n\fms<br />\n<br />\nER<br />\n<br />\n'THE JOHNS HOPKINS NEWS LETTER, DECEMBER 9. 1924<br />\n<br />\nREVERIES<br />\nBY OLD ALUMNUS<br />\n<br />\nNow that the normally unbalanced undergraduate mind has<br />\nabout turned away from the 1924<br />\nfootball season, perhaps Old Alumnus can make a suggestion for 1925.<br />\nNone of the old-timers I've seen<br />\nthis year registered enthusiasm<br />\nover the '24 schedule, but I tried<br />\nto placate 'em by explaining that<br />\nit was only to serve as a training<br />\nfor next year.<br />\n<br />\n1COMMITTEE REPORTS<br />\nFRATERNITIES AT<br />\nCONFERENCE<br />\n<br />\nON<br />\n<br />\nOne Year's Research Represented in<br />\nWork of Committee Appointed by<br />\nInterfraternity Conference<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\n<br />\nAims and ideals of modern fraternities were thorotigmly discussed in the report issued at the<br />\nInterfraternity Conference. The interest.<br />\nconference, at which Bayard P.<br />\nFonda represented Johns Hop- The Editor of the NEWS-LETTER.<br />\nkins, had appointed a committee Dear Sir:<br />\nthe previous year for this work,<br />\nWhy do you allow such ignorant<br />\nand the finished report of this<br />\nmorons as \"1-1: R. T.\" to criticise<br />\ncommittee was given to the conthe<br />\nwork of such eminent organizaThe moleskin artists who share ference.<br />\ntion as the \"Homewood Playshop\"?<br />\nmy reveries are almost unanimous<br />\nAs a result of an extensive can- His so-called review; in your last<br />\nin calling for Virginia and Swarthvass of all American Greek-letter issue was an example of college<br />\n'fore on the next schedule, and obfraternities the report announces, in journalism, rather of its decay.<br />\nject vociferously to playing more<br />\nsummary, that these are the fraterthan two state team. The bill of<br />\nThe acting was fine, in many cases<br />\nnity aims and ideals: recognition of<br />\nrivaling professional work, and the<br />\nfare representing the consensus of<br />\nand a proper respect for the Diety,<br />\nplay itself was great. Both of these<br />\nopinion, one they swear will promoral living, discouragement of<br />\nthings were disparaged by H: R.<br />\nduce many nip-and-tuck battles. and<br />\ngambling, discouragement of the<br />\nT. I do not see how the consumWill prove revenue-producers, foluse of liquor, a premium upon<br />\nate ass could miss these things, no<br />\nlows:<br />\nfriendship, emphasis upon the virmatter what microscopic defects<br />\n'William and Mary or Mt. St. M. tues of honesty and integrity, enhe could find elsewhere. In these<br />\nWashington and Lee or V. M. I. couragement of the practice of<br />\nmatters I know whereof I speak,<br />\nSwarthmore.<br />\ncharity.<br />\nfor I am<br />\nPittsburgh or Rutgers (away).<br />\nFraternities Help Education<br />\nA MEMBER OF TIIE PLAYSHOP.<br />\nSt. John's.<br />\nUpon their individual members,<br />\nVirginia.<br />\naccording to the report, fraterniMaryland:<br />\nTo the Editor of the NEWSties sincerely and earnestly attempt<br />\nLETTER.<br />\nAll of these are within reason- to play their role as a vital and helpable guarantee distance and none ful part of the machinery of educaDear Sir:<br />\nof the home opponents will be con- tion by encouraging high scholarIn reply to the above letter of the<br />\ncededly stronger than Hopkins next ship, requiring participation in \"Playshop Member,\" let me say<br />\nYear.<br />\ncampus activities and urging col- that it is characteristic in its politelege loyalty.<br />\n'Member Bobby Hoffman '20,<br />\nness and in its cock-sure knowledge<br />\nThe weight of influence of fra- of everything pertaining to the<br />\nwhose talented toe downed Maryland 3-0 in 1915 and helped in ternities in matters pertaining to drama. Last year when the reviews<br />\ncommunity interest the committee<br />\nmany another victory. Bobby is<br />\nof the NEWS-LETTER critic found<br />\nsummarizes as follows: fraternities<br />\n\"dropping them over\" these days are intensely patriotic, promote con- little fault with the Playshop he<br />\nWith an engineering sales company cord among groups of different re- was rated as one of the Homewood<br />\nin Rochester. Wants Princeton back ligious and racial and political back- intelligentsia, now he is an \"ignoron the schedule.<br />\ngrounds, teach the duty and privi- ant moron,\" and a \"consumate ass,\"<br />\nlege _of service to mankind, de- for daring to tell what he thought<br />\nBill Alderson and Milt Egner,<br />\nnounce snobbery and the fetish of<br />\nengineers of '23, who are making social demarcation on the basis of of the production. Hooray for the<br />\nPlayshop, and its ever brilliant acmillions for the General Electric wealth or family, foster to a subtors and actorines.<br />\nCompany in Schenectady, asked to stantial extent participation in soYours truly,<br />\nbe remembered to \"the gang\" and cial service or philanthropic work.<br />\nsaid they wished State all sorts of<br />\nbad luck.<br />\nBut there's not a young 'un of<br />\nthe lot who is with you in spirit<br />\nmore than Charlie Winne '87, M.D.<br />\n01. He and Joe f_.ai,vreti-Ce, M. D.<br />\n16, get together occasionally and<br />\ntell Albany just what old J. H. U.<br />\nreally is. Another Albanyite who<br />\nIs greatly interested in the University is young Huntington Williams,<br />\nM. D. '19, D. P. H.'21, whose father was so prominently connected<br />\nWith the institution. He is doing<br />\nPublic Health work in Albany. Dr.<br />\ntawrence has just given up that<br />\nWork to accept the post of Medical<br />\ntxecutive of the New York State<br />\nMedical Society, a unique position<br />\nIn which he has contact with 10,000 medical men of the State.<br />\nHerb Adams, another A. V.. of<br />\n.97, is a high muck-a-muck with the<br />\nastman Kodak Company in Rochester. Ed. Hoffmeister is a native of the same city and is teaching geology at Rochester UniversltY. Took his A. B. in '20 and his<br />\nPh.D. in '23. The Dean of the institution, by the way, is Dr. Charles<br />\nHoeing, Ph. D. '98.<br />\nWell, I hear the future Hopkinsne yelling so I must close. I be\"eve it was Teddy Morrison who<br />\nsaid, \"I just won't get married till<br />\nI have plenty of money.\"<br />\n<br />\nThe committee is frank to admit<br />\nthat undoubtedly these aims and<br />\nideals of college fraternities are<br />\nnot always lived up to. The question of the effectiveness of the aims<br />\nand ideals was not gone into, for<br />\nthe committee sought only an authoritative analysis of the fundamentals as announced by responsible fraternity officials. Up to this<br />\ntime, facts had been lacking, though<br />\nthe American college fraternity as<br />\nan institution is older than the republic.<br />\n<br />\nISIDORE DuGAN.<br />\n<br />\nBOOK BY DR. RICHARDSON<br />\nPUBLISHED HERE<br />\nThe \"Constitutional Doctrines of<br />\nJustice Oliver Wendell Holmes,\"<br />\nby Dr. Dorsey Richardson, has recently been published by the Johns<br />\nHopkins Press. It is the latest addition to the Johns Hopkins University Studies in Historical and<br />\nPolitical Science.<br />\n<br />\nThe report is based on the reports<br />\nof 51 fraternities with a membership of 398,000 and an average<br />\nfounding date of 1877. As there<br />\nare only 54 well-established fraternities, and 70 in all with a total<br />\nmembership of 470,000, it was considered safe to predicate an appraisal of fraternity aims and ideals<br />\nupon the replies received.<br />\n<br />\nThe life of the great jurist ;‘,<br />\ntold by Dr. Richardson in the<br />\nPreface. Then follows the Introduction, wherein the broad principles of .law and equity, that Justice<br />\nHolmes followed, are presented.<br />\nThese are that \"private law is the<br />\nchangeable living body of rules<br />\nwhich must be kept fresh and vigorous . . . while Constitutional law<br />\nshould be ascertained with accuracy,<br />\nand protected by the courts against<br />\narguments which would destroy it.\"<br />\n<br />\n\"The fraternity ideal has come<br />\ninto its own. In principle and intention the part it plays in university education is vital and probably<br />\nirreplaceable. The task of keeping<br />\npractice up to the high plane of<br />\nprecept challenges the best effort<br />\nnot only of fraternity men, but of<br />\nall who wish to conserve and improve the good things that are incident to public education.\"<br />\n<br />\nThe following chapters deal with<br />\nthe opinions that Holmes has rendered on the Constitution, State's<br />\nRights, Trusts, and all the important questions that have come before<br />\nthe Supreme Court since his appointment in 1902. The numerous<br />\nexplanatoryi, notes by the author<br />\nare a great aid to understanding<br />\nthe weighty decisions of Justice<br />\nHolmes.<br />\n<br />\nReplies from 51 Fraternities<br />\n<br />\nWe Solicit Your Patronage<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\n<br />\nBOULEVARD OPTICAL CO.<br />\nOPTOMETRISTS<br />\n<br />\nOPTICIANS<br />\n<br />\n3209 Greenmount Avenue<br />\nHomewood 6717<br />\n<br />\nBaltimore<br />\n-.\"'\" • 1,<br />\n<br />\nI<br />\nA<br />\nP:12 Z<br />\n,<br />\n\".1<br />\n7i41<br />\nr-'‘&ZI.t73:1<br />\n;<br />\n-4'<br />\n<br />\n4\"<br />\n<br />\nAY.<br />\n<br />\n\"..ctr<br />\n§<br />\n..<br />\n4i<br />\n;<br />\n.. ,3<br />\n„<br />\nCr;g4tta<br />\n\"<br />\nZ<br />\n-7<br />\n4-<br />\n<br />\nf.d<br />\n.<br />\nt.4Sr2<br />\n\",M11,<br />\n<br />\nDo College<br />\nStudents Read<br />\nAdvertisements?<br />\nIfyou do, surely you<br />\nwill read this one<br />\n<br />\nEly<br />\n)61,11<br />\n<br />\nOne fine day,a Sophomore from a leading University came to see us, suggesting that we advertise in<br />\n<br />\ntheir undergraduate paper, and best of all convinced<br />\nus, and this is how he did it:<br />\nFirst—He believed in Life Insurance because his<br />\nuncle (a good business man) had advised him to<br />\nbuy some.<br />\nSecond—His Father died in the prime of life and<br />\ngood health and left almost no insurance, when<br />\nhe could have carried $50,000.<br />\nThird—He also knew that he could buy Insurance<br />\nNOW at half the annual cost his uncle and<br />\nFather had paid for theirs.<br />\n<br />\n(ti<br />\nktAl<br />\n<br />\nAll this convinced him that even though a student,<br />\nhe should take out as much Life Insurance as his<br />\nallowance would permit.<br />\n<br />\nVO'<br />\n<br />\nEvery college student looks forward to a career,<br />\nwhich will make possible the fulfillment of the most<br />\ncherished desires — surely Insurance is a necessary<br />\npart of this program.<br />\nInsure, in part at least the value of your educated<br />\nself, NOW, making up your mind to increase it as<br />\nbusiness or professional success follows.<br />\nThe John Hancock Mutual Life Insurance Company issues all forms of Life Insurance, endowments<br />\nfor home and estate protection, mortgage replacement, education of children, bequest or income for<br />\nold age;also annuities and permanent disability. The<br />\nJohn Hancock is particularly interested in insuring<br />\ncollege men and women and obtaining college graduates for the personnel of the field staff.<br />\n<br />\nWhat About You?<br />\n<br />\nrAA<br />\n<br />\nri<br />\ntf<br />\n:<br />\n041<br />\nt1<br />\n4<br />\n<br />\nCYA<br />\nkti)<br />\n<br />\nLi<br />\nref,3<br />\n<br />\npkb<br />\nifft4<br />\nr<br />\no:<br />\n3<br />\n4<br />\n<br />\n:(0.1<br />\nrif-V<br />\net<br />\n,eavi ?<br />\ni)<br />\n4<br />\n<br />\nFY4,<br />\n<br />\nkfai<br />\n<br />\nfkti<br />\nkl<br />\nrfi i<br />\n<br />\no<br />\n<br />\nIfyou have read this advertisement,<br />\nyou will aid your undergraduate<br />\npaper by communicating with the<br />\n<br />\nrf<br />\n*9111<br />\n<br />\n,t)/4<br />\n1(ty<br />\n441A<br />\n<br />\nok4<br />\n<br />\nklA<br />\nrit)<br />\n<br />\nraffA L<br />\n<br />\nr/f--0<br />\n<br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br />\n<br />\nOA<br />\n<br />\niv*AA\\<br />\n9<br />\n<br />\n197 Clarendon Street, Boston, Massachusetts<br />\nOver Sixty Years in Business. Now Insuring Over Two Billion Dollars<br />\nin Policies on 3,500,000 Lives<br />\n<br />\n.FY4<br />\nkto<br />\n<br />\n0o4<br />\n.c41<br />\n:41<br />\n<br />\nBaltimore's Best Store<br />\nHOCHSCHILD,KOHN &CO.<br />\nHoward and Lexington<br />\n<br />\nSENIORS<br />\nJUNIORS<br />\nSOPHOMORES<br />\nFRESHMEN<br />\nSHERWOOD BROTHERS, INC.<br />\n<br />\nSt. Regis<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n<br />\nOpen All Hours<br />\n<br />\nNear Your Campus<br />\n•<br />\n<br />\nXIXICIR123=ligtg=1=1141:gliMglat2INIXIXIXIEDI<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 9, 1924<br />\n<br />\nErnest G. Leimbach<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br />\n<br />\nUPTOWN<br />\nQUALTIES<br />\n<br />\nDOWNTOWN<br />\nPRICES<br />\n<br />\nOPEN EVENINGS<br />\n<br />\nWANTED!<br />\nAgents to take orders for<br />\na line of high class, made<br />\nto measure shirts—here's<br />\na chance for you to make<br />\nreal money during spare<br />\ntime.<br />\nWrite to<br />\nDUN-GRAM TEXTILES, Inc.<br />\n171 Madison Avenue<br />\nNew York City<br />\n<br />\nBLUE-BLACK<br />\n—the kind<br />\nyou will use<br />\nin business<br />\n<br />\nanfork<br />\nOUNTAINYP<br />\nEVE tc,31.1ic!ci<br />\n<br />\nAll Sizes and<br />\nColors<br />\n<br />\n.]<br />\n<br />\nFor Real Fountain Pen<br />\nSatisfaction, Use<br />\n<br />\nORD'S<br />\nFOUNTAIN PEN INK<br />\n\"The Ink that Made the<br />\nFountain Pen Possible\"<br />\n<br />\nTelephone, Madison 4722<br />\n<br />\nTHE J. W. HOWARD CO.<br />\nDRAWING MATERIALS<br />\nSURVEYING INSTRUMENTS<br />\n2422 Madison Avenue<br />\nB altimore, Md.<br />\n<br />\nEngRAUERS<br />\n<br />\nPRMTERS<br />\n<br />\nBIRDERS<br />\n<br />\nHOPKINS MEN BREAK INTO MOVIES, AS<br />\nFILM OF LACROSSE SQUAD IS TAKEN<br />\nNo longer will Hopkins students have . to travel downtown<br />\nto see their favorite screen idol;<br />\nwe have plenty in. our midst. At<br />\nexactly half-past ten Saturday<br />\nmorning twenty-five of our very<br />\nown Valentinos and Ben Turpins<br />\ndashed out on the field in full regalia<br />\nfiled before the recording eye of the \"movie\" camera.<br />\nBut that wasn't all. They \"shot\"<br />\nscenes of centers in action, and<br />\nthe beginning of a scrimmage; individuals catching or passing,<br />\nand a man running with the ball<br />\nwith his opponent in hot pursuit,<br />\nbacking him manfully. Then a<br />\nball was tossed out on the field<br />\nand the entire squad closed in on<br />\nit in 'deadly combat, while the<br />\n<br />\nunemotionally<br />\nman<br />\ncamera<br />\nground out a film of the conflict.<br />\nTo cap the climax, the captain<br />\nwas summoned for a \"close-up\";<br />\nand the famous Turnbull grin was<br />\nrecorded as \"Doug\" stretched his<br />\nhand for a starring contract.<br />\n<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nf<br />\n<br />\n01111MMINIMINIE.<br />\n<br />\nCusiovt Quality.<br />\n14 IsL Charles Street.e<br />\n<br />\nClothes<br />\n<br />\nUnfortunately, the pictures of<br />\nthe scantily clad warriors will DOUG TURNBULL<br />\nnever thrill the hearts of the matRepresentatives<br />\ninee girls, for the film was made<br />\nby Stark and Edwards at the direction of Dr. Edmunds, who<br />\nwishes to use thp film, together<br />\nwith that of the football team,<br />\nwhich was made last Week, in a<br />\nseries of lectures designed to<br />\ngive out-of-town publicity to<br />\nHopkins athletics.<br />\n<br />\nTOM MAGILL,<br />\nManager<br />\n<br />\nHOPKINS R. 0. T. C. UNIT IN- SIGMA UPSILON PREPARES<br />\n,21„,\"<br />\nFOR ANNUAL LANIER<br />\nSPECTED BY MAJOR<br />\n9<br />\n,tOt<br />\nCELEBRATION<br />\nA. C. McBRIDE<br />\n_<br />\n_<br />\nPlans for this yeay's work, with<br />\nThe Johns Hopkins unit of the<br />\nR. 0. T. C. was inspected yester- particular reference to the annual<br />\nday by Major A. C. McBride, offi- Lanier celebration held in Febcer in charge of R. 0. T. C. affairs ruary, were discussed at a meetO you know at what low cost and yet how comfortably you can go abroad next summer on the United<br />\nin the Third Corps Area. After ing of the Sigma Upsilon LitStates Lines? Such famous ships as the Leviathan and<br />\nthe inspection, the first of the year, erary Fraternity last Friday<br />\nGeorge Washington have singularly attractive tourist<br />\nMajor McBride was entertained by night. The meeting followed a<br />\ncabins (formerly third class), set aside exclusively for<br />\ndinner at the Johns Hopkins<br />\nStudent Tourists.<br />\nthe Hopkins Chapter of Scabbard<br />\nStart to make your plans now. Join the thousands of<br />\nClub.<br />\nand Blade at dinner at the Hopkins<br />\nAmerican students and teachers who are going to enjoy<br />\nIt has been the custom of the<br />\na European trip next summer at minimum cost. Passage<br />\nClub.\"<br />\nsociety to celebrate the anniverfares range from $85 to $92.50toEngland ($85 to $102.50<br />\nDuring the day Major McBride sary of Sidney Lanier's birth<br />\nto France) depending on ship selected. This includes<br />\nvisited the various R. 0. T. C. with suitable exercises at an asscrupulously clean and comfortable cabins, a variety of<br />\nfood,courteous service, ample deck space and<br />\nexcellent<br />\nclasses, asked the usual inspection sembly early in February.<br />\nA<br />\nother features to insure a perfectly delightful voyage.<br />\nquestions, and received the usual committee consisting of two unanswers, both correct and hunior- dergraduate and two faculty<br />\nous, from nervous Freshmen and members was appointed to take<br />\nSend the coupon for interesting literature, including<br />\ncharge of this year's celebration.<br />\nSophomores.<br />\na Princeton Professor's account of his actual experiences<br />\non one of these low cost trips last summer. PracMajor McBride expressed satis- Because of the possibility of<br />\ntical itineraries and itemized costs are also included in<br />\nfaction with the progress that the using some new material on the<br />\nthis<br />\n32 page booklet—everything to help you in perfectUnit has made thus far this year, life of the Johns Hopkins poet,<br />\ning your plans. Get all the facts now so that you can<br />\nand assured the officers that Hop- this year's exercises have an<br />\ntalk it over at home during the Christmas vacation.<br />\nkins will take a final inspection in added' interest.<br />\nOther work along- literary lines<br />\nthe spring to .determine whether .the<br />\nUNITED STATES LINES<br />\nNI(•-•YorL City<br />\n45 Broadway<br />\nUniversity will again be placed on was planned and discussed in deStudents' Tours Dept. 863MJ<br />\nthe Distinguished List. Hopkins tail. The fraternity intends to<br />\nPlease send me literature including the booklet\"Low<br />\nCost Trips to Europe.\" If! go date will be about_<br />\nhas been awarded this honor every make Southern literature its speNew York City<br />\n45 Broadway<br />\npersons in my party.<br />\nThere will be<br />\nManaging Operators for<br />\nyear, but one, since the establish- cial interest. Contributions for<br />\nName<br />\nthe next meeting, to be held on<br />\nUNITED STATES<br />\nment of the Unit here.<br />\nAddress<br />\nBOARD<br />\nSHIPPING<br />\nDecember<br />\nFriday,<br />\n18,<br />\nafter<br />\na<br />\ndinMajor Hoisington announced to<br />\nthe officers at the time of the in- ner at the Johns Hopkins Club,<br />\nspection that he considered the were volunteered by several<br />\nushering at the Army-Navy game members.<br />\ncreditable in every way to the Unit.<br />\nHe has received compliments from<br />\nFROSH-SOPH GAME<br />\nvarious city officials on the measContinued from page 1<br />\nures in which it was handled, and<br />\nin spite of some criticism professes Sophomores adjourned to the<br />\nlower field for the annual carhimself to be satisfied.<br />\nnage. The second half was begun<br />\n\\vithout any startling features,<br />\nXfKeorner C-\"avelie and glutaw<br />\nuntil the Frosh, with their backs<br />\nFACULTY NOTES<br />\nto the wall, started their drive for<br />\n-Where Wholesale and Retail Districts Meet\"<br />\nDr. French and Dr. Small Nv ill victory. When this had been acattend a meeting of the Modern complished they were able to<br />\nLanguage Association to be held stave off the desperate 'efforts of<br />\nat New York during the Christ- the Sophomores, and kept the ball<br />\nmas recess.<br />\nsee-sawing- in midfield until the<br />\nfinal whistle. With all its ragORDERS RECEIVED FOR<br />\n* * *<br />\nJ. F. APPLE CO.<br />\ngedness the game had been hard<br />\nDr. 'Edwin Greenla‘v, of the<br />\nMANUFACTURING JEWELERS<br />\nfought and clean throughout.<br />\nUniversity of North Carolina,<br />\nLANCASTER, PA.<br />\nScore and summary:<br />\nwill lecture under the auspices of<br />\nTransfer & Baggage Express<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nthe Tudor-Stuart Club on January Freshmen (7)<br />\nSophomores (16)<br />\nMedals,<br />\nEtc.<br />\nMcElfresh<br />\nL<br />\nE<br />\nGibson<br />\n16 in the C. E. Hall. Dr. GreenBiddison<br />\nL T<br />\nSteinwald<br />\nAUTOMOBILE SERVICE<br />\nlaw is a Spencerian scholar and Piel<br />\nL.G....... Broening Stationery, Invitations, Programmes<br />\nPHONE,<br />\nHOMEWOOD 6886<br />\nPotter<br />\nCarr \"MAKERS OF THE VARSITY SEALS\"<br />\nstudent of the Tudor-Stuart periConey<br />\nR G<br />\nPrimus<br />\nod of literature. A large crowd is Cary . . . . . .R.T......... Stone<br />\nR EBrown<br />\nexpected since the lecture is pub- Nixdorff<br />\nReed<br />\nQ.B...<br />\n. . . Moriza<br />\nlic.<br />\nNicholson<br />\nL H<br />\n. . Pitman<br />\n<br />\nTo Europe in 1925<br />\nD<br />\n<br />\nGet the facts Now<br />\n<br />\nUnited States<br />\nLines<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nPrinters of<br />\n<br />\ncfhe Johns Hopkins<br />\nNE1DS,-LE TTER<br />\nLOM BARD<br />\n<br />\nand<br />\n<br />\nSOUTH<br />\n<br />\nSTREETS<br />\n<br />\nUg_13.10.,<br />\n<br />\nRESULTS OF PSYCHOLOGICAL TESTS ARE READY<br />\nAny freshman who desires to obtain the grade which he received in<br />\npsychological test held at his entrance, may do so by applying at<br />\nRoom 401, Gilman, at the folloyving times: Monday, Wednesday.<br />\nand Thursday from 12 to 1 P. All!:<br />\nand on Tuesday and Friday from<br />\n4 to 5 P. M. Marks may be obtained until the Christmas holidays.<br />\n<br />\nCOGGIN'S<br />\n<br />\nGorrell<br />\nCalibrissi . .<br />\n<br />\nGoing, Going, Gone!<br />\nAn ancient car chugged painfully up to the gate at the races.<br />\nThe gate-keeper demanding the<br />\nusual fee for automobiles, called:<br />\n\"A dollar for the car.\"<br />\nThe owner looked up with a<br />\npathetic smile of relief and said:<br />\n\"Sold.\"—Buffald' Bison.<br />\n<br />\nR H<br />\n.F.B. .<br />\n<br />\nNiner<br />\n. . . McNeal<br />\n<br />\nScore by periods:<br />\nFreshmen<br />\n0 0 0 7-7<br />\nSophomores . .<br />\n.0 4 0 0-6<br />\nTouchdowns<br />\nMcNeal, Calibrissi.<br />\nPoint after touchdown — Calibrissi.<br />\nSubstitutions—Freshmen: Hobbs for<br />\nReed, McNeal for Hobbs. Sophomores:<br />\nCleveland for Moriza, Philips for Primus, Farinholt for Steinwald, Steinwald for Philips, Brian for McNeal.<br />\nReferee—Magill. Umpire — Turnbull.<br />\nHead linesman—Parsons. Time of<br />\nquarters-15 minutes.<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n(Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXIX, No 19<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 9, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\n••••••<br /><br />\nHOPKINS ASSUMES ROLE OF UNCERTAINTY MARKS LULL MORAL MESSAGE BROUGHT<br />\nNATION-WIDE<br />\nPRECEDING OPENING OF<br />\nTO ASSEMBLY BY DR.<br />\nTEACHER<br />\nVAN DEUSEN<br />\nWINTER SPORTS<br />\nJohns Hopkins Alumni Represented in Lacrosse, Track and Rifle Teams Only Speaks in Place of Sherwood Eddy<br />\n19 States on Faculties of LeadAudience Stirred by Appeal for<br />\nAssured Sports in Cold<br />\ning Institutions<br />\nSpiritual Revival<br />\nSeason<br /><br />\nLOWLY FRESHMEN BEAT<br />\nSOPHS IN FOOTBALL AND<br />\nRUSH AT HOMEWOOD FIELD<br /><br />\nRegulations Remain Because of Sophomore's Victory in Baseball;<br />\nTaking the place of Mr. SherJohns Hopkins University takes<br />\nNow that the cheers of football<br />\nFrosh Upset Dope by Winning Game<br />\non the aspect of a national training fandom have resounded through wood Eddy, who was unexpectschool for college professors when the foliage-bereft woods of Home- edly prevented from attending the Superiority in Numbers Gives First Passes Pave Way for Freshman VicYear Men Big Advantage in<br />\ntory. Brown and McNeal Play<br />\nthe number of Hopkins men on the wood for the last time this year, the Assembly last Thursday, Dr. Pitt<br />\nDefending Flag<br />\nBest for Sophs<br />\nfaculties of the leading universi- campus of the Johns Hopkins Uni- Van Deusen addressed the stuStriving to regain their former<br />\nA well drilled Freshman team<br />\nties are considered. The Half- versity is pervaded with a silent and dent body on the importance of prestige over the usually downemerged victorious last Saturday<br />\nCentury Book, a little publication expectant air. •That idle interval in the attitude taken toward the se- trodden Freshmen, the Sophofrom a close but loosely played<br />\nof live statistics gotten out by the collegiate sports which invariably rious problems of the present day. mores battled with a desperate<br />\ncontest with the Sophomores.<br />\nHalf-Century Committee, states that follows the climax of the football Dean Ames presented him and pertinaciousness last Saturday at<br />\nWhen they entered the second<br />\nsaid that, although the unavoid985 Johns Hopkins graduates are season, is not lacking this year in<br />\nHomewood<br />\nin<br />\nthe<br />\nannual<br />\nclass<br />\nhalf<br />\nthey were trailing by a 6-0<br />\nnow on the faculties' of colleges, uncertainty and speculation regard- able absence of Mr. Eddy was ex- rush. As arranged<br />\nby<br />\nthe<br />\nStuscore, and had shown nothing in<br />\ntremely disappointing, he was<br />\ntechnical schools, and universities ing winter sports.<br />\nfortunate in securing the services dent Council the goal was a strip the way of a consistant attack.<br />\nthroughout the United States. Over<br />\nPresent conditions indicate that of the speaker, who is a graduate of canvas tied to a greased pole, About the middle of me third<br />\n350 men are with 24 of the forethe only sports which are certain to of Princeton and of the Union and surrounded by a band of quarter they launched a series of<br />\nmost educational centres of the<br />\nTheological<br />\nSeminary,<br />\nNew sturdy Freshmen outnumbering<br />\nbe active this winter are lacrosse,<br />\nperfectly-executed forward passes<br />\ncountry.<br />\nYork.<br />\ntheir seniors three to one.<br />\n17 Hopkins Teachers at Maryland track, and rifle. As has been the<br />\nwith Reed on the receiving end,<br />\nContrasts Powers of Imagination<br />\nOdds Against Sophomores<br />\nPrinceton's faculty contains 23 case in previous years, there will be<br />\nwhich<br />\nbrought them, by the last<br />\nIf the address were put in writFacing such odds, however,<br />\nHopkins graduates, Yale has 22, no abatement in the lacrosse prac- ing, an<br />\nillustrative title would be was a mere trifle to the Sopho- period, to the opponents' two-yard<br />\nColumbia 21, and Harvard, Stan- tice which will continue to be held \"On Our<br />\nBlindness\". With free- mores. With the sound of Ref- line. Here the Soph defense<br />\nford, Minnesota, and Wisconsin 20<br />\nly<br />\nflowing<br />\nFriphrases and a certain eree Tom Magill's whistle, they tightened and held for two downs,<br />\nand<br />\nWednesdays,<br />\nTuesdays,<br />\non<br />\neach.<br />\ngracefulness<br />\nof expression,. Dr. set about \"getting that flag\" with but on the third attempt Calidays. The Black and Blue squad<br />\nThe great surprise is the fact that<br />\nwill be augmented by the men re- Van Deusen warned against shut- a will. One after another would brissi carried the ball<br />\nover. •With<br />\nHopkins has bestowed 17 of her<br />\nleased from football. Lacrosse, ting our eyes to the meanings of work his way through the seeth- the excitement of both<br />\nrooting<br />\nsons on her greatest rival—the Uniwhen it comes to weathering the facts about us; to the spiritual ing mob milling about the pole sections at a fever heat, he<br />\nsettled<br />\nversity of Maryland.<br />\nelements, has proved itself the stur- meaning of life; and, most vital of until he actually had started to the outcome of the game by dropThere are 10 or more Johns Hopdiest of sports.<br />\nall, to the destiny of our own lives. ascend it, only to have his shirt kicking for the extra point.<br />\nkins alumni on the teaching staffs<br />\nThe speaker dwelt particularly on or sweater ripped off by clutching<br />\nIndoor Track Started<br />\nof the most important colleges of<br />\nSophs Get Touchdown<br />\nimportance of a person's point hands. When at last his strength<br />\nthe<br />\n19 different states. From Texas This 'week indoor track practice<br />\nIn the first half the Sophoin the South to Minnesota in the is being held at the Fifth Regiment of view. For instance, two peo- forced him to release his grasp, he mores held the edge. Although<br />\nple look at the same beautiful ob- went hurtling through the air to<br />\n.North, from California in the West Armory, which building has served<br />\nland ignominiously at the outside their attack lacked punch, and<br />\nto a solid band of the Eastern this purpose for a number of years. ject. One is stirred deeply; the<br />\nthey were guilty of frequent fumother remains unmoved. The dif- rim of hostilities. Only once durStates the U. S. A. is being edu- Robert Heyn, captain of the track<br />\nbles, McNeal constantly gained<br />\nference lies \"not in the seeing ca- ing the two halves did a Sophocated in a large measure by Johns team, is busy preparing his teamground<br />\nin exchanges of punts, and<br />\nmates for the coming tests. The pacity of the two people, but in more get his head and shoulders managed to keep the ball for<br />\nHopkins.<br />\nthe<br />\nthe power of their imaginations.\" above the crowd. He, too, soon<br />\nThe figures of the Handbook, rifle team is entering into one of the<br />\nmost<br />\npart<br />\nin<br />\nFreshman<br />\nterritory.<br />\nsuffered the same fate as his combased on 5.000 living alumni, are most active seasons in its history. Cites Eddy's Fear of Class Strife<br />\nThe Sophomores' touchdown<br />\nRumors and counter-rumors are<br />\nDr. Van Deusen seemed con- panions.<br />\nas follows:<br />\ncome in the second period. With<br />\nSome Sophs Forcibly Ejected<br />\nswimming<br />\ncirculating<br />\nthe<br />\nvinced<br />\nabout<br />\nlive<br />\nin<br />\none<br />\nwe<br />\nof<br />\nthe<br />\nthat<br />\nthe<br />\nball on the Frosh 30-yard line,<br />\nPrinceton<br />\n23<br />\nteam. According to Norman Chase great crisis periods of the world. Several Freshmen took partic- Brown, whose defensive work was<br />\nYale<br />\n22<br />\n21<br />\nColumbia<br />\nKeyes, Graduate Manager of Ath- He quotes Mr. Eddy: \"My most ular glee in trailing those second one of the features throughout<br />\n20<br />\nHarvard<br />\nletics, no success has been met in outstanding impression of the year men that had enforced reg- the entire game, broke through,<br />\n20<br />\nStanford<br />\nMinnesota<br />\n20<br />\nthe search for an available swim- world today is a sense of the wide ulations more than the others. and for the second time in the<br />\nWisconsin<br />\n20<br />\n_<br />\nming pool. For this reason, he in- spread misunderstanding, strife, Time and again three or four of afternoon, blocked a punt which<br />\nCalifornia<br />\n18<br />\nMaryland<br />\n17<br />\ntimates, the 1925 swimming team and industrial unrest.\" \"This the Freshies would dump one of Gibson recovered. With a score<br />\nCornell<br />\n15<br />\nis an uncertainty. Campus opinion, condition,\" the speaker went on, these Sophs in the mud and in their grasp, the Sophs fumIllinois<br />\n15<br />\nChicago<br />\n14<br />\nhowever, expresses little fear of \"is the result of a fearful race be- scamper back to the onslaught. bled on the first play and lost the<br />\nPennsylvania<br />\n14<br />\ntween two great forces; the grad- As soon as the Sophomore re- ball. The Freshmen, however,<br />\nthe<br />\nloss of this important sport.<br />\nVirginia<br />\n14<br />\nEmory<br />\n13<br />\nual uprising of discontent among (rained his breath he would run were unable to gain, and when<br />\nRumors Unfounded<br />\nOhio State<br />\n12<br />\nunderprivileged and leap over the heads of the they again attempted to punt,<br />\nThere will be no basketball, soc- the so-called<br />\nNorth Carolina<br />\n11<br />\nRochester<br />\n11<br />\ncer, or golf 'teams at Johns Hop- classes and the slow concession of others in an erideavor to reach Brown raced in for his third<br />\nWashington Univ., St. Louis 11<br />\nblocked kick, putting the ball in<br />\nkins this year. Rumors of the re- opportunity. of the higher orders the much-desired pole.<br />\n11<br />\nWestern Reserve<br />\nEach half of the melee was like the possession of his own team.<br />\nNaval Academy<br />\nYou men will no<br />\n10<br />\nvival of the former sport and of of society.<br />\nTexas<br />\n10<br />\nthe initiation of the others are un- doubt live to see the outcome of the other with the exception of With about five yards to go, McTulane<br />\n10<br />\nchange in spirit. The first Neal, on two plays through cenVanderbilt<br />\n10<br />\nfounded, according to Graduate this race. If the reconstruction the<br />\nsaw the Sophomores at the ter, took the ball over. His drophalf<br />\nManager Keyes, who was not pre- of the industrial order can keep<br />\nTotal<br />\n362<br />\nheight<br />\nof their glory. They were kick failed, but at that stage<br />\nIn other institutions<br />\n623<br />\nof<br />\npared to release definite informa- pace with the growing dissatisleading<br />\nthe Freshies 6 to 0 in the the game it did not seem imporof<br />\nthe<br />\nfaction<br />\nlower<br />\nclasses,<br />\nthe<br />\ntion concerning the \"certain\" sports.<br />\nGRAND TOTAL<br />\n985<br />\nresult will be peace and prosper- game and were planning to lose tant, since the Sophomores<br />\nity. If the race is lost—who no time in gaining the flag. All seemed to have the better team.<br />\nSERVICE<br />\nSEEN<br />\nYEARS<br />\nTWENTY-EIGHT<br />\nknows? The breakdown or the their schemes Went amiss, how-. Neither side threatened from the<br />\nBY NIGHT WATCHMAN OF UNIVERSITY progress of civilization is the is- ever, and after the game at the time play was resumed until the<br />\nstart of the second half of the second half.<br />\nsue.\"<br />\nJames J. McCall, veteran night said, \"I work twelve hours a day.<br />\nrush it was the Freshmen who<br />\nSpiritual Revival to the Rescue<br />\nAlthough the crowd and the<br />\nwatchman of the University, who is In the Old days at McCoy Hall I \"As I. see the situation,\" the were bubbling over with configame itself may have lacked some<br />\ndelighted with a change in working had long hours, from 7 to 7, but speaker continued,\"a spiritual re- dence, while the Sophs presented of the<br />\ncolor of the Varsity games,<br />\nhours made nine years ago, walks now, for the last nine years, I only vival is the only power that can woeful faces.<br />\nthe officials didn't. Not in regard<br />\ndailY, rain or shine, from his home work from 6 to 6.\"<br />\nsave civilization. In any age,<br />\nFreshmen Want to Keep Flag<br />\nto their work, which was excelat 4907 Crawson Avenue, in the viEach evening, near the hour of there is the eternal struggle beWhen, at last, the final whistle lent, hut to their costumes, which<br />\ncinity of Harford Road, to Home- six, the white-haired old gentleman tween right and wrong, with 'truth blew, a Freshman shinneyed up may have been excellent, but<br />\nW.00d.<br />\nmay be seen trudging toward GilContinued on page 2, col. 4.<br />\nthe pole and retrieved the flag; were also original. Magill was<br />\nTwenty-eight years ago McCall, man Hall. In the first glow of<br />\nbut as he alighted he was pounced within time limits of convention,<br />\nMade physically unfit by the busi- dawn, or if there is no sunrise,<br />\nby several Sophs and another but it has never been the custom<br />\non<br />\nNOTICE<br />\nness of<br />\nhouse painting, entered the through a mist of rain or a veil of<br />\nbattle<br />\nwas in the making. Magill at Homewood for an umpire to<br />\nThe Johns Hopkins Musical<br />\nClubs will give a concert for the<br />\neinPloy of Johns Hopkins Univer- snow one may see him retracing his<br />\nthen saved the day by taking the appear in a lacrosse hat, or a head<br />\nbenefit of the Bryn Mawr<br />\nsity. His recollections of McCoy steps, walking less spryly than on<br />\nlinesman to wear a baseball cap<br />\ncloth himself.<br />\nLeague, at the Hotel Belvedere,<br />\n-tsiall and the old Hopkins buildings the preceeding evening, but.if one<br />\non Thursday, December 18, at<br />\nAfter the rush the Sophomores and supplement his linesman's<br />\n8.30 P. M. Dancing until 2 P.<br />\nrecently destroyed by fire, are joy- can get close enough to him, greetdecided upon an unusually stren- stick with a cane.<br />\nM. Tickets may be obtained from<br />\nful ones of restored health.<br />\ning the world with same kindly<br />\nuous \"pep\" week for the Frosh, The period between the halves<br />\nR. C. Tilghman.<br />\nWhen interviewed by the report- twinkle in his eye. When the roads<br />\nto keep them from becoming was marked by the absence of the<br />\nC. M. Ripley, E.E., will lec\"swell-headed\".<br />\nThe Sophomore usual vocal duel of rival rooting<br />\ner, of the NEWS-LETTER for his are covered with snow the old vetture at 4.15 P. M. on Friday, in<br />\n°Pinion of his term in the Univer- eran picks his way through the<br />\nRoom 110, M. E. Building, on<br />\nvictory, over the Freshmen in sections, as both the Freshman<br />\n\"The Romance of the Electric<br />\nsitY employ, McCall was inclined tracks made by early vehicular trafbaseball prevented the removal hordes and the thin red line of<br />\nMotor.\"<br />\nof their regulations.<br />\nt° appear well pleased. \"Well,\" he fic.<br />\nContinued on page 4, col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS- LETTER, DECEMBER 9, 1924<br /><br />\n2<br /><br />\nINTRAMURAL MATCH HELD;<br />\nRIFLE CLUB TO BEGIN<br />\nVernon 4986<br />\nSCHEDULE SOON<br />\nAt the rifle match held last Sat-Say It With Flowers\"<br />\nBARNSTORMERS<br />\nFOUNDED 1897<br />\nurday in the North Loft prizes<br />\nPresent<br />\nwere awarded tl-le three best shots.<br />\n$2.00<br />\nSubscription<br />\n\"THE TRUTH WILL There was a tie for third place bePREVAIL\"<br />\ntween Graf and Armstrong, which<br />\n\"COATS\"<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nnecessitated drawing lots for the<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n\"THE MANEATERS' winner. Fate smiled upon Graf<br />\n1822 N. CHARLES STREET<br />\nas Armstrong drew out the short<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nstick.<br />\nHopkins University.<br />\nA mood is a queer thing; it can<br />\nCollege and Fraternity Stationery<br />\ndictate one's feelings toward his<br />\nThe match was shot from the Banquet and Dance Cards, Invitations<br />\nsurroundings, making things sad kneeling position, and 100 was<br />\nJAS. H. DOWNS<br />\nBusiness communications should be addressed to the BUSINESS MANor<br />\nbright, pleasant or unpleasant. the highest possible score. The<br />\nAGER, JOHNS HbPKINS UNIVERSITY; all articles and other communications<br />\nENGRAVER PRINTER STATIONER<br />\nshould be sent to the MANAGING EDITOR.<br />\nSaturday night at the Barnstormresults were as follows:<br />\n229 N. CHARLES ST.<br />\ners' try-outs everything was<br />\nFirst place—T. H. T. Brady, 89.<br />\ndownright pleasant. We sat with<br />\nHomewood 0100<br />\nTelephone<br />\nfeet on chairs, smoking cigarettes<br />\nSecond place—L. M. Rawlings,<br />\n(bummed from the President of 88<br />\nthe Club) and made ourselves<br />\nThird piace—W. Graf and J. G.<br />\nBusiness Manager<br />\nEditor-in-Chief<br />\ncomfortable. And so we viewed<br />\nArmstrong,<br />\nR. CARMICHAEL TILGHMAN, '25<br />\n83.<br />\nPHILIP W. HOWARD, '25<br />\nthe one-act plays in a more or<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nSMITH &amp; CO.<br />\nFlorists<br /><br />\nManaging Editor<br />\nALGER HISS, '26<br /><br />\nless rosy light.<br />\nThe Rifle Club is working hard<br />\n\"The Truth Will Prevail\" is a in preparation for its first interAssistant Managing Editor<br />\nclever little skit by Mr. G. Pon- collegiate match, with the UniverERNEST A. STRATHMAN, '26<br />\nder, of Playshop fame. It was sity of Chicago, to be held this<br />\nAssociate Editors<br />\n(lone<br />\nrather well by the Fresh- week. Fines for the use of proCirculation Manager<br />\nBENJAMIN T. ROME, '25<br />\nman<br />\nactors,<br />\nand on the whole pre- fanity and -trial matches are bringARTHUR L. NELSON, '26<br />\nOTHO J. KELLER, III, '26<br />\nHENRY R. TURNBULL, '26<br />\nsented fair entertainment. \"Bill\" ing about strict observance of regA. RISLEY ENSOR, '26<br />\nRodgers was a decent enough ulations and a high grade of acJunior Editors<br />\nAssistant Business Managers<br />\nwoman; the rest were so-so, the curacy in practice shooting.<br />\nEDWARD 0. MICHEI„ '26<br />\nWatch him at the \"Prom.\" He's<br />\nKIDD,<br />\n'26<br />\nJACKSON<br />\nJ.<br />\nplaylet<br />\nwas good enough to carry<br />\nJAMES YOUNG, '25<br />\nthere with perfect ballroom conThe match team will consist of<br />\nJ. HENRY JARRETT, '27<br />\nT. STRAN SUMMERS, '25<br />\ndition from soles of his patent<br />\nthe characters, as acted, along.<br />\nfifteen men. Four positions will<br />\nCHARLES F. REESE, '27<br />\npumps to top of his glossy dome.<br />\nHEYWARD E. BOYCE, JR., '27<br />\nW. BARNES HALL, '27<br />\n\"Coats,\" an effort by Lady be used: prone, sitting, standing,<br />\nHe's just as neat after the twentieth<br />\nSAUF.RWEIN, '26<br />\nROBERT<br />\nP.<br />\nWILLIAM E. THOMSEN, JR., '26<br />\ndance as during the first fox trot. There's<br />\nGregory, who must have been ill and kneeling. The final score will<br />\nARTHUR SWANSON, '27<br />\nRICHARD R. GRIFFITH, '28<br />\nno secret about his method. \"Vaseline\"<br />\nHair Tonic goes to his head regularly.<br />\nROBERT S. JACOBS, '25<br />\nRALPH KIRKLEY, '28<br />\nwith the bubonic plague when she be the totals of the ten highest<br />\nIt makes his hair silky and manageable<br />\nwrote it, was next. This sketch scores on each team.<br />\nand prevents dandruff. At all drug stores<br />\nand student barber shops.<br />\nwould give me a fine chance to<br />\nEvery\"Vaseline\"Product is recomA<br />\nprize<br />\nmatch has been schedmended everywhere because of its<br />\nMember Southern Intercollegiate Newspaper Association<br />\nWaX sarcastic, to make plenty oi<br />\nabsolute Purity and effectiveness.<br />\nmean cracks about the play and uled for December 23, which will<br />\nthe cast, but I'm too hellish lazy. be the final meeting of the team<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nThe play was too much for the before Christmas. It has been<br />\nREG.U.S. PAT.OPP.<br />\nactors' powers; a dialogue is a agreed •that the eight men who<br />\ntroublesome thing to put across. make the lowest score will give a<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 9, 1924<br />\nFurthermore, while I am not an theatre party t6 the seven highest<br />\nFor the Health and<br />\nAppearance of the Hair<br />\nscorers.<br />\nexponent of realism, I think it's<br />\nChesebrough Mfg. Co.,(Cons'd)<br />\nstretching things a bit too far<br />\nState Street<br />\nNew York<br />\nTo bring about a stricter ob—<br />\nwhen a gentleman of Hebrew deservance of the minor rules of the<br />\nscent is cast as an Irishman. He<br />\nrange a fine of five cents a word<br />\nA WISE RULING<br />\nis temperamentally unfit for the<br />\nhas been placed upon profanity.<br />\nThe action of the Student Council in adopting a fixed policy on Part.<br />\nThe box, which is steadily increasthe question of proxies is certainly wise and warranted. At the last<br />\nThe final play was the best.<br />\ning in weight, will be emptied into<br />\nStudent Council meeting a ruling was passed which prohibits the use \"Maneaters\" was written, accordthe pocket of the winner of the<br />\nof proxies in all elections. However, the new ruling provides that ing to President Hiss, by \"God<br />\nPrize Match.<br />\nin the event it is necessary for a student to be absent from an .elec- knows who.\" Gordon Stick, who<br />\nghe &amp;west selling augat<br />\npencilin the world<br />\ntion, he is permitted to cast his vote, provided he presents a proper directed the play, deserves credit<br />\nPOR thestudentor prof.,the<br />\nexcuse, prior to the election, to a member of the Student Council and for an imaginative piece of work.<br />\nsuperb VENUS out-rivals<br />\nDR. VAN DEUSEN MAKES<br />\nall for perfect pencil work.<br />\nvotes the ballot in the presence of the Student Council member. Oscar Giese gets honorable menADDRESS<br />\n17 black degrees-3 copying.<br />\nThe Student Council will count only those proxies that are handled tion for really good acting, as<br />\nContinued from page 1<br />\nAmerican Lead<br />\nby its members previous to the election.<br />\ndoes Jerome Shapiro. This was a forever on the scaffold' and<br />\nPencil Co.<br />\n220 Fifth Ave.<br />\nwell worthwhile effort.<br />\nNew York<br />\n'wrong forever on the throne.' The<br />\nIt is obvious that in the future the power of campus political<br />\nThe<br />\nBarnstormers<br />\nare<br />\ndoing<br />\npresence<br />\nof<br />\nthis<br />\nstruggle<br />\nis<br />\nexconspiracies will be lessened. At the same time, under the provisions of the new ruling, a student having conflicting engagements is good work; may the Lord pre- emplified in the slums of a great<br />\nWrite for<br />\nallowed to vote. The News-Letter, voicing the general campus vent them from becoming too city, in history, in your own life.<br />\nbooklet on<br />\nVENUS Pencils and<br />\nopinion, feels that by the passage of this ruling on proxies a great serious. In spite of the lack of What are you going to do about<br />\nVENUS EVERPOINTED<br />\nMechanical Pencils<br />\nwomen, there was one in the cast, it?\"<br />\nstep toward \"clearing up\" campus elections has been made.<br />\nthe \"Maneaters\" almost came up<br />\nBefore concluding his talk, Dr.<br />\nto the standard of the rival \"PlayVan<br />\nDeusen laid special stress on<br />\nshop\" production of the same<br />\nvalue<br />\nthe<br />\nof a Christian interprepiece last spring.<br />\nTHE INFORMALS<br />\ntation of life. \"Can you not feel<br />\nFinally, President Hiss anthe presence of a Divine Power?\"<br />\nThe change in the system of work and study from \"prep\" nounced that no<br />\nhigh standard of<br />\nhe asked. \"Go outdoors on a<br />\nschool to college is very marked. Several weeks for adjustment to production was being<br />\nattempted,<br />\n,the new methods in the institution of higher learning are necessary no scenic or lighting effects were clear night; stretch your imagi'be mama,nation. Do you feel no meaning<br />\nfor the first year men. Whether or not the freshmen are \"learning the result of<br />\nspecial effort. After<br />\ndandivpmayConsider the<br />\nthe ropes\" and the upperclassmen are applying their acquired knowl- looking at scenery, costumes and in the universe?<br />\n17 leads—all dealers<br />\nsmallest wild-flower of the field.<br />\nedge is determined 1.3y giving inf6rma1 grades.<br />\nlighting, we believe the gentleDo you place no significance in<br />\nAn informal mark is not in every case an indication of failure. man spoke true in every particits beauty? God reveals himself,<br />\nIt is more of a warning. That the early months of the college year ular. They were terrible.<br />\nif you want to see him. What<br />\nH. R. O.<br />\nare filled with activity—football, fraternity rushing and so on, is<br />\nare ybu going to do with your<br />\nDamon—<br />\ntrue. But that's all over now. With these distractions behind us<br />\n\"What was the name of that pencil<br />\nlife?<br />\nWhere<br />\nwill<br />\nyour<br />\nsocial<br />\ninProfessor Williams was recomwe can perhaps settle down to less interrupted study. There is still<br />\nmending this morning?\"<br />\nterests<br />\nlie?<br />\nWill<br />\nyour<br />\nvocation<br />\nHave You Ever Tried It?<br />\na month and a half before the midyear examinations.<br />\nPythias—<br />\nbe a career of service? In the<br />\n\"Eldorado—my boy, Eldorado!<br />\nYou see a pretty girl walking<br />\nJust think of a fabled land of<br />\nFreshmen especially should take warning. Theirs is the largest<br />\nwords of Carlyle, 'Wilt thou be a<br />\nease and happiness—where no one<br />\ndown the street. She is singular,<br />\nflunks—where pencils are the magic<br />\nclass in the University and will be extensively weeded out. If we<br />\ncoward, or wilt thou be a hero?'<br />\nsticks of achievement. Then you<br />\nyou nominative. You walk across<br />\ncan never forget it.\"<br />\nare permitted to make use of a trite expression, we simply say, \"A<br />\nWhat we want today is men of<br />\nto<br />\nher,<br />\nyou<br />\nchange<br />\nto<br />\nplural,<br />\nthen<br />\nwise<br />\nis<br />\nthe<br />\nsufficient.\"<br />\nword to<br />\nmoral and spiritual vision.\"<br />\nit becomes dative. You walk<br />\nhome with her. Her mother beAt the conclusion of the ad- SHIRTS<br />\nNECKWEAR<br />\ncomes accusative and you become dress it was announced that tickThe News-Letter regrets to announce the resignation of C. Donald Geiske,<br />\nimperative. You kiss her and she et booklet returns must be made<br />\n25, from the position of Assistant Business Manager.<br />\nbecomes masculine. .Things are to the June Week Committee by<br />\nThe News-Letter is pleased to announce the election of Henry R. Turn- tense,<br />\n421 N. HOWARD ST.<br />\nher father becomes pres- Wednesday, December<br />\n10th.<br />\nbull, '26, and A. Risley Ensor, '26, to the position of Associate Editor; of Richent, and you become a past prin- There was no yell practice. No<br />\nard R. Griffith, '28, and Ralph Kirkley, '28, to the position of Junior Editor;<br />\nHOSIERY<br />\nGLOVES<br />\nciple.—Obelisk.<br />\npandemonium.<br />\nand of Robert S. Jacobs, '25, to the position of Assistant Business Manager.<br /><br />\nar<br />\nat<br />\nft<br /><br />\n111<br /><br />\ntli<br /><br />\ntC<br /><br />\nit<br /><br />\nii<br /><br />\nit<br />\nii<br /><br />\n31<br /><br />\nti<br />\nf;<br /><br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br /><br />\nThe winnint!<br /><br />\nstrideu<br /><br />\naseline<br /><br />\nHAIR TONIC<br /><br />\nENUS<br />\nPENCILS<br /><br />\nLeFranc &amp; Ault<br /><br />\n1<br /><br />\nms<br /><br />\nER<br /><br />\n'THE JOHNS HOPKINS NEWS LETTER, DECEMBER 9. 1924<br /><br />\nREVERIES<br />\nBY OLD ALUMNUS<br /><br />\nNow that the normally unbalanced undergraduate mind has<br />\nabout turned away from the 1924<br />\nfootball season, perhaps Old Alumnus can make a suggestion for 1925.<br />\nNone of the old-timers I've seen<br />\nthis year registered enthusiasm<br />\nover the '24 schedule, but I tried<br />\nto placate 'em by explaining that<br />\nit was only to serve as a training<br />\nfor next year.<br /><br />\n1COMMITTEE REPORTS<br />\nFRATERNITIES AT<br />\nCONFERENCE<br /><br />\nON<br /><br />\nOne Year's Research Represented in<br />\nWork of Committee Appointed by<br />\nInterfraternity Conference<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br /><br />\nAims and ideals of modern fraternities were thorotigmly discussed in the report issued at the<br />\nInterfraternity Conference. The interest.<br />\nconference, at which Bayard P.<br />\nFonda represented Johns Hop- The Editor of the NEWS-LETTER.<br />\nkins, had appointed a committee Dear Sir:<br />\nthe previous year for this work,<br />\nWhy do you allow such ignorant<br />\nand the finished report of this<br />\nmorons as \"1-1: R. T.\" to criticise<br />\ncommittee was given to the conthe<br />\nwork of such eminent organizaThe moleskin artists who share ference.<br />\ntion as the \"Homewood Playshop\"?<br />\nmy reveries are almost unanimous<br />\nAs a result of an extensive can- His so-called review; in your last<br />\nin calling for Virginia and Swarthvass of all American Greek-letter issue was an example of college<br />\n'fore on the next schedule, and obfraternities the report announces, in journalism, rather of its decay.<br />\nject vociferously to playing more<br />\nsummary, that these are the fraterthan two state team. The bill of<br />\nThe acting was fine, in many cases<br />\nnity aims and ideals: recognition of<br />\nrivaling professional work, and the<br />\nfare representing the consensus of<br />\nand a proper respect for the Diety,<br />\nplay itself was great. Both of these<br />\nopinion, one they swear will promoral living, discouragement of<br />\nthings were disparaged by H: R.<br />\nduce many nip-and-tuck battles. and<br />\ngambling, discouragement of the<br />\nT. I do not see how the consumWill prove revenue-producers, foluse of liquor, a premium upon<br />\nate ass could miss these things, no<br />\nlows:<br />\nfriendship, emphasis upon the virmatter what microscopic defects<br />\n'William and Mary or Mt. St. M. tues of honesty and integrity, enhe could find elsewhere. In these<br />\nWashington and Lee or V. M. I. couragement of the practice of<br />\nmatters I know whereof I speak,<br />\nSwarthmore.<br />\ncharity.<br />\nfor I am<br />\nPittsburgh or Rutgers (away).<br />\nFraternities Help Education<br />\nA MEMBER OF TIIE PLAYSHOP.<br />\nSt. John's.<br />\nUpon their individual members,<br />\nVirginia.<br />\naccording to the report, fraterniMaryland:<br />\nTo the Editor of the NEWSties sincerely and earnestly attempt<br />\nLETTER.<br />\nAll of these are within reason- to play their role as a vital and helpable guarantee distance and none ful part of the machinery of educaDear Sir:<br />\nof the home opponents will be con- tion by encouraging high scholarIn reply to the above letter of the<br />\ncededly stronger than Hopkins next ship, requiring participation in \"Playshop Member,\" let me say<br />\nYear.<br />\ncampus activities and urging col- that it is characteristic in its politelege loyalty.<br />\n'Member Bobby Hoffman '20,<br />\nness and in its cock-sure knowledge<br />\nThe weight of influence of fra- of everything pertaining to the<br />\nwhose talented toe downed Maryland 3-0 in 1915 and helped in ternities in matters pertaining to drama. Last year when the reviews<br />\ncommunity interest the committee<br />\nmany another victory. Bobby is<br />\nof the NEWS-LETTER critic found<br />\nsummarizes as follows: fraternities<br />\n\"dropping them over\" these days are intensely patriotic, promote con- little fault with the Playshop he<br />\nWith an engineering sales company cord among groups of different re- was rated as one of the Homewood<br />\nin Rochester. Wants Princeton back ligious and racial and political back- intelligentsia, now he is an \"ignoron the schedule.<br />\ngrounds, teach the duty and privi- ant moron,\" and a \"consumate ass,\"<br />\nlege _of service to mankind, de- for daring to tell what he thought<br />\nBill Alderson and Milt Egner,<br />\nnounce snobbery and the fetish of<br />\nengineers of '23, who are making social demarcation on the basis of of the production. Hooray for the<br />\nPlayshop, and its ever brilliant acmillions for the General Electric wealth or family, foster to a subtors and actorines.<br />\nCompany in Schenectady, asked to stantial extent participation in soYours truly,<br />\nbe remembered to \"the gang\" and cial service or philanthropic work.<br />\nsaid they wished State all sorts of<br />\nbad luck.<br />\nBut there's not a young 'un of<br />\nthe lot who is with you in spirit<br />\nmore than Charlie Winne '87, M.D.<br />\n01. He and Joe f_.ai,vreti-Ce, M. D.<br />\n16, get together occasionally and<br />\ntell Albany just what old J. H. U.<br />\nreally is. Another Albanyite who<br />\nIs greatly interested in the University is young Huntington Williams,<br />\nM. D. '19, D. P. H.'21, whose father was so prominently connected<br />\nWith the institution. He is doing<br />\nPublic Health work in Albany. Dr.<br />\ntawrence has just given up that<br />\nWork to accept the post of Medical<br />\ntxecutive of the New York State<br />\nMedical Society, a unique position<br />\nIn which he has contact with 10,000 medical men of the State.<br />\nHerb Adams, another A. V.. of<br />\n.97, is a high muck-a-muck with the<br />\nastman Kodak Company in Rochester. Ed. Hoffmeister is a native of the same city and is teaching geology at Rochester UniversltY. Took his A. B. in '20 and his<br />\nPh.D. in '23. The Dean of the institution, by the way, is Dr. Charles<br />\nHoeing, Ph. D. '98.<br />\nWell, I hear the future Hopkinsne yelling so I must close. I be\"eve it was Teddy Morrison who<br />\nsaid, \"I just won't get married till<br />\nI have plenty of money.\"<br /><br />\nThe committee is frank to admit<br />\nthat undoubtedly these aims and<br />\nideals of college fraternities are<br />\nnot always lived up to. The question of the effectiveness of the aims<br />\nand ideals was not gone into, for<br />\nthe committee sought only an authoritative analysis of the fundamentals as announced by responsible fraternity officials. Up to this<br />\ntime, facts had been lacking, though<br />\nthe American college fraternity as<br />\nan institution is older than the republic.<br /><br />\nISIDORE DuGAN.<br /><br />\nBOOK BY DR. RICHARDSON<br />\nPUBLISHED HERE<br />\nThe \"Constitutional Doctrines of<br />\nJustice Oliver Wendell Holmes,\"<br />\nby Dr. Dorsey Richardson, has recently been published by the Johns<br />\nHopkins Press. It is the latest addition to the Johns Hopkins University Studies in Historical and<br />\nPolitical Science.<br /><br />\nThe report is based on the reports<br />\nof 51 fraternities with a membership of 398,000 and an average<br />\nfounding date of 1877. As there<br />\nare only 54 well-established fraternities, and 70 in all with a total<br />\nmembership of 470,000, it was considered safe to predicate an appraisal of fraternity aims and ideals<br />\nupon the replies received.<br /><br />\nThe life of the great jurist ;‘,<br />\ntold by Dr. Richardson in the<br />\nPreface. Then follows the Introduction, wherein the broad principles of .law and equity, that Justice<br />\nHolmes followed, are presented.<br />\nThese are that \"private law is the<br />\nchangeable living body of rules<br />\nwhich must be kept fresh and vigorous . . . while Constitutional law<br />\nshould be ascertained with accuracy,<br />\nand protected by the courts against<br />\narguments which would destroy it.\"<br /><br />\n\"The fraternity ideal has come<br />\ninto its own. In principle and intention the part it plays in university education is vital and probably<br />\nirreplaceable. The task of keeping<br />\npractice up to the high plane of<br />\nprecept challenges the best effort<br />\nnot only of fraternity men, but of<br />\nall who wish to conserve and improve the good things that are incident to public education.\"<br /><br />\nThe following chapters deal with<br />\nthe opinions that Holmes has rendered on the Constitution, State's<br />\nRights, Trusts, and all the important questions that have come before<br />\nthe Supreme Court since his appointment in 1902. The numerous<br />\nexplanatoryi, notes by the author<br />\nare a great aid to understanding<br />\nthe weighty decisions of Justice<br />\nHolmes.<br /><br />\nReplies from 51 Fraternities<br /><br />\nWe Solicit Your Patronage<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br /><br />\nBOULEVARD OPTICAL CO.<br />\nOPTOMETRISTS<br /><br />\nOPTICIANS<br /><br />\n3209 Greenmount Avenue<br />\nHomewood 6717<br /><br />\nBaltimore<br />\n-.\"'\" • 1,<br /><br />\nI<br />\nA<br />\nP:12 Z<br />\n,<br />\n\".1<br />\n7i41<br />\nr-'‘&amp;ZI.t73:1<br />\n;<br />\n-4'<br /><br />\n4\"<br /><br />\nAY.<br /><br />\n\"..ctr<br />\n§<br />\n..<br />\n4i<br />\n;<br />\n.. ,3<br />\n„<br />\nCr;g4tta<br />\n\"<br />\nZ<br />\n-7<br />\n4-<br /><br />\nf.d<br />\n.<br />\nt.4Sr2<br />\n\",M11,<br /><br />\nDo College<br />\nStudents Read<br />\nAdvertisements?<br />\nIfyou do, surely you<br />\nwill read this one<br /><br />\nEly<br />\n)61,11<br /><br />\nOne fine day,a Sophomore from a leading University came to see us, suggesting that we advertise in<br /><br />\ntheir undergraduate paper, and best of all convinced<br />\nus, and this is how he did it:<br />\nFirst—He believed in Life Insurance because his<br />\nuncle (a good business man) had advised him to<br />\nbuy some.<br />\nSecond—His Father died in the prime of life and<br />\ngood health and left almost no insurance, when<br />\nhe could have carried $50,000.<br />\nThird—He also knew that he could buy Insurance<br />\nNOW at half the annual cost his uncle and<br />\nFather had paid for theirs.<br /><br />\n(ti<br />\nktAl<br /><br />\nAll this convinced him that even though a student,<br />\nhe should take out as much Life Insurance as his<br />\nallowance would permit.<br /><br />\nVO'<br /><br />\nEvery college student looks forward to a career,<br />\nwhich will make possible the fulfillment of the most<br />\ncherished desires — surely Insurance is a necessary<br />\npart of this program.<br />\nInsure, in part at least the value of your educated<br />\nself, NOW, making up your mind to increase it as<br />\nbusiness or professional success follows.<br />\nThe John Hancock Mutual Life Insurance Company issues all forms of Life Insurance, endowments<br />\nfor home and estate protection, mortgage replacement, education of children, bequest or income for<br />\nold age;also annuities and permanent disability. The<br />\nJohn Hancock is particularly interested in insuring<br />\ncollege men and women and obtaining college graduates for the personnel of the field staff.<br /><br />\nWhat About You?<br /><br />\nrAA<br /><br />\nri<br />\ntf<br />\n:<br />\n041<br />\nt1<br />\n4<br /><br />\nCYA<br />\nkti)<br /><br />\nLi<br />\nref,3<br /><br />\npkb<br />\nifft4<br />\nr<br />\no:<br />\n3<br />\n4<br /><br />\n:(0.1<br />\nrif-V<br />\net<br />\n,eavi ?<br />\ni)<br />\n4<br /><br />\nFY4,<br /><br />\nkfai<br /><br />\nfkti<br />\nkl<br />\nrfi i<br /><br />\no<br /><br />\nIfyou have read this advertisement,<br />\nyou will aid your undergraduate<br />\npaper by communicating with the<br /><br />\nrf<br />\n*9111<br /><br />\n,t)/4<br />\n1(ty<br />\n441A<br /><br />\nok4<br /><br />\nklA<br />\nrit)<br /><br />\nraffA L<br /><br />\nr/f--0<br /><br />\nLIFE INSURANCE COMPANY<br />\nOF BOSTON. MASSACHUSETTS<br /><br />\nOA<br /><br />\niv*AA\\<br />\n9<br /><br />\n197 Clarendon Street, Boston, Massachusetts<br />\nOver Sixty Years in Business. Now Insuring Over Two Billion Dollars<br />\nin Policies on 3,500,000 Lives<br /><br />\n.FY4<br />\nkto<br /><br />\n0o4<br />\n.c41<br />\n:41<br /><br />\nBaltimore's Best Store<br />\nHOCHSCHILD,KOHN &amp;CO.<br />\nHoward and Lexington<br /><br />\nSENIORS<br />\nJUNIORS<br />\nSOPHOMORES<br />\nFRESHMEN<br />\nSHERWOOD BROTHERS, INC.<br /><br />\nSt. Regis<br />\nRESTAURANT<br />\n1817 N. Charles St.<br /><br />\nOpen All Hours<br /><br />\nNear Your Campus<br />\n•<br /><br />\nXIXICIR123=ligtg=1=1141:gliMglat2INIXIXIXIEDI<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 9, 1924<br /><br />\nErnest G. Leimbach<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br /><br />\nUPTOWN<br />\nQUALTIES<br /><br />\nDOWNTOWN<br />\nPRICES<br /><br />\nOPEN EVENINGS<br /><br />\nWANTED!<br />\nAgents to take orders for<br />\na line of high class, made<br />\nto measure shirts—here's<br />\na chance for you to make<br />\nreal money during spare<br />\ntime.<br />\nWrite to<br />\nDUN-GRAM TEXTILES, Inc.<br />\n171 Madison Avenue<br />\nNew York City<br /><br />\nBLUE-BLACK<br />\n—the kind<br />\nyou will use<br />\nin business<br /><br />\nanfork<br />\nOUNTAINYP<br />\nEVE tc,31.1ic!ci<br /><br />\nAll Sizes and<br />\nColors<br /><br />\n.]<br /><br />\nFor Real Fountain Pen<br />\nSatisfaction, Use<br /><br />\nORD'S<br />\nFOUNTAIN PEN INK<br />\n\"The Ink that Made the<br />\nFountain Pen Possible\"<br /><br />\nTelephone, Madison 4722<br /><br />\nTHE J. W. HOWARD CO.<br />\nDRAWING MATERIALS<br />\nSURVEYING INSTRUMENTS<br />\n2422 Madison Avenue<br />\nB altimore, Md.<br /><br />\nEngRAUERS<br /><br />\nPRMTERS<br /><br />\nBIRDERS<br /><br />\nHOPKINS MEN BREAK INTO MOVIES, AS<br />\nFILM OF LACROSSE SQUAD IS TAKEN<br />\nNo longer will Hopkins students have . to travel downtown<br />\nto see their favorite screen idol;<br />\nwe have plenty in. our midst. At<br />\nexactly half-past ten Saturday<br />\nmorning twenty-five of our very<br />\nown Valentinos and Ben Turpins<br />\ndashed out on the field in full regalia<br />\nfiled before the recording eye of the \"movie\" camera.<br />\nBut that wasn't all. They \"shot\"<br />\nscenes of centers in action, and<br />\nthe beginning of a scrimmage; individuals catching or passing,<br />\nand a man running with the ball<br />\nwith his opponent in hot pursuit,<br />\nbacking him manfully. Then a<br />\nball was tossed out on the field<br />\nand the entire squad closed in on<br />\nit in 'deadly combat, while the<br /><br />\nunemotionally<br />\nman<br />\ncamera<br />\nground out a film of the conflict.<br />\nTo cap the climax, the captain<br />\nwas summoned for a \"close-up\";<br />\nand the famous Turnbull grin was<br />\nrecorded as \"Doug\" stretched his<br />\nhand for a starring contract.<br /><br />\nBRANCH<br />\nAT THE BARN<br /><br />\nf<br /><br />\n01111MMINIMINIE.<br /><br />\nCusiovt Quality.<br />\n14 IsL Charles Street.e<br /><br />\nClothes<br /><br />\nUnfortunately, the pictures of<br />\nthe scantily clad warriors will DOUG TURNBULL<br />\nnever thrill the hearts of the matRepresentatives<br />\ninee girls, for the film was made<br />\nby Stark and Edwards at the direction of Dr. Edmunds, who<br />\nwishes to use thp film, together<br />\nwith that of the football team,<br />\nwhich was made last Week, in a<br />\nseries of lectures designed to<br />\ngive out-of-town publicity to<br />\nHopkins athletics.<br /><br />\nTOM MAGILL,<br />\nManager<br /><br />\nHOPKINS R. 0. T. C. UNIT IN- SIGMA UPSILON PREPARES<br />\n,21„,\"<br />\nFOR ANNUAL LANIER<br />\nSPECTED BY MAJOR<br />\n9<br />\n,tOt<br />\nCELEBRATION<br />\nA. C. McBRIDE<br />\n_<br />\n_<br />\nPlans for this yeay's work, with<br />\nThe Johns Hopkins unit of the<br />\nR. 0. T. C. was inspected yester- particular reference to the annual<br />\nday by Major A. C. McBride, offi- Lanier celebration held in Febcer in charge of R. 0. T. C. affairs ruary, were discussed at a meetO you know at what low cost and yet how comfortably you can go abroad next summer on the United<br />\nin the Third Corps Area. After ing of the Sigma Upsilon LitStates Lines? Such famous ships as the Leviathan and<br />\nthe inspection, the first of the year, erary Fraternity last Friday<br />\nGeorge Washington have singularly attractive tourist<br />\nMajor McBride was entertained by night. The meeting followed a<br />\ncabins (formerly third class), set aside exclusively for<br />\ndinner at the Johns Hopkins<br />\nStudent Tourists.<br />\nthe Hopkins Chapter of Scabbard<br />\nStart to make your plans now. Join the thousands of<br />\nClub.<br />\nand Blade at dinner at the Hopkins<br />\nAmerican students and teachers who are going to enjoy<br />\nIt has been the custom of the<br />\na European trip next summer at minimum cost. Passage<br />\nClub.\"<br />\nsociety to celebrate the anniverfares range from $85 to $92.50toEngland ($85 to $102.50<br />\nDuring the day Major McBride sary of Sidney Lanier's birth<br />\nto France) depending on ship selected. This includes<br />\nvisited the various R. 0. T. C. with suitable exercises at an asscrupulously clean and comfortable cabins, a variety of<br />\nfood,courteous service, ample deck space and<br />\nexcellent<br />\nclasses, asked the usual inspection sembly early in February.<br />\nA<br />\nother features to insure a perfectly delightful voyage.<br />\nquestions, and received the usual committee consisting of two unanswers, both correct and hunior- dergraduate and two faculty<br />\nous, from nervous Freshmen and members was appointed to take<br />\nSend the coupon for interesting literature, including<br />\ncharge of this year's celebration.<br />\nSophomores.<br />\na Princeton Professor's account of his actual experiences<br />\non one of these low cost trips last summer. PracMajor McBride expressed satis- Because of the possibility of<br />\ntical itineraries and itemized costs are also included in<br />\nfaction with the progress that the using some new material on the<br />\nthis<br />\n32 page booklet—everything to help you in perfectUnit has made thus far this year, life of the Johns Hopkins poet,<br />\ning your plans. Get all the facts now so that you can<br />\nand assured the officers that Hop- this year's exercises have an<br />\ntalk it over at home during the Christmas vacation.<br />\nkins will take a final inspection in added' interest.<br />\nOther work along- literary lines<br />\nthe spring to .determine whether .the<br />\nUNITED STATES LINES<br />\nNI(•-•YorL City<br />\n45 Broadway<br />\nUniversity will again be placed on was planned and discussed in deStudents' Tours Dept. 863MJ<br />\nthe Distinguished List. Hopkins tail. The fraternity intends to<br />\nPlease send me literature including the booklet\"Low<br />\nCost Trips to Europe.\" If! go date will be about_<br />\nhas been awarded this honor every make Southern literature its speNew York City<br />\n45 Broadway<br />\npersons in my party.<br />\nThere will be<br />\nManaging Operators for<br />\nyear, but one, since the establish- cial interest. Contributions for<br />\nName<br />\nthe next meeting, to be held on<br />\nUNITED STATES<br />\nment of the Unit here.<br />\nAddress<br />\nBOARD<br />\nSHIPPING<br />\nDecember<br />\nFriday,<br />\n18,<br />\nafter<br />\na<br />\ndinMajor Hoisington announced to<br />\nthe officers at the time of the in- ner at the Johns Hopkins Club,<br />\nspection that he considered the were volunteered by several<br />\nushering at the Army-Navy game members.<br />\ncreditable in every way to the Unit.<br />\nHe has received compliments from<br />\nFROSH-SOPH GAME<br />\nvarious city officials on the measContinued from page 1<br />\nures in which it was handled, and<br />\nin spite of some criticism professes Sophomores adjourned to the<br />\nlower field for the annual carhimself to be satisfied.<br />\nnage. The second half was begun<br />\n\\vithout any startling features,<br />\nXfKeorner C-\"avelie and glutaw<br />\nuntil the Frosh, with their backs<br />\nFACULTY NOTES<br />\nto the wall, started their drive for<br />\n-Where Wholesale and Retail Districts Meet\"<br />\nDr. French and Dr. Small Nv ill victory. When this had been acattend a meeting of the Modern complished they were able to<br />\nLanguage Association to be held stave off the desperate 'efforts of<br />\nat New York during the Christ- the Sophomores, and kept the ball<br />\nmas recess.<br />\nsee-sawing- in midfield until the<br />\nfinal whistle. With all its ragORDERS RECEIVED FOR<br />\n* * *<br />\nJ. F. APPLE CO.<br />\ngedness the game had been hard<br />\nDr. 'Edwin Greenla‘v, of the<br />\nMANUFACTURING JEWELERS<br />\nfought and clean throughout.<br />\nUniversity of North Carolina,<br />\nLANCASTER, PA.<br />\nScore and summary:<br />\nwill lecture under the auspices of<br />\nTransfer &amp; Baggage Express<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nthe Tudor-Stuart Club on January Freshmen (7)<br />\nSophomores (16)<br />\nMedals,<br />\nEtc.<br />\nMcElfresh<br />\nL<br />\nE<br />\nGibson<br />\n16 in the C. E. Hall. Dr. GreenBiddison<br />\nL T<br />\nSteinwald<br />\nAUTOMOBILE SERVICE<br />\nlaw is a Spencerian scholar and Piel<br />\nL.G....... Broening Stationery, Invitations, Programmes<br />\nPHONE,<br />\nHOMEWOOD 6886<br />\nPotter<br />\nCarr \"MAKERS OF THE VARSITY SEALS\"<br />\nstudent of the Tudor-Stuart periConey<br />\nR G<br />\nPrimus<br />\nod of literature. A large crowd is Cary . . . . . .R.T......... Stone<br />\nR EBrown<br />\nexpected since the lecture is pub- Nixdorff<br />\nReed<br />\nQ.B...<br />\n. . . Moriza<br />\nlic.<br />\nNicholson<br />\nL H<br />\n. . Pitman<br /><br />\nTo Europe in 1925<br />\nD<br /><br />\nGet the facts Now<br /><br />\nUnited States<br />\nLines<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nPrinters of<br /><br />\ncfhe Johns Hopkins<br />\nNE1DS,-LE TTER<br />\nLOM BARD<br /><br />\nand<br /><br />\nSOUTH<br /><br />\nSTREETS<br /><br />\nUg_13.10.,<br /><br />\nRESULTS OF PSYCHOLOGICAL TESTS ARE READY<br />\nAny freshman who desires to obtain the grade which he received in<br />\npsychological test held at his entrance, may do so by applying at<br />\nRoom 401, Gilman, at the folloyving times: Monday, Wednesday.<br />\nand Thursday from 12 to 1 P. All!:<br />\nand on Tuesday and Friday from<br />\n4 to 5 P. M. Marks may be obtained until the Christmas holidays.<br /><br />\nCOGGIN'S<br /><br />\nGorrell<br />\nCalibrissi . .<br /><br />\nGoing, Going, Gone!<br />\nAn ancient car chugged painfully up to the gate at the races.<br />\nThe gate-keeper demanding the<br />\nusual fee for automobiles, called:<br />\n\"A dollar for the car.\"<br />\nThe owner looked up with a<br />\npathetic smile of relief and said:<br />\n\"Sold.\"—Buffald' Bison.<br /><br />\nR H<br />\n.F.B. .<br /><br />\nNiner<br />\n. . . McNeal<br /><br />\nScore by periods:<br />\nFreshmen<br />\n0 0 0 7-7<br />\nSophomores . .<br />\n.0 4 0 0-6<br />\nTouchdowns<br />\nMcNeal, Calibrissi.<br />\nPoint after touchdown — Calibrissi.<br />\nSubstitutions—Freshmen: Hobbs for<br />\nReed, McNeal for Hobbs. Sophomores:<br />\nCleveland for Moriza, Philips for Primus, Farinholt for Steinwald, Steinwald for Philips, Brian for McNeal.<br />\nReferee—Magill. Umpire — Turnbull.<br />\nHead linesman—Parsons. Time of<br />\nquarters-15 minutes.<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n(Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />"}], "field_media_file": [{"target_id": 37921, "display": null, "description": null, "target_type": "file", "target_uuid": "5a2a4d93-f26b-4980-8355-7e353863ee56", "url": "http://digital.library.jhu.edu/system/files/2022-03/13149-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13149, "target_type": "node", "target_uuid": "4a7d01a2-9988-46bf-8009-ca8359a6fe7b", "url": "/node/13149"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b10990f5-475e-4bc0-ab63-d67ecab68679"}]}