{"mid": [{"value": 35705}], "uuid": [{"value": "f5a4715c-3aac-4a22-a6b2-871fedd9c75f"}], "vid": [{"value": 35705}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12238-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:43+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "let<br />\n<br />\nMarch ig, 1903<br />\n<br />\nVol. VII, No. II<br />\n<br />\n4 t\"<br />\n<br />\nTHE<br />\n<br />\nNEWS LI:ITER<br />\n°h<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nHopkins UniversitU<br />\n<br />\nBALTIMORE, MARYLAND,<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October<br />\n<br />\nI, 1902.<br />\n<br />\nPresident: Inn ItEmsEN. Dean of the Medical Faculty:<br />\nWILLIAM H. Hewitt!. Dean of the College Faculty:<br />\nEpwAHD H. (iRIFFIN.<br />\n<br />\nI.<br />\n<br />\nill.<br />\n<br />\n111<br />\n<br />\nIV.<br />\n<br />\ntimcrican 3ournal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nX X V in progress. $5 per volume.<br />\n<br />\nYeleutie<br />\n<br />\nlimerican Chemical 3ournal.<br />\nI. RENSEN, Editor. Monthly, 8vo, Volume<br />\nXXIX in progress. sr, per volume.<br />\nIlmerican'journal of Philology.<br />\nII. I,. G I I.I)E RSLEE V E, Editor. Quarterly. avo<br />\nVolume X X III in progress. $3 per volume.<br />\n%fiance from the tiological taboratore.<br />\nVolume V complete. $T, per volume.:<br />\n<br />\n%Mies in lbistorical anb political %clence.<br />\nMonthly. Svo. Series )XI in progress. $3 per<br />\nvolume.<br />\nVI. 3ohne lbophins illnivereity Circulars.<br />\n('ontaining reports of scientific and literary work<br />\nIn progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\nV.<br />\n<br />\nInstruction.<br />\n<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\n„<br />\n<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) in Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nV1111. Johns lbophins lbospital Eulletin. Monthly. 41w.<br />\nVolu ow X I V in progress $1 per year.<br />\n11111. 3ohns lbophins ibospital 1Reports. 4to. Volume XI<br />\nin progress. $5 per volume.<br />\nIX.<br />\n<br />\nContributions to aseyrlology ant, Comparative<br />\nSemitic 11!bilology, (lieltrage Fur Assyriologie, etc.)<br />\nVol. IV conapieto.<br />\n<br />\nX.<br />\n<br />\nfinemoirs from the Ifitologieal 'Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\nLibraries.<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,0(X) volumes.<br />\n<br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit..<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nhistory,<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.,<br />\n<br />\nDirectors.<br />\nIra Remota.<br />\nJoseph S. Amex.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn .1. Abel.<br />\nWilliam Osier.<br />\n<br />\nDirectors.<br />\nBasil<br />\nGildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFronk Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\n(17.014),s.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law),<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol. VII<br />\nUniversity Circulars (vol. X X 11).<br />\nProgrammes of the courses offered to graduatk students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on 'application to the Registrar.<br />\n<br />\nBbobern language 'Rotes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1.60 per volume.<br />\nXII. 3ournal of Experimental feebicine.<br />\nW. 11. WELCH, Editor. fl-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXI.<br />\n<br />\nX1111. limerican 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.Ito. $ti per<br />\nvolume.<br />\nXI V. \"Reports of Maryianb a1eological 93uryee.<br />\nWILLIAM B. CLARK, Editor.<br />\nterrestrial Magnetism anb Rtmospheric Ekes<br />\ntricity. L. A. BAIT ER, Editor. Quarterly. 8vo.<br />\nVolume VII in progress. $2.50 per volume.<br />\nI'M annual'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. 'annual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nin addition to the serials libove named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.60.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins hospital. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. JO<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\n11-11 I. Chemistry, Mineralogy and Geoiogy. Parts<br />\nV-V-V I. Physics,Astronomy and Mathematics.<br />\nvo. 311 cents per part.<br />\nfl full list of publications will be sent on application.<br />\n<br />\nCommunications In respect to exchanges and remittances<br />\nmay be sent to Johns tiopkins ?rasa, Baltimore, ad,<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nMARCH 19, 1903.<br />\n<br />\nNo. 11.<br />\n<br />\nA MODERN LAND OF PROMISE.<br />\n1Z, PIMA.] I NE NT New York man said recently to a seeker for advice, in words<br />\nsomewhat similar to Horace Greeley's famous aphroism, \"Young man,<br />\ngo to Mexico. There the opportunity is ripe for work of all kinds, and<br />\noffers the best field I know of at present.\"<br />\nMexico has been called \"the Egypt of the New World,\" and travelers can<br />\nindeed see a decided similarity between this earliest seat of American civilization<br />\nand that other cradle of the world's culture along the valley of the Nile. The<br />\nsame dry, healthy climate attracts visitors to both lands, the same diversity of<br />\narid desert and tropical vegetation is to be found, and the ancient temples and<br />\npyramids of the Pharaohs find their counterpart only a little less in antiquity and<br />\nsize in this historic part of the New World. In fact, the remains of the Aztec<br />\nand earlier civilizations in Mexico show such a decided similarity to the characteristics of the early Egyptians, that students have been led to consider seriously<br />\nthe question of the Semitic origin of the American races, and a late writer has<br />\neyen advanced the theory of America as the source of Asiatic culture.<br />\nMost people in the more northern section of the United States have erroneons ideas .of Mexico, both as a country and as a people. The country they<br />\nregard as a land of base prairie and primitive conditions, and the people as an<br />\ntintutored race of aborigines. Both ideas are far from fact. The land is ex1 remelv diversified, ranging from the luxurious . foliage of the tropics to mountains of splendid timber and fine ranch land, with considerable areas of sagebrush plain, yet less dreary in aspect probably, than the miles and miles of barren<br />\ndeserts in Arizona and other districts of the Southland. Crops grow fast in<br />\nMexico,. often three or more in a year; the climate is advantageous for cattle<br />\nand sheep raising, and the country needs only care to make it flow with milk<br />\nand honey.<br />\nThose who say there are no antiquities in America, have only to visit Mexico<br />\nto find themselves in the midst of as ancient scenes and thrilling spots of romance<br />\nas are to be found in any part of modern Europe. In the capital of Montezuma<br />\nwas found by Cones and his men, says a writer, \"a civilization superior to that<br />\nwhich they had left behind them in Spain,\" with a 'finely organized government,<br />\na splendid fighting force, and flourishing in all the arts which accompany a refined and cultivated people. The only blot which historians find upon the .Aztec<br />\npeople, was the barbarous regime of the priesthood, and yet this, considering all<br />\nthings, was no ,worse than the horrors of the Holy Inquisition, then in the height<br />\nof its unholy practices in Spain. And before the Aztec Empire exerted its sway<br />\n•<br />\n<br />\n\fT1 11<br />\n<br />\nNEWS 1,1 11\"1'1,',1:.<br />\n<br />\nover all the valley of Mexico, other peoples sprang into power, lived their brief<br />\nlives, and passed away, unnoticed by history, leaving behind them only the<br />\nfanatic carvings and solid walls of masonry that attest the art that once flourished<br />\non this continent, while Europe was steeped in darkness and our Saxon ancestor<br />\nforests.<br />\nwere living in caves and devouring raw flesh in the depths of the German<br />\nthan<br />\nrather<br />\npreserves<br />\nEgypt,<br />\nof<br />\nNothing ever decays in Mexico; the air, like that<br />\nof a<br />\nlife<br />\nthe<br />\nin<br />\nmoment<br />\ndisintegrates, and a hundred years are but as a passing<br />\nCortes<br />\nby<br />\nfounded<br />\nwas<br />\nmonument or a building. In this city of Durango, which<br />\nas a frontier post against the unconquered natives of the North-west, whole rows<br />\nof dwellings, erected at that time, are still occupied. and the city theatre has been<br />\n;n active use for three hundred years. Compared with buildings in the United<br />\nStates, which spring up like mushrooms in a night, and in a few years are torn<br />\ndown to make place for others, the public edifices of Mexico date back to a<br />\nremote antiquity.<br />\nBut if Mexico can be compared in its physical characteristics to ancient<br />\nEgypt, there is possibly an equally strong likeness to that land which the Israelites<br />\nlooked to as promised to their father Abraham. Mexico is to present day Americans, a veritable land of promise, and throngs are crossing over daily to occupy<br />\nthe soil and to sit in the high places.<br />\nAmerican capital is pouring into Mexico at an enormous rate. Railroads<br />\nare being extended and improved, municipal lighting and power plants and water<br />\nworks are being constructed, improved mining and smelting methods are being<br />\nintroduced ; rubber, sugar and coffee plantations are being rapidly developed, and<br />\nall this is being largely done by Americans with American capital. It is estimated<br />\nthat the American capital invested in Mexico at present, amounts to about half a<br />\nbillion dollars. Presidelit Diaz, one of the greatest statesmen of this or any age,<br />\nhas extended a cordial welcome to American capitalists, engineers and merchants,<br />\nand has offered them exceptional facilities for developing the opportunities<br />\nwhich they have secured. All nations are represented in the search for the gold<br />\nof which Mexico has been the mythical storehouse ever since the days of Spanish<br />\ndiscovery, and the City of Mexico is one of the most cosmopolitan cities in the<br />\nMexico is in the transitional stage which the United States passed<br />\nworld.<br />\nthrough about twenty years ago, when electricity began to supplant horse-power<br />\nand steam, and with rapid transit came improved methods in all kinds of manufacturing and distributing machinery. • The steel skeleton building is taking its<br />\nplace beside the century-old adobe house ; the latest mining machinery is supplanting the crude appliances that have been used ever since the mines were first<br />\nopened by the Spaniards ; the electric car and the electric light are well established ; and all the railroad companies have men out surveying lines to new points,<br />\nwhich will thus be given at once a tremendous impetus to growth. The greater<br />\npart of all this activity is in the hands of Americans, who thus find opportunity to<br />\nreproduce in a new country the same movements that took place in the Opening<br />\nup of the Western lands shortly after the Civil War.<br />\nThere is no reason why the opening up of Mexico should not result in a<br />\nprosperity similar to that of the great Western States of the Union. There are<br />\n<br />\n\fTIIK NEWS LETTER.<br />\n<br />\n3<br />\n<br />\nmany inqucements for settlers, not the least of them being a generous and equable<br />\nclimate, where the snows of winter and the terrific heat of mid-summer are equally<br />\nunknown. The only draw-back to the greatest prosperity is the unstableness of<br />\nthe currency, but this question is at this 'very time being considered by a monetary<br />\ncommission, called for that very purpose. One of the greatest booms is expected<br />\nin Mexican real estate, which, it is prophesied, will be worth in gold in a few years<br />\nwhat it now brings in depreciated silver.<br />\nThe outlook for American engineers, physicians, dentists, chemists, machinists, and trained men of any kind, seems bright. Americans are very cordially<br />\nreceived by the Mexican people. In some cases the Americans are, however, no<br />\nmore able to penetrate the rigidity 'of the social usages in Mexico than are other<br />\nforeigners, but wherever the strictness of Spanish convention is relaxed, the<br />\nAmericans stand as the most favored people. In many places the American<br />\nresidents who are educated and refined, are received freely in the homes of the<br />\nwealthiest Mexican families, and invited to the balls and exclusive entertainments<br />\nof the fashionable Mexican set. In some instances American young men are<br />\ngiven liberty to call upon Mexican ladies at their homes.<br />\nThis privilege,<br />\nlargely denied by Mexican convention to even the beaux of their own race, who<br />\nare forced,to conduct a courtship at long range, shows how great is the friendship of our neighbors south of the Rio Grande.<br />\nNORM AN BOYER, '01<br />\nDurango, Mexico.<br />\nDR. SIDNEY LEE ON ELIZABETHAN LITERATURE.<br />\nN Tuesday, Wednesday, Thursday and Friday of last week, Sidney Lee, Litt.<br />\nD., of London. England, delivered a series of extremely interesting lectures<br />\non the general subject,\"Foreign Influences on Elizabethan Literature.\"<br />\nThe lectures were given on the Caroline Donovan foundation, and were largely attended by both University men and the general public, and Dr. Lee spoke in a manner so attractive as to instruct and entertain all.<br />\nDr. Lee is widely known as the editor of the \"Dictionary of National Biography,\" and is the author of a \"Life of William Shakespeare,\" which has supplanted all other works on the same subject, and a life of Queen Victoria, the<br />\nlatter recently published. He came to Baltimore after delivering a series of lectures on \"Famous Men of the Elizabethan Age,\" in Boston and Philadelphia.<br />\nWhile here he was the guest of Dr. Osler.<br />\n\"The Comparative Study of Elizabethan Literature,\" was the subject of Dr.<br />\nLee's first lecture. With a few appropriate remarks President Remsen introduced the lecturer, who spoke for an hour in the voice of a man who is intensely<br />\ninterested and well-grounded in his subject. He developed the idea that whereever we may turn in the great poets of the Elizabethan Era, we shall always find<br />\nin their works the influences of some foreign masterpieces. \"The Elizabethan<br />\nliterature,\" said Dr. Lee, \"is part of the European intellectual movement, we call<br />\nthe Renaissance. Everywhere the Western literature developed from that of<br />\n<br />\n0<br />\n<br />\n\fTHE NEWS LETTER.<br />\nGreece and Rome ; hence, to properly appreciate Elizabethan literature, we must<br />\nhave some knowledge of Greek and Latin poetry.\"<br />\nDr. Lee spoke on \"Italian Influence\" in his second lecture. According to<br />\nhim, although the works of Dante were little known in England, it was to the<br />\nItalian writers, both great and small, that the Elizabethans made resort. In<br />\nspeaking of the pastoral drama, Dr. Lee said: \"The pastoral drama owed its form,<br />\nits ideas, and, in fact, everything to contemporary Italian drama. The influence<br />\nof Dante was not great, nor was that of Petrarch so pronounced on the subsequent literature of Western Europe, as was that of 'Boccaccio. We can estimate<br />\nto some extent the influence of .Boccaccio on modern Western Europe, when we<br />\nremember that he is the ancestor of the modern novel.\"<br />\nThe third topic was \"French Influence.\" Dr. Lee said the French literature<br />\nhad exerted a greater influence upon English literature than that of any other nation. He showed how Italian poetry had influenced the French poets, and, how<br />\nthese in turn, had passed this influence on to the English. \"The influence of<br />\nFrench poetry on Elizabethan literature was probably most conspicuous in the<br />\nvast sonnet literature which was produced in Elizabethan England towards the<br />\nend of the sixteenth century.\" Dr. Lee also spoke at some length on the influence of French prose upon English prose, especially the writings of Montaigne.<br />\n\"His works were translated into English,\" said Dr. Lee, \"and they became exceptionally popular. Shakespeare put a whole passage from Montaigne in his<br />\n'Tempest.'\"<br />\nThe concluding lecture was upon \"Foreign Influence upon Shakespeare.\"<br />\nDr. Lee said that the Latin poetry was especially well-known to Shakespeare, and<br />\nthat it had a great influence upon his poetry. Ovid was a great favorite. Whataid the poet obtained from Greek poetry was derived from English translations. \"Despite this foreign influence.\" Dr. Lee declared, \"the literature of that<br />\nday was a national one.\"<br />\nALUMNI NOTES<br />\n<br />\n89<br />\n'<br />\n<br />\nMr. Scott Thmnas, beginning July 1st, will hold the position of Assistant<br />\n<br />\nProfessor of Education and ( State) Examiner of High Schools, University of<br />\nCalifornia.<br />\nF. A. Clarke is now Professor of Latin, Greek, and I listory at Mars<br />\n<br />\n'93<br />\n<br />\n11111 College, Mars Hill, N. C.<br />\nE. P. NI agruder, who received his M.D. degree from Columbian University in 1902, has resigned his position as resident physician at the Emergency<br />\nHospital, Washington, and has opened an office in that city.<br />\n<br />\n'95<br />\n<br />\n'96<br />\n<br />\nClarence C. Clark is a graduate student at Oxford l'niversity.<br />\n<br />\nLandry Harwood, who, since his graduation from the Kansas City<br />\nSchool of Law in '99, has been with the firm of Pratt, Dana & Black, will sever<br />\nhis connection with that firm on April 1st, and will engage in practice by himself.<br />\n<br />\n197<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\nE. C. Hatch is with the Ottmar Mergenthaler Company.<br />\nsank. t imj studying law with a view of taking up that profession.<br />\n<br />\n'01<br />\n<br />\nI lc is at the<br />\n<br />\nDr. Fred. H. Sykes, who received his Ph. D. at the University in 1895,<br />\n,has been elected Director of the Extension Department and Professor of English<br />\nLiterature in the Teacher's College of Columbia University.<br />\nY. M. C. A. NOTES.<br />\nMorning. Prayers every<br />\nand helpful.<br />\n<br />\nThese services are pleasant<br />\n<br />\nOn Tuesday afternoon, March 31st, Mr. J. M. Rice, Secretary of the Baltimore and Ohio Branch of the Baltimore Association, will speak to us about the<br />\nRailroad work. Mr. Rice is having splendid success in his work with railroad<br />\nmen. He will have something very interesting to tell us about an important department of Christian work, which is being greatly appreciated by all large railroad corporations.<br />\nThe State Convention, which was held in Baltimore March 1;th, 7th and .8th,<br />\nproved to he a success for the vkiting delegates. The home association did not<br />\nderive as much benefit as possible, because the members did not avail themselves<br />\nof the opportunities. Those of us who did attend derived much of pleasure and<br />\ninterest from it.<br />\nThe program was good, especially on Friday evening at Brown Memorial<br />\nChurch, when Mr. rI illar told of the wonderful advance in Army and Navy work<br />\nin the last five years. The address of Dr. Woelfkins of Brooklyn, on \"Temptation,\" was an exceptionally strong one.<br />\nThe Student Conferences interested us most. They were conducted by M r.<br />\nA. B. Williams, Jr., Yale, '98, Intercollegiate Secretary for the East and Canada.<br />\nMost of the important lines of Association work in our colleges were under discussion. The One on Friday afternoon was held at the Central Association, and<br />\non Saturday afternoon in Levering Hall. The colleges from Maryland and Delaware were well represented. St. John's sent twenty-seven men from Annapolis,<br />\nand Delaware College had ten.<br />\nThe luncheons on Friday and Saturday were also very interesting. Tables<br />\nwere set for the delegates in one of the large class rooms of the Central. The decorations were Hopkins Northfield streamers and shield.<br />\nThe one on Saturday especially appealed to the college delegations, when one<br />\nfrom each college was called upon to state why his was the best institution. There<br />\nwas considerable good natured bantering and bragging done, but proved very<br />\namusing as well as instructive to those of us who knew very little of any but<br />\nHopkins.<br />\nAlmost every man who attended any of the sessions was more impressed<br />\nwith the importance of the Association work, and decided to render better service.<br />\nG.<br />\n<br />\n\fTilE NEWS 1 4 1::1\"1\"1-i;R.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n[OPE INS UNIVERSITY.<br />\n<br />\nMARCH 19, 190:1.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nHARRY K. TOOTLE, 1903.<br />\n. GEonoE A. FosTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n<br />\nAssistant News Editors,<br />\nAthletic Editms,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nW.S. BIRD 1908.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\n.RIOOIN BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nS its leading article for this issue the Ni.:ws 1,1mi.:1( prints an interesting<br />\naccount of that modern land of promise, Mexico. To the majority of the<br />\nundergraduates Mr. Boyer is no stranger, and all will be pleased to learn<br />\nof his success in Mexico. His glowing account of that country will no doubt<br />\narouse the interest of the men who are about to leave the university and know not<br />\nwhither to turn their steps. To them Mr. Boyers article should appeal with more<br />\nthan passing- interest. It it true that a. man of ability can make opportunities, no<br />\nmatter where he may be, but it is also true that in a locality where the period of<br />\nrapid growth has already passed, opportunities are not to be found as readily as<br />\nin a new country. Mexico is just such a new country. It has the internal resources, and now it needs men, men with ideas, to develop those resources. To<br />\nbe sure, an American is hampered at the start by not knowing the language, but<br />\nsoon this can be overcome by being thrown in contact with the natives. Such a<br />\ndraw-back should not deter anyone from going to Mexico who feels that the future<br />\nof the country is really as bright as it has been painted. The adoption of a stable<br />\ncurrency will strengthen :\\ I exico's relations with other nations, and the present<br />\nactivity is only the dawn of that new era.<br />\n<br />\nl't<br />\n<br />\n\fTHE NEWS LETTER.<br />\nN LESS something is done to relieve the present stringency of the editorial<br />\npocket-book, the News 14KVITY intends to seek out some beneficent philanthropist, and urge him to provide a fund upon which impecunious young<br />\nI en may draw when the photographer presents his bill. The mania for taking photographs is expensive, and we regret to say that it seems to be upon the increase.<br />\nThis burden falls with more than usual weight upon the members of the Senior<br />\nClass. Not an organization, team, board, or committee but feels that its duty has<br />\nnot been faithfully performed unless a group picture has been taken. The picture seems to give to the board an air of authority and a seal of legality which<br />\notherwise might 1...)e lacking. We deny that there is any desire upon the part of<br />\nthe young men to hand down the group picture to posterity, in order that future<br />\nages may know what giants there were in the good old days when Hopkins consisted of several buildings in the heart of the city, and a future which was nothing<br />\nbut promising. No, indeed. However, the group picture has a duty to perform<br />\naside from filling the coffers of heartless, grasping, inordinate photographers. It<br />\nserves as a constant reminder that, in some respects, the life of our uncivilized<br />\nancestors was not without its compensations. No doubt Adam and Ev,-; chortled<br />\nwith glee when they ascertained that there were no camera fiends in the vicinity,<br />\nrepresenting the Garden of Eden year book for the year Naughty-naught, eager<br />\nto take a group picture of the first lady president of the Dress Reform League,<br />\nand her other and better half. When our ancestors exchanged their bear-skin<br />\nclothing and their cave dwelling for the spike-tailed coat and the modern apartment house they really made a change for the better. But if they got the best of<br />\nthe bargain when they made an, exchange for the group picture, we shudder to<br />\nthink what they gave up when they made the trade.<br />\n<br />\n(11<br />\n<br />\nHE Hopkins athletic games to be held at the Fifth regiment Armory on the<br />\n28th of this month, bid fair to be the most important ever held in this cit v.<br />\nBefore everything else they have been arranged with a view of giving the<br />\nspectators an interesting evening's entertainment. Georgetown will be represented<br />\nby Duffy, Holland, and other. crack runners. Pennsylvania will send men. The<br />\nrelay races will be important features. So far all the efforts which have been<br />\nmade to make the meet an example of what good, successful athletes really are<br />\nhave met with unqualified success. The regimental committee having the Armory<br />\nbuilding in charge, have offered courteously to allow short spikes to be used on<br />\nthis one occasion. This is . a highly complimentary concession, and one which<br />\nis thoroughly appreciated by Hopkins men. II makes possible the presence of<br />\nseveral famous runners who otherwise would not compete.<br />\nAccording to the entry blanks, the handicaps have been restricted to reasonable distances by the games committee, thus insuring to the scratch man a<br />\nchance of making his presence felt. Another feature will be the special scratch<br />\nevents. These are far more satisfactory than the usual handicap 'races, and will<br />\ngive an twortunity of judging of the real ability of the several contestants.<br />\n<br />\nt<br />\n<br />\n\fTHE NEWS 141,, TTE,R.<br />\n(V E desire to call the attention of the members of the Junior and Freshman<br />\nclasses to the vacancies on the Nms 1,01'104. 2\\t the present time the<br />\ntwo positions of assistant news-editors are open, and when the Seniors<br />\ncease their connection With the paper at Easter, there will be several more vacancies which must be filled. The advantages accruing from 1\\11.:ws-LETTER work<br />\nhave been mentioned so often that repetition is unnecessary. Every student, who<br />\nhas any ability in writing, whether he expects to make journalism his future work<br />\nor not, should try for the vacant editorships. The amount of work and time required from the editors is more than compensated by the practical benefits received.<br />\nFreshmen especially are urged to exert themselves. The class of .1905 has shown<br />\nitself competent to take its part in other branches of Liniversity work. Certainly<br />\nthere are some Freshmen who have the ambition and ability to uphold their class<br />\nin this department. They have been students at the University long enough to<br />\nknow what sort of contributions are solicited by the Ni.:ws 141.:rri.:R. Generally<br />\nat this time of the year, one or more members of the lowest class has been appointed to the staff. Up to the present time there has been little material evidence<br />\nshown of ally desire on the part of the Freshmen in general to secure the<br />\nappointments. The appointments are made solely on merit, and all contributions<br />\nhanded in will be taken into consideration in making- them, whether the contributions are printed or not.<br />\n<br />\nHULLABALOO CLUB FEED.<br />\nHE wish of the poet, \"Make me a child again just for to-night,\" was amply<br />\nfulfilled when the Hullabaloo Club gave a \"Feed\" in the Trophy Room<br />\nlast Monday night. The list of impromptu stunts was a long one, and was<br />\nenjoyed to the utmost by the spectators, if not by the participants themselves.<br />\nThe feature of the evening was a race between Mr. Strayer and Mr. Amitien,<br />\nwhich resulted in Mr. Strayer being victorious, .as Mr. Ammen never quite 'finished the lap. Mr. Strayer was so wrought up over his victory, or else lost his<br />\nhead, that he ran an extra lap for good measure, paced by Mr. Plaggemeyer. He<br />\nwas so overcome by these exertions that for the remainder of the evening he did<br />\nnothing but blow and puff.<br />\nA tug of war was another startling swent. On one side was ranged all the<br />\nbrains of the class, and on the other side was all the brawn and muscle. Tt is needless to say that the brawn and muscle came out the winner. :lint the defeated part<br />\nof the class will have their revenge on Saturday night.<br />\nThe evening closed with a game known in the vernacular as ''cuckoo bases.\"<br />\nMr. Plaggemeyer obligingly consented to be \"it.\" His first prize was Mr. Smith,<br />\nwho was unmercifully thumped as he beat a hasty retreat to the base. And so<br />\nit went. Could all outsider have seen that crowd of red-faced, coatless, breathless,<br />\nhappy, shouting, nondescript band of boys, he never would have guessed that the<br />\n\"most potent, teverend and grave seniors\" were taking a night off and thoroughly<br />\nenjoying themselves.<br />\n<br />\nt<br />\n<br />\n\fTHE NK\\•\\ S 1,11\"MR.<br />\n1111111111 111111111111111111111111111111011111<br />\n<br />\nIIIII<br />\n<br />\nIf<br />\n<br />\nII<br />\n<br />\n11111111111011111 'II<br />\n<br />\n1 111111<br />\n<br />\ni f 11 111 I.<br />\n<br />\n11111,11,1<br />\n<br />\n11110.41111<br />\nL<br />\nJ<br />\n•<br />\n<br />\n1 ItII UPI 1 1 111 1011111101111 1 11 1 11111111 1 111111111111101110000110101011111 111 11111111 1 1IUIIlIII 11101 I 11110<br />\n<br />\n1\"13 f'171<br />\n<br />\nAt the banquet of the Ilarvard Club of Maryland last week,<br />\nHerbert E.<br />\nGreen, president of the Club, was toast-master. President Ira Remsen responded<br />\nto the toast, \"Johns Hopkins University,\" and Dr. Wm. Osier to the toast, \"The<br />\nJohns Hopkins Medical School.\"<br />\nOn March ”th, Dr. Ira Remsen spoke at the banquet of the Old Town Merchants and Manufacturers Association, in answer to the toast, \"Education; the<br />\nHandmaid of Commerce.\"<br />\nPresident Ira Remsen will speak at the inaugural celebration at Jacob Tome<br />\nInstitute on May 15th.<br />\nDr. Henry Wood last week addressed the members of the Lend-a-Hand Club<br />\non \"The Literary Animal Story in its Relation to Folk-lore.\"<br />\nDr. Simon Newcomb has been appointed President of the World's Congress<br />\nof Science and Arts, which is to be a feature of the St. Louis World's Fair.<br />\nAs a mark of respect to the memory of Prof. Gaston Paris, the regular exercises of the journal Club last week were postponed. In their place Prof. Elliot<br />\ngave some personal reminiscences of Paris, as a scholar, teacher, and man. Dr.<br />\nE, A. Armstrong made comments on a few of his representative works.<br />\n\"A Financial History of the -United States,\" just published by Dr. Davis<br />\nRich Pewey, of the Mass. Institute of Technology, contains this dedication:<br />\n<br />\n\"To the seminary of the department of History, Politics, and Economics of<br />\nthe .lohns 11opkins University, of which the author was a member from 1883 to<br />\n.rameson we read and learned.<br />\n1886. Under the guidance of Adams, Ely and .<br />\nThe first has gone, leaving affectionate memories and organized activity of permanent usefulness; the others are still doing their work in a spirit of broad-minded<br />\nsympathy and true friendship.\"<br />\nProf. Thomas A. Jenkins, of Swarthmore, who received his Ph. D., from<br />\nthe University 1891, has been appointed Romance Editor of \"Modern Philology,\"<br />\nthe new quarterly journal devoted to research in Modern Languages and Literature, which the University of Chicago will publish, beginning next July. Of the<br />\nseven men who will constitute the advisory board of the publication, four are<br />\nHopkins doctors, as follows: Dr. James W. Bright ; •Hans C. von Jageman, Ph.<br />\nD., '8-1, Professor of Germanic Philology, Harvard; F. \\I. Warren, Ph. D., '87,<br />\nLecturer in French Literature, Yale; and john E. Matzke, Ph. D., '88, Professor<br />\nof Romanic Languages, Leland Stan ford.<br />\n<br />\n\fTHE NEWS LETTER.<br />\nl'resident Remsen was the guest of honor at the johns Hopkins Western<br />\nPennsylvania Alumni Association's banquet, held in Pittsburg, on Monday night.<br />\nProfessor Geo. Petrie, of the Alabama Polytechnic Institute, delivered a<br />\nlecture on the \"Life and Services of Wm. L. Yancy,\" before the historical<br />\nstudents, on the morning of the 18th.<br />\nDr. Kirby Flower Smith will deliver an illustrated lecture on \"Pompeii,\" in<br />\nMcCoy Hall, on Monday evening, March 30th.<br />\nProfessor Leopold iViabilleau, Corresponding Member of the Institute of<br />\nFrance and Director of the \"Musee Social de Paris,\" will give (in Prench) two<br />\nlectures on topics of general interest, followed by six lectures on \"Les Nees Sociale thus la France Contemporaine.\"<br />\nThe dates and topics of the lectures which will be given in Levering Hall, are :<br />\n,Saturday; March 21. ',Institut de France et les Academies.<br />\nTuesday, March 24. Relations entre les Etats-Unis et la France.<br />\n.Thursday, March 26. L'Education sociale<br />\nPeuple.<br />\nSaturday, March 28. La Legislation ouvriere depuis .1870.<br />\nTuesday, March 31. I,es Assurances sociales.<br />\nThursday, April 2.<br />\nLa Mutualite.<br />\nPriday, April 3.<br />\nLa Theorie de la Solidarite sociale par M.. Leon Bourgeois.<br />\nSaturday, April 4.<br />\nLa Propriete individuelle, l'Heritage, et l'Impot.<br />\nThis course has been provided by Elgin R. L. Gould, Ph. D., '86, City Chamberlain of New York, who, it will be remembered, delivered the address at the<br />\n1 )02 commencement exercises.<br />\nMarch 25th, having, by resolution of the State Board of Education, been set<br />\napart as \"Maryland Day\" in the public schools, a lecture on \"The First Settlement<br />\nof Maryland and the Establishment of the Capital at St. Mary's,\" will be given<br />\non that day, before the Johns Hopkins University, by Dr. Bernard C. Steiner,<br />\nAssociate in -History, in McCoy Hall, at 5 P. M.<br />\nDr. Talcott Williams, editor of the Philadelphia Press, will deliver an address<br />\nbefore the johns Hopkins Club tomorrow night, on \"Sundry Syntheses in Art.\"<br />\n<br />\nCareless papa one day left<br />\nA gimlet out of place,<br />\nAnd Sammy drove it, just for fun,<br />\nThrough little sister's face.<br />\nOi<br />\nl'<br />\n111..<br />\n<br />\n7<br />\n<br />\n\"Sam's such a nuisance,\" cried his ma,<br />\n\"just see the mess before us.\"<br />\nBut father calmly said: \"My dear,<br />\nJohn doesn't often bore us.\"—Widow.<br />\n<br />\n\fTi IF. NEWS LETTER.<br />\n<br />\nTHE HOPKINS ARMORY GAMES.<br />\n1,1, the interest of the track and field team is now centered in the Hopkins<br />\n<br />\n(<br />\n<br />\nindoor games to be held in the Fifth Regiment Armory on March 28th.<br />\nThe committee in charge promises that it will be the largest event of the<br />\nk ind ever held in t his city, and it is expected that the big men from all institutions<br />\nin this section will compete. In addition to the usual events scheduled, exhibitions are expected to be given by Arthur F. Dtiffy of Georgetown, who holds the<br />\nworld's record for 100 yards, of 9 :3-5 seconds, and by Ray C. Emory, who holds<br />\nthe world's record for the standing high jump. Special efforts will be made to<br />\nkeep the floor clear, and to have everything so arranged beforehand that there will<br />\nhe no unnecessary and tedious delays in running off the several events. It is<br />\nhoped to make a special feature of the Relay Races by arranging them between the<br />\nfollowing teams:<br />\nJohns Hopkins and the Naval Academy;<br />\nGeorgetown and Pennsylvania;<br />\nMaryland Athletic Club and Baltimore Athletic Club;<br />\nSt. John's and Western Maryland;<br />\nCentral and West Branch Y. M. C. A.;<br />\nSt. Leo's Gymnasium and Olympia Athletic Club, of Washington ;<br />\n-Washington Y. M. C. A. and Georgetown I,aw School ;<br />\nBoys' Latin School and Baltimore City College ;<br />\nDeichmann's and Marston's;<br />\nSchool, and<br />\nEmerson's institute of Washington, Georgetown Preparatory<br />\nPenn Charter of Philadelphia.<br />\nBaltimore Country School and M ilton Academy.<br />\nby<br />\nArrangements are also being made for a \"midget- race, to be contested<br />\nMarston's<br />\nry, and<br />\nthe younger chaps from the Boys' Latin, Deichmann's Preparato<br />\nl'itiversity School.<br />\nhandicap<br />\nThere will be both scratch and handicap events. The following<br />\nevents have been scheduled:<br />\n35 yard dash ; limited to (1 feet.<br />\n140 yard run ; limited to 20 yards.<br />\n880 yard ,run ; limited to 40 yards.<br />\nOne mile run ; limited to 70 yards.<br />\nRunning high jump ; limited to 6 inches.<br />\nPutting1.6-lb. shot ; limited to 7.feet.<br />\n•<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS LETTER<br />\n<br />\nThe scratch events are:<br />\n35 yard dash ; open to Maryland Colleges anci Athletic Clubs.<br />\n35 yard (lash ; interscholastic.<br />\n40 yard, high hurdle (3 feet, ( inches).<br />\n440 yard run ; open—interscholastic.<br />\nFollowing is the list of men that Hopkins will enter in the several events :<br />\nEngland, Freese, :Reedwell, Sladen, Helmholz, H. B. Stone, Lawson, Taylor,<br />\nBond, Knight, Pessagno, Blanck, Tootle, Nelson, LeCron, Parker, Eniig. C. L.<br />\nStone, Boyce, Walker, Super, Mattingly, Wroth, Goodenow, and Morse.<br />\nThe games committee, consisting of Manager K. Gordon Dulaney, chairman ; Joseph T. England, Jr., F. C. Blanck, Harry Chism, and Captain Curzon<br />\nloffman, Jr., is making every effort to carry out successfully their plans, which<br />\nwill assure the success of the meet.<br />\nFirst, second and third prizes will be<br />\nawarded in the various events.<br />\n<br />\nTHE GEORGETOWN GAMES.<br />\nZ H E Georgetown games are now a thing of the past. In every particular .<br />\nthese games were thoroughly satisfactory to all concerned, and too much<br />\ncannot be said to the credit of those who had them in charge, for the masterly manner in which they were run off. The list of entries was unusually large.<br />\nSuch institutions as Pennsylvania, Cornell, Columbia, Harvard', Princeton and<br />\nJohns Hopkins were represented, as well as other schools, athletic clubs and associations, thereby bringing together the fastest men in the business. Consequently<br />\nevery event was hotly contested, and a victory valued accordingly. The showing<br />\nmade by Baltimore men was very creditable. Hopkins, for her part, had her<br />\ngreatest success in the Relay Race with Villa Nova. Clarence Stone, in his first<br />\nappearance on the team, started the good work by a lead of 3 yards at the end<br />\nof his run. Captain Hoffman was passed by his opponent, but finally recovered<br />\nhis loss and finished with 12 yards to the good. Freese in his turn increased this<br />\n. distance, and England ended the race in great style. Besides this race, Freese<br />\nwon a close second in the 50 yard hurdle. Pessagno also showed up well in the<br />\n50 yard dash, finishing second in the semi-finals. The absence of Helmholtz and<br />\nTootle in the dashes was deeply felt. All of our men who went over to see the<br />\ngames felt fully repaid for their trouble, and have no unfavorable criticism to make.<br />\n<br />\nOUTDOOR LACROSSE.<br />\nOn last Saturday afternoon the lacrosse squad practiced at Druid Hill Park<br />\nfor the first time this season, and since then they have been able to get in several<br />\ndays of good work out of doors. The men showed the need of out-door exercise,<br />\nas they were pretty well done up by the unwonted exertion.<br />\nThe playing was fast, and for that reason could not be kept up for any considerable time. The absence of some of the older men, who could not find it convenient to go out at this stage of the game, was seriously felt. It is expected that in a<br />\nfew (lays all of them will be out, including the men from the medical school.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n13<br />\n<br />\nManager Addison has received a letter from the management of the Universit v of Thronto team accepting the sixth of June as the date of the game between<br />\nthe two teams in this city. The. Toronto men expect to begin their out-door work<br />\nthis week.<br />\nThe February number of the Intercollegiate News contains excellent portraits<br />\nof i\\ Ii-. Ronald T. Abercrombie, president of the Athletic Association, and official<br />\ncoach of the Lacrosse Team, and M r. Henry P. Straus, captain of the Lacrosse<br />\nTeam.<br />\nOur first game is scheduled for the fourth of April, with the University of<br />\nPennsylvania, but as yet nothing has been heard from the Penn. management.<br />\nSome trouble has been encountered in securing grounds for the Baltimore<br />\ngames. American League Park is the best place for the, games, but inasmuch as<br />\nthe Eastern League schedule has not been arranged, it is impossible to secure the<br />\ngrounds definitely for the lacrosse dates, as the two schedules may conflict.<br />\n<br />\nAMONG THE COLLEGES.'<br />\nThere are 22r, candidates for the Yale track team at present.<br />\nA bill appropriating $50.1,500 to the University of Minnesota has been introduced in the Senate of that state.<br />\nThere are.twenty Japanese students attending Stanford University.<br />\nThree companies for military drill have been formed by members of the junior<br />\nand senior classes of Yale.<br />\nOver 2,000 degrees have been conferred on women by the University of<br />\nichig-an during the last 30 years, of which 150 were graduate and two honorary<br />\ndegrees.<br />\nThe entire senior class of the Yale Forestry School recently spent a month in<br />\nvarious lumber camps, collecting material for their theses.<br />\nIt is reported that the German universities are not very enthusiastic over the<br />\nCecil Rhodes scholarships, and that they will probably not send any students to<br />\n•<br />\nOxford.<br />\nUniversity of Chicago<br />\nthe<br />\nof<br />\nThis is one of the rules which the Sophomores<br />\nalways bow three<br />\nSophomore,<br />\na<br />\nhave placed upon the Freshmen: \"In addressing<br />\ntimes, raising the left hind foot at the same time.\"<br />\nThe \"Inter-collegiate News\" says:— \"The annual report of President Eliot<br />\nof Harvard University contains for the first time a reference to athletics at<br />\nHarvard.<br />\n\"President Eliot calls attention to the interesting fact that at least 2,000 of<br />\nthe 3,500 students in the Cambridge department of the university take part in<br />\nsome outdoor sport. He notes that changes in football rules have been followed<br />\nby an increase rather than a decrease in injuries, and says that 'Under the existing- rules the game tends to become slower and less visible in its details, and<br />\ntherefore less interesting. Moreover, the ethics of the game, which are the imperfect ethics of war, do not improve. The martial axiom—attack the enemy's weakest point—inevitably leads to the deliberate onslaught on the cripple or the convalescent in the opposing line ; and the habitual violation of rules, if peimlties be<br />\nescaped, is regarded by many as merely amusing.'\"<br />\n•<br />\n<br />\n\fNEWS LETTER..<br />\nAMOR<br />\n(N1'RIBum„ J. u. u.)<br />\nTired, are you? Well, my dearie,<br />\nSuch is life; we all are weary<br />\nSometimes. Come and cuddle closer,<br />\nPut your head upon my shoulder,—<br />\nGolden head that twice five summers<br />\nScarce have shed their suns upon.<br />\nLove you? Look into the fire,<br />\nSee that flame, that ever higher<br />\nSeems to leap than all its brothers,<br />\nNo beginning has, nor ending;<br />\nThere you see my love for you, boy,<br />\nComes from nowhere, nowhere goes to;<br />\nEver living, all embracing.<br />\nLower downward look; see lacing<br />\nIn and out the burning embers<br />\nDarts a breath, a pale blue phantom,<br />\nMakes each glowing coal grow brighter,<br />\nNow bedulls their flaming throbbing;<br />\nThus you play upon my soul, boy,<br />\nMake it gleam, then dim its radiance,<br />\nLifting me to heights sublimest,<br />\nPlunging me in deep despair.<br />\nThere were loves before your coming?<br />\nCalled them loves, but now I see that<br />\nThey were just the first few letters<br />\nOf the alphabet of loving.<br />\nNow, my boy, Love's volume open<br />\nLies before me, and there spelling<br />\nOut each word, with you, my teacher,<br />\nEvery day new pleasures showing<br />\nIn the reading of Love's lore.<br />\nOdd now, is't not, that a boy like<br />\nYou, can twirl around his finger<br />\nMe, whose years are more than treble<br />\nHis? So, tell me by what power<br />\nYou've compelled me to your service?<br />\nCannot? Listen, I will tell you:<br />\nLook into the mirror yonder;<br />\nSee the hair, than spun gold brighter,<br />\nSee the eyes, with depths of blueness<br />\nStole out of Heaven's ether;<br />\nSee the nose more straight and whiter<br />\nThan the fairest beam of Luna ;<br />\n<br />\n\fTHE NEWS LETTER.<br />\nSee the lips so red, that rubies<br />\nE'en do blush a shade more redder<br />\nLest those same red bps should put them<br />\nl'nto shame and spoil their lustre.<br />\nLook again. See, white as ivory,<br />\nGleams a neck and marble bosom<br />\nPure and virgin as the heart that<br />\nThrobs beneath it and the Soul that<br />\nLurks there somewhere. I can tell you<br />\nNothing further. Boy, I love you<br />\nJust because you are yourself.<br />\nYou have crept into my being;<br />\nNestled there as on my shoulder<br />\nNestles now your curly head ; and<br />\nEvery movement, every throbbing-,<br />\nEach pulsation of your heart, wakes<br />\nIn my soul a deep emotion<br />\nE'en the gods could never measure.<br />\nNo, I think there's nothing further<br />\nWhen a soul, completely. merging<br />\nin another soul, there loses<br />\nAll sensation, each emotion,<br />\nSave those by its fellow wakened.<br />\nDrifting over Love's vast. ocean<br />\nPast the shores of pain and pleasure<br />\nPast the islands of regretting,<br />\nNaught exists, save thou and I, Boy ;<br />\nIn eternity, past, future,<br />\nAnd beyond it, all is silence.<br />\nSleepy ? Well, good night then, deari;<br />\nHappy dreams dance through your slumbers.<br />\nks me, so—Good night, my Boy!<br />\nSOME FACTS ABOUT THE ELEVATOR<br />\n1. That it is safer for Freshmen to abstain from the luxury entirely.<br />\n2. That if he be so heavily burdened by his hard lot that his tender limbs<br />\nrefuse to climb the pathway to knowledge, let him recede into the farthest corner<br />\nof the lift, and there, with head uncovered, and eyes fixed meekly on the floor,<br />\nwait until some of his more elevated brethren stop the car.<br />\n3. That it is healthier to climb the stairs than to ride, when the elevator is<br />\nnot going.<br />\n4. That it is useless to press the button of the elevator not in use.<br />\n5. That the man with the black skull cap should not be crowded, he becomes peevish.<br />\n6. That if the elevator contain six or more juniors, no others are admitted.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\nRoJWSPIERRE.<br />\n<br />\nWhat do you gain by I )eltiging every street of Paris with Bloo(1?\" declaimed<br />\n1)ripping Danton.<br />\n\"At least I will make a great Alley gory,\" reasoned the Republican glancing<br />\ndown the RH( Royale at the reeking Guillotine.-- (lie Record.<br />\n<br />\nii 1R (visiting son at college)<br />\n. : \"Pretty good cigars You smoke, my boy;<br />\nI can't afford cigars like these.\"<br />\nSON : \"Fill your case, dad; fill your case.\"--/iampoon.<br />\n<br />\n\"What is the poet laboring over?\"<br />\n\"Trying to find a word to rhyme with Pabst.\"<br />\n\"Ah, studying lager-rythms, I see.\"—WidoTo.<br />\n<br />\nA fair dame from Kalamazoo,<br />\n()nce shot a black bear thro, and thro'.<br />\nWhen the brute was quite dead<br />\nShe scalped it and .Ktid<br />\n\"Good gracious! Just look at the goo!\"—lridow.<br />\n<br />\nThere once was a great dairy Co.<br />\nWhich boasted that it did not p()<br />\nWater into its cream.<br />\nIf an inspector tried to do<br />\nCans in the street, and tro<br />\nCharges, 'twas proved a pipe-dream.—Tiger.<br />\n<br />\n\f'OPEN ALL NIGHT.<br />\n<br />\n1LLIAXSON 3 WATTS,<br />\n41<br />\nZtores-,<br />\nHoward and Franklin Streets.<br />\nTiM4:03. ffroic<br />\n<br />\n'Baltimore and Eutaw Streets.<br />\n<br />\n.3ooilt3. VcrtitilicM COilet<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMoRF: FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT ed, Co.,<br />\n704 MADISON AVE.<br />\n<br />\nrttcLeB,eigatii, SODA LWater.<br />\n<br />\nI'. 'Phone 3350- V<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\n,%\\athematical and Surveyino Instruments,<br />\nDraughtsmen's and Engineers' Suppiles.._._<br />\nN. W.Corner<br />\nLexington and Liberty Sts.<br />\n<br />\nliALTIMOlit?., /AD.<br />\n<br />\nAgent for .K.euffel tr- Eimer Co., of Nes<br />\n<br />\nt.-4 I<br />\n<br />\n.<br />\n1010-Your inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nYork.<br />\n<br />\n.,At<br />\n<br />\nHenderson's<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks, Note Hooks,<br />\nMadisons<br />\nStudents' Supplies.<br />\n<br />\n—<br />\n<br />\ncff Howard Sts.<br />\n<br />\nIncur torated I s;s<br />\n<br />\n\"Pkis Steohgt as the Steohttest.\"<br />\n<br />\n'TI-tE FIDELITY MUTtilit LIFE INSURPieNGE GO.,<br />\nOF 19+1 LFfr.DE L,Pf-H*.<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for<br />\nFroiti,rry, either during vacation or permanently.<br />\nFor Agency In Maryland or WeNt<br />\n<br />\nTHE<br />\n<br />\n:141drems,<br />\n4'. GRAHAM, Manager<br />\nMOO M Merchants Bank Bldg., Baltimore, 110<br />\n<br />\nFor Advertising Space in this Paper<br />\nA PP1,1\"r0<br />\n<br />\n7.,<br />\n<br />\n1.01411Aft<br />\n<br />\n'HALI<br />\n<br />\n$11..D<br />\n<br />\nPUBLISHERS.<br />\n<br />\n\fCoplial$300,000. Surplusg6UnglultletlProllis$400,000<br />\n<br />\nSTIEFF PIANOS<br />\nMADE (DP\"IPHIC REST MATERIALS AIONEY<br />\n7,1tIl..:NCE CAN<br />\n11 ,X1.1,<br />\nAND ,<br />\n<br />\nW A It RRIMMMI<br />\n<br />\nOf BALTIMORE.<br />\n<br />\n9 N. 141 1 it:leT1<br />\n<br />\nST.<br />\n<br />\nrs and<br />\nB0ok<br />\none s.<br />\ntatir<br />\n84 W. BUTIMORE STREET.<br />\n<br />\nGUSHING &GOMPRNY<br />\n<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\n<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\n#<br />\n#<br />\nCollege of Balt i more.<br />\nSTATIONBRY—for School, Pamily, Office and Bank.<br />\n— -<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nIIIMMIIMIIIIIMNIMMINNUMI Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Sale The J. H. U. Pennants,and all other College<br />\n<br />\nTHOS.BLAKE CO<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE ST.<br />\nMANUFACTURER<br />\n<br />\nST. PAUL<br />\n<br />\nBALTIMORE,<br />\n<br />\nilMease Call an<br />\n<br />\nA General Banking Business Transacted.<br />\n<br />\nSafe Deposit Boxes for Rent<br />\nfrom VI p, r year and upward.<br />\n<br />\nfIGGOtHilS 8o1lcited.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN & SON.<br />\nFOR<br />\n<br />\nGO. m<br />\n8TRBIDER<br />\nJORDAN<br />\nSamples<br />\nReads as follows:<br />\n<br />\n5V FL<br />\nAU:Sr/N.704%<br />\nsubmitted of<br />\ntine<br />\nquality.<br />\ncoloring,<br />\nno<br />\nadulterants,<br />\nFrench Brandy—no<br />\n<br />\nOporto Port -absoluteiy pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—lie Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH<br />\n<br />\nSTORE AT ROLAND PARK,<br />\n<br />\nSuccessor to Cummins.<br />\n<br />\nOF<br />\n<br />\nereell letter tratermtp jewelrp,<br />\n14 AND 16<br />\n<br />\nL. titrouse, Vice.-Prest.<br />\nEdw. P. Hayden, Ass't Cashier.<br />\n<br />\nJas. Clark, Prest<br />\nChas. S. Miller, Cashier.<br />\n<br />\nIlgenfritz Studio<br />\n<br />\nH. FETTING,<br />\n<br />\nA<br />\n<br />\nDrovers & Meclianles Nat'l Bank,<br />\n<br />\n11LTY.<br />\n<br />\nSTREET,<br />\n<br />\nMD.<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br />\n<br />\nExamtne our line iSetore iPurebasind.<br />\nC. & 11). telephone 443r,<br />\n<br />\nJENNINC;ti 4.V 1.1012S14:1Y.<br />\nMEHCIIIANP TAILORS,<br />\n<br />\n21 W. PAY man,<br />\n<br />\nsTit NET.<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. fr<br />\n<br />\n&to RUZICKA<br />\nBookbinder,<br />\n<br />\n-°4-:<br />\n<br />\nBOOKS!!!<br />\nSECOND=ITAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, Sold and<br />\n<br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EUTFIAV ST.<br />\n<br />\nNear the University.<br />\nBaltinion•',I<br />\n<br />\nrgest Old<br />\n<br />\nBook Store.<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats,<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\n71 S<br />\nSilk and Caasimere Hats. Ww<br />\n<br />\nil= opk<br />\n<br />\nCaps<br />\n<br />\nNORTH GERMAN LLOYD S. S. GO.<br />\nGAM PASSAGE AT LOW RATES.<br />\n<br />\nMew York to Bremen, London, Paris, Gibraltar, Naples,<br />\nBf1LT1MO1 TO BREMEN DIRECT.<br />\n<br />\nCSE110d,<br />\n<br />\netc.<br />\n<br />\nSGflUMRGRER & GO., General<br />\n<br />\nPor particulars apply to<br />\n<br />\nTHE<br />\n<br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nAgents.<br />\n<br />\n.JAS. MEIKLE, VICE.PREST.<br />\nJAS. R. RICHARDS, TREAS.<br />\n<br />\nISAAC H. DIXON, PREST.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSmith, Dixon Co.<br />\n..Paper..<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "let<br /><br />\nMarch ig, 1903<br /><br />\nVol. VII, No. II<br /><br />\n4 t\"<br /><br />\nTHE<br /><br />\nNEWS LI:ITER<br />\n°h<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns<br /><br />\nThe Johns Hopkins Press.<br /><br />\nHopkins UniversitU<br /><br />\nBALTIMORE, MARYLAND,<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October<br /><br />\nI, 1902.<br /><br />\nPresident: Inn ItEmsEN. Dean of the Medical Faculty:<br />\nWILLIAM H. Hewitt!. Dean of the College Faculty:<br />\nEpwAHD H. (iRIFFIN.<br /><br />\nI.<br /><br />\nill.<br /><br />\n111<br /><br />\nIV.<br /><br />\ntimcrican 3ournal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nX X V in progress. $5 per volume.<br /><br />\nYeleutie<br /><br />\nlimerican Chemical 3ournal.<br />\nI. RENSEN, Editor. Monthly, 8vo, Volume<br />\nXXIX in progress. sr, per volume.<br />\nIlmerican'journal of Philology.<br />\nII. I,. G I I.I)E RSLEE V E, Editor. Quarterly. avo<br />\nVolume X X III in progress. $3 per volume.<br />\n%fiance from the tiological taboratore.<br />\nVolume V complete. $T, per volume.:<br /><br />\n%Mies in lbistorical anb political %clence.<br />\nMonthly. Svo. Series )XI in progress. $3 per<br />\nvolume.<br />\nVI. 3ohne lbophins illnivereity Circulars.<br />\n('ontaining reports of scientific and literary work<br />\nIn progress in Baltimore. 4to. Vol. XXII in<br />\nprogress. $1 per year.<br />\nV.<br /><br />\nInstruction.<br /><br />\nFOR GRADUATE STUDENTS:<br /><br />\n„<br /><br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) in Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nV1111. Johns lbophins lbospital Eulletin. Monthly. 41w.<br />\nVolu ow X I V in progress $1 per year.<br />\n11111. 3ohns lbophins ibospital 1Reports. 4to. Volume XI<br />\nin progress. $5 per volume.<br />\nIX.<br /><br />\nContributions to aseyrlology ant, Comparative<br />\nSemitic 11!bilology, (lieltrage Fur Assyriologie, etc.)<br />\nVol. IV conapieto.<br /><br />\nX.<br /><br />\nfinemoirs from the Ifitologieal 'Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\nLibraries.<br />\nUniversity,<br />\n105,000 volumes.<br />\nPeabody Institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,0(X) volumes.<br /><br />\nLaboratories.<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit..<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nhistory,<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.,<br /><br />\nDirectors.<br />\nIra Remota.<br />\nJoseph S. Amex.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn .1. Abel.<br />\nWilliam Osier.<br /><br />\nDirectors.<br />\nBasil<br />\nGildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. H. Hollander.<br />\nFronk Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\n(17.014),s.<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law),<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerican Journal of Philology (vol. XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol. VII<br />\nUniversity Circulars (vol. X X 11).<br />\nProgrammes of the courses offered to graduatk students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on 'application to the Registrar.<br /><br />\nBbobern language 'Rotes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to. Volume<br />\nXVIII in progress. $1.60 per volume.<br />\nXII. 3ournal of Experimental feebicine.<br />\nW. 11. WELCH, Editor. fl-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXI.<br /><br />\nX1111. limerican 3ournal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly.Ito. $ti per<br />\nvolume.<br />\nXI V. \"Reports of Maryianb a1eological 93uryee.<br />\nWILLIAM B. CLARK, Editor.<br />\nterrestrial Magnetism anb Rtmospheric Ekes<br />\ntricity. L. A. BAIT ER, Editor. Quarterly. 8vo.<br />\nVolume VII in progress. $2.50 per volume.<br />\nI'M annual'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\nXVII. 'annual'Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nin addition to the serials libove named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.60.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins hospital. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simile edition. Edited by J. Bendel Harris. 110 pp. 4to. JO<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\n11-11 I. Chemistry, Mineralogy and Geoiogy. Parts<br />\nV-V-V I. Physics,Astronomy and Mathematics.<br />\nvo. 311 cents per part.<br />\nfl full list of publications will be sent on application.<br /><br />\nCommunications In respect to exchanges and remittances<br />\nmay be sent to Johns tiopkins ?rasa, Baltimore, ad,<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nMARCH 19, 1903.<br /><br />\nNo. 11.<br /><br />\nA MODERN LAND OF PROMISE.<br />\n1Z, PIMA.] I NE NT New York man said recently to a seeker for advice, in words<br />\nsomewhat similar to Horace Greeley's famous aphroism, \"Young man,<br />\ngo to Mexico. There the opportunity is ripe for work of all kinds, and<br />\noffers the best field I know of at present.\"<br />\nMexico has been called \"the Egypt of the New World,\" and travelers can<br />\nindeed see a decided similarity between this earliest seat of American civilization<br />\nand that other cradle of the world's culture along the valley of the Nile. The<br />\nsame dry, healthy climate attracts visitors to both lands, the same diversity of<br />\narid desert and tropical vegetation is to be found, and the ancient temples and<br />\npyramids of the Pharaohs find their counterpart only a little less in antiquity and<br />\nsize in this historic part of the New World. In fact, the remains of the Aztec<br />\nand earlier civilizations in Mexico show such a decided similarity to the characteristics of the early Egyptians, that students have been led to consider seriously<br />\nthe question of the Semitic origin of the American races, and a late writer has<br />\neyen advanced the theory of America as the source of Asiatic culture.<br />\nMost people in the more northern section of the United States have erroneons ideas .of Mexico, both as a country and as a people. The country they<br />\nregard as a land of base prairie and primitive conditions, and the people as an<br />\ntintutored race of aborigines. Both ideas are far from fact. The land is ex1 remelv diversified, ranging from the luxurious . foliage of the tropics to mountains of splendid timber and fine ranch land, with considerable areas of sagebrush plain, yet less dreary in aspect probably, than the miles and miles of barren<br />\ndeserts in Arizona and other districts of the Southland. Crops grow fast in<br />\nMexico,. often three or more in a year; the climate is advantageous for cattle<br />\nand sheep raising, and the country needs only care to make it flow with milk<br />\nand honey.<br />\nThose who say there are no antiquities in America, have only to visit Mexico<br />\nto find themselves in the midst of as ancient scenes and thrilling spots of romance<br />\nas are to be found in any part of modern Europe. In the capital of Montezuma<br />\nwas found by Cones and his men, says a writer, \"a civilization superior to that<br />\nwhich they had left behind them in Spain,\" with a 'finely organized government,<br />\na splendid fighting force, and flourishing in all the arts which accompany a refined and cultivated people. The only blot which historians find upon the .Aztec<br />\npeople, was the barbarous regime of the priesthood, and yet this, considering all<br />\nthings, was no ,worse than the horrors of the Holy Inquisition, then in the height<br />\nof its unholy practices in Spain. And before the Aztec Empire exerted its sway<br />\n•<br /><br />\nT1 11<br /><br />\nNEWS 1,1 11\"1'1,',1:.<br /><br />\nover all the valley of Mexico, other peoples sprang into power, lived their brief<br />\nlives, and passed away, unnoticed by history, leaving behind them only the<br />\nfanatic carvings and solid walls of masonry that attest the art that once flourished<br />\non this continent, while Europe was steeped in darkness and our Saxon ancestor<br />\nforests.<br />\nwere living in caves and devouring raw flesh in the depths of the German<br />\nthan<br />\nrather<br />\npreserves<br />\nEgypt,<br />\nof<br />\nNothing ever decays in Mexico; the air, like that<br />\nof a<br />\nlife<br />\nthe<br />\nin<br />\nmoment<br />\ndisintegrates, and a hundred years are but as a passing<br />\nCortes<br />\nby<br />\nfounded<br />\nwas<br />\nmonument or a building. In this city of Durango, which<br />\nas a frontier post against the unconquered natives of the North-west, whole rows<br />\nof dwellings, erected at that time, are still occupied. and the city theatre has been<br />\n;n active use for three hundred years. Compared with buildings in the United<br />\nStates, which spring up like mushrooms in a night, and in a few years are torn<br />\ndown to make place for others, the public edifices of Mexico date back to a<br />\nremote antiquity.<br />\nBut if Mexico can be compared in its physical characteristics to ancient<br />\nEgypt, there is possibly an equally strong likeness to that land which the Israelites<br />\nlooked to as promised to their father Abraham. Mexico is to present day Americans, a veritable land of promise, and throngs are crossing over daily to occupy<br />\nthe soil and to sit in the high places.<br />\nAmerican capital is pouring into Mexico at an enormous rate. Railroads<br />\nare being extended and improved, municipal lighting and power plants and water<br />\nworks are being constructed, improved mining and smelting methods are being<br />\nintroduced ; rubber, sugar and coffee plantations are being rapidly developed, and<br />\nall this is being largely done by Americans with American capital. It is estimated<br />\nthat the American capital invested in Mexico at present, amounts to about half a<br />\nbillion dollars. Presidelit Diaz, one of the greatest statesmen of this or any age,<br />\nhas extended a cordial welcome to American capitalists, engineers and merchants,<br />\nand has offered them exceptional facilities for developing the opportunities<br />\nwhich they have secured. All nations are represented in the search for the gold<br />\nof which Mexico has been the mythical storehouse ever since the days of Spanish<br />\ndiscovery, and the City of Mexico is one of the most cosmopolitan cities in the<br />\nMexico is in the transitional stage which the United States passed<br />\nworld.<br />\nthrough about twenty years ago, when electricity began to supplant horse-power<br />\nand steam, and with rapid transit came improved methods in all kinds of manufacturing and distributing machinery. • The steel skeleton building is taking its<br />\nplace beside the century-old adobe house ; the latest mining machinery is supplanting the crude appliances that have been used ever since the mines were first<br />\nopened by the Spaniards ; the electric car and the electric light are well established ; and all the railroad companies have men out surveying lines to new points,<br />\nwhich will thus be given at once a tremendous impetus to growth. The greater<br />\npart of all this activity is in the hands of Americans, who thus find opportunity to<br />\nreproduce in a new country the same movements that took place in the Opening<br />\nup of the Western lands shortly after the Civil War.<br />\nThere is no reason why the opening up of Mexico should not result in a<br />\nprosperity similar to that of the great Western States of the Union. There are<br /><br />\nTIIK NEWS LETTER.<br /><br />\n3<br /><br />\nmany inqucements for settlers, not the least of them being a generous and equable<br />\nclimate, where the snows of winter and the terrific heat of mid-summer are equally<br />\nunknown. The only draw-back to the greatest prosperity is the unstableness of<br />\nthe currency, but this question is at this 'very time being considered by a monetary<br />\ncommission, called for that very purpose. One of the greatest booms is expected<br />\nin Mexican real estate, which, it is prophesied, will be worth in gold in a few years<br />\nwhat it now brings in depreciated silver.<br />\nThe outlook for American engineers, physicians, dentists, chemists, machinists, and trained men of any kind, seems bright. Americans are very cordially<br />\nreceived by the Mexican people. In some cases the Americans are, however, no<br />\nmore able to penetrate the rigidity 'of the social usages in Mexico than are other<br />\nforeigners, but wherever the strictness of Spanish convention is relaxed, the<br />\nAmericans stand as the most favored people. In many places the American<br />\nresidents who are educated and refined, are received freely in the homes of the<br />\nwealthiest Mexican families, and invited to the balls and exclusive entertainments<br />\nof the fashionable Mexican set. In some instances American young men are<br />\ngiven liberty to call upon Mexican ladies at their homes.<br />\nThis privilege,<br />\nlargely denied by Mexican convention to even the beaux of their own race, who<br />\nare forced,to conduct a courtship at long range, shows how great is the friendship of our neighbors south of the Rio Grande.<br />\nNORM AN BOYER, '01<br />\nDurango, Mexico.<br />\nDR. SIDNEY LEE ON ELIZABETHAN LITERATURE.<br />\nN Tuesday, Wednesday, Thursday and Friday of last week, Sidney Lee, Litt.<br />\nD., of London. England, delivered a series of extremely interesting lectures<br />\non the general subject,\"Foreign Influences on Elizabethan Literature.\"<br />\nThe lectures were given on the Caroline Donovan foundation, and were largely attended by both University men and the general public, and Dr. Lee spoke in a manner so attractive as to instruct and entertain all.<br />\nDr. Lee is widely known as the editor of the \"Dictionary of National Biography,\" and is the author of a \"Life of William Shakespeare,\" which has supplanted all other works on the same subject, and a life of Queen Victoria, the<br />\nlatter recently published. He came to Baltimore after delivering a series of lectures on \"Famous Men of the Elizabethan Age,\" in Boston and Philadelphia.<br />\nWhile here he was the guest of Dr. Osler.<br />\n\"The Comparative Study of Elizabethan Literature,\" was the subject of Dr.<br />\nLee's first lecture. With a few appropriate remarks President Remsen introduced the lecturer, who spoke for an hour in the voice of a man who is intensely<br />\ninterested and well-grounded in his subject. He developed the idea that whereever we may turn in the great poets of the Elizabethan Era, we shall always find<br />\nin their works the influences of some foreign masterpieces. \"The Elizabethan<br />\nliterature,\" said Dr. Lee, \"is part of the European intellectual movement, we call<br />\nthe Renaissance. Everywhere the Western literature developed from that of<br /><br />\n0<br /><br />\nTHE NEWS LETTER.<br />\nGreece and Rome ; hence, to properly appreciate Elizabethan literature, we must<br />\nhave some knowledge of Greek and Latin poetry.\"<br />\nDr. Lee spoke on \"Italian Influence\" in his second lecture. According to<br />\nhim, although the works of Dante were little known in England, it was to the<br />\nItalian writers, both great and small, that the Elizabethans made resort. In<br />\nspeaking of the pastoral drama, Dr. Lee said: \"The pastoral drama owed its form,<br />\nits ideas, and, in fact, everything to contemporary Italian drama. The influence<br />\nof Dante was not great, nor was that of Petrarch so pronounced on the subsequent literature of Western Europe, as was that of 'Boccaccio. We can estimate<br />\nto some extent the influence of .Boccaccio on modern Western Europe, when we<br />\nremember that he is the ancestor of the modern novel.\"<br />\nThe third topic was \"French Influence.\" Dr. Lee said the French literature<br />\nhad exerted a greater influence upon English literature than that of any other nation. He showed how Italian poetry had influenced the French poets, and, how<br />\nthese in turn, had passed this influence on to the English. \"The influence of<br />\nFrench poetry on Elizabethan literature was probably most conspicuous in the<br />\nvast sonnet literature which was produced in Elizabethan England towards the<br />\nend of the sixteenth century.\" Dr. Lee also spoke at some length on the influence of French prose upon English prose, especially the writings of Montaigne.<br />\n\"His works were translated into English,\" said Dr. Lee, \"and they became exceptionally popular. Shakespeare put a whole passage from Montaigne in his<br />\n'Tempest.'\"<br />\nThe concluding lecture was upon \"Foreign Influence upon Shakespeare.\"<br />\nDr. Lee said that the Latin poetry was especially well-known to Shakespeare, and<br />\nthat it had a great influence upon his poetry. Ovid was a great favorite. Whataid the poet obtained from Greek poetry was derived from English translations. \"Despite this foreign influence.\" Dr. Lee declared, \"the literature of that<br />\nday was a national one.\"<br />\nALUMNI NOTES<br /><br />\n89<br />\n'<br /><br />\nMr. Scott Thmnas, beginning July 1st, will hold the position of Assistant<br /><br />\nProfessor of Education and ( State) Examiner of High Schools, University of<br />\nCalifornia.<br />\nF. A. Clarke is now Professor of Latin, Greek, and I listory at Mars<br /><br />\n'93<br /><br />\n11111 College, Mars Hill, N. C.<br />\nE. P. NI agruder, who received his M.D. degree from Columbian University in 1902, has resigned his position as resident physician at the Emergency<br />\nHospital, Washington, and has opened an office in that city.<br /><br />\n'95<br /><br />\n'96<br /><br />\nClarence C. Clark is a graduate student at Oxford l'niversity.<br /><br />\nLandry Harwood, who, since his graduation from the Kansas City<br />\nSchool of Law in '99, has been with the firm of Pratt, Dana &amp; Black, will sever<br />\nhis connection with that firm on April 1st, and will engage in practice by himself.<br /><br />\n197<br /><br />\nTHE NEWS LETTER.<br /><br />\nE. C. Hatch is with the Ottmar Mergenthaler Company.<br />\nsank. t imj studying law with a view of taking up that profession.<br /><br />\n'01<br /><br />\nI lc is at the<br /><br />\nDr. Fred. H. Sykes, who received his Ph. D. at the University in 1895,<br />\n,has been elected Director of the Extension Department and Professor of English<br />\nLiterature in the Teacher's College of Columbia University.<br />\nY. M. C. A. NOTES.<br />\nMorning. Prayers every<br />\nand helpful.<br /><br />\nThese services are pleasant<br /><br />\nOn Tuesday afternoon, March 31st, Mr. J. M. Rice, Secretary of the Baltimore and Ohio Branch of the Baltimore Association, will speak to us about the<br />\nRailroad work. Mr. Rice is having splendid success in his work with railroad<br />\nmen. He will have something very interesting to tell us about an important department of Christian work, which is being greatly appreciated by all large railroad corporations.<br />\nThe State Convention, which was held in Baltimore March 1;th, 7th and .8th,<br />\nproved to he a success for the vkiting delegates. The home association did not<br />\nderive as much benefit as possible, because the members did not avail themselves<br />\nof the opportunities. Those of us who did attend derived much of pleasure and<br />\ninterest from it.<br />\nThe program was good, especially on Friday evening at Brown Memorial<br />\nChurch, when Mr. rI illar told of the wonderful advance in Army and Navy work<br />\nin the last five years. The address of Dr. Woelfkins of Brooklyn, on \"Temptation,\" was an exceptionally strong one.<br />\nThe Student Conferences interested us most. They were conducted by M r.<br />\nA. B. Williams, Jr., Yale, '98, Intercollegiate Secretary for the East and Canada.<br />\nMost of the important lines of Association work in our colleges were under discussion. The One on Friday afternoon was held at the Central Association, and<br />\non Saturday afternoon in Levering Hall. The colleges from Maryland and Delaware were well represented. St. John's sent twenty-seven men from Annapolis,<br />\nand Delaware College had ten.<br />\nThe luncheons on Friday and Saturday were also very interesting. Tables<br />\nwere set for the delegates in one of the large class rooms of the Central. The decorations were Hopkins Northfield streamers and shield.<br />\nThe one on Saturday especially appealed to the college delegations, when one<br />\nfrom each college was called upon to state why his was the best institution. There<br />\nwas considerable good natured bantering and bragging done, but proved very<br />\namusing as well as instructive to those of us who knew very little of any but<br />\nHopkins.<br />\nAlmost every man who attended any of the sessions was more impressed<br />\nwith the importance of the Association work, and decided to render better service.<br />\nG.<br /><br />\nTilE NEWS 1 4 1::1\"1\"1-i;R.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n[OPE INS UNIVERSITY.<br /><br />\nMARCH 19, 190:1.<br /><br />\nSubscription $1.50 per year.<br /><br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br /><br />\n10 Cents a single copy.<br /><br />\nHARRY K. TOOTLE, 1903.<br />\n. GEonoE A. FosTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br /><br />\nAssistant News Editors,<br />\nAthletic Editms,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nW.S. BIRD 1908.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\n.RIOOIN BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nS its leading article for this issue the Ni.:ws 1,1mi.:1( prints an interesting<br />\naccount of that modern land of promise, Mexico. To the majority of the<br />\nundergraduates Mr. Boyer is no stranger, and all will be pleased to learn<br />\nof his success in Mexico. His glowing account of that country will no doubt<br />\narouse the interest of the men who are about to leave the university and know not<br />\nwhither to turn their steps. To them Mr. Boyers article should appeal with more<br />\nthan passing- interest. It it true that a. man of ability can make opportunities, no<br />\nmatter where he may be, but it is also true that in a locality where the period of<br />\nrapid growth has already passed, opportunities are not to be found as readily as<br />\nin a new country. Mexico is just such a new country. It has the internal resources, and now it needs men, men with ideas, to develop those resources. To<br />\nbe sure, an American is hampered at the start by not knowing the language, but<br />\nsoon this can be overcome by being thrown in contact with the natives. Such a<br />\ndraw-back should not deter anyone from going to Mexico who feels that the future<br />\nof the country is really as bright as it has been painted. The adoption of a stable<br />\ncurrency will strengthen :\\ I exico's relations with other nations, and the present<br />\nactivity is only the dawn of that new era.<br /><br />\nl't<br /><br />\nTHE NEWS LETTER.<br />\nN LESS something is done to relieve the present stringency of the editorial<br />\npocket-book, the News 14KVITY intends to seek out some beneficent philanthropist, and urge him to provide a fund upon which impecunious young<br />\nI en may draw when the photographer presents his bill. The mania for taking photographs is expensive, and we regret to say that it seems to be upon the increase.<br />\nThis burden falls with more than usual weight upon the members of the Senior<br />\nClass. Not an organization, team, board, or committee but feels that its duty has<br />\nnot been faithfully performed unless a group picture has been taken. The picture seems to give to the board an air of authority and a seal of legality which<br />\notherwise might 1...)e lacking. We deny that there is any desire upon the part of<br />\nthe young men to hand down the group picture to posterity, in order that future<br />\nages may know what giants there were in the good old days when Hopkins consisted of several buildings in the heart of the city, and a future which was nothing<br />\nbut promising. No, indeed. However, the group picture has a duty to perform<br />\naside from filling the coffers of heartless, grasping, inordinate photographers. It<br />\nserves as a constant reminder that, in some respects, the life of our uncivilized<br />\nancestors was not without its compensations. No doubt Adam and Ev,-; chortled<br />\nwith glee when they ascertained that there were no camera fiends in the vicinity,<br />\nrepresenting the Garden of Eden year book for the year Naughty-naught, eager<br />\nto take a group picture of the first lady president of the Dress Reform League,<br />\nand her other and better half. When our ancestors exchanged their bear-skin<br />\nclothing and their cave dwelling for the spike-tailed coat and the modern apartment house they really made a change for the better. But if they got the best of<br />\nthe bargain when they made an, exchange for the group picture, we shudder to<br />\nthink what they gave up when they made the trade.<br /><br />\n(11<br /><br />\nHE Hopkins athletic games to be held at the Fifth regiment Armory on the<br />\n28th of this month, bid fair to be the most important ever held in this cit v.<br />\nBefore everything else they have been arranged with a view of giving the<br />\nspectators an interesting evening's entertainment. Georgetown will be represented<br />\nby Duffy, Holland, and other. crack runners. Pennsylvania will send men. The<br />\nrelay races will be important features. So far all the efforts which have been<br />\nmade to make the meet an example of what good, successful athletes really are<br />\nhave met with unqualified success. The regimental committee having the Armory<br />\nbuilding in charge, have offered courteously to allow short spikes to be used on<br />\nthis one occasion. This is . a highly complimentary concession, and one which<br />\nis thoroughly appreciated by Hopkins men. II makes possible the presence of<br />\nseveral famous runners who otherwise would not compete.<br />\nAccording to the entry blanks, the handicaps have been restricted to reasonable distances by the games committee, thus insuring to the scratch man a<br />\nchance of making his presence felt. Another feature will be the special scratch<br />\nevents. These are far more satisfactory than the usual handicap 'races, and will<br />\ngive an twortunity of judging of the real ability of the several contestants.<br /><br />\nt<br /><br />\nTHE NEWS 141,, TTE,R.<br />\n(V E desire to call the attention of the members of the Junior and Freshman<br />\nclasses to the vacancies on the Nms 1,01'104. 2\\t the present time the<br />\ntwo positions of assistant news-editors are open, and when the Seniors<br />\ncease their connection With the paper at Easter, there will be several more vacancies which must be filled. The advantages accruing from 1\\11.:ws-LETTER work<br />\nhave been mentioned so often that repetition is unnecessary. Every student, who<br />\nhas any ability in writing, whether he expects to make journalism his future work<br />\nor not, should try for the vacant editorships. The amount of work and time required from the editors is more than compensated by the practical benefits received.<br />\nFreshmen especially are urged to exert themselves. The class of .1905 has shown<br />\nitself competent to take its part in other branches of Liniversity work. Certainly<br />\nthere are some Freshmen who have the ambition and ability to uphold their class<br />\nin this department. They have been students at the University long enough to<br />\nknow what sort of contributions are solicited by the Ni.:ws 141.:rri.:R. Generally<br />\nat this time of the year, one or more members of the lowest class has been appointed to the staff. Up to the present time there has been little material evidence<br />\nshown of ally desire on the part of the Freshmen in general to secure the<br />\nappointments. The appointments are made solely on merit, and all contributions<br />\nhanded in will be taken into consideration in making- them, whether the contributions are printed or not.<br /><br />\nHULLABALOO CLUB FEED.<br />\nHE wish of the poet, \"Make me a child again just for to-night,\" was amply<br />\nfulfilled when the Hullabaloo Club gave a \"Feed\" in the Trophy Room<br />\nlast Monday night. The list of impromptu stunts was a long one, and was<br />\nenjoyed to the utmost by the spectators, if not by the participants themselves.<br />\nThe feature of the evening was a race between Mr. Strayer and Mr. Amitien,<br />\nwhich resulted in Mr. Strayer being victorious, .as Mr. Ammen never quite 'finished the lap. Mr. Strayer was so wrought up over his victory, or else lost his<br />\nhead, that he ran an extra lap for good measure, paced by Mr. Plaggemeyer. He<br />\nwas so overcome by these exertions that for the remainder of the evening he did<br />\nnothing but blow and puff.<br />\nA tug of war was another startling swent. On one side was ranged all the<br />\nbrains of the class, and on the other side was all the brawn and muscle. Tt is needless to say that the brawn and muscle came out the winner. :lint the defeated part<br />\nof the class will have their revenge on Saturday night.<br />\nThe evening closed with a game known in the vernacular as ''cuckoo bases.\"<br />\nMr. Plaggemeyer obligingly consented to be \"it.\" His first prize was Mr. Smith,<br />\nwho was unmercifully thumped as he beat a hasty retreat to the base. And so<br />\nit went. Could all outsider have seen that crowd of red-faced, coatless, breathless,<br />\nhappy, shouting, nondescript band of boys, he never would have guessed that the<br />\n\"most potent, teverend and grave seniors\" were taking a night off and thoroughly<br />\nenjoying themselves.<br /><br />\nt<br /><br />\nTHE NK\\•\\ S 1,11\"MR.<br />\n1111111111 111111111111111111111111111111011111<br /><br />\nIIIII<br /><br />\nIf<br /><br />\nII<br /><br />\n11111111111011111 'II<br /><br />\n1 111111<br /><br />\ni f 11 111 I.<br /><br />\n11111,11,1<br /><br />\n11110.41111<br />\nL<br />\nJ<br />\n•<br /><br />\n1 ItII UPI 1 1 111 1011111101111 1 11 1 11111111 1 111111111111101110000110101011111 111 11111111 1 1IUIIlIII 11101 I 11110<br /><br />\n1\"13 f'171<br /><br />\nAt the banquet of the Ilarvard Club of Maryland last week,<br />\nHerbert E.<br />\nGreen, president of the Club, was toast-master. President Ira Remsen responded<br />\nto the toast, \"Johns Hopkins University,\" and Dr. Wm. Osier to the toast, \"The<br />\nJohns Hopkins Medical School.\"<br />\nOn March ”th, Dr. Ira Remsen spoke at the banquet of the Old Town Merchants and Manufacturers Association, in answer to the toast, \"Education; the<br />\nHandmaid of Commerce.\"<br />\nPresident Ira Remsen will speak at the inaugural celebration at Jacob Tome<br />\nInstitute on May 15th.<br />\nDr. Henry Wood last week addressed the members of the Lend-a-Hand Club<br />\non \"The Literary Animal Story in its Relation to Folk-lore.\"<br />\nDr. Simon Newcomb has been appointed President of the World's Congress<br />\nof Science and Arts, which is to be a feature of the St. Louis World's Fair.<br />\nAs a mark of respect to the memory of Prof. Gaston Paris, the regular exercises of the journal Club last week were postponed. In their place Prof. Elliot<br />\ngave some personal reminiscences of Paris, as a scholar, teacher, and man. Dr.<br />\nE, A. Armstrong made comments on a few of his representative works.<br />\n\"A Financial History of the -United States,\" just published by Dr. Davis<br />\nRich Pewey, of the Mass. Institute of Technology, contains this dedication:<br /><br />\n\"To the seminary of the department of History, Politics, and Economics of<br />\nthe .lohns 11opkins University, of which the author was a member from 1883 to<br />\n.rameson we read and learned.<br />\n1886. Under the guidance of Adams, Ely and .<br />\nThe first has gone, leaving affectionate memories and organized activity of permanent usefulness; the others are still doing their work in a spirit of broad-minded<br />\nsympathy and true friendship.\"<br />\nProf. Thomas A. Jenkins, of Swarthmore, who received his Ph. D., from<br />\nthe University 1891, has been appointed Romance Editor of \"Modern Philology,\"<br />\nthe new quarterly journal devoted to research in Modern Languages and Literature, which the University of Chicago will publish, beginning next July. Of the<br />\nseven men who will constitute the advisory board of the publication, four are<br />\nHopkins doctors, as follows: Dr. James W. Bright ; •Hans C. von Jageman, Ph.<br />\nD., '8-1, Professor of Germanic Philology, Harvard; F. \\I. Warren, Ph. D., '87,<br />\nLecturer in French Literature, Yale; and john E. Matzke, Ph. D., '88, Professor<br />\nof Romanic Languages, Leland Stan ford.<br /><br />\nTHE NEWS LETTER.<br />\nl'resident Remsen was the guest of honor at the johns Hopkins Western<br />\nPennsylvania Alumni Association's banquet, held in Pittsburg, on Monday night.<br />\nProfessor Geo. Petrie, of the Alabama Polytechnic Institute, delivered a<br />\nlecture on the \"Life and Services of Wm. L. Yancy,\" before the historical<br />\nstudents, on the morning of the 18th.<br />\nDr. Kirby Flower Smith will deliver an illustrated lecture on \"Pompeii,\" in<br />\nMcCoy Hall, on Monday evening, March 30th.<br />\nProfessor Leopold iViabilleau, Corresponding Member of the Institute of<br />\nFrance and Director of the \"Musee Social de Paris,\" will give (in Prench) two<br />\nlectures on topics of general interest, followed by six lectures on \"Les Nees Sociale thus la France Contemporaine.\"<br />\nThe dates and topics of the lectures which will be given in Levering Hall, are :<br />\n,Saturday; March 21. ',Institut de France et les Academies.<br />\nTuesday, March 24. Relations entre les Etats-Unis et la France.<br />\n.Thursday, March 26. L'Education sociale<br />\nPeuple.<br />\nSaturday, March 28. La Legislation ouvriere depuis .1870.<br />\nTuesday, March 31. I,es Assurances sociales.<br />\nThursday, April 2.<br />\nLa Mutualite.<br />\nPriday, April 3.<br />\nLa Theorie de la Solidarite sociale par M.. Leon Bourgeois.<br />\nSaturday, April 4.<br />\nLa Propriete individuelle, l'Heritage, et l'Impot.<br />\nThis course has been provided by Elgin R. L. Gould, Ph. D., '86, City Chamberlain of New York, who, it will be remembered, delivered the address at the<br />\n1 )02 commencement exercises.<br />\nMarch 25th, having, by resolution of the State Board of Education, been set<br />\napart as \"Maryland Day\" in the public schools, a lecture on \"The First Settlement<br />\nof Maryland and the Establishment of the Capital at St. Mary's,\" will be given<br />\non that day, before the Johns Hopkins University, by Dr. Bernard C. Steiner,<br />\nAssociate in -History, in McCoy Hall, at 5 P. M.<br />\nDr. Talcott Williams, editor of the Philadelphia Press, will deliver an address<br />\nbefore the johns Hopkins Club tomorrow night, on \"Sundry Syntheses in Art.\"<br /><br />\nCareless papa one day left<br />\nA gimlet out of place,<br />\nAnd Sammy drove it, just for fun,<br />\nThrough little sister's face.<br />\nOi<br />\nl'<br />\n111..<br /><br />\n7<br /><br />\n\"Sam's such a nuisance,\" cried his ma,<br />\n\"just see the mess before us.\"<br />\nBut father calmly said: \"My dear,<br />\nJohn doesn't often bore us.\"—Widow.<br /><br />\nTi IF. NEWS LETTER.<br /><br />\nTHE HOPKINS ARMORY GAMES.<br />\n1,1, the interest of the track and field team is now centered in the Hopkins<br /><br />\n(<br /><br />\nindoor games to be held in the Fifth Regiment Armory on March 28th.<br />\nThe committee in charge promises that it will be the largest event of the<br />\nk ind ever held in t his city, and it is expected that the big men from all institutions<br />\nin this section will compete. In addition to the usual events scheduled, exhibitions are expected to be given by Arthur F. Dtiffy of Georgetown, who holds the<br />\nworld's record for 100 yards, of 9 :3-5 seconds, and by Ray C. Emory, who holds<br />\nthe world's record for the standing high jump. Special efforts will be made to<br />\nkeep the floor clear, and to have everything so arranged beforehand that there will<br />\nhe no unnecessary and tedious delays in running off the several events. It is<br />\nhoped to make a special feature of the Relay Races by arranging them between the<br />\nfollowing teams:<br />\nJohns Hopkins and the Naval Academy;<br />\nGeorgetown and Pennsylvania;<br />\nMaryland Athletic Club and Baltimore Athletic Club;<br />\nSt. John's and Western Maryland;<br />\nCentral and West Branch Y. M. C. A.;<br />\nSt. Leo's Gymnasium and Olympia Athletic Club, of Washington ;<br />\n-Washington Y. M. C. A. and Georgetown I,aw School ;<br />\nBoys' Latin School and Baltimore City College ;<br />\nDeichmann's and Marston's;<br />\nSchool, and<br />\nEmerson's institute of Washington, Georgetown Preparatory<br />\nPenn Charter of Philadelphia.<br />\nBaltimore Country School and M ilton Academy.<br />\nby<br />\nArrangements are also being made for a \"midget- race, to be contested<br />\nMarston's<br />\nry, and<br />\nthe younger chaps from the Boys' Latin, Deichmann's Preparato<br />\nl'itiversity School.<br />\nhandicap<br />\nThere will be both scratch and handicap events. The following<br />\nevents have been scheduled:<br />\n35 yard dash ; limited to (1 feet.<br />\n140 yard run ; limited to 20 yards.<br />\n880 yard ,run ; limited to 40 yards.<br />\nOne mile run ; limited to 70 yards.<br />\nRunning high jump ; limited to 6 inches.<br />\nPutting1.6-lb. shot ; limited to 7.feet.<br />\n•<br /><br />\n12<br /><br />\nTHE NEWS LETTER<br /><br />\nThe scratch events are:<br />\n35 yard dash ; open to Maryland Colleges anci Athletic Clubs.<br />\n35 yard (lash ; interscholastic.<br />\n40 yard, high hurdle (3 feet, ( inches).<br />\n440 yard run ; open—interscholastic.<br />\nFollowing is the list of men that Hopkins will enter in the several events :<br />\nEngland, Freese, :Reedwell, Sladen, Helmholz, H. B. Stone, Lawson, Taylor,<br />\nBond, Knight, Pessagno, Blanck, Tootle, Nelson, LeCron, Parker, Eniig. C. L.<br />\nStone, Boyce, Walker, Super, Mattingly, Wroth, Goodenow, and Morse.<br />\nThe games committee, consisting of Manager K. Gordon Dulaney, chairman ; Joseph T. England, Jr., F. C. Blanck, Harry Chism, and Captain Curzon<br />\nloffman, Jr., is making every effort to carry out successfully their plans, which<br />\nwill assure the success of the meet.<br />\nFirst, second and third prizes will be<br />\nawarded in the various events.<br /><br />\nTHE GEORGETOWN GAMES.<br />\nZ H E Georgetown games are now a thing of the past. In every particular .<br />\nthese games were thoroughly satisfactory to all concerned, and too much<br />\ncannot be said to the credit of those who had them in charge, for the masterly manner in which they were run off. The list of entries was unusually large.<br />\nSuch institutions as Pennsylvania, Cornell, Columbia, Harvard', Princeton and<br />\nJohns Hopkins were represented, as well as other schools, athletic clubs and associations, thereby bringing together the fastest men in the business. Consequently<br />\nevery event was hotly contested, and a victory valued accordingly. The showing<br />\nmade by Baltimore men was very creditable. Hopkins, for her part, had her<br />\ngreatest success in the Relay Race with Villa Nova. Clarence Stone, in his first<br />\nappearance on the team, started the good work by a lead of 3 yards at the end<br />\nof his run. Captain Hoffman was passed by his opponent, but finally recovered<br />\nhis loss and finished with 12 yards to the good. Freese in his turn increased this<br />\n. distance, and England ended the race in great style. Besides this race, Freese<br />\nwon a close second in the 50 yard hurdle. Pessagno also showed up well in the<br />\n50 yard dash, finishing second in the semi-finals. The absence of Helmholtz and<br />\nTootle in the dashes was deeply felt. All of our men who went over to see the<br />\ngames felt fully repaid for their trouble, and have no unfavorable criticism to make.<br /><br />\nOUTDOOR LACROSSE.<br />\nOn last Saturday afternoon the lacrosse squad practiced at Druid Hill Park<br />\nfor the first time this season, and since then they have been able to get in several<br />\ndays of good work out of doors. The men showed the need of out-door exercise,<br />\nas they were pretty well done up by the unwonted exertion.<br />\nThe playing was fast, and for that reason could not be kept up for any considerable time. The absence of some of the older men, who could not find it convenient to go out at this stage of the game, was seriously felt. It is expected that in a<br />\nfew (lays all of them will be out, including the men from the medical school.<br /><br />\nTHE NEWS LETTER.<br /><br />\n13<br /><br />\nManager Addison has received a letter from the management of the Universit v of Thronto team accepting the sixth of June as the date of the game between<br />\nthe two teams in this city. The. Toronto men expect to begin their out-door work<br />\nthis week.<br />\nThe February number of the Intercollegiate News contains excellent portraits<br />\nof i\\ Ii-. Ronald T. Abercrombie, president of the Athletic Association, and official<br />\ncoach of the Lacrosse Team, and M r. Henry P. Straus, captain of the Lacrosse<br />\nTeam.<br />\nOur first game is scheduled for the fourth of April, with the University of<br />\nPennsylvania, but as yet nothing has been heard from the Penn. management.<br />\nSome trouble has been encountered in securing grounds for the Baltimore<br />\ngames. American League Park is the best place for the, games, but inasmuch as<br />\nthe Eastern League schedule has not been arranged, it is impossible to secure the<br />\ngrounds definitely for the lacrosse dates, as the two schedules may conflict.<br /><br />\nAMONG THE COLLEGES.'<br />\nThere are 22r, candidates for the Yale track team at present.<br />\nA bill appropriating $50.1,500 to the University of Minnesota has been introduced in the Senate of that state.<br />\nThere are.twenty Japanese students attending Stanford University.<br />\nThree companies for military drill have been formed by members of the junior<br />\nand senior classes of Yale.<br />\nOver 2,000 degrees have been conferred on women by the University of<br />\nichig-an during the last 30 years, of which 150 were graduate and two honorary<br />\ndegrees.<br />\nThe entire senior class of the Yale Forestry School recently spent a month in<br />\nvarious lumber camps, collecting material for their theses.<br />\nIt is reported that the German universities are not very enthusiastic over the<br />\nCecil Rhodes scholarships, and that they will probably not send any students to<br />\n•<br />\nOxford.<br />\nUniversity of Chicago<br />\nthe<br />\nof<br />\nThis is one of the rules which the Sophomores<br />\nalways bow three<br />\nSophomore,<br />\na<br />\nhave placed upon the Freshmen: \"In addressing<br />\ntimes, raising the left hind foot at the same time.\"<br />\nThe \"Inter-collegiate News\" says:— \"The annual report of President Eliot<br />\nof Harvard University contains for the first time a reference to athletics at<br />\nHarvard.<br />\n\"President Eliot calls attention to the interesting fact that at least 2,000 of<br />\nthe 3,500 students in the Cambridge department of the university take part in<br />\nsome outdoor sport. He notes that changes in football rules have been followed<br />\nby an increase rather than a decrease in injuries, and says that 'Under the existing- rules the game tends to become slower and less visible in its details, and<br />\ntherefore less interesting. Moreover, the ethics of the game, which are the imperfect ethics of war, do not improve. The martial axiom—attack the enemy's weakest point—inevitably leads to the deliberate onslaught on the cripple or the convalescent in the opposing line ; and the habitual violation of rules, if peimlties be<br />\nescaped, is regarded by many as merely amusing.'\"<br />\n•<br /><br />\nNEWS LETTER..<br />\nAMOR<br />\n(N1'RIBum„ J. u. u.)<br />\nTired, are you? Well, my dearie,<br />\nSuch is life; we all are weary<br />\nSometimes. Come and cuddle closer,<br />\nPut your head upon my shoulder,—<br />\nGolden head that twice five summers<br />\nScarce have shed their suns upon.<br />\nLove you? Look into the fire,<br />\nSee that flame, that ever higher<br />\nSeems to leap than all its brothers,<br />\nNo beginning has, nor ending;<br />\nThere you see my love for you, boy,<br />\nComes from nowhere, nowhere goes to;<br />\nEver living, all embracing.<br />\nLower downward look; see lacing<br />\nIn and out the burning embers<br />\nDarts a breath, a pale blue phantom,<br />\nMakes each glowing coal grow brighter,<br />\nNow bedulls their flaming throbbing;<br />\nThus you play upon my soul, boy,<br />\nMake it gleam, then dim its radiance,<br />\nLifting me to heights sublimest,<br />\nPlunging me in deep despair.<br />\nThere were loves before your coming?<br />\nCalled them loves, but now I see that<br />\nThey were just the first few letters<br />\nOf the alphabet of loving.<br />\nNow, my boy, Love's volume open<br />\nLies before me, and there spelling<br />\nOut each word, with you, my teacher,<br />\nEvery day new pleasures showing<br />\nIn the reading of Love's lore.<br />\nOdd now, is't not, that a boy like<br />\nYou, can twirl around his finger<br />\nMe, whose years are more than treble<br />\nHis? So, tell me by what power<br />\nYou've compelled me to your service?<br />\nCannot? Listen, I will tell you:<br />\nLook into the mirror yonder;<br />\nSee the hair, than spun gold brighter,<br />\nSee the eyes, with depths of blueness<br />\nStole out of Heaven's ether;<br />\nSee the nose more straight and whiter<br />\nThan the fairest beam of Luna ;<br /><br />\nTHE NEWS LETTER.<br />\nSee the lips so red, that rubies<br />\nE'en do blush a shade more redder<br />\nLest those same red bps should put them<br />\nl'nto shame and spoil their lustre.<br />\nLook again. See, white as ivory,<br />\nGleams a neck and marble bosom<br />\nPure and virgin as the heart that<br />\nThrobs beneath it and the Soul that<br />\nLurks there somewhere. I can tell you<br />\nNothing further. Boy, I love you<br />\nJust because you are yourself.<br />\nYou have crept into my being;<br />\nNestled there as on my shoulder<br />\nNestles now your curly head ; and<br />\nEvery movement, every throbbing-,<br />\nEach pulsation of your heart, wakes<br />\nIn my soul a deep emotion<br />\nE'en the gods could never measure.<br />\nNo, I think there's nothing further<br />\nWhen a soul, completely. merging<br />\nin another soul, there loses<br />\nAll sensation, each emotion,<br />\nSave those by its fellow wakened.<br />\nDrifting over Love's vast. ocean<br />\nPast the shores of pain and pleasure<br />\nPast the islands of regretting,<br />\nNaught exists, save thou and I, Boy ;<br />\nIn eternity, past, future,<br />\nAnd beyond it, all is silence.<br />\nSleepy ? Well, good night then, deari;<br />\nHappy dreams dance through your slumbers.<br />\nks me, so—Good night, my Boy!<br />\nSOME FACTS ABOUT THE ELEVATOR<br />\n1. That it is safer for Freshmen to abstain from the luxury entirely.<br />\n2. That if he be so heavily burdened by his hard lot that his tender limbs<br />\nrefuse to climb the pathway to knowledge, let him recede into the farthest corner<br />\nof the lift, and there, with head uncovered, and eyes fixed meekly on the floor,<br />\nwait until some of his more elevated brethren stop the car.<br />\n3. That it is healthier to climb the stairs than to ride, when the elevator is<br />\nnot going.<br />\n4. That it is useless to press the button of the elevator not in use.<br />\n5. That the man with the black skull cap should not be crowded, he becomes peevish.<br />\n6. That if the elevator contain six or more juniors, no others are admitted.<br /><br />\nTHE NEWS LETTER.<br /><br />\nRoJWSPIERRE.<br /><br />\nWhat do you gain by I )eltiging every street of Paris with Bloo(1?\" declaimed<br />\n1)ripping Danton.<br />\n\"At least I will make a great Alley gory,\" reasoned the Republican glancing<br />\ndown the RH( Royale at the reeking Guillotine.-- (lie Record.<br /><br />\nii 1R (visiting son at college)<br />\n. : \"Pretty good cigars You smoke, my boy;<br />\nI can't afford cigars like these.\"<br />\nSON : \"Fill your case, dad; fill your case.\"--/iampoon.<br /><br />\n\"What is the poet laboring over?\"<br />\n\"Trying to find a word to rhyme with Pabst.\"<br />\n\"Ah, studying lager-rythms, I see.\"—WidoTo.<br /><br />\nA fair dame from Kalamazoo,<br />\n()nce shot a black bear thro, and thro'.<br />\nWhen the brute was quite dead<br />\nShe scalped it and .Ktid<br />\n\"Good gracious! Just look at the goo!\"—lridow.<br /><br />\nThere once was a great dairy Co.<br />\nWhich boasted that it did not p()<br />\nWater into its cream.<br />\nIf an inspector tried to do<br />\nCans in the street, and tro<br />\nCharges, 'twas proved a pipe-dream.—Tiger.<br /><br />\n'OPEN ALL NIGHT.<br /><br />\n1LLIAXSON 3 WATTS,<br />\n41<br />\nZtores-,<br />\nHoward and Franklin Streets.<br />\nTiM4:03. ffroic<br /><br />\n'Baltimore and Eutaw Streets.<br /><br />\n.3ooilt3. VcrtitilicM COilet<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMoRF: FOR<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT ed, Co.,<br />\n704 MADISON AVE.<br /><br />\nrttcLeB,eigatii, SODA LWater.<br /><br />\nI'. 'Phone 3350- V<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\n,%\\athematical and Surveyino Instruments,<br />\nDraughtsmen's and Engineers' Suppiles.._._<br />\nN. W.Corner<br />\nLexington and Liberty Sts.<br /><br />\nliALTIMOlit?., /AD.<br /><br />\nAgent for .K.euffel tr- Eimer Co., of Nes<br /><br />\nt.-4 I<br /><br />\n.<br />\n1010-Your inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nYork.<br /><br />\n.,At<br /><br />\nHenderson's<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks, Note Hooks,<br />\nMadisons<br />\nStudents' Supplies.<br /><br />\n—<br /><br />\ncff Howard Sts.<br /><br />\nIncur torated I s;s<br /><br />\n\"Pkis Steohgt as the Steohttest.\"<br /><br />\n'TI-tE FIDELITY MUTtilit LIFE INSURPieNGE GO.,<br />\nOF 19+1 LFfr.DE L,Pf-H*.<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for<br />\nFroiti,rry, either during vacation or permanently.<br />\nFor Agency In Maryland or WeNt<br /><br />\nTHE<br /><br />\n:141drems,<br />\n4'. GRAHAM, Manager<br />\nMOO M Merchants Bank Bldg., Baltimore, 110<br /><br />\nFor Advertising Space in this Paper<br />\nA PP1,1\"r0<br /><br />\n7.,<br /><br />\n1.01411Aft<br /><br />\n'HALI<br /><br />\n$11..D<br /><br />\nPUBLISHERS.<br /><br />\nCoplial$300,000. Surplusg6UnglultletlProllis$400,000<br /><br />\nSTIEFF PIANOS<br />\nMADE (DP\"IPHIC REST MATERIALS AIONEY<br />\n7,1tIl..:NCE CAN<br />\n11 ,X1.1,<br />\nAND ,<br /><br />\nW A It RRIMMMI<br /><br />\nOf BALTIMORE.<br /><br />\n9 N. 141 1 it:leT1<br /><br />\nST.<br /><br />\nrs and<br />\nB0ok<br />\none s.<br />\ntatir<br />\n84 W. BUTIMORE STREET.<br /><br />\nGUSHING &amp;GOMPRNY<br /><br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br /><br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\n#<br />\n#<br />\nCollege of Balt i more.<br />\nSTATIONBRY—for School, Pamily, Office and Bank.<br />\n— -<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nIIIMMIIMIIIIIMNIMMINNUMI Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\nOn Sale The J. H. U. Pennants,and all other College<br /><br />\nTHOS.BLAKE CO<br />\nPennants.<br /><br />\n219 EAST BALTIMORE ST.<br />\nMANUFACTURER<br /><br />\nST. PAUL<br /><br />\nBALTIMORE,<br /><br />\nilMease Call an<br /><br />\nA General Banking Business Transacted.<br /><br />\nSafe Deposit Boxes for Rent<br />\nfrom VI p, r year and upward.<br /><br />\nfIGGOtHilS 8o1lcited.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LEHMAN &amp; SON.<br />\nFOR<br /><br />\nGO. m<br />\n8TRBIDER<br />\nJORDAN<br />\nSamples<br />\nReads as follows:<br /><br />\n5V FL<br />\nAU:Sr/N.704%<br />\nsubmitted of<br />\ntine<br />\nquality.<br />\ncoloring,<br />\nno<br />\nadulterants,<br />\nFrench Brandy—no<br /><br />\nOporto Port -absoluteiy pure, of superior quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—lie Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong,<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH<br /><br />\nSTORE AT ROLAND PARK,<br /><br />\nSuccessor to Cummins.<br /><br />\nOF<br /><br />\nereell letter tratermtp jewelrp,<br />\n14 AND 16<br /><br />\nL. titrouse, Vice.-Prest.<br />\nEdw. P. Hayden, Ass't Cashier.<br /><br />\nJas. Clark, Prest<br />\nChas. S. Miller, Cashier.<br /><br />\nIlgenfritz Studio<br /><br />\nH. FETTING,<br /><br />\nA<br /><br />\nDrovers &amp; Meclianles Nat'l Bank,<br /><br />\n11LTY.<br /><br />\nSTREET,<br /><br />\nMD.<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br /><br />\nExamtne our line iSetore iPurebasind.<br />\nC. &amp; 11). telephone 443r,<br /><br />\nJENNINC;ti 4.V 1.1012S14:1Y.<br />\nMEHCIIIANP TAILORS,<br /><br />\n21 W. PAY man,<br /><br />\nsTit NET.<br /><br />\nLibraries arranged and put in<br />\norder without removal. fr<br /><br />\n&amp;to RUZICKA<br />\nBookbinder,<br /><br />\n-°4-:<br /><br />\nBOOKS!!!<br />\nSECOND=ITAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nExchanged.<br />\nBought, Sold and<br /><br />\nPIPPEN'S BOOK STORE,<br />\n605 N. EUTFIAV ST.<br /><br />\nNear the University.<br />\nBaltinion•',I<br /><br />\nrgest Old<br /><br />\nBook Store.<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO. WARNER.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats,<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\n71 S<br />\nSilk and Caasimere Hats. Ww<br /><br />\nil= opk<br /><br />\nCaps<br /><br />\nNORTH GERMAN LLOYD S. S. GO.<br />\nGAM PASSAGE AT LOW RATES.<br /><br />\nMew York to Bremen, London, Paris, Gibraltar, Naples,<br />\nBf1LT1MO1 TO BREMEN DIRECT.<br /><br />\nCSE110d,<br /><br />\netc.<br /><br />\nSGflUMRGRER &amp; GO., General<br /><br />\nPor particulars apply to<br /><br />\nTHE<br /><br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS'. SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\nAgents.<br /><br />\n.JAS. MEIKLE, VICE.PREST.<br />\nJAS. R. RICHARDS, TREAS.<br /><br />\nISAAC H. DIXON, PREST.<br /><br />\nBaltimore, Md.<br /><br />\nSmith, Dixon Co.<br />\n..Paper..<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36264, "display": null, "description": null, "target_type": "file", "target_uuid": "107e85d5-6d42-449f-b715-30780dca057e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12238-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12238, "target_type": "node", "target_uuid": "380653aa-b4b3-4efd-9d7d-1286fc7f6221", "url": "/node/12238"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "fbd99d7b-af27-42f4-acf5-1276f756f5f2"}]}