{"mid": [{"value": 37019}], "uuid": [{"value": "48b9e9c9-fa5c-4231-be73-a52cd1c5469b"}], "vid": [{"value": 37019}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:58:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13143-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:58:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:58:05+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXIX, No 13<br />\n<br />\n1<br />\n<br />\nHOMEWOOD, BALTIMORE. MD., NOVEMBER 14, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPIUNS PRESS PUBLISHES CLUB REPIIESI NIS<br />\nJUNE<br />\nWEEK COMMITTEE SENIOR CLASS NOMINATES DREXEL MEETS HOPKINS AT<br />\nTHREE NEW BOOKS. DR.<br />\nADOPTS<br />\nNOVEL PLAN<br />\nFOR STUDENT COUNCIL<br />\nHOMEWOOD FIELD<br />\nTHIRTY COUNTRIES<br />\nMUSTARD IS EDITOR<br />\nFOR RAISING FUNDS<br />\nTOMORROW<br />\nThirty different countries and<br />\nVolumes Are of Interest to EducationBooks of Tickets to June Week to Be<br />\nNominations to fill the vacancy Philly Team Long Shot in Tomorrow's<br />\nal World. Another in<br />\nall four races are represented in<br />\nSold and Lottery Held at the<br />\nMay Forsake Placeon<br />\nthe student council caused by Game; Turnbull<br />\nPreparation<br />\nFirst Cotillon<br />\nments for Dropkicks<br />\nthe Cosmopolitan Club. Besides<br />\nThree books have recently been<br />\nWith the idea of making the Calhoun's election to the presiComing into the last stretch of<br />\nAmericans and Englishmen there<br />\ndency of the senior class, were a<br />\nPublished, by The Johns Hopkins<br />\nsuccessful gridiron season the<br />\n1925 June Week a Hopkins affair<br />\nare 88 men from other countries.<br />\nmade at a meeting .of that class Blue<br />\nPress. They are: \"The Eclogues<br />\nJays will strive to increase<br />\nfor all Hopkins students the Exheld on Monday, November 10. their<br />\nmagin of points over their<br />\nof Antonio Geraldinig,\" edited by China's delegation of 22 heads the ecutive Committee is rapidly forlist. Russia has 8, Japan 7, Philip- mulating plans whereby a substan- The two nominees are Gordon opponents at the expense of the<br />\nWilfred P. Mustard, Ph. D., D.<br />\nPost and John Fringer. The elecDrexel Institute at Homewood topine Islands 6, Porto Rico 5, tial revenue will be received and<br />\nLitt.; \"A Working Manual of<br />\ntion will be held at the next meetmorrow. Coach Van Orman is<br />\nthe<br />\nWeek<br />\nJune<br />\ntickets<br />\nbe<br />\nrecan<br />\nEcuador 4, Bulgaria 4, Siam 3,<br />\ning of the class, Wednesday, NoOriginal Sources in American<br />\nduced<br />\ncomparatively<br />\nnominal<br />\nto<br />\nthat<br />\na<br />\nit<br />\ncost<br />\nso<br />\nsure of victory in<br />\nHungary 3, and Denmark, Canavember 19.<br />\nGovernment,\" by Milton Conospite<br />\nof<br />\nbe<br />\npossible<br />\nwill<br />\nevery<br />\nDrexel's<br />\nfor<br />\nstudent<br />\nbeing almost an<br />\nda, Rumania, Palestine, British<br />\nThis meeting was marked by a unknown quantity.<br />\nver; \"The Permanence of the Vopurchase<br />\none.<br />\nprevious<br />\nto<br />\nIn<br />\nThe only .<br />\nWest Indies, Switzerland and<br />\nvery small attendance. President known indication of<br />\ncational Interests of Junior High<br />\nDrexel's<br />\nCosta Rica 2 representatives each. years June Week has seemed to<br />\nCalhoun urged that every mem- strength is their 13 $o 6<br />\nSchool Pupils,\" by Edward Earle<br />\ndefeat<br />\nCuba, Germany, Hawaii, Brazil, be more of a Senior Week than<br />\nber he present at the meeting over Loyola last week.<br />\nFranklin. A book that is now in Armenia,<br />\nLoyola,<br />\nCzecho-Slovakia, Hol- one for Seniors and underclassthe process of publication is \"The<br />\nWednesday as there is very im- however, was<br />\nstrengthened one<br />\nland, Jugo-Slavia, Nicaragua, Ko- men, primarily because it was supportant<br />\nbusiness to be discussed. hundred per cent by the<br />\nRoman Toga,\" by Lillian M. Wilported<br />\nchiefly<br />\nby<br />\nSeniors.<br />\nAlpresence<br />\nrea, Poland and Bolivia are repson, Ph. D.<br />\nthough the 1925 June Week is tinof \"Polly\" Byrne, their star fullresented by one man each.<br />\nDr. Mustard's new book is the<br />\nder the direction of the Senior BLUE JAY CIRCULATION back, who was prevented from<br />\nlatest of the series of Eclogues<br />\nClass it is the idea of the Class of CONTEST ANNOUNCED BY playing against Hopkins because<br />\nby different authors which he is CHICAGO ALUMNI ORGAN- 1925 to make June Week this year<br />\nof an injured leg.<br />\nPHILIP SACHS<br />\nIZE AT MEETING ON<br />\nediting. The Introduction and<br />\nand in future years a week of fesBlue Jays Favorites<br />\nOCTOBER 28<br />\nNotes to \"The Eclogues of Antivity for the entire University,<br />\nIn spite of any certainty of the<br />\ntonio Geraldini\" will be found<br />\nFaculty, Seniors, Juniors, and un- Plan to Award Prizes to Students Se- outcome of the game the Blue Jay<br />\nGraduates Attend First<br />\nvery valuable to the reader. They Thirty-five<br />\ncuring Most Subscriptions for Jay.<br />\nderclassmen.<br />\nline-up will remain intact, at least<br />\nGathering Since 'March, 1921; Dr.<br />\nLife-time Subscriptions One Prize<br />\nare exceptionally clear and conEdmunds Gives Lecture<br />\nThe Executive Committee beto start the contest. The only<br />\ncise.<br />\nThe Johns Hopkins Alumni lieves that the one way to realize<br />\nIn order to increase the circula- change will be caused by LeibenThe problem book by Mr. Con- Association of Chicago at a recent this hope is by making the price tion of the Black and Blue Jay, the spergefs injured leg which will<br />\nover has been used in part as meeting selected officers<br />\nfor the of a June Week ticket sufficiently Board of Control has decided to result in Milanausky's starting at<br />\nhold a subscription contest to close guard.<br />\nmimeographed material for four<br />\ncoming year. Dr. Ernest A. Smith, low so as to be within the purDecember<br />\n23. Every student, with<br />\nyears at the University of Pennchasing power of every student.<br />\nThe work of the past week in<br />\nsylvania, and for two years at now Superintendent of Schools in Without, in the least, lowering the exception of those on the Board practice has consisted of light<br />\nNew York University. It is de- Evanston, was chosen president; the character of program for June of Control of the Jay is eligible to scrimmages and dummy practice.<br />\nscribed as \"a project working Dr. Solomon Strouse was elected Week, this aim will be accom- compete. Worth-while prizes are It is the plan of the coach to work<br />\nmanual which aims primarily to vice-president, and William L. plished by introducing certain being awarded according to the up slowly to more and more secorrelate government documents Ross, secretary-treasurer.<br />\nraising<br />\nmethods<br />\nof<br />\nmoney number of subscriptions obtained. vere practices previous to the<br />\nWith textbooks as an introduction • Dr. Charles K. Edmunds, Pro- throughout the year. Also, a<br />\nMen who are not members of Maryland game. This is the real<br />\nto the whole field of American vost of the University, who has ready working capital which will the Blue Jay staff will increase goal of the<br />\nyear and Van Orman<br />\nPolitics; which cultivate a citi- been making an extensive visit to be raised in this way vill enable their chances of making it if they wishes to make it a fitting climax<br />\nzen's interest in the realities of the various Alumni Associations the June Week Committee to pro- do well in this contest. Those who to a successful season.<br />\nPolitical science; and which uti- throughout the country, addressed ceed with their plans without -fear are already members of the staff<br />\nTurnbull Dropkicking<br />\nlizes the adolescent instincts for the meeting. His subject was of a deficit at the close of the will receive credit towards the silWhen \"Buck\" Bonner graduver cup to be presented to the mar. ated last year Turnbull dropped<br />\ncreative activity as rapidly as they \"Progress and Plans of the Uni- week.<br />\nbecome stimulated by lectures and versity.\"<br />\nThe first of these campaigns doing the best work for the busi- from one of the most consistent<br />\nThirty-five members attended for raising funds will open on ness staff during the year. This place-kickers in the country to<br />\nreadings.\"<br />\nThe work of Mr. Franklin is the meeting, the first to be held Monday, November 17. On this cup, it will be remembered, will be one of only mediocre calibre. Last<br />\nthe eighth of The jChns Hopkins since March,. 1921, 30 per cent of day each student will find in his awarded at the annual banquet next season when Hopkins<br />\ntied MaryUniversity Studies in Education, those present being medical men. Post Office box a book containing spring when elections are held for land the credit of the two field<br />\nedited by Profesor Edward F. On a vote of the men attending, ten tickets each, each ticket bear- the coming year.<br />\ngoals went to Turnbull but in<br />\nBuckner. The last volume is \"a the name was changed from the ing a number. The method conIn addition to the specific prizes, reality it was Bonner who caught<br />\nstudy of the intelligence and in- Northwestern Alumni Associa- sists of each student purchasing listed below, a special prize yet to the ball and snapped it into perterests of fifteen hundred pupils. tion to the Johns Hopkins Alumni from himself two of these tickets be decided will be given to the man fect position for \"Doug's\" toe.<br />\nPractical suggestions, based upon Association.<br />\neach week. The price of each securing the highest number of sub- Turnbull, however, through hard<br />\nthe findings of this study, for efThose who attended the meet- ticket is fifteen cents, thus making scriptions altogether. The subscrip- and regular practice has develfective vocational guidance in the ing were: Dr. H. B. Bettman, Dr. a book valued at $1.50. In the tion price is $1.25 for seven issues. oped into an excellent dropkicker.<br />\nWilliam Bloom, Dr. Samuel event that a student is unable to Blanks may be obtained from Proof of this can be seen in the<br />\nJunior high school are offered.\"<br />\nWhen the book by Dr. Wilson Brook, J. C. Collier of Dubuque, buy his allotted portion of tickets, Sachs, circulation manager, in the fact that while Turnbull has bootis published, it will present a con- Iowa, Dr. Henry Crew, Dr. W. C. he is supposed to sell them to Blue Jay office any day at noon. ed only one-third of his tries for<br />\nnected history of the Roman toga. Burkett, Frank Emerich, Dr. R. someone else. At the time of sale,<br />\nRules for the contest are as fol- place-kicks between the bars he<br />\nContinued on page 2 col. 5<br />\nthe purchaser is to sign his ticket. lows:<br />\nContinued on page 4 col. 3<br />\nhas failed to miss a single attempt<br />\nThis campaign will continue for<br />\nat<br />\na drop-kick so far this season.<br />\n1. Any Johns Hopkins student,<br />\nnamely<br />\nweeks,<br />\nuntil<br />\nDecemfive<br />\nIn<br />\nthe George Washington game<br />\nexcept the Board of Control of the<br />\nJOHNS HOPKINS FOOTBALL STARS WILL<br />\nthe<br />\nwhen<br />\nbooks<br />\nber<br />\nthe<br />\n10,<br />\nwith<br />\nTurnbull<br />\nmissed a 25-yard placeBlack and Blue Jay, is eligible.<br />\nPLAY IN CLEVELAND GRIDIRON cLASSIC<br />\nnumbered stubs and the money<br />\n2. Subscriptions are $1.25 for ment goal, then made a 35-yard<br />\ndrop-kick that culled the three<br />\nCaptain Thomas Magill and thusiasm has been aroused concern- acquired from their sale will be seven issues.<br />\npoints<br />\nDouglas Turnbull have been select- ing the game. The Western squad, turned over to W. Carville Gardnecessary to stave off de3. Contest closes December 23.<br />\ned to make a trip to Cleveland to which has been nearly selected, com- ner, chairman of the June Week<br />\nfeat. Turnbull will probably use<br />\n4. Secure subscription blanks<br />\nPlay in an intersectional football prises representatives from twenty- Committee. At the first Hopkins<br />\nfrom Philip Sachs at the Black and drop-kicks for the rest of the seagame the early part of next month, two colleges. All the players will Cotillon, to be held on Friday,<br />\nBlue Jay office any day from 12.20 son in spite of his three year's<br />\nDecember 12, the numbers will be<br />\nsuccess at placements.<br />\naccording to information given out be amateurs.<br />\nto 1.<br />\nMaryland Game Nears<br />\nby the athletic office. A request In order to procure a team equal placed in a large container in the<br />\n5. The following prizes will be<br />\nAs the Maryland game looms<br />\nfor two Hopkins varsity to play to that of the Westerners, Cleveland ballroom, stirred up well and<br />\nawarded:<br />\nlip on the horizon before the Blue<br />\nm Cleveland was received by Coach alumni of Eastern universities have three tickets will be drawn. Prizes<br />\na. For securing 5 subscriptions, Jays a slight ray of<br />\nVan Orman, Tuesday. There has telegraphed the coaches of the lead- will be awarded to the winners in<br />\nbrightness is<br />\nbeen a growing desire in Cleveland ing teams of the East, request*.ng the order in which the numbers a student will be given 5 additional afforded by the crushing 47-0<br />\nsubscriptions.<br />\ndefeat which Yale handed the Old<br />\nto build a municipal stadium, one them to send two or three varsity are drawn. The first prize will<br />\nFor<br />\nsecuring<br />\nb.<br />\n10<br />\nsubor<br />\nmore<br />\nlike Baltimore's, if possible. In or- players to participate, with the one consist in a due bill valued at $50<br />\nLiners at New Haven last Saturder to raise funds for the under- stipulation that they must be grad- exchangeable for any article of scriptions, a student will be given day. The Bulldogs added insult<br />\ntaking, an intersectional football uates in 1925. The players' expenses merchandise sold by the various a like subscription to the Blue Jay. to injury by using only three first<br />\ngame has been arranged for De- will be paid by the Cleveland com- firms represented by the Turnc. For securing 15 or more sub- string men in tire game until the<br />\ncember 6th between two all-star mittee.<br />\nbull-Magill Store at the Barn, scriptions, a student will receive final minutes when they rushed in<br />\nteams from Eastern and Western<br />\nnamely, Van & Co., Hess, Katz, both 5 additional subscriptions and most of their regulars to roll up<br />\n21 points in the last quarter.<br />\nuniversities. Cleveland authorities<br />\nThe Hub, Spaulding and Warner. a life-time subscription.<br />\nNOTICE<br />\nhave been making the arrangements<br />\nThe loss of Groves and Mcd. A prize yet to be determined<br />\nThe second prize will be a due bill<br />\nThere will be an organization<br />\nand have worked hard to make the<br />\nmeeting of the French CInb Frivalued at $15 and the third prize will be awarded to the student who Quade has so weakened the Maryday at one o'clock in Room 112,<br />\naffair a success.<br />\nwill be one worth $10. These obtains the highest number of sub- land backfield that Curly Bird has<br />\nGilman Hall.<br />\nIn the West, a great deal of enscriptions.<br />\nContinued on page 4, col. I<br />\nContinued on page 4, col. 1.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LEI-1ER, NOVEMBER 14, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communication,s<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nAUGER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\n<br />\nHomewood 0100<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\n<br />\nTERCOLLEGIATE<br />\nCLIPPINGS<br />\nN. Y.<br />\nSophomores presented<br />\na paradoxical welcome to the<br />\nFreshman class on the last day of<br />\nOctober. After the annual \"ducking party\" the Sophs suspended<br />\nhazing and entertained the first<br />\nyear men at a smoker.<br />\n*<br />\nPenn State has a veteran rooter<br />\nwho has followed the fortunes of<br />\nthe Nittany Lions for 40 years.<br />\nHe is Andy Lytle, over 80 years<br />\nold, who until three years ago<br />\nhadn't missed a Penn State game,<br />\nat home or away, since the first<br />\nState team journeyed to Lewisburg to play Bucknell in 1881.<br />\nFor the past three years Andy<br />\nLytle has been too weak to travel<br />\nbut has witnessed every home<br />\ngame.<br />\n*<br />\n<br />\nThe Ring-tum Phi of W. and<br />\nL. states that Harvard and OxCirculation Manager<br />\nAssociate Editors<br />\nford will meet in the first internaBENJAMIN T. ROME, '25<br />\nOTHO J. KELLER, III, '26<br />\ntional and intercollegiate chess<br />\nARTHUR L. NELSON, '26<br />\nmatch to be played by radio durJunior Editors<br />\nAssistant Business Managers<br />\ning the latter part of December.<br />\nEDWARD 0. MICHEL.<br />\n- , '26<br />\nG. DONALD GIESKE, '25<br />\nJAMES YOUNG, '25<br />\nThe W. and L. paper states that<br />\nHENRY R. TURNBULL, '26<br />\nJ. JACKSON KIDD, '26<br />\nAmerican colleges have in the<br />\nA. RISLEY ENSOR, '26<br />\nT. STRAN SUMMERS, '25<br />\nJ. HENRY JARRETT, '27<br />\npast<br />\nhad several matches by radio,<br />\nHEYWARD E. BOYCE, JR., '27<br />\nCHARLES F. REESE, '27<br />\n'26<br />\nSAUERWEIN,<br />\nbut<br />\nthis<br />\nis the first time an AngloT.<br />\nROBERT<br />\nW. BARNES HALL, '27<br />\nARTHUR SWANSON, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br />\nAmerican contest has been arranged.<br />\nHa-verford will follow suit later<br />\nMember Southern Intercollegiate Newspaper Association<br />\nin •the winter when a four man<br />\nteam will compete with Oxford<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. under the same conditions. The<br />\nrelaying is to be done entirely by<br />\namateurs.<br />\n* * *<br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 14, 1924<br />\nHamlin Garland, the well<br />\nknown American author, and Dr.<br />\nGeorge Boas, of the Hopkins PhiCONGRATULATIONS<br />\nlosophy Department, are among<br />\nThe election of the four new men to membership in the °mkt:on the speakers whO have lectured at<br />\nGoucher this fall.<br />\nDelta Kappa Honorary Society is a true reflection of the wisdom<br />\n* * *<br />\nexercised by the fraternity in choosing recognized leaders. Each of<br />\nSix fraternities and eight sorothese men has distinguished himself in one or more of the five heads rities of the University of Nebraswhich make a man eligible for election, namely, social leadership, ka have been blacklisted because<br />\nathletics, scholarship, publications, and non-athletic activities. Each of \"wild\" parties, according to an<br />\nhas rendered conspicuous service to his Alma Mater and in recogni- article in The Beacon, Rhode<br />\ntion of this he has received, according to undergraduate opinion, the Island State College weekly. The<br />\nSenate Committee on Student Orgreatest honor which a Hopkins man can obtain during his college<br />\nganizations blacklisted the 14<br />\ncareer.<br />\nchapters because of \"sneak night\"<br />\nparties in road houses.<br />\nsmall,<br />\nalthough<br />\nthree<br />\nelected<br />\nis<br />\nof<br />\nmen<br />\nnumber<br />\nthe<br />\nThe fact that<br />\nper cent of the undergraduate body are eligible for admission, is significant of the high standard of 0. D. K. This fact in itself should HULLABALOO PHOTOS BEGIN DECEMBER 1<br />\nserve as a stimulus to inspire undergraduates to work harder to<br />\nPhotographs for the 1925 Hulachieve this singular honor.<br />\nlabaloo will be taken beginning<br />\nheartiest<br />\ncongratulations<br />\nto<br />\nextend<br />\nwith the week of December 1.<br />\nThe News-Letter wishes to<br />\nGroup photographs and those of<br />\nthe newly elected members.<br />\nSeniors will be taken at that time,<br />\nfor a period of four days. The<br />\ndate was originally set for next<br />\nweek, but a conflict in the phoThe new 0. 1). K. Songbook contains several son'gs which, however stirring,<br />\ntographers'<br />\nschedule prevents the<br />\nsuggests<br />\nore hardly known to many undergraduates at Hopkins. The News-Letter<br />\nthat these songs be learned as soon as possible so that they may be used at the Hop- Hopkins pictures being taken<br />\nkins-Maryland game on Thanksgiving Day.<br />\nthen. A schedule is posted in the<br />\nBarn of the Seniors and schedules<br />\nof the groups will be posted in the<br />\nBarn and at the Post Office. NoTHIRTEEN DAYS REMAIN<br />\ntices wil also be sent to each man<br />\nLast year on Thanksgiving Day Hopkins showed prejudiced and to each group, notifying them<br />\nBaltimore that a team, light, fast, alert, a product of the Van Orman when their respective pictures are<br />\nmachine, could hold and even outplay a bigger heavier team. Sport to be taken.<br />\nMeetings of the editorial staffs<br />\nwriters prophesied the Black and Blue would have to fight to hold<br />\nare being held every Thursday<br />\ndown the score. Football fans gave Maryland the odds in every<br />\nnoon in the Blue Jay office. Busidepartment of the game. But Hopkins showed 'em, and the Uni- ness staff meetings are being held<br />\nversity of Maryland was fortunate in holding the score 6-6. The every Friday noon in the same<br />\nVarsity eleven, though greatly outweighed, showed the sporting place and there are openings roi<br />\nworld they were not outclassed.<br />\nmembers on this staff.<br />\nFleet-McGinley Company, of<br />\nThe Drexel game tomorrow is the last one before the big clash<br />\nof the season—the Hopkins-Maryland game on Thanksgiving Day. Baltimore, are the printers of the<br />\nOnly thirteen days remain in which to arouse \"pep\" to support the book this year, and not the Sun<br />\nteam on its-journey to the State Championship. It is up to us, in- Printing Company as an article in<br />\n.dividually and collectively, to give all we have to support a Cham- the News-Letter stated a week<br />\nago.<br />\npionship team. What are we going to do about it?<br />\n<br />\nPETERS, REIBLICH, YATES<br />\nSCORE IN INTRAMURAL<br />\nRIFLE MATCH<br />\nSchedule for Year Announced. Hopkins Joins Intercollegiate Ass'n.<br />\n11 Matches Scheduled<br />\n<br />\nFirst, second and third prizes<br />\nfor the winners of the first intramural match of the season held by<br />\nthe Rifle Club last Friday went to<br />\nB. G. Peters, G. K. Reiblich, and<br />\nJ. M. Yates, respectively. There<br />\nwas plenty of competition for these<br />\nsharpshooters, for over 60 men<br />\nturned out for the match. Lieutenant Sherwood stated enthusiastically that the shooting was exceptionally good. Peters and Reiblich<br />\nscored 185, whereas Yates was<br />\nright on their heels with a score of<br />\n183.<br />\n\"Proficiency in markmanship is<br />\nthe object sought,\" Lieutenant Sherwood said. \"Participation in these<br />\nintra-mural matches will give the<br />\nnew men practice in shooting under match conditions, and will pave<br />\nthe way for a successful season.<br />\nPrizes are offered - to give a man a<br />\nlittle steadier aim.\"<br />\nSecond Match Today<br />\n<br />\nThe second day match of the intramural series will be held today<br />\nas usual in the north loft of Gilman Hall from 1 to 6 P. M. This<br />\ntime, when the smoke has cleared<br />\naway, five prizes will be awarded.<br />\nConditions of the match are as<br />\nfollows:<br />\nPosition: Kneeling; one target,<br />\n2 shots on each bull's-eye, including the sighting bull.<br />\nEligibility: Open to all members<br />\nof the club.<br />\nRifles: Any rifle, cal. 22.<br />\nAmmunition: Any cal. 22.<br />\nPrizes: First, $5.00; second,<br />\n$3.00; third, $2.00; fourth, $1.00;<br />\nfifth, 100 rounds of ammunition.<br />\nTeam practice is held on Tuesdays, Wednesdays, and Fridays at<br />\n4 P. M.<br />\n<br />\n•<br />\n<br />\nDamon—<br />\n\"Hey, there!<br />\nof mine?\"<br />\nPythias—<br />\n<br />\nAren't<br />\n<br />\nyou a friend<br />\n<br />\nI'd do anything<br />\nIn the world for you. Yes, any-<br />\n<br />\n\"I certainly am.<br />\nthing!\"<br />\n<br />\nDamon—<br />\n\"All right—prove it!<br />\n<br />\nGive me back<br />\nthat Eldorado pencil you borrowed<br />\nlast night.\"<br />\n<br />\nmasterdrawbigpencit<br />\n17 leads—all dealers<br />\n<br />\na<br />\n<br />\nSANFORDS<br />\nFOUNTAIN PEN INK<br />\n<br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n•<br />\n<br />\nrd11111111<br />\nililloffionolitl<br />\nsa1i0 ,5<br />\nNK<br />\n' fOUNTAINPENIG<br />\nrAsy<br />\n<br />\nALL<br />\nCOLORS<br />\n<br />\nFLOV/1,10(<br />\n<br />\nB<br />\n<br />\nALL<br />\nSIZES<br />\n•<br />\n<br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br />\n<br />\nThe targets of matches which are<br />\nnot fired shoulder-to-shoulder will<br />\nbe exchanged by mail; fifteen men<br />\nwill shoot, the ten best targets being counted.<br />\nThe Rifle Club has joined the<br />\nIntercollegiate Rifle Association, in<br />\nconnection with which eight matches<br />\nwill be fired after March 1st. The<br />\ncolleges in the Hopkins division<br />\nare:<br />\nGettysburg, Georgetown, Pitts •<br />\nburgh, Carnegie Tech, Cincinnati,<br />\nGeorge Washington, Kentucky,<br />\nProspects Bright<br />\nProspects for a team equally as North Carolina State.<br />\ngood as last year's are bright. Four<br />\nIf Hopkins is the victor in this<br />\nletter men, Manahan, Steck, Mar- division, the winners of other ditin, and Muir, form the nucleus, visions will be matched. with the<br />\nwith several new men on hand to Homewood team.<br />\ntake the places of those who gradThe best members of the Rifle<br />\nuated last year. Practice is being Team will be sent to the National<br />\nheld in the north loft every Tues- Rifle Association contest to compete<br />\nday, Wednesday, and Friday after- for individual prizes.<br />\nnoon at 4 o'clock, under the direcFewer Ushers Needed<br />\nA sad bit of news was told Mation of Lieutenant Sherwood.<br />\nThe club begins the busiest sea- jor Hoisington last week. It will<br />\nson of its career; with many inter- be remembered that the R. 0. T. C.<br />\ncollegiate matches, club contests, unit has been invited to act as ushtrials ers at the Army-Navy game. A<br />\nand<br />\nshoulder-to-shoulder<br />\nscheduled for the coming winter, it complication has arisen, however,<br />\npromises. to give its members the in that, out of the unit of 315 men,<br />\nlargest number and most impor- only 250 will. be needed. These<br />\ntant matches that the club has ever will be selected in the order of seniority in the service, and by lot.<br />\ntaken part in.<br />\nThe<br />\nmen who are .not chosen will<br />\nThe schedule for matches with<br />\nbe<br />\ndesignated<br />\nas alternates, and in<br />\nother colleges is as follows:<br />\nthe<br />\nany<br />\nof<br />\noriginal men are not<br />\ncase<br />\nDecember 6—University of Pennpresent,<br />\nthe<br />\nalternates will be ready<br />\nsylvania (pending).<br />\nJanuary 1—Princeton (pending). to take their places. In this way,<br />\nJanuary 17—Virginia Poly and everyone will have at least a chance<br />\nof seeing the game.<br />\nCarnegie Tech.<br />\nJanuary 24—University of MinneCHICAGO ALUMNI ORGANIZE<br />\nsota (pending).<br />\nConsinued from page 1<br />\nInstitute.<br />\n7—Drexel<br />\nFebruary<br />\nM.<br />\nGrimm,<br />\nP. L. Highbarger, Di<br />\n-shoulFebruary 14—A shoulder-to<br />\nJ.<br />\nT.<br />\nHatfield,<br />\nDr. L. L. Iseman.<br />\nColder match with St. John's<br />\nDr.<br />\nH.<br />\nP.<br />\nDavidson,<br />\nDr. 0. F.<br />\nlege.<br />\nLong,<br />\nDr.<br />\n,an,<br />\nRobert<br />\nLonerpC.<br />\nFebruary 21—Georgetown, shoulDr.<br />\nTanH.<br />\nH.<br />\nG. Loomis, Dr. K.<br />\nder-to-shoulder.<br />\nFebruary 21—University of Cali- nenbaum, Halsey H. Matteson,<br />\nAnton S. MReason, H. W. Price,<br />\nfornia.<br />\nFebruary 28—Washington Univer- Lessing Rosenthal, William L.<br />\nRoss, Dr. John A. Scott, Dr. E. A.<br />\nsity.<br />\nSmith,<br />\nA. E. Brooks, Dr. 0. R.<br />\n14—University<br />\nof<br />\nGettysMarch<br />\nSellers,<br />\nCliaton L. White, Dr. R.<br />\nburg, shoulder-to-shoulder.<br />\nE.<br />\nZiegler,<br />\nand Rev. Stuart D.<br />\nMarch 21—University of MaryWhite, Dr. 0. T. Schultz.<br />\nland, shoulder-to-shoulder.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, NOVEMBER 14, 1924<br />\n<br />\nNo well dressed college man is<br />\nwithout one. It's the original,<br />\ncorrect slicker and there's nothing assmart orsensible for rough<br />\nweather and chilly days.<br />\nMade of famous yellow waterproof<br />\noiled fabric. Has all-'round strap on<br />\ncollar and elastic at wrist-bands.<br />\n<br />\nClasp - closing style<br />\nButton-closing style<br />\nStamp the correct name in your<br />\nmemory, and buy no other. The<br />\n\"Standard Student\" is made only<br />\nby the Standard Oiled Clothing Co.,<br />\nNew York. Slip one on at<br />\n<br />\nENGINEERS AND STUDENTS<br />\nOF HYGIENE INSPECT<br />\nFILTRATION PLANT<br />\nWashington, Burnt Mills, Hyattesville<br />\nand College Park Visited. Washington's Slow Sand Plant<br />\n<br />\nREVERIES<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\n<br />\nBY OLD ALUMNUS<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nOld Johnny Hopkins is nearing<br />\nits fiftieth anniversary. That<br />\nseems to be the keynote of the<br />\ngreeting on every tongue as the<br />\nOld Alumnus meets occasional<br />\nfellow-alumni, particularly those<br />\nof the latter who live at a distance<br />\nfrom Baltimore. From the creeping, tottering, old-timer, who<br />\nspeaks fondly of \"Little RO3S<br />\nStreet\" to the most recent acquisition from the class of '24 who<br />\nlooks with suspcion upon Phi<br />\nBeta Kappa comes the same sentiment that \"something must be<br />\ndone about it.\"<br />\nStrangest thing about it is that<br />\nthe great bulk of enthusiasm is<br />\nnot confined,to the ranks of the<br />\nboisterous A. B.'s but is shared<br />\nequally by the M. D.'s and Ph.<br />\nD.'s who owe a previous allegiance to a \"first love.\" It would<br />\nprove interesting to hear from<br />\nsome of them, I'm sure.<br />\nSaw old \"Bill\" Ross, A. B. '99,<br />\njust the other day. Bill is now a<br />\nvery successful Chicago banker,<br />\nbut he's still dead interested in<br />\nthe old college. He has showed<br />\nthat by his work in Pittsburgh,<br />\nCleveland and Chicago, where he<br />\nbrought into being Hopkins alumni associations. Founded within<br />\nthe past two decades, they have<br />\nperhaps faded, as the demon organizer withdrew his enthusiastic<br />\nguidance to new fields. Bill is<br />\nnow secretary of the association<br />\nin Chicago and is much in favor<br />\nof an anniversary celebration.<br />\n*<br />\n*<br />\n<br />\nFiltration plants of practically all<br />\nessential types were viewed last<br />\nAlondav, November 10, when seniors of the civil engineering department combined with members of<br />\nthe School of Hygiene and PubHealth and visited Washington, \"0. D.\" Collins, who joined the<br />\ndegree-holder ranks in '23 is<br />\n]). C. Besides the large filter at<br />\nstrongly in favor of a celebration.<br />\nthe capital, several smaller plants<br />\n\"0. D.\" is with the Telephone<br />\nat the nearby towns of Burnt Mills, Company in Washington,<br />\nand is<br />\nHyattsville and College- - Park, in trying to rally the D. C. boys to<br />\nregular alumni luncheons, showAlaryland, were inspected.<br />\ning<br />\nthe same old \"pep\" that made<br />\nWashington claims one of the<br />\nhim<br />\na campus leader.<br />\nlargest plants in the country of the<br />\n* * *<br />\n'slow sand\" type, the normal CaPacity ranging from 65,000,000 to<br />\nHad a chat with Clarence Baer<br />\n75,000,000 gallons of water a day. the other day. Clarence met us<br />\nThe filter beds of this plant cover in the Med School and took his<br />\nan expanse of 29 acres, yet so effi- M. D. in 1905 but he sure got a<br />\ncient is the operation and cleaning kick out of every day's work at<br />\nof the sand that no new material the old plant. Clarence, you may<br />\nhas been purchased for more than recall, fell ill one day, on a Pittsa score of years. The filter plant burgh-Baltimore train and was<br />\nProper is entirely under govern- rushed unconscious to Hopkins<br />\nmental control, with the actual dis- Hospital.<br />\nHe was amazed to<br />\ntribution of water to the consumers awake in such familiar surroundunder supervision of the District ings and was greatly amused<br />\nauthorities.<br />\nwhen the interne, a fellow-stuAt Burnt Mills a small rapid dent, made him write his<br />\nown<br />\nsand plant of approximately 1,000,- \"history.\" Doc. Baer is practicing<br />\n000 gallons a day capacity showed medicine these days in Milwauthe inner workings of a typical big<br />\nkee.<br />\neitY plant of this nature in much<br />\nSpeaking of Milwaukee, I see<br />\nthe same fashion that a small workthat Johnny Defandorf, electrical<br />\nmodel of a machine illustrates engineer of '17, is secretary of the<br />\nthe essential principles of its par- alumni association out there.<br />\nHis<br />\n!nt• . A comprehensive review of brother, Marion, is with the Buthe plant was made, from the point reau of Standards<br />\nin Washington.<br />\nWhere water is taken from the He graduated in engineering<br />\nin<br />\nnearby stream; and pumped into<br />\n'21 and is a live wire at the Buthe coagulating and sedimentation<br />\nreau.<br />\nbasins, until it was ready to go to<br />\nthe consumer, as a clear, sparkling<br />\neffluent.<br />\nCalifornia's lure has claimed anA similar plant, on a larger scale, other Hopkinsian. Pere Wickes,<br />\nWas inspected at Hyattsville, and '94, has gone from the Middle<br />\nfinally at College Park the open West to Paso Robles to \"carry<br />\nsand filter of the University of on\" in the insurance business.<br />\nMaryland was given a brief survey. Young George Bahlke, the flyThis is the only open sand filter in ing fish, who passed his freshman<br />\nthis section of the country.<br />\nyear at Hopkins, last year, is out<br />\n„4<br />\n,<br />\n<br />\n3<br />\n<br />\nWE INSULT PLAYERS<br />\n<br />\nEditor of the NEWS-LETTER:<br />\nThe idea of applauding when<br />\none of our football players is lying<br />\non the ground suffering seems assinine to me. I have seen many<br />\ncolleges play football games and<br />\nhave been to many fields where<br />\nHopkins teams have not been one<br />\nof the contenders, but never have<br />\nI seen any cheering section rise and<br />\napplaud when one of its classmates<br />\nwas lying on the ground suffering.<br />\nWhen a man is in this condition h<br />\nis no time for applause, when he<br />\nhas risen to his feet is the moment<br />\nto lend him a hand. When he is<br />\non his back the best way to help<br />\nhim get up is by remaining as quiet<br />\nas possible.<br />\nThe idea of a cheer for him as<br />\nsoon as he has been hurt would be<br />\nin order, but when it is seen that<br />\nhe is definitely injured, clapping is<br />\nno way to help the man. I have<br />\nhad many men visiting Hopkins<br />\nfrom other colleges who have had<br />\nthe same idea on the subject, and<br />\neven some felt it an insult to applaud when their men were injured.<br />\nI wish to call this to the attention<br />\nof the cheer leaders and believe it<br />\na subject fit for open discussion and<br />\nthat a definite decision should be<br />\narrived at.<br />\nYours truly,<br />\nA HOPKINS BOOSTER.<br />\n<br />\nToday — men and women know<br />\nhow to keep their hair in place<br />\nsmart people gather —<br />\nIATHERE<br />\nin college and out —you'll not<br />\n<br />\nfind one case of unkempt hair!<br />\nIt wasn't always so.<br />\nStacomb has made possible the<br />\nfashion of smooth hair among women. It keeps men's hair looking<br />\nalways just as they want it to look.<br />\nA light, velvety, invisible cream<br />\n<br />\nEE<br />\n<br />\nOFF E<br />\n<br />\n—non-staining and non-greasy.<br />\njars and tubes, at your college<br />\ndrug store. (Now also in liquid<br />\nform.)<br />\nIn<br />\n<br />\n•,`<br />\n<br />\n•.•<br />\n<br />\nKEEPS THE HAIR<br />\n<br />\nIN PLACE<br />\n<br />\nDept.ftl<br />\nCity<br />\nLaboratories, Inc.,<br />\nYork<br />\ngenetout<br />\n---Standard 13th St., New<br />\ncharge, a<br />\ntacofree of<br />\n113 VJesttne,<br />\nd of Srrib. ....\"..<br />\nPlease sea<br />\n_<br />\n................. .........<br />\nsample tube<br />\nIS<br />\n<br />\nI<br />\n<br />\nName.<br />\n.....<br />\n......<br />\n...<br />\nAddress....<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nXCKCornerayelie and Cutaw Sts.<br />\n-Where Wholesale and Retail Districts Meet\"<br />\n<br />\nLAXITY AMONG FROSH<br />\n<br />\nof the NEWS-LETTER:<br />\nThere is too much laxity among<br />\nthe Freshmen. I understand that<br />\nand individuality is offered here at prices that are not<br />\na committee has been appointed to<br />\ncannot be underquoted by any house at any time.<br />\nand<br />\nhandle them but the number of<br />\n(Besides the reputation of an old-established firm<br />\nFreshmen is almost too large to be<br />\nis back of each sale with a guarantee.<br />\ncared for by a few Members of a<br />\ndelegation of Sophomores. Last<br />\nSaturday only a small percentage<br />\nturned out for the cheering section.<br />\nTheir interest lags and their re- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nquirements are not enforced.<br />\n343 NORTH CHARLES STREET<br />\nIf the upper classmen continue<br />\nto pass by without enforcing the<br />\nregulations, leaving it entirely to<br />\nKAPPA PHI<br />\nthe Soph committee, the first year<br />\nFRATERNITY<br />\nmen will soon consider the rules as<br />\nDANCE<br />\nonly printed words. I see them<br />\nwalking on the grass, smoking in<br />\nSouthern Hotel<br />\nthe halls, wearing civilian hats on Presentation<br />\nof Trophy to Polytechnic<br />\nthe campus, without Freshmen butVarsity Team<br />\ntons, and exercising too much freeBy Tau Chapter<br />\ndom. It is being noticed and talked<br />\nAdmission by Couple Only<br />\nabout, but no one takes it upon<br />\nNovember 15, 1924<br />\nSHERWOOD BROTHERS, INC.<br />\nthemselves to enforce Freshmen reHopkins Students Cordially<br />\nstrictions because a committee is<br />\nInvited<br />\nSONCgINNINE1=7NRNINP.WININNINIZEINO<br />\nsupposed to handle them.<br />\nHopkins will need a much better showing at the Maryland game<br />\nBaltimore's Best Store<br />\nand it is up to Freshmen officers to<br />\nsee that their men turn out—or<br />\nHOCHSCHILDKOHN<br />\nCO.<br />\nsuffer the consequences.<br />\nYours truly,<br />\nHoward and Lexington<br />\nISIDORE O'BRIEN.<br />\nEditor<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\n• i• r:4<br />\n<br />\n•I'0144•I•14121.1..1•14<br />\n<br />\nq•I 1E4144414 *41.14<br />\n<br />\nIE<br />\n<br />\n2IEZO111<br />\nHaDUOR OEM<br />\n<br />\n8c,<br />\n<br />\nat Northwestern University'. Pity SHIRTS<br />\nNECKWEAR<br />\nhe couldn't have stayed to bring<br />\nHopkins further natatorial honors.<br />\nWell, that's about enough gos421 N. HOWARD ST.<br />\nsip from an old-timer (and I do HOSIERY<br />\nGLOVES<br />\nfeel aged since learning that Jimmy (W. Norman) Brown, '12, is<br />\nORDERS RECEIVED FOR<br />\nthe daddy of a two month old<br />\nboy!<br />\nHope to see Cap'n Tom's Blue<br />\nTransfer & Baggage Express<br />\nDevils live up to last year's mark<br />\nAUTOMOBILE SERVICE<br />\nthis Thanksgiving.<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nLeFranc & Ault<br />\n<br />\nCOGGIN'S<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br />\n<br />\n\f.<br />\n''<br />\n<br />\n4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 14, 1924<br />\n<br />\nFRESHMAN DEBATING TEAM<br />\n\"IF\" TO BE PRESENTED BY JAY SKETCHES DUE<br />\nPLAYSHOP ON NOV. 20<br />\nPICKED AT TRY-OUTS<br />\nDECEMBER FIRST<br />\nCast Picked for First Production. Art<br />\nDepartment Created<br />\n<br />\n111111111<br />\n<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nRehearsals for Dunsany's \"If\" All sketches for the Black and<br />\nhave been in progress for two weeks Blue Jay art contest must be Niles, Parker, Wyatt and Margolis Are<br />\nPicked to Represent the<br />\nin the Campus Theater and the<br />\nFreshman Class<br />\nturned in to the office by Decemproduction promises to be one of<br />\nber 1. A silver loving cup will be<br />\nAbout a dozen candidates for<br />\nthe most elaborate and interesting<br />\nthe<br />\nfresman debating team met<br />\nthat the Playshop has ever under- awarded to the man wielding the<br />\nNovember 11, at noon<br />\nTuesday,<br />\ntaken, according to Dr. Small, who cleverest pencil up to and includfor<br />\ntheir try-outs, which were conis President of the Playshop this ing the third from the last issue of<br />\nby Professor French, asducted<br />\nyear. Not only is the dramatic the magazine. This cup, along<br />\nTOM MAGILL,<br />\nDOUG TURNBULL<br />\nsisted<br />\nby Lawrence Willison,<br />\nwork of the play being enthusias- with<br />\nRepresentatives<br />\nManager<br />\ntwo others offered by the president of the Debating Countically carried on, he says, by the<br />\neditorial and business depart- cil.<br />\nmembers of the cast under the caThe candidates were called<br />\npable direction of Mr. Harry Pou- ments, will be presented at the ander, but also \"the Art Department nual banquet of the Black and upon to give a three minute<br />\nis planning to carry out the light- Blue Jay by a board of judges, speech on the negative side of<br />\n2819 Greenmount Avenue<br />\ning and scenic effects in such a composed of the present Blue Jay the question, \"Resolved,. That<br />\n(Opposite Ilchester)<br />\nBaltimore should establish a mumanner that they will compare faBoard of Control. This contest is<br />\nnicipal college.\" At the end of A high-grade Haberdashery Shop<br />\nvorably with the best work done in<br />\nin<br />\nconnection<br />\nwith<br />\nnext<br />\nissue<br />\nthe<br />\nWithin Walking Distance of the<br />\nthree minutes Professor French<br />\nthe Little Theater.\"<br />\nUniversity<br />\nwhich<br />\nand<br />\nBlue<br />\nthe<br />\nBlack<br />\nJay<br />\nof<br />\nasked each candidate to rebutt a<br />\nThe second and third acts of \"If\"<br />\npoint, which he gave for the af- UPTOWN<br />\nare laid in Persia and special treat- will appear on Decembei- 12.<br />\nDOWNTOWN<br />\nfirmative. After the candidates QUALTIES<br />\nment will be required in the way<br />\nPRICES<br />\n222 & 224 W Baltimore St.<br />\nof costumes and settings of an ex- INTERFRATERNITY BOARD had all been heard, some were<br />\nOPEN EVENINGS<br />\notic nature. However, despite the TO SEND REPRESENTATIVE called back to give another mingreat variety of episodes and<br />\nute of their speech. After conT NEW YORK<br />\nscenes, the play will be given in its<br />\nference<br />\nwith Willison, ProfesSor<br />\nJ. F. APPLE CO.<br />\nAt the Inter-Fraternity Board<br />\nentirety, not excepting the elabFrench announced that the FreshMANUFACTURING<br />\nJEWELERS<br />\nmeeting on last Monday, there<br />\norate banquet scene.<br />\nman Debating Team consisted of<br />\nLANCASTER, PA.<br />\n\"The parts, which are about fif- were no violations of the rushing D. C. Niles, chairman; W. G. ParClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nteen in number, have been happily agreement brought up before the ker, C. H. Wyatt and P. Margolis.<br />\nStationery,<br />\nInvitations,<br />\nProgrammes<br />\ncast and there is plenty of oppor- board. In past years this has not<br />\nThe Freshman-Sophomore deSOPHOMORES<br />\n\"MAKERS<br />\nOF<br />\nTHE<br />\nVARSITY SEALS\"<br />\ntunity for good acting,\" Dr. Small been the case after the conclusion bate will be held December 11 at<br />\nFRESHMEN<br />\nsaid. It was erroneously stated in<br />\nof the rushing season; and \"that the asembly. \"The freshmen,\"<br />\nthese columns recently that Whitesaid the chairman of the team,<br />\nthee should be no violations of<br />\nford Stull and Miss Georgia GossR. G. Loy & Company<br />\n\"are going to work to win, ind<br />\nman were members of the cast. the agreement this year indicates are goirg to win'.'<br />\n(Robert G. Loy)<br />\nStanley Worden, Donald Kirkley, a broadening fraternity spirit at<br />\nand George McCandles have the Hopkins,\" M. R. Gilpin, president<br />\nPHARMACISTS<br />\nRESTAURANT<br />\nleading male roles. Important feNEW BOOKS<br />\nof the Council, is reported to have<br />\nUNIVERSITY PARKWAY<br />\nmale parts are taken by Miss Estelle<br />\nContinued from page 1<br />\n1817 N. Charles St.<br />\nsaid.<br />\nAt Charles St.<br />\nMitchell, Miss Virginia Handy,<br />\nTen distinct forms are recognized,<br />\nThe<br />\nmain<br />\nbusiness<br />\nof<br />\nthe<br />\nmeetAlMiss<br />\nFay<br />\nMiss May Gould, and<br />\nbesides numerous different styles<br />\nlen. Minor parts are filled by Men- ing was the decision to send a of draping. Among the. outstandCollege and Fraternity Stationery<br />\nOpen All Hours<br />\nBanquet and Dance Cards, Invitations<br />\ngers, Wales, Keller, L'Allemand, representative to the Inter-Fra- ing feature of the books are diaNeuberger, R. Kirkley, Hambur- ternity Board Conference in New grams or drawings giving the<br />\nJAS. H. DOWNS<br />\nger and Mugford.<br />\nshape<br />\neach<br />\nform<br />\nof<br />\nof<br />\ntoga,<br />\nillusENGRAVER PRINTER STATIONER<br />\nYork city, on November 28 and<br />\nNear Your Campus<br />\nThe play will be given at the<br />\ntrations of the process of drap229 N. CHARLES ST.<br />\nCampus Theater on November 20. 29. Two men were nominated as ing on the living model, and pracrepresentatives, Daniel E. Klein, tical suggestions to teachers and<br />\nLATEST STYLES AND FORMS<br />\nSCABBARD AND BLADE<br />\nlast year's representative, and students regarding the making ot<br />\nINITIATES FOUR<br />\nEngraved<br />\nBaird Fonda. These men will be the toga. Many prominent scholAt a meeting of the Scabbard<br />\nars who have personal knowledge<br />\nWEDDING INVITATIONS,<br />\nand Blade, honorary military so- voted on at the next meeting.<br />\nAND<br />\nWilson's<br />\nwork<br />\ntestify<br />\nANNOUNCEMENTS<br />\nof<br />\nMiss<br />\nciety, on Monday, November 10, The Inter-Fraternity Board<br />\nCARDS<br />\ninestimable<br />\nVISITING<br />\nvalue.<br />\ngladly<br />\nits<br />\nto<br />\nthe following men were initiated: Conference was initiated last year<br />\nTEA—<br />\nRaymond Ashley, William Dra- by the Inter-Fraternity ComerSAMUEL H. KIRBY LUNCHEON—AFTERNOON<br />\nDINNER<br />\nENGRAVER<br />\nper, George Hess and Charles ence which is graduate represenWATER-PROOF<br />\nSamples and Prices on Request<br />\nBanquets & Receptions<br />\nMuir. The new members will tatives from each national fraterBobby—Hi, there! Don't spit<br />\nBALTIMORE CAKES —ROLLS —SANDWICHES<br />\n42 SOUTH ST.<br />\nbe publicly congratulated by Pres- nity.<br />\non the floor.<br />\nUndq- the auspices of this conident Goodnow at a review in the<br />\nGus—Smatter, floor leak?<br />\nference 36 representatives from as<br />\nnear future.<br />\n—Fentonian.<br />\nmany colleges met at Hotel Pennsylvania, New York, on the FriDREXEL MEETS HOPKINS<br />\nContinued on page 3, col. 3<br />\nday and Saturday after ThanksEXPORTS<br />\nMOUNT VERNON PLACE<br />\nshifted , Supplee, who made the giving. The conference is for the • Prof—What arc the exports of<br />\nMETHODIST<br />\nEPISCOPAL<br />\nsecond All-American team at end purpose of discussing practical Virginia?<br />\nCHURCH<br />\nlast year, to the position of quar- inter-fraternity board problems.<br />\nStude—Tobacco and livestock,<br />\n(At the Washington Monument)<br />\nterback. With the terminal of<br />\nsir.<br />\nREV. OSCAR THOMAS<br />\nthe line thus weakened by a subLACROSSE SCHEDULE NEARS<br />\nProf—What kind of livestock?<br />\nOLSON, D.D.,<br />\nstitute, the fast Yale backs took<br />\nCOMPLETION<br />\nMinister<br />\nStude—Camels.—Shadows.<br />\nshortcoming<br />\nthis<br />\nadvantage of<br />\nThat the lacrosse squad is alSunday<br />\nServices of Worship<br />\nand raced around the end for gain<br />\nready preparing for the stiff, in11 A. M. and 8 P. M.<br />\nafter gain.<br />\nteresting schedule being arranged<br />\nThe Sunday afternoon -at home.<br />\n'<br />\nPRIATERS<br />\nBUIDEREllgRAUERS<br />\nDrexel, however, must not be<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nweak teeth<br />\nfor<br />\nit,<br />\nis<br />\nshown<br />\nby<br />\nthe<br />\napMaryland<br />\nforgotten<br />\nas<br />\nRoom is a social occasion that brings<br />\nand swollen jaws of some who<br />\ntogether the student groups from Hopproaches. More than once overkins, University of Maryland, Goucher.<br />\nhave taken part in the tag games<br />\nconfidence has proven the stumPeabody, and other schools of Baltifall<br />\n\"wall.\"<br />\nAs<br />\nplayed<br />\nabout<br />\nthe<br />\nmore.<br />\nbling block for a more powerful<br />\nEworth League at 7 P. M. and the<br />\npractice progresses possibilities<br />\nteam than Hopkins' and Drexel,<br />\nBible class at 10 A. M. are built parintercolcapturing<br />\nthe<br />\nfor<br />\nagain<br />\nticularly with the needs of the young<br />\nno doubt, has a few tricks up her<br />\npeople in mind.<br />\nbecome<br />\nbrighter.<br />\nThe<br />\nlegiate<br />\ntitle<br />\nsleeve to puzzle the Blue Jays.<br />\nconsensus of opinion is that tag is<br />\nJUNE WEEK FUNDS<br />\nplayed more frequently this year<br />\nContinuedfrom page 1<br />\nthan it was last fall.<br />\nTelephone, Madison 4722<br />\nVernon 4986<br />\nGraduate Manager Keyes and<br />\nprizes will beAfvarded at the first<br />\nCotillon on Friday, December 12, Manager Baker are working on<br />\n\"Say It With Flowers\"<br />\nat the Maryland Casualty Club the schedule now. As soon as the<br />\nTHE J. W. HOWARD CO.<br />\nHouse.<br />\nexcitement over football has died<br />\nFrom time to time throughout down a little it is the intention of<br />\nPrinters of<br />\nDRAWING MATERIALS<br />\nthe year various methods for rais- the managers to place the entire<br />\nSURVEYING INSTRUMENTS<br />\ning money will be introduced. list of games before the public.<br />\ncrhe Johns Hopkins<br />\nThese campaigns replace the old Until then the fans will have to be<br />\nNEIDS,-LETTER<br />\n2422 Madison Avenue<br />\nsystem of Tag Days and June content with the assurance that<br />\nB altim ore, Md.<br />\nWeek Stamps which proved to be Hopkins will have a good .sched- LOM BARD and SOUTH STREETS<br />\n1822 N. CHARLES STREET<br />\nunsatisfactory.<br />\nule.<br />\n<br />\n1<br />\n<br />\ncia4.4s, ais,ctis,Slrcet<br />\n<br />\nErnest G.Lehnbach<br />\n<br />\nWARNER & CO.<br />\nHatters<br />\n<br />\nHATS—OVERCOATS<br />\nNECKWEAR<br />\n<br />\nSENIORS<br />\nJUNIORS<br />\n<br />\nSt. Regis<br />\n<br />\nteftlart<br />\nZra *out<br />\n<br />\nJohns Hopkins Students Will Find A Welcome At<br />\n<br />\nSMITH & CO.<br />\nFlorists<br />\n<br />\nI<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXIX, No 13<br /><br />\n1<br /><br />\nHOMEWOOD, BALTIMORE. MD., NOVEMBER 14, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPIUNS PRESS PUBLISHES CLUB REPIIESI NIS<br />\nJUNE<br />\nWEEK COMMITTEE SENIOR CLASS NOMINATES DREXEL MEETS HOPKINS AT<br />\nTHREE NEW BOOKS. DR.<br />\nADOPTS<br />\nNOVEL PLAN<br />\nFOR STUDENT COUNCIL<br />\nHOMEWOOD FIELD<br />\nTHIRTY COUNTRIES<br />\nMUSTARD IS EDITOR<br />\nFOR RAISING FUNDS<br />\nTOMORROW<br />\nThirty different countries and<br />\nVolumes Are of Interest to EducationBooks of Tickets to June Week to Be<br />\nNominations to fill the vacancy Philly Team Long Shot in Tomorrow's<br />\nal World. Another in<br />\nall four races are represented in<br />\nSold and Lottery Held at the<br />\nMay Forsake Placeon<br />\nthe student council caused by Game; Turnbull<br />\nPreparation<br />\nFirst Cotillon<br />\nments for Dropkicks<br />\nthe Cosmopolitan Club. Besides<br />\nThree books have recently been<br />\nWith the idea of making the Calhoun's election to the presiComing into the last stretch of<br />\nAmericans and Englishmen there<br />\ndency of the senior class, were a<br />\nPublished, by The Johns Hopkins<br />\nsuccessful gridiron season the<br />\n1925 June Week a Hopkins affair<br />\nare 88 men from other countries.<br />\nmade at a meeting .of that class Blue<br />\nPress. They are: \"The Eclogues<br />\nJays will strive to increase<br />\nfor all Hopkins students the Exheld on Monday, November 10. their<br />\nmagin of points over their<br />\nof Antonio Geraldinig,\" edited by China's delegation of 22 heads the ecutive Committee is rapidly forlist. Russia has 8, Japan 7, Philip- mulating plans whereby a substan- The two nominees are Gordon opponents at the expense of the<br />\nWilfred P. Mustard, Ph. D., D.<br />\nPost and John Fringer. The elecDrexel Institute at Homewood topine Islands 6, Porto Rico 5, tial revenue will be received and<br />\nLitt.; \"A Working Manual of<br />\ntion will be held at the next meetmorrow. Coach Van Orman is<br />\nthe<br />\nWeek<br />\nJune<br />\ntickets<br />\nbe<br />\nrecan<br />\nEcuador 4, Bulgaria 4, Siam 3,<br />\ning of the class, Wednesday, NoOriginal Sources in American<br />\nduced<br />\ncomparatively<br />\nnominal<br />\nto<br />\nthat<br />\na<br />\nit<br />\ncost<br />\nso<br />\nsure of victory in<br />\nHungary 3, and Denmark, Canavember 19.<br />\nGovernment,\" by Milton Conospite<br />\nof<br />\nbe<br />\npossible<br />\nwill<br />\nevery<br />\nDrexel's<br />\nfor<br />\nstudent<br />\nbeing almost an<br />\nda, Rumania, Palestine, British<br />\nThis meeting was marked by a unknown quantity.<br />\nver; \"The Permanence of the Vopurchase<br />\none.<br />\nprevious<br />\nto<br />\nIn<br />\nThe only .<br />\nWest Indies, Switzerland and<br />\nvery small attendance. President known indication of<br />\ncational Interests of Junior High<br />\nDrexel's<br />\nCosta Rica 2 representatives each. years June Week has seemed to<br />\nCalhoun urged that every mem- strength is their 13 $o 6<br />\nSchool Pupils,\" by Edward Earle<br />\ndefeat<br />\nCuba, Germany, Hawaii, Brazil, be more of a Senior Week than<br />\nber he present at the meeting over Loyola last week.<br />\nFranklin. A book that is now in Armenia,<br />\nLoyola,<br />\nCzecho-Slovakia, Hol- one for Seniors and underclassthe process of publication is \"The<br />\nWednesday as there is very im- however, was<br />\nstrengthened one<br />\nland, Jugo-Slavia, Nicaragua, Ko- men, primarily because it was supportant<br />\nbusiness to be discussed. hundred per cent by the<br />\nRoman Toga,\" by Lillian M. Wilported<br />\nchiefly<br />\nby<br />\nSeniors.<br />\nAlpresence<br />\nrea, Poland and Bolivia are repson, Ph. D.<br />\nthough the 1925 June Week is tinof \"Polly\" Byrne, their star fullresented by one man each.<br />\nDr. Mustard's new book is the<br />\nder the direction of the Senior BLUE JAY CIRCULATION back, who was prevented from<br />\nlatest of the series of Eclogues<br />\nClass it is the idea of the Class of CONTEST ANNOUNCED BY playing against Hopkins because<br />\nby different authors which he is CHICAGO ALUMNI ORGAN- 1925 to make June Week this year<br />\nof an injured leg.<br />\nPHILIP SACHS<br />\nIZE AT MEETING ON<br />\nediting. The Introduction and<br />\nand in future years a week of fesBlue Jays Favorites<br />\nOCTOBER 28<br />\nNotes to \"The Eclogues of Antivity for the entire University,<br />\nIn spite of any certainty of the<br />\ntonio Geraldini\" will be found<br />\nFaculty, Seniors, Juniors, and un- Plan to Award Prizes to Students Se- outcome of the game the Blue Jay<br />\nGraduates Attend First<br />\nvery valuable to the reader. They Thirty-five<br />\ncuring Most Subscriptions for Jay.<br />\nderclassmen.<br />\nline-up will remain intact, at least<br />\nGathering Since 'March, 1921; Dr.<br />\nLife-time Subscriptions One Prize<br />\nare exceptionally clear and conEdmunds Gives Lecture<br />\nThe Executive Committee beto start the contest. The only<br />\ncise.<br />\nThe Johns Hopkins Alumni lieves that the one way to realize<br />\nIn order to increase the circula- change will be caused by LeibenThe problem book by Mr. Con- Association of Chicago at a recent this hope is by making the price tion of the Black and Blue Jay, the spergefs injured leg which will<br />\nover has been used in part as meeting selected officers<br />\nfor the of a June Week ticket sufficiently Board of Control has decided to result in Milanausky's starting at<br />\nhold a subscription contest to close guard.<br />\nmimeographed material for four<br />\ncoming year. Dr. Ernest A. Smith, low so as to be within the purDecember<br />\n23. Every student, with<br />\nyears at the University of Pennchasing power of every student.<br />\nThe work of the past week in<br />\nsylvania, and for two years at now Superintendent of Schools in Without, in the least, lowering the exception of those on the Board practice has consisted of light<br />\nNew York University. It is de- Evanston, was chosen president; the character of program for June of Control of the Jay is eligible to scrimmages and dummy practice.<br />\nscribed as \"a project working Dr. Solomon Strouse was elected Week, this aim will be accom- compete. Worth-while prizes are It is the plan of the coach to work<br />\nmanual which aims primarily to vice-president, and William L. plished by introducing certain being awarded according to the up slowly to more and more secorrelate government documents Ross, secretary-treasurer.<br />\nraising<br />\nmethods<br />\nof<br />\nmoney number of subscriptions obtained. vere practices previous to the<br />\nWith textbooks as an introduction • Dr. Charles K. Edmunds, Pro- throughout the year. Also, a<br />\nMen who are not members of Maryland game. This is the real<br />\nto the whole field of American vost of the University, who has ready working capital which will the Blue Jay staff will increase goal of the<br />\nyear and Van Orman<br />\nPolitics; which cultivate a citi- been making an extensive visit to be raised in this way vill enable their chances of making it if they wishes to make it a fitting climax<br />\nzen's interest in the realities of the various Alumni Associations the June Week Committee to pro- do well in this contest. Those who to a successful season.<br />\nPolitical science; and which uti- throughout the country, addressed ceed with their plans without -fear are already members of the staff<br />\nTurnbull Dropkicking<br />\nlizes the adolescent instincts for the meeting. His subject was of a deficit at the close of the will receive credit towards the silWhen \"Buck\" Bonner graduver cup to be presented to the mar. ated last year Turnbull dropped<br />\ncreative activity as rapidly as they \"Progress and Plans of the Uni- week.<br />\nbecome stimulated by lectures and versity.\"<br />\nThe first of these campaigns doing the best work for the busi- from one of the most consistent<br />\nThirty-five members attended for raising funds will open on ness staff during the year. This place-kickers in the country to<br />\nreadings.\"<br />\nThe work of Mr. Franklin is the meeting, the first to be held Monday, November 17. On this cup, it will be remembered, will be one of only mediocre calibre. Last<br />\nthe eighth of The jChns Hopkins since March,. 1921, 30 per cent of day each student will find in his awarded at the annual banquet next season when Hopkins<br />\ntied MaryUniversity Studies in Education, those present being medical men. Post Office box a book containing spring when elections are held for land the credit of the two field<br />\nedited by Profesor Edward F. On a vote of the men attending, ten tickets each, each ticket bear- the coming year.<br />\ngoals went to Turnbull but in<br />\nBuckner. The last volume is \"a the name was changed from the ing a number. The method conIn addition to the specific prizes, reality it was Bonner who caught<br />\nstudy of the intelligence and in- Northwestern Alumni Associa- sists of each student purchasing listed below, a special prize yet to the ball and snapped it into perterests of fifteen hundred pupils. tion to the Johns Hopkins Alumni from himself two of these tickets be decided will be given to the man fect position for \"Doug's\" toe.<br />\nPractical suggestions, based upon Association.<br />\neach week. The price of each securing the highest number of sub- Turnbull, however, through hard<br />\nthe findings of this study, for efThose who attended the meet- ticket is fifteen cents, thus making scriptions altogether. The subscrip- and regular practice has develfective vocational guidance in the ing were: Dr. H. B. Bettman, Dr. a book valued at $1.50. In the tion price is $1.25 for seven issues. oped into an excellent dropkicker.<br />\nWilliam Bloom, Dr. Samuel event that a student is unable to Blanks may be obtained from Proof of this can be seen in the<br />\nJunior high school are offered.\"<br />\nWhen the book by Dr. Wilson Brook, J. C. Collier of Dubuque, buy his allotted portion of tickets, Sachs, circulation manager, in the fact that while Turnbull has bootis published, it will present a con- Iowa, Dr. Henry Crew, Dr. W. C. he is supposed to sell them to Blue Jay office any day at noon. ed only one-third of his tries for<br />\nnected history of the Roman toga. Burkett, Frank Emerich, Dr. R. someone else. At the time of sale,<br />\nRules for the contest are as fol- place-kicks between the bars he<br />\nContinued on page 2 col. 5<br />\nthe purchaser is to sign his ticket. lows:<br />\nContinued on page 4 col. 3<br />\nhas failed to miss a single attempt<br />\nThis campaign will continue for<br />\nat<br />\na drop-kick so far this season.<br />\n1. Any Johns Hopkins student,<br />\nnamely<br />\nweeks,<br />\nuntil<br />\nDecemfive<br />\nIn<br />\nthe George Washington game<br />\nexcept the Board of Control of the<br />\nJOHNS HOPKINS FOOTBALL STARS WILL<br />\nthe<br />\nwhen<br />\nbooks<br />\nber<br />\nthe<br />\n10,<br />\nwith<br />\nTurnbull<br />\nmissed a 25-yard placeBlack and Blue Jay, is eligible.<br />\nPLAY IN CLEVELAND GRIDIRON cLASSIC<br />\nnumbered stubs and the money<br />\n2. Subscriptions are $1.25 for ment goal, then made a 35-yard<br />\ndrop-kick that culled the three<br />\nCaptain Thomas Magill and thusiasm has been aroused concern- acquired from their sale will be seven issues.<br />\npoints<br />\nDouglas Turnbull have been select- ing the game. The Western squad, turned over to W. Carville Gardnecessary to stave off de3. Contest closes December 23.<br />\ned to make a trip to Cleveland to which has been nearly selected, com- ner, chairman of the June Week<br />\nfeat. Turnbull will probably use<br />\n4. Secure subscription blanks<br />\nPlay in an intersectional football prises representatives from twenty- Committee. At the first Hopkins<br />\nfrom Philip Sachs at the Black and drop-kicks for the rest of the seagame the early part of next month, two colleges. All the players will Cotillon, to be held on Friday,<br />\nBlue Jay office any day from 12.20 son in spite of his three year's<br />\nDecember 12, the numbers will be<br />\nsuccess at placements.<br />\naccording to information given out be amateurs.<br />\nto 1.<br />\nMaryland Game Nears<br />\nby the athletic office. A request In order to procure a team equal placed in a large container in the<br />\n5. The following prizes will be<br />\nAs the Maryland game looms<br />\nfor two Hopkins varsity to play to that of the Westerners, Cleveland ballroom, stirred up well and<br />\nawarded:<br />\nlip on the horizon before the Blue<br />\nm Cleveland was received by Coach alumni of Eastern universities have three tickets will be drawn. Prizes<br />\na. For securing 5 subscriptions, Jays a slight ray of<br />\nVan Orman, Tuesday. There has telegraphed the coaches of the lead- will be awarded to the winners in<br />\nbrightness is<br />\nbeen a growing desire in Cleveland ing teams of the East, request*.ng the order in which the numbers a student will be given 5 additional afforded by the crushing 47-0<br />\nsubscriptions.<br />\ndefeat which Yale handed the Old<br />\nto build a municipal stadium, one them to send two or three varsity are drawn. The first prize will<br />\nFor<br />\nsecuring<br />\nb.<br />\n10<br />\nsubor<br />\nmore<br />\nlike Baltimore's, if possible. In or- players to participate, with the one consist in a due bill valued at $50<br />\nLiners at New Haven last Saturder to raise funds for the under- stipulation that they must be grad- exchangeable for any article of scriptions, a student will be given day. The Bulldogs added insult<br />\ntaking, an intersectional football uates in 1925. The players' expenses merchandise sold by the various a like subscription to the Blue Jay. to injury by using only three first<br />\ngame has been arranged for De- will be paid by the Cleveland com- firms represented by the Turnc. For securing 15 or more sub- string men in tire game until the<br />\ncember 6th between two all-star mittee.<br />\nbull-Magill Store at the Barn, scriptions, a student will receive final minutes when they rushed in<br />\nteams from Eastern and Western<br />\nnamely, Van &amp; Co., Hess, Katz, both 5 additional subscriptions and most of their regulars to roll up<br />\n21 points in the last quarter.<br />\nuniversities. Cleveland authorities<br />\nThe Hub, Spaulding and Warner. a life-time subscription.<br />\nNOTICE<br />\nhave been making the arrangements<br />\nThe loss of Groves and Mcd. A prize yet to be determined<br />\nThe second prize will be a due bill<br />\nThere will be an organization<br />\nand have worked hard to make the<br />\nmeeting of the French CInb Frivalued at $15 and the third prize will be awarded to the student who Quade has so weakened the Maryday at one o'clock in Room 112,<br />\naffair a success.<br />\nwill be one worth $10. These obtains the highest number of sub- land backfield that Curly Bird has<br />\nGilman Hall.<br />\nIn the West, a great deal of enscriptions.<br />\nContinued on page 4, col. I<br />\nContinued on page 4, col. 1.<br /><br />\nTHE JOHNS HOPKINS NEWS-LEI-1ER, NOVEMBER 14, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communication,s<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nAUGER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br /><br />\nHomewood 0100<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br /><br />\nTERCOLLEGIATE<br />\nCLIPPINGS<br />\nN. Y.<br />\nSophomores presented<br />\na paradoxical welcome to the<br />\nFreshman class on the last day of<br />\nOctober. After the annual \"ducking party\" the Sophs suspended<br />\nhazing and entertained the first<br />\nyear men at a smoker.<br />\n*<br />\nPenn State has a veteran rooter<br />\nwho has followed the fortunes of<br />\nthe Nittany Lions for 40 years.<br />\nHe is Andy Lytle, over 80 years<br />\nold, who until three years ago<br />\nhadn't missed a Penn State game,<br />\nat home or away, since the first<br />\nState team journeyed to Lewisburg to play Bucknell in 1881.<br />\nFor the past three years Andy<br />\nLytle has been too weak to travel<br />\nbut has witnessed every home<br />\ngame.<br />\n*<br /><br />\nThe Ring-tum Phi of W. and<br />\nL. states that Harvard and OxCirculation Manager<br />\nAssociate Editors<br />\nford will meet in the first internaBENJAMIN T. ROME, '25<br />\nOTHO J. KELLER, III, '26<br />\ntional and intercollegiate chess<br />\nARTHUR L. NELSON, '26<br />\nmatch to be played by radio durJunior Editors<br />\nAssistant Business Managers<br />\ning the latter part of December.<br />\nEDWARD 0. MICHEL.<br />\n- , '26<br />\nG. DONALD GIESKE, '25<br />\nJAMES YOUNG, '25<br />\nThe W. and L. paper states that<br />\nHENRY R. TURNBULL, '26<br />\nJ. JACKSON KIDD, '26<br />\nAmerican colleges have in the<br />\nA. RISLEY ENSOR, '26<br />\nT. STRAN SUMMERS, '25<br />\nJ. HENRY JARRETT, '27<br />\npast<br />\nhad several matches by radio,<br />\nHEYWARD E. BOYCE, JR., '27<br />\nCHARLES F. REESE, '27<br />\n'26<br />\nSAUERWEIN,<br />\nbut<br />\nthis<br />\nis the first time an AngloT.<br />\nROBERT<br />\nW. BARNES HALL, '27<br />\nARTHUR SWANSON, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br />\nAmerican contest has been arranged.<br />\nHa-verford will follow suit later<br />\nMember Southern Intercollegiate Newspaper Association<br />\nin •the winter when a four man<br />\nteam will compete with Oxford<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md. under the same conditions. The<br />\nrelaying is to be done entirely by<br />\namateurs.<br />\n* * *<br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 14, 1924<br />\nHamlin Garland, the well<br />\nknown American author, and Dr.<br />\nGeorge Boas, of the Hopkins PhiCONGRATULATIONS<br />\nlosophy Department, are among<br />\nThe election of the four new men to membership in the °mkt:on the speakers whO have lectured at<br />\nGoucher this fall.<br />\nDelta Kappa Honorary Society is a true reflection of the wisdom<br />\n* * *<br />\nexercised by the fraternity in choosing recognized leaders. Each of<br />\nSix fraternities and eight sorothese men has distinguished himself in one or more of the five heads rities of the University of Nebraswhich make a man eligible for election, namely, social leadership, ka have been blacklisted because<br />\nathletics, scholarship, publications, and non-athletic activities. Each of \"wild\" parties, according to an<br />\nhas rendered conspicuous service to his Alma Mater and in recogni- article in The Beacon, Rhode<br />\ntion of this he has received, according to undergraduate opinion, the Island State College weekly. The<br />\nSenate Committee on Student Orgreatest honor which a Hopkins man can obtain during his college<br />\nganizations blacklisted the 14<br />\ncareer.<br />\nchapters because of \"sneak night\"<br />\nparties in road houses.<br />\nsmall,<br />\nalthough<br />\nthree<br />\nelected<br />\nis<br />\nof<br />\nmen<br />\nnumber<br />\nthe<br />\nThe fact that<br />\nper cent of the undergraduate body are eligible for admission, is significant of the high standard of 0. D. K. This fact in itself should HULLABALOO PHOTOS BEGIN DECEMBER 1<br />\nserve as a stimulus to inspire undergraduates to work harder to<br />\nPhotographs for the 1925 Hulachieve this singular honor.<br />\nlabaloo will be taken beginning<br />\nheartiest<br />\ncongratulations<br />\nto<br />\nextend<br />\nwith the week of December 1.<br />\nThe News-Letter wishes to<br />\nGroup photographs and those of<br />\nthe newly elected members.<br />\nSeniors will be taken at that time,<br />\nfor a period of four days. The<br />\ndate was originally set for next<br />\nweek, but a conflict in the phoThe new 0. 1). K. Songbook contains several son'gs which, however stirring,<br />\ntographers'<br />\nschedule prevents the<br />\nsuggests<br />\nore hardly known to many undergraduates at Hopkins. The News-Letter<br />\nthat these songs be learned as soon as possible so that they may be used at the Hop- Hopkins pictures being taken<br />\nkins-Maryland game on Thanksgiving Day.<br />\nthen. A schedule is posted in the<br />\nBarn of the Seniors and schedules<br />\nof the groups will be posted in the<br />\nBarn and at the Post Office. NoTHIRTEEN DAYS REMAIN<br />\ntices wil also be sent to each man<br />\nLast year on Thanksgiving Day Hopkins showed prejudiced and to each group, notifying them<br />\nBaltimore that a team, light, fast, alert, a product of the Van Orman when their respective pictures are<br />\nmachine, could hold and even outplay a bigger heavier team. Sport to be taken.<br />\nMeetings of the editorial staffs<br />\nwriters prophesied the Black and Blue would have to fight to hold<br />\nare being held every Thursday<br />\ndown the score. Football fans gave Maryland the odds in every<br />\nnoon in the Blue Jay office. Busidepartment of the game. But Hopkins showed 'em, and the Uni- ness staff meetings are being held<br />\nversity of Maryland was fortunate in holding the score 6-6. The every Friday noon in the same<br />\nVarsity eleven, though greatly outweighed, showed the sporting place and there are openings roi<br />\nworld they were not outclassed.<br />\nmembers on this staff.<br />\nFleet-McGinley Company, of<br />\nThe Drexel game tomorrow is the last one before the big clash<br />\nof the season—the Hopkins-Maryland game on Thanksgiving Day. Baltimore, are the printers of the<br />\nOnly thirteen days remain in which to arouse \"pep\" to support the book this year, and not the Sun<br />\nteam on its-journey to the State Championship. It is up to us, in- Printing Company as an article in<br />\n.dividually and collectively, to give all we have to support a Cham- the News-Letter stated a week<br />\nago.<br />\npionship team. What are we going to do about it?<br /><br />\nPETERS, REIBLICH, YATES<br />\nSCORE IN INTRAMURAL<br />\nRIFLE MATCH<br />\nSchedule for Year Announced. Hopkins Joins Intercollegiate Ass'n.<br />\n11 Matches Scheduled<br /><br />\nFirst, second and third prizes<br />\nfor the winners of the first intramural match of the season held by<br />\nthe Rifle Club last Friday went to<br />\nB. G. Peters, G. K. Reiblich, and<br />\nJ. M. Yates, respectively. There<br />\nwas plenty of competition for these<br />\nsharpshooters, for over 60 men<br />\nturned out for the match. Lieutenant Sherwood stated enthusiastically that the shooting was exceptionally good. Peters and Reiblich<br />\nscored 185, whereas Yates was<br />\nright on their heels with a score of<br />\n183.<br />\n\"Proficiency in markmanship is<br />\nthe object sought,\" Lieutenant Sherwood said. \"Participation in these<br />\nintra-mural matches will give the<br />\nnew men practice in shooting under match conditions, and will pave<br />\nthe way for a successful season.<br />\nPrizes are offered - to give a man a<br />\nlittle steadier aim.\"<br />\nSecond Match Today<br /><br />\nThe second day match of the intramural series will be held today<br />\nas usual in the north loft of Gilman Hall from 1 to 6 P. M. This<br />\ntime, when the smoke has cleared<br />\naway, five prizes will be awarded.<br />\nConditions of the match are as<br />\nfollows:<br />\nPosition: Kneeling; one target,<br />\n2 shots on each bull's-eye, including the sighting bull.<br />\nEligibility: Open to all members<br />\nof the club.<br />\nRifles: Any rifle, cal. 22.<br />\nAmmunition: Any cal. 22.<br />\nPrizes: First, $5.00; second,<br />\n$3.00; third, $2.00; fourth, $1.00;<br />\nfifth, 100 rounds of ammunition.<br />\nTeam practice is held on Tuesdays, Wednesdays, and Fridays at<br />\n4 P. M.<br /><br />\n•<br /><br />\nDamon—<br />\n\"Hey, there!<br />\nof mine?\"<br />\nPythias—<br /><br />\nAren't<br /><br />\nyou a friend<br /><br />\nI'd do anything<br />\nIn the world for you. Yes, any-<br /><br />\n\"I certainly am.<br />\nthing!\"<br /><br />\nDamon—<br />\n\"All right—prove it!<br /><br />\nGive me back<br />\nthat Eldorado pencil you borrowed<br />\nlast night.\"<br /><br />\nmasterdrawbigpencit<br />\n17 leads—all dealers<br /><br />\na<br /><br />\nSANFORDS<br />\nFOUNTAIN PEN INK<br /><br />\nWill Improve the Action<br />\nof Any<br />\nFountain<br />\nPen<br />\n•<br /><br />\nrd11111111<br />\nililloffionolitl<br />\nsa1i0 ,5<br />\nNK<br />\n' fOUNTAINPENIG<br />\nrAsy<br /><br />\nALL<br />\nCOLORS<br /><br />\nFLOV/1,10(<br /><br />\nB<br /><br />\nALL<br />\nSIZES<br />\n•<br /><br />\n\"The Ink That Made<br />\nThe Fountain Pen Possible\"<br /><br />\nThe targets of matches which are<br />\nnot fired shoulder-to-shoulder will<br />\nbe exchanged by mail; fifteen men<br />\nwill shoot, the ten best targets being counted.<br />\nThe Rifle Club has joined the<br />\nIntercollegiate Rifle Association, in<br />\nconnection with which eight matches<br />\nwill be fired after March 1st. The<br />\ncolleges in the Hopkins division<br />\nare:<br />\nGettysburg, Georgetown, Pitts •<br />\nburgh, Carnegie Tech, Cincinnati,<br />\nGeorge Washington, Kentucky,<br />\nProspects Bright<br />\nProspects for a team equally as North Carolina State.<br />\ngood as last year's are bright. Four<br />\nIf Hopkins is the victor in this<br />\nletter men, Manahan, Steck, Mar- division, the winners of other ditin, and Muir, form the nucleus, visions will be matched. with the<br />\nwith several new men on hand to Homewood team.<br />\ntake the places of those who gradThe best members of the Rifle<br />\nuated last year. Practice is being Team will be sent to the National<br />\nheld in the north loft every Tues- Rifle Association contest to compete<br />\nday, Wednesday, and Friday after- for individual prizes.<br />\nnoon at 4 o'clock, under the direcFewer Ushers Needed<br />\nA sad bit of news was told Mation of Lieutenant Sherwood.<br />\nThe club begins the busiest sea- jor Hoisington last week. It will<br />\nson of its career; with many inter- be remembered that the R. 0. T. C.<br />\ncollegiate matches, club contests, unit has been invited to act as ushtrials ers at the Army-Navy game. A<br />\nand<br />\nshoulder-to-shoulder<br />\nscheduled for the coming winter, it complication has arisen, however,<br />\npromises. to give its members the in that, out of the unit of 315 men,<br />\nlargest number and most impor- only 250 will. be needed. These<br />\ntant matches that the club has ever will be selected in the order of seniority in the service, and by lot.<br />\ntaken part in.<br />\nThe<br />\nmen who are .not chosen will<br />\nThe schedule for matches with<br />\nbe<br />\ndesignated<br />\nas alternates, and in<br />\nother colleges is as follows:<br />\nthe<br />\nany<br />\nof<br />\noriginal men are not<br />\ncase<br />\nDecember 6—University of Pennpresent,<br />\nthe<br />\nalternates will be ready<br />\nsylvania (pending).<br />\nJanuary 1—Princeton (pending). to take their places. In this way,<br />\nJanuary 17—Virginia Poly and everyone will have at least a chance<br />\nof seeing the game.<br />\nCarnegie Tech.<br />\nJanuary 24—University of MinneCHICAGO ALUMNI ORGANIZE<br />\nsota (pending).<br />\nConsinued from page 1<br />\nInstitute.<br />\n7—Drexel<br />\nFebruary<br />\nM.<br />\nGrimm,<br />\nP. L. Highbarger, Di<br />\n-shoulFebruary 14—A shoulder-to<br />\nJ.<br />\nT.<br />\nHatfield,<br />\nDr. L. L. Iseman.<br />\nColder match with St. John's<br />\nDr.<br />\nH.<br />\nP.<br />\nDavidson,<br />\nDr. 0. F.<br />\nlege.<br />\nLong,<br />\nDr.<br />\n,an,<br />\nRobert<br />\nLonerpC.<br />\nFebruary 21—Georgetown, shoulDr.<br />\nTanH.<br />\nH.<br />\nG. Loomis, Dr. K.<br />\nder-to-shoulder.<br />\nFebruary 21—University of Cali- nenbaum, Halsey H. Matteson,<br />\nAnton S. MReason, H. W. Price,<br />\nfornia.<br />\nFebruary 28—Washington Univer- Lessing Rosenthal, William L.<br />\nRoss, Dr. John A. Scott, Dr. E. A.<br />\nsity.<br />\nSmith,<br />\nA. E. Brooks, Dr. 0. R.<br />\n14—University<br />\nof<br />\nGettysMarch<br />\nSellers,<br />\nCliaton L. White, Dr. R.<br />\nburg, shoulder-to-shoulder.<br />\nE.<br />\nZiegler,<br />\nand Rev. Stuart D.<br />\nMarch 21—University of MaryWhite, Dr. 0. T. Schultz.<br />\nland, shoulder-to-shoulder.<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, NOVEMBER 14, 1924<br /><br />\nNo well dressed college man is<br />\nwithout one. It's the original,<br />\ncorrect slicker and there's nothing assmart orsensible for rough<br />\nweather and chilly days.<br />\nMade of famous yellow waterproof<br />\noiled fabric. Has all-'round strap on<br />\ncollar and elastic at wrist-bands.<br /><br />\nClasp - closing style<br />\nButton-closing style<br />\nStamp the correct name in your<br />\nmemory, and buy no other. The<br />\n\"Standard Student\" is made only<br />\nby the Standard Oiled Clothing Co.,<br />\nNew York. Slip one on at<br /><br />\nENGINEERS AND STUDENTS<br />\nOF HYGIENE INSPECT<br />\nFILTRATION PLANT<br />\nWashington, Burnt Mills, Hyattesville<br />\nand College Park Visited. Washington's Slow Sand Plant<br /><br />\nREVERIES<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br /><br />\nBY OLD ALUMNUS<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nOld Johnny Hopkins is nearing<br />\nits fiftieth anniversary. That<br />\nseems to be the keynote of the<br />\ngreeting on every tongue as the<br />\nOld Alumnus meets occasional<br />\nfellow-alumni, particularly those<br />\nof the latter who live at a distance<br />\nfrom Baltimore. From the creeping, tottering, old-timer, who<br />\nspeaks fondly of \"Little RO3S<br />\nStreet\" to the most recent acquisition from the class of '24 who<br />\nlooks with suspcion upon Phi<br />\nBeta Kappa comes the same sentiment that \"something must be<br />\ndone about it.\"<br />\nStrangest thing about it is that<br />\nthe great bulk of enthusiasm is<br />\nnot confined,to the ranks of the<br />\nboisterous A. B.'s but is shared<br />\nequally by the M. D.'s and Ph.<br />\nD.'s who owe a previous allegiance to a \"first love.\" It would<br />\nprove interesting to hear from<br />\nsome of them, I'm sure.<br />\nSaw old \"Bill\" Ross, A. B. '99,<br />\njust the other day. Bill is now a<br />\nvery successful Chicago banker,<br />\nbut he's still dead interested in<br />\nthe old college. He has showed<br />\nthat by his work in Pittsburgh,<br />\nCleveland and Chicago, where he<br />\nbrought into being Hopkins alumni associations. Founded within<br />\nthe past two decades, they have<br />\nperhaps faded, as the demon organizer withdrew his enthusiastic<br />\nguidance to new fields. Bill is<br />\nnow secretary of the association<br />\nin Chicago and is much in favor<br />\nof an anniversary celebration.<br />\n*<br />\n*<br /><br />\nFiltration plants of practically all<br />\nessential types were viewed last<br />\nAlondav, November 10, when seniors of the civil engineering department combined with members of<br />\nthe School of Hygiene and PubHealth and visited Washington, \"0. D.\" Collins, who joined the<br />\ndegree-holder ranks in '23 is<br />\n]). C. Besides the large filter at<br />\nstrongly in favor of a celebration.<br />\nthe capital, several smaller plants<br />\n\"0. D.\" is with the Telephone<br />\nat the nearby towns of Burnt Mills, Company in Washington,<br />\nand is<br />\nHyattsville and College- - Park, in trying to rally the D. C. boys to<br />\nregular alumni luncheons, showAlaryland, were inspected.<br />\ning<br />\nthe same old \"pep\" that made<br />\nWashington claims one of the<br />\nhim<br />\na campus leader.<br />\nlargest plants in the country of the<br />\n* * *<br />\n'slow sand\" type, the normal CaPacity ranging from 65,000,000 to<br />\nHad a chat with Clarence Baer<br />\n75,000,000 gallons of water a day. the other day. Clarence met us<br />\nThe filter beds of this plant cover in the Med School and took his<br />\nan expanse of 29 acres, yet so effi- M. D. in 1905 but he sure got a<br />\ncient is the operation and cleaning kick out of every day's work at<br />\nof the sand that no new material the old plant. Clarence, you may<br />\nhas been purchased for more than recall, fell ill one day, on a Pittsa score of years. The filter plant burgh-Baltimore train and was<br />\nProper is entirely under govern- rushed unconscious to Hopkins<br />\nmental control, with the actual dis- Hospital.<br />\nHe was amazed to<br />\ntribution of water to the consumers awake in such familiar surroundunder supervision of the District ings and was greatly amused<br />\nauthorities.<br />\nwhen the interne, a fellow-stuAt Burnt Mills a small rapid dent, made him write his<br />\nown<br />\nsand plant of approximately 1,000,- \"history.\" Doc. Baer is practicing<br />\n000 gallons a day capacity showed medicine these days in Milwauthe inner workings of a typical big<br />\nkee.<br />\neitY plant of this nature in much<br />\nSpeaking of Milwaukee, I see<br />\nthe same fashion that a small workthat Johnny Defandorf, electrical<br />\nmodel of a machine illustrates engineer of '17, is secretary of the<br />\nthe essential principles of its par- alumni association out there.<br />\nHis<br />\n!nt• . A comprehensive review of brother, Marion, is with the Buthe plant was made, from the point reau of Standards<br />\nin Washington.<br />\nWhere water is taken from the He graduated in engineering<br />\nin<br />\nnearby stream; and pumped into<br />\n'21 and is a live wire at the Buthe coagulating and sedimentation<br />\nreau.<br />\nbasins, until it was ready to go to<br />\nthe consumer, as a clear, sparkling<br />\neffluent.<br />\nCalifornia's lure has claimed anA similar plant, on a larger scale, other Hopkinsian. Pere Wickes,<br />\nWas inspected at Hyattsville, and '94, has gone from the Middle<br />\nfinally at College Park the open West to Paso Robles to \"carry<br />\nsand filter of the University of on\" in the insurance business.<br />\nMaryland was given a brief survey. Young George Bahlke, the flyThis is the only open sand filter in ing fish, who passed his freshman<br />\nthis section of the country.<br />\nyear at Hopkins, last year, is out<br />\n„4<br />\n,<br /><br />\n3<br /><br />\nWE INSULT PLAYERS<br /><br />\nEditor of the NEWS-LETTER:<br />\nThe idea of applauding when<br />\none of our football players is lying<br />\non the ground suffering seems assinine to me. I have seen many<br />\ncolleges play football games and<br />\nhave been to many fields where<br />\nHopkins teams have not been one<br />\nof the contenders, but never have<br />\nI seen any cheering section rise and<br />\napplaud when one of its classmates<br />\nwas lying on the ground suffering.<br />\nWhen a man is in this condition h<br />\nis no time for applause, when he<br />\nhas risen to his feet is the moment<br />\nto lend him a hand. When he is<br />\non his back the best way to help<br />\nhim get up is by remaining as quiet<br />\nas possible.<br />\nThe idea of a cheer for him as<br />\nsoon as he has been hurt would be<br />\nin order, but when it is seen that<br />\nhe is definitely injured, clapping is<br />\nno way to help the man. I have<br />\nhad many men visiting Hopkins<br />\nfrom other colleges who have had<br />\nthe same idea on the subject, and<br />\neven some felt it an insult to applaud when their men were injured.<br />\nI wish to call this to the attention<br />\nof the cheer leaders and believe it<br />\na subject fit for open discussion and<br />\nthat a definite decision should be<br />\narrived at.<br />\nYours truly,<br />\nA HOPKINS BOOSTER.<br /><br />\nToday — men and women know<br />\nhow to keep their hair in place<br />\nsmart people gather —<br />\nIATHERE<br />\nin college and out —you'll not<br /><br />\nfind one case of unkempt hair!<br />\nIt wasn't always so.<br />\nStacomb has made possible the<br />\nfashion of smooth hair among women. It keeps men's hair looking<br />\nalways just as they want it to look.<br />\nA light, velvety, invisible cream<br /><br />\nEE<br /><br />\nOFF E<br /><br />\n—non-staining and non-greasy.<br />\njars and tubes, at your college<br />\ndrug store. (Now also in liquid<br />\nform.)<br />\nIn<br /><br />\n•,`<br /><br />\n•.•<br /><br />\nKEEPS THE HAIR<br /><br />\nIN PLACE<br /><br />\nDept.ftl<br />\nCity<br />\nLaboratories, Inc.,<br />\nYork<br />\ngenetout<br />\n---Standard 13th St., New<br />\ncharge, a<br />\ntacofree of<br />\n113 VJesttne,<br />\nd of Srrib. ....\"..<br />\nPlease sea<br />\n_<br />\n................. .........<br />\nsample tube<br />\nIS<br /><br />\nI<br /><br />\nName.<br />\n.....<br />\n......<br />\n...<br />\nAddress....<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nXCKCornerayelie and Cutaw Sts.<br />\n-Where Wholesale and Retail Districts Meet\"<br /><br />\nLAXITY AMONG FROSH<br /><br />\nof the NEWS-LETTER:<br />\nThere is too much laxity among<br />\nthe Freshmen. I understand that<br />\nand individuality is offered here at prices that are not<br />\na committee has been appointed to<br />\ncannot be underquoted by any house at any time.<br />\nand<br />\nhandle them but the number of<br />\n(Besides the reputation of an old-established firm<br />\nFreshmen is almost too large to be<br />\nis back of each sale with a guarantee.<br />\ncared for by a few Members of a<br />\ndelegation of Sophomores. Last<br />\nSaturday only a small percentage<br />\nturned out for the cheering section.<br />\nTheir interest lags and their re- FURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nquirements are not enforced.<br />\n343 NORTH CHARLES STREET<br />\nIf the upper classmen continue<br />\nto pass by without enforcing the<br />\nregulations, leaving it entirely to<br />\nKAPPA PHI<br />\nthe Soph committee, the first year<br />\nFRATERNITY<br />\nmen will soon consider the rules as<br />\nDANCE<br />\nonly printed words. I see them<br />\nwalking on the grass, smoking in<br />\nSouthern Hotel<br />\nthe halls, wearing civilian hats on Presentation<br />\nof Trophy to Polytechnic<br />\nthe campus, without Freshmen butVarsity Team<br />\ntons, and exercising too much freeBy Tau Chapter<br />\ndom. It is being noticed and talked<br />\nAdmission by Couple Only<br />\nabout, but no one takes it upon<br />\nNovember 15, 1924<br />\nSHERWOOD BROTHERS, INC.<br />\nthemselves to enforce Freshmen reHopkins Students Cordially<br />\nstrictions because a committee is<br />\nInvited<br />\nSONCgINNINE1=7NRNINP.WININNINIZEINO<br />\nsupposed to handle them.<br />\nHopkins will need a much better showing at the Maryland game<br />\nBaltimore's Best Store<br />\nand it is up to Freshmen officers to<br />\nsee that their men turn out—or<br />\nHOCHSCHILDKOHN<br />\nCO.<br />\nsuffer the consequences.<br />\nYours truly,<br />\nHoward and Lexington<br />\nISIDORE O'BRIEN.<br />\nEditor<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\n• i• r:4<br /><br />\n•I'0144•I•14121.1..1•14<br /><br />\nq•I 1E4144414 *41.14<br /><br />\nIE<br /><br />\n2IEZO111<br />\nHaDUOR OEM<br /><br />\n8c,<br /><br />\nat Northwestern University'. Pity SHIRTS<br />\nNECKWEAR<br />\nhe couldn't have stayed to bring<br />\nHopkins further natatorial honors.<br />\nWell, that's about enough gos421 N. HOWARD ST.<br />\nsip from an old-timer (and I do HOSIERY<br />\nGLOVES<br />\nfeel aged since learning that Jimmy (W. Norman) Brown, '12, is<br />\nORDERS RECEIVED FOR<br />\nthe daddy of a two month old<br />\nboy!<br />\nHope to see Cap'n Tom's Blue<br />\nTransfer &amp; Baggage Express<br />\nDevils live up to last year's mark<br />\nAUTOMOBILE SERVICE<br />\nthis Thanksgiving.<br />\nPHONE, HOMEWOOD 6886<br /><br />\nLeFranc &amp; Ault<br /><br />\nCOGGIN'S<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br /><br />\n.<br />\n''<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 14, 1924<br /><br />\nFRESHMAN DEBATING TEAM<br />\n\"IF\" TO BE PRESENTED BY JAY SKETCHES DUE<br />\nPLAYSHOP ON NOV. 20<br />\nPICKED AT TRY-OUTS<br />\nDECEMBER FIRST<br />\nCast Picked for First Production. Art<br />\nDepartment Created<br /><br />\n111111111<br /><br />\nBRANCH<br />\nAT THE BARN<br /><br />\nRehearsals for Dunsany's \"If\" All sketches for the Black and<br />\nhave been in progress for two weeks Blue Jay art contest must be Niles, Parker, Wyatt and Margolis Are<br />\nPicked to Represent the<br />\nin the Campus Theater and the<br />\nFreshman Class<br />\nturned in to the office by Decemproduction promises to be one of<br />\nber 1. A silver loving cup will be<br />\nAbout a dozen candidates for<br />\nthe most elaborate and interesting<br />\nthe<br />\nfresman debating team met<br />\nthat the Playshop has ever under- awarded to the man wielding the<br />\nNovember 11, at noon<br />\nTuesday,<br />\ntaken, according to Dr. Small, who cleverest pencil up to and includfor<br />\ntheir try-outs, which were conis President of the Playshop this ing the third from the last issue of<br />\nby Professor French, asducted<br />\nyear. Not only is the dramatic the magazine. This cup, along<br />\nTOM MAGILL,<br />\nDOUG TURNBULL<br />\nsisted<br />\nby Lawrence Willison,<br />\nwork of the play being enthusias- with<br />\nRepresentatives<br />\nManager<br />\ntwo others offered by the president of the Debating Countically carried on, he says, by the<br />\neditorial and business depart- cil.<br />\nmembers of the cast under the caThe candidates were called<br />\npable direction of Mr. Harry Pou- ments, will be presented at the ander, but also \"the Art Department nual banquet of the Black and upon to give a three minute<br />\nis planning to carry out the light- Blue Jay by a board of judges, speech on the negative side of<br />\n2819 Greenmount Avenue<br />\ning and scenic effects in such a composed of the present Blue Jay the question, \"Resolved,. That<br />\n(Opposite Ilchester)<br />\nBaltimore should establish a mumanner that they will compare faBoard of Control. This contest is<br />\nnicipal college.\" At the end of A high-grade Haberdashery Shop<br />\nvorably with the best work done in<br />\nin<br />\nconnection<br />\nwith<br />\nnext<br />\nissue<br />\nthe<br />\nWithin Walking Distance of the<br />\nthree minutes Professor French<br />\nthe Little Theater.\"<br />\nUniversity<br />\nwhich<br />\nand<br />\nBlue<br />\nthe<br />\nBlack<br />\nJay<br />\nof<br />\nasked each candidate to rebutt a<br />\nThe second and third acts of \"If\"<br />\npoint, which he gave for the af- UPTOWN<br />\nare laid in Persia and special treat- will appear on Decembei- 12.<br />\nDOWNTOWN<br />\nfirmative. After the candidates QUALTIES<br />\nment will be required in the way<br />\nPRICES<br />\n222 &amp; 224 W Baltimore St.<br />\nof costumes and settings of an ex- INTERFRATERNITY BOARD had all been heard, some were<br />\nOPEN EVENINGS<br />\notic nature. However, despite the TO SEND REPRESENTATIVE called back to give another mingreat variety of episodes and<br />\nute of their speech. After conT NEW YORK<br />\nscenes, the play will be given in its<br />\nference<br />\nwith Willison, ProfesSor<br />\nJ. F. APPLE CO.<br />\nAt the Inter-Fraternity Board<br />\nentirety, not excepting the elabFrench announced that the FreshMANUFACTURING<br />\nJEWELERS<br />\nmeeting on last Monday, there<br />\norate banquet scene.<br />\nman Debating Team consisted of<br />\nLANCASTER, PA.<br />\n\"The parts, which are about fif- were no violations of the rushing D. C. Niles, chairman; W. G. ParClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nteen in number, have been happily agreement brought up before the ker, C. H. Wyatt and P. Margolis.<br />\nStationery,<br />\nInvitations,<br />\nProgrammes<br />\ncast and there is plenty of oppor- board. In past years this has not<br />\nThe Freshman-Sophomore deSOPHOMORES<br />\n\"MAKERS<br />\nOF<br />\nTHE<br />\nVARSITY SEALS\"<br />\ntunity for good acting,\" Dr. Small been the case after the conclusion bate will be held December 11 at<br />\nFRESHMEN<br />\nsaid. It was erroneously stated in<br />\nof the rushing season; and \"that the asembly. \"The freshmen,\"<br />\nthese columns recently that Whitesaid the chairman of the team,<br />\nthee should be no violations of<br />\nford Stull and Miss Georgia GossR. G. Loy &amp; Company<br />\n\"are going to work to win, ind<br />\nman were members of the cast. the agreement this year indicates are goirg to win'.'<br />\n(Robert G. Loy)<br />\nStanley Worden, Donald Kirkley, a broadening fraternity spirit at<br />\nand George McCandles have the Hopkins,\" M. R. Gilpin, president<br />\nPHARMACISTS<br />\nRESTAURANT<br />\nleading male roles. Important feNEW BOOKS<br />\nof the Council, is reported to have<br />\nUNIVERSITY PARKWAY<br />\nmale parts are taken by Miss Estelle<br />\nContinued from page 1<br />\n1817 N. Charles St.<br />\nsaid.<br />\nAt Charles St.<br />\nMitchell, Miss Virginia Handy,<br />\nTen distinct forms are recognized,<br />\nThe<br />\nmain<br />\nbusiness<br />\nof<br />\nthe<br />\nmeetAlMiss<br />\nFay<br />\nMiss May Gould, and<br />\nbesides numerous different styles<br />\nlen. Minor parts are filled by Men- ing was the decision to send a of draping. Among the. outstandCollege and Fraternity Stationery<br />\nOpen All Hours<br />\nBanquet and Dance Cards, Invitations<br />\ngers, Wales, Keller, L'Allemand, representative to the Inter-Fra- ing feature of the books are diaNeuberger, R. Kirkley, Hambur- ternity Board Conference in New grams or drawings giving the<br />\nJAS. H. DOWNS<br />\nger and Mugford.<br />\nshape<br />\neach<br />\nform<br />\nof<br />\nof<br />\ntoga,<br />\nillusENGRAVER PRINTER STATIONER<br />\nYork city, on November 28 and<br />\nNear Your Campus<br />\nThe play will be given at the<br />\ntrations of the process of drap229 N. CHARLES ST.<br />\nCampus Theater on November 20. 29. Two men were nominated as ing on the living model, and pracrepresentatives, Daniel E. Klein, tical suggestions to teachers and<br />\nLATEST STYLES AND FORMS<br />\nSCABBARD AND BLADE<br />\nlast year's representative, and students regarding the making ot<br />\nINITIATES FOUR<br />\nEngraved<br />\nBaird Fonda. These men will be the toga. Many prominent scholAt a meeting of the Scabbard<br />\nars who have personal knowledge<br />\nWEDDING INVITATIONS,<br />\nand Blade, honorary military so- voted on at the next meeting.<br />\nAND<br />\nWilson's<br />\nwork<br />\ntestify<br />\nANNOUNCEMENTS<br />\nof<br />\nMiss<br />\nciety, on Monday, November 10, The Inter-Fraternity Board<br />\nCARDS<br />\ninestimable<br />\nVISITING<br />\nvalue.<br />\ngladly<br />\nits<br />\nto<br />\nthe following men were initiated: Conference was initiated last year<br />\nTEA—<br />\nRaymond Ashley, William Dra- by the Inter-Fraternity ComerSAMUEL H. KIRBY LUNCHEON—AFTERNOON<br />\nDINNER<br />\nENGRAVER<br />\nper, George Hess and Charles ence which is graduate represenWATER-PROOF<br />\nSamples and Prices on Request<br />\nBanquets &amp; Receptions<br />\nMuir. The new members will tatives from each national fraterBobby—Hi, there! Don't spit<br />\nBALTIMORE CAKES —ROLLS —SANDWICHES<br />\n42 SOUTH ST.<br />\nbe publicly congratulated by Pres- nity.<br />\non the floor.<br />\nUndq- the auspices of this conident Goodnow at a review in the<br />\nGus—Smatter, floor leak?<br />\nference 36 representatives from as<br />\nnear future.<br />\n—Fentonian.<br />\nmany colleges met at Hotel Pennsylvania, New York, on the FriDREXEL MEETS HOPKINS<br />\nContinued on page 3, col. 3<br />\nday and Saturday after ThanksEXPORTS<br />\nMOUNT VERNON PLACE<br />\nshifted , Supplee, who made the giving. The conference is for the • Prof—What arc the exports of<br />\nMETHODIST<br />\nEPISCOPAL<br />\nsecond All-American team at end purpose of discussing practical Virginia?<br />\nCHURCH<br />\nlast year, to the position of quar- inter-fraternity board problems.<br />\nStude—Tobacco and livestock,<br />\n(At the Washington Monument)<br />\nterback. With the terminal of<br />\nsir.<br />\nREV. OSCAR THOMAS<br />\nthe line thus weakened by a subLACROSSE SCHEDULE NEARS<br />\nProf—What kind of livestock?<br />\nOLSON, D.D.,<br />\nstitute, the fast Yale backs took<br />\nCOMPLETION<br />\nMinister<br />\nStude—Camels.—Shadows.<br />\nshortcoming<br />\nthis<br />\nadvantage of<br />\nThat the lacrosse squad is alSunday<br />\nServices of Worship<br />\nand raced around the end for gain<br />\nready preparing for the stiff, in11 A. M. and 8 P. M.<br />\nafter gain.<br />\nteresting schedule being arranged<br />\nThe Sunday afternoon -at home.<br />\n'<br />\nPRIATERS<br />\nBUIDEREllgRAUERS<br />\nDrexel, however, must not be<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nweak teeth<br />\nfor<br />\nit,<br />\nis<br />\nshown<br />\nby<br />\nthe<br />\napMaryland<br />\nforgotten<br />\nas<br />\nRoom is a social occasion that brings<br />\nand swollen jaws of some who<br />\ntogether the student groups from Hopproaches. More than once overkins, University of Maryland, Goucher.<br />\nhave taken part in the tag games<br />\nconfidence has proven the stumPeabody, and other schools of Baltifall<br />\n\"wall.\"<br />\nAs<br />\nplayed<br />\nabout<br />\nthe<br />\nmore.<br />\nbling block for a more powerful<br />\nEworth League at 7 P. M. and the<br />\npractice progresses possibilities<br />\nteam than Hopkins' and Drexel,<br />\nBible class at 10 A. M. are built parintercolcapturing<br />\nthe<br />\nfor<br />\nagain<br />\nticularly with the needs of the young<br />\nno doubt, has a few tricks up her<br />\npeople in mind.<br />\nbecome<br />\nbrighter.<br />\nThe<br />\nlegiate<br />\ntitle<br />\nsleeve to puzzle the Blue Jays.<br />\nconsensus of opinion is that tag is<br />\nJUNE WEEK FUNDS<br />\nplayed more frequently this year<br />\nContinuedfrom page 1<br />\nthan it was last fall.<br />\nTelephone, Madison 4722<br />\nVernon 4986<br />\nGraduate Manager Keyes and<br />\nprizes will beAfvarded at the first<br />\nCotillon on Friday, December 12, Manager Baker are working on<br />\n\"Say It With Flowers\"<br />\nat the Maryland Casualty Club the schedule now. As soon as the<br />\nTHE J. W. HOWARD CO.<br />\nHouse.<br />\nexcitement over football has died<br />\nFrom time to time throughout down a little it is the intention of<br />\nPrinters of<br />\nDRAWING MATERIALS<br />\nthe year various methods for rais- the managers to place the entire<br />\nSURVEYING INSTRUMENTS<br />\ning money will be introduced. list of games before the public.<br />\ncrhe Johns Hopkins<br />\nThese campaigns replace the old Until then the fans will have to be<br />\nNEIDS,-LETTER<br />\n2422 Madison Avenue<br />\nsystem of Tag Days and June content with the assurance that<br />\nB altim ore, Md.<br />\nWeek Stamps which proved to be Hopkins will have a good .sched- LOM BARD and SOUTH STREETS<br />\n1822 N. CHARLES STREET<br />\nunsatisfactory.<br />\nule.<br /><br />\n1<br /><br />\ncia4.4s, ais,ctis,Slrcet<br /><br />\nErnest G.Lehnbach<br /><br />\nWARNER &amp; CO.<br />\nHatters<br /><br />\nHATS—OVERCOATS<br />\nNECKWEAR<br /><br />\nSENIORS<br />\nJUNIORS<br /><br />\nSt. Regis<br /><br />\nteftlart<br />\nZra *out<br /><br />\nJohns Hopkins Students Will Find A Welcome At<br /><br />\nSMITH &amp; CO.<br />\nFlorists<br /><br />\nI<br /><br />"}], "field_media_file": [{"target_id": 37909, "display": null, "description": null, "target_type": "file", "target_uuid": "61fd9865-a91d-4240-a296-360b0e5e9cfb", "url": "http://digital.library.jhu.edu/system/files/2022-03/13143-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13143, "target_type": "node", "target_uuid": "3dcd872c-39e5-4668-b4b5-2596249aad92", "url": "/node/13143"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d2fc8187-bf23-47d3-adca-5669d3d67073"}]}