{"mid": [{"value": 37051}], "uuid": [{"value": "e4f58df5-5d80-4c18-a6d2-626e545752f0"}], "vid": [{"value": 37051}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:58:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13160-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:58:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:58:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "=MI<br />\n<br />\nVOL. XXIX, No 29<br />\nPAUL BLANCHARD SPEAKS<br />\nON LABOR MOVEMENT<br />\nAT ASSEMBLY<br />\nExplains Demands of Labor Workers.<br />\nDelta Gamma Theta Wins<br />\nScholarship Cup<br />\n<br />\nfff<br />\n<br />\n5<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 6,1925<br />\n<br />\nDR. WIGHT, HONORARY<br />\nJUNIOR PRESIDENT<br />\nDr. Carol V. B. Wight has<br />\nbeen chosen by the Johns<br />\nHopkins Junior Class for the<br />\nposition of Honorary President. The honor was bestowed upon this professor<br />\nbefore the exams, in the furor<br />\nof which, notification was<br />\nprevented.<br />\nProfessor in<br />\nGreek and Latin, Dr. Wight<br />\nreceived his A. B. and Ph.D.<br />\ndegrees here.<br />\n<br />\nMANY VARYING OPINIONS<br />\nEXPRESSED ABOUT<br />\nNEW PLAN<br />\nGraduate Students Favor Idea While<br />\nMany Undergraduates Oppose<br />\nDr. Goodnow's Plan<br />\n<br />\nOFFICERS REELECTED<br />\nAT 0. D. K. MEETING<br />\nD. C. Turnbull, R. C.<br />\nTilghman, and E. Donaldson<br />\nwere elected respectively to<br />\nthe offices of president, secretary, and treasurer, at a recent meeting of Omicron<br />\nDelta Kappa. Dean Ames at<br />\nthis meeting suggested that<br />\na University calendar be<br />\nhung in the registrar's office<br />\nto prevent conflictions of<br />\ndates in University activities.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nMID-YEAR EXAMS EXACT<br />\nHEAVY TOLL OF ALL<br />\nCLASSES<br />\n<br />\nFreshmen and Sophornc=re-,:<br />\nHardest by Rigor<br />\nDr. Goodnow's proposed change<br />\nMr. Paul Blanchard, one of the<br />\nof InAructons<br />\nin the undergraduate departments<br />\nsecetaries of the League for InMore undergraduates have fallof Johns Hopkins has elicited varidustrial Democracy, was presenten<br />\nbeneath the stroke of the threeous responses from various groups<br />\ned to the student-body at the last<br />\nfailure rule this year than ever beon the campus. Graduate students,<br />\nAssembly as a man who has<br />\nfore,<br />\nwith<br />\nfew<br />\nexceptions,<br />\nare<br />\npresent reports show. All<br />\nin<br />\nfavor<br />\nworked as a laborer in one of the<br />\nof<br />\nthe<br />\nnew<br />\nplan,<br />\nundergraduates<br />\nfactories of the clothing industry<br />\nmarks are have yet not been reare, with equally few exceptions,<br />\nand studied the problem of the reported to the<br />\nOffice<br />\nagainst it, while the faculty and<br />\nlation between the employer and<br />\nbut a study of the marks posted,<br />\nalumni seem to prefer to keep their<br />\nthe employee. Apparently, he<br />\nhowever, show a huge mortality.<br />\npractices the unselfish, though DR. WIGHT PUBLISHES NEW opinions to themselves. At least<br />\nCOTILLION<br />\nAT<br />\nHELD<br />\nSECOND<br />\nReports as to the total casualthat is what is indicated by the<br />\nhazardous, doctrine that he<br />\nMARYLAND CASUALTY<br />\nBOOK OF POEMS<br />\nties of all the schools at HomeNEWS-LETTER'S canvass of the Unipreaches, for he is a graduate of<br />\nHALL<br />\nwood vary from one hundred and<br />\nversity's<br />\nopinions.<br />\n•<br />\nHarvard University. He talked \"Sir Thomas More and Other Verse\"<br />\nOrchestra<br />\nFurnishes<br />\nMusic<br />\nJay<br />\nBlue<br />\nfifty<br />\nto two hundred. ReinstatePrinted by J. H. U. Press<br />\nGraduates Favor Plan<br />\nfluently and pleasantly, and went<br />\nfor Dancers. Specialties<br />\nment<br />\nwill reduce these figures by<br />\nFeature<br />\nThe Hopkins faculty numbered • Very few graduate students are<br />\nthrough his speech .as though he<br />\nat<br />\nleast<br />\ntwenty per cent. A memAnother of the Cotillion Club's<br />\nhad gone through it many times another author among its ranks against the new plan. Most of them<br />\nber<br />\nof<br />\nthe<br />\nEngineering faculty esfamous successes joined the long<br />\nbefore.<br />\nwhen Dr. Carol V. B. \\Vight's Sir are emphatic in their declarations<br />\ntimates<br />\nthat<br />\nover thirty per cent<br />\nof support. The general basis for line' of its predecessors on the<br />\nWorking Class Cause Just<br />\nThomas More and Other Verse apof<br />\nthe<br />\nsophomore<br />\nEngineers have<br />\ntheir support is that such a scheme pathway of past, events, at one<br />\nWhat he preached was the justpeared last week.<br />\nbeen deleted during the recent exo'clock<br />\nmorning<br />\non<br />\nafter<br />\nthe<br />\nthe<br />\nwould<br />\nincrease<br />\nthe<br />\nnumber<br />\nof<br />\ntrue<br />\nness of the demands of the workThe volume bears an all-Hopkins scholars at Johns Hopkins, and as night of February 3. From-9:30, aminations by the famous trilogy<br />\ning class and their right to recogcharacter.<br />\nThe printers are the a whole better the standards of the time at which the opening Math. 2, PhYsics I, and Applied<br />\nnition by their more privileged<br />\ndance began, until the last melo- Mechanics. This trio is the sieve<br />\nfellow-humans. The object of the Johns Hopkins Press, the author is scholarship.<br />\ndious<br />\nstrain of jazz ceased to re- which weeds out the Engineering<br />\nThe members of the faculty are<br />\nleague to which •he belongs, he a Hopkins professor, and several of<br />\nverberate<br />\nthru the Maryland Cas- 'School and exacts a fearful toll<br />\nsaid, is \"to promote among college the poems are reprinted from the dubious about expressing any opinualty<br />\nRoom, many couples, yearly. This year's figures are<br />\nBall<br />\nion as long as the new plan is in<br />\nmen and women an intelligent un- NEWS-LETTER<br />\nand the Johns Hop- as nebulous a state<br />\nlig-ht<br />\nand light hearted, even higher than usual. In one<br />\nfooted<br />\nas at present.<br />\nderstanding of the labor mOvekins Alumni Magazine.<br />\nsucceeded<br />\nthe<br />\nlast night of the section of Physics I sixteen out of<br />\non<br />\nThey want something more definite,<br />\nment and of the movement toward<br />\nexamination<br />\nseason<br />\nin driving twenty-eight received less than six<br />\nThe familiar \"knowest thou that a thoroughly articulated plan, bea new social order based on proaway<br />\nall<br />\ntraces<br />\nof care.<br />\nas a final mark.<br />\nduction for use and not for profit.\" fair land\" from Goethe's Wilhelm fore they will risk their reputation<br />\nBlue<br />\nTwelve,<br />\nThe<br />\nJay<br />\nas<br />\nusual,<br />\nby<br />\nmaking<br />\nstatements,<br />\neither for or<br />\nAcademics Hit<br />\nSuch an organization for such a Meister is one of the poems which<br />\nsupplied music with untiring conBut it is in the supposedly easy<br />\npurpose would not be necessary, first appeared in the NEWS-LETTER. against any plan.<br />\nsistency. The dances were long College of Arts and Sciences that<br />\nFew Votes from Undergrads<br />\nhe explained, if it were not for the It is entitled Mignon and was writand the intermissions were pleas- the mortality is most surprising.<br />\nUndergraduates were asked to<br />\nfact that there is a great deal of ten in Dr. Wight's undergraduate<br />\nantly short. The musicians were The Freshman Class seems to be<br />\nexpress<br />\ntheir opinions through the<br />\nmisunderstanding,<br />\nindifference, days. At the Tomb of His Brother<br />\nindeed, wholly justified in wear- bearing the brunt<br />\nof the faculty's<br />\nand ignorance between the world from Catullus is the other reprint medium of a printed form printed ing<br />\nacross their bosoms the black attacks. One-fifth of<br />\nin<br />\nthe large<br />\nthe<br />\nNEWS-LETTER.<br />\nReplies<br />\nwere<br />\nof labor and the world of college. from the NEWS-LETTER.<br />\nThe<br />\nand blue ribbon which may have History 2<br />\nclass<br />\nhave<br />\nnot<br />\nfailed<br />\nnumerous,<br />\nto rethe<br />\nmen<br />\neither not<br />\nThe remedy for this state of af- Alumni Magazine's reprints are<br />\nsignified royalty in the realm of ceive a<br />\npassing<br />\nmark.<br />\nhaving<br />\nOut<br />\nof<br />\nany<br />\nthe<br />\ninterest or preferring<br />\nfairs, he went on, is for college mostly in memoriams of famous<br />\ndance syncopation.<br />\nnine<br />\nEnglish<br />\nComp. sections the<br />\nmen to realize that the labor situ- men associated with Hopkins. to follow the advice of Dean Ames, Those who served on the recepation in the United States is some- Among those eulogized are Revere who did not seem to relish the idea tion committee were Dr. and Mrs. six whose marks have been posted<br />\nthing that deserves attention and Osler, Basil L. Gildersleeve, Kirby of the NEWS-LETTER taking a vote, Broadus Mitchel and Mr. -and show forty-eight marks below six<br />\nand thirty-three others below sevstudy, in the name of humanity Flower Smith, and Edward H. as long as no really definite plan Mrs. Herberton Evans.<br />\nen. Thus a total of eighty-one in<br />\nhad been presented for consideraand the general welfare of the Spieker.<br />\nAfter the \"Jays\" had begun to<br />\nonly six 'sections will be unable to<br />\ntion.<br />\nThe<br />\nreplies<br />\ngave<br />\nthe<br />\nfollowcountry.<br />\nThe main work of the volume is<br />\nharmonize \"Bill\" Rogers did his<br />\ning<br />\npresent this course for graduation.<br />\nresults:<br />\nFor<br />\nthe<br />\nchange,<br />\n12;<br />\nDiscusses Three Ideals<br />\na five act tragedy in blank verse endancing act. At intervals, followagainst<br />\nthe<br />\nThose<br />\nwhose marks range from<br />\nchange,<br />\n15;<br />\nalternate<br />\nThree ideals for which the pres- titled Sir Thomas More. The maing, Rogers and Webster sang a<br />\nplans,<br />\n2.<br />\nsix<br />\nThe<br />\nto<br />\nsmallness<br />\nseven<br />\nmay make this up in<br />\nof<br />\nthe<br />\nreent labor movement is striving jority of the other poems, exclusive<br />\nfew of the latest songs. Webster<br />\nply<br />\ndoes<br />\nnot<br />\noffer<br />\nthe<br />\ncoming<br />\na<br />\nbasis<br />\nsemester by procuring<br />\nfor judg- scored a hit when he sang the<br />\nwere discussed by Mr. Blanchard. of those previously published,'deal<br />\nThe first one he called \"Wealth- with the sea. Dr. French points out ing the opinion of the undergrad- words of \"(My Best Gal\" to a high- a total average of seven. The<br />\ndeath-rate in the Romance DeContinued en page 4, col. 1.<br />\nopia.\" What he wanted to get at in the Foreword that Dr. Wight<br />\nly appreciative audience.<br />\npartment is evidenced by the rewas this: There is enough wealth knows the sea well, having been<br />\nThe high mark of the season<br />\nsults<br />\nfrom one section. Only 'seven<br />\nJUNIORS<br />\nAND SENIORS TO was reached in the second Coin America for everyone; yet by born within sight of it and having<br />\n.out<br />\nof<br />\na large class received passDEBATE FEB. 13<br />\nactual statistics, from one-third to spent much of his life at sea. In<br />\ntillion. The Board cleared all exmarks.<br />\ning<br />\none-half of the working class do the foreword Dr. French also traces<br />\nThe annual Junior-Senior de- penses. No definite statement can<br />\nnot get a minimum comfort wage. the author's work in the Kottabos bate will be held in the Civil Engi- yet be made of the actual condiPol. Econ. a Waterloo<br />\nThis means that there is an un- Club, \"a small circle of men asso- neering Hall on the night of Feb- tion of the financial end, but since<br />\nUpper classmen in the Acaequal distribution of wealth in the ciated in one way or another with ruary 13. The subject for the de- the purpose of the affair was not deniic Schoo.1 found Pol. Econ. I,<br />\nUnited States, causing the two ex- the Johns Hopkins University or bate will be: \"Resolved, Maryland to make money, the results are section \"b,\" their Waterloo. Of<br />\ntremes of luxury and poverty. Goucher College, who meet period- should ratify the Child Labor generally proclaimed satisfactory.<br />\nContinued on page 4 col. 3<br />\nAlso, the rich man-is not always ically to share their literary inter- Amendment.\" A dance will follow,<br />\nunless arrangements of the Debat- CONTEMPORARY PUBLICATION GIVES<br />\nests.\"<br />\nContinued on page 4 col. 2<br />\ning Council miscarry.<br />\nESTIMATE OF UNIVERSITY'S FOUNDER<br />\nJ. H. U. SONGS AND YELLS HEARD OVER<br />\nBefore the mid-year examinations<br />\nRADIO STATION W G Y BY THOUSANDS the try-outs for the two teams were Time ravaged pages of a pub- and he did much for the welfare<br />\nheld. Dr. John C. French selected lication of the early seventies of future generations.<br />\nRadio has now served at least have afforded the time to \"tune from the few candidates the fol- have disclosed, in the terms of his \"Indeed,\" says the \"Monumenone useful purpose. Hopkins in.\"<br />\nlowing men: Seniors—Elmer C. contemporaries, a glimpse of the tal City\", \"his career is marked by<br />\nsongs and yells were put on the<br />\nAbout five hundred men, repre- Mylander, William Wolfe, and character of Johns Hopkins. The his constant correction of the comair from station \"W G Y,\" of the senting forty-five American and William P. Calhoun; Juniors— \"Monumental 'City,\" describing mercial. ailments of the city.<br />\nThe same article gives a short<br />\nGeneral Electric Company, on the foreign colleges and universities, George Davies, John R. Webster, Baltimore, at the zenith of its<br />\nevening of Saturday, January 31, participated in the entertainment. and Henry R. Turnbull. Robert post-war commercial prosperity, sketch of Johns Hopkins' life hisas part of the \"Intercollegiate High spots of the concert were Hopkins was selected as the Junior expresses in a brief biography, the tory, and a description of what<br />\nN'ight\" program. The Hopkins songs by the British Empire alternate.<br />\ngratitude of the city to the foun- might be gained by the city<br />\nselections were rendered by grad- group, consisting of college men<br />\nUntil 1918 a trophy was awarded der of the Johns Hopkins Univer- through the coming establishment<br />\nof the University bearing his<br />\nuates of the University who are from. New Zealand, Australia, the winning team, and a plaque com- sity and Hospital.<br />\nnow in the employ of the General South Africa, Canada and the memorating their victory was hung<br />\nThe \"Monumental City\" says name. At that time the trustees<br />\nElectric. One of them, C. Howard British Isles; a burlesque skit pre- in the Barn. In the twenty-one that, even while he was amassing were looking about for the first<br />\nBlack, '24, sent an announcement sented by the Massachusetts In- years between the first debate for his personal fortune, Johns Hop- President, and plans were 'still in<br />\nof the concert to the New's-Letter, stitute of Technology alumni; na- which a trophy was awarded, 1898, kins made the goal of the better- a nebulous state. However, it<br />\nbut since the mid-years were then tive songs by a quartet of gradu- until the last was hung on the Barn's ment of Baltimore one with his was planned to build the new Uniin full' swing no issue came out, a tes of the Royal Polytechnic In- walls, the Seniors had won eleven personal goal of making a large versity on four hundred acres of<br />\nand even if it had, undergraduate stitute of Sweden; and native =- debates to the Junior's nine. Records fortune. Never in his career did \"Clifton,\" Johns Hopkins beautiradio enthusiasts could not well sic played by Chinese engineers. since that time are not available.<br />\nhe forget the needs of the city, ful suburban estate.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS -LETTER, FEBRUARY 6,1925<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nHomewood 0100<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALDER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br />\nRICHARD R. GRIFFITH, '28<br />\nRALPH KIRKLEY, '28<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\n<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\n<br />\nCirculation Manager<br />\nOTHo J. KELLER, III, '26<br />\n<br />\nAssistant Business Managers<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT r. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br />\nROBERT S. JACOBS, '25<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 6, 1925<br />\n<br />\nTHE AFTERMATH<br />\nThe midyear ex=inations have come and gone, taking with them<br />\na heavy toll. To those who have been dropped we can only wish reinstatement, or success in other lines. To those fortunate ones who<br />\nremain, tr,<br />\n;n particular, we can give more useful advice.<br />\nMuch can be learned from the examinations, from failure as well as<br />\nsuccess. The majority of new students during their first half year of<br />\ncollege work more or less in the dark. The midyears have, or should<br />\nhave, cleared up many 'doubtful points.<br />\nThose who have passed all their courses have gained confidence in<br />\nlearning that examinations are not insurmountable obstacles, but for the<br />\nmost part fair tests of one's general knowledge of a course. The students who have failed one or two courses should learn the more useful<br />\nlesson of realizing the seriousness Of college work; and of not looking<br />\nat the absence of daily work, such as that required in preparatory school,<br />\nas an opportunity to loaf through the year. They should learn how to<br />\nstudy, and realize that one week of violent cramming is worth nothing<br />\nin comparison to steady preparation and note-taking throughout the<br />\ncourse.<br />\nA little celebration and relaxation after the strain of the midyear's<br />\nis quite natural and in fact necessary, but the danger lies in over indulgence and allowing class work to slide from week to week. Now is the<br />\ntime to begin to work, for soon the rush of spring activities and an epidemic of spring fever will make study more difficult. All the men who<br />\nremain, from those oil the most ragged edge to those who were the most<br />\nsuccessful, should profit by the lessons learned in the last two weeks,<br />\nand remember that the finals will come just as inevitably as did the midyears.<br />\n<br />\nJ.<br />\nTHE SPIRIT REMAINS<br />\nWith the lifting of regulations, the \"frosh\" is no longer distinguished<br />\nfrom the presumably wiser upper-classmen. We congratulate them on<br />\ntheir release from the petty burden of cap, button, and the rest. However, it is our earnest hope that the joy of the freshmen in their newfound freedom will limit itself to the usual appalling array of glaring<br />\nsocks and neckties, rather than in the forgetting of the valuable lessons<br />\ntaught by the regulations.<br />\nThe newly emancipated freshman is still on the lowest rung of the<br />\ncollegiate ladder. If he fails to realize this even more than he did during<br />\nthe hectic \"paddle-swinging\" days of the early fall, he has missed the<br />\nspirit and purpose of the regulations. The letter of tine rules has been<br />\nremoved, but the spirit remains. There is no longer a system of game<br />\ntags, but there are still games to be supported; no more yells to be learned,<br />\nbut there are still Hopkins teams to be cheered; no more compulsory<br />\nspeaking on the campus, but the spirit of friendship should still prevail.<br />\nThe basic spirit of the regulations is to make the freshman a better<br />\nHopkins man and the \"frosh\" should \"carry on\" even more willingly, although the regulations have been lifted.<br />\n<br />\nMYSTERIOUS TRACKS DRAW INTEREST<br />\nOF CAMPUS SHERLOCK HOLMES<br />\nStarting mysteriously in front<br />\nof the main entrance of Gilman<br />\nHall, running down the steps, the<br />\nlength of the quadrangle, over the<br />\nslope, across the bowl and into<br />\nCharles street are two tracks of<br />\nautomobile tires engraved in the<br />\nfast disappearing snow.<br />\nStudents on their way to school<br />\nfor the first day of the second semester last Wednesday were astonished at the peculiar route<br />\ntaken by the wandering motorists.<br />\nMany followed the tracks up to<br />\nwhere they started on the steps<br />\nof Gilman Hall.• Some looked inquiringly at each other while others winked knowingly.<br />\nCampus sleuths have deduced<br />\nthe fact that the tracks were laid<br />\non Tuesday night, the evening of<br />\nthe last day of the exam period.<br />\nThis fact disclosed a motive for<br />\nthe deed. Working on the size<br />\nand depth of the tread the engi-<br />\n<br />\nneer detectives figured out the<br />\nweight of the machine and finally<br />\ncame to the conclusion, through<br />\nthe process of elimination, that<br />\nthe vehicle in the case must have<br />\nbeen a flivver.<br />\nIt is conjectured that the driver<br />\ndrove up on the steps of Gilman<br />\nI-Tall, turned around and headed<br />\nin a straight line toward Charles<br />\nstreet at no slow speed.<br />\nA rumor has arisen,at the Barn<br />\nwhich has it that a certain senior<br />\nreceived a \"10\" in an examination<br />\non one of his courses of which he<br />\nwas doubtful, and wished to celebrate in a unique manner. This<br />\nsenior, having set what is his ideal<br />\nexample for the other undergraduates, is now boasting of having<br />\naccomplished something that no<br />\none else in the University ever<br />\ndid, and at the same time having<br />\ncelebrated his victory over<br />\nstudies.<br />\n<br />\n1111•M'<br />\n<br />\nThe FOUNTAIN PEN INKfor ALL PENS<br />\nThe Business<br />\nMan's Ink is<br />\nBLUE-BLACK<br />\n<br />\nSANFORD'S<br />\nPen Ink<br />\nFountain<br />\n<br />\nIT'S PERMANENT<br />\n<br />\n•<br />\n<br />\nDamon—<br />\n\"What was the matter<br />\nwith Professor Henry this<br />\nmorning? I've never seen<br />\nhim so peeved. He seemed<br />\nto be boiling over.\"<br />\n<br />\nPLAYSHOP TO DRIVE OFF BELAIR QUIET TO BE DISTURBED BY HOPKINS<br />\nGLOOM OF MIDYEARS<br />\nWITH DANCING<br />\nMUSICAL CLUB<br />\nDramatic Organization's Plans Call for Country to Be Invaded by Black and<br />\nBlue Musicians; Concert to Be<br />\nAmbitious Program Including<br />\nHeld in Blair Armory<br />\nDance and Shop Night<br />\n<br />\nExtensive and eventful is the<br />\nprogram of the Homewood Playshop arranged for the next half<br />\nyear. Like everything else, the<br />\nactivities' of the Playshop have<br />\nsuffered a partial eclipse during<br />\nthe past few weeks because of interference by the inevitable midyear exams, but Dr. Small heralds<br />\na busy season for the rest of the<br />\nyear.<br />\nA major event of the program<br />\nis the Valentine Dance to be held<br />\nFebruary 14th. All Hopkins students are invited to this much<br />\nlooked forward to affair. Tickets<br />\nwill not be sold at the door. They<br />\nmust be obtained before the night<br />\nof the dance.<br />\n\"Play-Tea\" on February 22<br />\n<br />\nCommemoration Day, Feb.<br />\n22nd, is the next important event<br />\non the schedule. On this date, one<br />\nof the entertaining \"Play-teas\"<br />\nwill be given in the Campus Theater in the afternoon for the faculty and students. A feature of<br />\nthe tea will be the one-act play<br />\n\"Washington's First Defeat,\"<br />\nwhich is to be put on twice during the course of the afternoon,<br />\nfrom 3:00 to 5 :30. There will be<br />\nno charge for admission to this<br />\ntea.<br />\nFollowing the custom of past<br />\nyears a Shop-night program will<br />\nbe presented on February 28th.<br />\nTwo original one-act plays will be<br />\npresented and will be followed by<br />\ndancing. Members of the Playshop will be admitted by card; a<br />\ncharge of $.75 will be made for<br />\nnon-members.<br />\nThe March public bill, to begin<br />\nMarch 12th, is .also being prepared<br />\nand will consist of thre one-act<br />\nplays to be announced later.<br />\nAll students who wish to co-operate in any way with these activities are asked to speak to Dr.<br />\nSmall.<br />\n<br />\nBelair is a quiet town. A peaceful<br />\nair of repose, of colonial quiet hovers over the sleeping village. A man<br />\nwith insomnia can sleep in Belair.<br />\nTonight Belair loses its olden<br />\ncharm; rank modernism will invade<br />\nthe place. And modernism will be<br />\nwelcomed with open arms. Belair<br />\nis hospitable, and it has an eye<br />\nopen, in spite of its seeming somnolence, for its own interests. One<br />\nyear ago Belair was invaded with<br />\nthe aforementioned modernism, and<br />\nit liked the new idea. Like wine to<br />\nits aged bones, like nectar to poor<br />\nhumans, was this modern spirit.<br />\nThen Belair awoke, had one riotous<br />\nnight of fun—and then the Johns<br />\nHopkins Musical Club left town.<br />\nTonight the air will again be rent<br />\nwith the strains of college boys singing in close harmony, with the<br />\nplunking of collegiate banjos, and,<br />\nmost modern of all, with the nerve<br />\ntacking tooting of the Blue Jay<br />\nOrchestra. For tonight, after a<br />\nyear's absence, and a year's quietude<br />\nfor Belair, the Hopkins Musical<br />\nClub will visit the Harford County<br />\nMetropolis.<br />\nHappy Until One<br />\n<br />\n,41 Also<br />\n<br />\nPythias—<br />\n\"Boiling over is good. He<br />\nwas. Didn't you notice<br />\nwhy? The old boy had mislaid his Eldorado pencil.\"<br />\n<br />\nEwoffiw<br />\nUemastereharakopiwar<br />\n17 leads—all dealers<br />\niii...••••••••••••••11.11.11.111....11111111W<br />\n<br />\ncjhe largest selling<br />\nquality pencil<br />\nin the world<br />\n17<br />\nblack<br />\n<br />\ndegrees Superlative in quality,<br />\nthe world-famous<br />\n<br />\n3<br />\ncopying<br />\n<br />\n[ENUS<br />\nPENCILS<br />\ngive best service and<br />\nlongest wear.<br />\n<br />\nBuy<br />\na<br />\n<br />\ndozen<br />\n<br />\n$1.00<br />\nPlain ends, per doz.<br />\nRubber ends, per doz. 1.20<br />\nclt all dealers<br />\n<br />\nLead Pencil Co.<br />\n220 Fifth Ave., N.Y.<br />\n<br />\nAmerican<br />\n<br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWF.I FRS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\nLATEST STYLES AND FORMS<br />\n<br />\nBoys from Baltimore and belles<br />\nEngraved Wedding Invitations<br />\nfrom Belair will embrace one an- Announcements and Visiting Cards<br />\nother in modern dances. (A dance<br />\nSAMUEL H. KIRBY<br />\nas usual will follow the concert.)<br />\nENGRAVER<br />\nEveryone will be happy until at<br />\nSamples and Prices on Request<br />\nleast one A. M., and then, with the 42 SOUTH ST.<br />\nBALTIMORE<br />\ndeparture of the buses for Baltimore, Belair will settle down for<br />\nCollege and Fraternity Stationery<br />\nanother year. The Belair Armory Banquet and Dance Cards, Invitations<br />\nwill be the scene of the fracas, and<br />\nJAS. H. DOWNS<br />\nthe time of the first round will be<br />\neight-thirty. The program does not ENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\nfollow.<br />\nAV<br />\n<br />\nGet Extra Credits at Home<br />\nMore than 450 courses in History, English, Mathematics,Chemistry,<br />\nZoology, Modern Languages, Economics, Philosophy,Sociology,etc.,<br />\nare given by correspondence. Learn how the credit they yield may<br />\nbe applied on your college program. Catalog describing courses fully,<br />\nfurnished on request. Write today.<br />\n<br />\nrEbe Zilintimaiitp of effirago<br />\n95 ELLIS HALL<br />\n<br />\nCHICAGO. ILLINOIS<br />\n<br />\nNOTICES<br />\nNEWS-LETTER<br />\nRegular meeting of entire<br />\nNews-Letter staff and candidates<br />\npromptly at 12.20 today in NewsLetter office at Barn.<br />\nCOTILLION CLUB<br />\nDance in C. E. Hall, 9 P. M.<br />\ntomorrow night, admission $1.00.<br />\n<br />\nBaltimore's Best Store<br />\nHOCHSCHILD,KOHN 8c CO.<br />\nHoward and Lexington<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS LETTER, FEBRUARY 6. 1925<br />\n\"Y\" DINNER TUESDAY AT<br />\nPERSONALITY AND INDIVIDUALITY<br />\nMEETING HOUSE<br />\nOF INMATES REFLECTED BY JOHNS<br />\nThe Y. M. C. A. will give its<br />\nHOPKINS HOME WOOD STRUCTURES monthly Fellowship Dinner at the<br />\nFriend's Meeting House next<br />\nTuesday at 6 P. M. Father J. A.<br />\nRyan, a famous socialist, and a<br />\nat the Catholic UniverProfessor<br />\nAll houses have a personality of opposite of dreamy picturesque<br />\nspeak on, \"The Child<br />\nwill<br />\nsity<br />\ntheir own. Some characteristics of Gilman Hall. Its corridors resound<br />\nFather Ryan<br />\nAmendment.\"<br />\nLabor<br />\ntheir owners seem to saturate the With the hum of motors. Students<br />\non all<br />\nauthority<br />\nknown_<br />\nwell<br />\na<br />\nis<br />\ndwelling. A New England Uni- bustle around its corners. Little<br />\n'discuss<br />\nand<br />\nwill<br />\nquestions,<br />\ntarian church gleaming white in the red and green lights assure perfect social<br />\nSpring sunshine, a Southern man- traffic. Signs are neatly printed. the question from all angles.<br />\nOther work of the•Y. M. C. A.is<br />\nsion in Georgian brick, and a funer- The visitor might spend a day withfull swing at the present time.<br />\nin<br />\nmore<br />\nseeing<br />\nal director's home each has its own in its walls without<br />\nmen from Hopkins will<br />\nEighteen<br />\nthan a signature in long hand.<br />\nPersonality.<br />\nInter-State Student<br />\nthe<br />\nattend<br />\nThis flavour of the inmates which Stenographers are brisk and busiwill be held unwhich<br />\nConference,<br />\nChanges a house into a living per- ness-like. The professors wear<br />\nthe Student<br />\nof<br />\nauspices<br />\nthe<br />\nder<br />\nsonality- is very noticeable among stiff collars, work in their shirtthe Univerat<br />\nUnion,<br />\nthe buildings of the Homewood sleeves, and smoke pipes. Restless, Volunteer<br />\n0, 14,<br />\nFebruary<br />\ngroup of the Johns Hopkins Uni- ceaseless, wide-awake energy radi- sity of Delaware,<br />\nadbe<br />\n15. The Conference will<br />\nates from it.<br />\nversity.<br />\nGilman Hall with its stately cuThe Barn has had a strange dressed by many famous speakers.<br />\nThe \"Y\" is preparing for the anPola and broad marble steps is the change of personality. Its Barn<br />\nnual<br />\nStudent Fellowship fund<br />\nproIts<br />\nacme of scholarly culture.<br />\ndays are ended and at present its<br />\nwill take place during<br />\nwhich<br />\ndrive,<br />\nthe<br />\nfessors and students pursuing<br />\none of the the latter part of February. The<br />\nmixed<br />\nthe<br />\nis<br />\npersonality<br />\ngentle Arts and Sciences have impressed their nature on the building. undergraduate school. Activities Hopkins \"Y\" has contributed to<br />\nHistory, literature, philosophy,— and food are its chief characteris- this fund for a number of years,<br />\nthese and kindred snbjects—have tics. At times there is an atavistic and hopes to raise more than ever<br />\ngiven Gilman Hall.a dignified, som- impulse, when the herds of students in 1925. The fund is for the purresemble the Barn's former inhab- pose of aiding European students<br />\nnolent, and scholarly -air.itants.<br />\nwho have been made unable to<br />\nThe Civil Engineering- Building<br />\nThe new Chemistry Building is -:ontinue their education without<br />\nis rather in between the sedateness<br />\nof the scholar and the mechanical too new to have a distinct person- aid, owing to conditons brought<br />\nMatter-of-factness of the engineer. ality. Housing, as it does, the offi- about by the War.<br />\nIts halls are cleanly swept, quiet. cers of the University, it has a<br />\nand dignified, but there seems to be rather official and authoritative air.<br />\na sense of order peculiar to the en- New and important it is, but it has<br />\nnot as yet achieved its own pergineering nature.<br />\nThe M. E. Building is the direct sonal flavour.<br />\nGilman Hall is Acme of Scholarly Culture, C. E. Hall Combines<br />\nSedateness with Order, M. E. Hall Typifies Action<br />\n<br />\ngor Young Men<br />\nThere is nothing like a<br />\n<br />\nSTETSON<br />\nOST young men today<br />\nknow theimportance of<br />\nlooking fit. Good appearance counts much<br />\nin the game of life. The young<br />\nman who dresses with taste has<br />\na decided advantage.<br />\nBut—it is surprising how little<br />\nthought the average man gives<br />\nto his hat. It is his crown, yet he<br />\nseems to stop dressing at the neck.<br />\nBe careful in your selection of<br />\nyour headwear. When you buy a<br />\nhat, select a Stetson. Its style is<br />\nright,its quality means long wear._<br />\n<br />\nVAGABOND ACTRESS WILL LAST OF FEBRUARY BUSY<br />\nFOR FACULTY, ALUMNI,<br />\nHELP TRAIN \"FEMALES\"<br />\nUNDERGRADUATES<br />\nFOR BARNSTORMERS<br />\n<br />\n-141,<br />\n<br />\n:<br />\n<br />\n•\"\" ,<br />\n<br />\nHilda Bergner to Attend Sunday Re- Commemoration Day and Alumni<br />\n• Meeting Will Crowd First Part<br />\nhearsal. Tentative Cast Chosen for<br />\nof February<br />\nFirst Pictures<br />\n<br />\nHilda Bergner, Vagabond star,<br />\nWill try to feminize the leading<br />\nCandidates for the Barnstormers<br />\nPlay, \"The Tailor-Made Man.\"<br />\nMiss Bergner will attend the Sunday afternoon rehearsal at the<br />\nBarn and will try to make \"perfect<br />\nladies\" of the embryo Julian Eltinges.<br />\nMiss Bergner has had a wide<br />\nstage experience and has been connected with the Vagabond Players for several years. She has<br />\nstarred in Fashion and The Silver<br />\nLox this winter and is at present<br />\nPlaying an important role in her<br />\nthird play of the season.<br />\nPictures for their forthcoming<br />\nproduction will be taken tomorrow at the Bachrach Studios. For<br />\nthis purpose a tentative cast of the<br />\nPrincipal roles has - been Picked.<br />\nTen or fifteen men will be sent to<br />\nthe studios to assume the leading<br />\nMale and female characters.<br />\nThe tentative cast picked so far<br />\nis as follows:<br />\nI E. Rodgers<br />\nJohn Paul Bart<br />\nAbraham Nathan....Gordon Post<br />\n.....Chauncey Tatum<br />\nHuber<br />\nGeorge Hess<br />\n*Pomeroy<br />\nJerome Schapiro<br />\n-Peter<br />\nPemale Roles—John Desch, Mortimer Slatkin, John English,<br />\nFendall Cushing, Charles Reese<br />\nMembers of the club were also<br />\nsent with the others to impersonate the smaller parts for the photographs. These will be: Gordon<br />\nStick, Alger Hiss, Philip Sachs<br />\nand Kelso Morrill. Promising<br />\nfreshmen including Donald White,<br />\nRidgely Warfield and Donald<br />\nGiese, will also be photographed.<br />\n<br />\n,WM11001:<br />\n<br />\nTh<br />\n<br />\nCommemoration Day following<br />\nhard upon the heels of an alumni<br />\nmeeting Feb. 21 will make the<br />\nearly twenty's of this month busy<br />\ndays for students and graduates.<br />\nAt the alumni meeting Dr.<br />\nGoodnow will make an address<br />\nelaborating the plan for undergraduate instruction. It will be<br />\nthe first official gathering of any<br />\nof the alumni since the meeting of<br />\nthe Alumni Council on Jan. 31, to<br />\ndiscuss revamping collegiate instruction. Dr. Goodnow will make<br />\na short address to the entire body<br />\n<br />\n••<br />\n<br />\nWinning the West<br />\n<br />\nof alumni.<br />\nBesides the unusual date of<br />\nCommemoration Day there will be<br />\nan honorary degree conferred<br />\nupon 0. D. Young, Chairman of<br />\nthe Board of Trustees of the Walter Hines Page School of International Law. Mr. Young played<br />\na major part in the formulation of<br />\nthe Dawes Plan last year.<br />\nAfter the Commemoration exert<br />\ncises have been completed the<br />\nPresident's luncheon will be held<br />\nin Gilman Hall. All members of<br />\nthe faculty down to the Associate<br />\nProfessors will be invited.<br />\nAs the cast so far is entirely<br />\ntentative Coach Walter B. Swindell, Jr., has far from made up his<br />\nmind as to the final cast. Changes<br />\nwill be made at every rehearsal<br />\nand he will endeavor to shift the<br />\ncandidates into the roles most<br />\nsuited for themselves.<br />\nRehearsals, discontinued during<br />\nthe examination period, will begin<br />\nagain this evening at the Barn.<br />\n<br />\n•<br />\n<br />\nIrrigation by electrically driven pumps has made<br />\nhundreds of thousands of acres of desert land in the<br />\nIntermountain West blossom like the rose.<br />\nFor a few cents a month per acre, electricity—the giant<br />\nworker—brings the life-giving water from distant lakes<br />\nand rivers to rainless valleys, producing rich harvests<br />\nof fruits and vegetables, cereals and forage.<br />\n<br />\nThe General Electric Company provides for agriculture little motors that do the<br />\nfarm chores and great ones<br />\nthat operate mammoth<br />\npumps to irrigate vast<br />\nstretches of arid valleys.<br />\n<br />\nWhat electricity is doing for the farmer is only a<br />\ncounterpart of what it is doing for Industry, Transportation, City and Country life or any of the professions. It is a tool ready for your use and which, wisely<br />\nused, will make the impossible of today an accomplished<br />\nfact tomorrow.<br />\n<br />\nIf you are interested in<br />\nlearning more about what<br />\nelectricity is doing, write<br />\nfor Reprint No. AR391 containing a complete set of<br />\nthese advertisements.<br />\n<br />\nHow electricity does these things is important to the<br />\nstudent in a technical school—but what electricity can<br />\ndo is important to every college man or woman, no<br />\nmatter what their life's work may be.<br />\nI47DH<br />\n<br />\nGENERAL<br />\n<br />\nELECTRIC<br />\n<br />\nEi i.CTR1C<br />\n<br />\nCOMPANY,<br />\n<br />\nSCHENECTADY,<br />\n<br />\nNEW<br />\n<br />\nYORK<br />\n<br />\n\f4<br />\n<br />\n17IE JOHNS HOPKINS NEWS-LE r1ER, FEBRUARY 6, 1925<br />\n<br />\nMID-YEAR REVERIES<br />\n<br />\nSENIORS<br />\nJUNIORS<br />\nSOPHOMORES<br />\nFRESHMEN<br />\n<br />\nSi. Regis<br />\nRESTAURANT<br />\n1817 N. Charles St.<br />\n<br />\nOpen All Hours<br />\n<br />\nNear Your Campus<br />\n<br />\nR. G.Loy & Company<br />\n(Robert G. Loy)<br />\n<br />\nPHARMACISTS<br />\nUNIVERSITY PARKWAY<br />\nAt Charles St.<br />\n<br />\nPayne &Merrill<br />\n<br />\n'BOUT four hundred<br />\nHOPEFUL frosh<br />\nCOME to sign the<br />\nROLL by gosh!<br />\nSOPHS wield paddles,<br />\nJUNIORS yell<br />\n\"SOCK lim freshman,<br />\nGIVE 'em hell!\"<br />\nRUSHING season<br />\nIN full sway,<br />\nTHIRD November<br />\nFATEFUL day,<br />\nCOMES the Maryland<br />\nFOOTBALL game—<br />\nMARYLAND nothing,<br />\nHOPKINS same.<br />\nTHEN informals<br />\nHIT the place.<br />\nMANY a stude with<br />\nDOLEFUL face.<br />\nSOON vacation<br />\nCOMES along—<br />\nWINE and women,<br />\nALSO song.<br />\nMIDYEAR'S coming,<br />\nBLACK outlook;<br />\nNO one yet has<br />\nCRACKED a book.<br />\nEVERY body<br />\nWANTS to stay,<br />\nLIBRARY filled most<br />\nEVERY day.<br />\nTHUNDER falls; those<br />\nLEFT behind<br />\nSETTLE down to<br />\n\\ SAME old grind.<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\n<br />\nNORTH GERMAN LLOYD<br />\n<br />\nSPECIAL SUMMER EXCURSIONS<br />\n<br />\nJanuary 17, 1925.<br />\nTO EUROPE<br />\nTo the Editor of the News-Letter.<br />\nFOR TEACHERS AND STUDENTS<br />\nDear sir:<br />\nENTIRE THIRD CLASS RESERVED<br />\nYour article in the issue of JanCONDUCTED TOURS IN EUROPE (all expenses paid)<br />\nuary 16, about the Valentine<br />\nARRANGED, IF DESIRED<br />\nDance is slightly incorrect when it<br />\nA. SCHUMACHER & CO.<br />\nis indicated that the subscription<br />\nGENERAL AGENTS<br />\nCHARLES AND REDWOOD STS.<br />\nlist will be limited to members of<br />\nthe Playshop.. I take full responsiBRANCH<br />\nbility for giving this false impres- AT THE<br />\nBARN<br />\nsion to your reporter; but I would<br />\nlike to correct the error at this<br />\ntime if The Playshop might again<br />\nask indulgence from you who have<br />\nalways been so kind and encouraging.<br />\nWhile constitutional require'<br />\n6<br />\nDOUG<br />\nTURNBULL<br />\nTOM<br />\nMAGILL,<br />\nments demand that the first inviRepresentatives<br />\nManager<br />\ntations for the Valentine Dance<br />\nIfP.TN_Fg-gmust go to the members, the subgg<br />\n- -gPIEFOrgg<br />\nscription list will not omit the<br />\nname of any man on the university campus who wants to attend.<br />\nLarge discretion in the making up<br />\n\"THE WONDER MOTOR FUEL:<br />\nof the list has been given me, and<br />\nMeets Every Requirement of<br />\nI assure you that the undergrads<br />\nPerfect Motor Performance<br />\nwill never have anything of which<br />\nto complain at my hands.<br />\nSHERWOOD BROTHERS, INC.<br />\nYours truly,<br />\n222 & 224 W_ Baltimore St.<br />\nAlbert Langeluttig.<br />\nIREIRRWEIPIRMITTPJE,<br />\n<br />\nf Gsiort Ouality.<br />\n<br />\nN.Charles Sfreet.<br />\n<br />\nWARNER & CO.<br />\nHatters<br />\n<br />\nBETHOLIN<br />\n<br />\nHATS—OVERCOATS<br />\nNECKWEAR<br />\n<br />\nCLOTHIERS<br />\nHABERDASHERS PAUL BLANCHARD ADDRESSES ASSEMBLY<br />\n<br />\nON LABOR MOVEMENT AND ITS IDEALS<br />\n315 Charles St. North<br />\n<br />\nContinued from page 1<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nrich because of his superiority of breath and saying: \"I believe that<br />\nmerit, but sometimes only through if we can unite the brains and ininheritance, luck or ruthlessness. fluence of the college with the<br />\nDeveloping What labor wants in order to moral ideals of religion and the<br />\nKodaks<br />\n.Xff:'Corner CJcz yelie and g'utaw Sts.<br />\nPrinting<br />\nCameras<br />\nremedy these conditions is a min- economic power of labor, we may<br />\nEnlarging<br />\nSupplies<br />\nimum wage law and a law for the most certainly build up a great in-Where Wholesale and Retail Districts Meet\"<br />\nconfiscating by taxation of most of dustrial democracy.\"<br />\nwealth belonging to people unAt the conclusion of the talk,<br />\nZepp Photo Supply Co. the<br />\ndeservedly rich.<br />\nthe<br />\nAssembly was brought to a<br />\n3044 Greenmount Ave.<br />\n\"Workopia\" was the second close with the presentation<br />\nof a<br />\nideal named by Mr. Blanchard and silver cup given by the InterfraLet Us Develop Your Films<br />\nby this he meant a just distribu- ternity Board. to the ,fraternity<br />\nLeave Them Today—<br />\ntion of work. Modern machinery, reaching the highest scholarship<br />\nand individuality is offered here at prices that are not<br />\nGet Them Tomorrow<br />\nhe said, has not lifted the burden average. The Delta Gamma Theand cannot be underquoted by any house at any time.<br />\nfrom the working man's shoulders' tas were the winners, with an av41Besides the reputation of an old-established firm<br />\nTHE FLAG, BANNER AND or varied the deadly monotony of.<br />\nis back of each sale with a guarantee.<br />\nerage of 80.1.<br />\nPENNANT SHOP<br />\nfactory work. And the present<br />\nSuccessors to SISCO BROTHERS industrial system is so organized<br />\nFlags, Banners, Pennants, Arm<br />\nMID-YEAR EXAMS EXACT TOLL<br />\nBands, Emblems, Church and Society that the laborer must bear the<br />\nContinued from page 1<br />\nGoods, Gold, Silver and Antique brunt of long hours with meagre<br />\nFURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nBraids, Fringes, Tassels, Beads and<br />\npay. What labor wants is that the fifty-five members twenty-seven<br />\nNovelties.<br />\n343<br />\nNORTH<br />\nCHARLES STREET<br />\nSilk Banners for Schools, Societies, college man use the power he has were graded below seven.<br />\nand Fraternities<br />\nSeveral courses were Pollvanbeen fortunate enough to gain by<br />\nR. H. TAYLOR<br />\nnas to the struggling students.<br />\nlower<br />\nhigher<br />\n_education<br />\nthe<br />\nhelp<br />\nto<br />\n302 Park Avenue<br />\nclasses in their fight for an 8-hour History 3 and Pol. Econ. II and<br />\nBaltimore, Md.<br />\nVernon 2355<br />\nV appear to be those most responday.<br />\nMOUNT VERNON PLACE<br />\nsible<br />\nfor any joy which dissipates<br />\nThe ideal of \"Poweropia\" was<br />\nOPINIONS OF NEW PLAN<br />\nMETHODIST<br />\nEPISCOPAL<br />\nthe third goal which the speaker the gloom which hangs over GilContinued from page 1<br />\nCHURCH<br />\nman<br />\nHall.<br />\nThree<br />\ngrades of ten,<br />\nuate body; but from the oral opin- said was being fought for by the<br />\n(At the Washington Monument)<br />\ntwo of nine-five, and thirteen of<br />\nThings<br />\nleague.<br />\narranged<br />\nso<br />\nare<br />\nions expressed to the NEWS-LETTER<br />\nnowadays that one man may find ,e in History III helped to 'preREV. OSCAR THOMAS<br />\nreporter, it was obvious that the<br />\nOLSON, D.D.,<br />\nhimself in a position to tell 100,000 vent the complete passing of the<br />\n'majority of the students were<br />\n\"old<br />\nfamiliar<br />\nfaces.\"<br />\nMinister<br />\nThe<br />\ntwo<br />\npomen to quit work whenever he<br />\nagainst the change.<br />\nlitical<br />\neconomy<br />\ncourses<br />\nhad<br />\nthe<br />\nSunday Services of Worship<br />\nwants them to. There is no bal11 A. M. and 8 P. M.<br />\nGeorge Expresses Opinion<br />\nance of power at the present time high rf-rnni of only onp mark as<br />\nhtz-1•17.r:-se-n fltr-rn<br />\nThe Sunday afternoon \"at home\"<br />\nAlternative plans were: \"Reduce in the United States; and what the low 2F,<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nthe size of Baltimore, and make labor movement wants to do is to<br />\nRoom is a social occasion that brings<br />\nEllgRAUERS<br />\nPRMTERS<br />\n13MDERS<br />\ntogether the student groups from HopHopkins a small town college.\" get away from the control of in7<br />\nkins, University of Maryland, Goucher,<br />\ninvestor.<br />\ndusiry<br />\nthe<br />\nWhat<br />\nthe<br />\nby<br />\nPeabody, and other schools of BaltiThis masterpiece was suggested by<br />\nmore.<br />\nworking man wants is to be able<br />\nJ. E. Rodgers, '28. \"Make Hopkins<br />\noEpw rth League at 7 P. M. and the<br />\nto join a union without- being<br />\nBible class at 10 A. M. are built parco-ed, and let the women increase<br />\nticularly with the needs of the young<br />\nfired. At.present this privilege is<br />\npeople in mind.<br />\n-the scholarship,\" -The author of- -not enjoyed by half the working<br />\nthis second plan is unknown.<br />\nclass in the United States. On the<br />\nAn Exclusively Music<br />\nAlumni were doubtful about the one hand are the giant corporaVernon 4986<br />\nShop<br />\nplan as a whole, some for it and tions and the organized power of<br />\nGibson Banjos, Mandolins, Guitars,<br />\nsome against, but the majority re- capital, while on the other is the<br />\n\"King\" Saxophones and Band<br />\n-Say It With Flowers\"<br />\nfused to be quoted.<br />\nInstruments<br />\nhelpless class of laborers. Vhat<br />\nPenzel-Mueller Clarinets, Haynes Flutes<br />\nThe expression of the employees they want is the right to organize.<br />\nHeinrich-Roth Violins,<br />\nof the University was put into clas- \"The labor movement has made<br />\nVictrolas and Victor Records<br />\nPrinters of<br />\nsic form by George, the janitor, who mistakes,\" conceded Mr. BlanG. Fred Franz Music Co.<br />\ncrhe Johns Hopkins<br />\n.said, \"To hell with it.\" George is chard, but he insisted that it is a<br />\n\"The Shop Where You Buy Your<br />\nquoted without his knowledge; the \"far-reaching and fundamental<br />\nNEWS-LETTER<br />\nSheet Music\"<br />\nquotation is worthy of being em- movement in the world.\" And he<br />\n303 N. CHARLES ST. at Saratoga<br />\n1822 N. CHARLES STREET<br />\nbalmed in print.<br />\nPLAZA 3732<br />\nconcluded by drawing a deep LOM BARD and SOUTH STREETS<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nJohns Hopkins Students Will Find A Welcome At<br />\n<br />\nSMITH & CO.<br />\nFlorists<br />\n<br />\n\f", "format": "basic_html", "processed": "=MI<br /><br />\nVOL. XXIX, No 29<br />\nPAUL BLANCHARD SPEAKS<br />\nON LABOR MOVEMENT<br />\nAT ASSEMBLY<br />\nExplains Demands of Labor Workers.<br />\nDelta Gamma Theta Wins<br />\nScholarship Cup<br /><br />\nfff<br /><br />\n5<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 6,1925<br /><br />\nDR. WIGHT, HONORARY<br />\nJUNIOR PRESIDENT<br />\nDr. Carol V. B. Wight has<br />\nbeen chosen by the Johns<br />\nHopkins Junior Class for the<br />\nposition of Honorary President. The honor was bestowed upon this professor<br />\nbefore the exams, in the furor<br />\nof which, notification was<br />\nprevented.<br />\nProfessor in<br />\nGreek and Latin, Dr. Wight<br />\nreceived his A. B. and Ph.D.<br />\ndegrees here.<br /><br />\nMANY VARYING OPINIONS<br />\nEXPRESSED ABOUT<br />\nNEW PLAN<br />\nGraduate Students Favor Idea While<br />\nMany Undergraduates Oppose<br />\nDr. Goodnow's Plan<br /><br />\nOFFICERS REELECTED<br />\nAT 0. D. K. MEETING<br />\nD. C. Turnbull, R. C.<br />\nTilghman, and E. Donaldson<br />\nwere elected respectively to<br />\nthe offices of president, secretary, and treasurer, at a recent meeting of Omicron<br />\nDelta Kappa. Dean Ames at<br />\nthis meeting suggested that<br />\na University calendar be<br />\nhung in the registrar's office<br />\nto prevent conflictions of<br />\ndates in University activities.<br /><br />\nPRICE 5 CENTS<br /><br />\nMID-YEAR EXAMS EXACT<br />\nHEAVY TOLL OF ALL<br />\nCLASSES<br /><br />\nFreshmen and Sophornc=re-,:<br />\nHardest by Rigor<br />\nDr. Goodnow's proposed change<br />\nMr. Paul Blanchard, one of the<br />\nof InAructons<br />\nin the undergraduate departments<br />\nsecetaries of the League for InMore undergraduates have fallof Johns Hopkins has elicited varidustrial Democracy, was presenten<br />\nbeneath the stroke of the threeous responses from various groups<br />\ned to the student-body at the last<br />\nfailure rule this year than ever beon the campus. Graduate students,<br />\nAssembly as a man who has<br />\nfore,<br />\nwith<br />\nfew<br />\nexceptions,<br />\nare<br />\npresent reports show. All<br />\nin<br />\nfavor<br />\nworked as a laborer in one of the<br />\nof<br />\nthe<br />\nnew<br />\nplan,<br />\nundergraduates<br />\nfactories of the clothing industry<br />\nmarks are have yet not been reare, with equally few exceptions,<br />\nand studied the problem of the reported to the<br />\nOffice<br />\nagainst it, while the faculty and<br />\nlation between the employer and<br />\nbut a study of the marks posted,<br />\nalumni seem to prefer to keep their<br />\nthe employee. Apparently, he<br />\nhowever, show a huge mortality.<br />\npractices the unselfish, though DR. WIGHT PUBLISHES NEW opinions to themselves. At least<br />\nCOTILLION<br />\nAT<br />\nHELD<br />\nSECOND<br />\nReports as to the total casualthat is what is indicated by the<br />\nhazardous, doctrine that he<br />\nMARYLAND CASUALTY<br />\nBOOK OF POEMS<br />\nties of all the schools at HomeNEWS-LETTER'S canvass of the Unipreaches, for he is a graduate of<br />\nHALL<br />\nwood vary from one hundred and<br />\nversity's<br />\nopinions.<br />\n•<br />\nHarvard University. He talked \"Sir Thomas More and Other Verse\"<br />\nOrchestra<br />\nFurnishes<br />\nMusic<br />\nJay<br />\nBlue<br />\nfifty<br />\nto two hundred. ReinstatePrinted by J. H. U. Press<br />\nGraduates Favor Plan<br />\nfluently and pleasantly, and went<br />\nfor Dancers. Specialties<br />\nment<br />\nwill reduce these figures by<br />\nFeature<br />\nThe Hopkins faculty numbered • Very few graduate students are<br />\nthrough his speech .as though he<br />\nat<br />\nleast<br />\ntwenty per cent. A memAnother of the Cotillion Club's<br />\nhad gone through it many times another author among its ranks against the new plan. Most of them<br />\nber<br />\nof<br />\nthe<br />\nEngineering faculty esfamous successes joined the long<br />\nbefore.<br />\nwhen Dr. Carol V. B. \\Vight's Sir are emphatic in their declarations<br />\ntimates<br />\nthat<br />\nover thirty per cent<br />\nof support. The general basis for line' of its predecessors on the<br />\nWorking Class Cause Just<br />\nThomas More and Other Verse apof<br />\nthe<br />\nsophomore<br />\nEngineers have<br />\ntheir support is that such a scheme pathway of past, events, at one<br />\nWhat he preached was the justpeared last week.<br />\nbeen deleted during the recent exo'clock<br />\nmorning<br />\non<br />\nafter<br />\nthe<br />\nthe<br />\nwould<br />\nincrease<br />\nthe<br />\nnumber<br />\nof<br />\ntrue<br />\nness of the demands of the workThe volume bears an all-Hopkins scholars at Johns Hopkins, and as night of February 3. From-9:30, aminations by the famous trilogy<br />\ning class and their right to recogcharacter.<br />\nThe printers are the a whole better the standards of the time at which the opening Math. 2, PhYsics I, and Applied<br />\nnition by their more privileged<br />\ndance began, until the last melo- Mechanics. This trio is the sieve<br />\nfellow-humans. The object of the Johns Hopkins Press, the author is scholarship.<br />\ndious<br />\nstrain of jazz ceased to re- which weeds out the Engineering<br />\nThe members of the faculty are<br />\nleague to which •he belongs, he a Hopkins professor, and several of<br />\nverberate<br />\nthru the Maryland Cas- 'School and exacts a fearful toll<br />\nsaid, is \"to promote among college the poems are reprinted from the dubious about expressing any opinualty<br />\nRoom, many couples, yearly. This year's figures are<br />\nBall<br />\nion as long as the new plan is in<br />\nmen and women an intelligent un- NEWS-LETTER<br />\nand the Johns Hop- as nebulous a state<br />\nlig-ht<br />\nand light hearted, even higher than usual. In one<br />\nfooted<br />\nas at present.<br />\nderstanding of the labor mOvekins Alumni Magazine.<br />\nsucceeded<br />\nthe<br />\nlast night of the section of Physics I sixteen out of<br />\non<br />\nThey want something more definite,<br />\nment and of the movement toward<br />\nexamination<br />\nseason<br />\nin driving twenty-eight received less than six<br />\nThe familiar \"knowest thou that a thoroughly articulated plan, bea new social order based on proaway<br />\nall<br />\ntraces<br />\nof care.<br />\nas a final mark.<br />\nduction for use and not for profit.\" fair land\" from Goethe's Wilhelm fore they will risk their reputation<br />\nBlue<br />\nTwelve,<br />\nThe<br />\nJay<br />\nas<br />\nusual,<br />\nby<br />\nmaking<br />\nstatements,<br />\neither for or<br />\nAcademics Hit<br />\nSuch an organization for such a Meister is one of the poems which<br />\nsupplied music with untiring conBut it is in the supposedly easy<br />\npurpose would not be necessary, first appeared in the NEWS-LETTER. against any plan.<br />\nsistency. The dances were long College of Arts and Sciences that<br />\nFew Votes from Undergrads<br />\nhe explained, if it were not for the It is entitled Mignon and was writand the intermissions were pleas- the mortality is most surprising.<br />\nUndergraduates were asked to<br />\nfact that there is a great deal of ten in Dr. Wight's undergraduate<br />\nantly short. The musicians were The Freshman Class seems to be<br />\nexpress<br />\ntheir opinions through the<br />\nmisunderstanding,<br />\nindifference, days. At the Tomb of His Brother<br />\nindeed, wholly justified in wear- bearing the brunt<br />\nof the faculty's<br />\nand ignorance between the world from Catullus is the other reprint medium of a printed form printed ing<br />\nacross their bosoms the black attacks. One-fifth of<br />\nin<br />\nthe large<br />\nthe<br />\nNEWS-LETTER.<br />\nReplies<br />\nwere<br />\nof labor and the world of college. from the NEWS-LETTER.<br />\nThe<br />\nand blue ribbon which may have History 2<br />\nclass<br />\nhave<br />\nnot<br />\nfailed<br />\nnumerous,<br />\nto rethe<br />\nmen<br />\neither not<br />\nThe remedy for this state of af- Alumni Magazine's reprints are<br />\nsignified royalty in the realm of ceive a<br />\npassing<br />\nmark.<br />\nhaving<br />\nOut<br />\nof<br />\nany<br />\nthe<br />\ninterest or preferring<br />\nfairs, he went on, is for college mostly in memoriams of famous<br />\ndance syncopation.<br />\nnine<br />\nEnglish<br />\nComp. sections the<br />\nmen to realize that the labor situ- men associated with Hopkins. to follow the advice of Dean Ames, Those who served on the recepation in the United States is some- Among those eulogized are Revere who did not seem to relish the idea tion committee were Dr. and Mrs. six whose marks have been posted<br />\nthing that deserves attention and Osler, Basil L. Gildersleeve, Kirby of the NEWS-LETTER taking a vote, Broadus Mitchel and Mr. -and show forty-eight marks below six<br />\nand thirty-three others below sevstudy, in the name of humanity Flower Smith, and Edward H. as long as no really definite plan Mrs. Herberton Evans.<br />\nen. Thus a total of eighty-one in<br />\nhad been presented for consideraand the general welfare of the Spieker.<br />\nAfter the \"Jays\" had begun to<br />\nonly six 'sections will be unable to<br />\ntion.<br />\nThe<br />\nreplies<br />\ngave<br />\nthe<br />\nfollowcountry.<br />\nThe main work of the volume is<br />\nharmonize \"Bill\" Rogers did his<br />\ning<br />\npresent this course for graduation.<br />\nresults:<br />\nFor<br />\nthe<br />\nchange,<br />\n12;<br />\nDiscusses Three Ideals<br />\na five act tragedy in blank verse endancing act. At intervals, followagainst<br />\nthe<br />\nThose<br />\nwhose marks range from<br />\nchange,<br />\n15;<br />\nalternate<br />\nThree ideals for which the pres- titled Sir Thomas More. The maing, Rogers and Webster sang a<br />\nplans,<br />\n2.<br />\nsix<br />\nThe<br />\nto<br />\nsmallness<br />\nseven<br />\nmay make this up in<br />\nof<br />\nthe<br />\nreent labor movement is striving jority of the other poems, exclusive<br />\nfew of the latest songs. Webster<br />\nply<br />\ndoes<br />\nnot<br />\noffer<br />\nthe<br />\ncoming<br />\na<br />\nbasis<br />\nsemester by procuring<br />\nfor judg- scored a hit when he sang the<br />\nwere discussed by Mr. Blanchard. of those previously published,'deal<br />\nThe first one he called \"Wealth- with the sea. Dr. French points out ing the opinion of the undergrad- words of \"(My Best Gal\" to a high- a total average of seven. The<br />\ndeath-rate in the Romance DeContinued en page 4, col. 1.<br />\nopia.\" What he wanted to get at in the Foreword that Dr. Wight<br />\nly appreciative audience.<br />\npartment is evidenced by the rewas this: There is enough wealth knows the sea well, having been<br />\nThe high mark of the season<br />\nsults<br />\nfrom one section. Only 'seven<br />\nJUNIORS<br />\nAND SENIORS TO was reached in the second Coin America for everyone; yet by born within sight of it and having<br />\n.out<br />\nof<br />\na large class received passDEBATE FEB. 13<br />\nactual statistics, from one-third to spent much of his life at sea. In<br />\ntillion. The Board cleared all exmarks.<br />\ning<br />\none-half of the working class do the foreword Dr. French also traces<br />\nThe annual Junior-Senior de- penses. No definite statement can<br />\nnot get a minimum comfort wage. the author's work in the Kottabos bate will be held in the Civil Engi- yet be made of the actual condiPol. Econ. a Waterloo<br />\nThis means that there is an un- Club, \"a small circle of men asso- neering Hall on the night of Feb- tion of the financial end, but since<br />\nUpper classmen in the Acaequal distribution of wealth in the ciated in one way or another with ruary 13. The subject for the de- the purpose of the affair was not deniic Schoo.1 found Pol. Econ. I,<br />\nUnited States, causing the two ex- the Johns Hopkins University or bate will be: \"Resolved, Maryland to make money, the results are section \"b,\" their Waterloo. Of<br />\ntremes of luxury and poverty. Goucher College, who meet period- should ratify the Child Labor generally proclaimed satisfactory.<br />\nContinued on page 4 col. 3<br />\nAlso, the rich man-is not always ically to share their literary inter- Amendment.\" A dance will follow,<br />\nunless arrangements of the Debat- CONTEMPORARY PUBLICATION GIVES<br />\nests.\"<br />\nContinued on page 4 col. 2<br />\ning Council miscarry.<br />\nESTIMATE OF UNIVERSITY'S FOUNDER<br />\nJ. H. U. SONGS AND YELLS HEARD OVER<br />\nBefore the mid-year examinations<br />\nRADIO STATION W G Y BY THOUSANDS the try-outs for the two teams were Time ravaged pages of a pub- and he did much for the welfare<br />\nheld. Dr. John C. French selected lication of the early seventies of future generations.<br />\nRadio has now served at least have afforded the time to \"tune from the few candidates the fol- have disclosed, in the terms of his \"Indeed,\" says the \"Monumenone useful purpose. Hopkins in.\"<br />\nlowing men: Seniors—Elmer C. contemporaries, a glimpse of the tal City\", \"his career is marked by<br />\nsongs and yells were put on the<br />\nAbout five hundred men, repre- Mylander, William Wolfe, and character of Johns Hopkins. The his constant correction of the comair from station \"W G Y,\" of the senting forty-five American and William P. Calhoun; Juniors— \"Monumental 'City,\" describing mercial. ailments of the city.<br />\nThe same article gives a short<br />\nGeneral Electric Company, on the foreign colleges and universities, George Davies, John R. Webster, Baltimore, at the zenith of its<br />\nevening of Saturday, January 31, participated in the entertainment. and Henry R. Turnbull. Robert post-war commercial prosperity, sketch of Johns Hopkins' life hisas part of the \"Intercollegiate High spots of the concert were Hopkins was selected as the Junior expresses in a brief biography, the tory, and a description of what<br />\nN'ight\" program. The Hopkins songs by the British Empire alternate.<br />\ngratitude of the city to the foun- might be gained by the city<br />\nselections were rendered by grad- group, consisting of college men<br />\nUntil 1918 a trophy was awarded der of the Johns Hopkins Univer- through the coming establishment<br />\nof the University bearing his<br />\nuates of the University who are from. New Zealand, Australia, the winning team, and a plaque com- sity and Hospital.<br />\nnow in the employ of the General South Africa, Canada and the memorating their victory was hung<br />\nThe \"Monumental City\" says name. At that time the trustees<br />\nElectric. One of them, C. Howard British Isles; a burlesque skit pre- in the Barn. In the twenty-one that, even while he was amassing were looking about for the first<br />\nBlack, '24, sent an announcement sented by the Massachusetts In- years between the first debate for his personal fortune, Johns Hop- President, and plans were 'still in<br />\nof the concert to the New's-Letter, stitute of Technology alumni; na- which a trophy was awarded, 1898, kins made the goal of the better- a nebulous state. However, it<br />\nbut since the mid-years were then tive songs by a quartet of gradu- until the last was hung on the Barn's ment of Baltimore one with his was planned to build the new Uniin full' swing no issue came out, a tes of the Royal Polytechnic In- walls, the Seniors had won eleven personal goal of making a large versity on four hundred acres of<br />\nand even if it had, undergraduate stitute of Sweden; and native =- debates to the Junior's nine. Records fortune. Never in his career did \"Clifton,\" Johns Hopkins beautiradio enthusiasts could not well sic played by Chinese engineers. since that time are not available.<br />\nhe forget the needs of the city, ful suburban estate.<br /><br />\nTHE JOHNS HOPKINS NEWS -LETTER, FEBRUARY 6,1925<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nHomewood 0100<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALDER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br />\nRICHARD R. GRIFFITH, '28<br />\nRALPH KIRKLEY, '28<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br /><br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br /><br />\nCirculation Manager<br />\nOTHo J. KELLER, III, '26<br /><br />\nAssistant Business Managers<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT r. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br />\nROBERT S. JACOBS, '25<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., FEBRUARY 6, 1925<br /><br />\nTHE AFTERMATH<br />\nThe midyear ex=inations have come and gone, taking with them<br />\na heavy toll. To those who have been dropped we can only wish reinstatement, or success in other lines. To those fortunate ones who<br />\nremain, tr,<br />\n;n particular, we can give more useful advice.<br />\nMuch can be learned from the examinations, from failure as well as<br />\nsuccess. The majority of new students during their first half year of<br />\ncollege work more or less in the dark. The midyears have, or should<br />\nhave, cleared up many 'doubtful points.<br />\nThose who have passed all their courses have gained confidence in<br />\nlearning that examinations are not insurmountable obstacles, but for the<br />\nmost part fair tests of one's general knowledge of a course. The students who have failed one or two courses should learn the more useful<br />\nlesson of realizing the seriousness Of college work; and of not looking<br />\nat the absence of daily work, such as that required in preparatory school,<br />\nas an opportunity to loaf through the year. They should learn how to<br />\nstudy, and realize that one week of violent cramming is worth nothing<br />\nin comparison to steady preparation and note-taking throughout the<br />\ncourse.<br />\nA little celebration and relaxation after the strain of the midyear's<br />\nis quite natural and in fact necessary, but the danger lies in over indulgence and allowing class work to slide from week to week. Now is the<br />\ntime to begin to work, for soon the rush of spring activities and an epidemic of spring fever will make study more difficult. All the men who<br />\nremain, from those oil the most ragged edge to those who were the most<br />\nsuccessful, should profit by the lessons learned in the last two weeks,<br />\nand remember that the finals will come just as inevitably as did the midyears.<br /><br />\nJ.<br />\nTHE SPIRIT REMAINS<br />\nWith the lifting of regulations, the \"frosh\" is no longer distinguished<br />\nfrom the presumably wiser upper-classmen. We congratulate them on<br />\ntheir release from the petty burden of cap, button, and the rest. However, it is our earnest hope that the joy of the freshmen in their newfound freedom will limit itself to the usual appalling array of glaring<br />\nsocks and neckties, rather than in the forgetting of the valuable lessons<br />\ntaught by the regulations.<br />\nThe newly emancipated freshman is still on the lowest rung of the<br />\ncollegiate ladder. If he fails to realize this even more than he did during<br />\nthe hectic \"paddle-swinging\" days of the early fall, he has missed the<br />\nspirit and purpose of the regulations. The letter of tine rules has been<br />\nremoved, but the spirit remains. There is no longer a system of game<br />\ntags, but there are still games to be supported; no more yells to be learned,<br />\nbut there are still Hopkins teams to be cheered; no more compulsory<br />\nspeaking on the campus, but the spirit of friendship should still prevail.<br />\nThe basic spirit of the regulations is to make the freshman a better<br />\nHopkins man and the \"frosh\" should \"carry on\" even more willingly, although the regulations have been lifted.<br /><br />\nMYSTERIOUS TRACKS DRAW INTEREST<br />\nOF CAMPUS SHERLOCK HOLMES<br />\nStarting mysteriously in front<br />\nof the main entrance of Gilman<br />\nHall, running down the steps, the<br />\nlength of the quadrangle, over the<br />\nslope, across the bowl and into<br />\nCharles street are two tracks of<br />\nautomobile tires engraved in the<br />\nfast disappearing snow.<br />\nStudents on their way to school<br />\nfor the first day of the second semester last Wednesday were astonished at the peculiar route<br />\ntaken by the wandering motorists.<br />\nMany followed the tracks up to<br />\nwhere they started on the steps<br />\nof Gilman Hall.• Some looked inquiringly at each other while others winked knowingly.<br />\nCampus sleuths have deduced<br />\nthe fact that the tracks were laid<br />\non Tuesday night, the evening of<br />\nthe last day of the exam period.<br />\nThis fact disclosed a motive for<br />\nthe deed. Working on the size<br />\nand depth of the tread the engi-<br /><br />\nneer detectives figured out the<br />\nweight of the machine and finally<br />\ncame to the conclusion, through<br />\nthe process of elimination, that<br />\nthe vehicle in the case must have<br />\nbeen a flivver.<br />\nIt is conjectured that the driver<br />\ndrove up on the steps of Gilman<br />\nI-Tall, turned around and headed<br />\nin a straight line toward Charles<br />\nstreet at no slow speed.<br />\nA rumor has arisen,at the Barn<br />\nwhich has it that a certain senior<br />\nreceived a \"10\" in an examination<br />\non one of his courses of which he<br />\nwas doubtful, and wished to celebrate in a unique manner. This<br />\nsenior, having set what is his ideal<br />\nexample for the other undergraduates, is now boasting of having<br />\naccomplished something that no<br />\none else in the University ever<br />\ndid, and at the same time having<br />\ncelebrated his victory over<br />\nstudies.<br /><br />\n1111•M'<br /><br />\nThe FOUNTAIN PEN INKfor ALL PENS<br />\nThe Business<br />\nMan's Ink is<br />\nBLUE-BLACK<br /><br />\nSANFORD'S<br />\nPen Ink<br />\nFountain<br /><br />\nIT'S PERMANENT<br /><br />\n•<br /><br />\nDamon—<br />\n\"What was the matter<br />\nwith Professor Henry this<br />\nmorning? I've never seen<br />\nhim so peeved. He seemed<br />\nto be boiling over.\"<br /><br />\nPLAYSHOP TO DRIVE OFF BELAIR QUIET TO BE DISTURBED BY HOPKINS<br />\nGLOOM OF MIDYEARS<br />\nWITH DANCING<br />\nMUSICAL CLUB<br />\nDramatic Organization's Plans Call for Country to Be Invaded by Black and<br />\nBlue Musicians; Concert to Be<br />\nAmbitious Program Including<br />\nHeld in Blair Armory<br />\nDance and Shop Night<br /><br />\nExtensive and eventful is the<br />\nprogram of the Homewood Playshop arranged for the next half<br />\nyear. Like everything else, the<br />\nactivities' of the Playshop have<br />\nsuffered a partial eclipse during<br />\nthe past few weeks because of interference by the inevitable midyear exams, but Dr. Small heralds<br />\na busy season for the rest of the<br />\nyear.<br />\nA major event of the program<br />\nis the Valentine Dance to be held<br />\nFebruary 14th. All Hopkins students are invited to this much<br />\nlooked forward to affair. Tickets<br />\nwill not be sold at the door. They<br />\nmust be obtained before the night<br />\nof the dance.<br />\n\"Play-Tea\" on February 22<br /><br />\nCommemoration Day, Feb.<br />\n22nd, is the next important event<br />\non the schedule. On this date, one<br />\nof the entertaining \"Play-teas\"<br />\nwill be given in the Campus Theater in the afternoon for the faculty and students. A feature of<br />\nthe tea will be the one-act play<br />\n\"Washington's First Defeat,\"<br />\nwhich is to be put on twice during the course of the afternoon,<br />\nfrom 3:00 to 5 :30. There will be<br />\nno charge for admission to this<br />\ntea.<br />\nFollowing the custom of past<br />\nyears a Shop-night program will<br />\nbe presented on February 28th.<br />\nTwo original one-act plays will be<br />\npresented and will be followed by<br />\ndancing. Members of the Playshop will be admitted by card; a<br />\ncharge of $.75 will be made for<br />\nnon-members.<br />\nThe March public bill, to begin<br />\nMarch 12th, is .also being prepared<br />\nand will consist of thre one-act<br />\nplays to be announced later.<br />\nAll students who wish to co-operate in any way with these activities are asked to speak to Dr.<br />\nSmall.<br /><br />\nBelair is a quiet town. A peaceful<br />\nair of repose, of colonial quiet hovers over the sleeping village. A man<br />\nwith insomnia can sleep in Belair.<br />\nTonight Belair loses its olden<br />\ncharm; rank modernism will invade<br />\nthe place. And modernism will be<br />\nwelcomed with open arms. Belair<br />\nis hospitable, and it has an eye<br />\nopen, in spite of its seeming somnolence, for its own interests. One<br />\nyear ago Belair was invaded with<br />\nthe aforementioned modernism, and<br />\nit liked the new idea. Like wine to<br />\nits aged bones, like nectar to poor<br />\nhumans, was this modern spirit.<br />\nThen Belair awoke, had one riotous<br />\nnight of fun—and then the Johns<br />\nHopkins Musical Club left town.<br />\nTonight the air will again be rent<br />\nwith the strains of college boys singing in close harmony, with the<br />\nplunking of collegiate banjos, and,<br />\nmost modern of all, with the nerve<br />\ntacking tooting of the Blue Jay<br />\nOrchestra. For tonight, after a<br />\nyear's absence, and a year's quietude<br />\nfor Belair, the Hopkins Musical<br />\nClub will visit the Harford County<br />\nMetropolis.<br />\nHappy Until One<br /><br />\n,41 Also<br /><br />\nPythias—<br />\n\"Boiling over is good. He<br />\nwas. Didn't you notice<br />\nwhy? The old boy had mislaid his Eldorado pencil.\"<br /><br />\nEwoffiw<br />\nUemastereharakopiwar<br />\n17 leads—all dealers<br />\niii...••••••••••••••11.11.11.111....11111111W<br /><br />\ncjhe largest selling<br />\nquality pencil<br />\nin the world<br />\n17<br />\nblack<br /><br />\ndegrees Superlative in quality,<br />\nthe world-famous<br /><br />\n3<br />\ncopying<br /><br />\n[ENUS<br />\nPENCILS<br />\ngive best service and<br />\nlongest wear.<br /><br />\nBuy<br />\na<br /><br />\ndozen<br /><br />\n$1.00<br />\nPlain ends, per doz.<br />\nRubber ends, per doz. 1.20<br />\nclt all dealers<br /><br />\nLead Pencil Co.<br />\n220 Fifth Ave., N.Y.<br /><br />\nAmerican<br /><br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWF.I FRS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\nLATEST STYLES AND FORMS<br /><br />\nBoys from Baltimore and belles<br />\nEngraved Wedding Invitations<br />\nfrom Belair will embrace one an- Announcements and Visiting Cards<br />\nother in modern dances. (A dance<br />\nSAMUEL H. KIRBY<br />\nas usual will follow the concert.)<br />\nENGRAVER<br />\nEveryone will be happy until at<br />\nSamples and Prices on Request<br />\nleast one A. M., and then, with the 42 SOUTH ST.<br />\nBALTIMORE<br />\ndeparture of the buses for Baltimore, Belair will settle down for<br />\nCollege and Fraternity Stationery<br />\nanother year. The Belair Armory Banquet and Dance Cards, Invitations<br />\nwill be the scene of the fracas, and<br />\nJAS. H. DOWNS<br />\nthe time of the first round will be<br />\neight-thirty. The program does not ENGRAVER PRINTER STATIONER<br />\n229 N. CHARLES ST.<br />\nfollow.<br />\nAV<br /><br />\nGet Extra Credits at Home<br />\nMore than 450 courses in History, English, Mathematics,Chemistry,<br />\nZoology, Modern Languages, Economics, Philosophy,Sociology,etc.,<br />\nare given by correspondence. Learn how the credit they yield may<br />\nbe applied on your college program. Catalog describing courses fully,<br />\nfurnished on request. Write today.<br /><br />\nrEbe Zilintimaiitp of effirago<br />\n95 ELLIS HALL<br /><br />\nCHICAGO. ILLINOIS<br /><br />\nNOTICES<br />\nNEWS-LETTER<br />\nRegular meeting of entire<br />\nNews-Letter staff and candidates<br />\npromptly at 12.20 today in NewsLetter office at Barn.<br />\nCOTILLION CLUB<br />\nDance in C. E. Hall, 9 P. M.<br />\ntomorrow night, admission $1.00.<br /><br />\nBaltimore's Best Store<br />\nHOCHSCHILD,KOHN 8c CO.<br />\nHoward and Lexington<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, FEBRUARY 6. 1925<br />\n\"Y\" DINNER TUESDAY AT<br />\nPERSONALITY AND INDIVIDUALITY<br />\nMEETING HOUSE<br />\nOF INMATES REFLECTED BY JOHNS<br />\nThe Y. M. C. A. will give its<br />\nHOPKINS HOME WOOD STRUCTURES monthly Fellowship Dinner at the<br />\nFriend's Meeting House next<br />\nTuesday at 6 P. M. Father J. A.<br />\nRyan, a famous socialist, and a<br />\nat the Catholic UniverProfessor<br />\nAll houses have a personality of opposite of dreamy picturesque<br />\nspeak on, \"The Child<br />\nwill<br />\nsity<br />\ntheir own. Some characteristics of Gilman Hall. Its corridors resound<br />\nFather Ryan<br />\nAmendment.\"<br />\nLabor<br />\ntheir owners seem to saturate the With the hum of motors. Students<br />\non all<br />\nauthority<br />\nknown_<br />\nwell<br />\na<br />\nis<br />\ndwelling. A New England Uni- bustle around its corners. Little<br />\n'discuss<br />\nand<br />\nwill<br />\nquestions,<br />\ntarian church gleaming white in the red and green lights assure perfect social<br />\nSpring sunshine, a Southern man- traffic. Signs are neatly printed. the question from all angles.<br />\nOther work of the•Y. M. C. A.is<br />\nsion in Georgian brick, and a funer- The visitor might spend a day withfull swing at the present time.<br />\nin<br />\nmore<br />\nseeing<br />\nal director's home each has its own in its walls without<br />\nmen from Hopkins will<br />\nEighteen<br />\nthan a signature in long hand.<br />\nPersonality.<br />\nInter-State Student<br />\nthe<br />\nattend<br />\nThis flavour of the inmates which Stenographers are brisk and busiwill be held unwhich<br />\nConference,<br />\nChanges a house into a living per- ness-like. The professors wear<br />\nthe Student<br />\nof<br />\nauspices<br />\nthe<br />\nder<br />\nsonality- is very noticeable among stiff collars, work in their shirtthe Univerat<br />\nUnion,<br />\nthe buildings of the Homewood sleeves, and smoke pipes. Restless, Volunteer<br />\n0, 14,<br />\nFebruary<br />\ngroup of the Johns Hopkins Uni- ceaseless, wide-awake energy radi- sity of Delaware,<br />\nadbe<br />\n15. The Conference will<br />\nates from it.<br />\nversity.<br />\nGilman Hall with its stately cuThe Barn has had a strange dressed by many famous speakers.<br />\nThe \"Y\" is preparing for the anPola and broad marble steps is the change of personality. Its Barn<br />\nnual<br />\nStudent Fellowship fund<br />\nproIts<br />\nacme of scholarly culture.<br />\ndays are ended and at present its<br />\nwill take place during<br />\nwhich<br />\ndrive,<br />\nthe<br />\nfessors and students pursuing<br />\none of the the latter part of February. The<br />\nmixed<br />\nthe<br />\nis<br />\npersonality<br />\ngentle Arts and Sciences have impressed their nature on the building. undergraduate school. Activities Hopkins \"Y\" has contributed to<br />\nHistory, literature, philosophy,— and food are its chief characteris- this fund for a number of years,<br />\nthese and kindred snbjects—have tics. At times there is an atavistic and hopes to raise more than ever<br />\ngiven Gilman Hall.a dignified, som- impulse, when the herds of students in 1925. The fund is for the purresemble the Barn's former inhab- pose of aiding European students<br />\nnolent, and scholarly -air.itants.<br />\nwho have been made unable to<br />\nThe Civil Engineering- Building<br />\nThe new Chemistry Building is -:ontinue their education without<br />\nis rather in between the sedateness<br />\nof the scholar and the mechanical too new to have a distinct person- aid, owing to conditons brought<br />\nMatter-of-factness of the engineer. ality. Housing, as it does, the offi- about by the War.<br />\nIts halls are cleanly swept, quiet. cers of the University, it has a<br />\nand dignified, but there seems to be rather official and authoritative air.<br />\na sense of order peculiar to the en- New and important it is, but it has<br />\nnot as yet achieved its own pergineering nature.<br />\nThe M. E. Building is the direct sonal flavour.<br />\nGilman Hall is Acme of Scholarly Culture, C. E. Hall Combines<br />\nSedateness with Order, M. E. Hall Typifies Action<br /><br />\ngor Young Men<br />\nThere is nothing like a<br /><br />\nSTETSON<br />\nOST young men today<br />\nknow theimportance of<br />\nlooking fit. Good appearance counts much<br />\nin the game of life. The young<br />\nman who dresses with taste has<br />\na decided advantage.<br />\nBut—it is surprising how little<br />\nthought the average man gives<br />\nto his hat. It is his crown, yet he<br />\nseems to stop dressing at the neck.<br />\nBe careful in your selection of<br />\nyour headwear. When you buy a<br />\nhat, select a Stetson. Its style is<br />\nright,its quality means long wear._<br /><br />\nVAGABOND ACTRESS WILL LAST OF FEBRUARY BUSY<br />\nFOR FACULTY, ALUMNI,<br />\nHELP TRAIN \"FEMALES\"<br />\nUNDERGRADUATES<br />\nFOR BARNSTORMERS<br /><br />\n-141,<br /><br />\n:<br /><br />\n•\"\" ,<br /><br />\nHilda Bergner to Attend Sunday Re- Commemoration Day and Alumni<br />\n• Meeting Will Crowd First Part<br />\nhearsal. Tentative Cast Chosen for<br />\nof February<br />\nFirst Pictures<br /><br />\nHilda Bergner, Vagabond star,<br />\nWill try to feminize the leading<br />\nCandidates for the Barnstormers<br />\nPlay, \"The Tailor-Made Man.\"<br />\nMiss Bergner will attend the Sunday afternoon rehearsal at the<br />\nBarn and will try to make \"perfect<br />\nladies\" of the embryo Julian Eltinges.<br />\nMiss Bergner has had a wide<br />\nstage experience and has been connected with the Vagabond Players for several years. She has<br />\nstarred in Fashion and The Silver<br />\nLox this winter and is at present<br />\nPlaying an important role in her<br />\nthird play of the season.<br />\nPictures for their forthcoming<br />\nproduction will be taken tomorrow at the Bachrach Studios. For<br />\nthis purpose a tentative cast of the<br />\nPrincipal roles has - been Picked.<br />\nTen or fifteen men will be sent to<br />\nthe studios to assume the leading<br />\nMale and female characters.<br />\nThe tentative cast picked so far<br />\nis as follows:<br />\nI E. Rodgers<br />\nJohn Paul Bart<br />\nAbraham Nathan....Gordon Post<br />\n.....Chauncey Tatum<br />\nHuber<br />\nGeorge Hess<br />\n*Pomeroy<br />\nJerome Schapiro<br />\n-Peter<br />\nPemale Roles—John Desch, Mortimer Slatkin, John English,<br />\nFendall Cushing, Charles Reese<br />\nMembers of the club were also<br />\nsent with the others to impersonate the smaller parts for the photographs. These will be: Gordon<br />\nStick, Alger Hiss, Philip Sachs<br />\nand Kelso Morrill. Promising<br />\nfreshmen including Donald White,<br />\nRidgely Warfield and Donald<br />\nGiese, will also be photographed.<br /><br />\n,WM11001:<br /><br />\nTh<br /><br />\nCommemoration Day following<br />\nhard upon the heels of an alumni<br />\nmeeting Feb. 21 will make the<br />\nearly twenty's of this month busy<br />\ndays for students and graduates.<br />\nAt the alumni meeting Dr.<br />\nGoodnow will make an address<br />\nelaborating the plan for undergraduate instruction. It will be<br />\nthe first official gathering of any<br />\nof the alumni since the meeting of<br />\nthe Alumni Council on Jan. 31, to<br />\ndiscuss revamping collegiate instruction. Dr. Goodnow will make<br />\na short address to the entire body<br /><br />\n••<br /><br />\nWinning the West<br /><br />\nof alumni.<br />\nBesides the unusual date of<br />\nCommemoration Day there will be<br />\nan honorary degree conferred<br />\nupon 0. D. Young, Chairman of<br />\nthe Board of Trustees of the Walter Hines Page School of International Law. Mr. Young played<br />\na major part in the formulation of<br />\nthe Dawes Plan last year.<br />\nAfter the Commemoration exert<br />\ncises have been completed the<br />\nPresident's luncheon will be held<br />\nin Gilman Hall. All members of<br />\nthe faculty down to the Associate<br />\nProfessors will be invited.<br />\nAs the cast so far is entirely<br />\ntentative Coach Walter B. Swindell, Jr., has far from made up his<br />\nmind as to the final cast. Changes<br />\nwill be made at every rehearsal<br />\nand he will endeavor to shift the<br />\ncandidates into the roles most<br />\nsuited for themselves.<br />\nRehearsals, discontinued during<br />\nthe examination period, will begin<br />\nagain this evening at the Barn.<br /><br />\n•<br /><br />\nIrrigation by electrically driven pumps has made<br />\nhundreds of thousands of acres of desert land in the<br />\nIntermountain West blossom like the rose.<br />\nFor a few cents a month per acre, electricity—the giant<br />\nworker—brings the life-giving water from distant lakes<br />\nand rivers to rainless valleys, producing rich harvests<br />\nof fruits and vegetables, cereals and forage.<br /><br />\nThe General Electric Company provides for agriculture little motors that do the<br />\nfarm chores and great ones<br />\nthat operate mammoth<br />\npumps to irrigate vast<br />\nstretches of arid valleys.<br /><br />\nWhat electricity is doing for the farmer is only a<br />\ncounterpart of what it is doing for Industry, Transportation, City and Country life or any of the professions. It is a tool ready for your use and which, wisely<br />\nused, will make the impossible of today an accomplished<br />\nfact tomorrow.<br /><br />\nIf you are interested in<br />\nlearning more about what<br />\nelectricity is doing, write<br />\nfor Reprint No. AR391 containing a complete set of<br />\nthese advertisements.<br /><br />\nHow electricity does these things is important to the<br />\nstudent in a technical school—but what electricity can<br />\ndo is important to every college man or woman, no<br />\nmatter what their life's work may be.<br />\nI47DH<br /><br />\nGENERAL<br /><br />\nELECTRIC<br /><br />\nEi i.CTR1C<br /><br />\nCOMPANY,<br /><br />\nSCHENECTADY,<br /><br />\nNEW<br /><br />\nYORK<br /><br />\n4<br /><br />\n17IE JOHNS HOPKINS NEWS-LE r1ER, FEBRUARY 6, 1925<br /><br />\nMID-YEAR REVERIES<br /><br />\nSENIORS<br />\nJUNIORS<br />\nSOPHOMORES<br />\nFRESHMEN<br /><br />\nSi. Regis<br />\nRESTAURANT<br />\n1817 N. Charles St.<br /><br />\nOpen All Hours<br /><br />\nNear Your Campus<br /><br />\nR. G.Loy &amp; Company<br />\n(Robert G. Loy)<br /><br />\nPHARMACISTS<br />\nUNIVERSITY PARKWAY<br />\nAt Charles St.<br /><br />\nPayne &amp;Merrill<br /><br />\n'BOUT four hundred<br />\nHOPEFUL frosh<br />\nCOME to sign the<br />\nROLL by gosh!<br />\nSOPHS wield paddles,<br />\nJUNIORS yell<br />\n\"SOCK lim freshman,<br />\nGIVE 'em hell!\"<br />\nRUSHING season<br />\nIN full sway,<br />\nTHIRD November<br />\nFATEFUL day,<br />\nCOMES the Maryland<br />\nFOOTBALL game—<br />\nMARYLAND nothing,<br />\nHOPKINS same.<br />\nTHEN informals<br />\nHIT the place.<br />\nMANY a stude with<br />\nDOLEFUL face.<br />\nSOON vacation<br />\nCOMES along—<br />\nWINE and women,<br />\nALSO song.<br />\nMIDYEAR'S coming,<br />\nBLACK outlook;<br />\nNO one yet has<br />\nCRACKED a book.<br />\nEVERY body<br />\nWANTS to stay,<br />\nLIBRARY filled most<br />\nEVERY day.<br />\nTHUNDER falls; those<br />\nLEFT behind<br />\nSETTLE down to<br />\n\\ SAME old grind.<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br /><br />\nNORTH GERMAN LLOYD<br /><br />\nSPECIAL SUMMER EXCURSIONS<br /><br />\nJanuary 17, 1925.<br />\nTO EUROPE<br />\nTo the Editor of the News-Letter.<br />\nFOR TEACHERS AND STUDENTS<br />\nDear sir:<br />\nENTIRE THIRD CLASS RESERVED<br />\nYour article in the issue of JanCONDUCTED TOURS IN EUROPE (all expenses paid)<br />\nuary 16, about the Valentine<br />\nARRANGED, IF DESIRED<br />\nDance is slightly incorrect when it<br />\nA. SCHUMACHER &amp; CO.<br />\nis indicated that the subscription<br />\nGENERAL AGENTS<br />\nCHARLES AND REDWOOD STS.<br />\nlist will be limited to members of<br />\nthe Playshop.. I take full responsiBRANCH<br />\nbility for giving this false impres- AT THE<br />\nBARN<br />\nsion to your reporter; but I would<br />\nlike to correct the error at this<br />\ntime if The Playshop might again<br />\nask indulgence from you who have<br />\nalways been so kind and encouraging.<br />\nWhile constitutional require'<br />\n6<br />\nDOUG<br />\nTURNBULL<br />\nTOM<br />\nMAGILL,<br />\nments demand that the first inviRepresentatives<br />\nManager<br />\ntations for the Valentine Dance<br />\nIfP.TN_Fg-gmust go to the members, the subgg<br />\n- -gPIEFOrgg<br />\nscription list will not omit the<br />\nname of any man on the university campus who wants to attend.<br />\nLarge discretion in the making up<br />\n\"THE WONDER MOTOR FUEL:<br />\nof the list has been given me, and<br />\nMeets Every Requirement of<br />\nI assure you that the undergrads<br />\nPerfect Motor Performance<br />\nwill never have anything of which<br />\nto complain at my hands.<br />\nSHERWOOD BROTHERS, INC.<br />\nYours truly,<br />\n222 &amp; 224 W_ Baltimore St.<br />\nAlbert Langeluttig.<br />\nIREIRRWEIPIRMITTPJE,<br /><br />\nf Gsiort Ouality.<br /><br />\nN.Charles Sfreet.<br /><br />\nWARNER &amp; CO.<br />\nHatters<br /><br />\nBETHOLIN<br /><br />\nHATS—OVERCOATS<br />\nNECKWEAR<br /><br />\nCLOTHIERS<br />\nHABERDASHERS PAUL BLANCHARD ADDRESSES ASSEMBLY<br /><br />\nON LABOR MOVEMENT AND ITS IDEALS<br />\n315 Charles St. North<br /><br />\nContinued from page 1<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nrich because of his superiority of breath and saying: \"I believe that<br />\nmerit, but sometimes only through if we can unite the brains and ininheritance, luck or ruthlessness. fluence of the college with the<br />\nDeveloping What labor wants in order to moral ideals of religion and the<br />\nKodaks<br />\n.Xff:'Corner CJcz yelie and g'utaw Sts.<br />\nPrinting<br />\nCameras<br />\nremedy these conditions is a min- economic power of labor, we may<br />\nEnlarging<br />\nSupplies<br />\nimum wage law and a law for the most certainly build up a great in-Where Wholesale and Retail Districts Meet\"<br />\nconfiscating by taxation of most of dustrial democracy.\"<br />\nwealth belonging to people unAt the conclusion of the talk,<br />\nZepp Photo Supply Co. the<br />\ndeservedly rich.<br />\nthe<br />\nAssembly was brought to a<br />\n3044 Greenmount Ave.<br />\n\"Workopia\" was the second close with the presentation<br />\nof a<br />\nideal named by Mr. Blanchard and silver cup given by the InterfraLet Us Develop Your Films<br />\nby this he meant a just distribu- ternity Board. to the ,fraternity<br />\nLeave Them Today—<br />\ntion of work. Modern machinery, reaching the highest scholarship<br />\nand individuality is offered here at prices that are not<br />\nGet Them Tomorrow<br />\nhe said, has not lifted the burden average. The Delta Gamma Theand cannot be underquoted by any house at any time.<br />\nfrom the working man's shoulders' tas were the winners, with an av41Besides the reputation of an old-established firm<br />\nTHE FLAG, BANNER AND or varied the deadly monotony of.<br />\nis back of each sale with a guarantee.<br />\nerage of 80.1.<br />\nPENNANT SHOP<br />\nfactory work. And the present<br />\nSuccessors to SISCO BROTHERS industrial system is so organized<br />\nFlags, Banners, Pennants, Arm<br />\nMID-YEAR EXAMS EXACT TOLL<br />\nBands, Emblems, Church and Society that the laborer must bear the<br />\nContinued from page 1<br />\nGoods, Gold, Silver and Antique brunt of long hours with meagre<br />\nFURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nBraids, Fringes, Tassels, Beads and<br />\npay. What labor wants is that the fifty-five members twenty-seven<br />\nNovelties.<br />\n343<br />\nNORTH<br />\nCHARLES STREET<br />\nSilk Banners for Schools, Societies, college man use the power he has were graded below seven.<br />\nand Fraternities<br />\nSeveral courses were Pollvanbeen fortunate enough to gain by<br />\nR. H. TAYLOR<br />\nnas to the struggling students.<br />\nlower<br />\nhigher<br />\n_education<br />\nthe<br />\nhelp<br />\nto<br />\n302 Park Avenue<br />\nclasses in their fight for an 8-hour History 3 and Pol. Econ. II and<br />\nBaltimore, Md.<br />\nVernon 2355<br />\nV appear to be those most responday.<br />\nMOUNT VERNON PLACE<br />\nsible<br />\nfor any joy which dissipates<br />\nThe ideal of \"Poweropia\" was<br />\nOPINIONS OF NEW PLAN<br />\nMETHODIST<br />\nEPISCOPAL<br />\nthe third goal which the speaker the gloom which hangs over GilContinued from page 1<br />\nCHURCH<br />\nman<br />\nHall.<br />\nThree<br />\ngrades of ten,<br />\nuate body; but from the oral opin- said was being fought for by the<br />\n(At the Washington Monument)<br />\ntwo of nine-five, and thirteen of<br />\nThings<br />\nleague.<br />\narranged<br />\nso<br />\nare<br />\nions expressed to the NEWS-LETTER<br />\nnowadays that one man may find ,e in History III helped to 'preREV. OSCAR THOMAS<br />\nreporter, it was obvious that the<br />\nOLSON, D.D.,<br />\nhimself in a position to tell 100,000 vent the complete passing of the<br />\n'majority of the students were<br />\n\"old<br />\nfamiliar<br />\nfaces.\"<br />\nMinister<br />\nThe<br />\ntwo<br />\npomen to quit work whenever he<br />\nagainst the change.<br />\nlitical<br />\neconomy<br />\ncourses<br />\nhad<br />\nthe<br />\nSunday Services of Worship<br />\nwants them to. There is no bal11 A. M. and 8 P. M.<br />\nGeorge Expresses Opinion<br />\nance of power at the present time high rf-rnni of only onp mark as<br />\nhtz-1•17.r:-se-n fltr-rn<br />\nThe Sunday afternoon \"at home\"<br />\nAlternative plans were: \"Reduce in the United States; and what the low 2F,<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nthe size of Baltimore, and make labor movement wants to do is to<br />\nRoom is a social occasion that brings<br />\nEllgRAUERS<br />\nPRMTERS<br />\n13MDERS<br />\ntogether the student groups from HopHopkins a small town college.\" get away from the control of in7<br />\nkins, University of Maryland, Goucher,<br />\ninvestor.<br />\ndusiry<br />\nthe<br />\nWhat<br />\nthe<br />\nby<br />\nPeabody, and other schools of BaltiThis masterpiece was suggested by<br />\nmore.<br />\nworking man wants is to be able<br />\nJ. E. Rodgers, '28. \"Make Hopkins<br />\noEpw rth League at 7 P. M. and the<br />\nto join a union without- being<br />\nBible class at 10 A. M. are built parco-ed, and let the women increase<br />\nticularly with the needs of the young<br />\nfired. At.present this privilege is<br />\npeople in mind.<br />\n-the scholarship,\" -The author of- -not enjoyed by half the working<br />\nthis second plan is unknown.<br />\nclass in the United States. On the<br />\nAn Exclusively Music<br />\nAlumni were doubtful about the one hand are the giant corporaVernon 4986<br />\nShop<br />\nplan as a whole, some for it and tions and the organized power of<br />\nGibson Banjos, Mandolins, Guitars,<br />\nsome against, but the majority re- capital, while on the other is the<br />\n\"King\" Saxophones and Band<br />\n-Say It With Flowers\"<br />\nfused to be quoted.<br />\nInstruments<br />\nhelpless class of laborers. Vhat<br />\nPenzel-Mueller Clarinets, Haynes Flutes<br />\nThe expression of the employees they want is the right to organize.<br />\nHeinrich-Roth Violins,<br />\nof the University was put into clas- \"The labor movement has made<br />\nVictrolas and Victor Records<br />\nPrinters of<br />\nsic form by George, the janitor, who mistakes,\" conceded Mr. BlanG. Fred Franz Music Co.<br />\ncrhe Johns Hopkins<br />\n.said, \"To hell with it.\" George is chard, but he insisted that it is a<br />\n\"The Shop Where You Buy Your<br />\nquoted without his knowledge; the \"far-reaching and fundamental<br />\nNEWS-LETTER<br />\nSheet Music\"<br />\nquotation is worthy of being em- movement in the world.\" And he<br />\n303 N. CHARLES ST. at Saratoga<br />\n1822 N. CHARLES STREET<br />\nbalmed in print.<br />\nPLAZA 3732<br />\nconcluded by drawing a deep LOM BARD and SOUTH STREETS<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nJohns Hopkins Students Will Find A Welcome At<br /><br />\nSMITH &amp; CO.<br />\nFlorists<br /><br />"}], "field_media_file": [{"target_id": 37941, "display": null, "description": null, "target_type": "file", "target_uuid": "bd2a6bbd-ac04-44bb-94bb-425f78f631cf", "url": "http://digital.library.jhu.edu/system/files/2022-03/13160-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13160, "target_type": "node", "target_uuid": "38b691c6-5457-4747-ba2b-60c5758961b8", "url": "/node/13160"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c0935a5a-2723-4755-908d-988cfc46adbd"}]}