{"mid": [{"value": 35690}], "uuid": [{"value": "c7ad4f0a-af27-4b9f-b1c0-5d6947402ab6"}], "vid": [{"value": 35690}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12228-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:22+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "•<br />\n<br />\nTHE<br />\n<br />\nNEWS LETTER eh<br />\n<br />\n\fThe Johns tIoDkins Press.<br />\n<br />\nThe Johns Hopkins Universitu<br />\nBALTIMORE, MARYLAND.<br />\n<br />\nTWENTY-SEVENTI-I YEAR.<br />\nBeginning October 1, 1002.<br />\nFaculty:<br />\nPresident: I un ItEMSICN. Dion of the Medical<br />\nWinn)Am H. How ni.n. bean u.1P Pi (view; Faculty:<br />\nUttirris.<br />\nH.<br />\nEliWAItO<br />\n<br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\n(Courses for candi(a) In Philosophy and the Arts.<br />\ndates for the degree of Ph. D.)<br />\nfor the<br />\ncandidates<br />\n(b) In Medicine. (Courses for<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nFOR UNDERGRADUATEs:<br />\nAs candidates for the degree cif B. A.<br />\nAs special studt(nts.<br />\n<br />\nLibraries.<br />\n106,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\n200,000 volumes.<br />\nPratt Library,<br />\n<br />\nLaboratories.<br />\n‘'hemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics..<br />\n<br />\nDirectors.<br />\nIra Itemsen.<br />\nJoseph :S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam if. Welch.<br />\nJohn .1. Abel.<br />\nJohn .1. A bel.<br />\nWilliam Osier.<br />\n<br />\nDirectors.<br />\n<br />\n1.limeriean 3ournal of dnatbcmatice.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $5 per volume.<br />\namerican Chemical 3ournal.<br />\n1. REMSEN. Editor. Monthly. Svc).<br />\nX X VIII in progress. $5 per volume.<br />\n<br />\n111.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Ilistorical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXVIII).<br />\nAmerican Journal of Philology (vol. X X III).<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nPniversity Circulars (vol. X X II).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, an also of the undergraduate or collegiate<br />\ncourses, *ill he sent on application to the Registrar.<br />\n<br />\nVolume,<br />\n<br />\n111. american 3Ournal of liThilologs<br />\n11. L. GI LDERSLEEV E, Editor. Quarterly. svo.<br />\nVolume X X III in progress. $3 per volume.<br />\nSy°.<br />\nStubies from the Itiological laboratory.<br />\n111).<br />\nVolume V complete. $.5 per volume.:<br />\nStalks in Thistorical sub Political Science.<br />\nP.<br />\nMonthly. 8VO, Series X X in progress. $3 per<br />\nvolume.<br />\n3ohns bophins 'University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. X X1 I in<br />\nprogress. $1 per year.<br />\nMonthly. 4to.<br />\n111111. Jobno lhophino lhospital Sulletin. year.<br />\nVolume XIII in progress. $1 per<br />\nP1111. 3ohns lhophino lbospital 'reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nContributions to assyrioloay ant' Comparative<br />\n11X.<br />\nSemitic pbuoloov, wit rage zur A ssyriologio. etc.)<br />\nVol. LV complete.<br />\nX.<br />\n<br />\nMemoirs from the 36ioloaical laboratory.<br />\n• K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br />\n<br />\nXl.<br />\n<br />\nfibobern /multiage Votes.<br />\nA. M. ELL101\"11, ',Alter. Monthly. 4th. Volume<br />\nX VII in progress. $1.50 per VOilliflo.<br />\n<br />\nX11. 3ournal of lExperimentalf1Debicine.<br />\nW. ii. virEipH, Editor. Ill-merit lily. mvo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111. limerican Journal of insanity.<br />\nM. H IT RD, Editor. Quarterly.4to. $5 per<br />\nIf<br />\nvolume.<br />\nX1111). Ileporta of fibarylanb Ocological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nIP.<br />\n<br />\nBasil L. Gildersleeve.<br />\nICirhy F. Sniith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. II. Hollander.<br />\nPrank Morley.<br />\nfomeph S.<br />\n<br />\nVolume<br />\n<br />\nterrestrial Maanetiom ant' 'atmospheric Ziec.<br />\ntricity. L. A. BAT'ER, Editor. Quarterly. !Ivo.<br />\nVolume VII in progress. $2.50 per volume.<br />\n<br />\nt11111. annual 'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academie year.<br />\n1'11)111 Ennuallgedister.<br />\n(living the list of officers and students,and statin<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowlan<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt,. Prospectus on application.<br />\nRowlamPs Photographs of the Ncirinal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johnic Hopkins 11:alpital. .1. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the A pestles. Complete fac-simile edition. Edited by .1. Icendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntikgomena Epistlqs. Edited by I. H. Hall. $3,00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\n1I-111. Chemistry, Mineralogy and Geology. Parts<br />\n1V-V-VI. Physics,Astronomy and Mathematics.<br />\n8 VO. 30 cents per part.<br />\nft full list ol publisations will he sent on application.<br />\n<br />\nCommunications in respect to exchanges and remittances<br />\nmau he sent to Johns 'Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VII.<br />\n<br />\nJANUARY 9, 1903.<br />\n<br />\nNo. 6.<br />\n<br />\nTHE WORTH OF KNOWING ONE'S SELF.<br />\nHIS season of the year brings the business man a time for counting up the<br />\n.debit and credit columns in order to ascertain where he stands and to<br />\nlearn the strength of his position; with him it is a literal stock taking and<br />\nsettlement of his affairs for a new year. With us, as students, it is a period of<br />\nrenewed resolution to live nearer the ideals which we have set for ourselves<br />\neither in scholarship or in refinement of life or in other mental occupations<br />\nwith which our life is brought into immediate contact. The student comes to<br />\ncollege to learn the meaning of introspection; to investigate the bearing which<br />\nthings outside of himself have towards his own inner mental being; to grasp in<br />\nsome limited measure the significance of the great world drama which has been<br />\nPlaying from eternity and whose finale, whose denouement is that \"grand event<br />\ntowards which the whole creation moves.\" No wonder, therefore, if at this<br />\nOpening of a new year we moralize and reflect upon what we are, why we are<br />\nhere and ask ourselves whither we are tending. Like the merchant we take<br />\nan inventory, although of quite another kind than his. The result of our reck<br />\noning should be a balance of what points of strength we possess against the<br />\nPoints of weakness. As human beings we are a bundle of forces that resist,<br />\nthat overcome and which finally spend themselves in resistance. Powers of<br />\nmind and of body go hand in hand, so to speak, through life guided with<br />\nvarying degrees of mastership according to the individual contesting them. As<br />\nour physical forces wane our mental strength, toward our later life, should<br />\nexhibit a firmness and suppleness in direct ratio to our years and accompany<br />\nour failing bodies to brighten their existence and raise them from bitterness.<br />\nThe declining age of a man who has trusted his sensual life for satisfaction,<br />\nwhether in business or pleasure or idle ease, must be, logically, physical and<br />\nmental wretchedness. Now, realizing ourselves as endowed with these ele.<br />\nments of strength which, by some inscrutable law, must spend themselves, must<br />\nobjectify themselves in visible or rather tangible demonstration, we can reckon<br />\nwith ourselves as to what parts of our being need more attention than others.<br />\nIn other words, what are our points of weakness; what forces in our nature are<br />\nliable to show least resistance. The human frame, as we call it, falls asunder<br />\nnot by the utter collapse of all the parts—bones, muscles and nerves—but owing<br />\nto the frailty of a single weakness, which entails entire dissolution and which<br />\nthe forces of the system collectively cannot stay. Any material object, in like<br />\nmanner, follows precisely the same law. In the moral world the phenomena of<br />\nstrength and weakness also appears. It may be the Greeks meant to convey a<br />\nlesson to their youth of the importance of watching the weak point in character<br />\nby the portrayal of Hercules writhing under a tunic which his world-lifting<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER•<br />\n<br />\nstrength could not remove. Or the picture of Achilles might have afforded the<br />\nsame moral when that flower of Greek military prowess was made to meet death<br />\nat the hands of Paris who happened to direct the arrow against his invulnerable<br />\nbody. The hero fell because his heel had not been bathed in the stream whose<br />\nwaters had saved him from ten thousand arrows hitherto. It may be also that<br />\nSamson's career and its sequel conveys a meaning similar to that of Hercules<br />\nor Achilles. We can infer that if these giants of myth and history fell at the<br />\npoint of their greatest weakness, then our lives are subject to the same general<br />\nconditions as theirs. The unexpected, the unforseen contingencies are those<br />\nwhich, appearing suddenly as they do, strike at us and may prove too much for<br />\nthe resistance we can offer them. As students, we need strength to sustain the<br />\ncourage of conviction, and very frequently at times when, unawares, we stand<br />\nconfronted with a difficulty that only immediate courage can surmount.<br />\nThere is a moral sang-froid as well as a mental. Not that a man is to burden<br />\nhimself with a suspicion of danger impending, and to let the dread of it cast a<br />\ncloud over his life-----on the contrary—to face with calmness any emergency that<br />\nmay arise and despatch it cheerfully. A coward walks backwards into greater<br />\ndangers frequently than he would if he went forward, simply because he can see<br />\nwhere he is going w hen he faces the trouble he has to meet and might avert it<br />\nlargely. One of the forces we cultivate in college life is perseverance, which<br />\nis a phase of bravery; bravery, because after efforts made and repeated almost<br />\nto the point of physical pain we succeed in overturning and -laying out\" the<br />\ndifficulty that baffles during long hours. Milton is said to have passed scarcely<br />\nNow, in the<br />\na single one of his waking hours without a book in his hand<br />\nupon whom<br />\nthose<br />\nof<br />\npurpose<br />\nthe<br />\nexactly<br />\nis<br />\nit<br />\ntraining we receive at college,<br />\nthat responsibiliiy falls to guide the forces inherent in our nature along the lines<br />\nof courage, perseverance and restraint; to make us masters of ourselves and<br />\nhusband our energies according to reason; to teach us the lesson of self confidence plus a tranquility of bearing that marks a gentleman. Then,once started<br />\nin the direction of these attainments we grow into the educated man if<br />\nthough we forget every word of Latin and Greek that we ever<br />\nthumbed out of a lexicon. If this short paper were a fragment of a treatise on<br />\nethics which it is obviously not, the argument might prove how such a training<br />\nof the forces in a man's self reacted upon him and the race at large to the making of a better community in which he should chance to live. The important<br />\npoint of all is that, adding to his common sense, (which if Ile lack, no eduction<br />\nwere better in his case) the results gained from his intercourse with instructors<br />\nand fellow students and from conscientious painstaking with the very few books<br />\nrerched in three years' study, a student should go into the world with a<br />\nthoroughly healthful realization of his own strength and weakness and should<br />\nbe prepared to stand his ground cheerfully and firmly. In the natural course of<br />\nevents a student, when once left to his own resources ought to develope and<br />\nsurvive as against one who has never been apprised of his failings; his standard<br />\nof what a man is being higher than that of his unlettered neighbor requires of him<br />\ngreater action and should guard him against the shocks of experience by leading him to resist them with equanimity. Fortitude can cope with odds and bear<br />\ndefeat; brute strength gives way almost immediately on meeting a force but<br />\nslightly greater than its own—the one is intelligent strength while the other<br />\nlacks intelligence, and the college man who leaves his Alma Mater a stranger<br />\nto the meaning of this has to begin life on the level of boyhood.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nTHE CHRISTMAS TRIP OF THE MUSICAL CLUBS.<br />\n44froHAT! going to the Eastern Shore?\"<br />\n.<br />\nThis was the disgusted comment of most of the men when they<br />\nheard that the management of the University Glee, Banjo, and<br />\nMandolin Clubs had decided to take in Cambridge, Easton, and Salisbury this<br />\nyear, instead of the usual jaunt to the Valley of Virginia. Most of the men,<br />\nhowever, had evidently never experienced true Eastern Shore hospitality before, and a pleasant surprise awaited them, for the trip was the most enjoyable<br />\nChristmas trip ever taken by the clubs, and the most successful, artistically and<br />\nfinancially.<br />\nThe clubs, numbering 29 musicians of no mean ability, left Baltimore for<br />\nCambridge Monday, December 29th, on the steamer \"Avalon.\" The journey<br />\ndown the bay was not without incident The development of certain athletic<br />\ntendencies'by one of the heretofore solely literary and social lights of the clubs<br />\nmerely goes to subs,antiate the fact that a college education certainly does<br />\nbroaden one's scope.<br />\nWhen the clubs arrived at Cambridge, the men were invited to stay with<br />\nmany of the prominent old families there, and, of course, had a royal time.<br />\nThree dances in twenty hours ought to be a record, if it isn't. But even greater<br />\nthan the number of dances were the attractions and charms of Cambridge's<br />\nbeauteous daughters. The men, partfcularly one of them, completely lost their<br />\nhearts in this old storehouse of Dorchester County's history.<br />\nThe next place visited was Easton The same cordial welcome awaited<br />\nthe clubs here. After the concert, which was the best of the three, Mrs. Os—<br />\nwald Tilghman gave a fine dance, lasting well on into the New Year, at her<br />\nresidence. The house was a splendid one for the inevitable tele-a-tete, and the<br />\nmen made the best of their opportunities.<br />\nTo the accompaniment of sobs from the fair maidens, the men took their<br />\nleave of Easton Thursday morning. Our manager was so broken up at parting<br />\nthat he forgot most of his belongings, and had to return for them later. The<br />\ntrip to Salisbury was pleasant, the engine at times attaining the remarkable<br />\nspeed of iso<br />\nmiles an hour. Contrary to the precedent of all other Christmas<br />\ntrips, the prevailing card-game wfis whist. Some of the upper-clasmen devoted<br />\npart of their time to the study of the education of the young, and all that one<br />\nhad to do when an attendant was wanted was to blow a whistle, and a freshman<br />\nimmediately ran up to get his orders.<br />\nThe afternoon at Salisbury was spent in making calls and drinking eggnogg. The certainly know how to brew it across the bay.<br />\nThe crowd at the Salisbury concert was the largest one of the trip. After<br />\nthe concert was over, a most enjoyable Eastern Shore dinner was given by<br />\nRichard N. Jackson, '05, son of Ex-Gov. Jackson, whose family reside at Salisbury during the summer.<br />\nThere was some little disturbance at the hotel that night, owing to the fact<br />\nthat the room of two of the banjo club men had been wrecked. There was an<br />\nexciting battle on the third floor for a while, but it was interrupted several times<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nby visits of the proprietor. The men were at length quieted, and the two unfortunates of the banjo club were sent to bed in another room by Mr Snake,<br />\nthe irate host.<br />\nIt was hard for the men to get up at 6.30 Friday morning, but they had to<br />\ndo it. A few of the men were so completely carried off their feet by the charms<br />\nof Cambridge and Easton that they could not resist the temptation to go back<br />\nthere, but the majority returned via Claiborne to Baltimore, arriving here at 2<br />\nP. M. Friday.<br />\nThe men taken were:<br />\nMessrs. R. C. Pagon, Jackson, Humrichouse, Carver, Marshall, Bryan,<br />\nGilman, Hall, Ford, CoNites, Martin, Randall, Mason, Engle, Eveland, Coffin,<br />\nWinter, l,angnecker, Redewill, Baetjer, Nelson, Lanier, Snowden, Hendry,<br />\nBird, Plaggemyer, Geiger, W. W. Pagon and Super.<br />\n<br />\nY. M. C. A. NOTES.<br />\nHE morning prayer service is led this week by J. M. Motley. It is hoped<br />\nthat during this coming term more men will avail themselves of this opportunity for a few moments of worship. Men with 9 o'clock hour on can<br />\noften get in at 8.45 if they will think of it The singing is good but more voices<br />\nwill help. R. P. Stephens leads next week.<br />\n<br />\nt<br />\n<br />\nThe end this week brings to us a man of very marked ability, power, and<br />\nexperience. It is planned that next Sunday, January t ith, at 3.30, T. Jays,<br />\nEsq., St. Thomas' Hospital, London, Eng , will speak to college men. We<br />\nhave invited all the other Baltimore colleges to meet with us and if Hopkins<br />\nmen do their part to hold up a good reputation for Hopkins the upstairs room<br />\nin Levering Hall should be filled. Mr. Jays represents the British student<br />\nwork and is on leave of absence for this year to travel for the American Student<br />\nVolunteer movement among our colleges. Those of us who met hi in last year<br />\nrecall our great pleasure. We wish the same for all who will avail themselves<br />\nof this opportunity. Mr. Jays will be in town several days and be very glad to<br />\nmeet as many men personally as possible.<br />\nHe comes to us as a fellow student who has worked for a number of years<br />\nas missionary in Western Africa, and now returned to complete the medical<br />\ncourse. At the end of his course he returns to the African position. His stories<br />\nof difficulties, dangers and privations met with and the triumphs of the Gospel<br />\namong those people are facinating. One feels their force aad influence from the<br />\nstrong personality of the man. All men not :.fraid of such a presentation are<br />\nurged to take this opportunity.<br />\nAny man who run across an opportunity for a handbook “add\" are urged<br />\nto pick it up and mention to J. L. Bennet or the General Secretary.<br />\nThe Graduate Student Bible Class will succeed Dr. Foote's Class Meeting<br />\nat the same time and place, Dilhnan Library, 3rd floor McCoo Hall, every<br />\nThursday at 5 o'clock. Topics will be prepared by the committee.<br />\nThe General Secretary or Mr. L C. Barret would like to have the names<br />\nof any men who would like to have a series of daily Bible readings to follow<br />\nthrough the year.<br />\n<br />\n\fTHE NEWS—LETTEk.<br />\n<br />\nALUMNI NOTES.<br />\n<br />\n'93<br />\n<br />\nH. P. Thieme (Ph. D. '97) has been appointed<br />\nassociate in Modern<br />\nLanguages at the University of Michigan.<br />\n<br />\n'96<br />\n<br />\nDr. J. A. C. Chandler has been appointed professor of<br />\nhistory at Richmond College, Richmond, Va.<br />\n<br />\n97 Wax field Longcope, A. B. '97, M. D.'ox, resideft, pathologist in the<br />\nPenn<br />\nSylvania Hospital, Philadelphia, Pa., was in Flaltinibre during<br />\nthe holidays.<br />\nRobert E. Belknap, '97, now of Yonkers, N. Y., spent part<br />\nthe time with him.<br />\n'98<br />\nThomas Fitzgerald, Jr., who was for a time superintendant<br />\nof the Electric Railway Company of Fairmont, W. Va., is now<br />\nengaged in electrical work<br />\nat Norfolk, Va.<br />\n'00<br />\n<br />\nDr. W. L, Foushee has been selected to fill the chair of the<br />\nprofessor of<br />\nLatin at Richmond College, Richmond, Va.<br />\n<br />\n'00<br />\n<br />\nA. R. V. Schertnerhorn has returned from Chicago, where he<br />\nwas practicing law, to become a member of the Baltimore bar.<br />\n<br />\n'01<br />\n<br />\nHarry L. Byrne left in the earlier part of the month for Omaha<br />\n, Neb.<br />\nHe has been appointed special agent and adjust<br />\ner of the Fidelity and Deposit<br />\nCompany of Maryland, to cover the states of Kansas,<br />\nNebraska, Iowa, and<br />\nMissouri. His address will be, care H. A. Wagner, First Nation<br />\nal Bank Building, Omaha<br />\nAlfred Bruton, 'ox, now at Boston, spent Christmas here.<br />\nJames L. A. Burrell is United States Vice-Consul at Madgeburg,<br />\nGermany.<br />\n<br />\nOn Saturday night, January 3rd, the '01 Alumni Association<br />\nheld its second<br />\nannual banquet at the Carrollton Hotel. John M. Booker was<br />\ntoast master.<br />\n<br />\nHOLIDAY VISITORS.<br />\nlarge number of alumni visited the University during the holida<br />\nys<br />\nAmong those who were here were: Dr. George Lefevre, '91, Profes<br />\nsor<br />\nZoology at the University of Missouri; Dr. A. M. Reese, '02, instruc<br />\ntor<br />\nof Biology at Syracuse University; Charles Edward Lyon,<br />\n'97, one of the most<br />\nsuccessful of the younger teachers at Princeton; Roger T. Anders<br />\non, 'oo,<br />\nGeneral Thealogical Seminary, New York; Henry Warner, '00, Univer<br />\nsity of<br />\nWisconsin; J. M. Bandel, 'or, now at Auburn Seminary, New York;<br />\nAbner<br />\nSaylor, 'or, at the Harvard Law School; J. Gresham Machen, 'ox, at Prince<br />\nton<br />\nheological Seminary; Sidney Smith, '02, was here from the Harvar<br />\nd Law<br />\nSchoo!; Gibson Sisco, '02, with the Pennsylvania Railroad at Fort Wayne<br />\n,<br />\nIncl.; Thomas C. Pinkerton, '02, at Boston \"Tech;' W. B. Hill, '02,<br />\ntraveling<br />\naudito, for the Maryland Casualty Company; J. Sharshall Grasty, '02,<br />\na graduate student at Washington and Lee University.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n6<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly (luring the University Year by the Students of T II F. JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nJANUARY 9, 1903.<br />\nSubscription $1.50 per year.<br />\n.<br />\n.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Edam's,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1908.<br />\n. GEoit(ix A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n...............<br />\nW. S. Bum 1908.<br />\n. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\nRiu(tiN BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BA EU ER,<br />\nJ H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nITH this issue a change will be noted in the staff of the Nuws LETTER.<br />\nMr. Robert S. Lanier relinquishes his position as head of the paper in<br />\norder to devote his entire time to the Hullabaloo. It is with regret<br />\nthat his co workers on the NEWS-LETTER part company with their editor-inchief. Since his first year at the University lie has been an energetic, efficient<br />\nworker for the good of the paper, devoting to it his time and talent with unstinted measure, The N itws LETTER loses him only that he may devote himself to the labors which the class of 1903 has declared to be peculiarly his own.<br />\nWhile Mr.. Lanier made no radical changes in the policy pursued by his<br />\npredecessors, he has strengthened the paper by his careful attention to the various departments of college life and by securing a series of leading articles which<br />\nhave been of timely ,interest to the student body. His editorials, liberal in tone<br />\nand free from class or ,fractional bias, bore witness to his thorough acquaintance<br />\nwith all phases of University life and to a jealous regard for its customs and traditions.<br />\nFrom now until within a few weeks of the close of the college year Mr.<br />\nLanier will be engaged in editing the Hullabaloo. With such an editor-in-chief<br />\nthe class of 1903 makes no idle boast in declaring that the Hullabaloo this season will be far superior to any previous year-book.<br />\n<br />\nero<br />\n<br />\n\fTHU N EWS—LETTUR,<br />\n<br />\n7<br />\n<br />\nIn his management of the paper the NEWS-LITTER feels that Mr. Lanier<br />\nhas given promise of a useful literary career In him was found that rare combination of literary talent and executive ability which gives assurance of future<br />\nsuccess in the field of letters. The NEWS LETTER does not doubt but that future<br />\neditors of this paper will feel an honest thrill of pride on thinking that they are<br />\nworking on the same paper which Bob\" Lanier once edited.<br />\n<br />\nZ<br />\n<br />\nHE lacrosse situation at present cannot be said to call forth the enthusiasm<br />\nof its follows. Captain Straus is doing his part, the old men are as conscientious as ever, and the coach is painstaking and careful with all who<br />\nrequires his attention. The serious trouble lies with the new men. During<br />\nthe past month General Apathy has been making a vigorous campaign among<br />\nthem. Few took the trouble to come out, and those few evinced a surprising<br />\nlack of interest in the game. Considering that the Freshmen were facing their<br />\nfirst examinations something may be pardoned them; yet it seems strange that<br />\nthey could not find some time to devote to Hopkins' greatest game. The old<br />\nmen cannot play on forever, new blood must be injected from time to time, and<br />\nthe members of the Freshman Class are to supply this new blood. It would be<br />\na disgrace to the class and to the University as well if they refused to accept<br />\nthe burdens which college life imposes upon them. A man who can work but<br />\npersists in shirking his duty is not worthy of a place among us. This is the beginning of a new term and it is to be hoped that a new spirit will animate the<br />\nnew men from the very first. The game is a facinating one, and well repays<br />\nthe time and attention one may bestow upon it.<br />\nThe track team, also, has not had its full quota of new men at all times.<br />\nAs in the case of the lacrosse team the old guard has been faithfully at work.<br />\nDuring the holidays scarcely a day passed but what some of the old men were<br />\nat work in the cage. With the inter class games not more than three weeks off<br />\neach class ought to get out as many men as possible, for every point will count.<br />\nBesides that, these games will be excellent prrctice for the new men; they will<br />\ngive a feeling of confidence which will be of great advantage when the time<br />\ncomes to run in competition with outsiders.<br />\nThe NEWS-LETTER has no desire to preach, but it cannot refrain from<br />\nuttering a word of warning and advice to the new men.<br />\nUST at present the question of a debate with the Leland Stanford, Jr.,<br />\nUniversity is being agitated. To the NEWS-LETTER the idea of going<br />\nquite across the continent at the present time seems senseless, if not to<br />\nsay ridiculous, when we can find at our own doors so many foemen worthy of<br />\nour steel, What end cin be furthered by debating with Leland Stanford, which<br />\nwould not be subserved as well by debating with some college nearer home?<br />\nWe shall have our hands full in preparing for the debate with North Carolina.<br />\nWhatever time may be available after this one is concluded could well be devoted to a debate with some other college, but why it is necessary to go to<br />\nLeland Stanford is beyond our comprehension.<br />\n<br />\nJ<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nthe<br />\nZHli large number of Hopkins men who were present at the meeting of<br />\nde—<br />\nis<br />\nholidays<br />\nthe<br />\ng<br />\ndun<br />\nil<br />\nn<br />\nAssociatio<br />\nLanguage<br />\nmeeting of the Modern<br />\nserving of more than passing note. That so many were present, in a<br />\ngathering of representative educators of America, who received their education<br />\nfortunate<br />\nat this University gives us cause to congratulate ourselves that we are<br />\nits<br />\namong<br />\nnumbers<br />\nwhich<br />\nan<br />\ninstitution<br />\nof<br />\nsmall,<br />\nhowever<br />\npart,<br />\nenough to be a<br />\nwas<br />\nn<br />\nAssociatio<br />\nLanguage<br />\nModern<br />\nThe<br />\nmen.<br />\nhed<br />\ndistinguis<br />\ngraduates so many<br />\nthe<br />\nfounded by men connected with the Johns Hopkins University, and from<br />\nn.<br />\ninspiratio<br />\ngreatest<br />\nits<br />\nreceived<br />\nhas<br />\nn<br />\nHopkins the associatio<br />\n<br />\nHERE are now two places on the editorial staff of the NEWS LETTER which<br />\nare to be filled as soon as possible. , It has been thought best that one<br />\nplace he given to each of the lower classes. All contributions which may<br />\nAs both<br />\nbe handed in will receive the careful consideration of the editors.<br />\nweigh<br />\nwill<br />\nof<br />\nnews<br />\nitems<br />\nvacancies are for the positions of assi.tant news editors<br />\nlatter<br />\nthe<br />\nalthough<br />\njokes,<br />\nand<br />\nmore in a candida.e's favor than stories, poems,<br />\nand<br />\nnotes,<br />\nalumni<br />\nwill not be unwelcome. News items—university notes,<br />\nundergraduate notes—may be handed in at any time.<br />\n<br />\nt<br />\n<br />\nAMONG THE COLLEGES.<br />\nHE latest statistics as to the number of students in the larger univercities of<br />\nthe United States are as follows : 1, Harvard, 5,468; 2, Columbia, 5,352;<br />\n3, Chicago, 4,296; 4, Michigan, 3,764; 5, California, 3,767; 6, Minnesota, 3.505; 7, Cornell, 3,281; 8. Wisconsin, 2,884; 9, Northwestern, 2,875; to,<br />\nYale, 2,894; II. Pennsylvania, 2,549; 12, Nebraska, 2,289; 13, Syracuse, 2,020;<br />\n14, Indiana, z,648. 15, Missouri, 1,406; t6, Leland Stanford, Jr., 1,378, and 17,<br />\n<br />\nt<br />\n<br />\nPrinceton, 1 ,345.<br />\nHarvard has the largest teaching staff-533 instructors; Columbia is second,<br />\nwith 504. Columbia has the largest total of non-professional graduate students.<br />\nThe seventh annual performance of the Lehigh Minstrel Association, last<br />\nmonth, was a decided success<br />\n\"The Mirage,\" a four sheet weekly, published by the students of the<br />\nUniversity of New Mexico, has a staff of eighteen, eight of whom are of the<br />\nfair sex.<br />\nIn the intercollegiate chess tournament, the representative of Columbia<br />\ndefeated those of Harvard, Yale and Princeton.<br />\nThe question of allowing the students to get their B. A degree in three<br />\nyears, is under discussion at the University of Texas. The Professors there are<br />\nnot in favor of the change.<br />\n<br />\n1<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n9<br />\n<br />\nA dinner of the Yale Alumni in Paris was held on the night of the YaleHarvard game. The affair was so successful that it was decided that the YaleParis dinner should be made a permanent institution.<br />\nIn the all-Southern football team picked by Dr. W. A. Lambeth, physical<br />\ndirector of the University of Virginia, there are four men from the University<br />\nof North Carolina, and of the three from Virginia, one was a North Carolina<br />\nman in 1901. He makes up the team as follows: Cox, of North Carolina, left<br />\nend; Johnson, of Virginia, left tackle; Lemoine, of Sewanee, left guard; Givens,<br />\nof Georgetown, center; Foust, of North Carolina, right guard; Council, of Virginia, right tackle; Bronston, of Virginia, right tackle; Graves, of North Carolina, quarterback; Holt, of North Carolina, left halfback; Edgerton, of Vanderbilt, right halfback; Carpenter, of V. P. I , fullback.<br />\nThe $525,000 for the University of Pennsylvania Gymnasium is now collected, all but $17,000. The work of construction will be started at once.<br />\n<br />\n11<br />\n<br />\nThe number of students at the University of Michigan has increased from<br />\nto 3,764 in 1903.<br />\n<br />\nn 1841<br />\n<br />\nAt the annual meeting of the Inter University Lacrosse League, composed<br />\nof Harvard, Cornell, Columbia, and the University of Pennsylvania, a change<br />\nwas made in the play regulations, a rule being amended to allow the substitution of another player for one withdrawn from the game.<br />\nThe spring debate between the Universities of Utah and Nevada will be on<br />\nthe interesting subject, \"Resolved, that the settlers on arid lands should pay for<br />\nthe improvements made by the government.\"<br />\n<br />\nMR. R. BRENT KEYSER ELECTED PRESIDENT OF THE BOARD<br />\n<br />\nOF TRUSTEES.<br />\nT the meeting of the Board of Trustees, held on last Monday, Mr. R.<br />\nBrent Keyser was elected president to succeed Mr. James L. McLane,<br />\nwho resigned some time ago. Mr. Francis White, who is one of the<br />\noriginal Board of Trustees, and who has been acting as president since<br />\nMr. McLane's resignation when into effect, was elected president, but declined<br />\nthe honor, as he felt that it would be better for a younger and more active man<br />\nto have the place. Mr. Keyser was then elected. He was chosen a member of<br />\nthe Board last May, and since then has taken an active interest in the affairs of<br />\nthe University.<br />\nAt the meeting President Remsen delivered his annual report to the trustees. He stated that the University was free from debt, and that there never<br />\nwas a time when the University had been unable to meet its obligations. It<br />\nwas announced that the million dollar fund would not be wholly available for<br />\nuse until the end of the present academic year.<br />\n<br />\nc(<br />\n<br />\n\fTHE NEWS-LETTER<br />\n<br />\n10<br />\n<br />\n11110111<br />\n11111111M101111111110000111111111111110111110111011111111111111111011111011 111101111111111111111111111111111M114111MMIIIIIM11111111111111MUM111<br />\n•<br />\n<br />\nMai<br />\n•<br />\nmthmimmignomouniiii<br />\n<br />\n„<br />\n<br />\nR. C. E. WALTERS headed a delegation of Baltimoreans at the first meet<br />\ning of the Wild Flower Preservatioh Society of America held in Washington on December 27.<br />\nThe University was well represented at the annual convention of the<br />\nAmerican Association for the Advancement of Science, held in Washington last<br />\nweek. As president of the association Dr Ira Remsen presided, and responded<br />\nto the address of welcome, and delivered the principle address at the second<br />\ndays' session, when he spoke on \"The History of a Doctrine.\" Others in attendance from the University were: Drs. D. C. Gilman, Wm. B. Clark, Wm.<br />\n11. Welch, 0. L. 1-.'assig, and Mr. A. W. Smith.<br />\nDean Griffin recently addressed the Methodist Episcopal ministers meeting<br />\non \"Recreative Reading.\"<br />\nDr. Gilman presided at the public meeting of the Woman's Auxiliary of<br />\nthe Maryland Civil Service Reform Association, held in McCoy Hall on the<br />\nnight of January 5.<br />\nHarlan Updegraff, A. M., last year assistant to Nicholas Murray Butler,<br />\nPresident of Columbia University, will lecture before the Pedagogical Society<br />\nSaturday, January 17, at It A. M., in the Donovan Room.<br />\n<br />\nANNUAL CONVENTION OF MODERN LANGUAGE ASSOCIATION<br />\nOF AMERICA.<br />\nN the last three days of December the University was the host of a distinguished body of men literary and linguistic scholars, the members of<br />\nthe Modern Language Association of. America. The convention was a<br />\nHopkins affair since, with one exception. all the meetings were held in McCoy<br />\nHall, and from the fact that University men have always taken a prominent<br />\npart in the association. Dr. A. Marshall Elliott was the first secretary of the<br />\nassociation, which office he filled from 1883 to 1892, and on his resignation Dr.<br />\nJames W. Bright was elected to succeed him, and in turn carried on the work<br />\nfor nine more years. Last year Dr. Bright resigned and was elected to the<br />\npresidency, as Dr. Elliott had been before him.<br />\nThe association was called to order by President Bright on the afternoon of<br />\nDecember 29. In the absence of President Remsen, who was in Washington<br />\n<br />\nO<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nattending the meetings of the American Association for the Advanc<br />\nement of<br />\nScience, the address of welcome was delivered by Professor Basil L.<br />\nGildersleeve. He spoke of the splendid work that the association was doing,<br />\nand how<br />\nit was helping scholars. After the reports of the<br />\ndifferent officers had been<br />\nmade, and committees appointed the association proceeded to hear commun<br />\nications and to discuss them. The papers read at the various meetings covered<br />\na 'great variety of subjects and many interesting<br />\nphilological facts were brought<br />\nto light.<br />\nThe social features of the gathering added much to the pleasur<br />\ne of the<br />\ndelegates. They included receptions at the homes of different member<br />\ns of the<br />\nlocal committee, as well as a \"smoker\" at the University Club.<br />\nThe election of officers to serve for the coming year was held at the<br />\nmeet<br />\njug on Wednesday morning Dr. George Hempl, of the Univers<br />\nity of Michigan, a Hopkins man, and formerly a teacher here was elected<br />\npresident. The<br />\nExecutive Committee contains two other Hopkins men. Dr. Bright was placed<br />\non the Editorial Board of the association, and a motion<br />\nwas passed to the effect<br />\nthat the next volume of the association publications be dedicat<br />\ned to Professor<br />\nBright in recognition of his splendid services during the past year. The<br />\nlocal<br />\ncommittee having in charge the entertainment of the delegates was<br />\nas follows:<br />\nProf. A M. Elliott (chairman), Dr, H. B Green (secretary), Drs.<br />\nH. Wood,<br />\nE. C. Armstrong, Paul Haupt, T. S Baker, Fabian Franklin, C.<br />\nC. Marden,<br />\nKirby F. Smith, B. J Vos, H. Froelicher, and Mr. T. Marburg.<br />\n<br />\nUNDERGRADUATE NOTES.<br />\n<br />\nO<br />\n<br />\nN the evening of December 23, a feed was held at the Hullabaloo Club.<br />\nThe feature of the evening was a song by Mr. Mackdermott, ably<br />\nseconded by Jack Nelson. At a seasonable hour a turkey dinner was<br />\nserved by s caterer.<br />\nH. K. Tootle has severed his connection with the \"Baltimore American.\"<br />\nThe editors of the \"Hullabaloo\" recently requested President Woodrow<br />\nWilson, of Princeton, to write their leading article, but President Wilson was<br />\ncompelled to refuse on account of being pressed for time.<br />\nThe Debating Club has sent a proposal to the students of Leland Stand ford,<br />\nJr., University for a series of three annual debates preferably on some phase of<br />\nthe tariff question. The first to take place at Leland Stanford, the second at the<br />\nHopkins, and the third at some intermediate point. The proposal will be considered by the Leland Stanford Debating Club in the early part of this month.<br />\nThe Senior Class is preparing to hold its annual class banquet. It is not<br />\nexecred to be as interesting as last year's banquet. Yet every one is guaranteed<br />\na good time. H. W. Plaggemeyer will be the toast master.<br />\nCarroll M. Sparrow, a former member of '03, sailed on the third of the<br />\nmonth for Porto Rico to take soundings on the southwest coast for the United<br />\nStates Coast and Geodetic Survey.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER,<br />\n<br />\nThe editors of the \"Hullabaloo\" request that the members of the Senior<br />\nClass have their pictures taken as soon as possible. A prompt compliance with<br />\nthis request will greatly facilitaie the work of the hoard.<br />\nT. Wesley Glocker is still confined to his home with a severe attack of<br />\ntonsilitis.<br />\nThe musical clubs will give a concert, January 13, at the Homestead Methodist Episcopal Church.<br />\nThe fiat has gone forth that there must be no more smoking in Walter's<br />\nbarber shop. Alas, where now will the loafers congregate to woe my Lady<br />\nNicotine? Walter has not burst forth into one of his philosophical discourses<br />\nreplete with wisdom, but he has promised a contribution on smokers and the<br />\ngentle art of smoking for the next issue.<br />\nThe question for debate between Hopkins and the University of North Carolina has at last been agreed upon. We take the affirmative of the question,<br />\nResolved, That our merchant marine should not be subsidized.<br />\nFABLES FOR THE FOOLISH.<br />\nIn Words of a Few Syllables.<br />\nV. THE FABLE OF THE NEVER-WORKS<br />\nNCE upon a time there was a class in Bugology. Each and every one was<br />\na noble specimen, worthy of a better fate. Their time was spent in the<br />\nelusive hunt for animals who had a faculty of hiding behind grains of<br />\nBy the aid of their microscopes they<br />\nsand and other minute particles of matter<br />\nwhen they thought of what<br />\nappetites<br />\nsaw so many things that they lost their<br />\nthan those kept in bottles<br />\nother<br />\nliquids<br />\nno<br />\nthey might be eating, and they drank<br />\nLouis.<br />\nSaint<br />\nin<br />\nand guarenteed with a blue ribbon made<br />\nSuch was the class.<br />\nTheir mornings they spent in learning long definitions, their afternoons in<br />\nchasing the giddy bacteria across a colored slide, and their evenings in trying<br />\nto forget what they had learned in order that they might start fresh the next<br />\n<br />\n0<br />\n<br />\nmorning.<br />\nSuch a remark as this would occasionally awaken the class from its lethargy:<br />\n\"0 professor, I have had three installments of goo, and I can't find my cute<br />\nlittle bug anywhere!\" But such intervals of intellectual lucidity were rare.<br />\nExamination day dawned at last. The questions were jotted on the board<br />\namid groans trom the assembled victims. From previous examination papers<br />\nthey thought they knew what was coining, but they were foiled again, and the<br />\njanitor chortled in his glee. So it came to pass that the Bugologists were seized<br />\nwith violent stage fright, and were smitten hip and thigh with that which they<br />\nhad held to be a cinch. When the marks were forthcoming, lo! few had passed,<br />\nand they as if by accident The tenth part has not been told, but the mantle of<br />\nsweet charity covereth the rest.<br />\nMORAL —This fable teaches freshmen that all play and no work makes<br />\nJack a dull boy.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n13<br />\n<br />\nLACROSSE OUTLOOK.<br />\nOW that the ordeal of the Christmas examinations and the dissipation ot<br />\nthe holidays is over, the captains of the lacrosse and of the track and<br />\nfield teams will have a right to the attention of the men for several<br />\nmonths to come. In the direction of lacrosse particularly, Captain Henry<br />\nStrauss purposes continuing systematic work in the cage until the first signs of<br />\nSpring appear, and the candidates are able to turn out at Druid Hill Park.<br />\nThe first practice this year was held in the cage Tuesday afternoon, and a<br />\nvery encouraging squad put in appearance.<br />\nA feeling of reticence, however, still seems to exist among the freshmen,<br />\nfor '05 turned out a very small percentage of the whole squad There is certainly no good reason for this, for the class is large and contains quite a number<br />\nof well-developed men. Smoke up, freshmen! \"It's up to you.\"<br />\nAs regards prospects, the outlook is decidedly better than it appeared at<br />\nthe close of the season last year. Several of the candidates—notably those<br />\nfrom the junior ranks—are showing up remarkably well Briscoe, the goal<br />\nveteran, may return in a few weeks; Ranft, of the 1901 team, declares his<br />\ninsention of trying for a position on the twelve; and Captain Strauss with a<br />\nknowing smile tias one or two other trump cards up his sleeve, which will not<br />\nbe divulged at present.<br />\n.<br />\nJust as was the case in football last fall, the lacrosse team also needs a fast<br />\nscrub, and it behooves every new man to come out and learn to handle a stick.<br />\nIt is an obligation due the University.<br />\nThe usual uncertainty still exists in regard to th-1, schedule for the season.<br />\nThe dates with Swarthmore and Stevens Institute are certain, but Lehigh wants<br />\nto play later in the season, and Cornell is apparently by no means anxious to<br />\nline up against Hopkins on her own grounds The Crescent Athletic Club is<br />\nalso due here in May, and a reply from Oxford, England, is expected every<br />\nday. Besides these two brilliant exhibition games, a third will probably be<br />\nadded in the direcLion of the Toronto twelve. It is more than likely that the<br />\nCanadians will repeat their visit to Baltimore for another contest in June.<br />\nWith a collegiate league composed of four teams and such exhibition games<br />\nas the foregoing, the season should be the greatest in the history of lacrosse at<br />\nJohns Hopkins.<br />\nLet every man come out and hustle! There's a feeling of duty well-discharged as well as all kinds of glory in it.<br />\n<br />\nal<br />\n<br />\n\fI I<br />\n<br />\nTHE NEWS-LETTER.<br />\nTRACT TEAM AT WORK.<br />\n<br />\nT the present time it is not possible to give a very definite account of the<br />\naffairs of the Track Team, as it is only in a formative period. On the<br />\nfirst day after the holidays, regular systematic work was renewed. The<br />\ncage once again began to assume its old-time business-like appearance. Straggling in from all directions came embryo record-breakers and old stagers to put<br />\nthemselves under the tender care of \"Pather Bill,\" who must discover and<br />\ndevelop the best that is in them. Previous to this the training has been of a<br />\ndesultory nature. However, from now on, hard, steady, unterrupted by holidays, will be strictly observed. The work, light at first, will gradually be<br />\nincreased until the best possible results are obtained.<br />\nNo definite plans for the future have as yet been formulated. One idea to<br />\nbe highly commended is the proposed holding of Interclass games in the cage.<br />\nThe events, if found practicable, would probably include relay races, 30 yard<br />\ndash, 440 yard, one half and one mile run, high jump and shot-put. Aside<br />\nfrom furnishing amusement to the spectators, arousing interest, and perhaps<br />\nraising funds, they have a very important influence upon the general work of<br />\nthe Track Team. They will undoubtedly stimulate interest in track work and<br />\nbring out men whose ability is as yet unknown even to themselves. A little<br />\nfriendly class rivalry will sometimes stir up class and college spirit that can be<br />\nreached in no other way, and when once aroused it is not likely to decrease,<br />\nbut give vent to itself in many ways.<br />\nJust here in connection with interclass games, it may not he altogether out<br />\nof place to say a word about the recent cane-rush—that was not. The 6th of<br />\nDecember, the Christmas holidays, and the beginning of the second term are all<br />\nthings of the past. But what of the cane-rush! Is it a thing of the future?<br />\nEverybody seems to know less about it than everybody else. The silence on<br />\nthe subject from some quarters has become so oppressive that it can almost be<br />\nfelt. The facts in the case are becoming more and more complicated, and are<br />\ngradually giving way to vague rumors. Now that the holidays are over, it is<br />\ntime that some definite action be taken in the matter. Speak up, someone, and<br />\nrelieve the suspense of those concerned.<br />\nCaptain Hoffman has been on the sick list for several days. He is now<br />\nwill be<br />\nable to direct the work of the men, however, and from now on work<br />\ncarried on every evening in the cage.<br />\nhim<br />\nH. K. Tootle has been nursing a sprained ankle, which has hampered<br />\nyear.<br />\nfreshman<br />\nhis<br />\nin<br />\nbroke<br />\nin his work. It is not his left ankle, the one he<br />\npossible. It is irnpos<br />\nThe new men are urged to get spike shoes as socn as<br />\nfor his work.<br />\nequipped<br />\nproperly<br />\nis<br />\nhe<br />\nunless<br />\nspeed<br />\nman's<br />\nsible to get a line on a<br />\n<br />\n\fTHE NRWS-LETTER,<br />\n<br />\n15<br />\n<br />\nAs yet no meeting has been held of the committee who are to manage the<br />\nInter-class games in the cage. It is expected that all the arrangements will be<br />\ncompleted next week.<br />\n<br />\nOZZY'S ORIGINAL ODDITIES.<br />\n<br />\nLITTLE FRANKIE.<br />\nFrankie died of forty fits,<br />\nSquirmed himself to tiny bits<br />\nPapa looked sad to see him twist,<br />\nAnd said, \"Poor boy, how he'll be missed!\"<br />\n<br />\nII.<br />\n<br />\nJOHNNY'S EXPERIMENT.<br />\n<br />\nJohnny poured vitriol over the baby.<br />\nDid the dear little one scream? Well maybe!<br />\nPapa turned 'round when he heard all the noise,<br />\nMerely declaring, \"well boys will be boys!\"<br />\nOZZY,'03.<br />\n<br />\nTHE WOOLY WESTERN<br />\n<br />\nMETHOD.<br />\n<br />\n\"Iowa City was the scene of a large and enthusiastic rough-house last<br />\nFriday night. It started with a Freshmen party Such effrontery roused the<br />\nire of the Somophores, who manifested their disgust by throwing a skunk in<br />\nthrough a window. This declaration of war was quickly followed by a volley<br />\nof eggs.and rocks. Then the Freshmen, much incensed, came .out to see about<br />\nit. The fight which ensued and in which the police took active part lasted till<br />\ndaybreak. The police used clubs and revolvers and two medical students were<br />\nseverely wounded before the force was put to rout.<br />\n\"When an inventory was taken, about $700 damages to glass and other<br />\nbreakable furniture and numerous broken heads were all the visible assets.\"—<br />\nMinnesota Daily.<br />\nAnd Dean Griffin objects to singing in the elevator!<br />\n<br />\nWAITRESS (at quick-lunch stand): Do you want to eat this sandwich here<br />\nor take it with you?<br />\nGENTLEMRN—Both.--LamPoon.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n16<br />\n<br />\ntoo good a<br />\nMISS DE SwELL—I'm afraid, doctor, that I have been having<br />\ndo?<br />\nI<br />\nshall<br />\ntime. My complexion is losing its color. What<br />\nDOCTOR—Diet.—Princelon 7.1:4Yer.<br />\n<br />\nDUMHEAD—Nelson<br />\n<br />\nwas coining to call, but I told him you would he<br />\n<br />\nengaged this evening—<br />\nriver.<br />\nMiss OLEMADE (raptuously)-0h, William:—Princeton<br />\nbut he no bite.a.''<br />\nThe ancient Romans or Italians said: \"Hamilcar Birca,<br />\n—Widow.<br />\n<br />\nSHE—Is<br />\n<br />\nhe a college man?<br />\nno! His handwriting is perfectly legible —Harvard Lam -<br />\n<br />\nHE—Gracious,<br />\n<br />\npoon.<br />\nHE (excitedly after a good play)—Isn't that ripping?<br />\nSHE (dismayed and feeling-ly)--Isn't what ripping?<br />\nHE—That tackle Blank just made.<br />\nSHE(relieved)—Oh!—Record.<br />\nexams?<br />\nSHE—How did you come out in the Christmas<br />\n.<br />\nRecord<br />\nHE—Passed as soon as I saw them—Yale<br />\n\"Sing a song of Fr hies who foiled away the term,<br />\nNever studied Hydra, Dog iish or the Worm;<br />\n<br />\nseen—<br />\nWhen the lists were published, and results were<br />\nmagazine.\"<br />\nBut here we draw a veil, for ladies take the<br />\n—McGill Outlook.<br />\n<br />\nvictim's courage fell.<br />\n\"Shall I brain him?\" cried a hazer; and the<br />\non the head.\"—Sfihinx.<br />\n\"You can't, it is a Freehman. Just hit him<br />\n<br />\n\fOPEN ALL NIGH'F..<br />\n<br />\nWILLIAXSON 0 WATTS,<br />\nruo %tores.-,<br />\nHoward and Franklin Streets.<br />\n<br />\n'Baltimore and Eutaw Streets.<br />\n<br />\n1Drugs. fancg CI3oot.). 11)cutit map, Collet 'Articles, Cigars, SoDa<br />\n<br />\nTHE CHEAPEST PLACE<br />\n<br />\ni'. 'Phone 3350-Y.4111<br />\n<br />\nIN BALTIMORE FOR<br />\n<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Ooods, Glass Ware,<br />\nSludents' Sundries.<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing<br />\nzitui Svirveyinu instrunlent.s,<br />\nDriu“.flitsulcii's ;Anil<br />\n<br />\nH. S. WRIGHT 8L. CO.,<br />\n704 MADISON AVE.<br />\n<br />\nN. \\A'. Corner<br />\n1.exhiqt.on ;it'd Liberty Sl.s.<br />\nAOCn<br />\n<br />\nXIV f-f;<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\n<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nM. MEADE, OF LONDON,<br />\nEXPERT CLEANER AND DYER,<br />\n126 N. I !i JTAW S'I'. (2nd and 3rd floors).<br />\nThe moat complete and modern department for<br />\ncleaning, dyeing and altering Gents' and Ladies'<br />\ngarments.<br />\nIt's time gear Winter Clothing was put in order.<br />\nDoes it need to be cleaned, dyed, altered or repaired? Are now linings and velvet collars necessary?<br />\nNever mind what's the matter, we will fix it up to<br />\nlook like new, and you won't have to pay very much<br />\neither. The Price List speaks for itself.<br />\n<br />\nM. BERNSTEIN & CO.<br />\nLoND0N—A M ER WAN<br />\n<br />\n...TAILORS<br />\n<br />\nAND<br />\n<br />\nIMPORTERS...<br />\n<br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that lit well, look well and wear<br />\nwell, that's very Important.<br />\nThe most fastidious man can find nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the man that is less<br />\nparticular, it's our way.<br />\nWe are prepared to show you a large line of imported woolens, which does not cost any more than<br />\nthe domestic.<br />\n-SEE US BEFORE BUYING\"<br />\n126 Noi-rri I IA ITAW STRIArr.<br />\n(Second door above Joel Gutman & Co.)<br />\n<br />\n.1(7i<br />\n<br />\nellffet<br />\n<br />\n4V<br />\n<br />\nHenderson's<br />\n<br />\nESS!<br />\n<br />\n11,AI .T1M0121.1.<br />\n<br />\nC( ,<br />\n<br />\nt<br />\n<br />\nof<br />\n<br />\nNeW<br />\n<br />\n.<br />\n<br />\n0<br />\n6<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nTeNt llooks, Note Books,<br />\nMadison<br />\nStudents' Supplies.<br />\n<br />\n& Howard Sts.<br />\n<br />\nGENTLEMEN'S CLOTHING PRESSED<br />\nCONTRACT. $1.50 PER MONTH.<br />\nPRICES FOR DRY CLEANING AND DY FANG .<br />\nGentlemen's Suits cleaned and pressed<br />\n$1.00<br />\nTrousers,<br />\n.25<br />\nCoats,<br />\n—<br />\n.50<br />\nVests,<br />\n.25<br />\n_<br />\n_<br />\nOvercoats,<br />\n1.00<br />\nBoys' Suits, according to size, .50, .75 and 1 00<br />\nVelvet collars on overcoats,<br />\n.75<br />\nRELINING.—A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. All altering and repairing done here<br />\nby skilled tailors.<br />\nDYEING.<br />\nGentlemen's Suits dyed and pressed,<br />\n$2.011<br />\nOvercoats, '<br />\n1.50<br />\n1.00, 1.25 and 1.50<br />\nBoys' Snits, according to size<br />\n<br />\nCLOTHES MADE To ORDER.<br />\nThe illustrations show how the clothes we make fit<br />\n<br />\nand look—the wear you'll learn about later.<br />\nThe light overcoat is an especially snappy garment,<br />\nThe sack suit is cut after the very newest pattern.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nman could wish.<br />\nWe make all other proper styles, of course; dress,<br />\ncutaway, double-breasted, four-button sack and<br />\nNorfolk suits.<br />\nYou can now have first pick of our first pick of<br />\ncloths.<br />\nPrices are low—we never learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style and a perWorkmanship<br />\nwill be the best you eversaw.<br />\ntit.<br />\nfect<br />\nYour money back If you are dissatisfied.<br />\n126 N. Eutaw St.<br />\nM. PIEUNSTI:IN & CO.<br />\nSEE OUR PRICE LIST FOR CLEANING, DYEING AND ALTERING.<br />\n<br />\n\f0001101$600,000. SI110111811110 dIldIVIded PfOiliS $400.000<br />\n<br />\nSTIEFF PIANOS<br />\nA1.1.11i.:<br />\n<br />\nDrovers Sc Mechanics Nat'l Bank,<br />\n<br />\n5.1A.I'Elt1 A 1.1.4 /Nil/NKr<br />\n<br />\n1.111C<br />\n<br />\n1.1CM ICNCIC ('AN<br />\n<br />\nOF<br />\n<br />\n1111V.<br />\n<br />\nN. I AltElitTY ST.<br />\n<br />\nNA. AU 11,ItlIONISil<br />\n<br />\nliers and<br />\nGUSHING &COMPANY'8Botaotkise<br />\noners.<br />\n<br />\nBALTIMORE.<br />\n<br />\nJas. Clark, l'rest<br />\nChas. S. Miller, Cashier.<br />\n<br />\nI.. Strouso, tee-Pres,.<br />\nEdw. P. Hayden, Ass't Cashier.<br />\n<br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 pt r year and upward.<br />\n<br />\nfiGGOtints Solicited.<br />\n<br />\n34 IN. BilLTIMORE STREET.<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W, LEHMAN di. SON,<br />\n<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep colistantly on hand the Text Books used<br />\n.1 1)5 I lopkins University and the Woman's<br />\n4(..<br />\n<br />\n9t.<br />\n<br />\nCollege of Bull itnore.<br />\n<br />\n•*<br />\n<br />\nSTA I IONBRY—For School, Family, Office and Bank.<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\n.1.11111.1011.111111.1111111111111111111111 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\n<br />\nTHOS.BLAKE CO<br />\nOn Sale The J. H. H. Perinani A. a<br />\n<br />\nii ail<br />\n<br />\nFOR<br />\n<br />\nJORDAN STABLER GO.<br />\n<br />\nC011(3)4E.<br />\n<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench. ISraiitt y—no adulterants, no coloring, flue quality.<br />\nOporto Port- -absolutely pure, of superior quality.<br />\nSherry---no coloring or adulterants, absolutely pure wine,<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spiees—no adulteration, :ill strictly pure.<br />\n<br />\n1 111(11E1AS.<br />\n'<br />\n<br />\nBRANCH STORE AT ROLAND PARK,<br />\n<br />\n219 EAST BALTIMORE Si.<br />\nA H. FETTING,<br />\nMANUFACTURER<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to C'unitri ins.<br />\n<br />\nOF<br />\n<br />\n(Breen ILater fratertutp Jewelry.,<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br />\n<br />\n'BALTIMORE.<br />\n20 West Lexington St,<br />\nSpecial 'Discount to Students.<br />\n<br />\nIPIcalbc Call ant+ 3SXainitte our Zinc :6cfort: i)tircbasinit.<br />\n<br />\nC.<br />\n<br />\nIP. telephone 44:i v.<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. 91 tr<br />\n<br />\n.1.1111NNINC,S & 110.1-2S101-,<br />\n<br />\n%RUZICKA<br />\n<br />\nM -t1HUIllANT TA I Li )14i'4,<br />\n<br />\n2I<br />\n<br />\nW. WAN'<br />\n<br />\n4'1.14 E five.<br />\n<br />\nBOOKS!!!<br />\n4-IANDII<br />\nSECONDMiscellane<br />\nous,<br />\nSchool, Medical and<br />\nBought, Sold and<br />\n<br />\nExchanged.<br />\n<br />\nPIPPEN'S F30011 STORE,<br />\n605 N. EIUTIVW ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\n6<br />\n<br />\nBoohbinder,<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO• WARNER,<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST II ALTIMORE<br />\nManufacturers of<br />\nSilk and CasIiiMOre Hats. to-<br />\n<br />\n// Op<br />\n<br />\nX. ins Cops<br />\n<br />\nNORTH OWN LLOYD S. S. 60.<br />\nCABIN PASSAGE aT LOW RATES.<br />\n<br />\nNew York to Brum, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBilLTIMORE TO BREMEN DIRECT.<br />\n<br />\nA. SCHUMACHER Ec GO., General Agents.<br />\n<br />\nPor particulars applu to<br />\n<br />\nJAS. MEIKLE, VICE-PRES,<br />\nISAAC H. DIXON, PlIF ..t.<br />\nJAS. R. RICHARDS, TREAS.<br />\n<br />\nTHE<br />\n<br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\n'Baltimore, Md.<br />\n<br />\nSmith, Dixon Co.<br />\n..1Paper..<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "•<br /><br />\nTHE<br /><br />\nNEWS LETTER eh<br /><br />\nThe Johns tIoDkins Press.<br /><br />\nThe Johns Hopkins Universitu<br />\nBALTIMORE, MARYLAND.<br /><br />\nTWENTY-SEVENTI-I YEAR.<br />\nBeginning October 1, 1002.<br />\nFaculty:<br />\nPresident: I un ItEMSICN. Dion of the Medical<br />\nWinn)Am H. How ni.n. bean u.1P Pi (view; Faculty:<br />\nUttirris.<br />\nH.<br />\nEliWAItO<br /><br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br /><br />\n(Courses for candi(a) In Philosophy and the Arts.<br />\ndates for the degree of Ph. D.)<br />\nfor the<br />\ncandidates<br />\n(b) In Medicine. (Courses for<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nFOR UNDERGRADUATEs:<br />\nAs candidates for the degree cif B. A.<br />\nAs special studt(nts.<br /><br />\nLibraries.<br />\n106,000 volumes.<br />\nUniversity,<br />\nPeabody Institute, 145,000 volumes.<br />\n200,000 volumes.<br />\nPratt Library,<br /><br />\nLaboratories.<br />\n‘'hemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics..<br /><br />\nDirectors.<br />\nIra Itemsen.<br />\nJoseph :S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam if. Welch.<br />\nJohn .1. Abel.<br />\nJohn .1. A bel.<br />\nWilliam Osier.<br /><br />\nDirectors.<br /><br />\n1.limeriean 3ournal of dnatbcmatice.<br />\nF. MORLEY, Editor. Quarterly. 4to.<br />\nXX V in progress. $5 per volume.<br />\namerican Chemical 3ournal.<br />\n1. REMSEN. Editor. Monthly. Svc).<br />\nX X VIII in progress. $5 per volume.<br /><br />\n111.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n6. Ilistorical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXVIII).<br />\nAmerican Journal of Philology (vol. X X III).<br />\nStudies in Historical and Political Science (vol. XX).<br />\nModern Language Notes(vol. XVII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nPniversity Circulars (vol. X X II).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, an also of the undergraduate or collegiate<br />\ncourses, *ill he sent on application to the Registrar.<br /><br />\nVolume,<br /><br />\n111. american 3Ournal of liThilologs<br />\n11. L. GI LDERSLEEV E, Editor. Quarterly. svo.<br />\nVolume X X III in progress. $3 per volume.<br />\nSy°.<br />\nStubies from the Itiological laboratory.<br />\n111).<br />\nVolume V complete. $.5 per volume.:<br />\nStalks in Thistorical sub Political Science.<br />\nP.<br />\nMonthly. 8VO, Series X X in progress. $3 per<br />\nvolume.<br />\n3ohns bophins 'University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. X X1 I in<br />\nprogress. $1 per year.<br />\nMonthly. 4to.<br />\n111111. Jobno lhophino lhospital Sulletin. year.<br />\nVolume XIII in progress. $1 per<br />\nP1111. 3ohns lhophino lbospital 'reports. 4to. Volume X<br />\nin progress. $5 per volume.<br />\nContributions to assyrioloay ant' Comparative<br />\n11X.<br />\nSemitic pbuoloov, wit rage zur A ssyriologio. etc.)<br />\nVol. LV complete.<br />\nX.<br /><br />\nMemoirs from the 36ioloaical laboratory.<br />\n• K. BROOKS, Editor. Volume IV complete.<br />\n$7.50 per volume.<br /><br />\nXl.<br /><br />\nfibobern /multiage Votes.<br />\nA. M. ELL101\"11, ',Alter. Monthly. 4th. Volume<br />\nX VII in progress. $1.50 per VOilliflo.<br /><br />\nX11. 3ournal of lExperimentalf1Debicine.<br />\nW. ii. virEipH, Editor. Ill-merit lily. mvo. Volume<br />\nVI in progress. $5 per volume.<br />\nX111. limerican Journal of insanity.<br />\nM. H IT RD, Editor. Quarterly.4to. $5 per<br />\nIf<br />\nvolume.<br />\nX1111). Ileporta of fibarylanb Ocological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\nIP.<br /><br />\nBasil L. Gildersleeve.<br />\nICirhy F. Sniith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nJ. II. Hollander.<br />\nPrank Morley.<br />\nfomeph S.<br /><br />\nVolume<br /><br />\nterrestrial Maanetiom ant' 'atmospheric Ziec.<br />\ntricity. L. A. BAT'ER, Editor. Quarterly. !Ivo.<br />\nVolume VII in progress. $2.50 per volume.<br /><br />\nt11111. annual 'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academie year.<br />\n1'11)111 Ennuallgedister.<br />\n(living the list of officers and students,and statin<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nIn addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowlan<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt,. Prospectus on application.<br />\nRowlamPs Photographs of the Ncirinal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johnic Hopkins 11:alpital. .1. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the A pestles. Complete fac-simile edition. Edited by .1. Icendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS. with A ntikgomena Epistlqs. Edited by I. H. Hall. $3,00.<br />\nBibliographia Hopkinsiensis. Part I. Philology. Parts<br />\n1I-111. Chemistry, Mineralogy and Geology. Parts<br />\n1V-V-VI. Physics,Astronomy and Mathematics.<br />\n8 VO. 30 cents per part.<br />\nft full list ol publisations will he sent on application.<br /><br />\nCommunications in respect to exchanges and remittances<br />\nmau he sent to Johns 'Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VII.<br /><br />\nJANUARY 9, 1903.<br /><br />\nNo. 6.<br /><br />\nTHE WORTH OF KNOWING ONE'S SELF.<br />\nHIS season of the year brings the business man a time for counting up the<br />\n.debit and credit columns in order to ascertain where he stands and to<br />\nlearn the strength of his position; with him it is a literal stock taking and<br />\nsettlement of his affairs for a new year. With us, as students, it is a period of<br />\nrenewed resolution to live nearer the ideals which we have set for ourselves<br />\neither in scholarship or in refinement of life or in other mental occupations<br />\nwith which our life is brought into immediate contact. The student comes to<br />\ncollege to learn the meaning of introspection; to investigate the bearing which<br />\nthings outside of himself have towards his own inner mental being; to grasp in<br />\nsome limited measure the significance of the great world drama which has been<br />\nPlaying from eternity and whose finale, whose denouement is that \"grand event<br />\ntowards which the whole creation moves.\" No wonder, therefore, if at this<br />\nOpening of a new year we moralize and reflect upon what we are, why we are<br />\nhere and ask ourselves whither we are tending. Like the merchant we take<br />\nan inventory, although of quite another kind than his. The result of our reck<br />\noning should be a balance of what points of strength we possess against the<br />\nPoints of weakness. As human beings we are a bundle of forces that resist,<br />\nthat overcome and which finally spend themselves in resistance. Powers of<br />\nmind and of body go hand in hand, so to speak, through life guided with<br />\nvarying degrees of mastership according to the individual contesting them. As<br />\nour physical forces wane our mental strength, toward our later life, should<br />\nexhibit a firmness and suppleness in direct ratio to our years and accompany<br />\nour failing bodies to brighten their existence and raise them from bitterness.<br />\nThe declining age of a man who has trusted his sensual life for satisfaction,<br />\nwhether in business or pleasure or idle ease, must be, logically, physical and<br />\nmental wretchedness. Now, realizing ourselves as endowed with these ele.<br />\nments of strength which, by some inscrutable law, must spend themselves, must<br />\nobjectify themselves in visible or rather tangible demonstration, we can reckon<br />\nwith ourselves as to what parts of our being need more attention than others.<br />\nIn other words, what are our points of weakness; what forces in our nature are<br />\nliable to show least resistance. The human frame, as we call it, falls asunder<br />\nnot by the utter collapse of all the parts—bones, muscles and nerves—but owing<br />\nto the frailty of a single weakness, which entails entire dissolution and which<br />\nthe forces of the system collectively cannot stay. Any material object, in like<br />\nmanner, follows precisely the same law. In the moral world the phenomena of<br />\nstrength and weakness also appears. It may be the Greeks meant to convey a<br />\nlesson to their youth of the importance of watching the weak point in character<br />\nby the portrayal of Hercules writhing under a tunic which his world-lifting<br /><br />\n2<br /><br />\nTHE NEWS-LETTER•<br /><br />\nstrength could not remove. Or the picture of Achilles might have afforded the<br />\nsame moral when that flower of Greek military prowess was made to meet death<br />\nat the hands of Paris who happened to direct the arrow against his invulnerable<br />\nbody. The hero fell because his heel had not been bathed in the stream whose<br />\nwaters had saved him from ten thousand arrows hitherto. It may be also that<br />\nSamson's career and its sequel conveys a meaning similar to that of Hercules<br />\nor Achilles. We can infer that if these giants of myth and history fell at the<br />\npoint of their greatest weakness, then our lives are subject to the same general<br />\nconditions as theirs. The unexpected, the unforseen contingencies are those<br />\nwhich, appearing suddenly as they do, strike at us and may prove too much for<br />\nthe resistance we can offer them. As students, we need strength to sustain the<br />\ncourage of conviction, and very frequently at times when, unawares, we stand<br />\nconfronted with a difficulty that only immediate courage can surmount.<br />\nThere is a moral sang-froid as well as a mental. Not that a man is to burden<br />\nhimself with a suspicion of danger impending, and to let the dread of it cast a<br />\ncloud over his life-----on the contrary—to face with calmness any emergency that<br />\nmay arise and despatch it cheerfully. A coward walks backwards into greater<br />\ndangers frequently than he would if he went forward, simply because he can see<br />\nwhere he is going w hen he faces the trouble he has to meet and might avert it<br />\nlargely. One of the forces we cultivate in college life is perseverance, which<br />\nis a phase of bravery; bravery, because after efforts made and repeated almost<br />\nto the point of physical pain we succeed in overturning and -laying out\" the<br />\ndifficulty that baffles during long hours. Milton is said to have passed scarcely<br />\nNow, in the<br />\na single one of his waking hours without a book in his hand<br />\nupon whom<br />\nthose<br />\nof<br />\npurpose<br />\nthe<br />\nexactly<br />\nis<br />\nit<br />\ntraining we receive at college,<br />\nthat responsibiliiy falls to guide the forces inherent in our nature along the lines<br />\nof courage, perseverance and restraint; to make us masters of ourselves and<br />\nhusband our energies according to reason; to teach us the lesson of self confidence plus a tranquility of bearing that marks a gentleman. Then,once started<br />\nin the direction of these attainments we grow into the educated man if<br />\nthough we forget every word of Latin and Greek that we ever<br />\nthumbed out of a lexicon. If this short paper were a fragment of a treatise on<br />\nethics which it is obviously not, the argument might prove how such a training<br />\nof the forces in a man's self reacted upon him and the race at large to the making of a better community in which he should chance to live. The important<br />\npoint of all is that, adding to his common sense, (which if Ile lack, no eduction<br />\nwere better in his case) the results gained from his intercourse with instructors<br />\nand fellow students and from conscientious painstaking with the very few books<br />\nrerched in three years' study, a student should go into the world with a<br />\nthoroughly healthful realization of his own strength and weakness and should<br />\nbe prepared to stand his ground cheerfully and firmly. In the natural course of<br />\nevents a student, when once left to his own resources ought to develope and<br />\nsurvive as against one who has never been apprised of his failings; his standard<br />\nof what a man is being higher than that of his unlettered neighbor requires of him<br />\ngreater action and should guard him against the shocks of experience by leading him to resist them with equanimity. Fortitude can cope with odds and bear<br />\ndefeat; brute strength gives way almost immediately on meeting a force but<br />\nslightly greater than its own—the one is intelligent strength while the other<br />\nlacks intelligence, and the college man who leaves his Alma Mater a stranger<br />\nto the meaning of this has to begin life on the level of boyhood.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nTHE CHRISTMAS TRIP OF THE MUSICAL CLUBS.<br />\n44froHAT! going to the Eastern Shore?\"<br />\n.<br />\nThis was the disgusted comment of most of the men when they<br />\nheard that the management of the University Glee, Banjo, and<br />\nMandolin Clubs had decided to take in Cambridge, Easton, and Salisbury this<br />\nyear, instead of the usual jaunt to the Valley of Virginia. Most of the men,<br />\nhowever, had evidently never experienced true Eastern Shore hospitality before, and a pleasant surprise awaited them, for the trip was the most enjoyable<br />\nChristmas trip ever taken by the clubs, and the most successful, artistically and<br />\nfinancially.<br />\nThe clubs, numbering 29 musicians of no mean ability, left Baltimore for<br />\nCambridge Monday, December 29th, on the steamer \"Avalon.\" The journey<br />\ndown the bay was not without incident The development of certain athletic<br />\ntendencies'by one of the heretofore solely literary and social lights of the clubs<br />\nmerely goes to subs,antiate the fact that a college education certainly does<br />\nbroaden one's scope.<br />\nWhen the clubs arrived at Cambridge, the men were invited to stay with<br />\nmany of the prominent old families there, and, of course, had a royal time.<br />\nThree dances in twenty hours ought to be a record, if it isn't. But even greater<br />\nthan the number of dances were the attractions and charms of Cambridge's<br />\nbeauteous daughters. The men, partfcularly one of them, completely lost their<br />\nhearts in this old storehouse of Dorchester County's history.<br />\nThe next place visited was Easton The same cordial welcome awaited<br />\nthe clubs here. After the concert, which was the best of the three, Mrs. Os—<br />\nwald Tilghman gave a fine dance, lasting well on into the New Year, at her<br />\nresidence. The house was a splendid one for the inevitable tele-a-tete, and the<br />\nmen made the best of their opportunities.<br />\nTo the accompaniment of sobs from the fair maidens, the men took their<br />\nleave of Easton Thursday morning. Our manager was so broken up at parting<br />\nthat he forgot most of his belongings, and had to return for them later. The<br />\ntrip to Salisbury was pleasant, the engine at times attaining the remarkable<br />\nspeed of iso<br />\nmiles an hour. Contrary to the precedent of all other Christmas<br />\ntrips, the prevailing card-game wfis whist. Some of the upper-clasmen devoted<br />\npart of their time to the study of the education of the young, and all that one<br />\nhad to do when an attendant was wanted was to blow a whistle, and a freshman<br />\nimmediately ran up to get his orders.<br />\nThe afternoon at Salisbury was spent in making calls and drinking eggnogg. The certainly know how to brew it across the bay.<br />\nThe crowd at the Salisbury concert was the largest one of the trip. After<br />\nthe concert was over, a most enjoyable Eastern Shore dinner was given by<br />\nRichard N. Jackson, '05, son of Ex-Gov. Jackson, whose family reside at Salisbury during the summer.<br />\nThere was some little disturbance at the hotel that night, owing to the fact<br />\nthat the room of two of the banjo club men had been wrecked. There was an<br />\nexciting battle on the third floor for a while, but it was interrupted several times<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nby visits of the proprietor. The men were at length quieted, and the two unfortunates of the banjo club were sent to bed in another room by Mr Snake,<br />\nthe irate host.<br />\nIt was hard for the men to get up at 6.30 Friday morning, but they had to<br />\ndo it. A few of the men were so completely carried off their feet by the charms<br />\nof Cambridge and Easton that they could not resist the temptation to go back<br />\nthere, but the majority returned via Claiborne to Baltimore, arriving here at 2<br />\nP. M. Friday.<br />\nThe men taken were:<br />\nMessrs. R. C. Pagon, Jackson, Humrichouse, Carver, Marshall, Bryan,<br />\nGilman, Hall, Ford, CoNites, Martin, Randall, Mason, Engle, Eveland, Coffin,<br />\nWinter, l,angnecker, Redewill, Baetjer, Nelson, Lanier, Snowden, Hendry,<br />\nBird, Plaggemyer, Geiger, W. W. Pagon and Super.<br /><br />\nY. M. C. A. NOTES.<br />\nHE morning prayer service is led this week by J. M. Motley. It is hoped<br />\nthat during this coming term more men will avail themselves of this opportunity for a few moments of worship. Men with 9 o'clock hour on can<br />\noften get in at 8.45 if they will think of it The singing is good but more voices<br />\nwill help. R. P. Stephens leads next week.<br /><br />\nt<br /><br />\nThe end this week brings to us a man of very marked ability, power, and<br />\nexperience. It is planned that next Sunday, January t ith, at 3.30, T. Jays,<br />\nEsq., St. Thomas' Hospital, London, Eng , will speak to college men. We<br />\nhave invited all the other Baltimore colleges to meet with us and if Hopkins<br />\nmen do their part to hold up a good reputation for Hopkins the upstairs room<br />\nin Levering Hall should be filled. Mr. Jays represents the British student<br />\nwork and is on leave of absence for this year to travel for the American Student<br />\nVolunteer movement among our colleges. Those of us who met hi in last year<br />\nrecall our great pleasure. We wish the same for all who will avail themselves<br />\nof this opportunity. Mr. Jays will be in town several days and be very glad to<br />\nmeet as many men personally as possible.<br />\nHe comes to us as a fellow student who has worked for a number of years<br />\nas missionary in Western Africa, and now returned to complete the medical<br />\ncourse. At the end of his course he returns to the African position. His stories<br />\nof difficulties, dangers and privations met with and the triumphs of the Gospel<br />\namong those people are facinating. One feels their force aad influence from the<br />\nstrong personality of the man. All men not :.fraid of such a presentation are<br />\nurged to take this opportunity.<br />\nAny man who run across an opportunity for a handbook “add\" are urged<br />\nto pick it up and mention to J. L. Bennet or the General Secretary.<br />\nThe Graduate Student Bible Class will succeed Dr. Foote's Class Meeting<br />\nat the same time and place, Dilhnan Library, 3rd floor McCoo Hall, every<br />\nThursday at 5 o'clock. Topics will be prepared by the committee.<br />\nThe General Secretary or Mr. L C. Barret would like to have the names<br />\nof any men who would like to have a series of daily Bible readings to follow<br />\nthrough the year.<br /><br />\nTHE NEWS—LETTEk.<br /><br />\nALUMNI NOTES.<br /><br />\n'93<br /><br />\nH. P. Thieme (Ph. D. '97) has been appointed<br />\nassociate in Modern<br />\nLanguages at the University of Michigan.<br /><br />\n'96<br /><br />\nDr. J. A. C. Chandler has been appointed professor of<br />\nhistory at Richmond College, Richmond, Va.<br /><br />\n97 Wax field Longcope, A. B. '97, M. D.'ox, resideft, pathologist in the<br />\nPenn<br />\nSylvania Hospital, Philadelphia, Pa., was in Flaltinibre during<br />\nthe holidays.<br />\nRobert E. Belknap, '97, now of Yonkers, N. Y., spent part<br />\nthe time with him.<br />\n'98<br />\nThomas Fitzgerald, Jr., who was for a time superintendant<br />\nof the Electric Railway Company of Fairmont, W. Va., is now<br />\nengaged in electrical work<br />\nat Norfolk, Va.<br />\n'00<br /><br />\nDr. W. L, Foushee has been selected to fill the chair of the<br />\nprofessor of<br />\nLatin at Richmond College, Richmond, Va.<br /><br />\n'00<br /><br />\nA. R. V. Schertnerhorn has returned from Chicago, where he<br />\nwas practicing law, to become a member of the Baltimore bar.<br /><br />\n'01<br /><br />\nHarry L. Byrne left in the earlier part of the month for Omaha<br />\n, Neb.<br />\nHe has been appointed special agent and adjust<br />\ner of the Fidelity and Deposit<br />\nCompany of Maryland, to cover the states of Kansas,<br />\nNebraska, Iowa, and<br />\nMissouri. His address will be, care H. A. Wagner, First Nation<br />\nal Bank Building, Omaha<br />\nAlfred Bruton, 'ox, now at Boston, spent Christmas here.<br />\nJames L. A. Burrell is United States Vice-Consul at Madgeburg,<br />\nGermany.<br /><br />\nOn Saturday night, January 3rd, the '01 Alumni Association<br />\nheld its second<br />\nannual banquet at the Carrollton Hotel. John M. Booker was<br />\ntoast master.<br /><br />\nHOLIDAY VISITORS.<br />\nlarge number of alumni visited the University during the holida<br />\nys<br />\nAmong those who were here were: Dr. George Lefevre, '91, Profes<br />\nsor<br />\nZoology at the University of Missouri; Dr. A. M. Reese, '02, instruc<br />\ntor<br />\nof Biology at Syracuse University; Charles Edward Lyon,<br />\n'97, one of the most<br />\nsuccessful of the younger teachers at Princeton; Roger T. Anders<br />\non, 'oo,<br />\nGeneral Thealogical Seminary, New York; Henry Warner, '00, Univer<br />\nsity of<br />\nWisconsin; J. M. Bandel, 'or, now at Auburn Seminary, New York;<br />\nAbner<br />\nSaylor, 'or, at the Harvard Law School; J. Gresham Machen, 'ox, at Prince<br />\nton<br />\nheological Seminary; Sidney Smith, '02, was here from the Harvar<br />\nd Law<br />\nSchoo!; Gibson Sisco, '02, with the Pennsylvania Railroad at Fort Wayne<br />\n,<br />\nIncl.; Thomas C. Pinkerton, '02, at Boston \"Tech;' W. B. Hill, '02,<br />\ntraveling<br />\naudito, for the Maryland Casualty Company; J. Sharshall Grasty, '02,<br />\na graduate student at Washington and Lee University.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n6<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly (luring the University Year by the Students of T II F. JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nJANUARY 9, 1903.<br />\nSubscription $1.50 per year.<br />\n.<br />\n.<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Edam's,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br />\nHARRY K. TOOTLE, 1908.<br />\n. GEoit(ix A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n...............<br />\nW. S. Bum 1908.<br />\n. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\nRiu(tiN BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to HARRY K. TOOTLE, box 637, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BA EU ER,<br />\nJ H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nITH this issue a change will be noted in the staff of the Nuws LETTER.<br />\nMr. Robert S. Lanier relinquishes his position as head of the paper in<br />\norder to devote his entire time to the Hullabaloo. It is with regret<br />\nthat his co workers on the NEWS-LETTER part company with their editor-inchief. Since his first year at the University lie has been an energetic, efficient<br />\nworker for the good of the paper, devoting to it his time and talent with unstinted measure, The N itws LETTER loses him only that he may devote himself to the labors which the class of 1903 has declared to be peculiarly his own.<br />\nWhile Mr.. Lanier made no radical changes in the policy pursued by his<br />\npredecessors, he has strengthened the paper by his careful attention to the various departments of college life and by securing a series of leading articles which<br />\nhave been of timely ,interest to the student body. His editorials, liberal in tone<br />\nand free from class or ,fractional bias, bore witness to his thorough acquaintance<br />\nwith all phases of University life and to a jealous regard for its customs and traditions.<br />\nFrom now until within a few weeks of the close of the college year Mr.<br />\nLanier will be engaged in editing the Hullabaloo. With such an editor-in-chief<br />\nthe class of 1903 makes no idle boast in declaring that the Hullabaloo this season will be far superior to any previous year-book.<br /><br />\nero<br /><br />\nTHU N EWS—LETTUR,<br /><br />\n7<br /><br />\nIn his management of the paper the NEWS-LITTER feels that Mr. Lanier<br />\nhas given promise of a useful literary career In him was found that rare combination of literary talent and executive ability which gives assurance of future<br />\nsuccess in the field of letters. The NEWS LETTER does not doubt but that future<br />\neditors of this paper will feel an honest thrill of pride on thinking that they are<br />\nworking on the same paper which Bob\" Lanier once edited.<br /><br />\nZ<br /><br />\nHE lacrosse situation at present cannot be said to call forth the enthusiasm<br />\nof its follows. Captain Straus is doing his part, the old men are as conscientious as ever, and the coach is painstaking and careful with all who<br />\nrequires his attention. The serious trouble lies with the new men. During<br />\nthe past month General Apathy has been making a vigorous campaign among<br />\nthem. Few took the trouble to come out, and those few evinced a surprising<br />\nlack of interest in the game. Considering that the Freshmen were facing their<br />\nfirst examinations something may be pardoned them; yet it seems strange that<br />\nthey could not find some time to devote to Hopkins' greatest game. The old<br />\nmen cannot play on forever, new blood must be injected from time to time, and<br />\nthe members of the Freshman Class are to supply this new blood. It would be<br />\na disgrace to the class and to the University as well if they refused to accept<br />\nthe burdens which college life imposes upon them. A man who can work but<br />\npersists in shirking his duty is not worthy of a place among us. This is the beginning of a new term and it is to be hoped that a new spirit will animate the<br />\nnew men from the very first. The game is a facinating one, and well repays<br />\nthe time and attention one may bestow upon it.<br />\nThe track team, also, has not had its full quota of new men at all times.<br />\nAs in the case of the lacrosse team the old guard has been faithfully at work.<br />\nDuring the holidays scarcely a day passed but what some of the old men were<br />\nat work in the cage. With the inter class games not more than three weeks off<br />\neach class ought to get out as many men as possible, for every point will count.<br />\nBesides that, these games will be excellent prrctice for the new men; they will<br />\ngive a feeling of confidence which will be of great advantage when the time<br />\ncomes to run in competition with outsiders.<br />\nThe NEWS-LETTER has no desire to preach, but it cannot refrain from<br />\nuttering a word of warning and advice to the new men.<br />\nUST at present the question of a debate with the Leland Stanford, Jr.,<br />\nUniversity is being agitated. To the NEWS-LETTER the idea of going<br />\nquite across the continent at the present time seems senseless, if not to<br />\nsay ridiculous, when we can find at our own doors so many foemen worthy of<br />\nour steel, What end cin be furthered by debating with Leland Stanford, which<br />\nwould not be subserved as well by debating with some college nearer home?<br />\nWe shall have our hands full in preparing for the debate with North Carolina.<br />\nWhatever time may be available after this one is concluded could well be devoted to a debate with some other college, but why it is necessary to go to<br />\nLeland Stanford is beyond our comprehension.<br /><br />\nJ<br /><br />\nTHE NEWS—LETTER.<br />\nthe<br />\nZHli large number of Hopkins men who were present at the meeting of<br />\nde—<br />\nis<br />\nholidays<br />\nthe<br />\ng<br />\ndun<br />\nil<br />\nn<br />\nAssociatio<br />\nLanguage<br />\nmeeting of the Modern<br />\nserving of more than passing note. That so many were present, in a<br />\ngathering of representative educators of America, who received their education<br />\nfortunate<br />\nat this University gives us cause to congratulate ourselves that we are<br />\nits<br />\namong<br />\nnumbers<br />\nwhich<br />\nan<br />\ninstitution<br />\nof<br />\nsmall,<br />\nhowever<br />\npart,<br />\nenough to be a<br />\nwas<br />\nn<br />\nAssociatio<br />\nLanguage<br />\nModern<br />\nThe<br />\nmen.<br />\nhed<br />\ndistinguis<br />\ngraduates so many<br />\nthe<br />\nfounded by men connected with the Johns Hopkins University, and from<br />\nn.<br />\ninspiratio<br />\ngreatest<br />\nits<br />\nreceived<br />\nhas<br />\nn<br />\nHopkins the associatio<br /><br />\nHERE are now two places on the editorial staff of the NEWS LETTER which<br />\nare to be filled as soon as possible. , It has been thought best that one<br />\nplace he given to each of the lower classes. All contributions which may<br />\nAs both<br />\nbe handed in will receive the careful consideration of the editors.<br />\nweigh<br />\nwill<br />\nof<br />\nnews<br />\nitems<br />\nvacancies are for the positions of assi.tant news editors<br />\nlatter<br />\nthe<br />\nalthough<br />\njokes,<br />\nand<br />\nmore in a candida.e's favor than stories, poems,<br />\nand<br />\nnotes,<br />\nalumni<br />\nwill not be unwelcome. News items—university notes,<br />\nundergraduate notes—may be handed in at any time.<br /><br />\nt<br /><br />\nAMONG THE COLLEGES.<br />\nHE latest statistics as to the number of students in the larger univercities of<br />\nthe United States are as follows : 1, Harvard, 5,468; 2, Columbia, 5,352;<br />\n3, Chicago, 4,296; 4, Michigan, 3,764; 5, California, 3,767; 6, Minnesota, 3.505; 7, Cornell, 3,281; 8. Wisconsin, 2,884; 9, Northwestern, 2,875; to,<br />\nYale, 2,894; II. Pennsylvania, 2,549; 12, Nebraska, 2,289; 13, Syracuse, 2,020;<br />\n14, Indiana, z,648. 15, Missouri, 1,406; t6, Leland Stanford, Jr., 1,378, and 17,<br /><br />\nt<br /><br />\nPrinceton, 1 ,345.<br />\nHarvard has the largest teaching staff-533 instructors; Columbia is second,<br />\nwith 504. Columbia has the largest total of non-professional graduate students.<br />\nThe seventh annual performance of the Lehigh Minstrel Association, last<br />\nmonth, was a decided success<br />\n\"The Mirage,\" a four sheet weekly, published by the students of the<br />\nUniversity of New Mexico, has a staff of eighteen, eight of whom are of the<br />\nfair sex.<br />\nIn the intercollegiate chess tournament, the representative of Columbia<br />\ndefeated those of Harvard, Yale and Princeton.<br />\nThe question of allowing the students to get their B. A degree in three<br />\nyears, is under discussion at the University of Texas. The Professors there are<br />\nnot in favor of the change.<br /><br />\n1<br /><br />\nTHE NEWS-LETTER.<br /><br />\n9<br /><br />\nA dinner of the Yale Alumni in Paris was held on the night of the YaleHarvard game. The affair was so successful that it was decided that the YaleParis dinner should be made a permanent institution.<br />\nIn the all-Southern football team picked by Dr. W. A. Lambeth, physical<br />\ndirector of the University of Virginia, there are four men from the University<br />\nof North Carolina, and of the three from Virginia, one was a North Carolina<br />\nman in 1901. He makes up the team as follows: Cox, of North Carolina, left<br />\nend; Johnson, of Virginia, left tackle; Lemoine, of Sewanee, left guard; Givens,<br />\nof Georgetown, center; Foust, of North Carolina, right guard; Council, of Virginia, right tackle; Bronston, of Virginia, right tackle; Graves, of North Carolina, quarterback; Holt, of North Carolina, left halfback; Edgerton, of Vanderbilt, right halfback; Carpenter, of V. P. I , fullback.<br />\nThe $525,000 for the University of Pennsylvania Gymnasium is now collected, all but $17,000. The work of construction will be started at once.<br /><br />\n11<br /><br />\nThe number of students at the University of Michigan has increased from<br />\nto 3,764 in 1903.<br /><br />\nn 1841<br /><br />\nAt the annual meeting of the Inter University Lacrosse League, composed<br />\nof Harvard, Cornell, Columbia, and the University of Pennsylvania, a change<br />\nwas made in the play regulations, a rule being amended to allow the substitution of another player for one withdrawn from the game.<br />\nThe spring debate between the Universities of Utah and Nevada will be on<br />\nthe interesting subject, \"Resolved, that the settlers on arid lands should pay for<br />\nthe improvements made by the government.\"<br /><br />\nMR. R. BRENT KEYSER ELECTED PRESIDENT OF THE BOARD<br /><br />\nOF TRUSTEES.<br />\nT the meeting of the Board of Trustees, held on last Monday, Mr. R.<br />\nBrent Keyser was elected president to succeed Mr. James L. McLane,<br />\nwho resigned some time ago. Mr. Francis White, who is one of the<br />\noriginal Board of Trustees, and who has been acting as president since<br />\nMr. McLane's resignation when into effect, was elected president, but declined<br />\nthe honor, as he felt that it would be better for a younger and more active man<br />\nto have the place. Mr. Keyser was then elected. He was chosen a member of<br />\nthe Board last May, and since then has taken an active interest in the affairs of<br />\nthe University.<br />\nAt the meeting President Remsen delivered his annual report to the trustees. He stated that the University was free from debt, and that there never<br />\nwas a time when the University had been unable to meet its obligations. It<br />\nwas announced that the million dollar fund would not be wholly available for<br />\nuse until the end of the present academic year.<br /><br />\nc(<br /><br />\nTHE NEWS-LETTER<br /><br />\n10<br /><br />\n11110111<br />\n11111111M101111111110000111111111111110111110111011111111111111111011111011 111101111111111111111111111111111M114111MMIIIIIM11111111111111MUM111<br />\n•<br /><br />\nMai<br />\n•<br />\nmthmimmignomouniiii<br /><br />\n„<br /><br />\nR. C. E. WALTERS headed a delegation of Baltimoreans at the first meet<br />\ning of the Wild Flower Preservatioh Society of America held in Washington on December 27.<br />\nThe University was well represented at the annual convention of the<br />\nAmerican Association for the Advancement of Science, held in Washington last<br />\nweek. As president of the association Dr Ira Remsen presided, and responded<br />\nto the address of welcome, and delivered the principle address at the second<br />\ndays' session, when he spoke on \"The History of a Doctrine.\" Others in attendance from the University were: Drs. D. C. Gilman, Wm. B. Clark, Wm.<br />\n11. Welch, 0. L. 1-.'assig, and Mr. A. W. Smith.<br />\nDean Griffin recently addressed the Methodist Episcopal ministers meeting<br />\non \"Recreative Reading.\"<br />\nDr. Gilman presided at the public meeting of the Woman's Auxiliary of<br />\nthe Maryland Civil Service Reform Association, held in McCoy Hall on the<br />\nnight of January 5.<br />\nHarlan Updegraff, A. M., last year assistant to Nicholas Murray Butler,<br />\nPresident of Columbia University, will lecture before the Pedagogical Society<br />\nSaturday, January 17, at It A. M., in the Donovan Room.<br /><br />\nANNUAL CONVENTION OF MODERN LANGUAGE ASSOCIATION<br />\nOF AMERICA.<br />\nN the last three days of December the University was the host of a distinguished body of men literary and linguistic scholars, the members of<br />\nthe Modern Language Association of. America. The convention was a<br />\nHopkins affair since, with one exception. all the meetings were held in McCoy<br />\nHall, and from the fact that University men have always taken a prominent<br />\npart in the association. Dr. A. Marshall Elliott was the first secretary of the<br />\nassociation, which office he filled from 1883 to 1892, and on his resignation Dr.<br />\nJames W. Bright was elected to succeed him, and in turn carried on the work<br />\nfor nine more years. Last year Dr. Bright resigned and was elected to the<br />\npresidency, as Dr. Elliott had been before him.<br />\nThe association was called to order by President Bright on the afternoon of<br />\nDecember 29. In the absence of President Remsen, who was in Washington<br /><br />\nO<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nattending the meetings of the American Association for the Advanc<br />\nement of<br />\nScience, the address of welcome was delivered by Professor Basil L.<br />\nGildersleeve. He spoke of the splendid work that the association was doing,<br />\nand how<br />\nit was helping scholars. After the reports of the<br />\ndifferent officers had been<br />\nmade, and committees appointed the association proceeded to hear commun<br />\nications and to discuss them. The papers read at the various meetings covered<br />\na 'great variety of subjects and many interesting<br />\nphilological facts were brought<br />\nto light.<br />\nThe social features of the gathering added much to the pleasur<br />\ne of the<br />\ndelegates. They included receptions at the homes of different member<br />\ns of the<br />\nlocal committee, as well as a \"smoker\" at the University Club.<br />\nThe election of officers to serve for the coming year was held at the<br />\nmeet<br />\njug on Wednesday morning Dr. George Hempl, of the Univers<br />\nity of Michigan, a Hopkins man, and formerly a teacher here was elected<br />\npresident. The<br />\nExecutive Committee contains two other Hopkins men. Dr. Bright was placed<br />\non the Editorial Board of the association, and a motion<br />\nwas passed to the effect<br />\nthat the next volume of the association publications be dedicat<br />\ned to Professor<br />\nBright in recognition of his splendid services during the past year. The<br />\nlocal<br />\ncommittee having in charge the entertainment of the delegates was<br />\nas follows:<br />\nProf. A M. Elliott (chairman), Dr, H. B Green (secretary), Drs.<br />\nH. Wood,<br />\nE. C. Armstrong, Paul Haupt, T. S Baker, Fabian Franklin, C.<br />\nC. Marden,<br />\nKirby F. Smith, B. J Vos, H. Froelicher, and Mr. T. Marburg.<br /><br />\nUNDERGRADUATE NOTES.<br /><br />\nO<br /><br />\nN the evening of December 23, a feed was held at the Hullabaloo Club.<br />\nThe feature of the evening was a song by Mr. Mackdermott, ably<br />\nseconded by Jack Nelson. At a seasonable hour a turkey dinner was<br />\nserved by s caterer.<br />\nH. K. Tootle has severed his connection with the \"Baltimore American.\"<br />\nThe editors of the \"Hullabaloo\" recently requested President Woodrow<br />\nWilson, of Princeton, to write their leading article, but President Wilson was<br />\ncompelled to refuse on account of being pressed for time.<br />\nThe Debating Club has sent a proposal to the students of Leland Stand ford,<br />\nJr., University for a series of three annual debates preferably on some phase of<br />\nthe tariff question. The first to take place at Leland Stanford, the second at the<br />\nHopkins, and the third at some intermediate point. The proposal will be considered by the Leland Stanford Debating Club in the early part of this month.<br />\nThe Senior Class is preparing to hold its annual class banquet. It is not<br />\nexecred to be as interesting as last year's banquet. Yet every one is guaranteed<br />\na good time. H. W. Plaggemeyer will be the toast master.<br />\nCarroll M. Sparrow, a former member of '03, sailed on the third of the<br />\nmonth for Porto Rico to take soundings on the southwest coast for the United<br />\nStates Coast and Geodetic Survey.<br /><br />\n12<br /><br />\nTHE NEWS—LETTER,<br /><br />\nThe editors of the \"Hullabaloo\" request that the members of the Senior<br />\nClass have their pictures taken as soon as possible. A prompt compliance with<br />\nthis request will greatly facilitaie the work of the hoard.<br />\nT. Wesley Glocker is still confined to his home with a severe attack of<br />\ntonsilitis.<br />\nThe musical clubs will give a concert, January 13, at the Homestead Methodist Episcopal Church.<br />\nThe fiat has gone forth that there must be no more smoking in Walter's<br />\nbarber shop. Alas, where now will the loafers congregate to woe my Lady<br />\nNicotine? Walter has not burst forth into one of his philosophical discourses<br />\nreplete with wisdom, but he has promised a contribution on smokers and the<br />\ngentle art of smoking for the next issue.<br />\nThe question for debate between Hopkins and the University of North Carolina has at last been agreed upon. We take the affirmative of the question,<br />\nResolved, That our merchant marine should not be subsidized.<br />\nFABLES FOR THE FOOLISH.<br />\nIn Words of a Few Syllables.<br />\nV. THE FABLE OF THE NEVER-WORKS<br />\nNCE upon a time there was a class in Bugology. Each and every one was<br />\na noble specimen, worthy of a better fate. Their time was spent in the<br />\nelusive hunt for animals who had a faculty of hiding behind grains of<br />\nBy the aid of their microscopes they<br />\nsand and other minute particles of matter<br />\nwhen they thought of what<br />\nappetites<br />\nsaw so many things that they lost their<br />\nthan those kept in bottles<br />\nother<br />\nliquids<br />\nno<br />\nthey might be eating, and they drank<br />\nLouis.<br />\nSaint<br />\nin<br />\nand guarenteed with a blue ribbon made<br />\nSuch was the class.<br />\nTheir mornings they spent in learning long definitions, their afternoons in<br />\nchasing the giddy bacteria across a colored slide, and their evenings in trying<br />\nto forget what they had learned in order that they might start fresh the next<br /><br />\n0<br /><br />\nmorning.<br />\nSuch a remark as this would occasionally awaken the class from its lethargy:<br />\n\"0 professor, I have had three installments of goo, and I can't find my cute<br />\nlittle bug anywhere!\" But such intervals of intellectual lucidity were rare.<br />\nExamination day dawned at last. The questions were jotted on the board<br />\namid groans trom the assembled victims. From previous examination papers<br />\nthey thought they knew what was coining, but they were foiled again, and the<br />\njanitor chortled in his glee. So it came to pass that the Bugologists were seized<br />\nwith violent stage fright, and were smitten hip and thigh with that which they<br />\nhad held to be a cinch. When the marks were forthcoming, lo! few had passed,<br />\nand they as if by accident The tenth part has not been told, but the mantle of<br />\nsweet charity covereth the rest.<br />\nMORAL —This fable teaches freshmen that all play and no work makes<br />\nJack a dull boy.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n13<br /><br />\nLACROSSE OUTLOOK.<br />\nOW that the ordeal of the Christmas examinations and the dissipation ot<br />\nthe holidays is over, the captains of the lacrosse and of the track and<br />\nfield teams will have a right to the attention of the men for several<br />\nmonths to come. In the direction of lacrosse particularly, Captain Henry<br />\nStrauss purposes continuing systematic work in the cage until the first signs of<br />\nSpring appear, and the candidates are able to turn out at Druid Hill Park.<br />\nThe first practice this year was held in the cage Tuesday afternoon, and a<br />\nvery encouraging squad put in appearance.<br />\nA feeling of reticence, however, still seems to exist among the freshmen,<br />\nfor '05 turned out a very small percentage of the whole squad There is certainly no good reason for this, for the class is large and contains quite a number<br />\nof well-developed men. Smoke up, freshmen! \"It's up to you.\"<br />\nAs regards prospects, the outlook is decidedly better than it appeared at<br />\nthe close of the season last year. Several of the candidates—notably those<br />\nfrom the junior ranks—are showing up remarkably well Briscoe, the goal<br />\nveteran, may return in a few weeks; Ranft, of the 1901 team, declares his<br />\ninsention of trying for a position on the twelve; and Captain Strauss with a<br />\nknowing smile tias one or two other trump cards up his sleeve, which will not<br />\nbe divulged at present.<br />\n.<br />\nJust as was the case in football last fall, the lacrosse team also needs a fast<br />\nscrub, and it behooves every new man to come out and learn to handle a stick.<br />\nIt is an obligation due the University.<br />\nThe usual uncertainty still exists in regard to th-1, schedule for the season.<br />\nThe dates with Swarthmore and Stevens Institute are certain, but Lehigh wants<br />\nto play later in the season, and Cornell is apparently by no means anxious to<br />\nline up against Hopkins on her own grounds The Crescent Athletic Club is<br />\nalso due here in May, and a reply from Oxford, England, is expected every<br />\nday. Besides these two brilliant exhibition games, a third will probably be<br />\nadded in the direcLion of the Toronto twelve. It is more than likely that the<br />\nCanadians will repeat their visit to Baltimore for another contest in June.<br />\nWith a collegiate league composed of four teams and such exhibition games<br />\nas the foregoing, the season should be the greatest in the history of lacrosse at<br />\nJohns Hopkins.<br />\nLet every man come out and hustle! There's a feeling of duty well-discharged as well as all kinds of glory in it.<br /><br />\nal<br /><br />\nI I<br /><br />\nTHE NEWS-LETTER.<br />\nTRACT TEAM AT WORK.<br /><br />\nT the present time it is not possible to give a very definite account of the<br />\naffairs of the Track Team, as it is only in a formative period. On the<br />\nfirst day after the holidays, regular systematic work was renewed. The<br />\ncage once again began to assume its old-time business-like appearance. Straggling in from all directions came embryo record-breakers and old stagers to put<br />\nthemselves under the tender care of \"Pather Bill,\" who must discover and<br />\ndevelop the best that is in them. Previous to this the training has been of a<br />\ndesultory nature. However, from now on, hard, steady, unterrupted by holidays, will be strictly observed. The work, light at first, will gradually be<br />\nincreased until the best possible results are obtained.<br />\nNo definite plans for the future have as yet been formulated. One idea to<br />\nbe highly commended is the proposed holding of Interclass games in the cage.<br />\nThe events, if found practicable, would probably include relay races, 30 yard<br />\ndash, 440 yard, one half and one mile run, high jump and shot-put. Aside<br />\nfrom furnishing amusement to the spectators, arousing interest, and perhaps<br />\nraising funds, they have a very important influence upon the general work of<br />\nthe Track Team. They will undoubtedly stimulate interest in track work and<br />\nbring out men whose ability is as yet unknown even to themselves. A little<br />\nfriendly class rivalry will sometimes stir up class and college spirit that can be<br />\nreached in no other way, and when once aroused it is not likely to decrease,<br />\nbut give vent to itself in many ways.<br />\nJust here in connection with interclass games, it may not he altogether out<br />\nof place to say a word about the recent cane-rush—that was not. The 6th of<br />\nDecember, the Christmas holidays, and the beginning of the second term are all<br />\nthings of the past. But what of the cane-rush! Is it a thing of the future?<br />\nEverybody seems to know less about it than everybody else. The silence on<br />\nthe subject from some quarters has become so oppressive that it can almost be<br />\nfelt. The facts in the case are becoming more and more complicated, and are<br />\ngradually giving way to vague rumors. Now that the holidays are over, it is<br />\ntime that some definite action be taken in the matter. Speak up, someone, and<br />\nrelieve the suspense of those concerned.<br />\nCaptain Hoffman has been on the sick list for several days. He is now<br />\nwill be<br />\nable to direct the work of the men, however, and from now on work<br />\ncarried on every evening in the cage.<br />\nhim<br />\nH. K. Tootle has been nursing a sprained ankle, which has hampered<br />\nyear.<br />\nfreshman<br />\nhis<br />\nin<br />\nbroke<br />\nin his work. It is not his left ankle, the one he<br />\npossible. It is irnpos<br />\nThe new men are urged to get spike shoes as socn as<br />\nfor his work.<br />\nequipped<br />\nproperly<br />\nis<br />\nhe<br />\nunless<br />\nspeed<br />\nman's<br />\nsible to get a line on a<br /><br />\nTHE NRWS-LETTER,<br /><br />\n15<br /><br />\nAs yet no meeting has been held of the committee who are to manage the<br />\nInter-class games in the cage. It is expected that all the arrangements will be<br />\ncompleted next week.<br /><br />\nOZZY'S ORIGINAL ODDITIES.<br /><br />\nLITTLE FRANKIE.<br />\nFrankie died of forty fits,<br />\nSquirmed himself to tiny bits<br />\nPapa looked sad to see him twist,<br />\nAnd said, \"Poor boy, how he'll be missed!\"<br /><br />\nII.<br /><br />\nJOHNNY'S EXPERIMENT.<br /><br />\nJohnny poured vitriol over the baby.<br />\nDid the dear little one scream? Well maybe!<br />\nPapa turned 'round when he heard all the noise,<br />\nMerely declaring, \"well boys will be boys!\"<br />\nOZZY,'03.<br /><br />\nTHE WOOLY WESTERN<br /><br />\nMETHOD.<br /><br />\n\"Iowa City was the scene of a large and enthusiastic rough-house last<br />\nFriday night. It started with a Freshmen party Such effrontery roused the<br />\nire of the Somophores, who manifested their disgust by throwing a skunk in<br />\nthrough a window. This declaration of war was quickly followed by a volley<br />\nof eggs.and rocks. Then the Freshmen, much incensed, came .out to see about<br />\nit. The fight which ensued and in which the police took active part lasted till<br />\ndaybreak. The police used clubs and revolvers and two medical students were<br />\nseverely wounded before the force was put to rout.<br />\n\"When an inventory was taken, about $700 damages to glass and other<br />\nbreakable furniture and numerous broken heads were all the visible assets.\"—<br />\nMinnesota Daily.<br />\nAnd Dean Griffin objects to singing in the elevator!<br /><br />\nWAITRESS (at quick-lunch stand): Do you want to eat this sandwich here<br />\nor take it with you?<br />\nGENTLEMRN—Both.--LamPoon.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n16<br /><br />\ntoo good a<br />\nMISS DE SwELL—I'm afraid, doctor, that I have been having<br />\ndo?<br />\nI<br />\nshall<br />\ntime. My complexion is losing its color. What<br />\nDOCTOR—Diet.—Princelon 7.1:4Yer.<br /><br />\nDUMHEAD—Nelson<br /><br />\nwas coining to call, but I told him you would he<br /><br />\nengaged this evening—<br />\nriver.<br />\nMiss OLEMADE (raptuously)-0h, William:—Princeton<br />\nbut he no bite.a.''<br />\nThe ancient Romans or Italians said: \"Hamilcar Birca,<br />\n—Widow.<br /><br />\nSHE—Is<br /><br />\nhe a college man?<br />\nno! His handwriting is perfectly legible —Harvard Lam -<br /><br />\nHE—Gracious,<br /><br />\npoon.<br />\nHE (excitedly after a good play)—Isn't that ripping?<br />\nSHE (dismayed and feeling-ly)--Isn't what ripping?<br />\nHE—That tackle Blank just made.<br />\nSHE(relieved)—Oh!—Record.<br />\nexams?<br />\nSHE—How did you come out in the Christmas<br />\n.<br />\nRecord<br />\nHE—Passed as soon as I saw them—Yale<br />\n\"Sing a song of Fr hies who foiled away the term,<br />\nNever studied Hydra, Dog iish or the Worm;<br /><br />\nseen—<br />\nWhen the lists were published, and results were<br />\nmagazine.\"<br />\nBut here we draw a veil, for ladies take the<br />\n—McGill Outlook.<br /><br />\nvictim's courage fell.<br />\n\"Shall I brain him?\" cried a hazer; and the<br />\non the head.\"—Sfihinx.<br />\n\"You can't, it is a Freehman. Just hit him<br /><br />\nOPEN ALL NIGH'F..<br /><br />\nWILLIAXSON 0 WATTS,<br />\nruo %tores.-,<br />\nHoward and Franklin Streets.<br /><br />\n'Baltimore and Eutaw Streets.<br /><br />\n1Drugs. fancg CI3oot.). 11)cutit map, Collet 'Articles, Cigars, SoDa<br /><br />\nTHE CHEAPEST PLACE<br /><br />\ni'. 'Phone 3350-Y.4111<br /><br />\nIN BALTIMORE FOR<br /><br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Ooods, Glass Ware,<br />\nSludents' Sundries.<br /><br />\nHENRY N. BRUNS,<br />\nDrawing<br />\nzitui Svirveyinu instrunlent.s,<br />\nDriu“.flitsulcii's ;Anil<br /><br />\nH. S. WRIGHT 8L. CO.,<br />\n704 MADISON AVE.<br /><br />\nN. \\A'. Corner<br />\n1.exhiqt.on ;it'd Liberty Sl.s.<br />\nAOCn<br /><br />\nXIV f-f;<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br /><br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nM. MEADE, OF LONDON,<br />\nEXPERT CLEANER AND DYER,<br />\n126 N. I !i JTAW S'I'. (2nd and 3rd floors).<br />\nThe moat complete and modern department for<br />\ncleaning, dyeing and altering Gents' and Ladies'<br />\ngarments.<br />\nIt's time gear Winter Clothing was put in order.<br />\nDoes it need to be cleaned, dyed, altered or repaired? Are now linings and velvet collars necessary?<br />\nNever mind what's the matter, we will fix it up to<br />\nlook like new, and you won't have to pay very much<br />\neither. The Price List speaks for itself.<br /><br />\nM. BERNSTEIN &amp; CO.<br />\nLoND0N—A M ER WAN<br /><br />\n...TAILORS<br /><br />\nAND<br /><br />\nIMPORTERS...<br /><br />\nLOW PRICES AND FINE WORK.<br />\nWe make clothes that lit well, look well and wear<br />\nwell, that's very Important.<br />\nThe most fastidious man can find nothing to growl<br />\nabout our garments.<br />\nThe same attention is given to the man that is less<br />\nparticular, it's our way.<br />\nWe are prepared to show you a large line of imported woolens, which does not cost any more than<br />\nthe domestic.<br />\n-SEE US BEFORE BUYING\"<br />\n126 Noi-rri I IA ITAW STRIArr.<br />\n(Second door above Joel Gutman &amp; Co.)<br /><br />\n.1(7i<br /><br />\nellffet<br /><br />\n4V<br /><br />\nHenderson's<br /><br />\nESS!<br /><br />\n11,AI .T1M0121.1.<br /><br />\nC( ,<br /><br />\nt<br /><br />\nof<br /><br />\nNeW<br /><br />\n.<br /><br />\n0<br />\n6<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nTeNt llooks, Note Books,<br />\nMadison<br />\nStudents' Supplies.<br /><br />\n&amp; Howard Sts.<br /><br />\nGENTLEMEN'S CLOTHING PRESSED<br />\nCONTRACT. $1.50 PER MONTH.<br />\nPRICES FOR DRY CLEANING AND DY FANG .<br />\nGentlemen's Suits cleaned and pressed<br />\n$1.00<br />\nTrousers,<br />\n.25<br />\nCoats,<br />\n—<br />\n.50<br />\nVests,<br />\n.25<br />\n_<br />\n_<br />\nOvercoats,<br />\n1.00<br />\nBoys' Suits, according to size, .50, .75 and 1 00<br />\nVelvet collars on overcoats,<br />\n.75<br />\nRELINING.—A new lining will often make a garment which you have discarded good for another<br />\nseason's wear. All altering and repairing done here<br />\nby skilled tailors.<br />\nDYEING.<br />\nGentlemen's Suits dyed and pressed,<br />\n$2.011<br />\nOvercoats, '<br />\n1.50<br />\n1.00, 1.25 and 1.50<br />\nBoys' Snits, according to size<br /><br />\nCLOTHES MADE To ORDER.<br />\nThe illustrations show how the clothes we make fit<br /><br />\nand look—the wear you'll learn about later.<br />\nThe light overcoat is an especially snappy garment,<br />\nThe sack suit is cut after the very newest pattern.<br />\nThe winter overcoat is as swagger as the dressiest<br />\nman could wish.<br />\nWe make all other proper styles, of course; dress,<br />\ncutaway, double-breasted, four-button sack and<br />\nNorfolk suits.<br />\nYou can now have first pick of our first pick of<br />\ncloths.<br />\nPrices are low—we never learned to charge too<br />\nmuch. We would like to make your clothes.<br />\nLOWEST PRICES EVER KNOWN.<br />\nWe guarantee to give you latest style and a perWorkmanship<br />\nwill be the best you eversaw.<br />\ntit.<br />\nfect<br />\nYour money back If you are dissatisfied.<br />\n126 N. Eutaw St.<br />\nM. PIEUNSTI:IN &amp; CO.<br />\nSEE OUR PRICE LIST FOR CLEANING, DYEING AND ALTERING.<br /><br />\n0001101$600,000. SI110111811110 dIldIVIded PfOiliS $400.000<br /><br />\nSTIEFF PIANOS<br />\nA1.1.11i.:<br /><br />\nDrovers Sc Mechanics Nat'l Bank,<br /><br />\n5.1A.I'Elt1 A 1.1.4 /Nil/NKr<br /><br />\n1.111C<br /><br />\n1.1CM ICNCIC ('AN<br /><br />\nOF<br /><br />\n1111V.<br /><br />\nN. I AltElitTY ST.<br /><br />\nNA. AU 11,ItlIONISil<br /><br />\nliers and<br />\nGUSHING &amp;COMPANY'8Botaotkise<br />\noners.<br /><br />\nBALTIMORE.<br /><br />\nJas. Clark, l'rest<br />\nChas. S. Miller, Cashier.<br /><br />\nI.. Strouso, tee-Pres,.<br />\nEdw. P. Hayden, Ass't Cashier.<br /><br />\nft General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 pt r year and upward.<br /><br />\nfiGGOtints Solicited.<br /><br />\n34 IN. BilLTIMORE STREET.<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W, LEHMAN di. SON,<br /><br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep colistantly on hand the Text Books used<br />\n.1 1)5 I lopkins University and the Woman's<br />\n4(..<br /><br />\n9t.<br /><br />\nCollege of Bull itnore.<br /><br />\n•*<br /><br />\nSTA I IONBRY—For School, Family, Office and Bank.<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\n.1.11111.1011.111111.1111111111111111111111 Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br /><br />\nTHOS.BLAKE CO<br />\nOn Sale The J. H. H. Perinani A. a<br /><br />\nii ail<br /><br />\nFOR<br /><br />\nJORDAN STABLER GO.<br /><br />\nC011(3)4E.<br /><br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench. ISraiitt y—no adulterants, no coloring, flue quality.<br />\nOporto Port- -absolutely pure, of superior quality.<br />\nSherry---no coloring or adulterants, absolutely pure wine,<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spiees—no adulteration, :ill strictly pure.<br /><br />\n1 111(11E1AS.<br />\n'<br /><br />\nBRANCH STORE AT ROLAND PARK,<br /><br />\n219 EAST BALTIMORE Si.<br />\nA H. FETTING,<br />\nMANUFACTURER<br /><br />\nIlgenfritz Studio<br />\nSuccessor to C'unitri ins.<br /><br />\nOF<br /><br />\n(Breen ILater fratertutp Jewelry.,<br /><br />\nARTISTIC PHOTOGRAPHY<br /><br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, MD.<br /><br />\n'BALTIMORE.<br />\n20 West Lexington St,<br />\nSpecial 'Discount to Students.<br /><br />\nIPIcalbc Call ant+ 3SXainitte our Zinc :6cfort: i)tircbasinit.<br /><br />\nC.<br /><br />\nIP. telephone 44:i v.<br /><br />\nLibraries arranged and put in<br />\norder without removal. 91 tr<br /><br />\n.1.1111NNINC,S &amp; 110.1-2S101-,<br /><br />\n%RUZICKA<br /><br />\nM -t1HUIllANT TA I Li )14i'4,<br /><br />\n2I<br /><br />\nW. WAN'<br /><br />\n4'1.14 E five.<br /><br />\nBOOKS!!!<br />\n4-IANDII<br />\nSECONDMiscellane<br />\nous,<br />\nSchool, Medical and<br />\nBought, Sold and<br /><br />\nExchanged.<br /><br />\nPIPPEN'S F30011 STORE,<br />\n605 N. EIUTIVW ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br /><br />\n6<br /><br />\nBoohbinder,<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO• WARNER,<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgents for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST II ALTIMORE<br />\nManufacturers of<br />\nSilk and CasIiiMOre Hats. to-<br /><br />\n// Op<br /><br />\nX. ins Cops<br /><br />\nNORTH OWN LLOYD S. S. 60.<br />\nCABIN PASSAGE aT LOW RATES.<br /><br />\nNew York to Brum, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBilLTIMORE TO BREMEN DIRECT.<br /><br />\nA. SCHUMACHER Ec GO., General Agents.<br /><br />\nPor particulars applu to<br /><br />\nJAS. MEIKLE, VICE-PRES,<br />\nISAAC H. DIXON, PlIF ..t.<br />\nJAS. R. RICHARDS, TREAS.<br /><br />\nTHE<br /><br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\n'Baltimore, Md.<br /><br />\nSmith, Dixon Co.<br />\n..1Paper..<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36248, "display": null, "description": null, "target_type": "file", "target_uuid": "153743ca-44da-46b1-8b31-8bb3da99d359", "url": "http://digital.library.jhu.edu/system/files/2022-03/12228-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12228, "target_type": "node", "target_uuid": "0148ab19-baa5-4dae-9e46-049c2da64a5b", "url": "/node/12228"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "e8aad3e4-99d9-44ff-8b8f-dd49a5217760"}]}