{"mid": [{"value": 35654}], "uuid": [{"value": "e0566856-7ff8-46d8-9785-034fb48c538d"}], "vid": [{"value": 35654}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12196-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:39+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VI. No. 7<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nnotixiMoRg. MD.<br />\nL<br />\nTWeatg-tileth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\n.<br />\n.<br />\nDean of the College,<br />\n<br />\nIRA REMSEN.<br />\nWbf. H. HOWELL.<br />\nEDW. II. GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\n100,000 volumes.<br />\n136,000 volumes.<br />\n200.000 volumes.<br />\n<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nIra Be,msen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clan h.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nIri/liam Oster.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitie,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,:<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F.Smith.<br />\nMaurice Blotmtfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.freight.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIY<br />\nIn progress. $5 per volume.<br />\nII. American Chemical Journal.<br />\nI. REMSEN,Editor. Monthly. 8vo. Volume XXVI<br />\nIn progress. $6 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo.<br />\nVolume XXII in progress. $3 per volume.<br />\nIV. Studies from the Biological Laboratory. Five.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4th. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $6 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie,etc.)<br />\nVol. IV in progress.<br />\nI. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume TV complete. $7.50<br />\nper volume.<br />\nXI. Modern Language*Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. Ito. Volurae<br />\nXVI in progress. $1.60 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bt-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD,Editor. Quarterly. 41:o., giS Per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWI LLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. HAUER, Editor. Quarterly.<br />\n8vo. Volume VI in progress. $2.60 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the university<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of °Moors and students, and stating<br />\nthe regulations, etc., of the University. Publiabed at the close of the academic year.<br />\n<br />\nGroups.<br />\nI. Classical(the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.)<br />\n3. Chemical-Biological.<br />\n(leading up to Medicine.)<br />\n4. Geological-Thologthal.<br />\n5. Latin Mathematical.<br />\n41.<br />\n(loading up to Law.)<br />\n7. Modern Languages.<br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics(vol. X XIV.)<br />\nIra Berneen.<br />\nChemistry (vol. XXVI).<br />\nBasil L. Gildersleeve.<br />\nPhilology (vol. XXII.)<br />\nJ. M. Vincent.<br />\nHistory vol. XIX.)<br />\nModern Languages(vol. XVI.) A. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nASgyriology (vol. IV.)<br />\nExperimental Medicine(vol. VI.) W.H. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate students in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectruni•<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 118 pp. 4to. 68 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fao-simile cditiori. Edited by J. Bendel Harris. 110 pp. 4to.<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MRS. with Antilegomena.Epistles. Edited by I. H. Hall. MOO.<br />\nBibliographia Hopkinsionsis. Part I. Philology. Part<br />\n!<br />\ne<br />\nChemistry, Mineralogy and Geology. P\"'—<br />\nIV-V-VI.Physios, Astronomy and Mathematics8 vo. 30 cents per part.<br />\nA full list of pliblleatIons will be sent on applicationl<br />\nCommunications In respect to exchanges and rsmittancs<br />\nmau be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nJANUARY 15, 1902.<br />\n<br />\nNo, 7.<br />\n<br />\nJOHNS HOPKINS MEN IN THE WEST.<br />\nLAWRENCE, KANSAS, JANUARY 2nd, 1902.<br />\nTo the Aditor of\"THE NEWS-LETTER\":—<br />\naccordance with your request to write a few lines concerning the influence of Hopkins men in the West, I have the pleasure to respond as follows,<br />\nconcerning a territory which might be called the Southwest in distinction from<br />\nthe northern tier of western states. This would include Iowa, Nebraska, Missouri, Kansas, Arkansas, Texas, and Oklahoma.<br />\nTo my knowledge there are over seventy alumni and ex-students of the<br />\nJohns Hopkins University within this territory engaged in professional work.<br />\nOf these I find seven in the University of Kansas, eight in the University of<br />\nMissouri, five in the University of Arkansas, three in the University of Iowa,<br />\nand seven in the University of Nebraska. The remainder are scattered in the<br />\nvarious universities and colleges of the Southwest.<br />\nI need not say to you that this large body of men, going forth well equipped with Johns Hopkins instruction and methods, and moreover partaking of<br />\nthe Johns Hopkins spirit of making the truth subservient to the good of<br />\nhumanity, has great influence on the educational work in their respective<br />\ninstitutions.<br />\nCompared with Eastern institutions of greater age or more wealthy foundations the Western institutions are lacking in equipment. Also, notwithstanding<br />\nthe progressive spirit of the West, there is always a lack in the organized support of higher culture and learning. In the making of the West, so-called<br />\npractical ideas predominate, and there is a tendency to make education immediately serviceable to material prosperity; and hence, the educational spirit<br />\nWhich surrounds the Western institution varies somewhat from that surrounding an Eastern institution where culture has been the predominant feature.<br />\nThe Johns Hopkins men have found it necessary to adapt themselves to<br />\ncircumstances, and while they love the truth for the truth's sake, their greater<br />\nwork has been the adaptation of this truth to the uplifting of humanity and the<br />\neducation of the people in right thinking. Perhaps every university man is, in<br />\none sense, a missionary of the truth, and this seems more apparent in the West<br />\nthan in the East. The University man in the West is supposed to know almost<br />\neverything, and is called upon to lecture on all sorts of subjects pertaining to<br />\nthe political, social, economic, or scientific life of the people. Under such cirIn<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\ncumstances special investigation and profound research are difficult, and, in<br />\nmost cases, I may say, impossible. Libraries are small; the hours of school<br />\nservice in the university are long; the requirements for outside lectures are<br />\ngreat, so that while a Western professor may be able to do some fairly good<br />\nwork in his attempt to add to the \"sum of human knowledge,\" his chief work<br />\nis that of instructor both within and without the university.<br />\nThe great West is absorbing. In the attempt to develop its resources millions of capital are taken up, much of it never to be returned. It is so in educational affairs. The university and the community demand the professor's<br />\ntime, his ideas, indeed, his whole life. They take all he has to give just as a<br />\nsponge takes water, except that they never reach a point of saturation. I have<br />\nthis therefore to say of the Johns Hopkins men in the West, that, while probably few of them will put on record any great literary or scientific achievements,<br />\ntheir services will be best noted in the general improvement of the communitks<br />\nin which they live and the advancement of the educational institution to which<br />\nthey are attached.<br />\nUnder such circumstances it would be impossible to make any definite<br />\nestimate of their services in the cause of education or their influences upon<br />\nhumanity, for much that they do will be shown in the higher educational ideals<br />\nand a better social and political life of the community, to be revealed more<br />\nespecially in the future than in the present, a general good which is traced to<br />\nno one in particular.<br />\nAs it is, the professor in wealthy Eastern institutions, called upon for a<br />\nfew lectures each week, surrounded by magnificent libraries and finely equipped<br />\nlaboratories, with comfortable salaries, in close touch with learned societies and<br />\neasy access of European learning, may establish lines of culture, write learned<br />\nbooks giving forth new discoveries; but the Western professor must be content<br />\nto serve his community though it absorbs his very life, counting it fortunate to<br />\nread the results of the research of his more favored brethren in the East, and<br />\nconscious that his services are exhibited in the youth he h As helped forward and<br />\nthe community he has served.<br />\n<br />\nFRANK W. BLACKMAR,<br />\nEx-President Johns Hopkins Club of the Middle West.<br />\n<br />\nTHE QUARTER-CENTENNIAL CELEBRATION.<br />\nORK is being actively pushed for the two days exercises on February 2122, which are to commemorate the twenty-fifth anniversary of the opening of work at the Hopkins, and which will also formally inaugurate<br />\nPresident Remsen. Dr, Gilman, President Emeritus of the University, will have<br />\ncharge on the first day, and will deliver an address, to be followed by responses<br />\nfrom visiting delegates. On the second day, President Remsen will be inaugurated, and will take charge of the ceremonies, which are to include the conferring of honorary degrees. This is quite a departure from the traditional policy<br />\n<br />\nv<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\nof the University. On one other occasion only—in 1879—have honorary Hopkins degrees been conferred.<br />\nThe general committee of arrangements is as follows: Former President<br />\nD. C. Gilman, chairman; President Ira Remsen; Professor Gildersleeve, of the<br />\nGreek department; Professor Osler, of the department of medicine; Professor<br />\nWelch, of the department of pathology; professor Elliott, of the department of<br />\nRomance Languages; Professor Clark, of the department of geology; Professor<br />\nHaupt, of the department of Oriental languages; Dean Griffin, head of the department of philosophy; and Professor Ames, of the department of physics.<br />\nFor the purpose of expediting the work, this general committee is organized<br />\ninto sub-committees, as follows: Executive Committee, President Remsen,<br />\nchairman, Dr. Ames, Dr. Griffin; Music Committee, Dr. Haupt, chairman, Dr.<br />\nGilman, Dr. Remsen, ex officio; Committee of Arrangements, Dr. Clark, chairman, Dr. Elliott, Dr. Remsen, ex officio. This last committee is to arrange all<br />\ndetails relating to guests, delegates, program, etc. The Executive Committee<br />\nis very busy getting out the invitations, which will be issued this week, to<br />\nprominent men in the city and country at large.<br />\nIt is felt that this occasion will mark an epoch and a change in the history<br />\nof the University, and the ceremonies promise to be most noteworthy and impressive.<br />\nTHE CENTURY ESSAY.<br />\nT is very gratifying to every one connected with the University to know that<br />\nthe prize essay in the Century's competition for college graduates of 1900<br />\nhas been won by Mr. James Edward Routh, who took his bachelor's<br />\nof<br />\ndegree here year before last. The essay is published in the January number<br />\nLita<br />\nas<br />\n\"Huxley<br />\nof<br />\nestimate<br />\ncomprehensive<br />\nthe Century, and is an able and<br />\nerary Man.\" The press and the various weeklies have given very flattering<br />\nnotices of Mr. Routh's article, and the \"Review of Reviews,\" respecting the<br />\nessay, says: \"Mr. Routh makes the point that Huxley's great significance was<br />\nnot in the propounding of new doctrines, nor in the popularizing of science, but<br />\nin the power which enabled him to construct workable theories of life and ethics<br />\nout of loose truths.\"<br />\nIt is in just this way that graduates can best show their love for Hopkins,<br />\nand the only way in which they can actually serve her—by doing something<br />\nthat will attract the notice of the public and bring the University before the<br />\ncountry at large. The result of a number of successes like this Mr. Routh has<br />\nachieved, which tend to wake people up to the fact that Hopkins is a live institution, and that things worth while are being done there, is incalculable.<br />\n<br />\n5<br />\n<br />\nOHN ERSKINE, Columbia, has won the Century Magazine prize for the<br />\nbest poem offered by a college graduate of the year 1900. His poem is<br />\nan idyl, entitled \"Acteon.\"<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS—LETTER.<br />\nTHE CHRISTMAS TRIP OF THE MUSICAL CLUBS.<br />\nN the dawn of December 26, the members of the Musical Clubs, rubbing<br />\ntheir eyes and joking about being up so early in the morning, left Camden<br />\nStation on a special car for West Virginia. Their first concert was given<br />\nthat night at Charlestown. While the whole programme was well appreciated,<br />\nthe banjo solo by V. B. Smith, and \"Dixie\" by the Glee Club, were most<br />\nloudly applauded. After the concert, the men were invited to several small entertainments given to them by some of the residents of the town.<br />\nWhen the clubs were on the point of leaving Charlestown the next morning,<br />\na great excitement arose. \"Where is Ham, Jr.?\" Sure enough the club's<br />\nmascot had suddenly disappeared. After considerable searching, he was found,<br />\nwith his mouth wide open with astonishment, gazing at the \"funny\" eggshaped heads of the local \"crowd.\"<br />\nThe second concert was at Winchester, which has always been noted for<br />\nthe kind reception that she gives Hopkins boys. This year, an audience, even<br />\nlarger than that of last year, turned out to hear them in the theatre of the new<br />\ntown hall, built by Charles Broadway Rouss. If the success of the concert could<br />\nbe measured by the applause, it was immense. The dance given to the club<br />\nafter the concert by the youth and beauty of Winchester was greatly enjoyed.<br />\nThe next morning the men hired vehicles, and took their lady friends out driving. But, alas, 2.10 came too soon, and the hard-hearted manager hurried them<br />\noff to Hagerstown. Many and touching were the good-byes on leaving Winchester, and the men all declared that it was the place where they wanted to go<br />\nwhen they died.<br />\n.<br />\nThis year, the clubs went from Winchester to Hagerstown by a different<br />\nand more rapid route, over the Cumberland Valley Railroad, through the beautiful Shenandoah Valley. At Hagerstown, the audience was small. Although<br />\nthis was on account of the rain, it is probable that the clubs will not return<br />\nthere for several years. After the concert, the last dance was given to the<br />\nclub; it was well arranged and very enjoyable.<br />\nThe programmes for all the concerts were creditably rendered. The Banjo<br />\nClub was undoubtedly the best. Its pieces, though few, were well chosen and<br />\nwell played. The Glee Club was a close second, though not because it had a<br />\nlarge number of pieces. The Mandolin Club did not seem to be up to the high<br />\nstandard of last year.<br />\nWhile the trip this year was greatly enjoyed it differed materially from<br />\nformer ones. Of the various \"clubs\" that sprung up and added to the general<br />\nenjoyment, the \"Goonay\" was the only survivor of last year. Then, too, the<br />\nmysterious flitting around of Andrew Reid Bird was greatly missed, although<br />\nhis place, as manager, was admirably filled by Robinson Cator Pagon,'03.<br />\nJ. C. H. '03.<br />\n<br />\n3<br />\n<br />\nThe Yale Glee and Banjo Clubs report for the last year total receipts of<br />\n$19,985.13, $16,933.53 of which were from concerts.<br />\n<br />\n\f5<br />\n<br />\nTHE NEWS—LETTER.<br />\nTHE CONDITION OF THE CLUBS.<br />\n<br />\nORTY-ODD candidates for the musical clubs would seem to indicate no<br />\nlack of material, when it is remembered that not more than twenty-five<br />\nmen can be taken on the long trips, and yet there are places, waiting for<br />\ngood men, that it seems hard to fill, notably first tenors on the Glee Club, and<br />\nwind, wood, or brass, on the Mandolin Club, where a clarionet or horn would<br />\nhelp immensely. There is no need to urge the benefits to the University, in the<br />\nway of advertising, that come from musical clubs of a high standard and creditable performances. It is even less necessary to speak of the good times enjoyed by all the members on the excursions. An attractive program is pre<br />\nsented this year. Arrangements are being made for probable trips to Washington, Annapolis, and Bryn Mawr, while the Old Point schedule for Easter has<br />\nbeen completed.<br />\nThe clubs are to leave on the 28th of March, spend the 29th and 30th at<br />\nOld Point, and proceed on the 30th to Richmond, where a concert is being arranged by President A. R. Bird, '01. At Old Point the men will take meals at<br />\nthe Chamberlain, a concession not before granted, and there the principal concert and dance will be given.<br />\nInnocent Freshmen! Sober Grads! here is a chance for such of you as<br />\nPossess tuneful talent, developed on potential, to enjoy your college life, and<br />\nhave your musical performances a benefit, not only to yourselves, but to the<br />\nUniversity.<br />\n<br />\n5<br />\n<br />\nA DIFFERENCE OF DEGREE.<br />\nOn pleasure bent—<br />\nThe dainty, tinted missives sent,<br />\nThe careless way the days are spent,<br />\nThe stacks of sheckels lost or lent,<br />\nThe heedlessness of next month's rent,<br />\n0, happy hours of sweet content!—<br />\nOn pleasure bent.<br />\nOn pleasure broke—<br />\nThe bills that come as thick as smoke,<br />\nThe things that have to go in soak,<br />\nThe friends that always croak and croak,<br />\nThe hardness of misfortune's stroke,<br />\nAhl Well we know it is no joke!<br />\nOn pleasure broke.<br />\nBut broke is not much worse than bent,<br />\nAnd bent is almost broke, you see;<br />\nSo why this fundamental change<br />\nIn a simple difference of degree?<br />\n<br />\nR. V.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nJANUARY 15, 1902.<br />\nSubscription $1.50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br />\n<br />\n10 Cents a single copy.<br />\n.<br />\nSOL STROUSE, 1902.<br />\n. EBEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br />\n<br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nArt Editor,<br />\nCHARLES F. RANFT, 1902.<br />\nBusiness Manager,<br />\nAUBREY PEARRE, JR., 1902.<br />\nAssistant Business Manager,<br />\n. HARRY BAETJER, 1903.<br />\nAddress all articles, communications, etc., to SOL STROUSE, box 557, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nAthletic Editors,<br />\n<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n<br />\nHE leading article in this issue is one, which, because of the broad field it<br />\ncovers, ought to prove of interest not only to Hopkins men, but to the<br />\nwhole educational world. It gives the remarkable record of Hopkins men<br />\nin the educational development of the West, and at the same time a general<br />\nsurvey of the conditions for and against the westward progress of education.<br />\nDr. Frank W. Blackmar is a Johns Hopkins Ph.D., and is at present Professor<br />\nin the University of Kansas. Until recently Dr. Blackmar was President of the<br />\nJohns Hopkins Club of the Middle West. His communication, therefore, has<br />\nthe weight of study at close range.<br />\n<br />\nt<br />\n<br />\nINCE the last issue of the NEWS-LETTER a change has taken place on the<br />\nhoard of editors, and a new editor-in chief now assumes the responsibility of the office. Before proceeding farther we desire to congratulate Mr.<br />\nWilliam B. Hill on the successful manner in which he conducted the paper, and<br />\nto give a word of praise to the numerous improvements made during his incumbency as editor in chief. Mr. Hill has filled various positions on the board<br />\nsince his Freshman year, and has always been a faithful worker for the good of<br />\nthe paper. In our opinion the NEWS-LETTER under his regime made more<br />\nstrides toward the position it should hold at Hopkins than at any previous time<br />\nin its career. With such a broad field to cover, and with such limited resources<br />\nat hand, the attempt to edit a successful college paper at Hopkins is no sinecure,<br />\nand requires all the efforts of the editors, supported by the active encourage-<br />\n<br />\nA<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\nmeat of the student body. Without liberal encouragement the paper can never<br />\nhold its due position. Therefore in order to keep it to its standard we call on<br />\nthe student body and alumni for a continuance and increase of support, by contributions in the form of news items, original articles, poems, or short stories.<br />\n1,14 Juniors and Freshmen who have aspirations along literary lines should<br />\ntry for the position now vacant on the NEWS-LETTER staff. The advantages accruing from Nnws-LItTT4R work do not tend toward one<br />\nall<br />\nparticular sphere of activity, as the training derived will benefit men in<br />\nwho<br />\n,<br />\npursuing<br />\nnow<br />\nare<br />\nthey<br />\nwork<br />\nwhat<br />\nmatter<br />\nno<br />\nbranches of study. All men,<br />\ncan write and will work, should take advantage of this opportunity, and strive<br />\nfor the vacant editorship. Articles on news or athletic events, or original contributions should be handed in as soon as possible, as the election will take<br />\non<br />\nplace in a short time. All work done in this competition will be counted<br />\ncontests.<br />\nin<br />\nfuture<br />\nor<br />\nthe record of the competit<br />\n<br />\n4<br />\n<br />\nHOUGH there is apparently less athletic activity during the winter months<br />\nthan at any other season of the year, this time is really the most important for the development of successful teams. This is the time for hard<br />\ntraining and vigorous practice in gymnasium and cage, when talent is brought<br />\ntaking<br />\nforward and the structure of the team is formed. There are few games<br />\ngames<br />\nhard<br />\nplace now, but the quiet work in the cage is preparing men for the<br />\ns<br />\ncandidate<br />\nthat will follow one another later in the season. Now is the time for<br />\ntill<br />\nwait<br />\nto<br />\nto come out if they ever expect to make teams; they cannot afford<br />\nsome set<br />\nlacrosse practice starts at the park or till the track team is entered for<br />\nhad,<br />\never<br />\nhave<br />\nof games. The coming lacrosse season will be the hardest we<br />\n.<br />\nstandard<br />\nits<br />\nand it requires a great amount of work to keep the team up to<br />\na<br />\nonly<br />\nleft<br />\nThe track and field team has lost some of its best men, and has<br />\nphysismall nucleus on which to build. We therefore urge all men who are<br />\ntry to<br />\nand<br />\ncally able to do athletic work to go out now with one of the teams<br />\nper<br />\nninety<br />\nmake it. If you are new and inexperienced, remember that about<br />\ncent. of all Hopkins athletes were \"made\" at Hopkins.<br />\nes<br />\nHU Senior Feeds, the Senior Prom. and various other Senior enterpris<br />\nspirit<br />\nHopkins<br />\nthe<br />\nin<br />\nchange<br />\nng<br />\n- now in embryo, indicate an interesti<br />\nwhich should be productive of much good. Formerly it was one of the<br />\nthe<br />\nlaws of the so-called Hopkins spirit for seniors to be serious spectators of<br />\nthe<br />\nbeen<br />\nhave<br />\nshould<br />\nwho<br />\nseniors,<br />\nactions of juniors and freshmen, so that the<br />\non-lookpassive<br />\nthan<br />\nmore<br />\nmuch<br />\nnatural leaders in all college affairs, were not<br />\ners. At present it appears to be the senior spirit which dominates the Hopsuch<br />\nkins spirit, and the greatest field of activity is the graduating class. Just<br />\nsometo<br />\namount<br />\nwill<br />\nthat<br />\nthings are needed to build up a genuine college spirit<br />\nthing in later years, that will be a bond between the alumnus and his Alma<br />\nMater; for no matter how high the Academic standing of a college is, it cannot<br />\nhold the interest of its alumni except by pleasant recollections and associations,<br />\n<br />\nZ<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nBy this we do not mean that fun is the only essential of a true college spirit,<br />\nbut it is the first from which all other demonstrations spring. It would be a<br />\ngood plan for 1903 and 1904 to follow the lead of the seniors in enlivening old<br />\nHopkins.<br />\nHE first twenty-five years in the growth of anything, be it man or institution, are always the most vital, the most fraught with dangers, and the<br />\nmost full of obstacles; and when these years are successfully passed<br />\nthere is always just cause for a halt and a retrospect. The Johns Hopkins<br />\nUniversity will, on February 2122, stop its regular routine for a celebration of<br />\na quarter of a century's growth, which in methods and results has filled educators in Europe and America with wonder. The founding of the University<br />\nmarked an epoch in education in the United States, for methods entirely unknown on this side of the Atlantic were introduced into the Hopkins system of<br />\ninstruction. The exceedingly high standard of the great German universities<br />\nwere set as the goal for the Hopkins graduate departments, so that now the<br />\nreputation of the Hopkins degree of philosophy surpasses that of any American<br />\nUniversity, and equals the best in Europe. A recent account published in the<br />\ndaily papers of this country from an interview with a Yale graduate, stated<br />\nthat though Yale, old as she is, was seldom mentioned in European educational<br />\ncircles, the name of Johns Hopkins bore a magic charm; while in America any<br />\ngraduate from the \"phiolosophical machine\" of Hopkins, a name by which the<br />\nUniversity was once characterized, can secure a teaching position anywhere.<br />\nResults such as these, attained in so short a period as twenty-five years, are<br />\nsurely worthy of a great celebration, especially as this year we stand on the<br />\nthreshhold of a new era, and begin the second quarter under a new president<br />\nwhose inauguration occurs at the same time. It is true that owing to a remarkable lack of support, the dawn of the new era is not as bright as it should be;<br />\nyet it seems that it must almost be a result of a natural phenomenon for the<br />\nclouds to clear, for the alumni and friends of the University to recognize that<br />\nwhat it has done it can continue to do—if nobly supported by those it has<br />\nreared, and by those to whom it has brought an untold wealth.<br />\n<br />\n\fTHE NEWS—LETTER'<br />\n<br />\n9<br />\n<br />\nHaiffiniammounimourn rthipiimommoomunimummoimmuniumummummommumnumummithinummommunis<br />\n<br />\noievologoin11111111141111ivrIvroWilllivoliwolfilliglliliiillililirIPIIMIIIIN1111111111111111111111111111111111111111111111inillialltiglIffifillig1!g1:P:i4irsal;01<br />\n<br />\nACH member of the class of 1901 and 1902 has received an attractively<br />\nprinted copy of the baccalaureate sermon delivered by the Rev. John<br />\nSparhawk Jones, D. D., before the class of 1901, at last year's commencement. The thanks of the students are due to the originators of the plan.<br />\nAt a recent meeting of the Junior Class it was decided that only those members who have gained distinction in class athletics or on the debating team<br />\nshall be allowed to wear the class numerals. Those men who played on the<br />\nclass foot ball team and who had a hand on the cane in the cane-rush are entitled to the honor. Messrs. R. C. Pagon and Franklin Hazlehurst have the<br />\ndistribution of the numerals in charge. They are to be awarded at the class<br />\nbanquet which will be held on February 10.<br />\n<br />\nG<br />\n<br />\nUpon several occasions during the present year there has been some talk<br />\nabout holding a senior promenade. The good results to be derived from such<br />\nan affair by promoting the social unity of the student body are easily seen, and<br />\nPresident Harvey B. Stone has made several attempts to have some action<br />\ntaken in the matter. Just why a certain element in the class discountenance<br />\nsuch attempts can not readily be seen. It is to be hoped that plans for holding<br />\nthe dance will materialize before it is too late.<br />\nEben C. Hill, 1902, has at last recovered from his severe attack of typhoid<br />\nfever. He will probably not continue his full course at the University, however, until next year, Prior to his illness, Mr. Hill managed the musical<br />\nclubs, and at a recent meeting of the NEwS LitrrER staff was elected associate<br />\neditor.<br />\nH. K. Tootle, 1903, has also returned to the University after being confined<br />\nseveral days with an attack of malaria.<br />\nAt a recent meeting of the Freshman class, J. Newman Nutnsen was<br />\nelected class president, succeeding Edmund Dickey, who has been obliged to<br />\nleave the Hopkins. Dickey will be remembered as the man who, almost singlehanded, stopped so many rushes of the Junior team in the class game; and he<br />\nwas the only Freshman who kept a grip on the cane.<br />\nThe Senior and Junior debating teams organized last week. Chas.<br />\nMarkell, Jr., was elected chairman of the Senior team, Fred. L. Guggenheimer,<br />\nSecretary; S. Blum was elected chairman of the Junior team. The date of the<br />\ninter-class debate is February 28, that of the inter-collegiate two weeks later on<br />\nMarch 13.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nThe course in experimental physics recently started at Lafayette College is<br />\nunder the supervision of Mr. Henry J. Lucke, instructor in mathematics. Mr.<br />\nLucke is a graduate of Johns Hopkins, 1898, and did several years' graduate<br />\nwork here under the late Dr. Rowland.<br />\nEach member of the Hopkins faculty has been requested to provide himself with a gown, to be worn on all academic occasions.<br />\nDr. Bright, director of the English department, was chosen president of<br />\nthe Modern Language Association at its meeting in Boston during the holidays.<br />\nAssociated with the Junior class in the English course is Mr. H. G.<br />\nGeibels, a graduate from the University of the South, at Sewanee, Tenn. The<br />\nSouthern University is situated in the mountains of Tennessee, and the climate<br />\nis delightfully cool throughout the summer and intensely cold in winter.<br />\nAccordidgly, vacation is held during the winter months, and the regular university work is continued throughout the summer. Mr. Geibels is utilizing his<br />\nwinter vacation in pursuing a course in English and German at the Hopkins.<br />\nWith him is Mr. H. W. Jervey, who expects to become one of the faculty of<br />\nthe University of the South next year. He is taking up graduate work at the<br />\nJohn Hopkins.<br />\nTHE MAN WITH THE CONDITIONS.<br />\nBowed by the weight of conditions hard, he leans<br />\nAgainst a post and gazes at the Post Office,<br />\nThe emptiness of prep, school in his face<br />\nAnd on his back the weight of Christmas \"crams.\"<br />\nHis brain, like a machine, with knowledge filled<br />\nStolid and stunned, a brother to the cash register.<br />\nWho loosened and let down his smirking jaw?<br />\nWhose was the hand that furrowed up this brow?<br />\nthis the thing that Mr. Thomas Ball bath done<br />\nWith a few strokes of his mad, magic pen.<br />\nDown all the hot turnpike to the Rathskeller<br />\nThere is no note more terrible than this;<br />\nMore tongued with censure of the Freshman's work,<br />\nMore filled with signs that tell us he hath failed,<br />\nMore fraught with terror to the luckless wretch.<br />\n<br />\nIs<br />\n<br />\nWhat gulfs between him and matriculation!<br />\nSlave of the wheel of labor, what to him<br />\nAre Mack and all athletic youths 80 bold?<br />\nWhat the long reaches of the peaks of song<br />\nOn which the glee club strands, an Ark on Ararat?<br />\n0 masters, teachers; tutors in all lands<br />\nHow will the future reckon with this child?<br />\nHow answer his sad question in that hour<br />\nWhen in despair to prep. school he returns?<br />\nHow will it be with colleges and with schools<br />\nWhen he shall rise in power and ask the cause<br />\nH. K. T. '03.<br />\nOf his dismissal from the University.<br />\n<br />\n\fROBERT E. SPEER.<br />\n<br />\n\f\fTHE NEWS-LETTER.<br />\n<br />\n11<br />\n<br />\nDR. GILMAN'S LECTURE.<br />\nN last Saturday Dr. Gilman began his series of lectures on University<br />\nEducation with a talk on \"Washington's Idea of a National University: How It has been Hindered and Fostered.\" Donovan room was so<br />\ncrowded that a few minutes before 9.30 the doors were closed on a still pressing<br />\nthrong. ,Dr. Gilman began in his characteristic way with a statement to the<br />\neffect that he \"would like to talk about Comparative Biography, but the idea of<br />\na National University has come forward so prominently that he feels called<br />\nupon to speak of it instead.\" After mentioning the interest Washington, Jefferson and others of the founders of the country manifested in the establishment<br />\nof a National University,and the measures taken to establish one at the Federal<br />\nCity, Dr. Gilman sketched the development of the idea to the present day. In<br />\nreference to the \"Carnegie Institute,\" in the incorporation of which Dr. Gilman<br />\nplayed so prominent a part, he said that it would be an institute for the advancement of knowledge, a place for undergraduate and graduate, American and foreigner, to develop knowledge along his own line of research. Imposing buildings are not in the idea of the proposed institute; but every means to advance<br />\nknowledge will be developed and put at the hand of knowledge-seeker.<br />\n<br />\nO<br />\n<br />\nY. M. C. A. NOTES.<br />\nN Sunday, January 26, Mr. Robert E. Speer, of New York, will<br />\naddress a mass meeting of students in Levering Hall, at 4.30 P. M. Mr.<br />\nSpeer was graduated from Princeton in 1899 and also holds A. M. degree<br />\nfrom Yale. He was one of the three original founders of the Student Volunteer<br />\nMovement, and has travelled widely in the Far East. Since 1891 he has served<br />\nas Secretary of the Presbyterian Board of Foreign Missions. His principal<br />\nbooks are \"The Man Christ Jesus,\" \"The Man Paul,\" and \"Missions and<br />\nPolitics in Asia.\"<br />\nAs a speaker, Mr. Speer has had great power and usefulness k the Northfield Student Conferences. He is one of the most useful and eloquent young<br />\nmen of to-day, and it is hoped that Hopkins students will avail themselves of<br />\nthis opportunity to hear him. It is regretted that an unavoidable occurrence<br />\nnecessitated the postponement of the talk from January 19, as announced on<br />\nthe cards sent out by the Association.<br />\n<br />\nO<br />\n<br />\nThe second Sunday in February has, in accordance with the custom for<br />\nseveral years, been appointed as the Universal Day of Prayer for students, to be<br />\nobserved by the Christian Students' Associations in all countries. The arrangements for this Association will be announced later.<br />\nThe regular monthly meeting of the Executive Council will be held Thursday, January 16th, at 5 P. M.<br />\nThe 30th annual Inter-State Convention of the Young Men's Christian Associations of Maryland, Delaware, West Virginia, and the District of Columbia,<br />\nwill be held at Wheeling, W. Va., February 20-23.<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nINTERCOLLEGIATE ASSOCIATION.<br />\nSPECIAL meeting of Maryland Intercollegiate Association was held last<br />\nSaturday morning at the office of the president, Mr. James A. Fechtig,<br />\n16 East Lexington Street. The Association is composed of Johns Hop•<br />\nkins, St. John's, and Western Maryland, representatives from each of these<br />\ninstitutions being present.<br />\nA protest was registered against the Hopkins, on account of their playing<br />\ngraduates on their various athletic teams. Discussion was rife, but it was<br />\nfinally determined to postpone all action until next Saturday when another<br />\nmeeting will be held at the same place. The treasurer reported that the finances<br />\nof the league were in a flourishing condition.<br />\nThe banners and prizes for winning the various championships of the<br />\nLeague were voted to the Hopkins as follows:<br />\nChampionship banners for base ball, foot ball, and track and field teams.<br />\nCup for winners of the Intercollegiate relay race.<br />\nMedals for winners of the Intercollegiate Tennis Tournament.<br />\nThe delegates present were:<br />\nJ. H. U.—Wm. M. Mackdermott, Ronald T. Abercrombie and W. E. Hoffman.<br />\nSt. John's—Prof. James W. Cain, James A. Fechtig, Jr., and G. W.<br />\nBleeker.<br />\nWestern Maryland—Charles H. Holton, H. J. Robinson and E. C. Gilligan.<br />\nJames A. Fechtig, Jr., president, was in the chair.<br />\n<br />\n4<br />\n<br />\nJOINT INTERSCHOLASTIC MEET.<br />\nR. HORACE S. WHITMAN, A. B. Hopkins, 1901, \"charge d' affaires''<br />\nat Marston's, and Prof. Wm. .Mackdermott, director of Physical<br />\nTraining at the Hopkins and at the Boys' Latin School, are arranging<br />\nto hold an interscholastic indoor meet in the Armory sometime in March. This<br />\nwill be the first event ever held under the joint auspices of Boy's Latin School<br />\nand Marston's, and all the \"prep.\" schools in this section of the country, including New York, Philadelphia, and Washington will he invited to send entries. The events will be open only to schools.<br />\nThe efforts of Messrs. Whitman and Mackdermott to establish a closer relation and more harmonious action between the two schools are bearing good<br />\n<br />\ngt<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nfruit; and, in spite of the intense rivalry which formerly existed between these<br />\nschools, the utmost good feeling now prevails and promises to last.<br />\nThe scheme should be encouraged in every way, as it will he the direct<br />\nmeans of bringing out large numbers of boys from the various schools, many of<br />\nwhom will in a few years run or jump under the Black and Blue.<br />\nIt is not hard to calculate what the development of athletics in the prep.<br />\nschools in Baltimore means to the success of athletics at Hopkins. Formerly<br />\nthe hardest problem in our athletics was the training of men entirely \"green,\"<br />\nbut for the last two years, since stock in prep. school sport has risen, there have<br />\nalways been a few fast men coming here from the schools.<br />\nTRACK AND FIELD.<br />\nOW that the second term is well under way the Track and Field team has<br />\nmade its debut in the cage. Preliminary training under the direction of<br />\nMr. Mackdermott and Capt. Hoffman was begun last Monday, to be<br />\nfollowed by active training next Monday.<br />\nAn unusually large number of candidates has appeared thus far, and some<br />\ngood material for the coming events has been noted.<br />\nAmong those who have shown up especially well are:<br />\nBranham, Emig, Kohn, Bennett, Barrett, Nelson, Smith, Lecron, Porter,<br />\nWilliams and Rosenfeldt.<br />\nA preliminary set of games will be held in the cage two weeks hence, at<br />\nwhich the most promising material will be selected for the coming events in<br />\nwhich glory is to be won. Besides these, it is proposed to hold a series of indoor events in the cage, in which all who are interested in track and field sports<br />\nmay participate. Prizes will be given for first, second, third, and fourth places<br />\nin each separate event, besides which a larger prize will be offered to the one<br />\nmaking the best showing in the entire series.<br />\nTrack and Field work is hardly as interesting in the preliminary training as<br />\nlacrosse practice and that of other teams, so it is to be hoped that the large<br />\nbunch of runners who have come out up to date will keep their nerve and continue their hard and steady practice. It is only such practice that is productive of the best results. If the men work conscientiously enough there is no<br />\nreason why we should not keep up the standard of former years, and add as<br />\nmany banners to our trophy room as heretofore.<br />\n<br />\nal<br />\n<br />\nTHE ANNUAL FEED.<br />\nRIDAY evening, January 31, has been set as the date for the University<br />\nathletic feed this year. The usual interesting program, with various improvements, is now being arranged, This is an occasion on which the<br />\nwhole undergraduate body turns out, as it is the only general informal meeting<br />\nheld during the session. Special efforts are to be made to have a large alumni<br />\nattendance also, and everal members of the Faculty will be asked to attend.<br />\nEverybody remember the date, January 31, and hold it in reserve.<br />\n<br />\n5<br />\n<br />\n\f11<br />\n<br />\nTHE NEWS—LETTER.<br />\nNEW YEAR'S DAY.<br />\n9.30<br />\n<br />\nA. M.<br />\n<br />\nSays I to me:<br />\n'Now hully gee<br />\nMan<br />\nYou jest simply got ter quit!<br />\n'Taint no joke! !<br />\nBy Gull I mean it !!<br />\nYers New Years day, finer time<br />\n..4int come yit<br />\nFer yer vows sublime!<br />\nI tell yer<br />\nMister me<br />\nAn' it<br />\nIs quit!!!!'<br />\n<br />\nNEW YEAR'S DAY.<br />\n1.30<br />\n<br />\nP.M.<br />\n<br />\nShays Ish to meesh:<br />\n'Now hully geesh<br />\nMansh<br />\nAfter thish yer simplish quit!<br />\n'Taintsht no jokesh !!<br />\nBy damnsh I meansh it !!<br />\nYersh Newsh Yearsh daysh, finer Stein,<br />\nAiut bin yit<br />\nFer yer wowsh shublime<br />\nI tellsh yer<br />\nMishter me<br />\nAn' it<br />\nT'mor's---quit !!!!'<br />\n<br />\nA TALK WITH WALTER.<br />\n44at0, SIR, I wont, sir; not too short, sir. Do you want it cut higher over<br />\nthe ear, sir? No, sir; that's right, sir.<br />\n\"Lacrosse, sir? You must be a stranger around here, sir? Even<br />\nthe freshmen knows about lacrosse, sir; or at least he thinks he does. It's<br />\ncalled lacrosse because it is a cross between tennis and hockey; and the language spoken is usually a cross between what one gentleman calls Balzac at<br />\nhis best and Chaucer at his worst. But he says that is only when a man gets<br />\nhit with the ball.<br />\n\"Me, sir? no, sir, I've never played it; I've too much sense, sir. But<br />\nthere are them that seem to like it. Why don't you know that there are just<br />\nlots of young gentlemen, nice boys, not toughs, who fail to pass in their studies, sir, just because they don't want to fail in passing a lacrosse ball. They<br />\ndon't mind being late to class a bit, sir. Just ask Mr. Greene, not the one at<br />\nthe post office, but the other one. Dr. Greene? That's it, sir, Dr. Greene. He<br />\nknows, sir.<br />\n<br />\n\fP.9Ir<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\n15<br />\n<br />\n\"The first thing, sir? Well they have a meeting in the trophy room, and<br />\nCaptain Schmeisser explains the game to the freshmen in words of one syllable.<br />\nAnd then Mr. Mackdermott talks. You'd think that he was talking in words<br />\nof eight syllables, but he aint, sir. It just sounds that way because he talks in<br />\nbunches.<br />\n\"Am I getting it too short, sir? No indeed, I'll make it even. What<br />\nnext? They go into the cage and the old men show off so that the freshmen<br />\nwill he awed. It takes a lacrosse man to handle a freshman. All the Hopkins<br />\narrogance and pride for years seems to crop out in the lacrosse men; if they are<br />\nnot the whole show they at least think so.<br />\n\"If you can hit someone else without getting hit yourself that counts you<br />\none.<br />\n\"Then the young ladies, sir. They come down to see how the game is<br />\nplayed. 'What a pretty game?' she says. 'Yes, it's so open,' he says. 'Open<br />\nto improvement?' she says. `No,' says he disgusted like, 'open to the view.'<br />\n'Especially the costumes,' says she. 'Let's discuss Ibsen,' he says, and they<br />\ngo out. It's a glorious game, but you: have to be iniated.<br />\n\"If you'd buy one of my tickets, I would do you good, sir. Thank you<br />\nsir.<br />\n<br />\nT. '03.<br />\n<br />\nCall again, sir.''<br />\n<br />\nAMONG THE COLLEGES.<br />\nThere are five hundred women students at the University of Berlin. In<br />\nAmong the five hundred are two daughstate.<br />\nof<br />\nministers<br />\nof<br />\nters<br />\nIf a Russian girl wishes to study at any of the universities which now<br />\nadmit women, etiquette does not allow her to do so until she is married; so she<br />\ngoes through the civil ceremony of marriage with a man student whom, very<br />\nprobably, she has never seen before; and this marriage is quite legal though<br />\nthey may never speak to each other again. At the end of the college course,<br />\nthe bond is considered as dissolved.<br />\n1896-1897 there were only ninety-six.<br />\n<br />\nMany of our colleges show a revival of interest in debating societies.<br />\nAmherst has appointed a committee to confer with a committee of the Faculty<br />\nas to which college shall be challenged for an intercollegiate debate. Oberlin<br />\nbelongs to a debating league which numbers nearly all the colleges of the Middle West. Dartmouth has formed a new debating union. All students save<br />\nFreshmen are eligible. Massachusetts Institute of Technology is making the<br />\nbeginnings of a debating society.<br />\nClark University is to have a collegiate department. Its object is to fit<br />\ngraduates of high schools and others for the ordinary pursuits of practical life.<br />\nA three-year course, and a small fee, will be the features; and representatives<br />\nare to be sent to observe the conditions at Hopkins.<br />\nGeorgetown and Lehigh have exhibited a novel form of entertainment in a<br />\ncombined concert, given by the Mandolin and Glee Clubs of the two colleges.<br />\nThe first half of the evening was given to Lehigh; the second to Georgetown.<br />\nThis is a valuable suggestion for the Bryn Mawr trip of our Musical Clubs.<br />\n<br />\n\f16<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE VALUE OF CORRECT 1EADING AND HOW TO DO IT.<br />\nThe only correct paper submitted at the Christmas examination in Public Speaking.<br />\n<br />\nEADING aloud is a graceful accomplishment possessed by comparatively<br />\nfew. Too often the home reading is Fpoiled by a dreary monotone that<br />\nthe reader does not strive to overcome. If the patient listeners would<br />\nonly strive to overcome the possesser of the dreary monotone the fault might,<br />\nin time, be remedied. How much brighter would home become if we took care<br />\nto read correctly! Even papa would take a livelier interest in the reading of<br />\nthe stockmarket reports if only his silvery-tongued daughter would read the<br />\nrecords to him. In time a great improvement and growth would be seen in the<br />\nfamily (not in size hut in interest.) Little Johnnie would no longer take<br />\npleasure in reading about Diamond Dick in the woodshed; coming under the<br />\nbenign influence of the home reading circle he would gradually be elevated until he could read with pleasure, if not with profit, the Fables of George Ade, and<br />\nthe war poems of Rudyard Kipling.<br />\nDIRECTIONS: Grab the book, paper, or pamphlet, in the left hand, hold it<br />\nto the side, slightly below the face, and about eighteen inches from the head.<br />\nCast your eyes often upon the audience, but more often upon your book. Read<br />\nnaturally. By naturally I do not mean that the elocutionary tyro should shout<br />\nHamlet's Address to the Players, nor declaim in funeral tones the Charge of<br />\nthe Light Brigade. The neophyte in the realms of oratorical art should strive<br />\nto acquire a becoming elocution through carefully, painstakingly, laboriously<br />\nreading Dr. Lee's Principles of Public Speaking; price $1.39 at all drug stores.<br />\n<br />\ng<br />\n<br />\nPoetry and Prose from the Cornell Widow.<br />\nI.<br />\n<br />\n\"0 Mary Ann, come row with me<br />\nUpon the silent bay,<br />\nWhere dancing moonbeams here and there<br />\nDisport themselves at play.\"<br />\nH.<br />\n\"Oh. sir,\" said simple Mary Ann,<br />\n\"I hardly think I ought'r,<br />\nFor I'm afraid we'd seem to cast<br />\nReflections on the water.\"<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n17<br />\n<br />\nThere was a young lady from Sayre,<br />\nWho went out for a regular tayre,<br />\nShe came home at one<br />\nWith a horrible bun,<br />\nWhich was more than her parents could bayre.<br />\n<br />\nSUNDAY SCHOOL TEACHER—\"Willie, were you ever baptised?\"<br />\nWILLIE—\"Sure. Tree times.\"<br />\nSUNDAY SCHOOL TEACHER—\"Three times! Willie!\"<br />\nWILLIE—\"Sure. I kin show you de scars on me arm.\"<br />\n'05. \"I read that the English students of the University of Pennsylvania<br />\nhad formed a literary society.'<br />\n'04. \"What's their yell?'<br />\n'05. \"Pen-Pencil-Pencilvania!!!<br />\n'Then on the other hand,\" said the orator, as he changed his cuff from one<br />\nwrist to the other.<br />\nLi Hung Chang, a well known resident of China, is dead.—Regina<br />\nIs it possible?<br />\n<br />\nStandard.<br />\n<br />\nGRACE—A strange man spoke to me in the car to-day.<br />\nETHEL—Indeed! What did he say?<br />\nGRACE—Fare, please.—Harvard Lantfioon.<br />\nThen 'tis oh to be a poet,<br />\nTo feel, and sigh, and sing.<br />\nAnd to read your own great verses<br />\nIn the magazines in Spring.—Coilege Mercury,<br />\n\"Ha, I will fool the bloodhounds yet,\" cried the fugitive, hoarsely, and<br />\nslipping on a pair of rubbers, he erased his tracks.— Yale Record.<br />\n<br />\nPROFESSOR—Derive the word virgin.<br />\nSTUDENT— Vir, a man,.4'in, a trap, virgin, a man-trap.—Vox Wesleyana.<br />\n<br />\nIS THIS ANOTHER UNBASED RUMOR?<br />\nANNAPOLIS, Mn., Jan. 13.—It is rumored here tonight, and there appears<br />\nto be some foundation for the rumor, that Andrew Carnegie is coming to the<br />\nrescue of the Johns Hopkins University. It is said that Dr. Daniel C. Gilman,<br />\nwho has been in close consultation with Mr. Carnegie about the $10,000,000<br />\nendowment for the national institute plan, has directed Mr. Carnegie's attention<br />\nto the Johns Hopkins University, and that Mr. Carnegie has been favorably<br />\nimpressed. It is intimated that he will contribute enough to make up the<br />\n$1,000,000 endowment which is necessary before the University can avail itself<br />\nof the offer of the Wyman and Keyser tracts of land on Charles Street avenue.—<br />\nBalthnore Sun.<br />\n<br />\n\fApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br />\n<br />\nNICDi<br />\n<br />\ni..ic<br />\n<br />\ni<br />\n<br />\nNICD<br />\n<br />\nCD rDCD<br />\n<br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br />\n<br />\nCHESAPEAKE RUBBER COMPANY,<br />\nAl.EE<br />\n<br />\nE-71<br />\n<br />\n321 W. Baltimore Street.<br />\n& (5'C.) ,<br />\n<br />\nWEST BALTIMORE LOAN CO. 675 West Baltimore Street,<br />\n<br />\nBetween Arch and Pine Sts. Baltimore, Md.<br />\n<br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\nOPEN<br />\n<br />\nFROM<br />\n<br />\n7<br />\n<br />\nA.<br />\n<br />\nM. TO 6 P. M.<br />\nSIDE ENTRANCE<br />\n<br />\nSATURDAYS<br />\nWITH PRIVATE WAITING 000m.<br />\n<br />\na co.<br />\n<br />\nSMITH, DIXON<br />\n<br />\nPPcrijj c.<br />\n29- 31 S. Charles St.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nPlutures<br />\n<br />\nUNTIL 10<br />\n<br />\nP.<br />\n<br />\nM.<br />\n<br />\nFrA\"mminfl<br />\n<br />\nFRANKE &<br />\nPURNELLCO.<br />\n<br />\nI I Urnillki.<br />\n<br />\n224 N. HOWARD ST.<br />\n<br />\nOren letter<br />\nA. fETTING, fraternitr<br />\njeweArp.<br />\nMANUFACTURER OF<br />\n<br />\n14 AND 16 ST. PAUL STREET,<br />\n<br />\nBALTIMORE, MD.<br />\nPLEASE CALLAND FDA MN( OWE LINE ISEFONF. PUR- NASING.<br />\n<br />\nJ.<br />\n<br />\nH. ROBINSON.<br />\n<br />\nFINE<br />\n<br />\nBonbons, GlioGolates,<br />\n<br />\nOIF<br />\n<br />\n— • FINE • CIGARS. %<br />\n°EULER IT<br />\n<br />\n94,144(1'0, (31(/A RS A NI) MMOKIOHS' Airricr.mm.<br />\n<br />\nSTAIVIONEHY.<br />\n(I20 N. li:T.JTA W ST.<br />\n<br />\nCONFECTIONS.<br />\nFRESH EVERY HOUR.<br />\n<br />\nSENT BY MAIL OR EXPRESS.<br />\n<br />\n14 EAST BALTIMORE STREET.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nBaltimore, Now York & Philadelphia Papers.<br />\nC. & P. Public Telephone, Madison 1185Y.<br />\n<br />\nDesigning and Cutting by<br />\n<br />\nE. Michaelson.<br />\n<br />\nF. MIGHMELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n821<br />\n<br />\nALTERIN0 AND REPAIRINO<br />\n<br />\nrladison Aveinte,<br />\n<br />\nSpecial discount to Students.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nA. D. SMITH & SONS,<br />\n104<br />\n<br />\nREADY TO<br />\n<br />\nFoi merly<br />\nLEV'ERINO & SMITH,<br />\nWEST LEXINGTON STREET.<br />\n<br />\nWEAR HATS fur<br />\n<br />\nLadies, Misses<br />\nand Children.<br />\n<br />\nIn th, 1,(Ltext Dexifinx.<br />\n\\IRK'S HATS liorhys and Sort Pelts.<br />\n<br />\nUNIVERSITY LAFE.<br />\n(ALAS. LEN DENMEYER. Prop.<br />\n<br />\nCHOICF WINES, LIQUORS ANI.) CIGARS,<br />\nRA W 110X NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\n1,101444'1111d (1.+1111(111011's Dining Rooms.<br />\nSPtl'Oii at All Hours.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br />\n<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\ntUedding Silverholiday<br />\nIN GREAT VARIETY.<br />\n<br />\nJACOBI dk JEMKINS,<br />\nate N. CNAINLIIS ST.<br />\n<br />\nsilversmith.<br />\n<br />\nlienderson's<br />\n<br />\nso<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\n16xt Books, Note Books.<br />\nStudent's Supplies.<br />\n<br />\nMadison&HowardSts.<br />\n<br />\nH. MoMAINS, D.0.,<br />\nSoc'y. & Treas.<br />\n<br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. & Asst. Secey.<br />\n<br />\nW.D.BOW EN, M. D., D. 0..<br />\nProst. & Mgr.<br />\n<br />\nJAMES R. PAINS.<br />\n<br />\nTHEO. WARNICR.<br />\n<br />\nR 8c C:O.<br />\n<br />\nW.A..F4Z NI<br />\n<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Casslmere Hats. 6111r<br />\n<br />\nHMG & COMPANY<br />\n<br />\nC<br />\n<br />\nBooksellers and<br />\nP<br />\n<br />\nSYMIOrlerS.<br />\n<br />\n34 W. BALTIMORE ST.<br />\nReese<br />\nSCHOOL, LAIN MSDICAL. CLASSICAL AND MIIICELI.<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman & Son,<br />\n<br />\nH. R. E1SENBRANDT SONS,<br />\n<br />\nto 705<br />\nMADISON AVE.<br />\nof<br />\nsubmitted<br />\nReads as follows: Samples<br />\nFrench Itrantly—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nin,Sherey—no coloring or adulterants, absolutely pure wine.<br />\n\"75 Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive 011—all tests show pure olive oil.<br />\n\"der Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n<br />\nfor<br />\n<br />\nJORININ STIIBLER GO.<br />\n<br />\nrOR ADVERTISING SPACE IN THIS PAPER<br />\n<br />\nAPPLY TO<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br />\n<br />\n201-203 N.CHARLES ST.<br />\n<br />\nBALTIMORE, MD.<br />\nCharles T.Crane,<br />\nPresident.<br />\nCarter G. Osburn,Cashier.<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450.000.<br />\nCapital, $660.000<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nin accordance with<br />\nextended<br />\nFacilities<br />\nsolicited.<br />\nbalances and business responsibility.<br />\nCORRESPONDENCE INVITED<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nOtto II. Williams,<br />\nVice-President.<br />\nI. E. Marshall. Asst, Cashier.<br />\n<br />\nA. SCHUMACHER & CO.,<br />\nGeneral Agents.<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER,<br />\nNAPLES, GENOA. ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br />\n<br />\n\fMANDOLIN. GUITAR AND BANJO<br />\nTAAAAA •V<br />\n<br />\nC. J. LEVIN,<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br />\n<br />\nStudio, 331 N. Gheelea St.<br />\n<br />\nttbe litran3•Smith<br />\nVan° CO.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br />\n<br />\nilsrenfraz &ail°<br />\n<br />\nCbtchering, 13rabburp anb Webster<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br />\n<br />\nBaltimore<br />\n<br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nI Underwear, Hosiery,<br />\nEtc.<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nON SALE THE 1. H. U. PENNANTS,<br />\nand all other College Pennants<br />\n<br />\n203W.BALTIMORE ST. & 2 S. LIBERTY ST.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE de CO.,<br />\nBANKERS di BROKERSStreet<br />\n<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nThe Chas. Elms Surgical Instrument Company<br />\nBeNJ. A. NELSON.OENL<br />\n<br />\nMANAGER<br />\n<br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and A000ssories.<br />\nBaltimore, Md.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nDrovers and Mechanics National Dank,<br />\ni<br />\n<br />\nOF BALTIMORE. MD.<br />\n<br />\nCapital Stock,$300,000.<br />\n<br />\njg Jo !Pianos. Js<br />\n<br />\nSMITH'S soH 2IT&Bgale.GE<br />\nOLD<br />\nBOOK<br />\nSTORE<br />\n805 N HOWARD STREET.<br />\n8rd door from Madison.<br />\n<br />\nBOOKS<br />\n<br />\nYOUR EY1e,S<br />\n<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\n<br />\n111 North Charles Street. (Masonic Temple.)<br />\nKX*MINING OPTiOlArNS.<br />\nTHE<br />\n<br />\nNEWS LETTER<br />\n<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a lull line of Students' Note Books and Stationery<br />\n<br />\nBoth 'Phones.<br />\n<br />\nOLD AND NEW<br />\n<br />\nWM. V.PIPPEN.<br />\nJ. Wm. Middendorf,<br />\nA..!. Robbins.<br />\n<br />\n6o5 N. Eutaw Street.<br />\nA. H. Rutherfoord.<br />\nF. Lents.<br />\n<br />\nJ. WM, MIDDENDORF & CO.<br />\n16anitere &16rohers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br />\n<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n1444=s. .20S<br />\n<br />\nCL.skalExt-loc..<br />\n<br />\nV. M. C. A. SUILDING,<br />\n<br />\nC. & P. and Md.'Phones.<br />\n<br />\nCALL ON<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nIt DOWNS,<br />\nj8.8.<br />\n229 N. Gharles St.,<br />\n<br />\nTHINK IT OVER.<br />\n<br />\nSAYRE OPTICAL COMPANY,<br />\n<br />\n•<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br />\n<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\nFactory Prices.<br />\n<br />\n0.& P.'Phone 2322-2.<br />\n<br />\n•••••.• yam•La.<br />\nFOR Class, Fraternity and College fitationerY.<br />\nBanquet Canis, invitations, Diploma!\".<br />\nPrograms, Visiting Cards, etc. ..... •<br />\n<br />\nOur 60e J. 11. U. Blue and Black Play Paper—now ready.<br />\n-There Is very little entertainment at home without. Timm<br />\n<br />\nT<br />\n!EF<br />\n5pTANos,,<br />\n<br />\nAre The Best.<br />\n<br />\n9 N. LlbertU St.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VI. No. 7<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\nnotixiMoRg. MD.<br />\nL<br />\nTWeatg-tileth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\n.<br />\n.<br />\nDean of the College,<br /><br />\nIRA REMSEN.<br />\nWbf. H. HOWELL.<br />\nEDW. II. GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\n100,000 volumes.<br />\n136,000 volumes.<br />\n200.000 volumes.<br /><br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nGeology and Mineralogy,<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nIra Be,msen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clan h.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nIri/liam Oster.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitie,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,:<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\nKirby F.Smith.<br />\nMaurice Blotmtfield<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.freight.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume XXIY<br />\nIn progress. $5 per volume.<br />\nII. American Chemical Journal.<br />\nI. REMSEN,Editor. Monthly. 8vo. Volume XXVI<br />\nIn progress. $6 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo.<br />\nVolume XXII in progress. $3 per volume.<br />\nIV. Studies from the Biological Laboratory. Five.<br />\nVolume V complete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nMonthly. 8vo. Series XIX in progress. $3 per<br />\nvolume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4th. Vol. XX in progress. $1 per year.<br />\nVII. John Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume X<br />\nin progress. $6 per volume.<br />\nIX. Contributions to Assyriology and Comparative<br />\nSemitic Philology,(Beitrage zur Assyriologie,etc.)<br />\nVol. IV in progress.<br />\nI. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume TV complete. $7.50<br />\nper volume.<br />\nXI. Modern Language*Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. Ito. Volurae<br />\nXVI in progress. $1.60 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bt-monthly. 8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nXIII. American Journal of Insanity.<br />\nHENRY M. HURD,Editor. Quarterly. 41:o., giS Per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWI LLIAM B. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. HAUER, Editor. Quarterly.<br />\n8vo. Volume VI in progress. $2.60 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the university<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of °Moors and students, and stating<br />\nthe regulations, etc., of the University. Publiabed at the close of the academic year.<br /><br />\nGroups.<br />\nI. Classical(the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.)<br />\n3. Chemical-Biological.<br />\n(leading up to Medicine.)<br />\n4. Geological-Thologthal.<br />\n5. Latin Mathematical.<br />\n41.<br />\n(loading up to Law.)<br />\n7. Modern Languages.<br />\nEditors.<br />\nSerial Publications.<br />\nFrank Morley.<br />\nMathematics(vol. X XIV.)<br />\nIra Berneen.<br />\nChemistry (vol. XXVI).<br />\nBasil L. Gildersleeve.<br />\nPhilology (vol. XXII.)<br />\nJ. M. Vincent.<br />\nHistory vol. XIX.)<br />\nModern Languages(vol. XVI.) A. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nASgyriology (vol. IV.)<br />\nExperimental Medicine(vol. VI.) W.H. Welch.<br /><br />\nProgrammes of the Courses offered to graduate students in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photograph of the Normal Solar Spectruni•<br />\n10 plates. $20.00<br />\nDescription of the Johns Hopkins Hospital. J. S. Billings, Editor. 118 pp. 4to. 68 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fao-simile cditiori. Edited by J. Bendel Harris. 110 pp. 4to.<br />\nplates. $5.00<br />\nReproduction in Phototype of Syriac MRS. with Antilegomena.Epistles. Edited by I. H. Hall. MOO.<br />\nBibliographia Hopkinsionsis. Part I. Philology. Part<br />\n!<br />\ne<br />\nChemistry, Mineralogy and Geology. P\"'—<br />\nIV-V-VI.Physios, Astronomy and Mathematics8 vo. 30 cents per part.<br />\nA full list of pliblleatIons will be sent on applicationl<br />\nCommunications In respect to exchanges and rsmittancs<br />\nmau be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nJANUARY 15, 1902.<br /><br />\nNo, 7.<br /><br />\nJOHNS HOPKINS MEN IN THE WEST.<br />\nLAWRENCE, KANSAS, JANUARY 2nd, 1902.<br />\nTo the Aditor of\"THE NEWS-LETTER\":—<br />\naccordance with your request to write a few lines concerning the influence of Hopkins men in the West, I have the pleasure to respond as follows,<br />\nconcerning a territory which might be called the Southwest in distinction from<br />\nthe northern tier of western states. This would include Iowa, Nebraska, Missouri, Kansas, Arkansas, Texas, and Oklahoma.<br />\nTo my knowledge there are over seventy alumni and ex-students of the<br />\nJohns Hopkins University within this territory engaged in professional work.<br />\nOf these I find seven in the University of Kansas, eight in the University of<br />\nMissouri, five in the University of Arkansas, three in the University of Iowa,<br />\nand seven in the University of Nebraska. The remainder are scattered in the<br />\nvarious universities and colleges of the Southwest.<br />\nI need not say to you that this large body of men, going forth well equipped with Johns Hopkins instruction and methods, and moreover partaking of<br />\nthe Johns Hopkins spirit of making the truth subservient to the good of<br />\nhumanity, has great influence on the educational work in their respective<br />\ninstitutions.<br />\nCompared with Eastern institutions of greater age or more wealthy foundations the Western institutions are lacking in equipment. Also, notwithstanding<br />\nthe progressive spirit of the West, there is always a lack in the organized support of higher culture and learning. In the making of the West, so-called<br />\npractical ideas predominate, and there is a tendency to make education immediately serviceable to material prosperity; and hence, the educational spirit<br />\nWhich surrounds the Western institution varies somewhat from that surrounding an Eastern institution where culture has been the predominant feature.<br />\nThe Johns Hopkins men have found it necessary to adapt themselves to<br />\ncircumstances, and while they love the truth for the truth's sake, their greater<br />\nwork has been the adaptation of this truth to the uplifting of humanity and the<br />\neducation of the people in right thinking. Perhaps every university man is, in<br />\none sense, a missionary of the truth, and this seems more apparent in the West<br />\nthan in the East. The University man in the West is supposed to know almost<br />\neverything, and is called upon to lecture on all sorts of subjects pertaining to<br />\nthe political, social, economic, or scientific life of the people. Under such cirIn<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\ncumstances special investigation and profound research are difficult, and, in<br />\nmost cases, I may say, impossible. Libraries are small; the hours of school<br />\nservice in the university are long; the requirements for outside lectures are<br />\ngreat, so that while a Western professor may be able to do some fairly good<br />\nwork in his attempt to add to the \"sum of human knowledge,\" his chief work<br />\nis that of instructor both within and without the university.<br />\nThe great West is absorbing. In the attempt to develop its resources millions of capital are taken up, much of it never to be returned. It is so in educational affairs. The university and the community demand the professor's<br />\ntime, his ideas, indeed, his whole life. They take all he has to give just as a<br />\nsponge takes water, except that they never reach a point of saturation. I have<br />\nthis therefore to say of the Johns Hopkins men in the West, that, while probably few of them will put on record any great literary or scientific achievements,<br />\ntheir services will be best noted in the general improvement of the communitks<br />\nin which they live and the advancement of the educational institution to which<br />\nthey are attached.<br />\nUnder such circumstances it would be impossible to make any definite<br />\nestimate of their services in the cause of education or their influences upon<br />\nhumanity, for much that they do will be shown in the higher educational ideals<br />\nand a better social and political life of the community, to be revealed more<br />\nespecially in the future than in the present, a general good which is traced to<br />\nno one in particular.<br />\nAs it is, the professor in wealthy Eastern institutions, called upon for a<br />\nfew lectures each week, surrounded by magnificent libraries and finely equipped<br />\nlaboratories, with comfortable salaries, in close touch with learned societies and<br />\neasy access of European learning, may establish lines of culture, write learned<br />\nbooks giving forth new discoveries; but the Western professor must be content<br />\nto serve his community though it absorbs his very life, counting it fortunate to<br />\nread the results of the research of his more favored brethren in the East, and<br />\nconscious that his services are exhibited in the youth he h As helped forward and<br />\nthe community he has served.<br /><br />\nFRANK W. BLACKMAR,<br />\nEx-President Johns Hopkins Club of the Middle West.<br /><br />\nTHE QUARTER-CENTENNIAL CELEBRATION.<br />\nORK is being actively pushed for the two days exercises on February 2122, which are to commemorate the twenty-fifth anniversary of the opening of work at the Hopkins, and which will also formally inaugurate<br />\nPresident Remsen. Dr, Gilman, President Emeritus of the University, will have<br />\ncharge on the first day, and will deliver an address, to be followed by responses<br />\nfrom visiting delegates. On the second day, President Remsen will be inaugurated, and will take charge of the ceremonies, which are to include the conferring of honorary degrees. This is quite a departure from the traditional policy<br /><br />\nv<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\nof the University. On one other occasion only—in 1879—have honorary Hopkins degrees been conferred.<br />\nThe general committee of arrangements is as follows: Former President<br />\nD. C. Gilman, chairman; President Ira Remsen; Professor Gildersleeve, of the<br />\nGreek department; Professor Osler, of the department of medicine; Professor<br />\nWelch, of the department of pathology; professor Elliott, of the department of<br />\nRomance Languages; Professor Clark, of the department of geology; Professor<br />\nHaupt, of the department of Oriental languages; Dean Griffin, head of the department of philosophy; and Professor Ames, of the department of physics.<br />\nFor the purpose of expediting the work, this general committee is organized<br />\ninto sub-committees, as follows: Executive Committee, President Remsen,<br />\nchairman, Dr. Ames, Dr. Griffin; Music Committee, Dr. Haupt, chairman, Dr.<br />\nGilman, Dr. Remsen, ex officio; Committee of Arrangements, Dr. Clark, chairman, Dr. Elliott, Dr. Remsen, ex officio. This last committee is to arrange all<br />\ndetails relating to guests, delegates, program, etc. The Executive Committee<br />\nis very busy getting out the invitations, which will be issued this week, to<br />\nprominent men in the city and country at large.<br />\nIt is felt that this occasion will mark an epoch and a change in the history<br />\nof the University, and the ceremonies promise to be most noteworthy and impressive.<br />\nTHE CENTURY ESSAY.<br />\nT is very gratifying to every one connected with the University to know that<br />\nthe prize essay in the Century's competition for college graduates of 1900<br />\nhas been won by Mr. James Edward Routh, who took his bachelor's<br />\nof<br />\ndegree here year before last. The essay is published in the January number<br />\nLita<br />\nas<br />\n\"Huxley<br />\nof<br />\nestimate<br />\ncomprehensive<br />\nthe Century, and is an able and<br />\nerary Man.\" The press and the various weeklies have given very flattering<br />\nnotices of Mr. Routh's article, and the \"Review of Reviews,\" respecting the<br />\nessay, says: \"Mr. Routh makes the point that Huxley's great significance was<br />\nnot in the propounding of new doctrines, nor in the popularizing of science, but<br />\nin the power which enabled him to construct workable theories of life and ethics<br />\nout of loose truths.\"<br />\nIt is in just this way that graduates can best show their love for Hopkins,<br />\nand the only way in which they can actually serve her—by doing something<br />\nthat will attract the notice of the public and bring the University before the<br />\ncountry at large. The result of a number of successes like this Mr. Routh has<br />\nachieved, which tend to wake people up to the fact that Hopkins is a live institution, and that things worth while are being done there, is incalculable.<br /><br />\n5<br /><br />\nOHN ERSKINE, Columbia, has won the Century Magazine prize for the<br />\nbest poem offered by a college graduate of the year 1900. His poem is<br />\nan idyl, entitled \"Acteon.\"<br /><br />\n3<br /><br />\nTHE NEWS—LETTER.<br />\nTHE CHRISTMAS TRIP OF THE MUSICAL CLUBS.<br />\nN the dawn of December 26, the members of the Musical Clubs, rubbing<br />\ntheir eyes and joking about being up so early in the morning, left Camden<br />\nStation on a special car for West Virginia. Their first concert was given<br />\nthat night at Charlestown. While the whole programme was well appreciated,<br />\nthe banjo solo by V. B. Smith, and \"Dixie\" by the Glee Club, were most<br />\nloudly applauded. After the concert, the men were invited to several small entertainments given to them by some of the residents of the town.<br />\nWhen the clubs were on the point of leaving Charlestown the next morning,<br />\na great excitement arose. \"Where is Ham, Jr.?\" Sure enough the club's<br />\nmascot had suddenly disappeared. After considerable searching, he was found,<br />\nwith his mouth wide open with astonishment, gazing at the \"funny\" eggshaped heads of the local \"crowd.\"<br />\nThe second concert was at Winchester, which has always been noted for<br />\nthe kind reception that she gives Hopkins boys. This year, an audience, even<br />\nlarger than that of last year, turned out to hear them in the theatre of the new<br />\ntown hall, built by Charles Broadway Rouss. If the success of the concert could<br />\nbe measured by the applause, it was immense. The dance given to the club<br />\nafter the concert by the youth and beauty of Winchester was greatly enjoyed.<br />\nThe next morning the men hired vehicles, and took their lady friends out driving. But, alas, 2.10 came too soon, and the hard-hearted manager hurried them<br />\noff to Hagerstown. Many and touching were the good-byes on leaving Winchester, and the men all declared that it was the place where they wanted to go<br />\nwhen they died.<br />\n.<br />\nThis year, the clubs went from Winchester to Hagerstown by a different<br />\nand more rapid route, over the Cumberland Valley Railroad, through the beautiful Shenandoah Valley. At Hagerstown, the audience was small. Although<br />\nthis was on account of the rain, it is probable that the clubs will not return<br />\nthere for several years. After the concert, the last dance was given to the<br />\nclub; it was well arranged and very enjoyable.<br />\nThe programmes for all the concerts were creditably rendered. The Banjo<br />\nClub was undoubtedly the best. Its pieces, though few, were well chosen and<br />\nwell played. The Glee Club was a close second, though not because it had a<br />\nlarge number of pieces. The Mandolin Club did not seem to be up to the high<br />\nstandard of last year.<br />\nWhile the trip this year was greatly enjoyed it differed materially from<br />\nformer ones. Of the various \"clubs\" that sprung up and added to the general<br />\nenjoyment, the \"Goonay\" was the only survivor of last year. Then, too, the<br />\nmysterious flitting around of Andrew Reid Bird was greatly missed, although<br />\nhis place, as manager, was admirably filled by Robinson Cator Pagon,'03.<br />\nJ. C. H. '03.<br /><br />\n3<br /><br />\nThe Yale Glee and Banjo Clubs report for the last year total receipts of<br />\n$19,985.13, $16,933.53 of which were from concerts.<br /><br />\n5<br /><br />\nTHE NEWS—LETTER.<br />\nTHE CONDITION OF THE CLUBS.<br /><br />\nORTY-ODD candidates for the musical clubs would seem to indicate no<br />\nlack of material, when it is remembered that not more than twenty-five<br />\nmen can be taken on the long trips, and yet there are places, waiting for<br />\ngood men, that it seems hard to fill, notably first tenors on the Glee Club, and<br />\nwind, wood, or brass, on the Mandolin Club, where a clarionet or horn would<br />\nhelp immensely. There is no need to urge the benefits to the University, in the<br />\nway of advertising, that come from musical clubs of a high standard and creditable performances. It is even less necessary to speak of the good times enjoyed by all the members on the excursions. An attractive program is pre<br />\nsented this year. Arrangements are being made for probable trips to Washington, Annapolis, and Bryn Mawr, while the Old Point schedule for Easter has<br />\nbeen completed.<br />\nThe clubs are to leave on the 28th of March, spend the 29th and 30th at<br />\nOld Point, and proceed on the 30th to Richmond, where a concert is being arranged by President A. R. Bird, '01. At Old Point the men will take meals at<br />\nthe Chamberlain, a concession not before granted, and there the principal concert and dance will be given.<br />\nInnocent Freshmen! Sober Grads! here is a chance for such of you as<br />\nPossess tuneful talent, developed on potential, to enjoy your college life, and<br />\nhave your musical performances a benefit, not only to yourselves, but to the<br />\nUniversity.<br /><br />\n5<br /><br />\nA DIFFERENCE OF DEGREE.<br />\nOn pleasure bent—<br />\nThe dainty, tinted missives sent,<br />\nThe careless way the days are spent,<br />\nThe stacks of sheckels lost or lent,<br />\nThe heedlessness of next month's rent,<br />\n0, happy hours of sweet content!—<br />\nOn pleasure bent.<br />\nOn pleasure broke—<br />\nThe bills that come as thick as smoke,<br />\nThe things that have to go in soak,<br />\nThe friends that always croak and croak,<br />\nThe hardness of misfortune's stroke,<br />\nAhl Well we know it is no joke!<br />\nOn pleasure broke.<br />\nBut broke is not much worse than bent,<br />\nAnd bent is almost broke, you see;<br />\nSo why this fundamental change<br />\nIn a simple difference of degree?<br /><br />\nR. V.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nJANUARY 15, 1902.<br />\nSubscription $1.50 per year.<br />\n.<br />\n.<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\nAssistant News Editors,<br /><br />\n10 Cents a single copy.<br />\n.<br />\nSOL STROUSE, 1902.<br />\n. EBEN C. HILL, 1902.<br />\nROBERT S. LANIER, 1903.<br />\nW. S. BIRD, 1903.<br /><br />\nJOHN A. SLEMONS, 1902.<br />\nLYMAN C. MURPHY, 1902.<br />\nArt Editor,<br />\nCHARLES F. RANFT, 1902.<br />\nBusiness Manager,<br />\nAUBREY PEARRE, JR., 1902.<br />\nAssistant Business Manager,<br />\n. HARRY BAETJER, 1903.<br />\nAddress all articles, communications, etc., to SOL STROUSE, box 557, Johns Hopkins<br />\nUniversity, Baltimore, Md.<br />\nAthletic Editors,<br /><br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br /><br />\nHE leading article in this issue is one, which, because of the broad field it<br />\ncovers, ought to prove of interest not only to Hopkins men, but to the<br />\nwhole educational world. It gives the remarkable record of Hopkins men<br />\nin the educational development of the West, and at the same time a general<br />\nsurvey of the conditions for and against the westward progress of education.<br />\nDr. Frank W. Blackmar is a Johns Hopkins Ph.D., and is at present Professor<br />\nin the University of Kansas. Until recently Dr. Blackmar was President of the<br />\nJohns Hopkins Club of the Middle West. His communication, therefore, has<br />\nthe weight of study at close range.<br /><br />\nt<br /><br />\nINCE the last issue of the NEWS-LETTER a change has taken place on the<br />\nhoard of editors, and a new editor-in chief now assumes the responsibility of the office. Before proceeding farther we desire to congratulate Mr.<br />\nWilliam B. Hill on the successful manner in which he conducted the paper, and<br />\nto give a word of praise to the numerous improvements made during his incumbency as editor in chief. Mr. Hill has filled various positions on the board<br />\nsince his Freshman year, and has always been a faithful worker for the good of<br />\nthe paper. In our opinion the NEWS-LETTER under his regime made more<br />\nstrides toward the position it should hold at Hopkins than at any previous time<br />\nin its career. With such a broad field to cover, and with such limited resources<br />\nat hand, the attempt to edit a successful college paper at Hopkins is no sinecure,<br />\nand requires all the efforts of the editors, supported by the active encourage-<br /><br />\nA<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\nmeat of the student body. Without liberal encouragement the paper can never<br />\nhold its due position. Therefore in order to keep it to its standard we call on<br />\nthe student body and alumni for a continuance and increase of support, by contributions in the form of news items, original articles, poems, or short stories.<br />\n1,14 Juniors and Freshmen who have aspirations along literary lines should<br />\ntry for the position now vacant on the NEWS-LETTER staff. The advantages accruing from Nnws-LItTT4R work do not tend toward one<br />\nall<br />\nparticular sphere of activity, as the training derived will benefit men in<br />\nwho<br />\n,<br />\npursuing<br />\nnow<br />\nare<br />\nthey<br />\nwork<br />\nwhat<br />\nmatter<br />\nno<br />\nbranches of study. All men,<br />\ncan write and will work, should take advantage of this opportunity, and strive<br />\nfor the vacant editorship. Articles on news or athletic events, or original contributions should be handed in as soon as possible, as the election will take<br />\non<br />\nplace in a short time. All work done in this competition will be counted<br />\ncontests.<br />\nin<br />\nfuture<br />\nor<br />\nthe record of the competit<br /><br />\n4<br /><br />\nHOUGH there is apparently less athletic activity during the winter months<br />\nthan at any other season of the year, this time is really the most important for the development of successful teams. This is the time for hard<br />\ntraining and vigorous practice in gymnasium and cage, when talent is brought<br />\ntaking<br />\nforward and the structure of the team is formed. There are few games<br />\ngames<br />\nhard<br />\nplace now, but the quiet work in the cage is preparing men for the<br />\ns<br />\ncandidate<br />\nthat will follow one another later in the season. Now is the time for<br />\ntill<br />\nwait<br />\nto<br />\nto come out if they ever expect to make teams; they cannot afford<br />\nsome set<br />\nlacrosse practice starts at the park or till the track team is entered for<br />\nhad,<br />\never<br />\nhave<br />\nof games. The coming lacrosse season will be the hardest we<br />\n.<br />\nstandard<br />\nits<br />\nand it requires a great amount of work to keep the team up to<br />\na<br />\nonly<br />\nleft<br />\nThe track and field team has lost some of its best men, and has<br />\nphysismall nucleus on which to build. We therefore urge all men who are<br />\ntry to<br />\nand<br />\ncally able to do athletic work to go out now with one of the teams<br />\nper<br />\nninety<br />\nmake it. If you are new and inexperienced, remember that about<br />\ncent. of all Hopkins athletes were \"made\" at Hopkins.<br />\nes<br />\nHU Senior Feeds, the Senior Prom. and various other Senior enterpris<br />\nspirit<br />\nHopkins<br />\nthe<br />\nin<br />\nchange<br />\nng<br />\n- now in embryo, indicate an interesti<br />\nwhich should be productive of much good. Formerly it was one of the<br />\nthe<br />\nlaws of the so-called Hopkins spirit for seniors to be serious spectators of<br />\nthe<br />\nbeen<br />\nhave<br />\nshould<br />\nwho<br />\nseniors,<br />\nactions of juniors and freshmen, so that the<br />\non-lookpassive<br />\nthan<br />\nmore<br />\nmuch<br />\nnatural leaders in all college affairs, were not<br />\ners. At present it appears to be the senior spirit which dominates the Hopsuch<br />\nkins spirit, and the greatest field of activity is the graduating class. Just<br />\nsometo<br />\namount<br />\nwill<br />\nthat<br />\nthings are needed to build up a genuine college spirit<br />\nthing in later years, that will be a bond between the alumnus and his Alma<br />\nMater; for no matter how high the Academic standing of a college is, it cannot<br />\nhold the interest of its alumni except by pleasant recollections and associations,<br /><br />\nZ<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nBy this we do not mean that fun is the only essential of a true college spirit,<br />\nbut it is the first from which all other demonstrations spring. It would be a<br />\ngood plan for 1903 and 1904 to follow the lead of the seniors in enlivening old<br />\nHopkins.<br />\nHE first twenty-five years in the growth of anything, be it man or institution, are always the most vital, the most fraught with dangers, and the<br />\nmost full of obstacles; and when these years are successfully passed<br />\nthere is always just cause for a halt and a retrospect. The Johns Hopkins<br />\nUniversity will, on February 2122, stop its regular routine for a celebration of<br />\na quarter of a century's growth, which in methods and results has filled educators in Europe and America with wonder. The founding of the University<br />\nmarked an epoch in education in the United States, for methods entirely unknown on this side of the Atlantic were introduced into the Hopkins system of<br />\ninstruction. The exceedingly high standard of the great German universities<br />\nwere set as the goal for the Hopkins graduate departments, so that now the<br />\nreputation of the Hopkins degree of philosophy surpasses that of any American<br />\nUniversity, and equals the best in Europe. A recent account published in the<br />\ndaily papers of this country from an interview with a Yale graduate, stated<br />\nthat though Yale, old as she is, was seldom mentioned in European educational<br />\ncircles, the name of Johns Hopkins bore a magic charm; while in America any<br />\ngraduate from the \"phiolosophical machine\" of Hopkins, a name by which the<br />\nUniversity was once characterized, can secure a teaching position anywhere.<br />\nResults such as these, attained in so short a period as twenty-five years, are<br />\nsurely worthy of a great celebration, especially as this year we stand on the<br />\nthreshhold of a new era, and begin the second quarter under a new president<br />\nwhose inauguration occurs at the same time. It is true that owing to a remarkable lack of support, the dawn of the new era is not as bright as it should be;<br />\nyet it seems that it must almost be a result of a natural phenomenon for the<br />\nclouds to clear, for the alumni and friends of the University to recognize that<br />\nwhat it has done it can continue to do—if nobly supported by those it has<br />\nreared, and by those to whom it has brought an untold wealth.<br /><br />\nTHE NEWS—LETTER'<br /><br />\n9<br /><br />\nHaiffiniammounimourn rthipiimommoomunimummoimmuniumummummommumnumummithinummommunis<br /><br />\noievologoin11111111141111ivrIvroWilllivoliwolfilliglliliiillililirIPIIMIIIIN1111111111111111111111111111111111111111111111inillialltiglIffifillig1!g1:P:i4irsal;01<br /><br />\nACH member of the class of 1901 and 1902 has received an attractively<br />\nprinted copy of the baccalaureate sermon delivered by the Rev. John<br />\nSparhawk Jones, D. D., before the class of 1901, at last year's commencement. The thanks of the students are due to the originators of the plan.<br />\nAt a recent meeting of the Junior Class it was decided that only those members who have gained distinction in class athletics or on the debating team<br />\nshall be allowed to wear the class numerals. Those men who played on the<br />\nclass foot ball team and who had a hand on the cane in the cane-rush are entitled to the honor. Messrs. R. C. Pagon and Franklin Hazlehurst have the<br />\ndistribution of the numerals in charge. They are to be awarded at the class<br />\nbanquet which will be held on February 10.<br /><br />\nG<br /><br />\nUpon several occasions during the present year there has been some talk<br />\nabout holding a senior promenade. The good results to be derived from such<br />\nan affair by promoting the social unity of the student body are easily seen, and<br />\nPresident Harvey B. Stone has made several attempts to have some action<br />\ntaken in the matter. Just why a certain element in the class discountenance<br />\nsuch attempts can not readily be seen. It is to be hoped that plans for holding<br />\nthe dance will materialize before it is too late.<br />\nEben C. Hill, 1902, has at last recovered from his severe attack of typhoid<br />\nfever. He will probably not continue his full course at the University, however, until next year, Prior to his illness, Mr. Hill managed the musical<br />\nclubs, and at a recent meeting of the NEwS LitrrER staff was elected associate<br />\neditor.<br />\nH. K. Tootle, 1903, has also returned to the University after being confined<br />\nseveral days with an attack of malaria.<br />\nAt a recent meeting of the Freshman class, J. Newman Nutnsen was<br />\nelected class president, succeeding Edmund Dickey, who has been obliged to<br />\nleave the Hopkins. Dickey will be remembered as the man who, almost singlehanded, stopped so many rushes of the Junior team in the class game; and he<br />\nwas the only Freshman who kept a grip on the cane.<br />\nThe Senior and Junior debating teams organized last week. Chas.<br />\nMarkell, Jr., was elected chairman of the Senior team, Fred. L. Guggenheimer,<br />\nSecretary; S. Blum was elected chairman of the Junior team. The date of the<br />\ninter-class debate is February 28, that of the inter-collegiate two weeks later on<br />\nMarch 13.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nThe course in experimental physics recently started at Lafayette College is<br />\nunder the supervision of Mr. Henry J. Lucke, instructor in mathematics. Mr.<br />\nLucke is a graduate of Johns Hopkins, 1898, and did several years' graduate<br />\nwork here under the late Dr. Rowland.<br />\nEach member of the Hopkins faculty has been requested to provide himself with a gown, to be worn on all academic occasions.<br />\nDr. Bright, director of the English department, was chosen president of<br />\nthe Modern Language Association at its meeting in Boston during the holidays.<br />\nAssociated with the Junior class in the English course is Mr. H. G.<br />\nGeibels, a graduate from the University of the South, at Sewanee, Tenn. The<br />\nSouthern University is situated in the mountains of Tennessee, and the climate<br />\nis delightfully cool throughout the summer and intensely cold in winter.<br />\nAccordidgly, vacation is held during the winter months, and the regular university work is continued throughout the summer. Mr. Geibels is utilizing his<br />\nwinter vacation in pursuing a course in English and German at the Hopkins.<br />\nWith him is Mr. H. W. Jervey, who expects to become one of the faculty of<br />\nthe University of the South next year. He is taking up graduate work at the<br />\nJohn Hopkins.<br />\nTHE MAN WITH THE CONDITIONS.<br />\nBowed by the weight of conditions hard, he leans<br />\nAgainst a post and gazes at the Post Office,<br />\nThe emptiness of prep, school in his face<br />\nAnd on his back the weight of Christmas \"crams.\"<br />\nHis brain, like a machine, with knowledge filled<br />\nStolid and stunned, a brother to the cash register.<br />\nWho loosened and let down his smirking jaw?<br />\nWhose was the hand that furrowed up this brow?<br />\nthis the thing that Mr. Thomas Ball bath done<br />\nWith a few strokes of his mad, magic pen.<br />\nDown all the hot turnpike to the Rathskeller<br />\nThere is no note more terrible than this;<br />\nMore tongued with censure of the Freshman's work,<br />\nMore filled with signs that tell us he hath failed,<br />\nMore fraught with terror to the luckless wretch.<br /><br />\nIs<br /><br />\nWhat gulfs between him and matriculation!<br />\nSlave of the wheel of labor, what to him<br />\nAre Mack and all athletic youths 80 bold?<br />\nWhat the long reaches of the peaks of song<br />\nOn which the glee club strands, an Ark on Ararat?<br />\n0 masters, teachers; tutors in all lands<br />\nHow will the future reckon with this child?<br />\nHow answer his sad question in that hour<br />\nWhen in despair to prep. school he returns?<br />\nHow will it be with colleges and with schools<br />\nWhen he shall rise in power and ask the cause<br />\nH. K. T. '03.<br />\nOf his dismissal from the University.<br /><br />\nROBERT E. SPEER.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n11<br /><br />\nDR. GILMAN'S LECTURE.<br />\nN last Saturday Dr. Gilman began his series of lectures on University<br />\nEducation with a talk on \"Washington's Idea of a National University: How It has been Hindered and Fostered.\" Donovan room was so<br />\ncrowded that a few minutes before 9.30 the doors were closed on a still pressing<br />\nthrong. ,Dr. Gilman began in his characteristic way with a statement to the<br />\neffect that he \"would like to talk about Comparative Biography, but the idea of<br />\na National University has come forward so prominently that he feels called<br />\nupon to speak of it instead.\" After mentioning the interest Washington, Jefferson and others of the founders of the country manifested in the establishment<br />\nof a National University,and the measures taken to establish one at the Federal<br />\nCity, Dr. Gilman sketched the development of the idea to the present day. In<br />\nreference to the \"Carnegie Institute,\" in the incorporation of which Dr. Gilman<br />\nplayed so prominent a part, he said that it would be an institute for the advancement of knowledge, a place for undergraduate and graduate, American and foreigner, to develop knowledge along his own line of research. Imposing buildings are not in the idea of the proposed institute; but every means to advance<br />\nknowledge will be developed and put at the hand of knowledge-seeker.<br /><br />\nO<br /><br />\nY. M. C. A. NOTES.<br />\nN Sunday, January 26, Mr. Robert E. Speer, of New York, will<br />\naddress a mass meeting of students in Levering Hall, at 4.30 P. M. Mr.<br />\nSpeer was graduated from Princeton in 1899 and also holds A. M. degree<br />\nfrom Yale. He was one of the three original founders of the Student Volunteer<br />\nMovement, and has travelled widely in the Far East. Since 1891 he has served<br />\nas Secretary of the Presbyterian Board of Foreign Missions. His principal<br />\nbooks are \"The Man Christ Jesus,\" \"The Man Paul,\" and \"Missions and<br />\nPolitics in Asia.\"<br />\nAs a speaker, Mr. Speer has had great power and usefulness k the Northfield Student Conferences. He is one of the most useful and eloquent young<br />\nmen of to-day, and it is hoped that Hopkins students will avail themselves of<br />\nthis opportunity to hear him. It is regretted that an unavoidable occurrence<br />\nnecessitated the postponement of the talk from January 19, as announced on<br />\nthe cards sent out by the Association.<br /><br />\nO<br /><br />\nThe second Sunday in February has, in accordance with the custom for<br />\nseveral years, been appointed as the Universal Day of Prayer for students, to be<br />\nobserved by the Christian Students' Associations in all countries. The arrangements for this Association will be announced later.<br />\nThe regular monthly meeting of the Executive Council will be held Thursday, January 16th, at 5 P. M.<br />\nThe 30th annual Inter-State Convention of the Young Men's Christian Associations of Maryland, Delaware, West Virginia, and the District of Columbia,<br />\nwill be held at Wheeling, W. Va., February 20-23.<br /><br />\n12<br /><br />\nTHE NEWS—LETTER.<br /><br />\nINTERCOLLEGIATE ASSOCIATION.<br />\nSPECIAL meeting of Maryland Intercollegiate Association was held last<br />\nSaturday morning at the office of the president, Mr. James A. Fechtig,<br />\n16 East Lexington Street. The Association is composed of Johns Hop•<br />\nkins, St. John's, and Western Maryland, representatives from each of these<br />\ninstitutions being present.<br />\nA protest was registered against the Hopkins, on account of their playing<br />\ngraduates on their various athletic teams. Discussion was rife, but it was<br />\nfinally determined to postpone all action until next Saturday when another<br />\nmeeting will be held at the same place. The treasurer reported that the finances<br />\nof the league were in a flourishing condition.<br />\nThe banners and prizes for winning the various championships of the<br />\nLeague were voted to the Hopkins as follows:<br />\nChampionship banners for base ball, foot ball, and track and field teams.<br />\nCup for winners of the Intercollegiate relay race.<br />\nMedals for winners of the Intercollegiate Tennis Tournament.<br />\nThe delegates present were:<br />\nJ. H. U.—Wm. M. Mackdermott, Ronald T. Abercrombie and W. E. Hoffman.<br />\nSt. John's—Prof. James W. Cain, James A. Fechtig, Jr., and G. W.<br />\nBleeker.<br />\nWestern Maryland—Charles H. Holton, H. J. Robinson and E. C. Gilligan.<br />\nJames A. Fechtig, Jr., president, was in the chair.<br /><br />\n4<br /><br />\nJOINT INTERSCHOLASTIC MEET.<br />\nR. HORACE S. WHITMAN, A. B. Hopkins, 1901, \"charge d' affaires''<br />\nat Marston's, and Prof. Wm. .Mackdermott, director of Physical<br />\nTraining at the Hopkins and at the Boys' Latin School, are arranging<br />\nto hold an interscholastic indoor meet in the Armory sometime in March. This<br />\nwill be the first event ever held under the joint auspices of Boy's Latin School<br />\nand Marston's, and all the \"prep.\" schools in this section of the country, including New York, Philadelphia, and Washington will he invited to send entries. The events will be open only to schools.<br />\nThe efforts of Messrs. Whitman and Mackdermott to establish a closer relation and more harmonious action between the two schools are bearing good<br /><br />\ngt<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nfruit; and, in spite of the intense rivalry which formerly existed between these<br />\nschools, the utmost good feeling now prevails and promises to last.<br />\nThe scheme should be encouraged in every way, as it will he the direct<br />\nmeans of bringing out large numbers of boys from the various schools, many of<br />\nwhom will in a few years run or jump under the Black and Blue.<br />\nIt is not hard to calculate what the development of athletics in the prep.<br />\nschools in Baltimore means to the success of athletics at Hopkins. Formerly<br />\nthe hardest problem in our athletics was the training of men entirely \"green,\"<br />\nbut for the last two years, since stock in prep. school sport has risen, there have<br />\nalways been a few fast men coming here from the schools.<br />\nTRACK AND FIELD.<br />\nOW that the second term is well under way the Track and Field team has<br />\nmade its debut in the cage. Preliminary training under the direction of<br />\nMr. Mackdermott and Capt. Hoffman was begun last Monday, to be<br />\nfollowed by active training next Monday.<br />\nAn unusually large number of candidates has appeared thus far, and some<br />\ngood material for the coming events has been noted.<br />\nAmong those who have shown up especially well are:<br />\nBranham, Emig, Kohn, Bennett, Barrett, Nelson, Smith, Lecron, Porter,<br />\nWilliams and Rosenfeldt.<br />\nA preliminary set of games will be held in the cage two weeks hence, at<br />\nwhich the most promising material will be selected for the coming events in<br />\nwhich glory is to be won. Besides these, it is proposed to hold a series of indoor events in the cage, in which all who are interested in track and field sports<br />\nmay participate. Prizes will be given for first, second, third, and fourth places<br />\nin each separate event, besides which a larger prize will be offered to the one<br />\nmaking the best showing in the entire series.<br />\nTrack and Field work is hardly as interesting in the preliminary training as<br />\nlacrosse practice and that of other teams, so it is to be hoped that the large<br />\nbunch of runners who have come out up to date will keep their nerve and continue their hard and steady practice. It is only such practice that is productive of the best results. If the men work conscientiously enough there is no<br />\nreason why we should not keep up the standard of former years, and add as<br />\nmany banners to our trophy room as heretofore.<br /><br />\nal<br /><br />\nTHE ANNUAL FEED.<br />\nRIDAY evening, January 31, has been set as the date for the University<br />\nathletic feed this year. The usual interesting program, with various improvements, is now being arranged, This is an occasion on which the<br />\nwhole undergraduate body turns out, as it is the only general informal meeting<br />\nheld during the session. Special efforts are to be made to have a large alumni<br />\nattendance also, and everal members of the Faculty will be asked to attend.<br />\nEverybody remember the date, January 31, and hold it in reserve.<br /><br />\n5<br /><br />\n11<br /><br />\nTHE NEWS—LETTER.<br />\nNEW YEAR'S DAY.<br />\n9.30<br /><br />\nA. M.<br /><br />\nSays I to me:<br />\n'Now hully gee<br />\nMan<br />\nYou jest simply got ter quit!<br />\n'Taint no joke! !<br />\nBy Gull I mean it !!<br />\nYers New Years day, finer time<br />\n..4int come yit<br />\nFer yer vows sublime!<br />\nI tell yer<br />\nMister me<br />\nAn' it<br />\nIs quit!!!!'<br /><br />\nNEW YEAR'S DAY.<br />\n1.30<br /><br />\nP.M.<br /><br />\nShays Ish to meesh:<br />\n'Now hully geesh<br />\nMansh<br />\nAfter thish yer simplish quit!<br />\n'Taintsht no jokesh !!<br />\nBy damnsh I meansh it !!<br />\nYersh Newsh Yearsh daysh, finer Stein,<br />\nAiut bin yit<br />\nFer yer wowsh shublime<br />\nI tellsh yer<br />\nMishter me<br />\nAn' it<br />\nT'mor's---quit !!!!'<br /><br />\nA TALK WITH WALTER.<br />\n44at0, SIR, I wont, sir; not too short, sir. Do you want it cut higher over<br />\nthe ear, sir? No, sir; that's right, sir.<br />\n\"Lacrosse, sir? You must be a stranger around here, sir? Even<br />\nthe freshmen knows about lacrosse, sir; or at least he thinks he does. It's<br />\ncalled lacrosse because it is a cross between tennis and hockey; and the language spoken is usually a cross between what one gentleman calls Balzac at<br />\nhis best and Chaucer at his worst. But he says that is only when a man gets<br />\nhit with the ball.<br />\n\"Me, sir? no, sir, I've never played it; I've too much sense, sir. But<br />\nthere are them that seem to like it. Why don't you know that there are just<br />\nlots of young gentlemen, nice boys, not toughs, who fail to pass in their studies, sir, just because they don't want to fail in passing a lacrosse ball. They<br />\ndon't mind being late to class a bit, sir. Just ask Mr. Greene, not the one at<br />\nthe post office, but the other one. Dr. Greene? That's it, sir, Dr. Greene. He<br />\nknows, sir.<br /><br />\nP.9Ir<br /><br />\nTHE NEWS—LETTER.<br /><br />\n15<br /><br />\n\"The first thing, sir? Well they have a meeting in the trophy room, and<br />\nCaptain Schmeisser explains the game to the freshmen in words of one syllable.<br />\nAnd then Mr. Mackdermott talks. You'd think that he was talking in words<br />\nof eight syllables, but he aint, sir. It just sounds that way because he talks in<br />\nbunches.<br />\n\"Am I getting it too short, sir? No indeed, I'll make it even. What<br />\nnext? They go into the cage and the old men show off so that the freshmen<br />\nwill he awed. It takes a lacrosse man to handle a freshman. All the Hopkins<br />\narrogance and pride for years seems to crop out in the lacrosse men; if they are<br />\nnot the whole show they at least think so.<br />\n\"If you can hit someone else without getting hit yourself that counts you<br />\none.<br />\n\"Then the young ladies, sir. They come down to see how the game is<br />\nplayed. 'What a pretty game?' she says. 'Yes, it's so open,' he says. 'Open<br />\nto improvement?' she says. `No,' says he disgusted like, 'open to the view.'<br />\n'Especially the costumes,' says she. 'Let's discuss Ibsen,' he says, and they<br />\ngo out. It's a glorious game, but you: have to be iniated.<br />\n\"If you'd buy one of my tickets, I would do you good, sir. Thank you<br />\nsir.<br /><br />\nT. '03.<br /><br />\nCall again, sir.''<br /><br />\nAMONG THE COLLEGES.<br />\nThere are five hundred women students at the University of Berlin. In<br />\nAmong the five hundred are two daughstate.<br />\nof<br />\nministers<br />\nof<br />\nters<br />\nIf a Russian girl wishes to study at any of the universities which now<br />\nadmit women, etiquette does not allow her to do so until she is married; so she<br />\ngoes through the civil ceremony of marriage with a man student whom, very<br />\nprobably, she has never seen before; and this marriage is quite legal though<br />\nthey may never speak to each other again. At the end of the college course,<br />\nthe bond is considered as dissolved.<br />\n1896-1897 there were only ninety-six.<br /><br />\nMany of our colleges show a revival of interest in debating societies.<br />\nAmherst has appointed a committee to confer with a committee of the Faculty<br />\nas to which college shall be challenged for an intercollegiate debate. Oberlin<br />\nbelongs to a debating league which numbers nearly all the colleges of the Middle West. Dartmouth has formed a new debating union. All students save<br />\nFreshmen are eligible. Massachusetts Institute of Technology is making the<br />\nbeginnings of a debating society.<br />\nClark University is to have a collegiate department. Its object is to fit<br />\ngraduates of high schools and others for the ordinary pursuits of practical life.<br />\nA three-year course, and a small fee, will be the features; and representatives<br />\nare to be sent to observe the conditions at Hopkins.<br />\nGeorgetown and Lehigh have exhibited a novel form of entertainment in a<br />\ncombined concert, given by the Mandolin and Glee Clubs of the two colleges.<br />\nThe first half of the evening was given to Lehigh; the second to Georgetown.<br />\nThis is a valuable suggestion for the Bryn Mawr trip of our Musical Clubs.<br /><br />\n16<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE VALUE OF CORRECT 1EADING AND HOW TO DO IT.<br />\nThe only correct paper submitted at the Christmas examination in Public Speaking.<br /><br />\nEADING aloud is a graceful accomplishment possessed by comparatively<br />\nfew. Too often the home reading is Fpoiled by a dreary monotone that<br />\nthe reader does not strive to overcome. If the patient listeners would<br />\nonly strive to overcome the possesser of the dreary monotone the fault might,<br />\nin time, be remedied. How much brighter would home become if we took care<br />\nto read correctly! Even papa would take a livelier interest in the reading of<br />\nthe stockmarket reports if only his silvery-tongued daughter would read the<br />\nrecords to him. In time a great improvement and growth would be seen in the<br />\nfamily (not in size hut in interest.) Little Johnnie would no longer take<br />\npleasure in reading about Diamond Dick in the woodshed; coming under the<br />\nbenign influence of the home reading circle he would gradually be elevated until he could read with pleasure, if not with profit, the Fables of George Ade, and<br />\nthe war poems of Rudyard Kipling.<br />\nDIRECTIONS: Grab the book, paper, or pamphlet, in the left hand, hold it<br />\nto the side, slightly below the face, and about eighteen inches from the head.<br />\nCast your eyes often upon the audience, but more often upon your book. Read<br />\nnaturally. By naturally I do not mean that the elocutionary tyro should shout<br />\nHamlet's Address to the Players, nor declaim in funeral tones the Charge of<br />\nthe Light Brigade. The neophyte in the realms of oratorical art should strive<br />\nto acquire a becoming elocution through carefully, painstakingly, laboriously<br />\nreading Dr. Lee's Principles of Public Speaking; price $1.39 at all drug stores.<br /><br />\ng<br /><br />\nPoetry and Prose from the Cornell Widow.<br />\nI.<br /><br />\n\"0 Mary Ann, come row with me<br />\nUpon the silent bay,<br />\nWhere dancing moonbeams here and there<br />\nDisport themselves at play.\"<br />\nH.<br />\n\"Oh. sir,\" said simple Mary Ann,<br />\n\"I hardly think I ought'r,<br />\nFor I'm afraid we'd seem to cast<br />\nReflections on the water.\"<br /><br />\nTHE NEWS—LETTER.<br /><br />\n17<br /><br />\nThere was a young lady from Sayre,<br />\nWho went out for a regular tayre,<br />\nShe came home at one<br />\nWith a horrible bun,<br />\nWhich was more than her parents could bayre.<br /><br />\nSUNDAY SCHOOL TEACHER—\"Willie, were you ever baptised?\"<br />\nWILLIE—\"Sure. Tree times.\"<br />\nSUNDAY SCHOOL TEACHER—\"Three times! Willie!\"<br />\nWILLIE—\"Sure. I kin show you de scars on me arm.\"<br />\n'05. \"I read that the English students of the University of Pennsylvania<br />\nhad formed a literary society.'<br />\n'04. \"What's their yell?'<br />\n'05. \"Pen-Pencil-Pencilvania!!!<br />\n'Then on the other hand,\" said the orator, as he changed his cuff from one<br />\nwrist to the other.<br />\nLi Hung Chang, a well known resident of China, is dead.—Regina<br />\nIs it possible?<br /><br />\nStandard.<br /><br />\nGRACE—A strange man spoke to me in the car to-day.<br />\nETHEL—Indeed! What did he say?<br />\nGRACE—Fare, please.—Harvard Lantfioon.<br />\nThen 'tis oh to be a poet,<br />\nTo feel, and sigh, and sing.<br />\nAnd to read your own great verses<br />\nIn the magazines in Spring.—Coilege Mercury,<br />\n\"Ha, I will fool the bloodhounds yet,\" cried the fugitive, hoarsely, and<br />\nslipping on a pair of rubbers, he erased his tracks.— Yale Record.<br /><br />\nPROFESSOR—Derive the word virgin.<br />\nSTUDENT— Vir, a man,.4'in, a trap, virgin, a man-trap.—Vox Wesleyana.<br /><br />\nIS THIS ANOTHER UNBASED RUMOR?<br />\nANNAPOLIS, Mn., Jan. 13.—It is rumored here tonight, and there appears<br />\nto be some foundation for the rumor, that Andrew Carnegie is coming to the<br />\nrescue of the Johns Hopkins University. It is said that Dr. Daniel C. Gilman,<br />\nwho has been in close consultation with Mr. Carnegie about the $10,000,000<br />\nendowment for the national institute plan, has directed Mr. Carnegie's attention<br />\nto the Johns Hopkins University, and that Mr. Carnegie has been favorably<br />\nimpressed. It is intimated that he will contribute enough to make up the<br />\n$1,000,000 endowment which is necessary before the University can avail itself<br />\nof the offer of the Wyman and Keyser tracts of land on Charles Street avenue.—<br />\nBalthnore Sun.<br /><br />\nApluvia and Cravenette Rain Coats<br />\nAre Suitable and Correct for Wear on all occasions and in all Weathers<br /><br />\nNICDi<br /><br />\ni..ic<br /><br />\ni<br /><br />\nNICD<br /><br />\nCD rDCD<br /><br />\nWILL SHED RAIN PERFECTLY.<br />\nManufactured by<br /><br />\nCHESAPEAKE RUBBER COMPANY,<br />\nAl.EE<br /><br />\nE-71<br /><br />\n321 W. Baltimore Street.<br />\n&amp; (5'C.) ,<br /><br />\nWEST BALTIMORE LOAN CO. 675 West Baltimore Street,<br /><br />\nBetween Arch and Pine Sts. Baltimore, Md.<br /><br />\nLiberal Advances on Merchandise of every Description. WATCHES AND DIAMONDS A SPECIALTY.<br />\nOPEN<br /><br />\nFROM<br /><br />\n7<br /><br />\nA.<br /><br />\nM. TO 6 P. M.<br />\nSIDE ENTRANCE<br /><br />\nSATURDAYS<br />\nWITH PRIVATE WAITING 000m.<br /><br />\na co.<br /><br />\nSMITH, DIXON<br /><br />\nPPcrijj c.<br />\n29- 31 S. Charles St.<br /><br />\nBaltimore, Md.<br /><br />\nPlutures<br /><br />\nUNTIL 10<br /><br />\nP.<br /><br />\nM.<br /><br />\nFrA\"mminfl<br /><br />\nFRANKE &amp;<br />\nPURNELLCO.<br /><br />\nI I Urnillki.<br /><br />\n224 N. HOWARD ST.<br /><br />\nOren letter<br />\nA. fETTING, fraternitr<br />\njeweArp.<br />\nMANUFACTURER OF<br /><br />\n14 AND 16 ST. PAUL STREET,<br /><br />\nBALTIMORE, MD.<br />\nPLEASE CALLAND FDA MN( OWE LINE ISEFONF. PUR- NASING.<br /><br />\nJ.<br /><br />\nH. ROBINSON.<br /><br />\nFINE<br /><br />\nBonbons, GlioGolates,<br /><br />\nOIF<br /><br />\n— • FINE • CIGARS. %<br />\n°EULER IT<br /><br />\n94,144(1'0, (31(/A RS A NI) MMOKIOHS' Airricr.mm.<br /><br />\nSTAIVIONEHY.<br />\n(I20 N. li:T.JTA W ST.<br /><br />\nCONFECTIONS.<br />\nFRESH EVERY HOUR.<br /><br />\nSENT BY MAIL OR EXPRESS.<br /><br />\n14 EAST BALTIMORE STREET.<br /><br />\nBALTIMORE, MD.<br /><br />\nBaltimore, Now York &amp; Philadelphia Papers.<br />\nC. &amp; P. Public Telephone, Madison 1185Y.<br /><br />\nDesigning and Cutting by<br /><br />\nE. Michaelson.<br /><br />\nF. MIGHMELSON,<br />\nMERCHANT TAILOR,<br />\nPOPULAR PRICES.<br />\n821<br /><br />\nALTERIN0 AND REPAIRINO<br /><br />\nrladison Aveinte,<br /><br />\nSpecial discount to Students.<br /><br />\nBALTIMORE, MD.<br /><br />\nA. D. SMITH &amp; SONS,<br />\n104<br /><br />\nREADY TO<br /><br />\nFoi merly<br />\nLEV'ERINO &amp; SMITH,<br />\nWEST LEXINGTON STREET.<br /><br />\nWEAR HATS fur<br /><br />\nLadies, Misses<br />\nand Children.<br /><br />\nIn th, 1,(Ltext Dexifinx.<br />\n\\IRK'S HATS liorhys and Sort Pelts.<br /><br />\nUNIVERSITY LAFE.<br />\n(ALAS. LEN DENMEYER. Prop.<br /><br />\nCHOICF WINES, LIQUORS ANI.) CIGARS,<br />\nRA W 110X NOW OPEN.<br />\n506 NORTH EUTAW STREET.<br />\n1,101444'1111d (1.+1111(111011's Dining Rooms.<br />\nSPtl'Oii at All Hours.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n804 UNION TRUST BUILDING,<br /><br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nOSTEOPATHY<br />\nis a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to Diseases of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We will be glad<br />\nto furnish any further information on application.<br /><br />\nESTABLISHED 1879.<br /><br />\ntUedding Silverholiday<br />\nIN GREAT VARIETY.<br /><br />\nJACOBI dk JEMKINS,<br />\nate N. CNAINLIIS ST.<br /><br />\nsilversmith.<br /><br />\nlienderson's<br /><br />\nso<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\n16xt Books, Note Books.<br />\nStudent's Supplies.<br /><br />\nMadison&amp;HowardSts.<br /><br />\nH. MoMAINS, D.0.,<br />\nSoc'y. &amp; Treas.<br /><br />\nMARIA BUIE, D. 0.,<br />\nV.-Prest. &amp; Asst. Secey.<br /><br />\nW.D.BOW EN, M. D., D. 0..<br />\nProst. &amp; Mgr.<br /><br />\nJAMES R. PAINS.<br /><br />\nTHEO. WARNICR.<br /><br />\nR 8c C:O.<br /><br />\nW.A..F4Z NI<br /><br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgent for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Casslmere Hats. 6111r<br /><br />\nHMG &amp; COMPANY<br /><br />\nC<br /><br />\nBooksellers and<br />\nP<br /><br />\nSYMIOrlerS.<br /><br />\n34 W. BALTIMORE ST.<br />\nReese<br />\nSCHOOL, LAIN MSDICAL. CLASSICAL AND MIIICELI.<br />\nKeeps constantly on hand the Text Books used in Johns<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nCertificate of Analysis from<br />\nProfs. G. W. Lehman &amp; Son,<br /><br />\nH. R. E1SENBRANDT SONS,<br /><br />\nto 705<br />\nMADISON AVE.<br />\nof<br />\nsubmitted<br />\nReads as follows: Samples<br />\nFrench Itrantly—no adulterants, no coloring,fine quality.<br />\nOporto Port—absolutely pure, of superior quality.<br />\nin,Sherey—no coloring or adulterants, absolutely pure wine.<br />\n\"75 Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive 011—all tests show pure olive oil.<br />\n\"der Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br /><br />\nfor<br /><br />\nJORININ STIIBLER GO.<br /><br />\nrOR ADVERTISING SPACE IN THIS PAPER<br /><br />\nAPPLY TO<br />\nPEARRE E. GROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\nBALTIMORE, MD.<br /><br />\n201-203 N.CHARLES ST.<br /><br />\nBALTIMORE, MD.<br />\nCharles T.Crane,<br />\nPresident.<br />\nCarter G. Osburn,Cashier.<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450.000.<br />\nCapital, $660.000<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nin accordance with<br />\nextended<br />\nFacilities<br />\nsolicited.<br />\nbalances and business responsibility.<br />\nCORRESPONDENCE INVITED<br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nOtto II. Williams,<br />\nVice-President.<br />\nI. E. Marshall. Asst, Cashier.<br /><br />\nA. SCHUMACHER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON. PARIS,GIBRALTER,<br />\nNAPLES, GENOA. ETC.<br />\nBALTIMORE TO BREMEN<br />\nDIRECT.<br /><br />\nMANDOLIN. GUITAR AND BANJO<br />\nTAAAAA •V<br /><br />\nC. J. LEVIN,<br />\nwho has made a life study of these Instruments. Mandolin Soloist of National reputation. Prepares Students<br />\nfor Hopkins Musical Clubs.<br /><br />\nStudio, 331 N. Gheelea St.<br /><br />\nttbe litran3•Smith<br />\nVan° CO.<br />\n109 and 111 North Charles Street.<br />\nSOLE AGENTS<br /><br />\nilsrenfraz &amp;ail°<br /><br />\nCbtchering, 13rabburp anb Webster<br /><br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20 West Lexington St.<br />\nSpecial Discount to Students<br /><br />\nBaltimore<br /><br />\nHABERDASHERS.<br />\nShirts, Neckwear,<br />\nI Underwear, Hosiery,<br />\nEtc.<br /><br />\nTHE BLAKE CO<br /><br />\nON SALE THE 1. H. U. PENNANTS,<br />\nand all other College Pennants<br /><br />\n203W.BALTIMORE ST. &amp; 2 S. LIBERTY ST.<br /><br />\nBALTIMORE, MD.<br /><br />\nMembers of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange;<br />\nChicago Board of Trade<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE de CO.,<br />\nBANKERS di BROKERSStreet<br /><br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German<br /><br />\nBALTIMORE, MD.<br /><br />\nThe Chas. Elms Surgical Instrument Company<br />\nBeNJ. A. NELSON.OENL<br /><br />\nMANAGER<br /><br />\nPhysicians,' Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and A000ssories.<br />\nBaltimore, Md.<br /><br />\n300 N. Howard St.,<br /><br />\nDrovers and Mechanics National Dank,<br />\ni<br /><br />\nOF BALTIMORE. MD.<br /><br />\nCapital Stock,$300,000.<br /><br />\njg Jo !Pianos. Js<br /><br />\nSMITH'S soH 2IT&amp;Bgale.GE<br />\nOLD<br />\nBOOK<br />\nSTORE<br />\n805 N HOWARD STREET.<br />\n8rd door from Madison.<br /><br />\nBOOKS<br /><br />\nYOUR EY1e,S<br /><br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br /><br />\n111 North Charles Street. (Masonic Temple.)<br />\nKX*MINING OPTiOlArNS.<br />\nTHE<br /><br />\nNEWS LETTER<br /><br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br /><br />\nBALTIMORE<br /><br />\nWe carry a lull line of Students' Note Books and Stationery<br /><br />\nBoth 'Phones.<br /><br />\nOLD AND NEW<br /><br />\nWM. V.PIPPEN.<br />\nJ. Wm. Middendorf,<br />\nA..!. Robbins.<br /><br />\n6o5 N. Eutaw Street.<br />\nA. H. Rutherfoord.<br />\nF. Lents.<br /><br />\nJ. WM, MIDDENDORF &amp; CO.<br />\n16anitere &amp;16rohers.<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\nBaltimore, Md.<br /><br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nB. G. EICHELBERGER,<br />\nBOOKS AND STATIONBRY<br />\nENGRAVING AND STAMPING.<br />\n1444=s. .20S<br /><br />\nCL.skalExt-loc..<br /><br />\nV. M. C. A. SUILDING,<br /><br />\nC. &amp; P. and Md.'Phones.<br /><br />\nCALL ON<br /><br />\nBALTIMORE, MD.<br /><br />\nIt DOWNS,<br />\nj8.8.<br />\n229 N. Gharles St.,<br /><br />\nTHINK IT OVER.<br /><br />\nSAYRE OPTICAL COMPANY,<br /><br />\n•<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City<br />\nBooks Bought, Sold and Exchanged<br /><br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\nFactory Prices.<br /><br />\n0.&amp; P.'Phone 2322-2.<br /><br />\n•••••.• yam•La.<br />\nFOR Class, Fraternity and College fitationerY.<br />\nBanquet Canis, invitations, Diploma!\".<br />\nPrograms, Visiting Cards, etc. ..... •<br /><br />\nOur 60e J. 11. U. Blue and Black Play Paper—now ready.<br />\n-There Is very little entertainment at home without. Timm<br /><br />\nT<br />\n!EF<br />\n5pTANos,,<br /><br />\nAre The Best.<br /><br />\n9 N. LlbertU St.<br /><br />"}], "field_media_file": [{"target_id": 36212, "display": null, "description": null, "target_type": "file", "target_uuid": "d4d865b1-8096-4e7e-93f0-fa7752c5a938", "url": "http://digital.library.jhu.edu/system/files/2022-03/12196-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12196, "target_type": "node", "target_uuid": "aa5ccbfe-6698-45bc-9c24-0ecaa22f92d1", "url": "/node/12196"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4c13084e-79b5-443a-bb23-2489a36950fd"}]}