{"mid": [{"value": 36969}], "uuid": [{"value": "3184ab10-294d-49bb-a888-8f8f37b6305a"}], "vid": [{"value": 36969}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13118-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:09+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "/<br />\n<br />\n0 LA<br />\n<br />\nF<br />\n<br />\n0<br />\n<br />\n,<br />\n4<br />\n<br />\n•<br />\n<br />\n7.<br />\n<br />\nVT<br />\n<br />\nVOL. XXVIII, No 47<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 4, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nCAMPUS DANCES RESUMED FELLOWSHIP DINNER HELD; RETURNS FROM SPRING<br />\nSEASON DRIVE DISAPPOINT<br />\nSUCCESS DESPITE THE<br />\nWITH CONSENT OF<br />\nWEATHER<br />\nTHE FACULTY<br />\nReturns, until a late hour WedStudent Council to Have Control of All Dr. Chan, Speaker, Asks: \"Can the Rest nesday, were extremely discouragof the World Advance Without<br />\nAffairs. Outsiders Banned<br />\ning, according to Graduate ManChina?\" President Reads Report<br />\nin the Future<br />\nFirst Opposition for Lacrosse and Baseball Squads Comes in Tomorager Keyes. At that time Barton<br />\nrow's Clashes. Alumni Expected to Prove<br />\nIn<br />\nspite<br />\nof<br />\nthe<br />\nheavy<br />\nsnowfall<br />\nAuthorities of the University<br />\nwas the leading individual salesTougher Foe Than Mutes<br />\nstudent<br />\norand<br />\nthe<br />\ndate,<br />\nApril<br />\nabout<br />\nfifty<br />\n1,<br />\nhave decided to allow<br />\nman with $135, Turnbull was secganizations to hold dances on the undergraduates attended the Y. M.<br />\nTomorrow the spring sports schedule will be started in full<br />\nond several tickets behind. Phi<br />\ncampus, thereby removing the re- C. A. Fellowship Dinner last Tues- Kappa Psi<br />\nforce,<br />\nweather permitting, with a gala day at Homewood Field,<br />\nwith $365 still was the<br />\ncent ban. All dances will be under day at the Friends' Meeting House.<br />\nwhen<br />\nthe<br />\nAlumni lacrosse team meets the varsity stick wielders on<br />\nhigh team and Pi Kappa Chi held<br />\nthe direct supervision of the StuMr. T. R. Marsh was introduced second<br />\nthe<br />\nsame<br />\nbill<br />\nthat brings Gallaudet and her silent warriors to Hopplace. The total sale Weddent Council, which body has ar- by R. C. Tilghman, the toastmaskins<br />\nthe Black and Blue nine in its opening game. Both<br />\nto<br />\nencounter<br />\nnesday afternon was just a little<br />\nranged a formula to be complied ter, and gave a short report in the<br />\nof the Black and Blue teams have been handicapped in their pracover $1,100.<br />\nwith in order to obtain permis- form of a summary of the work<br />\ntice by the late spring. At the time this goes to press lacrosse and<br />\nAll figures are much below last<br />\nsion to hold a dance.<br />\ndone throughout the year.<br />\nbaseball sound like words from an alien tongue as the athletic fields<br />\nAfter the conduct of two recent Dr. P. C. Chan, the speaker of year's. The athletic authorities are covered with a six-inch blanket of snow.<br />\ndances, at which the behavior of the evening, was next introduced Point out that whereas selling ends<br />\nparticipants was declared to be and gave a talk on China and her tomorrow all athletes engaged in<br />\nVarsity stick-wielders, led by<br />\nWhen the Hopkins baseball<br />\nunbecoming of Hopkins, the fac- relation to the rest of the world, spring sports will be in harness and team takes the field against Gal- \"Doug\" Turnbull, will open the<br />\nfit for action from now on; the laudet tomorrow, it will be with<br />\nulty placed a ban on all dances on and to America in particular.<br />\n1924 lacrosse season tomorrow aflong strenuous grind, which will a touch of confidence due to last<br />\nthe campus. The new plan is exThe general theme of his speech<br />\nternoon when they encounter<br />\npected to eliminate all complaint. was \"Can the rest of the world ad- not be terminated until the end of year's victory when the Black<br />\n\"Johnny\"<br />\nKnipp's alumni all-stars.<br />\nthe term, has begun.<br />\nThe organization holding the vance without China?\"<br />\nand Blue had only a mediocre<br />\nCaptain Knipp promises the vardance must first have its commit- \"If the Americans,\" said Dr. \"In view of the efforts put forth team. Meeting a more talented<br />\ntee chairman see the Dean in order Chan, \"do not get more exercise by the athletes,\" said Dr. Van Or- and experienced team than last sity squad as sturdy opposition as<br />\nto obtain the permission of the of the kind the Chinese coolie does, man,\"selling tickets with a trip to year's Gallaudet must present a the alumni have given in years.<br />\nfaculty. Next, after the Dean's children in fifteen or twenty gen- Europe as a possible reward is lit- formidable brand of baseball to<br />\nHis team has been strengthened<br />\nconsent is affixed to the applica- erations will be born without legs.\" tle enough for an undergraduate gain a victory over the Homeconsiderably<br />\nby a number of last<br />\nto do.\"<br />\ntion, he must go to the person in<br />\nwood nine. In spite of the lack<br />\nHe also pointed out that whereas<br />\nyear's graduates, and, consequentOf chief interest to undergradcharge of the building in which it the<br />\nof practice, the Black and Blue<br />\nUnited States coal and oil supuates as an outcome of this year's<br />\nly,<br />\nit should display unusual team<br />\nis to be held. Then, arrangements<br />\nhas been travelling at a lively clip<br />\nply is said to be nearly exhausted,<br />\nadvance sale of tickets for the seawith the engineer at the power there<br />\nunder the careful eye of Coach work. Numerous spring workouts<br />\nis one province in China<br />\nson is the possibility of starting a<br />\nhouse for lighting and heating are<br />\nBrockman. The pitching staff at L'Hirondelle Club should have<br />\nwhich alone can supply the world sinking fund for<br />\nthe much-needed,<br />\nmade.<br />\nparticularly will have to be reck- further added to the smoothness of<br />\nfor 1,000 years with these neces- long-sought<br />\ngymnasium. That<br />\nThe next step is to fill out the<br />\noned with by the visiting team. his already efficient machine.<br />\nsities of modern life.<br />\npresent indications point to a<br />\napplication to the Student CounDr. Chan's answer to the ques- speedy \"sinking\" of the sinking Winkenwerder, Marrian, Stuart<br />\nAccording to Coach \"Bill\"<br />\ncil. This includes name of organtion \"Why is China so slow and fund idea, was also pointed out. and McNeal, all dependable hurlhours,<br />\ndance,<br />\nof<br />\nization, place<br />\nSchmeisser, the former stars will<br />\nantiquated?\" is that the force of This feature of the sales had been ers, are each displaying different<br />\ncommittee in charge, and a list of<br />\nsuperstition has prevented China expected to draw strong under- styles of pitching, so that there by no means find the going easy.<br />\nthe chaperons.<br />\nfrom utilizing her natural resources. graduate support, so much discus- will be a variety of twirlers from They will be opposed by five regThe application is as follows:<br />\nThe influence of Christianity is ex- sion having been waged about the which the coach may make his ulars of last year. The remainder<br />\n\"The signer of this application<br />\nselection.<br />\npected to do away with the old gymnasium possibility.<br />\nof the team was chosen from a<br />\nagrees to be personally responsifears.<br />\nsquad<br />\nThe<br />\nof seventy-five aspirants.<br />\ninfield<br />\ncandidates<br />\nare<br />\nwagble for the conducting of the foreDr. Chan is going back to China<br />\ning<br />\na<br />\nCompetition<br />\nmerry<br />\nfor regular berths on<br />\nbattle<br />\nposifor<br />\nthe<br />\nmentioned dance, and will prethis fall and will establish a Chris- GAS SUPPLY EXPLAINED BY tions left vacant by last year's the team has been so keen that as<br />\nserve the following rules of the<br />\nLOCAL ENGINEER<br />\ntian community on a small tract of<br />\ngraduation. Captain Thomas at yet there is no definite certainty as<br />\nStudent Council:<br />\nland which he is going to buy. The \"Although natural gas may be second, and King, the flashy to who will have places in the line\"No. 1. The chaperons shall tract will be laid off in<br />\nlots ,as is distributed at a much lower rate shortstop, will form a great com- up when the first whistle blows.<br />\nconsist of at least_ one faculty done here, modern<br />\nhouses built and than that artifidially produced, it bination at the keystone sack, Last year's regulars who will<br />\nmember and his wife, also two a<br />\nchurch and a hospital will be in- should not be considered an un- while O'Conor is the most likely play again this year would make<br />\nother mature persons.(The Councluded. He will take charge of all qualified blessing,\" declared H. contender for first base, since Gil- a formidable nucleus for any team.<br />\ncil requires that all chaperons be<br />\nthe surgical work himself.<br />\nR. Cook, Jr., General Superinten- pin, his most formidable competi- If the alumni really expect to anoffered transportation to and from<br />\nThe President's report was as dent, Gas Operating Division, of tor, has injured his ankle while nex the varsity scalps they will<br />\nthe dance.)<br />\nfollows:<br />\nthe Consolidated Gas Flectric sliding to second on the soft have to furnish these men very<br />\n\"No. 2. Only alumni of the<br />\nThe<br />\nY.<br />\n!M.<br />\nC.<br />\nA.<br />\nat<br />\nthis<br />\nUniLight and Power Co., of Balti- ground last Thursday. The third stiff opposition. The five men who<br />\nUniversity, or students, or guests<br />\nversity<br />\nis<br />\ndrawing<br />\nto<br />\nthe<br />\nclose<br />\nof<br />\nmore.<br />\nbase position is giving Coach played on the championship team<br />\naccompanied by either, will be adits most successful year's activiMr. Cook made this statement Brockman unusual worry, having of 1923 and are again available this<br />\nmitted to the dance.<br />\nduring<br />\nties<br />\nmy<br />\ncollege<br />\nlife.<br />\nThe<br />\nin a lecture given before engi- failed to discover a suitable man year are: Bachman, Barton, Bene\"No. 3. Gentlemanly conduct<br />\nincreasing<br />\nstudent<br />\ninterest,<br />\norneering upperclassmen last Mon- to fill the vacancy. Ashton, dict, Turnbull and McDaniel.<br />\nas interpreted by the Council will<br />\nBad weather has proved to be<br />\nbe required at all times during the ganized and directed by our first day, March 24, on the Mechani- though a clever fielder with a<br />\nfull-time Secretary, Mr. E. A. cal Engineering Building. The good arm, is very weak at the bat, the most consistent jinx of this<br />\ndance.\"<br />\nThe faculty and Student Coun- Schaal, who has come to us from lecture, the second of a series of while Brian, on the other hand, year's squad. The heavy \"April<br />\ncil are unanimous in the belief Northwestern, has put new life lectures on \"Engineering Prac- seems to have his chief difficulty snows\" of the past week have extice,\" was entitled \"Supplying in fielding, but is a more reliable erted a particularly baneful influthat this new ruling, especially into this organization.<br />\nduty<br />\nof<br />\nthe<br />\nY<br />\nis<br />\nto<br />\nThe<br />\nfirst<br />\nthree,<br />\nwill<br />\nand<br />\neffectwo<br />\nbatter. Keen, the outfielder find ence on the attempts of the team<br />\nrules<br />\nGas to Baltimore.\"<br />\ntually prevent unbecoming con- serve the campus', and this ha<br />\nThe speaker then mentioned of the season, will probably re- to achieve perfect smoothness in<br />\nthrong',<br />\nbeen<br />\ndone<br />\nadequately<br />\nthe<br />\nHopkins'<br />\nmake<br />\nand<br />\nduct,<br />\nfive different kinds of commerci- ceive the left field assignment, their teamwork. Coach Schmeisser,<br />\ncritifrom<br />\nfree<br />\nThe<br />\nannual<br />\nvarious<br />\nchannels.<br />\nmore<br />\nonce<br />\ndances<br />\nal gas it is possible to use—nat- with Schact in center and Mar- however, made the best of it in subcol.<br />\n3<br />\n2,<br />\npage<br />\nContinued<br />\non<br />\nstituting frequent chalk-talks durcism.<br />\nural, oil, coke oven, carbonated rian or Smith in right field.<br />\ning the worst of the weather. On<br />\nwater, and coal gas. Of these the<br />\nLast Saturday's game with<br />\nthe whole, the elements have greatVAN ORMAN GIVES HIS OPINIONS OF<br />\nlocal concern, which is the larg- Drexel and a practice game with<br />\nLATEST VERSION OF FOOTBALL RULES<br />\nly hindered the necessary intensive<br />\nest operated by Mr. Cook's com- Poly were called off on account<br />\npractice.<br />\nHopkins Coach Favors All Changes But One Extending Powers of Referee. pany, uses carbonated water gas, of the weather, but Captain<br />\nBad weather has also deprived<br />\nGeneral Tendency is to Speed Up Ga me, Says Van Orman.<br />\nbecause it has the lowest cost of Thomas is hoping for a real<br />\nthe<br />\nRed Eagles of their opportunity<br />\n\"The<br />\nabolition<br />\nof<br />\ntenall<br />\nmud or ar- the various types of artificial gas, spring day and a real Hopkins<br />\n\"It seems to be the general<br />\nto<br />\nopen<br />\nthe Hopkins lacrosse seawill<br />\ntificial<br />\nonly<br />\ntees<br />\ninterfere with and is more flexible.<br />\ndency of the committee,\" said<br />\ncrowd to start a successful season.<br />\nTwo<br />\nof their games in the<br />\nthe<br />\nkick-off.<br />\nThis<br />\nchange has<br />\nCoach Van Orman, commenting<br />\nAlthough many people declared son tomorrow. The probable last week<br />\nwere<br />\nbeen<br />\nadopted<br />\nin<br />\norder to avoid<br />\ncompelled to suron the recent changes made by<br />\nthat the use of gas as a means of line-up is: O'Connor, lb.; Thom- render to<br />\nthe elements. One was<br />\nthe Rules Committee, \"to revise wasting time in setting up tees<br />\nillumination and heat woould de- as, 2b.; King, ss.; Ashton, 3b.; to have been<br />\nplayed with L'Hironthe rules from year to year solely during a game. The kick-off may<br />\ncrease<br />\nas the use of electricity in- Keen, if.; Schact, cf.; Marrian or delle<br />\nClub last Saturday, and the<br />\nfor the purpose of speeding up the now appear to be difficult, but I<br />\ncreased, Mr. Cook stated that in Smith, rf.; Holland, c.; Winken- other one<br />\nwas scheduled for the<br />\ngame. Although the new revision believe this will be overcome by<br />\nthe last eight years the gas in- werder or Marrian, p.<br />\nfollowing Wednesday. As a conof the rules may appear to be more practice. Moreover, the disdustry has increased as much as<br />\nsequence, they are looking forward<br />\ndrastic, yet the spectator will advantage without the tee is parin the preceding century.<br />\nto their first fray with considerable<br />\nscarcely notice any change in the tially compensated by the fact that<br />\nLOST<br />\nThe greater part of Mr. Cook's<br />\nanticipation.<br />\ngame. In fact, some of the the ball will be kicked from the<br />\n$80.— Somewhere on<br />\nchanges are so minor in impor- 50 instead of the 40 yard line— address was devoted to an exThis year, the Red Eagles numCampus April 1st.<br />\nplanation,<br />\nin<br />\ndetail,<br />\ndistance<br />\nof<br />\nshortening<br />\nthe<br />\nthe<br />\nthereby<br />\noperbe<br />\nto<br />\nneed<br />\nfew<br />\ntance that only a<br />\nber about forty men. Although<br />\nFinder please notify Shelby Carr<br />\ndiscussed as these are indeed by 10 yards in favor of the defen- ation of the Consolidated Gas and<br />\nblacklisted students are forbidden<br />\nand receive reward. Box 72.<br />\nElectric<br />\nCompany.<br />\nContinued on page 4, col. 3<br />\nSplendid alterations.<br />\nContinued on page 3, col. 2<br />\n<br />\nSPRING SPORT SEASON TO<br />\nOPEN TOMORROW; ALUMNI<br />\nAND GALLAUDET TO BE FACED<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 4, 1924<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nFELLOWSHIP DINNER HELD<br />\nContinued from page 1<br />\n<br />\nFOR THE STUDENTS<br />\n<br />\nFor<br />\nFOUNTAIN<br />\nPENS<br />\n<br />\nFor<br />\nGENERAL<br />\nUSE<br />\n<br />\nFreshman Reception was held on Bring This to the Address Below<br />\nOctober 4, when the 1927 class When You Want Anything in the<br />\nDRUG LINE<br />\nfound itself launching forth upon<br />\nSold by<br />\nSTATIONERS, DRUG AND<br />\nthe sea of a college career. The<br />\nSubscription<br />\nDEPARTMENT STORES<br />\n$2.00<br />\nHandbook was published and R.G.Loy & Company<br />\neight hundred copies distributed<br />\n(Robert G. Loy)<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nto the students.<br />\nThe Reading<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPHARMACISTS<br />\nBoys, the place to get your<br />\nRoom in the \"Barn\" has been<br />\nUNIVERSITY PARKWAY<br />\nmeals—and they are honAt Charles St.<br />\nPublished semi-weekly from October to June by the students of Johns furnished with games, magaest-to-goodness meals, well<br />\nHopkins University.<br />\nzines, and a piano—entirely for<br />\nerve d, and reasonably<br />\ns<br />\nthe use of the students. A Room1<br />\na<br />\npriced—is at<br />\nBusiness communications should be addressed to the BUSINESS MAN- ing Bureau has been maintained<br />\na<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications to supply the demand for respecshould be sent to the MANAGING EDITOR.<br />\ntable rooming and boarding<br />\nhouses in the neighborhood, and<br />\na<br />\nTelephone<br />\nHomewood 100 the Lost and Found Bureau has<br />\nCLOTHIERS<br />\nfunctioned well. The Y Office,<br />\nmoreover, has served as a UniHABERDASHERS<br />\nEditor-in-Chief<br />\nBusiness Manager<br />\n1817 N. Charles St.<br />\nversity<br />\nInformation<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nBureau.<br />\nPHILIP W. HOWARD, '25<br />\n(Half Block below North Ave.)<br />\nHaving provided for the CamManaging Editor<br />\nCharles St. North<br />\n315<br />\npus as a whole, the Y next foALGER HISS, '26<br />\nAdvertising Mana er<br />\nNicholas Brown, Mgr.<br />\ncused<br />\nits attention upon the ForAssistant Managing Editor<br />\nA. J. McKAY,'26<br />\neign Students within our ranks.<br />\nERNEST A. STRATHMAN, '26<br />\nA Foreign Student Reception was<br />\nAssociate Editors<br />\nCirculation Manager<br />\nJOHN W. PARSONS,'25<br />\nheld early in the year for the<br />\nOTHO J. KELLER, III, '26<br />\nBENJAMIN T. ROME,'25<br />\nmore<br />\nthan one hundred foreign<br />\nARTHUR L. NELSON, '26<br />\nstudents in the various Hopkins<br />\nAssistant<br />\nManagers<br />\nBusiness<br />\nJunior Editors<br />\nschools and the other schools of<br />\nEDWARD O. MICHEL, '26<br />\nG. DONALD GIESKE,'25<br />\nJAMES YOUNG, '25<br />\nthe city. At this time the CosJ. JACKSON KIDD, '26<br />\nHENRY R. TURNBULL, '26<br />\nmopolitan Club of Baltimore was<br />\nT. STRAN SUMMERS. '25<br />\nHAROLD S. GOODWIN, '26<br />\nA. RISLEY ENsoR, '26<br />\nreorganized, and it has held biHEYWARD E. BOYCE, JR., '27<br />\nmonthly meetings at the Friends<br />\nMeeting House with an average<br />\nMember Southern Intercollegiate Newspaper Association<br />\nattendance of fifty. An International Thanksgiving Dinner was<br />\ngiven to students from twentyPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nfive nations at the Central Y with<br />\nthe co-operation of this AssociaHOMEWOOD, BALTIMORE, MD., APRIL 4, 1924<br />\ntion. We have also arranged at<br />\ndifferent times for the entertainment of foreign students in private homes of the community.<br />\nBy way of Church Co-operaTHE GOLD-DIGGER<br />\n\"Gold-digger\" is one of those recently-coined words so displeas- tion we have prepared a Church<br />\ning to the ears of English scholars. It is usually applied to members preference list from which we<br />\nof the female sex, is defined as one who tries to receive the most with have sent to the neighborhood<br />\ntyle: \"Distinctive or characterthe least return and implies a parasite or a sponger. The exact ori- churches the names and addressistic mode\" (Webster). Might<br />\ngin of the term gold-digger is not known. Although it may have es of the out-of-town Hopkins<br />\nstudents<br />\ntheir<br />\nrespective<br />\nof<br />\ndehad its beginning in the Bowery, the expression is applicable to some<br />\nbe shortened to \"Stetson\" in<br />\ntypes found on every college campus. The college need not neces- nominations. On October 12<br />\nspeaking of hats.<br />\nsarily be co-educational. Hopkins is not a \"co-ed\" university, but, was held the inter-Church Reception<br />\nfor<br />\nall out-of-city students,<br />\nsad to say, it has its gold-diggers.<br />\nand this led to a succession of<br />\nCollege gold-diggers may be divided roughly into two classes. individual denominational<br />\nrecepOn the one hand is the grind. He sneaks to his class and when this<br />\ntions in various churches.<br />\nis over he sneaks away, ever greedy for knowledge, taking all his<br />\nThe Y has further served the<br />\nuniversity will give, and yet returning nothing. The second type,<br />\ncommunity this year through the<br />\nmore numerous, more objectionable and less popular, is the variety<br />\ndeputation teams and social se.rvof parasite which lives on the labors and good will of his fellow stuContinued on page 4, col. 2.<br />\ndents. He censures the majority of undergraduate activities, condemns many as having no place in college life and comments on the<br />\ninefficiency of student managers in general. This type receives the<br />\ncollege publications from his mail box, devours them hurriedly, but<br />\nnever enjoys or appreciates them. Always the papers are thrown<br />\naway in dis.),ust,<br />\nthe act accompanied by an exclamation on their extremely mediocre character, or on their being far inferior to the publications of another college and always—\"Well, I could have done<br />\nbetter myself.\" Members of this class never compete for athletic<br />\nteams. They dote on their inability to participate. However, usually they attend some games and then choose the best seats in the rooting section, but they are never caught cheering.<br />\nFOUNDED 1897<br />\n<br />\nPayne &Merrill<br />\n<br />\nThe St. REGIS<br />\nRESTAURANT<br />\n<br />\nN<br />\n<br />\nS<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n<br />\n\"What a whale ofa difference<br />\n<br />\njust afew cents make!\"<br />\n<br />\nWhen questioned as to their university spirit, gold-diggers pour<br />\nforth a sad tale and bewail that no opportunity is offered them. When<br />\na time comes, however, such as in the season ticket sale campaign,<br />\nwhen they might conveniently prove their worth, they throw up their<br />\nhands in horror and again become conspicuous by their failure to support. It is regrettable that the Hopkins campus has to boast of so<br />\nmany members of the gold-digger species that it becomes necessary<br />\nto extend the season ticket sale campaign beyond the allotted time.<br />\n<br />\nDANCES RESUMED<br />\nTo remedy an ill, first remove the cause. It seems evident that<br />\nthe plan of the Student Council to bar outsiders, except as guests of<br />\nHopkins men, and to supervise conduct at dances on the campus<br />\nwill eliminate all cause for future misdemeanors. As a whole, the<br />\ncampus feels that supervision has been placed in the proper hands<br />\nand rejoices that dances are again to be held.<br />\nA clause in the constitution of the Student Council explains<br />\nthat the Honor System extends to all matters on the campus that a<br />\nslip of gentlemanly conduct is as serious a violation of the Honor<br />\nSystem as \"cribbing\" in an examination. There is prevailing on the<br />\ncampus a hazy conception of the exact nature and provisions of the<br />\nStudent Council. For this reason, the News-Letter will publish the<br />\nStudent Council's constitution in a subsequent issue.<br />\n<br />\n—all the difference<br />\nbetween just an ordinary cigarette<br />\nand— FATIMA, the most skillful<br />\nblend in cigarette history.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, APRIL 4, 1924<br />\n<br />\nRAL<br />\n<br />\nur<br />\nn;11<br />\nly<br />\n<br />\nIS<br />\n<br />\nSHAKESPEAREAN WEATHER—APRIL FIRST IN<br />\nHARMONY WITH APRIL FOOL TRADITIONS<br />\nIt is not often that the elements<br />\ncombine with human invention in<br />\nplacing emphasis on a certain fact<br />\nor tradition. Only in Shakespearean plays do we really look for a<br />\nsympathy of the heavens with the<br />\ncourse of human events. But last<br />\nTuesday the great stage in which<br />\nwe live, the great drama of which<br />\nwe are a part, was in complete<br />\nharmony with a human tradition<br />\n—April Fool's Day.<br />\nDriven by a biting northeast<br />\nwind that swept the Hopkins<br />\ncampus, a snow that assumed blizzard proportions quickly concealed the fresh, green grass,<br />\n<br />\nturned automobiles into fantastic<br />\nwhite objects suggestive of Arab<br />\ngenii, and blanketed every object<br />\nexposed to the sky in a heavy<br />\nmantle. April, the month of<br />\nshowers, April, the month of cool<br />\nmornings and balmy noondays,<br />\nApril, commonly termed a Spring<br />\nmonth, started like December!<br />\nBut therein lies the sympathy of<br />\nthe elements. If Shakespeare had<br />\nseen the conditions on Tuesday,<br />\nhe would have exclaimed, \"Well<br />\ndone! It is fitting that on April<br />\nFool's Day men be fooled.\"<br />\nHow many, we wonder, appreciate the true dramatic qualities<br />\nof Tuesday's snow?<br />\n<br />\nHOPKINS TEAM DEFEATS C. E. HALL TO BE SCENE OF<br />\nBALL UNDER AUSPICES OF<br />\nGEORGETOWN MARKSMEN<br />\nMILITARY DEPARTMENT<br />\nTomorrow night the Military<br />\nIn a match held on the Hopkins<br />\nrange Saturday afternoon, the Department of the University will<br />\nJohns Hopkins rifle team defeat- hold a Military Ball in the C. E.<br />\ned Georgetown University by an<br />\nHall. This affair will be the first<br />\nample margin.<br />\nits kind to be held at Homeof<br />\nThe Georgetown team is considered one of the -best in the wood.<br />\nBecause of the size of the hall<br />\ncountry, having placed fifth in the<br />\nintercollegiate shoot, staged under the Military Department has dethe auspices of the National Rifle cided to restrict the attendance to<br />\nAssociation.<br />\nthe Junior and Senior members of<br />\nThis is the second time Georgethe R. 0. T. C. unit and certain<br />\ntown has gone down to defeat<br />\nfaculty who<br />\nunder the fire of the Hopkins of the University<br />\nmarksmen, the first occasion be- have been specially invited.<br />\nAs the ball is to be a formal<br />\ning at New York earlier in the<br />\nyear.<br />\nmilitary affair, the members of the<br />\nAlthough the Hopkins riflemen R. 0. T. C. unit will all be in unionly took twentieth place in the form. There seems to be a slight<br />\nintercollegiates they have shown tendency, on the part of the Juhigh ability and are thought to niors who are not commissioned<br />\nhave an excellent chance of win- officers, not to buy tickets. Lieuning the match next year.<br />\ntenant Sherwood appealed to the<br />\nTo prevent the match lasting Junior class last Monday to get<br />\ntob long the time limit plan was behind the affair and support it.<br />\nused, a minute being allowed for He said the only reason he could<br />\neach shot. Major T. A. McBride see for the Junior non-coms not<br />\nand Captain W.I. Morrow, of the buying tickets was that they did<br />\nThird Corps Area Headquarters, not have the officers' belts.<br />\nwere the judges of the match.<br />\nNeedless to say, drinking will<br />\nEarlier in the week the team not be tolerated at the dance. The<br />\nlost by twelve points to the Uni- Military Department had quite a<br />\nversity of California.<br />\nbit of trouble in obtaining the use<br />\nThe targets for the match with of the C. E. Hall due to the fact<br />\nOregon have arrived and will be that some of the dances held there<br />\nshot off some time this week.<br />\nlately have not been a credit to<br />\nThe results of the matches with the University. The military office<br />\nGeorgetown and California are as promises, however, that the dance<br />\nfollows:<br />\nwill not be boring even to those<br />\n347 who must \"imbibe of the cup<br />\nWilgis (capt.)<br />\n355 that cheers\" to enjoy themselves.<br />\nKaufman<br />\n353<br />\nMuir<br />\nThe tickets are moderately<br />\n361<br />\nMount<br />\npriced, $2.50, and it will be a<br />\n365<br />\nL'Allemand<br />\nHopkins crowd as tickets are not<br />\nbeing sold to men who are not<br />\n1781 members of the University. If<br />\nTotal J. H U<br />\n1755<br />\nGeorgetown<br />\nthis ball is a success, the Military<br />\n190 Department plans to make the<br />\nMichael<br />\n188<br />\nL'Allernand<br />\ndance an annual event.<br />\n..186<br />\nMuir ............<br />\n186<br />\nKaufman<br />\nSPRING SPORTS TO OPEN<br />\nTOMORROW<br />\n186<br />\nMount<br />\n<br />\nALWAYS USE A<br />\n<br />\nYELLOW CAB<br />\nOR PHONE<br />\n<br />\nVERNON 1212<br />\n<br />\nGRADUATES<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nSENIORS and graduate students in all courses are<br />\ninvited to confer with representatives of the Bell Milano and handmade and many<br />\nTelephone System, who will be at the<br />\nOthers at<br />\nThe Barn<br />\nMECHANICAL BUILDING<br />\nRoom No. 109<br />\n<br />\non<br />\nFRIDAY, APRIL 4, 1924<br />\nat 12:30 P. M.<br />\nTHE BELL SYSTEM, which is composed of the American<br />\nTelephone and Telegraph Company, the 25 associated<br />\noperating telephone companies, and the Western Electric<br />\nCompany, offers a wide choice of work and location to<br />\nqualified men.<br />\n<br />\ne)<br />\nfieXatteri<br />\nCet<br />\n—Nrif<br />\nG.Lo<br />\naS<br />\nZ<br />\n- t<br />\nli.<br />\nopmmilo<br />\nw<br />\nCARofr,<br />\n,<br />\n&NOS<br />\neieFI<br />\n:<br />\n<br />\n29<br />\n<br />\nE. BALTIMORE<br />\n<br />\nST.<br />\n<br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br />\n<br />\nLIBERTY ST.<br />\nAT SARATOGA<br />\n<br />\nThe maintenance, operation and business administration of this great system, the engineering and building<br />\nfor its growth all create new problems to solve and<br />\nreal opportunities for men who can qualify.<br />\n<br />\nLUNCHEON<br />\nTEA<br />\nDINNER<br />\n11.30 A. M.<br />\nuntil<br />\n7.30 P. M<br />\n<br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br />\n<br />\nEDMUND HALLEY<br />\n1656-1742<br />\n<br />\nSon of a London soap-boiler<br />\nwho became AstronomerRoyal. At the age of 20 headed<br />\nan expedition to chart the stars<br />\nof the Southern hemisphere.<br />\nFinanced and handled the<br />\nprinting of Newton's immortal<br />\nPrincipia.<br />\n<br />\nThe cometcame back<br />\nThe great comet that was seen by William<br />\nof Normandy returned to our skies in 1910<br />\non its eleventh visit since the Conquest.<br />\nAstronomers knew when it would appear,<br />\nand the exact spot in the sky where it<br />\nwould first be visible.<br />\nEdmund Halley's mathematical calculation of the great orbit of this 76-year visitor—his scientific proof that comets are<br />\npart of our solar system—was a brilliant<br />\napplication of the then unpublished Principia of his friend Sir Isaac Newton.<br />\n<br />\nContinued from page 1<br />\n<br />\n936 to play, the team is thought to be<br />\n948 stronger than usual. The Eagles<br />\nbelieve themselves capable of takPOSITIONS WANTED<br />\ning the measure of any team of like<br />\nA local credit company wants caliber.<br />\nThe Varsity will probably lineseniors to begin part time work<br />\nwhich may continue through the up as follows:<br />\nsummer and lead to permanent<br />\nGoal—S. Cone or Love.<br />\npositions. Work in the local conPoint—Bachman.<br />\nnathe<br />\nin<br />\nplace<br />\na<br />\nto<br />\nCover<br />\nlead<br />\ncern may<br />\nPoint—Milburn or Levy.<br />\nFirst Defense—Barton.<br />\ntional organization of which it is<br />\nSecond Defense—Benedict.<br />\na branch. An insurance company<br />\nThird Defense—Watson or Vomakes practically the same offer<br />\nfor both seniors and underclass- gel.<br />\nmen.<br />\nCenter—Summers or Kaufholz.<br />\nThird Attack—Robinson.<br />\nNumerous sales positions are<br />\nSecond Attack—Aaronson or<br />\nopen in a variety of branches, ofMorrell.<br />\nfering commissions and prizes.<br />\nFirst Attack—Turnbull (Capt.)<br />\nFurther information may be obGil215<br />\nFrench,<br />\ntained from Dr.<br />\nOuthome—Sanderson or Bates.<br />\nman Hall.<br />\nInhome—McDaniel.<br />\n<br />\nHAIL THEM ANYWHERE<br />\n<br />\nTotal, J. H. U<br />\nCalifornia<br />\n<br />\nAs spectacular as a<br />\ncomet has been the<br />\nworld's electrical development. By continuous<br />\nscientific research the<br />\nGeneral Electric Company has accelerated<br />\nthis development and<br />\nhas become a leader in<br />\nthe industry.<br />\n<br />\nThe laws of motion that Newton and<br />\nHalley proved to govern the movements<br />\nof a comet are used by scientists in the<br />\nResearch Laboratories of the General Electric Company to determine the orbit of<br />\nelectrons in vacuum tubes.<br />\n<br />\nGENERAL ELECTRIC<br />\n'<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 4, 1924<br />\n<br />\n4<br />\n•<br />\n<br />\n4111•MMII,<br />\n<br />\nSOPHISTICATED<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from \"Vaseline\"Hair Tonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br />\n<br />\nVaseline<br />\nHAIR TONIC<br />\nChesebrough Mfg.Co.<br />\n(consolidated)<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nCOGGINS'<br />\nTransfer & Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br />\n<br />\nHOTOM 01111,2<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n'p1 P141I)11P14P!1 p14 riftm4.•1,4.,1:4•14<br />\n<br />\nA. JACOBS & SONS<br />\nTailors<br />\nUniforms and Liveries<br />\n128 W. FAYETTE ST.<br />\nBaltimore, Md.<br />\nNear Liberty St.<br />\n<br />\nFELLOWSHIP DINNER HELD<br />\nContinued from page 2<br />\n<br />\ncussion groups in the new Dormitory, and by close co-operation<br />\nice department. Teams of two with the Christian Service Club<br />\nto five men have gone out on dep- in their activities of recruiting for<br />\nutation work in the city and sub- Christian life service. One hunurbs on numerous occasions, and dred and twenty-five students<br />\nabout twenty-five students have have become active members of<br />\nbeen placed as leaders of Boys' the Y thereby subscribing to the<br />\nClubs, Sunday School teachers, truly Christian principles of the<br />\nand special workers for social Association and many of them<br />\nservice institutions of the city.<br />\nare definitely lined up in some<br />\nThe more definite religious form of active service.<br />\nThis has been a year of Conferwork of the Association has consisted of securing special speak- ences and Conventions pertaining<br />\ners occasionally for the Assem- to various phases of \"Y\" work.<br />\nbly, arranging for a series of dis- The selection of men as delegates to intercollegiate conferences is one of the most vital<br />\nBIRDERS functions<br />\nPRIRTERS<br />\nETIGRAVERS<br />\nof the Y Cabinet. During this passing year the Hopkins<br />\nY sent twelve students, accompanied by Dr. J. C. French of the<br />\nfaculty, to the Students' Conference at Silver Bay, New York;<br />\nfive of the retiring cabinet attended the State Officers' Training Conference at Western Maryland College last spring; the retiring President as a member of<br />\nthe Middle Atlantic Field Council of the Y attended a meeting of<br />\nthat Council at Drew Theological Seminary during the winter;<br />\nnine delegates represented Hopkins at that memorable InternaPrinters of<br />\ntional Student Volunteer ConvenGthe Johns Hopkins<br />\ntion at Indianapolis; and twentyseven men attended the Tri-State<br />\nNEWS,-LETTER<br />\nStudent Volunteer Conference at<br />\nHood College in February.<br />\nLOMBARD and SOUTH STREETS<br />\nThe outstanding feature of our<br />\naccomplishments this year was<br />\nthe innovation of the monthly<br />\nEstablished 1873<br />\nFellowship Dinners which have<br />\nA. H. FETTING MAN'FG<br />\nbeen held at the Friends' MeetJEWELRY CO.<br />\ning House for the members and<br />\nManufacturers<br />\ntriends of the Association and at<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md. .vhich there has been an average<br />\nattendance of fifty students.<br />\nThe Flag, Banner & Pennant Shop These dinners have been truly<br />\nfellowship affairs, but at each of<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands, them some noted speaker has<br />\nEmblems, Silk Banners for Schools,<br />\nternoon when they encounter<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD. some outstanding Christian probR. H. Taylor lem.<br />\nVernon 2355<br />\nSHIRT MAKER<br />\nVAN ORMAN GIVES OPINION<br />\n226 N. Liberty St.<br />\nContinued from page 1<br />\nDress Shirts. ..$3.00, $3.50 and $4.00<br />\nNegligee<br />\n$3.30 and $4.40 sive<br />\nside.<br />\nImported Madras<br />\n$5.50 and $6.60<br />\nrerms Cash, Less 10% 30 days on Shirts<br />\n\"The decision to place the ball<br />\nAlso a Full Line of Men's<br />\n<br />\nSTRATTON<br />\n<br />\nURNER'S<br />\nMEN'S SHOES<br />\n<br />\nIf you knew<br />\nwhat ageing in wood<br />\ndoes for pipe tobacco<br />\n<br />\nvc<br />\n<br />\nIN<br />\n<br />\nPal<br />\n<br />\nEven the finest Kentucky<br />\nBurley Tobacco (and that's the<br />\nkind we use) is green and raw<br />\nwhen it'spulled. You could hardly<br />\nsmoke one pipe load of it.<br />\nAnd here's where Velvet is different: Our ageing takes out that<br />\nrawness and harshness, and<br />\nmakes the tobacco mild and mellow and gives it fine flavor. Ageing in wood does what no artificial<br />\ntreatment can do.<br />\nRemember —Velvet Tobacco<br />\naged in wood.<br />\n<br />\ncai<br />\nov<br />\n19;<br />\nfra<br />\nlas<br />\nth<br />\nag<br />\nbo<br />\npr<br />\nof<br />\nqu<br />\nru<br />\nwI<br />\nre<br />\n<br />\nLIGGETT & MYERS TOBACCO Co.<br />\n<br />\nni<br />\ndi<br />\nth<br />\nhi<br />\nvv:<br />\nse<br />\n<br />\nHub<br />\n<br />\nCC<br />\nte<br />\na<br />\nU.]<br />\nti,<br />\n<br />\nBaltimore's Great Men's Store<br />\n<br />\n01<br />\nni<br />\n<br />\nCri<br />\n<br />\nSC<br />\n<br />\n11;<br />\n<br />\nMount Vernon Place M.E.Church<br />\n<br />\nei<br />\nhi<br />\nc(<br />\n<br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nPROGRAM FOR STUDENTS<br />\n<br />\nt(<br />\nBIBLE CLASS, 10 A. M.<br />\nAn Interesting Discussion of<br />\nVital Topics Under<br />\nDR. HOWARD A. KELLY, Leader<br />\n<br />\n11<br />\n<br />\na<br />\n<br />\nYOUNG PEOPLES AT-HOME<br />\n5-7 P. M.<br />\n<br />\non the 3 yard line instead of the S<br />\nTEA SERVED AT 6 O'CLOCK<br />\nyard after a touchdown has been<br />\nCollege and Fraternity Stationery<br />\nOf the Better Class<br />\nEPWOR1 H LEAGUE<br />\nBanquet and Dance Cards, Invitations done with the idea that the team<br />\nURNER BROTHERS<br />\n7-8 P. M.<br />\n%%rill play a running or passing<br />\nJAS. H. DOWNS<br />\n1 1 1 E. BALTIMORE STREET<br />\nENGRAVER PRINTER STATIONER move for the extra point. As the<br />\nBaltimore<br />\nSPECIAL STUDENTS AT-HOME<br />\n229 N. CHARLES ST.<br />\nkick is the most direct and a safer<br />\nFEBRUARY 17<br />\nway of scoring the point, this will<br />\nnot be a handicap to the kicker in<br />\nCOME DOWN AND<br />\nthis respect.<br />\nGET ACQUAINTED<br />\nAt the Washington Monument<br />\n\"The increase of penalty from<br />\nFOR<br />\nTRAINS<br />\nTHE SCHOOL OF RETAILING<br />\ntwo to five yards for more than<br />\nEXECUTIVE POSITIONS<br />\nthree times out each half is an<br />\nexcellent point. When a team is<br />\nTEACHING<br />\nMERCHANDISING<br />\nPERSONNEL<br />\nSERVICE<br />\nTRAINING<br />\nADVERTISING<br />\nwithin a short distance from their<br />\ngoal, there seems to be a tendenFINANCE AND CONTROL<br />\nMerchants Are Eager to Secure Trained Men and Women in These Fields.<br />\ncy of delaying the game. But this<br />\nSERVICE FELLOWSHIPS<br />\nincrease in the penalty will elimiCLASSROOM AND STORE ARE LINKED CLOSELY TOGETHER<br />\nnate this 'stalling' for time.<br />\nIllustrated booklet on application. For further information write<br />\n\"The gun shot at the end of<br />\n.TWCorzzerayelie and Cutaw Sis.<br />\nDR. NORRIS A. BRISCOE<br />\neach quarter is a good factor in<br />\nDIRECTOR OF NEW YORK UNIVERSITY SCHOOL OF RETAILING<br />\n-Where Wholesale and Retail Districts Meet\"<br />\ndesignating the definite end of<br />\nNEW YORK CITY each period in the game. Before100 WASHINGTON PLACE<br />\nhand, the monotony of the whistle<br />\nused after each play and quarter<br />\nhas misled the spectators who<br />\nPRESCRIPTION DRUGGISTS<br />\nwould rush out into the field<br />\nthinking<br />\nthat the game was finTWO STORES:<br />\nEutaw Place and North Ave. ished when it was simply the end<br />\nCharles and Chase Sts.<br />\nof a play. This rush naturally deMadison 0405<br />\nVernon 0890<br />\nand individuality is offered here at prices that are not<br />\nlays the game.<br />\nand cannot be underquoted by any house at any time.<br />\n\"Of all the new changes, I beC.Besides the reputation of an old-established firm<br />\nlieve<br />\nthat there is only one which<br />\nis back of each sale with a guarantee.<br />\nThe Greetings of a Fine Store<br />\nmay prove to be unsatisfactory.<br />\nThere<br />\nUniversity<br />\nFine<br />\nStudents<br />\nof<br />\na<br />\nwill be more power grantTo the<br />\ned to the referee. In the past it<br />\nDECORATIONS<br />\nDRAPERIES<br />\nseems that the referee has been FURNITURE<br />\n343<br />\nNORTH<br />\nCHARLES<br />\nSTREET<br />\noverburdened with duties.\"<br />\n<br />\nNew York University School of Retailing<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nHYNSON, WESTCOTT and DUNNING<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP 8z SONS<br />\n<br />\nHOCHSCHILD.KOHN 8ic Co.<br />\n<br />\n1<br />\n<br />\n\f", "format": "basic_html", "processed": "/<br /><br />\n0 LA<br /><br />\nF<br /><br />\n0<br /><br />\n,<br />\n4<br /><br />\n•<br /><br />\n7.<br /><br />\nVT<br /><br />\nVOL. XXVIII, No 47<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 4, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nCAMPUS DANCES RESUMED FELLOWSHIP DINNER HELD; RETURNS FROM SPRING<br />\nSEASON DRIVE DISAPPOINT<br />\nSUCCESS DESPITE THE<br />\nWITH CONSENT OF<br />\nWEATHER<br />\nTHE FACULTY<br />\nReturns, until a late hour WedStudent Council to Have Control of All Dr. Chan, Speaker, Asks: \"Can the Rest nesday, were extremely discouragof the World Advance Without<br />\nAffairs. Outsiders Banned<br />\ning, according to Graduate ManChina?\" President Reads Report<br />\nin the Future<br />\nFirst Opposition for Lacrosse and Baseball Squads Comes in Tomorager Keyes. At that time Barton<br />\nrow's Clashes. Alumni Expected to Prove<br />\nIn<br />\nspite<br />\nof<br />\nthe<br />\nheavy<br />\nsnowfall<br />\nAuthorities of the University<br />\nwas the leading individual salesTougher Foe Than Mutes<br />\nstudent<br />\norand<br />\nthe<br />\ndate,<br />\nApril<br />\nabout<br />\nfifty<br />\n1,<br />\nhave decided to allow<br />\nman with $135, Turnbull was secganizations to hold dances on the undergraduates attended the Y. M.<br />\nTomorrow the spring sports schedule will be started in full<br />\nond several tickets behind. Phi<br />\ncampus, thereby removing the re- C. A. Fellowship Dinner last Tues- Kappa Psi<br />\nforce,<br />\nweather permitting, with a gala day at Homewood Field,<br />\nwith $365 still was the<br />\ncent ban. All dances will be under day at the Friends' Meeting House.<br />\nwhen<br />\nthe<br />\nAlumni lacrosse team meets the varsity stick wielders on<br />\nhigh team and Pi Kappa Chi held<br />\nthe direct supervision of the StuMr. T. R. Marsh was introduced second<br />\nthe<br />\nsame<br />\nbill<br />\nthat brings Gallaudet and her silent warriors to Hopplace. The total sale Weddent Council, which body has ar- by R. C. Tilghman, the toastmaskins<br />\nthe Black and Blue nine in its opening game. Both<br />\nto<br />\nencounter<br />\nnesday afternon was just a little<br />\nranged a formula to be complied ter, and gave a short report in the<br />\nof the Black and Blue teams have been handicapped in their pracover $1,100.<br />\nwith in order to obtain permis- form of a summary of the work<br />\ntice by the late spring. At the time this goes to press lacrosse and<br />\nAll figures are much below last<br />\nsion to hold a dance.<br />\ndone throughout the year.<br />\nbaseball sound like words from an alien tongue as the athletic fields<br />\nAfter the conduct of two recent Dr. P. C. Chan, the speaker of year's. The athletic authorities are covered with a six-inch blanket of snow.<br />\ndances, at which the behavior of the evening, was next introduced Point out that whereas selling ends<br />\nparticipants was declared to be and gave a talk on China and her tomorrow all athletes engaged in<br />\nVarsity stick-wielders, led by<br />\nWhen the Hopkins baseball<br />\nunbecoming of Hopkins, the fac- relation to the rest of the world, spring sports will be in harness and team takes the field against Gal- \"Doug\" Turnbull, will open the<br />\nfit for action from now on; the laudet tomorrow, it will be with<br />\nulty placed a ban on all dances on and to America in particular.<br />\n1924 lacrosse season tomorrow aflong strenuous grind, which will a touch of confidence due to last<br />\nthe campus. The new plan is exThe general theme of his speech<br />\nternoon when they encounter<br />\npected to eliminate all complaint. was \"Can the rest of the world ad- not be terminated until the end of year's victory when the Black<br />\n\"Johnny\"<br />\nKnipp's alumni all-stars.<br />\nthe term, has begun.<br />\nThe organization holding the vance without China?\"<br />\nand Blue had only a mediocre<br />\nCaptain Knipp promises the vardance must first have its commit- \"If the Americans,\" said Dr. \"In view of the efforts put forth team. Meeting a more talented<br />\ntee chairman see the Dean in order Chan, \"do not get more exercise by the athletes,\" said Dr. Van Or- and experienced team than last sity squad as sturdy opposition as<br />\nto obtain the permission of the of the kind the Chinese coolie does, man,\"selling tickets with a trip to year's Gallaudet must present a the alumni have given in years.<br />\nfaculty. Next, after the Dean's children in fifteen or twenty gen- Europe as a possible reward is lit- formidable brand of baseball to<br />\nHis team has been strengthened<br />\nconsent is affixed to the applica- erations will be born without legs.\" tle enough for an undergraduate gain a victory over the Homeconsiderably<br />\nby a number of last<br />\nto do.\"<br />\ntion, he must go to the person in<br />\nwood nine. In spite of the lack<br />\nHe also pointed out that whereas<br />\nyear's graduates, and, consequentOf chief interest to undergradcharge of the building in which it the<br />\nof practice, the Black and Blue<br />\nUnited States coal and oil supuates as an outcome of this year's<br />\nly,<br />\nit should display unusual team<br />\nis to be held. Then, arrangements<br />\nhas been travelling at a lively clip<br />\nply is said to be nearly exhausted,<br />\nadvance sale of tickets for the seawith the engineer at the power there<br />\nunder the careful eye of Coach work. Numerous spring workouts<br />\nis one province in China<br />\nson is the possibility of starting a<br />\nhouse for lighting and heating are<br />\nBrockman. The pitching staff at L'Hirondelle Club should have<br />\nwhich alone can supply the world sinking fund for<br />\nthe much-needed,<br />\nmade.<br />\nparticularly will have to be reck- further added to the smoothness of<br />\nfor 1,000 years with these neces- long-sought<br />\ngymnasium. That<br />\nThe next step is to fill out the<br />\noned with by the visiting team. his already efficient machine.<br />\nsities of modern life.<br />\npresent indications point to a<br />\napplication to the Student CounDr. Chan's answer to the ques- speedy \"sinking\" of the sinking Winkenwerder, Marrian, Stuart<br />\nAccording to Coach \"Bill\"<br />\ncil. This includes name of organtion \"Why is China so slow and fund idea, was also pointed out. and McNeal, all dependable hurlhours,<br />\ndance,<br />\nof<br />\nization, place<br />\nSchmeisser, the former stars will<br />\nantiquated?\" is that the force of This feature of the sales had been ers, are each displaying different<br />\ncommittee in charge, and a list of<br />\nsuperstition has prevented China expected to draw strong under- styles of pitching, so that there by no means find the going easy.<br />\nthe chaperons.<br />\nfrom utilizing her natural resources. graduate support, so much discus- will be a variety of twirlers from They will be opposed by five regThe application is as follows:<br />\nThe influence of Christianity is ex- sion having been waged about the which the coach may make his ulars of last year. The remainder<br />\n\"The signer of this application<br />\nselection.<br />\npected to do away with the old gymnasium possibility.<br />\nof the team was chosen from a<br />\nagrees to be personally responsifears.<br />\nsquad<br />\nThe<br />\nof seventy-five aspirants.<br />\ninfield<br />\ncandidates<br />\nare<br />\nwagble for the conducting of the foreDr. Chan is going back to China<br />\ning<br />\na<br />\nCompetition<br />\nmerry<br />\nfor regular berths on<br />\nbattle<br />\nposifor<br />\nthe<br />\nmentioned dance, and will prethis fall and will establish a Chris- GAS SUPPLY EXPLAINED BY tions left vacant by last year's the team has been so keen that as<br />\nserve the following rules of the<br />\nLOCAL ENGINEER<br />\ntian community on a small tract of<br />\ngraduation. Captain Thomas at yet there is no definite certainty as<br />\nStudent Council:<br />\nland which he is going to buy. The \"Although natural gas may be second, and King, the flashy to who will have places in the line\"No. 1. The chaperons shall tract will be laid off in<br />\nlots ,as is distributed at a much lower rate shortstop, will form a great com- up when the first whistle blows.<br />\nconsist of at least_ one faculty done here, modern<br />\nhouses built and than that artifidially produced, it bination at the keystone sack, Last year's regulars who will<br />\nmember and his wife, also two a<br />\nchurch and a hospital will be in- should not be considered an un- while O'Conor is the most likely play again this year would make<br />\nother mature persons.(The Councluded. He will take charge of all qualified blessing,\" declared H. contender for first base, since Gil- a formidable nucleus for any team.<br />\ncil requires that all chaperons be<br />\nthe surgical work himself.<br />\nR. Cook, Jr., General Superinten- pin, his most formidable competi- If the alumni really expect to anoffered transportation to and from<br />\nThe President's report was as dent, Gas Operating Division, of tor, has injured his ankle while nex the varsity scalps they will<br />\nthe dance.)<br />\nfollows:<br />\nthe Consolidated Gas Flectric sliding to second on the soft have to furnish these men very<br />\n\"No. 2. Only alumni of the<br />\nThe<br />\nY.<br />\n!M.<br />\nC.<br />\nA.<br />\nat<br />\nthis<br />\nUniLight and Power Co., of Balti- ground last Thursday. The third stiff opposition. The five men who<br />\nUniversity, or students, or guests<br />\nversity<br />\nis<br />\ndrawing<br />\nto<br />\nthe<br />\nclose<br />\nof<br />\nmore.<br />\nbase position is giving Coach played on the championship team<br />\naccompanied by either, will be adits most successful year's activiMr. Cook made this statement Brockman unusual worry, having of 1923 and are again available this<br />\nmitted to the dance.<br />\nduring<br />\nties<br />\nmy<br />\ncollege<br />\nlife.<br />\nThe<br />\nin a lecture given before engi- failed to discover a suitable man year are: Bachman, Barton, Bene\"No. 3. Gentlemanly conduct<br />\nincreasing<br />\nstudent<br />\ninterest,<br />\norneering upperclassmen last Mon- to fill the vacancy. Ashton, dict, Turnbull and McDaniel.<br />\nas interpreted by the Council will<br />\nBad weather has proved to be<br />\nbe required at all times during the ganized and directed by our first day, March 24, on the Mechani- though a clever fielder with a<br />\nfull-time Secretary, Mr. E. A. cal Engineering Building. The good arm, is very weak at the bat, the most consistent jinx of this<br />\ndance.\"<br />\nThe faculty and Student Coun- Schaal, who has come to us from lecture, the second of a series of while Brian, on the other hand, year's squad. The heavy \"April<br />\ncil are unanimous in the belief Northwestern, has put new life lectures on \"Engineering Prac- seems to have his chief difficulty snows\" of the past week have extice,\" was entitled \"Supplying in fielding, but is a more reliable erted a particularly baneful influthat this new ruling, especially into this organization.<br />\nduty<br />\nof<br />\nthe<br />\nY<br />\nis<br />\nto<br />\nThe<br />\nfirst<br />\nthree,<br />\nwill<br />\nand<br />\neffectwo<br />\nbatter. Keen, the outfielder find ence on the attempts of the team<br />\nrules<br />\nGas to Baltimore.\"<br />\ntually prevent unbecoming con- serve the campus', and this ha<br />\nThe speaker then mentioned of the season, will probably re- to achieve perfect smoothness in<br />\nthrong',<br />\nbeen<br />\ndone<br />\nadequately<br />\nthe<br />\nHopkins'<br />\nmake<br />\nand<br />\nduct,<br />\nfive different kinds of commerci- ceive the left field assignment, their teamwork. Coach Schmeisser,<br />\ncritifrom<br />\nfree<br />\nThe<br />\nannual<br />\nvarious<br />\nchannels.<br />\nmore<br />\nonce<br />\ndances<br />\nal gas it is possible to use—nat- with Schact in center and Mar- however, made the best of it in subcol.<br />\n3<br />\n2,<br />\npage<br />\nContinued<br />\non<br />\nstituting frequent chalk-talks durcism.<br />\nural, oil, coke oven, carbonated rian or Smith in right field.<br />\ning the worst of the weather. On<br />\nwater, and coal gas. Of these the<br />\nLast Saturday's game with<br />\nthe whole, the elements have greatVAN ORMAN GIVES HIS OPINIONS OF<br />\nlocal concern, which is the larg- Drexel and a practice game with<br />\nLATEST VERSION OF FOOTBALL RULES<br />\nly hindered the necessary intensive<br />\nest operated by Mr. Cook's com- Poly were called off on account<br />\npractice.<br />\nHopkins Coach Favors All Changes But One Extending Powers of Referee. pany, uses carbonated water gas, of the weather, but Captain<br />\nBad weather has also deprived<br />\nGeneral Tendency is to Speed Up Ga me, Says Van Orman.<br />\nbecause it has the lowest cost of Thomas is hoping for a real<br />\nthe<br />\nRed Eagles of their opportunity<br />\n\"The<br />\nabolition<br />\nof<br />\ntenall<br />\nmud or ar- the various types of artificial gas, spring day and a real Hopkins<br />\n\"It seems to be the general<br />\nto<br />\nopen<br />\nthe Hopkins lacrosse seawill<br />\ntificial<br />\nonly<br />\ntees<br />\ninterfere with and is more flexible.<br />\ndency of the committee,\" said<br />\ncrowd to start a successful season.<br />\nTwo<br />\nof their games in the<br />\nthe<br />\nkick-off.<br />\nThis<br />\nchange has<br />\nCoach Van Orman, commenting<br />\nAlthough many people declared son tomorrow. The probable last week<br />\nwere<br />\nbeen<br />\nadopted<br />\nin<br />\norder to avoid<br />\ncompelled to suron the recent changes made by<br />\nthat the use of gas as a means of line-up is: O'Connor, lb.; Thom- render to<br />\nthe elements. One was<br />\nthe Rules Committee, \"to revise wasting time in setting up tees<br />\nillumination and heat woould de- as, 2b.; King, ss.; Ashton, 3b.; to have been<br />\nplayed with L'Hironthe rules from year to year solely during a game. The kick-off may<br />\ncrease<br />\nas the use of electricity in- Keen, if.; Schact, cf.; Marrian or delle<br />\nClub last Saturday, and the<br />\nfor the purpose of speeding up the now appear to be difficult, but I<br />\ncreased, Mr. Cook stated that in Smith, rf.; Holland, c.; Winken- other one<br />\nwas scheduled for the<br />\ngame. Although the new revision believe this will be overcome by<br />\nthe last eight years the gas in- werder or Marrian, p.<br />\nfollowing Wednesday. As a conof the rules may appear to be more practice. Moreover, the disdustry has increased as much as<br />\nsequence, they are looking forward<br />\ndrastic, yet the spectator will advantage without the tee is parin the preceding century.<br />\nto their first fray with considerable<br />\nscarcely notice any change in the tially compensated by the fact that<br />\nLOST<br />\nThe greater part of Mr. Cook's<br />\nanticipation.<br />\ngame. In fact, some of the the ball will be kicked from the<br />\n$80.— Somewhere on<br />\nchanges are so minor in impor- 50 instead of the 40 yard line— address was devoted to an exThis year, the Red Eagles numCampus April 1st.<br />\nplanation,<br />\nin<br />\ndetail,<br />\ndistance<br />\nof<br />\nshortening<br />\nthe<br />\nthe<br />\nthereby<br />\noperbe<br />\nto<br />\nneed<br />\nfew<br />\ntance that only a<br />\nber about forty men. Although<br />\nFinder please notify Shelby Carr<br />\ndiscussed as these are indeed by 10 yards in favor of the defen- ation of the Consolidated Gas and<br />\nblacklisted students are forbidden<br />\nand receive reward. Box 72.<br />\nElectric<br />\nCompany.<br />\nContinued on page 4, col. 3<br />\nSplendid alterations.<br />\nContinued on page 3, col. 2<br /><br />\nSPRING SPORT SEASON TO<br />\nOPEN TOMORROW; ALUMNI<br />\nAND GALLAUDET TO BE FACED<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 4, 1924<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nFELLOWSHIP DINNER HELD<br />\nContinued from page 1<br /><br />\nFOR THE STUDENTS<br /><br />\nFor<br />\nFOUNTAIN<br />\nPENS<br /><br />\nFor<br />\nGENERAL<br />\nUSE<br /><br />\nFreshman Reception was held on Bring This to the Address Below<br />\nOctober 4, when the 1927 class When You Want Anything in the<br />\nDRUG LINE<br />\nfound itself launching forth upon<br />\nSold by<br />\nSTATIONERS, DRUG AND<br />\nthe sea of a college career. The<br />\nSubscription<br />\nDEPARTMENT STORES<br />\n$2.00<br />\nHandbook was published and R.G.Loy &amp; Company<br />\neight hundred copies distributed<br />\n(Robert G. Loy)<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nto the students.<br />\nThe Reading<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPHARMACISTS<br />\nBoys, the place to get your<br />\nRoom in the \"Barn\" has been<br />\nUNIVERSITY PARKWAY<br />\nmeals—and they are honAt Charles St.<br />\nPublished semi-weekly from October to June by the students of Johns furnished with games, magaest-to-goodness meals, well<br />\nHopkins University.<br />\nzines, and a piano—entirely for<br />\nerve d, and reasonably<br />\ns<br />\nthe use of the students. A Room1<br />\na<br />\npriced—is at<br />\nBusiness communications should be addressed to the BUSINESS MAN- ing Bureau has been maintained<br />\na<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications to supply the demand for respecshould be sent to the MANAGING EDITOR.<br />\ntable rooming and boarding<br />\nhouses in the neighborhood, and<br />\na<br />\nTelephone<br />\nHomewood 100 the Lost and Found Bureau has<br />\nCLOTHIERS<br />\nfunctioned well. The Y Office,<br />\nmoreover, has served as a UniHABERDASHERS<br />\nEditor-in-Chief<br />\nBusiness Manager<br />\n1817 N. Charles St.<br />\nversity<br />\nInformation<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nBureau.<br />\nPHILIP W. HOWARD, '25<br />\n(Half Block below North Ave.)<br />\nHaving provided for the CamManaging Editor<br />\nCharles St. North<br />\n315<br />\npus as a whole, the Y next foALGER HISS, '26<br />\nAdvertising Mana er<br />\nNicholas Brown, Mgr.<br />\ncused<br />\nits attention upon the ForAssistant Managing Editor<br />\nA. J. McKAY,'26<br />\neign Students within our ranks.<br />\nERNEST A. STRATHMAN, '26<br />\nA Foreign Student Reception was<br />\nAssociate Editors<br />\nCirculation Manager<br />\nJOHN W. PARSONS,'25<br />\nheld early in the year for the<br />\nOTHO J. KELLER, III, '26<br />\nBENJAMIN T. ROME,'25<br />\nmore<br />\nthan one hundred foreign<br />\nARTHUR L. NELSON, '26<br />\nstudents in the various Hopkins<br />\nAssistant<br />\nManagers<br />\nBusiness<br />\nJunior Editors<br />\nschools and the other schools of<br />\nEDWARD O. MICHEL, '26<br />\nG. DONALD GIESKE,'25<br />\nJAMES YOUNG, '25<br />\nthe city. At this time the CosJ. JACKSON KIDD, '26<br />\nHENRY R. TURNBULL, '26<br />\nmopolitan Club of Baltimore was<br />\nT. STRAN SUMMERS. '25<br />\nHAROLD S. GOODWIN, '26<br />\nA. RISLEY ENsoR, '26<br />\nreorganized, and it has held biHEYWARD E. BOYCE, JR., '27<br />\nmonthly meetings at the Friends<br />\nMeeting House with an average<br />\nMember Southern Intercollegiate Newspaper Association<br />\nattendance of fifty. An International Thanksgiving Dinner was<br />\ngiven to students from twentyPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nfive nations at the Central Y with<br />\nthe co-operation of this AssociaHOMEWOOD, BALTIMORE, MD., APRIL 4, 1924<br />\ntion. We have also arranged at<br />\ndifferent times for the entertainment of foreign students in private homes of the community.<br />\nBy way of Church Co-operaTHE GOLD-DIGGER<br />\n\"Gold-digger\" is one of those recently-coined words so displeas- tion we have prepared a Church<br />\ning to the ears of English scholars. It is usually applied to members preference list from which we<br />\nof the female sex, is defined as one who tries to receive the most with have sent to the neighborhood<br />\ntyle: \"Distinctive or characterthe least return and implies a parasite or a sponger. The exact ori- churches the names and addressistic mode\" (Webster). Might<br />\ngin of the term gold-digger is not known. Although it may have es of the out-of-town Hopkins<br />\nstudents<br />\ntheir<br />\nrespective<br />\nof<br />\ndehad its beginning in the Bowery, the expression is applicable to some<br />\nbe shortened to \"Stetson\" in<br />\ntypes found on every college campus. The college need not neces- nominations. On October 12<br />\nspeaking of hats.<br />\nsarily be co-educational. Hopkins is not a \"co-ed\" university, but, was held the inter-Church Reception<br />\nfor<br />\nall out-of-city students,<br />\nsad to say, it has its gold-diggers.<br />\nand this led to a succession of<br />\nCollege gold-diggers may be divided roughly into two classes. individual denominational<br />\nrecepOn the one hand is the grind. He sneaks to his class and when this<br />\ntions in various churches.<br />\nis over he sneaks away, ever greedy for knowledge, taking all his<br />\nThe Y has further served the<br />\nuniversity will give, and yet returning nothing. The second type,<br />\ncommunity this year through the<br />\nmore numerous, more objectionable and less popular, is the variety<br />\ndeputation teams and social se.rvof parasite which lives on the labors and good will of his fellow stuContinued on page 4, col. 2.<br />\ndents. He censures the majority of undergraduate activities, condemns many as having no place in college life and comments on the<br />\ninefficiency of student managers in general. This type receives the<br />\ncollege publications from his mail box, devours them hurriedly, but<br />\nnever enjoys or appreciates them. Always the papers are thrown<br />\naway in dis.),ust,<br />\nthe act accompanied by an exclamation on their extremely mediocre character, or on their being far inferior to the publications of another college and always—\"Well, I could have done<br />\nbetter myself.\" Members of this class never compete for athletic<br />\nteams. They dote on their inability to participate. However, usually they attend some games and then choose the best seats in the rooting section, but they are never caught cheering.<br />\nFOUNDED 1897<br /><br />\nPayne &amp;Merrill<br /><br />\nThe St. REGIS<br />\nRESTAURANT<br /><br />\nN<br /><br />\nS<br /><br />\nSTETSON HATS<br />\nStyled for young men<br /><br />\n\"What a whale ofa difference<br /><br />\njust afew cents make!\"<br /><br />\nWhen questioned as to their university spirit, gold-diggers pour<br />\nforth a sad tale and bewail that no opportunity is offered them. When<br />\na time comes, however, such as in the season ticket sale campaign,<br />\nwhen they might conveniently prove their worth, they throw up their<br />\nhands in horror and again become conspicuous by their failure to support. It is regrettable that the Hopkins campus has to boast of so<br />\nmany members of the gold-digger species that it becomes necessary<br />\nto extend the season ticket sale campaign beyond the allotted time.<br /><br />\nDANCES RESUMED<br />\nTo remedy an ill, first remove the cause. It seems evident that<br />\nthe plan of the Student Council to bar outsiders, except as guests of<br />\nHopkins men, and to supervise conduct at dances on the campus<br />\nwill eliminate all cause for future misdemeanors. As a whole, the<br />\ncampus feels that supervision has been placed in the proper hands<br />\nand rejoices that dances are again to be held.<br />\nA clause in the constitution of the Student Council explains<br />\nthat the Honor System extends to all matters on the campus that a<br />\nslip of gentlemanly conduct is as serious a violation of the Honor<br />\nSystem as \"cribbing\" in an examination. There is prevailing on the<br />\ncampus a hazy conception of the exact nature and provisions of the<br />\nStudent Council. For this reason, the News-Letter will publish the<br />\nStudent Council's constitution in a subsequent issue.<br /><br />\n—all the difference<br />\nbetween just an ordinary cigarette<br />\nand— FATIMA, the most skillful<br />\nblend in cigarette history.<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, APRIL 4, 1924<br /><br />\nRAL<br /><br />\nur<br />\nn;11<br />\nly<br /><br />\nIS<br /><br />\nSHAKESPEAREAN WEATHER—APRIL FIRST IN<br />\nHARMONY WITH APRIL FOOL TRADITIONS<br />\nIt is not often that the elements<br />\ncombine with human invention in<br />\nplacing emphasis on a certain fact<br />\nor tradition. Only in Shakespearean plays do we really look for a<br />\nsympathy of the heavens with the<br />\ncourse of human events. But last<br />\nTuesday the great stage in which<br />\nwe live, the great drama of which<br />\nwe are a part, was in complete<br />\nharmony with a human tradition<br />\n—April Fool's Day.<br />\nDriven by a biting northeast<br />\nwind that swept the Hopkins<br />\ncampus, a snow that assumed blizzard proportions quickly concealed the fresh, green grass,<br /><br />\nturned automobiles into fantastic<br />\nwhite objects suggestive of Arab<br />\ngenii, and blanketed every object<br />\nexposed to the sky in a heavy<br />\nmantle. April, the month of<br />\nshowers, April, the month of cool<br />\nmornings and balmy noondays,<br />\nApril, commonly termed a Spring<br />\nmonth, started like December!<br />\nBut therein lies the sympathy of<br />\nthe elements. If Shakespeare had<br />\nseen the conditions on Tuesday,<br />\nhe would have exclaimed, \"Well<br />\ndone! It is fitting that on April<br />\nFool's Day men be fooled.\"<br />\nHow many, we wonder, appreciate the true dramatic qualities<br />\nof Tuesday's snow?<br /><br />\nHOPKINS TEAM DEFEATS C. E. HALL TO BE SCENE OF<br />\nBALL UNDER AUSPICES OF<br />\nGEORGETOWN MARKSMEN<br />\nMILITARY DEPARTMENT<br />\nTomorrow night the Military<br />\nIn a match held on the Hopkins<br />\nrange Saturday afternoon, the Department of the University will<br />\nJohns Hopkins rifle team defeat- hold a Military Ball in the C. E.<br />\ned Georgetown University by an<br />\nHall. This affair will be the first<br />\nample margin.<br />\nits kind to be held at Homeof<br />\nThe Georgetown team is considered one of the -best in the wood.<br />\nBecause of the size of the hall<br />\ncountry, having placed fifth in the<br />\nintercollegiate shoot, staged under the Military Department has dethe auspices of the National Rifle cided to restrict the attendance to<br />\nAssociation.<br />\nthe Junior and Senior members of<br />\nThis is the second time Georgethe R. 0. T. C. unit and certain<br />\ntown has gone down to defeat<br />\nfaculty who<br />\nunder the fire of the Hopkins of the University<br />\nmarksmen, the first occasion be- have been specially invited.<br />\nAs the ball is to be a formal<br />\ning at New York earlier in the<br />\nyear.<br />\nmilitary affair, the members of the<br />\nAlthough the Hopkins riflemen R. 0. T. C. unit will all be in unionly took twentieth place in the form. There seems to be a slight<br />\nintercollegiates they have shown tendency, on the part of the Juhigh ability and are thought to niors who are not commissioned<br />\nhave an excellent chance of win- officers, not to buy tickets. Lieuning the match next year.<br />\ntenant Sherwood appealed to the<br />\nTo prevent the match lasting Junior class last Monday to get<br />\ntob long the time limit plan was behind the affair and support it.<br />\nused, a minute being allowed for He said the only reason he could<br />\neach shot. Major T. A. McBride see for the Junior non-coms not<br />\nand Captain W.I. Morrow, of the buying tickets was that they did<br />\nThird Corps Area Headquarters, not have the officers' belts.<br />\nwere the judges of the match.<br />\nNeedless to say, drinking will<br />\nEarlier in the week the team not be tolerated at the dance. The<br />\nlost by twelve points to the Uni- Military Department had quite a<br />\nversity of California.<br />\nbit of trouble in obtaining the use<br />\nThe targets for the match with of the C. E. Hall due to the fact<br />\nOregon have arrived and will be that some of the dances held there<br />\nshot off some time this week.<br />\nlately have not been a credit to<br />\nThe results of the matches with the University. The military office<br />\nGeorgetown and California are as promises, however, that the dance<br />\nfollows:<br />\nwill not be boring even to those<br />\n347 who must \"imbibe of the cup<br />\nWilgis (capt.)<br />\n355 that cheers\" to enjoy themselves.<br />\nKaufman<br />\n353<br />\nMuir<br />\nThe tickets are moderately<br />\n361<br />\nMount<br />\npriced, $2.50, and it will be a<br />\n365<br />\nL'Allemand<br />\nHopkins crowd as tickets are not<br />\nbeing sold to men who are not<br />\n1781 members of the University. If<br />\nTotal J. H U<br />\n1755<br />\nGeorgetown<br />\nthis ball is a success, the Military<br />\n190 Department plans to make the<br />\nMichael<br />\n188<br />\nL'Allernand<br />\ndance an annual event.<br />\n..186<br />\nMuir ............<br />\n186<br />\nKaufman<br />\nSPRING SPORTS TO OPEN<br />\nTOMORROW<br />\n186<br />\nMount<br /><br />\nALWAYS USE A<br /><br />\nYELLOW CAB<br />\nOR PHONE<br /><br />\nVERNON 1212<br /><br />\nGRADUATES<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nSENIORS and graduate students in all courses are<br />\ninvited to confer with representatives of the Bell Milano and handmade and many<br />\nTelephone System, who will be at the<br />\nOthers at<br />\nThe Barn<br />\nMECHANICAL BUILDING<br />\nRoom No. 109<br /><br />\non<br />\nFRIDAY, APRIL 4, 1924<br />\nat 12:30 P. M.<br />\nTHE BELL SYSTEM, which is composed of the American<br />\nTelephone and Telegraph Company, the 25 associated<br />\noperating telephone companies, and the Western Electric<br />\nCompany, offers a wide choice of work and location to<br />\nqualified men.<br /><br />\ne)<br />\nfieXatteri<br />\nCet<br />\n—Nrif<br />\nG.Lo<br />\naS<br />\nZ<br />\n- t<br />\nli.<br />\nopmmilo<br />\nw<br />\nCARofr,<br />\n,<br />\n&amp;NOS<br />\neieFI<br />\n:<br /><br />\n29<br /><br />\nE. BALTIMORE<br /><br />\nST.<br /><br />\nAgents for JOHN B. STETSON HATS<br />\nand FRATERNITY BANDS<br /><br />\nLIBERTY ST.<br />\nAT SARATOGA<br /><br />\nThe maintenance, operation and business administration of this great system, the engineering and building<br />\nfor its growth all create new problems to solve and<br />\nreal opportunities for men who can qualify.<br /><br />\nLUNCHEON<br />\nTEA<br />\nDINNER<br />\n11.30 A. M.<br />\nuntil<br />\n7.30 P. M<br /><br />\nSPECIAL PARTIES<br />\nPLAZA 6987<br /><br />\nEDMUND HALLEY<br />\n1656-1742<br /><br />\nSon of a London soap-boiler<br />\nwho became AstronomerRoyal. At the age of 20 headed<br />\nan expedition to chart the stars<br />\nof the Southern hemisphere.<br />\nFinanced and handled the<br />\nprinting of Newton's immortal<br />\nPrincipia.<br /><br />\nThe cometcame back<br />\nThe great comet that was seen by William<br />\nof Normandy returned to our skies in 1910<br />\non its eleventh visit since the Conquest.<br />\nAstronomers knew when it would appear,<br />\nand the exact spot in the sky where it<br />\nwould first be visible.<br />\nEdmund Halley's mathematical calculation of the great orbit of this 76-year visitor—his scientific proof that comets are<br />\npart of our solar system—was a brilliant<br />\napplication of the then unpublished Principia of his friend Sir Isaac Newton.<br /><br />\nContinued from page 1<br /><br />\n936 to play, the team is thought to be<br />\n948 stronger than usual. The Eagles<br />\nbelieve themselves capable of takPOSITIONS WANTED<br />\ning the measure of any team of like<br />\nA local credit company wants caliber.<br />\nThe Varsity will probably lineseniors to begin part time work<br />\nwhich may continue through the up as follows:<br />\nsummer and lead to permanent<br />\nGoal—S. Cone or Love.<br />\npositions. Work in the local conPoint—Bachman.<br />\nnathe<br />\nin<br />\nplace<br />\na<br />\nto<br />\nCover<br />\nlead<br />\ncern may<br />\nPoint—Milburn or Levy.<br />\nFirst Defense—Barton.<br />\ntional organization of which it is<br />\nSecond Defense—Benedict.<br />\na branch. An insurance company<br />\nThird Defense—Watson or Vomakes practically the same offer<br />\nfor both seniors and underclass- gel.<br />\nmen.<br />\nCenter—Summers or Kaufholz.<br />\nThird Attack—Robinson.<br />\nNumerous sales positions are<br />\nSecond Attack—Aaronson or<br />\nopen in a variety of branches, ofMorrell.<br />\nfering commissions and prizes.<br />\nFirst Attack—Turnbull (Capt.)<br />\nFurther information may be obGil215<br />\nFrench,<br />\ntained from Dr.<br />\nOuthome—Sanderson or Bates.<br />\nman Hall.<br />\nInhome—McDaniel.<br /><br />\nHAIL THEM ANYWHERE<br /><br />\nTotal, J. H. U<br />\nCalifornia<br /><br />\nAs spectacular as a<br />\ncomet has been the<br />\nworld's electrical development. By continuous<br />\nscientific research the<br />\nGeneral Electric Company has accelerated<br />\nthis development and<br />\nhas become a leader in<br />\nthe industry.<br /><br />\nThe laws of motion that Newton and<br />\nHalley proved to govern the movements<br />\nof a comet are used by scientists in the<br />\nResearch Laboratories of the General Electric Company to determine the orbit of<br />\nelectrons in vacuum tubes.<br /><br />\nGENERAL ELECTRIC<br />\n'<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 4, 1924<br /><br />\n4<br />\n•<br /><br />\n4111•MMII,<br /><br />\nSOPHISTICATED<br />\nYou'd be surprised at what<br />\nhe knows! He didn't learn<br />\nit all in a book, either. For<br />\ninstance—his clothes are<br />\ndreams and his grooming an<br />\ninspiration.<br />\nHe gets that finely turned-out<br />\nhead from \"Vaseline\"Hair Tonic.<br />\nIt smooths and grooms the hair.<br />\nAt all drug stores and student<br />\nbarber shops.<br />\nEvery \"Vaseline\" product is<br />\nrecommended everywhere<br />\nbecause of its absolute purity and effectiveness.<br /><br />\nVaseline<br />\nHAIR TONIC<br />\nChesebrough Mfg.Co.<br />\n(consolidated)<br /><br />\nORDERS RECEIVED FOR<br /><br />\nCOGGINS'<br />\nTransfer &amp; Baggage Express<br />\nAUTOMOBILE SERVICE<br />\nPHONE, HOMEWOOD 6886<br /><br />\nHOTOM 01111,2<br />\n\"The King of Lubricants\"<br />\nSHERWOOD BROTHERS, INC.<br />\n'p1 P141I)11P14P!1 p14 riftm4.•1,4.,1:4•14<br /><br />\nA. JACOBS &amp; SONS<br />\nTailors<br />\nUniforms and Liveries<br />\n128 W. FAYETTE ST.<br />\nBaltimore, Md.<br />\nNear Liberty St.<br /><br />\nFELLOWSHIP DINNER HELD<br />\nContinued from page 2<br /><br />\ncussion groups in the new Dormitory, and by close co-operation<br />\nice department. Teams of two with the Christian Service Club<br />\nto five men have gone out on dep- in their activities of recruiting for<br />\nutation work in the city and sub- Christian life service. One hunurbs on numerous occasions, and dred and twenty-five students<br />\nabout twenty-five students have have become active members of<br />\nbeen placed as leaders of Boys' the Y thereby subscribing to the<br />\nClubs, Sunday School teachers, truly Christian principles of the<br />\nand special workers for social Association and many of them<br />\nservice institutions of the city.<br />\nare definitely lined up in some<br />\nThe more definite religious form of active service.<br />\nThis has been a year of Conferwork of the Association has consisted of securing special speak- ences and Conventions pertaining<br />\ners occasionally for the Assem- to various phases of \"Y\" work.<br />\nbly, arranging for a series of dis- The selection of men as delegates to intercollegiate conferences is one of the most vital<br />\nBIRDERS functions<br />\nPRIRTERS<br />\nETIGRAVERS<br />\nof the Y Cabinet. During this passing year the Hopkins<br />\nY sent twelve students, accompanied by Dr. J. C. French of the<br />\nfaculty, to the Students' Conference at Silver Bay, New York;<br />\nfive of the retiring cabinet attended the State Officers' Training Conference at Western Maryland College last spring; the retiring President as a member of<br />\nthe Middle Atlantic Field Council of the Y attended a meeting of<br />\nthat Council at Drew Theological Seminary during the winter;<br />\nnine delegates represented Hopkins at that memorable InternaPrinters of<br />\ntional Student Volunteer ConvenGthe Johns Hopkins<br />\ntion at Indianapolis; and twentyseven men attended the Tri-State<br />\nNEWS,-LETTER<br />\nStudent Volunteer Conference at<br />\nHood College in February.<br />\nLOMBARD and SOUTH STREETS<br />\nThe outstanding feature of our<br />\naccomplishments this year was<br />\nthe innovation of the monthly<br />\nEstablished 1873<br />\nFellowship Dinners which have<br />\nA. H. FETTING MAN'FG<br />\nbeen held at the Friends' MeetJEWELRY CO.<br />\ning House for the members and<br />\nManufacturers<br />\ntriends of the Association and at<br />\nGreek Letter Fraternity Jewelry<br />\n213 N. LIBERTY ST., Baltimore, Md. .vhich there has been an average<br />\nattendance of fifty students.<br />\nThe Flag, Banner &amp; Pennant Shop These dinners have been truly<br />\nfellowship affairs, but at each of<br />\n(Successors to Sisco Brothers)<br />\nFlags, Banners, Pennants, Arm Bands, them some noted speaker has<br />\nEmblems, Silk Banners for Schools,<br />\nternoon when they encounter<br />\nSocieties and Fraternities<br />\n302 PARK AVE., BALTIMORE, MD. some outstanding Christian probR. H. Taylor lem.<br />\nVernon 2355<br />\nSHIRT MAKER<br />\nVAN ORMAN GIVES OPINION<br />\n226 N. Liberty St.<br />\nContinued from page 1<br />\nDress Shirts. ..$3.00, $3.50 and $4.00<br />\nNegligee<br />\n$3.30 and $4.40 sive<br />\nside.<br />\nImported Madras<br />\n$5.50 and $6.60<br />\nrerms Cash, Less 10% 30 days on Shirts<br />\n\"The decision to place the ball<br />\nAlso a Full Line of Men's<br /><br />\nSTRATTON<br /><br />\nURNER'S<br />\nMEN'S SHOES<br /><br />\nIf you knew<br />\nwhat ageing in wood<br />\ndoes for pipe tobacco<br /><br />\nvc<br /><br />\nIN<br /><br />\nPal<br /><br />\nEven the finest Kentucky<br />\nBurley Tobacco (and that's the<br />\nkind we use) is green and raw<br />\nwhen it'spulled. You could hardly<br />\nsmoke one pipe load of it.<br />\nAnd here's where Velvet is different: Our ageing takes out that<br />\nrawness and harshness, and<br />\nmakes the tobacco mild and mellow and gives it fine flavor. Ageing in wood does what no artificial<br />\ntreatment can do.<br />\nRemember —Velvet Tobacco<br />\naged in wood.<br /><br />\ncai<br />\nov<br />\n19;<br />\nfra<br />\nlas<br />\nth<br />\nag<br />\nbo<br />\npr<br />\nof<br />\nqu<br />\nru<br />\nwI<br />\nre<br /><br />\nLIGGETT &amp; MYERS TOBACCO Co.<br /><br />\nni<br />\ndi<br />\nth<br />\nhi<br />\nvv:<br />\nse<br /><br />\nHub<br /><br />\nCC<br />\nte<br />\na<br />\nU.]<br />\nti,<br /><br />\nBaltimore's Great Men's Store<br /><br />\n01<br />\nni<br /><br />\nCri<br /><br />\nSC<br /><br />\n11;<br /><br />\nMount Vernon Place M.E.Church<br /><br />\nei<br />\nhi<br />\nc(<br /><br />\nOSCAR THOMAS OLSON, D.D., Minister<br />\nPROGRAM FOR STUDENTS<br /><br />\nt(<br />\nBIBLE CLASS, 10 A. M.<br />\nAn Interesting Discussion of<br />\nVital Topics Under<br />\nDR. HOWARD A. KELLY, Leader<br /><br />\n11<br /><br />\na<br /><br />\nYOUNG PEOPLES AT-HOME<br />\n5-7 P. M.<br /><br />\non the 3 yard line instead of the S<br />\nTEA SERVED AT 6 O'CLOCK<br />\nyard after a touchdown has been<br />\nCollege and Fraternity Stationery<br />\nOf the Better Class<br />\nEPWOR1 H LEAGUE<br />\nBanquet and Dance Cards, Invitations done with the idea that the team<br />\nURNER BROTHERS<br />\n7-8 P. M.<br />\n%%rill play a running or passing<br />\nJAS. H. DOWNS<br />\n1 1 1 E. BALTIMORE STREET<br />\nENGRAVER PRINTER STATIONER move for the extra point. As the<br />\nBaltimore<br />\nSPECIAL STUDENTS AT-HOME<br />\n229 N. CHARLES ST.<br />\nkick is the most direct and a safer<br />\nFEBRUARY 17<br />\nway of scoring the point, this will<br />\nnot be a handicap to the kicker in<br />\nCOME DOWN AND<br />\nthis respect.<br />\nGET ACQUAINTED<br />\nAt the Washington Monument<br />\n\"The increase of penalty from<br />\nFOR<br />\nTRAINS<br />\nTHE SCHOOL OF RETAILING<br />\ntwo to five yards for more than<br />\nEXECUTIVE POSITIONS<br />\nthree times out each half is an<br />\nexcellent point. When a team is<br />\nTEACHING<br />\nMERCHANDISING<br />\nPERSONNEL<br />\nSERVICE<br />\nTRAINING<br />\nADVERTISING<br />\nwithin a short distance from their<br />\ngoal, there seems to be a tendenFINANCE AND CONTROL<br />\nMerchants Are Eager to Secure Trained Men and Women in These Fields.<br />\ncy of delaying the game. But this<br />\nSERVICE FELLOWSHIPS<br />\nincrease in the penalty will elimiCLASSROOM AND STORE ARE LINKED CLOSELY TOGETHER<br />\nnate this 'stalling' for time.<br />\nIllustrated booklet on application. For further information write<br />\n\"The gun shot at the end of<br />\n.TWCorzzerayelie and Cutaw Sis.<br />\nDR. NORRIS A. BRISCOE<br />\neach quarter is a good factor in<br />\nDIRECTOR OF NEW YORK UNIVERSITY SCHOOL OF RETAILING<br />\n-Where Wholesale and Retail Districts Meet\"<br />\ndesignating the definite end of<br />\nNEW YORK CITY each period in the game. Before100 WASHINGTON PLACE<br />\nhand, the monotony of the whistle<br />\nused after each play and quarter<br />\nhas misled the spectators who<br />\nPRESCRIPTION DRUGGISTS<br />\nwould rush out into the field<br />\nthinking<br />\nthat the game was finTWO STORES:<br />\nEutaw Place and North Ave. ished when it was simply the end<br />\nCharles and Chase Sts.<br />\nof a play. This rush naturally deMadison 0405<br />\nVernon 0890<br />\nand individuality is offered here at prices that are not<br />\nlays the game.<br />\nand cannot be underquoted by any house at any time.<br />\n\"Of all the new changes, I beC.Besides the reputation of an old-established firm<br />\nlieve<br />\nthat there is only one which<br />\nis back of each sale with a guarantee.<br />\nThe Greetings of a Fine Store<br />\nmay prove to be unsatisfactory.<br />\nThere<br />\nUniversity<br />\nFine<br />\nStudents<br />\nof<br />\na<br />\nwill be more power grantTo the<br />\ned to the referee. In the past it<br />\nDECORATIONS<br />\nDRAPERIES<br />\nseems that the referee has been FURNITURE<br />\n343<br />\nNORTH<br />\nCHARLES<br />\nSTREET<br />\noverburdened with duties.\"<br /><br />\nNew York University School of Retailing<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nHYNSON, WESTCOTT and DUNNING<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP 8z SONS<br /><br />\nHOCHSCHILD.KOHN 8ic Co.<br /><br />\n1<br /><br />"}], "field_media_file": [{"target_id": 37859, "display": null, "description": null, "target_type": "file", "target_uuid": "bffcd351-b7e7-4ad7-96df-8e38279b9ad0", "url": "http://digital.library.jhu.edu/system/files/2022-03/13118-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13118, "target_type": "node", "target_uuid": "ddf3aaec-e010-46e6-b82e-a5705dfc3dac", "url": "/node/13118"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "7310c274-9977-4265-95b3-c0b7249ecf72"}]}