{"mid": [{"value": 35624}], "uuid": [{"value": "00889fad-fcd4-4fed-bcc7-b7bac62747e4"}], "vid": [{"value": 35624}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:09:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12170-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:09:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:09:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "•9/<br />\n<br />\nl0oscm)<br />\n<br />\n•<br />\n<br />\nAP<br />\n<br />\nmil 111111315<br />\n1:1111<br />\n)t.<br />\n<br />\n11111111c<br />\n<br />\nPublished kny tle Students of<br />\n<br />\ntie<br />\nnsilopkinsOblewIssued<br />\n<br />\nBaltimore<br />\n1.45.<br />\nPRESS OF STONEBRAKER •ROS.. BALTIMORE.<br />\n<br />\nFortnightly<br />\n<br />\n\fJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br />\n<br />\nTwenty-Fifth Year.<br />\n<br />\n13eginning October 1st, 1900.<br />\n<br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br />\n<br />\nDANIEL C. GILMAN<br />\nWm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br />\n<br />\nINSTRUCTION.<br />\nFor Uraduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates \"<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special-students.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br />\n<br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br />\n<br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nzoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n<br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oskr.<br />\n<br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nDirectors.<br />\nBasil L. Gilderskeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssynology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br />\n<br />\nEditors.<br />\nFrank Morley.<br />\nIra Remsen,<br />\nBasil L. Gildersleeve.<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br />\n<br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br />\n<br />\nThe Johns Hopkins Press.<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY,Editor. Quarterly. 4to. Volume XXIII.<br />\nin progress. $5 per volume.<br />\nII.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series XIX<br />\nin progress. $3 per volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nX.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXi. Modern Language Notes.<br />\nA. M. ELLIoTT, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. Svo. Volume<br />\nV in progress. $5 per volume.<br />\nXIII. American Journal of insanity.<br />\nIIENRy M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume. XVI. Annual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc.,of the University. Published at the<br />\nclose ofthe academic year.<br />\nI.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 1.0 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edi,<br />\ntion. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH AlsITILEGOMENA EPISTLES. Edited by I. H. Hall. $8.00.<br />\nBIBLIOGRAPHIA HcPICINSIENSIS. Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-V1 Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press. Baltimore, Maryland.<br />\n<br />\n\fCbe news= Letter. *<br />\nVol. V.<br />\nAN<br />\n<br />\nMarch 21, 1901.<br />\n<br />\nINTERNATIONAL EPISODE.<br />\n<br />\nHE most casual observer of the map of<br />\nTSwitzerland<br />\nwill have noticed that the<br />\nsouthern boundaries are extremely irregular.<br />\nZigzag lines caused by mountains and valleys<br />\nand singular political divisions make the plan<br />\nof that country to droop like a tattered fringe<br />\nover the northern edge of Italy. It was in<br />\nconnection with these topographical peculiarities that I met with some adventures.<br />\nWe had started out on bicycles to go from<br />\nthe sunny town of Lugano to another Swiss<br />\ntown equally beautiful and equally Italian, to<br />\nLocarno on Lake Maggoire. The ride was delightful, and we proceeded with due enjoyment<br />\nof our surroundings, and in possession of passports and all necessary papers until we came<br />\nto the frontier hamlet of Fortessa. It was<br />\neasy to pass the Swiss custom house because<br />\nwe were going out, but it was not many moments before we realized that we were in a foreign country, for we were immediately halted<br />\nby another set of guards in uniform, who inspected our papers and looked critically upon<br />\nour persons. It never occurred to me that the<br />\nfew hours that we should be in Italy we<br />\nshould be under suspicion, but the Italian custom house wished to know where we were going. That was easily explained, but there<br />\nwere possibilities in the thing. We might turn<br />\noff at the next crossing, flee to the woods and<br />\nsell those bicycles, escaping the tax.<br />\nThere were various ways in which this matter might have been settled. We might have<br />\nbeen imprisoned and held until we were ready<br />\nto go back into Switzerland by the way we<br />\ncame, or, we might have been obliged to pay a<br />\ntariff duty about equal to the value of the machines, but the Italian government chose another way. It was delicately considerate and<br />\ncomplimentary. We were conducted across the<br />\ncountry under military escort. To be sure this<br />\nescort consisted of one soldier who had no gun<br />\nnor yet a bicycle. My better half mounted her<br />\n<br />\nNo. 11<br />\n<br />\nwheel and rode, but to allay suspicion, and to<br />\n'avoid the used of any weapons he might have<br />\nconcealed in his clothing, I walked, as far as<br />\nLuino, over two or three miles of the<br />\nmost aggravatingly smooth roads imaginable<br />\ndown through the city to the chief custom<br />\nhouse, paid an insignificant sum for the<br />\nexamination of our papers and the services<br />\nof our soldier, then passed on to the steamboat landing where we put the padlock on the<br />\nwheels and left them in charge of the guard.<br />\nPoor fellow! After all that walk he had to stay<br />\nthere two hours more, pass his supper time,<br />\nwhile we walked about, saw the town and fared<br />\nsumptuously. In fact, he followed the wheels<br />\non board the steamer, remained with us until<br />\nwe had passed an invisible frontier, and delivered us once more in the hands of the<br />\nSwiss.<br />\nI need not relate the details of the journey<br />\nwe took returning by a route entirely within<br />\nSwiss territory to Laganio. Suffice it to say<br />\nthat we soon after started southward for Como<br />\nwith the expectation of staying a few days on<br />\nthe Italian lakes and returning to Switzerland.<br />\nFor some reason I received the impression that<br />\nthe Italian custom house on that route would<br />\noffer no difficulties. I found my mistake at<br />\nChiasso. We had been coming slowly down<br />\nthe road, enjoying the landscape; and photographing the peasants, with no suspicion that<br />\nbicycles were an object of terror to Italian officials. As usual, we carried very little money<br />\non the road, and were unprepared to pay taxes<br />\nor to buy official courtesy. To my dismay the<br />\nPhilistines at Chiasso demanded ninety francs<br />\napiece for the passage of our machines. The<br />\nmost profound search revealed only half that<br />\nsum on the combined persons of the party. In<br />\nletters of credit they were not learned, and so<br />\nsmall a town could not pretend to have a bank.<br />\nThe nearest financial resource was at Como,<br />\ntwo miles away. Things looked dubious for a<br />\ntime, but at last a brilliant thought flashed<br />\nover me. I deposited my wife and one machine<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nwith the custom house, and road the other to<br />\nComo after the money. In an hour and a half<br />\nI returned withe plenty of funds to claim my<br />\ndeposits. My active pledge had in the meanwhile employed her time with usury, for her<br />\nwater color brush had been capturing a small<br />\nItalian citizen in red cap and bare feet. By<br />\nthe time the papers were made out \"Miguel\"<br />\nwas fast in her sketch-book.<br />\nIf Lake Como had not been so often described, I might relate my impressions. These<br />\nlittle difficulties with human institutions made<br />\nno difference in the beauty of the scenery, but<br />\nI would not have you think that my adventures with the custom house ceased at this<br />\npoint.<br />\nThe journey from Como to Chiavenna can<br />\nbe made by rail, but we did not propose to<br />\ntravel in that manner, neither did we intend to<br />\nmake the trip in the ordinary way by water,<br />\nbut mounted our wheels, and started up the<br />\nwestern side of the western arm of the lake.<br />\nLake Como would be better described by the<br />\nuse of the word \"leg,\" for on the map it looks<br />\nlike an overgrown horse-raddish root on the<br />\nrun, the city of Como being fastened to the<br />\n\" toe of the forward foot. We followed the<br />\nroad as far as the little town of Torriggia.<br />\nHere the highway suddenly dwindled to a<br />\nmule path, and we sat down under the trees to<br />\nrest, to photograph and sketch until the next<br />\nsteamer came by. This arrived in the course<br />\nof an hour or two and we led our horses on<br />\nboard. As we mounted the steps of the upper<br />\ndeck we suddenly became conscious of friendly<br />\nfaces. First one and then the other came forward, until there were four young men from<br />\nBaltimore before us. Not only that, but they<br />\nwere all from my department of the University,<br />\nand persons with whom I had been in daily<br />\nassociation for years. You will excuse me if<br />\nI say this word \"paralyzed\" to express our<br />\nemotions, for at Bellaggio we changed the<br />\nsteamer for a row boat and had ourselves propelled to the north side of the lake. From<br />\nthat point we went up toward the passes of the<br />\nAlps by man power, furnished by members of<br />\nthe party.<br />\nIt was up in the pass above Chiavenna that<br />\nthe closing events of this episode took place.<br />\n<br />\nWe had pushed rapidly up the hill in order to<br />\nreach the Swiss border at the proper time, and<br />\nfull of haste and brown dust, I presented my<br />\npapers, receipts and passports. The official<br />\nwas very polite. The papers were all clear<br />\nthat I had deposited money, and that I was the<br />\nperson. Very sorry, however, that he had no<br />\nauthorization to /Say out money. Papers failed<br />\nto indicate at what point the bicycles were to<br />\nbe exported. I had in fact told the people at<br />\nChiasso a dozen times over that I was going<br />\nout by the way of Chiavenna, but they had<br />\nneglected the proper formalities. It would be<br />\nnecessary to request the Italian government in<br />\nRome to permit the custom house at Villa di<br />\nChiavenna to return me the duty on two bicycles. The thing looked for a moment like robbery, but I was comforted with the assurance<br />\nthat within two weeks the same thing had happened to eleven other Americans and that they<br />\nhad come out all right.<br />\nIt was Friday, and we were in the uttermost<br />\nparts of the kingdom. A petition by letter<br />\nmeant a week or more of delay. So armed<br />\nwith a properly worded telegram I hastened<br />\nback a mile down the hill to the shoemaker<br />\nwho kept the post and telegraph office, and<br />\nturned over my affairs to the minions of electricity. In the meanwhile, we made ourselves<br />\ncomfortable on the Swiss side of the line. It<br />\nwas a village of at least seven houses, and in<br />\nthe midst of chestnut trees, and side hill farming, performed by the female population. For<br />\ntwo whole days we studied Swiss institutions,<br />\npainted the scenery and collected botanical<br />\nspecimens.<br />\nAt five o'clock Saturday evening a reply,<br />\ndated at Rome at 12 the same day reached the<br />\ncustom house at Villa di Chiavenna, and our<br />\nfinancial matters were straightened out.<br />\nI have never obtained a really satisfactory<br />\nhistory of that message. One does not like to<br />\ncriticize unduly the methods of foreign governments when there may be great natural<br />\ndifficulties to overcome. Especially is it true<br />\nin this case, where anyone can see from the<br />\nmaps that Villa di Chianna is 2500 feet above<br />\nthe sea, and the wire from Rome comes all the<br />\nway up hill.<br />\nJOHN MARTIN VINCENT.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nAPELLO.<br />\nMr. Editor.<br />\nIt occured to me the other day that the great<br />\nuse of a Junior in College is to advise Freshmen: and since I am debarred in future, from<br />\ngiving Freshmen any more physical advice,<br />\nI am going to excercise my other prerogatives,<br />\nand give them some mental and moral advice<br />\nconcerning a matter which I think should be<br />\nbrought to their attention.<br />\nI wonder, to how many Freshman, has the<br />\nfact presented itself that they owe the University something more than their tuition fees?<br />\nYou applaud the leaders of your class, the<br />\nmembers of the athletic teams, and,sometimes<br />\nthe musical clubs. Do you ever try to do the<br />\nthings they do? You cannot, you say. How<br />\ndo you know you cannot? Have you tried?<br />\nIf you are musical or shine in the social world,<br />\njoin the musical clubs. If you are big and<br />\nstrong, patronize \"Mac\" and the cage. If<br />\nyou are studious, try for class honors. If you<br />\nare none of the above, but have a sneaking<br />\nfondness for Dr. Green's papers, try for the<br />\nNEWS-LETTER staff.<br />\nIt is to this last class of men that I address<br />\nthis appeal. It is your duty to help the paper,<br />\nbecause if you can write, your work is needed<br />\nin its columns. If the paper is not as good as<br />\nit might be (I am sure the editors will pardon<br />\nme) try and make it better. Criticism is good<br />\nbut work is better. How can the editors ever<br />\nimprove the NEWS-LETTER when everyone<br />\nabuses it, and no one writes for it? Don't be<br />\nlike the basement-loafers who look at their<br />\ncopies on alternate Thursday evenings, and<br />\nthen always say \"Well, it's a pretty bum<br />\nnumber. I don't see why we can't have a<br />\ngood paper here.\" I asked one of these gentlemen one day if he had even done anything<br />\nto make it better, and he said \"Oh, I sent in a<br />\npiece once, but they would'nt take it.\" I<br />\ndiscovered afterward that the piece in question<br />\nwas something on the order of Baccaccio's<br />\nfamous tales—naughty but very nice.<br />\nNow, boys, that is not the way to support<br />\nyour college paper. The NEWS-LETTER represents the literary ability of the Hopkins undergraduate body. To the world at large we are<br />\n<br />\n3<br />\n<br />\nknown by this paper. If we think it is poor,<br />\nwe should make it better. If you think you<br />\ncan write, try for the staff. If you don't make<br />\nit, write for the paper anyhow. If you have<br />\n,no literary ability, don't attempt to criticise<br />\nthose who have. I know you are going to say<br />\n\"Yes, that's true\" and then do nothing. I did<br />\nthe same thing. I am sorry now, and I am<br />\ndoing penance by trying to keep you from my<br />\nerror. There are places on the staff, fill them.<br />\nShow the rest of the world that the Hopkins<br />\nmen are not all ignorant, and,show the rest of<br />\nthe Hopkins men that the class of 1903 is alive to<br />\nits responsibilities. Don't wait 'till next year.<br />\nIt will be too late then. Try now, and then<br />\nnext year you will thank him who now gives<br />\nyou this advice.<br />\n<br />\nA JUNIOR.<br />\nGLORY BE UNTO HIM!<br />\n(Mr. W B. Swindell of the Senior class of the Johns Hopkins<br />\nUniversity Is engaged to be married to a young lady of Boston,<br />\nMass.—The Baltimore Sun.)<br />\n<br />\nhe's going to leave us! No longer<br />\nALAS,<br />\nwill his stentorian voice ring out in commanding tones urging a re-awakening of sleeping enthusiasts, no longer will the halls of<br />\nMcCoy resound with his glorious voice, no<br />\nlonger will the instructor in a political science<br />\nbe compelled to outvoice the voice of him in<br />\nthe holy corner. Yes he's going to leave us.<br />\nHe who is the J. H. U., he who is everybody,<br />\nhe who alone can command the bands of Hopkins, he—HE—HE is going to leave us. Weep,<br />\nye legions weep. The attractions of the North<br />\nare too strong for this Southern son of valor,<br />\nhe must go; even the baton of general is small<br />\ncompared to the northern attraction. He has<br />\nlaughed with us, he has fought with us, he has<br />\nlead us, he has spinached to us, and now he<br />\nwill no longer give pleasure unto himself thus.<br />\nThe future was bright before him. The<br />\nportals of a great institution were open to him.<br />\nGroup III, with variations, lead anywhere: it<br />\nhas lead to bliss for him. Happiness be with<br />\nhim; and may he be blessed with many joys.<br />\nSuccess and glory be unto him who is<br />\n<br />\nTHE CHIEF ROOTER.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n4<br />\n<br />\nUbe llews.letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br />\n<br />\nMARCH<br />\n<br />\n2!,<br />\n<br />\n1901.<br />\nio cents a single copy.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nAssistant News Editors, .<br />\n<br />\nWILLIAM B. HILL,1902.<br />\nSob STROUSE, 1902.<br />\n.<br />\n. . BLINN C. HILL, 1902.<br />\n{ROBERT S. LANIER, 1903.<br />\n<br />\n.<br />\n<br />\n. . .<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor, . . .<br />\n.<br />\n<br />\n•<br />\n<br />\nOHN A. SLP.MONS, 1902.<br />\nArMAN C. MURPHY, 1902.<br />\nJOHN M. BAND/U., 1901.<br />\n. . .<br />\n.<br />\nBusiness Manager,<br />\n. AUBREY PHARR a, JR., 1902.<br />\nAssistant Business Manager,<br />\nAddress all articles, communications,etc.,to WILLIAM B. HILL,<br />\nbox 269,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJOHN M. BANDEL, box 94, J H. U.; or box 398, Medical School of<br />\nJohns Hopkins Hospital.<br />\n<br />\nAthletic Editors,<br />\n<br />\n(1<br />\n<br />\ncolumn of this issue we publish<br />\nIN\"another<br />\nBilly\" Maddren's letter of resignation<br />\nfrom his position as President of •the Athletic<br />\nBoard. The \"NEWS-LETTER\" joins with the<br />\nstudent body in expressing its regret at the<br />\nloss from active leadership of one who has<br />\nbeen so conspicuous in athletic circles during<br />\nthe past three years.<br />\nWith the exception of Director Mackdermott, no one connected with the University is<br />\nmore thoroughly alive to our athletic interests,<br />\nnor more completely conversant with every<br />\nbranch of Hopkins sport than Mr. Maddren ;<br />\nwhile together with these qualities he combines<br />\nexecutive ability, and the faculty for imparting enthusiasm among the student ranks.<br />\nWhile Mr. Maddren has retired from his official position, we hope that we may still have<br />\nthe benefit of his advice in athletic matters.<br />\nIn choosing his successor we consider that<br />\nthe Board has exercised great discernment.<br />\nMr. Reese is one who has the athletic interests<br />\nof the University at heart, and anything he<br />\nundertakes is certain of a successful termination. Besides this he may rely upon the cooperation of the students.<br />\nor w<br />\nThe successes of the Track and Field Team<br />\nin the recent indoor meets in this city and<br />\nWashington show plainly that despite our<br />\nheavy losses of last year Hopkins still has a<br />\nteam which comes up to the high standard set<br />\n<br />\nby the champions of 190o. Some of the best<br />\nmen in the dashes and runs left the University,<br />\nbut those remaining form a nucleus on which<br />\nat the beginning of this year Director Mackdermott started to build. The material in the<br />\nFreshman class was good, and under hard<br />\ntraining soon developed some excellent men in<br />\nthe dashes, so that the first meet brought many<br />\nprizes to the trophy-room. The team has been<br />\nshowing up stronger at every succeeding meet,<br />\nand deserves the heartiest congratulations of<br />\nall Hopkins men for its zealous efforts. Though<br />\nit is composed of men from all branches of the<br />\nUniversity, there are enough younger men on<br />\nthe team to assure a firm foundation for next<br />\nyear.<br />\nor w<br />\nIn our last issue we called attention to the<br />\nduty now confronting us regarding the necessary improvements to be added to American<br />\nLeague Park, for the benefit of Hopkins Athletes. No matter what bright joys the future<br />\nholds in store for us, in the shape of expensive<br />\nathletic fields and green campuses, our present<br />\nneeds are pressing. The musical :clubs have<br />\ngenerously enlisted themselves in the service<br />\nof raising the finances needed for this purpose,<br />\nand will shortly give a concert for tha benefit<br />\nof the athletic fund. It is gratifying to see<br />\nhow the students have responded to the subscription call, and, judging from results thus<br />\nobtained, we predict that they can be counted<br />\nupon to turn out in a body the evening of the<br />\nconcert. Despite our lack of students, our<br />\nathletic victories during the last few years<br />\nhave placed Hopkins upon a higher footing in<br />\nthe athletic world, and this fact together with<br />\nbright prospects for the future should stimulate<br />\nus all to greater activity.<br />\nw<br />\nor<br />\nHE readers of this issue should mark well<br />\nand inwardly digest a communication in<br />\nthese columns headed \"Apello,\" and signed<br />\n\"A Junior\". The moral of the epistle is<br />\npointed at the members of the Class of 1903,<br />\nbut there is no reason why the rest of the<br />\nUniversity should not profit by the excellent<br />\nadvice contained therein. It is broad enough<br />\nto embrace all classes, but, doubtless the reason<br />\n<br />\nT<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nfor especially admonishing the Freshmen is<br />\nbecause it is usually considered that their juvenile buoyancy is still in the effervescent<br />\nstage, and that their characters have not yet<br />\nbeen moulded into permanent form. In<br />\nby-gone days the \"NEWS—LETTER\" has harped<br />\nupon the theme of a man's duty to his college;<br />\nin days to come it will doubtless continue to sing<br />\nthis lay, but a letter like \"Apello\" coming as<br />\nit does from one not officially connected with<br />\nthis paper, carries with it more weight than<br />\nanything we may say upon the subject. Besides it is an encouraging sign, for it shows<br />\nthat the work of \"by gone days\" is finally<br />\nbearing fruit.<br />\niv or er<br />\nA gratifying recognition of the worth of the<br />\nUniversity has just been witnessed.<br />\nThe German American citizens of Baltimore<br />\npropose to contribute $100,000 towards the<br />\nendowment fund of a million now being raised.<br />\nThis contribution is to establish a chair of<br />\nGerman language and literature.<br />\nIt is reported that $20,000 of the amount<br />\nhas already been raised by fifteen gentlemen<br />\nwho are members of the Germania Club. We<br />\ntake pleasure in voicing the sentiment of gratitude which every Hopkins man must feel towards these liberal-minded gentlemen. Such<br />\ngenerosity should, and doubtless will,serve as<br />\nan object lesson to other beneficently inclined<br />\ncitizens of Baltimore.<br />\nor oir 9r<br />\nTHE HOPKINS CLUB.<br />\nIT is reported that the Johns Hopkins Club<br />\nmay soon move to other quarters. The growing attractiveness and interest would seem to<br />\ndemand a site more easily reached by the<br />\nmembers. The Club boasts of an excellent<br />\nkitchen and buffet, which may be enjoyed at<br />\nvery moderate rates; but the members do not<br />\nlunch or spend their evenings at the club as<br />\nmuch as they might, were the position nearer<br />\nthe University, or on their way from places<br />\nof amusement. Great atttactions too are<br />\noffered to members who wish to occupy rooms<br />\nin the club house. It is felt that this and the<br />\nother good features of the Club will be enhanced by a more central location.<br />\n<br />\n5<br />\n<br />\nTHE FRESHMAN BANQUET.<br />\nFreshman banquet, marking as it does<br />\nTHE<br />\nthe cessation of friendly clashes between<br />\nnaughty two and naughty three, was a howling<br />\nSuccess from several standpoints. Almost every<br />\nmember of the clsss attended, the apt speeches<br />\nwere well delivered, and the presence of two<br />\nJuniors during the festivities added a certain<br />\nfascination to the pleasure, and without doubt,<br />\nmade the affair the most unique in the annals<br />\nof similar feeds. The class of 1903 is the first<br />\nto enjoy the distinction of having entertained<br />\nsuch unheard of guests at its Freshmen banquet; and it is greatly to the credit of naughty<br />\nthree that at no time during the evening was<br />\na spirit of animosity exhibited. Songs were<br />\nsung, toasts were responded to, and frequent<br />\nknocks made at the Juniors, but at no time<br />\nwere any attempts made to belittle or discomfort the unexpected guests. Before the last<br />\ncourse had been served the aforementioned<br />\ngentlemen were invited to partake of Freshman<br />\nhospitality. They accordingiy drew up, and<br />\nthe mellowing influences of the spread soon<br />\nhad their effects. Both guests made very appropriate speeches, and assured their entertainers that, with the exception of 1902, naughtythree is the best class that ever entered Hopkins. They ended by expressing sincere apapreciation for the hospitality accorded them.<br />\nAs a toastmaster, Harry K. Tootle proved<br />\nto be the real thing. He was full of catchy<br />\njokes, and always had some bright remark<br />\nto continue the merriment. His address in<br />\nwhich he referred to \"taking the Law into<br />\nour hands\" was greeted with deafening applause. The toast \"Our Newly-Acquired<br />\nPossessions\" was construed by some to refer<br />\nto the Juniors present, instead of Homewood.<br />\nAccordingly, some very good puns were gotten<br />\noff by impromptu speakers. The jolly time<br />\nended with numerous class yells and songs,<br />\ninterspersed with several rousing \"Hullabaloos.\" The menu cards were bound in the<br />\nUniversity colors with \"class '03, J. H. U.\"<br />\nengraved in olive and white on the cover page.<br />\nMessrs. Robinson C. Pagon, Benjamin Weeks,<br />\nR. Curzon Hoffman, Wethered L. Lilly, and<br />\n<br />\n\fpmmenimuminimmemnimmummumw.immommonimmummummmommmummemponminnwimmon<br />\n<br />\n6<br />\n<br />\n,<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nW. Sellman Bird composed the arrangement<br />\ncommittee. The toasts and those who responded are as follows: \"Our Class,\" by W.<br />\nS. Bird; \"The Freshman in Athletics,\" by A.<br />\nB. Atkinson; \"Our Enemies—the Juniors,\"<br />\nby J. B. G. Custis, Jr. ; \"The Loyalty of<br />\n1903,\" by H. W. Plaggemeyer; \"Next Year,\"<br />\nby H. T. Magruder; \"Naughty Three's Contribution to Melody,\" by R. C. Pagon; \"Hazing—Going or Coming ?\" by B. F. Zimmerman; \"Our Newly Acquired Possessions,\"<br />\nby J. T. Smith, Jr. ; \"Tommy Hopkins,\"<br />\nby J. A. Addison. All those present regretted<br />\nvery much the absence of J. Alan Haughton,<br />\nwho was to respond to the toast \"The Ladies.\"<br />\n.As .As<br />\nMUSICAL CLUBS.<br />\nJohns Hopkins Glee, Banjo and ManHE<br />\ndolin Clubs gave an informal concert at<br />\nthe University Club on the evening of Friday,<br />\nMarch Eighth. This is the first time that the<br />\nClubs have appeared before the public in the<br />\nguise of a paid orchestra, and the result was<br />\nnot altogether successful. The audience did<br />\nnot deem it necessary to stop talking during<br />\nthe songs and other pieces, consequently it<br />\nwas hard for the men to play and sing, and<br />\nstill harder for those who were appreciative to<br />\nhear the music. Altogether the evening was<br />\nnot enjoyable or successful, and it is to be<br />\nhoped that no more such concerts will be<br />\nscheduled.<br />\nAfter a few attempts by the various Clubs<br />\nto make themselves heard, the men gave up,<br />\nand mingled with the crowd in its rush for<br />\nrefreshments. Then the pleasanter part of the<br />\nevening began, for there were a number of<br />\nattractive girls and women present, and several<br />\nJohns Hopkins Professors and Alumni very<br />\nthoughtfully looked after the welfare of the<br />\nmen.<br />\nManager Bird has nearly completed his<br />\narrangements for the Easter trip, and from<br />\npresent prospects it will be as thoroughly successful as the one last year. So far the plans<br />\nare to leave Baltimore Friday afternoon ou one<br />\nof the Bay Line Steamers and give the first<br />\nconcert at Old Point Comfort on Saturday<br />\nnight. This is the very best night in the<br />\n<br />\nwhole year to attract an audience, and it was<br />\nonly through the energy and perseverance of<br />\nthe manager that this date was obtained. Last<br />\nyear the Clubs had to play second best, and<br />\ngive their concert on Good-Friday when there<br />\nwere necessarily fewer people present. But<br />\nthis year Princeton will have to take our last<br />\nyear's place while the Hopkins Clubs have the<br />\nbest night.<br />\nFrom Old Point Comfort the men will go to<br />\nRichmond and give a concert there on the following Monday—These places are the only<br />\nones that are definitely decided upon, but it is<br />\nlikely that several other cities will be visited<br />\nbefore the Clubs return. There is even a rumor that Atlantic City will be \"taken in,\"<br />\nbut this is a little doubtful.<br />\n<br />\nT<br />\n<br />\nTHE SECOND BALTIMORE CONCERT.<br />\nmost important concert in the history<br />\nTHE<br />\nof the Johns Hopkins Musical Clubs will<br />\nbe given in McCoy Hall on Tuesday evening,<br />\nMarch 26. Its great importance lies in the<br />\nfact that the proceeds will be used to help pay<br />\nfor the erection of the club house and gymnasium on the new athletic grounds.<br />\nThe alumni of the University have been doing their utmost to raise the necessary million<br />\ndollar endowment fund, and it would surely<br />\nseem rather ungrateful in the undergraduates<br />\nif they do not heartily support this concert,<br />\nand thus take away the additional responsibility of paying for the club house.<br />\nFrom the manner in which the subscription<br />\nlists have been received, however, it is unlikely that the former Hopkins men will have any<br />\nreason to believe that they are the only ones<br />\ninterested in the welfare of their Alma Mater.<br />\nWWW<br />\n<br />\nFor the handsome young dudes in far Luzon,<br />\nIt's style to keep just what they choose on.<br />\nWhy, in summer it's meet<br />\nTo appear in the street<br />\nWith just hat, collar, necktie, and shoes on.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n7<br />\n<br />\n\"BILLY\" MADDREN RESIGNS.<br />\n<br />\nTHE HOPKINS GAMES.<br />\n<br />\nAT a meeting of the Athletic Board, held<br />\nTuesday evening, March 12th, President<br />\n\"Billy\" Maddren handed in the 'following<br />\nletter of resignation:<br />\n<br />\nCarnival of Sports under the auspices<br />\nTHE<br />\nof the Athletic Association of the Johns<br />\n<br />\nTo the Board of Directors of the 7ohns Hopkins<br />\nAthletic Association:<br />\nGENTLEMEN,—It is with great regret that I<br />\nam obliged to tender my resignation as President of the Johns Hopkins Athletic Association. My reasons are that I am unable to<br />\ngive sufficient time to athletic affairs because<br />\nof my studies. This resignation is to take<br />\neffect upon the election of my successor, and<br />\nnot later than March i5th. Yours truly,<br />\nWILLIAM HARVEY MADDREN.<br />\nEvery effort was used by the Board to dissuade Mr. Maddren from his course, but he<br />\nexplained that it would be impossible for him<br />\nto devote sufficient time to the duties of presidency, as his studies at the Medical school for<br />\nthe remainder of the year would require hard<br />\nwork and close confinement. With great<br />\nreluctancy the board accepted the resignation,<br />\nand appointed a committee, with Dr. Renouf<br />\nas chairman, to draw up an appropriate resolution in appreciation of Mr. Maddren's work<br />\nin behalf of Hopkins Athletics. It is safe to<br />\nsay, that during the past three years .no other<br />\nstudent of the University has instilled as much<br />\nlife into athletics at Hopkins, as has \"Billy<br />\nMaddren.\" His most conspicuous work has<br />\nbeen in Lacrosse, and it is largely owing to his<br />\nefforts that three championship banners, 1898,<br />\n1899, 1900, now adorn the walls of the trophy<br />\nroom but besides this his advice in athletic<br />\nmatters has been of the greatest benefit, and all<br />\nregret his retirement from active athletics.<br />\nMr. Albert Reese was unanimously elected<br />\nby the Board to fill the position of president.<br />\nMr, Reese is one of the few alumni who has<br />\nnot allowed his interest in J. H. U. sports to<br />\nstop when he received his degree, but has, on<br />\nthe other hand, worked faithfully to advance<br />\nthem. This interest in athletics and his executive ability make him the most suitable man<br />\nwho could have been chosen for the position.<br />\n<br />\nHopkins University was held on last Saturday night at the Fifth Regiment Armory.<br />\nAthletes from diverse parts of the city and<br />\nstate were entertained by the University men,<br />\nwho gave them a good run for their money.<br />\nThese are the first indoor games that the<br />\nUniversity has given for some years past, and<br />\nthat they were a success is the verdict of everyone. Surely there were some hitches, but, for<br />\nthe most part, the events were run off in good<br />\ntime by the clerk of the course, Wm. M.<br />\nMackdermott, to whom all credit is due for the<br />\nsuccess of the meet.<br />\nThe hall had been very attractively decorated, and when the call was sounded for the<br />\nfirst event at 8.10, the seats lining the walls<br />\naround the floor space of the Armory were<br />\ncomfortably filled with fair enthusiasts who<br />\nhad come out in goodly numbers to cheer their<br />\nespecial favorites on to victory, while the gallery was filled with \"rooters\" of the various<br />\norganizations who had occupied themselves<br />\nwith shouting encouragement to their teams.<br />\nA large share of the honors came to the<br />\nwearers of the Black and Blue, but the representatives of Marston's University School and<br />\nthe Boys' Latin School also came in for a<br />\ngoodly share of the prizes.<br />\nThere was a slight delay in the starting of<br />\nthe game owing to the late arrival of several<br />\nof the officials; but when the games were once<br />\nstarted they went ahead at a pleasing pace. The<br />\nprogram was a very attractive one, being much<br />\nless unwieldy than the ordinary program of<br />\nBaltimore meets. Foot races were the predominant features, while there were only three<br />\nfield events.<br />\nThe first event—the interscholastic 40 yard<br />\ndash—was easily won by G. C. Gantz, of the<br />\nBoys' Latin School, with Bayless and Cloud<br />\nclose on him for second and third honors.<br />\nE. L. Pessagno ran a beautiful race in the<br />\n40 yard open handicap, winning first place, but<br />\nwas closely pressed by Tootle, who won the<br />\n40 yard dash in the Baltimore Athletic games<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n8<br />\n<br />\nof several weeks ago. Perhaps the races which<br />\ninterested the majority of the spectators were<br />\nthe twelve relay races. In the first, Marston's<br />\neasily defeated the Emerson Institute team, of<br />\nWashington. The Boys' Latin School team<br />\nalso ran a pretty race against Deichmann's.<br />\nThe special invitation relay race between St.<br />\nJohn's College and Johns Hopkins University<br />\nwas one of the prettiest of the evening. The<br />\nfirst two contestants, Whitman and Garey, ran<br />\nalmost a dead heat till the last lap, when Whitman passed his rival and finished a few yards<br />\nahead of him. Unfortunately for St. John's,<br />\nWells was not able to hold his ground on the<br />\nnext lap, and when Riggs took up the work<br />\nwhere England and Hoffman had left off,<br />\nHopkins had a lead of half a lap, and Riggs<br />\nwas able to hold his lead without exertion.<br />\nMullen, who ran under the auspices of the<br />\nJohns Hopkins Club, was the only scratch man<br />\nin the mile run. He pushed ahead of all his<br />\nopponents, and caught up with Heiner, who<br />\nwas leading. On the last lap Mullens purted,<br />\nand easily won by io yards.<br />\nIn the 440 yard dash, Riggs ran a beautiful<br />\nrace. On each lap he gradually pushed up<br />\npast his opponents, and won handily on the last<br />\nlap by a beautiful spurt. All the other events,<br />\ntoo, were of equal interest, but perhaps the<br />\nmost amusing of the whole evening was the<br />\npotato race, won by C. F. Edwards. Garret<br />\nwon first in the 16-lb. shot, and second in the<br />\nhigh jump. In the 88o yard, novice, England<br />\nwas the victor.<br />\nTRACK EVENTS.<br />\n<br />\nJohns Hopkins University,first; time, 2.36 2-5.<br />\nThe teams ran as follows: J. H. U.—H. Whitman, J. T. England, W. C. Hoffman, T. F.<br />\nRiggs, St. J. C.—E. B. Garey, J. G. Wells,<br />\nG. W. Cromwell, D. C. Howan.<br />\nMile Run, Handicap; Limit, 70 Yards—J.<br />\nM. Mullen, J. H. C., scratch, first; F. H.<br />\nHeiner, C. Y. M. C. A., 25 yards, second;<br />\nW. H. Thatcher, J. H. U., 45 yards, third;<br />\ntime, 5.18 2-5. C. D. Humphreys, J. H. U.;<br />\nA. Adler, J. H. U.; W. S. Chambers, W. Y.<br />\nM. C. A.; A. C. Gilbert, W. Y. M. C. A.; W.<br />\nS. Freeburger, C. Y. M. C. A.; C. D. Hall,<br />\nJr., C. Y. M. C. A.; L. Harper, C. Y. M. C.<br />\nA.; Val Rettaliata, unattached; J. T. England,<br />\nJ. H. U.; E. F. Kirkness, G. Y. M. C. A.;<br />\nW. E. Peerce, W. Y. M. C. A.; A. A. Flanagan, St. L. G., and S. S. Crane, St. L. G.,<br />\nalso ran.<br />\nPotato Race—C. F. Edwards,J. H. U., first;<br />\nC. W. Young, J. H. U., second; F. Hazlehurst, J. H.U., third; time, 52 2-5. F. Blanck,<br />\nJ. H. U.; F. H. Adler, J. H. U., and E. F.<br />\nKirkness, G. Y. M. C. A., also ran.<br />\nFour Hundred and Forty Yards Dash,<br />\nHandicap—T. F. Riggs, J. H. U., 8 yards,<br />\nfirst; W. C. Curley, C. Y. M. C. A., 18 yards,<br />\nsecond; H. Lindsay, C. Y. M. C. A., 20 yards,<br />\nthird; time, 1.01.<br />\nEight Hundred and Eighty Yards, Novice,<br />\nScratch—J. T. England, J. H. U., first; C. T.<br />\nHoward, W. Y. M. C. A., second; F. Richardson, C. Y, M. C. A., third; time, 2.21.<br />\n<br />\nFIELD EvErrrs.<br />\nForty yards dash, scratch, interscholastic:<br />\nRunning High Jump, Handicap; Limit, 6<br />\nSemi-finals (firsts and seconds to qualify):<br />\ninches—R. F. Lemat. unattached, 254 inches,<br />\nFirst Heat—E. L. Pessagno, J. H. U., first; first, 5 feet 8 inches; Robert Garrett, J. H. U.,<br />\nH. K. Tootle, J. H. U., second; time, 5 sec- 2 inches, second, 5 feet, 754 inches; J. V. Prenonds.<br />\ntiss, C. Y. M. C. A., 4 inches, third, 5 feet,<br />\nSecond Heat—W. W. Weedon, J. H. U.,<br />\n754 inches.<br />\nfirst; F. Blanck, J. H. U., second; time, 5 secSixteen Pound Shot, Handicap; Limit, 8<br />\nonds.<br />\nFinals—E. L. Pessagno, J. H. U., first; H. feet—Robert Garrett, J. H. U., scratch, first,<br />\nK. Tootle, J. H. U., second; F. Blanck, J. H. 41 feet, I inch; H.0. Cole, W. B. Y. M. C.<br />\nA., 4 feet,.6 inches, second, 37 feet, 4 inches;<br />\nU., third; time, 4 4-5 seconds.<br />\nSpecial Invitation Relay Race Between Johns L. T. Eberle, St. L. G., 5 feet, third, 32 feet,<br />\nHopkins University and St. John's College— 4 inches.<br />\n<br />\n•<br />\n<br />\n\f9<br />\n<br />\nTHE NEWS-LETTER.<br />\nWHERE! OH WHERE IS OUR BASE-<br />\n<br />\nAMONG THE COLLEGES.<br />\n<br />\nBALL TEAM?<br />\n<br />\nathletic department of the University<br />\nTHE<br />\nof Chicago has started the policy of giving the University \"C\" to winners of indoor<br />\nmeets,<br />\nww<br />\nThe candidates for Yale's track team are<br />\nshowing up strong in the field events, but not<br />\nso well in the runs. There are 130 men in the<br />\nfield.<br />\n<br />\nSINCE\"Robbie\"and his small band of baseball enthusiasts have been practicing in the<br />\ncage here of late, considerable interest has<br />\nbeen shown in a base-ball team for Hopkins.<br />\nThere seems to have been for some time past<br />\na sort of half-hearted movement on foot to get<br />\nthe consent of the Athletic Association for a<br />\nteam. Such a movement will undoubtedly<br />\nmeet with serious opposition, on account of the<br />\ndeplorable manner in which last year's team<br />\nwas managed, and its untimely end. Yet, if<br />\nthe supporters of this new movement show<br />\nenough earnestness to warrant it, and will<br />\nguarantee a team which will practice, and stand<br />\nby the University during the entire season,<br />\nthere can be no doubt but that the Athletic<br />\nAssociation will give such a team its hearty<br />\nsupport.<br />\nSeveral challenges have been received from<br />\nprominent colleges and associations, and it<br />\nseems rather sad, that we energetic Hopkinsonions who are making such rapid strides in<br />\nother lines of athletic sport, cannot organize<br />\nand support a base-ball team. Probably the<br />\nmain handicap to last year's attempt was the<br />\nlack of grounds out of doors, on which to<br />\npractice. Such is not the case this year, as we<br />\nhave new grounds specially adapted to baseball, at a moderate distance from the University.<br />\nIf the men who are interested in this project<br />\nmean business, and have any hope of organizing a team, it is high time that the movement were being pushed as is is getting late in<br />\nthe season. We have made a \"rep for Hopkins in Football, Lacrosse, Track and Field.<br />\nThen with good material, and men who are<br />\nanxious and ready to make it a success, why<br />\ncan we not have a base-ball team.<br />\n<br />\nOr OW sr<br />\n<br />\nPreparations are now in progress at Yale for<br />\na gigantic torch-light celebration of their Bicentennial on October 21St.<br />\nsir W W<br />\n<br />\nUniversity of Michigan has registered in all<br />\ndepartments, 3,538 students.<br />\nwww<br />\nThe tenth anniversary of the founding of<br />\nthe University of Chicago will be celebrated<br />\nnext June, by appropriate exercises, including<br />\nathletic contests, dramatic performances, and<br />\nsocial features.<br />\nw<br />\nThe California State Legislature has passed<br />\na bill appropriating $1oo,000 a year for the<br />\nnext decade for the support of the University<br />\nof California.<br />\nwww<br />\nAlmost every college in the country is busy<br />\nwith some debating contest to be held around<br />\nthis time.<br />\nwww<br />\nLafayette College has adopted a set of rules<br />\ndefining the eligibility of candidates for athletic teams. It is interesting to note that<br />\nHopkins was among the first American Colleges to adopt such rules.<br />\nJO As JP<br />\n<br />\nThe oldest college in the world is Mohammed College at Cairo, Egypt, which was moo<br />\nyears old when Oxford was founded. It has<br />\nti,000 students.<br />\n▪w<br />\nThe faculty of the Iowa State College has<br />\ngiven to the editor-in-chief of the college journal three hours credit per term, and one<br />\nTeddy—Won't you come and see our new hour's credit to each of his assistants.<br />\nbaby?<br />\nwww<br />\nThe University of Chicago is to have a new<br />\nOld Maid—Yes dear, when your mother is<br />\nclub house for the use of students. The buildbetter.<br />\nwill cost about poo,000.<br />\ning<br />\n—Ex.<br />\nTeddy—Oh, but it aint catching.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\nUNIVERSITY NEWS NOTES.<br />\n<br />\n.A6 JO .A6<br />\n<br />\nThe course of lectures this year on the<br />\nTurnbull Lectureship foundation will be given<br />\nby Hamilton W. Mabie, Litt. D., editor of<br />\n\"The Outlook,\" and author of several literary<br />\nworks. The subject of the course will be<br />\n\"Poetry in America.\" The lectures will be<br />\ngiven in McCoy Hall, at 5 o'clock, beginning<br />\nTuesday, April 16th; they will begin punctually and will close within the hour. The door<br />\nwill be closed when the lecturer rises.<br />\nJab .a6<br />\nAt their last monthly meeting, the Trustees<br />\ndid not discuss the presidency of the University or the proposed endowment fund. A letter from Mr. Henry 0. Thompson, Treasurer<br />\nof the Alumni Association, presented the University p000 as the nucleus of a fund for the<br />\nestablishment of an alumni scholarship. The<br />\ngift was accepted with thanks..<br />\nThe trustees designated the professorship<br />\nfounded some time ago by Dr. Henry Willis<br />\nBaxley as the Baxley Professorship of Pathology. They voted their thanks to Mr. Henry<br />\nSonneborn and Mr. Jesse Tyson for recent<br />\ngifts to the University.<br />\n<br />\nDr. John Dewey, Hopkins Fellow in '83, and<br />\nPh. D. '84, who is at present Professor of Philosophy in the University of Chicago, has been<br />\nappointed the head of the Chicago University<br />\nHigh School. This school is to be result of<br />\nthe consolidation of the Chicago Institute with<br />\nthe University of Chicago.<br />\nsr or or<br />\nProfessor James Schouler, LL. D., of Boston, author of a \"History of the United States<br />\nunder the Constitution,\" will deliver four biographical lectures in continuation of his<br />\ncourse begun last year, on the great founders<br />\nof the American Republic. The lectures will<br />\nbe given in the Donovan Room, McCoy Hall,<br />\nat 5 p. m., on March 20, 22, 27, and 30.<br />\nw or or<br />\nProfessor John Bassett Moore, LL. D., of<br />\nColumbia University, formerly Assistant Secretary of State and later Secretary to the Peace<br />\nCommission at Paris, will deliver two lectures<br />\non international questions,—\"Our Treaty with<br />\nSpain,\" and \"Our Policy in the Far East.\"—<br />\nThe lectures will be given in McCoy Hall, at<br />\n5 p. m., on March 19th and 21st.<br />\n<br />\nThe Senior—Junior debate is to take place<br />\nat 8 o'clock to-night in McCoy Hall.<br />\nThe chairman of the committee of arrangements is Mr. Harry S. Bryne, who is president<br />\nof the Senate. Mr. A. W. Bruton will be chief<br />\nusher, Mr. Aubrey Pearre chairman of the<br />\ncommittee on invitations, and Mr. Norman<br />\nBoyer chairman of the press committee. The<br />\narrangements committee has decided to limit<br />\nadmission to the debate to those who have<br />\ntickets. These tickets may be obtained from<br />\nmembers of the Committee.<br />\nThe Musical Clubs will take part in the exercises.<br />\nThe Freshmen who will declaim for the Lee<br />\nprize at the same time, are Plaggemeyer, Blum,<br />\nand Zimmerman.<br />\nw or sr<br />\nThe class of '92 held its ninth consecutive<br />\nreunion and banquet Friday of last week at<br />\nthe Johns Hopkins Club. Dr. Thomas R.<br />\nBrown presided. City Councilman George<br />\nStewart Brown, whose exchange of compliments with the Mayor is still talked of, responded to the toast, \"My friend Mr. Hayes.\"<br />\n<br />\nproposed excursion of a number of<br />\nTHE<br />\nHopkins students to Homewood has been<br />\npostponed, on accouut of the illness of a member of Mr. Wyman's family.<br />\nor gr or<br />\nThe audience at the first of Mr. Frederic<br />\nHarrison's two lectures on King Alfred, delivered March 8th, was the largest that has assembled in McCoy Hall this season. Mr. Harrison is a most graphic and instructive speaker.<br />\n.416 JP JP<br />\nPresident Gilman has returned from a short<br />\nvisit to New York, which he made in order to<br />\ntestify that his name had been forged by the<br />\nnotorious swindler Raymond, in a letter to<br />\nPresident Hadley of Yale.<br />\nDr. Herbert B. Adams left Baltimore March<br />\n7th for a six weeks journey, in search of<br />\nhealth and rest. Dr. Adams will stay some<br />\ntime in Florida, and may then go to New Orleans to visit his nephew, Lieut. Edward<br />\nAdams, a Hopkins man of the class of '97.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nINQUIRY COLUMN.<br />\n(In this column the NEWS LETTER will answer, to the best of<br />\n<br />\nits ability, the queries fowarded by correspondents.).<br />\n<br />\n11<br />\n<br />\nSIX LITTLE TEST TUBES.<br />\nSix little test-tubes<br />\nSitting in a rack,<br />\nOne in the Bunsen flame<br />\nSoon showed a crack.<br />\n<br />\nWhen I wake up in the morning I am very<br />\ntired and listless. Am nearly always late to 9<br />\nFive little test-tubes,<br />\no'clock lecture, and frequently fall asleep in<br />\nRather scared they seem.<br />\nclass. Can you suggest a remedy ?—Senior.<br />\nOne used to melt some lead;<br />\nYour trouble seems to be a very common One<br />\nNow a \"has been.\"<br />\nespecially among students. The following<br />\nFour little test-tubes,<br />\ntreatment has been found generally efficacious.<br />\nAll that remain,<br />\nTake a plunge bath in water of 100 FahrenOne fell on the floor:<br />\nheit, containing a pinch of salt, every morning<br />\nNe'er again the same.<br />\njust before waking. Then vigorously massage,<br />\nwith both hands, the back muscles just between<br />\nThree little test-tubes,<br />\nthe shoulders. These are the ulterior—dextrose<br />\nOne got wet;<br />\n—ambilous deltoids (Mackdermott), the musTrying to dry it,<br />\ncles that control the eyelids. If you take the<br />\nJoined the broken set.<br />\nmassage for four or five hours every morning<br />\nfor ten years, you will never have any more<br />\nTwo little test-tubes,<br />\ntrouble with sleeping in class.<br />\nOne heated hot;<br />\nSomebody picked it up,<br />\nI have heard that the editors of the HullaQuickly let it drop.<br />\nbaloo would like to receive humorous contributions, and as I have held quite a reputation as<br />\nOne little test-tube,<br />\na joker, I thought I might send in some real<br />\nHardest one to kill;<br />\ngood stuff. Would you advise me to help<br />\nSoon he got smashed,<br />\nthem.-19o3<br />\nThen came the bill:<br />\nDon't do it. We must think a little of the<br />\nMR. CRASHER BREAK,<br />\neditors.<br />\nTo the J. H. U. (Per Mrs. Stuart), Dr.<br />\n$0..50<br />\nDear Mr. Editor: I have the honor of being To half dozen test-tubes<br />\na candidate for the debating team of our class,<br />\nJ. T. S.,'03.<br />\nsr ger of<br />\nbut am having trouble to find an audience.<br />\nEXCHANGE PLACE.<br />\nEvery one about the University seems very<br />\nbusy, when I ask them to listen to me, yet I<br />\nthink a little criticism is a good thing, once in<br />\nAT THE CLASS BANQUET.<br />\na while. How can I obtain an audience.<br />\ngoing to get drunk tonight, Jim?<br />\nyou<br />\nAre<br />\n—Orator.<br />\nWell, it wouldn't be right for the president,<br />\nThe best thing for you to do is to go to one<br />\nof the Prep. Schools, where you can easily ob- you know.<br />\nI'd rather be drunk than president.<br />\ntain an appreciative audience by announcing<br />\nthat you are a VARSITY MAN. This will renJP<br />\nder anything you may say a divine utterance.<br />\nThree<br />\nwas a crowd, and there were three—<br />\nIs it wise to go to drawing on time, or a litThe girl, the parlor lamp and he,<br />\ntle late ?—Artist.<br />\nTwo is company, no doubt<br />\nNever think of going to drawing before 3 P.<br />\nThat's why the parlor lamp went out.<br />\nM. If you do, you may frighten the instructor into spasms.<br />\nH. R.V.<br />\nJO JA .A6<br />\nsr<br />\n<br />\nW<br />\n<br />\nFresh—There was an awful \"rough house\"<br />\nduring Eng. exam.<br />\nSoph—What was the matter?<br />\nFresh—The sentence in italics was \"loose.\"<br />\n—Ex.<br />\n<br />\nIn an examination the students were required to give the principal parts of \"to skate.\"<br />\nOne of them did it as follows: \"Skate,<br />\nslippere, fallen, bumptum.\" The professor<br />\nmarked his paper: \"Fail, failere, flunxi, suspensum.\"<br />\n<br />\n\fJAS. H. DOWNS,<br />\n<br />\nMEMBERS OP<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD 01. TRADE.<br />\n<br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br />\n<br />\n229 N.<br />\n<br />\nCLINTON P. PAINE & CO,<br />\nBANKERS AND BROKERS,<br />\n<br />\nHOPKINS!!<br />\n<br />\nSMOKE UP! RAH! RAH! RAH!<br />\nIF ITS<br />\n<br />\nANYTHING IN TOBACCO YOU WANT<br />\n<br />\nGO TO I.<br />\n<br />\nFOR Class, Fraternity and College Stationery, Banquet Cards,<br />\n<br />\n217 EAST GERMAN STREET,<br />\nBALTIMORE, MD.<br />\n<br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br />\n<br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br />\n<br />\nThe Chas, Mims Surgical Instrument Co,<br />\nBENJ. A. NELSON, GEN'L MANAGER.<br />\n<br />\nD. LANG, TOBACCONIST,<br />\n<br />\nPhysicians, Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br />\n<br />\n833 MADISON AVENUE.<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br />\n<br />\nBOX TRADE A SPECIALTY.<br />\n<br />\nDrovers et Mechanics National Bank of Baltimore.<br />\nSurplus and Profits, $350,000.<br />\n<br />\nCapital.Stock $300,000.<br />\n<br />\nCHARLES ST.<br />\n<br />\nMASONIC TEMPLE.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n300 N. HOWARD ST.<br />\n<br />\nMUELLER,<br />\n<br />\n5 WEST LEXINGTON ST.<br />\n(LONDON STUDIO.)<br />\nFINEST PHOTOGRAPIC WORK<br />\nIN THE CITY.<br />\n<br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br />\n<br />\n.8\"..7. 00<br />\n<br />\nSafe .2:Psioesit...92oates<br />\n<br />\nJ. D. Wheeler, Cashier.<br />\nChas. S. Miller, Asm't Cashier.<br />\n<br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br />\n<br />\nA. H. FETTING,<br />\n14<br />\n<br />\nAND 16<br />\n<br />\nWpwrwat<br />\n<br />\na,,<br />\n<br />\nMANUFACTURER OF<br />\n<br />\n(Ma Letter 'fraternity<br />\nJewelry.<br />\n<br />\nST. PAUL STREET.<br />\n<br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br />\n<br />\nor,<br />\n;ZS<br />\n<br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br />\n<br />\ncomposer, pianist, and teacher, of<br />\nThe distinguished<br />\nParis, writes as follows regarding the<br />\n<br />\nMASON & HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nMORITZ MOSZKOWSKI.<br />\n(Signed)<br />\nrank.\"<br />\n<br />\n321 N. Howard Street.<br />\n<br />\nC. H. Hildebrandt & Son, Sole Agts.<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS. GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br />\n<br />\nA. SCHUMACHER & CO<br />\nGeneral Agents.<br />\n<br />\nDIRECT.<br />\n<br />\nki<br />\n<br />\nalo It SURETY BONDS<br />\n<br />\nvdei*<br />\n<br />\nMORITZ MOSZKOWSKI,<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nor w or CABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br />\n<br />\nwe.*<br />\n<br />\nthe<br />\n<br />\n'Fidelity and Deposit Company of Maryland,<br />\n<br />\nKranz-Smith<br />\npiano CO,<br />\n<br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br />\n<br />\nChickering, Bradbury and Webster<br />\n<br />\ngm Pianos. *it<br />\nC. dc P. Phone 2322-2.<br />\n<br />\nFactory Prices<br />\n<br />\nBARTL,EXT, HIAYWARD &CO.<br />\n• 'founders and Engineers, ••<br />\nWorks. Pratt and Scott Sta.<br />\nOffice Calvert and German Sta.<br />\nManufacturers ofCast and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers, etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON STS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT SOXES.<br />\n<br />\nEDWIN WARPIELD, Pres't.<br />\nsst Vice-Preset, H. Crawford Black.<br />\nJos. R. Stonebraker.<br />\n\"<br />\n2nd<br />\nThos. A. Whelan.<br />\n\"<br />\n3rd<br />\n<br />\nII. E. BOSLER, Sec'y-Tretts.<br />\nHarry Nicodernum,<br />\nAss't Seey-Treas<br />\n<br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\nAutomatic Attachments for<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES.<br />\n<br />\n\"Washburn\"<br />\n\"<br />\n4.1ingellus\"<br />\n<br />\n201-203 N. CHARLES STREET.<br />\n<br />\nBOOKS<br />\n<br />\nOld and<br />\n<br />\nNew.\"<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\n605 N. Eutaw St.<br />\nW M. V. PIPPEN.<br />\n<br />\nsTONEBRAKER BROS.,<br />\n<br />\n* PRINTERS,<br />\nLet us Estimate on your/Spring Catalogues, etc.<br />\n217 E. BALTIMORE ST.<br />\n<br />\n\fgzstt*****************<br />\n<br />\nSMITH, DIXON &<br />\n<br />\n(All. AND (JET AN ESTIMATE.<br />\n<br />\not PAPER<br />\n<br />\nSTONEBRAKER BROS.,<br />\n<br />\n04<br />\n<br />\nPRINTERS.<br />\n29-31 B_ CI-I-A.1=2,1,ES ST_<br />\n<br />\nGlobe<br />\nBrewery<br />\n<br />\nLifrii4-***<br />\n*<br />\n)<br />\n<br />\nLAGER BEERS<br />\nOoldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br />\n<br />\nJ. Wm. Middendorf.<br />\n<br />\nWm. 13. Oliver.<br />\n<br />\nMIDDENDORF OLIVER & CO.<br />\n<br />\nBankers and Brokers,<br />\n206 E.A.ST GERIVI.A.N STREET,<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br />\n<br />\nBartholomay Brewery Co.<br />\nROCHESTER, N. Y.<br />\n<br />\nBARTHOLOMAY'S<br />\n<br />\nBohemian<br />\nROCHESTER BEER. Bavarian<br />\nBALTIMORE<br />\nGiaerzen 13rau<br />\n• BRANCH<br />\n2/7-2395.IENTRAL AVE,n(<br />\n„GEO.C•SUCRO•<br />\nApollo<br />\n• MANAGER • •• • '<br />\n• ORIGINALAND FAMOUS ®<br />\nTRADE MARH•<br />\n<br />\nOffice and Depot, 227-239 S. Central Avenue.<br />\nMD.<br />\n<br />\nGEO. C. SUCRO, Sole Agent.<br />\n<br />\nWedding Silver Tr1i1d'efsor<br />\n<br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br />\n<br />\nIN GREAT VARIETY.<br />\n.111,N1KIN8,<br />\n<br />\nit Silversmiths.<br />\nHENDERSON'S 04<br />\n218 N. CHARLES ST.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE,<br />\nTEXT BOOKS. NOTE BOOKS,<br />\nSTUDENT'S SUPPLIES.<br />\n<br />\nHome Telephone 2060<br />\n<br />\nC. & 1'. Telephone UM<br />\n<br />\nESTABLISHED 1879.<br />\n<br />\nJA4.:0E31<br />\n<br />\nIS THE<br />\n<br />\nATLANTIC TRAINSP'ORT CO.<br />\n<br />\n403-409 WATER ST.<br />\n<br />\n1 BROADWAY<br />\n<br />\nBALTIMORE.<br />\n<br />\nNEW YORK<br />\n<br />\nLawrence B. Kemp,Preside''(.<br />\n<br />\nWilson Keyser, Cash ice.<br />\n<br />\nCORTIERCIRL & FARRIERS NRTIONFIL BRNK,<br />\nHOWARD<br />\n<br />\nAND<br />\n<br />\nGERMAN<br />\n<br />\nSTREETS,<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nMADISON & HOWARD STS.<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nHABERDASHERS.<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br />\n<br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nTHEO. WARNER,<br />\n<br />\nJAMES R. PAINE.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, 6) HATTERS, CID CANES, Erc<br />\n<br />\nHIGH GRADE! GOODS—LOW PRIeBS.<br />\n203 W.<br />\n<br />\nBALTIMORE AND 2 S. LIBERTY STREETS.<br />\n<br />\nphotograph,<br />\nSUCCESSOR<br />\n20<br />\n<br />\nLincoln & Bennett and Walter Bernard's London Hate.<br />\n324 W. BALTIMORE STREET.<br />\n<br />\nAgents for<br />\n<br />\nMANUFACTURERS OF<br />\n<br />\nSilk and Cassimere II a Es.<br />\n<br />\nIlgenfritz<br />\nStudio.<br />\n<br />\nCushing & Companu<br />\n34<br />\n<br />\nTO CUMMINS<br />\n<br />\nWEST LIECXI NOTON STR BET.<br />\nSPECIAL DISCOUNT TO STUDENTS.<br />\n<br />\nHELEN NI. 1-101_,L,YDAY,<br />\n600 N. ELJTA.W<br />\nBALTIMORE. MD.<br />\n<br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br />\n<br />\nlinheuser•Busch<br />\nBrewing Ass'n<br />\n<br />\nKawqb-HOPKINS CAPS.<br />\n<br />\nBOOKSELLERS AN.<br />\nSTATIONERS.<br />\n<br />\nW BALTIMORE STREET<br />\n<br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS<br />\n<br />\n•oons.<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins Hospital and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\nYou get the benefit of<br />\nall this labor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cata[logue.<br />\nCHAS. M. STIIBRP,<br />\nN.<br />\nLiberty<br />\nSt.,<br />\nBaltimore,<br />\n521<br />\nMd.<br />\nnth<br />\nSt., N. W., Washington, D. C.<br />\n9<br />\n<br />\n5.T2E!<br />\n<br />\nB. G. EICHELBERGER,<br />\n<br />\nSt. Louis Mo.<br />\n<br />\nBOOKS AND STATIONERY,<br />\n<br />\nBrew the Best Beers<br />\nin the World.<br />\n•ALTINIOPIE •IIIANCH:<br />\n<br />\nENGRAVING AND STAMPING.<br />\nNo. 308 North Charles Street,<br />\n<br />\nLOUIS ULMER,<br />\nGen'l Agent and Mg.<br />\nC. & P. Telephone<br />\n2314.<br />\n<br />\nY. M. C. A. BUILDING,<br />\n<br />\nC.& P. Telephone 2351.<br />\n<br />\nSTONEBRAKER BROS.,<br />\n2ir E. Baltimore St.<br />\n<br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br />\n<br />\n\fFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nSEASON,<br />\n<br />\nLEMMERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br />\n<br />\nLEMMERT<br />\n<br />\nFORD'S!(.THE THEATRE<br />\n<br />\nOF BALTIMOREA—s<br />\n<br />\nMAR. 25<br />\nONE<br />\nWEEK.<br />\n<br />\n••••<br />\n<br />\nVADIS.<br />\n<br />\nAPR. 8.<br />\nONE<br />\nWEEK.<br />\n<br />\n.111.•<br />\n<br />\nNIXON ec<br />\nZIMMERMAN'S<br />\n<br />\nBOSTON OPERA.<br />\n<br />\nO.<br />\n<br />\nACADEMY OF music!<br />\nANNIE RUSSELL IN \"A ROYAL FAMILY.\"<br />\n<br />\nWEEK OF<br />\nMAR. 18.<br />\nWEEK OF<br />\nMAR. 25<br />\n<br />\nC•41<br />\n<br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE<br />\n14 E. FAYETTE STREET.<br />\n<br />\nQUCI<br />\n<br />\n\"awe<br />\n<br />\nTHE<br />\n<br />\nIFA12/VI.<br />\n<br />\nDAIRY<br />\n<br />\nWIDE AWAKE WHISKEY.<br />\n<br />\nLEMMERT.<br />\n<br />\nPECI A L DISCOUNT! ot<br />\nTo the Students and Nurses of Johns Hopkins we will make a<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n9r<br />\n<br />\nYOUR HEAD, SIR<br />\n/141.1<br />\n<br />\nis the noblest part of your<br />\nbody. Improve its appearp ance and comfort by wear- \"<br />\ning OUR HATS.<br />\n<br />\nMINOR'S,<br />\n<br />\nJIEFFRES STUDIO, w<br />\n<br />\nUP-TO-DATE,<br />\n<br />\n218 NORTH EUTAW STREET,<br />\n108 N. CHARLES STREET.<br />\n<br />\nBALTIMOF1E, MD.<br />\n<br />\n11011,APFEL 6 BEirtt<br />\n<br />\n14~faleiteitititeetZZaitititaiWitetiteitileitititeiA<br />\n<br />\nH.<br />\n<br />\nit mandolins*<br />\n<br />\nONE PRICE.<br />\n<br />\nB.<br />\n<br />\nMANDOLINS, GUITARS an<br />\n\"have a tone<br />\n<br />\nBANJOS<br />\n<br />\nThat's all their own.\"<br />\n<br />\nHOLZAPFEL & BEITEL, 306 PEARL ST.,<br />\nNEAR<br />\n<br />\nGUITARS AND BANJOS.<br />\n<br />\nOPEN EVENINGS.<br />\n<br />\nSARATOGA ST.<br />\n<br />\nINSTRUMENTS TAKEN IN<br />\n<br />\nExCHANCE.<br />\n<br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br />\n<br />\nSTONEBRA<br />\n...- -<br />\n<br />\n. ,. . \". \"-‘,. . .,<br />\n<br />\n•.,----\\<br />\nKERBR05.<br />\n..—<br />\n<br />\nJ. SMITH,<br />\n9<br />\n..<br />\n<br />\nNM%VAMSNIAMEMMENNSTAMMUSSMZ=Mata<br />\nDealer hi<br />\n<br />\nPri r\\te<br />\nErv5 r'elVers)<br />\n,<br />\n,p,;.4.<br />\n<br />\n-4<br />\n<br />\nBOOKS<br />\n<br />\nOld and New<br />\n<br />\nSPASTMATMagargeMIZAMTATAWSMSTSVASENTATEMSZUM=<br />\n<br />\nPutker s..,.„):<br />\n)<br />\n217 E.BATO<br />\nt'<br />\n<br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br />\n<br />\nI3ALTIMORE, MD.<br />\n<br />\nCall at 805 North Howard Street,<br />\n3 DOORS ABOVE MADISON.<br />\n<br />\nNovember 7th, f900.<br />\nWhile visiting the Paris Exposition of 1900, the wonderful display of<br />\nwines from all parts of the world was made a special study by our representative, who secured some very tine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Cgtnet, Chateau Larose, Chateau Lafitte, Chateau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintair.s of Deinhard & Co.'s celebrated Rhine<br />\nWines selected while visiting thew great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Offley Forrester & Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nfIfelfleitleleVielf,fieletY,Cif,elf!tettelf!\".315(Mlelfleler<br />\n<br />\n\"WIDE AWAKE\"<br />\nMARYLAND RVE<br />\n<br />\nWHISKEY.<br />\n<br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br />\n<br />\nJOSEPH R. STONEBRAKER & CO.,<br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nSTONEBRAKER BROTHERS,<br />\n211 E. BALTIMORE ST.,<br />\n<br />\n.At<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\n009900000014000004iititialig4044A0<br />\n<br />\nADVERTISE IN THE \"NEWS LETTER.\"<br />\n<br />\neps .4 04<br />\n<br />\n\f", "format": "basic_html", "processed": "•9/<br /><br />\nl0oscm)<br /><br />\n•<br /><br />\nAP<br /><br />\nmil 111111315<br />\n1:1111<br />\n)t.<br /><br />\n11111111c<br /><br />\nPublished kny tle Students of<br /><br />\ntie<br />\nnsilopkinsOblewIssued<br /><br />\nBaltimore<br />\n1.45.<br />\nPRESS OF STONEBRAKER •ROS.. BALTIMORE.<br /><br />\nFortnightly<br /><br />\nJOHNS HOPKINS<br />\nUNIVERSITY.<br />\nBALTIMORE, MD.<br /><br />\nTwenty-Fifth Year.<br /><br />\n13eginning October 1st, 1900.<br /><br />\nPresident,<br />\nDean ofthe Medical School,<br />\nDean ofthe College, .<br /><br />\nDANIEL C. GILMAN<br />\nWm. H. HOWELL.<br />\nEDW. H. GRIFFIN.<br /><br />\nINSTRUCTION.<br />\nFor Uraduate Students:<br />\n(a) In Philosophy and the Arts. (Courses for candidates \"<br />\nfor the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree<br />\nof M. D.; courses for physicians.)<br />\nFor Undergraduates:<br />\n(c) As candidates for the degree of B. A.<br />\n(d) As special-students.<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPeabody Institute<br />\nPratt Library<br /><br />\n96.000 volumes.<br />\n135.000 volumes.<br />\n200.000 volumes.<br /><br />\nLaboratories.<br />\nPhysics,<br />\nChemistry,<br />\nGeology and Mineralogy,<br />\nzoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology,<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br /><br />\nDirectors.<br />\nHenry A. Rowland.<br />\nIra Remsen.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oskr.<br /><br />\nSeminaries.<br />\nGreek,<br />\nLatin,<br />\nSanskrit,<br />\nSemitic,<br />\nGerman,<br />\nRomance,<br />\nEnglish,<br />\nHistory,<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nDirectors.<br />\nBasil L. Gilderskeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nHerbert B. Adams.<br />\nSidney Sherwood.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n1. Classical (the \"Old College Course.\")<br />\n2. Mathematical-Physical,<br />\n(leading up to Engineering.<br />\n3. Chemical-Biological,<br />\n(leading up to Medicine.)<br />\n4. Geological-Biological.<br />\n5. Latin Mathematical.<br />\n6. Historical-Political,<br />\n(leading up to Law.)<br />\n7. Modern Languages.<br />\nSerial Publications.<br />\nMathematics (vol. XXIII.)<br />\nChemistry (vol. XXV.)<br />\nPhilology (vol. XXI.)<br />\nHistory (vol. XIX.)<br />\nModern Languages (vol. XVI.)<br />\nBiology (vol. IV.)<br />\nAssynology (vol. IV.)<br />\nExperimental Medicine (vol. V.)<br /><br />\nEditors.<br />\nFrank Morley.<br />\nIra Remsen,<br />\nBasil L. Gildersleeve.<br />\nHerbert B. Adams.<br />\nA Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nPaul Haupt.<br />\nW. H. Welch.<br /><br />\nProgrammes of the Courses offered to graduate students<br />\nin Philosophy and the Arts, and in the School of Medicine,<br />\nand also of the Undergraduate or Collegiate Courses, will<br />\nbe sent on application to the Registrar.<br /><br />\nThe Johns Hopkins Press.<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY,Editor. Quarterly. 4to. Volume XXIII.<br />\nin progress. $5 per volume.<br />\nII.<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume XXV in<br />\nprogress. $4 per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo. Volume XXI in progress. $3 per volume.<br />\nIV. Studies from the Biolological Laboratory. 8vo. Volume V<br />\ncomplete. $5 per volume.<br />\nV. Studies in Historical and Political Science.<br />\nH. B. ADAMS, Editor. Monthly. 8vo. Series XIX<br />\nin progress. $3 per volume.<br />\nVI. Johns Hopkins University Circulars.<br />\nContaining reports of scientific and literary work in<br />\nprogress in Baltimore. 4to. Vol. XX in progress.<br />\n$1 per year.<br />\nVII. Johns Hopkins Hospital Bulletin. Monthly. 4to. Volume<br />\nXII in progress. $1 per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume VIII in<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Assyriology and Comparative Semitic Philology,<br />\n(Beitrage zur Assyriologie. etc.) Vol. IV in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nX.<br />\nW. K. BROOKS, Editor. Volume IV complete. $7.50<br />\nper volume.<br />\nXi. Modern Language Notes.<br />\nA. M. ELLIoTT, Editor. Monthly. 4to. Volume XVI<br />\nin progress. $1.50 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. H. WELCH, Editor. Bi-monthly. Svo. Volume<br />\nV in progress. $5 per volume.<br />\nXIII. American Journal of insanity.<br />\nIIENRy M. HURD, Editor. Quarterly. 4to. $5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWILLIAM B. CLARK. Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly. 8vo. Volume V in<br />\nprogress. $2.50 per volume. XVI. Annual Report.<br />\nPresented by the President of the Board of Trustees,<br />\nreviewing the operations of the University during the<br />\npast academic year.<br />\nXVII. Annual Register.<br />\nGiving the list of officers and students, and stating the<br />\nregulations, etc.,of the University. Published at the<br />\nclose ofthe academic year.<br />\nI.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nTHE CRITICAL EDITION OF THE HEBREW TEXT OF THE OLD<br />\nTESTAMENT. Edited by Professor Paul Haupt. Prospectus on application.<br />\nROWLAND'S PHOTOGRAPH OF THE NORMAL SOLAR SPECTRUM. 1.0 plates. $20.00.<br />\nDESCRIPTION OF THE JOHNS HOPKINS HOSPITAL. J. S. Billings, Editor. 116 pp. 4to. 56 plates. $7.50, cloth.<br />\nTHE TEACHING OF THE APOSTLES. Complete facsimile edi,<br />\ntion. Edited by J. Rendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nREPRODUCTION IN PHOTOTYPE OF SYRIAC MS WITH AlsITILEGOMENA EPISTLES. Edited by I. H. Hall. $8.00.<br />\nBIBLIOGRAPHIA HcPICINSIENSIS. Part I. Philology. Parts<br />\nChemistry, Minerology and Geology. Parts<br />\nIV-V-V1 Physics, Astronomy and Mathematics. 8 vo.<br />\n30 cents per part.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances may<br />\nbe sent to Johns Hopkins Press. Baltimore, Maryland.<br /><br />\nCbe news= Letter. *<br />\nVol. V.<br />\nAN<br /><br />\nMarch 21, 1901.<br /><br />\nINTERNATIONAL EPISODE.<br /><br />\nHE most casual observer of the map of<br />\nTSwitzerland<br />\nwill have noticed that the<br />\nsouthern boundaries are extremely irregular.<br />\nZigzag lines caused by mountains and valleys<br />\nand singular political divisions make the plan<br />\nof that country to droop like a tattered fringe<br />\nover the northern edge of Italy. It was in<br />\nconnection with these topographical peculiarities that I met with some adventures.<br />\nWe had started out on bicycles to go from<br />\nthe sunny town of Lugano to another Swiss<br />\ntown equally beautiful and equally Italian, to<br />\nLocarno on Lake Maggoire. The ride was delightful, and we proceeded with due enjoyment<br />\nof our surroundings, and in possession of passports and all necessary papers until we came<br />\nto the frontier hamlet of Fortessa. It was<br />\neasy to pass the Swiss custom house because<br />\nwe were going out, but it was not many moments before we realized that we were in a foreign country, for we were immediately halted<br />\nby another set of guards in uniform, who inspected our papers and looked critically upon<br />\nour persons. It never occurred to me that the<br />\nfew hours that we should be in Italy we<br />\nshould be under suspicion, but the Italian custom house wished to know where we were going. That was easily explained, but there<br />\nwere possibilities in the thing. We might turn<br />\noff at the next crossing, flee to the woods and<br />\nsell those bicycles, escaping the tax.<br />\nThere were various ways in which this matter might have been settled. We might have<br />\nbeen imprisoned and held until we were ready<br />\nto go back into Switzerland by the way we<br />\ncame, or, we might have been obliged to pay a<br />\ntariff duty about equal to the value of the machines, but the Italian government chose another way. It was delicately considerate and<br />\ncomplimentary. We were conducted across the<br />\ncountry under military escort. To be sure this<br />\nescort consisted of one soldier who had no gun<br />\nnor yet a bicycle. My better half mounted her<br /><br />\nNo. 11<br /><br />\nwheel and rode, but to allay suspicion, and to<br />\n'avoid the used of any weapons he might have<br />\nconcealed in his clothing, I walked, as far as<br />\nLuino, over two or three miles of the<br />\nmost aggravatingly smooth roads imaginable<br />\ndown through the city to the chief custom<br />\nhouse, paid an insignificant sum for the<br />\nexamination of our papers and the services<br />\nof our soldier, then passed on to the steamboat landing where we put the padlock on the<br />\nwheels and left them in charge of the guard.<br />\nPoor fellow! After all that walk he had to stay<br />\nthere two hours more, pass his supper time,<br />\nwhile we walked about, saw the town and fared<br />\nsumptuously. In fact, he followed the wheels<br />\non board the steamer, remained with us until<br />\nwe had passed an invisible frontier, and delivered us once more in the hands of the<br />\nSwiss.<br />\nI need not relate the details of the journey<br />\nwe took returning by a route entirely within<br />\nSwiss territory to Laganio. Suffice it to say<br />\nthat we soon after started southward for Como<br />\nwith the expectation of staying a few days on<br />\nthe Italian lakes and returning to Switzerland.<br />\nFor some reason I received the impression that<br />\nthe Italian custom house on that route would<br />\noffer no difficulties. I found my mistake at<br />\nChiasso. We had been coming slowly down<br />\nthe road, enjoying the landscape; and photographing the peasants, with no suspicion that<br />\nbicycles were an object of terror to Italian officials. As usual, we carried very little money<br />\non the road, and were unprepared to pay taxes<br />\nor to buy official courtesy. To my dismay the<br />\nPhilistines at Chiasso demanded ninety francs<br />\napiece for the passage of our machines. The<br />\nmost profound search revealed only half that<br />\nsum on the combined persons of the party. In<br />\nletters of credit they were not learned, and so<br />\nsmall a town could not pretend to have a bank.<br />\nThe nearest financial resource was at Como,<br />\ntwo miles away. Things looked dubious for a<br />\ntime, but at last a brilliant thought flashed<br />\nover me. I deposited my wife and one machine<br /><br />\n2<br /><br />\nTHE NEWS-LETTER.<br /><br />\nwith the custom house, and road the other to<br />\nComo after the money. In an hour and a half<br />\nI returned withe plenty of funds to claim my<br />\ndeposits. My active pledge had in the meanwhile employed her time with usury, for her<br />\nwater color brush had been capturing a small<br />\nItalian citizen in red cap and bare feet. By<br />\nthe time the papers were made out \"Miguel\"<br />\nwas fast in her sketch-book.<br />\nIf Lake Como had not been so often described, I might relate my impressions. These<br />\nlittle difficulties with human institutions made<br />\nno difference in the beauty of the scenery, but<br />\nI would not have you think that my adventures with the custom house ceased at this<br />\npoint.<br />\nThe journey from Como to Chiavenna can<br />\nbe made by rail, but we did not propose to<br />\ntravel in that manner, neither did we intend to<br />\nmake the trip in the ordinary way by water,<br />\nbut mounted our wheels, and started up the<br />\nwestern side of the western arm of the lake.<br />\nLake Como would be better described by the<br />\nuse of the word \"leg,\" for on the map it looks<br />\nlike an overgrown horse-raddish root on the<br />\nrun, the city of Como being fastened to the<br />\n\" toe of the forward foot. We followed the<br />\nroad as far as the little town of Torriggia.<br />\nHere the highway suddenly dwindled to a<br />\nmule path, and we sat down under the trees to<br />\nrest, to photograph and sketch until the next<br />\nsteamer came by. This arrived in the course<br />\nof an hour or two and we led our horses on<br />\nboard. As we mounted the steps of the upper<br />\ndeck we suddenly became conscious of friendly<br />\nfaces. First one and then the other came forward, until there were four young men from<br />\nBaltimore before us. Not only that, but they<br />\nwere all from my department of the University,<br />\nand persons with whom I had been in daily<br />\nassociation for years. You will excuse me if<br />\nI say this word \"paralyzed\" to express our<br />\nemotions, for at Bellaggio we changed the<br />\nsteamer for a row boat and had ourselves propelled to the north side of the lake. From<br />\nthat point we went up toward the passes of the<br />\nAlps by man power, furnished by members of<br />\nthe party.<br />\nIt was up in the pass above Chiavenna that<br />\nthe closing events of this episode took place.<br /><br />\nWe had pushed rapidly up the hill in order to<br />\nreach the Swiss border at the proper time, and<br />\nfull of haste and brown dust, I presented my<br />\npapers, receipts and passports. The official<br />\nwas very polite. The papers were all clear<br />\nthat I had deposited money, and that I was the<br />\nperson. Very sorry, however, that he had no<br />\nauthorization to /Say out money. Papers failed<br />\nto indicate at what point the bicycles were to<br />\nbe exported. I had in fact told the people at<br />\nChiasso a dozen times over that I was going<br />\nout by the way of Chiavenna, but they had<br />\nneglected the proper formalities. It would be<br />\nnecessary to request the Italian government in<br />\nRome to permit the custom house at Villa di<br />\nChiavenna to return me the duty on two bicycles. The thing looked for a moment like robbery, but I was comforted with the assurance<br />\nthat within two weeks the same thing had happened to eleven other Americans and that they<br />\nhad come out all right.<br />\nIt was Friday, and we were in the uttermost<br />\nparts of the kingdom. A petition by letter<br />\nmeant a week or more of delay. So armed<br />\nwith a properly worded telegram I hastened<br />\nback a mile down the hill to the shoemaker<br />\nwho kept the post and telegraph office, and<br />\nturned over my affairs to the minions of electricity. In the meanwhile, we made ourselves<br />\ncomfortable on the Swiss side of the line. It<br />\nwas a village of at least seven houses, and in<br />\nthe midst of chestnut trees, and side hill farming, performed by the female population. For<br />\ntwo whole days we studied Swiss institutions,<br />\npainted the scenery and collected botanical<br />\nspecimens.<br />\nAt five o'clock Saturday evening a reply,<br />\ndated at Rome at 12 the same day reached the<br />\ncustom house at Villa di Chiavenna, and our<br />\nfinancial matters were straightened out.<br />\nI have never obtained a really satisfactory<br />\nhistory of that message. One does not like to<br />\ncriticize unduly the methods of foreign governments when there may be great natural<br />\ndifficulties to overcome. Especially is it true<br />\nin this case, where anyone can see from the<br />\nmaps that Villa di Chianna is 2500 feet above<br />\nthe sea, and the wire from Rome comes all the<br />\nway up hill.<br />\nJOHN MARTIN VINCENT.<br /><br />\nTHE NEWS-LETTER.<br />\nAPELLO.<br />\nMr. Editor.<br />\nIt occured to me the other day that the great<br />\nuse of a Junior in College is to advise Freshmen: and since I am debarred in future, from<br />\ngiving Freshmen any more physical advice,<br />\nI am going to excercise my other prerogatives,<br />\nand give them some mental and moral advice<br />\nconcerning a matter which I think should be<br />\nbrought to their attention.<br />\nI wonder, to how many Freshman, has the<br />\nfact presented itself that they owe the University something more than their tuition fees?<br />\nYou applaud the leaders of your class, the<br />\nmembers of the athletic teams, and,sometimes<br />\nthe musical clubs. Do you ever try to do the<br />\nthings they do? You cannot, you say. How<br />\ndo you know you cannot? Have you tried?<br />\nIf you are musical or shine in the social world,<br />\njoin the musical clubs. If you are big and<br />\nstrong, patronize \"Mac\" and the cage. If<br />\nyou are studious, try for class honors. If you<br />\nare none of the above, but have a sneaking<br />\nfondness for Dr. Green's papers, try for the<br />\nNEWS-LETTER staff.<br />\nIt is to this last class of men that I address<br />\nthis appeal. It is your duty to help the paper,<br />\nbecause if you can write, your work is needed<br />\nin its columns. If the paper is not as good as<br />\nit might be (I am sure the editors will pardon<br />\nme) try and make it better. Criticism is good<br />\nbut work is better. How can the editors ever<br />\nimprove the NEWS-LETTER when everyone<br />\nabuses it, and no one writes for it? Don't be<br />\nlike the basement-loafers who look at their<br />\ncopies on alternate Thursday evenings, and<br />\nthen always say \"Well, it's a pretty bum<br />\nnumber. I don't see why we can't have a<br />\ngood paper here.\" I asked one of these gentlemen one day if he had even done anything<br />\nto make it better, and he said \"Oh, I sent in a<br />\npiece once, but they would'nt take it.\" I<br />\ndiscovered afterward that the piece in question<br />\nwas something on the order of Baccaccio's<br />\nfamous tales—naughty but very nice.<br />\nNow, boys, that is not the way to support<br />\nyour college paper. The NEWS-LETTER represents the literary ability of the Hopkins undergraduate body. To the world at large we are<br /><br />\n3<br /><br />\nknown by this paper. If we think it is poor,<br />\nwe should make it better. If you think you<br />\ncan write, try for the staff. If you don't make<br />\nit, write for the paper anyhow. If you have<br />\n,no literary ability, don't attempt to criticise<br />\nthose who have. I know you are going to say<br />\n\"Yes, that's true\" and then do nothing. I did<br />\nthe same thing. I am sorry now, and I am<br />\ndoing penance by trying to keep you from my<br />\nerror. There are places on the staff, fill them.<br />\nShow the rest of the world that the Hopkins<br />\nmen are not all ignorant, and,show the rest of<br />\nthe Hopkins men that the class of 1903 is alive to<br />\nits responsibilities. Don't wait 'till next year.<br />\nIt will be too late then. Try now, and then<br />\nnext year you will thank him who now gives<br />\nyou this advice.<br /><br />\nA JUNIOR.<br />\nGLORY BE UNTO HIM!<br />\n(Mr. W B. Swindell of the Senior class of the Johns Hopkins<br />\nUniversity Is engaged to be married to a young lady of Boston,<br />\nMass.—The Baltimore Sun.)<br /><br />\nhe's going to leave us! No longer<br />\nALAS,<br />\nwill his stentorian voice ring out in commanding tones urging a re-awakening of sleeping enthusiasts, no longer will the halls of<br />\nMcCoy resound with his glorious voice, no<br />\nlonger will the instructor in a political science<br />\nbe compelled to outvoice the voice of him in<br />\nthe holy corner. Yes he's going to leave us.<br />\nHe who is the J. H. U., he who is everybody,<br />\nhe who alone can command the bands of Hopkins, he—HE—HE is going to leave us. Weep,<br />\nye legions weep. The attractions of the North<br />\nare too strong for this Southern son of valor,<br />\nhe must go; even the baton of general is small<br />\ncompared to the northern attraction. He has<br />\nlaughed with us, he has fought with us, he has<br />\nlead us, he has spinached to us, and now he<br />\nwill no longer give pleasure unto himself thus.<br />\nThe future was bright before him. The<br />\nportals of a great institution were open to him.<br />\nGroup III, with variations, lead anywhere: it<br />\nhas lead to bliss for him. Happiness be with<br />\nhim; and may he be blessed with many joys.<br />\nSuccess and glory be unto him who is<br /><br />\nTHE CHIEF ROOTER.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n4<br /><br />\nUbe llews.letter.<br />\nPublished Fortnightly during the University Year by the<br />\nStudents of THE JOHNS HOPKINS UNIVERSITY.<br /><br />\nMARCH<br /><br />\n2!,<br /><br />\n1901.<br />\nio cents a single copy.<br /><br />\nSubscription $1.50 per year.<br /><br />\nAssistant News Editors, .<br /><br />\nWILLIAM B. HILL,1902.<br />\nSob STROUSE, 1902.<br />\n.<br />\n. . BLINN C. HILL, 1902.<br />\n{ROBERT S. LANIER, 1903.<br /><br />\n.<br /><br />\n. . .<br />\nEditor in Chief,<br />\nAssociate Editor in Chief,<br />\nNews Editor, . . .<br />\n.<br /><br />\n•<br /><br />\nOHN A. SLP.MONS, 1902.<br />\nArMAN C. MURPHY, 1902.<br />\nJOHN M. BAND/U., 1901.<br />\n. . .<br />\n.<br />\nBusiness Manager,<br />\n. AUBREY PHARR a, JR., 1902.<br />\nAssistant Business Manager,<br />\nAddress all articles, communications,etc.,to WILLIAM B. HILL,<br />\nbox 269,johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to<br />\nJOHN M. BANDEL, box 94, J H. U.; or box 398, Medical School of<br />\nJohns Hopkins Hospital.<br /><br />\nAthletic Editors,<br /><br />\n(1<br /><br />\ncolumn of this issue we publish<br />\nIN\"another<br />\nBilly\" Maddren's letter of resignation<br />\nfrom his position as President of •the Athletic<br />\nBoard. The \"NEWS-LETTER\" joins with the<br />\nstudent body in expressing its regret at the<br />\nloss from active leadership of one who has<br />\nbeen so conspicuous in athletic circles during<br />\nthe past three years.<br />\nWith the exception of Director Mackdermott, no one connected with the University is<br />\nmore thoroughly alive to our athletic interests,<br />\nnor more completely conversant with every<br />\nbranch of Hopkins sport than Mr. Maddren ;<br />\nwhile together with these qualities he combines<br />\nexecutive ability, and the faculty for imparting enthusiasm among the student ranks.<br />\nWhile Mr. Maddren has retired from his official position, we hope that we may still have<br />\nthe benefit of his advice in athletic matters.<br />\nIn choosing his successor we consider that<br />\nthe Board has exercised great discernment.<br />\nMr. Reese is one who has the athletic interests<br />\nof the University at heart, and anything he<br />\nundertakes is certain of a successful termination. Besides this he may rely upon the cooperation of the students.<br />\nor w<br />\nThe successes of the Track and Field Team<br />\nin the recent indoor meets in this city and<br />\nWashington show plainly that despite our<br />\nheavy losses of last year Hopkins still has a<br />\nteam which comes up to the high standard set<br /><br />\nby the champions of 190o. Some of the best<br />\nmen in the dashes and runs left the University,<br />\nbut those remaining form a nucleus on which<br />\nat the beginning of this year Director Mackdermott started to build. The material in the<br />\nFreshman class was good, and under hard<br />\ntraining soon developed some excellent men in<br />\nthe dashes, so that the first meet brought many<br />\nprizes to the trophy-room. The team has been<br />\nshowing up stronger at every succeeding meet,<br />\nand deserves the heartiest congratulations of<br />\nall Hopkins men for its zealous efforts. Though<br />\nit is composed of men from all branches of the<br />\nUniversity, there are enough younger men on<br />\nthe team to assure a firm foundation for next<br />\nyear.<br />\nor w<br />\nIn our last issue we called attention to the<br />\nduty now confronting us regarding the necessary improvements to be added to American<br />\nLeague Park, for the benefit of Hopkins Athletes. No matter what bright joys the future<br />\nholds in store for us, in the shape of expensive<br />\nathletic fields and green campuses, our present<br />\nneeds are pressing. The musical :clubs have<br />\ngenerously enlisted themselves in the service<br />\nof raising the finances needed for this purpose,<br />\nand will shortly give a concert for tha benefit<br />\nof the athletic fund. It is gratifying to see<br />\nhow the students have responded to the subscription call, and, judging from results thus<br />\nobtained, we predict that they can be counted<br />\nupon to turn out in a body the evening of the<br />\nconcert. Despite our lack of students, our<br />\nathletic victories during the last few years<br />\nhave placed Hopkins upon a higher footing in<br />\nthe athletic world, and this fact together with<br />\nbright prospects for the future should stimulate<br />\nus all to greater activity.<br />\nw<br />\nor<br />\nHE readers of this issue should mark well<br />\nand inwardly digest a communication in<br />\nthese columns headed \"Apello,\" and signed<br />\n\"A Junior\". The moral of the epistle is<br />\npointed at the members of the Class of 1903,<br />\nbut there is no reason why the rest of the<br />\nUniversity should not profit by the excellent<br />\nadvice contained therein. It is broad enough<br />\nto embrace all classes, but, doubtless the reason<br /><br />\nT<br /><br />\nTHE NEWS-LETTER.<br />\nfor especially admonishing the Freshmen is<br />\nbecause it is usually considered that their juvenile buoyancy is still in the effervescent<br />\nstage, and that their characters have not yet<br />\nbeen moulded into permanent form. In<br />\nby-gone days the \"NEWS—LETTER\" has harped<br />\nupon the theme of a man's duty to his college;<br />\nin days to come it will doubtless continue to sing<br />\nthis lay, but a letter like \"Apello\" coming as<br />\nit does from one not officially connected with<br />\nthis paper, carries with it more weight than<br />\nanything we may say upon the subject. Besides it is an encouraging sign, for it shows<br />\nthat the work of \"by gone days\" is finally<br />\nbearing fruit.<br />\niv or er<br />\nA gratifying recognition of the worth of the<br />\nUniversity has just been witnessed.<br />\nThe German American citizens of Baltimore<br />\npropose to contribute $100,000 towards the<br />\nendowment fund of a million now being raised.<br />\nThis contribution is to establish a chair of<br />\nGerman language and literature.<br />\nIt is reported that $20,000 of the amount<br />\nhas already been raised by fifteen gentlemen<br />\nwho are members of the Germania Club. We<br />\ntake pleasure in voicing the sentiment of gratitude which every Hopkins man must feel towards these liberal-minded gentlemen. Such<br />\ngenerosity should, and doubtless will,serve as<br />\nan object lesson to other beneficently inclined<br />\ncitizens of Baltimore.<br />\nor oir 9r<br />\nTHE HOPKINS CLUB.<br />\nIT is reported that the Johns Hopkins Club<br />\nmay soon move to other quarters. The growing attractiveness and interest would seem to<br />\ndemand a site more easily reached by the<br />\nmembers. The Club boasts of an excellent<br />\nkitchen and buffet, which may be enjoyed at<br />\nvery moderate rates; but the members do not<br />\nlunch or spend their evenings at the club as<br />\nmuch as they might, were the position nearer<br />\nthe University, or on their way from places<br />\nof amusement. Great atttactions too are<br />\noffered to members who wish to occupy rooms<br />\nin the club house. It is felt that this and the<br />\nother good features of the Club will be enhanced by a more central location.<br /><br />\n5<br /><br />\nTHE FRESHMAN BANQUET.<br />\nFreshman banquet, marking as it does<br />\nTHE<br />\nthe cessation of friendly clashes between<br />\nnaughty two and naughty three, was a howling<br />\nSuccess from several standpoints. Almost every<br />\nmember of the clsss attended, the apt speeches<br />\nwere well delivered, and the presence of two<br />\nJuniors during the festivities added a certain<br />\nfascination to the pleasure, and without doubt,<br />\nmade the affair the most unique in the annals<br />\nof similar feeds. The class of 1903 is the first<br />\nto enjoy the distinction of having entertained<br />\nsuch unheard of guests at its Freshmen banquet; and it is greatly to the credit of naughty<br />\nthree that at no time during the evening was<br />\na spirit of animosity exhibited. Songs were<br />\nsung, toasts were responded to, and frequent<br />\nknocks made at the Juniors, but at no time<br />\nwere any attempts made to belittle or discomfort the unexpected guests. Before the last<br />\ncourse had been served the aforementioned<br />\ngentlemen were invited to partake of Freshman<br />\nhospitality. They accordingiy drew up, and<br />\nthe mellowing influences of the spread soon<br />\nhad their effects. Both guests made very appropriate speeches, and assured their entertainers that, with the exception of 1902, naughtythree is the best class that ever entered Hopkins. They ended by expressing sincere apapreciation for the hospitality accorded them.<br />\nAs a toastmaster, Harry K. Tootle proved<br />\nto be the real thing. He was full of catchy<br />\njokes, and always had some bright remark<br />\nto continue the merriment. His address in<br />\nwhich he referred to \"taking the Law into<br />\nour hands\" was greeted with deafening applause. The toast \"Our Newly-Acquired<br />\nPossessions\" was construed by some to refer<br />\nto the Juniors present, instead of Homewood.<br />\nAccordingly, some very good puns were gotten<br />\noff by impromptu speakers. The jolly time<br />\nended with numerous class yells and songs,<br />\ninterspersed with several rousing \"Hullabaloos.\" The menu cards were bound in the<br />\nUniversity colors with \"class '03, J. H. U.\"<br />\nengraved in olive and white on the cover page.<br />\nMessrs. Robinson C. Pagon, Benjamin Weeks,<br />\nR. Curzon Hoffman, Wethered L. Lilly, and<br /><br />\npmmenimuminimmemnimmummumw.immommonimmummummmommmummemponminnwimmon<br /><br />\n6<br /><br />\n,<br /><br />\nTHE NEWS-LETTER.<br /><br />\nW. Sellman Bird composed the arrangement<br />\ncommittee. The toasts and those who responded are as follows: \"Our Class,\" by W.<br />\nS. Bird; \"The Freshman in Athletics,\" by A.<br />\nB. Atkinson; \"Our Enemies—the Juniors,\"<br />\nby J. B. G. Custis, Jr. ; \"The Loyalty of<br />\n1903,\" by H. W. Plaggemeyer; \"Next Year,\"<br />\nby H. T. Magruder; \"Naughty Three's Contribution to Melody,\" by R. C. Pagon; \"Hazing—Going or Coming ?\" by B. F. Zimmerman; \"Our Newly Acquired Possessions,\"<br />\nby J. T. Smith, Jr. ; \"Tommy Hopkins,\"<br />\nby J. A. Addison. All those present regretted<br />\nvery much the absence of J. Alan Haughton,<br />\nwho was to respond to the toast \"The Ladies.\"<br />\n.As .As<br />\nMUSICAL CLUBS.<br />\nJohns Hopkins Glee, Banjo and ManHE<br />\ndolin Clubs gave an informal concert at<br />\nthe University Club on the evening of Friday,<br />\nMarch Eighth. This is the first time that the<br />\nClubs have appeared before the public in the<br />\nguise of a paid orchestra, and the result was<br />\nnot altogether successful. The audience did<br />\nnot deem it necessary to stop talking during<br />\nthe songs and other pieces, consequently it<br />\nwas hard for the men to play and sing, and<br />\nstill harder for those who were appreciative to<br />\nhear the music. Altogether the evening was<br />\nnot enjoyable or successful, and it is to be<br />\nhoped that no more such concerts will be<br />\nscheduled.<br />\nAfter a few attempts by the various Clubs<br />\nto make themselves heard, the men gave up,<br />\nand mingled with the crowd in its rush for<br />\nrefreshments. Then the pleasanter part of the<br />\nevening began, for there were a number of<br />\nattractive girls and women present, and several<br />\nJohns Hopkins Professors and Alumni very<br />\nthoughtfully looked after the welfare of the<br />\nmen.<br />\nManager Bird has nearly completed his<br />\narrangements for the Easter trip, and from<br />\npresent prospects it will be as thoroughly successful as the one last year. So far the plans<br />\nare to leave Baltimore Friday afternoon ou one<br />\nof the Bay Line Steamers and give the first<br />\nconcert at Old Point Comfort on Saturday<br />\nnight. This is the very best night in the<br /><br />\nwhole year to attract an audience, and it was<br />\nonly through the energy and perseverance of<br />\nthe manager that this date was obtained. Last<br />\nyear the Clubs had to play second best, and<br />\ngive their concert on Good-Friday when there<br />\nwere necessarily fewer people present. But<br />\nthis year Princeton will have to take our last<br />\nyear's place while the Hopkins Clubs have the<br />\nbest night.<br />\nFrom Old Point Comfort the men will go to<br />\nRichmond and give a concert there on the following Monday—These places are the only<br />\nones that are definitely decided upon, but it is<br />\nlikely that several other cities will be visited<br />\nbefore the Clubs return. There is even a rumor that Atlantic City will be \"taken in,\"<br />\nbut this is a little doubtful.<br /><br />\nT<br /><br />\nTHE SECOND BALTIMORE CONCERT.<br />\nmost important concert in the history<br />\nTHE<br />\nof the Johns Hopkins Musical Clubs will<br />\nbe given in McCoy Hall on Tuesday evening,<br />\nMarch 26. Its great importance lies in the<br />\nfact that the proceeds will be used to help pay<br />\nfor the erection of the club house and gymnasium on the new athletic grounds.<br />\nThe alumni of the University have been doing their utmost to raise the necessary million<br />\ndollar endowment fund, and it would surely<br />\nseem rather ungrateful in the undergraduates<br />\nif they do not heartily support this concert,<br />\nand thus take away the additional responsibility of paying for the club house.<br />\nFrom the manner in which the subscription<br />\nlists have been received, however, it is unlikely that the former Hopkins men will have any<br />\nreason to believe that they are the only ones<br />\ninterested in the welfare of their Alma Mater.<br />\nWWW<br /><br />\nFor the handsome young dudes in far Luzon,<br />\nIt's style to keep just what they choose on.<br />\nWhy, in summer it's meet<br />\nTo appear in the street<br />\nWith just hat, collar, necktie, and shoes on.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n7<br /><br />\n\"BILLY\" MADDREN RESIGNS.<br /><br />\nTHE HOPKINS GAMES.<br /><br />\nAT a meeting of the Athletic Board, held<br />\nTuesday evening, March 12th, President<br />\n\"Billy\" Maddren handed in the 'following<br />\nletter of resignation:<br /><br />\nCarnival of Sports under the auspices<br />\nTHE<br />\nof the Athletic Association of the Johns<br /><br />\nTo the Board of Directors of the 7ohns Hopkins<br />\nAthletic Association:<br />\nGENTLEMEN,—It is with great regret that I<br />\nam obliged to tender my resignation as President of the Johns Hopkins Athletic Association. My reasons are that I am unable to<br />\ngive sufficient time to athletic affairs because<br />\nof my studies. This resignation is to take<br />\neffect upon the election of my successor, and<br />\nnot later than March i5th. Yours truly,<br />\nWILLIAM HARVEY MADDREN.<br />\nEvery effort was used by the Board to dissuade Mr. Maddren from his course, but he<br />\nexplained that it would be impossible for him<br />\nto devote sufficient time to the duties of presidency, as his studies at the Medical school for<br />\nthe remainder of the year would require hard<br />\nwork and close confinement. With great<br />\nreluctancy the board accepted the resignation,<br />\nand appointed a committee, with Dr. Renouf<br />\nas chairman, to draw up an appropriate resolution in appreciation of Mr. Maddren's work<br />\nin behalf of Hopkins Athletics. It is safe to<br />\nsay, that during the past three years .no other<br />\nstudent of the University has instilled as much<br />\nlife into athletics at Hopkins, as has \"Billy<br />\nMaddren.\" His most conspicuous work has<br />\nbeen in Lacrosse, and it is largely owing to his<br />\nefforts that three championship banners, 1898,<br />\n1899, 1900, now adorn the walls of the trophy<br />\nroom but besides this his advice in athletic<br />\nmatters has been of the greatest benefit, and all<br />\nregret his retirement from active athletics.<br />\nMr. Albert Reese was unanimously elected<br />\nby the Board to fill the position of president.<br />\nMr, Reese is one of the few alumni who has<br />\nnot allowed his interest in J. H. U. sports to<br />\nstop when he received his degree, but has, on<br />\nthe other hand, worked faithfully to advance<br />\nthem. This interest in athletics and his executive ability make him the most suitable man<br />\nwho could have been chosen for the position.<br /><br />\nHopkins University was held on last Saturday night at the Fifth Regiment Armory.<br />\nAthletes from diverse parts of the city and<br />\nstate were entertained by the University men,<br />\nwho gave them a good run for their money.<br />\nThese are the first indoor games that the<br />\nUniversity has given for some years past, and<br />\nthat they were a success is the verdict of everyone. Surely there were some hitches, but, for<br />\nthe most part, the events were run off in good<br />\ntime by the clerk of the course, Wm. M.<br />\nMackdermott, to whom all credit is due for the<br />\nsuccess of the meet.<br />\nThe hall had been very attractively decorated, and when the call was sounded for the<br />\nfirst event at 8.10, the seats lining the walls<br />\naround the floor space of the Armory were<br />\ncomfortably filled with fair enthusiasts who<br />\nhad come out in goodly numbers to cheer their<br />\nespecial favorites on to victory, while the gallery was filled with \"rooters\" of the various<br />\norganizations who had occupied themselves<br />\nwith shouting encouragement to their teams.<br />\nA large share of the honors came to the<br />\nwearers of the Black and Blue, but the representatives of Marston's University School and<br />\nthe Boys' Latin School also came in for a<br />\ngoodly share of the prizes.<br />\nThere was a slight delay in the starting of<br />\nthe game owing to the late arrival of several<br />\nof the officials; but when the games were once<br />\nstarted they went ahead at a pleasing pace. The<br />\nprogram was a very attractive one, being much<br />\nless unwieldy than the ordinary program of<br />\nBaltimore meets. Foot races were the predominant features, while there were only three<br />\nfield events.<br />\nThe first event—the interscholastic 40 yard<br />\ndash—was easily won by G. C. Gantz, of the<br />\nBoys' Latin School, with Bayless and Cloud<br />\nclose on him for second and third honors.<br />\nE. L. Pessagno ran a beautiful race in the<br />\n40 yard open handicap, winning first place, but<br />\nwas closely pressed by Tootle, who won the<br />\n40 yard dash in the Baltimore Athletic games<br /><br />\nTHE NEWS-LETTER.<br /><br />\n8<br /><br />\nof several weeks ago. Perhaps the races which<br />\ninterested the majority of the spectators were<br />\nthe twelve relay races. In the first, Marston's<br />\neasily defeated the Emerson Institute team, of<br />\nWashington. The Boys' Latin School team<br />\nalso ran a pretty race against Deichmann's.<br />\nThe special invitation relay race between St.<br />\nJohn's College and Johns Hopkins University<br />\nwas one of the prettiest of the evening. The<br />\nfirst two contestants, Whitman and Garey, ran<br />\nalmost a dead heat till the last lap, when Whitman passed his rival and finished a few yards<br />\nahead of him. Unfortunately for St. John's,<br />\nWells was not able to hold his ground on the<br />\nnext lap, and when Riggs took up the work<br />\nwhere England and Hoffman had left off,<br />\nHopkins had a lead of half a lap, and Riggs<br />\nwas able to hold his lead without exertion.<br />\nMullen, who ran under the auspices of the<br />\nJohns Hopkins Club, was the only scratch man<br />\nin the mile run. He pushed ahead of all his<br />\nopponents, and caught up with Heiner, who<br />\nwas leading. On the last lap Mullens purted,<br />\nand easily won by io yards.<br />\nIn the 440 yard dash, Riggs ran a beautiful<br />\nrace. On each lap he gradually pushed up<br />\npast his opponents, and won handily on the last<br />\nlap by a beautiful spurt. All the other events,<br />\ntoo, were of equal interest, but perhaps the<br />\nmost amusing of the whole evening was the<br />\npotato race, won by C. F. Edwards. Garret<br />\nwon first in the 16-lb. shot, and second in the<br />\nhigh jump. In the 88o yard, novice, England<br />\nwas the victor.<br />\nTRACK EVENTS.<br /><br />\nJohns Hopkins University,first; time, 2.36 2-5.<br />\nThe teams ran as follows: J. H. U.—H. Whitman, J. T. England, W. C. Hoffman, T. F.<br />\nRiggs, St. J. C.—E. B. Garey, J. G. Wells,<br />\nG. W. Cromwell, D. C. Howan.<br />\nMile Run, Handicap; Limit, 70 Yards—J.<br />\nM. Mullen, J. H. C., scratch, first; F. H.<br />\nHeiner, C. Y. M. C. A., 25 yards, second;<br />\nW. H. Thatcher, J. H. U., 45 yards, third;<br />\ntime, 5.18 2-5. C. D. Humphreys, J. H. U.;<br />\nA. Adler, J. H. U.; W. S. Chambers, W. Y.<br />\nM. C. A.; A. C. Gilbert, W. Y. M. C. A.; W.<br />\nS. Freeburger, C. Y. M. C. A.; C. D. Hall,<br />\nJr., C. Y. M. C. A.; L. Harper, C. Y. M. C.<br />\nA.; Val Rettaliata, unattached; J. T. England,<br />\nJ. H. U.; E. F. Kirkness, G. Y. M. C. A.;<br />\nW. E. Peerce, W. Y. M. C. A.; A. A. Flanagan, St. L. G., and S. S. Crane, St. L. G.,<br />\nalso ran.<br />\nPotato Race—C. F. Edwards,J. H. U., first;<br />\nC. W. Young, J. H. U., second; F. Hazlehurst, J. H.U., third; time, 52 2-5. F. Blanck,<br />\nJ. H. U.; F. H. Adler, J. H. U., and E. F.<br />\nKirkness, G. Y. M. C. A., also ran.<br />\nFour Hundred and Forty Yards Dash,<br />\nHandicap—T. F. Riggs, J. H. U., 8 yards,<br />\nfirst; W. C. Curley, C. Y. M. C. A., 18 yards,<br />\nsecond; H. Lindsay, C. Y. M. C. A., 20 yards,<br />\nthird; time, 1.01.<br />\nEight Hundred and Eighty Yards, Novice,<br />\nScratch—J. T. England, J. H. U., first; C. T.<br />\nHoward, W. Y. M. C. A., second; F. Richardson, C. Y, M. C. A., third; time, 2.21.<br /><br />\nFIELD EvErrrs.<br />\nForty yards dash, scratch, interscholastic:<br />\nRunning High Jump, Handicap; Limit, 6<br />\nSemi-finals (firsts and seconds to qualify):<br />\ninches—R. F. Lemat. unattached, 254 inches,<br />\nFirst Heat—E. L. Pessagno, J. H. U., first; first, 5 feet 8 inches; Robert Garrett, J. H. U.,<br />\nH. K. Tootle, J. H. U., second; time, 5 sec- 2 inches, second, 5 feet, 754 inches; J. V. Prenonds.<br />\ntiss, C. Y. M. C. A., 4 inches, third, 5 feet,<br />\nSecond Heat—W. W. Weedon, J. H. U.,<br />\n754 inches.<br />\nfirst; F. Blanck, J. H. U., second; time, 5 secSixteen Pound Shot, Handicap; Limit, 8<br />\nonds.<br />\nFinals—E. L. Pessagno, J. H. U., first; H. feet—Robert Garrett, J. H. U., scratch, first,<br />\nK. Tootle, J. H. U., second; F. Blanck, J. H. 41 feet, I inch; H.0. Cole, W. B. Y. M. C.<br />\nA., 4 feet,.6 inches, second, 37 feet, 4 inches;<br />\nU., third; time, 4 4-5 seconds.<br />\nSpecial Invitation Relay Race Between Johns L. T. Eberle, St. L. G., 5 feet, third, 32 feet,<br />\nHopkins University and St. John's College— 4 inches.<br /><br />\n•<br /><br />\n9<br /><br />\nTHE NEWS-LETTER.<br />\nWHERE! OH WHERE IS OUR BASE-<br /><br />\nAMONG THE COLLEGES.<br /><br />\nBALL TEAM?<br /><br />\nathletic department of the University<br />\nTHE<br />\nof Chicago has started the policy of giving the University \"C\" to winners of indoor<br />\nmeets,<br />\nww<br />\nThe candidates for Yale's track team are<br />\nshowing up strong in the field events, but not<br />\nso well in the runs. There are 130 men in the<br />\nfield.<br /><br />\nSINCE\"Robbie\"and his small band of baseball enthusiasts have been practicing in the<br />\ncage here of late, considerable interest has<br />\nbeen shown in a base-ball team for Hopkins.<br />\nThere seems to have been for some time past<br />\na sort of half-hearted movement on foot to get<br />\nthe consent of the Athletic Association for a<br />\nteam. Such a movement will undoubtedly<br />\nmeet with serious opposition, on account of the<br />\ndeplorable manner in which last year's team<br />\nwas managed, and its untimely end. Yet, if<br />\nthe supporters of this new movement show<br />\nenough earnestness to warrant it, and will<br />\nguarantee a team which will practice, and stand<br />\nby the University during the entire season,<br />\nthere can be no doubt but that the Athletic<br />\nAssociation will give such a team its hearty<br />\nsupport.<br />\nSeveral challenges have been received from<br />\nprominent colleges and associations, and it<br />\nseems rather sad, that we energetic Hopkinsonions who are making such rapid strides in<br />\nother lines of athletic sport, cannot organize<br />\nand support a base-ball team. Probably the<br />\nmain handicap to last year's attempt was the<br />\nlack of grounds out of doors, on which to<br />\npractice. Such is not the case this year, as we<br />\nhave new grounds specially adapted to baseball, at a moderate distance from the University.<br />\nIf the men who are interested in this project<br />\nmean business, and have any hope of organizing a team, it is high time that the movement were being pushed as is is getting late in<br />\nthe season. We have made a \"rep for Hopkins in Football, Lacrosse, Track and Field.<br />\nThen with good material, and men who are<br />\nanxious and ready to make it a success, why<br />\ncan we not have a base-ball team.<br /><br />\nOr OW sr<br /><br />\nPreparations are now in progress at Yale for<br />\na gigantic torch-light celebration of their Bicentennial on October 21St.<br />\nsir W W<br /><br />\nUniversity of Michigan has registered in all<br />\ndepartments, 3,538 students.<br />\nwww<br />\nThe tenth anniversary of the founding of<br />\nthe University of Chicago will be celebrated<br />\nnext June, by appropriate exercises, including<br />\nathletic contests, dramatic performances, and<br />\nsocial features.<br />\nw<br />\nThe California State Legislature has passed<br />\na bill appropriating $1oo,000 a year for the<br />\nnext decade for the support of the University<br />\nof California.<br />\nwww<br />\nAlmost every college in the country is busy<br />\nwith some debating contest to be held around<br />\nthis time.<br />\nwww<br />\nLafayette College has adopted a set of rules<br />\ndefining the eligibility of candidates for athletic teams. It is interesting to note that<br />\nHopkins was among the first American Colleges to adopt such rules.<br />\nJO As JP<br /><br />\nThe oldest college in the world is Mohammed College at Cairo, Egypt, which was moo<br />\nyears old when Oxford was founded. It has<br />\nti,000 students.<br />\n▪w<br />\nThe faculty of the Iowa State College has<br />\ngiven to the editor-in-chief of the college journal three hours credit per term, and one<br />\nTeddy—Won't you come and see our new hour's credit to each of his assistants.<br />\nbaby?<br />\nwww<br />\nThe University of Chicago is to have a new<br />\nOld Maid—Yes dear, when your mother is<br />\nclub house for the use of students. The buildbetter.<br />\nwill cost about poo,000.<br />\ning<br />\n—Ex.<br />\nTeddy—Oh, but it aint catching.<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br />\nUNIVERSITY NEWS NOTES.<br /><br />\n.A6 JO .A6<br /><br />\nThe course of lectures this year on the<br />\nTurnbull Lectureship foundation will be given<br />\nby Hamilton W. Mabie, Litt. D., editor of<br />\n\"The Outlook,\" and author of several literary<br />\nworks. The subject of the course will be<br />\n\"Poetry in America.\" The lectures will be<br />\ngiven in McCoy Hall, at 5 o'clock, beginning<br />\nTuesday, April 16th; they will begin punctually and will close within the hour. The door<br />\nwill be closed when the lecturer rises.<br />\nJab .a6<br />\nAt their last monthly meeting, the Trustees<br />\ndid not discuss the presidency of the University or the proposed endowment fund. A letter from Mr. Henry 0. Thompson, Treasurer<br />\nof the Alumni Association, presented the University p000 as the nucleus of a fund for the<br />\nestablishment of an alumni scholarship. The<br />\ngift was accepted with thanks..<br />\nThe trustees designated the professorship<br />\nfounded some time ago by Dr. Henry Willis<br />\nBaxley as the Baxley Professorship of Pathology. They voted their thanks to Mr. Henry<br />\nSonneborn and Mr. Jesse Tyson for recent<br />\ngifts to the University.<br /><br />\nDr. John Dewey, Hopkins Fellow in '83, and<br />\nPh. D. '84, who is at present Professor of Philosophy in the University of Chicago, has been<br />\nappointed the head of the Chicago University<br />\nHigh School. This school is to be result of<br />\nthe consolidation of the Chicago Institute with<br />\nthe University of Chicago.<br />\nsr or or<br />\nProfessor James Schouler, LL. D., of Boston, author of a \"History of the United States<br />\nunder the Constitution,\" will deliver four biographical lectures in continuation of his<br />\ncourse begun last year, on the great founders<br />\nof the American Republic. The lectures will<br />\nbe given in the Donovan Room, McCoy Hall,<br />\nat 5 p. m., on March 20, 22, 27, and 30.<br />\nw or or<br />\nProfessor John Bassett Moore, LL. D., of<br />\nColumbia University, formerly Assistant Secretary of State and later Secretary to the Peace<br />\nCommission at Paris, will deliver two lectures<br />\non international questions,—\"Our Treaty with<br />\nSpain,\" and \"Our Policy in the Far East.\"—<br />\nThe lectures will be given in McCoy Hall, at<br />\n5 p. m., on March 19th and 21st.<br /><br />\nThe Senior—Junior debate is to take place<br />\nat 8 o'clock to-night in McCoy Hall.<br />\nThe chairman of the committee of arrangements is Mr. Harry S. Bryne, who is president<br />\nof the Senate. Mr. A. W. Bruton will be chief<br />\nusher, Mr. Aubrey Pearre chairman of the<br />\ncommittee on invitations, and Mr. Norman<br />\nBoyer chairman of the press committee. The<br />\narrangements committee has decided to limit<br />\nadmission to the debate to those who have<br />\ntickets. These tickets may be obtained from<br />\nmembers of the Committee.<br />\nThe Musical Clubs will take part in the exercises.<br />\nThe Freshmen who will declaim for the Lee<br />\nprize at the same time, are Plaggemeyer, Blum,<br />\nand Zimmerman.<br />\nw or sr<br />\nThe class of '92 held its ninth consecutive<br />\nreunion and banquet Friday of last week at<br />\nthe Johns Hopkins Club. Dr. Thomas R.<br />\nBrown presided. City Councilman George<br />\nStewart Brown, whose exchange of compliments with the Mayor is still talked of, responded to the toast, \"My friend Mr. Hayes.\"<br /><br />\nproposed excursion of a number of<br />\nTHE<br />\nHopkins students to Homewood has been<br />\npostponed, on accouut of the illness of a member of Mr. Wyman's family.<br />\nor gr or<br />\nThe audience at the first of Mr. Frederic<br />\nHarrison's two lectures on King Alfred, delivered March 8th, was the largest that has assembled in McCoy Hall this season. Mr. Harrison is a most graphic and instructive speaker.<br />\n.416 JP JP<br />\nPresident Gilman has returned from a short<br />\nvisit to New York, which he made in order to<br />\ntestify that his name had been forged by the<br />\nnotorious swindler Raymond, in a letter to<br />\nPresident Hadley of Yale.<br />\nDr. Herbert B. Adams left Baltimore March<br />\n7th for a six weeks journey, in search of<br />\nhealth and rest. Dr. Adams will stay some<br />\ntime in Florida, and may then go to New Orleans to visit his nephew, Lieut. Edward<br />\nAdams, a Hopkins man of the class of '97.<br /><br />\nTHE NEWS-LETTER.<br />\nINQUIRY COLUMN.<br />\n(In this column the NEWS LETTER will answer, to the best of<br /><br />\nits ability, the queries fowarded by correspondents.).<br /><br />\n11<br /><br />\nSIX LITTLE TEST TUBES.<br />\nSix little test-tubes<br />\nSitting in a rack,<br />\nOne in the Bunsen flame<br />\nSoon showed a crack.<br /><br />\nWhen I wake up in the morning I am very<br />\ntired and listless. Am nearly always late to 9<br />\nFive little test-tubes,<br />\no'clock lecture, and frequently fall asleep in<br />\nRather scared they seem.<br />\nclass. Can you suggest a remedy ?—Senior.<br />\nOne used to melt some lead;<br />\nYour trouble seems to be a very common One<br />\nNow a \"has been.\"<br />\nespecially among students. The following<br />\nFour little test-tubes,<br />\ntreatment has been found generally efficacious.<br />\nAll that remain,<br />\nTake a plunge bath in water of 100 FahrenOne fell on the floor:<br />\nheit, containing a pinch of salt, every morning<br />\nNe'er again the same.<br />\njust before waking. Then vigorously massage,<br />\nwith both hands, the back muscles just between<br />\nThree little test-tubes,<br />\nthe shoulders. These are the ulterior—dextrose<br />\nOne got wet;<br />\n—ambilous deltoids (Mackdermott), the musTrying to dry it,<br />\ncles that control the eyelids. If you take the<br />\nJoined the broken set.<br />\nmassage for four or five hours every morning<br />\nfor ten years, you will never have any more<br />\nTwo little test-tubes,<br />\ntrouble with sleeping in class.<br />\nOne heated hot;<br />\nSomebody picked it up,<br />\nI have heard that the editors of the HullaQuickly let it drop.<br />\nbaloo would like to receive humorous contributions, and as I have held quite a reputation as<br />\nOne little test-tube,<br />\na joker, I thought I might send in some real<br />\nHardest one to kill;<br />\ngood stuff. Would you advise me to help<br />\nSoon he got smashed,<br />\nthem.-19o3<br />\nThen came the bill:<br />\nDon't do it. We must think a little of the<br />\nMR. CRASHER BREAK,<br />\neditors.<br />\nTo the J. H. U. (Per Mrs. Stuart), Dr.<br />\n$0..50<br />\nDear Mr. Editor: I have the honor of being To half dozen test-tubes<br />\na candidate for the debating team of our class,<br />\nJ. T. S.,'03.<br />\nsr ger of<br />\nbut am having trouble to find an audience.<br />\nEXCHANGE PLACE.<br />\nEvery one about the University seems very<br />\nbusy, when I ask them to listen to me, yet I<br />\nthink a little criticism is a good thing, once in<br />\nAT THE CLASS BANQUET.<br />\na while. How can I obtain an audience.<br />\ngoing to get drunk tonight, Jim?<br />\nyou<br />\nAre<br />\n—Orator.<br />\nWell, it wouldn't be right for the president,<br />\nThe best thing for you to do is to go to one<br />\nof the Prep. Schools, where you can easily ob- you know.<br />\nI'd rather be drunk than president.<br />\ntain an appreciative audience by announcing<br />\nthat you are a VARSITY MAN. This will renJP<br />\nder anything you may say a divine utterance.<br />\nThree<br />\nwas a crowd, and there were three—<br />\nIs it wise to go to drawing on time, or a litThe girl, the parlor lamp and he,<br />\ntle late ?—Artist.<br />\nTwo is company, no doubt<br />\nNever think of going to drawing before 3 P.<br />\nThat's why the parlor lamp went out.<br />\nM. If you do, you may frighten the instructor into spasms.<br />\nH. R.V.<br />\nJO JA .A6<br />\nsr<br /><br />\nW<br /><br />\nFresh—There was an awful \"rough house\"<br />\nduring Eng. exam.<br />\nSoph—What was the matter?<br />\nFresh—The sentence in italics was \"loose.\"<br />\n—Ex.<br /><br />\nIn an examination the students were required to give the principal parts of \"to skate.\"<br />\nOne of them did it as follows: \"Skate,<br />\nslippere, fallen, bumptum.\" The professor<br />\nmarked his paper: \"Fail, failere, flunxi, suspensum.\"<br /><br />\nJAS. H. DOWNS,<br /><br />\nMEMBERS OP<br />\nNEW YORK STOCK EXCHANGE<br />\nBALTIMORE STOCK EXCHANGE.<br />\nCHICAGO BOARD 01. TRADE.<br /><br />\nCLINTON P. PAINE<br />\nGORDON P. PAINE<br /><br />\n229 N.<br /><br />\nCLINTON P. PAINE &amp; CO,<br />\nBANKERS AND BROKERS,<br /><br />\nHOPKINS!!<br /><br />\nSMOKE UP! RAH! RAH! RAH!<br />\nIF ITS<br /><br />\nANYTHING IN TOBACCO YOU WANT<br /><br />\nGO TO I.<br /><br />\nFOR Class, Fraternity and College Stationery, Banquet Cards,<br /><br />\n217 EAST GERMAN STREET,<br />\nBALTIMORE, MD.<br /><br />\nPRIVATE WIRES TO<br />\nNEW YORK AND CHICAGO.<br /><br />\nInvitations, Diplomas, Programs, Visiting Cards, etc.<br /><br />\nThe Chas, Mims Surgical Instrument Co,<br />\nBENJ. A. NELSON, GEN'L MANAGER.<br /><br />\nD. LANG, TOBACCONIST,<br /><br />\nPhysicians, Surgeons,' Hospital and Invalid Supplies.<br />\nFine Microscopes and Accessories.<br /><br />\n833 MADISON AVENUE.<br />\nSTATIONERY SUPPLIES<br />\nAND PERIODICALS.<br /><br />\nBOX TRADE A SPECIALTY.<br /><br />\nDrovers et Mechanics National Bank of Baltimore.<br />\nSurplus and Profits, $350,000.<br /><br />\nCapital.Stock $300,000.<br /><br />\nCHARLES ST.<br /><br />\nMASONIC TEMPLE.<br /><br />\nBALTIMORE, MD.<br /><br />\n300 N. HOWARD ST.<br /><br />\nMUELLER,<br /><br />\n5 WEST LEXINGTON ST.<br />\n(LONDON STUDIO.)<br />\nFINEST PHOTOGRAPIC WORK<br />\nIN THE CITY.<br /><br />\nTRANSACTS A GENERAL BANKING BUSINESS.<br /><br />\n.8\"..7. 00<br /><br />\nSafe .2:Psioesit...92oates<br /><br />\nJ. D. Wheeler, Cashier.<br />\nChas. S. Miller, Asm't Cashier.<br /><br />\nJames Clark, President.<br />\nLeopold Strause, Vice-President.<br /><br />\nA. H. FETTING,<br />\n14<br /><br />\nAND 16<br /><br />\nWpwrwat<br /><br />\na,,<br /><br />\nMANUFACTURER OF<br /><br />\n(Ma Letter 'fraternity<br />\nJewelry.<br /><br />\nST. PAUL STREET.<br /><br />\nPLEASE CALL AND EXAMINE OUR LINE BEFORE PURCHASING<br /><br />\nor,<br />\n;ZS<br /><br />\nSpecial attention given to Holiday<br />\nwork and Groups, Class Pictures, etc.<br /><br />\ncomposer, pianist, and teacher, of<br />\nThe distinguished<br />\nParis, writes as follows regarding the<br /><br />\nMASON &amp; HAMLIN PIANOFORTE.<br />\n\"It has a full, singing tone, and the action is most satisfactory.<br />\nTaken as a whole it is, I believe, an instrument of the very first<br />\nMORITZ MOSZKOWSKI.<br />\n(Signed)<br />\nrank.\"<br /><br />\n321 N. Howard Street.<br /><br />\nC. H. Hildebrandt &amp; Son, Sole Agts.<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS. GIBRALTAR,<br />\nNAPLES, GENOA, ETC.<br />\nBALTIMORE TO BREMEN<br /><br />\nA. SCHUMACHER &amp; CO<br />\nGeneral Agents.<br /><br />\nDIRECT.<br /><br />\nki<br /><br />\nalo It SURETY BONDS<br /><br />\nvdei*<br /><br />\nMORITZ MOSZKOWSKI,<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nor w or CABIN PASSAGE AT LOW RATES.<br />\nFor particulars apply to<br /><br />\nwe.*<br /><br />\nthe<br /><br />\n'Fidelity and Deposit Company of Maryland,<br /><br />\nKranz-Smith<br />\npiano CO,<br /><br />\n109 and III North Charles SPtreet.<br />\nSOLE AGENTS<br /><br />\nChickering, Bradbury and Webster<br /><br />\ngm Pianos. *it<br />\nC. dc P. Phone 2322-2.<br /><br />\nFactory Prices<br /><br />\nBARTL,EXT, HIAYWARD &amp;CO.<br />\n• 'founders and Engineers, ••<br />\nWorks. Pratt and Scott Sta.<br />\nOffice Calvert and German Sta.<br />\nManufacturers ofCast and Wrought Iron Work for Buildings.<br />\nStores, Railings, Balconies, Guards, Vaults and Area Lights, Iron,<br />\nZinc and Copper Sheet Metal Work, Hydraulic Passenger and Freight<br />\nElevators, Hot Water and Steam Heating Apparatus, Vertical and<br />\nHorizontal Tubular Boilers, Wrought Iron Tanks, Gas Holders, Purifiers, Condensers, etc. Columns, Plates, Girders, Beams and Beam<br />\nGirders, Wrought Iron Roof Framing and Road Bridges.<br />\nCHARLES AND LEXINGTON STS.<br />\nBECOMES SURETY ON ALL CLASSES OF BONDS.<br />\nSAFETY DEPOSIT SOXES.<br /><br />\nEDWIN WARPIELD, Pres't.<br />\nsst Vice-Preset, H. Crawford Black.<br />\nJos. R. Stonebraker.<br />\n\"<br />\n2nd<br />\nThos. A. Whelan.<br />\n\"<br />\n3rd<br /><br />\nII. E. BOSLER, Sec'y-Tretts.<br />\nHarry Nicodernum,<br />\nAss't Seey-Treas<br /><br />\nEISENBRANDT'S<br />\nLeading Dealers in Baltimore in everything known in Music.<br />\nSole Agents for<br />\nMandolins, Guitars, Banjos<br />\nand Zithers.<br />\nAutomatic Attachments for<br />\nPianos.<br />\nGRAMOPHONES, ETC.<br />\nREGINA MUSIC BOXES.<br /><br />\n\"Washburn\"<br />\n\"<br />\n4.1ingellus\"<br /><br />\n201-203 N. CHARLES STREET.<br /><br />\nBOOKS<br /><br />\nOld and<br /><br />\nNew.\"<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the City.<br />\nBooks bought, sold and exchanged. . . .<br />\n605 N. Eutaw St.<br />\nW M. V. PIPPEN.<br /><br />\nsTONEBRAKER BROS.,<br /><br />\n* PRINTERS,<br />\nLet us Estimate on your/Spring Catalogues, etc.<br />\n217 E. BALTIMORE ST.<br /><br />\ngzstt*****************<br /><br />\nSMITH, DIXON &amp;<br /><br />\n(All. AND (JET AN ESTIMATE.<br /><br />\not PAPER<br /><br />\nSTONEBRAKER BROS.,<br /><br />\n04<br /><br />\nPRINTERS.<br />\n29-31 B_ CI-I-A.1=2,1,ES ST_<br /><br />\nGlobe<br />\nBrewery<br /><br />\nLifrii4-***<br />\n*<br />\n)<br /><br />\nLAGER BEERS<br />\nOoldbrau and Wurzburger.<br />\nAbsolutely Pure and Wholesome.<br />\nNone better on American Market.<br /><br />\nJ. Wm. Middendorf.<br /><br />\nWm. 13. Oliver.<br /><br />\nMIDDENDORF OLIVER &amp; CO.<br /><br />\nBankers and Brokers,<br />\n206 E.A.ST GERIVI.A.N STREET,<br />\nMembers<br />\nBALTIMORE,<br />\nBaltimore Stock Exchange.<br /><br />\nBartholomay Brewery Co.<br />\nROCHESTER, N. Y.<br /><br />\nBARTHOLOMAY'S<br /><br />\nBohemian<br />\nROCHESTER BEER. Bavarian<br />\nBALTIMORE<br />\nGiaerzen 13rau<br />\n• BRANCH<br />\n2/7-2395.IENTRAL AVE,n(<br />\n„GEO.C•SUCRO•<br />\nApollo<br />\n• MANAGER • •• • '<br />\n• ORIGINALAND FAMOUS ®<br />\nTRADE MARH•<br /><br />\nOffice and Depot, 227-239 S. Central Avenue.<br />\nMD.<br /><br />\nGEO. C. SUCRO, Sole Agent.<br /><br />\nWedding Silver Tr1i1d'efsor<br /><br />\nNEW YORK TO LONDON DIRECT.<br />\nExcellent accommodations for a limited<br />\nnumber of First-Class Passengers<br />\nat reasonable rates.<br /><br />\nIN GREAT VARIETY.<br />\n.111,N1KIN8,<br /><br />\nit Silversmiths.<br />\nHENDERSON'S 04<br />\n218 N. CHARLES ST.<br /><br />\nUNIVERSITY<br />\nBOOK STORE,<br />\nTEXT BOOKS. NOTE BOOKS,<br />\nSTUDENT'S SUPPLIES.<br /><br />\nHome Telephone 2060<br /><br />\nC. &amp; 1'. Telephone UM<br /><br />\nESTABLISHED 1879.<br /><br />\nJA4.:0E31<br /><br />\nIS THE<br /><br />\nATLANTIC TRAINSP'ORT CO.<br /><br />\n403-409 WATER ST.<br /><br />\n1 BROADWAY<br /><br />\nBALTIMORE.<br /><br />\nNEW YORK<br /><br />\nLawrence B. Kemp,Preside''(.<br /><br />\nWilson Keyser, Cash ice.<br /><br />\nCORTIERCIRL &amp; FARRIERS NRTIONFIL BRNK,<br />\nHOWARD<br /><br />\nAND<br /><br />\nGERMAN<br /><br />\nSTREETS,<br /><br />\nBALTIMORE, MD.<br /><br />\nMADISON &amp; HOWARD STS.<br /><br />\nTHE BLAKE CO<br /><br />\nHABERDASHERS.<br />\nShirts, Neckwear, Underwear,<br />\nHosiery, etc.<br /><br />\nOffers to Depositors every facility which their Balances, Business<br />\nand Responsibility warrant.<br />\nTHEO. WARNER,<br /><br />\nJAMES R. PAINE.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, 6) HATTERS, CID CANES, Erc<br /><br />\nHIGH GRADE! GOODS—LOW PRIeBS.<br />\n203 W.<br /><br />\nBALTIMORE AND 2 S. LIBERTY STREETS.<br /><br />\nphotograph,<br />\nSUCCESSOR<br />\n20<br /><br />\nLincoln &amp; Bennett and Walter Bernard's London Hate.<br />\n324 W. BALTIMORE STREET.<br /><br />\nAgents for<br /><br />\nMANUFACTURERS OF<br /><br />\nSilk and Cassimere II a Es.<br /><br />\nIlgenfritz<br />\nStudio.<br /><br />\nCushing &amp; Companu<br />\n34<br /><br />\nTO CUMMINS<br /><br />\nWEST LIECXI NOTON STR BET.<br />\nSPECIAL DISCOUNT TO STUDENTS.<br /><br />\nHELEN NI. 1-101_,L,YDAY,<br />\n600 N. ELJTA.W<br />\nBALTIMORE. MD.<br /><br />\nNew and Second-Hand Books, Text Books, Note Books, Students'<br />\nRequisites, etc., etc.<br />\nBooks Bought, Sold, and Exchanged.<br /><br />\nlinheuser•Busch<br />\nBrewing Ass'n<br /><br />\nKawqb-HOPKINS CAPS.<br /><br />\nBOOKSELLERS AN.<br />\nSTATIONERS.<br /><br />\nW BALTIMORE STREET<br /><br />\nSCHOOL, LAW, MEDICAL, CLASSICAL AND MISCELLANEOUS<br /><br />\n•oons.<br />\nKeeps constantly on hand the Text Books used in Johns Hopkins University,johns Hopkins Hospital and The Woman's College of Balto.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\nYou get the benefit of<br />\nall this labor,skill,brains<br />\nand capital.<br />\nStandard Organs.<br />\nPianos For Rent.<br />\nTuning, Repairing.<br />\nAccommodating terms.<br />\nWrite for Illustrated Cata[logue.<br />\nCHAS. M. STIIBRP,<br />\nN.<br />\nLiberty<br />\nSt.,<br />\nBaltimore,<br />\n521<br />\nMd.<br />\nnth<br />\nSt., N. W., Washington, D. C.<br />\n9<br /><br />\n5.T2E!<br /><br />\nB. G. EICHELBERGER,<br /><br />\nSt. Louis Mo.<br /><br />\nBOOKS AND STATIONERY,<br /><br />\nBrew the Best Beers<br />\nin the World.<br />\n•ALTINIOPIE •IIIANCH:<br /><br />\nENGRAVING AND STAMPING.<br />\nNo. 308 North Charles Street,<br /><br />\nLOUIS ULMER,<br />\nGen'l Agent and Mg.<br />\nC. &amp; P. Telephone<br />\n2314.<br /><br />\nY. M. C. A. BUILDING,<br /><br />\nC.&amp; P. Telephone 2351.<br /><br />\nSTONEBRAKER BROS.,<br />\n2ir E. Baltimore St.<br /><br />\nBALTIMORE, MD.<br />\nVISITING CARDS<br />\nNEATLY ENGRAVED<br />\nSHORT NOTICE.<br /><br />\nFOR THE SOCIAL<br />\nEVENTS OF THE<br />\nSEASON,<br /><br />\nLEMMERT'S<br />\nDRESS AND TUXEDO<br />\nSUITS ARE NECESSARY GARMENTS TO<br />\nEVERY WELL-DRESSED<br />\nMAN'S WARDROBE.<br /><br />\nLEMMERT<br /><br />\nFORD'S!(.THE THEATRE<br /><br />\nOF BALTIMOREA—s<br /><br />\nMAR. 25<br />\nONE<br />\nWEEK.<br /><br />\n••••<br /><br />\nVADIS.<br /><br />\nAPR. 8.<br />\nONE<br />\nWEEK.<br /><br />\n.111.•<br /><br />\nNIXON ec<br />\nZIMMERMAN'S<br /><br />\nBOSTON OPERA.<br /><br />\nO.<br /><br />\nACADEMY OF music!<br />\nANNIE RUSSELL IN \"A ROYAL FAMILY.\"<br /><br />\nWEEK OF<br />\nMAR. 18.<br />\nWEEK OF<br />\nMAR. 25<br /><br />\nC•41<br /><br />\nMAKES THEM TO<br />\nSHOW THE FIGURE<br />\nTO BEST ADVANTAGE<br />\n14 E. FAYETTE STREET.<br /><br />\nQUCI<br /><br />\n\"awe<br /><br />\nTHE<br /><br />\nIFA12/VI.<br /><br />\nDAIRY<br /><br />\nWIDE AWAKE WHISKEY.<br /><br />\nLEMMERT.<br /><br />\nPECI A L DISCOUNT! ot<br />\nTo the Students and Nurses of Johns Hopkins we will make a<br />\ndiscount of one-third on all styles of Photographs in single<br />\ndozen lots. Better discount for classes.<br />\n9r<br /><br />\nYOUR HEAD, SIR<br />\n/141.1<br /><br />\nis the noblest part of your<br />\nbody. Improve its appearp ance and comfort by wear- \"<br />\ning OUR HATS.<br /><br />\nMINOR'S,<br /><br />\nJIEFFRES STUDIO, w<br /><br />\nUP-TO-DATE,<br /><br />\n218 NORTH EUTAW STREET,<br />\n108 N. CHARLES STREET.<br /><br />\nBALTIMOF1E, MD.<br /><br />\n11011,APFEL 6 BEirtt<br /><br />\n14~faleiteitititeetZZaitititaiWitetiteitileitititeiA<br /><br />\nH.<br /><br />\nit mandolins*<br /><br />\nONE PRICE.<br /><br />\nB.<br /><br />\nMANDOLINS, GUITARS an<br />\n\"have a tone<br /><br />\nBANJOS<br /><br />\nThat's all their own.\"<br /><br />\nHOLZAPFEL &amp; BEITEL, 306 PEARL ST.,<br />\nNEAR<br /><br />\nGUITARS AND BANJOS.<br /><br />\nOPEN EVENINGS.<br /><br />\nSARATOGA ST.<br /><br />\nINSTRUMENTS TAKEN IN<br /><br />\nExCHANCE.<br /><br />\nLARGE STOCK AND INSTRUMENTS MADE TO ORDER.<br /><br />\nSTONEBRA<br />\n...- -<br /><br />\n. ,. . \". \"-‘,. . .,<br /><br />\n•.,----\\<br />\nKERBR05.<br />\n..—<br /><br />\nJ. SMITH,<br />\n9<br />\n..<br /><br />\nNM%VAMSNIAMEMMENNSTAMMUSSMZ=Mata<br />\nDealer hi<br /><br />\nPri r\\te<br />\nErv5 r'elVers)<br />\n,<br />\n,p,;.4.<br /><br />\n-4<br /><br />\nBOOKS<br /><br />\nOld and New<br /><br />\nSPASTMATMagargeMIZAMTATAWSMSTSVASENTATEMSZUM=<br /><br />\nPutker s..,.„):<br />\n)<br />\n217 E.BATO<br />\nt'<br /><br />\nCollege and University Books Bought and Sold,<br />\nA FULL LINE OF STUDENTS' NOTE BOOKS.<br /><br />\nI3ALTIMORE, MD.<br /><br />\nCall at 805 North Howard Street,<br />\n3 DOORS ABOVE MADISON.<br /><br />\nNovember 7th, f900.<br />\nWhile visiting the Paris Exposition of 1900, the wonderful display of<br />\nwines from all parts of the world was made a special study by our representative, who secured some very tine cuvees of French wines, both<br />\nred and white, such as Chateau Pontet Cgtnet, Chateau Larose, Chateau Lafitte, Chateau Margaux, Clarets; Sauternes, Haut Sauternes,<br />\nand Chateau Coutet. The latter finer than Chateau Yquem and not so<br />\nsweet. Also some special vintair.s of Deinhard &amp; Co.'s celebrated Rhine<br />\nWines selected while visiting thew great wine vaults at Coblenz on the<br />\nRhine. The most valuable selection of all was the prize Oporto Port,<br />\nthe finest of all Offley Forrester &amp; Co.'s exhibit; a very old, strictly<br />\npure, rich, medicinal Port wine, which will be shipped in 120 gallon<br />\npipes direct from the Exposition ground to<br /><br />\nBALTIMORE, MD.<br /><br />\nfIfelfleitleleVielf,fieletY,Cif,elf!tettelf!\".315(Mlelfleler<br /><br />\n\"WIDE AWAKE\"<br />\nMARYLAND RVE<br /><br />\nWHISKEY.<br /><br />\nJORDAN STABLER COMPANY,<br />\n701-703-705 Madison Ave., Baltimore.<br /><br />\nJOSEPH R. STONEBRAKER &amp; CO.,<br />\nFOR ADVERTISING SPACE IN THIS PAPER APPLY TO<br /><br />\nBALTIMORE, MD.<br /><br />\nSTONEBRAKER BROTHERS,<br />\n211 E. BALTIMORE ST.,<br /><br />\n.At<br /><br />\nBALTIMORE, MD.<br /><br />\n009900000014000004iititialig4044A0<br /><br />\nADVERTISE IN THE \"NEWS LETTER.\"<br /><br />\neps .4 04<br /><br />"}], "field_media_file": [{"target_id": 36182, "display": null, "description": null, "target_type": "file", "target_uuid": "4af87782-488c-40ce-8675-1c8abb25decc", "url": "http://digital.library.jhu.edu/system/files/2022-03/12170-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12170, "target_type": "node", "target_uuid": "2e84dd7b-200b-4bcd-bf37-5c92f316f84b", "url": "/node/12170"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "62c78178-ed6b-4891-bce3-59c11ddd92a4"}]}