{"mid": [{"value": 37523}], "uuid": [{"value": "9f12e1f9-7e62-421d-8894-2a77b92b71ad"}], "vid": [{"value": 37523}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:34:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13374-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:34:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:34:16+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "MISZUMBIEER<br />\n<br />\nVol. XXXIII, No. 48<br />\n<br />\nOAK. TO ELECT<br />\nAT ASSEMBLY<br />\n<br />\nPrice 5 Cents<br />\n<br />\nHOMEWOOD,BALTIMORE, MD., APRIL 30, 1929<br />\n<br />\n'LETTER ANNOUNCES<br />\nSPRING COMPETITION<br />\nThe NEWS-LETTER wishes<br />\n\" announce the beginto,<br />\nning of a spring<br />\netition for candidate or both<br />\nthe editorial andj business,<br />\nstaffs of the publi ation. The<br />\neiitorial staff es ially is<br />\nin need of new material and<br />\nanyone participating in the<br />\ncompetition will have an unusual opportunity to make<br />\nthe staff.<br />\nCandidates are, asked to<br />\nenter the competition as<br />\nsoon as possible as only one<br />\nelection will be held before<br />\nfinal eXaminat ions. The<br />\nNEWS-LITTER office i;; open<br />\nTuesdays and Frid-<br />\n<br />\nRAINY DAYS NOT CONDUCIVE<br />\nTO CIGARETTE \"BUMMING\"<br />\n<br />\nFINAL PRICES FOR<br />\nJUNE WEEK ANNOUNCED<br />\nThe News-LETTER regrets<br />\nto announce a typographical<br />\nerror in the price schedule for<br />\nJune Week as published in the<br />\nlast issue. The revised sched-.<br />\nule as announced by Chairman John Eldridge is as follows:<br />\nFor Seniors—<br />\n$ 3.00<br />\nBanquet Ticket<br />\n3.00<br />\nJune Week Ticket<br />\nBanquet and June<br />\n5.00<br />\nWeek Ticket<br />\nFor Underclassmen—<br />\n15.00<br />\nJune Week Ticket<br />\nFor Alumni—<br />\n12.00<br />\nJune Week Ticket<br />\nThe underclassmen and<br />\nalumni tickets do not include<br />\nthe banquet, which is an ex7<br />\nelusive senior function. NO<br />\ntickets are transferrable.<br />\n<br />\nHOPKINS STICKMEN<br />\nWIN FROM INDIANS<br />\n<br />\nAfter many weary years of re- curate computations and deductions,<br />\nsearch and toil it has at last been dis- the figures are set down and the<br />\nNominations for President of<br />\nGuild Scores on Outstanding<br />\ncovered; the number of cigarettes process is started once more. Butt the<br />\nStudent Council<br />\nPlay<br />\nthat can be \"bummed\" in a day. necessity in all of these cases' is to<br />\nJAY ATTACK SLOW<br />\nELECTIONS NEXT WEEK<br />\nThis exhaustive work has been go- greet the prospective donor with a<br />\ning on for some time so that a fair cheerful smile, which is invariably<br />\nCockerill Scores Only RanDonald Hiss Asks That Last<br />\ndolph-Macon Goal<br />\nAssemblies Be Well Attended<br />\nbalance of the generosity of the returned by one of a slightly less<br />\nUniversity students may be correctly enthusiastic appearance, tell him<br />\na wild comeback after<br />\nStaging<br />\nassembly<br />\nbe<br />\nwill<br />\nThursday's<br />\nThis<br />\ndetermined when all types of weath- that you are buying two packs in an<br />\nits defeat at West Point last<br />\none that everyone should make an<br />\ner are taken into consideration in the hour when you collect two bits from<br />\nweek, the Johns Hopkins lacrosse<br />\nespecial effort to attend. The busiequation. On rainy days -the num- a friend, and ask him for a cigartwelve triumphed over Gus<br />\nber of cigarettes that can be borrow- ette.<br />\nness to be brought up is very impor7<br />\nWelsh's stubborn Indian stick:et! by a 'single individual is greatly<br />\nUpon refusal, however, one<br />\nwielders by an 8 to 1 count .at<br />\ntant and will affect all, either directreduced, while the morning after must not be discouraged for<br />\nHomewood Saturday. The Jay<br />\nly or indirectly during the remainder<br />\nexams Owls them practically non- there may be a cigarette or two<br />\ndefense displayed the same excelof this semester and all during the<br />\nexistent. However, the period when in his pocket that he wants to<br />\nlent style of stickwork that held<br />\nnext school.<br />\nthey are most abundant is immedi- use. The next proper step is to<br />\nthe bard fighting Army twelve<br />\nately after lunch in the Barn when' start searching him and when he<br />\nAt this meeting, the nominations<br />\ndown to four goals,'but little imall<br />\nwell<br />\nare<br />\nsupplied<br />\nto<br />\na<br />\nendure<br />\nnonbecomes violent and breaks sevfor the President of the Student<br />\nprovement was seen in the Hopstop card game until the first one eral, limbs, it is the best etiquette<br />\nkins attack.<br />\nCouncil, which honor is one of the<br />\no'clock' class.<br />\nto leaye him alone and cruise<br />\nhighest that can be attained by an<br />\nTwo minutes after the opening<br />\nThus upon the above,observations elswhere.<br />\nwhistle, Hopkins' first drive on<br />\nundergraduate, will be held. The<br />\nit was resolved that an actual count<br />\nIn this dawn to dusk test, with<br />\nthe Randolph-Macon goal resultretiring President, Donald should be made of tobacco donations<br />\nthe mentioned measures in force<br />\ned in a tally for the Jays when<br />\nasks tliat this ;issembly and the one Elaborate Decorations Planned upon the .campus, and the results<br />\nit was found that on an'averagt<br />\nHoward Caplan, receiving a long<br />\nfairly<br />\nwere<br />\nUpon<br />\nsuccessful.<br />\nfightfor<br />\nHell<br />\nDance<br />\nbe<br />\nwill<br />\nwhich<br />\nthe<br />\nThursda,<br />\nnext<br />\nfreshman could \"bum\"<br />\npass from Guild from behind<br />\ning a gift cigarette after a successful a single<br />\nlast two this year, be well attended. \"Come dressed like Hell\" to<br />\n47 cigarettes before it was neces Plans for \"Whoopee\" Banquet goal,,sent the ball past the Yelrequest, it is cleverly concealed below Jacket goalie.<br />\nFormulated<br />\nThe nominations for the Presidency the Junior dance at Lehmann hind the back and the next -nearest sary lo call the ambulance to help<br />\nhim off the campus. This high<br />\nwill be held this Thursday, and next Hall on May 4, at 9.30 P. M.<br />\nAddison Campbell made the<br />\nperson is asked for another. • This<br />\nTwo freshmen and two sophoThursday the election will be held. This dance will be the very is great until the number in the left rating at the University definitely mores were elected to member- next Hopkins goal, but a bit more<br />\nproves no one need buy cigarettes<br />\nmaneuvering was necessary, than<br />\nNOminations for the delegates to best hop eve!' thrown, even ex- hand begins to get too numerous<br />\nin the future if the few sitnple ship in the Johns Hopkins Debatthe Athletic Association Board will, ceeding, in every way, the not- and incidently begins to burn slight- means suggested are employed ing Council at their regular meet- for the opening tally. Harry Love<br />\nand Smith, the biggest man on<br />\nly, then the object is to slip them all<br />\nalso be held this Thursday. Men<br />\nsoon-to-be-forgotten \"Pow Wow\" into a specially prepared asbestos to obtain smokes from others. If ing on Thursday afternoon.<br />\nthe Randolph-Macon team were<br />\nfor delegates from next year's Sopht<br />\nstuone<br />\nby<br />\nlong<br />\ntoo<br />\ncontinued<br />\nStephen<br />\nHall<br />\nand<br />\nE.<br />\nWheeler<br />\nJohn<br />\nC<br />\nthe<br />\n-in<br />\nlast season<br />\nhaving a tilt behind goal, when<br />\npocket and start the 'process over<br />\nomore, Junior and Senior classes, as held<br />\nmight perhaps be Fitzgerald were both members of<br />\nresult<br />\nthe<br />\ndent,<br />\nsuddenly Love passed to Campwell as one alumni ,delegate and one on the campus. The rough and again. If, however, the pocket has more or less disastrous, but if sufthe debating teams of the Class bell,<br />\nwho<br />\nwas<br />\nsufficiently<br />\nmedical delegate will be nominated. ready cowboys rode horses up any leaks in it, the blindfold test is ficient caution is taken' to selecl<br />\nof 1931, and have both signified screened to dodge his man and<br />\noff for the day as well as other items<br />\ndifferent men every 4ght -days their intentions of entering the send a<br />\nAn added feature of this Assem- the Marble steps in front, while concerned.<br />\nhard shot past Alman to<br />\nbly will be the public election of 0. the fearless Indians rolled beer- Next the collected cigarettes are and track practice for the hun- Adams medal contest.<br />\nscore the Jays' second count.<br />\nfi-•<br />\nall<br />\nmaintained,'<br />\nGordon<br />\nis<br />\nyards<br />\nmen.<br />\nD. K. of their Spring<br />\nkegs down the marble steps in taken to some dark corner and the dred<br />\nHarold Yudkin and Llewellyn Love scored the next Hopkins<br />\nStick. will be the principal speaker the rear. This affair will surpass number of stumps are carefully nancial worries for the purchase<br />\nStanton were members of this count on a pass from Campbell<br />\nat the -Assembly. The list of the by far the -Pirates Ball\" two counted and marked down in. a of-cigarettes are over for the fu<br />\nyear's victorious freshman debat- to the left corner of the crease.<br />\ninitiates has been kept a secret and<br />\ning team.<br />\nwhich many a good loose-leaf note book. After ac- ture.<br />\nJay Attack Fast<br />\nat<br />\nagt,<br />\nyears<br />\nthe names of the new members have<br />\nman went under and many a<br />\nGuild, in tallying the Jays' last<br />\nPlans were formulated at this<br />\nnot been rendered for publication.<br />\nInterfraternity Bridge<br />\nscene was imprinted upon the Tennis-1211m to<br />\nsession, too, for \"Whoopee Re- count of the opening period made<br />\nmind to be long remembered,<br />\nTournament Started union\" banquet at the-new Lord the only outstanding play of the<br />\nThursday<br />\nLoyola<br />\nPlay<br />\nRelay Team Third in<br />\nAmong the game. Starting in midfield, the<br />\nRealistic<br />\nAnticipating its eighth straight<br />\nShowing much skill with cards, Baltimore Hotel.<br />\nThird College Class<br />\nThis \"Hell Dance\" will be so victory of the season, the Johns the interfraternity bridge sharks speakers at _this banquet will be Jay attack kept up a fast passing<br />\nJohns Hopkins University was realistic that before the evening Hopkins tennis team will play Loy- moved the annual interfraternity Norman D. Gardner, who presid- until Lyons, Love and Dukehart<br />\nrepresented only by the one-mile re- gets well under way all the peobridge tournament into the quarter ed over the council laAt year. It had drawn their men about forty<br />\nin the ola College on Thursday. Anxious final round. As the results now is expected that members of de- feet from the Indian goal. Dukelay team at the Penn Relays, which ple w ill be asking: \"Why<br />\nof suctoIlk place at Franklin Field, Phila- world is there a heaven?\" or will to keep intact their record<br />\nstand, there are still twenty-seven bating teams from some of the hart, who was checked almost in<br />\nbe exclaiming: \"Thank goodness cessive wins, the Blue Jays will be hours of bridge left to be pondered nearer educational institutions midfield, signaled to Guild, who<br />\ndelphia, last Saturday,. April 27.<br />\nThis team; composed of Lockard, Heaven is Hell and Hell is dut.to defeat the Greyhounds when over. The most recent results are will also be present. Immediate- ran in, checked Parr's stick and<br />\nly before this banquet at 7.30 batted the pass from Dukehart<br />\nthey meet'on the Homewood courts. as follows:<br />\nINIorrison, Perry, and Scheidt, Heaven!\"<br />\nCaptain Brockman is well pleased •Those who advanced were: Delta Monday evening, election of offi- pass the Indian goalie.<br />\nplaced third in the Third - College -As the negro spiritual goes:<br />\nEight minutes before the first<br />\nClass relay. In this class Boston 'Yuh. can't go to lichen on the with the playing of the present tram Phi. Alpha Mu'Tau. Omicron Kap- cers will take place. Following<br />\nand will use the same men against pa Omicron, Sigma Tau Deltas and the inauguration '61 officers, Presi- half was over, Howard Caplan,<br />\nVniversity took trst place. covering<br />\nballroom tio'!<br />\ndent Hershey and Driver, Little- Jay second defense, suffered the<br />\nDelta Gamma Theta.<br />\nthe four laps in 3 minutes 26 3-5 Vult can't go to Heben on the<br />\nGaines have been scheduled be- field, Brownp and McDorman will only injury of the gtne, when he<br />\nThe encounter with Loyola will<br />\nseconds. The team representing<br />\nballroom ho',<br />\ngive forth the reins of control to twisted his left ankle. Harry<br />\nSwarthmore placed second.<br />\nmark the jays' firs.t, appearance On tween:<br />\n'Cause you dance right Ill<br />\nDelta I'hi and Alpha Mu Omi- the newly-elected officers, liana Love, who had been ill the *early<br />\nthe courts after a week's lay-off. • A<br />\nHell's front do'!\"<br />\nDartmouth Wins<br />\nvest oratorical power in them for part of the week, went in for Paul<br />\nas match had been scheduled with eron. Omicron Kappa Omicron<br />\n: In the Intercollegiate ChamPionit<br />\n1 he room will be decorated<br />\nthe forthcoming year.<br />\nUpsiFrisch just after Hopkins scared<br />\nDelta<br />\nDelta.<br />\nTau<br />\nThursday.<br />\nSigma<br />\nfor<br />\nand<br />\nLee<br />\nand<br />\nWashington<br />\nDartmouth<br />\ndoor,<br />\nship one-mile relay, the<br />\nBell itself, with furnace<br />\nFor the remainder of this scho- their first goal.<br />\nteam took first, with the time 3 min- gaping open and demons hand- April 25\"; and, although the Gen- lon and Pieta Theta Pi. Ph. Kappa<br />\nlastic year the Debating Council<br />\nlacrosse erals arrived with a full team, the Psi and Kappa Alpha.<br />\nFour to one was not a -count to<br />\nutes and 20 4-5 seconds. Yale. last<br />\nling pitchforks like the<br />\n:plans'but two activities—a debate exclude all possible hope of vicyear's victors in this event, placed team handles its sticks. Ishe fires match was' called off because of the 't he remaining games are pendMaryland,<br />\ndeof<br />\nvisitors<br />\nUniversity<br />\nthe<br />\nwith<br />\nschedThe<br />\ning, owing to the fact that the<br />\nhappy inclement weather.<br />\ntory from Gus Welsb, famous<br />\nthird.<br />\nwill .be blazing- and all the<br />\nand the Adams Oratorical Con- Carlisle Indian coach of RanThe Relays were featured by the souls will be .yelling and scream- parted immediately for Pennsyl- ule is slightly behind time.<br />\ntest for the Class of 1931.<br />\ndolph-Macon, who it seems told<br />\nremarkable work of Simpson. fast ing with delight, at the prospect vania to play a match with Lehigh.<br />\nPlans Not Complete<br />\nhis team so during the intermissprinter from Ohio State Uniyer- of a hot time. The only trouble<br />\nTennis Pairings<br />\nPlans for the debate have not sion at the half. The Hopkins atsilY• Simpson ran the .100-yard is the dance will he over at 1.30. R. 0. T. C. Mock Trial<br />\n•<br />\nAre Announced been completed. but it is expect- tack on the other hand dropped<br />\n'hill Lim 9 3-5 seconds. This time is<br />\nVaried Costumes<br />\nGives Verdict<br />\n, equal to the -world record for the<br />\ncharac<br />\nBeginning this week,, the first ed that the subject will be, \"Re- off considerably. None of the imany<br />\nas<br />\ndressed<br />\nPeople<br />\nI,ast Friday morning the mock round of the inter-fraternity tennis solved, That the Jury System ir pressive plays of the first half<br />\ncentury dash; this is also the first<br />\nin th':<br />\nin history supposedly<br />\nheld by the R. 0. T. C. Sen- competition will be played off. The Criminal Procedure be Abolished were repeated.<br />\ntrial<br />\n,1 Cline a world record has ever been ter<br />\nbe<br />\nwill<br />\nearth<br />\nworld under the<br />\n• equalled during'the Penn Relays.<br />\ngo- iors was brought to a close. Wil- paring offs as announced by the In- in the United States.\"<br />\nIndians Score<br />\npeople<br />\nof<br />\nCostumes<br />\nadmitted.<br />\nTo add to this victory, Sinipson rah<br />\nyou liam. B. Banks, President of the ter-fraternity Board are as follows: All sophomores wilt be eligible<br />\nShorty Cockerill, center for the<br />\nthe warm land will let<br />\nto<br />\ning<br />\non the Ohio State quarter and halfcostumes at all. Court, sentenced Stanley Dennison<br />\nPhi Gamma Delta versus Alpha for the Adams medal, which is Indian twelve and former' star<br />\nin, and outlandish<br />\nfrom the<br />\nmile relay-teams which placed first<br />\nthe folks at to dishonorable discharge<br />\nPhi; Phi Kappa Psi versus given annually to that sophomore performer for Andy Kirkpatrick's<br />\nKappa<br />\nmake<br />\nwould<br />\nthat<br />\nservice of the United States and Omicron Kappa Omicron; Delta who \"professes the ablest knowl- City College twelve, scored the<br />\nin both events.<br />\nworn.<br />\nbe<br />\nwill<br />\nhell<br />\nraise<br />\nhome<br />\none year at hard labor. The suc- Upsilon versus Tau Alpha Phi; edge of public speaking as exem- only Randolph-Macon count ten<br />\nNurmi Runs<br />\nwarm syncoBob Ittla,and 'his<br />\ncessful Trial Judge Advocates were Sigma Tau Delta versus Delta Gam- plified by an annual declamation minutes after the half started<br />\nPaavo Nurmi, who was one Of the<br />\nfor<br />\nmusic<br />\npators. will give the hot<br />\nMilton H. .Medenbach and J.'R. ma Theta; Kappa 'Alpha versus contest:\"<br />\nMassing the whole Indian attack<br />\nimportant drawing qualities of thi,<br />\ngive the<br />\nSalome's Dance; will<br />\nMoore. The defense attorneys were Delia Phi; Beta Theta Pi versus<br />\naround the Hopkins goal, CockYear Successful<br />\nyear's carnival which attracted over<br />\nto<br />\nCleopatra<br />\nfor<br />\nmoaning<br />\nK..',agen.<br />\nV.<br />\nand<br />\nsoulful<br />\nAlpha Delta Phi; Alpha Tau Ome- The. Debating Council has had erill was able to get a pass from<br />\nmu- Wilmer Driver<br />\n40,000 persons to watch the races,<br />\nwiles on Arlfony ; Three sessions were held before the ga versus Alpha Mu Tau. Kappa a very successful year, having King, dodge Campbell and run<br />\nwas expected to do some fast step- work her<br />\nBorgia to mix<br />\nLucrezia<br />\nfinal verdict was reached. sponsored the DeToqueville med- into the melee and whiz the ball<br />\nping in the two and three-mile sic for<br />\nSigma drew a bye.<br />\nwake up all<br />\npoison to; tunes to<br />\nSeven matches will be held in al contest, the Adams Memorial past Brownley.<br />\ndevevents; however, since he had no her<br />\nthe<br />\nof<br />\ninmates<br />\nEgyptian<br />\neach competition, five being singles Debate, and intercollegiate deAlthough the ball was in the<br />\nNOTICE<br />\nOpposition he- just managed to bet- the kingdom, music that will<br />\nter the American record for the two il's<br />\nand two being doubles. The regular bates with several southern uni- Indians' territory, nearly all the<br />\nthe'<br />\nshow<br />\nGold<br />\nGreen<br />\none<br />\nand<br />\nLost<br />\nwake up<br />\nEve<br />\nmake<br />\ntwo wins out of three sets are re- versities. Only one home debate second period, as it was the first,<br />\nMile race, but fell 18 seconds short<br />\nmen the<br />\nClass of 1928 Hopkins Ring<br />\nhow to win the<br />\nwas arranged—that with the Uni- only four more Jay goals were<br />\nquired for victory.<br />\nof meeting his own record in the maidens<br />\nat Homewood Field. The<br />\nAdam.<br />\ngot<br />\ninshe<br />\nthe<br />\non<br />\nengraved<br />\nway<br />\nring was<br />\nAs no such tournament has been versity of Virginia. It is sincere- scored. Guild and Caplan scored<br />\nthree mile event.<br />\nhas<br />\ncommittee<br />\nRob<br />\nname,<br />\nthe<br />\nwith<br />\nside<br />\nheld at the University previously, ly hoped that future councils will again in the closing half and LyFor weeks the<br />\nBeside these two features, this<br />\nheat to<br />\nRoy. Finder please notify<br />\nworking &I the<br />\npredictions would have no founda- be able to arrange for more home ons and Love each got one. Three<br />\nCalvert S<br />\nN.<br />\n3000<br />\nat<br />\nRoy<br />\nHELL<br />\nyear's relays were carried off with- been<br />\n,debates.<br />\nthis ,THE HOT<br />\nContinued on Page 2, Col 4<br />\ntion at this tirne.<br />\nput any great difference from pre- make<br />\nDANCE<br />\nceding years.<br />\n<br />\nJUNIOR DANCE PICTURED<br />\nAS BEST PARTY OF SEASON<br />\n<br />\nDEBATING COUNCIL<br />\nELECTS NEW MEMBERS<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1929<br />\n<br />\n2<br />\n<br />\nTILE MISHOPKINSINSIZTITit<br />\nFourinstri 1897<br />\n£2.00<br />\n<br />\n%baser:ption<br />\n<br />\nEntered as second-class matter December 3, 1909, at the PostofEce<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\n<br />\niii<br />\n<br />\nPublished semi-weekly from October to June by the students of John.s<br />\nHopkins University.<br />\nBusiness conununications should be addressed to the BusIszss MANAGER,<br />\nJohns Hopkins University. All art.cles should' be sent to the MANAGING<br />\nEDITOR; other communications to the Eurroat-tx-Crnst.<br />\nUniversity 0100<br />\n<br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br />\n<br />\n'Gem:GE GUMP,'30<br />\nManaging Editor<br />\nROBERT S. BAIRD, '30<br />\nAssistant Managing Editors<br />\nGEORGE H. POWELL,'31<br />\nRICHARD G. Ht:Nr, '31<br />\nJunior Editors<br />\nW. Purnell Hall, Jr., '30<br />\nStewart L. Smith, '30<br />\nqeorge 0. Tratt-ner, '30<br />\nRowland McDi Ness, '32<br />\nF. Mullikin, Jr., '31<br />\n'3arwood<br />\nPaul W. Spear. '30<br />\nNathan 31. Harris. '32 •<br />\nRobert F. Skutch, '30<br />\n'31 .<br />\nDanziger,<br />\nLewis<br />\nSidney Walk, '30<br />\nSylvan Lebow, '32<br />\nFrank Cone, '31<br />\nColumnist<br />\nSTEPHEN E. FITZGERALD, '31<br />\nBUSINESS DEPARTMENT<br />\nBusiness Mannger<br />\nGus BURKE,<br />\nCiranlation Ma-nager<br />\nAdvertising Manager<br />\nLYLE F. GULLEY, '30<br />\nGEORGE S. ROBERTSON, '31<br />\nOffice Manager<br />\nALVIN B. BLUM, '30<br />\nAdvertising Staff<br />\nOffiee Staff<br />\nHenry V. Saunders, '32<br />\nTheodore A. Fleishman. '31<br />\n'Sidney Raffel, '31<br />\nRandolph Rothchild. '31<br />\nDavid S. Sykes, '32<br />\nJohn A. Jamieson, '31<br />\nStaff Photographer<br />\nWALTER D. SCHEIDT<br />\n<br />\nLombard and South Streets,<br />\nProduced by The Read-Taylor Company,<br />\nBaltimore, Md.<br />\n<br />\nEDITORIALS<br />\nCO-OPERATION<br />\nof proHE attitude which the economics faculty has assumed<br />\nlubiting Arts and Sciences students from enrolling in the maTheir<br />\narbitrary.<br />\njority of their courses strikes us as particularly<br />\nis peassumption that a man, specializing iq languages, for instance, Our<br />\n,accounting is absurd..<br />\nculiarly unfitted to learn elementalunfitted for all<br />\ncourses are technical, they maintain, and as such are<br />\nthose who have not a special aptitude for the subject. through a deWe strongly suspect that they take this position<br />\ntherefore, to<br />\nsire to lirnit the amount of students in' their classes and,<br />\ndo. Pecullimit the amount of work which they are called upon to<br />\ns, refused<br />\niarly enough, they neglect the fact that the undergraduate already<br />\nadmiOion to their classes, must impinge their presence upon realize<br />\nwe<br />\ncourse,<br />\nOf<br />\nover-worked instructors in th( Arts school.<br />\nas merely an<br />\nthat the average professor looks upon each student<br />\nhis scholadded worry, another nuisance, and a further drawback to ,fail to<br />\nview, we<br />\narly attainments. Regardless of the justice of this<br />\nrules,<br />\narbitrary'<br />\nsee why one group of Instructors should lay down<br />\nmerely for<br />\ninjuring both undergraduates and their own colleagues,<br />\ntheir own -interest.<br />\nthat their<br />\nIn justice to these • professors, they probably believe<br />\nthe so-called<br />\nclasses will be more apt to absorb knowledge 'without<br />\nof college<br />\nman<br />\na<br />\nhampering influence of a History major. But why<br />\nsubtraction, mulage, fortifiV by a working knowledge of addition,<br />\nof ac'<br />\ntiplication and division, should be unable to grasp the elements<br />\ndisintegrating<br />\ncounting, merely because he has been subjected to the comprehend.<br />\nto<br />\ninfluence of a course in Philosophy, is a trifle difficult<br />\nof view.<br />\nLook at the question from the undergraduate's point<br />\n:a liberal<br />\nobtain<br />\nto<br />\nSciences<br />\nand<br />\nArts<br />\nHe enrolls in the College of<br />\nhis decision.<br />\neducation. He enjoys the work and does not regret<br />\nthat he is woeAlang towards his junior year he begins to realize<br />\nHe realizes<br />\nfully lacking in knowledge of the science of accounting.i desires to<br />\nhe<br />\nthat later he will be called upon to handle money and<br />\nprofessor in the<br />\nlearn something about it. Thereupon he visits a<br />\nthe faculty member his<br />\nSchool of Business Economics. He shows<br />\nhe has .at least<br />\ncollege record, plainly demonstrating the fact that<br />\n. \"We are<br />\nordinary intelligence and the faculty of comprehension precincts.\"<br />\nsacred<br />\nsorry,\" he is told- firmly, \"but you cannot enter our<br />\nfortunate inWhereupon the professor turns his attention'to a more Economics)<br />\ndividual (enrolled of course in the School of Business<br />\napproxiresult<br />\na<br />\nwhom he assumes can add five and three and reach<br />\n„<br />\nmating eight.<br />\nprofessors to his<br />\nThe applicant is not discouraged. He Calls other<br />\nprofessor that<br />\naid who testify as to his ability and 'assure the economics<br />\nthe School of<br />\nthe student shall do nothing to soil the fair name of \"You know<br />\nresult.<br />\nBusiness Economics. Still the same negative<br />\nbut we cannot<br />\nDt. So-and-so, I would do anything to oblige you<br />\nclosed and the<br />\n-Make an exception in Ihis man's case.\" The door is<br />\n$400.00 for<br />\napplicant gazes long and wonderingly at his receipt for<br />\ntuition.<br />\nSchool is<br />\nBusiness<br />\nthe<br />\nthat<br />\nThe argument has been advanced<br />\nafford to<br />\nnot endowed and is self-supporting. Therefore it cannot<br />\ncourses, since more<br />\nlet Arts and Sciences students take any of its<br />\nOther<br />\nmoney would have to be expended. Yet the faculty of the<br />\nadmitting<br />\ndepartments help give the Economics students an education,<br />\nis helped<br />\nthem freely to their classes. Since the economics faculty<br />\nmerely balin this manner, a like treatment to Arts students would<br />\nArts faculty<br />\nance the scales, for it must be remembered that if the<br />\nwould, in any<br />\ndid not assist the Economics department, the latter<br />\nA<br />\ninstructors.<br />\nmore<br />\ncase, be compelled to offer more courses with<br />\nlittle co-operation is sorely needed.<br />\n<br />\nT<br />\n<br />\nThe Liberal Club<br />\nBy<br />\n<br />\nAt the recent conferenerheld by<br />\nthe Liberal Club. I was enabled !to<br />\nattend one lecture. 1pon arriving.<br />\nI learned that the speaker was to be<br />\na certain Mr. Calverton, who was a<br />\ngraduate of the Johns Hopkins University and also co-author of \"Sex<br />\nand Civilization.\" I settled myself<br />\ninto an armchair—the only .one in<br />\nthe room—and Prepared to 'wait.<br />\nPresently I was gratified to see the<br />\ntamous Mr. Calverton himself entering, accompanied by several oth-<br />\n<br />\nwould serve. Before . permission<br />\nfor one of these clubs was given the<br />\nquestion would have to be discussed<br />\nby -the -faculty.\" It is a subject for<br />\nconjecture as to how Dean Miller<br />\ncould have confused the characteristics Of the Liberal Club with those I<br />\nof the typical .\"collegiate.\"<br />\nThe trouble with the Liberal' Club<br />\nas ii-e.X.its.here at Hopkins; is twofold, First; it apparently limits itself almost entirely to political questions, and second, it is composed of<br />\n<br />\ncotJen-atives.! Most of the que:<br />\ner \"liberals.\" An introduction<br />\npoorly done, as a matter of fact) tions!discussed are similar to these: ,<br />\nensued, and Mr. Calverton began to \"Dollar Diplomacy,\"\"What Can the<br />\nspeak upon \"What Can the Student Strident D6?\",\"and \"The Nicaragua<br />\nImmediately upon- asking Question.\" I have ,never heard of<br />\nDo<br />\nthis question ( rhetorically, of the Liberal Club discu,sing such<br />\ncourse) he ansrvered it at once by questions as \"Religion Versus Scisaying, \"not much,\" and -this brief ence,- \"Companionate Marriage,\" or<br />\nstatement is the essence of his whole even \"Why We Should Eat Peas<br />\nCalverton spoke for an with a Knife.\" These last .named<br />\nspeech.<br />\n,r:cts are themselves exceedingly<br />\nhour or more, but,-unfortunately, 1171<br />\nbut it would be a welcome resaid nothing. He started his lector;<br />\nto find at least one,of them inin ,America, touched briefly upon<br />\nPoland, Russia; and several other cluded in the Liberal Club programs.<br />\ncountries : he sp,.,ke of the :depths It fs quite possible that I ov.-e zin<br />\nof human ignorance, changed .sod- apology : that the Liberal Club d ,e-<br />\n<br />\ndenly to idealize the posSibilities of<br />\nliberal clubs, and finally finished, his<br />\nspeech, aving in his wake a profusion of clever Phrases. There is<br />\nno doubt that Mr. Calverton spoke<br />\nvery cleverly; that was obvious to<br />\nanyone who heard him. but whether<br />\nor not he said anything of importance is another question. The climax of the greeting was undoubtedly reached when a young girl got<br />\nup and declared that she thought the<br />\nwhole subject- a 'lot of tonrmyrot.\"<br />\n• Leaving aside the fact that the<br />\nconference itself had no real meaning, it remains. true that the after<br />\neffects have keen extremely interesting: The newspapers, sensing<br />\nthe fact that the Liberal Club has<br />\ngood news value, have served as eN-<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE', MD.<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nMEDIBEIRS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n<br />\nJ. A. RITTER & SON<br />\nFlorists and Decorators<br />\nBALTIMORE, MD.<br />\n<br />\n1918 N. CHARLES ST., Near 20TH.<br />\nPhone, VErnon 0573<br />\n<br />\nMEET YOUR FRIENDS AT<br />\n<br />\n\"The<br />\n<br />\n(ROBIN\" .<br />\n<br />\nThe \"HOTS'Y TOTSIE\" NIGHT CLUB<br />\nDANCING — DINING — ENTERTAINMENT<br />\n<br />\nVErnon<br />\n2682<br />\n<br />\nVINCENT CARA<br />\nand<br />\nHis RECORD BOYS<br />\nFLOSSY MILLER<br />\nManager<br />\n<br />\nChange of<br />\nProgram<br />\nWeekly<br />\n<br />\n844 N Howard St.<br />\n<br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths Since 1857<br />\n<br />\nDRESS SETS<br />\n<br />\ndiscuss such que,tions, but if so. I<br />\n<br />\nfor dinner and evening wear<br />\n<br />\nhave never heard of them.<br />\n<br />\nI cannot make a broadside state,<br />\nment that all of the men in the Liberal Club are conservatives, Isecou-e<br />\nI do tot know them all, but if I an:<br />\nto judge by those that I do know.<br />\n<br />\nBALTIMORE AT CHARLES STREET<br />\n<br />\nthen the statement ,goes with- or<br />\nqualification.<br />\n<br />\nson,<br />\n<br />\nth-CFriember-<br />\n<br />\nof this club have taken a rather pcculiar<br />\n<br />\nattitude.<br />\n<br />\nI hawardIv<br />\n<br />\nthey<br />\n<br />\nwear the colors of Liberalism. but<br />\n<br />\nbeneath! all this they are i-(.riting for<br />\nthe other side, and -have little sympathy with liberal sentiments. It is<br />\ndue partly to this fact, and due partly to the lack (ki initiative of the<br />\nmembers, that the Liberal Chi!) has<br />\n<br />\ndone<br />\n<br />\nThe club, on the campus-, is a.<br />\nname, and only a name. The mem'<br />\ncellent. publicity agents, •and have bership is ri,,t known, the \"platform.<br />\nis not known, and its goal —toward<br />\nthe<br />\nupon<br />\nspotlight<br />\nkeen<br />\na<br />\nthrown<br />\nwhich it is 'presumably working—<br />\n_<br />\nlack . of knowledge -and narrowness . lost<br />\nis.<br />\nsomewhere in the fog, and<br />\nof. at least two college deans of the even the members themselves do not<br />\nstate. Immediately after the con- stem to know what they are strivattain. The Liberal Club<br />\nference, Dean Miller, of Western ing<br />\nMaryland College: Dean Jones, of always willing to discus,: a:question.<br />\nWashington College, and Major hut when it is -a mattor of action it<br />\n, Col- bect,ine quie,cent and ruires to a<br />\n:<br />\nGarey, president of St. john'<br />\n1<br />\nlege, were asked whether to- n;:rthey \"discussion.\"<br />\n<br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and<br />\nLombard Sts.<br />\nPLaza 6000<br />\n1723-25 N.<br />\nCharles St.<br />\nVErnon 4049<br />\n2402 Pennsylvania Ave.<br />\nLAfayette 2000<br />\n<br />\nBuicks<br />\nChevrolets<br />\nChryslers<br />\nHupmobiles<br />\nWill's-Knights<br />\n<br />\nBaltimore Concedes Milestone Supremacy -<br />\n<br />\n•••••<br />\n<br />\n3<br />\na<br />\n<br />\nwould countenance liberal clubs on<br />\nPerhaps I have been unjust in my<br />\ntheir- campuses. Dean .b;nes, of last remark,. Perhap, the Liberal<br />\nWashington College,'said, ''If one Club has a great ilea.1 morc originat<br />\n<br />\nshould be organized, it woirld.Only ity and initiative than I give it credit<br />\nbe organized.by permission of the for. But if so. this fact should be<br />\nfaculty 'or a committee of the fac- made more evident On °the campus.<br />\nulty. I do not think that we would<br />\ncountenance it.\" The reply of Major Garey, who scents n, be the only HOPKINS STICKMEN<br />\nWIN FROM INDIANS!<br />\nintelligent member of the trio, is diContinued from Page 1, Col. 6<br />\nametrically opposed to this. Nlajor<br />\nCarey replied. \"There .was a club or four serious onslaughts of the<br />\nof the kind here two or three year- Indians on the Jay goal were<br />\nago, but .seems to have died Out. easily checked .by the excellent<br />\nIlowever, I should welcome one playing of the Hopkins close dehere. It would be a good thing to fense. :<br />\nhave a liberal club and a conserva- Hopkins<br />\nRandolph-Macon<br />\ntive club side by side on the campus. Brownley<br />\nAlman<br />\nC<br />\nHere we should like all phases of Hall ,<br />\nWithrow<br />\nSmith<br />\nthought to be discussed.\" But with- F. Cone<br />\nC.P<br />\nout doubt, the most amusing, as well Kegan<br />\nDiaz<br />\nF.D<br />\nas the most amazing, reply was that Caplan<br />\nCompton<br />\nS.D<br />\nof Dean Miller. His remarks show Nickel<br />\nParr<br />\nT.D<br />\na startling lack of knowledge upon Campbell<br />\nCockerill<br />\nC<br />\nMassay<br />\nthe subject, and are all the more sur- Frisch<br />\nT.A<br />\nprising when we consider his rel- Eagan<br />\nWeaver<br />\nS.A<br />\natively high position. Dean Miller Dukehart<br />\nF.A<br />\nTrader<br />\nsaid, \"Dealt Henry G. Doyle, of Guild<br />\nNunnally<br />\nO.H<br />\nGeorge Washington University, has Lyons<br />\nKing<br />\nIH<br />\nproved conclusively by the results<br />\nby<br />\nhalves:<br />\nScore<br />\nof a questionnaire that the repre4 4-8<br />\nHopkins<br />\nsentative college student is not the<br />\n0 1-1<br />\nRandolph-Macon<br />\nman who wears wide trousers, emSubstitutions: Love for Frisch,<br />\nblems, and open shirt fronts.. The<br />\nnumber of such students here would Ness for Caplan, Caplan for Ness,<br />\nnot be over two per cent. We do not Hersperger for Love. Goals—<br />\nconsider that a club of that kind Campbell (2), Guild (2), Caplan,<br />\nwould be needed on our campus be- Eagan, Love, Lyons, Cockerill,<br />\n-6use.we have a small percentage of Referee—George Hoban, DartY*<br />\nof<br />\nelection<br />\nthe<br />\nannouncing<br />\nin<br />\npleasure<br />\nThe NEWS-LETTER takes<br />\nstudents that a club of that kind mouth.<br />\nLebow to the position of Junior Editor.<br />\n<br />\nSylvan<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nDECORATIONS<br />\n<br />\n\"BEN'.<br />\n<br />\nESTA<br />\nSTYLES,<br />\nCHARTS S<br />\nSERVICE<br />\n<br />\nRS1TY<br />\nUTHFUL<br />\nGUISHED<br />\nSTATES.<br />\n<br />\n•Mmil<br />\n<br />\nTepeaets<br />\n<br />\n7.<br />\n<br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\nhArter Jv ousel<br />\nEAILIIIMCCU<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nDe40Hub<br />\nBaltimore. Cassios and.fayedle<br />\n•=•••<br />\n<br />\n:\".<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1929<br />\n<br />\nRENT<br />\ncc<br />\n<br />\nSNAPPY<br />\nTUXEDOS<br />\nFROM<br />\n<br />\nSULSKY<br />\n313 W. FRANKLIN STREET<br />\n<br />\nRita is noncommital.<br />\nDoesn't believe In<br />\nwomen's votes and<br />\nfeels woman's place<br />\nafter all is in the<br />\nhome. \"I don't think<br />\nI ought to make a<br />\nstatement\" she said<br />\nanswering our inquiry \"but maybe I<br />\nshould tell you I always, go with my<br />\nfiance to make sure<br />\nhe selects Braeburn<br />\nUniversity Clothes.\"<br />\n<br />\nMORE RESOLUTIONS<br />\nTo the Editor of the<br />\nNEws-LETTER.<br />\nDear Sir:<br />\n<br />\n-- INTERCOLLEGIATE NEWS<br />\n<br />\nWhereas the Liberal Club unContinued from Page 4, Col. 2<br />\nder, the direction of Honorable<br />\nMr. Teper has drawn up a resolu- The tasks of ,editing, writing and ough bathing\" and then a formal intion<br />\n\"petitioning the governor of publishing a literary magazine have troduction into his study robe.<br />\nCalifornia to free two habitual been successfully accomplished by a So—my dear fellow students in<br />\ncriminals, and,<br />\nfreshman student at the University distress—do not object too strenuWhereas, the Liberal Club of of Missouri. The ambitious young ously to these commencement gown<br />\nthe Johns Hopkins University man takes cah of everything con- fees, since after all our forefathers,<br />\nhas shown themselves to be the nected with the issue, except the<br />\netc., etc., etc.!<br />\nlargest group of socially-inclined<br />\nactual casting of type.<br />\nsuper-fools on the campus,<br />\nAdvertisements are not solicited,<br />\n\"College is not a safe place for a<br />\nTherefore, be it resolved, that<br />\nthe magaiine being entirety dependthe Liberal Club apologize to that<br />\nyoung man. The only 'safe place'<br />\narmy officer whom they deliber- ent upon the contribultons.of appre- for young men, or for old, that I<br />\nately insulted at one of their ciative readers.<br />\nknow of, is the grave. But college<br />\nmeetings, and<br />\n•To really appreciate this young<br />\nis a good place for men to grow.<br />\nBe it further resolved, that the man's work, °nee:oust actually be<br />\nGrowth implies danger, since it<br />\naforementioned Liberal Club connected with a student publication.<br />\nmeans the possibility of growing<br />\nclothe themselves In shame, be- (Note: This is ..not an advertiseworse as well as better.\"<br />\ncause of their many recent dis- ment for Staff candidates.)<br />\nIn view of the fact that Hopkins<br />\ngraceful activities and so disband<br />\nis emerging from its annual banquet<br />\nfor the good of the campus, and<br />\nthe welfare of'the Johns Hopkins<br />\nWhen Stephen. Leacock, well- season, it is fitting to see how some<br />\nUniversity.<br />\nknown humorous writer, recently of the other universities have been<br />\nConservative. told a' University audience that carrying on during their own fesabseils are worn at graduations be- tivities.<br />\ncause they are elt.ea.per than a pair<br />\nThree Lehigh freshmen innocentof pants and a coat, he had really ly drove into Allentown recently<br />\nhit the iou right an tjie head,-as haS and were besieged by a group of<br />\nE. E. ADAMS<br />\nbeen pros-en. Prof. IVacren E. bold sophs. The frosh were greatly<br />\nBarn Cafeteria<br />\nBlake ,of the Greek depc;inient of outnumbered, despite the efforts of<br />\nthe yaiversity-of Michigan, as a re- the father of one of them, and finalsult of his research work on the or- ly had to give in to the evil desires<br />\nPIPES REDUCED<br />\nigin of the cap and gown at college of their persecutors. However, the<br />\n20% off<br />\nBe Wade<br />\ngraduations, has found that they valiant \"pa\" could not bear to see<br />\nAll Others<br />\n10% off<br />\ndate back to the ancient Greek phil- his offspring carried off into the<br />\nosophers who wore them as study night with only an overcoat; accordgowns which would not riddily show ingly, he gave some blankets, which<br />\nthe dirt and were therefore quite he had taken from his car, to the<br />\neconomical. Gradually, student; of kidnapers, asking these to keep his<br />\nPhone HOrnewood,790E<br />\nthcSe So-called philosophical schools' boy warm. But, as the night was<br />\n(Birely's (Pharmacy' adopted this sort of dress and their chilly and the car an open one, the<br />\nimitation at the outset of their \"col- sophs made good use of the blankets<br />\nST. PAUL at 33rd STREET<br />\nlegiate\" days Consisted of a \"thor- themselves.<br />\nTour Neighborhood Drug Store<br />\n<br />\n$35<br />\n$40<br />\n$45<br />\nClothiers and Haberdashers<br />\n<br />\nsiitIl tULE11Fc0.<br />\nT7 E. Baltimore St.<br />\n<br />\nH. FETTING<br />\neMANUFACTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br />\n<br />\nUnique and beautiful jewels and minor decors,<br />\nmoderately priced.<br />\nCreators and importers of antique jewelry, precious<br />\nand semi-precious stones; and art objects.<br />\n<br />\nCARL SCHON, INC.<br />\n109 W. Saratoga St.<br />\n<br />\nAt Your Service 24 Hours a Day<br />\n<br />\nQ)1fayflower<br />\n<br />\nCab Co.<br />\n<br />\nINCORPORATED<br />\n<br />\n1<br />\n<br />\n7 18 N. Charles Street<br />\n<br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile<br />\nor fraction thereof<br />\nThe above rate applies for I to 4 passengers<br />\n<br />\nCOMPARE!<br />\nVErnon 4090<br />\n<br />\nStand at Homewood field<br />\n<br />\nFIDELITY AND DEPOSIT CO.<br />\nof Maryland<br />\n<br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND<br />\nD. C. HANDY, Manager<br />\n<br />\nnpoR, FIDELITY<br />\n<br />\nBLDG.<br />\nPhone PLua 0800<br />\n<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\n<br />\n'1301.Ey BANKs&BIDD<br />\n<br />\nMake OurStore Your Store<br />\n<br />\nEstablished 1832<br />\nPHILADELPHIA<br />\n<br />\nYELLOW CAB STANDS<br />\n<br />\nOfficial Makers of the. Standard<br />\n<br />\nAT<br />\n<br />\nHomewood Field<br />\n5th and St. Paul Stieetz<br />\n31st and St. Paul Streets<br />\nSafe and Efficient Service<br />\nPassengers<br />\nNo Charge for, Extia<br />\n<br />\nGive yourself the<br />\npleasure of smok,<br />\nins a fragrant,<br />\nmellow cigarette<br />\n<br />\n'PHONE<br />\n<br />\nVERNON 1212<br />\n<br />\nJohns Hopkins Ring<br />\n<br />\nFOR A<br />\n<br />\nPrices Upon Request<br />\nOrders accepted at the<br />\nPost Office in the College<br />\nPhone, CAL 1380<br />\n<br />\nYELLOW CAB<br />\nTEACHERS WANTED<br />\n<br />\nHome—HO. 2091.)<br />\n<br />\nare planning<br />\nMen and women who<br />\nschools or<br />\nto teach in secondary<br />\nor call. We<br />\ncolleges should write<br />\nHopkins gradumany<br />\nplaced<br />\nhave<br />\nates<br />\nTEACHERS'<br />\nTHE BALTIMORE<br />\nAGENCY<br />\n402-3 Title,Annex Bldg.<br />\n<br />\nFRANCES T. BANNON<br />\nSuccessor to HARIIAUGH 6? BANNON<br />\n. 2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing _<br />\n• Maryland<br />\nBaltimore<br />\n<br />\nFRANK BROTHERS<br />\nShop<br />\nKM Avenue Boot<br />\nStrects.NewYOrk<br />\n<br />\nBetween 47q.' and 48th<br />\n<br />\nModels for sports<br />\nand formal wear-'distinguished for__<br />\nstyle and quality<br />\n<br />\nAMEL<br />\n<br />\nc'T<br />\n<br />\nAt L. Schaeffer's, 1800 E. Monument<br />\n<br />\nSt., May 3rd .<br />\n<br />\nOpen fiorn<br />\n11.30 A. M. to 1.30 A. M.<br />\n<br />\nCollege Men's<br />\nLuncheon 50 Cents<br />\n<br />\nRESTAURANT<br />\nNEW CELESTIAL<br />\nAmerican • Chinese<br />\nStreet<br />\n117,119-121 N. Howard<br />\nPhone Calvert 6433<br />\n<br />\nDancing<br />\nMusic<br />\n<br />\nTheatre<br />\nParties<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nESSO<br />\n<br />\nNEW LIFE<br />\nFOR MOTOR<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nValue<br />\nThe Measure of Oil<br />\nSTANDARD OIL<br />\n<br />\nCOMPANY OF N.<br />\n<br />\nCIGARETTES<br />\nWHY CAMELS ARE THE BETTER CIGARETTE<br />\n<br />\nThe Camel blend of choice Turkish and<br />\nDomestic tobaccos has never been equaled.<br />\nThis blend produces a delightfid mildness and<br />\nmellowness.<br />\nCamels are always uniform in quality.<br />\nYou can smoke Camels freely without tiring<br />\nyour taste.<br />\nThey do not leave a cigareto after-taste.<br />\nCamels are a refreshing and satisfying smoke.<br />\n• Tobaccof,.<br />\n5..4<br />\n0.v<br />\n.<br />\n9,0<br />\n.y<br />\n12<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1929<br />\n<br />\n4<br />\n<br />\nBOOKS<br />\n<br />\nINTERCOLLEGIATg<br />\nNEWS - - '<br />\n<br />\nBought—Sold—E.changed<br />\n<br />\nP1PPEN'S BOOK STORE<br />\n605 N. EUTAW STREET<br />\n<br />\nFreshmen women at the 1:111VT-.<br />\n.1)- of Michigan prefer their men<br />\n\"moustachless.\" In ansiacring a<br />\nquestionnaire circulated by the University this group of women expressed the belief that the men go<br />\nin for moustache raising in order<br />\nto imitate ,the style of certain wellknown moving picture actors. Others expressed the opinion that the<br />\nmoustaches were all right in their<br />\n'place, but are too. often misplaced.'<br />\n<br />\nC<br />\n<br />\nollege eMen!<br />\n<br />\n. ;Truthfully, girls—do moustaehc,;<br />\nreally tickle?<br />\n<br />\n.PRE-MEDICAL SENIORS<br />\nINTERVIEWED BY DEAN<br />\nR ecently approximately<br />\nt.enty pre-Medical seniors<br />\nBy Bos<br />\nwere interviewed by Dr.<br />\nAmes in reference to their<br />\nThe combined heads of the Low<br />\nadmission to the School of<br />\nfamous Indian 'game have already<br />\nMedicine. In this group was<br />\ndecided so it seems that Dinty<br />\none woman.<br />\nMoore and his fighting Johnnies<br />\nDr. Ames will make recomshall wear the National Intercolmendation to Dr. Chesney, as<br />\nlegiate laurels for 1929. Undoubtassistant Dean of the School of<br />\nedly their victory over Maryland.<br />\nMedicine, who has the power<br />\nby a decisive 5 to'l score on Satof final acceptance of applicaurday could not but be imprestions. No final date was stated<br />\nsive to the gray bearded mentors,<br />\nas to when the senior accepted<br />\nbut just a gentle reminder . . .<br />\nwill be notified.<br />\nin April last year, they It'ad decided without a doubt that Hopkins was out of the running.<br />\nMeet<br />\n<br />\nON THE<br />\n- CREASE -<br />\n<br />\nAriation Club to<br />\nThursday at 12.30 P. _IL<br />\n<br />\nYou do get Better Kodak Pictures<br />\nfrom<br />\n<br />\n3044 GREENMOUNT AVENUE<br />\nUniversity 3829<br />\n<br />\nPhotographic Supplies<br />\n<br />\nPicture Framing<br />\n<br />\nGard Mallonee, member uf the<br />\nA few months ago, the idea of 1<br />\nIn style and quality -BostoniansStudents, of the Floating Univer- Olympic lacrosse team of 1928, forming an Aviation Club oh the<br />\nequal the most expensive footwear<br />\nL. G. BALFOUR CO.<br />\nsity had for their mid-year exam- member of Laurie Cox's All- Hopkins Campus was born in the .<br />\nproduced today.<br />\nFraternity Pins<br />\nfor the past three<br />\nthe •Phya Thai. Pdacc, American team<br />\nsite,<br />\nination<br />\nSlowly.<br />\nengineers.<br />\nminds of several<br />\nJewelry, Favors, Novelties<br />\n'<br />\nAnd the saving is a big item.<br />\nyears and lust recently member<br />\nRINGS<br />\nHOPKINS<br />\nwircre they stayed as guests of King.<br />\n'organization<br />\nCOMPLETE<br />\nof Benny Boynton's Olympic All- the interest in such an<br />\n1109 Fidelity Bldg.<br />\nRama I'll of Siam for nine days.<br />\nminds<br />\nthe<br />\nin<br />\nitself<br />\nrooted<br />\nand<br />\nis now playing for the grew<br />\nStars,<br />\nPhone CAlvert 1564<br />\nMostly $7 to $10<br />\nOf course, this Rama fellow is Crescents up in Brooklyn. Sat- of other men and, as a. result. an<br />\nardent supporter of the honor sys- urday the Crescents ruined the<br />\nAviation Chili was formed by some<br />\nExclusively in Baltimore<br />\ntem.<br />\nTHE NEW<br />\nof, no defeats. The of the engineers of the Sophomore<br />\nyale record of<br />\nto store one<br />\nCrescents only<br />\n,HOLLYWOOD SHIRT<br />\nBOSTONIAN<br />\nand Junior'Classes. a few weeks ago.<br />\nas is perhaps known goal to win. The Winning team's<br />\ncolumn,<br />\nThis<br />\ncreation! Black,<br />\nHollywood'slaiest<br />\nat<br />\nand<br />\n- SHOE STORE<br />\nIts membership. has grown<br />\n—and peihaps not known—is run defense was working almost to<br />\nembraces approx- I Orange and Biro are the colors.<br />\nit<br />\ntime<br />\npresent<br />\nthe<br />\nreports'.<br />\nto<br />\n•<br />\n112 E. Baltimore Street<br />\nby means of newspaper exchanges perfection, according<br />\nimately eighteen men.,<br />\nCopp<br />\ncMANNIE BERG<br />\nobtained from colleges and unii•er- Evidently Mal is as valuable to<br />\nCo.<br />\nat<br />\none<br />\nlista<br />\nthe<br />\nThe club is similar to<br />\nEach file Half Moons as Eddie Stuart<br />\ncountry.<br />\nthe<br />\nthroughout<br />\nshies<br />\nLapooa<br />\n-The Old Boy Himself'<br />\nI<br />\n119111,1119,111PWIMIIIIIrlrill<br />\nHarvard and the ones at other large<br />\nArt Vora<br />\nweek, the writer of this column— was.<br />\nTypography<br />\n*<br />\nuniversities. The purpose of foundNokTH & 'MARYLAND Ayes.<br />\nEn gra tattp<br />\nhow do—glad to meet you all—sits<br />\nCAJJERT<br />\nEst boo.,<br />\nlittle<br />\na<br />\nacquire<br />\nto<br />\nwas<br />\nclub<br />\nthe<br />\ning<br />\npathese<br />\nof<br />\npile<br />\nhuge<br />\na<br />\nwith<br />\nof<br />\n1.1<br />\nPruitt,<br />\ndown<br />\nRay Finn has become tired<br />\n1602.1603<br />\nfoldg<br />\ncourse.<br />\nOf<br />\naviation.<br />\nof<br />\nknowledge<br />\nto<br />\nproceeds<br />\nand<br />\nhim,<br />\npers before<br />\n1.9 1605 -Os*<br />\nhis old job of net guardian. He is<br />\n&ad,<br />\nP5X<br />\ncarefully scan each one for interest- now playing second attack for until more money is acquired. the THE CHARLES E. MYERS CO.<br />\n«<br />\nf<br />\n— Incorporated<br />\ning data. Needless to say, very the Bethlehem Steel lacrosse club will not invest in any airplanes.<br />\nManufacturer of<br />\n'SERVICE.<br />\namusing things occur in, this ex- team, and, playing it well. The The officers are: Bledso. president:<br />\n(RUBBER STAMPS<br />\nBen<br />\nchange game.<br />\ntop in the Bal- I. Miller, vice-president:<br />\non<br />\nare<br />\nBethlehems<br />\nThe Service Shop<br />\nErie, Pennsylvania<br />\nMeeks, secretary. and Weitzel, treasSept. 25, 1928<br />\n319 W. Redwood St<br />\nRecently a little article (the ma- timore Lacrosse League. The rea- urer.<br />\nProducers of \"The News-Letter\"<br />\nbrothers,<br />\nLAMS & Brother Company<br />\nLang<br />\nthe<br />\nis<br />\nterial for which was obtained front son why<br />\nRichmond, Va.<br />\nwho<br />\nKaufholz,<br />\na well known Pacific Coast Univer- Millard and Bill<br />\nDear Sirs:<br />\nHavingjustreturned from my fishing sity paper) appeared in this column. played lacrosse for Hopkins becamp in northern Ontario, and in the<br />\na periodical fore he became bald and we bereflections upon a fortnight of most Today. looking over<br />\nexcellent weather, wonderful fishing fromNermont—the Cynic by name came freshmen. Although Johnand complete camp comfort, I feel<br />\nny Lang, the elder of the Lang<br />\nthat an appreciation of Edgeworth is —you can imagine our surprise to<br />\ndue, as one of the principal factors of see the self-same article therein with brothers,: was captain of the Allour enjoyment.<br />\nlast year at center, he<br />\nIn past years, I have taken along a our own \"Johns Hopkins NEWS- American<br />\nsupply of various well-known brands LETTER\" affixed below.<br />\nis showing all new inhomes how<br />\nof smoking tobacco, never having bethe game should be played.<br />\ncome fully acquainted with the differThe article in question incidentence in the smoking qualities of the<br />\n-* * *<br />\nthe<br />\nat<br />\n,situation<br />\na<br />\nso-called high-grade tobaccos now aily, deals with<br />\nupon the market, and acting upon a Sorbonne in Paris.'<br />\nfor college larecord<br />\nnew<br />\nA<br />\ntip from an old smoker friend, and as<br />\na matter of convenience in packing,<br />\ncrosse was set Saturday, it is be.<br />\nthis year I took along a dozen tins of<br />\nlieved, although records .are not<br />\nEdgeworth Plug Slice.<br />\nYoshi OtuSka, 30-year-old Jap- obtainable. There were'seventeen<br />\nThere are no places nor conditions<br />\nin existence where the contentment anese Student of thc U. of Oregon,<br />\ngames Played Saturday in which<br />\ndrawn from a briar pipe meets with<br />\nkeener enjoyment or more critical and graduate of If 'asita University college. teams participated.<br />\nanalysis than beside the camp-fire of Tokio, has enrolled in the ,first<br />\na-after a strenuous day in the great<br />\n* *<br />\ngrade of a primary school in Euoutdoors.<br />\nIt is the unanimous opinion of the gene, Oregon. Otuska has g°psi<br />\nlacrosse guide<br />\nThe new<br />\nsmokers among my party that Edgeworth is vi ithout a peer, and that its through twenty years of school which is just out is more a guide.<br />\nsmoothness, fragrance and fine amok- study, and has been awarded inanv<br />\nto 1-fookins lacrosse than to laing qualities are tihsurpassed and unmatched; and I thank you for making scholastic honors, but as he wants crosse in general. It opens with a<br />\nit possible to obtain it.<br />\nto get first-hand information on the frontispiece of the jay lacrosse<br />\nYours truly,<br />\nprimarY educational system of this squad. From there pages \"and<br />\n(Signed) H. N. Curtiss<br />\ncountry he is adopting this propages are devoted to the Olympic<br />\ncidure.<br />\nteam and the National IntercolleA good procedure .for graduato giate Champions, of which we<br />\nExtra High Grade<br />\nwho have been doomed to disap- inure than have our share. Of the<br />\npointment in their Phi Bete aspira- Jay Olympic delegation permit us<br />\ntions!<br />\nto quote two paragraphs:<br />\nThis teas a splendidlacros-A' team,<br />\nContinuril • Page 11, Col.<br />\n1161111.11116111i111611111.W.11611<br />\none that -was truly representative of<br />\nthe ,best the game kno.txs in :the<br />\nUnited States, The work of this<br />\nteam both at home and in Amsterdam 701S a tribute to the type of<br />\nlacrosse played in-the United. States<br />\nWhen the other car shoots<br />\nand particularly to the SchmeisserVan Orman-Hopkins system.<br />\naway out in front, when the<br />\nIt was in versatility and adapat•<br />\nlight turns green--stop wonbility, founded upon a sound ad<br />\nnext<br />\ndering. Make your<br />\nrounded technique and upon bron.:,<br />\nthat the Hopkins twelve repeated'y,<br />\nStop at the AMOCOIn a part -of Africa little known to the rule with telephone men too, as they work<br />\nboth at home and abroad, demonGAS pump.<br />\nwhites, where obscure trails ran, Cecil to greater heights of service. ?But in bestrated its superiority over its opRhodes dared to envision a railroad. He tween, they know, must come periods of<br />\nponents. The team faced every style<br />\nlived to build it.<br />\ncareful planning and smooth coordination<br />\nof attack and defense and every sysThe railroad itself was part of a vaster of many elements.<br />\ntem of lacrosse known to the game<br />\ndream,a dream of a far inland colony linked<br />\nScientific research, manufacturing, plant<br />\nand was never \"stumped.\"<br />\nfast to existing coast settlements by rail construction, commercial development,<br />\nThe players, all college youngsters.<br />\nand wire communication. And he lived<br />\npublic relations, administration—many va(in marked contrast to the veteran<br />\nto build Rhodesia.<br />\nried telephone activities offer a widening opcasts - of the Canadian and Englisn<br />\nFirst the dream, then the reality, is the portunity to practical-minded visionaries.<br />\ntwelves), always were intelligent<br />\nenough to ,change details in their<br />\nstyle to suit the occasion and to<br />\nmake the change with prompt and<br />\ncertain decision. They had a COUnx4 wation-wide sp;ern of inter-tonnet}ing telephones<br />\nter for every opposing threat, no<br />\nmatter what its nature. In this respect, one is justified, it seems, in<br />\naccording the United States twelve<br />\nan unique place in the history of la‘‘OUR PIONEERING WORK HAS JUST BEG -IN\"<br />\ncrosse.<br />\n<br />\nra,c6f.3T,_m)c,.;)o7A<br />\nt;<br />\n<br />\nA<br />\n<br />\n20<br />\n1,<br />\n<br />\nV<br />\n<br />\ncrtke<br />\n<br />\nVacationist<br />\nFinds This<br />\nSmoke O.K.<br />\n<br />\nstEADTAYLOR<br />\n—<br />\n<br />\nEdgeworth<br />\n<br />\nSmoking Tobacco<br />\n<br />\nStop Wondering<br />\n<br />\nA vision come true<br />\n<br />\nBELL SYSTEM<br />\n<br />\n\f", "format": "basic_html", "processed": "MISZUMBIEER<br /><br />\nVol. XXXIII, No. 48<br /><br />\nOAK. TO ELECT<br />\nAT ASSEMBLY<br /><br />\nPrice 5 Cents<br /><br />\nHOMEWOOD,BALTIMORE, MD., APRIL 30, 1929<br /><br />\n'LETTER ANNOUNCES<br />\nSPRING COMPETITION<br />\nThe NEWS-LETTER wishes<br />\n\" announce the beginto,<br />\nning of a spring<br />\netition for candidate or both<br />\nthe editorial andj business,<br />\nstaffs of the publi ation. The<br />\neiitorial staff es ially is<br />\nin need of new material and<br />\nanyone participating in the<br />\ncompetition will have an unusual opportunity to make<br />\nthe staff.<br />\nCandidates are, asked to<br />\nenter the competition as<br />\nsoon as possible as only one<br />\nelection will be held before<br />\nfinal eXaminat ions. The<br />\nNEWS-LITTER office i;; open<br />\nTuesdays and Frid-<br /><br />\nRAINY DAYS NOT CONDUCIVE<br />\nTO CIGARETTE \"BUMMING\"<br /><br />\nFINAL PRICES FOR<br />\nJUNE WEEK ANNOUNCED<br />\nThe News-LETTER regrets<br />\nto announce a typographical<br />\nerror in the price schedule for<br />\nJune Week as published in the<br />\nlast issue. The revised sched-.<br />\nule as announced by Chairman John Eldridge is as follows:<br />\nFor Seniors—<br />\n$ 3.00<br />\nBanquet Ticket<br />\n3.00<br />\nJune Week Ticket<br />\nBanquet and June<br />\n5.00<br />\nWeek Ticket<br />\nFor Underclassmen—<br />\n15.00<br />\nJune Week Ticket<br />\nFor Alumni—<br />\n12.00<br />\nJune Week Ticket<br />\nThe underclassmen and<br />\nalumni tickets do not include<br />\nthe banquet, which is an ex7<br />\nelusive senior function. NO<br />\ntickets are transferrable.<br /><br />\nHOPKINS STICKMEN<br />\nWIN FROM INDIANS<br /><br />\nAfter many weary years of re- curate computations and deductions,<br />\nsearch and toil it has at last been dis- the figures are set down and the<br />\nNominations for President of<br />\nGuild Scores on Outstanding<br />\ncovered; the number of cigarettes process is started once more. Butt the<br />\nStudent Council<br />\nPlay<br />\nthat can be \"bummed\" in a day. necessity in all of these cases' is to<br />\nJAY ATTACK SLOW<br />\nELECTIONS NEXT WEEK<br />\nThis exhaustive work has been go- greet the prospective donor with a<br />\ning on for some time so that a fair cheerful smile, which is invariably<br />\nCockerill Scores Only RanDonald Hiss Asks That Last<br />\ndolph-Macon Goal<br />\nAssemblies Be Well Attended<br />\nbalance of the generosity of the returned by one of a slightly less<br />\nUniversity students may be correctly enthusiastic appearance, tell him<br />\na wild comeback after<br />\nStaging<br />\nassembly<br />\nbe<br />\nwill<br />\nThursday's<br />\nThis<br />\ndetermined when all types of weath- that you are buying two packs in an<br />\nits defeat at West Point last<br />\none that everyone should make an<br />\ner are taken into consideration in the hour when you collect two bits from<br />\nweek, the Johns Hopkins lacrosse<br />\nespecial effort to attend. The busiequation. On rainy days -the num- a friend, and ask him for a cigartwelve triumphed over Gus<br />\nber of cigarettes that can be borrow- ette.<br />\nness to be brought up is very impor7<br />\nWelsh's stubborn Indian stick:et! by a 'single individual is greatly<br />\nUpon refusal, however, one<br />\nwielders by an 8 to 1 count .at<br />\ntant and will affect all, either directreduced, while the morning after must not be discouraged for<br />\nHomewood Saturday. The Jay<br />\nly or indirectly during the remainder<br />\nexams Owls them practically non- there may be a cigarette or two<br />\ndefense displayed the same excelof this semester and all during the<br />\nexistent. However, the period when in his pocket that he wants to<br />\nlent style of stickwork that held<br />\nnext school.<br />\nthey are most abundant is immedi- use. The next proper step is to<br />\nthe bard fighting Army twelve<br />\nately after lunch in the Barn when' start searching him and when he<br />\nAt this meeting, the nominations<br />\ndown to four goals,'but little imall<br />\nwell<br />\nare<br />\nsupplied<br />\nto<br />\na<br />\nendure<br />\nnonbecomes violent and breaks sevfor the President of the Student<br />\nprovement was seen in the Hopstop card game until the first one eral, limbs, it is the best etiquette<br />\nkins attack.<br />\nCouncil, which honor is one of the<br />\no'clock' class.<br />\nto leaye him alone and cruise<br />\nhighest that can be attained by an<br />\nTwo minutes after the opening<br />\nThus upon the above,observations elswhere.<br />\nwhistle, Hopkins' first drive on<br />\nundergraduate, will be held. The<br />\nit was resolved that an actual count<br />\nIn this dawn to dusk test, with<br />\nthe Randolph-Macon goal resultretiring President, Donald should be made of tobacco donations<br />\nthe mentioned measures in force<br />\ned in a tally for the Jays when<br />\nasks tliat this ;issembly and the one Elaborate Decorations Planned upon the .campus, and the results<br />\nit was found that on an'averagt<br />\nHoward Caplan, receiving a long<br />\nfairly<br />\nwere<br />\nUpon<br />\nsuccessful.<br />\nfightfor<br />\nHell<br />\nDance<br />\nbe<br />\nwill<br />\nwhich<br />\nthe<br />\nThursda,<br />\nnext<br />\nfreshman could \"bum\"<br />\npass from Guild from behind<br />\ning a gift cigarette after a successful a single<br />\nlast two this year, be well attended. \"Come dressed like Hell\" to<br />\n47 cigarettes before it was neces Plans for \"Whoopee\" Banquet goal,,sent the ball past the Yelrequest, it is cleverly concealed below Jacket goalie.<br />\nFormulated<br />\nThe nominations for the Presidency the Junior dance at Lehmann hind the back and the next -nearest sary lo call the ambulance to help<br />\nhim off the campus. This high<br />\nwill be held this Thursday, and next Hall on May 4, at 9.30 P. M.<br />\nAddison Campbell made the<br />\nperson is asked for another. • This<br />\nTwo freshmen and two sophoThursday the election will be held. This dance will be the very is great until the number in the left rating at the University definitely mores were elected to member- next Hopkins goal, but a bit more<br />\nproves no one need buy cigarettes<br />\nmaneuvering was necessary, than<br />\nNOminations for the delegates to best hop eve!' thrown, even ex- hand begins to get too numerous<br />\nin the future if the few sitnple ship in the Johns Hopkins Debatthe Athletic Association Board will, ceeding, in every way, the not- and incidently begins to burn slight- means suggested are employed ing Council at their regular meet- for the opening tally. Harry Love<br />\nand Smith, the biggest man on<br />\nly, then the object is to slip them all<br />\nalso be held this Thursday. Men<br />\nsoon-to-be-forgotten \"Pow Wow\" into a specially prepared asbestos to obtain smokes from others. If ing on Thursday afternoon.<br />\nthe Randolph-Macon team were<br />\nfor delegates from next year's Sopht<br />\nstuone<br />\nby<br />\nlong<br />\ntoo<br />\ncontinued<br />\nStephen<br />\nHall<br />\nand<br />\nE.<br />\nWheeler<br />\nJohn<br />\nC<br />\nthe<br />\n-in<br />\nlast season<br />\nhaving a tilt behind goal, when<br />\npocket and start the 'process over<br />\nomore, Junior and Senior classes, as held<br />\nmight perhaps be Fitzgerald were both members of<br />\nresult<br />\nthe<br />\ndent,<br />\nsuddenly Love passed to Campwell as one alumni ,delegate and one on the campus. The rough and again. If, however, the pocket has more or less disastrous, but if sufthe debating teams of the Class bell,<br />\nwho<br />\nwas<br />\nsufficiently<br />\nmedical delegate will be nominated. ready cowboys rode horses up any leaks in it, the blindfold test is ficient caution is taken' to selecl<br />\nof 1931, and have both signified screened to dodge his man and<br />\noff for the day as well as other items<br />\ndifferent men every 4ght -days their intentions of entering the send a<br />\nAn added feature of this Assem- the Marble steps in front, while concerned.<br />\nhard shot past Alman to<br />\nbly will be the public election of 0. the fearless Indians rolled beer- Next the collected cigarettes are and track practice for the hun- Adams medal contest.<br />\nscore the Jays' second count.<br />\nfi-•<br />\nall<br />\nmaintained,'<br />\nGordon<br />\nis<br />\nyards<br />\nmen.<br />\nD. K. of their Spring<br />\nkegs down the marble steps in taken to some dark corner and the dred<br />\nHarold Yudkin and Llewellyn Love scored the next Hopkins<br />\nStick. will be the principal speaker the rear. This affair will surpass number of stumps are carefully nancial worries for the purchase<br />\nStanton were members of this count on a pass from Campbell<br />\nat the -Assembly. The list of the by far the -Pirates Ball\" two counted and marked down in. a of-cigarettes are over for the fu<br />\nyear's victorious freshman debat- to the left corner of the crease.<br />\ninitiates has been kept a secret and<br />\ning team.<br />\nwhich many a good loose-leaf note book. After ac- ture.<br />\nJay Attack Fast<br />\nat<br />\nagt,<br />\nyears<br />\nthe names of the new members have<br />\nman went under and many a<br />\nGuild, in tallying the Jays' last<br />\nPlans were formulated at this<br />\nnot been rendered for publication.<br />\nInterfraternity Bridge<br />\nscene was imprinted upon the Tennis-1211m to<br />\nsession, too, for \"Whoopee Re- count of the opening period made<br />\nmind to be long remembered,<br />\nTournament Started union\" banquet at the-new Lord the only outstanding play of the<br />\nThursday<br />\nLoyola<br />\nPlay<br />\nRelay Team Third in<br />\nAmong the game. Starting in midfield, the<br />\nRealistic<br />\nAnticipating its eighth straight<br />\nShowing much skill with cards, Baltimore Hotel.<br />\nThird College Class<br />\nThis \"Hell Dance\" will be so victory of the season, the Johns the interfraternity bridge sharks speakers at _this banquet will be Jay attack kept up a fast passing<br />\nJohns Hopkins University was realistic that before the evening Hopkins tennis team will play Loy- moved the annual interfraternity Norman D. Gardner, who presid- until Lyons, Love and Dukehart<br />\nrepresented only by the one-mile re- gets well under way all the peobridge tournament into the quarter ed over the council laAt year. It had drawn their men about forty<br />\nin the ola College on Thursday. Anxious final round. As the results now is expected that members of de- feet from the Indian goal. Dukelay team at the Penn Relays, which ple w ill be asking: \"Why<br />\nof suctoIlk place at Franklin Field, Phila- world is there a heaven?\" or will to keep intact their record<br />\nstand, there are still twenty-seven bating teams from some of the hart, who was checked almost in<br />\nbe exclaiming: \"Thank goodness cessive wins, the Blue Jays will be hours of bridge left to be pondered nearer educational institutions midfield, signaled to Guild, who<br />\ndelphia, last Saturday,. April 27.<br />\nThis team; composed of Lockard, Heaven is Hell and Hell is dut.to defeat the Greyhounds when over. The most recent results are will also be present. Immediate- ran in, checked Parr's stick and<br />\nly before this banquet at 7.30 batted the pass from Dukehart<br />\nthey meet'on the Homewood courts. as follows:<br />\nINIorrison, Perry, and Scheidt, Heaven!\"<br />\nCaptain Brockman is well pleased •Those who advanced were: Delta Monday evening, election of offi- pass the Indian goalie.<br />\nplaced third in the Third - College -As the negro spiritual goes:<br />\nEight minutes before the first<br />\nClass relay. In this class Boston 'Yuh. can't go to lichen on the with the playing of the present tram Phi. Alpha Mu'Tau. Omicron Kap- cers will take place. Following<br />\nand will use the same men against pa Omicron, Sigma Tau Deltas and the inauguration '61 officers, Presi- half was over, Howard Caplan,<br />\nVniversity took trst place. covering<br />\nballroom tio'!<br />\ndent Hershey and Driver, Little- Jay second defense, suffered the<br />\nDelta Gamma Theta.<br />\nthe four laps in 3 minutes 26 3-5 Vult can't go to Heben on the<br />\nGaines have been scheduled be- field, Brownp and McDorman will only injury of the gtne, when he<br />\nThe encounter with Loyola will<br />\nseconds. The team representing<br />\nballroom ho',<br />\ngive forth the reins of control to twisted his left ankle. Harry<br />\nSwarthmore placed second.<br />\nmark the jays' firs.t, appearance On tween:<br />\n'Cause you dance right Ill<br />\nDelta I'hi and Alpha Mu Omi- the newly-elected officers, liana Love, who had been ill the *early<br />\nthe courts after a week's lay-off. • A<br />\nHell's front do'!\"<br />\nDartmouth Wins<br />\nvest oratorical power in them for part of the week, went in for Paul<br />\nas match had been scheduled with eron. Omicron Kappa Omicron<br />\n: In the Intercollegiate ChamPionit<br />\n1 he room will be decorated<br />\nthe forthcoming year.<br />\nUpsiFrisch just after Hopkins scared<br />\nDelta<br />\nDelta.<br />\nTau<br />\nThursday.<br />\nSigma<br />\nfor<br />\nand<br />\nLee<br />\nand<br />\nWashington<br />\nDartmouth<br />\ndoor,<br />\nship one-mile relay, the<br />\nBell itself, with furnace<br />\nFor the remainder of this scho- their first goal.<br />\nteam took first, with the time 3 min- gaping open and demons hand- April 25\"; and, although the Gen- lon and Pieta Theta Pi. Ph. Kappa<br />\nlastic year the Debating Council<br />\nlacrosse erals arrived with a full team, the Psi and Kappa Alpha.<br />\nFour to one was not a -count to<br />\nutes and 20 4-5 seconds. Yale. last<br />\nling pitchforks like the<br />\n:plans'but two activities—a debate exclude all possible hope of vicyear's victors in this event, placed team handles its sticks. Ishe fires match was' called off because of the 't he remaining games are pendMaryland,<br />\ndeof<br />\nvisitors<br />\nUniversity<br />\nthe<br />\nwith<br />\nschedThe<br />\ning, owing to the fact that the<br />\nhappy inclement weather.<br />\ntory from Gus Welsb, famous<br />\nthird.<br />\nwill .be blazing- and all the<br />\nand the Adams Oratorical Con- Carlisle Indian coach of RanThe Relays were featured by the souls will be .yelling and scream- parted immediately for Pennsyl- ule is slightly behind time.<br />\ntest for the Class of 1931.<br />\ndolph-Macon, who it seems told<br />\nremarkable work of Simpson. fast ing with delight, at the prospect vania to play a match with Lehigh.<br />\nPlans Not Complete<br />\nhis team so during the intermissprinter from Ohio State Uniyer- of a hot time. The only trouble<br />\nTennis Pairings<br />\nPlans for the debate have not sion at the half. The Hopkins atsilY• Simpson ran the .100-yard is the dance will he over at 1.30. R. 0. T. C. Mock Trial<br />\n•<br />\nAre Announced been completed. but it is expect- tack on the other hand dropped<br />\n'hill Lim 9 3-5 seconds. This time is<br />\nVaried Costumes<br />\nGives Verdict<br />\n, equal to the -world record for the<br />\ncharac<br />\nBeginning this week,, the first ed that the subject will be, \"Re- off considerably. None of the imany<br />\nas<br />\ndressed<br />\nPeople<br />\nI,ast Friday morning the mock round of the inter-fraternity tennis solved, That the Jury System ir pressive plays of the first half<br />\ncentury dash; this is also the first<br />\nin th':<br />\nin history supposedly<br />\nheld by the R. 0. T. C. Sen- competition will be played off. The Criminal Procedure be Abolished were repeated.<br />\ntrial<br />\n,1 Cline a world record has ever been ter<br />\nbe<br />\nwill<br />\nearth<br />\nworld under the<br />\n• equalled during'the Penn Relays.<br />\ngo- iors was brought to a close. Wil- paring offs as announced by the In- in the United States.\"<br />\nIndians Score<br />\npeople<br />\nof<br />\nCostumes<br />\nadmitted.<br />\nTo add to this victory, Sinipson rah<br />\nyou liam. B. Banks, President of the ter-fraternity Board are as follows: All sophomores wilt be eligible<br />\nShorty Cockerill, center for the<br />\nthe warm land will let<br />\nto<br />\ning<br />\non the Ohio State quarter and halfcostumes at all. Court, sentenced Stanley Dennison<br />\nPhi Gamma Delta versus Alpha for the Adams medal, which is Indian twelve and former' star<br />\nin, and outlandish<br />\nfrom the<br />\nmile relay-teams which placed first<br />\nthe folks at to dishonorable discharge<br />\nPhi; Phi Kappa Psi versus given annually to that sophomore performer for Andy Kirkpatrick's<br />\nKappa<br />\nmake<br />\nwould<br />\nthat<br />\nservice of the United States and Omicron Kappa Omicron; Delta who \"professes the ablest knowl- City College twelve, scored the<br />\nin both events.<br />\nworn.<br />\nbe<br />\nwill<br />\nhell<br />\nraise<br />\nhome<br />\none year at hard labor. The suc- Upsilon versus Tau Alpha Phi; edge of public speaking as exem- only Randolph-Macon count ten<br />\nNurmi Runs<br />\nwarm syncoBob Ittla,and 'his<br />\ncessful Trial Judge Advocates were Sigma Tau Delta versus Delta Gam- plified by an annual declamation minutes after the half started<br />\nPaavo Nurmi, who was one Of the<br />\nfor<br />\nmusic<br />\npators. will give the hot<br />\nMilton H. .Medenbach and J.'R. ma Theta; Kappa 'Alpha versus contest:\"<br />\nMassing the whole Indian attack<br />\nimportant drawing qualities of thi,<br />\ngive the<br />\nSalome's Dance; will<br />\nMoore. The defense attorneys were Delia Phi; Beta Theta Pi versus<br />\naround the Hopkins goal, CockYear Successful<br />\nyear's carnival which attracted over<br />\nto<br />\nCleopatra<br />\nfor<br />\nmoaning<br />\nK..',agen.<br />\nV.<br />\nand<br />\nsoulful<br />\nAlpha Delta Phi; Alpha Tau Ome- The. Debating Council has had erill was able to get a pass from<br />\nmu- Wilmer Driver<br />\n40,000 persons to watch the races,<br />\nwiles on Arlfony ; Three sessions were held before the ga versus Alpha Mu Tau. Kappa a very successful year, having King, dodge Campbell and run<br />\nwas expected to do some fast step- work her<br />\nBorgia to mix<br />\nLucrezia<br />\nfinal verdict was reached. sponsored the DeToqueville med- into the melee and whiz the ball<br />\nping in the two and three-mile sic for<br />\nSigma drew a bye.<br />\nwake up all<br />\npoison to; tunes to<br />\nSeven matches will be held in al contest, the Adams Memorial past Brownley.<br />\ndevevents; however, since he had no her<br />\nthe<br />\nof<br />\ninmates<br />\nEgyptian<br />\neach competition, five being singles Debate, and intercollegiate deAlthough the ball was in the<br />\nNOTICE<br />\nOpposition he- just managed to bet- the kingdom, music that will<br />\nter the American record for the two il's<br />\nand two being doubles. The regular bates with several southern uni- Indians' territory, nearly all the<br />\nthe'<br />\nshow<br />\nGold<br />\nGreen<br />\none<br />\nand<br />\nLost<br />\nwake up<br />\nEve<br />\nmake<br />\ntwo wins out of three sets are re- versities. Only one home debate second period, as it was the first,<br />\nMile race, but fell 18 seconds short<br />\nmen the<br />\nClass of 1928 Hopkins Ring<br />\nhow to win the<br />\nwas arranged—that with the Uni- only four more Jay goals were<br />\nquired for victory.<br />\nof meeting his own record in the maidens<br />\nat Homewood Field. The<br />\nAdam.<br />\ngot<br />\ninshe<br />\nthe<br />\non<br />\nengraved<br />\nway<br />\nring was<br />\nAs no such tournament has been versity of Virginia. It is sincere- scored. Guild and Caplan scored<br />\nthree mile event.<br />\nhas<br />\ncommittee<br />\nRob<br />\nname,<br />\nthe<br />\nwith<br />\nside<br />\nheld at the University previously, ly hoped that future councils will again in the closing half and LyFor weeks the<br />\nBeside these two features, this<br />\nheat to<br />\nRoy. Finder please notify<br />\nworking &amp;I the<br />\npredictions would have no founda- be able to arrange for more home ons and Love each got one. Three<br />\nCalvert S<br />\nN.<br />\n3000<br />\nat<br />\nRoy<br />\nHELL<br />\nyear's relays were carried off with- been<br />\n,debates.<br />\nthis ,THE HOT<br />\nContinued on Page 2, Col 4<br />\ntion at this tirne.<br />\nput any great difference from pre- make<br />\nDANCE<br />\nceding years.<br /><br />\nJUNIOR DANCE PICTURED<br />\nAS BEST PARTY OF SEASON<br /><br />\nDEBATING COUNCIL<br />\nELECTS NEW MEMBERS<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1929<br /><br />\n2<br /><br />\nTILE MISHOPKINSINSIZTITit<br />\nFourinstri 1897<br />\n£2.00<br /><br />\n%baser:ption<br /><br />\nEntered as second-class matter December 3, 1909, at the PostofEce<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br /><br />\niii<br /><br />\nPublished semi-weekly from October to June by the students of John.s<br />\nHopkins University.<br />\nBusiness conununications should be addressed to the BusIszss MANAGER,<br />\nJohns Hopkins University. All art.cles should' be sent to the MANAGING<br />\nEDITOR; other communications to the Eurroat-tx-Crnst.<br />\nUniversity 0100<br /><br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chief<br /><br />\n'Gem:GE GUMP,'30<br />\nManaging Editor<br />\nROBERT S. BAIRD, '30<br />\nAssistant Managing Editors<br />\nGEORGE H. POWELL,'31<br />\nRICHARD G. Ht:Nr, '31<br />\nJunior Editors<br />\nW. Purnell Hall, Jr., '30<br />\nStewart L. Smith, '30<br />\nqeorge 0. Tratt-ner, '30<br />\nRowland McDi Ness, '32<br />\nF. Mullikin, Jr., '31<br />\n'3arwood<br />\nPaul W. Spear. '30<br />\nNathan 31. Harris. '32 •<br />\nRobert F. Skutch, '30<br />\n'31 .<br />\nDanziger,<br />\nLewis<br />\nSidney Walk, '30<br />\nSylvan Lebow, '32<br />\nFrank Cone, '31<br />\nColumnist<br />\nSTEPHEN E. FITZGERALD, '31<br />\nBUSINESS DEPARTMENT<br />\nBusiness Mannger<br />\nGus BURKE,<br />\nCiranlation Ma-nager<br />\nAdvertising Manager<br />\nLYLE F. GULLEY, '30<br />\nGEORGE S. ROBERTSON, '31<br />\nOffice Manager<br />\nALVIN B. BLUM, '30<br />\nAdvertising Staff<br />\nOffiee Staff<br />\nHenry V. Saunders, '32<br />\nTheodore A. Fleishman. '31<br />\n'Sidney Raffel, '31<br />\nRandolph Rothchild. '31<br />\nDavid S. Sykes, '32<br />\nJohn A. Jamieson, '31<br />\nStaff Photographer<br />\nWALTER D. SCHEIDT<br /><br />\nLombard and South Streets,<br />\nProduced by The Read-Taylor Company,<br />\nBaltimore, Md.<br /><br />\nEDITORIALS<br />\nCO-OPERATION<br />\nof proHE attitude which the economics faculty has assumed<br />\nlubiting Arts and Sciences students from enrolling in the maTheir<br />\narbitrary.<br />\njority of their courses strikes us as particularly<br />\nis peassumption that a man, specializing iq languages, for instance, Our<br />\n,accounting is absurd..<br />\nculiarly unfitted to learn elementalunfitted for all<br />\ncourses are technical, they maintain, and as such are<br />\nthose who have not a special aptitude for the subject. through a deWe strongly suspect that they take this position<br />\ntherefore, to<br />\nsire to lirnit the amount of students in' their classes and,<br />\ndo. Pecullimit the amount of work which they are called upon to<br />\ns, refused<br />\niarly enough, they neglect the fact that the undergraduate already<br />\nadmiOion to their classes, must impinge their presence upon realize<br />\nwe<br />\ncourse,<br />\nOf<br />\nover-worked instructors in th( Arts school.<br />\nas merely an<br />\nthat the average professor looks upon each student<br />\nhis scholadded worry, another nuisance, and a further drawback to ,fail to<br />\nview, we<br />\narly attainments. Regardless of the justice of this<br />\nrules,<br />\narbitrary'<br />\nsee why one group of Instructors should lay down<br />\nmerely for<br />\ninjuring both undergraduates and their own colleagues,<br />\ntheir own -interest.<br />\nthat their<br />\nIn justice to these • professors, they probably believe<br />\nthe so-called<br />\nclasses will be more apt to absorb knowledge 'without<br />\nof college<br />\nman<br />\na<br />\nhampering influence of a History major. But why<br />\nsubtraction, mulage, fortifiV by a working knowledge of addition,<br />\nof ac'<br />\ntiplication and division, should be unable to grasp the elements<br />\ndisintegrating<br />\ncounting, merely because he has been subjected to the comprehend.<br />\nto<br />\ninfluence of a course in Philosophy, is a trifle difficult<br />\nof view.<br />\nLook at the question from the undergraduate's point<br />\n:a liberal<br />\nobtain<br />\nto<br />\nSciences<br />\nand<br />\nArts<br />\nHe enrolls in the College of<br />\nhis decision.<br />\neducation. He enjoys the work and does not regret<br />\nthat he is woeAlang towards his junior year he begins to realize<br />\nHe realizes<br />\nfully lacking in knowledge of the science of accounting.i desires to<br />\nhe<br />\nthat later he will be called upon to handle money and<br />\nprofessor in the<br />\nlearn something about it. Thereupon he visits a<br />\nthe faculty member his<br />\nSchool of Business Economics. He shows<br />\nhe has .at least<br />\ncollege record, plainly demonstrating the fact that<br />\n. \"We are<br />\nordinary intelligence and the faculty of comprehension precincts.\"<br />\nsacred<br />\nsorry,\" he is told- firmly, \"but you cannot enter our<br />\nfortunate inWhereupon the professor turns his attention'to a more Economics)<br />\ndividual (enrolled of course in the School of Business<br />\napproxiresult<br />\na<br />\nwhom he assumes can add five and three and reach<br />\n„<br />\nmating eight.<br />\nprofessors to his<br />\nThe applicant is not discouraged. He Calls other<br />\nprofessor that<br />\naid who testify as to his ability and 'assure the economics<br />\nthe School of<br />\nthe student shall do nothing to soil the fair name of \"You know<br />\nresult.<br />\nBusiness Economics. Still the same negative<br />\nbut we cannot<br />\nDt. So-and-so, I would do anything to oblige you<br />\nclosed and the<br />\n-Make an exception in Ihis man's case.\" The door is<br />\n$400.00 for<br />\napplicant gazes long and wonderingly at his receipt for<br />\ntuition.<br />\nSchool is<br />\nBusiness<br />\nthe<br />\nthat<br />\nThe argument has been advanced<br />\nafford to<br />\nnot endowed and is self-supporting. Therefore it cannot<br />\ncourses, since more<br />\nlet Arts and Sciences students take any of its<br />\nOther<br />\nmoney would have to be expended. Yet the faculty of the<br />\nadmitting<br />\ndepartments help give the Economics students an education,<br />\nis helped<br />\nthem freely to their classes. Since the economics faculty<br />\nmerely balin this manner, a like treatment to Arts students would<br />\nArts faculty<br />\nance the scales, for it must be remembered that if the<br />\nwould, in any<br />\ndid not assist the Economics department, the latter<br />\nA<br />\ninstructors.<br />\nmore<br />\ncase, be compelled to offer more courses with<br />\nlittle co-operation is sorely needed.<br /><br />\nT<br /><br />\nThe Liberal Club<br />\nBy<br /><br />\nAt the recent conferenerheld by<br />\nthe Liberal Club. I was enabled !to<br />\nattend one lecture. 1pon arriving.<br />\nI learned that the speaker was to be<br />\na certain Mr. Calverton, who was a<br />\ngraduate of the Johns Hopkins University and also co-author of \"Sex<br />\nand Civilization.\" I settled myself<br />\ninto an armchair—the only .one in<br />\nthe room—and Prepared to 'wait.<br />\nPresently I was gratified to see the<br />\ntamous Mr. Calverton himself entering, accompanied by several oth-<br /><br />\nwould serve. Before . permission<br />\nfor one of these clubs was given the<br />\nquestion would have to be discussed<br />\nby -the -faculty.\" It is a subject for<br />\nconjecture as to how Dean Miller<br />\ncould have confused the characteristics Of the Liberal Club with those I<br />\nof the typical .\"collegiate.\"<br />\nThe trouble with the Liberal' Club<br />\nas ii-e.X.its.here at Hopkins; is twofold, First; it apparently limits itself almost entirely to political questions, and second, it is composed of<br /><br />\ncotJen-atives.! Most of the que:<br />\ner \"liberals.\" An introduction<br />\npoorly done, as a matter of fact) tions!discussed are similar to these: ,<br />\nensued, and Mr. Calverton began to \"Dollar Diplomacy,\"\"What Can the<br />\nspeak upon \"What Can the Student Strident D6?\",\"and \"The Nicaragua<br />\nImmediately upon- asking Question.\" I have ,never heard of<br />\nDo<br />\nthis question ( rhetorically, of the Liberal Club discu,sing such<br />\ncourse) he ansrvered it at once by questions as \"Religion Versus Scisaying, \"not much,\" and -this brief ence,- \"Companionate Marriage,\" or<br />\nstatement is the essence of his whole even \"Why We Should Eat Peas<br />\nCalverton spoke for an with a Knife.\" These last .named<br />\nspeech.<br />\n,r:cts are themselves exceedingly<br />\nhour or more, but,-unfortunately, 1171<br />\nbut it would be a welcome resaid nothing. He started his lector;<br />\nto find at least one,of them inin ,America, touched briefly upon<br />\nPoland, Russia; and several other cluded in the Liberal Club programs.<br />\ncountries : he sp,.,ke of the :depths It fs quite possible that I ov.-e zin<br />\nof human ignorance, changed .sod- apology : that the Liberal Club d ,e-<br /><br />\ndenly to idealize the posSibilities of<br />\nliberal clubs, and finally finished, his<br />\nspeech, aving in his wake a profusion of clever Phrases. There is<br />\nno doubt that Mr. Calverton spoke<br />\nvery cleverly; that was obvious to<br />\nanyone who heard him. but whether<br />\nor not he said anything of importance is another question. The climax of the greeting was undoubtedly reached when a young girl got<br />\nup and declared that she thought the<br />\nwhole subject- a 'lot of tonrmyrot.\"<br />\n• Leaving aside the fact that the<br />\nconference itself had no real meaning, it remains. true that the after<br />\neffects have keen extremely interesting: The newspapers, sensing<br />\nthe fact that the Liberal Club has<br />\ngood news value, have served as eN-<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE', MD.<br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nMEDIBEIRS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br /><br />\nJ. A. RITTER &amp; SON<br />\nFlorists and Decorators<br />\nBALTIMORE, MD.<br /><br />\n1918 N. CHARLES ST., Near 20TH.<br />\nPhone, VErnon 0573<br /><br />\nMEET YOUR FRIENDS AT<br /><br />\n\"The<br /><br />\n(ROBIN\" .<br /><br />\nThe \"HOTS'Y TOTSIE\" NIGHT CLUB<br />\nDANCING — DINING — ENTERTAINMENT<br /><br />\nVErnon<br />\n2682<br /><br />\nVINCENT CARA<br />\nand<br />\nHis RECORD BOYS<br />\nFLOSSY MILLER<br />\nManager<br /><br />\nChange of<br />\nProgram<br />\nWeekly<br /><br />\n844 N Howard St.<br /><br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths Since 1857<br /><br />\nDRESS SETS<br /><br />\ndiscuss such que,tions, but if so. I<br /><br />\nfor dinner and evening wear<br /><br />\nhave never heard of them.<br /><br />\nI cannot make a broadside state,<br />\nment that all of the men in the Liberal Club are conservatives, Isecou-e<br />\nI do tot know them all, but if I an:<br />\nto judge by those that I do know.<br /><br />\nBALTIMORE AT CHARLES STREET<br /><br />\nthen the statement ,goes with- or<br />\nqualification.<br /><br />\nson,<br /><br />\nth-CFriember-<br /><br />\nof this club have taken a rather pcculiar<br /><br />\nattitude.<br /><br />\nI hawardIv<br /><br />\nthey<br /><br />\nwear the colors of Liberalism. but<br /><br />\nbeneath! all this they are i-(.riting for<br />\nthe other side, and -have little sympathy with liberal sentiments. It is<br />\ndue partly to this fact, and due partly to the lack (ki initiative of the<br />\nmembers, that the Liberal Chi!) has<br /><br />\ndone<br /><br />\nThe club, on the campus-, is a.<br />\nname, and only a name. The mem'<br />\ncellent. publicity agents, •and have bership is ri,,t known, the \"platform.<br />\nis not known, and its goal —toward<br />\nthe<br />\nupon<br />\nspotlight<br />\nkeen<br />\na<br />\nthrown<br />\nwhich it is 'presumably working—<br />\n_<br />\nlack . of knowledge -and narrowness . lost<br />\nis.<br />\nsomewhere in the fog, and<br />\nof. at least two college deans of the even the members themselves do not<br />\nstate. Immediately after the con- stem to know what they are strivattain. The Liberal Club<br />\nference, Dean Miller, of Western ing<br />\nMaryland College: Dean Jones, of always willing to discus,: a:question.<br />\nWashington College, and Major hut when it is -a mattor of action it<br />\n, Col- bect,ine quie,cent and ruires to a<br />\n:<br />\nGarey, president of St. john'<br />\n1<br />\nlege, were asked whether to- n;:rthey \"discussion.\"<br /><br />\nNo Deposit Required<br />\nof Johns Hopkins University Students<br />\nLight and<br />\nLombard Sts.<br />\nPLaza 6000<br />\n1723-25 N.<br />\nCharles St.<br />\nVErnon 4049<br />\n2402 Pennsylvania Ave.<br />\nLAfayette 2000<br /><br />\nBuicks<br />\nChevrolets<br />\nChryslers<br />\nHupmobiles<br />\nWill's-Knights<br /><br />\nBaltimore Concedes Milestone Supremacy -<br /><br />\n•••••<br /><br />\n3<br />\na<br /><br />\nwould countenance liberal clubs on<br />\nPerhaps I have been unjust in my<br />\ntheir- campuses. Dean .b;nes, of last remark,. Perhap, the Liberal<br />\nWashington College,'said, ''If one Club has a great ilea.1 morc originat<br /><br />\nshould be organized, it woirld.Only ity and initiative than I give it credit<br />\nbe organized.by permission of the for. But if so. this fact should be<br />\nfaculty 'or a committee of the fac- made more evident On °the campus.<br />\nulty. I do not think that we would<br />\ncountenance it.\" The reply of Major Garey, who scents n, be the only HOPKINS STICKMEN<br />\nWIN FROM INDIANS!<br />\nintelligent member of the trio, is diContinued from Page 1, Col. 6<br />\nametrically opposed to this. Nlajor<br />\nCarey replied. \"There .was a club or four serious onslaughts of the<br />\nof the kind here two or three year- Indians on the Jay goal were<br />\nago, but .seems to have died Out. easily checked .by the excellent<br />\nIlowever, I should welcome one playing of the Hopkins close dehere. It would be a good thing to fense. :<br />\nhave a liberal club and a conserva- Hopkins<br />\nRandolph-Macon<br />\ntive club side by side on the campus. Brownley<br />\nAlman<br />\nC<br />\nHere we should like all phases of Hall ,<br />\nWithrow<br />\nSmith<br />\nthought to be discussed.\" But with- F. Cone<br />\nC.P<br />\nout doubt, the most amusing, as well Kegan<br />\nDiaz<br />\nF.D<br />\nas the most amazing, reply was that Caplan<br />\nCompton<br />\nS.D<br />\nof Dean Miller. His remarks show Nickel<br />\nParr<br />\nT.D<br />\na startling lack of knowledge upon Campbell<br />\nCockerill<br />\nC<br />\nMassay<br />\nthe subject, and are all the more sur- Frisch<br />\nT.A<br />\nprising when we consider his rel- Eagan<br />\nWeaver<br />\nS.A<br />\natively high position. Dean Miller Dukehart<br />\nF.A<br />\nTrader<br />\nsaid, \"Dealt Henry G. Doyle, of Guild<br />\nNunnally<br />\nO.H<br />\nGeorge Washington University, has Lyons<br />\nKing<br />\nIH<br />\nproved conclusively by the results<br />\nby<br />\nhalves:<br />\nScore<br />\nof a questionnaire that the repre4 4-8<br />\nHopkins<br />\nsentative college student is not the<br />\n0 1-1<br />\nRandolph-Macon<br />\nman who wears wide trousers, emSubstitutions: Love for Frisch,<br />\nblems, and open shirt fronts.. The<br />\nnumber of such students here would Ness for Caplan, Caplan for Ness,<br />\nnot be over two per cent. We do not Hersperger for Love. Goals—<br />\nconsider that a club of that kind Campbell (2), Guild (2), Caplan,<br />\nwould be needed on our campus be- Eagan, Love, Lyons, Cockerill,<br />\n-6use.we have a small percentage of Referee—George Hoban, DartY*<br />\nof<br />\nelection<br />\nthe<br />\nannouncing<br />\nin<br />\npleasure<br />\nThe NEWS-LETTER takes<br />\nstudents that a club of that kind mouth.<br />\nLebow to the position of Junior Editor.<br /><br />\nSylvan<br /><br />\nINTERIOR WOOD WORK<br /><br />\nDECORATIONS<br /><br />\n\"BEN'.<br /><br />\nESTA<br />\nSTYLES,<br />\nCHARTS S<br />\nSERVICE<br /><br />\nRS1TY<br />\nUTHFUL<br />\nGUISHED<br />\nSTATES.<br /><br />\n•Mmil<br /><br />\nTepeaets<br /><br />\n7.<br /><br />\nBY SPECIAL APPOINTMENT<br />\nOUR STORE IS THE<br /><br />\nhArter Jv ousel<br />\nEAILIIIMCCU<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nDe40Hub<br />\nBaltimore. Cassios and.fayedle<br />\n•=•••<br /><br />\n:\".<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1929<br /><br />\nRENT<br />\ncc<br /><br />\nSNAPPY<br />\nTUXEDOS<br />\nFROM<br /><br />\nSULSKY<br />\n313 W. FRANKLIN STREET<br /><br />\nRita is noncommital.<br />\nDoesn't believe In<br />\nwomen's votes and<br />\nfeels woman's place<br />\nafter all is in the<br />\nhome. \"I don't think<br />\nI ought to make a<br />\nstatement\" she said<br />\nanswering our inquiry \"but maybe I<br />\nshould tell you I always, go with my<br />\nfiance to make sure<br />\nhe selects Braeburn<br />\nUniversity Clothes.\"<br /><br />\nMORE RESOLUTIONS<br />\nTo the Editor of the<br />\nNEws-LETTER.<br />\nDear Sir:<br /><br />\n-- INTERCOLLEGIATE NEWS<br /><br />\nWhereas the Liberal Club unContinued from Page 4, Col. 2<br />\nder, the direction of Honorable<br />\nMr. Teper has drawn up a resolu- The tasks of ,editing, writing and ough bathing\" and then a formal intion<br />\n\"petitioning the governor of publishing a literary magazine have troduction into his study robe.<br />\nCalifornia to free two habitual been successfully accomplished by a So—my dear fellow students in<br />\ncriminals, and,<br />\nfreshman student at the University distress—do not object too strenuWhereas, the Liberal Club of of Missouri. The ambitious young ously to these commencement gown<br />\nthe Johns Hopkins University man takes cah of everything con- fees, since after all our forefathers,<br />\nhas shown themselves to be the nected with the issue, except the<br />\netc., etc., etc.!<br />\nlargest group of socially-inclined<br />\nactual casting of type.<br />\nsuper-fools on the campus,<br />\nAdvertisements are not solicited,<br />\n\"College is not a safe place for a<br />\nTherefore, be it resolved, that<br />\nthe magaiine being entirety dependthe Liberal Club apologize to that<br />\nyoung man. The only 'safe place'<br />\narmy officer whom they deliber- ent upon the contribultons.of appre- for young men, or for old, that I<br />\nately insulted at one of their ciative readers.<br />\nknow of, is the grave. But college<br />\nmeetings, and<br />\n•To really appreciate this young<br />\nis a good place for men to grow.<br />\nBe it further resolved, that the man's work, °nee:oust actually be<br />\nGrowth implies danger, since it<br />\naforementioned Liberal Club connected with a student publication.<br />\nmeans the possibility of growing<br />\nclothe themselves In shame, be- (Note: This is ..not an advertiseworse as well as better.\"<br />\ncause of their many recent dis- ment for Staff candidates.)<br />\nIn view of the fact that Hopkins<br />\ngraceful activities and so disband<br />\nis emerging from its annual banquet<br />\nfor the good of the campus, and<br />\nthe welfare of'the Johns Hopkins<br />\nWhen Stephen. Leacock, well- season, it is fitting to see how some<br />\nUniversity.<br />\nknown humorous writer, recently of the other universities have been<br />\nConservative. told a' University audience that carrying on during their own fesabseils are worn at graduations be- tivities.<br />\ncause they are elt.ea.per than a pair<br />\nThree Lehigh freshmen innocentof pants and a coat, he had really ly drove into Allentown recently<br />\nhit the iou right an tjie head,-as haS and were besieged by a group of<br />\nE. E. ADAMS<br />\nbeen pros-en. Prof. IVacren E. bold sophs. The frosh were greatly<br />\nBarn Cafeteria<br />\nBlake ,of the Greek depc;inient of outnumbered, despite the efforts of<br />\nthe yaiversity-of Michigan, as a re- the father of one of them, and finalsult of his research work on the or- ly had to give in to the evil desires<br />\nPIPES REDUCED<br />\nigin of the cap and gown at college of their persecutors. However, the<br />\n20% off<br />\nBe Wade<br />\ngraduations, has found that they valiant \"pa\" could not bear to see<br />\nAll Others<br />\n10% off<br />\ndate back to the ancient Greek phil- his offspring carried off into the<br />\nosophers who wore them as study night with only an overcoat; accordgowns which would not riddily show ingly, he gave some blankets, which<br />\nthe dirt and were therefore quite he had taken from his car, to the<br />\neconomical. Gradually, student; of kidnapers, asking these to keep his<br />\nPhone HOrnewood,790E<br />\nthcSe So-called philosophical schools' boy warm. But, as the night was<br />\n(Birely's (Pharmacy' adopted this sort of dress and their chilly and the car an open one, the<br />\nimitation at the outset of their \"col- sophs made good use of the blankets<br />\nST. PAUL at 33rd STREET<br />\nlegiate\" days Consisted of a \"thor- themselves.<br />\nTour Neighborhood Drug Store<br /><br />\n$35<br />\n$40<br />\n$45<br />\nClothiers and Haberdashers<br /><br />\nsiitIl tULE11Fc0.<br />\nT7 E. Baltimore St.<br /><br />\nH. FETTING<br />\neMANUFACTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br /><br />\nUnique and beautiful jewels and minor decors,<br />\nmoderately priced.<br />\nCreators and importers of antique jewelry, precious<br />\nand semi-precious stones; and art objects.<br /><br />\nCARL SCHON, INC.<br />\n109 W. Saratoga St.<br /><br />\nAt Your Service 24 Hours a Day<br /><br />\nQ)1fayflower<br /><br />\nCab Co.<br /><br />\nINCORPORATED<br /><br />\n1<br /><br />\n7 18 N. Charles Street<br /><br />\n20c FIRST HALF-MILE<br />\n10c each additional Half-Mile<br />\nor fraction thereof<br />\nThe above rate applies for I to 4 passengers<br /><br />\nCOMPARE!<br />\nVErnon 4090<br /><br />\nStand at Homewood field<br /><br />\nFIDELITY AND DEPOSIT CO.<br />\nof Maryland<br /><br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND<br />\nD. C. HANDY, Manager<br /><br />\nnpoR, FIDELITY<br /><br />\nBLDG.<br />\nPhone PLua 0800<br /><br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br /><br />\n'1301.Ey BANKs&amp;BIDD<br /><br />\nMake OurStore Your Store<br /><br />\nEstablished 1832<br />\nPHILADELPHIA<br /><br />\nYELLOW CAB STANDS<br /><br />\nOfficial Makers of the. Standard<br /><br />\nAT<br /><br />\nHomewood Field<br />\n5th and St. Paul Stieetz<br />\n31st and St. Paul Streets<br />\nSafe and Efficient Service<br />\nPassengers<br />\nNo Charge for, Extia<br /><br />\nGive yourself the<br />\npleasure of smok,<br />\nins a fragrant,<br />\nmellow cigarette<br /><br />\n'PHONE<br /><br />\nVERNON 1212<br /><br />\nJohns Hopkins Ring<br /><br />\nFOR A<br /><br />\nPrices Upon Request<br />\nOrders accepted at the<br />\nPost Office in the College<br />\nPhone, CAL 1380<br /><br />\nYELLOW CAB<br />\nTEACHERS WANTED<br /><br />\nHome—HO. 2091.)<br /><br />\nare planning<br />\nMen and women who<br />\nschools or<br />\nto teach in secondary<br />\nor call. We<br />\ncolleges should write<br />\nHopkins gradumany<br />\nplaced<br />\nhave<br />\nates<br />\nTEACHERS'<br />\nTHE BALTIMORE<br />\nAGENCY<br />\n402-3 Title,Annex Bldg.<br /><br />\nFRANCES T. BANNON<br />\nSuccessor to HARIIAUGH 6? BANNON<br />\n. 2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing _<br />\n• Maryland<br />\nBaltimore<br /><br />\nFRANK BROTHERS<br />\nShop<br />\nKM Avenue Boot<br />\nStrects.NewYOrk<br /><br />\nBetween 47q.' and 48th<br /><br />\nModels for sports<br />\nand formal wear-'distinguished for__<br />\nstyle and quality<br /><br />\nAMEL<br /><br />\nc'T<br /><br />\nAt L. Schaeffer's, 1800 E. Monument<br /><br />\nSt., May 3rd .<br /><br />\nOpen fiorn<br />\n11.30 A. M. to 1.30 A. M.<br /><br />\nCollege Men's<br />\nLuncheon 50 Cents<br /><br />\nRESTAURANT<br />\nNEW CELESTIAL<br />\nAmerican • Chinese<br />\nStreet<br />\n117,119-121 N. Howard<br />\nPhone Calvert 6433<br /><br />\nDancing<br />\nMusic<br /><br />\nTheatre<br />\nParties<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nESSO<br /><br />\nNEW LIFE<br />\nFOR MOTOR<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nValue<br />\nThe Measure of Oil<br />\nSTANDARD OIL<br /><br />\nCOMPANY OF N.<br /><br />\nCIGARETTES<br />\nWHY CAMELS ARE THE BETTER CIGARETTE<br /><br />\nThe Camel blend of choice Turkish and<br />\nDomestic tobaccos has never been equaled.<br />\nThis blend produces a delightfid mildness and<br />\nmellowness.<br />\nCamels are always uniform in quality.<br />\nYou can smoke Camels freely without tiring<br />\nyour taste.<br />\nThey do not leave a cigareto after-taste.<br />\nCamels are a refreshing and satisfying smoke.<br />\n• Tobaccof,.<br />\n5..4<br />\n0.v<br />\n.<br />\n9,0<br />\n.y<br />\n12<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 30, 1929<br /><br />\n4<br /><br />\nBOOKS<br /><br />\nINTERCOLLEGIATg<br />\nNEWS - - '<br /><br />\nBought—Sold—E.changed<br /><br />\nP1PPEN'S BOOK STORE<br />\n605 N. EUTAW STREET<br /><br />\nFreshmen women at the 1:111VT-.<br />\n.1)- of Michigan prefer their men<br />\n\"moustachless.\" In ansiacring a<br />\nquestionnaire circulated by the University this group of women expressed the belief that the men go<br />\nin for moustache raising in order<br />\nto imitate ,the style of certain wellknown moving picture actors. Others expressed the opinion that the<br />\nmoustaches were all right in their<br />\n'place, but are too. often misplaced.'<br /><br />\nC<br /><br />\nollege eMen!<br /><br />\n. ;Truthfully, girls—do moustaehc,;<br />\nreally tickle?<br /><br />\n.PRE-MEDICAL SENIORS<br />\nINTERVIEWED BY DEAN<br />\nR ecently approximately<br />\nt.enty pre-Medical seniors<br />\nBy Bos<br />\nwere interviewed by Dr.<br />\nAmes in reference to their<br />\nThe combined heads of the Low<br />\nadmission to the School of<br />\nfamous Indian 'game have already<br />\nMedicine. In this group was<br />\ndecided so it seems that Dinty<br />\none woman.<br />\nMoore and his fighting Johnnies<br />\nDr. Ames will make recomshall wear the National Intercolmendation to Dr. Chesney, as<br />\nlegiate laurels for 1929. Undoubtassistant Dean of the School of<br />\nedly their victory over Maryland.<br />\nMedicine, who has the power<br />\nby a decisive 5 to'l score on Satof final acceptance of applicaurday could not but be imprestions. No final date was stated<br />\nsive to the gray bearded mentors,<br />\nas to when the senior accepted<br />\nbut just a gentle reminder . . .<br />\nwill be notified.<br />\nin April last year, they It'ad decided without a doubt that Hopkins was out of the running.<br />\nMeet<br /><br />\nON THE<br />\n- CREASE -<br /><br />\nAriation Club to<br />\nThursday at 12.30 P. _IL<br /><br />\nYou do get Better Kodak Pictures<br />\nfrom<br /><br />\n3044 GREENMOUNT AVENUE<br />\nUniversity 3829<br /><br />\nPhotographic Supplies<br /><br />\nPicture Framing<br /><br />\nGard Mallonee, member uf the<br />\nA few months ago, the idea of 1<br />\nIn style and quality -BostoniansStudents, of the Floating Univer- Olympic lacrosse team of 1928, forming an Aviation Club oh the<br />\nequal the most expensive footwear<br />\nL. G. BALFOUR CO.<br />\nsity had for their mid-year exam- member of Laurie Cox's All- Hopkins Campus was born in the .<br />\nproduced today.<br />\nFraternity Pins<br />\nfor the past three<br />\nthe •Phya Thai. Pdacc, American team<br />\nsite,<br />\nination<br />\nSlowly.<br />\nengineers.<br />\nminds of several<br />\nJewelry, Favors, Novelties<br />\n'<br />\nAnd the saving is a big item.<br />\nyears and lust recently member<br />\nRINGS<br />\nHOPKINS<br />\nwircre they stayed as guests of King.<br />\n'organization<br />\nCOMPLETE<br />\nof Benny Boynton's Olympic All- the interest in such an<br />\n1109 Fidelity Bldg.<br />\nRama I'll of Siam for nine days.<br />\nminds<br />\nthe<br />\nin<br />\nitself<br />\nrooted<br />\nand<br />\nis now playing for the grew<br />\nStars,<br />\nPhone CAlvert 1564<br />\nMostly $7 to $10<br />\nOf course, this Rama fellow is Crescents up in Brooklyn. Sat- of other men and, as a. result. an<br />\nardent supporter of the honor sys- urday the Crescents ruined the<br />\nAviation Chili was formed by some<br />\nExclusively in Baltimore<br />\ntem.<br />\nTHE NEW<br />\nof, no defeats. The of the engineers of the Sophomore<br />\nyale record of<br />\nto store one<br />\nCrescents only<br />\n,HOLLYWOOD SHIRT<br />\nBOSTONIAN<br />\nand Junior'Classes. a few weeks ago.<br />\nas is perhaps known goal to win. The Winning team's<br />\ncolumn,<br />\nThis<br />\ncreation! Black,<br />\nHollywood'slaiest<br />\nat<br />\nand<br />\n- SHOE STORE<br />\nIts membership. has grown<br />\n—and peihaps not known—is run defense was working almost to<br />\nembraces approx- I Orange and Biro are the colors.<br />\nit<br />\ntime<br />\npresent<br />\nthe<br />\nreports'.<br />\nto<br />\n•<br />\n112 E. Baltimore Street<br />\nby means of newspaper exchanges perfection, according<br />\nimately eighteen men.,<br />\nCopp<br />\ncMANNIE BERG<br />\nobtained from colleges and unii•er- Evidently Mal is as valuable to<br />\nCo.<br />\nat<br />\none<br />\nlista<br />\nthe<br />\nThe club is similar to<br />\nEach file Half Moons as Eddie Stuart<br />\ncountry.<br />\nthe<br />\nthroughout<br />\nshies<br />\nLapooa<br />\n-The Old Boy Himself'<br />\nI<br />\n119111,1119,111PWIMIIIIIrlrill<br />\nHarvard and the ones at other large<br />\nArt Vora<br />\nweek, the writer of this column— was.<br />\nTypography<br />\n*<br />\nuniversities. The purpose of foundNokTH &amp; 'MARYLAND Ayes.<br />\nEn gra tattp<br />\nhow do—glad to meet you all—sits<br />\nCAJJERT<br />\nEst boo.,<br />\nlittle<br />\na<br />\nacquire<br />\nto<br />\nwas<br />\nclub<br />\nthe<br />\ning<br />\npathese<br />\nof<br />\npile<br />\nhuge<br />\na<br />\nwith<br />\nof<br />\n1.1<br />\nPruitt,<br />\ndown<br />\nRay Finn has become tired<br />\n1602.1603<br />\nfoldg<br />\ncourse.<br />\nOf<br />\naviation.<br />\nof<br />\nknowledge<br />\nto<br />\nproceeds<br />\nand<br />\nhim,<br />\npers before<br />\n1.9 1605 -Os*<br />\nhis old job of net guardian. He is<br />\n&amp;ad,<br />\nP5X<br />\ncarefully scan each one for interest- now playing second attack for until more money is acquired. the THE CHARLES E. MYERS CO.<br />\n«<br />\nf<br />\n— Incorporated<br />\ning data. Needless to say, very the Bethlehem Steel lacrosse club will not invest in any airplanes.<br />\nManufacturer of<br />\n'SERVICE.<br />\namusing things occur in, this ex- team, and, playing it well. The The officers are: Bledso. president:<br />\n(RUBBER STAMPS<br />\nBen<br />\nchange game.<br />\ntop in the Bal- I. Miller, vice-president:<br />\non<br />\nare<br />\nBethlehems<br />\nThe Service Shop<br />\nErie, Pennsylvania<br />\nMeeks, secretary. and Weitzel, treasSept. 25, 1928<br />\n319 W. Redwood St<br />\nRecently a little article (the ma- timore Lacrosse League. The rea- urer.<br />\nProducers of \"The News-Letter\"<br />\nbrothers,<br />\nLAMS &amp; Brother Company<br />\nLang<br />\nthe<br />\nis<br />\nterial for which was obtained front son why<br />\nRichmond, Va.<br />\nwho<br />\nKaufholz,<br />\na well known Pacific Coast Univer- Millard and Bill<br />\nDear Sirs:<br />\nHavingjustreturned from my fishing sity paper) appeared in this column. played lacrosse for Hopkins becamp in northern Ontario, and in the<br />\na periodical fore he became bald and we bereflections upon a fortnight of most Today. looking over<br />\nexcellent weather, wonderful fishing fromNermont—the Cynic by name came freshmen. Although Johnand complete camp comfort, I feel<br />\nny Lang, the elder of the Lang<br />\nthat an appreciation of Edgeworth is —you can imagine our surprise to<br />\ndue, as one of the principal factors of see the self-same article therein with brothers,: was captain of the Allour enjoyment.<br />\nlast year at center, he<br />\nIn past years, I have taken along a our own \"Johns Hopkins NEWS- American<br />\nsupply of various well-known brands LETTER\" affixed below.<br />\nis showing all new inhomes how<br />\nof smoking tobacco, never having bethe game should be played.<br />\ncome fully acquainted with the differThe article in question incidentence in the smoking qualities of the<br />\n-* * *<br />\nthe<br />\nat<br />\n,situation<br />\na<br />\nso-called high-grade tobaccos now aily, deals with<br />\nupon the market, and acting upon a Sorbonne in Paris.'<br />\nfor college larecord<br />\nnew<br />\nA<br />\ntip from an old smoker friend, and as<br />\na matter of convenience in packing,<br />\ncrosse was set Saturday, it is be.<br />\nthis year I took along a dozen tins of<br />\nlieved, although records .are not<br />\nEdgeworth Plug Slice.<br />\nYoshi OtuSka, 30-year-old Jap- obtainable. There were'seventeen<br />\nThere are no places nor conditions<br />\nin existence where the contentment anese Student of thc U. of Oregon,<br />\ngames Played Saturday in which<br />\ndrawn from a briar pipe meets with<br />\nkeener enjoyment or more critical and graduate of If 'asita University college. teams participated.<br />\nanalysis than beside the camp-fire of Tokio, has enrolled in the ,first<br />\na-after a strenuous day in the great<br />\n* *<br />\ngrade of a primary school in Euoutdoors.<br />\nIt is the unanimous opinion of the gene, Oregon. Otuska has g°psi<br />\nlacrosse guide<br />\nThe new<br />\nsmokers among my party that Edgeworth is vi ithout a peer, and that its through twenty years of school which is just out is more a guide.<br />\nsmoothness, fragrance and fine amok- study, and has been awarded inanv<br />\nto 1-fookins lacrosse than to laing qualities are tihsurpassed and unmatched; and I thank you for making scholastic honors, but as he wants crosse in general. It opens with a<br />\nit possible to obtain it.<br />\nto get first-hand information on the frontispiece of the jay lacrosse<br />\nYours truly,<br />\nprimarY educational system of this squad. From there pages \"and<br />\n(Signed) H. N. Curtiss<br />\ncountry he is adopting this propages are devoted to the Olympic<br />\ncidure.<br />\nteam and the National IntercolleA good procedure .for graduato giate Champions, of which we<br />\nExtra High Grade<br />\nwho have been doomed to disap- inure than have our share. Of the<br />\npointment in their Phi Bete aspira- Jay Olympic delegation permit us<br />\ntions!<br />\nto quote two paragraphs:<br />\nThis teas a splendidlacros-A' team,<br />\nContinuril • Page 11, Col.<br />\n1161111.11116111i111611111.W.11611<br />\none that -was truly representative of<br />\nthe ,best the game kno.txs in :the<br />\nUnited States, The work of this<br />\nteam both at home and in Amsterdam 701S a tribute to the type of<br />\nlacrosse played in-the United. States<br />\nWhen the other car shoots<br />\nand particularly to the SchmeisserVan Orman-Hopkins system.<br />\naway out in front, when the<br />\nIt was in versatility and adapat•<br />\nlight turns green--stop wonbility, founded upon a sound ad<br />\nnext<br />\ndering. Make your<br />\nrounded technique and upon bron.:,<br />\nthat the Hopkins twelve repeated'y,<br />\nStop at the AMOCOIn a part -of Africa little known to the rule with telephone men too, as they work<br />\nboth at home and abroad, demonGAS pump.<br />\nwhites, where obscure trails ran, Cecil to greater heights of service. ?But in bestrated its superiority over its opRhodes dared to envision a railroad. He tween, they know, must come periods of<br />\nponents. The team faced every style<br />\nlived to build it.<br />\ncareful planning and smooth coordination<br />\nof attack and defense and every sysThe railroad itself was part of a vaster of many elements.<br />\ntem of lacrosse known to the game<br />\ndream,a dream of a far inland colony linked<br />\nScientific research, manufacturing, plant<br />\nand was never \"stumped.\"<br />\nfast to existing coast settlements by rail construction, commercial development,<br />\nThe players, all college youngsters.<br />\nand wire communication. And he lived<br />\npublic relations, administration—many va(in marked contrast to the veteran<br />\nto build Rhodesia.<br />\nried telephone activities offer a widening opcasts - of the Canadian and Englisn<br />\nFirst the dream, then the reality, is the portunity to practical-minded visionaries.<br />\ntwelves), always were intelligent<br />\nenough to ,change details in their<br />\nstyle to suit the occasion and to<br />\nmake the change with prompt and<br />\ncertain decision. They had a COUnx4 wation-wide sp;ern of inter-tonnet}ing telephones<br />\nter for every opposing threat, no<br />\nmatter what its nature. In this respect, one is justified, it seems, in<br />\naccording the United States twelve<br />\nan unique place in the history of la‘‘OUR PIONEERING WORK HAS JUST BEG -IN\"<br />\ncrosse.<br /><br />\nra,c6f.3T,_m)c,.;)o7A<br />\nt;<br /><br />\nA<br /><br />\n20<br />\n1,<br /><br />\nV<br /><br />\ncrtke<br /><br />\nVacationist<br />\nFinds This<br />\nSmoke O.K.<br /><br />\nstEADTAYLOR<br />\n—<br /><br />\nEdgeworth<br /><br />\nSmoking Tobacco<br /><br />\nStop Wondering<br /><br />\nA vision come true<br /><br />\nBELL SYSTEM<br /><br />"}], "field_media_file": [{"target_id": 38414, "display": null, "description": null, "target_type": "file", "target_uuid": "db5b4757-3c8b-4a53-8c2b-bb6f29acb271", "url": "http://digital.library.jhu.edu/system/files/2022-03/13374-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13374, "target_type": "node", "target_uuid": "27d15206-da4a-45cf-ba90-2b71071469d5", "url": "/node/13374"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "38f1b3df-a49e-42ef-ab99-44835b3f2bfd"}]}