{"mid": [{"value": 36459}], "uuid": [{"value": "19d17b5a-2482-4d64-a51a-ba8ea5d3c136"}], "vid": [{"value": 36459}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:46:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12864-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:46:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:46:32+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "•<br />\n<br />\nEZ<br />\nVOL. XXII, NO. 17.<br />\n<br />\nI<br />\n<br />\nThe College Man and the War<br />\nBy T. W.GREGORY<br />\nAttorney General of the United States.<br />\n<br />\n(From the Patriotic News Service of<br />\nthe National Committee of Patriotic<br />\nSocieties, Washington, D. C.)<br />\n<br />\nIIKS En]<br />\nBALTIMORE, MD., FEBRUARY 18, 1918.<br />\n<br />\nR<br />\n<br />\nPRICE, FIVE CENTS<br />\n<br />\nGREATEST ARMORY MEET EVER<br />\n<br />\nCOMMEMORATION EXERCISES<br />\n<br />\nSERIES OF LECTURES ON WAR<br />\n<br />\nAnnual Hopkins Indoor Games Promise<br />\nto Surpass Any of Past Greatest Track<br />\nMen in the Country Will Compete.<br />\nMilitary Features.<br />\n<br />\nCommemoration Exercises Will Be Held<br />\nat McCoy Hall—Dr.Alonzo E.Taylor<br />\nFood Expert,to Speak—Degrees<br />\nto be Conferred.<br />\n<br />\nArrangements Made for Course of Lectures on \"Aspects of The World War.\"<br />\nDrs. Goodnow, Latane and Willoughby to Speak.<br />\n<br />\nThe fourteenth annual indoor<br />\nHistoric McCoy Hall will once<br />\nThe University announces that<br />\nThe relationship of the college<br />\nman to this war is almost sui games of the Johns Hopkins Uni- more be the scene of a University a series of seven lectures on \"Asversity at the Armory this Satur- function for the forty-second anni- pects of the World War\" will be<br />\ngeneris. It has a great point of day<br />\nnight promises to be the great- versary of the opening of the given on consecutive Wednesdays<br />\nvantage and a great responsi- est indoor meet ever staged<br />\nby Johns Hopkins Univers'ty will be and Fridays beginning with Wedbility.<br />\nthe Black and Blue. More large celebrated there in Friday, Febru- nesday, February 27. This course<br />\nFresh from the study of the colleges with great track reputa- ary 22, at 11 A. M. The address of lectures has been secured<br />\ncourse and the instances of history, tions are going to send big squads will be delivered by Dr. Alonzo through the efforts of Professor<br />\nthe college man should be able to than ever before, and the relay E. Taylor, professor of physiolog- Lovejoy, of the department of<br />\nlook through the words and acts races should even surpass the high ical chemistry at the University philosophy, who is serving as<br />\nwith which men and'nations some- standard set by former Armory of Pennsylvania on \"The Limiting Field Director for the Educational<br />\nmeets. The Penn-Cornell relay is Factors in the Food Supply of a Committee of the Maryland Countimes seek to disguise their real certain<br />\nto be one of the features Nation.\" ..The degree of Bachelor cil of National Defense. Dr. John<br />\nmotives and purposes and to see in of the meet, and the<br />\nCamp Meade- of Arts will be conferred upon H. Latane, professor of American<br />\nall their nakedness the true and Camp Dix race should be excep- three candidates,<br />\nand the degree History, and Dr. Thomas S. Bareal objects at which ambitious tionally fast, with such men as of Doctor of Philosophy<br />\nwill be ker, a Hopkins alumnus and Presdynasties an nations aim. After Howard Berry and Gus Welch conferred upon a like number.<br />\nident of Tome School, are also<br />\nall, the elemental passions of running. Georgia Tech has two<br />\nDr. Taylor is a wildly known members of this committee, which<br />\ngreed and avarice which drove the relay teams entered, against one authority on food problems. He has held public meetings throughPersian to his ruin at Thermopylae of which the Black and Blue quar- one of the Commission appointed out the State and weekly meetings<br />\nare identical with those which tet will be pitted in the S. A. I. A. by the House of Representatives at the Academy of Music, where<br />\nhave influenced dynasties since A. championship race; Penn State to go to Europe and investigate some of the foremost speakers in<br />\nthat time. Taught to detect all will probably oppose the other. thoroughly the food situation America have spoken.<br />\nthese in the actions of men and The Maryland Interscholastic there.<br />\nThe lectures will be given in the<br />\nnations in the past, observant of championship race will be a new<br />\nCivil<br />\nEngineering Lecture Hall at<br />\nImmediately<br />\nbefore<br />\nthe exerthe inexorable rules of cause and feature, with City, Poly, Tome,<br />\nHomewood and will begin at 5 P.<br />\ncises<br />\nthe<br />\nmembers<br />\nseveral<br />\nof<br />\nthe<br />\neffect which have always hereto- Dunham's, and Briarly High branches<br />\nof the University will M. The first lecture will be given<br />\nfore and will always hereafter Schools entered. The Baltimore<br />\nassemble<br />\nat their designated on Wednesday, February 27, by<br />\noperate while man is man,• he Athletic Association and the faplaces.<br />\nThe<br />\nTrustees, the Faculty, Professor Latane, who will speak<br />\nshould have no illusions as to the mous Meadowbrook Club of PhilaAlumni<br />\nthe<br />\nCouncil, and the of- on \"The Tradition of American<br />\ngreat forces which have plunged delphia are among the other teams<br />\nficial<br />\nguests<br />\nwill<br />\nassemble at 10.30 Isolation.\" Professor Latane is<br />\nand are holding the world in their entered in the relays.<br />\no'clock in Levering Hall, corner considered one of the leading auterrible grip. •<br />\nThe list of individual stars enof Eutaw street and Druid Hill thorities in the country on AmerBut this is not all. The college tered in the meet is most impos- avenue. The Alumni will assemble ican history; he has recently writman is fresh from his studies of ing, headed by Sherman Landers, at 10.30 o'clock on the second floor ten a text-book on the subject,<br />\nthe great principles of ethics and of the University of Pennsylvania, of McCoy Hall (north end).<br />\nwhich will soon be ready for pubphilosophy which thus far have who holds the intercollegiate reclication;<br />\nIle delivered the lectures<br />\nThe students will meet at 10.20<br />\non the military policy of the<br />\nguided the world in its march to ord for the pole vault, having o'clock in the<br />\nfollowing places and<br />\nUnited States before the battalion<br />\nward a perfect civilization. As he cleared the bar at 13 feet 1 inch. proceed under direction<br />\nof their<br />\nBerry,<br />\nformer<br />\nHoward<br />\nallthe<br />\nthis<br />\nyear. The next two lectures<br />\nknows the Mainspring of human<br />\nmarshals to the assembly room:<br />\nwill be given by Dr. W. W. Wilgreed and avarice, so is he famil- round Penn star, will be seen<br />\nGraduate students in Arts and loughby, professor-of<br />\niar with the sources of human sporting the colors of Camp Dix,<br />\npolitical sciSciences—Second Floor of McCoy ence, who has<br />\nInWelch,<br />\nwill<br />\nfamous<br />\nas<br />\nGus<br />\nthe<br />\nbeen granted leave<br />\nright, justice and liberty which<br />\nHall (south end).<br />\nof absence to serve with the Instihave preserved and protected man- dian from Carlisle. Brooke BrewStudents of Medicine--Room 12, tute of Government<br />\nformerly<br />\nMaryland<br />\nState,<br />\nof<br />\ner,<br />\n-Research. He<br />\nkind. He should understand and<br />\nMcCoy Hall.<br />\nwill speak on \"The German Therecognize the forces which make will be up from Camp Meade, and<br />\nUndergraduat<br />\ne Students—Third ory of the State\" and<br />\nfor the destruction of these prin- will be entered in the 100-yard floor of<br />\n\"The GerMcCoy Hall. ,<br />\nman System of Government.\"<br />\nciples -however they may be dis: open. Cornell will send down,<br />\nThe procession will enter the<br />\nProfessor Vernon L. Kellogg,<br />\nguised. To him the alleged bene- among others, W. H. Clemenshaw,<br />\nassembly room at<br />\n.10.45 o'clock. A whose articles on' Belgium<br />\nI.<br />\nand<br />\nDiesser,<br />\nJr.,<br />\nC.<br />\ntwo<br />\nher<br />\nof<br />\nficent elements of Prussianism<br />\nin the<br />\npart of the room will be reserved Atlantic<br />\nMonthly attracted such<br />\nare the thinnest veneer over hid- greatest track men, the former for the<br />\nfamilies<br />\nof the Trustees widespread attention,<br />\neous principles destructive of all will be seen in the 100-yard open, and<br />\nwill have<br />\nFaculty until 10.45 o'clock, for his<br />\nsubject \"The Germans in<br />\nthe good that man has during the and the 100-yard hurdles, while after<br />\nwhich time seats will be Belgium and<br />\nthe latter is entered in the mile<br />\nFrance.\" Dr. Wincenturies wrung from the 'hands run<br />\nopen. Georgia Tech will be open to the public.<br />\nford Smith, Superintendent of ,the<br />\nof cruelty and roppression.<br />\nrepresented in the sprints by G.<br />\nA feature of the celebration will Hopkins Hospital, will speak on<br />\nPossessed of this knowledge and E. Strupper and Joe Guyon, two be the conferring of degrees upon<br />\nof the intuition and inspiration of of her famous football stars, while several men who 'have completed \"The Medical Aspects of the War.\"<br />\nyouth which gives to him the right Maxim, world famous 100-yard their work with the mid-year ex- President Goodnow, who was conand the power to see the truth as,it . dash man, will be down with the aminations. R. H. Woodward, stitutional Adviser to the Chinese<br />\nGovernment prior to coming to.<br />\nis, the'College Man has a large Meadowbrook Club squad. Weeks, who has been commissioned<br />\nan the University, will speak on \"The<br />\npart of the responsibility of seeing Hopkins star last year in the mile ensign in the United<br />\nStates War and the Future of the Far<br />\nthat truth prevails. He will do and two mile, who holds the South Navy, Ko-Chi Sun, and L.<br />\nS. Levy, East.\"<br />\nbut half his duty, will meet but Atlantic record in the latter, is will receive the degree of<br />\nBachelor<br />\nThe last lecture will be delivhalf his responsibility, if he mere- entered in the mile, representing of Arts. The degree of<br />\nDoctor of ered by Theodore Marburg, memly offers his own life for his the Hopkins Alumni Association. Philosophy will be<br />\nconferred upon ber of the Board Of Trustees and<br />\ncountry. He must, in addition to , The Hopkins squad entered this P. F. Bloomhardt,<br />\nBroadus Mit- former Minister to Belgium on<br />\nand beyond this, see to it that year is large, and, though on the chel, and C. Vernon<br />\nLynch. Mr. \"Plans for permanent Peace.\" Mr.<br />\nthose of us whose vision has been whole inexperienced, should give Bloomhardt -will take<br />\nup the work Marburg, who was one of the<br />\n(Continued on page 8, col. I)<br />\n<br />\n(Continued on page 9, col. 3)<br />\n<br />\n(Continued on page 8, col. 2)<br />\n<br />\n(Continued on page 10, col. 3)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\nent and are giving evidence of ability, but many of the men initiated<br />\ninto the glorips company of naval<br />\nand -individuality is offered here at prices that are not officers came direct from civil life,<br />\nand cannot be underquoted by any house at any time. and upon their willingness to<br />\nlii Besides, the reputation of an old-established firm is learn, their swiftness and their aptitude we must depend for a large<br />\nback of each sale with a guarantee.<br />\nincrease in the number of those<br />\nwho are to be given command of<br />\nour ships.<br />\nFURNITURE<br />\nThe .;Cavy has given warm welDECORATIONS<br />\nDRAPERIES<br />\ncome to college students and col343 NORTH CHARLES STREET<br />\nlege graduates. I wish I could<br />\npersonally shake handswith each<br />\ncollege man who has entered or<br />\nwill enter the service. I would<br />\nlike to say to each:<br />\nOn First Floor, 322 and 324 N. Howard St.<br />\n\"You will touch here with the<br />\nstimulatin<br />\ng traditions dear to all<br />\nLarge Dining Room on Second Floor<br />\nwho love the ,Navy.<br />\n•<br />\n\"Your country has confidence<br />\nin you. You will justify that confidence in proportion as you master<br />\nATTENTION! J. H. U.STUDENTS:<br />\nthe work which you are entering.<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nIts rewards come only to those of<br />\ngood courage whose minds are<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nwholly given to learning the mysDevices and Card Index Outfits!<br />\nteries of modern fighting craft.<br />\n\"I am empowered officially to<br />\nwelcome the youthful defenders of<br />\nour country. You come as citizens<br />\nPRINTERS<br />\nPUBLISHERS<br />\ncalled to duties of citizenship in<br />\ntime of war. When civil liberty is<br />\nat stake, civilians become warriors. So today the Republic has<br />\ngone to war!<br />\n\"As you may be called into service you will go to the fleet, to the<br />\nThe Big Stationery Store<br />\npatrol, to the transports, to whatever duty you will be assigned<br />\n10-12 N. HOWARD STREET<br />\nBALTIMORE<br />\nwith the feeling that you have<br />\nshown that civilians can do whatever there is need for them to do.<br />\nN. KABIK<br />\n\"You are engaged in a rightThe Navy and the College Man<br />\neous war, and when faith in right<br />\nPARISIAN LADIES' TAILOR<br />\nshall triumph over faith in<br />\nBy HON. JOSEPHUS DANIELS. Secretary of<br />\nPressing,Cleaning and Remodeling of Ladies<br />\nmight, as it surely will, you will<br />\nNavy.<br />\nthe<br />\nand Gents' Garments. New Work a Specialty<br />\n(From the Patriotic News Service share with the veterans of the<br />\nPhone, Homewood 17564<br />\n346 EAST 33rd ST.<br />\nof the National Committee of Patri- Navy the gratitude of a people<br />\notic Societies, Washington, D. C.)<br />\nwho have never looked to their<br />\nANNAPOLIS SHORT LINE<br />\nIt is vital to a powerful navy to Navy in vain.<br />\n\"I do not know what particular<br />\nhave powerful guns and powerful<br />\nships, but they are only so much service you will be called upon to<br />\nwell-fashioned steel unless they do. I can not lift the veil. One<br />\nare manned by officers and men thing I do know, however, and<br />\nwith trained minds and hands, that is that you will be worthy of<br />\nElectric Trains EVERY HALF HOUR<br />\nwith steady nerves and heads. We the noble work into which you enBetween<br />\nhave today in the Navy all the men ter. May the All-Wise Providence<br />\nBALTIMORE (Camden Station)<br />\nwe need until ships under con- give you of His strength to bear<br />\nand ANNAPOLIS<br />\nstruction and repair are furnished the world to an early peace—a<br />\nShortest, Quickest and Most Direct Route<br />\nand put in commission. The great- peace that shall insure justice<br />\nright alike to all peoples and<br />\nANNAPOLIS SHORT LINE est need, therefore, is for officers and<br />\nwho know how to sail a ship, how all nations.\"<br />\nto man its guns; how to organize<br />\nYe Peggy Stewart Tea Room it to fight.<br />\nMay He Rest in Pieces.<br />\n17 West Saratoga Street<br />\nThe Navy's reliance upon the There was a man who fancied<br />\nThat by driving good and fast<br />\nNaval Academy for educated and<br />\nLUNCHEON<br />\nAFTERNOON TEA<br />\nget his car across the track<br />\ncapable officers in peace times is He'd<br />\nPOTATO ROLLS<br />\nCAKES<br />\nBefore the train got<br />\nSANDWICHES<br />\nwell placed. Since the war began He'd miss the engine bypast;<br />\nan inch<br />\nPrivate Luncheons and Afternoon Teas<br />\nthis fine institution, unsurpassed<br />\nAnd make the train hands sore.<br />\nin the world, has been doubled, There was a man who fancied this—<br />\nPhone Connections<br />\nThere isn't any more.<br />\nbut today its facilities are inad—Lampoon.<br />\nJAMES W. HUGHES equate to graduate officers<br />\nas rapidly as they are needed.<br />\nCATERER<br />\nHubby—Hang it! One of my cyBut all the normal sources of linders is missing.<br />\n12 EAST CENTRE STREET<br />\nofficers combined did not serve to<br />\nWifey—That's just like you, AlBanquets. Receptions<br />\nWith Every<br />\ngive as many as the expanding fred.<br />\nand Dinners<br />\nRequisite<br />\nYou're always mislaying<br />\nNavy needed, and we turned with things.<br />\nconfidence to the civilians with<br />\nlove of the sea and some knowl\"The Germans say they give<br />\nedge of seamanship to qualify their prisoners two square meals<br />\nthemselves for command. Before a day!\"<br />\nwar was declared there were some<br />\n\"Yes, two bouillon cubes.\"—<br />\n106-108 CLAY ST.<br />\nreserve officers who had shown tal- Lampoon.<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJohn C. Knipp & Sons<br />\n<br />\nLUNCH AND DINING ROOMS<br />\n<br />\nMEWALTIEIMER<br />\n<br />\nBOOK = BINDING<br />\nJoseph Ruzicka<br />\n<br />\nJohns Hopkins Press<br />\nf<br />\n<br />\n•<br />\nI.—American Journal of Mathematics.<br />\nEdited by FRANK MORLEY, with<br />\nthe co-operation of A. COHEN, CHARLOTTE A. SCOTT and other mathema.tiaans.- Quarterly. 4to. Voltime<br />\nXL in progress. $6 per volume. (Foreign postage 50 cts.)<br />\nIL—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER, , Editors.<br />\nQuarterly.<br />\n8vo. Volume XXXIX in progress. $3<br />\nper _volume. (Foreign postage 30<br />\ncts.)<br />\n111.—Johns Hopkins University Studies in<br />\nHistorical and Political ScienCe.<br />\nUnder the direction of the -Departments of History, Political Economy<br />\nand Political Science. Monthly, 8vo.<br />\nVolume XXXVI in progress. $3.50<br />\nper volume.<br />\nIV.—Johns Hopkins University Circular.<br />\nIncluding the President's Report,<br />\nAnnual Register and Medical Department catalogue. T. R. Ball, Editor.<br />\nMonthly. 8vo. Volume XXXVII in<br />\nprogress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXIX in<br />\nprogress. $3 per year. (Foreign postage 50 cts.) •<br />\nVI.—Johns Hopkins University Studies<br />\nin Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nVII.—Johns Hopkins Hospital Reports.<br />\n8vo. Volume XVIII in progress. $5<br />\nper volume. (Foreign postage 50 cts.)<br />\nVIII.—Contributions to Assyriology and<br />\nSemitic Philology.<br />\n(Beitrage zur Assyriologie, etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITZSCH, Editors. Volume X in<br />\nprogress.<br />\nIX.— Memoirs from the Biological Laboratory.<br />\nFive volumes have been issued.<br />\n<br />\nX.—Modern Language Notes.<br />\nJ. W. BRIGHT, Editor-in-Chief; M.<br />\nP. BRUSH, W. KURRELMEYER, G.<br />\nGRUENBAUM and J. E. SHAW.<br />\nEight times yearly. 8vo. Volume<br />\nXXXIII in progress. $3 per volume.<br />\n(Foreign postage 50 cts.)<br />\nXL—American Journal of Insanity.<br />\nH. M. HURD, E. N. BRUSH, G. A.<br />\nBLUMER, J. M. MOSHER and C. K.<br />\nCLARKE, Editors. Quarterly. 8vo.<br />\nVolume LXXIV in progress. $5 per<br />\nvolume. (Foreign postage, 50 cts.)<br />\nXIL—Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume XXIII in progress. $3<br />\nper volume. (Foreign postage 25 cts.)<br />\nXIII.—Reprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. Fourth<br />\nseries in progress. $2.<br />\nX1V.—Hesperia.<br />\nHERMANN C0LLI TZ, HENRY<br />\nWOOD and JAMES W. BRIGHT, Editors. 8vo. Eleven numbers have ap-<br />\n<br />\npeared.<br />\n<br />\nXV.—Elliott Monograph in the Romanc•<br />\nLanguages and Literatures.<br />\nE. C. ARMSTRONG, Editor. 8v0.<br />\n$3 per year. Three numbers have appeared.<br />\n<br />\nXVI. Reports of the Maryland Geological Survey.<br />\nEdited by W. R. CLARK.<br />\nA full list of publications will be sent<br />\non application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n<br />\nThe Medical Standard Book_Co.<br />\n307 N. CHARLES ST.<br />\n<br />\nCollege Text Books<br />\nAT NET PRICES<br />\n<br />\nJ. H.SAUMENIG & CO.<br />\nEngravers<br />\nStationers<br />\nBlank Book Makers•<br />\n229 Park Avenue - Baltimore<br />\n<br />\nAdams Drug Company<br />\nCIGARS, SODA<br />\nAND CANDY<br />\nHoward and Monument Streets<br />\n<br />\nLEMMERT<br />\n—a synonym for<br />\nGood Clothes<br />\nOver a quarter century<br />\nof leadership in making<br />\nMen's Outer Garments<br />\n<br />\nPLAZA BLDG.,19 E. FAYETTE ST.<br />\nThe Oldest Musical Instrument House in the United States<br />\nEstablished 1811<br />\n<br />\nH. R. Eisenbrandt Sons<br />\nIncorporated<br />\n<br />\n\"All Things Musical\"<br />\n<br />\n1<br />\n<br />\n1 The College Athlete and the War 11<br />\nBy WALTER CAMP<br />\n<br />\n(From the Patriotic News Service of<br />\nthe National Committee of Patriotic<br />\nSocieties, Washington, D. C.)<br />\n<br />\nIt is with a feeling of great<br />\nsatisfaction with those of us who<br />\nhave ever contended that the sport<br />\nof football was one which bred<br />\nreal men, that we find in this time<br />\nof emergency of the country our<br />\ngridiron heroes, practically en<br />\nmasse, have gone to the colors.<br />\nLast year's Yale and Harvard<br />\nteams which played at the Yale<br />\nBowl before some 80,000 spectators, are now divided in the service as follows:<br />\nYALE.<br />\nMoseley, left end, Lafayette Escadrille, France.<br />\nChurch, right end, Sergeant, Aviation Section, A. E. F., France.<br />\nGates, left tackle, Aviation Section,<br />\nU. S. N. R. F.<br />\nBlack, left guard, U. S. N. R. F.,<br />\nNewport, R. I.<br />\nCallahan, center, U. S. N. R. F., Newport, R. I.<br />\nFox, right guard, Second Lieutenant,<br />\nU. S. R. Field Artillery.<br />\nBaldridge, right tackle, Captain, V.<br />\nS. R. Field Artillery.<br />\nComerford, right end, American Ambulance Corps, France.<br />\nLaroche, quarterback, American Ambulance Corps, France.<br />\nNeville, left halfback, Second Lieutenant, U. S. R. Field Artillery.<br />\nLeGore, right halfback, Lieutenant,<br />\nU. S. Marine Corps, France.<br />\nJacques, fullback, Officer in Ordnance Corps.<br />\n<br />\nthere in the blue uniform and<br />\nwearing it with the same spirit<br />\nSeniors!<br />\nFraternities!<br />\nthat they formerly wore the jersey<br />\nClasses and Teams!<br />\nor the canvas jacket, are our players not albne of last year but of<br />\nNOTICE<br />\nthe earlier periods.<br />\nBetween January 20 and February<br />\nWe are once more proving that .20 all pictures that are to go in the<br />\nthe lights of song and story in the<br />\n1918 Hullabaloo must be taken.<br />\npresent generation, even as in that<br />\nPRICES:<br />\nof the olden times, shone most<br />\n1. Individuals<br />\n$2.00<br />\n2. Groups<br />\nbrightly over brave men. \"And<br />\n5.00<br />\nbrighter lights shone o'er fair woArrange for sittings today with Jeff<br />\nMiller, Business Manager.<br />\nmen and brave men.\" And there<br />\nseems.to be a reason for it. A social scientist, 40 years ago, said<br />\nthat the greatest nation of the<br />\nfuture would be the one that could<br />\nsend the most men to the top of<br />\nthe Matterhorn. He was assailed<br />\nby many with questioning as to<br />\nwhat he meant and whether he<br />\nplaced physical qualities and<br />\nstrength and the physique above<br />\nthe artistic and literary. But<br />\nthe events of the last four<br />\n211-213 E. Baltimore Street<br />\nyears have been showing more<br />\nBaltimore, Md.<br />\nand more clearly what he had<br />\nin mand, and what qualities<br />\na nation must possess, even in this<br />\ntwentieth century itself, in order<br />\nto even live. Perhaps the millenium will some time come, but it Is<br />\nmanifest that today bravery and<br />\n300 N. Howard Street<br />\nphysical qualities are essential to<br />\nBALTIMORE, MD.<br />\nthe very life and existence of any<br />\nnation. This'is the reason why we<br />\nSurgical Instruments,<br />\nmust make our men—:all of them—<br />\nmore fit and enduring, more able Hospital, Invalid and Microscopic<br />\nto withstand hardships. Our colSupplies,<br />\nlege athlete is the fighting type,<br />\nOrthopedic Appliances.<br />\nHis spirit, his arms, his legs are<br />\ngood. The only point where we<br />\nhave in a measure failed is in his<br />\nset-up, the deepening of his chest,<br />\nand the better development of his<br />\nPrescription Opticians<br />\ntrunk for suppleness, action and<br />\n405 CHARLES STREET, NORTH<br />\nresistive force. That is a point we<br />\nare remodeling today and the athBALTIMORE<br />\nlete of the future will be more the<br />\nall-around man and the average<br />\nman in college will have more of<br />\nthe possibilities of the athlete.<br />\n<br />\nWEAR<br />\n<br />\nThe Chas. Willms<br />\nSurgical Instrument Co.<br />\n<br />\nHARVARD.<br />\nHarte, right end, Captain, U. S. R.<br />\nHeavy Artillery.<br />\nVICTROLAS<br />\nRECORDS<br />\nPhinney, right end, Ensign, U. S. N.<br />\nBAND INSTRUMENTS<br />\nR. F., Annapolis.<br />\nBatchelder, right end, Ensign, U. S.<br />\nTEL. MT. VERNON 3898<br />\nNavy.<br />\nCaner, right tackle, Ambulance,<br />\nService, France.<br />\nSweetser, right tackle, Ensign<br />\nSchool, Harvard.<br />\nAthletic and Sport Goods<br />\nSnow, right guard, Ensign School,<br />\nHarvard.<br />\nHonor Roll of Military Examination.<br />\nHarris, center, Captain, U. S. R.,<br />\nCamp Devens.<br />\nFor the information of the bat... very<br />\nWiggin, center, Lieutenant, U. S. R., talion,<br />\nBaltimore<br />\nWashington<br />\nthe following list of the 10<br />\nCamp Devens.<br />\nDadmun, left guard, A. F. Corps, best papers on the recent examina• • • best<br />\ntion in military science and tacFrance.<br />\nWheeler, left tackle, Ensign, U. S. tics is posted and published:<br />\nNavy.<br />\nFrank A. Ruth<br />\n1. Stearns, J. L., Co. A<br />\n97*<br />\nCoolidge, left end, Captain, Infantry,<br />\nSPORTING GOODS MANAGER<br />\n2. Bitter, K. 0., Co. B<br />\n96*<br />\nDevens.<br />\nU. S. R., Camp<br />\n3. Lewin, J. H., Co. B<br />\n304 W. Baltimore Street<br />\n93<br />\nRobinson, quarterback, Lieutenant,<br />\n4. Coleman, A. B., Co. B<br />\n92<br />\nU. S. R., Camp Devens.<br />\n5. Cattanach, G. S., Co. A<br />\n91<br />\nMurray, quarterback, U. S. Naval<br />\n6. Shaw, H. B., Co C<br />\n91<br />\nMaryland's Most Reserves.<br />\n7. Winslow, 0. P., Co. C<br />\n90<br />\nquarterback<br />\nSchool,<br />\nFelton,<br />\nEnsign<br />\n,<br />\nFamous Dishes<br />\n8. Cook, W. D., Co. A<br />\n90<br />\nHarvard. 4<br />\n9. Bloom, W., Co B<br />\n90<br />\nHorween, right halfback, Ensign, U. 10. Sollers, B. F., Co. C<br />\nCalvert and Thirtieth Sts.<br />\n90<br />\nS. Navy.<br />\nTerrapin, SmithFlower, right halfback, Naval Re*Honor grade.<br />\nAllows J. H. U.students special discounts<br />\nserves Aviation Corps.<br />\nfield Ham and<br />\nWillcox,<br />\nhalfback,<br />\nright<br />\nEnsign,<br />\nGame<br />\nNaval Reserves Aviation Corps.<br />\n13 SOUTH STREET<br />\nThacher, left halfback, U. S. R.,<br />\nCamp Devens.<br />\nCapital, $600,000<br />\nCasey, fullback, U. S. Naval ReSurplus and Profits, $2,641,000<br />\nserves.<br />\nPHONE<br />\nActs as Trustee of Corporation Mortgages. Fiscal Agent<br />\nMinot, fullback, Lieutenant, U. S.<br />\n2028 Druid Hill Ave.<br />\nMADISON 3420<br />\nfor Corporations and<br />\nIndividuals, Transfer Agent and Registrar. Depository<br />\nR., Camp Devens.<br />\nunder plans of<br />\nActs as Executor, Administrator, Guardian, Trustee, Receiver, reorganization.<br />\n<br />\n306-308<br />\n<br />\nN. Howard Street<br />\n<br />\nHoward A.French & Co.<br />\n<br />\nBOWEN & KING<br />\n<br />\nWAGNER'S<br />\n<br />\nCANNED FOODS<br />\n<br />\nBACON DRUG STORE<br />\n<br />\nJENKINS<br />\n<br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\nHopkins Seals in Silver and<br />\nGold, 75c. to $5.00.<br />\nCollege Jewelry a Specially<br />\n<br />\n28 E. BALTIMORE STRFF7<br />\n<br />\nSale Deposit and Crust<br />\nCompany of Baltimor<br />\n<br />\nAttorney and<br />\nAnd this is equally true of the Agent, being especially organized for<br />\ncareful management and settlement of estates<br />\nother colleges and universities of every character.<br />\nOne-story fireproof building, with latest and best equipment for safety of<br />\nthroughout the broad land. The<br />\nwriter has had an oportunity, ow- contents.<br />\nSafes for rent in its large fire and burglar proof vaults, with spacious and welling to his government work at the lighted coupon'rooms<br />\nfor use of patrons.<br />\nNaval Stations, to see that<br />\nSecurities held on deposit for Out-of-Town Corporations and persons.<br />\nwherever there is a naval station • H. WALTERS, Gann of<br />\nBoard.<br />\nJOHN J. NEUMAN, Pros.<br />\nJOHN W. MARSHALL, Vics•Prss.<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n<br />\nwants to miss a race or an event<br />\nthat these boys enter.<br />\nMoreover, there will be an agFOUNDED. 1897<br />\ngregation of national -stars at the<br />\nSubscription<br />\n$2.00 games that may be labelled \"The<br />\nbest in the land.\" There will be a<br />\nEntered as second-class matter LiePenn-Corne<br />\nll relay race, that<br />\ncember 3, 1909, at the Post Office at<br />\nBaltimore, Md., under Act of Congress, promises to rival the annual<br />\ngridNovember 3, 1879.<br />\niron classic on Franklin Field.<br />\nPublished weekly, from October to There will be a Camp Meade-Camp<br />\nJune, by the students of the Johns<br />\nDix relay. There will be interHopkins University.<br />\ncompany relays and contest. There<br />\nBusiness communications should be will be a bayonet<br />\ndrill. There will<br />\naddressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all arti- be present some of the highest<br />\ncies and other communications should be army officers.<br />\nYou can't' possibly'<br />\nsent to the EDITOR-IN-CHIEF.<br />\nafford to miss this—your own<br />\nHomewood 100 Hopkins games!<br />\nTelephones<br />\n<br />\nNIS-Wier<br />\n<br />\nEditor-in-Chief:<br />\nMorton K. Rothschild, '18.<br />\n<br />\n5.<br />\n<br />\nBoy Scouts or Drafted Men?<br />\n<br />\nit is a far cry back to the Liberty<br />\nBusiness Manager:<br />\n•Loan Parade of last fall, but there<br />\nWilliam M. Gardner, '20.<br />\nare certainly two hundred and<br />\nfifty men around Homewood who<br />\nAssistant Business Managers:<br />\nGeorge w.'Wagner, '20.<br />\nare still periodically shaken<br />\nHenry H. Morriss, '20.<br />\nwith the unspeakable nightmare,<br />\n`,`Aren't they cute little boy<br />\nAssociate Editors::<br />\nscouts?\" or.\"Oh, the lovely draftRichard H. Woodward, Jr., '18.<br />\nRoszel C. Thomsen, '19.<br />\ned men!\" or, worse still, \"Do<br />\nRichard L. Field, '19. _<br />\n'way, they're the Poly (City) caCarroll Stansbury, '20.<br />\ndets.\" The sting of those remarks<br />\nVernon E. Stuart, '20.<br />\nsmarts even today. The newly creAylett B. Coleman, Jr., '20.<br />\nLeo W. Simon, '20.<br />\nated Battalion Activities Board<br />\ncan do no greater service and offer no more convincing proof of<br />\nBALTIMORE, MD., FEB. 18, 1918.<br />\nits value to the Battalion than to<br />\nprocure a Hopkins standard, behind which the Hopkins men can<br />\nThe Hopkins Armory Games.<br />\nThis is a Red -Letter Week on marcli in the next parade or review with clear consciences and<br />\nthe University calendar, the cele- real pride.<br />\nbration of the founding of the University on Friday and the staging<br />\nUNIVERSITY DIRECTORY<br />\nof the annual Hopkins* games on<br />\nSaturday, two of the biggest<br />\nAthletic Association<br />\nevents of the' 'college year, are<br />\nAlexander M. Wolfe<br />\nPresident<br />\ncrowded into a single week-end. H. E. Corner<br />\nGraduate Mgr.<br />\nIf the undergraduate must be solTrack Team<br />\nemn and'serious and, dignified on Monroe Firor<br />\nCaptain<br />\nManager<br />\nFriday he may be himself once V. J. Wyckoff<br />\nJ. H. U. Battalion<br />\nmore on Saturday. The interest<br />\nT. L. Chisholm<br />\nMajor<br />\nand pride of every student in the H. H. Startzman<br />\nAdjutant<br />\nUniversity, which may have been<br />\nEngineering Society<br />\nlulled into indifference on account 0. P. Winslow<br />\nPresident<br />\nJ. S. Jammer<br />\nSecretary<br />\ncramming<br />\nof the<br />\nand excitement<br />\nStudent Council<br />\nof examinations and the ittercolEd. B. Jarrett<br />\nPresident<br />\nlegiate inactivity of the winter A. L. Hamburger<br />\nSecretary<br />\nmonths, should be kiiidled anew<br />\nY. M. C. A.<br />\nPresident<br />\nin the anticipation of one of the Chas. T. Leber<br />\ngreatestathletic events of the year. William L. Merriken.... ('or. Secretary<br />\nOmicron Delta Kappa.<br />\nAll of the energy and enthusiasm<br />\nAlexander M. Wolfe<br />\nPresident<br />\nthat has accumulated since the Carl W. Schmidt<br />\nSec'y- Treas.<br />\ndust of that memorable battle<br />\nMusical Clubs<br />\nPresident<br />\nWith State cleared away Will E. Burke<br />\nCoulter<br />\nDirector<br />\nbreak forth in the Fifth Regiment D.<br />\nW. J. H. B. Wells<br />\nTreasurer<br />\nManager<br />\nArtnory on *Saturday night, Hop- L. B. Kellum<br />\nDebating Council<br />\nkins track teams of past years<br />\n.K. Rothschild<br />\nPresident<br />\nhave •made history on that floor, Morton<br />\nC. H. Miegel<br />\nSecretary<br />\nthe men of this year's team, deLacrosse Team<br />\nspite their limited _experience and Ale M. Wolfe<br />\nCaptain<br />\nManager<br />\ndepleted ranks, have demonstrated Roszel Thomsen<br />\nBaseball Team<br />\nin the spirit of their practices<br />\nManager<br />\nthat they are going to prove Douglas Coulter<br />\nMenorah Society<br />\nworthy of their predecessor:<br />\ns Lester Levy<br />\nPresident<br />\nThere is not a Hopkins man who Leo W. Simon<br />\nSecretary<br />\n<br />\nTWO NEW COURSES ANNOUNCED<br />\nOne Leading to B. S. in Chemistry<br />\nOther, Leading to Admission to New<br />\nSchool of Hygiene'—Will Attract New Students.<br />\n<br />\nThe Board of Trustees of the<br />\nJohns Hopkins University have<br />\nannounced two important new<br />\ncourses, which have been established on account of the new school of<br />\nHygiene and Public Health and on<br />\naccount of the demand for industrial chemistry. One course given<br />\nin the College of Arts and Sciences, leads to admission to the<br />\nnew School of Hygiene. The other<br />\ncourse leads to the degree of Bachelor of Science in Chemistry.<br />\nOwing to conditions growing<br />\nout of the war and in response to<br />\na demand from the agricultural<br />\nindustries of the country, it was<br />\nfelt that additional opportunities<br />\nshould be offered to the young<br />\nmen of the State to obtain training in advance chemical work<br />\nduring the college course. The<br />\nnew course is under the direction of the School of Engineering<br />\nand identical with the prescribed<br />\nengineering course for the first<br />\ntwo years. In the third year chemistry is substituted for two of the<br />\nengineering subjects, and in the<br />\nlast year, practically all of the<br />\nstudent's..time is devoted to special work in the chemical laboratory. It is hoped that students in<br />\nthis course will be better prepared<br />\nto carry on advanced work in all<br />\nlines of industrial chemistry than<br />\nstudents who have followed the<br />\nso-called courses in chemical-engineering, given by a number of<br />\ninstitutions throughout the country. Students who enter the new<br />\ncourse will be eligible to the State<br />\nscholarships awarded in, the Engineering School.<br />\nA student, who completes the<br />\ncourse, with two units of Latin<br />\n(which may be offered for matriculation) and with the equivalent<br />\nof Biology I (as certified by our<br />\ndepartment of biology).will be accepted for admission to the Medical School.<br />\nAn outline of the courses follows:<br />\nI.<br />\n<br />\nIN MEMORY OF DR. MALL<br />\n(Remarks of President Goodnow,who<br />\npresided at the commemoration exercises for Dr. Mall on Sunday, February<br />\n3, at C. E. Hall.)<br />\n<br />\nWe are assembled here today to<br />\nhonor the memory of our lamented colleague and friend Dr. Mall. Dr. Mall had been up to the<br />\ntime of his death continuously and<br />\nuninterruptedly associated with<br />\nthe Medical School from the time<br />\nof its opening. He was one of the<br />\ngroup who a quarter of a century<br />\nago inaugurated a new venture in<br />\nmedical instruction in this country. The purposes which were<br />\nthen outlined, the ideas which<br />\nwere then entertained, the methods which were then adopted had<br />\nsubsequently a widespread influence throughout the land. It is<br />\nsomewhat -difficult for us, separated as we are by so long a period from the original time of<br />\ntheir formulation and accustomed<br />\nas we are to the changes which<br />\nthey caused, to appreciate how<br />\nnovel and how important was the<br />\nwork then undertaken.<br />\nFor the success attendant upon<br />\nthe Medical School Dr. Mall was<br />\nin no small measure responsible.<br />\nA brilliant and tireless investigator he made invaluable contributions to the science to which he<br />\ndevoted himself and won prestige<br />\nfor the institution with which he<br />\nwas connected. A wise and sane<br />\ncounselor he exercised a potent<br />\nand salutary influence over the<br />\npolicy of the medical faculty. A<br />\nkindly and courteous gentleman<br />\nhe greatly endeared himself to his<br />\ncolleagues and associates.<br />\nPassing away in the prime of<br />\nlife and at the height of his powers he leaves in the world of science a gap which it will be difficult to fill and among his friends<br />\na sense of loss which it is impossible to overcome.<br />\nWe have, however the satisfaction of knowing that<br />\n' the University of which he was a member<br />\nis better and finer for what he was<br />\nand did. His life and work will<br />\nlong continue to be an inspiration to the colleagues he has left<br />\nbehind and to the students whom<br />\nhe taught.<br />\n<br />\nCOURSE LEADING TO THE DEGREE OF BACHELOR OF SCIENCE IN CHEMISTRY,<br />\nAdmission—As for the Engineering<br />\nA Correction.<br />\nSchool: Two years of Latin except<br />\nIn the last issue of 'PILE NEWSfor a combination of physics and<br />\nmanual training which can be offered LETTER the stateinent was incoronly by students of the Baltimore<br />\n_HolPolytechnic Institute and the Mc- rectly made that Howard<br />\nKinley High School of Washington, land, who is now at the officers'<br />\nD. C.<br />\ntraining camp at Camp Meade„<br />\nFirst Year—As for Engineering School: was never a student<br />\nat the UniverEnglish Composition 1.<br />\nsity. Mr. Ball, Registrar of the<br />\nMathematics 1.<br />\nUniversity, informs us that HolPhysics 1.<br />\nFrench or German Elements(Spanish land *as an attendant on the college courses for teachers. The<br />\nmay be substituted for French),<br />\nhonors which Holland has won in<br />\nDrawing.<br />\nPhysical or Military Training.<br />\nthe short time he has been .at<br />\nSecond Year—As in Engineering eainp are all the more significaht.<br />\nSchool:<br />\nWe are proud and happy to claim<br />\nEnglish Literature 4.<br />\nhim asa member, as well as an of(Continued on page5, col. 3)<br />\n- flcial of the University.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n<br />\n1<br />\n<br />\n1 NEWS FROM MEN IN SERVICE II<br />\n<br />\nTHE NEWS-LETTER wants to devote<br />\nthis page to news of Hopkins men in<br />\nthe service. It is impossible for the<br />\neditors to keep in touch with every<br />\nman in the service; the co-operation of<br />\nthe families and friends of Hopkins<br />\nmen with the colors is earnestly<br />\nsought. THE NEWS-LETTER will be glad<br />\nto publish letters, photographs and general news of men in the service, which<br />\nwill The returned upon request. Address TILE NEWS-LETTER, Box 232, Johns<br />\nHopkins University.<br />\nAlex. Barton Writes From France.<br />\n[Alexander K. Barton, from whom<br />\nthe following letter comes, was a prominent member of the Class of 1914. He<br />\nwas elected Rhode Scholar in the year<br />\nhe graduated, but had to forego the<br />\nprivileges of the honor on account of<br />\nthe war. He was also editor of THE<br />\nNEWS-LETTER during the year 19131914. THE NEWS-LEAThR is indebted<br />\nto Dean Brush for the privilege of<br />\npublishing this intensely interesting<br />\naccount]<br />\n<br />\nJanuary 25, 1918.<br />\n149th F. A., A. E. F., France<br />\nDEAR MR. BRUSH—<br />\nI have been intending to write<br />\nfor some time, but have been putting it off. Would that I had not<br />\nbeen so delinquent and had pursued Fraser and Squair more ardently! A lot of charming French<br />\nladies hold a Red Cross (French)<br />\nBazar at camp and how I curse<br />\nmy inability to \"parler\" with fluency. We entertain them at our<br />\nofficers mess, and after having<br />\nskillfully maneuvered so that<br />\nMlle. la plus belle et plus charmante sits at my table, a sous-lieutenant comes along and does<br />\nnearly all the talking. Tell any of<br />\nyour students to put the classics<br />\naside, not to say the sciences, and<br />\nto learn French. I have met some<br />\ncharming people. They are most<br />\nhospitable. Had a good game of<br />\ntennis the Sunday before Christmas with some French girls at a<br />\ntown in Brittany. It was funny<br />\nto sap \"pret?\" and \"guaranteeing.\" Being with Americans so<br />\nmuch and having no chance to<br />\nstudy, it is hard to make much<br />\nprogress, but what French I did<br />\nknow has come back in a remarkable way, and I have picked up a<br />\nlot. It has been a tremendous<br />\npleasure to be able to talk to<br />\nFrench officers and to the country<br />\npeople. When I cannot understand the spoken word I get them<br />\nto write it down. I had quite<br />\nan extensive conversation with a<br />\nFrench lieutenant en route from<br />\nParis to this place (the First<br />\nCorps School). I have written<br />\nquite a few French letters. My<br />\nknowledge of French has been a<br />\ngreat help in a military way—so<br />\nmany directions in regard to the<br />\nsoixante-quinze and to signalling<br />\napparatus are not yet translated.<br />\nI have seen quite a few interesting places—one old town near the<br />\nlast camp. The castle walls are<br />\nstill intact, a deep moat in front<br />\nof them and in the town a church<br />\nwith beautiful stone carvings and<br />\nstained glass windows, built by<br />\nthe English when they held that<br />\n<br />\npart of France. I had two great<br />\ndays in Paris. I translated what<br />\nour French guide had to say in<br />\nthe Palais de Justice to a party<br />\nof officers. It is remarkable how<br />\npractice helps your French. I<br />\nsaw Leslie Buckler in Paris. He<br />\ntook me to supper at a club for allied officers, which occupies the<br />\nhandsome house of Baron Rothschild.<br />\nI should think THE NEWS-LETTER or ALUMNI MAGAZINE Would<br />\nbe interested in hearing of the<br />\nJohns Hopkins University men in<br />\nour first four thousand. There are<br />\nquite a few in the First Division.<br />\nLieut.-Col. John Crane (who came<br />\nto see me one night, but whom I<br />\nmissed). Maj. Redmond Stewart,<br />\nActing Judge Advocate of the First<br />\nDivision,Whom I see frequently, as<br />\nhe is located here. Gillie, whom I<br />\njust ran into tonight here at the Y.<br />\nM. C. A., and Jim Manning. Hunting, a Phi Gama about '07, is here.<br />\nJack Branham is at the Infantry<br />\nSchool here,I just learned tonight,<br />\nand shall look him up tomorrow.<br />\nBesides the Hopkins Unit (which<br />\nis nearby), there will be many of<br />\nus in the First Corps.<br />\nI am mighty anxious to get \"aux<br />\ntranchees,\" and I guess I'll be as<br />\nready to get out. The artillery<br />\ntakes a long time to train unfortunately. We get splendid food—<br />\ncan get excellently cooked meals<br />\nat the inns for four or five francs<br />\nif we want a change, but the army<br />\nfood is really excellent. Our quarters are good, with plenty of wood,<br />\nbut the last two weeks have been<br />\nso mild we often go without coats.<br />\nThe Y. M. C. A. is closing and I<br />\nmust stop. Hoping the Maryland<br />\nF. A. battalion will soon get over,<br />\nFraternally,<br />\nALEXANDER K. BARTON.<br />\nNews From Capt. Elliott<br />\n<br />\nA Training Camp, Somewhere in<br />\nFrance.<br />\nJanuary 28, 1917.<br />\n<br />\nMY DEAR DR. BRUSH:<br />\nJust a line to let you and my<br />\nmany friends at Hopkins know<br />\nthat I arrived safely across the<br />\n\"big ditch\" after an uneventful<br />\nvoyage. We are hard at work here<br />\nunder French instructors trying<br />\nto master the gentle art of<br />\n\"beating the Dutch.\" The Army<br />\nseems to be in high spirits and<br />\nhopeful of an early whack at<br />\nFritz so that we can all be home<br />\nfor Christmas. Weather here like<br />\nspring at home, warm and sunny.<br />\nOur only woe is the hick of mail<br />\nand news. With kindest regards<br />\nto all at the club.<br />\nPlease remember me to Konze,<br />\nBitter, and \"George,\" the Janitor.<br />\nC. W. ELLIOTT.<br />\nWarden—In this institution,<br />\nwe aim to put every man to work<br />\nat his regular occupation.<br />\nNow what is your business?<br />\nNo. 3333—Traveling salesman.<br />\n—Chaparal.<br />\n<br />\n5<br />\n<br />\nTWO. NEW COURSES ANNOUNCED<br />\n(Continued from page 4)<br />\nMathematics 2.<br />\nPhysics 2.<br />\nChemistry 1.<br />\nPublic Speaking 1.<br />\nDrawing.<br />\nPhysical or Military Training.<br />\nThird Year:<br />\nPhilosophy 1.<br />\nChemistry 2.<br />\nChemistry 3.<br />\nCivil, Mechanical or Electrical Engineering 1.<br />\nFourth Year:<br />\nHistory or Political Economy.<br />\nChemistry 41 Practically full time<br />\nChemistry 5<br />\nin t h e Chemical<br />\nChemistry 6'<br />\nLaboratory.<br />\nCOURSE LEADING TO ADMISSION<br />\nTO SCHOOL OF HYGIENE.<br />\nAdmission—As for the School of Engineering.<br />\nYear I:<br />\nEnglish Composition 1.<br />\nMathematics 1.<br />\nPhysics 1.<br />\nChemistry 1.<br />\nPhysical or Military Training.<br />\nSurveying (in June).<br />\nYear II:<br />\nChemistry 3.<br />\nBiology 1<br />\nDrawing.<br />\nTwo of—<br />\nEnglish Literature.<br />\nMathematics 2.<br />\nFrench, Spanish or German Elements.<br />\nPhysical or Military Training.<br />\nAVIATION COURSE COMPLETED<br />\n<br />\nSome Facts as to War.<br />\nSavings Stamps.<br />\nThese War-Savings Certificate<br />\nStamps are1. AS GOOD AS GOLD, because they can be exchanged for<br />\ngold at any time.<br />\nand<br />\n2. ARE BETTER THAN<br />\nGOLD, because they are earning<br />\ninterest at 4 per cent. compounded quarterly, all the time you hold<br />\nthem, while the gold you hold is<br />\nedrning nothing.<br />\nMoreover.<br />\nThe money you pay for a WarSavings Certificate Stamp is hell)<br />\ning us win the war,<br />\nwhile<br />\nThe gold you hold is not helping<br />\nanybody do anything.<br />\n<br />\nObjects of Loan in this Form<br />\nThe objects of the United States<br />\nGovernment in selling these WarSavings Certificate Stamps($5.00)<br />\nand Thrift Stamps (25 cents) are<br />\nfourfold:<br />\n1. To obtain $2,000,000,000 for<br />\nuse in the prosecution of the<br />\nWorld War in which we are now<br />\nengaged;<br />\n2. To encourage habits of<br />\neconomy and conservation upon<br />\nthe part of our people, thereby<br />\nadding to the available wealth and<br />\nresources of our country, and<br />\nsaving both for the use of our<br />\nmilitary forces and those at home<br />\nwho are in need;<br />\n3. To encourage the habits of<br />\nthrift and saving in America, and<br />\n4. To give every citizen of<br />\nAmerica an opportunity to do his<br />\nor her part toward winning this<br />\nWar for Universal Liberty.<br />\n<br />\nThe six weeks' intensive aviation course that was offered at<br />\nHopkins during the last semester<br />\nhas ended with gratifying results.<br />\nH. I. Robinson, one of the men<br />\nwho took the course, has already<br />\nreceived his commission in the<br />\nSecond Cotillon on March 1.<br />\nUnited States Army Aviation SecThe cotillon board held a meettion. Many of the 70 students who<br />\ntook the course have already been ing last Thursday and decided to<br />\ncalled by the aviation section to hold the next dance Friday, March<br />\nthe \"ground school.\" As a proof , 1, as was decided at the beginning<br />\nof the regard in which the aviation of the year. The price for the next<br />\neach. Those<br />\ncourse at riopkitis is held by the two dances will be<br />\nWar Department, Professor Kou- men who have paid for the dances<br />\nwenhoven has announced that the in advance will be given credit for<br />\nGovernment has sent three men the amount they have payed in.<br />\nAll the details have been carefully<br />\nhere to take the course.<br />\nThe starting of another class in arranged, and those who come look<br />\naviation will depend wholly on the forward to one of the best parties<br />\nnumber of men who wish to take ever held at the University. Init. For this purpose men outside formal dancing will be held from<br />\nof the University will also be al- 8.30 to 9 P. M., and at 9.05 the<br />\nlowed to take the course. Before first dance will start.<br />\none may take the course, however, • At the same meeting new offihe must enlist in the aviation sec- cers were elected. C. Herbert Baxtion and must pass the Mental and ley was elected chairman of the<br />\nphysical tests. The course is an- board. Baxley succeeded Richard<br />\nimportant one in that it saves a H. Woodward, Jr., who was given<br />\ngreat deal of prospective aviators a commission in the Navy and has<br />\nfrom failing at the ground school, , gone to the Naval Academy for a<br />\nwhere the requirements are so three month training. William<br />\nstringent that 30 per cent of the M. Gardner and George Carneal<br />\nwere elected treasurer and secremen fail.<br />\nThe course at Hopkins requires tary, respectively, of the board.<br />\n'four nights a week. The subjects George W. Wagner was elected to<br />\ncovered are physics of flight, radio the board to fill the place made<br />\ncode practice, gas engines, ignition vacant by the graduation of Richard Woodward.<br />\nsystbm and meteorology.<br />\nA military lecture that is being<br />\nMistress (engaging new mai(l)<br />\nlooked forward to with much in- —You say the last family you<br />\nterest is that of Major Guild's on worked for were Germans?<br />\nWednesday night, March 18. His<br />\nMaid (apologetically) —<br />\nsubject will:be \"Military Law and but they was sterilized when war<br />\nArmy Organization.\"<br />\nbroke out.<br />\n<br />\nn<br />\n<br />\n\f6<br />\n<br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n<br />\nBENSON TO LEAD BALL TEAM<br />\n<br />\nLEARNS MORE ABOUT SHOOTING<br />\n<br />\nLACROSSE SQUAD LOOKS GOOD<br />\n<br />\nCLASS IN FENCING PROGRESSING<br />\n<br />\nStar Outfielder of Last Year's Base<br />\nBall Team Elected Captain at<br />\nOrganization Meeting<br />\nFor This Year.<br />\n<br />\nBattalion Takes Up Work in Fire<br />\nDirection and Control— Results<br />\nof Examinations are<br />\nUnsatisfactory.<br />\n<br />\nMen Are Getting Down to Real Work.<br />\nSchmidt,Sadtler,Morley and Winslow<br />\nSetting Fast Pace—New Men<br />\nLearn Quickly.<br />\n<br />\nSergt. Kistler's Proteges Are Rapidly<br />\nLearning the Art----Plan to Organize<br />\na Fencing Team for Next Year.<br />\n<br />\nIf the enthusiasm of the large<br />\ncrowd that attended the baseball<br />\norganization meeting held• on<br />\nTuesday, February 12, in the Civil<br />\nEngineering Building, can be<br />\ntaken as a criterion, the baseball<br />\nteam this year, despite the loss of<br />\nso many men on account of the<br />\nwar, will be one of the best that<br />\nhas ever represented the Johns<br />\nHopkins University. The chief<br />\nbusiness of the meeting was the<br />\nelection of a captain to lead the<br />\n1918 team, and \"Dick\" Benson,<br />\nlast year's star outfielder, was selected for this honored position.<br />\nThe baseball team lost the services of its captain for this year,<br />\nStuart Egerton, when he enlisted<br />\nin the battery last spring. He is<br />\nnow at Camp McClellan, Anniston, Alabama, with a whole colony of Hopkins men.<br />\nCoach Eddie Hooper was unable to get here to address the<br />\nmen and Manager Coulter, who<br />\nwas in charge of the meeting,<br />\nstarted things moving with the<br />\nelection of a captain. There were<br />\nonly two logical men for this position, Dick Benson and Lawrence<br />\nLittman, last year's third basemen, and Dick was elected. Benson, while only a sophomore, has<br />\nhad considerable baseball experience, and is unquestionably qualified to perform the duties of captain. He played in the outfield in<br />\nall of the games last year and was<br />\nthe individual star in many of<br />\nthem, his circus catches bringing<br />\nthe crowds to their feet time and<br />\nagain. Up to last year he caught<br />\nfor two years for the Baltimore<br />\nCity College; and he will probably be called upon to catch this<br />\nspring.<br />\nManager Coulter explained the<br />\nschedule and urged every man to<br />\nbe present at the first practice to<br />\nbe held on Saturday afternoon.<br />\nSlips were then passed around on<br />\nwhich the men were asked to sign<br />\ntheir names and state their previous baseball experience, where<br />\nthey had played and what positions they had filled.<br />\nAmong the old men, who are in<br />\nthe\" University this year, are<br />\nDick Benson, Littman, Judefind,<br />\nwho pitched last year, Love also a<br />\npitcher, and Sickel, an outfielder.<br />\nThese are the only men who remain from last year's team.<br />\nAmong the new men out for the<br />\nteam are: Elmer Jones, star halfback of last fall's football team,<br />\nwho played in the outfield at City<br />\nCollege for several years and who<br />\nwas captain of the team last<br />\nspring; Jack Moriarty, an outfielder, and Louis Moriarity, a<br />\npitcher, both from Manchester<br />\nHigh School; Henry Lederer, a<br />\ncatcher, and Dallam a pitcher,<br />\nfrom Dunhams; Nelson, Carey,<br />\n<br />\nWith the beginning of the new<br />\nterm, the battalion, last week,<br />\ntook up a new phase of the training, the subject of \"Fire Direction<br />\nand Control.\" At the battalion<br />\nlecture, Major Guild pointed out<br />\nthe fundamental importance, in<br />\nan engagement, of the proper control and direction of fire. Under<br />\nthis head comes the designation<br />\nof sectors of fire, the determination of range, the designation of<br />\nobjective, the rate of fire—in fact,<br />\nall those elements which enter<br />\ninto the successful prosecution of<br />\nan engagement. One of the interesting exercises was the measuring of the extent of the objective by \"fingers.\" That is, the arm<br />\nis held out at full length, and the<br />\nwhole extent of the objective is<br />\nmeasured by the number of finger<br />\nbreadths necessary to cover it. At<br />\ndrill, therefore on the following<br />\n(lay, exercises in fire control<br />\nformed the main part of the drill.<br />\nEspecially the rate of fire was<br />\ntaken up. The men were instructed that firing at all ranges<br />\nis divided into three classes:<br />\nRanges over 1,000 yards; ranges<br />\nbetween 500 and 1,000; and<br />\nranges of 500 or under. In each<br />\nclass the rate of fire may be slow,<br />\nnormal, or fast. For each rate, at<br />\neach range, there is a definite<br />\nnumber of rounds per minute. The<br />\npractice at drill was in firing tin<br />\ncorrect number of rounds at the<br />\nvarious rates of fire, as determined by the captain's command<br />\n—for instance, range, 1,100 yards,<br />\nnormal fire.<br />\nThe results of the examination<br />\nin Military Science were very unsatisfactory; and it is known that<br />\nthe commandant was greatly disappointed in the showing of the<br />\nbattalion. There were several<br />\nhigh marks; but the average ot<br />\nthe battalion was only 6.5. In<br />\nview of the fact that the members<br />\nof the battalion did so poorly, the<br />\nexamination was made informal.<br />\nHereafter, however, the men will<br />\nbe held strictly responsible for all<br />\nwork taken up at lectures or in the<br />\nquiz sections.<br />\nThe class in Military Field Engineering received practical instruction in map sketching. After<br />\ntwice pacing a 500-yard course in<br />\n'of<br />\norder to determine the length<br />\nhis pace, each man constructed a<br />\nscale for his further use.<br />\n<br />\nLacrosse practice at the cage<br />\nhas produced encouraging results.<br />\nThe few veterans who are back<br />\nare showing flashes of the old-time<br />\nform, and several of the new men<br />\nare developing into real stars.<br />\nLine-ups and scrimmages are being held twice a week, and the<br />\ncoaches are beginning to get a line<br />\non the men in actual work in their<br />\nvarious positions. It also serves<br />\nthe purpose of affording a comparison between the attack and the<br />\ndefense, and helps in the building<br />\nup of a well-rounded team.<br />\nThe close defense is showing up<br />\nparticularly well. \"Fritz\" Sadtler, at goal, is learning rapidly,<br />\nand Jake Miller has shown that he<br />\ncan step in and take care of things<br />\nin a creditable manner. Frank<br />\nMorely, John Stanley and Cashell<br />\nare fighting it out for point and<br />\ncover point. All three are football men, heavy and aggressive;<br />\ntheir stickwork is improving with<br />\nevery practice. \"Dutch\" Schmidt<br />\nis playing first defense after the<br />\nfashion of the great Johnnie<br />\nHuck, who was about the best<br />\nman at that job anywhere to be<br />\nfound. \"Johnnie\" was in a class<br />\nall his own, and for four years<br />\nwas the mainstay of Hopkins' defense. Beall, Frisch, Golder, Kennedy and Defandorf, are the likeliest candidates for the mid-field<br />\ndefense. The mid-field attack has<br />\nbeen weakened by the absence of<br />\nCaptain Wolfe, who has been confine:1 to his bed with measles, but<br />\nWilliams, Jarrett, Kauffman, and<br />\nKennedy are showing up well, and<br />\nlearning fast. The close attack has<br />\nbeen greatly strengthened by the<br />\nshifting of Baxley from the defense to first attack. Stuart, Baker, and Gardner are being used<br />\nat the home positions. Winslow,<br />\nstar football man, who has been<br />\nout of the game with a badly swollen eye, is back in harness, and his<br />\nspeed and fight are going to be a<br />\ngreat help to the attack.<br />\n<br />\nMr. Kistler's class in fencing is<br />\nprogressing at an encouraging<br />\nrate, considering the lack of equipment. Major Guild watched the<br />\nmanoeuvers for a while last Wednesday and expressed himself as<br />\nbeing much pleased with the facility with which the men have<br />\ncaught on to the intricate movements of fencing.<br />\nThe class now numbers about 10,<br />\nto whom lessons are assigned for<br />\nhome study. The candidates must<br />\nnot only know these lessons, but<br />\nmust write out the substance of<br />\nthem from memory and hand them<br />\nto the instructor. Foils and masks<br />\nhave been ordered and are expected in a few (lays. Then the<br />\nreal work of \"assaults\" or fencing<br />\nmatches will begin in earnest. Already the men have been paired<br />\noff and several interesting matches<br />\nhave taken place. All the candidates attest that it is most strenuous exercise but very interesting.<br />\nFive classes have been held to<br />\ndate; they have been held every<br />\nWednesday and Friday except<br />\nduring examination week. These<br />\nWednesday and Friday classes in<br />\nfencing will continue throughout<br />\nthe year, including broadsword<br />\nand bayonet work after the foil<br />\nhas been mastered. The men selected by Mr. Kistler will become<br />\nfencing instructors for the battalion, for a thorough course in<br />\nthis art will be instituted in the<br />\nentire corps next year. Those men<br />\nshowing up well so far are Davis,<br />\nTownsend, Dougherty, Evans, De<br />\nMarco, Bowen, Porter, Coleman,<br />\nMa<br />\nn<br />\nad<br />\nBresee. Selected<br />\nmen from this group will form a<br />\nnucleus, around which a fencing<br />\nteam will probably be built for<br />\nnext year.<br />\nHopkins Man Wins Majority.<br />\n<br />\nMajor .1. Newman Numsen, having finished the three - month<br />\ncourw in the \"school of fire\" at<br />\nFort Sill, Oklahoma, in record<br />\ntime, has returned to his command<br />\nat Camp McClellan, Anniston,<br />\nSmall Boy (proudly)—My sis- Alabama.<br />\nMajor Numsen, who graduated<br />\nter's in the movies.<br />\nDitto Girl (scornfully)—Huh, in 1909 with the degree of A. B.,<br />\nmy ma's there all the time.— was formerly a member of the<br />\nFifth Regiment and saw active<br />\nLamb.<br />\nservice on the border as captain<br />\nof Company D. Shortly after he<br />\nreturned from the border, he was<br />\nBOOKS WANTED FOR CAMP<br />\npromoted to the rank of major and<br />\nMEADE LIBRARY<br />\ntransferred to the Field Artillery.<br />\nScientific, Technical, MathHe—Darling, I would go to the<br />\n\"I wish I had a baby brother<br />\nematical and Modern language<br />\nend of the world for you.<br />\nto wheel in my go,cart, mamma,\"<br />\ntexts are much in demand<br />\nShe—The question is, would you<br />\ncomplained small Elsie. \"My dolls<br />\namong the soldiers who are takare always.getting broke when it<br />\ning examinations for commisgo to the end of your resources?<br />\ntips over.\"<br />\nsions, or who are desirous of<br />\nKaiser—I viii now review der<br />\nlearning the languages \"over<br />\nFifth Army Corps.<br />\nthere.\" Books may be sent to<br />\nTrew, Brimer, J. M. Jones, Taylor,<br />\nMajor — Highness, since the<br />\nthe Peabody Institute or left at<br />\nDe Marco, Greenbaum, Winn,<br />\nglorious victory yesterday over the<br />\nthe Hopkins Library.<br />\nEvans, Keyes, Welliver, L. Cattailhated English der ain't no corps!<br />\nach, Oakley, Webb and Rodgers.<br />\n<br />\n\fTHE JOHNS FIOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n— AMUSEMENTS —<br />\n<br />\nFORD'S<br />\nTonight at 8.15, 25c to $1.50<br />\n<br />\nTOCQUEVILLE CONTEST TRY-OUTS<br />\nWill Be Held in Donovan Room on<br />\nMarch 1 — Intercollegiate Debate<br />\nand Adams Contest Postponed to March 16.<br />\n<br />\nLAST WEEK<br />\nOf the Most Wonderful Play in America<br />\n<br />\nEXPERIENCE<br />\nBy Geo. V. Hobart<br />\nEconomic Prices<br />\nMatinees Friday and Saturday<br />\nBest Seats, $1.00<br />\nNEXT WEEK—Seats on Sale<br />\nLOU TELLEGEN in BLIND YOUTH<br />\n<br />\nACADEMY<br />\nTonight at 8.15, 25c to $2.00<br />\nKlaw & Erlander present<br />\nThe Delightful Fantastic Spanish<br />\nMusical Review<br />\n<br />\nTHE LAND OF JOY<br />\nThe Most Wonderful Dancing<br />\nShow in America<br />\n<br />\nBuy<br />\nU.S.<br />\nWar<br />\nSavings<br />\nStamps<br />\nFor Sale at the<br />\nTreasurer's Office<br />\nin Gilman Hall<br />\n<br />\n7<br />\n<br />\nOVERCOATS that will please<br />\ncollege men — $15 to $30 — at<br />\nBaltimore's Best Store.<br />\n<br />\nThe date for the preliminary<br />\ntrials for the Tocqueville contest<br />\nhas been officially announced by<br />\nDr. French to be Friday, March 1,<br />\nthe try-outs will be held in the<br />\nDonovan Room. The subject prescribed for the 1918 contest is<br />\nA. H. FETTING<br />\ndrawn from contemporary history.<br />\nMANUFACTURER OF<br />\nIt is \"French Democracy Under<br />\nthe test of War.\" Suggested sub- Greek Letter Fraternity Jewelry<br />\ntopics suitable for discussion are<br />\nFactory,<br />\nN.LIBERTY ST. 212 Little Sharp St.<br />\npresented by the committee as fol- 213Headquarters<br />\nfor the J. H. U.Seal Pins.<br />\nSpecialdesigns and estimatesfurnished on class<br />\nlows:<br />\npins,rings, medals for athletic meets,etc.<br />\n\"Was the French Republic Prepared?\"<br />\n\"The Republic and Its Allies.\"<br />\n\"The Capital in Danger.\"<br />\n\"The National Morale.\"<br />\n\"The French Parliament and<br />\nThe utmost<br />\nWar Administration.\"<br />\nin style, fit<br />\n\"Alsace-Lorraine; History and<br />\nand service.<br />\nSentiment.\"<br />\n\"The War and Religious Controversy.\"<br />\nA five-minute speech on one of<br />\nthese sub-topics (or a similar<br />\nphase of the main topic) will be<br />\nadequate for the preliminary trial.<br />\nThe Interclass Debate, which<br />\nwas scheduled to take place on the<br />\nevening of February 21, has been<br />\npostponed to Saturday, March 16.<br />\nThe contest in public speaking for<br />\nthe Adams medal will be held immediately before the debate.<br />\n<br />\nkcitiodua,sk-knet<br />\n<br />\n\"Why did they pinch Terry<br />\nToad?\"<br />\n\"Oh, he simply wouldn't observe<br />\nflyless day,'\"<br />\nyou think fishing is<br />\nhealthy exercise?<br />\nGill—Sure thing.<br />\n\"Where does the exercise come<br />\nin ?\"<br />\n\"Digging the worms.\"<br />\n\"Ila, were you • „rich when<br />\nmamma married you?\"<br />\n\"No, my dear.\"<br />\n\"Well; papa, what was it, then,<br />\ndo you think, that mamma married yoh-for?\"<br />\n\"Young man,\" said an inquisitive old lady to a tram conductor,<br />\n\"if I put my foot on that rail shall<br />\nI receive an electric shock?\"<br />\n\"No, mum,\" he replied, \"unless<br />\nyou .place your other foot on the<br />\noverhead wire!'<br />\n<br />\nR. Q. TAYLOR & CO.<br />\nHats, Umbrellas, Canes, Gloves,<br />\nand dnglish Raincoats . . .<br />\n18 E. BALTIMORE STREET<br />\n<br />\nSCHARWENKA—LEEFELD<br />\nMusic Studios<br />\nSEABOARD BANK<br />\n<br />\naARROW<br />\nform-fir<br />\n<br />\nCharles and Preston Streets<br />\n<br />\nCOLLAR<br />\n<br />\nAPPOINTMENTS BY MAIL<br />\n<br />\nLEFRANC & AULT<br />\n<br />\ncTHE DRUG STORE<br />\n<br />\nMEN'S<br />\n<br />\nGLOVES<br />\nNECKWEAR<br />\nHOSIERY<br />\n<br />\n\"SHIRT SHOP II<br />\n421 N. Howard St., at Franklin<br />\n<br />\nWW2<br />\n<br />\nfor the<br />\nH. U. Students and Faculty<br />\n<br />\nW. L.. Campbell & Co.<br />\nUniversity Parkway, at Charles Street<br />\n(OPPOSITE J. H. U. ATHLETIC STADIUM)<br />\nThe Co-operative Drug Store for the J. H. U.<br />\nIJ A U.S. Government Postoffice at your disposal.<br />\n1,1 Use us in any capacity. Use the store while<br />\nwaiting for your cars to and from the city.<br />\nAnything you need,\"WE GET IT for you.<br />\ntj Your taste is congenial with our Soda, Cigars,<br />\nCandy, Etc.<br />\n<br />\nJ<br />\n<br />\nYoung Men's Finest Suits and Overcoats<br />\nHAMBURGER<br />\nSTYLES<br />\nTHE<br />\n<br />\nARE<br />\n<br />\nHamburgers'<br />\n<br />\nNEWEST<br />\n<br />\nBaltimore and Hanover Streets<br />\n<br />\nYOUNG<br />\n<br />\nMEN'S<br />\n<br />\nFURNISHINGS,<br />\nHATS,SHOES,ETC.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n<br />\n8<br />\nTHE COLLEGE MAN AND THE WAR<br />\n<br />\nCOMMEMORAT1OM EXERCISES<br />\n<br />\n(Continuedfrom page 1)<br />\n<br />\n(Continued from Page I)<br />\n<br />\nSIDELIGHTS ON HOPKINS GAMES<br />\n(From Games Committee.)<br />\n<br />\nThey are camouflaging the<br />\nof an Acting Chaplain in the Boches this week at the Fifth RegUnited States Navy after he re- iment Armory, and the picked<br />\nmen from Camp Meade are getting<br />\nceives his degree.<br />\nwill<br />\nbegin ready for the trench assault on<br />\nexercises<br />\nThe<br />\npromptly at 11 o'clock and will Saturday evening. The Johns Hopclose prcibably before 1 o'clock. kins games Committee has received<br />\nThe battalion will march from the acceptance of Gen. Wm. NichHomewood to attend the exercises olson, commandant at Admiral, as<br />\nhonorary referee for the indoor<br />\nat McCoy Hall.<br />\n<br />\ndimmed by contact with the rough<br />\nrealities of life, share with him his<br />\nwisdom, his intuition and his inspiration, that we, also, where<br />\nnecessary, shall be likewise willing<br />\nto give our lives for truth, liberty<br />\nand justice to the end that the<br />\n' be saved for a free<br />\nworld shall<br />\nhumanity.<br />\n<br />\n_<br />\n<br />\n••••••••••••<br />\n<br />\n-CIGARETTE<br />\n<br />\nPACKAGES<br />\n601<br />\nTENS AND<br />\nTWENTIES<br />\n<br />\n•••.<br />\n••••.<br />\n<br />\n-•••.<br />\n••••<br />\n<br />\nNot by accident is Murad<br />\nthe greatest selling cigarette in<br />\nAmerica.<br />\nSOMETHING did it. What?<br />\nGoodness—that's all. Unchanging, unmistakable,inimitable, irresistible, Goodness.<br />\nFor further particulars—<br />\nt944dr<br />\n<br />\nittA<br />\n— any.<br />\neWa<br />\nl<br />\n<br />\n25 Cenzteigraiattl<br />\nAgz.tglAki<br />\nP;4.e,; Grade Turkish<br />\nMakers of<br />\nand Egyptian Ciocrclics in the World<br />\n<br />\nREMEMBER—<br />\nTurhish tobacco 13<br />\nthe world's most<br />\nfamous tobacco for<br />\ncigarettes.<br />\n<br />\nmeet. General Nicholson, together<br />\nwith Colonel Sweezey, of the Three<br />\nHundred and Thirteenth Regiment, have expressed great interest in the attack on the German<br />\ntrenches and have ordered an entire company to come to Baltimore for the event. This will be<br />\nthe first time that the general<br />\npublic has seen a realistic presentation of the most thrilling maneuver that the soldiers have. General Nicholson is anxious that<br />\nBaltimore should appreciate the<br />\nspirit of .the National Army, and<br />\nhis personal presence assures a<br />\nmost savage assault on the poor<br />\nBoches.<br />\n\"Trench and Camp,\" the, newspaper issued at Camp Meade, is<br />\nfeaturing the relay with Camp<br />\nDix. The Marylanders have been<br />\nanxious to get revenge for the<br />\nfootball defeat last fall, but the<br />\nNew Jersey people are sending<br />\ndown a team that lead eight service teams in the recent Milrose<br />\nmeet, with J. Howard Berry, the<br />\ngreat Penn athlete as anchor man.<br />\nThe colleges have entered teams<br />\nin greater numbers than even in<br />\n1917, partly due to the fact that<br />\nthe Johns Hopkins has dared to<br />\nstage a meet—which is thp -only<br />\none in the Middle South. The feature relay is between the University of Pennsylvania and its old<br />\nrival, Cornell the distance is two<br />\nmiles. Penn has two other relay<br />\nteams, and it is rumored that<br />\nGeorgia. Tech may , meet one of<br />\nthem. The Penn squad consists of<br />\n20 men.<br />\nGeorgia Tech is sending a team<br />\nNorth for the first time and the<br />\ncoming of Strupper and Guyon,<br />\nthe Indian, is in itself an event.<br />\nEverybody has read of the feats<br />\nof the two on the football field;<br />\nbut Strupper alone took over 10<br />\nfirsts in the short distances and<br />\nhurdles in 1916 and 1917 in the<br />\nSouth. He will have to fight his<br />\nway in the 220—open against such<br />\nmen as Sherman Landers, University of Pennsylvania; Tommy McDonagh; the very fast George C.<br />\nGriffin, also of Georgia Tech; Dan<br />\nBratt, of Hopkins; and Mitchell,<br />\na Western Star, running under<br />\nthe Baltimore Athletic Club.<br />\nThe hurdles will have entered<br />\nGuyon, Landers, McDonagh, Erdman, Princeton's flyer, as well as<br />\nGates of Georgetown. Cornell is<br />\nsending down Dresser, the intercollegiate cross-country champion;<br />\nbut he will be forced to the limit<br />\nby Weeks, who has been in training to repeat his last year's victory and by Raymond, of Princeton.<br />\nSherman Landers has set up the<br />\nrecord of 12 feet 8 inches in the<br />\npole vault; he was interscholastic<br />\nchampion then; but this year he<br />\nwill meet James Johnston, Twenty-third United States Engineers,<br />\nformerly of the Olympic Club, of<br />\nSan Francisco. Princeton has the<br />\ninter-collegiate shot-putting chainpion in Sinclaire; but Guyon is on<br />\n(Continued on page 9, col. 2)<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n<br />\nTHE NEWS-LETTER'S MAIL BAG<br />\n<br />\nnot attend it. If chapel has an excuse for existence, the attendance<br />\nA Column in Which the Correspondents should be better; if not it should<br />\nbe entirely dispensed with.<br />\nAre Allowed Latitude, but Shoulder the Responsibility.<br />\nHowever, the. remedy for this<br />\nlack of interest is easily seen. It<br />\nis this: Chapel exercises should<br />\n• All letters intended for publication must<br />\nbe instituted as a regular course<br />\nbe concise.<br />\nand a set time _at which every one<br />\nNo attention will be paid to anonymous<br />\nletters, but names signed as an evidence of<br />\nmust attend or else lose points<br />\ngood faith will not be printed if request is<br />\nmade that they be omitted.<br />\ncounting<br />\ntoward graduation should<br />\nThe publication of' a letter is not to be<br />\nbe determined. If this plan were<br />\ntaken as an indorsement of its views by THE<br />\nNEWS-I,ErrER, which invites the freest discarried out, without doubt the<br />\ncussion of matters of general interest.<br />\nchapel would soon come to be a<br />\nconnecting link between the facAdvocates Substitute for Class Rush.<br />\nulty and the student body, openTo the Editor of THE NEWS-LETTER:<br />\ning an avenue of--information for<br />\nSir—Afterthe Sophomore-Fresh- which the bulletin board is but a<br />\nman classic some few months back, poor substitute.<br />\nI was thinking of a plan whereby<br />\nMany other reasons could be<br />\nthe winnei. could be determined<br />\ngiven<br />\nfor the desirability of such a<br />\nmore easily and with more cerchapel,<br />\nbut they are too evident to<br />\ntainty. It is the custom at the require<br />\ndiscussion here. So let's<br />\nleading colleges of the East to cultogether<br />\nget<br />\nand, perhaps by the<br />\nminate the spirit of rivalry in a beginning of the next<br />\nschool year,<br />\nThemain<br />\ntussle.<br />\ngeneralfree-for-all<br />\nhave<br />\nshall<br />\na<br />\nwe<br />\nchapel<br />\non a syspurpose of the •scrap is to tear tematic basis with an<br />\nattendance<br />\nparthe<br />\nall the clothing from all<br />\nof the entire student body.<br />\nticipants. The slight advantage in<br />\nE. D.,'21.<br />\nage and weight which is enjoyed<br />\nFebruary 13, 1918.<br />\nby the second year students is balanced against the superior numSIDELIGHTS ON HOPKINS GAMES<br />\nbers of the underclassmen, and<br />\nthe contest is usually evenly<br />\n(Continued from page 8)<br />\nmatched.<br />\nIn order to remedy this state of his trail; and Hopkins is counting<br />\naffairs inthe future, I should Sug- on Leadbetter.<br />\ngest that a game of pushball be<br />\nThe open events are noticeably<br />\nsubstituted. Perhaps, some of your well-balanced this year, but there<br />\nreaders, have seen, either in the may be some dark horses among<br />\nmovies or elsewhere, that this the 50 or more entries from Camp<br />\nplan is used to decide supremacy Meade; the scholastic events are<br />\nbetween the second and first year to be fast going, for in addition to<br />\nclasses in colleges of the Middle the Baltimore schools Shehan, the<br />\nWest. The way the affair is con- old Central High School sprinter,<br />\nducted at present makes it a dif- is representing Princeton Preparaficult task for the.judges, after the tory School; and Tome, Episcopal<br />\n(lust has cleared, to select the side High School, and Briarly Hall<br />\nwhich deserves the decision. Be- have particularly large entry lists.<br />\nsides having all the thrills and en- Seward and the 'other' Pendleton,<br />\njoyments of the present method, a of Episcopal High School, have<br />\ngame of pushball would enable the past records that distinctly chalwinner to be chosen with much lenge Weedon of Poly and McNaLEVY, '21.<br />\nmore facility.<br />\nmara of the Technical High<br />\nSchool of Washington.<br />\nWants Compulsory Chapel.<br />\nTo the Editor of THE NEWS-LETTER:<br />\n<br />\nSir—If there is one thing in<br />\nconnection with the Johns Hopkins University that needs correction more than another, it is the<br />\npoor attendance at the chapel exercises conducted by the V. M. C.<br />\nA. Certainly, they are held at an<br />\ninconvenient time, the lunch hour<br />\nfor most students, and no definite<br />\ninducement to attend is offered.<br />\nThat is, points are not granted for<br />\nattendance, time that could be<br />\nspent in scholastic work is occupied, and, perhaps most important<br />\nof all, the exercises do not appear<br />\nto have any connection with the<br />\nUniversity proper. It is very<br />\nlikely that the seeming indifference of the University authorities<br />\nis responsible for the absence of<br />\nso many. But.whatever the cause,<br />\nthis has been the state of affairs<br />\nfor some time and seems likely to<br />\nremain so. The students appear to<br />\nregard the chapel with indifference; they say nothing derogatory<br />\nin regard to it, but still they do<br />\n<br />\nWillie—Mamma,have I ever had<br />\nthe adults?<br />\nMa—What clo you mean?<br />\nWillie—It says on my medicine<br />\n\"one teaspoonful for adults.\"—<br />\n<br />\nGREATEST ARMORY MEET EVER<br />\n<br />\n9<br />\n<br />\nr<br />\n<br />\nCollar - Hug Clothes<br />\n<br />\n(Continued from fiage I)<br />\n<br />\na very good account of itself. The<br />\nrelay team will be composed of<br />\nCaptain Firor, Bev. Smith, Driver<br />\nand Van Ness, with Winslow as<br />\nalternate. These men will also<br />\ncompete in the 100, 220, and 440<br />\nopen and South Atlantic, with the<br />\nexception of Captain Firor, who<br />\nis entered in the two high jumps<br />\nand hurdles. Besides the men mentioned above Bratt, Seagrave, Mullikin, and Leadbetter are expected<br />\nto gather in points for Johns Hopkins.<br />\nThe complete list of Hopkins entries is given below.<br />\n<br />\nSpring Styles<br />\nin suits, coats and furnishings,<br />\nwith all the \"go\" characteristic<br />\nof everything that comes from<br />\n<br />\nTHE QUALITY SHOP<br />\nBALTIMORE AND LIBERTY<br />\nMilitary Headquarters<br />\n<br />\nHENDERSON'S<br />\nBaltimore's Most Popular Price Stationers<br />\n<br />\n229 N. HOWARD STREET<br />\nSTUDENTS' NOTE BOOKS also<br />\n<br />\n100-Yard Open—Winslow, Driver,<br />\nVan Ness, Bratt, Mossom, Ebeling, LOOSE LEAF NOTE -BOOKS<br />\nat. POPULAR PRICES<br />\nFischer and Burke.<br />\nto<br />\n220-Yard Open—Winslow, Van Ness, 50 Engraved<br />\nCards and Plate, Script Engraving, 70c<br />\nMerriken, Haseltine, Torsch, Mossom,<br />\n50 Engraved Cards from Plate, - • - • 40c<br />\nBratt, Ebeling and Fischer.<br />\n440-Yard Open—Merriken, Haseltine, Class and Fraternity<br />\nClass Pin Dies for<br />\nTorsch, Mulliken, Mossom, Fischer<br />\nStationery made Free of Charge<br />\nand Burke.<br />\n880-Yard Open—Norwood, Haseltine, HEADQUARTERS for CRANE'S FINE. PAPERS<br />\nMulliken and Lord.<br />\nJ. W. BREEDLOVE & CO.<br />\nOne Mile Open—Rivkin and Mulli- (Wilbur F. Parker<br />\nAndrew NUklas)<br />\nken..''<br />\nrIERCHANT TAILORS<br />\n100-Yard - Hurdles Open—Seagrave,<br />\nSNAPPY COLLEGE CLOTHES<br />\nFiror, Cronin and Burke.<br />\nRight Prices<br />\nPole Vault • Open—Seagraye.<br />\nIll N. Charles St.<br />\n(Second Floor)<br />\nHigh Jump Open—Firor and NorSAMPLES CHEERFULLY GIVEN<br />\nwood.<br />\nShot Put Open—Leadbetter.<br />\n100-Yard S. A. I. A. A.—Winslow,<br />\nDriver and Bratt.<br />\n440-Yard S: A. I. A. A.—Smith and<br />\nFischer.<br />\n880-Yard S. A. I. A. A.—Rivkin and<br />\nMulliken.<br />\nOne Mile S. A. I. A. A.—Rivkin and<br />\nMulliken.<br />\n100-Yard Hurdles S. A. I. A. A.—Seagrave, Firor and Cronin.<br />\nShot Put S. A. I. A. A.—Leadbetter.<br />\nPole Vault—Seagrave.<br />\nHigh Jump—Norwood and Firor.<br />\nSee us for Shoes, Lacrosse Gloves<br />\nand other equipment<br />\nThe military<br />\n•<br />\n<br />\nTRACK SUPPLIES and<br />\nLACROSSE SUPPLIES<br />\n<br />\nfeatures of the<br />\nmeet include an intercompany relay and an intercompany wallscaling contest, open to Companies<br />\n\"A,\" \"B,\" and \"C\" of the Hopkins<br />\nBattalion. There will also be a<br />\nbayonet drill by a detail of selected men from Camp Meade. Brigadier - General Nicholson and<br />\nColonel Sweezey of \"Baltimore's<br />\nOwn\" have accepted invitations to<br />\nattend and serve as honorary officials.<br />\n<br />\nMcCALLISTER'S<br />\n(Eat. 1S94<br />\n<br />\nBaltimore's Best Athletic Store<br />\n221 W. BALTIMORE ST.<br />\nBALTIMORE, MD<br />\n<br />\nJ. Trockenbrot & Co.<br />\nGOLD AND SILVERSMITHS<br />\n.•.<br />\n<br />\nJ. H. U. Seals and Pins .•.<br />\n<br />\nWidow.<br />\n<br />\n324 W. SARATOGA STREET<br />\n<br />\nCornell—Thirty future mechanical engineers from the senior<br />\nclass will begin government work<br />\nin the shipyards at Wilmington,<br />\nDel., on February 4. They will<br />\ncontinue their studies, having lectures four nights a week. Twentyeight seniors in electrical engineering will go to Schenectady to<br />\nwork for the government. All will<br />\nreturn to Ithaca in May to receive<br />\ntheir diplomas.<br />\n<br />\n\"May I see Barker, please?\" she<br />\nasked at the hospital. She was<br />\nvery pretty.<br />\n\"We don't allow anyone but relatives to see the patients. Are you<br />\na member of his family?\" asked<br />\nthe matron.<br />\n\"Why, yes,\" she answered blushingly. Then boldly: \"I'm his sister.\"<br />\n\"Oh, really,\" answered the matron, \"I'm so glad to meet you.<br />\nI'm his mother.\"—Lehigh Burr.<br />\n<br />\nGEO. DOEBEREINER<br />\nTottfrrtionrr<br />\nMt. Vernon 3110-3111-1754<br />\n<br />\n29 E. NORTH AVE.<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards—Invitations<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER — PRINTER — STATIONER<br />\n229 N. Charles Street<br />\n<br />\nComplete Assortment of Men's Fine Shirts<br />\nFinest Qualities<br />\n<br />\nHUTZLER DIVITIEM J<br />\n<br />\nModerate Prices<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1918.<br />\n<br />\n10<br />\n<br />\nHOPKINS MAN HONORED IN MEXICO<br />\n<br />\nIf price is secondary, and goodlooking \"kicks\" the main object,<br />\nthe Hess line will strike you just<br />\nright. Come here for individuality and styles that look the price.<br />\n<br />\nN. HESS' SONS<br />\n<br />\nBALTIMORE ST.<br />\n<br />\nMilton P. Henneman<br />\nLibrary Bookbinder<br />\n309 West Mulberry Street<br />\nC. & P. Telephone<br />\n<br />\nWyman's<br />\nMen's<br />\nShoes<br />\n<br />\nThe Largest &<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br />\nSole Agent for<br />\nthe Johnston &<br />\nMurphy Shoes.<br />\n<br />\nRegistrar Ball has recently received a letter from Dr. William<br />\nE. Gates, A. B.,'86, who is now in<br />\nMexico, and who tells of his appointment as honorary professor<br />\nin the National Museum of Mexico. He says: \"Under present conditions I am especially glad to receive this honor, as being the only<br />\nAmerican, and the nomination being accounted as the highest that<br />\ncan be conferred In Mexico. Special exploration privilege for a<br />\nterm of years in some of the most<br />\nimportant ancient ruined cities<br />\nhave also been granted me, and,<br />\nwith the soon-to-be-expected complete pacification of the country,<br />\nI hope it will be possible to do important work.\"<br />\nThe officio, which tells of his appointment, speaks of Dr. Gates as<br />\nbeing the first American to be signally honored and his \"valuable<br />\nstudies in archaeology, ethnology,<br />\nand anthropology\" and \"his most<br />\ncomplete and notable works on<br />\nthe ruins of Yucatan.\"<br />\nENGLISH INSTRUCTOR LEAVES<br />\n<br />\nFrancis E. A. Litz, graduate<br />\nstudent of the Johns Hopkins University and instructor in Public<br />\nSpeaking and English ComposiSHIRTMAKER<br />\n226 N. Liberty St. tion in the undergraduate departJust arrived—Large line New Shirtings. ment, has left the University to<br />\nPrices, $2.25, $2.75, $3.25. Less 10%<br />\naccept a secretaryship with the<br />\ncash 30 days.<br />\nDon't forget us on Knights of Columbus at Camp<br />\nUnderwear, Neckwear, Hosiery Meade. Mr. Litz received his<br />\nBachelor of Arts degree at St.<br />\nMary's Seminary of Baltimore in<br />\n1912 and his Master of Arts de23 S. HANOVER ST.<br />\ngree in 1914. During the colBALTIMORE, MD.<br />\n• legiate year of 19154916 he was a<br />\nPrinters of Philological and fellow in the Johns Hopkins University in English, Latin, and<br />\n- Scientific Works<br />\nPhilosophy. He expected to reAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nceive his Doctor of Philosophy deof America, \"Johns Hopkins University Circulars,\"\"Modern Language Notes.\"\"Maryland Hisgree in June, but asked that this<br />\ntorical Magazine,\" 'University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nbe postponed in order that he<br />\nsimilar character. Special attention given to the<br />\nmight take up the work at Camp<br />\nprinting of<br />\nMeade. Mr. Litz was appointed<br />\nDOCTORS' DISSERTATIONS<br />\nIn Greek. Latin. Anglo-Saxon, Old English, and instructor of public speaking and<br />\nRomance and Germanic Languages.<br />\nEnglish composition in the undergraduate department for the year<br />\nES COVI<br />\nstND and<br />\nCollege Text-Books<br />\n1917-1918. Upon his withdrawal<br />\nlast<br />\nweek his public speaking<br />\nSMITH'S BOOK STORE<br />\nclasses were taken over by Mr.<br />\n805 N. HOWARD ST.<br />\nUhler and his English composition<br />\n2 Doors Above Madison<br />\nclasses by Dr. French.<br />\nAgent for the Harvard Loose-Leaf Note Book<br />\n<br />\n19 Lexington St.<br />\n<br />\nSTRATTON<br />\n<br />\nJ. H. FURST Co.<br />\n<br />\nTHE CUCKOO SHOP<br />\nGuilford and Thirty-First<br />\n,<br />\n<br />\nCIGARS, CIGARETTES & TOBACCO<br />\nCANDY<br />\nMAGAZINES<br />\nFULL LINE OF CANNED GOODS<br />\n<br />\nORTMAN'S<br />\n\"Queen Quality\" Home-Made Candies<br />\n50c. a pound<br />\n<br />\nEvery Piece a Pleasant Surprise<br />\n<br />\nThe Flirt—For an army officer,<br />\nyou are not very venturesome.<br />\nShy Suitor—I belong to the reserves.<br />\nTownley—Was your garden any<br />\ngood this year?<br />\nSubbubs—You bet it was. It enabled our next door neighbor's<br />\nchickens to take first prize at the<br />\npoultry show.<br />\n<br />\nJohns Hopkins Cotillon Club<br />\n<br />\n2nd COTILLON<br />\nwill be<br />\n<br />\nThe<br />\nNorman Remington Cot<br />\n<br />\nFriday, March 1st<br />\nDancing. 9 to 12.30<br />\n<br />\nInformal Dancing. 8.30 to 9<br />\n<br />\nSubscription, $2.00<br />\n<br />\nBOOKS<br />\n<br />\nYou're Interested In<br />\nEvery Student Should Own<br />\n<br />\n3d COTILLON—MAY 4<br />\n<br />\nSend Your Name for Monthly List<br />\n<br />\nSERIES OF LECTURES ON WAR<br />\n<br />\nCharles Street, at Mulberry<br />\n<br />\n(Continued from page 1)<br />\n<br />\nfounders of the League to Enforce<br />\nPeace, has recently written \"A<br />\nLeague of Nations,\" a review of<br />\nthe plan of a league of nations,<br />\nwhich was reviewed in a recent<br />\nnumber of THE NEWS-LETTER.<br />\nThe dates and subjects of the<br />\nlectures.follow:<br />\nWednesday, February 27—Prof.<br />\nJ. H. Latane, \"The Tradition of<br />\nAmerican Isolation.\"<br />\nFriday, March 1—Prof. W. W.<br />\nWilloughby, \"The German Theory<br />\nof the State.\"<br />\nWednesday, March 6—Prof. W.<br />\nW. Willoughby,\"The German System of Government.\"<br />\nFriday, March 8.—Prof. Vernon<br />\nL. Kellogg, \"The Germans in Belgium and France.\"<br />\nWednesday, March 13 — Dr.<br />\nWinford Smith, \"Medical Aspects<br />\nof the War.\"<br />\nFriday, March 15—President F.<br />\nJ. Goodnow, \"The War and the<br />\nFuture of the Far East.\"<br />\nWednesday, March 20. — Mr.<br />\n• Theodore Marburg, \"Plans for<br />\nPermanent Peace.\"<br />\nEnthusiastic He—She was as irresistible as a five-dollar bill on<br />\nthe sidewalk.<br />\nSarcastic She—You simply had<br />\nto pick her up, huh ?—Orange<br />\nPeel.<br />\n<br />\nMEN'S AND YOUNG<br />\nMEN'S CLOTHING<br />\n• AND FURNISHINGS<br />\n—correct in style<br />\n—high grade in quality<br />\n—moderate in price<br />\n<br />\nSTEWARTIcor<br />\nI. CoutetWm 1Votl blown<br />\n<br />\nWe give Surety Coupons and redeem them in<br />\nour own merchandise<br />\n<br />\nTHE HATTERIE<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of Light Street<br />\n<br />\nSole Agents for Baltimore for College Fraternity Bands (Greek Letter Societies).<br />\n<br />\nLaw School of the<br />\n<br />\nUniversity of Maryland<br />\nHon. Henry D.Harlan, LL. D., Dean<br />\nFormer Chief Judge Supreme Bench of Baltimore<br />\nCity<br />\n<br />\nAfternoon and Evening Sessions<br />\nFor catalogue apply to<br />\nEDWIN T.DICKERSON,Secretary.301 St. Paul St<br />\n<br />\nR.E.D.U.G.E.r)<br />\n4*<br />\n<br />\n/1<br />\n<br />\norirtg<br />\niBrattii<br />\nentimi<br />\n<br />\nVISIT OUR ICE CREAM PARLORS<br />\n227 N. HOWARD STREET<br />\n<br />\nHOTEL EMERSON<br />\nBaltimore and Calvert Sts.<br />\nBaltimore's Newest and Most Complete Hotel<br />\nJOHN J. KINCAID<br />\n<br />\n\"That fellow's talking,\" exclaimed Mr. Comrox,\"makes me think<br />\nof certain styles of 'classical music.'\"<br />\n\"In what way ?\"•<br />\n\"It sounds all wrong, but he can<br />\ngive you such an argument you<br />\ndon't dare say so.\"<br />\n<br />\nPe ! 7 HI. Hub<br />\nBaltimore, Charles<br />\nand Fayette<br />\n<br />\n.<br />\n<br />\n\f", "format": "basic_html", "processed": "•<br /><br />\nEZ<br />\nVOL. XXII, NO. 17.<br /><br />\nI<br /><br />\nThe College Man and the War<br />\nBy T. W.GREGORY<br />\nAttorney General of the United States.<br /><br />\n(From the Patriotic News Service of<br />\nthe National Committee of Patriotic<br />\nSocieties, Washington, D. C.)<br /><br />\nIIKS En]<br />\nBALTIMORE, MD., FEBRUARY 18, 1918.<br /><br />\nR<br /><br />\nPRICE, FIVE CENTS<br /><br />\nGREATEST ARMORY MEET EVER<br /><br />\nCOMMEMORATION EXERCISES<br /><br />\nSERIES OF LECTURES ON WAR<br /><br />\nAnnual Hopkins Indoor Games Promise<br />\nto Surpass Any of Past Greatest Track<br />\nMen in the Country Will Compete.<br />\nMilitary Features.<br /><br />\nCommemoration Exercises Will Be Held<br />\nat McCoy Hall—Dr.Alonzo E.Taylor<br />\nFood Expert,to Speak—Degrees<br />\nto be Conferred.<br /><br />\nArrangements Made for Course of Lectures on \"Aspects of The World War.\"<br />\nDrs. Goodnow, Latane and Willoughby to Speak.<br /><br />\nThe fourteenth annual indoor<br />\nHistoric McCoy Hall will once<br />\nThe University announces that<br />\nThe relationship of the college<br />\nman to this war is almost sui games of the Johns Hopkins Uni- more be the scene of a University a series of seven lectures on \"Asversity at the Armory this Satur- function for the forty-second anni- pects of the World War\" will be<br />\ngeneris. It has a great point of day<br />\nnight promises to be the great- versary of the opening of the given on consecutive Wednesdays<br />\nvantage and a great responsi- est indoor meet ever staged<br />\nby Johns Hopkins Univers'ty will be and Fridays beginning with Wedbility.<br />\nthe Black and Blue. More large celebrated there in Friday, Febru- nesday, February 27. This course<br />\nFresh from the study of the colleges with great track reputa- ary 22, at 11 A. M. The address of lectures has been secured<br />\ncourse and the instances of history, tions are going to send big squads will be delivered by Dr. Alonzo through the efforts of Professor<br />\nthe college man should be able to than ever before, and the relay E. Taylor, professor of physiolog- Lovejoy, of the department of<br />\nlook through the words and acts races should even surpass the high ical chemistry at the University philosophy, who is serving as<br />\nwith which men and'nations some- standard set by former Armory of Pennsylvania on \"The Limiting Field Director for the Educational<br />\nmeets. The Penn-Cornell relay is Factors in the Food Supply of a Committee of the Maryland Countimes seek to disguise their real certain<br />\nto be one of the features Nation.\" ..The degree of Bachelor cil of National Defense. Dr. John<br />\nmotives and purposes and to see in of the meet, and the<br />\nCamp Meade- of Arts will be conferred upon H. Latane, professor of American<br />\nall their nakedness the true and Camp Dix race should be excep- three candidates,<br />\nand the degree History, and Dr. Thomas S. Bareal objects at which ambitious tionally fast, with such men as of Doctor of Philosophy<br />\nwill be ker, a Hopkins alumnus and Presdynasties an nations aim. After Howard Berry and Gus Welch conferred upon a like number.<br />\nident of Tome School, are also<br />\nall, the elemental passions of running. Georgia Tech has two<br />\nDr. Taylor is a wildly known members of this committee, which<br />\ngreed and avarice which drove the relay teams entered, against one authority on food problems. He has held public meetings throughPersian to his ruin at Thermopylae of which the Black and Blue quar- one of the Commission appointed out the State and weekly meetings<br />\nare identical with those which tet will be pitted in the S. A. I. A. by the House of Representatives at the Academy of Music, where<br />\nhave influenced dynasties since A. championship race; Penn State to go to Europe and investigate some of the foremost speakers in<br />\nthat time. Taught to detect all will probably oppose the other. thoroughly the food situation America have spoken.<br />\nthese in the actions of men and The Maryland Interscholastic there.<br />\nThe lectures will be given in the<br />\nnations in the past, observant of championship race will be a new<br />\nCivil<br />\nEngineering Lecture Hall at<br />\nImmediately<br />\nbefore<br />\nthe exerthe inexorable rules of cause and feature, with City, Poly, Tome,<br />\nHomewood and will begin at 5 P.<br />\ncises<br />\nthe<br />\nmembers<br />\nseveral<br />\nof<br />\nthe<br />\neffect which have always hereto- Dunham's, and Briarly High branches<br />\nof the University will M. The first lecture will be given<br />\nfore and will always hereafter Schools entered. The Baltimore<br />\nassemble<br />\nat their designated on Wednesday, February 27, by<br />\noperate while man is man,• he Athletic Association and the faplaces.<br />\nThe<br />\nTrustees, the Faculty, Professor Latane, who will speak<br />\nshould have no illusions as to the mous Meadowbrook Club of PhilaAlumni<br />\nthe<br />\nCouncil, and the of- on \"The Tradition of American<br />\ngreat forces which have plunged delphia are among the other teams<br />\nficial<br />\nguests<br />\nwill<br />\nassemble at 10.30 Isolation.\" Professor Latane is<br />\nand are holding the world in their entered in the relays.<br />\no'clock in Levering Hall, corner considered one of the leading auterrible grip. •<br />\nThe list of individual stars enof Eutaw street and Druid Hill thorities in the country on AmerBut this is not all. The college tered in the meet is most impos- avenue. The Alumni will assemble ican history; he has recently writman is fresh from his studies of ing, headed by Sherman Landers, at 10.30 o'clock on the second floor ten a text-book on the subject,<br />\nthe great principles of ethics and of the University of Pennsylvania, of McCoy Hall (north end).<br />\nwhich will soon be ready for pubphilosophy which thus far have who holds the intercollegiate reclication;<br />\nIle delivered the lectures<br />\nThe students will meet at 10.20<br />\non the military policy of the<br />\nguided the world in its march to ord for the pole vault, having o'clock in the<br />\nfollowing places and<br />\nUnited States before the battalion<br />\nward a perfect civilization. As he cleared the bar at 13 feet 1 inch. proceed under direction<br />\nof their<br />\nBerry,<br />\nformer<br />\nHoward<br />\nallthe<br />\nthis<br />\nyear. The next two lectures<br />\nknows the Mainspring of human<br />\nmarshals to the assembly room:<br />\nwill be given by Dr. W. W. Wilgreed and avarice, so is he famil- round Penn star, will be seen<br />\nGraduate students in Arts and loughby, professor-of<br />\niar with the sources of human sporting the colors of Camp Dix,<br />\npolitical sciSciences—Second Floor of McCoy ence, who has<br />\nInWelch,<br />\nwill<br />\nfamous<br />\nas<br />\nGus<br />\nthe<br />\nbeen granted leave<br />\nright, justice and liberty which<br />\nHall (south end).<br />\nof absence to serve with the Instihave preserved and protected man- dian from Carlisle. Brooke BrewStudents of Medicine--Room 12, tute of Government<br />\nformerly<br />\nMaryland<br />\nState,<br />\nof<br />\ner,<br />\n-Research. He<br />\nkind. He should understand and<br />\nMcCoy Hall.<br />\nwill speak on \"The German Therecognize the forces which make will be up from Camp Meade, and<br />\nUndergraduat<br />\ne Students—Third ory of the State\" and<br />\nfor the destruction of these prin- will be entered in the 100-yard floor of<br />\n\"The GerMcCoy Hall. ,<br />\nman System of Government.\"<br />\nciples -however they may be dis: open. Cornell will send down,<br />\nThe procession will enter the<br />\nProfessor Vernon L. Kellogg,<br />\nguised. To him the alleged bene- among others, W. H. Clemenshaw,<br />\nassembly room at<br />\n.10.45 o'clock. A whose articles on' Belgium<br />\nI.<br />\nand<br />\nDiesser,<br />\nJr.,<br />\nC.<br />\ntwo<br />\nher<br />\nof<br />\nficent elements of Prussianism<br />\nin the<br />\npart of the room will be reserved Atlantic<br />\nMonthly attracted such<br />\nare the thinnest veneer over hid- greatest track men, the former for the<br />\nfamilies<br />\nof the Trustees widespread attention,<br />\neous principles destructive of all will be seen in the 100-yard open, and<br />\nwill have<br />\nFaculty until 10.45 o'clock, for his<br />\nsubject \"The Germans in<br />\nthe good that man has during the and the 100-yard hurdles, while after<br />\nwhich time seats will be Belgium and<br />\nthe latter is entered in the mile<br />\nFrance.\" Dr. Wincenturies wrung from the 'hands run<br />\nopen. Georgia Tech will be open to the public.<br />\nford Smith, Superintendent of ,the<br />\nof cruelty and roppression.<br />\nrepresented in the sprints by G.<br />\nA feature of the celebration will Hopkins Hospital, will speak on<br />\nPossessed of this knowledge and E. Strupper and Joe Guyon, two be the conferring of degrees upon<br />\nof the intuition and inspiration of of her famous football stars, while several men who 'have completed \"The Medical Aspects of the War.\"<br />\nyouth which gives to him the right Maxim, world famous 100-yard their work with the mid-year ex- President Goodnow, who was conand the power to see the truth as,it . dash man, will be down with the aminations. R. H. Woodward, stitutional Adviser to the Chinese<br />\nGovernment prior to coming to.<br />\nis, the'College Man has a large Meadowbrook Club squad. Weeks, who has been commissioned<br />\nan the University, will speak on \"The<br />\npart of the responsibility of seeing Hopkins star last year in the mile ensign in the United<br />\nStates War and the Future of the Far<br />\nthat truth prevails. He will do and two mile, who holds the South Navy, Ko-Chi Sun, and L.<br />\nS. Levy, East.\"<br />\nbut half his duty, will meet but Atlantic record in the latter, is will receive the degree of<br />\nBachelor<br />\nThe last lecture will be delivhalf his responsibility, if he mere- entered in the mile, representing of Arts. The degree of<br />\nDoctor of ered by Theodore Marburg, memly offers his own life for his the Hopkins Alumni Association. Philosophy will be<br />\nconferred upon ber of the Board Of Trustees and<br />\ncountry. He must, in addition to , The Hopkins squad entered this P. F. Bloomhardt,<br />\nBroadus Mit- former Minister to Belgium on<br />\nand beyond this, see to it that year is large, and, though on the chel, and C. Vernon<br />\nLynch. Mr. \"Plans for permanent Peace.\" Mr.<br />\nthose of us whose vision has been whole inexperienced, should give Bloomhardt -will take<br />\nup the work Marburg, who was one of the<br />\n(Continued on page 8, col. I)<br /><br />\n(Continued on page 9, col. 3)<br /><br />\n(Continued on page 8, col. 2)<br /><br />\n(Continued on page 10, col. 3)<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\nent and are giving evidence of ability, but many of the men initiated<br />\ninto the glorips company of naval<br />\nand -individuality is offered here at prices that are not officers came direct from civil life,<br />\nand cannot be underquoted by any house at any time. and upon their willingness to<br />\nlii Besides, the reputation of an old-established firm is learn, their swiftness and their aptitude we must depend for a large<br />\nback of each sale with a guarantee.<br />\nincrease in the number of those<br />\nwho are to be given command of<br />\nour ships.<br />\nFURNITURE<br />\nThe .;Cavy has given warm welDECORATIONS<br />\nDRAPERIES<br />\ncome to college students and col343 NORTH CHARLES STREET<br />\nlege graduates. I wish I could<br />\npersonally shake handswith each<br />\ncollege man who has entered or<br />\nwill enter the service. I would<br />\nlike to say to each:<br />\nOn First Floor, 322 and 324 N. Howard St.<br />\n\"You will touch here with the<br />\nstimulatin<br />\ng traditions dear to all<br />\nLarge Dining Room on Second Floor<br />\nwho love the ,Navy.<br />\n•<br />\n\"Your country has confidence<br />\nin you. You will justify that confidence in proportion as you master<br />\nATTENTION! J. H. U.STUDENTS:<br />\nthe work which you are entering.<br />\nThis Is the Logical Place to Buy Your Note and Blank Books,<br />\nIts rewards come only to those of<br />\ngood courage whose minds are<br />\nStationery Supplies, Fountain Pens, Loose Leaf<br />\nwholly given to learning the mysDevices and Card Index Outfits!<br />\nteries of modern fighting craft.<br />\n\"I am empowered officially to<br />\nwelcome the youthful defenders of<br />\nour country. You come as citizens<br />\nPRINTERS<br />\nPUBLISHERS<br />\ncalled to duties of citizenship in<br />\ntime of war. When civil liberty is<br />\nat stake, civilians become warriors. So today the Republic has<br />\ngone to war!<br />\n\"As you may be called into service you will go to the fleet, to the<br />\nThe Big Stationery Store<br />\npatrol, to the transports, to whatever duty you will be assigned<br />\n10-12 N. HOWARD STREET<br />\nBALTIMORE<br />\nwith the feeling that you have<br />\nshown that civilians can do whatever there is need for them to do.<br />\nN. KABIK<br />\n\"You are engaged in a rightThe Navy and the College Man<br />\neous war, and when faith in right<br />\nPARISIAN LADIES' TAILOR<br />\nshall triumph over faith in<br />\nBy HON. JOSEPHUS DANIELS. Secretary of<br />\nPressing,Cleaning and Remodeling of Ladies<br />\nmight, as it surely will, you will<br />\nNavy.<br />\nthe<br />\nand Gents' Garments. New Work a Specialty<br />\n(From the Patriotic News Service share with the veterans of the<br />\nPhone, Homewood 17564<br />\n346 EAST 33rd ST.<br />\nof the National Committee of Patri- Navy the gratitude of a people<br />\notic Societies, Washington, D. C.)<br />\nwho have never looked to their<br />\nANNAPOLIS SHORT LINE<br />\nIt is vital to a powerful navy to Navy in vain.<br />\n\"I do not know what particular<br />\nhave powerful guns and powerful<br />\nships, but they are only so much service you will be called upon to<br />\nwell-fashioned steel unless they do. I can not lift the veil. One<br />\nare manned by officers and men thing I do know, however, and<br />\nwith trained minds and hands, that is that you will be worthy of<br />\nElectric Trains EVERY HALF HOUR<br />\nwith steady nerves and heads. We the noble work into which you enBetween<br />\nhave today in the Navy all the men ter. May the All-Wise Providence<br />\nBALTIMORE (Camden Station)<br />\nwe need until ships under con- give you of His strength to bear<br />\nand ANNAPOLIS<br />\nstruction and repair are furnished the world to an early peace—a<br />\nShortest, Quickest and Most Direct Route<br />\nand put in commission. The great- peace that shall insure justice<br />\nright alike to all peoples and<br />\nANNAPOLIS SHORT LINE est need, therefore, is for officers and<br />\nwho know how to sail a ship, how all nations.\"<br />\nto man its guns; how to organize<br />\nYe Peggy Stewart Tea Room it to fight.<br />\nMay He Rest in Pieces.<br />\n17 West Saratoga Street<br />\nThe Navy's reliance upon the There was a man who fancied<br />\nThat by driving good and fast<br />\nNaval Academy for educated and<br />\nLUNCHEON<br />\nAFTERNOON TEA<br />\nget his car across the track<br />\ncapable officers in peace times is He'd<br />\nPOTATO ROLLS<br />\nCAKES<br />\nBefore the train got<br />\nSANDWICHES<br />\nwell placed. Since the war began He'd miss the engine bypast;<br />\nan inch<br />\nPrivate Luncheons and Afternoon Teas<br />\nthis fine institution, unsurpassed<br />\nAnd make the train hands sore.<br />\nin the world, has been doubled, There was a man who fancied this—<br />\nPhone Connections<br />\nThere isn't any more.<br />\nbut today its facilities are inad—Lampoon.<br />\nJAMES W. HUGHES equate to graduate officers<br />\nas rapidly as they are needed.<br />\nCATERER<br />\nHubby—Hang it! One of my cyBut all the normal sources of linders is missing.<br />\n12 EAST CENTRE STREET<br />\nofficers combined did not serve to<br />\nWifey—That's just like you, AlBanquets. Receptions<br />\nWith Every<br />\ngive as many as the expanding fred.<br />\nand Dinners<br />\nRequisite<br />\nYou're always mislaying<br />\nNavy needed, and we turned with things.<br />\nconfidence to the civilians with<br />\nlove of the sea and some knowl\"The Germans say they give<br />\nedge of seamanship to qualify their prisoners two square meals<br />\nthemselves for command. Before a day!\"<br />\nwar was declared there were some<br />\n\"Yes, two bouillon cubes.\"—<br />\n106-108 CLAY ST.<br />\nreserve officers who had shown tal- Lampoon.<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJohn C. Knipp &amp; Sons<br /><br />\nLUNCH AND DINING ROOMS<br /><br />\nMEWALTIEIMER<br /><br />\nBOOK = BINDING<br />\nJoseph Ruzicka<br /><br />\nJohns Hopkins Press<br />\nf<br /><br />\n•<br />\nI.—American Journal of Mathematics.<br />\nEdited by FRANK MORLEY, with<br />\nthe co-operation of A. COHEN, CHARLOTTE A. SCOTT and other mathema.tiaans.- Quarterly. 4to. Voltime<br />\nXL in progress. $6 per volume. (Foreign postage 50 cts.)<br />\nIL—American Journal of Philology.<br />\nB. L. GILDERSLEEVE and C. W.<br />\nE. MILLER, , Editors.<br />\nQuarterly.<br />\n8vo. Volume XXXIX in progress. $3<br />\nper _volume. (Foreign postage 30<br />\ncts.)<br />\n111.—Johns Hopkins University Studies in<br />\nHistorical and Political ScienCe.<br />\nUnder the direction of the -Departments of History, Political Economy<br />\nand Political Science. Monthly, 8vo.<br />\nVolume XXXVI in progress. $3.50<br />\nper volume.<br />\nIV.—Johns Hopkins University Circular.<br />\nIncluding the President's Report,<br />\nAnnual Register and Medical Department catalogue. T. R. Ball, Editor.<br />\nMonthly. 8vo. Volume XXXVII in<br />\nprogress. $1 per year.<br />\nV.—Johns Hopkins Hospital Bulletin.<br />\nMonthly. 4to. Volume XXIX in<br />\nprogress. $3 per year. (Foreign postage 50 cts.) •<br />\nVI.—Johns Hopkins University Studies<br />\nin Education.<br />\nE. F. BUCHNER and C. M. CAMPBELL, Editors. 8vo. Two numbers<br />\nhave appeared.<br />\nVII.—Johns Hopkins Hospital Reports.<br />\n8vo. Volume XVIII in progress. $5<br />\nper volume. (Foreign postage 50 cts.)<br />\nVIII.—Contributions to Assyriology and<br />\nSemitic Philology.<br />\n(Beitrage zur Assyriologie, etc.)<br />\nPAUL HAUPT and FRIEDRICH<br />\nDELITZSCH, Editors. Volume X in<br />\nprogress.<br />\nIX.— Memoirs from the Biological Laboratory.<br />\nFive volumes have been issued.<br /><br />\nX.—Modern Language Notes.<br />\nJ. W. BRIGHT, Editor-in-Chief; M.<br />\nP. BRUSH, W. KURRELMEYER, G.<br />\nGRUENBAUM and J. E. SHAW.<br />\nEight times yearly. 8vo. Volume<br />\nXXXIII in progress. $3 per volume.<br />\n(Foreign postage 50 cts.)<br />\nXL—American Journal of Insanity.<br />\nH. M. HURD, E. N. BRUSH, G. A.<br />\nBLUMER, J. M. MOSHER and C. K.<br />\nCLARKE, Editors. Quarterly. 8vo.<br />\nVolume LXXIV in progress. $5 per<br />\nvolume. (Foreign postage, 50 cts.)<br />\nXIL—Terrestrial Magnetism and Atmospheric Electricity.<br />\nL. A. BAUER, Editor. Quarterly.<br />\n8vo. Volume XXIII in progress. $3<br />\nper volume. (Foreign postage 25 cts.)<br />\nXIII.—Reprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. Fourth<br />\nseries in progress. $2.<br />\nX1V.—Hesperia.<br />\nHERMANN C0LLI TZ, HENRY<br />\nWOOD and JAMES W. BRIGHT, Editors. 8vo. Eleven numbers have ap-<br /><br />\npeared.<br /><br />\nXV.—Elliott Monograph in the Romanc•<br />\nLanguages and Literatures.<br />\nE. C. ARMSTRONG, Editor. 8v0.<br />\n$3 per year. Three numbers have appeared.<br /><br />\nXVI. Reports of the Maryland Geological Survey.<br />\nEdited by W. R. CLARK.<br />\nA full list of publications will be sent<br />\non application.<br />\nTHE JOHNS HOPKINS PRESS,<br />\nBALTIMORE, MD<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br /><br />\nThe Medical Standard Book_Co.<br />\n307 N. CHARLES ST.<br /><br />\nCollege Text Books<br />\nAT NET PRICES<br /><br />\nJ. H.SAUMENIG &amp; CO.<br />\nEngravers<br />\nStationers<br />\nBlank Book Makers•<br />\n229 Park Avenue - Baltimore<br /><br />\nAdams Drug Company<br />\nCIGARS, SODA<br />\nAND CANDY<br />\nHoward and Monument Streets<br /><br />\nLEMMERT<br />\n—a synonym for<br />\nGood Clothes<br />\nOver a quarter century<br />\nof leadership in making<br />\nMen's Outer Garments<br /><br />\nPLAZA BLDG.,19 E. FAYETTE ST.<br />\nThe Oldest Musical Instrument House in the United States<br />\nEstablished 1811<br /><br />\nH. R. Eisenbrandt Sons<br />\nIncorporated<br /><br />\n\"All Things Musical\"<br /><br />\n1<br /><br />\n1 The College Athlete and the War 11<br />\nBy WALTER CAMP<br /><br />\n(From the Patriotic News Service of<br />\nthe National Committee of Patriotic<br />\nSocieties, Washington, D. C.)<br /><br />\nIt is with a feeling of great<br />\nsatisfaction with those of us who<br />\nhave ever contended that the sport<br />\nof football was one which bred<br />\nreal men, that we find in this time<br />\nof emergency of the country our<br />\ngridiron heroes, practically en<br />\nmasse, have gone to the colors.<br />\nLast year's Yale and Harvard<br />\nteams which played at the Yale<br />\nBowl before some 80,000 spectators, are now divided in the service as follows:<br />\nYALE.<br />\nMoseley, left end, Lafayette Escadrille, France.<br />\nChurch, right end, Sergeant, Aviation Section, A. E. F., France.<br />\nGates, left tackle, Aviation Section,<br />\nU. S. N. R. F.<br />\nBlack, left guard, U. S. N. R. F.,<br />\nNewport, R. I.<br />\nCallahan, center, U. S. N. R. F., Newport, R. I.<br />\nFox, right guard, Second Lieutenant,<br />\nU. S. R. Field Artillery.<br />\nBaldridge, right tackle, Captain, V.<br />\nS. R. Field Artillery.<br />\nComerford, right end, American Ambulance Corps, France.<br />\nLaroche, quarterback, American Ambulance Corps, France.<br />\nNeville, left halfback, Second Lieutenant, U. S. R. Field Artillery.<br />\nLeGore, right halfback, Lieutenant,<br />\nU. S. Marine Corps, France.<br />\nJacques, fullback, Officer in Ordnance Corps.<br /><br />\nthere in the blue uniform and<br />\nwearing it with the same spirit<br />\nSeniors!<br />\nFraternities!<br />\nthat they formerly wore the jersey<br />\nClasses and Teams!<br />\nor the canvas jacket, are our players not albne of last year but of<br />\nNOTICE<br />\nthe earlier periods.<br />\nBetween January 20 and February<br />\nWe are once more proving that .20 all pictures that are to go in the<br />\nthe lights of song and story in the<br />\n1918 Hullabaloo must be taken.<br />\npresent generation, even as in that<br />\nPRICES:<br />\nof the olden times, shone most<br />\n1. Individuals<br />\n$2.00<br />\n2. Groups<br />\nbrightly over brave men. \"And<br />\n5.00<br />\nbrighter lights shone o'er fair woArrange for sittings today with Jeff<br />\nMiller, Business Manager.<br />\nmen and brave men.\" And there<br />\nseems.to be a reason for it. A social scientist, 40 years ago, said<br />\nthat the greatest nation of the<br />\nfuture would be the one that could<br />\nsend the most men to the top of<br />\nthe Matterhorn. He was assailed<br />\nby many with questioning as to<br />\nwhat he meant and whether he<br />\nplaced physical qualities and<br />\nstrength and the physique above<br />\nthe artistic and literary. But<br />\nthe events of the last four<br />\n211-213 E. Baltimore Street<br />\nyears have been showing more<br />\nBaltimore, Md.<br />\nand more clearly what he had<br />\nin mand, and what qualities<br />\na nation must possess, even in this<br />\ntwentieth century itself, in order<br />\nto even live. Perhaps the millenium will some time come, but it Is<br />\nmanifest that today bravery and<br />\n300 N. Howard Street<br />\nphysical qualities are essential to<br />\nBALTIMORE, MD.<br />\nthe very life and existence of any<br />\nnation. This'is the reason why we<br />\nSurgical Instruments,<br />\nmust make our men—:all of them—<br />\nmore fit and enduring, more able Hospital, Invalid and Microscopic<br />\nto withstand hardships. Our colSupplies,<br />\nlege athlete is the fighting type,<br />\nOrthopedic Appliances.<br />\nHis spirit, his arms, his legs are<br />\ngood. The only point where we<br />\nhave in a measure failed is in his<br />\nset-up, the deepening of his chest,<br />\nand the better development of his<br />\nPrescription Opticians<br />\ntrunk for suppleness, action and<br />\n405 CHARLES STREET, NORTH<br />\nresistive force. That is a point we<br />\nare remodeling today and the athBALTIMORE<br />\nlete of the future will be more the<br />\nall-around man and the average<br />\nman in college will have more of<br />\nthe possibilities of the athlete.<br /><br />\nWEAR<br /><br />\nThe Chas. Willms<br />\nSurgical Instrument Co.<br /><br />\nHARVARD.<br />\nHarte, right end, Captain, U. S. R.<br />\nHeavy Artillery.<br />\nVICTROLAS<br />\nRECORDS<br />\nPhinney, right end, Ensign, U. S. N.<br />\nBAND INSTRUMENTS<br />\nR. F., Annapolis.<br />\nBatchelder, right end, Ensign, U. S.<br />\nTEL. MT. VERNON 3898<br />\nNavy.<br />\nCaner, right tackle, Ambulance,<br />\nService, France.<br />\nSweetser, right tackle, Ensign<br />\nSchool, Harvard.<br />\nAthletic and Sport Goods<br />\nSnow, right guard, Ensign School,<br />\nHarvard.<br />\nHonor Roll of Military Examination.<br />\nHarris, center, Captain, U. S. R.,<br />\nCamp Devens.<br />\nFor the information of the bat... very<br />\nWiggin, center, Lieutenant, U. S. R., talion,<br />\nBaltimore<br />\nWashington<br />\nthe following list of the 10<br />\nCamp Devens.<br />\nDadmun, left guard, A. F. Corps, best papers on the recent examina• • • best<br />\ntion in military science and tacFrance.<br />\nWheeler, left tackle, Ensign, U. S. tics is posted and published:<br />\nNavy.<br />\nFrank A. Ruth<br />\n1. Stearns, J. L., Co. A<br />\n97*<br />\nCoolidge, left end, Captain, Infantry,<br />\nSPORTING GOODS MANAGER<br />\n2. Bitter, K. 0., Co. B<br />\n96*<br />\nDevens.<br />\nU. S. R., Camp<br />\n3. Lewin, J. H., Co. B<br />\n304 W. Baltimore Street<br />\n93<br />\nRobinson, quarterback, Lieutenant,<br />\n4. Coleman, A. B., Co. B<br />\n92<br />\nU. S. R., Camp Devens.<br />\n5. Cattanach, G. S., Co. A<br />\n91<br />\nMurray, quarterback, U. S. Naval<br />\n6. Shaw, H. B., Co C<br />\n91<br />\nMaryland's Most Reserves.<br />\n7. Winslow, 0. P., Co. C<br />\n90<br />\nquarterback<br />\nSchool,<br />\nFelton,<br />\nEnsign<br />\n,<br />\nFamous Dishes<br />\n8. Cook, W. D., Co. A<br />\n90<br />\nHarvard. 4<br />\n9. Bloom, W., Co B<br />\n90<br />\nHorween, right halfback, Ensign, U. 10. Sollers, B. F., Co. C<br />\nCalvert and Thirtieth Sts.<br />\n90<br />\nS. Navy.<br />\nTerrapin, SmithFlower, right halfback, Naval Re*Honor grade.<br />\nAllows J. H. U.students special discounts<br />\nserves Aviation Corps.<br />\nfield Ham and<br />\nWillcox,<br />\nhalfback,<br />\nright<br />\nEnsign,<br />\nGame<br />\nNaval Reserves Aviation Corps.<br />\n13 SOUTH STREET<br />\nThacher, left halfback, U. S. R.,<br />\nCamp Devens.<br />\nCapital, $600,000<br />\nCasey, fullback, U. S. Naval ReSurplus and Profits, $2,641,000<br />\nserves.<br />\nPHONE<br />\nActs as Trustee of Corporation Mortgages. Fiscal Agent<br />\nMinot, fullback, Lieutenant, U. S.<br />\n2028 Druid Hill Ave.<br />\nMADISON 3420<br />\nfor Corporations and<br />\nIndividuals, Transfer Agent and Registrar. Depository<br />\nR., Camp Devens.<br />\nunder plans of<br />\nActs as Executor, Administrator, Guardian, Trustee, Receiver, reorganization.<br /><br />\n306-308<br /><br />\nN. Howard Street<br /><br />\nHoward A.French &amp; Co.<br /><br />\nBOWEN &amp; KING<br /><br />\nWAGNER'S<br /><br />\nCANNED FOODS<br /><br />\nBACON DRUG STORE<br /><br />\nJENKINS<br /><br />\nWM. J. MILLER<br />\nJEWELRY<br />\nFine Diamonds and Watches<br />\nHopkins Seals in Silver and<br />\nGold, 75c. to $5.00.<br />\nCollege Jewelry a Specially<br /><br />\n28 E. BALTIMORE STRFF7<br /><br />\nSale Deposit and Crust<br />\nCompany of Baltimor<br /><br />\nAttorney and<br />\nAnd this is equally true of the Agent, being especially organized for<br />\ncareful management and settlement of estates<br />\nother colleges and universities of every character.<br />\nOne-story fireproof building, with latest and best equipment for safety of<br />\nthroughout the broad land. The<br />\nwriter has had an oportunity, ow- contents.<br />\nSafes for rent in its large fire and burglar proof vaults, with spacious and welling to his government work at the lighted coupon'rooms<br />\nfor use of patrons.<br />\nNaval Stations, to see that<br />\nSecurities held on deposit for Out-of-Town Corporations and persons.<br />\nwherever there is a naval station • H. WALTERS, Gann of<br />\nBoard.<br />\nJOHN J. NEUMAN, Pros.<br />\nJOHN W. MARSHALL, Vics•Prss.<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br /><br />\nwants to miss a race or an event<br />\nthat these boys enter.<br />\nMoreover, there will be an agFOUNDED. 1897<br />\ngregation of national -stars at the<br />\nSubscription<br />\n$2.00 games that may be labelled \"The<br />\nbest in the land.\" There will be a<br />\nEntered as second-class matter LiePenn-Corne<br />\nll relay race, that<br />\ncember 3, 1909, at the Post Office at<br />\nBaltimore, Md., under Act of Congress, promises to rival the annual<br />\ngridNovember 3, 1879.<br />\niron classic on Franklin Field.<br />\nPublished weekly, from October to There will be a Camp Meade-Camp<br />\nJune, by the students of the Johns<br />\nDix relay. There will be interHopkins University.<br />\ncompany relays and contest. There<br />\nBusiness communications should be will be a bayonet<br />\ndrill. There will<br />\naddressed to the BUSINESS MANAGER,<br />\nJOHNS HOPKINS UNIVERSITY; all arti- be present some of the highest<br />\ncies and other communications should be army officers.<br />\nYou can't' possibly'<br />\nsent to the EDITOR-IN-CHIEF.<br />\nafford to miss this—your own<br />\nHomewood 100 Hopkins games!<br />\nTelephones<br /><br />\nNIS-Wier<br /><br />\nEditor-in-Chief:<br />\nMorton K. Rothschild, '18.<br /><br />\n5.<br /><br />\nBoy Scouts or Drafted Men?<br /><br />\nit is a far cry back to the Liberty<br />\nBusiness Manager:<br />\n•Loan Parade of last fall, but there<br />\nWilliam M. Gardner, '20.<br />\nare certainly two hundred and<br />\nfifty men around Homewood who<br />\nAssistant Business Managers:<br />\nGeorge w.'Wagner, '20.<br />\nare still periodically shaken<br />\nHenry H. Morriss, '20.<br />\nwith the unspeakable nightmare,<br />\n`,`Aren't they cute little boy<br />\nAssociate Editors::<br />\nscouts?\" or.\"Oh, the lovely draftRichard H. Woodward, Jr., '18.<br />\nRoszel C. Thomsen, '19.<br />\ned men!\" or, worse still, \"Do<br />\nRichard L. Field, '19. _<br />\n'way, they're the Poly (City) caCarroll Stansbury, '20.<br />\ndets.\" The sting of those remarks<br />\nVernon E. Stuart, '20.<br />\nsmarts even today. The newly creAylett B. Coleman, Jr., '20.<br />\nLeo W. Simon, '20.<br />\nated Battalion Activities Board<br />\ncan do no greater service and offer no more convincing proof of<br />\nBALTIMORE, MD., FEB. 18, 1918.<br />\nits value to the Battalion than to<br />\nprocure a Hopkins standard, behind which the Hopkins men can<br />\nThe Hopkins Armory Games.<br />\nThis is a Red -Letter Week on marcli in the next parade or review with clear consciences and<br />\nthe University calendar, the cele- real pride.<br />\nbration of the founding of the University on Friday and the staging<br />\nUNIVERSITY DIRECTORY<br />\nof the annual Hopkins* games on<br />\nSaturday, two of the biggest<br />\nAthletic Association<br />\nevents of the' 'college year, are<br />\nAlexander M. Wolfe<br />\nPresident<br />\ncrowded into a single week-end. H. E. Corner<br />\nGraduate Mgr.<br />\nIf the undergraduate must be solTrack Team<br />\nemn and'serious and, dignified on Monroe Firor<br />\nCaptain<br />\nManager<br />\nFriday he may be himself once V. J. Wyckoff<br />\nJ. H. U. Battalion<br />\nmore on Saturday. The interest<br />\nT. L. Chisholm<br />\nMajor<br />\nand pride of every student in the H. H. Startzman<br />\nAdjutant<br />\nUniversity, which may have been<br />\nEngineering Society<br />\nlulled into indifference on account 0. P. Winslow<br />\nPresident<br />\nJ. S. Jammer<br />\nSecretary<br />\ncramming<br />\nof the<br />\nand excitement<br />\nStudent Council<br />\nof examinations and the ittercolEd. B. Jarrett<br />\nPresident<br />\nlegiate inactivity of the winter A. L. Hamburger<br />\nSecretary<br />\nmonths, should be kiiidled anew<br />\nY. M. C. A.<br />\nPresident<br />\nin the anticipation of one of the Chas. T. Leber<br />\ngreatestathletic events of the year. William L. Merriken.... ('or. Secretary<br />\nOmicron Delta Kappa.<br />\nAll of the energy and enthusiasm<br />\nAlexander M. Wolfe<br />\nPresident<br />\nthat has accumulated since the Carl W. Schmidt<br />\nSec'y- Treas.<br />\ndust of that memorable battle<br />\nMusical Clubs<br />\nPresident<br />\nWith State cleared away Will E. Burke<br />\nCoulter<br />\nDirector<br />\nbreak forth in the Fifth Regiment D.<br />\nW. J. H. B. Wells<br />\nTreasurer<br />\nManager<br />\nArtnory on *Saturday night, Hop- L. B. Kellum<br />\nDebating Council<br />\nkins track teams of past years<br />\n.K. Rothschild<br />\nPresident<br />\nhave •made history on that floor, Morton<br />\nC. H. Miegel<br />\nSecretary<br />\nthe men of this year's team, deLacrosse Team<br />\nspite their limited _experience and Ale M. Wolfe<br />\nCaptain<br />\nManager<br />\ndepleted ranks, have demonstrated Roszel Thomsen<br />\nBaseball Team<br />\nin the spirit of their practices<br />\nManager<br />\nthat they are going to prove Douglas Coulter<br />\nMenorah Society<br />\nworthy of their predecessor:<br />\ns Lester Levy<br />\nPresident<br />\nThere is not a Hopkins man who Leo W. Simon<br />\nSecretary<br /><br />\nTWO NEW COURSES ANNOUNCED<br />\nOne Leading to B. S. in Chemistry<br />\nOther, Leading to Admission to New<br />\nSchool of Hygiene'—Will Attract New Students.<br /><br />\nThe Board of Trustees of the<br />\nJohns Hopkins University have<br />\nannounced two important new<br />\ncourses, which have been established on account of the new school of<br />\nHygiene and Public Health and on<br />\naccount of the demand for industrial chemistry. One course given<br />\nin the College of Arts and Sciences, leads to admission to the<br />\nnew School of Hygiene. The other<br />\ncourse leads to the degree of Bachelor of Science in Chemistry.<br />\nOwing to conditions growing<br />\nout of the war and in response to<br />\na demand from the agricultural<br />\nindustries of the country, it was<br />\nfelt that additional opportunities<br />\nshould be offered to the young<br />\nmen of the State to obtain training in advance chemical work<br />\nduring the college course. The<br />\nnew course is under the direction of the School of Engineering<br />\nand identical with the prescribed<br />\nengineering course for the first<br />\ntwo years. In the third year chemistry is substituted for two of the<br />\nengineering subjects, and in the<br />\nlast year, practically all of the<br />\nstudent's..time is devoted to special work in the chemical laboratory. It is hoped that students in<br />\nthis course will be better prepared<br />\nto carry on advanced work in all<br />\nlines of industrial chemistry than<br />\nstudents who have followed the<br />\nso-called courses in chemical-engineering, given by a number of<br />\ninstitutions throughout the country. Students who enter the new<br />\ncourse will be eligible to the State<br />\nscholarships awarded in, the Engineering School.<br />\nA student, who completes the<br />\ncourse, with two units of Latin<br />\n(which may be offered for matriculation) and with the equivalent<br />\nof Biology I (as certified by our<br />\ndepartment of biology).will be accepted for admission to the Medical School.<br />\nAn outline of the courses follows:<br />\nI.<br /><br />\nIN MEMORY OF DR. MALL<br />\n(Remarks of President Goodnow,who<br />\npresided at the commemoration exercises for Dr. Mall on Sunday, February<br />\n3, at C. E. Hall.)<br /><br />\nWe are assembled here today to<br />\nhonor the memory of our lamented colleague and friend Dr. Mall. Dr. Mall had been up to the<br />\ntime of his death continuously and<br />\nuninterruptedly associated with<br />\nthe Medical School from the time<br />\nof its opening. He was one of the<br />\ngroup who a quarter of a century<br />\nago inaugurated a new venture in<br />\nmedical instruction in this country. The purposes which were<br />\nthen outlined, the ideas which<br />\nwere then entertained, the methods which were then adopted had<br />\nsubsequently a widespread influence throughout the land. It is<br />\nsomewhat -difficult for us, separated as we are by so long a period from the original time of<br />\ntheir formulation and accustomed<br />\nas we are to the changes which<br />\nthey caused, to appreciate how<br />\nnovel and how important was the<br />\nwork then undertaken.<br />\nFor the success attendant upon<br />\nthe Medical School Dr. Mall was<br />\nin no small measure responsible.<br />\nA brilliant and tireless investigator he made invaluable contributions to the science to which he<br />\ndevoted himself and won prestige<br />\nfor the institution with which he<br />\nwas connected. A wise and sane<br />\ncounselor he exercised a potent<br />\nand salutary influence over the<br />\npolicy of the medical faculty. A<br />\nkindly and courteous gentleman<br />\nhe greatly endeared himself to his<br />\ncolleagues and associates.<br />\nPassing away in the prime of<br />\nlife and at the height of his powers he leaves in the world of science a gap which it will be difficult to fill and among his friends<br />\na sense of loss which it is impossible to overcome.<br />\nWe have, however the satisfaction of knowing that<br />\n' the University of which he was a member<br />\nis better and finer for what he was<br />\nand did. His life and work will<br />\nlong continue to be an inspiration to the colleagues he has left<br />\nbehind and to the students whom<br />\nhe taught.<br /><br />\nCOURSE LEADING TO THE DEGREE OF BACHELOR OF SCIENCE IN CHEMISTRY,<br />\nAdmission—As for the Engineering<br />\nA Correction.<br />\nSchool: Two years of Latin except<br />\nIn the last issue of 'PILE NEWSfor a combination of physics and<br />\nmanual training which can be offered LETTER the stateinent was incoronly by students of the Baltimore<br />\n_HolPolytechnic Institute and the Mc- rectly made that Howard<br />\nKinley High School of Washington, land, who is now at the officers'<br />\nD. C.<br />\ntraining camp at Camp Meade„<br />\nFirst Year—As for Engineering School: was never a student<br />\nat the UniverEnglish Composition 1.<br />\nsity. Mr. Ball, Registrar of the<br />\nMathematics 1.<br />\nUniversity, informs us that HolPhysics 1.<br />\nFrench or German Elements(Spanish land *as an attendant on the college courses for teachers. The<br />\nmay be substituted for French),<br />\nhonors which Holland has won in<br />\nDrawing.<br />\nPhysical or Military Training.<br />\nthe short time he has been .at<br />\nSecond Year—As in Engineering eainp are all the more significaht.<br />\nSchool:<br />\nWe are proud and happy to claim<br />\nEnglish Literature 4.<br />\nhim asa member, as well as an of(Continued on page5, col. 3)<br />\n- flcial of the University.<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br /><br />\n1<br /><br />\n1 NEWS FROM MEN IN SERVICE II<br /><br />\nTHE NEWS-LETTER wants to devote<br />\nthis page to news of Hopkins men in<br />\nthe service. It is impossible for the<br />\neditors to keep in touch with every<br />\nman in the service; the co-operation of<br />\nthe families and friends of Hopkins<br />\nmen with the colors is earnestly<br />\nsought. THE NEWS-LETTER will be glad<br />\nto publish letters, photographs and general news of men in the service, which<br />\nwill The returned upon request. Address TILE NEWS-LETTER, Box 232, Johns<br />\nHopkins University.<br />\nAlex. Barton Writes From France.<br />\n[Alexander K. Barton, from whom<br />\nthe following letter comes, was a prominent member of the Class of 1914. He<br />\nwas elected Rhode Scholar in the year<br />\nhe graduated, but had to forego the<br />\nprivileges of the honor on account of<br />\nthe war. He was also editor of THE<br />\nNEWS-LETTER during the year 19131914. THE NEWS-LEAThR is indebted<br />\nto Dean Brush for the privilege of<br />\npublishing this intensely interesting<br />\naccount]<br /><br />\nJanuary 25, 1918.<br />\n149th F. A., A. E. F., France<br />\nDEAR MR. BRUSH—<br />\nI have been intending to write<br />\nfor some time, but have been putting it off. Would that I had not<br />\nbeen so delinquent and had pursued Fraser and Squair more ardently! A lot of charming French<br />\nladies hold a Red Cross (French)<br />\nBazar at camp and how I curse<br />\nmy inability to \"parler\" with fluency. We entertain them at our<br />\nofficers mess, and after having<br />\nskillfully maneuvered so that<br />\nMlle. la plus belle et plus charmante sits at my table, a sous-lieutenant comes along and does<br />\nnearly all the talking. Tell any of<br />\nyour students to put the classics<br />\naside, not to say the sciences, and<br />\nto learn French. I have met some<br />\ncharming people. They are most<br />\nhospitable. Had a good game of<br />\ntennis the Sunday before Christmas with some French girls at a<br />\ntown in Brittany. It was funny<br />\nto sap \"pret?\" and \"guaranteeing.\" Being with Americans so<br />\nmuch and having no chance to<br />\nstudy, it is hard to make much<br />\nprogress, but what French I did<br />\nknow has come back in a remarkable way, and I have picked up a<br />\nlot. It has been a tremendous<br />\npleasure to be able to talk to<br />\nFrench officers and to the country<br />\npeople. When I cannot understand the spoken word I get them<br />\nto write it down. I had quite<br />\nan extensive conversation with a<br />\nFrench lieutenant en route from<br />\nParis to this place (the First<br />\nCorps School). I have written<br />\nquite a few French letters. My<br />\nknowledge of French has been a<br />\ngreat help in a military way—so<br />\nmany directions in regard to the<br />\nsoixante-quinze and to signalling<br />\napparatus are not yet translated.<br />\nI have seen quite a few interesting places—one old town near the<br />\nlast camp. The castle walls are<br />\nstill intact, a deep moat in front<br />\nof them and in the town a church<br />\nwith beautiful stone carvings and<br />\nstained glass windows, built by<br />\nthe English when they held that<br /><br />\npart of France. I had two great<br />\ndays in Paris. I translated what<br />\nour French guide had to say in<br />\nthe Palais de Justice to a party<br />\nof officers. It is remarkable how<br />\npractice helps your French. I<br />\nsaw Leslie Buckler in Paris. He<br />\ntook me to supper at a club for allied officers, which occupies the<br />\nhandsome house of Baron Rothschild.<br />\nI should think THE NEWS-LETTER or ALUMNI MAGAZINE Would<br />\nbe interested in hearing of the<br />\nJohns Hopkins University men in<br />\nour first four thousand. There are<br />\nquite a few in the First Division.<br />\nLieut.-Col. John Crane (who came<br />\nto see me one night, but whom I<br />\nmissed). Maj. Redmond Stewart,<br />\nActing Judge Advocate of the First<br />\nDivision,Whom I see frequently, as<br />\nhe is located here. Gillie, whom I<br />\njust ran into tonight here at the Y.<br />\nM. C. A., and Jim Manning. Hunting, a Phi Gama about '07, is here.<br />\nJack Branham is at the Infantry<br />\nSchool here,I just learned tonight,<br />\nand shall look him up tomorrow.<br />\nBesides the Hopkins Unit (which<br />\nis nearby), there will be many of<br />\nus in the First Corps.<br />\nI am mighty anxious to get \"aux<br />\ntranchees,\" and I guess I'll be as<br />\nready to get out. The artillery<br />\ntakes a long time to train unfortunately. We get splendid food—<br />\ncan get excellently cooked meals<br />\nat the inns for four or five francs<br />\nif we want a change, but the army<br />\nfood is really excellent. Our quarters are good, with plenty of wood,<br />\nbut the last two weeks have been<br />\nso mild we often go without coats.<br />\nThe Y. M. C. A. is closing and I<br />\nmust stop. Hoping the Maryland<br />\nF. A. battalion will soon get over,<br />\nFraternally,<br />\nALEXANDER K. BARTON.<br />\nNews From Capt. Elliott<br /><br />\nA Training Camp, Somewhere in<br />\nFrance.<br />\nJanuary 28, 1917.<br /><br />\nMY DEAR DR. BRUSH:<br />\nJust a line to let you and my<br />\nmany friends at Hopkins know<br />\nthat I arrived safely across the<br />\n\"big ditch\" after an uneventful<br />\nvoyage. We are hard at work here<br />\nunder French instructors trying<br />\nto master the gentle art of<br />\n\"beating the Dutch.\" The Army<br />\nseems to be in high spirits and<br />\nhopeful of an early whack at<br />\nFritz so that we can all be home<br />\nfor Christmas. Weather here like<br />\nspring at home, warm and sunny.<br />\nOur only woe is the hick of mail<br />\nand news. With kindest regards<br />\nto all at the club.<br />\nPlease remember me to Konze,<br />\nBitter, and \"George,\" the Janitor.<br />\nC. W. ELLIOTT.<br />\nWarden—In this institution,<br />\nwe aim to put every man to work<br />\nat his regular occupation.<br />\nNow what is your business?<br />\nNo. 3333—Traveling salesman.<br />\n—Chaparal.<br /><br />\n5<br /><br />\nTWO. NEW COURSES ANNOUNCED<br />\n(Continued from page 4)<br />\nMathematics 2.<br />\nPhysics 2.<br />\nChemistry 1.<br />\nPublic Speaking 1.<br />\nDrawing.<br />\nPhysical or Military Training.<br />\nThird Year:<br />\nPhilosophy 1.<br />\nChemistry 2.<br />\nChemistry 3.<br />\nCivil, Mechanical or Electrical Engineering 1.<br />\nFourth Year:<br />\nHistory or Political Economy.<br />\nChemistry 41 Practically full time<br />\nChemistry 5<br />\nin t h e Chemical<br />\nChemistry 6'<br />\nLaboratory.<br />\nCOURSE LEADING TO ADMISSION<br />\nTO SCHOOL OF HYGIENE.<br />\nAdmission—As for the School of Engineering.<br />\nYear I:<br />\nEnglish Composition 1.<br />\nMathematics 1.<br />\nPhysics 1.<br />\nChemistry 1.<br />\nPhysical or Military Training.<br />\nSurveying (in June).<br />\nYear II:<br />\nChemistry 3.<br />\nBiology 1<br />\nDrawing.<br />\nTwo of—<br />\nEnglish Literature.<br />\nMathematics 2.<br />\nFrench, Spanish or German Elements.<br />\nPhysical or Military Training.<br />\nAVIATION COURSE COMPLETED<br /><br />\nSome Facts as to War.<br />\nSavings Stamps.<br />\nThese War-Savings Certificate<br />\nStamps are1. AS GOOD AS GOLD, because they can be exchanged for<br />\ngold at any time.<br />\nand<br />\n2. ARE BETTER THAN<br />\nGOLD, because they are earning<br />\ninterest at 4 per cent. compounded quarterly, all the time you hold<br />\nthem, while the gold you hold is<br />\nedrning nothing.<br />\nMoreover.<br />\nThe money you pay for a WarSavings Certificate Stamp is hell)<br />\ning us win the war,<br />\nwhile<br />\nThe gold you hold is not helping<br />\nanybody do anything.<br /><br />\nObjects of Loan in this Form<br />\nThe objects of the United States<br />\nGovernment in selling these WarSavings Certificate Stamps($5.00)<br />\nand Thrift Stamps (25 cents) are<br />\nfourfold:<br />\n1. To obtain $2,000,000,000 for<br />\nuse in the prosecution of the<br />\nWorld War in which we are now<br />\nengaged;<br />\n2. To encourage habits of<br />\neconomy and conservation upon<br />\nthe part of our people, thereby<br />\nadding to the available wealth and<br />\nresources of our country, and<br />\nsaving both for the use of our<br />\nmilitary forces and those at home<br />\nwho are in need;<br />\n3. To encourage the habits of<br />\nthrift and saving in America, and<br />\n4. To give every citizen of<br />\nAmerica an opportunity to do his<br />\nor her part toward winning this<br />\nWar for Universal Liberty.<br /><br />\nThe six weeks' intensive aviation course that was offered at<br />\nHopkins during the last semester<br />\nhas ended with gratifying results.<br />\nH. I. Robinson, one of the men<br />\nwho took the course, has already<br />\nreceived his commission in the<br />\nSecond Cotillon on March 1.<br />\nUnited States Army Aviation SecThe cotillon board held a meettion. Many of the 70 students who<br />\ntook the course have already been ing last Thursday and decided to<br />\ncalled by the aviation section to hold the next dance Friday, March<br />\nthe \"ground school.\" As a proof , 1, as was decided at the beginning<br />\nof the regard in which the aviation of the year. The price for the next<br />\neach. Those<br />\ncourse at riopkitis is held by the two dances will be<br />\nWar Department, Professor Kou- men who have paid for the dances<br />\nwenhoven has announced that the in advance will be given credit for<br />\nGovernment has sent three men the amount they have payed in.<br />\nAll the details have been carefully<br />\nhere to take the course.<br />\nThe starting of another class in arranged, and those who come look<br />\naviation will depend wholly on the forward to one of the best parties<br />\nnumber of men who wish to take ever held at the University. Init. For this purpose men outside formal dancing will be held from<br />\nof the University will also be al- 8.30 to 9 P. M., and at 9.05 the<br />\nlowed to take the course. Before first dance will start.<br />\none may take the course, however, • At the same meeting new offihe must enlist in the aviation sec- cers were elected. C. Herbert Baxtion and must pass the Mental and ley was elected chairman of the<br />\nphysical tests. The course is an- board. Baxley succeeded Richard<br />\nimportant one in that it saves a H. Woodward, Jr., who was given<br />\ngreat deal of prospective aviators a commission in the Navy and has<br />\nfrom failing at the ground school, , gone to the Naval Academy for a<br />\nwhere the requirements are so three month training. William<br />\nstringent that 30 per cent of the M. Gardner and George Carneal<br />\nwere elected treasurer and secremen fail.<br />\nThe course at Hopkins requires tary, respectively, of the board.<br />\n'four nights a week. The subjects George W. Wagner was elected to<br />\ncovered are physics of flight, radio the board to fill the place made<br />\ncode practice, gas engines, ignition vacant by the graduation of Richard Woodward.<br />\nsystbm and meteorology.<br />\nA military lecture that is being<br />\nMistress (engaging new mai(l)<br />\nlooked forward to with much in- —You say the last family you<br />\nterest is that of Major Guild's on worked for were Germans?<br />\nWednesday night, March 18. His<br />\nMaid (apologetically) —<br />\nsubject will:be \"Military Law and but they was sterilized when war<br />\nArmy Organization.\"<br />\nbroke out.<br /><br />\nn<br /><br />\n6<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br /><br />\nBENSON TO LEAD BALL TEAM<br /><br />\nLEARNS MORE ABOUT SHOOTING<br /><br />\nLACROSSE SQUAD LOOKS GOOD<br /><br />\nCLASS IN FENCING PROGRESSING<br /><br />\nStar Outfielder of Last Year's Base<br />\nBall Team Elected Captain at<br />\nOrganization Meeting<br />\nFor This Year.<br /><br />\nBattalion Takes Up Work in Fire<br />\nDirection and Control— Results<br />\nof Examinations are<br />\nUnsatisfactory.<br /><br />\nMen Are Getting Down to Real Work.<br />\nSchmidt,Sadtler,Morley and Winslow<br />\nSetting Fast Pace—New Men<br />\nLearn Quickly.<br /><br />\nSergt. Kistler's Proteges Are Rapidly<br />\nLearning the Art----Plan to Organize<br />\na Fencing Team for Next Year.<br /><br />\nIf the enthusiasm of the large<br />\ncrowd that attended the baseball<br />\norganization meeting held• on<br />\nTuesday, February 12, in the Civil<br />\nEngineering Building, can be<br />\ntaken as a criterion, the baseball<br />\nteam this year, despite the loss of<br />\nso many men on account of the<br />\nwar, will be one of the best that<br />\nhas ever represented the Johns<br />\nHopkins University. The chief<br />\nbusiness of the meeting was the<br />\nelection of a captain to lead the<br />\n1918 team, and \"Dick\" Benson,<br />\nlast year's star outfielder, was selected for this honored position.<br />\nThe baseball team lost the services of its captain for this year,<br />\nStuart Egerton, when he enlisted<br />\nin the battery last spring. He is<br />\nnow at Camp McClellan, Anniston, Alabama, with a whole colony of Hopkins men.<br />\nCoach Eddie Hooper was unable to get here to address the<br />\nmen and Manager Coulter, who<br />\nwas in charge of the meeting,<br />\nstarted things moving with the<br />\nelection of a captain. There were<br />\nonly two logical men for this position, Dick Benson and Lawrence<br />\nLittman, last year's third basemen, and Dick was elected. Benson, while only a sophomore, has<br />\nhad considerable baseball experience, and is unquestionably qualified to perform the duties of captain. He played in the outfield in<br />\nall of the games last year and was<br />\nthe individual star in many of<br />\nthem, his circus catches bringing<br />\nthe crowds to their feet time and<br />\nagain. Up to last year he caught<br />\nfor two years for the Baltimore<br />\nCity College; and he will probably be called upon to catch this<br />\nspring.<br />\nManager Coulter explained the<br />\nschedule and urged every man to<br />\nbe present at the first practice to<br />\nbe held on Saturday afternoon.<br />\nSlips were then passed around on<br />\nwhich the men were asked to sign<br />\ntheir names and state their previous baseball experience, where<br />\nthey had played and what positions they had filled.<br />\nAmong the old men, who are in<br />\nthe\" University this year, are<br />\nDick Benson, Littman, Judefind,<br />\nwho pitched last year, Love also a<br />\npitcher, and Sickel, an outfielder.<br />\nThese are the only men who remain from last year's team.<br />\nAmong the new men out for the<br />\nteam are: Elmer Jones, star halfback of last fall's football team,<br />\nwho played in the outfield at City<br />\nCollege for several years and who<br />\nwas captain of the team last<br />\nspring; Jack Moriarty, an outfielder, and Louis Moriarity, a<br />\npitcher, both from Manchester<br />\nHigh School; Henry Lederer, a<br />\ncatcher, and Dallam a pitcher,<br />\nfrom Dunhams; Nelson, Carey,<br /><br />\nWith the beginning of the new<br />\nterm, the battalion, last week,<br />\ntook up a new phase of the training, the subject of \"Fire Direction<br />\nand Control.\" At the battalion<br />\nlecture, Major Guild pointed out<br />\nthe fundamental importance, in<br />\nan engagement, of the proper control and direction of fire. Under<br />\nthis head comes the designation<br />\nof sectors of fire, the determination of range, the designation of<br />\nobjective, the rate of fire—in fact,<br />\nall those elements which enter<br />\ninto the successful prosecution of<br />\nan engagement. One of the interesting exercises was the measuring of the extent of the objective by \"fingers.\" That is, the arm<br />\nis held out at full length, and the<br />\nwhole extent of the objective is<br />\nmeasured by the number of finger<br />\nbreadths necessary to cover it. At<br />\ndrill, therefore on the following<br />\n(lay, exercises in fire control<br />\nformed the main part of the drill.<br />\nEspecially the rate of fire was<br />\ntaken up. The men were instructed that firing at all ranges<br />\nis divided into three classes:<br />\nRanges over 1,000 yards; ranges<br />\nbetween 500 and 1,000; and<br />\nranges of 500 or under. In each<br />\nclass the rate of fire may be slow,<br />\nnormal, or fast. For each rate, at<br />\neach range, there is a definite<br />\nnumber of rounds per minute. The<br />\npractice at drill was in firing tin<br />\ncorrect number of rounds at the<br />\nvarious rates of fire, as determined by the captain's command<br />\n—for instance, range, 1,100 yards,<br />\nnormal fire.<br />\nThe results of the examination<br />\nin Military Science were very unsatisfactory; and it is known that<br />\nthe commandant was greatly disappointed in the showing of the<br />\nbattalion. There were several<br />\nhigh marks; but the average ot<br />\nthe battalion was only 6.5. In<br />\nview of the fact that the members<br />\nof the battalion did so poorly, the<br />\nexamination was made informal.<br />\nHereafter, however, the men will<br />\nbe held strictly responsible for all<br />\nwork taken up at lectures or in the<br />\nquiz sections.<br />\nThe class in Military Field Engineering received practical instruction in map sketching. After<br />\ntwice pacing a 500-yard course in<br />\n'of<br />\norder to determine the length<br />\nhis pace, each man constructed a<br />\nscale for his further use.<br /><br />\nLacrosse practice at the cage<br />\nhas produced encouraging results.<br />\nThe few veterans who are back<br />\nare showing flashes of the old-time<br />\nform, and several of the new men<br />\nare developing into real stars.<br />\nLine-ups and scrimmages are being held twice a week, and the<br />\ncoaches are beginning to get a line<br />\non the men in actual work in their<br />\nvarious positions. It also serves<br />\nthe purpose of affording a comparison between the attack and the<br />\ndefense, and helps in the building<br />\nup of a well-rounded team.<br />\nThe close defense is showing up<br />\nparticularly well. \"Fritz\" Sadtler, at goal, is learning rapidly,<br />\nand Jake Miller has shown that he<br />\ncan step in and take care of things<br />\nin a creditable manner. Frank<br />\nMorely, John Stanley and Cashell<br />\nare fighting it out for point and<br />\ncover point. All three are football men, heavy and aggressive;<br />\ntheir stickwork is improving with<br />\nevery practice. \"Dutch\" Schmidt<br />\nis playing first defense after the<br />\nfashion of the great Johnnie<br />\nHuck, who was about the best<br />\nman at that job anywhere to be<br />\nfound. \"Johnnie\" was in a class<br />\nall his own, and for four years<br />\nwas the mainstay of Hopkins' defense. Beall, Frisch, Golder, Kennedy and Defandorf, are the likeliest candidates for the mid-field<br />\ndefense. The mid-field attack has<br />\nbeen weakened by the absence of<br />\nCaptain Wolfe, who has been confine:1 to his bed with measles, but<br />\nWilliams, Jarrett, Kauffman, and<br />\nKennedy are showing up well, and<br />\nlearning fast. The close attack has<br />\nbeen greatly strengthened by the<br />\nshifting of Baxley from the defense to first attack. Stuart, Baker, and Gardner are being used<br />\nat the home positions. Winslow,<br />\nstar football man, who has been<br />\nout of the game with a badly swollen eye, is back in harness, and his<br />\nspeed and fight are going to be a<br />\ngreat help to the attack.<br /><br />\nMr. Kistler's class in fencing is<br />\nprogressing at an encouraging<br />\nrate, considering the lack of equipment. Major Guild watched the<br />\nmanoeuvers for a while last Wednesday and expressed himself as<br />\nbeing much pleased with the facility with which the men have<br />\ncaught on to the intricate movements of fencing.<br />\nThe class now numbers about 10,<br />\nto whom lessons are assigned for<br />\nhome study. The candidates must<br />\nnot only know these lessons, but<br />\nmust write out the substance of<br />\nthem from memory and hand them<br />\nto the instructor. Foils and masks<br />\nhave been ordered and are expected in a few (lays. Then the<br />\nreal work of \"assaults\" or fencing<br />\nmatches will begin in earnest. Already the men have been paired<br />\noff and several interesting matches<br />\nhave taken place. All the candidates attest that it is most strenuous exercise but very interesting.<br />\nFive classes have been held to<br />\ndate; they have been held every<br />\nWednesday and Friday except<br />\nduring examination week. These<br />\nWednesday and Friday classes in<br />\nfencing will continue throughout<br />\nthe year, including broadsword<br />\nand bayonet work after the foil<br />\nhas been mastered. The men selected by Mr. Kistler will become<br />\nfencing instructors for the battalion, for a thorough course in<br />\nthis art will be instituted in the<br />\nentire corps next year. Those men<br />\nshowing up well so far are Davis,<br />\nTownsend, Dougherty, Evans, De<br />\nMarco, Bowen, Porter, Coleman,<br />\nMa<br />\nn<br />\nad<br />\nBresee. Selected<br />\nmen from this group will form a<br />\nnucleus, around which a fencing<br />\nteam will probably be built for<br />\nnext year.<br />\nHopkins Man Wins Majority.<br /><br />\nMajor .1. Newman Numsen, having finished the three - month<br />\ncourw in the \"school of fire\" at<br />\nFort Sill, Oklahoma, in record<br />\ntime, has returned to his command<br />\nat Camp McClellan, Anniston,<br />\nSmall Boy (proudly)—My sis- Alabama.<br />\nMajor Numsen, who graduated<br />\nter's in the movies.<br />\nDitto Girl (scornfully)—Huh, in 1909 with the degree of A. B.,<br />\nmy ma's there all the time.— was formerly a member of the<br />\nFifth Regiment and saw active<br />\nLamb.<br />\nservice on the border as captain<br />\nof Company D. Shortly after he<br />\nreturned from the border, he was<br />\nBOOKS WANTED FOR CAMP<br />\npromoted to the rank of major and<br />\nMEADE LIBRARY<br />\ntransferred to the Field Artillery.<br />\nScientific, Technical, MathHe—Darling, I would go to the<br />\n\"I wish I had a baby brother<br />\nematical and Modern language<br />\nend of the world for you.<br />\nto wheel in my go,cart, mamma,\"<br />\ntexts are much in demand<br />\nShe—The question is, would you<br />\ncomplained small Elsie. \"My dolls<br />\namong the soldiers who are takare always.getting broke when it<br />\ning examinations for commisgo to the end of your resources?<br />\ntips over.\"<br />\nsions, or who are desirous of<br />\nKaiser—I viii now review der<br />\nlearning the languages \"over<br />\nFifth Army Corps.<br />\nthere.\" Books may be sent to<br />\nTrew, Brimer, J. M. Jones, Taylor,<br />\nMajor — Highness, since the<br />\nthe Peabody Institute or left at<br />\nDe Marco, Greenbaum, Winn,<br />\nglorious victory yesterday over the<br />\nthe Hopkins Library.<br />\nEvans, Keyes, Welliver, L. Cattailhated English der ain't no corps!<br />\nach, Oakley, Webb and Rodgers.<br /><br />\nTHE JOHNS FIOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br />\n— AMUSEMENTS —<br /><br />\nFORD'S<br />\nTonight at 8.15, 25c to $1.50<br /><br />\nTOCQUEVILLE CONTEST TRY-OUTS<br />\nWill Be Held in Donovan Room on<br />\nMarch 1 — Intercollegiate Debate<br />\nand Adams Contest Postponed to March 16.<br /><br />\nLAST WEEK<br />\nOf the Most Wonderful Play in America<br /><br />\nEXPERIENCE<br />\nBy Geo. V. Hobart<br />\nEconomic Prices<br />\nMatinees Friday and Saturday<br />\nBest Seats, $1.00<br />\nNEXT WEEK—Seats on Sale<br />\nLOU TELLEGEN in BLIND YOUTH<br /><br />\nACADEMY<br />\nTonight at 8.15, 25c to $2.00<br />\nKlaw &amp; Erlander present<br />\nThe Delightful Fantastic Spanish<br />\nMusical Review<br /><br />\nTHE LAND OF JOY<br />\nThe Most Wonderful Dancing<br />\nShow in America<br /><br />\nBuy<br />\nU.S.<br />\nWar<br />\nSavings<br />\nStamps<br />\nFor Sale at the<br />\nTreasurer's Office<br />\nin Gilman Hall<br /><br />\n7<br /><br />\nOVERCOATS that will please<br />\ncollege men — $15 to $30 — at<br />\nBaltimore's Best Store.<br /><br />\nThe date for the preliminary<br />\ntrials for the Tocqueville contest<br />\nhas been officially announced by<br />\nDr. French to be Friday, March 1,<br />\nthe try-outs will be held in the<br />\nDonovan Room. The subject prescribed for the 1918 contest is<br />\nA. H. FETTING<br />\ndrawn from contemporary history.<br />\nMANUFACTURER OF<br />\nIt is \"French Democracy Under<br />\nthe test of War.\" Suggested sub- Greek Letter Fraternity Jewelry<br />\ntopics suitable for discussion are<br />\nFactory,<br />\nN.LIBERTY ST. 212 Little Sharp St.<br />\npresented by the committee as fol- 213Headquarters<br />\nfor the J. H. U.Seal Pins.<br />\nSpecialdesigns and estimatesfurnished on class<br />\nlows:<br />\npins,rings, medals for athletic meets,etc.<br />\n\"Was the French Republic Prepared?\"<br />\n\"The Republic and Its Allies.\"<br />\n\"The Capital in Danger.\"<br />\n\"The National Morale.\"<br />\n\"The French Parliament and<br />\nThe utmost<br />\nWar Administration.\"<br />\nin style, fit<br />\n\"Alsace-Lorraine; History and<br />\nand service.<br />\nSentiment.\"<br />\n\"The War and Religious Controversy.\"<br />\nA five-minute speech on one of<br />\nthese sub-topics (or a similar<br />\nphase of the main topic) will be<br />\nadequate for the preliminary trial.<br />\nThe Interclass Debate, which<br />\nwas scheduled to take place on the<br />\nevening of February 21, has been<br />\npostponed to Saturday, March 16.<br />\nThe contest in public speaking for<br />\nthe Adams medal will be held immediately before the debate.<br /><br />\nkcitiodua,sk-knet<br /><br />\n\"Why did they pinch Terry<br />\nToad?\"<br />\n\"Oh, he simply wouldn't observe<br />\nflyless day,'\"<br />\nyou think fishing is<br />\nhealthy exercise?<br />\nGill—Sure thing.<br />\n\"Where does the exercise come<br />\nin ?\"<br />\n\"Digging the worms.\"<br />\n\"Ila, were you • „rich when<br />\nmamma married you?\"<br />\n\"No, my dear.\"<br />\n\"Well; papa, what was it, then,<br />\ndo you think, that mamma married yoh-for?\"<br />\n\"Young man,\" said an inquisitive old lady to a tram conductor,<br />\n\"if I put my foot on that rail shall<br />\nI receive an electric shock?\"<br />\n\"No, mum,\" he replied, \"unless<br />\nyou .place your other foot on the<br />\noverhead wire!'<br /><br />\nR. Q. TAYLOR &amp; CO.<br />\nHats, Umbrellas, Canes, Gloves,<br />\nand dnglish Raincoats . . .<br />\n18 E. BALTIMORE STREET<br /><br />\nSCHARWENKA—LEEFELD<br />\nMusic Studios<br />\nSEABOARD BANK<br /><br />\naARROW<br />\nform-fir<br /><br />\nCharles and Preston Streets<br /><br />\nCOLLAR<br /><br />\nAPPOINTMENTS BY MAIL<br /><br />\nLEFRANC &amp; AULT<br /><br />\ncTHE DRUG STORE<br /><br />\nMEN'S<br /><br />\nGLOVES<br />\nNECKWEAR<br />\nHOSIERY<br /><br />\n\"SHIRT SHOP II<br />\n421 N. Howard St., at Franklin<br /><br />\nWW2<br /><br />\nfor the<br />\nH. U. Students and Faculty<br /><br />\nW. L.. Campbell &amp; Co.<br />\nUniversity Parkway, at Charles Street<br />\n(OPPOSITE J. H. U. ATHLETIC STADIUM)<br />\nThe Co-operative Drug Store for the J. H. U.<br />\nIJ A U.S. Government Postoffice at your disposal.<br />\n1,1 Use us in any capacity. Use the store while<br />\nwaiting for your cars to and from the city.<br />\nAnything you need,\"WE GET IT for you.<br />\ntj Your taste is congenial with our Soda, Cigars,<br />\nCandy, Etc.<br /><br />\nJ<br /><br />\nYoung Men's Finest Suits and Overcoats<br />\nHAMBURGER<br />\nSTYLES<br />\nTHE<br /><br />\nARE<br /><br />\nHamburgers'<br /><br />\nNEWEST<br /><br />\nBaltimore and Hanover Streets<br /><br />\nYOUNG<br /><br />\nMEN'S<br /><br />\nFURNISHINGS,<br />\nHATS,SHOES,ETC.<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br /><br />\n8<br />\nTHE COLLEGE MAN AND THE WAR<br /><br />\nCOMMEMORAT1OM EXERCISES<br /><br />\n(Continuedfrom page 1)<br /><br />\n(Continued from Page I)<br /><br />\nSIDELIGHTS ON HOPKINS GAMES<br />\n(From Games Committee.)<br /><br />\nThey are camouflaging the<br />\nof an Acting Chaplain in the Boches this week at the Fifth RegUnited States Navy after he re- iment Armory, and the picked<br />\nmen from Camp Meade are getting<br />\nceives his degree.<br />\nwill<br />\nbegin ready for the trench assault on<br />\nexercises<br />\nThe<br />\npromptly at 11 o'clock and will Saturday evening. The Johns Hopclose prcibably before 1 o'clock. kins games Committee has received<br />\nThe battalion will march from the acceptance of Gen. Wm. NichHomewood to attend the exercises olson, commandant at Admiral, as<br />\nhonorary referee for the indoor<br />\nat McCoy Hall.<br /><br />\ndimmed by contact with the rough<br />\nrealities of life, share with him his<br />\nwisdom, his intuition and his inspiration, that we, also, where<br />\nnecessary, shall be likewise willing<br />\nto give our lives for truth, liberty<br />\nand justice to the end that the<br />\n' be saved for a free<br />\nworld shall<br />\nhumanity.<br /><br />\n_<br /><br />\n••••••••••••<br /><br />\n-CIGARETTE<br /><br />\nPACKAGES<br />\n601<br />\nTENS AND<br />\nTWENTIES<br /><br />\n•••.<br />\n••••.<br /><br />\n-•••.<br />\n••••<br /><br />\nNot by accident is Murad<br />\nthe greatest selling cigarette in<br />\nAmerica.<br />\nSOMETHING did it. What?<br />\nGoodness—that's all. Unchanging, unmistakable,inimitable, irresistible, Goodness.<br />\nFor further particulars—<br />\nt944dr<br /><br />\nittA<br />\n— any.<br />\neWa<br />\nl<br /><br />\n25 Cenzteigraiattl<br />\nAgz.tglAki<br />\nP;4.e,; Grade Turkish<br />\nMakers of<br />\nand Egyptian Ciocrclics in the World<br /><br />\nREMEMBER—<br />\nTurhish tobacco 13<br />\nthe world's most<br />\nfamous tobacco for<br />\ncigarettes.<br /><br />\nmeet. General Nicholson, together<br />\nwith Colonel Sweezey, of the Three<br />\nHundred and Thirteenth Regiment, have expressed great interest in the attack on the German<br />\ntrenches and have ordered an entire company to come to Baltimore for the event. This will be<br />\nthe first time that the general<br />\npublic has seen a realistic presentation of the most thrilling maneuver that the soldiers have. General Nicholson is anxious that<br />\nBaltimore should appreciate the<br />\nspirit of .the National Army, and<br />\nhis personal presence assures a<br />\nmost savage assault on the poor<br />\nBoches.<br />\n\"Trench and Camp,\" the, newspaper issued at Camp Meade, is<br />\nfeaturing the relay with Camp<br />\nDix. The Marylanders have been<br />\nanxious to get revenge for the<br />\nfootball defeat last fall, but the<br />\nNew Jersey people are sending<br />\ndown a team that lead eight service teams in the recent Milrose<br />\nmeet, with J. Howard Berry, the<br />\ngreat Penn athlete as anchor man.<br />\nThe colleges have entered teams<br />\nin greater numbers than even in<br />\n1917, partly due to the fact that<br />\nthe Johns Hopkins has dared to<br />\nstage a meet—which is thp -only<br />\none in the Middle South. The feature relay is between the University of Pennsylvania and its old<br />\nrival, Cornell the distance is two<br />\nmiles. Penn has two other relay<br />\nteams, and it is rumored that<br />\nGeorgia. Tech may , meet one of<br />\nthem. The Penn squad consists of<br />\n20 men.<br />\nGeorgia Tech is sending a team<br />\nNorth for the first time and the<br />\ncoming of Strupper and Guyon,<br />\nthe Indian, is in itself an event.<br />\nEverybody has read of the feats<br />\nof the two on the football field;<br />\nbut Strupper alone took over 10<br />\nfirsts in the short distances and<br />\nhurdles in 1916 and 1917 in the<br />\nSouth. He will have to fight his<br />\nway in the 220—open against such<br />\nmen as Sherman Landers, University of Pennsylvania; Tommy McDonagh; the very fast George C.<br />\nGriffin, also of Georgia Tech; Dan<br />\nBratt, of Hopkins; and Mitchell,<br />\na Western Star, running under<br />\nthe Baltimore Athletic Club.<br />\nThe hurdles will have entered<br />\nGuyon, Landers, McDonagh, Erdman, Princeton's flyer, as well as<br />\nGates of Georgetown. Cornell is<br />\nsending down Dresser, the intercollegiate cross-country champion;<br />\nbut he will be forced to the limit<br />\nby Weeks, who has been in training to repeat his last year's victory and by Raymond, of Princeton.<br />\nSherman Landers has set up the<br />\nrecord of 12 feet 8 inches in the<br />\npole vault; he was interscholastic<br />\nchampion then; but this year he<br />\nwill meet James Johnston, Twenty-third United States Engineers,<br />\nformerly of the Olympic Club, of<br />\nSan Francisco. Princeton has the<br />\ninter-collegiate shot-putting chainpion in Sinclaire; but Guyon is on<br />\n(Continued on page 9, col. 2)<br /><br />\nTHE JOHNS HOPKINS NEWS—LETTER, FEBRUARY 18, 1918.<br /><br />\nTHE NEWS-LETTER'S MAIL BAG<br /><br />\nnot attend it. If chapel has an excuse for existence, the attendance<br />\nA Column in Which the Correspondents should be better; if not it should<br />\nbe entirely dispensed with.<br />\nAre Allowed Latitude, but Shoulder the Responsibility.<br />\nHowever, the. remedy for this<br />\nlack of interest is easily seen. It<br />\nis this: Chapel exercises should<br />\n• All letters intended for publication must<br />\nbe instituted as a regular course<br />\nbe concise.<br />\nand a set time _at which every one<br />\nNo attention will be paid to anonymous<br />\nletters, but names signed as an evidence of<br />\nmust attend or else lose points<br />\ngood faith will not be printed if request is<br />\nmade that they be omitted.<br />\ncounting<br />\ntoward graduation should<br />\nThe publication of' a letter is not to be<br />\nbe determined. If this plan were<br />\ntaken as an indorsement of its views by THE<br />\nNEWS-I,ErrER, which invites the freest discarried out, without doubt the<br />\ncussion of matters of general interest.<br />\nchapel would soon come to be a<br />\nconnecting link between the facAdvocates Substitute for Class Rush.<br />\nulty and the student body, openTo the Editor of THE NEWS-LETTER:<br />\ning an avenue of--information for<br />\nSir—Afterthe Sophomore-Fresh- which the bulletin board is but a<br />\nman classic some few months back, poor substitute.<br />\nI was thinking of a plan whereby<br />\nMany other reasons could be<br />\nthe winnei. could be determined<br />\ngiven<br />\nfor the desirability of such a<br />\nmore easily and with more cerchapel,<br />\nbut they are too evident to<br />\ntainty. It is the custom at the require<br />\ndiscussion here. So let's<br />\nleading colleges of the East to cultogether<br />\nget<br />\nand, perhaps by the<br />\nminate the spirit of rivalry in a beginning of the next<br />\nschool year,<br />\nThemain<br />\ntussle.<br />\ngeneralfree-for-all<br />\nhave<br />\nshall<br />\na<br />\nwe<br />\nchapel<br />\non a syspurpose of the •scrap is to tear tematic basis with an<br />\nattendance<br />\nparthe<br />\nall the clothing from all<br />\nof the entire student body.<br />\nticipants. The slight advantage in<br />\nE. D.,'21.<br />\nage and weight which is enjoyed<br />\nFebruary 13, 1918.<br />\nby the second year students is balanced against the superior numSIDELIGHTS ON HOPKINS GAMES<br />\nbers of the underclassmen, and<br />\nthe contest is usually evenly<br />\n(Continued from page 8)<br />\nmatched.<br />\nIn order to remedy this state of his trail; and Hopkins is counting<br />\naffairs inthe future, I should Sug- on Leadbetter.<br />\ngest that a game of pushball be<br />\nThe open events are noticeably<br />\nsubstituted. Perhaps, some of your well-balanced this year, but there<br />\nreaders, have seen, either in the may be some dark horses among<br />\nmovies or elsewhere, that this the 50 or more entries from Camp<br />\nplan is used to decide supremacy Meade; the scholastic events are<br />\nbetween the second and first year to be fast going, for in addition to<br />\nclasses in colleges of the Middle the Baltimore schools Shehan, the<br />\nWest. The way the affair is con- old Central High School sprinter,<br />\nducted at present makes it a dif- is representing Princeton Preparaficult task for the.judges, after the tory School; and Tome, Episcopal<br />\n(lust has cleared, to select the side High School, and Briarly Hall<br />\nwhich deserves the decision. Be- have particularly large entry lists.<br />\nsides having all the thrills and en- Seward and the 'other' Pendleton,<br />\njoyments of the present method, a of Episcopal High School, have<br />\ngame of pushball would enable the past records that distinctly chalwinner to be chosen with much lenge Weedon of Poly and McNaLEVY, '21.<br />\nmore facility.<br />\nmara of the Technical High<br />\nSchool of Washington.<br />\nWants Compulsory Chapel.<br />\nTo the Editor of THE NEWS-LETTER:<br /><br />\nSir—If there is one thing in<br />\nconnection with the Johns Hopkins University that needs correction more than another, it is the<br />\npoor attendance at the chapel exercises conducted by the V. M. C.<br />\nA. Certainly, they are held at an<br />\ninconvenient time, the lunch hour<br />\nfor most students, and no definite<br />\ninducement to attend is offered.<br />\nThat is, points are not granted for<br />\nattendance, time that could be<br />\nspent in scholastic work is occupied, and, perhaps most important<br />\nof all, the exercises do not appear<br />\nto have any connection with the<br />\nUniversity proper. It is very<br />\nlikely that the seeming indifference of the University authorities<br />\nis responsible for the absence of<br />\nso many. But.whatever the cause,<br />\nthis has been the state of affairs<br />\nfor some time and seems likely to<br />\nremain so. The students appear to<br />\nregard the chapel with indifference; they say nothing derogatory<br />\nin regard to it, but still they do<br /><br />\nWillie—Mamma,have I ever had<br />\nthe adults?<br />\nMa—What clo you mean?<br />\nWillie—It says on my medicine<br />\n\"one teaspoonful for adults.\"—<br /><br />\nGREATEST ARMORY MEET EVER<br /><br />\n9<br /><br />\nr<br /><br />\nCollar - Hug Clothes<br /><br />\n(Continued from fiage I)<br /><br />\na very good account of itself. The<br />\nrelay team will be composed of<br />\nCaptain Firor, Bev. Smith, Driver<br />\nand Van Ness, with Winslow as<br />\nalternate. These men will also<br />\ncompete in the 100, 220, and 440<br />\nopen and South Atlantic, with the<br />\nexception of Captain Firor, who<br />\nis entered in the two high jumps<br />\nand hurdles. Besides the men mentioned above Bratt, Seagrave, Mullikin, and Leadbetter are expected<br />\nto gather in points for Johns Hopkins.<br />\nThe complete list of Hopkins entries is given below.<br /><br />\nSpring Styles<br />\nin suits, coats and furnishings,<br />\nwith all the \"go\" characteristic<br />\nof everything that comes from<br /><br />\nTHE QUALITY SHOP<br />\nBALTIMORE AND LIBERTY<br />\nMilitary Headquarters<br /><br />\nHENDERSON'S<br />\nBaltimore's Most Popular Price Stationers<br /><br />\n229 N. HOWARD STREET<br />\nSTUDENTS' NOTE BOOKS also<br /><br />\n100-Yard Open—Winslow, Driver,<br />\nVan Ness, Bratt, Mossom, Ebeling, LOOSE LEAF NOTE -BOOKS<br />\nat. POPULAR PRICES<br />\nFischer and Burke.<br />\nto<br />\n220-Yard Open—Winslow, Van Ness, 50 Engraved<br />\nCards and Plate, Script Engraving, 70c<br />\nMerriken, Haseltine, Torsch, Mossom,<br />\n50 Engraved Cards from Plate, - • - • 40c<br />\nBratt, Ebeling and Fischer.<br />\n440-Yard Open—Merriken, Haseltine, Class and Fraternity<br />\nClass Pin Dies for<br />\nTorsch, Mulliken, Mossom, Fischer<br />\nStationery made Free of Charge<br />\nand Burke.<br />\n880-Yard Open—Norwood, Haseltine, HEADQUARTERS for CRANE'S FINE. PAPERS<br />\nMulliken and Lord.<br />\nJ. W. BREEDLOVE &amp; CO.<br />\nOne Mile Open—Rivkin and Mulli- (Wilbur F. Parker<br />\nAndrew NUklas)<br />\nken..''<br />\nrIERCHANT TAILORS<br />\n100-Yard - Hurdles Open—Seagrave,<br />\nSNAPPY COLLEGE CLOTHES<br />\nFiror, Cronin and Burke.<br />\nRight Prices<br />\nPole Vault • Open—Seagraye.<br />\nIll N. Charles St.<br />\n(Second Floor)<br />\nHigh Jump Open—Firor and NorSAMPLES CHEERFULLY GIVEN<br />\nwood.<br />\nShot Put Open—Leadbetter.<br />\n100-Yard S. A. I. A. A.—Winslow,<br />\nDriver and Bratt.<br />\n440-Yard S: A. I. A. A.—Smith and<br />\nFischer.<br />\n880-Yard S. A. I. A. A.—Rivkin and<br />\nMulliken.<br />\nOne Mile S. A. I. A. A.—Rivkin and<br />\nMulliken.<br />\n100-Yard Hurdles S. A. I. A. A.—Seagrave, Firor and Cronin.<br />\nShot Put S. A. I. A. A.—Leadbetter.<br />\nPole Vault—Seagrave.<br />\nHigh Jump—Norwood and Firor.<br />\nSee us for Shoes, Lacrosse Gloves<br />\nand other equipment<br />\nThe military<br />\n•<br /><br />\nTRACK SUPPLIES and<br />\nLACROSSE SUPPLIES<br /><br />\nfeatures of the<br />\nmeet include an intercompany relay and an intercompany wallscaling contest, open to Companies<br />\n\"A,\" \"B,\" and \"C\" of the Hopkins<br />\nBattalion. There will also be a<br />\nbayonet drill by a detail of selected men from Camp Meade. Brigadier - General Nicholson and<br />\nColonel Sweezey of \"Baltimore's<br />\nOwn\" have accepted invitations to<br />\nattend and serve as honorary officials.<br /><br />\nMcCALLISTER'S<br />\n(Eat. 1S94<br /><br />\nBaltimore's Best Athletic Store<br />\n221 W. BALTIMORE ST.<br />\nBALTIMORE, MD<br /><br />\nJ. Trockenbrot &amp; Co.<br />\nGOLD AND SILVERSMITHS<br />\n.•.<br /><br />\nJ. H. U. Seals and Pins .•.<br /><br />\nWidow.<br /><br />\n324 W. SARATOGA STREET<br /><br />\nCornell—Thirty future mechanical engineers from the senior<br />\nclass will begin government work<br />\nin the shipyards at Wilmington,<br />\nDel., on February 4. They will<br />\ncontinue their studies, having lectures four nights a week. Twentyeight seniors in electrical engineering will go to Schenectady to<br />\nwork for the government. All will<br />\nreturn to Ithaca in May to receive<br />\ntheir diplomas.<br /><br />\n\"May I see Barker, please?\" she<br />\nasked at the hospital. She was<br />\nvery pretty.<br />\n\"We don't allow anyone but relatives to see the patients. Are you<br />\na member of his family?\" asked<br />\nthe matron.<br />\n\"Why, yes,\" she answered blushingly. Then boldly: \"I'm his sister.\"<br />\n\"Oh, really,\" answered the matron, \"I'm so glad to meet you.<br />\nI'm his mother.\"—Lehigh Burr.<br /><br />\nGEO. DOEBEREINER<br />\nTottfrrtionrr<br />\nMt. Vernon 3110-3111-1754<br /><br />\n29 E. NORTH AVE.<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards—Invitations<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER — PRINTER — STATIONER<br />\n229 N. Charles Street<br /><br />\nComplete Assortment of Men's Fine Shirts<br />\nFinest Qualities<br /><br />\nHUTZLER DIVITIEM J<br /><br />\nModerate Prices<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 18, 1918.<br /><br />\n10<br /><br />\nHOPKINS MAN HONORED IN MEXICO<br /><br />\nIf price is secondary, and goodlooking \"kicks\" the main object,<br />\nthe Hess line will strike you just<br />\nright. Come here for individuality and styles that look the price.<br /><br />\nN. HESS' SONS<br /><br />\nBALTIMORE ST.<br /><br />\nMilton P. Henneman<br />\nLibrary Bookbinder<br />\n309 West Mulberry Street<br />\nC. &amp; P. Telephone<br /><br />\nWyman's<br />\nMen's<br />\nShoes<br /><br />\nThe Largest &amp;<br />\nMost Complete<br />\nStock of Shoes<br />\nin Baltimore.<br />\nEvery Wanted<br />\nStyle in Comfort and Orthopedic Shoes.<br />\nSole Agent for<br />\nthe Johnston &amp;<br />\nMurphy Shoes.<br /><br />\nRegistrar Ball has recently received a letter from Dr. William<br />\nE. Gates, A. B.,'86, who is now in<br />\nMexico, and who tells of his appointment as honorary professor<br />\nin the National Museum of Mexico. He says: \"Under present conditions I am especially glad to receive this honor, as being the only<br />\nAmerican, and the nomination being accounted as the highest that<br />\ncan be conferred In Mexico. Special exploration privilege for a<br />\nterm of years in some of the most<br />\nimportant ancient ruined cities<br />\nhave also been granted me, and,<br />\nwith the soon-to-be-expected complete pacification of the country,<br />\nI hope it will be possible to do important work.\"<br />\nThe officio, which tells of his appointment, speaks of Dr. Gates as<br />\nbeing the first American to be signally honored and his \"valuable<br />\nstudies in archaeology, ethnology,<br />\nand anthropology\" and \"his most<br />\ncomplete and notable works on<br />\nthe ruins of Yucatan.\"<br />\nENGLISH INSTRUCTOR LEAVES<br /><br />\nFrancis E. A. Litz, graduate<br />\nstudent of the Johns Hopkins University and instructor in Public<br />\nSpeaking and English ComposiSHIRTMAKER<br />\n226 N. Liberty St. tion in the undergraduate departJust arrived—Large line New Shirtings. ment, has left the University to<br />\nPrices, $2.25, $2.75, $3.25. Less 10%<br />\naccept a secretaryship with the<br />\ncash 30 days.<br />\nDon't forget us on Knights of Columbus at Camp<br />\nUnderwear, Neckwear, Hosiery Meade. Mr. Litz received his<br />\nBachelor of Arts degree at St.<br />\nMary's Seminary of Baltimore in<br />\n1912 and his Master of Arts de23 S. HANOVER ST.<br />\ngree in 1914. During the colBALTIMORE, MD.<br />\n• legiate year of 19154916 he was a<br />\nPrinters of Philological and fellow in the Johns Hopkins University in English, Latin, and<br />\n- Scientific Works<br />\nPhilosophy. He expected to reAmong the publications printed by us are: The<br />\nPublications of the Modern Language Association<br />\nceive his Doctor of Philosophy deof America, \"Johns Hopkins University Circulars,\"\"Modern Language Notes.\"\"Maryland Hisgree in June, but asked that this<br />\ntorical Magazine,\" 'University of North Carolina<br />\nStudies in Philology\" and many other works of<br />\nbe postponed in order that he<br />\nsimilar character. Special attention given to the<br />\nmight take up the work at Camp<br />\nprinting of<br />\nMeade. Mr. Litz was appointed<br />\nDOCTORS' DISSERTATIONS<br />\nIn Greek. Latin. Anglo-Saxon, Old English, and instructor of public speaking and<br />\nRomance and Germanic Languages.<br />\nEnglish composition in the undergraduate department for the year<br />\nES COVI<br />\nstND and<br />\nCollege Text-Books<br />\n1917-1918. Upon his withdrawal<br />\nlast<br />\nweek his public speaking<br />\nSMITH'S BOOK STORE<br />\nclasses were taken over by Mr.<br />\n805 N. HOWARD ST.<br />\nUhler and his English composition<br />\n2 Doors Above Madison<br />\nclasses by Dr. French.<br />\nAgent for the Harvard Loose-Leaf Note Book<br /><br />\n19 Lexington St.<br /><br />\nSTRATTON<br /><br />\nJ. H. FURST Co.<br /><br />\nTHE CUCKOO SHOP<br />\nGuilford and Thirty-First<br />\n,<br /><br />\nCIGARS, CIGARETTES &amp; TOBACCO<br />\nCANDY<br />\nMAGAZINES<br />\nFULL LINE OF CANNED GOODS<br /><br />\nORTMAN'S<br />\n\"Queen Quality\" Home-Made Candies<br />\n50c. a pound<br /><br />\nEvery Piece a Pleasant Surprise<br /><br />\nThe Flirt—For an army officer,<br />\nyou are not very venturesome.<br />\nShy Suitor—I belong to the reserves.<br />\nTownley—Was your garden any<br />\ngood this year?<br />\nSubbubs—You bet it was. It enabled our next door neighbor's<br />\nchickens to take first prize at the<br />\npoultry show.<br /><br />\nJohns Hopkins Cotillon Club<br /><br />\n2nd COTILLON<br />\nwill be<br /><br />\nThe<br />\nNorman Remington Cot<br /><br />\nFriday, March 1st<br />\nDancing. 9 to 12.30<br /><br />\nInformal Dancing. 8.30 to 9<br /><br />\nSubscription, $2.00<br /><br />\nBOOKS<br /><br />\nYou're Interested In<br />\nEvery Student Should Own<br /><br />\n3d COTILLON—MAY 4<br /><br />\nSend Your Name for Monthly List<br /><br />\nSERIES OF LECTURES ON WAR<br /><br />\nCharles Street, at Mulberry<br /><br />\n(Continued from page 1)<br /><br />\nfounders of the League to Enforce<br />\nPeace, has recently written \"A<br />\nLeague of Nations,\" a review of<br />\nthe plan of a league of nations,<br />\nwhich was reviewed in a recent<br />\nnumber of THE NEWS-LETTER.<br />\nThe dates and subjects of the<br />\nlectures.follow:<br />\nWednesday, February 27—Prof.<br />\nJ. H. Latane, \"The Tradition of<br />\nAmerican Isolation.\"<br />\nFriday, March 1—Prof. W. W.<br />\nWilloughby, \"The German Theory<br />\nof the State.\"<br />\nWednesday, March 6—Prof. W.<br />\nW. Willoughby,\"The German System of Government.\"<br />\nFriday, March 8.—Prof. Vernon<br />\nL. Kellogg, \"The Germans in Belgium and France.\"<br />\nWednesday, March 13 — Dr.<br />\nWinford Smith, \"Medical Aspects<br />\nof the War.\"<br />\nFriday, March 15—President F.<br />\nJ. Goodnow, \"The War and the<br />\nFuture of the Far East.\"<br />\nWednesday, March 20. — Mr.<br />\n• Theodore Marburg, \"Plans for<br />\nPermanent Peace.\"<br />\nEnthusiastic He—She was as irresistible as a five-dollar bill on<br />\nthe sidewalk.<br />\nSarcastic She—You simply had<br />\nto pick her up, huh ?—Orange<br />\nPeel.<br /><br />\nMEN'S AND YOUNG<br />\nMEN'S CLOTHING<br />\n• AND FURNISHINGS<br />\n—correct in style<br />\n—high grade in quality<br />\n—moderate in price<br /><br />\nSTEWARTIcor<br />\nI. CoutetWm 1Votl blown<br /><br />\nWe give Surety Coupons and redeem them in<br />\nour own merchandise<br /><br />\nTHE HATTERIE<br />\nHats of Quality<br />\n29 BALTIMORE ST., EAST<br />\nOne Door West of Light Street<br /><br />\nSole Agents for Baltimore for College Fraternity Bands (Greek Letter Societies).<br /><br />\nLaw School of the<br /><br />\nUniversity of Maryland<br />\nHon. Henry D.Harlan, LL. D., Dean<br />\nFormer Chief Judge Supreme Bench of Baltimore<br />\nCity<br /><br />\nAfternoon and Evening Sessions<br />\nFor catalogue apply to<br />\nEDWIN T.DICKERSON,Secretary.301 St. Paul St<br /><br />\nR.E.D.U.G.E.r)<br />\n4*<br /><br />\n/1<br /><br />\norirtg<br />\niBrattii<br />\nentimi<br /><br />\nVISIT OUR ICE CREAM PARLORS<br />\n227 N. HOWARD STREET<br /><br />\nHOTEL EMERSON<br />\nBaltimore and Calvert Sts.<br />\nBaltimore's Newest and Most Complete Hotel<br />\nJOHN J. KINCAID<br /><br />\n\"That fellow's talking,\" exclaimed Mr. Comrox,\"makes me think<br />\nof certain styles of 'classical music.'\"<br />\n\"In what way ?\"•<br />\n\"It sounds all wrong, but he can<br />\ngive you such an argument you<br />\ndon't dare say so.\"<br /><br />\nPe ! 7 HI. Hub<br />\nBaltimore, Charles<br />\nand Fayette<br /><br />\n.<br /><br />"}], "field_media_file": [{"target_id": 37349, "display": null, "description": null, "target_type": "file", "target_uuid": "15807435-f958-4810-ba45-8ddc981969f2", "url": "http://digital.library.jhu.edu/system/files/2022-03/12864-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12864, "target_type": "node", "target_uuid": "77f0d057-9bf7-49fd-83b7-63668a182de5", "url": "/node/12864"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c7101e26-e91b-4c20-9727-72d7f404e14a"}]}