{"mid": [{"value": 37001}], "uuid": [{"value": "5340c9e3-e6ed-4828-ad9e-0143e6192804"}], "vid": [{"value": 37001}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:44+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13134-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:44+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:44+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "DE<br />\n<br />\nVOL. XXIX, No 4<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 14, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nOVER ONE HUNDRED STORM<br />\nJOHNS HOPKINS, SELF-EDUCATED, REALIZED<br />\nOPENING MEETING OF<br />\nVAST IMPORTANCE OF COLLEGE TRAINING<br />\nMUSCIAL CLUB '<br />\n7<br />\nTo familiarize the undergraduate body, and outside readers, with the<br />\nearly days when the Johns Hopkins University was first a dream and Keen Competition Expected For Quarthen an experiment, the News-Letter here begins a series of articles on<br />\ntet; Japanese Tenor Among<br />\nTalented Candidates<br />\nWatchful Waiting Brings Blue Jay Eleven Victory in Annual EnHopkins' history. The first article describes the life and character of<br />\nThe<br />\n_1<br />\nohns<br />\nMusirn1<br />\nHopkins<br />\ncounter with Mountaineers<br />\nJohns Hopans,-the originator, the founder.—Editor's Note<br />\nClub, under the supervision of<br />\nPlaying wide-awake, though somewhat colorless football, the Hopwinter picked up what scant eduMr. Hobart Smock, got off to a kins eleven administered a glowing coat of whitewash to the Mt. St.<br />\ncation the county schools offered,<br />\nwonderful start Thursday night, Mary gridders last Saturday at Homewood, while rolling up 21 points<br />\nusing this to tutor his younger<br />\nSeptember 9, when President themselves. Although the Emmitsburgers registered four first downs<br />\nbrothers and sisters. Too, he was<br />\nTilghman called the meeting to they really threatened the Black and Blue's goal line<br />\nbut once. In the<br />\nvery fond of reading. All the order<br />\nthere were sixty-one candi- second period Mt. St. Mary's had the ball on Hopkins'<br />\nF.ET5<br />\n8-yard line, as<br />\nbooks within reach by horseback, dates<br />\nfor the Glee Club and forty- the result of two successive 5-yard penalties. Here,<br />\nhowever, the line<br />\nhe found and absorbed, particularly seven for the Banjo<br />\nClub present. held for three downs .and Turnbull quickly punted out<br />\nof danger when<br />\nthe works of Shakespeare, histor- Among them were several<br />\ntalenties, and biographies. All his life he ed and promising new men. In the Saints fumbled.<br />\nBlocked Kicks Figure<br />\nread much for books were,the only the Glee Club one of particular<br />\nHopkins' three touchdowns<br />\nreal and thorough education he note is Moriya, a Japanese, who<br />\nwere gained through two blocked<br />\nmanaged to get, and they served sings second tenor.<br />\nkicks and a lateral pass from Tayto make him appreciate the fine<br />\nThere will be very keen compelor to Turnbull. The latter's toe<br />\narts.<br />\ntition for positions on the quar- Spirited Yell Practice Follows The was in fine form and after each<br />\nBefore he was eighteen he went tet this year, inasmuch as it will<br />\nFormal Meeting<br />\nJohns Hopkins was born on<br />\ntouchdown he sent the ball sailing<br />\nto<br />\nBaltimore and into the counting go with the Omicron Delta Kappa<br />\nrather large farm near Annapolis,<br />\nAfter opening the weekly as- cleanly over the bars for the extra<br />\nMaryland, in May, 1795. Ens rooms of his uncle, the owner of Fraternity on its tour. The quar- sembly with the singing of the point.<br />\nI's mother was known for her intelli- a wholesale grocery of wide inter- tet will alSo sing at the assem- Ode, Dean Ames made several im- The first Quarter ended with the<br />\n, ests,--His ability astonished every-. blies of thd prep schools that the<br />\ngence and for-c—e of chiracter<br />\niC<br />\nportant announcements, the first ball in midfield, neither team havgave her a prominent position one. He said little, however, and, 0. D. K. visits.<br />\nof<br />\nwhich pertained to Mrs. Turn- ing made substantial gains. In<br />\nWith the new banjos, mandoamong the Quakers of Maryland by keen perception, familiarized<br />\nbull's<br />\nseries of lectures to be given the second quarter an exchange of<br />\nand Virginia. She was generous, himself with all the aspects of the lins, and guitars the Banjo Club<br />\nthis<br />\nweek<br />\nby Mr. De La Mare. kicks placed the pigskin on the<br />\ntrade, spending seven years. there. looks forward to beating the entoo,<br />\na<br />\nwhich<br />\ntrait<br />\nran<br />\nfar<br />\nback<br />\nin<br />\nE\"<br />\nIn 1819, with only four hundred viable record they established last These lectures are \"to be a discus- Mountaineers' 15-yard line. Here<br />\nmar the family.<br />\ndollars saved, he decided to go in- year. The music has been order- sion of poetry as such\" and the Quarterback Golibart signaled for<br />\nfirst of them will have to do with a kick. Poke, his center, howJohns was the first of eleven chil- to business for himself, endorsed<br />\ned and will probably be here for<br />\ndren and he was given the old an- by<br />\nworks of Keats, the famous ever, heaved a pass over Dolan's<br />\nthe<br />\nhis uncle.<br />\nthe next meeting. The program<br />\ncestral name. As he grew up, he<br />\npoet. The Dean urged all head. Before he could recover<br />\nBritish<br />\nUnwilling to spend his small cap- for the Musical Club this year inworked on the farm and during the<br />\nundergraduates to attend as himself the Black and Blue line<br />\nthe<br />\ncludes several interesting trips.<br />\nContinued on page 4, col. 2<br />\nPresident Tilghman is quoted as many of these lectures as possi- was on him and his kick was<br />\nSERIES OF ONE-ACT PLAYS DOUG TURNBULL ELECTED saying in regard to the out-of- ble for if is his desire that stu- blocked. Gilliece snatched up the<br />\ntown concerts: \"Spirit shown in dents should cultivate a taste for ball and trotted five yards for the<br />\nTO BE PRESENTED BY<br />\nLACROSSE CAPTAIN FOR<br />\nthe organization as well as talent poetry and other such arts. He first score. The half ended with<br />\nBARNSTORMERS<br />\nSECOND TIME<br />\nwill be considered in picking the also reminded the men that appli- the ball back in the center of the<br />\nNew Plan Should Discover New Tal- Ten<br />\ncations for Rhodes Scholarships field.<br />\nRegulars Back in School; Barton men for these trips.\"<br />\nent; Annual Production in<br />\nBickford Scores<br />\nIs Unable to Return to Hopkins<br />\nThe club was extremely fortu- must be filed before October 18,<br />\nMarch<br />\nThe Mountaineers chose to kick<br />\nDouglas Turnbull will again nate in obtaining the services of since his own report must go in<br />\nOne-act plays will be used by<br />\non that date. Dean Ames then off at the beginning of the third<br />\nthe Barnstorms Club this year in captain the lacrosse team. At a such a noted and talented contold of the reorganization of the quarter. Dolan's kick, however,<br />\nmeeting of the letter men, held ductor of music as Mr. Hobart<br />\n4 order to bring<br />\nPlayshop,<br />\nwhich is now under the was low and went straight for<br />\nto light any draSmock. Mr. Smock's ability as a<br />\nWednesday, he was unanimatic talent in the class of '28. last<br />\ndirection<br />\nof<br />\nDr. Small. The latter Day, who pluckily, blocked it<br />\nconductor of music began with<br />\nchosen<br />\nmously<br />\ntake<br />\nthe<br />\nto<br />\nplace<br />\nof<br />\nremoved<br />\nmany features which with his body and fell on it.<br />\nhas<br />\nhis college days at Rutgers, and<br />\nThis series of plays will be given<br />\n\"Tex\"<br />\nBarton,<br />\nwho<br />\nis<br />\nunable<br />\nto<br />\nAfter another exchange of<br />\nwere held as objectionable by last<br />\nsince then has grown steadily.<br />\nin November. They will be<br />\nreturn to college. With the mateyear's undergraduates and is cer- punts, Mt. St. Mary's was again<br />\ncoached by members of the club, rial on hand,\"Doug!s\"<br />\nsecond cap- SILVER CUPS OFFERED BY tain of a successful year if he can in possession of the ball in the<br />\nbut Mr. Swindell will attend the taincy bids fair to<br />\nbe as successobtain the co-operation of the stu- shadow of its own goal posts.<br />\nBLACK AND BLUE JAY<br />\ndent<br />\nperformances and take careful ful as his first.<br />\nHere Poke made his second bad<br />\nbody.<br />\nAnnouncement has been made<br />\nnote of the acting.<br />\npass to Dolan, who was back for<br />\nAt<br />\nthis<br />\npoint<br />\ntook<br />\nTom Magill<br />\nAlthough Barton's loss will be by \"Bob\" Griffith, Editor-in-Chief<br />\nkick. Once more the punt was<br />\na<br />\nIn previous years, the coach<br />\nhas felt, and graduation took such of the Black and Blue Jay, that to charge of the Assembly and anblocked<br />\nand this time Bickford,<br />\nnounced that moving pictures will<br />\nnot had an opportunity<br />\nto see new stars as Benedict, Bachman and every man in the undergraduate<br />\nwho<br />\nhad<br />\nreplaced Lawrence when<br />\nbe given this Wednesday by the<br />\ncandidates in action before the McDaniels, the team is fortunate department the Blue Jay offers an<br />\nmembers back: opportunity to win a silver loving American Society of Mechanical the latter's arm was injured,<br />\n\"H\"<br />\nin<br />\nten<br />\nhaving<br />\ncrowded days of the tryouts for<br />\nTurnbull, Bachman, Milbourne, cup. The Jay is inaugurating a Engineers. He also cautioned the picked up the ball and raced over<br />\nthe feature<br />\nplay which is usually Watson, Cone, Summers, Morrill, campaign for the improvement of men to exchange their A. A. tick- the line.<br />\npresented after the mid-years. The Bates, Kaufholz and Sanderson. its art, business and editorial de- ets for those required for admitThe final score was also indi4 Preliminary plays will<br />\ntance<br />\nto<br />\nthe<br />\ngame<br />\nwith<br />\nthe<br />\nUnipartments<br />\nrectly<br />\nwith<br />\nthe ultimate aim<br />\ntraceable to a blocked kick.<br />\nbe staged In addition to these of the old<br />\nversity of Pittsburgh on October Milanausky and Captain Magill<br />\nin the<br />\nincreasing<br />\nof<br />\nits<br />\nsize<br />\npromising<br />\nother<br />\nand<br />\ncircula.the<br />\nto<br />\nand<br />\nguard<br />\nBarnstormers' studio in the<br />\n4<br />\nmembers of last year's squad, an tion. Copy for the next issue is 18 at the Stadium. Townsend shared equally in this feat, the forBarn. Those taking parts<br />\nare exdue on October 15. All copy that spoke next and impressed on the mer blocking and the latter recovpected to gain- much valuable ex- unwonted number of former prep<br />\nschool stars have reported. Men is late will count on subsequent is- minds of the new men the neces- ering. This time after line bucks<br />\nperience through the coaching of<br />\nsity of unanimous and systematic had twice failed to advance the<br />\nof the ability of Griffith, Benson, sues.<br />\nBarnstormers and the criticisms<br />\nMann, Curlett, Mahool, Bolton, The awards will be presented cheering at all the games. The pigskin, Taylor, stepping back,<br />\nof Mr. Swindell.<br />\nMixdorff, Spence and Bauren- by a board of judges composed of cheering practice which followed passed to Turnbull, who had skirtThe play reading committee, in schmidt are a decided addition to the present Blue Jay Board of immediately after this proved that ed right end and awaited the pass<br />\nco<br />\nllaboration with Mr. Swindell, the squad. Oles, Liebensperger, Control, who, alone, will be ex- his words were not uttered in vain behind the goal line.<br />\nis hard at<br />\nwork selecting this Conant and Biddison, freshmen cluded from the contest. The cups for the C. E. building fairly viFinal Quarter Dull<br />\nyear's feature production. Several now playing football have signi- will be awarded at the annual ban- brated with deep-toned yells and<br />\nThe last quarter was slow and<br />\n4 Plays, all comedies,<br />\nare under con- fied their intention of playing la- quet of the Black and Blue Jay songs. Don Bolton and Will Rod- uneventful, the aerial attacks of<br />\nsideration. They include \"The crosse, and will be able to join the according to the following specifi- gers, two freshmen, who helped both sides proving<br />\ninefficient.<br />\nProfessor,\"<br />\nthe regular cheer leaders, should<br />\nby Sir James M. Bar- squad as soon as the football sea- cations:<br />\nWalker<br />\nTaylor<br />\nwas<br />\noff color in<br />\nre; \"Le<br />\n1. One cup to the man doing prove great assets for the cheer his judgment of Dolan's<br />\nMalade Imaginaire,\" by son is over.<br />\nlow punts<br />\nleading staff.<br />\nMoliere; \"The Importance of Bethat often sped past him for 30<br />\nManager Baker and Coach the best work in the .art departing Earnest,\" by<br />\nOscar.Wilde, and Schmeisser went to New York last ment from the present time to the<br />\nyards or more. Turnbull kicked<br />\na few more popular modern COMfairly well, two short boots marSaturday to attend the annual con- publication of the third from the<br />\nedies.<br />\nring a perfect day for him.<br />\nvention of the Intercollegiate La- last issue.<br />\nWith most of the cast of last crosse League. At the meeting .2. Another to the man doing the<br />\nThe most redeeming feature of<br />\nYear's \"Galloper\"<br />\neditorial<br />\ndepartment<br />\nbest<br />\nin<br />\nwork<br />\nfirst<br />\nThe<br />\ninterclass<br />\nbaseball<br />\npracthe<br />\nMt.<br />\nand<br />\nSt. Mary's showing was its<br />\nback, and with rules were discussed<br />\nthe new candidates expected,<br />\ntice of the season was held last steadfast line, which proved<br />\nthe league schedule arranged. Baker for the same period.<br />\nan<br />\nsuccess of the new<br />\n3. A third to the man doing the Friday on the diamond behind the enigma to the Blue Jay<br />\nplay seems as- announced that the team will<br />\nbackfield.<br />\nsured. The dates<br />\nA large early season crowd<br />\nof the produc- probably have a very heavy sched- best work in the business depart- Civil Engineering Building. The<br />\ntion have<br />\nment, also for the same period.<br />\npractice was marked chiefly by a watched the last appearance<br />\nbeen definitely set, Fri- ule.<br />\nof the<br />\nday and Saturday,<br />\nEveryone is invited to enter the large turnout of freshmen, nearly Blue Jays before the struggle at<br />\nMarch 27 and<br />\nFreshman candidates are espe428. It will<br />\nprobably be presented cially wanted for assistant mana- contest whether out for the staff thirty men reporting, however, the the Stadium, this Saturday, with<br />\nat the<br />\nContinued on page 4 col. 3<br />\nLyric.<br />\nContinued on page 2, col. 5.<br />\ngerial positions, as Baker is findContinued on page 4 col. 1<br />\n<br />\nBLOCKED KICKS DEFEAT<br />\nMT. ST. MARY'S IN SLOW<br />\nGAME AT HOMEWOOD, 21-0<br />\n<br />\nWALTER DE LA MARE WILL<br />\nLECTURE, ANNOUNCED<br />\nAT ASSEMBLY<br />\n<br />\nFROM A PAINTING BY A...1. MILLER<br />\n<br />\nSENIORS AND FROSH HOLD<br />\nSPIRITED EARLY<br />\nPRACTICE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1924<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by .the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 0100<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALGER HISS, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\nCirculation Manager<br />\nOTHO J. KELLER, III, '26<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br />\n<br />\nPRIZE OFFERED BY MAJOR WALLACE OLES ELECTED take the place of those who graduated last June.<br />\nFRESHMAN PRESIDENT<br />\nHOISINGTON FOR BEST<br />\nCAP DEVICE<br />\nAfter the Student Assembly, W. Nelson Young was electec<br />\nThursday, October 9, the Fresh- second lieutenant of the club to fill<br />\nContest for Most Distinctive Design<br />\nman class met to elect a president. the resignation of Robert Griffith<br />\nWill Close On Saturday,<br />\nNovember 15<br />\nThomas Magill called the meeting<br />\nTen dollars in gold will be to order and read the list of nomi- SILVER CUPS OFFERED BY BLACK<br />\nAND BLUE JAY<br />\nawd'rded the Hopkins undergradu- nees which was as follows: J. Curfrom page 1<br />\nContinued<br />\nate who designs the most distinc- lett, D. Kaufman, T. Biddison, G.<br />\nsr not. Copy will be received at<br />\ntive cap device for the Johns Hop- Mallonee, and G. Fenimore.<br />\nThe class voted that the nomina- 3lue Jay office on the third floor<br />\nkins unit of the R.0. T. C. Major<br />\nHoisington has offered that prize tions be reopened, and the names ,f the Barn, daily from 12.20 to 1<br />\nin order to stimulate competition of Blandi, Rodgers, Oles and War- '3. M.<br />\nin the contest. For those aspiring field were added. Warfield and Bid- EUGRADERS PRMTERS •—• BlIMERS<br />\nto the award, the cap devices of dison withdrew; and on a standing<br />\nother units are on .exhibition and ballot Blandi, Rogers, Kaufman,<br />\n\"exitukrude<br />\nmay be inspected at any time. Fennemore, Mallonee were elimThe desire for a unique device for inated. A written, signed ballot was<br />\nthe local unit led to the promotion then taken, on which Oles defeated<br />\nCurlett.<br />\nof the contest.<br />\nwinthe<br />\nchoose<br />\nFive judges will<br />\nning artist at the close of the con- CAPT. SCOBEY ELECTED TO<br />\nD<br />\ntest at noon, Saturday, November<br />\nMILITARY SOCIETY<br />\nV<br />\n15. They are Major George H. Captain Scobey, one of the comE.<br />\nHoisington, Dean Joseph S. Ames, manding officers of the Johns HopnALTitdoo<br />\nDr. Carol V. B. Wright, Alger kins R. 0. T. C. unit, who has<br />\nHiss and Cadet Major Ray Gai- charge of the freshman class in inPrinters of<br />\nther.<br />\nfantry drill was made an associate<br />\nRules of Contest<br />\ncThe Johns Hopkins<br />\nmember of the Scabbard and Blade<br />\nThe rules of the contest as<br />\nlast<br />\nmeeting<br />\nfirst<br />\ntheir<br />\nClub at<br />\nNEWS-LETTER<br />\nannounced by the military departweek. Several new members will<br />\nment are as follows:<br />\nbe initiated in the near future to LOMBARD and SOUTH ST R E.E15<br />\n1. Designs submitted to<br />\nbe in black and white, full<br />\nsize, the vertical height not<br />\nto exceed two inches.<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 14, 1924<br />\n<br />\n2. All designs must be<br />\nsubmitted to Room 323,<br />\nMilitary Office, accompanied<br />\nby artist's name in a sealed<br />\nEnvelope.<br />\n3. Contest is open to any<br />\nundergraduate in the University.<br />\n4. Contest will close at<br />\nnoon, Saturday, November<br />\n15.<br />\n<br />\nFIRST THINGS FIRST<br />\nSpeaking before a group of freshmen recently a prominent member<br />\n<br />\nAny further information<br />\nregarding the contest may be<br />\nhad from the military office.<br />\n<br />\n. successful college career as one<br />\nof the student body characterized the<br />\nin which the undergraduate cultivated a wide acquaintance on the campus STEEL FABRICATION VIEWED<br />\nBY SENIOR ENGINEERS<br />\nand devotect himself largely to the pursuit of extra-curriculum activities.<br />\nStudents of the senior civil enCollege, undoubtedly, is the place to make those friendships which will gineering class last Wednesday, October 8, saw the actual fabrication<br />\nendure and mean something all through life, but that campus activities<br />\nof steel work for bridge work and<br />\nas<br />\nlife<br />\nundergraduate<br />\nthe<br />\nof<br />\npart<br />\na<br />\nimportant<br />\nso<br />\nform<br />\nrightfully<br />\nshould<br />\nstructures similar to those which<br />\nthey<br />\nhad designed. This view of<br />\nthey seem to do at present we do not agree.<br />\nthe practical side of the class room<br />\nThe college was originated back in the Middle Ages as a place of work came during a tour of inspection of the Carnegie Steel Comstudy and research. Since that time, however, it has gradually been pany, of Baltimore, which was<br />\ngrowing more and more to resemble a playground. Athletics, college taken by the class under the guidance of Mr. Guy Lee Bryan, of the<br />\nnewspapers, musical clubs, usurp-the-time which should really be -spent<br />\ncivil engineering department.<br />\nthemin<br />\nulum<br />\nactivities<br />\nextra-curric<br />\n*that<br />\nbelieve<br />\nnot<br />\ndo<br />\nThe various methods of shearing,<br />\nin study. We<br />\nand drilling the angles,<br />\ncutting<br />\nselves are harmful, we do not believe that they should be abandoned,<br />\nbeams and plates were observed, tobut we do feel that they should be indulged in with moderation.<br />\ngether with the riveting of the various component parts of the strucThe situation on this campus today is such that the student who ture firmly into position.<br />\nVarious<br />\nreading<br />\nand<br />\nprivate<br />\nwork<br />\nclass<br />\ntime<br />\nto<br />\nhis<br />\nof<br />\ntypes<br />\nof<br />\nplate<br />\npart<br />\nfor<br />\ngirders<br />\nuse in<br />\ngreater<br />\nthe<br />\ndevotes<br />\nwork<br />\nwere<br />\nalso<br />\nstudied.<br />\nrailroad<br />\nis looked upon as a \"grind.\" The modern American undergraduate has Although the size and<br />\nquantity of<br />\nfor<br />\nthe<br />\nstalwart<br />\nhis<br />\nin<br />\nadmiration<br />\ncollege<br />\nto<br />\ncame<br />\nbridge work produced by the Baltiforgotten why he ever<br />\nmore concern is relatively small<br />\nathlete and the \"big man, around college!:<br />\ncompared with the parent Pitts\"First Things First\" is the slogan of an undergraduate newspaper burgh plant, considerable color was<br />\nlent the masses of parts when it<br />\nhere in the East, and we believe it to be a good one for the American was learned that *the majority of it<br />\nundergraduate. Youth comes to college in order to play, to be sure, was to be exported to the Argentine and other countries in South<br />\nbut first it comes to college in order that it may broaden itself and learn America, and to China. Such trade<br />\nto use the experience of the past. Campus activities in their place are constitutes by far the largest. percentage of the bridge work busian excellent thing, but once we forget where they belong they become a ness of the Carnegie Company in<br />\nthis city.<br />\nmenace to undergraduate life.—The Rutgers Targum.<br />\nHere again we see the problem of extra-curriculum activities which<br />\nis facing nearly every _American college. THE NEWS-LETTER agrees<br />\nwith the views of the Rutgers' editor. While in a recent editorial we encouraged campus activities, we encouraged them with moderation; we do<br />\nnot wish to underrate them nor do we want to set up a false sense of<br />\nvalues of them. We believe that the Hopkins student body would do<br />\nwell in adopting the slogan \"First Things First.\"<br />\n<br />\nJust as the hairbrush<br />\n!eft it!<br />\n<br />\nCollege Men<br />\nnow keep their hair smooth,<br />\nlustrous, always in place<br />\nToday, as never before, college<br />\nmen have smooth,well-kept hair.<br />\nWhy?<br />\nA few years ago the hair was a<br />\nnuisance to almost everyone, for<br />\nit was usually the least attractive<br />\npart of the appearance — always<br />\nunkempt and unsightly an hour<br />\nafter being combed.<br />\nThere was no way, then, to keep<br />\nit from being so. Old-fashioned<br />\npomades only matted it and made<br />\nit greasy. Water evaporated quickly<br />\nand left it drier and more unruly<br />\nthan ever.<br />\n<br />\nToday everyone can have<br />\nsmooth, neatly combed hair<br />\nNow Stacomb — a delicate, invisible cream for keeping the hair in<br />\nplace — has changed all that.<br />\nIt is responsible for the amazingly<br />\nimproved appearance of men's hair.<br />\nAnd it has made possible for every<br />\nwoman, however \"difficult\" her<br />\nhair, the new smooth effect so much<br />\n<br />\nYou can get Stacomb in convenient jars and tubes, at all drug and<br />\ndepartment stores. Non-staining<br />\nand non-greasy. Use it tomorrow<br />\nmorning — and look your best all<br />\nday!<br />\n<br />\nin vogue.<br />\nIn clubs and fraternities, at the<br />\ntheatre or the game, today you can<br />\n<br />\n11104.161MT.OIL<br />\n<br />\nKEEPS THE HAIR IN PLACE'<br />\n<br />\nNOT/CES<br />\nY. M. C. A. Fellowship Dinner<br />\nat the Friends' Meeting House,<br />\n3107 N. Charles St., 6 o'clock<br />\nthis evening. Subscription, 50c<br />\nper plate.<br />\nCandidates for cast of Barnstormers report in the Studio tomorrow at 12:20.<br />\n<br />\nseldom find even one case of unkempt hair.<br />\nPeople who know that the hair<br />\ncan ruin the whole appearance—<br />\npeople who are careful about the<br />\nway they look — have given Stacomb an important place on their<br />\nchiffonier or dressing table.<br />\nNo matter how dry and straggly<br />\nyour hair may be — no matter how<br />\nuncontrollable after being washed<br />\n— Stacomb will keep it always<br />\nin place, smooth, lustrous, natural.<br />\nA touch of it in the morning when<br />\nyou comb your hair — and allday<br />\nlong your hair will be just as you<br />\nwant it, for Stacomb will keep it<br />\nsmoothly in place until you go to<br />\nbed at night.<br />\n<br />\n1Stand arc' Laboratories,Inc.., Dept.<br />\n<br />\n113W.18th St.,New York City<br />\nI<br />\n<br />\nFree<br />\nOffer:<br />\n<br />\nPlease send me, free of charge, a<br />\ngenerous sample tube of Stacomb.<br />\n<br />\nName<br />\nAddress<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS LETTER, OCTOBER 14, 1924<br />\n<br />\ngrad - RIFLE<br />\n<br />\nectec<br />\n.0 fill<br />\n<br />\niffith<br />\n<br />\n.ACK<br />\n<br />\nd at<br />\nfloor<br />\nto 1<br />\n<br />\nDERS<br />\n<br />\nA STORE OF CAPTAINS<br />\nTHE NEWS-LETTER<br />\nTEAM SCHEDULE<br />\nMAILBAG<br />\nANNOUNCED<br />\nMuch attention has been attracted this season by the Stu\"Hopkins will hang'up a string<br />\nof<br />\nAll<br />\nintended for publication<br />\nvictories in her shooting must letters<br />\nbe concise, written in ink on dent's Store located at the Barn.<br />\nregular letter size paper, on one side Representing five downtown mermatches this year,\" declared F. only.<br />\nNo attention will be paid to anony- chants, Hopkins' own collegiate<br />\nH. Steck, captain of the rifle team, mous<br />\nletters, but names- signed as an<br />\nevidence of good faith will not be shop under the proprietorship of<br />\nat an organization meeting of printed if request is made that they be<br />\nDouglas Turnbull, Jr., lacrosse<br />\nomitted.<br />\nthe rifle club held last Tuesday,<br />\nThe publication of a letter is not to captain, and Thomas Magill, capbe taken as an indorsement of its views<br />\nWhich was attended by more than by the \"News-Letter,\" which Invites the tain of football, is offering a wide<br />\n'freest discussion of matters of general<br />\ninterest.<br />\nvariety of wares, including suits,<br />\nseventy-five men.<br />\nhats, ties, belts, Hopkins buckles,<br />\nThe members of the club will<br />\nslickers, and in fact everything to<br />\nhe coached by Lieutenant Sher- To the Editor:<br />\nlure<br />\nthe college student. The BalThe Publicity Board at Johns<br />\nwood. The coach's policy is to<br />\ntimore firms reprobsented are<br />\nhave a team composed of the high Hopkins has been making a terrible<br />\nOST young men today<br />\nVan, Hess, Spalding, Katz and<br />\nknow the importance of<br />\nscorers of the preceding week howl about having no place to carry Warner.<br />\nwriter<br />\nreceived<br />\nThe<br />\nlooking<br />\nfit. Good apshoot in each weekly match. In on their work.<br />\nThe store has a unique history.<br />\npearance counts much<br />\nOther words, there is not one place a letter from one of last year's Founded in 1921 by Andrew<br />\non the team filled permanently. graduates, now working in New Knecht and Thomas Landy, it<br />\nin the game of life. The young<br />\nman who dresses with taste has<br />\nThe practice scores for the week Jersey, saying that he had sub- was managed in 1922-23 by Lanthe<br />\ndy,<br />\nwas<br />\nthen<br />\ncaptain<br />\nof<br />\nwho<br />\na decided advantage.<br />\ndetermine the representatives of scribed to the Baltimore Sun in<br />\nteam. \"Buck\" Bonner,<br />\nfootball<br />\nthe club for each match.<br />\nhopes of getting some 'news of<br />\nBut—it is surprising how little<br />\nlast year's popular football capLast season a team represent- Hopkins activities. He is a former tain, ran the store during the<br />\nthought the average man gives<br />\ning Hopkins competed with nine editor of the Publicity Board but 1923-24 term. This year the shop<br />\nto his hat. It is his crown, yet he<br />\nOther teams in New York City. has this to say: \"I'm subscribing is again under the managership of<br />\nseems to stop dressing at the neck.<br />\nOur men landed fourth place.<br />\nto the Baltimore Sun but find what leaders in athletics.<br />\nBe careful in your selection of<br />\nThe tentative schedule for this I'd hope to see—Hopkins news—<br />\nyour<br />\nheadwear. When you buy a<br />\nyear presents. an opportunity for sadly lacking. What is the mathat, select a Stetson. Its style is<br />\nGeorgetown to satisfy her thirst ter? There wasn't even the usual<br />\nMAN UFACTURINC JEWELERS<br />\nright,<br />\nits quality means long wear.<br />\nfor revenge for last year's defeat dope on the opening of school itLancaster, Pa.<br />\nin a shoulder to shoulder match. self, much less anything to speak<br />\nClass Rings, Pins, Fraternity Pins<br />\nCups, Medals, Etc.<br />\nSimilar matches are pending with of on football. But talk about news<br />\nthe University of Maryland and<br />\nof Maryland—there's a book full Stationery, Invitations, Programmes<br />\nManager<br />\nGettysburg College.<br />\n\"Makers of the Varsity Seals\"<br />\nevery day.\"<br />\nAshley has issued challenges to<br />\nPrinceton, Penn, U. of W. Va., That Hopkins is not receiving<br />\nand others. Challenges have been enough publicity is deplorable. The<br />\nreceived from Drexel, Carnegie Publicity Board has thus far this<br />\nTech, and Chicago and the team year been inactive. This is inexWill take part in the N. R. A.<br />\ncusable. Although they lack quarmeet.<br />\nThe great majority of the ters, some work ought to be done;<br />\nmatches are conducted by mail. and if they were extremely anxious<br />\nHowever, the rivalry is keener to make headway, they would wake<br />\nin the shoulder to shoulder match up and realize that it is not imKb! Pen and Eversharp are<br />\nobtainable in matched<br />\nin which both teams-shoot on the<br />\nsets<br />\n-poss-ibre to get some place to dO<br />\nsame range.<br />\ntheir work.<br />\nThe club has purchased new<br />\nThe Dean has recently put a roam<br />\nrifles, and practice will be started<br />\naside in the basement of the Chemat once.<br />\nical Laboratory for the use of the<br />\nStudent Council where they will<br />\nFIELD CLUB PACKS PEP<br />\nmeet every Friday. It is doubtful<br />\nA good start is half of the bat- if the heads of the Publicity Board<br />\ntle. One would believe that such have even attempted to see Dr.<br />\nAn unqualified guaranteestands<br />\nis the motto of the Field Club if Ames about arrangements. The<br />\nback of every Wahl<br />\nhe could have looked in at the re- NEWS-LETTER uses its offices only<br />\nproduct<br />\norganization meeting in Gilman on Tuesdays and Fridays, and the<br />\nHall. The Field Club is one which Publicity Board could have this<br />\nappeals to students interested in room as their headquarters on any<br />\noutdoor life. Students of the bio- other days in the week. It is true<br />\nlogical department are advised to that they would have to keep their<br />\njoin the club,.but.n.o,effort is_made files elsewhere, but it is practicall:for compulsory membeship. Un- certain that Y. M. C. A. would not<br />\nlike other clubs the Field Club un- object to a few files in the Trophy<br />\ntil the current year, has never Room in order that such important<br />\ncharged any dues or other fees. work may be carried on.<br />\nThis year, however, owing to proIt looks to the writer like the<br />\nposed plans which involve ex- Publicity Board is not living up<br />\nSide by side in your pocket, Eversharp and Wahl<br />\npense, dues are to be charged. to its duty as a Hopkins activity.<br />\nPen<br />\nare ever ready to serve your thoughts.<br />\nThese dues, however, will involve Their good work of last year will<br />\nDurability<br />\nand dependability are common qualities<br />\nsuch a small sum of money that be lost if some action is not taken<br />\nof<br />\nthese<br />\neconomical,<br />\npractical writing companions.<br />\nthey will be practically non-exist- in the near future.<br />\nThe<br />\nnon-clogging<br />\nrifled<br />\ntip, quick reloading, and<br />\nent.<br />\nYours truly,<br />\ncomplete interchangeability of parts are among the<br />\nA HOPKINS BOOSTER,<br />\nSeveral topics of interest were<br />\nsix new features which make the perfected Eversharp.<br />\ndiscussed in this meeting. Among<br />\nAnd the Wahl all-metal Pen is at par with EverOthers were several short hikes<br />\nsharp<br />\nin giving thorough satisfaction. Light in<br />\nWhich promise to prove interest- MEREDITH INELIGIBLE AS<br />\nweight, perfect in balance, resistant to wear, and<br />\ning to those attending. One of<br />\nSOPHOMORE DELEGATE<br />\nbeautiful in design—it is the ideal pen.<br />\nthese hikes will be to the banks of<br />\nBecause of a misunderstanding<br />\nEversharp, $1 to $45.<br />\nWahl Pen, $5 to $55.<br />\nthe<br />\nGunpowder River at Loch of the rules of eligibility, Frank<br />\nMadein the U.S.A.byTHEWAHL COMPANY,Chicago<br />\nRaven, for the purpose of catch- Meredith was elected Sophomore<br />\nCanadian Factory,THE WAHL COMPANY,Ltd.,Toronto<br />\ning different varieties of insects. delegat to the Student Council at<br />\nManufaaurers ofthe Wahl Eversharp and the WahlAll-MetalFountain Pen<br />\nMr. Myers, who will be in charge the last class meeting. It was<br />\nof the<br />\nhikes, has been very suc- overlooked that he was already a<br />\ncessful in his searches for interest- delegate to the A. A. Board and<br />\ning insects and has<br />\na very fine col- therefore automatically ineligible<br />\nlection. It is the plan of the club to serve on the Student'Council.<br />\nto buy an old mansion house,<br />\nAt the next meeting the class<br />\nWhich is so situated so as to be will elect a delegate from the origaccessible to the members. This inal nominations. They were<br />\nhouse will<br />\nbe used as a place for Douglas Frantz, Edward Passano,<br />\nthe exhibit of the<br />\nclub's collection Malcolm Cleaveland, Francis Harof insects. It also will be used wood and Arthur Niner, retiring<br />\nfor the<br />\nconvenience of members. president of the Sophomore class.<br />\n<br />\ngor Young Men<br />\n<br />\nThere is nothing like a<br />\n<br />\nSTETSON<br />\n<br />\nJ. F. APPLE CO.<br />\n<br />\nE.F.15<br />\n<br />\njr<br />\n<br />\na-<br />\n<br />\njr<br />\n<br />\nly<br />\n<br />\n2c1<br />\n<br />\nys<br />\n<br />\n)11<br />\nit<br />\nto<br />\n<br />\nn-<br />\n<br />\nid<br />\nig<br />\n<br />\n2W<br />\n<br />\nall<br />\n<br />\nComplete Writing Equipment<br />\n<br />\n[<br />\n<br />\nCE<br />\n<br />\nIT<br />\n<br />\na<br />\n<br />\nThe New PERFECTED<br />\nWAIiifill/M5HAPP<br />\n<br />\n69W4I1<br />\n- 1 PfiN<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1924<br />\n<br />\nJOHNS HOPKINS, SELF-EDUCATED, REALIZED<br />\nVAST IMPORTANCE OF COLLEGE TRAINING<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nFOR THE STUDENTS<br />\n<br />\nCOGGIN'S<br />\n<br />\nContinued from page I, col. 2<br />\n<br />\nBring This to the Address Below<br />\nTransfer & Baggage Express<br />\nital in supplies, he filled the barrels rating the different needs of the When You Want Anything in the<br />\nVOL.<br />\nAUTOMOBILE SERVICE<br />\nDRUG LINE<br />\nand boxes in his small shop with medical students with their wards<br />\nPHONE, HOMEWOOD 6886<br />\nsand and kept his money in work- and clinics from those of the stuHUL<br />\ning form. He sold by sample. If dents in the arts and sciences. In R. G.Loy & Company<br />\nS1<br />\na customer wanted a second box of a letter to his appointed trustees,<br />\n(Robert G. Loy)<br />\ntea or bag of coffee, Johns would nine months before his death, he<br />\nPHARMACISTS<br />\nhurry off to some importer and gave no precise directions. They<br />\nUNIVERSITY PARKWAY<br />\npurchase it, replacing his sample were unhampered but their general<br />\nSeven<br />\nAt Charles St.<br />\nPr;<br />\nwas<br />\nvery<br />\nclearly<br />\ncourse<br />\nof<br />\naction<br />\ncome<br />\nshould<br />\nfor thebusiness..<br />\nnext one who<br />\noutlined.<br />\nSlowly, at first, by<br />\nin on<br />\nWatch him at the \"Prom.\" He's<br />\nXV<br />\nthere with perfect ballroom conhis credit good, As the embryo university grew<br />\ncarefully<br />\nkeeping<br />\nDamon—<br />\npatent<br />\ndition from soles of his<br />\n'tartf<br />\n\"What's the matter?<br />\npumps to top of his glossy dome.<br />\nhe built up his trade in this unique into form, his interest grew keen,<br />\nCan't you read your<br />\nThe<br />\nHe's just as neat after the twentieth<br />\nbut determined way. And it was but he died many, many months benotes of the lecture?\"<br />\ndance as during the first foxtrot. There's<br />\nhard<br />\nno secret about his method. \"Vaseline\"<br />\nnot many years later that his firm fore the inauguration of the first<br />\nPythias—<br />\nHair Tonic goes to his head regularly.<br />\nnum'<br />\n\"No—doggone it. I<br />\nIt makes his hair silky and manageable<br />\nwas known all through the South. president. He passed away on the<br />\nand prevents dandruff. At all drug stores<br />\nto class<br />\nskipped<br />\nover<br />\nhein{<br />\nHis will<br />\nand student barber shops.<br />\nthis morning without<br />\nDuring those years it is said 24th of December, 1873.<br />\nadvei<br />\nEvery \"Vaseline\"Product is recommy Dixon's Eldorado 1\"<br />\ngave seven million dollars, divided<br />\nmended everywhere because of its<br />\nJohns Hopkins \"shaved\" money.<br />\nCLOTHIERS<br />\ncient<br />\nabsolute purity and effectiveness.<br />\nuniversity<br />\nand<br />\nthe<br />\nequally,<br />\nto<br />\nthe<br />\n17 leads—all dealers<br />\nHe would write a check with the<br />\nsize<br />\nHABERDASHERS<br />\nthe direction of<br />\nrequest that it be not used for a hospital. Under<br />\nIXL_<br />\n2<br />\nch<br />\nseparately endowed<br />\nweek, perhaps, in order to save a the hospital, he<br />\ncolored<br />\nchildren.<br />\norphanage<br />\nfor<br />\nan<br />\nREG.U.S.PAT.OPP.<br />\n315 Charles St. North<br />\nfew days' interest on an unbroken<br />\ngreat<br />\nMaryland's<br />\nmermeet<br />\nof<br />\nOne<br />\ndeposit. It was one of his eccenthe<br />\nlimsterdrawargpenail\"<br />\nBaltimore's<br />\nour<br />\nchants, one of<br />\ngreatest<br />\ntricities.<br />\nFor the Health and<br />\n-this<br />\nmen, our founder, Johns Hopkins<br />\nAppearance of the Hair<br />\nLater in life (1847) when he had has left a monument which has set<br />\nread,<br />\nChesebrough mfg. Co..(Cons'd)<br />\nNew York<br />\nState Street<br />\namassed a fortune, he became a di- an example to the whole country. BRANCH<br />\n4)‘‘,<br />\nAT THE BARN<br />\nrector of the Baltimore and Ohio<br />\n-oo<br />\nBy T. D. B.<br />\nRailroad, then still young and unhe<br />\nfinished as far as the original plans SENIORS AND FROSH HOLD<br />\nover,<br />\nSPIRITED PRACTICE<br />\nwere concerned. Some time later<br />\ntake i<br />\nContinued front page I<br />\nit nearly became the ruin of the<br />\ngeth,<br />\nseniors mustered only a little more<br />\nState, because of inability to meet<br />\nthan a full team.<br />\nits obligations in extending and finA light workout was the order of<br />\nishing the road, without which, of<br />\nthe<br />\nday, the men tossing the ball<br />\nJune<br />\ncourse, the whole project would be<br />\nDOUG TURNBULL<br />\nTOM MAGILL,<br />\naround<br />\na<br />\nbit<br />\nand<br />\nthe<br />\ntwo<br />\ninfields<br />\nthe<br />\nRepresentatives<br />\nuseless. Seeing the wonderful posMan a get<br />\n,<br />\nworking<br />\nout<br />\nunder<br />\nthe<br />\ndirection<br />\nof<br />\n(1011(<br />\nsibilities which such an organization<br />\nin<br />\nKeene, the Varsity captain. The<br />\ncould command by connecting the<br />\npractice<br />\nwas<br />\nquite<br />\nfast,<br />\nCoach<br />\nAt vide'<br />\nfertile agricultural valleys of MarySheets 100 Envelopes<br />\nwith the<br />\nally<br />\ngrowing Keene being well pleased<br />\nVirginia<br />\nwith<br />\na<br />\nland<br />\nand<br />\nMOUNT<br />\nVERNON PLACE<br />\nHigh grade, white bond paper—unwork.<br />\nThe<br />\nfreshmen<br />\nshowed<br />\nplent<br />\nMETHODIST EPISCOPAL used<br />\nusually smooth writing surface. Enmarket, he pledged his whole forvelopes to match.<br />\nof promise,'giving Keene an oppor.<br />\nGin]<br />\n(At the CHURCH<br />\nYOUR NAME AND ADDRESS<br />\ncause, inspiring others<br />\ntune<br />\nto<br />\nthe<br />\nPRINTED FREE<br />\nWashington Monument) \\Vat<br />\ntunity to pick a fairly fast infield<br />\neventually<br />\nput<br />\nand<br />\nton every sheet and envelope, in rich<br />\ndo<br />\nthe<br />\nsame,<br />\nto<br />\ndark blue ink, up to 4 lines. (Note<br />\nThe seniors took the field with th(<br />\nPrin<br />\nREV. OSCAR THOMAS<br />\n—our low price does not allow any<br />\nthe<br />\nrailroad on a sound basis. This<br />\nvariation in printing. Top center of<br />\nfollowing lineup: Gilpin, 1st base<br />\nof t:<br />\nOLSON,<br />\nD.D.,<br />\nonly.)<br />\nenvelope<br />\nof<br />\nsheet and flap<br />\nis but a single example of his greatMinister<br />\nType is Engravers Gothic, designed<br />\nChesney,<br />\nStull,<br />\n2nd<br />\nbase;<br />\nshortand<br />\nespecially for clearness and good taste<br />\nest faculty—foresight.<br />\nSunday Services of Worship thei:<br />\nJust send your name and address<br />\nWales,<br />\n3rd<br />\nbase.<br />\nManastop;<br />\nand<br />\n(write or print clearly) with $1.00<br />\nA rich man, Hopkins became the<br />\n1 1 A. M. and 8 P. M.<br />\n(west of Denver and outside of the,<br />\nhan, last year's senior pitcher,<br />\nhome\" deal<br />\nU. S. $1.10) and this generous box of<br />\nobject<br />\nof charitable organizations<br />\nThe<br />\nSunday afternoon -at<br />\nstationery will come to you neatly<br />\nshowed<br />\nplenty<br />\nof<br />\nspeed,<br />\nbut<br />\nwas<br />\na<br />\nfrom 5 to 7 P. M. in the Blue and Grey gett<br />\nboxed, postage prepaid. Money rehim<br />\nrequesting gifts of money. But he<br />\nfunded if you are not more than<br />\nlittle wild. However, he will, no<br />\nRoom is a social occasion that bringt di°,<br />\nsatisfied.<br />\n\"My<br />\nmoney<br />\nnearly always refused:<br />\ntogether the student groups from Hop<br />\ndoubt, settle down and give his opkins, University of Maryland, Goucher oont<br />\nis not intended for you. It is not ponents<br />\n-plenty of trouble when the<br />\nPeabody, and other schools of Balti arm<br />\nPrepaid<br />\nmine. I did not make it. But I season opens.<br />\nAsendorf, another<br />\n„ for<br />\nPostage<br />\nmorpe*<br />\nE worth League at 7 P. M. and tn. ,<br />\nknow what it is for and I must senior, also showed up well in the<br />\nBible class at 10 A. M. are built par ley,<br />\nkeep to my work.\".<br />\nticularly with the needs of the yount<br />\nbox.<br />\nPERSONAL STATIONERY CO.<br />\nMich.<br />\nDetroit,<br />\n1036 Beaubien St.<br />\npeople in mind.<br />\nJohns Hopkins had a deep con- The first game is scheduled for<br />\nmar<br />\nscience. He believed God gave him Friday, the seventeenth, betweer.<br />\nniar<br />\nwhat he had for some worthy pur- the sophomores and the seniors<br />\n.1,,10101.4 .014q.ê14i, .14<br />\ncam<br />\npose; not as most men Consider The sophomores have the best out'<br />\nthemselves creators of their own look for the season, all of their. men<br />\nSMART APPAREL and FURNISHINGS<br />\nhan<br />\nfortunes, made for themselves. It being back with the exception of<br />\nwor<br />\nfor Campus and Sports<br />\nseems he realized the handicap of MacNeal, who will probably be<br />\nlarg<br />\n•<br />\nno education with respect to success hindered front- plaYing. .by Vafsity<br />\nnes;<br />\nselection<br />\nof<br />\nthe<br />\ncollege<br />\nman.<br />\nAwait<br />\nthe<br />\n\"THE WONDER MOTOR FUEL'<br />\nand happiness from his own life. football.<br />\neng<br />\nAnd this feeling developed into the<br />\nAll present indications point to<br />\nYor<br />\nidea of the great university Which an interesting season.<br />\nSHERWOOD BROTHERS, INC.<br />\nbears his- name and which became<br />\nhav<br />\nannwrirrvrFrinInmanntatemtellalaill=g1g0=g0 the recipient of nearly all his SOPHS INCREASE ACTIVITY<br />\nThe clear crack of the paddle<br />\nwealth.<br />\nHOPKINS WINS, 21-0<br />\nhas<br />\nbeen resounding with reHopkins was far from selfish.<br />\nContinued from page 1<br />\nfrequency over the Hopnewed<br />\nof five<br />\nthe Pittsburgh Panthers, conquer- As an instance, he was one<br />\nkins<br />\nduring the last few<br />\ncampus<br />\nmen who each advanced a poor<br />\nors of West Virginia.<br />\ndays.<br />\nThe<br />\ndecree<br />\nhas gone forth<br />\nwidow the sum of a hundred dolThe Line-Up:<br />\nPos. Mt. St. Mary's lars with which to open a shop. that freshmen must know \"Who's<br />\nHopkins<br />\nLE.<br />\nSheehy Years later when the money was Who,\" and the bewildered yearOles<br />\naud<br />\nDanker<br />\nMagill (Capt.)..L T.<br />\nling<br />\nlife<br />\nis<br />\nfinding<br />\ndarn<br />\njust<br />\none<br />\nwel<br />\nother<br />\ninterest,<br />\nthe<br />\nMilanausky ....L G.<br />\nMoore returned with<br />\nin<br />\nPoke four pocketed it and said nothing. question after another. No soonDay<br />\nRG<br />\nSlowik<br />\nFoley<br />\n7'W.'Corner C-- czyelie and Cutaw 81s.<br />\ner does he venture toward the<br />\nat<br />\nBiddison<br />\nR T<br />\n• Buckley Hopkins refused it all.<br />\ngroups<br />\nbarn<br />\nthan<br />\n.<br />\nRE.<br />\nCampbell<br />\nof<br />\nsophomores,<br />\nGilliece<br />\nYot<br />\n\"Keep it and lend it to another<br />\n-Where Wholesale and Retail Districts Meet'.<br />\nColibart<br />\nQ B.<br />\nTaylor<br />\nwith bigger and better paddles,<br />\nde;<br />\nLawrence<br />\nLH<br />\nDolan in the same way,\" were his words.<br />\nlee<br />\nTurnbull ......R.H... (Capt.) Abby<br />\nIn spite of the fact that he gave surround him and begin a rapid<br />\nKisloski<br />\nF B.<br />\nBlanch<br />\ntitl<br />\naway a very great deal, he never fire of questions: \"Who's PresiScore By Periods:<br />\nSoi<br />\nJohns Hopkins ....0 7 14 0-21 gave more than he thought was dent of Student Council? Of the<br />\n0 0— 0 needed and then only to those who Musical Club? Who's Graduate<br />\nMt. St. Mary's....0 0<br />\nto<br />\nTouchdowns — Gilliece, Bickford,<br />\nManager?\"<br />\nWhen<br />\nthe<br />\nbefuddled<br />\nPe<br />\nthemselves<br />\nhelp<br />\nable<br />\nto<br />\nTurnbull. Tries for points—Turnbull, would be<br />\n3 out of 3 (by placement, Taylor hold- if given the chance. His idea was representative of '28 has answered<br />\ndat<br />\ning the ball). First downs—Hopkins,<br />\n\"Doc' Adams\" or \"George the<br />\nand individuality is offered here at prices that are not<br />\n8; Mt. St. Mary's, 4. Penalties—Hop- the giving of the opportunity.<br />\nand cannot be underquoted by any house at any time.<br />\nkins, 40 yards; Mt. St. Mary's, 60<br />\ndis<br />\njanitor,\"<br />\nor<br />\nshamefully<br />\nadmitted<br />\nIt was.during his latter days that<br />\nyards. Substitutions—Hopkins: Liebthat<br />\nhe<br />\ndoesn't know, he is bent<br />\nstn<br />\n(Besides the reputation of an old-established firm<br />\nensperger for Biddison (Slowik moving he developed the plans of a uniis back of each sale with a guarantee.<br />\nto tackle and Liebensperger to guard); versity and a hospital. On the 24th over and justice is fully adminisSt;<br />\nMallonee for Oles; Bickford for Lawchi<br />\ntered.<br />\nThus<br />\nit<br />\nhas<br />\ngone,<br />\nthus<br />\nit<br />\nwere<br />\nso<br />\nplans<br />\nthe<br />\n1867,<br />\nAugust,<br />\nof<br />\nrence; Levy for Day. Mt. St. Mary's:<br />\nFarrell for Poke; Reilly for Farrell; complete that he incorporated them goes and thus it will continue to<br />\nUlf<br />\nCrt4inger for Foley. Referee—A. C.<br />\ngo<br />\nunless<br />\nthe<br />\nfrosh<br />\nlearn<br />\neither<br />\nof<br />\nState<br />\nthe<br />\nof<br />\nlaws<br />\nthe<br />\nunder<br />\nMaxwell (Brown).<br />\nUmpire—J. T.<br />\nFURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nClinton (Yale). Head linesman—J. J. Maryland. The degree of his fore- the lists completely, or all travel<br />\nga<br />\nThomas (Lafayette). Time of quarin<br />\none<br />\ngroup.<br />\nhf<br />\nhis<br />\nsepa343 NORTH CHARLES STREET<br />\nsight is shown clearly in<br />\nters-15 minutes.<br />\n<br />\nThe winning<br />\nstride<br />\n<br />\nPayne &Merrill<br />\n<br />\nVaseline<br />\n<br />\nHAIR TONIC<br />\n<br />\nELDORA1JV -rgai<br />\n<br />\nATTENTION!<br />\n<br />\nI<br />\n<br />\nCloiftes if Custom Quality tract<br />\n14 N.Charles Street.\"<br />\n<br />\nSTUDENTS<br />\n<br />\noi<br />\n<br />\nJohns Hopkins Students Will Find A Welcome<br />\n<br />\n200<br />\n<br />\n040.0.0.04.00I404,04041441,0.0.<br />\n<br />\nBETHOL1<br />\n<br />\nHUTZLER WirilEM (0';<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK,<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\n\f", "format": "basic_html", "processed": "DE<br /><br />\nVOL. XXIX, No 4<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 14, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nOVER ONE HUNDRED STORM<br />\nJOHNS HOPKINS, SELF-EDUCATED, REALIZED<br />\nOPENING MEETING OF<br />\nVAST IMPORTANCE OF COLLEGE TRAINING<br />\nMUSCIAL CLUB '<br />\n7<br />\nTo familiarize the undergraduate body, and outside readers, with the<br />\nearly days when the Johns Hopkins University was first a dream and Keen Competition Expected For Quarthen an experiment, the News-Letter here begins a series of articles on<br />\ntet; Japanese Tenor Among<br />\nTalented Candidates<br />\nWatchful Waiting Brings Blue Jay Eleven Victory in Annual EnHopkins' history. The first article describes the life and character of<br />\nThe<br />\n_1<br />\nohns<br />\nMusirn1<br />\nHopkins<br />\ncounter with Mountaineers<br />\nJohns Hopans,-the originator, the founder.—Editor's Note<br />\nClub, under the supervision of<br />\nPlaying wide-awake, though somewhat colorless football, the Hopwinter picked up what scant eduMr. Hobart Smock, got off to a kins eleven administered a glowing coat of whitewash to the Mt. St.<br />\ncation the county schools offered,<br />\nwonderful start Thursday night, Mary gridders last Saturday at Homewood, while rolling up 21 points<br />\nusing this to tutor his younger<br />\nSeptember 9, when President themselves. Although the Emmitsburgers registered four first downs<br />\nbrothers and sisters. Too, he was<br />\nTilghman called the meeting to they really threatened the Black and Blue's goal line<br />\nbut once. In the<br />\nvery fond of reading. All the order<br />\nthere were sixty-one candi- second period Mt. St. Mary's had the ball on Hopkins'<br />\nF.ET5<br />\n8-yard line, as<br />\nbooks within reach by horseback, dates<br />\nfor the Glee Club and forty- the result of two successive 5-yard penalties. Here,<br />\nhowever, the line<br />\nhe found and absorbed, particularly seven for the Banjo<br />\nClub present. held for three downs .and Turnbull quickly punted out<br />\nof danger when<br />\nthe works of Shakespeare, histor- Among them were several<br />\ntalenties, and biographies. All his life he ed and promising new men. In the Saints fumbled.<br />\nBlocked Kicks Figure<br />\nread much for books were,the only the Glee Club one of particular<br />\nHopkins' three touchdowns<br />\nreal and thorough education he note is Moriya, a Japanese, who<br />\nwere gained through two blocked<br />\nmanaged to get, and they served sings second tenor.<br />\nkicks and a lateral pass from Tayto make him appreciate the fine<br />\nThere will be very keen compelor to Turnbull. The latter's toe<br />\narts.<br />\ntition for positions on the quar- Spirited Yell Practice Follows The was in fine form and after each<br />\nBefore he was eighteen he went tet this year, inasmuch as it will<br />\nFormal Meeting<br />\nJohns Hopkins was born on<br />\ntouchdown he sent the ball sailing<br />\nto<br />\nBaltimore and into the counting go with the Omicron Delta Kappa<br />\nrather large farm near Annapolis,<br />\nAfter opening the weekly as- cleanly over the bars for the extra<br />\nMaryland, in May, 1795. Ens rooms of his uncle, the owner of Fraternity on its tour. The quar- sembly with the singing of the point.<br />\nI's mother was known for her intelli- a wholesale grocery of wide inter- tet will alSo sing at the assem- Ode, Dean Ames made several im- The first Quarter ended with the<br />\n, ests,--His ability astonished every-. blies of thd prep schools that the<br />\ngence and for-c—e of chiracter<br />\niC<br />\nportant announcements, the first ball in midfield, neither team havgave her a prominent position one. He said little, however, and, 0. D. K. visits.<br />\nof<br />\nwhich pertained to Mrs. Turn- ing made substantial gains. In<br />\nWith the new banjos, mandoamong the Quakers of Maryland by keen perception, familiarized<br />\nbull's<br />\nseries of lectures to be given the second quarter an exchange of<br />\nand Virginia. She was generous, himself with all the aspects of the lins, and guitars the Banjo Club<br />\nthis<br />\nweek<br />\nby Mr. De La Mare. kicks placed the pigskin on the<br />\ntrade, spending seven years. there. looks forward to beating the entoo,<br />\na<br />\nwhich<br />\ntrait<br />\nran<br />\nfar<br />\nback<br />\nin<br />\nE\"<br />\nIn 1819, with only four hundred viable record they established last These lectures are \"to be a discus- Mountaineers' 15-yard line. Here<br />\nmar the family.<br />\ndollars saved, he decided to go in- year. The music has been order- sion of poetry as such\" and the Quarterback Golibart signaled for<br />\nfirst of them will have to do with a kick. Poke, his center, howJohns was the first of eleven chil- to business for himself, endorsed<br />\ned and will probably be here for<br />\ndren and he was given the old an- by<br />\nworks of Keats, the famous ever, heaved a pass over Dolan's<br />\nthe<br />\nhis uncle.<br />\nthe next meeting. The program<br />\ncestral name. As he grew up, he<br />\npoet. The Dean urged all head. Before he could recover<br />\nBritish<br />\nUnwilling to spend his small cap- for the Musical Club this year inworked on the farm and during the<br />\nundergraduates to attend as himself the Black and Blue line<br />\nthe<br />\ncludes several interesting trips.<br />\nContinued on page 4, col. 2<br />\nPresident Tilghman is quoted as many of these lectures as possi- was on him and his kick was<br />\nSERIES OF ONE-ACT PLAYS DOUG TURNBULL ELECTED saying in regard to the out-of- ble for if is his desire that stu- blocked. Gilliece snatched up the<br />\ntown concerts: \"Spirit shown in dents should cultivate a taste for ball and trotted five yards for the<br />\nTO BE PRESENTED BY<br />\nLACROSSE CAPTAIN FOR<br />\nthe organization as well as talent poetry and other such arts. He first score. The half ended with<br />\nBARNSTORMERS<br />\nSECOND TIME<br />\nwill be considered in picking the also reminded the men that appli- the ball back in the center of the<br />\nNew Plan Should Discover New Tal- Ten<br />\ncations for Rhodes Scholarships field.<br />\nRegulars Back in School; Barton men for these trips.\"<br />\nent; Annual Production in<br />\nBickford Scores<br />\nIs Unable to Return to Hopkins<br />\nThe club was extremely fortu- must be filed before October 18,<br />\nMarch<br />\nThe Mountaineers chose to kick<br />\nDouglas Turnbull will again nate in obtaining the services of since his own report must go in<br />\nOne-act plays will be used by<br />\non that date. Dean Ames then off at the beginning of the third<br />\nthe Barnstorms Club this year in captain the lacrosse team. At a such a noted and talented contold of the reorganization of the quarter. Dolan's kick, however,<br />\nmeeting of the letter men, held ductor of music as Mr. Hobart<br />\n4 order to bring<br />\nPlayshop,<br />\nwhich is now under the was low and went straight for<br />\nto light any draSmock. Mr. Smock's ability as a<br />\nWednesday, he was unanimatic talent in the class of '28. last<br />\ndirection<br />\nof<br />\nDr. Small. The latter Day, who pluckily, blocked it<br />\nconductor of music began with<br />\nchosen<br />\nmously<br />\ntake<br />\nthe<br />\nto<br />\nplace<br />\nof<br />\nremoved<br />\nmany features which with his body and fell on it.<br />\nhas<br />\nhis college days at Rutgers, and<br />\nThis series of plays will be given<br />\n\"Tex\"<br />\nBarton,<br />\nwho<br />\nis<br />\nunable<br />\nto<br />\nAfter another exchange of<br />\nwere held as objectionable by last<br />\nsince then has grown steadily.<br />\nin November. They will be<br />\nreturn to college. With the mateyear's undergraduates and is cer- punts, Mt. St. Mary's was again<br />\ncoached by members of the club, rial on hand,\"Doug!s\"<br />\nsecond cap- SILVER CUPS OFFERED BY tain of a successful year if he can in possession of the ball in the<br />\nbut Mr. Swindell will attend the taincy bids fair to<br />\nbe as successobtain the co-operation of the stu- shadow of its own goal posts.<br />\nBLACK AND BLUE JAY<br />\ndent<br />\nperformances and take careful ful as his first.<br />\nHere Poke made his second bad<br />\nbody.<br />\nAnnouncement has been made<br />\nnote of the acting.<br />\npass to Dolan, who was back for<br />\nAt<br />\nthis<br />\npoint<br />\ntook<br />\nTom Magill<br />\nAlthough Barton's loss will be by \"Bob\" Griffith, Editor-in-Chief<br />\nkick. Once more the punt was<br />\na<br />\nIn previous years, the coach<br />\nhas felt, and graduation took such of the Black and Blue Jay, that to charge of the Assembly and anblocked<br />\nand this time Bickford,<br />\nnounced that moving pictures will<br />\nnot had an opportunity<br />\nto see new stars as Benedict, Bachman and every man in the undergraduate<br />\nwho<br />\nhad<br />\nreplaced Lawrence when<br />\nbe given this Wednesday by the<br />\ncandidates in action before the McDaniels, the team is fortunate department the Blue Jay offers an<br />\nmembers back: opportunity to win a silver loving American Society of Mechanical the latter's arm was injured,<br />\n\"H\"<br />\nin<br />\nten<br />\nhaving<br />\ncrowded days of the tryouts for<br />\nTurnbull, Bachman, Milbourne, cup. The Jay is inaugurating a Engineers. He also cautioned the picked up the ball and raced over<br />\nthe feature<br />\nplay which is usually Watson, Cone, Summers, Morrill, campaign for the improvement of men to exchange their A. A. tick- the line.<br />\npresented after the mid-years. The Bates, Kaufholz and Sanderson. its art, business and editorial de- ets for those required for admitThe final score was also indi4 Preliminary plays will<br />\ntance<br />\nto<br />\nthe<br />\ngame<br />\nwith<br />\nthe<br />\nUnipartments<br />\nrectly<br />\nwith<br />\nthe ultimate aim<br />\ntraceable to a blocked kick.<br />\nbe staged In addition to these of the old<br />\nversity of Pittsburgh on October Milanausky and Captain Magill<br />\nin the<br />\nincreasing<br />\nof<br />\nits<br />\nsize<br />\npromising<br />\nother<br />\nand<br />\ncircula.the<br />\nto<br />\nand<br />\nguard<br />\nBarnstormers' studio in the<br />\n4<br />\nmembers of last year's squad, an tion. Copy for the next issue is 18 at the Stadium. Townsend shared equally in this feat, the forBarn. Those taking parts<br />\nare exdue on October 15. All copy that spoke next and impressed on the mer blocking and the latter recovpected to gain- much valuable ex- unwonted number of former prep<br />\nschool stars have reported. Men is late will count on subsequent is- minds of the new men the neces- ering. This time after line bucks<br />\nperience through the coaching of<br />\nsity of unanimous and systematic had twice failed to advance the<br />\nof the ability of Griffith, Benson, sues.<br />\nBarnstormers and the criticisms<br />\nMann, Curlett, Mahool, Bolton, The awards will be presented cheering at all the games. The pigskin, Taylor, stepping back,<br />\nof Mr. Swindell.<br />\nMixdorff, Spence and Bauren- by a board of judges composed of cheering practice which followed passed to Turnbull, who had skirtThe play reading committee, in schmidt are a decided addition to the present Blue Jay Board of immediately after this proved that ed right end and awaited the pass<br />\nco<br />\nllaboration with Mr. Swindell, the squad. Oles, Liebensperger, Control, who, alone, will be ex- his words were not uttered in vain behind the goal line.<br />\nis hard at<br />\nwork selecting this Conant and Biddison, freshmen cluded from the contest. The cups for the C. E. building fairly viFinal Quarter Dull<br />\nyear's feature production. Several now playing football have signi- will be awarded at the annual ban- brated with deep-toned yells and<br />\nThe last quarter was slow and<br />\n4 Plays, all comedies,<br />\nare under con- fied their intention of playing la- quet of the Black and Blue Jay songs. Don Bolton and Will Rod- uneventful, the aerial attacks of<br />\nsideration. They include \"The crosse, and will be able to join the according to the following specifi- gers, two freshmen, who helped both sides proving<br />\ninefficient.<br />\nProfessor,\"<br />\nthe regular cheer leaders, should<br />\nby Sir James M. Bar- squad as soon as the football sea- cations:<br />\nWalker<br />\nTaylor<br />\nwas<br />\noff color in<br />\nre; \"Le<br />\n1. One cup to the man doing prove great assets for the cheer his judgment of Dolan's<br />\nMalade Imaginaire,\" by son is over.<br />\nlow punts<br />\nleading staff.<br />\nMoliere; \"The Importance of Bethat often sped past him for 30<br />\nManager Baker and Coach the best work in the .art departing Earnest,\" by<br />\nOscar.Wilde, and Schmeisser went to New York last ment from the present time to the<br />\nyards or more. Turnbull kicked<br />\na few more popular modern COMfairly well, two short boots marSaturday to attend the annual con- publication of the third from the<br />\nedies.<br />\nring a perfect day for him.<br />\nvention of the Intercollegiate La- last issue.<br />\nWith most of the cast of last crosse League. At the meeting .2. Another to the man doing the<br />\nThe most redeeming feature of<br />\nYear's \"Galloper\"<br />\neditorial<br />\ndepartment<br />\nbest<br />\nin<br />\nwork<br />\nfirst<br />\nThe<br />\ninterclass<br />\nbaseball<br />\npracthe<br />\nMt.<br />\nand<br />\nSt. Mary's showing was its<br />\nback, and with rules were discussed<br />\nthe new candidates expected,<br />\ntice of the season was held last steadfast line, which proved<br />\nthe league schedule arranged. Baker for the same period.<br />\nan<br />\nsuccess of the new<br />\n3. A third to the man doing the Friday on the diamond behind the enigma to the Blue Jay<br />\nplay seems as- announced that the team will<br />\nbackfield.<br />\nsured. The dates<br />\nA large early season crowd<br />\nof the produc- probably have a very heavy sched- best work in the business depart- Civil Engineering Building. The<br />\ntion have<br />\nment, also for the same period.<br />\npractice was marked chiefly by a watched the last appearance<br />\nbeen definitely set, Fri- ule.<br />\nof the<br />\nday and Saturday,<br />\nEveryone is invited to enter the large turnout of freshmen, nearly Blue Jays before the struggle at<br />\nMarch 27 and<br />\nFreshman candidates are espe428. It will<br />\nprobably be presented cially wanted for assistant mana- contest whether out for the staff thirty men reporting, however, the the Stadium, this Saturday, with<br />\nat the<br />\nContinued on page 4 col. 3<br />\nLyric.<br />\nContinued on page 2, col. 5.<br />\ngerial positions, as Baker is findContinued on page 4 col. 1<br /><br />\nBLOCKED KICKS DEFEAT<br />\nMT. ST. MARY'S IN SLOW<br />\nGAME AT HOMEWOOD, 21-0<br /><br />\nWALTER DE LA MARE WILL<br />\nLECTURE, ANNOUNCED<br />\nAT ASSEMBLY<br /><br />\nFROM A PAINTING BY A...1. MILLER<br /><br />\nSENIORS AND FROSH HOLD<br />\nSPIRITED EARLY<br />\nPRACTICE<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1924<br /><br />\n2<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by .the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 0100<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALGER HISS, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\nCirculation Manager<br />\nOTHO J. KELLER, III, '26<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br /><br />\nPRIZE OFFERED BY MAJOR WALLACE OLES ELECTED take the place of those who graduated last June.<br />\nFRESHMAN PRESIDENT<br />\nHOISINGTON FOR BEST<br />\nCAP DEVICE<br />\nAfter the Student Assembly, W. Nelson Young was electec<br />\nThursday, October 9, the Fresh- second lieutenant of the club to fill<br />\nContest for Most Distinctive Design<br />\nman class met to elect a president. the resignation of Robert Griffith<br />\nWill Close On Saturday,<br />\nNovember 15<br />\nThomas Magill called the meeting<br />\nTen dollars in gold will be to order and read the list of nomi- SILVER CUPS OFFERED BY BLACK<br />\nAND BLUE JAY<br />\nawd'rded the Hopkins undergradu- nees which was as follows: J. Curfrom page 1<br />\nContinued<br />\nate who designs the most distinc- lett, D. Kaufman, T. Biddison, G.<br />\nsr not. Copy will be received at<br />\ntive cap device for the Johns Hop- Mallonee, and G. Fenimore.<br />\nThe class voted that the nomina- 3lue Jay office on the third floor<br />\nkins unit of the R.0. T. C. Major<br />\nHoisington has offered that prize tions be reopened, and the names ,f the Barn, daily from 12.20 to 1<br />\nin order to stimulate competition of Blandi, Rodgers, Oles and War- '3. M.<br />\nin the contest. For those aspiring field were added. Warfield and Bid- EUGRADERS PRMTERS •—• BlIMERS<br />\nto the award, the cap devices of dison withdrew; and on a standing<br />\nother units are on .exhibition and ballot Blandi, Rogers, Kaufman,<br />\n\"exitukrude<br />\nmay be inspected at any time. Fennemore, Mallonee were elimThe desire for a unique device for inated. A written, signed ballot was<br />\nthe local unit led to the promotion then taken, on which Oles defeated<br />\nCurlett.<br />\nof the contest.<br />\nwinthe<br />\nchoose<br />\nFive judges will<br />\nning artist at the close of the con- CAPT. SCOBEY ELECTED TO<br />\nD<br />\ntest at noon, Saturday, November<br />\nMILITARY SOCIETY<br />\nV<br />\n15. They are Major George H. Captain Scobey, one of the comE.<br />\nHoisington, Dean Joseph S. Ames, manding officers of the Johns HopnALTitdoo<br />\nDr. Carol V. B. Wright, Alger kins R. 0. T. C. unit, who has<br />\nHiss and Cadet Major Ray Gai- charge of the freshman class in inPrinters of<br />\nther.<br />\nfantry drill was made an associate<br />\nRules of Contest<br />\ncThe Johns Hopkins<br />\nmember of the Scabbard and Blade<br />\nThe rules of the contest as<br />\nlast<br />\nmeeting<br />\nfirst<br />\ntheir<br />\nClub at<br />\nNEWS-LETTER<br />\nannounced by the military departweek. Several new members will<br />\nment are as follows:<br />\nbe initiated in the near future to LOMBARD and SOUTH ST R E.E15<br />\n1. Designs submitted to<br />\nbe in black and white, full<br />\nsize, the vertical height not<br />\nto exceed two inches.<br /><br />\nMember Southern Intercollegiate Newspaper Association<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 14, 1924<br /><br />\n2. All designs must be<br />\nsubmitted to Room 323,<br />\nMilitary Office, accompanied<br />\nby artist's name in a sealed<br />\nEnvelope.<br />\n3. Contest is open to any<br />\nundergraduate in the University.<br />\n4. Contest will close at<br />\nnoon, Saturday, November<br />\n15.<br /><br />\nFIRST THINGS FIRST<br />\nSpeaking before a group of freshmen recently a prominent member<br /><br />\nAny further information<br />\nregarding the contest may be<br />\nhad from the military office.<br /><br />\n. successful college career as one<br />\nof the student body characterized the<br />\nin which the undergraduate cultivated a wide acquaintance on the campus STEEL FABRICATION VIEWED<br />\nBY SENIOR ENGINEERS<br />\nand devotect himself largely to the pursuit of extra-curriculum activities.<br />\nStudents of the senior civil enCollege, undoubtedly, is the place to make those friendships which will gineering class last Wednesday, October 8, saw the actual fabrication<br />\nendure and mean something all through life, but that campus activities<br />\nof steel work for bridge work and<br />\nas<br />\nlife<br />\nundergraduate<br />\nthe<br />\nof<br />\npart<br />\na<br />\nimportant<br />\nso<br />\nform<br />\nrightfully<br />\nshould<br />\nstructures similar to those which<br />\nthey<br />\nhad designed. This view of<br />\nthey seem to do at present we do not agree.<br />\nthe practical side of the class room<br />\nThe college was originated back in the Middle Ages as a place of work came during a tour of inspection of the Carnegie Steel Comstudy and research. Since that time, however, it has gradually been pany, of Baltimore, which was<br />\ngrowing more and more to resemble a playground. Athletics, college taken by the class under the guidance of Mr. Guy Lee Bryan, of the<br />\nnewspapers, musical clubs, usurp-the-time which should really be -spent<br />\ncivil engineering department.<br />\nthemin<br />\nulum<br />\nactivities<br />\nextra-curric<br />\n*that<br />\nbelieve<br />\nnot<br />\ndo<br />\nThe various methods of shearing,<br />\nin study. We<br />\nand drilling the angles,<br />\ncutting<br />\nselves are harmful, we do not believe that they should be abandoned,<br />\nbeams and plates were observed, tobut we do feel that they should be indulged in with moderation.<br />\ngether with the riveting of the various component parts of the strucThe situation on this campus today is such that the student who ture firmly into position.<br />\nVarious<br />\nreading<br />\nand<br />\nprivate<br />\nwork<br />\nclass<br />\ntime<br />\nto<br />\nhis<br />\nof<br />\ntypes<br />\nof<br />\nplate<br />\npart<br />\nfor<br />\ngirders<br />\nuse in<br />\ngreater<br />\nthe<br />\ndevotes<br />\nwork<br />\nwere<br />\nalso<br />\nstudied.<br />\nrailroad<br />\nis looked upon as a \"grind.\" The modern American undergraduate has Although the size and<br />\nquantity of<br />\nfor<br />\nthe<br />\nstalwart<br />\nhis<br />\nin<br />\nadmiration<br />\ncollege<br />\nto<br />\ncame<br />\nbridge work produced by the Baltiforgotten why he ever<br />\nmore concern is relatively small<br />\nathlete and the \"big man, around college!:<br />\ncompared with the parent Pitts\"First Things First\" is the slogan of an undergraduate newspaper burgh plant, considerable color was<br />\nlent the masses of parts when it<br />\nhere in the East, and we believe it to be a good one for the American was learned that *the majority of it<br />\nundergraduate. Youth comes to college in order to play, to be sure, was to be exported to the Argentine and other countries in South<br />\nbut first it comes to college in order that it may broaden itself and learn America, and to China. Such trade<br />\nto use the experience of the past. Campus activities in their place are constitutes by far the largest. percentage of the bridge work busian excellent thing, but once we forget where they belong they become a ness of the Carnegie Company in<br />\nthis city.<br />\nmenace to undergraduate life.—The Rutgers Targum.<br />\nHere again we see the problem of extra-curriculum activities which<br />\nis facing nearly every _American college. THE NEWS-LETTER agrees<br />\nwith the views of the Rutgers' editor. While in a recent editorial we encouraged campus activities, we encouraged them with moderation; we do<br />\nnot wish to underrate them nor do we want to set up a false sense of<br />\nvalues of them. We believe that the Hopkins student body would do<br />\nwell in adopting the slogan \"First Things First.\"<br /><br />\nJust as the hairbrush<br />\n!eft it!<br /><br />\nCollege Men<br />\nnow keep their hair smooth,<br />\nlustrous, always in place<br />\nToday, as never before, college<br />\nmen have smooth,well-kept hair.<br />\nWhy?<br />\nA few years ago the hair was a<br />\nnuisance to almost everyone, for<br />\nit was usually the least attractive<br />\npart of the appearance — always<br />\nunkempt and unsightly an hour<br />\nafter being combed.<br />\nThere was no way, then, to keep<br />\nit from being so. Old-fashioned<br />\npomades only matted it and made<br />\nit greasy. Water evaporated quickly<br />\nand left it drier and more unruly<br />\nthan ever.<br /><br />\nToday everyone can have<br />\nsmooth, neatly combed hair<br />\nNow Stacomb — a delicate, invisible cream for keeping the hair in<br />\nplace — has changed all that.<br />\nIt is responsible for the amazingly<br />\nimproved appearance of men's hair.<br />\nAnd it has made possible for every<br />\nwoman, however \"difficult\" her<br />\nhair, the new smooth effect so much<br /><br />\nYou can get Stacomb in convenient jars and tubes, at all drug and<br />\ndepartment stores. Non-staining<br />\nand non-greasy. Use it tomorrow<br />\nmorning — and look your best all<br />\nday!<br /><br />\nin vogue.<br />\nIn clubs and fraternities, at the<br />\ntheatre or the game, today you can<br /><br />\n11104.161MT.OIL<br /><br />\nKEEPS THE HAIR IN PLACE'<br /><br />\nNOT/CES<br />\nY. M. C. A. Fellowship Dinner<br />\nat the Friends' Meeting House,<br />\n3107 N. Charles St., 6 o'clock<br />\nthis evening. Subscription, 50c<br />\nper plate.<br />\nCandidates for cast of Barnstormers report in the Studio tomorrow at 12:20.<br /><br />\nseldom find even one case of unkempt hair.<br />\nPeople who know that the hair<br />\ncan ruin the whole appearance—<br />\npeople who are careful about the<br />\nway they look — have given Stacomb an important place on their<br />\nchiffonier or dressing table.<br />\nNo matter how dry and straggly<br />\nyour hair may be — no matter how<br />\nuncontrollable after being washed<br />\n— Stacomb will keep it always<br />\nin place, smooth, lustrous, natural.<br />\nA touch of it in the morning when<br />\nyou comb your hair — and allday<br />\nlong your hair will be just as you<br />\nwant it, for Stacomb will keep it<br />\nsmoothly in place until you go to<br />\nbed at night.<br /><br />\n1Stand arc' Laboratories,Inc.., Dept.<br /><br />\n113W.18th St.,New York City<br />\nI<br /><br />\nFree<br />\nOffer:<br /><br />\nPlease send me, free of charge, a<br />\ngenerous sample tube of Stacomb.<br /><br />\nName<br />\nAddress<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, OCTOBER 14, 1924<br /><br />\ngrad - RIFLE<br /><br />\nectec<br />\n.0 fill<br /><br />\niffith<br /><br />\n.ACK<br /><br />\nd at<br />\nfloor<br />\nto 1<br /><br />\nDERS<br /><br />\nA STORE OF CAPTAINS<br />\nTHE NEWS-LETTER<br />\nTEAM SCHEDULE<br />\nMAILBAG<br />\nANNOUNCED<br />\nMuch attention has been attracted this season by the Stu\"Hopkins will hang'up a string<br />\nof<br />\nAll<br />\nintended for publication<br />\nvictories in her shooting must letters<br />\nbe concise, written in ink on dent's Store located at the Barn.<br />\nregular letter size paper, on one side Representing five downtown mermatches this year,\" declared F. only.<br />\nNo attention will be paid to anony- chants, Hopkins' own collegiate<br />\nH. Steck, captain of the rifle team, mous<br />\nletters, but names- signed as an<br />\nevidence of good faith will not be shop under the proprietorship of<br />\nat an organization meeting of printed if request is made that they be<br />\nDouglas Turnbull, Jr., lacrosse<br />\nomitted.<br />\nthe rifle club held last Tuesday,<br />\nThe publication of a letter is not to captain, and Thomas Magill, capbe taken as an indorsement of its views<br />\nWhich was attended by more than by the \"News-Letter,\" which Invites the tain of football, is offering a wide<br />\n'freest discussion of matters of general<br />\ninterest.<br />\nvariety of wares, including suits,<br />\nseventy-five men.<br />\nhats, ties, belts, Hopkins buckles,<br />\nThe members of the club will<br />\nslickers, and in fact everything to<br />\nhe coached by Lieutenant Sher- To the Editor:<br />\nlure<br />\nthe college student. The BalThe Publicity Board at Johns<br />\nwood. The coach's policy is to<br />\ntimore firms reprobsented are<br />\nhave a team composed of the high Hopkins has been making a terrible<br />\nOST young men today<br />\nVan, Hess, Spalding, Katz and<br />\nknow the importance of<br />\nscorers of the preceding week howl about having no place to carry Warner.<br />\nwriter<br />\nreceived<br />\nThe<br />\nlooking<br />\nfit. Good apshoot in each weekly match. In on their work.<br />\nThe store has a unique history.<br />\npearance counts much<br />\nOther words, there is not one place a letter from one of last year's Founded in 1921 by Andrew<br />\non the team filled permanently. graduates, now working in New Knecht and Thomas Landy, it<br />\nin the game of life. The young<br />\nman who dresses with taste has<br />\nThe practice scores for the week Jersey, saying that he had sub- was managed in 1922-23 by Lanthe<br />\ndy,<br />\nwas<br />\nthen<br />\ncaptain<br />\nof<br />\nwho<br />\na decided advantage.<br />\ndetermine the representatives of scribed to the Baltimore Sun in<br />\nteam. \"Buck\" Bonner,<br />\nfootball<br />\nthe club for each match.<br />\nhopes of getting some 'news of<br />\nBut—it is surprising how little<br />\nlast year's popular football capLast season a team represent- Hopkins activities. He is a former tain, ran the store during the<br />\nthought the average man gives<br />\ning Hopkins competed with nine editor of the Publicity Board but 1923-24 term. This year the shop<br />\nto his hat. It is his crown, yet he<br />\nOther teams in New York City. has this to say: \"I'm subscribing is again under the managership of<br />\nseems to stop dressing at the neck.<br />\nOur men landed fourth place.<br />\nto the Baltimore Sun but find what leaders in athletics.<br />\nBe careful in your selection of<br />\nThe tentative schedule for this I'd hope to see—Hopkins news—<br />\nyour<br />\nheadwear. When you buy a<br />\nyear presents. an opportunity for sadly lacking. What is the mathat, select a Stetson. Its style is<br />\nGeorgetown to satisfy her thirst ter? There wasn't even the usual<br />\nMAN UFACTURINC JEWELERS<br />\nright,<br />\nits quality means long wear.<br />\nfor revenge for last year's defeat dope on the opening of school itLancaster, Pa.<br />\nin a shoulder to shoulder match. self, much less anything to speak<br />\nClass Rings, Pins, Fraternity Pins<br />\nCups, Medals, Etc.<br />\nSimilar matches are pending with of on football. But talk about news<br />\nthe University of Maryland and<br />\nof Maryland—there's a book full Stationery, Invitations, Programmes<br />\nManager<br />\nGettysburg College.<br />\n\"Makers of the Varsity Seals\"<br />\nevery day.\"<br />\nAshley has issued challenges to<br />\nPrinceton, Penn, U. of W. Va., That Hopkins is not receiving<br />\nand others. Challenges have been enough publicity is deplorable. The<br />\nreceived from Drexel, Carnegie Publicity Board has thus far this<br />\nTech, and Chicago and the team year been inactive. This is inexWill take part in the N. R. A.<br />\ncusable. Although they lack quarmeet.<br />\nThe great majority of the ters, some work ought to be done;<br />\nmatches are conducted by mail. and if they were extremely anxious<br />\nHowever, the rivalry is keener to make headway, they would wake<br />\nin the shoulder to shoulder match up and realize that it is not imKb! Pen and Eversharp are<br />\nobtainable in matched<br />\nin which both teams-shoot on the<br />\nsets<br />\n-poss-ibre to get some place to dO<br />\nsame range.<br />\ntheir work.<br />\nThe club has purchased new<br />\nThe Dean has recently put a roam<br />\nrifles, and practice will be started<br />\naside in the basement of the Chemat once.<br />\nical Laboratory for the use of the<br />\nStudent Council where they will<br />\nFIELD CLUB PACKS PEP<br />\nmeet every Friday. It is doubtful<br />\nA good start is half of the bat- if the heads of the Publicity Board<br />\ntle. One would believe that such have even attempted to see Dr.<br />\nAn unqualified guaranteestands<br />\nis the motto of the Field Club if Ames about arrangements. The<br />\nback of every Wahl<br />\nhe could have looked in at the re- NEWS-LETTER uses its offices only<br />\nproduct<br />\norganization meeting in Gilman on Tuesdays and Fridays, and the<br />\nHall. The Field Club is one which Publicity Board could have this<br />\nappeals to students interested in room as their headquarters on any<br />\noutdoor life. Students of the bio- other days in the week. It is true<br />\nlogical department are advised to that they would have to keep their<br />\njoin the club,.but.n.o,effort is_made files elsewhere, but it is practicall:for compulsory membeship. Un- certain that Y. M. C. A. would not<br />\nlike other clubs the Field Club un- object to a few files in the Trophy<br />\ntil the current year, has never Room in order that such important<br />\ncharged any dues or other fees. work may be carried on.<br />\nThis year, however, owing to proIt looks to the writer like the<br />\nposed plans which involve ex- Publicity Board is not living up<br />\nSide by side in your pocket, Eversharp and Wahl<br />\npense, dues are to be charged. to its duty as a Hopkins activity.<br />\nPen<br />\nare ever ready to serve your thoughts.<br />\nThese dues, however, will involve Their good work of last year will<br />\nDurability<br />\nand dependability are common qualities<br />\nsuch a small sum of money that be lost if some action is not taken<br />\nof<br />\nthese<br />\neconomical,<br />\npractical writing companions.<br />\nthey will be practically non-exist- in the near future.<br />\nThe<br />\nnon-clogging<br />\nrifled<br />\ntip, quick reloading, and<br />\nent.<br />\nYours truly,<br />\ncomplete interchangeability of parts are among the<br />\nA HOPKINS BOOSTER,<br />\nSeveral topics of interest were<br />\nsix new features which make the perfected Eversharp.<br />\ndiscussed in this meeting. Among<br />\nAnd the Wahl all-metal Pen is at par with EverOthers were several short hikes<br />\nsharp<br />\nin giving thorough satisfaction. Light in<br />\nWhich promise to prove interest- MEREDITH INELIGIBLE AS<br />\nweight, perfect in balance, resistant to wear, and<br />\ning to those attending. One of<br />\nSOPHOMORE DELEGATE<br />\nbeautiful in design—it is the ideal pen.<br />\nthese hikes will be to the banks of<br />\nBecause of a misunderstanding<br />\nEversharp, $1 to $45.<br />\nWahl Pen, $5 to $55.<br />\nthe<br />\nGunpowder River at Loch of the rules of eligibility, Frank<br />\nMadein the U.S.A.byTHEWAHL COMPANY,Chicago<br />\nRaven, for the purpose of catch- Meredith was elected Sophomore<br />\nCanadian Factory,THE WAHL COMPANY,Ltd.,Toronto<br />\ning different varieties of insects. delegat to the Student Council at<br />\nManufaaurers ofthe Wahl Eversharp and the WahlAll-MetalFountain Pen<br />\nMr. Myers, who will be in charge the last class meeting. It was<br />\nof the<br />\nhikes, has been very suc- overlooked that he was already a<br />\ncessful in his searches for interest- delegate to the A. A. Board and<br />\ning insects and has<br />\na very fine col- therefore automatically ineligible<br />\nlection. It is the plan of the club to serve on the Student'Council.<br />\nto buy an old mansion house,<br />\nAt the next meeting the class<br />\nWhich is so situated so as to be will elect a delegate from the origaccessible to the members. This inal nominations. They were<br />\nhouse will<br />\nbe used as a place for Douglas Frantz, Edward Passano,<br />\nthe exhibit of the<br />\nclub's collection Malcolm Cleaveland, Francis Harof insects. It also will be used wood and Arthur Niner, retiring<br />\nfor the<br />\nconvenience of members. president of the Sophomore class.<br /><br />\ngor Young Men<br /><br />\nThere is nothing like a<br /><br />\nSTETSON<br /><br />\nJ. F. APPLE CO.<br /><br />\nE.F.15<br /><br />\njr<br /><br />\na-<br /><br />\njr<br /><br />\nly<br /><br />\n2c1<br /><br />\nys<br /><br />\n)11<br />\nit<br />\nto<br /><br />\nn-<br /><br />\nid<br />\nig<br /><br />\n2W<br /><br />\nall<br /><br />\nComplete Writing Equipment<br /><br />\n[<br /><br />\nCE<br /><br />\nIT<br /><br />\na<br /><br />\nThe New PERFECTED<br />\nWAIiifill/M5HAPP<br /><br />\n69W4I1<br />\n- 1 PfiN<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 14, 1924<br /><br />\nJOHNS HOPKINS, SELF-EDUCATED, REALIZED<br />\nVAST IMPORTANCE OF COLLEGE TRAINING<br /><br />\nORDERS RECEIVED FOR<br /><br />\nFOR THE STUDENTS<br /><br />\nCOGGIN'S<br /><br />\nContinued from page I, col. 2<br /><br />\nBring This to the Address Below<br />\nTransfer &amp; Baggage Express<br />\nital in supplies, he filled the barrels rating the different needs of the When You Want Anything in the<br />\nVOL.<br />\nAUTOMOBILE SERVICE<br />\nDRUG LINE<br />\nand boxes in his small shop with medical students with their wards<br />\nPHONE, HOMEWOOD 6886<br />\nsand and kept his money in work- and clinics from those of the stuHUL<br />\ning form. He sold by sample. If dents in the arts and sciences. In R. G.Loy &amp; Company<br />\nS1<br />\na customer wanted a second box of a letter to his appointed trustees,<br />\n(Robert G. Loy)<br />\ntea or bag of coffee, Johns would nine months before his death, he<br />\nPHARMACISTS<br />\nhurry off to some importer and gave no precise directions. They<br />\nUNIVERSITY PARKWAY<br />\npurchase it, replacing his sample were unhampered but their general<br />\nSeven<br />\nAt Charles St.<br />\nPr;<br />\nwas<br />\nvery<br />\nclearly<br />\ncourse<br />\nof<br />\naction<br />\ncome<br />\nshould<br />\nfor thebusiness..<br />\nnext one who<br />\noutlined.<br />\nSlowly, at first, by<br />\nin on<br />\nWatch him at the \"Prom.\" He's<br />\nXV<br />\nthere with perfect ballroom conhis credit good, As the embryo university grew<br />\ncarefully<br />\nkeeping<br />\nDamon—<br />\npatent<br />\ndition from soles of his<br />\n'tartf<br />\n\"What's the matter?<br />\npumps to top of his glossy dome.<br />\nhe built up his trade in this unique into form, his interest grew keen,<br />\nCan't you read your<br />\nThe<br />\nHe's just as neat after the twentieth<br />\nbut determined way. And it was but he died many, many months benotes of the lecture?\"<br />\ndance as during the first foxtrot. There's<br />\nhard<br />\nno secret about his method. \"Vaseline\"<br />\nnot many years later that his firm fore the inauguration of the first<br />\nPythias—<br />\nHair Tonic goes to his head regularly.<br />\nnum'<br />\n\"No—doggone it. I<br />\nIt makes his hair silky and manageable<br />\nwas known all through the South. president. He passed away on the<br />\nand prevents dandruff. At all drug stores<br />\nto class<br />\nskipped<br />\nover<br />\nhein{<br />\nHis will<br />\nand student barber shops.<br />\nthis morning without<br />\nDuring those years it is said 24th of December, 1873.<br />\nadvei<br />\nEvery \"Vaseline\"Product is recommy Dixon's Eldorado 1\"<br />\ngave seven million dollars, divided<br />\nmended everywhere because of its<br />\nJohns Hopkins \"shaved\" money.<br />\nCLOTHIERS<br />\ncient<br />\nabsolute purity and effectiveness.<br />\nuniversity<br />\nand<br />\nthe<br />\nequally,<br />\nto<br />\nthe<br />\n17 leads—all dealers<br />\nHe would write a check with the<br />\nsize<br />\nHABERDASHERS<br />\nthe direction of<br />\nrequest that it be not used for a hospital. Under<br />\nIXL_<br />\n2<br />\nch<br />\nseparately endowed<br />\nweek, perhaps, in order to save a the hospital, he<br />\ncolored<br />\nchildren.<br />\norphanage<br />\nfor<br />\nan<br />\nREG.U.S.PAT.OPP.<br />\n315 Charles St. North<br />\nfew days' interest on an unbroken<br />\ngreat<br />\nMaryland's<br />\nmermeet<br />\nof<br />\nOne<br />\ndeposit. It was one of his eccenthe<br />\nlimsterdrawargpenail\"<br />\nBaltimore's<br />\nour<br />\nchants, one of<br />\ngreatest<br />\ntricities.<br />\nFor the Health and<br />\n-this<br />\nmen, our founder, Johns Hopkins<br />\nAppearance of the Hair<br />\nLater in life (1847) when he had has left a monument which has set<br />\nread,<br />\nChesebrough mfg. Co..(Cons'd)<br />\nNew York<br />\nState Street<br />\namassed a fortune, he became a di- an example to the whole country. BRANCH<br />\n4)‘‘,<br />\nAT THE BARN<br />\nrector of the Baltimore and Ohio<br />\n-oo<br />\nBy T. D. B.<br />\nRailroad, then still young and unhe<br />\nfinished as far as the original plans SENIORS AND FROSH HOLD<br />\nover,<br />\nSPIRITED PRACTICE<br />\nwere concerned. Some time later<br />\ntake i<br />\nContinued front page I<br />\nit nearly became the ruin of the<br />\ngeth,<br />\nseniors mustered only a little more<br />\nState, because of inability to meet<br />\nthan a full team.<br />\nits obligations in extending and finA light workout was the order of<br />\nishing the road, without which, of<br />\nthe<br />\nday, the men tossing the ball<br />\nJune<br />\ncourse, the whole project would be<br />\nDOUG TURNBULL<br />\nTOM MAGILL,<br />\naround<br />\na<br />\nbit<br />\nand<br />\nthe<br />\ntwo<br />\ninfields<br />\nthe<br />\nRepresentatives<br />\nuseless. Seeing the wonderful posMan a get<br />\n,<br />\nworking<br />\nout<br />\nunder<br />\nthe<br />\ndirection<br />\nof<br />\n(1011(<br />\nsibilities which such an organization<br />\nin<br />\nKeene, the Varsity captain. The<br />\ncould command by connecting the<br />\npractice<br />\nwas<br />\nquite<br />\nfast,<br />\nCoach<br />\nAt vide'<br />\nfertile agricultural valleys of MarySheets 100 Envelopes<br />\nwith the<br />\nally<br />\ngrowing Keene being well pleased<br />\nVirginia<br />\nwith<br />\na<br />\nland<br />\nand<br />\nMOUNT<br />\nVERNON PLACE<br />\nHigh grade, white bond paper—unwork.<br />\nThe<br />\nfreshmen<br />\nshowed<br />\nplent<br />\nMETHODIST EPISCOPAL used<br />\nusually smooth writing surface. Enmarket, he pledged his whole forvelopes to match.<br />\nof promise,'giving Keene an oppor.<br />\nGin]<br />\n(At the CHURCH<br />\nYOUR NAME AND ADDRESS<br />\ncause, inspiring others<br />\ntune<br />\nto<br />\nthe<br />\nPRINTED FREE<br />\nWashington Monument) \\Vat<br />\ntunity to pick a fairly fast infield<br />\neventually<br />\nput<br />\nand<br />\nton every sheet and envelope, in rich<br />\ndo<br />\nthe<br />\nsame,<br />\nto<br />\ndark blue ink, up to 4 lines. (Note<br />\nThe seniors took the field with th(<br />\nPrin<br />\nREV. OSCAR THOMAS<br />\n—our low price does not allow any<br />\nthe<br />\nrailroad on a sound basis. This<br />\nvariation in printing. Top center of<br />\nfollowing lineup: Gilpin, 1st base<br />\nof t:<br />\nOLSON,<br />\nD.D.,<br />\nonly.)<br />\nenvelope<br />\nof<br />\nsheet and flap<br />\nis but a single example of his greatMinister<br />\nType is Engravers Gothic, designed<br />\nChesney,<br />\nStull,<br />\n2nd<br />\nbase;<br />\nshortand<br />\nespecially for clearness and good taste<br />\nest faculty—foresight.<br />\nSunday Services of Worship thei:<br />\nJust send your name and address<br />\nWales,<br />\n3rd<br />\nbase.<br />\nManastop;<br />\nand<br />\n(write or print clearly) with $1.00<br />\nA rich man, Hopkins became the<br />\n1 1 A. M. and 8 P. M.<br />\n(west of Denver and outside of the,<br />\nhan, last year's senior pitcher,<br />\nhome\" deal<br />\nU. S. $1.10) and this generous box of<br />\nobject<br />\nof charitable organizations<br />\nThe<br />\nSunday afternoon -at<br />\nstationery will come to you neatly<br />\nshowed<br />\nplenty<br />\nof<br />\nspeed,<br />\nbut<br />\nwas<br />\na<br />\nfrom 5 to 7 P. M. in the Blue and Grey gett<br />\nboxed, postage prepaid. Money rehim<br />\nrequesting gifts of money. But he<br />\nfunded if you are not more than<br />\nlittle wild. However, he will, no<br />\nRoom is a social occasion that bringt di°,<br />\nsatisfied.<br />\n\"My<br />\nmoney<br />\nnearly always refused:<br />\ntogether the student groups from Hop<br />\ndoubt, settle down and give his opkins, University of Maryland, Goucher oont<br />\nis not intended for you. It is not ponents<br />\n-plenty of trouble when the<br />\nPeabody, and other schools of Balti arm<br />\nPrepaid<br />\nmine. I did not make it. But I season opens.<br />\nAsendorf, another<br />\n„ for<br />\nPostage<br />\nmorpe*<br />\nE worth League at 7 P. M. and tn. ,<br />\nknow what it is for and I must senior, also showed up well in the<br />\nBible class at 10 A. M. are built par ley,<br />\nkeep to my work.\".<br />\nticularly with the needs of the yount<br />\nbox.<br />\nPERSONAL STATIONERY CO.<br />\nMich.<br />\nDetroit,<br />\n1036 Beaubien St.<br />\npeople in mind.<br />\nJohns Hopkins had a deep con- The first game is scheduled for<br />\nmar<br />\nscience. He believed God gave him Friday, the seventeenth, betweer.<br />\nniar<br />\nwhat he had for some worthy pur- the sophomores and the seniors<br />\n.1,,10101.4 .014q.ê14i, .14<br />\ncam<br />\npose; not as most men Consider The sophomores have the best out'<br />\nthemselves creators of their own look for the season, all of their. men<br />\nSMART APPAREL and FURNISHINGS<br />\nhan<br />\nfortunes, made for themselves. It being back with the exception of<br />\nwor<br />\nfor Campus and Sports<br />\nseems he realized the handicap of MacNeal, who will probably be<br />\nlarg<br />\n•<br />\nno education with respect to success hindered front- plaYing. .by Vafsity<br />\nnes;<br />\nselection<br />\nof<br />\nthe<br />\ncollege<br />\nman.<br />\nAwait<br />\nthe<br />\n\"THE WONDER MOTOR FUEL'<br />\nand happiness from his own life. football.<br />\neng<br />\nAnd this feeling developed into the<br />\nAll present indications point to<br />\nYor<br />\nidea of the great university Which an interesting season.<br />\nSHERWOOD BROTHERS, INC.<br />\nbears his- name and which became<br />\nhav<br />\nannwrirrvrFrinInmanntatemtellalaill=g1g0=g0 the recipient of nearly all his SOPHS INCREASE ACTIVITY<br />\nThe clear crack of the paddle<br />\nwealth.<br />\nHOPKINS WINS, 21-0<br />\nhas<br />\nbeen resounding with reHopkins was far from selfish.<br />\nContinued from page 1<br />\nfrequency over the Hopnewed<br />\nof five<br />\nthe Pittsburgh Panthers, conquer- As an instance, he was one<br />\nkins<br />\nduring the last few<br />\ncampus<br />\nmen who each advanced a poor<br />\nors of West Virginia.<br />\ndays.<br />\nThe<br />\ndecree<br />\nhas gone forth<br />\nwidow the sum of a hundred dolThe Line-Up:<br />\nPos. Mt. St. Mary's lars with which to open a shop. that freshmen must know \"Who's<br />\nHopkins<br />\nLE.<br />\nSheehy Years later when the money was Who,\" and the bewildered yearOles<br />\naud<br />\nDanker<br />\nMagill (Capt.)..L T.<br />\nling<br />\nlife<br />\nis<br />\nfinding<br />\ndarn<br />\njust<br />\none<br />\nwel<br />\nother<br />\ninterest,<br />\nthe<br />\nMilanausky ....L G.<br />\nMoore returned with<br />\nin<br />\nPoke four pocketed it and said nothing. question after another. No soonDay<br />\nRG<br />\nSlowik<br />\nFoley<br />\n7'W.'Corner C-- czyelie and Cutaw 81s.<br />\ner does he venture toward the<br />\nat<br />\nBiddison<br />\nR T<br />\n• Buckley Hopkins refused it all.<br />\ngroups<br />\nbarn<br />\nthan<br />\n.<br />\nRE.<br />\nCampbell<br />\nof<br />\nsophomores,<br />\nGilliece<br />\nYot<br />\n\"Keep it and lend it to another<br />\n-Where Wholesale and Retail Districts Meet'.<br />\nColibart<br />\nQ B.<br />\nTaylor<br />\nwith bigger and better paddles,<br />\nde;<br />\nLawrence<br />\nLH<br />\nDolan in the same way,\" were his words.<br />\nlee<br />\nTurnbull ......R.H... (Capt.) Abby<br />\nIn spite of the fact that he gave surround him and begin a rapid<br />\nKisloski<br />\nF B.<br />\nBlanch<br />\ntitl<br />\naway a very great deal, he never fire of questions: \"Who's PresiScore By Periods:<br />\nSoi<br />\nJohns Hopkins ....0 7 14 0-21 gave more than he thought was dent of Student Council? Of the<br />\n0 0— 0 needed and then only to those who Musical Club? Who's Graduate<br />\nMt. St. Mary's....0 0<br />\nto<br />\nTouchdowns — Gilliece, Bickford,<br />\nManager?\"<br />\nWhen<br />\nthe<br />\nbefuddled<br />\nPe<br />\nthemselves<br />\nhelp<br />\nable<br />\nto<br />\nTurnbull. Tries for points—Turnbull, would be<br />\n3 out of 3 (by placement, Taylor hold- if given the chance. His idea was representative of '28 has answered<br />\ndat<br />\ning the ball). First downs—Hopkins,<br />\n\"Doc' Adams\" or \"George the<br />\nand individuality is offered here at prices that are not<br />\n8; Mt. St. Mary's, 4. Penalties—Hop- the giving of the opportunity.<br />\nand cannot be underquoted by any house at any time.<br />\nkins, 40 yards; Mt. St. Mary's, 60<br />\ndis<br />\njanitor,\"<br />\nor<br />\nshamefully<br />\nadmitted<br />\nIt was.during his latter days that<br />\nyards. Substitutions—Hopkins: Liebthat<br />\nhe<br />\ndoesn't know, he is bent<br />\nstn<br />\n(Besides the reputation of an old-established firm<br />\nensperger for Biddison (Slowik moving he developed the plans of a uniis back of each sale with a guarantee.<br />\nto tackle and Liebensperger to guard); versity and a hospital. On the 24th over and justice is fully adminisSt;<br />\nMallonee for Oles; Bickford for Lawchi<br />\ntered.<br />\nThus<br />\nit<br />\nhas<br />\ngone,<br />\nthus<br />\nit<br />\nwere<br />\nso<br />\nplans<br />\nthe<br />\n1867,<br />\nAugust,<br />\nof<br />\nrence; Levy for Day. Mt. St. Mary's:<br />\nFarrell for Poke; Reilly for Farrell; complete that he incorporated them goes and thus it will continue to<br />\nUlf<br />\nCrt4inger for Foley. Referee—A. C.<br />\ngo<br />\nunless<br />\nthe<br />\nfrosh<br />\nlearn<br />\neither<br />\nof<br />\nState<br />\nthe<br />\nof<br />\nlaws<br />\nthe<br />\nunder<br />\nMaxwell (Brown).<br />\nUmpire—J. T.<br />\nFURNITURE<br />\nDECORATIONS<br />\nDRAPERIES<br />\nClinton (Yale). Head linesman—J. J. Maryland. The degree of his fore- the lists completely, or all travel<br />\nga<br />\nThomas (Lafayette). Time of quarin<br />\none<br />\ngroup.<br />\nhf<br />\nhis<br />\nsepa343 NORTH CHARLES STREET<br />\nsight is shown clearly in<br />\nters-15 minutes.<br /><br />\nThe winning<br />\nstride<br /><br />\nPayne &amp;Merrill<br /><br />\nVaseline<br /><br />\nHAIR TONIC<br /><br />\nELDORA1JV -rgai<br /><br />\nATTENTION!<br /><br />\nI<br /><br />\nCloiftes if Custom Quality tract<br />\n14 N.Charles Street.\"<br /><br />\nSTUDENTS<br /><br />\noi<br /><br />\nJohns Hopkins Students Will Find A Welcome<br /><br />\n200<br /><br />\n040.0.0.04.00I404,04041441,0.0.<br /><br />\nBETHOL1<br /><br />\nHUTZLER WirilEM (0';<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK,<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />"}], "field_media_file": [{"target_id": 37891, "display": null, "description": null, "target_type": "file", "target_uuid": "93b7657e-b073-40aa-9ab3-70fdef3c34fa", "url": "http://digital.library.jhu.edu/system/files/2022-03/13134-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13134, "target_type": "node", "target_uuid": "91900e6a-b550-4794-be30-2c8dc2ea498d", "url": "/node/13134"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "95c9ee0a-f194-4123-8fd3-e094c54449fe"}]}