{"mid": [{"value": 36819}], "uuid": [{"value": "2dd34a66-1975-4aca-bb4e-08179a82c418"}], "vid": [{"value": 36819}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13045-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": ">5<br />\n<br />\nL<br />\n<br />\nVOL. XXVII. No. 31<br />\n<br />\nBALTIMORE, MD., FEBRUARY 16, 1923<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nLARGEST COLLEGES IN MID- FIVE MEN INITIATED INTO TRYOUTS FOR THE SOUTH- COACHES ADDRESS LA- MUSICAL CLUBS CONCERT<br />\nSIGMA UPSILON LITERN ORATORICAL CONDLE ATLANTIC STATES<br />\nCROSSE MEN AT ORGANIAT CASUALTY CLUBERARY FRATERNITY<br />\nTEST FEBRUARY 27<br />\nTO BE REPRESENTED<br />\nZATION MEETING<br />\nHOUSE WEDNESDAY<br />\nUndergraduate<br />\nDelegation<br />\nof<br />\nLimMembership<br />\nHopkins to Be Host to Five South- Three Trips on Schedule An- Feature Numbers on Program.<br />\nNavy to Send Large<br />\nited to 12. Four Members of<br />\nern Universilies. J. H. U.<br />\nRunners. Joie Ray Unable to<br />\nnounced by Manager Collins.<br />\nTickets Selling Fast. Dance to<br />\nFaculty to Belong<br />\nHolds Title<br />\nBe at Fifth Armory Games<br />\n\"On to Navy\" Slogan<br />\nFollow Concert<br />\nLast<br />\nnight<br />\nMonday<br />\no'clock,<br />\nat<br />\n8<br />\nThe<br />\nFifty<br />\nannual home concert of the<br />\ncandidates for the Black<br />\nTryouts will be held on February<br />\nOne of the leading attractions at<br />\nthe Johns Hopkins-Fifth Regiment at the Kappa Sigma Chapter 27, at 12.20, in Room 112, Gilman and Blue lacrosse team received Combined Musical Clubs will be<br />\ntheir initial impetus last Tuesday held next Wednesday evening, Febgames next week will be the team House, five new men were taken Hall, for the Southern Oratorical<br />\nat<br />\nthe organization meeting in the<br />\nruary 21, in the Auditorium of the<br />\nwhich the Naval Academy will into the Purple Gown Chapter of Contest, which will take place on M. E. Building. This<br />\nyear's coachSigma<br />\nthe<br />\nUpsilon<br />\nFraternity.<br />\nThe<br />\nCasualty Clubhouse.<br />\nApril 14. As this is the most im- ing committee and three former Maryland<br />\nsend to Baltimore. The Midshipwho<br />\nwere<br />\nfive<br />\nput<br />\nthrough<br />\nthe<br />\nmysThis<br />\nconcert,<br />\nwhich was formerly<br />\nportant<br />\nnon-athletic<br />\nrunners<br />\nthis<br />\ncontest at Hop- coaches spoke to the men on varimen have many good<br />\nrites<br />\nof<br />\ntic<br />\nthe<br />\nkins<br />\nfirst degree were<br />\nthis year, Dr. French is mak- ous lacrosse topics. Bill Schmies- held for two nights in the auditoryear, having lost but a few men<br />\ning<br />\nevery<br />\neffort to obtain the most ser, chairman of the coaching ium of the Civil Engineering BuildHoward<br />\nB.<br />\nHensel,<br />\nCarl<br />\nW.<br />\nBuckfrom the champion team of last<br />\neligible<br />\ncandidate<br />\nto represent the committee, acted as presiding offi- ing, under the name of<br />\nMcDaniels,<br />\nheister,<br />\nJ.<br />\nRanMilton<br />\nthe Annual<br />\nyear. At present -the Annapolis<br />\nuniversity. Notice for the tryouts cer at the meeting, introducing Homewood Concert,<br />\nwill<br />\nnow be<br />\ndolph<br />\nNorwood<br />\nand<br />\nWilliam<br />\nG.<br />\nboys are listed to enter the medley<br />\nare given such a long time in ad- the speakers.<br />\nheld<br />\nat<br />\nthe<br />\nMaryland<br />\nCasualty<br />\nrelay and the officials are trying to Dean.<br />\nvance because the speeches to be<br />\nCaptain John Murphy was the Building because of the better faSigma Upsilon is a national lit- delivered at that time, while they<br />\nbook several more attractive events<br />\nfirst of those to speak. He de- cilities. The expenses, however,<br />\nfor them. Besides the Naval Acad- erary fraternity which was found- must be short, should be finished plored the unfavorable weather, are unusually large, and the leaders<br />\nand the candidate ready to display stating that from now on practice of the clubs,<br />\ntherefore, depend upemy, many other large -colleges will ed in the South in 1906 by the interall his powers.<br />\nof<br />\nthe<br />\ncollegiate<br />\nunion<br />\nliterary<br />\nsowill<br />\nregularly<br />\nbe<br />\nheld<br />\nto<br />\non<br />\ndevelop<br />\nthe<br />\nunqualified<br />\nsupport of the<br />\nenter the meet.<br />\nThe speeches for the tryouts stickwork and to round the squad entire student<br />\nbody.<br />\nfive<br />\nThe members<br />\nof<br />\nthe<br />\nof<br />\ncieties<br />\ncolleges<br />\nlargest<br />\nIn order to make a thrilling<br />\nshould not exceed five minutes in into condition. Murphy declared of the<br />\nAlumni<br />\nAssociation,<br />\nalso,<br />\nmatch, Coach Van Orman has in the Southern States. Since 1906, length. They must be prepared in that Hopkins has a well balanced have<br />\npledged<br />\ntheir<br />\nsupport,<br />\nand<br />\nas<br />\nplans afoot to-pit Lafayette and Le- the original five chapters have in- advance and memorized. The can- schedule this year, much more so a result the success of the concert<br />\nhigh in a mile relay. The two Penn- creased to twenty-eight, the latest didate will be chosen strictly on the than in the last two years. He is practically assured.<br />\nof the more recent chapters being showing at the tryout.<br />\nwarned everybody that in spite The Combined Musical Clubs<br />\nsylvania institutions are sworn rithe \"Purple Gown\" of Hopkins. The subject of the speech should of the great number of experi- consisting of<br />\nover seventy-five men,<br />\nvals, their contests always being a The fraternity is well distributed be upon some topic of current inenced players on the squad not is composed of the Glee Club, the<br />\nfight-to-win. Should Van Orman through the South and is now ex- terest. The following subjects are<br />\none position on the team has been Mandolin Club, the Jazz Band, the<br />\nbe successful in contracting this panding to the Western colleges. suggested:<br />\nassigned to a man and that a man Saxaphone Sextet, the Quartet, the<br />\nThe British and Allied debts.<br />\nrace, the crowd would have an ex- Many of the state institutions of<br />\nwho is new at the game will stand Blue Jay Six, and several novelty<br />\nReparations.<br />\ntra thrill besides those already the Western States have recently<br />\nas good a chance of making the acts. \"Dal\" Kirwan will present<br />\nhad chapters installed, and many<br />\nThe French invasion of the team as an old player. \"Hard his usual black-face<br />\nact and \"Joe\"<br />\ncarded.<br />\nmore requests for charters are now Ruhr.<br />\nwork<br />\nand<br />\nhead<br />\na<br />\ngood<br />\nwill<br />\nwin<br />\na<br />\nMoran<br />\nwill<br />\ngive<br />\nan<br />\n\"Impersonation<br />\nsend<br />\na<br />\nto<br />\nasked<br />\nbeen<br />\nhas<br />\nYale<br />\npending.<br />\nChild labor.<br />\nberth on the Homewood team,\" of Joe Cook.\"<br />\nteam to Baltimore on the twentyThe purposes of Sigma Upsilon<br />\nProhibition.<br />\naccording to the captain.<br />\nThe Glee Club will open the conIt is to be remembered that the 0. D. Collins, manager, an- cert with<br />\nfourth, and it is likely that the Bull- are to foster good fellowship and<br />\n\"Honey, I Wants Yer<br />\ndogs from New Haven will come. an appreciation for literature of all contest is oratorical, and it not a nounced the schedule for the com- Now,\" \"Old Black Joe,\" \"Annie<br />\nThe Elies will not want for com- ages, and to study interesting liter- debate. It is not necessary to prove ing season. Three trips are in Laurie,\" \"Sunflower Coon,\" and<br />\nature under congenial and sociable a proposition; but only necessary store for the \"butterfly chasers\": several other<br />\nselections. The Manpetition, as Pittsburgh, Princeton,<br />\nconditions. In many colleges, cur- to present a subject forcefully and the first on'April 28, to Stevens, dolin<br />\nClub,<br />\nunder<br />\nthe direction of<br />\nMassachusetts Institute of Tech- rent literary societies have simply convincingly.<br />\nat Hoboken; the s nond, on May Mr. G. H. McCauley, will follow<br />\nnology, Virginia and Georgetown merged into a chapter of Sigma<br />\nThe title of Southern Collegiate 12, to the Naval Academy, and with<br />\nselected numbers utilizing<br />\nhave already signified their inten- U. The need of a fraternity of Orator now rests at Hopkins, and the third, on May 26, to Lehigh, at popular dance<br />\nmusic as encores.<br />\ntions of being represented. A mile this type has long been felt at Hop- it is desired to keep it here. The South Bethlehem. Collins also Then there will be selections by the<br />\nrelay between Pittsburgh and M. I. kins. At present, no literary so- institutions competing, in addition spoke of the schedule for the \"Red Blue Jay Six, the Saxaphone Sexciety exists on the campus as such, to Hopkins, will be Vanderbilt. Eagles.\" Besides the customary tet and the<br />\nQuartet.<br />\nT. will be arranged if possible.<br />\nand there has really been no organ- Kentucky, Sewanee, Alabama and games with Poly and City it is The University<br />\nQuartet, consistBoth schools have good teams and ization which is adapted to the ser- North Carolina.<br />\nplanned to match the Hopkins ing of \"Johnny\" Sherwood, second<br />\nthe rivalry between them is keen. veying of literature. A few years<br />\nThe president of the league, Al- scrubs against St. John's; Penn bass;<br />\n\"Jack\" Croker, first bass;<br />\nPrinceton and Navy will furnish past, an undergraduate literary so- bert G. Langeluttig, Jr., graduate Freshmen and the Maryland State Mercer, second<br />\ntenor, and Maccubteams well worth watching. The ciety did exist at Hopkins. This student in Political Science at Hop- scrubs.<br />\nin, first tenor, will render several<br />\nMr. Schmiesser gave a short selections.<br />\nTigers have several good runners railed, however, probably due to the kins, would like to talk to prospeclack of sufficient ties to bind the tive candidates at any time in the history of lacrosse at Hopkins.<br />\nHe There will also be three solos: a<br />\nto wear the black and gold, and<br />\nmembers together. In the appear- historical library.<br />\ntold of how the game was intro- guitar solo by Waldo Hambleton,<br />\nthey are sure to uphold the good ance of the new fraternity<br />\non the<br />\nduced in Baltimore in 1880 by a a piano solo by Maurice Sater ; and<br />\nrecords made by their college Mates campus, a decided renaissance of<br />\nBaltimorean.<br />\nMr. Alexander a banjo solo by Mr. G. H. Macaulin previous years. University of undergraduate interest in literature CO-EDUCATION DOOMED BY<br />\nBrown, who had seen it played in ey. After the concert, a dance will<br />\nVOTE OF 232 TO 37<br />\nVirginia, in spite of the loss of is expected. It is hoped that Sigma<br />\nCanada. Mr. Brown brought a set be held in the ballroom of the MaryBy an overwhelming vote of 232 of equipment with him when he land Casualty Building, the music<br />\nthree of last year's stars, expects to Upsilon may prove to be the startcarry off some of the top honors ing point of inter-collegiate literary to 37, the Hopkins male undergrad- returned from Canada, soon after being •furnished by the Blue<br />\nJay<br />\nrelations for Johns Hopkins.<br />\nnext Saturday.<br />\nuates have expressed their disap- organizing the \"Druids\" and sub- Six.<br />\nThe program of the Purple proval of female intrusion into the sequently the \"Pattersons,\" two The next<br />\nMaryland State has decided to<br />\nconcert, February 21,<br />\nsend a large delegation to the Gown chapter for the coming undergradluate body Recently, sev- teams which gained their names will be held at Westminster. Conmeet. The College Park lads are months will probably be a series of eral female students in the College from the city parks in which they certs are also pending at Cumberon the warpath for the black and brief reviews of the works of con- Course for Teachers had been ply- played. Several of the players on land and Frederick.<br />\nblue scalp. They have booked a temporary American authors. It is ing the NEWS-LETTER Mail-Bag these teams were Hopkins men<br />\nmatch with the Varsity relay, in possible that the entire time de- with letters demanding \"equal and it was they who started a colWhich they hope to repeat the drub- voted to the club activities may be rights\" for women at Hopkins; and lege team. Several other colleges<br />\nBLACK AND BLUE JAY<br />\nbing delivered to Hopkins last fall spent in an examination of the as a result, it was finally decided were induced to start such teams<br />\nCORRECTION<br />\non the gridiron. The State fresh- poetry produced in and about Bal- to take a vote among the student and in a few years lacrosse had be- In the last<br />\nissue of the NEWSmen are trying to book a race with timore. The ultimate purpose of body and determine the \"public come a popular intercollegiate<br />\nLETTER<br />\nappeared<br />\nan announcethe Homewood yearlings, a match the chapter is to furnish recreation opinion.\" The results show that of sport.<br />\nment to the effect that due to an<br />\nWhich should hold the interest of and pleasant social connections for 269 students turning in ballots only<br />\nDr. Abercrombie spoke on the error the name of Donald H. Kirkmany Baltimore speed fans. Rut- all its members.<br />\n13 per cent were in favor of grant- close rivalry which has always ex- ley was<br />\nincluded in the staff<br />\nAn edict which comes from the ing their \"sister students\" the re- isted between Lehigh and Hopgers is another college which has<br />\nin the February issue. This should<br />\nrecently decided to try for Hop- National Council is that no more quested \"equal rights.\"<br />\nkins. This prolonged struggle be- have read: \"Due to an error<br />\nkins' scalp in a relay. Captain Aar- than twelve members of the under- The class presidents, the inem- tween the two colleges started in the<br />\nname of Donald H. Kirkley<br />\n°r15on is confident that his team can graduate body of any college or bers of the Student Council, and 1897 when the Black and Blue was omitted<br />\nfrom the staff in the<br />\ndo well against all would-be scalp- university may belong to the so- others prominent in college activ- stickmen were roughly handled in<br />\nFebruary issue.\"<br />\nciety in any one year. The Purple ities, were all found to be emphat- South Bethlehem. Hopkins reers.<br />\nMr. Kirkley was a member of<br />\nJoie Ray, the great international Gown Chapter was installed at ically opposed to co-education.<br />\nturned to Lehigh the following the staff at the time the issue went<br />\nrecord holder, is unable to come to Homewood last year just previous<br />\nSeveral of the college wits found year determined to beat the Penn- to press and,<br />\nalthough he is no lonBaltimore for the J. H. U. meet, as to the spring examinations. Dr. this an ample opportunity to ex- sylvanians. A hard fought battle ger a<br />\nmember,<br />\nhis name should<br />\nhe is going to run in the indoor Broadus Mitchell, a member of the press themselves. One was \"For finally gave the J. H. U. a 4-3 vichave been included in this issue.<br />\nmeet of the University of Illinois chapter at the University of North education; opposed to co-educa- tory.<br />\nDr. Abercrombie told<br />\non that night. Ray's inability to Carolina, was instrumental .in ef- tion.\" Another was in favor of the about the hard times the early laGet your tickets for the<br />\ncome is a gdisappointment to many fecting the installation. Dr. Her- plan if one of the entrance require- crosse teams had. As classes kept<br />\nHomewood<br />\nConcert at Barn<br />\nbert<br />\nGreene,<br />\nJohn<br />\nE.<br />\nDr.<br />\nC.<br />\nments is the passing of a beauty the students indoors until after<br />\nenthusiasts who were in hopes of<br />\nat<br />\n12.30<br />\nToday.<br />\nseeing the speed king perform. •<br />\ntest.<br />\nContinued on page 2, col. 4<br />\nContinued on page 2, col. 3<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 16, 1923<br />\n<br />\n7<br />\n<br />\nTAU BETA PI TO CHOOSE<br />\nNEW MEMBERS<br />\nA short business meeting of the<br />\nTau Beta Pi Honorary Engineering Fraternity was held Monday<br />\nnight at 8:30 o'clock, in Room 206,<br />\nMechanical Engineering Building.<br />\nThe primary purpose of the meeting was to lay plans for the choosing of new members. The actual<br />\nchoice, however, will not take place<br />\nuntil some time in May. At that<br />\nHopkins University.<br />\ntime the upper eighth of the Junior<br />\nthought advisable.<br />\nON<br />\nTHERE<br />\nGET<br />\nMUST<br />\nWE<br />\nMANClass will be eligible for memberBusiness communications should be addressed to the BUSINESS ions<br />\nWork by the committee has been<br />\nTIME. WHY NOT LEAVE<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communicat<br />\nvarion<br />\nBids<br />\nrapidly.<br />\ng<br />\nprogressin<br />\nship. The criterion of membership<br />\nshould be sent to the MANAGING EDITOR.<br />\nON TIME?<br />\ndance<br />\nthe<br />\nto<br />\npertaining<br />\nous items<br />\nconsists of scholarship, personality,<br />\nTo the Mailbag:<br />\n100 are being received. An elaborate<br />\nHomewood<br />\nTelephone<br />\nThere has recently been a great and participation in college activmenu has been planned, and novel<br />\nof objection on the part of the ities. At the same meeting, there<br />\ndeal<br />\nsouvenirs for members of the fair •<br />\nBusiness Manager:<br />\nstudents to the practice of teachers was some discussion concerning the<br />\nEditor-in-Chief:<br />\nsex have been selected.<br />\nWILLIAM H. MOORE, JR., '23.<br />\nGLOVER P. FALLON, '23.<br />\nto hold their classes past the time<br />\nLouis Fischer's orchestra of six of dismissal. This often causes late- election of graduate students and<br />\nManaging Editor:<br />\nAdvertising Manager:<br />\npieces will furnish music. Work ness for the next class and brings honorary members from the faculJ. HUDSON HUFFARD, '23.<br />\nDONALD K. VANNEMAN,'23.<br />\nthe elaborate decorations will a reprimand to the student when it ty. Nothing definite, however, was<br />\non<br />\nAssistant Managing Editor:<br />\nManager:<br />\nCirculation<br />\nby the Art Staff in the really is not his fault. It is rather decided upon.<br />\nstarted<br />\nbe<br />\nJOSEPH S. LEOPOLL '24.<br />\nPHILIP W. HOWARD, '25.<br />\nnear future to facilitate comple- difficult for the student to be disAssociate Editors<br />\nThe next meeting of the society<br />\ntion in ample time for the Prom. missed at, say five minutes past<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nAssistant Business Managers:<br />\nbe held at the Johns Hopkins<br />\nwill<br />\nWILLIAM G. DEAN, JR., '24.<br />\nIt has been definitely decided by time, from a class, on the third<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nClub, February 26. It will consist<br />\nthe Black and Blue Jay staff that floor of Gilman Hall, and expect<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\na supper followed by an attracof<br />\nthe next issue of that magazine him to report on time to a class in<br />\nD. MILES MARRIAN, '25.<br />\nJunior Editors:<br />\nG. DONALD GIESKE, '25.<br />\nwould be a Prom Number in hon- the M. E. Building. It is more tive literary program. Frank Wilen<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nof the occasion. This number than difficult ; it is practically im- and Edward Schaeffer will speak<br />\nor<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\n'26.<br />\nthe Blue Jay is due to appear possible.<br />\nof<br />\nTHOMSEN,<br />\nW. EDWARD<br />\non some topic of literary interest.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\njust three days before<br />\n20,<br />\ndismisthis<br />\nMarch<br />\nfor<br />\nlate<br />\nreason<br />\nThe<br />\nA. J. McICAY, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\nthe Prom.<br />\nsal of classes is the fact that, in<br />\nmost classrooms in Gilman Hall the<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nbell cannot be heard. It seems to<br />\nAPON<br />\nPUT<br />\nN<br />\nDAVIDSO<br />\nme that an adequate system of bellPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nPROVED LIST OF<br />\nringing for classes would do away<br />\nCOLLEGES<br />\nwith late dismissals, and thus oblitBALTIMORE, MD., FEBRUARY 16, 1923<br />\nDavidson has recently been put erate lateness for the next class. It<br />\nupon the approved list of the uni- is to be hoped that something will<br />\nversities and colleges of America. be done to attain this end.<br />\nOUR EDUCATIONAL DEBT<br />\nYours for prompt dismissal of<br />\nThe American Association of Unimembers,<br />\nof<br />\nclasses,<br />\nlists<br />\ntwo<br />\nUnited<br />\nthe<br />\nhas<br />\nover<br />\nversities<br />\nall<br />\nfrom<br />\nA conference of students from college<br />\nP. H. S.<br />\nthe first one containing only univerStates and from several of the North European countries met re- sities. The second list is for colFIVE MEN INITIATED INTO SIGMA<br />\ncently at Hartsdale, New York, to discuss student affairs and prob- leges whose work and standing are<br />\nUPSILON FRATERNITY<br />\nThis<br />\n.<br />\nassociation<br />\nthe<br />\nby<br />\napproved<br />\nHe has the pride of the peacock,the<br />\nContinued from page]<br />\nto<br />\nbroadcast<br />\nsent<br />\nwas<br />\nwhich<br />\ncourage ofthe lion and the combined<br />\nmeeting,<br />\nthe<br />\nof<br />\nlems. From the report<br />\nB.<br />\nA.<br />\nan<br />\nwith<br />\nstudent<br />\na<br />\nthat<br />\nmeans<br />\nnerve of the whole menagerie. And<br />\nFrench, and Dr. Thach are other<br />\nwhy? Because he is sure of himself<br />\nthe college papers, we gather the impression that the affair was con- from Davidson will be accepted members of the faculty who will be<br />\n—and sure of his appearance.<br />\nAs the last and cleverest touch to his<br />\nabroad and will be admitted to the<br />\nThe<br />\naffiliated with the fraternity.<br />\ntoilet, he smooths his mane with\"Vasetrolled by a group of New Thoughtists.<br />\nline\" Hair Tonic. His head stays dapper<br />\nhighest privileges of any institution.<br />\ncharter members of the Class of<br />\nand sleek throughout the giddiest<br />\nwhirls.<br />\nOne of the conclusions arrived at was that \"the higher educa- Before this time Davidson men 1923 are Lawrence B. Fenneman,<br />\n\"Vaseline\" Hair Tonic improves the<br />\nhair. At all drug stores and student<br />\nhave been accepted at Yale, HarWilliams, E. W. Berry,<br />\nbarber shops.<br />\ntion of today is provided at the expense of the laboring class which vard, Hopkins, Princeton and oth- Parker C.<br />\nEvery \"Vaseline\" product is recPaul L. Ives, Joseph A. Moran and<br />\nommended everywhere because of<br />\nn.<br />\nexaminatio<br />\nwithout<br />\nhigher<br />\nof<br />\ncolleges<br />\ner<br />\nproduct<br />\nthe<br />\nwhich<br />\nagainst<br />\nand<br />\ntherefrom<br />\nits absolute purity and effectiveness.<br />\nderives no benefit<br />\nLouis A. Kelley.<br />\nThis new distinction will be of pareducation is aimed; that therefore, we are indebted to this class and ticular beenfit to Rhodes scholars<br />\nLETTER GIVEN FOR HIKING<br />\nOxford.<br />\nto<br />\ngo<br />\ndeclared<br />\nwho<br />\ndelegates<br />\nradical<br />\nmore<br />\nthe<br />\nof<br />\nUniversity of Oregon co-eds riciw<br />\nmust repay our debt.\" Several<br />\nMarDoctor<br />\nand<br />\nLingle<br />\nDoctor<br />\nreceive varsity letters for hiking.<br />\nsuch education \"robbery\" and believed that withdrawal from their tin have been instrumental in havThe idea is to stimulate them to do<br />\nlist.<br />\nthis<br />\nthing.<br />\non<br />\nfair<br />\nonly<br />\nplaced<br />\ning Davidson<br />\nmore walking and to increase their<br />\nrespective institutions was the<br />\nCheseix-ough Mfg.Co.<br />\nphysical development. Letters are<br />\nStatistics recently released declared that more than one million<br />\n(Consolidated)<br />\nawarded to those having the highapthat<br />\nLACROSSE<br />\nADDRESS<br />\nindicates<br />\nThis<br />\nCOACHES<br />\nest average.<br />\nstudents are attendant upon college courses.<br />\nMEN AT ORGANIZATION MEETING<br />\nproximately one man in a hundred is taking advantage of the opporfrom page 1.<br />\nTHE NEWS LETTER'S<br />\nJUNIOR PROM SUBSCRIPMAILBAG<br />\nTION LOWERED<br />\nJunthe<br />\nWhich the Correspondents<br />\nin<br />\nof<br />\nColumn<br />\nmeeting<br />\nA<br />\nspecial<br />\nAt a<br />\nLatitude, But.ShoulAllowed<br />\nAre<br />\nior Prom Committee last Tuesday,<br />\nder the Responsibility.<br />\n1897.<br />\nFOUNDED<br />\nit was decided to lower the price<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nof the dance to $3.50 per couple. regular letter size paper, on one side<br />\nonly.<br />\n$2.00 It was felt that a higher price<br />\nNo attention will be paid to anonySubscription<br />\nmous letters, but names signed as an<br />\nwould make it impossible for many evidence<br />\nof good faith will not be<br />\nprinted if request is made that they be<br />\nfact<br />\nthe<br />\nin view of<br />\nomitted.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at to attend, and<br />\npublication of a letter is not to<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nthat the Junior Class wishes to beThe<br />\ntaken as an indorsement of its views<br />\nby the \"News-Letter,\" which -invites the<br />\nmake this affair open to the en- freest<br />\ndiscussion of matters of general<br />\nJohns<br />\nof<br />\ninterest.<br />\nPublished semi-weekly from October to June by the students<br />\nwas<br />\ndecrease<br />\nthe<br />\nschool,<br />\ntire<br />\n<br />\nThe Johns<br />\n<br />\nHopkins<br />\n<br />\nNews-Letter<br />\n<br />\n7he Stag<br />\n<br />\naseline<br />\n<br />\nHAIR TONIC<br />\n<br />\nContinued<br />\n<br />\ntunity either by day or night. This should certainly point out that dark, they were forced to get their<br />\npractice between seven and eightevery man who is strong enough,financially, to support higher educa- thirty in the morning. For all that<br />\ntion has an opportunity to partake of it. The \"laboring class that is Hopkins tasted defeat only at intervals of several years.<br />\nunable to take advantage of it\" probably contributes but a small<br />\nJohnny Knipp, the popular<br />\nproduct<br />\nthe<br />\nthat<br />\ndoubted<br />\ngreatly<br />\nalso<br />\nis<br />\nIt<br />\ncause.<br />\nits<br />\ntoward<br />\namount<br />\ncoach of last year's team, said a<br />\nlot in a very few words. \"We've<br />\nof higher education aims against the welfare of this class. As a rule,<br />\nbeaten Mt. Washington twice and<br />\nit aims toward establishment of better conditions for the poorer class. now it's time to beat Navy. We<br />\nare going to start operations imSince higher education has been offered on a large scale, millions<br />\nmediately, but no man can count<br />\n• have climbed from the dependent class to the level of men-of-affairs. on stepping into his old job. Hopkins has twelve open positions on<br />\nIf we have any debt, aside from that which we owe our immethe lacrosse team. Put your condiate families for their sacrifices, it is not to any class, but to a state fidence in the coaches and don't<br />\nbe ashamed to warm the bench if<br />\nof government that permits the freedom of education that young Amthey think it's necessary. Every<br />\nericans do enjoy. Our payment must be in the accomplishment of man must show fight to beat<br />\nNavy and Mt. Washington as well<br />\nbetter citizenship and a reverence for justice and fairness.<br />\nas the other teams on the schedThe suggestion of withdrawal from college is certainly unsound. ule.\"<br />\nIf our debt was to the laboring class, we could better pay it by edu- Tommy Troxel, Reaney Wolfe,<br />\nSam Silberstein and Pat Sullivan<br />\ncating ourselves and helping them to help themselves than cutting were among the others who gave<br />\nshort addresses to the candidates.<br />\nour throats in sympathy.<br />\nSilberstein will devote his time<br />\nThe college man must set the world an example of fair and just on the lacrosse field this year to<br />\ncoaching the \"Red Eagles.\"<br />\ncitizenship.<br />\n<br />\nimuminnimummiiimm<br />\nHe Reached the Top<br />\n<br />\nII<br />\nHE Vice-President of a great life insurance<br />\nIII<br />\nagent<br />\nan<br />\nas<br />\ncareer<br />\nhis<br />\nbegan<br />\nwho<br />\ncompany<br />\n111<br />\nII<br />\nhas this to say to seniors who are about to<br />\nII<br />\n1111<br />\ngraduate from college:<br />\nIll<br />\n\"If you love work and desire to pursue an honorable,<br />\nIII<br />\nuseful and lucrative mission in life this is the business<br />\nIII<br />\nfor you to take up. Life insurance salesmanship offers<br />\nII<br />\na fine field for the energies of the splendid young men<br />\nII<br />\nIII<br />\nin our colleges.<br />\n111<br />\nthis is true is demonstrated by those college men<br />\n\"That<br />\n1111<br />\nwho have taken up life insurance for they have shown<br />\nof<br />\nkind<br />\na<br />\njob<br />\nand<br />\nthis<br />\nfor<br />\nfit<br />\nIII<br />\nthat the college man is<br />\nU<br />\nthat the job also is fit for the college man.<br />\nII<br />\nII<br />\n\"The work ofthe life insurance salesman is distinguished<br />\nby independence and opportunityfor directing hisown.<br />\n111<br />\nIII<br />\nIt gives all possible opportunity for individual initiative<br />\nwhen<br />\nage<br />\nan<br />\nat<br />\nincome<br />\nample<br />\nan<br />\nmake<br />\nto<br />\nchance<br />\na<br />\n•<br />\nand<br />\nII<br />\nmost fellows are struggling on a wage pittance.\"<br />\nIN Thatis the story ofone who began at the bottom and 111<br />\nIII<br />\ntop without the help of a college educaIIII reached theadvantages<br />\nare with you who graduate<br />\nThe<br />\ntion.<br />\nII from college. Before deciding your career make in- ill<br />\nIII<br />\nII quiries of the \"Agency Department.\"<br />\nIllIII<br />\n/<br />\n4,07,f7.\"--'<br />\nIII<br />\nUI<br />\nIIII<br />\n------;.;,<br />\n1111<br />\nLIFE INSURANCE COMPANY<br />\nII<br />\nMI<br />\nLargest Fiduciary Institution in New England<br />\n1<br />\n11111111111111111111111111111111111111111111111111111M11111111<br />\nOF BOSTON. MASSACHUSETTS<br />\n<br />\n•<br />\n<br />\n\fhe<br />\n!ray<br />\n)6,<br />\n<br />\nt(y6'<br />\n<br />\n)S-<br />\n<br />\ntal<br />\nce<br />\nat<br />\nor<br />\n!rip<br />\n<br />\nvre<br />\nhe<br />\nid<br />\n11as<br />\n<br />\nty<br />\nns<br />\nist<br />\n-<br />\n<br />\nSn<br />\n.c<br />\n<br />\n.•<br />\n<br />\n3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 16, 1923<br />\n<br />\nWOMEN, WOMEN<br />\nGIEBEL STILL AT IT<br />\nDR. LILLIE DISCUSSES SEX<br />\nDETERMINATION<br />\nIn a swimming meet in which The other night in my sedan<br />\nLast Friday afternoon at 5 Rutgers defeated the Army at There was just her and me—her<br />\nman.<br />\no'clock, Dr. Lillie, of the Univer- West Point by the score of 35-27,<br />\nsity of Chicago, delivered a lecture Captain Giebel, of Rutgers, by a I talked of rain, and shine, and old<br />\nin Room 10, Gilman Hall, before wonderful exhibition of swimming Forgotten days, and pirates bold,<br />\nWARNER & COMPANY<br />\n.50<br />\na group composed chiefly of the in the 440-yard dash, established<br />\nand<br />\nwax,<br />\nsealing<br />\nAnd<br />\nand<br />\nships<br />\nHATTERS<br />\nup<br />\nteachers and graduate students of new intercollegiate record when he<br />\ngold.<br />\nfast<br />\nthe<br />\nmile<br />\nin<br />\nquarter<br />\nthe<br />\nswam<br />\nW.<br />\n222<br />\nBALTIMORE ST.<br />\nthe Biology Department.<br />\n\"I'm<br />\nsaid,<br />\nshe<br />\nall<br />\nat<br />\nonce<br />\nThen<br />\ncolformer<br />\nThe<br />\n1-5.<br />\n5.34<br />\ntime<br />\nof<br />\nforemost<br />\nDr. Lillie is one of the<br />\ncold.\"<br />\nmen of our country in his particular lege record for this distance was<br />\nthough cool, took off my coat<br />\nI,<br />\nSo<br />\nPrinceton,<br />\nof<br />\nHazleton,<br />\nby<br />\nheld<br />\nfield and has written the standard<br />\n5.39.<br />\nwas<br />\ntime<br />\nwhose<br />\nAnd wrapped my muffler 'round<br />\nwork on hormones and sex deterthe<br />\nin<br />\nthat<br />\nremembered<br />\nbe<br />\nwill<br />\nIt<br />\nher throat.<br />\nmination. His lecture on Friday<br />\nYou collegians who stroll along the campus will<br />\nconsisted of a brief introduction in meet between Hopkins and Rut- And then I talked of golfer's stance.<br />\nbe among the first to sense the coming of Spring.<br />\nwhich he rapidly went over the gers last year, Geibel was success- The styles in clothes, the latest<br />\nDoesn't that suggest something to you in the<br />\nmatter of clothes?<br />\nchief modern accepted principles ful in winning three firsts. This<br />\ndance,<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nrelating to sex determination, and same man will be seen here in BalAnd how the mediums faked a<br />\nSuits if you want to know college style at its best.<br />\nof a detailed account of the recent timore during March, at which<br />\ntrance.<br />\nare<br />\nresults of inquiries into the phe- time Rutgers and Hopkins<br />\ncold, but gosh! her<br />\nnomena occuring at times in twins scheduled to swim in a dual meet And I grew<br />\nglance<br />\nat the Baltimore Athletic Club.<br />\nof cattle.<br />\nBesides his remarkable exhibi- Was colder yet. I ask of you,<br />\nIt was explained that when the<br />\ntwins were one niale and one fe- tion in the 440, Giebel finished sec- Just what it was I failed to do?<br />\n(Y. M. B. 0. D.)<br />\n—Chicago Phoenix.<br />\nmale, it often Occurs that if the fe- ond in the 50-yard swim, and swam<br />\nrelay.<br />\nthe<br />\non<br />\nmale survives she will be sterile.<br />\nBaltimore and Hanover<br />\nExperimentation and observation<br />\nAT FORTY-FIVE MAN IS AT<br />\nhave proved that the-cause for this GENETICS STUDENTS COLHIS BEST<br />\nis in a connection between the blood<br />\nLECT INTERESTING DATA<br />\nAt 41 the average man has more<br />\nsupplies of two embryos before<br />\nThe class in zoology 360 have money than he ever had before or<br />\nbirth. By this means the blood of been making some interesting tabThe top of<br />\nthe male, containing ihe male hat-- ulations of their \"family trees.\" will ever have again.<br />\nDaily Prove the Merit of<br />\nis the<br />\nlives,<br />\nmost<br />\nin<br />\nhill,<br />\nmoney<br />\nthe<br />\nmones gets into the blood of the They have made a record of the apThousands of Users<br />\nthen on, it's usfemale and produces sterility by its pearance of certain physical char- 45 birthday. From<br />\nhill trip. And fewer<br />\nMEN'S SHOES<br />\npower. The male, however, is acteristics in their families for ually a down<br />\nthan<br />\n75<br />\nat<br />\nmore<br />\nor<br />\nmen<br />\nhave<br />\n$100<br />\nOf the Better Class<br />\nnever affected because the male three generations, including those<br />\nmore<br />\n50<br />\nhad<br />\nthey've<br />\nthough<br />\n25,<br />\nat<br />\ninterstital cells which give rise to of their grandparents, all the chilthe hormones are developed at an dren of their grandparents, and the years for accumulating.<br />\n-The Wonder Motor Fuel'<br />\nThese figures are announced by<br />\nearly period, when the embryo is members of their own generation.<br />\nman.<br />\ninsurance<br />\nJ.<br />\nDevney,<br />\nJoseph<br />\nAs Their Preference!<br />\nURNER BROTHERS<br />\nonly 3.7 mm. big, whereas, the feThe physical features recorded<br />\n1,by<br />\nhelped<br />\nan<br />\ninvestigation<br />\nafter<br />\nto<br />\nIII<br />\nE.<br />\nrise<br />\nSTREET<br />\nBALTIMORE<br />\ngiving<br />\ncells<br />\ninterstitial<br />\nmale<br />\nSHERWOOD BROTHERS, INC.<br />\nwere eye color, hair color, and hair<br />\nBALTIMORE<br />\nthe female harmones do not de- form, that is, a straight or curly. 000 bankers.<br />\nThe lesson behind it all is that<br />\nvelop until the embryo is nearly The tables were, in general, quite<br />\nready to be born at a size of 80 mm. in accordance with the accepted the average person is a money failThus the male cannot be affected. theories of human inheritance, and ure, and that to succeed you have<br />\nin<br />\nDr. Lillie went on to give fur- proved nothing startling or phe- to do better than the average<br />\ncunther accounts of some of the experi- nomenal. It was found out that of work, thrift, judgment and<br />\nand individuality is offered here at prices that are not<br />\nning.<br />\non<br />\ncarried<br />\nmental work now being<br />\nthe twenty-six members of the<br />\nand cannot be underquoted by any house atany time.<br />\n: elass, ten -had-factors--for red hair<br />\nby his students and__ allowed_ him<br />\nq Besides the reputation of an old-established firm<br />\nself to comment on its possible sig- in their families.<br />\nis back of each sale with a guarantee.<br />\nnifiCance. After his lecture, Dr.<br />\nhave<br />\n122,000<br />\nWe<br />\npurchased<br />\nput<br />\nLillie answered some questions<br />\nLARGE STADIUM FOR UNIpair U. S. Army Munson last<br />\nto him by various members of his<br />\nVERSITY OF ILLINOIS<br />\n2 to 12 which<br />\n/<br />\nshoes, sizes 51<br />\nFURNITURE<br />\nDRAPERIES<br />\n;DECORATIONS<br />\naudience.<br />\nwas the entire surplus stock<br />\nThe new stadium of the Univer343 NORTH CHARLES STREET<br />\nof one of the largest U. S.<br />\nThe work of Dr. Lillie is consid- sity of Illinois, costing over two<br />\nGovernment shoe contracmodern<br />\nto<br />\nimportance<br />\nered of most<br />\nmillion dollars, will be dedicated on<br />\ntors.<br />\nprobwill<br />\nit<br />\nas<br />\nbiological research,<br />\nNovember 3d, at the annual game<br />\nThis shoe is guaranteed one<br />\nably acutely change many of the with Chicago University. The stahundred per cent, solid leathformerly accepted notions as to the dium, exclusive of approaches, will<br />\ner, color dark tan, bellows<br />\nold mooted question of the relative cover an area of eight acres. The<br />\ntongue, dirt and waterproof.<br />\nThe Greetings of a Fine Store<br />\nThe actual value of this shoe<br />\nimportance of hereditary and en- east and west stands alone contain<br />\nis $6.00. Owing to this trevironmental influences.<br />\nTo the Students of a Fine University<br />\nseventeen miles of seats, with a camendous buy we can offer<br />\npacity of 55,000 persons. The comsame to the public at $2.95.<br />\nNON-FRATERNITY MEN OR- pletion of the north and south ends Send correct size. Pay postman on<br />\nGANIZE AT RUTGERS<br />\nwill bring the total seating capacity delivery or send money order. If<br />\n, A new campus social organiza- to 120,000. There will be a guar. shoes are not as represented we<br />\nHOCHSCHILD,KOHN<br />\ntion, named the \"College Lodge,\" ter-mile track around the arena, will cheerfully refund your money<br />\nupon request.<br />\nhas been formed at Rutgers by a which will also have two 220-yard promptly<br />\nnumber of non-fraternity men and straightways. The equipment which<br />\nhas secured the recognition and ap- the huge structure will have to<br />\nproval of the faculty.<br />\ntake care of the various sporting<br />\ninorganized<br />\nactivities will be the most modern<br />\nwas<br />\nsociety<br />\nThe<br />\nyear<br />\ncollege<br />\navailable.<br />\n296 Broadway, New York, N. Y.<br />\nthe<br />\nin<br />\nearly<br />\nformally<br />\nclassmen<br />\nupper<br />\nof<br />\ngroup<br />\nsmall<br />\nby a<br />\nwho had come to feel the need for<br />\nsome organization through which<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nthe neutrals might take a fuller<br />\ngeneral<br />\nthe<br />\nin<br />\nand more active part<br />\nOrchestra—Dancing<br />\nTelephone, Vernon 3442<br />\ncollege life.<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nIt is hoped by the creation of<br />\nTABLE D'HOTE<br />\nDINNER—$1.00<br />\nLUNCHEON-60c<br />\nthe College Lodge and by means of<br />\nmembership,<br />\n1.25<br />\nfor<br />\nDINNER—$<br />\nSUNDAY<br />\nrequirements<br />\nits<br />\nco-operamutual<br />\nand<br />\nfellowship,<br />\ntion, that it will serve to encourage<br />\nOf heavy Scotch Grain Leather; black or<br />\nnon-fraternity men to take a more<br />\nactive part in undergraduate activtan; equipped with rubber heel:—a colities and to strive for higher scholege shoe designed for real college men.<br />\nlastic standing. Moreover, it will<br />\nbe able to function as a fraternity<br />\nin social matters, particularly in reYOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nspect to dances and house parties.<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nThe organization is, however, in<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UPno sense a fraternity. Admission<br />\nAT CHARLES STREET<br />\nto membership is normally to be<br />\nsatisand<br />\napplication<br />\ngain1 upon<br />\n216 NORTH<br />\n1724 N. CHARLES ST.<br />\nfactiOn of certain set published reinvitaby<br />\n10 Minutes from Hopkins<br />\nquirements rather than<br />\n1 Vernon 3055<br />\ntion.<br />\n<br />\nThe \"COLLEGIAN\"<br />\n<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n<br />\n4<br />\n<br />\nitlaac<br />\n<br />\n-<br />\n<br />\nURNER'S<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nPUBLIC SALES<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\n8cCo.<br />\n<br />\nNational Bay State<br />\nShoe Company<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n<br />\nA Hopkins<br />\nBrogue $8<br />\n<br />\nRADIO!'<br />\n<br />\nSlesingers<br />\n<br />\nRADIO SUPPLY CO.<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 16, 1923<br />\n<br />\nRIFLE TEAM MAKES SCORE<br />\nHOPKINS GRADUATE IS<br />\nSTUDENT CONFERENCE<br />\nPROMINENT IN \"Y\"<br />\nHARTSDALEOF<br />\nSTAGE<br />\nFIRST<br />\n949<br />\nIN<br />\n,<br />\nAT<br />\nHELD<br />\nThe Medical Standard Book Co.<br />\nPlaying KEITH Attractions<br />\nWORK<br />\nOF INTERCOLLEGIATES<br />\nNEW YORK<br />\n(THE BOOK MART)<br />\nShooting Done from Prone and<br />\nAfter three and one-half years as<br />\nA student conference was held<br />\nWeek of February 19<br />\nYork,<br />\nPositions.<br />\nSitting<br />\nU.<br />\nof<br />\nCal.<br />\nHartsdale,<br />\nNew<br />\nrecently<br />\nat<br />\nsecretary for the American 3—PERFORMANCES WASHINGTON'S<br />\nchief<br />\nComplete Stock of<br />\nBIRTHDAY-3<br />\nBeing Met This Week<br />\nby the political clubs of several col- Y. M. C. A. with the American<br />\nMedical Books and College<br />\n1.45, 4.45 and 8 P. M.<br />\nRequisites<br />\nThe score made by the Johns leges composing the National Stu- Forces in Germany, and a total of<br />\nFOUR GREAT AND EQUAL HEADLINES<br />\nImporters and Dealers in Fine Books Hopkins Rifle Team in the first dent Forum. The conference was<br />\nand<br />\nyears<br />\none-half<br />\nfive<br />\nof<br />\nuninterweek of the intercollegiates was an- different from most held in the fact<br />\nDe Lyle Alda<br />\n301 N. CHARLES ST.<br />\n\"SADIE—ONE OF THOSE GIRLS\"<br />\nnounced by Capt. McMurray to that only students were present. rupted Association service for the A InSatire<br />\non the Season's Stage Successes<br />\nLyrics by Arthur Swadstrom<br />\nBaltimore, Md.<br />\nbe 949. This figure is unofficial, There were no famous speakers to troops abroad, James A. Sprenger, Book andMusic<br />\nby Carey Morgan<br />\nconferenthusiasm,<br />\nthe<br />\nyet<br />\narouse<br />\nStaged by Bert French<br />\nwho graduated from Johns Hopand is subject to change by the officials of the intercollegiate matches. ence has been termed a decided suc- kins in 1908, has just returned to The Headliner Stars of \"The Music Box<br />\nRevue\" and \"Two Little Girls in Blue\"<br />\nIN-rt<br />\nThe team consisted of five men, cess by the Student Forum.<br />\nthe United States.<br />\nFairbanks Twins<br />\nThe students discussed the ecoand only the prone and sitting po41-$ ciL,<br />\nthat<br />\nThe<br />\nMr.<br />\nfact<br />\nSprenger<br />\nwas Hegedus<br />\nsitions were used. The individual nomic basis of education, and their<br />\nSisters & Juan Reyes<br />\nselected<br />\nto<br />\nhead<br />\nY.<br />\nA.<br />\nwork<br />\nM.<br />\nC.<br />\nscores, also unofficial, of the mem- responsibility in view of it, on the<br />\nWill Mahoney<br />\nbers of the team were as follows: basis of their own experience and with the troops in Germany was a<br />\n\"WHY BE SERIOUS\"<br />\nW. M.—Prone,98; sit- of the critically examined evidence testimonial to his work in France<br />\n4 Rowland,<br />\nCls eXatteti<br />\nof others. The conclusions reached during 1917-1918. That he has Steve—Freda & Anthony—Jack<br />\ntotal,<br />\n192.<br />\nting,<br />\n94;<br />\nH.& OSCAR<br />\nIn \"BARTCHA—KALLOPP\"<br />\nthe end of the conference are exat<br />\nE.—Prone,<br />\nR.<br />\nsitParks,<br />\n100;<br />\n111..l<br />\noWN Et...4<br />\nR<br />\nrip.<br />\n0<br />\nmore than justified this confidence<br />\nAndrew Lydon's Bit of Artistry<br />\npected to be very helpful to the edting, 91; total, 191.<br />\n•<br />\nDz<br />\nis borne out by the statement of<br />\n\"Dreams\"<br />\ncountry.<br />\nof<br />\nucators<br />\nthe<br />\nM.—Prone,<br />\nG.<br />\nsitRuoff,<br />\n99;<br />\nA Study in Color, Beauty and Grace<br />\n29 Baltimore St., East<br />\nGeneral<br />\nHenry<br />\nMajor<br />\nT.<br />\nAllen,<br />\nin<br />\nFour similar conferences are beting, 92; total, 191.<br />\nOne Door West of Ligbt St.<br />\nBarrett & Farnum<br />\nplanned by the students of command of the American Forces<br />\ning<br />\nsitting,<br />\nJ.<br />\nMount,<br />\nE.—Prone,<br />\nBALTIMORE<br />\n95;<br />\nFOR<br />\nAGENTS<br />\nSOLE<br />\nIn \"DANCING—AND THEN SOME\"<br />\nFor College Fraternity Band.<br />\nand<br />\nChicago<br />\nOberlin,<br />\nSwarthmore,<br />\nthe<br />\nRhine,<br />\non<br />\nthat<br />\nwelfare<br />\n\"soldier<br />\ntotal,<br />\n93;<br />\n188.<br />\n(Greek Letter Societies)<br />\nR. & W. Roberts<br />\nBates, F. T.—Prone, 96; sitting, Reed College, at Portland, Oregon. work never before reached the presWorld's Famous Equilibrists<br />\n91; total, 187. Grand total, 949. The National Student Forum states ent high standard maintained here.'<br />\nLast week's score was to count that the effects given to the life of<br />\nMr. Sprenger's departure from<br />\nPrinters of Philological and<br />\nat the same time as the score in a America by the students are of a<br />\nshortly after the first of<br />\nCoblenz<br />\nScientific Works<br />\nmeet against Georgetown, from new and vital nature. It is hoped<br />\nNext Week<br />\nwhom no returns at all have been by them, through the various con- the year inspired a remarkable Matinees Wednesday tic Saturday<br />\n23 S. HANOVER ST.<br />\nferences, to have students play as series of testimonials to the value<br />\nLaltimore, Md.<br />\nreceived.<br />\nPositively Only One Week<br />\ninfluential<br />\npart in public opinion as of his service and that of the organIn the meet against the UniverWagenhals & Kemper Present<br />\nsity of California, during the week they already do in Europe and ization which he represented, from THE<br />\nWORLD'S GREATEST<br />\nFine Clothes<br />\nending February 16, the team will Asia.<br />\nDRAMATIC SENSA TION<br />\nGeneral<br />\nMajor<br />\nAllen,<br />\nmembers<br />\nof<br />\nA suit by Lemmert gives the final consist of ten men, and will shoot<br />\ntouch to the lasting sathafaction you<br />\nhis staff and members of the Interderive from thoroly dependable from all four positions,—prone,<br />\nBARNARD FOR TEN-HOUR Allied Rhineland High Commiscloths cut in authentic fashion— kneeling, sitting and standing. The<br />\nwhether for every-day wear or more<br />\nDAY<br />\nsion.<br />\nfollowing men are on the team for<br />\nfestive occasions.<br />\nBy Mary Roberts Rinehart and<br />\nYork Times)<br />\nNew<br />\nthe<br />\n(From<br />\nthis match: G. M. Ruoff, R. E.<br />\nThe magnitude of the work unAvery Hopwood<br />\nParks, F. L. Ross, W. M. Rowland, A ten-hour day and a six-day der Mr. Sprenger's immediate suLEM M ERT<br />\nOver<br />\nTwo (2) Years at the<br />\nJ. D. Virdin, J. E. Mount, H. E. week have been recommended for pervision<br />\n19 Fayette Street, East<br />\nMorosco, New York<br />\nwill be realized when it<br />\nof<br />\nBoard<br />\nthe<br />\nby<br />\ngirl<br />\ncollege<br />\nthe<br />\nWilgis, F. E. Williams, W.. V.<br />\nA Year in London<br />\nBusiness Suits<br />\nDress Clothes<br />\nStudent Presidents at Barnard Col- is recalled that the Army of OccuReed and F. T. Bates.<br />\nOvercoats<br />\nSport Togs<br />\nMore<br />\nThan<br />\na Year in Chicago<br />\nwhich<br />\nproposes pation which was sent up into Gerlege in a resloution<br />\na new point system to regulate ex- many after the Armistice consisted<br />\nThe Mystery Masterpiece of<br />\nModern TimesI<br />\nCOSMOPOLITAN CLUB MEET- tra-curricular activities. Each stu- of about 300,000 men and took over<br />\nSARATOGA AT<br />\nThe Company That Played Here<br />\ndent's entire college activity, acaING TONIGHT<br />\nsome 3,000 square miles in and<br />\nLIBERTY STS.<br />\nThis and Last Season<br />\nA meeting of the Cosmopolitan demic and otherwise, would be lim- around<br />\nCoblenz.<br />\nFor<br />\nthese<br />\nmen<br />\nthe<br />\nLUNCHEON<br />\nThe Special ''Big Cities'<br />\n.<br />\nClub will be held tonight at eight ited to twenty points, each point Association<br />\ncarried on 425 centers,<br />\nCompany<br />\nthree<br />\nhours'<br />\nstanding<br />\nwork<br />\nfor<br />\nas<br />\nTEA<br />\no'clock, at the Homewood Friends<br />\nwith service by rolling canteens at<br />\nMeeting House, 3107 North it does in the academic system.<br />\nDINNER<br />\nout-stations. As the troops in<br />\n83<br />\nThis plan would allow eight<br />\nSPECIAL PARTIES Charles Street. A social will be<br />\nGermany<br />\nwere reduced in number<br />\ngiven the club by the members of hours for sleep, two for exercise, the<br />\nWeek of February 19th<br />\n11.30 A. M.<br />\nY.<br />\nW.<br />\nC. A. service was proporthe society, preceded by a short four for meals and other time at tionately<br />\nuntil<br />\nMessrs. Lee and L. J. Shubert<br />\ndecreased,<br />\nand<br />\nMr.<br />\nwhen<br />\n7.30 P. M.<br />\nPLAZA 6987 business meeting. Several promi- home, leaving ten hours for college<br />\nPresent<br />\nSprenger departed it was necessary<br />\nnent speakers have been secured activities. The board suggests that to leave staff<br />\nSixth Year of the<br />\nof<br />\na<br />\nonly<br />\n12<br />\nmen<br />\nand<br />\nand every effort will be made to exceptions be made in the case of women to carry<br />\nBRILLIANT<br />\non the work for<br />\nmake the social one of the most seniors, by special permission from the<br />\nBEAUTIFUL<br />\nAmerican<br />\n1,200<br />\nsoldiers<br />\nreMANUFACTURING JEWELERS<br />\nsuccessful in the history of the the Faculty Committee. Points for maining. These<br />\nMEMORABLE<br />\ntroops have now<br />\nLancaster, Pa.<br />\neach student office would be deterclub.<br />\nbeen recalled, and Y. M. C. A. repClass Rings, Pins, Fraternity Pins,<br />\nThe Cosmopolitan Club was or- mined by means of time studies. resentatives accompanied them to<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes ganized largely through the efforts<br />\nthe point of embarkation on their<br />\n\"Makers of the Varsity Seals\"<br />\nBook and Lyrics by<br />\nof the Hopkins Y. M. C. A., to<br />\nST. LOUIS ENGINEER AD- homeward way. .<br />\nRida<br />\nJohnson Young<br />\nbring the foreign students of the<br />\nMr. Sprenger's service abroad<br />\nDRESSES<br />\nM.<br />\nE.<br />\nA.<br />\nS.<br />\nScores by Sigmund Romberg<br />\nUniversity together, thereby prohas .been outstanding also because<br />\nThe 'February meeting of the<br />\nWith<br />\nducing a spirit of fellowship among<br />\nhe had a leading part in the organMARION GREEN<br />\nthem, and making their American Baltimore section of the American ization and direction of<br />\nthe great<br />\nCommercial Photography<br />\nand<br />\nuniversity life more pleasant.<br />\nSociety of Mechanical Engineers leave areas where American solCircuit Photography<br />\nNANCY GIBBS<br />\nwas held last Wednesday night, diers spent their leave periods. The<br />\nFlash Lights<br />\nViews<br />\nGrace Studiford, Tilly Salinger,<br />\nGroups<br />\nMlle. Loretta, Peggy Purdy,<br />\nEnlargements BUCKNELL CHOOSES WOLF February 14, at the Engineers Club. Association hired the recreation facilities<br />\nof<br />\nseveral<br />\nof<br />\nthe<br />\nmost<br />\nfaMaude<br />\nWilliams, Arthur Albor<br />\nspeaker<br />\nThe<br />\nBoone<br />\nwas<br />\nMr.<br />\nV. H.<br />\nKODAK FINISHING<br />\nAS MASCOT<br />\nand Others<br />\nmous<br />\nwatering<br />\nplaces<br />\nof<br />\nFrance<br />\n325 N. Howard St.<br />\nWhen the Navy goat, the Army Johnson, a prominent engineer and and provided sightseeing trips,<br />\nAnd a Bevy of Beautiful Girls<br />\nMt. Vernon 4999<br />\nmule, the Yale bulldog, and the vice-president of the Common- sports, and entertainments free for<br />\nall soldiers on leave. There were<br />\nPyinceton tiger trot upon the grid- wealth Steel Company.<br />\nThe<br />\nlecture<br />\nby<br />\ngiven<br />\nMr.<br />\nJohnother<br />\ncenters not on the coast but<br />\nSHIRTS<br />\nNECKWEAR iron next fall they will be assured<br />\nson was illustrated by motion pic- in the mountain country. In addiof a new companion. The mascot<br />\ntures taken at the famous St. Louis tion, recreation centers were orrecently chosen for the Bucknell plant of the Commonwealth Steel ganized for men having week-end<br />\nNow In Its<br />\n421 N. HOWARD ST.<br />\neleven, the timber wolf, will be the Company, one of the most noted or single day leaves. A total of<br />\nHOSIERY<br />\nGLOVES newcomer<br />\nin the field. According steel plants in the country. The 457,704 men with seven-day leaves<br />\nNINTH WEEK<br />\nmethods<br />\nused<br />\nby<br />\nthis<br />\ncompany<br />\nare<br />\nentertained<br />\nwere<br />\nin<br />\nareas<br />\nin<br />\nsuch<br />\nto \"Bill\" O'Brien, the \"town barANNE NICHOLS' LAUGHING<br />\nEstablished 12/13<br />\nber\" at Bucknell, who has tonsorial- among the most novel and improved France, Germany and England,<br />\nSUCCESS<br />\nany similar concern and, there- and 706,671 with shorter leaves.<br />\nkH.Fetting Man'fg Jewelry Co. ly operated on students at the col- of<br />\nfore, were doubly interesting to<br />\nlege for more than a score of years, both the Hopkins men present and<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\nother mascots will have to be at the members of the Baltimore sec- FOREIGN STUDENTS CRITI213 N. LIBERTY ST., Baltimore, Md. their best to eclipse the perform- tion.<br />\nCIZE UNIVERSITIES<br />\nance of the wolf. \"Those timber 'The picture shown illustrated the<br />\nThree foreign students who are<br />\nSTRATTON SHIRT MAKER<br />\nwolves are tough babies,\" Bill ex- making of steel castings, handling investigating American institutions<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00 plains; \"they ain't afraid of any- scrap by magnet, assembling ma- criticise them on the ground that<br />\nNegligee<br />\n$3.25 and $4.25<br />\nterials for heats, and cutting scrap American students pay no attention<br />\nImported Madras<br />\n$5.25 and $6.25 thing. When that he-beast of ours with oxy-acetylene<br />\ntorches. Orig- to religion or politics during theh<br />\nTerms Cash, Less 10% 30 Days on<br />\ntrots into the bowl in the fall, that Inal and remarkable photographs college courses. Their<br />\nShirts<br />\ninterests are<br />\nAlso a Full Line of Men's<br />\nYale bulldog will have to look were shown of steel boiling within centered in less important matters<br />\nTHE PLAY THAT PUT<br />\nFurnishings<br />\ntwice.\"<br />\nthe furnace.<br />\nthan is usual in foreign universities.<br />\nU IN HUMOR<br />\n<br />\nMARYLAND THEATRE<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nAUDITORIUM<br />\n<br />\nTHEBAT<br />\n<br />\nFORD'S<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nMAYTIME<br />\n<br />\nW.L. Mann<br />\n<br />\nLefranc & Ault<br />\n<br />\nAcademy of Music<br />\n<br />\nMI<br />\nIRISH<br />\nROSE<br />\n<br />\n\f", "format": "basic_html", "processed": "&gt;5<br /><br />\nL<br /><br />\nVOL. XXVII. No. 31<br /><br />\nBALTIMORE, MD., FEBRUARY 16, 1923<br /><br />\nPRICE 5 CENTS<br /><br />\nLARGEST COLLEGES IN MID- FIVE MEN INITIATED INTO TRYOUTS FOR THE SOUTH- COACHES ADDRESS LA- MUSICAL CLUBS CONCERT<br />\nSIGMA UPSILON LITERN ORATORICAL CONDLE ATLANTIC STATES<br />\nCROSSE MEN AT ORGANIAT CASUALTY CLUBERARY FRATERNITY<br />\nTEST FEBRUARY 27<br />\nTO BE REPRESENTED<br />\nZATION MEETING<br />\nHOUSE WEDNESDAY<br />\nUndergraduate<br />\nDelegation<br />\nof<br />\nLimMembership<br />\nHopkins to Be Host to Five South- Three Trips on Schedule An- Feature Numbers on Program.<br />\nNavy to Send Large<br />\nited to 12. Four Members of<br />\nern Universilies. J. H. U.<br />\nRunners. Joie Ray Unable to<br />\nnounced by Manager Collins.<br />\nTickets Selling Fast. Dance to<br />\nFaculty to Belong<br />\nHolds Title<br />\nBe at Fifth Armory Games<br />\n\"On to Navy\" Slogan<br />\nFollow Concert<br />\nLast<br />\nnight<br />\nMonday<br />\no'clock,<br />\nat<br />\n8<br />\nThe<br />\nFifty<br />\nannual home concert of the<br />\ncandidates for the Black<br />\nTryouts will be held on February<br />\nOne of the leading attractions at<br />\nthe Johns Hopkins-Fifth Regiment at the Kappa Sigma Chapter 27, at 12.20, in Room 112, Gilman and Blue lacrosse team received Combined Musical Clubs will be<br />\ntheir initial impetus last Tuesday held next Wednesday evening, Febgames next week will be the team House, five new men were taken Hall, for the Southern Oratorical<br />\nat<br />\nthe organization meeting in the<br />\nruary 21, in the Auditorium of the<br />\nwhich the Naval Academy will into the Purple Gown Chapter of Contest, which will take place on M. E. Building. This<br />\nyear's coachSigma<br />\nthe<br />\nUpsilon<br />\nFraternity.<br />\nThe<br />\nCasualty Clubhouse.<br />\nApril 14. As this is the most im- ing committee and three former Maryland<br />\nsend to Baltimore. The Midshipwho<br />\nwere<br />\nfive<br />\nput<br />\nthrough<br />\nthe<br />\nmysThis<br />\nconcert,<br />\nwhich was formerly<br />\nportant<br />\nnon-athletic<br />\nrunners<br />\nthis<br />\ncontest at Hop- coaches spoke to the men on varimen have many good<br />\nrites<br />\nof<br />\ntic<br />\nthe<br />\nkins<br />\nfirst degree were<br />\nthis year, Dr. French is mak- ous lacrosse topics. Bill Schmies- held for two nights in the auditoryear, having lost but a few men<br />\ning<br />\nevery<br />\neffort to obtain the most ser, chairman of the coaching ium of the Civil Engineering BuildHoward<br />\nB.<br />\nHensel,<br />\nCarl<br />\nW.<br />\nBuckfrom the champion team of last<br />\neligible<br />\ncandidate<br />\nto represent the committee, acted as presiding offi- ing, under the name of<br />\nMcDaniels,<br />\nheister,<br />\nJ.<br />\nRanMilton<br />\nthe Annual<br />\nyear. At present -the Annapolis<br />\nuniversity. Notice for the tryouts cer at the meeting, introducing Homewood Concert,<br />\nwill<br />\nnow be<br />\ndolph<br />\nNorwood<br />\nand<br />\nWilliam<br />\nG.<br />\nboys are listed to enter the medley<br />\nare given such a long time in ad- the speakers.<br />\nheld<br />\nat<br />\nthe<br />\nMaryland<br />\nCasualty<br />\nrelay and the officials are trying to Dean.<br />\nvance because the speeches to be<br />\nCaptain John Murphy was the Building because of the better faSigma Upsilon is a national lit- delivered at that time, while they<br />\nbook several more attractive events<br />\nfirst of those to speak. He de- cilities. The expenses, however,<br />\nfor them. Besides the Naval Acad- erary fraternity which was found- must be short, should be finished plored the unfavorable weather, are unusually large, and the leaders<br />\nand the candidate ready to display stating that from now on practice of the clubs,<br />\ntherefore, depend upemy, many other large -colleges will ed in the South in 1906 by the interall his powers.<br />\nof<br />\nthe<br />\ncollegiate<br />\nunion<br />\nliterary<br />\nsowill<br />\nregularly<br />\nbe<br />\nheld<br />\nto<br />\non<br />\ndevelop<br />\nthe<br />\nunqualified<br />\nsupport of the<br />\nenter the meet.<br />\nThe speeches for the tryouts stickwork and to round the squad entire student<br />\nbody.<br />\nfive<br />\nThe members<br />\nof<br />\nthe<br />\nof<br />\ncieties<br />\ncolleges<br />\nlargest<br />\nIn order to make a thrilling<br />\nshould not exceed five minutes in into condition. Murphy declared of the<br />\nAlumni<br />\nAssociation,<br />\nalso,<br />\nmatch, Coach Van Orman has in the Southern States. Since 1906, length. They must be prepared in that Hopkins has a well balanced have<br />\npledged<br />\ntheir<br />\nsupport,<br />\nand<br />\nas<br />\nplans afoot to-pit Lafayette and Le- the original five chapters have in- advance and memorized. The can- schedule this year, much more so a result the success of the concert<br />\nhigh in a mile relay. The two Penn- creased to twenty-eight, the latest didate will be chosen strictly on the than in the last two years. He is practically assured.<br />\nof the more recent chapters being showing at the tryout.<br />\nwarned everybody that in spite The Combined Musical Clubs<br />\nsylvania institutions are sworn rithe \"Purple Gown\" of Hopkins. The subject of the speech should of the great number of experi- consisting of<br />\nover seventy-five men,<br />\nvals, their contests always being a The fraternity is well distributed be upon some topic of current inenced players on the squad not is composed of the Glee Club, the<br />\nfight-to-win. Should Van Orman through the South and is now ex- terest. The following subjects are<br />\none position on the team has been Mandolin Club, the Jazz Band, the<br />\nbe successful in contracting this panding to the Western colleges. suggested:<br />\nassigned to a man and that a man Saxaphone Sextet, the Quartet, the<br />\nThe British and Allied debts.<br />\nrace, the crowd would have an ex- Many of the state institutions of<br />\nwho is new at the game will stand Blue Jay Six, and several novelty<br />\nReparations.<br />\ntra thrill besides those already the Western States have recently<br />\nas good a chance of making the acts. \"Dal\" Kirwan will present<br />\nhad chapters installed, and many<br />\nThe French invasion of the team as an old player. \"Hard his usual black-face<br />\nact and \"Joe\"<br />\ncarded.<br />\nmore requests for charters are now Ruhr.<br />\nwork<br />\nand<br />\nhead<br />\na<br />\ngood<br />\nwill<br />\nwin<br />\na<br />\nMoran<br />\nwill<br />\ngive<br />\nan<br />\n\"Impersonation<br />\nsend<br />\na<br />\nto<br />\nasked<br />\nbeen<br />\nhas<br />\nYale<br />\npending.<br />\nChild labor.<br />\nberth on the Homewood team,\" of Joe Cook.\"<br />\nteam to Baltimore on the twentyThe purposes of Sigma Upsilon<br />\nProhibition.<br />\naccording to the captain.<br />\nThe Glee Club will open the conIt is to be remembered that the 0. D. Collins, manager, an- cert with<br />\nfourth, and it is likely that the Bull- are to foster good fellowship and<br />\n\"Honey, I Wants Yer<br />\ndogs from New Haven will come. an appreciation for literature of all contest is oratorical, and it not a nounced the schedule for the com- Now,\" \"Old Black Joe,\" \"Annie<br />\nThe Elies will not want for com- ages, and to study interesting liter- debate. It is not necessary to prove ing season. Three trips are in Laurie,\" \"Sunflower Coon,\" and<br />\nature under congenial and sociable a proposition; but only necessary store for the \"butterfly chasers\": several other<br />\nselections. The Manpetition, as Pittsburgh, Princeton,<br />\nconditions. In many colleges, cur- to present a subject forcefully and the first on'April 28, to Stevens, dolin<br />\nClub,<br />\nunder<br />\nthe direction of<br />\nMassachusetts Institute of Tech- rent literary societies have simply convincingly.<br />\nat Hoboken; the s nond, on May Mr. G. H. McCauley, will follow<br />\nnology, Virginia and Georgetown merged into a chapter of Sigma<br />\nThe title of Southern Collegiate 12, to the Naval Academy, and with<br />\nselected numbers utilizing<br />\nhave already signified their inten- U. The need of a fraternity of Orator now rests at Hopkins, and the third, on May 26, to Lehigh, at popular dance<br />\nmusic as encores.<br />\ntions of being represented. A mile this type has long been felt at Hop- it is desired to keep it here. The South Bethlehem. Collins also Then there will be selections by the<br />\nrelay between Pittsburgh and M. I. kins. At present, no literary so- institutions competing, in addition spoke of the schedule for the \"Red Blue Jay Six, the Saxaphone Sexciety exists on the campus as such, to Hopkins, will be Vanderbilt. Eagles.\" Besides the customary tet and the<br />\nQuartet.<br />\nT. will be arranged if possible.<br />\nand there has really been no organ- Kentucky, Sewanee, Alabama and games with Poly and City it is The University<br />\nQuartet, consistBoth schools have good teams and ization which is adapted to the ser- North Carolina.<br />\nplanned to match the Hopkins ing of \"Johnny\" Sherwood, second<br />\nthe rivalry between them is keen. veying of literature. A few years<br />\nThe president of the league, Al- scrubs against St. John's; Penn bass;<br />\n\"Jack\" Croker, first bass;<br />\nPrinceton and Navy will furnish past, an undergraduate literary so- bert G. Langeluttig, Jr., graduate Freshmen and the Maryland State Mercer, second<br />\ntenor, and Maccubteams well worth watching. The ciety did exist at Hopkins. This student in Political Science at Hop- scrubs.<br />\nin, first tenor, will render several<br />\nMr. Schmiesser gave a short selections.<br />\nTigers have several good runners railed, however, probably due to the kins, would like to talk to prospeclack of sufficient ties to bind the tive candidates at any time in the history of lacrosse at Hopkins.<br />\nHe There will also be three solos: a<br />\nto wear the black and gold, and<br />\nmembers together. In the appear- historical library.<br />\ntold of how the game was intro- guitar solo by Waldo Hambleton,<br />\nthey are sure to uphold the good ance of the new fraternity<br />\non the<br />\nduced in Baltimore in 1880 by a a piano solo by Maurice Sater ; and<br />\nrecords made by their college Mates campus, a decided renaissance of<br />\nBaltimorean.<br />\nMr. Alexander a banjo solo by Mr. G. H. Macaulin previous years. University of undergraduate interest in literature CO-EDUCATION DOOMED BY<br />\nBrown, who had seen it played in ey. After the concert, a dance will<br />\nVOTE OF 232 TO 37<br />\nVirginia, in spite of the loss of is expected. It is hoped that Sigma<br />\nCanada. Mr. Brown brought a set be held in the ballroom of the MaryBy an overwhelming vote of 232 of equipment with him when he land Casualty Building, the music<br />\nthree of last year's stars, expects to Upsilon may prove to be the startcarry off some of the top honors ing point of inter-collegiate literary to 37, the Hopkins male undergrad- returned from Canada, soon after being •furnished by the Blue<br />\nJay<br />\nrelations for Johns Hopkins.<br />\nnext Saturday.<br />\nuates have expressed their disap- organizing the \"Druids\" and sub- Six.<br />\nThe program of the Purple proval of female intrusion into the sequently the \"Pattersons,\" two The next<br />\nMaryland State has decided to<br />\nconcert, February 21,<br />\nsend a large delegation to the Gown chapter for the coming undergradluate body Recently, sev- teams which gained their names will be held at Westminster. Conmeet. The College Park lads are months will probably be a series of eral female students in the College from the city parks in which they certs are also pending at Cumberon the warpath for the black and brief reviews of the works of con- Course for Teachers had been ply- played. Several of the players on land and Frederick.<br />\nblue scalp. They have booked a temporary American authors. It is ing the NEWS-LETTER Mail-Bag these teams were Hopkins men<br />\nmatch with the Varsity relay, in possible that the entire time de- with letters demanding \"equal and it was they who started a colWhich they hope to repeat the drub- voted to the club activities may be rights\" for women at Hopkins; and lege team. Several other colleges<br />\nBLACK AND BLUE JAY<br />\nbing delivered to Hopkins last fall spent in an examination of the as a result, it was finally decided were induced to start such teams<br />\nCORRECTION<br />\non the gridiron. The State fresh- poetry produced in and about Bal- to take a vote among the student and in a few years lacrosse had be- In the last<br />\nissue of the NEWSmen are trying to book a race with timore. The ultimate purpose of body and determine the \"public come a popular intercollegiate<br />\nLETTER<br />\nappeared<br />\nan announcethe Homewood yearlings, a match the chapter is to furnish recreation opinion.\" The results show that of sport.<br />\nment to the effect that due to an<br />\nWhich should hold the interest of and pleasant social connections for 269 students turning in ballots only<br />\nDr. Abercrombie spoke on the error the name of Donald H. Kirkmany Baltimore speed fans. Rut- all its members.<br />\n13 per cent were in favor of grant- close rivalry which has always ex- ley was<br />\nincluded in the staff<br />\nAn edict which comes from the ing their \"sister students\" the re- isted between Lehigh and Hopgers is another college which has<br />\nin the February issue. This should<br />\nrecently decided to try for Hop- National Council is that no more quested \"equal rights.\"<br />\nkins. This prolonged struggle be- have read: \"Due to an error<br />\nkins' scalp in a relay. Captain Aar- than twelve members of the under- The class presidents, the inem- tween the two colleges started in the<br />\nname of Donald H. Kirkley<br />\n°r15on is confident that his team can graduate body of any college or bers of the Student Council, and 1897 when the Black and Blue was omitted<br />\nfrom the staff in the<br />\ndo well against all would-be scalp- university may belong to the so- others prominent in college activ- stickmen were roughly handled in<br />\nFebruary issue.\"<br />\nciety in any one year. The Purple ities, were all found to be emphat- South Bethlehem. Hopkins reers.<br />\nMr. Kirkley was a member of<br />\nJoie Ray, the great international Gown Chapter was installed at ically opposed to co-education.<br />\nturned to Lehigh the following the staff at the time the issue went<br />\nrecord holder, is unable to come to Homewood last year just previous<br />\nSeveral of the college wits found year determined to beat the Penn- to press and,<br />\nalthough he is no lonBaltimore for the J. H. U. meet, as to the spring examinations. Dr. this an ample opportunity to ex- sylvanians. A hard fought battle ger a<br />\nmember,<br />\nhis name should<br />\nhe is going to run in the indoor Broadus Mitchell, a member of the press themselves. One was \"For finally gave the J. H. U. a 4-3 vichave been included in this issue.<br />\nmeet of the University of Illinois chapter at the University of North education; opposed to co-educa- tory.<br />\nDr. Abercrombie told<br />\non that night. Ray's inability to Carolina, was instrumental .in ef- tion.\" Another was in favor of the about the hard times the early laGet your tickets for the<br />\ncome is a gdisappointment to many fecting the installation. Dr. Her- plan if one of the entrance require- crosse teams had. As classes kept<br />\nHomewood<br />\nConcert at Barn<br />\nbert<br />\nGreene,<br />\nJohn<br />\nE.<br />\nDr.<br />\nC.<br />\nments is the passing of a beauty the students indoors until after<br />\nenthusiasts who were in hopes of<br />\nat<br />\n12.30<br />\nToday.<br />\nseeing the speed king perform. •<br />\ntest.<br />\nContinued on page 2, col. 4<br />\nContinued on page 2, col. 3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 16, 1923<br /><br />\n7<br /><br />\nTAU BETA PI TO CHOOSE<br />\nNEW MEMBERS<br />\nA short business meeting of the<br />\nTau Beta Pi Honorary Engineering Fraternity was held Monday<br />\nnight at 8:30 o'clock, in Room 206,<br />\nMechanical Engineering Building.<br />\nThe primary purpose of the meeting was to lay plans for the choosing of new members. The actual<br />\nchoice, however, will not take place<br />\nuntil some time in May. At that<br />\nHopkins University.<br />\ntime the upper eighth of the Junior<br />\nthought advisable.<br />\nON<br />\nTHERE<br />\nGET<br />\nMUST<br />\nWE<br />\nMANClass will be eligible for memberBusiness communications should be addressed to the BUSINESS ions<br />\nWork by the committee has been<br />\nTIME. WHY NOT LEAVE<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communicat<br />\nvarion<br />\nBids<br />\nrapidly.<br />\ng<br />\nprogressin<br />\nship. The criterion of membership<br />\nshould be sent to the MANAGING EDITOR.<br />\nON TIME?<br />\ndance<br />\nthe<br />\nto<br />\npertaining<br />\nous items<br />\nconsists of scholarship, personality,<br />\nTo the Mailbag:<br />\n100 are being received. An elaborate<br />\nHomewood<br />\nTelephone<br />\nThere has recently been a great and participation in college activmenu has been planned, and novel<br />\nof objection on the part of the ities. At the same meeting, there<br />\ndeal<br />\nsouvenirs for members of the fair •<br />\nBusiness Manager:<br />\nstudents to the practice of teachers was some discussion concerning the<br />\nEditor-in-Chief:<br />\nsex have been selected.<br />\nWILLIAM H. MOORE, JR., '23.<br />\nGLOVER P. FALLON, '23.<br />\nto hold their classes past the time<br />\nLouis Fischer's orchestra of six of dismissal. This often causes late- election of graduate students and<br />\nManaging Editor:<br />\nAdvertising Manager:<br />\npieces will furnish music. Work ness for the next class and brings honorary members from the faculJ. HUDSON HUFFARD, '23.<br />\nDONALD K. VANNEMAN,'23.<br />\nthe elaborate decorations will a reprimand to the student when it ty. Nothing definite, however, was<br />\non<br />\nAssistant Managing Editor:<br />\nManager:<br />\nCirculation<br />\nby the Art Staff in the really is not his fault. It is rather decided upon.<br />\nstarted<br />\nbe<br />\nJOSEPH S. LEOPOLL '24.<br />\nPHILIP W. HOWARD, '25.<br />\nnear future to facilitate comple- difficult for the student to be disAssociate Editors<br />\nThe next meeting of the society<br />\ntion in ample time for the Prom. missed at, say five minutes past<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nAssistant Business Managers:<br />\nbe held at the Johns Hopkins<br />\nwill<br />\nWILLIAM G. DEAN, JR., '24.<br />\nIt has been definitely decided by time, from a class, on the third<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nClub, February 26. It will consist<br />\nthe Black and Blue Jay staff that floor of Gilman Hall, and expect<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\na supper followed by an attracof<br />\nthe next issue of that magazine him to report on time to a class in<br />\nD. MILES MARRIAN, '25.<br />\nJunior Editors:<br />\nG. DONALD GIESKE, '25.<br />\nwould be a Prom Number in hon- the M. E. Building. It is more tive literary program. Frank Wilen<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nof the occasion. This number than difficult ; it is practically im- and Edward Schaeffer will speak<br />\nor<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\n'26.<br />\nthe Blue Jay is due to appear possible.<br />\nof<br />\nTHOMSEN,<br />\nW. EDWARD<br />\non some topic of literary interest.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\njust three days before<br />\n20,<br />\ndismisthis<br />\nMarch<br />\nfor<br />\nlate<br />\nreason<br />\nThe<br />\nA. J. McICAY, '26.<br />\nERNEST A. STRATHMAN, '26.<br />\nthe Prom.<br />\nsal of classes is the fact that, in<br />\nmost classrooms in Gilman Hall the<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nbell cannot be heard. It seems to<br />\nAPON<br />\nPUT<br />\nN<br />\nDAVIDSO<br />\nme that an adequate system of bellPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\nPROVED LIST OF<br />\nringing for classes would do away<br />\nCOLLEGES<br />\nwith late dismissals, and thus oblitBALTIMORE, MD., FEBRUARY 16, 1923<br />\nDavidson has recently been put erate lateness for the next class. It<br />\nupon the approved list of the uni- is to be hoped that something will<br />\nversities and colleges of America. be done to attain this end.<br />\nOUR EDUCATIONAL DEBT<br />\nYours for prompt dismissal of<br />\nThe American Association of Unimembers,<br />\nof<br />\nclasses,<br />\nlists<br />\ntwo<br />\nUnited<br />\nthe<br />\nhas<br />\nover<br />\nversities<br />\nall<br />\nfrom<br />\nA conference of students from college<br />\nP. H. S.<br />\nthe first one containing only univerStates and from several of the North European countries met re- sities. The second list is for colFIVE MEN INITIATED INTO SIGMA<br />\ncently at Hartsdale, New York, to discuss student affairs and prob- leges whose work and standing are<br />\nUPSILON FRATERNITY<br />\nThis<br />\n.<br />\nassociation<br />\nthe<br />\nby<br />\napproved<br />\nHe has the pride of the peacock,the<br />\nContinued from page]<br />\nto<br />\nbroadcast<br />\nsent<br />\nwas<br />\nwhich<br />\ncourage ofthe lion and the combined<br />\nmeeting,<br />\nthe<br />\nof<br />\nlems. From the report<br />\nB.<br />\nA.<br />\nan<br />\nwith<br />\nstudent<br />\na<br />\nthat<br />\nmeans<br />\nnerve of the whole menagerie. And<br />\nFrench, and Dr. Thach are other<br />\nwhy? Because he is sure of himself<br />\nthe college papers, we gather the impression that the affair was con- from Davidson will be accepted members of the faculty who will be<br />\n—and sure of his appearance.<br />\nAs the last and cleverest touch to his<br />\nabroad and will be admitted to the<br />\nThe<br />\naffiliated with the fraternity.<br />\ntoilet, he smooths his mane with\"Vasetrolled by a group of New Thoughtists.<br />\nline\" Hair Tonic. His head stays dapper<br />\nhighest privileges of any institution.<br />\ncharter members of the Class of<br />\nand sleek throughout the giddiest<br />\nwhirls.<br />\nOne of the conclusions arrived at was that \"the higher educa- Before this time Davidson men 1923 are Lawrence B. Fenneman,<br />\n\"Vaseline\" Hair Tonic improves the<br />\nhair. At all drug stores and student<br />\nhave been accepted at Yale, HarWilliams, E. W. Berry,<br />\nbarber shops.<br />\ntion of today is provided at the expense of the laboring class which vard, Hopkins, Princeton and oth- Parker C.<br />\nEvery \"Vaseline\" product is recPaul L. Ives, Joseph A. Moran and<br />\nommended everywhere because of<br />\nn.<br />\nexaminatio<br />\nwithout<br />\nhigher<br />\nof<br />\ncolleges<br />\ner<br />\nproduct<br />\nthe<br />\nwhich<br />\nagainst<br />\nand<br />\ntherefrom<br />\nits absolute purity and effectiveness.<br />\nderives no benefit<br />\nLouis A. Kelley.<br />\nThis new distinction will be of pareducation is aimed; that therefore, we are indebted to this class and ticular beenfit to Rhodes scholars<br />\nLETTER GIVEN FOR HIKING<br />\nOxford.<br />\nto<br />\ngo<br />\ndeclared<br />\nwho<br />\ndelegates<br />\nradical<br />\nmore<br />\nthe<br />\nof<br />\nUniversity of Oregon co-eds riciw<br />\nmust repay our debt.\" Several<br />\nMarDoctor<br />\nand<br />\nLingle<br />\nDoctor<br />\nreceive varsity letters for hiking.<br />\nsuch education \"robbery\" and believed that withdrawal from their tin have been instrumental in havThe idea is to stimulate them to do<br />\nlist.<br />\nthis<br />\nthing.<br />\non<br />\nfair<br />\nonly<br />\nplaced<br />\ning Davidson<br />\nmore walking and to increase their<br />\nrespective institutions was the<br />\nCheseix-ough Mfg.Co.<br />\nphysical development. Letters are<br />\nStatistics recently released declared that more than one million<br />\n(Consolidated)<br />\nawarded to those having the highapthat<br />\nLACROSSE<br />\nADDRESS<br />\nindicates<br />\nThis<br />\nCOACHES<br />\nest average.<br />\nstudents are attendant upon college courses.<br />\nMEN AT ORGANIZATION MEETING<br />\nproximately one man in a hundred is taking advantage of the opporfrom page 1.<br />\nTHE NEWS LETTER'S<br />\nJUNIOR PROM SUBSCRIPMAILBAG<br />\nTION LOWERED<br />\nJunthe<br />\nWhich the Correspondents<br />\nin<br />\nof<br />\nColumn<br />\nmeeting<br />\nA<br />\nspecial<br />\nAt a<br />\nLatitude, But.ShoulAllowed<br />\nAre<br />\nior Prom Committee last Tuesday,<br />\nder the Responsibility.<br />\n1897.<br />\nFOUNDED<br />\nit was decided to lower the price<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nof the dance to $3.50 per couple. regular letter size paper, on one side<br />\nonly.<br />\n$2.00 It was felt that a higher price<br />\nNo attention will be paid to anonySubscription<br />\nmous letters, but names signed as an<br />\nwould make it impossible for many evidence<br />\nof good faith will not be<br />\nprinted if request is made that they be<br />\nfact<br />\nthe<br />\nin view of<br />\nomitted.<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at to attend, and<br />\npublication of a letter is not to<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nthat the Junior Class wishes to beThe<br />\ntaken as an indorsement of its views<br />\nby the \"News-Letter,\" which -invites the<br />\nmake this affair open to the en- freest<br />\ndiscussion of matters of general<br />\nJohns<br />\nof<br />\ninterest.<br />\nPublished semi-weekly from October to June by the students<br />\nwas<br />\ndecrease<br />\nthe<br />\nschool,<br />\ntire<br /><br />\nThe Johns<br /><br />\nHopkins<br /><br />\nNews-Letter<br /><br />\n7he Stag<br /><br />\naseline<br /><br />\nHAIR TONIC<br /><br />\nContinued<br /><br />\ntunity either by day or night. This should certainly point out that dark, they were forced to get their<br />\npractice between seven and eightevery man who is strong enough,financially, to support higher educa- thirty in the morning. For all that<br />\ntion has an opportunity to partake of it. The \"laboring class that is Hopkins tasted defeat only at intervals of several years.<br />\nunable to take advantage of it\" probably contributes but a small<br />\nJohnny Knipp, the popular<br />\nproduct<br />\nthe<br />\nthat<br />\ndoubted<br />\ngreatly<br />\nalso<br />\nis<br />\nIt<br />\ncause.<br />\nits<br />\ntoward<br />\namount<br />\ncoach of last year's team, said a<br />\nlot in a very few words. \"We've<br />\nof higher education aims against the welfare of this class. As a rule,<br />\nbeaten Mt. Washington twice and<br />\nit aims toward establishment of better conditions for the poorer class. now it's time to beat Navy. We<br />\nare going to start operations imSince higher education has been offered on a large scale, millions<br />\nmediately, but no man can count<br />\n• have climbed from the dependent class to the level of men-of-affairs. on stepping into his old job. Hopkins has twelve open positions on<br />\nIf we have any debt, aside from that which we owe our immethe lacrosse team. Put your condiate families for their sacrifices, it is not to any class, but to a state fidence in the coaches and don't<br />\nbe ashamed to warm the bench if<br />\nof government that permits the freedom of education that young Amthey think it's necessary. Every<br />\nericans do enjoy. Our payment must be in the accomplishment of man must show fight to beat<br />\nNavy and Mt. Washington as well<br />\nbetter citizenship and a reverence for justice and fairness.<br />\nas the other teams on the schedThe suggestion of withdrawal from college is certainly unsound. ule.\"<br />\nIf our debt was to the laboring class, we could better pay it by edu- Tommy Troxel, Reaney Wolfe,<br />\nSam Silberstein and Pat Sullivan<br />\ncating ourselves and helping them to help themselves than cutting were among the others who gave<br />\nshort addresses to the candidates.<br />\nour throats in sympathy.<br />\nSilberstein will devote his time<br />\nThe college man must set the world an example of fair and just on the lacrosse field this year to<br />\ncoaching the \"Red Eagles.\"<br />\ncitizenship.<br /><br />\nimuminnimummiiimm<br />\nHe Reached the Top<br /><br />\nII<br />\nHE Vice-President of a great life insurance<br />\nIII<br />\nagent<br />\nan<br />\nas<br />\ncareer<br />\nhis<br />\nbegan<br />\nwho<br />\ncompany<br />\n111<br />\nII<br />\nhas this to say to seniors who are about to<br />\nII<br />\n1111<br />\ngraduate from college:<br />\nIll<br />\n\"If you love work and desire to pursue an honorable,<br />\nIII<br />\nuseful and lucrative mission in life this is the business<br />\nIII<br />\nfor you to take up. Life insurance salesmanship offers<br />\nII<br />\na fine field for the energies of the splendid young men<br />\nII<br />\nIII<br />\nin our colleges.<br />\n111<br />\nthis is true is demonstrated by those college men<br />\n\"That<br />\n1111<br />\nwho have taken up life insurance for they have shown<br />\nof<br />\nkind<br />\na<br />\njob<br />\nand<br />\nthis<br />\nfor<br />\nfit<br />\nIII<br />\nthat the college man is<br />\nU<br />\nthat the job also is fit for the college man.<br />\nII<br />\nII<br />\n\"The work ofthe life insurance salesman is distinguished<br />\nby independence and opportunityfor directing hisown.<br />\n111<br />\nIII<br />\nIt gives all possible opportunity for individual initiative<br />\nwhen<br />\nage<br />\nan<br />\nat<br />\nincome<br />\nample<br />\nan<br />\nmake<br />\nto<br />\nchance<br />\na<br />\n•<br />\nand<br />\nII<br />\nmost fellows are struggling on a wage pittance.\"<br />\nIN Thatis the story ofone who began at the bottom and 111<br />\nIII<br />\ntop without the help of a college educaIIII reached theadvantages<br />\nare with you who graduate<br />\nThe<br />\ntion.<br />\nII from college. Before deciding your career make in- ill<br />\nIII<br />\nII quiries of the \"Agency Department.\"<br />\nIllIII<br />\n/<br />\n4,07,f7.\"--'<br />\nIII<br />\nUI<br />\nIIII<br />\n------;.;,<br />\n1111<br />\nLIFE INSURANCE COMPANY<br />\nII<br />\nMI<br />\nLargest Fiduciary Institution in New England<br />\n1<br />\n11111111111111111111111111111111111111111111111111111M11111111<br />\nOF BOSTON. MASSACHUSETTS<br /><br />\n•<br /><br />\nhe<br />\n!ray<br />\n)6,<br /><br />\nt(y6'<br /><br />\n)S-<br /><br />\ntal<br />\nce<br />\nat<br />\nor<br />\n!rip<br /><br />\nvre<br />\nhe<br />\nid<br />\n11as<br /><br />\nty<br />\nns<br />\nist<br />\n-<br /><br />\nSn<br />\n.c<br /><br />\n.•<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 16, 1923<br /><br />\nWOMEN, WOMEN<br />\nGIEBEL STILL AT IT<br />\nDR. LILLIE DISCUSSES SEX<br />\nDETERMINATION<br />\nIn a swimming meet in which The other night in my sedan<br />\nLast Friday afternoon at 5 Rutgers defeated the Army at There was just her and me—her<br />\nman.<br />\no'clock, Dr. Lillie, of the Univer- West Point by the score of 35-27,<br />\nsity of Chicago, delivered a lecture Captain Giebel, of Rutgers, by a I talked of rain, and shine, and old<br />\nin Room 10, Gilman Hall, before wonderful exhibition of swimming Forgotten days, and pirates bold,<br />\nWARNER &amp; COMPANY<br />\n.50<br />\na group composed chiefly of the in the 440-yard dash, established<br />\nand<br />\nwax,<br />\nsealing<br />\nAnd<br />\nand<br />\nships<br />\nHATTERS<br />\nup<br />\nteachers and graduate students of new intercollegiate record when he<br />\ngold.<br />\nfast<br />\nthe<br />\nmile<br />\nin<br />\nquarter<br />\nthe<br />\nswam<br />\nW.<br />\n222<br />\nBALTIMORE ST.<br />\nthe Biology Department.<br />\n\"I'm<br />\nsaid,<br />\nshe<br />\nall<br />\nat<br />\nonce<br />\nThen<br />\ncolformer<br />\nThe<br />\n1-5.<br />\n5.34<br />\ntime<br />\nof<br />\nforemost<br />\nDr. Lillie is one of the<br />\ncold.\"<br />\nmen of our country in his particular lege record for this distance was<br />\nthough cool, took off my coat<br />\nI,<br />\nSo<br />\nPrinceton,<br />\nof<br />\nHazleton,<br />\nby<br />\nheld<br />\nfield and has written the standard<br />\n5.39.<br />\nwas<br />\ntime<br />\nwhose<br />\nAnd wrapped my muffler 'round<br />\nwork on hormones and sex deterthe<br />\nin<br />\nthat<br />\nremembered<br />\nbe<br />\nwill<br />\nIt<br />\nher throat.<br />\nmination. His lecture on Friday<br />\nYou collegians who stroll along the campus will<br />\nconsisted of a brief introduction in meet between Hopkins and Rut- And then I talked of golfer's stance.<br />\nbe among the first to sense the coming of Spring.<br />\nwhich he rapidly went over the gers last year, Geibel was success- The styles in clothes, the latest<br />\nDoesn't that suggest something to you in the<br />\nmatter of clothes?<br />\nchief modern accepted principles ful in winning three firsts. This<br />\ndance,<br />\nGo in for Stein-Bloch and Goodman and Suss<br />\nrelating to sex determination, and same man will be seen here in BalAnd how the mediums faked a<br />\nSuits if you want to know college style at its best.<br />\nof a detailed account of the recent timore during March, at which<br />\ntrance.<br />\nare<br />\nresults of inquiries into the phe- time Rutgers and Hopkins<br />\ncold, but gosh! her<br />\nnomena occuring at times in twins scheduled to swim in a dual meet And I grew<br />\nglance<br />\nat the Baltimore Athletic Club.<br />\nof cattle.<br />\nBesides his remarkable exhibi- Was colder yet. I ask of you,<br />\nIt was explained that when the<br />\ntwins were one niale and one fe- tion in the 440, Giebel finished sec- Just what it was I failed to do?<br />\n(Y. M. B. 0. D.)<br />\n—Chicago Phoenix.<br />\nmale, it often Occurs that if the fe- ond in the 50-yard swim, and swam<br />\nrelay.<br />\nthe<br />\non<br />\nmale survives she will be sterile.<br />\nBaltimore and Hanover<br />\nExperimentation and observation<br />\nAT FORTY-FIVE MAN IS AT<br />\nhave proved that the-cause for this GENETICS STUDENTS COLHIS BEST<br />\nis in a connection between the blood<br />\nLECT INTERESTING DATA<br />\nAt 41 the average man has more<br />\nsupplies of two embryos before<br />\nThe class in zoology 360 have money than he ever had before or<br />\nbirth. By this means the blood of been making some interesting tabThe top of<br />\nthe male, containing ihe male hat-- ulations of their \"family trees.\" will ever have again.<br />\nDaily Prove the Merit of<br />\nis the<br />\nlives,<br />\nmost<br />\nin<br />\nhill,<br />\nmoney<br />\nthe<br />\nmones gets into the blood of the They have made a record of the apThousands of Users<br />\nthen on, it's usfemale and produces sterility by its pearance of certain physical char- 45 birthday. From<br />\nhill trip. And fewer<br />\nMEN'S SHOES<br />\npower. The male, however, is acteristics in their families for ually a down<br />\nthan<br />\n75<br />\nat<br />\nmore<br />\nor<br />\nmen<br />\nhave<br />\n$100<br />\nOf the Better Class<br />\nnever affected because the male three generations, including those<br />\nmore<br />\n50<br />\nhad<br />\nthey've<br />\nthough<br />\n25,<br />\nat<br />\ninterstital cells which give rise to of their grandparents, all the chilthe hormones are developed at an dren of their grandparents, and the years for accumulating.<br />\n-The Wonder Motor Fuel'<br />\nThese figures are announced by<br />\nearly period, when the embryo is members of their own generation.<br />\nman.<br />\ninsurance<br />\nJ.<br />\nDevney,<br />\nJoseph<br />\nAs Their Preference!<br />\nURNER BROTHERS<br />\nonly 3.7 mm. big, whereas, the feThe physical features recorded<br />\n1,by<br />\nhelped<br />\nan<br />\ninvestigation<br />\nafter<br />\nto<br />\nIII<br />\nE.<br />\nrise<br />\nSTREET<br />\nBALTIMORE<br />\ngiving<br />\ncells<br />\ninterstitial<br />\nmale<br />\nSHERWOOD BROTHERS, INC.<br />\nwere eye color, hair color, and hair<br />\nBALTIMORE<br />\nthe female harmones do not de- form, that is, a straight or curly. 000 bankers.<br />\nThe lesson behind it all is that<br />\nvelop until the embryo is nearly The tables were, in general, quite<br />\nready to be born at a size of 80 mm. in accordance with the accepted the average person is a money failThus the male cannot be affected. theories of human inheritance, and ure, and that to succeed you have<br />\nin<br />\nDr. Lillie went on to give fur- proved nothing startling or phe- to do better than the average<br />\ncunther accounts of some of the experi- nomenal. It was found out that of work, thrift, judgment and<br />\nand individuality is offered here at prices that are not<br />\nning.<br />\non<br />\ncarried<br />\nmental work now being<br />\nthe twenty-six members of the<br />\nand cannot be underquoted by any house atany time.<br />\n: elass, ten -had-factors--for red hair<br />\nby his students and__ allowed_ him<br />\nq Besides the reputation of an old-established firm<br />\nself to comment on its possible sig- in their families.<br />\nis back of each sale with a guarantee.<br />\nnifiCance. After his lecture, Dr.<br />\nhave<br />\n122,000<br />\nWe<br />\npurchased<br />\nput<br />\nLillie answered some questions<br />\nLARGE STADIUM FOR UNIpair U. S. Army Munson last<br />\nto him by various members of his<br />\nVERSITY OF ILLINOIS<br />\n2 to 12 which<br />\n/<br />\nshoes, sizes 51<br />\nFURNITURE<br />\nDRAPERIES<br />\n;DECORATIONS<br />\naudience.<br />\nwas the entire surplus stock<br />\nThe new stadium of the Univer343 NORTH CHARLES STREET<br />\nof one of the largest U. S.<br />\nThe work of Dr. Lillie is consid- sity of Illinois, costing over two<br />\nGovernment shoe contracmodern<br />\nto<br />\nimportance<br />\nered of most<br />\nmillion dollars, will be dedicated on<br />\ntors.<br />\nprobwill<br />\nit<br />\nas<br />\nbiological research,<br />\nNovember 3d, at the annual game<br />\nThis shoe is guaranteed one<br />\nably acutely change many of the with Chicago University. The stahundred per cent, solid leathformerly accepted notions as to the dium, exclusive of approaches, will<br />\ner, color dark tan, bellows<br />\nold mooted question of the relative cover an area of eight acres. The<br />\ntongue, dirt and waterproof.<br />\nThe Greetings of a Fine Store<br />\nThe actual value of this shoe<br />\nimportance of hereditary and en- east and west stands alone contain<br />\nis $6.00. Owing to this trevironmental influences.<br />\nTo the Students of a Fine University<br />\nseventeen miles of seats, with a camendous buy we can offer<br />\npacity of 55,000 persons. The comsame to the public at $2.95.<br />\nNON-FRATERNITY MEN OR- pletion of the north and south ends Send correct size. Pay postman on<br />\nGANIZE AT RUTGERS<br />\nwill bring the total seating capacity delivery or send money order. If<br />\n, A new campus social organiza- to 120,000. There will be a guar. shoes are not as represented we<br />\nHOCHSCHILD,KOHN<br />\ntion, named the \"College Lodge,\" ter-mile track around the arena, will cheerfully refund your money<br />\nupon request.<br />\nhas been formed at Rutgers by a which will also have two 220-yard promptly<br />\nnumber of non-fraternity men and straightways. The equipment which<br />\nhas secured the recognition and ap- the huge structure will have to<br />\nproval of the faculty.<br />\ntake care of the various sporting<br />\ninorganized<br />\nactivities will be the most modern<br />\nwas<br />\nsociety<br />\nThe<br />\nyear<br />\ncollege<br />\navailable.<br />\n296 Broadway, New York, N. Y.<br />\nthe<br />\nin<br />\nearly<br />\nformally<br />\nclassmen<br />\nupper<br />\nof<br />\ngroup<br />\nsmall<br />\nby a<br />\nwho had come to feel the need for<br />\nsome organization through which<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nthe neutrals might take a fuller<br />\ngeneral<br />\nthe<br />\nin<br />\nand more active part<br />\nOrchestra—Dancing<br />\nTelephone, Vernon 3442<br />\ncollege life.<br />\n3.30 to 5.30 P. M. and 6 to 8 P. M.<br />\nIt is hoped by the creation of<br />\nTABLE D'HOTE<br />\nDINNER—$1.00<br />\nLUNCHEON-60c<br />\nthe College Lodge and by means of<br />\nmembership,<br />\n1.25<br />\nfor<br />\nDINNER—$<br />\nSUNDAY<br />\nrequirements<br />\nits<br />\nco-operamutual<br />\nand<br />\nfellowship,<br />\ntion, that it will serve to encourage<br />\nOf heavy Scotch Grain Leather; black or<br />\nnon-fraternity men to take a more<br />\nactive part in undergraduate activtan; equipped with rubber heel:—a colities and to strive for higher scholege shoe designed for real college men.<br />\nlastic standing. Moreover, it will<br />\nbe able to function as a fraternity<br />\nin social matters, particularly in reYOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nspect to dances and house parties.<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nThe organization is, however, in<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UPno sense a fraternity. Admission<br />\nAT CHARLES STREET<br />\nto membership is normally to be<br />\nsatisand<br />\napplication<br />\ngain1 upon<br />\n216 NORTH<br />\n1724 N. CHARLES ST.<br />\nfactiOn of certain set published reinvitaby<br />\n10 Minutes from Hopkins<br />\nquirements rather than<br />\n1 Vernon 3055<br />\ntion.<br /><br />\nThe \"COLLEGIAN\"<br /><br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br /><br />\n4<br /><br />\nitlaac<br /><br />\n-<br /><br />\nURNER'S<br /><br />\nFURNITURE OF QUALITY<br /><br />\nPUBLIC SALES<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\n8cCo.<br /><br />\nNational Bay State<br />\nShoe Company<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br /><br />\nA Hopkins<br />\nBrogue $8<br /><br />\nRADIO!'<br /><br />\nSlesingers<br /><br />\nRADIO SUPPLY CO.<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, FEBRUARY 16, 1923<br /><br />\nRIFLE TEAM MAKES SCORE<br />\nHOPKINS GRADUATE IS<br />\nSTUDENT CONFERENCE<br />\nPROMINENT IN \"Y\"<br />\nHARTSDALEOF<br />\nSTAGE<br />\nFIRST<br />\n949<br />\nIN<br />\n,<br />\nAT<br />\nHELD<br />\nThe Medical Standard Book Co.<br />\nPlaying KEITH Attractions<br />\nWORK<br />\nOF INTERCOLLEGIATES<br />\nNEW YORK<br />\n(THE BOOK MART)<br />\nShooting Done from Prone and<br />\nAfter three and one-half years as<br />\nA student conference was held<br />\nWeek of February 19<br />\nYork,<br />\nPositions.<br />\nSitting<br />\nU.<br />\nof<br />\nCal.<br />\nHartsdale,<br />\nNew<br />\nrecently<br />\nat<br />\nsecretary for the American 3—PERFORMANCES WASHINGTON'S<br />\nchief<br />\nComplete Stock of<br />\nBIRTHDAY-3<br />\nBeing Met This Week<br />\nby the political clubs of several col- Y. M. C. A. with the American<br />\nMedical Books and College<br />\n1.45, 4.45 and 8 P. M.<br />\nRequisites<br />\nThe score made by the Johns leges composing the National Stu- Forces in Germany, and a total of<br />\nFOUR GREAT AND EQUAL HEADLINES<br />\nImporters and Dealers in Fine Books Hopkins Rifle Team in the first dent Forum. The conference was<br />\nand<br />\nyears<br />\none-half<br />\nfive<br />\nof<br />\nuninterweek of the intercollegiates was an- different from most held in the fact<br />\nDe Lyle Alda<br />\n301 N. CHARLES ST.<br />\n\"SADIE—ONE OF THOSE GIRLS\"<br />\nnounced by Capt. McMurray to that only students were present. rupted Association service for the A InSatire<br />\non the Season's Stage Successes<br />\nLyrics by Arthur Swadstrom<br />\nBaltimore, Md.<br />\nbe 949. This figure is unofficial, There were no famous speakers to troops abroad, James A. Sprenger, Book andMusic<br />\nby Carey Morgan<br />\nconferenthusiasm,<br />\nthe<br />\nyet<br />\narouse<br />\nStaged by Bert French<br />\nwho graduated from Johns Hopand is subject to change by the officials of the intercollegiate matches. ence has been termed a decided suc- kins in 1908, has just returned to The Headliner Stars of \"The Music Box<br />\nRevue\" and \"Two Little Girls in Blue\"<br />\nIN-rt<br />\nThe team consisted of five men, cess by the Student Forum.<br />\nthe United States.<br />\nFairbanks Twins<br />\nThe students discussed the ecoand only the prone and sitting po41-$ ciL,<br />\nthat<br />\nThe<br />\nMr.<br />\nfact<br />\nSprenger<br />\nwas Hegedus<br />\nsitions were used. The individual nomic basis of education, and their<br />\nSisters &amp; Juan Reyes<br />\nselected<br />\nto<br />\nhead<br />\nY.<br />\nA.<br />\nwork<br />\nM.<br />\nC.<br />\nscores, also unofficial, of the mem- responsibility in view of it, on the<br />\nWill Mahoney<br />\nbers of the team were as follows: basis of their own experience and with the troops in Germany was a<br />\n\"WHY BE SERIOUS\"<br />\nW. M.—Prone,98; sit- of the critically examined evidence testimonial to his work in France<br />\n4 Rowland,<br />\nCls eXatteti<br />\nof others. The conclusions reached during 1917-1918. That he has Steve—Freda &amp; Anthony—Jack<br />\ntotal,<br />\n192.<br />\nting,<br />\n94;<br />\nH.&amp; OSCAR<br />\nIn \"BARTCHA—KALLOPP\"<br />\nthe end of the conference are exat<br />\nE.—Prone,<br />\nR.<br />\nsitParks,<br />\n100;<br />\n111..l<br />\noWN Et...4<br />\nR<br />\nrip.<br />\n0<br />\nmore than justified this confidence<br />\nAndrew Lydon's Bit of Artistry<br />\npected to be very helpful to the edting, 91; total, 191.<br />\n•<br />\nDz<br />\nis borne out by the statement of<br />\n\"Dreams\"<br />\ncountry.<br />\nof<br />\nucators<br />\nthe<br />\nM.—Prone,<br />\nG.<br />\nsitRuoff,<br />\n99;<br />\nA Study in Color, Beauty and Grace<br />\n29 Baltimore St., East<br />\nGeneral<br />\nHenry<br />\nMajor<br />\nT.<br />\nAllen,<br />\nin<br />\nFour similar conferences are beting, 92; total, 191.<br />\nOne Door West of Ligbt St.<br />\nBarrett &amp; Farnum<br />\nplanned by the students of command of the American Forces<br />\ning<br />\nsitting,<br />\nJ.<br />\nMount,<br />\nE.—Prone,<br />\nBALTIMORE<br />\n95;<br />\nFOR<br />\nAGENTS<br />\nSOLE<br />\nIn \"DANCING—AND THEN SOME\"<br />\nFor College Fraternity Band.<br />\nand<br />\nChicago<br />\nOberlin,<br />\nSwarthmore,<br />\nthe<br />\nRhine,<br />\non<br />\nthat<br />\nwelfare<br />\n\"soldier<br />\ntotal,<br />\n93;<br />\n188.<br />\n(Greek Letter Societies)<br />\nR. &amp; W. Roberts<br />\nBates, F. T.—Prone, 96; sitting, Reed College, at Portland, Oregon. work never before reached the presWorld's Famous Equilibrists<br />\n91; total, 187. Grand total, 949. The National Student Forum states ent high standard maintained here.'<br />\nLast week's score was to count that the effects given to the life of<br />\nMr. Sprenger's departure from<br />\nPrinters of Philological and<br />\nat the same time as the score in a America by the students are of a<br />\nshortly after the first of<br />\nCoblenz<br />\nScientific Works<br />\nmeet against Georgetown, from new and vital nature. It is hoped<br />\nNext Week<br />\nwhom no returns at all have been by them, through the various con- the year inspired a remarkable Matinees Wednesday tic Saturday<br />\n23 S. HANOVER ST.<br />\nferences, to have students play as series of testimonials to the value<br />\nLaltimore, Md.<br />\nreceived.<br />\nPositively Only One Week<br />\ninfluential<br />\npart in public opinion as of his service and that of the organIn the meet against the UniverWagenhals &amp; Kemper Present<br />\nsity of California, during the week they already do in Europe and ization which he represented, from THE<br />\nWORLD'S GREATEST<br />\nFine Clothes<br />\nending February 16, the team will Asia.<br />\nDRAMATIC SENSA TION<br />\nGeneral<br />\nMajor<br />\nAllen,<br />\nmembers<br />\nof<br />\nA suit by Lemmert gives the final consist of ten men, and will shoot<br />\ntouch to the lasting sathafaction you<br />\nhis staff and members of the Interderive from thoroly dependable from all four positions,—prone,<br />\nBARNARD FOR TEN-HOUR Allied Rhineland High Commiscloths cut in authentic fashion— kneeling, sitting and standing. The<br />\nwhether for every-day wear or more<br />\nDAY<br />\nsion.<br />\nfollowing men are on the team for<br />\nfestive occasions.<br />\nBy Mary Roberts Rinehart and<br />\nYork Times)<br />\nNew<br />\nthe<br />\n(From<br />\nthis match: G. M. Ruoff, R. E.<br />\nThe magnitude of the work unAvery Hopwood<br />\nParks, F. L. Ross, W. M. Rowland, A ten-hour day and a six-day der Mr. Sprenger's immediate suLEM M ERT<br />\nOver<br />\nTwo (2) Years at the<br />\nJ. D. Virdin, J. E. Mount, H. E. week have been recommended for pervision<br />\n19 Fayette Street, East<br />\nMorosco, New York<br />\nwill be realized when it<br />\nof<br />\nBoard<br />\nthe<br />\nby<br />\ngirl<br />\ncollege<br />\nthe<br />\nWilgis, F. E. Williams, W.. V.<br />\nA Year in London<br />\nBusiness Suits<br />\nDress Clothes<br />\nStudent Presidents at Barnard Col- is recalled that the Army of OccuReed and F. T. Bates.<br />\nOvercoats<br />\nSport Togs<br />\nMore<br />\nThan<br />\na Year in Chicago<br />\nwhich<br />\nproposes pation which was sent up into Gerlege in a resloution<br />\na new point system to regulate ex- many after the Armistice consisted<br />\nThe Mystery Masterpiece of<br />\nModern TimesI<br />\nCOSMOPOLITAN CLUB MEET- tra-curricular activities. Each stu- of about 300,000 men and took over<br />\nSARATOGA AT<br />\nThe Company That Played Here<br />\ndent's entire college activity, acaING TONIGHT<br />\nsome 3,000 square miles in and<br />\nLIBERTY STS.<br />\nThis and Last Season<br />\nA meeting of the Cosmopolitan demic and otherwise, would be lim- around<br />\nCoblenz.<br />\nFor<br />\nthese<br />\nmen<br />\nthe<br />\nLUNCHEON<br />\nThe Special ''Big Cities'<br />\n.<br />\nClub will be held tonight at eight ited to twenty points, each point Association<br />\ncarried on 425 centers,<br />\nCompany<br />\nthree<br />\nhours'<br />\nstanding<br />\nwork<br />\nfor<br />\nas<br />\nTEA<br />\no'clock, at the Homewood Friends<br />\nwith service by rolling canteens at<br />\nMeeting House, 3107 North it does in the academic system.<br />\nDINNER<br />\nout-stations. As the troops in<br />\n83<br />\nThis plan would allow eight<br />\nSPECIAL PARTIES Charles Street. A social will be<br />\nGermany<br />\nwere reduced in number<br />\ngiven the club by the members of hours for sleep, two for exercise, the<br />\nWeek of February 19th<br />\n11.30 A. M.<br />\nY.<br />\nW.<br />\nC. A. service was proporthe society, preceded by a short four for meals and other time at tionately<br />\nuntil<br />\nMessrs. Lee and L. J. Shubert<br />\ndecreased,<br />\nand<br />\nMr.<br />\nwhen<br />\n7.30 P. M.<br />\nPLAZA 6987 business meeting. Several promi- home, leaving ten hours for college<br />\nPresent<br />\nSprenger departed it was necessary<br />\nnent speakers have been secured activities. The board suggests that to leave staff<br />\nSixth Year of the<br />\nof<br />\na<br />\nonly<br />\n12<br />\nmen<br />\nand<br />\nand every effort will be made to exceptions be made in the case of women to carry<br />\nBRILLIANT<br />\non the work for<br />\nmake the social one of the most seniors, by special permission from the<br />\nBEAUTIFUL<br />\nAmerican<br />\n1,200<br />\nsoldiers<br />\nreMANUFACTURING JEWELERS<br />\nsuccessful in the history of the the Faculty Committee. Points for maining. These<br />\nMEMORABLE<br />\ntroops have now<br />\nLancaster, Pa.<br />\neach student office would be deterclub.<br />\nbeen recalled, and Y. M. C. A. repClass Rings, Pins, Fraternity Pins,<br />\nThe Cosmopolitan Club was or- mined by means of time studies. resentatives accompanied them to<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes ganized largely through the efforts<br />\nthe point of embarkation on their<br />\n\"Makers of the Varsity Seals\"<br />\nBook and Lyrics by<br />\nof the Hopkins Y. M. C. A., to<br />\nST. LOUIS ENGINEER AD- homeward way. .<br />\nRida<br />\nJohnson Young<br />\nbring the foreign students of the<br />\nMr. Sprenger's service abroad<br />\nDRESSES<br />\nM.<br />\nE.<br />\nA.<br />\nS.<br />\nScores by Sigmund Romberg<br />\nUniversity together, thereby prohas .been outstanding also because<br />\nThe 'February meeting of the<br />\nWith<br />\nducing a spirit of fellowship among<br />\nhe had a leading part in the organMARION GREEN<br />\nthem, and making their American Baltimore section of the American ization and direction of<br />\nthe great<br />\nCommercial Photography<br />\nand<br />\nuniversity life more pleasant.<br />\nSociety of Mechanical Engineers leave areas where American solCircuit Photography<br />\nNANCY GIBBS<br />\nwas held last Wednesday night, diers spent their leave periods. The<br />\nFlash Lights<br />\nViews<br />\nGrace Studiford, Tilly Salinger,<br />\nGroups<br />\nMlle. Loretta, Peggy Purdy,<br />\nEnlargements BUCKNELL CHOOSES WOLF February 14, at the Engineers Club. Association hired the recreation facilities<br />\nof<br />\nseveral<br />\nof<br />\nthe<br />\nmost<br />\nfaMaude<br />\nWilliams, Arthur Albor<br />\nspeaker<br />\nThe<br />\nBoone<br />\nwas<br />\nMr.<br />\nV. H.<br />\nKODAK FINISHING<br />\nAS MASCOT<br />\nand Others<br />\nmous<br />\nwatering<br />\nplaces<br />\nof<br />\nFrance<br />\n325 N. Howard St.<br />\nWhen the Navy goat, the Army Johnson, a prominent engineer and and provided sightseeing trips,<br />\nAnd a Bevy of Beautiful Girls<br />\nMt. Vernon 4999<br />\nmule, the Yale bulldog, and the vice-president of the Common- sports, and entertainments free for<br />\nall soldiers on leave. There were<br />\nPyinceton tiger trot upon the grid- wealth Steel Company.<br />\nThe<br />\nlecture<br />\nby<br />\ngiven<br />\nMr.<br />\nJohnother<br />\ncenters not on the coast but<br />\nSHIRTS<br />\nNECKWEAR iron next fall they will be assured<br />\nson was illustrated by motion pic- in the mountain country. In addiof a new companion. The mascot<br />\ntures taken at the famous St. Louis tion, recreation centers were orrecently chosen for the Bucknell plant of the Commonwealth Steel ganized for men having week-end<br />\nNow In Its<br />\n421 N. HOWARD ST.<br />\neleven, the timber wolf, will be the Company, one of the most noted or single day leaves. A total of<br />\nHOSIERY<br />\nGLOVES newcomer<br />\nin the field. According steel plants in the country. The 457,704 men with seven-day leaves<br />\nNINTH WEEK<br />\nmethods<br />\nused<br />\nby<br />\nthis<br />\ncompany<br />\nare<br />\nentertained<br />\nwere<br />\nin<br />\nareas<br />\nin<br />\nsuch<br />\nto \"Bill\" O'Brien, the \"town barANNE NICHOLS' LAUGHING<br />\nEstablished 12/13<br />\nber\" at Bucknell, who has tonsorial- among the most novel and improved France, Germany and England,<br />\nSUCCESS<br />\nany similar concern and, there- and 706,671 with shorter leaves.<br />\nkH.Fetting Man'fg Jewelry Co. ly operated on students at the col- of<br />\nfore, were doubly interesting to<br />\nlege for more than a score of years, both the Hopkins men present and<br />\nManufacturers<br />\nGreek Letter Fraternity Jewelry<br />\nother mascots will have to be at the members of the Baltimore sec- FOREIGN STUDENTS CRITI213 N. LIBERTY ST., Baltimore, Md. their best to eclipse the perform- tion.<br />\nCIZE UNIVERSITIES<br />\nance of the wolf. \"Those timber 'The picture shown illustrated the<br />\nThree foreign students who are<br />\nSTRATTON SHIRT MAKER<br />\nwolves are tough babies,\" Bill ex- making of steel castings, handling investigating American institutions<br />\n226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00 plains; \"they ain't afraid of any- scrap by magnet, assembling ma- criticise them on the ground that<br />\nNegligee<br />\n$3.25 and $4.25<br />\nterials for heats, and cutting scrap American students pay no attention<br />\nImported Madras<br />\n$5.25 and $6.25 thing. When that he-beast of ours with oxy-acetylene<br />\ntorches. Orig- to religion or politics during theh<br />\nTerms Cash, Less 10% 30 Days on<br />\ntrots into the bowl in the fall, that Inal and remarkable photographs college courses. Their<br />\nShirts<br />\ninterests are<br />\nAlso a Full Line of Men's<br />\nYale bulldog will have to look were shown of steel boiling within centered in less important matters<br />\nTHE PLAY THAT PUT<br />\nFurnishings<br />\ntwice.\"<br />\nthe furnace.<br />\nthan is usual in foreign universities.<br />\nU IN HUMOR<br /><br />\nMARYLAND THEATRE<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nAUDITORIUM<br /><br />\nTHEBAT<br /><br />\nFORD'S<br /><br />\nJ. F. Apple Co.<br /><br />\nMAYTIME<br /><br />\nW.L. Mann<br /><br />\nLefranc &amp; Ault<br /><br />\nAcademy of Music<br /><br />\nMI<br />\nIRISH<br />\nROSE<br /><br />"}], "field_media_file": [{"target_id": 37709, "display": null, "description": null, "target_type": "file", "target_uuid": "94744e71-faae-4b47-802f-4d20d805fdc4", "url": "http://digital.library.jhu.edu/system/files/2022-03/13045-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13045, "target_type": "node", "target_uuid": "2026d4c2-dce6-4e9a-a4d5-f2c15dbca43f", "url": "/node/13045"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f778f423-7d3a-4d18-ac33-c42789f2a818"}]}