{"mid": [{"value": 37315}], "uuid": [{"value": "402d97d2-d6c0-4ecc-96a5-9861feb4dd00"}], "vid": [{"value": 37315}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T17:03:47+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13292-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T17:03:47+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T17:03:47+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "155<br />\n<br />\n:e<br />\n<br />\nVOL. XXXII, No. 20<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 13, 1927<br />\n<br />\nBASKETBALL DATES<br />\nARE ANNOUNCED<br />\nI<br />\nTentative Schedule o f<br />\nGames Booked<br />\n<br />\nEight<br />\n<br />\nAUTUMN LACROSSE<br />\nPRACTICE ENDS<br />\nPractice for lacrosse has<br />\nbeen suspended until next<br />\nspring because of inclement<br />\nweather conditions. Manager<br />\nCarroll wants every man who<br />\nhas university equipment<br />\ncharged against him to return<br />\nthe same to either himself or<br />\nto Junior Manager William<br />\nBanks, who will be at Homewood field locker room tomorrow afternoon. Men who<br />\nhave personal equipment at<br />\nthe field should also procure<br />\nit at this time.<br />\n<br />\nU. S. IS GREATEST<br />\nBRITISH PROBLEM<br />\nPremier's Secretary Explains Empire Formation<br />\n<br />\nFIRST COTILLON<br />\nRESULTS IN DEFICIT<br />\nOne hundred and twentyone dollars was lost by the<br />\nCotillon Club on the first Cotillon held on December 2.<br />\nDue to this deficit the Club<br />\nwill hold no more dances until after the holidays, according to Kenneth Proctor, one<br />\nof its members. The amount<br />\nlost will have to be made up<br />\nat the Saturday night dances<br />\nafter the first of the new year.<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nFARINHOLT TO BE<br />\nRHODES SCHOLAR<br />\nHopkins Graduate Student is<br />\nSelected from 23 Applicants<br />\n<br />\n\"The greatest problem of the<br />\nWILL STUDY CHEMISTRY<br />\nBritish empire is the United States,\"<br />\nsaid Philip Henry Kerr, Secretary<br />\nto Lloyd George during the World<br />\nPractice Sessions to Be Held<br />\nTo Leave in October for Three<br />\nTuesdays and Fridays<br />\nWar, in a lecture on \"The ProbYears' Stay at Oxford<br />\nlems of the British Empire,\" delivered Thursday afternoon in the<br />\nFive games have been definitely<br />\nLarkin H. Farinholt, '27, has<br />\nC. E. Building. In discussing the<br />\narranged by Manager Bauernbeen awarded the Rhodes ScholarSchmidt for the basketball team this<br />\nrapid economic expansion of the Football Team Feted<br />\nship from the Maryland-District of<br />\nWinter. Georgetown will be met<br />\nRooters<br />\nBig<br />\nBy<br />\nUnited States and the complicated<br />\nColumbia district for 1928, the State<br />\nin two matches, two _games will be<br />\nproblems which this would bring<br />\nMembers of the Big Rooters As- committee announced yesterday.<br />\nPlayed with University of Mary- Activities Council<br />\ninto existence, Mr. Kerr stressed sociation, incorporated, played host Farinholt is the -first Hopkins man<br />\nland and another battle is assured<br />\nChanges<br />\nConstitution<br />\nthe similarity of the fundamental to the coaches, manager and major<br />\nWith the University of Baltimore<br />\nto hold the scholarship since Frank<br />\ninterests<br />\nof the British Empire and letter men of this season's football<br />\nSeveral<br />\namendments<br />\nto<br />\nthe<br />\nconquintet.<br />\nMorley, and is the first Marylander<br />\nthe United States, which he beOther games are pending with stitution of the Student Activities lieves will tend to keep the two na- team at a theatre and dinner party to hold the honor since the District<br />\nSt. John's, Washington College and Council were made at the meeting<br />\nlast night. Twenty guests were of Columbia was united with Marytions in harmony.<br />\nSwarthmore. Negotiations are still last Thursday in room 209, M. E.<br />\nfeted by the Association.<br />\nland for selection purposes several<br />\nunder way with Stevens College. building. The thost important \"The United States is an ancient<br />\nin<br />\n•formidable<br />\nAlthough<br />\nvery<br />\nEmBritish<br />\npower<br />\ncompared<br />\nto<br />\nthe<br />\nyears ago. He will begin his studies<br />\nAnother possibility is a -game with changes provide that in the future<br />\nan all-star Mexican five Which will the Secretary of the Student Ac- pire,\" Said Mr. Kerr. The old em- name, this organization is com- at Oxford next October, specializtour the United States and is seek- tivities Council shall take charge of pire, which was built up before posed, in reality, of but two'men. ing in chemistry.<br />\ning matches with representative col- the collection of 11 non-athletic 1776, was effectively broken up by Dr. W. Aarenson, who has been<br />\nFor Colleges Represented<br />\nfees of registration day, and that the revolt of the American colonies. nominated by Dr. Van Orman for<br />\nleges.<br />\nThe breaking up of that old emmanagers<br />\nof<br />\nthe<br />\nactivithe<br />\nvarious<br />\nAll home games will be played<br />\nAll-American rooter and dopester; TwentY-three applicants, repreat Carlin's, which is the most mod- ties must prepare budgets and place pire taught England many invalua'lessons, among them that liber- and who, incidentally, is an uncle senting ten universities, were presernly equipped court in the city. them in the hands of the council. ble<br />\nent last Saturday morning when the<br />\nThe amusement park floor is equip- The constitution is at present being ty is the cement of empires. The of Manny Aarenson, former captain<br />\nbeen<br />\non<br />\nformed<br />\nof the Hopkins track team, is pres- committee met in President GoodPed with an automatic scoreboard reprinted with these changes. At present empire has<br />\nthis basis, and the greatest possible ident of the organization. Dr. D. now's office to make the selection.<br />\nsame<br />\nmeeting,<br />\nthe<br />\naction<br />\na<br />\nproon<br />\nand plate glass backboards. The<br />\nliberty has been given to the cornglass backboards enable spectators posal that seals be awarded to deSilberman, brother-in-law of How- After several hours' deliberation,<br />\nponent.parts.<br />\nIt was with this prinseniors<br />\nin February was desitting behind the baskets to obtain serving<br />\nthe choice narrowed down to Farinciple in view that the Imperial Con- ard Caplan, is vice-president, secrea clear view of all shots.<br />\nferred till some future date.<br />\nholt and Harvey C. Mansfield, a<br />\ntreasurer.<br />\nand<br />\ntary<br />\nEmference of last year divided the<br />\nIt is a possibility that dances will<br />\ngraduate<br />\nstudent at Cornell. Finally,<br />\nparts—the<br />\nBritish<br />\ninto<br />\ntwo<br />\nprompire<br />\nparty,<br />\nwhich<br />\nThis<br />\nhad<br />\nbeen<br />\nbe held at the C. E. Hall followthe<br />\nNations<br />\nand<br />\nCommonwealth<br />\nof<br />\nFarinholt<br />\nwas selected, and Mansised immediately after the team's<br />\nSecond Cotillon<br />\ning the games.<br />\nBritish Empire proper.<br />\nvictory over Maryland, had been field recommended as_ scholar-atPractice Today<br />\nNight After Exams<br />\nawaited with eagerness by those large. He may receive an appointSix Autonomous Nations<br />\nPractice started Friday at CarTuesday, January 31, will be the<br />\nwho were fortunate enough to re- ment in the event of any State's<br />\nlin's and will be continued today. date of the second Cotillon, accordUnder this arrangement the Britinvitations. According to re- failure to nominate a man to fill its<br />\nceive<br />\nAbout forty candidates reported to ing to Maxwell Armor, president ish Commonwealth is composed of<br />\nCoach Darley. Practice sessions of the Cotillon Club. The place six practically autonomous nations ports, the party was a huge success vacancy.<br />\nwill continue every Tuesday and has not as yet been definitely de- that have entire charge of all do- and official sanction was given to<br />\nFrom Friends School<br />\nPriday afternoons at four o'clock cided upon, but it is thought the mestic and practically of foreign the Association by the football conVarsity<br />\nClub.<br />\nthe<br />\ntingent<br />\nof<br />\nuntil the middle of January.<br />\nFarinholt received his high school<br />\nSouthern Hotel will be chosen, affairs. They are bound together<br />\nThe usual practice of appointing ANrhere the dance will last from nine by tradition, language and similar<br />\neducation at Friends School. He<br />\nt<br />\n.wo<br />\nwas the recipient of the Eli M.<br />\njunior managers -will not be to three. As this is the night after political systems. After the war<br />\nintroduced this year, competition<br />\nLamb scholarship to Hopkins, an<br />\nexaminations, a large attendance is it was widely thought that the Brit- Dr. Wight Speaks At<br />\nbeing continued up to the senior expected, which, it is hoped, will ish Empire would disintegrate, but<br />\ngiven annually to one memFriendship Meeting award<br />\nYear. It is now possible for a man help to repair the financial disaster as Mr. Kerr said:\"It is more closeber of the graduating class, with the<br />\nDr. Carol V. B. Wight will be the highest scholastic average. He was<br />\n,t_? go out for the managership in of the first Cotillon.<br />\n(Continued on page 5, column 3.)<br />\nat the Friendship Council also voted the Buffington award,<br />\nspeaker<br />\nins third year and, by hard work,<br />\ntonight.<br />\nEdward T. Beall, granted annually to the student bemeeting<br />\nbecome manager of the team in his EIGHT-THIRTY,CLASS TAKES ON DOGGY<br />\nwho is in charge of the affair, stated lieved to have exerted the greatest<br />\nsenior term.<br />\nATMOSPHERE AS SMALL CANINE APPEARS that Dr. Wight has been allowed to influence for good in the institution.<br />\nThe schedule to date follows:<br />\nJan. 17--St. John's at Annapolis<br />\nWoof! Woof! Nice doggie, pro- benches at a bound and was soon choose any topic he may desire. A. At Hopkins his record includes memconsisting of Ensor, Gunders- bership in two honorary fraternities,<br />\n(Pending).<br />\nfessor wants to teach 'urn little boys wagging his tail expectantly right trio,<br />\nand Kilmor, will sing also. Omicron Delta Kappa and Tau<br />\ndorff<br />\nJan- 18—Georgetown at Washing- Hell-Hell-Hellenic History. Sick in the professor's face. That aston,<br />\ntonished gentleman naturally fa- The election of C. F. Perkins to the Beta Pi, each of which represents<br />\n'urn Cicero! Such were the disvored the pup's immediate and .for- Cabinet as freshman representative the highest goal in its line of enJan. 20—University of Maryland<br />\nanyone<br />\nointed<br />\nwhich<br />\nmight<br />\nremarks<br />\ncible ejection from the room, but will be officially announced. A spe- deavor. He was editor-in-chief of<br />\nat Baltimore.<br />\nFriday<br />\nmorning<br />\nbehave<br />\nheard<br />\nlast<br />\n16—Washington College at<br />\nfinally the students prevailed *upon cial effort is being made to have the Black and Blue /ay, was a memtween eight and eight twenty-five him that such zeal for learning those men who have not as yet ber of last year's championship laBaltimore (Pending).<br />\nPeb. 21—University of Maryland had he thawed sufficiently to get to should be rewarded. Who knows come to the Council attend.<br />\ncrosse team, was president both of<br />\nbeen a Phi Beta of<br />\nat College Park.<br />\nthe senior class and the Student Aca class on the third floor of Gilman this might have<br />\nb. 22—Georgetown_at Baltimore.<br />\ndogdom. At any rate, the ancient<br />\ntivities Council. He received first<br />\ntar 2—Swarthmore at Baltimore Hall at that frosty hour of the tag suspended round his neck Lord Baltimore Press<br />\nhonorable mention in the awarding<br />\nmorning.<br />\n,<br />\nstrangely resembled the well-known<br />\nof<br />\n(Pending).<br />\nTo Print Annual the Alexander Barton cup.<br />\nMar. 9—University of Baltimore at Nevertheless, things were changed key carried by members of that<br />\nNo Formal Examination<br />\nThe Lord Baltimore Press will<br />\nconsiderably by the time the good worthy brotherhood.<br />\nBaltimore.<br />\nHullabaloo,<br />\nacyear's<br />\nthis<br />\nprint<br />\nHowever, the curiosity of the<br />\nAccording to the terms of the<br />\nprofessor put in his appearance.<br />\ncording to a statement made by scholarships,<br />\nnot<br />\nbe<br />\ncould<br />\nstudents<br />\nrestrained<br />\nand<br />\neach State of the<br />\nThe bewildered canine who had<br />\nthe good professor soon decided Leonard Dalsemer, business mana- United States is entitled to two<br />\nlioPkins To Enter<br />\ncaused all the commotion had been<br />\nthe diminutive airedale proved ger of the year book. The new scholars in residence at any one<br />\nA. A. U Meet persuaded to occupy one of the that<br />\ntoo much of a diversion from the publishers of the annual, having time. Accordingly, the selections<br />\nHopkins will run in the A. A. LT. vacant benches so naturally that the subject of the lecture to remain one of the largest plants in Balti- are made twice every three years,<br />\n'fleet on December 17, at Clifton drowsy prof did not at first dis- longer in the room. After several more, are printers of the telephone<br />\nor in two-thirds of the States every<br />\nark, over a six-mile course. The tinguish him from the rest of his admonishments to \"leave that dog directories and much of the adver- year. The selection lies in the hands<br />\n'lam entered the meet at this late class of \"doggy\" collegians. This alone!\" he personally escorted Fido tising matter for nationally known of a committee in each State com'late on their own will, even though very intelligent brown representa- to the door and left him in the cold, products.<br />\nposed of leading educators and high<br />\ntheY had broken training after the tive of the species airedale managed cold corridor to wander and ponder<br />\nRepresentatives of the White public officials. The candidates are<br />\n!fleet with Maryland on Thanksgiv- to retain his composure throughout<br />\non the dog's life led by students Studio, Hullabaloo photographers, judged solely on the basis of their<br />\ning day. \"The meet will probably the preliminary exercises of calling of the Johns Hopkins University. will return to the University im- records at college and a personal in,riarrow down to team competition the roll, though it is said some of Hot Dawg! remarked one youth, on mediately after the Christmas holi- terview with the committee. There<br />\nnetween Emorywood Club and the students experienced a good the instructor's return.<br />\ndays to take fraternity pictures. is no formal examination. The<br />\n°Akins,\" said Ridgely Edwards, deal of difficulty in preventing him<br />\nAfter class someone overheard 'Advertising is coming along slow- chairman of the Maryland commit• but in spite of the break in train- from barking in unison with chor- the professor humming,\"0 where, ly. More candidates are needed tee is Emory H. Niles.<br />\nWe should have an even us of \"heres,\" but when the instruc- 0 where has my little dog gone ?\" for the business staff of the publiThe annual allowance under the<br />\nchance.\" Hopkins will enter this tor made mention of Xenophon's It is doubtful if any eight-thirty cation. Students who wish to try scholarships was formerly £300, but<br />\nevent, the last competition of the bones, this was too muchk. The class was ever so wide awake be- for places on that staff should re- has recently been raised to £400.<br />\nYear, with nine men.<br />\ndoggie cleared the front row of fore.<br />\nport to Business Manager Dalsemer. This sum is slightly less than $2,000.<br />\nRIG CROWD AT PRACTICE<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br />\n<br />\n2<br />\n<br />\nThe Johns Hopkins News -Letter<br />\n<br />\nShort But Rough<br />\n<br />\nFOUNDED 1897<br />\n<br />\nBy GEORGE BENTLEY<br />\n$2.00<br />\n<br />\nE. E. ADAMS<br />\n<br />\nTwenty degrees below freezing. presence of the subterranean stream<br />\nBARN CAFETERIA<br />\nmoon, round and white as a which cut through steep banks just<br />\nThe<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nWhat<br />\nclammy<br />\ncold.<br />\na<br />\nahead<br />\nfelt<br />\nI<br />\nbalefully<br />\nfrozen fish's eye, glared<br />\nBaltimore. Md., under Act of Congress, November 3, 1879.<br />\nif this lamp had also exploded,? On<br />\ndown upon the leafless trees sur- the other side of the dark chasm<br />\nPublished semi-weekly from October to June by the students of Johns rounding the Dormitory. Finding a few feet away, the passage<br />\nHopkins University.<br />\nit too cold to venture out to a Friday stretched off into blankness.<br />\nnight movie, Jeff Baker and I had \"As I stood there I suddenly noBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nacross the Dormitory court ticed the appearance of two figures<br />\ndashed<br />\nEDITOR;<br />\nMANAGING<br />\nthe<br />\nto<br />\nHopkins University. All articles should be sent<br />\n-CHIEF.<br />\nEDITOR-IN<br />\nthe<br />\nto<br />\nand up to our room to on the opposite bank—they were the Phone, CAI. 1380 Home—HO. 2095-J<br />\nentry<br />\ncommunications<br />\nto our<br />\nother<br />\nus<br />\nsmoke a pipe and talk over our same women who had accosted<br />\nFRANCES T. BANNON<br />\nin the street a few days before. Successor to HARBAUGH & BANNON<br />\nUniversity 0100<br />\nTelephone<br />\ntroubles.<br />\nThe tall, ugly one pointed a finger 2 E. LEXINGTON ST., Cor. Charles<br />\n\"Got a 5.5 informal in French,\" at me and opened wide her mouth<br />\n(Room 28)<br />\nEDITORIAL DEPARTMENT<br />\nStenographic Dictation, Copying,<br />\nmuttered Jeff; \"confound that in- in a hideous, derisive laugh. But<br />\nEditor-in-Chief<br />\nMultigraphing, Mimeographing<br />\nthrough the roaring of the water no<br />\nMORTON HAMBURGER, JR., '28<br />\nstructor.\"<br />\nBaltimore, Md.<br />\nEven<br />\nsound<br />\nother<br />\nperceptible.<br />\nwas<br />\n\"Why, I thought you spent three<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nas I watched, I noticed that the<br />\nDONALD HISS, '29<br />\nweeks in France this summer!\"<br />\nNORMAN B. GARDINER, JR., '28<br />\nCarl J. Doederlein<br />\nshorter, and apparently the younger<br />\n\"Yes, but with Tubby Jackson and prettier girl, was arguing<br />\nColumnist<br />\nDIAMONDS<br />\nalong, I didn't have to know any with her companion. She bolted<br />\nALEXANDER C. WOODS, JR., '28<br />\nMfrs. of Fraternity Goods of All Kinds<br />\nFrench. I never will forget the brusquely and returned a second<br />\nAssociate Editors<br />\nBANK BUILDING<br />\nwe were standing in front later with a long board. The tall 504 PARK<br />\nevening<br />\nGEORGE E. RANKS, JR., '29<br />\nRALPH KIRKLEY, '28<br />\n(Lexington at Liberty Si..)<br />\nPHILIP W. NESS, '29<br />\nof a jeweler's window in Paris and sister, for such they seemed to be,<br />\ntwo French broads_ stopped to talk turned a face white with rage first<br />\nJunior Editors<br />\nA. H. FETTING<br />\nRICHARD H. WOOD,'29<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nus. Presently the taller one toward me and then toward her<br />\nto<br />\nW. PURNELL HALL, JR., '30<br />\nA. BERNARD CHANCELLOR, JR., '28<br />\nMANUFACTURING JEWELRY<br />\n'Won't<br />\nROBERT<br />\nSKUTCH,<br />\nF.<br />\nsaid:<br />\n'30<br />\nand<br />\nTubby<br />\nto<br />\nturned<br />\ncompanion, and without further<br />\nLEONARD B. NOLLEY,'29<br />\nCO.<br />\nWILMER H. DRIVER, '29<br />\nAARON GOLDSTEIN, '29<br />\nyou buy us some jewelry?\"Got any warning seemed about to hurl the<br />\nGEORGE GUMP, '30<br />\nManufacturers<br />\nmoney?' he countered. In a couple latter into the chasm which lay beGREEK LETTER FRATERNITY<br />\nBUSINESS DEPARTMENT<br />\nJEWELRY<br />\nof minutes they drifted on.<br />\ntween us.<br />\nBusiness Manager<br />\nSTREET<br />\nLIBERTY<br />\nN.<br />\n213<br />\n\"There was only one occasion \"I waited not a second, but stepSAMUEL M. HECHT,'29<br />\nwhen I really_needed French badly. ping quickly back, reached the other<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nTubby and I were walking along bank with a terrific running leap.<br />\nGEORGE M. GLAZIER, '29<br />\nZANVYL KRIEGER, '28<br />\nthe Avenue Trocadero one day The struggle was now two to one,<br />\nsuddenly, while we were look- and presently the ugly one was<br />\nwhen<br />\nAssistant Business Managers<br />\nThe NORMAN-REMINGTON CO.<br />\nJOHN YOUNG,'30<br />\nDONALD C. WEILLER,'28<br />\ning across the street at a couple of forced nearer and nearer the bank.<br />\nSTORE,347 N.CHARLES ST.<br />\nMAIN<br />\n'29<br />\n;<br />\nSCHLOSS,<br />\nJR.<br />\nHARRY 0.<br />\nA. H. MORTON,'30<br />\nthe Parisian taxi drivers who were Clawing and catching at us with her Branch Bargain, 1217 N. Charles St<br />\nPHILIP COWLES,'30<br />\nW. GRAHAM BOYCE, JR., '30<br />\nROBERT NITERS. 29<br />\nJOHN LOTZ, '30<br />\narguing about a collision they had talon-like hands, she suddenly lost<br />\nALvIN BLum, '30<br />\nWILLIAM RAFFEL,'30<br />\njust suffered, I stepped off into her foothold and fell out of sight—<br />\nPHOTOGRAPHIC DEPARTMENT<br />\nspace and droppel through a man- down, down, down.<br />\nTHE LITTLE FLOWER SHOP<br />\nManaging Editor<br />\nPhotography Director<br />\nhole to the dirt some twelve feet \"Without a word the younger<br />\n2438 St. Paul St., near 25th St.<br />\n'29<br />\nBANKS,<br />\nWILLIAM B.<br />\nVERNON SCHEIDT, '28<br />\nbelow, I looked and Tubby looked, sister led me along the passage in<br />\nfor all otcaoion%<br />\niftotuersi<br />\nbut we were unable to find any the oppostie direction from the fearStaff Photographers<br />\nOrders promptly delivered<br />\nGEORGE R. HILL, '29<br />\nWILLIAM S. PIKE,'29<br />\nmeans of pulling me out. The pas- ful river. The light now became<br />\na trial Telephone—HOmewood 2577<br />\nsage in which I had landed extended vastly brighter, and we emerged Give us<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md. as far as I could see in the dim<br />\ninto a brilliantly lit hall, to be<br />\nlight in two directions; the two greeted by an appalling sight. At<br />\nAdvance Showing of<br />\nsides were too far back from the the far end of the room sat a giTHEIRHODES SCHOLARSHIP SELECTION<br />\nmanhole for me to try to clamber up gantic black—but what an apparireach it. There was no object tion! Beneath a flowing yellow wig<br />\nand<br />\nThe selection of Larkin Hundley Farinholt, a member of the<br />\n---for FALL<br />\nby means of which I could of human hair two coal-black eyes<br />\nsight<br />\nin<br />\nmuch<br />\nclass of 1927, as Rhodes Scholar for 1928 is an occasion for<br />\nget to the top of the manhole.<br />\nflashed at us; but even at that dispride and gratification on the part of the entire Johns Hopkins<br />\n\"'I'll get help,' said Tubby.'<br />\ntance, that which fascinated us with $29'5° & $34.50<br />\nUniversity, and particularly on, the part of the undergraduate<br />\n\"He was no sooner out of sight a frightful horror was the fact that For the new seadepartment. Not only is he the first Hopkins man to have been<br />\naccorded this honor in several years, but he is a product of a<br />\nthan suddenly the aperture through the creature's nose and lips had son we have asgenerally maligned and slighted undergraduate school. We can<br />\nthe light had been coming was en- been completely removed and only a sembled the finest<br />\nvariety of men's<br />\nfeel justly proud of his achievement.<br />\ntirely closed. I was left in .utter hideous red cavity remained.<br />\nsuits it has ever<br />\ndarkness; not quite complete black- \"My terrified shriek broke the been our privilege<br />\nThat Farinholt—\"Monk,\" we should like to call him—embodies<br />\nness, however, for as my eyes be- spell. We fled, and soon found our- to present. Styles<br />\nin his make-up the characteristics which Cecil Rhodes believed<br />\nfounded on carecame accustomed to the gloom I selves once more at the yawning ful study of the<br />\nwere most admirable in a young man can best be illustrated by<br />\ndown<br />\nfar<br />\ndiscerned a distant light<br />\na quotation from Mr. Rhodes' will:<br />\nchasm. My companion drew closer fashion trend as<br />\nindicated by the<br />\nthe passage in which I stood.<br />\n\"My desire being that the students who shall be elected to the<br />\nto me and said softly:<br />\nbest dressed men<br />\nthe<br />\nin<br />\nthat<br />\ndirect<br />\nI<br />\nmerely<br />\nbookworms,<br />\nscholarships shall not be<br />\n\"Slowly, with infinite care, I \"Tis-mois que tu m'aime:<br />\nof this country<br />\nelection of a student to a scholarship regard shall be had to (a)<br />\nmade my way toward the ever- \"I did not understand;'she said and Europe.These<br />\npatterns will be<br />\nhis literary and scholastic attainments; (b) his fondness for and<br />\ngrowing light; I was still perhaps a more loudly<br />\noffered for your<br />\nsuccess in manly outdoor sports, such as cricket, football and the<br />\nhundred yards from it when it went \"Tis-mois que tu<br />\napproval as well<br />\nas a complete line<br />\nlike; (c) his qualities of manhood, truth, courage, devotion to<br />\nout with a loud bang and I was again<br />\nI failed to make head or of topcoats, over\"Still<br />\nunselfkindliness,<br />\nweak,<br />\nof<br />\nthe<br />\nprotection<br />\nduty, sympathy for and<br />\neft in complete darkness. Once more<br />\ntail of what she wanted. This time coats, and our<br />\nishness and fellowship; and (d) his exhibiiton during school days<br />\nspecially<br />\npriced<br />\nI discerned a dim light in the disshe almost shouted:<br />\ntuxedo at $34.50.<br />\nof moral force of character and of instincts to lead and to take an<br />\ntance, many yards beyond the point<br />\ninterest in his schoolmates, for those latter attributes will be likely<br />\nwhere I had observed the first; I \"Tis-mois que tu<br />\nAT 22 S. HOWARD ST.<br />\nin after life to guide him to esteem the performances of public<br />\ngroped towards it. As I neared the \"I shook my head. She suddenly<br />\nlamp a loud, rushing sound became became furious and, before I could<br />\nduty as his highest aim.\"<br />\n\"Justly<br />\nTo say that we believe Larkin Farinholt to be truly representamore and more distinct. Presently, resist, shoved me over the bank of \"Nationally<br />\nFamous\"<br />\nin the ghostly light of the passage- the chasm—down, down, down.<br />\ntive of the spirit which pervades Mr. Rhodes' statement is the<br />\nKnown'<br />\nhighest tribute we can pay.<br />\nway, I became aware of a steep \"I sat up and rubbed my side.<br />\nprecipice directly ahead, beneath the Damn, but they make those French<br />\nBaltimore<br />\nlamp itself. I shuddered; in the beds high!\"<br />\n<br />\nSubscription<br />\n<br />\n75.<br />\n<br />\nBOOKS<br />\n<br />\nRitet5on<br />\n<br />\nCiothe#<br />\n<br />\nWHAT PRICE TRADITION?<br />\nA few weeks ago it chanc0 to be our lot to fall in for a few<br />\nminutes with a University of Maryland student. The College<br />\nParker was, of course, very enthusiastic about Maryland. He<br />\ndiscussed the events that had led to his enrolling at Maryland,<br />\nsaying, in part:<br />\n\"My father went down. to the University with me to look the<br />\nplace over; wherever we went we were greeted by the students.<br />\nMy father turned to me and said: 'This is a mighty fine place.<br />\nWhen I was at college the boys never spoke to anybody but their<br />\nfriends.' That was, perhaps, my main reason for deciding to go<br />\nto U. of M.\"<br />\nOne of the oldest traditions at Hopkins is that of saying \"Hello\"<br />\nto all persons met on the campus. In view of the small amount<br />\nof dormitory life here, the preservation of the tradition is rendered more.difficult. If we are to cultivate a real Hopkins spirit,<br />\nit is up to every one of us to speak to friend and stranger alike.<br />\nDuring the past year failure to speak to other men passed on the<br />\ncampus has been increasingly glaring. Are we too lazy or too<br />\nsnobbish to speak to those we don't know?<br />\nLet's say \"Hello!\"<br />\nThe NEWS-LETTER regrets to announce the resignation<br />\nGeorge S. Hill as assistant photographer.<br />\n<br />\nof<br />\n<br />\nFIRST DORMITORY DANCE OF YEAR<br />\nCALLED GREAT SUCCESS BY RESIDENTS<br />\nThe first dormitory dance of the<br />\nyear was both a social and financial<br />\nsuccess. The entertainment committee wishes to thank the residents<br />\nfor their noble support. The committee is encouraged and promises<br />\nbigger and better dances in the<br />\nfuture. The music was furnished<br />\nby the Simpson-Morris orchestra<br />\nand was excellent.<br />\nThe stag line was. Impregnable.<br />\nA whole fleet of them invaded the<br />\ndance following the Musical Club<br />\nconcert. A fellow was unable to<br />\nproceed farther than the first few<br />\nphrases of his line before he was<br />\nattacked.<br />\nSeveral• graduate students suggested that the dance would attract<br />\nmore if it were possible to heat the<br />\n<br />\nTYPEWRITERS<br />\n<br />\nWe are Agents for the<br />\nstone wall of the courtyard. Perhaps this would be a good idea, conCORONA, ROYAL,<br />\nsidering that the dining room was<br />\nnot open.<br />\nUNDERWOOD & REMINGTON<br />\nThe yellow tags which designated,<br />\nthat a resident or his friend had<br />\nPORTABLES<br />\nbeen caught at the door gave one<br />\n7-40*<br />\n006'`L<br />\nthe appearance of a tea ball. As<br />\nusual, several residents thought that<br />\nWe can furnish them in the<br />\nthey would study last Friday eveCIIEMICAL, ENGINEERING<br />\nning, but spent the major portion<br />\nof the evening with their noses or any other keyboard you may desire.<br />\nagainst the Commons Room window. The entertainment committee<br />\nCall or Phone us.<br />\nis considering the possibility of<br />\nmaking a charge of five cents a<br />\nM. W. LUCY & CO.<br />\nwindow dance.<br />\nThe simplicity of the decorations Calvert 5902<br />\n104 W. Fayette St'<br />\nwas an outstanding feature. Red<br />\n\"30 Years in the Business\"<br />\nand green trimmings were used to<br />\nforce the Christmas season a bit.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n<br />\nCOLLEGIATE ATHLETIC<br />\nCONFERENCE HELD<br />\n<br />\nUnder a new ruling of the Ox- Dr. Van Orman Delegate in Place<br />\nford-Cambridge athletic conference,<br />\nof Dr. Abercrombie<br />\nit seems very probable that Rhodes<br />\n.Ycholars will be barred from particiPation in athletics at Oxford. The<br />\nThe sixth annual meeting of the<br />\nrule forbids any student who is over Middle Atlantic States Collegiate<br />\ntwenty-three years of age from tak- Athletic Conference was held last<br />\ning part in certain athletic activities. Saturday, December 10, in Philadel.dt present the ban includes only phia, at the Hotel Adelphia, 13th<br />\ntrack competition, but it is the gen- and Chestnut Streets. The openeral opinion that all athletics will ing meeting of the conference beSOon be included.<br />\ngan at ten o'clock. At one o'clock,<br />\n* * * * *<br />\nluncheon was served to the deleA recent survey compiled by the gates and visitors. A round table<br />\ndirector of statistics at Rochester discussion concerning athletic probCollege exhibits a rather unfavor- lems of individual colleges followed.<br />\nable view by the alumni on par- Representatives from Delaware,<br />\nticipation in student activities. Gettysburg, Johns Hopkins, Lehigh,<br />\nThese statistics found the sentiment Princeton and Stevens gave short<br />\namong that group in direct opposi- talks on current athletic problems.<br />\nDr. Ray Van Orman was the<br />\ntion to extra-curricular activities<br />\nHopkins<br />\nrepresentative. Dr. Aberand they also believed'that the excrombie,<br />\nformer representative, has<br />\nperience thus derived is the least<br />\nforced<br />\nto resign. Nothing of<br />\nbeen<br />\nvalued of their collegiate career.<br />\nexceptional significance was dis* * * * *<br />\ncussed; the plan being to attempt<br />\n\"Pussyfoot\" Johnson, famous<br />\nto alleviate certain difficulties which<br />\n(Perhaps infamous) for his allegi- experience has brought out among<br />\nance to the ranks of the drys, has<br />\nthe various colleges.<br />\ncomae to the fore As a defender of<br />\nHathaway Speaks<br />\nthe much abused morality of the<br />\ncollege student. Mr. Johnson has The opening address of the mornfaith in the younger generation, be- ing session was made by the presilieving that for the few college men dent, Professor Henry C. Hatha7vho are immoral there is no men- way, of New York University. Mr.<br />\ntion of<br />\nthe many thousands of men Hathaway was the former chairman<br />\n'4'ha are not in this class. He light- of their Athletic Council. The preslY dismisses the discovery of a still ident gave a short resume of the<br />\nin an Iowa State university's fra- activities of the conference during<br />\n4itY house as insignificant when the last year, before suggesting a<br />\nei°mPared to the hundreds of col- positive program of action which is<br />\nleges and universities in the coun- immediately possible.<br />\nThe second and third speakers<br />\ntry that have no stills.<br />\nwere representatives of the Central<br />\n* * *<br />\n*<br />\nPennsylvania Conference and the<br />\nThe ban on smoking at Bryn Middle Atlantic States Collegiate<br />\nMawr College has at last been abroAthletic Association, respectively.<br />\ngated and one room in every dormiSchedules Considered<br />\ntory has been set aside at the disFollowing the conference the<br />\nPosal of those young ladies who desire to indulge in this recreation. game committee held a meeting for<br />\nThis action was taken by the Stu- the consideration of schedules in<br />\ndent Government in response to a certain sports.<br />\nThe Middle Atlantic States ColPetition of the student body. Only<br />\nper cent of the student body ac- legiate Athletic Conference sponknowledged the use of the filthy sors both a basketball and • tennis<br />\nassociation and is affiliated with the<br />\nweed.<br />\nMiddle Atlantic States Collegiate<br />\n* * * * *<br />\nAssociation. The conferAthletic<br />\n.The Yale News, student publication at Yale, has recently issued a ence includes the following colleges<br />\nscathing<br />\nand universities: Bucknell, Columdenunciation of college frate<br />\nrnities. They are definitely termed bia, Delaware, Drexel, Franklin and<br />\nMarshall, Gettysburg, Haverford,<br />\ndestructive<br />\ninfluences and are acJohns<br />\nHopkins, Juniata, Lebanon,<br />\ncused of overshadowing college itself.<br />\nLehigh, Muhlenberg, New York<br />\nUniversity, University of Pennsyl* * * * *<br />\nvania, Princeton, Rutgers, Stevens,<br />\nDerbies have been adopted by<br />\nSwarthmore<br />\nand Lafayette. Beembers of the sophomore class at<br />\ntl?e University of Arizona as a defi- sides official represntatives from the<br />\nabove schools, there were a number<br />\nnite mark of class distinction. We<br />\nvisiting delegates.<br />\nof<br />\n\".ere really not aware that it is so<br />\n\"Ifficult to distinguish a sophomore.<br />\n* * * * *<br />\nRobinson To Coach<br />\n.Fraternity men at Cornell UniverCity College Twelve<br />\n4itY spent an average of $21.38 more<br />\nAccepting<br />\na proposal of the athP,er man during last year than did<br />\nletic<br />\nof the Baltimore<br />\nauthorities<br />\ntne non-fraternity men who resided<br />\nc:Ldortnitories or boarding houses. City College, Norman Robinson,<br />\ncaptain of Hopkins' championdoubt whether siMilar results the<br />\ntu°uld be obtained if such a survey ship lacrosse team of last year, will<br />\ncoach that school's twelve.<br />\n7'as to be conducted at Hopkins.<br />\nAccording to Robinson, the pros* *<br />\n* *<br />\npects of his team for the coming<br />\nrIn the colleges and universities year are unusually bright, as eight<br />\nRussia, or rather what is now or ten regulars from last year's<br />\nteft of them, over seventy-five squad are 'back<br />\n,<br />\nand about sixtj.<br />\neli°11sand students are enrolled in candidates<br />\nhave turned out for the<br />\n°111Pulsofy military training as pre- positions.<br />\ns<br />\nby the government. ApCity College has its usually hard<br />\nDr°xlmately 180 hours per year is schedule, however, so the collegians<br />\nSpent in<br />\nsuch a manner by these have already been ordered out for<br />\nunfortunates.<br />\nfall workouts. These workouts are<br />\n* * * * *<br />\nbeing held temporarily in the yard<br />\nc,4 furor has been created at the of the school, but efforts are being<br />\nMateo College, California, made to secure either Herring Run<br />\nere the editor of the student pub- Park or the lower field at Hopkins<br />\ncliccition, after first stating that for spring practice.<br />\n:<br />\ninking and other infractions of<br />\nThe Howard Street school has<br />\nn'aining rules are not conducive to not been victorious over its chief<br />\niLgood football team, then accused rival, Poly, for several years, and<br />\nfootball team of his alma mater the new coach hopes to change this<br />\n°<br />\n0.1 doing that very thing. A thor- condition. According to Robinson,<br />\nLugh investigation is being made his position as coach will last only<br />\nvefore definite action will be taken. for this year.<br />\n<br />\nBUSINESS COURSES<br />\nOF<br />\n<br />\nCOLLEGE GRADE<br />\nSend for a Catalog<br />\nBREWBAKER COLLEGE<br />\nPARK AVENUE AND FRANKLIN STREET<br />\n<br />\nThe City of Happiness Is in the State of Mind<br />\nSee FORDYCE CAMPBELL - AETNAIZER<br />\n9th Floor Citizens Nat'l Bank Bldg. Plaza 1062<br />\nLIFE - ACCIDENT - HEALTH - AUTO - LIABILITY -<br />\n<br />\nFIRE<br />\n<br />\nThe<br />\nCream<br />\n• of the<br />\nTobacco<br />\nCrop<br />\n<br />\nYou, too, will find that LUCKY<br />\nSTRIKES give the greatest pleasure<br />\nMild and Mellow, the finest cigarettes<br />\nyou ever smoked. Made of the choicest<br />\ntobaccos, properly aged and blended with<br />\ngreat skill, and there is an extra process<br />\n\"IT'S TOASTED\" no harshness, not<br />\na bit of bite.<br />\n<br />\nMARY EATON<br />\nPopular Musical Comedy Star,<br />\nwrites:<br />\n<br />\nseems that most all the<br />\nmembers of the'Lucky'Company smoke Lucky Strike<br />\ncigarettes, and once I was<br />\ntempted to try one, and I am<br />\nglad to say I have enjoyed<br />\nthem ever since. I am very<br />\nhappy to say my throat has<br />\nbeen in perfect condition all<br />\nseason. Lucky Strike is the<br />\nonly cigarette for me.\"<br />\n<br />\n\"It<br />\n<br />\nTYLvtii<br />\n<br />\n*9<br />\n<br />\nIt's toasted<br />\n<br />\nNo Throat Irritation<br />\nNo Cough.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br />\n<br />\n4<br />\n<br />\nTHE MAIL BAG<br />\nAll letters intended for publication must be concise, written<br />\nin ink, on one side of the paper<br />\nonly.<br />\nNo attention will be paid to<br />\nanonymous letters, but names<br />\nsigned as an evidence of good<br />\nfaith will not be printed if request is made that they be omitted.<br />\nThe publication of a letter is<br />\nnot to be taken as an endorsement of its views by \"The NewsLetter\" which invites the freest<br />\ndiscussion of all matters of general interest.<br />\n<br />\n\"PROFS\" FLAYED<br />\n<br />\ntory I and \"Wop,\" known in the<br />\ncatalogue as Italian I. Now this<br />\nyear those grinning, fiendish, diabolical souls who direct our courses<br />\nhave lain traps for the unsuspecting<br />\nstudent who, busy with other work,<br />\nsigns up for one of these courses<br />\nfor an easy six •points. I believe<br />\nthat we are the victims of a deep<br />\nand well-laid plot that has reached<br />\nits culmination after years of preparatory effort. These courses have<br />\nbeen easy in the past merely to lure<br />\nus on for this great coup d'etat of<br />\nthose who write grades in red ink.<br />\nAlas and alack they have succeeded<br />\nso completely that Italian I and<br />\nHistory I now hold their own with<br />\nthat demon, Physics. What is our<br />\nUniversity coming to? One more<br />\nold tradition gone the way of all<br />\nflesh.<br />\nSOCRATES (Himself).<br />\n<br />\nFootball Banquet<br />\nTomorrow Night<br />\nDance at Civil Engineering Hall to<br />\nFollow Grid Dinner at<br />\nSouthern<br />\n<br />\nau Jo gei More<br />\nMileage fro<br />\n<br />\nMembers of the football team will<br />\ngather at the Southern Hotel tomorrow evening at seven o'clock for<br />\ntheir annual banquet. For the first<br />\ntime in the history of the football<br />\ndinners, alumni have been invited<br />\nto attend. . Iii former years the banquet has been closed to members of<br />\nthe team and representatives of the<br />\nlocal newspapers. About a hundred<br />\nand twenty-five persons are expected to attend tomorrow, according<br />\nto Manager Bauernschmidt.<br />\nA number of prep school stars<br />\nhave also been invited, including<br />\nBuck Miller, Helm, Goldberg of<br />\nCity College; Morrison of Forest<br />\nPark and McCullough of Poly.<br />\n\"Pop\" Swindell will officiate as<br />\ntoastmaster and Coach Van Orman<br />\nwill be the principal speaker. All<br />\nlettermen will be awarded miniature gold footballs. Following the<br />\nbanquet, there will be a dance from<br />\nten to one. Attendance will be<br />\nlimited by cards of invitation. Each<br />\nmember of the team has been given<br />\nthree invitations to distribute among.<br />\nfriends. These cards, when presented with a dollar, will admit<br />\nthe bearers to the dance.<br />\n<br />\nTo the Editor of the NEWS-LETTER:<br />\nDear Sir:<br />\nSkill in teaching is an attribute<br />\nto be admired greatly in a man who<br />\nattempts to increase the knowledge<br />\nof others. Recently there has been<br />\na great deal of discussion among<br />\ndissatisfied undergraduates about<br />\nthe lack of efficiency exhibited by<br />\nFRESH AIR PLEASE!<br />\nthe instructors. The professors are<br />\nthis<br />\nfrom<br />\nless<br />\nattacked but slightly<br />\nTo the Editor of the NEWS-LETTER:<br />\nviewpoint. Although most of the<br />\nDear Sir:<br />\ncomplaints are made by the more<br />\nOutdoors, all of Aeolus' unor less poor students, those lacking<br />\nwinds are fitfully bustling<br />\nthe desire and initiative to become chained<br />\nJack Frost has entered<br />\nand<br />\naround<br />\nreal scholars, these complaints do<br />\nhere I am, doomed to<br />\nbut<br />\nlists,<br />\nthe<br />\nseem well founded. It also seems<br />\nin an inferno, our<br />\nsuffocate<br />\nand<br />\nsit<br />\nthat these complaints relate directly<br />\nBooks to<br />\nlibrary.<br />\nhallowed<br />\nown<br />\nto methods of teaching, more than<br />\nthe left<br />\nto<br />\nbooks<br />\nright of one,<br />\nto any degree of knowledge pos- the<br />\nis<br />\nback—it<br />\nin<br />\nand<br />\nfront<br />\nin<br />\none,<br />\nsessed by the instructors or pro- of<br />\nnot<br />\nwere<br />\nshelves<br />\nthat<br />\npeculiar<br />\nreally<br />\nfessors. A man may know almost<br />\nthe spaces left open for<br />\nnothing, and yet be able to guide built in<br />\nause they are never<br />\nwindows—bec<br />\nothers in their endeavors in the<br />\nanyhow. The windows are<br />\nrealms of the erudite. The abso- used<br />\nthe air is stifling and<br />\ntight,<br />\nlute prerequisite for a pedagogue is shut<br />\nwith odors of old<br />\narged<br />\nsuper-ch<br />\nskill in teaching. From this viewmixed with a confeet,<br />\nand<br />\nbooks<br />\npoint some professors are worse<br />\nd'Or, Coty's,<br />\nFleur<br />\nof<br />\nglomerate<br />\nthan the graduate instructors. Disand<br />\nNarcissus<br />\nBlack<br />\nd'Arntour,<br />\nIle<br />\nregarding this, however, let us inI<br />\nNoxema.<br />\nor<br />\ncream<br />\ncold<br />\nvestigate the obvious defects and either<br />\nsenses<br />\nmy<br />\nolfactory<br />\nget<br />\ncan't<br />\njust<br />\nfallacies of the graduate aspirants.<br />\nbetween them.<br />\nFirst, they attempt a dignified air to distinguish<br />\nas hell—and<br />\nhere—hot<br />\nin<br />\nhot<br />\nIt's<br />\nwhich does not fit well, nor blend<br />\npresides<br />\nwho<br />\nVestal,<br />\nstern-faced<br />\nthe<br />\nwith their immature appearance.<br />\nfire of<br />\neternal<br />\nthe<br />\nfor<br />\nfuel<br />\nthe<br />\nover<br />\nunjustifiable,<br />\nThis in itself is not so<br />\nanything<br />\ndo<br />\nbut it leads to a supercilious superi- knowledge, doesn't<br />\nority complex which is most unbe- about it—and I always was under<br />\ncoming. Evidence the instructors' the impression that the female of<br />\nemotions upon being called \"doc- the species could bear cold so much<br />\ntor!\" Moreover, these controllers ;better than the male—damn the<br />\nof our destinies are entirely too psychologists—I'll have to report it<br />\nconscientious and strict. Interest, to Doc Mitchell. But, ah, I see a<br />\ngeneral intelligence and adaptability light—the same Vestal of the halare never graded by them; they lowed place is sure that drowsiness<br />\njudge the undergraduates solely leads to order—one cannot talk,<br />\nupon the correctness of minute &- that is, in disturbing tones, in a<br />\ntails. And lastly, the instructors lethargy.<br />\nTaking my eyes off a very intergenerally seem to feel that their<br />\nparticular course should usurp the estingly inane biography of Keats,<br />\ngreater part of the student's time. I gaze around at my other colThey fail to realize that students leagues in misery. Some with their<br />\ndesiring merely a general broaden- heads pillowed in their arms on the<br />\ning knowledge of a subject are often table, no doubt dreaming of Arctic<br />\nneglectful, and never expend the _snows and exhilarating winds; some<br />\nsame amount of energy on these reading the same page over and<br />\ncourses as they do on their \"major.\" over again; some gazing into blank<br />\nStudents cannot be expected to ma- space—why, really, it's so hot in<br />\njor in everything, nor to inquire too here that even our sense of percepdeeply into the details of all their tion, in regard to the sometimes<br />\ndainty—er—well, to be gross—legs<br />\nsubjects.<br />\nme<br />\nlet<br />\nof the so-called fair co-eds, is dulled.<br />\nhowever,<br />\nIn concluding,<br />\nmake a few qualifications. This is Alack, alas, let us have air! I can<br />\nintended mainly for constructive appreciate the damnable sufferings<br />\ncriticism. It is not a condemnation of the victims of the Black Hole of<br />\nof graduate instructors as a whole, Calcutta.<br />\neither, for the writer is in contact<br />\nI wonder if it is any cooler in the<br />\nwith several that he deems efficient holy of holies, the stacks! The<br />\nand interesting. It merely attempts sweetheart, the young lady of the<br />\nto point out the cause of the com- dark blue smock, seems to look<br />\nplaints so much in evidence on the very much refreshed after a visit<br />\ncampus recently.<br />\ninto the same. But, then, why think<br />\nANONYMOUS.<br />\nof this—we poor damned souls are<br />\nnot permitted to help contaminate<br />\nthe atmosphere therein.<br />\nTHE TRUTH IS STRANGER<br />\nI believe the only solution to the<br />\nTo the Editor of the NEWS-LETTER: question would be to have our dear<br />\nfriend Doc Swartz take charge of<br />\nDear Sir:<br />\nTreason, viciousness and criminal the library and its ventilation.<br />\nlack of consideration have been Please help us out, Doc!<br />\nStagnation is the word I've been<br />\nperpetrated on the innocent student<br />\nbody by those reverend and, until looking for—stagnation, the height<br />\nnow, revered pedagogues who con- of service and air in our library and<br />\n—oh, here conies our other little<br />\nstitue our faculty.<br />\nUntil this year there halre been sweetheart, of the pea-green smock,<br />\ncertain courses offered at Johns from the stacks, she, also, looks reHopkins which have been known freshed—the atmosphere therein<br />\nfrom ancient times as \"snaps.\" surely must be more conducive to<br />\nNotable among these have been His(Continued on page 5, column 3.)<br />\n<br />\nWhere \"good enough\" isn't<br />\nThe basketball team that is never satisfied with<br />\nits performance is headed for the top. And in<br />\nthis, as in the making of telephone apparatus,<br />\nsuccess follows from the determination of every<br />\nman to cover his position and work in harmony<br />\nwith his team mates.<br />\nAt Western Electric, a continually widening<br />\nrange of activities is being undertaken—for example, investigating raw materials, designing<br />\nmore efficient machinery, developing new plans<br />\nfor manufacture,studying operating methods and<br />\npersonnel relations—any one of which offers the<br />\nindividual an interesting field.<br />\nBut whatever the work, his place in it and his<br />\ncontribution to its success depend upon his acceptance of this Western Electric idea: to improve<br />\nthe machinery of production to a point where<br />\nit more closely approaches perfection.<br />\n<br />\nrn Electric<br />\nSINCE 1882 MANUFACTURERS FOR<br />\n<br />\nTHE BELL SYSTEM<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER,.DECEMBER 13, 1927<br />\n<br />\nWitness<br />\nFIVE MEN TAKEN Gas Engineers<br />\nShowing of Slides<br />\nINTO TAU BETA PI<br />\nWerner, Schmiedicke„ Bruening<br />\nLang, and Russell Initiated<br />\nDEAN WHITEHEAD SPEAKS<br />\n<br />\n•<br />\nEngineering Head Lectures at Assembly on French Colleges<br />\n•Gustave Werner, Jr., Ferdinand<br />\nSchmiedicke, John Bruening, Robert Lang and William Russell were<br />\nPublicly initiated into Tau Beta Pi,<br />\nat last Thursday's Assembly. Dean<br />\nWhitehead of the Engineering<br />\nSchool delivered the address, while<br />\n-r --thelatte-r-part-of-the assembly was<br />\ndevoted to a matter somewhat foreign to the former, namely, basketball.<br />\n<br />\nI<br />\n<br />\nLoane Takes Charge<br />\n<br />\nEdward S. Loane, president of<br />\n'Ian Beta Pi, opened the assembly<br />\nWith a brief talk on the selection of<br />\nmen to be honored by membership<br />\nin the fraternity. Although excellent scholarship is a necessary requirement other qualifications are<br />\nconsidered. Chief among these are<br />\nintegrity and interest in affairs affecting both engineering and other<br />\nfields. The secretary read out the<br />\nnames of the elected men. From<br />\nthe senior class were elected two<br />\nCivil Engineering students, one Mechanical and one Electrical; while<br />\nfrom the junior class, one Chemical.<br />\n<br />\nInteresting slides showing the<br />\nmodern trend of automatic clinking machines were shown at a meeting of the Gas Engineering Association. The lecture was attended by<br />\nquite a large number, incruding Dr.<br />\nHuff of the Engineering School.<br />\nMr. Kuns of the Western Gas<br />\nCo. presented the slides and described the new methods. The devices have been tried out at the<br />\nSpring Garden Plant of the Consolidated Gas, Electric Light and<br />\nPower Co., the new machines being<br />\ninstalled by the Western Gas Construction Co.<br />\nThe slides included many pictures<br />\nof the old and archaic means of<br />\nremoving clinkers from the old type<br />\ngas manufacturing furnaces. The<br />\nnew contrivances, by means of<br />\nwhich ash is automatically removed,<br />\nare very ingenious.<br />\n<br />\nDr. Greenlaw to<br />\nAddress Club<br />\nProfessor Edwin Greenlaw will<br />\naddress the History of Ideas Club at<br />\na meeting to be held Thursday evening at 8 o'clock.<br />\nThe subject of Dr. Greenlaw's<br />\ntalk will be \"The Sixteenth Century<br />\nBattle of the Book.\" Members of<br />\nthe faculty and graduate students<br />\nare cordially invited to attend this<br />\nmeeting.<br />\n<br />\nMUSICAL CLUBS GIVE<br />\nSECOND CONCERT<br />\n<br />\nGlee Club, Banjo Club, and Blue<br />\nJays Well Received<br />\nIn the course of his short talk,<br />\nur. Whitehead took his listeners<br />\nthrough the ten universities which The combined Musical Clubs gave<br />\nhe visited while serving as Ex- their second concert of the season<br />\nchange Professor to France. The at the Guilford Community Church<br />\ngreat difference that one notices in House last Friday evening before a<br />\nFrench universities, according to small but appreciative audience.<br />\nthe Dean, is the absence of student<br />\nThe Glee .Club, having profited<br />\nlife. He said that there is almost greatly by their first concert, showed<br />\na total absence of life, for one sel- the results of hard work during the<br />\ndom sees students about the build- past week. Their program consisted<br />\nings. This is probably due to the of a pleasing mixture of the light<br />\ntwo year courses, and also to the and heavy selections adaptable to<br />\nlack of a campus, for he said all an organization of this sort.<br />\nFrench universities are situated in<br />\nA marked improvement must be<br />\nthe heart of cities. There are no noticed in the work of the Banjo<br />\ndormitories, although at present the Club, which is under the direction<br />\nUniversity of Paris is considering, of Conrad Gebelein. This club, altrying this plan by erecting quar- ways received as one of the most<br />\nters for foreign students on the out- popular, fulfilled its part in providskirts of the city.<br />\ning the evening's entertainment.<br />\nCarl Lausch made his reputation<br />\nFrench Serious<br />\nas a piano player of no mean ability<br />\n\"There is no doubt that the more widespread. As usual, his<br />\nFrench take their education more solo numbers were well selected<br />\nseriously than we do,\" said the and, if applause is an indication of<br />\nbean. At one university the last approval, the audience was more<br />\nthree weeks of the year were taken than satisfied. Osmar P. Steinwald<br />\nup with oral examinations. The also gave two excellent solo numbean said he attended several of bers, the first, \"Cazonetta,\" being<br />\nthese and found the ease with which particularly worthy of mention.<br />\nthe students talked on their subAgain, Benny Boynton of footjects was quite remarkable. There ball fame was the cause of a conhas been a great deal of comment tinuous laugh from his entrance to<br />\non the antagonistic attitude of the his exit. His sketch, \"An Impres,rench due to the war debt, but sion of an East Side Girl in a<br />\nur• Whitehead disagrees with this Theater;\" went over big, to say the<br />\nview. \"I want to take this oppor- least.<br />\n.ttinity to publicly deny it,\" he said, Of course, the Blue Jays were<br />\nin referring to this attitude of the well received. Their selections,<br />\nPrench. \"At all times during my played in the usual Blue Jay style,<br />\n°Ile year's stay in France I was must have worked on their dimintreated with the greatest courtesy.\" utive drummer—that is to say, if<br />\nD - Whitehead<br />\ng<br />\nclosed his talk by gesticulations and movements of a<br />\ng how enthusiastically the syncopated nature can be offered as<br />\nrench received Lindbergh, for he evidence.<br />\nwas in Paris at the time of the<br />\nNaturally enough, the Hawaiian<br />\ninemorable landing.<br />\nTroupe performed their part of the<br />\nprogram with due credit. Their first<br />\nBasketball<br />\nnumber, \"Drowsy Waters,\" eviThe latter part of the assembly dently pleased the listeners very<br />\nWas devoted entirely to basketball, much.<br />\nRopkins newest sport. There were<br />\nTaking everything into considerashort talks by almost everyone. tion, the concert was a good one<br />\nIllandi promised the freshmen and and, with the added degree of persophomores a chance to exerci-se fection that comes with practice, the<br />\ntheir lungs at this week's assembly, clubs will be able to present a profor he announced there would be a gram that will rival those of other<br />\nroll call of the two classes.<br />\nyears.<br />\nFrench Universities<br />\n<br />\nratin<br />\n<br />\nMAIL<br />\n<br />\n5<br />\n<br />\nBAG<br />\n<br />\nDress Sets<br />\n<br />\n(Continued from page 4, column 2.)<br />\n<br />\nstudy (?). Our library is a good<br />\none and, Mother Goose, the guardian angel, is all right in her way—<br />\nbut let's have some air. This infernal heat doesn't allow any kind<br />\nof efficient work.<br />\nYours for more ventilation,<br />\nBosco.<br />\n<br />\nfor dinner coat and<br />\nfull dress affairs. .<br />\nHennegen-Bates Company<br />\nJEWELERS SINCE 1857<br />\n<br />\n7 and 9 EAST BALTIMORE STREET<br />\n<br />\nINANE RAMBLINGS<br />\nTo the Editor of the NEWS-LETTER:<br />\nDear Sir:<br />\nEvery year, someone always rises<br />\nto smite the younger generations, its<br />\nstandards, moral •and spiritual; and<br />\nagain some other person, fired by<br />\ntheir insinuations, steps forth and<br />\ntakes a stand in defense. So much<br />\nfor the cause of this.<br />\nSeveral weeks ago, Stephen Leacock published in one of Baltimore's so-called reflective newspapers an article entitled \"A Cycle<br />\nof Love.\" If the author's purpose<br />\nwas to be funny, then it was a success. If he desired to create an<br />\nimpression other than one as a jokester, then it was a failure.<br />\nJohn M. Smith, the hero of this<br />\nattempt to fill the columns, is described as a modern college boy who<br />\nafter ten years of collegiate work<br />\nor life, had one better say, received<br />\na slip of paper which entitled him<br />\nto become divorced several times,<br />\nand to participate into other devilish practices. While there are John<br />\nM. Smiths, there are also John<br />\nSmiths, and we are to believe that<br />\nthe •college man has thrown all<br />\nstandards to the winds and is following an unwritten code of his<br />\nown.<br />\nThe hero is depicted as a devil<br />\nwho loved 'e mand left 'em—they,<br />\npining for his return—he, looking<br />\nfor other worlds to conquer.<br />\nAbigail Price, the heroine, is described as .one of those souls that<br />\nare true to the end, often referred<br />\nto as being \"all wool and a yard<br />\nwide.\" She just loved to pine and<br />\nthen the cycle begins again.<br />\nHowever, we must admit that the<br />\npresent day youth are hell bent!<br />\nThis business of going to cotillons<br />\nis bad dope, no doubt, and to smoke<br />\na pipe and in continuance of this<br />\nwarning process to wear a raccoon<br />\ncoat is inexcusable.<br />\n\"And don't you know, Nora,<br />\nD'Alti came home with red paint<br />\nin his hair last Saturday.\" Oh!<br />\nmy—what shall we do?<br />\nWell, boys, let's stick together<br />\nand smoke our pipes besides engaging in other sorts of badness and<br />\nremember to be just as determined<br />\nas Hah-vahd is in its Princetonian<br />\nstruggle. Repulse their insinuations<br />\nand, above all, be oh! so determined.<br />\nCAUSTIC CHARLES.<br />\n<br />\nM<br />\n<br />\n0<br />\n<br />\nS<br />\n<br />\nT<br />\n<br />\nConvenient and Economical<br />\nTRANSPORTATION<br />\n<br />\nTHE<br />\n<br />\nSTREET<br />\n<br />\nCARS<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nEsso<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nYOU CAN ACTUALLY FEEL THE DIFFERENCE<br />\n<br />\nSTANDARD OIL COMPANY N. J.<br />\n<br />\nDecorations<br />\n<br />\nInterior Wood Work<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nCLOTHES Ready•made<br />\nAnd Cut to Order<br />\n<br />\nESTABLISHED ENGLISH UNIVERSITY<br />\n• STYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br />\n<br />\nMSC<br />\nSuits *40,*45,*50 Overcoats<br />\n<br />\nBearly<br />\nCamels Hair<br />\nCoat<br />\n$163<br />\n<br />\nBeady<br />\nCamels Hair<br />\nCoat<br />\n$165<br />\n<br />\nPROBLEMS OF BRITIAN<br />\n(Continued from page 1, column 3.)<br />\n<br />\nly bound together than ever before.\"<br />\nThe other part of the Empire is<br />\nthat governed more or less directly<br />\nby the British Parliament. This<br />\ndivision is made up of people who<br />\nare not yet able to meet the measurements of modern civilized government. India with its three hundred and twenty-five million people is one of the great problems of<br />\nthe empire. Immediately after the<br />\nwar it received a greater share of<br />\nself government, but the nationalists, under Gambi, wanted more.<br />\nFor a time there was tension, now<br />\nmuch cleared up. A parliamentary<br />\ncommission has been appointed to<br />\ninvestigate the conditions with the<br />\nidea of allowing India greater freedom. \"India, like many other British colonies, is capable of governing itself, but not of holding its own<br />\nwith the great modern powers.\"<br />\n<br />\nIMMO<br />\n4111111MMINII<br />\n<br />\nBY SPECIAL APPOINTIFIECT<br />\nOUR STORE IS THE<br />\n<br />\n(Charter lif?ouze<br />\nof Baltimore<br />\nThe character of the suits and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nHub<br />\noaltimore. Charles and Fayette<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br />\n<br />\n6<br />\n<br />\nTHE BARNSTORMERS WILL<br />\nDR. WOOD TO ADDRESS EVIDENTLY<br />\nKEEP THEIR MYSTERY PLAY MYSTERIOUS<br />\nDAY<br />\nASSEMBLYITERS<br />\nMystery! Detectives! Melodrama! As a last hope, two star NEWSRenowned Light-Physicist Is Engaged in Research<br />\n\"High Frequency Sound Waves\"<br />\nwill be the subject of Dr. Wood's<br />\naddress to the assembly next Thursday. Dr. Wood, a world renowned<br />\nlight-physicist and authority on ultra-violet and infra-red light, is actively engaged at research here in<br />\nthe physics department. At present he is studying the iodine vapor<br />\nspectrum and has written many<br />\ntreatises of scientific interest on<br />\nthese subjects.<br />\nAttention was first called to high<br />\nfrequency sound waves shortly<br />\nafter the war while experimenting<br />\non devices for the detection of submarines by reflected sound. The<br />\npeculiar effects were noted on fish<br />\nin the experimental tanks, but no<br />\nextensive research was done until<br />\nthe publication of a thesis on this<br />\nwork by Dr. Wood.<br />\nDr. Wood had conducted these<br />\nresearches in the laboratory of Dr.<br />\nAlfred Loomis, his co-worker, in<br />\ntheir laboratory at Tuxedo, New<br />\nYork.<br />\nWorld-Wide Interest<br />\n<br />\nImmediately these experiments<br />\nattracted world-wide interest, because of the unique physical and<br />\nbiological effects of these high frequency, high intensity sound waves.<br />\nDr. Wood will illustrate some of<br />\nthese curious phenomena with<br />\nslides.<br />\nDuring the war Dr. Wood, himself, was employed in an interesting<br />\nresearch. His specialty was the<br />\nadaption of invisible infra-red rays<br />\nfor signalling.<br />\n<br />\nBeautiful heroine! Manly hero!<br />\nWhat? The Barnstormers' play.<br />\n\"Is that all that you will tell about<br />\nyour coming mystery mystery play,<br />\nMr. Warfield?\" the president of the<br />\nBarnstormers was asked.<br />\n\"Absolutely all,\" Warfield answered. \"It is a first-class mystery<br />\nplay, comprising all the elements of<br />\nsuspense, curiosity, comedy and<br />\ndrama. You will have to wait until<br />\nFebruary to find out more about it.\"<br />\nFurther questioning proved absolutely futile. Warfield would tell<br />\nnothing more about the play chosen<br />\nby the Barnstormers.<br />\nDouglas Prahl, business manager<br />\nof the Dramatic Club, was questioned as to the name or even the<br />\nauthor of presentation. He begged<br />\nall questions very cleverly by talking of the business outlook of the<br />\nclub for the coming season. Very<br />\nbright, indeed; but that's not what<br />\ninformation was wanted from him.<br />\nA trip to the Dormitory to question Jerome Nott also proved fruitless. On entering his room he was<br />\nseen to seize a small brown booklet<br />\nand slam his desk drawer closed<br />\nwith amazing alacrity. This was<br />\nsecrecy with a vengeance.<br />\n\"But why all this secrecy and<br />\nmystery, Jerry ?\" our exasperated<br />\nreporter finally asked.<br />\n\"Well, you see it's this way,\"<br />\nNott began, and immediately two<br />\ndisgruntled reporters stalked out of<br />\nthe room and slammed the door.<br />\nBribery, wheedling, trickery,<br />\neverything failed. The Barnstormers were determined. Not even the<br />\ncandidates could be made to speak.<br />\n<br />\nFounded 1815<br />\n<br />\nLETTER reporters were sent all the<br />\nway down to \"Pop\" Swindell's<br />\nBaltimore, Md.<br />\n42 1 North Charles St.<br />\noffice. They were greeted warmly<br />\nby the veteran Barnstormers' coach<br />\nWrist Watches for Men<br />\nand told to be seated. They were<br />\nseated and smokes were offered<br />\nDIAMONDS -:- GOLD JEWELRY<br />\naround.<br />\n-:- SILVERWARE -:\"Pop\" Swindell was an actor.<br />\nThe recent extremely cold spell<br />\nwas discussed. The reporters gave<br />\ntheir opinions and prophecies as to<br />\nA<br />\nPHONES: HOMEWOOD 7806<br />\nmore and why.<br />\nHOMEWOOD 7807<br />\nSTAND<br />\nCAB<br />\nYELLOW<br />\nYes,\"Pop\" Swindell was an actor.<br />\nAT<br />\nPhone Us—We Deliver<br />\nThe great football game on<br />\nThanksgiving, and particularly the<br />\nHOMEWOOD FIELD<br />\nR. M.BIRELY,Phar. D.<br />\nVarsity Club reunion the night bePassengers<br />\nExtra<br />\nfor<br />\nCharge<br />\nNo<br />\nlength.<br />\ngreat<br />\nat<br />\ndiscussed<br />\nfore, were<br />\nPrescription Pharmacist<br />\n'PHONE<br />\nWe say emphatically, \"Pop\"<br />\nCIGARS.<br />\nCANDY SODA<br />\nSwindell is an actor.<br />\nVERNON 1212<br />\nFinally, a clock struck somewhere<br />\nFOR A<br />\nCor. St. Paul and 33rd Sts.<br />\nand the reporters excused themBALTIMORE, MD.<br />\nYELLOW CAB<br />\nselves.<br />\nOutside the door one was heard<br />\nJ. H. FURST CO.<br />\nto remark,\"Why did we come down<br />\nLOUIS SULSKY<br />\nPRINTERS OF<br />\nhere ?\"<br />\nBaltimore's Largest Renting<br />\nHouse<br />\nWhile the other replied, \"I'm<br />\nPhilological and Scientific<br />\nTuxedos, Cutaways and Full Dress<br />\nhanged if I know.\"<br />\nPublications<br />\nSuits to Hire<br />\nEvidently the Barnstormers intend 313 W. FRANKLIN ST. Phone. Vernon 3436 23 S. HANOVER ST. BALTIMORE<br />\nto keep their mystery play a mystery.<br />\n<br />\nfAMOCO-GAs(<br />\n,<br />\n<br />\nBaltimore, Md.<br />\nBox Lunches<br />\n<br />\nfor<br />\n<br />\n•<br />\n•<br />\n<br />\nBy BRIGGS<br />\n<br />\n•<br />\n<br />\nEt/ER'? BARBED VOIkE EENicE•<br />\nN<br />\nAND<br />\n5-RJAA BLES Ti-IROUGH IS<br />\n14E. ..<br />\nMUIR IDG•1;?<br />\nCHAR G a D v1/4./C-r<br />\n<br />\nt--1 -E.. ,<br />\n<br />\nALWAYS 61-115 UP AND 1=2. A\\DS<br />\n-1-hr• OTH IR S \\JUAN.7 (0<br />\n5 -To GET- At*<br />\n.SLE-EF 5o\"<br />\n<br />\neNJ<br />\n<br />\nEARLS'...STARMSAY- BREAK Th\",--1\"<br />\nUN ! DO Yoti WANI-T)<br />\n---....ss<br />\n„...----.-------------------To KILL Vs 7<br />\n1<br />\n/<br />\nFoR Ti-iC- LUVA MtKe<br />\n<br />\n-<br />\n<br />\nAIIII41<br />\n<br />\n\". --....-,-.....„,.<br />\n'<br />\n<br />\n---\\<br />\n<br />\n/<br />\n<br />\n,......,<br />\n<br />\n.----,4---N,--\"/(<br />\ni•<br />\n<br />\n/<br />\n-/II-\\?<br />\n<br />\nI<br />\n<br />\nZ<br />\n...<br />\nIft4r<br />\n<br />\n•c<br />\ni<br />\n<br />\n><br />\n,..<br />\n•<br />\n<br />\n.'<br />\n<br />\n----<br />\n<br />\n..<br />\n<br />\n,<br />\n<br />\nk<br />\n<br />\n`<br />\n<br />\nl'i<br />\nil'iillin(<br />\n<br />\n1<br />\n<br />\n1 •-<br />\n<br />\n//'<br />\n<br />\n---.<br />\n<br />\n.<br />\n<br />\n...„2-. .,<br />\n.<br />\n<br />\n/, /<br />\n'<br />\nk< /<br />\n.,<br />\n. .<br />\n<br />\n'<br />\n<br />\n---..<br />\n<br />\n171<br />\n<br />\n,A;;:i...<br />\n\\.<br />\n, \\:.If<br />\n<br />\n( \\I<br />\n.<br />\ni i<br />\ni i<br />\n<br />\nI<br />\n<br />\n...fr<br />\n:<br />\n.<br />\n'''<br />\n,\"''''\"<br />\nio<br />\n,..\"..11111110<br />\n(<br />\n4/1.11<br />\n<br />\n,<br />\n<br />\n/<br />\nI<br />\n<br />\n(:(C(4r(i<br />\n<br />\n''<br />\n<br />\n//7(ti(t/////eor, *<br />\n44ii (<br />\n11111111<br />\n(L<br />\n<br />\n9A,,0::, s5,J5-r WviEN<br />\n<br />\n-rt_tE<br />\nDOGS<br />\ni'VR E ABOUT To FLLissk4 „,„,<br />\nCC:)\\/..`ri OF Cil0P,I I._<br />\n<br />\n.<br />\n<br />\nHE<br />\n<br />\n•<br />\n<br />\nAIR<br />\n<br />\n1 11<br />\n<br />\n1(il<br />\n<br />\nIF ..,./E INIEveR ZEE.. YOU AGAIN,<br />\nJ.. • WHEN<br />\n,<br />\nIT'LL BE 'lb° 4.5cX„)e<br />\n1100 GET 13ACV4 ,<br />\nTo MOW 10, E...kk.W<br />\n..S OM E-- OLD Go LT')S.... NOT A<br />\nCOUGH IN A CAR L.c.)A0 1.<br />\n<br />\nLETS<br />\n<br />\nLOOSE A CoLiGi-‘ THAT<br />\n-33)-S THE BIRDS AWAY E3EFoR<br />\n5E)<br />\n\\liou'Re IN RANJGC73 Or TH EM<br />\n<br />\n_<br />\n<br />\n1)2<br />\nCC<br />\n<br />\nth<br />\n(I(<br />\n<br />\nof<br />\n<br />\nlo<br />\nat<br />\nc1(<br />\n<br />\nfr<br />\n<br />\nk b,<br />\n'.<br />\n<br />\n,<br />\n(<br />\n<br />\na<br />\n.<br />\n'<br />\n<br />\nSc<br />\nve<br />\nin<br />\nba<br />\nra<br />\ndc<br />\nlit:<br />\ntir<br />\n<br />\nI<br />\n<br />\nItkfl 4,<br />\n'41'i'<br />\n(1(1 1((11(((<br />\n(<br />\n(%<br />\n<br />\na1<br />\ntai<br />\nce<br />\n<br />\n-... •i<br />\n\\<br />\n<br />\n)<br />\n<br />\n.4...<br />\n,se,amiaimaa,<br />\n<br />\nto<br />\nth<br />\n1);<br />\nIn(<br />\ntit<br />\nfo<br />\n<br />\n1-10<br />\n<br />\n*<br />\n<br />\n„A;. ( ..........„.........<br />\n<br />\n-4,-------'<br />\n<br />\n4<br />\n<br />\nre<br />\n<br />\nth<br />\n101<br />\n<br />\n_<br />\n<br />\n41.<br />\n<br />\nac<br />\n<br />\nCU<br />\n<br />\nr!<br />\n:<br />\nFu-r CL)-1- Thircr LiGH<br />\nWHORE_ V YA Ti-t I(V I<<br />\n7 I7`i THE<br />\nYOk-/ ARO: .<br />\n2<br />\nPUBLIC LIBRAR Y<br />\n<br />\n1:<br />\n.1 10...M11111<br />\n<br />\noff<br />\n<br />\nAutomobile<br />\n<br />\nand Card Parties<br />\n<br />\n,---..,-<br />\n<br />\not<br />\n<br />\nSt(<br />\npl<br />\nter<br />\nhf<br />\non<br />\n<br />\nspi<br />\n<br />\n20 East 21st Street<br />\n<br />\neION,<br />\n<br />\n\\\\<br />\n<br />\nce,<br />\nCa<br />\nat<br />\ncil<br />\n<br />\nter<br />\nin(<br />\n<br />\nFRED. MUELLER, Prop.<br />\n<br />\nD<br />\n<br />\nl<br />\n<br />\nTe<br />\n<br />\nOf<br />\n<br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br />\n<br />\nFOOD SHOP BAKERY<br />\nDELICATESSEN<br />\nCONFECTIONERY<br />\n<br />\ni NEVJTON1<br />\nMOrHE R NANAE--.1) HIM '<br />\n5kir SHE-- 5HOULD HAVE (VIADE<br />\n,,<br />\nIT \" NU'SANJCE.\"<br />\n•<br />\n<br />\nRoyal Tyler's \"Contrast\"<br />\n<br />\nFA<br />\n<br />\nTi<br />\nvva<br />\n<br />\nDemand<br />\n<br />\nRolls and Fancy Cakes<br />\nPhone -- Homewood 8993<br />\n<br />\n1415<br />\n<br />\nGroup Considering Production of<br />\n<br />\nDI<br />\n<br />\ntip<br />\nPASTRIES<br />\n<br />\nSALADS<br />\n<br />\nThere's at Least One on Every Hunting Party<br />\n<br />\nPlayshop to Revive<br />\nAmerican Comedy.<br />\n<br />\nThis year the Homewood Playshop is considering the production<br />\nof either a series of plays representing the history of American Comedy or a group of original plays.<br />\nMr. John Ely, who is the new director, will be in charge of these<br />\nproductions. The financial obligations of the Playshop have been<br />\nremoved by the payment of the<br />\namount advanced on the part of<br />\nthe University Trustees for the<br />\nconstruction of the little theatre.<br />\nand with this burden removed the<br />\nmembers will be able to devote their<br />\nenergies to this year's plays.<br />\nPlans are only in the tentative<br />\nstage at present, but in case they<br />\ndecide to reproduce the American<br />\nComedy, the players have considered reviving Royal Tyler's \"Contrast.\" So far as has been determined, this is its first revival. \"Contrast\" is the first American Comedy,<br />\nand was written in 1787. Tyler,<br />\nso the story runs,'had been reared<br />\nvery strictly and had not seen any<br />\nplay. However, while on military<br />\nservice in New York, he saw<br />\n\"School for Scandal\" being played<br />\nthere. It delighted him. Under<br />\nits influence he wrote \"Contrast,\"<br />\nwhich was well received and published in 1790. Thus the first<br />\nAmerican Comedy was decidedly<br />\nimpromptu in its origin. This play<br />\nis also noteworthy because it creates<br />\nthe \"typical Yankee\" type. The<br />\nhostility of the province to the metropolis is one of its chief themes,<br />\nand it is of great historical interest<br />\nas a guide to the social conditions<br />\nof the period. This season the<br />\nPlayshop will adhere to its policy of<br />\nscholarly instruction rather th2n<br />\nentertainment.<br />\n<br />\nSAMUEL KIRK & SON, INc.<br />\n<br />\ntC<br />\ny/<br />\n<br />\n••<br />\n<br />\n7I,i i<br />\nfj,<br />\n<br />\n,--.<br />\n4<br />\n.<br />\n<br />\n••••A<br />\n<br />\nfl<br />\n<br />\nto<br />\n<br />\ni<br />\n<br />\nUi<br />\ni.<br />\n•-•<br />\n<br />\n,.<br />\n<br />\n----<br />\n<br />\n-,,..7.<br />\n<br />\n..<br />\n<br />\n-..--\\,...\\\"A<br />\n<br />\n410, 1 .<br />\n1<br />\n:::- S I 911 1 1,/<br />\n<br />\n•,/,'<br />\n/'1410.7).5<br />\n---•<br />\n,t t .<br />\n•<br />\n/6•,..., /f/<br />\n'7<br />\n\"<br />\n/•<br />\n<br />\ni -<br />\n<br />\n\".i•4_,.....<br />\n<br />\nVI I<br />\n<br />\nk,<br />\n<br />\n\\ 7.__LI____<br />\n<br />\n,% t<br />\n<br />\n•.<br />\nfp ,.1• j—<br />\n<br />\n40((i.40/7//s,<br />\n<br />\n.<br />\n<br />\n. .<br />\n<br />\n,<br />\n<br />\n• ,-,...<br />\n-_—_-,-:<br />\n<br />\n.<<br />\n' • 14<br />\n<br />\n//k••-t<br />\n<br />\n, I<br />\n<br />\n-;<br />\n<br />\n, ,..<br />\n-Th i\\, f. .<br />\n<br />\ntonsi.s,<br />\n<br />\n.s'<br />\nr<br />\n<br />\nIll<br />\n<br />\nth<br />\nof<br />\n<br />\n'<br />\n4<br />\n<br />\n_...)<br />\n<br />\nI<br />\n—<br />\n<br />\nrk. 1 K-k<br />\n<br />\n. . . -f.. - „..-_,<br />\n,<br />\ne-<br />\n<br />\n..•<br />\n<br />\n.<br />\n<br />\n/<br />\n<br />\n4--> ....<br />\n,..1<br />\n<br />\nNIkomse<br />\n<br />\n1<br />\n„... f<br />\n<br />\nimtar.<br />\n<br />\n.<br />\n<br />\n..-- _,--<br />\n<br />\n-..\"<br />\n<br />\nyn<br />\n<br />\ni<br />\n<br />\n27<br />\n<br />\n(<br />\nalliell ii,7,,,<br />\n'7-<br />\n<br />\nLD<br />\nLD<br />\nGO<br />\nThe Smoother and Better Cigarette<br />\n• ••.not a cough in a carload<br />\n<br />\n1927, P. Lorillard Co.. Est. 1760<br />\n<br />\n/ -....<br />\n<br />\n1)1<br />\ntc<br />\nbf<br />\nri<br />\nal<br />\n<br />\n\f", "format": "basic_html", "processed": "155<br /><br />\n:e<br /><br />\nVOL. XXXII, No. 20<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 13, 1927<br /><br />\nBASKETBALL DATES<br />\nARE ANNOUNCED<br />\nI<br />\nTentative Schedule o f<br />\nGames Booked<br /><br />\nEight<br /><br />\nAUTUMN LACROSSE<br />\nPRACTICE ENDS<br />\nPractice for lacrosse has<br />\nbeen suspended until next<br />\nspring because of inclement<br />\nweather conditions. Manager<br />\nCarroll wants every man who<br />\nhas university equipment<br />\ncharged against him to return<br />\nthe same to either himself or<br />\nto Junior Manager William<br />\nBanks, who will be at Homewood field locker room tomorrow afternoon. Men who<br />\nhave personal equipment at<br />\nthe field should also procure<br />\nit at this time.<br /><br />\nU. S. IS GREATEST<br />\nBRITISH PROBLEM<br />\nPremier's Secretary Explains Empire Formation<br /><br />\nFIRST COTILLON<br />\nRESULTS IN DEFICIT<br />\nOne hundred and twentyone dollars was lost by the<br />\nCotillon Club on the first Cotillon held on December 2.<br />\nDue to this deficit the Club<br />\nwill hold no more dances until after the holidays, according to Kenneth Proctor, one<br />\nof its members. The amount<br />\nlost will have to be made up<br />\nat the Saturday night dances<br />\nafter the first of the new year.<br /><br />\nPRICE 5 CENTS<br /><br />\nFARINHOLT TO BE<br />\nRHODES SCHOLAR<br />\nHopkins Graduate Student is<br />\nSelected from 23 Applicants<br /><br />\n\"The greatest problem of the<br />\nWILL STUDY CHEMISTRY<br />\nBritish empire is the United States,\"<br />\nsaid Philip Henry Kerr, Secretary<br />\nto Lloyd George during the World<br />\nPractice Sessions to Be Held<br />\nTo Leave in October for Three<br />\nTuesdays and Fridays<br />\nWar, in a lecture on \"The ProbYears' Stay at Oxford<br />\nlems of the British Empire,\" delivered Thursday afternoon in the<br />\nFive games have been definitely<br />\nLarkin H. Farinholt, '27, has<br />\nC. E. Building. In discussing the<br />\narranged by Manager Bauernbeen awarded the Rhodes ScholarSchmidt for the basketball team this<br />\nrapid economic expansion of the Football Team Feted<br />\nship from the Maryland-District of<br />\nWinter. Georgetown will be met<br />\nRooters<br />\nBig<br />\nBy<br />\nUnited States and the complicated<br />\nColumbia district for 1928, the State<br />\nin two matches, two _games will be<br />\nproblems which this would bring<br />\nMembers of the Big Rooters As- committee announced yesterday.<br />\nPlayed with University of Mary- Activities Council<br />\ninto existence, Mr. Kerr stressed sociation, incorporated, played host Farinholt is the -first Hopkins man<br />\nland and another battle is assured<br />\nChanges<br />\nConstitution<br />\nthe similarity of the fundamental to the coaches, manager and major<br />\nWith the University of Baltimore<br />\nto hold the scholarship since Frank<br />\ninterests<br />\nof the British Empire and letter men of this season's football<br />\nSeveral<br />\namendments<br />\nto<br />\nthe<br />\nconquintet.<br />\nMorley, and is the first Marylander<br />\nthe United States, which he beOther games are pending with stitution of the Student Activities lieves will tend to keep the two na- team at a theatre and dinner party to hold the honor since the District<br />\nSt. John's, Washington College and Council were made at the meeting<br />\nlast night. Twenty guests were of Columbia was united with Marytions in harmony.<br />\nSwarthmore. Negotiations are still last Thursday in room 209, M. E.<br />\nfeted by the Association.<br />\nland for selection purposes several<br />\nunder way with Stevens College. building. The thost important \"The United States is an ancient<br />\nin<br />\n•formidable<br />\nAlthough<br />\nvery<br />\nEmBritish<br />\npower<br />\ncompared<br />\nto<br />\nthe<br />\nyears ago. He will begin his studies<br />\nAnother possibility is a -game with changes provide that in the future<br />\nan all-star Mexican five Which will the Secretary of the Student Ac- pire,\" Said Mr. Kerr. The old em- name, this organization is com- at Oxford next October, specializtour the United States and is seek- tivities Council shall take charge of pire, which was built up before posed, in reality, of but two'men. ing in chemistry.<br />\ning matches with representative col- the collection of 11 non-athletic 1776, was effectively broken up by Dr. W. Aarenson, who has been<br />\nFor Colleges Represented<br />\nfees of registration day, and that the revolt of the American colonies. nominated by Dr. Van Orman for<br />\nleges.<br />\nThe breaking up of that old emmanagers<br />\nof<br />\nthe<br />\nactivithe<br />\nvarious<br />\nAll home games will be played<br />\nAll-American rooter and dopester; TwentY-three applicants, repreat Carlin's, which is the most mod- ties must prepare budgets and place pire taught England many invalua'lessons, among them that liber- and who, incidentally, is an uncle senting ten universities, were presernly equipped court in the city. them in the hands of the council. ble<br />\nent last Saturday morning when the<br />\nThe amusement park floor is equip- The constitution is at present being ty is the cement of empires. The of Manny Aarenson, former captain<br />\nbeen<br />\non<br />\nformed<br />\nof the Hopkins track team, is pres- committee met in President GoodPed with an automatic scoreboard reprinted with these changes. At present empire has<br />\nthis basis, and the greatest possible ident of the organization. Dr. D. now's office to make the selection.<br />\nsame<br />\nmeeting,<br />\nthe<br />\naction<br />\na<br />\nproon<br />\nand plate glass backboards. The<br />\nliberty has been given to the cornglass backboards enable spectators posal that seals be awarded to deSilberman, brother-in-law of How- After several hours' deliberation,<br />\nponent.parts.<br />\nIt was with this prinseniors<br />\nin February was desitting behind the baskets to obtain serving<br />\nthe choice narrowed down to Farinciple in view that the Imperial Con- ard Caplan, is vice-president, secrea clear view of all shots.<br />\nferred till some future date.<br />\nholt and Harvey C. Mansfield, a<br />\ntreasurer.<br />\nand<br />\ntary<br />\nEmference of last year divided the<br />\nIt is a possibility that dances will<br />\ngraduate<br />\nstudent at Cornell. Finally,<br />\nparts—the<br />\nBritish<br />\ninto<br />\ntwo<br />\nprompire<br />\nparty,<br />\nwhich<br />\nThis<br />\nhad<br />\nbeen<br />\nbe held at the C. E. Hall followthe<br />\nNations<br />\nand<br />\nCommonwealth<br />\nof<br />\nFarinholt<br />\nwas selected, and Mansised immediately after the team's<br />\nSecond Cotillon<br />\ning the games.<br />\nBritish Empire proper.<br />\nvictory over Maryland, had been field recommended as_ scholar-atPractice Today<br />\nNight After Exams<br />\nawaited with eagerness by those large. He may receive an appointSix Autonomous Nations<br />\nPractice started Friday at CarTuesday, January 31, will be the<br />\nwho were fortunate enough to re- ment in the event of any State's<br />\nlin's and will be continued today. date of the second Cotillon, accordUnder this arrangement the Britinvitations. According to re- failure to nominate a man to fill its<br />\nceive<br />\nAbout forty candidates reported to ing to Maxwell Armor, president ish Commonwealth is composed of<br />\nCoach Darley. Practice sessions of the Cotillon Club. The place six practically autonomous nations ports, the party was a huge success vacancy.<br />\nwill continue every Tuesday and has not as yet been definitely de- that have entire charge of all do- and official sanction was given to<br />\nFrom Friends School<br />\nPriday afternoons at four o'clock cided upon, but it is thought the mestic and practically of foreign the Association by the football conVarsity<br />\nClub.<br />\nthe<br />\ntingent<br />\nof<br />\nuntil the middle of January.<br />\nFarinholt received his high school<br />\nSouthern Hotel will be chosen, affairs. They are bound together<br />\nThe usual practice of appointing ANrhere the dance will last from nine by tradition, language and similar<br />\neducation at Friends School. He<br />\nt<br />\n.wo<br />\nwas the recipient of the Eli M.<br />\njunior managers -will not be to three. As this is the night after political systems. After the war<br />\nintroduced this year, competition<br />\nLamb scholarship to Hopkins, an<br />\nexaminations, a large attendance is it was widely thought that the Brit- Dr. Wight Speaks At<br />\nbeing continued up to the senior expected, which, it is hoped, will ish Empire would disintegrate, but<br />\ngiven annually to one memFriendship Meeting award<br />\nYear. It is now possible for a man help to repair the financial disaster as Mr. Kerr said:\"It is more closeber of the graduating class, with the<br />\nDr. Carol V. B. Wight will be the highest scholastic average. He was<br />\n,t_? go out for the managership in of the first Cotillon.<br />\n(Continued on page 5, column 3.)<br />\nat the Friendship Council also voted the Buffington award,<br />\nspeaker<br />\nins third year and, by hard work,<br />\ntonight.<br />\nEdward T. Beall, granted annually to the student bemeeting<br />\nbecome manager of the team in his EIGHT-THIRTY,CLASS TAKES ON DOGGY<br />\nwho is in charge of the affair, stated lieved to have exerted the greatest<br />\nsenior term.<br />\nATMOSPHERE AS SMALL CANINE APPEARS that Dr. Wight has been allowed to influence for good in the institution.<br />\nThe schedule to date follows:<br />\nJan. 17--St. John's at Annapolis<br />\nWoof! Woof! Nice doggie, pro- benches at a bound and was soon choose any topic he may desire. A. At Hopkins his record includes memconsisting of Ensor, Gunders- bership in two honorary fraternities,<br />\n(Pending).<br />\nfessor wants to teach 'urn little boys wagging his tail expectantly right trio,<br />\nand Kilmor, will sing also. Omicron Delta Kappa and Tau<br />\ndorff<br />\nJan- 18—Georgetown at Washing- Hell-Hell-Hellenic History. Sick in the professor's face. That aston,<br />\ntonished gentleman naturally fa- The election of C. F. Perkins to the Beta Pi, each of which represents<br />\n'urn Cicero! Such were the disvored the pup's immediate and .for- Cabinet as freshman representative the highest goal in its line of enJan. 20—University of Maryland<br />\nanyone<br />\nointed<br />\nwhich<br />\nmight<br />\nremarks<br />\ncible ejection from the room, but will be officially announced. A spe- deavor. He was editor-in-chief of<br />\nat Baltimore.<br />\nFriday<br />\nmorning<br />\nbehave<br />\nheard<br />\nlast<br />\n16—Washington College at<br />\nfinally the students prevailed *upon cial effort is being made to have the Black and Blue /ay, was a memtween eight and eight twenty-five him that such zeal for learning those men who have not as yet ber of last year's championship laBaltimore (Pending).<br />\nPeb. 21—University of Maryland had he thawed sufficiently to get to should be rewarded. Who knows come to the Council attend.<br />\ncrosse team, was president both of<br />\nbeen a Phi Beta of<br />\nat College Park.<br />\nthe senior class and the Student Aca class on the third floor of Gilman this might have<br />\nb. 22—Georgetown_at Baltimore.<br />\ndogdom. At any rate, the ancient<br />\ntivities Council. He received first<br />\ntar 2—Swarthmore at Baltimore Hall at that frosty hour of the tag suspended round his neck Lord Baltimore Press<br />\nhonorable mention in the awarding<br />\nmorning.<br />\n,<br />\nstrangely resembled the well-known<br />\nof<br />\n(Pending).<br />\nTo Print Annual the Alexander Barton cup.<br />\nMar. 9—University of Baltimore at Nevertheless, things were changed key carried by members of that<br />\nNo Formal Examination<br />\nThe Lord Baltimore Press will<br />\nconsiderably by the time the good worthy brotherhood.<br />\nBaltimore.<br />\nHullabaloo,<br />\nacyear's<br />\nthis<br />\nprint<br />\nHowever, the curiosity of the<br />\nAccording to the terms of the<br />\nprofessor put in his appearance.<br />\ncording to a statement made by scholarships,<br />\nnot<br />\nbe<br />\ncould<br />\nstudents<br />\nrestrained<br />\nand<br />\neach State of the<br />\nThe bewildered canine who had<br />\nthe good professor soon decided Leonard Dalsemer, business mana- United States is entitled to two<br />\nlioPkins To Enter<br />\ncaused all the commotion had been<br />\nthe diminutive airedale proved ger of the year book. The new scholars in residence at any one<br />\nA. A. U Meet persuaded to occupy one of the that<br />\ntoo much of a diversion from the publishers of the annual, having time. Accordingly, the selections<br />\nHopkins will run in the A. A. LT. vacant benches so naturally that the subject of the lecture to remain one of the largest plants in Balti- are made twice every three years,<br />\n'fleet on December 17, at Clifton drowsy prof did not at first dis- longer in the room. After several more, are printers of the telephone<br />\nor in two-thirds of the States every<br />\nark, over a six-mile course. The tinguish him from the rest of his admonishments to \"leave that dog directories and much of the adver- year. The selection lies in the hands<br />\n'lam entered the meet at this late class of \"doggy\" collegians. This alone!\" he personally escorted Fido tising matter for nationally known of a committee in each State com'late on their own will, even though very intelligent brown representa- to the door and left him in the cold, products.<br />\nposed of leading educators and high<br />\ntheY had broken training after the tive of the species airedale managed cold corridor to wander and ponder<br />\nRepresentatives of the White public officials. The candidates are<br />\n!fleet with Maryland on Thanksgiv- to retain his composure throughout<br />\non the dog's life led by students Studio, Hullabaloo photographers, judged solely on the basis of their<br />\ning day. \"The meet will probably the preliminary exercises of calling of the Johns Hopkins University. will return to the University im- records at college and a personal in,riarrow down to team competition the roll, though it is said some of Hot Dawg! remarked one youth, on mediately after the Christmas holi- terview with the committee. There<br />\nnetween Emorywood Club and the students experienced a good the instructor's return.<br />\ndays to take fraternity pictures. is no formal examination. The<br />\n°Akins,\" said Ridgely Edwards, deal of difficulty in preventing him<br />\nAfter class someone overheard 'Advertising is coming along slow- chairman of the Maryland commit• but in spite of the break in train- from barking in unison with chor- the professor humming,\"0 where, ly. More candidates are needed tee is Emory H. Niles.<br />\nWe should have an even us of \"heres,\" but when the instruc- 0 where has my little dog gone ?\" for the business staff of the publiThe annual allowance under the<br />\nchance.\" Hopkins will enter this tor made mention of Xenophon's It is doubtful if any eight-thirty cation. Students who wish to try scholarships was formerly £300, but<br />\nevent, the last competition of the bones, this was too muchk. The class was ever so wide awake be- for places on that staff should re- has recently been raised to £400.<br />\nYear, with nine men.<br />\ndoggie cleared the front row of fore.<br />\nport to Business Manager Dalsemer. This sum is slightly less than $2,000.<br />\nRIG CROWD AT PRACTICE<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br /><br />\n2<br /><br />\nThe Johns Hopkins News -Letter<br /><br />\nShort But Rough<br /><br />\nFOUNDED 1897<br /><br />\nBy GEORGE BENTLEY<br />\n$2.00<br /><br />\nE. E. ADAMS<br /><br />\nTwenty degrees below freezing. presence of the subterranean stream<br />\nBARN CAFETERIA<br />\nmoon, round and white as a which cut through steep banks just<br />\nThe<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nWhat<br />\nclammy<br />\ncold.<br />\na<br />\nahead<br />\nfelt<br />\nI<br />\nbalefully<br />\nfrozen fish's eye, glared<br />\nBaltimore. Md., under Act of Congress, November 3, 1879.<br />\nif this lamp had also exploded,? On<br />\ndown upon the leafless trees sur- the other side of the dark chasm<br />\nPublished semi-weekly from October to June by the students of Johns rounding the Dormitory. Finding a few feet away, the passage<br />\nHopkins University.<br />\nit too cold to venture out to a Friday stretched off into blankness.<br />\nnight movie, Jeff Baker and I had \"As I stood there I suddenly noBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nacross the Dormitory court ticed the appearance of two figures<br />\ndashed<br />\nEDITOR;<br />\nMANAGING<br />\nthe<br />\nto<br />\nHopkins University. All articles should be sent<br />\n-CHIEF.<br />\nEDITOR-IN<br />\nthe<br />\nto<br />\nand up to our room to on the opposite bank—they were the Phone, CAI. 1380 Home—HO. 2095-J<br />\nentry<br />\ncommunications<br />\nto our<br />\nother<br />\nus<br />\nsmoke a pipe and talk over our same women who had accosted<br />\nFRANCES T. BANNON<br />\nin the street a few days before. Successor to HARBAUGH &amp; BANNON<br />\nUniversity 0100<br />\nTelephone<br />\ntroubles.<br />\nThe tall, ugly one pointed a finger 2 E. LEXINGTON ST., Cor. Charles<br />\n\"Got a 5.5 informal in French,\" at me and opened wide her mouth<br />\n(Room 28)<br />\nEDITORIAL DEPARTMENT<br />\nStenographic Dictation, Copying,<br />\nmuttered Jeff; \"confound that in- in a hideous, derisive laugh. But<br />\nEditor-in-Chief<br />\nMultigraphing, Mimeographing<br />\nthrough the roaring of the water no<br />\nMORTON HAMBURGER, JR., '28<br />\nstructor.\"<br />\nBaltimore, Md.<br />\nEven<br />\nsound<br />\nother<br />\nperceptible.<br />\nwas<br />\n\"Why, I thought you spent three<br />\nAssistant Managing Editor<br />\nManaging Editor<br />\nas I watched, I noticed that the<br />\nDONALD HISS, '29<br />\nweeks in France this summer!\"<br />\nNORMAN B. GARDINER, JR., '28<br />\nCarl J. Doederlein<br />\nshorter, and apparently the younger<br />\n\"Yes, but with Tubby Jackson and prettier girl, was arguing<br />\nColumnist<br />\nDIAMONDS<br />\nalong, I didn't have to know any with her companion. She bolted<br />\nALEXANDER C. WOODS, JR., '28<br />\nMfrs. of Fraternity Goods of All Kinds<br />\nFrench. I never will forget the brusquely and returned a second<br />\nAssociate Editors<br />\nBANK BUILDING<br />\nwe were standing in front later with a long board. The tall 504 PARK<br />\nevening<br />\nGEORGE E. RANKS, JR., '29<br />\nRALPH KIRKLEY, '28<br />\n(Lexington at Liberty Si..)<br />\nPHILIP W. NESS, '29<br />\nof a jeweler's window in Paris and sister, for such they seemed to be,<br />\ntwo French broads_ stopped to talk turned a face white with rage first<br />\nJunior Editors<br />\nA. H. FETTING<br />\nRICHARD H. WOOD,'29<br />\nCORNELIUS S. FRANCKLE, JR., '28<br />\nus. Presently the taller one toward me and then toward her<br />\nto<br />\nW. PURNELL HALL, JR., '30<br />\nA. BERNARD CHANCELLOR, JR., '28<br />\nMANUFACTURING JEWELRY<br />\n'Won't<br />\nROBERT<br />\nSKUTCH,<br />\nF.<br />\nsaid:<br />\n'30<br />\nand<br />\nTubby<br />\nto<br />\nturned<br />\ncompanion, and without further<br />\nLEONARD B. NOLLEY,'29<br />\nCO.<br />\nWILMER H. DRIVER, '29<br />\nAARON GOLDSTEIN, '29<br />\nyou buy us some jewelry?\"Got any warning seemed about to hurl the<br />\nGEORGE GUMP, '30<br />\nManufacturers<br />\nmoney?' he countered. In a couple latter into the chasm which lay beGREEK LETTER FRATERNITY<br />\nBUSINESS DEPARTMENT<br />\nJEWELRY<br />\nof minutes they drifted on.<br />\ntween us.<br />\nBusiness Manager<br />\nSTREET<br />\nLIBERTY<br />\nN.<br />\n213<br />\n\"There was only one occasion \"I waited not a second, but stepSAMUEL M. HECHT,'29<br />\nwhen I really_needed French badly. ping quickly back, reached the other<br />\nCirculation Manager<br />\nAdvertising Manager<br />\nTubby and I were walking along bank with a terrific running leap.<br />\nGEORGE M. GLAZIER, '29<br />\nZANVYL KRIEGER, '28<br />\nthe Avenue Trocadero one day The struggle was now two to one,<br />\nsuddenly, while we were look- and presently the ugly one was<br />\nwhen<br />\nAssistant Business Managers<br />\nThe NORMAN-REMINGTON CO.<br />\nJOHN YOUNG,'30<br />\nDONALD C. WEILLER,'28<br />\ning across the street at a couple of forced nearer and nearer the bank.<br />\nSTORE,347 N.CHARLES ST.<br />\nMAIN<br />\n'29<br />\n;<br />\nSCHLOSS,<br />\nJR.<br />\nHARRY 0.<br />\nA. H. MORTON,'30<br />\nthe Parisian taxi drivers who were Clawing and catching at us with her Branch Bargain, 1217 N. Charles St<br />\nPHILIP COWLES,'30<br />\nW. GRAHAM BOYCE, JR., '30<br />\nROBERT NITERS. 29<br />\nJOHN LOTZ, '30<br />\narguing about a collision they had talon-like hands, she suddenly lost<br />\nALvIN BLum, '30<br />\nWILLIAM RAFFEL,'30<br />\njust suffered, I stepped off into her foothold and fell out of sight—<br />\nPHOTOGRAPHIC DEPARTMENT<br />\nspace and droppel through a man- down, down, down.<br />\nTHE LITTLE FLOWER SHOP<br />\nManaging Editor<br />\nPhotography Director<br />\nhole to the dirt some twelve feet \"Without a word the younger<br />\n2438 St. Paul St., near 25th St.<br />\n'29<br />\nBANKS,<br />\nWILLIAM B.<br />\nVERNON SCHEIDT, '28<br />\nbelow, I looked and Tubby looked, sister led me along the passage in<br />\nfor all otcaoion%<br />\niftotuersi<br />\nbut we were unable to find any the oppostie direction from the fearStaff Photographers<br />\nOrders promptly delivered<br />\nGEORGE R. HILL, '29<br />\nWILLIAM S. PIKE,'29<br />\nmeans of pulling me out. The pas- ful river. The light now became<br />\na trial Telephone—HOmewood 2577<br />\nsage in which I had landed extended vastly brighter, and we emerged Give us<br />\nPrinted by Fleet-McGinley, Inc., 8th floor, Candler Building, Baltimore, Md. as far as I could see in the dim<br />\ninto a brilliantly lit hall, to be<br />\nlight in two directions; the two greeted by an appalling sight. At<br />\nAdvance Showing of<br />\nsides were too far back from the the far end of the room sat a giTHEIRHODES SCHOLARSHIP SELECTION<br />\nmanhole for me to try to clamber up gantic black—but what an apparireach it. There was no object tion! Beneath a flowing yellow wig<br />\nand<br />\nThe selection of Larkin Hundley Farinholt, a member of the<br />\n---for FALL<br />\nby means of which I could of human hair two coal-black eyes<br />\nsight<br />\nin<br />\nmuch<br />\nclass of 1927, as Rhodes Scholar for 1928 is an occasion for<br />\nget to the top of the manhole.<br />\nflashed at us; but even at that dispride and gratification on the part of the entire Johns Hopkins<br />\n\"'I'll get help,' said Tubby.'<br />\ntance, that which fascinated us with $29'5° &amp; $34.50<br />\nUniversity, and particularly on, the part of the undergraduate<br />\n\"He was no sooner out of sight a frightful horror was the fact that For the new seadepartment. Not only is he the first Hopkins man to have been<br />\naccorded this honor in several years, but he is a product of a<br />\nthan suddenly the aperture through the creature's nose and lips had son we have asgenerally maligned and slighted undergraduate school. We can<br />\nthe light had been coming was en- been completely removed and only a sembled the finest<br />\nvariety of men's<br />\nfeel justly proud of his achievement.<br />\ntirely closed. I was left in .utter hideous red cavity remained.<br />\nsuits it has ever<br />\ndarkness; not quite complete black- \"My terrified shriek broke the been our privilege<br />\nThat Farinholt—\"Monk,\" we should like to call him—embodies<br />\nness, however, for as my eyes be- spell. We fled, and soon found our- to present. Styles<br />\nin his make-up the characteristics which Cecil Rhodes believed<br />\nfounded on carecame accustomed to the gloom I selves once more at the yawning ful study of the<br />\nwere most admirable in a young man can best be illustrated by<br />\ndown<br />\nfar<br />\ndiscerned a distant light<br />\na quotation from Mr. Rhodes' will:<br />\nchasm. My companion drew closer fashion trend as<br />\nindicated by the<br />\nthe passage in which I stood.<br />\n\"My desire being that the students who shall be elected to the<br />\nto me and said softly:<br />\nbest dressed men<br />\nthe<br />\nin<br />\nthat<br />\ndirect<br />\nI<br />\nmerely<br />\nbookworms,<br />\nscholarships shall not be<br />\n\"Slowly, with infinite care, I \"Tis-mois que tu m'aime:<br />\nof this country<br />\nelection of a student to a scholarship regard shall be had to (a)<br />\nmade my way toward the ever- \"I did not understand;'she said and Europe.These<br />\npatterns will be<br />\nhis literary and scholastic attainments; (b) his fondness for and<br />\ngrowing light; I was still perhaps a more loudly<br />\noffered for your<br />\nsuccess in manly outdoor sports, such as cricket, football and the<br />\nhundred yards from it when it went \"Tis-mois que tu<br />\napproval as well<br />\nas a complete line<br />\nlike; (c) his qualities of manhood, truth, courage, devotion to<br />\nout with a loud bang and I was again<br />\nI failed to make head or of topcoats, over\"Still<br />\nunselfkindliness,<br />\nweak,<br />\nof<br />\nthe<br />\nprotection<br />\nduty, sympathy for and<br />\neft in complete darkness. Once more<br />\ntail of what she wanted. This time coats, and our<br />\nishness and fellowship; and (d) his exhibiiton during school days<br />\nspecially<br />\npriced<br />\nI discerned a dim light in the disshe almost shouted:<br />\ntuxedo at $34.50.<br />\nof moral force of character and of instincts to lead and to take an<br />\ntance, many yards beyond the point<br />\ninterest in his schoolmates, for those latter attributes will be likely<br />\nwhere I had observed the first; I \"Tis-mois que tu<br />\nAT 22 S. HOWARD ST.<br />\nin after life to guide him to esteem the performances of public<br />\ngroped towards it. As I neared the \"I shook my head. She suddenly<br />\nlamp a loud, rushing sound became became furious and, before I could<br />\nduty as his highest aim.\"<br />\n\"Justly<br />\nTo say that we believe Larkin Farinholt to be truly representamore and more distinct. Presently, resist, shoved me over the bank of \"Nationally<br />\nFamous\"<br />\nin the ghostly light of the passage- the chasm—down, down, down.<br />\ntive of the spirit which pervades Mr. Rhodes' statement is the<br />\nKnown'<br />\nhighest tribute we can pay.<br />\nway, I became aware of a steep \"I sat up and rubbed my side.<br />\nprecipice directly ahead, beneath the Damn, but they make those French<br />\nBaltimore<br />\nlamp itself. I shuddered; in the beds high!\"<br /><br />\nSubscription<br /><br />\n75.<br /><br />\nBOOKS<br /><br />\nRitet5on<br /><br />\nCiothe#<br /><br />\nWHAT PRICE TRADITION?<br />\nA few weeks ago it chanc0 to be our lot to fall in for a few<br />\nminutes with a University of Maryland student. The College<br />\nParker was, of course, very enthusiastic about Maryland. He<br />\ndiscussed the events that had led to his enrolling at Maryland,<br />\nsaying, in part:<br />\n\"My father went down. to the University with me to look the<br />\nplace over; wherever we went we were greeted by the students.<br />\nMy father turned to me and said: 'This is a mighty fine place.<br />\nWhen I was at college the boys never spoke to anybody but their<br />\nfriends.' That was, perhaps, my main reason for deciding to go<br />\nto U. of M.\"<br />\nOne of the oldest traditions at Hopkins is that of saying \"Hello\"<br />\nto all persons met on the campus. In view of the small amount<br />\nof dormitory life here, the preservation of the tradition is rendered more.difficult. If we are to cultivate a real Hopkins spirit,<br />\nit is up to every one of us to speak to friend and stranger alike.<br />\nDuring the past year failure to speak to other men passed on the<br />\ncampus has been increasingly glaring. Are we too lazy or too<br />\nsnobbish to speak to those we don't know?<br />\nLet's say \"Hello!\"<br />\nThe NEWS-LETTER regrets to announce the resignation<br />\nGeorge S. Hill as assistant photographer.<br /><br />\nof<br /><br />\nFIRST DORMITORY DANCE OF YEAR<br />\nCALLED GREAT SUCCESS BY RESIDENTS<br />\nThe first dormitory dance of the<br />\nyear was both a social and financial<br />\nsuccess. The entertainment committee wishes to thank the residents<br />\nfor their noble support. The committee is encouraged and promises<br />\nbigger and better dances in the<br />\nfuture. The music was furnished<br />\nby the Simpson-Morris orchestra<br />\nand was excellent.<br />\nThe stag line was. Impregnable.<br />\nA whole fleet of them invaded the<br />\ndance following the Musical Club<br />\nconcert. A fellow was unable to<br />\nproceed farther than the first few<br />\nphrases of his line before he was<br />\nattacked.<br />\nSeveral• graduate students suggested that the dance would attract<br />\nmore if it were possible to heat the<br /><br />\nTYPEWRITERS<br /><br />\nWe are Agents for the<br />\nstone wall of the courtyard. Perhaps this would be a good idea, conCORONA, ROYAL,<br />\nsidering that the dining room was<br />\nnot open.<br />\nUNDERWOOD &amp; REMINGTON<br />\nThe yellow tags which designated,<br />\nthat a resident or his friend had<br />\nPORTABLES<br />\nbeen caught at the door gave one<br />\n7-40*<br />\n006'`L<br />\nthe appearance of a tea ball. As<br />\nusual, several residents thought that<br />\nWe can furnish them in the<br />\nthey would study last Friday eveCIIEMICAL, ENGINEERING<br />\nning, but spent the major portion<br />\nof the evening with their noses or any other keyboard you may desire.<br />\nagainst the Commons Room window. The entertainment committee<br />\nCall or Phone us.<br />\nis considering the possibility of<br />\nmaking a charge of five cents a<br />\nM. W. LUCY &amp; CO.<br />\nwindow dance.<br />\nThe simplicity of the decorations Calvert 5902<br />\n104 W. Fayette St'<br />\nwas an outstanding feature. Red<br />\n\"30 Years in the Business\"<br />\nand green trimmings were used to<br />\nforce the Christmas season a bit.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br /><br />\nCOLLEGIATE ATHLETIC<br />\nCONFERENCE HELD<br /><br />\nUnder a new ruling of the Ox- Dr. Van Orman Delegate in Place<br />\nford-Cambridge athletic conference,<br />\nof Dr. Abercrombie<br />\nit seems very probable that Rhodes<br />\n.Ycholars will be barred from particiPation in athletics at Oxford. The<br />\nThe sixth annual meeting of the<br />\nrule forbids any student who is over Middle Atlantic States Collegiate<br />\ntwenty-three years of age from tak- Athletic Conference was held last<br />\ning part in certain athletic activities. Saturday, December 10, in Philadel.dt present the ban includes only phia, at the Hotel Adelphia, 13th<br />\ntrack competition, but it is the gen- and Chestnut Streets. The openeral opinion that all athletics will ing meeting of the conference beSOon be included.<br />\ngan at ten o'clock. At one o'clock,<br />\n* * * * *<br />\nluncheon was served to the deleA recent survey compiled by the gates and visitors. A round table<br />\ndirector of statistics at Rochester discussion concerning athletic probCollege exhibits a rather unfavor- lems of individual colleges followed.<br />\nable view by the alumni on par- Representatives from Delaware,<br />\nticipation in student activities. Gettysburg, Johns Hopkins, Lehigh,<br />\nThese statistics found the sentiment Princeton and Stevens gave short<br />\namong that group in direct opposi- talks on current athletic problems.<br />\nDr. Ray Van Orman was the<br />\ntion to extra-curricular activities<br />\nHopkins<br />\nrepresentative. Dr. Aberand they also believed'that the excrombie,<br />\nformer representative, has<br />\nperience thus derived is the least<br />\nforced<br />\nto resign. Nothing of<br />\nbeen<br />\nvalued of their collegiate career.<br />\nexceptional significance was dis* * * * *<br />\ncussed; the plan being to attempt<br />\n\"Pussyfoot\" Johnson, famous<br />\nto alleviate certain difficulties which<br />\n(Perhaps infamous) for his allegi- experience has brought out among<br />\nance to the ranks of the drys, has<br />\nthe various colleges.<br />\ncomae to the fore As a defender of<br />\nHathaway Speaks<br />\nthe much abused morality of the<br />\ncollege student. Mr. Johnson has The opening address of the mornfaith in the younger generation, be- ing session was made by the presilieving that for the few college men dent, Professor Henry C. Hatha7vho are immoral there is no men- way, of New York University. Mr.<br />\ntion of<br />\nthe many thousands of men Hathaway was the former chairman<br />\n'4'ha are not in this class. He light- of their Athletic Council. The preslY dismisses the discovery of a still ident gave a short resume of the<br />\nin an Iowa State university's fra- activities of the conference during<br />\n4itY house as insignificant when the last year, before suggesting a<br />\nei°mPared to the hundreds of col- positive program of action which is<br />\nleges and universities in the coun- immediately possible.<br />\nThe second and third speakers<br />\ntry that have no stills.<br />\nwere representatives of the Central<br />\n* * *<br />\n*<br />\nPennsylvania Conference and the<br />\nThe ban on smoking at Bryn Middle Atlantic States Collegiate<br />\nMawr College has at last been abroAthletic Association, respectively.<br />\ngated and one room in every dormiSchedules Considered<br />\ntory has been set aside at the disFollowing the conference the<br />\nPosal of those young ladies who desire to indulge in this recreation. game committee held a meeting for<br />\nThis action was taken by the Stu- the consideration of schedules in<br />\ndent Government in response to a certain sports.<br />\nThe Middle Atlantic States ColPetition of the student body. Only<br />\nper cent of the student body ac- legiate Athletic Conference sponknowledged the use of the filthy sors both a basketball and • tennis<br />\nassociation and is affiliated with the<br />\nweed.<br />\nMiddle Atlantic States Collegiate<br />\n* * * * *<br />\nAssociation. The conferAthletic<br />\n.The Yale News, student publication at Yale, has recently issued a ence includes the following colleges<br />\nscathing<br />\nand universities: Bucknell, Columdenunciation of college frate<br />\nrnities. They are definitely termed bia, Delaware, Drexel, Franklin and<br />\nMarshall, Gettysburg, Haverford,<br />\ndestructive<br />\ninfluences and are acJohns<br />\nHopkins, Juniata, Lebanon,<br />\ncused of overshadowing college itself.<br />\nLehigh, Muhlenberg, New York<br />\nUniversity, University of Pennsyl* * * * *<br />\nvania, Princeton, Rutgers, Stevens,<br />\nDerbies have been adopted by<br />\nSwarthmore<br />\nand Lafayette. Beembers of the sophomore class at<br />\ntl?e University of Arizona as a defi- sides official represntatives from the<br />\nabove schools, there were a number<br />\nnite mark of class distinction. We<br />\nvisiting delegates.<br />\nof<br />\n\".ere really not aware that it is so<br />\n\"Ifficult to distinguish a sophomore.<br />\n* * * * *<br />\nRobinson To Coach<br />\n.Fraternity men at Cornell UniverCity College Twelve<br />\n4itY spent an average of $21.38 more<br />\nAccepting<br />\na proposal of the athP,er man during last year than did<br />\nletic<br />\nof the Baltimore<br />\nauthorities<br />\ntne non-fraternity men who resided<br />\nc:Ldortnitories or boarding houses. City College, Norman Robinson,<br />\ncaptain of Hopkins' championdoubt whether siMilar results the<br />\ntu°uld be obtained if such a survey ship lacrosse team of last year, will<br />\ncoach that school's twelve.<br />\n7'as to be conducted at Hopkins.<br />\nAccording to Robinson, the pros* *<br />\n* *<br />\npects of his team for the coming<br />\nrIn the colleges and universities year are unusually bright, as eight<br />\nRussia, or rather what is now or ten regulars from last year's<br />\nteft of them, over seventy-five squad are 'back<br />\n,<br />\nand about sixtj.<br />\neli°11sand students are enrolled in candidates<br />\nhave turned out for the<br />\n°111Pulsofy military training as pre- positions.<br />\ns<br />\nby the government. ApCity College has its usually hard<br />\nDr°xlmately 180 hours per year is schedule, however, so the collegians<br />\nSpent in<br />\nsuch a manner by these have already been ordered out for<br />\nunfortunates.<br />\nfall workouts. These workouts are<br />\n* * * * *<br />\nbeing held temporarily in the yard<br />\nc,4 furor has been created at the of the school, but efforts are being<br />\nMateo College, California, made to secure either Herring Run<br />\nere the editor of the student pub- Park or the lower field at Hopkins<br />\ncliccition, after first stating that for spring practice.<br />\n:<br />\ninking and other infractions of<br />\nThe Howard Street school has<br />\nn'aining rules are not conducive to not been victorious over its chief<br />\niLgood football team, then accused rival, Poly, for several years, and<br />\nfootball team of his alma mater the new coach hopes to change this<br />\n°<br />\n0.1 doing that very thing. A thor- condition. According to Robinson,<br />\nLugh investigation is being made his position as coach will last only<br />\nvefore definite action will be taken. for this year.<br /><br />\nBUSINESS COURSES<br />\nOF<br /><br />\nCOLLEGE GRADE<br />\nSend for a Catalog<br />\nBREWBAKER COLLEGE<br />\nPARK AVENUE AND FRANKLIN STREET<br /><br />\nThe City of Happiness Is in the State of Mind<br />\nSee FORDYCE CAMPBELL - AETNAIZER<br />\n9th Floor Citizens Nat'l Bank Bldg. Plaza 1062<br />\nLIFE - ACCIDENT - HEALTH - AUTO - LIABILITY -<br /><br />\nFIRE<br /><br />\nThe<br />\nCream<br />\n• of the<br />\nTobacco<br />\nCrop<br /><br />\nYou, too, will find that LUCKY<br />\nSTRIKES give the greatest pleasure<br />\nMild and Mellow, the finest cigarettes<br />\nyou ever smoked. Made of the choicest<br />\ntobaccos, properly aged and blended with<br />\ngreat skill, and there is an extra process<br />\n\"IT'S TOASTED\" no harshness, not<br />\na bit of bite.<br /><br />\nMARY EATON<br />\nPopular Musical Comedy Star,<br />\nwrites:<br /><br />\nseems that most all the<br />\nmembers of the'Lucky'Company smoke Lucky Strike<br />\ncigarettes, and once I was<br />\ntempted to try one, and I am<br />\nglad to say I have enjoyed<br />\nthem ever since. I am very<br />\nhappy to say my throat has<br />\nbeen in perfect condition all<br />\nseason. Lucky Strike is the<br />\nonly cigarette for me.\"<br /><br />\n\"It<br /><br />\nTYLvtii<br /><br />\n*9<br /><br />\nIt's toasted<br /><br />\nNo Throat Irritation<br />\nNo Cough.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br /><br />\n4<br /><br />\nTHE MAIL BAG<br />\nAll letters intended for publication must be concise, written<br />\nin ink, on one side of the paper<br />\nonly.<br />\nNo attention will be paid to<br />\nanonymous letters, but names<br />\nsigned as an evidence of good<br />\nfaith will not be printed if request is made that they be omitted.<br />\nThe publication of a letter is<br />\nnot to be taken as an endorsement of its views by \"The NewsLetter\" which invites the freest<br />\ndiscussion of all matters of general interest.<br /><br />\n\"PROFS\" FLAYED<br /><br />\ntory I and \"Wop,\" known in the<br />\ncatalogue as Italian I. Now this<br />\nyear those grinning, fiendish, diabolical souls who direct our courses<br />\nhave lain traps for the unsuspecting<br />\nstudent who, busy with other work,<br />\nsigns up for one of these courses<br />\nfor an easy six •points. I believe<br />\nthat we are the victims of a deep<br />\nand well-laid plot that has reached<br />\nits culmination after years of preparatory effort. These courses have<br />\nbeen easy in the past merely to lure<br />\nus on for this great coup d'etat of<br />\nthose who write grades in red ink.<br />\nAlas and alack they have succeeded<br />\nso completely that Italian I and<br />\nHistory I now hold their own with<br />\nthat demon, Physics. What is our<br />\nUniversity coming to? One more<br />\nold tradition gone the way of all<br />\nflesh.<br />\nSOCRATES (Himself).<br /><br />\nFootball Banquet<br />\nTomorrow Night<br />\nDance at Civil Engineering Hall to<br />\nFollow Grid Dinner at<br />\nSouthern<br /><br />\nau Jo gei More<br />\nMileage fro<br /><br />\nMembers of the football team will<br />\ngather at the Southern Hotel tomorrow evening at seven o'clock for<br />\ntheir annual banquet. For the first<br />\ntime in the history of the football<br />\ndinners, alumni have been invited<br />\nto attend. . Iii former years the banquet has been closed to members of<br />\nthe team and representatives of the<br />\nlocal newspapers. About a hundred<br />\nand twenty-five persons are expected to attend tomorrow, according<br />\nto Manager Bauernschmidt.<br />\nA number of prep school stars<br />\nhave also been invited, including<br />\nBuck Miller, Helm, Goldberg of<br />\nCity College; Morrison of Forest<br />\nPark and McCullough of Poly.<br />\n\"Pop\" Swindell will officiate as<br />\ntoastmaster and Coach Van Orman<br />\nwill be the principal speaker. All<br />\nlettermen will be awarded miniature gold footballs. Following the<br />\nbanquet, there will be a dance from<br />\nten to one. Attendance will be<br />\nlimited by cards of invitation. Each<br />\nmember of the team has been given<br />\nthree invitations to distribute among.<br />\nfriends. These cards, when presented with a dollar, will admit<br />\nthe bearers to the dance.<br /><br />\nTo the Editor of the NEWS-LETTER:<br />\nDear Sir:<br />\nSkill in teaching is an attribute<br />\nto be admired greatly in a man who<br />\nattempts to increase the knowledge<br />\nof others. Recently there has been<br />\na great deal of discussion among<br />\ndissatisfied undergraduates about<br />\nthe lack of efficiency exhibited by<br />\nFRESH AIR PLEASE!<br />\nthe instructors. The professors are<br />\nthis<br />\nfrom<br />\nless<br />\nattacked but slightly<br />\nTo the Editor of the NEWS-LETTER:<br />\nviewpoint. Although most of the<br />\nDear Sir:<br />\ncomplaints are made by the more<br />\nOutdoors, all of Aeolus' unor less poor students, those lacking<br />\nwinds are fitfully bustling<br />\nthe desire and initiative to become chained<br />\nJack Frost has entered<br />\nand<br />\naround<br />\nreal scholars, these complaints do<br />\nhere I am, doomed to<br />\nbut<br />\nlists,<br />\nthe<br />\nseem well founded. It also seems<br />\nin an inferno, our<br />\nsuffocate<br />\nand<br />\nsit<br />\nthat these complaints relate directly<br />\nBooks to<br />\nlibrary.<br />\nhallowed<br />\nown<br />\nto methods of teaching, more than<br />\nthe left<br />\nto<br />\nbooks<br />\nright of one,<br />\nto any degree of knowledge pos- the<br />\nis<br />\nback—it<br />\nin<br />\nand<br />\nfront<br />\nin<br />\none,<br />\nsessed by the instructors or pro- of<br />\nnot<br />\nwere<br />\nshelves<br />\nthat<br />\npeculiar<br />\nreally<br />\nfessors. A man may know almost<br />\nthe spaces left open for<br />\nnothing, and yet be able to guide built in<br />\nause they are never<br />\nwindows—bec<br />\nothers in their endeavors in the<br />\nanyhow. The windows are<br />\nrealms of the erudite. The abso- used<br />\nthe air is stifling and<br />\ntight,<br />\nlute prerequisite for a pedagogue is shut<br />\nwith odors of old<br />\narged<br />\nsuper-ch<br />\nskill in teaching. From this viewmixed with a confeet,<br />\nand<br />\nbooks<br />\npoint some professors are worse<br />\nd'Or, Coty's,<br />\nFleur<br />\nof<br />\nglomerate<br />\nthan the graduate instructors. Disand<br />\nNarcissus<br />\nBlack<br />\nd'Arntour,<br />\nIle<br />\nregarding this, however, let us inI<br />\nNoxema.<br />\nor<br />\ncream<br />\ncold<br />\nvestigate the obvious defects and either<br />\nsenses<br />\nmy<br />\nolfactory<br />\nget<br />\ncan't<br />\njust<br />\nfallacies of the graduate aspirants.<br />\nbetween them.<br />\nFirst, they attempt a dignified air to distinguish<br />\nas hell—and<br />\nhere—hot<br />\nin<br />\nhot<br />\nIt's<br />\nwhich does not fit well, nor blend<br />\npresides<br />\nwho<br />\nVestal,<br />\nstern-faced<br />\nthe<br />\nwith their immature appearance.<br />\nfire of<br />\neternal<br />\nthe<br />\nfor<br />\nfuel<br />\nthe<br />\nover<br />\nunjustifiable,<br />\nThis in itself is not so<br />\nanything<br />\ndo<br />\nbut it leads to a supercilious superi- knowledge, doesn't<br />\nority complex which is most unbe- about it—and I always was under<br />\ncoming. Evidence the instructors' the impression that the female of<br />\nemotions upon being called \"doc- the species could bear cold so much<br />\ntor!\" Moreover, these controllers ;better than the male—damn the<br />\nof our destinies are entirely too psychologists—I'll have to report it<br />\nconscientious and strict. Interest, to Doc Mitchell. But, ah, I see a<br />\ngeneral intelligence and adaptability light—the same Vestal of the halare never graded by them; they lowed place is sure that drowsiness<br />\njudge the undergraduates solely leads to order—one cannot talk,<br />\nupon the correctness of minute &amp;- that is, in disturbing tones, in a<br />\ntails. And lastly, the instructors lethargy.<br />\nTaking my eyes off a very intergenerally seem to feel that their<br />\nparticular course should usurp the estingly inane biography of Keats,<br />\ngreater part of the student's time. I gaze around at my other colThey fail to realize that students leagues in misery. Some with their<br />\ndesiring merely a general broaden- heads pillowed in their arms on the<br />\ning knowledge of a subject are often table, no doubt dreaming of Arctic<br />\nneglectful, and never expend the _snows and exhilarating winds; some<br />\nsame amount of energy on these reading the same page over and<br />\ncourses as they do on their \"major.\" over again; some gazing into blank<br />\nStudents cannot be expected to ma- space—why, really, it's so hot in<br />\njor in everything, nor to inquire too here that even our sense of percepdeeply into the details of all their tion, in regard to the sometimes<br />\ndainty—er—well, to be gross—legs<br />\nsubjects.<br />\nme<br />\nlet<br />\nof the so-called fair co-eds, is dulled.<br />\nhowever,<br />\nIn concluding,<br />\nmake a few qualifications. This is Alack, alas, let us have air! I can<br />\nintended mainly for constructive appreciate the damnable sufferings<br />\ncriticism. It is not a condemnation of the victims of the Black Hole of<br />\nof graduate instructors as a whole, Calcutta.<br />\neither, for the writer is in contact<br />\nI wonder if it is any cooler in the<br />\nwith several that he deems efficient holy of holies, the stacks! The<br />\nand interesting. It merely attempts sweetheart, the young lady of the<br />\nto point out the cause of the com- dark blue smock, seems to look<br />\nplaints so much in evidence on the very much refreshed after a visit<br />\ncampus recently.<br />\ninto the same. But, then, why think<br />\nANONYMOUS.<br />\nof this—we poor damned souls are<br />\nnot permitted to help contaminate<br />\nthe atmosphere therein.<br />\nTHE TRUTH IS STRANGER<br />\nI believe the only solution to the<br />\nTo the Editor of the NEWS-LETTER: question would be to have our dear<br />\nfriend Doc Swartz take charge of<br />\nDear Sir:<br />\nTreason, viciousness and criminal the library and its ventilation.<br />\nlack of consideration have been Please help us out, Doc!<br />\nStagnation is the word I've been<br />\nperpetrated on the innocent student<br />\nbody by those reverend and, until looking for—stagnation, the height<br />\nnow, revered pedagogues who con- of service and air in our library and<br />\n—oh, here conies our other little<br />\nstitue our faculty.<br />\nUntil this year there halre been sweetheart, of the pea-green smock,<br />\ncertain courses offered at Johns from the stacks, she, also, looks reHopkins which have been known freshed—the atmosphere therein<br />\nfrom ancient times as \"snaps.\" surely must be more conducive to<br />\nNotable among these have been His(Continued on page 5, column 3.)<br /><br />\nWhere \"good enough\" isn't<br />\nThe basketball team that is never satisfied with<br />\nits performance is headed for the top. And in<br />\nthis, as in the making of telephone apparatus,<br />\nsuccess follows from the determination of every<br />\nman to cover his position and work in harmony<br />\nwith his team mates.<br />\nAt Western Electric, a continually widening<br />\nrange of activities is being undertaken—for example, investigating raw materials, designing<br />\nmore efficient machinery, developing new plans<br />\nfor manufacture,studying operating methods and<br />\npersonnel relations—any one of which offers the<br />\nindividual an interesting field.<br />\nBut whatever the work, his place in it and his<br />\ncontribution to its success depend upon his acceptance of this Western Electric idea: to improve<br />\nthe machinery of production to a point where<br />\nit more closely approaches perfection.<br /><br />\nrn Electric<br />\nSINCE 1882 MANUFACTURERS FOR<br /><br />\nTHE BELL SYSTEM<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER,.DECEMBER 13, 1927<br /><br />\nWitness<br />\nFIVE MEN TAKEN Gas Engineers<br />\nShowing of Slides<br />\nINTO TAU BETA PI<br />\nWerner, Schmiedicke„ Bruening<br />\nLang, and Russell Initiated<br />\nDEAN WHITEHEAD SPEAKS<br /><br />\n•<br />\nEngineering Head Lectures at Assembly on French Colleges<br />\n•Gustave Werner, Jr., Ferdinand<br />\nSchmiedicke, John Bruening, Robert Lang and William Russell were<br />\nPublicly initiated into Tau Beta Pi,<br />\nat last Thursday's Assembly. Dean<br />\nWhitehead of the Engineering<br />\nSchool delivered the address, while<br />\n-r --thelatte-r-part-of-the assembly was<br />\ndevoted to a matter somewhat foreign to the former, namely, basketball.<br /><br />\nI<br /><br />\nLoane Takes Charge<br /><br />\nEdward S. Loane, president of<br />\n'Ian Beta Pi, opened the assembly<br />\nWith a brief talk on the selection of<br />\nmen to be honored by membership<br />\nin the fraternity. Although excellent scholarship is a necessary requirement other qualifications are<br />\nconsidered. Chief among these are<br />\nintegrity and interest in affairs affecting both engineering and other<br />\nfields. The secretary read out the<br />\nnames of the elected men. From<br />\nthe senior class were elected two<br />\nCivil Engineering students, one Mechanical and one Electrical; while<br />\nfrom the junior class, one Chemical.<br /><br />\nInteresting slides showing the<br />\nmodern trend of automatic clinking machines were shown at a meeting of the Gas Engineering Association. The lecture was attended by<br />\nquite a large number, incruding Dr.<br />\nHuff of the Engineering School.<br />\nMr. Kuns of the Western Gas<br />\nCo. presented the slides and described the new methods. The devices have been tried out at the<br />\nSpring Garden Plant of the Consolidated Gas, Electric Light and<br />\nPower Co., the new machines being<br />\ninstalled by the Western Gas Construction Co.<br />\nThe slides included many pictures<br />\nof the old and archaic means of<br />\nremoving clinkers from the old type<br />\ngas manufacturing furnaces. The<br />\nnew contrivances, by means of<br />\nwhich ash is automatically removed,<br />\nare very ingenious.<br /><br />\nDr. Greenlaw to<br />\nAddress Club<br />\nProfessor Edwin Greenlaw will<br />\naddress the History of Ideas Club at<br />\na meeting to be held Thursday evening at 8 o'clock.<br />\nThe subject of Dr. Greenlaw's<br />\ntalk will be \"The Sixteenth Century<br />\nBattle of the Book.\" Members of<br />\nthe faculty and graduate students<br />\nare cordially invited to attend this<br />\nmeeting.<br /><br />\nMUSICAL CLUBS GIVE<br />\nSECOND CONCERT<br /><br />\nGlee Club, Banjo Club, and Blue<br />\nJays Well Received<br />\nIn the course of his short talk,<br />\nur. Whitehead took his listeners<br />\nthrough the ten universities which The combined Musical Clubs gave<br />\nhe visited while serving as Ex- their second concert of the season<br />\nchange Professor to France. The at the Guilford Community Church<br />\ngreat difference that one notices in House last Friday evening before a<br />\nFrench universities, according to small but appreciative audience.<br />\nthe Dean, is the absence of student<br />\nThe Glee .Club, having profited<br />\nlife. He said that there is almost greatly by their first concert, showed<br />\na total absence of life, for one sel- the results of hard work during the<br />\ndom sees students about the build- past week. Their program consisted<br />\nings. This is probably due to the of a pleasing mixture of the light<br />\ntwo year courses, and also to the and heavy selections adaptable to<br />\nlack of a campus, for he said all an organization of this sort.<br />\nFrench universities are situated in<br />\nA marked improvement must be<br />\nthe heart of cities. There are no noticed in the work of the Banjo<br />\ndormitories, although at present the Club, which is under the direction<br />\nUniversity of Paris is considering, of Conrad Gebelein. This club, altrying this plan by erecting quar- ways received as one of the most<br />\nters for foreign students on the out- popular, fulfilled its part in providskirts of the city.<br />\ning the evening's entertainment.<br />\nCarl Lausch made his reputation<br />\nFrench Serious<br />\nas a piano player of no mean ability<br />\n\"There is no doubt that the more widespread. As usual, his<br />\nFrench take their education more solo numbers were well selected<br />\nseriously than we do,\" said the and, if applause is an indication of<br />\nbean. At one university the last approval, the audience was more<br />\nthree weeks of the year were taken than satisfied. Osmar P. Steinwald<br />\nup with oral examinations. The also gave two excellent solo numbean said he attended several of bers, the first, \"Cazonetta,\" being<br />\nthese and found the ease with which particularly worthy of mention.<br />\nthe students talked on their subAgain, Benny Boynton of footjects was quite remarkable. There ball fame was the cause of a conhas been a great deal of comment tinuous laugh from his entrance to<br />\non the antagonistic attitude of the his exit. His sketch, \"An Impres,rench due to the war debt, but sion of an East Side Girl in a<br />\nur• Whitehead disagrees with this Theater;\" went over big, to say the<br />\nview. \"I want to take this oppor- least.<br />\n.ttinity to publicly deny it,\" he said, Of course, the Blue Jays were<br />\nin referring to this attitude of the well received. Their selections,<br />\nPrench. \"At all times during my played in the usual Blue Jay style,<br />\n°Ile year's stay in France I was must have worked on their dimintreated with the greatest courtesy.\" utive drummer—that is to say, if<br />\nD - Whitehead<br />\ng<br />\nclosed his talk by gesticulations and movements of a<br />\ng how enthusiastically the syncopated nature can be offered as<br />\nrench received Lindbergh, for he evidence.<br />\nwas in Paris at the time of the<br />\nNaturally enough, the Hawaiian<br />\ninemorable landing.<br />\nTroupe performed their part of the<br />\nprogram with due credit. Their first<br />\nBasketball<br />\nnumber, \"Drowsy Waters,\" eviThe latter part of the assembly dently pleased the listeners very<br />\nWas devoted entirely to basketball, much.<br />\nRopkins newest sport. There were<br />\nTaking everything into considerashort talks by almost everyone. tion, the concert was a good one<br />\nIllandi promised the freshmen and and, with the added degree of persophomores a chance to exerci-se fection that comes with practice, the<br />\ntheir lungs at this week's assembly, clubs will be able to present a profor he announced there would be a gram that will rival those of other<br />\nroll call of the two classes.<br />\nyears.<br />\nFrench Universities<br /><br />\nratin<br /><br />\nMAIL<br /><br />\n5<br /><br />\nBAG<br /><br />\nDress Sets<br /><br />\n(Continued from page 4, column 2.)<br /><br />\nstudy (?). Our library is a good<br />\none and, Mother Goose, the guardian angel, is all right in her way—<br />\nbut let's have some air. This infernal heat doesn't allow any kind<br />\nof efficient work.<br />\nYours for more ventilation,<br />\nBosco.<br /><br />\nfor dinner coat and<br />\nfull dress affairs. .<br />\nHennegen-Bates Company<br />\nJEWELERS SINCE 1857<br /><br />\n7 and 9 EAST BALTIMORE STREET<br /><br />\nINANE RAMBLINGS<br />\nTo the Editor of the NEWS-LETTER:<br />\nDear Sir:<br />\nEvery year, someone always rises<br />\nto smite the younger generations, its<br />\nstandards, moral •and spiritual; and<br />\nagain some other person, fired by<br />\ntheir insinuations, steps forth and<br />\ntakes a stand in defense. So much<br />\nfor the cause of this.<br />\nSeveral weeks ago, Stephen Leacock published in one of Baltimore's so-called reflective newspapers an article entitled \"A Cycle<br />\nof Love.\" If the author's purpose<br />\nwas to be funny, then it was a success. If he desired to create an<br />\nimpression other than one as a jokester, then it was a failure.<br />\nJohn M. Smith, the hero of this<br />\nattempt to fill the columns, is described as a modern college boy who<br />\nafter ten years of collegiate work<br />\nor life, had one better say, received<br />\na slip of paper which entitled him<br />\nto become divorced several times,<br />\nand to participate into other devilish practices. While there are John<br />\nM. Smiths, there are also John<br />\nSmiths, and we are to believe that<br />\nthe •college man has thrown all<br />\nstandards to the winds and is following an unwritten code of his<br />\nown.<br />\nThe hero is depicted as a devil<br />\nwho loved 'e mand left 'em—they,<br />\npining for his return—he, looking<br />\nfor other worlds to conquer.<br />\nAbigail Price, the heroine, is described as .one of those souls that<br />\nare true to the end, often referred<br />\nto as being \"all wool and a yard<br />\nwide.\" She just loved to pine and<br />\nthen the cycle begins again.<br />\nHowever, we must admit that the<br />\npresent day youth are hell bent!<br />\nThis business of going to cotillons<br />\nis bad dope, no doubt, and to smoke<br />\na pipe and in continuance of this<br />\nwarning process to wear a raccoon<br />\ncoat is inexcusable.<br />\n\"And don't you know, Nora,<br />\nD'Alti came home with red paint<br />\nin his hair last Saturday.\" Oh!<br />\nmy—what shall we do?<br />\nWell, boys, let's stick together<br />\nand smoke our pipes besides engaging in other sorts of badness and<br />\nremember to be just as determined<br />\nas Hah-vahd is in its Princetonian<br />\nstruggle. Repulse their insinuations<br />\nand, above all, be oh! so determined.<br />\nCAUSTIC CHARLES.<br /><br />\nM<br /><br />\n0<br /><br />\nS<br /><br />\nT<br /><br />\nConvenient and Economical<br />\nTRANSPORTATION<br /><br />\nTHE<br /><br />\nSTREET<br /><br />\nCARS<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nEsso<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nYOU CAN ACTUALLY FEEL THE DIFFERENCE<br /><br />\nSTANDARD OIL COMPANY N. J.<br /><br />\nDecorations<br /><br />\nInterior Wood Work<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nCLOTHES Ready•made<br />\nAnd Cut to Order<br /><br />\nESTABLISHED ENGLISH UNIVERSITY<br />\n• STYLES, TAILORED OVER YOUTHFUL<br />\nCHARTS SOLELY FOR DISTINGUISHED<br />\nSERVICE IN THE UNITED STATES.<br /><br />\nMSC<br />\nSuits *40,*45,*50 Overcoats<br /><br />\nBearly<br />\nCamels Hair<br />\nCoat<br />\n$163<br /><br />\nBeady<br />\nCamels Hair<br />\nCoat<br />\n$165<br /><br />\nPROBLEMS OF BRITIAN<br />\n(Continued from page 1, column 3.)<br /><br />\nly bound together than ever before.\"<br />\nThe other part of the Empire is<br />\nthat governed more or less directly<br />\nby the British Parliament. This<br />\ndivision is made up of people who<br />\nare not yet able to meet the measurements of modern civilized government. India with its three hundred and twenty-five million people is one of the great problems of<br />\nthe empire. Immediately after the<br />\nwar it received a greater share of<br />\nself government, but the nationalists, under Gambi, wanted more.<br />\nFor a time there was tension, now<br />\nmuch cleared up. A parliamentary<br />\ncommission has been appointed to<br />\ninvestigate the conditions with the<br />\nidea of allowing India greater freedom. \"India, like many other British colonies, is capable of governing itself, but not of holding its own<br />\nwith the great modern powers.\"<br /><br />\nIMMO<br />\n4111111MMINII<br /><br />\nBY SPECIAL APPOINTIFIECT<br />\nOUR STORE IS THE<br /><br />\n(Charter lif?ouze<br />\nof Baltimore<br />\nThe character of the suits and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nHub<br />\noaltimore. Charles and Fayette<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 13, 1927<br /><br />\n6<br /><br />\nTHE BARNSTORMERS WILL<br />\nDR. WOOD TO ADDRESS EVIDENTLY<br />\nKEEP THEIR MYSTERY PLAY MYSTERIOUS<br />\nDAY<br />\nASSEMBLYITERS<br />\nMystery! Detectives! Melodrama! As a last hope, two star NEWSRenowned Light-Physicist Is Engaged in Research<br />\n\"High Frequency Sound Waves\"<br />\nwill be the subject of Dr. Wood's<br />\naddress to the assembly next Thursday. Dr. Wood, a world renowned<br />\nlight-physicist and authority on ultra-violet and infra-red light, is actively engaged at research here in<br />\nthe physics department. At present he is studying the iodine vapor<br />\nspectrum and has written many<br />\ntreatises of scientific interest on<br />\nthese subjects.<br />\nAttention was first called to high<br />\nfrequency sound waves shortly<br />\nafter the war while experimenting<br />\non devices for the detection of submarines by reflected sound. The<br />\npeculiar effects were noted on fish<br />\nin the experimental tanks, but no<br />\nextensive research was done until<br />\nthe publication of a thesis on this<br />\nwork by Dr. Wood.<br />\nDr. Wood had conducted these<br />\nresearches in the laboratory of Dr.<br />\nAlfred Loomis, his co-worker, in<br />\ntheir laboratory at Tuxedo, New<br />\nYork.<br />\nWorld-Wide Interest<br /><br />\nImmediately these experiments<br />\nattracted world-wide interest, because of the unique physical and<br />\nbiological effects of these high frequency, high intensity sound waves.<br />\nDr. Wood will illustrate some of<br />\nthese curious phenomena with<br />\nslides.<br />\nDuring the war Dr. Wood, himself, was employed in an interesting<br />\nresearch. His specialty was the<br />\nadaption of invisible infra-red rays<br />\nfor signalling.<br /><br />\nBeautiful heroine! Manly hero!<br />\nWhat? The Barnstormers' play.<br />\n\"Is that all that you will tell about<br />\nyour coming mystery mystery play,<br />\nMr. Warfield?\" the president of the<br />\nBarnstormers was asked.<br />\n\"Absolutely all,\" Warfield answered. \"It is a first-class mystery<br />\nplay, comprising all the elements of<br />\nsuspense, curiosity, comedy and<br />\ndrama. You will have to wait until<br />\nFebruary to find out more about it.\"<br />\nFurther questioning proved absolutely futile. Warfield would tell<br />\nnothing more about the play chosen<br />\nby the Barnstormers.<br />\nDouglas Prahl, business manager<br />\nof the Dramatic Club, was questioned as to the name or even the<br />\nauthor of presentation. He begged<br />\nall questions very cleverly by talking of the business outlook of the<br />\nclub for the coming season. Very<br />\nbright, indeed; but that's not what<br />\ninformation was wanted from him.<br />\nA trip to the Dormitory to question Jerome Nott also proved fruitless. On entering his room he was<br />\nseen to seize a small brown booklet<br />\nand slam his desk drawer closed<br />\nwith amazing alacrity. This was<br />\nsecrecy with a vengeance.<br />\n\"But why all this secrecy and<br />\nmystery, Jerry ?\" our exasperated<br />\nreporter finally asked.<br />\n\"Well, you see it's this way,\"<br />\nNott began, and immediately two<br />\ndisgruntled reporters stalked out of<br />\nthe room and slammed the door.<br />\nBribery, wheedling, trickery,<br />\neverything failed. The Barnstormers were determined. Not even the<br />\ncandidates could be made to speak.<br /><br />\nFounded 1815<br /><br />\nLETTER reporters were sent all the<br />\nway down to \"Pop\" Swindell's<br />\nBaltimore, Md.<br />\n42 1 North Charles St.<br />\noffice. They were greeted warmly<br />\nby the veteran Barnstormers' coach<br />\nWrist Watches for Men<br />\nand told to be seated. They were<br />\nseated and smokes were offered<br />\nDIAMONDS -:- GOLD JEWELRY<br />\naround.<br />\n-:- SILVERWARE -:\"Pop\" Swindell was an actor.<br />\nThe recent extremely cold spell<br />\nwas discussed. The reporters gave<br />\ntheir opinions and prophecies as to<br />\nA<br />\nPHONES: HOMEWOOD 7806<br />\nmore and why.<br />\nHOMEWOOD 7807<br />\nSTAND<br />\nCAB<br />\nYELLOW<br />\nYes,\"Pop\" Swindell was an actor.<br />\nAT<br />\nPhone Us—We Deliver<br />\nThe great football game on<br />\nThanksgiving, and particularly the<br />\nHOMEWOOD FIELD<br />\nR. M.BIRELY,Phar. D.<br />\nVarsity Club reunion the night bePassengers<br />\nExtra<br />\nfor<br />\nCharge<br />\nNo<br />\nlength.<br />\ngreat<br />\nat<br />\ndiscussed<br />\nfore, were<br />\nPrescription Pharmacist<br />\n'PHONE<br />\nWe say emphatically, \"Pop\"<br />\nCIGARS.<br />\nCANDY SODA<br />\nSwindell is an actor.<br />\nVERNON 1212<br />\nFinally, a clock struck somewhere<br />\nFOR A<br />\nCor. St. Paul and 33rd Sts.<br />\nand the reporters excused themBALTIMORE, MD.<br />\nYELLOW CAB<br />\nselves.<br />\nOutside the door one was heard<br />\nJ. H. FURST CO.<br />\nto remark,\"Why did we come down<br />\nLOUIS SULSKY<br />\nPRINTERS OF<br />\nhere ?\"<br />\nBaltimore's Largest Renting<br />\nHouse<br />\nWhile the other replied, \"I'm<br />\nPhilological and Scientific<br />\nTuxedos, Cutaways and Full Dress<br />\nhanged if I know.\"<br />\nPublications<br />\nSuits to Hire<br />\nEvidently the Barnstormers intend 313 W. FRANKLIN ST. Phone. Vernon 3436 23 S. HANOVER ST. BALTIMORE<br />\nto keep their mystery play a mystery.<br /><br />\nfAMOCO-GAs(<br />\n,<br /><br />\nBaltimore, Md.<br />\nBox Lunches<br /><br />\nfor<br /><br />\n•<br />\n•<br /><br />\nBy BRIGGS<br /><br />\n•<br /><br />\nEt/ER'? BARBED VOIkE EENicE•<br />\nN<br />\nAND<br />\n5-RJAA BLES Ti-IROUGH IS<br />\n14E. ..<br />\nMUIR IDG•1;?<br />\nCHAR G a D v1/4./C-r<br /><br />\nt--1 -E.. ,<br /><br />\nALWAYS 61-115 UP AND 1=2. A\\DS<br />\n-1-hr• OTH IR S \\JUAN.7 (0<br />\n5 -To GET- At*<br />\n.SLE-EF 5o\"<br /><br />\neNJ<br /><br />\nEARLS'...STARMSAY- BREAK Th\",--1\"<br />\nUN ! DO Yoti WANI-T)<br />\n---....ss<br />\n„...----.-------------------To KILL Vs 7<br />\n1<br />\n/<br />\nFoR Ti-iC- LUVA MtKe<br /><br />\n-<br /><br />\nAIIII41<br /><br />\n\". --....-,-.....„,.<br />\n'<br /><br />\n---\\<br /><br />\n/<br /><br />\n,......,<br /><br />\n.----,4---N,--\"/(<br />\ni•<br /><br />\n/<br />\n-/II-\\?<br /><br />\nI<br /><br />\nZ<br />\n...<br />\nIft4r<br /><br />\n•c<br />\ni<br /><br />\n&gt;<br />\n,..<br />\n•<br /><br />\n.'<br /><br />\n----<br /><br />\n..<br /><br />\n,<br /><br />\nk<br /><br />\n`<br /><br />\nl'i<br />\nil'iillin(<br /><br />\n1<br /><br />\n1 •-<br /><br />\n//'<br /><br />\n---.<br /><br />\n.<br /><br />\n...„2-. .,<br />\n.<br /><br />\n/, /<br />\n'<br />\nk&lt; /<br />\n.,<br />\n. .<br /><br />\n'<br /><br />\n---..<br /><br />\n171<br /><br />\n,A;;:i...<br />\n\\.<br />\n, \\:.If<br /><br />\n( \\I<br />\n.<br />\ni i<br />\ni i<br /><br />\nI<br /><br />\n...fr<br />\n:<br />\n.<br />\n'''<br />\n,\"''''\"<br />\nio<br />\n,..\"..11111110<br />\n(<br />\n4/1.11<br /><br />\n,<br /><br />\n/<br />\nI<br /><br />\n(:(C(4r(i<br /><br />\n''<br /><br />\n//7(ti(t/////eor, *<br />\n44ii (<br />\n11111111<br />\n(L<br /><br />\n9A,,0::, s5,J5-r WviEN<br /><br />\n-rt_tE<br />\nDOGS<br />\ni'VR E ABOUT To FLLissk4 „,„,<br />\nCC:)\\/..`ri OF Cil0P,I I._<br /><br />\n.<br /><br />\nHE<br /><br />\n•<br /><br />\nAIR<br /><br />\n1 11<br /><br />\n1(il<br /><br />\nIF ..,./E INIEveR ZEE.. YOU AGAIN,<br />\nJ.. • WHEN<br />\n,<br />\nIT'LL BE 'lb° 4.5cX„)e<br />\n1100 GET 13ACV4 ,<br />\nTo MOW 10, E...kk.W<br />\n..S OM E-- OLD Go LT')S.... NOT A<br />\nCOUGH IN A CAR L.c.)A0 1.<br /><br />\nLETS<br /><br />\nLOOSE A CoLiGi-‘ THAT<br />\n-33)-S THE BIRDS AWAY E3EFoR<br />\n5E)<br />\n\\liou'Re IN RANJGC73 Or TH EM<br /><br />\n_<br /><br />\n1)2<br />\nCC<br /><br />\nth<br />\n(I(<br /><br />\nof<br /><br />\nlo<br />\nat<br />\nc1(<br /><br />\nfr<br /><br />\nk b,<br />\n'.<br /><br />\n,<br />\n(<br /><br />\na<br />\n.<br />\n'<br /><br />\nSc<br />\nve<br />\nin<br />\nba<br />\nra<br />\ndc<br />\nlit:<br />\ntir<br /><br />\nI<br /><br />\nItkfl 4,<br />\n'41'i'<br />\n(1(1 1((11(((<br />\n(<br />\n(%<br /><br />\na1<br />\ntai<br />\nce<br /><br />\n-... •i<br />\n\\<br /><br />\n)<br /><br />\n.4...<br />\n,se,amiaimaa,<br /><br />\nto<br />\nth<br />\n1);<br />\nIn(<br />\ntit<br />\nfo<br /><br />\n1-10<br /><br />\n*<br /><br />\n„A;. ( ..........„.........<br /><br />\n-4,-------'<br /><br />\n4<br /><br />\nre<br /><br />\nth<br />\n101<br /><br />\n_<br /><br />\n41.<br /><br />\nac<br /><br />\nCU<br /><br />\nr!<br />\n:<br />\nFu-r CL)-1- Thircr LiGH<br />\nWHORE_ V YA Ti-t I(V I&lt;<br />\n7 I7`i THE<br />\nYOk-/ ARO: .<br />\n2<br />\nPUBLIC LIBRAR Y<br /><br />\n1:<br />\n.1 10...M11111<br /><br />\noff<br /><br />\nAutomobile<br /><br />\nand Card Parties<br /><br />\n,---..,-<br /><br />\not<br /><br />\nSt(<br />\npl<br />\nter<br />\nhf<br />\non<br /><br />\nspi<br /><br />\n20 East 21st Street<br /><br />\neION,<br /><br />\n\\\\<br /><br />\nce,<br />\nCa<br />\nat<br />\ncil<br /><br />\nter<br />\nin(<br /><br />\nFRED. MUELLER, Prop.<br /><br />\nD<br /><br />\nl<br /><br />\nTe<br /><br />\nOf<br /><br />\nThe Original<br />\nSPECIAL MOTOR FUEL<br /><br />\nFOOD SHOP BAKERY<br />\nDELICATESSEN<br />\nCONFECTIONERY<br /><br />\ni NEVJTON1<br />\nMOrHE R NANAE--.1) HIM '<br />\n5kir SHE-- 5HOULD HAVE (VIADE<br />\n,,<br />\nIT \" NU'SANJCE.\"<br />\n•<br /><br />\nRoyal Tyler's \"Contrast\"<br /><br />\nFA<br /><br />\nTi<br />\nvva<br /><br />\nDemand<br /><br />\nRolls and Fancy Cakes<br />\nPhone -- Homewood 8993<br /><br />\n1415<br /><br />\nGroup Considering Production of<br /><br />\nDI<br /><br />\ntip<br />\nPASTRIES<br /><br />\nSALADS<br /><br />\nThere's at Least One on Every Hunting Party<br /><br />\nPlayshop to Revive<br />\nAmerican Comedy.<br /><br />\nThis year the Homewood Playshop is considering the production<br />\nof either a series of plays representing the history of American Comedy or a group of original plays.<br />\nMr. John Ely, who is the new director, will be in charge of these<br />\nproductions. The financial obligations of the Playshop have been<br />\nremoved by the payment of the<br />\namount advanced on the part of<br />\nthe University Trustees for the<br />\nconstruction of the little theatre.<br />\nand with this burden removed the<br />\nmembers will be able to devote their<br />\nenergies to this year's plays.<br />\nPlans are only in the tentative<br />\nstage at present, but in case they<br />\ndecide to reproduce the American<br />\nComedy, the players have considered reviving Royal Tyler's \"Contrast.\" So far as has been determined, this is its first revival. \"Contrast\" is the first American Comedy,<br />\nand was written in 1787. Tyler,<br />\nso the story runs,'had been reared<br />\nvery strictly and had not seen any<br />\nplay. However, while on military<br />\nservice in New York, he saw<br />\n\"School for Scandal\" being played<br />\nthere. It delighted him. Under<br />\nits influence he wrote \"Contrast,\"<br />\nwhich was well received and published in 1790. Thus the first<br />\nAmerican Comedy was decidedly<br />\nimpromptu in its origin. This play<br />\nis also noteworthy because it creates<br />\nthe \"typical Yankee\" type. The<br />\nhostility of the province to the metropolis is one of its chief themes,<br />\nand it is of great historical interest<br />\nas a guide to the social conditions<br />\nof the period. This season the<br />\nPlayshop will adhere to its policy of<br />\nscholarly instruction rather th2n<br />\nentertainment.<br /><br />\nSAMUEL KIRK &amp; SON, INc.<br /><br />\ntC<br />\ny/<br /><br />\n••<br /><br />\n7I,i i<br />\nfj,<br /><br />\n,--.<br />\n4<br />\n.<br /><br />\n••••A<br /><br />\nfl<br /><br />\nto<br /><br />\ni<br /><br />\nUi<br />\ni.<br />\n•-•<br /><br />\n,.<br /><br />\n----<br /><br />\n-,,..7.<br /><br />\n..<br /><br />\n-..--\\,...\\\"A<br /><br />\n410, 1 .<br />\n1<br />\n:::- S I 911 1 1,/<br /><br />\n•,/,'<br />\n/'1410.7).5<br />\n---•<br />\n,t t .<br />\n•<br />\n/6•,..., /f/<br />\n'7<br />\n\"<br />\n/•<br /><br />\ni -<br /><br />\n\".i•4_,.....<br /><br />\nVI I<br /><br />\nk,<br /><br />\n\\ 7.__LI____<br /><br />\n,% t<br /><br />\n•.<br />\nfp ,.1• j—<br /><br />\n40((i.40/7//s,<br /><br />\n.<br /><br />\n. .<br /><br />\n,<br /><br />\n• ,-,...<br />\n-_—_-,-:<br /><br />\n.&lt;<br />\n' • 14<br /><br />\n//k••-t<br /><br />\n, I<br /><br />\n-;<br /><br />\n, ,..<br />\n-Th i\\, f. .<br /><br />\ntonsi.s,<br /><br />\n.s'<br />\nr<br /><br />\nIll<br /><br />\nth<br />\nof<br /><br />\n'<br />\n4<br /><br />\n_...)<br /><br />\nI<br />\n—<br /><br />\nrk. 1 K-k<br /><br />\n. . . -f.. - „..-_,<br />\n,<br />\ne-<br /><br />\n..•<br /><br />\n.<br /><br />\n/<br /><br />\n4--&gt; ....<br />\n,..1<br /><br />\nNIkomse<br /><br />\n1<br />\n„... f<br /><br />\nimtar.<br /><br />\n.<br /><br />\n..-- _,--<br /><br />\n-..\"<br /><br />\nyn<br /><br />\ni<br /><br />\n27<br /><br />\n(<br />\nalliell ii,7,,,<br />\n'7-<br /><br />\nLD<br />\nLD<br />\nGO<br />\nThe Smoother and Better Cigarette<br />\n• ••.not a cough in a carload<br /><br />\n1927, P. Lorillard Co.. Est. 1760<br /><br />\n/ -....<br /><br />\n1)1<br />\ntc<br />\nbf<br />\nri<br />\nal<br /><br />"}], "field_media_file": [{"target_id": 38205, "display": null, "description": null, "target_type": "file", "target_uuid": "f6b16fb6-feb7-4c48-a464-25434ffbe810", "url": "http://digital.library.jhu.edu/system/files/2022-03/13292-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13292, "target_type": "node", "target_uuid": "f0282c02-c60d-47ce-a55d-334eb97871b9", "url": "/node/13292"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "158c9eb8-b5f1-431c-af3f-98d4fa76e541"}]}