{"mid": [{"value": 35712}], "uuid": [{"value": "56e03970-067b-4e94-ac0d-fd1c32bbaafc"}], "vid": [{"value": 35712}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12246-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:49+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VII, No. 15<br />\n<br />\nMay 21, 1903<br />\n<br />\nTHE<br />\n<br />\nNEWS<br />\n<br />\nelh T ,FTT1<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\nR<br />\n<br />\n\fThe Johns Hopkins Press.<br />\n<br />\nThe Johns tiopkins Universitu<br />\nBALTIMORE, MARYLAND.<br />\n1.<br />\n<br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, teoz.<br />\nPresident: lnA Rummy. Dean of the Medical Faculty:<br />\nWILLIAM H. How Ebb. Dean of the College Faculty:<br />\nEDWARD H. GuirriN.<br />\n<br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of II. A.<br />\n(d) As special students.<br />\n<br />\nlimerican Chemical 3ournal.<br />\nI. RENSEN, Editor Monthly. 8vo. Volume<br />\nXXIX in progress. $5 per volume.<br />\n111. IlmeriCan 3ournal Of ip btlolocrO•<br />\nII. L. G I LDERSLEE V E, Editor. Quarterly. tivo<br />\nVolume XXIII in progress. $3 per volume.<br />\n<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br />\n<br />\nIra Remseli.<br />\nJoseph S. Ames.<br />\nWitiinM B. Clark.<br />\nWilliam, K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam. H. Howell.<br />\nWiltiam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.'<br />\n<br />\nDirectors.<br />\nMosil I,. Gildersleeve.<br />\nK rig/<br />\n111(1 Ii rive. 11100Infteld.<br />\nPith I Uri opt.<br />\n<br />\nHenry Wood.<br />\nA. Marshall<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\n.1. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. times.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. classical<br />\n(the \"ol(1 college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading unto medicine).<br />\n4. Geological-Biological.<br />\n6. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerlean Journal of Philology (vol XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A sayriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars (vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application tithe Registrar.<br />\n<br />\n8vo.,<br />\n<br />\n111/.<br />\n<br />\nStables from the 18tologieal laboratory.<br />\nVolume V complete. $5 per volinne.1<br />\n<br />\n1P.<br />\n<br />\n%tables in 1bistorical anb oIittcaIScience.<br />\nMonthly. tivo. Series XXI in progress. $11 per<br />\nvolume.<br />\n3obils lbopitins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXI I i<br />\nprogress. $1 per year.<br />\n<br />\n11)11. 3obno lbophins lbospital ulIetin. Menthly. 4to.<br />\nVolume XIV in progress $1 per year.<br />\n0111111. Johns lbophins lbospital lfteporte. 4to. Volume X<br />\nin progress. $5 per volume.<br />\n11X.<br />\n<br />\nContributions to Beillyriology ant) Comparative<br />\nScitutic biIoio1W,(Beitrage zur A msyriologie, etc.)<br />\nVol. IV complete.<br />\n<br />\nX.<br />\n<br />\nfinemoirs from the Siological laboratory.<br />\nW. K. BROOKS, Editor. Volume IV compl<br />\n$7.60 per volume.<br />\n<br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br />\n<br />\nVolu<br />\n<br />\n11.<br />\n<br />\n11)1.<br />\n<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\nlimerican 3ournal of mathematics.<br />\nF. MORLEY, Editor. Quarterly. 41.o.<br />\nXX V in progress. $5 per volume.<br />\n<br />\n116obern language 'Rotes.<br />\nA. M. ELLIOTT, Editor. Month .<br />\nXVIII in progress. 11.60 per vo unto.<br />\nX11. 3ournal of Experimental flecbicine.<br />\nW. 11. WELCH, Editor Ili-monthly. Ave. Vol<br />\nVI in progress. $5 per volume.<br />\nXl.<br />\n<br />\nX111. Bmerican 3ournal of Insanity.<br />\n111(i1NRY M. H(JIM, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nIfleporto of fearylanb ecological eurvey.<br />\nWILLIAM II. CLARK, Editor.<br />\nV.<br />\n<br />\nterrestrial (Magnetism ant' - litmospberic<br />\ntricitp. L. A. BA 17 ER, Editor. Quarterly. 8vo.<br />\nVolume VII in progress. $2.50 per volume.<br />\n<br />\nf101.<br />\n<br />\n'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br />\n<br />\nTM.Bnnual Register.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br />\n<br />\nin addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament.. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the .Johns Hopkins Hospital. .1. S. Billings, Editor. lie pp. 4to. 56 plates. $7.60 cloth.<br />\nThe Teaching of the Apostles. Complete fae-simile edition. Edited by J. Itendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS with Antilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographic Hopkinsiensis. Part T. Philology. Parts<br />\nhi-ill. Chemistry, Mineralogy and Geology. Parts<br />\nIV-V-VI. Physics,Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nfi lull list of publications will be sent on application.<br />\n<br />\nGonimunications in respect to exchanges and remittances<br />\nmak; be sent to Johns Hopkins Press, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol.. VII.<br />\n<br />\n\\Y 21, 1903.<br />\n<br />\nNo. 15.<br />\n<br />\nA TREATISE ON THE COW-PUNCHER.<br />\nHe is likely idle,<br />\nex), I NITER is an empty season to the \"cow-puncher.<br />\nthough there is a chance that, as one out of twenty, he is retained to<br />\n\"ride fence\" or \" ride bog holes,\" in the first case to patrol the barbwire and repair gaps that might allow flow from one pasture to another, and in<br />\nthe second to haul forth from at least one certainty of death the many weakened<br />\ncattle that get mired. For the ranch-owner winter is such a hazard that he would<br />\nhold his breath through it if the period of danger were a trifle shorter. Ravens<br />\nProspect about the prairie ; there are raw skins hung on the fences; and rumors<br />\ncome from further on the plains that the \"I.Ialf-circle W's- have lost two thousand head.<br />\nThe popular •mood lightens when Spring comes in, nimbly as always ; and,<br />\nafter a thorough rain with predictions that \"there'll be grass in two weeks,\" the<br />\nmen begin to gather to the ranch headquarters. They are perhaps a fortnight<br />\nahead of the least move to work, yet they are welcome to unroll their bedding in<br />\nthe \"dive,\" to eat of the.beef and stewed prunes in the \"chuck-house,\" and so to<br />\nwait till what time they may be taken under wages again.<br />\nAmong them are many \"sweaters,\" — crude boys, on a first essay, whose<br />\ncapital in life is the remnants of a saddle and a willingness to ride bronchos.<br />\nri;very one waits in ignorance, because the manager is as a rule hostile to inquiries,<br />\nhut at last a dav is realized on which the punchers of last year get their places<br />\nanew and perhaps tionie of the \"sweaters\" cast off that name ; and on the next<br />\nmorning the \"outfit\" starts for the pasture ;—a line of horsemen, followed cumbrously by a wagon piled high with bedding and tooled by the cook.<br />\nOn the Stirrup Ranch as on others, the horses are to be got first,—the three<br />\nor four hundred animals turned out for the winter,—and to that end the outfit,<br />\nafter a while of slow travel, makes camp upon the mesquite-covered prairie at the<br />\nfoot of the great steppe that is the Plains. The gather is accomplished in sections, and each day possesses the same round of active work. In the early hours<br />\nthe view is quiet as the men scatter to their places in a loose circle that may hold<br />\nwithin it thirty square miles ; then all about in the green of the mesquite one sees<br />\nfar off brown and white motes in mid-career with a variegated speck close behind and a second, swift as a centaur, closing in from another quarter; then<br />\nthe motes resolve themselves into horses and the specks into mounted men ; and<br />\nPerhaps ten minutes after the ground in front of one is full of the tiinnilt of hoofs<br />\nand of pursuers and pursued until it settles with a restive bunch of horses and<br />\npickets round about you. The cow-boys take fresh mounts from those cap-<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\ntured ; and as they' rope for some particular head among so many it is not unusual<br />\n. favorite of last year,---'A1 Bald\" it may be or \"Diamond<br />\nthat they miss the<br />\njoe,\"—and catch a bronch' which four men at the end of the rope must strain<br />\nto hold till the running noose has \"choked him down.\" Old favorites too rebel<br />\nat first of the saddle, and it is under such circumstances that high art in \"bucking\"<br />\nis most evident, with the rider in that contorted bend which the stranger never<br />\nunderstands to be involuntary till he himself has been \"busted\" by a broncho.<br />\nA proportion of the horses ignore the gregarious instinct and make escape to be<br />\noutlaws ; yet after a week the outfit can return to the ranch-house with a docile<br />\nquarter of a mile of horses driven before.<br />\nAt the ranch there is a stir with friction over the choice of mounts. Each<br />\nman has the dozen that served him last year yet wishes as many more ; and<br />\ndiscussion of hocks and withers and stifle-joints is hot, until with the allotment<br />\nunder charge of the \"horse-wrangler\" the outfit puts forth afresh, this time to<br />\nwork with the cattle.<br />\nThe grass rises ankle-deep by now on the Stirrup lands, and even where the<br />\nprairie-soil shows through are great white and lemon primroses and mats of<br />\npurple verbena. What part of the pasture lies on the Plains has still a rather<br />\nhare sward ; and when one ascends the \"Cap-Rock,\"—a hundred feet of rough,<br />\ncolored slope, which like the moraine to a glacier, is an abrupt border along the<br />\nfoot of the wide-spread plateau,--.--one finds an expanse of earth and sky, elementary as an ocean view, but with a somber fixedness that the ocean has not,<br />\nwith perhaps an uneasy antelope or two in the distance, a wire fence that goes<br />\nrapidly off into perspective, and quivering lines of heat that for some reason<br />\nmagnify the far-off herd grotesquely and give its members unsteady, stilt-like legs.<br />\nEach morning the outfit makes a drive that ends in a round-up. The drive,<br />\nthough slower, is of a plan with that for horses. 1 ly the time the sun has got<br />\nto its strength the cattle have been started from the grazing and appear in troops<br />\nthat center on an open level in the mesquites. If the drive be large a van-guard<br />\nof baby calves will clog proceedings, and some must he carried over the pommel<br />\nof the saddle, and some stirred with the foot, when they flop down and relapse<br />\ninstantly into sleep, as they will in spite of circumstances that should cause them<br />\nanxiety, and some even be left with a mother to stand over them. Before noon<br />\na couple of acres of cattle are assembled ; a couple of acres of tossed horns and<br />\ncrowded brown backs ; a couple of acres that bleat and bawl like a brass band<br />\nin its preliminaries ; and that eddy ,round and round. The men change horses,—<br />\nthey are always changing horses at the least moment of rest,—and the more<br />\narduous \"cutting out\" begins, to obtain the yearlings at this season. It is very<br />\nlike polo:—dust, with horses that dodge in the midst of the dust, only in this instance instead of the ball, a yearling, fond of his parent, is to be separated from<br />\nher, and out of the press and coerced to the bunch of his fellows a hundred yards<br />\noff. As time goes the cattle circle more restlessly and are harder to \"hold,\" the<br />\ndust rises and blows, and the bellowing and moos become loudly incessant ; until<br />\nsecond outfit interlocks with that so far<br />\nthe final yearling is \"chousted out.<br />\nfollowed, with which the yearlings must go perforce off to exile till they arc<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n3<br />\n<br />\nweaned; so labor for the first gang has its finish for the day. There is a steeplechav to where dinner waits with the wagon at sonic near-by tank of water.<br />\nhater comes a move to fresh territory, but always an hour or two is on hand at<br />\nthe cool end of the afternoon, through which one can wash saddle-blankets or<br />\nbridle a \"quirt,\" lie in laziness, or,—if conditions ask for it,—stretch \"tepees\"<br />\nagainst the rain.<br />\nThus till the fall, even till December, cow-boys punch cattle. (hi the Stirnip's land, with its 40,000 head, work exists till late. In Spring the yearlings<br />\nmust be weaned, then the brand is put on calves,—breathless business it is for<br />\nthe fellow who must wind arms about fifty in succession as they bound at the<br />\nend of the rope, and throw them (breathless too, for the calves),—and at all<br />\ntimes special grades are to be separated for market. Through these processes<br />\nruns the organization into herd and round-up and cut. \"Stray men\" are sent<br />\nwith a string of horses and a pack of quilts to follow the round-ups of the<br />\n\"Lazy L's \"( ) nearby and claim property that has got past the barb-wire;<br />\nand sometimes sonic one is called upon to find a trail to the rail-road,—for now<br />\nwhat with fences a herd may not be brought straight by compass. Once or<br />\ntwice a season the outfit must \"go on the trail,\" when, indeed, it pays for idleness<br />\nwith a routine which insists that each man shall herd and press on while it is<br />\nlight and stand a watch in the darkness, and even guard through the night if the<br />\ncattle are anxious. Year-long convoys from Texas to Montana or even lower<br />\nCanada, without help of the railroad, are undertaken, but conditions against these<br />\ngain in. stringency.<br />\nThe cow-boy draws from $25 to $-10 each month for his irregular performance, whereas a farm-hand of the same region bends his back so long as<br />\nhe is awake, yet may not expect more than $16 in a similar length of time ; that<br />\nshows nearly the ratio of skill in the employments. Skill insures life in the cowboy's case as more spectacularly in the steeple-jack's. The cow-boy is often<br />\nunder discomfort, of weather, of lone vigil, of isolation ; his future is unstable,<br />\nexcept in most cases for a certainty that he will be laid off without wages during<br />\nthe bitter stretch of the year. Altogether one cannot judge him overpaid.<br />\nThe type of man may almost be deduced from the conditions given,—had<br />\nit not been often depicted with more gusto than discretion. Young blood finds<br />\nthe life good and in many instances grows to be old blood while the charm of it<br />\nstill hangs in the veins. One sees many middle-aged and stout cow-boys. Change<br />\nhas broken not a few traits of the country ; the six-shooter is no longer a habit,<br />\nunder the fines that now hedge about its possession ; and shortly as time goes, the<br />\ngreat free-handed ranches will disintegrate into small careful stock-farms. The<br />\nold-timers, lavish in their dealings with the world, find in each year a load of<br />\ndisappointment, but a reasonable half of the punchers, hacked by youth and<br />\nsteadied by ambition, have an eve to their doubtful prospects, and are at earnest<br />\nto make a \"stake\" in cattle. Indeed nowadays the \"Great Staked Plains,\" as a<br />\nR. '00,<br />\nname, has attained to much truth,<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n4<br />\n<br />\nTHE AMERICAN STATE.<br />\nF,DrrED<br />\n<br />\nBY PROFESSOR W. W.<br />\n<br />\nwILLouGit By.<br />\n<br />\nThe Century Company, of New York, is to publish a series of volumes under<br />\nthe general title Of \"The American State,\" which is to be edited by Dr. W. W.<br />\nWilloughby, Associate Professor of Political Science. The aim of the series is<br />\nto describe comprehensively the manner in which the governmental agencies of<br />\nthe American State, Federal, Commonwealth, and Local are now organized and<br />\nadministered. While the volumes shall be descriptive of actual conditions, incidentally they will aim to suggest the various constitutional and administrative<br />\nproblems that exist, and make manifest the essential considerations involved in<br />\ntheir settlement.<br />\nThe series will consist of eight volumes, as follows: The American Constitutional System; American Legislatures and Legislative M ethods ; The American<br />\nExecutive and Executive Methods ; TheAmerican Judicial System ; Territories<br />\nand Colonies ; Local Government in the United States ; City Government in the<br />\nUnited States; and Political Party Machinery.<br />\nIt will be observed, that as distinguished from many so-called \"series\" or<br />\n\"libraries,\" this set of volumes will constitute a logical wbole, that is, will be encyclopedic as regards the special field covered. Each volume, though complete<br />\nin itself will have its proper place with special reference to that fact.<br />\nThe first volume of the series, \"The American Constitutional System,\" the<br />\naim of which will be to furnish a general introduction to a study of the constitutional system of the American State, is to be prepared by Dr. Willoughby, who<br />\nexpects to publish his book before the end of the year. Four of the remaining<br />\nvolumes have already been provided for, and the editor hopes to have the entire<br />\nseries published by the end of 1904.<br />\n<br />\nNEW EDITOR OF JUVENAL.<br />\nThe edition of the satires of Juvenal, upon which Dr. H. L. Wilson has<br />\nbeen at work for several years, is to be issued from the press early in June.<br />\nThe book will consist of about 400 pages, and will contain a discussion of<br />\nRoman satire, the life of Juvenal, Juverial's style and place in literature, a history<br />\nof the text and a bibliography. Besides this there will be a complete text of the<br />\nauthor, including the recently discovered Bodleian fragments, the commentaries<br />\nand the index.<br />\nThe book is not only intended for undergraduate students, but also offers to<br />\nteachers and advanced students assistance for a more thorough study of the satires<br />\nand information as to the progress made in the interpretation of this author<br />\nduring the past ten years,<br />\n<br />\n\fTHE<br />\n<br />\nNEWS LETTER.<br />\n<br />\nTHE HULLABALOO CLUB FEED.<br />\nATURDAY night last, a feed was given in the Trophy Room by the \"Hullabaloo\" Club to the Junior Class. The occasion was celebrated by several impromptu \"'stunts\" in the cage, the most interesting being hurdle<br />\nraces, participated in by self-constituted sprinters, who, though more or less<br />\nstained by their race, were overshadowed by another and blacker race, two<br />\nchocolate representatives who indulged in a boxing bout. Jim \"also ran\" upon<br />\nthe scene to play the rubber, aml with a towel, circumscribed the dark circles<br />\nunder the eyes of the sluggers and smoothed their newly evoked facial ripples.<br />\nThus seeing the race problem summarily disposed of, both classes retired<br />\nto the Trophy Room, where they regaled themselves with tempting edibles,<br />\nliquidating their debts to the inner man with time draughts on their own high<br />\nspirits.<br />\nSecretary Addison announced from the bench that the following men had<br />\nbeen selected to compose the Board of Governors of the Club for the ensuing<br />\nyear: Messrs. Fuerbring-er, Erlanger, Stollenwerck, ll'earre, Buckler, Wayson,<br />\nHawkins, Louis, Branch and Foster.<br />\nThe Hullabaloo Club was organized by the Class of 1903 for the purpose<br />\nof promoting good-fellowship among its members. Its constitution, if conscientiously adhered to, will no doubt be the means of bringing the men closer together socially, and will do much towards fostering good will and disproving<br />\nthe no college life idea at Hopkins.<br />\nThe object of the organizers of the Club was to eliminate all politics from<br />\nit, there being no presidential office to be filled, the supervision of the business<br />\ndetails being vested in the Baord, assisted hy a Secretary and a Treasurer.<br />\nIf the requite amount of interest to render the organization successful is<br />\nshown, the Board of Governors may decide to ask the lower classes to identify<br />\nthemselves with the Club, and thus make it an undergraduate and not a class<br />\norganization.<br />\nThe Seniors are invited to attend the Field Night to be given by the Hopkins Club on Saturday, May 1,3rd. Dr. Welch will give a short talk, and refreshments will be served later.<br />\nOn last Thursday, the class in Minor Botany, under the charge of Dr. Barton and I\\1 r. Gudger, took a trip to Mt. Washington for the purpose of studying<br />\nthe flora.<br />\nThe University musical clubs made their last appearance of the year at the<br />\nconcert for the benefit of the Lawrence House Mission, given in conjunction with<br />\nthe Woman's College Musical Clubs on the night of May 9th. The attendance<br />\nwas large, and a considerable sum was turned over to the mission.<br />\nA committee from the Junior Class is making arrangements for a feed and a<br />\nsmoker at the close of the examinations.<br />\nThe minor geology class made a trip to the Luray Caves last week under the<br />\ncharge of Dr. Shattuck. They left Friday afternoon and returned Sundav morning. Those who went were Nelson, Winternitz, Riley and Bamberger.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\n<br />\nHOPKINS UNIVERSITY.<br />\nMAY 21, 1903.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editots,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10<br />\n<br />\nCents a single copy.<br />\n<br />\nGEORGE A. FOSTER, 1904.<br />\nRicoiNALD S. OPIE, 1904.<br />\n. C. A. NEAL, 1904.<br />\nH. V. MORSE, 1905.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\nRIGGIN BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to GEORGE A FosTxn, box 195, Johns Hop<br />\nkills University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ. H. U.; or box 398, Medical Department of the Johns Hopkins University.<br />\n<br />\nHE number of books that are being published by University men is worthy<br />\nof more than passing notice. Scarcely an issue of ME NEWS-LETTER<br />\nappears that does not contain an account of new books by Hopkins professors or alumni. This number conains two important announcements, one of the<br />\nnew edition of Juvenal, by Dr. Harry L. Wilson, and the other of the series, The<br />\nAmerican State, which is to be edited by Dr. W. W. Willoughby. Some time ago<br />\nTliv, NEws-LnuR contained a note to the effect that Prof. Wilson was preparing<br />\na new edition of Juvenal, but nothing definite was stated. Now, however, we are<br />\nable to speak more of this book, which has been eagerly awaited by scholars, and<br />\nwhich bids fair to fulfil all that is expected of it. We are informed by competent<br />\nauthority that Dr. Wilson's work is the most thorough edition of the Latin<br />\nSatirist ever published in this country, and will probably at once become the<br />\nauthority. The series of the American State, to be edited by Dr. Willoughby,<br />\nwill be one of the most important contributions to Political Science that has been<br />\nissued for some time. While all the volumes have not yet been assigned to<br />\nwriters, it is probably that a majority of them will be written by Hopkins men,<br />\nsince the part they have taken in advanced economic work is great. The publication of these books indicates that the spirit of creative intellectuality at the 'University is as vigorous as ever.<br />\n<br />\nt<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\nt<br />\n<br />\nHE 1903 \"Hullabaloo,\" of which the first edition, so to speak, was issued<br />\n. last Monday, is, in many respects, the best year-book which has been<br />\nbrought out since the introduction of this time-honored custom of Hopkins<br />\nundergraduate life. The approval shown by every one who has bought a copy is<br />\nthe best proof of the fact that the book is up to the expectations of the most<br />\ncritical. The neatness and fullness of the book, and the almost total absence of<br />\nthe ordinary typographical errors, indicate the long and careful work of a comtetent board of editors.<br />\nThe features which seem to arouse the most interest and cause the most<br />\nlaughter, are the \"stunts\" and the \"grinds\" on members of the Senior class. The<br />\n\"Hullabaloo Intelligence Office\" could not be improved upon. The virtues and<br />\nvices of each man are taken off in an extremely outspoken way. The class<br />\nopinions are original, interesting and comprehensive. The result of the class vote<br />\non the handsomest man doubtless caused much sorrow.<br />\nThe pictures are excellent. The color drawing is particularly dainty and<br />\nThey,<br />\nattractive. The drawings by prominent artists speak for themselves.<br />\nhowever, have the disadvantage that the .woman experienced when she carried a<br />\nnew Venus de Milo into her slightly shabby parlor. Everything else looked<br />\nsmall in comparison, even things which, not subjected to such invidious parallels,<br />\nwould stand well on their own smaller merits in their own smaller way. This<br />\ngives the book a species of unevenness, which, however, easily gives away to<br />\nfascination when we take any detail by itself.<br />\nThe various departments of the l Tniversity are arranged in a pleasing and<br />\nthorough manner, particularly \"\\thletics. The \"Songs of johns Hopkins\" are<br />\nalso a good point about the book.<br />\nIn conclusion, the following criticism might, perhaps, be made. The 1903<br />\n\"Hullabaloo\" is hardly, as the editors jokingly claim, \"truly representative of<br />\nthe l'niversity,\" as it has to do wholly with the Senior class. We venture this<br />\nless as a criticism than as a suggestion to future \"Hullabaloos.\"<br />\n<br />\nHE next issue of Tin.: Nrows-I,ImER, the last for the academic year, willl be<br />\nthe usual commencement number. In a compact form it will aim to give<br />\na summary of what the i Tniversity students have done during the past<br />\nYear. There will be pictures of the different athletic teams, and reviews of the<br />\nwork done by them during the year will be given by their respective captains.<br />\nIn order that all departments may be represented, there will be photographs of<br />\nTHE NEws-LwrTER and \"Hullabaloo\" boards, together with an account of these<br />\npublications and suggestions for the future, by one who has been prominent in<br />\nboth. What the members of 1903 have done 'in the University, Athletic and<br />\nClass affairs during their college days, together with their plans for the future,<br />\nand portraits of the more prominent men will be one of the features.<br />\n<br />\nt<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n'11,,p11<br />\n<br />\n'I AMI<br />\n<br />\nmi II<br />\n<br />\nIn I I iII<br />\n<br />\nii<br />\n<br />\nIIl ill) 1111 111 1 1 11111111111111111111111111111111 11 11<br />\n•<br />\n<br />\n.•<br />\n<br />\n1002.9,„„2.,22<br />\n1111111111111111111191<br />\n<br />\n717-) 11111111111111111111111111111111101111111111111111111111011111111111111111(111111111111111111111111111111111111111111111111111111,71.7fadigIM<br />\n<br />\nDr. W. S. Thayer formally opened the annual session of the American<br />\nMedical Association, held in New Orleans. Dr. Welch read a paper on \"Sources<br />\nand. Manner of Infection of Typhoid Fever. He further introduced a resolution,<br />\nwhich was carried, that the Association urge President Roosevelt to name a reputable medical man on the isthmian Canal Commission, in view of the dangers<br />\narising from the unsanitary region through which the canal will be cut.<br />\nDr. William H. Tolman, director of the American Institute of Social Service,<br />\nlectured in McCoy Hall on ''The Problem of the City Child.\" The lecture was<br />\nin the interest of the Lawrence House, and was illustrated with many lantern<br />\nslides.<br />\nDean Edward H. Griffin will .deliver the address to the graduating class of<br />\nthe Maryland College for Women, Lutherville, on Tuesday, June 2.<br />\nDr. John M. Vincent attended the anniversary exercises of Oberlin College,<br />\nheld last week.<br />\nDr. Remsen has been appointed a member of the committee to consider<br />\nmeans of preserving the Declaration of Independence, which is fading to such an<br />\nextent that the names of the signers are scarcely discernible.<br />\nMr. Henry J. Bowdoin, '81, has been elected one of the trustees of the<br />\nUniversity. After graduating here, Mr. Bowdoin studied law. He is the first<br />\ngraduate of the University to be elected a trustee.<br />\nDr. J. H. Hollander delivered an address on \"Socialism,\" before the Baltimore Typographical l'nion, No. 12, at Hazazer's Hall, on the 10th. A discussion followed, in which Drs. Gould and :Franklin took an active part.<br />\nPresident Remsen took a prominent part in the dedication exercises at Tome<br />\nInstitute. Other Hopkins men in attendance were Dean Griffin and Dr. B. C.<br />\nSteiner.<br />\nDr. Jacob H...Hollander, who had been asked to go as a special United States<br />\nCommissioner to the Philippines for the purpose of supervising the establishment<br />\nof the gold-standard currency system there, has declined the appointment on<br />\naccount of press of other work.<br />\nMr. J. H. Moore, a graduate student in physics, has accepted the position<br />\nof observer in the Lick Observatory. The place has just been vacated by Dr.<br />\nHerbert M. Reese, a former Hopkins man.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n9<br />\n<br />\nPresident-Emeritus Gilman and Dr. W. H. Welch are interested in the movement to have a monument erected to the memory of the late Major Walter Reed.<br />\nAt the annual meeting of the managing committee of the American School<br />\nin Rome, which is maintained by the Archaeological Institute of America, with<br />\nthe co-operation of several American universities, Dr. Harry I,. Wilson was appointed professor in Latin for the year 1905-06. It will be remembered . that<br />\n.Professor Mintor Warren, formerly of the University, was sent to Rome as the<br />\ndirector of the American School in 1896.<br />\nA large party of members of the graduate department of biology will spend<br />\nthe summer months in special research work at the Marine Biological Laboratory at Beaufort, N. C. Among them are Messrs. D. H. Tennent, R. P. Cowles,<br />\nand Samuel Rittenhouse. Mr. Olin F. Shreeve, who is at present in Jamaica,<br />\nwith Dr. Johnson, of the Ilotanical department of the University, will also join<br />\nthe party on his return. Mr. S. H. Derickson, another member of the department, will accompany the expedition of the Geographical Society of Baltimore,<br />\nwhich will leave for the Bahamas on J tine Gth. He will have charge of the biological work of the expedition. The biological laboratory at Beaufort, which is<br />\nconducted under the management of the United States Fish Commission, will<br />\nbe under the directorship this year of Dr. Caswell Grave.<br />\nThe board of collegiate adv'sers has recommended the following men to be<br />\ncandidates at the en( of this season for the degree of doctor of pliTisophy<br />\nPhilip Warner Harry, Pylesville, M d. ; I knjamin Franklin Carver, Hanover, Pa. ; Rev. John P. Cooney, S. J., Loyola College; William Elford Gould.<br />\nBaltimore ; Alfred James Morrison, Varmville, Va.; Albert Johannsen, Fremont,<br />\nNeb. ; John Gale Hun, Albany, N. Y. Philip Howard Edwards, Pikesville ;<br />\nLeRoy Carr Barrett, Richmond, Mo.; Atherton Seidel', Atlanta, Ga.; Elbert jay<br />\nBenton, Holton, Kan.; .Yukimasa Hutton, Sagaken, Japan; George Olaf Berg,<br />\nSacred Heart, Minn.; john David Rodeffer, Lorettsville, Va.; George Wiles Middlekauf, Leitersburg, Md.; Joseph Haines Moore, Wilmington, Ohio ; Charles<br />\nKeyser fi'idinunds, Baltimore ; Arthur Whitmore Smith, Andover, Mass.; Charles<br />\nA. Savage, Minneapolis: Thomas M. Jones, Ashland, Va. ; Frank Critchlow,<br />\nPrinceton, N. J. ; Roland J. M ul)lord„ Country School, Baltimore ; Henry A. Converse, Harrisonburg, Va.; Lee Raney, Danville, Ky.<br />\n<br />\nThe oyster spat upon the rock,<br />\n(I know that this seems very queer,<br />\nBut wait till I explain, my dear),<br />\nHad settled down for life.<br />\nIf spat was here, the past of spit,<br />\nTrust me, I'd not have mentioned it.<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS LETTER.<br />\nALUMNI NOTES.<br />\n<br />\n'93<br />\n<br />\nThe engagement is announced of Charles B. Penrose jr., to Mrs. Delano<br />\nAmes, of Baltimore.<br />\n,98 Thos. J. Fitzgerald, Jr., has been elected General Manager of the Lexington (Ky.) Street Railways.<br />\n,99 Karl jungbluth, jr., was married to Miss Amelia Cowling, of Louisville,<br />\non April 21st.<br />\nCharles Vogeler is now in business at Pittsburg.<br />\n'01<br />\nThe engagement is announced of Dr. Nathan Winslow, who is now one<br />\n'00<br />\nof the surgical staff of the University of Maryland Hospital, to Miss Margaret<br />\nMassey, of Virginia.<br />\nAt the National Conference of Charities and Cofrections, held in Atlanta last<br />\nwcek, Dr. Jeffrey R. Brackett was elected president of the Association.<br />\n'97 Warfield T. Longcope, Pathologist at the University Hospital, Philadelphia, spent several days in the city last week.<br />\nA number of members of the class of '98 of the Medical School, who were<br />\non their way to Washington to attend the Congress NI American Physicians and<br />\nSurgeons, gathered at the Carrollton Hotel on May I I th, and held an informal<br />\nAmong those present were: Prs. Emma E. Walker,<br />\nreunion and banquet.<br />\nThomas W. Hastings, of New York ; William W. Ford, of Montreal; Alfred B.<br />\nI lerrick, of Washington ; Roger G. Perkins, of Cleveland; Joseph H. l'ratt, of<br />\nBoston; Walter R. Steiner, of Hartford, Conn.; William S. Baer, James H. M.<br />\nKnox, Jr., Harry T. NI arshall, Percy.. M. Dawson, of Baltimore.<br />\nDr. Robert N. Hartman, who took his Ph. D. here in 1894, in chemistry,<br />\nwas accidently killed in the laboratory of the Colorado State School of Mines by<br />\nhydrogen sulphide gas. He was professor in chemistry at that institution at the<br />\ntime of his death.<br />\n'94 Robert A. Dobbin was married on Thursday, \\pril 30th, to Miss Marie<br />\nKerr Hemsley.<br />\n<br />\nAmong the undergraduates who are going abroad this summer, are Bevan<br />\nand Plaggemeyer, '03, who will sail from New York on the 13th of next month.<br />\nThey will spend several weeks in Italy, after which they will travel through Europe, not neglecting to visit Monte Carlo and Paris. The latter part of August<br />\nand September will be passed at Oxford, where they will take a special course in<br />\nSocial Economics. Strauss, '03, and Erlanger, 'Oh, leave on June 11th, for a<br />\nthree months' trip, during which time they will \"do\" the Continent generally. R.<br />\nCurzon Hoffman, jr., '03, will depart from New York for an European trip, on<br />\nWednesday, June 10th. He will be absent three or four months, which time will<br />\nAlan Dill, '05, will probably go<br />\nbe spent in England and on the Continent.<br />\nabroad with his father.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n11<br />\n<br />\nLACROSSE.<br />\n<br />\nJ. H. U., 3—Crescents, 10.<br />\n0N May 9th, before several thousand spectators, the Hopkins lacrosse team<br />\nsuffered its first defeat of the season in the game against the Crescent<br />\nAthletic Club, of Brooklyn, the score being 10 to 3. The ,game was one<br />\nof the nu.)st scientific exhibitions of lacrosse ever seen in Baltimore ; but most of<br />\nthe science was on the side of the visitors. The 'Varsity did not seem to play up<br />\nto its usual standard, for its work appeared tame in comparison with that of its<br />\nopponents, who played the real Canadian game. It was not poor playing, however, that lost for the 1.Tniversity, but superior playing by the Crescents. In<br />\nevery point of the game Hopkins was clearly outclassed. The weight of the<br />\nCrescent players averaged far more than that of the Hopkins men, and their<br />\nbody checking was in consequence something terrible.<br />\nThe passing of the<br />\nchampions was faultless, and it was only through the fastest kind of work on<br />\nthe part of the defense that plays were broken up. The defeat, however, is by<br />\nno means an inglorious one, for the victors are all star players. They are the<br />\npick of some of the best teams in the country, and have been playing lacrosse<br />\nfor years; therefore it was expected that they would be victorious over the 'Varsity.<br />\nHopkins defense certainly played a fine article of lacrosse at times, and if<br />\nthey could have struck their gait sooner, the Crescents could not have rolled up<br />\nten goals. The body checking of Tough was very effective all through the game<br />\nin breaking up plays, and from the latter part of the first half to the close of the<br />\ngame, Bland( also brought in his weight for some splendid work. On the Hopkins attack, Abercrombie did by far the best work. This is the first game in<br />\nwhich he has been allowed to play during this year, owing to the four-year-limit<br />\nrule, and the great player •hears comparison with any on either team. If the<br />\nother attack men had some of the confidence with which he plays, Hopkins would<br />\nhave made more goals.<br />\nHopkins got the ball at the start, and passed it down toward the net. Near<br />\nthe posts Liffton obtained the ball, then passed it to Simpson, who threw to<br />\nCurry, who in turn had almost a clear field, as the defense was too late in covering up, and he threw the first goal within a minute from the time the game<br />\ncommenced. Again the ball went rapidly down to Hopkins territory, and an<br />\n<br />\n\fTHE NEWS LETTER..<br />\nattempt was made at goal, but Schmeisser blocked it with his body. In the scrimmage that followed, Lindsay obtained the ball and shot the second goal. Within<br />\nthe next twenty minutes some fine playing was seen. The 'Varsity had apparently recovered from its nervous spell and now settled down to business. The<br />\nball was passed to Curry, who made a pretty run through his opponents right<br />\nup to the post. Just as he was about to shoot, Blanck struck him with his body,<br />\nand knocked the ball out of his stick. The ball was thrown down the field to<br />\nRosenheim, who passed to Bird, and by Bird to Matthai. Matthai threw it to<br />\nPutts, who attempted goal. Everyone thought a goal was sure, but their hopes<br />\nwere dashed to the ground when Dr. Rose made a fine stop. For some time the<br />\nball was kept near the Crescents' goal. The•game was now on in earnest. Hopkins worked hard to put the sphere between the posts, and several attempts were<br />\nmade. The ball passed from side to side. Several times P. Straus was called<br />\nupon to make difficult stops, and each, time he was right there.<br />\nIt was during this playing that the Hopkins players scored their first goal.<br />\nBird got the ball and passed to Rosenheim, who threw to liernheini. Beruheim<br />\ndodged his opponents and placed the ball in the net. About three minutes later<br />\nCrescent increased her lead to three. After some more see-saw playing, the<br />\nhalf ended with the ball near Hopkins' goal.<br />\nIn the first part of the second half, Crescent took Hopkins' nerve completely,<br />\nby making six goals, each about two minutes apart. After this the locals commenced to cover up more, and the result was a decided brace. From the time<br />\nCrescent made her ninth goal to the close, Hopkins played by far the best of<br />\nany time during the game. The whole attack got together and kept the ball most<br />\nof the time in Crescent territory. Such playing could not fail to bring its reward, and Hopkins scored two more goals to Crescent's one. The game ended<br />\nwith the ball in the middle of the field.<br />\nThe Hopkins line-up was: Putts, in-home ; Bernheim, out-home ; Rosenheim,<br />\nfirst attack ; Abercrombie, second attack ; Bird, third attack ; Matthai, center ;<br />\nTough, third defense ; Custis, second defense ; H. Straus, (captain) first defense ;<br />\nIlanck, cover point ; Schmeisser, point ; P. Straus, goal.<br />\n<br />\nDUAL MEET WITH VIRGINIA.<br />\n<br />\nIll-i', season of the track and field team practically closed on Thursday, May<br />\n7th, when in the presence of a large crowd of faithful rooters, the Hopkins squad gained a decided victory over the athletes from the University<br />\nof Virginia. This meet made a sort of \"garrison\" finish, forming a fitting climax<br />\nto a successful season's work. In the eleven events, Hopkins won 8 firsts and<br />\n5 seconds, thus getting 55 points, as against the 33 of Virginia. It looked at first<br />\nas if everything was coming our way, but later Virginia got together and suc-<br />\n<br />\nt<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n13<br />\n<br />\nceeded in making their presence felt. Disregarding results as shown by the summary,. the visitors need feel in no way dissatisfied with their performance; it was<br />\nsimply a case of \"when Greek meets Greek,\" in which Hopkins proved to be the<br />\nbetter Gre,ek ; a .case of a good man losing to a better one in a hard struggle.<br />\nAside from this meet being peculiarly satisfactory to Hopkins enthusiasts,<br />\nit was of much interest from a purely athletic point of view, in that State records<br />\nwere broken so often that the novelty of it was beginning to wear off. First<br />\nindividual honors were carried off by H. K. Tootle, who won both the 100 yard<br />\nand the 220 yard dashes, in each case lowering the State records of 10 1-5 and<br />\n23 seconds respectively, by covering the distances in 10 and 22 flat. The world's<br />\nrecords are 9 3-5 seconds for the 100 yards, held by Arthur F. Duffy, and 21 1-5<br />\nseconds for the 220 yards, held by B. J. Wefers. J. A. Freese established records<br />\nfor the 120 yard high hurdle and 220 yard low hurdle, his time being 17 2-5 and<br />\n27 seconds respectively. In the quarter mile run, Captain Shelton, of Virginia,<br />\nlowered the State record of 51 2-5 seconds, formerly held by England, to 51 1-5<br />\nseconds. Besides these, the pole vault was won quite handily by T. W. Emig,<br />\nwho, although entered before in several indoor events, had never specially distinguished himself. His victory came quite as a welcome surprise, and shows talent<br />\nthat has previously been too little regarded. After winning with a jump of 9<br />\nfeet, 11 1-4 inches, Emig endeavored to break the State record of 10 feet, 1 inch,<br />\nand (lid successfully clear the bar at 10 feet, 2 1-1 inches, but his pole afterward<br />\nknocked the bar down.<br />\nThe good work for Hopkins began with the 1.00 yard dash and continued with<br />\nfew interruptions until the end. All four (lashes were hotly contested, but ,Hopkins won out in each, through the instrumentality of Tootle and Freese. In the<br />\n1,10 yard run, Shelton and Bass, of Virginia, had the lead till near the finish.<br />\nwhen Captain Hoffman, by a beautiful sprint, passed Bass and ended in second<br />\nplace. The surprise of the afternoon, however, came in the mile run. Grant,<br />\nof Virginia, gave out about. GOO yards from the tape, while Tyree lacked about<br />\nhalf that distance of finishing. The race then narrowed down to the two freshmen, Morse and ,Campbell, was a contest to decide to whom the \"H\" was to be<br />\nawarded. With not more than a foot separating them, Morse crossed the tape in<br />\nthe lead. Hopkins clearly showed her superority in the dashes and in the long<br />\ndistance run of one •mile, but had to give the palm to Virginia for the distances<br />\nof 440 and 880 yards. The summary of events was as follows:<br />\nroo Yard Dash—H. K. Tootle, j. IT. U., first: S. P. Bass, Va., second. E.<br />\nL. Passagno, J. H. U., and A. P. Gray, Va., also ran. Time 10 seconds.<br />\n220 Yard Dash—H. K. Tootle, J. H. 11,, first; S. P. Bass, Va., second. A.<br />\nP. Gray, Va., and F. R. V. Williams also ran. Time 22 seconds.<br />\n4,io Yard Run—j. H. Shelton, Va., first ; R. C. Hoffman, j. H. 1.11, second.<br />\nS. P. Bass, Va., and J. T. V.ngland, J. H. V., also ran. Time Si 1-5 seconds.<br />\n880 Yard Ritn—R. E. McCabe, Va., first ; H. Beine, Va., second. R. G.<br />\nGoodenow and C. L. Stone, j. 11. l'., also ran. Time 2.1.3 2-5.<br />\nRun—}1. V. Morse, J. H. U., first: T. Campbell, second. W. R. Tyree<br />\nand C. Grant, Va., also ran. Time 5.05 3-5.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS L.ETT.ER.<br />\n<br />\n120 Yard High Hurdle—J. A. Freese, J. H. U., first; C. Grant, Va., second.<br />\nTime 17 2-5 seconds.<br />\n220 Yard Low Hurdle—J. A. Freese, J. H. -U., first; L. Knight, P. II. U.,<br />\nsecond. 0. C. Shaner and W. E. 110110day, Va., also ran. Time 2.; seconds.<br />\nRunning High Jump—C. B. Scholl, J. H. U., first, 5 feet, 8 inches; J. Russel, Va., second, 5 feet 0 inches. G. B. Dawson, J. H. U., and W. E Holloday,<br />\nVa., also jumped.<br />\nRunning Broad Jump—E. L. l'essagno, J. H. U., first, 21 feet, 9 inches;<br />\nG. B. Scholl, J. H. U., second, 20 feet, 3 inches. J. Russell, Va., also jumped.<br />\n16-Pound Shot Put—W. W. Council, Va., first, 38 feet,<br />\ninches; H.<br />\nB. Stone, J. H. U., second, 30 feet, 1 inch.<br />\nPole Vault—j. W. Emig, J. 11. U., first, 9 feet, 11 4 inches; J. Russell,<br />\nVa., second, 9 feet, 5% inches.<br />\nAlthough only one event was run off at a time, each one was interesting<br />\nthroughout, owing to the limited number of starters.<br />\nIt will probably be a matter of interest to Hopkins men to learn that the<br />\nL'niversities of Virginia and of North Carolina held a dual meet at Charlottesville, on May 15th, and that out of 13 events, Virginia won 8 firsts and 4 seconds,<br />\nwith another ending in a tie, thus giving Virginia 56, points as compared with<br />\n15 of North Carolina. From these results we can readily conjecture what Hopkins could do to the University of North Carolim.<br />\n•<br />\n<br />\nY. M. C. A. NOTES<br />\n<br />\nThe Association at the University of Illinois has been doing- splendid work<br />\nthis )'ear. They have had 355 men enrolled in voluntary Bible Classes, and a<br />\nband of 21 volunteers for Foreign Missionary service, of whom 12 have been enrolled since the close of last college year.<br />\nThe May Intercollegian publishes an interesting list of names of 211 student<br />\nvolunteers who have sailed for Foreign Missionary work since March, 1902.<br />\nIt is interesting to note that the largest number is to China, where they are needed<br />\nto take the places of those killed during the Boxer uprising.<br />\nThe prospect for a strong and interesting conference at Northfield this summer, June 20th to July 5th, is very good. The names and number of speakers<br />\nis very strong and one of the latest additions is that of Rev. R. j. Campbell, of<br />\nthe City Temple, London, England. One promised improvement in camp is a<br />\n\"rustic lodge,\" with reading room. Other institutions will have large delegations<br />\nand Hopkins must be well represented. Information can be had from the General<br />\nSecretary, or from any member of the committee. Circulars are on the Secretary's desk in Levering Hall. This is the best possible opportunity to get acquainted with men of other institutions. The whole life and tone of the c'imp and<br />\nconference is very high and calls out the best there is in a man.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n15<br />\n<br />\nProf. H. 14. Wilson, as president of our Association, attended the conference<br />\nof Presidents of College Associations for the East, at Harvard, April 16-18.<br />\nNinety delegates from forty-four institutions of New England, New York, New<br />\nJersey and Maryland, and the professional schools of Philadelphia were present.<br />\nMr. L. S. Morgan represented Hopkins Medical School Association. Very profitable and interesting sessions were held. Dr. Alexander McKenzie addressed<br />\nthe closing meeting on Sunday evening and deepened the impression made by<br />\nthe rest of the conference of the absolute necessity for \"a life hid with Christ in<br />\nGod,\" if the men are to represent their Master among their fellow-students.<br />\n<br />\nBALT1M ORE, MD., U. S. A., May 18th, 1903.<br />\nEditor THE; Nvms-I41iTTER,<br />\nJohns Hopkins University, Baltimore.<br />\nMAR SIR:—T hand you herewith statement of receipts and expenses connected with the trip of the debating team to the University of North Carolina.<br />\nThe items have been examined and approved as correct. I shall be obliged if<br />\nyou will publish the account in your next issue, as I believe that the fullest publicity should be given to matters of this kind.<br />\nSincerely,<br />\nGuy CARLETON LEE.<br />\nEx Pli.',NSP: ACCOUNT ot: nv;BATLNG 'rEAm oP 1903.<br />\n[Trip to the University of North Carolina.]<br />\nReceipts:<br />\nExpenditures:<br />\nFrom Faculty.<br />\n$ 29.00<br />\nTransportation<br />\n$ 61.50<br />\nFrom Seniors<br />\n29.75<br />\nPullman<br />\n10.00<br />\nFrom Juniors<br />\n15.00<br />\nMeals en route<br />\n8.75<br />\nFrom Freshmen<br />\n5.75<br />\n$ 80.25<br />\nTotal<br />\nTotal<br />\nReceipts<br />\n$ 79.50<br />\n79.80<br />\nDeficit<br />\nPaid by friend<br />\n<br />\nRodney was his mother's angel,<br />\nHe would sit and watch her paint ;<br />\nMamma's darling licked the brush dry,<br />\nRodney's still a little saint.<br />\n<br />\nA man to whom illness was chronic,<br />\nWhen told that he needed a tonic,<br />\nSaid, \"Oh, Doctor, dear,<br />\nWon't you please make it beer?\"<br />\n\"No, no,\" said the Doc, \"that's Teutonic.\"—Tiger.<br />\n<br />\n.75<br />\n.75<br />\n<br />\n\fI6<br />\n<br />\nTHE NEWS LETTER.<br />\nTHE SEEKER.<br />\nA traveler journeyed o'er the hills,<br />\nSeeking, seeking ever;<br />\nThrough the valleys, cross the hills,<br />\nResting never, never.<br />\n\"Oh weary man what urges thee?<br />\nPause and rest awhile.\"<br />\n\"Nay,\" he said, \"it cannot be,\"<br />\nWith a wistful smile.<br />\n\"Oh restless rover, seekest thou<br />\nSome cherished ideal?<br />\nlluck it from thy heart and brow<br />\nNow before the real.\"<br />\n\"Nay, nay,\" he sadly shook his head,<br />\nliast'ning with the day,<br />\n\"I must ever seek,\" he said,<br />\n\"O'er the hills away.\"<br />\n<br />\nA man died on the gallows here,<br />\nIn agony intense;<br />\nHe said he did not care so much,<br />\nExcept for the suspense.<br />\n<br />\nWillie fell in the molasses<br />\nBarrel, in the shed.<br />\n\"Now I'll lick you, Willie,\"<br />\nHis angry ITH)ther said.— 11idoz'.<br />\n<br />\nAs the umpire shouted \"three balls,\" the batsman started guiltily. -This<br />\nisn't the first time I've raised something on a diamond,\" he muttered, as he hit<br />\nthe next one and knocked a pop-fly to the pitcher.—Tigcr.<br />\nMary had a little lamb<br />\nThat tried to kx.)p the loop.<br />\nNow Mary has her little lamb<br />\nConverted into soup.—Tiger.<br />\n<br />\n\fOPEN ALL NIGHT.<br />\n<br />\nWILLIAXSON & WATTS,<br />\nErui<br />\n<br />\n%toresac,,<br />\n<br />\nHoward and Franklin Streets.<br />\n<br />\nBaltimore and Eutaw Streets.<br />\n<br />\nEirttoo, ffancv Goats. Verfumerr, trotlet Brttcles, Ci41art3, Sam 11.7.11ater.<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\n<br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT et. CO.,<br />\n704 MADISON AVE.<br />\n<br />\nC. & P.'Phone 3350-Y.4111<br />\n<br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying instruments,<br />\nDraughtsmen's and Engineers' Supplies_<br />\nN. W.Corner<br />\nLexington and Liberty Sts.<br />\n<br />\nBAL,TiM01-2E, MD<br />\n<br />\nAgent for Nenffel cf. Esser. Co., o ..111<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\n<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nHenderson s<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks. Note Books,<br />\nStud on t<br />\nSupplies.<br />\n<br />\nMadison & Howard Sts.<br />\n<br />\nIncorporated 18'78.<br />\n<br />\n\"Ars Steong as the SteonAest.\"<br />\n<br />\nPIE FIDELITY MUTURL LIFE INSUIVINGE<br />\nOF PI-VILFI.DEL,Pf+IFV.<br />\nAN EX°ELLEN T 0P PORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during',vacation or permanently.<br />\nFor Agency in Maryland or West Virginia,<br />\n<br />\nAddress,<br />\nU. GRAHAM, Manager<br />\n800-8 Merchants Bank Bldg , Baltimore, Mdi<br />\n<br />\nFor Advertising Space in this Paper<br />\nAPPLY To<br />\n<br />\n(<br />\n<br />\n,,m-peepe/(4.&m<br />\nPUBLISHERS.<br />\n<br />\nN<br />\n<br />\nCOP<br />\n<br />\nHALT\"vor C NQI:111:,!,<br />\n01,,r.<br />\n<br />\n11<br />\nA,<br />\n<br />\nBAIMOREAD.<br />\n<br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br />\n<br />\n7111<br />\n<br />\n700 Park Ave<br />\nNew York<br />\n<br />\n10 IT L L Y Equipped for<br />\nScholatly and Practical<br />\nwork, in the midst of the<br />\nItrisilan enterprises of a<br />\ngreat city,in close academic<br />\nrelations with Columbia and<br />\nNew York Universities, offers opportunities for the<br />\ndegrees of N. D., A. M. and<br />\nPh. D.<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nI odies.<br />\nSIXTY - EIGHTH YEfiR<br />\nbegins September 23, 1903.<br />\nAddress the President of<br />\nthe Faculty, the<br />\nRev. Charles 0. Hall, D. D.<br />\n<br />\n\fCapital $300,000. Surplus NI UridivInd Pion $400 000<br />\n<br />\nSTIEFF PIANOS<br />\nMADE OF<br />\n<br />\nTine 11141.4T MATERIALS MONEY<br />\n<br />\nAND FIII.MICIENCE CAN<br />\n<br />\nDrovers sc<br />\n<br />\nWwituraoomsi 0<br />\n<br />\nN. lAIIIERTY<br />\n<br />\nBooksellers and<br />\n8tationcrs.<br />\n34 W. WILEMORE STREET.<br />\n<br />\nGUSHING St GOMPANY<br />\n<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\n<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\nCollege of Baltimore.<br />\nSTATIONBRY — For School, Family, Office and Bank.<br />\n<br />\nBALTIMORE.<br />\n<br />\nL. Strouse, Vice-Prest.<br />\nEdw. P. Hayden. Ass't Cashisr.<br />\n<br />\njuts. Clark, Prost<br />\nChas. S. Miller, Cashier.<br />\n<br />\nft General Banking<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nOn Bale The J. 11. U. Pennants. and all other College<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE Sr.<br />\nA H. FETTING,<br />\nGreek ILetter ffraternitv jeweIrp,<br />\nMANUFACTUMCM<br />\n<br />\nBALTIMORE, MD.<br />\n'Malin<br />\n<br />\nCall lino<br />\n<br />\nRecounts Solicited.<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LFHMAN 6. SON.<br />\nFOR<br />\n<br />\nJORDAN STABLER GO,,A7NstSrAtvE.<br />\nof<br />\nSample<br />\n<br />\nubmitted<br />\n<br />\nFrench Brandy—no adulterants,no coloring, tine quality<br />\nOporto Fort-absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterates, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlivethl—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices-11U adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br />\n<br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br />\n<br />\nOF<br />\n<br />\n14 A:11:1 16 ST. PAUL STREET,<br />\n<br />\nBUSIIIIMS Transacted.<br />\n<br />\nSafe Deposit Boxes for. Rent<br />\nfrom 4.11 p, r year and upward.<br />\n<br />\nReads as follows:<br />\n<br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nINOMMEMINIMMEMMEMEM Hosiery, etc.<br />\nSHIRTSTO ORDER A SPECIALTY.<br />\n<br />\nNati Bank,<br />\n<br />\nMechanics<br />\nOF<br />\n<br />\nJILT'S%<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br />\n<br />\nExamine our %lac Zefore 'Purchasing.<br />\nC.& 0. telephone<br />\n<br />\nJENNINGS & HORSEY.<br />\nMERCHANT TAILORS,<br />\n<br />\n21 W. FAY virpi.:<br />\n<br />\nSP-rit lc Err.<br />\n<br />\n445'.<br />\n<br />\nLibraries arranged and put in<br />\n*r<br />\n<br />\norder without removal.<br />\n<br />\nñ. RUZICKA<br />\nBoo/binder,<br />\n<br />\nBOOKS!! 1<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br />\n<br />\nPIPPEN'S 1300K STORE,<br />\n605 N. EUTRAN ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store,<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nWARNER & CO.<br />\nUMBRELLAS, HATTERS, CANES,<br />\nAgents for Lincoln & Bennett and<br />\n<br />\neTcr<br />\n<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 406<br />\n<br />\nHopkins Caps<br />\n<br />\nGO.<br />\nS.<br />\nS.<br />\nLLOYD<br />\nN<br />\nNORTH GERMA<br />\nGABIN PASSAGE AT LOW RATES.<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBfiLTIMORE TO BREMEN DIRECT.<br />\n<br />\nSGHUMAGHER Sc GO., General Agents.<br />\n<br />\nFor particulars apple to<br />\n<br />\n.<br />\n,<br />\n.JAS. MCIKLIC. VioE-P' 1<br />\nISAAC H. DIXON, Pmts<br />\nJAS. R. RICHARDS, TREAS.<br />\n<br />\nTHE<br />\n<br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Howard St.,<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSmith, Dixon Co.<br />\n..1Papet..<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VII, No. 15<br /><br />\nMay 21, 1903<br /><br />\nTHE<br /><br />\nNEWS<br /><br />\nelh T ,FTT1<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nR<br /><br />\nThe Johns Hopkins Press.<br /><br />\nThe Johns tiopkins Universitu<br />\nBALTIMORE, MARYLAND.<br />\n1.<br /><br />\nTWENTY-SEVENTH YEAR.<br />\nBeginning October 1, teoz.<br />\nPresident: lnA Rummy. Dean of the Medical Faculty:<br />\nWILLIAM H. How Ebb. Dean of the College Faculty:<br />\nEDWARD H. GuirriN.<br /><br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br /><br />\nFOR UNDERGRADUATES:<br />\n(c) As candidates for the degree of II. A.<br />\n(d) As special students.<br /><br />\nlimerican Chemical 3ournal.<br />\nI. RENSEN, Editor Monthly. 8vo. Volume<br />\nXXIX in progress. $5 per volume.<br />\n111. IlmeriCan 3ournal Of ip btlolocrO•<br />\nII. L. G I LDERSLEE V E, Editor. Quarterly. tivo<br />\nVolume XXIII in progress. $3 per volume.<br /><br />\nLaboratories.<br /><br />\nDirectors.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nClinical Medicine.<br /><br />\nIra Remseli.<br />\nJoseph S. Ames.<br />\nWitiinM B. Clark.<br />\nWilliam, K. Brooks.<br />\nFranklin P. Mall.<br />\nWilliam. H. Howell.<br />\nWiltiam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nWilliam Oster.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nEconomics.<br />\nMathematics.<br />\nPhysics.'<br /><br />\nDirectors.<br />\nMosil I,. Gildersleeve.<br />\nK rig/<br />\n111(1 Ii rive. 11100Infteld.<br />\nPith I Uri opt.<br /><br />\nHenry Wood.<br />\nA. Marshall<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\n.1. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. times.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nGroups.<br />\n1. classical<br />\n(the \"ol(1 college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading unto medicine).<br />\n4. Geological-Biological.<br />\n6. Latin-Mathematical.<br />\n6. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican Journal of Mathematics(vol. XXV).<br />\nAmerican Chemical Journal (vol. XXIX).<br />\nAmerlean Journal of Philology (vol XXIII).<br />\nStudies in Historical and Political Science (vol. XXI).<br />\nModern Language Notes(vol. XVIII).<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A sayriology (vol. IV).<br />\nTerrestrial Magnetism (vol VII).<br />\nUniversity Circulars (vol. XXII).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the department<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application tithe Registrar.<br /><br />\n8vo.,<br /><br />\n111/.<br /><br />\nStables from the 18tologieal laboratory.<br />\nVolume V complete. $5 per volinne.1<br /><br />\n1P.<br /><br />\n%tables in 1bistorical anb oIittcaIScience.<br />\nMonthly. tivo. Series XXI in progress. $11 per<br />\nvolume.<br />\n3obils lbopitins University Circulars.<br />\nContaining reports of scientific and literary work<br />\nin progress in Baltimore. 4to. Vol. XXI I i<br />\nprogress. $1 per year.<br /><br />\n11)11. 3obno lbophins lbospital ulIetin. Menthly. 4to.<br />\nVolume XIV in progress $1 per year.<br />\n0111111. Johns lbophins lbospital lfteporte. 4to. Volume X<br />\nin progress. $5 per volume.<br />\n11X.<br /><br />\nContributions to Beillyriology ant) Comparative<br />\nScitutic biIoio1W,(Beitrage zur A msyriologie, etc.)<br />\nVol. IV complete.<br /><br />\nX.<br /><br />\nfinemoirs from the Siological laboratory.<br />\nW. K. BROOKS, Editor. Volume IV compl<br />\n$7.60 per volume.<br /><br />\nLibraries.<br />\n105,000 volumes.<br />\nUniversity,<br />\nPeabody institute, 145,000 volumes.<br />\nPratt Library,<br />\n200,000 volumes.<br /><br />\nVolu<br /><br />\n11.<br /><br />\n11)1.<br /><br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\nlimerican 3ournal of mathematics.<br />\nF. MORLEY, Editor. Quarterly. 41.o.<br />\nXX V in progress. $5 per volume.<br /><br />\n116obern language 'Rotes.<br />\nA. M. ELLIOTT, Editor. Month .<br />\nXVIII in progress. 11.60 per vo unto.<br />\nX11. 3ournal of Experimental flecbicine.<br />\nW. 11. WELCH, Editor Ili-monthly. Ave. Vol<br />\nVI in progress. $5 per volume.<br />\nXl.<br /><br />\nX111. Bmerican 3ournal of Insanity.<br />\n111(i1NRY M. H(JIM, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nIfleporto of fearylanb ecological eurvey.<br />\nWILLIAM II. CLARK, Editor.<br />\nV.<br /><br />\nterrestrial (Magnetism ant' - litmospberic<br />\ntricitp. L. A. BA 17 ER, Editor. Quarterly. 8vo.<br />\nVolume VII in progress. $2.50 per volume.<br /><br />\nf101.<br /><br />\n'Report.<br />\nPresented by the President of the Board of Trustees, reviewing the operations of the University<br />\nduring the past academic year.<br /><br />\nTM.Bnnual Register.<br />\nGiving the list of officers and students,and stating<br />\nthe regulations, etc., of the University. Published at the close of the academic year.<br /><br />\nin addition to the serials above named, copies may<br />\nbe obtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament.. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the .Johns Hopkins Hospital. .1. S. Billings, Editor. lie pp. 4to. 56 plates. $7.60 cloth.<br />\nThe Teaching of the Apostles. Complete fae-simile edition. Edited by J. Itendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Syriac MSS with Antilegomena Epistles. Edited by I. H. Hall. $3.00.<br />\nBibliographic Hopkinsiensis. Part T. Philology. Parts<br />\nhi-ill. Chemistry, Mineralogy and Geology. Parts<br />\nIV-V-VI. Physics,Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nfi lull list of publications will be sent on application.<br /><br />\nGonimunications in respect to exchanges and remittances<br />\nmak; be sent to Johns Hopkins Press, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nVol.. VII.<br /><br />\n\\Y 21, 1903.<br /><br />\nNo. 15.<br /><br />\nA TREATISE ON THE COW-PUNCHER.<br />\nHe is likely idle,<br />\nex), I NITER is an empty season to the \"cow-puncher.<br />\nthough there is a chance that, as one out of twenty, he is retained to<br />\n\"ride fence\" or \" ride bog holes,\" in the first case to patrol the barbwire and repair gaps that might allow flow from one pasture to another, and in<br />\nthe second to haul forth from at least one certainty of death the many weakened<br />\ncattle that get mired. For the ranch-owner winter is such a hazard that he would<br />\nhold his breath through it if the period of danger were a trifle shorter. Ravens<br />\nProspect about the prairie ; there are raw skins hung on the fences; and rumors<br />\ncome from further on the plains that the \"I.Ialf-circle W's- have lost two thousand head.<br />\nThe popular •mood lightens when Spring comes in, nimbly as always ; and,<br />\nafter a thorough rain with predictions that \"there'll be grass in two weeks,\" the<br />\nmen begin to gather to the ranch headquarters. They are perhaps a fortnight<br />\nahead of the least move to work, yet they are welcome to unroll their bedding in<br />\nthe \"dive,\" to eat of the.beef and stewed prunes in the \"chuck-house,\" and so to<br />\nwait till what time they may be taken under wages again.<br />\nAmong them are many \"sweaters,\" — crude boys, on a first essay, whose<br />\ncapital in life is the remnants of a saddle and a willingness to ride bronchos.<br />\nri;very one waits in ignorance, because the manager is as a rule hostile to inquiries,<br />\nhut at last a dav is realized on which the punchers of last year get their places<br />\nanew and perhaps tionie of the \"sweaters\" cast off that name ; and on the next<br />\nmorning the \"outfit\" starts for the pasture ;—a line of horsemen, followed cumbrously by a wagon piled high with bedding and tooled by the cook.<br />\nOn the Stirrup Ranch as on others, the horses are to be got first,—the three<br />\nor four hundred animals turned out for the winter,—and to that end the outfit,<br />\nafter a while of slow travel, makes camp upon the mesquite-covered prairie at the<br />\nfoot of the great steppe that is the Plains. The gather is accomplished in sections, and each day possesses the same round of active work. In the early hours<br />\nthe view is quiet as the men scatter to their places in a loose circle that may hold<br />\nwithin it thirty square miles ; then all about in the green of the mesquite one sees<br />\nfar off brown and white motes in mid-career with a variegated speck close behind and a second, swift as a centaur, closing in from another quarter; then<br />\nthe motes resolve themselves into horses and the specks into mounted men ; and<br />\nPerhaps ten minutes after the ground in front of one is full of the tiinnilt of hoofs<br />\nand of pursuers and pursued until it settles with a restive bunch of horses and<br />\npickets round about you. The cow-boys take fresh mounts from those cap-<br /><br />\n2<br /><br />\nTHE NEWS LETTER.<br /><br />\ntured ; and as they' rope for some particular head among so many it is not unusual<br />\n. favorite of last year,---'A1 Bald\" it may be or \"Diamond<br />\nthat they miss the<br />\njoe,\"—and catch a bronch' which four men at the end of the rope must strain<br />\nto hold till the running noose has \"choked him down.\" Old favorites too rebel<br />\nat first of the saddle, and it is under such circumstances that high art in \"bucking\"<br />\nis most evident, with the rider in that contorted bend which the stranger never<br />\nunderstands to be involuntary till he himself has been \"busted\" by a broncho.<br />\nA proportion of the horses ignore the gregarious instinct and make escape to be<br />\noutlaws ; yet after a week the outfit can return to the ranch-house with a docile<br />\nquarter of a mile of horses driven before.<br />\nAt the ranch there is a stir with friction over the choice of mounts. Each<br />\nman has the dozen that served him last year yet wishes as many more ; and<br />\ndiscussion of hocks and withers and stifle-joints is hot, until with the allotment<br />\nunder charge of the \"horse-wrangler\" the outfit puts forth afresh, this time to<br />\nwork with the cattle.<br />\nThe grass rises ankle-deep by now on the Stirrup lands, and even where the<br />\nprairie-soil shows through are great white and lemon primroses and mats of<br />\npurple verbena. What part of the pasture lies on the Plains has still a rather<br />\nhare sward ; and when one ascends the \"Cap-Rock,\"—a hundred feet of rough,<br />\ncolored slope, which like the moraine to a glacier, is an abrupt border along the<br />\nfoot of the wide-spread plateau,--.--one finds an expanse of earth and sky, elementary as an ocean view, but with a somber fixedness that the ocean has not,<br />\nwith perhaps an uneasy antelope or two in the distance, a wire fence that goes<br />\nrapidly off into perspective, and quivering lines of heat that for some reason<br />\nmagnify the far-off herd grotesquely and give its members unsteady, stilt-like legs.<br />\nEach morning the outfit makes a drive that ends in a round-up. The drive,<br />\nthough slower, is of a plan with that for horses. 1 ly the time the sun has got<br />\nto its strength the cattle have been started from the grazing and appear in troops<br />\nthat center on an open level in the mesquites. If the drive be large a van-guard<br />\nof baby calves will clog proceedings, and some must he carried over the pommel<br />\nof the saddle, and some stirred with the foot, when they flop down and relapse<br />\ninstantly into sleep, as they will in spite of circumstances that should cause them<br />\nanxiety, and some even be left with a mother to stand over them. Before noon<br />\na couple of acres of cattle are assembled ; a couple of acres of tossed horns and<br />\ncrowded brown backs ; a couple of acres that bleat and bawl like a brass band<br />\nin its preliminaries ; and that eddy ,round and round. The men change horses,—<br />\nthey are always changing horses at the least moment of rest,—and the more<br />\narduous \"cutting out\" begins, to obtain the yearlings at this season. It is very<br />\nlike polo:—dust, with horses that dodge in the midst of the dust, only in this instance instead of the ball, a yearling, fond of his parent, is to be separated from<br />\nher, and out of the press and coerced to the bunch of his fellows a hundred yards<br />\noff. As time goes the cattle circle more restlessly and are harder to \"hold,\" the<br />\ndust rises and blows, and the bellowing and moos become loudly incessant ; until<br />\nsecond outfit interlocks with that so far<br />\nthe final yearling is \"chousted out.<br />\nfollowed, with which the yearlings must go perforce off to exile till they arc<br /><br />\nTHE NEWS LETTER.<br /><br />\n3<br /><br />\nweaned; so labor for the first gang has its finish for the day. There is a steeplechav to where dinner waits with the wagon at sonic near-by tank of water.<br />\nhater comes a move to fresh territory, but always an hour or two is on hand at<br />\nthe cool end of the afternoon, through which one can wash saddle-blankets or<br />\nbridle a \"quirt,\" lie in laziness, or,—if conditions ask for it,—stretch \"tepees\"<br />\nagainst the rain.<br />\nThus till the fall, even till December, cow-boys punch cattle. (hi the Stirnip's land, with its 40,000 head, work exists till late. In Spring the yearlings<br />\nmust be weaned, then the brand is put on calves,—breathless business it is for<br />\nthe fellow who must wind arms about fifty in succession as they bound at the<br />\nend of the rope, and throw them (breathless too, for the calves),—and at all<br />\ntimes special grades are to be separated for market. Through these processes<br />\nruns the organization into herd and round-up and cut. \"Stray men\" are sent<br />\nwith a string of horses and a pack of quilts to follow the round-ups of the<br />\n\"Lazy L's \"( ) nearby and claim property that has got past the barb-wire;<br />\nand sometimes sonic one is called upon to find a trail to the rail-road,—for now<br />\nwhat with fences a herd may not be brought straight by compass. Once or<br />\ntwice a season the outfit must \"go on the trail,\" when, indeed, it pays for idleness<br />\nwith a routine which insists that each man shall herd and press on while it is<br />\nlight and stand a watch in the darkness, and even guard through the night if the<br />\ncattle are anxious. Year-long convoys from Texas to Montana or even lower<br />\nCanada, without help of the railroad, are undertaken, but conditions against these<br />\ngain in. stringency.<br />\nThe cow-boy draws from $25 to $-10 each month for his irregular performance, whereas a farm-hand of the same region bends his back so long as<br />\nhe is awake, yet may not expect more than $16 in a similar length of time ; that<br />\nshows nearly the ratio of skill in the employments. Skill insures life in the cowboy's case as more spectacularly in the steeple-jack's. The cow-boy is often<br />\nunder discomfort, of weather, of lone vigil, of isolation ; his future is unstable,<br />\nexcept in most cases for a certainty that he will be laid off without wages during<br />\nthe bitter stretch of the year. Altogether one cannot judge him overpaid.<br />\nThe type of man may almost be deduced from the conditions given,—had<br />\nit not been often depicted with more gusto than discretion. Young blood finds<br />\nthe life good and in many instances grows to be old blood while the charm of it<br />\nstill hangs in the veins. One sees many middle-aged and stout cow-boys. Change<br />\nhas broken not a few traits of the country ; the six-shooter is no longer a habit,<br />\nunder the fines that now hedge about its possession ; and shortly as time goes, the<br />\ngreat free-handed ranches will disintegrate into small careful stock-farms. The<br />\nold-timers, lavish in their dealings with the world, find in each year a load of<br />\ndisappointment, but a reasonable half of the punchers, hacked by youth and<br />\nsteadied by ambition, have an eve to their doubtful prospects, and are at earnest<br />\nto make a \"stake\" in cattle. Indeed nowadays the \"Great Staked Plains,\" as a<br />\nR. '00,<br />\nname, has attained to much truth,<br /><br />\nTHE NEWS LETTER.<br /><br />\n4<br /><br />\nTHE AMERICAN STATE.<br />\nF,DrrED<br /><br />\nBY PROFESSOR W. W.<br /><br />\nwILLouGit By.<br /><br />\nThe Century Company, of New York, is to publish a series of volumes under<br />\nthe general title Of \"The American State,\" which is to be edited by Dr. W. W.<br />\nWilloughby, Associate Professor of Political Science. The aim of the series is<br />\nto describe comprehensively the manner in which the governmental agencies of<br />\nthe American State, Federal, Commonwealth, and Local are now organized and<br />\nadministered. While the volumes shall be descriptive of actual conditions, incidentally they will aim to suggest the various constitutional and administrative<br />\nproblems that exist, and make manifest the essential considerations involved in<br />\ntheir settlement.<br />\nThe series will consist of eight volumes, as follows: The American Constitutional System; American Legislatures and Legislative M ethods ; The American<br />\nExecutive and Executive Methods ; TheAmerican Judicial System ; Territories<br />\nand Colonies ; Local Government in the United States ; City Government in the<br />\nUnited States; and Political Party Machinery.<br />\nIt will be observed, that as distinguished from many so-called \"series\" or<br />\n\"libraries,\" this set of volumes will constitute a logical wbole, that is, will be encyclopedic as regards the special field covered. Each volume, though complete<br />\nin itself will have its proper place with special reference to that fact.<br />\nThe first volume of the series, \"The American Constitutional System,\" the<br />\naim of which will be to furnish a general introduction to a study of the constitutional system of the American State, is to be prepared by Dr. Willoughby, who<br />\nexpects to publish his book before the end of the year. Four of the remaining<br />\nvolumes have already been provided for, and the editor hopes to have the entire<br />\nseries published by the end of 1904.<br /><br />\nNEW EDITOR OF JUVENAL.<br />\nThe edition of the satires of Juvenal, upon which Dr. H. L. Wilson has<br />\nbeen at work for several years, is to be issued from the press early in June.<br />\nThe book will consist of about 400 pages, and will contain a discussion of<br />\nRoman satire, the life of Juvenal, Juverial's style and place in literature, a history<br />\nof the text and a bibliography. Besides this there will be a complete text of the<br />\nauthor, including the recently discovered Bodleian fragments, the commentaries<br />\nand the index.<br />\nThe book is not only intended for undergraduate students, but also offers to<br />\nteachers and advanced students assistance for a more thorough study of the satires<br />\nand information as to the progress made in the interpretation of this author<br />\nduring the past ten years,<br /><br />\nTHE<br /><br />\nNEWS LETTER.<br /><br />\nTHE HULLABALOO CLUB FEED.<br />\nATURDAY night last, a feed was given in the Trophy Room by the \"Hullabaloo\" Club to the Junior Class. The occasion was celebrated by several impromptu \"'stunts\" in the cage, the most interesting being hurdle<br />\nraces, participated in by self-constituted sprinters, who, though more or less<br />\nstained by their race, were overshadowed by another and blacker race, two<br />\nchocolate representatives who indulged in a boxing bout. Jim \"also ran\" upon<br />\nthe scene to play the rubber, aml with a towel, circumscribed the dark circles<br />\nunder the eyes of the sluggers and smoothed their newly evoked facial ripples.<br />\nThus seeing the race problem summarily disposed of, both classes retired<br />\nto the Trophy Room, where they regaled themselves with tempting edibles,<br />\nliquidating their debts to the inner man with time draughts on their own high<br />\nspirits.<br />\nSecretary Addison announced from the bench that the following men had<br />\nbeen selected to compose the Board of Governors of the Club for the ensuing<br />\nyear: Messrs. Fuerbring-er, Erlanger, Stollenwerck, ll'earre, Buckler, Wayson,<br />\nHawkins, Louis, Branch and Foster.<br />\nThe Hullabaloo Club was organized by the Class of 1903 for the purpose<br />\nof promoting good-fellowship among its members. Its constitution, if conscientiously adhered to, will no doubt be the means of bringing the men closer together socially, and will do much towards fostering good will and disproving<br />\nthe no college life idea at Hopkins.<br />\nThe object of the organizers of the Club was to eliminate all politics from<br />\nit, there being no presidential office to be filled, the supervision of the business<br />\ndetails being vested in the Baord, assisted hy a Secretary and a Treasurer.<br />\nIf the requite amount of interest to render the organization successful is<br />\nshown, the Board of Governors may decide to ask the lower classes to identify<br />\nthemselves with the Club, and thus make it an undergraduate and not a class<br />\norganization.<br />\nThe Seniors are invited to attend the Field Night to be given by the Hopkins Club on Saturday, May 1,3rd. Dr. Welch will give a short talk, and refreshments will be served later.<br />\nOn last Thursday, the class in Minor Botany, under the charge of Dr. Barton and I\\1 r. Gudger, took a trip to Mt. Washington for the purpose of studying<br />\nthe flora.<br />\nThe University musical clubs made their last appearance of the year at the<br />\nconcert for the benefit of the Lawrence House Mission, given in conjunction with<br />\nthe Woman's College Musical Clubs on the night of May 9th. The attendance<br />\nwas large, and a considerable sum was turned over to the mission.<br />\nA committee from the Junior Class is making arrangements for a feed and a<br />\nsmoker at the close of the examinations.<br />\nThe minor geology class made a trip to the Luray Caves last week under the<br />\ncharge of Dr. Shattuck. They left Friday afternoon and returned Sundav morning. Those who went were Nelson, Winternitz, Riley and Bamberger.<br /><br />\nTHE NEWS LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br /><br />\nHOPKINS UNIVERSITY.<br />\nMAY 21, 1903.<br /><br />\nSubscription $1.50 per year.<br /><br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\n.<br />\nNews Editor,<br />\nAssistant News Editors,<br />\nAthletic Editots,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10<br /><br />\nCents a single copy.<br /><br />\nGEORGE A. FOSTER, 1904.<br />\nRicoiNALD S. OPIE, 1904.<br />\n. C. A. NEAL, 1904.<br />\nH. V. MORSE, 1905.<br />\nJ. NEWMAN NUMSEN, 1904.<br />\nHARRY BAETJER, 1903.<br />\nRIGGIN BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to GEORGE A FosTxn, box 195, Johns Hop<br />\nkills University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETJER,<br />\nJ. H. U.; or box 398, Medical Department of the Johns Hopkins University.<br /><br />\nHE number of books that are being published by University men is worthy<br />\nof more than passing notice. Scarcely an issue of ME NEWS-LETTER<br />\nappears that does not contain an account of new books by Hopkins professors or alumni. This number conains two important announcements, one of the<br />\nnew edition of Juvenal, by Dr. Harry L. Wilson, and the other of the series, The<br />\nAmerican State, which is to be edited by Dr. W. W. Willoughby. Some time ago<br />\nTliv, NEws-LnuR contained a note to the effect that Prof. Wilson was preparing<br />\na new edition of Juvenal, but nothing definite was stated. Now, however, we are<br />\nable to speak more of this book, which has been eagerly awaited by scholars, and<br />\nwhich bids fair to fulfil all that is expected of it. We are informed by competent<br />\nauthority that Dr. Wilson's work is the most thorough edition of the Latin<br />\nSatirist ever published in this country, and will probably at once become the<br />\nauthority. The series of the American State, to be edited by Dr. Willoughby,<br />\nwill be one of the most important contributions to Political Science that has been<br />\nissued for some time. While all the volumes have not yet been assigned to<br />\nwriters, it is probably that a majority of them will be written by Hopkins men,<br />\nsince the part they have taken in advanced economic work is great. The publication of these books indicates that the spirit of creative intellectuality at the 'University is as vigorous as ever.<br /><br />\nt<br /><br />\nTHE NEWS LETTER.<br /><br />\nt<br /><br />\nHE 1903 \"Hullabaloo,\" of which the first edition, so to speak, was issued<br />\n. last Monday, is, in many respects, the best year-book which has been<br />\nbrought out since the introduction of this time-honored custom of Hopkins<br />\nundergraduate life. The approval shown by every one who has bought a copy is<br />\nthe best proof of the fact that the book is up to the expectations of the most<br />\ncritical. The neatness and fullness of the book, and the almost total absence of<br />\nthe ordinary typographical errors, indicate the long and careful work of a comtetent board of editors.<br />\nThe features which seem to arouse the most interest and cause the most<br />\nlaughter, are the \"stunts\" and the \"grinds\" on members of the Senior class. The<br />\n\"Hullabaloo Intelligence Office\" could not be improved upon. The virtues and<br />\nvices of each man are taken off in an extremely outspoken way. The class<br />\nopinions are original, interesting and comprehensive. The result of the class vote<br />\non the handsomest man doubtless caused much sorrow.<br />\nThe pictures are excellent. The color drawing is particularly dainty and<br />\nThey,<br />\nattractive. The drawings by prominent artists speak for themselves.<br />\nhowever, have the disadvantage that the .woman experienced when she carried a<br />\nnew Venus de Milo into her slightly shabby parlor. Everything else looked<br />\nsmall in comparison, even things which, not subjected to such invidious parallels,<br />\nwould stand well on their own smaller merits in their own smaller way. This<br />\ngives the book a species of unevenness, which, however, easily gives away to<br />\nfascination when we take any detail by itself.<br />\nThe various departments of the l Tniversity are arranged in a pleasing and<br />\nthorough manner, particularly \"\\thletics. The \"Songs of johns Hopkins\" are<br />\nalso a good point about the book.<br />\nIn conclusion, the following criticism might, perhaps, be made. The 1903<br />\n\"Hullabaloo\" is hardly, as the editors jokingly claim, \"truly representative of<br />\nthe l'niversity,\" as it has to do wholly with the Senior class. We venture this<br />\nless as a criticism than as a suggestion to future \"Hullabaloos.\"<br /><br />\nHE next issue of Tin.: Nrows-I,ImER, the last for the academic year, willl be<br />\nthe usual commencement number. In a compact form it will aim to give<br />\na summary of what the i Tniversity students have done during the past<br />\nYear. There will be pictures of the different athletic teams, and reviews of the<br />\nwork done by them during the year will be given by their respective captains.<br />\nIn order that all departments may be represented, there will be photographs of<br />\nTHE NEws-LwrTER and \"Hullabaloo\" boards, together with an account of these<br />\npublications and suggestions for the future, by one who has been prominent in<br />\nboth. What the members of 1903 have done 'in the University, Athletic and<br />\nClass affairs during their college days, together with their plans for the future,<br />\nand portraits of the more prominent men will be one of the features.<br /><br />\nt<br /><br />\nTHE NEWS LETTER.<br /><br />\n'11,,p11<br /><br />\n'I AMI<br /><br />\nmi II<br /><br />\nIn I I iII<br /><br />\nii<br /><br />\nIIl ill) 1111 111 1 1 11111111111111111111111111111111 11 11<br />\n•<br /><br />\n.•<br /><br />\n1002.9,„„2.,22<br />\n1111111111111111111191<br /><br />\n717-) 11111111111111111111111111111111101111111111111111111111011111111111111111(111111111111111111111111111111111111111111111111111111,71.7fadigIM<br /><br />\nDr. W. S. Thayer formally opened the annual session of the American<br />\nMedical Association, held in New Orleans. Dr. Welch read a paper on \"Sources<br />\nand. Manner of Infection of Typhoid Fever. He further introduced a resolution,<br />\nwhich was carried, that the Association urge President Roosevelt to name a reputable medical man on the isthmian Canal Commission, in view of the dangers<br />\narising from the unsanitary region through which the canal will be cut.<br />\nDr. William H. Tolman, director of the American Institute of Social Service,<br />\nlectured in McCoy Hall on ''The Problem of the City Child.\" The lecture was<br />\nin the interest of the Lawrence House, and was illustrated with many lantern<br />\nslides.<br />\nDean Edward H. Griffin will .deliver the address to the graduating class of<br />\nthe Maryland College for Women, Lutherville, on Tuesday, June 2.<br />\nDr. John M. Vincent attended the anniversary exercises of Oberlin College,<br />\nheld last week.<br />\nDr. Remsen has been appointed a member of the committee to consider<br />\nmeans of preserving the Declaration of Independence, which is fading to such an<br />\nextent that the names of the signers are scarcely discernible.<br />\nMr. Henry J. Bowdoin, '81, has been elected one of the trustees of the<br />\nUniversity. After graduating here, Mr. Bowdoin studied law. He is the first<br />\ngraduate of the University to be elected a trustee.<br />\nDr. J. H. Hollander delivered an address on \"Socialism,\" before the Baltimore Typographical l'nion, No. 12, at Hazazer's Hall, on the 10th. A discussion followed, in which Drs. Gould and :Franklin took an active part.<br />\nPresident Remsen took a prominent part in the dedication exercises at Tome<br />\nInstitute. Other Hopkins men in attendance were Dean Griffin and Dr. B. C.<br />\nSteiner.<br />\nDr. Jacob H...Hollander, who had been asked to go as a special United States<br />\nCommissioner to the Philippines for the purpose of supervising the establishment<br />\nof the gold-standard currency system there, has declined the appointment on<br />\naccount of press of other work.<br />\nMr. J. H. Moore, a graduate student in physics, has accepted the position<br />\nof observer in the Lick Observatory. The place has just been vacated by Dr.<br />\nHerbert M. Reese, a former Hopkins man.<br /><br />\nTHE NEWS LETTER.<br /><br />\n9<br /><br />\nPresident-Emeritus Gilman and Dr. W. H. Welch are interested in the movement to have a monument erected to the memory of the late Major Walter Reed.<br />\nAt the annual meeting of the managing committee of the American School<br />\nin Rome, which is maintained by the Archaeological Institute of America, with<br />\nthe co-operation of several American universities, Dr. Harry I,. Wilson was appointed professor in Latin for the year 1905-06. It will be remembered . that<br />\n.Professor Mintor Warren, formerly of the University, was sent to Rome as the<br />\ndirector of the American School in 1896.<br />\nA large party of members of the graduate department of biology will spend<br />\nthe summer months in special research work at the Marine Biological Laboratory at Beaufort, N. C. Among them are Messrs. D. H. Tennent, R. P. Cowles,<br />\nand Samuel Rittenhouse. Mr. Olin F. Shreeve, who is at present in Jamaica,<br />\nwith Dr. Johnson, of the Ilotanical department of the University, will also join<br />\nthe party on his return. Mr. S. H. Derickson, another member of the department, will accompany the expedition of the Geographical Society of Baltimore,<br />\nwhich will leave for the Bahamas on J tine Gth. He will have charge of the biological work of the expedition. The biological laboratory at Beaufort, which is<br />\nconducted under the management of the United States Fish Commission, will<br />\nbe under the directorship this year of Dr. Caswell Grave.<br />\nThe board of collegiate adv'sers has recommended the following men to be<br />\ncandidates at the en( of this season for the degree of doctor of pliTisophy<br />\nPhilip Warner Harry, Pylesville, M d. ; I knjamin Franklin Carver, Hanover, Pa. ; Rev. John P. Cooney, S. J., Loyola College; William Elford Gould.<br />\nBaltimore ; Alfred James Morrison, Varmville, Va.; Albert Johannsen, Fremont,<br />\nNeb. ; John Gale Hun, Albany, N. Y. Philip Howard Edwards, Pikesville ;<br />\nLeRoy Carr Barrett, Richmond, Mo.; Atherton Seidel', Atlanta, Ga.; Elbert jay<br />\nBenton, Holton, Kan.; .Yukimasa Hutton, Sagaken, Japan; George Olaf Berg,<br />\nSacred Heart, Minn.; john David Rodeffer, Lorettsville, Va.; George Wiles Middlekauf, Leitersburg, Md.; Joseph Haines Moore, Wilmington, Ohio ; Charles<br />\nKeyser fi'idinunds, Baltimore ; Arthur Whitmore Smith, Andover, Mass.; Charles<br />\nA. Savage, Minneapolis: Thomas M. Jones, Ashland, Va. ; Frank Critchlow,<br />\nPrinceton, N. J. ; Roland J. M ul)lord„ Country School, Baltimore ; Henry A. Converse, Harrisonburg, Va.; Lee Raney, Danville, Ky.<br /><br />\nThe oyster spat upon the rock,<br />\n(I know that this seems very queer,<br />\nBut wait till I explain, my dear),<br />\nHad settled down for life.<br />\nIf spat was here, the past of spit,<br />\nTrust me, I'd not have mentioned it.<br /><br />\n10<br /><br />\nTHE NEWS LETTER.<br />\nALUMNI NOTES.<br /><br />\n'93<br /><br />\nThe engagement is announced of Charles B. Penrose jr., to Mrs. Delano<br />\nAmes, of Baltimore.<br />\n,98 Thos. J. Fitzgerald, Jr., has been elected General Manager of the Lexington (Ky.) Street Railways.<br />\n,99 Karl jungbluth, jr., was married to Miss Amelia Cowling, of Louisville,<br />\non April 21st.<br />\nCharles Vogeler is now in business at Pittsburg.<br />\n'01<br />\nThe engagement is announced of Dr. Nathan Winslow, who is now one<br />\n'00<br />\nof the surgical staff of the University of Maryland Hospital, to Miss Margaret<br />\nMassey, of Virginia.<br />\nAt the National Conference of Charities and Cofrections, held in Atlanta last<br />\nwcek, Dr. Jeffrey R. Brackett was elected president of the Association.<br />\n'97 Warfield T. Longcope, Pathologist at the University Hospital, Philadelphia, spent several days in the city last week.<br />\nA number of members of the class of '98 of the Medical School, who were<br />\non their way to Washington to attend the Congress NI American Physicians and<br />\nSurgeons, gathered at the Carrollton Hotel on May I I th, and held an informal<br />\nAmong those present were: Prs. Emma E. Walker,<br />\nreunion and banquet.<br />\nThomas W. Hastings, of New York ; William W. Ford, of Montreal; Alfred B.<br />\nI lerrick, of Washington ; Roger G. Perkins, of Cleveland; Joseph H. l'ratt, of<br />\nBoston; Walter R. Steiner, of Hartford, Conn.; William S. Baer, James H. M.<br />\nKnox, Jr., Harry T. NI arshall, Percy.. M. Dawson, of Baltimore.<br />\nDr. Robert N. Hartman, who took his Ph. D. here in 1894, in chemistry,<br />\nwas accidently killed in the laboratory of the Colorado State School of Mines by<br />\nhydrogen sulphide gas. He was professor in chemistry at that institution at the<br />\ntime of his death.<br />\n'94 Robert A. Dobbin was married on Thursday, \\pril 30th, to Miss Marie<br />\nKerr Hemsley.<br /><br />\nAmong the undergraduates who are going abroad this summer, are Bevan<br />\nand Plaggemeyer, '03, who will sail from New York on the 13th of next month.<br />\nThey will spend several weeks in Italy, after which they will travel through Europe, not neglecting to visit Monte Carlo and Paris. The latter part of August<br />\nand September will be passed at Oxford, where they will take a special course in<br />\nSocial Economics. Strauss, '03, and Erlanger, 'Oh, leave on June 11th, for a<br />\nthree months' trip, during which time they will \"do\" the Continent generally. R.<br />\nCurzon Hoffman, jr., '03, will depart from New York for an European trip, on<br />\nWednesday, June 10th. He will be absent three or four months, which time will<br />\nAlan Dill, '05, will probably go<br />\nbe spent in England and on the Continent.<br />\nabroad with his father.<br /><br />\nTHE NEWS LETTER.<br /><br />\n11<br /><br />\nLACROSSE.<br /><br />\nJ. H. U., 3—Crescents, 10.<br />\n0N May 9th, before several thousand spectators, the Hopkins lacrosse team<br />\nsuffered its first defeat of the season in the game against the Crescent<br />\nAthletic Club, of Brooklyn, the score being 10 to 3. The ,game was one<br />\nof the nu.)st scientific exhibitions of lacrosse ever seen in Baltimore ; but most of<br />\nthe science was on the side of the visitors. The 'Varsity did not seem to play up<br />\nto its usual standard, for its work appeared tame in comparison with that of its<br />\nopponents, who played the real Canadian game. It was not poor playing, however, that lost for the 1.Tniversity, but superior playing by the Crescents. In<br />\nevery point of the game Hopkins was clearly outclassed. The weight of the<br />\nCrescent players averaged far more than that of the Hopkins men, and their<br />\nbody checking was in consequence something terrible.<br />\nThe passing of the<br />\nchampions was faultless, and it was only through the fastest kind of work on<br />\nthe part of the defense that plays were broken up. The defeat, however, is by<br />\nno means an inglorious one, for the victors are all star players. They are the<br />\npick of some of the best teams in the country, and have been playing lacrosse<br />\nfor years; therefore it was expected that they would be victorious over the 'Varsity.<br />\nHopkins defense certainly played a fine article of lacrosse at times, and if<br />\nthey could have struck their gait sooner, the Crescents could not have rolled up<br />\nten goals. The body checking of Tough was very effective all through the game<br />\nin breaking up plays, and from the latter part of the first half to the close of the<br />\ngame, Bland( also brought in his weight for some splendid work. On the Hopkins attack, Abercrombie did by far the best work. This is the first game in<br />\nwhich he has been allowed to play during this year, owing to the four-year-limit<br />\nrule, and the great player •hears comparison with any on either team. If the<br />\nother attack men had some of the confidence with which he plays, Hopkins would<br />\nhave made more goals.<br />\nHopkins got the ball at the start, and passed it down toward the net. Near<br />\nthe posts Liffton obtained the ball, then passed it to Simpson, who threw to<br />\nCurry, who in turn had almost a clear field, as the defense was too late in covering up, and he threw the first goal within a minute from the time the game<br />\ncommenced. Again the ball went rapidly down to Hopkins territory, and an<br /><br />\nTHE NEWS LETTER..<br />\nattempt was made at goal, but Schmeisser blocked it with his body. In the scrimmage that followed, Lindsay obtained the ball and shot the second goal. Within<br />\nthe next twenty minutes some fine playing was seen. The 'Varsity had apparently recovered from its nervous spell and now settled down to business. The<br />\nball was passed to Curry, who made a pretty run through his opponents right<br />\nup to the post. Just as he was about to shoot, Blanck struck him with his body,<br />\nand knocked the ball out of his stick. The ball was thrown down the field to<br />\nRosenheim, who passed to Bird, and by Bird to Matthai. Matthai threw it to<br />\nPutts, who attempted goal. Everyone thought a goal was sure, but their hopes<br />\nwere dashed to the ground when Dr. Rose made a fine stop. For some time the<br />\nball was kept near the Crescents' goal. The•game was now on in earnest. Hopkins worked hard to put the sphere between the posts, and several attempts were<br />\nmade. The ball passed from side to side. Several times P. Straus was called<br />\nupon to make difficult stops, and each, time he was right there.<br />\nIt was during this playing that the Hopkins players scored their first goal.<br />\nBird got the ball and passed to Rosenheim, who threw to liernheini. Beruheim<br />\ndodged his opponents and placed the ball in the net. About three minutes later<br />\nCrescent increased her lead to three. After some more see-saw playing, the<br />\nhalf ended with the ball near Hopkins' goal.<br />\nIn the first part of the second half, Crescent took Hopkins' nerve completely,<br />\nby making six goals, each about two minutes apart. After this the locals commenced to cover up more, and the result was a decided brace. From the time<br />\nCrescent made her ninth goal to the close, Hopkins played by far the best of<br />\nany time during the game. The whole attack got together and kept the ball most<br />\nof the time in Crescent territory. Such playing could not fail to bring its reward, and Hopkins scored two more goals to Crescent's one. The game ended<br />\nwith the ball in the middle of the field.<br />\nThe Hopkins line-up was: Putts, in-home ; Bernheim, out-home ; Rosenheim,<br />\nfirst attack ; Abercrombie, second attack ; Bird, third attack ; Matthai, center ;<br />\nTough, third defense ; Custis, second defense ; H. Straus, (captain) first defense ;<br />\nIlanck, cover point ; Schmeisser, point ; P. Straus, goal.<br /><br />\nDUAL MEET WITH VIRGINIA.<br /><br />\nIll-i', season of the track and field team practically closed on Thursday, May<br />\n7th, when in the presence of a large crowd of faithful rooters, the Hopkins squad gained a decided victory over the athletes from the University<br />\nof Virginia. This meet made a sort of \"garrison\" finish, forming a fitting climax<br />\nto a successful season's work. In the eleven events, Hopkins won 8 firsts and<br />\n5 seconds, thus getting 55 points, as against the 33 of Virginia. It looked at first<br />\nas if everything was coming our way, but later Virginia got together and suc-<br /><br />\nt<br /><br />\nTHE NEWS LETTER.<br /><br />\n13<br /><br />\nceeded in making their presence felt. Disregarding results as shown by the summary,. the visitors need feel in no way dissatisfied with their performance; it was<br />\nsimply a case of \"when Greek meets Greek,\" in which Hopkins proved to be the<br />\nbetter Gre,ek ; a .case of a good man losing to a better one in a hard struggle.<br />\nAside from this meet being peculiarly satisfactory to Hopkins enthusiasts,<br />\nit was of much interest from a purely athletic point of view, in that State records<br />\nwere broken so often that the novelty of it was beginning to wear off. First<br />\nindividual honors were carried off by H. K. Tootle, who won both the 100 yard<br />\nand the 220 yard dashes, in each case lowering the State records of 10 1-5 and<br />\n23 seconds respectively, by covering the distances in 10 and 22 flat. The world's<br />\nrecords are 9 3-5 seconds for the 100 yards, held by Arthur F. Duffy, and 21 1-5<br />\nseconds for the 220 yards, held by B. J. Wefers. J. A. Freese established records<br />\nfor the 120 yard high hurdle and 220 yard low hurdle, his time being 17 2-5 and<br />\n27 seconds respectively. In the quarter mile run, Captain Shelton, of Virginia,<br />\nlowered the State record of 51 2-5 seconds, formerly held by England, to 51 1-5<br />\nseconds. Besides these, the pole vault was won quite handily by T. W. Emig,<br />\nwho, although entered before in several indoor events, had never specially distinguished himself. His victory came quite as a welcome surprise, and shows talent<br />\nthat has previously been too little regarded. After winning with a jump of 9<br />\nfeet, 11 1-4 inches, Emig endeavored to break the State record of 10 feet, 1 inch,<br />\nand (lid successfully clear the bar at 10 feet, 2 1-1 inches, but his pole afterward<br />\nknocked the bar down.<br />\nThe good work for Hopkins began with the 1.00 yard dash and continued with<br />\nfew interruptions until the end. All four (lashes were hotly contested, but ,Hopkins won out in each, through the instrumentality of Tootle and Freese. In the<br />\n1,10 yard run, Shelton and Bass, of Virginia, had the lead till near the finish.<br />\nwhen Captain Hoffman, by a beautiful sprint, passed Bass and ended in second<br />\nplace. The surprise of the afternoon, however, came in the mile run. Grant,<br />\nof Virginia, gave out about. GOO yards from the tape, while Tyree lacked about<br />\nhalf that distance of finishing. The race then narrowed down to the two freshmen, Morse and ,Campbell, was a contest to decide to whom the \"H\" was to be<br />\nawarded. With not more than a foot separating them, Morse crossed the tape in<br />\nthe lead. Hopkins clearly showed her superority in the dashes and in the long<br />\ndistance run of one •mile, but had to give the palm to Virginia for the distances<br />\nof 440 and 880 yards. The summary of events was as follows:<br />\nroo Yard Dash—H. K. Tootle, j. IT. U., first: S. P. Bass, Va., second. E.<br />\nL. Passagno, J. H. U., and A. P. Gray, Va., also ran. Time 10 seconds.<br />\n220 Yard Dash—H. K. Tootle, J. H. 11,, first; S. P. Bass, Va., second. A.<br />\nP. Gray, Va., and F. R. V. Williams also ran. Time 22 seconds.<br />\n4,io Yard Run—j. H. Shelton, Va., first ; R. C. Hoffman, j. H. 1.11, second.<br />\nS. P. Bass, Va., and J. T. V.ngland, J. H. V., also ran. Time Si 1-5 seconds.<br />\n880 Yard Ritn—R. E. McCabe, Va., first ; H. Beine, Va., second. R. G.<br />\nGoodenow and C. L. Stone, j. 11. l'., also ran. Time 2.1.3 2-5.<br />\nRun—}1. V. Morse, J. H. U., first: T. Campbell, second. W. R. Tyree<br />\nand C. Grant, Va., also ran. Time 5.05 3-5.<br /><br />\n14<br /><br />\nTHE NEWS L.ETT.ER.<br /><br />\n120 Yard High Hurdle—J. A. Freese, J. H. U., first; C. Grant, Va., second.<br />\nTime 17 2-5 seconds.<br />\n220 Yard Low Hurdle—J. A. Freese, J. H. -U., first; L. Knight, P. II. U.,<br />\nsecond. 0. C. Shaner and W. E. 110110day, Va., also ran. Time 2.; seconds.<br />\nRunning High Jump—C. B. Scholl, J. H. U., first, 5 feet, 8 inches; J. Russel, Va., second, 5 feet 0 inches. G. B. Dawson, J. H. U., and W. E Holloday,<br />\nVa., also jumped.<br />\nRunning Broad Jump—E. L. l'essagno, J. H. U., first, 21 feet, 9 inches;<br />\nG. B. Scholl, J. H. U., second, 20 feet, 3 inches. J. Russell, Va., also jumped.<br />\n16-Pound Shot Put—W. W. Council, Va., first, 38 feet,<br />\ninches; H.<br />\nB. Stone, J. H. U., second, 30 feet, 1 inch.<br />\nPole Vault—j. W. Emig, J. 11. U., first, 9 feet, 11 4 inches; J. Russell,<br />\nVa., second, 9 feet, 5% inches.<br />\nAlthough only one event was run off at a time, each one was interesting<br />\nthroughout, owing to the limited number of starters.<br />\nIt will probably be a matter of interest to Hopkins men to learn that the<br />\nL'niversities of Virginia and of North Carolina held a dual meet at Charlottesville, on May 15th, and that out of 13 events, Virginia won 8 firsts and 4 seconds,<br />\nwith another ending in a tie, thus giving Virginia 56, points as compared with<br />\n15 of North Carolina. From these results we can readily conjecture what Hopkins could do to the University of North Carolim.<br />\n•<br /><br />\nY. M. C. A. NOTES<br /><br />\nThe Association at the University of Illinois has been doing- splendid work<br />\nthis )'ear. They have had 355 men enrolled in voluntary Bible Classes, and a<br />\nband of 21 volunteers for Foreign Missionary service, of whom 12 have been enrolled since the close of last college year.<br />\nThe May Intercollegian publishes an interesting list of names of 211 student<br />\nvolunteers who have sailed for Foreign Missionary work since March, 1902.<br />\nIt is interesting to note that the largest number is to China, where they are needed<br />\nto take the places of those killed during the Boxer uprising.<br />\nThe prospect for a strong and interesting conference at Northfield this summer, June 20th to July 5th, is very good. The names and number of speakers<br />\nis very strong and one of the latest additions is that of Rev. R. j. Campbell, of<br />\nthe City Temple, London, England. One promised improvement in camp is a<br />\n\"rustic lodge,\" with reading room. Other institutions will have large delegations<br />\nand Hopkins must be well represented. Information can be had from the General<br />\nSecretary, or from any member of the committee. Circulars are on the Secretary's desk in Levering Hall. This is the best possible opportunity to get acquainted with men of other institutions. The whole life and tone of the c'imp and<br />\nconference is very high and calls out the best there is in a man.<br /><br />\nTHE NEWS LETTER.<br /><br />\n15<br /><br />\nProf. H. 14. Wilson, as president of our Association, attended the conference<br />\nof Presidents of College Associations for the East, at Harvard, April 16-18.<br />\nNinety delegates from forty-four institutions of New England, New York, New<br />\nJersey and Maryland, and the professional schools of Philadelphia were present.<br />\nMr. L. S. Morgan represented Hopkins Medical School Association. Very profitable and interesting sessions were held. Dr. Alexander McKenzie addressed<br />\nthe closing meeting on Sunday evening and deepened the impression made by<br />\nthe rest of the conference of the absolute necessity for \"a life hid with Christ in<br />\nGod,\" if the men are to represent their Master among their fellow-students.<br /><br />\nBALT1M ORE, MD., U. S. A., May 18th, 1903.<br />\nEditor THE; Nvms-I41iTTER,<br />\nJohns Hopkins University, Baltimore.<br />\nMAR SIR:—T hand you herewith statement of receipts and expenses connected with the trip of the debating team to the University of North Carolina.<br />\nThe items have been examined and approved as correct. I shall be obliged if<br />\nyou will publish the account in your next issue, as I believe that the fullest publicity should be given to matters of this kind.<br />\nSincerely,<br />\nGuy CARLETON LEE.<br />\nEx Pli.',NSP: ACCOUNT ot: nv;BATLNG 'rEAm oP 1903.<br />\n[Trip to the University of North Carolina.]<br />\nReceipts:<br />\nExpenditures:<br />\nFrom Faculty.<br />\n$ 29.00<br />\nTransportation<br />\n$ 61.50<br />\nFrom Seniors<br />\n29.75<br />\nPullman<br />\n10.00<br />\nFrom Juniors<br />\n15.00<br />\nMeals en route<br />\n8.75<br />\nFrom Freshmen<br />\n5.75<br />\n$ 80.25<br />\nTotal<br />\nTotal<br />\nReceipts<br />\n$ 79.50<br />\n79.80<br />\nDeficit<br />\nPaid by friend<br /><br />\nRodney was his mother's angel,<br />\nHe would sit and watch her paint ;<br />\nMamma's darling licked the brush dry,<br />\nRodney's still a little saint.<br /><br />\nA man to whom illness was chronic,<br />\nWhen told that he needed a tonic,<br />\nSaid, \"Oh, Doctor, dear,<br />\nWon't you please make it beer?\"<br />\n\"No, no,\" said the Doc, \"that's Teutonic.\"—Tiger.<br /><br />\n.75<br />\n.75<br /><br />\nI6<br /><br />\nTHE NEWS LETTER.<br />\nTHE SEEKER.<br />\nA traveler journeyed o'er the hills,<br />\nSeeking, seeking ever;<br />\nThrough the valleys, cross the hills,<br />\nResting never, never.<br />\n\"Oh weary man what urges thee?<br />\nPause and rest awhile.\"<br />\n\"Nay,\" he said, \"it cannot be,\"<br />\nWith a wistful smile.<br />\n\"Oh restless rover, seekest thou<br />\nSome cherished ideal?<br />\nlluck it from thy heart and brow<br />\nNow before the real.\"<br />\n\"Nay, nay,\" he sadly shook his head,<br />\nliast'ning with the day,<br />\n\"I must ever seek,\" he said,<br />\n\"O'er the hills away.\"<br /><br />\nA man died on the gallows here,<br />\nIn agony intense;<br />\nHe said he did not care so much,<br />\nExcept for the suspense.<br /><br />\nWillie fell in the molasses<br />\nBarrel, in the shed.<br />\n\"Now I'll lick you, Willie,\"<br />\nHis angry ITH)ther said.— 11idoz'.<br /><br />\nAs the umpire shouted \"three balls,\" the batsman started guiltily. -This<br />\nisn't the first time I've raised something on a diamond,\" he muttered, as he hit<br />\nthe next one and knocked a pop-fly to the pitcher.—Tigcr.<br />\nMary had a little lamb<br />\nThat tried to kx.)p the loop.<br />\nNow Mary has her little lamb<br />\nConverted into soup.—Tiger.<br /><br />\nOPEN ALL NIGHT.<br /><br />\nWILLIAXSON &amp; WATTS,<br />\nErui<br /><br />\n%toresac,,<br /><br />\nHoward and Franklin Streets.<br /><br />\nBaltimore and Eutaw Streets.<br /><br />\nEirttoo, ffancv Goats. Verfumerr, trotlet Brttcles, Ci41art3, Sam 11.7.11ater.<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br /><br />\nSurgical Instruments, Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT et. CO.,<br />\n704 MADISON AVE.<br /><br />\nC. &amp; P.'Phone 3350-Y.4111<br /><br />\nHENRY N. BRUNS,<br />\nDrawing Materials,<br />\nMathematical and Surveying instruments,<br />\nDraughtsmen's and Engineers' Supplies_<br />\nN. W.Corner<br />\nLexington and Liberty Sts.<br /><br />\nBAL,TiM01-2E, MD<br /><br />\nAgent for Nenffel cf. Esser. Co., o ..111<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br /><br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nHenderson s<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks. Note Books,<br />\nStud on t<br />\nSupplies.<br /><br />\nMadison &amp; Howard Sts.<br /><br />\nIncorporated 18'78.<br /><br />\n\"Ars Steong as the SteonAest.\"<br /><br />\nPIE FIDELITY MUTURL LIFE INSUIVINGE<br />\nOF PI-VILFI.DEL,Pf+IFV.<br />\nAN EX°ELLEN T 0P PORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during',vacation or permanently.<br />\nFor Agency in Maryland or West Virginia,<br /><br />\nAddress,<br />\nU. GRAHAM, Manager<br />\n800-8 Merchants Bank Bldg , Baltimore, Mdi<br /><br />\nFor Advertising Space in this Paper<br />\nAPPLY To<br /><br />\n(<br /><br />\n,,m-peepe/(4.&amp;m<br />\nPUBLISHERS.<br /><br />\nN<br /><br />\nCOP<br /><br />\nHALT\"vor C NQI:111:,!,<br />\n01,,r.<br /><br />\n11<br />\nA,<br /><br />\nBAIMOREAD.<br /><br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br /><br />\n7111<br /><br />\n700 Park Ave<br />\nNew York<br /><br />\n10 IT L L Y Equipped for<br />\nScholatly and Practical<br />\nwork, in the midst of the<br />\nItrisilan enterprises of a<br />\ngreat city,in close academic<br />\nrelations with Columbia and<br />\nNew York Universities, offers opportunities for the<br />\ndegrees of N. D., A. M. and<br />\nPh. D.<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nI odies.<br />\nSIXTY - EIGHTH YEfiR<br />\nbegins September 23, 1903.<br />\nAddress the President of<br />\nthe Faculty, the<br />\nRev. Charles 0. Hall, D. D.<br /><br />\nCapital $300,000. Surplus NI UridivInd Pion $400 000<br /><br />\nSTIEFF PIANOS<br />\nMADE OF<br /><br />\nTine 11141.4T MATERIALS MONEY<br /><br />\nAND FIII.MICIENCE CAN<br /><br />\nDrovers sc<br /><br />\nWwituraoomsi 0<br /><br />\nN. lAIIIERTY<br /><br />\nBooksellers and<br />\n8tationcrs.<br />\n34 W. WILEMORE STREET.<br /><br />\nGUSHING St GOMPANY<br /><br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br /><br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\nCollege of Baltimore.<br />\nSTATIONBRY — For School, Family, Office and Bank.<br /><br />\nBALTIMORE.<br /><br />\nL. Strouse, Vice-Prest.<br />\nEdw. P. Hayden. Ass't Cashisr.<br /><br />\njuts. Clark, Prost<br />\nChas. S. Miller, Cashier.<br /><br />\nft General Banking<br /><br />\nTHOS.BLAKE CO<br /><br />\nOn Bale The J. 11. U. Pennants. and all other College<br />\nPennants.<br /><br />\n219 EAST BALTIMORE Sr.<br />\nA H. FETTING,<br />\nGreek ILetter ffraternitv jeweIrp,<br />\nMANUFACTUMCM<br /><br />\nBALTIMORE, MD.<br />\n'Malin<br /><br />\nCall lino<br /><br />\nRecounts Solicited.<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br />\nPROFS. G. W. LFHMAN 6. SON.<br />\nFOR<br /><br />\nJORDAN STABLER GO,,A7NstSrAtvE.<br />\nof<br />\nSample<br /><br />\nubmitted<br /><br />\nFrench Brandy—no adulterants,no coloring, tine quality<br />\nOporto Fort-absolutely pure, of superior quality.<br />\nSherry—no coloring or adulterates, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlivethl—all tests show pure olive oil.<br />\nCider Vinegar—natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices-11U adulteration, all strictly pure.<br />\nBRANCH STORE AT ROLAND PARK.<br /><br />\nIlgenfritz Studio<br />\nSuccessor to Cummins.<br /><br />\nOF<br /><br />\n14 A:11:1 16 ST. PAUL STREET,<br /><br />\nBUSIIIIMS Transacted.<br /><br />\nSafe Deposit Boxes for. Rent<br />\nfrom 4.11 p, r year and upward.<br /><br />\nReads as follows:<br /><br />\nHaberdashers,<br />\nShirts, Neckwear,Underwear<br />\nINOMMEMINIMMEMMEMEM Hosiery, etc.<br />\nSHIRTSTO ORDER A SPECIALTY.<br /><br />\nNati Bank,<br /><br />\nMechanics<br />\nOF<br /><br />\nJILT'S%<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial Discount to Students.<br /><br />\nExamine our %lac Zefore 'Purchasing.<br />\nC.&amp; 0. telephone<br /><br />\nJENNINGS &amp; HORSEY.<br />\nMERCHANT TAILORS,<br /><br />\n21 W. FAY virpi.:<br /><br />\nSP-rit lc Err.<br /><br />\n445'.<br /><br />\nLibraries arranged and put in<br />\n*r<br /><br />\norder without removal.<br /><br />\nñ. RUZICKA<br />\nBoo/binder,<br /><br />\nBOOKS!! 1<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br /><br />\nPIPPEN'S 1300K STORE,<br />\n605 N. EUTRAN ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store,<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO. WARNER.<br /><br />\nWARNER &amp; CO.<br />\nUMBRELLAS, HATTERS, CANES,<br />\nAgents for Lincoln &amp; Bennett and<br /><br />\neTcr<br /><br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\nManufacturers of<br />\nSilk and Cassimere Hats. 406<br /><br />\nHopkins Caps<br /><br />\nGO.<br />\nS.<br />\nS.<br />\nLLOYD<br />\nN<br />\nNORTH GERMA<br />\nGABIN PASSAGE AT LOW RATES.<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBfiLTIMORE TO BREMEN DIRECT.<br /><br />\nSGHUMAGHER Sc GO., General Agents.<br /><br />\nFor particulars apple to<br /><br />\n.<br />\n,<br />\n.JAS. MCIKLIC. VioE-P' 1<br />\nISAAC H. DIXON, Pmts<br />\nJAS. R. RICHARDS, TREAS.<br /><br />\nTHE<br /><br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Howard St.,<br /><br />\nBaltimore, Md.<br /><br />\nSmith, Dixon Co.<br />\n..1Papet..<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36271, "display": null, "description": null, "target_type": "file", "target_uuid": "ccadd29c-330b-4652-9537-34af94988fbe", "url": "http://digital.library.jhu.edu/system/files/2022-03/12246-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12246, "target_type": "node", "target_uuid": "105988f9-afe3-4c3d-8c2b-6f7c8f337732", "url": "/node/12246"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "781c7e78-dbc3-4ee6-b339-815787debe6a"}]}