{"mid": [{"value": 37409}], "uuid": [{"value": "d66c25bc-a738-4dde-84a4-68e044f6ef63"}], "vid": [{"value": 37409}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:31:51+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13339-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:31:51+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:31:51+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL XXXIII, No. 11<br />\n<br />\n$10,000 CAGE GOAL<br />\nBY FRIDAY NIGHT<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 6, 1928<br />\n<br />\nLOCKARD NAMES SOPH<br />\nSPORTS MA1VAGER<br />\n<br />\nPRESIDENTIAL CAMPAIGN CAUSES<br />\nCHANGES IN BULLETIN BOARD<br />\n<br />\nFIRST BLUE JAY TO<br />\nAPPEAR NOVEMBER 1st<br />\nWith the copy already in the<br />\nhands of the printer a new<br />\nBlack and Blue lary will make<br />\nits 1928-29 debut in a few<br />\nweeks, probably before the St.<br />\nJohn's game.<br />\nA fervid subscription campaign' conducted by Business<br />\nManager Wood has netted as<br />\ngood deal of success as has the<br />\nadvertising staff in its line.<br />\nForty to fifty pages approximates the size of the magazine. Several contributions of<br />\nthe faculty are included with<br />\narticles of a more serious nature than has been in past issues.<br />\nAnother innovation will be<br />\nthe cover concerning which it<br />\nis rumored a novel color effect<br />\nhas been secured.<br />\n<br />\nThat the influence of the presi- the bulletin case with a new mesdential campaign is •powerful can- sage. The result of their plotting<br />\nAll Students Asked to- Sign<br />\nnot be denied. It was noted several and philological efforts resulted in<br />\nPledges Before Find of Week<br />\nweeks ago how the spirit of the the following:<br />\nN. Y. ALUMNI TO MEET<br />\ncampaign had intruded the very ofaL sMITH<br />\nfices of the faculty members and<br />\nPresident<br />\nfor<br />\nAverage<br />\nIs<br />\nAmount<br />\n$30<br />\nPledged<br />\nthen a little later the innermost reby Two Hundred Students<br />\ncesses of Chemistry laboratory. Its The little letters beginning the<br />\nlatest move has caused the old glass- Democratic candidate's Christian<br />\nAll efforts of the Cage Comcovered bulletin board with movable and surname were not deliberately<br />\nmittee are being bent toward getletters to be brought into service. put there to create a psychological<br />\nting $10,000 pledged among the<br />\nThis bulletin board opposite the effect; but the mean fact that large<br />\n).s,tudents by the end of this week.<br />\nPat<br />\nOffic-e has, for the past several A's and S's were missing ,necessiWith this amount in hand the<br />\nannounced without change tated the appearance.<br />\nyears,<br />\ncommittee will be able to go beof •the Y. M. C. A. Realizing that Hoover supporters<br />\nmeeting<br />\na<br />\nfore the New York alumni and<br />\nand an organization meeting of might post allegiance for him, the<br />\ncollect pledges from them. Supfootball candidates. This week, Smithites removed all H's and v's.<br />\nport on the campus so far has<br />\nhowever, the announcement with- They were justified in that no Hoobeen very discouraging. Only<br />\nin the case took a more mod- ver message appeared but great was<br />\n$6,000 has been pledged. The avern and a decidedly political as- their consternation the next day to<br />\nerage pledge has been $30.00.<br />\npect. A pair of rabid \"Smithites,\" see the following message,:<br />\nThis. amount includes all that<br />\nwishing to make knoWn to all freaL sMITH<br />\nmoney 'pledged last year in the<br />\nquenters of the Post Office that their<br />\nspring drive.<br />\nfor Bartender<br />\nare decidedly<br />\nwas unfortunate that there High School Team Has Little political sympathies<br />\nIn such manner Is collegiate popro-Smith, and, also, that they are<br />\nDifficulty<br />\n-should have been. two separate<br />\nat least they hope so, that litical support and opposition exdrives conducted on the. campus The Freihman team was.defeated confident,<br />\nvictorious, furnish& pressed.<br />\nicn the same year and at about the Friday by Forest Park High School, Al will emerge<br />\nSchiebel Captures First Place;<br />\nsame- time. Levering Hall and ,15 to 0. The Freshmen, still a green<br />\nRival Captain Second<br />\nLacrosse Practice<br />\nits campaign hung fire for many team, fought hard against this more Yearlings Prepare For<br />\nBlack and Blue harriers took five<br />\nPoorly Attended<br />\nmonths and it has only been with- seasoned onslaught. During the first<br />\nAnnual Soph Game<br />\nout of the first seven places, as<br />\nin the last few weeks that infor- half Forest Park had the ball nearly<br />\nWith a few upper classmen, Freshmen and Sophomores Are Hopkins' cross-country team defeatmation was obtained that ,this all the time. A series of end runs<br />\nOnly Ones to Appear<br />\ntheir fall laed Lehigh 20 to 35 at the home<br />\nnew building -would be erected. took the Forest Parkers to their frosh have started<br />\nanticipation of<br />\n• Fall lacrosse practice has suffered course Saturday. Schiebel finished<br />\nLast Friday's issue of the 'News- first touchdown. The try for after crosse practice in<br />\nwith the sopho- greatly this year so far from appar- first, making the run in 24 minutes<br />\nLETTER contained the announcement point failed. After holding Forest the coming game<br />\npractice began<br />\nent lack of interest. It would seem 25 1-5 seconds.<br />\nof the definite awarding of the Park for downs on our five iyard mores. Although<br />\nthe turnout is not that having won an Olympic berth<br />\nSames,, Lehigh captain, finished<br />\ncontract to builders and the line a bad pass from center *Oared some time ago<br />\nbeen expected, only would stimulate interest, especially second, and was followed by Onocampus became assured of anoth- a safety against Hopkins! Again _vvha(, has<br />\nup<br />\nshowing<br />\nmen<br />\ndozen<br />\nas almost all of the championship rato of Hopkins. Captain Bob<br />\ner building._ If it was essential Forest Park, through tackle and about a<br />\nA number of the stuteam has graduated. This is not the Kelley was fourth to get in, and<br />\nfor the entire campus that there center, rushed down the field for regularly.<br />\nare<br />\nwho can play lacrosse<br />\ncase, however, and so far only a few the others finished in the following<br />\nbe a building erected to take the 'several first downs and their second dents<br />\ncoming out because they are Freshmen and Sophomores have re- order: Emerson, J. H. U.; Lange,<br />\nplace Of--the--Barn, it is even more -touchdown. This time the after not<br />\nnot willing to spend the time or<br />\nLehigh; Waters, J. H. U.; Gadd,<br />\nso for the future of all activities point was scored by a afo—pkick. ported.<br />\nhave not heard that practice has<br />\nLehigh; Miller, J. H. U.; Loiseaux,<br />\nthat there be a new cage erected.<br />\nTuesday,<br />\nevery<br />\nheld<br />\nis<br />\nPractice<br />\n,<br />\nSecond Half<br />\nreally began. Those men are reJ. H. U.; McElroy, Lehigh; Rosser,<br />\nPractically An Activities Building<br />\nComing back after the half, the quested to appear so that they Wednesday, amil Friday at four<br />\nIn. many senses this new buildJ. H. U.; Proebsite, Letort, And<br />\nFreshmen outplayed the Parkers but will be in their best condition and o'clock. Kelso Morrill is doing most<br />\ning will be more of a student acNeuwirth, Lehigh; and Blanchard.<br />\ncould not break for a touchdown. the team will have had some time in of the Coaching, ably assisted by a<br />\ntivities 'building than the LeverComes Four and Half Mho<br />\nDan Miller received a bad kick on which to develop a fair amount of few of the Olympic team members.<br />\ning Hall. Room will be provided<br />\nFather Bill Schmeisser, the official, The course, which begins and<br />\nhis head and had to be taken out teamwork.<br />\nfor the Barnstormers to hold theit:<br />\nends at Homewood Field, describes<br />\nof the game. Several passes were<br />\nPractice ' days are Mondays, coach, manages to get out to practice<br />\nannual play, sufficient space to<br />\ncompleted frout Goldberg to Mill- Tuesdays, and Fridays from four about once a week but he gets a something approximating a circle<br />\naccommodate large crowds lithe<br />\nman. The backfield gained through until six. -Also Morrill, Ben good line on any likely material throughout the vicinity. It is about<br />\nbasketball games is incorporated<br />\nfour and a half miles long. The<br />\nthe line making many first downs in Eagan, and Purnell Hall, in ad- from Mr. Morrell.<br />\nindoor<br />\nfor<br />\nwhile<br />\nin the plans,<br />\nthe last quarter. Hudert and Gold- dition to a number of other old<br />\nCaptain \"Bill\" Kegan will proba- record for the course was made by<br />\npractices of the major sports<br />\nberg were largely responsible for varsity men are coaching the can- bly be the man around whom the Dick Gwinn, '27, in the Maryland<br />\nteams the new cage will be unsurthis taking full advantage of the didates. There has not as yet defense will be built this year. meet of that year. His time was<br />\npassed. June Week and its many<br />\nholes opened up for them. O'Con- been any intensive training, mere- Johnny Lang is left at center and 22 minutes and 59 seconds, bettering<br />\nactivities will center around this<br />\nnell at end played a fine defensive ly light practice for accurate and Egan is the only man back on the by 26 seconds his own record of 23<br />\nnew structure, and the Cotillon<br />\ngame, boxing in every play. The snappy stick work. The coaches attack. Only a few substitutes re- minutes and 25 seconds, established<br />\nClub will schedule many of its<br />\nkicking was done by Hudert and are not as yet in any position to main, among them Herpsberger, in 1926.<br />\nfunctions within its walls.<br />\nGoldberg.<br />\nsay anything definite as to the Caplan, Brownley, Hall, and Lyons The run on Saturday was the<br />\nUp to Students<br />\nSubstitutes<br />\nchances of the sophs and frosh. stand out as the -best prospects. first of the season for Hopkins. LeInterest in this project has been<br />\nMany of the substitutes had a<br />\nLitchfield and Levy have been There are, however, plenty of open high had previously beaten Dickonly lukewarm mainly because chance to prove themselves both in- appointed as managers of the la- berths but it is very important that inson and been,defeated by Columthe undergraduate has not been the backfield and on the ends. Her- crosse team. but due to football new men get this fall practice in bia University. The Black and Blue<br />\nsufficiently informed of the impor- shey was very much pleased by the practice have not been able to de- handling the stick and getting a fun- will go to •Schenectady next Saturtance of his support. • Frankly, showing which the team made vote much time to their office.<br />\ndamental ida of the Hopkins meth- day to oppose Union College's crossthe entire issue is up to him. against this more experienced- -orod of pldaying. Sticks are furnished country team.. The prospects are<br />\nWithout his support, the commit- ganization.<br />\nregarded as favorable to Hopkins,<br />\nto everyone who cares to try out.<br />\ntee cannot go before the alumni<br />\nDebating Council<br />\naccording to Captain Bob Kelley.<br />\nmarked imshowed<br />\nteam<br />\nThe<br />\ntheirs.<br />\nfor<br />\nand ask them<br />\nAttends Dinner<br />\nThe New York University recently<br />\nOn Friday night before the Co- provement both in offensive and dehanded the Union harriers their first<br />\nStudents and<br />\nGraduate<br />\npresident<br />\nGardiner,<br />\nB.<br />\nNorman<br />\nrapis<br />\nlumbia game there will be a fensive playing. As the team<br />\ndefeat out of 24 dual meets.<br />\nReception<br />\nHold<br />\nFaculty<br />\ncoundebating<br />\nyear's<br />\nmeeting of the alumni in New idly rounding into form there is lit- of the last<br />\nKelley Pleased<br />\nYork. The committee wants to tle doubt but that the sophomores cil, entertained the rfiembers of<br />\nOne hundred and fifty graduate<br />\nCaptain Kelley pronounced himthe council at a dinner, given last students and members of the faculty<br />\nbe able to show this gathering<br />\nself especially pleased that his men<br />\nwill be given a hard- game. The Thursday at his home in Ruxton.<br />\n.$10,000 in student pledges. The<br />\nstudent recep- finished in a bunch, and pointed out<br />\nis trying to arrange The affair was very well attend- attended the graduate<br />\nband of the university is being Freshman team<br />\ntion given in the C. E. hall last Fri- the importance of this in cross-couned, about eleven of the members<br />\ntaken -to the game with the idea a game for next Friday..<br />\nday night. The affair was spon- try running. The importance is due<br />\npresent.<br />\nbeing<br />\nof impressing Black and Blue<br />\nLine-up: •<br />\njointly by the faculty and to the method of scoring, the orthe<br />\nof<br />\nForest Park<br />\nalumni in the metropolis<br />\nHopkins<br />\nPlans were made for the pres- sored<br />\ngreat need for a cage. To facil- O'Connell<br />\nLegum ent year. Full fall, *inter, and Y. M. C. A. The committee in der in which the first five runners of<br />\nR.E<br />\nitate making pledges, \"Doc\" AdNichols spring programs have been ar- charge consisted of _Dr. Matthews, each team finish being totaled and<br />\nR.T<br />\nMiller<br />\nams is keeping a number of<br />\nWeir ranged. g*In addition to the an- Dr. French and Mr. Schaal. The the wi nner as in golf, being the one<br />\nR.0<br />\nSigler<br />\nblanks at his place and will give<br />\nnual De Tocqueville medal, and general committee represented all of with the lowest score; consequently,<br />\nMagazine<br />\nthem to anyone wishing to sign Doeller<br />\nAzzarello Adams medal, contests and the the graduate department's at Home- a group of men finishing together,<br />\nL.G<br />\nthem. Pledges are also being Levy<br />\nahead of their opponents, secures a<br />\nLivomley class debates an unusually large wood.<br />\nkept in the Treasurer's office. Small<br />\nL.T<br />\nmaximum number of low counts for<br />\nEngof<br />\nProfessor<br />\ncontests<br />\nintercollegiate<br />\nGreenlaw,<br />\nof<br />\nDr.<br />\nnumber<br />\nBrown<br />\nL.E<br />\nLitchfield<br />\nAll Asked to Sign<br />\nlish Literature, delivered an address their team. This sign of balance on<br />\nOne part of the signing of these Millman<br />\nBoyle and trips have been arranged.<br />\nL.H<br />\nthe Hopkins team was interpreted<br />\npledges that is not generally un- Harris<br />\nClabaugh<br />\nRH<br />\nThere will be a meeting of the on \"The Community of Learning.\"<br />\nderstood is that no pledge will<br />\nPreist council Friday at one P. M. in Dancing and cards featured the u- by Captain Kelley as an indication<br />\nQ.B<br />\nGoldberg<br />\nbe collected until the entire<br />\nLong Room 112, Gilman, for the mem- mainder of the evening's program. of i.00d prospects for the season.<br />\nF.B<br />\namount to build the cage has been Hudert<br />\nSchiebel, in spite of an injury to<br />\nfirst affair of its kind<br />\nsubscribed. Although the aver- Substitutions --- By Freshmen: bers. Those who wish to partici- This is the<br />\nage pledge has been $30.00, it is Wood for Doeller, Collier for pate in the activities of the coun- given at Homewood. Its purpose his ankle, is showing up well and<br />\nthe desire of the committee that Wood, Clark for Litchfield, Beck- cil or try out for the team will was to effect a closer fellowship be- gives promise of a stellar performeveryone make a pledge regardplan graduate stu- ance in the Middle States Intercolsinsky for Harris, Stange for Har- be given an opportunity to do so tween new<br />\nless of the amount that he is able<br />\ndents and members of the faculty. legiate championships.<br />\nat a later date.<br />\nris.<br />\nto give.<br />\nAt the Sophomore class<br />\nmeeting on Thursday of last<br />\nWeek, Pfesident Lockard of<br />\n'31 announced the appointment<br />\nof managers for the football<br />\nand lacrosse squads, which<br />\nwill meet the yearling class in<br />\nthe near future. Heinzerling<br />\nwas created manager of football, while Kyle was made<br />\nmanager of the sophomore<br />\nstick wielders. _The freshmen<br />\nhave been. practicing on both<br />\nof these sports -for the last<br />\nthree weeks,. while the Sophs<br />\nhave made little effort to throw<br />\naside their lethargy and defend their laurels.<br />\n<br />\nFRESHMEN ELEVEN<br />\nDEFEATED BY PARKERS<br />\n<br />\nCROSS-COUNTRY TEAM<br />\nBEATS LEHIGH, 20-35<br />\n<br />\na.<br />\n<br />\nBLUE JAYS DEFEAT<br />\nRANDOLPH-MACON<br />\n_<br />\nJays Score Easy Victory Over<br />\nWeak Virginians<br />\nCAPLAN AGAIN SHINES<br />\nMany Substitutions Made; Jays<br />\nRoll Up 34 Points<br />\nI'laying excellent football against<br />\nfar inferior opponents, the Johns<br />\nHopkins team defeated the Randolph-Macon eleven in a one-sided<br />\ncontest, by a score of 34-0. The<br />\nJay team showed glimpses of real<br />\npower and the Black and Blue rooters have reason to feel confident<br />\nthat the remaining three games will<br />\nbe played in a manner which will<br />\nbring credit to their Alma Mater.<br />\nFrom the very first kick-off it was<br />\napparent to the spectators that the<br />\nSoutherners were no match for their<br />\nopponents. After receiving the ball<br />\nJay team did not lose possession<br />\nof it until they had, by straight line<br />\nplunges, carried the ball over for<br />\nthe first score of the game. Howard Caplan added the extra point<br />\nwith his unerring toe. A few minutes later the Jay team scored the<br />\nsecond touchdown of the contest.<br />\nThis time it was Hu:nie Houston<br />\nwho traversed the last white marker<br />\nto add six more points to the Hopkins score. The try for point was<br />\nwide and the score was 13-0.<br />\nSoutherners' Defense Weak<br />\nRandolph-Macon was displaying<br />\na complete lack of defense against<br />\nthe Jay line plays and it was quite<br />\nevident the way the game would end.<br />\nEach exchange of punts was netting<br />\nthe Hopkins club anywhere from<br />\nten to thirty-five yards, and soon<br />\nCoach Van Orman began substituting so that at the end of the game<br />\nHoward Caplan was the only regular left in the line-up.<br />\nThe Blue Jay's third score came<br />\nfive minutes after the beginning of<br />\nthe second quarter. A well executed<br />\npass, once again from I,yons to<br />\nHouston, put the ball on RandolphMacon's 28-yard and Mills, Caplan,<br />\nand Besore took the ball over on<br />\nthree more plays. Caplan added the<br />\nextra point, making the score 20-0<br />\nin the Jay's favor.<br />\nCaplan Plays Entire Game<br />\nWith most of the starting team<br />\nhaving been withdrawn from the<br />\ngame Jay rooters expected to see<br />\nan immediate let-up in the power<br />\nbeing displayed but in this they were<br />\npleasurably surprised. Lyons was<br />\ntaken from the game and Ashton<br />\nDevereaux took up the job of quarter in a mighty creditable manner.<br />\nAfter an exchange of punts the ball<br />\nwent to the Jays on the Southerners' 43-yard line! From this point<br />\nit took the Hopkins team just five<br />\nplays to put the ball across. Once<br />\nagain Caplan's try for point was<br />\ngood and the half ended a moment<br />\nlater with the score 27-0.<br />\nThe final Hopkins score came in<br />\nthe middle of the third period on<br />\na pass from Devereaux to Bledsoe.<br />\nFrom this point on the game seesawed back and forth most of the<br />\nplay being in the Virginian's territory. On several occasions the Randolph-Macon team came very dose<br />\nto scoring by the overhead route,<br />\nbut each time their well-thrown<br />\npasses were grounded and they ended the cooptest without scoring.<br />\nLine-up:<br />\nHopkins<br />\nRandolph-Macon<br />\nL.E<br />\nHouston<br />\nSmith<br />\nJohnson<br />\nL.T<br />\nL.G<br />\nTobvien<br />\nL<br />\nCompton<br />\nTrader<br />\nC<br />\nPowell<br />\nBrown<br />\nKeganR.G<br />\nBialoskorsky .R.T<br />\nWithrow<br />\nZimmerman .R.E<br />\nDouthat<br />\nQ.B<br />\nBurger<br />\nF.B<br />\nWoodson<br />\nLaypolnasn<br />\nC<br />\nH.B<br />\nJ:rya t<br />\nMills<br />\nH.B<br />\nCockrell<br />\nBesore<br />\n<br />\nthr<br />\n<br />\n\f1928<br />\n-LETTER, NOVEMBER 6,<br />\nTHE JOHNS HOPKINS NEWS<br />\n2<br />\n<br />\nME:LETTER POLITICALATDEBATE<br />\nASSEMBLY<br />\n<br />\nTHEME<br />\n<br />\nFOUNDED 1897<br />\nSubscription<br />\n<br />\n•<br />\n<br />\n$2.00<br />\n<br />\nPostofflce in<br />\nEntered as second-class matter December 3, 1909, at the<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from—OCtOber to June by the—students<br />\nHopkins University.<br />\n<br />\nCongressman Frear and \"-. Moylan Are Speakers<br />\n<br />\nT<br />\n<br />\nTopcoats • • •<br />\n<br />\nstyle;<br />\nWith a carefree, nonchalant<br />\nwell tailored of fine Scotch and<br />\nAmerican fabrics; maximum<br />\nwarmth; minimum weight, and'<br />\nlight on the college budget.<br />\nReady,to-Wear<br />\n<br />\nBaltimore's Newest<br />\n:•: and Finest :•:<br />\n-A Hotel of Atmosphere<br />\nand Environment.'<br />\n<br />\nSTOCK ARGUMENTS USED<br />\nEach Speaker Upheld by His<br />\n-Respective Admirers<br />\n<br />\nCongressman Frear, a Republican<br />\nBUSINESS MANAGER, from ‘Visconsin, and Mr. Moylan,<br />\nBusiness communications should be addressed to the<br />\nto the MANAGING<br />\nJohns Hopkins University. All articles should be sent<br />\na Democratic Baltimore lawyer,<br />\nZOITOR; other communications to the Eorroa-IN-CHIEF.<br />\nwere the speakers at last week's.<br />\nUniversity 0100 political assembly. Each upheld his<br />\nTelephone<br />\nrespective party in a twenty-minute<br />\ndiscussion followed by a: five-minute<br />\nEDITORIAL DEPARTMENT<br />\nrebuttal.<br />\nEditcsr.isIChaef<br />\nThe second speaker, Congressman<br />\nGEORGE E. BANKS, JR., '29<br />\nFrear, displayed by far the more<br />\nEditor<br />\nManaging<br />\nAssistant<br />\nor<br />\nEdit<br />\nManaging<br />\nexcitable nature-of the two and due<br />\nGROsai GUMP,'30<br />\nPHILIP W. NESS, '29<br />\nea. to this fact he lost much of the<br />\nAssociate Editors<br />\nstrength of his argument.<br />\nRICHARD H. WOOD,'29<br />\nWiLmest H. DRIVER, '29<br />\nMr. Moylan Begins<br />\nROBERT S. BAIRD, '30<br />\nMr. Moylan began the diseussion.<br />\nJunior Editors<br />\nIn the course of his presentation he<br />\nW. Purnell Hall, Jr., '30<br />\nStewart L. Smith, '30<br />\nsaki that everyone is claiming that<br />\nE. Foster Dowell, '29<br />\nLeonard B. Motley. '29<br />\nG. Hunt. '31<br />\nRichard<br />\na Republican President muSt be<br />\nH. Garland Hershey, '29<br />\nHarwood F. Mullikin, Jr., '31<br />\nPaul W. Spear, '30<br />\nelected if prosperity is to continue.<br />\nIrving K. Gordon, '29<br />\nGeorge H. Dowell. '31<br />\nHe then added that some four milCharles Harry, '31<br />\nlion persons unemployed are assurBUSINESS DEPARTMENT<br />\nedly no signs of either former or<br />\nBusiness Manager<br />\npresent prosperity. Mr. Hoover, the<br />\nHARRY 0. scimoss,. JR., '29<br />\n.AteevviempallIIIII1111111111111111<br />\n1111111111F—\"*-Republican candidate for President,<br />\nCircidation Manager<br />\nAdvertising Manager<br />\nJ. ROBERT MYERS, '29<br />\nhad charge of agriculture in this<br />\nGEORGE M. GLAZIER, '29<br />\ncountry, and facts show that 1,000,Advertising Staff<br />\nOffice Staff<br />\nAlvin H. Blum, '30<br />\n000 farms have been abandoned for<br />\nTheodore A. Fleishman. '31<br />\nGus Burke. '31<br />\nRandolph Rothchild, '31<br />\nvarious reasons. In the course of<br />\nJohn Lots, '30<br />\nLeroy Shugar, '31<br />\nGeorge S. Robertson, '31<br />\nlast year, alone, Moylan said, there<br />\nJohn A. Jamieson. '30<br />\nSidney Rattel, '91<br />\nwere 37,000 business failures in -the<br />\nStaff Photographer<br />\nUnited States.<br />\nWALTER D. SCHEIDT. '30<br />\nAn even, more serious thing could<br />\nbe looked back -upon in the form of<br />\nStreets,<br />\nSouth<br />\nand<br />\nLombard<br />\nCompany,<br />\nRead-Taylor<br />\nThe<br />\nby<br />\nPrinted<br />\nthe temporary collapse of the FedBaltimore, Md.<br />\neral Reserve System. Since that<br />\nmemorable panic this System has<br />\nrisen to the greatest heights of any<br />\n.tem, the<br />\nsystem known. • This sys<br />\nlawyer claimed, Was due entirely to<br />\nWoodrow Alison's 'administration,<br />\nand credit for its perf_ection can be<br />\nBROWSE<br />\nTO<br />\nRIGHT<br />\nTHE<br />\nclaimed by no one else. Facts show<br />\nHE UNIVERSITY LIBRARY stacks have, since time immemorial,<br />\nthat only six Republicans .voted for<br />\nbeen maintained as a sort of sanctuary for the intellectual delecthis system when it was brought, behallowed<br />\ntation of a small body of graduate students. From this<br />\nfore the legislators at Washington.<br />\nground, the undergraduates are barred by the watchful eyes of the<br />\n.Hoover a Hero '<br />\nbibliophilistic custodians.<br />\nMoylan, after mentioning several<br />\nNow it so happens that, at frequent intervals during the colof the Republican adinconsistencies<br />\nlegiate year, undergraduate students are assigned the task of writing<br />\nministrators, conceded the fact that<br />\npapers on some particular subject in such studies- as English LitHoover had emerged from the war<br />\nerature, Political Economy and Political Science. In the preparation<br />\nof these theses, it is necessary for the author to constantly refer to a<br />\nas a great civilian hero. He was<br />\nlong list of sources for his material. He must investigate the works<br />\nalso an outstanding business success.<br />\nof numerous authorities in order to obtain the proper details and<br />\nBut, the Democratic speaker said,<br />\nopinions which will assist him in his task.<br />\nSmith's achievements outnumber<br />\nUnder the present system employed by the University. Library,<br />\nthose of the Republican candidate.<br />\nthe undergraduate must first thumb through countless red and white'<br />\nIn only three occasions in many<br />\nedged cards in the index files, fill out other cards, hand them to the<br />\na<br />\nexperience<br />\nthen<br />\nand<br />\nlibrarian, wait for the delivery of the books<br />\nyears of office did Smith dismiss Revolthe<br />\nof<br />\nnone<br />\nthat<br />\ndiscovering<br />\nupon<br />\nsensation<br />\nrather disheartening<br />\npublican appointments. In seven and<br />\numes contains the information for which he is seeking.<br />\none-half years the Republican State<br />\naverThe<br />\ninadequate.<br />\nare<br />\nshelves<br />\nreserve<br />\nso-called<br />\nthe<br />\nof<br />\nMost<br />\nLegislature has not vetoed a single<br />\nage selection of reserve books contains only works ofa very general<br />\nlaw suggested by Smith..<br />\ncharacter, which deal with the subject in broad terms.<br />\n\"Awful Republican\"<br />\nThis,state of affairs seems to us to be a rather intolerable one.<br />\nCongressman Frear introduced<br />\nThe retention of books behind closed doors simply stifles a certain<br />\nhimself as one of those \"awful Reinstinct for research which every true college student possesses. Call<br />\npublicans,\" and mentioned that he<br />\nit \"Intellectual Curiosity,\" if you like. Nevertheless a truly educated<br />\nman receives an immense amount of satisfaction from the searching<br />\nwas well aware of the fact that he<br />\nout of facts. He enjoys browsing about book shelves, thumbing<br />\nwas speaking to. an, Al Smith audi,<br />\nto<br />\n_worlds<br />\nintellectual<br />\nnew<br />\nthrough' attractive volumes, discovering<br />\nence. He brought out that his opconquer.<br />\nponent was worthy. etc., but that<br />\nPerhaps the Hopkins Library fears that free access to its colleclust as the candidate whom his option will afford an opportunity for stealing. Such an argument apthe<br />\nat<br />\nemployed<br />\nponent represented, \"he' doesn't<br />\npears quite ridiculous when one considers the system<br />\nEnoch Pratt Free Library's main'building and branches. Here is an<br />\nknow what he is talking about.\"<br />\ninstitution which'is patronized by all sorts and classes of people, white<br />\nThen followed a series of sentences<br />\nand black; rich and poor. Yet, though the Pratt Library maintains<br />\ndealing with war expenditures of<br />\nan open shelf system, very few volumes are stolen, according to .the<br />\nwhich the Republicans spent $1,testimony of Mr. Wheeler.<br />\n000,000,000. Frear admitted conIf the Pratt Library can successfully operate such a plan why is<br />\nIt that the Library of the Johns Hopkins University, serving a body<br />\nsumption of airplane expenditures<br />\nof college students sworn to honesty through the honor system, canand mentioned that he was out west<br />\nnot adopt the same practice?<br />\nto investigate the spruce situation in<br />\nfrom<br />\nundergraduates<br />\nbarring<br />\nof<br />\npractice<br />\npresent<br />\nthe<br />\nthat<br />\nfeel<br />\nWe<br />\nconnection with material used for<br />\nthe library stacks is an unfair discrimination. Perhaps there is some<br />\nairplane construction. On his trip,<br />\nadequate and plausible reason for the stand of the librarian—as yet,<br />\nrein<br />\npolicy\"<br />\ndoor<br />\n\"open<br />\nAn<br />\nhe brought out, he discovered even<br />\nwe have betn unable to ascertain -it.<br />\nall,<br />\nafter<br />\nBooks,<br />\nadvocate.<br />\nwe<br />\nissue<br />\nthe<br />\nis<br />\nstacks<br />\nlibrary<br />\ngard to the<br />\nworse corruption on the railroads,<br />\nare written to be read.<br />\nthe controlling element of which<br />\nwere Democrats. •<br />\nThe rebuttals consisted of the repA TRADITION TO REVERE<br />\netition of a few \"stock\" arguments<br />\nEVERAL days ago, we were considerably shocked to view the specby each speaker. In these rebuttals<br />\ntacle of a precocious freshman nonchalantly strolling through<br />\neach speaker objected to the lack of<br />\nthe Gilman Memorial Room. There was no doubt regarding the<br />\ntime within which to produce sufquestion of his University status. Around his neck was a tie of<br />\nverdant hue, in his lapel was a button embossed with the sixth letter<br />\nficient proofs.<br />\nof the alphabet, and on his,face was the wideeyed, innocent look,<br />\nso characteristic of new born infants and college freshmen.<br />\nNOTICE<br />\nPerhaps this particular student was trespassing in the Memorial<br />\nRoom in order to ascertain just what would happen if he were deSophomore<br />\nlacrosse canditected. Perhaps his presence was due to ignorance of Hopkins tradates are to report for pracdition. We are inclined to accept the latter theory in view of the<br />\ntice<br />\nand to<br />\nimmediately,<br />\ngeneral lack of knowledge of University customs which seem to prebring their own equipment or<br />\nvail among the members of the present freshman class.<br />\nold clothes, if possible.<br />\nThe Gilman Memorial Room is reserved solely for the use of<br />\nAny sophomores who<br />\nthe seniors. This is one of the most sacred of all Hopkins traditions<br />\nhave not paid their dues are<br />\nand one which should be implicitly obeyed not only by the freshmen,<br />\nrequested to do so at the<br />\nbut by all underclassmen. To them, we appeal for the observance<br />\nPostoffice.<br />\nand perpetuation of this noble and sacred tradition, in memory of our<br />\nUniversity's first president.<br />\n<br />\nEDITORIAL COMMENT<br />\n<br />\nTHE SOUTHERN<br />\nHOTEL<br />\n<br />\n.,&,131DDI<br />\nLEY.RAM_KS<br />\n<br />\nor more<br />\nEstablished 1832<br />\nPHILADELPHIA<br />\n<br />\n3ro5.ciii05 8c ibon<br />\n<br />\nSCHOOL RINGS, EMBLEMS,<br />\nCHARMS AND TROPHIES<br />\nOf the Better Kind<br />\n<br />\nFive East Lexington Street<br />\n<br />\nTHE GIFT SUGGESTION BOOK<br />\nMailed upon request—illustrates<br />\nand prices<br />\n<br />\neArt Invitation<br />\n<br />\nJewels, Watches, Clocks, Silver,<br />\nChina, Glass, Leather and Novelties<br />\nfrom which may be selected<br />\ndistinctive Wedding, Birthday,<br />\nGraduation and other gilts<br />\n<br />\nifthe Johns Hopkins students.we extend a cordial. invitation to come in and see our beautiful,<br />\nhand-wrought Jewelry, our importations of ancient<br />\nand modern gifts. Prices very moderate.<br />\n<br />\nCARL SCHON, INC.<br />\nNEW<br />\n<br />\n109 W. SARATOGA ST.<br />\nOXFORD GRAYS<br />\n<br />\nSuits Topcoats Overcoats<br />\n$28.75<br />\n<br />\nFIDELITY AND DEPOSIT CO.<br />\nof Maryland<br />\n<br />\n38.75<br />\n<br />\n,<br />\n<br />\nWe just received a 'new<br />\nassortment of Oxford Grays<br />\nin shadow striped, slightly<br />\nvisible overplaids<br />\n<br />\nBALTIMORE BRANCH OFFICE<br />\n<br />\nand<br />\n<br />\nherringbone effects.<br />\n<br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\n<br />\nD. C.<br />\n<br />\nHANDY,<br />\n<br />\nGROUND FLOOR, FIDELITY BLDG,<br />\n— Phone PLaza 0800<br />\n<br />\nManager<br />\n<br />\nDo not fail to see them<br />\nCaution Money vouchers accepted<br />\n<br />\nWILLARD<br />\nTAILORING CORP.<br />\n- FAYETTE ST. AT HANOVER.<br />\nFIRST 'FLOOR<br />\n<br />\nTreat yourself to<br />\na flight “as the<br />\ncrow flies -with<br />\n<br />\nCigarettes.<br />\nClub Lounge<br />\nFree Phone<br />\n<br />\nThe<br />\nCHESAPEAKE<br />\nAIRCRAFT CO.<br />\nLOG,N FIELD<br />\n<br />\n0<br />\n<br />\n1<br />\n¢rdtiit<br />\nIESTABiatital E114GLI-SaNIVIERSITY<br />\nSTYLES,IFAIliORS6-4)ViiiilbUTHFUL<br />\nCHARTS SoCELY FOR DISTiiiGUISHEO<br />\nTlik,s1.011144) STATES.<br />\nSERVICE I<br />\n<br />\nReporter<br />\nconverts News<br />\ndor to this<br />\nPipe Tobacco<br />\n<br />\nhA4e1onsei<br />\nSuitt<br />\n<br />\nLondon, England.<br />\nFeb<br />\n'7, 1928<br />\n<br />\nLarus & Bro. Co.<br />\nRichmond, Va.<br />\nDear Sirs:<br />\nAbout two years ago I bought a tin<br />\nof Edgeworth tobacco. I was so<br />\npleased with its slow-smoking qualities<br />\nand wonderful aroma that I became<br />\nan Edgeworth enthusiast and have<br />\nsmoked no other tobacco since, althouth up to that time I think I can<br />\ntruthfully say I had tried every wellknown British mixture and flake.<br />\nMoreover, I introduced one of the<br />\nother reporters to it. He in turn introduced another and he another until<br />\nfinally it reached the News Editor.<br />\nThere are now five of us all smoking<br />\nEdgeworth and enjoying it so much<br />\nthat I thought you might like to have<br />\nthis little appreciation of what, to<br />\nBritishers, is a comparatively unknown tobacco. I wish you every<br />\nsuccess.<br />\nYours faithfully,<br />\n(signed) David Moore<br />\n<br />\nEdgeworth<br />\nExtra High Grade<br />\n<br />\n*45;----40 Overcoats<br />\n==<br />\n<br />\nF.- BY SPECIAL APPOINTMENT<br />\n<br />\n3<br />\n<br />\n01111 STORE IS THE<br />\n<br />\nartrUr1 ouzel<br />\nOF BALTIMORE<br />\nMe<br />\n<br />\nThe character of the suite and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\nPine<br />\n<br />\nHub<br />\n<br />\n•<br />\n<br />\nMO.<br />\nOMMI<br />\nMMIM<br />\n<br />\nBaltimore. Charles and Fayette<br />\n<br />\nOM<br />\n<br />\nSmpking Tobacco<br />\n<br />\nMfimm<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1928<br />\n<br />\neA. H. FETTING<br />\ne3vIANUFACTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek LetterFraternity Jewelry<br />\n3.11:_NORTIICHARLES STREET<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nDECORATIONS<br />\n<br />\n•<br />\n<br />\nJOHN C. KNIPP 6? SO2NIS<br />\nFURNITURE<br />\nBALTIMORE, MD<br />\n<br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths since 1857<br />\n.DRESS SETS<br />\nfor evening wear.<br />\n7 and 9 East Baltimore Street<br />\n<br />\nAli<br />\n<br />\nwhiting-<br />\n<br />\ntielkihift Iii.<br />\n<br />\nAre the New Fall Books!<br />\nYou'll find rows and rows of them-brand-new books in bright<br />\nof printer's ink and crisp paper-fiction,<br />\npungently<br />\n-smelling<br />\ncovers<br />\npoetry, biography, science-awaiting your choice at our two stores<br />\n<br />\nTHE NORMAN,REMINGTON CO.<br />\nDown.TOwn: •<br />\nCharles St. at Mulberry<br />\n<br />\nUp•Town:<br />\n1118 North Charles St.<br />\n<br />\n,<br />\n<br />\nStep Out From The Crowd!<br />\nBe an exception-Be a Successful Somebody<br />\nWith a Savings Account you are on the highroad<br />\nto success-Orportunity waits beyond.<br />\n<br />\nPARK BANK<br />\nLexington Street at ,Liberty •<br />\nNorth Avenue at Charles<br />\n4819 Belair Road at Southern<br />\n<br />\ns<br />\n<br />\nJ. A. RITTER Es? SON<br />\nFlorists and Decorators<br />\n1918 N. CHARLES ST., Near 20TH.<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nPhone. N'Ernon 0573<br />\n<br />\nFORDYCE E. C. CAMPBELL<br />\nHOPKINS ALUMNUS<br />\n<br />\nAll Lines of Insurance<br />\nPhone, Plaza 1062<br />\n<br />\nESSO<br />\n<br />\nNEW LIFE<br />\nFOR MOTORS<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL COMPANY OF N.<br />\n<br />\n\"Friend of the Hopkins Man\"<br />\n<br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br />\n<br />\n$3179.25<br />\n<br />\nReceipts<br />\nTag Week, Raffle and Co$224.00<br />\ntillion Club<br />\n1971.00<br />\nClass Assessment<br />\nJune Week Ticket Sale:<br />\n214.00<br />\nUndergraduate Tickets<br />\n400.00<br />\nGraduate Tickets<br />\nGate Receipts:<br />\n294.00<br />\nJune Ball<br />\n117.00<br />\nLast Cotillion<br />\n104.00<br />\nAlumni Night<br />\n60.00<br />\nBoat Ride<br />\n$3384.00<br />\nTotal<br />\n3179.25<br />\nTotal Expenditures<br />\n<br />\nBand Goes To New York<br />\nFor Caine and Concert<br />\nIn order to play at the Columbia<br />\ngame the band will leave Baltimore<br />\nFriday afternoon for 'New York.<br />\nThis is the first time that the Hopkins band as such has ever made a<br />\ntrip. The Athletic Association-is<br />\nsending them with the team in order<br />\nto interest the New York alumni.<br />\nPlans have been made for the band<br />\nto play in the lobby of the Commodore Hotel, Friday night.<br />\nNOTICE<br />\nThere will he a meeting<br />\nof the entire Student Council in Room 20, Gilman<br />\nHall, at 1 o'clock today.<br />\nEvery member of the Council is asked to be present.<br />\n<br />\nA<br />\n<br />\n611HE 40111INIS HOPKINS<br />\nHEWS-LEGUME<br />\n<br />\nTHE READ-TAYLOR CO.<br />\nAdvertising<br />\n<br />\n-14111110<br />\n<br />\nclinifile-gashion.edOxfords<br />\n<br />\nDUTY<br />\n<br />\nProducers of - -<br />\n<br />\nBALTIMORE. MD.<br />\n<br />\nTheme of Publication Based on<br />\nLife of Lanier<br />\n<br />\nJ. Hamilton Allen, editor-in-chief<br />\nof the Hullabaloo, announced the<br />\norganization under which the work<br />\nof the year book will be carried forward.LThe plan was announced at a<br />\nmeeting of the editorial staff held on<br />\nFriday, November 2. . Under this<br />\narrangement, Philip Ness will-have<br />\ncharge of society which includes ac\"Sky high\" in style and comcounts of fraternities and other.<br />\nfort. And ankle-fashioned.<br />\nHopkins 'organizations. Deely Nice<br />\nNunn-Bush Oxfords hug the<br />\nankle-no unsightly gapping nor<br />\nand Cordish have charge of music<br />\nat the b.eeL<br />\nslipping<br />\n1543<br />\nand dramatics. Hershey and Schierlut SePutim<br />\nBlock<br />\nhel will take care of all University<br />\nGlaubore4.04<br />\nr<br />\nTHE<br />\nalso<br />\nJune Week Report Shows athletics. The Senior Section will<br />\nSHOP<br />\n.e'<br />\nFavorable Balance be carried on by Dick Wood. Bill<br />\netah•<br />\nbeH5r<br />\ntir<br />\nCo<br />\nsalla<br />\nUgsve<br />\nao<br />\nBatt/mom C<br />\nBanks will manage the Art section.<br />\nFigures on last year's June Week<br />\nThis year's Hullabaloo will be<br />\nhave been compiled and show that -dedicated to the mothers of the<br />\nthe committee cleared $204.75.<br />\nseniors, and the theme of the book<br />\nExpenditures<br />\nis to be based on the life of Sidney<br />\n$27.00 Lanier.<br />\nHullabaloo<br />\n10.00<br />\nTags<br />\nSeveral new arrangements are to<br />\n300.00<br />\nFavors<br />\nbe put into this edition of tlie annual<br />\n75.00<br />\nConcert (J. H<br />\nclass book. Class rolls, discontinued<br />\n12.50<br />\nClass Banner<br />\nlast year, will make their appear28.00<br />\n,<br />\nDecorations<br />\nance again this year. The fraternity<br />\n2.00<br />\nClass Day Souvenirs<br />\nwill be arranged in a totally<br />\n339.00 section<br />\nAlcazar<br />\ndifferent manner. Tentatively, each<br />\n79.00<br />\nGate Service<br />\nfraternity will have two pages. One<br />\n573.00<br />\nMusic (Earl Simpson)<br />\npage will contain the,picture and roll<br />\n150.00<br />\nPrinting<br />\nof the active chaper. The other page<br />\nNo Deposit Required<br />\n200.00<br />\nBoat<br />\nwill contain a picture of the f rater125.00<br />\nHopkins University Students<br />\nJohns<br />\nof<br />\nMaryland Casualty<br />\nseal,<br />\nthe<br />\nfraternity<br />\nof<br />\none<br />\npin,<br />\n'nity<br />\n175.00<br />\nFood for Md. Casualty<br />\nrewho<br />\nalumni<br />\nLight and Lomand another of the<br />\n12.00<br />\nBuicks<br />\nPiano for C. E<br />\nbard Sts.<br />\nin the city.<br />\n12.00 side<br />\nLoss (Navy Dane)<br />\nPLaza 6000<br />\nChevrolets<br />\nwriteindividual<br />\nof<br />\nmatter<br />\nThe<br />\n100.00<br />\n1723-25 N.<br />\nFireworks<br />\nChryslers<br />\nCharles St.<br />\n100.00 ups received much discussion. In<br />\nChairs<br />\nmore<br />\nwrite-ups<br />\nthese<br />\nmake<br />\nto<br />\n4049<br />\nVErnon<br />\norder<br />\nPolice and Janitor Service 70.50<br />\nHupmobiles<br />\n2402 Pennsyl10.00 accurate and interesting, it is felt<br />\nStudent Council Fee<br />\nvania Ave.<br />\nWillys-Knights<br />\n2.50 that the information must come<br />\nReceipt Books<br />\nLAfayette 2000<br />\n550.00 from the individual Seniors.<br />\nFood (Alcazar)<br />\nBaltimore Concedes Milestone Supremacy<br />\nRefunds to Member's o<br />\n28.00<br />\n•<br />\nBlue Jay Program<br />\n95.75<br />\nCommittee<br />\nI•De<br />\n1'20.00<br />\nExpense, Senior Ball<br />\n•••••• mmmmmmmm ••1••••11111•MEMOIII•ENIIIIIIIMMUOMII••••••1•••••<br />\n.<br />\n$3384.00 •<br />\n\\S<br />\nTotal Receipts'<br />\n•<br />\nO•<br />\n$204.75<br />\nBalance<br />\n••<br />\n21.00 ••<br />\nCandy for Boat Ride<br />\nII<br />\n14.00<br />\nFlowers, Senior Ball<br />\n••<br />\n20.00 ••<br />\nRaffle Books<br />\n••<br />\nTwo additional' Hullabaloo<br />\n••<br />\n-•<br />\n28.00<br />\nFees<br />\nTotal<br />\n<br />\nASSOCIATION<br />\nATEMBERS FLO,RISTS TELEGRAPH DELIVERY<br />\n<br />\nTHE GIANT<br />\nPOWER FUEL<br />\n<br />\nHULLABALOO DETAILS<br />\nARE ANNOUNCED<br />\n<br />\nBMW..<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nRIFLE TEAM BEGINS<br />\nACTIVITY NEXT WEEK<br />\nHaving newly adjusted rifles<br />\nand a renovated rifle range,<br />\nthe Hopkins sharpihooters begin activities next week. The<br />\nRifle Club offers an opportunity to Hopkins men, especially members of the'R.-0. T, c.,<br />\nto-win-awards. _k--tninor\" is awarded members of the<br />\nteam. Candidates for the team<br />\nshould hand their names to the<br />\nR. 0. T. C. office or to Kadon,<br />\npresident of the club. Johnston, manager, will announce<br />\nthe schedule shortly.<br />\n<br />\nYELLOW<br />\n<br />\nI<br />\n••<br />\nla I.<br />\n••<br />\n•<br />\n<br />\n.•<br />\n<br />\nl•<br />\n••<br />\n•I<br />\n•<br />\n•<br />\nU.<br />\nII<br />\nIIII<br />\n<br />\nI.<br />\nUI<br />\n•<br />\n•<br />\n•<br />\n•<br />\nMO<br />\n••<br />\n••<br />\n••<br />\nIII<br />\n<br />\nn0<br />\nsr<br />\n<br />\n•<br />\n••<br />\n•I<br />\n•I<br />\n<br />\neONEfuel. •.•.<br />\n•<br />\n•I<br />\nI•<br />\n••<br />\n<br />\n••<br />\n<br />\nthat- ca. n keep •.<br />\nwith every,<br />\ncha<br />\nchangeinyourpla.nt ..••<br />\nI<br />\n<br />\na5<br />\n<br />\nr<br />\n<br />\nan:<br />\n<br />\nSteP<br />\n<br />\nII O<br />\nU.<br />\nII<br />\na o<br />\na•<br />\n<br />\nII •<br />\n•X<br />\n•<br />\n•<br />\nUp<br />\n.•<br />\n11<br />\nME,<br />\nme<br />\n•1111•11•••ThIll•M•IIM•01<br />\na w••1111•MEN11111•1111•••••1•11111•1111111•••11•11EN•s••••••••1111•11•11111•1•1111•11.<br />\n<br />\nNearly all plants, at times,<br />\nhave these conditions to<br />\nmeet:<br />\n• A •thange in production<br />\nmethods;the introduction of<br />\na new product; the need for<br />\ngreater production facilities.<br />\nNot only are these problems<br />\nmost easily met when the<br />\nfuel employed is gas, but,<br />\nwith gas, they can invariably be met in the way that<br />\ninsures utmost operating<br />\nefficiency.<br />\nRearranging or extending<br />\nheating facilities, when gas<br />\n<br />\nis employed, often involves<br />\nnothing more than the rearranging or extending of<br />\ngas piping.<br />\nGas service can be readily<br />\ntaken to parts of the plant<br />\nwhere it would be difficult,<br />\nif not impossible, to apply<br />\nother forms of heat.<br />\n<br />\nYou can do<br />\nit better<br />\nwith GAS<br />\n<br />\nThe availability of gas to all<br />\nparts of the plant is but one of<br />\nmany advantages inherent in<br />\nthis superior fuel. Your local gas<br />\ncompany will be glad to tell you<br />\nof all these advantages and what<br />\nthey will mean to your plant.<br />\nTelephone or write them today.<br />\n<br />\nFor free copy of book,\"Industrial cas Heat\",address<br />\n<br />\nCAB STAND<br />\nAT<br />\n<br />\nHOMEWOOD FIELD<br />\nNo Charge for Extra Passengers<br />\n<br />\nAmerican Gas Association<br />\n420 Lexington Avenue,New York City<br />\n<br />\n'PHONE<br />\n<br />\nVERNON 1 2 1 2<br />\nFOR A<br />\n<br />\nYELLOW<br />\n<br />\nCAB<br />\n<br />\nmom Nuaassimmuusw•ors•••tour...mar ma U<br />\n<br />\nMUSOMM1011101115111M.<br />\n<br />\n\fNOVEMBER 6, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br />\nCOMMUNITY INN<br />\n<br />\nPLANTATION<br />\n<br />\neMANNIE BERG<br />\n<br />\nHANDKVtCHIEFS<br />\n<br />\nLADIES' HOSE, UNDIES,<br />\nHANDKERJCEHLILEIER:<br />\nHOSE, TIES.<br />\n<br />\nMEN'S<br />\n<br />\n,<br />\nin e south:<br />\nlierbert Hoover will talay be closest vote was found<br />\nand West<br />\nelected president of the United 1 ern states of Kent y<br />\nwinning in each<br />\nStates, if the poll conducted:by, the Virginia, Ho°<br />\nDistinction<br />\nNEWS-LETTER in conjunction with case by o<br />\nthree votes. Smith had<br />\nCollege Humor means anything. Ii CO ortable majority in all of the<br />\n1944 EDMONDSON AVESIUE<br />\nThe vote on this campus was<br />\nthem n states that he carried<br />\nPhone Gilmor 6886<br />\nHoover -127.<br />\nTexas and ,<br />\nSmith-115.<br />\nby four to one. Smith • by seven<br />\nThomas-4<br />\nsouthern states.<br />\nPhone HOmewood 7908<br />\nto five in all sixt<br />\nWill Rogers-2.<br />\note was cast in VirThe heavie<br />\n<br />\nTra49• Ni.+rk<br />\n<br />\nWhen You Can Buy Here for Less<br />\nWhy Buy Elsewhere<br />\n<br />\nOrchestras of<br />\n<br />\nCollet,iate Furnishins<br />\nNORTH AVE. MARKET<br />\nfi lotficRvt.AND-<br />\n<br />\nAVE&<br />\n<br />\nBirely's 'Pharmacy4 •<br />\n<br />\nPhone CAlvert 5975<br />\n<br />\nTHE CHARLES E. MYERS CO.<br />\nIncorporated<br />\nManufacturer of<br />\n<br />\n'RUBBER STAMPS<br />\nThe Service Shop<br />\n319 W. Redwood St.<br />\n<br />\nST. PAUL at 33rd STREET<br />\n<br />\nYour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br />\n<br />\nCommer;ig<br />\nNewspapers<br />\nBooks<br />\nEstabl.hed 1880<br />\n<br />\n,Thomas & Evans<br />\nPrinting Company<br />\n1506-1508 Guilford Avenue<br />\nBaltimore, Md.<br />\nPhone VErnQn 5691<br />\n<br />\nit<br />\n<br />\n11111;t 1 1 1'11,1 1 1 1 1 1 !i i!1,1 1 1<br />\n<br />\nHit<br />\nSYSTEM<br />\n<br />\nof College ginia<br />\nthe lightest vote in ArThe national<br />\nHerbert Hoover ka as. Hoover carried every CenHumor shows t<br />\nis the more '.ular collegiate. can- ral state, and also every western<br />\ndidate by 2 • 1. This vote was t<br />\nwest he led three to<br />\nin state. In the<br />\nfirst of i kind ever 'carried<br />\nthe strongest for<br />\nwas<br />\nMontana<br />\none.<br />\nof<br />\nthis co tty and is consi0t4ed<br />\nimportance becatise of the the G. 0. P., while Virginia cast<br />\nprim<br />\nfa that the present-06 college stu- most votes for Smith.<br />\nts are the nucleus of the future<br />\nRogers Gets Vote<br />\nmerican political world. The maWill Rogers obtained one-half of<br />\njority of the voters, numbering in one per cent- of the total student<br />\nall 544,685, had never had any exvote. The following was received<br />\nperience at the polls. The distribuat<br />\ntion of ballots was carried on in a from. the St. John's Collegiate,<br />\nvery thorough and systematic man- Annapolis: \"Hoover 128, Smith<br />\nner, through the co-operation of the 120, Texas Guinan 2, students dry<br />\nseveral college newspapers, the ma- add faculty all wet.\"<br />\njority,of which ran ballots on their<br />\nBoth of the candidates made<br />\nfront pages. In many schools, parIn<br />\nticularly in the southern states, the\" statements to College Humor.<br />\nstudents carried on strenuous cam- the statement of the. Republican<br />\npaignings for their favorites.<br />\nCandidate, Hoover reviewed some of<br />\nhis early struggles at Leland StanHoover Gets Majority<br />\nExamination of results shw that ford University as a student and<br />\nHerbert Hoover obtained a major- went on to tell some of the humority of student votes in thirty-eight<br />\nous incidents that befell him as an<br />\nstates and the District of Columbia.<br />\nundergraduate and later on as an-inAlfred E. Smith carried the remainat this Californian institustructor<br />\nof<br />\nentirely<br />\nconsisting<br />\nstates<br />\ning ten<br />\nsouthern territories. They were: tion. Al Smith gave in his stateVirginia, , Maryland, North Caro- ment his views on humor and the<br />\nlina, South Carolina, Georgia,'Flor- probable effect it would have up<br />\nida, Alabama, Mississippi, Louisiana<br />\nthe political campaign.' He s • he<br />\nand Texas. Of all the northern<br />\nhupee<br />\nintended to make his s- —<br />\n.states that voted for Hoover the<br />\nlargest majority vote was .in Con- morous, above all things.<br />\n<br />\nBraehurn<br />\nUniversity<br />\n<br />\nMos<br />\n833 - S45<br />\n<br />\n$7.50 to $10<br />\n<br />\nExclusive<br />\n<br />\nClothiers and Haberdashers<br />\n<br />\n,11.11-1 NE U113U<br />\n.17 E. Baltimore St.<br />\n<br />\n.<br />\n<br />\nAnd So His Fac<br />\n<br />\nEl(<br />\n<br />\nis Near<br />\n<br />\nTHE COLLE ATE SHOP<br />\n<br />\nArmouncei its Ope ng on November 5th-'<br />\n2446 N.<br />\n<br />\nRLES ST.<br />\nHOmeWood 8589<br />\n<br />\n()lien Every Evening<br />\n<br />\nthe boys (Hopkins) to help themselves.<br />\nHelp the girls (Goueher) nd<br />\nhand-made novelties and home-made dainties<br />\nStop in to see their display<br />\n•<br />\n<br />\nRE IS THE PLAN<br />\nhere, why not make some extra pin money<br />\nChristmas is alm<br />\nbringing some homemade article to be sold<br />\nby<br />\n,<br />\net<br />\nhat,<br />\ncoat,<br />\nnew<br />\na<br />\nfor<br />\nat 10% commission. Probably your<br />\nExchange<br />\nHorik.<br />\nGoucher,<br />\nat the<br />\nr<br />\ntherefore, why<br />\n•<br />\nMothers and .Sisters re helping you through College,<br />\nanything.. All helps<br />\nnot have'them make me-candy, cakes, or, in fact,<br />\nHopkins students to<br />\n.and everybody wil be out to help Goucher and<br />\nring your articles now and remember the articles<br />\nhelp themsehjes.<br />\nthat are least ex nsive sell the best.<br />\n<br />\nat Tire<br />\nCall Barry<br />\nVernon 4181<br />\n<br />\nOOD TIRES •<br />\nWe Hurry\"<br />\n<br />\nPhone, CAI. 1380<br />\n<br />\nSuccessor to HARBAUGH ti BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nMaryland<br />\nBaltimore<br />\n<br />\n112 E. Baltimore Street<br />\n<br />\nAT'S<br />\n<br />\nable<br />\nkins<br />\nwill<br />\nApt<br />\n- Am'<br />\nin a<br />\nkins<br />\nHim<br />\nthe<br />\nL<br />\nAllpeg<br />\ndiso<br />\nstar<br />\nraw<br />\nline:<br />\n•F<br />\nAllsylv<br />\nand<br />\nWOO<br />\nlarg<br />\nRed<br />\nBut<br />\nback<br />\n<br />\n()<br />\nMelt<br />\nIISCSi<br />\n<br />\nFRANK'S<br />\n<br />\nbeat<br />\nMed<br />\nboW,<br />\n<br />\nLight Lunch<br />\n5 W. Twenty-first St.<br />\nOpen 9.30 A. M. to Midnight<br />\n<br />\nE. E. ADAMS<br />\n<br />\nBOO<br />\nBOUG , SOLD<br />\nand E HANGED<br />\ns Book Store<br />\nPip<br />\n605<br />\n<br />\nTUTORING<br />\nAlgebra—Geometry—Trigonometry<br />\n<br />\n. EUTAW ST.<br />\nAbove Franklin<br />\n<br />\nWILLIAM H. JOLLY<br />\n2706 Gwynn Oak Ave.<br />\nTel. Woodlawn 276-W.<br />\n<br />\nas Utterly Ruined<br />\n<br />\n:‘<br />\n<br />\nGIVE Him ANI OLD<br />\n<br />\nRIG-1T,<br />\n<br />\nGOLD TonlY, WHILE<br />\n<br />\nLLA...TAKE YouR<br />\n0-101 ce., ITS EITI-AER<br />\nOLD GOLDS FOR You<br />\n<br />\nHE STILL 1.4AS A,<br />\nFAC E: NOT A<br />\nCOUGH IN A C<br />\nLOAt<br />\n<br />\nFROM N10VJ OKI — —<br />\n<br />\nOR SuiCto<br />\n<br />\ntIle<br />\nrelat<br />\nloon<br />\nof ti<br />\n<br />\nR.<br />\npow,<br />\nwill<br />\non .<br />\nBy 3RIGGS<br />\n<br />\nin Baltimore<br />\n<br />\nBOSTO IAN<br />\nSHOE ST<br />\n<br />\nHome—HO-20951<br />\n<br />\nPRANCES T. BANNON<br />\n<br />\nBARN CAFETERIA<br />\n<br />\nCol ege Men!<br />\n<br />\nSIU1140.<br />\n<br />\nChrist<br />\n<br />\nVol<br />\n<br />\nfttitt<br />\n<br />\nnecticut, nine to one. Of the northern states, Smith made his best<br />\nshowing in New York, where the<br />\nIn styl and quality \"Bostonians\" vote was nine to five for Hoover.<br />\nequal the most expensive footwear<br />\nIn the eastern states Hoover reproduced day.<br />\nceived a three to one majority. The<br />\nAnd the saying is a big item.<br />\n<br />\nWhenever young men<br />\ncongregate and compare notes the conclusion is almost tht.<br />\n<br />\nCOOKIES<br />\n<br />\nCANDIES<br />\n<br />\nGWYNN LEASE<br />\n<br />\nThe Old Boy Himself\"<br />\n<br />\nNORTH<br />\n<br />\nNEWS-LETTER POLL SHOWS HOOVER<br />\nTO BE LIKELY WINNER TODi:a<br />\n<br />\nSEEX<br />\n<br />\nTIMES YOL/<br />\nCOUGH, SEEXA TIME<br />\nI CUT You FACE!!<br />\n<br />\n5HAvA<br />\nYou No MO''!<br />\n<br />\nPLEASE,<br />\n<br />\n•<br />\n<br />\nfirst<br />\nIll) t wel<br />\n<br />\nthre;<br />\n<br />\ngam,<br />\n<br />\nlargt<br />\n<br />\nof tl<br />\n<br />\nScht<br />\nstick<br />\nMay<br />\nStick<br />\nidly<br />\n<br />\nrupti<br />\nkccp<br />\n<br />\n(buil<br />\n<br />\nAvoid the<br />\n<br />\nthc<br />\n<br />\nDormitory Blues<br />\n<br />\nT<br />\n<br />\nHEY are easily contracted if you have to<br />\nspend most of your time<br />\nin your room grinding<br />\naway at long reports and<br />\ntheses.<br />\nSpeed things up! Get a<br />\nRemington Portable to do<br />\nyour writing. It will effect<br />\na remarkable saving of<br />\nwriting time—to say nothing of the greater neatness<br />\n<br />\n(0. a<br />\n<br />\nand legibility of typewritten matter. Chances<br />\nare, that means better<br />\nmarks, too.<br />\nRemington Portable is the<br />\nsmallest, lightest, most<br />\ncompact and most dependable standard keyboard<br />\nportable. Weighs only<br />\npounds, net; carrying case<br />\nonly 4 inches high.<br />\nMonthly payments, if desired.<br />\n<br />\nIkmington<br />\nPortable<br />\nREMINGTON RAND<br />\nBUSINESS SERVICE, INC.,<br />\nStreet<br />\nBALTIMOREVD,<br />\n<br />\n130 W. Payette<br />\n<br />\nD<br />\nOL<br />\nGOLD<br />\n'The Smoother and Better Cigarette<br />\nnot a cough in a carload<br />\n0 P. Lorillard Ca., Eat. 1780<br />\n<br />\nTI<br />\ned a<br />\nrang<br />\nIlyr(<br />\nems:<br />\nJay\"<br />\nthis<br />\nathle<br />\nkins<br />\nfinal<br />\nland<br />\nthe f<br />\ngive'<br />\nTI<br />\n1928<br />\nDate<br />\nApri<br />\nApri<br />\nApri<br />\nApri<br />\nMay<br />\nMay<br />\nMay<br />\nMay<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL XXXIII, No. 11<br /><br />\n$10,000 CAGE GOAL<br />\nBY FRIDAY NIGHT<br /><br />\nPRICE 5 CENTS<br /><br />\nHOMEWOOD, BALTIMORE, MD., NOVEMBER 6, 1928<br /><br />\nLOCKARD NAMES SOPH<br />\nSPORTS MA1VAGER<br /><br />\nPRESIDENTIAL CAMPAIGN CAUSES<br />\nCHANGES IN BULLETIN BOARD<br /><br />\nFIRST BLUE JAY TO<br />\nAPPEAR NOVEMBER 1st<br />\nWith the copy already in the<br />\nhands of the printer a new<br />\nBlack and Blue lary will make<br />\nits 1928-29 debut in a few<br />\nweeks, probably before the St.<br />\nJohn's game.<br />\nA fervid subscription campaign' conducted by Business<br />\nManager Wood has netted as<br />\ngood deal of success as has the<br />\nadvertising staff in its line.<br />\nForty to fifty pages approximates the size of the magazine. Several contributions of<br />\nthe faculty are included with<br />\narticles of a more serious nature than has been in past issues.<br />\nAnother innovation will be<br />\nthe cover concerning which it<br />\nis rumored a novel color effect<br />\nhas been secured.<br /><br />\nThat the influence of the presi- the bulletin case with a new mesdential campaign is •powerful can- sage. The result of their plotting<br />\nAll Students Asked to- Sign<br />\nnot be denied. It was noted several and philological efforts resulted in<br />\nPledges Before Find of Week<br />\nweeks ago how the spirit of the the following:<br />\nN. Y. ALUMNI TO MEET<br />\ncampaign had intruded the very ofaL sMITH<br />\nfices of the faculty members and<br />\nPresident<br />\nfor<br />\nAverage<br />\nIs<br />\nAmount<br />\n$30<br />\nPledged<br />\nthen a little later the innermost reby Two Hundred Students<br />\ncesses of Chemistry laboratory. Its The little letters beginning the<br />\nlatest move has caused the old glass- Democratic candidate's Christian<br />\nAll efforts of the Cage Comcovered bulletin board with movable and surname were not deliberately<br />\nmittee are being bent toward getletters to be brought into service. put there to create a psychological<br />\nting $10,000 pledged among the<br />\nThis bulletin board opposite the effect; but the mean fact that large<br />\n).s,tudents by the end of this week.<br />\nPat<br />\nOffic-e has, for the past several A's and S's were missing ,necessiWith this amount in hand the<br />\nannounced without change tated the appearance.<br />\nyears,<br />\ncommittee will be able to go beof •the Y. M. C. A. Realizing that Hoover supporters<br />\nmeeting<br />\na<br />\nfore the New York alumni and<br />\nand an organization meeting of might post allegiance for him, the<br />\ncollect pledges from them. Supfootball candidates. This week, Smithites removed all H's and v's.<br />\nport on the campus so far has<br />\nhowever, the announcement with- They were justified in that no Hoobeen very discouraging. Only<br />\nin the case took a more mod- ver message appeared but great was<br />\n$6,000 has been pledged. The avern and a decidedly political as- their consternation the next day to<br />\nerage pledge has been $30.00.<br />\npect. A pair of rabid \"Smithites,\" see the following message,:<br />\nThis. amount includes all that<br />\nwishing to make knoWn to all freaL sMITH<br />\nmoney 'pledged last year in the<br />\nquenters of the Post Office that their<br />\nspring drive.<br />\nfor Bartender<br />\nare decidedly<br />\nwas unfortunate that there High School Team Has Little political sympathies<br />\nIn such manner Is collegiate popro-Smith, and, also, that they are<br />\nDifficulty<br />\n-should have been. two separate<br />\nat least they hope so, that litical support and opposition exdrives conducted on the. campus The Freihman team was.defeated confident,<br />\nvictorious, furnish&amp; pressed.<br />\nicn the same year and at about the Friday by Forest Park High School, Al will emerge<br />\nSchiebel Captures First Place;<br />\nsame- time. Levering Hall and ,15 to 0. The Freshmen, still a green<br />\nRival Captain Second<br />\nLacrosse Practice<br />\nits campaign hung fire for many team, fought hard against this more Yearlings Prepare For<br />\nBlack and Blue harriers took five<br />\nPoorly Attended<br />\nmonths and it has only been with- seasoned onslaught. During the first<br />\nAnnual Soph Game<br />\nout of the first seven places, as<br />\nin the last few weeks that infor- half Forest Park had the ball nearly<br />\nWith a few upper classmen, Freshmen and Sophomores Are Hopkins' cross-country team defeatmation was obtained that ,this all the time. A series of end runs<br />\nOnly Ones to Appear<br />\ntheir fall laed Lehigh 20 to 35 at the home<br />\nnew building -would be erected. took the Forest Parkers to their frosh have started<br />\nanticipation of<br />\n• Fall lacrosse practice has suffered course Saturday. Schiebel finished<br />\nLast Friday's issue of the 'News- first touchdown. The try for after crosse practice in<br />\nwith the sopho- greatly this year so far from appar- first, making the run in 24 minutes<br />\nLETTER contained the announcement point failed. After holding Forest the coming game<br />\npractice began<br />\nent lack of interest. It would seem 25 1-5 seconds.<br />\nof the definite awarding of the Park for downs on our five iyard mores. Although<br />\nthe turnout is not that having won an Olympic berth<br />\nSames,, Lehigh captain, finished<br />\ncontract to builders and the line a bad pass from center *Oared some time ago<br />\nbeen expected, only would stimulate interest, especially second, and was followed by Onocampus became assured of anoth- a safety against Hopkins! Again _vvha(, has<br />\nup<br />\nshowing<br />\nmen<br />\ndozen<br />\nas almost all of the championship rato of Hopkins. Captain Bob<br />\ner building._ If it was essential Forest Park, through tackle and about a<br />\nA number of the stuteam has graduated. This is not the Kelley was fourth to get in, and<br />\nfor the entire campus that there center, rushed down the field for regularly.<br />\nare<br />\nwho can play lacrosse<br />\ncase, however, and so far only a few the others finished in the following<br />\nbe a building erected to take the 'several first downs and their second dents<br />\ncoming out because they are Freshmen and Sophomores have re- order: Emerson, J. H. U.; Lange,<br />\nplace Of--the--Barn, it is even more -touchdown. This time the after not<br />\nnot willing to spend the time or<br />\nLehigh; Waters, J. H. U.; Gadd,<br />\nso for the future of all activities point was scored by a afo—pkick. ported.<br />\nhave not heard that practice has<br />\nLehigh; Miller, J. H. U.; Loiseaux,<br />\nthat there be a new cage erected.<br />\nTuesday,<br />\nevery<br />\nheld<br />\nis<br />\nPractice<br />\n,<br />\nSecond Half<br />\nreally began. Those men are reJ. H. U.; McElroy, Lehigh; Rosser,<br />\nPractically An Activities Building<br />\nComing back after the half, the quested to appear so that they Wednesday, amil Friday at four<br />\nIn. many senses this new buildJ. H. U.; Proebsite, Letort, And<br />\nFreshmen outplayed the Parkers but will be in their best condition and o'clock. Kelso Morrill is doing most<br />\ning will be more of a student acNeuwirth, Lehigh; and Blanchard.<br />\ncould not break for a touchdown. the team will have had some time in of the Coaching, ably assisted by a<br />\ntivities 'building than the LeverComes Four and Half Mho<br />\nDan Miller received a bad kick on which to develop a fair amount of few of the Olympic team members.<br />\ning Hall. Room will be provided<br />\nFather Bill Schmeisser, the official, The course, which begins and<br />\nhis head and had to be taken out teamwork.<br />\nfor the Barnstormers to hold theit:<br />\nends at Homewood Field, describes<br />\nof the game. Several passes were<br />\nPractice ' days are Mondays, coach, manages to get out to practice<br />\nannual play, sufficient space to<br />\ncompleted frout Goldberg to Mill- Tuesdays, and Fridays from four about once a week but he gets a something approximating a circle<br />\naccommodate large crowds lithe<br />\nman. The backfield gained through until six. -Also Morrill, Ben good line on any likely material throughout the vicinity. It is about<br />\nbasketball games is incorporated<br />\nfour and a half miles long. The<br />\nthe line making many first downs in Eagan, and Purnell Hall, in ad- from Mr. Morrell.<br />\nindoor<br />\nfor<br />\nwhile<br />\nin the plans,<br />\nthe last quarter. Hudert and Gold- dition to a number of other old<br />\nCaptain \"Bill\" Kegan will proba- record for the course was made by<br />\npractices of the major sports<br />\nberg were largely responsible for varsity men are coaching the can- bly be the man around whom the Dick Gwinn, '27, in the Maryland<br />\nteams the new cage will be unsurthis taking full advantage of the didates. There has not as yet defense will be built this year. meet of that year. His time was<br />\npassed. June Week and its many<br />\nholes opened up for them. O'Con- been any intensive training, mere- Johnny Lang is left at center and 22 minutes and 59 seconds, bettering<br />\nactivities will center around this<br />\nnell at end played a fine defensive ly light practice for accurate and Egan is the only man back on the by 26 seconds his own record of 23<br />\nnew structure, and the Cotillon<br />\ngame, boxing in every play. The snappy stick work. The coaches attack. Only a few substitutes re- minutes and 25 seconds, established<br />\nClub will schedule many of its<br />\nkicking was done by Hudert and are not as yet in any position to main, among them Herpsberger, in 1926.<br />\nfunctions within its walls.<br />\nGoldberg.<br />\nsay anything definite as to the Caplan, Brownley, Hall, and Lyons The run on Saturday was the<br />\nUp to Students<br />\nSubstitutes<br />\nchances of the sophs and frosh. stand out as the -best prospects. first of the season for Hopkins. LeInterest in this project has been<br />\nMany of the substitutes had a<br />\nLitchfield and Levy have been There are, however, plenty of open high had previously beaten Dickonly lukewarm mainly because chance to prove themselves both in- appointed as managers of the la- berths but it is very important that inson and been,defeated by Columthe undergraduate has not been the backfield and on the ends. Her- crosse team. but due to football new men get this fall practice in bia University. The Black and Blue<br />\nsufficiently informed of the impor- shey was very much pleased by the practice have not been able to de- handling the stick and getting a fun- will go to •Schenectady next Saturtance of his support. • Frankly, showing which the team made vote much time to their office.<br />\ndamental ida of the Hopkins meth- day to oppose Union College's crossthe entire issue is up to him. against this more experienced- -orod of pldaying. Sticks are furnished country team.. The prospects are<br />\nWithout his support, the commit- ganization.<br />\nregarded as favorable to Hopkins,<br />\nto everyone who cares to try out.<br />\ntee cannot go before the alumni<br />\nDebating Council<br />\naccording to Captain Bob Kelley.<br />\nmarked imshowed<br />\nteam<br />\nThe<br />\ntheirs.<br />\nfor<br />\nand ask them<br />\nAttends Dinner<br />\nThe New York University recently<br />\nOn Friday night before the Co- provement both in offensive and dehanded the Union harriers their first<br />\nStudents and<br />\nGraduate<br />\npresident<br />\nGardiner,<br />\nB.<br />\nNorman<br />\nrapis<br />\nlumbia game there will be a fensive playing. As the team<br />\ndefeat out of 24 dual meets.<br />\nReception<br />\nHold<br />\nFaculty<br />\ncoundebating<br />\nyear's<br />\nmeeting of the alumni in New idly rounding into form there is lit- of the last<br />\nKelley Pleased<br />\nYork. The committee wants to tle doubt but that the sophomores cil, entertained the rfiembers of<br />\nOne hundred and fifty graduate<br />\nCaptain Kelley pronounced himthe council at a dinner, given last students and members of the faculty<br />\nbe able to show this gathering<br />\nself especially pleased that his men<br />\nwill be given a hard- game. The Thursday at his home in Ruxton.<br />\n.$10,000 in student pledges. The<br />\nstudent recep- finished in a bunch, and pointed out<br />\nis trying to arrange The affair was very well attend- attended the graduate<br />\nband of the university is being Freshman team<br />\ntion given in the C. E. hall last Fri- the importance of this in cross-couned, about eleven of the members<br />\ntaken -to the game with the idea a game for next Friday..<br />\nday night. The affair was spon- try running. The importance is due<br />\npresent.<br />\nbeing<br />\nof impressing Black and Blue<br />\nLine-up: •<br />\njointly by the faculty and to the method of scoring, the orthe<br />\nof<br />\nForest Park<br />\nalumni in the metropolis<br />\nHopkins<br />\nPlans were made for the pres- sored<br />\ngreat need for a cage. To facil- O'Connell<br />\nLegum ent year. Full fall, *inter, and Y. M. C. A. The committee in der in which the first five runners of<br />\nR.E<br />\nitate making pledges, \"Doc\" AdNichols spring programs have been ar- charge consisted of _Dr. Matthews, each team finish being totaled and<br />\nR.T<br />\nMiller<br />\nams is keeping a number of<br />\nWeir ranged. g*In addition to the an- Dr. French and Mr. Schaal. The the wi nner as in golf, being the one<br />\nR.0<br />\nSigler<br />\nblanks at his place and will give<br />\nnual De Tocqueville medal, and general committee represented all of with the lowest score; consequently,<br />\nMagazine<br />\nthem to anyone wishing to sign Doeller<br />\nAzzarello Adams medal, contests and the the graduate department's at Home- a group of men finishing together,<br />\nL.G<br />\nthem. Pledges are also being Levy<br />\nahead of their opponents, secures a<br />\nLivomley class debates an unusually large wood.<br />\nkept in the Treasurer's office. Small<br />\nL.T<br />\nmaximum number of low counts for<br />\nEngof<br />\nProfessor<br />\ncontests<br />\nintercollegiate<br />\nGreenlaw,<br />\nof<br />\nDr.<br />\nnumber<br />\nBrown<br />\nL.E<br />\nLitchfield<br />\nAll Asked to Sign<br />\nlish Literature, delivered an address their team. This sign of balance on<br />\nOne part of the signing of these Millman<br />\nBoyle and trips have been arranged.<br />\nL.H<br />\nthe Hopkins team was interpreted<br />\npledges that is not generally un- Harris<br />\nClabaugh<br />\nRH<br />\nThere will be a meeting of the on \"The Community of Learning.\"<br />\nderstood is that no pledge will<br />\nPreist council Friday at one P. M. in Dancing and cards featured the u- by Captain Kelley as an indication<br />\nQ.B<br />\nGoldberg<br />\nbe collected until the entire<br />\nLong Room 112, Gilman, for the mem- mainder of the evening's program. of i.00d prospects for the season.<br />\nF.B<br />\namount to build the cage has been Hudert<br />\nSchiebel, in spite of an injury to<br />\nfirst affair of its kind<br />\nsubscribed. Although the aver- Substitutions --- By Freshmen: bers. Those who wish to partici- This is the<br />\nage pledge has been $30.00, it is Wood for Doeller, Collier for pate in the activities of the coun- given at Homewood. Its purpose his ankle, is showing up well and<br />\nthe desire of the committee that Wood, Clark for Litchfield, Beck- cil or try out for the team will was to effect a closer fellowship be- gives promise of a stellar performeveryone make a pledge regardplan graduate stu- ance in the Middle States Intercolsinsky for Harris, Stange for Har- be given an opportunity to do so tween new<br />\nless of the amount that he is able<br />\ndents and members of the faculty. legiate championships.<br />\nat a later date.<br />\nris.<br />\nto give.<br />\nAt the Sophomore class<br />\nmeeting on Thursday of last<br />\nWeek, Pfesident Lockard of<br />\n'31 announced the appointment<br />\nof managers for the football<br />\nand lacrosse squads, which<br />\nwill meet the yearling class in<br />\nthe near future. Heinzerling<br />\nwas created manager of football, while Kyle was made<br />\nmanager of the sophomore<br />\nstick wielders. _The freshmen<br />\nhave been. practicing on both<br />\nof these sports -for the last<br />\nthree weeks,. while the Sophs<br />\nhave made little effort to throw<br />\naside their lethargy and defend their laurels.<br /><br />\nFRESHMEN ELEVEN<br />\nDEFEATED BY PARKERS<br /><br />\nCROSS-COUNTRY TEAM<br />\nBEATS LEHIGH, 20-35<br /><br />\na.<br /><br />\nBLUE JAYS DEFEAT<br />\nRANDOLPH-MACON<br />\n_<br />\nJays Score Easy Victory Over<br />\nWeak Virginians<br />\nCAPLAN AGAIN SHINES<br />\nMany Substitutions Made; Jays<br />\nRoll Up 34 Points<br />\nI'laying excellent football against<br />\nfar inferior opponents, the Johns<br />\nHopkins team defeated the Randolph-Macon eleven in a one-sided<br />\ncontest, by a score of 34-0. The<br />\nJay team showed glimpses of real<br />\npower and the Black and Blue rooters have reason to feel confident<br />\nthat the remaining three games will<br />\nbe played in a manner which will<br />\nbring credit to their Alma Mater.<br />\nFrom the very first kick-off it was<br />\napparent to the spectators that the<br />\nSoutherners were no match for their<br />\nopponents. After receiving the ball<br />\nJay team did not lose possession<br />\nof it until they had, by straight line<br />\nplunges, carried the ball over for<br />\nthe first score of the game. Howard Caplan added the extra point<br />\nwith his unerring toe. A few minutes later the Jay team scored the<br />\nsecond touchdown of the contest.<br />\nThis time it was Hu:nie Houston<br />\nwho traversed the last white marker<br />\nto add six more points to the Hopkins score. The try for point was<br />\nwide and the score was 13-0.<br />\nSoutherners' Defense Weak<br />\nRandolph-Macon was displaying<br />\na complete lack of defense against<br />\nthe Jay line plays and it was quite<br />\nevident the way the game would end.<br />\nEach exchange of punts was netting<br />\nthe Hopkins club anywhere from<br />\nten to thirty-five yards, and soon<br />\nCoach Van Orman began substituting so that at the end of the game<br />\nHoward Caplan was the only regular left in the line-up.<br />\nThe Blue Jay's third score came<br />\nfive minutes after the beginning of<br />\nthe second quarter. A well executed<br />\npass, once again from I,yons to<br />\nHouston, put the ball on RandolphMacon's 28-yard and Mills, Caplan,<br />\nand Besore took the ball over on<br />\nthree more plays. Caplan added the<br />\nextra point, making the score 20-0<br />\nin the Jay's favor.<br />\nCaplan Plays Entire Game<br />\nWith most of the starting team<br />\nhaving been withdrawn from the<br />\ngame Jay rooters expected to see<br />\nan immediate let-up in the power<br />\nbeing displayed but in this they were<br />\npleasurably surprised. Lyons was<br />\ntaken from the game and Ashton<br />\nDevereaux took up the job of quarter in a mighty creditable manner.<br />\nAfter an exchange of punts the ball<br />\nwent to the Jays on the Southerners' 43-yard line! From this point<br />\nit took the Hopkins team just five<br />\nplays to put the ball across. Once<br />\nagain Caplan's try for point was<br />\ngood and the half ended a moment<br />\nlater with the score 27-0.<br />\nThe final Hopkins score came in<br />\nthe middle of the third period on<br />\na pass from Devereaux to Bledsoe.<br />\nFrom this point on the game seesawed back and forth most of the<br />\nplay being in the Virginian's territory. On several occasions the Randolph-Macon team came very dose<br />\nto scoring by the overhead route,<br />\nbut each time their well-thrown<br />\npasses were grounded and they ended the cooptest without scoring.<br />\nLine-up:<br />\nHopkins<br />\nRandolph-Macon<br />\nL.E<br />\nHouston<br />\nSmith<br />\nJohnson<br />\nL.T<br />\nL.G<br />\nTobvien<br />\nL<br />\nCompton<br />\nTrader<br />\nC<br />\nPowell<br />\nBrown<br />\nKeganR.G<br />\nBialoskorsky .R.T<br />\nWithrow<br />\nZimmerman .R.E<br />\nDouthat<br />\nQ.B<br />\nBurger<br />\nF.B<br />\nWoodson<br />\nLaypolnasn<br />\nC<br />\nH.B<br />\nJ:rya t<br />\nMills<br />\nH.B<br />\nCockrell<br />\nBesore<br /><br />\nthr<br /><br />\n1928<br />\n-LETTER, NOVEMBER 6,<br />\nTHE JOHNS HOPKINS NEWS<br />\n2<br /><br />\nME:LETTER POLITICALATDEBATE<br />\nASSEMBLY<br /><br />\nTHEME<br /><br />\nFOUNDED 1897<br />\nSubscription<br /><br />\n•<br /><br />\n$2.00<br /><br />\nPostofflce in<br />\nEntered as second-class matter December 3, 1909, at the<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from—OCtOber to June by the—students<br />\nHopkins University.<br /><br />\nCongressman Frear and \"-. Moylan Are Speakers<br /><br />\nT<br /><br />\nTopcoats • • •<br /><br />\nstyle;<br />\nWith a carefree, nonchalant<br />\nwell tailored of fine Scotch and<br />\nAmerican fabrics; maximum<br />\nwarmth; minimum weight, and'<br />\nlight on the college budget.<br />\nReady,to-Wear<br /><br />\nBaltimore's Newest<br />\n:•: and Finest :•:<br />\n-A Hotel of Atmosphere<br />\nand Environment.'<br /><br />\nSTOCK ARGUMENTS USED<br />\nEach Speaker Upheld by His<br />\n-Respective Admirers<br /><br />\nCongressman Frear, a Republican<br />\nBUSINESS MANAGER, from ‘Visconsin, and Mr. Moylan,<br />\nBusiness communications should be addressed to the<br />\nto the MANAGING<br />\nJohns Hopkins University. All articles should be sent<br />\na Democratic Baltimore lawyer,<br />\nZOITOR; other communications to the Eorroa-IN-CHIEF.<br />\nwere the speakers at last week's.<br />\nUniversity 0100 political assembly. Each upheld his<br />\nTelephone<br />\nrespective party in a twenty-minute<br />\ndiscussion followed by a: five-minute<br />\nEDITORIAL DEPARTMENT<br />\nrebuttal.<br />\nEditcsr.isIChaef<br />\nThe second speaker, Congressman<br />\nGEORGE E. BANKS, JR., '29<br />\nFrear, displayed by far the more<br />\nEditor<br />\nManaging<br />\nAssistant<br />\nor<br />\nEdit<br />\nManaging<br />\nexcitable nature-of the two and due<br />\nGROsai GUMP,'30<br />\nPHILIP W. NESS, '29<br />\nea. to this fact he lost much of the<br />\nAssociate Editors<br />\nstrength of his argument.<br />\nRICHARD H. WOOD,'29<br />\nWiLmest H. DRIVER, '29<br />\nMr. Moylan Begins<br />\nROBERT S. BAIRD, '30<br />\nMr. Moylan began the diseussion.<br />\nJunior Editors<br />\nIn the course of his presentation he<br />\nW. Purnell Hall, Jr., '30<br />\nStewart L. Smith, '30<br />\nsaki that everyone is claiming that<br />\nE. Foster Dowell, '29<br />\nLeonard B. Motley. '29<br />\nG. Hunt. '31<br />\nRichard<br />\na Republican President muSt be<br />\nH. Garland Hershey, '29<br />\nHarwood F. Mullikin, Jr., '31<br />\nPaul W. Spear, '30<br />\nelected if prosperity is to continue.<br />\nIrving K. Gordon, '29<br />\nGeorge H. Dowell. '31<br />\nHe then added that some four milCharles Harry, '31<br />\nlion persons unemployed are assurBUSINESS DEPARTMENT<br />\nedly no signs of either former or<br />\nBusiness Manager<br />\npresent prosperity. Mr. Hoover, the<br />\nHARRY 0. scimoss,. JR., '29<br />\n.AteevviempallIIIII1111111111111111<br />\n1111111111F—\"*-Republican candidate for President,<br />\nCircidation Manager<br />\nAdvertising Manager<br />\nJ. ROBERT MYERS, '29<br />\nhad charge of agriculture in this<br />\nGEORGE M. GLAZIER, '29<br />\ncountry, and facts show that 1,000,Advertising Staff<br />\nOffice Staff<br />\nAlvin H. Blum, '30<br />\n000 farms have been abandoned for<br />\nTheodore A. Fleishman. '31<br />\nGus Burke. '31<br />\nRandolph Rothchild, '31<br />\nvarious reasons. In the course of<br />\nJohn Lots, '30<br />\nLeroy Shugar, '31<br />\nGeorge S. Robertson, '31<br />\nlast year, alone, Moylan said, there<br />\nJohn A. Jamieson. '30<br />\nSidney Rattel, '91<br />\nwere 37,000 business failures in -the<br />\nStaff Photographer<br />\nUnited States.<br />\nWALTER D. SCHEIDT. '30<br />\nAn even, more serious thing could<br />\nbe looked back -upon in the form of<br />\nStreets,<br />\nSouth<br />\nand<br />\nLombard<br />\nCompany,<br />\nRead-Taylor<br />\nThe<br />\nby<br />\nPrinted<br />\nthe temporary collapse of the FedBaltimore, Md.<br />\neral Reserve System. Since that<br />\nmemorable panic this System has<br />\nrisen to the greatest heights of any<br />\n.tem, the<br />\nsystem known. • This sys<br />\nlawyer claimed, Was due entirely to<br />\nWoodrow Alison's 'administration,<br />\nand credit for its perf_ection can be<br />\nBROWSE<br />\nTO<br />\nRIGHT<br />\nTHE<br />\nclaimed by no one else. Facts show<br />\nHE UNIVERSITY LIBRARY stacks have, since time immemorial,<br />\nthat only six Republicans .voted for<br />\nbeen maintained as a sort of sanctuary for the intellectual delecthis system when it was brought, behallowed<br />\ntation of a small body of graduate students. From this<br />\nfore the legislators at Washington.<br />\nground, the undergraduates are barred by the watchful eyes of the<br />\n.Hoover a Hero '<br />\nbibliophilistic custodians.<br />\nMoylan, after mentioning several<br />\nNow it so happens that, at frequent intervals during the colof the Republican adinconsistencies<br />\nlegiate year, undergraduate students are assigned the task of writing<br />\nministrators, conceded the fact that<br />\npapers on some particular subject in such studies- as English LitHoover had emerged from the war<br />\nerature, Political Economy and Political Science. In the preparation<br />\nof these theses, it is necessary for the author to constantly refer to a<br />\nas a great civilian hero. He was<br />\nlong list of sources for his material. He must investigate the works<br />\nalso an outstanding business success.<br />\nof numerous authorities in order to obtain the proper details and<br />\nBut, the Democratic speaker said,<br />\nopinions which will assist him in his task.<br />\nSmith's achievements outnumber<br />\nUnder the present system employed by the University. Library,<br />\nthose of the Republican candidate.<br />\nthe undergraduate must first thumb through countless red and white'<br />\nIn only three occasions in many<br />\nedged cards in the index files, fill out other cards, hand them to the<br />\na<br />\nexperience<br />\nthen<br />\nand<br />\nlibrarian, wait for the delivery of the books<br />\nyears of office did Smith dismiss Revolthe<br />\nof<br />\nnone<br />\nthat<br />\ndiscovering<br />\nupon<br />\nsensation<br />\nrather disheartening<br />\npublican appointments. In seven and<br />\numes contains the information for which he is seeking.<br />\none-half years the Republican State<br />\naverThe<br />\ninadequate.<br />\nare<br />\nshelves<br />\nreserve<br />\nso-called<br />\nthe<br />\nof<br />\nMost<br />\nLegislature has not vetoed a single<br />\nage selection of reserve books contains only works ofa very general<br />\nlaw suggested by Smith..<br />\ncharacter, which deal with the subject in broad terms.<br />\n\"Awful Republican\"<br />\nThis,state of affairs seems to us to be a rather intolerable one.<br />\nCongressman Frear introduced<br />\nThe retention of books behind closed doors simply stifles a certain<br />\nhimself as one of those \"awful Reinstinct for research which every true college student possesses. Call<br />\npublicans,\" and mentioned that he<br />\nit \"Intellectual Curiosity,\" if you like. Nevertheless a truly educated<br />\nman receives an immense amount of satisfaction from the searching<br />\nwas well aware of the fact that he<br />\nout of facts. He enjoys browsing about book shelves, thumbing<br />\nwas speaking to. an, Al Smith audi,<br />\nto<br />\n_worlds<br />\nintellectual<br />\nnew<br />\nthrough' attractive volumes, discovering<br />\nence. He brought out that his opconquer.<br />\nponent was worthy. etc., but that<br />\nPerhaps the Hopkins Library fears that free access to its colleclust as the candidate whom his option will afford an opportunity for stealing. Such an argument apthe<br />\nat<br />\nemployed<br />\nponent represented, \"he' doesn't<br />\npears quite ridiculous when one considers the system<br />\nEnoch Pratt Free Library's main'building and branches. Here is an<br />\nknow what he is talking about.\"<br />\ninstitution which'is patronized by all sorts and classes of people, white<br />\nThen followed a series of sentences<br />\nand black; rich and poor. Yet, though the Pratt Library maintains<br />\ndealing with war expenditures of<br />\nan open shelf system, very few volumes are stolen, according to .the<br />\nwhich the Republicans spent $1,testimony of Mr. Wheeler.<br />\n000,000,000. Frear admitted conIf the Pratt Library can successfully operate such a plan why is<br />\nIt that the Library of the Johns Hopkins University, serving a body<br />\nsumption of airplane expenditures<br />\nof college students sworn to honesty through the honor system, canand mentioned that he was out west<br />\nnot adopt the same practice?<br />\nto investigate the spruce situation in<br />\nfrom<br />\nundergraduates<br />\nbarring<br />\nof<br />\npractice<br />\npresent<br />\nthe<br />\nthat<br />\nfeel<br />\nWe<br />\nconnection with material used for<br />\nthe library stacks is an unfair discrimination. Perhaps there is some<br />\nairplane construction. On his trip,<br />\nadequate and plausible reason for the stand of the librarian—as yet,<br />\nrein<br />\npolicy\"<br />\ndoor<br />\n\"open<br />\nAn<br />\nhe brought out, he discovered even<br />\nwe have betn unable to ascertain -it.<br />\nall,<br />\nafter<br />\nBooks,<br />\nadvocate.<br />\nwe<br />\nissue<br />\nthe<br />\nis<br />\nstacks<br />\nlibrary<br />\ngard to the<br />\nworse corruption on the railroads,<br />\nare written to be read.<br />\nthe controlling element of which<br />\nwere Democrats. •<br />\nThe rebuttals consisted of the repA TRADITION TO REVERE<br />\netition of a few \"stock\" arguments<br />\nEVERAL days ago, we were considerably shocked to view the specby each speaker. In these rebuttals<br />\ntacle of a precocious freshman nonchalantly strolling through<br />\neach speaker objected to the lack of<br />\nthe Gilman Memorial Room. There was no doubt regarding the<br />\ntime within which to produce sufquestion of his University status. Around his neck was a tie of<br />\nverdant hue, in his lapel was a button embossed with the sixth letter<br />\nficient proofs.<br />\nof the alphabet, and on his,face was the wideeyed, innocent look,<br />\nso characteristic of new born infants and college freshmen.<br />\nNOTICE<br />\nPerhaps this particular student was trespassing in the Memorial<br />\nRoom in order to ascertain just what would happen if he were deSophomore<br />\nlacrosse canditected. Perhaps his presence was due to ignorance of Hopkins tradates are to report for pracdition. We are inclined to accept the latter theory in view of the<br />\ntice<br />\nand to<br />\nimmediately,<br />\ngeneral lack of knowledge of University customs which seem to prebring their own equipment or<br />\nvail among the members of the present freshman class.<br />\nold clothes, if possible.<br />\nThe Gilman Memorial Room is reserved solely for the use of<br />\nAny sophomores who<br />\nthe seniors. This is one of the most sacred of all Hopkins traditions<br />\nhave not paid their dues are<br />\nand one which should be implicitly obeyed not only by the freshmen,<br />\nrequested to do so at the<br />\nbut by all underclassmen. To them, we appeal for the observance<br />\nPostoffice.<br />\nand perpetuation of this noble and sacred tradition, in memory of our<br />\nUniversity's first president.<br /><br />\nEDITORIAL COMMENT<br /><br />\nTHE SOUTHERN<br />\nHOTEL<br /><br />\n.,&amp;,131DDI<br />\nLEY.RAM_KS<br /><br />\nor more<br />\nEstablished 1832<br />\nPHILADELPHIA<br /><br />\n3ro5.ciii05 8c ibon<br /><br />\nSCHOOL RINGS, EMBLEMS,<br />\nCHARMS AND TROPHIES<br />\nOf the Better Kind<br /><br />\nFive East Lexington Street<br /><br />\nTHE GIFT SUGGESTION BOOK<br />\nMailed upon request—illustrates<br />\nand prices<br /><br />\neArt Invitation<br /><br />\nJewels, Watches, Clocks, Silver,<br />\nChina, Glass, Leather and Novelties<br />\nfrom which may be selected<br />\ndistinctive Wedding, Birthday,<br />\nGraduation and other gilts<br /><br />\nifthe Johns Hopkins students.we extend a cordial. invitation to come in and see our beautiful,<br />\nhand-wrought Jewelry, our importations of ancient<br />\nand modern gifts. Prices very moderate.<br /><br />\nCARL SCHON, INC.<br />\nNEW<br /><br />\n109 W. SARATOGA ST.<br />\nOXFORD GRAYS<br /><br />\nSuits Topcoats Overcoats<br />\n$28.75<br /><br />\nFIDELITY AND DEPOSIT CO.<br />\nof Maryland<br /><br />\n38.75<br /><br />\n,<br /><br />\nWe just received a 'new<br />\nassortment of Oxford Grays<br />\nin shadow striped, slightly<br />\nvisible overplaids<br /><br />\nBALTIMORE BRANCH OFFICE<br /><br />\nand<br /><br />\nherringbone effects.<br /><br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br /><br />\nD. C.<br /><br />\nHANDY,<br /><br />\nGROUND FLOOR, FIDELITY BLDG,<br />\n— Phone PLaza 0800<br /><br />\nManager<br /><br />\nDo not fail to see them<br />\nCaution Money vouchers accepted<br /><br />\nWILLARD<br />\nTAILORING CORP.<br />\n- FAYETTE ST. AT HANOVER.<br />\nFIRST 'FLOOR<br /><br />\nTreat yourself to<br />\na flight “as the<br />\ncrow flies -with<br /><br />\nCigarettes.<br />\nClub Lounge<br />\nFree Phone<br /><br />\nThe<br />\nCHESAPEAKE<br />\nAIRCRAFT CO.<br />\nLOG,N FIELD<br /><br />\n0<br /><br />\n1<br />\n¢rdtiit<br />\nIESTABiatital E114GLI-SaNIVIERSITY<br />\nSTYLES,IFAIliORS6-4)ViiiilbUTHFUL<br />\nCHARTS SoCELY FOR DISTiiiGUISHEO<br />\nTlik,s1.011144) STATES.<br />\nSERVICE I<br /><br />\nReporter<br />\nconverts News<br />\ndor to this<br />\nPipe Tobacco<br /><br />\nhA4e1onsei<br />\nSuitt<br /><br />\nLondon, England.<br />\nFeb<br />\n'7, 1928<br /><br />\nLarus &amp; Bro. Co.<br />\nRichmond, Va.<br />\nDear Sirs:<br />\nAbout two years ago I bought a tin<br />\nof Edgeworth tobacco. I was so<br />\npleased with its slow-smoking qualities<br />\nand wonderful aroma that I became<br />\nan Edgeworth enthusiast and have<br />\nsmoked no other tobacco since, althouth up to that time I think I can<br />\ntruthfully say I had tried every wellknown British mixture and flake.<br />\nMoreover, I introduced one of the<br />\nother reporters to it. He in turn introduced another and he another until<br />\nfinally it reached the News Editor.<br />\nThere are now five of us all smoking<br />\nEdgeworth and enjoying it so much<br />\nthat I thought you might like to have<br />\nthis little appreciation of what, to<br />\nBritishers, is a comparatively unknown tobacco. I wish you every<br />\nsuccess.<br />\nYours faithfully,<br />\n(signed) David Moore<br /><br />\nEdgeworth<br />\nExtra High Grade<br /><br />\n*45;----40 Overcoats<br />\n==<br /><br />\nF.- BY SPECIAL APPOINTMENT<br /><br />\n3<br /><br />\n01111 STORE IS THE<br /><br />\nartrUr1 ouzel<br />\nOF BALTIMORE<br />\nMe<br /><br />\nThe character of the suite and<br />\novercoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\nPine<br /><br />\nHub<br /><br />\n•<br /><br />\nMO.<br />\nOMMI<br />\nMMIM<br /><br />\nBaltimore. Charles and Fayette<br /><br />\nOM<br /><br />\nSmpking Tobacco<br /><br />\nMfimm<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 6, 1928<br /><br />\neA. H. FETTING<br />\ne3vIANUFACTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek LetterFraternity Jewelry<br />\n3.11:_NORTIICHARLES STREET<br /><br />\nINTERIOR WOOD WORK<br /><br />\nDECORATIONS<br /><br />\n•<br /><br />\nJOHN C. KNIPP 6? SO2NIS<br />\nFURNITURE<br />\nBALTIMORE, MD<br /><br />\nHENNEGEN-BATES COMPANY<br />\nJewelers and Silversmiths since 1857<br />\n.DRESS SETS<br />\nfor evening wear.<br />\n7 and 9 East Baltimore Street<br /><br />\nAli<br /><br />\nwhiting-<br /><br />\ntielkihift Iii.<br /><br />\nAre the New Fall Books!<br />\nYou'll find rows and rows of them-brand-new books in bright<br />\nof printer's ink and crisp paper-fiction,<br />\npungently<br />\n-smelling<br />\ncovers<br />\npoetry, biography, science-awaiting your choice at our two stores<br /><br />\nTHE NORMAN,REMINGTON CO.<br />\nDown.TOwn: •<br />\nCharles St. at Mulberry<br /><br />\nUp•Town:<br />\n1118 North Charles St.<br /><br />\n,<br /><br />\nStep Out From The Crowd!<br />\nBe an exception-Be a Successful Somebody<br />\nWith a Savings Account you are on the highroad<br />\nto success-Orportunity waits beyond.<br /><br />\nPARK BANK<br />\nLexington Street at ,Liberty •<br />\nNorth Avenue at Charles<br />\n4819 Belair Road at Southern<br /><br />\ns<br /><br />\nJ. A. RITTER Es? SON<br />\nFlorists and Decorators<br />\n1918 N. CHARLES ST., Near 20TH.<br /><br />\nBALTIMORE, MD.<br /><br />\nPhone. N'Ernon 0573<br /><br />\nFORDYCE E. C. CAMPBELL<br />\nHOPKINS ALUMNUS<br /><br />\nAll Lines of Insurance<br />\nPhone, Plaza 1062<br /><br />\nESSO<br /><br />\nNEW LIFE<br />\nFOR MOTORS<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\nSTANDARD OIL COMPANY OF N.<br /><br />\n\"Friend of the Hopkins Man\"<br /><br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br /><br />\n$3179.25<br /><br />\nReceipts<br />\nTag Week, Raffle and Co$224.00<br />\ntillion Club<br />\n1971.00<br />\nClass Assessment<br />\nJune Week Ticket Sale:<br />\n214.00<br />\nUndergraduate Tickets<br />\n400.00<br />\nGraduate Tickets<br />\nGate Receipts:<br />\n294.00<br />\nJune Ball<br />\n117.00<br />\nLast Cotillion<br />\n104.00<br />\nAlumni Night<br />\n60.00<br />\nBoat Ride<br />\n$3384.00<br />\nTotal<br />\n3179.25<br />\nTotal Expenditures<br /><br />\nBand Goes To New York<br />\nFor Caine and Concert<br />\nIn order to play at the Columbia<br />\ngame the band will leave Baltimore<br />\nFriday afternoon for 'New York.<br />\nThis is the first time that the Hopkins band as such has ever made a<br />\ntrip. The Athletic Association-is<br />\nsending them with the team in order<br />\nto interest the New York alumni.<br />\nPlans have been made for the band<br />\nto play in the lobby of the Commodore Hotel, Friday night.<br />\nNOTICE<br />\nThere will he a meeting<br />\nof the entire Student Council in Room 20, Gilman<br />\nHall, at 1 o'clock today.<br />\nEvery member of the Council is asked to be present.<br /><br />\nA<br /><br />\n611HE 40111INIS HOPKINS<br />\nHEWS-LEGUME<br /><br />\nTHE READ-TAYLOR CO.<br />\nAdvertising<br /><br />\n-14111110<br /><br />\nclinifile-gashion.edOxfords<br /><br />\nDUTY<br /><br />\nProducers of - -<br /><br />\nBALTIMORE. MD.<br /><br />\nTheme of Publication Based on<br />\nLife of Lanier<br /><br />\nJ. Hamilton Allen, editor-in-chief<br />\nof the Hullabaloo, announced the<br />\norganization under which the work<br />\nof the year book will be carried forward.LThe plan was announced at a<br />\nmeeting of the editorial staff held on<br />\nFriday, November 2. . Under this<br />\narrangement, Philip Ness will-have<br />\ncharge of society which includes ac\"Sky high\" in style and comcounts of fraternities and other.<br />\nfort. And ankle-fashioned.<br />\nHopkins 'organizations. Deely Nice<br />\nNunn-Bush Oxfords hug the<br />\nankle-no unsightly gapping nor<br />\nand Cordish have charge of music<br />\nat the b.eeL<br />\nslipping<br />\n1543<br />\nand dramatics. Hershey and Schierlut SePutim<br />\nBlock<br />\nhel will take care of all University<br />\nGlaubore4.04<br />\nr<br />\nTHE<br />\nalso<br />\nJune Week Report Shows athletics. The Senior Section will<br />\nSHOP<br />\n.e'<br />\nFavorable Balance be carried on by Dick Wood. Bill<br />\netah•<br />\nbeH5r<br />\ntir<br />\nCo<br />\nsalla<br />\nUgsve<br />\nao<br />\nBatt/mom C<br />\nBanks will manage the Art section.<br />\nFigures on last year's June Week<br />\nThis year's Hullabaloo will be<br />\nhave been compiled and show that -dedicated to the mothers of the<br />\nthe committee cleared $204.75.<br />\nseniors, and the theme of the book<br />\nExpenditures<br />\nis to be based on the life of Sidney<br />\n$27.00 Lanier.<br />\nHullabaloo<br />\n10.00<br />\nTags<br />\nSeveral new arrangements are to<br />\n300.00<br />\nFavors<br />\nbe put into this edition of tlie annual<br />\n75.00<br />\nConcert (J. H<br />\nclass book. Class rolls, discontinued<br />\n12.50<br />\nClass Banner<br />\nlast year, will make their appear28.00<br />\n,<br />\nDecorations<br />\nance again this year. The fraternity<br />\n2.00<br />\nClass Day Souvenirs<br />\nwill be arranged in a totally<br />\n339.00 section<br />\nAlcazar<br />\ndifferent manner. Tentatively, each<br />\n79.00<br />\nGate Service<br />\nfraternity will have two pages. One<br />\n573.00<br />\nMusic (Earl Simpson)<br />\npage will contain the,picture and roll<br />\n150.00<br />\nPrinting<br />\nof the active chaper. The other page<br />\nNo Deposit Required<br />\n200.00<br />\nBoat<br />\nwill contain a picture of the f rater125.00<br />\nHopkins University Students<br />\nJohns<br />\nof<br />\nMaryland Casualty<br />\nseal,<br />\nthe<br />\nfraternity<br />\nof<br />\none<br />\npin,<br />\n'nity<br />\n175.00<br />\nFood for Md. Casualty<br />\nrewho<br />\nalumni<br />\nLight and Lomand another of the<br />\n12.00<br />\nBuicks<br />\nPiano for C. E<br />\nbard Sts.<br />\nin the city.<br />\n12.00 side<br />\nLoss (Navy Dane)<br />\nPLaza 6000<br />\nChevrolets<br />\nwriteindividual<br />\nof<br />\nmatter<br />\nThe<br />\n100.00<br />\n1723-25 N.<br />\nFireworks<br />\nChryslers<br />\nCharles St.<br />\n100.00 ups received much discussion. In<br />\nChairs<br />\nmore<br />\nwrite-ups<br />\nthese<br />\nmake<br />\nto<br />\n4049<br />\nVErnon<br />\norder<br />\nPolice and Janitor Service 70.50<br />\nHupmobiles<br />\n2402 Pennsyl10.00 accurate and interesting, it is felt<br />\nStudent Council Fee<br />\nvania Ave.<br />\nWillys-Knights<br />\n2.50 that the information must come<br />\nReceipt Books<br />\nLAfayette 2000<br />\n550.00 from the individual Seniors.<br />\nFood (Alcazar)<br />\nBaltimore Concedes Milestone Supremacy<br />\nRefunds to Member's o<br />\n28.00<br />\n•<br />\nBlue Jay Program<br />\n95.75<br />\nCommittee<br />\nI•De<br />\n1'20.00<br />\nExpense, Senior Ball<br />\n•••••• mmmmmmmm ••1••••11111•MEMOIII•ENIIIIIIIMMUOMII••••••1•••••<br />\n.<br />\n$3384.00 •<br />\n\\S<br />\nTotal Receipts'<br />\n•<br />\nO•<br />\n$204.75<br />\nBalance<br />\n••<br />\n21.00 ••<br />\nCandy for Boat Ride<br />\nII<br />\n14.00<br />\nFlowers, Senior Ball<br />\n••<br />\n20.00 ••<br />\nRaffle Books<br />\n••<br />\nTwo additional' Hullabaloo<br />\n••<br />\n-•<br />\n28.00<br />\nFees<br />\nTotal<br /><br />\nASSOCIATION<br />\nATEMBERS FLO,RISTS TELEGRAPH DELIVERY<br /><br />\nTHE GIANT<br />\nPOWER FUEL<br /><br />\nHULLABALOO DETAILS<br />\nARE ANNOUNCED<br /><br />\nBMW..<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nRIFLE TEAM BEGINS<br />\nACTIVITY NEXT WEEK<br />\nHaving newly adjusted rifles<br />\nand a renovated rifle range,<br />\nthe Hopkins sharpihooters begin activities next week. The<br />\nRifle Club offers an opportunity to Hopkins men, especially members of the'R.-0. T, c.,<br />\nto-win-awards. _k--tninor\" is awarded members of the<br />\nteam. Candidates for the team<br />\nshould hand their names to the<br />\nR. 0. T. C. office or to Kadon,<br />\npresident of the club. Johnston, manager, will announce<br />\nthe schedule shortly.<br /><br />\nYELLOW<br /><br />\nI<br />\n••<br />\nla I.<br />\n••<br />\n•<br /><br />\n.•<br /><br />\nl•<br />\n••<br />\n•I<br />\n•<br />\n•<br />\nU.<br />\nII<br />\nIIII<br /><br />\nI.<br />\nUI<br />\n•<br />\n•<br />\n•<br />\n•<br />\nMO<br />\n••<br />\n••<br />\n••<br />\nIII<br /><br />\nn0<br />\nsr<br /><br />\n•<br />\n••<br />\n•I<br />\n•I<br /><br />\neONEfuel. •.•.<br />\n•<br />\n•I<br />\nI•<br />\n••<br /><br />\n••<br /><br />\nthat- ca. n keep •.<br />\nwith every,<br />\ncha<br />\nchangeinyourpla.nt ..••<br />\nI<br /><br />\na5<br /><br />\nr<br /><br />\nan:<br /><br />\nSteP<br /><br />\nII O<br />\nU.<br />\nII<br />\na o<br />\na•<br /><br />\nII •<br />\n•X<br />\n•<br />\n•<br />\nUp<br />\n.•<br />\n11<br />\nME,<br />\nme<br />\n•1111•11•••ThIll•M•IIM•01<br />\na w••1111•MEN11111•1111•••••1•11111•1111111•••11•11EN•s••••••••1111•11•11111•1•1111•11.<br /><br />\nNearly all plants, at times,<br />\nhave these conditions to<br />\nmeet:<br />\n• A •thange in production<br />\nmethods;the introduction of<br />\na new product; the need for<br />\ngreater production facilities.<br />\nNot only are these problems<br />\nmost easily met when the<br />\nfuel employed is gas, but,<br />\nwith gas, they can invariably be met in the way that<br />\ninsures utmost operating<br />\nefficiency.<br />\nRearranging or extending<br />\nheating facilities, when gas<br /><br />\nis employed, often involves<br />\nnothing more than the rearranging or extending of<br />\ngas piping.<br />\nGas service can be readily<br />\ntaken to parts of the plant<br />\nwhere it would be difficult,<br />\nif not impossible, to apply<br />\nother forms of heat.<br /><br />\nYou can do<br />\nit better<br />\nwith GAS<br /><br />\nThe availability of gas to all<br />\nparts of the plant is but one of<br />\nmany advantages inherent in<br />\nthis superior fuel. Your local gas<br />\ncompany will be glad to tell you<br />\nof all these advantages and what<br />\nthey will mean to your plant.<br />\nTelephone or write them today.<br /><br />\nFor free copy of book,\"Industrial cas Heat\",address<br /><br />\nCAB STAND<br />\nAT<br /><br />\nHOMEWOOD FIELD<br />\nNo Charge for Extra Passengers<br /><br />\nAmerican Gas Association<br />\n420 Lexington Avenue,New York City<br /><br />\n'PHONE<br /><br />\nVERNON 1 2 1 2<br />\nFOR A<br /><br />\nYELLOW<br /><br />\nCAB<br /><br />\nmom Nuaassimmuusw•ors•••tour...mar ma U<br /><br />\nMUSOMM1011101115111M.<br /><br />\nNOVEMBER 6, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER,<br />\nCOMMUNITY INN<br /><br />\nPLANTATION<br /><br />\neMANNIE BERG<br /><br />\nHANDKVtCHIEFS<br /><br />\nLADIES' HOSE, UNDIES,<br />\nHANDKERJCEHLILEIER:<br />\nHOSE, TIES.<br /><br />\nMEN'S<br /><br />\n,<br />\nin e south:<br />\nlierbert Hoover will talay be closest vote was found<br />\nand West<br />\nelected president of the United 1 ern states of Kent y<br />\nwinning in each<br />\nStates, if the poll conducted:by, the Virginia, Ho°<br />\nDistinction<br />\nNEWS-LETTER in conjunction with case by o<br />\nthree votes. Smith had<br />\nCollege Humor means anything. Ii CO ortable majority in all of the<br />\n1944 EDMONDSON AVESIUE<br />\nThe vote on this campus was<br />\nthem n states that he carried<br />\nPhone Gilmor 6886<br />\nHoover -127.<br />\nTexas and ,<br />\nSmith-115.<br />\nby four to one. Smith • by seven<br />\nThomas-4<br />\nsouthern states.<br />\nPhone HOmewood 7908<br />\nto five in all sixt<br />\nWill Rogers-2.<br />\note was cast in VirThe heavie<br /><br />\nTra49• Ni.+rk<br /><br />\nWhen You Can Buy Here for Less<br />\nWhy Buy Elsewhere<br /><br />\nOrchestras of<br /><br />\nCollet,iate Furnishins<br />\nNORTH AVE. MARKET<br />\nfi lotficRvt.AND-<br /><br />\nAVE&amp;<br /><br />\nBirely's 'Pharmacy4 •<br /><br />\nPhone CAlvert 5975<br /><br />\nTHE CHARLES E. MYERS CO.<br />\nIncorporated<br />\nManufacturer of<br /><br />\n'RUBBER STAMPS<br />\nThe Service Shop<br />\n319 W. Redwood St.<br /><br />\nST. PAUL at 33rd STREET<br /><br />\nYour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br /><br />\nCommer;ig<br />\nNewspapers<br />\nBooks<br />\nEstabl.hed 1880<br /><br />\n,Thomas &amp; Evans<br />\nPrinting Company<br />\n1506-1508 Guilford Avenue<br />\nBaltimore, Md.<br />\nPhone VErnQn 5691<br /><br />\nit<br /><br />\n11111;t 1 1 1'11,1 1 1 1 1 1 !i i!1,1 1 1<br /><br />\nHit<br />\nSYSTEM<br /><br />\nof College ginia<br />\nthe lightest vote in ArThe national<br />\nHerbert Hoover ka as. Hoover carried every CenHumor shows t<br />\nis the more '.ular collegiate. can- ral state, and also every western<br />\ndidate by 2 • 1. This vote was t<br />\nwest he led three to<br />\nin state. In the<br />\nfirst of i kind ever 'carried<br />\nthe strongest for<br />\nwas<br />\nMontana<br />\none.<br />\nof<br />\nthis co tty and is consi0t4ed<br />\nimportance becatise of the the G. 0. P., while Virginia cast<br />\nprim<br />\nfa that the present-06 college stu- most votes for Smith.<br />\nts are the nucleus of the future<br />\nRogers Gets Vote<br />\nmerican political world. The maWill Rogers obtained one-half of<br />\njority of the voters, numbering in one per cent- of the total student<br />\nall 544,685, had never had any exvote. The following was received<br />\nperience at the polls. The distribuat<br />\ntion of ballots was carried on in a from. the St. John's Collegiate,<br />\nvery thorough and systematic man- Annapolis: \"Hoover 128, Smith<br />\nner, through the co-operation of the 120, Texas Guinan 2, students dry<br />\nseveral college newspapers, the ma- add faculty all wet.\"<br />\njority,of which ran ballots on their<br />\nBoth of the candidates made<br />\nfront pages. In many schools, parIn<br />\nticularly in the southern states, the\" statements to College Humor.<br />\nstudents carried on strenuous cam- the statement of the. Republican<br />\npaignings for their favorites.<br />\nCandidate, Hoover reviewed some of<br />\nhis early struggles at Leland StanHoover Gets Majority<br />\nExamination of results shw that ford University as a student and<br />\nHerbert Hoover obtained a major- went on to tell some of the humority of student votes in thirty-eight<br />\nous incidents that befell him as an<br />\nstates and the District of Columbia.<br />\nundergraduate and later on as an-inAlfred E. Smith carried the remainat this Californian institustructor<br />\nof<br />\nentirely<br />\nconsisting<br />\nstates<br />\ning ten<br />\nsouthern territories. They were: tion. Al Smith gave in his stateVirginia, , Maryland, North Caro- ment his views on humor and the<br />\nlina, South Carolina, Georgia,'Flor- probable effect it would have up<br />\nida, Alabama, Mississippi, Louisiana<br />\nthe political campaign.' He s • he<br />\nand Texas. Of all the northern<br />\nhupee<br />\nintended to make his s- —<br />\n.states that voted for Hoover the<br />\nlargest majority vote was .in Con- morous, above all things.<br /><br />\nBraehurn<br />\nUniversity<br /><br />\nMos<br />\n833 - S45<br /><br />\n$7.50 to $10<br /><br />\nExclusive<br /><br />\nClothiers and Haberdashers<br /><br />\n,11.11-1 NE U113U<br />\n.17 E. Baltimore St.<br /><br />\n.<br /><br />\nAnd So His Fac<br /><br />\nEl(<br /><br />\nis Near<br /><br />\nTHE COLLE ATE SHOP<br /><br />\nArmouncei its Ope ng on November 5th-'<br />\n2446 N.<br /><br />\nRLES ST.<br />\nHOmeWood 8589<br /><br />\n()lien Every Evening<br /><br />\nthe boys (Hopkins) to help themselves.<br />\nHelp the girls (Goueher) nd<br />\nhand-made novelties and home-made dainties<br />\nStop in to see their display<br />\n•<br /><br />\nRE IS THE PLAN<br />\nhere, why not make some extra pin money<br />\nChristmas is alm<br />\nbringing some homemade article to be sold<br />\nby<br />\n,<br />\net<br />\nhat,<br />\ncoat,<br />\nnew<br />\na<br />\nfor<br />\nat 10% commission. Probably your<br />\nExchange<br />\nHorik.<br />\nGoucher,<br />\nat the<br />\nr<br />\ntherefore, why<br />\n•<br />\nMothers and .Sisters re helping you through College,<br />\nanything.. All helps<br />\nnot have'them make me-candy, cakes, or, in fact,<br />\nHopkins students to<br />\n.and everybody wil be out to help Goucher and<br />\nring your articles now and remember the articles<br />\nhelp themsehjes.<br />\nthat are least ex nsive sell the best.<br /><br />\nat Tire<br />\nCall Barry<br />\nVernon 4181<br /><br />\nOOD TIRES •<br />\nWe Hurry\"<br /><br />\nPhone, CAI. 1380<br /><br />\nSuccessor to HARBAUGH ti BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nMaryland<br />\nBaltimore<br /><br />\n112 E. Baltimore Street<br /><br />\nAT'S<br /><br />\nable<br />\nkins<br />\nwill<br />\nApt<br />\n- Am'<br />\nin a<br />\nkins<br />\nHim<br />\nthe<br />\nL<br />\nAllpeg<br />\ndiso<br />\nstar<br />\nraw<br />\nline:<br />\n•F<br />\nAllsylv<br />\nand<br />\nWOO<br />\nlarg<br />\nRed<br />\nBut<br />\nback<br /><br />\n()<br />\nMelt<br />\nIISCSi<br /><br />\nFRANK'S<br /><br />\nbeat<br />\nMed<br />\nboW,<br /><br />\nLight Lunch<br />\n5 W. Twenty-first St.<br />\nOpen 9.30 A. M. to Midnight<br /><br />\nE. E. ADAMS<br /><br />\nBOO<br />\nBOUG , SOLD<br />\nand E HANGED<br />\ns Book Store<br />\nPip<br />\n605<br /><br />\nTUTORING<br />\nAlgebra—Geometry—Trigonometry<br /><br />\n. EUTAW ST.<br />\nAbove Franklin<br /><br />\nWILLIAM H. JOLLY<br />\n2706 Gwynn Oak Ave.<br />\nTel. Woodlawn 276-W.<br /><br />\nas Utterly Ruined<br /><br />\n:‘<br /><br />\nGIVE Him ANI OLD<br /><br />\nRIG-1T,<br /><br />\nGOLD TonlY, WHILE<br /><br />\nLLA...TAKE YouR<br />\n0-101 ce., ITS EITI-AER<br />\nOLD GOLDS FOR You<br /><br />\nHE STILL 1.4AS A,<br />\nFAC E: NOT A<br />\nCOUGH IN A C<br />\nLOAt<br /><br />\nFROM N10VJ OKI — —<br /><br />\nOR SuiCto<br /><br />\ntIle<br />\nrelat<br />\nloon<br />\nof ti<br /><br />\nR.<br />\npow,<br />\nwill<br />\non .<br />\nBy 3RIGGS<br /><br />\nin Baltimore<br /><br />\nBOSTO IAN<br />\nSHOE ST<br /><br />\nHome—HO-20951<br /><br />\nPRANCES T. BANNON<br /><br />\nBARN CAFETERIA<br /><br />\nCol ege Men!<br /><br />\nSIU1140.<br /><br />\nChrist<br /><br />\nVol<br /><br />\nfttitt<br /><br />\nnecticut, nine to one. Of the northern states, Smith made his best<br />\nshowing in New York, where the<br />\nIn styl and quality \"Bostonians\" vote was nine to five for Hoover.<br />\nequal the most expensive footwear<br />\nIn the eastern states Hoover reproduced day.<br />\nceived a three to one majority. The<br />\nAnd the saying is a big item.<br /><br />\nWhenever young men<br />\ncongregate and compare notes the conclusion is almost tht.<br /><br />\nCOOKIES<br /><br />\nCANDIES<br /><br />\nGWYNN LEASE<br /><br />\nThe Old Boy Himself\"<br /><br />\nNORTH<br /><br />\nNEWS-LETTER POLL SHOWS HOOVER<br />\nTO BE LIKELY WINNER TODi:a<br /><br />\nSEEX<br /><br />\nTIMES YOL/<br />\nCOUGH, SEEXA TIME<br />\nI CUT You FACE!!<br /><br />\n5HAvA<br />\nYou No MO''!<br /><br />\nPLEASE,<br /><br />\n•<br /><br />\nfirst<br />\nIll) t wel<br /><br />\nthre;<br /><br />\ngam,<br /><br />\nlargt<br /><br />\nof tl<br /><br />\nScht<br />\nstick<br />\nMay<br />\nStick<br />\nidly<br /><br />\nrupti<br />\nkccp<br /><br />\n(buil<br /><br />\nAvoid the<br /><br />\nthc<br /><br />\nDormitory Blues<br /><br />\nT<br /><br />\nHEY are easily contracted if you have to<br />\nspend most of your time<br />\nin your room grinding<br />\naway at long reports and<br />\ntheses.<br />\nSpeed things up! Get a<br />\nRemington Portable to do<br />\nyour writing. It will effect<br />\na remarkable saving of<br />\nwriting time—to say nothing of the greater neatness<br /><br />\n(0. a<br /><br />\nand legibility of typewritten matter. Chances<br />\nare, that means better<br />\nmarks, too.<br />\nRemington Portable is the<br />\nsmallest, lightest, most<br />\ncompact and most dependable standard keyboard<br />\nportable. Weighs only<br />\npounds, net; carrying case<br />\nonly 4 inches high.<br />\nMonthly payments, if desired.<br /><br />\nIkmington<br />\nPortable<br />\nREMINGTON RAND<br />\nBUSINESS SERVICE, INC.,<br />\nStreet<br />\nBALTIMOREVD,<br /><br />\n130 W. Payette<br /><br />\nD<br />\nOL<br />\nGOLD<br />\n'The Smoother and Better Cigarette<br />\nnot a cough in a carload<br />\n0 P. Lorillard Ca., Eat. 1780<br /><br />\nTI<br />\ned a<br />\nrang<br />\nIlyr(<br />\nems:<br />\nJay\"<br />\nthis<br />\nathle<br />\nkins<br />\nfinal<br />\nland<br />\nthe f<br />\ngive'<br />\nTI<br />\n1928<br />\nDate<br />\nApri<br />\nApri<br />\nApri<br />\nApri<br />\nMay<br />\nMay<br />\nMay<br />\nMay<br /><br />"}], "field_media_file": [{"target_id": 38300, "display": null, "description": null, "target_type": "file", "target_uuid": "1d7b565a-cfef-4aca-8582-a181d22caebb", "url": "http://digital.library.jhu.edu/system/files/2022-03/13339-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13339, "target_type": "node", "target_uuid": "449fcbef-3be8-41ba-b645-8d1e38bd8508", "url": "/node/13339"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "c94af90f-7d40-45ab-bdfd-4e43c417766b"}]}