{"mid": [{"value": 38852}], "uuid": [{"value": "0e99c394-4a92-4159-988a-1aae73a2447d"}], "vid": [{"value": 38852}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:08:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13687-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:08:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:08:28+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "\"g lbws<br />\nVOL. LXII, NO. 2<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, SEPTEMBER 27, 1957<br />\n<br />\n0<br />\n<br />\n62ND YEAR<br />\n<br />\nGavin Pitt Appointed Eisenhower Welcomes '61,<br />\nJHU Vice-President Stresses Future, Freedom<br />\nGavin A. Pitt, director of personnel services for General Dynamics Corporation, has been appointed vice president of the Johns Hopkins University and Hospital, according to University President Milton S. Eisenhower and<br />\nHospital Director Russell A. Nelson.<br />\nMr. Pitt has served as Assistant Dean of Brown University, assistant to the President of that university and as<br />\nChairman of the Board of Trustees of the Brown Uni- Walter Reuther,<br />\nPresident of<br />\nversity Fund. Since then he has held management and the AFL-CIO, heads a list of<br />\npersonnel administrative positions with several large busi- nationally-known figures tentatively scheduled to speak at the<br />\nness organizations.<br />\n<br />\nYMCA States<br />\nSpeaker Roster<br />\nFor 1957-'58<br />\n<br />\nReplaces Colman<br />\nHe joined the Hopkins staff<br />\nSeptember 16, filling the vice<br />\npresidency formerly held by Mr.<br />\nJ. Douglas Colman, who resigned<br />\nearlier this year. Mr. Colman<br />\nwas responsible for the development program at Johns Hopkins.<br />\nOf Mr. Pitt's appointment, Dr.<br />\nEisenhower said, \"We are most<br />\nfortunate to obtain the services<br />\nof such an able and dynamic<br />\nman who combines a deep understanding of higher education<br />\nwith a deep knowledge of American business administration.<br />\n\"This unique background, plus<br />\nhis dedication to education, will<br />\nbe of great assistance to the<br />\nHopkins institutions as they seek<br />\nto meet the increasing demands<br />\nof the community and the nation.\"<br />\nTo Aid Future Plans<br />\nDr. Nelson, commenting on this<br />\njoint appointment, stated, \"We<br />\nwelcome Mr. Pitt and look forward to working with him on<br />\nthe joint opportunities, challenges and problems faced by<br />\nthe Hospital and University. His<br />\nwide experience will be of real<br />\nservice as our many plans for<br />\nfuture development begin to take<br />\nshape.\"<br />\nMr. Pitt said about his appointment, \"For more than ten<br />\nyears I have planned to make<br />\ncollege administration my life<br />\ncareer. During this time I have<br />\ntried to secure diversified experience in business and industry<br />\nwhich I hope will aid me in closing the gap of understanding between the educational and business worlds.\"<br />\nStudied At Brown<br />\nBorn in Berkeley, ,California,<br />\nIn 1915, Mr. Pitt received his<br />\nBachelor's degree from Brown in<br />\n1938, studied in the graduate<br />\ndepartments of education and<br />\nhistory at Columbia University<br />\nand Brown, and served as Assistant Dean at Brown from<br />\n1938 to 1942. In this capacity<br />\nhe was responsible for the annual distribution of a quarter<br />\nof a million dollars in scholarships, sponsored by the Society<br />\nfor the Advancement of Management. He is a member of the<br />\nPersonnel Planning Council of<br />\nthe American Management Association. He is a member of the<br />\n(Continued on Page 3)<br />\n<br />\nGAVIN A. PITT<br />\n<br />\nWJHU Expands<br />\nMusic Coverage,<br />\nVariety Shows<br />\n<br />\nJohns Hopkins University during the coming year, according to<br />\na recent YMCA announcement<br />\nof 1957-1958 plans.<br />\nOther notables include Dean<br />\nJames Pike of the Cathedral of<br />\nSt. John the Divine in New<br />\nYork City; Rabbi Mordecai Kaplan, associated with the Reconstructionist, a national Jewish<br />\nmagazine; Father Theodore Hesburgh, President of Notre Dame<br />\nUniversity, and Senator Hipolio<br />\nMarcano of Puerto Rico.<br />\nMexican Trip Planned<br />\nAmong other activities planned<br />\nby the YMCA is a trip to Mexico.<br />\nThis will follow last year's tour<br />\nto Puerto Rico in which forty<br />\nrepresentatives from Hopkins<br />\nand nine other colleges and universities in the central Atlantic<br />\nstates area, participated.<br />\nAs in the past, the YMCA will<br />\ncontinue to sponsor the Cosmopolitan Club, the Chess Club, coffee hours, movies and dances.<br />\nLater this year, the YMCA<br />\nhopes to conduct a clinic for<br />\nHopkins students considering<br />\nmarriage, the annual series<br />\n\"Marriage for Moderns.\"<br />\n<br />\nDR. MILTON S. EISENHOWER<br />\nPresident Milton S. Eisenhower officially welcomed<br />\nthe Class of 1961 to the Johns Hopkins University at an<br />\nassembly held Thursday, September 19.<br />\nIntroduced by Student Council president Tony Salem,<br />\nDr. Eisenhower pointed out that \"Hopkins is the smallest<br />\ncomplete university, where faculty scholarship, graduate<br />\nstudy and undergraduate education are all combined in a<br />\ncohesive program.\"<br />\nDr. Eisenhower remarked, \"Every individual in this<br />\nroom has the capacity of developing greatness.... And<br />\nit is your responsibility to find<br />\n<br />\n\"We plan a more complete<br />\nprogram schedule this year,' said<br />\nStation Manager Frank Zampiello, commenting on this year's<br />\noutlook for radio station. WJHU.<br />\nHighlighting the coverage will<br />\nan area in which you can make<br />\nbe the extension of WJHU's<br />\nthe greatest contribution to your<br />\n\"Morning Show,\" which gained<br />\nown satisfaction and to the soimmediate popularity at its inciety in which we live.\"<br />\nception last spring. It will be<br />\nDr. Eisenhower added, \"We<br />\nweekdays<br />\nbroadcast on<br />\nfrom 7<br />\nFifteen new appointments to the Department of Mechanical have a great deal of freedom<br />\nuntil 8:15 a.m., \"and possibly till<br />\nthe faculty and ten promotions Engineering, while the University here. We are proud that stu9 later on,\" added Zampiello.<br />\nof Iowa's former professor of dents here have the responsibilStandard evening broadcast- have been announced.<br />\nFourteen of the appointments psychology, Dr. Leon S. Otis, will ity for governing themselves reing will begin at 6 and end at<br />\nmidnight, \"with good coverage are to the rank of assistant pro- take up a position in the same sponsibly—through the Honor<br />\nSystem, the Student Council, the<br />\nof popular and classical music, fessor while one is to an associate department here.<br />\nnews, sports, and other features,\" professorship. Dr. Jerald L.<br />\nThe only Arts and Science ap- dormitory councils and so forth.\"<br />\nZampiello. After-dinner Erickson will become associate pointment takes Dr. Edwin S.<br />\nsaid<br />\nHe went on to say, \"The purmusic will occupy the daily 6-7 professor of theoretical mechan- Mills from Massachusetts Insti- pose of education ... is to despotlight with the \"Blue-Jay ics in the Department of Me- tute of Technology to the Politi- velop an educated mind. And an<br />\nBandstand,\" a prol-ram of late chanical Engineering this fall. cal Economy Department.<br />\neducated mind is one able to<br />\npopular music, following at 7 He previously served on the staff<br />\nreason and think critically, obThe<br />\nfour<br />\nfaculty<br />\nmembers<br />\nwho<br />\nof the Naval Research Laborao'clock.<br />\nreceived promotions to the rank jectively and creatively within a<br />\nFrom 8 until 9 each evening tory.<br />\nof full professor are Dr. Robert moral framework.\"<br />\nColumbia,<br />\nPrinceton<br />\nMen<br />\nHere<br />\nthere will be special features<br />\nS. Ayre, Chairman of the DePresident Eisenhower was also<br />\nDr. Willard Bastian, formerly<br />\nsuch as editorials, news compartment of Civil Engineering; present<br />\nPrinceton<br />\nof<br />\nat the Freshman WelUniversity,<br />\nDr.<br />\nand<br />\nmentary, sports shows, interDr. George S. Benton, professor coming<br />\nSheldon K. Friedlander, from<br />\nBanquet, held last Monviews with faculty and student<br />\nof Civil Engineering; Dr. Harold<br />\npersonalities, and a religious pro- Columbia University, assumed E. Hoelscher, Chairman of the day night in Levering Hall. The<br />\nprofessorships<br />\nassistant<br />\nin<br />\ntoastmaster was Dr. Willis Gore<br />\nthe<br />\ngram. \"Pop Preview,\" a panel<br />\nChemical Engineering Depart- Department of Chemical Engi- of the Hopkins engineering dereview of the latest popular rec(Continued on Page 3)<br />\nment. Dr. Ronald Cowden, from<br />\npartment.<br />\nords, will continue this year as<br />\nthe<br />\nOak<br />\nNational<br />\nLaboraRidge<br />\nThree outstanding members of<br />\nwell as the Sunday evening Barntory, and Dr. Kenneth J. Monty,<br />\nlast year's freshman class were<br />\nstormer programs,said Zampiello.<br />\nformerly of the McCollum-Pratt<br />\nawarded plaques by Omicron<br />\n• \"We are now recruiting fresh- Institute, joined the Biology DeDelta Kappa for their active<br />\nmen for regular positions on the partment, as did Dr. Phillip<br />\nparticipation in extra-curricular<br />\nProgram and Business staffs,\" Hartmen, from the University of<br />\nactivities. Oz Garcia was named<br />\nsaid Zampiello.<br />\nBrussels, and Dr. Clement L.<br />\nas outstanding freshman athlete,<br />\nMarkert, from the University of<br />\nand Boland McCamy and Rolf<br />\nMichigan.<br />\n\"We've no plans as yet but Bessin were singled out as<br />\nthe<br />\nDr. Warner E. Love, previously plenty of ideas that will be dismost active in club and organiof the Institute for Cancer Re- cussed by the staff of the Hulazation activities. The awards<br />\nsearch in Philadelphia, Pennsyl- baloo,\" said Editor-in-Chief Ed<br />\nwere presented by Ron Nagler,<br />\nvania, and Dr. Charles A. Thom- Seigenfeld about next year's<br />\nchairman of Orientation Week.<br />\nas, Jr., from the University of edition.<br />\nThe main speaker of the eveJohns Hopkins' Class of 1961 majors, the Class finds the en- Michigan, both began work in the<br />\nThe '57 yearbook was praised<br />\nning was Dr. Donald Andrews of<br />\nIs 367 strong. Its membership gineers boasting the greatest Jenkins Department of Biophys- heartily by Seigenfeld. He said<br />\nranges from 180 Marylanders who number, 158. Eighty-eight pro- ics, which inherited five million that he was \"pleased\" and the Hopkins Chemistry Department. Dr. Andrews pointed out<br />\ndollars last year from the will \"happy\" with it.<br />\nmake up approximately half of<br />\nposed Biological Science majors of Mrs. Mary McShane.<br />\nthe achievements of Hopkins<br />\nthe class, among which are 109<br />\nStudent<br />\nappreciation<br />\nwas<br />\nBaltimoreans, to students from and 40 Physical Scientists also<br />\nThe Department of Geology shown by the record sales of 700 men in tlie past and then outyear. The will receive Dr.<br />\nSiam, Cuba, Hawaii, Argentina, entered Hopkins this<br />\nDavid M. Raup, copies, said Seigenfeld. He point- lined the unlimited opportunity<br />\nlisted from the<br />\nPuerto Rico, Israel, Lebanon, remainder of the Fresh<br />\nCalifornia Institute of ed out that the sales campaign for advancement in science availHumanities, 30; Business, 29; and Technology, while Dr.<br />\nPeru and Hong Kong.<br />\nBernard M. for the '58 edition was in full able to Hopkins men in the<br />\nTwenty-four states are repre- Social Sciences, 20, as 'proposed Dwork will join the<br />\nMathematics swing and he was \"out to top future.<br />\nDepartment, leaving Harvard last year's record.\"<br />\nsented in the Freshman Class. majors.<br />\nDr. Andrews also expressed his<br />\nNew York, with 41, and New JerAccording to the second an- University. In Physics, a former<br />\nSeigenfeld will lead a staff hopes for the class of 1961 by<br />\nsey, with 32, boast the largest nual edition of \"The Homewood\", University of Wisconsin profes- consisting of Chris Kahl and wishing that \"they will see realnumber of dormitory men. The sixty-five members of the Class sor, Dr. Gordon Feldman, will Stu Viess as associate<br />\neditors, ity and faith and high purpose<br />\nClass of '61 also lists represen- of '61 were in the honor societies begin residence<br />\nBill Smith as business manager, and high destiny, and if they<br />\ntatives from as far as Washing- at their high schools. A total of<br />\nOne A&S Appointment<br />\nBill Cooper as managing editor grasp that, they will realize more<br />\nLon and as far south as Florida. 159 athletes<br />\nFrom Cambridge University and Andy Ginnis co-ordinating fully that the 'truth of God will<br />\nare among the inBroken down according to coming freshmen.<br />\ncomes Dr. Owen M. Phillips to editor.<br />\nmake you free.'\"<br />\n<br />\nMarylanders, Engineers<br />\nDominate Freshman Class<br />\n<br />\nAdministrationAnnounces<br />\nNew FacultyAppointments<br />\n<br />\nHullabaloo Staff<br />\nLays New Plans<br />\nFor '58 Edition<br />\n<br />\n\fNEWS -LETTER<br />\n<br />\nPAGE TWO<br />\n<br />\n3111r<br />\n<br />\nnhutti iqopititts Nritis-/Crttrr<br />\n<br />\nPublished every Friday during regular sessions of The Johns Hopkins<br />\nUniversity except during examinations and college holiday periods, by undergraduates of the University. The views expressed in the editorial columns<br />\nare not necessarily those of all Board of Control members. Subscription,<br />\n$3.00 per year, $1.50 per term. Address: Box 1230. Telephone: BE 5-5879.<br />\n<br />\nEditors in-chief<br />\nHerbert F. Kahler<br />\nMalcolm S. Baroway<br />\nBusiness Manager<br />\nRobert S. Goldstein<br />\n<br />\nOur blithe spirits, once more out of hand, have allowed<br />\nvs to relinquish this editorial column and navel of contemplation to the class of '61. Below are the two editorials<br />\nselected by the editors from the multitude submitted. The<br />\nauthors are: W. Harry Lambright and Thomas Rightmyer.<br />\n<br />\nA Fresh Viewpoint<br />\n<br />\nFrustrations Confront '61<br />\nAs College Career Starts<br />\nSpeeches, welcome songs and ; middle nineties. Needless to say,<br />\nliverwurst sandwiches all pre- enthusiasm had probably run<br />\nsent themselves in a panorama higher in the \"castle of the<br />\nof the Hopkins to the incoming army\" at Hopkins.<br />\nfreshmen. The first few - days are<br />\nAs Orientation Week progressconfusing and frustrating, but ed, we became more familiar<br />\none thing becomes apparent at with the campus and met more<br />\nthe very onset: Freshinen are and more of our classmates. Dr.<br />\nnot pushed or shoved around at Eisenhower's address introduced<br />\nus to the more serious aspects<br />\nJohns Hopkins.<br />\nof college and some freshmen<br />\nare<br />\nguided<br />\nAs a freshman you<br />\nexpressed concern afterwards as<br />\nand advised on ,almost every to whether they could meet the<br />\nstage of campus life. You are academic standards here. We<br />\nabsorbed and accepted so rap- were assured, however, that if<br />\nidly that in almost no time you we didn't have enough grey matter to stay we wouldn't be here<br />\nfeel that you are really a part in the first place. Hopkins<br />\nstrikes<br />\nof the University.<br />\nalmost all freshmen and upperThe first day of Orientation_ is classmen that I have talked to<br />\nas a very tough school.<br />\ndevoted to familiarizing the<br />\nBefore the Orientation prothe<br />\nfreshmen with<br />\nphysical layout of the campus and some of gram was half over, the box<br />\nthe machinery of the University. lunches became infamous among<br />\nPerhaps the high point of the freshmen and student leaders<br />\nday was the inspiring collection alike. While there is wide specuof messages from various repre- lation that the box lunches are<br />\nsentatives of the R.O.T.C. pro- being used to replace the freshmen beanie, I doubt that this<br />\ngram.<br />\nis actually the case. This would<br />\nCall To Arms<br />\nnot explain why student leaders<br />\nBy the time my group got eat them. Almost all the nonaround to its \"call to arms\" freshmen are in favor of orienspeech the temperature seemed tation. The opinions on box<br />\nto be hovering somewhere in the lunches run more to the negative<br />\nside.<br />\n<br />\nOrientation week has established in the minds of<br />\nfreshmen one very startling and unexpected fact: at the<br />\nHopkins he is immediately to be treated as a man, no better<br />\nno less than his fellow classmates; and he is going to be<br />\nexpected to act accordingly.<br />\nThis remarkable upperclassman acceptance of the<br />\nnew student was revealed eloquently when: (1) the Freshman was given the opportunity to use a freedom and<br />\nindependence of judgment heretofore unknown in choosing his first-year courses; (2) he was assigned the massive<br />\nresponsibility of following the Hopkins Honor System;<br />\n(3) he was encouraged before the school term began to<br />\nbecome an integral part of the extra-curricular life of<br />\nthis college.<br />\nWhat better example of the earnestness of the Upperclassmen in helping their new Hopkins men than this newspaper you are now reading. How many other college<br />\nnewspapers set aside an issue solely for its Freshmen<br />\nstaffers? It demonstrates a unique desire on the part oft<br />\nthe Editors to help its first-year men to be a part of the<br />\nNews-Letter team. This one example is typical of the<br />\nefforts of every extra-curricular organization here.<br />\nActions such as the above make for the distinct<br />\nfriendly, cohesive atmosphere, the esprit de corps which is<br />\n108's the name. Royce 108. rve<br />\nso visible at The Hopkins.<br />\naround here for quite a<br />\nbeen<br />\nTo be welcomed and called by first name by outstand- while, 34 years to be exact. Oh,<br />\ning seniors—seemingly insignificant, but so important for you'll get to know me pretty<br />\nthe Freshman prepared for the worst. There are no bizarre well, fellas. Yessiree, all three<br />\ncaps or verbal cracks to distinguish Freshmen from other of us are gonna have a wonderful year together .. . my experistudents at this institution.<br />\nence and all, and your ideas and<br />\nHow can we Freshmen help but accept with a deep hopes—we'll be quite a group.<br />\nsense of obligation Dr. Milton Eisenhower's Orientation My job is to see that your<br />\nstatement concerning the future of Hopkins: \"Look to freshman year is just right, so<br />\nlet's get a little organized. That's<br />\nthe Freshman class.\"<br />\nit, put your book.s on the shelf<br />\nthe<br />\nEisenhower,<br />\nEvery freshman should show Dr.<br />\nand take your clothes . . . oh, by<br />\nfaculty, and particularly the upperclassmen his apprecia- the way, the beds lift up for<br />\ntion for what they have done; he should gladly accept storage. Pretty Neat!<br />\nand fulfill the responsibilities entailed in being a Hopkins You know something? (don't<br />\ntoo much if I reminisce a<br />\nman. He should work to maintain good grades; he should mind Quite<br />\na few fellas like you<br />\nbit).<br />\nparticipate in the university's extra-curricular program, have passed through my hands<br />\nand he should obey and promote the Honor System.<br />\n. .. er . . . my door. Why, it<br />\nOthers have made the first move; it is up to us, the seems like yesterday that a fella<br />\nnamed Woodrow Wilson was in<br />\nW.H.L.<br />\nFreshmen, to make the second.<br />\n<br />\nFreshmen Find<br />\nNew Advisor;<br />\nSage Of Royce<br />\n<br />\nThe Long And Short Of It<br />\nAsk any•freshman or upperclassman what he thinks<br />\nof Orientation Week. If he has thought about the question,<br />\nand most Hopkins men have, he will either want to lengthen<br />\nthe week or shorten it.<br />\nHe who wants to lengthen the program will usually<br />\nsay he feels rushed, doesn't have enough time to digest<br />\nwhat he learns, to assimilate and discuss it, to enjoy the<br />\nrecreational opportunities offered by The Hopkins, both in<br />\nthe formal and in the informal sense, and so on. If he is<br />\nmore honest, and less given to saying little in a great many<br />\nwords, he will say he wants more time to loaf and more<br />\ntime to hack.<br />\nHe who wants to shorten the Orientation Week to<br />\ntwo or three days usually argues like this:<br />\n\"I came to Hopkins to learn, and I intend to put all<br />\nmy free time on my studies. This 'Activities Optional',<br />\nand the Intramural Athletics time, to say nothing of the<br />\nconstantly reiterated Honor Commission talk about the<br />\nprocedures for dealing with violators, who after all number less than one percent of the University, accomplish<br />\nvery little toward the ultimate objective.\" This was the<br />\nline we heard from our own cross-section of the freshman<br />\nclass, a percentage somewhat larger than Dr. Gallup's 15<br />\nhundred of 150 million.<br />\nThe happy medium lies somewhere between the two<br />\nschools of thought. We did come here to study, but, they<br />\nsay, a well-rounded person gets better grades and greater<br />\nopportunities than a bookworm. It is to introduce the<br />\nFreshman to these other aspects of Hopkins life that<br />\nOrientation is spread over a full week. For the \"assimilating\" and \"recreation\", the loafing and the hacking, the<br />\nLevering Hall people hold the Freshman camp. We like<br />\nT.N.R.<br />\nthe system as it is.<br />\n<br />\nHOMEWOOD, BALTIMORE, SEPT. 27, 1957<br />\n<br />\nits seemingly impenetrable isolation and remoteness from the<br />\nCity of Baltimore. Looking out<br />\nof my window into the quadrangle as I write, I feel as though<br />\nI am in the country rather than<br />\nin one of the largest cities on<br />\nthe eastern seaboat:d. This, I<br />\nthink, is one of the decided advantages of Hopkins.<br />\n<br />\nUndoubtedly the most outstanding feature of the Orientation program for all of us was<br />\nour introduction to the Honor<br />\nSystem. It came as a startling<br />\nsurprise to most of us. The fact<br />\nthat it exists we all knew, but<br />\nthe fact that it works was almost<br />\nunbelievable. Most of us came<br />\nfrom high schools and prep<br />\nschools where cheating was almost a daily occurrence. Now we<br />\nare enrolled in a University<br />\nwhere, we are told, for all practical purposes cheating does not<br />\nexist.<br />\nMost of us feel that this must<br />\nbe a fine system under which<br />\nto live. A few of my classmates<br />\nfeel that turning a friend in for<br />\na breech of the Honor Code is<br />\na lot to ask. For many, this is<br />\ncontrary to a set of values which<br />\nhas been instilled in them for<br />\nyears. The transition from these<br />\nvalues to those of the Honor<br />\nCode may indeed be quite difficult for some, but its continuous<br />\nRemote From City<br />\noperation and success has made<br />\nOne aspect of the Hopkins it a permanent feature of Hopwhich struck me particularly was kins life.<br />\n<br />\nNeophyte Declares<br />\n'College Is Different'<br />\n<br />\nclose together at college and real<br />\nGuess they haven't learned<br />\nslow.<br />\nCollege sure is turning out<br />\nthe<br />\ntwo-step<br />\naround here yet.<br />\nI<br />\nwhat<br />\nfrom<br />\ndifferent<br />\nto be<br />\nI left the mixer dance early<br />\nexpected. Kids just weren't like<br />\nthis back in our town. Maybe because everybody else seemed<br />\nI should've gone to that agri- to be going home. But all the<br />\nculture junior college near Col- couples were really walking off<br />\nlege Park after all. I've been together away from the dance<br />\nhere a week, and you should (to talk, I guess). So I went back<br />\nsee all the stuff that goes on to the dormitory and fell asleep.<br />\naround here besides studying al- But my roommate and some of<br />\nhis friends came in around two<br />\nready.<br />\nLike the first day we got here, o'clock and woke me up. They<br />\nwhen we walked into our ad- were talking about what they<br />\ndid during and after the dance.<br />\nvisor's room, the two tough boys<br />\nPlease don't forget to send my<br />\nwho are our student leaders<br />\nyelled, \"all right, you guys, get dictionary.<br />\nhere for a while.<br />\nThe teachers and the Prinyou a—s up to the front of the<br />\nOh, hey guys, don't use nails<br />\nroom here!\" Now is that any cipal (his name is Eisenhower—<br />\n,<br />\nthat<br />\n.<br />\n.<br />\n.<br />\nit<br />\nThat's<br />\non the wall.<br />\nway to talk to young boys like what a coincidence!) are very<br />\ntape that doesn't peel paint will<br />\nnice, though. They keep telling<br />\nme? Talk about scared!<br />\nsuffice.<br />\nus all to come to them whenever<br />\ndormitory<br />\nthe<br />\nin<br />\nroom<br />\nmy<br />\nAnd<br />\nAnyway, I've seen many fellas<br />\nwe need any help and they have<br />\njust like you stay with me, and here really makes me miss my lots of facilities for kids with<br />\nhave<br />\ndon't<br />\nI<br />\nhome.<br />\nback<br />\nroom<br />\nold<br />\nnow, by golly, they're all top<br />\nproblems. Well, I'd better close<br />\nany place to put my model airmen.<br />\nnow 'cause I have to go to my<br />\nBook of KnowlYes, men, I've seen a lot of planes and my<br />\nroommate next session of what they call<br />\nmy<br />\n'cause<br />\nset,<br />\nedge<br />\nHopkins. Take a good look at<br />\nclothes the Psychological Clinic.<br />\nthose walls of mine. Under that has nasty records and<br />\nHe's<br />\nplace.<br />\nthe<br />\nover<br />\nall<br />\nthrown<br />\nMelvin.<br />\ncream-colored paint are the<br />\nwears uncoats of many years 'of study. just terrible and he<br />\nand<br />\nIn fact, those youngster rooms derwear instead of pajamas<br />\nOh,<br />\nawful.<br />\njust<br />\nis<br />\nlanguage<br />\nhis<br />\nover at the new Dorms and at<br />\ndictionary<br />\nGilman Hall haven't got a thing yes, please send my<br />\nlots of<br />\nover me. Even Shriver Hall down to me. There are<br />\nhasn't seen the wonderful things words I'd like to know the meanI've witnessed—the coming of ings of.<br />\nthat intangible feeling as a<br />\nFriday night they had what<br />\nThe Barnstormers' first proyoungster changes into a Hop- they call a mixer dance and it<br />\nkins Man; the gaining of a sense was really awful. I only went duction of the year, \"Stalag 17,\"<br />\nof responsibility that comes with cause I wanted to meet some will be presented by a group of<br />\nthe freedoms freely passed on nice girls my age. I think they forty freshmen at 8:30 p.m..<br />\nfrom class to class; the intellec- were a lot older though. All October 11, in the Barn.<br />\ntual and scholastic achievements that make-up and smoking and<br />\nThe staff will include twentythat only come with years of everything. And they dance real one actors and a backstage force<br />\nsincere study; even the social and<br />\nof almost the same number. Asspiritual growth of all my friends<br />\nsisting the freshmen in the procan't be hidden from this pair<br />\nduction will be Dave Hochberg.<br />\n— Class of 1959<br />\nof probing eyes.<br />\n1959 is planning director; Dave Scribner, techof<br />\nClass<br />\nThe<br />\nWell, men, I'm proud to know<br />\nBanquet for Wednesday night, nical director; and the Bainyou, and I know we're going to a<br />\n9, at 7 p.m. at Levering stormers' Board of Control conOctober<br />\nget along fine. So keep your<br />\nHall. Dr. Milton S. Eisen- sisting of five upperclassmen.<br />\nGreat<br />\nhead high, men, 'cause you're<br />\nhower will be an honored guest;<br />\nDave Hochberg is enthusiastic<br />\nnow part of a great institution.<br />\nG. Wilson Shaffer will be about the<br />\nDr.<br />\neven<br />\nproduction<br />\nJust think of your old friend<br />\nthe guest speaker. A steak din- though hampered by lack of<br />\nRoyce—alias Vincent alias Sylner will be served. Tickets are rehearsal time. He stated that<br />\nvester alias many others. Even<br />\npriced at $2.50, payable on receipt casting for parts in the pkay<br />\nmore important, think of the role<br />\npurchaser. will be held Monday, Septemder<br />\nHopkins or at the leisure of the<br />\nyou're here to play .<br />\n30, at 4:15 p.m. in the barn.<br />\nMan.<br />\n\"Dear Mom and Dad:<br />\n<br />\nFrosh Stormers<br />\nTo Test Abilities<br />\nUnder Hochberg<br />\n<br />\n.41r<br />\n<br />\n\fHOMEWOOD, BALTIMORE, SEPT. 27, 1957<br />\n<br />\nNEWS -LETTER<br />\n<br />\nPAGE THREE<br />\n<br />\nIFB Falls On Frosh; Dr. Michael Bender Warns<br />\nJHU Greeks Ready Radiation Perils Underrated<br />\nThe<br />\nInterfraternity<br />\nBoard<br />\nsmoker, presiaed over by IFB<br />\npresident Gil Decker, was held<br />\nTuesday night in Levering Great<br />\nHall for the benefit of the freshman class. Its purpose, as outlined by Decker, was to formally<br />\nintroduce the class of 1961 to the<br />\nfraternity system and to encourage fraternity membership.<br />\n<br />\nhe said, is not the fraternity<br />\nsystem.<br />\n<br />\nHe advised that no man join<br />\na fraternity simply because he is<br />\n\"a joiner.\" \"You are doing an<br />\ninjustice to yourself and the<br />\ngroup if you join at all.\"<br />\n<br />\nThe speaker of the evening<br />\nwa.s Dr. Walter Boyer, who expressed his views on fraternity<br />\nlife as a former non-fraternity<br />\nstudent at the Hopkins and as a<br />\nformer professor in the school of<br />\nmechanical engineering.<br />\n<br />\nA fraternity, he noted, can<br />\nassist in a feeling of security and<br />\nbelonging ...can provide a fine<br />\nsocial life ... can provide a desirable atmosphere in which to<br />\nlive ... can provide a source of<br />\ncontinuing alumni interest.\" But,<br />\nhe added,\"Gentlemen,everything<br />\nI listed as good points, depending<br />\nupon the individual involved, can<br />\nbe readily converted into bad<br />\npoints.\"<br />\n<br />\nDr. Boyer's oft humorous<br />\nscrutinization of fraternities began with what could be called<br />\na characteristic statement about<br />\nfraternity life from the mouth<br />\nof a characteristic anti-fraternity<br />\nradical that the way to murder<br />\na student whom one despises is<br />\nto pledge him and \"bump him<br />\noff\" during the initiation. This,<br />\n<br />\nAt the completion of Dr.<br />\nBoyer's address Decker outlined<br />\nthe structures of the fraternity<br />\nsystem and the rushing season.<br />\nAt the close of the smoker members of the fraternities mingled<br />\nwith the freshman in order to<br />\nanswer questions regarding the<br />\nfraternity system at Hopkins.<br />\n<br />\nImprovements, Changes<br />\nMade By Plant Manager<br />\n<br />\nA Johns Hopkins University scientist, Michael A. Bender, told the National<br />\nAcademy of Sciences<br />\nthat the \"maximum permissible dose\" of radiation formerly established<br />\nmay be too low. Pictured<br />\nabove is a carefully-posed scene representing the possible outcome of high<br />\nradiation levels.<br />\nThe average \"maximum per- that there is no 'safe' dose of tion we<br />\nreceive,\" warned Dr.<br />\nRenovations and improvements been accorded by the move. He missible dose\" of radiation set radiation.<br />\nBender.<br />\n\"Careful<br />\nconsideration<br />\nof<br />\nin Ames Hall, the freshman pointed out that the Mathemat- for the population in the NationBender's research is being carchemistry lab, the Bradford ics Department acquired consid- al Academy of Sciences report, whether the benefits to be gainried<br />\non under direction of Dr.<br />\nApartments, Levering cafeteria erably better facilities in its new The Biological Effects of Atomic ed are worth the risk to ourH. Bentley Glass, Johns Hopkins<br />\nand on the athletic fields, were location.<br />\nRadiation, may be too high, ac- selves and to our descendants<br />\nundertaken this summer by the<br />\nprofessor of biology. Bender reAside from normal mainten- cording<br />\nto experiments con- should be given to any proposed ceived his Ph.D.<br />\nPlant Manager's Office.<br />\ndegree from<br />\nance work, the installation of<br />\nThe Department of Mathemat- new work tables and a new air ducted at the Johns Hopkins increase in the amount of radia- Johns Hopkins in 1956.<br />\nics has been moved from its for- ventilation system has renovated University subjecting<br />\nhuman<br />\nmer location in Rowland Hall Remsen Hall's freshman chemis- cells to moderate<br />\ndoses of X-rays.<br />\ninto a newly developed area in try lab.<br />\nThe Johns Hopkins tests<br />\nAmes Hall.<br />\nDr. Gerhard H.<br />\nDieke, Chairman of the Physics Bradford Apartments Renovated marked the first time normal<br />\nStudents and faculty living in human cells received<br />\nDepartment, stated that his deknown<br />\npartment is still \"pressed for the Bradford Apartments will<br />\nGeneral Motors, Food Fair, and graduate student body seventydoses<br />\nof<br />\nradiation<br />\nand<br />\nthe<br />\nspace,\" but \"some relief\" ha.s find the renovation program prothe<br />\nSloan Foundation are a few two scholarships<br />\nand forty felgressing rapidly. The program amount of resulting damage of the many institutions<br />\nwhich lowships for students engaged in<br />\nincludes installation of complete measured carefully.<br />\noffer scholarships and fellow- graduate studies<br />\nat the univernew kitchens in all housekeepDr. Michael A. Lender, Hop- ships to students at the Johns<br />\nsity. These figures represent aling apartments. Plant Manager kins biologist, warned, \"if the Hopkins<br />\nUniversity.<br />\nmost a fifty percent increase in<br />\nTaylor and his staff have con- rates of this and other types of<br />\nFor<br />\nthe<br />\n1957-1958 school year the total number of grants which<br />\nverted the elevators from the radiation-induced damage to<br />\nmanually operated type to auto- human tissues are found to be there were offered to the under- the university was able to make<br />\navailable to students last year<br />\nmatic and have installed auto- correspondingly high in further<br />\nand grants are still being rematic temperature controls for experiments, a sharp<br />\nrevision<br />\n(Continued from Page 1)<br />\nceived.<br />\nthe heating system.<br />\nwill have to be made in our esneering; and Dr. George D. MosA new soda fountain is being timates of safe doses of radiaLast year Union Carbide oftow, professor of mathematics. put in Levering Hall<br />\nfered one scholarship through<br />\nCafeteria, tion.\"<br />\nand four outdoor hard surface<br />\nAppointments Named<br />\nthe Johns Hopkins University,<br />\nBreakage Rates<br />\nwhile this year they are offering<br />\nDr. Mostow, who was on leave play areas, including a basketball<br />\nThe report of the National<br />\nfour. The Sloan Foundation,<br />\nof absence last year at the Insti- court, have been constructed<br />\nA Johns Hopkins University which last year offered<br />\nAcademy of Sciences listed 10<br />\nthree,<br />\ntute of Advanced Study at north and south of the Homeroentgens as the maximum scientist, Dr. Arda Alden Green this year will offer seven scholPrinceton University, will con- wood stadium area.<br />\nis<br />\nwinner<br />\nthe<br />\nof<br />\nGarvan<br />\nthe<br />\npermissible average dose of raarships. The number offered by<br />\ntinue on leave this year to teach<br />\ndiation to the reproductive or- Medal, given each year to the General Motors has doubled over<br />\nat the University of Utrecht,<br />\ngans from conception to age 30. woman judged to have made the the same period.<br />\nHolland.<br />\nBender pointed out that data most outstanding contribution in<br />\nGrowth Explained<br />\nDr. John W. Gryder, chemisfrom his experiments \"indicate the field of chemistry in the<br />\nThe reason for this astonishtry; Dr. Jun-ichi Ingusa, mathethat the doses required to double United States.<br />\nmatics; and Dr. Francis E.<br />\nFormal presentation of this ing growth is twofold. Firstly,<br />\nthe spontaneous breakage rate<br />\nRourke and Dr. Robert E. Tuckaward will be made at the annual the remarkable success of last<br />\nis less than 10 roentgens.\"<br />\nyear's scholarship holders<br />\ner, both of the political science,<br />\nOver 250 freshmen took adBender said one reason the spring meeting of The American<br />\nprompted donors to increase<br />\nwere promoted to the rank of vantage of the thirty-fourth<br />\nan- research is being carried on is Chemical Society.<br />\ntheir grants, and secondly, acassociate professors.<br />\nfreshman<br />\nDr.<br />\nGreen, a staff member of<br />\nWeekend to determine more accurately<br />\nnual YMCA<br />\ncording to Mr. Lockner who is<br />\nThose who received promotions to \"get away from it all\" fol- the dangers to future<br />\ngenerations the Hopkins McCollum-Pratt In- the non-alumni development offrom instructor to assistant pro- lowing three and a half days of from the steadily<br />\nstitute,<br />\nwas<br />\nawarded<br />\nthe<br />\nhonor<br />\nincreasing<br />\nficer for Homewood, \"The infessor included Dr. Clinton De- Orientation.<br />\namounts of radiation to which for her work in successfully terest of<br />\ncorporations, foundaSoto, psychology, and Dr. Thomisolating, in crystalline form, the<br />\nThe class of '61 left by bus humans are exposed.<br />\ntions and individuals in providas Lambdin, Oriental Seminary.<br />\nenzyme<br />\nresponsible<br />\nfor<br />\nlumines.<br />\ncamp<br />\nthe<br />\nHe told the annual convenfrom Levering Hall for<br />\ning student aid is increasing and<br />\nnear Bel Air, to the northeast of' tion of the American Institute cence in the firefly.<br />\nthe University's success in atBaltimore. The freshmen were of Biological Sciences at StanLight Energy Probed<br />\ntracting a larger percentage of<br />\nby<br />\nford University that cells from<br />\nkept alive in the afternoon<br />\nThis work has made possible a such resources has grown sevvolleyball, lacrosse, horseshoe normal human kidney tissues better understanding of the enty-five<br />\n(Continued from Patle 1)<br />\npercent since last<br />\nfaculty-student found to contain a normal<br />\ncom- means by which living things year.\" This year the total numUnion League Club of New York Pitching and a<br />\nFrosh.<br />\npliment of 46 chromosomes were transform energy derived from ber of scholarships which have<br />\nsoftball game won by the<br />\nCity.<br />\nused to determine the amounts food into a variety of useful been awarded is seventy-two as<br />\nThe<br />\nevening<br />\nsession<br />\nWas<br />\nless<br />\nwas<br />\nleaving<br />\nBrown,<br />\nhe<br />\nAfter<br />\nand types of damage to human forms, such as, in this case, light compared to forty-one last year.<br />\nthe<br />\nbeing<br />\nactive,<br />\nshow<br />\na<br />\ntalent<br />\nassociated with the R. H. Macy<br />\nentertainment. Neil chromosones caused by known energy.<br />\nAll scholarships at Hopkins<br />\nCo. in New York and then the evening's<br />\nWeigel<br />\nsome feats of amounts and types of radiation.<br />\npresented<br />\nCorporation<br />\nDr. Green has made studies at are unrestricted as to what<br />\nHazeltine<br />\nand HaMaintained for a short time Washington University in St. courses the<br />\nmagic, a group of freshmen,<br />\nstudent must take.<br />\nzeltine Electronics Corporation<br />\n\"The Cliff Dwellers\", played in tissue culture, these cells Louis, Harvard University, the Fellowships,..<br />\nwas<br />\ndirector<br />\nof<br />\nhe<br />\non<br />\nwhere<br />\nthe<br />\nother<br />\nperDixieland jazz, and a rock and were exposed, and later the di- Cleveland Clinic and the Depart- hand, do restrict<br />\na student's<br />\nsonnel. He served as civilian<br />\nmembers<br />\nviding<br />\nroll<br />\ncells<br />\nquartet<br />\nfaculty<br />\nof<br />\nwere<br />\nexamined for ment of Pediatrics of the Sinai Major but Hopkins will accept<br />\nmember of the Navy Manpower<br />\nDr. Chester Wickwire, Professor damage involving the breakage Hospital in Baltimore.<br />\nno scholarship which attempts<br />\nSurvey Board in the Third Naval<br />\nThomas Hubbard, Professor Wil- of the chromosones.<br />\nDistrict beginning in 1945.<br />\nWhile at Washington Univer- to govern the student's choice of<br />\nlis Gore, and Professor David<br />\nsity, Dr. Green played a major a job after graduation. It is this<br />\nNo \"Safe\" Dose<br />\nFor the past two Years Mr. Danskin, sang current songs like<br />\nrole in studies which won the attitude of cooperation and unPitt has been with the General \"Honeycomb,\" \"That'll Be The<br />\nDr. Bender reported, \"The<br />\nNobel Prize of 1947 for the Pro- derstanding on the part of large<br />\nDynamics Corporation where he Day,\" and \"Hound Dog.\" The breakage rate found in<br />\nthese fessors Carl and Gerty Cori. At corporations and foundations,<br />\nhas been responsible for man- Phoenix Choir, an all-women experiments is much higher than<br />\nCleveland she participated in the that education and production<br />\nagement development, training group, was the only non-Hopkins that which has been generally<br />\nisolation of a substance from the are closely integrated, that has<br />\neducation<br />\nand<br />\nprograms, em- talent to perform. The evening assumed to occur ... In fact, the blood known as serotonin,<br />\nwhich attributed- to the large growth<br />\nployees benefit programs and was concluded by the serving of present experiments, taken by<br />\nis now important in studies on in the scholarships and fellowother services for more than hot dogs and cokes served themselves, lend great weight the chemical<br />\nbasis of schizo- ships that the university now<br />\n100,000 Persons.<br />\naround the campfire.<br />\nto the belief of many genetics phrenia.<br />\noffers.<br />\n<br />\nMore Scholarships Granted<br />\nIn '57;All Are Unrestricted<br />\n<br />\nNew Personnel,<br />\nTen Promotions<br />\nChange Faculty<br />\n<br />\nJHU Scientist<br />\nAwarded Prize<br />\nhi. Chemistry<br />\n<br />\n250 Freshmen<br />\nAttend 'Y'Camp<br />\nDuring Weekend<br />\n<br />\nGavin A. Pitt<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE FOUR<br />\n<br />\nHOMEWOOD, BALTIMORE, SEPT. 27, 1957<br />\n<br />\nBlue Jays Face Second Scrimmage<br />\nM-D Title Defense Chances<br />\nIn Hands Of Sophomores<br />\nCoach Wilson Fewster will Tony Salem and Eddie Mesko,<br />\nsophomore-studded also seniors; are the men vying<br />\nhis<br />\nsend<br />\nMason - Dixon Championship for the starting wingback post.<br />\nfootball squad into its second Mesko returned to school this<br />\noutside scrimmage of the fall year, and was a letterman two<br />\ntomorrow, in final preparation years ago.<br />\nfor what he expects to be a sucLittman At Center<br />\ncessful season.<br />\nLarry Littman, junior, at cenCommenting on last week's ter, and junior letterman Frank<br />\nscrimmage with Fort Meade, Frenda and Dick Auffarth at<br />\nFewster, in his first season at guards seem assured posts. Aufthe helm of the varsity grid- farth is at strong (right) guard,<br />\nmen, said, \"We got more out of and Frenda is at weak (left).<br />\nthat than you can imagine. Most Paul Winegrad, an All-Maryland<br />\nof my 40-man squad saw action, at Forest Park, or Frank Phebus,<br />\nand I was very pleased with the a fellow member of the class of<br />\n'60, will get the call at strong<br />\noutcome.\"<br />\nThe entire coaching staff of tackle.<br />\nTwo more sophomores, Mark<br />\nFewster, Ross Sachs, and Leon<br />\nHorowitz is looking forward to Williams and Cloyd Kerchner,<br />\ntomorrow's test as an oppor- are nip and tuck for weak tackle.<br />\ntunity for the young line to Either senior Bob Edwards,<br />\ninvaluable experience for junior Mickey Webster, or sophgain<br />\nto defend the Mason-Dixon<br />\nTwo anxious Jay gridders polish up blocking for their campaign<br />\nversus Franklin & omore Bob Brannan will get the<br />\nopener<br />\nits<br />\nd freshman squad of 1956, will face<br />\nundefeate<br />\nthe<br />\nfrom<br />\nplayers<br />\nby<br />\nned<br />\nstrengthe<br />\nteam,<br />\nThe<br />\n5, at Lan- weak end call.<br />\ntitle.<br />\n5. This will be the Marshall, October<br />\nSenior veteran Gus Widhelm<br />\nFranklin & Marshall in non-conference game at Lancaster, Pa. on October<br />\ncaster, Pennsylvania.<br />\nand rookie sophomore Bob Harcoaching debut of Wilson Fewster.<br />\nStarters Uncertain<br />\nFrom information to date, 35 rington round out the squad,<br />\nmen are now competing for the battling for starting strong end.<br />\nLine Is Light<br />\nstarting eleven posts. At blockThe Hopkins line will average<br />\ning back, senior Co-Captain<br />\nGeorge Schwartz is the logical only between 185 and 187 pounds.<br />\ncandidate. Schwartz, only five The backs will average 170.<br />\nIn summation, Fewster said,<br />\nfeet nine inches, 163 pounds, was<br />\n\"A successful season is quite plicity, and two is because of<br />\na T-formation quarterback at \"We are looking forward to<br />\nGeorge<br />\ncoach<br />\nsoccer<br />\nFreshman<br />\nwill<br />\nvarsity<br />\nthe<br />\ne<br />\nprobable,\" said freshman foot- the experienc<br />\nb u t another successful season. We<br />\nPolytechnic,<br />\nlast year's varsity Baltimore<br />\nball Coach Bob Scott, after look- gain in scrimmaging against the Whitlock,<br />\nat have an excellent chance to have<br />\nwing<br />\nsingle<br />\nthe<br />\nto<br />\nswitched<br />\ncaptain, is \"optimistic\" about his<br />\ning over the fifty Frosh prospects. freshmen—split 'T' against the<br />\nHopkins. He is a two-year let- one, for, while our experience<br />\ncoming<br />\nthe<br />\nfor<br />\nprospects<br />\nteam's<br />\nwing.\"<br />\n\"The fifty men, an average single<br />\nis low, the enthusiasm and genin spite of the fact that terman and is especially adept<br />\nCandidates for quarterback are season,<br />\nturnout for Frosh football, have<br />\neral attitude of the squad has<br />\nplays.<br />\ncalling<br />\nat<br />\nthe team has had only a week<br />\ndisplayed good high school back- Tom Fitzhugh, a marine veteran<br />\nBates, a 185-pound been wonderful. The team needs<br />\nErnie<br />\nof<br />\npractice.<br />\nground. The considerable num- who played fullback in Baltito gain the necExperience — virtually every senior, and 184-pound sophomore only practice<br />\nber of candidates out for line more; Grant Brewen, an end<br />\ne.\"<br />\nexperienc<br />\nessary<br />\nbattle<br />\nthe<br />\nlead<br />\nSimonsen<br />\nRod<br />\nsquad member has seen some<br />\npositions has given depth to the from Pennsylvania; and Pete<br />\nscored<br />\nSimonsen<br />\nfullback.<br />\nfor<br />\nnd<br />\n\"an<br />\naction—a<br />\nsoccer<br />\nprevious<br />\nline. However, the backfield, Sandroy, an All-Prep school end<br />\nunusual capacity for hard work\" 41 points as a two-purpose freshthough not lacking in quality, is from Washington, D. C.<br />\nthe chief assets of the twen- man last year. He tallied five<br />\nare<br />\nnumber.\"<br />\nsomewhat limited in<br />\nJerry Erdman, Jim Rogers, Ed ty-three man freshman squad, touchdowns and<br />\nsuccessfully<br />\ncontinued Scott.<br />\nMcCaffrey, and Dick Schuck, all said Whitlock.<br />\nbooted 11 of 15 points after<br />\nare<br />\ns<br />\ncandidate<br />\nline<br />\nthe<br />\nLeading<br />\nfrom Baltimore, and Skippy Leet<br />\ntouchdowns.<br />\nFive Game Schedule<br />\nTom Biddison, an All-Maryland from Annapolis are the leading<br />\nHarding Heads Tailbacks<br />\nBaltibe<br />\nwill<br />\nThe<br />\nbooters<br />\nyearling<br />\nBill<br />\nhigh school tackle from<br />\nhalfback.<br />\ns<br />\nfor<br />\ncandidate<br />\nAt tailback, a four-man freeend<br />\nan<br />\nto<br />\ntrying<br />\n2-2<br />\nthe<br />\nrecord<br />\nimprove<br />\nByrne,<br />\nMike<br />\nand<br />\nmore,<br />\nKarpovich and Jim Greenwood,<br />\nJohns Hopkins' varsity cross<br />\nfor-all is afoot. Leading the<br />\nfrom Annapolis. Both succeeded both from Baltimore, are out for that was compiled by the 1956<br />\nteam opens its 1957<br />\ncountry<br />\nCliff<br />\nletterman<br />\nsenior<br />\nis<br />\nparade<br />\nAll-Ameri<br />\nfreshman team. This year the<br />\nin making the same<br />\nfullback.<br />\nFranklin & Maragainst<br />\nseason<br />\nSophopounder.<br />\n170<br />\na<br />\nHarding,<br />\nJays will have a five game schedcan high school football team.<br />\nOz Garcia, five feet ten shall College Saturday, October<br />\nmore<br />\nule,<br />\nwith<br />\nPark<br />\nopening<br />\nSchool<br />\ns<br />\nCandidate<br />\nTackle<br />\nOctober 18 and closing November inches, 150 pounds, was utilized 12, at Homewood.<br />\nJim Kelley, a 215 pounder from<br />\n\"We should have a good team<br />\nas a left-handed quarterback<br />\n8<br />\nFreeagainst the Towson J. V.<br />\nAlan<br />\nand<br />\nnia,<br />\nPennsylva<br />\nis this year because of the experand<br />\nyear,<br />\nlast<br />\nfrosh<br />\nthe<br />\nfor<br />\nOhio,<br />\ne<br />\n\"The<br />\nmost<br />\nperimpressiv<br />\nfrom<br />\nland, a 185 pounder<br />\nience of some of the squad memformers in practice have been also in the picture.<br />\nare among the top candidates<br />\nthe outstanding fresh- bers,\" was Coach George Brown's<br />\nVoted<br />\nAll<br />\nJoe<br />\nd<br />\nZeuch,<br />\nhalf-Marylan<br />\nposition.<br />\ntackle<br />\nfor the<br />\nback at Baltimore Poly in 1956, man athlete last year, Garcia comment. These members are<br />\nBucking for guard positions<br />\nDon Schuerholtz, an outstand- threw seven touchdown passes Captain Charlie Ginsberg, Irvin<br />\nare Larry Cessna, All-City team<br />\nThe first of three outdoor ing prospect, Carter Puryear and and scored two himself. He was Miller, and last year's \"number<br />\nsecKing,<br />\nDick<br />\n,<br />\nBaltimore<br />\nfrom<br />\nbasketball courts, located on<br />\nat Fieldston in New one man,\" Morris Jones. All<br />\nond team All-Maryland from the north. side of Homewood Joe Weitzel,\" remarked Whitlock. All-Prep<br />\nthree are juniors.<br />\nAlthough decrying his newness York.<br />\nBaltimore, John Migliore and<br />\nField, was completed on Thurs- with team personnel at this early<br />\nJohn Brewer, Jim Cross, and<br />\nBill<br />\nand<br />\nsenior,<br />\nRailey,<br />\nGuy<br />\nBaltifrom<br />\nalso<br />\nMike Hopkins,<br />\nday of freshman orientation date, Coach Whitlock declared, Morrill, junior, are the other Jim McAllister are sophomore<br />\nmore.<br />\nweek, announced Johns Hopkins<br />\nRailey is a 190- members of the squad. Brown<br />\nNorm Steeketee, a 195 pounder Athletic Director Marshall Turn- \"The squad is working as hard candidates.<br />\nMorrill is a hard indicated that vacancies in the<br />\nand<br />\nas<br />\nany<br />\nI've<br />\never<br />\npounder,<br />\nI<br />\nand<br />\ncan<br />\nBowseen,<br />\nTom<br />\nand<br />\nut,<br />\nfrom Connectic<br />\nfour backboards say that I am hopeful of our passer who specializes in long squad still exist and more canother<br />\nThe<br />\ner.<br />\nfor<br />\nvying<br />\nyer from Baltimore are<br />\nwill be erected when the material team's chances for a successful heaves.<br />\ndidates for berths on the squP1<br />\ncenter.<br />\narrives.<br />\n;<br />\nmay be forthcoming.<br />\nletterman<br />\nin<br />\nsenior<br />\nseason<br />\n1957.\"<br />\nLou<br />\nKady,<br />\nGood<br />\nProspects<br />\nBack<br />\nHopkins alumnus Doctor H. A.<br />\n\"Although the prospects for<br />\nB. Dunning personally secured<br />\nbacks are good,\" Coach Scott<br />\nfrom eight other alumni<br />\n$8500<br />\nexlack<br />\n\"they<br />\nsay,<br />\nwent on to<br />\nfor the construction<br />\nhimself<br />\nand<br />\nto<br />\ngoing<br />\nis<br />\nperience. The squad<br />\nfor of three paved basketball courts,<br />\nformation<br />\n'T'<br />\nsplit<br />\nthe<br />\nuse<br />\na paved area for general use<br />\ntwo reasons.<br />\na lacrosse wall. Sizable conand<br />\nsun\"One is because of its<br />\ntributions were received from the<br />\nMcCormick & Co. Fund and<br />\nMead Johnson & Co. Foundation.<br />\nIn the past six years, the Blue<br />\n\"Strong on the line, but weak plete team should include about<br />\nAccording to Turner, the on defense,\" is coach Mickey J 36 men.<br />\nJay soccermen have produced<br />\nfour All-Americans. In 1953,<br />\ncourts are expected to accom- Cochrane's description of the<br />\nmodate over 500 students per 1957 Johns Hopkins varsity socCochrane's first year as coach,<br />\nthe Black and Blue had one of<br />\nweek in all but the worst weath- cer team.<br />\nits most successful seasons, taker.<br />\npohis<br />\nresumed<br />\nhas<br />\nCochrane<br />\ning the top spot in the Middle<br />\nHopkins freshmen cross counsition at the helm of the bootAtlantic Conference.<br />\ntry team started practice this<br />\nthree<br />\nyears<br />\nspending<br />\nafter<br />\nmen,<br />\nweek in preparation for its five<br />\nB.I.A.<br />\nBernstein, Duffany, Co-Capt's.<br />\nArmy.<br />\nthe<br />\nin<br />\nmeet schedule which opens on<br />\na part of<br />\nbe<br />\nshould<br />\n\"Sports<br />\nThe pitchmen, led by co-capKenwood<br />\nFour defensive positions are<br />\nOctober 17th against<br />\nevery student's life,\" said Stu open. One of the biggest probtains Ed Bernstein and Bruce<br />\nHigh School.<br />\nViess, president of the Board lems, according to Cochrane, is<br />\nDuffany, will play a ten game<br />\nCoach George Brown stated<br />\nIntramural Athletics.<br />\nof<br />\nschedule, including seven Conthe<br />\ngap at fullback, caused by<br />\nthe<br />\nthat he was \"pleased with<br />\nIn November, the Board the graduation of Jim Spitznas,<br />\nference foes. Hopkins is a memfirst workout.\" He urged all<br />\nwill choose three freshmen to \"the spark plug of last year's<br />\nber of the thirty team Middle<br />\ncross<br />\nin<br />\ninterested<br />\nfreshmen<br />\nAtlantic Conference. However,<br />\nserve on the B.I.A. for four squad.\"<br />\ncountry to try out for the squad<br />\nyears. More details will follow<br />\nall of the schools do not field<br />\nand said that \"experience is not in future issues.<br />\nMaterial Scarce, Good<br />\nsoccer teams.<br />\nnecessary.\"<br />\nAs for the outlook this year,<br />\nInformation concerning the<br />\nBesides the contest with perTen freshmen have signed up activities of the B.I.A. can be Cochrane commented that he<br />\nennially<br />\npowerful Maryland, the<br />\nhas<br />\none<br />\nonly<br />\nbut<br />\nteam,<br />\nfor the<br />\nfound in the B.I.A. Calendar hasn't seen all the material but<br />\nhighlight of the season is the<br />\nprevious experience.<br />\nseen.<br />\nhas<br />\nhe<br />\nand the bulletin boards in Is pleased with what<br />\nbattle with traditional rival WestAccording to Brown, the averthe gymnasium opposite the<br />\nTwelve veterans have been<br />\nMaryland on November 23.<br />\nern<br />\nof<br />\nconsists<br />\nteam<br />\nage freshman<br />\nPost Office in Gilman Hall, practicing since September 16,<br />\nIn between games include Haver25 men, ten of whom are en- and in the Dormitory Post with the rest of the squad slated<br />\nford, Franklin & Marshal/ and<br />\ntered in a two mile event. Of Office.<br />\nto begin workouts this week on a<br />\nSwarthmore.<br />\nthese ten, only the first five<br />\nNE<br />\nCOCHRA<br />\nMICKEY<br />\ncorntwice-a-day schedule. The<br />\nfinishers count in the scoring.<br />\n<br />\nFrosh Football Promising; Pitchmen Coach<br />\nMentions Spirit;<br />\nfied<br />\nt<br />\nSatis<br />\nScot<br />\nBob<br />\nh<br />\nCoac<br />\nExperience Aids<br />\n<br />\nJHU Varsity<br />\nCross Country<br />\nOpens Oct. 12<br />\n<br />\nOutdoor Courts,<br />\nLacrosse Wall<br />\nAre Completed<br />\n<br />\nFrosh Harriers<br />\nStart Workouts,<br />\nPlease Brown<br />\n<br />\n'Booters Boast Strong Line;<br />\nWeak Defense' Cochrane<br />\n<br />\n\f", "format": "basic_html", "processed": "\"g lbws<br />\nVOL. LXII, NO. 2<br /><br />\nJOHNS HOPKINS UNIVERSITY, SEPTEMBER 27, 1957<br /><br />\n0<br /><br />\n62ND YEAR<br /><br />\nGavin Pitt Appointed Eisenhower Welcomes '61,<br />\nJHU Vice-President Stresses Future, Freedom<br />\nGavin A. Pitt, director of personnel services for General Dynamics Corporation, has been appointed vice president of the Johns Hopkins University and Hospital, according to University President Milton S. Eisenhower and<br />\nHospital Director Russell A. Nelson.<br />\nMr. Pitt has served as Assistant Dean of Brown University, assistant to the President of that university and as<br />\nChairman of the Board of Trustees of the Brown Uni- Walter Reuther,<br />\nPresident of<br />\nversity Fund. Since then he has held management and the AFL-CIO, heads a list of<br />\npersonnel administrative positions with several large busi- nationally-known figures tentatively scheduled to speak at the<br />\nness organizations.<br /><br />\nYMCA States<br />\nSpeaker Roster<br />\nFor 1957-'58<br /><br />\nReplaces Colman<br />\nHe joined the Hopkins staff<br />\nSeptember 16, filling the vice<br />\npresidency formerly held by Mr.<br />\nJ. Douglas Colman, who resigned<br />\nearlier this year. Mr. Colman<br />\nwas responsible for the development program at Johns Hopkins.<br />\nOf Mr. Pitt's appointment, Dr.<br />\nEisenhower said, \"We are most<br />\nfortunate to obtain the services<br />\nof such an able and dynamic<br />\nman who combines a deep understanding of higher education<br />\nwith a deep knowledge of American business administration.<br />\n\"This unique background, plus<br />\nhis dedication to education, will<br />\nbe of great assistance to the<br />\nHopkins institutions as they seek<br />\nto meet the increasing demands<br />\nof the community and the nation.\"<br />\nTo Aid Future Plans<br />\nDr. Nelson, commenting on this<br />\njoint appointment, stated, \"We<br />\nwelcome Mr. Pitt and look forward to working with him on<br />\nthe joint opportunities, challenges and problems faced by<br />\nthe Hospital and University. His<br />\nwide experience will be of real<br />\nservice as our many plans for<br />\nfuture development begin to take<br />\nshape.\"<br />\nMr. Pitt said about his appointment, \"For more than ten<br />\nyears I have planned to make<br />\ncollege administration my life<br />\ncareer. During this time I have<br />\ntried to secure diversified experience in business and industry<br />\nwhich I hope will aid me in closing the gap of understanding between the educational and business worlds.\"<br />\nStudied At Brown<br />\nBorn in Berkeley, ,California,<br />\nIn 1915, Mr. Pitt received his<br />\nBachelor's degree from Brown in<br />\n1938, studied in the graduate<br />\ndepartments of education and<br />\nhistory at Columbia University<br />\nand Brown, and served as Assistant Dean at Brown from<br />\n1938 to 1942. In this capacity<br />\nhe was responsible for the annual distribution of a quarter<br />\nof a million dollars in scholarships, sponsored by the Society<br />\nfor the Advancement of Management. He is a member of the<br />\nPersonnel Planning Council of<br />\nthe American Management Association. He is a member of the<br />\n(Continued on Page 3)<br /><br />\nGAVIN A. PITT<br /><br />\nWJHU Expands<br />\nMusic Coverage,<br />\nVariety Shows<br /><br />\nJohns Hopkins University during the coming year, according to<br />\na recent YMCA announcement<br />\nof 1957-1958 plans.<br />\nOther notables include Dean<br />\nJames Pike of the Cathedral of<br />\nSt. John the Divine in New<br />\nYork City; Rabbi Mordecai Kaplan, associated with the Reconstructionist, a national Jewish<br />\nmagazine; Father Theodore Hesburgh, President of Notre Dame<br />\nUniversity, and Senator Hipolio<br />\nMarcano of Puerto Rico.<br />\nMexican Trip Planned<br />\nAmong other activities planned<br />\nby the YMCA is a trip to Mexico.<br />\nThis will follow last year's tour<br />\nto Puerto Rico in which forty<br />\nrepresentatives from Hopkins<br />\nand nine other colleges and universities in the central Atlantic<br />\nstates area, participated.<br />\nAs in the past, the YMCA will<br />\ncontinue to sponsor the Cosmopolitan Club, the Chess Club, coffee hours, movies and dances.<br />\nLater this year, the YMCA<br />\nhopes to conduct a clinic for<br />\nHopkins students considering<br />\nmarriage, the annual series<br />\n\"Marriage for Moderns.\"<br /><br />\nDR. MILTON S. EISENHOWER<br />\nPresident Milton S. Eisenhower officially welcomed<br />\nthe Class of 1961 to the Johns Hopkins University at an<br />\nassembly held Thursday, September 19.<br />\nIntroduced by Student Council president Tony Salem,<br />\nDr. Eisenhower pointed out that \"Hopkins is the smallest<br />\ncomplete university, where faculty scholarship, graduate<br />\nstudy and undergraduate education are all combined in a<br />\ncohesive program.\"<br />\nDr. Eisenhower remarked, \"Every individual in this<br />\nroom has the capacity of developing greatness.... And<br />\nit is your responsibility to find<br /><br />\n\"We plan a more complete<br />\nprogram schedule this year,' said<br />\nStation Manager Frank Zampiello, commenting on this year's<br />\noutlook for radio station. WJHU.<br />\nHighlighting the coverage will<br />\nan area in which you can make<br />\nbe the extension of WJHU's<br />\nthe greatest contribution to your<br />\n\"Morning Show,\" which gained<br />\nown satisfaction and to the soimmediate popularity at its inciety in which we live.\"<br />\nception last spring. It will be<br />\nDr. Eisenhower added, \"We<br />\nweekdays<br />\nbroadcast on<br />\nfrom 7<br />\nFifteen new appointments to the Department of Mechanical have a great deal of freedom<br />\nuntil 8:15 a.m., \"and possibly till<br />\nthe faculty and ten promotions Engineering, while the University here. We are proud that stu9 later on,\" added Zampiello.<br />\nof Iowa's former professor of dents here have the responsibilStandard evening broadcast- have been announced.<br />\nFourteen of the appointments psychology, Dr. Leon S. Otis, will ity for governing themselves reing will begin at 6 and end at<br />\nmidnight, \"with good coverage are to the rank of assistant pro- take up a position in the same sponsibly—through the Honor<br />\nSystem, the Student Council, the<br />\nof popular and classical music, fessor while one is to an associate department here.<br />\nnews, sports, and other features,\" professorship. Dr. Jerald L.<br />\nThe only Arts and Science ap- dormitory councils and so forth.\"<br />\nZampiello. After-dinner Erickson will become associate pointment takes Dr. Edwin S.<br />\nsaid<br />\nHe went on to say, \"The purmusic will occupy the daily 6-7 professor of theoretical mechan- Mills from Massachusetts Insti- pose of education ... is to despotlight with the \"Blue-Jay ics in the Department of Me- tute of Technology to the Politi- velop an educated mind. And an<br />\nBandstand,\" a prol-ram of late chanical Engineering this fall. cal Economy Department.<br />\neducated mind is one able to<br />\npopular music, following at 7 He previously served on the staff<br />\nreason and think critically, obThe<br />\nfour<br />\nfaculty<br />\nmembers<br />\nwho<br />\nof the Naval Research Laborao'clock.<br />\nreceived promotions to the rank jectively and creatively within a<br />\nFrom 8 until 9 each evening tory.<br />\nof full professor are Dr. Robert moral framework.\"<br />\nColumbia,<br />\nPrinceton<br />\nMen<br />\nHere<br />\nthere will be special features<br />\nS. Ayre, Chairman of the DePresident Eisenhower was also<br />\nDr. Willard Bastian, formerly<br />\nsuch as editorials, news compartment of Civil Engineering; present<br />\nPrinceton<br />\nof<br />\nat the Freshman WelUniversity,<br />\nDr.<br />\nand<br />\nmentary, sports shows, interDr. George S. Benton, professor coming<br />\nSheldon K. Friedlander, from<br />\nBanquet, held last Monviews with faculty and student<br />\nof Civil Engineering; Dr. Harold<br />\npersonalities, and a religious pro- Columbia University, assumed E. Hoelscher, Chairman of the day night in Levering Hall. The<br />\nprofessorships<br />\nassistant<br />\nin<br />\ntoastmaster was Dr. Willis Gore<br />\nthe<br />\ngram. \"Pop Preview,\" a panel<br />\nChemical Engineering Depart- Department of Chemical Engi- of the Hopkins engineering dereview of the latest popular rec(Continued on Page 3)<br />\nment. Dr. Ronald Cowden, from<br />\npartment.<br />\nords, will continue this year as<br />\nthe<br />\nOak<br />\nNational<br />\nLaboraRidge<br />\nThree outstanding members of<br />\nwell as the Sunday evening Barntory, and Dr. Kenneth J. Monty,<br />\nlast year's freshman class were<br />\nstormer programs,said Zampiello.<br />\nformerly of the McCollum-Pratt<br />\nawarded plaques by Omicron<br />\n• \"We are now recruiting fresh- Institute, joined the Biology DeDelta Kappa for their active<br />\nmen for regular positions on the partment, as did Dr. Phillip<br />\nparticipation in extra-curricular<br />\nProgram and Business staffs,\" Hartmen, from the University of<br />\nactivities. Oz Garcia was named<br />\nsaid Zampiello.<br />\nBrussels, and Dr. Clement L.<br />\nas outstanding freshman athlete,<br />\nMarkert, from the University of<br />\nand Boland McCamy and Rolf<br />\nMichigan.<br />\n\"We've no plans as yet but Bessin were singled out as<br />\nthe<br />\nDr. Warner E. Love, previously plenty of ideas that will be dismost active in club and organiof the Institute for Cancer Re- cussed by the staff of the Hulazation activities. The awards<br />\nsearch in Philadelphia, Pennsyl- baloo,\" said Editor-in-Chief Ed<br />\nwere presented by Ron Nagler,<br />\nvania, and Dr. Charles A. Thom- Seigenfeld about next year's<br />\nchairman of Orientation Week.<br />\nas, Jr., from the University of edition.<br />\nThe main speaker of the eveJohns Hopkins' Class of 1961 majors, the Class finds the en- Michigan, both began work in the<br />\nThe '57 yearbook was praised<br />\nning was Dr. Donald Andrews of<br />\nIs 367 strong. Its membership gineers boasting the greatest Jenkins Department of Biophys- heartily by Seigenfeld. He said<br />\nranges from 180 Marylanders who number, 158. Eighty-eight pro- ics, which inherited five million that he was \"pleased\" and the Hopkins Chemistry Department. Dr. Andrews pointed out<br />\ndollars last year from the will \"happy\" with it.<br />\nmake up approximately half of<br />\nposed Biological Science majors of Mrs. Mary McShane.<br />\nthe achievements of Hopkins<br />\nthe class, among which are 109<br />\nStudent<br />\nappreciation<br />\nwas<br />\nBaltimoreans, to students from and 40 Physical Scientists also<br />\nThe Department of Geology shown by the record sales of 700 men in tlie past and then outyear. The will receive Dr.<br />\nSiam, Cuba, Hawaii, Argentina, entered Hopkins this<br />\nDavid M. Raup, copies, said Seigenfeld. He point- lined the unlimited opportunity<br />\nlisted from the<br />\nPuerto Rico, Israel, Lebanon, remainder of the Fresh<br />\nCalifornia Institute of ed out that the sales campaign for advancement in science availHumanities, 30; Business, 29; and Technology, while Dr.<br />\nPeru and Hong Kong.<br />\nBernard M. for the '58 edition was in full able to Hopkins men in the<br />\nTwenty-four states are repre- Social Sciences, 20, as 'proposed Dwork will join the<br />\nMathematics swing and he was \"out to top future.<br />\nDepartment, leaving Harvard last year's record.\"<br />\nsented in the Freshman Class. majors.<br />\nDr. Andrews also expressed his<br />\nNew York, with 41, and New JerAccording to the second an- University. In Physics, a former<br />\nSeigenfeld will lead a staff hopes for the class of 1961 by<br />\nsey, with 32, boast the largest nual edition of \"The Homewood\", University of Wisconsin profes- consisting of Chris Kahl and wishing that \"they will see realnumber of dormitory men. The sixty-five members of the Class sor, Dr. Gordon Feldman, will Stu Viess as associate<br />\neditors, ity and faith and high purpose<br />\nClass of '61 also lists represen- of '61 were in the honor societies begin residence<br />\nBill Smith as business manager, and high destiny, and if they<br />\ntatives from as far as Washing- at their high schools. A total of<br />\nOne A&amp;S Appointment<br />\nBill Cooper as managing editor grasp that, they will realize more<br />\nLon and as far south as Florida. 159 athletes<br />\nFrom Cambridge University and Andy Ginnis co-ordinating fully that the 'truth of God will<br />\nare among the inBroken down according to coming freshmen.<br />\ncomes Dr. Owen M. Phillips to editor.<br />\nmake you free.'\"<br /><br />\nMarylanders, Engineers<br />\nDominate Freshman Class<br /><br />\nAdministrationAnnounces<br />\nNew FacultyAppointments<br /><br />\nHullabaloo Staff<br />\nLays New Plans<br />\nFor '58 Edition<br /><br />\nNEWS -LETTER<br /><br />\nPAGE TWO<br /><br />\n3111r<br /><br />\nnhutti iqopititts Nritis-/Crttrr<br /><br />\nPublished every Friday during regular sessions of The Johns Hopkins<br />\nUniversity except during examinations and college holiday periods, by undergraduates of the University. The views expressed in the editorial columns<br />\nare not necessarily those of all Board of Control members. Subscription,<br />\n$3.00 per year, $1.50 per term. Address: Box 1230. Telephone: BE 5-5879.<br /><br />\nEditors in-chief<br />\nHerbert F. Kahler<br />\nMalcolm S. Baroway<br />\nBusiness Manager<br />\nRobert S. Goldstein<br /><br />\nOur blithe spirits, once more out of hand, have allowed<br />\nvs to relinquish this editorial column and navel of contemplation to the class of '61. Below are the two editorials<br />\nselected by the editors from the multitude submitted. The<br />\nauthors are: W. Harry Lambright and Thomas Rightmyer.<br /><br />\nA Fresh Viewpoint<br /><br />\nFrustrations Confront '61<br />\nAs College Career Starts<br />\nSpeeches, welcome songs and ; middle nineties. Needless to say,<br />\nliverwurst sandwiches all pre- enthusiasm had probably run<br />\nsent themselves in a panorama higher in the \"castle of the<br />\nof the Hopkins to the incoming army\" at Hopkins.<br />\nfreshmen. The first few - days are<br />\nAs Orientation Week progressconfusing and frustrating, but ed, we became more familiar<br />\none thing becomes apparent at with the campus and met more<br />\nthe very onset: Freshinen are and more of our classmates. Dr.<br />\nnot pushed or shoved around at Eisenhower's address introduced<br />\nus to the more serious aspects<br />\nJohns Hopkins.<br />\nof college and some freshmen<br />\nare<br />\nguided<br />\nAs a freshman you<br />\nexpressed concern afterwards as<br />\nand advised on ,almost every to whether they could meet the<br />\nstage of campus life. You are academic standards here. We<br />\nabsorbed and accepted so rap- were assured, however, that if<br />\nidly that in almost no time you we didn't have enough grey matter to stay we wouldn't be here<br />\nfeel that you are really a part in the first place. Hopkins<br />\nstrikes<br />\nof the University.<br />\nalmost all freshmen and upperThe first day of Orientation_ is classmen that I have talked to<br />\nas a very tough school.<br />\ndevoted to familiarizing the<br />\nBefore the Orientation prothe<br />\nfreshmen with<br />\nphysical layout of the campus and some of gram was half over, the box<br />\nthe machinery of the University. lunches became infamous among<br />\nPerhaps the high point of the freshmen and student leaders<br />\nday was the inspiring collection alike. While there is wide specuof messages from various repre- lation that the box lunches are<br />\nsentatives of the R.O.T.C. pro- being used to replace the freshmen beanie, I doubt that this<br />\ngram.<br />\nis actually the case. This would<br />\nCall To Arms<br />\nnot explain why student leaders<br />\nBy the time my group got eat them. Almost all the nonaround to its \"call to arms\" freshmen are in favor of orienspeech the temperature seemed tation. The opinions on box<br />\nto be hovering somewhere in the lunches run more to the negative<br />\nside.<br /><br />\nOrientation week has established in the minds of<br />\nfreshmen one very startling and unexpected fact: at the<br />\nHopkins he is immediately to be treated as a man, no better<br />\nno less than his fellow classmates; and he is going to be<br />\nexpected to act accordingly.<br />\nThis remarkable upperclassman acceptance of the<br />\nnew student was revealed eloquently when: (1) the Freshman was given the opportunity to use a freedom and<br />\nindependence of judgment heretofore unknown in choosing his first-year courses; (2) he was assigned the massive<br />\nresponsibility of following the Hopkins Honor System;<br />\n(3) he was encouraged before the school term began to<br />\nbecome an integral part of the extra-curricular life of<br />\nthis college.<br />\nWhat better example of the earnestness of the Upperclassmen in helping their new Hopkins men than this newspaper you are now reading. How many other college<br />\nnewspapers set aside an issue solely for its Freshmen<br />\nstaffers? It demonstrates a unique desire on the part oft<br />\nthe Editors to help its first-year men to be a part of the<br />\nNews-Letter team. This one example is typical of the<br />\nefforts of every extra-curricular organization here.<br />\nActions such as the above make for the distinct<br />\nfriendly, cohesive atmosphere, the esprit de corps which is<br />\n108's the name. Royce 108. rve<br />\nso visible at The Hopkins.<br />\naround here for quite a<br />\nbeen<br />\nTo be welcomed and called by first name by outstand- while, 34 years to be exact. Oh,<br />\ning seniors—seemingly insignificant, but so important for you'll get to know me pretty<br />\nthe Freshman prepared for the worst. There are no bizarre well, fellas. Yessiree, all three<br />\ncaps or verbal cracks to distinguish Freshmen from other of us are gonna have a wonderful year together .. . my experistudents at this institution.<br />\nence and all, and your ideas and<br />\nHow can we Freshmen help but accept with a deep hopes—we'll be quite a group.<br />\nsense of obligation Dr. Milton Eisenhower's Orientation My job is to see that your<br />\nstatement concerning the future of Hopkins: \"Look to freshman year is just right, so<br />\nlet's get a little organized. That's<br />\nthe Freshman class.\"<br />\nit, put your book.s on the shelf<br />\nthe<br />\nEisenhower,<br />\nEvery freshman should show Dr.<br />\nand take your clothes . . . oh, by<br />\nfaculty, and particularly the upperclassmen his apprecia- the way, the beds lift up for<br />\ntion for what they have done; he should gladly accept storage. Pretty Neat!<br />\nand fulfill the responsibilities entailed in being a Hopkins You know something? (don't<br />\ntoo much if I reminisce a<br />\nman. He should work to maintain good grades; he should mind Quite<br />\na few fellas like you<br />\nbit).<br />\nparticipate in the university's extra-curricular program, have passed through my hands<br />\nand he should obey and promote the Honor System.<br />\n. .. er . . . my door. Why, it<br />\nOthers have made the first move; it is up to us, the seems like yesterday that a fella<br />\nnamed Woodrow Wilson was in<br />\nW.H.L.<br />\nFreshmen, to make the second.<br /><br />\nFreshmen Find<br />\nNew Advisor;<br />\nSage Of Royce<br /><br />\nThe Long And Short Of It<br />\nAsk any•freshman or upperclassman what he thinks<br />\nof Orientation Week. If he has thought about the question,<br />\nand most Hopkins men have, he will either want to lengthen<br />\nthe week or shorten it.<br />\nHe who wants to lengthen the program will usually<br />\nsay he feels rushed, doesn't have enough time to digest<br />\nwhat he learns, to assimilate and discuss it, to enjoy the<br />\nrecreational opportunities offered by The Hopkins, both in<br />\nthe formal and in the informal sense, and so on. If he is<br />\nmore honest, and less given to saying little in a great many<br />\nwords, he will say he wants more time to loaf and more<br />\ntime to hack.<br />\nHe who wants to shorten the Orientation Week to<br />\ntwo or three days usually argues like this:<br />\n\"I came to Hopkins to learn, and I intend to put all<br />\nmy free time on my studies. This 'Activities Optional',<br />\nand the Intramural Athletics time, to say nothing of the<br />\nconstantly reiterated Honor Commission talk about the<br />\nprocedures for dealing with violators, who after all number less than one percent of the University, accomplish<br />\nvery little toward the ultimate objective.\" This was the<br />\nline we heard from our own cross-section of the freshman<br />\nclass, a percentage somewhat larger than Dr. Gallup's 15<br />\nhundred of 150 million.<br />\nThe happy medium lies somewhere between the two<br />\nschools of thought. We did come here to study, but, they<br />\nsay, a well-rounded person gets better grades and greater<br />\nopportunities than a bookworm. It is to introduce the<br />\nFreshman to these other aspects of Hopkins life that<br />\nOrientation is spread over a full week. For the \"assimilating\" and \"recreation\", the loafing and the hacking, the<br />\nLevering Hall people hold the Freshman camp. We like<br />\nT.N.R.<br />\nthe system as it is.<br /><br />\nHOMEWOOD, BALTIMORE, SEPT. 27, 1957<br /><br />\nits seemingly impenetrable isolation and remoteness from the<br />\nCity of Baltimore. Looking out<br />\nof my window into the quadrangle as I write, I feel as though<br />\nI am in the country rather than<br />\nin one of the largest cities on<br />\nthe eastern seaboat:d. This, I<br />\nthink, is one of the decided advantages of Hopkins.<br /><br />\nUndoubtedly the most outstanding feature of the Orientation program for all of us was<br />\nour introduction to the Honor<br />\nSystem. It came as a startling<br />\nsurprise to most of us. The fact<br />\nthat it exists we all knew, but<br />\nthe fact that it works was almost<br />\nunbelievable. Most of us came<br />\nfrom high schools and prep<br />\nschools where cheating was almost a daily occurrence. Now we<br />\nare enrolled in a University<br />\nwhere, we are told, for all practical purposes cheating does not<br />\nexist.<br />\nMost of us feel that this must<br />\nbe a fine system under which<br />\nto live. A few of my classmates<br />\nfeel that turning a friend in for<br />\na breech of the Honor Code is<br />\na lot to ask. For many, this is<br />\ncontrary to a set of values which<br />\nhas been instilled in them for<br />\nyears. The transition from these<br />\nvalues to those of the Honor<br />\nCode may indeed be quite difficult for some, but its continuous<br />\nRemote From City<br />\noperation and success has made<br />\nOne aspect of the Hopkins it a permanent feature of Hopwhich struck me particularly was kins life.<br /><br />\nNeophyte Declares<br />\n'College Is Different'<br /><br />\nclose together at college and real<br />\nGuess they haven't learned<br />\nslow.<br />\nCollege sure is turning out<br />\nthe<br />\ntwo-step<br />\naround here yet.<br />\nI<br />\nwhat<br />\nfrom<br />\ndifferent<br />\nto be<br />\nI left the mixer dance early<br />\nexpected. Kids just weren't like<br />\nthis back in our town. Maybe because everybody else seemed<br />\nI should've gone to that agri- to be going home. But all the<br />\nculture junior college near Col- couples were really walking off<br />\nlege Park after all. I've been together away from the dance<br />\nhere a week, and you should (to talk, I guess). So I went back<br />\nsee all the stuff that goes on to the dormitory and fell asleep.<br />\naround here besides studying al- But my roommate and some of<br />\nhis friends came in around two<br />\nready.<br />\nLike the first day we got here, o'clock and woke me up. They<br />\nwhen we walked into our ad- were talking about what they<br />\ndid during and after the dance.<br />\nvisor's room, the two tough boys<br />\nPlease don't forget to send my<br />\nwho are our student leaders<br />\nyelled, \"all right, you guys, get dictionary.<br />\nhere for a while.<br />\nThe teachers and the Prinyou a—s up to the front of the<br />\nOh, hey guys, don't use nails<br />\nroom here!\" Now is that any cipal (his name is Eisenhower—<br />\n,<br />\nthat<br />\n.<br />\n.<br />\n.<br />\nit<br />\nThat's<br />\non the wall.<br />\nway to talk to young boys like what a coincidence!) are very<br />\ntape that doesn't peel paint will<br />\nnice, though. They keep telling<br />\nme? Talk about scared!<br />\nsuffice.<br />\nus all to come to them whenever<br />\ndormitory<br />\nthe<br />\nin<br />\nroom<br />\nmy<br />\nAnd<br />\nAnyway, I've seen many fellas<br />\nwe need any help and they have<br />\njust like you stay with me, and here really makes me miss my lots of facilities for kids with<br />\nhave<br />\ndon't<br />\nI<br />\nhome.<br />\nback<br />\nroom<br />\nold<br />\nnow, by golly, they're all top<br />\nproblems. Well, I'd better close<br />\nany place to put my model airmen.<br />\nnow 'cause I have to go to my<br />\nBook of KnowlYes, men, I've seen a lot of planes and my<br />\nroommate next session of what they call<br />\nmy<br />\n'cause<br />\nset,<br />\nedge<br />\nHopkins. Take a good look at<br />\nclothes the Psychological Clinic.<br />\nthose walls of mine. Under that has nasty records and<br />\nHe's<br />\nplace.<br />\nthe<br />\nover<br />\nall<br />\nthrown<br />\nMelvin.<br />\ncream-colored paint are the<br />\nwears uncoats of many years 'of study. just terrible and he<br />\nand<br />\nIn fact, those youngster rooms derwear instead of pajamas<br />\nOh,<br />\nawful.<br />\njust<br />\nis<br />\nlanguage<br />\nhis<br />\nover at the new Dorms and at<br />\ndictionary<br />\nGilman Hall haven't got a thing yes, please send my<br />\nlots of<br />\nover me. Even Shriver Hall down to me. There are<br />\nhasn't seen the wonderful things words I'd like to know the meanI've witnessed—the coming of ings of.<br />\nthat intangible feeling as a<br />\nFriday night they had what<br />\nThe Barnstormers' first proyoungster changes into a Hop- they call a mixer dance and it<br />\nkins Man; the gaining of a sense was really awful. I only went duction of the year, \"Stalag 17,\"<br />\nof responsibility that comes with cause I wanted to meet some will be presented by a group of<br />\nthe freedoms freely passed on nice girls my age. I think they forty freshmen at 8:30 p.m..<br />\nfrom class to class; the intellec- were a lot older though. All October 11, in the Barn.<br />\ntual and scholastic achievements that make-up and smoking and<br />\nThe staff will include twentythat only come with years of everything. And they dance real one actors and a backstage force<br />\nsincere study; even the social and<br />\nof almost the same number. Asspiritual growth of all my friends<br />\nsisting the freshmen in the procan't be hidden from this pair<br />\nduction will be Dave Hochberg.<br />\n— Class of 1959<br />\nof probing eyes.<br />\n1959 is planning director; Dave Scribner, techof<br />\nClass<br />\nThe<br />\nWell, men, I'm proud to know<br />\nBanquet for Wednesday night, nical director; and the Bainyou, and I know we're going to a<br />\n9, at 7 p.m. at Levering stormers' Board of Control conOctober<br />\nget along fine. So keep your<br />\nHall. Dr. Milton S. Eisen- sisting of five upperclassmen.<br />\nGreat<br />\nhead high, men, 'cause you're<br />\nhower will be an honored guest;<br />\nDave Hochberg is enthusiastic<br />\nnow part of a great institution.<br />\nG. Wilson Shaffer will be about the<br />\nDr.<br />\neven<br />\nproduction<br />\nJust think of your old friend<br />\nthe guest speaker. A steak din- though hampered by lack of<br />\nRoyce—alias Vincent alias Sylner will be served. Tickets are rehearsal time. He stated that<br />\nvester alias many others. Even<br />\npriced at $2.50, payable on receipt casting for parts in the pkay<br />\nmore important, think of the role<br />\npurchaser. will be held Monday, Septemder<br />\nHopkins or at the leisure of the<br />\nyou're here to play .<br />\n30, at 4:15 p.m. in the barn.<br />\nMan.<br />\n\"Dear Mom and Dad:<br /><br />\nFrosh Stormers<br />\nTo Test Abilities<br />\nUnder Hochberg<br /><br />\n.41r<br /><br />\nHOMEWOOD, BALTIMORE, SEPT. 27, 1957<br /><br />\nNEWS -LETTER<br /><br />\nPAGE THREE<br /><br />\nIFB Falls On Frosh; Dr. Michael Bender Warns<br />\nJHU Greeks Ready Radiation Perils Underrated<br />\nThe<br />\nInterfraternity<br />\nBoard<br />\nsmoker, presiaed over by IFB<br />\npresident Gil Decker, was held<br />\nTuesday night in Levering Great<br />\nHall for the benefit of the freshman class. Its purpose, as outlined by Decker, was to formally<br />\nintroduce the class of 1961 to the<br />\nfraternity system and to encourage fraternity membership.<br /><br />\nhe said, is not the fraternity<br />\nsystem.<br /><br />\nHe advised that no man join<br />\na fraternity simply because he is<br />\n\"a joiner.\" \"You are doing an<br />\ninjustice to yourself and the<br />\ngroup if you join at all.\"<br /><br />\nThe speaker of the evening<br />\nwa.s Dr. Walter Boyer, who expressed his views on fraternity<br />\nlife as a former non-fraternity<br />\nstudent at the Hopkins and as a<br />\nformer professor in the school of<br />\nmechanical engineering.<br /><br />\nA fraternity, he noted, can<br />\nassist in a feeling of security and<br />\nbelonging ...can provide a fine<br />\nsocial life ... can provide a desirable atmosphere in which to<br />\nlive ... can provide a source of<br />\ncontinuing alumni interest.\" But,<br />\nhe added,\"Gentlemen,everything<br />\nI listed as good points, depending<br />\nupon the individual involved, can<br />\nbe readily converted into bad<br />\npoints.\"<br /><br />\nDr. Boyer's oft humorous<br />\nscrutinization of fraternities began with what could be called<br />\na characteristic statement about<br />\nfraternity life from the mouth<br />\nof a characteristic anti-fraternity<br />\nradical that the way to murder<br />\na student whom one despises is<br />\nto pledge him and \"bump him<br />\noff\" during the initiation. This,<br /><br />\nAt the completion of Dr.<br />\nBoyer's address Decker outlined<br />\nthe structures of the fraternity<br />\nsystem and the rushing season.<br />\nAt the close of the smoker members of the fraternities mingled<br />\nwith the freshman in order to<br />\nanswer questions regarding the<br />\nfraternity system at Hopkins.<br /><br />\nImprovements, Changes<br />\nMade By Plant Manager<br /><br />\nA Johns Hopkins University scientist, Michael A. Bender, told the National<br />\nAcademy of Sciences<br />\nthat the \"maximum permissible dose\" of radiation formerly established<br />\nmay be too low. Pictured<br />\nabove is a carefully-posed scene representing the possible outcome of high<br />\nradiation levels.<br />\nThe average \"maximum per- that there is no 'safe' dose of tion we<br />\nreceive,\" warned Dr.<br />\nRenovations and improvements been accorded by the move. He missible dose\" of radiation set radiation.<br />\nBender.<br />\n\"Careful<br />\nconsideration<br />\nof<br />\nin Ames Hall, the freshman pointed out that the Mathemat- for the population in the NationBender's research is being carchemistry lab, the Bradford ics Department acquired consid- al Academy of Sciences report, whether the benefits to be gainried<br />\non under direction of Dr.<br />\nApartments, Levering cafeteria erably better facilities in its new The Biological Effects of Atomic ed are worth the risk to ourH. Bentley Glass, Johns Hopkins<br />\nand on the athletic fields, were location.<br />\nRadiation, may be too high, ac- selves and to our descendants<br />\nundertaken this summer by the<br />\nprofessor of biology. Bender reAside from normal mainten- cording<br />\nto experiments con- should be given to any proposed ceived his Ph.D.<br />\nPlant Manager's Office.<br />\ndegree from<br />\nance work, the installation of<br />\nThe Department of Mathemat- new work tables and a new air ducted at the Johns Hopkins increase in the amount of radia- Johns Hopkins in 1956.<br />\nics has been moved from its for- ventilation system has renovated University subjecting<br />\nhuman<br />\nmer location in Rowland Hall Remsen Hall's freshman chemis- cells to moderate<br />\ndoses of X-rays.<br />\ninto a newly developed area in try lab.<br />\nThe Johns Hopkins tests<br />\nAmes Hall.<br />\nDr. Gerhard H.<br />\nDieke, Chairman of the Physics Bradford Apartments Renovated marked the first time normal<br />\nStudents and faculty living in human cells received<br />\nDepartment, stated that his deknown<br />\npartment is still \"pressed for the Bradford Apartments will<br />\nGeneral Motors, Food Fair, and graduate student body seventydoses<br />\nof<br />\nradiation<br />\nand<br />\nthe<br />\nspace,\" but \"some relief\" ha.s find the renovation program prothe<br />\nSloan Foundation are a few two scholarships<br />\nand forty felgressing rapidly. The program amount of resulting damage of the many institutions<br />\nwhich lowships for students engaged in<br />\nincludes installation of complete measured carefully.<br />\noffer scholarships and fellow- graduate studies<br />\nat the univernew kitchens in all housekeepDr. Michael A. Lender, Hop- ships to students at the Johns<br />\nsity. These figures represent aling apartments. Plant Manager kins biologist, warned, \"if the Hopkins<br />\nUniversity.<br />\nmost a fifty percent increase in<br />\nTaylor and his staff have con- rates of this and other types of<br />\nFor<br />\nthe<br />\n1957-1958 school year the total number of grants which<br />\nverted the elevators from the radiation-induced damage to<br />\nmanually operated type to auto- human tissues are found to be there were offered to the under- the university was able to make<br />\navailable to students last year<br />\nmatic and have installed auto- correspondingly high in further<br />\nand grants are still being rematic temperature controls for experiments, a sharp<br />\nrevision<br />\n(Continued from Page 1)<br />\nceived.<br />\nthe heating system.<br />\nwill have to be made in our esneering; and Dr. George D. MosA new soda fountain is being timates of safe doses of radiaLast year Union Carbide oftow, professor of mathematics. put in Levering Hall<br />\nfered one scholarship through<br />\nCafeteria, tion.\"<br />\nand four outdoor hard surface<br />\nAppointments Named<br />\nthe Johns Hopkins University,<br />\nBreakage Rates<br />\nwhile this year they are offering<br />\nDr. Mostow, who was on leave play areas, including a basketball<br />\nThe report of the National<br />\nfour. The Sloan Foundation,<br />\nof absence last year at the Insti- court, have been constructed<br />\nA Johns Hopkins University which last year offered<br />\nAcademy of Sciences listed 10<br />\nthree,<br />\ntute of Advanced Study at north and south of the Homeroentgens as the maximum scientist, Dr. Arda Alden Green this year will offer seven scholPrinceton University, will con- wood stadium area.<br />\nis<br />\nwinner<br />\nthe<br />\nof<br />\nGarvan<br />\nthe<br />\npermissible average dose of raarships. The number offered by<br />\ntinue on leave this year to teach<br />\ndiation to the reproductive or- Medal, given each year to the General Motors has doubled over<br />\nat the University of Utrecht,<br />\ngans from conception to age 30. woman judged to have made the the same period.<br />\nHolland.<br />\nBender pointed out that data most outstanding contribution in<br />\nGrowth Explained<br />\nDr. John W. Gryder, chemisfrom his experiments \"indicate the field of chemistry in the<br />\nThe reason for this astonishtry; Dr. Jun-ichi Ingusa, mathethat the doses required to double United States.<br />\nmatics; and Dr. Francis E.<br />\nFormal presentation of this ing growth is twofold. Firstly,<br />\nthe spontaneous breakage rate<br />\nRourke and Dr. Robert E. Tuckaward will be made at the annual the remarkable success of last<br />\nis less than 10 roentgens.\"<br />\nyear's scholarship holders<br />\ner, both of the political science,<br />\nOver 250 freshmen took adBender said one reason the spring meeting of The American<br />\nprompted donors to increase<br />\nwere promoted to the rank of vantage of the thirty-fourth<br />\nan- research is being carried on is Chemical Society.<br />\ntheir grants, and secondly, acassociate professors.<br />\nfreshman<br />\nDr.<br />\nGreen, a staff member of<br />\nWeekend to determine more accurately<br />\nnual YMCA<br />\ncording to Mr. Lockner who is<br />\nThose who received promotions to \"get away from it all\" fol- the dangers to future<br />\ngenerations the Hopkins McCollum-Pratt In- the non-alumni development offrom instructor to assistant pro- lowing three and a half days of from the steadily<br />\nstitute,<br />\nwas<br />\nawarded<br />\nthe<br />\nhonor<br />\nincreasing<br />\nficer for Homewood, \"The infessor included Dr. Clinton De- Orientation.<br />\namounts of radiation to which for her work in successfully terest of<br />\ncorporations, foundaSoto, psychology, and Dr. Thomisolating, in crystalline form, the<br />\nThe class of '61 left by bus humans are exposed.<br />\ntions and individuals in providas Lambdin, Oriental Seminary.<br />\nenzyme<br />\nresponsible<br />\nfor<br />\nlumines.<br />\ncamp<br />\nthe<br />\nHe told the annual convenfrom Levering Hall for<br />\ning student aid is increasing and<br />\nnear Bel Air, to the northeast of' tion of the American Institute cence in the firefly.<br />\nthe University's success in atBaltimore. The freshmen were of Biological Sciences at StanLight Energy Probed<br />\ntracting a larger percentage of<br />\nby<br />\nford University that cells from<br />\nkept alive in the afternoon<br />\nThis work has made possible a such resources has grown sevvolleyball, lacrosse, horseshoe normal human kidney tissues better understanding of the enty-five<br />\n(Continued from Patle 1)<br />\npercent since last<br />\nfaculty-student found to contain a normal<br />\ncom- means by which living things year.\" This year the total numUnion League Club of New York Pitching and a<br />\nFrosh.<br />\npliment of 46 chromosomes were transform energy derived from ber of scholarships which have<br />\nsoftball game won by the<br />\nCity.<br />\nused to determine the amounts food into a variety of useful been awarded is seventy-two as<br />\nThe<br />\nevening<br />\nsession<br />\nWas<br />\nless<br />\nwas<br />\nleaving<br />\nBrown,<br />\nhe<br />\nAfter<br />\nand types of damage to human forms, such as, in this case, light compared to forty-one last year.<br />\nthe<br />\nbeing<br />\nactive,<br />\nshow<br />\na<br />\ntalent<br />\nassociated with the R. H. Macy<br />\nentertainment. Neil chromosones caused by known energy.<br />\nAll scholarships at Hopkins<br />\nCo. in New York and then the evening's<br />\nWeigel<br />\nsome feats of amounts and types of radiation.<br />\npresented<br />\nCorporation<br />\nDr. Green has made studies at are unrestricted as to what<br />\nHazeltine<br />\nand HaMaintained for a short time Washington University in St. courses the<br />\nmagic, a group of freshmen,<br />\nstudent must take.<br />\nzeltine Electronics Corporation<br />\n\"The Cliff Dwellers\", played in tissue culture, these cells Louis, Harvard University, the Fellowships,..<br />\nwas<br />\ndirector<br />\nof<br />\nhe<br />\non<br />\nwhere<br />\nthe<br />\nother<br />\nperDixieland jazz, and a rock and were exposed, and later the di- Cleveland Clinic and the Depart- hand, do restrict<br />\na student's<br />\nsonnel. He served as civilian<br />\nmembers<br />\nviding<br />\nroll<br />\ncells<br />\nquartet<br />\nfaculty<br />\nof<br />\nwere<br />\nexamined for ment of Pediatrics of the Sinai Major but Hopkins will accept<br />\nmember of the Navy Manpower<br />\nDr. Chester Wickwire, Professor damage involving the breakage Hospital in Baltimore.<br />\nno scholarship which attempts<br />\nSurvey Board in the Third Naval<br />\nThomas Hubbard, Professor Wil- of the chromosones.<br />\nDistrict beginning in 1945.<br />\nWhile at Washington Univer- to govern the student's choice of<br />\nlis Gore, and Professor David<br />\nsity, Dr. Green played a major a job after graduation. It is this<br />\nNo \"Safe\" Dose<br />\nFor the past two Years Mr. Danskin, sang current songs like<br />\nrole in studies which won the attitude of cooperation and unPitt has been with the General \"Honeycomb,\" \"That'll Be The<br />\nDr. Bender reported, \"The<br />\nNobel Prize of 1947 for the Pro- derstanding on the part of large<br />\nDynamics Corporation where he Day,\" and \"Hound Dog.\" The breakage rate found in<br />\nthese fessors Carl and Gerty Cori. At corporations and foundations,<br />\nhas been responsible for man- Phoenix Choir, an all-women experiments is much higher than<br />\nCleveland she participated in the that education and production<br />\nagement development, training group, was the only non-Hopkins that which has been generally<br />\nisolation of a substance from the are closely integrated, that has<br />\neducation<br />\nand<br />\nprograms, em- talent to perform. The evening assumed to occur ... In fact, the blood known as serotonin,<br />\nwhich attributed- to the large growth<br />\nployees benefit programs and was concluded by the serving of present experiments, taken by<br />\nis now important in studies on in the scholarships and fellowother services for more than hot dogs and cokes served themselves, lend great weight the chemical<br />\nbasis of schizo- ships that the university now<br />\n100,000 Persons.<br />\naround the campfire.<br />\nto the belief of many genetics phrenia.<br />\noffers.<br /><br />\nMore Scholarships Granted<br />\nIn '57;All Are Unrestricted<br /><br />\nNew Personnel,<br />\nTen Promotions<br />\nChange Faculty<br /><br />\nJHU Scientist<br />\nAwarded Prize<br />\nhi. Chemistry<br /><br />\n250 Freshmen<br />\nAttend 'Y'Camp<br />\nDuring Weekend<br /><br />\nGavin A. Pitt<br /><br />\nNEWS-LETTER<br /><br />\nPAGE FOUR<br /><br />\nHOMEWOOD, BALTIMORE, SEPT. 27, 1957<br /><br />\nBlue Jays Face Second Scrimmage<br />\nM-D Title Defense Chances<br />\nIn Hands Of Sophomores<br />\nCoach Wilson Fewster will Tony Salem and Eddie Mesko,<br />\nsophomore-studded also seniors; are the men vying<br />\nhis<br />\nsend<br />\nMason - Dixon Championship for the starting wingback post.<br />\nfootball squad into its second Mesko returned to school this<br />\noutside scrimmage of the fall year, and was a letterman two<br />\ntomorrow, in final preparation years ago.<br />\nfor what he expects to be a sucLittman At Center<br />\ncessful season.<br />\nLarry Littman, junior, at cenCommenting on last week's ter, and junior letterman Frank<br />\nscrimmage with Fort Meade, Frenda and Dick Auffarth at<br />\nFewster, in his first season at guards seem assured posts. Aufthe helm of the varsity grid- farth is at strong (right) guard,<br />\nmen, said, \"We got more out of and Frenda is at weak (left).<br />\nthat than you can imagine. Most Paul Winegrad, an All-Maryland<br />\nof my 40-man squad saw action, at Forest Park, or Frank Phebus,<br />\nand I was very pleased with the a fellow member of the class of<br />\n'60, will get the call at strong<br />\noutcome.\"<br />\nThe entire coaching staff of tackle.<br />\nTwo more sophomores, Mark<br />\nFewster, Ross Sachs, and Leon<br />\nHorowitz is looking forward to Williams and Cloyd Kerchner,<br />\ntomorrow's test as an oppor- are nip and tuck for weak tackle.<br />\ntunity for the young line to Either senior Bob Edwards,<br />\ninvaluable experience for junior Mickey Webster, or sophgain<br />\nto defend the Mason-Dixon<br />\nTwo anxious Jay gridders polish up blocking for their campaign<br />\nversus Franklin &amp; omore Bob Brannan will get the<br />\nopener<br />\nits<br />\nd freshman squad of 1956, will face<br />\nundefeate<br />\nthe<br />\nfrom<br />\nplayers<br />\nby<br />\nned<br />\nstrengthe<br />\nteam,<br />\nThe<br />\n5, at Lan- weak end call.<br />\ntitle.<br />\n5. This will be the Marshall, October<br />\nSenior veteran Gus Widhelm<br />\nFranklin &amp; Marshall in non-conference game at Lancaster, Pa. on October<br />\ncaster, Pennsylvania.<br />\nand rookie sophomore Bob Harcoaching debut of Wilson Fewster.<br />\nStarters Uncertain<br />\nFrom information to date, 35 rington round out the squad,<br />\nmen are now competing for the battling for starting strong end.<br />\nLine Is Light<br />\nstarting eleven posts. At blockThe Hopkins line will average<br />\ning back, senior Co-Captain<br />\nGeorge Schwartz is the logical only between 185 and 187 pounds.<br />\ncandidate. Schwartz, only five The backs will average 170.<br />\nIn summation, Fewster said,<br />\nfeet nine inches, 163 pounds, was<br />\n\"A successful season is quite plicity, and two is because of<br />\na T-formation quarterback at \"We are looking forward to<br />\nGeorge<br />\ncoach<br />\nsoccer<br />\nFreshman<br />\nwill<br />\nvarsity<br />\nthe<br />\ne<br />\nprobable,\" said freshman foot- the experienc<br />\nb u t another successful season. We<br />\nPolytechnic,<br />\nlast year's varsity Baltimore<br />\nball Coach Bob Scott, after look- gain in scrimmaging against the Whitlock,<br />\nat have an excellent chance to have<br />\nwing<br />\nsingle<br />\nthe<br />\nto<br />\nswitched<br />\ncaptain, is \"optimistic\" about his<br />\ning over the fifty Frosh prospects. freshmen—split 'T' against the<br />\nHopkins. He is a two-year let- one, for, while our experience<br />\ncoming<br />\nthe<br />\nfor<br />\nprospects<br />\nteam's<br />\nwing.\"<br />\n\"The fifty men, an average single<br />\nis low, the enthusiasm and genin spite of the fact that terman and is especially adept<br />\nCandidates for quarterback are season,<br />\nturnout for Frosh football, have<br />\neral attitude of the squad has<br />\nplays.<br />\ncalling<br />\nat<br />\nthe team has had only a week<br />\ndisplayed good high school back- Tom Fitzhugh, a marine veteran<br />\nBates, a 185-pound been wonderful. The team needs<br />\nErnie<br />\nof<br />\npractice.<br />\nground. The considerable num- who played fullback in Baltito gain the necExperience — virtually every senior, and 184-pound sophomore only practice<br />\nber of candidates out for line more; Grant Brewen, an end<br />\ne.\"<br />\nexperienc<br />\nessary<br />\nbattle<br />\nthe<br />\nlead<br />\nSimonsen<br />\nRod<br />\nsquad member has seen some<br />\npositions has given depth to the from Pennsylvania; and Pete<br />\nscored<br />\nSimonsen<br />\nfullback.<br />\nfor<br />\nnd<br />\n\"an<br />\naction—a<br />\nsoccer<br />\nprevious<br />\nline. However, the backfield, Sandroy, an All-Prep school end<br />\nunusual capacity for hard work\" 41 points as a two-purpose freshthough not lacking in quality, is from Washington, D. C.<br />\nthe chief assets of the twen- man last year. He tallied five<br />\nare<br />\nnumber.\"<br />\nsomewhat limited in<br />\nJerry Erdman, Jim Rogers, Ed ty-three man freshman squad, touchdowns and<br />\nsuccessfully<br />\ncontinued Scott.<br />\nMcCaffrey, and Dick Schuck, all said Whitlock.<br />\nbooted 11 of 15 points after<br />\nare<br />\ns<br />\ncandidate<br />\nline<br />\nthe<br />\nLeading<br />\nfrom Baltimore, and Skippy Leet<br />\ntouchdowns.<br />\nFive Game Schedule<br />\nTom Biddison, an All-Maryland from Annapolis are the leading<br />\nHarding Heads Tailbacks<br />\nBaltibe<br />\nwill<br />\nThe<br />\nbooters<br />\nyearling<br />\nBill<br />\nhigh school tackle from<br />\nhalfback.<br />\ns<br />\nfor<br />\ncandidate<br />\nAt tailback, a four-man freeend<br />\nan<br />\nto<br />\ntrying<br />\n2-2<br />\nthe<br />\nrecord<br />\nimprove<br />\nByrne,<br />\nMike<br />\nand<br />\nmore,<br />\nKarpovich and Jim Greenwood,<br />\nJohns Hopkins' varsity cross<br />\nfor-all is afoot. Leading the<br />\nfrom Annapolis. Both succeeded both from Baltimore, are out for that was compiled by the 1956<br />\nteam opens its 1957<br />\ncountry<br />\nCliff<br />\nletterman<br />\nsenior<br />\nis<br />\nparade<br />\nAll-Ameri<br />\nfreshman team. This year the<br />\nin making the same<br />\nfullback.<br />\nFranklin &amp; Maragainst<br />\nseason<br />\nSophopounder.<br />\n170<br />\na<br />\nHarding,<br />\nJays will have a five game schedcan high school football team.<br />\nOz Garcia, five feet ten shall College Saturday, October<br />\nmore<br />\nule,<br />\nwith<br />\nPark<br />\nopening<br />\nSchool<br />\ns<br />\nCandidate<br />\nTackle<br />\nOctober 18 and closing November inches, 150 pounds, was utilized 12, at Homewood.<br />\nJim Kelley, a 215 pounder from<br />\n\"We should have a good team<br />\nas a left-handed quarterback<br />\n8<br />\nFreeagainst the Towson J. V.<br />\nAlan<br />\nand<br />\nnia,<br />\nPennsylva<br />\nis this year because of the experand<br />\nyear,<br />\nlast<br />\nfrosh<br />\nthe<br />\nfor<br />\nOhio,<br />\ne<br />\n\"The<br />\nmost<br />\nperimpressiv<br />\nfrom<br />\nland, a 185 pounder<br />\nience of some of the squad memformers in practice have been also in the picture.<br />\nare among the top candidates<br />\nthe outstanding fresh- bers,\" was Coach George Brown's<br />\nVoted<br />\nAll<br />\nJoe<br />\nd<br />\nZeuch,<br />\nhalf-Marylan<br />\nposition.<br />\ntackle<br />\nfor the<br />\nback at Baltimore Poly in 1956, man athlete last year, Garcia comment. These members are<br />\nBucking for guard positions<br />\nDon Schuerholtz, an outstand- threw seven touchdown passes Captain Charlie Ginsberg, Irvin<br />\nare Larry Cessna, All-City team<br />\nThe first of three outdoor ing prospect, Carter Puryear and and scored two himself. He was Miller, and last year's \"number<br />\nsecKing,<br />\nDick<br />\n,<br />\nBaltimore<br />\nfrom<br />\nbasketball courts, located on<br />\nat Fieldston in New one man,\" Morris Jones. All<br />\nond team All-Maryland from the north. side of Homewood Joe Weitzel,\" remarked Whitlock. All-Prep<br />\nthree are juniors.<br />\nAlthough decrying his newness York.<br />\nBaltimore, John Migliore and<br />\nField, was completed on Thurs- with team personnel at this early<br />\nJohn Brewer, Jim Cross, and<br />\nBill<br />\nand<br />\nsenior,<br />\nRailey,<br />\nGuy<br />\nBaltifrom<br />\nalso<br />\nMike Hopkins,<br />\nday of freshman orientation date, Coach Whitlock declared, Morrill, junior, are the other Jim McAllister are sophomore<br />\nmore.<br />\nweek, announced Johns Hopkins<br />\nRailey is a 190- members of the squad. Brown<br />\nNorm Steeketee, a 195 pounder Athletic Director Marshall Turn- \"The squad is working as hard candidates.<br />\nMorrill is a hard indicated that vacancies in the<br />\nand<br />\nas<br />\nany<br />\nI've<br />\never<br />\npounder,<br />\nI<br />\nand<br />\ncan<br />\nBowseen,<br />\nTom<br />\nand<br />\nut,<br />\nfrom Connectic<br />\nfour backboards say that I am hopeful of our passer who specializes in long squad still exist and more canother<br />\nThe<br />\ner.<br />\nfor<br />\nvying<br />\nyer from Baltimore are<br />\nwill be erected when the material team's chances for a successful heaves.<br />\ndidates for berths on the squP1<br />\ncenter.<br />\narrives.<br />\n;<br />\nmay be forthcoming.<br />\nletterman<br />\nin<br />\nsenior<br />\nseason<br />\n1957.\"<br />\nLou<br />\nKady,<br />\nGood<br />\nProspects<br />\nBack<br />\nHopkins alumnus Doctor H. A.<br />\n\"Although the prospects for<br />\nB. Dunning personally secured<br />\nbacks are good,\" Coach Scott<br />\nfrom eight other alumni<br />\n$8500<br />\nexlack<br />\n\"they<br />\nsay,<br />\nwent on to<br />\nfor the construction<br />\nhimself<br />\nand<br />\nto<br />\ngoing<br />\nis<br />\nperience. The squad<br />\nfor of three paved basketball courts,<br />\nformation<br />\n'T'<br />\nsplit<br />\nthe<br />\nuse<br />\na paved area for general use<br />\ntwo reasons.<br />\na lacrosse wall. Sizable conand<br />\nsun\"One is because of its<br />\ntributions were received from the<br />\nMcCormick &amp; Co. Fund and<br />\nMead Johnson &amp; Co. Foundation.<br />\nIn the past six years, the Blue<br />\n\"Strong on the line, but weak plete team should include about<br />\nAccording to Turner, the on defense,\" is coach Mickey J 36 men.<br />\nJay soccermen have produced<br />\nfour All-Americans. In 1953,<br />\ncourts are expected to accom- Cochrane's description of the<br />\nmodate over 500 students per 1957 Johns Hopkins varsity socCochrane's first year as coach,<br />\nthe Black and Blue had one of<br />\nweek in all but the worst weath- cer team.<br />\nits most successful seasons, taker.<br />\npohis<br />\nresumed<br />\nhas<br />\nCochrane<br />\ning the top spot in the Middle<br />\nHopkins freshmen cross counsition at the helm of the bootAtlantic Conference.<br />\ntry team started practice this<br />\nthree<br />\nyears<br />\nspending<br />\nafter<br />\nmen,<br />\nweek in preparation for its five<br />\nB.I.A.<br />\nBernstein, Duffany, Co-Capt's.<br />\nArmy.<br />\nthe<br />\nin<br />\nmeet schedule which opens on<br />\na part of<br />\nbe<br />\nshould<br />\n\"Sports<br />\nThe pitchmen, led by co-capKenwood<br />\nFour defensive positions are<br />\nOctober 17th against<br />\nevery student's life,\" said Stu open. One of the biggest probtains Ed Bernstein and Bruce<br />\nHigh School.<br />\nViess, president of the Board lems, according to Cochrane, is<br />\nDuffany, will play a ten game<br />\nCoach George Brown stated<br />\nIntramural Athletics.<br />\nof<br />\nschedule, including seven Conthe<br />\ngap at fullback, caused by<br />\nthe<br />\nthat he was \"pleased with<br />\nIn November, the Board the graduation of Jim Spitznas,<br />\nference foes. Hopkins is a memfirst workout.\" He urged all<br />\nwill choose three freshmen to \"the spark plug of last year's<br />\nber of the thirty team Middle<br />\ncross<br />\nin<br />\ninterested<br />\nfreshmen<br />\nAtlantic Conference. However,<br />\nserve on the B.I.A. for four squad.\"<br />\ncountry to try out for the squad<br />\nyears. More details will follow<br />\nall of the schools do not field<br />\nand said that \"experience is not in future issues.<br />\nMaterial Scarce, Good<br />\nsoccer teams.<br />\nnecessary.\"<br />\nAs for the outlook this year,<br />\nInformation concerning the<br />\nBesides the contest with perTen freshmen have signed up activities of the B.I.A. can be Cochrane commented that he<br />\nennially<br />\npowerful Maryland, the<br />\nhas<br />\none<br />\nonly<br />\nbut<br />\nteam,<br />\nfor the<br />\nfound in the B.I.A. Calendar hasn't seen all the material but<br />\nhighlight of the season is the<br />\nprevious experience.<br />\nseen.<br />\nhas<br />\nhe<br />\nand the bulletin boards in Is pleased with what<br />\nbattle with traditional rival WestAccording to Brown, the averthe gymnasium opposite the<br />\nTwelve veterans have been<br />\nMaryland on November 23.<br />\nern<br />\nof<br />\nconsists<br />\nteam<br />\nage freshman<br />\nPost Office in Gilman Hall, practicing since September 16,<br />\nIn between games include Haver25 men, ten of whom are en- and in the Dormitory Post with the rest of the squad slated<br />\nford, Franklin &amp; Marshal/ and<br />\ntered in a two mile event. Of Office.<br />\nto begin workouts this week on a<br />\nSwarthmore.<br />\nthese ten, only the first five<br />\nNE<br />\nCOCHRA<br />\nMICKEY<br />\ncorntwice-a-day schedule. The<br />\nfinishers count in the scoring.<br /><br />\nFrosh Football Promising; Pitchmen Coach<br />\nMentions Spirit;<br />\nfied<br />\nt<br />\nSatis<br />\nScot<br />\nBob<br />\nh<br />\nCoac<br />\nExperience Aids<br /><br />\nJHU Varsity<br />\nCross Country<br />\nOpens Oct. 12<br /><br />\nOutdoor Courts,<br />\nLacrosse Wall<br />\nAre Completed<br /><br />\nFrosh Harriers<br />\nStart Workouts,<br />\nPlease Brown<br /><br />\n'Booters Boast Strong Line;<br />\nWeak Defense' Cochrane<br /><br />"}], "field_media_file": [{"target_id": 39743, "display": null, "description": null, "target_type": "file", "target_uuid": "6aab9231-ce5f-4a4e-a84f-bc0b89e14baf", "url": "http://digital.library.jhu.edu/system/files/2022-03/13687-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13687, "target_type": "node", "target_uuid": "ba431d69-28c5-4e80-88ef-04aade0ca38d", "url": "/node/13687"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "bea40517-e32b-416c-b351-11cf1209e61b"}]}