{"mid": [{"value": 35714}], "uuid": [{"value": "43e8a01f-5381-468d-b068-e69ea695b921"}], "vid": [{"value": 35714}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:11:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12248-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:11:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:11:50+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "Vol. VII, No. 16<br />\n<br />\nCOMMENCEMENT NUMBER.<br />\n<br />\nTHE<br />\n<br />\nNI w s L I T<br />\n<br />\nR<br />\n<br />\nPUBLISHED BY STUDENTS<br />\nOF<br />\n<br />\nTHE<br />\n<br />\nJOHNS HOPKINS UNIVERSITY<br />\n<br />\n\fThe Johns Hopkins Universitu<br />\n<br />\nThe Johns Hopkins Pres.<br />\n<br />\nBALTIMORE, MARYLAND.<br />\n1.<br />\n<br />\nTWENTY-SEVEN-RI YEAR.<br />\nBeginning October 1, 1902.<br />\nPresident: IRA 14:MI4EN. Dean of the Medical Faculty:<br />\nWILLIAM H. How ni,L. Dean of the College Facull11:<br />\nEnw mu, 11. iluirrin.<br />\n<br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b)- In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physichnis.)<br />\n<br />\nFOR UNDERGRADUATES:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries.<br />\nUniversity,<br />\n105,0(Xi volumes.<br />\nPeais Ci y Institute, 145,000 volumes.<br />\nPniit Library,<br />\n200,000 volumes.<br />\n<br />\nLaboratories.<br />\nchemist ry.<br />\nPhysics.<br />\nGeeiogy and Mineralogy.<br />\nZoology<br />\nA lemony.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiologiiiii I Chemistry.<br />\ncliniiial Miiiiicine.<br />\n<br />\nSeminaries.<br />\nGreek.<br />\nLair n.<br />\nSansk rii.<br />\nSemite..<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory,<br />\nMathematics.<br />\nPhysies..<br />\n<br />\nDirectors.<br />\nlienssen.<br />\n.loseph<br />\nAmes.<br />\n11. Clark.<br />\nI rillions K. 111'ooks.<br />\nMoss1,1 its I'.<br />\n11 /Mow 11. !Iowa'.<br />\nWillissin 11. Welch.<br />\njolos .1.<br />\n.1011/1 .1. .11., I.<br />\n<br />\nlimerican 3ournal of Mathematics.<br />\nF. MOR1,14ni, Editor. Quarterly. 4to. 11.04,<br />\nX X V in progress. $5 per volume.<br />\n11. limetican Chemical 3ournaL<br />\nI. RENSENT, Editor Monthly, Sy°. Volumb<br />\nXXIX in progress. $5 per volume.<br />\n111. limerican journal of Philologv.<br />\nB. I,. GILDERSLEEVE, Editor. Quarterly. sy<br />\nVolume XXIII in progress. $3 per volume.<br />\nID. Stuties from the 36iological Xaboratore.<br />\n8v0<br />\nVolume V complete. $5 per N'OlUMe.:<br />\nV.<br />\nSIRbICS in Thistorical mit) ioIitia1 Ocience.<br />\nMonthly. Sve. Series X XI in progress. $3 pe<br />\nvolume.<br />\n11111. 3013118 bophins laniversity Circulars.<br />\n(;ontaining reports of scientific and 'Rorer wo<br />\nin progress in' Baltimore. 4to. Vol. X<br />\nprogress. $1 per year.<br />\n3obna lbophins lbospital<br />\nulIctin. Monthly,<br />\nVolume XIV in progress $1 per year.<br />\nWIllIE 3ohns tophins lbospital lleports. 4to. Volume<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Bssvriolowe an<br />\nComparati<br />\n$emitie pbuotooy, Beitrogii zur ssyriologie, etc:<br />\nvot. IV complete.<br />\nX.<br />\nMemoirs from the IoLoii1cal ILaboratom<br />\nW. K. BROOKS, Editor. Volumc IV complet<br />\n$7.50 per volume.<br />\nXl. Mobern 7Lan4Juage Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to, Volu<br />\nX VIII in progress. $1.50 per volume.<br />\nX11. 3outual of Experimental Mcbichie.<br />\nW. II. WELCH, Editor. Ili-monthly. tivo. Volum<br />\nVI in progress. $5 per volume.<br />\nX1 lilt. Ilmerican 3Ournal of InsitnitV•<br />\nII EN RV M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nX111). Ifleports of Marriant eicologica Surree.<br />\nWILLIAM 11. CLARK, Editor.<br />\n<br />\nDirectors.<br />\n/losit L.(;ilder.s/eeve.<br />\n1.s,lgP.:4mM'.<br />\n.ilstririce<br />\nI'll,,! Ilaapi.<br />\n1/Cu<br />\n1).15Cnl.<br />\nA. Mar8luilt Elliott.<br />\n.lamex<br />\n11riylit.<br />\n.1olto :If. Vincent.<br />\n.1. 11. Ilolionfler.<br />\nPHI t.<br />\n.1(151 ph N. 4ICICSC.<br />\n<br />\nUndergraduate Courses (leading to B. A).<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n(I. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br />\n<br />\nSerial Publications.<br />\nAmerican .Journal of Mathematics (vol XX V)<br />\nAmerican chemical Journal (vol. XXI X).<br />\nAmerican Joernai of Philology (vol. XXIII).<br />\nStudios in Historietil and Political Science (vol. XXI).<br />\nModern Language Notes (vol. XVIII)•<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VID.<br />\nivers1ty Circulars (vol. X X II).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the departmen<br />\nt<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br />\n<br />\nterrestrial Magnetism ant littmospheric Eke<br />\ntricitp. L. A. BAITER, Editor. Quarterly. 8v0<br />\nVolume ArIl in progress. $2.50 per voiume.<br />\nBnnual iflepOrt.<br />\nPresented by the President of the Board of<br />\ntees, reviewing the operations of the Unive<br />\nduring the past academic year.<br />\nX1011.<br />\nllegieter.<br />\n(living the list of officers and students,and statin<br />\nthe regulations, etc., of the University. Pub' tidied at. the close of the academic year.<br />\n<br />\nIV.<br />\n<br />\nIn addition to the serials<br />\nnamed, copies ma<br />\nbe obtained of the works intutioned below:<br />\nThe Collected Physical Papers of Ilenry A. Itowlan<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins ihspIt al. .1. S. 11111<br />\nings, Editor.<br />\npp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. (Tomplete lac-tomile edition. Edited by .1. kendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Sydow MSS. with Antilegemena Epistles. Edited by I. H. Hull. $3.00.<br />\nBibliographia Hopkinsiensis. Part T. Philology. Parts<br />\n11-III. Chemistry, Mineralogy and Geology. Part.<br />\nIV- V-VI. Physios,Astronotny and Mathematic<br />\nS ye. :1() cents per part.<br />\nII full list of publications will he sent on application.<br />\nCommunications in respect to exchanges and remittance*<br />\nmay be sent to Julius flopkins rress, Baltimore, Md.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nJlTNIi;<br />\n<br />\nI90:;.<br />\n<br />\nNo. 16.<br />\n<br />\nTHE FIRST HOPKINS LACROSSE TEAM.<br />\nThe continued success of the Johns Hopkins Lacrosse Team, and the adding of<br />\nanother intercollegiate championship to its already long list must be a matter of<br />\npride to every I Iopkins man. In no other branch of athletics has she ever attained<br />\nsuperiority, hut in lacrosse she must be reckoned the equal of any team in the<br />\ncountry. The writer has been asked to say a few words on the history of the<br />\ngame at Hopkins. 1 had the honor, with three others, to organize the first<br />\nteam 1 Iol)k ins had, the others being Morrison, Roszell and Cone, whose magnificent goal keeping has never been excelled in this country and probably never<br />\nwill be. We ,were freshmen then in \"'87,\" but had had our trying out and coaching<br />\non the best lacrosse team America has ever produced. I refer, of course, to. the<br />\nfamous \"Druids.\" It was slow work getting recruits, the baseball men tried<br />\nin every way to discourage us. No money was given from the treasury, and<br />\nour only aid was the moral support given by Dr. Renouf, to whom lacrosse at<br />\nHopkins will ever owe a great debt of gratitude. C. Riggs, Princeton's \"87,\"<br />\nwas taking a P. G. course with us and he was elected captain as he had captained his Princeton team the previous year.<br />\nAt . last a team was gotten together, and a game arranged with a strong<br />\nlocal team, \"'The Pattersons.\"<br />\nThe line-up was as follows:<br />\nCone.<br />\nGoal<br />\ns<br />\nRiggs.<br />\nC. \\<br />\nPoint<br />\nCover<br />\nGuggenheimer, Roszell.<br />\nDefense<br />\nCoats.<br />\nCenter<br />\nFriedenwald, McPherson, Moale.<br />\nAttack<br />\nMorrison.<br />\nOut home<br />\nLanier.<br />\nIn home<br />\neye, does<br />\nyour<br />\nsrtike<br />\nshould<br />\nthis<br />\nchance<br />\nby<br />\nif<br />\ntimers,\"<br />\n\"old<br />\nA word to you,<br />\nit make you young again to see yourselves lined up for play? Do you remember<br />\nhow we dressed in fear and trembling, how, we suffered from that physiological<br />\ncondition which so often precedes any contest ? Can you see old George Foy as<br />\nhe pats every one on the back encouraging every one? \"Lacrosse at Hopkins<br />\nis at stake to-day, defeat means no more lacrosse.\" The game is on now and<br />\nwork. work, -work is the motto, five. minutes, ten, fifteen, no goal Yet, and then one,<br />\ntwo, three, four Hopkins in (-Mick succession. Oh the courage that came with<br />\nthem, you who play know what it is, no one else can understand. The game<br />\ngoes on, is finished, Hopkins has won, ti to 2. Not only has Hopkins won at<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nlacrosse, hut lacrosse has on at Hopkins; and from that (lay they have plodded<br />\nand worked and bettered the game until we have such a team as represents us today.<br />\nHopkins has turned out some of the best individual players of the country.<br />\nI have only to mention such names as Cone, T. Penniman, Janney, Fitzgerald,<br />\naddren, Tyler, Mitchell, and Abercrombie, with a score more. We can only say<br />\nto those who shall represent our Alma Mater in future years, keep up the high<br />\nstandard set for you. Play fast, play hard, play to win, but over and above all<br />\nthese PLAY FAIR.<br />\nFaithfully yours,<br />\nBKRW1CK BRUCE LANIP:R, A. B., \"'90.\"<br />\n<br />\nATHLETICS IN THE FAR EAST.<br />\n<br />\nONSTANTINOPLE is the meeting of the Orient and the Occident. It is<br />\nreally an Oriental city, which the Occident is seeking to enter. The Orient stands for conservatism and inactivity, while activity and change characteize the Occident. This contrast applies to all spheres of life—physical, mental and spiritual. Amid these conditions one would not look for much enthusiasm and activity in the athletic line ; for people generally move as though one<br />\nday were a thousand years; which is quite a contrast with America, where people<br />\ntry to crowd a thousand years into one day.<br />\nOn the shores of the Bosphorus-6 miles from Constantinople—we have an<br />\nAmerican institution, Robert College ; founded by Americans, manned largely<br />\nby Americans, the object of the founders being to put a little Christian leaven<br />\n(of the American brand) into this part of the world with the hope that it may<br />\nleaven the whole lump. The trustees, recognizing the great value of the physical development in this problem, requested the author to come out and do what<br />\nhe could in this direction. Incidentally he has been teaching a little biology.<br />\nBut first a few words about the college in general. There are about three<br />\nhundred students, about equally divided between the collegiate and preparatory<br />\ndepartments. Twelve nationalities are represented, though the Greeks, Americans, and Bulgarians predominate. All of these are Christians, though unfortunately only nominally so, in a majority of cases. in point of age the students<br />\nare about two years younger than Hopkins undergraduates ; while the course of<br />\nstudy does not differ very materially from that of the University ; the large amount<br />\nof time devoted to language, and the lack of thoroughness being the chief differences.<br />\nPhysically the students are both undersized and poorly developed. Lack<br />\nof exercise, poor and insufficient food and exercise, use of tobacco appear to be<br />\nthe chief factors to account for this condition. Here it is quite common even for<br />\nthe ladies of first rank to smoke, the cigarette being their favorite.<br />\n<br />\nC<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n3<br />\n<br />\nA careful physical examination is made of each student, including a number of measurements and test of strength. These are recorded and filed. A<br />\nduplicate is given to each student, on which are written recommendations, which<br />\nare calculated to counteract existing defects.<br />\nWe have a gymnasium, or more properly speaking, a room in which there is<br />\nsome standard gymnastic apparatus, which the boys used last winter with a good<br />\ndeal of zest. Exercise is at present required of all the preparatory students ; but<br />\nit is optional for the college boys. At the close of the season a very creditable<br />\ngymnastic exhibition was given, the work on the parallel bars and the general class<br />\ndrill being especially good. Wrestling was one of the novel features to the peoPle. An appropriation of $10,000 has been made for the erecting of a gymnasium,<br />\nwhich will be begun this summer.<br />\nAs for athletics, football and field sports are the favorites. There is but little<br />\ninterest in baseball. The association football is the four employed. The boys<br />\n. play it with a good deal of vim, though team work is usually lacking, each one<br />\nwishing to distinguish himself by brilliant plays. The national spirit manifests<br />\nitself. Quite frequently a Greek will take the slightest provocation to twist the<br />\nnose of the Bulgarian, while the American and the Turk sometimes choose a<br />\nmatch game as a place to settle some difference.<br />\nThe boys are now training for field-day. This year we are to have two sets<br />\nof games—handicap and scratch. There is usually a very good audience, both<br />\nin point of quality and size, to witness these contests. Below is appended a list<br />\nof records of the college. This year many of the records will probably be lowered,<br />\nfor already in practice about one--half of them have been smashed.<br />\nThe present records of Robert College are:<br />\n80-Yard dash<br />\n110-Yard run<br />\n880-Yard run<br />\nM ile run<br />\n80-Yard hurdle<br />\n16 lb. Shot-put<br />\nThrowing discus<br />\nHigh jtuni)<br />\nBroad jump<br />\nPole vault<br />\n<br />\n8 3-5<br />\n1 minute, 1 7-10<br />\n2 minutes, 26 2-5<br />\n5 minutes, 31 1-5<br />\n11 1-5<br />\n<br />\nseconds.<br />\nseconds.<br />\nseconds.<br />\nseconds.<br />\nseconds.<br />\n31 feet.<br />\n92 feet, ( inches.<br />\n5 feet, 1 inches.<br />\n19 feet, 10 inches.<br />\n9 feet, 1 inch.<br />\n<br />\nIntercollegiate meets for the present seem to be out of the question ; our<br />\nnearest possible competitor being four days distant.<br />\nMy best wishes for my alma pater (Princeton being my alma mater) in all<br />\nlines especially in the realm of athletics.<br />\nYours sincerely,<br />\nCHAS. W. OTTUW, M. D., '99.<br />\nDirector of the Department of Biology and Physical Culture, Robert College,<br />\nConstantinople.<br />\n<br />\n\fIntercollegiate Lacrosse Champions of the United States.<br />\n<br />\n*Na,LI:41 SM;;IN 71H.1,<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n5<br />\n<br />\nTHE 1903 LACROSSE SEASON.<br />\n<br />\nHE Johns Hojikins Lacrosse Team—LCollegiate Champions of the United<br />\nStates. The above record speaks for itself, and is one of which the<br />\nstudents of the University may justly feel elated. The high standard set by our<br />\nlacrosse teams in former years, has been fully maintained by the team during<br />\nthe past season. The coaches deserve great credit for the manner in which the<br />\nnew men were developed to fill the vacancies occasioned by last year's graduation.<br />\nThe loss was considerable, being confined entirely to old and experienced players.<br />\nIn the reappearance of Fred. Foster, who played in the championship games of<br />\n1899, and 1900, the team was especially fortunate. Of the older members of the<br />\nteam, all showed marked improvement in their play over previous years, while the<br />\nwork of the new men was most creditable and of the highest order.<br />\nOwing to sifting and trying out of the new material, it was hard to draw<br />\nmuch of a line as to the ability of the team until the Hobart game, when it was seen<br />\nthat our boys were playing the kind of game which wins championships<br />\nThe new Intercollegiate Lacrosse Association, consisting of Johns Hopkins.<br />\nSwarthmore, Lehigh and Stevens, was successful in every way. All the members<br />\nof the League worked in harmony and accord.<br />\nThe new league gained a signal success in that none of its teams were defeated by those of the Liniversity League which consists of Harvard, Cornell,<br />\nPennsylvania and Columbia.<br />\nWithout exception, the teams of the Intercollegiate Association were detidedly stronger this season than last, while some of the teams of the University<br />\nLeague also showed better form, notably Pennsylvania. It is to be hoped that this<br />\nincrease in strength will continue, as it will tend to establish the game- on a firmer<br />\nbasis amongst the colleges of this country.<br />\nI Acrosse is an ideal college sport. and the increasing popularity in the sections where it is played, is doing much to stimulate the game in other localities.<br />\nIn the past year, a number of new teams have been started, especially amongst<br />\nthe preparatory schools. This movement is being encouraged by the colloges who<br />\nhope to reap benefit in the future. The lack of men., trained in lacrosse before<br />\nentering college, has been a great drawback to the advancement of the game<br />\nin the Lnited States. The average college lacrosse player has learned the game<br />\nabout the time he is graduated, simply because at least several years are required<br />\nto get the knack of handling his stick and to master the fine points of the game.<br />\nIf this preliminary work is learned in the preparatory school, it may be predicted<br />\nthat the time will come when the American college team will successfully cope in<br />\nlacrosse with the college teams of our Canadian neighbors.<br />\n<br />\ne<br />\n<br />\n6<br />\n<br />\nHP:NRY PHILIP STRAUS,<br />\n<br />\nCaptain 1903 Lacrosse Team.<br />\n<br />\n\f6<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the eniversity Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nJUNE 4.<br />\n<br />\nSubscription $1.50 per year.<br />\n<br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\nAssistant News Editors,<br />\nAthletic Editois,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n. C. A. NEAL, 1004.<br />\nH. V. MORSE, 1005.<br />\nc J. NEWMAN NUMSEN, 1904.<br />\nN. R. STRAUGHN, 1905.<br />\nHARRY BAETJER, 1903.<br />\n. linn41N BUCKLER, 1904.<br />\n<br />\nAddress all articles, communications, etc., to GEORGE A. FOSTER, box 195, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETjER,<br />\nJ. H. U.; or box 398, Medical Department of the Johns Hopkins University.<br />\n<br />\nt<br />\n<br />\n1.IE close of the Twenty-seventh Academic Year of the Johns Hopkins University marks a time to pause and reflect on the work of the past year.<br />\nThis task is a most agreeable one, since all departments of the University have registered a steady growth.. The high position of Johns Hopkins as the<br />\nfirst University in the land has been fully maintained. The University is free<br />\nfrom all financial difficulty, and Homewood, the goal of our ambitions, draws<br />\nnearer every day.<br />\nIn other departments besides scholarship there has been the same encouraging growth. As in former years \"Hopkins Spirit\" has secured victories over<br />\ninstitutions numbering many times the l'niversity's student body. The football season though short was a successful one. The track team has had a year<br />\nof unprecedented success. Not only have many new records been made but the<br />\nmeets held by the University have set a high standard. \"Intercollegiate Champions<br />\nof the United States\" is the proud title held once again by the lacrosse team. The<br />\nmusical teams scored fresh triumpbs. Most important of all, the season was a<br />\nfinancial success. The iI90:3 \"Hullabaloo\" is one of. the best year books ever<br />\nissued, and compares very favorably with the best in the country.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n'7<br />\n<br />\nWhether or not TH1 Nms-Llirriiiz has kept pace with the other student departments, it is not for us to say here. The two boards have been hampered by<br />\nthe fact that not an the editorships were filled, but they have enjoyed the work,<br />\nand feel that they have derived considerable experience that will be valuable in<br />\nyears to come. If an increased subscription list is an indication of commendation, the board knows that its efforts have not been in vain.<br />\n<br />\nHE NEWS-LETTER takes a special pride in the two leading articles in this<br />\nissue. Dr. Berwick Lanier, '90, and Dr. C. W. Ottley, M. D., '99, did<br />\n•much to advance athletics while they were at the University, and., their<br />\ninterest in Hopkins's success has not abated with the passing years. Dr. Lanier Was<br />\na member of the first Varsity lacrosse team, and he has continued to follow the<br />\ngame from year to year, and though various changes in the style of play have<br />\ntaken place since the first Hopkins team, yet Dr. Lanier has kept abreast of these,<br />\nand has always cheerfully given the team whatever aid he could. Dr. ()aim<br />\nfrom the time he entered the Me.dical School until his graduation four years ago,<br />\nwas one of the stars of the track team, and, indeed, one of the best athletes who<br />\never brought success to the \"I hack and Blue.\" The splendid work that he is doing in far away Turkey is a matter of pride to his many friends. That he is just<br />\nas enthusiastic an athlete as ever is proved by his account of how he has got the<br />\nTurk to take an interest in track and field sports.<br />\n<br />\nt<br />\n<br />\nSATURDAY'S GAME WITH TORONTO.<br />\nSaturday afternoon, at Oriole Park, the University lacrosse team will meet<br />\nthe champion Toronto team, in the last and greatest game of the season. The<br />\nCanadians, who hold the intercollegiate championship of the Dominion, are coining to Baltimore prepared for the hardest sort of a contest. The Varsity team<br />\nhas .kept in practice since the game with the Crescents, though the I. Tniversity examinations have been a great strain upon the men. Some of the faults and misplays<br />\nwhich were prominent in the Crescent game will hardly occur again, as the coaches<br />\nhave given special attention to these.. The players realize that their abilities will<br />\nbe tested to the utmost, and are training accordingly. Toronto's team numbers<br />\nonly three of last year's twelve, but nearly all the other players have been associated with sonic well known lacrosse team before they entered the University of<br />\nToronto.<br />\nAccording to present indications the record breaking crowd at last year's game<br />\n\\vill be surpassed on Saturday. Mayor McLane has promised to attend. Gov.<br />\nSmith, and the other State officials will also be present. The senior class will attend in a body.<br />\n<br />\n\fS<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n1903 HULLABALOO BOARD.<br />\n<br />\n\fTHE NEWS LETTER.<br />\nTHE CLASS OF 1903.<br />\nJohn A. Addison, class executive committee, secretary Hullabaloo Club,<br />\nclass historian, manager lacrosse team 'Os, will take graduate work in classics<br />\nnext year.<br />\nLouis J. Adelsdorf, _Hopkins scholar, '02-'03, will adorn the business profession.<br />\nSidney H. Adler will be a familiar figure in the University next year.<br />\nWilliam W. Ammen, president of senate, will go to Boston 'Tech.<br />\nHarry N. Baetjer, business manager '02-'03 NEWS-LETTER, banjo club<br />\n'01-'03, and William F. Bevan will study law at the University of Maryland.<br />\nArthur N. Baldauf, the gentleman from Kentucky, will enter business.<br />\nEdgar L. Bamberger, class executive committee, will enter business in New,<br />\nYork.<br />\nWilliam S. Bird, business manager \"Hullabaloo,\" class president '00-'01,<br />\neditor NEws-IATTER, lacrosse team '017'03, one of the business men of the University will take a course in lacrosse next year at the University.<br />\nFrederick C. Blanck, captain football team, all around champion of the<br />\nUniversity, will take graduate work in chemistry.<br />\nSolomon Blum, editor \"Hullabaloo,\" editor on the NEws-LPTTER„ and spellbinder, will take graduate work in economics preparatory for legal studies.<br />\nJames W. Bryan, twice a Hopkins scholar, the able leader of the Mandolin<br />\nClub, will study at the Hopkins Medical School.<br />\nJames -B. G. Custis, Jr., twice a Hopkins scholar, and a prominent man on the<br />\nlacrosse team, will study medicine in New York.<br />\nAlphonse R. V. Dochez, Mandolin Club, will join the happy band at the<br />\nMedical School.<br />\nTheodore W. Clocker, the man of poetical fame, Hopkins scholar and editor<br />\n\".Hullabaloo,\" is undecided as to his future career.<br />\nJohn A. H.aug-hton will study the construction of sky-scrapers in New York.<br />\nFranklin Hazlehurst, of the \"Hullabaloo\" staff, Hopkins scholar, banjo and<br />\nmandolin clubs, will study medicine..<br />\nMoses W. Hendry, banjo club, and Frederick R. V. Williams, of the track<br />\nteam, the \"grinds\" of the senior class will teach.<br />\nJohn C. Hildt, Hopkins scholar for two years, will take graduate work in.<br />\nR. Curzon Hoffman, Jr., captain, track team, and one of \"Mac's\" proteges,<br />\nwill try the steel industry in Pittsburgh.<br />\nStuart • C. Hopper will go into business in this city.<br />\nWilliam M. Hunley will return to the University next fall.<br />\n<br />\n\f11<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nBLANCK.<br />\n<br />\nBIRD.<br />\n<br />\nCUSTIS.<br />\n<br />\nA DDISON<br />\n<br />\n\fTHE NEWS LETTER.<br />\nRobert S. Lanier, the most prominent literary man of the University, has been<br />\neditor-in-chief of \"Hullabaloo\" and N KWS-LETTIR, and a member of the musical<br />\nclubs. He will take up literary work in New . York.<br />\nCharles A. Marshall will enter business. He has been prominent in athletic<br />\nand musical circles. Under his leadership the banjo club has done excellent work.<br />\nWilliam H. Matthai, manager of the football team, and member of the lacrosse teams, will return to the University.<br />\nBenjamin W. Meeks and Robert J. Nicholson, who have performed ministerial duties in connection with their University work, will continue in the same<br />\nprofession.<br />\nWilliam U. Murkland, Phi :Beta Kappa and a member of the banjo club, will<br />\nreturn to the University to take graduate work in classics.<br />\nJohn M. Nelson, Jr., member of the track team, and of the musical clubs,<br />\nwill enter commercial life.<br />\nRobinson C. Pagon, manager of the musical clubs, and class politician, will<br />\ncarry his old game into business.<br />\nWilliam T. Pessagno, the old stand-by of the track team, and corresponding<br />\nsecretary of the athletic association, will also be a \"medicine man.\"<br />\nHarry W. Plaggemeyer, Junior class president, twice debator with the University of North Carolina, chief rOoter of the University', will study medicine at<br />\nBroadway and Monument street.<br />\nCharles W. Riley, class football team, and Edgar P. Sandrock, class<br />\ntreasurer, will enter Hopkins Medical School.<br />\nCharles A. Robinson, twice Hopkins scholar, is undecided as to his future<br />\noccupation.<br />\nErnest G. Schmeisser, Jr., has exhibited his lacrosse powers for three years.<br />\nHe will join the Hopkins colony at Iloston Tech.<br />\nJoseph T. Smith, Jr., editor \"Hullabaloo,\" Hopkins scholar for two years,<br />\nTreasurer Y. M. C. A., will also study medicine at Hopkins.<br />\nWilton Snowden, Jr., art editor \"Hullabaloo,\" leader Mandolin Club, will<br />\ncontinue his persuasive powers at the University of Maryland.<br />\nPhilip R. Straus, lacrosse team, has helped to manage the \"Hullabaloo.\"<br />\nGeorge D. Strayer, class secretary, and class executive committee, has been<br />\nawarded a scholarship in the Teachers' College of Columbia University.<br />\nCharles I,. Stubenrauch, Hopkins scholar, will enter the Medical School.<br />\nHarry K. Tootle, editor-in-chief NEws-Ixt\"tER, and associate editor-in-chief<br />\nHullabaloo, and the shining light on the track team, will enter the St. Louis Law<br />\nSchool, Washington University.<br />\nLyttleton M. Tough. member of lacrosse team for three years, will captain<br />\nthe team next year.<br />\nGeorge W. Townsend has followed the geological biotogical course: He is<br />\nundecided as to his future work.<br />\n<br />\n\fTHE NEWS LETTFP.<br />\n<br />\nPAUGN<br />\n<br />\nTOOTLE.<br />\n<br />\nPLAGU EM EY ER.<br />\n<br />\nSMITH.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS LETTER.<br />\nHenry E. Treide, treasurer Hullabaloo Club, will return to the University.<br />\nHarry A. Warner will become a railroad man.<br />\n<br />\nLuther M. R. Willis, class executive committee, and assistant manager football team, will return to the University.<br />\nMilton C. Winternitz, class football team, will take graduate work next<br />\nyear at Hopkins.<br />\nAlexander Yearley 111, football team, the University bouncer, is looking for<br />\na soft spot in the law business.<br />\n<br />\nSENIOR CLASS WEEK PROGRAMME.<br />\n<br />\nt HE 1903 class festivities begin this noon when the usual senior procession<br />\nwill take place. A tour of the l'niversity building will be made, with<br />\nthe customary halts, and speeches. Later in the day the class will enjoy<br />\na boating party on the bay. The Programme for the remainder of the week is<br />\nas follows:<br />\nFriday, June 5—A lawn party at Homewood, giveri by the trustees to the<br />\nfriends of the University. Thirty of the seniors will act as assistants to the reception committee. At 9 P. M. Dean Edward H. Griffin will give his annual reception to the graduating class. He will receive this season in the Johns Hopkins<br />\nClub.<br />\nSaturday, June 6—The class will attend the Toronto lacrosse game in a<br />\nbody. That night a reception and dinner will be given to the Canadian players.<br />\nMr. H. K. T()otle of the senior class will preside, and addresses will be made,<br />\namong others, by President Remsen, President Abercrombie of the Athletic Association, Mr. Mackdermott of the physical training department, and Captains<br />\nIflanck, Straus and Hoffman.<br />\nSunday, June 7—Dean Griffin will preach the baccalaureate sermon in Levering Hall at 11 A. M. Hitherto the sermon has been preached in one of the city<br />\nchurches. All University men are invited to attend.<br />\nMonday, June 8—President Remsen will entertain the graduating class and<br />\na few friends at luncheon in the Donovan room of McCoy Hall. The senior<br />\n\"Prom\" will make Monday night the banner night Of the festival week. This will<br />\nbegin at 9 o'clock in the large assembly room of McCoy Hall. A programme<br />\nincluding 21 dances has been arranged for the \"Prom.\" About 300 people are<br />\nexpected to attend, and supper will be served late ;.n Lie<br />\nI evening.<br />\nTuesday, June 9—Commencement exercises at I P. M., and University reception following that night.<br />\nThe class committee which has arranged this programme is made up of<br />\nMessrs. R. C. Hoffman (chairman), W. H. Matthai, W. M. Hunly, W. S. Bird,<br />\nH. N. Baetjer, H. W..Plaggemeyer and L. M. Tough.<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n•••;.<br />\n'71<br />\n0<br />\n0<br />\n<br />\n15<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\nrac<br />\n<br />\nT.. IIII<br />\n<br />\n1<br />\n<br />\n903<br />\n<br />\nIf;<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n17<br />\n<br />\nl'.‘1\"I'AIN I. tIrliZON<br />\n<br />\nTHE TRACK SEASON.<br />\n<br />\nHE outlook for the track and field was, as usual, very poor when college<br />\nopened last autumn, for we certainly had sustained severe losses. Weedon,<br />\none of our cracks, both in the jumps and in the sprints, had graduated, and<br />\nthe same might be said of Bill Hoffman, one of the best middle distance men in<br />\ncollege, and a member of the Relay Team, and Riggs, another Relay man, had to<br />\ngive up on account of medical work.. These three and some others were the<br />\nprincipal losses, and it only left two men on the Relay, and the team .in general<br />\n<br />\nt<br />\n<br />\nin poor condition.<br />\nkarly in the fall the raw freshman material was gotten out, with hopes that<br />\na few good ones could be found to take the place of those who we lost, and also<br />\nwe sent. a circular letter to many of the incoming medical men. As a result of<br />\nthis letter, such men as Freese, 'Helmholtz and Sladen responded.<br />\nOn the first of J ai wary the regular season began, and for some time it looked<br />\nas if the team would never get in trim, but finally it did, and the undergraduate<br />\nmembers showed up every well in the Inter-Class Meet, which was held in the<br />\n<br />\n\f18<br />\n<br />\nTHE NEWS LETTER.<br />\n<br />\nCage in the last week of January. The Seniors won in a walk-over, but very<br />\nfew points separated the Juniors and the Freshmen. This meet was an innovation at the University, and I hope it will be continued in the years to come.<br />\nNow when this was over, we had two weeks to prepare for the 13. A. C.<br />\nindoor Meet, which was held on February 14th, at 8 P. M. This was a handicap<br />\nmeet, and Hopkins on the majority of points. Helmholtz won the dash and<br />\nbroad jump in fine style, and Lawson took first place in the shot and second in<br />\nthe high jump, first place in the latter event to Scholl. We took a number of<br />\nseconds and thirds, and from a point of view of points scored we certainly got our<br />\nshare.<br />\nThe next meet was Georgetown's annual affair, which took place on March<br />\n7th, and we won the event which we most desired, that is the Relay race with<br />\nVilla Nova, and the team showed up very well, running in the following order:<br />\nStone, Capt. Hoffman, Freese and England. Each one of these men gained considerably on his opponent. Besides the Relay, Freeze took second in the hurdle.<br />\nOn March 28th came the Hopkins Meet at the Armory, and from every point<br />\nof view it was a great success. Duffy, the Georgetown champion, ran an exhibition 35 yard dash, and did it in 4 seconds, breaking the state record. Everything was Hopkins that night and the men deserve much credit as they had<br />\nhandicaps, etc., to overcome. Tootle took both the dashes and the 440 in fine style,<br />\nEngland was third in the mile, Hoffman second in the half-mile, and Freeze first<br />\nin the hurdle. Altogether the team did splendid work.<br />\nThe next question was the Pennsylvania Relay Races. En years previous<br />\nwe had run the Maryland colleges, and had beaten them regularly, so this year<br />\nwhen we had a chance to go higher up in classes, we took it, and we never did a<br />\nbetter thing, for instead of only going up One class, we were put in the Middle<br />\nStates Championship Class. This meant that we should have to run ; so hard<br />\ntraining began and continued right along till the time to go to Philadelphia arrived.<br />\nThis was a hard race, and we ft)nght hard for it, but missed first place by a few<br />\nyards, being beaten by Bucknell in 3.39. The time was faster than the figures<br />\nindicated, as the track was very slow. The team was composed of Freese, Hoffman, England and Tootle, With Stone as substitute.<br />\nNow we arrive at the grand climax of the year, the Dual Meet with Virginia.<br />\nThis meet had been worked up since January, and was considered by all to be the<br />\ngreatest movement in track athletics that the University ever had. This memorable event took place at Electric Park on May 7th. The Virginia team was in<br />\nfine trim and ours the same. Tootle did splendid work in both the 100 and 220,<br />\nwinning in 10 sec. and 22 sec. respectively.<br />\nIn the mile two J. H. U. Freshmen showed to the front. Morse heating<br />\nCampbell by about 6 inches. In the jumps Scholl and Pessagno won points in<br />\nfine form, and Freese took the hurdles and Emig the pole vault. The 110 was<br />\nthe hardest race of the day, and England who was counted on to win was ill, but<br />\ngamely fought on till he fell, after this it was between Shelton, of Virginia, and<br />\nHoffman, J. H. U., the former winning by about 2 feet in iS1.l sec. The half mile<br />\nand shot went to Virginia, but Stone did fine work in the latter. The whole meet<br />\n<br />\n\fTHE NEWS LETTER.<br />\n<br />\n19<br />\n<br />\nwas a great success, and Johns Ilopkins won it handily by 55 points to 33. This<br />\npractically ended the season, except for the men who went to the Intercollegiates.<br />\nIn the latter, the men just missed qualifying.<br />\nIn summing up the year on a whole I think it was _a great success, and too<br />\nmuch credit can not be given to the men who have done their best for Johns I lopkins, and I hope that future teams will be as successful and earnest in their<br />\nwork as the team of 1903.<br />\nR. CuRzoN Hovvm AN, JR.,<br />\nCapt. Track and Field Team.<br />\n<br />\nA SALLY FROM OUR ALLEY.<br />\n<br />\n(With apologies to the late Lord Tennyson.)<br />\nBroke, broke, broke!<br />\ni\\ly last nickel gone, by gee!<br />\nAnd I would that my lips dared utter<br />\nThe words that occur to me.<br />\nAh well for our worthy Dean<br />\nThat he frowns on this gambling- play ;<br />\nAh well for the moral young man<br />\nWho belongs to the Y. M. C. A.<br />\nBut this losing game goes on<br />\nEvery morning down by the \"gym ;'<br />\nAnd 0 for a turn in my beastly luck<br />\nOr a hoo-doo to help me win.<br />\nBroke, broke, broke!<br />\nEvery pocket is empty, by gee!<br />\nFor the nickel pitched wild, and the nickel turned tail<br />\nCan never come back to me.<br />\nW. B. C.<br />\n<br />\nSTRANGF:12 (after being ruthlessly butchered by rural barber for five minute)<br />\n—Are you interested in poetry?<br />\nBARBER (astonished)—No, Sir.<br />\nSTRANCA:R—Indeed. I thought that you might be trying to give an imitation<br />\nof the \"Man with the Hoe.\"—Tiger.<br />\n<br />\n\f\fOPEN ALL NIGHT.<br />\n<br />\nWILLIAXSON 0 WATTS,<br />\n,Pruo Ztorca„„<br />\nHoward and Franklin Streets.<br />\n<br />\n'Baltimore and Eutaw Streets.<br />\n<br />\nifancp Ooo0o. Verfitincrr,<br />\nICorucw,<br />\nUoliet Brticle6, elcutro, f5o0a 11111ater.<br />\n_<br />\n.._.___<br />\n<br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br />\n<br />\nI. '1'1)(me 3350-Y.410<br />\n<br />\nHENRY N. BRUNS,<br />\n<br />\nSurgical Instruments,•Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br />\n<br />\nH. S. WRIGHT e, CO.,<br />\n704 MADISON AVE.<br />\n<br />\nDrawing Materials.<br />\nMathematical and Surveyinu Instrument s,<br />\nDraughtsmen's and Enuineers' Supplies__ ...<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br />\n<br />\nBALTIMORE:, MD.<br />\n<br />\nAi/flit for Kenji] c$'' Esse.). Co., of New York.<br />\n<br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br />\n<br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks, Note Rooks,<br />\nStudents' Supplies.<br />\nMadison<br />\n<br />\n& Howard Sts.<br />\n<br />\nIncorporated 1878.<br />\n<br />\nSteoh4 as the Steongest.\"<br />\n<br />\nTRE FIDELITY MUTLAL LIFE INSUIVINGE 60,<br />\n<br />\nOF Pliel L/VDE ILPH1FV.<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nI or Agency In Maryland or West '1'1140;11a,<br />\n<br />\nAddress,<br />\n<br />\nc. tiltA11,131, Manage]<br />\na06-8 Merchants Bank ItIdg., Baltimore, Md.<br />\n<br />\nFor Advertising Spack.t in this Paper<br />\nAPP1.1\"r0<br />\n<br />\n(<br />\neaM<br />\nI<br />\nLIGHT & LOMSAR<br />\n<br />\n&eio-4y<br />\n8111..<br />\n<br />\ntelvi<br />\n<br />\nPUBLISHERS.<br />\n<br />\n:(7/4'.?.'/57'<br />\n<br />\n777 iv/<br />\n•<br />\nq:,HAI:rin'St1 M;)<br />\n<br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br />\n700 Park Ave<br />\nNew York<br />\n<br />\nF<br />\n<br />\nY<br />\n<br />\nEquippiql<br />\n<br />\nlor<br />\n<br />\nsvliohu ly and Practical<br />\nNvork, in the midst of the<br />\nChristian enterprises of a<br />\nget-at city. in (lose academic<br />\nrelations with Columbia and<br />\nNew York Universities, offers opportunities for flu,<br />\ndegrees of M. D., A. M. and<br />\nPh. 1).<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nHallett.<br />\n<br />\nSIXTY-EIGHTH YEfIlt<br />\nbegins September 23, 1903.<br />\nA ddrews the President of<br />\nI he N'Hculty, the<br />\nRev. Charles C. Hall, D. D.<br />\n<br />\n\fSTIEFF PIANOS<br />\nMADE Or THE 31EIMI` li1A.TER1AILY MONET<br />\nRITY.<br />\nA ND P:XPER I r: NOE CA N<br />\nN. LI IIE,leTY ST.<br />\n<br />\n/4111.11111...41 it<br />\n<br />\nrs and<br />\nGUSHING &GOMNINY'Btaotkir<br />\nonc s.<br />\n<br />\nCoplIol$300,000. Surplus oli011udividetl NILS $400 000<br />\nDrovers & Mechanics Nat'l Bank,<br />\nor BALTIMORE.<br />\n1.. Strouse, rice-Prest.<br />\nEdw. 1'. Hayden. Ass't, Cashier.<br />\n<br />\nJas. Clark, Prest<br />\nChas. B. Miller, Cashler.<br />\n<br />\nfl General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p. r year and upward.<br />\n<br />\nRecounts Solicited.<br />\n<br />\n34 W. BfiLTIMORE STREET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\nsT,<br />\n'It<br />\nCollege of Baltimore.<br />\nSTATIONBRY --For School, Pamlig, Office and Bank.<br />\n<br />\nHaberdashers,<br />\nShirts, Neck• wear,Underwear<br />\n•Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br />\n<br />\nTHOS.BLAKE CO<br />\n<br />\nOn Bale The .1. II. U. Pennants, and all other College<br />\nPennants.<br />\n<br />\n219 EAST BALTIMORE Si.<br />\nA H. FETTING,<br />\nMANUFACTURCK<br />\n<br />\nCERTIFICATE OF ANALYSIS FROM<br />\n<br />\nPROFS. G. W. LEHMAN<br />\nFOR<br />\n<br />\nSON,<br />\n0A<br />\n<br />\nGO. A7117.114.11;),47 AVE.<br />\nSTRBIDER<br />\nJORDAN<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Hrandy—no adulterants, no coloring, tine quality.<br />\nOporto l'ort—absolutely pure, of superiar quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar— natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORF. AT ROLAND PARK.<br />\n<br />\nIlgenfritz Studio<br />\nS I I eeeS,or to CUM!'1 I IS.<br />\n<br />\nor<br />\n<br />\nOren letter graternitv jewelrp,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, Mn.<br />\ntictore purcbasitw.<br />\nPlease Call an Examine our<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC. a. D. telephone<br />\n<br />\nJENNINGS &<br />\n<br />\n&<br />\n<br />\ni I ORSEY,<br />\n<br />\nMERCHANT TAILORS,<br />\n<br />\n, 065<br />\n0<br />\n4u6<br />\n21 NV. 1PAYETTE STREET.<br />\n<br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br />\n<br />\nPIPPEN'S 13001i STORE,<br />\n605 IN. E TiieW -ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br />\n<br />\n443 T.<br />\n<br />\nLibraries arranged and put in<br />\norder without removal. Of f/V.<br />\n<br />\n-ivlor<br />\nv<br />\n,<br />\n<br />\nRUZICKA<br />\nBoo/binder,<br />\n<br />\nJ. H. U. Binder.<br />\n<br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br />\n<br />\nTHEO. WARNER.<br />\n<br />\nWARNER &<br />\n<br />\nCo.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgetits for Lincoln & Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\na. TT<br />\nManufacturers of<br />\nSilk and Cassimere Hats.,f/<br />\n<br />\nopKin ts. Caps<br />\n<br />\nNORTH GERMAN LLOYD S. S. 60.<br />\nCABIN PASSAGE AT LOW RATES.<br />\n<br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBfILTIMORE TO BRMER DIRECT.<br />\n<br />\nSGHUMIIGHER Sc GO., General<br />\n<br />\nPor particulars apply to<br />\n<br />\nISAAC H. DIXON.<br />\n<br />\nTHE<br />\n<br />\n..10415.<br />\n<br />\nAgents,<br />\n<br />\nMEIKLE, Vicc-PAcur<br />\n<br />\nJAS. R. RICHARDS. TREAS.<br />\n<br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br />\n<br />\n300 N. Hyrvard St.,<br />\n<br />\nPREIST.<br />\n<br />\nBaltimore, Md.<br />\n<br />\nSmith, Dixon Co.<br />\n..11)aper<br />\n29 - 31 S. Charles Street.<br />\n<br />\n\f", "format": "basic_html", "processed": "Vol. VII, No. 16<br /><br />\nCOMMENCEMENT NUMBER.<br /><br />\nTHE<br /><br />\nNI w s L I T<br /><br />\nR<br /><br />\nPUBLISHED BY STUDENTS<br />\nOF<br /><br />\nTHE<br /><br />\nJOHNS HOPKINS UNIVERSITY<br /><br />\nThe Johns Hopkins Universitu<br /><br />\nThe Johns Hopkins Pres.<br /><br />\nBALTIMORE, MARYLAND.<br />\n1.<br /><br />\nTWENTY-SEVEN-RI YEAR.<br />\nBeginning October 1, 1902.<br />\nPresident: IRA 14:MI4EN. Dean of the Medical Faculty:<br />\nWILLIAM H. How ni,L. Dean of the College Facull11:<br />\nEnw mu, 11. iluirrin.<br /><br />\nInstruction.<br />\nFOR GRADUATE STUDENTS:<br />\n(a) In Philosophy and the Arts. (Courses for candidates for the degree of Ph. D.)<br />\n(b)- In Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physichnis.)<br /><br />\nFOR UNDERGRADUATES:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries.<br />\nUniversity,<br />\n105,0(Xi volumes.<br />\nPeais Ci y Institute, 145,000 volumes.<br />\nPniit Library,<br />\n200,000 volumes.<br /><br />\nLaboratories.<br />\nchemist ry.<br />\nPhysics.<br />\nGeeiogy and Mineralogy.<br />\nZoology<br />\nA lemony.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiologiiiii I Chemistry.<br />\ncliniiial Miiiiicine.<br /><br />\nSeminaries.<br />\nGreek.<br />\nLair n.<br />\nSansk rii.<br />\nSemite..<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory,<br />\nMathematics.<br />\nPhysies..<br /><br />\nDirectors.<br />\nlienssen.<br />\n.loseph<br />\nAmes.<br />\n11. Clark.<br />\nI rillions K. 111'ooks.<br />\nMoss1,1 its I'.<br />\n11 /Mow 11. !Iowa'.<br />\nWillissin 11. Welch.<br />\njolos .1.<br />\n.1011/1 .1. .11., I.<br /><br />\nlimerican 3ournal of Mathematics.<br />\nF. MOR1,14ni, Editor. Quarterly. 4to. 11.04,<br />\nX X V in progress. $5 per volume.<br />\n11. limetican Chemical 3ournaL<br />\nI. RENSENT, Editor Monthly, Sy°. Volumb<br />\nXXIX in progress. $5 per volume.<br />\n111. limerican journal of Philologv.<br />\nB. I,. GILDERSLEEVE, Editor. Quarterly. sy<br />\nVolume XXIII in progress. $3 per volume.<br />\nID. Stuties from the 36iological Xaboratore.<br />\n8v0<br />\nVolume V complete. $5 per N'OlUMe.:<br />\nV.<br />\nSIRbICS in Thistorical mit) ioIitia1 Ocience.<br />\nMonthly. Sve. Series X XI in progress. $3 pe<br />\nvolume.<br />\n11111. 3013118 bophins laniversity Circulars.<br />\n(;ontaining reports of scientific and 'Rorer wo<br />\nin progress in' Baltimore. 4to. Vol. X<br />\nprogress. $1 per year.<br />\n3obna lbophins lbospital<br />\nulIctin. Monthly,<br />\nVolume XIV in progress $1 per year.<br />\nWIllIE 3ohns tophins lbospital lleports. 4to. Volume<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Bssvriolowe an<br />\nComparati<br />\n$emitie pbuotooy, Beitrogii zur ssyriologie, etc:<br />\nvot. IV complete.<br />\nX.<br />\nMemoirs from the IoLoii1cal ILaboratom<br />\nW. K. BROOKS, Editor. Volumc IV complet<br />\n$7.50 per volume.<br />\nXl. Mobern 7Lan4Juage Votes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4to, Volu<br />\nX VIII in progress. $1.50 per volume.<br />\nX11. 3outual of Experimental Mcbichie.<br />\nW. II. WELCH, Editor. Ili-monthly. tivo. Volum<br />\nVI in progress. $5 per volume.<br />\nX1 lilt. Ilmerican 3Ournal of InsitnitV•<br />\nII EN RV M. HURD, Editor. Quarterly.4to. $5 per<br />\nvolume.<br />\nX111). Ifleports of Marriant eicologica Surree.<br />\nWILLIAM 11. CLARK, Editor.<br /><br />\nDirectors.<br />\n/losit L.(;ilder.s/eeve.<br />\n1.s,lgP.:4mM'.<br />\n.ilstririce<br />\nI'll,,! Ilaapi.<br />\n1/Cu<br />\n1).15Cnl.<br />\nA. Mar8luilt Elliott.<br />\n.lamex<br />\n11riylit.<br />\n.1olto :If. Vincent.<br />\n.1. 11. Ilolionfler.<br />\nPHI t.<br />\n.1(151 ph N. 4ICICSC.<br /><br />\nUndergraduate Courses (leading to B. A).<br />\nI. Classical<br />\n(the \"old college course\").<br />\n2. Mathematical-Physical<br />\n(leading up to engineering).<br />\n3. Chemical-Biological<br />\n(leading up to medicine).<br />\n4. Geological-Biological.<br />\n5. Latin-Mathematical.<br />\n(I. Historical-Political<br />\n(leading up to law).<br />\n7. Modern Languages.<br /><br />\nSerial Publications.<br />\nAmerican .Journal of Mathematics (vol XX V)<br />\nAmerican chemical Journal (vol. XXI X).<br />\nAmerican Joernai of Philology (vol. XXIII).<br />\nStudios in Historietil and Political Science (vol. XXI).<br />\nModern Language Notes (vol. XVIII)•<br />\nMemoirs from the Biological Laboratory (vol. V).<br />\nContributions to A ssyriology (vol. IV).<br />\nTerrestrial Magnetism (vol VID.<br />\nivers1ty Circulars (vol. X X II).<br />\nProgrammes of the courses offered to graduate students in Philosophy and the Arts and in the departmen<br />\nt<br />\nof Medicine, and also of the undergraduate or collegiate<br />\ncourses, will be sent on application to the Registrar.<br /><br />\nterrestrial Magnetism ant littmospheric Eke<br />\ntricitp. L. A. BAITER, Editor. Quarterly. 8v0<br />\nVolume ArIl in progress. $2.50 per voiume.<br />\nBnnual iflepOrt.<br />\nPresented by the President of the Board of<br />\ntees, reviewing the operations of the Unive<br />\nduring the past academic year.<br />\nX1011.<br />\nllegieter.<br />\n(living the list of officers and students,and statin<br />\nthe regulations, etc., of the University. Pub' tidied at. the close of the academic year.<br /><br />\nIV.<br /><br />\nIn addition to the serials<br />\nnamed, copies ma<br />\nbe obtained of the works intutioned below:<br />\nThe Collected Physical Papers of Ilenry A. Itowlan<br />\n$7.50.<br />\nThe Critical Edition of the Hebrew Text of the Old<br />\nTestament. Edited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum.<br />\n10 plates. $20.00.<br />\nDescription of the Johns Hopkins ihspIt al. .1. S. 11111<br />\nings, Editor.<br />\npp. 4to. 56 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. (Tomplete lac-tomile edition. Edited by .1. kendel Harris. 110 pp. 4to. 10<br />\nplates. $5.00.<br />\nReproduction in Phototype of Sydow MSS. with Antilegemena Epistles. Edited by I. H. Hull. $3.00.<br />\nBibliographia Hopkinsiensis. Part T. Philology. Parts<br />\n11-III. Chemistry, Mineralogy and Geology. Part.<br />\nIV- V-VI. Physios,Astronotny and Mathematic<br />\nS ye. :1() cents per part.<br />\nII full list of publications will he sent on application.<br />\nCommunications in respect to exchanges and remittance*<br />\nmay be sent to Julius flopkins rress, Baltimore, Md.<br /><br />\nTHE NEWS-LETTER.<br />\nJlTNIi;<br /><br />\nI90:;.<br /><br />\nNo. 16.<br /><br />\nTHE FIRST HOPKINS LACROSSE TEAM.<br />\nThe continued success of the Johns Hopkins Lacrosse Team, and the adding of<br />\nanother intercollegiate championship to its already long list must be a matter of<br />\npride to every I Iopkins man. In no other branch of athletics has she ever attained<br />\nsuperiority, hut in lacrosse she must be reckoned the equal of any team in the<br />\ncountry. The writer has been asked to say a few words on the history of the<br />\ngame at Hopkins. 1 had the honor, with three others, to organize the first<br />\nteam 1 Iol)k ins had, the others being Morrison, Roszell and Cone, whose magnificent goal keeping has never been excelled in this country and probably never<br />\nwill be. We ,were freshmen then in \"'87,\" but had had our trying out and coaching<br />\non the best lacrosse team America has ever produced. I refer, of course, to. the<br />\nfamous \"Druids.\" It was slow work getting recruits, the baseball men tried<br />\nin every way to discourage us. No money was given from the treasury, and<br />\nour only aid was the moral support given by Dr. Renouf, to whom lacrosse at<br />\nHopkins will ever owe a great debt of gratitude. C. Riggs, Princeton's \"87,\"<br />\nwas taking a P. G. course with us and he was elected captain as he had captained his Princeton team the previous year.<br />\nAt . last a team was gotten together, and a game arranged with a strong<br />\nlocal team, \"'The Pattersons.\"<br />\nThe line-up was as follows:<br />\nCone.<br />\nGoal<br />\ns<br />\nRiggs.<br />\nC. \\<br />\nPoint<br />\nCover<br />\nGuggenheimer, Roszell.<br />\nDefense<br />\nCoats.<br />\nCenter<br />\nFriedenwald, McPherson, Moale.<br />\nAttack<br />\nMorrison.<br />\nOut home<br />\nLanier.<br />\nIn home<br />\neye, does<br />\nyour<br />\nsrtike<br />\nshould<br />\nthis<br />\nchance<br />\nby<br />\nif<br />\ntimers,\"<br />\n\"old<br />\nA word to you,<br />\nit make you young again to see yourselves lined up for play? Do you remember<br />\nhow we dressed in fear and trembling, how, we suffered from that physiological<br />\ncondition which so often precedes any contest ? Can you see old George Foy as<br />\nhe pats every one on the back encouraging every one? \"Lacrosse at Hopkins<br />\nis at stake to-day, defeat means no more lacrosse.\" The game is on now and<br />\nwork. work, -work is the motto, five. minutes, ten, fifteen, no goal Yet, and then one,<br />\ntwo, three, four Hopkins in (-Mick succession. Oh the courage that came with<br />\nthem, you who play know what it is, no one else can understand. The game<br />\ngoes on, is finished, Hopkins has won, ti to 2. Not only has Hopkins won at<br /><br />\n2<br /><br />\nTHE NEWS LETTER.<br /><br />\nlacrosse, hut lacrosse has on at Hopkins; and from that (lay they have plodded<br />\nand worked and bettered the game until we have such a team as represents us today.<br />\nHopkins has turned out some of the best individual players of the country.<br />\nI have only to mention such names as Cone, T. Penniman, Janney, Fitzgerald,<br />\naddren, Tyler, Mitchell, and Abercrombie, with a score more. We can only say<br />\nto those who shall represent our Alma Mater in future years, keep up the high<br />\nstandard set for you. Play fast, play hard, play to win, but over and above all<br />\nthese PLAY FAIR.<br />\nFaithfully yours,<br />\nBKRW1CK BRUCE LANIP:R, A. B., \"'90.\"<br /><br />\nATHLETICS IN THE FAR EAST.<br /><br />\nONSTANTINOPLE is the meeting of the Orient and the Occident. It is<br />\nreally an Oriental city, which the Occident is seeking to enter. The Orient stands for conservatism and inactivity, while activity and change characteize the Occident. This contrast applies to all spheres of life—physical, mental and spiritual. Amid these conditions one would not look for much enthusiasm and activity in the athletic line ; for people generally move as though one<br />\nday were a thousand years; which is quite a contrast with America, where people<br />\ntry to crowd a thousand years into one day.<br />\nOn the shores of the Bosphorus-6 miles from Constantinople—we have an<br />\nAmerican institution, Robert College ; founded by Americans, manned largely<br />\nby Americans, the object of the founders being to put a little Christian leaven<br />\n(of the American brand) into this part of the world with the hope that it may<br />\nleaven the whole lump. The trustees, recognizing the great value of the physical development in this problem, requested the author to come out and do what<br />\nhe could in this direction. Incidentally he has been teaching a little biology.<br />\nBut first a few words about the college in general. There are about three<br />\nhundred students, about equally divided between the collegiate and preparatory<br />\ndepartments. Twelve nationalities are represented, though the Greeks, Americans, and Bulgarians predominate. All of these are Christians, though unfortunately only nominally so, in a majority of cases. in point of age the students<br />\nare about two years younger than Hopkins undergraduates ; while the course of<br />\nstudy does not differ very materially from that of the University ; the large amount<br />\nof time devoted to language, and the lack of thoroughness being the chief differences.<br />\nPhysically the students are both undersized and poorly developed. Lack<br />\nof exercise, poor and insufficient food and exercise, use of tobacco appear to be<br />\nthe chief factors to account for this condition. Here it is quite common even for<br />\nthe ladies of first rank to smoke, the cigarette being their favorite.<br /><br />\nC<br /><br />\nTHE NEWS LETTER.<br /><br />\n3<br /><br />\nA careful physical examination is made of each student, including a number of measurements and test of strength. These are recorded and filed. A<br />\nduplicate is given to each student, on which are written recommendations, which<br />\nare calculated to counteract existing defects.<br />\nWe have a gymnasium, or more properly speaking, a room in which there is<br />\nsome standard gymnastic apparatus, which the boys used last winter with a good<br />\ndeal of zest. Exercise is at present required of all the preparatory students ; but<br />\nit is optional for the college boys. At the close of the season a very creditable<br />\ngymnastic exhibition was given, the work on the parallel bars and the general class<br />\ndrill being especially good. Wrestling was one of the novel features to the peoPle. An appropriation of $10,000 has been made for the erecting of a gymnasium,<br />\nwhich will be begun this summer.<br />\nAs for athletics, football and field sports are the favorites. There is but little<br />\ninterest in baseball. The association football is the four employed. The boys<br />\n. play it with a good deal of vim, though team work is usually lacking, each one<br />\nwishing to distinguish himself by brilliant plays. The national spirit manifests<br />\nitself. Quite frequently a Greek will take the slightest provocation to twist the<br />\nnose of the Bulgarian, while the American and the Turk sometimes choose a<br />\nmatch game as a place to settle some difference.<br />\nThe boys are now training for field-day. This year we are to have two sets<br />\nof games—handicap and scratch. There is usually a very good audience, both<br />\nin point of quality and size, to witness these contests. Below is appended a list<br />\nof records of the college. This year many of the records will probably be lowered,<br />\nfor already in practice about one--half of them have been smashed.<br />\nThe present records of Robert College are:<br />\n80-Yard dash<br />\n110-Yard run<br />\n880-Yard run<br />\nM ile run<br />\n80-Yard hurdle<br />\n16 lb. Shot-put<br />\nThrowing discus<br />\nHigh jtuni)<br />\nBroad jump<br />\nPole vault<br /><br />\n8 3-5<br />\n1 minute, 1 7-10<br />\n2 minutes, 26 2-5<br />\n5 minutes, 31 1-5<br />\n11 1-5<br /><br />\nseconds.<br />\nseconds.<br />\nseconds.<br />\nseconds.<br />\nseconds.<br />\n31 feet.<br />\n92 feet, ( inches.<br />\n5 feet, 1 inches.<br />\n19 feet, 10 inches.<br />\n9 feet, 1 inch.<br /><br />\nIntercollegiate meets for the present seem to be out of the question ; our<br />\nnearest possible competitor being four days distant.<br />\nMy best wishes for my alma pater (Princeton being my alma mater) in all<br />\nlines especially in the realm of athletics.<br />\nYours sincerely,<br />\nCHAS. W. OTTUW, M. D., '99.<br />\nDirector of the Department of Biology and Physical Culture, Robert College,<br />\nConstantinople.<br /><br />\nIntercollegiate Lacrosse Champions of the United States.<br /><br />\n*Na,LI:41 SM;;IN 71H.1,<br /><br />\nTHE NEWS LETTER.<br /><br />\n5<br /><br />\nTHE 1903 LACROSSE SEASON.<br /><br />\nHE Johns Hojikins Lacrosse Team—LCollegiate Champions of the United<br />\nStates. The above record speaks for itself, and is one of which the<br />\nstudents of the University may justly feel elated. The high standard set by our<br />\nlacrosse teams in former years, has been fully maintained by the team during<br />\nthe past season. The coaches deserve great credit for the manner in which the<br />\nnew men were developed to fill the vacancies occasioned by last year's graduation.<br />\nThe loss was considerable, being confined entirely to old and experienced players.<br />\nIn the reappearance of Fred. Foster, who played in the championship games of<br />\n1899, and 1900, the team was especially fortunate. Of the older members of the<br />\nteam, all showed marked improvement in their play over previous years, while the<br />\nwork of the new men was most creditable and of the highest order.<br />\nOwing to sifting and trying out of the new material, it was hard to draw<br />\nmuch of a line as to the ability of the team until the Hobart game, when it was seen<br />\nthat our boys were playing the kind of game which wins championships<br />\nThe new Intercollegiate Lacrosse Association, consisting of Johns Hopkins.<br />\nSwarthmore, Lehigh and Stevens, was successful in every way. All the members<br />\nof the League worked in harmony and accord.<br />\nThe new league gained a signal success in that none of its teams were defeated by those of the Liniversity League which consists of Harvard, Cornell,<br />\nPennsylvania and Columbia.<br />\nWithout exception, the teams of the Intercollegiate Association were detidedly stronger this season than last, while some of the teams of the University<br />\nLeague also showed better form, notably Pennsylvania. It is to be hoped that this<br />\nincrease in strength will continue, as it will tend to establish the game- on a firmer<br />\nbasis amongst the colleges of this country.<br />\nI Acrosse is an ideal college sport. and the increasing popularity in the sections where it is played, is doing much to stimulate the game in other localities.<br />\nIn the past year, a number of new teams have been started, especially amongst<br />\nthe preparatory schools. This movement is being encouraged by the colloges who<br />\nhope to reap benefit in the future. The lack of men., trained in lacrosse before<br />\nentering college, has been a great drawback to the advancement of the game<br />\nin the Lnited States. The average college lacrosse player has learned the game<br />\nabout the time he is graduated, simply because at least several years are required<br />\nto get the knack of handling his stick and to master the fine points of the game.<br />\nIf this preliminary work is learned in the preparatory school, it may be predicted<br />\nthat the time will come when the American college team will successfully cope in<br />\nlacrosse with the college teams of our Canadian neighbors.<br /><br />\ne<br /><br />\n6<br /><br />\nHP:NRY PHILIP STRAUS,<br /><br />\nCaptain 1903 Lacrosse Team.<br /><br />\n6<br /><br />\nTHE NEWS LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the eniversity Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nJUNE 4.<br /><br />\nSubscription $1.50 per year.<br /><br />\nEditor in Chief, .<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n.<br />\nAssistant News Editors,<br />\nAthletic Editois,<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\n10 Cents a single copy.<br /><br />\nGEORGE A. FOSTER, 1904.<br />\nREGINALD S. OPIE, 1904.<br />\n. C. A. NEAL, 1004.<br />\nH. V. MORSE, 1005.<br />\nc J. NEWMAN NUMSEN, 1904.<br />\nN. R. STRAUGHN, 1905.<br />\nHARRY BAETJER, 1903.<br />\n. linn41N BUCKLER, 1904.<br /><br />\nAddress all articles, communications, etc., to GEORGE A. FOSTER, box 195, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to HARRY BAETjER,<br />\nJ. H. U.; or box 398, Medical Department of the Johns Hopkins University.<br /><br />\nt<br /><br />\n1.IE close of the Twenty-seventh Academic Year of the Johns Hopkins University marks a time to pause and reflect on the work of the past year.<br />\nThis task is a most agreeable one, since all departments of the University have registered a steady growth.. The high position of Johns Hopkins as the<br />\nfirst University in the land has been fully maintained. The University is free<br />\nfrom all financial difficulty, and Homewood, the goal of our ambitions, draws<br />\nnearer every day.<br />\nIn other departments besides scholarship there has been the same encouraging growth. As in former years \"Hopkins Spirit\" has secured victories over<br />\ninstitutions numbering many times the l'niversity's student body. The football season though short was a successful one. The track team has had a year<br />\nof unprecedented success. Not only have many new records been made but the<br />\nmeets held by the University have set a high standard. \"Intercollegiate Champions<br />\nof the United States\" is the proud title held once again by the lacrosse team. The<br />\nmusical teams scored fresh triumpbs. Most important of all, the season was a<br />\nfinancial success. The iI90:3 \"Hullabaloo\" is one of. the best year books ever<br />\nissued, and compares very favorably with the best in the country.<br /><br />\nTHE NEWS LETTER.<br /><br />\n'7<br /><br />\nWhether or not TH1 Nms-Llirriiiz has kept pace with the other student departments, it is not for us to say here. The two boards have been hampered by<br />\nthe fact that not an the editorships were filled, but they have enjoyed the work,<br />\nand feel that they have derived considerable experience that will be valuable in<br />\nyears to come. If an increased subscription list is an indication of commendation, the board knows that its efforts have not been in vain.<br /><br />\nHE NEWS-LETTER takes a special pride in the two leading articles in this<br />\nissue. Dr. Berwick Lanier, '90, and Dr. C. W. Ottley, M. D., '99, did<br />\n•much to advance athletics while they were at the University, and., their<br />\ninterest in Hopkins's success has not abated with the passing years. Dr. Lanier Was<br />\na member of the first Varsity lacrosse team, and he has continued to follow the<br />\ngame from year to year, and though various changes in the style of play have<br />\ntaken place since the first Hopkins team, yet Dr. Lanier has kept abreast of these,<br />\nand has always cheerfully given the team whatever aid he could. Dr. ()aim<br />\nfrom the time he entered the Me.dical School until his graduation four years ago,<br />\nwas one of the stars of the track team, and, indeed, one of the best athletes who<br />\never brought success to the \"I hack and Blue.\" The splendid work that he is doing in far away Turkey is a matter of pride to his many friends. That he is just<br />\nas enthusiastic an athlete as ever is proved by his account of how he has got the<br />\nTurk to take an interest in track and field sports.<br /><br />\nt<br /><br />\nSATURDAY'S GAME WITH TORONTO.<br />\nSaturday afternoon, at Oriole Park, the University lacrosse team will meet<br />\nthe champion Toronto team, in the last and greatest game of the season. The<br />\nCanadians, who hold the intercollegiate championship of the Dominion, are coining to Baltimore prepared for the hardest sort of a contest. The Varsity team<br />\nhas .kept in practice since the game with the Crescents, though the I. Tniversity examinations have been a great strain upon the men. Some of the faults and misplays<br />\nwhich were prominent in the Crescent game will hardly occur again, as the coaches<br />\nhave given special attention to these.. The players realize that their abilities will<br />\nbe tested to the utmost, and are training accordingly. Toronto's team numbers<br />\nonly three of last year's twelve, but nearly all the other players have been associated with sonic well known lacrosse team before they entered the University of<br />\nToronto.<br />\nAccording to present indications the record breaking crowd at last year's game<br />\n\\vill be surpassed on Saturday. Mayor McLane has promised to attend. Gov.<br />\nSmith, and the other State officials will also be present. The senior class will attend in a body.<br /><br />\nS<br /><br />\nTHE NEWS LETTER.<br /><br />\nTHE NEWS LETTER.<br /><br />\n1903 HULLABALOO BOARD.<br /><br />\nTHE NEWS LETTER.<br />\nTHE CLASS OF 1903.<br />\nJohn A. Addison, class executive committee, secretary Hullabaloo Club,<br />\nclass historian, manager lacrosse team 'Os, will take graduate work in classics<br />\nnext year.<br />\nLouis J. Adelsdorf, _Hopkins scholar, '02-'03, will adorn the business profession.<br />\nSidney H. Adler will be a familiar figure in the University next year.<br />\nWilliam W. Ammen, president of senate, will go to Boston 'Tech.<br />\nHarry N. Baetjer, business manager '02-'03 NEWS-LETTER, banjo club<br />\n'01-'03, and William F. Bevan will study law at the University of Maryland.<br />\nArthur N. Baldauf, the gentleman from Kentucky, will enter business.<br />\nEdgar L. Bamberger, class executive committee, will enter business in New,<br />\nYork.<br />\nWilliam S. Bird, business manager \"Hullabaloo,\" class president '00-'01,<br />\neditor NEws-IATTER, lacrosse team '017'03, one of the business men of the University will take a course in lacrosse next year at the University.<br />\nFrederick C. Blanck, captain football team, all around champion of the<br />\nUniversity, will take graduate work in chemistry.<br />\nSolomon Blum, editor \"Hullabaloo,\" editor on the NEws-LPTTER„ and spellbinder, will take graduate work in economics preparatory for legal studies.<br />\nJames W. Bryan, twice a Hopkins scholar, the able leader of the Mandolin<br />\nClub, will study at the Hopkins Medical School.<br />\nJames -B. G. Custis, Jr., twice a Hopkins scholar, and a prominent man on the<br />\nlacrosse team, will study medicine in New York.<br />\nAlphonse R. V. Dochez, Mandolin Club, will join the happy band at the<br />\nMedical School.<br />\nTheodore W. Clocker, the man of poetical fame, Hopkins scholar and editor<br />\n\".Hullabaloo,\" is undecided as to his future career.<br />\nJohn A. H.aug-hton will study the construction of sky-scrapers in New York.<br />\nFranklin Hazlehurst, of the \"Hullabaloo\" staff, Hopkins scholar, banjo and<br />\nmandolin clubs, will study medicine..<br />\nMoses W. Hendry, banjo club, and Frederick R. V. Williams, of the track<br />\nteam, the \"grinds\" of the senior class will teach.<br />\nJohn C. Hildt, Hopkins scholar for two years, will take graduate work in.<br />\nR. Curzon Hoffman, Jr., captain, track team, and one of \"Mac's\" proteges,<br />\nwill try the steel industry in Pittsburgh.<br />\nStuart • C. Hopper will go into business in this city.<br />\nWilliam M. Hunley will return to the University next fall.<br /><br />\n11<br /><br />\nTHE NEWS LETTER.<br /><br />\nBLANCK.<br /><br />\nBIRD.<br /><br />\nCUSTIS.<br /><br />\nA DDISON<br /><br />\nTHE NEWS LETTER.<br />\nRobert S. Lanier, the most prominent literary man of the University, has been<br />\neditor-in-chief of \"Hullabaloo\" and N KWS-LETTIR, and a member of the musical<br />\nclubs. He will take up literary work in New . York.<br />\nCharles A. Marshall will enter business. He has been prominent in athletic<br />\nand musical circles. Under his leadership the banjo club has done excellent work.<br />\nWilliam H. Matthai, manager of the football team, and member of the lacrosse teams, will return to the University.<br />\nBenjamin W. Meeks and Robert J. Nicholson, who have performed ministerial duties in connection with their University work, will continue in the same<br />\nprofession.<br />\nWilliam U. Murkland, Phi :Beta Kappa and a member of the banjo club, will<br />\nreturn to the University to take graduate work in classics.<br />\nJohn M. Nelson, Jr., member of the track team, and of the musical clubs,<br />\nwill enter commercial life.<br />\nRobinson C. Pagon, manager of the musical clubs, and class politician, will<br />\ncarry his old game into business.<br />\nWilliam T. Pessagno, the old stand-by of the track team, and corresponding<br />\nsecretary of the athletic association, will also be a \"medicine man.\"<br />\nHarry W. Plaggemeyer, Junior class president, twice debator with the University of North Carolina, chief rOoter of the University', will study medicine at<br />\nBroadway and Monument street.<br />\nCharles W. Riley, class football team, and Edgar P. Sandrock, class<br />\ntreasurer, will enter Hopkins Medical School.<br />\nCharles A. Robinson, twice Hopkins scholar, is undecided as to his future<br />\noccupation.<br />\nErnest G. Schmeisser, Jr., has exhibited his lacrosse powers for three years.<br />\nHe will join the Hopkins colony at Iloston Tech.<br />\nJoseph T. Smith, Jr., editor \"Hullabaloo,\" Hopkins scholar for two years,<br />\nTreasurer Y. M. C. A., will also study medicine at Hopkins.<br />\nWilton Snowden, Jr., art editor \"Hullabaloo,\" leader Mandolin Club, will<br />\ncontinue his persuasive powers at the University of Maryland.<br />\nPhilip R. Straus, lacrosse team, has helped to manage the \"Hullabaloo.\"<br />\nGeorge D. Strayer, class secretary, and class executive committee, has been<br />\nawarded a scholarship in the Teachers' College of Columbia University.<br />\nCharles I,. Stubenrauch, Hopkins scholar, will enter the Medical School.<br />\nHarry K. Tootle, editor-in-chief NEws-Ixt\"tER, and associate editor-in-chief<br />\nHullabaloo, and the shining light on the track team, will enter the St. Louis Law<br />\nSchool, Washington University.<br />\nLyttleton M. Tough. member of lacrosse team for three years, will captain<br />\nthe team next year.<br />\nGeorge W. Townsend has followed the geological biotogical course: He is<br />\nundecided as to his future work.<br /><br />\nTHE NEWS LETTFP.<br /><br />\nPAUGN<br /><br />\nTOOTLE.<br /><br />\nPLAGU EM EY ER.<br /><br />\nSMITH.<br /><br />\n14<br /><br />\nTHE NEWS LETTER.<br />\nHenry E. Treide, treasurer Hullabaloo Club, will return to the University.<br />\nHarry A. Warner will become a railroad man.<br /><br />\nLuther M. R. Willis, class executive committee, and assistant manager football team, will return to the University.<br />\nMilton C. Winternitz, class football team, will take graduate work next<br />\nyear at Hopkins.<br />\nAlexander Yearley 111, football team, the University bouncer, is looking for<br />\na soft spot in the law business.<br /><br />\nSENIOR CLASS WEEK PROGRAMME.<br /><br />\nt HE 1903 class festivities begin this noon when the usual senior procession<br />\nwill take place. A tour of the l'niversity building will be made, with<br />\nthe customary halts, and speeches. Later in the day the class will enjoy<br />\na boating party on the bay. The Programme for the remainder of the week is<br />\nas follows:<br />\nFriday, June 5—A lawn party at Homewood, giveri by the trustees to the<br />\nfriends of the University. Thirty of the seniors will act as assistants to the reception committee. At 9 P. M. Dean Edward H. Griffin will give his annual reception to the graduating class. He will receive this season in the Johns Hopkins<br />\nClub.<br />\nSaturday, June 6—The class will attend the Toronto lacrosse game in a<br />\nbody. That night a reception and dinner will be given to the Canadian players.<br />\nMr. H. K. T()otle of the senior class will preside, and addresses will be made,<br />\namong others, by President Remsen, President Abercrombie of the Athletic Association, Mr. Mackdermott of the physical training department, and Captains<br />\nIflanck, Straus and Hoffman.<br />\nSunday, June 7—Dean Griffin will preach the baccalaureate sermon in Levering Hall at 11 A. M. Hitherto the sermon has been preached in one of the city<br />\nchurches. All University men are invited to attend.<br />\nMonday, June 8—President Remsen will entertain the graduating class and<br />\na few friends at luncheon in the Donovan room of McCoy Hall. The senior<br />\n\"Prom\" will make Monday night the banner night Of the festival week. This will<br />\nbegin at 9 o'clock in the large assembly room of McCoy Hall. A programme<br />\nincluding 21 dances has been arranged for the \"Prom.\" About 300 people are<br />\nexpected to attend, and supper will be served late ;.n Lie<br />\nI evening.<br />\nTuesday, June 9—Commencement exercises at I P. M., and University reception following that night.<br />\nThe class committee which has arranged this programme is made up of<br />\nMessrs. R. C. Hoffman (chairman), W. H. Matthai, W. M. Hunly, W. S. Bird,<br />\nH. N. Baetjer, H. W..Plaggemeyer and L. M. Tough.<br /><br />\nTHE NEWS LETTER.<br /><br />\n•••;.<br />\n'71<br />\n0<br />\n0<br /><br />\n15<br /><br />\nTHE NEWS LETTER.<br /><br />\nrac<br /><br />\nT.. IIII<br /><br />\n1<br /><br />\n903<br /><br />\nIf;<br /><br />\nTHE NEWS LETTER.<br /><br />\n17<br /><br />\nl'.‘1\"I'AIN I. tIrliZON<br /><br />\nTHE TRACK SEASON.<br /><br />\nHE outlook for the track and field was, as usual, very poor when college<br />\nopened last autumn, for we certainly had sustained severe losses. Weedon,<br />\none of our cracks, both in the jumps and in the sprints, had graduated, and<br />\nthe same might be said of Bill Hoffman, one of the best middle distance men in<br />\ncollege, and a member of the Relay Team, and Riggs, another Relay man, had to<br />\ngive up on account of medical work.. These three and some others were the<br />\nprincipal losses, and it only left two men on the Relay, and the team .in general<br /><br />\nt<br /><br />\nin poor condition.<br />\nkarly in the fall the raw freshman material was gotten out, with hopes that<br />\na few good ones could be found to take the place of those who we lost, and also<br />\nwe sent. a circular letter to many of the incoming medical men. As a result of<br />\nthis letter, such men as Freese, 'Helmholtz and Sladen responded.<br />\nOn the first of J ai wary the regular season began, and for some time it looked<br />\nas if the team would never get in trim, but finally it did, and the undergraduate<br />\nmembers showed up every well in the Inter-Class Meet, which was held in the<br /><br />\n18<br /><br />\nTHE NEWS LETTER.<br /><br />\nCage in the last week of January. The Seniors won in a walk-over, but very<br />\nfew points separated the Juniors and the Freshmen. This meet was an innovation at the University, and I hope it will be continued in the years to come.<br />\nNow when this was over, we had two weeks to prepare for the 13. A. C.<br />\nindoor Meet, which was held on February 14th, at 8 P. M. This was a handicap<br />\nmeet, and Hopkins on the majority of points. Helmholtz won the dash and<br />\nbroad jump in fine style, and Lawson took first place in the shot and second in<br />\nthe high jump, first place in the latter event to Scholl. We took a number of<br />\nseconds and thirds, and from a point of view of points scored we certainly got our<br />\nshare.<br />\nThe next meet was Georgetown's annual affair, which took place on March<br />\n7th, and we won the event which we most desired, that is the Relay race with<br />\nVilla Nova, and the team showed up very well, running in the following order:<br />\nStone, Capt. Hoffman, Freese and England. Each one of these men gained considerably on his opponent. Besides the Relay, Freeze took second in the hurdle.<br />\nOn March 28th came the Hopkins Meet at the Armory, and from every point<br />\nof view it was a great success. Duffy, the Georgetown champion, ran an exhibition 35 yard dash, and did it in 4 seconds, breaking the state record. Everything was Hopkins that night and the men deserve much credit as they had<br />\nhandicaps, etc., to overcome. Tootle took both the dashes and the 440 in fine style,<br />\nEngland was third in the mile, Hoffman second in the half-mile, and Freeze first<br />\nin the hurdle. Altogether the team did splendid work.<br />\nThe next question was the Pennsylvania Relay Races. En years previous<br />\nwe had run the Maryland colleges, and had beaten them regularly, so this year<br />\nwhen we had a chance to go higher up in classes, we took it, and we never did a<br />\nbetter thing, for instead of only going up One class, we were put in the Middle<br />\nStates Championship Class. This meant that we should have to run ; so hard<br />\ntraining began and continued right along till the time to go to Philadelphia arrived.<br />\nThis was a hard race, and we ft)nght hard for it, but missed first place by a few<br />\nyards, being beaten by Bucknell in 3.39. The time was faster than the figures<br />\nindicated, as the track was very slow. The team was composed of Freese, Hoffman, England and Tootle, With Stone as substitute.<br />\nNow we arrive at the grand climax of the year, the Dual Meet with Virginia.<br />\nThis meet had been worked up since January, and was considered by all to be the<br />\ngreatest movement in track athletics that the University ever had. This memorable event took place at Electric Park on May 7th. The Virginia team was in<br />\nfine trim and ours the same. Tootle did splendid work in both the 100 and 220,<br />\nwinning in 10 sec. and 22 sec. respectively.<br />\nIn the mile two J. H. U. Freshmen showed to the front. Morse heating<br />\nCampbell by about 6 inches. In the jumps Scholl and Pessagno won points in<br />\nfine form, and Freese took the hurdles and Emig the pole vault. The 110 was<br />\nthe hardest race of the day, and England who was counted on to win was ill, but<br />\ngamely fought on till he fell, after this it was between Shelton, of Virginia, and<br />\nHoffman, J. H. U., the former winning by about 2 feet in iS1.l sec. The half mile<br />\nand shot went to Virginia, but Stone did fine work in the latter. The whole meet<br /><br />\nTHE NEWS LETTER.<br /><br />\n19<br /><br />\nwas a great success, and Johns Ilopkins won it handily by 55 points to 33. This<br />\npractically ended the season, except for the men who went to the Intercollegiates.<br />\nIn the latter, the men just missed qualifying.<br />\nIn summing up the year on a whole I think it was _a great success, and too<br />\nmuch credit can not be given to the men who have done their best for Johns I lopkins, and I hope that future teams will be as successful and earnest in their<br />\nwork as the team of 1903.<br />\nR. CuRzoN Hovvm AN, JR.,<br />\nCapt. Track and Field Team.<br /><br />\nA SALLY FROM OUR ALLEY.<br /><br />\n(With apologies to the late Lord Tennyson.)<br />\nBroke, broke, broke!<br />\ni\\ly last nickel gone, by gee!<br />\nAnd I would that my lips dared utter<br />\nThe words that occur to me.<br />\nAh well for our worthy Dean<br />\nThat he frowns on this gambling- play ;<br />\nAh well for the moral young man<br />\nWho belongs to the Y. M. C. A.<br />\nBut this losing game goes on<br />\nEvery morning down by the \"gym ;'<br />\nAnd 0 for a turn in my beastly luck<br />\nOr a hoo-doo to help me win.<br />\nBroke, broke, broke!<br />\nEvery pocket is empty, by gee!<br />\nFor the nickel pitched wild, and the nickel turned tail<br />\nCan never come back to me.<br />\nW. B. C.<br /><br />\nSTRANGF:12 (after being ruthlessly butchered by rural barber for five minute)<br />\n—Are you interested in poetry?<br />\nBARBER (astonished)—No, Sir.<br />\nSTRANCA:R—Indeed. I thought that you might be trying to give an imitation<br />\nof the \"Man with the Hoe.\"—Tiger.<br /><br />\nOPEN ALL NIGHT.<br /><br />\nWILLIAXSON 0 WATTS,<br />\n,Pruo Ztorca„„<br />\nHoward and Franklin Streets.<br /><br />\n'Baltimore and Eutaw Streets.<br /><br />\nifancp Ooo0o. Verfitincrr,<br />\nICorucw,<br />\nUoliet Brticle6, elcutro, f5o0a 11111ater.<br />\n_<br />\n.._.___<br /><br />\nTHE CHEAPEST PLACE<br />\nIN BALTIMORE FOR<br /><br />\nI. '1'1)(me 3350-Y.410<br /><br />\nHENRY N. BRUNS,<br /><br />\nSurgical Instruments,•Dental Supplies,<br />\nRubber Goods, Glass Ware,<br />\nStudents' Sundries.<br /><br />\nH. S. WRIGHT e, CO.,<br />\n704 MADISON AVE.<br /><br />\nDrawing Materials.<br />\nMathematical and Surveyinu Instrument s,<br />\nDraughtsmen's and Enuineers' Supplies__ ...<br />\nN. W. Corner<br />\nLexington and Liberty Sts.<br /><br />\nBALTIMORE:, MD.<br /><br />\nAi/flit for Kenji] c$'' Esse.). Co., of New York.<br /><br />\nYour inspection of our stock of Books,<br />\nStationery and Stationery Novelties for<br />\nthe Holidays. Do not wait till you want<br />\nto buy, but come and look. Special inducements to students. Both 'Phones.<br />\nB. G. EICHELBERGER,<br />\n308 N. Charles Street.<br /><br />\nHenderson's<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nText Hooks, Note Rooks,<br />\nStudents' Supplies.<br />\nMadison<br /><br />\n&amp; Howard Sts.<br /><br />\nIncorporated 1878.<br /><br />\nSteoh4 as the Steongest.\"<br /><br />\nTRE FIDELITY MUTLAL LIFE INSUIVINGE 60,<br /><br />\nOF Pliel L/VDE ILPH1FV.<br />\nAN EXCELLENT OPPORTUNITY is offered Students and Teachers to write Insurance for THE<br />\nFIDELITY, either during vacation or permanently.<br />\nI or Agency In Maryland or West '1'1140;11a,<br /><br />\nAddress,<br /><br />\nc. tiltA11,131, Manage]<br />\na06-8 Merchants Bank ItIdg., Baltimore, Md.<br /><br />\nFor Advertising Spack.t in this Paper<br />\nAPP1.1\"r0<br /><br />\n(<br />\neaM<br />\nI<br />\nLIGHT &amp; LOMSAR<br /><br />\n&amp;eio-4y<br />\n8111..<br /><br />\ntelvi<br /><br />\nPUBLISHERS.<br /><br />\n:(7/4'.?.'/57'<br /><br />\n777 iv/<br />\n•<br />\nq:,HAI:rin'St1 M;)<br /><br />\nUNION<br />\nTHEOLOGICAL<br />\nSEMINARY<br />\n700 Park Ave<br />\nNew York<br /><br />\nF<br /><br />\nY<br /><br />\nEquippiql<br /><br />\nlor<br /><br />\nsvliohu ly and Practical<br />\nNvork, in the midst of the<br />\nChristian enterprises of a<br />\nget-at city. in (lose academic<br />\nrelations with Columbia and<br />\nNew York Universities, offers opportunities for flu,<br />\ndegrees of M. D., A. M. and<br />\nPh. 1).<br />\nOpen on equal terms to<br />\nstudents of all Christian<br />\nHallett.<br /><br />\nSIXTY-EIGHTH YEfIlt<br />\nbegins September 23, 1903.<br />\nA ddrews the President of<br />\nI he N'Hculty, the<br />\nRev. Charles C. Hall, D. D.<br /><br />\nSTIEFF PIANOS<br />\nMADE Or THE 31EIMI` li1A.TER1AILY MONET<br />\nRITY.<br />\nA ND P:XPER I r: NOE CA N<br />\nN. LI IIE,leTY ST.<br /><br />\n/4111.11111...41 it<br /><br />\nrs and<br />\nGUSHING &amp;GOMNINY'Btaotkir<br />\nonc s.<br /><br />\nCoplIol$300,000. Surplus oli011udividetl NILS $400 000<br />\nDrovers &amp; Mechanics Nat'l Bank,<br />\nor BALTIMORE.<br />\n1.. Strouse, rice-Prest.<br />\nEdw. 1'. Hayden. Ass't, Cashier.<br /><br />\nJas. Clark, Prest<br />\nChas. B. Miller, Cashler.<br /><br />\nfl General Banking Business Transacted.<br />\nSafe Deposit Boxes for Rent<br />\nfrom $3 p. r year and upward.<br /><br />\nRecounts Solicited.<br /><br />\n34 W. BfiLTIMORE STREET.<br />\nSchool, Law, Medical, Classical and Miscellaneous Books.<br />\nKeep constantly on hand the Text Books used<br />\nin Johns Hopkins University and the Woman's<br />\nsT,<br />\n'It<br />\nCollege of Baltimore.<br />\nSTATIONBRY --For School, Pamlig, Office and Bank.<br /><br />\nHaberdashers,<br />\nShirts, Neck• wear,Underwear<br />\n•Hosiery, etc.<br />\nSHIRTS TO ORDER A SPECIALTY.<br /><br />\nTHOS.BLAKE CO<br /><br />\nOn Bale The .1. II. U. Pennants, and all other College<br />\nPennants.<br /><br />\n219 EAST BALTIMORE Si.<br />\nA H. FETTING,<br />\nMANUFACTURCK<br /><br />\nCERTIFICATE OF ANALYSIS FROM<br /><br />\nPROFS. G. W. LEHMAN<br />\nFOR<br /><br />\nSON,<br />\n0A<br /><br />\nGO. A7117.114.11;),47 AVE.<br />\nSTRBIDER<br />\nJORDAN<br />\nSamples submitted of<br />\nReads as follows:<br />\nFrench Hrandy—no adulterants, no coloring, tine quality.<br />\nOporto l'ort—absolutely pure, of superiar quality.<br />\nSherry—no coloring or adulterants, absolutely pure wine.<br />\nRye Whiskey—no Fusel oil, no caramel, strictly pure<br />\nand old.<br />\nOlive Oil—all tests show pure olive oil.<br />\nCider Vinegar— natural cider vinegar, strictly pure and<br />\nstrong.<br />\nSix Ground Spices—no adulteration, all strictly pure.<br />\nBRANCH STORF. AT ROLAND PARK.<br /><br />\nIlgenfritz Studio<br />\nS I I eeeS,or to CUM!'1 I IS.<br /><br />\nor<br /><br />\nOren letter graternitv jewelrp,<br />\n14 AND 16 ST. PAUL STREET,<br />\nBALTIMORE, Mn.<br />\ntictore purcbasitw.<br />\nPlease Call an Examine our<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBALTIMORE.<br />\n20 West Lexington St.<br />\nSpecial 'Discount to Students.<br />\nC. a. D. telephone<br /><br />\nJENNINGS &amp;<br /><br />\n&amp;<br /><br />\ni I ORSEY,<br /><br />\nMERCHANT TAILORS,<br /><br />\n, 065<br />\n0<br />\n4u6<br />\n21 NV. 1PAYETTE STREET.<br /><br />\nBOOKS!!!<br />\nSECOND=HAND!!<br />\nSchool, Medical and Miscellaneous,<br />\nBought, Sold and Exchanged.<br /><br />\nPIPPEN'S 13001i STORE,<br />\n605 IN. E TiieW -ST.<br />\nNear the University.<br />\nBaltimore's Largest Old Book Store.<br /><br />\n443 T.<br /><br />\nLibraries arranged and put in<br />\norder without removal. Of f/V.<br /><br />\n-ivlor<br />\nv<br />\n,<br /><br />\nRUZICKA<br />\nBoo/binder,<br /><br />\nJ. H. U. Binder.<br /><br />\n609 N. Eutaw St.<br />\nJAMES R. PAINE<br /><br />\nTHEO. WARNER.<br /><br />\nWARNER &amp;<br /><br />\nCo.<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAgetits for Lincoln &amp; Bennett and<br />\nWalter Barnard's London Hats.<br />\n324 WEST BALTIMORE STREET.<br />\na. TT<br />\nManufacturers of<br />\nSilk and Cassimere Hats.,f/<br /><br />\nopKin ts. Caps<br /><br />\nNORTH GERMAN LLOYD S. S. 60.<br />\nCABIN PASSAGE AT LOW RATES.<br /><br />\nNew York to Bremen, London, Paris, Gibraltar, Naples, Genoa, etc.<br />\nBfILTIMORE TO BRMER DIRECT.<br /><br />\nSGHUMIIGHER Sc GO., General<br /><br />\nPor particulars apply to<br /><br />\nISAAC H. DIXON.<br /><br />\nTHE<br /><br />\n..10415.<br /><br />\nAgents,<br /><br />\nMEIKLE, Vicc-PAcur<br /><br />\nJAS. R. RICHARDS. TREAS.<br /><br />\nChas. Whims Surgical Instrument Co.<br />\nPHYSICIANS', SURGEONS', HOSPITAL<br />\nAND INVALID SUPPLIES, FINE MICROSCOPES AND ACCESSORIES.<br /><br />\n300 N. Hyrvard St.,<br /><br />\nPREIST.<br /><br />\nBaltimore, Md.<br /><br />\nSmith, Dixon Co.<br />\n..11)aper<br />\n29 - 31 S. Charles Street.<br /><br />"}], "field_media_file": [{"target_id": 36273, "display": null, "description": null, "target_type": "file", "target_uuid": "a5cc8528-fc46-49d6-9320-e542bc35677e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12248-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12248, "target_type": "node", "target_uuid": "16501da2-b4c9-4e92-8de8-f88ffd135999", "url": "/node/12248"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "56542ab6-dd00-412d-9c74-3dbf54ca9b33"}]}