{"mid": [{"value": 35670}], "uuid": [{"value": "04ad6975-bd98-4e2a-800d-9a55ac81566a"}], "vid": [{"value": 35670}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:10:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12210-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:10:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:10:58+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "RIL 23 1902:<br />\n<br />\nVol.<br />\n<br />\n(<br />\n<br />\no<br />\n<br />\nSI<br />\n<br />\n\fJOHNS HOPKINS UNIVERSITY.<br />\n<br />\nThe Johns Hopkins Press.<br />\n<br />\nelitlTIMORE, MD.<br />\nAmerican Journal of Mathematics.<br />\nF.510131.81Y. Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $5. per volume.<br />\nII American Chemical Journal.<br />\nI. REMSEN, Editor. Monthly.!Ivo. Volume X XVII<br />\nIn progress. $5. per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GI LOICRS LEEV PI, Editor. Quarterly. ayo.<br />\nVolume XXIII in progress. $3. per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5 per voltiano.<br />\nV.<br />\nstudies in Historical and Political Science.<br />\nMonthly 8vo<br />\nSeries XX in progress. $3. Per<br />\nvolume<br />\nVI. Johna Hopkins University Circulars.<br />\nContainieg reports of aciontillc and literary work<br />\nIn prog-ese 1,<br />\n. Baltimore. 44.0. Vol XXI in progress. $1. per year.<br />\nVII. John Hopkins!<br />\nhewn's! Bulletin. Monthly 410.<br />\nVolume XIII in progress. IL per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Allayriology and Comparative<br />\nSemitic Philology,(fleitraire zur Assyriolokrie, etc.)<br />\nVol.IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. VA°<br />\nper volume.<br />\nXI. Modern Language Notes.<br />\nA. M. ELLTOTT, Editor. Monthly. 4to. Volume<br />\nXVII in progress. $1.541 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. IL wELCII, Pditor.<br />\n8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX III. American J•ourna.1 of Insanity.<br />\nHEN ItY M. HUH D, Editor. Quarterly. 4to.,$5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWI L LI A B II. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Mee'<br />\ntrileity.<br />\nI. A. BAIT Eli, Editor. Quarter'''.<br />\n8,.o. Volume VIIin progress. $1.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Triletees, reviewing the operations of the Universal<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\n(living the list of()Moore and student, and stet-in\"<br />\nthe regulations, etc., of the linivernity. i'14w<br />\nBalled at the close of the academic year.<br />\nI.<br />\n<br />\nTwenty-IIIxth Year.<br />\n<br />\nBeginning October 1st, 1901.<br />\n<br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n.<br />\n<br />\nIRA EMMEN.<br />\nWM. H. HOWELL.<br />\nEDW.IL GRIFFIN.<br />\n<br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. ((ourse4 for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;COU CNA for physicians.)<br />\nFor Undergraduates:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br />\n<br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPealiody Institute<br />\nPratt Library<br />\n<br />\n••••••<br />\n<br />\n•<br />\n<br />\n(Annie&<br />\n1:15,0r41 volumes.<br />\nV.00.000 ohm' s.<br />\nWNW<br />\n<br />\n•<br />\n•••<br />\n<br />\nO<br />\n<br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nClunlogy and Mineralogy.<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology.<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n'Seminaries.<br />\nGreek,<br />\n<br />\nDirectors.<br />\nIra Bemsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clerk.<br />\nWilliam K. Brookl.<br />\nFranklin P. Moll.<br />\nWilliam H. Bowel,.<br />\n.<br />\n11.<br />\nJohn J. Abel.<br />\nJohn .1. Abel.<br />\n}I titian'(1sler.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\n)(Irby F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nlIenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br />\n<br />\nSanskrit,<br />\nTiI MU.<br />\nC unitn,<br />\n!tom/ince,<br />\nEnglish,<br />\nI istory,':<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br />\n<br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br />\n<br />\nit<br />\n4.<br />\n5.<br />\n6.<br />\n<br />\nClassical(the \"Old College Course.\")<br />\nMathematical-Physleal,<br />\nwading Ill to Engineering.)<br />\nChemical-Ile/logical.<br />\n(leading up to Medicine.)<br />\nGeoloelenl-iliological.<br />\nLatin M'i t 0.ritatical.<br />\n11 144)1qt:el-Po1itical.<br />\n(lending up to Law.)<br />\nModern Languages.<br />\n<br />\nSerial Publications.<br />\nEditors,<br />\nMathematics (vol. XXIV.)<br />\nFrank Morley.<br />\nChemistry (vol. X X VII.)<br />\nlra Bentsen.<br />\nPhilology (vol. XXIII.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. XX.)<br />\nJ. M. Vincent<br />\nModern Languages (vol. XVII.) A. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAssvri•dogy (vol. IV.)<br />\nExperimental Medicine (vol. VI.) W. H. Welch.<br />\n<br />\nJr<br />\n<br />\nIn addition to the seri•ila above named, copies niviy<br />\nobtained of the works mentioned below:<br />\nThe Critical Pdition of the Hebrew Text of the Old<br />\nTestament. Ildited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland'a Photograph of the Normal Solar Speel rura.<br />\n10 plates. iV.0.00<br />\nDescription of the Johns Hopkins Hospital. J. S. 111th<br />\nlogs, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simil.•<br />\ntion. Edited by J. lientlel Harris. 110 pp. sin.<br />\nplates. $5.00<br />\nReproduction In Phototype of Syriac MSS. with Antilegotnena Epistles. Edited by I. H. Hall. $3.00.<br />\n13ibliographia Hopkinsionais. Part I. Philology. Parts<br />\n11-111. Chemistry, Mineralogy and Geology. PortA<br />\nIV-V-V1.Physies, Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nE full list of publicatIona will be sent on application.<br />\nCommunications In respect to exchanges and remittanalli<br />\nmay be sent to Johns Booking Press, Baltimore. Ed.<br />\n<br />\nProgrammes of the Courses offered to graduate atudents in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\nVol. VI.<br />\n<br />\nAPRIL 23, 1902.<br />\n<br />\nNo, 14.<br />\n<br />\nTHE LOVE OF A LAD FOR A LASS.<br />\nHERE was the subdued hum of children studying in the small Virginia<br />\nschool-room. From without came the chirping of a robin perched among<br />\nthe blossoms of the peach tree that scraped its branches lazily against the<br />\n.<br />\nwindow of the school-house. By the side of the teacher, a young man, stood a<br />\nSlight, black-haired boy of ten, engrossed in the explanation of a sum on his<br />\nSlate. The heads of both master and scholar were bent over the slate, so that<br />\nneither noticed a boy in the back of the room quietly filling a squirt-gun from<br />\nthe water-bucket. Twice or thrice at some slight noise the teacher glanced up<br />\nangrily, and once he knocked loudly on the desk with a ruler, but still the<br />\nlittle rascal with the gun went undetected; and, judging from the way the<br />\nsmallest noise disturbed the teacher, it was well for the boy that his more repreprehensible act did go unnoticed. Then, while every pupil held his breath,<br />\nPartly in admiration, partly in fear, a thin stream of water shot across the room<br />\nand broke on the teacher's head, splashing over the book-covered desk before<br />\nhim. Completely taken aback by the unexpected bath, the teacher sprang up,<br />\nanger flushing every feature, and made a step toward, to his mind, the one possible culprit, the boy who had been standing by the desk, but who had jumped<br />\nback, as much astonished at the splashing water as the teacher himself had been.<br />\n\"Gordon Chapman,\" he burst out, \"you did that!\"<br />\nSlap! and Gordon was lying in a heap across the platform, his face sheetWhite except where four finger-marks blazed fiercely out.<br />\n\"Stop! You— you— devil! Jordie didn't do it.\" As Gordon went to<br />\nthe floor under his master's hand, a little red-haired girl of about his age, hurling at the teacher the vilest name she could think of, jumped on the platform,<br />\nand with childish rage attempted to dig her finger nails into his face.<br />\n\"Don't, Bab, don't,\" Gordon pleaded weakly from the floor; \"he'll slap<br />\nyou, too. Stop!\"<br />\nSeeing that the disturbance was developing into a rebellion, the teacher<br />\ncalmed himself sufficiently to proclaim the dismission of school. \"Gordon<br />\nChapman will remain, though,\" he said, \"and Miss Barbara's mother shall<br />\nknow of her daughter's behavior before to-night.\" All of the scholars except<br />\nBab. and Gordon gleefully departed; Bab tearfully and unwillingly stumbled<br />\nout the door, calling back words of consolation and encouragement to poor<br />\nJorclie, who sat with pale cheeks but tightly held lips, awaiting whatever was<br />\nto come.<br />\nWhen two University students, alarmed by Bab's confused story, arrived<br />\nat the school-house half an hour later, they found Gordon, with bloody stripes<br />\n<br />\nt<br />\n<br />\n\f2<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nacross the back of his shirt-waist, lying in a faint on the :floor, and by him a<br />\nbroken rattan.<br />\nOne afternoon of the following week, the school-room door was opened,<br />\nand Gordon Chapman, four blue bruises across his face, walked somewhat uncertainly up the aisle, under the wondering gaze of his schoolmates.<br />\n\"Mr. Lindsay,\" he said, as strongly as he could, \"I'm not coming here<br />\nany longer to school, but I'll never forget you; and as soon as I am able I am<br />\ngoing to kill you.\"<br />\nAs he strode down the aisle, now with a manly step, and passed out the<br />\ndoor, no one made a sound except that a little red-haired girl cried softly, \"0<br />\nJordie, Jordiel\"<br />\nEight years had passed since Gordon Chapman had made his promise to<br />\nRoger Lindsay; the great Civil War was just beginning, and many tented<br />\ncities, peopled with Virginia's sons, both young and old, had sprung up as in<br />\na single night. It was about five o'clock of a warm August afternoon; a boy,<br />\nnot quite grown, wearing the uniform of a Confederate private, was riding<br />\nslowly along the wooded road, singing an old love song. Presently he stopped<br />\nsinging and began to calculate.<br />\n\"Let's see, three days' leave, beginning at noon to-day. I'll get to Charlottesville to-night, and that'll give me all day to morrow and half the next day<br />\nthere. Gee! I'm a lucky dog. Al! that time with Bab.\"<br />\nThen he let his horse walk slowly along, while he sat lost in silent thought,<br />\npaying not the least attention to animal or road. Probably he was dreaming<br />\nof Bab, for when he spoke again it was to ask himself slowly, \"I wonder if<br />\nshe's changed much since spring. Yes, I reckon she's grown up entirely now,<br />\nor she wouldn't be writing so much about that Major. Wonder who he is,<br />\nanyhow?\"<br />\nAnother pause, and then in a decided tone, \"Don't think I like him.<br />\nHello! There's somebody ahead. Get up, Bill.\"<br />\nThe man ahead slowed his horse at the sound of a stranger's voice, and<br />\nhalf turned in his saddle to greet him. Evidently he did not recognize the newcomer, however, for instead of speaking to him he sat silently gazing at him;<br />\nbut the young man approached nevertheless with a polite \"Good evening, sir.\"<br />\n\"Good evening,\" answered the other shortly, yet not disagreeably.<br />\nAt the sound of the man's voice, the boy reined his horse back sharply,<br />\nand cried in a tone of surprise, \"Oh! I didn't know it was:you!\" Then, after<br />\na moment's hesitation, he spurred his horse nearer, and said, Mr. Lindsay—\"<br />\n\"Major Lindsay,\" corrected the other somewhat haughtily, in a tone that<br />\nbetrayed no recognition.<br />\n\"Well, Major Lindsay then, I'm Gordon Chapman. Do you remember<br />\nme?\" Then there was a slight tremor in his voice as he continued, \"And do<br />\nyou remember what I told you the last time we saw each other?\"<br />\n\"Yes,\" answered Lindsay in a manner that indicated his reluctance to<br />\nbelieve that what Gordon said was true.<br />\nyou waive your rank and fight, then? I must keep my promise.\"<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n3<br />\n<br />\n\"Yes.\" This time the tone was that of a man assenting to an unpleasant<br />\nproposition.<br />\nThey fired several shots before dismounting, and several more after reaching the ground, the width of the road between them, but neither was hurt, for<br />\nboth were students, more used to books than bloodshed. Then Major Lindsay<br />\ncalmly put up his pistols, and declared his cartridges gone. \"We can finish<br />\nWith swords, though,\" he suggested.<br />\n\"I have no sword, but we can finish with what God gave both of us—<br />\nfists,\" Gordon replied excitedly. He was eager for the fight,—the fight he had<br />\nfought many a time in his imagination.<br />\nThe match was not an even one, for it was still a man against a boy; the<br />\nman, thirty-three years old, strong with the strength of a man nearing his<br />\nPrime; the boy, a mere stripling, one who had always cared more for books<br />\nthan play.<br />\nWhen Major Lindsay rode off, he was cursing \"the little fool\" for making<br />\n\"do<br />\nhim<br />\nit whether or no;\" and Gordon was slowly and painfully rising from<br />\nthe trampled ground, at the same time promising himself that \"next time\"<br />\nthings would be different.<br />\nIn war-time a battered face passes without any questions; so by eight<br />\no'clock, Gordon found himself where he had been again and again in fancy—<br />\nseated by Bab, in the moonlight, on the old stone steps with the big urns leading down into the garden. One thing, however, was not as it was wont to be<br />\nin Dreamland. There he was softly telling Bab that he was a man now, the<br />\nwar had matured him quickly, and that she was his Bab. Then he would tell<br />\nher how she had been his Queen from his first school days, when she had fought<br />\nLindsay for him, clear up to his University years, and that it was for her that<br />\nhe was working so hard, working that he might lay some laurels at her feet.<br />\nBut now the war was on and he might never win those laurels; so he must lay<br />\nhimself at her feet, and beg her to take him as he was. And then Bab had<br />\nalways laid her head on his shoulder and called him \"her own, own Jordie,\"<br />\nand then he had always kissed her. But now Bab was saying, \"Jordie, you<br />\ndear old boy, I've got a secret for you. Maybe its the last one we'll have<br />\ntogether, so listen now, and don't you tell a soul. I'm engaged. You're the<br />\nonly one that knows it. Jordie, it's to Major Lindsay, and he's lots nicer than<br />\nhe used to be. Oh! I do love him, and you are going to like him for me. 0<br />\nJordie, if you only knew how I love him.\"<br />\nWhen Gordon reported to his captain, there was still a day and a half of<br />\nunexpired leave to his credit.<br />\nTwo days later there was a great battle. A whole day it raged, and when<br />\nnight fell, it seemed as if the Confederate army had been scattered to the four<br />\nwinds of Heaven. In the reports, both Lindsay and Gordon were reported<br />\nmissing; but the second day after the battle Major Lindsay, wounded in the<br />\nShoulder, made his way into camp, mounted on Gordon's horse. The next<br />\n‘rePorts contained M ,jor Lindsay's name among the \"Found,\" and among the<br />\n'Dead\" was the name of Gordon Chapman.<br />\nLindsay had to be taken to Charlottesville, to the hospital there, and Bab<br />\nnursed him. There, one evening he told Bab, \"Bab, you got the wrong man.<br />\nChaprnan was worth ten of me. If it hadn't been for him, I'd 've been where he is<br />\nnow. He died so I could get back to you; when he died he was singing sort of<br />\nto himself,'How I love him, how I love him, if you only knew how I love<br />\nhim•\" And just before he died, he whispered to me,'That's what she told me<br />\nabout you, and it won't go out of my head.' Then he went on singing slower,<br />\nand more softly, and finally it just faded away altogether.\"<br />\n,<br />\nThere was not a sound except that a tall red haired girl was crying softly,<br />\n0 Jordie, Jordie.\"<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\nNINETY-TWO'S DECENNIAL.<br />\n<br />\nN the evening of April the twelfth, twenty-six members of this ten-year<br />\nold class gathered at the Johns Hopkins Club on Park Avenue in their<br />\nTenth Annual Reunion. The attendance was not confined to Baltimore<br />\nmen. Flying trips from Florida, Ohio, New York and Pennsylvania were made<br />\nby those who felt they could not let this particular reunion go by without being<br />\non hand. They were busy men, but each made a personal sacrifice to be present, and planned the trip weeks in advance.<br />\nThe committee provided an elaborate menu, some good \"coon\" music and<br />\njust a little \"free licker,\" and everybody enjoyed a jolly good evening. There<br />\nwere no set toasts, the speechifying being very informal and every one taking a<br />\nhand, as the notice read, in singing a song, telling a story, or doing some other<br />\n\"stunt.\"<br />\nIt has been often asked how the class has succeeded in keeping up its annual reunions, and what brings men hundreds of miles to attend a class dinner.<br />\nThe reason is probably not very hard to find and dates back to the year of<br />\ngrace 1889, when a right fresh lot of candidates succeeded in worrying through<br />\nthe matriculation examinations of the J. H. U., or enough of them to permit<br />\nattendance on the college courses and the class meetings. The latter were not<br />\nmere matters of form, but were lively red hot meetings where every man had<br />\nhis say and through which all class organizations and affairs were activily con<br />\ntrolled and governed.<br />\nCliques were unknown among us; the democratic rule of the class meeting<br />\nwas a real one and unfettered. This state of affairs naturally encouraged a general participation in all class matters. Was a scrub team needed to practice the<br />\nfoot ball team? They turned out almost en masse, with coats inside out in lieu of<br />\ncanvas jackets (some with pants ditto), and lent a hand in withstanding the<br />\nrushes of the regular team. Did one of the fellows get into trouble with the<br />\nfaculty in his efforts to enliven the hours of L. E. P.*? His name could not be<br />\nobtained from any of his classmates, and the whole affair was finally a closed<br />\nincident, largely through the efforts of a class committee duly selected to take<br />\nthe matter up with the faculty, and who pledged, in the event of immunity<br />\nfrom punishment to the offender, the honor of the class against a repetition of the<br />\noffense. Was it a class book to publish? Studies were not allowed, even among<br />\nthe honor men, to interfere with their participation in the arduous duties of the<br />\neditorial staff.<br />\nThe literary and other contributions were numerous, and as a result of a<br />\nhearty and earnest co operation the class points with pride to its \"Hullabaloo,\"<br />\nthe first class book hearing that name, which, by the way, has since been the<br />\nsynonym at Hopkins for class book.<br />\nEnough has been said to make the point that the old class spirit and good<br />\nfeeling, which the former inter-class athletic contests did much to strengthen,<br />\nhad formed after three years a bond of something more than the ordinary ties<br />\n* \"L. E. P.\" was the current abbreviation in the last century for Dr. Griffin's course in<br />\n<br />\nO<br />\n<br />\nLogic, Ethics, and Philosophy.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n5<br />\n<br />\nof classmates, and at the graduation dinner the sentiment .was commonly expressed that those present were bound together by associations they could not<br />\nbear to sunder.<br />\n\"The Annual Reunion of '92\" with hour and place added, is the brief notice sent yearly to each class man. He has been to previous gatherings and needs<br />\nno bill of particulars. He knows there awaits him a delightful evening of communion with those who were his constant associates at the University in studies,<br />\nathletics, \"horse-play\" and everything else that was \"doing\" in the three years<br />\nof the college life.<br />\nWith is teachers and 10 engineers, the class is made up of a baker's dozen<br />\neach of lawyers and doctors, four merchants, two men in the government employ, a preacher, an editor, an insurance man and McKay. McKay is variously<br />\nreported as a missionary among the Utah Mormons, a plain citizen in their<br />\nmidst who has placed his limit at but one wife, and as a backslider who has<br />\nYielded to the temptations of his surroundings and taken unto himself a plurality<br />\nof consorts. The writer frankly states that he believes these rumors to be all<br />\nequally unreliable and hopes that some one who knows will write to the editor<br />\nof the NEWS-LETTER and relieve the uncertainty surrounding McKay's location,<br />\nvocation, and domestic tastes.<br />\nAbout one.half of the class is married (one wife each) with two about to<br />\nrenounce celibacy, and the outlook is favorable for a continued accession to the<br />\nranks of the benedicts.<br />\nThe remarkable record of but one death, which occurred at the very outset<br />\nof our career, we trust will not be altered for many decades.<br />\nWhile an unusually large proportion of the men have already achieved success from the worldly standpoint it is our proudest boast that every man, in his<br />\nparticular pursuit and sphere, is making a worthy and honorable record.<br />\nVery many of the readers of the NEWS-LETTER are undergraduates who<br />\nhave all their reunions to look forward to. The class of '92 sincerely hopes<br />\nthat its own record in this line will induce every class of our Alma Mater to<br />\nThe social and pleasurable side of these gatherings<br />\nemulate its example.<br />\ndwelt upon. As much might be said of their<br />\nexclusively<br />\nhave been almost<br />\nThey make us better men, and better and more<br />\nrespects.<br />\nother<br />\nhelpful side in<br />\nJ.<br />\nU.<br />\nH.<br />\nloyal sons of old<br />\nA word as to our organization, in conclusion, might be helpful to other<br />\nclasses: Selecting two men who had filled the respective offices in our undergraduate days and were willing to shoulder the recurring duties of their<br />\npositions, they were elected Perpetual President and Permanent Secretary,<br />\nrespectively, of the class organization, and upon them practically rested the<br />\nresponsibility of the successive annual gatherings.<br />\nOriginally, a committee existed for this purpose, but to it gradually attached<br />\nthe prefix \"useless,\" and it drifted by easy stages into the realm of \"innocuous<br />\ndesuetude,\" whence, after a decade's sojourn, it was summoned to lend a hand<br />\nin the preparations attendant upon our greatest reunion, the '92 Decennial.<br />\n<br />\nLESTER L. STEVENS, '92.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br />\n<br />\nAPRIL 23, 1902.<br />\nSubscription $l.0 per year.<br />\n<br />\nEditor in Chief<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br />\n<br />\n10 Cents a single copy.<br />\n<br />\n.<br />\n<br />\nAthletic Editors,<br />\n<br />\nROBERT S. LANIER, 1903.<br />\n. HARRY K. TOOTLE, 1903.<br />\n•<br />\nSOLOMON BLUM, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\n( REGINALD S OPIE, 1904.<br />\nW. S. BIRD, 1903.<br />\n<br />\nBusiness Manager,<br />\nAssistant Business Manager,<br />\n<br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br />\n<br />\nAssistant News Editors,<br />\n<br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n110•011•11111•1=111111•MININIIIIIIIMININIW<br />\n<br />\nt<br />\n<br />\nHE article on \"Ninety-two's Decennial,\" appearing elsewhere in this issue,<br />\ngives much food for thought to every class at the University, and, perhaps, to some that have graduated. '92 is alone among the older Hopkins classes in her proud record of an unbroken line of well-attended class reunions. The story of how she did it should be beneficial to all other aspiring classes,—especially when the tale is told by one so well qualified as Mr.<br />\nStevens, who is the \"Perpetual Secretary\" referred to in his article.<br />\n<br />\nO<br />\n<br />\nN another page is found the voice of a dissenter to the plea which appeared<br />\nin our last issue for an honor system in Hopkins examinations. How<br />\nfar this represents the sentiment of the student body it is impossible at<br />\npresent to say, and it will be impossible until such sentiment is sounded. A<br />\nplan suggested is a personal canvass of the three classes by their respective<br />\nsecretaries, the report to be handed in to the presidents of the classes, who shall<br />\nform a committee with power to count the votes and decide the majority. It is<br />\nunderstood that this first vote will be merely a \"yes\" or \"no,\" for or against<br />\nthe adoption of an honor system in the collegiate department of the University.<br />\nAction in the matter is expected before the next issue of the NEWS—LUTTER.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n7<br />\n<br />\nHE lacrosse situation is in that pleasing but uncertain state where speculation runs riot for want of facts to check it. Pennsylvania, Hobart, and<br />\nHarvard have fallen victims to our deadly team-work; and, in the words<br />\nof the rooters, \"Columbia is another bait.\" With Lehigh and Swarthmore,<br />\nhowever, there is a different tale to be told. By means of the easy but deceitful<br />\ncomparison of scores, an easy victory may be prophecied for the Black and<br />\nBlue; Hobart, one of our \"easy marks,\" beat Lehigh 5-3, and our victory over<br />\n1, compares well with Swarthmore's, 8-3. But there is good auHarvard,<br />\nthority for distrusting this kind of evidence. Lehigh is an old lacrosse college;<br />\ntwo weeks of outdoor practice, with alumni coaching, will produce a team far<br />\ndifferent from the one that went under to Hobart. And as for Swarthmore—<br />\nthere is last year's story. The splendid capabilities shown by the'02 team will<br />\nall be called forth before it can sign itself \"Unconquered.\"<br />\n<br />\nz<br />\n<br />\nT is a custom with most of the leading colleges throughout the country that<br />\nthere should be published, in the college paper, the reports of the managers<br />\nof the various teams, the musical organizations, etc. In accordance with<br />\nthis custom, there is printed elsewhere in this issue the financial report of the<br />\nMusical Clubs for the past season. Good management, economy, and hard<br />\nWork are required to pull the organization through a season without leaving<br />\nbehind a trail of debts. It is pleasing to notice that the credit end of this year's<br />\naccount was helped materially by the splendid support given the Clubs at the<br />\nBaltimore Concert by the Hopkins students themselves,—a support which was<br />\na fine example of loyalty to a college institution, and deserves to be repeated.<br />\nThe non-serious side of the Musical Clubs is so much brought out that<br />\ntheir actual raison d'etre is often forgotten. On the scholastic side, our University needs no advertising. On the athletic side, our credit for hard work<br />\nand fine achievements is known abroad. But there are many, at our very doors,<br />\nwho need to be told that attention is paid here, not only to the cultivation of<br />\nthe mind, not merely to the improvement of the body, but also to the development of sociability and congeniality,—all that goes to make up \"college life.\"<br />\nTo all such the Musical Clubs have a mission to fulfil,—and especially now,<br />\nWith the approaching growth in importance of our undergraduate body.<br />\n<br />\n3<br />\n<br />\nTo the Editor of the NEWS-LETTER:<br />\nAn article appearing in your last issue entitled \"The Honor System\" has<br />\ncaused considerable comment among the students. Having discussed the question with graduates of other colleges as to the conditions prevailing in their respective schools, and being in touch with the workings of our collegiate department, I feel that I must dissent from the views expressed in the above mentioned article.<br />\nIn the first place, there is no need at Hopkins of any so-called system.<br />\nWe are fortunate to have obtained the distinction of being a college where there<br />\nexists among the students a high sense of honor. Elsewhere men for some<br />\nmysterious reason do not deem it dishonorable to cheat at examinations, nor<br />\n<br />\n\fTHE NEWS-LETTER.<br />\ndo they condemn their classmates who do cheat. At Hopkins there is little or<br />\nno cheating done in examinations, and those men who do it are looked down<br />\nupon by the whole student body.<br />\nSecondly, if there were such corruption here, would an \"honor system\" be<br />\nadvantageous? If a man thinks it not wrong to secure aid in his examinations,<br />\nwould he have such a fine sense of honor as not to lie about it? I think the<br />\nremedy inadequate.<br />\nFurtherfnore, despite the precedents at other universities, there is, I think,<br />\na tendency to lessen a man's self respect, if he must add his oath to every statement he utters. I for one would consider it an insult, if I were asked to sign<br />\nany pledge like the one suggested.<br />\nAn \"honor system\" is not needed by us, because we have a high standard<br />\nof moral sense; and those \"black sheep\" that would be inclined to cheat are<br />\ndeterred from so acting for fear of losing the respect of their classmates. If<br />\nsuch a pledge were introduced, it would lessen the dignity of our student body,<br />\nand prove inefficacious in remedying any possible evil.<br />\nYours sincerely,<br />\n<br />\nRoss<br />\n<br />\nMILItS<br />\n<br />\nDIGGS, 1902.<br />\n<br />\nDR. GILMAN'S TRIP TO EUROPE.<br />\n<br />\nR.<br />\n<br />\nGILMAN sailed from New York last week for Europe. He goes partly<br />\nfor recreation and primarily in the interests cf the Carnegie Institute.<br />\nDr. Gilman will visit the great British and Continental Universities, in<br />\norder to acquaint himself with their methods. Speaking of his trip, Dr. Gilman<br />\nsaid:<br />\n\"I anticipate a very pleasant journey, and hope in my visits to the several<br />\neducational centres of the Old World to lay hold on some new ideas, new inspirations and improved methods for the management of an institution designed<br />\nfor the higher education of Americans. The lines upon which the Carnegie endowment has been planned make it essential that all the knowledge possible on<br />\nthe subject should be at our disposal, and for this reason my instructions are to<br />\nvisit every university in Europe and seek to ascertain the special elements of<br />\nits strength.''<br />\nDr. Gilman will not return until October.<br />\n<br />\nW. J. Bryan, '03, has been elected assistant manager of the musical clubs.<br />\nThe Hullabaloo Club has adopted a brief constitution. The Board of Governors is to be self-perpetuating, each member choosing his own successor, with<br />\nthe approval of his colleagues.<br />\nThe first \"smoker\" of the club, held in the Trophy Room on the evening<br />\nMonday<br />\nlast, was attended by almost the whole class, and was a splendid<br />\nof<br />\nsuccess.<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\niminiiiituinflommuronimionimmumummiiliimmiininnimiquonumonimniwituatuniffilimmtomoilommiumfinimuthm<br />\n<br />\n111110111111111111111111111111111P11011111111/11111111111101 I 1111111111<br />\n<br />\n111111111111110 I IPIIIIIIIIIIIII1111/111111111111111Maifill;hiZA<br />\n<br />\nOn the afternoon of the r5th Dr. Jacob H. Hollander lectured before the<br />\nArundell Club, on the present conditions in the island of Porto Rico The<br />\nlecture was illustrated with many excellent stereopticon views.<br />\nAfter several weeks' postponement, Dr. Woods delivered his lecture on<br />\n\"Liquid Air,\" April ro. Having a large amount of liquid air, he was able to<br />\nshow many interesting experiments. A large audience of students and strangers packed the physical lecture room.<br />\nDr. James N. Schonler, of Boston, is delivering a series of four lectures on<br />\nthe general subject, \"The Life of the People During the Revolution.\" The<br />\nlast lecture will be delivered on Friday, the 25th. Dr. Scholller is best known<br />\nas the author of \"History of the United States Under the Constitution.\"<br />\nIn a short time a fifty foot steel tower will be erected on the Weather<br />\nBureau building. The tower, which will be surmounted by a wind vane, will<br />\nbe higher than the City College.<br />\nMr Frederick I„ Olmsted delivered a lecture in McCoy Hall, last Saturday night, on \"The Plan for the Improvement of the City of Washington.\" The<br />\nlecture was delivered under the auspices of the Municipal Art Society.<br />\nAt the banquet of the Baltimore Alumni Association of the University of<br />\nVirginia, held at the Stafford Hotel on April ro, President Remsen responded to<br />\nthe toast, \"Our Sister University.\" A number of other Hopkins men were in<br />\nattendance.<br />\nThe Hopkins Board of Trustees has received a valuable addition in the five<br />\nnew trustees, who were elected at a meeting on the 7th of this month, to fill the<br />\nvacancies caused by the deaths of Messrs. C. Morton Stewart, Benjamin F.<br />\nNewcomer, J. H. Pheasants, and Dr. James Carey Thomas, and by the resignation of Mr. James L. McLane. The new trustees are Mr. Brent Keyser, Mr.<br />\nBlanchard Randall, Mr. Theodore Marburg, Mr. Bernard N. Baker, and Mr.<br />\nFrancis M. Jencks. By the influence and position of these gentlemen, it is<br />\nthought that the interests of the University will be materially furthered.<br />\nCompetition for the Tocqueville gold medal is now open. This medal is<br />\nannually given by Baron de Coubertin, of Paris, to the University to be awarded<br />\nto that student \"who shall have written the best essay on some subject illustrating any phase of French history, political or social, from 1815 to 1890, or a<br />\nreview of some important historical work published in France since 1890.\"<br />\nThe essays, which are to be from 8,000 to i6,000 words long, must be sent to<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS—LETTER.<br />\n<br />\nthe Registrar before the first of May. The award will be announced on Commencement Day. Only once has the medal been awarded,—to J. E. Routh,<br />\n'oo. The present competition is looked forward to with great interest.<br />\nOn the shelves of \"New Books\" is to be found a recently published work<br />\nby Dr. J. C. Ballagh, of the Historical Department, entitled \"A History of<br />\nSlavery in Virginia.\"<br />\nPresident Rernsen was in New York on Saturday last, attending the in.<br />\nauguration of Dr. Nicholas Murray Butler, president of Columbia. Among<br />\nother Hopkins men with him was Mr. Nicholas Murray, librarian of the University, who is a near relative of President Butler.<br />\n<br />\nTHE HULLABALOO ELECTIONS.<br />\nOn Thursday, the seventeenth, the Junior class held an election to select<br />\neditors for the 1903 \"Hullabaloo.\" It was a hot one. Almost every office<br />\nwas fought for with a grim determination, showing that every one was in earnest. Those chosen were: Editor in-chief, R. S. Lanier; Associate Editor.inchief, H. K. Tootle; Associate Literary Editors, C. M. Sparrow, G. D. Strayer,<br />\nT. W. Glocker, J. M. Combs, W. M. Hunley, J. A. Addison; Art Editors, J.<br />\nAlan Houghton, Wilton Snowien; Business Manager, W. S. Bird; Assistant<br />\nBusiness Managers, P. R. Straus, F. Hazlehurst.<br />\nOn the whole, it is a splendid board, and should uphold the reputation of the<br />\nJunior class—no easy task, as the editors will find to their cost.<br />\n<br />\nHOPKINS IN CIVIC STRIFE.<br />\nA.<br />\n,<br />\n,s M. THOMSON,'97, one of the founders of the NEWS-LETTER, and<br />\na member of its first staff, is at present engaged in a thrilling fight with<br />\nthe gamblers and Sunday liquor-sellers of Norfolk, Va., in his capacity<br />\nas editor of the Norfolk Dispatch. Mr. Thomson, who went into the newspaper<br />\nbusiness on his graduation from the University, has been remarkably successful<br />\nduring his two years charge of the Dispatch, doubling its size and its circulation.<br />\nA sudden snag was struck, licwever, in this crusade against the law-breakers of<br />\nNorfolk. A prominent crook known as Napoleon Joynes, whom Mr. Thomson had referred to as \"the Napoleon of the joints,\" secured the aid of two<br />\ntrusty thugs, and made a personal assault upon the editor and members of his<br />\nstaff, threatening to break up the paper unless retraction of the epithet was<br />\nmade. The plucky editor's reply was to arrest the assailants and have them<br />\nbound to the peace, to obtain permission from the judge to carry arms, and to<br />\nprosecute his fight with renewed vigor.<br />\nMany expressions of sympathy with Mr. Thomson, and encouragement in<br />\nfight he is putting up, have reached the NEWS-LETTER staff, all of<br />\nlively<br />\nthe<br />\nunqualifiedly proud of their predecessor. The issue of Mr. Thomfeel<br />\nwhom<br />\nis awaited with interest, and his success is hoped for by every<br />\ncrusade<br />\nson's<br />\nstudent in the college.<br />\n<br />\n3<br />\n<br />\n\fTHE NEWS—LETTER,<br />\n<br />\n11<br />\n<br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nLacrosse.<br />\nAPRIL 25, Lehigh at South Bethlehem. (Championship Game.)<br />\nMAY, 3, Columbia University at Baltimore.<br />\nMAY 10, Swarthmore at Baltimore.<br />\nPlace of playing home games will be announced later.<br />\n<br />\nBaseball.<br />\nAPRIL 26, Maryland Agricultural College at College Park.<br />\nMAY 3, Open.<br />\nMAY<br />\n7, Georgetown in Baltimore.<br />\nMAY 10, Western Maryland at Westminster.<br />\n<br />\nTrack and Field.<br />\nAPRIL 26, Spring Relay Races, University of Pennsylvania.<br />\nMAY 17, J. H. U. Open Scratch Games at Electric Park.<br />\n<br />\nHOPKINS 12, HOBART 1.<br />\nis the one word which most aptly describes the whole situation<br />\n44INCH!\"<br />\ne<br />\nat the American League Park on April 12. Hobart College came here<br />\nfor the first time from Geneva, N. Y., with quite a reputation, having<br />\nbeaten, during the same week, Lehigh, 5-3, and Pennsylvania, 2- 0. Hopkins<br />\nvery naturally expected a lively struggle in the opening game, but, -as some one<br />\nsaid after the contest, \"it was like robbing a child's bank.\"<br />\nJudging from the game which the visitors put up during the two twentyminute halves, it will always be a mystery how they ever defeated Lehigh or<br />\nPennsylvania. Some said that they were overtrained, the contest in Baltimore<br />\nbeing the last on their Southern trip. There is possibly a little in this, but the<br />\nwork of the team in general was decidedly off color. The stick work was<br />\nextremely poor, exhibitions of team play were few and far between, and all the<br />\nmen lacked ginger and snap. Hopkins, on the other hand, gave the loyal band<br />\nof rooters present abundant opportunities for all-around handshaking.<br />\nThe men started off on the jump, and in thirty seconds little Bernheim<br />\ndrove the ball in the cage. Putts soon followed suit, and by the end of the<br />\nhalf, the score stood 7 to 0 in Hopkins' favor. During these twenty minutes,<br />\nAbercrombie was always at the right spot with both feet, and the rest of the<br />\nattack ably assisted him. The few chances which the defense got to feed on<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nthe ball found it quite equal to the occasion, and the attack generally had the<br />\nsphere returned to them in short order.<br />\nBetween the halves Coach Abercrombie and Captain Schmeisser impressed<br />\nupon the team the great value of the practice which might be gotten out of the<br />\nlast half. The attack were instructed to pass carefully, and to see that every<br />\nman got in the team play necessary for the advancement of the ball. Five<br />\nmore goals resulted. About the middle of the half, Hobart got one of her few<br />\nchances to shoot. The ball struck the goal post, and, as it bounded out, the<br />\ninhome man scooped it in the net. One of the Hobart players is reported to<br />\nhave shouted in an ecstacy of delight: \"We got a goal!\" And he may well<br />\nhave shouted, for Hobart was clearly outplayed all around throughout the<br />\nentire game.<br />\nAlthough early in the season, the Hopkins men all seemed to have very<br />\ngood powers of endurance. This is, indeed, a matter of congratulation, for had<br />\nwe been equal in strength last season to Swarthmore, we should certainly have<br />\nwon the championship of the United States. With this in our favor, we should<br />\ncertainly give our victors of last season a \"warm reception\" on May 10. The<br />\nline-up against Hobart College was as follows: Putts, inhome; B. Bernheini,<br />\nouthome; Sayler, first attack; Bird, second attack; P. Bernheim, third attack;<br />\nAbercrombie, center; Tough, third defense; Blanck, second defense; H.<br />\nStraus, first defense; E. Schmeisser, cover point; W. Schmeisser (Captain)<br />\npoint; Briscoe, goal.<br />\nOur alumni delegate, Dr. B. B. Lanier, acted as referee.<br />\n<br />\nOUR VICTORY OVER HARVARD.<br />\nHE decisive victory of our lacrosse team over Harvard on April igth came<br />\nsomewhat as a surprise, for, although we hardly looked forward to a defeat, still a close game was expected and the score of II to L was a matter of hearty congratulation.<br />\nOur victory over the Cambridge team last season was gained by 4 goals to<br />\n0, and it is well known that lacrosse is steadily gaining ground at Harvard.<br />\nThat we were going to meet a stronger team than that of last season we felt<br />\nassured. The only inference to be drawn, therefore, is that Hopkins is decidedly stronger this year.<br />\nIt took very little time after the beginning of the game to see that Hopkins was pursuing her old policy of trying to score first and gain a comfortable lead in the first half. Every man went in on the jump, and in less than<br />\nthree minutes Putts placed the first goal in the net. This seemed to start the<br />\nball, and by the end of the half, the score stood 8 to 0 in Hopkins' favor. Such<br />\na condition of affairs was indeed a surprise to the Hopkins, for in the Hobart<br />\ngame of a week before, only ;7 goals were made in the first half, and Harvard<br />\nwas considered much stronger than Hobart. In the second half, Harvard<br />\nchanged her goal keeper, and Henry Straus retired on account of a wrenched<br />\nankle which he received in the first half. Both changes proved a decided disadvantage to Hopkins. Harvard's new man was decidedly better than the<br />\n<br />\n\fTHE NEWS—LETTER.<br />\n<br />\n13<br />\n<br />\nfirst, who, by the way, had been wired to come to Baltimore from Cambridge<br />\nespecially for the game here. The absence of Straus was also keenly felt, for<br />\nhad he been in the game it is hardly likely that Alvord would have been left<br />\nuncovered to shoot the only goal which Harvard scored.<br />\nThe visitors seemed to be in very good condition, but were unable to break<br />\nup the fast team play which Hopkins exhibited at every stage of the contest.<br />\nSeveral of the goals were made strictly in accordance with the theory of the<br />\ngame, the fourth one passing to and from every man on the attack. The play<br />\ncalled forth hearty applause from the spectators.<br />\nHopkins lined up as follows: Putts, inhome; B. Bernheim, outhome; Say.<br />\nler, first attack; Bird, second attack: P. Bernheim, third attack; Abercrombie,<br />\ncenter; Tough, third defense; Blanck, second defense; Straus, first defense;<br />\nE. Schemeisser, cover point; W. Schemeisser, point; Briscoe, goal.<br />\nMr. Henry Penniman, an old Hopkins lacrosse player, acted as referee.<br />\nNext Saturday, the team plays the first of the championship games against<br />\nLehigh, at South Bethlehem, Pa. The team leaves town about one o'clock<br />\nFriday afternoon and will probably return Saturday night or Sunday morning.<br />\nSeveral loyal rooters will go along and we hope all those who can possibly do<br />\nare<br />\nso will join the little band. A rousing good time is expected. \"The boys<br />\nbody.<br />\nstudent<br />\nthe<br />\nout for the championship,\" and need the support of<br />\n<br />\nTRACK AND FIELD.<br />\nthe<br />\nOR the past week Captain England of the track and field team has had<br />\nwhich<br />\nmen hard at work in preparation for the annual spring relay races<br />\nare to be held April 26th by the University of Pennsylvania. Four silk<br />\ndurbanners in the trophy room show what Hopkins has done in this direction<br />\ning the past four years. We have a strong team this season and should add<br />\nCaptain<br />\nanother pennant to the collection. The team entered is composed of<br />\nCron<br />\nLe<br />\nHoffman,<br />\nC.<br />\nR.<br />\nRiggs.<br />\nand<br />\nLindsay,<br />\nJr.,<br />\nHoffman,<br />\nEngland, W. E.<br />\nand Rosenheim are showing up well as substitutes.<br />\nBesides the race at Pennsylvania the track men also have in view the open<br />\n17.<br />\nscratch gatnes which are to be held by Johns Hopkins at Electric Park on May<br />\nsilhandsome<br />\nthe<br />\nand<br />\n,<br />\nMaryland<br />\nof<br />\nship<br />\nchampion<br />\nthe<br />\ndecide<br />\nwill<br />\nThe games<br />\nver loving cup offered by the Baltimore News some years ago will again be open<br />\nto competition. The terms under which the cup is offered is that it shall he the<br />\nHopproperty of the organization winning it three times in open competition.<br />\ncoming<br />\nthe<br />\nin<br />\nvictorious<br />\nif<br />\nand,<br />\nmeets,<br />\ntwo<br />\nat<br />\nthe<br />\ntrophy<br />\nwon<br />\nkins has already<br />\ncontests, the prize will be hers.<br />\n<br />\n5<br />\n<br />\nThe committee in charge of the games held in the cage on April 5th reports<br />\na slight financial success. The date of the contests was most likely the chief<br />\nreason for the slim attendance. It was unfortunate that they could not have<br />\nbeen held earlier in the season.<br />\n<br />\n\f14<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nBASE BALL.<br />\nGETTYSBURG 9, HOPKINS 2.<br />\nT WAS to be expected that the strong Gettysburg College team would defeat<br />\nHopkins in the game of April 12th, but it was not so sure with l.r.:Av much<br />\ncredit our men would play. For a whole week previous, wet grounds<br />\nprevented any outdoor practice. Speaking broadly, the game was satisfactory<br />\nto the men, and a great improvement over that played at Annapolis. Five of<br />\nthe opponents' runs were the direct result of wild throws. Whipple was in<br />\nsplendid form, and gave only four clean hits and two scratches. It is doubtful<br />\nwhether Gettysburg earned more than one of the nine runs.<br />\n.<br />\nThe pitching on both sides was excellent, and one of the chief features of<br />\nthe game. Besides this, Moore's play at second base in blocking runners trying to steal, was beauti`ul to see. Moto, for Gettysburg, made the prettiest<br />\nhit of the game—a three bagger over McKnights' head.<br />\nTne fair weather of the past ten days has been made the most of by the<br />\n<br />\nJ<br />\n<br />\nteam. Practice has been held every afternoon, and more team work and confidence begins to manifest itself. It is more and more apparent that Hopkins<br />\nhas the material for a splendid team. What is needed is practice, and as soon<br />\nas the fielding reaches the standard of the pitching, every Hopkins man may be<br />\nproud of the team.<br />\n<br />\nNo game could be secured for April r 9, but on the 26th the team will play<br />\nthe Maryland Athletic Club at College Park. This should be a victory for<br />\nHopkins, and it is hoped that a number of rooters will go along to cheer.<br />\nThe Base Ball team has received from the Board of Editors of the 1901<br />\nHullabaloo, through its business manager, Mr. Harry S. .13 .rne, a gift of ,40.00,<br />\nA<br />\nto be used for new uniforms The officers of the team are all grateful for the<br />\ninterest that has been taken in its career, and are anxious to make a record that<br />\nwill please everybody. The men think that the worst game has been played,<br />\nand that better things are ahead.<br />\nTHE DEBATING ASSOCIATION.<br />\nGRATIFYING outcome of the present Hopkins spirit is the debating<br />\nassociation which has recently been formed. The object of this association is to prepare men to take part in the intercollegiate debates, and<br />\nto develop any talent in speaking which the men may have. The officers are:<br />\nHarvey B. Stone, president; G. D. Strayer, secretary. According to the constitution, which is now being drawn up, those eligible for membership are the<br />\neighteen men from the Senior .and the Junior classes who make up the class<br />\n<br />\n4<br />\nteams<br />\n<br />\nAu important power of the association is the conferring of \"H's\" upon<br />\n<br />\nthe speakers in the intercollegiate debates. In order to distinguish these<br />\n\"H's\" from those of the athletic association, they will be blue instead of yellow. The first rnAn upon whom the blue \"H\" will be conferred are Messrs.<br />\nStone and Plaggemeyer, the two presidents of the Senior and Junior classes,<br />\nwho represented the University in her late struggle with North Carolina.<br />\n<br />\n\f15<br />\n<br />\nTHE NEWS—LETTER.<br />\nREPORT OF THE MUSICAL CLUBS.<br />\n<br />\nHE concert season of the Johns Hopkins Glee, Banjo and Mandolin Clubs<br />\nis rapidly nearing completion, and as many questions have been asked<br />\nconcerning their financial standing, it was decided at a recent meeting of<br />\nthe organization to present to the student body a brief account of the expenditures and receipts for the year. To note each minor expense would be tedious<br />\nand uninteresting, so the following account has been curtailed as much as possible. As a whole the expenses have been reduced far more than ever before,<br />\nthough the expense column is still necessarily large.<br />\n<br />\nt<br />\n<br />\nJOHNS HOPKINS GLEE, BANJO AND MANDOLIN CLUBS<br />\nin account with EBEN C. HILL, MANAGER.<br />\n<br />\nSeason of 1901-4902.<br />\n<br />\nCR.<br />\n<br />\nDR.<br />\n<br />\nBy printing: 1000 posters, 2500 programmes, 3000 tickets, 500 patroness<br />\n$ 98 35<br />\nnotices, stationery, etc<br />\n$ 115.00<br />\nTo amount in Bank last year<br />\n100.00<br />\nBy<br />\n\" paid Athletic Association for training table<br />\n87.57<br />\nBy music: mimeographing, $32.30; sheet music, $55.27<br />\nBy professional services of Mr. L. C. Fischer, 28 rehearsals @ $2.00: ar69.76<br />\nranging of music $13.75<br />\nBy expense of Christmas trip to Charleston, W. Va., Winchester,<br />\n143.00<br />\nand Hagerstown, Md., not covered by concert receipts<br />\n96.00<br />\nTo receipts from caution money<br />\n47.00<br />\nTo receipts from minor charity concerts 520.00<br />\nTo receipts from Baltimore concert<br />\n803.00<br />\nTo receipts from Old Point concert.<br />\nBy expenses Baltimore concert not included above: for rent of Lehmann's Hall, $40; advertising, $21.00; ticket handling, $10.00; deco81.00<br />\nrating, $10.00.<br />\n16.00<br />\nTo advertisement in Baltimore Programme.<br />\n420,00<br />\nBy expense of Easter trip of six days, taking 36 men<br />\n78,00<br />\nTo amount from rooters taken on trip and to Richmond<br />\n13y amount paid back and amount yet to be returned to men less fines.... 87 00<br />\nBy incidentals: stamps $3.00, plate and photograph of cuts $7.50, opening<br />\n23.50<br />\nMcCoy Hall for rehearsals $9.50, telegrams, express charges, etc<br />\n10.00<br />\nBy W. B. Carver for prize song \"Our Alma Mater in Dixie Land\"<br />\n49,17<br />\nBy probable balance<br />\n$1169.00 $1169.00<br />\n<br />\nALUMNI.<br />\nMr. Henry Clay Miller, of the class of 1901, was married to Miss Katherine<br />\nFauntlery, of Stanton, Va., on April 8. On their return from the wedding trip,<br />\nMr. and Mrs. Miller will reside in Stanton.<br />\nR. I, McAll, 'oo, has accepted a position as organist in a church connected<br />\nwith the Brick Presbyterian Church, New York City. Mr. McAll will enter on<br />\nhis duties in October.<br />\nThe class of 1900 will hold an informal banquet at the Hopkins Club on the<br />\nnight of the 25th.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n16<br />\n<br />\nTHE PHI BETA KAPPA ELECTIONS.<br />\nN Friday last, the Johns Hopkins Chapter of the Phi Beta Kappa Fraternity elected, besides the usual seven Senior members, fifteen new members from the faculty and graduate schools. The list is as follows:<br />\nDr. Mervin T. Sudler of the medical staff, Dr. J. 13. Whitehead, '92, of the<br />\nstaff of the physical department, Dr. W. H. Hobbs, '88, Mr. E. J. Benton, Holton, Kan., history; T. H. Fowler, Chestertown, German; J. W. Harry, Dublin,<br />\nhistory; A A. Kern, Nashville, Tenn., English; C. F. Lindsay, Halifax, N. S.,<br />\nchemistry; C. E. Lyon, Baltimore, German; E. G. Martin, St. Paul, Minn,, i.<br />\nbiology; A. J. Morrison, Farmville, Va., romance languages; R. L. Ramsay,<br />\nFredericksburg, Va., English; Lee Raney, Danville, Ky., Greek; W. G. Seiple,<br />\nCatasauqua, Pa , Hebrew; W. S. Weedon, Baltimore, chemistry.<br />\n,/—...\" Those members of'02 entitled to wear the \"Key\" are C. A. Myers, Chas.<br />\n/ Markell, H. B. Stone, Samuel Wolman, A. G. Dew, D. I. Macht, and Solomon<br />\n/ Strouse.<br />\ni---..<br />\nThese officers were elected for the next year: President, Dr. A. Marshall<br />\nElliott; Viee.President, Dr. Paul Haupt; Treasurer, Dr. C. C. Marden; Secretary, Dr. J. E. Gilpin.<br />\nThe annual Phi Beta Kappa address will be delivered in McCoy Hall on<br />\nthe afternoon of Friday, May 2, by Prof. J. Makeen Cattell of Columbia; subject, \"Concerning the American University \" The banquet will take place the<br />\nsame evening in the Donovan Room.<br />\n<br />\nO<br />\n<br />\nHE—This new table tennis fad gives me a pain.<br />\nSHE—Sort of ping-pong pang, eh?--Exchange.<br />\n<br />\nGoonnov—What do you suppose will become of you when you die?<br />\nNAUTIBOY—That's a burning question.—Harvard Lamfioon.<br />\nA street Arab stood on a weighing machine<br />\nIn the light of a lingering day,<br />\nThen a counterfeit penny he dropped in the slot<br />\nAnd silently stole a-weigh.<br />\n—Smith Academy.<br />\n<br />\n\fThe Baltimore Infirmary of Osteopathy,<br />\n&04 UNION TRUST BUILDING,<br />\n<br />\n'Phone, C. & P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br />\n<br />\nN. E. Cor. Charles and Fayette Sts.,<br />\n<br />\nOSTEOPATHY<br />\ni.i a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to DiSeinIOS of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We mill be glad<br />\nto furnish any further information on application.<br />\nW. D. BOWEN, M. D., P.O.,<br />\nProst. & Mgr.<br />\nESTABLISHED 1879.<br />\n<br />\nedditig Silver ohoilday<br />\ndAeoni elk<br />\n<br />\nin<br />\n<br />\nGREAT VARIETY.<br />\n<br />\n,LmNKINS9<br />\n<br />\nSilversmitbs•<br />\nherzderson's 3&0'<br />\n210 N.<br />\n<br />\nRT.<br />\n<br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nBooks, Note<br />\nBooks<br />\n—=--'41\"lent135upplies.<br />\nMadison&HowardSts.<br />\n<br />\nMARIA BUIE, D. 0.,<br />\nV.-Prost. (11; Asst. Soffy.<br />\n<br />\nIi. MOMAINS, D. 0..<br />\nSec'y. & Trees.<br />\n<br />\nJAMES R. Pants.<br />\n<br />\nTHILO. WARNER.<br />\n<br />\nNAT _A.<br />\n<br />\nNI<br />\n<br />\nR<br />\n<br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAg..nt for I IncnIn h [Sennett and<br />\nWalter Darnara's London lists.<br />\n824 NV EST<br />\nALT MORPI STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Cassimere liats. gr<br />\n<br />\nRooItsevers and<br />\nCUSHING & COMPANY<br />\n' Stat onors<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, LAW M 1010AL. CLASSICAL AND MISCCLLANSOU• 80ORS<br />\n<br />\nKeeps constantly on hand the Text Books used in folins<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br />\n<br />\nCertificate of Analysis from<br />\n<br />\nProfs. G. W. Lehman At Son,<br />\n<br />\nII. R. ElSENBRANDT SONS,<br />\n<br />\nSTIIBLER GO.701<br />\nfor<br />\n<br />\nto 705<br />\nj°RDRN<br />\nMADISON AVE.<br />\nReads as follows: Samples submitted of<br />\nn<br />\nti<br />\n--randy—no adulterants, no coloring,fine quality.<br />\n,.Porto Port<br />\n— absolutely pure, of superior quality.<br />\n2,\"errY—no coloring<br />\nor adulterants, absolutely<br />\ne wine.<br />\npu<br />\n'\"'\"<br />\nWhisk07—no Fusel<br />\nand<br />\nohi.<br />\noil, no caramel, strictly<br />\nOlive Oil<br />\n—all tests show pure olive oil.<br />\n.<br />\nst:o<br />\na ar—natural cider vinegar, strictly<br />\nlitl<br />\nige! fltc<br />\npure and<br />\nSitx a VI<br />\nMpicas—no adulteration, all strictly pure,<br />\n<br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T.Crane,<br />\nPresident.<br />\nCarter G. Osburn,Cashier.<br />\n<br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br />\n<br />\nFOR \"VERTISING SPACE IN THIS PAPER<br />\n<br />\nFARMERS & MERCHANTS NAT'L. BANK,<br />\n<br />\nAPPLY TO<br />\n<br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450.000.<br />\nCapital. $650.000<br />\n<br />\nPEARRE E. CROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br />\n<br />\nBALTIMORE, MD.<br />\n<br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br />\n<br />\nCOLLECTIONS A SPECIALTY.<br />\n<br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nPor<br />\n<br />\nparticulars apply to<br />\n<br />\nA. SCHUMACFIER & CO.,<br />\nGeneral Agents.<br />\n<br />\nCORRESPONDENCE INVITED<br />\n<br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS,GIBRALTER.<br />\nNAPLES. GENOA. ETC.<br />\nBALTIMORE! TO BRCMEN<br />\nDIE2ECT.<br />\n<br />\n\fA. D. SMITH & SONS.<br />\nFormerly<br />\nLEVERING & SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ladies, Mi8FICS<br />\nand (hildren.<br />\nIn the Latest DeMune.<br />\nMEN'S HATS—Derbys and Soft Felts.<br />\n<br />\nthe 1itran3oZmith<br />\npiano CO.<br />\n109 and 111 North Charles Stre(<br />\nSOLE AGENTS<br />\n<br />\ni/genfraz Yiudà<br />\n<br />\nCbtchertno, trabburp ant' Web<br />\n<br />\nSuccessor to Cummins<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\n20'West Lexington St.<br />\nSpecial Discount to Students<br />\n<br />\nHABERDASHERS.<br />\n<br />\nTHE BLAKE CO<br />\n<br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br />\n<br />\ntassommommila1111111<br />\nON SALE<br />\n<br />\nBaltimore<br />\n<br />\nTHE J. H. U. PENNANTS,<br />\n<br />\nand all other College Pennants<br />\n<br />\n203 W. BALTIMORE ST. & 2 S. LIBERTY ST.<br />\nBALTIMORE, MI).<br />\nMembeis of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange,:<br />\nChicago Board of Trade .<br />\n<br />\nClinton P. Paine<br />\nGordon P. Paine<br />\n<br />\nCLINTON P. PAINE dc CO.,<br />\nBANKERS & BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br />\n<br />\n217 E. German Street<br />\nBALTIMORE, MI).<br />\n<br />\nThe Chas. Willms Su[gIcal Instrument Company<br />\nDENJ. A. NELSON. OEN'L MANAGER<br />\n<br />\npianos.<br />\n<br />\nOt.<br />\n4<br />\n<br />\n.4 00<br />\n<br />\nnet*<br />\ns\"14,2JT'BOMACT41E SG<br />\nSMITH'S<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\nSTOR E.<br />\n3rd door from Madison.<br />\nFactory 13<br />\n<br />\nC. & P.'Phone 2322-2.<br />\n<br />\nBOOKS<br />\n<br />\nOLD AND NEVV(<br />\n<br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the city.<br />\nBooks Bought, Sold and Exchanged. .. •<br />\n6o5 N. Eutaw Street'<br />\n<br />\nWM. V.PIPPEN,<br />\n<br />\nA. H. Rothe,oord'<br />\nF. Lent;•<br />\n<br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br />\n<br />\nJ. WM. MIDDENDORF & CO<br />\nBanters & iBrohere.<br />\n<br />\nPhysicians,' Burgeons,' Horital and Invalid Supplies,<br />\nPine Microsoopes and Accessories.<br />\nBaltimore, Md.<br />\n300 N. Howard St.,<br />\n<br />\nMembers<br />\nBaltimore Stock Exchange.<br />\n<br />\nDrovers and Mechanics National Dank,<br />\n<br />\nROOKS AND STATIONISJ<br />\n<br />\nOF BALTIMORE, MD.<br />\n<br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br />\n<br />\nYOUR EYES<br />\n<br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br />\n<br />\nrr OVER.<br />\nSAYRE OPTICAL COMPANY,<br />\n221 North Charles street. (Masonic Temple.)<br />\nKAA,MINING OPTIGIA•NS.<br />\n<br />\nCONTINENTAL TRUST CO. BUILDING,<br />\n<br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\ncp„ 210€3<br />\n<br />\n11-x<br />\n<br />\nis from the Press of<br />\n<br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br />\n<br />\nBALTIMORE<br />\n<br />\nWe carry a NI line of Students' Note Books and Stationery<br />\nHoth 'Phones.<br />\n<br />\n.<br />\n5<br />\n<br />\n.€4.. I<br />\n<br />\nY. M. D. A. BUILDING,<br />\nHALTIMORB,<br />\nC. & P. and Md.'Phones.<br />\n<br />\nMI ON<br />\n<br />\nJfisS.It DOWNS<br />\n<br />\nTHINK<br />\n<br />\nTHE NEWS LETTER<br />\n<br />\nBaltimore,<br />\n<br />\n229 N. Gliarle.s St.,<br />\nMASONIC TEMPLE.<br />\n<br />\noerYt<br />\nFOR Class, Fraternity and College Static)011E4<br />\nBanquet Cards, Invitations,<br />\nPrograms, Visiting Cards, Ott. • •<br />\n<br />\nOur 80e J. S. U. Sine and Black Nag Paper--now r<br />\nThere Is vcru little entertainment at home wIthwit a<br />\n<br />\nF<br />\ncTiEF<br />\nZPiANOS<br />\n<br />\nfire The Best.<br />\n<br />\nfi auIO<br />\n<br />\n9 N. LibertU 51.<br />\n<br />\n\f", "format": "basic_html", "processed": "RIL 23 1902:<br /><br />\nVol.<br /><br />\n(<br /><br />\no<br /><br />\nSI<br /><br />\nJOHNS HOPKINS UNIVERSITY.<br /><br />\nThe Johns Hopkins Press.<br /><br />\nelitlTIMORE, MD.<br />\nAmerican Journal of Mathematics.<br />\nF.510131.81Y. Editor. Quarterly. 4to. Volume XXIV<br />\nin progress. $5. per volume.<br />\nII American Chemical Journal.<br />\nI. REMSEN, Editor. Monthly.!Ivo. Volume X XVII<br />\nIn progress. $5. per volume.<br />\nIII. American Journal of Philology.<br />\nB. L. GI LOICRS LEEV PI, Editor. Quarterly. ayo.<br />\nVolume XXIII in progress. $3. per volume.<br />\nIV. Studies from the Biological Laboratory.<br />\nVolume V complete. $5 per voltiano.<br />\nV.<br />\nstudies in Historical and Political Science.<br />\nMonthly 8vo<br />\nSeries XX in progress. $3. Per<br />\nvolume<br />\nVI. Johna Hopkins University Circulars.<br />\nContainieg reports of aciontillc and literary work<br />\nIn prog-ese 1,<br />\n. Baltimore. 44.0. Vol XXI in progress. $1. per year.<br />\nVII. John Hopkins!<br />\nhewn's! Bulletin. Monthly 410.<br />\nVolume XIII in progress. IL per year.<br />\nVIII. Johns Hopkins Hospital Reports. 4to. Volume<br />\nin progress. $5 per volume.<br />\nIX. Contributions to Allayriology and Comparative<br />\nSemitic Philology,(fleitraire zur Assyriolokrie, etc.)<br />\nVol.IV in progress.<br />\nX. Memoirs from the Biological Laboratory.<br />\nW. K. BROOKS, Editor. Volume IV complete. VA°<br />\nper volume.<br />\nXI. Modern Language Notes.<br />\nA. M. ELLTOTT, Editor. Monthly. 4to. Volume<br />\nXVII in progress. $1.541 per volume.<br />\nXII. Journal of Experimental Medicine.<br />\nW. IL wELCII, Pditor.<br />\n8vo. Volume<br />\nVI in progress. $5 per volume.<br />\nX III. American J•ourna.1 of Insanity.<br />\nHEN ItY M. HUH D, Editor. Quarterly. 4to.,$5 per<br />\nvolume.<br />\nXIV. Reports of Maryland Geological Survey.<br />\nWI L LI A B II. CLARK, Editor.<br />\nXV. Terrestrial Magnetism and Atmospheric Mee'<br />\ntrileity.<br />\nI. A. BAIT Eli, Editor. Quarter'''.<br />\n8,.o. Volume VIIin progress. $1.50 per volume.<br />\nXVI. Annual Report.<br />\nPresented by the President of the Board of Triletees, reviewing the operations of the Universal<br />\nduring the past academic year.<br />\nXVII. Annual Register.<br />\n(living the list of()Moore and student, and stet-in\"<br />\nthe regulations, etc., of the linivernity. i'14w<br />\nBalled at the close of the academic year.<br />\nI.<br /><br />\nTwenty-IIIxth Year.<br /><br />\nBeginning October 1st, 1901.<br /><br />\nPresident,<br />\n.<br />\n.<br />\n.<br />\nDean of the Medical School,<br />\nDean of the College.<br />\n.<br />\n.<br /><br />\nIRA EMMEN.<br />\nWM. H. HOWELL.<br />\nEDW.IL GRIFFIN.<br /><br />\nINSTRUCTION<br />\nFor Graduate Students:<br />\n(a) In Philosophy and the Arts. ((ourse4 for candidates for the degree of Ph. D.)<br />\n(b) In Medicine. (Courses for candidates for the degree of M. D.;COU CNA for physicians.)<br />\nFor Undergraduates:<br />\n(e) As candidates for the degree of B. A.<br />\n(d) As special students.<br /><br />\nLibraries of Baltimore.<br />\nUniversity<br />\nPealiody Institute<br />\nPratt Library<br /><br />\n••••••<br /><br />\n•<br /><br />\n(Annie&amp;<br />\n1:15,0r41 volumes.<br />\nV.00.000 ohm' s.<br />\nWNW<br /><br />\n•<br />\n•••<br /><br />\nO<br /><br />\nLaboratories.<br />\nChemistry,<br />\nPhysics,<br />\nClunlogy and Mineralogy.<br />\nZoology,<br />\nAnatomy,<br />\nPhysiology<br />\nPathology and Bacteriology.<br />\nPharmacology,<br />\nPhysiological Chemistry,<br />\nClinical Medicine,<br />\n'Seminaries.<br />\nGreek,<br /><br />\nDirectors.<br />\nIra Bemsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clerk.<br />\nWilliam K. Brookl.<br />\nFranklin P. Moll.<br />\nWilliam H. Bowel,.<br />\n.<br />\n11.<br />\nJohn J. Abel.<br />\nJohn .1. Abel.<br />\n}I titian'(1sler.<br />\nDirectors.<br />\nBasil L. Gildersleeve.<br />\n)(Irby F. Smith.<br />\nMaurice Bloomfield<br />\nPaul Haupt.<br />\nlIenry Wood.<br />\nA.Marshall Elliott.<br />\nJames W.Bright.<br />\nJ. M. Vincent.<br />\nJ. H. Hollander.<br />\nFrank Morley.<br />\nJoseph S. Ames.<br /><br />\nSanskrit,<br />\nTiI MU.<br />\nC unitn,<br />\n!tom/ince,<br />\nEnglish,<br />\nI istory,':<br />\nEconomics,<br />\nMathematics,<br />\nPhysics,<br /><br />\nUndergraduates Courses (leading to B. A.)<br />\nGroups.<br /><br />\nit<br />\n4.<br />\n5.<br />\n6.<br /><br />\nClassical(the \"Old College Course.\")<br />\nMathematical-Physleal,<br />\nwading Ill to Engineering.)<br />\nChemical-Ile/logical.<br />\n(leading up to Medicine.)<br />\nGeoloelenl-iliological.<br />\nLatin M'i t 0.ritatical.<br />\n11 144)1qt:el-Po1itical.<br />\n(lending up to Law.)<br />\nModern Languages.<br /><br />\nSerial Publications.<br />\nEditors,<br />\nMathematics (vol. XXIV.)<br />\nFrank Morley.<br />\nChemistry (vol. X X VII.)<br />\nlra Bentsen.<br />\nPhilology (vol. XXIII.)<br />\nBasil L. Gildersleeve.<br />\nHistory vol. XX.)<br />\nJ. M. Vincent<br />\nModern Languages (vol. XVII.) A. Marshall Elliott.<br />\nWilliam K. Brooks.<br />\nBiology (vol. IV.)<br />\nPaul Haupt.<br />\nAssvri•dogy (vol. IV.)<br />\nExperimental Medicine (vol. VI.) W. H. Welch.<br /><br />\nJr<br /><br />\nIn addition to the seri•ila above named, copies niviy<br />\nobtained of the works mentioned below:<br />\nThe Critical Pdition of the Hebrew Text of the Old<br />\nTestament. Ildited by Prof. Paul Haupt. Prospectus on application.<br />\nRowland'a Photograph of the Normal Solar Speel rura.<br />\n10 plates. iV.0.00<br />\nDescription of the Johns Hopkins Hospital. J. S. 111th<br />\nlogs, Editor. 116 pp. 4to. 16 plates. $7.50 cloth.<br />\nThe Teaching of the Apostles. Complete fac-simil.•<br />\ntion. Edited by J. lientlel Harris. 110 pp. sin.<br />\nplates. $5.00<br />\nReproduction In Phototype of Syriac MSS. with Antilegotnena Epistles. Edited by I. H. Hall. $3.00.<br />\n13ibliographia Hopkinsionais. Part I. Philology. Parts<br />\n11-111. Chemistry, Mineralogy and Geology. PortA<br />\nIV-V-V1.Physies, Astronomy and Mathematics.<br />\n8 vo. 30 cents per part.<br />\nE full list of publicatIona will be sent on application.<br />\nCommunications In respect to exchanges and remittanalli<br />\nmay be sent to Johns Booking Press, Baltimore. Ed.<br /><br />\nProgrammes of the Courses offered to graduate atudents in Philosophy and the Arts, and in the School of<br />\nMedicine, and also of the Undergraduate or Collegiate<br />\nCourses, will be sent on application to the Registrar.<br /><br />\nTHE NEWS-LETTER.<br />\nVol. VI.<br /><br />\nAPRIL 23, 1902.<br /><br />\nNo, 14.<br /><br />\nTHE LOVE OF A LAD FOR A LASS.<br />\nHERE was the subdued hum of children studying in the small Virginia<br />\nschool-room. From without came the chirping of a robin perched among<br />\nthe blossoms of the peach tree that scraped its branches lazily against the<br />\n.<br />\nwindow of the school-house. By the side of the teacher, a young man, stood a<br />\nSlight, black-haired boy of ten, engrossed in the explanation of a sum on his<br />\nSlate. The heads of both master and scholar were bent over the slate, so that<br />\nneither noticed a boy in the back of the room quietly filling a squirt-gun from<br />\nthe water-bucket. Twice or thrice at some slight noise the teacher glanced up<br />\nangrily, and once he knocked loudly on the desk with a ruler, but still the<br />\nlittle rascal with the gun went undetected; and, judging from the way the<br />\nsmallest noise disturbed the teacher, it was well for the boy that his more repreprehensible act did go unnoticed. Then, while every pupil held his breath,<br />\nPartly in admiration, partly in fear, a thin stream of water shot across the room<br />\nand broke on the teacher's head, splashing over the book-covered desk before<br />\nhim. Completely taken aback by the unexpected bath, the teacher sprang up,<br />\nanger flushing every feature, and made a step toward, to his mind, the one possible culprit, the boy who had been standing by the desk, but who had jumped<br />\nback, as much astonished at the splashing water as the teacher himself had been.<br />\n\"Gordon Chapman,\" he burst out, \"you did that!\"<br />\nSlap! and Gordon was lying in a heap across the platform, his face sheetWhite except where four finger-marks blazed fiercely out.<br />\n\"Stop! You— you— devil! Jordie didn't do it.\" As Gordon went to<br />\nthe floor under his master's hand, a little red-haired girl of about his age, hurling at the teacher the vilest name she could think of, jumped on the platform,<br />\nand with childish rage attempted to dig her finger nails into his face.<br />\n\"Don't, Bab, don't,\" Gordon pleaded weakly from the floor; \"he'll slap<br />\nyou, too. Stop!\"<br />\nSeeing that the disturbance was developing into a rebellion, the teacher<br />\ncalmed himself sufficiently to proclaim the dismission of school. \"Gordon<br />\nChapman will remain, though,\" he said, \"and Miss Barbara's mother shall<br />\nknow of her daughter's behavior before to-night.\" All of the scholars except<br />\nBab. and Gordon gleefully departed; Bab tearfully and unwillingly stumbled<br />\nout the door, calling back words of consolation and encouragement to poor<br />\nJorclie, who sat with pale cheeks but tightly held lips, awaiting whatever was<br />\nto come.<br />\nWhen two University students, alarmed by Bab's confused story, arrived<br />\nat the school-house half an hour later, they found Gordon, with bloody stripes<br /><br />\nt<br /><br />\n2<br /><br />\nTHE NEWS—LETTER.<br /><br />\nacross the back of his shirt-waist, lying in a faint on the :floor, and by him a<br />\nbroken rattan.<br />\nOne afternoon of the following week, the school-room door was opened,<br />\nand Gordon Chapman, four blue bruises across his face, walked somewhat uncertainly up the aisle, under the wondering gaze of his schoolmates.<br />\n\"Mr. Lindsay,\" he said, as strongly as he could, \"I'm not coming here<br />\nany longer to school, but I'll never forget you; and as soon as I am able I am<br />\ngoing to kill you.\"<br />\nAs he strode down the aisle, now with a manly step, and passed out the<br />\ndoor, no one made a sound except that a little red-haired girl cried softly, \"0<br />\nJordie, Jordiel\"<br />\nEight years had passed since Gordon Chapman had made his promise to<br />\nRoger Lindsay; the great Civil War was just beginning, and many tented<br />\ncities, peopled with Virginia's sons, both young and old, had sprung up as in<br />\na single night. It was about five o'clock of a warm August afternoon; a boy,<br />\nnot quite grown, wearing the uniform of a Confederate private, was riding<br />\nslowly along the wooded road, singing an old love song. Presently he stopped<br />\nsinging and began to calculate.<br />\n\"Let's see, three days' leave, beginning at noon to-day. I'll get to Charlottesville to-night, and that'll give me all day to morrow and half the next day<br />\nthere. Gee! I'm a lucky dog. Al! that time with Bab.\"<br />\nThen he let his horse walk slowly along, while he sat lost in silent thought,<br />\npaying not the least attention to animal or road. Probably he was dreaming<br />\nof Bab, for when he spoke again it was to ask himself slowly, \"I wonder if<br />\nshe's changed much since spring. Yes, I reckon she's grown up entirely now,<br />\nor she wouldn't be writing so much about that Major. Wonder who he is,<br />\nanyhow?\"<br />\nAnother pause, and then in a decided tone, \"Don't think I like him.<br />\nHello! There's somebody ahead. Get up, Bill.\"<br />\nThe man ahead slowed his horse at the sound of a stranger's voice, and<br />\nhalf turned in his saddle to greet him. Evidently he did not recognize the newcomer, however, for instead of speaking to him he sat silently gazing at him;<br />\nbut the young man approached nevertheless with a polite \"Good evening, sir.\"<br />\n\"Good evening,\" answered the other shortly, yet not disagreeably.<br />\nAt the sound of the man's voice, the boy reined his horse back sharply,<br />\nand cried in a tone of surprise, \"Oh! I didn't know it was:you!\" Then, after<br />\na moment's hesitation, he spurred his horse nearer, and said, Mr. Lindsay—\"<br />\n\"Major Lindsay,\" corrected the other somewhat haughtily, in a tone that<br />\nbetrayed no recognition.<br />\n\"Well, Major Lindsay then, I'm Gordon Chapman. Do you remember<br />\nme?\" Then there was a slight tremor in his voice as he continued, \"And do<br />\nyou remember what I told you the last time we saw each other?\"<br />\n\"Yes,\" answered Lindsay in a manner that indicated his reluctance to<br />\nbelieve that what Gordon said was true.<br />\nyou waive your rank and fight, then? I must keep my promise.\"<br /><br />\nTHE NEWS—LETTER.<br /><br />\n3<br /><br />\n\"Yes.\" This time the tone was that of a man assenting to an unpleasant<br />\nproposition.<br />\nThey fired several shots before dismounting, and several more after reaching the ground, the width of the road between them, but neither was hurt, for<br />\nboth were students, more used to books than bloodshed. Then Major Lindsay<br />\ncalmly put up his pistols, and declared his cartridges gone. \"We can finish<br />\nWith swords, though,\" he suggested.<br />\n\"I have no sword, but we can finish with what God gave both of us—<br />\nfists,\" Gordon replied excitedly. He was eager for the fight,—the fight he had<br />\nfought many a time in his imagination.<br />\nThe match was not an even one, for it was still a man against a boy; the<br />\nman, thirty-three years old, strong with the strength of a man nearing his<br />\nPrime; the boy, a mere stripling, one who had always cared more for books<br />\nthan play.<br />\nWhen Major Lindsay rode off, he was cursing \"the little fool\" for making<br />\n\"do<br />\nhim<br />\nit whether or no;\" and Gordon was slowly and painfully rising from<br />\nthe trampled ground, at the same time promising himself that \"next time\"<br />\nthings would be different.<br />\nIn war-time a battered face passes without any questions; so by eight<br />\no'clock, Gordon found himself where he had been again and again in fancy—<br />\nseated by Bab, in the moonlight, on the old stone steps with the big urns leading down into the garden. One thing, however, was not as it was wont to be<br />\nin Dreamland. There he was softly telling Bab that he was a man now, the<br />\nwar had matured him quickly, and that she was his Bab. Then he would tell<br />\nher how she had been his Queen from his first school days, when she had fought<br />\nLindsay for him, clear up to his University years, and that it was for her that<br />\nhe was working so hard, working that he might lay some laurels at her feet.<br />\nBut now the war was on and he might never win those laurels; so he must lay<br />\nhimself at her feet, and beg her to take him as he was. And then Bab had<br />\nalways laid her head on his shoulder and called him \"her own, own Jordie,\"<br />\nand then he had always kissed her. But now Bab was saying, \"Jordie, you<br />\ndear old boy, I've got a secret for you. Maybe its the last one we'll have<br />\ntogether, so listen now, and don't you tell a soul. I'm engaged. You're the<br />\nonly one that knows it. Jordie, it's to Major Lindsay, and he's lots nicer than<br />\nhe used to be. Oh! I do love him, and you are going to like him for me. 0<br />\nJordie, if you only knew how I love him.\"<br />\nWhen Gordon reported to his captain, there was still a day and a half of<br />\nunexpired leave to his credit.<br />\nTwo days later there was a great battle. A whole day it raged, and when<br />\nnight fell, it seemed as if the Confederate army had been scattered to the four<br />\nwinds of Heaven. In the reports, both Lindsay and Gordon were reported<br />\nmissing; but the second day after the battle Major Lindsay, wounded in the<br />\nShoulder, made his way into camp, mounted on Gordon's horse. The next<br />\n‘rePorts contained M ,jor Lindsay's name among the \"Found,\" and among the<br />\n'Dead\" was the name of Gordon Chapman.<br />\nLindsay had to be taken to Charlottesville, to the hospital there, and Bab<br />\nnursed him. There, one evening he told Bab, \"Bab, you got the wrong man.<br />\nChaprnan was worth ten of me. If it hadn't been for him, I'd 've been where he is<br />\nnow. He died so I could get back to you; when he died he was singing sort of<br />\nto himself,'How I love him, how I love him, if you only knew how I love<br />\nhim•\" And just before he died, he whispered to me,'That's what she told me<br />\nabout you, and it won't go out of my head.' Then he went on singing slower,<br />\nand more softly, and finally it just faded away altogether.\"<br />\n,<br />\nThere was not a sound except that a tall red haired girl was crying softly,<br />\n0 Jordie, Jordie.\"<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br />\nNINETY-TWO'S DECENNIAL.<br /><br />\nN the evening of April the twelfth, twenty-six members of this ten-year<br />\nold class gathered at the Johns Hopkins Club on Park Avenue in their<br />\nTenth Annual Reunion. The attendance was not confined to Baltimore<br />\nmen. Flying trips from Florida, Ohio, New York and Pennsylvania were made<br />\nby those who felt they could not let this particular reunion go by without being<br />\non hand. They were busy men, but each made a personal sacrifice to be present, and planned the trip weeks in advance.<br />\nThe committee provided an elaborate menu, some good \"coon\" music and<br />\njust a little \"free licker,\" and everybody enjoyed a jolly good evening. There<br />\nwere no set toasts, the speechifying being very informal and every one taking a<br />\nhand, as the notice read, in singing a song, telling a story, or doing some other<br />\n\"stunt.\"<br />\nIt has been often asked how the class has succeeded in keeping up its annual reunions, and what brings men hundreds of miles to attend a class dinner.<br />\nThe reason is probably not very hard to find and dates back to the year of<br />\ngrace 1889, when a right fresh lot of candidates succeeded in worrying through<br />\nthe matriculation examinations of the J. H. U., or enough of them to permit<br />\nattendance on the college courses and the class meetings. The latter were not<br />\nmere matters of form, but were lively red hot meetings where every man had<br />\nhis say and through which all class organizations and affairs were activily con<br />\ntrolled and governed.<br />\nCliques were unknown among us; the democratic rule of the class meeting<br />\nwas a real one and unfettered. This state of affairs naturally encouraged a general participation in all class matters. Was a scrub team needed to practice the<br />\nfoot ball team? They turned out almost en masse, with coats inside out in lieu of<br />\ncanvas jackets (some with pants ditto), and lent a hand in withstanding the<br />\nrushes of the regular team. Did one of the fellows get into trouble with the<br />\nfaculty in his efforts to enliven the hours of L. E. P.*? His name could not be<br />\nobtained from any of his classmates, and the whole affair was finally a closed<br />\nincident, largely through the efforts of a class committee duly selected to take<br />\nthe matter up with the faculty, and who pledged, in the event of immunity<br />\nfrom punishment to the offender, the honor of the class against a repetition of the<br />\noffense. Was it a class book to publish? Studies were not allowed, even among<br />\nthe honor men, to interfere with their participation in the arduous duties of the<br />\neditorial staff.<br />\nThe literary and other contributions were numerous, and as a result of a<br />\nhearty and earnest co operation the class points with pride to its \"Hullabaloo,\"<br />\nthe first class book hearing that name, which, by the way, has since been the<br />\nsynonym at Hopkins for class book.<br />\nEnough has been said to make the point that the old class spirit and good<br />\nfeeling, which the former inter-class athletic contests did much to strengthen,<br />\nhad formed after three years a bond of something more than the ordinary ties<br />\n* \"L. E. P.\" was the current abbreviation in the last century for Dr. Griffin's course in<br /><br />\nO<br /><br />\nLogic, Ethics, and Philosophy.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n5<br /><br />\nof classmates, and at the graduation dinner the sentiment .was commonly expressed that those present were bound together by associations they could not<br />\nbear to sunder.<br />\n\"The Annual Reunion of '92\" with hour and place added, is the brief notice sent yearly to each class man. He has been to previous gatherings and needs<br />\nno bill of particulars. He knows there awaits him a delightful evening of communion with those who were his constant associates at the University in studies,<br />\nathletics, \"horse-play\" and everything else that was \"doing\" in the three years<br />\nof the college life.<br />\nWith is teachers and 10 engineers, the class is made up of a baker's dozen<br />\neach of lawyers and doctors, four merchants, two men in the government employ, a preacher, an editor, an insurance man and McKay. McKay is variously<br />\nreported as a missionary among the Utah Mormons, a plain citizen in their<br />\nmidst who has placed his limit at but one wife, and as a backslider who has<br />\nYielded to the temptations of his surroundings and taken unto himself a plurality<br />\nof consorts. The writer frankly states that he believes these rumors to be all<br />\nequally unreliable and hopes that some one who knows will write to the editor<br />\nof the NEWS-LETTER and relieve the uncertainty surrounding McKay's location,<br />\nvocation, and domestic tastes.<br />\nAbout one.half of the class is married (one wife each) with two about to<br />\nrenounce celibacy, and the outlook is favorable for a continued accession to the<br />\nranks of the benedicts.<br />\nThe remarkable record of but one death, which occurred at the very outset<br />\nof our career, we trust will not be altered for many decades.<br />\nWhile an unusually large proportion of the men have already achieved success from the worldly standpoint it is our proudest boast that every man, in his<br />\nparticular pursuit and sphere, is making a worthy and honorable record.<br />\nVery many of the readers of the NEWS-LETTER are undergraduates who<br />\nhave all their reunions to look forward to. The class of '92 sincerely hopes<br />\nthat its own record in this line will induce every class of our Alma Mater to<br />\nThe social and pleasurable side of these gatherings<br />\nemulate its example.<br />\ndwelt upon. As much might be said of their<br />\nexclusively<br />\nhave been almost<br />\nThey make us better men, and better and more<br />\nrespects.<br />\nother<br />\nhelpful side in<br />\nJ.<br />\nU.<br />\nH.<br />\nloyal sons of old<br />\nA word as to our organization, in conclusion, might be helpful to other<br />\nclasses: Selecting two men who had filled the respective offices in our undergraduate days and were willing to shoulder the recurring duties of their<br />\npositions, they were elected Perpetual President and Permanent Secretary,<br />\nrespectively, of the class organization, and upon them practically rested the<br />\nresponsibility of the successive annual gatherings.<br />\nOriginally, a committee existed for this purpose, but to it gradually attached<br />\nthe prefix \"useless,\" and it drifted by easy stages into the realm of \"innocuous<br />\ndesuetude,\" whence, after a decade's sojourn, it was summoned to lend a hand<br />\nin the preparations attendant upon our greatest reunion, the '92 Decennial.<br /><br />\nLESTER L. STEVENS, '92.<br /><br />\nTHE NEWS—LETTER.<br /><br />\nTHE NEWS-LETTER.<br />\nPublished Fortnightly during the University Year by the Students of THE JOHNS<br />\nHOPKINS UNIVERSITY.<br /><br />\nAPRIL 23, 1902.<br />\nSubscription $l.0 per year.<br /><br />\nEditor in Chief<br />\n.<br />\nAssociate Editor in Chief,<br />\nNews Editor,<br /><br />\n10 Cents a single copy.<br /><br />\n.<br /><br />\nAthletic Editors,<br /><br />\nROBERT S. LANIER, 1903.<br />\n. HARRY K. TOOTLE, 1903.<br />\n•<br />\nSOLOMON BLUM, 1903.<br />\nGEORGE A. FOSTER, 1904.<br />\n( REGINALD S OPIE, 1904.<br />\nW. S. BIRD, 1903.<br /><br />\nBusiness Manager,<br />\nAssistant Business Manager,<br /><br />\nAUBREY PEARRE, JR., 1902.<br />\n. HARRY BAETJER, 1903.<br /><br />\nAssistant News Editors,<br /><br />\nAddress all articles, communications, etc., to ROBERT S. LANIER, box 374, Johns Hopkins University, Baltimore, Md.<br />\nSubscriptions and business communications should be sent to AUBREY PEARRE, box 483,<br />\nJ. H. U.; or box 398, Medical School of Johns Hopkins Hospital.<br />\n110•011•11111•1=111111•MININIIIIIIIMININIW<br /><br />\nt<br /><br />\nHE article on \"Ninety-two's Decennial,\" appearing elsewhere in this issue,<br />\ngives much food for thought to every class at the University, and, perhaps, to some that have graduated. '92 is alone among the older Hopkins classes in her proud record of an unbroken line of well-attended class reunions. The story of how she did it should be beneficial to all other aspiring classes,—especially when the tale is told by one so well qualified as Mr.<br />\nStevens, who is the \"Perpetual Secretary\" referred to in his article.<br /><br />\nO<br /><br />\nN another page is found the voice of a dissenter to the plea which appeared<br />\nin our last issue for an honor system in Hopkins examinations. How<br />\nfar this represents the sentiment of the student body it is impossible at<br />\npresent to say, and it will be impossible until such sentiment is sounded. A<br />\nplan suggested is a personal canvass of the three classes by their respective<br />\nsecretaries, the report to be handed in to the presidents of the classes, who shall<br />\nform a committee with power to count the votes and decide the majority. It is<br />\nunderstood that this first vote will be merely a \"yes\" or \"no,\" for or against<br />\nthe adoption of an honor system in the collegiate department of the University.<br />\nAction in the matter is expected before the next issue of the NEWS—LUTTER.<br /><br />\nTHE NEWS—LETTER.<br /><br />\n7<br /><br />\nHE lacrosse situation is in that pleasing but uncertain state where speculation runs riot for want of facts to check it. Pennsylvania, Hobart, and<br />\nHarvard have fallen victims to our deadly team-work; and, in the words<br />\nof the rooters, \"Columbia is another bait.\" With Lehigh and Swarthmore,<br />\nhowever, there is a different tale to be told. By means of the easy but deceitful<br />\ncomparison of scores, an easy victory may be prophecied for the Black and<br />\nBlue; Hobart, one of our \"easy marks,\" beat Lehigh 5-3, and our victory over<br />\n1, compares well with Swarthmore's, 8-3. But there is good auHarvard,<br />\nthority for distrusting this kind of evidence. Lehigh is an old lacrosse college;<br />\ntwo weeks of outdoor practice, with alumni coaching, will produce a team far<br />\ndifferent from the one that went under to Hobart. And as for Swarthmore—<br />\nthere is last year's story. The splendid capabilities shown by the'02 team will<br />\nall be called forth before it can sign itself \"Unconquered.\"<br /><br />\nz<br /><br />\nT is a custom with most of the leading colleges throughout the country that<br />\nthere should be published, in the college paper, the reports of the managers<br />\nof the various teams, the musical organizations, etc. In accordance with<br />\nthis custom, there is printed elsewhere in this issue the financial report of the<br />\nMusical Clubs for the past season. Good management, economy, and hard<br />\nWork are required to pull the organization through a season without leaving<br />\nbehind a trail of debts. It is pleasing to notice that the credit end of this year's<br />\naccount was helped materially by the splendid support given the Clubs at the<br />\nBaltimore Concert by the Hopkins students themselves,—a support which was<br />\na fine example of loyalty to a college institution, and deserves to be repeated.<br />\nThe non-serious side of the Musical Clubs is so much brought out that<br />\ntheir actual raison d'etre is often forgotten. On the scholastic side, our University needs no advertising. On the athletic side, our credit for hard work<br />\nand fine achievements is known abroad. But there are many, at our very doors,<br />\nwho need to be told that attention is paid here, not only to the cultivation of<br />\nthe mind, not merely to the improvement of the body, but also to the development of sociability and congeniality,—all that goes to make up \"college life.\"<br />\nTo all such the Musical Clubs have a mission to fulfil,—and especially now,<br />\nWith the approaching growth in importance of our undergraduate body.<br /><br />\n3<br /><br />\nTo the Editor of the NEWS-LETTER:<br />\nAn article appearing in your last issue entitled \"The Honor System\" has<br />\ncaused considerable comment among the students. Having discussed the question with graduates of other colleges as to the conditions prevailing in their respective schools, and being in touch with the workings of our collegiate department, I feel that I must dissent from the views expressed in the above mentioned article.<br />\nIn the first place, there is no need at Hopkins of any so-called system.<br />\nWe are fortunate to have obtained the distinction of being a college where there<br />\nexists among the students a high sense of honor. Elsewhere men for some<br />\nmysterious reason do not deem it dishonorable to cheat at examinations, nor<br /><br />\nTHE NEWS-LETTER.<br />\ndo they condemn their classmates who do cheat. At Hopkins there is little or<br />\nno cheating done in examinations, and those men who do it are looked down<br />\nupon by the whole student body.<br />\nSecondly, if there were such corruption here, would an \"honor system\" be<br />\nadvantageous? If a man thinks it not wrong to secure aid in his examinations,<br />\nwould he have such a fine sense of honor as not to lie about it? I think the<br />\nremedy inadequate.<br />\nFurtherfnore, despite the precedents at other universities, there is, I think,<br />\na tendency to lessen a man's self respect, if he must add his oath to every statement he utters. I for one would consider it an insult, if I were asked to sign<br />\nany pledge like the one suggested.<br />\nAn \"honor system\" is not needed by us, because we have a high standard<br />\nof moral sense; and those \"black sheep\" that would be inclined to cheat are<br />\ndeterred from so acting for fear of losing the respect of their classmates. If<br />\nsuch a pledge were introduced, it would lessen the dignity of our student body,<br />\nand prove inefficacious in remedying any possible evil.<br />\nYours sincerely,<br /><br />\nRoss<br /><br />\nMILItS<br /><br />\nDIGGS, 1902.<br /><br />\nDR. GILMAN'S TRIP TO EUROPE.<br /><br />\nR.<br /><br />\nGILMAN sailed from New York last week for Europe. He goes partly<br />\nfor recreation and primarily in the interests cf the Carnegie Institute.<br />\nDr. Gilman will visit the great British and Continental Universities, in<br />\norder to acquaint himself with their methods. Speaking of his trip, Dr. Gilman<br />\nsaid:<br />\n\"I anticipate a very pleasant journey, and hope in my visits to the several<br />\neducational centres of the Old World to lay hold on some new ideas, new inspirations and improved methods for the management of an institution designed<br />\nfor the higher education of Americans. The lines upon which the Carnegie endowment has been planned make it essential that all the knowledge possible on<br />\nthe subject should be at our disposal, and for this reason my instructions are to<br />\nvisit every university in Europe and seek to ascertain the special elements of<br />\nits strength.''<br />\nDr. Gilman will not return until October.<br /><br />\nW. J. Bryan, '03, has been elected assistant manager of the musical clubs.<br />\nThe Hullabaloo Club has adopted a brief constitution. The Board of Governors is to be self-perpetuating, each member choosing his own successor, with<br />\nthe approval of his colleagues.<br />\nThe first \"smoker\" of the club, held in the Trophy Room on the evening<br />\nMonday<br />\nlast, was attended by almost the whole class, and was a splendid<br />\nof<br />\nsuccess.<br /><br />\nTHE NEWS—LETTER.<br /><br />\niminiiiituinflommuronimionimmumummiiliimmiininnimiquonumonimniwituatuniffilimmtomoilommiumfinimuthm<br /><br />\n111110111111111111111111111111111P11011111111/11111111111101 I 1111111111<br /><br />\n111111111111110 I IPIIIIIIIIIIIII1111/111111111111111Maifill;hiZA<br /><br />\nOn the afternoon of the r5th Dr. Jacob H. Hollander lectured before the<br />\nArundell Club, on the present conditions in the island of Porto Rico The<br />\nlecture was illustrated with many excellent stereopticon views.<br />\nAfter several weeks' postponement, Dr. Woods delivered his lecture on<br />\n\"Liquid Air,\" April ro. Having a large amount of liquid air, he was able to<br />\nshow many interesting experiments. A large audience of students and strangers packed the physical lecture room.<br />\nDr. James N. Schonler, of Boston, is delivering a series of four lectures on<br />\nthe general subject, \"The Life of the People During the Revolution.\" The<br />\nlast lecture will be delivered on Friday, the 25th. Dr. Scholller is best known<br />\nas the author of \"History of the United States Under the Constitution.\"<br />\nIn a short time a fifty foot steel tower will be erected on the Weather<br />\nBureau building. The tower, which will be surmounted by a wind vane, will<br />\nbe higher than the City College.<br />\nMr Frederick I„ Olmsted delivered a lecture in McCoy Hall, last Saturday night, on \"The Plan for the Improvement of the City of Washington.\" The<br />\nlecture was delivered under the auspices of the Municipal Art Society.<br />\nAt the banquet of the Baltimore Alumni Association of the University of<br />\nVirginia, held at the Stafford Hotel on April ro, President Remsen responded to<br />\nthe toast, \"Our Sister University.\" A number of other Hopkins men were in<br />\nattendance.<br />\nThe Hopkins Board of Trustees has received a valuable addition in the five<br />\nnew trustees, who were elected at a meeting on the 7th of this month, to fill the<br />\nvacancies caused by the deaths of Messrs. C. Morton Stewart, Benjamin F.<br />\nNewcomer, J. H. Pheasants, and Dr. James Carey Thomas, and by the resignation of Mr. James L. McLane. The new trustees are Mr. Brent Keyser, Mr.<br />\nBlanchard Randall, Mr. Theodore Marburg, Mr. Bernard N. Baker, and Mr.<br />\nFrancis M. Jencks. By the influence and position of these gentlemen, it is<br />\nthought that the interests of the University will be materially furthered.<br />\nCompetition for the Tocqueville gold medal is now open. This medal is<br />\nannually given by Baron de Coubertin, of Paris, to the University to be awarded<br />\nto that student \"who shall have written the best essay on some subject illustrating any phase of French history, political or social, from 1815 to 1890, or a<br />\nreview of some important historical work published in France since 1890.\"<br />\nThe essays, which are to be from 8,000 to i6,000 words long, must be sent to<br /><br />\n10<br /><br />\nTHE NEWS—LETTER.<br /><br />\nthe Registrar before the first of May. The award will be announced on Commencement Day. Only once has the medal been awarded,—to J. E. Routh,<br />\n'oo. The present competition is looked forward to with great interest.<br />\nOn the shelves of \"New Books\" is to be found a recently published work<br />\nby Dr. J. C. Ballagh, of the Historical Department, entitled \"A History of<br />\nSlavery in Virginia.\"<br />\nPresident Rernsen was in New York on Saturday last, attending the in.<br />\nauguration of Dr. Nicholas Murray Butler, president of Columbia. Among<br />\nother Hopkins men with him was Mr. Nicholas Murray, librarian of the University, who is a near relative of President Butler.<br /><br />\nTHE HULLABALOO ELECTIONS.<br />\nOn Thursday, the seventeenth, the Junior class held an election to select<br />\neditors for the 1903 \"Hullabaloo.\" It was a hot one. Almost every office<br />\nwas fought for with a grim determination, showing that every one was in earnest. Those chosen were: Editor in-chief, R. S. Lanier; Associate Editor.inchief, H. K. Tootle; Associate Literary Editors, C. M. Sparrow, G. D. Strayer,<br />\nT. W. Glocker, J. M. Combs, W. M. Hunley, J. A. Addison; Art Editors, J.<br />\nAlan Houghton, Wilton Snowien; Business Manager, W. S. Bird; Assistant<br />\nBusiness Managers, P. R. Straus, F. Hazlehurst.<br />\nOn the whole, it is a splendid board, and should uphold the reputation of the<br />\nJunior class—no easy task, as the editors will find to their cost.<br /><br />\nHOPKINS IN CIVIC STRIFE.<br />\nA.<br />\n,<br />\n,s M. THOMSON,'97, one of the founders of the NEWS-LETTER, and<br />\na member of its first staff, is at present engaged in a thrilling fight with<br />\nthe gamblers and Sunday liquor-sellers of Norfolk, Va., in his capacity<br />\nas editor of the Norfolk Dispatch. Mr. Thomson, who went into the newspaper<br />\nbusiness on his graduation from the University, has been remarkably successful<br />\nduring his two years charge of the Dispatch, doubling its size and its circulation.<br />\nA sudden snag was struck, licwever, in this crusade against the law-breakers of<br />\nNorfolk. A prominent crook known as Napoleon Joynes, whom Mr. Thomson had referred to as \"the Napoleon of the joints,\" secured the aid of two<br />\ntrusty thugs, and made a personal assault upon the editor and members of his<br />\nstaff, threatening to break up the paper unless retraction of the epithet was<br />\nmade. The plucky editor's reply was to arrest the assailants and have them<br />\nbound to the peace, to obtain permission from the judge to carry arms, and to<br />\nprosecute his fight with renewed vigor.<br />\nMany expressions of sympathy with Mr. Thomson, and encouragement in<br />\nfight he is putting up, have reached the NEWS-LETTER staff, all of<br />\nlively<br />\nthe<br />\nunqualifiedly proud of their predecessor. The issue of Mr. Thomfeel<br />\nwhom<br />\nis awaited with interest, and his success is hoped for by every<br />\ncrusade<br />\nson's<br />\nstudent in the college.<br /><br />\n3<br /><br />\nTHE NEWS—LETTER,<br /><br />\n11<br /><br />\nSCHEDULE OF ATHLETIC EVENTS.<br />\nLacrosse.<br />\nAPRIL 25, Lehigh at South Bethlehem. (Championship Game.)<br />\nMAY, 3, Columbia University at Baltimore.<br />\nMAY 10, Swarthmore at Baltimore.<br />\nPlace of playing home games will be announced later.<br /><br />\nBaseball.<br />\nAPRIL 26, Maryland Agricultural College at College Park.<br />\nMAY 3, Open.<br />\nMAY<br />\n7, Georgetown in Baltimore.<br />\nMAY 10, Western Maryland at Westminster.<br /><br />\nTrack and Field.<br />\nAPRIL 26, Spring Relay Races, University of Pennsylvania.<br />\nMAY 17, J. H. U. Open Scratch Games at Electric Park.<br /><br />\nHOPKINS 12, HOBART 1.<br />\nis the one word which most aptly describes the whole situation<br />\n44INCH!\"<br />\ne<br />\nat the American League Park on April 12. Hobart College came here<br />\nfor the first time from Geneva, N. Y., with quite a reputation, having<br />\nbeaten, during the same week, Lehigh, 5-3, and Pennsylvania, 2- 0. Hopkins<br />\nvery naturally expected a lively struggle in the opening game, but, -as some one<br />\nsaid after the contest, \"it was like robbing a child's bank.\"<br />\nJudging from the game which the visitors put up during the two twentyminute halves, it will always be a mystery how they ever defeated Lehigh or<br />\nPennsylvania. Some said that they were overtrained, the contest in Baltimore<br />\nbeing the last on their Southern trip. There is possibly a little in this, but the<br />\nwork of the team in general was decidedly off color. The stick work was<br />\nextremely poor, exhibitions of team play were few and far between, and all the<br />\nmen lacked ginger and snap. Hopkins, on the other hand, gave the loyal band<br />\nof rooters present abundant opportunities for all-around handshaking.<br />\nThe men started off on the jump, and in thirty seconds little Bernheim<br />\ndrove the ball in the cage. Putts soon followed suit, and by the end of the<br />\nhalf, the score stood 7 to 0 in Hopkins' favor. During these twenty minutes,<br />\nAbercrombie was always at the right spot with both feet, and the rest of the<br />\nattack ably assisted him. The few chances which the defense got to feed on<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nthe ball found it quite equal to the occasion, and the attack generally had the<br />\nsphere returned to them in short order.<br />\nBetween the halves Coach Abercrombie and Captain Schmeisser impressed<br />\nupon the team the great value of the practice which might be gotten out of the<br />\nlast half. The attack were instructed to pass carefully, and to see that every<br />\nman got in the team play necessary for the advancement of the ball. Five<br />\nmore goals resulted. About the middle of the half, Hobart got one of her few<br />\nchances to shoot. The ball struck the goal post, and, as it bounded out, the<br />\ninhome man scooped it in the net. One of the Hobart players is reported to<br />\nhave shouted in an ecstacy of delight: \"We got a goal!\" And he may well<br />\nhave shouted, for Hobart was clearly outplayed all around throughout the<br />\nentire game.<br />\nAlthough early in the season, the Hopkins men all seemed to have very<br />\ngood powers of endurance. This is, indeed, a matter of congratulation, for had<br />\nwe been equal in strength last season to Swarthmore, we should certainly have<br />\nwon the championship of the United States. With this in our favor, we should<br />\ncertainly give our victors of last season a \"warm reception\" on May 10. The<br />\nline-up against Hobart College was as follows: Putts, inhome; B. Bernheini,<br />\nouthome; Sayler, first attack; Bird, second attack; P. Bernheim, third attack;<br />\nAbercrombie, center; Tough, third defense; Blanck, second defense; H.<br />\nStraus, first defense; E. Schmeisser, cover point; W. Schmeisser (Captain)<br />\npoint; Briscoe, goal.<br />\nOur alumni delegate, Dr. B. B. Lanier, acted as referee.<br /><br />\nOUR VICTORY OVER HARVARD.<br />\nHE decisive victory of our lacrosse team over Harvard on April igth came<br />\nsomewhat as a surprise, for, although we hardly looked forward to a defeat, still a close game was expected and the score of II to L was a matter of hearty congratulation.<br />\nOur victory over the Cambridge team last season was gained by 4 goals to<br />\n0, and it is well known that lacrosse is steadily gaining ground at Harvard.<br />\nThat we were going to meet a stronger team than that of last season we felt<br />\nassured. The only inference to be drawn, therefore, is that Hopkins is decidedly stronger this year.<br />\nIt took very little time after the beginning of the game to see that Hopkins was pursuing her old policy of trying to score first and gain a comfortable lead in the first half. Every man went in on the jump, and in less than<br />\nthree minutes Putts placed the first goal in the net. This seemed to start the<br />\nball, and by the end of the half, the score stood 8 to 0 in Hopkins' favor. Such<br />\na condition of affairs was indeed a surprise to the Hopkins, for in the Hobart<br />\ngame of a week before, only ;7 goals were made in the first half, and Harvard<br />\nwas considered much stronger than Hobart. In the second half, Harvard<br />\nchanged her goal keeper, and Henry Straus retired on account of a wrenched<br />\nankle which he received in the first half. Both changes proved a decided disadvantage to Hopkins. Harvard's new man was decidedly better than the<br /><br />\nTHE NEWS—LETTER.<br /><br />\n13<br /><br />\nfirst, who, by the way, had been wired to come to Baltimore from Cambridge<br />\nespecially for the game here. The absence of Straus was also keenly felt, for<br />\nhad he been in the game it is hardly likely that Alvord would have been left<br />\nuncovered to shoot the only goal which Harvard scored.<br />\nThe visitors seemed to be in very good condition, but were unable to break<br />\nup the fast team play which Hopkins exhibited at every stage of the contest.<br />\nSeveral of the goals were made strictly in accordance with the theory of the<br />\ngame, the fourth one passing to and from every man on the attack. The play<br />\ncalled forth hearty applause from the spectators.<br />\nHopkins lined up as follows: Putts, inhome; B. Bernheim, outhome; Say.<br />\nler, first attack; Bird, second attack: P. Bernheim, third attack; Abercrombie,<br />\ncenter; Tough, third defense; Blanck, second defense; Straus, first defense;<br />\nE. Schemeisser, cover point; W. Schemeisser, point; Briscoe, goal.<br />\nMr. Henry Penniman, an old Hopkins lacrosse player, acted as referee.<br />\nNext Saturday, the team plays the first of the championship games against<br />\nLehigh, at South Bethlehem, Pa. The team leaves town about one o'clock<br />\nFriday afternoon and will probably return Saturday night or Sunday morning.<br />\nSeveral loyal rooters will go along and we hope all those who can possibly do<br />\nare<br />\nso will join the little band. A rousing good time is expected. \"The boys<br />\nbody.<br />\nstudent<br />\nthe<br />\nout for the championship,\" and need the support of<br /><br />\nTRACK AND FIELD.<br />\nthe<br />\nOR the past week Captain England of the track and field team has had<br />\nwhich<br />\nmen hard at work in preparation for the annual spring relay races<br />\nare to be held April 26th by the University of Pennsylvania. Four silk<br />\ndurbanners in the trophy room show what Hopkins has done in this direction<br />\ning the past four years. We have a strong team this season and should add<br />\nCaptain<br />\nanother pennant to the collection. The team entered is composed of<br />\nCron<br />\nLe<br />\nHoffman,<br />\nC.<br />\nR.<br />\nRiggs.<br />\nand<br />\nLindsay,<br />\nJr.,<br />\nHoffman,<br />\nEngland, W. E.<br />\nand Rosenheim are showing up well as substitutes.<br />\nBesides the race at Pennsylvania the track men also have in view the open<br />\n17.<br />\nscratch gatnes which are to be held by Johns Hopkins at Electric Park on May<br />\nsilhandsome<br />\nthe<br />\nand<br />\n,<br />\nMaryland<br />\nof<br />\nship<br />\nchampion<br />\nthe<br />\ndecide<br />\nwill<br />\nThe games<br />\nver loving cup offered by the Baltimore News some years ago will again be open<br />\nto competition. The terms under which the cup is offered is that it shall he the<br />\nHopproperty of the organization winning it three times in open competition.<br />\ncoming<br />\nthe<br />\nin<br />\nvictorious<br />\nif<br />\nand,<br />\nmeets,<br />\ntwo<br />\nat<br />\nthe<br />\ntrophy<br />\nwon<br />\nkins has already<br />\ncontests, the prize will be hers.<br /><br />\n5<br /><br />\nThe committee in charge of the games held in the cage on April 5th reports<br />\na slight financial success. The date of the contests was most likely the chief<br />\nreason for the slim attendance. It was unfortunate that they could not have<br />\nbeen held earlier in the season.<br /><br />\n14<br /><br />\nTHE NEWS-LETTER.<br /><br />\nBASE BALL.<br />\nGETTYSBURG 9, HOPKINS 2.<br />\nT WAS to be expected that the strong Gettysburg College team would defeat<br />\nHopkins in the game of April 12th, but it was not so sure with l.r.:Av much<br />\ncredit our men would play. For a whole week previous, wet grounds<br />\nprevented any outdoor practice. Speaking broadly, the game was satisfactory<br />\nto the men, and a great improvement over that played at Annapolis. Five of<br />\nthe opponents' runs were the direct result of wild throws. Whipple was in<br />\nsplendid form, and gave only four clean hits and two scratches. It is doubtful<br />\nwhether Gettysburg earned more than one of the nine runs.<br />\n.<br />\nThe pitching on both sides was excellent, and one of the chief features of<br />\nthe game. Besides this, Moore's play at second base in blocking runners trying to steal, was beauti`ul to see. Moto, for Gettysburg, made the prettiest<br />\nhit of the game—a three bagger over McKnights' head.<br />\nTne fair weather of the past ten days has been made the most of by the<br /><br />\nJ<br /><br />\nteam. Practice has been held every afternoon, and more team work and confidence begins to manifest itself. It is more and more apparent that Hopkins<br />\nhas the material for a splendid team. What is needed is practice, and as soon<br />\nas the fielding reaches the standard of the pitching, every Hopkins man may be<br />\nproud of the team.<br /><br />\nNo game could be secured for April r 9, but on the 26th the team will play<br />\nthe Maryland Athletic Club at College Park. This should be a victory for<br />\nHopkins, and it is hoped that a number of rooters will go along to cheer.<br />\nThe Base Ball team has received from the Board of Editors of the 1901<br />\nHullabaloo, through its business manager, Mr. Harry S. .13 .rne, a gift of ,40.00,<br />\nA<br />\nto be used for new uniforms The officers of the team are all grateful for the<br />\ninterest that has been taken in its career, and are anxious to make a record that<br />\nwill please everybody. The men think that the worst game has been played,<br />\nand that better things are ahead.<br />\nTHE DEBATING ASSOCIATION.<br />\nGRATIFYING outcome of the present Hopkins spirit is the debating<br />\nassociation which has recently been formed. The object of this association is to prepare men to take part in the intercollegiate debates, and<br />\nto develop any talent in speaking which the men may have. The officers are:<br />\nHarvey B. Stone, president; G. D. Strayer, secretary. According to the constitution, which is now being drawn up, those eligible for membership are the<br />\neighteen men from the Senior .and the Junior classes who make up the class<br /><br />\n4<br />\nteams<br /><br />\nAu important power of the association is the conferring of \"H's\" upon<br /><br />\nthe speakers in the intercollegiate debates. In order to distinguish these<br />\n\"H's\" from those of the athletic association, they will be blue instead of yellow. The first rnAn upon whom the blue \"H\" will be conferred are Messrs.<br />\nStone and Plaggemeyer, the two presidents of the Senior and Junior classes,<br />\nwho represented the University in her late struggle with North Carolina.<br /><br />\n15<br /><br />\nTHE NEWS—LETTER.<br />\nREPORT OF THE MUSICAL CLUBS.<br /><br />\nHE concert season of the Johns Hopkins Glee, Banjo and Mandolin Clubs<br />\nis rapidly nearing completion, and as many questions have been asked<br />\nconcerning their financial standing, it was decided at a recent meeting of<br />\nthe organization to present to the student body a brief account of the expenditures and receipts for the year. To note each minor expense would be tedious<br />\nand uninteresting, so the following account has been curtailed as much as possible. As a whole the expenses have been reduced far more than ever before,<br />\nthough the expense column is still necessarily large.<br /><br />\nt<br /><br />\nJOHNS HOPKINS GLEE, BANJO AND MANDOLIN CLUBS<br />\nin account with EBEN C. HILL, MANAGER.<br /><br />\nSeason of 1901-4902.<br /><br />\nCR.<br /><br />\nDR.<br /><br />\nBy printing: 1000 posters, 2500 programmes, 3000 tickets, 500 patroness<br />\n$ 98 35<br />\nnotices, stationery, etc<br />\n$ 115.00<br />\nTo amount in Bank last year<br />\n100.00<br />\nBy<br />\n\" paid Athletic Association for training table<br />\n87.57<br />\nBy music: mimeographing, $32.30; sheet music, $55.27<br />\nBy professional services of Mr. L. C. Fischer, 28 rehearsals @ $2.00: ar69.76<br />\nranging of music $13.75<br />\nBy expense of Christmas trip to Charleston, W. Va., Winchester,<br />\n143.00<br />\nand Hagerstown, Md., not covered by concert receipts<br />\n96.00<br />\nTo receipts from caution money<br />\n47.00<br />\nTo receipts from minor charity concerts 520.00<br />\nTo receipts from Baltimore concert<br />\n803.00<br />\nTo receipts from Old Point concert.<br />\nBy expenses Baltimore concert not included above: for rent of Lehmann's Hall, $40; advertising, $21.00; ticket handling, $10.00; deco81.00<br />\nrating, $10.00.<br />\n16.00<br />\nTo advertisement in Baltimore Programme.<br />\n420,00<br />\nBy expense of Easter trip of six days, taking 36 men<br />\n78,00<br />\nTo amount from rooters taken on trip and to Richmond<br />\n13y amount paid back and amount yet to be returned to men less fines.... 87 00<br />\nBy incidentals: stamps $3.00, plate and photograph of cuts $7.50, opening<br />\n23.50<br />\nMcCoy Hall for rehearsals $9.50, telegrams, express charges, etc<br />\n10.00<br />\nBy W. B. Carver for prize song \"Our Alma Mater in Dixie Land\"<br />\n49,17<br />\nBy probable balance<br />\n$1169.00 $1169.00<br /><br />\nALUMNI.<br />\nMr. Henry Clay Miller, of the class of 1901, was married to Miss Katherine<br />\nFauntlery, of Stanton, Va., on April 8. On their return from the wedding trip,<br />\nMr. and Mrs. Miller will reside in Stanton.<br />\nR. I, McAll, 'oo, has accepted a position as organist in a church connected<br />\nwith the Brick Presbyterian Church, New York City. Mr. McAll will enter on<br />\nhis duties in October.<br />\nThe class of 1900 will hold an informal banquet at the Hopkins Club on the<br />\nnight of the 25th.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n16<br /><br />\nTHE PHI BETA KAPPA ELECTIONS.<br />\nN Friday last, the Johns Hopkins Chapter of the Phi Beta Kappa Fraternity elected, besides the usual seven Senior members, fifteen new members from the faculty and graduate schools. The list is as follows:<br />\nDr. Mervin T. Sudler of the medical staff, Dr. J. 13. Whitehead, '92, of the<br />\nstaff of the physical department, Dr. W. H. Hobbs, '88, Mr. E. J. Benton, Holton, Kan., history; T. H. Fowler, Chestertown, German; J. W. Harry, Dublin,<br />\nhistory; A A. Kern, Nashville, Tenn., English; C. F. Lindsay, Halifax, N. S.,<br />\nchemistry; C. E. Lyon, Baltimore, German; E. G. Martin, St. Paul, Minn,, i.<br />\nbiology; A. J. Morrison, Farmville, Va., romance languages; R. L. Ramsay,<br />\nFredericksburg, Va., English; Lee Raney, Danville, Ky., Greek; W. G. Seiple,<br />\nCatasauqua, Pa , Hebrew; W. S. Weedon, Baltimore, chemistry.<br />\n,/—...\" Those members of'02 entitled to wear the \"Key\" are C. A. Myers, Chas.<br />\n/ Markell, H. B. Stone, Samuel Wolman, A. G. Dew, D. I. Macht, and Solomon<br />\n/ Strouse.<br />\ni---..<br />\nThese officers were elected for the next year: President, Dr. A. Marshall<br />\nElliott; Viee.President, Dr. Paul Haupt; Treasurer, Dr. C. C. Marden; Secretary, Dr. J. E. Gilpin.<br />\nThe annual Phi Beta Kappa address will be delivered in McCoy Hall on<br />\nthe afternoon of Friday, May 2, by Prof. J. Makeen Cattell of Columbia; subject, \"Concerning the American University \" The banquet will take place the<br />\nsame evening in the Donovan Room.<br /><br />\nO<br /><br />\nHE—This new table tennis fad gives me a pain.<br />\nSHE—Sort of ping-pong pang, eh?--Exchange.<br /><br />\nGoonnov—What do you suppose will become of you when you die?<br />\nNAUTIBOY—That's a burning question.—Harvard Lamfioon.<br />\nA street Arab stood on a weighing machine<br />\nIn the light of a lingering day,<br />\nThen a counterfeit penny he dropped in the slot<br />\nAnd silently stole a-weigh.<br />\n—Smith Academy.<br /><br />\nThe Baltimore Infirmary of Osteopathy,<br />\n&amp;04 UNION TRUST BUILDING,<br /><br />\n'Phone, C. &amp; P. St. Paul 667-D.<br />\nBALTIMORE, MD.<br /><br />\nN. E. Cor. Charles and Fayette Sts.,<br /><br />\nOSTEOPATHY<br />\ni.i a scientific adjustment of the human anatomy, by mechanical manipulation, by which we remove any obstruction to the nerve and blood supply of<br />\nthe part affected, so nature can restore the part to its normal condition. We<br />\ntreat all diseases, but make a specialty of Chronic Diseases and special attention is given to DiSeinIOS of Women and Children. We will be glad to<br />\nhave YOU call and have a personal interview with regard to your disease.<br />\nConsultation and examination free to prospective patients. We mill be glad<br />\nto furnish any further information on application.<br />\nW. D. BOWEN, M. D., P.O.,<br />\nProst. &amp; Mgr.<br />\nESTABLISHED 1879.<br /><br />\nedditig Silver ohoilday<br />\ndAeoni elk<br /><br />\nin<br /><br />\nGREAT VARIETY.<br /><br />\n,LmNKINS9<br /><br />\nSilversmitbs•<br />\nherzderson's 3&amp;0'<br />\n210 N.<br /><br />\nRT.<br /><br />\nUNIVERSITY<br />\nBOOK STORE.<br />\nBooks, Note<br />\nBooks<br />\n—=--'41\"lent135upplies.<br />\nMadison&amp;HowardSts.<br /><br />\nMARIA BUIE, D. 0.,<br />\nV.-Prost. (11; Asst. Soffy.<br /><br />\nIi. MOMAINS, D. 0..<br />\nSec'y. &amp; Trees.<br /><br />\nJAMES R. Pants.<br /><br />\nTHILO. WARNER.<br /><br />\nNAT _A.<br /><br />\nNI<br /><br />\nR<br /><br />\nUMBRELLAS, HATTERS, CANES, ETC.<br />\nAg..nt for I IncnIn h [Sennett and<br />\nWalter Darnara's London lists.<br />\n824 NV EST<br />\nALT MORPI STREET.<br />\nManufacturers of<br />\nHOPKINS CAPS<br />\nSilk and Cassimere liats. gr<br /><br />\nRooItsevers and<br />\nCUSHING &amp; COMPANY<br />\n' Stat onors<br />\n34 W. BALTIMORE ST.<br />\nSCHOOL, LAW M 1010AL. CLASSICAL AND MISCCLLANSOU• 80ORS<br /><br />\nKeeps constantly on hand the Text Books used in folins<br />\nHopkins University and the Woman's College<br />\nof Baltimore.<br />\nSTATIONERY—For School, Family, Office and Bank.<br /><br />\nCertificate of Analysis from<br /><br />\nProfs. G. W. Lehman At Son,<br /><br />\nII. R. ElSENBRANDT SONS,<br /><br />\nSTIIBLER GO.701<br />\nfor<br /><br />\nto 705<br />\nj°RDRN<br />\nMADISON AVE.<br />\nReads as follows: Samples submitted of<br />\nn<br />\nti<br />\n--randy—no adulterants, no coloring,fine quality.<br />\n,.Porto Port<br />\n— absolutely pure, of superior quality.<br />\n2,\"errY—no coloring<br />\nor adulterants, absolutely<br />\ne wine.<br />\npu<br />\n'\"'\"<br />\nWhisk07—no Fusel<br />\nand<br />\nohi.<br />\noil, no caramel, strictly<br />\nOlive Oil<br />\n—all tests show pure olive oil.<br />\n.<br />\nst:o<br />\na ar—natural cider vinegar, strictly<br />\nlitl<br />\nige! fltc<br />\npure and<br />\nSitx a VI<br />\nMpicas—no adulteration, all strictly pure,<br /><br />\nMUSICAL INSTRUMENTS.<br />\nMUSIC, PIANOS, ORGANS.<br />\n201-203 N.CHARLES ST.<br />\nBALTIMORE, MD.<br />\nCharles T.Crane,<br />\nPresident.<br />\nCarter G. Osburn,Cashier.<br /><br />\nOtto H. Williams,<br />\nVice-President.<br />\nJ. E. Marshall, Asst, Cashier.<br /><br />\nFOR \"VERTISING SPACE IN THIS PAPER<br /><br />\nFARMERS &amp; MERCHANTS NAT'L. BANK,<br /><br />\nAPPLY TO<br /><br />\nSouth and Lombard Sts., Baltimore.<br />\nSurplus and Profits $450.000.<br />\nCapital. $650.000<br /><br />\nPEARRE E. CROWL COMPANY,<br />\nPUBLISHERS.<br />\nLIGHT AND LOMBARD STREETS<br /><br />\nBALTIMORE, MD.<br /><br />\nAccounts of Banks, Corporations, Firms and Individuals<br />\nsolicited. Facilities extended in accordance with<br />\nbalances and business responsibility.<br /><br />\nCOLLECTIONS A SPECIALTY.<br /><br />\nNORTH GERMAN LLOYD S. S. CO.<br />\nCABIN PASSAGE AT LOW RATES.<br />\nPor<br /><br />\nparticulars apply to<br /><br />\nA. SCHUMACFIER &amp; CO.,<br />\nGeneral Agents.<br /><br />\nCORRESPONDENCE INVITED<br /><br />\nNEW YORK TO BREMEN.<br />\nLONDON, PARIS,GIBRALTER.<br />\nNAPLES. GENOA. ETC.<br />\nBALTIMORE! TO BRCMEN<br />\nDIE2ECT.<br /><br />\nA. D. SMITH &amp; SONS.<br />\nFormerly<br />\nLEVERING &amp; SMITH,<br />\n104 WEST LEXINGTON STREET.<br />\nREADY TO WEAR HATS for Ladies, Mi8FICS<br />\nand (hildren.<br />\nIn the Latest DeMune.<br />\nMEN'S HATS—Derbys and Soft Felts.<br /><br />\nthe 1itran3oZmith<br />\npiano CO.<br />\n109 and 111 North Charles Stre(<br />\nSOLE AGENTS<br /><br />\ni/genfraz Yiudà<br /><br />\nCbtchertno, trabburp ant' Web<br /><br />\nSuccessor to Cummins<br /><br />\nARTISTIC PHOTOGRAPHY<br />\n20'West Lexington St.<br />\nSpecial Discount to Students<br /><br />\nHABERDASHERS.<br /><br />\nTHE BLAKE CO<br /><br />\nShirts, Neckwear,<br />\nUnderwear, Hosiery,<br />\nEtc.<br /><br />\ntassommommila1111111<br />\nON SALE<br /><br />\nBaltimore<br /><br />\nTHE J. H. U. PENNANTS,<br /><br />\nand all other College Pennants<br /><br />\n203 W. BALTIMORE ST. &amp; 2 S. LIBERTY ST.<br />\nBALTIMORE, MI).<br />\nMembeis of<br />\nNew York Stock Exchange<br />\nBaltimore Stock Exchange,:<br />\nChicago Board of Trade .<br /><br />\nClinton P. Paine<br />\nGordon P. Paine<br /><br />\nCLINTON P. PAINE dc CO.,<br />\nBANKERS &amp; BROKERS<br />\nPrivate Wires to<br />\nNew York and Chicago<br /><br />\n217 E. German Street<br />\nBALTIMORE, MI).<br /><br />\nThe Chas. Willms Su[gIcal Instrument Company<br />\nDENJ. A. NELSON. OEN'L MANAGER<br /><br />\npianos.<br /><br />\nOt.<br />\n4<br /><br />\n.4 00<br /><br />\nnet*<br />\ns\"14,2JT'BOMACT41E SG<br />\nSMITH'S<br />\nOLD<br />\nBOOK<br />\n805 N. HOWARD STREET,<br />\nSTOR E.<br />\n3rd door from Madison.<br />\nFactory 13<br /><br />\nC. &amp; P.'Phone 2322-2.<br /><br />\nBOOKS<br /><br />\nOLD AND NEVV(<br /><br />\nThe oldest Old Book Store, and the largest<br />\nstock of Old and New Books in the city.<br />\nBooks Bought, Sold and Exchanged. .. •<br />\n6o5 N. Eutaw Street'<br /><br />\nWM. V.PIPPEN,<br /><br />\nA. H. Rothe,oord'<br />\nF. Lent;•<br /><br />\nJ. Wm. Middendorf,<br />\nA.J. Robbins.<br /><br />\nJ. WM. MIDDENDORF &amp; CO<br />\nBanters &amp; iBrohere.<br /><br />\nPhysicians,' Burgeons,' Horital and Invalid Supplies,<br />\nPine Microsoopes and Accessories.<br />\nBaltimore, Md.<br />\n300 N. Howard St.,<br /><br />\nMembers<br />\nBaltimore Stock Exchange.<br /><br />\nDrovers and Mechanics National Dank,<br /><br />\nROOKS AND STATIONISJ<br /><br />\nOF BALTIMORE, MD.<br /><br />\nCapital Stock,$300,000.<br />\nSurplus and Profits, $375,000.<br />\nTransacts a General Banking Business.<br /><br />\nYOUR EYES<br /><br />\nARE YOUR LIVING<br />\nBETTER BE DEAD<br />\nTHAN BLIND.<br /><br />\nrr OVER.<br />\nSAYRE OPTICAL COMPANY,<br />\n221 North Charles street. (Masonic Temple.)<br />\nKAA,MINING OPTIGIA•NS.<br /><br />\nCONTINENTAL TRUST CO. BUILDING,<br /><br />\nB. G. EICHELBERGER,<br />\nENGRAVING AND STAMPING.<br />\ncp„ 210€3<br /><br />\n11-x<br /><br />\nis from the Press of<br /><br />\nPEARRE E.CROWL COMPANY<br />\nPRINTERS AND<br />\nSTATIONERS<br />\nLight and Lombard Streets,<br /><br />\nBALTIMORE<br /><br />\nWe carry a NI line of Students' Note Books and Stationery<br />\nHoth 'Phones.<br /><br />\n.<br />\n5<br /><br />\n.€4.. I<br /><br />\nY. M. D. A. BUILDING,<br />\nHALTIMORB,<br />\nC. &amp; P. and Md.'Phones.<br /><br />\nMI ON<br /><br />\nJfisS.It DOWNS<br /><br />\nTHINK<br /><br />\nTHE NEWS LETTER<br /><br />\nBaltimore,<br /><br />\n229 N. Gliarle.s St.,<br />\nMASONIC TEMPLE.<br /><br />\noerYt<br />\nFOR Class, Fraternity and College Static)011E4<br />\nBanquet Cards, Invitations,<br />\nPrograms, Visiting Cards, Ott. • •<br /><br />\nOur 80e J. S. U. Sine and Black Nag Paper--now r<br />\nThere Is vcru little entertainment at home wIthwit a<br /><br />\nF<br />\ncTiEF<br />\nZPiANOS<br /><br />\nfire The Best.<br /><br />\nfi auIO<br /><br />\n9 N. LibertU 51.<br /><br />"}], "field_media_file": [{"target_id": 36228, "display": null, "description": null, "target_type": "file", "target_uuid": "3bc8eaac-8807-4808-960a-a6e4d3d22a4e", "url": "http://digital.library.jhu.edu/system/files/2022-03/12210-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12210, "target_type": "node", "target_uuid": "20c51bcf-620b-4e5f-b1bf-7b53da1d9146", "url": "/node/12210"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "28779cf2-7713-47cc-9430-d01f1933cd0c"}]}