{"mid": [{"value": 37721}], "uuid": [{"value": "b5de1fdc-3330-46ef-8575-b3e09a7ecbd7"}], "vid": [{"value": 37721}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:38:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12249-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:38:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:38:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "H. L. FRIEDBERG<br />\n<br />\nNEWS-LETTER<br />\nSTAFF WILL HOLD<br />\nBANQUET<br />\nANNUAL<br />\nThursday<br />\n<br />\nVol. XXXV, No. 42<br />\n<br />\nPHI BETE ELECTS<br />\n31 AT UNIVERSITY<br />\nTO MEMBERSHIP<br />\n<br />\nEASTER<br />\nMEDITATIONS<br />\nPage Two<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD,BALTIMORE, APRIL 7, 1931<br />\n<br />\nDr. Powell To Deliver<br />\nBaccalaurate Sermon<br />\n<br />\nBe Held In Emmanuel<br />\nChurch, Sunday, June 7, 11 A. M.<br />\nYellot Announces<br />\nThe Rev. Dr. Noble C. Powell<br />\nwill deliver the baccalaureate sermon for the graduating class of<br />\nthe Johns Hopkins University,<br />\nSunday, June 7, 11 A. M., at the<br />\nEmmanuel<br />\nChurch, Cathedral and<br />\nPaul B. Sutten, Graduate In<br />\nRead streets, John Yellot_ anChemistry Is Selected<br />\nnounced today.<br />\nFirst<br />\nNow rector of the church, Rev.<br />\nPowell was for five years chapAWARDED FELLOWSHIP<br />\nFOR CHEMISTRY WORK lain at the University of Virginia.<br />\n<br />\n12 Philosophy Grads. 8 Medicos, 4 of Faculty Also<br />\nElected<br />\n<br />\nServices Will<br />\n<br />\nPrice 5 Cents<br />\n<br />\nAUTHOR WHO<br />\nJENNINGS, HAVENS FOOTBALL DECISION FAMED<br />\nWILL SPEAK TODAY YALE TWELVE<br />\nGRANTED LEAVES DELAYED BY AMES<br />\nBADLY BEATEN<br />\nDURING NEXT YEAR UNTIL NEXT MONTH<br />\n<br />\n15<br />\nBY<br />\nJAYS; SCORE 18-2<br />\n<br />\nDr. Jennings to Leave for Jap- President Will Not Submit Athan in July; Dr. Havens for<br />\nletic Committee Report<br />\nSicily in February<br />\nTo Trustees<br />\n3 OTHER PROFESSORS<br />\nBELIEVES REPORT WELL<br />\nTO GO ABROAD SOON<br />\nCOMPILED ADEQUATE<br />\n<br />\nEli Stickmen Do Not Offer<br />\nSt,long Opposition That<br />\nWas Anticipated<br />\n<br />\nDr. Johannes Mattern Will Said to Contain No Provisions<br />\nMake Study of German<br />\nFor Abolition of Intercollegiate Football<br />\nJudicial System<br />\n<br />\nSMOOTH RUNNING JAY<br />\nATTACK SCORES AT WILL<br />\n<br />\nACTION OF CAGE FUND Two professors of the Johns<br />\nCOMMITTEE SUSPENDED Hopkins have been granted leaves<br />\n<br />\nGame Marks 2nd Consecutive<br />\nFinal decision on the status of<br />\nVictory for Hopkins<br />\nfootball at the Johns Hopkins UniLacrossemen<br />\nof absence for the next academic versity will be delayed for at least<br />\nWill Wait For Settling Of year, Dr. Joseph S. Ames, president a month, it became apparent yesAthletic Question<br />\nFollowing a conference of the ofBursting forth with a brilliant<br />\nof the university announced yester- terday when Dr. Joseph S. Ames,<br />\nficers of the Johns Hopkins chapter<br />\nbrand<br />\nof teamwork and speed, the<br />\nday. The professors are Dr. Herb- president, announced that he would<br />\n9 ADMITTED TO CLUB<br />\nGEORGE W. RUSSELL<br />\nof the Phi Beta Kappa honorary<br />\nBlue Jays, last Saturday, thundered<br />\nert S. Jennings Professor of Zool- make no recommendations to the<br />\nfraternity, late yesterday afternoon Committee Of Five To Plan ogy and Dr. Raymond D. Havens, Board of Trustees from the report<br />\nAn author of more than 20 on to their second successive vicJohannes' Mattern, secretary, anTrophy Room<br />\nProfessor of English Literature.<br />\nsubmitted to him by the athletic works and a painter of wide tory by trouncing the Yale twelve<br />\nnounced that 31 elections had<br />\nrepute, George W. Russell will 18-2. Despite predictions that the<br />\nDr. Jennings has been invited by committee.<br />\nIn a statement of the activities<br />\nbeen made from the graduating class<br />\npresent the first of two lectures Black and Blue was in for a warm<br />\nAmes Believed in Favor<br />\nof undergraduate school, the School of the Varsity Club made recently the Keio University of Tokyo,<br />\nthe Johns Hopk.ns Univer- afternoon, Yale undoubtedly was no<br />\nat<br />\nJapan,<br />\nto assist in the modernizaDr. Ames has declared that the sity under the Percy Graeme match for Hopkins.<br />\nof Philosophy, the School of Medi- by Club officials, it was reported<br />\ncine and members of th-e academic that the lately-appointed Cage Fund tion of its biology department, it report is well-done and presents Turnbull Lecture Foundation<br />\nThe Jay attack commenced at the<br />\nCommittee has suspended action un- was learned. The Keio University adequate plans for the improvement at 5 P. M. in Latrobe Hall<br />\nstaff.<br />\nto- opening whistle and never let up unwhile<br />\nimperial<br />\nunder<br />\nnot<br />\nendowtil<br />\nthe<br />\nathletics<br />\nHopquestion<br />\nat<br />\nof<br />\nof athletics and physical training day. His topic will be \"Some<br />\nFirst selection from the undertil the very finish. The ball was<br />\ngraduate school was Paul P. Sut- kins is decided by the Trustee ment is the oldest university in at Homewood. It is on the basis Personalities of the Irish Lit- passed constantly and the Yale goal<br />\nJapan.<br />\nof this opinion of the president's erary Movement.\" \"A Poet and<br />\nton. Others, in the order in which Board. The close interdependence<br />\nEstablishing Medical College<br />\nthat it was thought that he would Artist Considers Dreams\" is was literally showered with shots.<br />\nthey were selected are the following: of the Cage and Football issues has<br />\nEven when a shot failed,<br />\nAt present, Dr. Jennings declared. bring the report before the Trustees the title of the second lecture ber of the Jay attack one memRaymond N. Love, John A. Wheel- forced the Committee to this stand<br />\nwas on the<br />\nit<br />\nwas<br />\ndeclared.<br />\nthe Japanese university is in the late yesterday for whatever action that is to be given Thursday.<br />\ner, Vlado A. Getting, Belmont A.<br />\nspot backing up every missed atWelcomes<br />\nEntertainment<br />\nCommittee<br />\nthat<br />\ngroup<br />\nwould<br />\nto<br />\ntake.<br />\ndesire<br />\nprocess of establishing a medical<br />\nTowbin, Robert T. K. Murray, The<br />\ntempt and starting the plays all over<br />\nEntertainment Committee college<br />\nand the enlargement of the<br />\nWarren I. Reinhardt and Emanuel delegated<br />\nStudents on the campus claiming<br />\nagain. The Yale defense was simpto provide for the wel- field of<br />\nKaplan.<br />\nbiological research has been to possess authentic information on<br />\nly dazzled and couldn't get set; and,<br />\nfare of visiting athletic teams, be- undertaken<br />\nfor this reason.<br />\nthe matter declare that the report<br />\nEntered In 1928 -had it not been for Draper, Eli<br />\ngan its functions last week-end by<br />\nSutton entered the undergrad- greeting the Yale Lacrosse Team. In Japan, where he will remain itself is actually a compromise begoalie, there's no telling what the<br />\nuate school in 1928. At the end of It was also stated that the Look until September, 1932, the Hopkins tween members of the committee<br />\nscore might have been.<br />\nhis first year of residence on the Out Committee has not quite com- professor said he will continue his •ontaining no provisions for the abo- Seven Speakers Will Address<br />\nEli Defense Stunned<br />\nThe Third Conclave<br />\nown research work on the genetics lition of football.<br />\nThe Yale defense was also<br />\nHopkins campus. he was awarded pleted its plan of work as yet.<br />\nof proxtozoa while at the same time<br />\na four year fellowship in Chemistry.<br />\nstunned by the rushing tactics of<br />\nIt is believed the matter will<br />\nIn order to supply what has been<br />\nTHOMAS TO SPEAK<br />\nthe Jay attack .Throughout the<br />\nWith the expiration of the current asserted to be a long felt need of conducting seminars and delivering reach the Board of Trustees before<br />\nfracas, the Hopkins offense rushed<br />\nacademic term, he will have coni- the University, that of fitting up a lectures. Upon Dr. Jennings de- the culmination of the present acpleted two years of study under the trophy room. A committee com- parture at the end of next July, Dr. ademic year. The findings and sug- 200 Delegates From U. S. Col- every Eli defender as soon as he<br />\nAlexander Weinstein, research as- gestions of the committee, headed<br />\nleges Are Expected<br />\nfellowship.<br />\nblocked a Jay pass. This plan aidposed of William Triplett, Chair- sociate will<br />\ncontinue<br />\nlectures<br />\nthe<br />\nin<br />\ned Hopkins considerably and, on<br />\nby Dr. Ronald T. Abercrombie,<br />\nWithdrew From College<br />\nman, Ted Stern, Fritz Stude, Oscar genetics<br />\nnow being given by the however, director of physical eduDiscussions of unemployment several occasions, Yale defenders<br />\nFollowing his freshman year in Linck, Nathan Silverman and Joe<br />\ncation, will not be revealed by offi- will feature the one-day confer- enCountered great difficulty even in<br />\n1926-27, Love withdrew from the Bauer, has been appointed to ar- former.<br />\nWill Work On \"Prelude\"<br />\ncials at the Hopkins, it was learned. ence to be held at Levering Hall, advancing the ball to their own atcollege. However, a year later he range for the necessary alterations<br />\nDr. Havens will leave next FebruSaturday, by the Johns Hopkins tack. Those who saw the St. Johnsreturned to his studies under a in the old athletic offices, which are<br />\nOther Members Named<br />\nary for Sicily to begin his research<br />\nUniversity Liberal Club. Seven Hopkins duel last year will recall<br />\nscholarship grant of the Board of to be used for this purpose.<br />\nIn addition to Dr. Abercrombie, speakers will address the third Johnnies employing this same the<br />\nwork for a volume on Wordsworth's<br />\nsysTrustees.<br />\nAnnounces New Members<br />\n\"Prelude.\" Dr. Havens declared, the members of the group selected annual conclave, which will be tem in a similar impressive fashion.<br />\nIn Ms junior year, he again reAt a recent meeting, Frank Cone<br />\nin January, are Dr. E. W. Berry, divided into four sessions.<br />\nJay Reserve Strong<br />\nceived a grant from the executive announced that the following men however, that the greater portion of dean; Dr. Ray Van Orman,<br />\nathletics<br />\nhis<br />\nperiod of absence would be spent<br />\nHowever, in order to make this<br />\nThe morning session will feaboard and entered the Chemistry having received their major 1-1's<br />\nat either Oxford or Cambridge in director; Douglas Turnbull, Jr. and ture talks on causes of unemploy- type of play successful, a team must<br />\ndepartment under the New Plan.<br />\nduring the past few months, were England.<br />\nH. Garland Hershey, alumni; Rob- ment. Addresses are<br />\nto be de- have a strong reserve and the<br />\nReceived Scholarship.<br />\nto be admitted to the club: Stern<br />\nert Kyle and John Heinzerling, :livered by Dr. George E. Barnett, have it this year. Practically Jays<br />\nThe<br />\nEnglish<br />\nprofessor<br />\nsaid<br />\nthat<br />\nevery<br />\nWheeler received a Carrolton and Boyce, special major H for<br />\nseniors.<br />\nprofessor of statistics at the Hop- substitute exhibited outstanding<br />\nscholarship for his first two years swimming; Taylor, Silverman, the he had been led to undertake the<br />\nWhat action, if any, Trustees will kins, who will speak on \"Cyclical ability, although replacements on the<br />\nat Hopkins. In his junior year at Kelley brothers, Don and Caleb project by the large amount of \"new<br />\ntake on the erection of a cage at Unemployment\"; Harry W. offense were frequent, no let up<br />\nmaterial\"<br />\non<br />\nthe<br />\nsubject<br />\nthat<br />\nhad<br />\nHopkins he pursued graduate stu- Brooke, Gunnett and Kyle, mgr.;<br />\nHomewood cannot be ascertained, Laidler, president, National Bu- in its brilliance was distinguishable.<br />\ndies in Physics upon which he is major H for basketball. These been brought to light in recent years.<br />\nas it is unknown just what move reau of Economic Research, who Thus, if the saying, \"a team is as<br />\nMany<br />\nauthorities,<br />\nhe<br />\nexplained,<br />\nhold<br />\nstill engaged.<br />\nmen may obtain their memberthe report suggests be made to- will talk on \"Techniological Un- good as its reserve\" hold water, then<br />\nHe has been active in several ex- ship pins from Oscar Helm, sec- \"The Prelude\" in as great esteem ward such a building.<br />\nas<br />\nMilton's<br />\n\"Paradise<br />\nLost.\"<br />\nHopkins possesses a powerful<br />\nemployment.\"<br />\ntra-curriculal activities including de- tretary-treasurer.<br />\nLovestone,<br />\nIsrael<br />\ntwelve.<br />\nSpeakers<br />\nOthers<br />\nAlso<br />\nWill<br />\nBe<br />\nAbsent<br />\nbating in which he won the Adams<br />\nCone further stated that the<br />\nJay Lovestone, secretary, ComDefense Has Little Work<br />\nAmong other members of the Dr. E. V. McCollum<br />\nPrize last year as a member of the club routine is in smooth workmunist<br />\nParty<br />\n(majority<br />\ngroup),<br />\nThe<br />\nJay defense, on the other<br />\nHopkins<br />\nfaculty<br />\nabsent<br />\non<br />\nwill be<br />\njunior team.<br />\ning order. A drive is now under<br />\nTo<br />\nRepresent<br />\nU.<br />\nS.<br />\nafternoon<br />\nat<br />\nthe<br />\nportion<br />\nof<br />\nthe<br />\nhand,<br />\nhad<br />\nvery little opportunity to<br />\nvarious<br />\nresearch<br />\nduring<br />\nthe<br />\nprojects<br />\nEntered In 1928<br />\nway he said, to acquire funds for<br />\nconclave will discuss \"Economic display its wares. However, considGetting entered the undergrad- the organization in order to pro- summer are Johannes Mattern, Asuate school in 1928. While pursu- vide more adequate means for sistant Librarian; William Kurrel- Es One Of Ten American Delegates To Consequences.\" Dr. Edward L. ering its stubborn stand against the<br />\nmeyer, Professor of German; and International Dairy Congress, To Israel, rabbi of the Har Sinai Con- Olympic Club on March 28 it like(Continued on page 3, col. 2)<br />\nvarious activities.<br />\nBe Held In Copenhagen<br />\ngregation, has selected \"Social wise is worthy or praise. On that<br />\nArthur 0. Lovejoy, professor of<br />\nday the team that represented the<br />\nDr. E. V. McCollum, professor Consequences\" as his topic.<br />\nPhilosophy.<br />\nRound table discussions at the United States in the Olympics of<br />\nDr. Mattern will leave shortly for of biochemistry at the Johns HopGermany to conduct a study of the kins School of Hygiene today was afternoon session are to be led 1928 proved no match for the Black<br />\njudicial system of that country named by Arthur M. Hyde, Secre- by Joel Seidman, H. G. Burke, and Blue Varsity. Tom Biddison,<br />\nunder a grant furnished by the So- tary of Agriculture, one of ten dele- Lazare Teper and B. Van Dusen, at one time one of the state's leadall members of the Liberal Club. ing attack men, could do nothing.<br />\ncial Science Research Council. Dr.<br />\ngates to represent officially the<br />\nThomas Principal Speaker<br />\nWeitzel, Jay cover point, smeared<br />\ntravel<br />\nMattern<br />\nwill<br />\nsaid<br />\nhe<br />\nthat<br />\nAnthony Cianek, Recluse, Meets Philosophical Difficulties<br />\nNorman<br />\nThomas, noted Social- every one of his opponent's efforts.<br />\nUnited<br />\nStates<br />\nInternational<br />\nat<br />\nthe<br />\nthroughout Germany stopping off<br />\nIn Collaboration On Book Of Nuts With<br />\nat such cities as Hamburg, Bremen, Dairy Congress, to be held in Co- ist who addressed the student In fact, the Jay defeneder clung<br />\nBerlin and Leipzig to study their penhagen, Denmark, July 14 to 17, body at an assembly, will speak like a leech.<br />\nDr. George Boas<br />\nrespective methods of meeting legal according to an Evening Sun dis- on \"Socialization as a Solution of<br />\nStars Held Scoreless<br />\nthe Unemployment Problem\" in<br />\nAll those former Hopkins stars<br />\nAnthony Cianek, hermit, who laissez-faire. That's how I raised problems.<br />\npatch.<br />\nthe principal address of the eve- found the Black<br />\nWill Write Book<br />\nwas discovered recently in a ram- my 12 children. I was thinking<br />\nand Blue defense<br />\nning session of the conference. almost<br />\nIn<br />\nannouncing<br />\nthe<br />\nselection<br />\nof<br />\nthe<br />\nUpon<br />\nhis<br />\nreturn<br />\nnext<br />\nSeptember,<br />\nimpregnable. Norman Robinshackle lean-to in Wyman's Park, of asking them down to the leanOthers who will speak before the son,<br />\nBill Logan, and Helfrich simpvisited Levering Hall last week to, but hell!\" he meditated, \"you he said he will assemble data de- American delegates, Secretary Hyde Liberals are<br />\nIsador Lubin, eco- ly could not get going.<br />\nrived<br />\nfrom<br />\nhis<br />\nresearch<br />\ninto<br />\na<br />\nbook<br />\npointed out that the official particifor the first time during the know damn well you can't get 14<br />\nEvery effort<br />\nnomic adviser to U. S. Senator was crushed<br />\nand those shots which<br />\nSpring vacation. Mr. Cianek who brats into a lean-to. Besides my intended as a companion volume to pation in this important interna- Wagner,<br />\nwhose address will be they could take were quickly<br />\nhas lived for several years in the brats have taken to this laissez-faire his \"Constitution Jurisprudence of tional meeting, at which many of<br />\nsnared.<br />\non \"Unemployment Insurance\";<br />\nthe<br />\nGerman<br />\nRepublic\"<br />\nwritten<br />\nsevCoupled with this brilliant defenwoods behind the University with- idea so well, that I'll be darned<br />\nthe countries of the world will be and J. P. Troxwell, executive di- sive<br />\neral years ago.<br />\ndisplay, the Jay attack kept<br />\nconsiderable attention to himself by if I know where they are!\"<br />\nrepresented, both officially and un- rector of the Municipal Commis- driving with consistency shot after<br />\nThe<br />\nediting<br />\nof<br />\nthe<br />\nwork<br />\nof<br />\nthe<br />\nhis humble philosophy and his unAllows For Error<br />\nGerman poet, Wieland, on which officially, was made possible by an sion of Employment Stabiliza- shot until the Olympic defense also<br />\nceasing .searching for nuts.<br />\n\"But Mr. Cianek,\" a questioner Dr. Kurrelmeyer has been engaged<br />\ntion, who will<br />\nThe purpose for the visit, Mr. interrupted, \"one<br />\nappropriation of $10,000 by Con- Stabilization.\" talk on \"Industry crumbled. Consequently, the Olympic Club tasted the first shutout of<br />\nCianek said, was to determine say you have 12 moment you for the past eight years will be con- gress.<br />\nOfficials of the Liberal Club at its career to the tune<br />\nchildren, the tinued by him in Germany during<br />\nJust what advantages the build- next 14.\"<br />\nof 6-0.<br />\nThe meeting will be held in the Homewood expect more than 200<br />\nthe summer under the Berlin<br />\nLine-up of the Jay-Eli game:<br />\ning possessed for quiet and lib\"Oh,\" he replied biting a nut, Academy.<br />\nDanish House of Parliament, under delegates from colleges througheral thought while he is collab- \"I always take into<br />\nYale<br />\nconsideration<br />\nDr.<br />\nLovejoy<br />\nthe<br />\npatronage of King Christian X. out the United States to attend. Johns Hopkins<br />\nwill<br />\ndeliver<br />\na<br />\nseries<br />\norating on his book on nuts with (he spat<br />\nStude<br />\nDraper<br />\nout<br />\nthe<br />\nshells)<br />\nthe<br />\nrate<br />\nof lectures in London.<br />\nDr. George Boas, associate proAt<br />\nthis<br />\ncongress<br />\ngreat importance<br />\nFields<br />\nof marginal error.\"<br />\nPACKARD NAMED EDITOR Bernard<br />\nWeitzel<br />\nC P<br />\nfessor of Philosophy at Hopkins.<br />\nHowell<br />\nwill be attached to the presentation<br />\nWhen<br />\nquestioned<br />\nconcerning<br />\nNess<br />\nFD<br />\nFlygare<br />\nFinds Too Much Liberalism<br />\nSeven Gas Engineers<br />\nof the latest results of dairy re- 42nd Edition Of Handbook To Be Kneip<br />\nS D<br />\nNelson<br />\nAfter looking the situation his co-authorship with Dr. Boas,<br />\nReady For Re-Opening Of HopLang<br />\nTD<br />\nJones<br />\nVisit Three Plants earch and experimental work.<br />\nkins Next October<br />\nOver, the recluse asserted that he Mr. Cianek seemed to be rather<br />\nBeehler<br />\nSmith<br />\npessimistic.<br />\n\"I<br />\noriginally<br />\nconhad found too much liberalism at<br />\nThe object of the federation, it<br />\nT A<br />\nH Henderson<br />\nGeorge Packard was named Stone<br />\nS A<br />\nLevering Hall. He declared that ceived this idea!\" he complained. Hopkins Students Last Week Take was explained, is to help to bring editor-in-chief and Cliff Gilbert, Guild<br />\nBeggs<br />\nD. Kelly<br />\nF A<br />\nBaker<br />\nInspection Tour<br />\nthe liberalism at the Y. M. C. A. \"It was all mine. All I wanted<br />\nabout co-operation by the dairy in- business manager, of the 42nd rurnbull<br />\nO H<br />\nGaston<br />\nDr.<br />\nBoas<br />\nto<br />\ndo<br />\nwas<br />\nto<br />\nfurnish<br />\nbuilding was much too noisy. He<br />\nSeven students in Gas Engineer- dustries of all countries in promot- edition of the Johns Hopkins Darrell<br />\nIH<br />\nWeber<br />\nindicated that he preferred quiet the culture. But we can't agree ing and Dr. Lloyd Logan, associate ing the technical and scientific de- University Handbook, to be dis- Score by halves:<br />\nas<br />\nto<br />\njust<br />\nwhat<br />\nnuts<br />\nare<br />\nand<br />\nto<br />\nsoothing liberalism.<br />\nprofessor of Gas Engineering, last velopment of the industry through- tributed at the opening of the<br />\nJohns Hopkins<br />\n8 10-18<br />\n\"I'm beginning to feel more just what culture is.<br />\nUniversity for the academic year<br />\nweek visited the Seaboard Coke out the world.<br />\nThinks Nuts Are Swell<br />\nYale<br />\n2-2<br />\n0<br />\nsympathy for the down town Y.<br />\n\"I'll say, 'I think nuts are Products Co., of Reainey, N. J.; The American delegates selected 1931-32.<br />\nGoals—Hopkins,<br />\nStone<br />\n(3),<br />\nGuild<br />\nAt C. A.,\" he advanced. \"My idea<br />\nConsolidated Gas Co. of New York, today wfill sail from New York<br />\nBennett, Kaufman, and Mul- (3), D. Kelly (2), Cockpy (2), Darrell<br />\nand theory of how to raise young swell.\"<br />\nAstoria, L. I.; and Standard Oil July 1 on the \"George Washing- hauser will aid the new editor-in- (2), Beehler, Turnbull, Dukehart, C.<br />\nMen is to adopt an attitude of (Continued on page 4, col. 3)<br />\nCo. of New Jersey, Bayway, N. J. ton.\"<br />\nchief, it was announced.<br />\n(Continued on page 3, col. 3)<br />\n<br />\nUNEMPLOYMENT PARLEY<br />\nSET FOR END OF WEEK<br />\n<br />\nNut Question Harries Hermit<br />\nOn Visit to Hopkins Campus<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1931<br />\n7<br />\n<br />\nWSIETT R<br />\n<br />\nIIEJOBISH<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore.<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br />\n<br />\nshould<br />\n<br />\nBusiness communications<br />\n<br />\nother communications to the<br />\n<br />\nto<br />\n<br />\nbe addressed<br />\n<br />\nthe<br />\n<br />\nBUSINESS MANAGER,<br />\nMANAGING EDITOR;<br />\n<br />\nAll articles should be sent to the<br />\n<br />\nEDITOR-IN-CHIEF.<br />\nBelmont<br />\n<br />\nTelephone<br />\n<br />\n8778<br />\n<br />\nEDITORIAL DEPARTMENT<br />\n<br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL, '31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nROWLAND McD. NESS, '32<br />\nSYLVAN LEBOW, '32<br />\nJunior Editors<br />\nDONALD PROCTOR, '33<br />\nHARRY GOODMAN, '33<br />\nJACK GREENFIELD, '33<br />\nHAROLD KUSLOVITZ, '34<br />\nSAMUEL M. DOCTOFSKEY, '34<br />\nNORMAN HEANEY, '34<br />\nMORDECAI EDELMAN, '34<br />\nMARLOWE PERRY, '32<br />\nBERNARD VERLIN, '33<br />\n<br />\nNATHAN M. HARRIS, '32<br />\nHAROLD B. YUDKIN,'32<br />\nHERBERT L. FRIEDBERG,'33<br />\nMARION GROVE, '33<br />\nHYMAN LEVIN, '34<br />\nSANFORD SARNEY, '34<br />\n_JEROME BLUM,'34<br />\nSTANLEY STILLMAN, '33<br />\nRAYMOND DUNN,'33<br />\n<br />\nBUSINESS DEPARTMENT<br />\n<br />\nBusiness Manager<br />\nGus BURK, '31<br />\nAdvertising Manager<br />\nDAVID SYKES, '32<br />\n<br />\nBy<br />\n<br />\nH. L. Friedberg<br />\n<br />\nI.<br />\n<br />\nFOUNDED 1897<br />\n<br />\nJohns Hopkins University.<br />\n<br />\nEaster Meditations II<br />\n<br />\nCirculation Manager<br />\nGEORGE W. LA MONT,'32:<br />\n<br />\nI do not know that I qualify, but<br />\na friend has forwarded me a pamphlet advertising an apparently phenomenal volume on \"Woman—Her<br />\nSex and Love Life.\" One page recounts the chapter titles. After listing such topics as: \"Why a Misstep in a Girl is More Serious Than<br />\nin a Boy\"; \"The Female Sex Organs; Their Anatomy\"; \"Illegitimate Motherhood\"; \"The Girl Who<br />\nLost Her Virginity\"; \"Dainty Underwear\"; \"Simultaneous Loves<br />\nPossible ;\" \"Love in the Life of<br />\nPeople of High Culture\"; \"Conception and Abortion Radically<br />\nImpresDifferent\"; \"Maternal<br />\nsions\"; \"Syphilis\" and \"Venereal<br />\nProphy-Laxis\",—after listing all of<br />\nthese, I say—the author (the great<br />\nbut mysterious Dr. Robinson) finally comes to \"Promiscuous Kissing.\"<br />\nIn other words the chronological<br />\norder suggests that a young girl<br />\n(unprotected) who has done what<br />\nFreud suspects she would like to<br />\ndo, become a mother without a franchise granted by God, worn salacious underwear, loved two persons<br />\nsimultaneously and as a result of<br />\nher—to be poetic—indiscretions gotten the worst of things, has succeeded to such a state of ignominy<br />\nthat she now must be shielded from<br />\n\"Promiscous Kissing.\" Such a<br />\nmetaphysical conception of sin can<br />\nonly be rivalled by that of the Hopkins Student Council which having<br />\nbeen originally commissioned to prevent intellectual larceny on the Hopkins campus, exhausts all of its<br />\nenergies providing an audience for<br />\nincompetent assembly entertainers.<br />\n<br />\nOffice Manager<br />\nISADORE C. GUTMAN, '32<br />\nWILSON RUTHERFORD, '31<br />\nCHARLES NEY, '33<br />\nABRAM BURK, '34<br />\n'33<br />\nSIMON LITT,<br />\nVICTOR FRENKIL, '34<br />\nWit. N. MYERS, '33<br />\nEDGAR BLUMSTEIN, '34<br />\nMORTON ROME, '33<br />\nDAVID GUTMAN, '34<br />\nWILBUR BLOOM, '33<br />\nGEORGE BAYLIN, '31<br />\nMAURICE R. CHASSIN, '33<br />\nHARRIS, '34<br />\nLEONARD<br />\n'34<br />\nGEORGE LANDAU,<br />\n<br />\nPreviously, I have frequently<br />\nmeditated on the ignominy attendant on the inclusion of a Y. M. C.<br />\nA. building in the Hopkins group.<br />\nBut with an extra few months of<br />\nculture consumption behind me, I<br />\nfeel contrained to consider the matter more alertly. I do not see that<br />\nthe roguery and stupidity as purveyed by the Johns Hopkins stuMd.<br />\nBaltimore,<br />\nAve.,<br />\nClifton<br />\n1930<br />\nProduced by the R. L. Polk Printing Company,<br />\ndent body is of any more superior<br />\nor fragrant variety than the roguery<br />\nand stupidity as purveyed by the<br />\nprofessional gentlemen of Levering<br />\nHall. We have a middle-class student body; then why not a middleclass organization to soothe their<br />\nmiddleclass qualms and to pretend<br />\nto solve their middle-class problems.<br />\nEXPERIENCE<br />\nHence, I alter a few mental patFrom this time on, I regard<br />\nterns.<br />\nwas<br />\nclearly<br />\ncontest<br />\nof<br />\nHE part that experience plays in any sort<br />\nthe Y. M. C. A. not as a disgrace<br />\nbrought to light in 'last Saturday's lacrosse game. The Yale team<br />\nto the Johns Hopkins, but merely<br />\nlacked only this one factor, for in every other respect the visiting team<br />\na disgrace.<br />\nas<br />\nexcellent<br />\nin<br />\nwas<br />\nteam<br />\nBlue<br />\nThe<br />\ntwelve.<br />\nJay<br />\nBlue<br />\nthe<br />\nof<br />\nequal<br />\nwas the<br />\ncondition, had had more practice this season, and was just as fast as<br />\nthe Homewood combination.<br />\nThe fact that none of the New Haven team had played lacrosse<br />\nAbout the most profoundly, probefore entering the university was responsible for the decisive defeat.<br />\nfessionally romantic person that I<br />\nAlthough Yale was handicapped in that they had played a hard game<br />\nhave ever been acquainted with was<br />\nwith Penn two days before, during the course of which they lost the<br />\nEnglish instructor at City Colan<br />\nservices of one of their best attack men, this counted little for their<br />\nbeing completely outclassed throughout the contest.<br />\n<br />\nEDITORIALS<br />\n<br />\nT<br />\n<br />\nBANQUET SEASON?<br />\nthe junior banquet set for April 23, a lively week followWITH<br />\ning that date may well be predicted due to the fact that there<br />\nthe freshman and<br />\n<br />\nhave been no hostilities of any sort between<br />\nsophomore classes to date this year. Although the Student Council<br />\nruling that there will be no breaking up of banquets is still in effect,<br />\nit is probable that the members of the two classes will find other ways<br />\nto work out their pent up energy.<br />\nUnless the council takes some action, it is to be expected that a considerable amount of damage will be done during this period—both to<br />\nproperty in vicinity of the University and to the class members themserves. When one starts out to completely eliminate the rah-rah' element from a college, it is necessary that no opportunity be given the<br />\nmen to exhibit their animal instincts.<br />\nTo give these individuals one such chance as this is much more dangerous than allowing some sort of hostilites throughout the entire college year. If freshman regulations and the interclass contests that go<br />\nwith them are to be abolished, it would be wise to abolish banquet<br />\nfights as well.<br />\nThere is no half way measure in this problem. It is necessary to definitely follow one course or the other. The present trend is, of course,<br />\nto remove all forms of class competition from the Homewood campus.<br />\nIf this be stingently enforced, it is probable that during the course<br />\nof years every trace of the 'motion picture' type of college will be removed. Whether or not this is the wish of the students, will be seen<br />\nwhen the result of the vote on freshman regulations is announced by<br />\nthe Student Council. It is needless to say that what the students wish is<br />\nnot always what is best for them. However, when there is a question<br />\nas to which course the authorities should follow, it would seem that<br />\nsome heed should be paid to the opinion of the majority of the student<br />\nbody.<br />\n<br />\nWHY THE DELAY?<br />\nit is very regretFROM the point of view of the athleticof authorities<br />\nPhysical Education has not<br />\n<br />\nable that the report of the committee<br />\nyet been submitted to Board of Trustees. With the general public under the impression that football has been abolished at Hopkins, it is<br />\nvitally necessary to the future of athletics that the decision be announced. Should the board decide to abolish football, it could not place<br />\nthe authorities in any more disagreeable position than they are in at the<br />\npresent writing. The question is one of such importance that a hasty decision should not be made, but in view of the necessity of some statement in the near future it would seem that greater effort could be exerted to bring the question before the board.<br />\n<br />\nlege. His name was Sweeney.<br />\nSweeney was an apollo. Or rather<br />\nhe was 95 per cent apollo for he had<br />\na cast in one eye. He was still,<br />\nhowever, an immensely romantic fellow. He was wont to strut up and<br />\ndown Charles Street—always manipulating his neck so that the evileye shifted from the level of a second story window to the deep blue,<br />\nromanticS sky above. Thus you<br />\ncaught only a fleeting glimpse of the<br />\nevil-eye. He was still, however, an<br />\nimmensely romantic fellow.<br />\nBut how was such a romantic<br />\nperson to die? Was it to be at the<br />\nend of a rusty sword somewhere in<br />\nArabia? Was it to be under the<br />\nhoofs of a thundering herd in Arizona? Was it to be after a slammed<br />\ndoor, a tearing of flimsy pajamas<br />\nand a fall from a bouduoir of the<br />\nfiftieth story to the walks below?<br />\nNo. Sweeney got a sore throat<br />\nthree years ago this May. A physician came, and looked down<br />\nSweeney's throat. There was no<br />\ndoubt about it. Sweeney had tonsilitis. With the dawn of a fifth<br />\nday after, the romance, the evil-eye<br />\nand English instructor SWeeney<br />\nwere no more.<br />\nIV.<br />\nI take pride, perhaps, in exotic<br />\nthings. For instance, I am most<br />\nsupremely happy that I am the<br />\nonly Hopkins student who is convinced that the last Barnstormer<br />\nproduction was offensive even as<br />\nfourth-rate drama. I am profoundly conceited that I was the first<br />\nstudent to arrive at the conclusion<br />\nthat the Liberal Club is not liberal.<br />\nI am among the few, I believe,<br />\nwho feel that the average Hopkins<br />\nstudent is an ass. I am elated over<br />\nthe fact that it is my lot to believe<br />\nthat at least half of the faculty<br />\nare no better than the average student. I was the only Hopkins student, I venture to say, who rode<br />\ndown Charles Street on Easter Sunday in a suit three years old and a<br />\nheard that had a two-day start.<br />\nV.<br />\nWhatever may be the force that<br />\nmotivates an entering student to<br />\njoin a fraternity, it certainly cannot be one of friendship. I admit<br />\nthat I am hardly an authority on<br />\nwhat the personality books call the<br />\nArt Of Making Friends, but if<br />\nfriends are made by corraling a<br />\ngroup of freshmen into a house and<br />\nthen by selecting half for friends in<br />\na more or less haphazard fashion,<br />\nthen I hope I have an inexhaustible supply of enemies. Doubtless,<br />\nresidence in a fraternity house is<br />\npreferable to the primitive conditions of the dormitories, but when<br />\none considers that seventy-five per<br />\ncent of the people in the world<br />\naren't fit to live with anyway, I think<br />\na tent in Wyman's Park would have<br />\nits advantages.<br />\n<br />\nBOSTONIAN SHOES<br />\nTo the<br />\nmanner born<br />\ndo<br />\n<br />\nIf you naturally<br />\nchoose distinctive<br />\nfootwear, Fleetwing<br />\nneeds no praise from<br />\nus. In all shoedom<br />\nthere's no better-bred<br />\nexample of smart<br />\nstyle. From rakish<br />\nEnglish toe to mannish heel, Fleetwing<br />\nis to the manner born<br />\n—a selected Bostonian.<br />\nIn Autumn tan<br />\n<br />\n01<br />\nPi<br />\nPi<br />\nhi<br />\nti,<br />\nas!<br />\n<br />\nor<br />\n<br />\nEbony black.<br />\nThe<br />\n<br />\nFLEETWING<br />\n<br />\n'10<br />\nhe FLEETWING<br />\n<br />\nThis Seal<br />\nmarks Style:Selected<br />\nBostonians<br />\nSELECTED STYLE NO.<br />\n<br />\n1<br />\n<br />\n2<br />\n<br />\nBOSTONIAN SHOE STORE<br />\nW. C. KENNEY<br />\n<br />\n112<br />\n<br />\nEast Baltimore Street<br />\n<br />\nA. H. FETTING<br />\nMANUFA CTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br />\n<br />\nPRINTERS OF<br />\n<br />\nFor Better Cleaning and<br />\nDyeing<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n<br />\nFRIED'S<br />\n<br />\nJ. H. FURST CO.<br />\n<br />\n12-20 Hopkins Place, Baltimore<br />\n<br />\n101 E. 21st St.<br />\n<br />\nBelmont 5501<br />\n<br />\nOPERATE IT YOURSELF<br />\n<br />\nRENT A CAR<br />\n<br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\n111 W NORTH AVE.<br />\n<br />\n2125 HARFORD AVE.<br />\nPhone, Wolfe 1413<br />\n<br />\nAlthough Several Items Are Tentative Committee Believes<br />\nThey Will Be Carried Out; Orders For<br />\nPrograms Being Taken<br />\n<br />\nTwo Orchestras Definitely Hired<br />\n<br />\nThe feature of the week is to<br />\nbe the Ball, at which Guy Lombardo and his Royal Canadians<br />\nwill furnish music. The affair is<br />\nto be held in the Lord Baltimore<br />\nHotel on Monday June 8th. The<br />\nonly other orchestra definitely<br />\nhired is T. Worth Murphy's<br />\ngroup, which plays at the Belvedere Hotel. This orchestra is to<br />\nbe at the Night Club party, which<br />\nis to be held at Levering on June<br />\n4th.<br />\nAlthough prices in each individual affair have not been set, a<br />\nticket to all activities will cost<br />\n$12.50. These tickets are to go<br />\non sale soon at the post-office. According to members of the committee, the sum of the prices for<br />\neach individual event would total<br />\nabout $22. Undergraduates are<br />\n<br />\nt1<br />\n<br />\nDeposit Not Required<br />\n<br />\nNew Schedule For June Week<br />\nWill Probably Be Carried Out<br />\n<br />\nAfter several changes in the<br />\noriginal plans for June Week, the<br />\ncommittee has arranged a tentative schedule which, according to<br />\nChairman Yellott, will probably<br />\nbe carried out. Ten events are<br />\non the program, which runs from<br />\nJune 3rd to the 9th, starting with<br />\nthe last Cotillion, and ending with<br />\nCommencement exercises at the<br />\nLyric and the Senior Banquet at<br />\nthe Southern Hotel.<br />\n<br />\nV<br />\n<br />\n1(<br />\n<br />\n1(<br />\n<br />\nC.<br />\n<br />\nt;<br />\na<br />\nti<br />\na<br />\nt;<br />\n<br />\ninvited to all functions except the<br />\nSenior Banquet.<br />\nPrograms On Sale<br />\n<br />\nOrders for the June Week<br />\nsouvenir programs are being<br />\ntaken at the post-office. These<br />\nare the only official programs,<br />\nand are selling at $1 per copy,<br />\ntwo for $1.50. They will be obtainable by order only.<br />\nThe programs is to have a<br />\ncover of black leather, with a cut<br />\nof Gilman Hall tower in blue.<br />\nThere will be about 15 pages,<br />\neach containing a picture. Among<br />\nthese photographs will be pictures of the campus, and of the<br />\nsponsors for the various Senior affairs.<br />\nSchedule Has 10 Events<br />\n<br />\nThe<br />\n<br />\nschedules is as follows:<br />\nWednesday, June 3—Last Cotillion, place undecided.<br />\nThursday, June 4—Beach Party, probably at<br />\nMaga Vista.<br />\nFriday, June 5—Night Club Party, at Levering Hall, T. Worth Murphy's Orchestra.<br />\nSaturday, June 6—Lacrosse game (afternoon),<br />\nat Homewood.<br />\nAfternoon—Tea Dance at Levering after<br />\ngzme.<br />\nEvening—Lacrosse Ball, place undecided.<br />\nSunday, June 7—Baccalaureate Sermon at<br />\nEmanuel Church, Charles and Read Sts.<br />\nSermon by Rev. Dr. Noble C. Powell.<br />\nEvening—Concert by Johns Hopkins Orchestra on Quadrangle and Senior Step—<br />\nSinging (admission free).<br />\nMonday, June 8—Senior Ball at Lord Baltimore Hotel, Guy Lombardo's Orchestra.<br />\nTuesday, June 9—Graduation at Lyric. Senior<br />\nBanquet at the Southern Hotel.<br />\n<br />\nti<br />\n11<br />\n<br />\nSI<br />\n<br />\nLow Evening<br />\nand Night Rates<br />\nEvening Rates<br />\nBetween 7 P. M. and<br />\n8:30 P. M.<br />\n15% to 20% lower<br />\nthan day rates<br />\nNight Rates<br />\nBetween 8:30 P. M.<br />\nand 4:30A.M.<br />\n40% to 50% lower<br />\nthan day rates<br />\n( Minimum reduced rates \\<br />\nk 35c for initial period. J<br />\n<br />\nAFTER the party<br />\n...grand time...<br />\na swell time .. .<br />\n'member? Gee,<br />\nwouldn't it be<br />\ngreat to see Her?<br />\nThe Resourceful<br />\nSoul says—call her<br />\nup by Long Distance ... Do it<br />\nthis evening.<br />\n<br />\nTHE CHESAPEAKE AND POTOMAC<br />\nTELEPHONE COMPANY<br />\nOF BALTIMORE CITY<br />\n<br />\n13<br />\n<br />\nV<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1931<br />\n<br />\nSCHAALIANA<br />\nPreface: To edit the works of<br />\nE. A. Schaal in a sympathetic, understanding fashion is a hard but<br />\ndelightful task. For fear that even<br />\none person may have missed the<br />\nphilosophy that Mr. Schaal has been<br />\nunloading in the \"Y\" news for the<br />\npast year, there have been grouped<br />\nbelow a few of the outstanding tidbits. They were chosen because of<br />\ntheir powers of stimulating the emotions and, of course, their complete<br />\nasininity.—H. L. F.<br />\n<br />\nNov., 1930.—A Sunday School<br />\nclass composed of Goucher and<br />\nHopkins students recently engaged<br />\nin a discussion of prayer. One<br />\nGoucher girl supported by a Hopkins student, vigorously supported<br />\nthe theory that one might well pray<br />\nfor rain during such a drought as<br />\nwe have been having.<br />\nLife Made Easy Nov., 1930.—Dr. Howard A.<br />\nKelly, at the University- Supper<br />\nClub, stated that a man's answer to<br />\nthe question \"What think ye of<br />\nChrist ?\" is the irrlost important decision one makes, and will make possible the solution of all other problems of life.<br />\nVery Psychological, Very Metaphysical,'Very Extraordinary<br />\n<br />\nDecember 12, 1930.—When is<br />\none religious? . . . To be religious<br />\nit would seem, does not necessarily<br />\nimply the acceptance of any particular set of dogmas or creeds, although religious people often do<br />\nthis. The Y. M. C. A. recognizes<br />\nthat many religious souls both<br />\namong the students and faculty seem<br />\nto derive great satisfaction . . .<br />\nby keeping up a continuous barrage<br />\nof criticism against the church, the<br />\nY. M. C. A., many types of pious<br />\nliving, etc., etc.<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\nFraternities at the University of<br />\nWisconsin are facing serious difficulties as a result of the,raising of<br />\nthe scholastic standards.<br />\n* * *<br />\nA New York branch of Yale University to be established at the Hotel<br />\nBiltmore College is the novel solution offered by one of Yale alumnus for the \"Week-end habit\" so<br />\nprevalent at Eastern universities.<br />\n* * *<br />\n\"It is my belief that the true purpose of education is to stimulate<br />\nideas, to preserve and to promote<br />\nideals. I do not believe that education can be thrust upon a person<br />\nby 'forcible feeding.' Mental food<br />\nis like physical food. People won't<br />\ntake much of it unless they have<br />\nan appetite for it. I hope that, in<br />\nthis university, we can create such<br />\nan appetite, make our students mentally hungry,\" says Walter Williams, President of the University of<br />\nMissouri, and formerly dean of its<br />\nschool of journalism.<br />\n*<br />\nJose Padin, commissioner of education of Porto Rico, has planned<br />\na graduate school of tropical agriculture for the University of Porto<br />\nRico, and negotiations are already<br />\nbeing carried on toward this end<br />\nwith Cornell University.<br />\n* * *<br />\nOnly 16 per cent of the teachers<br />\nemployed in North Carolina schools<br />\nduring the 1928-29 year were men.<br />\n* * *<br />\nDr. H. W. McCastline, medical<br />\nofficer of Columbia University,<br />\nstates that the typical Columbia<br />\nfreshman does not smoke; drinks<br />\ntwo or more glasses of milk daily;<br />\nregularly eats his spinach and lettuce, and prefers swimming as a<br />\nsport.<br />\n*<br />\n*<br />\nViolent anti-Semitic demonstrations at Pecs University last Tuesday resulted in eight Jewish students<br />\nbeing so severely injured that they<br />\nhad to be taken to a hospital.<br />\n<br />\nHopkins 'Crossemen Will Meet<br />\nSwarthmore Twelve Saturday Simon Ackerman Clothes<br />\nREADY TO WEAR<br />\n<br />\nNot Much Opposition Is Expected By Jay Coach From<br />\nNov. 12, 1930.—The Community<br />\nPennsylvania College In Clash At Homewood<br />\nFund went over the top.<br />\nField; Easy Victory Forecast<br />\nNews Note<br />\n<br />\nA. JACOBS & SONS<br />\n... Tailors ...<br />\n<br />\nSolved! Throw Away The Bayonets!<br />\n<br />\nNov. 12, 1930.—One hundred and<br />\nthirty-five<br />\npeople, representing<br />\nabout thirty nations, were the guests<br />\nof the Y. M. C. A. for Thanksgiving dinner, Tuesday, November<br />\n25. Dr. Wheeler presided. Breaking bread together will eventually<br />\nresult in breakitwg down barriers<br />\nand conflicting issues between naMr. Schaal Ponders A Social Problem tions.<br />\nNov., 1930.—The secretary of a<br />\nFrom A Stool<br />\ndepartment of the university after Scientific Observations Hall<br />\nIn Levering<br />\nmingling freely with the students<br />\nNov. 12, 1930.—How many Hopof the university, as such secretaries kins men attended church last Sunare accustomed to do, recently day? We venture the guess that the<br />\npassed up the oportunity this offered percentage was higher than for most<br />\nand married a mechanic. It is re- institutions of higher learning and<br />\nported that her friends have been we also venture the opinion that<br />\ngreatly shocked and disappointed those who actually worshipped had<br />\nthat she married a greasy mechanic an experience that has made life<br />\nwhen she might have married an more sifinificant this week.<br />\nintellectual.<br />\nVery Significant, leery Significant<br />\n<br />\n3<br />\n<br />\nThis coming Saturday the Hopkins lacrosse squad will meet<br />\nSwarthmore College at Homewood field. As a result of the latter's weak performance against<br />\nMt. Washington two weeks ago,<br />\nDr. Van Orman does not expect<br />\nhis squad to encounter much stiff<br />\nopposition.<br />\nSwarthmore Men Inexperienced<br />\n<br />\nDue to the infertile stage of the<br />\ndevelopment of lacrosse in Pennsylvania, most of the members of<br />\nthe Swarthmore team do not have<br />\nthe experience of Black and Blue<br />\nteams. However, the Maroon<br />\nteam possesses on the attack a<br />\nstellar performer in Pike. He<br />\nhappens to be a former Friends'<br />\nSchool player and is the pivot of<br />\nthe Swarthmore offense. The<br />\n<br />\n128 W. Fayette Street<br />\n<br />\ntwo points that the maroon tal-<br />\n<br />\nlied against the Hillmen were<br />\nboth scored by Pike.<br />\nMaroons Possess Fight<br />\n<br />\nOn the defense the Maroons<br />\nare again hampered by the inexperience of their material; but<br />\nthe team does possess plenty of<br />\nfight. This was particularly evident during the second period of<br />\nthe Mt. Washington contest. The<br />\nHillmen, possessing some of the<br />\nfinest material in the state, had<br />\nto put forth their best efforts to<br />\nscore.<br />\nFor the Jays, this game should<br />\nprove a good opportunity to<br />\nsmooth a few rough edges. Likewise it will add to the team's experience.<br />\n<br />\nPHONE: VERNON 5013<br />\n<br />\nCENTRAL PARKING CO.<br />\nLargest Open Air Parking in the State of Maryland<br />\n5 CONVENIENT PLACES:<br />\n309-311 W. Franklin St.<br />\nHoward and Druid Hill Ave.<br />\n209 Davis St.<br />\nHoward and Centre Sts.<br />\n20 Clay St.<br />\nBALTIMORE, MD.<br />\n<br />\nWe Sell Drugs and Give Service<br />\nMembers Florists Telegraph Delivery Association<br />\n<br />\nCall us up Belmont 5318, 5846<br />\n<br />\nPeabody Pharmacy<br />\nCalvert and 30th Streets<br />\n<br />\naqsa<br />\n<br />\nPif<br />\n<br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\n<br />\nTHE RELIABLE WEAVING CO.<br />\n<br />\nGod Hears All, Sees All, Knows All<br />\n<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\nFLORISTS<br />\n<br />\nFeb. 13, 1931.—Some men (the<br />\nOrations Being Given<br />\ndean says, about 30) were dropped<br />\nfrom the university because of<br />\nBy Public Speakers<br />\nscholastic difficulties. Who knows<br />\nbut what this may be a more signifiAddresses Will Be Six Minutes Long;<br />\ncant religious experience than being Authorities Aim to Develop<br />\nHarangues On Prohibition To Be<br />\nconverted by Billy Sunday?<br />\nSocial, Cultural Life<br />\nIncluded<br />\nNews Note<br />\nThroughout this week students<br />\nNov. 13, 1931.—Mooney and<br />\nTO SERVE COFFEE<br />\nin the five sections of the public<br />\nBillings are still in jail.<br />\nspeaking class, instructed by Dr.<br />\nWould Keep Social Life From<br />\nPoker Ts. God<br />\nPaul M. Wheeler, will give the<br />\nInterfering With Study<br />\nMarch 27, 1931.—We believe it<br />\nrequired six-minute orations.<br />\nwould constitute a religious experiIt was learned that the topics<br />\nence if, either because of a sponPasadena, Calif.—Fraternities of<br />\ntaneous thought or perhaps one in- California Tech will be asked to will be diversified, and that the<br />\nspired by the Student Council, some move into the new houses in groups, usual addresses on National Proof the fellows who play cards in but without fraternity organization, hibition will share the limelight.<br />\nLevering Hall in excess of five to act as a necleus about which to Subjects were selected by each<br />\nhours daily would decide to spend build a house unity and fellowship member of the class. Dr. Wheeler<br />\nthis time or a large part of it if and to develop to a higher degree made no specifications other than<br />\nnot studying, at least out-of-doors. social and cultural life, it was an- the length and the value of the<br />\nnounced here recently. The an- speeches.<br />\nAll's Well<br />\nnouncement same, as a result of an<br />\nDr. Wheeler yesterday extendMarch 27, 1931.—According to a extensive study of student housing<br />\nstudy recently made of the opin- conditions in America and abroad ed an invitation to the faculty<br />\nions of over twelve hundred stu- by a student committee of Califor- and students to hear the orations.<br />\ndents in colleges and universities in nia Institute of Technology. They<br />\nthe vicinity of Baltimore, Johns are not to rush or pledge and will<br />\nHopkins students outdistances all be non-perpetuating.<br />\nrivals except Washington College in<br />\nTo Instruct In Loafing<br />\ntheir readiness to believe the Jonah<br />\nOne of the unusual features of<br />\nstory literally. Who said Hopkins the recommendations of the report<br />\nis corrupting the religion of our is that provision is made, to serve<br />\nfathers?<br />\nafter dinner coffee in the lounges<br />\nin order to present an atmosphere<br />\nmore conducive to discussion. It is<br />\nhoped that this feature will teach<br />\nthe Tech men how to loaf gracefully<br />\nOther intricacies as to house orPaul B. Sutton Graduate In<br />\nganization, choice of room and conChemistry Is Selected<br />\nduct at meals is treated at length in<br />\nFirst<br />\nthe complete report.<br />\n(Continued from page 1, col. 1)<br />\nGoverning Factors<br />\ning only undergraduate studies, he<br />\nGoverning factors in the study<br />\nwill graduate next June after a<br />\nwere:<br />\nresidence of only three years. He<br />\n1. The organization, control, and<br />\nis a member of the Debating Council. Having been accepted by the social life of the houses must be<br />\nso worked out as to supplement<br />\ngraduate school of Harvard, he will<br />\nrather than detract from or lessen<br />\ncontinue in graduate work at that<br />\nthe high quality of scholastic work<br />\nUniversity, it was learned.<br />\nwhich is now the standard.<br />\nTowbin also required only three<br />\n2. An environment must be creyears to be eligible for a Bachelor<br />\nof Arts degree. He has been prom- ated and maintained which will permit a man to enjoy his leisure time<br />\ninent in undergraduate athletics<br />\nin pleasant and congenial company.<br />\nGraduates In Philosophy<br />\n3. A democratic organization<br />\nGraduates in the School of Philosophy wlib will be initiated into the must be worked out so as not to be<br />\na financial burden to students of<br />\nhonor fraternity are:<br />\nJohn D. Clark, George B. Collins, Warren moderate means.<br />\nM. Cox, Cameron D. Ebaugh, William G. Lynn,<br />\n4. The plan to be recommended<br />\nThomas S. Logan, Thomas Swindall, Bernard<br />\nMayo, James G. McManaway, Helen R. Reese, must be consistent with the progresAlbert K. Weinberg, and C. Walter Young.<br />\nsive idealism of the California InFrom the medical school:<br />\nNorman F. Crane, Morgan Cutts, Marion stitute of Technology.<br />\n<br />\nCALIFORNIA COLLEGE<br />\nTO OUST FRATERNITIES<br />\n<br />\nAND<br />\nDECORATORS<br />\n<br />\nSeeking a Position?<br />\n1918 N. Charles St., near 20th<br />\nPhone: Vernon 0573<br />\n<br />\nWe are receiving inquiries daily for<br />\nteachers<br />\nTHE BALTIMORE TEACHERS<br />\nAGENCY<br />\nWilliam K. Yocum, Manager<br />\nTitle Annex Bldg.<br />\nBaltimore, Md.<br />\nPlaza 1195<br />\n<br />\nDECORATIONS<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\n<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski Street<br />\n<br />\nPHI BETE SELECTS<br />\n31 AT UNIVERSITY<br />\n<br />\nE. Howard. William M. Nicholson, Robert<br />\nW. Cans, Harry D. Kruse, Laurence D. Trevett, and Willis W. Young.<br />\n<br />\nAcedemic Staff ..<br />\n_JO ..<br />\nThe members of the academic<br />\nstaff are:<br />\nBurton E. Livingston, Professor of Plant<br />\nPhysiology, 'William Kurrelemeyer, Professor<br />\nof German, Kent R. Greeneld, Professor of<br />\nModern European History, and associate professor of English, Hazelton Spencer.<br />\n<br />\n—(N.S.F.A.)<br />\n<br />\nYale Twelve Beaten<br />\nBadly By Jays, 18-2<br />\nEli Lacrosse Players Do Not Offer<br />\nOpposition To Hopkins That<br />\nWas Anticipated<br />\n(Continued from page 1, col. 6)<br />\n<br />\nE. B. Mathews was named presi- Kelly, Triplett, J. Henderson; Yale,<br />\ndent of the Hopkins Chapter • for Devaney, Bullard. Substitutes—Hopthe current year, last spring. Other kins, Dukehart for Stone, Triplett for<br />\nofficers of the group are William Darrell, C. Kelly for Turnbull, Cockfor Beehler, Hudert for Kneip, MacH. Wilmer, vice-president; Jo- ey<br />\ngil for D. Kelly, Sneeringer for Guild,<br />\nhannes Mattern, secretary; George Stone for Dukehart, Darrell for Triplett, Turnbull for C. Kelly, Beehler<br />\nH. Evans, Jr., treasurer.<br />\nEstablished in 1895, the Johns for Cockey, Kneip for Hudert, D. Kelfor Macgil, Guild for Sneeringer,<br />\nHopkins University Chapter of Phi ly<br />\nDukehart for Don Kelly, C. Kelly for<br />\nBeta Kappa, honorary fraternity, Guild, Triplett for Turnbull, Cockey<br />\nfor Beehler, Yearley for Ness, Cone<br />\nhas 903 members.<br />\nOn the basis of outstanding schol- for Weitzel, Chancellor for Lang,<br />\nfor Dukehart, Levy for<br />\narship, election to Phi Beta Kappa Sneeringer<br />\nBernard, J. Henderson for Hudert,<br />\nis made from one-fifth of the grad- Merriken for Chancellor, Mattingly<br />\nuating class, one-sixth of candidates for Sneeringer, Wiegand for Cockey.<br />\nfor the Ph.D. degree, and one-sev- Yale. Bullard for Baker, Dreyfus for<br />\nJones, Mallory for Nelson, Devaney<br />\nenth of candidates for the M.D. de- for<br />\nH. Henderson, Hanna for Draper,<br />\ngree. Usually, some members of Burall for Beggs, Griswold for Smith.<br />\nthe faculty are elected to the hon- Referee—Baker. Judge of play—Fred<br />\nWehr. Time of halves-30 minutes.<br />\norary fraternity.<br />\nInitiations into the fraternity will<br />\nPing-Pong seems to be a poputake place on Saturday, April 18, lar sport at many schools. At Fisk<br />\nat 6:45 P. M. preceding a dinner in<br />\nUniversity, students are taking it<br />\nLevering Hall<br />\nup in lieu of spring tennis practice.<br />\nMgde<br />\n<br />\nEXHILARATIA'G IN LINE AND COLOUR, INCOMPARABLE IN<br />\nCHARACTER AND TAILORED<br />\nAND CARE.<br />\n<br />\nA<br />\n<br />\nWITH SUPERIOR TASTE<br />\n<br />\nCHOICE AND CORRECT POSSESSION.<br />\n<br />\nEIGHT<br />\nOTHERS SEVEN<br />\n<br />\nDOLLARS<br />\n<br />\nDOLLARS<br />\n<br />\nAND<br />\n<br />\nUPWARD<br />\n<br />\nAGENTS IN THE PRINCIPAL CITIES OF THE UNITED STATES<br />\n<br />\nitt=ibiliti211.1M214091<br />\n<br />\nTHE FINCHLEY HAT<br />\nWILL BE FOUND HERE EXCLUSIVELY<br />\n<br />\nISAAC HAMBURGER &SONS<br />\nBALTIMORE & HANOVER STS.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1931<br />\n<br />\n4<br />\nallI1111111n101,-<br />\n<br />\nWhat's YOUR<br />\nfavorite<br />\npipe<br />\n<br />\nv-cv<br />\n<br />\nMost PRINCETON<br />\nmen smoke—<br />\nTF you walk along Prospect Street<br />\nI in Princeton you'll notice how<br />\nmany men load their pipes from<br />\nthe familiar blue Edgeworth tin.<br />\nAt Senior Singing on the steps of<br />\nNassau Hall this spring the pipes<br />\nwill glow with Edgeworth.<br />\nA pipe and Edgeworth—this is<br />\nthe smoking combination that has<br />\nwon the college man. Yale, Dartmouth, Cornell, Illinois, Stanford<br />\n... all agree with Princeton.<br />\nCollege men everywhere respond<br />\nto the appeal of pipes—packed with<br />\ncool, slow-burning Edgeworth. Be<br />\nguided by their choice: Try Edgeworth yourself. Taste its rich natural savor that is enhanced immeasurably by Edgeworth's distinctive eleventh process.<br />\nYou will find Edgeworth at your<br />\nnearest tobacco shop-15d the tin.<br />\nOr, for generous free sample, address Larus & Bro. Co., 105 S.<br />\n22d St., Richmond, Va.<br />\n<br />\nEDGEWORTH<br />\nSMOKING TOBACCO<br />\nEdgeworth is a blend<br />\nof fine old burleys,<br />\nwith its natural savor<br />\nenhanced by Edge.<br />\nworth's distinctive<br />\neleventh process.<br />\nBuy Edgeworth anywhere in two forms<br />\n—\"Ready-Rubbed\"<br />\nand \"Plug Slice.\" Alt<br />\nsizes, 150 pocket<br />\npackage to pound<br />\nhumidor tin.<br />\n<br />\n4 LECTURES SCHEDULED<br />\nFOR DOHME FOUNDATION<br />\n<br />\nNUTS HARRY HERMIT<br />\nAnthony- Cianek Meets Difficulties In<br />\nCollaboration Of Book<br />\n<br />\nHygiene Lecture Given<br />\nAt Health School<br />\nDr. W. B. Wherry, Of Cincinnati U.,<br />\n<br />\nAddresses Public On Bacterial<br />\nLectureship Provides For Talks (Continued from page 1, col. 2)<br />\nProteins At J. H. U.<br />\nBy Scientists Before Fel\"He'll say,'What do you mean<br />\n\"Hypersensitivity to Bacterial<br />\nlowship Holders<br />\nby nuts.'<br />\nProteins and Its Role in Sus\"I'll say, 'Nuts are nuts.'<br />\nceptibility and Immunity\" was<br />\nFREUDENBERG TO<br />\n\"He'll say, 'Nuts aren't nuts! the topic of a public hygiene lecSPEAK HERE APRIL 17 Nuts may seem nuts, but there's ture given by Dr. William B.<br />\nnothing to it. You've got to Wherry, professor of bacteriology<br />\nDr. Irving Langmuir, Noted establish definitely that all nuts at the University of Cincinnati,<br />\nAtomic Structure Theorist,<br />\nare nuts, before you can conclude last Tuesday, at 5 P. M.<br />\nthat one nut is a nut. I won't go<br />\nMakes Address Here<br />\nThe lecture was given in the<br />\non with this thing unless you're J. H. U. School of Hygiene and<br />\nFour more noted scientists will going to be logical.<br />\nPublic Health.<br />\n\"I'll say, 'All I'm begging you<br />\nappear at the Johns Hopkins<br />\ndo is furnish the culture. I'll<br />\nUniversity before the fellows in to<br />\nattend to the nuts. Now nuts are Adams Declamation,<br />\nchemistry at Homewood under used for many purposes—'<br />\nDue On April 23rd<br />\nWill Remain Hermit<br />\nthe A. R. L. Dohme Lecture<br />\ndo<br />\n'what<br />\nFoundation, a gift of Dr. Dohme, \"'But', he interrupted,<br />\nTry-Outs For Contest To Be Held On<br />\nyou mean by nuts?'\"<br />\nApril 16th And 18th<br />\nan alumnus of the Hopkins and<br />\nMr. Cianek has retired to his<br />\nIn Levering<br />\nnow retired manufacturing pharlean-to. He says he still likes<br />\nAccording to Dr. Paul M.<br />\nmacist.<br />\nnuts. He says he will remain a Wheeler, all entries for the<br />\nFreudenberg, Gomberg On List<br />\nhermit.<br />\nAdams Declamation Contest and<br />\nApril 17, Dr. Freudenberg will<br />\nDe Tocqueville Lecture Contest<br />\nvisit Homewood to speak. One<br />\nmust be filed with Charles Ney,<br />\nweek later April 24, Dr. Moses<br />\nof the debate, before<br />\nmanager<br />\nGomberg, of the University of<br />\nApril 14; topics must<br />\nof<br />\nmidnight<br />\nMichigan and president of the<br />\nwith entries. Sophoadmitted<br />\nhe<br />\nAmerican Chemical Society, is<br />\nOn mores are eligible for the Adams<br />\nC.<br />\nC.<br />\nB.<br />\nDebate<br />\nTo<br />\nFrosh<br />\nCharles<br />\nscheduled to lecture. Dr.<br />\nContest and all other undergraduEntrance To League<br />\nA. Kraus, of Brown University,<br />\nare eligible for the De Tocqueates<br />\nwill be here May 8; Dr. Wilder<br />\nville Contest. Speeches for each of<br />\nFRIDAY<br />\nFOR<br />\nSET<br />\nFRAY<br />\nD. Bancroft, of Cornell Univerthese contests will be six minutes or<br />\nsity, May 15.<br />\nHood Tues- less apiece.<br />\nMeet<br />\nTo<br />\nVarsity<br />\nFunds provided for by Dr.<br />\nFor the Adams Contest, any<br />\nday At Frederick<br />\nDohme enables the department<br />\nAmerican prose selection of the<br />\nof chemistry to bring to the<br />\nSwinging into what supporters twentieth century will be acceptJohns Hopkins, men of promi- declare is the most active cam- able providing it does not deal<br />\nnence in the scientific world to paign in fourteen years, Hopkins with a political problem. Tryouts<br />\nspeak to and personally inter- newly-organized Debating Coun- for the Adams Contest will be<br />\nview the fellows in chemistry on cil will sponsor six events in its held on Thursday, April 16th at<br />\nthe campus.<br />\nprogram in sixteen days. Its 11.30 A. M. in Levering Hall,<br />\nDr. Langmuir Lectured Friday<br />\nteams it was learned wi,11 travel Room B.<br />\nContestants in the De TocqueDr. Irving Langmuir, associate to the Alemeda, to Frederick,<br />\ndirector of the research depart- and to Annapolis. In the mean- \\rifle Contest must deliver a lecment, General Electric Co., ad- while intermural contests will be ture in English on any phase of<br />\ndressed the fellows in one of the sponsored, and a team from West French history of the nineteenth<br />\nVirginia University brought to and twentieth centuries. Tryouts<br />\nseries of lectures last Friday.<br />\nfor this contest will be held Sat\"Selecting the Chemist-Elect\" the campus.<br />\nIn reporting his activities to urday, April 18th at 1 P. M. in<br />\nwas the topic discussed by Dr.<br />\nLangmuir, also a noted atomic the Debating Council recently, Levering Hall, Room B.<br />\nAt the tryouts four speakers<br />\nstructure theorist, at the dedica- Harold Yudkin, president dethe<br />\nof<br />\nwill<br />\nbe selected for each contest.<br />\nbecause<br />\nonly<br />\nthat<br />\nclared<br />\nestablishtion exercises for the<br />\nment of the Frances P. Garvan unusually large number of men Both contests will take place at<br />\nchair of chemical education at interested in forensics this year the Assembly on April 23rd.<br />\nwas such a program possible. He<br />\nHomewood, held Oct. 11, 1929.<br />\nquoted Coach Lyons as saying<br />\nFour Others Given<br />\nwhile only one or two interthat<br />\nBesides Dr. Langmuir's lecture<br />\nvictories were possible<br />\ncollegiate<br />\nhave<br />\ntalks<br />\nother<br />\nlast Friday four<br />\nbeen presented during the aca- this year, next year would be the<br />\nmost \"successful in the history of<br />\ndemic year.<br />\ndebating at this University,\"<br />\nwith at least three experienced<br />\nteams available for competition.<br />\n<br />\nELCOME<br />\nPARISIAN TAILORING<br />\nCOMPANY<br />\nCleaning, Dyeing, Pressing<br />\nRepairing<br />\n346 E. 33rd STREET<br />\nCor. University Parkway<br />\n<br />\n'To<br />\n<br />\nNEW YORK AND<br />\n_ THE<br />\n<br />\nMOTEL<br />\nGOVERNOR<br />\nGINTON<br />\n3151-ST.cif_6___D 77-2AV<br />\nOPPOSITE<br />\n<br />\nPENNA.RR.STATION<br />\n<br />\nThe freshman .crass of the University will hold its second annual debate with the varsity team<br />\nof the Baltimore City College, at<br />\nthat institution, on Friday. Saul<br />\nDorfman, Samuel Doctofskey and<br />\nCharles Stern will represent the<br />\nfreshmen, with Paul• Strong as<br />\nalternate. The topic for debate<br />\nwill be Resolved: that the United<br />\nStates enter the League of Nations. Hopkins will uphold the<br />\naffirmative.<br />\n<br />\nYou owe them the best entertainment to be had. Rent a Saunders<br />\nSystem car—show them the town—<br />\nboulevards—theatres—parks—then<br />\nsee them to the station when their<br />\nvisit is over. We have special low<br />\nrates for such occasions. Ask for<br />\nestimates on brand new Chryslers,<br />\nand Model A Fords.<br />\n<br />\nCURTAIN AT 5.30 SHARP<br />\nDINNER INTERMISSION, 7.40 to 9<br />\nReturns by Popular Demand<br />\n<br />\nTHE THEATRE GUILD, INC.<br />\nPRESENTS<br />\nEugene O'Neill's Extraordinary Nine-Act Drama<br />\n<br />\nA new system of debating will<br />\nbe tried here it was learned. It is<br />\nplanned to employ three constructive speeches of ten minutes and<br />\none rebuttal of eight minutes by<br />\neach team with no decision. Attire will be formal, and arrangements are being made for the<br />\ntransportation of persons who<br />\nwish to make the trip. Officials<br />\nrequest that anyone desiring to<br />\ngo to Frederick, and any member<br />\nof the Council and Club who will<br />\nhave room for passengers, to drop<br />\na note in P.O. Box 1172 immediately. Members of the team will<br />\nbe chosen this week from among<br />\nStanton, Brook, Doctofsky, Wasserman, Stark and Blum.<br />\n<br />\nStrange<br />\nInterlude<br />\nThe Cast: Elizabeth Risdon, Glenn Anders, Richard<br />\nBarbee, Leonard Mudie, Maurice McRae, Maud<br />\nDurand, Ethel Westley, John J. Burns, Jack Grattan.<br />\n<br />\n\"Friend of the Hopkins Man\"<br />\n<br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br />\n<br />\nont<br />\n<br />\nwait<br />\n<br />\n10<br />\n<br />\nuntil your valves<br />\nneed grinding<br />\nto learn that<br />\nAMOCONGAS<br />\n10,1psitntile!<br />\n644<br />\n<br />\nTravel To Frederick<br />\n<br />\nThe varsity team captained by<br />\nLlewellyn Stanton, who has again<br />\nreturned to debating, will travel<br />\nto Frederick meeting the strong<br />\nHood team next Tuesday evening. The topic will be Resolved.: that the colleges of the<br />\nUnited States adopt the Oxford<br />\nSystem of calling for Honors.<br />\nHopkins will again uphold the affirmative.<br />\nNew System Used<br />\n<br />\nMOTHER AND<br />\nDAD VISIT YOU<br />\n<br />\nPrices: $3.00, $2.50, $2.00, $1.50, $1.00<br />\n<br />\nDEBATING PROGRAM FULL<br />\nFOR FORTHCOMING WEEK<br />\n<br />\nFreshmen To Debate<br />\n<br />\nBelmont 8040-8041<br />\n<br />\nTHIS WEEK<br />\n<br />\n1<br />\n<br />\nWest Virginia Here<br />\n11 E. NORTH AVENUE<br />\nVernon 2704<br />\n<br />\nA week from Friday, Hopkins<br />\nwill entertain a team from WestA pre-eminent Hotel of 1200 Virginia University at Latrobe<br />\nHall 120, debating upon UnemRooms, each having Bath, ployment Insurance again. The<br />\nSe r vi do r, Circulating Ice same system of debating as employed against Hood will be used,<br />\nWater and many other inno- except that there will be a devations ... featuring a sincere cision. The team will be chosen<br />\nfrom Leo Alpert, Louis Kroll,<br />\nspirit of hospitality.<br />\nVlado Getting, Harold Kuslovitz,<br />\nNathan Harris, and Paul Bendix.<br />\nMyron Herman is in charge of the<br />\n'ROOM AND BATH $3UP reception<br />\ncommittee to the visiting<br />\nteam.<br />\n<br />\nAmoco-Gas gives better, allaround performance than<br />\nyou've ever known and it-,<br />\nCOSTS LESS PER MILE!<br />\nAMERICAN OIL COMPANY<br />\nAMI.ated<br />\n<br />\nPan Anse...ran Pegroltum<br />\n<br />\nTrant,..... Cony,<br />\n<br />\nGtneral Offirm American Bldg.Baltimore, Md<br />\n<br />\n\f", "format": "basic_html", "processed": "H. L. FRIEDBERG<br /><br />\nNEWS-LETTER<br />\nSTAFF WILL HOLD<br />\nBANQUET<br />\nANNUAL<br />\nThursday<br /><br />\nVol. XXXV, No. 42<br /><br />\nPHI BETE ELECTS<br />\n31 AT UNIVERSITY<br />\nTO MEMBERSHIP<br /><br />\nEASTER<br />\nMEDITATIONS<br />\nPage Two<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD,BALTIMORE, APRIL 7, 1931<br /><br />\nDr. Powell To Deliver<br />\nBaccalaurate Sermon<br /><br />\nBe Held In Emmanuel<br />\nChurch, Sunday, June 7, 11 A. M.<br />\nYellot Announces<br />\nThe Rev. Dr. Noble C. Powell<br />\nwill deliver the baccalaureate sermon for the graduating class of<br />\nthe Johns Hopkins University,<br />\nSunday, June 7, 11 A. M., at the<br />\nEmmanuel<br />\nChurch, Cathedral and<br />\nPaul B. Sutten, Graduate In<br />\nRead streets, John Yellot_ anChemistry Is Selected<br />\nnounced today.<br />\nFirst<br />\nNow rector of the church, Rev.<br />\nPowell was for five years chapAWARDED FELLOWSHIP<br />\nFOR CHEMISTRY WORK lain at the University of Virginia.<br /><br />\n12 Philosophy Grads. 8 Medicos, 4 of Faculty Also<br />\nElected<br /><br />\nServices Will<br /><br />\nPrice 5 Cents<br /><br />\nAUTHOR WHO<br />\nJENNINGS, HAVENS FOOTBALL DECISION FAMED<br />\nWILL SPEAK TODAY YALE TWELVE<br />\nGRANTED LEAVES DELAYED BY AMES<br />\nBADLY BEATEN<br />\nDURING NEXT YEAR UNTIL NEXT MONTH<br /><br />\n15<br />\nBY<br />\nJAYS; SCORE 18-2<br /><br />\nDr. Jennings to Leave for Jap- President Will Not Submit Athan in July; Dr. Havens for<br />\nletic Committee Report<br />\nSicily in February<br />\nTo Trustees<br />\n3 OTHER PROFESSORS<br />\nBELIEVES REPORT WELL<br />\nTO GO ABROAD SOON<br />\nCOMPILED ADEQUATE<br /><br />\nEli Stickmen Do Not Offer<br />\nSt,long Opposition That<br />\nWas Anticipated<br /><br />\nDr. Johannes Mattern Will Said to Contain No Provisions<br />\nMake Study of German<br />\nFor Abolition of Intercollegiate Football<br />\nJudicial System<br /><br />\nSMOOTH RUNNING JAY<br />\nATTACK SCORES AT WILL<br /><br />\nACTION OF CAGE FUND Two professors of the Johns<br />\nCOMMITTEE SUSPENDED Hopkins have been granted leaves<br /><br />\nGame Marks 2nd Consecutive<br />\nFinal decision on the status of<br />\nVictory for Hopkins<br />\nfootball at the Johns Hopkins UniLacrossemen<br />\nof absence for the next academic versity will be delayed for at least<br />\nWill Wait For Settling Of year, Dr. Joseph S. Ames, president a month, it became apparent yesAthletic Question<br />\nFollowing a conference of the ofBursting forth with a brilliant<br />\nof the university announced yester- terday when Dr. Joseph S. Ames,<br />\nficers of the Johns Hopkins chapter<br />\nbrand<br />\nof teamwork and speed, the<br />\nday. The professors are Dr. Herb- president, announced that he would<br />\n9 ADMITTED TO CLUB<br />\nGEORGE W. RUSSELL<br />\nof the Phi Beta Kappa honorary<br />\nBlue Jays, last Saturday, thundered<br />\nert S. Jennings Professor of Zool- make no recommendations to the<br />\nfraternity, late yesterday afternoon Committee Of Five To Plan ogy and Dr. Raymond D. Havens, Board of Trustees from the report<br />\nAn author of more than 20 on to their second successive vicJohannes' Mattern, secretary, anTrophy Room<br />\nProfessor of English Literature.<br />\nsubmitted to him by the athletic works and a painter of wide tory by trouncing the Yale twelve<br />\nnounced that 31 elections had<br />\nrepute, George W. Russell will 18-2. Despite predictions that the<br />\nDr. Jennings has been invited by committee.<br />\nIn a statement of the activities<br />\nbeen made from the graduating class<br />\npresent the first of two lectures Black and Blue was in for a warm<br />\nAmes Believed in Favor<br />\nof undergraduate school, the School of the Varsity Club made recently the Keio University of Tokyo,<br />\nthe Johns Hopk.ns Univer- afternoon, Yale undoubtedly was no<br />\nat<br />\nJapan,<br />\nto assist in the modernizaDr. Ames has declared that the sity under the Percy Graeme match for Hopkins.<br />\nof Philosophy, the School of Medi- by Club officials, it was reported<br />\ncine and members of th-e academic that the lately-appointed Cage Fund tion of its biology department, it report is well-done and presents Turnbull Lecture Foundation<br />\nThe Jay attack commenced at the<br />\nCommittee has suspended action un- was learned. The Keio University adequate plans for the improvement at 5 P. M. in Latrobe Hall<br />\nstaff.<br />\nto- opening whistle and never let up unwhile<br />\nimperial<br />\nunder<br />\nnot<br />\nendowtil<br />\nthe<br />\nathletics<br />\nHopquestion<br />\nat<br />\nof<br />\nof athletics and physical training day. His topic will be \"Some<br />\nFirst selection from the undertil the very finish. The ball was<br />\ngraduate school was Paul P. Sut- kins is decided by the Trustee ment is the oldest university in at Homewood. It is on the basis Personalities of the Irish Lit- passed constantly and the Yale goal<br />\nJapan.<br />\nof this opinion of the president's erary Movement.\" \"A Poet and<br />\nton. Others, in the order in which Board. The close interdependence<br />\nEstablishing Medical College<br />\nthat it was thought that he would Artist Considers Dreams\" is was literally showered with shots.<br />\nthey were selected are the following: of the Cage and Football issues has<br />\nEven when a shot failed,<br />\nAt present, Dr. Jennings declared. bring the report before the Trustees the title of the second lecture ber of the Jay attack one memRaymond N. Love, John A. Wheel- forced the Committee to this stand<br />\nwas on the<br />\nit<br />\nwas<br />\ndeclared.<br />\nthe Japanese university is in the late yesterday for whatever action that is to be given Thursday.<br />\ner, Vlado A. Getting, Belmont A.<br />\nspot backing up every missed atWelcomes<br />\nEntertainment<br />\nCommittee<br />\nthat<br />\ngroup<br />\nwould<br />\nto<br />\ntake.<br />\ndesire<br />\nprocess of establishing a medical<br />\nTowbin, Robert T. K. Murray, The<br />\ntempt and starting the plays all over<br />\nEntertainment Committee college<br />\nand the enlargement of the<br />\nWarren I. Reinhardt and Emanuel delegated<br />\nStudents on the campus claiming<br />\nagain. The Yale defense was simpto provide for the wel- field of<br />\nKaplan.<br />\nbiological research has been to possess authentic information on<br />\nly dazzled and couldn't get set; and,<br />\nfare of visiting athletic teams, be- undertaken<br />\nfor this reason.<br />\nthe matter declare that the report<br />\nEntered In 1928 -had it not been for Draper, Eli<br />\ngan its functions last week-end by<br />\nSutton entered the undergrad- greeting the Yale Lacrosse Team. In Japan, where he will remain itself is actually a compromise begoalie, there's no telling what the<br />\nuate school in 1928. At the end of It was also stated that the Look until September, 1932, the Hopkins tween members of the committee<br />\nscore might have been.<br />\nhis first year of residence on the Out Committee has not quite com- professor said he will continue his •ontaining no provisions for the abo- Seven Speakers Will Address<br />\nEli Defense Stunned<br />\nThe Third Conclave<br />\nown research work on the genetics lition of football.<br />\nThe Yale defense was also<br />\nHopkins campus. he was awarded pleted its plan of work as yet.<br />\nof proxtozoa while at the same time<br />\na four year fellowship in Chemistry.<br />\nstunned by the rushing tactics of<br />\nIt is believed the matter will<br />\nIn order to supply what has been<br />\nTHOMAS TO SPEAK<br />\nthe Jay attack .Throughout the<br />\nWith the expiration of the current asserted to be a long felt need of conducting seminars and delivering reach the Board of Trustees before<br />\nfracas, the Hopkins offense rushed<br />\nacademic term, he will have coni- the University, that of fitting up a lectures. Upon Dr. Jennings de- the culmination of the present acpleted two years of study under the trophy room. A committee com- parture at the end of next July, Dr. ademic year. The findings and sug- 200 Delegates From U. S. Col- every Eli defender as soon as he<br />\nAlexander Weinstein, research as- gestions of the committee, headed<br />\nleges Are Expected<br />\nfellowship.<br />\nblocked a Jay pass. This plan aidposed of William Triplett, Chair- sociate will<br />\ncontinue<br />\nlectures<br />\nthe<br />\nin<br />\ned Hopkins considerably and, on<br />\nby Dr. Ronald T. Abercrombie,<br />\nWithdrew From College<br />\nman, Ted Stern, Fritz Stude, Oscar genetics<br />\nnow being given by the however, director of physical eduDiscussions of unemployment several occasions, Yale defenders<br />\nFollowing his freshman year in Linck, Nathan Silverman and Joe<br />\ncation, will not be revealed by offi- will feature the one-day confer- enCountered great difficulty even in<br />\n1926-27, Love withdrew from the Bauer, has been appointed to ar- former.<br />\nWill Work On \"Prelude\"<br />\ncials at the Hopkins, it was learned. ence to be held at Levering Hall, advancing the ball to their own atcollege. However, a year later he range for the necessary alterations<br />\nDr. Havens will leave next FebruSaturday, by the Johns Hopkins tack. Those who saw the St. Johnsreturned to his studies under a in the old athletic offices, which are<br />\nOther Members Named<br />\nary for Sicily to begin his research<br />\nUniversity Liberal Club. Seven Hopkins duel last year will recall<br />\nscholarship grant of the Board of to be used for this purpose.<br />\nIn addition to Dr. Abercrombie, speakers will address the third Johnnies employing this same the<br />\nwork for a volume on Wordsworth's<br />\nsysTrustees.<br />\nAnnounces New Members<br />\n\"Prelude.\" Dr. Havens declared, the members of the group selected annual conclave, which will be tem in a similar impressive fashion.<br />\nIn Ms junior year, he again reAt a recent meeting, Frank Cone<br />\nin January, are Dr. E. W. Berry, divided into four sessions.<br />\nJay Reserve Strong<br />\nceived a grant from the executive announced that the following men however, that the greater portion of dean; Dr. Ray Van Orman,<br />\nathletics<br />\nhis<br />\nperiod of absence would be spent<br />\nHowever, in order to make this<br />\nThe morning session will feaboard and entered the Chemistry having received their major 1-1's<br />\nat either Oxford or Cambridge in director; Douglas Turnbull, Jr. and ture talks on causes of unemploy- type of play successful, a team must<br />\ndepartment under the New Plan.<br />\nduring the past few months, were England.<br />\nH. Garland Hershey, alumni; Rob- ment. Addresses are<br />\nto be de- have a strong reserve and the<br />\nReceived Scholarship.<br />\nto be admitted to the club: Stern<br />\nert Kyle and John Heinzerling, :livered by Dr. George E. Barnett, have it this year. Practically Jays<br />\nThe<br />\nEnglish<br />\nprofessor<br />\nsaid<br />\nthat<br />\nevery<br />\nWheeler received a Carrolton and Boyce, special major H for<br />\nseniors.<br />\nprofessor of statistics at the Hop- substitute exhibited outstanding<br />\nscholarship for his first two years swimming; Taylor, Silverman, the he had been led to undertake the<br />\nWhat action, if any, Trustees will kins, who will speak on \"Cyclical ability, although replacements on the<br />\nat Hopkins. In his junior year at Kelley brothers, Don and Caleb project by the large amount of \"new<br />\ntake on the erection of a cage at Unemployment\"; Harry W. offense were frequent, no let up<br />\nmaterial\"<br />\non<br />\nthe<br />\nsubject<br />\nthat<br />\nhad<br />\nHopkins he pursued graduate stu- Brooke, Gunnett and Kyle, mgr.;<br />\nHomewood cannot be ascertained, Laidler, president, National Bu- in its brilliance was distinguishable.<br />\ndies in Physics upon which he is major H for basketball. These been brought to light in recent years.<br />\nas it is unknown just what move reau of Economic Research, who Thus, if the saying, \"a team is as<br />\nMany<br />\nauthorities,<br />\nhe<br />\nexplained,<br />\nhold<br />\nstill engaged.<br />\nmen may obtain their memberthe report suggests be made to- will talk on \"Techniological Un- good as its reserve\" hold water, then<br />\nHe has been active in several ex- ship pins from Oscar Helm, sec- \"The Prelude\" in as great esteem ward such a building.<br />\nas<br />\nMilton's<br />\n\"Paradise<br />\nLost.\"<br />\nHopkins possesses a powerful<br />\nemployment.\"<br />\ntra-curriculal activities including de- tretary-treasurer.<br />\nLovestone,<br />\nIsrael<br />\ntwelve.<br />\nSpeakers<br />\nOthers<br />\nAlso<br />\nWill<br />\nBe<br />\nAbsent<br />\nbating in which he won the Adams<br />\nCone further stated that the<br />\nJay Lovestone, secretary, ComDefense Has Little Work<br />\nAmong other members of the Dr. E. V. McCollum<br />\nPrize last year as a member of the club routine is in smooth workmunist<br />\nParty<br />\n(majority<br />\ngroup),<br />\nThe<br />\nJay defense, on the other<br />\nHopkins<br />\nfaculty<br />\nabsent<br />\non<br />\nwill be<br />\njunior team.<br />\ning order. A drive is now under<br />\nTo<br />\nRepresent<br />\nU.<br />\nS.<br />\nafternoon<br />\nat<br />\nthe<br />\nportion<br />\nof<br />\nthe<br />\nhand,<br />\nhad<br />\nvery little opportunity to<br />\nvarious<br />\nresearch<br />\nduring<br />\nthe<br />\nprojects<br />\nEntered In 1928<br />\nway he said, to acquire funds for<br />\nconclave will discuss \"Economic display its wares. However, considGetting entered the undergrad- the organization in order to pro- summer are Johannes Mattern, Asuate school in 1928. While pursu- vide more adequate means for sistant Librarian; William Kurrel- Es One Of Ten American Delegates To Consequences.\" Dr. Edward L. ering its stubborn stand against the<br />\nmeyer, Professor of German; and International Dairy Congress, To Israel, rabbi of the Har Sinai Con- Olympic Club on March 28 it like(Continued on page 3, col. 2)<br />\nvarious activities.<br />\nBe Held In Copenhagen<br />\ngregation, has selected \"Social wise is worthy or praise. On that<br />\nArthur 0. Lovejoy, professor of<br />\nday the team that represented the<br />\nDr. E. V. McCollum, professor Consequences\" as his topic.<br />\nPhilosophy.<br />\nRound table discussions at the United States in the Olympics of<br />\nDr. Mattern will leave shortly for of biochemistry at the Johns HopGermany to conduct a study of the kins School of Hygiene today was afternoon session are to be led 1928 proved no match for the Black<br />\njudicial system of that country named by Arthur M. Hyde, Secre- by Joel Seidman, H. G. Burke, and Blue Varsity. Tom Biddison,<br />\nunder a grant furnished by the So- tary of Agriculture, one of ten dele- Lazare Teper and B. Van Dusen, at one time one of the state's leadall members of the Liberal Club. ing attack men, could do nothing.<br />\ncial Science Research Council. Dr.<br />\ngates to represent officially the<br />\nThomas Principal Speaker<br />\nWeitzel, Jay cover point, smeared<br />\ntravel<br />\nMattern<br />\nwill<br />\nsaid<br />\nhe<br />\nthat<br />\nAnthony Cianek, Recluse, Meets Philosophical Difficulties<br />\nNorman<br />\nThomas, noted Social- every one of his opponent's efforts.<br />\nUnited<br />\nStates<br />\nInternational<br />\nat<br />\nthe<br />\nthroughout Germany stopping off<br />\nIn Collaboration On Book Of Nuts With<br />\nat such cities as Hamburg, Bremen, Dairy Congress, to be held in Co- ist who addressed the student In fact, the Jay defeneder clung<br />\nBerlin and Leipzig to study their penhagen, Denmark, July 14 to 17, body at an assembly, will speak like a leech.<br />\nDr. George Boas<br />\nrespective methods of meeting legal according to an Evening Sun dis- on \"Socialization as a Solution of<br />\nStars Held Scoreless<br />\nthe Unemployment Problem\" in<br />\nAll those former Hopkins stars<br />\nAnthony Cianek, hermit, who laissez-faire. That's how I raised problems.<br />\npatch.<br />\nthe principal address of the eve- found the Black<br />\nWill Write Book<br />\nwas discovered recently in a ram- my 12 children. I was thinking<br />\nand Blue defense<br />\nning session of the conference. almost<br />\nIn<br />\nannouncing<br />\nthe<br />\nselection<br />\nof<br />\nthe<br />\nUpon<br />\nhis<br />\nreturn<br />\nnext<br />\nSeptember,<br />\nimpregnable. Norman Robinshackle lean-to in Wyman's Park, of asking them down to the leanOthers who will speak before the son,<br />\nBill Logan, and Helfrich simpvisited Levering Hall last week to, but hell!\" he meditated, \"you he said he will assemble data de- American delegates, Secretary Hyde Liberals are<br />\nIsador Lubin, eco- ly could not get going.<br />\nrived<br />\nfrom<br />\nhis<br />\nresearch<br />\ninto<br />\na<br />\nbook<br />\npointed out that the official particifor the first time during the know damn well you can't get 14<br />\nEvery effort<br />\nnomic adviser to U. S. Senator was crushed<br />\nand those shots which<br />\nSpring vacation. Mr. Cianek who brats into a lean-to. Besides my intended as a companion volume to pation in this important interna- Wagner,<br />\nwhose address will be they could take were quickly<br />\nhas lived for several years in the brats have taken to this laissez-faire his \"Constitution Jurisprudence of tional meeting, at which many of<br />\nsnared.<br />\non \"Unemployment Insurance\";<br />\nthe<br />\nGerman<br />\nRepublic\"<br />\nwritten<br />\nsevCoupled with this brilliant defenwoods behind the University with- idea so well, that I'll be darned<br />\nthe countries of the world will be and J. P. Troxwell, executive di- sive<br />\neral years ago.<br />\ndisplay, the Jay attack kept<br />\nconsiderable attention to himself by if I know where they are!\"<br />\nrepresented, both officially and un- rector of the Municipal Commis- driving with consistency shot after<br />\nThe<br />\nediting<br />\nof<br />\nthe<br />\nwork<br />\nof<br />\nthe<br />\nhis humble philosophy and his unAllows For Error<br />\nGerman poet, Wieland, on which officially, was made possible by an sion of Employment Stabiliza- shot until the Olympic defense also<br />\nceasing .searching for nuts.<br />\n\"But Mr. Cianek,\" a questioner Dr. Kurrelmeyer has been engaged<br />\ntion, who will<br />\nThe purpose for the visit, Mr. interrupted, \"one<br />\nappropriation of $10,000 by Con- Stabilization.\" talk on \"Industry crumbled. Consequently, the Olympic Club tasted the first shutout of<br />\nCianek said, was to determine say you have 12 moment you for the past eight years will be con- gress.<br />\nOfficials of the Liberal Club at its career to the tune<br />\nchildren, the tinued by him in Germany during<br />\nJust what advantages the build- next 14.\"<br />\nof 6-0.<br />\nThe meeting will be held in the Homewood expect more than 200<br />\nthe summer under the Berlin<br />\nLine-up of the Jay-Eli game:<br />\ning possessed for quiet and lib\"Oh,\" he replied biting a nut, Academy.<br />\nDanish House of Parliament, under delegates from colleges througheral thought while he is collab- \"I always take into<br />\nYale<br />\nconsideration<br />\nDr.<br />\nLovejoy<br />\nthe<br />\npatronage of King Christian X. out the United States to attend. Johns Hopkins<br />\nwill<br />\ndeliver<br />\na<br />\nseries<br />\norating on his book on nuts with (he spat<br />\nStude<br />\nDraper<br />\nout<br />\nthe<br />\nshells)<br />\nthe<br />\nrate<br />\nof lectures in London.<br />\nDr. George Boas, associate proAt<br />\nthis<br />\ncongress<br />\ngreat importance<br />\nFields<br />\nof marginal error.\"<br />\nPACKARD NAMED EDITOR Bernard<br />\nWeitzel<br />\nC P<br />\nfessor of Philosophy at Hopkins.<br />\nHowell<br />\nwill be attached to the presentation<br />\nWhen<br />\nquestioned<br />\nconcerning<br />\nNess<br />\nFD<br />\nFlygare<br />\nFinds Too Much Liberalism<br />\nSeven Gas Engineers<br />\nof the latest results of dairy re- 42nd Edition Of Handbook To Be Kneip<br />\nS D<br />\nNelson<br />\nAfter looking the situation his co-authorship with Dr. Boas,<br />\nReady For Re-Opening Of HopLang<br />\nTD<br />\nJones<br />\nVisit Three Plants earch and experimental work.<br />\nkins Next October<br />\nOver, the recluse asserted that he Mr. Cianek seemed to be rather<br />\nBeehler<br />\nSmith<br />\npessimistic.<br />\n\"I<br />\noriginally<br />\nconhad found too much liberalism at<br />\nThe object of the federation, it<br />\nT A<br />\nH Henderson<br />\nGeorge Packard was named Stone<br />\nS A<br />\nLevering Hall. He declared that ceived this idea!\" he complained. Hopkins Students Last Week Take was explained, is to help to bring editor-in-chief and Cliff Gilbert, Guild<br />\nBeggs<br />\nD. Kelly<br />\nF A<br />\nBaker<br />\nInspection Tour<br />\nthe liberalism at the Y. M. C. A. \"It was all mine. All I wanted<br />\nabout co-operation by the dairy in- business manager, of the 42nd rurnbull<br />\nO H<br />\nGaston<br />\nDr.<br />\nBoas<br />\nto<br />\ndo<br />\nwas<br />\nto<br />\nfurnish<br />\nbuilding was much too noisy. He<br />\nSeven students in Gas Engineer- dustries of all countries in promot- edition of the Johns Hopkins Darrell<br />\nIH<br />\nWeber<br />\nindicated that he preferred quiet the culture. But we can't agree ing and Dr. Lloyd Logan, associate ing the technical and scientific de- University Handbook, to be dis- Score by halves:<br />\nas<br />\nto<br />\njust<br />\nwhat<br />\nnuts<br />\nare<br />\nand<br />\nto<br />\nsoothing liberalism.<br />\nprofessor of Gas Engineering, last velopment of the industry through- tributed at the opening of the<br />\nJohns Hopkins<br />\n8 10-18<br />\n\"I'm beginning to feel more just what culture is.<br />\nUniversity for the academic year<br />\nweek visited the Seaboard Coke out the world.<br />\nThinks Nuts Are Swell<br />\nYale<br />\n2-2<br />\n0<br />\nsympathy for the down town Y.<br />\n\"I'll say, 'I think nuts are Products Co., of Reainey, N. J.; The American delegates selected 1931-32.<br />\nGoals—Hopkins,<br />\nStone<br />\n(3),<br />\nGuild<br />\nAt C. A.,\" he advanced. \"My idea<br />\nConsolidated Gas Co. of New York, today wfill sail from New York<br />\nBennett, Kaufman, and Mul- (3), D. Kelly (2), Cockpy (2), Darrell<br />\nand theory of how to raise young swell.\"<br />\nAstoria, L. I.; and Standard Oil July 1 on the \"George Washing- hauser will aid the new editor-in- (2), Beehler, Turnbull, Dukehart, C.<br />\nMen is to adopt an attitude of (Continued on page 4, col. 3)<br />\nCo. of New Jersey, Bayway, N. J. ton.\"<br />\nchief, it was announced.<br />\n(Continued on page 3, col. 3)<br /><br />\nUNEMPLOYMENT PARLEY<br />\nSET FOR END OF WEEK<br /><br />\nNut Question Harries Hermit<br />\nOn Visit to Hopkins Campus<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1931<br />\n7<br /><br />\nWSIETT R<br /><br />\nIIEJOBISH<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice in Baltimore.<br />\nMd., under the Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the Students of Johns Hopkins<br />\nUniversity.<br /><br />\nshould<br /><br />\nBusiness communications<br /><br />\nother communications to the<br /><br />\nto<br /><br />\nbe addressed<br /><br />\nthe<br /><br />\nBUSINESS MANAGER,<br />\nMANAGING EDITOR;<br /><br />\nAll articles should be sent to the<br /><br />\nEDITOR-IN-CHIEF.<br />\nBelmont<br /><br />\nTelephone<br /><br />\n8778<br /><br />\nEDITORIAL DEPARTMENT<br /><br />\nEditor-in-Chief<br />\nGEORGE H. DOWELL, '31<br />\nManaging Editor<br />\nFRANK CONE, '31<br />\nAssistant Managing Editors<br />\nROWLAND McD. NESS, '32<br />\nSYLVAN LEBOW, '32<br />\nJunior Editors<br />\nDONALD PROCTOR, '33<br />\nHARRY GOODMAN, '33<br />\nJACK GREENFIELD, '33<br />\nHAROLD KUSLOVITZ, '34<br />\nSAMUEL M. DOCTOFSKEY, '34<br />\nNORMAN HEANEY, '34<br />\nMORDECAI EDELMAN, '34<br />\nMARLOWE PERRY, '32<br />\nBERNARD VERLIN, '33<br /><br />\nNATHAN M. HARRIS, '32<br />\nHAROLD B. YUDKIN,'32<br />\nHERBERT L. FRIEDBERG,'33<br />\nMARION GROVE, '33<br />\nHYMAN LEVIN, '34<br />\nSANFORD SARNEY, '34<br />\n_JEROME BLUM,'34<br />\nSTANLEY STILLMAN, '33<br />\nRAYMOND DUNN,'33<br /><br />\nBUSINESS DEPARTMENT<br /><br />\nBusiness Manager<br />\nGus BURK, '31<br />\nAdvertising Manager<br />\nDAVID SYKES, '32<br /><br />\nBy<br /><br />\nH. L. Friedberg<br /><br />\nI.<br /><br />\nFOUNDED 1897<br /><br />\nJohns Hopkins University.<br /><br />\nEaster Meditations II<br /><br />\nCirculation Manager<br />\nGEORGE W. LA MONT,'32:<br /><br />\nI do not know that I qualify, but<br />\na friend has forwarded me a pamphlet advertising an apparently phenomenal volume on \"Woman—Her<br />\nSex and Love Life.\" One page recounts the chapter titles. After listing such topics as: \"Why a Misstep in a Girl is More Serious Than<br />\nin a Boy\"; \"The Female Sex Organs; Their Anatomy\"; \"Illegitimate Motherhood\"; \"The Girl Who<br />\nLost Her Virginity\"; \"Dainty Underwear\"; \"Simultaneous Loves<br />\nPossible ;\" \"Love in the Life of<br />\nPeople of High Culture\"; \"Conception and Abortion Radically<br />\nImpresDifferent\"; \"Maternal<br />\nsions\"; \"Syphilis\" and \"Venereal<br />\nProphy-Laxis\",—after listing all of<br />\nthese, I say—the author (the great<br />\nbut mysterious Dr. Robinson) finally comes to \"Promiscuous Kissing.\"<br />\nIn other words the chronological<br />\norder suggests that a young girl<br />\n(unprotected) who has done what<br />\nFreud suspects she would like to<br />\ndo, become a mother without a franchise granted by God, worn salacious underwear, loved two persons<br />\nsimultaneously and as a result of<br />\nher—to be poetic—indiscretions gotten the worst of things, has succeeded to such a state of ignominy<br />\nthat she now must be shielded from<br />\n\"Promiscous Kissing.\" Such a<br />\nmetaphysical conception of sin can<br />\nonly be rivalled by that of the Hopkins Student Council which having<br />\nbeen originally commissioned to prevent intellectual larceny on the Hopkins campus, exhausts all of its<br />\nenergies providing an audience for<br />\nincompetent assembly entertainers.<br /><br />\nOffice Manager<br />\nISADORE C. GUTMAN, '32<br />\nWILSON RUTHERFORD, '31<br />\nCHARLES NEY, '33<br />\nABRAM BURK, '34<br />\n'33<br />\nSIMON LITT,<br />\nVICTOR FRENKIL, '34<br />\nWit. N. MYERS, '33<br />\nEDGAR BLUMSTEIN, '34<br />\nMORTON ROME, '33<br />\nDAVID GUTMAN, '34<br />\nWILBUR BLOOM, '33<br />\nGEORGE BAYLIN, '31<br />\nMAURICE R. CHASSIN, '33<br />\nHARRIS, '34<br />\nLEONARD<br />\n'34<br />\nGEORGE LANDAU,<br /><br />\nPreviously, I have frequently<br />\nmeditated on the ignominy attendant on the inclusion of a Y. M. C.<br />\nA. building in the Hopkins group.<br />\nBut with an extra few months of<br />\nculture consumption behind me, I<br />\nfeel contrained to consider the matter more alertly. I do not see that<br />\nthe roguery and stupidity as purveyed by the Johns Hopkins stuMd.<br />\nBaltimore,<br />\nAve.,<br />\nClifton<br />\n1930<br />\nProduced by the R. L. Polk Printing Company,<br />\ndent body is of any more superior<br />\nor fragrant variety than the roguery<br />\nand stupidity as purveyed by the<br />\nprofessional gentlemen of Levering<br />\nHall. We have a middle-class student body; then why not a middleclass organization to soothe their<br />\nmiddleclass qualms and to pretend<br />\nto solve their middle-class problems.<br />\nEXPERIENCE<br />\nHence, I alter a few mental patFrom this time on, I regard<br />\nterns.<br />\nwas<br />\nclearly<br />\ncontest<br />\nof<br />\nHE part that experience plays in any sort<br />\nthe Y. M. C. A. not as a disgrace<br />\nbrought to light in 'last Saturday's lacrosse game. The Yale team<br />\nto the Johns Hopkins, but merely<br />\nlacked only this one factor, for in every other respect the visiting team<br />\na disgrace.<br />\nas<br />\nexcellent<br />\nin<br />\nwas<br />\nteam<br />\nBlue<br />\nThe<br />\ntwelve.<br />\nJay<br />\nBlue<br />\nthe<br />\nof<br />\nequal<br />\nwas the<br />\ncondition, had had more practice this season, and was just as fast as<br />\nthe Homewood combination.<br />\nThe fact that none of the New Haven team had played lacrosse<br />\nAbout the most profoundly, probefore entering the university was responsible for the decisive defeat.<br />\nfessionally romantic person that I<br />\nAlthough Yale was handicapped in that they had played a hard game<br />\nhave ever been acquainted with was<br />\nwith Penn two days before, during the course of which they lost the<br />\nEnglish instructor at City Colan<br />\nservices of one of their best attack men, this counted little for their<br />\nbeing completely outclassed throughout the contest.<br /><br />\nEDITORIALS<br /><br />\nT<br /><br />\nBANQUET SEASON?<br />\nthe junior banquet set for April 23, a lively week followWITH<br />\ning that date may well be predicted due to the fact that there<br />\nthe freshman and<br /><br />\nhave been no hostilities of any sort between<br />\nsophomore classes to date this year. Although the Student Council<br />\nruling that there will be no breaking up of banquets is still in effect,<br />\nit is probable that the members of the two classes will find other ways<br />\nto work out their pent up energy.<br />\nUnless the council takes some action, it is to be expected that a considerable amount of damage will be done during this period—both to<br />\nproperty in vicinity of the University and to the class members themserves. When one starts out to completely eliminate the rah-rah' element from a college, it is necessary that no opportunity be given the<br />\nmen to exhibit their animal instincts.<br />\nTo give these individuals one such chance as this is much more dangerous than allowing some sort of hostilites throughout the entire college year. If freshman regulations and the interclass contests that go<br />\nwith them are to be abolished, it would be wise to abolish banquet<br />\nfights as well.<br />\nThere is no half way measure in this problem. It is necessary to definitely follow one course or the other. The present trend is, of course,<br />\nto remove all forms of class competition from the Homewood campus.<br />\nIf this be stingently enforced, it is probable that during the course<br />\nof years every trace of the 'motion picture' type of college will be removed. Whether or not this is the wish of the students, will be seen<br />\nwhen the result of the vote on freshman regulations is announced by<br />\nthe Student Council. It is needless to say that what the students wish is<br />\nnot always what is best for them. However, when there is a question<br />\nas to which course the authorities should follow, it would seem that<br />\nsome heed should be paid to the opinion of the majority of the student<br />\nbody.<br /><br />\nWHY THE DELAY?<br />\nit is very regretFROM the point of view of the athleticof authorities<br />\nPhysical Education has not<br /><br />\nable that the report of the committee<br />\nyet been submitted to Board of Trustees. With the general public under the impression that football has been abolished at Hopkins, it is<br />\nvitally necessary to the future of athletics that the decision be announced. Should the board decide to abolish football, it could not place<br />\nthe authorities in any more disagreeable position than they are in at the<br />\npresent writing. The question is one of such importance that a hasty decision should not be made, but in view of the necessity of some statement in the near future it would seem that greater effort could be exerted to bring the question before the board.<br /><br />\nlege. His name was Sweeney.<br />\nSweeney was an apollo. Or rather<br />\nhe was 95 per cent apollo for he had<br />\na cast in one eye. He was still,<br />\nhowever, an immensely romantic fellow. He was wont to strut up and<br />\ndown Charles Street—always manipulating his neck so that the evileye shifted from the level of a second story window to the deep blue,<br />\nromanticS sky above. Thus you<br />\ncaught only a fleeting glimpse of the<br />\nevil-eye. He was still, however, an<br />\nimmensely romantic fellow.<br />\nBut how was such a romantic<br />\nperson to die? Was it to be at the<br />\nend of a rusty sword somewhere in<br />\nArabia? Was it to be under the<br />\nhoofs of a thundering herd in Arizona? Was it to be after a slammed<br />\ndoor, a tearing of flimsy pajamas<br />\nand a fall from a bouduoir of the<br />\nfiftieth story to the walks below?<br />\nNo. Sweeney got a sore throat<br />\nthree years ago this May. A physician came, and looked down<br />\nSweeney's throat. There was no<br />\ndoubt about it. Sweeney had tonsilitis. With the dawn of a fifth<br />\nday after, the romance, the evil-eye<br />\nand English instructor SWeeney<br />\nwere no more.<br />\nIV.<br />\nI take pride, perhaps, in exotic<br />\nthings. For instance, I am most<br />\nsupremely happy that I am the<br />\nonly Hopkins student who is convinced that the last Barnstormer<br />\nproduction was offensive even as<br />\nfourth-rate drama. I am profoundly conceited that I was the first<br />\nstudent to arrive at the conclusion<br />\nthat the Liberal Club is not liberal.<br />\nI am among the few, I believe,<br />\nwho feel that the average Hopkins<br />\nstudent is an ass. I am elated over<br />\nthe fact that it is my lot to believe<br />\nthat at least half of the faculty<br />\nare no better than the average student. I was the only Hopkins student, I venture to say, who rode<br />\ndown Charles Street on Easter Sunday in a suit three years old and a<br />\nheard that had a two-day start.<br />\nV.<br />\nWhatever may be the force that<br />\nmotivates an entering student to<br />\njoin a fraternity, it certainly cannot be one of friendship. I admit<br />\nthat I am hardly an authority on<br />\nwhat the personality books call the<br />\nArt Of Making Friends, but if<br />\nfriends are made by corraling a<br />\ngroup of freshmen into a house and<br />\nthen by selecting half for friends in<br />\na more or less haphazard fashion,<br />\nthen I hope I have an inexhaustible supply of enemies. Doubtless,<br />\nresidence in a fraternity house is<br />\npreferable to the primitive conditions of the dormitories, but when<br />\none considers that seventy-five per<br />\ncent of the people in the world<br />\naren't fit to live with anyway, I think<br />\na tent in Wyman's Park would have<br />\nits advantages.<br /><br />\nBOSTONIAN SHOES<br />\nTo the<br />\nmanner born<br />\ndo<br /><br />\nIf you naturally<br />\nchoose distinctive<br />\nfootwear, Fleetwing<br />\nneeds no praise from<br />\nus. In all shoedom<br />\nthere's no better-bred<br />\nexample of smart<br />\nstyle. From rakish<br />\nEnglish toe to mannish heel, Fleetwing<br />\nis to the manner born<br />\n—a selected Bostonian.<br />\nIn Autumn tan<br /><br />\n01<br />\nPi<br />\nPi<br />\nhi<br />\nti,<br />\nas!<br /><br />\nor<br /><br />\nEbony black.<br />\nThe<br /><br />\nFLEETWING<br /><br />\n'10<br />\nhe FLEETWING<br /><br />\nThis Seal<br />\nmarks Style:Selected<br />\nBostonians<br />\nSELECTED STYLE NO.<br /><br />\n1<br /><br />\n2<br /><br />\nBOSTONIAN SHOE STORE<br />\nW. C. KENNEY<br /><br />\n112<br /><br />\nEast Baltimore Street<br /><br />\nA. H. FETTING<br />\nMANUFA CTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br /><br />\nPRINTERS OF<br /><br />\nFor Better Cleaning and<br />\nDyeing<br /><br />\nPhilological and Scientific<br />\nPublications<br /><br />\nFRIED'S<br /><br />\nJ. H. FURST CO.<br /><br />\n12-20 Hopkins Place, Baltimore<br /><br />\n101 E. 21st St.<br /><br />\nBelmont 5501<br /><br />\nOPERATE IT YOURSELF<br /><br />\nRENT A CAR<br /><br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\n111 W NORTH AVE.<br /><br />\n2125 HARFORD AVE.<br />\nPhone, Wolfe 1413<br /><br />\nAlthough Several Items Are Tentative Committee Believes<br />\nThey Will Be Carried Out; Orders For<br />\nPrograms Being Taken<br /><br />\nTwo Orchestras Definitely Hired<br /><br />\nThe feature of the week is to<br />\nbe the Ball, at which Guy Lombardo and his Royal Canadians<br />\nwill furnish music. The affair is<br />\nto be held in the Lord Baltimore<br />\nHotel on Monday June 8th. The<br />\nonly other orchestra definitely<br />\nhired is T. Worth Murphy's<br />\ngroup, which plays at the Belvedere Hotel. This orchestra is to<br />\nbe at the Night Club party, which<br />\nis to be held at Levering on June<br />\n4th.<br />\nAlthough prices in each individual affair have not been set, a<br />\nticket to all activities will cost<br />\n$12.50. These tickets are to go<br />\non sale soon at the post-office. According to members of the committee, the sum of the prices for<br />\neach individual event would total<br />\nabout $22. Undergraduates are<br /><br />\nt1<br /><br />\nDeposit Not Required<br /><br />\nNew Schedule For June Week<br />\nWill Probably Be Carried Out<br /><br />\nAfter several changes in the<br />\noriginal plans for June Week, the<br />\ncommittee has arranged a tentative schedule which, according to<br />\nChairman Yellott, will probably<br />\nbe carried out. Ten events are<br />\non the program, which runs from<br />\nJune 3rd to the 9th, starting with<br />\nthe last Cotillion, and ending with<br />\nCommencement exercises at the<br />\nLyric and the Senior Banquet at<br />\nthe Southern Hotel.<br /><br />\nV<br /><br />\n1(<br /><br />\n1(<br /><br />\nC.<br /><br />\nt;<br />\na<br />\nti<br />\na<br />\nt;<br /><br />\ninvited to all functions except the<br />\nSenior Banquet.<br />\nPrograms On Sale<br /><br />\nOrders for the June Week<br />\nsouvenir programs are being<br />\ntaken at the post-office. These<br />\nare the only official programs,<br />\nand are selling at $1 per copy,<br />\ntwo for $1.50. They will be obtainable by order only.<br />\nThe programs is to have a<br />\ncover of black leather, with a cut<br />\nof Gilman Hall tower in blue.<br />\nThere will be about 15 pages,<br />\neach containing a picture. Among<br />\nthese photographs will be pictures of the campus, and of the<br />\nsponsors for the various Senior affairs.<br />\nSchedule Has 10 Events<br /><br />\nThe<br /><br />\nschedules is as follows:<br />\nWednesday, June 3—Last Cotillion, place undecided.<br />\nThursday, June 4—Beach Party, probably at<br />\nMaga Vista.<br />\nFriday, June 5—Night Club Party, at Levering Hall, T. Worth Murphy's Orchestra.<br />\nSaturday, June 6—Lacrosse game (afternoon),<br />\nat Homewood.<br />\nAfternoon—Tea Dance at Levering after<br />\ngzme.<br />\nEvening—Lacrosse Ball, place undecided.<br />\nSunday, June 7—Baccalaureate Sermon at<br />\nEmanuel Church, Charles and Read Sts.<br />\nSermon by Rev. Dr. Noble C. Powell.<br />\nEvening—Concert by Johns Hopkins Orchestra on Quadrangle and Senior Step—<br />\nSinging (admission free).<br />\nMonday, June 8—Senior Ball at Lord Baltimore Hotel, Guy Lombardo's Orchestra.<br />\nTuesday, June 9—Graduation at Lyric. Senior<br />\nBanquet at the Southern Hotel.<br /><br />\nti<br />\n11<br /><br />\nSI<br /><br />\nLow Evening<br />\nand Night Rates<br />\nEvening Rates<br />\nBetween 7 P. M. and<br />\n8:30 P. M.<br />\n15% to 20% lower<br />\nthan day rates<br />\nNight Rates<br />\nBetween 8:30 P. M.<br />\nand 4:30A.M.<br />\n40% to 50% lower<br />\nthan day rates<br />\n( Minimum reduced rates \\<br />\nk 35c for initial period. J<br /><br />\nAFTER the party<br />\n...grand time...<br />\na swell time .. .<br />\n'member? Gee,<br />\nwouldn't it be<br />\ngreat to see Her?<br />\nThe Resourceful<br />\nSoul says—call her<br />\nup by Long Distance ... Do it<br />\nthis evening.<br /><br />\nTHE CHESAPEAKE AND POTOMAC<br />\nTELEPHONE COMPANY<br />\nOF BALTIMORE CITY<br /><br />\n13<br /><br />\nV<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1931<br /><br />\nSCHAALIANA<br />\nPreface: To edit the works of<br />\nE. A. Schaal in a sympathetic, understanding fashion is a hard but<br />\ndelightful task. For fear that even<br />\none person may have missed the<br />\nphilosophy that Mr. Schaal has been<br />\nunloading in the \"Y\" news for the<br />\npast year, there have been grouped<br />\nbelow a few of the outstanding tidbits. They were chosen because of<br />\ntheir powers of stimulating the emotions and, of course, their complete<br />\nasininity.—H. L. F.<br /><br />\nNov., 1930.—A Sunday School<br />\nclass composed of Goucher and<br />\nHopkins students recently engaged<br />\nin a discussion of prayer. One<br />\nGoucher girl supported by a Hopkins student, vigorously supported<br />\nthe theory that one might well pray<br />\nfor rain during such a drought as<br />\nwe have been having.<br />\nLife Made Easy Nov., 1930.—Dr. Howard A.<br />\nKelly, at the University- Supper<br />\nClub, stated that a man's answer to<br />\nthe question \"What think ye of<br />\nChrist ?\" is the irrlost important decision one makes, and will make possible the solution of all other problems of life.<br />\nVery Psychological, Very Metaphysical,'Very Extraordinary<br /><br />\nDecember 12, 1930.—When is<br />\none religious? . . . To be religious<br />\nit would seem, does not necessarily<br />\nimply the acceptance of any particular set of dogmas or creeds, although religious people often do<br />\nthis. The Y. M. C. A. recognizes<br />\nthat many religious souls both<br />\namong the students and faculty seem<br />\nto derive great satisfaction . . .<br />\nby keeping up a continuous barrage<br />\nof criticism against the church, the<br />\nY. M. C. A., many types of pious<br />\nliving, etc., etc.<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br />\nFraternities at the University of<br />\nWisconsin are facing serious difficulties as a result of the,raising of<br />\nthe scholastic standards.<br />\n* * *<br />\nA New York branch of Yale University to be established at the Hotel<br />\nBiltmore College is the novel solution offered by one of Yale alumnus for the \"Week-end habit\" so<br />\nprevalent at Eastern universities.<br />\n* * *<br />\n\"It is my belief that the true purpose of education is to stimulate<br />\nideas, to preserve and to promote<br />\nideals. I do not believe that education can be thrust upon a person<br />\nby 'forcible feeding.' Mental food<br />\nis like physical food. People won't<br />\ntake much of it unless they have<br />\nan appetite for it. I hope that, in<br />\nthis university, we can create such<br />\nan appetite, make our students mentally hungry,\" says Walter Williams, President of the University of<br />\nMissouri, and formerly dean of its<br />\nschool of journalism.<br />\n*<br />\nJose Padin, commissioner of education of Porto Rico, has planned<br />\na graduate school of tropical agriculture for the University of Porto<br />\nRico, and negotiations are already<br />\nbeing carried on toward this end<br />\nwith Cornell University.<br />\n* * *<br />\nOnly 16 per cent of the teachers<br />\nemployed in North Carolina schools<br />\nduring the 1928-29 year were men.<br />\n* * *<br />\nDr. H. W. McCastline, medical<br />\nofficer of Columbia University,<br />\nstates that the typical Columbia<br />\nfreshman does not smoke; drinks<br />\ntwo or more glasses of milk daily;<br />\nregularly eats his spinach and lettuce, and prefers swimming as a<br />\nsport.<br />\n*<br />\n*<br />\nViolent anti-Semitic demonstrations at Pecs University last Tuesday resulted in eight Jewish students<br />\nbeing so severely injured that they<br />\nhad to be taken to a hospital.<br /><br />\nHopkins 'Crossemen Will Meet<br />\nSwarthmore Twelve Saturday Simon Ackerman Clothes<br />\nREADY TO WEAR<br /><br />\nNot Much Opposition Is Expected By Jay Coach From<br />\nNov. 12, 1930.—The Community<br />\nPennsylvania College In Clash At Homewood<br />\nFund went over the top.<br />\nField; Easy Victory Forecast<br />\nNews Note<br /><br />\nA. JACOBS &amp; SONS<br />\n... Tailors ...<br /><br />\nSolved! Throw Away The Bayonets!<br /><br />\nNov. 12, 1930.—One hundred and<br />\nthirty-five<br />\npeople, representing<br />\nabout thirty nations, were the guests<br />\nof the Y. M. C. A. for Thanksgiving dinner, Tuesday, November<br />\n25. Dr. Wheeler presided. Breaking bread together will eventually<br />\nresult in breakitwg down barriers<br />\nand conflicting issues between naMr. Schaal Ponders A Social Problem tions.<br />\nNov., 1930.—The secretary of a<br />\nFrom A Stool<br />\ndepartment of the university after Scientific Observations Hall<br />\nIn Levering<br />\nmingling freely with the students<br />\nNov. 12, 1930.—How many Hopof the university, as such secretaries kins men attended church last Sunare accustomed to do, recently day? We venture the guess that the<br />\npassed up the oportunity this offered percentage was higher than for most<br />\nand married a mechanic. It is re- institutions of higher learning and<br />\nported that her friends have been we also venture the opinion that<br />\ngreatly shocked and disappointed those who actually worshipped had<br />\nthat she married a greasy mechanic an experience that has made life<br />\nwhen she might have married an more sifinificant this week.<br />\nintellectual.<br />\nVery Significant, leery Significant<br /><br />\n3<br /><br />\nThis coming Saturday the Hopkins lacrosse squad will meet<br />\nSwarthmore College at Homewood field. As a result of the latter's weak performance against<br />\nMt. Washington two weeks ago,<br />\nDr. Van Orman does not expect<br />\nhis squad to encounter much stiff<br />\nopposition.<br />\nSwarthmore Men Inexperienced<br /><br />\nDue to the infertile stage of the<br />\ndevelopment of lacrosse in Pennsylvania, most of the members of<br />\nthe Swarthmore team do not have<br />\nthe experience of Black and Blue<br />\nteams. However, the Maroon<br />\nteam possesses on the attack a<br />\nstellar performer in Pike. He<br />\nhappens to be a former Friends'<br />\nSchool player and is the pivot of<br />\nthe Swarthmore offense. The<br /><br />\n128 W. Fayette Street<br /><br />\ntwo points that the maroon tal-<br /><br />\nlied against the Hillmen were<br />\nboth scored by Pike.<br />\nMaroons Possess Fight<br /><br />\nOn the defense the Maroons<br />\nare again hampered by the inexperience of their material; but<br />\nthe team does possess plenty of<br />\nfight. This was particularly evident during the second period of<br />\nthe Mt. Washington contest. The<br />\nHillmen, possessing some of the<br />\nfinest material in the state, had<br />\nto put forth their best efforts to<br />\nscore.<br />\nFor the Jays, this game should<br />\nprove a good opportunity to<br />\nsmooth a few rough edges. Likewise it will add to the team's experience.<br /><br />\nPHONE: VERNON 5013<br /><br />\nCENTRAL PARKING CO.<br />\nLargest Open Air Parking in the State of Maryland<br />\n5 CONVENIENT PLACES:<br />\n309-311 W. Franklin St.<br />\nHoward and Druid Hill Ave.<br />\n209 Davis St.<br />\nHoward and Centre Sts.<br />\n20 Clay St.<br />\nBALTIMORE, MD.<br /><br />\nWe Sell Drugs and Give Service<br />\nMembers Florists Telegraph Delivery Association<br /><br />\nCall us up Belmont 5318, 5846<br /><br />\nPeabody Pharmacy<br />\nCalvert and 30th Streets<br /><br />\naqsa<br /><br />\nPif<br /><br />\nPhone: VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br /><br />\nTHE RELIABLE WEAVING CO.<br /><br />\nGod Hears All, Sees All, Knows All<br /><br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\nFLORISTS<br /><br />\nFeb. 13, 1931.—Some men (the<br />\nOrations Being Given<br />\ndean says, about 30) were dropped<br />\nfrom the university because of<br />\nBy Public Speakers<br />\nscholastic difficulties. Who knows<br />\nbut what this may be a more signifiAddresses Will Be Six Minutes Long;<br />\ncant religious experience than being Authorities Aim to Develop<br />\nHarangues On Prohibition To Be<br />\nconverted by Billy Sunday?<br />\nSocial, Cultural Life<br />\nIncluded<br />\nNews Note<br />\nThroughout this week students<br />\nNov. 13, 1931.—Mooney and<br />\nTO SERVE COFFEE<br />\nin the five sections of the public<br />\nBillings are still in jail.<br />\nspeaking class, instructed by Dr.<br />\nWould Keep Social Life From<br />\nPoker Ts. God<br />\nPaul M. Wheeler, will give the<br />\nInterfering With Study<br />\nMarch 27, 1931.—We believe it<br />\nrequired six-minute orations.<br />\nwould constitute a religious experiIt was learned that the topics<br />\nence if, either because of a sponPasadena, Calif.—Fraternities of<br />\ntaneous thought or perhaps one in- California Tech will be asked to will be diversified, and that the<br />\nspired by the Student Council, some move into the new houses in groups, usual addresses on National Proof the fellows who play cards in but without fraternity organization, hibition will share the limelight.<br />\nLevering Hall in excess of five to act as a necleus about which to Subjects were selected by each<br />\nhours daily would decide to spend build a house unity and fellowship member of the class. Dr. Wheeler<br />\nthis time or a large part of it if and to develop to a higher degree made no specifications other than<br />\nnot studying, at least out-of-doors. social and cultural life, it was an- the length and the value of the<br />\nnounced here recently. The an- speeches.<br />\nAll's Well<br />\nnouncement same, as a result of an<br />\nDr. Wheeler yesterday extendMarch 27, 1931.—According to a extensive study of student housing<br />\nstudy recently made of the opin- conditions in America and abroad ed an invitation to the faculty<br />\nions of over twelve hundred stu- by a student committee of Califor- and students to hear the orations.<br />\ndents in colleges and universities in nia Institute of Technology. They<br />\nthe vicinity of Baltimore, Johns are not to rush or pledge and will<br />\nHopkins students outdistances all be non-perpetuating.<br />\nrivals except Washington College in<br />\nTo Instruct In Loafing<br />\ntheir readiness to believe the Jonah<br />\nOne of the unusual features of<br />\nstory literally. Who said Hopkins the recommendations of the report<br />\nis corrupting the religion of our is that provision is made, to serve<br />\nfathers?<br />\nafter dinner coffee in the lounges<br />\nin order to present an atmosphere<br />\nmore conducive to discussion. It is<br />\nhoped that this feature will teach<br />\nthe Tech men how to loaf gracefully<br />\nOther intricacies as to house orPaul B. Sutton Graduate In<br />\nganization, choice of room and conChemistry Is Selected<br />\nduct at meals is treated at length in<br />\nFirst<br />\nthe complete report.<br />\n(Continued from page 1, col. 1)<br />\nGoverning Factors<br />\ning only undergraduate studies, he<br />\nGoverning factors in the study<br />\nwill graduate next June after a<br />\nwere:<br />\nresidence of only three years. He<br />\n1. The organization, control, and<br />\nis a member of the Debating Council. Having been accepted by the social life of the houses must be<br />\nso worked out as to supplement<br />\ngraduate school of Harvard, he will<br />\nrather than detract from or lessen<br />\ncontinue in graduate work at that<br />\nthe high quality of scholastic work<br />\nUniversity, it was learned.<br />\nwhich is now the standard.<br />\nTowbin also required only three<br />\n2. An environment must be creyears to be eligible for a Bachelor<br />\nof Arts degree. He has been prom- ated and maintained which will permit a man to enjoy his leisure time<br />\ninent in undergraduate athletics<br />\nin pleasant and congenial company.<br />\nGraduates In Philosophy<br />\n3. A democratic organization<br />\nGraduates in the School of Philosophy wlib will be initiated into the must be worked out so as not to be<br />\na financial burden to students of<br />\nhonor fraternity are:<br />\nJohn D. Clark, George B. Collins, Warren moderate means.<br />\nM. Cox, Cameron D. Ebaugh, William G. Lynn,<br />\n4. The plan to be recommended<br />\nThomas S. Logan, Thomas Swindall, Bernard<br />\nMayo, James G. McManaway, Helen R. Reese, must be consistent with the progresAlbert K. Weinberg, and C. Walter Young.<br />\nsive idealism of the California InFrom the medical school:<br />\nNorman F. Crane, Morgan Cutts, Marion stitute of Technology.<br /><br />\nCALIFORNIA COLLEGE<br />\nTO OUST FRATERNITIES<br /><br />\nAND<br />\nDECORATORS<br /><br />\nSeeking a Position?<br />\n1918 N. Charles St., near 20th<br />\nPhone: Vernon 0573<br /><br />\nWe are receiving inquiries daily for<br />\nteachers<br />\nTHE BALTIMORE TEACHERS<br />\nAGENCY<br />\nWilliam K. Yocum, Manager<br />\nTitle Annex Bldg.<br />\nBaltimore, Md.<br />\nPlaza 1195<br /><br />\nDECORATIONS<br /><br />\nINTERIOR WOOD WORK<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br /><br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski Street<br /><br />\nPHI BETE SELECTS<br />\n31 AT UNIVERSITY<br /><br />\nE. Howard. William M. Nicholson, Robert<br />\nW. Cans, Harry D. Kruse, Laurence D. Trevett, and Willis W. Young.<br /><br />\nAcedemic Staff ..<br />\n_JO ..<br />\nThe members of the academic<br />\nstaff are:<br />\nBurton E. Livingston, Professor of Plant<br />\nPhysiology, 'William Kurrelemeyer, Professor<br />\nof German, Kent R. Greeneld, Professor of<br />\nModern European History, and associate professor of English, Hazelton Spencer.<br /><br />\n—(N.S.F.A.)<br /><br />\nYale Twelve Beaten<br />\nBadly By Jays, 18-2<br />\nEli Lacrosse Players Do Not Offer<br />\nOpposition To Hopkins That<br />\nWas Anticipated<br />\n(Continued from page 1, col. 6)<br /><br />\nE. B. Mathews was named presi- Kelly, Triplett, J. Henderson; Yale,<br />\ndent of the Hopkins Chapter • for Devaney, Bullard. Substitutes—Hopthe current year, last spring. Other kins, Dukehart for Stone, Triplett for<br />\nofficers of the group are William Darrell, C. Kelly for Turnbull, Cockfor Beehler, Hudert for Kneip, MacH. Wilmer, vice-president; Jo- ey<br />\ngil for D. Kelly, Sneeringer for Guild,<br />\nhannes Mattern, secretary; George Stone for Dukehart, Darrell for Triplett, Turnbull for C. Kelly, Beehler<br />\nH. Evans, Jr., treasurer.<br />\nEstablished in 1895, the Johns for Cockey, Kneip for Hudert, D. Kelfor Macgil, Guild for Sneeringer,<br />\nHopkins University Chapter of Phi ly<br />\nDukehart for Don Kelly, C. Kelly for<br />\nBeta Kappa, honorary fraternity, Guild, Triplett for Turnbull, Cockey<br />\nfor Beehler, Yearley for Ness, Cone<br />\nhas 903 members.<br />\nOn the basis of outstanding schol- for Weitzel, Chancellor for Lang,<br />\nfor Dukehart, Levy for<br />\narship, election to Phi Beta Kappa Sneeringer<br />\nBernard, J. Henderson for Hudert,<br />\nis made from one-fifth of the grad- Merriken for Chancellor, Mattingly<br />\nuating class, one-sixth of candidates for Sneeringer, Wiegand for Cockey.<br />\nfor the Ph.D. degree, and one-sev- Yale. Bullard for Baker, Dreyfus for<br />\nJones, Mallory for Nelson, Devaney<br />\nenth of candidates for the M.D. de- for<br />\nH. Henderson, Hanna for Draper,<br />\ngree. Usually, some members of Burall for Beggs, Griswold for Smith.<br />\nthe faculty are elected to the hon- Referee—Baker. Judge of play—Fred<br />\nWehr. Time of halves-30 minutes.<br />\norary fraternity.<br />\nInitiations into the fraternity will<br />\nPing-Pong seems to be a poputake place on Saturday, April 18, lar sport at many schools. At Fisk<br />\nat 6:45 P. M. preceding a dinner in<br />\nUniversity, students are taking it<br />\nLevering Hall<br />\nup in lieu of spring tennis practice.<br />\nMgde<br /><br />\nEXHILARATIA'G IN LINE AND COLOUR, INCOMPARABLE IN<br />\nCHARACTER AND TAILORED<br />\nAND CARE.<br /><br />\nA<br /><br />\nWITH SUPERIOR TASTE<br /><br />\nCHOICE AND CORRECT POSSESSION.<br /><br />\nEIGHT<br />\nOTHERS SEVEN<br /><br />\nDOLLARS<br /><br />\nDOLLARS<br /><br />\nAND<br /><br />\nUPWARD<br /><br />\nAGENTS IN THE PRINCIPAL CITIES OF THE UNITED STATES<br /><br />\nitt=ibiliti211.1M214091<br /><br />\nTHE FINCHLEY HAT<br />\nWILL BE FOUND HERE EXCLUSIVELY<br /><br />\nISAAC HAMBURGER &amp;SONS<br />\nBALTIMORE &amp; HANOVER STS.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 7, 1931<br /><br />\n4<br />\nallI1111111n101,-<br /><br />\nWhat's YOUR<br />\nfavorite<br />\npipe<br /><br />\nv-cv<br /><br />\nMost PRINCETON<br />\nmen smoke—<br />\nTF you walk along Prospect Street<br />\nI in Princeton you'll notice how<br />\nmany men load their pipes from<br />\nthe familiar blue Edgeworth tin.<br />\nAt Senior Singing on the steps of<br />\nNassau Hall this spring the pipes<br />\nwill glow with Edgeworth.<br />\nA pipe and Edgeworth—this is<br />\nthe smoking combination that has<br />\nwon the college man. Yale, Dartmouth, Cornell, Illinois, Stanford<br />\n... all agree with Princeton.<br />\nCollege men everywhere respond<br />\nto the appeal of pipes—packed with<br />\ncool, slow-burning Edgeworth. Be<br />\nguided by their choice: Try Edgeworth yourself. Taste its rich natural savor that is enhanced immeasurably by Edgeworth's distinctive eleventh process.<br />\nYou will find Edgeworth at your<br />\nnearest tobacco shop-15d the tin.<br />\nOr, for generous free sample, address Larus &amp; Bro. Co., 105 S.<br />\n22d St., Richmond, Va.<br /><br />\nEDGEWORTH<br />\nSMOKING TOBACCO<br />\nEdgeworth is a blend<br />\nof fine old burleys,<br />\nwith its natural savor<br />\nenhanced by Edge.<br />\nworth's distinctive<br />\neleventh process.<br />\nBuy Edgeworth anywhere in two forms<br />\n—\"Ready-Rubbed\"<br />\nand \"Plug Slice.\" Alt<br />\nsizes, 150 pocket<br />\npackage to pound<br />\nhumidor tin.<br /><br />\n4 LECTURES SCHEDULED<br />\nFOR DOHME FOUNDATION<br /><br />\nNUTS HARRY HERMIT<br />\nAnthony- Cianek Meets Difficulties In<br />\nCollaboration Of Book<br /><br />\nHygiene Lecture Given<br />\nAt Health School<br />\nDr. W. B. Wherry, Of Cincinnati U.,<br /><br />\nAddresses Public On Bacterial<br />\nLectureship Provides For Talks (Continued from page 1, col. 2)<br />\nProteins At J. H. U.<br />\nBy Scientists Before Fel\"He'll say,'What do you mean<br />\n\"Hypersensitivity to Bacterial<br />\nlowship Holders<br />\nby nuts.'<br />\nProteins and Its Role in Sus\"I'll say, 'Nuts are nuts.'<br />\nceptibility and Immunity\" was<br />\nFREUDENBERG TO<br />\n\"He'll say, 'Nuts aren't nuts! the topic of a public hygiene lecSPEAK HERE APRIL 17 Nuts may seem nuts, but there's ture given by Dr. William B.<br />\nnothing to it. You've got to Wherry, professor of bacteriology<br />\nDr. Irving Langmuir, Noted establish definitely that all nuts at the University of Cincinnati,<br />\nAtomic Structure Theorist,<br />\nare nuts, before you can conclude last Tuesday, at 5 P. M.<br />\nthat one nut is a nut. I won't go<br />\nMakes Address Here<br />\nThe lecture was given in the<br />\non with this thing unless you're J. H. U. School of Hygiene and<br />\nFour more noted scientists will going to be logical.<br />\nPublic Health.<br />\n\"I'll say, 'All I'm begging you<br />\nappear at the Johns Hopkins<br />\ndo is furnish the culture. I'll<br />\nUniversity before the fellows in to<br />\nattend to the nuts. Now nuts are Adams Declamation,<br />\nchemistry at Homewood under used for many purposes—'<br />\nDue On April 23rd<br />\nWill Remain Hermit<br />\nthe A. R. L. Dohme Lecture<br />\ndo<br />\n'what<br />\nFoundation, a gift of Dr. Dohme, \"'But', he interrupted,<br />\nTry-Outs For Contest To Be Held On<br />\nyou mean by nuts?'\"<br />\nApril 16th And 18th<br />\nan alumnus of the Hopkins and<br />\nMr. Cianek has retired to his<br />\nIn Levering<br />\nnow retired manufacturing pharlean-to. He says he still likes<br />\nAccording to Dr. Paul M.<br />\nmacist.<br />\nnuts. He says he will remain a Wheeler, all entries for the<br />\nFreudenberg, Gomberg On List<br />\nhermit.<br />\nAdams Declamation Contest and<br />\nApril 17, Dr. Freudenberg will<br />\nDe Tocqueville Lecture Contest<br />\nvisit Homewood to speak. One<br />\nmust be filed with Charles Ney,<br />\nweek later April 24, Dr. Moses<br />\nof the debate, before<br />\nmanager<br />\nGomberg, of the University of<br />\nApril 14; topics must<br />\nof<br />\nmidnight<br />\nMichigan and president of the<br />\nwith entries. Sophoadmitted<br />\nhe<br />\nAmerican Chemical Society, is<br />\nOn mores are eligible for the Adams<br />\nC.<br />\nC.<br />\nB.<br />\nDebate<br />\nTo<br />\nFrosh<br />\nCharles<br />\nscheduled to lecture. Dr.<br />\nContest and all other undergraduEntrance To League<br />\nA. Kraus, of Brown University,<br />\nare eligible for the De Tocqueates<br />\nwill be here May 8; Dr. Wilder<br />\nville Contest. Speeches for each of<br />\nFRIDAY<br />\nFOR<br />\nSET<br />\nFRAY<br />\nD. Bancroft, of Cornell Univerthese contests will be six minutes or<br />\nsity, May 15.<br />\nHood Tues- less apiece.<br />\nMeet<br />\nTo<br />\nVarsity<br />\nFunds provided for by Dr.<br />\nFor the Adams Contest, any<br />\nday At Frederick<br />\nDohme enables the department<br />\nAmerican prose selection of the<br />\nof chemistry to bring to the<br />\nSwinging into what supporters twentieth century will be acceptJohns Hopkins, men of promi- declare is the most active cam- able providing it does not deal<br />\nnence in the scientific world to paign in fourteen years, Hopkins with a political problem. Tryouts<br />\nspeak to and personally inter- newly-organized Debating Coun- for the Adams Contest will be<br />\nview the fellows in chemistry on cil will sponsor six events in its held on Thursday, April 16th at<br />\nthe campus.<br />\nprogram in sixteen days. Its 11.30 A. M. in Levering Hall,<br />\nDr. Langmuir Lectured Friday<br />\nteams it was learned wi,11 travel Room B.<br />\nContestants in the De TocqueDr. Irving Langmuir, associate to the Alemeda, to Frederick,<br />\ndirector of the research depart- and to Annapolis. In the mean- \\rifle Contest must deliver a lecment, General Electric Co., ad- while intermural contests will be ture in English on any phase of<br />\ndressed the fellows in one of the sponsored, and a team from West French history of the nineteenth<br />\nVirginia University brought to and twentieth centuries. Tryouts<br />\nseries of lectures last Friday.<br />\nfor this contest will be held Sat\"Selecting the Chemist-Elect\" the campus.<br />\nIn reporting his activities to urday, April 18th at 1 P. M. in<br />\nwas the topic discussed by Dr.<br />\nLangmuir, also a noted atomic the Debating Council recently, Levering Hall, Room B.<br />\nAt the tryouts four speakers<br />\nstructure theorist, at the dedica- Harold Yudkin, president dethe<br />\nof<br />\nwill<br />\nbe selected for each contest.<br />\nbecause<br />\nonly<br />\nthat<br />\nclared<br />\nestablishtion exercises for the<br />\nment of the Frances P. Garvan unusually large number of men Both contests will take place at<br />\nchair of chemical education at interested in forensics this year the Assembly on April 23rd.<br />\nwas such a program possible. He<br />\nHomewood, held Oct. 11, 1929.<br />\nquoted Coach Lyons as saying<br />\nFour Others Given<br />\nwhile only one or two interthat<br />\nBesides Dr. Langmuir's lecture<br />\nvictories were possible<br />\ncollegiate<br />\nhave<br />\ntalks<br />\nother<br />\nlast Friday four<br />\nbeen presented during the aca- this year, next year would be the<br />\nmost \"successful in the history of<br />\ndemic year.<br />\ndebating at this University,\"<br />\nwith at least three experienced<br />\nteams available for competition.<br /><br />\nELCOME<br />\nPARISIAN TAILORING<br />\nCOMPANY<br />\nCleaning, Dyeing, Pressing<br />\nRepairing<br />\n346 E. 33rd STREET<br />\nCor. University Parkway<br /><br />\n'To<br /><br />\nNEW YORK AND<br />\n_ THE<br /><br />\nMOTEL<br />\nGOVERNOR<br />\nGINTON<br />\n3151-ST.cif_6___D 77-2AV<br />\nOPPOSITE<br /><br />\nPENNA.RR.STATION<br /><br />\nThe freshman .crass of the University will hold its second annual debate with the varsity team<br />\nof the Baltimore City College, at<br />\nthat institution, on Friday. Saul<br />\nDorfman, Samuel Doctofskey and<br />\nCharles Stern will represent the<br />\nfreshmen, with Paul• Strong as<br />\nalternate. The topic for debate<br />\nwill be Resolved: that the United<br />\nStates enter the League of Nations. Hopkins will uphold the<br />\naffirmative.<br /><br />\nYou owe them the best entertainment to be had. Rent a Saunders<br />\nSystem car—show them the town—<br />\nboulevards—theatres—parks—then<br />\nsee them to the station when their<br />\nvisit is over. We have special low<br />\nrates for such occasions. Ask for<br />\nestimates on brand new Chryslers,<br />\nand Model A Fords.<br /><br />\nCURTAIN AT 5.30 SHARP<br />\nDINNER INTERMISSION, 7.40 to 9<br />\nReturns by Popular Demand<br /><br />\nTHE THEATRE GUILD, INC.<br />\nPRESENTS<br />\nEugene O'Neill's Extraordinary Nine-Act Drama<br /><br />\nA new system of debating will<br />\nbe tried here it was learned. It is<br />\nplanned to employ three constructive speeches of ten minutes and<br />\none rebuttal of eight minutes by<br />\neach team with no decision. Attire will be formal, and arrangements are being made for the<br />\ntransportation of persons who<br />\nwish to make the trip. Officials<br />\nrequest that anyone desiring to<br />\ngo to Frederick, and any member<br />\nof the Council and Club who will<br />\nhave room for passengers, to drop<br />\na note in P.O. Box 1172 immediately. Members of the team will<br />\nbe chosen this week from among<br />\nStanton, Brook, Doctofsky, Wasserman, Stark and Blum.<br /><br />\nStrange<br />\nInterlude<br />\nThe Cast: Elizabeth Risdon, Glenn Anders, Richard<br />\nBarbee, Leonard Mudie, Maurice McRae, Maud<br />\nDurand, Ethel Westley, John J. Burns, Jack Grattan.<br /><br />\n\"Friend of the Hopkins Man\"<br /><br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STREETS<br />\n\"On the Route of the Charles Street Bus\"<br /><br />\nont<br /><br />\nwait<br /><br />\n10<br /><br />\nuntil your valves<br />\nneed grinding<br />\nto learn that<br />\nAMOCONGAS<br />\n10,1psitntile!<br />\n644<br /><br />\nTravel To Frederick<br /><br />\nThe varsity team captained by<br />\nLlewellyn Stanton, who has again<br />\nreturned to debating, will travel<br />\nto Frederick meeting the strong<br />\nHood team next Tuesday evening. The topic will be Resolved.: that the colleges of the<br />\nUnited States adopt the Oxford<br />\nSystem of calling for Honors.<br />\nHopkins will again uphold the affirmative.<br />\nNew System Used<br /><br />\nMOTHER AND<br />\nDAD VISIT YOU<br /><br />\nPrices: $3.00, $2.50, $2.00, $1.50, $1.00<br /><br />\nDEBATING PROGRAM FULL<br />\nFOR FORTHCOMING WEEK<br /><br />\nFreshmen To Debate<br /><br />\nBelmont 8040-8041<br /><br />\nTHIS WEEK<br /><br />\n1<br /><br />\nWest Virginia Here<br />\n11 E. NORTH AVENUE<br />\nVernon 2704<br /><br />\nA week from Friday, Hopkins<br />\nwill entertain a team from WestA pre-eminent Hotel of 1200 Virginia University at Latrobe<br />\nHall 120, debating upon UnemRooms, each having Bath, ployment Insurance again. The<br />\nSe r vi do r, Circulating Ice same system of debating as employed against Hood will be used,<br />\nWater and many other inno- except that there will be a devations ... featuring a sincere cision. The team will be chosen<br />\nfrom Leo Alpert, Louis Kroll,<br />\nspirit of hospitality.<br />\nVlado Getting, Harold Kuslovitz,<br />\nNathan Harris, and Paul Bendix.<br />\nMyron Herman is in charge of the<br />\n'ROOM AND BATH $3UP reception<br />\ncommittee to the visiting<br />\nteam.<br /><br />\nAmoco-Gas gives better, allaround performance than<br />\nyou've ever known and it-,<br />\nCOSTS LESS PER MILE!<br />\nAMERICAN OIL COMPANY<br />\nAMI.ated<br /><br />\nPan Anse...ran Pegroltum<br /><br />\nTrant,..... Cony,<br /><br />\nGtneral Offirm American Bldg.Baltimore, Md<br /><br />"}], "field_media_file": [{"target_id": 38612, "display": null, "description": null, "target_type": "file", "target_uuid": "2e3e659c-8416-4afa-8e77-e1b2350ca978", "url": "http://digital.library.jhu.edu/system/files/2022-03/12249-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12249, "target_type": "node", "target_uuid": "340cffec-3077-4801-93cb-ad5b4f3e3dfb", "url": "/node/12249"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "83e63663-4e5c-4d98-b0bd-8e4a901ac92b"}]}