{"mid": [{"value": 54365}], "uuid": [{"value": "fcd81dc8-e2ae-469b-aa84-100314b9cbe7"}], "vid": [{"value": 54365}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-24T23:15:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "17499-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-24T23:15:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-24T23:15:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nFHE R EPUBLEG OF<br />\n<br />\n <br />\n<br />\nMEXICO,<br />\n<br />\n <br />\n<br />\nnumerous affluents, watering a large tract of fertile land.<br />\nFlowing north, from the north-west corner of the Territory,<br />\nare the Yellowstone, Big Horn and Powder rivers, while far-<br />\nther east a succession of small streams flow toward the Mis-<br />\nsouri. The minerals found in the Territory are principally<br />\ngold, copper, iron, paint-ore, gypsum and coal. The Laramie<br />\nPlains cover vast deposits of coal, and iron occurs in the<br />\ngreatest abundance. The ore taken from the famous Zron<br />\nMountain, near Cheyenne, is magnetic iron-stone of superior<br />\nquality and value. :<br />\n<br />\nClimate and Productions.—The air in Wyoming is<br />\nlight and pure and invigorating. Little snow falls. compared<br />\nwith the amount that falls in the States along the same lati-<br />\ntude. There is very little extremely cold weather in winter,<br />\nand the thermometer rarely rises above 90° during the hottest<br />\ndays of summer. The strong winds which prevail during most<br />\nof the fall and winter are very disagreeable, though seldom<br />\naccompanied with rain or snow. With irrigation, the soil can<br />\nbe made very productive. The chief productions are wheat,<br />\noats, barley and nearly all varieties of vegetables.<br />\n<br />\nCities, Towns, etc.— Cheyenne, the capital, is a town<br />\nof considerable importance, at the junction of the Union Pacific<br />\nand Denver Pacitic Railways. 1t was settled in 1867; and,<br />\nafter the usual rough and lawless condition attending all<br />\n“mushroom ” cities in their first rapid growth had subsided,<br />\nthe place was built up with handsome stores, dwellings,<br />\nchurches and school-houses. Trade and manufactures are<br />\ncarried on with great activity. Hvanston is located near the<br />\ngreat coal mines of the Rocky Mountain Coal Company, and<br />\nderives its importance from these mines. Sowth Pass, Humil-<br />\nton and Atlantic are inland towns near the celebrated Sweet-<br />\nwater gold mines. ZLaramie is a very pleasant town, finely<br />\nbuilt up, and is noted for its neat, and even handsome churches.<br />\nLiort Saunders is a military post, located on the Laramie River.<br />\nMost of the remaining towns have been built since the estab-<br />\nlishment of the railway. The principal ones are St. Mary’s,<br />\n<br />\nYawling, Medicine Bow, Carbon, Percy, Rock Creek, W yo-<br />\nming, ete. For Yellowstone Park, see MoNTANA.<br />\n<br />\n <br />\n<br />\nREPUBLIC OF MEXICO.<br />\n<br />\nAstronomical Position.—Between latitudes 15° 20/<br />\nand 32° 307 north, and longitudes 86° 45’ and 117° 30’ west<br />\nfrom Greenwich.<br />\n<br />\nBoundaries.—Northern, California and New Mexico;<br />\nnorth-eastern, T'exas and the Rio Grande ; eastern, the Gulf of<br />\nMexico and Cariibean Sea; south-eastern, British Honduras<br />\nand Guatemala ; and south-western and western, the Pacific<br />\nOcean. :<br />\n<br />\nDimensions.—The greatest length of the country north-<br />\nwest and south-cast is about 1,987 miles, and the greatest<br />\nbreadth about 1,128 miles. At the Isthmus of Tehuantepec<br />\nthe breadth is only 169 miles. Its frontier line measures<br />\n8,112 miles, of which 5,830 miles are sea-coast. The area is es-<br />\ntimated to be 761,281 square miles.<br />\n<br />\nPhysical Aspect, Climate, etc,—A large portion of<br />\nMexico is traversed by the great chain of the Cordilleras, which<br />\nruns through its whole length, rendering the surface extremel<br />\nvaried. On the north border of Guatemala this chain biturcates,<br />\nthe western arm following the coast of the Pacific and the east-<br />\nern arm that ot the Gulf of Mexico, subsiding into the plains of<br />\nTexas. The vast tract between these arms, comprising about<br />\nthree-fifths of the entire area of the territory, consists of a cen-<br />\ntral table-land called the plateau of Anahuac, 6,000 to 8,000 feet<br />\nabsolute elevation ; and hence its climate, though mostly within<br />\nthe tropics, is decidedly temperate. Some very high mount-<br />\naing, however, appear on the table-land, and it is also traversed<br />\nin part by well-defined ridges, which divide it into sub-plat-<br />\ncaux ; but the surface is interrupted by few transverse valleys,<br />\nand in some directions it is apparently unbroken either by de-<br />\npressions or elevations. The climate of Mexico is perhaps<br />\ndetermined less by latitude than that of any other country on<br />\nthe globe. The proximity of the oceans, the various grada-<br />\ntions of land above the sea-level, from the snow-capped peaks<br />\nof the highest mountains to the level plains, the mild aerial<br />\ncurrents that sweep up from the waters, combine to modify<br />\nthe extremes of heat and cold, and produce one of the most<br />\ndelightful climates in the world.<br />\n<br />\nMountains.—The mountains of Mexico exhibit a multi-<br />\ntude of peaks of great hight. Towering far above the central<br />\nplateau are colossal summits, concealed at times amid the<br />\n<br />\n  <br />\n  <br />\n  <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\nclouds. The loftiest of these are named in the tabular view<br />\nbelow.<br />\n<br />\nMountains. Hight. State. Mountains. H ght. Stute.<br />\nPopocatepetl*........ 17,884ft, .. Mexico. Zempoaltepetl .. ... ... 11,300ft.Oajaca.<br />\nPico de Orizava*.....17,373.... Vera Cruz.| Pico de Quincoa. .11,000. . Michoacan.<br />\nYxtaccihuatl®........15,705. ... Mexico. Volcano del Jorull . 4,149, . s<br />\nCerro de Ajusco...... 15: 80055 S Volcano de Soconusco*. 8,000.. Chiapas.<br />\nNevado de Toluca....15271... Bufa de Zacatecas...... 8,800. . Zacatecas.<br />\nCofre de Perote*. . ... 13,413....Vera Cruz.| Cerro de Veta Grande.. 9,200.. 5<br />\nVoleano de Tuxtla*.., — ....Vera Cruz.| Cerro del Mercado. . .... 8,000. . Durango.<br />\nVolcano de Colima*..12,000 ...Colima. Pico de Jesus Maria.... 8,300..Chihuahua.<br />\n<br />\nThose mountains marked (*) are volcanoes.<br />\na great many extinct volcanoes.<br />\nbut seldom do harm.<br />\n<br />\nRivers, Lakes, etc.—Mexico is singularly wanting in<br />\nnavigable chauncls. Its lakes, though numerous, are small,<br />\nand its rivers, none of any considerable length, are mostly ol-<br />\nstructed ; nor has it a single port of superior eligibility. In<br />\nthese respects it differs greatly from Central America. The<br />\n<br />\nThere are also<br />\nEarthquakes are common,<br />\n<br />\nRio Grande, on the north-eastern frontier, is the largest river :<br />\n1t 18 1,800 miles long, and is navigable for small steamers for<br />\nseveral hundred miles.<br />\n<br />\nThe Coatzacoalcos is the next in im-<br />\n<br />\n <br />\n<br />\nportance, and is navigable for 125 miles, and will be made<br />\neligible as a part of the isthmian line of commerce. The Pan-<br />\nuco, which empties into the Gulf at Tampico, would be navi-<br />\ngable for a considerable distance were ot its mouth obstructed<br />\nby a bar. The same may be said of the Tula and of the Ta-<br />\nbasco. The latter is 320 miles in length. Most of the other<br />\nrivers might more properly be called torrents. The principal<br />\nlakes besides those in the plateau of Tenochtitlan, are Chapala,<br />\nin Xalisco, which covers an area of 1,300 square miles; Pas-<br />\ncuara, in Michoacan, and those of Mextitlan, Cayman and<br />\nParras, the last two being in the tract called the Bolson de<br />\nMapimi. Lake Terminos is more properly an arm of the sea.<br />\nIt is situated between Tabasco and Yucatan, and is protected<br />\nfrom the ocean by several large islands. The area of this lake<br />\nis about 2,200 square miles. The waters of Tenochtitlan are<br />\ndeposited in five principal lakes, situated on different levels ;<br />\nthat of Tezeuco, which is near the center of the valley, and<br />\ncovers 70 square miles, is the least elevated. Farther north<br />\nare the lakes of San Cristobal and Tonanitla, and south is the<br />\nLake Chalco, occupying an area of 50 square miles ; and these<br />\nthree are five feet higher than Tezcuco. The most elevated,<br />\nhowever, though the smallest, is the Lake Zimpango, the level<br />\nof which is 25 feet above them. These lakes are fed by small<br />\nrivers, and, having no natural outlet, are drained by an arti-<br />\nficial canal. The waters of Tezcuco are salt, while those of the<br />\nother Iakes are fresh. :<br />\n<br />\nProductive Industry.—Seven-eighths of the inhabit-<br />\nants are occupied in agriculture, and this branch of industry<br />\nis by far the most valuable; but Mexico has ever been dis-<br />\ntinguished for its mineral wealth, which constitutes the basis<br />\nof its foreign commerce. Manufactures are still only in their<br />\ninception, and chiefly such as are denominated domestic.<br />\n<br />\nThe production of gold and silver has arrived at a state of<br />\nprosperity unknown in former epochs. The annual product of<br />\nsilver is about $35,000,000, and of gold between two and three<br />\nmillion dollars. .There are in the country, chiefly in Queretaro,<br />\nGuerrero, Guanajuato, San Luis, Zacatecas and Jalisco, some<br />\n25 quicksilver mines, and these yield from 250,000 to 800,000<br />\npounds annually. The richest of these mines is that of Guad-<br />\nalcazar, in San Luis, which produces at least one-third of the<br />\nwhole. Iron and other mines are but little worked.<br />\n<br />\nThe manufactures of Mexico consist chiefly of cane-sugar,<br />\nbrandy from cane, mexcal (a kind of whisky made from the<br />\nagave), oil, wine, brandy from the grape, delftware, glass, pa-<br />\nper, silk thread, cotton and woolen yarns and some cotton<br />\ngoods. In 1859 there were in the country 4 glass factories, 8<br />\npaper-mills, 72 large cotton factories and 6 large woolen facto-<br />\nries employing machinery, and upward of 70 machines worked<br />\nby hand in the manufacture of silk. In the cotton manufacture<br />\nthere is also a considerable number of hand machines for<br />\nmaking rebosos, bed-coverings, ete. The woolen manufactures<br />\nalso employ numerous small establishments in the country,<br />\nwhere coarse cloths are made. In the large establishments<br />\nfine cloths, carpets, flannels, ete., are produced.<br />\n<br />\nThe commerce of Mexico is very limited, and is confined to<br />\nthe reception of foreign manufactures sufficient for the neces-<br />\nsity or luxury of a very small class of the population, and to<br />\nthe exportation of gold and silver with a few other articles of<br />\nproduction. The imports are chiefly from England (3), France<br />\n(1-5), United States (1-5), Germany, Spain, East Indies, ete.<br />\nAlmost all the gold and silver exported is taken by British<br />\nsteamers to England. About 500 (200,000 tons) vessels are<br />\nemployed in the foreign trade. The ports of entry are Vera<br />\nCruz, Tampico, Tabasco, Campeachy, Sisal, Coatzacoalcos,<br />\n<br />\nMatamoras and Isla del Carmen on the Gulf of Mexico, and -<br />\n<br />\nthose of La Ventosa, Acapulco, Manzanillo, San Blas, Mazat-<br />\nlan, Guyamas and La Paz on the Pacific.<br />\n<br />\nConstituents,—The following is a brief account of the<br />\nseveral States and Territories of the Republic, and of their<br />\nprincipal cities. (For Area, Population, ete., see Appendix.)<br />\n<br />\nAguascalientes is the smallest of the States of Mexico.<br />\nThe general surface is 6,000 feet above sea-level. The city of<br />\nthe same name, its capital, is very favorably situated for trade—<br />\nthe great roads from all directions converging toward and into<br />\nit. It has numerous churches, convents and a hospital. Manu-<br />\nfactures are carried on to a considerable extent. In the vicinity<br />\nare two celebrated warm mineral springs (aguascalientes), the<br />\nwaters of which are impregnated with copper, and have a tem-<br />\nperature varying from 80° to 120° Fahr.<br />\n<br />\nCalifornia (7er.), known also as California Baja or Vieja,<br />\nis a peninsula divided from the mainland by the Gulf of Cali-<br />\nfornia, and extends from Cape San Lucas to the southern fron-<br />\ntier of the State of California.<br />\nconsidered as a continuous mass of high, bare and steep rocks,<br />\nwith numerous ravines intersecting them. It is only on the<br />\neastern declivity that any cultivable space is found. The west-<br />\nern side generally sinks with a rapid descent to the Pacific.<br />\nToward the northern extremity of the Gulf, from about lati-<br />\ntude 30°, the mountains recede to a considerable distance from<br />\nthe shore, and leave a large tract of flat country between them<br />\nand the sea; but this, being composed of fine sand, is entirel<br />\nsterile. The bareness of the rocks is chiefly owing to the cli-<br />\nmate. Only the southern portion has the annual rains, which<br />\nlast through September and October. At Loretto it rains only<br />\nat intervals of five or six years. Farther north, rain never<br />\n<br />\nfalls. The thermometer frequently rises to 100°, and even<br />\nhigher.  Vegetation occurs only in sheltered valleys which are<br />\n<br />\nwatered by mountain streams. Fruits of various kinds are<br />\ncultivated ; and among these, figs, olives, dates and grapes.<br />\nThe mineral riches of the country are supposed to be consid-<br />\nerable. The pearlfishery was formerly prosecuted along the<br />\nGulf coast, but the pearl-beds have become comparatively un-<br />\nproductive. Loretto is situated on a bay of the Gulf of Cali-<br />\n<br />\n(45)<br />\n<br />\nThis tract of country may be<br />\n<br />\n <br />\n<br />\nfornia, at the foot of a valley between 2,000 and 3,000 feet<br />\nwide, and surrounded by wild and sterile mountains, of which<br />\nLa Giganta rises to the hight of 5,000 feet. La Paz, the cap-<br />\nital and most important town, is farther south. Tt stands at<br />\nthe head of a deep bay, but is a place of little trade.<br />\n<br />\nCarmen (Zer.) comprises the island of the same name,<br />\nwhich lies at the mouth of Lake Terminos. Previous to 1851<br />\nit belonged to Yucatan. The Territory also includes a con-<br />\nsiderable tract on the adjoining mainland. Villa del Carmen<br />\nis the capital and principal sea-port.<br />\n<br />\nChiapas, on the south and east, is mountainous. Along<br />\nthe coast are several large lagoons, formed by narrow islands,<br />\nlying a short distance from the mainland. Almost the only<br />\narticle of commerce is logwood. Maize, sugar, cocoa, cetton<br />\nand cochineal are produced. The horses of this State are<br />\nhighly valued. Near the banks of the Rio Chacamas, a tribu-<br />\ntary of the Usumasinta, are the extensive ruins of Palenque,<br />\nwhich extend for more than twenty miles along the summit of<br />\na ridge overgrown with forests. San Cristobal, the capital of<br />\nChiapas, stands near the center of the State, in a very fertile<br />\ncountry.<br />\n<br />\nChihualwa.—It is traversed by the Sierra Madre, and<br />\ndrained by streams flowing west into the Pacific, and east into<br />\nthe Rio Grande. The soil, with little exception, is sterile; but<br />\nthe State abounds in gold, silver, copper, iron, nitre, ete. Tl:e<br />\ncapital, of the same name, is situated on the Chihuahua, a tribu-<br />\ntary of the Rio Conchas, and is a place of considerable trade.<br />\nThe city is surrounded by silver mines, and contains many<br />\nfurnaces for smelting the ores. Here is also a mint. &7 Paso,<br />\non the Rio Grande, is the most northern town in the State, and<br />\nthe crossing-place of the overland trade with the United States.<br />\n<br />\nCoahwila.—The western part of the State is occupied by<br />\na desert, called the Bolson de Mapimi. The northern part is<br />\nhilly and broken. The southern districts are chiefly pasture-<br />\ngrounds for sheep. Horses, mules and wool are exported. The<br />\nprincipal mineral is silver. Saltillo, the capital, is situated on<br />\nthe Rio Tigre, near the frontier of Nuevo Leon. It is a well-<br />\nbuilt and handsome town, and has extensive manufactures of<br />\nblankets and serapes or ponchos.<br />\n<br />\nColima (Ter.) occupies a small area around the eity of<br />\nColima, and extending southward to the Pacific. Excepting<br />\nthe volcano of Colima and the Paps of Tejupan, the surface<br />\npresents an uninterrupted level. It is very fertile, but excced-<br />\ningly unhealthy. Colima, the capital, is built on partially ele-<br />\nvated ground, at the foot of the volcano, and on the east bank<br />\nof the river of the same name.<br />\n<br />\nDurango.—The surface is rocky and mountainous, and<br />\ntraversed by the Sierra Madre. It belongs partly to the basin<br />\nof the Pacitic, but is drained chiefly by streams entering into<br />\nlakes Cayman and Parras. The greater part of the State is an<br />\nirreclaimable waste; but there are some fine meadow lands,<br />\nand along the banks of the streams the soil is rich and fertile.<br />\nAgriculture, cattle-rearing and mining are the chief employ-<br />\nments. Durango or Victoria, the capital; is situated at an<br />\nelevation of 7,295 feet above sea-level It contains a mint and<br />\nseveral woolen and cotton factories, and has a large trade in<br />\ncattle and leather. -<br />\n<br />\nGuanajuato.—It is traversed south-east and north-west<br />\nby the cordillera of Anahuac, the culminating point of which<br />\nis 9,711 feet high, and drained by numerous branches of the<br />\nRio Lerma, which empties into Lake Chapala. Precious metals<br />\nform the chief exports. Next to Queretaro and Puebla, it is<br />\nthe best populated State of the Republic. The capital, of the<br />\nsame name, is singularly situated, in a deep, narrow mountain<br />\ndefile, 6,017 feet above sea-level, and is formed of a number of<br />\nvillages placed round the mines. It contains a mint anl a<br />\npublic granary, and has valuable manufactures.<br />\n<br />\nGuerrero.—The north part is a table-land drained by the<br />\nRio Mexcala. The south part is traversed by mountains which<br />\nleave but a small margin of low land on the coast. Zixtla is<br />\nthe capital. _Acapulico is one of the principal sea-ports of the<br />\nRepublic on the Pacific. It is strongly fortified. The chief<br />\nexports are cochineal, indigo and silver. The harbor is es-<br />\nteemed one of the best in the world, and is completely land-<br />\nlocked.<br />\n<br />\nJalisco is one of the richest States of the Republic. The<br />\neastern portion is traversed by the cordillera of Anahuac, and<br />\nis extremely fertile. The central division, being less elevated,<br />\nhas a much higher temperature, and produces cotton, cochineal<br />\nand vanilla. The coast districts are very fertile, and covered<br />\nwith luxuriant forests. The principal river is ‘the Rio Grande<br />\n—the outlet of Lake Chapala. Guadalgjara, the capital, is<br />\nbuilt on the south bank of the Rio Grande, about 140 miles<br />\nfrom its mouth. = It is a large and handsome city. The cathe-<br />\ndral and the government palace are magnificent structures. It<br />\nhas a large trade. Shawls, paper, silver-ware, earthen-ware<br />\nand leather constitute the principal manufactures.<br />\n<br />\nMexico.—More than two-thirds of the surface are covered<br />\nby mountains resting on a plateau, which has a hight of 6,500<br />\nto 7,500 feet above sea-level. The culminating point, the Ne-<br />\n<br />\nvado de Toluca, has an absolute hight of 15,156 feet. The<br />\nclimate is mild and equable. Its soil is generally fertile. The<br />\n<br />\nmountains are rich in gold and silver. The State is one of the<br />\nbest populated in the Republie. Zoluca, the capital, twenty<br />\nmiles south-west of the city of Mexico, is beautifully situated<br />\nin a valley of the same name, 8,606 feet above sea-level. It is<br />\na well-built and handsome place. The lofty volcanic mountain,<br />\ncalled Nevada de Toluca, is located a short distahce south.<br />\n<br />\nMichoacan.—This State formed, with Jalisco and Coli-<br />\n<br />\nma, the ancient kingdom of Michoacan. It is very mount-<br />\nainous, and contains several volcanoes, among which is the<br />\nfamous Jorullo, 4,149 feet high. The culminating point of the<br />\nmountains, however, is found in the Pico de Quingoa, 11,000<br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n<br />\n <br />\n\f", "format": "basic_html", "processed": "<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nFHE R EPUBLEG OF<br /><br /><br /><br />\nMEXICO,<br /><br /><br /><br />\nnumerous affluents, watering a large tract of fertile land.<br />\nFlowing north, from the north-west corner of the Territory,<br />\nare the Yellowstone, Big Horn and Powder rivers, while far-<br />\nther east a succession of small streams flow toward the Mis-<br />\nsouri. The minerals found in the Territory are principally<br />\ngold, copper, iron, paint-ore, gypsum and coal. The Laramie<br />\nPlains cover vast deposits of coal, and iron occurs in the<br />\ngreatest abundance. The ore taken from the famous Zron<br />\nMountain, near Cheyenne, is magnetic iron-stone of superior<br />\nquality and value. :<br /><br />\nClimate and Productions.—The air in Wyoming is<br />\nlight and pure and invigorating. Little snow falls. compared<br />\nwith the amount that falls in the States along the same lati-<br />\ntude. There is very little extremely cold weather in winter,<br />\nand the thermometer rarely rises above 90° during the hottest<br />\ndays of summer. The strong winds which prevail during most<br />\nof the fall and winter are very disagreeable, though seldom<br />\naccompanied with rain or snow. With irrigation, the soil can<br />\nbe made very productive. The chief productions are wheat,<br />\noats, barley and nearly all varieties of vegetables.<br /><br />\nCities, Towns, etc.— Cheyenne, the capital, is a town<br />\nof considerable importance, at the junction of the Union Pacific<br />\nand Denver Pacitic Railways. 1t was settled in 1867; and,<br />\nafter the usual rough and lawless condition attending all<br />\n“mushroom ” cities in their first rapid growth had subsided,<br />\nthe place was built up with handsome stores, dwellings,<br />\nchurches and school-houses. Trade and manufactures are<br />\ncarried on with great activity. Hvanston is located near the<br />\ngreat coal mines of the Rocky Mountain Coal Company, and<br />\nderives its importance from these mines. Sowth Pass, Humil-<br />\nton and Atlantic are inland towns near the celebrated Sweet-<br />\nwater gold mines. ZLaramie is a very pleasant town, finely<br />\nbuilt up, and is noted for its neat, and even handsome churches.<br />\nLiort Saunders is a military post, located on the Laramie River.<br />\nMost of the remaining towns have been built since the estab-<br />\nlishment of the railway. The principal ones are St. Mary’s,<br /><br />\nYawling, Medicine Bow, Carbon, Percy, Rock Creek, W yo-<br />\nming, ete. For Yellowstone Park, see MoNTANA.<br /><br /><br /><br />\nREPUBLIC OF MEXICO.<br /><br />\nAstronomical Position.—Between latitudes 15° 20/<br />\nand 32° 307 north, and longitudes 86° 45’ and 117° 30’ west<br />\nfrom Greenwich.<br /><br />\nBoundaries.—Northern, California and New Mexico;<br />\nnorth-eastern, T'exas and the Rio Grande ; eastern, the Gulf of<br />\nMexico and Cariibean Sea; south-eastern, British Honduras<br />\nand Guatemala ; and south-western and western, the Pacific<br />\nOcean. :<br /><br />\nDimensions.—The greatest length of the country north-<br />\nwest and south-cast is about 1,987 miles, and the greatest<br />\nbreadth about 1,128 miles. At the Isthmus of Tehuantepec<br />\nthe breadth is only 169 miles. Its frontier line measures<br />\n8,112 miles, of which 5,830 miles are sea-coast. The area is es-<br />\ntimated to be 761,281 square miles.<br /><br />\nPhysical Aspect, Climate, etc,—A large portion of<br />\nMexico is traversed by the great chain of the Cordilleras, which<br />\nruns through its whole length, rendering the surface extremel<br />\nvaried. On the north border of Guatemala this chain biturcates,<br />\nthe western arm following the coast of the Pacific and the east-<br />\nern arm that ot the Gulf of Mexico, subsiding into the plains of<br />\nTexas. The vast tract between these arms, comprising about<br />\nthree-fifths of the entire area of the territory, consists of a cen-<br />\ntral table-land called the plateau of Anahuac, 6,000 to 8,000 feet<br />\nabsolute elevation ; and hence its climate, though mostly within<br />\nthe tropics, is decidedly temperate. Some very high mount-<br />\naing, however, appear on the table-land, and it is also traversed<br />\nin part by well-defined ridges, which divide it into sub-plat-<br />\ncaux ; but the surface is interrupted by few transverse valleys,<br />\nand in some directions it is apparently unbroken either by de-<br />\npressions or elevations. The climate of Mexico is perhaps<br />\ndetermined less by latitude than that of any other country on<br />\nthe globe. The proximity of the oceans, the various grada-<br />\ntions of land above the sea-level, from the snow-capped peaks<br />\nof the highest mountains to the level plains, the mild aerial<br />\ncurrents that sweep up from the waters, combine to modify<br />\nthe extremes of heat and cold, and produce one of the most<br />\ndelightful climates in the world.<br /><br />\nMountains.—The mountains of Mexico exhibit a multi-<br />\ntude of peaks of great hight. Towering far above the central<br />\nplateau are colossal summits, concealed at times amid the<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />\nclouds. The loftiest of these are named in the tabular view<br />\nbelow.<br /><br />\nMountains. Hight. State. Mountains. H ght. Stute.<br />\nPopocatepetl*........ 17,884ft, .. Mexico. Zempoaltepetl .. ... ... 11,300ft.Oajaca.<br />\nPico de Orizava*.....17,373.... Vera Cruz.| Pico de Quincoa. .11,000. . Michoacan.<br />\nYxtaccihuatl®........15,705. ... Mexico. Volcano del Jorull . 4,149, . s<br />\nCerro de Ajusco...... 15: 80055 S Volcano de Soconusco*. 8,000.. Chiapas.<br />\nNevado de Toluca....15271... Bufa de Zacatecas...... 8,800. . Zacatecas.<br />\nCofre de Perote*. . ... 13,413....Vera Cruz.| Cerro de Veta Grande.. 9,200.. 5<br />\nVoleano de Tuxtla*.., — ....Vera Cruz.| Cerro del Mercado. . .... 8,000. . Durango.<br />\nVolcano de Colima*..12,000 ...Colima. Pico de Jesus Maria.... 8,300..Chihuahua.<br /><br />\nThose mountains marked (*) are volcanoes.<br />\na great many extinct volcanoes.<br />\nbut seldom do harm.<br /><br />\nRivers, Lakes, etc.—Mexico is singularly wanting in<br />\nnavigable chauncls. Its lakes, though numerous, are small,<br />\nand its rivers, none of any considerable length, are mostly ol-<br />\nstructed ; nor has it a single port of superior eligibility. In<br />\nthese respects it differs greatly from Central America. The<br /><br />\nThere are also<br />\nEarthquakes are common,<br /><br />\nRio Grande, on the north-eastern frontier, is the largest river :<br />\n1t 18 1,800 miles long, and is navigable for small steamers for<br />\nseveral hundred miles.<br /><br />\nThe Coatzacoalcos is the next in im-<br /><br /><br /><br />\nportance, and is navigable for 125 miles, and will be made<br />\neligible as a part of the isthmian line of commerce. The Pan-<br />\nuco, which empties into the Gulf at Tampico, would be navi-<br />\ngable for a considerable distance were ot its mouth obstructed<br />\nby a bar. The same may be said of the Tula and of the Ta-<br />\nbasco. The latter is 320 miles in length. Most of the other<br />\nrivers might more properly be called torrents. The principal<br />\nlakes besides those in the plateau of Tenochtitlan, are Chapala,<br />\nin Xalisco, which covers an area of 1,300 square miles; Pas-<br />\ncuara, in Michoacan, and those of Mextitlan, Cayman and<br />\nParras, the last two being in the tract called the Bolson de<br />\nMapimi. Lake Terminos is more properly an arm of the sea.<br />\nIt is situated between Tabasco and Yucatan, and is protected<br />\nfrom the ocean by several large islands. The area of this lake<br />\nis about 2,200 square miles. The waters of Tenochtitlan are<br />\ndeposited in five principal lakes, situated on different levels ;<br />\nthat of Tezeuco, which is near the center of the valley, and<br />\ncovers 70 square miles, is the least elevated. Farther north<br />\nare the lakes of San Cristobal and Tonanitla, and south is the<br />\nLake Chalco, occupying an area of 50 square miles ; and these<br />\nthree are five feet higher than Tezcuco. The most elevated,<br />\nhowever, though the smallest, is the Lake Zimpango, the level<br />\nof which is 25 feet above them. These lakes are fed by small<br />\nrivers, and, having no natural outlet, are drained by an arti-<br />\nficial canal. The waters of Tezcuco are salt, while those of the<br />\nother Iakes are fresh. :<br /><br />\nProductive Industry.—Seven-eighths of the inhabit-<br />\nants are occupied in agriculture, and this branch of industry<br />\nis by far the most valuable; but Mexico has ever been dis-<br />\ntinguished for its mineral wealth, which constitutes the basis<br />\nof its foreign commerce. Manufactures are still only in their<br />\ninception, and chiefly such as are denominated domestic.<br /><br />\nThe production of gold and silver has arrived at a state of<br />\nprosperity unknown in former epochs. The annual product of<br />\nsilver is about $35,000,000, and of gold between two and three<br />\nmillion dollars. .There are in the country, chiefly in Queretaro,<br />\nGuerrero, Guanajuato, San Luis, Zacatecas and Jalisco, some<br />\n25 quicksilver mines, and these yield from 250,000 to 800,000<br />\npounds annually. The richest of these mines is that of Guad-<br />\nalcazar, in San Luis, which produces at least one-third of the<br />\nwhole. Iron and other mines are but little worked.<br /><br />\nThe manufactures of Mexico consist chiefly of cane-sugar,<br />\nbrandy from cane, mexcal (a kind of whisky made from the<br />\nagave), oil, wine, brandy from the grape, delftware, glass, pa-<br />\nper, silk thread, cotton and woolen yarns and some cotton<br />\ngoods. In 1859 there were in the country 4 glass factories, 8<br />\npaper-mills, 72 large cotton factories and 6 large woolen facto-<br />\nries employing machinery, and upward of 70 machines worked<br />\nby hand in the manufacture of silk. In the cotton manufacture<br />\nthere is also a considerable number of hand machines for<br />\nmaking rebosos, bed-coverings, ete. The woolen manufactures<br />\nalso employ numerous small establishments in the country,<br />\nwhere coarse cloths are made. In the large establishments<br />\nfine cloths, carpets, flannels, ete., are produced.<br /><br />\nThe commerce of Mexico is very limited, and is confined to<br />\nthe reception of foreign manufactures sufficient for the neces-<br />\nsity or luxury of a very small class of the population, and to<br />\nthe exportation of gold and silver with a few other articles of<br />\nproduction. The imports are chiefly from England (3), France<br />\n(1-5), United States (1-5), Germany, Spain, East Indies, ete.<br />\nAlmost all the gold and silver exported is taken by British<br />\nsteamers to England. About 500 (200,000 tons) vessels are<br />\nemployed in the foreign trade. The ports of entry are Vera<br />\nCruz, Tampico, Tabasco, Campeachy, Sisal, Coatzacoalcos,<br /><br />\nMatamoras and Isla del Carmen on the Gulf of Mexico, and -<br /><br />\nthose of La Ventosa, Acapulco, Manzanillo, San Blas, Mazat-<br />\nlan, Guyamas and La Paz on the Pacific.<br /><br />\nConstituents,—The following is a brief account of the<br />\nseveral States and Territories of the Republic, and of their<br />\nprincipal cities. (For Area, Population, ete., see Appendix.)<br /><br />\nAguascalientes is the smallest of the States of Mexico.<br />\nThe general surface is 6,000 feet above sea-level. The city of<br />\nthe same name, its capital, is very favorably situated for trade—<br />\nthe great roads from all directions converging toward and into<br />\nit. It has numerous churches, convents and a hospital. Manu-<br />\nfactures are carried on to a considerable extent. In the vicinity<br />\nare two celebrated warm mineral springs (aguascalientes), the<br />\nwaters of which are impregnated with copper, and have a tem-<br />\nperature varying from 80° to 120° Fahr.<br /><br />\nCalifornia (7er.), known also as California Baja or Vieja,<br />\nis a peninsula divided from the mainland by the Gulf of Cali-<br />\nfornia, and extends from Cape San Lucas to the southern fron-<br />\ntier of the State of California.<br />\nconsidered as a continuous mass of high, bare and steep rocks,<br />\nwith numerous ravines intersecting them. It is only on the<br />\neastern declivity that any cultivable space is found. The west-<br />\nern side generally sinks with a rapid descent to the Pacific.<br />\nToward the northern extremity of the Gulf, from about lati-<br />\ntude 30°, the mountains recede to a considerable distance from<br />\nthe shore, and leave a large tract of flat country between them<br />\nand the sea; but this, being composed of fine sand, is entirel<br />\nsterile. The bareness of the rocks is chiefly owing to the cli-<br />\nmate. Only the southern portion has the annual rains, which<br />\nlast through September and October. At Loretto it rains only<br />\nat intervals of five or six years. Farther north, rain never<br /><br />\nfalls. The thermometer frequently rises to 100°, and even<br />\nhigher.  Vegetation occurs only in sheltered valleys which are<br /><br />\nwatered by mountain streams. Fruits of various kinds are<br />\ncultivated ; and among these, figs, olives, dates and grapes.<br />\nThe mineral riches of the country are supposed to be consid-<br />\nerable. The pearlfishery was formerly prosecuted along the<br />\nGulf coast, but the pearl-beds have become comparatively un-<br />\nproductive. Loretto is situated on a bay of the Gulf of Cali-<br /><br />\n(45)<br /><br />\nThis tract of country may be<br /><br /><br /><br />\nfornia, at the foot of a valley between 2,000 and 3,000 feet<br />\nwide, and surrounded by wild and sterile mountains, of which<br />\nLa Giganta rises to the hight of 5,000 feet. La Paz, the cap-<br />\nital and most important town, is farther south. Tt stands at<br />\nthe head of a deep bay, but is a place of little trade.<br /><br />\nCarmen (Zer.) comprises the island of the same name,<br />\nwhich lies at the mouth of Lake Terminos. Previous to 1851<br />\nit belonged to Yucatan. The Territory also includes a con-<br />\nsiderable tract on the adjoining mainland. Villa del Carmen<br />\nis the capital and principal sea-port.<br /><br />\nChiapas, on the south and east, is mountainous. Along<br />\nthe coast are several large lagoons, formed by narrow islands,<br />\nlying a short distance from the mainland. Almost the only<br />\narticle of commerce is logwood. Maize, sugar, cocoa, cetton<br />\nand cochineal are produced. The horses of this State are<br />\nhighly valued. Near the banks of the Rio Chacamas, a tribu-<br />\ntary of the Usumasinta, are the extensive ruins of Palenque,<br />\nwhich extend for more than twenty miles along the summit of<br />\na ridge overgrown with forests. San Cristobal, the capital of<br />\nChiapas, stands near the center of the State, in a very fertile<br />\ncountry.<br /><br />\nChihualwa.—It is traversed by the Sierra Madre, and<br />\ndrained by streams flowing west into the Pacific, and east into<br />\nthe Rio Grande. The soil, with little exception, is sterile; but<br />\nthe State abounds in gold, silver, copper, iron, nitre, ete. Tl:e<br />\ncapital, of the same name, is situated on the Chihuahua, a tribu-<br />\ntary of the Rio Conchas, and is a place of considerable trade.<br />\nThe city is surrounded by silver mines, and contains many<br />\nfurnaces for smelting the ores. Here is also a mint. &amp;7 Paso,<br />\non the Rio Grande, is the most northern town in the State, and<br />\nthe crossing-place of the overland trade with the United States.<br /><br />\nCoahwila.—The western part of the State is occupied by<br />\na desert, called the Bolson de Mapimi. The northern part is<br />\nhilly and broken. The southern districts are chiefly pasture-<br />\ngrounds for sheep. Horses, mules and wool are exported. The<br />\nprincipal mineral is silver. Saltillo, the capital, is situated on<br />\nthe Rio Tigre, near the frontier of Nuevo Leon. It is a well-<br />\nbuilt and handsome town, and has extensive manufactures of<br />\nblankets and serapes or ponchos.<br /><br />\nColima (Ter.) occupies a small area around the eity of<br />\nColima, and extending southward to the Pacific. Excepting<br />\nthe volcano of Colima and the Paps of Tejupan, the surface<br />\npresents an uninterrupted level. It is very fertile, but excced-<br />\ningly unhealthy. Colima, the capital, is built on partially ele-<br />\nvated ground, at the foot of the volcano, and on the east bank<br />\nof the river of the same name.<br /><br />\nDurango.—The surface is rocky and mountainous, and<br />\ntraversed by the Sierra Madre. It belongs partly to the basin<br />\nof the Pacitic, but is drained chiefly by streams entering into<br />\nlakes Cayman and Parras. The greater part of the State is an<br />\nirreclaimable waste; but there are some fine meadow lands,<br />\nand along the banks of the streams the soil is rich and fertile.<br />\nAgriculture, cattle-rearing and mining are the chief employ-<br />\nments. Durango or Victoria, the capital; is situated at an<br />\nelevation of 7,295 feet above sea-level It contains a mint and<br />\nseveral woolen and cotton factories, and has a large trade in<br />\ncattle and leather. -<br /><br />\nGuanajuato.—It is traversed south-east and north-west<br />\nby the cordillera of Anahuac, the culminating point of which<br />\nis 9,711 feet high, and drained by numerous branches of the<br />\nRio Lerma, which empties into Lake Chapala. Precious metals<br />\nform the chief exports. Next to Queretaro and Puebla, it is<br />\nthe best populated State of the Republic. The capital, of the<br />\nsame name, is singularly situated, in a deep, narrow mountain<br />\ndefile, 6,017 feet above sea-level, and is formed of a number of<br />\nvillages placed round the mines. It contains a mint anl a<br />\npublic granary, and has valuable manufactures.<br /><br />\nGuerrero.—The north part is a table-land drained by the<br />\nRio Mexcala. The south part is traversed by mountains which<br />\nleave but a small margin of low land on the coast. Zixtla is<br />\nthe capital. _Acapulico is one of the principal sea-ports of the<br />\nRepublic on the Pacific. It is strongly fortified. The chief<br />\nexports are cochineal, indigo and silver. The harbor is es-<br />\nteemed one of the best in the world, and is completely land-<br />\nlocked.<br /><br />\nJalisco is one of the richest States of the Republic. The<br />\neastern portion is traversed by the cordillera of Anahuac, and<br />\nis extremely fertile. The central division, being less elevated,<br />\nhas a much higher temperature, and produces cotton, cochineal<br />\nand vanilla. The coast districts are very fertile, and covered<br />\nwith luxuriant forests. The principal river is ‘the Rio Grande<br />\n—the outlet of Lake Chapala. Guadalgjara, the capital, is<br />\nbuilt on the south bank of the Rio Grande, about 140 miles<br />\nfrom its mouth. = It is a large and handsome city. The cathe-<br />\ndral and the government palace are magnificent structures. It<br />\nhas a large trade. Shawls, paper, silver-ware, earthen-ware<br />\nand leather constitute the principal manufactures.<br /><br />\nMexico.—More than two-thirds of the surface are covered<br />\nby mountains resting on a plateau, which has a hight of 6,500<br />\nto 7,500 feet above sea-level. The culminating point, the Ne-<br /><br />\nvado de Toluca, has an absolute hight of 15,156 feet. The<br />\nclimate is mild and equable. Its soil is generally fertile. The<br /><br />\nmountains are rich in gold and silver. The State is one of the<br />\nbest populated in the Republie. Zoluca, the capital, twenty<br />\nmiles south-west of the city of Mexico, is beautifully situated<br />\nin a valley of the same name, 8,606 feet above sea-level. It is<br />\na well-built and handsome place. The lofty volcanic mountain,<br />\ncalled Nevada de Toluca, is located a short distahce south.<br /><br />\nMichoacan.—This State formed, with Jalisco and Coli-<br /><br />\nma, the ancient kingdom of Michoacan. It is very mount-<br />\nainous, and contains several volcanoes, among which is the<br />\nfamous Jorullo, 4,149 feet high. The culminating point of the<br />\nmountains, however, is found in the Pico de Quingoa, 11,000<br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br />"}], "field_media_file": [{"target_id": 56404, "display": null, "description": null, "target_type": "file", "target_uuid": "3dfe74e1-5b88-4406-b82b-5b181c3483c7", "url": "http://digital.library.jhu.edu/system/files/2022-03/17499-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 17499, "target_type": "node", "target_uuid": "6b900a89-1a41-45e8-8066-9fd5280d78c3", "url": "/node/17499"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "f883162d-4c4c-4756-b711-f927f2356abf"}]}