{"mid": [{"value": 36685}], "uuid": [{"value": "468d48ed-ea05-49bf-880f-8c07e626df03"}], "vid": [{"value": 36685}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:51:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12977-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:51:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:51:48+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "or<br />\na<br />\nas<br />\ne!ir<br />\n2(1<br />\nois,.<br />\n<br />\nid<br />\n<br />\nK-<br />\n<br />\nDr<br />\nin<br />\n<br />\nIc<br />\n<br />\nTo<br />\n<br />\n\"N<br />\n<br />\nVOL. XXVI. No. 23<br />\n<br />\nBALTIMORE, MD., JANUARY 13 1922<br />\n<br />\nPUBLICITY BOARD TO BE- COACH ARMSTRONG MAKING PLANS FOR BASEBALL<br />\nCOME HOPKINS ACTIVITY<br />\n<br />\nINTERFRATERNITY RELAY<br />\nRACE PROPOSED<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nSEASON TICKET SALE TO BE HOiVIEWOOD CO. HOLDS IMPORTANT MEETING<br />\nPUSHED FOR SPRING SPORTS<br />\n<br />\nTo Handle University Athletic Propa- Only Three Regulars Lost. Manager Coach LeCato Hopes to Uncover Stel- Intensive Campaign Will Be Conducted Dr. Van Orman Makes Informative Report on Stadiums at Other Colleges.<br />\nBy Athletic Board.<br />\nlar Material.<br />\nHuey Announces Tentative<br />\nganda. Founded Upon RecommendaSchedule.<br />\ntion of A. A. Board.<br />\nOn Tuesday afternoon the<br />\ndecided<br />\n<br />\nThe Athletic Board has<br />\nAt a meeting of the InterfraterAccording to the plans worked<br />\nAs the snow melts upon the cam- nity Board held last Monday, the that the campaign' for the sale of Homewood Company met at the<br />\nout by a committee appointed by pus and the dreaded exams draw suggestion was made that an in- season tickets for the spring sports Merchants'.Club and attained rethe Athletic Association Board, a nearer, Coach \"Herb\" Armstrong terfraternity relay race be made season is so important as to make<br />\nsults which should prove to be<br />\nhtblicity Board will be founded is making definite plans for the ap- one of the main features of the it advisable that the Board take<br />\nmost important as the company<br />\nas a Hopkins activity.<br />\nproaching baseball season. An or- Johns Hopkins—Fifth Regiment charge of the campaign itself. At<br />\nThe Publicity Board, as it has ganization meeting will be held in Indoor Games to be held in Feb- its meeting last Monday night the decided to launch a campaign for<br />\nbeen pointed out, should fill the the course of next month and bat- ruary. Coach \"Jimmy\" Le Cato- Board heard the report of a com- the erection of the Homewood<br />\ngreat need of spreading under- tery practice will begin the first of and. the members of the Interfra- mittee which President Knecht had Stadium.<br />\ngraduate propaganda throughout March.<br />\nternity Board are co-operating in appointed to draw up plans.<br />\nFor some time past Coach Van<br />\nthe country-. The University has<br />\nHayter, Keen and Captain Bill an earnest endeavor to promote<br />\nOn this committee are Mike Orman has been making an exnever had the services rendered Wood were the only members of this novel race, which will un- Bowers, chairman; Bill •Totterdale,<br />\nhaustive study of the stands and<br />\nby a college press bureau. Its only last year's team to be lost, and with doubtedly serve to bring the Sev- Andy Knecht, Dr. Ray Van Orfields<br />\nof other schools throughout<br />\nPublicity has been. through the six regulars, many capable substi- eral fraternities into more cordial man, Mr. Kistler and Mr. Palmer,<br />\nexchange of college publications tutes, and an abundance of new relationship. It is hoped by the the sales expert. Mr. Palmer's ad- the country. At the meeting Tuesand news published- in the local material, prospects for a champion- mentors of the track team that vice has been most valuable in day the results of his research<br />\npress.<br />\nship team are bright. The loss of promising new material will be dis- helping to outline the comprehen- were given in respect to the cost<br />\nThe average high school grad- Wood from behind the bat will be covered among the men who will sive plan of campaign decided on and maintenance of the stands.<br />\nuate in this as well as other states severely felt and the coach is mak- make up the various teams.<br />\nEspecially interesting was the<br />\n• by the committee.<br />\nlooks upon Hopkins-as purely a ing strenuous efforts to uncover a<br />\nTacoma<br />\nPublic School stadium,<br />\nEvery student will be expected<br />\nAccording to tentative agreemedical school. The fact that we capable backstop. It seems possi- ments, each man will probably have to take an interest in the cam- which, although having a capaciPossess one of the finest engineer- ble that \"Mike\" Strouse, who cov- to run 220 yards. Also no mem:- paign, and for the sake of turning ty at present of only 25,000, is caing schools in the country and ered third last year, but is said to ber of the varsity squad will be al- this interest into some practical use pable of great expansion and was<br />\nthat our College of Arts and Sci- have had experience behind the bat- lowed to represent his fraternity. the student body 'will be divided erected at a total cost of only<br />\nence has an - equally high stand-i ter, will be moved to the catcher's A race of this kind always serves into two groups, fraternity and $150,000. The cost for its mainteing seems to have missed the mind position. If this is the case, \"Shad\" to raise a great amount of enthusi- non-fraternity<br />\nmen.<br />\n\"Andy\" nance is very low,$3,000 and twoof the young man about to enter Sharrets, an ex-captain, will be asm in the undergraduate body, awl Knecht will be in charge of the thirds of that is returned in rentcollege. The rapid development of moved in to his old position at third. a close tussle from start to finish fraternity group and \"Bill\" Totter- als.<br />\nundergraduates life at the institu- \"Andy\" Knecht, who performed will undoubtedly be witnessed.<br />\nTwo very large stadiums were<br />\ndale will lead the non-fraternity<br />\ntion is also generally unknown. capably -in the box last year, will<br />\nreported<br />\nupon and considered by<br />\nA committee composed of men.<br />\nJohns Hopkins, as it has been again take up hurling duties and 'IacAuley, Cotton and Collins was<br />\nthe<br />\ncompany—the<br />\none now pracThe fraternity men will be dipointed out, has never adopted the will be assisted by Luther and Ow- appointed to submit a plan for a vided into chapter teams under cap- tically completed at the Ohio UniPolicy of offering athletic schol- ings, of last year's staff. Grace, at rushing agreement at the first meet- tains appointed by the committee, versity and the giant $2,000,000<br />\narships and must, therefore, de- second, and Reifschneider, at short, ing of the Board to be held after and these teams will be expected stand under consideration for the<br />\npend upon its reputation to draw will again make strong bids for the mid-year examinations.<br />\nto see all fraternity brothers among University of Illinois. Ohio U's<br />\nthe prep graduate.<br />\ntheir positions.<br />\nFreshman smoker which was the Baltimore Alumni. The non- present seating capacity is 20,000,<br />\nWith this idea in mind the comRich<br />\nand<br />\nSharrets, \"Ben\" held at the Barn last night, was fraternity men will also.be divided its planned seating capacity 64,mittee appointed by the A. A. Thomas and \"Chunky\" Wells, sub- an unqualified success. The ob- into teams and they will be required 000, and its final total capacity<br />\nBoard has decided to organize a stitutes of last season, are also at ject of the entertainment was to en- to see a certain number of the non- when completed will be 84,000.<br />\nPublicity Board to consist princi- the University and may make the able all the new men to get to know fraternity alumni.<br />\nThe enormous stadium at Illinois<br />\npally of an editor-in-chief, paper going hot for the other candidates. each other, (Ind thus promote interIn order to stimulate competi- has a planned capacity of 100,000.<br />\neditor, an out-of-town state editor<br />\nIn his report Coach Van Orman<br />\nManager \"Ted\" Huey has par- fraternity harmony and Hopkins tion among the teams, a silver lova college paper editor and a pho- tially completed an extensive sched- spirit.<br />\ning cup will be given the winning also made reference to the Yale<br />\ntographic editor.<br />\nule, part of which follows :<br />\nteam, the names of all its members and Harvard stands and to the<br />\nThe board expects to receive the<br />\nApril 11—Cornell.<br />\nengraved thereon, and it will be dis- enormous crowds attending conofficial recognition of the Student<br />\nApril 13—Blue Ridge College. STUDENT COUNCIL TO BE STRICT played either at the fraternity tests staged therein.<br />\nCouncil and as such will entitle<br />\nOf course, in such an enormous<br />\nApril 15—University of PittsThe Student Council, as stated house of the winning team or at<br />\nits workers to an activities but- burgh.<br />\nproject<br />\nas the erection of a staby its president, Dick Wood, at some prominent place around the<br />\n•<br />\nton.<br />\ndium<br />\nat<br />\nApril -18—Baltimore Orioles.<br />\nHomewood the means for<br />\nthe last assembly, is about to University if won by non-fraternity<br />\nThis organization should not be<br />\nApril 22—Open.<br />\nclamp down the lid on all viola- team. For the man making the promoting such a scheme are of<br />\nconfused with the somewhat simiApril 29—Gettysburg (pending). tors of its rules which are caught best individual sales record a sig- greatest importance and in this<br />\nlar one which was founded and<br />\nline various plans were proposed<br />\nMay 6—Ursirms (pending).<br />\nand brought before it. It is not at net ring will be the prize.<br />\nacted unofficially several years<br />\nMay 13—Western Maryland all the purpose nor even the inThe price of the season ticket and discussed. Of the plans proago. The men chosen for office on (pending).<br />\nclination of that body to act as a N\\ ill be five dollars for the alumni posed for raising such a sum the<br />\nthe board will have in their hands<br />\nMay 20—St. John's.<br />\nsort of a police force, but if fla- and general public. For medical following seem the most importhe propagation of Hopkins inforMay 24—Navy (at. Annapolis). grant violations are reported to be school students and prep school tant: Selling of stock, popular<br />\nmation and will consequently be<br />\nMay 27—Delaware (at Newark). occurring, then it is its duty to faculty and students a special price subscription and donations, and<br />\nnecessarily up on all athletic afthe selling of season tickets. At<br />\nJune 3—Haverford.<br />\npunish the violators with the only of two dollars will be made.<br />\nfairs of interest.<br />\nGames are also pending with Vir- punishment in its power, suspenIn order to check upon the activ- Tacoma the funds were raised by<br />\nUpon the success of the board g nia and \\ -AL I.<br />\nsion and expulsion, and these are ities of eveey man a card for each selling tickets at $10, good for all<br />\nWill depend, to a certain degree,<br />\n:<br />\nboth pretty serious affairs. It has prospect approached must be filled athletic events held therein for five<br />\nthe future of Hopkins athletics.<br />\ntried the effectiveness of leniency, out, telling if a ticket was sold and years. At Ohio U 12,000 persons<br />\nBOXING TEAM ASSURED AT<br />\nThe A. A. Board has appointed<br />\nbut found that sort of treatment if not, why not. It is expected in raised $1,606,000 as a golden jubiHOPKINS<br />\nW.H. Moore, Jr., to organize and<br />\nAt last Hopkins is to have a weak and apt to fall short of the this way to build up a valuable mail- lee gift from students, alumni and<br />\nget under way the new organizafriends of the university. At Illiboxing team, thanks to Mr. Mari- desired end, and the Student ing list for future campaigns.<br />\ntion. After consultation with<br />\nnois a drive for $2,000,000 was reCaptains<br />\nwill<br />\nnow<br />\nabout<br />\nto<br />\nadopt<br />\nthe<br />\nbe<br />\nis<br />\nCouncil<br />\nchosen<br />\nand<br />\nhold<br />\nno. Last Friday this enterprising<br />\nCoach Van Orman, who will be<br />\ncently<br />\nsuccessful.<br />\ntheir<br />\nfirst<br />\nextreme<br />\nof<br />\nsee<br />\nseverity,<br />\nto<br />\nmeeting<br />\nother<br />\nJanuary<br />\n31.<br />\nthe censor and adviser of the Hopkins man got all the physical<br />\nIt<br />\nwas<br />\npointed out that it<br />\nThe<br />\ncouncil<br />\nreteams<br />\nwork.<br />\nThe<br />\nwill<br />\nthen<br />\nthat<br />\nwill<br />\nbe<br />\nif<br />\narranged<br />\ntraining men in the M. E. Hall.<br />\nboard, an organization meeting<br />\nwould<br />\nnot<br />\nonly<br />\nbe desirable but of<br />\nand<br />\nthe<br />\nthat<br />\nit<br />\ncampaign<br />\nthe<br />\nfact<br />\nvery<br />\nmuch<br />\nwill<br />\ngrets<br />\nstart after<br />\nHere he gave them such an eloWill be held.<br />\nparamount<br />\nimportance<br />\nto have the<br />\na<br />\ntalk<br />\nwas,<br />\ngiven<br />\nby<br />\nup<br />\nwhat<br />\nMr.<br />\ngive<br />\nPalmer at the<br />\nquent talk on the beauties of box- was forced to<br />\nArmy-Navy<br />\ngame<br />\nstaged<br />\nhere on<br />\nfirst<br />\nhonor<br />\nassembly after examinations.<br />\nmg that seventeen men joined the in a measure, part of a true<br />\nalternate<br />\nyears<br />\nand<br />\nin<br />\nthis<br />\ntry<br />\nThe<br />\nconnecAthletic Board is counting<br />\nsquad then and there. Captain system, but it would rather<br />\nNOTICE!<br />\nPaul then urged every one to join out this other plan than to abolish on being able to sell 2,500 tickets tion the following communication<br />\nand pledged the aid of the R. 0. altogether the system, which will in this manner, for with every pros- was sent by the Varsity Club<br />\nbe the next step, if the strict pect of winning teams in the three through Robertson Griswold to<br />\nT. C.<br />\nbig spring sports, baseball, track Congressman John Philip Hill:<br />\nSIGMA CHI BETA<br />\nThe work is to be intensive, the method fails likewise.<br />\nand lacrosse, and unusually attrac- \"The Varsity Club, whichls the<br />\nfirst few weeks are to be devoted<br />\nThere will be a meeting of<br />\ntive schedules the public ought to organization now in charge of athto track work in order to get the<br />\nSigma Chi Beta tonight at<br />\nMEETING<br />\nsnap up a large quantity of tickets letics at the Johns Hopkins UniSTAFF<br />\nHULLABALOO<br />\nmen in condition. Anyone may<br />\nversity, is very much interested in<br />\n7:30 at the Beta House.<br />\nat<br />\nsuch a low price.<br />\nthe<br />\nstaff<br />\nof<br />\nA meeting of the<br />\nsubstitute boxing for physical<br />\nthe<br />\npossibility of building a large<br />\nThe<br />\nmain<br />\nfield<br />\nfor<br />\nactivity<br />\nwill,<br />\ntraining and if the work prospers Hullabaloo is to be held tomorand<br />\nmodern stadium on the site<br />\nof<br />\ncourse,<br />\nbe<br />\namong<br />\nthe<br />\nalumni,<br />\nit is thought that boxing will be row, at which plans will be disof<br />\nthe<br />\nuniversity's present athletic<br />\neveryone<br />\nof<br />\nwhom<br />\nought to buy a<br />\nmade a minor sport next year. cussed for adding some touches of<br />\nJUNIOR CLASS<br />\nfield<br />\nat<br />\nHomewood.<br />\nOnly Freshmen and Sophomores novelty to the book. Dorsey Wat- ticket; but the general public is<br />\nThere will be a meeting of<br />\n\"The<br />\nsize<br />\nof such a stadium, as<br />\nwill be allowed on the team as the kins reports that practically all also eager for tickets and it ought<br />\nwell<br />\nas<br />\nthe<br />\nthe Junior Class at 12.20 toproblem of financing<br />\ntime left to the upper classmen the pictures have been taken and to be a simple matter to sell the<br />\nits<br />\nconstruction<br />\nare largely deday in the M. E. Building.<br />\n, in the University is too short for that the work as a whole is pro- tickets with the aid of the plan<br />\nevolved by the Athletic Board.<br />\nContinued on page 3, col. 3<br />\ngressing favorably.<br />\nthem to do any real work.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1922<br />\n<br />\n2<br />\n<br />\nNews-Letter<br />\n<br />\nHopkins<br />\n<br />\nThe Johns<br />\n<br />\nFOUNDED 1897.<br />\n<br />\n$2.50<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON, '22<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEm FRANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD, '23<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br />\n<br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br />\n<br />\nFACULTY NOTES<br />\n<br />\ntinguished Service Medal for the<br />\npart which he took in the late war.<br />\nEveryone will be glad to hear<br />\nthat Dr. Hulburt's condition is<br />\nmuch improved and that he is now<br />\nable to sit up.<br />\n<br />\na rifle shoot after the Yale match<br />\nnext week. Such a contest would<br />\nafford a good chance for the military men to prove their ability as<br />\nmarksmen, and would at the same<br />\ntime add a touch of humor to the<br />\ncampus life.<br />\n<br />\nIn addition to the honors conferred upon Professors Mag,offin<br />\nand Robinson by the Archaeological Institute of America, the following Johns Hopkins professors<br />\nhave been elected to various posts<br />\nof honor at recent meetings of their<br />\nDean Latane will address the<br />\nvarious societies :<br />\nundergraduate body of the UniMt. Vernon 4999<br />\nDr. Knight Dunlap was elected versity of Virginia on \"The Wilson<br />\npresident of the American Psycho- Foundation\" this Sunday afterlogical Association; Professor E. noon.<br />\nB. Matheys was elected treasurer<br />\nCommercial Photography<br />\nof the American Geological SociSOLDIERS VS. PROFS.<br />\nCircuit Photography<br />\nety; Dr. William Kurrelmeyer was<br />\nchalhas<br />\nissued<br />\na<br />\nGarey<br />\nMajor<br />\nViews<br />\nFlash Lights<br />\nelected vice-president of the ModEnlargements<br />\nern Language Society. Moreover, lenge from the officers and other Groups<br />\nKODAK FINISHING<br />\nDr. W. A. Fisher, Jr., of the Med- members of the military department<br />\n325 N. Howard St.<br />\nical School, was awarded the Dis- to the members of the faculty to<br />\n<br />\nW.L. \"ann<br />\n<br />\numniumunimuummumunimummummmmummunumtimuniniMMIIMMInummmilluillimM11111111mMill<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBALTIMORE, MD., JANUARY 13, 1922<br />\nTHE HONOR SYSTEM<br />\nThe Honor System has long been an accepted institution at<br />\nHopkins, but for the benefit of the new men a few words are in<br />\norder at this time. The Honor System places the individual on his<br />\nhonor not to cheat in examinations, quizzes, laboratory or home<br />\nwork. This means that all written work presented as that of the<br />\nauthor must be original. Of course, in the last two cases a certain<br />\namount of co-operation is allowable, but this privilege should not be<br />\ntaken advantage of unfairly. The Honor System is therefore simply<br />\nan expression of the belief that every student at the University is a<br />\ngentleman and will conduct himself as such under all circumstances.<br />\nThe Honor System also presupposes, however, that, in addition<br />\nits rules, each student will take sufficient pride in the<br />\nobserving<br />\nto<br />\npersonnel of his Alma Mater to report arty infringement upon it<br />\nwhich he may observe. That this be done is vitally essential for the<br />\nsuccess of the system. No one likes to report a fellow student, but<br />\nwhen the interest of the college demands it, personal objections must<br />\nbe overcome. A man who cheats is one of the lowest specimens of the<br />\nhuman race and if he cheats at college he will cheat in business or in<br />\nwhatever line of work he goes into upon graduation. It is not right<br />\nthat such a man should bear the endorsement of Johns Hopkins, and<br />\nit is up to each individual student to see that he does not receive<br />\nthis honor.<br />\nThe Honor System is familiar to a number of students since<br />\nthey have had it in prep school. Some of the students, however,<br />\ncome from schools in which \"cribbing,\" while not encouraged, is not<br />\nfrowned upon severely by the students themselves. These students<br />\nmust remember that at college an entirely different attitude is taken<br />\nand govern themselves accordingly.<br />\nOccasionally a man has proved himself unworthy of the trust<br />\nimposed upon him by the Honor System, and his connection with the<br />\nUniversity has therefore been severed. We are able to state that<br />\nthe percentage of these cases has been very small in the past, and<br />\nwe trust that even this small percentage will be decreased in th,..;<br />\nfuture.<br />\n<br />\nA NEED FULFILLED<br />\nThe proposed Publicity Board, to be formed for the purpose of<br />\nspreading undergraduate propaganda throughout the country, will<br />\nfill a long-felt need. Hopkins is the best known American institution<br />\nof learning in Europe and is well known in the United States; this<br />\nreputation, however, is due to the high standard of the Medical and<br />\nGraduate Schools. The scholastic standing of this College of Arts<br />\nand Sciences and of the Engineering School, coupled with the rapid<br />\nstrides made by the undergraduates within the last few years in the<br />\ndevelopment of college life entitles these schools to almost equal<br />\nrecognition. Still the citizens of Baltimore and Maryland, and prep<br />\nschool graduates in particular seem oblivious to the fact that there<br />\nis an undergraduate body at Hopkins. If the Publicity Board can<br />\nbring this fact to their attention it will be doing Hopkins an enormous service.<br />\n<br />\nOUR NEXT ISSUE<br />\nThe next issue of the News-Letter will be dedicated to Woodrow<br />\nWilson and will appear on Monday as this day is to be observed<br />\nthroughout the country as Wilson Day. The issue will contain special articles on our noted alumnus and should be of exceptional interest to all connected with the University.<br />\n<br />\nONE 'BRAM><br />\nONE QUALITy.<br />\n<br />\nOne Size Package<br />\nAll our skill, facilities, and lifelong knowledge of<br />\nthe finest tobaccos are concentrated on this one<br />\ncigarette—CAMEL.<br />\nInto this ONE BRAND, we put the utmost quality. Nothing is too good for Camels. They are as<br />\ngood as it's possible to make a cigarette.<br />\nCamel QUALITY is always maintained at the<br />\nsame high, exclusive standard. You can always<br />\ndepend on the same mellow-mild refreshing smoothness—the taste and rich flavor of choicest tobaccos<br />\n—and entire freedom from cigaretty aftertaste.<br />\nAnd remember this! Camels come in one size<br />\npackage only-20 cigarettes—just the right size to<br />\nmake the greatest saving in production and packing.<br />\nThis saving goes straight into Camel Quality. That's<br />\nOne reason why you can get Camel Quality at so<br />\nmoderate a price.<br />\nHere's another. We put no useless frills on the<br />\nCamel package. No \"extra wrappers!\" Nothing<br />\njust for show!<br />\nSuch things do not improve the smoke any more<br />\nthan premiums or coupons. And their added cost<br />\nmust go onto the price or come out of the quality.<br />\nOne thing—and one only—is responsible for<br />\nCamels great and growing popularity<br />\nThat is CAMEL QUALITY.<br />\n<br />\narrid<br />\nR. J. REYNOLDS TOBACCO CO., Winston-Salem, N.C.<br />\n••Ig.<br />\n<br />\nIII I<br />\n<br />\nII<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1922<br />\n<br />\nch<br />\nild<br />\n<br />\niii-<br />\n<br />\nas<br />\nne<br />\nhe<br />\n<br />\nVS<br />\ntS<br />\n<br />\n111 N•samm•<br />\n<br />\nI • IN<br />\n<br />\nlesim m I<br />\n<br />\nJUNIOR-SENIOR DEBATE<br />\nANNOUNCEMENT<br />\n<br />\nMR. N. W. STORER ADDRESSES E. E.<br />\n, STUDENTS<br />\n<br />\nPHYSICAL TRAINING NOTES<br />\n<br />\n3<br />\nBIRD SURVEY BY NATURALISTS'<br />\nFIELD CLUB<br />\n•<br />\n<br />\nThe physical training classes<br />\nOn the morning of December 24<br />\nMr. Storer, of the Westinghouse will be confined to indoor work<br />\nElectric Company, an old friend of for the winter months. Dr. Aber- the Johns Hopkins Naturalists'<br />\nDr. Whitehead's, addressed the E. crombie has arranged a series of Field Club made a two and oneE. students Tuesday noon on the lectures on hygiene for the classes<br />\nhalf hour tramp, covering Homesubject of the \"Electrification of These lectures must be attended<br />\nRailways.\" This is Mr. Storer's by all members of the Freshman wood and Guilford. Sixteen differfirst visit to the University, and he and Sophomore classes who are ent species of birds were identiexpressed great approval of the not excused from physical train- fied. Starlings and Snowbirds<br />\nequipment of the laboratories.<br />\nwere most numerous. Cardinals,<br />\ning.<br />\nMr. Storer's present work in<br />\nBoxing is being taken up in Downy<br />\nWoodpeckers, Hairy<br />\nconnection with the electrification earnest by the classes. It is hoped<br />\nWoodpeckers, Mocking Birds,<br />\nfor railroads grew from a boyish that enough interest may be<br />\nfascination for this branch of eleco stirred up to start a varsity box- Meadow Larks, Redheaded Wood<br />\nlIilI,HIllIIhflhIItflliilhHhiI1'•tricity. He gave in his address ing team as a recognized sport. peckers, Tufted Titmice, Whitethese reasons for the adoption of This was attempted last year, but throated . Sparrows, Song Sparelectricity as power for locomo- the team had to discontinue on rows, English Sparrows, Crows,<br />\ntives:<br />\naccount of lack of financial sup- Nuthatches and Bluejays were<br />\n1st. Higher speed on hard grades port.<br />\nseen.<br />\nwhich would prevent congestion of<br />\ntraffic.<br />\n2nd. No smoke in tunnels.<br />\nA muffler or reefer<br />\n3rd. Increase in capacity of ter\"Queen Quality\" Home Made<br />\nCharles and 22nd Sts.<br />\nserves adouble purminals due to fewer train moves.<br />\nDelicious Sodas and Sundaes<br />\nChocolates<br />\n4th. Utilization of aerial rights<br />\npose,- it keeps the<br />\nThe Best of Candies<br />\nVISIT OUR ICE CREAM PARLORS<br />\nover tracks and consequent income<br />\n518 N. CHARLES ST.<br />\nthroat warm, and the<br />\nPrompt & Efficient Service<br />\nfrom real estate.<br />\ncollar clean.<br />\nThe efficiency of the electric loJust now those Engcomotive over the steam locomotive<br />\n1 W. University Parkway<br />\nlish squares of white<br />\nis very marked, the electric locomoST. PAUL & 24th STS.<br />\ntive<br />\nbeing<br />\ncapable of covering great<br />\nOpposite J. H. U. Athletic Field<br />\ndotted flannel are.very<br />\nC. D. Wolfe, Prop.<br />\ndistances with little inspection and<br />\npopular among college<br />\nDRUG STORE for J. H. U. BOYS<br />\ncare. The record held by one .elec- DELICIOUS SODAS & SUNDAES<br />\nmen. Made With<br />\nPHONE, HOMEWOOD 2121<br />\ntric lotomotive is 11,050 miles in<br />\nJersey Special Ice Cream<br />\n30 days. The cost of the upkeep of<br />\nTHE<br />\n\"The Velvet Finish\"<br />\nCOACH JOHNNY KNIPP URGES LA- electric lines is also less than that<br />\nBuy an (H) Pipe made special<br />\nCROSSE CANDIDATES TO PRAC- of steam. The great advantage in KODAKS CAMERAS SUPPLIES<br />\nCollar Hug Clothes<br />\nfor the Boys<br />\nTICE ON SATURDAY<br />\nthe use of electricity is .that power Whitman's Chocolates and Bon Bons<br />\nBaltimore and[theirStreets<br />\nThere has been a decided lack of can be generated at a central point<br />\nattendance in. the Saturday after- in a more efficient manner than<br />\na a • •••• som•s•I<br />\n• • • •••••• noon lacrosse practice.<br />\nThe power on a steam engine.<br />\nA former disadvantage of discoaches have been holding practices<br />\ntributing<br />\nthe current over great disevery Saturday at three-thirty, as<br />\ntances<br />\nhas<br />\nbeen dispensed with by<br />\nwell as the regular practices on<br />\nmodern<br />\nthe<br />\nfacility in handling high<br />\nMonday, Wednesday and Friday,<br />\nvoltage<br />\ncurrents.<br />\nThe difficulty in<br />\nand those candidates who have not<br />\nLeen showing up on Saturday are taking large amounts of current<br />\nurged to do so in the future. The from overhead wires has likewise<br />\nlacrosse practices will be discon- only lately been done away with by<br />\n'tinned- next- week- and will -not -be improved Methods. The remaining<br />\nresumed until after the examina- difficulties rest with the mechantions in order to give all candidates ical features of connection between<br />\nfor the team a chance to put in a the motors and drive wheels. Mr.<br />\nStorer said: \"Here is the opporlittle cramming.<br />\nT $8.00, made<br />\ntunity<br />\nfor you young mechanical<br />\nJoe Zoller and \"Bill\" Schmieser<br />\nof grain leather,<br />\nengineers.\"<br />\nwill go to New York tomorrow to<br />\nin tan or black,<br />\nattend the .annual meeting of the<br />\nN an ordinary furnace materials burn or combine with the<br />\nwith square toe and<br />\nUnited States Intercollegiate La- HOMEWOOD CO. HOLDS IMPORoxygen of the air. Melt zinc, cadmium, or lead in an<br />\nTANT MEETING<br />\ncrosse League, which will be held<br />\nheavy perforations,<br />\nordinary furnace and a scum of \"dross\" appears, an imat two o'clock in the Hotel PennContinued from page 1<br />\nthis is an oxford<br />\npurity<br />\nformed by the oxygen. You see it in the lead pots<br />\nsylvania. The main work before pendent upon the nature of the<br />\nany college man<br />\nthat plumbers use.<br />\nthe U. S. I. L. L. this year will be events that will be held there. It<br />\ncan be proud of.<br />\nthe adoption of some new rules and has been suggested that if the<br />\nIn A vacuum furnace, on the contrary, the air is<br />\nIn high shoe the<br />\nthe making of arrangements for Army-Navy game could be held<br />\npumped out SD that the heated object cannot combine with<br />\nsame style is $8.50. the proposed trip to this country of in Baltimore every other year,<br />\noxygen. Therefore in the vacuum furnace impurities are<br />\nthe Oxford lacrosse team.<br />\nthus alternating with New York,<br />\nnot formed.<br />\nthe success of such a project<br />\ntbi<br />\nwould be assured.<br />\nClearly, the chemical processes that take place in the<br />\nDRAMATIC CLUB GETTING SET<br />\n\"I have been asked to write you<br />\ntwo types are different, and the difference is important.<br />\nCharles Street, 210 North<br />\nThe gratifying number of fifty to see if you would be good<br />\nCopper, for instance, if impure, loses in electrical conduccandidates responded to the call enough to learn whether such a<br />\ntivity. Vacuum-furnace copper is pure.<br />\nof the Dramatic Club for the cast proposition would meet with the<br />\nSo the vacuum furnace has opened up a whole new<br />\napproval of Army and Navy ornof \"Captain Jinks of the Horse<br />\ncials and circles in Washington<br />\nworld of chemical investigation. The Research LaboraMarines\" and as there are twenty- and also whether any definite<br />\nastories of the General Electric Company have been exploring<br />\nseven parts in the cast to be filled surances as to the playing of alterthis new world solely to find out the possibilities under a<br />\na creditable band of players is as- nate games in Baltimore could be<br />\nnew series of conditions.<br />\nUY or rent a Corona<br />\ngiven to us in the event of our besured.<br />\ntypewriter on easy<br />\nYet there have followed practical results highly impayments. Carry it to<br />\nThis play will be remembered ing able to furnish proper facilischool every day in its<br />\nties at Homewood.\"<br />\nportant to industry. The absence of oxidation,for instance,<br />\nas the first selection for last year's<br />\nneat case. Make extra<br />\nAt the meeting the Company<br />\nmoney writing articles or<br />\nhas enabled chemists to combine metals to form new alloys<br />\nproduction, but was dropped in<br />\ndoing typing for others!<br />\ndecided<br />\nto<br />\nbegin<br />\na<br />\ncanvass<br />\nof<br />\nthe<br />\nheretofore impossible. Indeed, the vacuum furnace has<br />\nCalltoday at the nearest<br />\nfavor of \"Arms and the Man\" city to obtain some idea as, to the<br />\nCorona store—or telestimulated the study of metallurgical processes and has<br />\nphone for a demonstrabecause the latter had fewer femi- demand for such a stadium and as<br />\ntion at your home.<br />\nbecome indispensable to chemists responsible for production<br />\nnine roles. This year, however,the to the support such a project<br />\nof metals in quantities.<br />\nM. W. LUCY & CO.<br />\nclub thinks it is capable of success- would receive.<br />\nII II •• II •• II<br />\n<br />\n• t<br />\n<br />\nFor Winter Wear<br />\n<br />\nThe Debating Council has announced that the annual JuniorSenior Debate for the Adams<br />\nTrophy will be held oil Saturday<br />\nevening, the twenty-first of January. The subject for the debate<br />\nwill be:<br />\nResolved, That the United<br />\nStates Government shall own and<br />\noperate the coal resources of this<br />\ncountry.\"<br />\nThe judges have not as yet been<br />\nappointed, but the teams representing the two classes have been selected. The Senior team is made<br />\nup of Dorsey Watkins, Edward<br />\nPutzel and Adolphus Emmert. The<br />\nJunior team will be composed of<br />\nJohn Stump, Parker Williams and<br />\nBreslau. The Council has appointed Charles Murbury to manage the<br />\ndebate and Ives and Smallwood as<br />\nhis assistants.<br />\nThe Council received a communication from the University of<br />\nMaryland several days ago concerning a date for a debate for .some<br />\ntime in the spring. No reply has<br />\nbeen made yet, as the Council is<br />\nwaiting for a reply from the University of Richmond, who requested a date some time ago.<br />\n<br />\n-<br />\n<br />\nChelsea Pharmacy<br />\n<br />\nORTMAN'S<br />\n<br />\nThe College Drug Store R.G.by& Company<br />\n<br />\nr<br />\nUALITY OHOP<br />\n<br />\nL<br />\n<br />\nWhat Is a Vacuum<br />\nFurnace?<br />\n<br />\nA<br />\n<br />\nI<br />\n<br />\ngets<br />\n<br />\n(<br />\nTeachers!<br />\nB<br />\n<br />\n118 W. Fayette St.<br />\n<br />\nWeighs04lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br />\n<br />\n$50 Case<br />\nwith<br />\n<br />\nCoRoNA<br />\nThe Personal Writing Machine<br />\n<br />\nfully producing the more ambi\"CHALK, CHARCOAL AND CLAY\"<br />\ntious play;<br />\nCLUB ORGANIZED<br />\nMiss Clementine Walters, who<br />\n\"Chalk, Charcoal and Clay\" is<br />\nhas coached all the productions the name of a new club which put<br />\nof the club to very capable evi- in its appearance on the campus a<br />\norganization<br />\ndences of dramatic ability, will short while ago. This<br />\nis patterned after similar societies<br />\nagain direct her efforts to this end<br />\nat other colleges. The purpose of<br />\nand began last Thursday by read- the club is purely social and meming the play to all of the candi- bership in it is gained only by invitation.<br />\ndates after Assembly hour.<br />\n<br />\nAnd this is the result of scientific research.<br />\nDiscover new facts, add to the sum total of human<br />\nknowledge, and sooner or later, in many unexpected ways,<br />\npractical results will follow.<br />\n<br />\nanam<br />\nGeneral Office<br />\n<br />\nElectric<br />\nSchenectady, N. Y.<br />\n91r-454K<br />\n<br />\n.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1922<br />\n<br />\n4<br />\n<br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br />\n<br />\nNEW ALL-UNIVERSITY DRAMATIC Roger Babson will be the speaker,<br />\nORGANIZATION<br />\nand his subject will be \"Religion<br />\nA unique event in the social life and Business.\"<br />\n<br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br />\n<br />\nof the University took place recently when members of the faculty<br />\nand representatives of practically<br />\nImporters and Dealers in Fine Books every department at Johns Hopkins<br />\n301 N. CHARLES ST.<br />\nassembled for the purpose of orBaltimore, Md.<br />\nganizing a new dramatic club. This<br />\nmeeting marked the first attempt<br />\never made to bring together in a<br />\nsocial group both the men and<br />\nwomen students, as well as faculty<br />\nmembers, of all the departments of<br />\nthe University. Both the graduate and undergraduate schools were<br />\ninvited to take part, the idea being<br />\nCibeXatterie<br />\nr..vY<br />\nto make the club one in which<br />\nOSCAR<br />\nH.Et<br />\n‘JAME:S<br />\nevery Hopkins man would take<br />\nsome interest.<br />\n29 Baltimore St., East<br />\nThe movement to establish an<br />\nOne Door West of Light St.<br />\nall-university organization is reSOLE AGENTS FOR BALTIMORE<br />\nported to have grown out of the<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\ndesire of members of the class in<br />\nmodern drama, conducted by Miss<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\nAnna I. Miller, in the Teachers'<br />\n300 N. HOWARD ST., Baltimore, Md The project has enlisted the serSURGICAL INSTRUMENTS<br />\nvices of Mr. T. M. Cushing, draMicroscopes and Supplies,<br />\nStethoscopes<br />\nmatic critic of one of the local<br />\nBlood Lancets<br />\nBlood Counters<br />\nCollege, to produce a class play.<br />\nnewspapers, and formerly an instructor in English., A committee<br />\nwas formed composed of Mr. CushPrinters of Philological and<br />\nchairman; Miss Miller, Dr.<br />\nWorks<br />\ning,<br />\nScientific<br />\n23 S. HANOVER ST.<br />\nFrancis A. Ljtz, instructor in EngBaltimore, Md.<br />\nlish, and Mariano Badillo, well<br />\nknown among the undergraduates<br />\nas designer of settings for the Hopkins Dramatic Club. This committee has decided to test out a<br />\ntheory that the time' is ripe to<br />\nlaunch some sort of organization<br />\nto foster a general \"university spirit\" such as exists in practically<br />\nevery large university in the coun17 E. Baltimore St.<br />\ntry. The new organization, its<br />\nsponsors say, is in no way antagonistic toward the aims and ideals<br />\nPrinters of the<br />\nthe regular Dramatic Club, and<br />\nof<br />\nJohns Hopkins News-Letter<br />\nboth its sponsors and the club members are on terms of the friendli.\"<br />\n‘`aftezionede<br />\nest co-operation. The Dramatic<br />\nill<br />\nClub has offered the new organization the use of its studio,<br />\nand several prominent members<br />\nhave already \"come out\" for the<br />\n-9-4)- !.._<br />\nf „.„new society.<br />\n\\<br />\npreliminary try-outs<br />\nSeveral<br />\nhave already been held, and over<br />\n..<br />\n50 men and women have applied<br />\nfor membership. The new organi1344000 I<br />\nzation will not restrict itself to any<br />\ndefinite policy as to the kind of<br />\nCollege Literature<br />\nproductions it will attempt, and it<br />\nunderstood its first program—to<br />\nis<br />\nLOMBARD and SOUTH STREETS<br />\nhe presented about February 1st—<br />\nwill include many different kinds<br />\nof local \"talent.\" Musicians, dancers, stage carpenters, electricians,<br />\nTeach a Lesson in Style<br />\nembryo playrights, and artists are<br />\nThey possess the \"dash\" that<br />\ninvited to join, as well as those<br />\nappeals to college men, toned<br />\nwith histrionic ambition.<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nDame Rumor says the new club<br />\nenthusiasm.<br />\nhas \"signed contracts\" with some<br />\nN. HESS' SONS<br />\nmighty attractive girls, so here's a<br />\n8 E. BALTIMORE ST.<br />\nchance for our aspiring young ac,ors to play the part of Handsome<br />\nHarry or Dead-Eye Dick, safe in<br />\nhe knowledge that he is causing<br />\nutterings in the heart of a genuine<br />\nMADE TO ORDER<br />\n•feminine\" heroine.<br />\nAND<br />\n<br />\nThen will follow in order:<br />\nJohn H. Finley, associate editor<br />\nNew York Times; Jack Rose, of<br />\n\"Rosenthal Fame ;\" Rev. Floyd<br />\nTompkins, rector of Holy Trinity<br />\nChurch, Philadelphia, who will<br />\nspeak on \"True Manhood.\"<br />\nThe last speaker will be Glenn<br />\nFrank, a favorite with University<br />\nmen,the present editor of the Century Magazine, and his subject<br />\nwill be \"The New Order Versus<br />\nthe New Disorder.\"<br />\nTickets may be obtained from<br />\nMr. Sydnor or Mr. Wyckoff.<br />\n<br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br />\n<br />\nGOOD CLOTH ES<br />\nNOTHING ELSE<br />\nOnly _to' Yr !words<br />\nhut they tell our whole story.<br />\n<br />\nDo you know how best to provide<br />\nan income for your old age?<br />\nConsult with<br />\n<br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br />\n<br />\nW. W. WALKER<br />\n909 Calvert Bldg. St. Paul 2581<br />\n<br />\nORDERS RECEIVED FOR<br />\n<br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br />\n<br />\nCOGGINS'<br />\n<br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br />\n<br />\nTransfer and Baggage Express<br />\n<br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br />\n<br />\nAUTOMOBILE SERVICE<br />\n<br />\nPHONE. HOMEWOOD 2645-W<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br />\n<br />\nURNER'S<br />\n<br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Renner°<br />\n<br />\nDANCES Morning Service, I I o'clock<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Student<br />\nTelephone St. Paul 6987<br />\n<br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br />\n<br />\nE. BALTIMORE STREET<br />\nBALTIMORE<br />\n<br />\nT<br />\n<br />\nNone has the delicious<br />\nFLAVOR of the finest Turkish—<br />\nNone gives the ENJOYMENT of the finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\nNone but the highest grade<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\nMURAD.<br />\n<br />\nrz•-,,,yet<br />\n,<br />\ntifiVtinallk<br />\na •-,.•.••••••<br />\nlJaZ<br />\n<br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST— to reach<br />\nthe PEAK of Cigarette Quality<br />\n— you have but to smoke<br />\nMURAD—<br />\n<br />\nTry<br />\nIN MI U U U IIM<br />\n<br />\nMURAD<br />\n<br />\ntoday and<br />\n\"Judge for<br />\nYourself—!\"<br />\n<br />\nMI • IN le MI 'MI • MIAS •ill.,•10.111•st...sawasionsommoilms<br />\n<br />\n•<br />\n<br />\n20c<br />\n<br />\nFINISHED CLOTHES<br />\nY. M. C. A. ANNOUNCES LECTURES<br />\n<br />\n19 and 21 EAST FAYETTE ST.<br />\n<br />\nWYMAN<br />\n<br />\nURNER BROTHERS<br />\n111<br />\n<br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nto you — Of all the other tobaccos NATURE has produced —none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br />\n<br />\nLEMMERT<br />\n<br />\nThe twentieth series of theatre<br />\nmeetings, under the auspices of<br />\nthe Young Men's Christian AssoSHOES<br />\nciation, will open on Sunday aftf Jr<br />\nernoon, January 15, at Loew's<br />\nHippodrome, and continue for<br />\nUNIVERSITY MEN<br />\nFor Sport Wear even Sundays.<br />\nFor Dress<br />\nThe first speaker will be the<br />\nSmart Styles—Best Leathers<br />\nJames E. Freeman, rector of<br />\nRev.<br />\nModerate Prices<br />\nhe Church of the Epiphany,<br />\n\\Vashington, D. C., and his subject will be \"The World's Supremest Need.\" On January 22<br />\n19 W. LEXINGTON ST.<br />\n<br />\nOf the Better Class<br />\n<br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br />\n<br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br />\n<br />\nHess Shoes<br />\n<br />\nPLAZA BUILDING<br />\n<br />\nMEN'S SHOES<br />\n<br />\nST. PAUL and TWENTIETH STS.<br />\n<br />\n_<br />\n<br />\n-<br />\n<br />\n••_<br />\n40,<br />\n__-•••••-•<br />\n<br />\n\f", "format": "basic_html", "processed": "or<br />\na<br />\nas<br />\ne!ir<br />\n2(1<br />\nois,.<br /><br />\nid<br /><br />\nK-<br /><br />\nDr<br />\nin<br /><br />\nIc<br /><br />\nTo<br /><br />\n\"N<br /><br />\nVOL. XXVI. No. 23<br /><br />\nBALTIMORE, MD., JANUARY 13 1922<br /><br />\nPUBLICITY BOARD TO BE- COACH ARMSTRONG MAKING PLANS FOR BASEBALL<br />\nCOME HOPKINS ACTIVITY<br /><br />\nINTERFRATERNITY RELAY<br />\nRACE PROPOSED<br /><br />\nPRICE 5 CENTS<br /><br />\nSEASON TICKET SALE TO BE HOiVIEWOOD CO. HOLDS IMPORTANT MEETING<br />\nPUSHED FOR SPRING SPORTS<br /><br />\nTo Handle University Athletic Propa- Only Three Regulars Lost. Manager Coach LeCato Hopes to Uncover Stel- Intensive Campaign Will Be Conducted Dr. Van Orman Makes Informative Report on Stadiums at Other Colleges.<br />\nBy Athletic Board.<br />\nlar Material.<br />\nHuey Announces Tentative<br />\nganda. Founded Upon RecommendaSchedule.<br />\ntion of A. A. Board.<br />\nOn Tuesday afternoon the<br />\ndecided<br /><br />\nThe Athletic Board has<br />\nAt a meeting of the InterfraterAccording to the plans worked<br />\nAs the snow melts upon the cam- nity Board held last Monday, the that the campaign' for the sale of Homewood Company met at the<br />\nout by a committee appointed by pus and the dreaded exams draw suggestion was made that an in- season tickets for the spring sports Merchants'.Club and attained rethe Athletic Association Board, a nearer, Coach \"Herb\" Armstrong terfraternity relay race be made season is so important as to make<br />\nsults which should prove to be<br />\nhtblicity Board will be founded is making definite plans for the ap- one of the main features of the it advisable that the Board take<br />\nmost important as the company<br />\nas a Hopkins activity.<br />\nproaching baseball season. An or- Johns Hopkins—Fifth Regiment charge of the campaign itself. At<br />\nThe Publicity Board, as it has ganization meeting will be held in Indoor Games to be held in Feb- its meeting last Monday night the decided to launch a campaign for<br />\nbeen pointed out, should fill the the course of next month and bat- ruary. Coach \"Jimmy\" Le Cato- Board heard the report of a com- the erection of the Homewood<br />\ngreat need of spreading under- tery practice will begin the first of and. the members of the Interfra- mittee which President Knecht had Stadium.<br />\ngraduate propaganda throughout March.<br />\nternity Board are co-operating in appointed to draw up plans.<br />\nFor some time past Coach Van<br />\nthe country-. The University has<br />\nHayter, Keen and Captain Bill an earnest endeavor to promote<br />\nOn this committee are Mike Orman has been making an exnever had the services rendered Wood were the only members of this novel race, which will un- Bowers, chairman; Bill •Totterdale,<br />\nhaustive study of the stands and<br />\nby a college press bureau. Its only last year's team to be lost, and with doubtedly serve to bring the Sev- Andy Knecht, Dr. Ray Van Orfields<br />\nof other schools throughout<br />\nPublicity has been. through the six regulars, many capable substi- eral fraternities into more cordial man, Mr. Kistler and Mr. Palmer,<br />\nexchange of college publications tutes, and an abundance of new relationship. It is hoped by the the sales expert. Mr. Palmer's ad- the country. At the meeting Tuesand news published- in the local material, prospects for a champion- mentors of the track team that vice has been most valuable in day the results of his research<br />\npress.<br />\nship team are bright. The loss of promising new material will be dis- helping to outline the comprehen- were given in respect to the cost<br />\nThe average high school grad- Wood from behind the bat will be covered among the men who will sive plan of campaign decided on and maintenance of the stands.<br />\nuate in this as well as other states severely felt and the coach is mak- make up the various teams.<br />\nEspecially interesting was the<br />\n• by the committee.<br />\nlooks upon Hopkins-as purely a ing strenuous efforts to uncover a<br />\nTacoma<br />\nPublic School stadium,<br />\nEvery student will be expected<br />\nAccording to tentative agreemedical school. The fact that we capable backstop. It seems possi- ments, each man will probably have to take an interest in the cam- which, although having a capaciPossess one of the finest engineer- ble that \"Mike\" Strouse, who cov- to run 220 yards. Also no mem:- paign, and for the sake of turning ty at present of only 25,000, is caing schools in the country and ered third last year, but is said to ber of the varsity squad will be al- this interest into some practical use pable of great expansion and was<br />\nthat our College of Arts and Sci- have had experience behind the bat- lowed to represent his fraternity. the student body 'will be divided erected at a total cost of only<br />\nence has an - equally high stand-i ter, will be moved to the catcher's A race of this kind always serves into two groups, fraternity and $150,000. The cost for its mainteing seems to have missed the mind position. If this is the case, \"Shad\" to raise a great amount of enthusi- non-fraternity<br />\nmen.<br />\n\"Andy\" nance is very low,$3,000 and twoof the young man about to enter Sharrets, an ex-captain, will be asm in the undergraduate body, awl Knecht will be in charge of the thirds of that is returned in rentcollege. The rapid development of moved in to his old position at third. a close tussle from start to finish fraternity group and \"Bill\" Totter- als.<br />\nundergraduates life at the institu- \"Andy\" Knecht, who performed will undoubtedly be witnessed.<br />\nTwo very large stadiums were<br />\ndale will lead the non-fraternity<br />\ntion is also generally unknown. capably -in the box last year, will<br />\nreported<br />\nupon and considered by<br />\nA committee composed of men.<br />\nJohns Hopkins, as it has been again take up hurling duties and 'IacAuley, Cotton and Collins was<br />\nthe<br />\ncompany—the<br />\none now pracThe fraternity men will be dipointed out, has never adopted the will be assisted by Luther and Ow- appointed to submit a plan for a vided into chapter teams under cap- tically completed at the Ohio UniPolicy of offering athletic schol- ings, of last year's staff. Grace, at rushing agreement at the first meet- tains appointed by the committee, versity and the giant $2,000,000<br />\narships and must, therefore, de- second, and Reifschneider, at short, ing of the Board to be held after and these teams will be expected stand under consideration for the<br />\npend upon its reputation to draw will again make strong bids for the mid-year examinations.<br />\nto see all fraternity brothers among University of Illinois. Ohio U's<br />\nthe prep graduate.<br />\ntheir positions.<br />\nFreshman smoker which was the Baltimore Alumni. The non- present seating capacity is 20,000,<br />\nWith this idea in mind the comRich<br />\nand<br />\nSharrets, \"Ben\" held at the Barn last night, was fraternity men will also.be divided its planned seating capacity 64,mittee appointed by the A. A. Thomas and \"Chunky\" Wells, sub- an unqualified success. The ob- into teams and they will be required 000, and its final total capacity<br />\nBoard has decided to organize a stitutes of last season, are also at ject of the entertainment was to en- to see a certain number of the non- when completed will be 84,000.<br />\nPublicity Board to consist princi- the University and may make the able all the new men to get to know fraternity alumni.<br />\nThe enormous stadium at Illinois<br />\npally of an editor-in-chief, paper going hot for the other candidates. each other, (Ind thus promote interIn order to stimulate competi- has a planned capacity of 100,000.<br />\neditor, an out-of-town state editor<br />\nIn his report Coach Van Orman<br />\nManager \"Ted\" Huey has par- fraternity harmony and Hopkins tion among the teams, a silver lova college paper editor and a pho- tially completed an extensive sched- spirit.<br />\ning cup will be given the winning also made reference to the Yale<br />\ntographic editor.<br />\nule, part of which follows :<br />\nteam, the names of all its members and Harvard stands and to the<br />\nThe board expects to receive the<br />\nApril 11—Cornell.<br />\nengraved thereon, and it will be dis- enormous crowds attending conofficial recognition of the Student<br />\nApril 13—Blue Ridge College. STUDENT COUNCIL TO BE STRICT played either at the fraternity tests staged therein.<br />\nCouncil and as such will entitle<br />\nOf course, in such an enormous<br />\nApril 15—University of PittsThe Student Council, as stated house of the winning team or at<br />\nits workers to an activities but- burgh.<br />\nproject<br />\nas the erection of a staby its president, Dick Wood, at some prominent place around the<br />\n•<br />\nton.<br />\ndium<br />\nat<br />\nApril -18—Baltimore Orioles.<br />\nHomewood the means for<br />\nthe last assembly, is about to University if won by non-fraternity<br />\nThis organization should not be<br />\nApril 22—Open.<br />\nclamp down the lid on all viola- team. For the man making the promoting such a scheme are of<br />\nconfused with the somewhat simiApril 29—Gettysburg (pending). tors of its rules which are caught best individual sales record a sig- greatest importance and in this<br />\nlar one which was founded and<br />\nline various plans were proposed<br />\nMay 6—Ursirms (pending).<br />\nand brought before it. It is not at net ring will be the prize.<br />\nacted unofficially several years<br />\nMay 13—Western Maryland all the purpose nor even the inThe price of the season ticket and discussed. Of the plans proago. The men chosen for office on (pending).<br />\nclination of that body to act as a N\\ ill be five dollars for the alumni posed for raising such a sum the<br />\nthe board will have in their hands<br />\nMay 20—St. John's.<br />\nsort of a police force, but if fla- and general public. For medical following seem the most importhe propagation of Hopkins inforMay 24—Navy (at. Annapolis). grant violations are reported to be school students and prep school tant: Selling of stock, popular<br />\nmation and will consequently be<br />\nMay 27—Delaware (at Newark). occurring, then it is its duty to faculty and students a special price subscription and donations, and<br />\nnecessarily up on all athletic afthe selling of season tickets. At<br />\nJune 3—Haverford.<br />\npunish the violators with the only of two dollars will be made.<br />\nfairs of interest.<br />\nGames are also pending with Vir- punishment in its power, suspenIn order to check upon the activ- Tacoma the funds were raised by<br />\nUpon the success of the board g nia and \\ -AL I.<br />\nsion and expulsion, and these are ities of eveey man a card for each selling tickets at $10, good for all<br />\nWill depend, to a certain degree,<br />\n:<br />\nboth pretty serious affairs. It has prospect approached must be filled athletic events held therein for five<br />\nthe future of Hopkins athletics.<br />\ntried the effectiveness of leniency, out, telling if a ticket was sold and years. At Ohio U 12,000 persons<br />\nBOXING TEAM ASSURED AT<br />\nThe A. A. Board has appointed<br />\nbut found that sort of treatment if not, why not. It is expected in raised $1,606,000 as a golden jubiHOPKINS<br />\nW.H. Moore, Jr., to organize and<br />\nAt last Hopkins is to have a weak and apt to fall short of the this way to build up a valuable mail- lee gift from students, alumni and<br />\nget under way the new organizafriends of the university. At Illiboxing team, thanks to Mr. Mari- desired end, and the Student ing list for future campaigns.<br />\ntion. After consultation with<br />\nnois a drive for $2,000,000 was reCaptains<br />\nwill<br />\nnow<br />\nabout<br />\nto<br />\nadopt<br />\nthe<br />\nbe<br />\nis<br />\nCouncil<br />\nchosen<br />\nand<br />\nhold<br />\nno. Last Friday this enterprising<br />\nCoach Van Orman, who will be<br />\ncently<br />\nsuccessful.<br />\ntheir<br />\nfirst<br />\nextreme<br />\nof<br />\nsee<br />\nseverity,<br />\nto<br />\nmeeting<br />\nother<br />\nJanuary<br />\n31.<br />\nthe censor and adviser of the Hopkins man got all the physical<br />\nIt<br />\nwas<br />\npointed out that it<br />\nThe<br />\ncouncil<br />\nreteams<br />\nwork.<br />\nThe<br />\nwill<br />\nthen<br />\nthat<br />\nwill<br />\nbe<br />\nif<br />\narranged<br />\ntraining men in the M. E. Hall.<br />\nboard, an organization meeting<br />\nwould<br />\nnot<br />\nonly<br />\nbe desirable but of<br />\nand<br />\nthe<br />\nthat<br />\nit<br />\ncampaign<br />\nthe<br />\nfact<br />\nvery<br />\nmuch<br />\nwill<br />\ngrets<br />\nstart after<br />\nHere he gave them such an eloWill be held.<br />\nparamount<br />\nimportance<br />\nto have the<br />\na<br />\ntalk<br />\nwas,<br />\ngiven<br />\nby<br />\nup<br />\nwhat<br />\nMr.<br />\ngive<br />\nPalmer at the<br />\nquent talk on the beauties of box- was forced to<br />\nArmy-Navy<br />\ngame<br />\nstaged<br />\nhere on<br />\nfirst<br />\nhonor<br />\nassembly after examinations.<br />\nmg that seventeen men joined the in a measure, part of a true<br />\nalternate<br />\nyears<br />\nand<br />\nin<br />\nthis<br />\ntry<br />\nThe<br />\nconnecAthletic Board is counting<br />\nsquad then and there. Captain system, but it would rather<br />\nNOTICE!<br />\nPaul then urged every one to join out this other plan than to abolish on being able to sell 2,500 tickets tion the following communication<br />\nand pledged the aid of the R. 0. altogether the system, which will in this manner, for with every pros- was sent by the Varsity Club<br />\nbe the next step, if the strict pect of winning teams in the three through Robertson Griswold to<br />\nT. C.<br />\nbig spring sports, baseball, track Congressman John Philip Hill:<br />\nSIGMA CHI BETA<br />\nThe work is to be intensive, the method fails likewise.<br />\nand lacrosse, and unusually attrac- \"The Varsity Club, whichls the<br />\nfirst few weeks are to be devoted<br />\nThere will be a meeting of<br />\ntive schedules the public ought to organization now in charge of athto track work in order to get the<br />\nSigma Chi Beta tonight at<br />\nMEETING<br />\nsnap up a large quantity of tickets letics at the Johns Hopkins UniSTAFF<br />\nHULLABALOO<br />\nmen in condition. Anyone may<br />\nversity, is very much interested in<br />\n7:30 at the Beta House.<br />\nat<br />\nsuch a low price.<br />\nthe<br />\nstaff<br />\nof<br />\nA meeting of the<br />\nsubstitute boxing for physical<br />\nthe<br />\npossibility of building a large<br />\nThe<br />\nmain<br />\nfield<br />\nfor<br />\nactivity<br />\nwill,<br />\ntraining and if the work prospers Hullabaloo is to be held tomorand<br />\nmodern stadium on the site<br />\nof<br />\ncourse,<br />\nbe<br />\namong<br />\nthe<br />\nalumni,<br />\nit is thought that boxing will be row, at which plans will be disof<br />\nthe<br />\nuniversity's present athletic<br />\neveryone<br />\nof<br />\nwhom<br />\nought to buy a<br />\nmade a minor sport next year. cussed for adding some touches of<br />\nJUNIOR CLASS<br />\nfield<br />\nat<br />\nHomewood.<br />\nOnly Freshmen and Sophomores novelty to the book. Dorsey Wat- ticket; but the general public is<br />\nThere will be a meeting of<br />\n\"The<br />\nsize<br />\nof such a stadium, as<br />\nwill be allowed on the team as the kins reports that practically all also eager for tickets and it ought<br />\nwell<br />\nas<br />\nthe<br />\nthe Junior Class at 12.20 toproblem of financing<br />\ntime left to the upper classmen the pictures have been taken and to be a simple matter to sell the<br />\nits<br />\nconstruction<br />\nare largely deday in the M. E. Building.<br />\n, in the University is too short for that the work as a whole is pro- tickets with the aid of the plan<br />\nevolved by the Athletic Board.<br />\nContinued on page 3, col. 3<br />\ngressing favorably.<br />\nthem to do any real work.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1922<br /><br />\n2<br /><br />\nNews-Letter<br /><br />\nHopkins<br /><br />\nThe Johns<br /><br />\nFOUNDED 1897.<br /><br />\n$2.50<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\nHomewood 100<br />\nTelephone<br />\nEditor-in-Chief:<br />\nH. DOUGLAS COTTON, '22<br />\nManaging Editor:<br />\nWILLIAM H. MOORE, JR., '23<br />\nAssociate Editors:<br />\nEm FRANK, JR., '22.<br />\nJunior Editors:<br />\nCHARLES C. MARBURY, '22.<br />\nCRAIG E. TAYLOR, '24.<br />\nJ. HUDSON HUFFARD, '23<br />\nJOSEPH S. LEOPOLD, '24.<br />\nRIGNAL W. BALDWIN, JR., '23<br /><br />\nBusiness Manager:<br />\nFREDERICK W. LIPPS, '22.<br />\nCirculation Manager:<br />\nGLOVER P. FALLON, '23.<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN, '23.<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nJOHN C. LEWIS, '23.<br />\nFITZGERALD DUNNING, '24.<br /><br />\nFACULTY NOTES<br /><br />\ntinguished Service Medal for the<br />\npart which he took in the late war.<br />\nEveryone will be glad to hear<br />\nthat Dr. Hulburt's condition is<br />\nmuch improved and that he is now<br />\nable to sit up.<br /><br />\na rifle shoot after the Yale match<br />\nnext week. Such a contest would<br />\nafford a good chance for the military men to prove their ability as<br />\nmarksmen, and would at the same<br />\ntime add a touch of humor to the<br />\ncampus life.<br /><br />\nIn addition to the honors conferred upon Professors Mag,offin<br />\nand Robinson by the Archaeological Institute of America, the following Johns Hopkins professors<br />\nhave been elected to various posts<br />\nof honor at recent meetings of their<br />\nDean Latane will address the<br />\nvarious societies :<br />\nundergraduate body of the UniMt. Vernon 4999<br />\nDr. Knight Dunlap was elected versity of Virginia on \"The Wilson<br />\npresident of the American Psycho- Foundation\" this Sunday afterlogical Association; Professor E. noon.<br />\nB. Matheys was elected treasurer<br />\nCommercial Photography<br />\nof the American Geological SociSOLDIERS VS. PROFS.<br />\nCircuit Photography<br />\nety; Dr. William Kurrelmeyer was<br />\nchalhas<br />\nissued<br />\na<br />\nGarey<br />\nMajor<br />\nViews<br />\nFlash Lights<br />\nelected vice-president of the ModEnlargements<br />\nern Language Society. Moreover, lenge from the officers and other Groups<br />\nKODAK FINISHING<br />\nDr. W. A. Fisher, Jr., of the Med- members of the military department<br />\n325 N. Howard St.<br />\nical School, was awarded the Dis- to the members of the faculty to<br /><br />\nW.L. \"ann<br /><br />\numniumunimuummumunimummummmmummunumtimuniniMMIIMMInummmilluillimM11111111mMill<br /><br />\nMember of Southern Intercollegiate Newspaper Association:<br />\nPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBALTIMORE, MD., JANUARY 13, 1922<br />\nTHE HONOR SYSTEM<br />\nThe Honor System has long been an accepted institution at<br />\nHopkins, but for the benefit of the new men a few words are in<br />\norder at this time. The Honor System places the individual on his<br />\nhonor not to cheat in examinations, quizzes, laboratory or home<br />\nwork. This means that all written work presented as that of the<br />\nauthor must be original. Of course, in the last two cases a certain<br />\namount of co-operation is allowable, but this privilege should not be<br />\ntaken advantage of unfairly. The Honor System is therefore simply<br />\nan expression of the belief that every student at the University is a<br />\ngentleman and will conduct himself as such under all circumstances.<br />\nThe Honor System also presupposes, however, that, in addition<br />\nits rules, each student will take sufficient pride in the<br />\nobserving<br />\nto<br />\npersonnel of his Alma Mater to report arty infringement upon it<br />\nwhich he may observe. That this be done is vitally essential for the<br />\nsuccess of the system. No one likes to report a fellow student, but<br />\nwhen the interest of the college demands it, personal objections must<br />\nbe overcome. A man who cheats is one of the lowest specimens of the<br />\nhuman race and if he cheats at college he will cheat in business or in<br />\nwhatever line of work he goes into upon graduation. It is not right<br />\nthat such a man should bear the endorsement of Johns Hopkins, and<br />\nit is up to each individual student to see that he does not receive<br />\nthis honor.<br />\nThe Honor System is familiar to a number of students since<br />\nthey have had it in prep school. Some of the students, however,<br />\ncome from schools in which \"cribbing,\" while not encouraged, is not<br />\nfrowned upon severely by the students themselves. These students<br />\nmust remember that at college an entirely different attitude is taken<br />\nand govern themselves accordingly.<br />\nOccasionally a man has proved himself unworthy of the trust<br />\nimposed upon him by the Honor System, and his connection with the<br />\nUniversity has therefore been severed. We are able to state that<br />\nthe percentage of these cases has been very small in the past, and<br />\nwe trust that even this small percentage will be decreased in th,..;<br />\nfuture.<br /><br />\nA NEED FULFILLED<br />\nThe proposed Publicity Board, to be formed for the purpose of<br />\nspreading undergraduate propaganda throughout the country, will<br />\nfill a long-felt need. Hopkins is the best known American institution<br />\nof learning in Europe and is well known in the United States; this<br />\nreputation, however, is due to the high standard of the Medical and<br />\nGraduate Schools. The scholastic standing of this College of Arts<br />\nand Sciences and of the Engineering School, coupled with the rapid<br />\nstrides made by the undergraduates within the last few years in the<br />\ndevelopment of college life entitles these schools to almost equal<br />\nrecognition. Still the citizens of Baltimore and Maryland, and prep<br />\nschool graduates in particular seem oblivious to the fact that there<br />\nis an undergraduate body at Hopkins. If the Publicity Board can<br />\nbring this fact to their attention it will be doing Hopkins an enormous service.<br /><br />\nOUR NEXT ISSUE<br />\nThe next issue of the News-Letter will be dedicated to Woodrow<br />\nWilson and will appear on Monday as this day is to be observed<br />\nthroughout the country as Wilson Day. The issue will contain special articles on our noted alumnus and should be of exceptional interest to all connected with the University.<br /><br />\nONE 'BRAM&gt;<br />\nONE QUALITy.<br /><br />\nOne Size Package<br />\nAll our skill, facilities, and lifelong knowledge of<br />\nthe finest tobaccos are concentrated on this one<br />\ncigarette—CAMEL.<br />\nInto this ONE BRAND, we put the utmost quality. Nothing is too good for Camels. They are as<br />\ngood as it's possible to make a cigarette.<br />\nCamel QUALITY is always maintained at the<br />\nsame high, exclusive standard. You can always<br />\ndepend on the same mellow-mild refreshing smoothness—the taste and rich flavor of choicest tobaccos<br />\n—and entire freedom from cigaretty aftertaste.<br />\nAnd remember this! Camels come in one size<br />\npackage only-20 cigarettes—just the right size to<br />\nmake the greatest saving in production and packing.<br />\nThis saving goes straight into Camel Quality. That's<br />\nOne reason why you can get Camel Quality at so<br />\nmoderate a price.<br />\nHere's another. We put no useless frills on the<br />\nCamel package. No \"extra wrappers!\" Nothing<br />\njust for show!<br />\nSuch things do not improve the smoke any more<br />\nthan premiums or coupons. And their added cost<br />\nmust go onto the price or come out of the quality.<br />\nOne thing—and one only—is responsible for<br />\nCamels great and growing popularity<br />\nThat is CAMEL QUALITY.<br /><br />\narrid<br />\nR. J. REYNOLDS TOBACCO CO., Winston-Salem, N.C.<br />\n••Ig.<br /><br />\nIII I<br /><br />\nII<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1922<br /><br />\nch<br />\nild<br /><br />\niii-<br /><br />\nas<br />\nne<br />\nhe<br /><br />\nVS<br />\ntS<br /><br />\n111 N•samm•<br /><br />\nI • IN<br /><br />\nlesim m I<br /><br />\nJUNIOR-SENIOR DEBATE<br />\nANNOUNCEMENT<br /><br />\nMR. N. W. STORER ADDRESSES E. E.<br />\n, STUDENTS<br /><br />\nPHYSICAL TRAINING NOTES<br /><br />\n3<br />\nBIRD SURVEY BY NATURALISTS'<br />\nFIELD CLUB<br />\n•<br /><br />\nThe physical training classes<br />\nOn the morning of December 24<br />\nMr. Storer, of the Westinghouse will be confined to indoor work<br />\nElectric Company, an old friend of for the winter months. Dr. Aber- the Johns Hopkins Naturalists'<br />\nDr. Whitehead's, addressed the E. crombie has arranged a series of Field Club made a two and oneE. students Tuesday noon on the lectures on hygiene for the classes<br />\nhalf hour tramp, covering Homesubject of the \"Electrification of These lectures must be attended<br />\nRailways.\" This is Mr. Storer's by all members of the Freshman wood and Guilford. Sixteen differfirst visit to the University, and he and Sophomore classes who are ent species of birds were identiexpressed great approval of the not excused from physical train- fied. Starlings and Snowbirds<br />\nequipment of the laboratories.<br />\nwere most numerous. Cardinals,<br />\ning.<br />\nMr. Storer's present work in<br />\nBoxing is being taken up in Downy<br />\nWoodpeckers, Hairy<br />\nconnection with the electrification earnest by the classes. It is hoped<br />\nWoodpeckers, Mocking Birds,<br />\nfor railroads grew from a boyish that enough interest may be<br />\nfascination for this branch of eleco stirred up to start a varsity box- Meadow Larks, Redheaded Wood<br />\nlIilI,HIllIIhflhIItflliilhHhiI1'•tricity. He gave in his address ing team as a recognized sport. peckers, Tufted Titmice, Whitethese reasons for the adoption of This was attempted last year, but throated . Sparrows, Song Sparelectricity as power for locomo- the team had to discontinue on rows, English Sparrows, Crows,<br />\ntives:<br />\naccount of lack of financial sup- Nuthatches and Bluejays were<br />\n1st. Higher speed on hard grades port.<br />\nseen.<br />\nwhich would prevent congestion of<br />\ntraffic.<br />\n2nd. No smoke in tunnels.<br />\nA muffler or reefer<br />\n3rd. Increase in capacity of ter\"Queen Quality\" Home Made<br />\nCharles and 22nd Sts.<br />\nserves adouble purminals due to fewer train moves.<br />\nDelicious Sodas and Sundaes<br />\nChocolates<br />\n4th. Utilization of aerial rights<br />\npose,- it keeps the<br />\nThe Best of Candies<br />\nVISIT OUR ICE CREAM PARLORS<br />\nover tracks and consequent income<br />\n518 N. CHARLES ST.<br />\nthroat warm, and the<br />\nPrompt &amp; Efficient Service<br />\nfrom real estate.<br />\ncollar clean.<br />\nThe efficiency of the electric loJust now those Engcomotive over the steam locomotive<br />\n1 W. University Parkway<br />\nlish squares of white<br />\nis very marked, the electric locomoST. PAUL &amp; 24th STS.<br />\ntive<br />\nbeing<br />\ncapable of covering great<br />\nOpposite J. H. U. Athletic Field<br />\ndotted flannel are.very<br />\nC. D. Wolfe, Prop.<br />\ndistances with little inspection and<br />\npopular among college<br />\nDRUG STORE for J. H. U. BOYS<br />\ncare. The record held by one .elec- DELICIOUS SODAS &amp; SUNDAES<br />\nmen. Made With<br />\nPHONE, HOMEWOOD 2121<br />\ntric lotomotive is 11,050 miles in<br />\nJersey Special Ice Cream<br />\n30 days. The cost of the upkeep of<br />\nTHE<br />\n\"The Velvet Finish\"<br />\nCOACH JOHNNY KNIPP URGES LA- electric lines is also less than that<br />\nBuy an (H) Pipe made special<br />\nCROSSE CANDIDATES TO PRAC- of steam. The great advantage in KODAKS CAMERAS SUPPLIES<br />\nCollar Hug Clothes<br />\nfor the Boys<br />\nTICE ON SATURDAY<br />\nthe use of electricity is .that power Whitman's Chocolates and Bon Bons<br />\nBaltimore and[theirStreets<br />\nThere has been a decided lack of can be generated at a central point<br />\nattendance in. the Saturday after- in a more efficient manner than<br />\na a • •••• som•s•I<br />\n• • • •••••• noon lacrosse practice.<br />\nThe power on a steam engine.<br />\nA former disadvantage of discoaches have been holding practices<br />\ntributing<br />\nthe current over great disevery Saturday at three-thirty, as<br />\ntances<br />\nhas<br />\nbeen dispensed with by<br />\nwell as the regular practices on<br />\nmodern<br />\nthe<br />\nfacility in handling high<br />\nMonday, Wednesday and Friday,<br />\nvoltage<br />\ncurrents.<br />\nThe difficulty in<br />\nand those candidates who have not<br />\nLeen showing up on Saturday are taking large amounts of current<br />\nurged to do so in the future. The from overhead wires has likewise<br />\nlacrosse practices will be discon- only lately been done away with by<br />\n'tinned- next- week- and will -not -be improved Methods. The remaining<br />\nresumed until after the examina- difficulties rest with the mechantions in order to give all candidates ical features of connection between<br />\nfor the team a chance to put in a the motors and drive wheels. Mr.<br />\nStorer said: \"Here is the opporlittle cramming.<br />\nT $8.00, made<br />\ntunity<br />\nfor you young mechanical<br />\nJoe Zoller and \"Bill\" Schmieser<br />\nof grain leather,<br />\nengineers.\"<br />\nwill go to New York tomorrow to<br />\nin tan or black,<br />\nattend the .annual meeting of the<br />\nN an ordinary furnace materials burn or combine with the<br />\nwith square toe and<br />\nUnited States Intercollegiate La- HOMEWOOD CO. HOLDS IMPORoxygen of the air. Melt zinc, cadmium, or lead in an<br />\nTANT MEETING<br />\ncrosse League, which will be held<br />\nheavy perforations,<br />\nordinary furnace and a scum of \"dross\" appears, an imat two o'clock in the Hotel PennContinued from page 1<br />\nthis is an oxford<br />\npurity<br />\nformed by the oxygen. You see it in the lead pots<br />\nsylvania. The main work before pendent upon the nature of the<br />\nany college man<br />\nthat plumbers use.<br />\nthe U. S. I. L. L. this year will be events that will be held there. It<br />\ncan be proud of.<br />\nthe adoption of some new rules and has been suggested that if the<br />\nIn A vacuum furnace, on the contrary, the air is<br />\nIn high shoe the<br />\nthe making of arrangements for Army-Navy game could be held<br />\npumped out SD that the heated object cannot combine with<br />\nsame style is $8.50. the proposed trip to this country of in Baltimore every other year,<br />\noxygen. Therefore in the vacuum furnace impurities are<br />\nthe Oxford lacrosse team.<br />\nthus alternating with New York,<br />\nnot formed.<br />\nthe success of such a project<br />\ntbi<br />\nwould be assured.<br />\nClearly, the chemical processes that take place in the<br />\nDRAMATIC CLUB GETTING SET<br />\n\"I have been asked to write you<br />\ntwo types are different, and the difference is important.<br />\nCharles Street, 210 North<br />\nThe gratifying number of fifty to see if you would be good<br />\nCopper, for instance, if impure, loses in electrical conduccandidates responded to the call enough to learn whether such a<br />\ntivity. Vacuum-furnace copper is pure.<br />\nof the Dramatic Club for the cast proposition would meet with the<br />\nSo the vacuum furnace has opened up a whole new<br />\napproval of Army and Navy ornof \"Captain Jinks of the Horse<br />\ncials and circles in Washington<br />\nworld of chemical investigation. The Research LaboraMarines\" and as there are twenty- and also whether any definite<br />\nastories of the General Electric Company have been exploring<br />\nseven parts in the cast to be filled surances as to the playing of alterthis new world solely to find out the possibilities under a<br />\na creditable band of players is as- nate games in Baltimore could be<br />\nnew series of conditions.<br />\nUY or rent a Corona<br />\ngiven to us in the event of our besured.<br />\ntypewriter on easy<br />\nYet there have followed practical results highly impayments. Carry it to<br />\nThis play will be remembered ing able to furnish proper facilischool every day in its<br />\nties at Homewood.\"<br />\nportant to industry. The absence of oxidation,for instance,<br />\nas the first selection for last year's<br />\nneat case. Make extra<br />\nAt the meeting the Company<br />\nmoney writing articles or<br />\nhas enabled chemists to combine metals to form new alloys<br />\nproduction, but was dropped in<br />\ndoing typing for others!<br />\ndecided<br />\nto<br />\nbegin<br />\na<br />\ncanvass<br />\nof<br />\nthe<br />\nheretofore impossible. Indeed, the vacuum furnace has<br />\nCalltoday at the nearest<br />\nfavor of \"Arms and the Man\" city to obtain some idea as, to the<br />\nCorona store—or telestimulated the study of metallurgical processes and has<br />\nphone for a demonstrabecause the latter had fewer femi- demand for such a stadium and as<br />\ntion at your home.<br />\nbecome indispensable to chemists responsible for production<br />\nnine roles. This year, however,the to the support such a project<br />\nof metals in quantities.<br />\nM. W. LUCY &amp; CO.<br />\nclub thinks it is capable of success- would receive.<br />\nII II •• II •• II<br /><br />\n• t<br /><br />\nFor Winter Wear<br /><br />\nThe Debating Council has announced that the annual JuniorSenior Debate for the Adams<br />\nTrophy will be held oil Saturday<br />\nevening, the twenty-first of January. The subject for the debate<br />\nwill be:<br />\nResolved, That the United<br />\nStates Government shall own and<br />\noperate the coal resources of this<br />\ncountry.\"<br />\nThe judges have not as yet been<br />\nappointed, but the teams representing the two classes have been selected. The Senior team is made<br />\nup of Dorsey Watkins, Edward<br />\nPutzel and Adolphus Emmert. The<br />\nJunior team will be composed of<br />\nJohn Stump, Parker Williams and<br />\nBreslau. The Council has appointed Charles Murbury to manage the<br />\ndebate and Ives and Smallwood as<br />\nhis assistants.<br />\nThe Council received a communication from the University of<br />\nMaryland several days ago concerning a date for a debate for .some<br />\ntime in the spring. No reply has<br />\nbeen made yet, as the Council is<br />\nwaiting for a reply from the University of Richmond, who requested a date some time ago.<br /><br />\n-<br /><br />\nChelsea Pharmacy<br /><br />\nORTMAN'S<br /><br />\nThe College Drug Store R.G.by&amp; Company<br /><br />\nr<br />\nUALITY OHOP<br /><br />\nL<br /><br />\nWhat Is a Vacuum<br />\nFurnace?<br /><br />\nA<br /><br />\nI<br /><br />\ngets<br /><br />\n(<br />\nTeachers!<br />\nB<br /><br />\n118 W. Fayette St.<br /><br />\nWeighs04lbs.<br />\nFolds and fits<br />\nin a neat carrying case.<br /><br />\n$50 Case<br />\nwith<br /><br />\nCoRoNA<br />\nThe Personal Writing Machine<br /><br />\nfully producing the more ambi\"CHALK, CHARCOAL AND CLAY\"<br />\ntious play;<br />\nCLUB ORGANIZED<br />\nMiss Clementine Walters, who<br />\n\"Chalk, Charcoal and Clay\" is<br />\nhas coached all the productions the name of a new club which put<br />\nof the club to very capable evi- in its appearance on the campus a<br />\norganization<br />\ndences of dramatic ability, will short while ago. This<br />\nis patterned after similar societies<br />\nagain direct her efforts to this end<br />\nat other colleges. The purpose of<br />\nand began last Thursday by read- the club is purely social and meming the play to all of the candi- bership in it is gained only by invitation.<br />\ndates after Assembly hour.<br /><br />\nAnd this is the result of scientific research.<br />\nDiscover new facts, add to the sum total of human<br />\nknowledge, and sooner or later, in many unexpected ways,<br />\npractical results will follow.<br /><br />\nanam<br />\nGeneral Office<br /><br />\nElectric<br />\nSchenectady, N. Y.<br />\n91r-454K<br /><br />\n.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 13, 1922<br /><br />\n4<br /><br />\nThe Medical Standard Book Co.<br />\n(THE BOOK MART)<br /><br />\nNEW ALL-UNIVERSITY DRAMATIC Roger Babson will be the speaker,<br />\nORGANIZATION<br />\nand his subject will be \"Religion<br />\nA unique event in the social life and Business.\"<br /><br />\nComplete Stock of<br />\nMedical Books and College<br />\nRequisites<br /><br />\nof the University took place recently when members of the faculty<br />\nand representatives of practically<br />\nImporters and Dealers in Fine Books every department at Johns Hopkins<br />\n301 N. CHARLES ST.<br />\nassembled for the purpose of orBaltimore, Md.<br />\nganizing a new dramatic club. This<br />\nmeeting marked the first attempt<br />\never made to bring together in a<br />\nsocial group both the men and<br />\nwomen students, as well as faculty<br />\nmembers, of all the departments of<br />\nthe University. Both the graduate and undergraduate schools were<br />\ninvited to take part, the idea being<br />\nCibeXatterie<br />\nr..vY<br />\nto make the club one in which<br />\nOSCAR<br />\nH.Et<br />\n‘JAME:S<br />\nevery Hopkins man would take<br />\nsome interest.<br />\n29 Baltimore St., East<br />\nThe movement to establish an<br />\nOne Door West of Light St.<br />\nall-university organization is reSOLE AGENTS FOR BALTIMORE<br />\nported to have grown out of the<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\ndesire of members of the class in<br />\nmodern drama, conducted by Miss<br />\nThe Chas. Willms Surgical<br />\nInstrument Co.<br />\nAnna I. Miller, in the Teachers'<br />\n300 N. HOWARD ST., Baltimore, Md The project has enlisted the serSURGICAL INSTRUMENTS<br />\nvices of Mr. T. M. Cushing, draMicroscopes and Supplies,<br />\nStethoscopes<br />\nmatic critic of one of the local<br />\nBlood Lancets<br />\nBlood Counters<br />\nCollege, to produce a class play.<br />\nnewspapers, and formerly an instructor in English., A committee<br />\nwas formed composed of Mr. CushPrinters of Philological and<br />\nchairman; Miss Miller, Dr.<br />\nWorks<br />\ning,<br />\nScientific<br />\n23 S. HANOVER ST.<br />\nFrancis A. Ljtz, instructor in EngBaltimore, Md.<br />\nlish, and Mariano Badillo, well<br />\nknown among the undergraduates<br />\nas designer of settings for the Hopkins Dramatic Club. This committee has decided to test out a<br />\ntheory that the time' is ripe to<br />\nlaunch some sort of organization<br />\nto foster a general \"university spirit\" such as exists in practically<br />\nevery large university in the coun17 E. Baltimore St.<br />\ntry. The new organization, its<br />\nsponsors say, is in no way antagonistic toward the aims and ideals<br />\nPrinters of the<br />\nthe regular Dramatic Club, and<br />\nof<br />\nJohns Hopkins News-Letter<br />\nboth its sponsors and the club members are on terms of the friendli.\"<br />\n‘`aftezionede<br />\nest co-operation. The Dramatic<br />\nill<br />\nClub has offered the new organization the use of its studio,<br />\nand several prominent members<br />\nhave already \"come out\" for the<br />\n-9-4)- !.._<br />\nf „.„new society.<br />\n\\<br />\npreliminary try-outs<br />\nSeveral<br />\nhave already been held, and over<br />\n..<br />\n50 men and women have applied<br />\nfor membership. The new organi1344000 I<br />\nzation will not restrict itself to any<br />\ndefinite policy as to the kind of<br />\nCollege Literature<br />\nproductions it will attempt, and it<br />\nunderstood its first program—to<br />\nis<br />\nLOMBARD and SOUTH STREETS<br />\nhe presented about February 1st—<br />\nwill include many different kinds<br />\nof local \"talent.\" Musicians, dancers, stage carpenters, electricians,<br />\nTeach a Lesson in Style<br />\nembryo playrights, and artists are<br />\nThey possess the \"dash\" that<br />\ninvited to join, as well as those<br />\nappeals to college men, toned<br />\nwith histrionic ambition.<br />\ndown to distinctiveness. And<br />\nwearing qualities that provoke<br />\nDame Rumor says the new club<br />\nenthusiasm.<br />\nhas \"signed contracts\" with some<br />\nN. HESS' SONS<br />\nmighty attractive girls, so here's a<br />\n8 E. BALTIMORE ST.<br />\nchance for our aspiring young ac,ors to play the part of Handsome<br />\nHarry or Dead-Eye Dick, safe in<br />\nhe knowledge that he is causing<br />\nutterings in the heart of a genuine<br />\nMADE TO ORDER<br />\n•feminine\" heroine.<br />\nAND<br /><br />\nThen will follow in order:<br />\nJohn H. Finley, associate editor<br />\nNew York Times; Jack Rose, of<br />\n\"Rosenthal Fame ;\" Rev. Floyd<br />\nTompkins, rector of Holy Trinity<br />\nChurch, Philadelphia, who will<br />\nspeak on \"True Manhood.\"<br />\nThe last speaker will be Glenn<br />\nFrank, a favorite with University<br />\nmen,the present editor of the Century Magazine, and his subject<br />\nwill be \"The New Order Versus<br />\nthe New Disorder.\"<br />\nTickets may be obtained from<br />\nMr. Sydnor or Mr. Wyckoff.<br /><br />\nCLOTHES<br />\n211-213 E. Baltimore St.<br /><br />\nGOOD CLOTH ES<br />\nNOTHING ELSE<br />\nOnly _to' Yr !words<br />\nhut they tell our whole story.<br /><br />\nDo you know how best to provide<br />\nan income for your old age?<br />\nConsult with<br /><br />\nST. DAVID'S<br />\nProtestant Episcopal Church<br /><br />\nW. W. WALKER<br />\n909 Calvert Bldg. St. Paul 2581<br /><br />\nORDERS RECEIVED FOR<br /><br />\nN. W. Corner OAKDALE ROAD and ROLAND AVE.<br />\nRoland Park<br /><br />\nCOGGINS'<br /><br />\nREV. DR. THEODORE CLINTON FOOTE, Rector<br /><br />\nTransfer and Baggage Express<br /><br />\nSUNDAY SERVICES<br />\n8 A. M.—Holy Communion<br />\n11 A. M.—Morning Prayer and Sermon<br />\n8 P. M.—Choral Evening Prayer<br /><br />\nAUTOMOBILE SERVICE<br /><br />\nPHONE. HOMEWOOD 2645-W<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nWhy Not<br />\n\"Walk Over\"<br />\nShoes<br /><br />\nURNER'S<br /><br />\nThe Episcopal Church of<br />\nSt. Michael and All Angels<br />\nLIBERTY ST. at SARATOGA<br />\n(Opposite Hotel Renner°<br /><br />\nDANCES Morning Service, I I o'clock<br />\nEvening Service, 8 o'clock<br />\nSpecial Invitation to Hopkins Student<br />\nTelephone St. Paul 6987<br /><br />\nSMOKERS<br />\nBANQUETS<br />\nBy Arrangement<br /><br />\nE. BALTIMORE STREET<br />\nBALTIMORE<br /><br />\nT<br /><br />\nNone has the delicious<br />\nFLAVOR of the finest Turkish—<br />\nNone gives the ENJOYMENT of the finest Turkish—<br />\nNone will SATISFY you as<br />\nwill the finest Turkish—<br />\nNone but the highest grade<br />\nand personally selected<br />\nTurkish tobaccos is used in<br />\nMURAD.<br /><br />\nrz•-,,,yet<br />\n,<br />\ntifiVtinallk<br />\na •-,.•.••••••<br />\nlJaZ<br /><br />\nTo enjoy 100% pure Turkish<br />\nat its VERY BEST— to reach<br />\nthe PEAK of Cigarette Quality<br />\n— you have but to smoke<br />\nMURAD—<br /><br />\nTry<br />\nIN MI U U U IIM<br /><br />\nMURAD<br /><br />\ntoday and<br />\n\"Judge for<br />\nYourself—!\"<br /><br />\nMI • IN le MI 'MI • MIAS •ill.,•10.111•st...sawasionsommoilms<br /><br />\n•<br /><br />\n20c<br /><br />\nFINISHED CLOTHES<br />\nY. M. C. A. ANNOUNCES LECTURES<br /><br />\n19 and 21 EAST FAYETTE ST.<br /><br />\nWYMAN<br /><br />\nURNER BROTHERS<br />\n111<br /><br />\nHOUSANDS of smokers have proved it—and now give the verdict<br />\nto you — Of all the other tobaccos NATURE has produced —none<br />\ncan approach the finest varieties of pure Turkish for cigarettes—<br /><br />\nLEMMERT<br /><br />\nThe twentieth series of theatre<br />\nmeetings, under the auspices of<br />\nthe Young Men's Christian AssoSHOES<br />\nciation, will open on Sunday aftf Jr<br />\nernoon, January 15, at Loew's<br />\nHippodrome, and continue for<br />\nUNIVERSITY MEN<br />\nFor Sport Wear even Sundays.<br />\nFor Dress<br />\nThe first speaker will be the<br />\nSmart Styles—Best Leathers<br />\nJames E. Freeman, rector of<br />\nRev.<br />\nModerate Prices<br />\nhe Church of the Epiphany,<br />\n\\Vashington, D. C., and his subject will be \"The World's Supremest Need.\" On January 22<br />\n19 W. LEXINGTON ST.<br /><br />\nOf the Better Class<br /><br />\nWyatt Brown, D.D., Litt.D., Rector<br />\nHoly Communion at 7.30<br />\nYoung Men's Bible Class, 9.30<br /><br />\nLUNCHEON—:—DINNER<br />\n11:30 until 7:30<br /><br />\nHess Shoes<br /><br />\nPLAZA BUILDING<br /><br />\nMEN'S SHOES<br /><br />\nST. PAUL and TWENTIETH STS.<br /><br />\n_<br /><br />\n-<br /><br />\n••_<br />\n40,<br />\n__-•••••-•<br /><br />"}], "field_media_file": [{"target_id": 37575, "display": null, "description": null, "target_type": "file", "target_uuid": "db81aeb9-93cc-4efa-b1d0-fb3c977d99b3", "url": "http://digital.library.jhu.edu/system/files/2022-03/12977-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12977, "target_type": "node", "target_uuid": "e3d64788-3a6a-47f2-a380-6fb7986461b5", "url": "/node/12977"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d653a16e-839c-4fb6-9ef9-dac39547b5b2"}]}