{"mid": [{"value": 37725}], "uuid": [{"value": "b259094b-6dae-4657-8490-fdb1a8ca06da"}], "vid": [{"value": 37725}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:38:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12253-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:38:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:38:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "NEWS-LETTER<br />\n<br />\nJOHN DU VAL,<br />\n<br />\nEDITORIAL STAFF<br />\nMEETING IN OFFICE<br />\n<br />\nSINGS IN MIDDAY<br />\nMUSICALE TODAY<br />\n<br />\nToday, 12:30 P. M.<br />\n<br />\nLevering Hall<br />\n<br />\nVol. XXXV, No. 44<br />\n<br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD,BALTIMORE, MD., APRIL 14, 1931<br />\n<br />\nPrice 5 Cents<br />\n<br />\nrd And Blade<br />\nMAJORITY FAVORS Scabba<br />\nElects 13 Members SECOND PARLEY ON Dreamy Hypnotics Cackle<br />\nASSEMBLIES, FROSH<br />\nSCHAAL DISMISSAL<br />\nAt Psych Class Seance HOMEWOOD TRACT<br />\nRULES, VOTE SHOWS<br />\nSET FOR TOMORROW Dr. Roy M. Dorcus Directs Students In Hypnotic Trances NOT TO BE SOLD<br />\nFormal Pledging Of Electees Will Be<br />\nHeld Soon At Military<br />\nSociety Banquet<br />\n<br />\nTo Perform Weird Tasks Involuntarily<br />\nFollowing its annual custom, the<br />\nStudent Council Questionnaire Scabbard and Blade, national hon- Executive Boards Still At Odds<br />\nNo Casualties Reported<br />\norary military society, elected 13<br />\nReveals 204 Want ContinOn Ousting Of J. H. U.<br />\nnew members from among R. 0.<br />\nHen cackling, philanthropy, feats<br />\nHens Approve Crowing<br />\nuance Of Assemblies<br />\nSecretary<br />\nT. C. cadet officers. These were, in<br />\nof unbelievable physical prowess<br />\nOne hypnotee, genuinely conthe order named: Rowland, Ness,<br />\nand every conceivable form of par- vinced (as a result of a past-hyp- Move Is Result Of Appeal<br />\n219 ASK FOR RETURN<br />\nJames Witherill, Peter Weisengoff, FRIENDS WILL FIGHT<br />\nlor stunt were exhibited recently by notic suggestion) that he was a<br />\nMade By Professors<br />\nOF FROSH REGULATIONS Oscar Helm, Kenneth Sharretts and<br />\nANY ADVERSE RESULT the hypnotic subjects of Professor rooster whose sacred duty it was to<br />\nTo Willard<br />\nWestcott Hill, all top-sergeants.<br />\nRoy M. Dorcus, in his class in Ab- crow at 9.30 when Dr. Dorcus<br />\nMajority, 246 Of 292, Prefer Charles Doeller, Marlowe Perry, First Conference Decided That normal Psychology.<br />\nwould snap his finger thrice to sym- DECLARED OTHER BOARDS<br />\nInterested Visitors Attend<br />\nRonald Brooke, Graham Wood, Both Boards Would Share<br />\nbolize the \"rosy-fingered dawn\", HAD RUED SALE OF LAND<br />\nHor*rw Svctem To Faculty<br />\nThe experiments in hypnosis did so and then resumed his seat<br />\nWilliam Cox, Jr., Gale Shreve and<br />\nSurveillance, Shown<br />\nIn Nominations<br />\nproved a lodestone to hordes of in- with an air of. a task well per- Trustee Board Had Planned<br />\nAlbert Johnson.<br />\nterested visitors, mostly skeptics, formed. The crowing was so exThe Scabbard and Blade was<br />\nProperty Sale To Make<br />\nTomorrow the second conference who though they came to sneer<br />\nContinuance of assemblies and<br />\nre- tremely well done that genuine Y.<br />\nfounded at Hopkins in 1915. Chap- of the<br />\nUp Deficit<br />\nMetropolitan Board of the mained to fear. However, aside M. C. A. hens<br />\nthe reestablishment of freshmen ters have<br />\nestablished in all the downtown<br />\nin the vicinity of<br />\nbeen<br />\nbranch of the Y. M. C. from the violent expulsion of a few Levering Hall<br />\nregulations at the Johns Hopkins leading universities<br />\nS. Page Nelson, treasurer of<br />\nwere<br />\nhaving R. 0. A. and the Board<br />\nUniversity is favored by the major- T. C. units, order<br />\nof Managers of individuals from the room by a up and take notice. reported to sit the Johns<br />\nin<br />\nto<br />\nappropriate<br />\nHopkins University, has<br />\nthe<br />\nHopkins branch will be held at<br />\nity of the undergraduates, the tab- ly recognize outstandin<br />\nbeen requested by the Board of<br />\nUnemployment Address Lucrative<br />\ng military Levering Hall, or at the Metropoli- hypnotee, no casualties were reulation of answers to the recent ability among<br />\nported.<br />\nRequested to deliver an address Trustees to withdraw from sale the<br />\ncadet officers, one- tan office, for further discussion<br />\nof<br />\nquestionaire distributed by the Stu- third of<br />\nPresents Amusing Appearance<br />\non unemployment, the subject did tract of land northwest of the athwhom are eligible for mem- the dismissal of E. A. Schaal by the<br />\nA. hypnotic subject presents a so with much gusto. His<br />\ndent Council at Homewood. re- bership.<br />\naddress— letic field and bounded by Univerformer body.<br />\nrather amusing appearance, eyes somewhat conservative was<br />\nvealed yesterday.<br />\nFormal pledging of these men<br />\nreward- sity Parkway and Wymans' Park<br />\nWhether Mr. Schaal, secretary closed or nearly so, lethargic, and ed with a<br />\n204 Want Assemblies<br />\nshower<br />\nof<br />\nnickels<br />\nwill<br />\nbe<br />\nheld<br />\nand Drive, at Homewood, it was learned<br />\nbanquet<br />\nsoon<br />\nto<br />\nat<br />\na<br />\nof the Johns Hopkins branch of the speaking in a low uncanny voice small<br />\nOf the 292 students who filled<br />\nchange<br />\nwhen<br />\nat<br />\nthe<br />\nwhich<br />\nDr.<br />\nsugges- yesterday.<br />\nJoseph S. Ames and Dr. Y. M. C. A. will be reappointed to that<br />\nout the query blanks, 204 advocated<br />\nis almost sepulchral.<br />\ntion of the operator he circulated a<br />\nResult Of Appeal<br />\nEdward<br />\nW.<br />\nBerry<br />\nhave<br />\ninbeen<br />\nthe position he now holds at Homethe continuance of assemblies here,<br />\nHis will entirely under the con- derby among the observers.<br />\nThis move is said to be the result<br />\nvited.<br />\nAlwood,<br />\nor not, has not yet been de- trol of the operator, and the subject though the collection<br />\nand 219 asked for the return of<br />\nwas for the of an appeal made by twelve memcided upon by the Metropolitan has no sense of the ridiculous. If a poor and<br />\nfreshmen regulations on the campus<br />\nneedy, the subject pocket- bers of the faculty to Daniel WilBoard. It is expected by Y. M. C. subject is told he is a donkey or a ed the lucre<br />\n. for the next academic year.<br />\n. . . ostensibly because lard, trustees' head, to abandon the<br />\nA. officials that a definite decision member of the Student Council, he he was<br />\nOne hundred and two underplan to sell the 331-foot plot of<br />\npoor and needy.<br />\nwill be reached following tomor- believes both implicitly, and acts<br />\ngraduates declared themselves as<br />\nAttempts by subjects to sell land.<br />\nrow's conference.<br />\naccordingly.<br />\npreferring the plan whereby attendThey declared before Mr. Wilbooks, dismember innocent bystandMay Produce Anesthesia<br />\nWill Not Stop Fight<br />\nance at assemblies would be com- Dr. Frederick C. Lane Apers who (they had been told) had lard that other universities which<br />\nComplete anesthesia may be pro- cast<br />\nIt is believed that the Y. M. C. A.<br />\nhad shown similar lack of foresight<br />\npulsory throughout the year for<br />\naspersions<br />\npointed History Associate<br />\nleaders at the Hopkins will not give duced so that if a subject is told and attempts on their moral life, in planning their<br />\nfreshmen. As advised by the Counto<br />\ncampuses were<br />\nwrite<br />\nsentences<br />\nup the fight for retaining Schaal, that a match held under his hand from which<br />\nlater forced to buy land at doubled<br />\ncil, this plan provides for weekly<br />\nthe<br />\nconsonants<br />\nhad<br />\nstudent meetings during October WAS BACKED BY COUNCIL even if the decision reached at this will have no effect. 'Much to the been omitted were a few of the prices to accommodate their buildconference is adverse to Schaal. amusement of the audience, the other mental<br />\nand November to orient the first<br />\ngyrations performed ings.<br />\nA.<br />\n0.<br />\nShould the decision be adverse to subjects also strained at mythical for the<br />\nBabendrei<br />\ner,<br />\nHubF.<br />\nT.<br />\nCampus Would Be Hemmed In<br />\nyear men; then, subsequent monthdelectation of the audience<br />\nSchaal, the \"Y\" leaders here, it is weights, described vividly yari-col- and the good<br />\nSale<br />\nbard Are Made Associates<br />\nof the land would probably<br />\nly assemblies for the two under<br />\nof science.<br />\nbelieved, will probably make a drive ored animals and violently ejected<br />\nresult in the hemming in of the<br />\nAnimal Magnetism<br />\nclasses.<br />\nThree promotions were made by to arouse student opinion on the spectators to whom the operator<br />\nHypnotism, formerly known as campus by apartment buildings,<br />\nOpinions 'Vary<br />\nseemed for any reason to take ob- Animal Magnetism and<br />\nStudent opinion varied on the the Board of Trustees in the fac- matter.<br />\nMesmerism they said.<br />\nDr. Joseph<br />\nAmes, president of jection.<br />\nIt was also charged that a gradmatter of freshman attendance. ulty for 1931-32.<br />\n(Continued on page 3, col. 3.<br />\nual \"nibbling away\" of Homewood<br />\nOnly 34 favored compulsory atDr. Frederick Chapin Lane, in- the University called the first conproperty first started with the sale<br />\ntendance for frosh throughout the structor in history, has been pro- ference of the two boards about a<br />\nof less valuable land had finally reyear—during the first semester, moted to associate in history. He month ago in an effort to clear up<br />\nsulted in the ceding of several<br />\nweekly meetings; during the sec- was recommended to the position the misunderstanding which had<br />\narisen regarding the scope of auchoice acres to Baltimore City for<br />\nond, monthly. Thirty-five want as- by the Academic Council.<br />\nthority of both bodies in the selecan art museum.<br />\nsemblies but no compulsory attendBabendreier, Hubbard Named<br />\ntion of the campus \"Y\" branch sec- Lacrosse Attack Reels Off Goal 791<br />\n/<br />\n2 to 461<br />\nAt the time that the property was<br />\n/<br />\n2 Is Final Score Of<br />\nance for either freshmen or sophoA. 0. Babendreier, instructor in<br />\nAfter Goal<br />\noffered for sale, it was announced<br />\nTest<br />\nmores during the second semester. drawing, has been named associate retary. It was mutually agreed at<br />\nthat the funds to be derived from<br />\nTwenty-eight students advocate no in drawing, and T. F. Hubbard, in- this conference that each board was<br />\nDEFENSE LITTLE USED<br />\nENEMY CAPTAIN STARS such a transaction were needed to<br />\ncompulsion whatever. Twenty-eight structor in civil engineering, asso- to have the privilege of nominating<br />\nmake up a deficit in the University<br />\ndesire either weekly or monthly ciate. Both men were recommend- anyone for the position, but that<br />\nboth boards must agree upon a sin- Stronger Competition Deemed Jay Team Take<br />\ntreasury.<br />\nreveals,<br />\nballot<br />\nmeetings,<br />\nthe<br />\nstudent<br />\nDashes And<br />\ned for promotions by the advisory gle man.<br />\nProfessors In Move<br />\nNecessary For Stickmen<br />\n2-Mile Run<br />\nwithout compulsory attendance.<br />\nhoard of the School of EngineerAsked To Resign<br />\nProfessors<br />\nin the move were: K.<br />\nWeekly<br />\nMeets<br />\nDesire<br />\n87<br />\ning.<br />\nR.<br />\nLast<br />\nGreenfield,<br />\nJuly<br />\nMr.<br />\nSchaal<br />\nwas<br />\nasked<br />\nEighty -seven undergraduates<br />\nLast Saturday the Johns HopDisplaying marked power in the R. D. Havens, F. R. Murnaghan,<br />\nDr. Lane, who was educated at to resign by the Metropolitan<br />\nTenney Frank, S. 0.<br />\nspecified that they want weekly or Harvard<br />\nUniversity, became a Board, but he refused, saying he kins lacrosse squad conquered dashes and field events, the Jay Mast, Knight Dunlap, A. 0. Lovemonthly assemblies with stringent, member<br />\nSwarthmor<br />\nCollege<br />\ne<br />\nthe<br />\noverby<br />\ntracksters<br />\ndefeated the team of joy, E. W. Berry, Broadus<br />\nof the faculty here in 1928. would resign only to the Hopkins<br />\nMitcompulsory attendance by all first- Dr. Kent<br />\nR. Greenfield, professor Board. Hopkins officials support- whelming score of 11-0. The Black Gettysburg College in a meet last chell.<br />\nyear students.<br />\nand Blue team continued to display Saturday by the score of 791/<br />\nof European history, it is said, re- ed him in his decision.<br />\n2 to<br />\nFavoring a nominal number of gards him as an invaluable<br />\nthe same brilliant form that it has 461/<br />\n2.<br />\nasset<br />\nto<br />\nconference<br />\nFollowing<br />\nthe<br />\nfirst<br />\n\"cuts\" from assemblies were 160 the history department both<br />\ndemonstrated in its past two vicIn only the broad jump were the 0. D. K. To Initiate<br />\nas a<br />\nstudents, the questionnaire tabula- research worker and undergraduate of a month ago, Mr. Schaal was tories.<br />\nPennsylvanians able to show any<br />\nAt Next Assembly<br />\nrecommended for reappointment<br />\ntion shows.<br />\nThe attack reeled off goal after marked supremacy. The work of<br />\ninstructor.<br />\nnext<br />\nyear<br />\nBoard.<br />\nby<br />\nHopkins<br />\nthe<br />\nPrefer Honor System<br />\nIn 1923 Mr. Babendreier was .No decision could be reached by the goal almost at will. At times the Schwartz, Gettysburg captain, was Dr. John C. French To Make Principal<br />\nAsked \"Do you want the Honor named to<br />\nthe teaching staff. Mr. downtown board, it is believed so Black and Blue teamwork was so the feature of the meet. Schwartz Address At Second Public InvitaSystem in preference to faculty Hubbard<br />\ntion of Fraternity<br />\nhas<br />\nbeen a member of the this second conference has been perfect in its scoring plays that the took both the hurdles, won the<br />\nsurveillance?\" 246 Hopkins men faculty<br />\nNext<br />\nThursday's<br />\ngoals<br />\nbroad<br />\nseemed<br />\nassembly will<br />\nsince 1925.<br />\njump and javelin, and placed<br />\ntoo simple to be real.<br />\ncalled.<br />\ndeclared they prefer the Honor<br />\nsecond to \"Bill\" Dorman in the be devoted to the second public iniOutstanding<br />\nEvent<br />\nOccurs<br />\nSystem. Only 46 would rather have<br />\ntiation of the Omicron Delta Kappa<br />\nThe most outstanding instance discus.<br />\nfaculty surveillance.<br />\nwith Edwin Lockard, president of<br />\nLockard, Dorman Star<br />\noccurred at about the middle of the<br />\nThe questionnaire was distributed<br />\nthe honor fraternity, presiding.<br />\nfirst<br />\nThe<br />\nperiod.<br />\nWith the Jays leading<br />\noutstanding performances on<br />\nby Francis Warlow, Student CounDr. John C. French, librarian of<br />\n4-0, \"Henny\" Beehler quickly got the Jay team were those of Captain<br />\ncil head, to learn the views of the<br />\nthe University, will be the principal<br />\nthe<br />\nface-off and made a perfect pass Lockard and Dorman. Each was a<br />\nstudents on particularly the quesspeaker. A member of 0. D. K.<br />\ntion of assemblies at the Hopkins. Dr. Joseph S. Ames Announces Awards for the Next to Jack Turnbull. The latter in- double winner; Lockard in the since its establishment here, Dr.<br />\nstantly tore down along the side- dashes and Dorman in the discus<br />\n150 Suspended<br />\nFrench was one of the leading figAcademic Year; Peabody Scholarship<br />\nline while Beehler was dashing and shot. Quirk also amassed ten ures<br />\nSeveral weeks ago the student<br />\nin the organization of the Hopstraight for Swarthmore's goal.<br />\npoints toward the Jay total by win- kins<br />\nOne of Those Presented<br />\ngoverning body suspended 150<br />\nchapter, the second in the<br />\nBefore the Maroon defense could ning the pole vault, tying for first country.<br />\nfreshmen and sophomores for failIt was<br />\nget set, both Jay men were down in in the high jump, and placing third tends to speak learned that he inure to attend what is said to be comof the early days of<br />\nSeven<br />\nnew<br />\nscholars<br />\nfellows<br />\nand<br />\nsity a gift amounting to $6,000.<br />\nfront of Swarthmore's goal. The in the javelin.<br />\npulsory weekly assemblies. This<br />\nthe<br />\nfraternity<br />\nhere.<br />\nIn the dashes and two-mile run<br />\nrest was a mere formality.<br />\nHeld For Endowment<br />\nWholesale three-day suspension re- in the graduate schools have been<br />\nLockard will give an account of<br />\nThe sum is held and used as the<br />\nHopkins made clean sweeps of all the recent national<br />\nFlips Ball To Beehler<br />\nceived publicity in all the local chosen for 1931-32 and four were<br />\n0. D. K. conpapers and brought protestations reappointed, Dr. Joseph S. Ames, endowment of a Peabody ScholarTurnbull flipped the ball to the places. Though Gettysburg vention at the University of Kenpresident<br />\nof the Johns Hopkins ship in the Department of Educafrom faculty members at the UniBeehler, who immediately made a took six firsts and Hopkins but tucky, Lexington, Ky., it was<br />\nUniversity, yesterday announced.<br />\ntion of the Faculty of Philosophy. perfect heave that<br />\nversity.<br />\nDavies, Maroon eight, the Jays took all but three learned.<br />\nNew Appointments Made<br />\nThe scholarship, open to men and goalie, had no<br />\nseconds, and all but one third. It<br />\nDr. E. W. Berry, dean, upheld<br />\nchance<br />\nIn the evening, the formal, closed<br />\nto stop.<br />\nNew appointments made were women who are residents of the<br />\nthe action taken by the Council and<br />\nAnother outstanding shot was was through the points derived initiation will take place in Levering<br />\nMiss Evelyn Madge, Peabody southern and southeastern States,<br />\nfrom these results that the victory Hall, after which a party<br />\ndeclared that he would consider Scholar; Dr. Maurice<br />\nwill be<br />\nChazin, Ro- is offered to candidates who intend made by Don Kelly. Amid a mass was made so<br />\nany changes, relative to student mance<br />\noverwhelming.<br />\nSwarthmor<br />\nof<br />\nheld in honor of the new members.<br />\ne<br />\ndefense<br />\nmen,<br />\nhe<br />\nLanguage department, to continue work in education. The<br />\nMeetings, which the body may Henry E. Johnston, Jr.,<br />\nReynolds Places Third<br />\nin the Dynamic Room of the Belleaped high in the air, caught a poor<br />\nScholar; stipend is $400.<br />\nadvocate.<br />\npass<br />\nReynolds,<br />\nhis<br />\nleft<br />\nto<br />\nside,<br />\nand<br />\nplacing<br />\nwith<br />\nhis<br />\nthird<br />\nin both vedere Hotel.<br />\nHenry G. Burke, Warren B. HuntWas Founded In 1899<br />\nViews Aired At Forum<br />\ndashes;<br />\nback<br />\nto<br />\nthe<br />\ngoal<br />\n\"Vic\"<br />\nthe<br />\nJay<br />\nFrenkil,<br />\nattack<br />\nman<br />\nwith<br />\na third<br />\ning Memorial Scholar; Miss Mary<br />\nFounded in 1899, the Rayner<br />\nConsidering it the best plan, the<br />\nin the \"440,\" and Lewis, tying for More Absenc<br />\nshoved in a perfect shot.<br />\nMcGhee,<br />\nCharles<br />\nA.<br />\nW.<br />\nVogeler<br />\nFellowship<br />\nwas<br />\ndonated<br />\ne Leaves<br />\nby<br />\nMrs.<br />\n'natter was brought by the Council<br />\nThe Jay defense, on the other first in the two-mile, were the outbefore the students at an open- Fellow; Robert F. Pitts, Adam T. Bertha Rayner Frank and Albert hand, had very<br />\nGranted By Trustees<br />\nlittle opportunity to standing freshmen performers.<br />\nBruce Fellow; Miss Gladys Hollo- W. Rayner, of Baltimore, to perforum assembly held March 19.<br />\ndisplay<br />\nwares.<br />\nits<br />\nMost<br />\nResults:<br />\nof<br />\nthe<br />\nbatway, Cornelia G. Harcum Scholar; petuate at the Hopkins the name of<br />\nDr. Malone Will Study At British<br />\n120-Yard High Hurdles (16.6 sec.)—<br />\nOpinions were aired on the desir- and<br />\nMuseum; Dr. Blondheim To<br />\nLewis F. Ball, Slack Scholar. their father, William S. Rayner, tle was carried on by the offense. First, Schwartz,<br />\nG.;<br />\nsecond,<br />\nPerry,<br />\nH.;<br />\nability, form, attendance at, and<br />\nCoburn, H.<br />\nWork On Volume<br />\nDr. Urry Renamed<br />\nwho had made unusual attainments In fact, during the second half the third,<br />\n100-Yard Dash (10.4 sec.) —First,<br />\nfrequency of assemblies.<br />\nAdditional<br />\nleaves of absence have<br />\nDr. William D. Urry, department in the Hebrew language and was second and third defense men did Lockard, H.; second, Linck,<br />\nH.; third,<br />\nReynolds,<br />\nWarlow, at the time, declared the of chemistry, has been reappointe interested<br />\nin the promotion of not even participate in any of the One MileH. Run (4 min. 58.2 sec.)— been granted by the Board of Trusd<br />\nMeetings would be abolished if the the Henry E. Johnston Scholar. In Semitic<br />\nmaneuverings of the team's attack. First, Gardiner, G.; second, Jung, H.; tees of the Johns Hopkins Universtudies.<br />\nthird, Milstone, H.<br />\nquestionnaire results depicted this the graduate geology department,<br />\nsity.<br />\nInstead, Lang and Kneip spent 440-Yard Dash<br />\nThe gift amounts to $10,000.<br />\n(54.6 sec.) — First,<br />\nDr. Kemp Malone, professor of<br />\ndesire of the students. It is indi- Dr. R. E. Collins has been reap- The Academic Council confers the remainder of the afternoon Chassin, H.; second, Schildknecht<br />\n, G.;<br />\nV. Frenkil, H.<br />\ncated now that assemblies will con- pointed James Buchanan Johnston upon an advanced student in the basking in the balmy spring air third,<br />\nTwo-Mile Run (11 min. 46.0 sec.)— English philology, during the month<br />\nFirst, Hancock and Lewis, H. (tie) ; of October, 1931, will<br />\ntinue and that plans for next year Scholar. Others reappointed for Semitic languages department.<br />\ncontinue his<br />\nwith the other defense men. Con- third, Mele,<br />\nH.<br />\n220-Yard Low Hurdles (26.2 sec.)— research work at the British Muare under way.<br />\nthe next academic year were Fredsequently,<br />\nSwarthmor<br />\ne<br />\nhad<br />\ntwo<br />\nex- First, Schwartz, G.; second, Wilfson,<br />\n$10,000 Donored In 1910<br />\nH.; seum.<br />\nerick A. Bayler, William L. RayTen thousand dollars was don- tra players on its defense. But to third, Perry, H.<br />\n880-Yard Run (2 min. 13 sec.)—First,<br />\nDuring his leave of absence, Dr.<br />\nElected To Institute<br />\nner Fellow; Richard M. Haywood, ored by Mrs. Edmund Law Rogers no avail. The Jay offense had the Gardiner,<br />\nG.; second, Verlin, H.; third,<br />\nDavid<br />\nT. Blondheim, professor of<br />\n, Dr. Raymond Pearl, professor of Edmund Law Rogers Fellow.<br />\nH.<br />\nand her daughter, Mu. Kirby ball in its possession constantly; ZePP,<br />\n220-Yard Dash (23.0 sec.) — First, Romance Philology,<br />\nolology, Schools of Medicine and<br />\nwill throughThe George Peabody Scholarship Flower Smith in memory of the and although it did not score, it did Lockard,<br />\nH.; second, Linck, H.; third,<br />\nout the next academic year complete<br />\nReynolds, H.<br />\nPublic Health and Hygiene, was was founded in 1912 by the Trus- late E. L. Rogers, of Baltimore. It give an example of the power<br />\nit has High Jump (5 feet 3% Inches)—Tie the second volume<br />\nelected a member in the Institut In- tees of the Peabody Education is awarded for proficiency in both by retaining<br />\nof the edition of<br />\nfor first, Caldwell and Quirk, H.; third,<br />\nthe ball.<br />\nHardy, G.<br />\n\"Gloses Francaises de Raschi?\" in<br />\nternational de Statistique, of Paris. Fund, who presented the Univer(Continue! on page 4, col. 3)<br />\n(Continued on page 3, col. 5)<br />\n(Continued on page 3, col. 2)<br />\nParis, it was learned.<br />\n<br />\nTRUSTEES DECREE<br />\n<br />\nTHREE PROFESSORS<br />\nPROMOTED BY BOARD<br />\n<br />\nTHIRD JAY CONQUEST<br />\nHOPKINS TRACKSTERS<br />\nWON FROM MAROON 11-0 CONQUER GETTYSBURG<br />\n<br />\nSeven Scholars, Fellows Chosen;<br />\nFour Others Get Reappointment<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 14, 1931<br />\n<br />\n2<br />\n<br />\nTHE NEWS-LETTER<br />\nFounded 1897<br />\n<br />\na poor team, if well supported, will<br />\noftentimes play much better than it is<br />\nordinarily able to play.<br />\nTherefore we feel that the return of<br />\nthe Freshman regulations next year,<br />\nwhich include the compulsory attendance of freshmen at all games, would<br />\nbe a very wise move and that it would<br />\nbe extremely beneficial to all concerned.<br />\nDuring the past year the frosh have<br />\nbeen very lax in their attendance of<br />\nthe games and when they did come,<br />\nonly a few sat in the cheering section<br />\nand lent their voices to the cheering.<br />\nWith the return of freshman regulations, the teams would at least be assured of the support of the first year<br />\nmen and their attendance would set<br />\nthe example for others to come out.<br />\n<br />\nINTERCOLLEGIATE<br />\nNEWS<br />\n<br />\nHEREDITY, ENVIRONMENT<br />\nMAIL BAG<br />\nTWINS; SAYS JENNINGS He Is Disturbed Over The Capitallstc<br />\nEconomic Order<br />\n<br />\nHopkins Zoologist Claims Two 'Editor of the NEWS-LETTER:<br />\nStudents at the University of<br />\nFactors Work Together In<br />\nDear Sir—<br />\n$2.00<br />\nSubscription<br />\nCalifornia have formed a club for<br />\nThe numerous surveys on curShaping Man's Character<br />\nthe study of Esperanto, the interrent condition which have been<br />\nEntered as second-class matter Decemnational language.<br />\nHeredity and environment, the making their appearance recently<br />\nber 3, 1909, at the Postoffice in Baltimore, Md., under the Act of Congress Notwo giants who are supposed to do<br />\nvember 3, 1879.<br />\nof man's are extremely valuable in the fact<br />\nShades of Leap Year! The daily battle for the control<br />\nmod- that they portray the actualities of<br />\nnew,<br />\nthe<br />\nin<br />\nshown<br />\nare<br />\ndestiny,<br />\nyoung ladies at the University of ern role of \"twins\", working side a time in which economic forces<br />\nPublished semi-weekly from October to<br />\nJune by the Students of Johns Hopkins<br />\nColorado are at last asserting their by side in the moulding of man, by have been working havoc on inefUniversity.<br />\nrights. The Mortar Board tea Dr. H. S. Jennings, professor of fective and unsuspecting men and<br />\ndance, reports the \"Silver and Zoology at the Johns Hopkins Uni- women. The facts are out! Not<br />\nBusiness communications should be ad\"Nature and<br />\nJohns<br />\nManager,<br />\ndressed to the Business<br />\nGold\" university paper, will be versity in an article,<br />\nHopkins University. All articles should<br />\nin the that they have been unknown preappears<br />\nwhich<br />\nNurture\",<br />\nbe sent to the Managing Editor; other<br />\ncompletely under the control of the April issue of the Survey Graphic viously, but that the public mind<br />\ncommunications to the Editor-in-Chief.<br />\nco-eds. They will do the inviting of magazine.<br />\nhas never before been pelted with<br />\n\"An automobile, a radio set, a such a voluminous excretion of<br />\nthe \"eligibles,\" will foot all the<br />\nBelmont 8778<br />\nTelephone<br />\nbills, and do all the \"cutting in.\" working contrivance of any kind, well-intentioned commentaries. But<br />\nin every detail of its conThe stag line will be formed by the depends<br />\nand operation on the ma- when the cards are on the table and<br />\nstruction<br />\nEDITORIAL DEPARTMENT<br />\nwomen and it will be up to the un- terials of which it is made—every the eyebrows upturned, what does<br />\nGood Work<br />\nfortunate males to sit on the side- detail can be made better or worse one see emanating from these overEditor-in-Chief<br />\nIt was announced last Friday that lines and try to vamp someone to by change of materials. But every earnest progressices, these quasi-inRowland McD. Ness, '32<br />\nthe University treasurer, S. Page Nel- dance with him. Perhaps, in this detail depends, too, on the methods tellectuals and vituperous liberals?<br />\nManaging Editor<br />\nof manufacture and can be made<br />\nson, has been instructed by the Board way, the men will learn a little of better or worse by changing the One is the object of a refrain someSylvan Lebow, '32<br />\nof Trustees to withdraw from sale the the joys and evils of persistent cut- processes to which the materials are what as follows:<br />\nAssistant Managing Editors<br />\ntract of land northwest of the athletic ting. And maybe the girls will take subjected,\" says Dr. Jennings.<br />\n\"We must have national planHerbert L. Friedberg, '33<br />\nTrue of Humans<br />\nHyman Levin, '34<br />\nfield and bounded by University Park- the chance to get back at the opponing; we must have a juster system<br />\n\"These things are true, too, of<br />\ntheir<br />\nDrive.<br />\nover<br />\nall<br />\nwalking<br />\nPark<br />\nby<br />\nsex<br />\nWyman's<br />\nsite<br />\nand<br />\nway<br />\nAssociate Editors<br />\nthose working contrivances that we of personal-income distribution;<br />\nof<br />\nmove<br />\nthis<br />\nfeet!<br />\nsupport<br />\nHarold B. Yudkin, '32<br />\nWe heartily<br />\ncall living thingz ; they are true of we must have a reorganization of<br />\nNathan M. Harris, '32<br />\nthat<br />\nfeel<br />\nand<br />\nhuman beings. Every feature, every political forms in order 'to insure<br />\nthe Board of Trustees<br />\non the success of the democratic printhe<br />\nto<br />\nJunior Editors<br />\nthis land will be very useful<br />\nWhen the University of Califor- quality that they show depends<br />\nthey are made,<br />\nwhich<br />\nmaterials<br />\nthe<br />\nMarion Grove, '33; Sanford Sarney,<br />\nUniversity in years to come.<br />\nnia raced on Lake Carnegie at the materials that come to them ciple; we must strengthen and en'34; Jerome Blum, '34; Stanley Stillman,<br />\n'33; Raymond Dunn, '33; Donald Proctor,<br />\nPrinceton last June, the crew's from their parents; every feature large the scope of our educational<br />\n'33; Harry Goodman, '33; Jack Greena small and wily coyote. can be altered by change of these activities; we must direct our effield, '33; Harold Kuslovitz, '34; Samuel Let There Be A Royal Bull mascot,<br />\nmaterials. This is the influence of forts towards international cooperaM. Doctofskey, '34; Norman Heaney, '34;<br />\nThe following editorial appeaerd in escaped into the surrounding ter_Mordecai Edelman, '34; Marlowe Perry,<br />\n'nature', of 'heredity'. But all their tion along social, political and<br />\nuntold<br />\ndoing<br />\nbeen<br />\nhas<br />\nand<br />\nritory<br />\n•a recent issue of the Purdue Exponent,<br />\n'32; Bernard Verlin, '33.<br />\nfeatures and qualities can be altered economic lines; in short, we must<br />\ncampus publication of the Purdue Uni- damage in his foraging activities likewise by changing the treatment<br />\nbring into the world<br />\nBUSINESS DEPARTMENT<br />\nagainst chickens and rabbits.<br />\nof this material; by changing the endeavor to<br />\nversity:<br />\nwhich will<br />\ninstrumentalities<br />\nthe<br />\neduby<br />\ntraining,<br />\nlife;<br />\nconditions of<br />\nAlthough Purdue University is one<br />\nBusiness Manager<br />\nthe rule<br />\nliving<br />\nby<br />\nChrist-like<br />\nNo<br />\nreal<br />\nmake<br />\nexperience;<br />\n'nurture'.<br />\ncation,<br />\nGus Burk, '31<br />\nA student at the University of<br />\nof the leading institutions of its kind<br />\nis due exclusively to rather than the exception. What?<br />\ncharacteristic<br />\nAdvertising Manager<br />\nin the country, there are certain Chicago was recently fined $100 for nature, to heredity; none exclusiveDavid Sykes, '32<br />\nYou say Socialism means all these<br />\nphases of life about the University throwing a piece of pie at a girl ly to nurture, to environment. All things? Oh, but we must, of all<br />\nCirculation Manager<br />\nGeorge W. La Mont, '32<br />\nwhich seem both childish and auto- who refused to kiss him after he are produced by the interaction of<br />\nheredity and environment, and can these things, preserve the capitalistic<br />\ncratic. When a person gets to col- had purchased a boquet of forget- be altered by suitable changes in system. Woe unto him who even<br />\nOffice Manager<br />\nlege, he is old enough to realize that me-nots from her.<br />\nIsadore C. Gutman, '32<br />\neither\".<br />\nsuggests Socialism! The capitalistic<br />\nCharles Ney, '33; Wm. N. Myers, '33;<br />\nwhat he makes of himself there is up<br />\nDr. Jennings tells of studies on system is indeed a God-given<br />\nMorton Rome, '33; Maurice R. Chassin,<br />\nAt the University of Kansas a \"identical twins\", which he calls thing. Thou shalt not disturb it in<br />\nto him, and do or say what he will,<br />\n'33; George Landau, '34; Wilson Rutherford, '31; Abram Burk, '34; Victor<br />\nchange<br />\nsurvey showed that only 7 keys \"to the relative roles of nature any manner whatsoever or thou<br />\nto<br />\nrecent<br />\ngoing<br />\nnot<br />\nis<br />\ninstructor<br />\nan<br />\nFrenkil, '34; Edgar Blumstein, '34; David<br />\nand nurture in the characters and<br />\na man unless he gets at the man from of the 1,705 women students plan destiny of human being, which are shalt be eternally damned.\"<br />\nGutman,'34; George Baylin, '31; Leonard<br />\nHarris, '34.<br />\nto be home-makers. 879 of the experiments performed for us by<br />\nthe right angle.<br />\nJackson Lee.<br />\nothers aim at a teaching career, and nature to give us an insight into the<br />\nand<br />\nThere are certain instructors<br />\nProduced by the R. L. Polk Printing Co.,<br />\nrelative influence of identity of maHOPKINS FINISHES 5th<br />\nprofessors here who feel it their duty 90 are aspiring journalists.<br />\n1930 Clifton Ave., Baltimore, Md.<br />\nand diversity of environterial<br />\nrifle<br />\nAt the intercollegiate<br />\nto watch over their students much as<br />\nment\". The zoologist speculates on matches held at Annapolis recently,<br />\na hen watches over her chicks. They<br />\nSeventy per cent of the English a world composed of identical twins<br />\nHopkins finished in fifth place.<br />\nrefuse to allow a person a bit of free- speaking people of the world live and his conclusions is said to make Eleven colleges participated.<br />\ndom. This matter is most noticeable on the North American Continent, interesting reading.<br />\nHe concludes his article with a<br />\nas regards cuts and unexcused ab- and sixty per cent of them in the<br />\nof practical application<br />\ndiscussion<br />\nsences from class. Granted that a United States.<br />\nof knowledge of heredity and enSupport Needed<br />\nperson should feel that he is to atvironment to the improvement of<br />\nsociety and advocates that<br />\nhuman<br />\nIt was very noticeable at the la- tend a large portion of his scheduled<br />\nand<br />\nThe Universities of Oxford<br />\npull\" point of view be<br />\n\"long<br />\nthe<br />\nafternoon<br />\nmust<br />\nhe<br />\nlast<br />\nSaturday<br />\ncrosse game<br />\nclasses, there are times when<br />\nCambridge frequently meet in taken in the solution of the probthat the student body of the Univer- be away, perhaps on business that he<br />\nmarble tournaments.<br />\nlem.<br />\nsity is giving the Jay athletic teams feels need not merit an excuse.<br />\nlittle or no support. The crowd lacked<br />\nOffhand, there are two ways of<br />\nthe enthusiasm that usually attends looking at the proposition. If a stuAND,<br />\nWhile giving a startling per- Posts For R.0. T. C.<br />\nsuch athletic competition and the dent is up with the average in his<br />\nMen Are Announced<br />\ncheers that were given would hardly class, and wishes to take a period off, formance, a magician spread a<br />\nTHE<br />\nhave been audible on the other side he should be allowed to do so. Of blanket over a newspaper and proSix Weeks Period To Be From<br />\nthe<br />\nread<br />\npaper<br />\nto<br />\nthrough<br />\nceeded<br />\nof the field.<br />\ncourse, this applies to laboratory and<br />\nJune 12 To July 23;<br />\nThe students have made it known drafting classes more than to recita- the heavy woolen cloth. All co-eds<br />\n1,549 To Attend<br />\nto the public at large in many differ- tions. So long as a man keeps up his at the show got up and walked out.<br />\nent ways that they do not desire the work, he is not hurting himself, and<br />\nIt was announced last Friday at<br />\ndiscontinuance of intercollegiate ath- surely he is not hurting the instructor,<br />\n\"How to Keep Well When the headquarters of the Third<br />\nletic competition. This being the case, who is there to guide and not to<br />\nwe do not see why all the undergrad- guard. Then, too, if a man wishes to Traveling in the Tropics,\" is the Corps Area that all students in the<br />\nuates, and as many of the graduates do a bit of outside work on the sub- title of a new course offered by the advanced course of the Reserve<br />\n171-AVE<br />\nas can, do not come out and give their ject, instead of in class, he will get University of California.<br />\nNy.:41 be reOfficers' Training Corps.tr.<br />\nOPPOSITE<br />\nwhole-hearted support to the teams.<br />\nas much out of it as if he were to<br />\nquired to attend the summer trainPENNA.R.R.STATION<br />\nWe do not advocate that the Jay remain cooped up in the classroom<br />\ncamps during the six weeks'<br />\ning<br />\nsupporters assume a \"rah-rah\" spirit all period.<br />\nAccording to the Nebraska EngNaturally, there can be a limit to lish Department, the word \"It,\" be- period between June 12 and July<br />\nthat exists in some colleges, but we do<br />\nfeel that they should lend their sup- which this theory should be followed. sides having the Clara Bow con- 23.<br />\nOne instructor never says a word<br />\nStudents from the infantry, enport to the teams.<br />\nnection, has been found to possess<br />\na<br />\non<br />\nrelying<br />\nmerely<br />\nabsences,<br />\nabout<br />\ngineers' division and the medical<br />\nThis lack of spirit has been evident<br />\nIf the latter feels three other meanings. The first<br />\nat Hopkins all during the year. The man's judgment.<br />\npredominate<br />\nof the class, \"it\" is commonly used to denote a corps are expected to<br />\nfootball eleven, swimming team, bas- that he can do better out<br />\nthe fact is \"big shot\" or important person. The in the attendance but nearly all the<br />\nketball quint, and now the lacrosse he is free to do so. And<br />\nhim. Conversely,<br />\nbranches of the service will be reptwelve have gotten very little support. not held against<br />\nstu- second \"it\" still has the hide-and- resented in the total of 1,549 stua<br />\nthat<br />\nfeel<br />\nwho<br />\nthose<br />\nare<br />\nthere<br />\ndurgames<br />\nAt many of the basketball<br />\nevery minute, go-seek and tag connection. While dents who are expected to attend<br />\ning the winter one could hardly find dent should be present<br />\nextenuating circumstances the third one refers to a stupid pera handful of enthusiastic Hopkins with no<br />\nthe nine army posts during the six<br />\nallow a bit of freedom. son as \"such as it.\"<br />\nwould<br />\nwhich<br />\nrooters.<br />\nweeks' period.<br />\nPerhaps a mixture of the two would<br />\nWe realize, of course, that some of produce the better result. At least,<br />\nNine Posts In All<br />\nour teams during the past few seasons students are not prisoners. They have<br />\nThe posts at which the R. 0. T.<br />\nIce golf is the title of the new<br />\nhave not been championship groups their fate in their own hands. They<br />\ngame now being played by Harvard C. camps will be conducted are as<br />\nand we might say that it wasn't very should know when they can miss a<br />\nfollows: Fort George G. Meade,<br />\ninteresting to come to one game after class and not lose out for the men. It is played somewhat similar<br />\nto present day golf except that the Three Hundred and Ninety-Ninth<br />\nanother and see the team go down in semester.<br />\nfrozen Charles River at Cambridge Infantry and Sixteenth Signal<br />\ndefeat.<br />\nperabove,<br />\nlisted<br />\nobservations<br />\nThe<br />\nadmit<br />\nCorps; Aberdeen Proving Ground,<br />\nOn the other hand, one must<br />\nis used as the course.<br />\nthat the players do not get any par- haps, do not apply to Hopkins in<br />\nOrdinance; Edgewood<br />\nEightieth<br />\nticular amount of enjoyment out of their fullest extent. However, the fact<br />\nChemical,<br />\nNinety-First<br />\nArsenal,<br />\ntheir defeats—however they keep right that many professors still hold to a<br />\nUrban University, with an en- Warfare Service; Fort Hoyle, Sixprovision<br />\npuerile<br />\non and do their best, and win or lose narrow-minded,<br />\nA pre-eminent Hotel of 1200<br />\nrollment of 29 students, leads all<br />\nthey give all they have to help the while others entertain a liberal atti- other higher educational institu- ty-Third Field Artillery; Fort<br />\ntude in the matter only tends to<br />\nHunt, Va., Thirty-Ninth Infantry; Rooms, each having Bath,<br />\nteam to win.<br />\nthe<br />\nbody.<br />\nstudent<br />\nof<br />\nthe<br />\nsize<br />\nin<br />\ntions<br />\nthe<br />\nPerhaps,<br />\nanomaly.<br />\nthe<br />\nheighten<br />\nvidor, Circulating Ice<br />\nIf the rooters would take this same<br />\nFort Humphreys, Two Hundred Ser,<br />\nattitude and back up the efforts of the difficulty lies in the fact that Hopkins,<br />\nand many other innoFort<br />\nWater<br />\nEngineers;<br />\nTwentieth<br />\nand<br />\nplayers, the results might be more the notoriously, loudly and almost<br />\nSecond<br />\nand<br />\nvations ...featuring a sincere<br />\nAccording to the Washington Elm Monroe, Two Hundred<br />\nfavorable. A team, no matter how flagrantly liberal college is really only<br />\na recent survey at University of Coast Artillery Corps; Fort Myer,<br />\ngood it is, if unsupported, in time fifty percent liberal.<br />\nspirit of hospitality.<br />\nAt all events the situation could be Virginia showed that 99 per cent Thirty-Second Cavalry; Carlisle<br />\nloses a certain amount of interest in<br />\ntheir work and has no driving power easily remedied by a royal bull emanat- of the men wore four-in-hand ties, Barracks, Two Hundred and Ninebehind it to encourage it to forge ing either from the throne room in and 50 per cent of the ties were tieth Medical, Forty-Fourth Vet- 'ROOM AND BATH $3UP<br />\nahead and attempt new and bigger Remsen Hall or the antechamber in<br />\nsolid in color, with blue prevailing. erinary and Seventy-Third Dental.<br />\nthings. Whereas, on the other hand, Latrobe Hall.<br />\n<br />\nEDITORIALS<br />\n<br />\nPhone Belmont 7908<br />\n<br />\nBirely's Pharmacy<br />\nST. PAUL at 33rd STREET<br />\nYour Neighborhood Drug Store<br />\n<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br />\nMahe Our Store Your Store<br />\n<br />\nPatronize<br />\nOnr<br />\nAdvertisers<br />\nSeeking a Position?<br />\nWe are receiving inquiries daily for<br />\nteachers<br />\nTHE BALTIMORE TEACHERS<br />\nAGENCY<br />\nWilliam K. Yocum, Manager<br />\nTitle Annex Bldg.<br />\nPlaza 1195<br />\nBaltimore, Md.<br />\n<br />\nBACON'S<br />\nDrug Store<br />\nSt. Paul and 31st Streets<br />\nSPECIALIZES<br />\nIn Accommodating<br />\nHopkins Students<br />\n<br />\nFor Better Cleaning and<br />\nDyeing<br />\n<br />\nFRIED'S<br />\n101 E. 21st St.<br />\n<br />\nBelmont 5501<br />\n<br />\n42 out of 54<br />\ncolleges choose<br />\nthis FAVORITE<br />\npipe tobacco<br />\n<br />\n$1.COME<br />\n'ro<br />\n<br />\nNEVCSfORIK<br />\n<br />\nMOTEL<br />\nGIVERNOR and Yale agrees<br />\nCLINTON<br />\nthe windows of<br />\n[31 ST7<br />\nr Harknessatto find out what<br />\nOK UP<br />\n<br />\nthe Yale man smokes.In the springtime you'll see him sitting in his<br />\nwindow seat with a pipeful of<br />\nEdgeworth between his teeth.<br />\nOn Chapel Street...out at the<br />\nBowl...everywhere the Yale man<br />\ngoes, his pipe and Edgeworth go<br />\nwith him. And at 42 out of 54 of<br />\nthe leading colleges and universities<br />\nEdgeworth is the favorite tobacco.<br />\nA tobacco must be good to win<br />\nthe vote of so many discriminating<br />\nsmokers. And Edgeworth is good.<br />\nToconvince yourselftryEdgeworth.<br />\nYou can get it wherever tobacco is<br />\nsold...15¢ a tin. Or,for a generotL<br />\nfree sample, write to Larus & Bro.<br />\nCo., 1o5 S. 22d St., Richmond,<br />\nVirginia.<br />\n<br />\nEDGEWORTH<br />\nSMOKING TOBACCO<br />\nEdgeworth is a blend<br />\nof fine old burleys,<br />\nwith its natural savor<br />\nenhanced by Edgeworth's distinctive<br />\neleventh process.<br />\nBuy Edgeworth anywhere i n two forms<br />\n—\"Ready-Rubbed\"<br />\nand \"Plug Slice.\" All<br />\nsizes, 150 pocket<br />\npackage to pound<br />\nhumidor tin.<br />\n<br />\n\f9<br />\n7.<br />\n<br />\n3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 14, 1931<br />\n<br />\nTHOMAS IS PRINCIPAL Paganism, Christianity, Dreamy<br />\nSPEAKER AT CONCLAVE Will Be Lecture Topics<br />\nSocialist Leader Addresses<br />\nLiberals On Socialization<br />\n250 ATTEND SESSIONS<br />\n<br />\nDr. Guglielmo Ferrero, Noted Historian Will Present Schouler Lecture, April 23, In Latrobe Hall<br />\n<br />\nHopkins Lacrossemen<br />\nHypnotics Cackle<br />\nDefeat Swarthmore<br />\nAt Psych Class Seance<br />\n<br />\nDr. Roy M. Dorcus Directs Students In Hypnotic Trances<br />\nTo Perform Weird Tasks Involuntarily<br />\n\"Paganism and Christianity\" will<br />\nbe the topic of a lecture to be<br />\nNo Casualties Reported<br />\n<br />\npresented by Dr. Guglielmo FerreSeidman Chosen Representa- ro, noted historian, under the James<br />\nSchouler Lectureship, April 23. The<br />\ntive To National Council<br />\naddress is to be delivered at 5 P.<br />\nM., Latrobe Hall, room 120. The<br />\nClaiming that the prevalent eco- lecture is open to the public.<br />\nnomic system is in the \"throes of<br />\nDr. A. M. Bartholdy, of the Unideath,\" Norman Thomas, Socialist versity of Hamburg, was the latest<br />\nleader, advocated socialization as a Schouler lecturer at the University<br />\ncure for unemployment, in his ad- this academic year. He spoke, in a<br />\ndress before the third annual Lib- series of five talks, on African soveral Club conference, held in Lever- ereignties.<br />\ning Hall last Saturday under the<br />\nauspices of the Johns Hopkins University Liberal Club. He spoke at Jay Trackmen Defeat<br />\n1<br />\n2<br />\nGettysburg,79/<br />\n1<br />\n2-46/<br />\nthe evening session.<br />\nCorporation Control Blamed<br />\n<br />\nThat socialization would adopt<br />\nlabor-saving devices for use and not<br />\nfor profit, was the statement of the<br />\nSocialist leader. Corporation control over the adoption of inventions,<br />\nhe pointed out, is a basic cause of<br />\nthe present crisis.<br />\nAttended by approximately two<br />\nhundred and fifty students and liberals representing more than fifteen<br />\ncolleges and many sections of the<br />\ncountry, the conference lasted all<br />\n•day Saturday. Four sessions were<br />\nheld, and a total of eight speakers<br />\npresented their views to the group.<br />\nDelegations were present from Vassar College, Columbia, St. John's,<br />\nVirginia State College, Hood College, Goucher, University of Baltimore, George Washington University, University of Maryland, and<br />\nseveral other colleges and universities.<br />\nCauses, Consequences Topics<br />\nThe morning session of the conference was devoted to theories of<br />\nthe causes of unemployment. Dr.<br />\nGeorge Barnett, Charles Ervin, and<br />\nDr. Harry Laidler spoke at this<br />\ntime. In the afternoon sessions,<br />\nMiss Anna Ward and Jay Lovestone spoke on the consequences of<br />\nunemployment, while discussion<br />\ngroups under the direction of four<br />\nmembers of the Hopkins Liberal<br />\n<br />\nis a phenomenon that was known to<br />\nthe ancients, but owing to its use<br />\nfor nefarious purposes has fallen<br />\ninto the disrepute from which it<br />\nsuffers today.<br />\nIts therapeutic<br />\nvalue has often been demonstrated,<br />\nbut it is not generally used as a<br />\ntherapeutic agent owing to the instinctive distrust of patients for a<br />\nphenomenon so little understood,<br />\nand distantly smacking of the occult.<br />\nLittle or nothing is known of the<br />\ncause of the hypnosis (experts<br />\nsay) but it has been supposed by<br />\nmany writers to be a form of sleep<br />\nHopkins Team Takes Discus and together with hyper-sensitivity to<br />\nTwo Mile Run In Meet<br />\nsuggestion. Some individuals show<br />\nSaturday<br />\ngreater affinity for suggestion<br />\na<br />\n(Continued from page 1, col. 5)<br />\nis declared, with neuBroad Jump (20 feet 914 inches)— than others it<br />\nFirst, Schwartz, G.; second, Hardy, 0.; rotic patients leading the list. This<br />\nthird, Wilfson, H.<br />\nPole ault (11 feet)—First, Quirk, H.; quality is arbitrarily called \"sugsecond, Gifford, 0.; third, Bittinger, H., gestibility\".<br />\nand Simon, G.<br />\n<br />\nJavelin (171 feet)—First, Schwartz,<br />\n0.; second, Burke, H.; third, Quirk, H.<br />\nDiscus (117 feet)—First, Dorman, H.;<br />\nsecond, Schwartz, G.; third, Kutcher, H.<br />\nShot Put (38 feet)—First, Dorman,<br />\nH.; second, Azar, G.; third, Kutcher, H.<br />\n<br />\n4)<br />\nEasy competition of this sort may<br />\ngive the Hopkins team a chance to<br />\npile up points, but it does not offer<br />\nthe team, as a whole, much opportunity to prepare for the strong contests later in the season.<br />\nThe attack is undoubtedly strong,<br />\nbut the defense has had little opportunity to display its ability.<br />\nFritz Stude, Jay goalie, has not had<br />\none eventful afternoon. In fact, he<br />\nonly had to stop about a half a<br />\ndozen shots, all of which he blocked<br />\nin a beautiful style.<br />\nInstead of proving an advantage<br />\nto the team, these easy games are<br />\nreally a hindrance. Stronger competition will prove the best test.<br />\n(Continued from page<br />\n<br />\nConsent of Subject Necessary<br />\n<br />\nThree stages, Lethargy, Catalepsy and Somnambulism are noticed in a hypnosis, and there are<br />\nvarious means of putting a subject<br />\nfrom one stage into the other, professors say. Usually the consent of<br />\nany normal individual, it was explained, must be gotten before he<br />\nmay be hypnotized, for by his own<br />\nefforts, a fatigue of one of the<br />\nsenses (usually conversion strabismus of the eye) is a necessary<br />\nprelude to the state.<br />\nAnd now, if you spy a somewhat<br />\nserious-looking college man firmly<br />\nadmonishing either his kid sister,<br />\nbrother or girl friend that they are<br />\na bear, llama, or Cleopatra respectively,—that, gentle reader is not a<br />\ncase for Fipps Clinic . . . no . . .<br />\nmerely a scientific demonstration of<br />\nhypnotism.<br />\n<br />\nFreshmen Lose Debate Hopkins Arguers Meet<br />\nTo City College Trio Hood College Tonight<br />\n<br />\nClub occupied the second division<br />\nof the afternoon.<br />\nAt the evening session, broadcast through the courtesy of station WCBM, of Baltimore, Dr.<br />\nIsador Lubin, and Rabbi Dr. Edward Israel also discussed remedies<br />\nof unemployment. A discussion, in<br />\nwhich Jay Lovestone and Mr.<br />\nThomas held an impromptu debate<br />\nfollowed the regular speeches.<br />\n<br />\nIn a debate on the question, Resolved: That the United States<br />\nEnter the League of Nations, held<br />\nlast Friday at City College, between<br />\nthe City College team and the<br />\nFreshman team of Hopkins, Hopkins lost the decision by a vote of<br />\n2 to 1. Hopkins was represented<br />\nby Saul Dorfman, S. M. Doctofskey and Charles Stern, rebuttal.<br />\nThis is the third year that the<br />\nSeidman Named Representative<br />\nFrosh have met defeat at the hands<br />\nJoel Seidman, past president of of the City College forensics.<br />\nthe Liberal Club, was reelected representative to the national student<br />\ncouncil of liberal groups affiliated<br />\nRIFLEMEN TO ELECT<br />\nwith the League for Industrial<br />\nOfficers for the Rifle Club will be<br />\nDemocracy, in a special meeting held elected today at 12.30 P. M., at a<br />\nfor that purpose. He will act as meeting of that organization, to be<br />\nrepresentative of all liberal clubs held in the south loft of Gilman<br />\nwithin the district including Mary- Hall.<br />\nJ. C. Handy, president, requests<br />\nland, the District of Columbia, and<br />\nVirginia, and will hold the position the presence of all members at the<br />\nmeeting.<br />\nof division chairman.<br />\n<br />\n11<br />\n<br />\nDon't<br />\nwait until Crank<br />\nCase Dilution_<br />\ncauses burnedout bearings to<br />\nlearn that<br />\n<br />\nAMOCONGAS<br />\nmieil<br />\n<br />\nOxford Honors System To Be Debated; Affirmative Upheld By<br />\nHopkins Speakers<br />\n<br />\nDebaters representing Hood College and the Johns Hopkins University will meet tonight at Frederick, Md., in a debate on Resolved,<br />\nThat Colleges of the United States<br />\nAdopt the Oxford System of Calling for Honors.<br />\nHopkins, who will uphold the<br />\naffirmative to the question, will be<br />\nrepresented by Llewellyn Stanton,<br />\nJerome Blum, and William F.<br />\nStark.<br />\n<br />\nMembers Florists Telegraph Delivery Association<br />\n<br />\n1, col.<br />\n<br />\nHopkins<br />\nSwarthmore<br />\nStude<br />\nDavies<br />\nBernard<br />\nPerry<br />\nWeitzel<br />\nC. P<br />\nMahon<br />\nNess<br />\nP. D<br />\nKeefer<br />\nKneipp<br />\nS. D<br />\nRushmore<br />\nLang<br />\nT. D<br />\nDouglas<br />\nBeeler<br />\nWilliams<br />\nGuild<br />\nT. A<br />\nJoyce<br />\nStone<br />\nS. A<br />\nJones<br />\nD. Kelly<br />\nF. A<br />\nPike<br />\n0. H<br />\nTurnbull<br />\nMcVaugh<br />\nDarrell<br />\nI. H<br />\nHarlan<br />\nHopkins<br />\n8 3-11<br />\nSwarthmore<br />\n0 0— 0<br />\nSubstitutions: Hopkins—Dukehart for<br />\nStone, Cockey for Beeler, C. Kelly for<br />\nGuild, Triplett for Turnbull, Cone for<br />\nKneipp, Hudert for Cone. Swarthmore—<br />\nSonneman for Joyce, Crowl for Harlan,<br />\nBaker for Rushmore, Skinner for Parry,<br />\nParry for Mahon.<br />\nGoals—Lang, Darrel (3), Kelly (2),<br />\nKneipp, Beeler (2), Turnbull, Guild. Referee—R. V. Truitt. Judge of play—W.<br />\nC. Wylie. Goal umpires—S. Crosthwaite<br />\nand E. Smith.<br />\n<br />\n000<br />\n<br />\ndi<br />\n<br />\nFLORISTS<br />\nAND<br />\nDECORATORS<br />\n1918 N. Charles St., near 20th<br />\nPhone: Vernon 0573<br />\n<br />\nJ. H. FURST CO.<br />\nPRINTERS OF<br />\n<br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 Hopkins Place, Baltimore<br />\n<br />\nBelmont 8040-8041<br />\n<br />\nPARISIAN TAILORING<br />\nCOMPANY<br />\nCleaning, Dyeing, Pressing<br />\nRepairing<br />\n346 E. 33rd STREET<br />\nCor. University Parkway<br />\n<br />\nOPERATE IT YOURSELF<br />\n<br />\nRENT A CAR<br />\n<br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br />\n<br />\nLOUIS SULSKY<br />\nSnappy<br />\nNew<br />\nEvening Clothes<br />\nto Rent<br />\n<br />\nDeposit Not Required<br />\n<br />\n111 W NORTH AVE.<br />\n<br />\n2125 HARFORD AVE.<br />\n<br />\n313 W. FRANKLIN ST.<br />\nPhone, VErnon 3436<br />\n<br />\nPhone, Wolfe 1413<br />\n<br />\nThe crime wave, too,<br />\nstrikes a breakwater<br />\nPolice Radio is \"joining the force\" in many a city—acting as a break-<br />\n<br />\nwater in checking the surge of criminal activity...The apparatus the<br />\n<br />\nAn alarm! Headradios it<br />\nto cruising cars.<br />\n<br />\npolice are using comes out of the telephone workshop. It is logical that<br />\n<br />\nquarters<br />\n<br />\nWestern Electric should make the equipment, drawing on a fifty-year<br />\n<br />\nexperience as manufacturer of telephones for the Bell System...Serv-<br />\n<br />\ning this vast organization is a huge responsibility. Carrying it out means<br />\n<br />\nThis engineer's<br />\n\"precinct\" is a<br />\nlaboratory.<br />\n<br />\nkeeping an open mind on new methods of manufacture,new sources oft<br />\n<br />\nsupply, new channels of distribution. It means welcoming and taking<br />\n<br />\nAmoco-Gas gives better, allaround performance than....<br />\nyou've ever known and it;<br />\nCOSTS LESS PER MILE!<br />\n97\"k AMERICAN OIL COMPANY<br />\nAlhbued rah Paso Amurnce• Pflroleuen•Tramp.,tampon,<br />\n<br />\nGeneral 01fiers: American tilde , Baltimore. Md.<br />\n<br />\nCaught—because<br />\nthe radio saved<br />\nprecious minutes.<br />\n<br />\nfull advantage of every worth-while aid that modern science offers.<br />\n<br />\nWestern Electric<br />\nManufacturers...Purchasers...Distributors<br />\nIIINCIC lillt FOR<br />\n<br />\nTHR BILLL SYSTZM<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 14, 1931<br />\n<br />\nSeven Scholars, Fellows Chosen;<br />\nFour Others Get Reappointment<br />\n<br />\nThe Makin's<br />\nof a<br />\n<br />\nDr. Joseph S. Ames Announces Awards for the Next<br />\nAcademic Year; Peabody Scholarship<br />\nOne of Those Presented<br />\n<br />\nGood Sport<br />\nby \"Bill\" Triplett<br />\n<br />\n(Continued from page 1, column 3)<br />\n<br />\nFor wearin' on the green, loafin' on the sidelines, strollin' on the campus, or just puttin'<br />\non because you like their snappy sportiness—<br />\nBill Triplett has a line of Hess sport shoes at<br />\nthe Barn that'll make you sit up and take<br />\nnotice. Entirely new ideas developed by<br />\n<br />\nN. HESS' SONS<br />\n8 Baltimore Street, East<br />\n<br />\nWe Sell Drugs and Give Service<br />\nCall us up Belmont 5318, 5846<br />\n<br />\nPeabody Pharmacy<br />\nCalvert and 30th Streets<br />\n<br />\nPhones VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\nTHE RELIABLE WEAVING Co.<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br />\n<br />\nDECORATIONS<br />\n<br />\nINTERIOR WOOD WORK<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\nFactory<br />\n600 S. Pulaski<br />\n<br />\nStreet<br />\n<br />\nGreek and Latin languages and literature.<br />\nDecember, 1925, the Trustees received from Mrs. George B. Hunting $5,000 for the foundation of a<br />\nscholarship fund in honor of her<br />\nson, Warren B. Hunting. Students<br />\nin the political science department<br />\nof the graduate school are eligible<br />\nfor the scholarship which amounts<br />\nto $250 annually.<br />\nTogeler Bequeathed $5,000<br />\nCharles A. W. Vogeler, alumnus<br />\nof the Hopkins, who died March<br />\n21, 1919, bequeathed $5,000 to the<br />\nTrustees to be used as a fellowship<br />\nin Greek archaeology.<br />\nOn the recommendation of the<br />\nzoology department, the Academic<br />\nCouncil awards the A. T. Bruce<br />\nFellowship for research in biology<br />\nat a place approved by Dr. Ames.<br />\nThe mother of Dr. Bruce, fellow<br />\nand instructor at the University,<br />\nfounded the fellowship in 1887.<br />\nUsed For Archaeology Students<br />\nA bequest of approximately $5,000 annually by Cornelia G. Harcum, student in the archaeological<br />\ndepartment, has been used by the<br />\ntrustees as a scholarship open to<br />\nwomen students in Classical archaeology.<br />\n<br />\nENTRIES DUE TONIGHT<br />\nFOR 2 LITERARY MEETS<br />\nContestants Must File Entries<br />\nBefore Midnight With<br />\nCharles Ney<br />\n<br />\nMILESTONE SYSTEM<br />\nDRIVE IT YOURSELF<br />\n<br />\nNo Deposit Required of Hopkins Students<br />\nBuick,<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br />\n<br />\n....... .<br />\n<br />\nCoupes<br />\nRoadsters<br />\nSedans<br />\n<br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles St.<br />\nVernon 4049<br />\n<br />\nPLaza 6000<br />\n<br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br />\n<br />\nBaltimore Concedes Milestone Supremacy<br />\n<br />\nWhen in 'New York dine at<br />\n<br />\nSt. Regis Restaurants<br />\nLocated at<br />\n<br />\n1491 Bdwy at 41st St.<br />\n1400 Bdwy at 42nd St.<br />\n1500 Bdwy (Cadillac)<br />\n1570 Bdwy. at 47th St.<br />\n1627 Bdwy. at 50th St.<br />\n<br />\nSelf Service Stores<br />\n145 W. 42nd St.<br />\n210 W. 42nd St.<br />\n410 Leington Ave.<br />\n(Grand Central Terminal)<br />\n<br />\nEntries for the Adams declamation and the De Tocqueville lecture<br />\ncontests at the Johns Hopkins must<br />\nbe filed before midnight today with<br />\nCharles Ney, of the Rochester<br />\nApartments, Linden avenue. Topics<br />\nin the respective literary meets must<br />\nbe submitted together with entries.<br />\nSophs Eligible In Adams Meet<br />\nAll undergraduates are eligible<br />\nfor the De Tocqueville contest;<br />\nsophomores, for the Adams competition. Speeches are to be limited<br />\nto six minutes.<br />\nAmerican prose selections of the<br />\ntwentieth century, with the exception of those dealing with political<br />\nproblems, will be acceptable in the<br />\ndeclamation contest, tryouts for<br />\nwhich are to be held Thursday in<br />\nLevering Hall, Room B, 11:30<br />\nA. M.<br />\nTryouts Saturday<br />\nFor the De Tocqueville contest<br />\ncontestants must deliver a lecture in<br />\nEnglish on any phase of French<br />\nhistory of the present and nineteenth centuries. Tryouts are scheduled for Saturday, 1 P. M., Leverino- Hall, Room B.<br />\nbFour speakers in each event will<br />\nbe chosen.<br />\n<br />\nDR. McCOLLUM SPEAKS<br />\n<br />\nF. Y. I.<br />\nmeans<br />\n\"For<br />\nYour<br />\nInformation\"<br />\n<br />\nF. Y. I.<br />\nYou read, of course, but how do you select your<br />\nreading? The entire booktrade is co-operating in<br />\nthe publication of a newsy, up-to-date magazine<br />\nthat will keep you posted. Would you like us to<br />\nsend it to you with our compliments?<br />\n<br />\nNorman Remington Co.<br />\n347 N. Charles St.<br />\nBaltimore, Md.<br />\n<br />\nSurely! I want to know what's<br />\ngoing on. Send your magazine<br />\nmonthly. No obligation, of<br />\ncourse.<br />\n<br />\nChemical Hygiene Professor Addresses Medical Society On Mineral's Effects<br />\nThe part played in human growth<br />\nand health by minerals in food that<br />\nhumans eat was discussed Monday<br />\nnight before the semi-annual meeting of the Baltimore City Medical<br />\nSociety by Dr. Elmer V. McCollum, professor of chemical hygiene<br />\nat the J. H. U. School of Hygiene<br />\nand Public Health.<br />\nAn internationally known authority on nutrition, Dr. McCollum,<br />\nhas for several years been experimenting to determine the physiological importance of certain<br />\nminerals found in the body and in<br />\nnormal diet.<br />\n<br />\nPreference is given in awarding<br />\nthe Ella E. Slack Scholarship, to<br />\ngraduate students in those subjects<br />\nof study in connection with which<br />\nthere is no other endowed scholarship or fellowship. It was established by the late Mrs. Ella E.<br />\nSlack, who died November 4, 1923.<br />\nThe endowment was $6,730.<br />\nFounded Three Scholarships<br />\nMrs. Harriet Lane Johnston, of<br />\nWashington, formerly of this city,<br />\nin memory of her husband and two<br />\nsons, founded the three Johnston<br />\nscholarships in 1904. They are<br />\nawarded annually by the trustees<br />\nto men and women who have given<br />\nevidence of the power of independent research and who expect to<br />\ndevote themselves to research in<br />\ntheir chosen subjects.<br />\nThe stipend is $1,500 annually.<br />\nTo Hold Cabaret<br />\nA cabaret party, which was an<br />\noutstanding success of 1930 June<br />\nWeek, according to Yellott, will<br />\nbe again held in Levering Hall.<br />\nMusic will be furnished by T.<br />\nWorth Murphy's Belvedere Band.<br />\nGuy Lombardo and his Royal<br />\nCanadians will furnish the music<br />\nat the Senior Ball.<br />\nNOTICE<br />\nCoach Hambleton is extremely<br />\nanxious that all men having been<br />\n\"working out\" on the track attend<br />\nthe practices this week. This applies particularly to the \"Junior<br />\nVarsity\" men, who are to engage<br />\nthe team from \"Poly\" on Friday.<br />\nThis Jay \\Tee-Poly meet is a yearly<br />\naffair and proves to be very interesting aside from providing experience for the younger men.<br />\n<br />\nST. REGIS<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br />\n<br />\nBEER<br />\nUndergraduate suffering from a perforated<br />\nduodenum and generally sensitive digestive system<br />\nwould like to secure connections with a conscientious<br />\nbootlegger handling only virgin beer.<br />\nSo-called college-boy concoctions such as \"spiked\"<br />\nnear beer and corrupted Coca Cola will not satisfy.<br />\nPlease communicate with advertiser if you can<br />\nname the whereabouts of real<br />\n<br />\nBEER<br />\nApply Box 304, Johns Hopkins Post Office<br />\n<br />\nJust try them•••<br />\nthen leave them-if you can<br />\nto find out just<br />\nwhat the new Humidor Pack<br />\ndoes for Camel smokers is to<br />\n<br />\njust quit Camels if you can.<br />\nRemember, it's dust-dry ciga-<br />\n<br />\nswitch over to this famous<br />\n<br />\nof their natural moisture by<br />\nevaporation or scorching that<br />\n<br />\nTHE BEST WAY<br />\n<br />\nbrand for an entire day. After<br />\nyou have tasted the Camel<br />\n<br />\nrettes that have been robbed<br />\n<br />\nblend of choicest Turkish and<br />\nmellowest Domestic tobaccos<br />\n<br />\nsting the tongue and burn the<br />\nthroat. There are none of these<br />\ndiscomforts with Camels. Try<br />\n<br />\nkept in prime fresh condition,<br />\n<br />\nthem and see for yourself.<br />\nR. J. REYNOLDS TOBACCO CO.<br />\nWinston-Salem, N. C.<br />\n<br />\nCAMELS<br />\n<br />\nMedal Awarded Pfund<br />\nFor Reading Paper<br />\nOn Power<br />\nIn recognition of his paper on<br />\n\"Hiding Power Measurements in<br />\nTheory and Applications\", Dr.<br />\nA. H. Pfund, professor of physics at the Hopkins, was awarded the Charles B. Dudley Medal<br />\nby the American Society for<br />\nTesting Materials, of Philadelphia.<br />\nEffectiveness of paints in concealing on what they are spread<br />\nis discussed in the paper. This<br />\nstudy is said to be of great importance in the commercial industry.<br />\n<br />\nFactory-fresh CAMELS<br />\nare air-sealed in the new<br />\nSanitary Package which<br />\nkeeps the dust and germs<br />\nout and keeps the flavor in.<br />\n01931, R. J. Reynold. Tahoe. Company<br />\n<br />\n\f", "format": "basic_html", "processed": "NEWS-LETTER<br /><br />\nJOHN DU VAL,<br /><br />\nEDITORIAL STAFF<br />\nMEETING IN OFFICE<br /><br />\nSINGS IN MIDDAY<br />\nMUSICALE TODAY<br /><br />\nToday, 12:30 P. M.<br /><br />\nLevering Hall<br /><br />\nVol. XXXV, No. 44<br /><br />\nTHE JOHNS HOPKINS UNIVERSITY, HOMEWOOD,BALTIMORE, MD., APRIL 14, 1931<br /><br />\nPrice 5 Cents<br /><br />\nrd And Blade<br />\nMAJORITY FAVORS Scabba<br />\nElects 13 Members SECOND PARLEY ON Dreamy Hypnotics Cackle<br />\nASSEMBLIES, FROSH<br />\nSCHAAL DISMISSAL<br />\nAt Psych Class Seance HOMEWOOD TRACT<br />\nRULES, VOTE SHOWS<br />\nSET FOR TOMORROW Dr. Roy M. Dorcus Directs Students In Hypnotic Trances NOT TO BE SOLD<br />\nFormal Pledging Of Electees Will Be<br />\nHeld Soon At Military<br />\nSociety Banquet<br /><br />\nTo Perform Weird Tasks Involuntarily<br />\nFollowing its annual custom, the<br />\nStudent Council Questionnaire Scabbard and Blade, national hon- Executive Boards Still At Odds<br />\nNo Casualties Reported<br />\norary military society, elected 13<br />\nReveals 204 Want ContinOn Ousting Of J. H. U.<br />\nnew members from among R. 0.<br />\nHen cackling, philanthropy, feats<br />\nHens Approve Crowing<br />\nuance Of Assemblies<br />\nSecretary<br />\nT. C. cadet officers. These were, in<br />\nof unbelievable physical prowess<br />\nOne hypnotee, genuinely conthe order named: Rowland, Ness,<br />\nand every conceivable form of par- vinced (as a result of a past-hyp- Move Is Result Of Appeal<br />\n219 ASK FOR RETURN<br />\nJames Witherill, Peter Weisengoff, FRIENDS WILL FIGHT<br />\nlor stunt were exhibited recently by notic suggestion) that he was a<br />\nMade By Professors<br />\nOF FROSH REGULATIONS Oscar Helm, Kenneth Sharretts and<br />\nANY ADVERSE RESULT the hypnotic subjects of Professor rooster whose sacred duty it was to<br />\nTo Willard<br />\nWestcott Hill, all top-sergeants.<br />\nRoy M. Dorcus, in his class in Ab- crow at 9.30 when Dr. Dorcus<br />\nMajority, 246 Of 292, Prefer Charles Doeller, Marlowe Perry, First Conference Decided That normal Psychology.<br />\nwould snap his finger thrice to sym- DECLARED OTHER BOARDS<br />\nInterested Visitors Attend<br />\nRonald Brooke, Graham Wood, Both Boards Would Share<br />\nbolize the \"rosy-fingered dawn\", HAD RUED SALE OF LAND<br />\nHor*rw Svctem To Faculty<br />\nThe experiments in hypnosis did so and then resumed his seat<br />\nWilliam Cox, Jr., Gale Shreve and<br />\nSurveillance, Shown<br />\nIn Nominations<br />\nproved a lodestone to hordes of in- with an air of. a task well per- Trustee Board Had Planned<br />\nAlbert Johnson.<br />\nterested visitors, mostly skeptics, formed. The crowing was so exThe Scabbard and Blade was<br />\nProperty Sale To Make<br />\nTomorrow the second conference who though they came to sneer<br />\nContinuance of assemblies and<br />\nre- tremely well done that genuine Y.<br />\nfounded at Hopkins in 1915. Chap- of the<br />\nUp Deficit<br />\nMetropolitan Board of the mained to fear. However, aside M. C. A. hens<br />\nthe reestablishment of freshmen ters have<br />\nestablished in all the downtown<br />\nin the vicinity of<br />\nbeen<br />\nbranch of the Y. M. C. from the violent expulsion of a few Levering Hall<br />\nregulations at the Johns Hopkins leading universities<br />\nS. Page Nelson, treasurer of<br />\nwere<br />\nhaving R. 0. A. and the Board<br />\nUniversity is favored by the major- T. C. units, order<br />\nof Managers of individuals from the room by a up and take notice. reported to sit the Johns<br />\nin<br />\nto<br />\nappropriate<br />\nHopkins University, has<br />\nthe<br />\nHopkins branch will be held at<br />\nity of the undergraduates, the tab- ly recognize outstandin<br />\nbeen requested by the Board of<br />\nUnemployment Address Lucrative<br />\ng military Levering Hall, or at the Metropoli- hypnotee, no casualties were reulation of answers to the recent ability among<br />\nported.<br />\nRequested to deliver an address Trustees to withdraw from sale the<br />\ncadet officers, one- tan office, for further discussion<br />\nof<br />\nquestionaire distributed by the Stu- third of<br />\nPresents Amusing Appearance<br />\non unemployment, the subject did tract of land northwest of the athwhom are eligible for mem- the dismissal of E. A. Schaal by the<br />\nA. hypnotic subject presents a so with much gusto. His<br />\ndent Council at Homewood. re- bership.<br />\naddress— letic field and bounded by Univerformer body.<br />\nrather amusing appearance, eyes somewhat conservative was<br />\nvealed yesterday.<br />\nFormal pledging of these men<br />\nreward- sity Parkway and Wymans' Park<br />\nWhether Mr. Schaal, secretary closed or nearly so, lethargic, and ed with a<br />\n204 Want Assemblies<br />\nshower<br />\nof<br />\nnickels<br />\nwill<br />\nbe<br />\nheld<br />\nand Drive, at Homewood, it was learned<br />\nbanquet<br />\nsoon<br />\nto<br />\nat<br />\na<br />\nof the Johns Hopkins branch of the speaking in a low uncanny voice small<br />\nOf the 292 students who filled<br />\nchange<br />\nwhen<br />\nat<br />\nthe<br />\nwhich<br />\nDr.<br />\nsugges- yesterday.<br />\nJoseph S. Ames and Dr. Y. M. C. A. will be reappointed to that<br />\nout the query blanks, 204 advocated<br />\nis almost sepulchral.<br />\ntion of the operator he circulated a<br />\nResult Of Appeal<br />\nEdward<br />\nW.<br />\nBerry<br />\nhave<br />\ninbeen<br />\nthe position he now holds at Homethe continuance of assemblies here,<br />\nHis will entirely under the con- derby among the observers.<br />\nThis move is said to be the result<br />\nvited.<br />\nAlwood,<br />\nor not, has not yet been de- trol of the operator, and the subject though the collection<br />\nand 219 asked for the return of<br />\nwas for the of an appeal made by twelve memcided upon by the Metropolitan has no sense of the ridiculous. If a poor and<br />\nfreshmen regulations on the campus<br />\nneedy, the subject pocket- bers of the faculty to Daniel WilBoard. It is expected by Y. M. C. subject is told he is a donkey or a ed the lucre<br />\n. for the next academic year.<br />\n. . . ostensibly because lard, trustees' head, to abandon the<br />\nA. officials that a definite decision member of the Student Council, he he was<br />\nOne hundred and two underplan to sell the 331-foot plot of<br />\npoor and needy.<br />\nwill be reached following tomor- believes both implicitly, and acts<br />\ngraduates declared themselves as<br />\nAttempts by subjects to sell land.<br />\nrow's conference.<br />\naccordingly.<br />\npreferring the plan whereby attendThey declared before Mr. Wilbooks, dismember innocent bystandMay Produce Anesthesia<br />\nWill Not Stop Fight<br />\nance at assemblies would be com- Dr. Frederick C. Lane Apers who (they had been told) had lard that other universities which<br />\nComplete anesthesia may be pro- cast<br />\nIt is believed that the Y. M. C. A.<br />\nhad shown similar lack of foresight<br />\npulsory throughout the year for<br />\naspersions<br />\npointed History Associate<br />\nleaders at the Hopkins will not give duced so that if a subject is told and attempts on their moral life, in planning their<br />\nfreshmen. As advised by the Counto<br />\ncampuses were<br />\nwrite<br />\nsentences<br />\nup the fight for retaining Schaal, that a match held under his hand from which<br />\nlater forced to buy land at doubled<br />\ncil, this plan provides for weekly<br />\nthe<br />\nconsonants<br />\nhad<br />\nstudent meetings during October WAS BACKED BY COUNCIL even if the decision reached at this will have no effect. 'Much to the been omitted were a few of the prices to accommodate their buildconference is adverse to Schaal. amusement of the audience, the other mental<br />\nand November to orient the first<br />\ngyrations performed ings.<br />\nA.<br />\n0.<br />\nShould the decision be adverse to subjects also strained at mythical for the<br />\nBabendrei<br />\ner,<br />\nHubF.<br />\nT.<br />\nCampus Would Be Hemmed In<br />\nyear men; then, subsequent monthdelectation of the audience<br />\nSchaal, the \"Y\" leaders here, it is weights, described vividly yari-col- and the good<br />\nSale<br />\nbard Are Made Associates<br />\nof the land would probably<br />\nly assemblies for the two under<br />\nof science.<br />\nbelieved, will probably make a drive ored animals and violently ejected<br />\nresult in the hemming in of the<br />\nAnimal Magnetism<br />\nclasses.<br />\nThree promotions were made by to arouse student opinion on the spectators to whom the operator<br />\nHypnotism, formerly known as campus by apartment buildings,<br />\nOpinions 'Vary<br />\nseemed for any reason to take ob- Animal Magnetism and<br />\nStudent opinion varied on the the Board of Trustees in the fac- matter.<br />\nMesmerism they said.<br />\nDr. Joseph<br />\nAmes, president of jection.<br />\nIt was also charged that a gradmatter of freshman attendance. ulty for 1931-32.<br />\n(Continued on page 3, col. 3.<br />\nual \"nibbling away\" of Homewood<br />\nOnly 34 favored compulsory atDr. Frederick Chapin Lane, in- the University called the first conproperty first started with the sale<br />\ntendance for frosh throughout the structor in history, has been pro- ference of the two boards about a<br />\nof less valuable land had finally reyear—during the first semester, moted to associate in history. He month ago in an effort to clear up<br />\nsulted in the ceding of several<br />\nweekly meetings; during the sec- was recommended to the position the misunderstanding which had<br />\narisen regarding the scope of auchoice acres to Baltimore City for<br />\nond, monthly. Thirty-five want as- by the Academic Council.<br />\nthority of both bodies in the selecan art museum.<br />\nsemblies but no compulsory attendBabendreier, Hubbard Named<br />\ntion of the campus \"Y\" branch sec- Lacrosse Attack Reels Off Goal 791<br />\n/<br />\n2 to 461<br />\nAt the time that the property was<br />\n/<br />\n2 Is Final Score Of<br />\nance for either freshmen or sophoA. 0. Babendreier, instructor in<br />\nAfter Goal<br />\noffered for sale, it was announced<br />\nTest<br />\nmores during the second semester. drawing, has been named associate retary. It was mutually agreed at<br />\nthat the funds to be derived from<br />\nTwenty-eight students advocate no in drawing, and T. F. Hubbard, in- this conference that each board was<br />\nDEFENSE LITTLE USED<br />\nENEMY CAPTAIN STARS such a transaction were needed to<br />\ncompulsion whatever. Twenty-eight structor in civil engineering, asso- to have the privilege of nominating<br />\nmake up a deficit in the University<br />\ndesire either weekly or monthly ciate. Both men were recommend- anyone for the position, but that<br />\nboth boards must agree upon a sin- Stronger Competition Deemed Jay Team Take<br />\ntreasury.<br />\nreveals,<br />\nballot<br />\nmeetings,<br />\nthe<br />\nstudent<br />\nDashes And<br />\ned for promotions by the advisory gle man.<br />\nProfessors In Move<br />\nNecessary For Stickmen<br />\n2-Mile Run<br />\nwithout compulsory attendance.<br />\nhoard of the School of EngineerAsked To Resign<br />\nProfessors<br />\nin the move were: K.<br />\nWeekly<br />\nMeets<br />\nDesire<br />\n87<br />\ning.<br />\nR.<br />\nLast<br />\nGreenfield,<br />\nJuly<br />\nMr.<br />\nSchaal<br />\nwas<br />\nasked<br />\nEighty -seven undergraduates<br />\nLast Saturday the Johns HopDisplaying marked power in the R. D. Havens, F. R. Murnaghan,<br />\nDr. Lane, who was educated at to resign by the Metropolitan<br />\nTenney Frank, S. 0.<br />\nspecified that they want weekly or Harvard<br />\nUniversity, became a Board, but he refused, saying he kins lacrosse squad conquered dashes and field events, the Jay Mast, Knight Dunlap, A. 0. Lovemonthly assemblies with stringent, member<br />\nSwarthmor<br />\nCollege<br />\ne<br />\nthe<br />\noverby<br />\ntracksters<br />\ndefeated the team of joy, E. W. Berry, Broadus<br />\nof the faculty here in 1928. would resign only to the Hopkins<br />\nMitcompulsory attendance by all first- Dr. Kent<br />\nR. Greenfield, professor Board. Hopkins officials support- whelming score of 11-0. The Black Gettysburg College in a meet last chell.<br />\nyear students.<br />\nand Blue team continued to display Saturday by the score of 791/<br />\nof European history, it is said, re- ed him in his decision.<br />\n2 to<br />\nFavoring a nominal number of gards him as an invaluable<br />\nthe same brilliant form that it has 461/<br />\n2.<br />\nasset<br />\nto<br />\nconference<br />\nFollowing<br />\nthe<br />\nfirst<br />\n\"cuts\" from assemblies were 160 the history department both<br />\ndemonstrated in its past two vicIn only the broad jump were the 0. D. K. To Initiate<br />\nas a<br />\nstudents, the questionnaire tabula- research worker and undergraduate of a month ago, Mr. Schaal was tories.<br />\nPennsylvanians able to show any<br />\nAt Next Assembly<br />\nrecommended for reappointment<br />\ntion shows.<br />\nThe attack reeled off goal after marked supremacy. The work of<br />\ninstructor.<br />\nnext<br />\nyear<br />\nBoard.<br />\nby<br />\nHopkins<br />\nthe<br />\nPrefer Honor System<br />\nIn 1923 Mr. Babendreier was .No decision could be reached by the goal almost at will. At times the Schwartz, Gettysburg captain, was Dr. John C. French To Make Principal<br />\nAsked \"Do you want the Honor named to<br />\nthe teaching staff. Mr. downtown board, it is believed so Black and Blue teamwork was so the feature of the meet. Schwartz Address At Second Public InvitaSystem in preference to faculty Hubbard<br />\ntion of Fraternity<br />\nhas<br />\nbeen a member of the this second conference has been perfect in its scoring plays that the took both the hurdles, won the<br />\nsurveillance?\" 246 Hopkins men faculty<br />\nNext<br />\nThursday's<br />\ngoals<br />\nbroad<br />\nseemed<br />\nassembly will<br />\nsince 1925.<br />\njump and javelin, and placed<br />\ntoo simple to be real.<br />\ncalled.<br />\ndeclared they prefer the Honor<br />\nsecond to \"Bill\" Dorman in the be devoted to the second public iniOutstanding<br />\nEvent<br />\nOccurs<br />\nSystem. Only 46 would rather have<br />\ntiation of the Omicron Delta Kappa<br />\nThe most outstanding instance discus.<br />\nfaculty surveillance.<br />\nwith Edwin Lockard, president of<br />\nLockard, Dorman Star<br />\noccurred at about the middle of the<br />\nThe questionnaire was distributed<br />\nthe honor fraternity, presiding.<br />\nfirst<br />\nThe<br />\nperiod.<br />\nWith the Jays leading<br />\noutstanding performances on<br />\nby Francis Warlow, Student CounDr. John C. French, librarian of<br />\n4-0, \"Henny\" Beehler quickly got the Jay team were those of Captain<br />\ncil head, to learn the views of the<br />\nthe University, will be the principal<br />\nthe<br />\nface-off and made a perfect pass Lockard and Dorman. Each was a<br />\nstudents on particularly the quesspeaker. A member of 0. D. K.<br />\ntion of assemblies at the Hopkins. Dr. Joseph S. Ames Announces Awards for the Next to Jack Turnbull. The latter in- double winner; Lockard in the since its establishment here, Dr.<br />\nstantly tore down along the side- dashes and Dorman in the discus<br />\n150 Suspended<br />\nFrench was one of the leading figAcademic Year; Peabody Scholarship<br />\nline while Beehler was dashing and shot. Quirk also amassed ten ures<br />\nSeveral weeks ago the student<br />\nin the organization of the Hopstraight for Swarthmore's goal.<br />\npoints toward the Jay total by win- kins<br />\nOne of Those Presented<br />\ngoverning body suspended 150<br />\nchapter, the second in the<br />\nBefore the Maroon defense could ning the pole vault, tying for first country.<br />\nfreshmen and sophomores for failIt was<br />\nget set, both Jay men were down in in the high jump, and placing third tends to speak learned that he inure to attend what is said to be comof the early days of<br />\nSeven<br />\nnew<br />\nscholars<br />\nfellows<br />\nand<br />\nsity a gift amounting to $6,000.<br />\nfront of Swarthmore's goal. The in the javelin.<br />\npulsory weekly assemblies. This<br />\nthe<br />\nfraternity<br />\nhere.<br />\nIn the dashes and two-mile run<br />\nrest was a mere formality.<br />\nHeld For Endowment<br />\nWholesale three-day suspension re- in the graduate schools have been<br />\nLockard will give an account of<br />\nThe sum is held and used as the<br />\nHopkins made clean sweeps of all the recent national<br />\nFlips Ball To Beehler<br />\nceived publicity in all the local chosen for 1931-32 and four were<br />\n0. D. K. conpapers and brought protestations reappointed, Dr. Joseph S. Ames, endowment of a Peabody ScholarTurnbull flipped the ball to the places. Though Gettysburg vention at the University of Kenpresident<br />\nof the Johns Hopkins ship in the Department of Educafrom faculty members at the UniBeehler, who immediately made a took six firsts and Hopkins but tucky, Lexington, Ky., it was<br />\nUniversity, yesterday announced.<br />\ntion of the Faculty of Philosophy. perfect heave that<br />\nversity.<br />\nDavies, Maroon eight, the Jays took all but three learned.<br />\nNew Appointments Made<br />\nThe scholarship, open to men and goalie, had no<br />\nseconds, and all but one third. It<br />\nDr. E. W. Berry, dean, upheld<br />\nchance<br />\nIn the evening, the formal, closed<br />\nto stop.<br />\nNew appointments made were women who are residents of the<br />\nthe action taken by the Council and<br />\nAnother outstanding shot was was through the points derived initiation will take place in Levering<br />\nMiss Evelyn Madge, Peabody southern and southeastern States,<br />\nfrom these results that the victory Hall, after which a party<br />\ndeclared that he would consider Scholar; Dr. Maurice<br />\nwill be<br />\nChazin, Ro- is offered to candidates who intend made by Don Kelly. Amid a mass was made so<br />\nany changes, relative to student mance<br />\noverwhelming.<br />\nSwarthmor<br />\nof<br />\nheld in honor of the new members.<br />\ne<br />\ndefense<br />\nmen,<br />\nhe<br />\nLanguage department, to continue work in education. The<br />\nMeetings, which the body may Henry E. Johnston, Jr.,<br />\nReynolds Places Third<br />\nin the Dynamic Room of the Belleaped high in the air, caught a poor<br />\nScholar; stipend is $400.<br />\nadvocate.<br />\npass<br />\nReynolds,<br />\nhis<br />\nleft<br />\nto<br />\nside,<br />\nand<br />\nplacing<br />\nwith<br />\nhis<br />\nthird<br />\nin both vedere Hotel.<br />\nHenry G. Burke, Warren B. HuntWas Founded In 1899<br />\nViews Aired At Forum<br />\ndashes;<br />\nback<br />\nto<br />\nthe<br />\ngoal<br />\n\"Vic\"<br />\nthe<br />\nJay<br />\nFrenkil,<br />\nattack<br />\nman<br />\nwith<br />\na third<br />\ning Memorial Scholar; Miss Mary<br />\nFounded in 1899, the Rayner<br />\nConsidering it the best plan, the<br />\nin the \"440,\" and Lewis, tying for More Absenc<br />\nshoved in a perfect shot.<br />\nMcGhee,<br />\nCharles<br />\nA.<br />\nW.<br />\nVogeler<br />\nFellowship<br />\nwas<br />\ndonated<br />\ne Leaves<br />\nby<br />\nMrs.<br />\n'natter was brought by the Council<br />\nThe Jay defense, on the other first in the two-mile, were the outbefore the students at an open- Fellow; Robert F. Pitts, Adam T. Bertha Rayner Frank and Albert hand, had very<br />\nGranted By Trustees<br />\nlittle opportunity to standing freshmen performers.<br />\nBruce Fellow; Miss Gladys Hollo- W. Rayner, of Baltimore, to perforum assembly held March 19.<br />\ndisplay<br />\nwares.<br />\nits<br />\nMost<br />\nResults:<br />\nof<br />\nthe<br />\nbatway, Cornelia G. Harcum Scholar; petuate at the Hopkins the name of<br />\nDr. Malone Will Study At British<br />\n120-Yard High Hurdles (16.6 sec.)—<br />\nOpinions were aired on the desir- and<br />\nMuseum; Dr. Blondheim To<br />\nLewis F. Ball, Slack Scholar. their father, William S. Rayner, tle was carried on by the offense. First, Schwartz,<br />\nG.;<br />\nsecond,<br />\nPerry,<br />\nH.;<br />\nability, form, attendance at, and<br />\nCoburn, H.<br />\nWork On Volume<br />\nDr. Urry Renamed<br />\nwho had made unusual attainments In fact, during the second half the third,<br />\n100-Yard Dash (10.4 sec.) —First,<br />\nfrequency of assemblies.<br />\nAdditional<br />\nleaves of absence have<br />\nDr. William D. Urry, department in the Hebrew language and was second and third defense men did Lockard, H.; second, Linck,<br />\nH.; third,<br />\nReynolds,<br />\nWarlow, at the time, declared the of chemistry, has been reappointe interested<br />\nin the promotion of not even participate in any of the One MileH. Run (4 min. 58.2 sec.)— been granted by the Board of Trusd<br />\nMeetings would be abolished if the the Henry E. Johnston Scholar. In Semitic<br />\nmaneuverings of the team's attack. First, Gardiner, G.; second, Jung, H.; tees of the Johns Hopkins Universtudies.<br />\nthird, Milstone, H.<br />\nquestionnaire results depicted this the graduate geology department,<br />\nsity.<br />\nInstead, Lang and Kneip spent 440-Yard Dash<br />\nThe gift amounts to $10,000.<br />\n(54.6 sec.) — First,<br />\nDr. Kemp Malone, professor of<br />\ndesire of the students. It is indi- Dr. R. E. Collins has been reap- The Academic Council confers the remainder of the afternoon Chassin, H.; second, Schildknecht<br />\n, G.;<br />\nV. Frenkil, H.<br />\ncated now that assemblies will con- pointed James Buchanan Johnston upon an advanced student in the basking in the balmy spring air third,<br />\nTwo-Mile Run (11 min. 46.0 sec.)— English philology, during the month<br />\nFirst, Hancock and Lewis, H. (tie) ; of October, 1931, will<br />\ntinue and that plans for next year Scholar. Others reappointed for Semitic languages department.<br />\ncontinue his<br />\nwith the other defense men. Con- third, Mele,<br />\nH.<br />\n220-Yard Low Hurdles (26.2 sec.)— research work at the British Muare under way.<br />\nthe next academic year were Fredsequently,<br />\nSwarthmor<br />\ne<br />\nhad<br />\ntwo<br />\nex- First, Schwartz, G.; second, Wilfson,<br />\n$10,000 Donored In 1910<br />\nH.; seum.<br />\nerick A. Bayler, William L. RayTen thousand dollars was don- tra players on its defense. But to third, Perry, H.<br />\n880-Yard Run (2 min. 13 sec.)—First,<br />\nDuring his leave of absence, Dr.<br />\nElected To Institute<br />\nner Fellow; Richard M. Haywood, ored by Mrs. Edmund Law Rogers no avail. The Jay offense had the Gardiner,<br />\nG.; second, Verlin, H.; third,<br />\nDavid<br />\nT. Blondheim, professor of<br />\n, Dr. Raymond Pearl, professor of Edmund Law Rogers Fellow.<br />\nH.<br />\nand her daughter, Mu. Kirby ball in its possession constantly; ZePP,<br />\n220-Yard Dash (23.0 sec.) — First, Romance Philology,<br />\nolology, Schools of Medicine and<br />\nwill throughThe George Peabody Scholarship Flower Smith in memory of the and although it did not score, it did Lockard,<br />\nH.; second, Linck, H.; third,<br />\nout the next academic year complete<br />\nReynolds, H.<br />\nPublic Health and Hygiene, was was founded in 1912 by the Trus- late E. L. Rogers, of Baltimore. It give an example of the power<br />\nit has High Jump (5 feet 3% Inches)—Tie the second volume<br />\nelected a member in the Institut In- tees of the Peabody Education is awarded for proficiency in both by retaining<br />\nof the edition of<br />\nfor first, Caldwell and Quirk, H.; third,<br />\nthe ball.<br />\nHardy, G.<br />\n\"Gloses Francaises de Raschi?\" in<br />\nternational de Statistique, of Paris. Fund, who presented the Univer(Continue! on page 4, col. 3)<br />\n(Continued on page 3, col. 5)<br />\n(Continued on page 3, col. 2)<br />\nParis, it was learned.<br /><br />\nTRUSTEES DECREE<br /><br />\nTHREE PROFESSORS<br />\nPROMOTED BY BOARD<br /><br />\nTHIRD JAY CONQUEST<br />\nHOPKINS TRACKSTERS<br />\nWON FROM MAROON 11-0 CONQUER GETTYSBURG<br /><br />\nSeven Scholars, Fellows Chosen;<br />\nFour Others Get Reappointment<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 14, 1931<br /><br />\n2<br /><br />\nTHE NEWS-LETTER<br />\nFounded 1897<br /><br />\na poor team, if well supported, will<br />\noftentimes play much better than it is<br />\nordinarily able to play.<br />\nTherefore we feel that the return of<br />\nthe Freshman regulations next year,<br />\nwhich include the compulsory attendance of freshmen at all games, would<br />\nbe a very wise move and that it would<br />\nbe extremely beneficial to all concerned.<br />\nDuring the past year the frosh have<br />\nbeen very lax in their attendance of<br />\nthe games and when they did come,<br />\nonly a few sat in the cheering section<br />\nand lent their voices to the cheering.<br />\nWith the return of freshman regulations, the teams would at least be assured of the support of the first year<br />\nmen and their attendance would set<br />\nthe example for others to come out.<br /><br />\nINTERCOLLEGIATE<br />\nNEWS<br /><br />\nHEREDITY, ENVIRONMENT<br />\nMAIL BAG<br />\nTWINS; SAYS JENNINGS He Is Disturbed Over The Capitallstc<br />\nEconomic Order<br /><br />\nHopkins Zoologist Claims Two 'Editor of the NEWS-LETTER:<br />\nStudents at the University of<br />\nFactors Work Together In<br />\nDear Sir—<br />\n$2.00<br />\nSubscription<br />\nCalifornia have formed a club for<br />\nThe numerous surveys on curShaping Man's Character<br />\nthe study of Esperanto, the interrent condition which have been<br />\nEntered as second-class matter Decemnational language.<br />\nHeredity and environment, the making their appearance recently<br />\nber 3, 1909, at the Postoffice in Baltimore, Md., under the Act of Congress Notwo giants who are supposed to do<br />\nvember 3, 1879.<br />\nof man's are extremely valuable in the fact<br />\nShades of Leap Year! The daily battle for the control<br />\nmod- that they portray the actualities of<br />\nnew,<br />\nthe<br />\nin<br />\nshown<br />\nare<br />\ndestiny,<br />\nyoung ladies at the University of ern role of \"twins\", working side a time in which economic forces<br />\nPublished semi-weekly from October to<br />\nJune by the Students of Johns Hopkins<br />\nColorado are at last asserting their by side in the moulding of man, by have been working havoc on inefUniversity.<br />\nrights. The Mortar Board tea Dr. H. S. Jennings, professor of fective and unsuspecting men and<br />\ndance, reports the \"Silver and Zoology at the Johns Hopkins Uni- women. The facts are out! Not<br />\nBusiness communications should be ad\"Nature and<br />\nJohns<br />\nManager,<br />\ndressed to the Business<br />\nGold\" university paper, will be versity in an article,<br />\nHopkins University. All articles should<br />\nin the that they have been unknown preappears<br />\nwhich<br />\nNurture\",<br />\nbe sent to the Managing Editor; other<br />\ncompletely under the control of the April issue of the Survey Graphic viously, but that the public mind<br />\ncommunications to the Editor-in-Chief.<br />\nco-eds. They will do the inviting of magazine.<br />\nhas never before been pelted with<br />\n\"An automobile, a radio set, a such a voluminous excretion of<br />\nthe \"eligibles,\" will foot all the<br />\nBelmont 8778<br />\nTelephone<br />\nbills, and do all the \"cutting in.\" working contrivance of any kind, well-intentioned commentaries. But<br />\nin every detail of its conThe stag line will be formed by the depends<br />\nand operation on the ma- when the cards are on the table and<br />\nstruction<br />\nEDITORIAL DEPARTMENT<br />\nwomen and it will be up to the un- terials of which it is made—every the eyebrows upturned, what does<br />\nGood Work<br />\nfortunate males to sit on the side- detail can be made better or worse one see emanating from these overEditor-in-Chief<br />\nIt was announced last Friday that lines and try to vamp someone to by change of materials. But every earnest progressices, these quasi-inRowland McD. Ness, '32<br />\nthe University treasurer, S. Page Nel- dance with him. Perhaps, in this detail depends, too, on the methods tellectuals and vituperous liberals?<br />\nManaging Editor<br />\nof manufacture and can be made<br />\nson, has been instructed by the Board way, the men will learn a little of better or worse by changing the One is the object of a refrain someSylvan Lebow, '32<br />\nof Trustees to withdraw from sale the the joys and evils of persistent cut- processes to which the materials are what as follows:<br />\nAssistant Managing Editors<br />\ntract of land northwest of the athletic ting. And maybe the girls will take subjected,\" says Dr. Jennings.<br />\n\"We must have national planHerbert L. Friedberg, '33<br />\nTrue of Humans<br />\nHyman Levin, '34<br />\nfield and bounded by University Park- the chance to get back at the opponing; we must have a juster system<br />\n\"These things are true, too, of<br />\ntheir<br />\nDrive.<br />\nover<br />\nall<br />\nwalking<br />\nPark<br />\nby<br />\nsex<br />\nWyman's<br />\nsite<br />\nand<br />\nway<br />\nAssociate Editors<br />\nthose working contrivances that we of personal-income distribution;<br />\nof<br />\nmove<br />\nthis<br />\nfeet!<br />\nsupport<br />\nHarold B. Yudkin, '32<br />\nWe heartily<br />\ncall living thingz ; they are true of we must have a reorganization of<br />\nNathan M. Harris, '32<br />\nthat<br />\nfeel<br />\nand<br />\nhuman beings. Every feature, every political forms in order 'to insure<br />\nthe Board of Trustees<br />\non the success of the democratic printhe<br />\nto<br />\nJunior Editors<br />\nthis land will be very useful<br />\nWhen the University of Califor- quality that they show depends<br />\nthey are made,<br />\nwhich<br />\nmaterials<br />\nthe<br />\nMarion Grove, '33; Sanford Sarney,<br />\nUniversity in years to come.<br />\nnia raced on Lake Carnegie at the materials that come to them ciple; we must strengthen and en'34; Jerome Blum, '34; Stanley Stillman,<br />\n'33; Raymond Dunn, '33; Donald Proctor,<br />\nPrinceton last June, the crew's from their parents; every feature large the scope of our educational<br />\n'33; Harry Goodman, '33; Jack Greena small and wily coyote. can be altered by change of these activities; we must direct our effield, '33; Harold Kuslovitz, '34; Samuel Let There Be A Royal Bull mascot,<br />\nmaterials. This is the influence of forts towards international cooperaM. Doctofskey, '34; Norman Heaney, '34;<br />\nThe following editorial appeaerd in escaped into the surrounding ter_Mordecai Edelman, '34; Marlowe Perry,<br />\n'nature', of 'heredity'. But all their tion along social, political and<br />\nuntold<br />\ndoing<br />\nbeen<br />\nhas<br />\nand<br />\nritory<br />\n•a recent issue of the Purdue Exponent,<br />\n'32; Bernard Verlin, '33.<br />\nfeatures and qualities can be altered economic lines; in short, we must<br />\ncampus publication of the Purdue Uni- damage in his foraging activities likewise by changing the treatment<br />\nbring into the world<br />\nBUSINESS DEPARTMENT<br />\nagainst chickens and rabbits.<br />\nof this material; by changing the endeavor to<br />\nversity:<br />\nwhich will<br />\ninstrumentalities<br />\nthe<br />\neduby<br />\ntraining,<br />\nlife;<br />\nconditions of<br />\nAlthough Purdue University is one<br />\nBusiness Manager<br />\nthe rule<br />\nliving<br />\nby<br />\nChrist-like<br />\nNo<br />\nreal<br />\nmake<br />\nexperience;<br />\n'nurture'.<br />\ncation,<br />\nGus Burk, '31<br />\nA student at the University of<br />\nof the leading institutions of its kind<br />\nis due exclusively to rather than the exception. What?<br />\ncharacteristic<br />\nAdvertising Manager<br />\nin the country, there are certain Chicago was recently fined $100 for nature, to heredity; none exclusiveDavid Sykes, '32<br />\nYou say Socialism means all these<br />\nphases of life about the University throwing a piece of pie at a girl ly to nurture, to environment. All things? Oh, but we must, of all<br />\nCirculation Manager<br />\nGeorge W. La Mont, '32<br />\nwhich seem both childish and auto- who refused to kiss him after he are produced by the interaction of<br />\nheredity and environment, and can these things, preserve the capitalistic<br />\ncratic. When a person gets to col- had purchased a boquet of forget- be altered by suitable changes in system. Woe unto him who even<br />\nOffice Manager<br />\nlege, he is old enough to realize that me-nots from her.<br />\nIsadore C. Gutman, '32<br />\neither\".<br />\nsuggests Socialism! The capitalistic<br />\nCharles Ney, '33; Wm. N. Myers, '33;<br />\nwhat he makes of himself there is up<br />\nDr. Jennings tells of studies on system is indeed a God-given<br />\nMorton Rome, '33; Maurice R. Chassin,<br />\nAt the University of Kansas a \"identical twins\", which he calls thing. Thou shalt not disturb it in<br />\nto him, and do or say what he will,<br />\n'33; George Landau, '34; Wilson Rutherford, '31; Abram Burk, '34; Victor<br />\nchange<br />\nsurvey showed that only 7 keys \"to the relative roles of nature any manner whatsoever or thou<br />\nto<br />\nrecent<br />\ngoing<br />\nnot<br />\nis<br />\ninstructor<br />\nan<br />\nFrenkil, '34; Edgar Blumstein, '34; David<br />\nand nurture in the characters and<br />\na man unless he gets at the man from of the 1,705 women students plan destiny of human being, which are shalt be eternally damned.\"<br />\nGutman,'34; George Baylin, '31; Leonard<br />\nHarris, '34.<br />\nto be home-makers. 879 of the experiments performed for us by<br />\nthe right angle.<br />\nJackson Lee.<br />\nothers aim at a teaching career, and nature to give us an insight into the<br />\nand<br />\nThere are certain instructors<br />\nProduced by the R. L. Polk Printing Co.,<br />\nrelative influence of identity of maHOPKINS FINISHES 5th<br />\nprofessors here who feel it their duty 90 are aspiring journalists.<br />\n1930 Clifton Ave., Baltimore, Md.<br />\nand diversity of environterial<br />\nrifle<br />\nAt the intercollegiate<br />\nto watch over their students much as<br />\nment\". The zoologist speculates on matches held at Annapolis recently,<br />\na hen watches over her chicks. They<br />\nSeventy per cent of the English a world composed of identical twins<br />\nHopkins finished in fifth place.<br />\nrefuse to allow a person a bit of free- speaking people of the world live and his conclusions is said to make Eleven colleges participated.<br />\ndom. This matter is most noticeable on the North American Continent, interesting reading.<br />\nHe concludes his article with a<br />\nas regards cuts and unexcused ab- and sixty per cent of them in the<br />\nof practical application<br />\ndiscussion<br />\nsences from class. Granted that a United States.<br />\nof knowledge of heredity and enSupport Needed<br />\nperson should feel that he is to atvironment to the improvement of<br />\nsociety and advocates that<br />\nhuman<br />\nIt was very noticeable at the la- tend a large portion of his scheduled<br />\nand<br />\nThe Universities of Oxford<br />\npull\" point of view be<br />\n\"long<br />\nthe<br />\nafternoon<br />\nmust<br />\nhe<br />\nlast<br />\nSaturday<br />\ncrosse game<br />\nclasses, there are times when<br />\nCambridge frequently meet in taken in the solution of the probthat the student body of the Univer- be away, perhaps on business that he<br />\nmarble tournaments.<br />\nlem.<br />\nsity is giving the Jay athletic teams feels need not merit an excuse.<br />\nlittle or no support. The crowd lacked<br />\nOffhand, there are two ways of<br />\nthe enthusiasm that usually attends looking at the proposition. If a stuAND,<br />\nWhile giving a startling per- Posts For R.0. T. C.<br />\nsuch athletic competition and the dent is up with the average in his<br />\nMen Are Announced<br />\ncheers that were given would hardly class, and wishes to take a period off, formance, a magician spread a<br />\nTHE<br />\nhave been audible on the other side he should be allowed to do so. Of blanket over a newspaper and proSix Weeks Period To Be From<br />\nthe<br />\nread<br />\npaper<br />\nto<br />\nthrough<br />\nceeded<br />\nof the field.<br />\ncourse, this applies to laboratory and<br />\nJune 12 To July 23;<br />\nThe students have made it known drafting classes more than to recita- the heavy woolen cloth. All co-eds<br />\n1,549 To Attend<br />\nto the public at large in many differ- tions. So long as a man keeps up his at the show got up and walked out.<br />\nent ways that they do not desire the work, he is not hurting himself, and<br />\nIt was announced last Friday at<br />\ndiscontinuance of intercollegiate ath- surely he is not hurting the instructor,<br />\n\"How to Keep Well When the headquarters of the Third<br />\nletic competition. This being the case, who is there to guide and not to<br />\nwe do not see why all the undergrad- guard. Then, too, if a man wishes to Traveling in the Tropics,\" is the Corps Area that all students in the<br />\nuates, and as many of the graduates do a bit of outside work on the sub- title of a new course offered by the advanced course of the Reserve<br />\n171-AVE<br />\nas can, do not come out and give their ject, instead of in class, he will get University of California.<br />\nNy.:41 be reOfficers' Training Corps.tr.<br />\nOPPOSITE<br />\nwhole-hearted support to the teams.<br />\nas much out of it as if he were to<br />\nquired to attend the summer trainPENNA.R.R.STATION<br />\nWe do not advocate that the Jay remain cooped up in the classroom<br />\ncamps during the six weeks'<br />\ning<br />\nsupporters assume a \"rah-rah\" spirit all period.<br />\nAccording to the Nebraska EngNaturally, there can be a limit to lish Department, the word \"It,\" be- period between June 12 and July<br />\nthat exists in some colleges, but we do<br />\nfeel that they should lend their sup- which this theory should be followed. sides having the Clara Bow con- 23.<br />\nOne instructor never says a word<br />\nStudents from the infantry, enport to the teams.<br />\nnection, has been found to possess<br />\na<br />\non<br />\nrelying<br />\nmerely<br />\nabsences,<br />\nabout<br />\ngineers' division and the medical<br />\nThis lack of spirit has been evident<br />\nIf the latter feels three other meanings. The first<br />\nat Hopkins all during the year. The man's judgment.<br />\npredominate<br />\nof the class, \"it\" is commonly used to denote a corps are expected to<br />\nfootball eleven, swimming team, bas- that he can do better out<br />\nthe fact is \"big shot\" or important person. The in the attendance but nearly all the<br />\nketball quint, and now the lacrosse he is free to do so. And<br />\nhim. Conversely,<br />\nbranches of the service will be reptwelve have gotten very little support. not held against<br />\nstu- second \"it\" still has the hide-and- resented in the total of 1,549 stua<br />\nthat<br />\nfeel<br />\nwho<br />\nthose<br />\nare<br />\nthere<br />\ndurgames<br />\nAt many of the basketball<br />\nevery minute, go-seek and tag connection. While dents who are expected to attend<br />\ning the winter one could hardly find dent should be present<br />\nextenuating circumstances the third one refers to a stupid pera handful of enthusiastic Hopkins with no<br />\nthe nine army posts during the six<br />\nallow a bit of freedom. son as \"such as it.\"<br />\nwould<br />\nwhich<br />\nrooters.<br />\nweeks' period.<br />\nPerhaps a mixture of the two would<br />\nWe realize, of course, that some of produce the better result. At least,<br />\nNine Posts In All<br />\nour teams during the past few seasons students are not prisoners. They have<br />\nThe posts at which the R. 0. T.<br />\nIce golf is the title of the new<br />\nhave not been championship groups their fate in their own hands. They<br />\ngame now being played by Harvard C. camps will be conducted are as<br />\nand we might say that it wasn't very should know when they can miss a<br />\nfollows: Fort George G. Meade,<br />\ninteresting to come to one game after class and not lose out for the men. It is played somewhat similar<br />\nto present day golf except that the Three Hundred and Ninety-Ninth<br />\nanother and see the team go down in semester.<br />\nfrozen Charles River at Cambridge Infantry and Sixteenth Signal<br />\ndefeat.<br />\nperabove,<br />\nlisted<br />\nobservations<br />\nThe<br />\nadmit<br />\nCorps; Aberdeen Proving Ground,<br />\nOn the other hand, one must<br />\nis used as the course.<br />\nthat the players do not get any par- haps, do not apply to Hopkins in<br />\nOrdinance; Edgewood<br />\nEightieth<br />\nticular amount of enjoyment out of their fullest extent. However, the fact<br />\nChemical,<br />\nNinety-First<br />\nArsenal,<br />\ntheir defeats—however they keep right that many professors still hold to a<br />\nUrban University, with an en- Warfare Service; Fort Hoyle, Sixprovision<br />\npuerile<br />\non and do their best, and win or lose narrow-minded,<br />\nA pre-eminent Hotel of 1200<br />\nrollment of 29 students, leads all<br />\nthey give all they have to help the while others entertain a liberal atti- other higher educational institu- ty-Third Field Artillery; Fort<br />\ntude in the matter only tends to<br />\nHunt, Va., Thirty-Ninth Infantry; Rooms, each having Bath,<br />\nteam to win.<br />\nthe<br />\nbody.<br />\nstudent<br />\nof<br />\nthe<br />\nsize<br />\nin<br />\ntions<br />\nthe<br />\nPerhaps,<br />\nanomaly.<br />\nthe<br />\nheighten<br />\nvidor, Circulating Ice<br />\nIf the rooters would take this same<br />\nFort Humphreys, Two Hundred Ser,<br />\nattitude and back up the efforts of the difficulty lies in the fact that Hopkins,<br />\nand many other innoFort<br />\nWater<br />\nEngineers;<br />\nTwentieth<br />\nand<br />\nplayers, the results might be more the notoriously, loudly and almost<br />\nSecond<br />\nand<br />\nvations ...featuring a sincere<br />\nAccording to the Washington Elm Monroe, Two Hundred<br />\nfavorable. A team, no matter how flagrantly liberal college is really only<br />\na recent survey at University of Coast Artillery Corps; Fort Myer,<br />\ngood it is, if unsupported, in time fifty percent liberal.<br />\nspirit of hospitality.<br />\nAt all events the situation could be Virginia showed that 99 per cent Thirty-Second Cavalry; Carlisle<br />\nloses a certain amount of interest in<br />\ntheir work and has no driving power easily remedied by a royal bull emanat- of the men wore four-in-hand ties, Barracks, Two Hundred and Ninebehind it to encourage it to forge ing either from the throne room in and 50 per cent of the ties were tieth Medical, Forty-Fourth Vet- 'ROOM AND BATH $3UP<br />\nahead and attempt new and bigger Remsen Hall or the antechamber in<br />\nsolid in color, with blue prevailing. erinary and Seventy-Third Dental.<br />\nthings. Whereas, on the other hand, Latrobe Hall.<br /><br />\nEDITORIALS<br /><br />\nPhone Belmont 7908<br /><br />\nBirely's Pharmacy<br />\nST. PAUL at 33rd STREET<br />\nYour Neighborhood Drug Store<br /><br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy,<br />\nCigars<br />\nUnexcelled Fountain<br />\nService<br />\nMahe Our Store Your Store<br /><br />\nPatronize<br />\nOnr<br />\nAdvertisers<br />\nSeeking a Position?<br />\nWe are receiving inquiries daily for<br />\nteachers<br />\nTHE BALTIMORE TEACHERS<br />\nAGENCY<br />\nWilliam K. Yocum, Manager<br />\nTitle Annex Bldg.<br />\nPlaza 1195<br />\nBaltimore, Md.<br /><br />\nBACON'S<br />\nDrug Store<br />\nSt. Paul and 31st Streets<br />\nSPECIALIZES<br />\nIn Accommodating<br />\nHopkins Students<br /><br />\nFor Better Cleaning and<br />\nDyeing<br /><br />\nFRIED'S<br />\n101 E. 21st St.<br /><br />\nBelmont 5501<br /><br />\n42 out of 54<br />\ncolleges choose<br />\nthis FAVORITE<br />\npipe tobacco<br /><br />\n$1.COME<br />\n'ro<br /><br />\nNEVCSfORIK<br /><br />\nMOTEL<br />\nGIVERNOR and Yale agrees<br />\nCLINTON<br />\nthe windows of<br />\n[31 ST7<br />\nr Harknessatto find out what<br />\nOK UP<br /><br />\nthe Yale man smokes.In the springtime you'll see him sitting in his<br />\nwindow seat with a pipeful of<br />\nEdgeworth between his teeth.<br />\nOn Chapel Street...out at the<br />\nBowl...everywhere the Yale man<br />\ngoes, his pipe and Edgeworth go<br />\nwith him. And at 42 out of 54 of<br />\nthe leading colleges and universities<br />\nEdgeworth is the favorite tobacco.<br />\nA tobacco must be good to win<br />\nthe vote of so many discriminating<br />\nsmokers. And Edgeworth is good.<br />\nToconvince yourselftryEdgeworth.<br />\nYou can get it wherever tobacco is<br />\nsold...15¢ a tin. Or,for a generotL<br />\nfree sample, write to Larus &amp; Bro.<br />\nCo., 1o5 S. 22d St., Richmond,<br />\nVirginia.<br /><br />\nEDGEWORTH<br />\nSMOKING TOBACCO<br />\nEdgeworth is a blend<br />\nof fine old burleys,<br />\nwith its natural savor<br />\nenhanced by Edgeworth's distinctive<br />\neleventh process.<br />\nBuy Edgeworth anywhere i n two forms<br />\n—\"Ready-Rubbed\"<br />\nand \"Plug Slice.\" All<br />\nsizes, 150 pocket<br />\npackage to pound<br />\nhumidor tin.<br /><br />\n9<br />\n7.<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 14, 1931<br /><br />\nTHOMAS IS PRINCIPAL Paganism, Christianity, Dreamy<br />\nSPEAKER AT CONCLAVE Will Be Lecture Topics<br />\nSocialist Leader Addresses<br />\nLiberals On Socialization<br />\n250 ATTEND SESSIONS<br /><br />\nDr. Guglielmo Ferrero, Noted Historian Will Present Schouler Lecture, April 23, In Latrobe Hall<br /><br />\nHopkins Lacrossemen<br />\nHypnotics Cackle<br />\nDefeat Swarthmore<br />\nAt Psych Class Seance<br /><br />\nDr. Roy M. Dorcus Directs Students In Hypnotic Trances<br />\nTo Perform Weird Tasks Involuntarily<br />\n\"Paganism and Christianity\" will<br />\nbe the topic of a lecture to be<br />\nNo Casualties Reported<br /><br />\npresented by Dr. Guglielmo FerreSeidman Chosen Representa- ro, noted historian, under the James<br />\nSchouler Lectureship, April 23. The<br />\ntive To National Council<br />\naddress is to be delivered at 5 P.<br />\nM., Latrobe Hall, room 120. The<br />\nClaiming that the prevalent eco- lecture is open to the public.<br />\nnomic system is in the \"throes of<br />\nDr. A. M. Bartholdy, of the Unideath,\" Norman Thomas, Socialist versity of Hamburg, was the latest<br />\nleader, advocated socialization as a Schouler lecturer at the University<br />\ncure for unemployment, in his ad- this academic year. He spoke, in a<br />\ndress before the third annual Lib- series of five talks, on African soveral Club conference, held in Lever- ereignties.<br />\ning Hall last Saturday under the<br />\nauspices of the Johns Hopkins University Liberal Club. He spoke at Jay Trackmen Defeat<br />\n1<br />\n2<br />\nGettysburg,79/<br />\n1<br />\n2-46/<br />\nthe evening session.<br />\nCorporation Control Blamed<br /><br />\nThat socialization would adopt<br />\nlabor-saving devices for use and not<br />\nfor profit, was the statement of the<br />\nSocialist leader. Corporation control over the adoption of inventions,<br />\nhe pointed out, is a basic cause of<br />\nthe present crisis.<br />\nAttended by approximately two<br />\nhundred and fifty students and liberals representing more than fifteen<br />\ncolleges and many sections of the<br />\ncountry, the conference lasted all<br />\n•day Saturday. Four sessions were<br />\nheld, and a total of eight speakers<br />\npresented their views to the group.<br />\nDelegations were present from Vassar College, Columbia, St. John's,<br />\nVirginia State College, Hood College, Goucher, University of Baltimore, George Washington University, University of Maryland, and<br />\nseveral other colleges and universities.<br />\nCauses, Consequences Topics<br />\nThe morning session of the conference was devoted to theories of<br />\nthe causes of unemployment. Dr.<br />\nGeorge Barnett, Charles Ervin, and<br />\nDr. Harry Laidler spoke at this<br />\ntime. In the afternoon sessions,<br />\nMiss Anna Ward and Jay Lovestone spoke on the consequences of<br />\nunemployment, while discussion<br />\ngroups under the direction of four<br />\nmembers of the Hopkins Liberal<br /><br />\nis a phenomenon that was known to<br />\nthe ancients, but owing to its use<br />\nfor nefarious purposes has fallen<br />\ninto the disrepute from which it<br />\nsuffers today.<br />\nIts therapeutic<br />\nvalue has often been demonstrated,<br />\nbut it is not generally used as a<br />\ntherapeutic agent owing to the instinctive distrust of patients for a<br />\nphenomenon so little understood,<br />\nand distantly smacking of the occult.<br />\nLittle or nothing is known of the<br />\ncause of the hypnosis (experts<br />\nsay) but it has been supposed by<br />\nmany writers to be a form of sleep<br />\nHopkins Team Takes Discus and together with hyper-sensitivity to<br />\nTwo Mile Run In Meet<br />\nsuggestion. Some individuals show<br />\nSaturday<br />\ngreater affinity for suggestion<br />\na<br />\n(Continued from page 1, col. 5)<br />\nis declared, with neuBroad Jump (20 feet 914 inches)— than others it<br />\nFirst, Schwartz, G.; second, Hardy, 0.; rotic patients leading the list. This<br />\nthird, Wilfson, H.<br />\nPole ault (11 feet)—First, Quirk, H.; quality is arbitrarily called \"sugsecond, Gifford, 0.; third, Bittinger, H., gestibility\".<br />\nand Simon, G.<br /><br />\nJavelin (171 feet)—First, Schwartz,<br />\n0.; second, Burke, H.; third, Quirk, H.<br />\nDiscus (117 feet)—First, Dorman, H.;<br />\nsecond, Schwartz, G.; third, Kutcher, H.<br />\nShot Put (38 feet)—First, Dorman,<br />\nH.; second, Azar, G.; third, Kutcher, H.<br /><br />\n4)<br />\nEasy competition of this sort may<br />\ngive the Hopkins team a chance to<br />\npile up points, but it does not offer<br />\nthe team, as a whole, much opportunity to prepare for the strong contests later in the season.<br />\nThe attack is undoubtedly strong,<br />\nbut the defense has had little opportunity to display its ability.<br />\nFritz Stude, Jay goalie, has not had<br />\none eventful afternoon. In fact, he<br />\nonly had to stop about a half a<br />\ndozen shots, all of which he blocked<br />\nin a beautiful style.<br />\nInstead of proving an advantage<br />\nto the team, these easy games are<br />\nreally a hindrance. Stronger competition will prove the best test.<br />\n(Continued from page<br /><br />\nConsent of Subject Necessary<br /><br />\nThree stages, Lethargy, Catalepsy and Somnambulism are noticed in a hypnosis, and there are<br />\nvarious means of putting a subject<br />\nfrom one stage into the other, professors say. Usually the consent of<br />\nany normal individual, it was explained, must be gotten before he<br />\nmay be hypnotized, for by his own<br />\nefforts, a fatigue of one of the<br />\nsenses (usually conversion strabismus of the eye) is a necessary<br />\nprelude to the state.<br />\nAnd now, if you spy a somewhat<br />\nserious-looking college man firmly<br />\nadmonishing either his kid sister,<br />\nbrother or girl friend that they are<br />\na bear, llama, or Cleopatra respectively,—that, gentle reader is not a<br />\ncase for Fipps Clinic . . . no . . .<br />\nmerely a scientific demonstration of<br />\nhypnotism.<br /><br />\nFreshmen Lose Debate Hopkins Arguers Meet<br />\nTo City College Trio Hood College Tonight<br /><br />\nClub occupied the second division<br />\nof the afternoon.<br />\nAt the evening session, broadcast through the courtesy of station WCBM, of Baltimore, Dr.<br />\nIsador Lubin, and Rabbi Dr. Edward Israel also discussed remedies<br />\nof unemployment. A discussion, in<br />\nwhich Jay Lovestone and Mr.<br />\nThomas held an impromptu debate<br />\nfollowed the regular speeches.<br /><br />\nIn a debate on the question, Resolved: That the United States<br />\nEnter the League of Nations, held<br />\nlast Friday at City College, between<br />\nthe City College team and the<br />\nFreshman team of Hopkins, Hopkins lost the decision by a vote of<br />\n2 to 1. Hopkins was represented<br />\nby Saul Dorfman, S. M. Doctofskey and Charles Stern, rebuttal.<br />\nThis is the third year that the<br />\nSeidman Named Representative<br />\nFrosh have met defeat at the hands<br />\nJoel Seidman, past president of of the City College forensics.<br />\nthe Liberal Club, was reelected representative to the national student<br />\ncouncil of liberal groups affiliated<br />\nRIFLEMEN TO ELECT<br />\nwith the League for Industrial<br />\nOfficers for the Rifle Club will be<br />\nDemocracy, in a special meeting held elected today at 12.30 P. M., at a<br />\nfor that purpose. He will act as meeting of that organization, to be<br />\nrepresentative of all liberal clubs held in the south loft of Gilman<br />\nwithin the district including Mary- Hall.<br />\nJ. C. Handy, president, requests<br />\nland, the District of Columbia, and<br />\nVirginia, and will hold the position the presence of all members at the<br />\nmeeting.<br />\nof division chairman.<br /><br />\n11<br /><br />\nDon't<br />\nwait until Crank<br />\nCase Dilution_<br />\ncauses burnedout bearings to<br />\nlearn that<br /><br />\nAMOCONGAS<br />\nmieil<br /><br />\nOxford Honors System To Be Debated; Affirmative Upheld By<br />\nHopkins Speakers<br /><br />\nDebaters representing Hood College and the Johns Hopkins University will meet tonight at Frederick, Md., in a debate on Resolved,<br />\nThat Colleges of the United States<br />\nAdopt the Oxford System of Calling for Honors.<br />\nHopkins, who will uphold the<br />\naffirmative to the question, will be<br />\nrepresented by Llewellyn Stanton,<br />\nJerome Blum, and William F.<br />\nStark.<br /><br />\nMembers Florists Telegraph Delivery Association<br /><br />\n1, col.<br /><br />\nHopkins<br />\nSwarthmore<br />\nStude<br />\nDavies<br />\nBernard<br />\nPerry<br />\nWeitzel<br />\nC. P<br />\nMahon<br />\nNess<br />\nP. D<br />\nKeefer<br />\nKneipp<br />\nS. D<br />\nRushmore<br />\nLang<br />\nT. D<br />\nDouglas<br />\nBeeler<br />\nWilliams<br />\nGuild<br />\nT. A<br />\nJoyce<br />\nStone<br />\nS. A<br />\nJones<br />\nD. Kelly<br />\nF. A<br />\nPike<br />\n0. H<br />\nTurnbull<br />\nMcVaugh<br />\nDarrell<br />\nI. H<br />\nHarlan<br />\nHopkins<br />\n8 3-11<br />\nSwarthmore<br />\n0 0— 0<br />\nSubstitutions: Hopkins—Dukehart for<br />\nStone, Cockey for Beeler, C. Kelly for<br />\nGuild, Triplett for Turnbull, Cone for<br />\nKneipp, Hudert for Cone. Swarthmore—<br />\nSonneman for Joyce, Crowl for Harlan,<br />\nBaker for Rushmore, Skinner for Parry,<br />\nParry for Mahon.<br />\nGoals—Lang, Darrel (3), Kelly (2),<br />\nKneipp, Beeler (2), Turnbull, Guild. Referee—R. V. Truitt. Judge of play—W.<br />\nC. Wylie. Goal umpires—S. Crosthwaite<br />\nand E. Smith.<br /><br />\n000<br /><br />\ndi<br /><br />\nFLORISTS<br />\nAND<br />\nDECORATORS<br />\n1918 N. Charles St., near 20th<br />\nPhone: Vernon 0573<br /><br />\nJ. H. FURST CO.<br />\nPRINTERS OF<br /><br />\nPhilological and Scientific<br />\nPublications<br />\n12-20 Hopkins Place, Baltimore<br /><br />\nBelmont 8040-8041<br /><br />\nPARISIAN TAILORING<br />\nCOMPANY<br />\nCleaning, Dyeing, Pressing<br />\nRepairing<br />\n346 E. 33rd STREET<br />\nCor. University Parkway<br /><br />\nOPERATE IT YOURSELF<br /><br />\nRENT A CAR<br /><br />\nThe Auto Rental Company<br />\nCars for Hopkins Students<br /><br />\nLOUIS SULSKY<br />\nSnappy<br />\nNew<br />\nEvening Clothes<br />\nto Rent<br /><br />\nDeposit Not Required<br /><br />\n111 W NORTH AVE.<br /><br />\n2125 HARFORD AVE.<br /><br />\n313 W. FRANKLIN ST.<br />\nPhone, VErnon 3436<br /><br />\nPhone, Wolfe 1413<br /><br />\nThe crime wave, too,<br />\nstrikes a breakwater<br />\nPolice Radio is \"joining the force\" in many a city—acting as a break-<br /><br />\nwater in checking the surge of criminal activity...The apparatus the<br /><br />\nAn alarm! Headradios it<br />\nto cruising cars.<br /><br />\npolice are using comes out of the telephone workshop. It is logical that<br /><br />\nquarters<br /><br />\nWestern Electric should make the equipment, drawing on a fifty-year<br /><br />\nexperience as manufacturer of telephones for the Bell System...Serv-<br /><br />\ning this vast organization is a huge responsibility. Carrying it out means<br /><br />\nThis engineer's<br />\n\"precinct\" is a<br />\nlaboratory.<br /><br />\nkeeping an open mind on new methods of manufacture,new sources oft<br /><br />\nsupply, new channels of distribution. It means welcoming and taking<br /><br />\nAmoco-Gas gives better, allaround performance than....<br />\nyou've ever known and it;<br />\nCOSTS LESS PER MILE!<br />\n97\"k AMERICAN OIL COMPANY<br />\nAlhbued rah Paso Amurnce• Pflroleuen•Tramp.,tampon,<br /><br />\nGeneral 01fiers: American tilde , Baltimore. Md.<br /><br />\nCaught—because<br />\nthe radio saved<br />\nprecious minutes.<br /><br />\nfull advantage of every worth-while aid that modern science offers.<br /><br />\nWestern Electric<br />\nManufacturers...Purchasers...Distributors<br />\nIIINCIC lillt FOR<br /><br />\nTHR BILLL SYSTZM<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 14, 1931<br /><br />\nSeven Scholars, Fellows Chosen;<br />\nFour Others Get Reappointment<br /><br />\nThe Makin's<br />\nof a<br /><br />\nDr. Joseph S. Ames Announces Awards for the Next<br />\nAcademic Year; Peabody Scholarship<br />\nOne of Those Presented<br /><br />\nGood Sport<br />\nby \"Bill\" Triplett<br /><br />\n(Continued from page 1, column 3)<br /><br />\nFor wearin' on the green, loafin' on the sidelines, strollin' on the campus, or just puttin'<br />\non because you like their snappy sportiness—<br />\nBill Triplett has a line of Hess sport shoes at<br />\nthe Barn that'll make you sit up and take<br />\nnotice. Entirely new ideas developed by<br /><br />\nN. HESS' SONS<br />\n8 Baltimore Street, East<br /><br />\nWe Sell Drugs and Give Service<br />\nCall us up Belmont 5318, 5846<br /><br />\nPeabody Pharmacy<br />\nCalvert and 30th Streets<br /><br />\nPhones VErnon 1868<br />\n\"What Is Impossible to Others Is<br />\nPossible to Us\"<br />\nTHE RELIABLE WEAVING Co.<br />\nMoth Holes, Burns, Tears, Cuts and Mill<br />\nDamages Made Perfect<br />\nWE ALSO REPAIR SILK DRESSES<br />\n208 WEST SARATOGA STREET<br />\nBetween Howard St. and Park Ave.<br />\nBaltimore, Md.<br /><br />\nDECORATIONS<br /><br />\nINTERIOR WOOD WORK<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br />\nBALTIMORE, MD.<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\nFactory<br />\n600 S. Pulaski<br /><br />\nStreet<br /><br />\nGreek and Latin languages and literature.<br />\nDecember, 1925, the Trustees received from Mrs. George B. Hunting $5,000 for the foundation of a<br />\nscholarship fund in honor of her<br />\nson, Warren B. Hunting. Students<br />\nin the political science department<br />\nof the graduate school are eligible<br />\nfor the scholarship which amounts<br />\nto $250 annually.<br />\nTogeler Bequeathed $5,000<br />\nCharles A. W. Vogeler, alumnus<br />\nof the Hopkins, who died March<br />\n21, 1919, bequeathed $5,000 to the<br />\nTrustees to be used as a fellowship<br />\nin Greek archaeology.<br />\nOn the recommendation of the<br />\nzoology department, the Academic<br />\nCouncil awards the A. T. Bruce<br />\nFellowship for research in biology<br />\nat a place approved by Dr. Ames.<br />\nThe mother of Dr. Bruce, fellow<br />\nand instructor at the University,<br />\nfounded the fellowship in 1887.<br />\nUsed For Archaeology Students<br />\nA bequest of approximately $5,000 annually by Cornelia G. Harcum, student in the archaeological<br />\ndepartment, has been used by the<br />\ntrustees as a scholarship open to<br />\nwomen students in Classical archaeology.<br /><br />\nENTRIES DUE TONIGHT<br />\nFOR 2 LITERARY MEETS<br />\nContestants Must File Entries<br />\nBefore Midnight With<br />\nCharles Ney<br /><br />\nMILESTONE SYSTEM<br />\nDRIVE IT YOURSELF<br /><br />\nNo Deposit Required of Hopkins Students<br />\nBuick,<br />\nFords<br />\nChryslers<br />\nHupmobiles<br />\nChevrolets<br /><br />\n....... .<br /><br />\nCoupes<br />\nRoadsters<br />\nSedans<br /><br />\nNo Hour Charge at any Time<br />\nLIGHT AND LOMBARD STREETS<br />\n1725 N. Charles St.<br />\nVernon 4049<br /><br />\nPLaza 6000<br /><br />\n2402 Pennsylvania Ave.<br />\nLafayette 2000<br /><br />\nBaltimore Concedes Milestone Supremacy<br /><br />\nWhen in 'New York dine at<br /><br />\nSt. Regis Restaurants<br />\nLocated at<br /><br />\n1491 Bdwy at 41st St.<br />\n1400 Bdwy at 42nd St.<br />\n1500 Bdwy (Cadillac)<br />\n1570 Bdwy. at 47th St.<br />\n1627 Bdwy. at 50th St.<br /><br />\nSelf Service Stores<br />\n145 W. 42nd St.<br />\n210 W. 42nd St.<br />\n410 Leington Ave.<br />\n(Grand Central Terminal)<br /><br />\nEntries for the Adams declamation and the De Tocqueville lecture<br />\ncontests at the Johns Hopkins must<br />\nbe filed before midnight today with<br />\nCharles Ney, of the Rochester<br />\nApartments, Linden avenue. Topics<br />\nin the respective literary meets must<br />\nbe submitted together with entries.<br />\nSophs Eligible In Adams Meet<br />\nAll undergraduates are eligible<br />\nfor the De Tocqueville contest;<br />\nsophomores, for the Adams competition. Speeches are to be limited<br />\nto six minutes.<br />\nAmerican prose selections of the<br />\ntwentieth century, with the exception of those dealing with political<br />\nproblems, will be acceptable in the<br />\ndeclamation contest, tryouts for<br />\nwhich are to be held Thursday in<br />\nLevering Hall, Room B, 11:30<br />\nA. M.<br />\nTryouts Saturday<br />\nFor the De Tocqueville contest<br />\ncontestants must deliver a lecture in<br />\nEnglish on any phase of French<br />\nhistory of the present and nineteenth centuries. Tryouts are scheduled for Saturday, 1 P. M., Leverino- Hall, Room B.<br />\nbFour speakers in each event will<br />\nbe chosen.<br /><br />\nDR. McCOLLUM SPEAKS<br /><br />\nF. Y. I.<br />\nmeans<br />\n\"For<br />\nYour<br />\nInformation\"<br /><br />\nF. Y. I.<br />\nYou read, of course, but how do you select your<br />\nreading? The entire booktrade is co-operating in<br />\nthe publication of a newsy, up-to-date magazine<br />\nthat will keep you posted. Would you like us to<br />\nsend it to you with our compliments?<br /><br />\nNorman Remington Co.<br />\n347 N. Charles St.<br />\nBaltimore, Md.<br /><br />\nSurely! I want to know what's<br />\ngoing on. Send your magazine<br />\nmonthly. No obligation, of<br />\ncourse.<br /><br />\nChemical Hygiene Professor Addresses Medical Society On Mineral's Effects<br />\nThe part played in human growth<br />\nand health by minerals in food that<br />\nhumans eat was discussed Monday<br />\nnight before the semi-annual meeting of the Baltimore City Medical<br />\nSociety by Dr. Elmer V. McCollum, professor of chemical hygiene<br />\nat the J. H. U. School of Hygiene<br />\nand Public Health.<br />\nAn internationally known authority on nutrition, Dr. McCollum,<br />\nhas for several years been experimenting to determine the physiological importance of certain<br />\nminerals found in the body and in<br />\nnormal diet.<br /><br />\nPreference is given in awarding<br />\nthe Ella E. Slack Scholarship, to<br />\ngraduate students in those subjects<br />\nof study in connection with which<br />\nthere is no other endowed scholarship or fellowship. It was established by the late Mrs. Ella E.<br />\nSlack, who died November 4, 1923.<br />\nThe endowment was $6,730.<br />\nFounded Three Scholarships<br />\nMrs. Harriet Lane Johnston, of<br />\nWashington, formerly of this city,<br />\nin memory of her husband and two<br />\nsons, founded the three Johnston<br />\nscholarships in 1904. They are<br />\nawarded annually by the trustees<br />\nto men and women who have given<br />\nevidence of the power of independent research and who expect to<br />\ndevote themselves to research in<br />\ntheir chosen subjects.<br />\nThe stipend is $1,500 annually.<br />\nTo Hold Cabaret<br />\nA cabaret party, which was an<br />\noutstanding success of 1930 June<br />\nWeek, according to Yellott, will<br />\nbe again held in Levering Hall.<br />\nMusic will be furnished by T.<br />\nWorth Murphy's Belvedere Band.<br />\nGuy Lombardo and his Royal<br />\nCanadians will furnish the music<br />\nat the Senior Ball.<br />\nNOTICE<br />\nCoach Hambleton is extremely<br />\nanxious that all men having been<br />\n\"working out\" on the track attend<br />\nthe practices this week. This applies particularly to the \"Junior<br />\nVarsity\" men, who are to engage<br />\nthe team from \"Poly\" on Friday.<br />\nThis Jay \\Tee-Poly meet is a yearly<br />\naffair and proves to be very interesting aside from providing experience for the younger men.<br /><br />\nST. REGIS<br />\n1815-1817 N. Charles Street<br />\nSTUDENTS MEETING PLACE<br />\nClub Breakfasts<br />\nSpecial Luncheons 50 cents<br />\nDinners 65 cents<br />\nRenowned as \"Just the Place\" for Supper<br />\nAfter the Theatre or Dance<br />\nOPEN UNTIL 3:00 A. M.<br /><br />\nBEER<br />\nUndergraduate suffering from a perforated<br />\nduodenum and generally sensitive digestive system<br />\nwould like to secure connections with a conscientious<br />\nbootlegger handling only virgin beer.<br />\nSo-called college-boy concoctions such as \"spiked\"<br />\nnear beer and corrupted Coca Cola will not satisfy.<br />\nPlease communicate with advertiser if you can<br />\nname the whereabouts of real<br /><br />\nBEER<br />\nApply Box 304, Johns Hopkins Post Office<br /><br />\nJust try them•••<br />\nthen leave them-if you can<br />\nto find out just<br />\nwhat the new Humidor Pack<br />\ndoes for Camel smokers is to<br /><br />\njust quit Camels if you can.<br />\nRemember, it's dust-dry ciga-<br /><br />\nswitch over to this famous<br /><br />\nof their natural moisture by<br />\nevaporation or scorching that<br /><br />\nTHE BEST WAY<br /><br />\nbrand for an entire day. After<br />\nyou have tasted the Camel<br /><br />\nrettes that have been robbed<br /><br />\nblend of choicest Turkish and<br />\nmellowest Domestic tobaccos<br /><br />\nsting the tongue and burn the<br />\nthroat. There are none of these<br />\ndiscomforts with Camels. Try<br /><br />\nkept in prime fresh condition,<br /><br />\nthem and see for yourself.<br />\nR. J. REYNOLDS TOBACCO CO.<br />\nWinston-Salem, N. C.<br /><br />\nCAMELS<br /><br />\nMedal Awarded Pfund<br />\nFor Reading Paper<br />\nOn Power<br />\nIn recognition of his paper on<br />\n\"Hiding Power Measurements in<br />\nTheory and Applications\", Dr.<br />\nA. H. Pfund, professor of physics at the Hopkins, was awarded the Charles B. Dudley Medal<br />\nby the American Society for<br />\nTesting Materials, of Philadelphia.<br />\nEffectiveness of paints in concealing on what they are spread<br />\nis discussed in the paper. This<br />\nstudy is said to be of great importance in the commercial industry.<br /><br />\nFactory-fresh CAMELS<br />\nare air-sealed in the new<br />\nSanitary Package which<br />\nkeeps the dust and germs<br />\nout and keeps the flavor in.<br />\n01931, R. J. Reynold. Tahoe. Company<br /><br />"}], "field_media_file": [{"target_id": 38616, "display": null, "description": null, "target_type": "file", "target_uuid": "19ed9977-8660-47f1-a4db-08ab9f4a4d8a", "url": "http://digital.library.jhu.edu/system/files/2022-03/12253-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12253, "target_type": "node", "target_uuid": "f2a58071-8419-4db6-ac41-1c443c29d3b8", "url": "/node/12253"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "a9a5ae43-0caa-4803-9956-0d55bfae43b2"}]}