{"mid": [{"value": 36807}], "uuid": [{"value": "5e604658-d4f3-43d6-b174-543679599574"}], "vid": [{"value": 36807}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:54:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13039-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:54:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:54:04+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 25<br />\n<br />\ning<br />\nM.<br />\n<br />\nw0<br />\n<br />\net-<br />\n<br />\n:ar<br />\nrig<br />\n<br />\nDLI<br />\n<br />\n•<br />\n•<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nBALTIMORE, MD., JANUARY 16, 1923<br />\n<br />\nMR. T. R. BALL, UNIVERSITY MR. SWINDELL SPEAKS ON MEMORIAL PLANNED FOR STUDENT COUNCIL REFUSES 0. D. K. RECOMMENDS MOVING UP ANNUAL SPRING<br />\nTO SANCTION LITERARY<br />\nREGISTRAR, AWARDED<br />\nFUTURE OF HOPKINS<br />\nPOET'S BIRTHDAY ON<br />\nELECTIONS<br />\nPUBLICATION<br />\nFEBRUARY 3<br />\nVARSITY SEAL<br />\nDRAMATICS<br />\nAppreciation is Shown Oldest Liv- Expresses Hope for All Hopkins Tribute to Be Paid to Great Man. Sees No Need for Magazine. Rec- Limitation of Activities and Enrollment Suggested. Mapommends That Co-eds Should<br />\nHeld Chair Of American<br />\nProduction Next Year. Trying Registrar in<br />\nproves of New Publication<br />\nLiterature<br />\nNot Participate<br />\nouts for Purple Mask Held<br />\nCountry<br />\nThe<br />\nOmicron Delta Kappa Honmeeting<br />\nof<br />\nthe<br />\nStudent<br />\nmovement<br />\nhas<br />\nbeen<br />\nstarted<br />\nin<br />\nAt<br />\na<br />\nshouldn't<br />\nJohns<br />\nHopkins<br />\nA<br />\nMr. T. R. Ball, Registrar of this \"Why<br />\nJanuary<br />\n12,<br />\nheld<br />\nFriday,<br />\nAmerican<br />\nCouncil<br />\nclass<br />\nin<br />\nliterature<br />\nUniversity, received a signal hon- produce a show written and di- the<br />\norary Fraternity at its monthly<br />\nor last week when he was awarded rected by Hopkins men that to pay tribute to Sidney Lanier the council refused to sanction meeting recommended that electhe Varsity Seal by a unanimous would be on a par with those con- the university's own great poet, the publication of a new literary tions for the Student Council,<br />\nvote of the Student Activities ducted annually by the Princeton by holding a Lanier memorial magazine on the campus. It was<br />\nAthletic Board and all leading acCouncil. The action followed a Triangle Club?\" Such was the meeting on his birthday, February their belief, after both sides of<br />\ntivities<br />\nshould be held the first<br />\nrecommendation that Mr. Ball be question put to candidates for the 3. In former years students have the question had been presented,<br />\nshown the appreciation of the stu- Dramatic Club by Coach Walter been in the midst of their exami- that there was little desire for week in March. The recommendadent body for his years of faithful B. Swindell at the tryouts last nations, but as the day, February such a paper on the campus and tion was made because it was<br />\n3, falls on Saturday, it was that the students of the Universi- believed that the new boards and<br />\nwork at Jchns Hopkins and his in- Thursday night.<br />\nterest in student affairs.<br />\nIn his talk Mr. Swindell out- thought that such a meeting ty would not support it. It was staffs, with the help of this year's<br />\nIt is an interesting 'fact that from lined the object for which he could be arranged to perpetuate agreed that this magazine would men, would be better able to exthe point of service Mr. Ball is the thought the Dramatic Club should the memory of this immorta. be a failure without the support ercise the following year's duties.<br />\nof the student body and without An example was given in the<br />\noldest living registrar in the coun- strive. This was the producing Maryland genius.<br />\nsupport would in no way News-Letter staff. The Board of<br />\nthis<br />\nSidney t.anier's real greatness<br />\ntry. This was noted at the, last of plays - in the future, which<br />\nHopkins.<br />\nbenefit<br />\nControl is always elected in<br />\nmeeting of the Intercollegiate Reg- should be entirely the work of is now not to be doubted. His<br />\nHopkins men. Productions of this work is read and studied by colistrars held at St. Louis.<br />\nKirkley, A. Musher and Hub- March and the new board has the<br />\nMr. Ball came in under Dr. Dan- sort would draw crowds that the lege students just as the works of ner, representing the desired pub- advantage of working with the<br />\niel C. Gilman, the first president of interpretation of someone else's Bryant, Longfellow, Lowell, Poe lication, pointed out that they old men for a few months before<br />\nthis university, in 1878. This Jan- plays would not and would bring and other makers of American lit- wished to publish an all-round they assume full charge. Fallon<br />\nuary he finished his forty-fifth year to Hopkins the fame and recog- et4ry httryae reall ai.d studied. magazine which wbuid be repre- was appointed to ascertain the<br />\nof active work at the university. nition that the Princeton Trian- Maryland, and particularly Johns sentative of Hopkins journalism. sentiment of men on the campus<br />\nWith the exception of Mr. \"Bill\" gle Club enjoys. That such a Hopkins, lays real claim to kin- They were of the opinion that no in regard to this idea.<br />\nPresident 0. D. Collins, of the<br />\nsuch magazine at this time exists<br />\nStewart, of the Chemical Depart- thing is not a dream but a real ship with him.<br />\ncircle<br />\nin<br />\nthe<br />\nappointed Randolph NorUniversity<br />\nand<br />\nthat<br />\na<br />\npossibility<br />\nand<br />\nthat<br />\nHopkins<br />\nis<br />\nIn 1879 Lanier became profesment, who entered about fourteen<br />\nwood<br />\nto<br />\ntype<br />\nsucceed Thomas Landy<br />\nmagazine<br />\nof<br />\nthis<br />\nwas<br />\ncapable<br />\nof<br />\ndoing<br />\nneeded.<br />\nas well as any sor of English literature at Hopmonths ahead of Mr. Ball, he has<br />\nas<br />\nbusiness<br />\nmanager of the 0. D.<br />\namateur<br />\nstage body were the con- kins. Up to that time he was con- Fallon, president of Student Acbeen connected with Hopkins lonK.<br />\nSong<br />\nBook.<br />\nThis book was<br />\ncluding thoughts in Mr. Swindell's nected with the Peabody Sym- tivities Council, the president of<br />\nger than any other man.<br />\ncompiled<br />\nlast year by Douglas<br />\nphony Orchestra, where his abili- 0.D.K., and Fenneman, president<br />\nThe most outstanding quality of talk.<br />\nFollowing this speech tryouts ty as a player of the flute was rec- of Pi Delta Epsilon, presented the Coulter, '21. H. Douglas Cotton,<br />\nthis man probably is his wonderful<br />\nmemory. It may be truthfully said were started for the roles in \"The ognized and praised. But Lanier views of these organizations. Each '22, was the first business manthat Mr. Ball knows by sight all Purple Mask,\" the mystery drama was a poet as well as a musician, spoke against the proposed maga- ager and was succeeded by Thommen at the university. Graduates to be produced this year. The though his work is obviously af- zine, saying that its appearance as Landy. There are at present 240<br />\nfrom as far back as classes in the play is of the time of Bonaparte fected by his passion for music. would be detrimental in a finan- copies of the first edition on hand.<br />\nA recommendation was made<br />\n\"eighties\" are always cordially and is similar to the play of last A book of his poems appeared in cial way to the other publications<br />\nto the Student Council that pargreeted by name as they enter the year, \"If I Were King,\" Mystery 1877. Considering the short time on the campus.<br />\nis the dominant characteristic he devoted entirely to literature<br />\nticipation in activities be limited<br />\nRegistrar's office.<br />\nthroughout and in order to main- and the unfavorable conditions The Student Council is opposed in the case of Seniors. It is beto making Hopkins a co-educa- lieved that if the \"jobs\" on the<br />\nSWIMMING TEAM TO MEET tain the elements of suspense and under- which he worked, his<br />\ntional institution. A letter will be campus are more evenly distribSWARTHMORE AT B. A. C. surprise, capable interpretations achievement was as remarkable<br />\nsent<br />\nto the dean announcing this uted it will create greater interest<br />\nmust be made of the various rules. as any American of his generaFRIDAY<br />\ndecision.<br />\nand efficiency.<br />\nTankmen to Open Schedule With With this end in view every can- tion. After his appointment as<br />\ndidate<br />\nwas<br />\ngiven<br />\nai<br />\nequal<br />\nchance<br />\nThis<br />\nsubject<br />\nwas<br />\ncalled<br />\nto<br />\nthe<br />\non<br />\nEnglish<br />\nlecturer<br />\nliterature at<br />\nThe matter of the limitation of<br />\nGarnet As Opponent. Dancand the best men will be given the Hopkins, his strength steadily attention of the Student Council enrollment from local public prep.<br />\ning to Follow Meet<br />\nparts whether they are members waned and he died in 1881 while due to the \"little war\" waged in schools was reopened. RecomHopkins winter sports will be<br />\nof the club or not.<br />\nthe News-Letter on this point; mendation was made last year to<br />\non a visit to North Carolina.<br />\nInaugurated on Friday evening<br />\nlikewise,<br />\nbecause of the formation the State Legislature that that<br />\nThe first memorial to Lanier at<br />\nWhen the Black and Blue SwimSIGMA<br />\nCHI<br />\nBETA<br />\nPLEDGES<br />\nHomewood was a sprig of ivy of the Johns Hopkins Women's clause forcing Hopkins to accept<br />\nming Team meets Swarthmore in<br />\n20<br />\nNEW<br />\nMEN.<br />\nINITIATION<br />\nplanted by the class of 1915. In Club, part of whose program was any public prep. school graduate<br />\nthe Baltimore Athletic Club pool.<br />\nON<br />\nFEB.<br />\n6<br />\nthe<br />\nbiological laboratory is a bust to incorporate the female stu- be repealed. Nothing materialized<br />\nAn informal dance, to be held in<br />\nrecommendation<br />\nA<br />\nthat<br />\nall<br />\nbuildof<br />\nthe poet, together with a dents of the university into the ac- from the recommendation. There<br />\nthe club's gym, will follow the<br />\nings<br />\nand<br />\ndriveways<br />\non<br />\nthe<br />\ncampus<br />\nbronze<br />\ntablet and some of his tivities of the undergraduate de- is at present, however, a bill pendmeet. The famed Black and Blue<br />\npartment. Attention was called ing which would deprive Hopkins<br />\nbe<br />\ngiven<br />\ndefinite<br />\nnames<br />\nhas<br />\nbeen<br />\nmanuscripts.<br />\nSix will furnish the music.<br />\nat<br />\nthe meeting to the fact that of its state suppdrt and leave it<br />\nmade<br />\nto<br />\nthe<br />\nuniversity<br />\nauthorities<br />\nThe meet and dance was<br />\nDr. French is of the opinion<br />\nwith<br />\nthe exception of a few cases, an independent institution. The<br />\nby<br />\nthe<br />\nSigma<br />\nChi<br />\nBeta<br />\ninter-fraterPlanned by Manager Buhrer in an<br />\nthat Lanier memorial ceremonies<br />\nwomen<br />\nare not admitted to the aid received at present is pracnity<br />\nfraternity.<br />\nIt<br />\nwas<br />\nsuggested<br />\neffort to raise funds for the swimshould be given at the first stuArts and Sciences and tically all consumed by the variCollege<br />\nof<br />\nthat<br />\nthe<br />\nnames<br />\nused<br />\nshould<br />\nbe<br />\nof<br />\ntiling team. The burden of finandent assembly after his birthday.<br />\nunless<br />\nthe<br />\nfaculty sees fit to ous state scholarships. The passmen<br />\nof<br />\nprominence who are or This, it is thought, would be a<br />\ncing swimming falls almost enits<br />\nruling<br />\non this subject, age of the bill, it is therefore bechange<br />\ntirely upon the team itself and have been connected with Hopkins. better way of insuring a gatherfemale<br />\nshall<br />\nnot be per- lieved, would be most desirable.<br />\nstudents<br />\nThis step was taken as express- ing of real proportions than to<br />\nthe men in charge request a large<br />\nto<br />\nparticipate<br />\nin the ac- Donald Vanneman was appointmitted<br />\nturn-out. Admission will be $1.50 ing the universal approval of the have the ceremony on February 3.<br />\nthe<br />\nin<br />\nwhich<br />\nmale stu- ed by the 0. D. K. to offer the<br />\ntivities<br />\nPer couple, with a reduction of student body in a move that has<br />\ndepartment<br />\nthis<br />\ntake services of the society to bring<br />\ndents<br />\nof<br />\nfifty cents for stags. It is against been favored for some time. The<br />\nJANUARY MEETING OF<br />\npart.<br />\nabout any favorable action from<br />\nthe rules of the B. A. C. for tick- present system of namings halls by<br />\nA. S. M. E. HELD<br />\nAt the recommendation of the the legislature.<br />\nets to be sold at the door so all their use instead of taking advan- The January meeting of the BalThe question of the new publiadmissions must be bought and tage of the opportunity to honor timore section of the American 0. D. K. the question of limiting<br />\nPaid for at the university. Tickets men who have helped to make Hop- Society of Mechanical Engineers the activities of students was cation was brought before the<br />\nmay be obtained from members kins what it is today has been was held last Wednesday, Jan- brought up and discussed. The meeting and a member of 0. D.<br />\nof the team at the University deemed inadequate and one at vari- uary 10, at the Engineers' Club. matter was turned over to a com- K. was appointed to present the<br />\nPostoffice and at the various fra- ance with the custom at other uni- Many members of the Hopkins mittee composed of Middleton, society's views to the Student<br />\nversities.<br />\nternity houses.<br />\nlocal chapter were present at the Cromwell, O'Connor and Nor- Council. The sentiment of the cirwood for investigation.<br />\ncle is against the appearance of<br />\nA strong lineup will be pre- Pledging of twenty men for meeting.<br />\nIt<br />\nhas<br />\nbeen<br />\ndecided<br />\nby<br />\nthe<br />\nthe magazine.<br />\nsented by the Black and Blue Sigma Chi Beta has been completed<br />\nThe speaker was Mr. George H.<br />\ninermen. Captain Coady will be and plans are now being made to Gibson, of the George H. Gibson council to continue the pledge on<br />\nAt the conclusion of the meetseen in the relay and the 2.20. initiate these men at a dance that Co., consulting engineers of New examination papers.<br />\ning the circle passed a resolution<br />\nManager Buhrer will perform in will probably be held February 6. York City. His topic was \"Feed<br />\nthat inasmuch as 0. D. K. stands<br />\nthe relay and the hundred. Among The pledges are: G. M. Shriver, Water Heating.\" Mr. Gibson dis- STUDENTS INSPECT INSULA- for the highest on the campus and<br />\nthe new faces will be Welsh, Rob. '24; Jenifer, '24; Croker, '24; Ad- cussed the various arrangements<br />\nTOR PLANT<br />\ncovers everything else, no other<br />\nMiddleton, S. A. Middleton and ams, '24; Campbell, '24; Mount, that can be made with open and<br />\nAn inspection trip of the Locke emblem shall be worn on the<br />\n'24; Grace, '23; Klein, '25; Rout- closed feed water heaters, evap- Insulator Plant was made last watch chain with the exception of<br />\nlioward.<br />\nThe probable lineup follows: son, 23; Griffith, '25; Huey, '23 orators, house and extractor tur- Saturday, January 13, by those Pi Delta Epsilon and 0. D. K.<br />\nRelay—Welsh; R. Middleton, Hooper, '24; Rich, '23; McDaniel, bines, economizers and steam and students taking the materials of<br />\ntuhrer, Coady or Lord.<br />\n'24; Bonner, '24; Kelly, '23;.Ma-' electrically driven auxiliaries in construction course. The men left<br />\n100-yard Swim — Buhrer, R. gill, \"25;' Wilbur, '23; Kennedy, general, both with regard to their Light and Redwood streets at 9<br />\nAll military equipment<br />\nMiddleton<br />\n'24; Dean, '24. There are thirty-. influence upon plant efficiency A. M. Prof. W. B. Kowenhoven,<br />\nshould be turned into the of220-yard Swim—Coady, Lord. one members of the society now at upon flexibility and convenience of the department of mechanical<br />\nfice at once.<br />\nengineering, conducted the party.<br />\nin operation..<br />\nContinued on page 4, col. 5<br />\nContinued on page 4, col. 2<br />\n<br />\n1<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1923<br />\n<br />\n2<br />\n<br />\nThe Johns<br />\n<br />\nHopkins News-Letter<br />\nFOUNDED 1897.<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANand other communications<br />\n<br />\nAGER, JOHNS HoPKINS UNIVERSITY; all articles<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nHomewood 100<br />\n<br />\nTelephone<br />\n<br />\nBusiness Manager:<br />\n<br />\nEditor-in-Chief:<br />\nH. MOORE, JR., '23.<br />\n<br />\nWILLIAM<br />\n<br />\nGLOVER<br />\n<br />\nManaging Editor:<br />\nJ.<br />\n<br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLL '24.<br />\n<br />\nCirculation Manager:<br />\nPHILIP W. HOWARD, '25.<br />\n<br />\nAssociate Editors<br />\n<br />\nJunior Editors:<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br />\nW. EDWARD THOMSEN, '26.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nERNEST A. STRATHMAN, '26.<br />\n<br />\nFALLON, '23.<br />\n<br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN,'23.<br />\n<br />\nHUDSON HUFFARD, '23.<br />\n<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br />\n<br />\nP.<br />\n<br />\nC. WARWICK PERKINS MAKING GOOD ON STAFF _OF<br />\n\"BALTIMORE NEWS\"<br />\nFormer Managing Editor of<br />\n\"News-Letter\" Progressing<br />\nRapidly in Journalism<br />\nEver since C. Warwick Perkins,<br />\nJr., took his degree of Bachelor of<br />\nArts in June, 1921, he has been<br />\nworking as a reporter on the staff<br />\nof the Baltimore News. Perkins<br />\nwas Junior Editor of the NEWSLETTER in 1920, and Managing Editor in his last year. He served in<br />\nthe Student Army Training Corps,<br />\nwas chairman of the Senior Prom<br />\nCommittee, and was on the Class<br />\nPin Committee. Perkins was on<br />\nthe first Black and Blue Jay Staff,<br />\nand was a member of both the Literary Club and the Social Science<br />\nClub.<br />\n<br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nFITZGERALD DUNNING, '24.<br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIEsKE, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN C. LEWIS, JR., '23<br />\nJOHN T. DIxON, '24.<br />\nA. J. McKAY, '26.<br />\n<br />\nSts., Baltimore, Md.<br />\nPrinted by The Read-Taylor Co., Lombard and South<br />\n<br />\nLIMITATION OF ACTIVITIES<br />\ncampus<br />\nWhile there is so much discussion about the Hopkins<br />\nwell to present<br />\nas to the limitation of student activities, it might be<br />\nan, as<br />\nPennsylvani<br />\nthe views expressed by the editor-in-chief of the<br />\nresult of an<br />\npublished in that paper last year. This opinion is the<br />\n-growing<br />\ninvestigation of conditions existing in a larger, but a rapidly<br />\nuniversity. The editorial follows:<br />\ns.<br />\nAt Pennsylvania undergraduate activities are multitudindu<br />\nthe<br />\nEvery branch of sport is represented by a team which necessitates<br />\nassistants<br />\nwork not only of the players, but of the manager and his<br />\nfully the<br />\ncover<br />\npublications<br />\nas well. No less than six undergraduate<br />\nare made<br />\nfield of journalism. College dramatics, music and forensics<br />\nmany<br />\nwhich<br />\nto<br />\ns<br />\npossible by the existence of a number of organization<br />\nAssociation servstudents devote much of their time. The Christian<br />\nothers. Such<br />\nice and class affairs command the attention of many<br />\nseem, the para diversity of activities should make possible, it would<br />\nis not, howticipation of virtually every student in some activity. This<br />\never, the case.<br />\nGlance<br />\nPick up a Class Record, any one of the last ten volumes.<br />\nand<br />\nclass<br />\ngraduating<br />\nover the pages devoted to the members of the<br />\ntheir activities. You will find that certain of these men were engaged<br />\nnone.<br />\nin several fields of activity, while the majority participated in<br />\nbest<br />\nor, at best, a single one. This situation works neither for the<br />\ntes<br />\nundergradua<br />\ninterests of the University nor of the individual<br />\nthemselves, but it is a condition that is wholly natural in the absence<br />\nof any regulations tending to govern it.<br />\nCertain men in every Freshman class demonstrate special ability<br />\nin one activity or another. Their success places them in a favored<br />\nposition in regard to other activities. They are able, in many instances, to defeat in competition,students whose abilities have not<br />\nbeen proven elsewhere. After they have acquired a degree of prominence, other responsibilities are thrust upon them. These they cand<br />\nnot well refuse, yet before long they find themselves overburdene<br />\nall,<br />\nwith activities. They cannot well afford the time required by<br />\nsuffer.<br />\nand as a result the duties which have been entrusted to them<br />\nYet, at this very time, there are hundreds of undergraduates who find<br />\nthem.<br />\nthe opportunity to participate in undergraduate affairs denied<br />\nThe undesirability of this condition has before been recognized<br />\nnumat Pennsylvania. Two years ago a limitation was placed on the<br />\nmight<br />\nstudent<br />\nsingle<br />\na<br />\nber of so-called \"major activities\" in which<br />\nengage. But such a rule regulates a very limited number of cases.<br />\nThe situation demands far-reaching legislation, the adoption of a<br />\nsystem under which versatility may be encouraged without distributing undergraduate activities. unevenly in the student. body.<br />\nA solution to this problem has been found at other universities.<br />\nwhere the same question has arisen. This solution is one of which<br />\n. . ConsidCornell and - tolumbia are now contemplating the adoption<br />\neration is now beine rlevcoted to it by the University Committee on<br />\nNon-Athletic Activities. -<br />\n<br />\nMORE TRUTH THAN POETRY<br />\nBy James J. Montague<br />\nEverybody's One of 'Em<br />\nNo longer little Micky Mare,<br />\nWhose ways are mild and meek,<br />\nWill keep my clothing in repair<br />\nFor 50 cents a week.<br />\nHe now demands a larger sum,<br />\nWhich I esteem too dear,<br />\nFor lately Michael has become<br />\nA Pressing Engineer.<br />\nThe days when Tonio Dorio<br />\nWould clip and trim my lawn<br />\nAnd make my kitchen garden<br />\ngrow<br />\nFor ten a month are gone.<br />\nHe now is making wads of pelf,<br />\nTakes contracts by the year,<br />\nAnd, on his billheads styles himself<br />\nA Mowing Engineer.<br />\nThe lads from Greece who cleaned<br />\n.my shoes<br />\nOnce in a cheaper time,<br />\nNow with a haughty scowl refuse<br />\nMy little proffered dime.<br />\nOne sees them by appointment<br />\nnow,<br />\nThey're risen, it appears,<br />\nAnd have become, so they avow,<br />\nShoe Surface Engineers.<br />\n<br />\nCHRISTIAN SERVICE CLUB<br />\nOld 'Rastus Johnson comes no<br />\nStrictly business was the order<br />\nmore<br />\nof the meeting of the Christian<br />\nTo take the cans away,<br />\nService Club held last Tuesday<br />\nOr knocks upon the kitchen door<br />\nnight at the home of Mr. Wilbur<br />\nTo seek his weekly pay.<br />\nF. Wheeler. It was decided to<br />\nHe's found a means of getting his<br />\nmake an entirely new constituThe dusky profiteer—<br />\ntion and disregard the old one.<br />\nHis card informs me that he is<br />\nMr. Sylvester was appointed a<br />\nA Garbage Engineer.<br />\ncommittee of one to find out how<br />\nmuch the Christian Service Club<br />\nUnchivalrous!<br />\ncan send to Pearce Hayes, a Fresh Primus—What would you<br />\nMethodist missionary in China. do if the girl on whom you were<br />\nMr. Hayes, general secretary of calling said that she never wanted<br />\nthe Y. M. C. A. at Hopkins, a few to see you again?<br />\nyears ago, needs funds to carry<br />\nFresh Secundus—I'd jump to my<br />\non the Red Cross work that he feet and leave.<br />\nhas been doing in addition to his<br />\nFresh Primus—And let her fall<br />\nmissionary duties.<br />\nto the floor ?—Lyre.<br />\nBecause of the approaching examinations, meetings have been<br />\nA Co-ed Speaks<br />\ncancelled for the month of Jan- \"The lives of great men all remind<br />\n'us<br />\nuary. The next regular meeting<br />\nthere are some other gumps<br />\nThat<br />\nof the club, will be held on Febonly hoofprints when they<br />\nWhose<br />\nruary 13. During the month of<br />\nus<br />\nleave<br />\nFebruary the club expects to have<br />\nthose<br />\nupon our dancing<br />\nAre<br />\nas its speaker some of the promipumps.\"<br />\n—Lemon Punch<br />\nnent ministers of the city.<br />\n<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\n<br />\nBALTIMORE, MD., JANUARY 16, 1923<br />\n<br />\nSTUDENT ACTIVMES COUNCIL AGAIN DISAPPROVES<br />\nOF LITERARY PAPER<br />\nThe Student Activities Council<br />\nis opposed to the establishment of<br />\nthe proposed literary magazine at<br />\nJohns Hopkins. This feeling is evidenced by the action of the council at a meeting held last Thursday at 11.30 A. M. in room 104 of<br />\nthe M. E. Building when the proposal for a literary magaz:ne was<br />\nreconsidered. The council unanimously decided to approve the<br />\nresolution of Pi Delta Epsilon,<br />\nhonorary journalistic fraternity,<br />\nregarding the magazine. This resolution was published in one of<br />\nthe recent issues of the News-Letter.<br />\nIt was also decided at the meeting that in the future Varsity<br />\nSeals will be awarded twice each<br />\nscholastic year instead of once in<br />\nthe fall as has been the custom<br />\nformerly. Awards will be made<br />\nin the future both in the spring<br />\nand in the fall.<br />\nAt the same meeting of the<br />\ncouncil a Varsity Seal was<br />\nawarded to Mr. T. R. Ball, the<br />\nregistrar.<br />\n<br />\nDuring his first three weeks on<br />\nthe News staff, Perkins attended<br />\nto the routine work which falls to<br />\nthe lot of a cub reporter. He reported the cases that come before<br />\na district police station, and was<br />\nsent out on similar assignments of<br />\na minor nature.<br />\nThe nature of his work after this<br />\nshort period of apprenticeship<br />\nshows the rapidity of his progress.<br />\nOne of his first special assignments<br />\nwas to cover the Gibson Island<br />\nreal estate project which attracted<br />\na great deal of attention over a year<br />\nago. This work was done in conjunction with other reporters.<br />\nDuring the past year he has been<br />\nassigned, alone or with other men,<br />\nto cover meetings and events of<br />\nmore than usual importance. Perkins reported the Bankers' Convention at Atlantic City in the spring<br />\nof 1922, and worked on the big<br />\nrailroad strike which occurred last<br />\nsummer. At different times he has<br />\nhad charge of city hall and shipping news. At present he is reporting the work of the state offices,<br />\nparticularly that of the Public Service Commission in connection with<br />\nthe dispute over the fixing of the •<br />\namount to be charged by the United •<br />\nRailways for fare.<br />\nII<br />\nPerkins is interested in his work<br />\n11<br />\nand gives promise of further suc-.<br />\ncess. He is one of several former<br />\nNEWS-LETTER men who have been<br />\nsuccessful in newspaper work.<br />\n<br />\naaaaaaaaaaaaaaaaaaa<br />\n<br />\n•<br />\n• Why<br />\nYoung Men Should<br />\n•<br />\n• Consider Insurance Selling<br />\n<br />\nCANE CLUB TO HOLD \"TAPPINGS\" AFTER EXAMS<br />\nAfter a period of comparative<br />\ninactivity the Johns Hopkins Cane<br />\nClub is going to reorganize. A<br />\nmeeting has been called to make<br />\nplans for the coming year. It was<br />\ndecided that the mystic \"tappings\"<br />\nwill be held shortly after the midyear examinations.<br />\nThe Cane Club was organized<br />\nin 1921 for social purposes. Its<br />\nmembership is elective and is limited. The insignia is a small gold<br />\ncane that is worn on the watch<br />\nchain. This year a new requirement for election to the club<br />\nmust be fulfilled, namely, that the<br />\ncandidates must be in some activity on the campus.<br />\n<br />\nSeven Reasons for Life Insurance Career<br />\n<br />\nLIFE INSURANCE is founded on<br />\n<br />\nthe<br />\n<br />\nhighest ideals.<br />\n<br />\na<br />\n<br />\nIt is capable of yielding a good income and the<br />\nsatisfaction of accomplishment.<br />\n<br />\n•<br />\n<br />\nIt offers opportunities for real leadership.<br />\nIt brings insurance salesmen in close association with big business and big business men.<br />\n<br />\n1111<br />\n•<br />\n<br />\nrequires education in business methods,<br />\nlaw and finance.<br />\n<br />\nIt<br />\n<br />\nIt is a field for workers, not shirkers.<br />\nIt is an alluring and practical calling for men<br />\nof dynamic energy.<br />\n<br />\nLIFE INSURANCE COMPANY<br />\nOF<br />\n<br />\n•<br />\n•<br />\n•<br />\n<br />\nBOSTON. MASSACHUSETTS<br />\n<br />\n11111111111111111111111111111111111111111111111111111<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1923<br />\n<br />\nRY<br />\n<br />\nek,<br />\n,air<br />\n<br />\nwn<br />\nlen<br />\n<br />\n3<br />\n<br />\nNIGHT COURSES IN MILITARY<br />\nTHE NEWS LETTER'S<br />\nAFRICAN NATIVES UNABLE<br />\nSCIENCE TO BEGIN WEDMAILBAG<br />\nTO MARRY WITHOUT TRANESDAY NIGHT<br />\nDITIONAL ADORNMENT<br />\nA Column in Which the Correspondents Organization Meeting Held on<br />\nAre Allowed Latitude, But ShoulDr. Shattuck Gives Interesting<br />\nJanuary 10. Thirty-eight Studer the Responsibility.<br />\ndents Enrolled<br />\nExperiAccount of African<br />\nLast<br />\nDances<br />\nWednesday night, January<br />\nences. Imitates Native<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nthe<br />\n10,<br />\nmeeting for the organizaWARNER & COMPANY<br />\nregular letter size paper, on one side<br />\nNo male native in Africa has a<br />\nonly.<br />\ntion<br />\nof<br />\nin<br />\nnight<br />\nmilitary '<br />\n'classes<br />\nchancc to marry unless he is<br />\nHATTERS<br />\nTtup<br />\nNo attention will be paid to anony<br />\nbut names signed as an science was held. The courses will<br />\nletters,<br />\nmous<br />\nmanner,<br />\ntraditional<br />\nthe<br />\nin<br />\nadorned<br />\n222 W. BALTIMORE ST.<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be be conducted by members of the<br />\naccording to Dr. George B. Shatomitted.<br />\nHopkins Military Department in the<br />\ngeolof<br />\nprofessor<br />\ntuck, formerly<br />\nThe publication of a letter is not to<br />\nindorsement of its views university buildings, and will be<br />\nan<br />\nas<br />\ntaken<br />\nbe<br />\nwho<br />\nVassar,<br />\nogy at Hopkins and<br />\nby the \"News-Letter,\" which invites the<br />\nThey are open to members<br />\nfreest discussion of matters of general free.<br />\naddressed the assembly last Thursinterest.<br />\nHERE are such things as -family traits\" in clothes.<br />\nof<br />\nthe<br />\nNational Guard, Reserved<br />\nteeth<br />\nday. The natives chip their<br />\nA Stein-Bloch suit and a Stein-Bloch overcoat are<br />\nOfficers, and men who have had<br />\nto make them pointed, and somea<br />\nperfectly<br />\nnatural combination because both were born<br />\ntraining in one of the Citizens' Miltimes dig out six front teeth in<br />\nSUGGESTION TO THE<br />\nof a single conception of honor in craftsmanship.<br />\nitary Training Camps. The object<br />\nthe lower row. To product the deFACULTY<br />\nFor Stein-Bloch models collegians go to Hamof the courses is to give the techsired effects, the natives scarify<br />\nburgers'—there's No Other Place to Go,<br />\nDecember 26, 1922.<br />\nnical instruction the men will need<br />\ntheir bodies until they are covered<br />\nof<br />\nthe<br />\nTo<br />\nEditor<br />\nthe<br />\nNEWS-LETTER,<br />\nif<br />\nthey wish to take examinations<br />\nwith scars and tumors. The more<br />\nadvancement.<br />\nfor<br />\nJohns Hopkins University.<br />\nscarred a man is, the more of a<br />\nThe<br />\nthirty-eight men that atcut-up he is among the ladies.<br />\nDear Sir: Owing to the present<br />\nthe<br />\nmeeting are divided into<br />\ntended<br />\nThe speaker went on with an ac- importance of the radio phone in<br />\nclasses in the following subjects:<br />\ncount of the native practice of America today, we would suggest<br />\n(Y. M. B. 0. D.)<br />\n\"medicine\" in Africa. If a man is that a radio broadcasting station be Military Map Reading and Sketching (Captain Atwater), 20; Milisick, the \"medicine man\" of the installed at Homewood. Such a<br />\nBaltimore and Hanover<br />\nLaw (Captain Paul), 1; Matary<br />\ndistrict is summoned, goes through movement would be in step with<br />\nchine Guns (Captain McMurray),<br />\na formal performance of his magic, the actions of other leading univerTactics (Captain McMurray),<br />\n4;<br />\nand invariably pronounces the case sities. Already debates have been<br />\n11;<br />\nAdministration<br />\n(Sergeant<br />\nincurable. Then, because the na- carried on between universities<br />\nAll<br />\n2.<br />\nthe<br />\nHouton),<br />\nwill<br />\ncourses<br />\ntives are absolutely certain that through the medium of the ether.<br />\nextend<br />\na<br />\nover<br />\nperiod<br />\nten<br />\nof<br />\nweeks,<br />\nMUSICAL INSTRUMENTS OF ALL KINDS<br />\neveryone who touches -a dead body There would be news, events and<br />\ntwo hours weekly, except the course<br />\n11 N. HOWARD ST.—Near Baltimore St.<br />\ncarry<br />\nthey<br />\nafter<br />\nto<br />\nimportance<br />\nimmediately<br />\nof<br />\nitems<br />\nothers<br />\ndies<br />\nin administration, which will be<br />\nWe represent the most famous makers, as C. G. Conn, Bacon,<br />\njungle<br />\nthe<br />\nto<br />\nalive,<br />\nof<br />\nstill<br />\nresults<br />\ngames,<br />\nman,<br />\nas<br />\nthe<br />\nbroadcast, such<br />\nVega, Leo Master, Etc.<br />\ngiven for five weeks, two hours<br />\nWE SELL ON CREDIT<br />\nat night, the hyenas complete the music by our band, orchestra, and<br />\nweekly. The classes will be held<br />\n\"burial\" service.<br />\nglee club; educational lectures by<br />\nevery Wednesday evening, beginDr. Shatuck spoke at length the faculty and others. This would ning jarmary 17. No one can enter Phone, Homewood 2934<br />\nabout a typical night on the plains, be a very good method to make our any of the classes after the first UNIVERSITY TAILORING<br />\nCleaning, Dyeing, Pressing &<br />\nwhere lions and other big game Alma Mater more popular and bet- meeting has been held, and no regRepairing<br />\nhelp<br />\nconsidwould<br />\nand<br />\naccount<br />\nter<br />\nknown,<br />\nvivid<br />\na<br />\ngave<br />\nHe<br />\nabound.<br />\n100 WEST 27th ST.<br />\nular students at Hopkins will be alMEN'S SHOES<br />\nCor. Maryland Avenue<br />\nof the danger from lions, described erably to boost athletics and social lowed to take the courses. Other S. Hofkin,<br />\nProp.<br />\nBaltimore, Md.<br />\nOf the Better Class<br />\nthem and their far-carrying, dis- events. The university has some subjects were offered the men, but<br />\na<br />\nfor<br />\nequipment<br />\nnecessary<br />\ntheir<br />\nthe<br />\nof<br />\nof<br />\ntold<br />\ntinctive roar, and<br />\nnone were elected. Because of the<br />\nmethods of attacking zebras, other broadcasting station, and also com- conflict in time in Captain McMurgame, and men. Dr. Shatuck told petent men who are qualified to ray's classes, it may be necessary<br />\nCLEANING, PRESSING<br />\nURNER BROTHERS<br />\nalso of how he had filmed a charg- operate such a station. We are to hold one of the classes on anREPAIRING<br />\n111<br />\nE. BALTIMORE STREET<br />\nwill<br />\na<br />\nsuch<br />\nmovement<br />\nthat<br />\ning lion and the natives' defense positive<br />\n2601 OAK ST.<br />\nother evening.<br />\nBALTIMORE<br />\nstuagainst ithe beast. He then spoke meet with approval from the<br />\nThe courses have the approval<br />\nof the hunting of elephants, which dents and friends of the university, and support of Dr. Goodnow, who<br />\nhe called the most dangerous beasts in fact, it would be welcomed by proposed the holding of them to<br />\nin the jungle. He related the ad- them.<br />\nTHE PLACE TO BUY<br />\nThousands of Motorists<br />\nMajor Gen. Muir, Commander of<br />\nJ. J. DAVIDSON,<br />\nventure of an inexperienced huntCIGARS<br />\nSODA<br />\nCANDY<br />\nThroughout The Year<br />\nthe Third Corps Area. The<br />\nJ. T. FETSCH.<br />\ner, who was badly shaken up and<br />\nS. E. Cor. OAK & 27th ST.<br />\nEnjoy Their Favorite<br />\nprogress of the classes will be<br />\nbruised by a kick of his gun when<br />\nwatched with interest by those<br />\n\"WE CLEAN 'EM CLEAN AND PUT A<br />\nhe killed a charging rhinoceros.<br />\nCREASE THAT STAYS PUT<br />\nimmediately concerned. Major<br />\nANENT THE NEW<br />\n\"a<br />\nAsk Tom LandY<br />\nwanted<br />\nhad<br />\nThe young man<br />\non<br />\nGarey will deliver a lecture<br />\nFree Auto Service<br />\n8 Branches<br />\nMAGAZINE<br />\nnever<br />\nwould<br />\nhunting experience fie<br />\nthe<br />\nRifle<br />\nbefore<br />\nMarksmanship<br />\n&<br />\nBALDWIN<br />\nBRADY<br />\nTo the Editor of the NEWS-LETTER.<br />\nforget\"—he got it.<br />\nMaryland Rifle Association. He<br />\nCleaning, Dyeing, Pressing<br />\n\"The Wonder Motor Fuel\"<br />\nThe explorer described the Dear Sir:<br />\n4032 ROLAND AVE.<br />\nwill explain the technical side of<br />\nMain Store—Tuxedo 2148<br />\nSHERWOOD BROTHERS, Inc.<br />\ndances of the natives and gave adWhy all the fuss about an un- quick and accurate shooting.<br />\nLeave Garments with Lamly or Phone Us<br />\nnative<br />\nfew<br />\na<br />\nof<br />\nimitations<br />\nmirable<br />\ndergraduate literary publication<br />\nTHE MYSTIC THREE<br />\n\"steps.\" He described also the at Homewood?<br />\nThere are three words, the sweetwith<br />\nbribed<br />\nwhen<br />\npygmies, who,<br />\nIt seems to me that in view of<br />\nest words<br />\nsalt, went through their paces be- the fact that the three ruling stuthe human speech—<br />\nall<br />\nIn<br />\nspeaker's<br />\nThe<br />\nand individuality is offered here at prices that are not<br />\nfore his camera.<br />\norganizations, the Omicron More sweet than all songs of birds,<br />\ndent<br />\nand cannot be underquoted by any house at any time.<br />\nconcluding story was about a Delta Kappa, the Student Council<br />\nor pages poets preach.<br />\nBesides the reputation of an old-established firm<br />\nyoung native who, after participat- and the Student Activities Counmay be a vale of tears,<br />\nlife<br />\nThis<br />\nis back of each sale with a guarantee.<br />\ning in a party where the liquid re- cil, have officially announced<br />\nA sad and dreary thing—<br />\nfreshments had a powerful kick, their disapproval of such a prewords and trouble disappears<br />\nThree<br />\nfell asleep on his way home. A carious undertaking, it is perfectbirds begin to sing.<br />\nAnd<br />\nFURNITURE<br />\n.DECORATIONS<br />\nDRAPERIES<br />\npython had swallowed one of his ly clear that the undergraduates<br />\nwords and all the roses<br />\nThree<br />\n343<br />\nhis<br />\nNORTH<br />\nto<br />\nCHARLES<br />\ncame<br />\nSTREET<br />\ncompanion<br />\na<br />\nwhen<br />\nlegs<br />\nfeel neither the need nor the debloom,<br />\nrescue. The native had the most sire for such a publication.<br />\nThe<br />\nsun begins to shine.<br />\n\"beautiful\" scarifications in Africa<br />\naspirliterary<br />\nThree<br />\nthe<br />\nwords will dissipate the<br />\nshould<br />\nWhy<br />\nas the result of his adventure.<br />\ngloom<br />\nbe so dense? These literary<br />\nants<br />\nDr. Shattuck kept his audience<br />\nAnd water turn to wine.<br />\ngeniuses (?) should come out of<br />\ninterested through his speech. He<br />\nbeen<br />\nhave<br />\nthey<br />\nwhither<br />\nThree<br />\nwords and trouble disapthe ether<br />\nwas dressed in the garb of a hunter summoned by the nine muses,<br />\npears days<br />\nand had with him many articles<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nand standing upon a perfectly ra- \"I love you?\" Wrong, by heck!<br />\nof native use. His frequent imitational and human basis should It is another, sweeter phrase,<br />\nTelephone, Vernon 3442<br />\nOrchestra—Dancing<br />\ntions were particularly amusing. realize that their work stands on<br />\n\"Enclosed—find—check.\"<br />\n3.30<br />\nto<br />\nP.<br />\n5.30<br />\nM. and 6 to 8 P. M.<br />\nappretheir<br />\nshowed<br />\nThose present<br />\nan illogical and unsound footing.<br />\n—Brown Jug.<br />\nTABLE<br />\nD'HOTE<br />\nhim<br />\nurging<br />\nciation of his lecture by<br />\nLUNCHEON-60c<br />\nDINNER—$1.00<br />\nIf they wish to make their pubto continue over the regular period,<br />\nTheir First Visit<br />\nSUNDAY<br />\nD1NNER—$1.25<br />\npersonFreshman's Parents—Is this<br />\nand many stayed behind to see his lication an individual and<br />\nIf, where Robert Jones lives?<br />\ngood.<br />\nvery<br />\nundertaking,<br />\n-11<br />\ncollections of souvenirs.<br />\nhowever, they are planning to inIrate Landlady—Yes, bring him<br />\nSherwood spoke of a problem in<br />\nthe name of Hopkins they •n.—Tiger.<br />\nvolve<br />\nhonor<br />\nthe<br />\nof<br />\nviolations<br />\nregard to<br />\nare stepping beyond their limits<br />\nsystem, and expressed his regret<br />\nYours for the good name Hop<br />\nYOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nthat such a serious condition should<br />\nkins,<br />\ndebate<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nexist. The Junior-Senior<br />\nUNDERGRADUATE<br />\nwill be held on January 20. Tags<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nwere sold for the benefit of June<br />\nsembly after that will be given over<br />\nWeek.<br />\nto the discussion of the honor sysLaDean<br />\nAt thetnext assembly,<br />\n1724 N. CHARLES ST.<br />\nEvery student is expected to<br />\ntem.<br />\n-months'<br />\ntane will speak on his two<br />\nSTAFF<br />\nPITY<br />\nTHE<br />\n10 Minutes from Hopkins<br />\nVernon 3055<br />\ntour to South America. The as- attend.<br />\n<br />\nThe \"COLLEGIAN\"<br />\n<br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n.50<br />\n<br />\nT<br />\n<br />\n- ninecr% Y4o-t/4.4<br />\n14a<br />\n<br />\nLed<br />\n<br />\ntse<br />\n<br />\n:nt<br />\n<br />\nv,<br />\n<br />\nno<br />\n<br />\nor<br />\n<br />\ntis<br />\n<br />\non<br />\n!re<br />\ned<br />\n<br />\nfly<br />\n<br />\nall<br />\n<br />\nid<br />\n<br />\nPS<br />\n<br />\ney<br />\n<br />\nig<br />\n<br />\nA. BURDWISE<br />\n<br />\nURNER'S<br />\n<br />\nSCOTT---The Tailor<br />\n<br />\nNICK DIETOR<br />\n<br />\n11<br />\n<br />\nFURNITURE OF QUALITY<br />\nti<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\nCHANTILLY<br />\nRestaurant Francais<br />\n<br />\nRADIO!!<br />\n<br />\nRADIO SUPPLY CO.<br />\n<br />\n\fTHE JOHNS HOPKINS NI. WS-LETTER, JANUARY 16, 1923<br />\n<br />\n4<br />\n<br />\nARRANGEMENTS FOR INDOOR MEET COMING<br />\nThe Medical Standard Book Co.<br />\nTO HEAD<br />\n(THE BOOK MART)<br />\nArrangements for the Johns<br />\nHopkins-Fifth Regiment Indoor<br />\nComplete Stock of<br />\nMedical Books and College<br />\nGames, to be held at the Fifth RegRequisites<br />\niment Armory the evening of SatImporters and Dealers in Fine Books<br />\nurday, February 4th, are coming<br />\nto a head, and indications point to<br />\n301 N. CHARLES ST.<br />\nsuccessful meet. Inquiries are<br />\na<br />\nBaltimore, Md.<br />\npouring in from all over the country. Colleges as far north as University of Maine and Massachusetts<br />\nInstitute of Technology, and as far<br />\nMANUFACTURING JEWELERS<br />\nLancaster, Pa.<br />\nsouth as Georgia Tech are numberClass Rings, Pins, Fraternity Pins,<br />\ned among the inquirers.<br />\nCups, Medals, Etc.<br />\nA special mile relay feature beStationery, Invitations, Programmes<br />\n\"Makers of the Varsity Seals\"<br />\ntween Virginia, Navy and Princeton is taking shape. Secretary KirSTRATTON SHIRT MAKER<br />\nwan, of the Games Committee, ex226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00 pects signed application in the<br />\n$3.25 and $4.25<br />\nNegligee<br />\nImported Madras<br />\n$5.25 and $6.25 near future. A relay race beTerms Cash, Less 10% 30 Days on tween Episcopal High School, of<br />\nShirts<br />\nAlexandria, Va., and Mercersburg<br />\nAlso a Full Line of Men's<br />\nAcademy, of Mercersburg, Pa., is<br />\nFurnishings<br />\npossible as one of the prep star<br />\nattractions.<br />\nFine Clothes<br />\nDr. Ray Van Orman, Director<br />\nA suit by Lemmert gives the final<br />\nof<br />\nAthletics, has 'announced that<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable publicity for the meet will be given<br />\ncloths cut in authentic fashionwhether for every-day wear or more out shortly by the radio broadcastfestive occasions.<br />\ning station W-E-A-R of the Baltimore News and American. This<br />\nLEMMERT<br />\nat<br />\nwill mark a new effort to procure<br />\n19 Fayette Street, East<br />\npublicity for Hopkins. The meet<br />\nBusiness Suits<br />\nDress Clothes in this way will be made known to<br />\nall radio fans in this part of the<br />\nOvercoats<br />\nSport Togs<br />\ncountry, and will probably stimulate<br />\na good amount of interest. ArSHIRTS<br />\nNECKWEAR<br />\nrangements for publicity by radio<br />\nwere made several weeks ago by<br />\nthe Publicity Board.<br />\n421 N. HOWARD ST.<br />\n<br />\nJ. F. Apple Co.<br />\n<br />\nBLACK AND BLUE JAY<br />\nDEFICIT CUT<br />\nThe Business staff of the Black<br />\nand Blue Jay makes the following financial report, showing that<br />\nthe deficit of approximately $400<br />\nconfronting the staff at the beginning of the scholastic year had<br />\nbeen cut to $118.09.<br />\nASSETS<br />\nCash from<br />\nAdvertising 1922-23....<br />\nAdvertising 1921-22<br />\nStudent Act. Fees<br />\nFirst two issues<br />\nLast four issues<br />\nSubscriptions<br />\nCash sales<br />\nOutstanding billsAdvertising<br />\nCirculation (approx.)<br />\n<br />\nBANK WITH<br />\n<br />\nSecurity Storage & Trust Co.<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\nAS YOU WISH<br />\nHENRY S. KING, President<br />\n<br />\n$195.00<br />\n114.31<br />\n225.54<br />\n451.08<br />\n19.50<br />\n55.33<br />\n472.00<br />\n330.00<br />\n<br />\nTotal assets<br />\n$1,862.76<br />\nLIABILITIES<br />\nCash disbursed for<br />\nRead-Taylor for 1921-22<br />\ndeficit<br />\n$400.00<br />\nRead-Taylor printing<br />\n494.00<br />\nNews-Letter loan for<br />\n1921-22 deficit<br />\n89.25<br />\nMiscellaneous<br />\n67.94<br />\nBillhead printing<br />\n3.30<br />\nOutstanding bills.<br />\nRead-Taylor, printing<br />\n223.00<br />\nCluett Peabody cover<br />\nstock<br />\n7.46<br />\nPostage 1921-22<br />\n14.91<br />\nPostage 1922-23<br />\n38.94<br />\nEngraving on cover<br />\n40.96<br />\n<br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br />\n<br />\nHOCHSCHILD,KOHN &Co.<br />\n<br />\nElynson, Westcott and Dunning<br />\nPRESCRIPTION DRUGGISTS<br />\nTWO STORES:<br />\nCharles and Chase Sts.<br />\nEutaw Place and North Ave.<br />\nVernon 0890<br />\nMadison 0405<br />\n<br />\nELECTRICAL CLUB HOLDS<br />\nMEETING<br />\n4<br />\n41<br />\nmain<br />\nThe<br />\nspeaker at the last<br />\n41<br />\nmeeting of the Johns Hopkins<br />\n0<br />\nElectrical Club held last Friday, 41<br />\n41<br />\nJanuary 12, was Mr. Thomas L. 4<br />\nBeery. The subject of his address<br />\nOver one hundred years<br />\nwas \"Permeameters.\" The lecture > of designing and creating<br />\nSilverware assures the purTotal liabilities<br />\n$1,379.76 was attended by many engineerchaser of Kirk pieces in<br />\ning students, particularly those<br />\nsilver absolute certainty of<br />\nNet Profit<br />\n$483.00 taking the electrical course.<br />\nsuperiority.<br />\nIn the attached statement must<br />\nHOSIERY<br />\nbe taken into account the fact TAG DAY ANNOUNCEMENT<br />\nJUNIOR CLASS TO HOLD<br />\nGLOVES<br />\nThursday, January 11, 1923, was<br />\nPROM<br />\nthat the Student Activity fees and<br />\ndesignated<br />\nas the third \"Tag Day'<br />\n41<br />\nAt a meeting of the Junior bills collectable from circulation<br />\n41<br />\nEstablished 1873<br />\nof<br />\nthe<br />\nyear<br />\nat the university.<br />\n41<br />\nclass held Wednesday, January should be apportioned over the en41<br />\nDue to more publicity \"Tag<br />\n41<br />\n10,<br />\nwere<br />\npreparations<br />\nfor<br />\nmade<br />\ntire six issues. Deducting oneFetting Man'fg Jewelry Co.<br />\n0<br />\nthe Junior Prom to be held about third of these amounts to cover Day\" proved a better success than<br />\nManufacturers<br />\nBaltimore, Md.<br />\nthe middle of February. President the first two issues it is seen that any of the preceding ones.<br />\n41<br />\nGreek Letter Fraternity Jewelry<br />\nProfessors, professor's secre41<br />\nBonner appointed a prom com- $670.08 is left to cover the other<br />\n41<br />\nOldest Silversmiths in America 41<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nmittee consisting of Kennedy, four issues. Deducting the net taries and \"co-eds\" alike dished<br />\n41<br />\n41<br />\nchairman G. M. Shriver, Deavour, gain of $483.00 from $671.08, it is out the cash for the honor of 03<br />\n4<br />\nEstablished in 1817<br />\nwearing<br />\na<br />\ntag.<br />\n;<br />\nLeopold, Mount, Gardner and seen that the deficit at the present<br />\nBill Meyers, invincible salesDunning. The whole undergrad- time has been cut to $188.08, havman, after scouring Gilman Hall<br />\nuate school will be extended an ing been originally about $400.<br />\nturned in over $18 as the result<br />\ninvitation to the dance, which<br />\nof sales. Among his purchasers<br />\nSHOES<br />\nSALT AND PEPPER<br />\npromises to be an elaborate afDrs.<br />\nGilpin,<br />\nwere<br />\nMuller,<br />\nBliss,<br />\nA<br />\nsoldier<br />\nhome<br />\non<br />\nwas<br />\ntryleave<br />\nfair.<br />\nfor<br />\nAn appeal was made by the ing to give his friends an idea of Waterfall, Lee, Christie, Pullen,<br />\nUNIVERSITY<br />\nMEN<br />\nibeXatterie<br />\nv<br />\nCl<br />\ntreasurer for class dues. He an- the amount of mud in the trenches. Bright and Thompson.<br />\n-1`18 H.Sc OSCAR G.L5<br />\nThere .still seems to be some For Dress<br />\nFor Sport Wear<br />\n\"One day,\" he stated, \"I dropped<br />\nnounced that the class is in<br />\nOWNERS<br />\nmisunderstanding<br />\namong<br />\ncertain<br />\nmy<br />\ncap,<br />\nwhich<br />\ndisappeared<br />\nin<br />\nthe<br />\ndebt to the Hullabaloo for the picSmart Styles-Best Leathers<br />\n4dt<br />\n'<br />\ni'DE*.. egg rilfr:°<br />\nmud. I was floundering about look- students as to the purpose of<br />\nture<br />\ntaken<br />\nlast<br />\nyear<br />\nand<br />\nasked<br />\n29 Baltimore St., Ettst<br />\nModerate Price.:<br />\nthat dues be paid as soon as pos- ing for it when a voice cried, 'Hi! Tag Day. For their benefit<br />\nOne Door West of Ligbi St.<br />\nLook out, you're standing on my Treasurer Hensel of the June<br />\nSOLE AGENTS FOR BALTIMORE sible.<br />\nWeek Committee explains that for<br />\nFor College Fraternity Bands<br />\nA general class discussion fol- hand.'<br />\n(Greek Letter Societies)<br />\nlowed. It was pointed out that the \"What do you want to lie about the first time in the history of the<br />\n19 W. LEXINGTON ST.<br />\nuniversity there will be a June<br />\nclass meetings had been attended there for ?\" I asked.<br />\n\"'Lie about be hanged,' was the Week. This will consist of a numvery poorly thus far this year<br />\nber of dances and other amuseShe laid the still white form beand each man was asked to help reply, 'I'm driving a transport.'\"<br />\nPrinters of Philological and<br />\nments which will require a great side those that had<br />\nout in this matter.<br />\ngone before.<br />\nScientific Works<br />\nFlat Tire<br />\ndeal of money. In order to lessen No groan, no sigh,<br />\nburst<br />\nfrom her.<br />\nHe-The tunnel we just passed the price of these things during<br />\n23 S. HANOVER ST.<br />\nSWIMMING TEAM TO MEET<br />\nSuddenly she let forth a cry that<br />\nSWARTHMORE AT B. A. C.<br />\nthrough cost a million dollars.<br />\nBaltimore, Md.<br />\nJune Week tags are sold through- pierced the still<br />\nnight air, making<br />\nContinued from page 1.<br />\nFair One-It was an absolute out the year on certain designated<br />\nit vibrate into a thousand echoes.<br />\n50-yard Dash-Welsh and Bull- waste of money, as far as you are days for a nominal sum. In this<br />\nSARATOGA AT<br />\nIt seemed as if it came from her<br />\nconcerned.-Burr.<br />\nre<br />\nr.<br />\nway more students will be able to very soul.<br />\nLIBERTY STS.<br />\nTwice the cry was reBreast Stroke-Dunning.<br />\nenjoy the attractions of June peated, and<br />\nthen all was quiet<br />\nLUNCHEON<br />\nA man very near-sighted and Week without the cash per rata<br />\nBack Stroke-S. A. Middleton,<br />\nagain.<br />\nShe<br />\nwould<br />\nlay another egg<br />\nTEA<br />\nabout to fight a duel, insisted that being exceedingly high.<br />\nMorrell.<br />\ntomorrow.<br />\nDINNER<br />\nPlunge-Hambleton, Howard. he should stand six paces nearer<br />\nAMHERST GIVES $2,000<br />\nhis antagonist than the latter was<br />\nFancy Diving-Coady.<br />\nSPECIAL PARTIES<br />\nFELLOWSHIP<br />\nto<br />\nhim<br />\nand<br />\nthat<br />\nthey<br />\nshould<br />\nboth<br />\nHard on Her<br />\nInterest at the university is<br />\n11.30 A. M.<br />\nProf. W. H. Hamilton, secretary<br />\nfire<br />\nat<br />\nthe<br />\nsame<br />\n-Westmintime.<br />\nGirl<br />\n(in<br />\ntears)-Why conic to<br />\naroused over the meet due to the<br />\nuntil<br />\nof the fellowship committee of Amthe game drunk?<br />\nPLAZA 6987 fact that Swarthmore nosed out ster Fortnightly.<br />\n7.30 P. M.<br />\nherst College, has announced a<br />\nBrute-'S economical, m' dear.<br />\nthe Black and Blue mermen by<br />\nMr. White-\"Mose, what would memorial fellowship yielding $2,000<br />\nSee<br />\ntwo games for one ticket!one point last year in a thrilling<br />\nyou do if you received a letter a year, to be devoted to the study<br />\nLampoon.<br />\nmeet. The outcome of the meet<br />\nof sociology.<br />\nThis fellowship,<br />\nfrom the Ku Klux Klan ?\"<br />\ndepended upon the result of the<br />\nMr. Black-\"Well, sah, I'd read which is to be awarded next year,<br />\n100-yard dash in which Charlie<br />\nSIGMA CHI BETA PLEDGES 20<br />\nCommercial Photography<br />\nis open to any college or university<br />\nit on a train.\"-Tiger.<br />\nNEW MEN<br />\nFoster<br />\nCrownover<br />\nnosed<br />\nout<br />\nPhotography<br />\nCircuit<br />\ngraduate.<br />\nContinued from page 1<br />\nMorrell.<br />\nThe<br />\nSwarthmore<br />\nstar<br />\nLine!<br />\nGood<br />\nA<br />\nViews<br />\nFlash Lights<br />\nthe university.<br />\n\"I draw the line at kissing,\"<br />\nCorn?<br />\nEnlargements and the Black and Blue swimmer<br />\nGroups<br />\nShe I hear he drinks something<br />\nThe award for the most popular<br />\nSaid she with accents fine.<br />\nrounded the last lap neck and<br />\nKODAK FINISHING<br />\nawful,<br />\nman in the senior class has been<br />\nHe was a football player,<br />\nneck, Crownover touching the fin325 N. Howard St.<br />\nHe-Yeah, I tasted it.-Purple hung on the east wall of the recreaAnd so he crossed the line.<br />\nish a fraction of a second before<br />\nMt. Vernon 4999<br />\nParrot.<br />\ntion room of the Barn.<br />\n-Mugwump.<br />\nhis opponent.<br />\n<br />\nQuality<br />\n<br />\nLefranc & Ault<br />\n<br />\nSamuelKirk<br />\nand Son Co.<br />\n<br />\nWYMAN<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nW.L. Mann<br />\n<br />\nela<br />\nof<br />\non<br />\nat<br />\nbat<br />\nStz<br />\nesi<br />\ngo<br />\nSt;<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 25<br /><br />\ning<br />\nM.<br /><br />\nw0<br /><br />\net-<br /><br />\n:ar<br />\nrig<br /><br />\nDLI<br /><br />\n•<br />\n•<br /><br />\nPRICE 5 CENTS<br /><br />\nBALTIMORE, MD., JANUARY 16, 1923<br /><br />\nMR. T. R. BALL, UNIVERSITY MR. SWINDELL SPEAKS ON MEMORIAL PLANNED FOR STUDENT COUNCIL REFUSES 0. D. K. RECOMMENDS MOVING UP ANNUAL SPRING<br />\nTO SANCTION LITERARY<br />\nREGISTRAR, AWARDED<br />\nFUTURE OF HOPKINS<br />\nPOET'S BIRTHDAY ON<br />\nELECTIONS<br />\nPUBLICATION<br />\nFEBRUARY 3<br />\nVARSITY SEAL<br />\nDRAMATICS<br />\nAppreciation is Shown Oldest Liv- Expresses Hope for All Hopkins Tribute to Be Paid to Great Man. Sees No Need for Magazine. Rec- Limitation of Activities and Enrollment Suggested. Mapommends That Co-eds Should<br />\nHeld Chair Of American<br />\nProduction Next Year. Trying Registrar in<br />\nproves of New Publication<br />\nLiterature<br />\nNot Participate<br />\nouts for Purple Mask Held<br />\nCountry<br />\nThe<br />\nOmicron Delta Kappa Honmeeting<br />\nof<br />\nthe<br />\nStudent<br />\nmovement<br />\nhas<br />\nbeen<br />\nstarted<br />\nin<br />\nAt<br />\na<br />\nshouldn't<br />\nJohns<br />\nHopkins<br />\nA<br />\nMr. T. R. Ball, Registrar of this \"Why<br />\nJanuary<br />\n12,<br />\nheld<br />\nFriday,<br />\nAmerican<br />\nCouncil<br />\nclass<br />\nin<br />\nliterature<br />\nUniversity, received a signal hon- produce a show written and di- the<br />\norary Fraternity at its monthly<br />\nor last week when he was awarded rected by Hopkins men that to pay tribute to Sidney Lanier the council refused to sanction meeting recommended that electhe Varsity Seal by a unanimous would be on a par with those con- the university's own great poet, the publication of a new literary tions for the Student Council,<br />\nvote of the Student Activities ducted annually by the Princeton by holding a Lanier memorial magazine on the campus. It was<br />\nAthletic Board and all leading acCouncil. The action followed a Triangle Club?\" Such was the meeting on his birthday, February their belief, after both sides of<br />\ntivities<br />\nshould be held the first<br />\nrecommendation that Mr. Ball be question put to candidates for the 3. In former years students have the question had been presented,<br />\nshown the appreciation of the stu- Dramatic Club by Coach Walter been in the midst of their exami- that there was little desire for week in March. The recommendadent body for his years of faithful B. Swindell at the tryouts last nations, but as the day, February such a paper on the campus and tion was made because it was<br />\n3, falls on Saturday, it was that the students of the Universi- believed that the new boards and<br />\nwork at Jchns Hopkins and his in- Thursday night.<br />\nterest in student affairs.<br />\nIn his talk Mr. Swindell out- thought that such a meeting ty would not support it. It was staffs, with the help of this year's<br />\nIt is an interesting 'fact that from lined the object for which he could be arranged to perpetuate agreed that this magazine would men, would be better able to exthe point of service Mr. Ball is the thought the Dramatic Club should the memory of this immorta. be a failure without the support ercise the following year's duties.<br />\nof the student body and without An example was given in the<br />\noldest living registrar in the coun- strive. This was the producing Maryland genius.<br />\nsupport would in no way News-Letter staff. The Board of<br />\nthis<br />\nSidney t.anier's real greatness<br />\ntry. This was noted at the, last of plays - in the future, which<br />\nHopkins.<br />\nbenefit<br />\nControl is always elected in<br />\nmeeting of the Intercollegiate Reg- should be entirely the work of is now not to be doubted. His<br />\nHopkins men. Productions of this work is read and studied by colistrars held at St. Louis.<br />\nKirkley, A. Musher and Hub- March and the new board has the<br />\nMr. Ball came in under Dr. Dan- sort would draw crowds that the lege students just as the works of ner, representing the desired pub- advantage of working with the<br />\niel C. Gilman, the first president of interpretation of someone else's Bryant, Longfellow, Lowell, Poe lication, pointed out that they old men for a few months before<br />\nthis university, in 1878. This Jan- plays would not and would bring and other makers of American lit- wished to publish an all-round they assume full charge. Fallon<br />\nuary he finished his forty-fifth year to Hopkins the fame and recog- et4ry httryae reall ai.d studied. magazine which wbuid be repre- was appointed to ascertain the<br />\nof active work at the university. nition that the Princeton Trian- Maryland, and particularly Johns sentative of Hopkins journalism. sentiment of men on the campus<br />\nWith the exception of Mr. \"Bill\" gle Club enjoys. That such a Hopkins, lays real claim to kin- They were of the opinion that no in regard to this idea.<br />\nPresident 0. D. Collins, of the<br />\nsuch magazine at this time exists<br />\nStewart, of the Chemical Depart- thing is not a dream but a real ship with him.<br />\ncircle<br />\nin<br />\nthe<br />\nappointed Randolph NorUniversity<br />\nand<br />\nthat<br />\na<br />\npossibility<br />\nand<br />\nthat<br />\nHopkins<br />\nis<br />\nIn 1879 Lanier became profesment, who entered about fourteen<br />\nwood<br />\nto<br />\ntype<br />\nsucceed Thomas Landy<br />\nmagazine<br />\nof<br />\nthis<br />\nwas<br />\ncapable<br />\nof<br />\ndoing<br />\nneeded.<br />\nas well as any sor of English literature at Hopmonths ahead of Mr. Ball, he has<br />\nas<br />\nbusiness<br />\nmanager of the 0. D.<br />\namateur<br />\nstage body were the con- kins. Up to that time he was con- Fallon, president of Student Acbeen connected with Hopkins lonK.<br />\nSong<br />\nBook.<br />\nThis book was<br />\ncluding thoughts in Mr. Swindell's nected with the Peabody Sym- tivities Council, the president of<br />\nger than any other man.<br />\ncompiled<br />\nlast year by Douglas<br />\nphony Orchestra, where his abili- 0.D.K., and Fenneman, president<br />\nThe most outstanding quality of talk.<br />\nFollowing this speech tryouts ty as a player of the flute was rec- of Pi Delta Epsilon, presented the Coulter, '21. H. Douglas Cotton,<br />\nthis man probably is his wonderful<br />\nmemory. It may be truthfully said were started for the roles in \"The ognized and praised. But Lanier views of these organizations. Each '22, was the first business manthat Mr. Ball knows by sight all Purple Mask,\" the mystery drama was a poet as well as a musician, spoke against the proposed maga- ager and was succeeded by Thommen at the university. Graduates to be produced this year. The though his work is obviously af- zine, saying that its appearance as Landy. There are at present 240<br />\nfrom as far back as classes in the play is of the time of Bonaparte fected by his passion for music. would be detrimental in a finan- copies of the first edition on hand.<br />\nA recommendation was made<br />\n\"eighties\" are always cordially and is similar to the play of last A book of his poems appeared in cial way to the other publications<br />\nto the Student Council that pargreeted by name as they enter the year, \"If I Were King,\" Mystery 1877. Considering the short time on the campus.<br />\nis the dominant characteristic he devoted entirely to literature<br />\nticipation in activities be limited<br />\nRegistrar's office.<br />\nthroughout and in order to main- and the unfavorable conditions The Student Council is opposed in the case of Seniors. It is beto making Hopkins a co-educa- lieved that if the \"jobs\" on the<br />\nSWIMMING TEAM TO MEET tain the elements of suspense and under- which he worked, his<br />\ntional institution. A letter will be campus are more evenly distribSWARTHMORE AT B. A. C. surprise, capable interpretations achievement was as remarkable<br />\nsent<br />\nto the dean announcing this uted it will create greater interest<br />\nmust be made of the various rules. as any American of his generaFRIDAY<br />\ndecision.<br />\nand efficiency.<br />\nTankmen to Open Schedule With With this end in view every can- tion. After his appointment as<br />\ndidate<br />\nwas<br />\ngiven<br />\nai<br />\nequal<br />\nchance<br />\nThis<br />\nsubject<br />\nwas<br />\ncalled<br />\nto<br />\nthe<br />\non<br />\nEnglish<br />\nlecturer<br />\nliterature at<br />\nThe matter of the limitation of<br />\nGarnet As Opponent. Dancand the best men will be given the Hopkins, his strength steadily attention of the Student Council enrollment from local public prep.<br />\ning to Follow Meet<br />\nparts whether they are members waned and he died in 1881 while due to the \"little war\" waged in schools was reopened. RecomHopkins winter sports will be<br />\nof the club or not.<br />\nthe News-Letter on this point; mendation was made last year to<br />\non a visit to North Carolina.<br />\nInaugurated on Friday evening<br />\nlikewise,<br />\nbecause of the formation the State Legislature that that<br />\nThe first memorial to Lanier at<br />\nWhen the Black and Blue SwimSIGMA<br />\nCHI<br />\nBETA<br />\nPLEDGES<br />\nHomewood was a sprig of ivy of the Johns Hopkins Women's clause forcing Hopkins to accept<br />\nming Team meets Swarthmore in<br />\n20<br />\nNEW<br />\nMEN.<br />\nINITIATION<br />\nplanted by the class of 1915. In Club, part of whose program was any public prep. school graduate<br />\nthe Baltimore Athletic Club pool.<br />\nON<br />\nFEB.<br />\n6<br />\nthe<br />\nbiological laboratory is a bust to incorporate the female stu- be repealed. Nothing materialized<br />\nAn informal dance, to be held in<br />\nrecommendation<br />\nA<br />\nthat<br />\nall<br />\nbuildof<br />\nthe poet, together with a dents of the university into the ac- from the recommendation. There<br />\nthe club's gym, will follow the<br />\nings<br />\nand<br />\ndriveways<br />\non<br />\nthe<br />\ncampus<br />\nbronze<br />\ntablet and some of his tivities of the undergraduate de- is at present, however, a bill pendmeet. The famed Black and Blue<br />\npartment. Attention was called ing which would deprive Hopkins<br />\nbe<br />\ngiven<br />\ndefinite<br />\nnames<br />\nhas<br />\nbeen<br />\nmanuscripts.<br />\nSix will furnish the music.<br />\nat<br />\nthe meeting to the fact that of its state suppdrt and leave it<br />\nmade<br />\nto<br />\nthe<br />\nuniversity<br />\nauthorities<br />\nThe meet and dance was<br />\nDr. French is of the opinion<br />\nwith<br />\nthe exception of a few cases, an independent institution. The<br />\nby<br />\nthe<br />\nSigma<br />\nChi<br />\nBeta<br />\ninter-fraterPlanned by Manager Buhrer in an<br />\nthat Lanier memorial ceremonies<br />\nwomen<br />\nare not admitted to the aid received at present is pracnity<br />\nfraternity.<br />\nIt<br />\nwas<br />\nsuggested<br />\neffort to raise funds for the swimshould be given at the first stuArts and Sciences and tically all consumed by the variCollege<br />\nof<br />\nthat<br />\nthe<br />\nnames<br />\nused<br />\nshould<br />\nbe<br />\nof<br />\ntiling team. The burden of finandent assembly after his birthday.<br />\nunless<br />\nthe<br />\nfaculty sees fit to ous state scholarships. The passmen<br />\nof<br />\nprominence who are or This, it is thought, would be a<br />\ncing swimming falls almost enits<br />\nruling<br />\non this subject, age of the bill, it is therefore bechange<br />\ntirely upon the team itself and have been connected with Hopkins. better way of insuring a gatherfemale<br />\nshall<br />\nnot be per- lieved, would be most desirable.<br />\nstudents<br />\nThis step was taken as express- ing of real proportions than to<br />\nthe men in charge request a large<br />\nto<br />\nparticipate<br />\nin the ac- Donald Vanneman was appointmitted<br />\nturn-out. Admission will be $1.50 ing the universal approval of the have the ceremony on February 3.<br />\nthe<br />\nin<br />\nwhich<br />\nmale stu- ed by the 0. D. K. to offer the<br />\ntivities<br />\nPer couple, with a reduction of student body in a move that has<br />\ndepartment<br />\nthis<br />\ntake services of the society to bring<br />\ndents<br />\nof<br />\nfifty cents for stags. It is against been favored for some time. The<br />\nJANUARY MEETING OF<br />\npart.<br />\nabout any favorable action from<br />\nthe rules of the B. A. C. for tick- present system of namings halls by<br />\nA. S. M. E. HELD<br />\nAt the recommendation of the the legislature.<br />\nets to be sold at the door so all their use instead of taking advan- The January meeting of the BalThe question of the new publiadmissions must be bought and tage of the opportunity to honor timore section of the American 0. D. K. the question of limiting<br />\nPaid for at the university. Tickets men who have helped to make Hop- Society of Mechanical Engineers the activities of students was cation was brought before the<br />\nmay be obtained from members kins what it is today has been was held last Wednesday, Jan- brought up and discussed. The meeting and a member of 0. D.<br />\nof the team at the University deemed inadequate and one at vari- uary 10, at the Engineers' Club. matter was turned over to a com- K. was appointed to present the<br />\nPostoffice and at the various fra- ance with the custom at other uni- Many members of the Hopkins mittee composed of Middleton, society's views to the Student<br />\nversities.<br />\nternity houses.<br />\nlocal chapter were present at the Cromwell, O'Connor and Nor- Council. The sentiment of the cirwood for investigation.<br />\ncle is against the appearance of<br />\nA strong lineup will be pre- Pledging of twenty men for meeting.<br />\nIt<br />\nhas<br />\nbeen<br />\ndecided<br />\nby<br />\nthe<br />\nthe magazine.<br />\nsented by the Black and Blue Sigma Chi Beta has been completed<br />\nThe speaker was Mr. George H.<br />\ninermen. Captain Coady will be and plans are now being made to Gibson, of the George H. Gibson council to continue the pledge on<br />\nAt the conclusion of the meetseen in the relay and the 2.20. initiate these men at a dance that Co., consulting engineers of New examination papers.<br />\ning the circle passed a resolution<br />\nManager Buhrer will perform in will probably be held February 6. York City. His topic was \"Feed<br />\nthat inasmuch as 0. D. K. stands<br />\nthe relay and the hundred. Among The pledges are: G. M. Shriver, Water Heating.\" Mr. Gibson dis- STUDENTS INSPECT INSULA- for the highest on the campus and<br />\nthe new faces will be Welsh, Rob. '24; Jenifer, '24; Croker, '24; Ad- cussed the various arrangements<br />\nTOR PLANT<br />\ncovers everything else, no other<br />\nMiddleton, S. A. Middleton and ams, '24; Campbell, '24; Mount, that can be made with open and<br />\nAn inspection trip of the Locke emblem shall be worn on the<br />\n'24; Grace, '23; Klein, '25; Rout- closed feed water heaters, evap- Insulator Plant was made last watch chain with the exception of<br />\nlioward.<br />\nThe probable lineup follows: son, 23; Griffith, '25; Huey, '23 orators, house and extractor tur- Saturday, January 13, by those Pi Delta Epsilon and 0. D. K.<br />\nRelay—Welsh; R. Middleton, Hooper, '24; Rich, '23; McDaniel, bines, economizers and steam and students taking the materials of<br />\ntuhrer, Coady or Lord.<br />\n'24; Bonner, '24; Kelly, '23;.Ma-' electrically driven auxiliaries in construction course. The men left<br />\n100-yard Swim — Buhrer, R. gill, \"25;' Wilbur, '23; Kennedy, general, both with regard to their Light and Redwood streets at 9<br />\nAll military equipment<br />\nMiddleton<br />\n'24; Dean, '24. There are thirty-. influence upon plant efficiency A. M. Prof. W. B. Kowenhoven,<br />\nshould be turned into the of220-yard Swim—Coady, Lord. one members of the society now at upon flexibility and convenience of the department of mechanical<br />\nfice at once.<br />\nengineering, conducted the party.<br />\nin operation..<br />\nContinued on page 4, col. 5<br />\nContinued on page 4, col. 2<br /><br />\n1<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1923<br /><br />\n2<br /><br />\nThe Johns<br /><br />\nHopkins News-Letter<br />\nFOUNDED 1897.<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANand other communications<br /><br />\nAGER, JOHNS HoPKINS UNIVERSITY; all articles<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nHomewood 100<br /><br />\nTelephone<br /><br />\nBusiness Manager:<br /><br />\nEditor-in-Chief:<br />\nH. MOORE, JR., '23.<br /><br />\nWILLIAM<br /><br />\nGLOVER<br /><br />\nManaging Editor:<br />\nJ.<br /><br />\nAssistant Managing Editor:<br />\nJOSEPH S. LEOPOLL '24.<br /><br />\nCirculation Manager:<br />\nPHILIP W. HOWARD, '25.<br /><br />\nAssociate Editors<br /><br />\nJunior Editors:<br />\nRICHARD C. TILGHMAN, '25.<br />\nJOHN W. PARSONS, '25.<br />\nBENJAMIN T. ROME, '25.<br />\nW. EDWARD THOMSEN, '26.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nERNEST A. STRATHMAN, '26.<br /><br />\nFALLON, '23.<br /><br />\nAdvertising Manager:<br />\nDONALD K. VANNEMAN,'23.<br /><br />\nHUDSON HUFFARD, '23.<br /><br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nRANDOLPH NORWOOD, '24.<br />\nT. REESE MARSH, '24.<br /><br />\nP.<br /><br />\nC. WARWICK PERKINS MAKING GOOD ON STAFF _OF<br />\n\"BALTIMORE NEWS\"<br />\nFormer Managing Editor of<br />\n\"News-Letter\" Progressing<br />\nRapidly in Journalism<br />\nEver since C. Warwick Perkins,<br />\nJr., took his degree of Bachelor of<br />\nArts in June, 1921, he has been<br />\nworking as a reporter on the staff<br />\nof the Baltimore News. Perkins<br />\nwas Junior Editor of the NEWSLETTER in 1920, and Managing Editor in his last year. He served in<br />\nthe Student Army Training Corps,<br />\nwas chairman of the Senior Prom<br />\nCommittee, and was on the Class<br />\nPin Committee. Perkins was on<br />\nthe first Black and Blue Jay Staff,<br />\nand was a member of both the Literary Club and the Social Science<br />\nClub.<br /><br />\nAssistant Business Managers:<br />\nBERNARD C. HEARN, '23.<br />\nFITZGERALD DUNNING, '24.<br />\nD. MILES MARRIAN, '25.<br />\nG. DONALD GIEsKE, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nJOHN C. LEWIS, JR., '23<br />\nJOHN T. DIxON, '24.<br />\nA. J. McKAY, '26.<br /><br />\nSts., Baltimore, Md.<br />\nPrinted by The Read-Taylor Co., Lombard and South<br /><br />\nLIMITATION OF ACTIVITIES<br />\ncampus<br />\nWhile there is so much discussion about the Hopkins<br />\nwell to present<br />\nas to the limitation of student activities, it might be<br />\nan, as<br />\nPennsylvani<br />\nthe views expressed by the editor-in-chief of the<br />\nresult of an<br />\npublished in that paper last year. This opinion is the<br />\n-growing<br />\ninvestigation of conditions existing in a larger, but a rapidly<br />\nuniversity. The editorial follows:<br />\ns.<br />\nAt Pennsylvania undergraduate activities are multitudindu<br />\nthe<br />\nEvery branch of sport is represented by a team which necessitates<br />\nassistants<br />\nwork not only of the players, but of the manager and his<br />\nfully the<br />\ncover<br />\npublications<br />\nas well. No less than six undergraduate<br />\nare made<br />\nfield of journalism. College dramatics, music and forensics<br />\nmany<br />\nwhich<br />\nto<br />\ns<br />\npossible by the existence of a number of organization<br />\nAssociation servstudents devote much of their time. The Christian<br />\nothers. Such<br />\nice and class affairs command the attention of many<br />\nseem, the para diversity of activities should make possible, it would<br />\nis not, howticipation of virtually every student in some activity. This<br />\never, the case.<br />\nGlance<br />\nPick up a Class Record, any one of the last ten volumes.<br />\nand<br />\nclass<br />\ngraduating<br />\nover the pages devoted to the members of the<br />\ntheir activities. You will find that certain of these men were engaged<br />\nnone.<br />\nin several fields of activity, while the majority participated in<br />\nbest<br />\nor, at best, a single one. This situation works neither for the<br />\ntes<br />\nundergradua<br />\ninterests of the University nor of the individual<br />\nthemselves, but it is a condition that is wholly natural in the absence<br />\nof any regulations tending to govern it.<br />\nCertain men in every Freshman class demonstrate special ability<br />\nin one activity or another. Their success places them in a favored<br />\nposition in regard to other activities. They are able, in many instances, to defeat in competition,students whose abilities have not<br />\nbeen proven elsewhere. After they have acquired a degree of prominence, other responsibilities are thrust upon them. These they cand<br />\nnot well refuse, yet before long they find themselves overburdene<br />\nall,<br />\nwith activities. They cannot well afford the time required by<br />\nsuffer.<br />\nand as a result the duties which have been entrusted to them<br />\nYet, at this very time, there are hundreds of undergraduates who find<br />\nthem.<br />\nthe opportunity to participate in undergraduate affairs denied<br />\nThe undesirability of this condition has before been recognized<br />\nnumat Pennsylvania. Two years ago a limitation was placed on the<br />\nmight<br />\nstudent<br />\nsingle<br />\na<br />\nber of so-called \"major activities\" in which<br />\nengage. But such a rule regulates a very limited number of cases.<br />\nThe situation demands far-reaching legislation, the adoption of a<br />\nsystem under which versatility may be encouraged without distributing undergraduate activities. unevenly in the student. body.<br />\nA solution to this problem has been found at other universities.<br />\nwhere the same question has arisen. This solution is one of which<br />\n. . ConsidCornell and - tolumbia are now contemplating the adoption<br />\neration is now beine rlevcoted to it by the University Committee on<br />\nNon-Athletic Activities. -<br /><br />\nMORE TRUTH THAN POETRY<br />\nBy James J. Montague<br />\nEverybody's One of 'Em<br />\nNo longer little Micky Mare,<br />\nWhose ways are mild and meek,<br />\nWill keep my clothing in repair<br />\nFor 50 cents a week.<br />\nHe now demands a larger sum,<br />\nWhich I esteem too dear,<br />\nFor lately Michael has become<br />\nA Pressing Engineer.<br />\nThe days when Tonio Dorio<br />\nWould clip and trim my lawn<br />\nAnd make my kitchen garden<br />\ngrow<br />\nFor ten a month are gone.<br />\nHe now is making wads of pelf,<br />\nTakes contracts by the year,<br />\nAnd, on his billheads styles himself<br />\nA Mowing Engineer.<br />\nThe lads from Greece who cleaned<br />\n.my shoes<br />\nOnce in a cheaper time,<br />\nNow with a haughty scowl refuse<br />\nMy little proffered dime.<br />\nOne sees them by appointment<br />\nnow,<br />\nThey're risen, it appears,<br />\nAnd have become, so they avow,<br />\nShoe Surface Engineers.<br /><br />\nCHRISTIAN SERVICE CLUB<br />\nOld 'Rastus Johnson comes no<br />\nStrictly business was the order<br />\nmore<br />\nof the meeting of the Christian<br />\nTo take the cans away,<br />\nService Club held last Tuesday<br />\nOr knocks upon the kitchen door<br />\nnight at the home of Mr. Wilbur<br />\nTo seek his weekly pay.<br />\nF. Wheeler. It was decided to<br />\nHe's found a means of getting his<br />\nmake an entirely new constituThe dusky profiteer—<br />\ntion and disregard the old one.<br />\nHis card informs me that he is<br />\nMr. Sylvester was appointed a<br />\nA Garbage Engineer.<br />\ncommittee of one to find out how<br />\nmuch the Christian Service Club<br />\nUnchivalrous!<br />\ncan send to Pearce Hayes, a Fresh Primus—What would you<br />\nMethodist missionary in China. do if the girl on whom you were<br />\nMr. Hayes, general secretary of calling said that she never wanted<br />\nthe Y. M. C. A. at Hopkins, a few to see you again?<br />\nyears ago, needs funds to carry<br />\nFresh Secundus—I'd jump to my<br />\non the Red Cross work that he feet and leave.<br />\nhas been doing in addition to his<br />\nFresh Primus—And let her fall<br />\nmissionary duties.<br />\nto the floor ?—Lyre.<br />\nBecause of the approaching examinations, meetings have been<br />\nA Co-ed Speaks<br />\ncancelled for the month of Jan- \"The lives of great men all remind<br />\n'us<br />\nuary. The next regular meeting<br />\nthere are some other gumps<br />\nThat<br />\nof the club, will be held on Febonly hoofprints when they<br />\nWhose<br />\nruary 13. During the month of<br />\nus<br />\nleave<br />\nFebruary the club expects to have<br />\nthose<br />\nupon our dancing<br />\nAre<br />\nas its speaker some of the promipumps.\"<br />\n—Lemon Punch<br />\nnent ministers of the city.<br /><br />\nMember of Southern Intercollegiate Newspaper Association.<br /><br />\nBALTIMORE, MD., JANUARY 16, 1923<br /><br />\nSTUDENT ACTIVMES COUNCIL AGAIN DISAPPROVES<br />\nOF LITERARY PAPER<br />\nThe Student Activities Council<br />\nis opposed to the establishment of<br />\nthe proposed literary magazine at<br />\nJohns Hopkins. This feeling is evidenced by the action of the council at a meeting held last Thursday at 11.30 A. M. in room 104 of<br />\nthe M. E. Building when the proposal for a literary magaz:ne was<br />\nreconsidered. The council unanimously decided to approve the<br />\nresolution of Pi Delta Epsilon,<br />\nhonorary journalistic fraternity,<br />\nregarding the magazine. This resolution was published in one of<br />\nthe recent issues of the News-Letter.<br />\nIt was also decided at the meeting that in the future Varsity<br />\nSeals will be awarded twice each<br />\nscholastic year instead of once in<br />\nthe fall as has been the custom<br />\nformerly. Awards will be made<br />\nin the future both in the spring<br />\nand in the fall.<br />\nAt the same meeting of the<br />\ncouncil a Varsity Seal was<br />\nawarded to Mr. T. R. Ball, the<br />\nregistrar.<br /><br />\nDuring his first three weeks on<br />\nthe News staff, Perkins attended<br />\nto the routine work which falls to<br />\nthe lot of a cub reporter. He reported the cases that come before<br />\na district police station, and was<br />\nsent out on similar assignments of<br />\na minor nature.<br />\nThe nature of his work after this<br />\nshort period of apprenticeship<br />\nshows the rapidity of his progress.<br />\nOne of his first special assignments<br />\nwas to cover the Gibson Island<br />\nreal estate project which attracted<br />\na great deal of attention over a year<br />\nago. This work was done in conjunction with other reporters.<br />\nDuring the past year he has been<br />\nassigned, alone or with other men,<br />\nto cover meetings and events of<br />\nmore than usual importance. Perkins reported the Bankers' Convention at Atlantic City in the spring<br />\nof 1922, and worked on the big<br />\nrailroad strike which occurred last<br />\nsummer. At different times he has<br />\nhad charge of city hall and shipping news. At present he is reporting the work of the state offices,<br />\nparticularly that of the Public Service Commission in connection with<br />\nthe dispute over the fixing of the •<br />\namount to be charged by the United •<br />\nRailways for fare.<br />\nII<br />\nPerkins is interested in his work<br />\n11<br />\nand gives promise of further suc-.<br />\ncess. He is one of several former<br />\nNEWS-LETTER men who have been<br />\nsuccessful in newspaper work.<br /><br />\naaaaaaaaaaaaaaaaaaa<br /><br />\n•<br />\n• Why<br />\nYoung Men Should<br />\n•<br />\n• Consider Insurance Selling<br /><br />\nCANE CLUB TO HOLD \"TAPPINGS\" AFTER EXAMS<br />\nAfter a period of comparative<br />\ninactivity the Johns Hopkins Cane<br />\nClub is going to reorganize. A<br />\nmeeting has been called to make<br />\nplans for the coming year. It was<br />\ndecided that the mystic \"tappings\"<br />\nwill be held shortly after the midyear examinations.<br />\nThe Cane Club was organized<br />\nin 1921 for social purposes. Its<br />\nmembership is elective and is limited. The insignia is a small gold<br />\ncane that is worn on the watch<br />\nchain. This year a new requirement for election to the club<br />\nmust be fulfilled, namely, that the<br />\ncandidates must be in some activity on the campus.<br /><br />\nSeven Reasons for Life Insurance Career<br /><br />\nLIFE INSURANCE is founded on<br /><br />\nthe<br /><br />\nhighest ideals.<br /><br />\na<br /><br />\nIt is capable of yielding a good income and the<br />\nsatisfaction of accomplishment.<br /><br />\n•<br /><br />\nIt offers opportunities for real leadership.<br />\nIt brings insurance salesmen in close association with big business and big business men.<br /><br />\n1111<br />\n•<br /><br />\nrequires education in business methods,<br />\nlaw and finance.<br /><br />\nIt<br /><br />\nIt is a field for workers, not shirkers.<br />\nIt is an alluring and practical calling for men<br />\nof dynamic energy.<br /><br />\nLIFE INSURANCE COMPANY<br />\nOF<br /><br />\n•<br />\n•<br />\n•<br /><br />\nBOSTON. MASSACHUSETTS<br /><br />\n11111111111111111111111111111111111111111111111111111<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, JANUARY 16, 1923<br /><br />\nRY<br /><br />\nek,<br />\n,air<br /><br />\nwn<br />\nlen<br /><br />\n3<br /><br />\nNIGHT COURSES IN MILITARY<br />\nTHE NEWS LETTER'S<br />\nAFRICAN NATIVES UNABLE<br />\nSCIENCE TO BEGIN WEDMAILBAG<br />\nTO MARRY WITHOUT TRANESDAY NIGHT<br />\nDITIONAL ADORNMENT<br />\nA Column in Which the Correspondents Organization Meeting Held on<br />\nAre Allowed Latitude, But ShoulDr. Shattuck Gives Interesting<br />\nJanuary 10. Thirty-eight Studer the Responsibility.<br />\ndents Enrolled<br />\nExperiAccount of African<br />\nLast<br />\nDances<br />\nWednesday night, January<br />\nences. Imitates Native<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nthe<br />\n10,<br />\nmeeting for the organizaWARNER &amp; COMPANY<br />\nregular letter size paper, on one side<br />\nNo male native in Africa has a<br />\nonly.<br />\ntion<br />\nof<br />\nin<br />\nnight<br />\nmilitary '<br />\n'classes<br />\nchancc to marry unless he is<br />\nHATTERS<br />\nTtup<br />\nNo attention will be paid to anony<br />\nbut names signed as an science was held. The courses will<br />\nletters,<br />\nmous<br />\nmanner,<br />\ntraditional<br />\nthe<br />\nin<br />\nadorned<br />\n222 W. BALTIMORE ST.<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be be conducted by members of the<br />\naccording to Dr. George B. Shatomitted.<br />\nHopkins Military Department in the<br />\ngeolof<br />\nprofessor<br />\ntuck, formerly<br />\nThe publication of a letter is not to<br />\nindorsement of its views university buildings, and will be<br />\nan<br />\nas<br />\ntaken<br />\nbe<br />\nwho<br />\nVassar,<br />\nogy at Hopkins and<br />\nby the \"News-Letter,\" which invites the<br />\nThey are open to members<br />\nfreest discussion of matters of general free.<br />\naddressed the assembly last Thursinterest.<br />\nHERE are such things as -family traits\" in clothes.<br />\nof<br />\nthe<br />\nNational Guard, Reserved<br />\nteeth<br />\nday. The natives chip their<br />\nA Stein-Bloch suit and a Stein-Bloch overcoat are<br />\nOfficers, and men who have had<br />\nto make them pointed, and somea<br />\nperfectly<br />\nnatural combination because both were born<br />\ntraining in one of the Citizens' Miltimes dig out six front teeth in<br />\nSUGGESTION TO THE<br />\nof a single conception of honor in craftsmanship.<br />\nitary Training Camps. The object<br />\nthe lower row. To product the deFACULTY<br />\nFor Stein-Bloch models collegians go to Hamof the courses is to give the techsired effects, the natives scarify<br />\nburgers'—there's No Other Place to Go,<br />\nDecember 26, 1922.<br />\nnical instruction the men will need<br />\ntheir bodies until they are covered<br />\nof<br />\nthe<br />\nTo<br />\nEditor<br />\nthe<br />\nNEWS-LETTER,<br />\nif<br />\nthey wish to take examinations<br />\nwith scars and tumors. The more<br />\nadvancement.<br />\nfor<br />\nJohns Hopkins University.<br />\nscarred a man is, the more of a<br />\nThe<br />\nthirty-eight men that atcut-up he is among the ladies.<br />\nDear Sir: Owing to the present<br />\nthe<br />\nmeeting are divided into<br />\ntended<br />\nThe speaker went on with an ac- importance of the radio phone in<br />\nclasses in the following subjects:<br />\ncount of the native practice of America today, we would suggest<br />\n(Y. M. B. 0. D.)<br />\n\"medicine\" in Africa. If a man is that a radio broadcasting station be Military Map Reading and Sketching (Captain Atwater), 20; Milisick, the \"medicine man\" of the installed at Homewood. Such a<br />\nBaltimore and Hanover<br />\nLaw (Captain Paul), 1; Matary<br />\ndistrict is summoned, goes through movement would be in step with<br />\nchine Guns (Captain McMurray),<br />\na formal performance of his magic, the actions of other leading univerTactics (Captain McMurray),<br />\n4;<br />\nand invariably pronounces the case sities. Already debates have been<br />\n11;<br />\nAdministration<br />\n(Sergeant<br />\nincurable. Then, because the na- carried on between universities<br />\nAll<br />\n2.<br />\nthe<br />\nHouton),<br />\nwill<br />\ncourses<br />\ntives are absolutely certain that through the medium of the ether.<br />\nextend<br />\na<br />\nover<br />\nperiod<br />\nten<br />\nof<br />\nweeks,<br />\nMUSICAL INSTRUMENTS OF ALL KINDS<br />\neveryone who touches -a dead body There would be news, events and<br />\ntwo hours weekly, except the course<br />\n11 N. HOWARD ST.—Near Baltimore St.<br />\ncarry<br />\nthey<br />\nafter<br />\nto<br />\nimportance<br />\nimmediately<br />\nof<br />\nitems<br />\nothers<br />\ndies<br />\nin administration, which will be<br />\nWe represent the most famous makers, as C. G. Conn, Bacon,<br />\njungle<br />\nthe<br />\nto<br />\nalive,<br />\nof<br />\nstill<br />\nresults<br />\ngames,<br />\nman,<br />\nas<br />\nthe<br />\nbroadcast, such<br />\nVega, Leo Master, Etc.<br />\ngiven for five weeks, two hours<br />\nWE SELL ON CREDIT<br />\nat night, the hyenas complete the music by our band, orchestra, and<br />\nweekly. The classes will be held<br />\n\"burial\" service.<br />\nglee club; educational lectures by<br />\nevery Wednesday evening, beginDr. Shatuck spoke at length the faculty and others. This would ning jarmary 17. No one can enter Phone, Homewood 2934<br />\nabout a typical night on the plains, be a very good method to make our any of the classes after the first UNIVERSITY TAILORING<br />\nCleaning, Dyeing, Pressing &amp;<br />\nwhere lions and other big game Alma Mater more popular and bet- meeting has been held, and no regRepairing<br />\nhelp<br />\nconsidwould<br />\nand<br />\naccount<br />\nter<br />\nknown,<br />\nvivid<br />\na<br />\ngave<br />\nHe<br />\nabound.<br />\n100 WEST 27th ST.<br />\nular students at Hopkins will be alMEN'S SHOES<br />\nCor. Maryland Avenue<br />\nof the danger from lions, described erably to boost athletics and social lowed to take the courses. Other S. Hofkin,<br />\nProp.<br />\nBaltimore, Md.<br />\nOf the Better Class<br />\nthem and their far-carrying, dis- events. The university has some subjects were offered the men, but<br />\na<br />\nfor<br />\nequipment<br />\nnecessary<br />\ntheir<br />\nthe<br />\nof<br />\nof<br />\ntold<br />\ntinctive roar, and<br />\nnone were elected. Because of the<br />\nmethods of attacking zebras, other broadcasting station, and also com- conflict in time in Captain McMurgame, and men. Dr. Shatuck told petent men who are qualified to ray's classes, it may be necessary<br />\nCLEANING, PRESSING<br />\nURNER BROTHERS<br />\nalso of how he had filmed a charg- operate such a station. We are to hold one of the classes on anREPAIRING<br />\n111<br />\nE. BALTIMORE STREET<br />\nwill<br />\na<br />\nsuch<br />\nmovement<br />\nthat<br />\ning lion and the natives' defense positive<br />\n2601 OAK ST.<br />\nother evening.<br />\nBALTIMORE<br />\nstuagainst ithe beast. He then spoke meet with approval from the<br />\nThe courses have the approval<br />\nof the hunting of elephants, which dents and friends of the university, and support of Dr. Goodnow, who<br />\nhe called the most dangerous beasts in fact, it would be welcomed by proposed the holding of them to<br />\nin the jungle. He related the ad- them.<br />\nTHE PLACE TO BUY<br />\nThousands of Motorists<br />\nMajor Gen. Muir, Commander of<br />\nJ. J. DAVIDSON,<br />\nventure of an inexperienced huntCIGARS<br />\nSODA<br />\nCANDY<br />\nThroughout The Year<br />\nthe Third Corps Area. The<br />\nJ. T. FETSCH.<br />\ner, who was badly shaken up and<br />\nS. E. Cor. OAK &amp; 27th ST.<br />\nEnjoy Their Favorite<br />\nprogress of the classes will be<br />\nbruised by a kick of his gun when<br />\nwatched with interest by those<br />\n\"WE CLEAN 'EM CLEAN AND PUT A<br />\nhe killed a charging rhinoceros.<br />\nCREASE THAT STAYS PUT<br />\nimmediately concerned. Major<br />\nANENT THE NEW<br />\n\"a<br />\nAsk Tom LandY<br />\nwanted<br />\nhad<br />\nThe young man<br />\non<br />\nGarey will deliver a lecture<br />\nFree Auto Service<br />\n8 Branches<br />\nMAGAZINE<br />\nnever<br />\nwould<br />\nhunting experience fie<br />\nthe<br />\nRifle<br />\nbefore<br />\nMarksmanship<br />\n&amp;<br />\nBALDWIN<br />\nBRADY<br />\nTo the Editor of the NEWS-LETTER.<br />\nforget\"—he got it.<br />\nMaryland Rifle Association. He<br />\nCleaning, Dyeing, Pressing<br />\n\"The Wonder Motor Fuel\"<br />\nThe explorer described the Dear Sir:<br />\n4032 ROLAND AVE.<br />\nwill explain the technical side of<br />\nMain Store—Tuxedo 2148<br />\nSHERWOOD BROTHERS, Inc.<br />\ndances of the natives and gave adWhy all the fuss about an un- quick and accurate shooting.<br />\nLeave Garments with Lamly or Phone Us<br />\nnative<br />\nfew<br />\na<br />\nof<br />\nimitations<br />\nmirable<br />\ndergraduate literary publication<br />\nTHE MYSTIC THREE<br />\n\"steps.\" He described also the at Homewood?<br />\nThere are three words, the sweetwith<br />\nbribed<br />\nwhen<br />\npygmies, who,<br />\nIt seems to me that in view of<br />\nest words<br />\nsalt, went through their paces be- the fact that the three ruling stuthe human speech—<br />\nall<br />\nIn<br />\nspeaker's<br />\nThe<br />\nand individuality is offered here at prices that are not<br />\nfore his camera.<br />\norganizations, the Omicron More sweet than all songs of birds,<br />\ndent<br />\nand cannot be underquoted by any house at any time.<br />\nconcluding story was about a Delta Kappa, the Student Council<br />\nor pages poets preach.<br />\nBesides the reputation of an old-established firm<br />\nyoung native who, after participat- and the Student Activities Counmay be a vale of tears,<br />\nlife<br />\nThis<br />\nis back of each sale with a guarantee.<br />\ning in a party where the liquid re- cil, have officially announced<br />\nA sad and dreary thing—<br />\nfreshments had a powerful kick, their disapproval of such a prewords and trouble disappears<br />\nThree<br />\nfell asleep on his way home. A carious undertaking, it is perfectbirds begin to sing.<br />\nAnd<br />\nFURNITURE<br />\n.DECORATIONS<br />\nDRAPERIES<br />\npython had swallowed one of his ly clear that the undergraduates<br />\nwords and all the roses<br />\nThree<br />\n343<br />\nhis<br />\nNORTH<br />\nto<br />\nCHARLES<br />\ncame<br />\nSTREET<br />\ncompanion<br />\na<br />\nwhen<br />\nlegs<br />\nfeel neither the need nor the debloom,<br />\nrescue. The native had the most sire for such a publication.<br />\nThe<br />\nsun begins to shine.<br />\n\"beautiful\" scarifications in Africa<br />\naspirliterary<br />\nThree<br />\nthe<br />\nwords will dissipate the<br />\nshould<br />\nWhy<br />\nas the result of his adventure.<br />\ngloom<br />\nbe so dense? These literary<br />\nants<br />\nDr. Shattuck kept his audience<br />\nAnd water turn to wine.<br />\ngeniuses (?) should come out of<br />\ninterested through his speech. He<br />\nbeen<br />\nhave<br />\nthey<br />\nwhither<br />\nThree<br />\nwords and trouble disapthe ether<br />\nwas dressed in the garb of a hunter summoned by the nine muses,<br />\npears days<br />\nand had with him many articles<br />\n518 N. CHARLES STREET,BALTIMORE<br />\nand standing upon a perfectly ra- \"I love you?\" Wrong, by heck!<br />\nof native use. His frequent imitational and human basis should It is another, sweeter phrase,<br />\nTelephone, Vernon 3442<br />\nOrchestra—Dancing<br />\ntions were particularly amusing. realize that their work stands on<br />\n\"Enclosed—find—check.\"<br />\n3.30<br />\nto<br />\nP.<br />\n5.30<br />\nM. and 6 to 8 P. M.<br />\nappretheir<br />\nshowed<br />\nThose present<br />\nan illogical and unsound footing.<br />\n—Brown Jug.<br />\nTABLE<br />\nD'HOTE<br />\nhim<br />\nurging<br />\nciation of his lecture by<br />\nLUNCHEON-60c<br />\nDINNER—$1.00<br />\nIf they wish to make their pubto continue over the regular period,<br />\nTheir First Visit<br />\nSUNDAY<br />\nD1NNER—$1.25<br />\npersonFreshman's Parents—Is this<br />\nand many stayed behind to see his lication an individual and<br />\nIf, where Robert Jones lives?<br />\ngood.<br />\nvery<br />\nundertaking,<br />\n-11<br />\ncollections of souvenirs.<br />\nhowever, they are planning to inIrate Landlady—Yes, bring him<br />\nSherwood spoke of a problem in<br />\nthe name of Hopkins they •n.—Tiger.<br />\nvolve<br />\nhonor<br />\nthe<br />\nof<br />\nviolations<br />\nregard to<br />\nare stepping beyond their limits<br />\nsystem, and expressed his regret<br />\nYours for the good name Hop<br />\nYOU WILL FIND OUR STOCK OF STANDARD MAKE SETS<br />\nthat such a serious condition should<br />\nkins,<br />\ndebate<br />\nAND APPARATUS WILL MEET YOUR EVERY NEED<br />\nexist. The Junior-Senior<br />\nUNDERGRADUATE<br />\nwill be held on January 20. Tags<br />\nCOMPLETE VACUUM TUBE RECEIVERS, $39.95 UP<br />\nwere sold for the benefit of June<br />\nsembly after that will be given over<br />\nWeek.<br />\nto the discussion of the honor sysLaDean<br />\nAt thetnext assembly,<br />\n1724 N. CHARLES ST.<br />\nEvery student is expected to<br />\ntem.<br />\n-months'<br />\ntane will speak on his two<br />\nSTAFF<br />\nPITY<br />\nTHE<br />\n10 Minutes from Hopkins<br />\nVernon 3055<br />\ntour to South America. The as- attend.<br /><br />\nThe \"COLLEGIAN\"<br /><br />\nThe hat for the \"College Man\" who<br />\ncreates his own style<br />\n.50<br /><br />\nT<br /><br />\n- ninecr% Y4o-t/4.4<br />\n14a<br /><br />\nLed<br /><br />\ntse<br /><br />\n:nt<br /><br />\nv,<br /><br />\nno<br /><br />\nor<br /><br />\ntis<br /><br />\non<br />\n!re<br />\ned<br /><br />\nfly<br /><br />\nall<br /><br />\nid<br /><br />\nPS<br /><br />\ney<br /><br />\nig<br /><br />\nA. BURDWISE<br /><br />\nURNER'S<br /><br />\nSCOTT---The Tailor<br /><br />\nNICK DIETOR<br /><br />\n11<br /><br />\nFURNITURE OF QUALITY<br />\nti<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />\nCHANTILLY<br />\nRestaurant Francais<br /><br />\nRADIO!!<br /><br />\nRADIO SUPPLY CO.<br /><br />\nTHE JOHNS HOPKINS NI. WS-LETTER, JANUARY 16, 1923<br /><br />\n4<br /><br />\nARRANGEMENTS FOR INDOOR MEET COMING<br />\nThe Medical Standard Book Co.<br />\nTO HEAD<br />\n(THE BOOK MART)<br />\nArrangements for the Johns<br />\nHopkins-Fifth Regiment Indoor<br />\nComplete Stock of<br />\nMedical Books and College<br />\nGames, to be held at the Fifth RegRequisites<br />\niment Armory the evening of SatImporters and Dealers in Fine Books<br />\nurday, February 4th, are coming<br />\nto a head, and indications point to<br />\n301 N. CHARLES ST.<br />\nsuccessful meet. Inquiries are<br />\na<br />\nBaltimore, Md.<br />\npouring in from all over the country. Colleges as far north as University of Maine and Massachusetts<br />\nInstitute of Technology, and as far<br />\nMANUFACTURING JEWELERS<br />\nLancaster, Pa.<br />\nsouth as Georgia Tech are numberClass Rings, Pins, Fraternity Pins,<br />\ned among the inquirers.<br />\nCups, Medals, Etc.<br />\nA special mile relay feature beStationery, Invitations, Programmes<br />\n\"Makers of the Varsity Seals\"<br />\ntween Virginia, Navy and Princeton is taking shape. Secretary KirSTRATTON SHIRT MAKER<br />\nwan, of the Games Committee, ex226 N. Liberty St.<br />\nDress Shirts<br />\n$3.00, $3.50 and $4.00 pects signed application in the<br />\n$3.25 and $4.25<br />\nNegligee<br />\nImported Madras<br />\n$5.25 and $6.25 near future. A relay race beTerms Cash, Less 10% 30 Days on tween Episcopal High School, of<br />\nShirts<br />\nAlexandria, Va., and Mercersburg<br />\nAlso a Full Line of Men's<br />\nAcademy, of Mercersburg, Pa., is<br />\nFurnishings<br />\npossible as one of the prep star<br />\nattractions.<br />\nFine Clothes<br />\nDr. Ray Van Orman, Director<br />\nA suit by Lemmert gives the final<br />\nof<br />\nAthletics, has 'announced that<br />\ntouch to the lasting satisfaction you<br />\nderive from thoroly dependable publicity for the meet will be given<br />\ncloths cut in authentic fashionwhether for every-day wear or more out shortly by the radio broadcastfestive occasions.<br />\ning station W-E-A-R of the Baltimore News and American. This<br />\nLEMMERT<br />\nat<br />\nwill mark a new effort to procure<br />\n19 Fayette Street, East<br />\npublicity for Hopkins. The meet<br />\nBusiness Suits<br />\nDress Clothes in this way will be made known to<br />\nall radio fans in this part of the<br />\nOvercoats<br />\nSport Togs<br />\ncountry, and will probably stimulate<br />\na good amount of interest. ArSHIRTS<br />\nNECKWEAR<br />\nrangements for publicity by radio<br />\nwere made several weeks ago by<br />\nthe Publicity Board.<br />\n421 N. HOWARD ST.<br /><br />\nJ. F. Apple Co.<br /><br />\nBLACK AND BLUE JAY<br />\nDEFICIT CUT<br />\nThe Business staff of the Black<br />\nand Blue Jay makes the following financial report, showing that<br />\nthe deficit of approximately $400<br />\nconfronting the staff at the beginning of the scholastic year had<br />\nbeen cut to $118.09.<br />\nASSETS<br />\nCash from<br />\nAdvertising 1922-23....<br />\nAdvertising 1921-22<br />\nStudent Act. Fees<br />\nFirst two issues<br />\nLast four issues<br />\nSubscriptions<br />\nCash sales<br />\nOutstanding billsAdvertising<br />\nCirculation (approx.)<br /><br />\nBANK WITH<br /><br />\nSecurity Storage &amp; Trust Co.<br />\nNORTH AVENUE at CHARLES STREET<br />\nASSETS OVER ONE MILLION DOLLARS<br />\nSAVINGS OR CHECKING ACCOUNTS<br />\nAS YOU WISH<br />\nHENRY S. KING, President<br /><br />\n$195.00<br />\n114.31<br />\n225.54<br />\n451.08<br />\n19.50<br />\n55.33<br />\n472.00<br />\n330.00<br /><br />\nTotal assets<br />\n$1,862.76<br />\nLIABILITIES<br />\nCash disbursed for<br />\nRead-Taylor for 1921-22<br />\ndeficit<br />\n$400.00<br />\nRead-Taylor printing<br />\n494.00<br />\nNews-Letter loan for<br />\n1921-22 deficit<br />\n89.25<br />\nMiscellaneous<br />\n67.94<br />\nBillhead printing<br />\n3.30<br />\nOutstanding bills.<br />\nRead-Taylor, printing<br />\n223.00<br />\nCluett Peabody cover<br />\nstock<br />\n7.46<br />\nPostage 1921-22<br />\n14.91<br />\nPostage 1922-23<br />\n38.94<br />\nEngraving on cover<br />\n40.96<br /><br />\nThe Greetings of a Fine Store<br />\nTo the Students of a Fine University<br /><br />\nHOCHSCHILD,KOHN &amp;Co.<br /><br />\nElynson, Westcott and Dunning<br />\nPRESCRIPTION DRUGGISTS<br />\nTWO STORES:<br />\nCharles and Chase Sts.<br />\nEutaw Place and North Ave.<br />\nVernon 0890<br />\nMadison 0405<br /><br />\nELECTRICAL CLUB HOLDS<br />\nMEETING<br />\n4<br />\n41<br />\nmain<br />\nThe<br />\nspeaker at the last<br />\n41<br />\nmeeting of the Johns Hopkins<br />\n0<br />\nElectrical Club held last Friday, 41<br />\n41<br />\nJanuary 12, was Mr. Thomas L. 4<br />\nBeery. The subject of his address<br />\nOver one hundred years<br />\nwas \"Permeameters.\" The lecture &gt; of designing and creating<br />\nSilverware assures the purTotal liabilities<br />\n$1,379.76 was attended by many engineerchaser of Kirk pieces in<br />\ning students, particularly those<br />\nsilver absolute certainty of<br />\nNet Profit<br />\n$483.00 taking the electrical course.<br />\nsuperiority.<br />\nIn the attached statement must<br />\nHOSIERY<br />\nbe taken into account the fact TAG DAY ANNOUNCEMENT<br />\nJUNIOR CLASS TO HOLD<br />\nGLOVES<br />\nThursday, January 11, 1923, was<br />\nPROM<br />\nthat the Student Activity fees and<br />\ndesignated<br />\nas the third \"Tag Day'<br />\n41<br />\nAt a meeting of the Junior bills collectable from circulation<br />\n41<br />\nEstablished 1873<br />\nof<br />\nthe<br />\nyear<br />\nat the university.<br />\n41<br />\nclass held Wednesday, January should be apportioned over the en41<br />\nDue to more publicity \"Tag<br />\n41<br />\n10,<br />\nwere<br />\npreparations<br />\nfor<br />\nmade<br />\ntire six issues. Deducting oneFetting Man'fg Jewelry Co.<br />\n0<br />\nthe Junior Prom to be held about third of these amounts to cover Day\" proved a better success than<br />\nManufacturers<br />\nBaltimore, Md.<br />\nthe middle of February. President the first two issues it is seen that any of the preceding ones.<br />\n41<br />\nGreek Letter Fraternity Jewelry<br />\nProfessors, professor's secre41<br />\nBonner appointed a prom com- $670.08 is left to cover the other<br />\n41<br />\nOldest Silversmiths in America 41<br />\n213 N. LIBERTY ST., Baltimore, Md.<br />\nmittee consisting of Kennedy, four issues. Deducting the net taries and \"co-eds\" alike dished<br />\n41<br />\n41<br />\nchairman G. M. Shriver, Deavour, gain of $483.00 from $671.08, it is out the cash for the honor of 03<br />\n4<br />\nEstablished in 1817<br />\nwearing<br />\na<br />\ntag.<br />\n;<br />\nLeopold, Mount, Gardner and seen that the deficit at the present<br />\nBill Meyers, invincible salesDunning. The whole undergrad- time has been cut to $188.08, havman, after scouring Gilman Hall<br />\nuate school will be extended an ing been originally about $400.<br />\nturned in over $18 as the result<br />\ninvitation to the dance, which<br />\nof sales. Among his purchasers<br />\nSHOES<br />\nSALT AND PEPPER<br />\npromises to be an elaborate afDrs.<br />\nGilpin,<br />\nwere<br />\nMuller,<br />\nBliss,<br />\nA<br />\nsoldier<br />\nhome<br />\non<br />\nwas<br />\ntryleave<br />\nfair.<br />\nfor<br />\nAn appeal was made by the ing to give his friends an idea of Waterfall, Lee, Christie, Pullen,<br />\nUNIVERSITY<br />\nMEN<br />\nibeXatterie<br />\nv<br />\nCl<br />\ntreasurer for class dues. He an- the amount of mud in the trenches. Bright and Thompson.<br />\n-1`18 H.Sc OSCAR G.L5<br />\nThere .still seems to be some For Dress<br />\nFor Sport Wear<br />\n\"One day,\" he stated, \"I dropped<br />\nnounced that the class is in<br />\nOWNERS<br />\nmisunderstanding<br />\namong<br />\ncertain<br />\nmy<br />\ncap,<br />\nwhich<br />\ndisappeared<br />\nin<br />\nthe<br />\ndebt to the Hullabaloo for the picSmart Styles-Best Leathers<br />\n4dt<br />\n'<br />\ni'DE*.. egg rilfr:°<br />\nmud. I was floundering about look- students as to the purpose of<br />\nture<br />\ntaken<br />\nlast<br />\nyear<br />\nand<br />\nasked<br />\n29 Baltimore St., Ettst<br />\nModerate Price.:<br />\nthat dues be paid as soon as pos- ing for it when a voice cried, 'Hi! Tag Day. For their benefit<br />\nOne Door West of Ligbi St.<br />\nLook out, you're standing on my Treasurer Hensel of the June<br />\nSOLE AGENTS FOR BALTIMORE sible.<br />\nWeek Committee explains that for<br />\nFor College Fraternity Bands<br />\nA general class discussion fol- hand.'<br />\n(Greek Letter Societies)<br />\nlowed. It was pointed out that the \"What do you want to lie about the first time in the history of the<br />\n19 W. LEXINGTON ST.<br />\nuniversity there will be a June<br />\nclass meetings had been attended there for ?\" I asked.<br />\n\"'Lie about be hanged,' was the Week. This will consist of a numvery poorly thus far this year<br />\nber of dances and other amuseShe laid the still white form beand each man was asked to help reply, 'I'm driving a transport.'\"<br />\nPrinters of Philological and<br />\nments which will require a great side those that had<br />\nout in this matter.<br />\ngone before.<br />\nScientific Works<br />\nFlat Tire<br />\ndeal of money. In order to lessen No groan, no sigh,<br />\nburst<br />\nfrom her.<br />\nHe-The tunnel we just passed the price of these things during<br />\n23 S. HANOVER ST.<br />\nSWIMMING TEAM TO MEET<br />\nSuddenly she let forth a cry that<br />\nSWARTHMORE AT B. A. C.<br />\nthrough cost a million dollars.<br />\nBaltimore, Md.<br />\nJune Week tags are sold through- pierced the still<br />\nnight air, making<br />\nContinued from page 1.<br />\nFair One-It was an absolute out the year on certain designated<br />\nit vibrate into a thousand echoes.<br />\n50-yard Dash-Welsh and Bull- waste of money, as far as you are days for a nominal sum. In this<br />\nSARATOGA AT<br />\nIt seemed as if it came from her<br />\nconcerned.-Burr.<br />\nre<br />\nr.<br />\nway more students will be able to very soul.<br />\nLIBERTY STS.<br />\nTwice the cry was reBreast Stroke-Dunning.<br />\nenjoy the attractions of June peated, and<br />\nthen all was quiet<br />\nLUNCHEON<br />\nA man very near-sighted and Week without the cash per rata<br />\nBack Stroke-S. A. Middleton,<br />\nagain.<br />\nShe<br />\nwould<br />\nlay another egg<br />\nTEA<br />\nabout to fight a duel, insisted that being exceedingly high.<br />\nMorrell.<br />\ntomorrow.<br />\nDINNER<br />\nPlunge-Hambleton, Howard. he should stand six paces nearer<br />\nAMHERST GIVES $2,000<br />\nhis antagonist than the latter was<br />\nFancy Diving-Coady.<br />\nSPECIAL PARTIES<br />\nFELLOWSHIP<br />\nto<br />\nhim<br />\nand<br />\nthat<br />\nthey<br />\nshould<br />\nboth<br />\nHard on Her<br />\nInterest at the university is<br />\n11.30 A. M.<br />\nProf. W. H. Hamilton, secretary<br />\nfire<br />\nat<br />\nthe<br />\nsame<br />\n-Westmintime.<br />\nGirl<br />\n(in<br />\ntears)-Why conic to<br />\naroused over the meet due to the<br />\nuntil<br />\nof the fellowship committee of Amthe game drunk?<br />\nPLAZA 6987 fact that Swarthmore nosed out ster Fortnightly.<br />\n7.30 P. M.<br />\nherst College, has announced a<br />\nBrute-'S economical, m' dear.<br />\nthe Black and Blue mermen by<br />\nMr. White-\"Mose, what would memorial fellowship yielding $2,000<br />\nSee<br />\ntwo games for one ticket!one point last year in a thrilling<br />\nyou do if you received a letter a year, to be devoted to the study<br />\nLampoon.<br />\nmeet. The outcome of the meet<br />\nof sociology.<br />\nThis fellowship,<br />\nfrom the Ku Klux Klan ?\"<br />\ndepended upon the result of the<br />\nMr. Black-\"Well, sah, I'd read which is to be awarded next year,<br />\n100-yard dash in which Charlie<br />\nSIGMA CHI BETA PLEDGES 20<br />\nCommercial Photography<br />\nis open to any college or university<br />\nit on a train.\"-Tiger.<br />\nNEW MEN<br />\nFoster<br />\nCrownover<br />\nnosed<br />\nout<br />\nPhotography<br />\nCircuit<br />\ngraduate.<br />\nContinued from page 1<br />\nMorrell.<br />\nThe<br />\nSwarthmore<br />\nstar<br />\nLine!<br />\nGood<br />\nA<br />\nViews<br />\nFlash Lights<br />\nthe university.<br />\n\"I draw the line at kissing,\"<br />\nCorn?<br />\nEnlargements and the Black and Blue swimmer<br />\nGroups<br />\nShe I hear he drinks something<br />\nThe award for the most popular<br />\nSaid she with accents fine.<br />\nrounded the last lap neck and<br />\nKODAK FINISHING<br />\nawful,<br />\nman in the senior class has been<br />\nHe was a football player,<br />\nneck, Crownover touching the fin325 N. Howard St.<br />\nHe-Yeah, I tasted it.-Purple hung on the east wall of the recreaAnd so he crossed the line.<br />\nish a fraction of a second before<br />\nMt. Vernon 4999<br />\nParrot.<br />\ntion room of the Barn.<br />\n-Mugwump.<br />\nhis opponent.<br /><br />\nQuality<br /><br />\nLefranc &amp; Ault<br /><br />\nSamuelKirk<br />\nand Son Co.<br /><br />\nWYMAN<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nW.L. Mann<br /><br />\nela<br />\nof<br />\non<br />\nat<br />\nbat<br />\nStz<br />\nesi<br />\ngo<br />\nSt;<br /><br />"}], "field_media_file": [{"target_id": 37697, "display": null, "description": null, "target_type": "file", "target_uuid": "69fd9393-c0ee-498e-805d-d7199f5ac665", "url": "http://digital.library.jhu.edu/system/files/2022-03/13039-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13039, "target_type": "node", "target_uuid": "7f742ef2-05bf-4a46-b5d8-b76275c45b26", "url": "/node/13039"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "d8de3542-95fe-4575-a3c1-9492eb2a514b"}]}