{"mid": [{"value": 36801}], "uuid": [{"value": "ca9a496a-e841-4b4e-9e94-7616152f9307"}], "vid": [{"value": 36801}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:53:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13036-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:53:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:53:57+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXVII. No. 22<br />\n<br />\nBALTIMORE, MD., DECEMBER 22, 1922<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS REPRESENTED AT ALUMNI TO USHER IN 1923 JAMES M. SPEERS ELECTED FRATERNITY RUSHING SEACHAIRMAN OF INTERNASON ENDS AS FRESHMEN<br />\nMIDDLE STATES ATHLACROSSE SCHEDULE<br />\nACCEPT BIDS<br />\nLETIC CONFERENCE<br />\nAL COMMITTEE<br />\nAPRIL 7<br />\nMaryland<br />\nAppear<br />\nPre-Season Training and Migra- Princeton and<br />\nStudent Friendship Fund Pledges Period of Silence Ends at 12.30<br />\nMonday. Sixty-eight New<br />\nWanted. Deputation Team<br />\non List. Pennsylvania Awardtory Rule Discussed. TwentyMen Pledged<br />\ntwo Colleges Send Delegates<br />\ned 1922 Championship<br />\nContinues Work<br />\nJohns Hopkins was one of the<br />\nTen games comprise the schedMr. James M. Speers, president<br />\nAfter excitedly rushing the more<br />\ntwenty-two colleges represented at ule issued last Tuesday by Mana- of James McCutcheon & Co., linen fortunate freshmen during four<br />\nthe annual conference of the Mid- ger 0. D. Collins, of the University merchants of New<br />\nYork, was re- hectic days, and after enduring a<br />\ndle Atlantic States Collegiate Ath- lacrosse team. The schedule foltense period of silence, the various<br />\ncently elected to the chairmanshir<br />\nletic Conference held at Philadel- lows:<br />\nfraternities at Johns Hopkins last<br />\nof the International Committee of Monday<br />\nphia last Saturday. The conference April 7—Alumni, at home.<br />\nnervously awaited the<br />\nthe Y. M. C. A. Mr. Speers suc- opening of the sealed acceptances.<br />\nwas occupied with the discussion of April 14—Princeton, at home.<br />\nmany important topics which have April 21—Swarthmore, at home. ceeds Mr. Alfred E. Marling, who All during the morning the lucky<br />\nbeen the subject of much debate in April 28—Stevens, at Hoboken. has been a member of the Y. M. C ones of the freshmen class had been<br />\ncollegiate athletic circles lately. May 5—Pennsylvania, at home. A. all his life, and under whose<br />\nad- slipping their cards in the box, and<br />\nJames Wills, president of the<br />\nPre-season training, faculty-con- May 12—Navy, at home or Annapabout noon the crowd began to<br />\nministration, beginning in 1910, the<br />\nstudent chapter, called the meet- trol, the migratory<br />\nrule, and finangather around the postoffice.<br />\nolis.<br />\nwork of the International Commiting to order at 8.15 and the min- cial assistance to athletes by alumAt 12.30 President Macaulay, of<br />\nMay 19—Maryland, at home.<br />\ntee made its greatest progress.<br />\nutes of the previous meeting were ni were. the principal questions May 26—Lehigh,<br />\nthe Interfraternity Board, followed<br />\nat Bethlehem.<br />\nread and approved. Mr. Wills then brought before the conclave.<br />\nThe International Committee, by the crowd, carried the box upJune 2—Mt. Washington (pendconference<br />\nThe<br />\nis<br />\ncomposed<br />\nexplained the purpose of the<br />\nwhich is the general agent of the 2,- stairs to the meeting room, where<br />\ning), at home.<br />\nmeeting, which was to get the at- chiefly of colleges in Pennsylvania June 9—Crescent Club (pending), 000 associations in North America, it was opened and the acceptances<br />\nand New Jersey, Hopkins being<br />\nat home.<br />\ntitude of the members -toward the<br />\nis composed of approximately two read before the board, the common<br />\nthe southernmost institution repNavy will be played at Home- hundred business and professional herd remaining outside. During<br />\norganization and to find out resented.<br />\nPrinceton, Penn State,<br />\nmeeting the famous \"Bill\" Meywhether they would sooner have U. of Pa., Swarthmore, Lehigh and wood this year if the Naval Acad- men of the United States and Can- er<br />\nstood on a stool outside the door,<br />\nemy officials give the Middies perthe meetings' in the afternoon or other such colleges send delegates<br />\nada<br />\nwho,<br />\nwith<br />\ntheir<br />\nemployed<br />\nstaff,<br />\nand<br />\nlooking through, foretold the<br />\nmission to leave Annapolis. Hopin the evening. It was suggested to thrash out their intercollegiate kins played at Annapolis last<br />\ndirect<br />\nthe<br />\nresults<br />\nto the anxiously assembled<br />\nservice<br />\nabroad and ceryear<br />\nthat more students would attend athletic difficulties annually at this. and so no trouble is<br />\nexpected from tain features of the home work of multitude by the expressions on the<br />\nif the meetings were held in tne meeting. The conference cannot the Navy on that<br />\nscore. Prince- the American associations. Through faces of the representatives on the<br />\nafternoon after school. But it.was force any .measures; it merely adton takes the place of West it these associations carry on work board. About 12.35 the results were<br />\nalso stated that speakers could vises that its moves be adopted.<br />\nPoint on the schedule. This game in Europe, Russia, Siberia, Asia, officially announced and the consenot be obtained for the after- Dean McLanahan, of Princeton,<br />\nmarks the first meeting of the two the Near East, Africa, and Latin quent pledge pins were applied.<br />\nnoons and it was finall'y decided presided over the meeting.<br />\nThose pledged by the various frauniversities in lacrosse, and as America.<br />\nto continue having the meetings<br />\nternities<br />\nare as follows:<br />\nThe conduct of training camps Princeton is always a drawing card<br />\nThe following officers were electin the evening.<br />\nbefore the opening of college was in Baltimore, one of the largest ed to serve with Mr. Speers<br />\nBeta Theta Pi: Webster, Ste1st<br />\nThe question of A. S. C. E. pins disapproved by the session. The crowds of the season is expected to vice-chairman for home<br />\nwork, vens, Baldwin, Goodwin, Strobel<br />\nwas then brought up and it was smaller colleges, especially, object witness the game. It is a rather Cleveland E. Dodge, New<br />\nYork and Keller.<br />\ndecided to order pins for those to pre-season training as the ex- severe blow to Army that they have City; 2nd vice-chairman<br />\nPhi Kappa Psi: Donovan, Muth,<br />\nfor home<br />\nwho desired them. The emblem penses of sustaining a camp are too been dropped from the schedule work, Roger H.<br />\nKidd,<br />\nEnsor, Crook, W. Taylor, T.<br />\n'Williams, New<br />\nconsists of a small badge of white great to be carried by institutions this season. Hopkins has given them York City,;<br />\nTaylor,<br />\n1st vice-chairman for<br />\nFluharty and Brown.<br />\nenamel with \"A. S. C. E.\" printed of limited means. Prohibiting the two successive defeats and as they foreign<br />\nwork, William D. Murray, Delta Phi: Burnett, Jackson.<br />\nacross it in blue.<br />\nplaying of men from other college, are not allowed to play Navy be- Plainfield, N.<br />\nAlpha Delta Phi: Welsh, MidJ.; 2nd vice-chairThere were only three Sopho- until their second year of residence fore they beat Hopkins they must man for foreign work, Gerald W. dleton, Howard, Hiss, Slingluff,<br />\nmore members present and it was was another subject proposed to wait at least two more years be- Birks, Montreal.<br />\nSullivan, Jewett, Love, Mills and<br />\ndecided to ask Professor Gregory the conference. This rule is in ef- fore they cross sticks with the MidPledges for support of the Stu- Fonda.<br />\nto speak to the Sophs and try to fect at Hopkins as regards other shipmen. West Point is only al- dent Friendship Fund should be<br />\nPhi Gamma Delta: Heyn, Draper<br />\nget them more interested, which Maryland colleges.<br />\nlowed to play at home. Therefore, handed in to the Y. M. C. A. office<br />\nand Stick.<br />\nis very necessary since the Ju- Another change proposed to the Hopkins had to drop them because not later than the end of January.<br />\nKappa Alpha: Reimer, Mercer<br />\nnior and Senior classes are com- various colleges was control of ath- two trips are all that are allowed The money is due then also. The<br />\nand<br />\nHolls.<br />\nparatively small.<br />\nletics by a faculty committee. This and two trips are necessary this first deputation team of the Y. M.<br />\nPi<br />\nKappa Chi.: Berndt, Milburn,<br />\nEdward Watson was elected has already been accomplished at year with league teams. Maryland C. A. conducted a service at the<br />\nLevy,<br />\nThomsen, Hood, McKay,<br />\nvice-president of the society and Hopkins in the Athletic Council. has been awarded a date in place of First Methodist Episcopal Church<br />\nSanderson,<br />\nBuffington, Townsend<br />\na committee consisting of SomerSome colleges have called upon Syracuse. This was necessary for last Sunday evening at 7 o'clock.<br />\nand Sauerwein.<br />\nit<br />\nis<br />\ninadvisable<br />\nthree<br />\nto<br />\nplay<br />\nhard<br />\nville, Watson and Rome was ap- their alumni to give financial supAlpha Kappa Phi: Hurst, Blome,<br />\nFIELD CLUB HEARS<br />\npointed to provide entertainment port to athletes ; the board strongly games in a row, and Maryland<br />\nshould<br />\nHunter,<br />\nprove<br />\neasy,<br />\nteam<br />\ngiving<br />\nKelbaugh, Almy, Piped,<br />\nthe<br />\nfor future meetings and to arouse advised against this practice.<br />\nLECTURES<br />\na<br />\nrest<br />\nReed<br />\nbetween<br />\nand<br />\nthe<br />\nNavy<br />\nLeand<br />\nCox.<br />\ninterest in their respective classes.<br />\nAt the Field Club meeting on<br />\nhigh<br />\ngames.<br />\nKappa Sigma Sansburg, Riggs,<br />\nMr. Wills has succeeded in obSTUDENT COUNCIL SUGDecember 19, Dr. Andrews spoke<br />\nAll efforts well be turned to beat on -Mammals,\" Dr.<br />\nBuchner<br />\nand Harp.<br />\ntaining a very prominent engineer<br />\nGESTS CHANGE<br />\nCowles on<br />\nPennsylvania and avenge last year's \"Crabs,\" and Mr.<br />\nOmicron<br />\nfrom Southern Maryland to lecKappa<br />\nOmicron:<br />\nMyers on<br />\nAt a meeting of the Student<br />\nture upon \"Gravel Roads,\" upon Council, held on Monday, it was de- 5-3 defeat. The Black and Blue de- \"Eagles.\" Dr. Andrews was the Staub, Pledge, Harrison, Jenson,<br />\nwhich subject he is considered an cided to suggest to the faculty that feat last year came as a complete first speaker and passed around Kaufholtz, Singleton and Grant.<br />\nauthority. This meeting will they do away with the pledge which surprise and deprived Hopkins of specimens of ant-eaters, sloths, arSilver Arrow Club: Mitchell.<br />\nProbably be held about January is now required on quiz and ex- the championship of the Southern madillos, duckbills, echidna and<br />\nDelta Gamma Theta: Ningard<br />\nDivision<br />\nof<br />\nthe<br />\nEastern<br />\nCollegiate<br />\nlarger<br />\na<br />\nthat<br />\nhoped<br />\nit<br />\nand<br />\nis<br />\nand<br />\nKorff.<br />\n15,<br />\n'possum. A live 'possum was then<br />\namination papers. It was pointed<br />\nrepresentation of students will be out that a man who will cheat will Lacrosse League. Pennsylvania exhibited and did \"stunts\" for the<br />\nSigma Tau Delta: Hudson,<br />\ncaught the twelve in a slump last<br />\npresent.<br />\naudience, coached by Dr. Andrews, Chambers and Balls.<br />\nsign his name to a pledge anyway.<br />\nyear and the general feeling is that which<br />\nconsisted of climbing a pole,<br />\nDuring the course of the even- The Student Council suggested that<br />\nthe<br />\n'victory on May 5th will belong hanging<br />\ning a smoker was held.<br />\nto a stick by its tail, and INTERESTING LECTURES AT<br />\nname<br />\nshould<br />\nman's<br />\non<br />\nbe<br />\na<br />\npaper<br />\na<br />\nto J. H. U. Stevens and Lehigh are \"playing 'possum.\"<br />\nTHE MEDICAL SOCIETY<br />\nenough of a sign that the work was<br />\nanxious to meet us this year and<br />\nMr.<br />\nA<br />\nMyers<br />\nthen demonstrated by<br />\nDR. BIGELOW SPEAKS AT his own.<br />\nmeeting of the Medical Soattempt to wipe out the 3-2 and 2-1<br />\nSCHOOL OF HYGIENE<br />\nThe \"Please\" signs on the grass defeats administered to them. means of slides the habits of the ciety of the Johns Hopkins HosAmerican eagle. Research on this pital was held in the amphitheaLast Monday, December 18, Dr. on the campus have been put as a<br />\nThese games should be among the bird<br />\nwas conducted by Dr. Herrick ter of the Medical School on MonW. D. Bigelow, director of the Re- reminder to upper classmen that alhardest fought of the season. in<br />\nVermillion, Ohio, during all of day, December 18, at 8.15 P. M. A<br />\nsearch Laboratories of the National though they have the privilege they<br />\nSwarthmore will be met again this last summer.<br />\nThe slides prepared highly interesting program was<br />\nCanners Association, gave a lecture should refrain from walking on the year. The team was<br />\nbeaten at by Mr. Myers added<br />\nOn \"The Hygenic Aspects of Can- grass.<br />\nmuch to the arranged for the evening. The<br />\nSwarthmore last year by a 6-5<br />\ninterest<br />\nof<br />\nhis<br />\ntalk<br />\nas<br />\na graphic subjects and the speakers were:<br />\nned Foods.\" The address was given<br />\nThe work on the code of ethics, score, in a thrilling game.<br />\nillustration was given of his experi- \"Further Studies of the Capilat the School of Hygiene and Pub • which was announced in preparaEfforts are being made to meet<br />\nhe Health. This was one of the tion<br />\nlaries of the Pigeon's Bone Marin' the columns of this paper Mt. Washington on June 9th in- ences.<br />\nThe<br />\nmeeting<br />\nwas<br />\nconcluded by row,\" by Mr. C. A. Doan.<br />\nseries of De Lamar lectures on hy- some time ago, is making satisfac2nd,<br />\nscheduled.<br />\nJune<br />\nas<br />\nof<br />\nstead<br />\nDr.<br />\nCowles'<br />\n\"Intravascular Development of<br />\nspeaking on \"Crabs in<br />\ngiene given at the school during tory progress and will be tlublished<br />\nThis would eliminate the Crescent the Philippine Islands.\" By means the Red Blood Cells in the Mamthe winter.<br />\nshortly after the Christmas recess. Club game and allow the team a rest<br />\nof photographs, Dr. Cowles showed mal,\" by Dr. R. S. Cunningham<br />\nDr. Bigelow dealt with his subexaminations. If this can- the habits and life history of the and Mr. C. A. Doan.<br />\nduring<br />\nject in its various phases, contrastnot be arranged the Crescent Club different species of crabs. For lack \"Studies of Living Blood Cells,\"<br />\ning the merits of canned and fresh<br />\nwill make its first appearance at of time, he was compelled to cut by Dr. F. N. Sabin.<br />\nISSUE<br />\nOF<br />\nNEXT<br />\nfoods. The tilk was delivered withHomewood<br />\nin about 15 years. The his talk short, but promised to<br />\nNEWS-LETTER<br />\nThe officers of the society are:<br />\nout.any highly technical details and<br />\nMt. Washington game, if held on continue it at the next Field Club President, Dr. Edward<br />\nP. Carter;<br />\nkept the rather large audience inFRIDAY, JAN. 5<br />\nmeeting.<br />\nsecretary,<br />\n3<br />\nDr.<br />\ncol.<br />\npage<br />\nContinued<br />\n2,<br />\non<br />\nHarold<br />\nL.<br />\nAmoss.<br />\nterested throughout.<br />\nAMERICAN SOCIETY OF CIVIL ENGINEERS DISCUSSES PROBLEMS<br />\nBusiness Meeting and Smoker<br />\nHeld Recently. Pins Decided<br />\nUpon for Organization<br />\nThe American Society of Civil<br />\nEngineers held its regular monthly meeting in Room 307, Civil Engineering Building, last Tuesday<br />\nevening at 8.15 with about 20<br />\nmembers present. There were<br />\nnone of the faculty on hand at<br />\nthe meeting.<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1922<br />\n<br />\n2<br />\n<br />\nHOPKINS MEN ATTEND PHIL- HOPKINS TO BE REPRESENT- COLLEGE CAMPAIGN FOR<br />\nRESTORATION OF LOUED AT CONVENTION OF<br />\nADELPHIA MEETING -OF<br />\nVAIN BEGUN<br />\nPENN.<br />\nPROFESSORS<br />\nAT<br />\nA. S. M. E.<br />\nFOUNDED 1897.<br />\nNew York City, December 18.On Thursday, December 14, C. Eleven Faculty Members Will AtLanguage<br />\nAssoModern<br />\ntend<br />\nHunter<br />\nCollege, with a pledge of<br />\nE. Cummings and R. C. D.annettel,<br />\nSessions<br />\nciation<br />\n$2,500, is the first institution of<br />\n$2.00 members of the Hopkins student<br />\nSubscription<br />\nEleven Hopkins professors will higher education in the United<br />\nbranch of the American Society of<br />\nattend the sessions of the thirty- States to announce a contribution<br />\nMechanical Engineers, braved the<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nninth annual convention of the to the campaign for completion of<br />\nsleet storm of that day and jourBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nAssociation of the $1,000,000 fund for restoration<br />\nneyed by automobile to Philadel- Modern Language<br />\nPublished semi-weekly from October to June by the students of Johns phia, the primary object of their America, which will be held for of Louvain Library.<br />\nHopkins University.<br />\ntrip being to attend the regular three days, beginning December<br />\nNew York State College, Albany,<br />\n28, at the University of Pennsylalso has made a pledge to the fund:<br />\nBusiness communications should be addressed to the BUSINESS MAN- monthly meeting of the Philadel- vania.<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications phia section of the society, held at<br />\nDr. Gilbert Chinard, professor of $1,000 for one of the fifty bells<br />\nshould be sent to the MANAGING EDITOR.<br />\nSwarthmore College.<br />\nFrench, will read a paper on \"Ma- which will form the carillon in the<br />\n100<br />\nHomewood<br />\nIn the afternoon a stop was made lame d'Haundetot and Her Amer- tower of the restored library.<br />\nTelephone<br />\nRenewal of the campaign for<br />\nat Chester, Pa., where the Scott ican Friends,\" describing the acquaintances<br />\nwhich<br />\nthis<br />\nprominent<br />\nManager:<br />\nBusiness<br />\nEditor-in-Chief:<br />\nPaper Mills were inspected. FolAmerica's war memorial in BelWILLIAM H. MOORE, JR., '23.<br />\nlowing this they attended the for- Frenchwornan made while in Co- gium was begun in New York<br />\nGLOVER P. FALLON, '23.<br />\nmal dinner for the entire Philadel- lonial America.<br />\nManaging Editor:<br />\nState December 3. Since that date,<br />\nAdvertising Manager:<br />\nHUFFARD,<br />\n'23.<br />\nJ. HUDSON<br />\nphia section, held at Swarthmore. Dr. David S. Blondheim, assoDONALD K. VANNEMAN,'23.<br />\nboth the College of the City of New<br />\nThe business meeting of the so- ciate professor of French, will deAssistant Managing Editor:<br />\nCirculation Manager:<br />\nJOSEPH S. LEOPOLD, '24.<br />\nciety was next in order. The most liver a lecture on \"Some Etymolo- York and New York University<br />\nHOWARD,<br />\n'25.<br />\nW.<br />\nPHILIP<br />\nAssociate Editors:<br />\nimportant speaker to address the gies.\" This talk should especially have been making canvasses for the<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nfund which have not yet been comAssistant Business Managers: meeting was Mr. Samuel R. Horn, interest language scholars.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nDr. Hermann Collits, professor<br />\na<br />\nnoted<br />\nRussian<br />\nsocialist, who depleted.<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nnounced the late regime of Czar- of Germanic Philology, will speak<br />\nThe campaign in New York exD. MILES MARRIAN, '25.<br />\nism and spoke of his own desolate on \"A Century of Grimm's Law,\"<br />\nJunior Editors:<br />\nbefore a special meeting devoted to tends not only into the universities<br />\nG. DONALD GIESKE, '25.<br />\nRICHARD C. TILGHMAN, '25.<br />\nyears in his native country.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nand colleges, but -into all the public<br />\nThe following day was spent in discussions of historical grammar<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\nschools of the state. An estimate<br />\nW. EDWARD THOMSEN, '26.<br />\nan inspection trip of the Navy and linguistics.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nmade from reports already received<br />\nYard. The various engineering fear: Dr. Ernest P. Kuhl, of the ColERNEST A. STRATHMAN, '26.<br />\nA. J. MoKAY, '26.<br />\nthe public schools of New<br />\ntures of the Yard were inspected lege Courses for Teachers at Hop- indicates<br />\nalone will contribute<br />\nYork<br />\nCity<br />\nkins,<br />\nwill<br />\nalso<br />\npresent<br />\na<br />\npaper.<br />\naRd a more complete survey was<br />\ntoward restoring the fa$25,000<br />\nAmong<br />\nthe<br />\nother<br />\nHopkins<br />\nmen<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nmade of one of the newest governmous library.<br />\nment dirigible balloon carriers, the who expect to attend the convention are Professors James W. Universities and colleges in other<br />\nU. S. S. Wright. This is the larBright, Herbert E. Greene and states will participate in the camPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. gest blimp carrier<br />\nat the present<br />\nJohn<br />\nC. French, of the department paign during the early months of<br />\ntime in government service.<br />\nof<br />\nEnglish;<br />\nDr. H. Carrington Lan- 1923.<br />\nThe detailed account of this trip<br />\ncaster,<br />\nprofessor<br />\nof French; Dr. The national committee is headed<br />\nBALTIMORE, MD., DECEMBER 22. 1922<br />\nwill probably be given at the next<br />\nGruenbaum,<br />\nassociate in Ro- by Dr. Nicholas Murray Butler,<br />\nGustav<br />\nmonthly meeting of the Hopkins<br />\nrpance<br />\nLanguages;<br />\nDr. William president of Columbia University,<br />\nbranch of the A. S. M. E. The<br />\nand<br />\nDr. Robert and has as members many of the<br />\nKurrelmeyer<br />\nvarious mechanical features seen in<br />\nA COMMENDABLE MOVE<br />\nassociate<br />\nprofessor best-known educators of the United<br />\nBruce<br />\nRoutson,<br />\nthe inspection will be given in deStates.<br />\nThe Sigma Chi Beta Honorary Fraternity is to be commended tail. It is felt by the leaders of the of German.<br />\nfor its action in having our misused campus placarded. The request society that such intercourse beof the President of the University and the Student Council fell upon tween the various chapters will ma-'7.1.410.171mir7iimt,7<br />\n400<br />\n-.<br />\ndeaf ears. Pleas for a pathless campus were ignored in the grand terially strengthen the whole society.<br />\nBoth<br />\nof<br />\nthe<br />\nmen<br />\nwho<br />\nmade<br />\nrush for the convenience of a short-cut. The \"Please\" signs have dithe trip are mechanical engineering<br />\ntraffic.<br />\ninconsiderate<br />\nverted the major part of this thoughtless,<br />\nseniors.<br />\nDisregard of the beautiful is becoming too typically American.<br />\nBeauty is sacrificed for service in architecture, thoroughfares and<br />\nALUMNI TO USHER IN 1923<br />\nFOR CHRISTMAS<br />\nother semi-utilities. If the college man leaves undeveloped his aesLACROSSE SEASON<br />\nthetic tastes, the prospect of a survival of the solely beautiful in this<br />\nContinued from page 1.<br />\n<br />\nThe Johns<br />\n<br />\nRI<br />\n<br />\nHopkins News-Letter<br />\n<br />\nThe Dial<br />\n<br />\nJune 9th, would be a feature of the<br />\nJune Senior Week. Interest in this<br />\ngame would be intense, due to Mt.<br />\nWashington's setback last year at<br />\nthe hands of Hopkins, 6-3.<br />\n\"Father Bill\" Schmeisser and<br />\nCaptain John Murphy will work<br />\nbeauty.<br />\nout<br />\nplace<br />\nof<br />\nwith the candidates two days<br />\nkins a<br />\nduring the holidays. Prospects are<br />\nbright and very few men are. lost<br />\nfrom<br />\nlast year's team. There are a<br />\nPLEDGEES<br />\nTHE<br />\nTO<br />\nWORD<br />\nA<br />\nRushing Season, with all its uncertainties and all its discom- number of available freshmen who<br />\nforts, is a thing of the past. Hollow eyes and a few sore spots which have had high school experience 111<br />\nwill soon disappear are the only memories of activities which in lacrosse to replace the loss of<br />\nBauernschmidt, Parsons, Turner<br />\nreality began with the opening of the University in October.<br />\nand Calkins. .The new lacrosse<br />\nalready<br />\nyou<br />\nhave<br />\nA word of advice to the pled,gees. Perhaps<br />\nfelt a change. You are about to undergo an evolution from the sub- coach will be announced after, the<br />\nlime to the near-ridiculous. You will no longer be feted and dined, Christmas recess.<br />\nCaptain John Murphy and Coach<br />\nrushed for dates and made to feel that you are the \"prince of good<br />\n\"Bill\"<br />\nSchmeisser represented Hopfellows.\" Competition is ended. You are safely within the fold and<br />\nyou will be made to feel, often with the smooth side of a paddle, kins at the annual meeting of the<br />\nEastern<br />\nCollegiate<br />\nLacrosse<br />\nperhaps, that you are only an ordinary Freshman after all.<br />\ntorLeague<br />\nat<br />\nHotel<br />\nPennsylvania,<br />\nin<br />\nthat<br />\nyour<br />\nmind<br />\nin<br />\nkeep<br />\nindignities,<br />\nDespite'any seeming<br />\nmentors bear no .malice toward you. Your heads are a bit swelled, New York. It was decided, upon<br />\nyou know, by the attention shown you and it is necessary that meas- suggestion of \"Father Bill,\" to<br />\nures be taken to reduce the swelling and show you your proper place. award the championship of the<br />\nEverything that is done, however, has as its purpose- the making of,a Southern division to the University<br />\nof Pennsylvania. The Southern dibetter fraternity man and a better. Hopkins man.<br />\nIn conclusion, Freshmen, work hard for your fraternity. You vision leadership ended in a triple<br />\nwill be well repaid for every stroke that you do. Do not become so tie between Penn, Lehigh and Hopinvolved in its interests, however, So that you lose sight of the inter- kins. Penn has never held the chamin your life, but pionship and was awarded this<br />\nests of your college. Your fraternity is a.big thing<br />\n,<br />\nyour college is a bigger thing. Make it Hopkins first and fraternity honor in the way of encouragement<br />\nin the lacrosse field.<br />\nJ. S. L.<br />\nsecond.<br />\n<br />\nA Superior gift for Superior People<br />\n<br />\ncountry grows extremely dim.<br />\nSurely, man labors for more than mere material gain. The things<br />\nthat appeal to the finer senses must certainly make life much more<br />\nworth-while to those who struggle for an existence.<br />\nIf Sigma Chi Beta does no more than to preserve a spirit of love<br />\nof the beautiful, it will fill a much needed gap in college life.<br />\nRead and observe, gentlemen, \"Please\" help make Johns Hop-<br />\n<br />\nSPECIAL<br />\nCHRISTMAS<br />\nOFFER<br />\n1 Gift Subscription $4.00<br />\n2. Gift Subscriptions<br />\n<br />\n7.00<br />\n<br />\n3 Gift Subscriptions 10.00<br />\nEach additional gift<br />\nsubscription at<br />\n<br />\n3.00<br />\n<br />\nThe regular annual rate of<br />\nThe Dial is $5.00. The reductions in our Christmas<br />\noffer are therefore quite<br />\nsubstantial. If you desire,<br />\nan appropriate Christmas<br />\ncard will be mailed by The<br />\nDial to the recipient,<br />\nannouncing your gift on<br />\nChristmas day. Or, if you<br />\ndesire, the card will be sent<br />\nto you for mailing direct.<br />\n1),<br />\ni,<br />\n<br />\n(<br />\n<br />\n1<br />\nli<br />\n.<br />\ni<br />\nI<br />\ni<br />\n<br />\nI...<br />\n<br />\nAstonish and delight your<br />\ndiscriminating friends with<br />\na subscription to THE DIAL<br />\n-America's leading journal<br />\nof art and letters.<br />\nTHE DIAL is a peculiarly<br />\nappropriate gift for all those<br />\nsensitive to beauty and<br />\nideas. THE DIAL is not only<br />\na gift but a compliment. Its<br />\nselection implies a personal<br />\nattention, an expenditure<br />\nof time and thought rather<br />\nthan of money alone, which<br />\nis distinctly flattering to the<br />\nintelligence and taste of the<br />\nreceipient.<br />\nTheDial is the easiest gift possible<br />\nto make.All the time,excitement,<br />\nworry of Christmas shopping is<br />\neliminated. Send us your list today. THE DIAL will do the rest<br />\nand arrive every month of the<br />\nyear as a source of interest and<br />\nenjoyment, and a constant reminder of your thoughtfulness.<br />\n<br />\n....<br />\n<br />\nTHE DIAL<br />\n152 West 13th Street, New York City.<br />\nGentlemen: You may send THE DIAL for 1 year or<br />\nto the following addresses:<br />\nNclttle<br />\n<br />\nName<br />\n<br />\nAddress<br />\n<br />\nAddress<br />\n<br />\nName .<br />\n<br />\nName<br />\n<br />\nAddress<br />\n<br />\nAddress-<br />\n<br />\nyears<br />\n<br />\n........ ..... • .....<br />\n<br />\nMy name is<br />\n,'<br />\nAddressDI enclose $<br />\n<br />\n0I will remit $<br />\n<br />\non receipt of your bill.<br />\n<br />\nsi<br />\nkallib..::::4•11.C::::4111P:::rallifg:..1111ft'<br />\n<br />\nI<br />\n.....<br />\n4003„;:imir.)<br />\n,<br />\n....1.00..-,..-1.mli€,..1110e...:410CiamP.<br />\n<br />\n11(<br />\nti<br />\nn<br />\n<br />\nRI<br />\n<br />\n13<br />\n<br />\nS,<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1922.<br />\n<br />\nJR<br />\n<br />\nof<br />\nof<br />\nted<br />\nLon<br />\nof<br />\non<br />\n<br />\niy,<br />\nd:<br />\nlls<br />\nhe<br />\nor<br />\n<br />\nrk<br />\nte.<br />\n<br />\n!AV<br />\n<br />\nIV<br />\n<br />\nhe<br />\nn<br />\n<br />\nxes<br />\nic<br />\nte<br />\n<br />\nte<br />\n<br />\n1)f<br />\n<br />\nr,<br />\n<br />\nRUSHING NUMBER OF BLACK<br />\nAND BLUE JAY APPEARS<br />\nThe December Rushing number of the Black and Blue Jay<br />\nmade its appearance Wednesday.<br />\nAs may be implied from its<br />\nname, the Rushing number dealt<br />\nwith the new pledgees and the<br />\nvarious sides of fraternity life.<br />\nThe Black and Blue Jay regrets<br />\nto announce the resignation of L.<br />\nB. Fenneman as editor-in-chief.<br />\nFenneman has attended the \"bird\"<br />\nsince its first peep and has done<br />\nmuch to make it the fat and<br />\nhealthy publication which now appears. Paul L. Ives was elected<br />\neditor-in-chief at a recent meeting held to fill the vacancy.<br />\nThe Business Staff has announced that a subscription for<br />\nthe last five issues may be obtained for $1. It has also announced the election of Walsh<br />\nand Waldorf, both '26, to the<br />\nBusiness Staff.<br />\nY. M. C. A. HOLDS CABINET<br />\nMEETING<br />\nAt a weekly meeting of the Y.<br />\nM. C. A. cabinet held last Tuesday night at the Barn,-the question of definite membership in the<br />\nJohns Hopkins Student Y. M. C.<br />\nA. has no specific requirements<br />\nand discussed. At present the<br />\nUniversity \"Y\" was brought up<br />\nfor membership. In fact, the members of the cabinet are at present<br />\nthe only real members of the association on the campus.<br />\nThe cabinet is working now on<br />\na plan whereby students who desire to go upon record as supporting the Y. M. C. A. and its various activities may do so by becoming regular members. These<br />\nmembers will probably be asied<br />\nto subscribe to various Christian<br />\nprinciples or rules, and they must<br />\nbe willing to support and aid the<br />\n\"Y\" in its study circles, Bible<br />\nClasses and student eN-angelistic<br />\ncampaigns.<br />\nThis Is a Keen One<br />\n\"Gee, you're a Gefii!\"<br />\n\"Well, would Gillette me kiss<br />\nyou?\"<br />\n\"Say, Kid, I'm Everready.\"—<br />\nHarvard Lampoon.<br />\nThe sofa sagged it- the center,<br />\nThe shades were pulled just so;<br />\nThe family had retired,<br />\nThe parlor light burned low.<br />\nThen came a sound from the sofa<br />\nAs the clock was striking two,<br />\nAnd the girl slammed her book<br />\nWith a thankful, \"Well, I'm<br />\nthrough.\"<br />\n—Yellow Jacket.<br />\nHe—\"What would_ you think if<br />\nI stole one sweet kiss?\"<br />\nShe—\"I'd say you were like the<br />\nburglar who had a chance to get<br />\n$100 and took a dime.\"—Ex.<br />\nBand Leader (giving instructions)—\"And, don't forget you're<br />\nliars.\"<br />\n<br />\nMAILBAG<br />\nContinued from page 4<br />\n<br />\nATTENTION, A. A. BOARD<br />\nTo the Editor-in-Chief of the<br />\nJohns Hopkins NEWS-LETTER.<br />\nDear Sir: It recently- occurred<br />\nto me that no recognition of any<br />\nservice performed was given to assistant managers. Although the responsibility falls on the manager,<br />\nthe assistant managers often bear<br />\na great portion of the work, and I<br />\nwould suggest to the Athletic<br />\nBoard that an award in the form<br />\nof an FT. A. A. be given to certain<br />\nassistant managers in the future.<br />\nThis award would be some encouragement for juniors and seniors to accept these jobs and would<br />\neliminate the chances of first and<br />\nsecond-year men making these positions when they come out in a halfhearted way to get out of Physical<br />\nTraining. I do not mean to say<br />\nthat this was the case in football<br />\nthis past season, but this thing has<br />\nbeen done before.<br />\nI would limit this award merely<br />\nto football, except in special cases<br />\nin other sports, where the men are<br />\nparticularly deserving. A. A. Board,<br />\nRead! Consider! Act!<br />\nYours in good faith,<br />\nHULLABALOO.<br />\nLITERARY PUBLICATION<br />\nSTAFF MEETS<br />\nAt 12:30 on Wednesday, another<br />\nmeeting of those interested in starting a literary publication at the<br />\nJohns Hopkins University was held.<br />\nAs only a few had previous knowledge of the meeting, the attendance<br />\nwas small. To those present, it was<br />\nevident that there are several obstacles to be surmounted. Proper<br />\nauthority for publishing such a periodical must be obtained, and a feasible plan for financing the venture<br />\nmust be made. Although the financial side of the matter has received<br />\nsome consideration, nothing definite<br />\nhas been done in any direction.<br />\n<br />\n3<br />\n<br />\nWOMEN THOUGHT ILLNESS<br />\n\"The King of Lubricants\"<br />\nROMANTIC 100 YEARS AGO<br />\n\"Rome in the Days of Byron and<br />\nCLEANING, PRESSING •<br />\nShelley\" was the subject of a lecREPAIRING<br />\nture delivered last Wednesday by<br />\n2601 OAK ST.<br />\nDr. Norman W. DeWitt, professor<br />\nof Latin Literature in Victoria College, University of Toronto, and<br />\nwidely known Canadian archaeolFOR COLD WEATHER<br />\nTHE PLACE TO BUY<br />\nMOTOR LUBRICATION<br />\nogist. The lecture was given unCIGARS<br />\nSODA<br />\nCANDY<br />\nSHERWOOD BROTHERS, INC.<br />\nder the auspices of the Baltimore<br />\nS. E. Cor. OAK & 27th ST.<br />\nChapter of the Archaeological Inmi::::1:311amanammumanzazzumunauzi<br />\nstitute of America, of which Dr.<br />\n\\V. E. Miller, professor of Greek<br />\nat Hopkins, was recently re-elected<br />\ncouncilor.<br />\nTAILORS<br />\nA hundred years ago, according<br />\nUniforms and Liveries<br />\nto Dr. DeWitt, it was quite the<br />\n1 28 W. Fayette St., Near Liberty St.<br />\nthing for young women to faint as<br />\nBaltimore, Md.<br />\nmuch as they could in public, and<br />\nwomen of all ages thought it ro- The Flag, Banner & Pennant Shop<br />\nORDERS RECEIVED FOR<br />\n(Successors to Sisco Brothers)<br />\nmantic to be ill. The instances of<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nthe delicate, fainting young hero- Emblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\nines in old novels had ample basis<br />\nTransfer and Baggage Express<br />\nPARK AVE., BALTIMORE, MD.<br />\nof support. Furthermore, Dr. De- 302<br />\nAUTOMOBILE SERVICE<br />\nVernon 2355<br />\nR. H. Taylor<br />\nWitt said that even so famous a<br />\nPHONE, HOMEWOOD 2645-W<br />\npoet as Lord Byron succumbed to<br />\nthe popular fancy that it was ro1 W. University Parkway<br />\nmantic to be ill, and even more roOpposite J. H U. Athletic Field<br />\nmantic to die in one's youth.<br />\nThe modern trend toward polit- DRUG STORE for J. H. U. BOYS<br />\nPHONE, HOMEWOOD 2121<br />\nical and individual freedom, Dr.<br />\nDeWitt went on to say, may be<br />\ntraced directly back to a •strong<br />\nHot Dinners,Sandwiches,<br />\natiti-religious feeling which sprang<br />\nCandies, Sodas, Cigarettes,<br />\nPrinters of Philological and<br />\nup through the civilized world a<br />\nScientific Works<br />\ncentury ago. This anti-religious<br />\nTobacco, etc.<br />\n23 B. HANOVER ST.<br />\nspirit, he said, had its advantages,<br />\nAT THE BARN<br />\nBaltimore, Md.<br />\nfor the people in turning aside from<br />\nreligion hit upon a new interest in<br />\nart and centered its new interest<br />\nlargely upon the relics of ancient<br />\nRome. Rome had more theaters<br />\nand individuality is offered here at prices that are not<br />\nand coffee houses 100 years ago,<br />\nand cannot be underquoted by any house atany time.<br />\nsaid Dr. DeWitt, than it has today.<br />\n11 Besides the reputation of an old-established firm<br />\n<br />\nSCOTT---The Tailor<br />\n<br />\nNICK DIETOR<br />\n<br />\nA. JACOBS & SONS<br />\n<br />\nCOGGINS'<br />\n<br />\nR.G.by& Company<br />\n<br />\nThe BARN<br />\nCAFETERIA<br />\n<br />\nJ. H. Furst & Co.<br />\n<br />\nFURNITURE OF QUALITY<br />\nis back of each sale with a guarantee.<br />\n<br />\nY. M. C. A. TO GIVE DINNER<br />\nFOR FOREIGN STUDENTS<br />\n<br />\nOn January 5, 1923, at 6:30<br />\nP. M., the Y. M. C. A. will give a<br />\ndinner at the Friends Meeting.<br />\nHouse, Homewood, to which all the<br />\nforeign students are invited.<br />\nThe purpose of the dinner is to<br />\npromote a feeling of comradeship<br />\nIN THE GLOAMING<br />\namong the foreign students, as well<br />\nIn the gloaming, oh, my darling,<br />\nas to give an impetus to the CosWhen the lights are dim and<br />\nmopolitan Club, which is composed<br />\nlow,<br />\nentirely of foreigners.<br />\nThat your face is powder painted<br />\nDr. Frank J. Goodnow, Dr. John<br />\nHow am I sweetheart to know?<br />\nC. French and Mr. Morriss, of the<br />\nTwice this month I've had to<br />\nCentral Y. M. C. A., will be the<br />\nbundle<br />\nguests of the evening.<br />\nEvery coat that I possess<br />\nAt present there are twenty-seven<br />\nTo the cleaners—won't you, darforeign students on the roll at the<br />\nling,<br />\n\"Y\" office, distributed as follows:<br />\n•<br />\nLove me more and powder less?<br />\nPorto Rico 5, Mexico 1, France 1,<br />\nChina 5, Palestine 1, Russia 5,<br />\nIn the gloaming, oh, my darling,<br />\nEcuador 1, Canada 2 and Japan 4.<br />\nWhen the lights are dim and<br />\nlow,<br />\nPROF. CHINARD READS<br />\nThat your lip is sharp with whisPAPER AT SOCIETY<br />\nkers<br />\nYou can get your hat I know! Professor Chinard, professor of<br />\nIf I powder, I must do it<br />\nFrench Literature, read a paOr else suffer great distress;<br />\nper on Sainte-Beewe's Theories of<br />\nBut a razor won't you, darling?<br />\nFrench Verse and Their Influence<br />\nLather more—I'll powder less!<br />\nnext meeting<br />\n—Phoenix. on Victor Hugo at the<br />\nPhilogical<br />\nHopkins<br />\nof the Johns<br />\nAssociation on Thursday, December<br />\n21, at 11:30 A. M.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n<br />\nDRAPERIES<br />\n<br />\n343 NORTH CHARLES STREET<br />\n<br />\nMount Vernon Place<br />\nMethodist Episcopal Church<br />\nAt the Washington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe Sunday afternoon -At Home\"<br />\nin the -Blue and Grey Room- from<br />\nfive to seven, followed by the young<br />\npeople's service will appeal to you<br />\nYou are invited.<br />\nSunday morning worship at 11 &clock-Sunday evening service at 8 o'clock—<br />\nMusic by vested chorus-choir of soloists<br />\nALL SEATS FREE<br />\n<br />\nge-IALD.ING<br />\n- Indoor and Outdoor<br />\nAthletic Equipment<br />\n<br />\nAeroplane medicine—one drop<br />\nWill kill you.<br />\n<br />\nNOTICE<br />\nChristmas holidays this<br />\nyear will extend from Saturday morning, December 23,<br />\nuntil Tuesday morning, January 2, 1923. Out-of-town<br />\nstudents who are going home<br />\nfor the holidays may have an<br />\nextra day holiday by applying to the acting dean.<br />\n<br />\nMAILBAG<br />\n<br />\ncflarag<br />\n011irishrtas<br />\nanb<br />\n<br />\nPaPPg<br />\n\\T.etti Near<br />\n<br />\nContinued from page 4<br />\n<br />\nthis is an appeal to justice. Coo, coo, co-eds? Who's<br />\nloony now?<br />\nriot act<br />\n<br />\n0<br />\nBecause I do not wish it to appear that I cower beneath the cloak<br />\nof anonymity, and as I have had<br />\nmy fun in watching the wiseacres<br />\nguess my identity, I make my public bow.<br />\nB. DOROTHY LEVIN,<br />\nStep-daughter.<br />\n<br />\nEverything for<br />\nevery sport,in.<br />\nsweaters,<br />\njerseys, shoes,etc.<br />\n<br />\ntterie)<br />\nCi4eXa<br />\n%)ItMtS H.&OSCARGLk<br />\noWN ER9<br />\n<br />\nCatalogue sent on request<br />\n<br />\nlort4 14fr:°<br />\n.4t1DE*.<br />\n<br />\n29 Baltimore St., East<br />\n<br />\n‘;21<br />\n,<br />\nle5a€09<br />\n110 E. Baltimore Street<br />\n<br />\n.1<br />\n<br />\nOne Door West of Lieit St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br />\n<br />\nOWENS & HECKLINGER<br />\nTAILORS<br />\nMAKERS OF COLLEGE CLOTHES<br />\nBALTIMORE, MD.<br />\n18 ST. PAUL ST.<br />\n<br />\n\f4<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1922.<br />\n<br />\nHOMEWOOD PLAA SHOP- To Arms, Ye Braves! Step-Sister<br />\nPERS GIVE PERFORMPromises \"A Hot Time on<br />\nANCES<br />\nThe Campus\"<br />\nZip<br />\n,tzuittarb<br />\nCo.<br />\nSpecial performances for chil- To the Editor of the Mailbag.<br />\nHoliday Books<br />\nDear Sir: When is a co-ed not<br />\nBeautiful Illustrated Gift Editions, dren were given last Saturday<br />\nafternoon December 16, by mem- a co-ed? When she's a Hopkins coBiography, Travel, Fiction.<br />\nChildren's Books<br />\nbers of the Homewood Playshop, ed. But the true question seems<br />\nFountain Pens and Silver Pencils,<br />\norganization composed of fac- to be—are we co-eds or are we not<br />\nan<br />\nMedical Books of All Publishers<br />\nulty members and others connect- The answer to that is also the anat<br />\nin any way with Hopkins, who swer to the problem—shall we be<br />\ned<br />\nCharles<br />\n.301 N.<br />\nSt.<br />\npresented a program of plays at welcomed<br />\nor shall we not?<br />\nthe Young Women's Christian<br />\none<br />\nNo<br />\ndoubts that heterogen<br />\nORTMAN<br />\nAssociation for the benefit of the<br />\n\"Queen Quality\" Home-made women's fair of the Maryland eous collection of T. B. M., schoolChocolates<br />\nmarms and flappers known ato<br />\nLuncheonette League of Women Voters.<br />\nIces<br />\nIce Cream<br />\n227 N. Howard 518 N. Charles \"The Birthday of the Infanta,\" \"Teachers' College\" is co-educa<br />\nDancing Every Afternoon at<br />\na poetic drama by Maurice A. tional. Then, too, with very specia<br />\nCharles St.<br />\nHanline, was interpreted by Mari- permission<br />\nwomen are admitted tc<br />\nano Badillo, Stanley Worden,<br />\nurldergraduate courses. As you<br />\nDonald Kirkley, Miss Helen<br />\nTHE NEWS LETTER'S<br />\nadmit,<br />\nthe graduate school is unWittman, Miss Anna Moss. Miss<br />\n211-213 E. BALTIMORE ST.<br />\nMAILBAG<br />\nMary Moss and Miss Suzanne doubtedly co-educational.<br />\nAlA Column in Which the Correspondents Foster. \"The Constant Lover,\"<br />\na though we are similarly trained we<br />\nAre Allowed Latitude, But Shoulromantic<br />\ncomedy<br />\nby<br />\nSt.<br />\nJohn<br />\nreceive different degrees. That is<br />\nder the Responsibility.<br />\nHankin, was also presented with our only<br />\nAll letters intended for publication<br />\npoint of divergence. Techmust be concise, written in ink on Joseph A. Moran and Miss Lillian<br />\nregular letter size paper, on one side<br />\nnically, we are not co-eds; really<br />\nonly.<br />\nGore in the leading roles. An exNo attention will be paid to anonywe are. Or it may be the other<br />\nmous letters, but names signed as an tra added feature was a Chinese<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be musical novelty • which was pre- way around. At any rate, we adomitted.<br />\nsented by Shih Hsi Lin, a student vance; ostrich-like, Hopkins hides<br />\nThe publication of a letter is not to<br />\nits head in the sand.<br />\nbe taken as an indorsement of its views in the Medical School.<br />\nby the \"News-Letter,\" which invites the<br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br />\nWe are sorry that you have been<br />\nfreest discussion of matters of general<br />\nThe managing committee of the<br />\ninterest.<br />\nPlayshoppers includes Emory C. ignorant of the presence of your<br />\nA LETTER FROM MUSICAL Shipley, Jr., William E. Trout, Jr., -lady schoolmates.\" Shall we lay<br />\nMiss Blanche Green and Miss the blame on the fact that you gaze<br />\nCLUBS MANAGEMENT<br />\nINSTRUCTION<br />\never to the heights and cannot see GRADUATE SCHOOL<br />\nHelen Metcalf.<br />\nOF ARTS AND SCIENCES. Degrees: Master of<br />\nTo the Editor of the<br />\nus who meekly kneel at the feet of<br />\nArts; Doctor of Philosophy.<br />\nNEWS-LETTER:<br />\noften accused of not supporting Learning? Or shall we lay the MEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nIt IS a source of regret to the oftheir university in the proper spirit. blame on inflated egos, and lord-of- COLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nficers and sponsors of the Glee Club Certainly those who know us are creation complexes?<br />\nENGINEERING. Degrees: Doctor of Engineering; MasOF<br />\nWe are grieved to note that \"if SCHOOL<br />\nthat it has not come up to expecta- doing all they can to help us along.<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\ntions this year. When they started Those who don't know us cannot be there has been any line drawn beChemistry.<br />\ntween the sins and daughters of<br />\nout, it was with the desire to have blamed for their attitude, for their<br />\nscHopL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of PubHopkins, the latter are responsible,<br />\nlic Health; Doctor of Science and Bachelor of Science in Hygiene; Certifia good-sized club, of about seventy- interest has never been aroused. for<br />\nthe former have been so igThese concerts are one of the finest<br />\ncate in Public Health.<br />\nfive voices, which could make mapossible mediums for associations norant of the existerice of their SCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nterial progress in vocal music. The between the<br />\ncitizens and the stu- lady schoolmates that they have not COLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nend in view was not merely a glee dents; and, when they are given out seen the necessity of a barrier.\"<br />\nclub, but rather a choral society, of town they are eminently instru- But the barrier is there. Whether SUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nwhose benefit to the university mental in attracting men to the uni- it was built before or after we came<br />\nis a mootable question, although as COURSES IN SOCIAL ECONOMICS.<br />\nwould be incidental to its benefit to versity.<br />\nits members. Acting in good faith<br />\nYet, after all, the benefit to the unsolvable as—\"which came first, EVENING COURSES in Business Economics and for Technical Workers.<br />\nand with the best of intentions, they student is the primary concern of the chicken or the egg ?\"<br />\nYou ask for specific charges. You<br />\nsecured Mr. Bochau, who has a rep- the Musical Club. The securing of<br />\nutation for excellent work along Mr. Bochau was the first outward ask me to indict Hopkins—a stepthese lines, to direct the rehearsals, sign of a movement which has been daughterly thing to do. Distaste- JOHN HOPKINS PRESS PUBLICATIONS.<br />\nso that no time would be lost in hap- agitated for some time, namely, to ful, but necessary. Your sins, Hophazard training. At first, the un- get a course in music into the Johns kins, are those of omission rather<br />\nBUILDINGS<br />\ndergraduates readily responded to Hopkins, so that instruction, not than those of commission. What<br />\nHALL—general library, class rooms, biology, administration.<br />\nthis effort, and from sixty to seven- only in voice culture, but also in the you don't do is more vital to us GILMAN<br />\nty men reported at the first few re- playing of all instruments, can be than what you do do. You admit MECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nhearsals. That was the beginning. carried on under capable supervis- us to your university. Very comSince then, the attendance at these ion, and academic credit be given mendable; your duty seems done. CIVIL ENGINEERING—housing also Geology.<br />\nweekly rehearsals has steadily for satisfactory completion of the But we dangle—dangle. We have POWER HOUSE.<br />\ndropped off. When seventy men set courses. Mr. Turnbull and Mr. no spirit, no incentive to better our BOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nGarden.<br />\nwere present at the first meetings Bochau are behind the idea, but the standard, no pride in our school.<br />\nand enrolled as members of the Hopkins authorities, though they There is only a lethargic indiffer- CHEMICAL LABORATORY—for graduate work.<br />\nclub, they practically pledged them- have endorsed it heartily, have been ence. Our slogan becomes;<br />\nPHYSIOLOGICAL BUILDING.<br />\nselves to attend rehearsals regularly unable to secure its adoption. Funds We're here because we're here beANATOMICAL LABORATORY.<br />\nand to remain in active service in have not been forthcoming, so that<br />\ncause we're here because we're<br />\nHUNTERIAN LABORATORIES.<br />\nthe society. Depending on them to all hope for securing the course this<br />\nhere,<br />\nPATHOLOGIC<br />\nAL LABORATORY.<br />\nthe man, Mr. Bochau went ahead year has been abandoned. How- We're here because we're here bewith his instruction and the Music- ever, it is only a question of time<br />\ncause we're here because we're SCHOOL OF HYGIENE.<br />\nal Club with its plans. Consequent- when this step will be taken. The<br />\nhere,<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nly, the dropping out of a little less Glee Club is in a position to give<br />\nSuppose Hopkins treated her STUDENT ACTIVITIES BUILDING.<br />\nthan half of this number has alter- excellent preliminary instruction in sons the same way? (Perish the<br />\nALUMNI MEMORIAL DORMITORY.<br />\ned materially everything which the 'vocal music, while the other musical thought.) 'Where would Hopkins<br />\nMusical Club has done in the Glee clubs are ready to do the same be? A school is only as strong as<br />\n'EM CLEAN AND PUT A<br />\nClub's interest.<br />\nalong other lines of musical devel- its 'spirit and no stronger than its ALUMNI AND SCHOLARSHIP •'WE CLEAN<br />\nCREASE THAT STAYS PUT<br />\nAsk Tom Landy<br />\nThe present situation, certainly, opment. Thus a nucleus will be fur- weakest element. Hopkins has spirNOTES<br />\nFree Auto Service<br />\n8 Branches<br />\nis not all that can be hoped for. In nished for the course when it is it, courage, and undeniable excelBurton J. Castner, who took the<br />\nBALDWIN<br />\n&<br />\nBRADY<br />\nan effort to build up the club to finally installed, and no time will<br />\nbe lence of scholarship. Yet—we dan- degree of Bachelor of Arts this<br />\nCleaning, Dyeing, Pressing<br />\nthe desired membership, the Mu- lost in getting down to effective gle. We are the feet of clay of an year, has been appointed to the fel4032 ROLAND AVE.<br />\nsical Club, immediately after the work.<br />\notherwise admirable statue of learn- lowship in psychology for 1922-23,<br />\nMain Store—Tuxedo 2148<br />\nChristmas recess, will carry on a<br />\nAll men are urged to watch for ing. Have you ever been feet of the funds for which have been given Leave Garments with Landy or Phone re<br />\ndrive among the members of the the drive and to come out for the clay? Pleasant? Yes?<br />\nrecently by the Nela Laboratory of<br />\ngraduate and medical schools, as clubs and to give them their supPlease do not congratulate your- Cleveland, Ohio. The president of<br />\nHALF HOUR AT LEAST<br />\nFirst College Boy—It's getting<br />\nwell as among those of the under port.<br />\nselves for granting the nineteenth the Nela Laboratory is a former<br />\nlight in the east.<br />\ngraduate body. The object is to<br />\nTHE MAXAGEMENT OF THE amendment. It means as little as Hopkins man.<br />\nSecond Ditto—Great Scott! I<br />\norganize a large club which, under<br />\nMUSICAL CLUBS. the eighteenth. Finally, you ask A \"Jumble Inn Scholarship\" for<br />\nhave been in bed an hour<br />\nshould<br />\nthe guidance of Mr. Bochau, will<br />\nus to \"start something.\" We have.<br />\n1922-23 has been awarded to Miss<br />\nago.—New<br />\nYork Sun.<br />\nbe able to give concerts, in conjuncWith . the kind permission of the<br />\nAnna D. Finesinger, a student in<br />\ntion with the well-known Johns<br />\nrespected boards to which we must<br />\nthe College Courses for Teachers. Lady to Freshman on street car:<br />\nLACROSSE NOTICE<br />\nHopkins Orchestra, in and about<br />\nappeal there'll be a hot time on the<br />\nLacrosse practice will not<br />\n\"And which end of the car do I<br />\nthe city. These public appearances<br />\nold campus soon. To arms, co-eds!<br />\nWomen may be a puzzle, but get off from?\"<br />\nbe suspended during the<br />\n'really help a great deal in making<br />\nBut remember, I do not read the few men<br />\nare willing to give them<br />\nholidays.<br />\nRah: \"Well, madam, both ends<br />\nHopkins known. Baltimoreans are<br />\nContinued on Page 3, col. 3<br />\nq.—Widow.<br />\nstop.\"—Emory Wheel.<br />\n<br />\nTHE BOOK MART<br />\n<br />\npooh<br />\n<br />\nFor<br />\nStyle's Sake,<br />\nLet Your<br />\nNew Clothes Be<br />\n<br />\nCLOTHES<br />\n<br />\nThe Johns Hopkins University<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXVII. No. 22<br /><br />\nBALTIMORE, MD., DECEMBER 22, 1922<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS REPRESENTED AT ALUMNI TO USHER IN 1923 JAMES M. SPEERS ELECTED FRATERNITY RUSHING SEACHAIRMAN OF INTERNASON ENDS AS FRESHMEN<br />\nMIDDLE STATES ATHLACROSSE SCHEDULE<br />\nACCEPT BIDS<br />\nLETIC CONFERENCE<br />\nAL COMMITTEE<br />\nAPRIL 7<br />\nMaryland<br />\nAppear<br />\nPre-Season Training and Migra- Princeton and<br />\nStudent Friendship Fund Pledges Period of Silence Ends at 12.30<br />\nMonday. Sixty-eight New<br />\nWanted. Deputation Team<br />\non List. Pennsylvania Awardtory Rule Discussed. TwentyMen Pledged<br />\ntwo Colleges Send Delegates<br />\ned 1922 Championship<br />\nContinues Work<br />\nJohns Hopkins was one of the<br />\nTen games comprise the schedMr. James M. Speers, president<br />\nAfter excitedly rushing the more<br />\ntwenty-two colleges represented at ule issued last Tuesday by Mana- of James McCutcheon &amp; Co., linen fortunate freshmen during four<br />\nthe annual conference of the Mid- ger 0. D. Collins, of the University merchants of New<br />\nYork, was re- hectic days, and after enduring a<br />\ndle Atlantic States Collegiate Ath- lacrosse team. The schedule foltense period of silence, the various<br />\ncently elected to the chairmanshir<br />\nletic Conference held at Philadel- lows:<br />\nfraternities at Johns Hopkins last<br />\nof the International Committee of Monday<br />\nphia last Saturday. The conference April 7—Alumni, at home.<br />\nnervously awaited the<br />\nthe Y. M. C. A. Mr. Speers suc- opening of the sealed acceptances.<br />\nwas occupied with the discussion of April 14—Princeton, at home.<br />\nmany important topics which have April 21—Swarthmore, at home. ceeds Mr. Alfred E. Marling, who All during the morning the lucky<br />\nbeen the subject of much debate in April 28—Stevens, at Hoboken. has been a member of the Y. M. C ones of the freshmen class had been<br />\ncollegiate athletic circles lately. May 5—Pennsylvania, at home. A. all his life, and under whose<br />\nad- slipping their cards in the box, and<br />\nJames Wills, president of the<br />\nPre-season training, faculty-con- May 12—Navy, at home or Annapabout noon the crowd began to<br />\nministration, beginning in 1910, the<br />\nstudent chapter, called the meet- trol, the migratory<br />\nrule, and finangather around the postoffice.<br />\nolis.<br />\nwork of the International Commiting to order at 8.15 and the min- cial assistance to athletes by alumAt 12.30 President Macaulay, of<br />\nMay 19—Maryland, at home.<br />\ntee made its greatest progress.<br />\nutes of the previous meeting were ni were. the principal questions May 26—Lehigh,<br />\nthe Interfraternity Board, followed<br />\nat Bethlehem.<br />\nread and approved. Mr. Wills then brought before the conclave.<br />\nThe International Committee, by the crowd, carried the box upJune 2—Mt. Washington (pendconference<br />\nThe<br />\nis<br />\ncomposed<br />\nexplained the purpose of the<br />\nwhich is the general agent of the 2,- stairs to the meeting room, where<br />\ning), at home.<br />\nmeeting, which was to get the at- chiefly of colleges in Pennsylvania June 9—Crescent Club (pending), 000 associations in North America, it was opened and the acceptances<br />\nand New Jersey, Hopkins being<br />\nat home.<br />\ntitude of the members -toward the<br />\nis composed of approximately two read before the board, the common<br />\nthe southernmost institution repNavy will be played at Home- hundred business and professional herd remaining outside. During<br />\norganization and to find out resented.<br />\nPrinceton, Penn State,<br />\nmeeting the famous \"Bill\" Meywhether they would sooner have U. of Pa., Swarthmore, Lehigh and wood this year if the Naval Acad- men of the United States and Can- er<br />\nstood on a stool outside the door,<br />\nemy officials give the Middies perthe meetings' in the afternoon or other such colleges send delegates<br />\nada<br />\nwho,<br />\nwith<br />\ntheir<br />\nemployed<br />\nstaff,<br />\nand<br />\nlooking through, foretold the<br />\nmission to leave Annapolis. Hopin the evening. It was suggested to thrash out their intercollegiate kins played at Annapolis last<br />\ndirect<br />\nthe<br />\nresults<br />\nto the anxiously assembled<br />\nservice<br />\nabroad and ceryear<br />\nthat more students would attend athletic difficulties annually at this. and so no trouble is<br />\nexpected from tain features of the home work of multitude by the expressions on the<br />\nif the meetings were held in tne meeting. The conference cannot the Navy on that<br />\nscore. Prince- the American associations. Through faces of the representatives on the<br />\nafternoon after school. But it.was force any .measures; it merely adton takes the place of West it these associations carry on work board. About 12.35 the results were<br />\nalso stated that speakers could vises that its moves be adopted.<br />\nPoint on the schedule. This game in Europe, Russia, Siberia, Asia, officially announced and the consenot be obtained for the after- Dean McLanahan, of Princeton,<br />\nmarks the first meeting of the two the Near East, Africa, and Latin quent pledge pins were applied.<br />\nnoons and it was finall'y decided presided over the meeting.<br />\nThose pledged by the various frauniversities in lacrosse, and as America.<br />\nto continue having the meetings<br />\nternities<br />\nare as follows:<br />\nThe conduct of training camps Princeton is always a drawing card<br />\nThe following officers were electin the evening.<br />\nbefore the opening of college was in Baltimore, one of the largest ed to serve with Mr. Speers<br />\nBeta Theta Pi: Webster, Ste1st<br />\nThe question of A. S. C. E. pins disapproved by the session. The crowds of the season is expected to vice-chairman for home<br />\nwork, vens, Baldwin, Goodwin, Strobel<br />\nwas then brought up and it was smaller colleges, especially, object witness the game. It is a rather Cleveland E. Dodge, New<br />\nYork and Keller.<br />\ndecided to order pins for those to pre-season training as the ex- severe blow to Army that they have City; 2nd vice-chairman<br />\nPhi Kappa Psi: Donovan, Muth,<br />\nfor home<br />\nwho desired them. The emblem penses of sustaining a camp are too been dropped from the schedule work, Roger H.<br />\nKidd,<br />\nEnsor, Crook, W. Taylor, T.<br />\n'Williams, New<br />\nconsists of a small badge of white great to be carried by institutions this season. Hopkins has given them York City,;<br />\nTaylor,<br />\n1st vice-chairman for<br />\nFluharty and Brown.<br />\nenamel with \"A. S. C. E.\" printed of limited means. Prohibiting the two successive defeats and as they foreign<br />\nwork, William D. Murray, Delta Phi: Burnett, Jackson.<br />\nacross it in blue.<br />\nplaying of men from other college, are not allowed to play Navy be- Plainfield, N.<br />\nAlpha Delta Phi: Welsh, MidJ.; 2nd vice-chairThere were only three Sopho- until their second year of residence fore they beat Hopkins they must man for foreign work, Gerald W. dleton, Howard, Hiss, Slingluff,<br />\nmore members present and it was was another subject proposed to wait at least two more years be- Birks, Montreal.<br />\nSullivan, Jewett, Love, Mills and<br />\ndecided to ask Professor Gregory the conference. This rule is in ef- fore they cross sticks with the MidPledges for support of the Stu- Fonda.<br />\nto speak to the Sophs and try to fect at Hopkins as regards other shipmen. West Point is only al- dent Friendship Fund should be<br />\nPhi Gamma Delta: Heyn, Draper<br />\nget them more interested, which Maryland colleges.<br />\nlowed to play at home. Therefore, handed in to the Y. M. C. A. office<br />\nand Stick.<br />\nis very necessary since the Ju- Another change proposed to the Hopkins had to drop them because not later than the end of January.<br />\nKappa Alpha: Reimer, Mercer<br />\nnior and Senior classes are com- various colleges was control of ath- two trips are all that are allowed The money is due then also. The<br />\nand<br />\nHolls.<br />\nparatively small.<br />\nletics by a faculty committee. This and two trips are necessary this first deputation team of the Y. M.<br />\nPi<br />\nKappa Chi.: Berndt, Milburn,<br />\nEdward Watson was elected has already been accomplished at year with league teams. Maryland C. A. conducted a service at the<br />\nLevy,<br />\nThomsen, Hood, McKay,<br />\nvice-president of the society and Hopkins in the Athletic Council. has been awarded a date in place of First Methodist Episcopal Church<br />\nSanderson,<br />\nBuffington, Townsend<br />\na committee consisting of SomerSome colleges have called upon Syracuse. This was necessary for last Sunday evening at 7 o'clock.<br />\nand Sauerwein.<br />\nit<br />\nis<br />\ninadvisable<br />\nthree<br />\nto<br />\nplay<br />\nhard<br />\nville, Watson and Rome was ap- their alumni to give financial supAlpha Kappa Phi: Hurst, Blome,<br />\nFIELD CLUB HEARS<br />\npointed to provide entertainment port to athletes ; the board strongly games in a row, and Maryland<br />\nshould<br />\nHunter,<br />\nprove<br />\neasy,<br />\nteam<br />\ngiving<br />\nKelbaugh, Almy, Piped,<br />\nthe<br />\nfor future meetings and to arouse advised against this practice.<br />\nLECTURES<br />\na<br />\nrest<br />\nReed<br />\nbetween<br />\nand<br />\nthe<br />\nNavy<br />\nLeand<br />\nCox.<br />\ninterest in their respective classes.<br />\nAt the Field Club meeting on<br />\nhigh<br />\ngames.<br />\nKappa Sigma Sansburg, Riggs,<br />\nMr. Wills has succeeded in obSTUDENT COUNCIL SUGDecember 19, Dr. Andrews spoke<br />\nAll efforts well be turned to beat on -Mammals,\" Dr.<br />\nBuchner<br />\nand Harp.<br />\ntaining a very prominent engineer<br />\nGESTS CHANGE<br />\nCowles on<br />\nPennsylvania and avenge last year's \"Crabs,\" and Mr.<br />\nOmicron<br />\nfrom Southern Maryland to lecKappa<br />\nOmicron:<br />\nMyers on<br />\nAt a meeting of the Student<br />\nture upon \"Gravel Roads,\" upon Council, held on Monday, it was de- 5-3 defeat. The Black and Blue de- \"Eagles.\" Dr. Andrews was the Staub, Pledge, Harrison, Jenson,<br />\nwhich subject he is considered an cided to suggest to the faculty that feat last year came as a complete first speaker and passed around Kaufholtz, Singleton and Grant.<br />\nauthority. This meeting will they do away with the pledge which surprise and deprived Hopkins of specimens of ant-eaters, sloths, arSilver Arrow Club: Mitchell.<br />\nProbably be held about January is now required on quiz and ex- the championship of the Southern madillos, duckbills, echidna and<br />\nDelta Gamma Theta: Ningard<br />\nDivision<br />\nof<br />\nthe<br />\nEastern<br />\nCollegiate<br />\nlarger<br />\na<br />\nthat<br />\nhoped<br />\nit<br />\nand<br />\nis<br />\nand<br />\nKorff.<br />\n15,<br />\n'possum. A live 'possum was then<br />\namination papers. It was pointed<br />\nrepresentation of students will be out that a man who will cheat will Lacrosse League. Pennsylvania exhibited and did \"stunts\" for the<br />\nSigma Tau Delta: Hudson,<br />\ncaught the twelve in a slump last<br />\npresent.<br />\naudience, coached by Dr. Andrews, Chambers and Balls.<br />\nsign his name to a pledge anyway.<br />\nyear and the general feeling is that which<br />\nconsisted of climbing a pole,<br />\nDuring the course of the even- The Student Council suggested that<br />\nthe<br />\n'victory on May 5th will belong hanging<br />\ning a smoker was held.<br />\nto a stick by its tail, and INTERESTING LECTURES AT<br />\nname<br />\nshould<br />\nman's<br />\non<br />\nbe<br />\na<br />\npaper<br />\na<br />\nto J. H. U. Stevens and Lehigh are \"playing 'possum.\"<br />\nTHE MEDICAL SOCIETY<br />\nenough of a sign that the work was<br />\nanxious to meet us this year and<br />\nMr.<br />\nA<br />\nMyers<br />\nthen demonstrated by<br />\nDR. BIGELOW SPEAKS AT his own.<br />\nmeeting of the Medical Soattempt to wipe out the 3-2 and 2-1<br />\nSCHOOL OF HYGIENE<br />\nThe \"Please\" signs on the grass defeats administered to them. means of slides the habits of the ciety of the Johns Hopkins HosAmerican eagle. Research on this pital was held in the amphitheaLast Monday, December 18, Dr. on the campus have been put as a<br />\nThese games should be among the bird<br />\nwas conducted by Dr. Herrick ter of the Medical School on MonW. D. Bigelow, director of the Re- reminder to upper classmen that alhardest fought of the season. in<br />\nVermillion, Ohio, during all of day, December 18, at 8.15 P. M. A<br />\nsearch Laboratories of the National though they have the privilege they<br />\nSwarthmore will be met again this last summer.<br />\nThe slides prepared highly interesting program was<br />\nCanners Association, gave a lecture should refrain from walking on the year. The team was<br />\nbeaten at by Mr. Myers added<br />\nOn \"The Hygenic Aspects of Can- grass.<br />\nmuch to the arranged for the evening. The<br />\nSwarthmore last year by a 6-5<br />\ninterest<br />\nof<br />\nhis<br />\ntalk<br />\nas<br />\na graphic subjects and the speakers were:<br />\nned Foods.\" The address was given<br />\nThe work on the code of ethics, score, in a thrilling game.<br />\nillustration was given of his experi- \"Further Studies of the Capilat the School of Hygiene and Pub • which was announced in preparaEfforts are being made to meet<br />\nhe Health. This was one of the tion<br />\nlaries of the Pigeon's Bone Marin' the columns of this paper Mt. Washington on June 9th in- ences.<br />\nThe<br />\nmeeting<br />\nwas<br />\nconcluded by row,\" by Mr. C. A. Doan.<br />\nseries of De Lamar lectures on hy- some time ago, is making satisfac2nd,<br />\nscheduled.<br />\nJune<br />\nas<br />\nof<br />\nstead<br />\nDr.<br />\nCowles'<br />\n\"Intravascular Development of<br />\nspeaking on \"Crabs in<br />\ngiene given at the school during tory progress and will be tlublished<br />\nThis would eliminate the Crescent the Philippine Islands.\" By means the Red Blood Cells in the Mamthe winter.<br />\nshortly after the Christmas recess. Club game and allow the team a rest<br />\nof photographs, Dr. Cowles showed mal,\" by Dr. R. S. Cunningham<br />\nDr. Bigelow dealt with his subexaminations. If this can- the habits and life history of the and Mr. C. A. Doan.<br />\nduring<br />\nject in its various phases, contrastnot be arranged the Crescent Club different species of crabs. For lack \"Studies of Living Blood Cells,\"<br />\ning the merits of canned and fresh<br />\nwill make its first appearance at of time, he was compelled to cut by Dr. F. N. Sabin.<br />\nISSUE<br />\nOF<br />\nNEXT<br />\nfoods. The tilk was delivered withHomewood<br />\nin about 15 years. The his talk short, but promised to<br />\nNEWS-LETTER<br />\nThe officers of the society are:<br />\nout.any highly technical details and<br />\nMt. Washington game, if held on continue it at the next Field Club President, Dr. Edward<br />\nP. Carter;<br />\nkept the rather large audience inFRIDAY, JAN. 5<br />\nmeeting.<br />\nsecretary,<br />\n3<br />\nDr.<br />\ncol.<br />\npage<br />\nContinued<br />\n2,<br />\non<br />\nHarold<br />\nL.<br />\nAmoss.<br />\nterested throughout.<br />\nAMERICAN SOCIETY OF CIVIL ENGINEERS DISCUSSES PROBLEMS<br />\nBusiness Meeting and Smoker<br />\nHeld Recently. Pins Decided<br />\nUpon for Organization<br />\nThe American Society of Civil<br />\nEngineers held its regular monthly meeting in Room 307, Civil Engineering Building, last Tuesday<br />\nevening at 8.15 with about 20<br />\nmembers present. There were<br />\nnone of the faculty on hand at<br />\nthe meeting.<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1922<br /><br />\n2<br /><br />\nHOPKINS MEN ATTEND PHIL- HOPKINS TO BE REPRESENT- COLLEGE CAMPAIGN FOR<br />\nRESTORATION OF LOUED AT CONVENTION OF<br />\nADELPHIA MEETING -OF<br />\nVAIN BEGUN<br />\nPENN.<br />\nPROFESSORS<br />\nAT<br />\nA. S. M. E.<br />\nFOUNDED 1897.<br />\nNew York City, December 18.On Thursday, December 14, C. Eleven Faculty Members Will AtLanguage<br />\nAssoModern<br />\ntend<br />\nHunter<br />\nCollege, with a pledge of<br />\nE. Cummings and R. C. D.annettel,<br />\nSessions<br />\nciation<br />\n$2,500, is the first institution of<br />\n$2.00 members of the Hopkins student<br />\nSubscription<br />\nEleven Hopkins professors will higher education in the United<br />\nbranch of the American Society of<br />\nattend the sessions of the thirty- States to announce a contribution<br />\nMechanical Engineers, braved the<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nninth annual convention of the to the campaign for completion of<br />\nsleet storm of that day and jourBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nAssociation of the $1,000,000 fund for restoration<br />\nneyed by automobile to Philadel- Modern Language<br />\nPublished semi-weekly from October to June by the students of Johns phia, the primary object of their America, which will be held for of Louvain Library.<br />\nHopkins University.<br />\ntrip being to attend the regular three days, beginning December<br />\nNew York State College, Albany,<br />\n28, at the University of Pennsylalso has made a pledge to the fund:<br />\nBusiness communications should be addressed to the BUSINESS MAN- monthly meeting of the Philadel- vania.<br />\nAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications phia section of the society, held at<br />\nDr. Gilbert Chinard, professor of $1,000 for one of the fifty bells<br />\nshould be sent to the MANAGING EDITOR.<br />\nSwarthmore College.<br />\nFrench, will read a paper on \"Ma- which will form the carillon in the<br />\n100<br />\nHomewood<br />\nIn the afternoon a stop was made lame d'Haundetot and Her Amer- tower of the restored library.<br />\nTelephone<br />\nRenewal of the campaign for<br />\nat Chester, Pa., where the Scott ican Friends,\" describing the acquaintances<br />\nwhich<br />\nthis<br />\nprominent<br />\nManager:<br />\nBusiness<br />\nEditor-in-Chief:<br />\nPaper Mills were inspected. FolAmerica's war memorial in BelWILLIAM H. MOORE, JR., '23.<br />\nlowing this they attended the for- Frenchwornan made while in Co- gium was begun in New York<br />\nGLOVER P. FALLON, '23.<br />\nmal dinner for the entire Philadel- lonial America.<br />\nManaging Editor:<br />\nState December 3. Since that date,<br />\nAdvertising Manager:<br />\nHUFFARD,<br />\n'23.<br />\nJ. HUDSON<br />\nphia section, held at Swarthmore. Dr. David S. Blondheim, assoDONALD K. VANNEMAN,'23.<br />\nboth the College of the City of New<br />\nThe business meeting of the so- ciate professor of French, will deAssistant Managing Editor:<br />\nCirculation Manager:<br />\nJOSEPH S. LEOPOLD, '24.<br />\nciety was next in order. The most liver a lecture on \"Some Etymolo- York and New York University<br />\nHOWARD,<br />\n'25.<br />\nW.<br />\nPHILIP<br />\nAssociate Editors:<br />\nimportant speaker to address the gies.\" This talk should especially have been making canvasses for the<br />\nRIGNAL W. BALDWIN, JR., '23.<br />\nfund which have not yet been comAssistant Business Managers: meeting was Mr. Samuel R. Horn, interest language scholars.<br />\nWILLIAM G. DEAN, JR., '24.<br />\nDr. Hermann Collits, professor<br />\na<br />\nnoted<br />\nRussian<br />\nsocialist, who depleted.<br />\nRANDOLPH NORWOOD, '24.<br />\nBERNARD C. HEARN, '23.<br />\nT. REESE MARSH, '24.<br />\nFITZGERALD DUNNING, '24.<br />\nnounced the late regime of Czar- of Germanic Philology, will speak<br />\nThe campaign in New York exD. MILES MARRIAN, '25.<br />\nism and spoke of his own desolate on \"A Century of Grimm's Law,\"<br />\nJunior Editors:<br />\nbefore a special meeting devoted to tends not only into the universities<br />\nG. DONALD GIESKE, '25.<br />\nRICHARD C. TILGHMAN, '25.<br />\nyears in his native country.<br />\nJOHN W. PARSONS, '25.<br />\nJ. D. SLAUGHTER, '23.<br />\nand colleges, but -into all the public<br />\nThe following day was spent in discussions of historical grammar<br />\nBENJAMIN T. ROME, '25.<br />\nJOHN C. LEWIS, JR., '23<br />\nschools of the state. An estimate<br />\nW. EDWARD THOMSEN, '26.<br />\nan inspection trip of the Navy and linguistics.<br />\nJOHN T. DIXON, '24.<br />\nJ. ARTHUR NELSON, JR., '26.<br />\nmade from reports already received<br />\nYard. The various engineering fear: Dr. Ernest P. Kuhl, of the ColERNEST A. STRATHMAN, '26.<br />\nA. J. MoKAY, '26.<br />\nthe public schools of New<br />\ntures of the Yard were inspected lege Courses for Teachers at Hop- indicates<br />\nalone will contribute<br />\nYork<br />\nCity<br />\nkins,<br />\nwill<br />\nalso<br />\npresent<br />\na<br />\npaper.<br />\naRd a more complete survey was<br />\ntoward restoring the fa$25,000<br />\nAmong<br />\nthe<br />\nother<br />\nHopkins<br />\nmen<br />\nMember of Southern Intercollegiate Newspaper Association.<br />\nmade of one of the newest governmous library.<br />\nment dirigible balloon carriers, the who expect to attend the convention are Professors James W. Universities and colleges in other<br />\nU. S. S. Wright. This is the larBright, Herbert E. Greene and states will participate in the camPrinted by The Read-Taylor Co., Lombard and South Sts., Baltimore, Md. gest blimp carrier<br />\nat the present<br />\nJohn<br />\nC. French, of the department paign during the early months of<br />\ntime in government service.<br />\nof<br />\nEnglish;<br />\nDr. H. Carrington Lan- 1923.<br />\nThe detailed account of this trip<br />\ncaster,<br />\nprofessor<br />\nof French; Dr. The national committee is headed<br />\nBALTIMORE, MD., DECEMBER 22. 1922<br />\nwill probably be given at the next<br />\nGruenbaum,<br />\nassociate in Ro- by Dr. Nicholas Murray Butler,<br />\nGustav<br />\nmonthly meeting of the Hopkins<br />\nrpance<br />\nLanguages;<br />\nDr. William president of Columbia University,<br />\nbranch of the A. S. M. E. The<br />\nand<br />\nDr. Robert and has as members many of the<br />\nKurrelmeyer<br />\nvarious mechanical features seen in<br />\nA COMMENDABLE MOVE<br />\nassociate<br />\nprofessor best-known educators of the United<br />\nBruce<br />\nRoutson,<br />\nthe inspection will be given in deStates.<br />\nThe Sigma Chi Beta Honorary Fraternity is to be commended tail. It is felt by the leaders of the of German.<br />\nfor its action in having our misused campus placarded. The request society that such intercourse beof the President of the University and the Student Council fell upon tween the various chapters will ma-'7.1.410.171mir7iimt,7<br />\n400<br />\n-.<br />\ndeaf ears. Pleas for a pathless campus were ignored in the grand terially strengthen the whole society.<br />\nBoth<br />\nof<br />\nthe<br />\nmen<br />\nwho<br />\nmade<br />\nrush for the convenience of a short-cut. The \"Please\" signs have dithe trip are mechanical engineering<br />\ntraffic.<br />\ninconsiderate<br />\nverted the major part of this thoughtless,<br />\nseniors.<br />\nDisregard of the beautiful is becoming too typically American.<br />\nBeauty is sacrificed for service in architecture, thoroughfares and<br />\nALUMNI TO USHER IN 1923<br />\nFOR CHRISTMAS<br />\nother semi-utilities. If the college man leaves undeveloped his aesLACROSSE SEASON<br />\nthetic tastes, the prospect of a survival of the solely beautiful in this<br />\nContinued from page 1.<br /><br />\nThe Johns<br /><br />\nRI<br /><br />\nHopkins News-Letter<br /><br />\nThe Dial<br /><br />\nJune 9th, would be a feature of the<br />\nJune Senior Week. Interest in this<br />\ngame would be intense, due to Mt.<br />\nWashington's setback last year at<br />\nthe hands of Hopkins, 6-3.<br />\n\"Father Bill\" Schmeisser and<br />\nCaptain John Murphy will work<br />\nbeauty.<br />\nout<br />\nplace<br />\nof<br />\nwith the candidates two days<br />\nkins a<br />\nduring the holidays. Prospects are<br />\nbright and very few men are. lost<br />\nfrom<br />\nlast year's team. There are a<br />\nPLEDGEES<br />\nTHE<br />\nTO<br />\nWORD<br />\nA<br />\nRushing Season, with all its uncertainties and all its discom- number of available freshmen who<br />\nforts, is a thing of the past. Hollow eyes and a few sore spots which have had high school experience 111<br />\nwill soon disappear are the only memories of activities which in lacrosse to replace the loss of<br />\nBauernschmidt, Parsons, Turner<br />\nreality began with the opening of the University in October.<br />\nand Calkins. .The new lacrosse<br />\nalready<br />\nyou<br />\nhave<br />\nA word of advice to the pled,gees. Perhaps<br />\nfelt a change. You are about to undergo an evolution from the sub- coach will be announced after, the<br />\nlime to the near-ridiculous. You will no longer be feted and dined, Christmas recess.<br />\nCaptain John Murphy and Coach<br />\nrushed for dates and made to feel that you are the \"prince of good<br />\n\"Bill\"<br />\nSchmeisser represented Hopfellows.\" Competition is ended. You are safely within the fold and<br />\nyou will be made to feel, often with the smooth side of a paddle, kins at the annual meeting of the<br />\nEastern<br />\nCollegiate<br />\nLacrosse<br />\nperhaps, that you are only an ordinary Freshman after all.<br />\ntorLeague<br />\nat<br />\nHotel<br />\nPennsylvania,<br />\nin<br />\nthat<br />\nyour<br />\nmind<br />\nin<br />\nkeep<br />\nindignities,<br />\nDespite'any seeming<br />\nmentors bear no .malice toward you. Your heads are a bit swelled, New York. It was decided, upon<br />\nyou know, by the attention shown you and it is necessary that meas- suggestion of \"Father Bill,\" to<br />\nures be taken to reduce the swelling and show you your proper place. award the championship of the<br />\nEverything that is done, however, has as its purpose- the making of,a Southern division to the University<br />\nof Pennsylvania. The Southern dibetter fraternity man and a better. Hopkins man.<br />\nIn conclusion, Freshmen, work hard for your fraternity. You vision leadership ended in a triple<br />\nwill be well repaid for every stroke that you do. Do not become so tie between Penn, Lehigh and Hopinvolved in its interests, however, So that you lose sight of the inter- kins. Penn has never held the chamin your life, but pionship and was awarded this<br />\nests of your college. Your fraternity is a.big thing<br />\n,<br />\nyour college is a bigger thing. Make it Hopkins first and fraternity honor in the way of encouragement<br />\nin the lacrosse field.<br />\nJ. S. L.<br />\nsecond.<br /><br />\nA Superior gift for Superior People<br /><br />\ncountry grows extremely dim.<br />\nSurely, man labors for more than mere material gain. The things<br />\nthat appeal to the finer senses must certainly make life much more<br />\nworth-while to those who struggle for an existence.<br />\nIf Sigma Chi Beta does no more than to preserve a spirit of love<br />\nof the beautiful, it will fill a much needed gap in college life.<br />\nRead and observe, gentlemen, \"Please\" help make Johns Hop-<br /><br />\nSPECIAL<br />\nCHRISTMAS<br />\nOFFER<br />\n1 Gift Subscription $4.00<br />\n2. Gift Subscriptions<br /><br />\n7.00<br /><br />\n3 Gift Subscriptions 10.00<br />\nEach additional gift<br />\nsubscription at<br /><br />\n3.00<br /><br />\nThe regular annual rate of<br />\nThe Dial is $5.00. The reductions in our Christmas<br />\noffer are therefore quite<br />\nsubstantial. If you desire,<br />\nan appropriate Christmas<br />\ncard will be mailed by The<br />\nDial to the recipient,<br />\nannouncing your gift on<br />\nChristmas day. Or, if you<br />\ndesire, the card will be sent<br />\nto you for mailing direct.<br />\n1),<br />\ni,<br /><br />\n(<br /><br />\n1<br />\nli<br />\n.<br />\ni<br />\nI<br />\ni<br /><br />\nI...<br /><br />\nAstonish and delight your<br />\ndiscriminating friends with<br />\na subscription to THE DIAL<br />\n-America's leading journal<br />\nof art and letters.<br />\nTHE DIAL is a peculiarly<br />\nappropriate gift for all those<br />\nsensitive to beauty and<br />\nideas. THE DIAL is not only<br />\na gift but a compliment. Its<br />\nselection implies a personal<br />\nattention, an expenditure<br />\nof time and thought rather<br />\nthan of money alone, which<br />\nis distinctly flattering to the<br />\nintelligence and taste of the<br />\nreceipient.<br />\nTheDial is the easiest gift possible<br />\nto make.All the time,excitement,<br />\nworry of Christmas shopping is<br />\neliminated. Send us your list today. THE DIAL will do the rest<br />\nand arrive every month of the<br />\nyear as a source of interest and<br />\nenjoyment, and a constant reminder of your thoughtfulness.<br /><br />\n....<br /><br />\nTHE DIAL<br />\n152 West 13th Street, New York City.<br />\nGentlemen: You may send THE DIAL for 1 year or<br />\nto the following addresses:<br />\nNclttle<br /><br />\nName<br /><br />\nAddress<br /><br />\nAddress<br /><br />\nName .<br /><br />\nName<br /><br />\nAddress<br /><br />\nAddress-<br /><br />\nyears<br /><br />\n........ ..... • .....<br /><br />\nMy name is<br />\n,'<br />\nAddressDI enclose $<br /><br />\n0I will remit $<br /><br />\non receipt of your bill.<br /><br />\nsi<br />\nkallib..::::4•11.C::::4111P:::rallifg:..1111ft'<br /><br />\nI<br />\n.....<br />\n4003„;:imir.)<br />\n,<br />\n....1.00..-,..-1.mli€,..1110e...:410CiamP.<br /><br />\n11(<br />\nti<br />\nn<br /><br />\nRI<br /><br />\n13<br /><br />\nS,<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1922.<br /><br />\nJR<br /><br />\nof<br />\nof<br />\nted<br />\nLon<br />\nof<br />\non<br /><br />\niy,<br />\nd:<br />\nlls<br />\nhe<br />\nor<br /><br />\nrk<br />\nte.<br /><br />\n!AV<br /><br />\nIV<br /><br />\nhe<br />\nn<br /><br />\nxes<br />\nic<br />\nte<br /><br />\nte<br /><br />\n1)f<br /><br />\nr,<br /><br />\nRUSHING NUMBER OF BLACK<br />\nAND BLUE JAY APPEARS<br />\nThe December Rushing number of the Black and Blue Jay<br />\nmade its appearance Wednesday.<br />\nAs may be implied from its<br />\nname, the Rushing number dealt<br />\nwith the new pledgees and the<br />\nvarious sides of fraternity life.<br />\nThe Black and Blue Jay regrets<br />\nto announce the resignation of L.<br />\nB. Fenneman as editor-in-chief.<br />\nFenneman has attended the \"bird\"<br />\nsince its first peep and has done<br />\nmuch to make it the fat and<br />\nhealthy publication which now appears. Paul L. Ives was elected<br />\neditor-in-chief at a recent meeting held to fill the vacancy.<br />\nThe Business Staff has announced that a subscription for<br />\nthe last five issues may be obtained for $1. It has also announced the election of Walsh<br />\nand Waldorf, both '26, to the<br />\nBusiness Staff.<br />\nY. M. C. A. HOLDS CABINET<br />\nMEETING<br />\nAt a weekly meeting of the Y.<br />\nM. C. A. cabinet held last Tuesday night at the Barn,-the question of definite membership in the<br />\nJohns Hopkins Student Y. M. C.<br />\nA. has no specific requirements<br />\nand discussed. At present the<br />\nUniversity \"Y\" was brought up<br />\nfor membership. In fact, the members of the cabinet are at present<br />\nthe only real members of the association on the campus.<br />\nThe cabinet is working now on<br />\na plan whereby students who desire to go upon record as supporting the Y. M. C. A. and its various activities may do so by becoming regular members. These<br />\nmembers will probably be asied<br />\nto subscribe to various Christian<br />\nprinciples or rules, and they must<br />\nbe willing to support and aid the<br />\n\"Y\" in its study circles, Bible<br />\nClasses and student eN-angelistic<br />\ncampaigns.<br />\nThis Is a Keen One<br />\n\"Gee, you're a Gefii!\"<br />\n\"Well, would Gillette me kiss<br />\nyou?\"<br />\n\"Say, Kid, I'm Everready.\"—<br />\nHarvard Lampoon.<br />\nThe sofa sagged it- the center,<br />\nThe shades were pulled just so;<br />\nThe family had retired,<br />\nThe parlor light burned low.<br />\nThen came a sound from the sofa<br />\nAs the clock was striking two,<br />\nAnd the girl slammed her book<br />\nWith a thankful, \"Well, I'm<br />\nthrough.\"<br />\n—Yellow Jacket.<br />\nHe—\"What would_ you think if<br />\nI stole one sweet kiss?\"<br />\nShe—\"I'd say you were like the<br />\nburglar who had a chance to get<br />\n$100 and took a dime.\"—Ex.<br />\nBand Leader (giving instructions)—\"And, don't forget you're<br />\nliars.\"<br /><br />\nMAILBAG<br />\nContinued from page 4<br /><br />\nATTENTION, A. A. BOARD<br />\nTo the Editor-in-Chief of the<br />\nJohns Hopkins NEWS-LETTER.<br />\nDear Sir: It recently- occurred<br />\nto me that no recognition of any<br />\nservice performed was given to assistant managers. Although the responsibility falls on the manager,<br />\nthe assistant managers often bear<br />\na great portion of the work, and I<br />\nwould suggest to the Athletic<br />\nBoard that an award in the form<br />\nof an FT. A. A. be given to certain<br />\nassistant managers in the future.<br />\nThis award would be some encouragement for juniors and seniors to accept these jobs and would<br />\neliminate the chances of first and<br />\nsecond-year men making these positions when they come out in a halfhearted way to get out of Physical<br />\nTraining. I do not mean to say<br />\nthat this was the case in football<br />\nthis past season, but this thing has<br />\nbeen done before.<br />\nI would limit this award merely<br />\nto football, except in special cases<br />\nin other sports, where the men are<br />\nparticularly deserving. A. A. Board,<br />\nRead! Consider! Act!<br />\nYours in good faith,<br />\nHULLABALOO.<br />\nLITERARY PUBLICATION<br />\nSTAFF MEETS<br />\nAt 12:30 on Wednesday, another<br />\nmeeting of those interested in starting a literary publication at the<br />\nJohns Hopkins University was held.<br />\nAs only a few had previous knowledge of the meeting, the attendance<br />\nwas small. To those present, it was<br />\nevident that there are several obstacles to be surmounted. Proper<br />\nauthority for publishing such a periodical must be obtained, and a feasible plan for financing the venture<br />\nmust be made. Although the financial side of the matter has received<br />\nsome consideration, nothing definite<br />\nhas been done in any direction.<br /><br />\n3<br /><br />\nWOMEN THOUGHT ILLNESS<br />\n\"The King of Lubricants\"<br />\nROMANTIC 100 YEARS AGO<br />\n\"Rome in the Days of Byron and<br />\nCLEANING, PRESSING •<br />\nShelley\" was the subject of a lecREPAIRING<br />\nture delivered last Wednesday by<br />\n2601 OAK ST.<br />\nDr. Norman W. DeWitt, professor<br />\nof Latin Literature in Victoria College, University of Toronto, and<br />\nwidely known Canadian archaeolFOR COLD WEATHER<br />\nTHE PLACE TO BUY<br />\nMOTOR LUBRICATION<br />\nogist. The lecture was given unCIGARS<br />\nSODA<br />\nCANDY<br />\nSHERWOOD BROTHERS, INC.<br />\nder the auspices of the Baltimore<br />\nS. E. Cor. OAK &amp; 27th ST.<br />\nChapter of the Archaeological Inmi::::1:311amanammumanzazzumunauzi<br />\nstitute of America, of which Dr.<br />\n\\V. E. Miller, professor of Greek<br />\nat Hopkins, was recently re-elected<br />\ncouncilor.<br />\nTAILORS<br />\nA hundred years ago, according<br />\nUniforms and Liveries<br />\nto Dr. DeWitt, it was quite the<br />\n1 28 W. Fayette St., Near Liberty St.<br />\nthing for young women to faint as<br />\nBaltimore, Md.<br />\nmuch as they could in public, and<br />\nwomen of all ages thought it ro- The Flag, Banner &amp; Pennant Shop<br />\nORDERS RECEIVED FOR<br />\n(Successors to Sisco Brothers)<br />\nmantic to be ill. The instances of<br />\nFlags, Banners, Pennants, Arm Bands,<br />\nthe delicate, fainting young hero- Emblems, Silk Banners for Schools,<br />\nSocieties and Fraternities<br />\nines in old novels had ample basis<br />\nTransfer and Baggage Express<br />\nPARK AVE., BALTIMORE, MD.<br />\nof support. Furthermore, Dr. De- 302<br />\nAUTOMOBILE SERVICE<br />\nVernon 2355<br />\nR. H. Taylor<br />\nWitt said that even so famous a<br />\nPHONE, HOMEWOOD 2645-W<br />\npoet as Lord Byron succumbed to<br />\nthe popular fancy that it was ro1 W. University Parkway<br />\nmantic to be ill, and even more roOpposite J. H U. Athletic Field<br />\nmantic to die in one's youth.<br />\nThe modern trend toward polit- DRUG STORE for J. H. U. BOYS<br />\nPHONE, HOMEWOOD 2121<br />\nical and individual freedom, Dr.<br />\nDeWitt went on to say, may be<br />\ntraced directly back to a •strong<br />\nHot Dinners,Sandwiches,<br />\natiti-religious feeling which sprang<br />\nCandies, Sodas, Cigarettes,<br />\nPrinters of Philological and<br />\nup through the civilized world a<br />\nScientific Works<br />\ncentury ago. This anti-religious<br />\nTobacco, etc.<br />\n23 B. HANOVER ST.<br />\nspirit, he said, had its advantages,<br />\nAT THE BARN<br />\nBaltimore, Md.<br />\nfor the people in turning aside from<br />\nreligion hit upon a new interest in<br />\nart and centered its new interest<br />\nlargely upon the relics of ancient<br />\nRome. Rome had more theaters<br />\nand individuality is offered here at prices that are not<br />\nand coffee houses 100 years ago,<br />\nand cannot be underquoted by any house atany time.<br />\nsaid Dr. DeWitt, than it has today.<br />\n11 Besides the reputation of an old-established firm<br /><br />\nSCOTT---The Tailor<br /><br />\nNICK DIETOR<br /><br />\nA. JACOBS &amp; SONS<br /><br />\nCOGGINS'<br /><br />\nR.G.by&amp; Company<br /><br />\nThe BARN<br />\nCAFETERIA<br /><br />\nJ. H. Furst &amp; Co.<br /><br />\nFURNITURE OF QUALITY<br />\nis back of each sale with a guarantee.<br /><br />\nY. M. C. A. TO GIVE DINNER<br />\nFOR FOREIGN STUDENTS<br /><br />\nOn January 5, 1923, at 6:30<br />\nP. M., the Y. M. C. A. will give a<br />\ndinner at the Friends Meeting.<br />\nHouse, Homewood, to which all the<br />\nforeign students are invited.<br />\nThe purpose of the dinner is to<br />\npromote a feeling of comradeship<br />\nIN THE GLOAMING<br />\namong the foreign students, as well<br />\nIn the gloaming, oh, my darling,<br />\nas to give an impetus to the CosWhen the lights are dim and<br />\nmopolitan Club, which is composed<br />\nlow,<br />\nentirely of foreigners.<br />\nThat your face is powder painted<br />\nDr. Frank J. Goodnow, Dr. John<br />\nHow am I sweetheart to know?<br />\nC. French and Mr. Morriss, of the<br />\nTwice this month I've had to<br />\nCentral Y. M. C. A., will be the<br />\nbundle<br />\nguests of the evening.<br />\nEvery coat that I possess<br />\nAt present there are twenty-seven<br />\nTo the cleaners—won't you, darforeign students on the roll at the<br />\nling,<br />\n\"Y\" office, distributed as follows:<br />\n•<br />\nLove me more and powder less?<br />\nPorto Rico 5, Mexico 1, France 1,<br />\nChina 5, Palestine 1, Russia 5,<br />\nIn the gloaming, oh, my darling,<br />\nEcuador 1, Canada 2 and Japan 4.<br />\nWhen the lights are dim and<br />\nlow,<br />\nPROF. CHINARD READS<br />\nThat your lip is sharp with whisPAPER AT SOCIETY<br />\nkers<br />\nYou can get your hat I know! Professor Chinard, professor of<br />\nIf I powder, I must do it<br />\nFrench Literature, read a paOr else suffer great distress;<br />\nper on Sainte-Beewe's Theories of<br />\nBut a razor won't you, darling?<br />\nFrench Verse and Their Influence<br />\nLather more—I'll powder less!<br />\nnext meeting<br />\n—Phoenix. on Victor Hugo at the<br />\nPhilogical<br />\nHopkins<br />\nof the Johns<br />\nAssociation on Thursday, December<br />\n21, at 11:30 A. M.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br /><br />\nDRAPERIES<br /><br />\n343 NORTH CHARLES STREET<br /><br />\nMount Vernon Place<br />\nMethodist Episcopal Church<br />\nAt the Washington Monument<br />\nOscar Thomas Olson, D.D.<br />\nMinister<br />\nHopkins Students Are Invited to<br />\nMake This Their Church Home<br />\nThe Sunday afternoon -At Home\"<br />\nin the -Blue and Grey Room- from<br />\nfive to seven, followed by the young<br />\npeople's service will appeal to you<br />\nYou are invited.<br />\nSunday morning worship at 11 &amp;clock-Sunday evening service at 8 o'clock—<br />\nMusic by vested chorus-choir of soloists<br />\nALL SEATS FREE<br /><br />\nge-IALD.ING<br />\n- Indoor and Outdoor<br />\nAthletic Equipment<br /><br />\nAeroplane medicine—one drop<br />\nWill kill you.<br /><br />\nNOTICE<br />\nChristmas holidays this<br />\nyear will extend from Saturday morning, December 23,<br />\nuntil Tuesday morning, January 2, 1923. Out-of-town<br />\nstudents who are going home<br />\nfor the holidays may have an<br />\nextra day holiday by applying to the acting dean.<br /><br />\nMAILBAG<br /><br />\ncflarag<br />\n011irishrtas<br />\nanb<br /><br />\nPaPPg<br />\n\\T.etti Near<br /><br />\nContinued from page 4<br /><br />\nthis is an appeal to justice. Coo, coo, co-eds? Who's<br />\nloony now?<br />\nriot act<br /><br />\n0<br />\nBecause I do not wish it to appear that I cower beneath the cloak<br />\nof anonymity, and as I have had<br />\nmy fun in watching the wiseacres<br />\nguess my identity, I make my public bow.<br />\nB. DOROTHY LEVIN,<br />\nStep-daughter.<br /><br />\nEverything for<br />\nevery sport,in.<br />\nsweaters,<br />\njerseys, shoes,etc.<br /><br />\ntterie)<br />\nCi4eXa<br />\n%)ItMtS H.&amp;OSCARGLk<br />\noWN ER9<br /><br />\nCatalogue sent on request<br /><br />\nlort4 14fr:°<br />\n.4t1DE*.<br /><br />\n29 Baltimore St., East<br /><br />\n‘;21<br />\n,<br />\nle5a€09<br />\n110 E. Baltimore Street<br /><br />\n.1<br /><br />\nOne Door West of Lieit St.<br />\nSOLE AGENTS FOR BALTIMORE<br />\nFor College Fraternity Bands<br />\n(Greek Letter Societies)<br /><br />\nOWENS &amp; HECKLINGER<br />\nTAILORS<br />\nMAKERS OF COLLEGE CLOTHES<br />\nBALTIMORE, MD.<br />\n18 ST. PAUL ST.<br /><br />\n4<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, DECEMBER 22, 1922.<br /><br />\nHOMEWOOD PLAA SHOP- To Arms, Ye Braves! Step-Sister<br />\nPERS GIVE PERFORMPromises \"A Hot Time on<br />\nANCES<br />\nThe Campus\"<br />\nZip<br />\n,tzuittarb<br />\nCo.<br />\nSpecial performances for chil- To the Editor of the Mailbag.<br />\nHoliday Books<br />\nDear Sir: When is a co-ed not<br />\nBeautiful Illustrated Gift Editions, dren were given last Saturday<br />\nafternoon December 16, by mem- a co-ed? When she's a Hopkins coBiography, Travel, Fiction.<br />\nChildren's Books<br />\nbers of the Homewood Playshop, ed. But the true question seems<br />\nFountain Pens and Silver Pencils,<br />\norganization composed of fac- to be—are we co-eds or are we not<br />\nan<br />\nMedical Books of All Publishers<br />\nulty members and others connect- The answer to that is also the anat<br />\nin any way with Hopkins, who swer to the problem—shall we be<br />\ned<br />\nCharles<br />\n.301 N.<br />\nSt.<br />\npresented a program of plays at welcomed<br />\nor shall we not?<br />\nthe Young Women's Christian<br />\none<br />\nNo<br />\ndoubts that heterogen<br />\nORTMAN<br />\nAssociation for the benefit of the<br />\n\"Queen Quality\" Home-made women's fair of the Maryland eous collection of T. B. M., schoolChocolates<br />\nmarms and flappers known ato<br />\nLuncheonette League of Women Voters.<br />\nIces<br />\nIce Cream<br />\n227 N. Howard 518 N. Charles \"The Birthday of the Infanta,\" \"Teachers' College\" is co-educa<br />\nDancing Every Afternoon at<br />\na poetic drama by Maurice A. tional. Then, too, with very specia<br />\nCharles St.<br />\nHanline, was interpreted by Mari- permission<br />\nwomen are admitted tc<br />\nano Badillo, Stanley Worden,<br />\nurldergraduate courses. As you<br />\nDonald Kirkley, Miss Helen<br />\nTHE NEWS LETTER'S<br />\nadmit,<br />\nthe graduate school is unWittman, Miss Anna Moss. Miss<br />\n211-213 E. BALTIMORE ST.<br />\nMAILBAG<br />\nMary Moss and Miss Suzanne doubtedly co-educational.<br />\nAlA Column in Which the Correspondents Foster. \"The Constant Lover,\"<br />\na though we are similarly trained we<br />\nAre Allowed Latitude, But Shoulromantic<br />\ncomedy<br />\nby<br />\nSt.<br />\nJohn<br />\nreceive different degrees. That is<br />\nder the Responsibility.<br />\nHankin, was also presented with our only<br />\nAll letters intended for publication<br />\npoint of divergence. Techmust be concise, written in ink on Joseph A. Moran and Miss Lillian<br />\nregular letter size paper, on one side<br />\nnically, we are not co-eds; really<br />\nonly.<br />\nGore in the leading roles. An exNo attention will be paid to anonywe are. Or it may be the other<br />\nmous letters, but names signed as an tra added feature was a Chinese<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be musical novelty • which was pre- way around. At any rate, we adomitted.<br />\nsented by Shih Hsi Lin, a student vance; ostrich-like, Hopkins hides<br />\nThe publication of a letter is not to<br />\nits head in the sand.<br />\nbe taken as an indorsement of its views in the Medical School.<br />\nby the \"News-Letter,\" which invites the<br />\nFORTY-SEVENTH YEAR OF INSTRUCTION 1922-1923<br />\nWe are sorry that you have been<br />\nfreest discussion of matters of general<br />\nThe managing committee of the<br />\ninterest.<br />\nPlayshoppers includes Emory C. ignorant of the presence of your<br />\nA LETTER FROM MUSICAL Shipley, Jr., William E. Trout, Jr., -lady schoolmates.\" Shall we lay<br />\nMiss Blanche Green and Miss the blame on the fact that you gaze<br />\nCLUBS MANAGEMENT<br />\nINSTRUCTION<br />\never to the heights and cannot see GRADUATE SCHOOL<br />\nHelen Metcalf.<br />\nOF ARTS AND SCIENCES. Degrees: Master of<br />\nTo the Editor of the<br />\nus who meekly kneel at the feet of<br />\nArts; Doctor of Philosophy.<br />\nNEWS-LETTER:<br />\noften accused of not supporting Learning? Or shall we lay the MEDICAL SCHOOL. Degree: Doctor of Medicine; courses for physicians.<br />\nIt IS a source of regret to the oftheir university in the proper spirit. blame on inflated egos, and lord-of- COLLEGE OF ARTS AND SCIENCES. Degree: Bachelor of Arts.<br />\nficers and sponsors of the Glee Club Certainly those who know us are creation complexes?<br />\nENGINEERING. Degrees: Doctor of Engineering; MasOF<br />\nWe are grieved to note that \"if SCHOOL<br />\nthat it has not come up to expecta- doing all they can to help us along.<br />\nter of Engineering; Bachelor of Engineering; Bachelor of Science in<br />\ntions this year. When they started Those who don't know us cannot be there has been any line drawn beChemistry.<br />\ntween the sins and daughters of<br />\nout, it was with the desire to have blamed for their attitude, for their<br />\nscHopL OF HYGIENE AND PUBLIC HEALTH. Degrees: Doctor of PubHopkins, the latter are responsible,<br />\nlic Health; Doctor of Science and Bachelor of Science in Hygiene; Certifia good-sized club, of about seventy- interest has never been aroused. for<br />\nthe former have been so igThese concerts are one of the finest<br />\ncate in Public Health.<br />\nfive voices, which could make mapossible mediums for associations norant of the existerice of their SCHOOL OF BUSINESS ECONOMICS. Bachelor's Degree.<br />\nterial progress in vocal music. The between the<br />\ncitizens and the stu- lady schoolmates that they have not COLLEGE COURSES FOR TEACHERS. Degree: Bachelor of Science.<br />\nend in view was not merely a glee dents; and, when they are given out seen the necessity of a barrier.\"<br />\nclub, but rather a choral society, of town they are eminently instru- But the barrier is there. Whether SUMMER COURSES. Accepted for degrees of Master of Arts, Bachelor of<br />\nArts or of Science.<br />\nwhose benefit to the university mental in attracting men to the uni- it was built before or after we came<br />\nis a mootable question, although as COURSES IN SOCIAL ECONOMICS.<br />\nwould be incidental to its benefit to versity.<br />\nits members. Acting in good faith<br />\nYet, after all, the benefit to the unsolvable as—\"which came first, EVENING COURSES in Business Economics and for Technical Workers.<br />\nand with the best of intentions, they student is the primary concern of the chicken or the egg ?\"<br />\nYou ask for specific charges. You<br />\nsecured Mr. Bochau, who has a rep- the Musical Club. The securing of<br />\nutation for excellent work along Mr. Bochau was the first outward ask me to indict Hopkins—a stepthese lines, to direct the rehearsals, sign of a movement which has been daughterly thing to do. Distaste- JOHN HOPKINS PRESS PUBLICATIONS.<br />\nso that no time would be lost in hap- agitated for some time, namely, to ful, but necessary. Your sins, Hophazard training. At first, the un- get a course in music into the Johns kins, are those of omission rather<br />\nBUILDINGS<br />\ndergraduates readily responded to Hopkins, so that instruction, not than those of commission. What<br />\nHALL—general library, class rooms, biology, administration.<br />\nthis effort, and from sixty to seven- only in voice culture, but also in the you don't do is more vital to us GILMAN<br />\nty men reported at the first few re- playing of all instruments, can be than what you do do. You admit MECHANICAL AND ELECTRICAL ENGINEERING—housing also Physics<br />\nand College Chemistry.<br />\nhearsals. That was the beginning. carried on under capable supervis- us to your university. Very comSince then, the attendance at these ion, and academic credit be given mendable; your duty seems done. CIVIL ENGINEERING—housing also Geology.<br />\nweekly rehearsals has steadily for satisfactory completion of the But we dangle—dangle. We have POWER HOUSE.<br />\ndropped off. When seventy men set courses. Mr. Turnbull and Mr. no spirit, no incentive to better our BOTANY AND PLANT PHYSIOLOGY—with Greenhouses and Botanical<br />\nGarden.<br />\nwere present at the first meetings Bochau are behind the idea, but the standard, no pride in our school.<br />\nand enrolled as members of the Hopkins authorities, though they There is only a lethargic indiffer- CHEMICAL LABORATORY—for graduate work.<br />\nclub, they practically pledged them- have endorsed it heartily, have been ence. Our slogan becomes;<br />\nPHYSIOLOGICAL BUILDING.<br />\nselves to attend rehearsals regularly unable to secure its adoption. Funds We're here because we're here beANATOMICAL LABORATORY.<br />\nand to remain in active service in have not been forthcoming, so that<br />\ncause we're here because we're<br />\nHUNTERIAN LABORATORIES.<br />\nthe society. Depending on them to all hope for securing the course this<br />\nhere,<br />\nPATHOLOGIC<br />\nAL LABORATORY.<br />\nthe man, Mr. Bochau went ahead year has been abandoned. How- We're here because we're here bewith his instruction and the Music- ever, it is only a question of time<br />\ncause we're here because we're SCHOOL OF HYGIENE.<br />\nal Club with its plans. Consequent- when this step will be taken. The<br />\nhere,<br />\nCARROLL MANSION—Johns Hopkins Club.<br />\nly, the dropping out of a little less Glee Club is in a position to give<br />\nSuppose Hopkins treated her STUDENT ACTIVITIES BUILDING.<br />\nthan half of this number has alter- excellent preliminary instruction in sons the same way? (Perish the<br />\nALUMNI MEMORIAL DORMITORY.<br />\ned materially everything which the 'vocal music, while the other musical thought.) 'Where would Hopkins<br />\nMusical Club has done in the Glee clubs are ready to do the same be? A school is only as strong as<br />\n'EM CLEAN AND PUT A<br />\nClub's interest.<br />\nalong other lines of musical devel- its 'spirit and no stronger than its ALUMNI AND SCHOLARSHIP •'WE CLEAN<br />\nCREASE THAT STAYS PUT<br />\nAsk Tom Landy<br />\nThe present situation, certainly, opment. Thus a nucleus will be fur- weakest element. Hopkins has spirNOTES<br />\nFree Auto Service<br />\n8 Branches<br />\nis not all that can be hoped for. In nished for the course when it is it, courage, and undeniable excelBurton J. Castner, who took the<br />\nBALDWIN<br />\n&amp;<br />\nBRADY<br />\nan effort to build up the club to finally installed, and no time will<br />\nbe lence of scholarship. Yet—we dan- degree of Bachelor of Arts this<br />\nCleaning, Dyeing, Pressing<br />\nthe desired membership, the Mu- lost in getting down to effective gle. We are the feet of clay of an year, has been appointed to the fel4032 ROLAND AVE.<br />\nsical Club, immediately after the work.<br />\notherwise admirable statue of learn- lowship in psychology for 1922-23,<br />\nMain Store—Tuxedo 2148<br />\nChristmas recess, will carry on a<br />\nAll men are urged to watch for ing. Have you ever been feet of the funds for which have been given Leave Garments with Landy or Phone re<br />\ndrive among the members of the the drive and to come out for the clay? Pleasant? Yes?<br />\nrecently by the Nela Laboratory of<br />\ngraduate and medical schools, as clubs and to give them their supPlease do not congratulate your- Cleveland, Ohio. The president of<br />\nHALF HOUR AT LEAST<br />\nFirst College Boy—It's getting<br />\nwell as among those of the under port.<br />\nselves for granting the nineteenth the Nela Laboratory is a former<br />\nlight in the east.<br />\ngraduate body. The object is to<br />\nTHE MAXAGEMENT OF THE amendment. It means as little as Hopkins man.<br />\nSecond Ditto—Great Scott! I<br />\norganize a large club which, under<br />\nMUSICAL CLUBS. the eighteenth. Finally, you ask A \"Jumble Inn Scholarship\" for<br />\nhave been in bed an hour<br />\nshould<br />\nthe guidance of Mr. Bochau, will<br />\nus to \"start something.\" We have.<br />\n1922-23 has been awarded to Miss<br />\nago.—New<br />\nYork Sun.<br />\nbe able to give concerts, in conjuncWith . the kind permission of the<br />\nAnna D. Finesinger, a student in<br />\ntion with the well-known Johns<br />\nrespected boards to which we must<br />\nthe College Courses for Teachers. Lady to Freshman on street car:<br />\nLACROSSE NOTICE<br />\nHopkins Orchestra, in and about<br />\nappeal there'll be a hot time on the<br />\nLacrosse practice will not<br />\n\"And which end of the car do I<br />\nthe city. These public appearances<br />\nold campus soon. To arms, co-eds!<br />\nWomen may be a puzzle, but get off from?\"<br />\nbe suspended during the<br />\n'really help a great deal in making<br />\nBut remember, I do not read the few men<br />\nare willing to give them<br />\nholidays.<br />\nRah: \"Well, madam, both ends<br />\nHopkins known. Baltimoreans are<br />\nContinued on Page 3, col. 3<br />\nq.—Widow.<br />\nstop.\"—Emory Wheel.<br /><br />\nTHE BOOK MART<br /><br />\npooh<br /><br />\nFor<br />\nStyle's Sake,<br />\nLet Your<br />\nNew Clothes Be<br /><br />\nCLOTHES<br /><br />\nThe Johns Hopkins University<br /><br />"}], "field_media_file": [{"target_id": 37691, "display": null, "description": null, "target_type": "file", "target_uuid": "0b613bc5-565f-4818-b270-96fab85ffd57", "url": "http://digital.library.jhu.edu/system/files/2022-03/13036-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13036, "target_type": "node", "target_uuid": "d69f74e5-837f-4dce-831e-281667791a9d", "url": "/node/13036"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "621944e6-0e13-4d62-a725-5d88cfe41d88"}]}