{"mid": [{"value": 35854}], "uuid": [{"value": "227746f9-f70a-4d6a-a1fc-db967c1b3d67"}], "vid": [{"value": 35854}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:14:45+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "12378-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:14:45+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:14:45+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "cenommatoST11 DE • To.OR<br />\nTHE•JOHNS•HOTKIHS-UNIVERSITY<br />\n)BALTIMORE<br />\nOM Nil<br />\n<br />\n\fThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br />\nThirty-Third Year.<br />\n<br />\nThe Johns Hopkins Press.<br />\nI.<br />\n<br />\nBeginning October 1, 1908.<br />\nII.<br />\n<br />\nIRA REMSEN, President.<br />\nDean of the College Faculty'<br />\nEDWARD H. GRIFFIN,<br />\nDean of the Medical Faculty.<br />\nWILLIAM H. HOWELL,<br />\n<br />\nIII.<br />\n<br />\nINSTRUCTION.<br />\nIV.<br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\ncandidates for the degrees of Ph. D.,and A.M.)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br />\n<br />\n(a)<br />\n(b)<br />\n<br />\nFor Undergraduates:<br />\nAs candidates for the degree of B. A.<br />\n(c)<br />\n(d)<br />\nAs special students.<br />\n<br />\nV.<br />\nVI.<br />\n<br />\nVII.<br />\n<br />\nVIII.<br />\n<br />\nLibraries.<br />\n136,000 volumes<br />\n164,000 volumes<br />\n260,000 volumes<br />\n<br />\nUniversity<br />\nPeabody Institute.<br />\nPratt Library.<br />\n<br />\nIX.<br />\n<br />\nLaboratories.<br />\n<br />\nDirectors.<br />\n<br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nBotany<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br />\n<br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nD. S. Johnson<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nJohn B. Watson<br />\n<br />\nSeminaries.<br />\n<br />\nDirectors.<br />\n<br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\n1Mathematics.<br />\nPhysics.<br />\n<br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nC. M. Andrews.<br />\nJ. H. Hollander.<br />\nW. W. Willoughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph .5. Ames.<br />\n<br />\nX.<br />\n<br />\nXI.<br />\n<br />\nXII.<br />\n<br />\nXIII.<br />\n<br />\nUndergraduate Courses (leading to B. A.)<br />\nOROUPS.<br />\nI.<br />\n2.<br />\n<br />\n3.<br />\n4.<br />\n5.<br />\n<br />\nAncient Languages.<br />\nModern Languages.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\nChemistry, Biology and Geology.<br />\n<br />\nSerial Publications.<br />\nMathematics (vol. XXXI).<br />\nJournal<br />\nof<br />\nAmerican<br />\nAmerican Chemical Journal (vol. XLI).<br />\nAnierical Journal of Philology (vol. XXX).<br />\nStudies in Historical and Political Science (vol. XXVII).<br />\nModern Language Notes (vol. XXIV).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XIII)4<br />\nUniversity Circular (vol. XXVIII).<br />\nProgrammes of the courses offered to graduate students<br />\nin Philosophy and the Arts and in Medicine, and also of<br />\nthe undergraduate courses, may be obtained on application<br />\nto the Registrar.<br />\n<br />\nXIV.<br />\n<br />\nXV.<br />\n<br />\nXVI.<br />\n<br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume<br />\nXXXI in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume<br />\nXLI in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo.<br />\nVolume XXX in progress.\" $3 per volume.<br />\n(Foreign postage 50 cents).<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXVII in progress. $3 per<br />\nvolume. (Foreign postage 50 cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXVIII in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XX in progress. $2 per year. (Foreign<br />\npostage 50 cents).<br />\nJohns Hopkins Hospital Reports. 4to. Volume<br />\nXV in progress. $5 per volume. (Foreign postage 50 cents).<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.) PAUL<br />\nHAUPT and FRIEDRICH DELITZSCH, Editors. Volume VI in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROUKS, Editor. Volume VI in progress<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4t0. Volume<br />\nXXIV in progress. $1.50 per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper volume.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolume XIII in progress. $2.50 per volume.<br />\n(Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. First Series and<br />\nSecond Series, 15. Third Series in progress, $2.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br />\n<br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum. to<br />\nplates. $25.<br />\nSelections from the Early Scottish Poets. By William<br />\nHand Browne. 240 pages. $1.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo. $6.<br />\nThe Taill of Rauf Coilyear. Edited by William Hand<br />\nBrowne. 164 pages. $1.<br />\nPoe= de Fernan Goncalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.50.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\n50 pages. 50 cents.<br />\nThe Book of Nahum: A New Metrical Translation. By<br />\nPaul Haupt. 53 pages. 50 cents.<br />\nAncient Sinope. By David M. Robinson. 112 pages. $t.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br />\n<br />\n\fbane tbe Inteto tiaib<br />\na mearg ruab me treab<br />\nli I bile tbe farultg make it tbeir biz<br />\nTo quiz, quiz, quiz!<br />\n<br />\nII li ell<br />\n<br />\nAlars, aub tile Estubent',3 life<br />\n316 nauglit but a war aub a atrife:<br />\nilut ifti reallll nut go hub,<br />\nObe rnab in nut an rnugb<br />\nAub lifers not reallll mai<br />\nMille me bluff, bluff, bluff!<br />\n<br />\n\frm!i-iQrttrr.<br />\n<br />\n1!r<br />\nVol,. XIII.<br />\n<br />\nFEBRUARY<br />\n<br />\nSubscriptions, $1.50 per year.<br />\n<br />\n12, 1909.<br />\n<br />\nPublished Fortnightly by the Undergraduates.<br />\n<br />\nBOARD<br />\n<br />\nOF<br />\n<br />\nNo. 8<br />\nio Cents per copy<br />\n<br />\nEDITORS.<br />\n<br />\nGeorge W. Corner, 3d, 1909, Editor-in-Chief.<br />\nJ. Hamilton Owens, i909,Ass't Editor-in-Chief.<br />\n<br />\nWalter V. Johnson, 1909, Athletic Editor.<br />\n<br />\nAlan C. Woods, 1910, News Editor.<br />\n<br />\nN. Williams Haynes, 1912, Ass't Athletic Editor.<br />\n<br />\nG. Ross Veazey, 1910, and E. D. Martin, 1911, Ass't News Editors.<br />\nHertel P. Makel, 1911, Business Manager.<br />\nAddress all articles, communications, etc. to George W. Corner, 3d, Box 107, Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business<br />\nUniversity, Baltimore, Md.<br />\n<br />\ncommunications should<br />\n<br />\nbe sent to H. P. Makel, Johns Hopkins<br />\n<br />\nEDITORIAL.<br />\nOMETIME ago one of the weekly journals published an article which<br />\nurged, in a half-serious way, the appointment of a professor-ofthings-in-general on every college faculty. The writer perceived the<br />\nfact (which, indeed, does not need to be pointed out to thoughtful college men) that the enormous broadening of the range of learning at<br />\nthe present time, and the rage for specialization, are producing onesided men in our universities. Thus even in Johns Hopkins, when<br />\na class reaches its senior year, it is divided up into the biology men,<br />\nand the chemists, and the Latinists, and the athletic men, and so on.<br />\nIn spite of compulsory studies, the degree of A. B. is getting to mean<br />\nless and less a 'well-rounded education.\" For this reason, our writer suggested the creation<br />\nof a professor who should make it his duty to stimulate the students to look beyond their<br />\nspecial courses. While, as we all know, the range of tastes and studies is too great for any<br />\none man to be such a professor-of-things-in-general to all the student-body, it is possible that<br />\nevery student have a private course of his own. The writer finds his course-of-things-ingeneral in a little class, tucked away in the corner, and frequented by but three or four. The<br />\ninstructor does not consider it necessary to limit himself to the strict letter of his subject, but<br />\noften takes the opportunity to digress and discuss art, politics, and the topics of the day.<br />\nOf course, not every study permits treatment of this kind. The writer has the good<br />\nfortune to be a member of another class, in an entirely different department. Owing to the<br />\nnature of the subject, the instructor must occupy himself with a great mass of detail and<br />\nminor differences. But he does not stop there. Through the bewildering maze of his<br />\nmaterial he presents the great principles of a great science in such a way that his students<br />\ntake delight in going outside the work of the class to discover and learn for themselves.<br />\nUnfortunate the Johns Hopkins man who has not upon his schedule at least one<br />\ncourse-of-things-in-general; and happy he who finds in every study a broadening and stimulating influence.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n3<br />\n<br />\nr<br />\n.<br />\n\"11<br />\n1450<br />\n10<br />\n,<br />\nVaVais<br />\nL.. )IIVVVVVVVVVV<br />\nV<br />\n<br />\nE have read with interest the first two articles in The Independent regarding American Universities. In these two are treated Harvard<br />\nand Yale. If we were choosing our college from the facts thus presented we should choose Yale, notwithstanding the writer of the<br />\nseries considers Harvard the better.<br />\nIt seems strange to us that a college man, as Dr. Slosson is,<br />\nshould not understand what is meant by college democracy. There<br />\nVVV;<br />\n;V„trigVArsis in the mind of every present-day college man a clearly defined idea<br />\n!Or'OV'er<br />\nof<br />\ncollege democracy and this idea is the same all over the American<br />\n:Of V V<br />\ncollege world. Dr. Slosson merely sees the striving after it, and<br />\nimagines that because the strivings take different form that college democracy is different in<br />\neach institution.<br />\nA college is democratic when each student is first of all, a college man, that is a Hopkins man, etc., second, a fraternity or club man, and last of all an individual with personal<br />\ntastes<br />\nA class is democratic when its members in an election vote for the men they think best<br />\nfitted for the offices, and fraternity brothers do not vote for fraternity brothers, and non-frat.<br />\nmen for non-frat. men, regardless of their qualifications for the place.<br />\nA student is democratic when, for instance, in voting for the captain of an athletic<br />\nteam he will vote for the man he personally detests, if he thinks he is the best man for the job.<br />\nThe Yale custom of frowning upon valets and automobiles, is to prevent the University<br />\nfrom being divided up into a rich and poor class.<br />\nIt is not the use of Greek letters that is primarily objected to at Princeton; it is the<br />\nmodern Greek-letter fraternity system which, in some cases, breaks the University up into a<br />\nnumber of small cliques, and is thus a foe to college democracy.<br />\nIn other words college democracy strives to develop first of all a Yale man, a Princeton<br />\nman, etc., and incidentally, if desired, a frat. or society man.<br />\nIt strives to place every student upon an equal footing in college affairs.<br />\nIt strives to produce college unity.<br />\nIt differs from college spirit in being internal, whereas college- spirit is external, altho<br />\nthey are by no means independent.<br />\n<br />\nUST as this issue of the NEWS-LETTER is going to press, the daily<br />\npapers make the important announcement that the trustees of the<br />\nuniversity have decided to institute an Advisory Council of Alumni.<br />\nThis council is to advise the trustees in their actions, to hustle for<br />\nHomewood, and in general to bridge the gulf between the powers<br />\nthat be and the student, past and present.<br />\nFrom an undergraduate point of view, the innovation is good<br />\nall around. We believe that much of the half-heartedness of the<br />\nC<br />\nC. 11<br />\nalumni has been due to the fact that they have hardly even had the<br />\n4L.IZs St<br />\nst<br />\nV,<br />\n412.<br />\nprivilege of making suggestions as to the conduct of the university.<br />\nA body of men who have done so much for science, for letter;, and for the public service, will<br />\nsurely do much for their alma mater if given half a chance.<br />\nDr. E. F. Slosson, author of the much-discussed articles in The indePendenl, remarks upon<br />\nthe difference between the alumni of the Western and Eastern universities. In the West they<br />\nhave been extremely radical, sometimes going to.the Legislature to force the State University<br />\nfaculties to make innovations; in the East they have been morbidly conservative,in many cases.<br />\nWe believe that the Johns Hopkins alumni will go neither to one extreme nor to the other,<br />\nbut will pull together with trustees, faculty, and students for a wisely-planned, steady progress.<br />\nWon't we all make a fine team when we get a-going?<br />\n<br />\n\f4<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nTHE OPAL RING.<br />\n\"Yes,\" said my friend, Jean, the village<br />\npriest. \"In following my duties as priest of<br />\nthese pious, but ignorant, people, I have<br />\nbeen called upon to be present at many deathbeds. At almost all of these I have heard the<br />\nstories of queer lives. Perhaps the most<br />\nstartling story I have ever heard, and, at least,<br />\none that will always remain in my mind as<br />\nthe most awful, was among the first I heard<br />\nin this parish and, indeed, it happened at my<br />\nsecond visit to a dying man.\"<br />\nMy old friend stopped and seemed to be<br />\nlost in a deep reverie. I saw a shudder run<br />\nthrough his body and an indescribable look<br />\ncame into his face as he thought again of the<br />\nscene. Knowing him well, I did not hurry<br />\nhim, but sal still, smoking an old clay pipe<br />\nand drinking ale, until with a sigh the old<br />\npriest began his tale.<br />\n\"To begin with, you must know something<br />\nof the old fellow who told me this biography.<br />\nHe lived in the old house that still stands on<br />\nthe road leading from the village into the<br />\nforest, and allowed no one to come near his<br />\nhouse but his servant, who had been his constant friend and companion for sixty years.<br />\nWhen I undertook this charge I was told to<br />\nleave Daniel—this was the only name he had<br />\nas far as the villagers were concerned—alone,<br />\nand I am ashamed to say that I did as I was<br />\nbidden, for he developed a most interesting<br />\ncharacter.<br />\n\"About a year after my arrival, the people<br />\nbegan to notice that the servant had been<br />\nneither in the market nor stores for some<br />\ntime. One old man in the parish became<br />\nvery curious and, venturing one night to the<br />\nhouse, looked in the only window and saw<br />\nthe old man Daniel sitting on a low chair beside a rough bed on which his faithful serGreatly<br />\nvant lay tossing and groaning.<br />\nalarmed he came to me at once and told me<br />\nwhat he had seen. I immediately seized my<br />\nmedicine case and rushed to the lonely house.<br />\nI knocked repeatedly and, as no one opened<br />\nthe door. I pushed my way into the only<br />\nroom. There the old man still sat, looking at<br />\nhis sick servant. I saw at once that he was<br />\ndying in a burning fever and I did all I could<br />\nto make his last moments comfortable. During<br />\nmy efforts Daniel sat dazed watching my<br />\n<br />\nefforts in an indifferent manner. When his<br />\nservant died he got up, walked around the<br />\nroom and, running to me, said sharply, \"you<br />\nhave done enough, now go! Come again one<br />\nweek from tonight!\"<br />\n\"The next Friday night I presented myself<br />\nat his door, and he opened it and admitted me<br />\ninto the bare room. In one corner stood the<br />\nrude bed, in another a small, fireless stove, in<br />\nanother a few clothes hung upon the wall, and<br />\nin another, leaning against the wall, stood a<br />\npick and shovel with fresh dirt upon them.<br />\nI guessed that he had just buried his old<br />\ncompanion. In the centre of the room stood<br />\nan old table, covered with books. On it there<br />\nwas a bottle of wine, a battered plate filled<br />\nwith cakes, glasses, and a large red lamp<br />\nwhich cast a glow over everything. There<br />\nwere two large arm chairs, on either side<br />\nof the table, which looked out of keeping<br />\nwith the other furniture of the room.<br />\n\"Daniel motioned me into one of these<br />\nchairs and there we sat for some time, silently<br />\nlooking at each other. At last the old man<br />\ngot up, filled my glass with the rare old wine<br />\nand, after pouring out a second glassful, sat<br />\ndown. So we sat for the remainder of the<br />\nevening. While there, my glances took in<br />\nall the books on the table and I saw, with a<br />\ngreat shock, that there lay a well worn Bible,<br />\nsurrounded by every kind of fiction, I was<br />\ngreatly surprised, for my host was a small<br />\nharsh, stern old man with a diabolical look in<br />\nhis eyes, and I had not expected to find a<br />\nBible in his house. When at last I arose to<br />\ngo, the old gentleman said in his sharp tone,<br />\n'Come again next week,' and let ine out the<br />\ndoor.<br />\n\"This happened for several weeks, until at<br />\nlast a kind of friendship sprang up between<br />\nus. Then we often sat until the wee small<br />\nhours discussing matters pertaining to religion and politics. I soon found out that my<br />\nfriend knew more than I. Although I often<br />\ntried to get him to tell me of his former life,<br />\nhe would always shut up like a clam when I<br />\nmentioned the past, and so I learned to curb<br />\nmy'curiosity.<br />\n\"Things went on in this fashion for a year,<br />\nuntil one Friday night, as usual, I walked<br />\ndown the road toward my friend's house,<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nthinking of the old man and wondering what<br />\ntale of sorrow he could tell if he would. As<br />\nI neared the house, I saw with alarm that<br />\nth2re was no light shining fi 0:11.the window.<br />\nI knocked, but got no response. When at<br />\nlast I pushed the door open I heard a low<br />\ngroan from the bed.<br />\nRushing across I<br />\ngrasped my friend's hand and felt his rapid<br />\npulse. Instantly I knew that he was dying<br />\nfrom the same fever that had carried off his<br />\nold servant a few months before, and that I<br />\ncould do nothing for him.<br />\nHe asked for water, and when I gave it<br />\nto him drank eagerly, and then said, 'Sit<br />\ndown, I want to tell you something.' I did<br />\nas he asked and then listened, with many<br />\ninterruptions for water, to a story such as I<br />\nhave never heard -since.<br />\n\"'Father, you have been very kind to me,<br />\nand beforel die I want to tell this and ask<br />\nyou to bury me according to the Church.'<br />\n\"Here the old man stopped and drew a<br />\nlong breath, and then he continued:<br />\n\"'There was once a rich man in America<br />\nwho had an only son. This son was the only<br />\njoy the old man had, and in him he centered<br />\nhis hopes and his highest ambitions. He<br />\ngave his boy everything he wanted, and,<br />\nafter his education was complete, he sent him<br />\nabroad for travel and further learning. But<br />\nthe son was very ungrateful, and, after being<br />\nturned out by his father, he went into the<br />\nWest and lived the rough life of a cowboy.<br />\nThere he met a young girl to whom he<br />\ndeclared his love. She told him she loved<br />\nhim, but refused to marry him until he proved<br />\nhimself a man. Determined to win her, the<br />\nyoung man left the State and his old companions and began a new life. Before going he<br />\nwent to the girl and gave her a heavy ring,<br />\nset with a large opal, and told her he would<br />\ncome back some day for the ring and herself.<br />\nSeveral years went by, and at last the young<br />\nman felt himself the man he should be. As he<br />\nwalked through the woods to their oldtrysting place, he saw a young couple walking<br />\ntowards to him with their arms around each<br />\nother. As he himself was a lover, he stepped<br />\nbehind a tree in order to let the pair pass him<br />\nundisturbed. As they drew nearer, something<br />\nabout the girl seemed familiar, and a sudden<br />\nfear seized him. When at last they drew<br />\n<br />\n5<br />\n<br />\nnear to him, he saw that the girl was his<br />\nsweetheart. Without a word he fired two<br />\nshots at the pair; the young man fell dead,<br />\nand the girl fell mortally wounded. Without<br />\na word the young fellow jumped from behind<br />\nthe tree, fired another shot into the dead man,<br />\nand then turned to the girl. She had fainted,<br />\nand he bent over her and kissed her. This<br />\nkiss seemed to revive her, for she threw her<br />\narms around his neck and whispered: 'Jack,<br />\nI knew you would come back. You see, here<br />\nis your ring. Take it. You have killed my<br />\nbrother. I forgive<br />\n\"Here the dying man stopped short, and,<br />\nafter some moments of quiet breathing, passed<br />\naway. I sat there for some time lost in<br />\ngloomy thought.\"<br />\nHere my friend stopped, and, with a deep<br />\nsigh, handed me a simple, heavy gold ring,<br />\nset with a large, clear opal.<br />\nX. Y. Z.<br />\n<br />\nRECENT LECTURES.<br />\nAn unusually full and varied course of lectures<br />\nhas been provided this year by the university.<br />\nOne or another of the various lecture rooms<br />\nhas been in use almost every day.<br />\nProfessor A. V. Williams Jackson, of<br />\nColumbia, has been lecturing on \"The Religion of Persia:\"<br />\nFabian Franklin, Ph.D., formerly professor<br />\nof mathematics, is giving a series of ten<br />\nlectures upon \"The Principles of Political<br />\nEconomy.\"<br />\nProfessor Felix Schelling, of the University<br />\nof Pennsylvania, has completed a series upon<br />\n\"The Elizabethan Drama,\" given before the<br />\nEnglish seminary.<br />\nDr. Stevenson, of Rutgers, is lecturing<br />\nupon \"The Age of Discovery\" before the<br />\nhistorical seminary.<br />\nDr. David M. Robinson, associate professor<br />\nof classical archaeology, spoke upon \"Stages<br />\nin the Life of Ancient Greece\" on the evening<br />\nof February 5th.<br />\nDr. 0. L. Fassig, of the Maryland State<br />\nWeather Bureau, gave a series of lectures on<br />\n\"Meteorology\" before the department of<br />\ngeology.<br />\nThe February meeting of the Scientific<br />\nAssociation, and the address of Mr. Ben<br />\nGreet, are reported elsewhere in this issue.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n6<br />\n<br />\nIGtilk311<br />\nTHE HISTORY OF LACROSSE AT<br />\nJOHNS HOPKINS.<br />\nBy WILLIAM C. SCHMFOSSER.<br />\nNovember 10, 1908.<br />\n<br />\n)11linued from lasl issue).<br />\n1893.<br />\n<br />\nThe lacrosse season of 1893 was a success<br />\nin two ways: first, from the financial point of<br />\nview, and secondly, from that of the caliber<br />\nof the team turned out. Six games were<br />\nplayed and Hopkins won four of these and<br />\nsecond place in the Lacrosse League.<br />\nThe Hullabaloo of 1894 treats the 1893<br />\nseason as follows: '`In our first game we<br />\nextended to our visitors, the College of the<br />\nCity of New York, a warm reception, for<br />\nwhich Baltimore Lacrosse teams are justly<br />\nfamous, by defeating them by a score of 9-1.<br />\nIn the second game we received an unpleasant surprise. Awed by the former renown<br />\nof the famous Druids, our team seemed to go<br />\ninto a state of lethargy from which it did not<br />\nemerge until the game had ended. The<br />\ndefeat on the whole, however, was beneficial,<br />\nas it pointed out the weak points, and aroused<br />\nin the members of the team the determination<br />\nto remedy its defects. After defeating the<br />\nAthletic Club of the Schuylkill Navy, the<br />\nfirst championship game of the season was<br />\nplayed with Stevens. It was an extremely interesting and well-played game in which<br />\nHopkins showed themselves the better ill all<br />\nround work and won by a score 6-3. Lehigh<br />\n<br />\nwas our next opponent. Their team work<br />\nwas brilliant and showed from the outset that<br />\nthey were to win. At the end of the firsthalf the score was a tie, but in the secondhalf their magnificent training made itself<br />\nfelt and we were easily defeated by a score of<br />\n6-3.\"<br />\n<br />\n'`Our team closed its season very pleasantly<br />\nby defeating the Athletic Club of Schuylkill<br />\nat Philadelphia.The work of the team throughout the season was good and showed a marked<br />\nimprovement over the work of the previous<br />\nyear. The training was more vigorously<br />\nadhered to and the team work much improved.<br />\nToo much stress, however, was placed upon<br />\n'body work' which in many instances interfered materially with the proper use of the<br />\nstick.\"<br />\nIt is interesting to note that already at that<br />\ntime the coaches had trouble in developing all.<br />\nevenly balanced team with reference to body<br />\nwork\" and ''stick work.\"<br />\nA study of the accounts of the games as<br />\ngiven in the newspapers of that day show<br />\nthat Janney, Roszel, Symington, Straus and<br />\nthe other attack men carry off most of the<br />\nglory. Occasionally we read of the long<br />\nthrows of T. D. Penniman and a stop by the<br />\ngoal-keeper, but seldom of the other defense<br />\nplayers; therefore, we hesitate in giving<br />\nthese men all the credit for the good work;<br />\nno doubt every man did his share.<br />\nThe team was composed of these:<br />\nJ. B. Crenshaw, goal; T. D. Penniman,<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\npoint; P. M. Dawson, cover point; F. C.<br />\nNewton, first defense; W. S. Baer, second<br />\ndefense; F. K. Cameron, third defense; T. F.<br />\nP. Cameron, centre; S. S. Janney, first<br />\nattack; B. M. Roszel, second attack; W. S.<br />\nSymington, third attack; T. E. Straus, out<br />\nhome; B. Phinizy, in home.<br />\nSubstitutes —W. H. Crampton; B. 13. Cone;<br />\nT. D. Penniman, captain; C. W. Baldwin,<br />\nmanager.<br />\nLacrosse Committee—B. M. Roszel, W. S.<br />\nSymington, W. S. Baer.<br />\n1894.<br />\nAs to the team of 1894 we get very enthusiastic accounts showing that lacrosse was by<br />\nno means at that time on the wane in Baltimore, and in fact the attendance at the several<br />\ngames played here rather showed a healthy<br />\ngrowing interest on the part of the general<br />\npublic.<br />\nOne writer tells us that ``the work of the<br />\nHopkins team during the past season, notwithstanding the fact that it won only the<br />\nsecond place, was most satisfactory. Active<br />\npractice began early in the spring, and continued without interruption until the final<br />\nchampionship game. Enough cannot be said<br />\nin praise of the conscientious way in which<br />\nnearly the entire team entered into training.\"<br />\nAfter reading this I was surprised to find that<br />\nthe record of games played that year showed<br />\nthat as a matter of fact Hopkins had won only<br />\none, beating Lehigh 6 to 4. Stevens, the<br />\nDruids and Cornell gloried over '`the Black<br />\nand the Blue\" with the following scores respectively 7 to 5, 3 to 1, and 6 to 0.<br />\nThe game with Cornell at Ithaca was quite<br />\nan undertaking. In fact it was then the longest trip a Hopkins team of any kind had ever<br />\nmade, and the writer believes this record still<br />\nholds good today. The great obstacle to overcome was the question of financing, as the<br />\nAthletic Association did not have much of a<br />\nworking fund and the guarantees were small.<br />\nIn addition to the games mentioned above,<br />\nthe University played two early practice<br />\ngames: one with the East Branch Y. M. C.<br />\nA. and the other with the Catonsville Lacrosse<br />\nClub. The former was not much of a game<br />\nto test the Hopkins team because some of 'the<br />\nBlack and the Blue men played on the Y.<br />\n<br />\n7<br />\n<br />\nM. C. A. team. This game will always be<br />\nremembered, however, by an amusing incident<br />\nwhich took place. It was in the latter part<br />\nof the first-half when after a missed shot at<br />\ngoal the ball went behind the same. With<br />\ntrue Hopkins spirit, Lupton, who was that day<br />\nplaying for Y. M. C. A. and Lilly, centre, for<br />\nour team, started after the ball. Lilly badly<br />\nchecked Lupton who to prepare himself for a<br />\ngood return check, threw off his cap. It is<br />\nremarkable to relate, but the cap fell directly<br />\non the ball and neither Lupton nor Lilly<br />\ncould locate the ball. After some consternation the tricky sphere was located and the<br />\ngame went on.<br />\nIn the Catonsville game nothing of peculiar<br />\ninterest occurred, except that Janney temporarily had his knee sprained. It may be<br />\nof interest to posterity to know that this<br />\nJanney knee\" was a remarkable and valuable asset to any lacrosse team, as it always<br />\nmanaged to get sprained when the Hopkins<br />\nplayers were winded, but could be reduced to<br />\nworking condition again in a few minutes.<br />\nThe men who composed our team that year<br />\nwere:<br />\nJ. F. Mitchell, goal; T. D. Penniman,<br />\npoint; P. M. Dawson, cover point; F. K.<br />\nCameron, first defense; J. B. Crenshaw,<br />\nsecond defense; T. E. Straus, third defense;<br />\nS. S. Janney, centre; B. M. Roszel, first<br />\nattack; T. F. P. Cameron; second attack; W.<br />\nS. Symington, third attack; M. Hill, out<br />\nhome; G. H. Hodges, in home.<br />\nSubstitutes—A. R. Stevens; B. Bande; T.<br />\nE. P. Cameron, captain; J. E. Shaw; A. C.<br />\nBryan; J. Hall Pleasants, Jr., manager.<br />\nJ. Hall Pleasants, Jr. was Secretary and<br />\nTreasurer of the Intercollegiate Lacrosse<br />\nAssociation.<br />\n1895.<br />\nWe who follow the modern lacrosse teams<br />\nat Hopkins are rather amused to read how<br />\nthe Hullabaloo of 1896 gives the boys of that<br />\nyear a pat on the back for doing such conscientious practice and training.<br />\nThey<br />\nstarted in about the first of April and continued until after the last game in May. We<br />\nalso read that the lacrosse men — with few<br />\nexceptions went into training on pledges so<br />\nthat when the championship season came, the<br />\nmen were in first rate physical condition and<br />\n<br />\n\f8<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nthis enabled them to make a creditable showing.\" We can understand that having no<br />\ncage at their disposal, it was practically impossible for them to get any practice up to<br />\nApril first, if the spring of 1895 was a late<br />\none; but why there should be exceptions to<br />\nthe training list, history does not show.<br />\nIt was unfortunate that the management<br />\nwas able to schedule only one practice game,<br />\nand that with the Maryland Athletic Club<br />\nwhich was just sallying forth with a lacrosse<br />\nteam. This game was won by Hopkins<br />\nunder the leadership of T. F. Cameron by a<br />\nscore of 10-0.<br />\nOur first championship game that year was<br />\nwith Stevens at Union Park. Among other<br />\nthings the papers vouch the information that<br />\n-the day was a fairly good one for lacrosse,<br />\nalthough there was a sprinkling of rain, and<br />\na little too much wind at times. The attendance was quite good, a large number of Hopkins students with black and blue flags and<br />\nbanners encouraging their team with college<br />\nyells, repeated at every possible opportunity<br />\noffered;\" that -the visitors excelled in team<br />\nwork, but the Baltimoreans were stronger<br />\nindividually;\" that .`Janney's superb playing<br />\nwas the feature;\" that ``Captain Cameron's<br />\nleg was injured early in the game, and his<br />\nusually fine work was thereby much impeded;\"<br />\nthat ``the Hopkins team was greatly strengthened by Mitchell and Sidney Cone, the former<br />\nby his splendid work between the goal posts,<br />\nsaving what looked like many a sure goal;\"<br />\nthat \"Cone was everywhere in the Hopkins<br />\ndefense field, and again and again he returned<br />\nthe rubber to the Hopkins attack field by his<br />\nlong throws\" and lastly that ''the Stevens<br />\nmanager will protest the game, claiming that<br />\ntwo of the Johns Hopkins players are not<br />\nbona-fide students.\" No doubt the manager<br />\ndiscovered that he was in error. The game<br />\nended in favor of Hopkins by a score of 6-3.<br />\nNext came our fatal trip to South Bethlehem. Several of the men had not recovered<br />\nfrom the Stevens game, and history tells us<br />\nthat the mainstay of our attack was so seriously hurt that he was using a cane until just<br />\nbefore the game. Judging from the newspaper quotations given above this player must<br />\nhave been our gallant captain Cameron. The<br />\naccount of this game as given in a special to<br />\nthe Baltimore American seems to be an accurate one. It reads as follows:<br />\n`‘South Bethlehem, Pa., May 18.—Lehigh<br />\nvirtually won the Intercollegiage Championship in Lacrosse by defeating the Johns Hopkins team 5 to 0. The first-half was exciting,<br />\nthe Johns Hopkins defense showing up particularly fine,especially on the part of Mitchell,<br />\n<br />\nCone and Dawson. To these men is due the<br />\ncredit of saving at least seven goals in this<br />\nhalf. The ball during the half was in Hopkins territory at least three-fourth of the time.<br />\nThe playing of Janney throughout the game<br />\nwas a feature. The second half opened with<br />\nthe Lehigh's getting the ball, and after a succession of brilliant passes securing the first<br />\ngoal, which was thrown by Bartles. The<br />\ncrowd, which was highly representative of<br />\nLehigh men, went wild and their vigorous<br />\nyelling inspired their men with renewed<br />\nenergy. From the scoring of their first goal<br />\nthe Lehigh team played with a vim and dash<br />\nseldom equalled in the history of the Intercollegiate League.<br />\n‘`The second goal was scored notwithstanding the efforts of the Hopkins defense. By<br />\nthis time the Hopkins men were evidently<br />\nfast becoming demoralized and the Lehigh<br />\nmen scored three remaining goals in quick<br />\nsuccession. Mr. Arnold Reese of Baltimore,<br />\nrefereed the game. It was he who introduced<br />\nlacrosse at Lehigh. His refereeing was firstclass, and was entirely satisfactory to both<br />\nteams. Mr. Albert Lefever, Johns Hopkins,<br />\n'94, umpired for Johns Hopkins. Mr. Springfield Baldwin, Lehigh, '96, umpired for<br />\nLehigh.'<br />\nThe make-up of the team for that year was:<br />\nJ. F. Mitchell, goal; S. M. Cone, point;<br />\nP. M. Dawson, cover point; J. B. Crenshaw,<br />\nfirst defense; A. K. Stevens, second defense;<br />\nF. A. Lupton, third defense; S. S. Janney,<br />\ncentre; H. M. Wilson, J. E. Shaw, third<br />\nattack; T. F. P. Cameron, second attack; H.<br />\nW. Kennard, first attack; M. B. Hill, out<br />\nhome; G. H. Hodges, in home.<br />\nSubstitutes—A. C. Bryan; R. E. Belknap;<br />\nL. M. Warfield; T. F. Cameron, captain;<br />\nJ. Hall Pleasants, Jr., manager; Dudley<br />\nWilliams, assistant manager.<br />\nDudley Williams, Vice-President Intercollegiate Lacrosse Association. M. W. Hill,<br />\nExecutive Committee of Intercollegiate<br />\nLacrosse Association.<br />\n(To he continued).<br />\n<br />\nMAXIMS FOR ATHLETIC SUCCESS.<br />\nMichael C. Murphy, trainer of the American Olympic Team, gives the following advice<br />\nto athletes:<br />\nFind the event for which you are best suited<br />\nand stick to it.<br />\nMake sure that your diet is simple and eat<br />\nslowly.<br />\nDo not touch cigarettes or champagne.<br />\nDon't expect to be a champion the first<br />\nyear.<br />\nIf you are a schoolboy don't train hard before You are eighteen or nineteen years old.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\nDon't get discouraged and quit because<br />\nsome other man seems to be making more<br />\nprogress than you.<br />\nRemember that a clean life, a simple diet<br />\nand determination will accomplish wonders.<br />\n<br />\n9<br />\n<br />\nSUMMARY OF PRINCIPAL EVENTS.<br />\n<br />\n100-Yard Dash (handicap) — Won by<br />\nDewey, C. H. S., (4 yards); second, Martin,<br />\nG. U.,(3 yards); third, Haydock, Philadelphia Y. M. C. A. Time, 10 1-5 seconds.<br />\nBREAKFAST.<br />\n100-Yard Dash (interscholastic handicap)<br />\nounces<br />\nby Patterson, B. C. C., (3% yards);<br />\nWon<br />\neight<br />\nor<br />\ntwo)<br />\n(sometimes<br />\nOne chop<br />\nDewey, C. H. S., (3 yards); third,<br />\nsecond,<br />\nof beef.<br />\nPendleton, E. H. S. Time, 10 1-5 seconds.<br />\nTwo soft boiled eggs.<br />\n100-Yard Hurdles (handicap)—Won by<br />\nOne baked potato.<br />\nMartin, U. of Va., (scratch); second, RanToast and bread.<br />\ndolph, U. of Va., (scratch); third, Smith, G.<br />\nMilk or mild tea.<br />\nPrunes or apple sause (no cream or sugar U., (2 yards). Time, 12 1-5 seconds.<br />\n220-Yard Dash (handicap)—Won. by Sampadded).<br />\nson, W. Y. M. C. A.; second, Senft, C. Y.<br />\nDINNER.<br />\nLight soup.<br />\nM. C. A.; third, Bond, J. H. U. Time,<br />\nRoast beef, lamb, mutton or fowl.<br />\n25 1-5 seconds.<br />\nBoiled or mashed potatoes.<br />\n440-Yard Dash (handicap)—Won by Bond,<br />\nVegetables and fruits in season.<br />\nJ. H. U., (15 yards); second, Adams, M. A.<br />\nBoiled rice and milk or corn meal mush.<br />\nC., (8 yards); third, Holliday, U. of Va.,<br />\nA light pudding.<br />\n(scratch). Time, 55 seconds.<br />\nMilk or tea.<br />\n440-Yard Dash (interscholastic handicap)<br />\nToast and bread.<br />\nWon by Lancaster, C. H. S., (7 yards);<br />\nsecond, Le Cato, B. C. C.,(2 yards penalty);<br />\nSUPPER.<br />\nCold meat (roast beef, lamb, mutton or third, Stalfort, B. C. C., (2 yards penalty).<br />\nTime, 55 1-5 seconds.<br />\nfowl) or one small steak.<br />\nHalf Mile Run (scratch)—Won by Herring.<br />\nOne potato.<br />\nW. C.; second, Wenderoth, G. W. U.;<br />\nMt.<br />\nToast or fresh graham bread.<br />\nthird,<br />\nMakel, J. H. U. Time, 2 minutes,<br />\nPrunes, apple sauce or baked apple.<br />\n6 3-5 seconds.<br />\nMilk and mild tea.<br />\nMile Run (handicap)—Won by Bau11, U.<br />\nof Pa., (20 yards behind scratch); second,<br />\nECHOES OF THE HOPKINS MEET.<br />\nZehr, C. H. S., (30 yards); third, Hildebrand, (scratch).<br />\nTime, 4 minutes, 42<br />\nOn your marks! Get set! Bang!<br />\nseconds.<br />\nUsher—\"Would you men please move back<br />\nRunning High Jump—Won by Ward, C.<br />\nlittle!\"<br />\na<br />\nY.<br />\nM. C. A.,(4 inches); second, Lane, U. of<br />\n``Cop\"— ``Git back there!\"<br />\nPa., (3 inches); third, Martin, U. of Va.,<br />\nVirginia Man—\"Do you know where I (scratch). Height, 5 feet, 8 inches.<br />\nfind any Hopkins money?\"<br />\nShot Put (handicap)—Won by Michael, J.<br />\nHopkins Man—``No.\"<br />\nH. U., (2 feet); second, O'Connor, G. U.,<br />\n(2 feet, 6 inches); third, Cummings, B. A.<br />\nShot Put—\"Good work 'Babe.'\"<br />\nC., (scratch). Distance, 36 feet, 5 inches.<br />\nColumbia Race—\"Those fellows are wonders. They came in second at Madison<br />\nSquare Garden.\"<br />\nIJ Hopkins men have long been pleased with the<br />\n440 yd. Dash—\"Good work, Billy. That's<br />\nexcellence of the furnishings to be found in the<br />\ngreat.\"<br />\nMen's Store at ::<br />\nVirginia Relay—\"Oh H—! That fellow<br />\nfouled Fulton.\"<br />\nOutside the Armory—\"Let's go round to<br />\n210-218 NORTH HOWARD ST.<br />\nGordon's.\"<br />\n<br />\nHUTZLEK 131?OTHEit<br />\n<br />\n\f10<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nPole Vault (handicap)—Won by Sterrett,<br />\nG. W. U.; second, Ward, C. Y. M. C. A.;<br />\nthird, Blakely, U. of Pa. Height, 11 feet.<br />\nMile Relay—City College (Gorman, Connelly. Le Cato, Rogers) defeated Episcopal<br />\nHigh School. Time, 3 minutes, 47 seconds.<br />\nMile Relay—Western Maryland (Bird,<br />\nStultz, Turner, Marcus) defeated Delaware<br />\nCollege. Time, 3 minutes, 43 seconds.<br />\n4 Mile Relay—Columbia (Verplanch, Saunders, Kennedy, Link) defeated Johns Hopkins University (Wolfe, Reeside, Breyer,<br />\nGriffith). Time, 18 minutes, 57 3-5 seconds.<br />\nMile Relay—Johns Hopkins University<br />\n(Bridgman, Hunter, Fulton, Stollenwerck)<br />\nand University of Virginia (Thurlow, Stanton, Wiltshire, Goodwin). Undecided. Will<br />\nprobably be run over at Fifth Regiment<br />\nGames, March 13th.<br />\n<br />\nTRACK SCHEDULE.<br />\nThe track schedule for 1909, which has<br />\nrecently been completed by Manager Warren<br />\nStewart, is undoubtedly the best that the<br />\nuniversity team has ever had. The schedule<br />\nfollows:<br />\nFebruary 13th—George Washington Meet,<br />\nat Washington (2 Mile Relay entries in main<br />\nevents). Columbia University Meet, New<br />\nYork (1 Mile Relay).<br />\nFebruary 20th—Federal Gaines, at Washington.<br />\nFebruary 22nd—Cross Country Championships, at Washington.<br />\nFebruary 27th—Richmond College Meet, at<br />\nRichmond.<br />\nMarch 6th—Georgetown Meet, at Washingington.<br />\nMarch 13th—Fifth Regiment Meet, at Baltimore (Relay with Virginia probable),<br />\nApril 14th—University of Pennsylvania<br />\nRelay Carnival.<br />\nMay 1st—Dual Meet with Navy, at Annapolis.<br />\nMay 8th—Dual Meet with Virginia, at<br />\nHomewood.<br />\nMay 15th-1)ual Meet with Swarthmore, at<br />\nHomewood, pending.<br />\nMay 22nd—Dual Meet with Columbia, at<br />\nHomewood, pending.<br />\n<br />\nTHE DANCE.<br />\nterram quatiunt ede! The second<br />\nof the series of dances given under the auspices of the Cotillion Club was held in McCoy<br />\nHall on February 8th. The hall was beautifully decorated with banners and class flags;<br />\nthe musicians sat behind a bank of green<br />\npalms. But—these are only minor details.<br />\nBaltimore has a world-wide reputation for<br />\nbeautiful girls and any one present at the<br />\ndance will certainly vouch for it. Even Dr.<br />\nMustard.<br />\nThe Dance Committee certainly deserves<br />\ngreat credit for the successful way in which<br />\nthe dances are carried off. The former ones<br />\nwere very successful, but this one eclipsed<br />\nthem all.<br />\n<br />\nTHE SENIOR BANQUET.<br />\nThe senior banquet took place on Friday,<br />\nFebruary the 5th, at the New Howard Hotel.<br />\nTradition, we believe, asserts that senior banquets are solemn and dignified affairs. As it<br />\nis not polite to contradict tradition, we will<br />\nnot attempt to draw a vivid picture of 'bread<br />\ncrumbs bursting in air\" and a general atmosphere of good humor, but rather accept the<br />\ntraditional picture of mournful and silent<br />\nyoung men gathered round a frugal meal.<br />\nThe occasion was relieved by the presence of<br />\nseveral freshmen, who, however, happened in<br />\nintentional& and afforded no amusement from<br />\nthe point of view of captives. Mr. Guerard,<br />\nas toastmaster, was ideal. Several men made<br />\nspeeches, mostly on traditional topics, such as<br />\n``The Class,\" -The University\" and -Athletics.\" Several other speeches were made,<br />\nthe titles of which are for certain reasons reserved. During the banquet the awarding of<br />\nvarious honors was made. Among these were:<br />\n(1) Most popular man, Mr. Lowndes and Mr.<br />\nBaily (tie). (2) The biggest grind, Mr.<br />\nFisher (unanimous). (3) The Candy Kid,<br />\nMr. Onion.<br />\nDetermination was expressed to support the<br />\nUniversity in every possible way after graduation, and it was voted to hold reunions as<br />\nfrequently as possible. The banquet broke<br />\nup somewhat earlier than is usual, perhaps,<br />\nfor senior banquets, but it was an occasion<br />\nthat will long be remembered by all those who<br />\nwere present.<br />\n<br />\n\fTHE NEWS-LETTER.<br />\n<br />\n••;\"<br />\n<br />\nOne college man after<br />\nanother has learned that<br />\n<br />\nare just the kind he likes, and<br />\nhas told his friends about them.<br />\nThus their popularity grew until today \"Fatimas\" are very<br />\npopular among college men<br />\neverywhere.<br />\n<br />\n11<br />\n<br />\n\f12<br />\n<br />\nTHE NEWS-LETTER.<br />\n<br />\nST. JOHN'S FOOTBALL DATES.<br />\nThe football team of St. John's College,<br />\nAnnapolis, will play 11 games next fall, according to the schedule that has been arranged<br />\nby Manager T. Reed Mudd. The schedule is<br />\nnow complete with the exception of one date,<br />\nNovember 16, for which negotiations are still<br />\npending.<br />\nThe prospects for a strong team are considered bright, as only two of the members of<br />\nlast season's fast eleven will be lost by graduation. The schedule follows:<br />\nOctober 2—Rock Hill College at Annapolis.<br />\nOctober 6—Navy, at Naval Academy.<br />\nOctober 9—University of Virginia, at Char-<br />\n<br />\nSCIENTIFIC ASSOCIATION.<br />\nThe Scientific Association met in Hopkins<br />\nHall on Wednesday, February 4th, Professor<br />\nHalstead, of the Medical School, was the<br />\nfirst speaker. His paper was on the effects of<br />\nexcision and transplantation of the parathyroid glands; with a resume of the work<br />\ndone on this subject at the universities of<br />\nUpsala and Vienna and at Johns Hopkins.<br />\nDr. J. A. Anderson, instructor in astronomy,<br />\nspoke on the aurora borealis and the recent<br />\ntheories in regard to the nature of this<br />\nphenomenon.<br />\n<br />\nlottesville.<br />\nOctober 16—Pending.<br />\nOctober 23—Franklin and Marshall College,<br />\nat Lancaster, Pa.<br />\nOctober 27—University of Maryland at An-<br />\n<br />\n-ecti,e6<br />\nTOWN&COUNTRY<br />\n<br />\nnapolis.<br />\nOctober 30—Virginia Military Institute, at<br />\nLexington.<br />\nNovember 6—Washington College at Chestertown.<br />\nNovember 13—Maryland Agricultural College, at College Park.<br />\nNovember 20—Johns Hopkins University,<br />\nat Baltimore.<br />\nNovember 25 (Thanksgiviqg Day)—Pennsylvania Military Academy, at Chester, Pa.<br />\n<br />\nUNIVERSITY NOTES.<br />\nSamuel C. Chew, 1909, is now convalescing<br />\nafter an operation for appendicitis.<br />\n<br />\nSHIRTS<br />\nmeet every requirement<br />\nas well as the highest ex$1.50 up.<br />\npectations.<br />\nCLUETT,PEABODY<br />\n<br />\nV<br />\nC<br />\nSTATI0 HERS<br />\n311 N.CHAR LES ST<br />\n'//t/1/40ftf<br />\n<br />\nvesxwiN<br />\n4f1 r<br />\n<br />\nCO., Makers<br />\n<br />\nSocial Etiquette with College<br />\nMen is an essential, therefore your<br />\nVisiting Cards and Stamped Stationery as well as your Gifts<br />\nshould be correct. LYCETT, the<br />\nSociety Stationer, is at 317 N.<br />\nCharles Street, and can give y ou<br />\nall of these at reasonable prices.<br />\n<br />\nMy! How the ushers at the Hopkins Meet<br />\nwere touched for their badges!<br />\nCheers for Billy Bond! coepil, cucurrit,<br />\nvincit!<br />\nBrent H. Farber, of the class of 1911, has<br />\nleft the university. After a short course at<br />\na business college, he intends to go to<br />\nBrent will be greatly<br />\nMemphis, Tenn.<br />\nmissed.<br />\n<br />\nBonbons<br />\n<br />\nChocolates<br />\n<br />\n18 and 20 E. Baltimore St., Baltimore, Md.<br />\n<br />\nLEFRANC & AULT<br />\nSell a GUARANTEED GOAT SKIN GLOVE<br />\n<br />\nat $1.00 and $1.50 Per Pair<br />\nFreddy Lee, 1912, broke his collar bone at<br />\na most inoportune time. He was greatly<br />\nhandicapped at the dance on the 8th.<br />\n<br />\nAT THE<br />\n<br />\nSHIRT SHOP, 421 North Howard Street<br />\n2 DOORS BELOW FRANKLIN<br />\n<br />\nA.<br />\n<br />\n\fSecond-HandSchool and College Text Books<br />\nBOUGHT and SOLD AT<br />\n<br />\nSIETWS BOOK STORE, 834),(15<br />\n<br />\noent<br />\nda<br />\nSdtirse<br />\norti<br />\n,<br />\no<br />\nbw<br />\novaersi<br />\ndN<br />\no.<br />\n<br />\nS'TUDEN'T'S STATIONERY<br />\n<br />\nChas. E. Smith & Co.<br />\n..florists...<br />\nBaltimore<br />\n<br />\n121 N. Liberty Street,<br />\n<br />\nLO<br />\n<br />\nWM. J. MILLER<br />\nFINE JEWELRY, DIAMONDS AND WATCHES<br />\n28 East Baltimore Street<br />\nManufacturer of College Seals and Pins, College Shields<br />\nin Bronze for Wall Decoration<br />\n<br />\nCD'ai4CD -ECRIaitvama<br />\n<br />\nccpEa,,APIM\".<br />\n<br />\nEngravinsfor the Printet,lerchant &Manufacturer<br />\ntiI, Cttr•'toward and<br />\n<br />\nFtis,(Ate Streets<br />\n<br />\nEnAurutilleks,DID.<br />\nTill /16/14111,6S IN //1/5 BOON 4/1./- AM/M /ff 1/.5<br />\n<br />\n\\/f P051<br />\n(<br />\n4/11,1 CUTS AIIIDE FROM YOUR PliOTOGIMPI15\\7<br />\n. •<br />\n<br />\nENGRAVING<br />\n<br />\nPRINTING<br />\n<br />\nNUNN & COMPANY<br />\n<br />\nBOOKSELLERS and STATIONERS<br />\n<br />\nTHE BEST<br />\n<br />\nGE ANNUAL CUTS ME HAM MITT<br />\n<br />\n01 L<br />\n<br />\nCarry a complete line of School Books and College<br />\nText Books, Miscellaneous Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br />\n<br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n535 North Howard Street<br />\nSTATIONERY<br />\n<br />\nBINDING<br />\n<br />\nFOSNOT and WILLIAMS CO.<br />\nPRINTERS<br />\n<br />\nWatermctn's<br />\nIdeaI t•<br />\n<br />\nFountain<br />\nPen<br />\n—•<br />\n<br />\niJ<br />\n<br />\n5 1 4- 1 6 WEST FRANKLIN STREET<br />\nThe News-Lotter, a product of our plant<br />\n<br />\nSTUDIO<br />\nILGENFRITZ<br />\nSuccessor to<br />\nCumm INS<br />\n<br />\nARTISTIC PHOTOGRAPHY<br />\nBALT1MOR<br />\n319 North Charles Street<br />\nSpecial Discount to Students<br />\n<br />\n\"llESSONIAN<br />\n<br />\n19 A Smart Shoe for college men<br />\nwith a touch of newness that<br />\nyou'll like.<br />\n<br />\n/<br />\n<br />\nEndorsed bg,' \"'\"'\"<br />\nthe Millions<br />\n<br />\nNow using them the world over<br />\n<br />\nTO BE: OBTAINED ONLY AT<br />\n<br />\nN. HESS' SONS,8 East Baltimore Stree<br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold and Exchanged<br />\n<br />\nFOR SALE<br />\nEVERYWHERE<br />\n<br />\nPIPPEN'S BOOK STORE<br />\nNear the University<br />\n<br />\n605 NORTH EUTAW -ST.,<br />\n<br />\nDALT1/10RE'SILARGEST OLD BOOK STORE<br />\n<br />\nNEW YORK CLOTHING HOUSE<br />\nSMART .A.T9rIR.E<br />\nSISC() -1-31E1C0S.<br />\nFLAGS<br />\n<br />\n„A<br />\n<br />\nBANNERS<br />\n<br />\n13 WEST LEXINGTON STREET,<br />\n<br />\n•<br />\n<br />\n%A<br />\n•<br />\n<br />\nBADGES<br />\nBALTIMORE, MD<br />\n<br />\nReady-to-Wear<br />\n<br />\nand Made to Order<br />\n<br />\nSole Agents for the Everwear Hose—guaranteed 6 months<br />\n102-104 BALTIMORE STREET, EAST<br />\nOPPOSITE<br />\n<br />\nLIGHT<br />\n<br />\nWhen making your purchases, kindly remember our advertisers<br />\n<br />\nSTREET<br />\n<br />\n\fHOPKINS--LEMMERT<br />\nBOTH STAND ON A HIGH PLANE<br />\nSTUDENTS WEARING LEMMERT<br />\nCLOTHES SET THE PACE OF<br />\nWELL-DRESSED MEN<br />\n::<br />\nOUR PRICES ARE REASONABLE<br />\nENOUGH TO PLEASE YOU ::<br />\n<br />\nGLOVES<br />\nAsk for the best and 'see<br />\n<br />\nLEMMERT<br />\n<br />\nhow<br />\n<br />\n10 E. FAYETTE STREET<br />\nA.<br />\n<br />\nquick they'll bring<br />\n<br />\nyou<br />\n<br />\nFOWNES<br />\n<br />\n“. vu'rrriN(4Manufactuier of<br />\n<br />\nGreek Letter Fraternity Jewelery<br />\n213 NORTH LIBERTY STREET<br />\nPlease‘call and examine our line before purchasing<br />\n<br />\n\"COLLAR HUG\" CLOTHES<br />\n<br />\nThe Quality Shop<br />\n116 E. BALTIMORE STREET<br />\n<br />\nBALTIMORE<br />\n<br />\nTake your college colors to the athletic<br />\nMOW ENTHUSIASM. games<br />\nand help your team to victory.<br />\n<br />\nHOTEL CUMBERLAND<br />\n<br />\nOur Special 25c. Pennant Can't Be Beaten<br />\nBetter ones for more money<br />\n<br />\nN<br />\n<br />\nW -V0rt,K<br />\n<br />\nHoward Novelty Company<br />\n<br />\nS. W. Corner BROADWAY AND 54th STREET<br />\n<br />\n323 N. Howard Street<br />\n<br />\nNear 50th Street Subway Station and 53rd Street Elevated<br />\n<br />\nCONFECTIONER AND CATERER<br />\n<br />\nKept by a<br />\nCollege Man<br />\n<br />\nIdeal Location<br />\nNear Theatres<br />\nShops and ,<br />\nCentral Park<br />\n<br />\n701 West North Avenue<br />\nHORLICK'S MALTED MILK<br />\nORIGINAL AND ONLY GENUINE<br />\n<br />\nPure, rich milk, with the extract of malted grains, reduced<br />\no powder form. A delicious, nourishing food-drink is made<br />\nn a moment by merely stirring in water. Invigorating,<br />\nipbuilding, and sustaining for the student, lecturer, athlete,<br />\n.raveler, for all ages. In powder form, also in Lunch<br />\n['giblet form with chocolate. Samples free. Always ask for<br />\n`Horlick's.\"<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n<br />\nHeadquarters<br />\nfor Cdllege<br />\nMen<br />\n<br />\nNew, Modern<br />\nand<br />\nAbsolutely<br />\nFireproof<br />\nMost Attractive Hotel in<br />\nNew York<br />\n<br />\nSpecial Terms<br />\nfor College<br />\nTeams<br />\n<br />\nAll Outside<br />\nRooms<br />\n<br />\nHORLICK'S MALTED •MILK COMPANY<br />\nRacine, Wisconsin<br />\n<br />\nPURNELL ART CO.<br />\n<br />\n10 Minutes Walk to 20 Theatres<br />\n<br />\n224 NORTH' HOWARD STREET<br />\n<br />\nTRANSIENT RATES (with BATH), $2.50 and up<br />\n<br />\nIMPORTERS AND DEALERS<br />\n<br />\nSEND FOR<br />\n<br />\nFINE ARTS<br />\nPictures Framed Correctly and Promptly at Moderate Prices<br />\n<br />\nBOOKLET<br />\n<br />\nHARRY P. STIM SON<br />\n<br />\nR. J. BINGHAM<br />\n<br />\nFormerly with Hotel Imperial<br />\n<br />\nFormerly with Hotel Woodward<br />\n<br />\n\f", "format": "basic_html", "processed": "cenommatoST11 DE • To.OR<br />\nTHE•JOHNS•HOTKIHS-UNIVERSITY<br />\n)BALTIMORE<br />\nOM Nil<br /><br />\nThe Johns Hopkins University.<br />\nBALTIMORE, MD.<br />\nThirty-Third Year.<br /><br />\nThe Johns Hopkins Press.<br />\nI.<br /><br />\nBeginning October 1, 1908.<br />\nII.<br /><br />\nIRA REMSEN, President.<br />\nDean of the College Faculty'<br />\nEDWARD H. GRIFFIN,<br />\nDean of the Medical Faculty.<br />\nWILLIAM H. HOWELL,<br /><br />\nIII.<br /><br />\nINSTRUCTION.<br />\nIV.<br />\nFor Graduate Students:<br />\nIn Philosophy and the Arts. (Courses for<br />\ncandidates for the degrees of Ph. D.,and A.M.)<br />\nIn Medicine. (Courses for candidates for the<br />\ndegree of M. D.; courses for physicians.)<br /><br />\n(a)<br />\n(b)<br /><br />\nFor Undergraduates:<br />\nAs candidates for the degree of B. A.<br />\n(c)<br />\n(d)<br />\nAs special students.<br /><br />\nV.<br />\nVI.<br /><br />\nVII.<br /><br />\nVIII.<br /><br />\nLibraries.<br />\n136,000 volumes<br />\n164,000 volumes<br />\n260,000 volumes<br /><br />\nUniversity<br />\nPeabody Institute.<br />\nPratt Library.<br /><br />\nIX.<br /><br />\nLaboratories.<br /><br />\nDirectors.<br /><br />\nChemistry.<br />\nPhysics.<br />\nGeology and Mineralogy.<br />\nZoology.<br />\nBotany<br />\nAnatomy.<br />\nPhysiology.<br />\nPathology and Bacteriology.<br />\nPharmacology.<br />\nPhysiological Chemistry.<br />\nExperimental Psychology.<br /><br />\nIra Remsen.<br />\nJoseph S. Ames.<br />\nWilliam B. Clark.<br />\nWilliam K. Brooks.<br />\nD. S. Johnson<br />\nFranklin P. Mall.<br />\nWilliam H. Howell.<br />\nWilliam H. Welch.<br />\nJohn J. Abel.<br />\nJohn J. Abel.<br />\nJohn B. Watson<br /><br />\nSeminaries.<br /><br />\nDirectors.<br /><br />\nGreek.<br />\nLatin.<br />\nSanskrit.<br />\nSemitic.<br />\nGerman.<br />\nRomance.<br />\nEnglish.<br />\nHistory.<br />\nHistory.<br />\nPolitical Economy.<br />\nPolitical Science.<br />\nPhilosophy.<br />\n1Mathematics.<br />\nPhysics.<br /><br />\nBasil L. Gildersleeve.<br />\nKirby F. Smith.<br />\nMaurice Bloomfield.<br />\nPaul Haupt.<br />\nHenry Wood.<br />\nA. Marshall Elliott.<br />\nJames W. Bright.<br />\nJohn M. Vincent.<br />\nC. M. Andrews.<br />\nJ. H. Hollander.<br />\nW. W. Willoughby.<br />\nJ. Mark Baldwin.<br />\nFrank Morley.<br />\nJoseph .5. Ames.<br /><br />\nX.<br /><br />\nXI.<br /><br />\nXII.<br /><br />\nXIII.<br /><br />\nUndergraduate Courses (leading to B. A.)<br />\nOROUPS.<br />\nI.<br />\n2.<br /><br />\n3.<br />\n4.<br />\n5.<br /><br />\nAncient Languages.<br />\nModern Languages.<br />\nHistory and Political Economy.<br />\nMathematics and Physics.<br />\nChemistry, Biology and Geology.<br /><br />\nSerial Publications.<br />\nMathematics (vol. XXXI).<br />\nJournal<br />\nof<br />\nAmerican<br />\nAmerican Chemical Journal (vol. XLI).<br />\nAnierical Journal of Philology (vol. XXX).<br />\nStudies in Historical and Political Science (vol. XXVII).<br />\nModern Language Notes (vol. XXIV).<br />\nMemoirs from the Biological Laboratory (vol. VI).<br />\nContributions to Assyriology (vol. VI).<br />\nTerrestrial Magnetism (vol. XIII)4<br />\nUniversity Circular (vol. XXVIII).<br />\nProgrammes of the courses offered to graduate students<br />\nin Philosophy and the Arts and in Medicine, and also of<br />\nthe undergraduate courses, may be obtained on application<br />\nto the Registrar.<br /><br />\nXIV.<br /><br />\nXV.<br /><br />\nXVI.<br /><br />\nAmerican Journal of Mathematics.<br />\nF. MORLEY, Editor. Quarterly. 4to. Volume<br />\nXXXI in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Chemical Journal.<br />\nI. REMSEN, Editor. Monthly. 8vo. Volume<br />\nXLI in progress. $5 per volume. (Foreign<br />\npostage 50 cents).<br />\nAmerican Journal of Philology.<br />\nB. L. GILDERSLEEVE, Editor. Quarterly. 8vo.<br />\nVolume XXX in progress.\" $3 per volume.<br />\n(Foreign postage 50 cents).<br />\nStudies in Historical and Political Science.<br />\nMonthly. 8vo. Series XXVII in progress. $3 per<br />\nvolume. (Foreign postage 50 cents).<br />\nJohns Hopkins University Circular.<br />\n8vo. Volume XXVIII in progress. $1 per year.<br />\nJohns Hopkins Hospital Bulletin. Monthly. 4to.<br />\nVolume XX in progress. $2 per year. (Foreign<br />\npostage 50 cents).<br />\nJohns Hopkins Hospital Reports. 4to. Volume<br />\nXV in progress. $5 per volume. (Foreign postage 50 cents).<br />\nContributions to Assyriology and Semitic Philology (Beitrage zur Assyriologie, etc.) PAUL<br />\nHAUPT and FRIEDRICH DELITZSCH, Editors. Volume VI in progress.<br />\nMemoirs from the Biological Laboratory.<br />\nW. K. BROUKS, Editor. Volume VI in progress<br />\nModern Language Notes.<br />\nA. M. ELLIOTT, Editor. Monthly. 4t0. Volume<br />\nXXIV in progress. $1.50 per volume. (Foreign<br />\npostage 25 cents).<br />\nAmerican Journal of Insanity.<br />\nHENRY M. HURD, Editor. Quarterly. 8vo. $5<br />\nper volume.<br />\nTerrestrial Magnetism and Atmospheric Electricity. L. A. BAUER, Editor. Quarterly. 8vo.<br />\nVolume XIII in progress. $2.50 per volume.<br />\n(Foreign postage 25 cents).<br />\nReprint of Economic Tracts.<br />\nJ. H. HOLLANDER, Editor. First Series and<br />\nSecond Series, 15. Third Series in progress, $2.<br />\nAnnual Report.<br />\nPresented by the President to the Board of Trustees,<br />\nreviewing the operations of the University during<br />\nthe past academic year.<br />\nAnnual Register.<br />\nGiving the list of officers and students, and stating<br />\nthe regulations, etc., of the University. Published<br />\nat the close of the academic year.<br />\nReports of the Maryland Geological Survey.<br />\nWILLIAM B. CLARK, Editor.<br /><br />\nIn addition to the serials above named, copies may be<br />\nobtained of the works mentioned below:<br />\nThe Collected Physical Papers of Henry A. Rowland.<br />\nThe Critical Edition of the Hebrew Text of the Old Testament. Edited by Paul Haupt. Prospectus on application.<br />\nRowland's Photographs of the Normal Solar Spectrum. to<br />\nplates. $25.<br />\nSelections from the Early Scottish Poets. By William<br />\nHand Browne. 240 pages. $1.25.<br />\nStudies in Honor of Professor Gildersleeve. 527 pages,<br />\noctavo. $6.<br />\nThe Taill of Rauf Coilyear. Edited by William Hand<br />\nBrowne. 164 pages. $1.<br />\nPoe= de Fernan Goncalez. Edited by C. Carroll Marden.<br />\n282 pages. $2.50.<br />\nBaltimore Lectures on Molecular Dynamics and the Wave<br />\nTheory of Light. By Lord Kelvin. 716 pages. $4.50.<br />\nThe Oyster. By W. K. Brooks. 226 pages. $1.<br />\nEcclesiastes: A New Metrical Translation. By Paul Haupt.<br />\n50 pages. 50 cents.<br />\nThe Book of Nahum: A New Metrical Translation. By<br />\nPaul Haupt. 53 pages. 50 cents.<br />\nAncient Sinope. By David M. Robinson. 112 pages. $t.<br />\nA full list of publications will be sent on application.<br />\nCommunications in respect to exchanges and remittances<br />\nmay be sent to the Johns Hopkins Press Baltimore, Md.<br /><br />\nbane tbe Inteto tiaib<br />\na mearg ruab me treab<br />\nli I bile tbe farultg make it tbeir biz<br />\nTo quiz, quiz, quiz!<br /><br />\nII li ell<br /><br />\nAlars, aub tile Estubent',3 life<br />\n316 nauglit but a war aub a atrife:<br />\nilut ifti reallll nut go hub,<br />\nObe rnab in nut an rnugb<br />\nAub lifers not reallll mai<br />\nMille me bluff, bluff, bluff!<br /><br />\nrm!i-iQrttrr.<br /><br />\n1!r<br />\nVol,. XIII.<br /><br />\nFEBRUARY<br /><br />\nSubscriptions, $1.50 per year.<br /><br />\n12, 1909.<br /><br />\nPublished Fortnightly by the Undergraduates.<br /><br />\nBOARD<br /><br />\nOF<br /><br />\nNo. 8<br />\nio Cents per copy<br /><br />\nEDITORS.<br /><br />\nGeorge W. Corner, 3d, 1909, Editor-in-Chief.<br />\nJ. Hamilton Owens, i909,Ass't Editor-in-Chief.<br /><br />\nWalter V. Johnson, 1909, Athletic Editor.<br /><br />\nAlan C. Woods, 1910, News Editor.<br /><br />\nN. Williams Haynes, 1912, Ass't Athletic Editor.<br /><br />\nG. Ross Veazey, 1910, and E. D. Martin, 1911, Ass't News Editors.<br />\nHertel P. Makel, 1911, Business Manager.<br />\nAddress all articles, communications, etc. to George W. Corner, 3d, Box 107, Johns Hopkins University,<br />\nBaltimore, Md.<br />\nSubscriptions and business<br />\nUniversity, Baltimore, Md.<br /><br />\ncommunications should<br /><br />\nbe sent to H. P. Makel, Johns Hopkins<br /><br />\nEDITORIAL.<br />\nOMETIME ago one of the weekly journals published an article which<br />\nurged, in a half-serious way, the appointment of a professor-ofthings-in-general on every college faculty. The writer perceived the<br />\nfact (which, indeed, does not need to be pointed out to thoughtful college men) that the enormous broadening of the range of learning at<br />\nthe present time, and the rage for specialization, are producing onesided men in our universities. Thus even in Johns Hopkins, when<br />\na class reaches its senior year, it is divided up into the biology men,<br />\nand the chemists, and the Latinists, and the athletic men, and so on.<br />\nIn spite of compulsory studies, the degree of A. B. is getting to mean<br />\nless and less a 'well-rounded education.\" For this reason, our writer suggested the creation<br />\nof a professor who should make it his duty to stimulate the students to look beyond their<br />\nspecial courses. While, as we all know, the range of tastes and studies is too great for any<br />\none man to be such a professor-of-things-in-general to all the student-body, it is possible that<br />\nevery student have a private course of his own. The writer finds his course-of-things-ingeneral in a little class, tucked away in the corner, and frequented by but three or four. The<br />\ninstructor does not consider it necessary to limit himself to the strict letter of his subject, but<br />\noften takes the opportunity to digress and discuss art, politics, and the topics of the day.<br />\nOf course, not every study permits treatment of this kind. The writer has the good<br />\nfortune to be a member of another class, in an entirely different department. Owing to the<br />\nnature of the subject, the instructor must occupy himself with a great mass of detail and<br />\nminor differences. But he does not stop there. Through the bewildering maze of his<br />\nmaterial he presents the great principles of a great science in such a way that his students<br />\ntake delight in going outside the work of the class to discover and learn for themselves.<br />\nUnfortunate the Johns Hopkins man who has not upon his schedule at least one<br />\ncourse-of-things-in-general; and happy he who finds in every study a broadening and stimulating influence.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n3<br /><br />\nr<br />\n.<br />\n\"11<br />\n1450<br />\n10<br />\n,<br />\nVaVais<br />\nL.. )IIVVVVVVVVVV<br />\nV<br /><br />\nE have read with interest the first two articles in The Independent regarding American Universities. In these two are treated Harvard<br />\nand Yale. If we were choosing our college from the facts thus presented we should choose Yale, notwithstanding the writer of the<br />\nseries considers Harvard the better.<br />\nIt seems strange to us that a college man, as Dr. Slosson is,<br />\nshould not understand what is meant by college democracy. There<br />\nVVV;<br />\n;V„trigVArsis in the mind of every present-day college man a clearly defined idea<br />\n!Or'OV'er<br />\nof<br />\ncollege democracy and this idea is the same all over the American<br />\n:Of V V<br />\ncollege world. Dr. Slosson merely sees the striving after it, and<br />\nimagines that because the strivings take different form that college democracy is different in<br />\neach institution.<br />\nA college is democratic when each student is first of all, a college man, that is a Hopkins man, etc., second, a fraternity or club man, and last of all an individual with personal<br />\ntastes<br />\nA class is democratic when its members in an election vote for the men they think best<br />\nfitted for the offices, and fraternity brothers do not vote for fraternity brothers, and non-frat.<br />\nmen for non-frat. men, regardless of their qualifications for the place.<br />\nA student is democratic when, for instance, in voting for the captain of an athletic<br />\nteam he will vote for the man he personally detests, if he thinks he is the best man for the job.<br />\nThe Yale custom of frowning upon valets and automobiles, is to prevent the University<br />\nfrom being divided up into a rich and poor class.<br />\nIt is not the use of Greek letters that is primarily objected to at Princeton; it is the<br />\nmodern Greek-letter fraternity system which, in some cases, breaks the University up into a<br />\nnumber of small cliques, and is thus a foe to college democracy.<br />\nIn other words college democracy strives to develop first of all a Yale man, a Princeton<br />\nman, etc., and incidentally, if desired, a frat. or society man.<br />\nIt strives to place every student upon an equal footing in college affairs.<br />\nIt strives to produce college unity.<br />\nIt differs from college spirit in being internal, whereas college- spirit is external, altho<br />\nthey are by no means independent.<br /><br />\nUST as this issue of the NEWS-LETTER is going to press, the daily<br />\npapers make the important announcement that the trustees of the<br />\nuniversity have decided to institute an Advisory Council of Alumni.<br />\nThis council is to advise the trustees in their actions, to hustle for<br />\nHomewood, and in general to bridge the gulf between the powers<br />\nthat be and the student, past and present.<br />\nFrom an undergraduate point of view, the innovation is good<br />\nall around. We believe that much of the half-heartedness of the<br />\nC<br />\nC. 11<br />\nalumni has been due to the fact that they have hardly even had the<br />\n4L.IZs St<br />\nst<br />\nV,<br />\n412.<br />\nprivilege of making suggestions as to the conduct of the university.<br />\nA body of men who have done so much for science, for letter;, and for the public service, will<br />\nsurely do much for their alma mater if given half a chance.<br />\nDr. E. F. Slosson, author of the much-discussed articles in The indePendenl, remarks upon<br />\nthe difference between the alumni of the Western and Eastern universities. In the West they<br />\nhave been extremely radical, sometimes going to.the Legislature to force the State University<br />\nfaculties to make innovations; in the East they have been morbidly conservative,in many cases.<br />\nWe believe that the Johns Hopkins alumni will go neither to one extreme nor to the other,<br />\nbut will pull together with trustees, faculty, and students for a wisely-planned, steady progress.<br />\nWon't we all make a fine team when we get a-going?<br /><br />\n4<br /><br />\nTHE NEWS-LETTER.<br /><br />\nTHE OPAL RING.<br />\n\"Yes,\" said my friend, Jean, the village<br />\npriest. \"In following my duties as priest of<br />\nthese pious, but ignorant, people, I have<br />\nbeen called upon to be present at many deathbeds. At almost all of these I have heard the<br />\nstories of queer lives. Perhaps the most<br />\nstartling story I have ever heard, and, at least,<br />\none that will always remain in my mind as<br />\nthe most awful, was among the first I heard<br />\nin this parish and, indeed, it happened at my<br />\nsecond visit to a dying man.\"<br />\nMy old friend stopped and seemed to be<br />\nlost in a deep reverie. I saw a shudder run<br />\nthrough his body and an indescribable look<br />\ncame into his face as he thought again of the<br />\nscene. Knowing him well, I did not hurry<br />\nhim, but sal still, smoking an old clay pipe<br />\nand drinking ale, until with a sigh the old<br />\npriest began his tale.<br />\n\"To begin with, you must know something<br />\nof the old fellow who told me this biography.<br />\nHe lived in the old house that still stands on<br />\nthe road leading from the village into the<br />\nforest, and allowed no one to come near his<br />\nhouse but his servant, who had been his constant friend and companion for sixty years.<br />\nWhen I undertook this charge I was told to<br />\nleave Daniel—this was the only name he had<br />\nas far as the villagers were concerned—alone,<br />\nand I am ashamed to say that I did as I was<br />\nbidden, for he developed a most interesting<br />\ncharacter.<br />\n\"About a year after my arrival, the people<br />\nbegan to notice that the servant had been<br />\nneither in the market nor stores for some<br />\ntime. One old man in the parish became<br />\nvery curious and, venturing one night to the<br />\nhouse, looked in the only window and saw<br />\nthe old man Daniel sitting on a low chair beside a rough bed on which his faithful serGreatly<br />\nvant lay tossing and groaning.<br />\nalarmed he came to me at once and told me<br />\nwhat he had seen. I immediately seized my<br />\nmedicine case and rushed to the lonely house.<br />\nI knocked repeatedly and, as no one opened<br />\nthe door. I pushed my way into the only<br />\nroom. There the old man still sat, looking at<br />\nhis sick servant. I saw at once that he was<br />\ndying in a burning fever and I did all I could<br />\nto make his last moments comfortable. During<br />\nmy efforts Daniel sat dazed watching my<br /><br />\nefforts in an indifferent manner. When his<br />\nservant died he got up, walked around the<br />\nroom and, running to me, said sharply, \"you<br />\nhave done enough, now go! Come again one<br />\nweek from tonight!\"<br />\n\"The next Friday night I presented myself<br />\nat his door, and he opened it and admitted me<br />\ninto the bare room. In one corner stood the<br />\nrude bed, in another a small, fireless stove, in<br />\nanother a few clothes hung upon the wall, and<br />\nin another, leaning against the wall, stood a<br />\npick and shovel with fresh dirt upon them.<br />\nI guessed that he had just buried his old<br />\ncompanion. In the centre of the room stood<br />\nan old table, covered with books. On it there<br />\nwas a bottle of wine, a battered plate filled<br />\nwith cakes, glasses, and a large red lamp<br />\nwhich cast a glow over everything. There<br />\nwere two large arm chairs, on either side<br />\nof the table, which looked out of keeping<br />\nwith the other furniture of the room.<br />\n\"Daniel motioned me into one of these<br />\nchairs and there we sat for some time, silently<br />\nlooking at each other. At last the old man<br />\ngot up, filled my glass with the rare old wine<br />\nand, after pouring out a second glassful, sat<br />\ndown. So we sat for the remainder of the<br />\nevening. While there, my glances took in<br />\nall the books on the table and I saw, with a<br />\ngreat shock, that there lay a well worn Bible,<br />\nsurrounded by every kind of fiction, I was<br />\ngreatly surprised, for my host was a small<br />\nharsh, stern old man with a diabolical look in<br />\nhis eyes, and I had not expected to find a<br />\nBible in his house. When at last I arose to<br />\ngo, the old gentleman said in his sharp tone,<br />\n'Come again next week,' and let ine out the<br />\ndoor.<br />\n\"This happened for several weeks, until at<br />\nlast a kind of friendship sprang up between<br />\nus. Then we often sat until the wee small<br />\nhours discussing matters pertaining to religion and politics. I soon found out that my<br />\nfriend knew more than I. Although I often<br />\ntried to get him to tell me of his former life,<br />\nhe would always shut up like a clam when I<br />\nmentioned the past, and so I learned to curb<br />\nmy'curiosity.<br />\n\"Things went on in this fashion for a year,<br />\nuntil one Friday night, as usual, I walked<br />\ndown the road toward my friend's house,<br /><br />\nTHE NEWS-LETTER.<br /><br />\nthinking of the old man and wondering what<br />\ntale of sorrow he could tell if he would. As<br />\nI neared the house, I saw with alarm that<br />\nth2re was no light shining fi 0:11.the window.<br />\nI knocked, but got no response. When at<br />\nlast I pushed the door open I heard a low<br />\ngroan from the bed.<br />\nRushing across I<br />\ngrasped my friend's hand and felt his rapid<br />\npulse. Instantly I knew that he was dying<br />\nfrom the same fever that had carried off his<br />\nold servant a few months before, and that I<br />\ncould do nothing for him.<br />\nHe asked for water, and when I gave it<br />\nto him drank eagerly, and then said, 'Sit<br />\ndown, I want to tell you something.' I did<br />\nas he asked and then listened, with many<br />\ninterruptions for water, to a story such as I<br />\nhave never heard -since.<br />\n\"'Father, you have been very kind to me,<br />\nand beforel die I want to tell this and ask<br />\nyou to bury me according to the Church.'<br />\n\"Here the old man stopped and drew a<br />\nlong breath, and then he continued:<br />\n\"'There was once a rich man in America<br />\nwho had an only son. This son was the only<br />\njoy the old man had, and in him he centered<br />\nhis hopes and his highest ambitions. He<br />\ngave his boy everything he wanted, and,<br />\nafter his education was complete, he sent him<br />\nabroad for travel and further learning. But<br />\nthe son was very ungrateful, and, after being<br />\nturned out by his father, he went into the<br />\nWest and lived the rough life of a cowboy.<br />\nThere he met a young girl to whom he<br />\ndeclared his love. She told him she loved<br />\nhim, but refused to marry him until he proved<br />\nhimself a man. Determined to win her, the<br />\nyoung man left the State and his old companions and began a new life. Before going he<br />\nwent to the girl and gave her a heavy ring,<br />\nset with a large opal, and told her he would<br />\ncome back some day for the ring and herself.<br />\nSeveral years went by, and at last the young<br />\nman felt himself the man he should be. As he<br />\nwalked through the woods to their oldtrysting place, he saw a young couple walking<br />\ntowards to him with their arms around each<br />\nother. As he himself was a lover, he stepped<br />\nbehind a tree in order to let the pair pass him<br />\nundisturbed. As they drew nearer, something<br />\nabout the girl seemed familiar, and a sudden<br />\nfear seized him. When at last they drew<br /><br />\n5<br /><br />\nnear to him, he saw that the girl was his<br />\nsweetheart. Without a word he fired two<br />\nshots at the pair; the young man fell dead,<br />\nand the girl fell mortally wounded. Without<br />\na word the young fellow jumped from behind<br />\nthe tree, fired another shot into the dead man,<br />\nand then turned to the girl. She had fainted,<br />\nand he bent over her and kissed her. This<br />\nkiss seemed to revive her, for she threw her<br />\narms around his neck and whispered: 'Jack,<br />\nI knew you would come back. You see, here<br />\nis your ring. Take it. You have killed my<br />\nbrother. I forgive<br />\n\"Here the dying man stopped short, and,<br />\nafter some moments of quiet breathing, passed<br />\naway. I sat there for some time lost in<br />\ngloomy thought.\"<br />\nHere my friend stopped, and, with a deep<br />\nsigh, handed me a simple, heavy gold ring,<br />\nset with a large, clear opal.<br />\nX. Y. Z.<br /><br />\nRECENT LECTURES.<br />\nAn unusually full and varied course of lectures<br />\nhas been provided this year by the university.<br />\nOne or another of the various lecture rooms<br />\nhas been in use almost every day.<br />\nProfessor A. V. Williams Jackson, of<br />\nColumbia, has been lecturing on \"The Religion of Persia:\"<br />\nFabian Franklin, Ph.D., formerly professor<br />\nof mathematics, is giving a series of ten<br />\nlectures upon \"The Principles of Political<br />\nEconomy.\"<br />\nProfessor Felix Schelling, of the University<br />\nof Pennsylvania, has completed a series upon<br />\n\"The Elizabethan Drama,\" given before the<br />\nEnglish seminary.<br />\nDr. Stevenson, of Rutgers, is lecturing<br />\nupon \"The Age of Discovery\" before the<br />\nhistorical seminary.<br />\nDr. David M. Robinson, associate professor<br />\nof classical archaeology, spoke upon \"Stages<br />\nin the Life of Ancient Greece\" on the evening<br />\nof February 5th.<br />\nDr. 0. L. Fassig, of the Maryland State<br />\nWeather Bureau, gave a series of lectures on<br />\n\"Meteorology\" before the department of<br />\ngeology.<br />\nThe February meeting of the Scientific<br />\nAssociation, and the address of Mr. Ben<br />\nGreet, are reported elsewhere in this issue.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n6<br /><br />\nIGtilk311<br />\nTHE HISTORY OF LACROSSE AT<br />\nJOHNS HOPKINS.<br />\nBy WILLIAM C. SCHMFOSSER.<br />\nNovember 10, 1908.<br /><br />\n)11linued from lasl issue).<br />\n1893.<br /><br />\nThe lacrosse season of 1893 was a success<br />\nin two ways: first, from the financial point of<br />\nview, and secondly, from that of the caliber<br />\nof the team turned out. Six games were<br />\nplayed and Hopkins won four of these and<br />\nsecond place in the Lacrosse League.<br />\nThe Hullabaloo of 1894 treats the 1893<br />\nseason as follows: '`In our first game we<br />\nextended to our visitors, the College of the<br />\nCity of New York, a warm reception, for<br />\nwhich Baltimore Lacrosse teams are justly<br />\nfamous, by defeating them by a score of 9-1.<br />\nIn the second game we received an unpleasant surprise. Awed by the former renown<br />\nof the famous Druids, our team seemed to go<br />\ninto a state of lethargy from which it did not<br />\nemerge until the game had ended. The<br />\ndefeat on the whole, however, was beneficial,<br />\nas it pointed out the weak points, and aroused<br />\nin the members of the team the determination<br />\nto remedy its defects. After defeating the<br />\nAthletic Club of the Schuylkill Navy, the<br />\nfirst championship game of the season was<br />\nplayed with Stevens. It was an extremely interesting and well-played game in which<br />\nHopkins showed themselves the better ill all<br />\nround work and won by a score 6-3. Lehigh<br /><br />\nwas our next opponent. Their team work<br />\nwas brilliant and showed from the outset that<br />\nthey were to win. At the end of the firsthalf the score was a tie, but in the secondhalf their magnificent training made itself<br />\nfelt and we were easily defeated by a score of<br />\n6-3.\"<br /><br />\n'`Our team closed its season very pleasantly<br />\nby defeating the Athletic Club of Schuylkill<br />\nat Philadelphia.The work of the team throughout the season was good and showed a marked<br />\nimprovement over the work of the previous<br />\nyear. The training was more vigorously<br />\nadhered to and the team work much improved.<br />\nToo much stress, however, was placed upon<br />\n'body work' which in many instances interfered materially with the proper use of the<br />\nstick.\"<br />\nIt is interesting to note that already at that<br />\ntime the coaches had trouble in developing all.<br />\nevenly balanced team with reference to body<br />\nwork\" and ''stick work.\"<br />\nA study of the accounts of the games as<br />\ngiven in the newspapers of that day show<br />\nthat Janney, Roszel, Symington, Straus and<br />\nthe other attack men carry off most of the<br />\nglory. Occasionally we read of the long<br />\nthrows of T. D. Penniman and a stop by the<br />\ngoal-keeper, but seldom of the other defense<br />\nplayers; therefore, we hesitate in giving<br />\nthese men all the credit for the good work;<br />\nno doubt every man did his share.<br />\nThe team was composed of these:<br />\nJ. B. Crenshaw, goal; T. D. Penniman,<br /><br />\nTHE NEWS-LETTER.<br /><br />\npoint; P. M. Dawson, cover point; F. C.<br />\nNewton, first defense; W. S. Baer, second<br />\ndefense; F. K. Cameron, third defense; T. F.<br />\nP. Cameron, centre; S. S. Janney, first<br />\nattack; B. M. Roszel, second attack; W. S.<br />\nSymington, third attack; T. E. Straus, out<br />\nhome; B. Phinizy, in home.<br />\nSubstitutes —W. H. Crampton; B. 13. Cone;<br />\nT. D. Penniman, captain; C. W. Baldwin,<br />\nmanager.<br />\nLacrosse Committee—B. M. Roszel, W. S.<br />\nSymington, W. S. Baer.<br />\n1894.<br />\nAs to the team of 1894 we get very enthusiastic accounts showing that lacrosse was by<br />\nno means at that time on the wane in Baltimore, and in fact the attendance at the several<br />\ngames played here rather showed a healthy<br />\ngrowing interest on the part of the general<br />\npublic.<br />\nOne writer tells us that ``the work of the<br />\nHopkins team during the past season, notwithstanding the fact that it won only the<br />\nsecond place, was most satisfactory. Active<br />\npractice began early in the spring, and continued without interruption until the final<br />\nchampionship game. Enough cannot be said<br />\nin praise of the conscientious way in which<br />\nnearly the entire team entered into training.\"<br />\nAfter reading this I was surprised to find that<br />\nthe record of games played that year showed<br />\nthat as a matter of fact Hopkins had won only<br />\none, beating Lehigh 6 to 4. Stevens, the<br />\nDruids and Cornell gloried over '`the Black<br />\nand the Blue\" with the following scores respectively 7 to 5, 3 to 1, and 6 to 0.<br />\nThe game with Cornell at Ithaca was quite<br />\nan undertaking. In fact it was then the longest trip a Hopkins team of any kind had ever<br />\nmade, and the writer believes this record still<br />\nholds good today. The great obstacle to overcome was the question of financing, as the<br />\nAthletic Association did not have much of a<br />\nworking fund and the guarantees were small.<br />\nIn addition to the games mentioned above,<br />\nthe University played two early practice<br />\ngames: one with the East Branch Y. M. C.<br />\nA. and the other with the Catonsville Lacrosse<br />\nClub. The former was not much of a game<br />\nto test the Hopkins team because some of 'the<br />\nBlack and the Blue men played on the Y.<br /><br />\n7<br /><br />\nM. C. A. team. This game will always be<br />\nremembered, however, by an amusing incident<br />\nwhich took place. It was in the latter part<br />\nof the first-half when after a missed shot at<br />\ngoal the ball went behind the same. With<br />\ntrue Hopkins spirit, Lupton, who was that day<br />\nplaying for Y. M. C. A. and Lilly, centre, for<br />\nour team, started after the ball. Lilly badly<br />\nchecked Lupton who to prepare himself for a<br />\ngood return check, threw off his cap. It is<br />\nremarkable to relate, but the cap fell directly<br />\non the ball and neither Lupton nor Lilly<br />\ncould locate the ball. After some consternation the tricky sphere was located and the<br />\ngame went on.<br />\nIn the Catonsville game nothing of peculiar<br />\ninterest occurred, except that Janney temporarily had his knee sprained. It may be<br />\nof interest to posterity to know that this<br />\nJanney knee\" was a remarkable and valuable asset to any lacrosse team, as it always<br />\nmanaged to get sprained when the Hopkins<br />\nplayers were winded, but could be reduced to<br />\nworking condition again in a few minutes.<br />\nThe men who composed our team that year<br />\nwere:<br />\nJ. F. Mitchell, goal; T. D. Penniman,<br />\npoint; P. M. Dawson, cover point; F. K.<br />\nCameron, first defense; J. B. Crenshaw,<br />\nsecond defense; T. E. Straus, third defense;<br />\nS. S. Janney, centre; B. M. Roszel, first<br />\nattack; T. F. P. Cameron; second attack; W.<br />\nS. Symington, third attack; M. Hill, out<br />\nhome; G. H. Hodges, in home.<br />\nSubstitutes—A. R. Stevens; B. Bande; T.<br />\nE. P. Cameron, captain; J. E. Shaw; A. C.<br />\nBryan; J. Hall Pleasants, Jr., manager.<br />\nJ. Hall Pleasants, Jr. was Secretary and<br />\nTreasurer of the Intercollegiate Lacrosse<br />\nAssociation.<br />\n1895.<br />\nWe who follow the modern lacrosse teams<br />\nat Hopkins are rather amused to read how<br />\nthe Hullabaloo of 1896 gives the boys of that<br />\nyear a pat on the back for doing such conscientious practice and training.<br />\nThey<br />\nstarted in about the first of April and continued until after the last game in May. We<br />\nalso read that the lacrosse men — with few<br />\nexceptions went into training on pledges so<br />\nthat when the championship season came, the<br />\nmen were in first rate physical condition and<br /><br />\n8<br /><br />\nTHE NEWS-LETTER.<br /><br />\nthis enabled them to make a creditable showing.\" We can understand that having no<br />\ncage at their disposal, it was practically impossible for them to get any practice up to<br />\nApril first, if the spring of 1895 was a late<br />\none; but why there should be exceptions to<br />\nthe training list, history does not show.<br />\nIt was unfortunate that the management<br />\nwas able to schedule only one practice game,<br />\nand that with the Maryland Athletic Club<br />\nwhich was just sallying forth with a lacrosse<br />\nteam. This game was won by Hopkins<br />\nunder the leadership of T. F. Cameron by a<br />\nscore of 10-0.<br />\nOur first championship game that year was<br />\nwith Stevens at Union Park. Among other<br />\nthings the papers vouch the information that<br />\n-the day was a fairly good one for lacrosse,<br />\nalthough there was a sprinkling of rain, and<br />\na little too much wind at times. The attendance was quite good, a large number of Hopkins students with black and blue flags and<br />\nbanners encouraging their team with college<br />\nyells, repeated at every possible opportunity<br />\noffered;\" that -the visitors excelled in team<br />\nwork, but the Baltimoreans were stronger<br />\nindividually;\" that .`Janney's superb playing<br />\nwas the feature;\" that ``Captain Cameron's<br />\nleg was injured early in the game, and his<br />\nusually fine work was thereby much impeded;\"<br />\nthat ``the Hopkins team was greatly strengthened by Mitchell and Sidney Cone, the former<br />\nby his splendid work between the goal posts,<br />\nsaving what looked like many a sure goal;\"<br />\nthat \"Cone was everywhere in the Hopkins<br />\ndefense field, and again and again he returned<br />\nthe rubber to the Hopkins attack field by his<br />\nlong throws\" and lastly that ''the Stevens<br />\nmanager will protest the game, claiming that<br />\ntwo of the Johns Hopkins players are not<br />\nbona-fide students.\" No doubt the manager<br />\ndiscovered that he was in error. The game<br />\nended in favor of Hopkins by a score of 6-3.<br />\nNext came our fatal trip to South Bethlehem. Several of the men had not recovered<br />\nfrom the Stevens game, and history tells us<br />\nthat the mainstay of our attack was so seriously hurt that he was using a cane until just<br />\nbefore the game. Judging from the newspaper quotations given above this player must<br />\nhave been our gallant captain Cameron. The<br />\naccount of this game as given in a special to<br />\nthe Baltimore American seems to be an accurate one. It reads as follows:<br />\n`‘South Bethlehem, Pa., May 18.—Lehigh<br />\nvirtually won the Intercollegiage Championship in Lacrosse by defeating the Johns Hopkins team 5 to 0. The first-half was exciting,<br />\nthe Johns Hopkins defense showing up particularly fine,especially on the part of Mitchell,<br /><br />\nCone and Dawson. To these men is due the<br />\ncredit of saving at least seven goals in this<br />\nhalf. The ball during the half was in Hopkins territory at least three-fourth of the time.<br />\nThe playing of Janney throughout the game<br />\nwas a feature. The second half opened with<br />\nthe Lehigh's getting the ball, and after a succession of brilliant passes securing the first<br />\ngoal, which was thrown by Bartles. The<br />\ncrowd, which was highly representative of<br />\nLehigh men, went wild and their vigorous<br />\nyelling inspired their men with renewed<br />\nenergy. From the scoring of their first goal<br />\nthe Lehigh team played with a vim and dash<br />\nseldom equalled in the history of the Intercollegiate League.<br />\n‘`The second goal was scored notwithstanding the efforts of the Hopkins defense. By<br />\nthis time the Hopkins men were evidently<br />\nfast becoming demoralized and the Lehigh<br />\nmen scored three remaining goals in quick<br />\nsuccession. Mr. Arnold Reese of Baltimore,<br />\nrefereed the game. It was he who introduced<br />\nlacrosse at Lehigh. His refereeing was firstclass, and was entirely satisfactory to both<br />\nteams. Mr. Albert Lefever, Johns Hopkins,<br />\n'94, umpired for Johns Hopkins. Mr. Springfield Baldwin, Lehigh, '96, umpired for<br />\nLehigh.'<br />\nThe make-up of the team for that year was:<br />\nJ. F. Mitchell, goal; S. M. Cone, point;<br />\nP. M. Dawson, cover point; J. B. Crenshaw,<br />\nfirst defense; A. K. Stevens, second defense;<br />\nF. A. Lupton, third defense; S. S. Janney,<br />\ncentre; H. M. Wilson, J. E. Shaw, third<br />\nattack; T. F. P. Cameron, second attack; H.<br />\nW. Kennard, first attack; M. B. Hill, out<br />\nhome; G. H. Hodges, in home.<br />\nSubstitutes—A. C. Bryan; R. E. Belknap;<br />\nL. M. Warfield; T. F. Cameron, captain;<br />\nJ. Hall Pleasants, Jr., manager; Dudley<br />\nWilliams, assistant manager.<br />\nDudley Williams, Vice-President Intercollegiate Lacrosse Association. M. W. Hill,<br />\nExecutive Committee of Intercollegiate<br />\nLacrosse Association.<br />\n(To he continued).<br /><br />\nMAXIMS FOR ATHLETIC SUCCESS.<br />\nMichael C. Murphy, trainer of the American Olympic Team, gives the following advice<br />\nto athletes:<br />\nFind the event for which you are best suited<br />\nand stick to it.<br />\nMake sure that your diet is simple and eat<br />\nslowly.<br />\nDo not touch cigarettes or champagne.<br />\nDon't expect to be a champion the first<br />\nyear.<br />\nIf you are a schoolboy don't train hard before You are eighteen or nineteen years old.<br /><br />\nTHE NEWS-LETTER.<br /><br />\nDon't get discouraged and quit because<br />\nsome other man seems to be making more<br />\nprogress than you.<br />\nRemember that a clean life, a simple diet<br />\nand determination will accomplish wonders.<br /><br />\n9<br /><br />\nSUMMARY OF PRINCIPAL EVENTS.<br /><br />\n100-Yard Dash (handicap) — Won by<br />\nDewey, C. H. S., (4 yards); second, Martin,<br />\nG. U.,(3 yards); third, Haydock, Philadelphia Y. M. C. A. Time, 10 1-5 seconds.<br />\nBREAKFAST.<br />\n100-Yard Dash (interscholastic handicap)<br />\nounces<br />\nby Patterson, B. C. C., (3% yards);<br />\nWon<br />\neight<br />\nor<br />\ntwo)<br />\n(sometimes<br />\nOne chop<br />\nDewey, C. H. S., (3 yards); third,<br />\nsecond,<br />\nof beef.<br />\nPendleton, E. H. S. Time, 10 1-5 seconds.<br />\nTwo soft boiled eggs.<br />\n100-Yard Hurdles (handicap)—Won by<br />\nOne baked potato.<br />\nMartin, U. of Va., (scratch); second, RanToast and bread.<br />\ndolph, U. of Va., (scratch); third, Smith, G.<br />\nMilk or mild tea.<br />\nPrunes or apple sause (no cream or sugar U., (2 yards). Time, 12 1-5 seconds.<br />\n220-Yard Dash (handicap)—Won. by Sampadded).<br />\nson, W. Y. M. C. A.; second, Senft, C. Y.<br />\nDINNER.<br />\nLight soup.<br />\nM. C. A.; third, Bond, J. H. U. Time,<br />\nRoast beef, lamb, mutton or fowl.<br />\n25 1-5 seconds.<br />\nBoiled or mashed potatoes.<br />\n440-Yard Dash (handicap)—Won by Bond,<br />\nVegetables and fruits in season.<br />\nJ. H. U., (15 yards); second, Adams, M. A.<br />\nBoiled rice and milk or corn meal mush.<br />\nC., (8 yards); third, Holliday, U. of Va.,<br />\nA light pudding.<br />\n(scratch). Time, 55 seconds.<br />\nMilk or tea.<br />\n440-Yard Dash (interscholastic handicap)<br />\nToast and bread.<br />\nWon by Lancaster, C. H. S., (7 yards);<br />\nsecond, Le Cato, B. C. C.,(2 yards penalty);<br />\nSUPPER.<br />\nCold meat (roast beef, lamb, mutton or third, Stalfort, B. C. C., (2 yards penalty).<br />\nTime, 55 1-5 seconds.<br />\nfowl) or one small steak.<br />\nHalf Mile Run (scratch)—Won by Herring.<br />\nOne potato.<br />\nW. C.; second, Wenderoth, G. W. U.;<br />\nMt.<br />\nToast or fresh graham bread.<br />\nthird,<br />\nMakel, J. H. U. Time, 2 minutes,<br />\nPrunes, apple sauce or baked apple.<br />\n6 3-5 seconds.<br />\nMilk and mild tea.<br />\nMile Run (handicap)—Won by Bau11, U.<br />\nof Pa., (20 yards behind scratch); second,<br />\nECHOES OF THE HOPKINS MEET.<br />\nZehr, C. H. S., (30 yards); third, Hildebrand, (scratch).<br />\nTime, 4 minutes, 42<br />\nOn your marks! Get set! Bang!<br />\nseconds.<br />\nUsher—\"Would you men please move back<br />\nRunning High Jump—Won by Ward, C.<br />\nlittle!\"<br />\na<br />\nY.<br />\nM. C. A.,(4 inches); second, Lane, U. of<br />\n``Cop\"— ``Git back there!\"<br />\nPa., (3 inches); third, Martin, U. of Va.,<br />\nVirginia Man—\"Do you know where I (scratch). Height, 5 feet, 8 inches.<br />\nfind any Hopkins money?\"<br />\nShot Put (handicap)—Won by Michael, J.<br />\nHopkins Man—``No.\"<br />\nH. U., (2 feet); second, O'Connor, G. U.,<br />\n(2 feet, 6 inches); third, Cummings, B. A.<br />\nShot Put—\"Good work 'Babe.'\"<br />\nC., (scratch). Distance, 36 feet, 5 inches.<br />\nColumbia Race—\"Those fellows are wonders. They came in second at Madison<br />\nSquare Garden.\"<br />\nIJ Hopkins men have long been pleased with the<br />\n440 yd. Dash—\"Good work, Billy. That's<br />\nexcellence of the furnishings to be found in the<br />\ngreat.\"<br />\nMen's Store at ::<br />\nVirginia Relay—\"Oh H—! That fellow<br />\nfouled Fulton.\"<br />\nOutside the Armory—\"Let's go round to<br />\n210-218 NORTH HOWARD ST.<br />\nGordon's.\"<br /><br />\nHUTZLEK 131?OTHEit<br /><br />\n10<br /><br />\nTHE NEWS-LETTER.<br /><br />\nPole Vault (handicap)—Won by Sterrett,<br />\nG. W. U.; second, Ward, C. Y. M. C. A.;<br />\nthird, Blakely, U. of Pa. Height, 11 feet.<br />\nMile Relay—City College (Gorman, Connelly. Le Cato, Rogers) defeated Episcopal<br />\nHigh School. Time, 3 minutes, 47 seconds.<br />\nMile Relay—Western Maryland (Bird,<br />\nStultz, Turner, Marcus) defeated Delaware<br />\nCollege. Time, 3 minutes, 43 seconds.<br />\n4 Mile Relay—Columbia (Verplanch, Saunders, Kennedy, Link) defeated Johns Hopkins University (Wolfe, Reeside, Breyer,<br />\nGriffith). Time, 18 minutes, 57 3-5 seconds.<br />\nMile Relay—Johns Hopkins University<br />\n(Bridgman, Hunter, Fulton, Stollenwerck)<br />\nand University of Virginia (Thurlow, Stanton, Wiltshire, Goodwin). Undecided. Will<br />\nprobably be run over at Fifth Regiment<br />\nGames, March 13th.<br /><br />\nTRACK SCHEDULE.<br />\nThe track schedule for 1909, which has<br />\nrecently been completed by Manager Warren<br />\nStewart, is undoubtedly the best that the<br />\nuniversity team has ever had. The schedule<br />\nfollows:<br />\nFebruary 13th—George Washington Meet,<br />\nat Washington (2 Mile Relay entries in main<br />\nevents). Columbia University Meet, New<br />\nYork (1 Mile Relay).<br />\nFebruary 20th—Federal Gaines, at Washington.<br />\nFebruary 22nd—Cross Country Championships, at Washington.<br />\nFebruary 27th—Richmond College Meet, at<br />\nRichmond.<br />\nMarch 6th—Georgetown Meet, at Washingington.<br />\nMarch 13th—Fifth Regiment Meet, at Baltimore (Relay with Virginia probable),<br />\nApril 14th—University of Pennsylvania<br />\nRelay Carnival.<br />\nMay 1st—Dual Meet with Navy, at Annapolis.<br />\nMay 8th—Dual Meet with Virginia, at<br />\nHomewood.<br />\nMay 15th-1)ual Meet with Swarthmore, at<br />\nHomewood, pending.<br />\nMay 22nd—Dual Meet with Columbia, at<br />\nHomewood, pending.<br /><br />\nTHE DANCE.<br />\nterram quatiunt ede! The second<br />\nof the series of dances given under the auspices of the Cotillion Club was held in McCoy<br />\nHall on February 8th. The hall was beautifully decorated with banners and class flags;<br />\nthe musicians sat behind a bank of green<br />\npalms. But—these are only minor details.<br />\nBaltimore has a world-wide reputation for<br />\nbeautiful girls and any one present at the<br />\ndance will certainly vouch for it. Even Dr.<br />\nMustard.<br />\nThe Dance Committee certainly deserves<br />\ngreat credit for the successful way in which<br />\nthe dances are carried off. The former ones<br />\nwere very successful, but this one eclipsed<br />\nthem all.<br /><br />\nTHE SENIOR BANQUET.<br />\nThe senior banquet took place on Friday,<br />\nFebruary the 5th, at the New Howard Hotel.<br />\nTradition, we believe, asserts that senior banquets are solemn and dignified affairs. As it<br />\nis not polite to contradict tradition, we will<br />\nnot attempt to draw a vivid picture of 'bread<br />\ncrumbs bursting in air\" and a general atmosphere of good humor, but rather accept the<br />\ntraditional picture of mournful and silent<br />\nyoung men gathered round a frugal meal.<br />\nThe occasion was relieved by the presence of<br />\nseveral freshmen, who, however, happened in<br />\nintentional&amp; and afforded no amusement from<br />\nthe point of view of captives. Mr. Guerard,<br />\nas toastmaster, was ideal. Several men made<br />\nspeeches, mostly on traditional topics, such as<br />\n``The Class,\" -The University\" and -Athletics.\" Several other speeches were made,<br />\nthe titles of which are for certain reasons reserved. During the banquet the awarding of<br />\nvarious honors was made. Among these were:<br />\n(1) Most popular man, Mr. Lowndes and Mr.<br />\nBaily (tie). (2) The biggest grind, Mr.<br />\nFisher (unanimous). (3) The Candy Kid,<br />\nMr. Onion.<br />\nDetermination was expressed to support the<br />\nUniversity in every possible way after graduation, and it was voted to hold reunions as<br />\nfrequently as possible. The banquet broke<br />\nup somewhat earlier than is usual, perhaps,<br />\nfor senior banquets, but it was an occasion<br />\nthat will long be remembered by all those who<br />\nwere present.<br /><br />\nTHE NEWS-LETTER.<br /><br />\n••;\"<br /><br />\nOne college man after<br />\nanother has learned that<br /><br />\nare just the kind he likes, and<br />\nhas told his friends about them.<br />\nThus their popularity grew until today \"Fatimas\" are very<br />\npopular among college men<br />\neverywhere.<br /><br />\n11<br /><br />\n12<br /><br />\nTHE NEWS-LETTER.<br /><br />\nST. JOHN'S FOOTBALL DATES.<br />\nThe football team of St. John's College,<br />\nAnnapolis, will play 11 games next fall, according to the schedule that has been arranged<br />\nby Manager T. Reed Mudd. The schedule is<br />\nnow complete with the exception of one date,<br />\nNovember 16, for which negotiations are still<br />\npending.<br />\nThe prospects for a strong team are considered bright, as only two of the members of<br />\nlast season's fast eleven will be lost by graduation. The schedule follows:<br />\nOctober 2—Rock Hill College at Annapolis.<br />\nOctober 6—Navy, at Naval Academy.<br />\nOctober 9—University of Virginia, at Char-<br /><br />\nSCIENTIFIC ASSOCIATION.<br />\nThe Scientific Association met in Hopkins<br />\nHall on Wednesday, February 4th, Professor<br />\nHalstead, of the Medical School, was the<br />\nfirst speaker. His paper was on the effects of<br />\nexcision and transplantation of the parathyroid glands; with a resume of the work<br />\ndone on this subject at the universities of<br />\nUpsala and Vienna and at Johns Hopkins.<br />\nDr. J. A. Anderson, instructor in astronomy,<br />\nspoke on the aurora borealis and the recent<br />\ntheories in regard to the nature of this<br />\nphenomenon.<br /><br />\nlottesville.<br />\nOctober 16—Pending.<br />\nOctober 23—Franklin and Marshall College,<br />\nat Lancaster, Pa.<br />\nOctober 27—University of Maryland at An-<br /><br />\n-ecti,e6<br />\nTOWN&amp;COUNTRY<br /><br />\nnapolis.<br />\nOctober 30—Virginia Military Institute, at<br />\nLexington.<br />\nNovember 6—Washington College at Chestertown.<br />\nNovember 13—Maryland Agricultural College, at College Park.<br />\nNovember 20—Johns Hopkins University,<br />\nat Baltimore.<br />\nNovember 25 (Thanksgiviqg Day)—Pennsylvania Military Academy, at Chester, Pa.<br /><br />\nUNIVERSITY NOTES.<br />\nSamuel C. Chew, 1909, is now convalescing<br />\nafter an operation for appendicitis.<br /><br />\nSHIRTS<br />\nmeet every requirement<br />\nas well as the highest ex$1.50 up.<br />\npectations.<br />\nCLUETT,PEABODY<br /><br />\nV<br />\nC<br />\nSTATI0 HERS<br />\n311 N.CHAR LES ST<br />\n'//t/1/40ftf<br /><br />\nvesxwiN<br />\n4f1 r<br /><br />\nCO., Makers<br /><br />\nSocial Etiquette with College<br />\nMen is an essential, therefore your<br />\nVisiting Cards and Stamped Stationery as well as your Gifts<br />\nshould be correct. LYCETT, the<br />\nSociety Stationer, is at 317 N.<br />\nCharles Street, and can give y ou<br />\nall of these at reasonable prices.<br /><br />\nMy! How the ushers at the Hopkins Meet<br />\nwere touched for their badges!<br />\nCheers for Billy Bond! coepil, cucurrit,<br />\nvincit!<br />\nBrent H. Farber, of the class of 1911, has<br />\nleft the university. After a short course at<br />\na business college, he intends to go to<br />\nBrent will be greatly<br />\nMemphis, Tenn.<br />\nmissed.<br /><br />\nBonbons<br /><br />\nChocolates<br /><br />\n18 and 20 E. Baltimore St., Baltimore, Md.<br /><br />\nLEFRANC &amp; AULT<br />\nSell a GUARANTEED GOAT SKIN GLOVE<br /><br />\nat $1.00 and $1.50 Per Pair<br />\nFreddy Lee, 1912, broke his collar bone at<br />\na most inoportune time. He was greatly<br />\nhandicapped at the dance on the 8th.<br /><br />\nAT THE<br /><br />\nSHIRT SHOP, 421 North Howard Street<br />\n2 DOORS BELOW FRANKLIN<br /><br />\nA.<br /><br />\nSecond-HandSchool and College Text Books<br />\nBOUGHT and SOLD AT<br /><br />\nSIETWS BOOK STORE, 834),(15<br /><br />\noent<br />\nda<br />\nSdtirse<br />\norti<br />\n,<br />\no<br />\nbw<br />\novaersi<br />\ndN<br />\no.<br /><br />\nS'TUDEN'T'S STATIONERY<br /><br />\nChas. E. Smith &amp; Co.<br />\n..florists...<br />\nBaltimore<br /><br />\n121 N. Liberty Street,<br /><br />\nLO<br /><br />\nWM. J. MILLER<br />\nFINE JEWELRY, DIAMONDS AND WATCHES<br />\n28 East Baltimore Street<br />\nManufacturer of College Seals and Pins, College Shields<br />\nin Bronze for Wall Decoration<br /><br />\nCD'ai4CD -ECRIaitvama<br /><br />\nccpEa,,APIM\".<br /><br />\nEngravinsfor the Printet,lerchant &amp;Manufacturer<br />\ntiI, Cttr•'toward and<br /><br />\nFtis,(Ate Streets<br /><br />\nEnAurutilleks,DID.<br />\nTill /16/14111,6S IN //1/5 BOON 4/1./- AM/M /ff 1/.5<br /><br />\n\\/f P051<br />\n(<br />\n4/11,1 CUTS AIIIDE FROM YOUR PliOTOGIMPI15\\7<br />\n. •<br /><br />\nENGRAVING<br /><br />\nPRINTING<br /><br />\nNUNN &amp; COMPANY<br /><br />\nBOOKSELLERS and STATIONERS<br /><br />\nTHE BEST<br /><br />\nGE ANNUAL CUTS ME HAM MITT<br /><br />\n01 L<br /><br />\nCarry a complete line of School Books and College<br />\nText Books, Miscellaneous Books, Fine Stationery,<br />\nand Students' Supplies of Every Description, together with a large assortment of<br /><br />\nWATERMAN'S IDEAL FOUNTAIN PENS<br />\n535 North Howard Street<br />\nSTATIONERY<br /><br />\nBINDING<br /><br />\nFOSNOT and WILLIAMS CO.<br />\nPRINTERS<br /><br />\nWatermctn's<br />\nIdeaI t•<br /><br />\nFountain<br />\nPen<br />\n—•<br /><br />\niJ<br /><br />\n5 1 4- 1 6 WEST FRANKLIN STREET<br />\nThe News-Lotter, a product of our plant<br /><br />\nSTUDIO<br />\nILGENFRITZ<br />\nSuccessor to<br />\nCumm INS<br /><br />\nARTISTIC PHOTOGRAPHY<br />\nBALT1MOR<br />\n319 North Charles Street<br />\nSpecial Discount to Students<br /><br />\n\"llESSONIAN<br /><br />\n19 A Smart Shoe for college men<br />\nwith a touch of newness that<br />\nyou'll like.<br /><br />\n/<br /><br />\nEndorsed bg,' \"'\"'\"<br />\nthe Millions<br /><br />\nNow using them the world over<br /><br />\nTO BE: OBTAINED ONLY AT<br /><br />\nN. HESS' SONS,8 East Baltimore Stree<br />\nBOOKS! SECOND-HAND!<br />\nSchool, Medical and Miscellaneous, Bought, Sold and Exchanged<br /><br />\nFOR SALE<br />\nEVERYWHERE<br /><br />\nPIPPEN'S BOOK STORE<br />\nNear the University<br /><br />\n605 NORTH EUTAW -ST.,<br /><br />\nDALT1/10RE'SILARGEST OLD BOOK STORE<br /><br />\nNEW YORK CLOTHING HOUSE<br />\nSMART .A.T9rIR.E<br />\nSISC() -1-31E1C0S.<br />\nFLAGS<br /><br />\n„A<br /><br />\nBANNERS<br /><br />\n13 WEST LEXINGTON STREET,<br /><br />\n•<br /><br />\n%A<br />\n•<br /><br />\nBADGES<br />\nBALTIMORE, MD<br /><br />\nReady-to-Wear<br /><br />\nand Made to Order<br /><br />\nSole Agents for the Everwear Hose—guaranteed 6 months<br />\n102-104 BALTIMORE STREET, EAST<br />\nOPPOSITE<br /><br />\nLIGHT<br /><br />\nWhen making your purchases, kindly remember our advertisers<br /><br />\nSTREET<br /><br />\nHOPKINS--LEMMERT<br />\nBOTH STAND ON A HIGH PLANE<br />\nSTUDENTS WEARING LEMMERT<br />\nCLOTHES SET THE PACE OF<br />\nWELL-DRESSED MEN<br />\n::<br />\nOUR PRICES ARE REASONABLE<br />\nENOUGH TO PLEASE YOU ::<br /><br />\nGLOVES<br />\nAsk for the best and 'see<br /><br />\nLEMMERT<br /><br />\nhow<br /><br />\n10 E. FAYETTE STREET<br />\nA.<br /><br />\nquick they'll bring<br /><br />\nyou<br /><br />\nFOWNES<br /><br />\n“. vu'rrriN(4Manufactuier of<br /><br />\nGreek Letter Fraternity Jewelery<br />\n213 NORTH LIBERTY STREET<br />\nPlease‘call and examine our line before purchasing<br /><br />\n\"COLLAR HUG\" CLOTHES<br /><br />\nThe Quality Shop<br />\n116 E. BALTIMORE STREET<br /><br />\nBALTIMORE<br /><br />\nTake your college colors to the athletic<br />\nMOW ENTHUSIASM. games<br />\nand help your team to victory.<br /><br />\nHOTEL CUMBERLAND<br /><br />\nOur Special 25c. Pennant Can't Be Beaten<br />\nBetter ones for more money<br /><br />\nN<br /><br />\nW -V0rt,K<br /><br />\nHoward Novelty Company<br /><br />\nS. W. Corner BROADWAY AND 54th STREET<br /><br />\n323 N. Howard Street<br /><br />\nNear 50th Street Subway Station and 53rd Street Elevated<br /><br />\nCONFECTIONER AND CATERER<br /><br />\nKept by a<br />\nCollege Man<br /><br />\nIdeal Location<br />\nNear Theatres<br />\nShops and ,<br />\nCentral Park<br /><br />\n701 West North Avenue<br />\nHORLICK'S MALTED MILK<br />\nORIGINAL AND ONLY GENUINE<br /><br />\nPure, rich milk, with the extract of malted grains, reduced<br />\no powder form. A delicious, nourishing food-drink is made<br />\nn a moment by merely stirring in water. Invigorating,<br />\nipbuilding, and sustaining for the student, lecturer, athlete,<br />\n.raveler, for all ages. In powder form, also in Lunch<br />\n['giblet form with chocolate. Samples free. Always ask for<br />\n`Horlick's.\"<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br />\n.<br /><br />\nHeadquarters<br />\nfor Cdllege<br />\nMen<br /><br />\nNew, Modern<br />\nand<br />\nAbsolutely<br />\nFireproof<br />\nMost Attractive Hotel in<br />\nNew York<br /><br />\nSpecial Terms<br />\nfor College<br />\nTeams<br /><br />\nAll Outside<br />\nRooms<br /><br />\nHORLICK'S MALTED •MILK COMPANY<br />\nRacine, Wisconsin<br /><br />\nPURNELL ART CO.<br /><br />\n10 Minutes Walk to 20 Theatres<br /><br />\n224 NORTH' HOWARD STREET<br /><br />\nTRANSIENT RATES (with BATH), $2.50 and up<br /><br />\nIMPORTERS AND DEALERS<br /><br />\nSEND FOR<br /><br />\nFINE ARTS<br />\nPictures Framed Correctly and Promptly at Moderate Prices<br /><br />\nBOOKLET<br /><br />\nHARRY P. STIM SON<br /><br />\nR. J. BINGHAM<br /><br />\nFormerly with Hotel Imperial<br /><br />\nFormerly with Hotel Woodward<br /><br />"}], "field_media_file": [{"target_id": 36415, "display": null, "description": null, "target_type": "file", "target_uuid": "06b45c6a-d9cb-427e-b216-4dacdd405f49", "url": "http://digital.library.jhu.edu/system/files/2022-03/12378-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 12378, "target_type": "node", "target_uuid": "8549c01e-eaba-47b5-acac-ee05442953f2", "url": "/node/12378"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "05d64800-cd49-445b-908c-87a0430a5cff"}]}