{"mid": [{"value": 39230}], "uuid": [{"value": "ecff4ac0-c30d-47de-aa58-4581e0ccfeb2"}], "vid": [{"value": 39230}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T19:25:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13875-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T19:25:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T19:25:12+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "INT<br />\nsip<br />\n***<br />\nt11113<br />\nVOL. LXIX, NO. 27<br />\n<br />\nitirttrr<br />\n<br />\nJOHNS HOPKINS UNIVERSITY, APRIL 30, 1965<br />\n<br />\n4taii-E2<br />\n<br />\n69TH YEAS<br />\n<br />\nStudents To Publish Balt°. Daily<br />\nHefner To Bare Facts In Shriver Talk<br />\nScheduled Spring Parley C.O.D.E.Opposes Morning Herald To Appear<br />\nTo Climax Hop Excitement Heiner's Visit; For Duration Of Strike<br />\nPlans To Picket<br />\n<br />\nHugh Hefner, the controversial editor-publisher of Playboy<br />\nmagazine, will participate in a<br />\nYMCA-sponsored panel discussion of \"The Playboy Philosophy<br />\nin America\" May 2 at, 8:30 p.m.<br />\nin Shrivel. Hall. Other members<br />\nof the panel will be Dr. Mary<br />\nCalderone and Dr. William Hamilton, who, along with Hefner,<br />\nwill discuss modern American<br />\nmorals.<br />\nWith the advent of the Playboy Philosophy in December, 1963<br />\nHefner has conducted a concerted attack against what he feels<br />\nis the anachronistic moral codes<br />\nby which Americans live today.<br />\nHis remarks have made him a<br />\nprominent figure in American<br />\nsociety, and they have become<br />\nthe object of more press and academic comment than any editorial feature in the Playboy magazine's history.<br />\n<br />\nHUGH HEFNER<br />\nSeminary in 1949, and his Ph.D.<br />\nfrom the University of St. Andrews in Scotland in 1952.<br />\n<br />\nThree Johns Hopkins students<br />\nhave announced the official incorporation of the New Baltimore<br />\nMorning Herald, established to<br />\nserve the Baltimore area for the<br />\nThe anticipated arrival of duration of the current newsHugh Hefner has stirred up some paper strike.<br />\nmembers of the Hopkins campus,<br />\nCaleb Deschanel. James Freedwho have formed the Commit- man and Charles Hollander,<br />\nown a<br />\ne of Decent Exposures (CODE). Hopkins undergraduates,<br />\nmajority of the new corporation<br />\nThe organization, which was<br />\nin partnership with Harvard\"spontaneously\" created when educated Baltimore lawyer Morbecame ton L. Goldner. Key positions on<br />\nvisit first<br />\nHefner's<br />\nknown, will hold a rally and the staff of Morning Herald will<br />\nprodemonstration Sunday evening be held by out-of-work<br />\nfessional newspapermen largely<br />\nQuadat 7.15 in the Wyman<br />\nfrom the non-union Baltimore<br />\nrangel. Hefner is scheduled to News American.<br />\narrive at 8 P.M.<br />\nHeading other staff positions<br />\nThe purpose of the organi- will be John Brickman, sports,<br />\nzation is \"to demonstrate that Henry Korn, features, Reuben<br />\nthe true reactions of the Ameri- Aaronson, Gary Davis, news and<br />\ncan college campus. We will show Stan Katz, financial news. HeadMr. Hefner that students are not ing the advertising staff will be<br />\n100% behind him,\" stated Kostia Charles Hollander advised by<br />\nBergman, one of the group's The Al Dreyer Ad Agency and<br />\nleaders.<br />\nassisted by Bill Patten. Charles<br />\nCODE will hold an organiza- Bon Tempo. and Kirk Gardner.<br />\ntional meeting Sunday at 5.00 to The staff plans an eight page<br />\npaper today. twelve by Sunday<br />\nplan for the demonstration.<br />\n<br />\nDr. Hamilton worked extensively with CBS and the National<br />\nCouncil of Churches to produce<br />\nreligious television programs on<br />\nsuch shows as \"Calendar\" and<br />\nDr. Calderone is the current \"Look up and Live.\" He frequentExecutive Director of the Sex Inly lectures on television, and in<br />\nformation and Education Council<br />\n(Continued on Page 6)<br />\n(SIECUS),<br />\nStates<br />\nof the United<br />\nwhose stated purpose is 'to establish man's sexuality as a healthy<br />\nentity.\" She is a graduate of Vassar College, and in 1956 became<br />\nMedical Director of the Planned<br />\nReid<br />\nIn a recent meeting of the Phi Swansor, incumbent President, Medicine were: Henry<br />\nParenthood Federation of AmerBryant<br />\nWilliam<br />\nshe<br />\nJr.,<br />\nof<br />\nwhich<br />\nChapter<br />\nBourne,<br />\nAlpha<br />\nin<br />\nKappa<br />\nica, a capacity<br />\nBeta<br />\nwill preside at the banquet.<br />\nserved until she assumed her Maryland, fifty-one members of<br />\nCharles Harold Taylor, Jr.,<br />\nOther business decided upon Cutts,<br />\npresent position. A quaker, Dr. the Hopkins community were seSharpe Thompson, and<br />\nRobert<br />\nCalderone has received much at- lected for membership in this in the annual business meeting Wilmer Leigh Thompson, Jr.,<br />\nand<br />\nthe<br />\nof<br />\nlecturer<br />\ntention as both a<br />\nacademic honorary society. In- included a continuation<br />\nPh. D. candidates who were 'eeditor of several books dealing cluded among the new members series of Freshman Seminars,<br />\nwith sex, among them Abortion were thirty-five under-graduates, which were inaugurated this fall, lected for membership included<br />\nin the United States, and The five medical school students, eight and a sponsoring of a visit next Franklin Borchardt, Edgar Afton<br />\nGeagan,<br />\nManual of Contraceptive Prac- Ph. D. candidates, and three hon- fall by one of the Phi Beta Dryden, Daniel Joseph<br />\nJames B. League, Jr., Evangelos<br />\nKappa \"visiting scholars.\"<br />\ntice.<br />\norary members.<br />\nNik Moudrianakis, Ralph Tansker<br />\nThe annual initiation and a<br />\nElected officers for 1965-66 Shuey, Kirby Don Smith, and<br />\nDr. WilLiam Hamilton, the<br />\nthird authority on the panel, is reception for the new members were: President, Leon Fisenberg; Robert E. Wyatt.<br />\na member of the faculty of the will be held in the Staff Lounge Vice-President, Charles S. SingHonorary members selected<br />\nDivinity and afterwards a banquet in the leton; Secretary, Richard A.<br />\nRochester<br />\nColgate<br />\nSchool, and a part-time Profes- Garret Room of the New Library Macksey; Treasurer, William were Michael Beer, Ellicott Coleman, and Richard Hamilton<br />\nsor of Religion at the University on May 11. The speaker of the Coleman.<br />\nGreen.<br />\nof Rochester. He received B.A. evening will be Professor Loren<br />\nThe new members of Phi Beta<br />\nfrom Oberlin College in 1943, his Eiseley of the University of Kappa from the Homewood camB.D. from the Union Theological Pennsylvania. Professor Carl P. pus are: Herbert Better, Edward<br />\nRoy Block, Douglas Mac Arthur<br />\nCarey, Jonah Reuben Churgin,<br />\nMichael Comenetz, Christopher<br />\nDu Flon Creed, Tomas Edward<br />\nDavis, Martin W. Denker, David<br />\nLee Epstein, Andrew Lewis PeenShelley Earp was installed as<br />\nberg, Robert Marks Feibel, Luin the new President of the Student<br />\nPerry Fitch, Jr. James Wilford Council and Dick Bensinger was<br />\nDr. Milton S. Eisenhower will purpose of conferring the degree Forster, Barry Michael Fox, How- cited as \"Flame of the Year\" by<br />\n\"a<br />\ndistinguished<br />\nhonor<br />\nto<br />\nconfer an honorary LL.D. degree Is<br />\nard Lee Friedenberg, Claude Ted- outgoing members in the Counmember of the European com- dy-Hugo Friedmann, Neal Louis cil meeting last Monday night.<br />\non Dr. Walter Hallstein, Presimunity.\"<br />\nBensinger. the DSRC represenHorn, Judith B. Kaufman, Allan<br />\ndent of the European Economic<br />\nHallstein<br />\ntative on this year's Council reHarvin<br />\nDavid<br />\nArchie<br />\nJensen,<br />\nCommunity, on Saturday, May<br />\nDr. Hallstein was born in Mahan, Dale Mitchell Meyers, mained almost speechless during<br />\n15. The presentation will take Mainz, Germany, in 1901. He Lee Mark Middleman. Stephan the announcement by fellow repplace in Bologna, Italy, at a served as Assistant of Faculty of Larry Mintz, Charles Edward resentatives that he would receremony celebrating the tenth Law, University of Berlin, in Morrison, Walter Scott Murch, ceive a special scroll to comBranch of the Hopkins School 1925 and later as Professor of Francis D. Pien, George Henry memorate his \"Flame.\" An inInternational<br />\nAdvanced<br />\nfor<br />\nLaw at the University of Ros- Sack, Jr., Theodore Jerome formal source noted that all<br />\nStudies. This will be the first tock. During the war he was an<br />\nhad<br />\nSchneyer, Morris Jacob Schoene- prominent representatives<br />\ntime an American university has officer in the German Army. He<br />\nsigned the laudatory document<br />\nman,<br />\nSilberman<br />\nRonald<br />\nLoeb<br />\npresented such a degree abroad. became an American prisoner of<br />\nOutgoing President John GlasDenis Howard Tyras, Samuel<br />\nDr. Eisenhower will leave for war in 1944, and he founded a Woodward Warburton, Jr., James cock thanked the Council for a<br />\nItaly on May 11. Accompaning university for German prisoners English Williams, Jr., Melville highly successful year. Most<br />\nmembers were thanked personhim will be Dr. Francis A. Wil- in Como, Missouri.<br />\nPaul Ulmer, and Robert Lewis<br />\nally in the course of his brief<br />\ncox, Dean of SAIS. Ross Jones,<br />\nAfter the war. Dr. Hallstein Yates.<br />\nspeech. Then, as he rose to hand<br />\nDirector of Public Information<br />\nElected from the School of the gavel to Shelley Earl:). the<br />\n(Continued on Page 3).<br />\nfor the University, stated the<br />\n<br />\nPhi Beta Kappa Selects Fifty-One<br />\n<br />\nEisenhower To Award Honorary<br />\nDegree To Hallstein In Bologna<br />\n<br />\nand sixteen by next week. la<br />\ntime, the Morning Herald plans<br />\na tabloid of thirty-two pages<br />\nprinted every day of the week.<br />\n<br />\nPublic Service<br />\nThe New Baltimore Morning<br />\nHerald will function primarily<br />\nas a public service including<br />\nmajor emphasis on local news,<br />\nsports, legal notices, entertainment, finance, real estate, obituaries and society news. In publishing the Herald, the corporation does not break union rules<br />\nand follows a successful precedent set in Detroit. Cleveland<br />\nand New York. There is no truth<br />\nto the rumor that the Baltimore<br />\nSun has subsidised The Herald to<br />\nprolong the strike, a story that<br />\nhas circulated widely on the<br />\nGuild picket lines.<br />\nWhile the staff of the new<br />\npaper will include many members of the Editorial Board oif<br />\nThe Johns Hopkins News-Letter<br />\nit has no official connection with<br />\nthe University. Because finandai<br />\nsupport of the Herald would entail jeopardizing the University's<br />\ntax status as a non-profit organization, the Hopkins Administration has encouraged and offered<br />\nmoral backing to the fledgling<br />\ndaily.<br />\n<br />\nYoung Turks<br />\nThe News-Letter proudly<br />\nannounces a short-term inin<br />\nwhich the<br />\nterregnum<br />\nhitherto junior Dooks have<br />\ncome to the forefront in an<br />\nunpreccedented stop-gap effort. This late spring prominenceship is deafly an extension, the class of 1968's crushing victory on fall class day.<br />\nThe News-Letter ;tends firmly in the outstreached palm<br />\nof the lean and hungry<br />\nyouths who have turned out<br />\nall semblence of age and experience in favor of enthusiasm.<br />\n<br />\nShelly Earp Installed As Pres;<br />\nBensinger Bows Out In Glory<br />\nrepresentatives gave him a<br />\nstanding ovation.<br />\nHighest Turnout Yet<br />\nEarp in his opening remarks<br />\nseconded Glascock's opinion that<br />\nthings are looking up for Hopkins student government. The<br />\n50% turn out in recent elections<br />\nhe noted as the highest since<br />\nhe's been here.<br />\nIFC President Jon Harlow reported the Hank Ballard situation to the Council. He thought<br />\nthat there was a good chance of<br />\ngetting the money back. He described the legal situation as<br />\nbeing rather complicated.<br />\nUse AGVA<br />\nIn conclusion, he stated, that<br />\n\"any future deal like this should<br />\ngo through the musicians union<br />\nand Universal Attractions ia<br />\n(Continued on Pace 21.<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nPAGE TWO<br />\n<br />\nI<br />\n<br />\nCAMPUS NOTES<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 30, 19611<br />\n<br />\nShelly Earp Installed As Pres;<br />\nI Bensinger Bows Out In Glory<br />\n<br />\nBaltimore Life Insurance Com- ! was granted a Ph.D. from Corpany; Eutaw Savings Bank of nell University in 1955. Prior to<br />\nThe Musical Clubs of the Johns Baltimore; Finance Company of his post at Hopkins,<br />\nhe taught<br />\nHopkins University announce America; Title Guarantee Com- physics, history, and the history<br />\ntheir 81st Annual Combined Glee pany; United States Fidelity & of science at Boston University,<br />\nClub Concert to be given tomor- Guaranty Company, as well as Brandeis University, and the<br />\nrow evening at 8:15 in Shriver a director and treasurer of University of Washington. He is<br />\nBall.<br />\nMaryland Hospital Service, Inc. the author of The Transits of<br />\nMr. 'Leigh M. Martinet will<br />\nActive in civic affairs, Mr. Venus: A Study in Eighteenth<br />\nconduct the Symphony Orchestra Harvey is a director of the Century Science and Science as<br />\nin its featured work, Dvorak's Greater Baltimore Committee. a Cultural Force.<br />\nNew World Symphony and other He is a trustee and treasurer of<br />\norchestral selections, while Mr. the Maryland Academy of Sci- Markert Leaving<br />\nJames W. Mitchell will conduct ences, and a trustee of Peabody<br />\nDr. C. L. Markert, professor of<br />\nthe Glee Club in Alec Rowley's Institute, Union Memorial Hos- Biology at Hopkins, will become<br />\nFull Tide and other featured pital and the YMCA.<br />\nChairman of the Department of<br />\nchoral works of contemporary inBiology at Yale July 1. Dr. Marterest.<br />\nkert is completing his eighth<br />\nScientific Dictionary<br />\nThe finale of the program will<br />\nDr. Harry Woolf, Willis K. year on the Hopkins faculty.<br />\nHe regards the Hopkins defeature both groups in Howard Shepard professor of the history<br />\nHanson's Song of Democracy un- of science, will be one of the six partment as \"very good\" and<br />\nder the leadership of Mr. Mar- historians of science who will the facilities as \"excellent\". His<br />\ntinet.<br />\nparticipate in the writing and re- man reason for leaving is \"to<br />\nAll students and faculty are search of the more than 2600 meet the greater challenge of becordially invited; admission is ; essays describing the careers and ing a department chairman.\" At<br />\nwithout charge.<br />\nachievements of scientists of all Yale Dr. Markert will head a<br />\nstaff of fifty people.<br />\nperiods and all nationalities.<br />\nFinance Chairman<br />\nA specialist in developmental<br />\nMade possible by a National<br />\nRobert D. H. Harvey, vice Science Foundation grant of biology with emphasis on biochairman of the board and chief $250,000,000, the proposed work chemistry and genetics, he once<br />\nexecutive officer of Maryland will be called the Dictionary of developed a three-eyed frog<br />\nNational Bank, has been named Scientific Biography, whose pub- through an eye transplant during<br />\nchairman of the finance com- lication is being sponsored by the embryonic stage.<br />\nDr. Markert received his Masmittee for the University Board 1 the American Council of Learned<br />\nter of Science degree from the<br />\nof Trustees, Charles S. Garland,1 Societies.<br />\nChairman of the Board, anTo be published In four or five University of California at Las<br />\nnounced.<br />\nvolumes, the Dictionary is in- Angeles in 1942 after graduatMr. Harvey succeeds S. Page tended to meet the needs of ing summa cum laude from the<br />\nNelson who had been chairman natural scientists, social scien- University of Colorado. He was<br />\nof the finance committee since tists, historians, philosophers, awarded his Ph.D. from Hopkins<br />\n1958. Mr. Nelson is Chairman writers and students at all levels in 1948.<br />\nAfter serving as a junior inof the Board of the Savings from high school through colstructor here for four years, he<br />\nBank of Baltimore.<br />\nlege and graduate school.<br />\nA native Baltimorean, Mr.<br />\nAccording to Dr. Charles C. became an assistant professor at<br />\nHarvey was a summa cum laude Gillespie, professor of the history the University of Michigan in<br />\nand Phi Beta Kappa graduate of of science at Princeton Univer- 1950. He was elevated to the<br />\nPrinceton University in 1942. He sity, and Editor-in-Chief of the position of Associate in 1956 and<br />\nreceived a B.S. degree from Dictionary, \"the availability of a came to Hopkins as a full proJohns Hopkins University in standard and authoritative work fessor in 1958.<br />\nDr. Markert is a member of<br />\n1953 and in 1957 he was grad- of reference will substitute an<br />\nuated from the Stonier Graduate accurate history of science for the American Association for the<br />\nSchool of Banking at Rutgers a widespread tissue of misrepre- Advancement of Science, the<br />\nUniversity.<br />\nsentations and an even wider ig- American Society of Zoologists,<br />\nMr. Harvey is also a member norance of this fascinating and the Genetics Society, the Tissue<br />\nof the Executive Committee of essential theme in the history of Culture Society, and the Michigan Academy of Sciences.<br />\nthe Board of Trustee of the University.<br />\nDr. Woolf received his bacheMr. Harvey is a director of a lor's and master's degrees from<br />\nOrientation Picture<br />\nnumber of companies, including the University of Chicago and<br />\nA picture of last fall's Orientation committee will be<br />\ntaken on the steps between<br />\nAmes and<br />\nRowland<br />\n4:00<br />\nWednesday, May 5. All leaders and committeemen, please<br />\nbe prompt.<br />\n<br />\nMusic, Glee Combined<br />\n<br />\nENGINEERS<br />\n<br />\n(Continued from Page 1)<br />\npositions, to be voted on next<br />\nNew York and cleared with week. Jeff Griffith, junior repAGVA (American Guild of Vari- resentative, was nominated So.<br />\nety Artists).\"<br />\ncial Committee Chairman, Bob<br />\nSmith DSRC Prexy<br />\nBittick, Junior, Course Guide<br />\nDSRC<br />\nelections<br />\nwere<br />\nan- project, and Sandy Cohn, sophonounced by Bensinger. Doyle<br />\nGentleman's Code ComSmith was elected President and more,<br />\nwill replace Bensinger on the mittee<br />\nCouncil. There was a run-off<br />\nFreshman Bill Reinsch, and<br />\nelection between John Sopka and Junior John Brickma.n were also<br />\nJohn Shull for Vice-President appointed to the Code Committhis week. Secretary is Walt tee. Its first case will concern a<br />\nSienkiewicz and Treasurer is Bob student who attempted to break<br />\nCrispin.<br />\ninto the Physics building with<br />\nShelley Earp made recommen- the expressed intention of stealdations for several committee ing property.<br />\n•.1.11.<br />\n<br />\n.<br />\n<br />\nEdgevale Flowers, Inc.<br />\nDistinctive Flower arrangements for all occasions—<br />\nArtware<br />\nUnusual Corsages and Flowers by wire.<br />\n<br />\nThe Marylander<br />\n3430 N. Calvert St.<br />\n<br />\nTelephone:<br />\n<br />\nCH 3-0478<br />\nBE 5-7829—Ext, 16<br />\n<br />\nBaltimore 18, Md,<br />\n<br />\nN....0.N ••• ••••••••••••••••••••••.........................• •• ••.• 0..0<br />\n<br />\nBECKERS<br />\n31st and GREENMOUNT AVE.<br />\n<br />\nBE. 5-1896<br />\n<br />\nULTIMATE IN DISTINCTION AND QUALITY IN THE<br />\n\"BECKER FAMILY OF FINE APPAREL FOR YOUNG MEN.\"<br />\nOFFICIAL HOPKINS BLAZER<br />\nON DISPLAY AT OUR STUDENT SHOP IN LEVERING HALL<br />\n<br />\nWe rent formal attire<br />\n<br />\nHopkins students, new and old, try:<br />\n<br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n3320 Greenmount Ave.<br />\nCARRY OUT SERVICE<br />\n<br />\nSPAGHETTI MEALS<br />\n<br />\nCALL 889-3831<br />\n<br />\nPIZZA PIE A SPECIALTY<br />\n<br />\nand<br />\n<br />\nSCIENTISTS<br />\nCombine your background with the<br />\nComputer Sciences to become a problem solver and advisor to users of IBM<br />\nComputer Systems. Openings now exist<br />\nin Baltimore for people to work in areas<br />\nsuch as:<br />\n<br />\n• real time control of industrial<br />\nprocesses<br />\n• communications-based<br />\ninformation systems<br />\n• time shared computer systems<br />\n• praphic data processing<br />\n• management operating<br />\nsystems<br />\n• engineering design<br />\nautomation<br />\n<br />\nGOT A<br />\nMAN'S JOB<br />\nTO DO<br />\n<br />\n4,44,A9OR<br />\nAEROSOL<br />\n<br />\nbEODORAN T<br />\n<br />\nAll engineering and scientific<br />\ndisciples will be considered.<br />\nFor these challenging marketing positions<br />\nwrite or call<br />\n<br />\nW. H. Bowen,<br />\nIBM Corporation,<br />\n2330 Saint Paul Street,<br />\nBaltimore, Maryland 21218<br />\n<br />\nIBM<br />\nDATA PROCESSING DIVISION<br />\n<br />\nIBM is an Equal Opportunity Employer<br />\n<br />\n1<br />\n<br />\nGet it done right. Get MAN-POWER ... the new power-packed<br />\naerosol deodorant! MAN-POWER'S got the stepped-up penetration power, the 24-hour staying power a man needs. Goes<br />\non fast ... never sticky ... dries in seconds. Try it! 1.00<br />\nBY THE MAKERS OF OLD SPICE I SHULTON<br />\n<br />\n\fEisenhower In Bologna<br />\n(Continued from Page 1)<br />\nbecame Rector of the University<br />\nof Frankfurt am Main. He was a<br />\nvisiting professor to Georgetown<br />\nUniversity from 1948 to 1949,<br />\nand he was President of the German Delegation to the Schuman<br />\nPlan Conference in 1950. He<br />\nserved as Secretary of State,<br />\nGerman Foreign Office, from<br />\n1951 until 1958, when he became<br />\nPresident of the Commission of<br />\nthe European Common Market.<br />\nSAIS<br />\nThe Bologna branch of SAIS<br />\nstarted with ten students and<br />\nfour professors a decade ago.<br />\nNow the school has eighty-two<br />\nstudents and fifteen full time<br />\nprofessors, and, to date, there<br />\nhave been 482 graduates, of<br />\nwhom more than a fourth are<br />\nworking in government ministries in Europe and the United<br />\nStates.<br />\nDr. C. Grove Haines, a history<br />\nProfessor and former State Department official, founded the<br />\n<br />\nPAGE THREi<br />\n<br />\nNEWS-LETTER<br />\n<br />\nHOMEWOOD, SALTIMORE, APRIL 30. 1965<br />\n<br />\nschool and now serves as the<br />\nBologna Center's director. He instituted the school as a center<br />\nfor American students in Europe<br />\nand as a place for \"American<br />\nin<br />\nfor<br />\nEuropeans<br />\nstudies<br />\nEurope.\"<br />\nThe Bologna Center serves as<br />\nan integral part of the School<br />\nfor<br />\nInternational<br />\nAdvanced<br />\nStudies. American and European<br />\nstudents of international relations and economics may complete their graduate studies<br />\nthere.<br />\n<br />\nOrientation Booths<br />\nAny campus activity desiring an activity booth during<br />\nOrientation Week must contact Jim Mongiardo, Box 885<br />\nby May 7.<br />\n<br />\nDebaters Elect<br />\n1Upert President<br />\n<br />\nWAVERLY LAUNDROMAT<br />\n3330 GREENMOUNT AVENUE<br />\nDaily 8 A.M. to 6 P.M.<br />\nMon., Thurs., Fri. Till 8 P.M.<br />\n<br />\nThe Johns Hopkins Debate<br />\nCouncil closed its year April 20<br />\nat its annual banquet at the Faculty Club with the election of the<br />\nnewly-installed President Jon Alpert and other council officers.<br />\n<br />\n\"WE WASH, DRY & FOLD\"<br />\nSAME DAY SERVICE<br />\n<br />\nSHIRTS—DRY CLEANING<br />\n<br />\nOthers elected were junior<br />\nToby Simon, First Vice-President; freshman George Miller,<br />\nSecond Vice-President; freshman Julia Spirer, Corresponding<br />\nSecretary; and freshman Terry<br />\nLeveck, Recording Secretary.<br />\nThe debaters finished their<br />\n1965-65 season with a victory for<br />\nthe two-man team of Howard<br />\nRead and Dave Thompson. The<br />\npair took first place in the New<br />\nYork University Annual Debate<br />\nTournament, April 23-24.<br />\nThe banquet ended with presentation of the customary gavel<br />\nto past-President Fibel for his<br />\ntwo years of service and an<br />\naward to the council's advisor.<br />\n<br />\nin by 9 a.m. ... Out by 3 p.m.<br />\n<br />\nRECORDS<br />\nMONO and STEREO<br />\n• CLASSICAL • FOLK • POP<br />\n• SPOKEN • JAZZ • IMPORTS<br />\nLargest Selection Anywhere<br />\n<br />\nDISCOUNT PRICES<br />\nESOTERICA OUR SPECIALTY<br />\nNAT BARNETT'S<br />\n<br />\nHI Fl RECORD SHOP<br />\nFREE PARKING<br />\n<br />\n2580 McCULLOH STREET<br />\n<br />\nNo. 9-6100<br />\n<br />\nYou Can Count on Us... Quality Costs No More at Sears<br />\nr.<br />\n<br />\nSEARS<br />\nROEBUCK AND CO<br />\n<br />\npit<br />\n<br />\nThe Fun Way<br />\nto Co Places • •<br />\nSears Italian<br />\nMade Scooter<br />\n<br />\nVIVA!<br />\nSears Compact<br />\nMotor Scooters<br />\n<br />\n3-speed foot shift is a breeze<br />\nHandsomely<br />\noperate.<br />\nto<br />\nstyled by Puch of Austria.<br />\n60-in, long, with large, comfortable seats. 100-miles per<br />\ngallon, 3.9-HP 2-cycle engine with individual brakes.<br />\n<br />\n•<br />\n<br />\n,f4,<br />\n• •.•,,....<br />\n<br />\nSears Cruisaire<br />\nMotor Scooters<br />\n<br />\nSears 3 Stores<br />\n,AT THESE FINE STORES<br />\n<br />\nBig 5HP Engine<br />\n<br />\nDELAWARE<br />\nMilford, H. S. Saunders Jeweler<br />\nNewark, J. J. Minster & Son<br />\nWilmington, Jewel Box<br />\n<br />\n*339<br />\n<br />\nNo Money Down On Sears Easy Payment Plan<br />\nMARYLAND<br />\nAnnapolis, Tilghman Co.<br />\nCo.<br />\nBaltimore, James It. Armiger<br />\nJewelers<br />\nCumberland, Barnes Custom<br />\nElkton, J. J. Minster & Son<br />\nFrederick, Colonial Jewelry Co.<br />\n<br />\nALLSTATE MO-red for Two-Wheel Fun<br />\nHere's the economical way to travel. Get 150 miles per gallon of<br />\ngas, 31 mph, on this 2-speed shift<br />\nthriller. 2.2 HP.<br />\n<br />\nSears Price<br />\n<br />\nSears .5 Stores<br />\n<br />\nThousands of tourists tour Europe on this Scooter every<br />\nsummer! Front coil spring, rear shock absorber and huge<br />\ncoil-spring saddle soak up the jolts. Takes you up any hill<br />\na car can, lots of places a car can't. Double action brakes,<br />\nheavy-duty clutch, 4-speed transmission.<br />\nPhone Sears for FREE Demonstration Ride;<br />\n<br />\nWheaton, Winthrop Jeweler*<br />\nSears 8 Stores<br />\n<br />\nVIRGINIA<br />\nPalls Church, Winthrop JIrs.<br />\n4'<br />\n<br />\nP.M.<br />\nSEARS 3 SUPER SERVICE STATIONS OPEN MONDAY THRU SATURDAY 'TIL 9:30<br />\n<br />\nShop at Sears and Save<br />\nSatisfaction Guaranteed or Your Money BackS<br />\n<br />\nNORTH AVE.<br />\nBElmont 5-3960<br />\n<br />\nMONDAWMIN<br />\nLAfayette 3-2521<br />\n<br />\nRITCHIE HI-WAY<br />\nSTate 9-6700<br />\n<br />\n\fPAGE FOUR<br />\n<br />\nNEWS-LETTER<br />\n<br />\nZip .31ohns *opkitts Nettio-tottr<br />\nJ. Caleb Deschanel<br />\nWilliam Schenck<br />\n<br />\nEditors-in-Chief<br />\nJames M. Freedman<br />\nBusiness Managers<br />\nEdward Stern<br />\n<br />\nI<br />\n<br />\nBOARD OF CONTROL<br />\nAssociate Editor<br />\nJohn M. Bri,kman<br />\n<br />\nAssociate Editor<br />\nRobert Livernash<br />\nEditorial Writer<br />\nCurt Zimansky<br />\n<br />\nFeatures Editor<br />\nHenry James Korn<br />\nNews Editor<br />\nPhotograph Editor<br />\nMel Shuster<br />\nJay Amshey<br />\nContributing Editor<br />\nJim Mongiardo<br />\nAssociate Start<br />\nCharlie Bon Tempo..<br />\nChristopher Molloy...<br />\nJohn Chott.<br />\n„—<br />\nGarth<br />\nAlan Mitchell.<br />\nBarry Farber<br />\nJames Meginniss<br />\nHenry Hocherman<br />\nMichael Phillips<br />\nCharles Vermont<br />\n<br />\nManaging Editor<br />\nGreg A Itschuh<br />\nSports Editor<br />\nMarshall Paul<br />\nCopy Editor<br />\nJohn Sweeney<br />\nCirculation Chief<br />\nMusic Critic<br />\n__Asst. News Editor<br />\nNews Editor<br />\nAsst. News Editor<br />\nAsst Feature Editor<br />\n__Asst. Features Editor<br />\n.Asst. Features Editor<br />\n..Asst. Sports Editor<br />\n...Political Writer<br />\n<br />\nReporters<br />\nNews: Jerry Ruark, William Mitchell, Robert Craven: Features: Charlie<br />\nAllegrone, Ed Elias, Evade; Hays, Steve Zito: Sports: Iver Mindel, Stanley<br />\nKatz, Walter Sienkiewicz: Photography: James Barber; Business: Andrew Wallach, Bob Blazer. Paul Joseph, Richard Nozemack. Allan Eudell,<br />\nStephen Kramer, Richard Friedman: Composition: Joel Goldstein. Copy:<br />\nDil 71 iel Cole.<br />\n<br />\nFreedom?<br />\nBut is there any meaningful worth to our academic<br />\nfreedom? Do we gain anything from the obviously inadequate advising system, from the distinction between<br />\nmajors and concentrates, from the lack of administrative organization on the undergraduate level?<br />\nOur academic freedom really seems to he the result of neglect and lack of interest, and there does not<br />\nsem to be any way in which we as undergraduates profit<br />\nform it.<br />\nShould we not be willing to sacrifice some autonomy for closer supervision over our academic activities, creation of a dean of undergraduate affairs, with<br />\nadditional lower level administrators and a professional<br />\nstaff of advisors, and the abolition of the concentration?<br />\nThe implied choke is clear: do we prefer academic neglect or a eommittment on the part of the<br />\nuniversity to take a closer interest in our academic<br />\nlives?<br />\nIf asked to state what they felt was the greatest<br />\nstrength of this university, many undergraduates, after<br />\nlong and torturous thought, would say \"the freedom.\"<br />\nWhat they usually mean is that, unlike an undergraduate at Harvard or Swarthmore, et. al., the Hopkins<br />\nman is permitted to leave the dormitories if he wishes<br />\nafter his freshman year and live in a fraternity or an<br />\napartment.<br />\nWhether this freedom is the result of design or<br />\nneglect on the part of the administration is not particularly meaningful as long as there is no change.<br />\nWhat the Undergraduate Long Range Planning<br />\nCommittee is now considering is the effect of change<br />\non this freedom, first in the context of co-education,<br />\nsecond in the area of curriculum.<br />\nIn this light they have developed a distinction between social and academic freedom. Social freedom,<br />\nliving in apartments or fraternities, seems to he highly<br />\nregarded by most undergraduates and should not be<br />\nlightly forsaken.<br />\nA SPRING TRIBUTE TO GOUCHER<br />\nToo long the Hopkins man has lived.<br />\nassailed by norks and often snibbed<br />\nby fantasies of Portami. (Puzzled, puss?<br />\nIt's just the plural of Portamus.)<br />\nBut in this quandary, he is saved<br />\nby dreams of Goucher girls.<br />\ntheir countenance so duly played<br />\nwith troom beneath their golden curls.<br />\nOh girls of Goucher, shining bright!<br />\nI think of you most every night,<br />\nand of the gentleness and grace<br />\nwhich you belie with grimfuld face;<br />\nand of the incapacity<br />\nthat can't be yours with such loquacity<br />\nand of your sprightly feminosity,<br />\nanhancing primsical precocity.<br />\nAnd of your sparkling wit,<br />\nand of your firmly rounded personality.<br />\nBut do not think me very naughty<br />\nto praise the goodies you embody.<br />\nOh girls of Goucher, shining bright/<br />\nthe Portamus can never harm me<br />\nwhen with such wonders you do charm<br />\nsaid neither can the nork, nor dark:<br />\nI think of you and want to snark!<br />\nI.<br />\n<br />\nme.<br />\n<br />\nBy T. S. Pook8<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 30, I 96.1<br />\n<br />\nThe diametaaaci Scene<br />\nConscientious Objections<br />\n<br />\nBy HENRY KORN<br />\nual assimilation into American in the Hopkins Theatre of OpThe United States Army, of pop-folk culture. For once Terry erations as well. In addition to<br />\nlate, has taken a lot more in the and the Pirates recognize the periodically staffing a Public)<br />\near than orders. In addition to danger of the \"dirty V.C.\" (as Relations outpost in the upper<br />\nits manifold problems with the they have been doing for more lobby of Levering Hall, our own<br />\nViet Cong, a small but spirited than months now) the American home-grown military elite. The<br />\nband of Hopkins Guerrillas has public just might begin to take Pershing Rifles, have established<br />\nmade its presence felt. Without the whole thing seriously,<br />\nthemselves as campus minutepretentious brass, inflexible loyOne of the year's leading toys men. This newly formed military<br />\nalties on congressional approval has been Mattel's \"Monkey Ba- arm of the radical right would<br />\nwe defeated the cream of the tallion\" sets. These sets include have disappointed the General.<br />\nAmerican Army on it's home- all the paraphenalia needed for<br />\nDoubtless he would rather<br />\ngrounds of West Point.<br />\nbackyard<br />\ncounter-insurgence. have seen the boys riding horses<br />\nA West Point Cadet might find The fortunate owner receivers than the hoods of automobiles<br />\nit difficult to conceive of anyone (hand-carried to the toy store (in attempting to prevent anwhose experience with firearms down a back alley trail) plastic other campus group to leave for<br />\nis limited to the kind made by grenades, demolition kits, com- Washington), but then we must<br />\nMarx and Mattel rather than munications equipment and a change with the times and do<br />\nWinchester and Remington, yet good assortment of automatic what we can.<br />\nthere is a certain jaded pleasure weaponry. It has been over two<br />\nYet the sudden realization that<br />\nderived from viewing the Army years since an enterprising film<br />\na great part of The United States;<br />\nat a range no closer than Ser- magnate released a movie called<br />\n\"Yank in Vietnam.\" No doubt a Army is made up of guys who<br />\ngeant Bilko.<br />\ndropped out of your high school,<br />\nFor almost equally as danger- rerelease would do very well now. led by some of the stuff that<br />\nous as the actual escalation of<br />\nThe Army has done no small walks around here in R.O.T.C.<br />\nthe Vietnamese war is its grad- amount of napalmless flaming uniforms, gives cause for worry.<br />\n<br />\nDrama<br />\n<br />\n'Stormers'Electra a Qualified Success<br />\nBy JON GREEN<br />\n'she suffers none of the Dane's ing, considering that the BarnLike<br />\nCaptain stormers have divided there<br />\nElectra, presented by the Barn- indecisiveness.<br />\nstormers last Friday and Satur- Ahab, she pursues a killer with forces and are presently workday evenings, was well acted but monomanioal intent. As Electra, ing on the Fantasticks. Therewas too wordy and diffuse to be Jan Kramer gave a beautifully fore the steady and promising<br />\nmodulated<br />\nperformance. work of the remainder of Electra<br />\npresented and enjoyed at Hop- well<br />\nkins. The play, written in 1937 Most of her weaker moments cast warrants particular attenby Jean Giraudoux, is a very came came in Act II in her tion: Mark Wentworth as the<br />\nFrench treatment of the classi- scenes with Clytemnestra, played Chief Judge demonstrated concal story of Electra, Orestes, and by Margo Miller. Miss Miller also siderable comic ability but was<br />\nfamily. In it Giraudoux investi- brought her character alive; and not as pompous and stodgy as his<br />\ngates the inevitable oonict be- as a woman whose insane hat- role required. Ellen Sheiner<br />\nCissi<br />\nEikov<br />\nmov e d<br />\ntween \"uncompromising justice\" red and coldness was buried un- and<br />\nand political reality. The investi- der great charm and grace, she nicely, tittered well, and defitely<br />\ndressed the stage in their roles<br />\ngation uncovers no definite an- did very well.<br />\nswer, and the side issues which<br />\nAlso adding excellent charac- as Furies. Mat Clary's Orestes<br />\nare raised in passing are not ful- terization were Bruce Fagin, had many good moments, as did<br />\nly developed.<br />\nAegisthus; Sue Ellen Gordon, Jerry Feldman playing the CapAgatha;<br />\nand Betsy Levy, Narses's tain of the Guard.<br />\nThe acting in the play was unwife.<br />\nThe high quality of the actAll in all, Electra was a triiformily good; and the director,<br />\nMrs. Laurleen Pratt, deserves ing of the six people mentioned umph for the actors but not for<br />\nmuch credit for her astute cast- above, is nothing short of amaz- the Barnstormers.<br />\ning. The pace, interaction of the<br />\ncast, and immaginative costumes<br />\nmade the evening a minor success. Mrs. Pratt failed, however,<br />\nto cut the play effectively; and<br />\nher blocking emphasized the<br />\nstatic nature of the play. Also,<br />\nshe did not utilize large areas<br />\nof the stage, but concentrated<br />\nthe action on the sides of the<br />\nstage. This last weakness may<br />\npartially be attributed to the in- By CHRISTOPHER MOLLOY pass with increased maturity. His<br />\nThe most obvious observation ornament was very deft and<br />\nstark<br />\nteresting<br />\nset.<br />\nyet<br />\nUnfortunately, the Barnstormer's in this year's concert is the enor- graceful, and the long right hand<br />\nset designer, Rick Wessler, re- mous improvement that Roman trill was far superior to ,the<br />\nportedly was hampered by a piti- Rudnytsky has made. He has earlier left hand one—again an<br />\nfull small budget and meager just attained the quality that is Indication of immaturity.<br />\nequiptment. The other technical appropriate for public concerts.<br />\nThe crescendos of a Sonata<br />\nAlberto<br />\naspects of the production, the If he continues to improve at by<br />\nGeastrea<br />\nwere<br />\nenormous<br />\nthis<br />\nrate<br />\nwell<br />\nmay<br />\nhe<br />\nhandled well. In the second<br />\nlighting and sound effects, left<br />\nbe one of our generation's out- movement of the Ginestera, he<br />\nmuch to be desired.<br />\nstanding talents. Still he needs played soft nervous rhythms<br />\nThe philosophical background much more polish to enter a with<br />\na delicate interpretation<br />\nof Electra was supplied by the competitive environment. Like that showed<br />\ngreat promise. The<br />\nbeggar (god) and the gardener, most student performers, he third and fourth<br />\nmovements<br />\nplayed by David Ricci and John lacks the stage presence to put were a return to his<br />\nrecurrent<br />\nSweeney, respectively. The beggar over a fully successful recital.<br />\nproblems of sacrificing tone for<br />\nperformed the vital function of<br />\nAgain he opened with Bach. volume and tempo for drama.<br />\nleading the audience to the He gave a good statement of his<br />\nHe closed the program with<br />\n\"truth\" through a maze of con- type of interpretation, developflicting statements. Mr. Ricci's ing unity soon after he began. three Chopin war horses; Ballade<br />\npo-trayal and interpretation were His second selection was a Schu- No. 4 in F minor, op. 52, Nocnearly flawless. What impressed bert Sonata. Although he had turne in C Sharp minor, op. 27<br />\none most were the warmth, sen- difficulty with a left hand trill, No. 1, and Polonaise in A Flat<br />\nsitivity, and humor which the he showed that his technique is major, op. 53. Chopin is an<br />\naudience received from his char- singularly his forte; he failed to artist's artist, and brought out<br />\nacterization.<br />\ndevelop coherency in the pass- some of the befit in Rudnytsky.<br />\nHere he showed technical excelMr. Sweeney gave the evening ages of tonally comparative<br />\nlence and rich emotional referIts most perfect moment, when phrases. He showed a moment of ence that<br />\nsurpass his expressive<br />\nhe appeared in front of the cur- near brilliant polish in a very control,<br />\nbut this can be, and<br />\ngraceful<br />\ntransition<br />\nback<br />\nto<br />\nhis<br />\ntain at the beginning of Act II<br />\nwas, forgivable in the Ballad and<br />\nand delivered the gardener's soli- main theme in the third move- Nocturne. The<br />\nPolonaise is someloouoy. This speech suggested ment, but lost it in a very rough thing else.<br />\nthat the answer to everyone's coda.<br />\nHe showed much better grasp<br />\nWhen a concert pianist atproblem is simple—love. Unforof tonal variation in Beethoven's tempts a war horse as horsey<br />\ntunately, suggesting that love is<br />\nSonata in A major, op. 101, as this, he must be able to put<br />\nthe answer to Eleotra's problems<br />\nthough he still shows an in- it over with superior brilliance<br />\nis, at best, a gross oversimplifiability to sustain a long quiet and ease. Roman Rudnytsky<br />\ncation.<br />\npassage with grasp of its inter- cannot do this, at least not yet.<br />\nThe Furies and fate irrisistably pretive value. Close to this probhe improves as much in the next<br />\ndrive Electra to her date with lem were his rapid crescendos; year<br />\nas he did in the last he will<br />\njustice. Although caught in a they swooped down with all the be an<br />\naccomplished artist. We<br />\ntrap of alternatives similar to menace of squalls. These are should look<br />\nforward to another<br />\nthe dilema confronting Hamlet, problems of control and should return.<br />\n<br />\nMusic<br />\n<br />\nPianist Lacks Polish;<br />\nTechnique Rated Good<br />\n<br />\n\fHOMEWOOD,<br />\n<br />\nBALTIMORE, APRIL 30. 1965<br />\n<br />\nNEWS-LETTER<br />\n<br />\nItirritag Itios Kihrrabit<br />\nThe Committee On Decent Exposure tC.O.D.E.) tracing it's origins to last year's 'Clothe The<br />\nDumb Animals . Movement\" of<br />\nNew York City elucidates it's position on Hefner's Brand of Naked Lunch.<br />\nWe the members of CODE.<br />\nseek to destroy the myth that the<br />\nAmerican college man looks to<br />\nHugh Hefner for his social and<br />\nmoral values. We protest any<br />\nsubscription to what we view as<br />\nan attempt to inundate and capitalize on what we view as a potentially sincere and healthy liberalization of American social<br />\nvalues. We see the average Playboy reader as:<br />\n1) Average<br />\n2) Pretending an enjoyment of<br />\n<br />\nKnave Shows<br />\nThe staff of The Johns Hopkins News-Letter proudly announces that it's entry in the<br />\nA.P.O. UGLY MAN CONTEST:<br />\n\"The Knave\" has garnered third<br />\nplace in an unprecedented display of campus revulsion. Alsorans include Dave Norby who<br />\nwon the contest, Bob Miller who<br />\nfinished second fs,nd Pete Light<br />\nof Beta who is the newly crowned fraternity ugly man.<br />\n<br />\nClass of '67<br />\nAll sophomores interested<br />\nin serving on a Planning<br />\nCommittee for next year's<br />\njunior class activities, please<br />\ncontact Jim Mongiardo, Box<br />\n885.<br />\n<br />\nthird rate fiction by first<br />\nrate authors<br />\n<br />\nOrchestra Provokes<br />\nTremendousResponse<br />\nBy CHRISTOPHER MOLLOY<br />\n<br />\nPAGE FIVE<br />\n141114441101110310111111111111110111110;1144111i11111011111141101111111111011111081WHIMINII01511111111111114101M111111111111104111WOHNIMIIMIIIIIIIiianimosalse<br />\n<br />\nSEND FLOWERS FOR<br />\nMOTHER'S DAY, MAY 9th.<br />\n<br />\nIt is not very often that an<br />\nSave money and place order now.<br />\n3) Who believes Al Hirt is a<br />\nAmerican audience can be moved<br />\njazz artist<br />\n4) Is a junior executive on the to stand up and cheer at a concert. The Munich Bach chorus<br />\nway up<br />\nFLORISTS<br />\nand Orchestra under Karl Rich5) Or a frustrated ass-man on<br />\nter drew this enthusiastic re3224<br />\nSt. Paul St.<br />\nBE. 5-7855<br />\nthe way down<br />\nsponse from a very sparse audi'<br />\n,<br />\nCODE. is a non - sectarian. ence of hard core music lovers ';iNtliiiiiihhilimillipsio!iillili111141111111114111111uitollisii0011111101111111111H111111111111011111111111lilliiiiiiIoniaminvitoolimihilln1W111111111111111111011110ift-,non-political, non-profit organi- at the Lyric Theater last Tueszation that welcomes members day. Their B Minor Mass was<br />\nexquisite. Although they were<br />\nfrom all sides of the sexual/phil- obviously not accustomed to the<br />\nosophical spectrum to join this acoustics of the theater, they<br />\nmass-based protest against Hef- turned out a dynamic performners own conception of concep- ance that deserved much more<br />\ntion. Specifically we protest:<br />\nthan their one night.<br />\n(By the author of<br />\n<br />\nBOB GRAHAM INC.<br />\n<br />\nOn<br />\n<br />\nThrough the entire first half,<br />\n1) The using of Johns Hopkins<br />\nUniversity for a public air- the contrabasses dominated the<br />\ning of Mr. Hefner's person- performance. With little percussion they should have been heavy<br />\nal publicity.<br />\nbut obviously they couldn't hear<br />\n2) His sophistication of the<br />\nhow loud they were. Also over<br />\nmonth club\"<br />\nbalanced were the second vio3) The admission to Shriver to lins, violas, and altos. These<br />\nanyone not holding a gold thornes were all ironed out for<br />\nthe second half, and the conkey<br />\nductor's battle was no longer a<br />\n4) The absence of Bunnies on<br />\nlosing one. Among the soloists<br />\nthe debating panel.<br />\nalto Hertha Toepper, tenor Ernst<br />\nCODE. offers a cup of bitter Haeflinger, and violinist Otto<br />\nhemlock to Philospher Hugh.<br />\nBuchner were particularly fine.<br />\n<br />\nPoetry and Music<br />\nFestival<br />\n(Evergreen House—April 30, May 1)<br />\n<br />\nBink Noll<br />\n<br />\nSTUDENTS!<br />\n<br />\n\"The Center of the Circle\" 3.95<br />\n<br />\nOf course you can<br />\nget a cash loan!<br />\n<br />\nNight Voyage 1.00<br />\n<br />\nCampus,41,<br />\n\"Rally Round the Flag,Boys!<br />\n\"Dobie Gillis,\" etc.)<br />\n<br />\nTESTS,AND HOW THEY GREW<br />\nJust the other night I was saying to the little woman,\"Do'<br />\nyou think the importance of tests in American colleges is<br />\nbeing overemphasized?\". (Incidentally, the little woman is<br />\nnot, as you might think, my wife. My wife is far from a little woman. She is, in fact, nearly seven feet high and mantled with rippling muscles. She is a full-blooded Ogallala<br />\nSioux and holds the world's shot put record. The little<br />\nwoman I referred to is someone we found crouching under<br />\nthe sofa when we moved into our apartment back in 1928,<br />\nand there she has remained ever since. She never speaks<br />\nexcept to make a kind of guttural clicking sound when she<br />\nis hungry. To tell you the truth, she's not too much fun to<br />\nhave around the house,but:with my wife away at track meets<br />\nmost of the time, at least it gives me someone to talk to.)<br />\nBut I digress. \"Do you think the importance of tests in<br />\nAmerican colleges is being overemphasized?\" I said the<br />\nother night to the little woman, and then I said, \"Yes,<br />\nMax, I do think the importance of tests in American colleges is being overemphasized.\" (As I explained, the little<br />\nwoman does not speak, so when we have conversations, I<br />\nam forced to do both parts.)<br />\nBut I digress. To get back to tests—sure, they're important, but let's not allow them to get too important. There<br />\nare, after all, many talents which simply can't be measured<br />\nby quizzes. Is it right to penalize a gifted student whose<br />\ngifts don't happen to fall into an academic category? Like,<br />\nlor instance, Finster Sigafoos?<br />\n•<br />\n<br />\nEric Sellin<br />\nRobert Hazel<br />\n<br />\nPoems, 1951-1961 1.65<br />\n<br />\n•Our new LOANS TO<br />\nSTUDENTS SERVICE is.<br />\ndesigned especially for you.<br />\n<br />\nErlend Jacobsen<br />\n<br />\n•Monthly repayments will<br />\nbe arranged to suit your<br />\nparticular circumstances.<br />\n<br />\nJulia Randall<br />\n<br />\n•Stop in or 'phone ... We'll<br />\nbe glad to serve you.<br />\n<br />\nWilliam Burford<br />\n<br />\n77 Antipoems 1.00<br />\nMimic August 3.00<br />\nMan Now 2.50<br />\n<br />\nRitter6 jpnce<br />\n<br />\nElliot Coleman<br />\n<br />\nBroken Death 3.00<br />\n<br />\n313 N. Howard St.<br />\n<br />\nAvailable at<br />\n<br />\nBaltimore<br />\nPhone SA. 7-7880<br />\n<br />\nThe Johns Hopkins Bookstore<br />\n<br />\nHours: Mons., Tues. & Weds. 9-5<br />\nThurs. 11-8; Fris. 9-6<br />\n<br />\nPo is a full-blooded<br />\nOgallala Sioux.<br />\n<br />\nGilman Hall N<br />\n<br />\nUNIVERSITY McGILL<br />\nMontreal, I'anada<br />\n<br />\nECOLE FRANCAISE D'ETE: 30 juin-12 aout 1965<br />\nCoors de longue et de litterature. NOUVELLE SECTION DE CIVILISATION Possibilite de preparer un M.A.<br />\nNOMBREUX PROFESSEURS INVITES des grondes universites francoises et nord-omericaines,<br />\nresidont a la Cite universitaire avec les etudionts les octivites paroscoloires.<br />\nSolles de cours climatisees. Laboratoire de longues ties moderne. Pour renseignements:<br />\necrire a Mlle. J. Solliec, Secretaire.<br />\n<br />\nFinster, a freshman at the Wyoming College of Belles<br />\nLettres and Fingerprint Identification, has never passed a<br />\nsingle test; yet all who know him agree he is studded with<br />\ntalent like a ham with cloves. He can, for example, sleep<br />\nstanding up. He can do a perfect imitation of a scarlet tanager. (I don't mean just the bird calls; I mean he can fly<br />\nsouth in the winter.) He can pick up BB's with his toes. He<br />\ncan say \"toy boat\" three times fast. He can build a rude<br />\ntelephone out of 100 yards of string and two empty Personna Stainless Steel Razor Blade packages. (This last accomplishment is the one Finster is proudest of—not building<br />\nthe telephone but emptying the Personna packs. To empty<br />\na Personna pack is not easily accomplished, believe you me,<br />\nnot if you're a person who likes to get full value out of his<br />\nrazor blades. And full value is just what Personnas deliver.<br />\nThey last and last and keep on lasting; luxury shave follows<br />\nluxury shave in numbers that make the mind boggle. Why<br />\ndon't you see for yourself? Personnas are now available in<br />\ntwo varieties: a brand-new stainless steel injector blade for<br />\nusers of injector razors—and the familiar double-edge stainless steel blade so dear to the hearth and kind to the kissers<br />\nof so many happy Americans, blades so smooth-shaving, so<br />\nlong-lasting that the Personna Co. makes the following<br />\nguarantee: If you don't agree Personna gives you more luxury shaves than Beep-Beep or any other brand you might<br />\nname, Personna will buy you a pack of whatever kind you<br />\nthink is better.)<br />\nBut I digress. Back to Finster Sigafoos— artist, humanist,<br />\nphilosopher, and freshman since 1939. Will the world ever<br />\nbenefit from Finster's great gifts? Alas, no. He is in college<br />\nto stay.<br />\nBut even more tragic for mankind is the ease of Clare de<br />\nLoon. Clare, a classmate of Finster's, had no talent, no<br />\ngifts, no brains, no personality. All she had was a knack for<br />\ntaking tests. She would cram like mad before a test, always<br />\nget a perfect score, and then promptly forget everything<br />\nshe had learned. Naturally, she graduated with highest<br />\nhonors and degrees by the dozen, but the sad fact is that<br />\nshe left college no more educated and no more prepared to<br />\ncope with the world than she was when she entered. Today,<br />\na broken woman,she crouches under my sofa.<br />\nC1966, Max Sbulmaa<br />\n<br />\nSpeaking of tests, we, the makers of Personna®, put<br />\nour blades through an Impressive number before we<br />\nsend them to market. We also make—and thoroughly<br />\ntest—an aerosol share that soaks rings around any<br />\nother lather4 Burma Share', regular and menthol.<br />\n<br />\n\fNEWS-LETTER<br />\n<br />\nHOMEWOOD, BALTIMORE, APRIL 30, 1965<br />\n<br />\nWard Named Royal Fellow<br />\n<br />\nCoach Tabs Netters'Better,'<br />\nHold 4th Place With 1-4 Log<br />\n<br />\nPAGE SIX<br />\n<br />\nHefner Here Sunday<br />\nTo Bare Sex Facts<br />\n(Continued from Page 1)<br />\n1963 he adressed the National<br />\nAcademy of Television Arts and<br />\nSciences. In the winter of 1963,<br />\nhe<br />\n<br />\nwrote and appeared in a<br />\n<br />\nseries of thirteen half-hour television lectures entitled \"Introducing Theology.\" He is the<br />\nauthor of a forthcoming paperback bok which will include studies of the writing of James Baldwin, Albert Camus, and Hugh<br />\nHefner.<br />\n<br />\nDr. John C. Ward, Professor<br />\nof Physics at the University, has<br />\nbeen elected a Fellow in the<br />\nRoyal Society. He will be formally inducted into Britain's oldest<br />\nscientific society at a London<br />\nceremony in April.<br />\nBorn and educated in England,<br />\nDr. Ward attended Oxford University, Merton College and received his Ph.D. degree there in<br />\n1949. He has been engaged in<br />\nresearch and teaching in the<br />\nUnited States since 1951.<br />\nA member of the Institute of<br />\nAdvanced Study at Princeton<br />\nUniversity from 1951-'52, 1953'54 and 1960-'61 Dr. Ward has<br />\nalso taught at the Carnegie Institute of Technology, the UM-<br />\n<br />\nWANTED: Coin collections of all denominations<br />\nU.S. Gold, and all foreign coins.<br />\n<br />\nversity of Miami, and the Universe Libre de Bruxelles, Belgium.<br />\nDr. Ward joined the Hopkins<br />\nfaculty in 1961. Among his major<br />\npublications are the discovery of<br />\n'Ward's Identity,\" a mathematical identity which facilitates renormalization of quantum electro-dynamics.<br />\nIn 1960, he published a paper<br />\nwith Abdul Salam on unitary<br />\nsymmetry. This paper constituted<br />\na major breakthrough in the<br />\nstudy of elementary particle physics. His study of the \"combinational method,\" published in the<br />\n1955 Theoretical Physics Journal,<br />\nis closely related to research in<br />\nferromagnetism<br />\nFor further information, please<br />\ncontact George S. Wills, Johns<br />\nHopkins University, Office of<br />\nPublic Relations, HO. 7-3300, Ext.<br />\n221, 222.<br />\nA Favorite Rendez Wu<br />\nfor Hopkins Men<br />\n<br />\nJIMMY WU'S<br />\n<br />\nComplete line of subs and cold beer.<br />\n<br />\nB & M SUB SHOP<br />\n<br />\nNEW<br />\nCHINA INN<br />\nCharles Street below 25th<br />\nJIMMY WU'S<br />\nCARRY OUT SHOP<br />\n1411 E. Cold Spring Lane<br />\n<br />\nCH 3-9294<br />\n<br />\nGuilford and 31st<br />\n<br />\nBy WALTER SIENKIEWICZ<br />\nThe fourth-place varsity tennis team figures to improve its<br />\n1-4 record when it crosses racquets with Washington College<br />\ntomorrow afternoon.<br />\nThe netmen, under Coach Tom<br />\nMcDermott, picked up their only<br />\nwin to date against Western<br />\nMaryland but looked a great deal<br />\nbetter than they had for two<br />\nseasons.<br />\nIn this 7-1 victory, top man<br />\nJoe Sorrow won 6-1, 6-0; Mark<br />\nEllenbogen won 7-5, 6-2; Bob<br />\nChilders went 4-6,6-0,8-6; John<br />\nLowe won 6-4, 6-4; and Rick<br />\nJelovsek defeated his man 6-1,<br />\n6-3.<br />\nWin Doubles<br />\nTwo of the Jay doubles combinations won, while the number<br />\nthree doubles match was called<br />\nbecause of darkness.<br />\nBob Childers put in the best<br />\neffort of the day. Losing the<br />\nfirst set, he lumbered back to<br />\nshut his opponent out in the second. Childers pushed on in the<br />\ntight third set, eventually taking<br />\nit 8-6.<br />\nAgainst Haverford on Parent's<br />\nDay, Hopkins was defeated 61/2-<br />\n<br />\n2. The long meet was tense<br />\n5 1/<br />\nnevertheless. Sorrow seemed to<br />\nhave trouble with his softer-playing opponent. Only after<br />\ntwenty-seven games, 6-3 and 108, did Sorrow take Hopkins' only<br />\nsingles match.<br />\nGive Exhibition<br />\nThe number two doubles combination of Ken Larsen and Johr.<br />\nLowe also gave the spectator.)<br />\nan interesting match. After taking the first set 6-4, the div)<br />\nslipped up on the second 3-6<br />\nAnd then a long third set began<br />\nLasting close to an hour. As<br />\ndarkness rolled in, the match<br />\nwith the final set at 8-8 was<br />\ndeclared a tie.<br />\nIn the return match with<br />\nLoyola this Tuesday, the varsity<br />\nwill seek to avenge its earlier<br />\n6-3 loss to the Greyhounds.<br />\nThe freshmen tennis team<br />\nbrought its record to 1-1 with an<br />\neasy 7-2 victory over Baltimore<br />\nPolytechnic.<br />\nIn the winning column were<br />\nKit Battenfield (6-2 and 6-3).<br />\nGeorge Miller (6-1 and 6-3)<br />\nScott Black (6-1 and 6-1), and<br />\nWalt Sienkiewicz (6-1 and 6-0).<br />\nDuos of Roger Evans and Battenfield, Dave Millstone and<br />\nDennis Clements, and Ken Luck..<br />\nman and Sienkiewicz gave Hopkins the three doubles matches.<br />\n<br />\nCLASS RINGS<br />\nOrders for rings will still be taken t<br />\nat the Student Shop for the remainder<br />\nof the semester. Rings will be sent<br />\n'C.O.D.. to home address. Any information—at Student Shop. Monday<br />\nthru FridaY.<br />\n<br />\nCOTTAGE FOR RENT<br />\n3 bedroom, 2 baths, Govans,<br />\nwest of York Rd.<br />\nFurnished<br />\n<br />\nor unfurnished<br />\n<br />\nID 5-3948<br />\n<br />\nTHE WORLD'S BEST!<br />\n... because there is more preci-<br />\n<br />\nA NEW PROGRAM OF INTEREST TO<br />\n<br />\nsion-built quality in every Schwinn..<br />\nThat's why \"Schwinn Bikes Are<br />\nBestl\"<br />\n<br />\nMEN<br />\nIt Isn't easy to become an—officer in die United<br />\nStates Army.Only the best young men are selected.'<br />\nThe training and course of study are demanding.i<br />\nBut if you can qualify—and you should find out,<br />\nif you can—you will receive training which will put<br />\nyou a step ahead of other college graduates. Armyi<br />\nROTC training will give you experience that most<br />\ncollege graduates do not get—in leading and man-1<br />\naging other men, in organizational techniques, in<br />\nself-discipline and in speaking on your feet. This<br />\nkind of experience will payoff in everything you.<br />\n<br />\nit Ci-f your life.<br />\nArmy ROTC has a new program designed specifically for outstanding men who already have<br />\ntwo years of college, and plan to continue their<br />\ncollege work. During your junior and senior years<br />\nin this program, you will receive $40 per month.<br />\nWant to find out more about the program? Simply<br />\nsend in the coupon below, or see the Professor of<br />\nMilitary Science if you are now attending an<br />\nROTC college. There's no obligation—except the<br />\none you owe to yourself,/<br />\n<br />\n'10 the<br />\n<br />\nVARSITY<br />\n<br />\n—10 SPEED<br />\n<br />\nEasy<br />\nTerms<br />\n<br />\nIfyoul're good-enough to be an Army Officer,, don't settle for less<br />\n1E11<br />\n<br />\nProfessional styling, Handbrakes,<br />\nracing handlebars, racing saddle,<br />\nSprint derailleur, and nylon cord:<br />\nhigh pressure tires.<br />\n<br />\nARMY ROTC<br />\nBox 1040, Westbury, New York 11591<br />\n<br />\n'Gentlemen: Please send<br />\n<br />\nme information on the new 2-Year Army ROTC Program. I am<br />\n<br />\nEXPERT REPAIRS<br />\nPICK-UP & DELIVERY<br />\n<br />\nnow a student at<br />\n<br />\nA<br />\n<br />\n(college or university) and plan to continue my schooling at<br />\n<br />\nPR I NCETcyv<br />\n<br />\nName<br />\nAddres;<br />\nState<br />\n<br />\n_Zip Code--<br />\n<br />\n-<br />\n<br />\nCYCLE & SKI CO.<br />\n5304 PARK HEIGHTS AVE.<br />\n<br />\n\fHOMEWOOD, BALTIMORE, APRIL 30. 1965<br />\n<br />\nNEWS-LETTER<br />\n<br />\nTight Defense, 3-Goal Final Quarter<br />\nGive Trossmen Win Over Cadets<br />\nArmy<br />\n<br />\nSyracuse<br />\n<br />\n(Continued from Page 8)<br />\nexplained. \"It was very low scoring for a major college contest<br />\nwith only nine goals being<br />\nscored.\"<br />\nBlattner To Start<br />\nJoe Blattner earned himself a<br />\nstarting post on defense by sutting out Bill Ritch. The Army<br />\nsenior had scored seven goals<br />\nagainst Hopkins in two previous<br />\ngames.<br />\nDick Bower limited Bob Johnson, the Cadets' leading scorer,<br />\nto one shot and no goals. Frank<br />\nSzoka did a good job on Tim<br />\nVogel, the number-one Army<br />\nmid-fielder.<br />\n<br />\n(Continued from Page 8)<br />\nmounting his total saves to thirteen, the last period was all Hopkins'. The defense buckled down<br />\nand held Army scoreless.<br />\nThe Jays went ahead to stay<br />\nwhen Darrell took a feed from<br />\nPfeifer for their fourth goal.<br />\nNine minutes later Darrell came<br />\naround from behind the net and<br />\nadded another point when his<br />\nshot, partially blocked by Army<br />\ngoalie John Cullen. dribbled into<br />\nthe goal. The marker was his<br />\ntenth of the year.<br />\nPfeifer, on a pass from Darrell,<br />\ngot Hopkins' final goal with less<br />\nthan a minute to go.<br />\n<br />\nFrosh Batsmen Close Season;<br />\nMeet Frederick, Glen Burnie<br />\nThe freshman baseball squad<br />\nends its short season with two<br />\nhome games this weekend, one<br />\ntoday at 3:30 against Frederick<br />\nHigh School, the other tomorrow<br />\nafternoon at 1:30 against Glen<br />\nBurnie High School.<br />\nThe contingent brings a 1-3<br />\nrecord into today's encounter,<br />\nbut the statistics are not a good<br />\nindication of the team's quality<br />\nand potential, according to Coach<br />\nSam Case. Well-balanced, the<br />\nteam features consistent hiters,<br />\ngood fielders and excellent pitchers.<br />\nLack Practice<br />\n\"We played our first game before we had our first\" practice\",<br />\ncommented Case. \"The squad is<br />\na good, hard-working one but<br />\nhas been hurt by the weather.\"<br />\nThis past week. for example,<br />\npractice was called off, and varsity games took up the field<br />\non Tuesday and Thursday. Thus<br />\n<br />\nthe Jays had only Wednesday to<br />\nget ready for today's game.<br />\nThe bulk of the hitting has<br />\nbeen supplied by Dave Thomas,<br />\nWebster Gray, Jim Ca111, Pete<br />\nMartindale, and Mike Shaw.<br />\nThe mainstay of the pitching<br />\nstaff is Erie Javel, who has<br />\npitched 18 of the team's 30 innings so far. In one effort, he<br />\nfanned 11 batters in 6 and 2 innings. Rounding out the pitching are Rob Snyder, Dan Frey,<br />\nand Wally Siggers.<br />\nLists Roster<br />\nThe rest of Case's lineup is as<br />\nfollows: Charles Allegrone, outfield; James Buchanan, first<br />\nbage; Aldrich Davis, second base;<br />\nJames Easter. first base; Dave<br />\nKomocki, shortstop; Bill Mitchell,<br />\nouteld. Also listed are Tom Mobley, catcher; Ron Smith, outfield; and William Thorn, outfield.<br />\nLast season the freshman diamonders played only two games,<br />\nlosing both.<br />\n<br />\nLibrary Concerts<br />\nRecorded concerts in the Gar- Thursday. May 6. 1965<br />\nret Room of the new library.<br />\n, Opera highlights: Wagner<br />\nMonday, May 3, 1965<br />\nVerdi<br />\nBallet highlights: Copelia, DeFriday. May 7. 1965<br />\nlibes. Les Sylphides<br />\nOrchestra music made popular<br />\nTuesday, May 4, 1965<br />\nby Glenn Miller<br />\nDvorak: New world symphony<br />\nPrado: Exotic suite of the<br />\n(Ray McKinley & Jerry Gray)<br />\nAmericas<br />\nWednesday, May 5, 1965<br />\nPar away places exotic music:<br />\nSUB, SUB, SUB,<br />\nHarpsichord and orchestra<br />\nGuitar duo<br />\nSHAKE, SHAKE, SHAKE<br />\n<br />\nII II<br />\n<br />\nZEPP PHOTO CENTERS<br />\nThe Friendly Spot<br />\nto Photo Shop<br />\n3042 Greenmount Ave.<br />\n<br />\nII III<br />\n<br />\nIII<br />\n<br />\nDEFY GOLDFINGER!<br />\nGot your passport —<br />\n<br />\nGot your health certificate<br />\nGet your<br />\n<br />\nINTERNATIONAL<br />\nSTUDENT ID CARD!<br />\nThen, a student ship to<br />\nEurope will be a fascinating<br />\n<br />\nexperience.<br />\nBook your passage with us — ask<br />\nfor special folder and student jobs<br />\nin Holland.<br />\n<br />\nThey've landed the Marines<br />\nHarry's Little Submarines<br />\n<br />\nWrite: Dept. 007,<br />\n<br />\nfor<br />\n<br />\nU.S. NATIONAL<br />\nSTUDENT ASSOCIATION<br />\n<br />\nHARRY LITTLE<br />\nCarry-Out SHOPS<br />\n<br />\n265 Madison Avenue<br />\nNew York, N. Y. 10016<br />\n<br />\n407 East 32nd Street<br />\n<br />\nTowson Plaza<br />\n111<br />\n<br />\nYou don't need an<br />\nengineering degree to figure out<br />\nwhy this cordless shaver<br />\ncosts a bit more.<br />\n<br />\nAll you need<br />\nare whiskers.<br />\nJust run the cordless<br />\n<br />\nA profitable summer of study<br />\nand recreation...<br />\n<br />\nOF LONG ISLAND UNIVERSITY<br />\n<br />\nApplications now being accepted for<br />\n<br />\nTWO 5-WEEK SUMMER SESSIONS<br />\nJUNE 21 to JULY 23; JULY 26 to AUGUST 27<br />\n<br />\nDay and Evening<br />\nAccelerate your degree program<br />\nwith a distinguished visiting<br />\naid resident faculty, outstanding laboratory<br />\nand library facilities.<br />\nGRADUATE COURSE offerings<br />\nin the Graduate Schools of<br />\nLong Island University<br />\ninclude studies in Biological<br />\nSciences, Business Administratiell,<br />\nEducation, English, Guidance and<br />\nCounseling, History, library Science,<br />\nMathematics, Music Education,<br />\nPhysics, Political Science,<br />\nSociology, Speech.<br />\n<br />\nLocated on the beautiful North Shore<br />\nof Long Island, the 270-acre campus<br />\nIs just 30 minutes from the World's Fair,<br />\n<br />\n60 minutes from midtown Manhattan.<br />\n<br />\nEnjoy swimming, tennis, riding, bowling,<br />\n<br />\nealk.• wow<br />\n<br />\nREMINGTOINI<br />\n<br />\nLEKTRON1C 11 Shaver through our<br />\nbeard. Then feel for whiskers.<br />\nThis alone will tell you why our<br />\nshaver costs a bit more. Still, if you<br />\nwant more facts, read on.<br />\nThe LEKTRONIC II has the biggest<br />\nshaver head in the business. With<br />\n756 working slots, things get done<br />\nin a hurry.<br />\nOn top of the shaver head are<br />\n4 tiny rollers. They make sure only<br />\nwhiskers disappear. Not skin.<br />\n348 cutting edges take care of that •<br />\nfast disappearing act. Honed from<br />\nsurgical high-carbon steel, these cutters<br />\nstart sharp, stay sharp.<br />\nAdd to this the sideburn trimmer:<br />\na straightedge tucked under the<br />\nhead case that gives you a neat,<br />\nfinishing touch.<br />\nThen there's the cordless feature.<br />\nWorks on rechargeable energy cells.<br />\n(Also works with a cord, if you forget<br />\nto recharge.) So you can shave where<br />\nand when the itch hits you. Frees you<br />\nfrom sockets and wet sinks.<br />\nSo, you can easily see why it costs<br />\na bit more. Even if you can't add or<br />\nhandle a slide rule.<br />\n<br />\nCAAT.POST COLLEGE<br />\n<br />\nUNDERGRADUATE<br />\nCOURSE offerings<br />\nInclude studies in<br />\nLiberal Arts and Sciences,<br />\nPre-Professional,<br />\nPre-Engineering,<br />\nBusiness and Education.<br />\n<br />\nPAGE SEVEN<br />\n<br />\nFtEMINGTON<br />\n'<br />\n<br />\n5S)<br />\n- UAW Stdat<br />\n<br />\nELEV.,<br />\n<br />\noutdoor plays and concerts on the campus.<br />\nNearby are famous beaches, sailing clubs, summer<br />\nstock theatres, parks and golf courses.<br />\n<br />\n•<br />\n<br />\nNew men's and women's residence halls,<br />\nAPPLY NOW...Admission open to VISITING STUDENTS<br />\nfrom other accredited colleges.<br />\nFor additional information, summer bulletin and<br />\napplication, phone 516 MAytair 6-1200 or mail coupon<br />\n.........................................<br />\n<br />\nDean of Summer School, C. W.Post College, P.O., Greenvale,LI., N.Y.11548<br />\nPlease send me Summer Sessions information bulletin.<br />\nCP<br />\n[] Men's Residence Hall<br />\nD Women's Residence Hall<br />\nIJ Graduate<br />\nLI Day<br />\n1.3 Evening<br />\nID Undergraduate<br />\n<br />\ne<br />\n<br />\nName.......................................................<br />\nAddress......................................................<br />\n<br />\nState<br />\n<br />\nCity<br />\nIf visiting student,from which<br />\n<br />\nLir I kON,_<br />\n<br />\ncollege'<br />\n.<br />\n<br />\nrry<br />\n<br />\n.4<br />\n<br />\n\fSP<br />\n<br />\nNEWS<br />\n<br />\nLETTER<br />\nHOMEWOOD, BALTIMORE, APRIL 30, 1965<br />\n<br />\nNEWS-LETTER<br />\n<br />\nPAGE EIGHT<br />\n<br />\nStickers Gunning For 8th Straight<br />\nTomorrow<br />\nSyracuse<br />\nJays<br />\n.<br />\nFace<br />\nI<br />\nBatsmen<br />\nVarsity<br />\nI Pitching Woes Plague<br />\npacking 6-3 Victory Over Army<br />\nHank Schaefer, who has been should add some stability to the<br />\nmaking good progress lately team's unsettled infield situation.<br />\nIts miseries magnified by an<br />\ndespite a painfully injured arm.<br />\nAfter Saturday's encounter, the<br />\naching mound staff. the varsity<br />\nStanley<br />\nTo<br />\nReturn<br />\nJays<br />\nhost Loyola Wednesday at<br />\nWashbaseball team travels to<br />\nRumors of the season loss of 3:00 and journey to Towson<br />\nstill<br />\ntomorrow<br />\nCollege<br />\nington<br />\nSaturday. Last<br />\nnext<br />\nshortstop Dick Stanley were dis- State<br />\nseeking its initial victory.<br />\nspelled when Barrette announced Wednesday's game with Lebanon<br />\nThe previous week's action—<br />\nthat the 5'-8\" senior is expected Vali.ey was cancelled and will<br />\nencounters with Western Maryback within a week. His return not be replayed.<br />\nland, Gettysburg. and Ursinus—<br />\ndid little to boost hopes of a<br />\nHopkins' diamond<br />\nsuccessful<br />\ncampaign. The squad fell by respective 10-1, 8-0, and 9-2<br />\nmargins to the three clubs.<br />\nBy MIKE PHILLIPS<br />\n<br />\nLacrosse History<br />\n<br />\nPitching Collapses<br />\nEven pitching, the Jays' one<br />\nusual source of strength, collapsed. About the only competent<br />\nperformance was Frank Soriano's<br />\nfive-inning relief stint against<br />\nUrsinus. Arnie Michelson, Merlin<br />\nBatt, and Soriano himself were<br />\nthoroughly combed in starting<br />\nroles.<br />\nPart of the hill staff's problems can be traced to the past<br />\nIveek's schedule, which saw the<br />\nJays play three games in four<br />\ndays.<br />\nThis hampered any attempt<br />\nby Coach Gary Barrette to man<br />\nan effective bull pen and made<br />\nit necessary for the starters<br />\n(with the exception of Batt) to<br />\ngo the route, even if hit hard.<br />\n<br />\nSport In 78th Year At Hop;<br />\nJay 'Crossers Set U.S. Pace<br />\nTaken from 1965<br />\nJ.H.U. spring sports<br />\nLacrosse at Hopkins, one of<br />\nthe nation's intercollegiate leaders in the sport, got off to an<br />\ninconspicuous start with the formation of a stick club on October<br />\n10, 1882. Elgin Gould, from the<br />\nUniversity of Toronto, was the<br />\nfounder.<br />\nIt took until 1888 before Hopkins was officially represented in<br />\nlacrosse. That year it won the<br />\nfirst of its 417 victories, drubbing<br />\nthe Patterson, a club outfit, 6-2.<br />\n<br />\nWon Title<br />\nOnce the sport was given official recognition, Hopkins quickly<br />\ngot into the championship act.<br />\nIn 1891, the Blue Jay's second<br />\nseason in the Intercollegiate Lacrosse league, Hopkins won<br />\nRuns Come Hard<br />\nlaurels with a 6-0 slate.<br />\nThe team's run-scoring ability<br />\nThat was the first of seven uncontinued at its low level, as evi- defeated campaign. During the<br />\ndenced by the past week's play. past seventy-seven years, Hopkins has registered fifty-eight<br />\nThe Gettysburg game was the<br />\nsecond time this year that Hopkins had been held to one hit.<br />\nLacrosse Broadcast<br />\nThe<br />\nHopkins-Syracuse laLooking things over. Barrette<br />\ncrosse game will be broadcast<br />\nnoted that soph right fielder Ray<br />\nlive from Syracuse, New York,<br />\nWier is hitting at a steady clip,<br />\non WJHU, 830 k.c. Air time is<br />\npacing the club with a .375 av1:55.<br />\nerage. He also praised catcher<br />\n<br />\nST. PAUL CLEANERS<br />\nTailoring - Repairing - Dyeing<br />\nSame Day Pressing<br />\nComplete Laundry Service<br />\n32ND & ST. PAUL ST.<br />\nBELMONT 5-4413<br />\n<br />\n*<br />\n<br />\n********<br />\n<br />\n***<br />\n<br />\nWe need your head In our<br />\nbusiness<br />\n<br />\nshutouts, the last over Loyola<br />\nCollege, 20-0 in 1960. It has only<br />\nbeen blanked six times; has had<br />\nfifty-two winning seasons; fifteen losing; while ten were even<br />\nsplits.<br />\nAlong with its 417 wins, Hopkins has lost 167 games and tied<br />\nfteen—a '71.4 percentage. The<br />\nJays lead every major rivalry but<br />\nMount Washington Club (12-302. and Navy (16-20-1).<br />\nIn Olympics<br />\nNot only has Hopkins won or<br />\nshared<br />\ntwenty-five<br />\nnational<br />\nchampionships, but it has twice<br />\nrepresented the U.S. in the<br />\nOlympic Games. The Blue Jays<br />\nwon special playoff series in both<br />\n1928 and 1932 to earn trips to<br />\nAmsterdam and Los Angeles,<br />\nwhere both times they brought<br />\nthe world championship back to<br />\nthe Homewood Campus.<br />\n<br />\nLife Guard<br />\nStudents desiring a position<br />\nas life-guard at the new pool,<br />\nplease contact Coach William<br />\nKlarner in the athletic center.<br />\nThe position is salaried, and<br />\nstudents will be pic.rmitted to<br />\nwork a maximum of ten hours<br />\nper week. Senior life-saving<br />\ncertification is required.<br />\n<br />\nArmy<br />\n<br />\nSyracuse<br />\nBy JIM MANGIARDO<br />\nWith an attack that is still<br />\nhobbling and a defense which has<br />\nproven that it can do the job<br />\nwhen called upon, the varsity<br />\nlacrosse team travels north tomorrow to challenge an ambitious Syracuse club.<br />\nSyracuse, which usually schedules just teams from the Ohio<br />\nand New England areas, has<br />\nplayed the Jays only four times.<br />\nThe last contest was in 1963<br />\nwhen Hopkins edged the visitors<br />\n10-7.<br />\nReturning from that team<br />\nwhich gave the Jays this battle<br />\nare Duncan Crowther, Tom Kennedy, Barry Loucks, and Art<br />\nMarkusen.<br />\nNominated All-America<br />\nCrowther is Syracuse's nomination for All-America this year.<br />\nThe midfielder scored two<br />\ngoals and had an assist in the<br />\n1963 game. Kennedy, another<br />\nmidfielder, also had a goal in<br />\nthe fray.<br />\nCompleting the starting midfield for the Orangemen is<br />\nLoucks. Markusen will start on<br />\ndefense. The man to watch on<br />\nthe Syracuse attack is Al Smoral,<br />\nan underclassman.<br />\n\"Syracuse will play the same<br />\nsort of game that Yale played,\"<br />\nCoach Bob Scott predicted.<br />\n\"They are hard hitting and will<br />\ndo a lot of personal dogging.\"<br />\nLook Ahead<br />\n\"It will be very easy for the<br />\nteam to think ahead to Navy as<br />\nwe thought of Army in the<br />\nWashington College game. But<br />\nwe will have to remember that<br />\nwe have to play real well to win.<br />\nWe just can not lower ourselves<br />\nto their level as we have done<br />\nconsistently this year against ou<br />\nminor competition.\"<br />\nAfter his brief talk about his<br />\nopposition this weekend, the<br />\ncoach went on to discuss his<br />\nteam's play against Army. Hopkins upset the Cadets by pouring in three goals in the final<br />\nperiod to break a 3-3 tie.<br />\n\"It was an unusual game,\" he<br />\n(Continued on Page 7)<br />\n<br />\nSt. Paul Barber Shop<br />\nAcross from Eddie's<br />\n<br />\n********************************<br />\n<br />\nIN THE NATION'S CAPITAL<br />\nAT THE GEORGE<br />\nWASHINGTON UNIVERSITY<br />\n<br />\nSURF BOARDS<br />\nFactory seconds--variety of colors<br />\n<br />\nA program designed to make<br />\nthe unparalleled resources of<br />\nWashington, D.C. available to<br />\nstudents in other colleges and<br />\nuniversities.<br />\n<br />\n$55.00 to $75.00<br />\n<br />\nBAY LAMINATES Inc.<br />\n<br />\nJUNE 14-JULY 21<br />\nJULY 22-AUGUST 27<br />\n<br />\nTHE SAFE WAY to stay alert<br />\nwithout harmful stimulants<br />\n<br />\nRenting to JHU Students<br />\n<br />\nFeaturing New Fords<br />\nSpecial Weekend Rates<br />\n<br />\nYOU CAN EARN UP TO 14 HOURS OF<br />\nCOLLEGE CREDIT WHILE<br />\n<br />\nSTUDYING<br />\nTHIS SUMMER<br />\n<br />\n3120 St. Paul St.<br />\n<br />\n1799 McGuckian St.<br />\nAnnapolis, Md.<br />\n<br />\nBy IVER MINDEL<br />\n•<br />\nNewsletter Correspondent<br />\nThe varsity lacrosse team put<br />\na check on Army's highly touted<br />\nattack Saturday as it scrambled<br />\nto a 6-3 victory, Hopkins' seventh straight.<br />\nThe encounter was the Jays'<br />\nbest defensive effort of the campaign. Their defensive trio—<br />\nHank Kaestner, Mike Oidick, and<br />\nJoe Blattner—stayed in action<br />\nthe entire fray and didn't commit a single foul to boot.<br />\nKaestner covered the Cadets'<br />\nAll-American attackman Toni<br />\nSheckells, while Oidick was on<br />\nRay Enners. Starting in place of<br />\ninjured Denny Townsend. Blattner guarded third-string AllAmerican Bill Ritch.<br />\nArmy Scores First<br />\nScrapping characterized most<br />\nof the play. At ten minutes in<br />\nthe first period, the Cadets drew<br />\nfirst blood when second-midfielder Jim Tillman took Enners'<br />\nfeed and scored.<br />\nA<br />\nminute<br />\nlater, Hopkins<br />\nbruised Army's defense with a<br />\nmarker of its own—on a pass<br />\nfrom Skip Darrell to Stan Fine.<br />\nWhen Jerry Pfeifer, playing on<br />\na sore leg, assisted Chip Giardina at eight minutes in the second period. Coach Bob Scott's<br />\ncharges went ahead.<br />\nTie Game<br />\nSheckells retaliated, however,<br />\nby scooping up a loose ball and<br />\nslamming it into the goal unassisted.<br />\nIn the third period, Al Huston.<br />\nwho played both crease attack<br />\nand second midfield, took a pass<br />\nfrom Herb Better and converted<br />\nIt into a goal. Again Sheckells<br />\ntied it up for Army, picking up<br />\nanother ground ball and scoring.<br />\nWith goalie John Dashiells<br />\n(Continued on Page 7)<br />\n<br />\nNOD0zTM keeps you mentally<br />\nalert with the same safe refresher found in coffee. Yet<br />\nNoDoz is faster,handier,more<br />\nreliable. Absolutely not habitforming. Next time monotony<br />\n<br />\nmakes you feel drowsy while<br />\nstudying, working or driving,<br />\ndo as millions do... perk up<br />\nwith safe, effective NoDoz<br />\nKeep Alert Tablets.<br />\nAnother floe product of Grove Laboratories,<br />\n<br />\nRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRx.Rx<br />\n<br />\nNational Car Rental System<br />\n<br />\navailable at<br />\n<br />\n1915 N. Howard Street<br />\n539-3990<br />\n<br />\nTHE GREENWAY PHARMACY<br />\nCharles and 34th Streets<br />\n<br />\nhi<br />\nhi<br />\n<br />\nhi<br />\nhi<br />\n<br />\nRidtaRxRaRxRxRxRxRxRxRxRxRxRxRxRxRxRxRaRxRxRxRx.Rx<br />\n<br />\n•Special 3-week workshops le<br />\nEducation begin June 14,<br />\nJuly 6, and July 26<br />\n• Air-conditioned classrooms,<br />\nlibrary and residence hall<br />\n• Urban campus just four<br />\nblocks from the White House<br />\nwrite for catalogue:<br />\nDean of the<br />\nSummer Sessions<br />\nThe George<br />\nWashington<br />\nUniversity<br />\nWashington, D.C.<br />\n20006<br />\n<br />\n\f", "format": "basic_html", "processed": "INT<br />\nsip<br />\n***<br />\nt11113<br />\nVOL. LXIX, NO. 27<br /><br />\nitirttrr<br /><br />\nJOHNS HOPKINS UNIVERSITY, APRIL 30, 1965<br /><br />\n4taii-E2<br /><br />\n69TH YEAS<br /><br />\nStudents To Publish Balt°. Daily<br />\nHefner To Bare Facts In Shriver Talk<br />\nScheduled Spring Parley C.O.D.E.Opposes Morning Herald To Appear<br />\nTo Climax Hop Excitement Heiner's Visit; For Duration Of Strike<br />\nPlans To Picket<br /><br />\nHugh Hefner, the controversial editor-publisher of Playboy<br />\nmagazine, will participate in a<br />\nYMCA-sponsored panel discussion of \"The Playboy Philosophy<br />\nin America\" May 2 at, 8:30 p.m.<br />\nin Shrivel. Hall. Other members<br />\nof the panel will be Dr. Mary<br />\nCalderone and Dr. William Hamilton, who, along with Hefner,<br />\nwill discuss modern American<br />\nmorals.<br />\nWith the advent of the Playboy Philosophy in December, 1963<br />\nHefner has conducted a concerted attack against what he feels<br />\nis the anachronistic moral codes<br />\nby which Americans live today.<br />\nHis remarks have made him a<br />\nprominent figure in American<br />\nsociety, and they have become<br />\nthe object of more press and academic comment than any editorial feature in the Playboy magazine's history.<br /><br />\nHUGH HEFNER<br />\nSeminary in 1949, and his Ph.D.<br />\nfrom the University of St. Andrews in Scotland in 1952.<br /><br />\nThree Johns Hopkins students<br />\nhave announced the official incorporation of the New Baltimore<br />\nMorning Herald, established to<br />\nserve the Baltimore area for the<br />\nThe anticipated arrival of duration of the current newsHugh Hefner has stirred up some paper strike.<br />\nmembers of the Hopkins campus,<br />\nCaleb Deschanel. James Freedwho have formed the Commit- man and Charles Hollander,<br />\nown a<br />\ne of Decent Exposures (CODE). Hopkins undergraduates,<br />\nmajority of the new corporation<br />\nThe organization, which was<br />\nin partnership with Harvard\"spontaneously\" created when educated Baltimore lawyer Morbecame ton L. Goldner. Key positions on<br />\nvisit first<br />\nHefner's<br />\nknown, will hold a rally and the staff of Morning Herald will<br />\nprodemonstration Sunday evening be held by out-of-work<br />\nfessional newspapermen largely<br />\nQuadat 7.15 in the Wyman<br />\nfrom the non-union Baltimore<br />\nrangel. Hefner is scheduled to News American.<br />\narrive at 8 P.M.<br />\nHeading other staff positions<br />\nThe purpose of the organi- will be John Brickman, sports,<br />\nzation is \"to demonstrate that Henry Korn, features, Reuben<br />\nthe true reactions of the Ameri- Aaronson, Gary Davis, news and<br />\ncan college campus. We will show Stan Katz, financial news. HeadMr. Hefner that students are not ing the advertising staff will be<br />\n100% behind him,\" stated Kostia Charles Hollander advised by<br />\nBergman, one of the group's The Al Dreyer Ad Agency and<br />\nleaders.<br />\nassisted by Bill Patten. Charles<br />\nCODE will hold an organiza- Bon Tempo. and Kirk Gardner.<br />\ntional meeting Sunday at 5.00 to The staff plans an eight page<br />\npaper today. twelve by Sunday<br />\nplan for the demonstration.<br /><br />\nDr. Hamilton worked extensively with CBS and the National<br />\nCouncil of Churches to produce<br />\nreligious television programs on<br />\nsuch shows as \"Calendar\" and<br />\nDr. Calderone is the current \"Look up and Live.\" He frequentExecutive Director of the Sex Inly lectures on television, and in<br />\nformation and Education Council<br />\n(Continued on Page 6)<br />\n(SIECUS),<br />\nStates<br />\nof the United<br />\nwhose stated purpose is 'to establish man's sexuality as a healthy<br />\nentity.\" She is a graduate of Vassar College, and in 1956 became<br />\nMedical Director of the Planned<br />\nReid<br />\nIn a recent meeting of the Phi Swansor, incumbent President, Medicine were: Henry<br />\nParenthood Federation of AmerBryant<br />\nWilliam<br />\nshe<br />\nJr.,<br />\nof<br />\nwhich<br />\nChapter<br />\nBourne,<br />\nAlpha<br />\nin<br />\nKappa<br />\nica, a capacity<br />\nBeta<br />\nwill preside at the banquet.<br />\nserved until she assumed her Maryland, fifty-one members of<br />\nCharles Harold Taylor, Jr.,<br />\nOther business decided upon Cutts,<br />\npresent position. A quaker, Dr. the Hopkins community were seSharpe Thompson, and<br />\nRobert<br />\nCalderone has received much at- lected for membership in this in the annual business meeting Wilmer Leigh Thompson, Jr.,<br />\nand<br />\nthe<br />\nof<br />\nlecturer<br />\ntention as both a<br />\nacademic honorary society. In- included a continuation<br />\nPh. D. candidates who were 'eeditor of several books dealing cluded among the new members series of Freshman Seminars,<br />\nwith sex, among them Abortion were thirty-five under-graduates, which were inaugurated this fall, lected for membership included<br />\nin the United States, and The five medical school students, eight and a sponsoring of a visit next Franklin Borchardt, Edgar Afton<br />\nGeagan,<br />\nManual of Contraceptive Prac- Ph. D. candidates, and three hon- fall by one of the Phi Beta Dryden, Daniel Joseph<br />\nJames B. League, Jr., Evangelos<br />\nKappa \"visiting scholars.\"<br />\ntice.<br />\norary members.<br />\nNik Moudrianakis, Ralph Tansker<br />\nThe annual initiation and a<br />\nElected officers for 1965-66 Shuey, Kirby Don Smith, and<br />\nDr. WilLiam Hamilton, the<br />\nthird authority on the panel, is reception for the new members were: President, Leon Fisenberg; Robert E. Wyatt.<br />\na member of the faculty of the will be held in the Staff Lounge Vice-President, Charles S. SingHonorary members selected<br />\nDivinity and afterwards a banquet in the leton; Secretary, Richard A.<br />\nRochester<br />\nColgate<br />\nSchool, and a part-time Profes- Garret Room of the New Library Macksey; Treasurer, William were Michael Beer, Ellicott Coleman, and Richard Hamilton<br />\nsor of Religion at the University on May 11. The speaker of the Coleman.<br />\nGreen.<br />\nof Rochester. He received B.A. evening will be Professor Loren<br />\nThe new members of Phi Beta<br />\nfrom Oberlin College in 1943, his Eiseley of the University of Kappa from the Homewood camB.D. from the Union Theological Pennsylvania. Professor Carl P. pus are: Herbert Better, Edward<br />\nRoy Block, Douglas Mac Arthur<br />\nCarey, Jonah Reuben Churgin,<br />\nMichael Comenetz, Christopher<br />\nDu Flon Creed, Tomas Edward<br />\nDavis, Martin W. Denker, David<br />\nLee Epstein, Andrew Lewis PeenShelley Earp was installed as<br />\nberg, Robert Marks Feibel, Luin the new President of the Student<br />\nPerry Fitch, Jr. James Wilford Council and Dick Bensinger was<br />\nDr. Milton S. Eisenhower will purpose of conferring the degree Forster, Barry Michael Fox, How- cited as \"Flame of the Year\" by<br />\n\"a<br />\ndistinguished<br />\nhonor<br />\nto<br />\nconfer an honorary LL.D. degree Is<br />\nard Lee Friedenberg, Claude Ted- outgoing members in the Counmember of the European com- dy-Hugo Friedmann, Neal Louis cil meeting last Monday night.<br />\non Dr. Walter Hallstein, Presimunity.\"<br />\nBensinger. the DSRC represenHorn, Judith B. Kaufman, Allan<br />\ndent of the European Economic<br />\nHallstein<br />\ntative on this year's Council reHarvin<br />\nDavid<br />\nArchie<br />\nJensen,<br />\nCommunity, on Saturday, May<br />\nDr. Hallstein was born in Mahan, Dale Mitchell Meyers, mained almost speechless during<br />\n15. The presentation will take Mainz, Germany, in 1901. He Lee Mark Middleman. Stephan the announcement by fellow repplace in Bologna, Italy, at a served as Assistant of Faculty of Larry Mintz, Charles Edward resentatives that he would receremony celebrating the tenth Law, University of Berlin, in Morrison, Walter Scott Murch, ceive a special scroll to comBranch of the Hopkins School 1925 and later as Professor of Francis D. Pien, George Henry memorate his \"Flame.\" An inInternational<br />\nAdvanced<br />\nfor<br />\nLaw at the University of Ros- Sack, Jr., Theodore Jerome formal source noted that all<br />\nStudies. This will be the first tock. During the war he was an<br />\nhad<br />\nSchneyer, Morris Jacob Schoene- prominent representatives<br />\ntime an American university has officer in the German Army. He<br />\nsigned the laudatory document<br />\nman,<br />\nSilberman<br />\nRonald<br />\nLoeb<br />\npresented such a degree abroad. became an American prisoner of<br />\nOutgoing President John GlasDenis Howard Tyras, Samuel<br />\nDr. Eisenhower will leave for war in 1944, and he founded a Woodward Warburton, Jr., James cock thanked the Council for a<br />\nItaly on May 11. Accompaning university for German prisoners English Williams, Jr., Melville highly successful year. Most<br />\nmembers were thanked personhim will be Dr. Francis A. Wil- in Como, Missouri.<br />\nPaul Ulmer, and Robert Lewis<br />\nally in the course of his brief<br />\ncox, Dean of SAIS. Ross Jones,<br />\nAfter the war. Dr. Hallstein Yates.<br />\nspeech. Then, as he rose to hand<br />\nDirector of Public Information<br />\nElected from the School of the gavel to Shelley Earl:). the<br />\n(Continued on Page 3).<br />\nfor the University, stated the<br /><br />\nPhi Beta Kappa Selects Fifty-One<br /><br />\nEisenhower To Award Honorary<br />\nDegree To Hallstein In Bologna<br /><br />\nand sixteen by next week. la<br />\ntime, the Morning Herald plans<br />\na tabloid of thirty-two pages<br />\nprinted every day of the week.<br /><br />\nPublic Service<br />\nThe New Baltimore Morning<br />\nHerald will function primarily<br />\nas a public service including<br />\nmajor emphasis on local news,<br />\nsports, legal notices, entertainment, finance, real estate, obituaries and society news. In publishing the Herald, the corporation does not break union rules<br />\nand follows a successful precedent set in Detroit. Cleveland<br />\nand New York. There is no truth<br />\nto the rumor that the Baltimore<br />\nSun has subsidised The Herald to<br />\nprolong the strike, a story that<br />\nhas circulated widely on the<br />\nGuild picket lines.<br />\nWhile the staff of the new<br />\npaper will include many members of the Editorial Board oif<br />\nThe Johns Hopkins News-Letter<br />\nit has no official connection with<br />\nthe University. Because finandai<br />\nsupport of the Herald would entail jeopardizing the University's<br />\ntax status as a non-profit organization, the Hopkins Administration has encouraged and offered<br />\nmoral backing to the fledgling<br />\ndaily.<br /><br />\nYoung Turks<br />\nThe News-Letter proudly<br />\nannounces a short-term inin<br />\nwhich the<br />\nterregnum<br />\nhitherto junior Dooks have<br />\ncome to the forefront in an<br />\nunpreccedented stop-gap effort. This late spring prominenceship is deafly an extension, the class of 1968's crushing victory on fall class day.<br />\nThe News-Letter ;tends firmly in the outstreached palm<br />\nof the lean and hungry<br />\nyouths who have turned out<br />\nall semblence of age and experience in favor of enthusiasm.<br /><br />\nShelly Earp Installed As Pres;<br />\nBensinger Bows Out In Glory<br />\nrepresentatives gave him a<br />\nstanding ovation.<br />\nHighest Turnout Yet<br />\nEarp in his opening remarks<br />\nseconded Glascock's opinion that<br />\nthings are looking up for Hopkins student government. The<br />\n50% turn out in recent elections<br />\nhe noted as the highest since<br />\nhe's been here.<br />\nIFC President Jon Harlow reported the Hank Ballard situation to the Council. He thought<br />\nthat there was a good chance of<br />\ngetting the money back. He described the legal situation as<br />\nbeing rather complicated.<br />\nUse AGVA<br />\nIn conclusion, he stated, that<br />\n\"any future deal like this should<br />\ngo through the musicians union<br />\nand Universal Attractions ia<br />\n(Continued on Pace 21.<br /><br />\nNEWS-LETTER<br /><br />\nPAGE TWO<br /><br />\nI<br /><br />\nCAMPUS NOTES<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 30, 19611<br /><br />\nShelly Earp Installed As Pres;<br />\nI Bensinger Bows Out In Glory<br /><br />\nBaltimore Life Insurance Com- ! was granted a Ph.D. from Corpany; Eutaw Savings Bank of nell University in 1955. Prior to<br />\nThe Musical Clubs of the Johns Baltimore; Finance Company of his post at Hopkins,<br />\nhe taught<br />\nHopkins University announce America; Title Guarantee Com- physics, history, and the history<br />\ntheir 81st Annual Combined Glee pany; United States Fidelity &amp; of science at Boston University,<br />\nClub Concert to be given tomor- Guaranty Company, as well as Brandeis University, and the<br />\nrow evening at 8:15 in Shriver a director and treasurer of University of Washington. He is<br />\nBall.<br />\nMaryland Hospital Service, Inc. the author of The Transits of<br />\nMr. 'Leigh M. Martinet will<br />\nActive in civic affairs, Mr. Venus: A Study in Eighteenth<br />\nconduct the Symphony Orchestra Harvey is a director of the Century Science and Science as<br />\nin its featured work, Dvorak's Greater Baltimore Committee. a Cultural Force.<br />\nNew World Symphony and other He is a trustee and treasurer of<br />\norchestral selections, while Mr. the Maryland Academy of Sci- Markert Leaving<br />\nJames W. Mitchell will conduct ences, and a trustee of Peabody<br />\nDr. C. L. Markert, professor of<br />\nthe Glee Club in Alec Rowley's Institute, Union Memorial Hos- Biology at Hopkins, will become<br />\nFull Tide and other featured pital and the YMCA.<br />\nChairman of the Department of<br />\nchoral works of contemporary inBiology at Yale July 1. Dr. Marterest.<br />\nkert is completing his eighth<br />\nScientific Dictionary<br />\nThe finale of the program will<br />\nDr. Harry Woolf, Willis K. year on the Hopkins faculty.<br />\nHe regards the Hopkins defeature both groups in Howard Shepard professor of the history<br />\nHanson's Song of Democracy un- of science, will be one of the six partment as \"very good\" and<br />\nder the leadership of Mr. Mar- historians of science who will the facilities as \"excellent\". His<br />\ntinet.<br />\nparticipate in the writing and re- man reason for leaving is \"to<br />\nAll students and faculty are search of the more than 2600 meet the greater challenge of becordially invited; admission is ; essays describing the careers and ing a department chairman.\" At<br />\nwithout charge.<br />\nachievements of scientists of all Yale Dr. Markert will head a<br />\nstaff of fifty people.<br />\nperiods and all nationalities.<br />\nFinance Chairman<br />\nA specialist in developmental<br />\nMade possible by a National<br />\nRobert D. H. Harvey, vice Science Foundation grant of biology with emphasis on biochairman of the board and chief $250,000,000, the proposed work chemistry and genetics, he once<br />\nexecutive officer of Maryland will be called the Dictionary of developed a three-eyed frog<br />\nNational Bank, has been named Scientific Biography, whose pub- through an eye transplant during<br />\nchairman of the finance com- lication is being sponsored by the embryonic stage.<br />\nDr. Markert received his Masmittee for the University Board 1 the American Council of Learned<br />\nter of Science degree from the<br />\nof Trustees, Charles S. Garland,1 Societies.<br />\nChairman of the Board, anTo be published In four or five University of California at Las<br />\nnounced.<br />\nvolumes, the Dictionary is in- Angeles in 1942 after graduatMr. Harvey succeeds S. Page tended to meet the needs of ing summa cum laude from the<br />\nNelson who had been chairman natural scientists, social scien- University of Colorado. He was<br />\nof the finance committee since tists, historians, philosophers, awarded his Ph.D. from Hopkins<br />\n1958. Mr. Nelson is Chairman writers and students at all levels in 1948.<br />\nAfter serving as a junior inof the Board of the Savings from high school through colstructor here for four years, he<br />\nBank of Baltimore.<br />\nlege and graduate school.<br />\nA native Baltimorean, Mr.<br />\nAccording to Dr. Charles C. became an assistant professor at<br />\nHarvey was a summa cum laude Gillespie, professor of the history the University of Michigan in<br />\nand Phi Beta Kappa graduate of of science at Princeton Univer- 1950. He was elevated to the<br />\nPrinceton University in 1942. He sity, and Editor-in-Chief of the position of Associate in 1956 and<br />\nreceived a B.S. degree from Dictionary, \"the availability of a came to Hopkins as a full proJohns Hopkins University in standard and authoritative work fessor in 1958.<br />\nDr. Markert is a member of<br />\n1953 and in 1957 he was grad- of reference will substitute an<br />\nuated from the Stonier Graduate accurate history of science for the American Association for the<br />\nSchool of Banking at Rutgers a widespread tissue of misrepre- Advancement of Science, the<br />\nUniversity.<br />\nsentations and an even wider ig- American Society of Zoologists,<br />\nMr. Harvey is also a member norance of this fascinating and the Genetics Society, the Tissue<br />\nof the Executive Committee of essential theme in the history of Culture Society, and the Michigan Academy of Sciences.<br />\nthe Board of Trustee of the University.<br />\nDr. Woolf received his bacheMr. Harvey is a director of a lor's and master's degrees from<br />\nOrientation Picture<br />\nnumber of companies, including the University of Chicago and<br />\nA picture of last fall's Orientation committee will be<br />\ntaken on the steps between<br />\nAmes and<br />\nRowland<br />\n4:00<br />\nWednesday, May 5. All leaders and committeemen, please<br />\nbe prompt.<br /><br />\nMusic, Glee Combined<br /><br />\nENGINEERS<br /><br />\n(Continued from Page 1)<br />\npositions, to be voted on next<br />\nNew York and cleared with week. Jeff Griffith, junior repAGVA (American Guild of Vari- resentative, was nominated So.<br />\nety Artists).\"<br />\ncial Committee Chairman, Bob<br />\nSmith DSRC Prexy<br />\nBittick, Junior, Course Guide<br />\nDSRC<br />\nelections<br />\nwere<br />\nan- project, and Sandy Cohn, sophonounced by Bensinger. Doyle<br />\nGentleman's Code ComSmith was elected President and more,<br />\nwill replace Bensinger on the mittee<br />\nCouncil. There was a run-off<br />\nFreshman Bill Reinsch, and<br />\nelection between John Sopka and Junior John Brickma.n were also<br />\nJohn Shull for Vice-President appointed to the Code Committhis week. Secretary is Walt tee. Its first case will concern a<br />\nSienkiewicz and Treasurer is Bob student who attempted to break<br />\nCrispin.<br />\ninto the Physics building with<br />\nShelley Earp made recommen- the expressed intention of stealdations for several committee ing property.<br />\n•.1.11.<br /><br />\n.<br /><br />\nEdgevale Flowers, Inc.<br />\nDistinctive Flower arrangements for all occasions—<br />\nArtware<br />\nUnusual Corsages and Flowers by wire.<br /><br />\nThe Marylander<br />\n3430 N. Calvert St.<br /><br />\nTelephone:<br /><br />\nCH 3-0478<br />\nBE 5-7829—Ext, 16<br /><br />\nBaltimore 18, Md,<br /><br />\nN....0.N ••• ••••••••••••••••••••••.........................• •• ••.• 0..0<br /><br />\nBECKERS<br />\n31st and GREENMOUNT AVE.<br /><br />\nBE. 5-1896<br /><br />\nULTIMATE IN DISTINCTION AND QUALITY IN THE<br />\n\"BECKER FAMILY OF FINE APPAREL FOR YOUNG MEN.\"<br />\nOFFICIAL HOPKINS BLAZER<br />\nON DISPLAY AT OUR STUDENT SHOP IN LEVERING HALL<br /><br />\nWe rent formal attire<br /><br />\nHopkins students, new and old, try:<br /><br />\nPecora's Restaurant<br />\nfor the finest Italian food in town<br />\n3320 Greenmount Ave.<br />\nCARRY OUT SERVICE<br /><br />\nSPAGHETTI MEALS<br /><br />\nCALL 889-3831<br /><br />\nPIZZA PIE A SPECIALTY<br /><br />\nand<br /><br />\nSCIENTISTS<br />\nCombine your background with the<br />\nComputer Sciences to become a problem solver and advisor to users of IBM<br />\nComputer Systems. Openings now exist<br />\nin Baltimore for people to work in areas<br />\nsuch as:<br /><br />\n• real time control of industrial<br />\nprocesses<br />\n• communications-based<br />\ninformation systems<br />\n• time shared computer systems<br />\n• praphic data processing<br />\n• management operating<br />\nsystems<br />\n• engineering design<br />\nautomation<br /><br />\nGOT A<br />\nMAN'S JOB<br />\nTO DO<br /><br />\n4,44,A9OR<br />\nAEROSOL<br /><br />\nbEODORAN T<br /><br />\nAll engineering and scientific<br />\ndisciples will be considered.<br />\nFor these challenging marketing positions<br />\nwrite or call<br /><br />\nW. H. Bowen,<br />\nIBM Corporation,<br />\n2330 Saint Paul Street,<br />\nBaltimore, Maryland 21218<br /><br />\nIBM<br />\nDATA PROCESSING DIVISION<br /><br />\nIBM is an Equal Opportunity Employer<br /><br />\n1<br /><br />\nGet it done right. Get MAN-POWER ... the new power-packed<br />\naerosol deodorant! MAN-POWER'S got the stepped-up penetration power, the 24-hour staying power a man needs. Goes<br />\non fast ... never sticky ... dries in seconds. Try it! 1.00<br />\nBY THE MAKERS OF OLD SPICE I SHULTON<br /><br />\nEisenhower In Bologna<br />\n(Continued from Page 1)<br />\nbecame Rector of the University<br />\nof Frankfurt am Main. He was a<br />\nvisiting professor to Georgetown<br />\nUniversity from 1948 to 1949,<br />\nand he was President of the German Delegation to the Schuman<br />\nPlan Conference in 1950. He<br />\nserved as Secretary of State,<br />\nGerman Foreign Office, from<br />\n1951 until 1958, when he became<br />\nPresident of the Commission of<br />\nthe European Common Market.<br />\nSAIS<br />\nThe Bologna branch of SAIS<br />\nstarted with ten students and<br />\nfour professors a decade ago.<br />\nNow the school has eighty-two<br />\nstudents and fifteen full time<br />\nprofessors, and, to date, there<br />\nhave been 482 graduates, of<br />\nwhom more than a fourth are<br />\nworking in government ministries in Europe and the United<br />\nStates.<br />\nDr. C. Grove Haines, a history<br />\nProfessor and former State Department official, founded the<br /><br />\nPAGE THREi<br /><br />\nNEWS-LETTER<br /><br />\nHOMEWOOD, SALTIMORE, APRIL 30. 1965<br /><br />\nschool and now serves as the<br />\nBologna Center's director. He instituted the school as a center<br />\nfor American students in Europe<br />\nand as a place for \"American<br />\nin<br />\nfor<br />\nEuropeans<br />\nstudies<br />\nEurope.\"<br />\nThe Bologna Center serves as<br />\nan integral part of the School<br />\nfor<br />\nInternational<br />\nAdvanced<br />\nStudies. American and European<br />\nstudents of international relations and economics may complete their graduate studies<br />\nthere.<br /><br />\nOrientation Booths<br />\nAny campus activity desiring an activity booth during<br />\nOrientation Week must contact Jim Mongiardo, Box 885<br />\nby May 7.<br /><br />\nDebaters Elect<br />\n1Upert President<br /><br />\nWAVERLY LAUNDROMAT<br />\n3330 GREENMOUNT AVENUE<br />\nDaily 8 A.M. to 6 P.M.<br />\nMon., Thurs., Fri. Till 8 P.M.<br /><br />\nThe Johns Hopkins Debate<br />\nCouncil closed its year April 20<br />\nat its annual banquet at the Faculty Club with the election of the<br />\nnewly-installed President Jon Alpert and other council officers.<br /><br />\n\"WE WASH, DRY &amp; FOLD\"<br />\nSAME DAY SERVICE<br /><br />\nSHIRTS—DRY CLEANING<br /><br />\nOthers elected were junior<br />\nToby Simon, First Vice-President; freshman George Miller,<br />\nSecond Vice-President; freshman Julia Spirer, Corresponding<br />\nSecretary; and freshman Terry<br />\nLeveck, Recording Secretary.<br />\nThe debaters finished their<br />\n1965-65 season with a victory for<br />\nthe two-man team of Howard<br />\nRead and Dave Thompson. The<br />\npair took first place in the New<br />\nYork University Annual Debate<br />\nTournament, April 23-24.<br />\nThe banquet ended with presentation of the customary gavel<br />\nto past-President Fibel for his<br />\ntwo years of service and an<br />\naward to the council's advisor.<br /><br />\nin by 9 a.m. ... Out by 3 p.m.<br /><br />\nRECORDS<br />\nMONO and STEREO<br />\n• CLASSICAL • FOLK • POP<br />\n• SPOKEN • JAZZ • IMPORTS<br />\nLargest Selection Anywhere<br /><br />\nDISCOUNT PRICES<br />\nESOTERICA OUR SPECIALTY<br />\nNAT BARNETT'S<br /><br />\nHI Fl RECORD SHOP<br />\nFREE PARKING<br /><br />\n2580 McCULLOH STREET<br /><br />\nNo. 9-6100<br /><br />\nYou Can Count on Us... Quality Costs No More at Sears<br />\nr.<br /><br />\nSEARS<br />\nROEBUCK AND CO<br /><br />\npit<br /><br />\nThe Fun Way<br />\nto Co Places • •<br />\nSears Italian<br />\nMade Scooter<br /><br />\nVIVA!<br />\nSears Compact<br />\nMotor Scooters<br /><br />\n3-speed foot shift is a breeze<br />\nHandsomely<br />\noperate.<br />\nto<br />\nstyled by Puch of Austria.<br />\n60-in, long, with large, comfortable seats. 100-miles per<br />\ngallon, 3.9-HP 2-cycle engine with individual brakes.<br /><br />\n•<br /><br />\n,f4,<br />\n• •.•,,....<br /><br />\nSears Cruisaire<br />\nMotor Scooters<br /><br />\nSears 3 Stores<br />\n,AT THESE FINE STORES<br /><br />\nBig 5HP Engine<br /><br />\nDELAWARE<br />\nMilford, H. S. Saunders Jeweler<br />\nNewark, J. J. Minster &amp; Son<br />\nWilmington, Jewel Box<br /><br />\n*339<br /><br />\nNo Money Down On Sears Easy Payment Plan<br />\nMARYLAND<br />\nAnnapolis, Tilghman Co.<br />\nCo.<br />\nBaltimore, James It. Armiger<br />\nJewelers<br />\nCumberland, Barnes Custom<br />\nElkton, J. J. Minster &amp; Son<br />\nFrederick, Colonial Jewelry Co.<br /><br />\nALLSTATE MO-red for Two-Wheel Fun<br />\nHere's the economical way to travel. Get 150 miles per gallon of<br />\ngas, 31 mph, on this 2-speed shift<br />\nthriller. 2.2 HP.<br /><br />\nSears Price<br /><br />\nSears .5 Stores<br /><br />\nThousands of tourists tour Europe on this Scooter every<br />\nsummer! Front coil spring, rear shock absorber and huge<br />\ncoil-spring saddle soak up the jolts. Takes you up any hill<br />\na car can, lots of places a car can't. Double action brakes,<br />\nheavy-duty clutch, 4-speed transmission.<br />\nPhone Sears for FREE Demonstration Ride;<br /><br />\nWheaton, Winthrop Jeweler*<br />\nSears 8 Stores<br /><br />\nVIRGINIA<br />\nPalls Church, Winthrop JIrs.<br />\n4'<br /><br />\nP.M.<br />\nSEARS 3 SUPER SERVICE STATIONS OPEN MONDAY THRU SATURDAY 'TIL 9:30<br /><br />\nShop at Sears and Save<br />\nSatisfaction Guaranteed or Your Money BackS<br /><br />\nNORTH AVE.<br />\nBElmont 5-3960<br /><br />\nMONDAWMIN<br />\nLAfayette 3-2521<br /><br />\nRITCHIE HI-WAY<br />\nSTate 9-6700<br /><br />\nPAGE FOUR<br /><br />\nNEWS-LETTER<br /><br />\nZip .31ohns *opkitts Nettio-tottr<br />\nJ. Caleb Deschanel<br />\nWilliam Schenck<br /><br />\nEditors-in-Chief<br />\nJames M. Freedman<br />\nBusiness Managers<br />\nEdward Stern<br /><br />\nI<br /><br />\nBOARD OF CONTROL<br />\nAssociate Editor<br />\nJohn M. Bri,kman<br /><br />\nAssociate Editor<br />\nRobert Livernash<br />\nEditorial Writer<br />\nCurt Zimansky<br /><br />\nFeatures Editor<br />\nHenry James Korn<br />\nNews Editor<br />\nPhotograph Editor<br />\nMel Shuster<br />\nJay Amshey<br />\nContributing Editor<br />\nJim Mongiardo<br />\nAssociate Start<br />\nCharlie Bon Tempo..<br />\nChristopher Molloy...<br />\nJohn Chott.<br />\n„—<br />\nGarth<br />\nAlan Mitchell.<br />\nBarry Farber<br />\nJames Meginniss<br />\nHenry Hocherman<br />\nMichael Phillips<br />\nCharles Vermont<br /><br />\nManaging Editor<br />\nGreg A Itschuh<br />\nSports Editor<br />\nMarshall Paul<br />\nCopy Editor<br />\nJohn Sweeney<br />\nCirculation Chief<br />\nMusic Critic<br />\n__Asst. News Editor<br />\nNews Editor<br />\nAsst. News Editor<br />\nAsst Feature Editor<br />\n__Asst. Features Editor<br />\n.Asst. Features Editor<br />\n..Asst. Sports Editor<br />\n...Political Writer<br /><br />\nReporters<br />\nNews: Jerry Ruark, William Mitchell, Robert Craven: Features: Charlie<br />\nAllegrone, Ed Elias, Evade; Hays, Steve Zito: Sports: Iver Mindel, Stanley<br />\nKatz, Walter Sienkiewicz: Photography: James Barber; Business: Andrew Wallach, Bob Blazer. Paul Joseph, Richard Nozemack. Allan Eudell,<br />\nStephen Kramer, Richard Friedman: Composition: Joel Goldstein. Copy:<br />\nDil 71 iel Cole.<br /><br />\nFreedom?<br />\nBut is there any meaningful worth to our academic<br />\nfreedom? Do we gain anything from the obviously inadequate advising system, from the distinction between<br />\nmajors and concentrates, from the lack of administrative organization on the undergraduate level?<br />\nOur academic freedom really seems to he the result of neglect and lack of interest, and there does not<br />\nsem to be any way in which we as undergraduates profit<br />\nform it.<br />\nShould we not be willing to sacrifice some autonomy for closer supervision over our academic activities, creation of a dean of undergraduate affairs, with<br />\nadditional lower level administrators and a professional<br />\nstaff of advisors, and the abolition of the concentration?<br />\nThe implied choke is clear: do we prefer academic neglect or a eommittment on the part of the<br />\nuniversity to take a closer interest in our academic<br />\nlives?<br />\nIf asked to state what they felt was the greatest<br />\nstrength of this university, many undergraduates, after<br />\nlong and torturous thought, would say \"the freedom.\"<br />\nWhat they usually mean is that, unlike an undergraduate at Harvard or Swarthmore, et. al., the Hopkins<br />\nman is permitted to leave the dormitories if he wishes<br />\nafter his freshman year and live in a fraternity or an<br />\napartment.<br />\nWhether this freedom is the result of design or<br />\nneglect on the part of the administration is not particularly meaningful as long as there is no change.<br />\nWhat the Undergraduate Long Range Planning<br />\nCommittee is now considering is the effect of change<br />\non this freedom, first in the context of co-education,<br />\nsecond in the area of curriculum.<br />\nIn this light they have developed a distinction between social and academic freedom. Social freedom,<br />\nliving in apartments or fraternities, seems to he highly<br />\nregarded by most undergraduates and should not be<br />\nlightly forsaken.<br />\nA SPRING TRIBUTE TO GOUCHER<br />\nToo long the Hopkins man has lived.<br />\nassailed by norks and often snibbed<br />\nby fantasies of Portami. (Puzzled, puss?<br />\nIt's just the plural of Portamus.)<br />\nBut in this quandary, he is saved<br />\nby dreams of Goucher girls.<br />\ntheir countenance so duly played<br />\nwith troom beneath their golden curls.<br />\nOh girls of Goucher, shining bright!<br />\nI think of you most every night,<br />\nand of the gentleness and grace<br />\nwhich you belie with grimfuld face;<br />\nand of the incapacity<br />\nthat can't be yours with such loquacity<br />\nand of your sprightly feminosity,<br />\nanhancing primsical precocity.<br />\nAnd of your sparkling wit,<br />\nand of your firmly rounded personality.<br />\nBut do not think me very naughty<br />\nto praise the goodies you embody.<br />\nOh girls of Goucher, shining bright/<br />\nthe Portamus can never harm me<br />\nwhen with such wonders you do charm<br />\nsaid neither can the nork, nor dark:<br />\nI think of you and want to snark!<br />\nI.<br /><br />\nme.<br /><br />\nBy T. S. Pook8<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 30, I 96.1<br /><br />\nThe diametaaaci Scene<br />\nConscientious Objections<br /><br />\nBy HENRY KORN<br />\nual assimilation into American in the Hopkins Theatre of OpThe United States Army, of pop-folk culture. For once Terry erations as well. In addition to<br />\nlate, has taken a lot more in the and the Pirates recognize the periodically staffing a Public)<br />\near than orders. In addition to danger of the \"dirty V.C.\" (as Relations outpost in the upper<br />\nits manifold problems with the they have been doing for more lobby of Levering Hall, our own<br />\nViet Cong, a small but spirited than months now) the American home-grown military elite. The<br />\nband of Hopkins Guerrillas has public just might begin to take Pershing Rifles, have established<br />\nmade its presence felt. Without the whole thing seriously,<br />\nthemselves as campus minutepretentious brass, inflexible loyOne of the year's leading toys men. This newly formed military<br />\nalties on congressional approval has been Mattel's \"Monkey Ba- arm of the radical right would<br />\nwe defeated the cream of the tallion\" sets. These sets include have disappointed the General.<br />\nAmerican Army on it's home- all the paraphenalia needed for<br />\nDoubtless he would rather<br />\ngrounds of West Point.<br />\nbackyard<br />\ncounter-insurgence. have seen the boys riding horses<br />\nA West Point Cadet might find The fortunate owner receivers than the hoods of automobiles<br />\nit difficult to conceive of anyone (hand-carried to the toy store (in attempting to prevent anwhose experience with firearms down a back alley trail) plastic other campus group to leave for<br />\nis limited to the kind made by grenades, demolition kits, com- Washington), but then we must<br />\nMarx and Mattel rather than munications equipment and a change with the times and do<br />\nWinchester and Remington, yet good assortment of automatic what we can.<br />\nthere is a certain jaded pleasure weaponry. It has been over two<br />\nYet the sudden realization that<br />\nderived from viewing the Army years since an enterprising film<br />\na great part of The United States;<br />\nat a range no closer than Ser- magnate released a movie called<br />\n\"Yank in Vietnam.\" No doubt a Army is made up of guys who<br />\ngeant Bilko.<br />\ndropped out of your high school,<br />\nFor almost equally as danger- rerelease would do very well now. led by some of the stuff that<br />\nous as the actual escalation of<br />\nThe Army has done no small walks around here in R.O.T.C.<br />\nthe Vietnamese war is its grad- amount of napalmless flaming uniforms, gives cause for worry.<br /><br />\nDrama<br /><br />\n'Stormers'Electra a Qualified Success<br />\nBy JON GREEN<br />\n'she suffers none of the Dane's ing, considering that the BarnLike<br />\nCaptain stormers have divided there<br />\nElectra, presented by the Barn- indecisiveness.<br />\nstormers last Friday and Satur- Ahab, she pursues a killer with forces and are presently workday evenings, was well acted but monomanioal intent. As Electra, ing on the Fantasticks. Therewas too wordy and diffuse to be Jan Kramer gave a beautifully fore the steady and promising<br />\nmodulated<br />\nperformance. work of the remainder of Electra<br />\npresented and enjoyed at Hop- well<br />\nkins. The play, written in 1937 Most of her weaker moments cast warrants particular attenby Jean Giraudoux, is a very came came in Act II in her tion: Mark Wentworth as the<br />\nFrench treatment of the classi- scenes with Clytemnestra, played Chief Judge demonstrated concal story of Electra, Orestes, and by Margo Miller. Miss Miller also siderable comic ability but was<br />\nfamily. In it Giraudoux investi- brought her character alive; and not as pompous and stodgy as his<br />\ngates the inevitable oonict be- as a woman whose insane hat- role required. Ellen Sheiner<br />\nCissi<br />\nEikov<br />\nmov e d<br />\ntween \"uncompromising justice\" red and coldness was buried un- and<br />\nand political reality. The investi- der great charm and grace, she nicely, tittered well, and defitely<br />\ndressed the stage in their roles<br />\ngation uncovers no definite an- did very well.<br />\nswer, and the side issues which<br />\nAlso adding excellent charac- as Furies. Mat Clary's Orestes<br />\nare raised in passing are not ful- terization were Bruce Fagin, had many good moments, as did<br />\nly developed.<br />\nAegisthus; Sue Ellen Gordon, Jerry Feldman playing the CapAgatha;<br />\nand Betsy Levy, Narses's tain of the Guard.<br />\nThe acting in the play was unwife.<br />\nThe high quality of the actAll in all, Electra was a triiformily good; and the director,<br />\nMrs. Laurleen Pratt, deserves ing of the six people mentioned umph for the actors but not for<br />\nmuch credit for her astute cast- above, is nothing short of amaz- the Barnstormers.<br />\ning. The pace, interaction of the<br />\ncast, and immaginative costumes<br />\nmade the evening a minor success. Mrs. Pratt failed, however,<br />\nto cut the play effectively; and<br />\nher blocking emphasized the<br />\nstatic nature of the play. Also,<br />\nshe did not utilize large areas<br />\nof the stage, but concentrated<br />\nthe action on the sides of the<br />\nstage. This last weakness may<br />\npartially be attributed to the in- By CHRISTOPHER MOLLOY pass with increased maturity. His<br />\nThe most obvious observation ornament was very deft and<br />\nstark<br />\nteresting<br />\nset.<br />\nyet<br />\nUnfortunately, the Barnstormer's in this year's concert is the enor- graceful, and the long right hand<br />\nset designer, Rick Wessler, re- mous improvement that Roman trill was far superior to ,the<br />\nportedly was hampered by a piti- Rudnytsky has made. He has earlier left hand one—again an<br />\nfull small budget and meager just attained the quality that is Indication of immaturity.<br />\nequiptment. The other technical appropriate for public concerts.<br />\nThe crescendos of a Sonata<br />\nAlberto<br />\naspects of the production, the If he continues to improve at by<br />\nGeastrea<br />\nwere<br />\nenormous<br />\nthis<br />\nrate<br />\nwell<br />\nmay<br />\nhe<br />\nhandled well. In the second<br />\nlighting and sound effects, left<br />\nbe one of our generation's out- movement of the Ginestera, he<br />\nmuch to be desired.<br />\nstanding talents. Still he needs played soft nervous rhythms<br />\nThe philosophical background much more polish to enter a with<br />\na delicate interpretation<br />\nof Electra was supplied by the competitive environment. Like that showed<br />\ngreat promise. The<br />\nbeggar (god) and the gardener, most student performers, he third and fourth<br />\nmovements<br />\nplayed by David Ricci and John lacks the stage presence to put were a return to his<br />\nrecurrent<br />\nSweeney, respectively. The beggar over a fully successful recital.<br />\nproblems of sacrificing tone for<br />\nperformed the vital function of<br />\nAgain he opened with Bach. volume and tempo for drama.<br />\nleading the audience to the He gave a good statement of his<br />\nHe closed the program with<br />\n\"truth\" through a maze of con- type of interpretation, developflicting statements. Mr. Ricci's ing unity soon after he began. three Chopin war horses; Ballade<br />\npo-trayal and interpretation were His second selection was a Schu- No. 4 in F minor, op. 52, Nocnearly flawless. What impressed bert Sonata. Although he had turne in C Sharp minor, op. 27<br />\none most were the warmth, sen- difficulty with a left hand trill, No. 1, and Polonaise in A Flat<br />\nsitivity, and humor which the he showed that his technique is major, op. 53. Chopin is an<br />\naudience received from his char- singularly his forte; he failed to artist's artist, and brought out<br />\nacterization.<br />\ndevelop coherency in the pass- some of the befit in Rudnytsky.<br />\nHere he showed technical excelMr. Sweeney gave the evening ages of tonally comparative<br />\nlence and rich emotional referIts most perfect moment, when phrases. He showed a moment of ence that<br />\nsurpass his expressive<br />\nhe appeared in front of the cur- near brilliant polish in a very control,<br />\nbut this can be, and<br />\ngraceful<br />\ntransition<br />\nback<br />\nto<br />\nhis<br />\ntain at the beginning of Act II<br />\nwas, forgivable in the Ballad and<br />\nand delivered the gardener's soli- main theme in the third move- Nocturne. The<br />\nPolonaise is someloouoy. This speech suggested ment, but lost it in a very rough thing else.<br />\nthat the answer to everyone's coda.<br />\nHe showed much better grasp<br />\nWhen a concert pianist atproblem is simple—love. Unforof tonal variation in Beethoven's tempts a war horse as horsey<br />\ntunately, suggesting that love is<br />\nSonata in A major, op. 101, as this, he must be able to put<br />\nthe answer to Eleotra's problems<br />\nthough he still shows an in- it over with superior brilliance<br />\nis, at best, a gross oversimplifiability to sustain a long quiet and ease. Roman Rudnytsky<br />\ncation.<br />\npassage with grasp of its inter- cannot do this, at least not yet.<br />\nThe Furies and fate irrisistably pretive value. Close to this probhe improves as much in the next<br />\ndrive Electra to her date with lem were his rapid crescendos; year<br />\nas he did in the last he will<br />\njustice. Although caught in a they swooped down with all the be an<br />\naccomplished artist. We<br />\ntrap of alternatives similar to menace of squalls. These are should look<br />\nforward to another<br />\nthe dilema confronting Hamlet, problems of control and should return.<br /><br />\nMusic<br /><br />\nPianist Lacks Polish;<br />\nTechnique Rated Good<br /><br />\nHOMEWOOD,<br /><br />\nBALTIMORE, APRIL 30. 1965<br /><br />\nNEWS-LETTER<br /><br />\nItirritag Itios Kihrrabit<br />\nThe Committee On Decent Exposure tC.O.D.E.) tracing it's origins to last year's 'Clothe The<br />\nDumb Animals . Movement\" of<br />\nNew York City elucidates it's position on Hefner's Brand of Naked Lunch.<br />\nWe the members of CODE.<br />\nseek to destroy the myth that the<br />\nAmerican college man looks to<br />\nHugh Hefner for his social and<br />\nmoral values. We protest any<br />\nsubscription to what we view as<br />\nan attempt to inundate and capitalize on what we view as a potentially sincere and healthy liberalization of American social<br />\nvalues. We see the average Playboy reader as:<br />\n1) Average<br />\n2) Pretending an enjoyment of<br /><br />\nKnave Shows<br />\nThe staff of The Johns Hopkins News-Letter proudly announces that it's entry in the<br />\nA.P.O. UGLY MAN CONTEST:<br />\n\"The Knave\" has garnered third<br />\nplace in an unprecedented display of campus revulsion. Alsorans include Dave Norby who<br />\nwon the contest, Bob Miller who<br />\nfinished second fs,nd Pete Light<br />\nof Beta who is the newly crowned fraternity ugly man.<br /><br />\nClass of '67<br />\nAll sophomores interested<br />\nin serving on a Planning<br />\nCommittee for next year's<br />\njunior class activities, please<br />\ncontact Jim Mongiardo, Box<br />\n885.<br /><br />\nthird rate fiction by first<br />\nrate authors<br /><br />\nOrchestra Provokes<br />\nTremendousResponse<br />\nBy CHRISTOPHER MOLLOY<br /><br />\nPAGE FIVE<br />\n141114441101110310111111111111110111110;1144111i11111011111141101111111111011111081WHIMINII01511111111111114101M111111111111104111WOHNIMIIMIIIIIIIiianimosalse<br /><br />\nSEND FLOWERS FOR<br />\nMOTHER'S DAY, MAY 9th.<br /><br />\nIt is not very often that an<br />\nSave money and place order now.<br />\n3) Who believes Al Hirt is a<br />\nAmerican audience can be moved<br />\njazz artist<br />\n4) Is a junior executive on the to stand up and cheer at a concert. The Munich Bach chorus<br />\nway up<br />\nFLORISTS<br />\nand Orchestra under Karl Rich5) Or a frustrated ass-man on<br />\nter drew this enthusiastic re3224<br />\nSt. Paul St.<br />\nBE. 5-7855<br />\nthe way down<br />\nsponse from a very sparse audi'<br />\n,<br />\nCODE. is a non - sectarian. ence of hard core music lovers ';iNtliiiiiihhilimillipsio!iillili111141111111114111111uitollisii0011111101111111111H111111111111011111111111lilliiiiiiIoniaminvitoolimihilln1W111111111111111111011110ift-,non-political, non-profit organi- at the Lyric Theater last Tueszation that welcomes members day. Their B Minor Mass was<br />\nexquisite. Although they were<br />\nfrom all sides of the sexual/phil- obviously not accustomed to the<br />\nosophical spectrum to join this acoustics of the theater, they<br />\nmass-based protest against Hef- turned out a dynamic performners own conception of concep- ance that deserved much more<br />\ntion. Specifically we protest:<br />\nthan their one night.<br />\n(By the author of<br /><br />\nBOB GRAHAM INC.<br /><br />\nOn<br /><br />\nThrough the entire first half,<br />\n1) The using of Johns Hopkins<br />\nUniversity for a public air- the contrabasses dominated the<br />\ning of Mr. Hefner's person- performance. With little percussion they should have been heavy<br />\nal publicity.<br />\nbut obviously they couldn't hear<br />\n2) His sophistication of the<br />\nhow loud they were. Also over<br />\nmonth club\"<br />\nbalanced were the second vio3) The admission to Shriver to lins, violas, and altos. These<br />\nanyone not holding a gold thornes were all ironed out for<br />\nthe second half, and the conkey<br />\nductor's battle was no longer a<br />\n4) The absence of Bunnies on<br />\nlosing one. Among the soloists<br />\nthe debating panel.<br />\nalto Hertha Toepper, tenor Ernst<br />\nCODE. offers a cup of bitter Haeflinger, and violinist Otto<br />\nhemlock to Philospher Hugh.<br />\nBuchner were particularly fine.<br /><br />\nPoetry and Music<br />\nFestival<br />\n(Evergreen House—April 30, May 1)<br /><br />\nBink Noll<br /><br />\nSTUDENTS!<br /><br />\n\"The Center of the Circle\" 3.95<br /><br />\nOf course you can<br />\nget a cash loan!<br /><br />\nNight Voyage 1.00<br /><br />\nCampus,41,<br />\n\"Rally Round the Flag,Boys!<br />\n\"Dobie Gillis,\" etc.)<br /><br />\nTESTS,AND HOW THEY GREW<br />\nJust the other night I was saying to the little woman,\"Do'<br />\nyou think the importance of tests in American colleges is<br />\nbeing overemphasized?\". (Incidentally, the little woman is<br />\nnot, as you might think, my wife. My wife is far from a little woman. She is, in fact, nearly seven feet high and mantled with rippling muscles. She is a full-blooded Ogallala<br />\nSioux and holds the world's shot put record. The little<br />\nwoman I referred to is someone we found crouching under<br />\nthe sofa when we moved into our apartment back in 1928,<br />\nand there she has remained ever since. She never speaks<br />\nexcept to make a kind of guttural clicking sound when she<br />\nis hungry. To tell you the truth, she's not too much fun to<br />\nhave around the house,but:with my wife away at track meets<br />\nmost of the time, at least it gives me someone to talk to.)<br />\nBut I digress. \"Do you think the importance of tests in<br />\nAmerican colleges is being overemphasized?\" I said the<br />\nother night to the little woman, and then I said, \"Yes,<br />\nMax, I do think the importance of tests in American colleges is being overemphasized.\" (As I explained, the little<br />\nwoman does not speak, so when we have conversations, I<br />\nam forced to do both parts.)<br />\nBut I digress. To get back to tests—sure, they're important, but let's not allow them to get too important. There<br />\nare, after all, many talents which simply can't be measured<br />\nby quizzes. Is it right to penalize a gifted student whose<br />\ngifts don't happen to fall into an academic category? Like,<br />\nlor instance, Finster Sigafoos?<br />\n•<br /><br />\nEric Sellin<br />\nRobert Hazel<br /><br />\nPoems, 1951-1961 1.65<br /><br />\n•Our new LOANS TO<br />\nSTUDENTS SERVICE is.<br />\ndesigned especially for you.<br /><br />\nErlend Jacobsen<br /><br />\n•Monthly repayments will<br />\nbe arranged to suit your<br />\nparticular circumstances.<br /><br />\nJulia Randall<br /><br />\n•Stop in or 'phone ... We'll<br />\nbe glad to serve you.<br /><br />\nWilliam Burford<br /><br />\n77 Antipoems 1.00<br />\nMimic August 3.00<br />\nMan Now 2.50<br /><br />\nRitter6 jpnce<br /><br />\nElliot Coleman<br /><br />\nBroken Death 3.00<br /><br />\n313 N. Howard St.<br /><br />\nAvailable at<br /><br />\nBaltimore<br />\nPhone SA. 7-7880<br /><br />\nThe Johns Hopkins Bookstore<br /><br />\nHours: Mons., Tues. &amp; Weds. 9-5<br />\nThurs. 11-8; Fris. 9-6<br /><br />\nPo is a full-blooded<br />\nOgallala Sioux.<br /><br />\nGilman Hall N<br /><br />\nUNIVERSITY McGILL<br />\nMontreal, I'anada<br /><br />\nECOLE FRANCAISE D'ETE: 30 juin-12 aout 1965<br />\nCoors de longue et de litterature. NOUVELLE SECTION DE CIVILISATION Possibilite de preparer un M.A.<br />\nNOMBREUX PROFESSEURS INVITES des grondes universites francoises et nord-omericaines,<br />\nresidont a la Cite universitaire avec les etudionts les octivites paroscoloires.<br />\nSolles de cours climatisees. Laboratoire de longues ties moderne. Pour renseignements:<br />\necrire a Mlle. J. Solliec, Secretaire.<br /><br />\nFinster, a freshman at the Wyoming College of Belles<br />\nLettres and Fingerprint Identification, has never passed a<br />\nsingle test; yet all who know him agree he is studded with<br />\ntalent like a ham with cloves. He can, for example, sleep<br />\nstanding up. He can do a perfect imitation of a scarlet tanager. (I don't mean just the bird calls; I mean he can fly<br />\nsouth in the winter.) He can pick up BB's with his toes. He<br />\ncan say \"toy boat\" three times fast. He can build a rude<br />\ntelephone out of 100 yards of string and two empty Personna Stainless Steel Razor Blade packages. (This last accomplishment is the one Finster is proudest of—not building<br />\nthe telephone but emptying the Personna packs. To empty<br />\na Personna pack is not easily accomplished, believe you me,<br />\nnot if you're a person who likes to get full value out of his<br />\nrazor blades. And full value is just what Personnas deliver.<br />\nThey last and last and keep on lasting; luxury shave follows<br />\nluxury shave in numbers that make the mind boggle. Why<br />\ndon't you see for yourself? Personnas are now available in<br />\ntwo varieties: a brand-new stainless steel injector blade for<br />\nusers of injector razors—and the familiar double-edge stainless steel blade so dear to the hearth and kind to the kissers<br />\nof so many happy Americans, blades so smooth-shaving, so<br />\nlong-lasting that the Personna Co. makes the following<br />\nguarantee: If you don't agree Personna gives you more luxury shaves than Beep-Beep or any other brand you might<br />\nname, Personna will buy you a pack of whatever kind you<br />\nthink is better.)<br />\nBut I digress. Back to Finster Sigafoos— artist, humanist,<br />\nphilosopher, and freshman since 1939. Will the world ever<br />\nbenefit from Finster's great gifts? Alas, no. He is in college<br />\nto stay.<br />\nBut even more tragic for mankind is the ease of Clare de<br />\nLoon. Clare, a classmate of Finster's, had no talent, no<br />\ngifts, no brains, no personality. All she had was a knack for<br />\ntaking tests. She would cram like mad before a test, always<br />\nget a perfect score, and then promptly forget everything<br />\nshe had learned. Naturally, she graduated with highest<br />\nhonors and degrees by the dozen, but the sad fact is that<br />\nshe left college no more educated and no more prepared to<br />\ncope with the world than she was when she entered. Today,<br />\na broken woman,she crouches under my sofa.<br />\nC1966, Max Sbulmaa<br /><br />\nSpeaking of tests, we, the makers of Personna®, put<br />\nour blades through an Impressive number before we<br />\nsend them to market. We also make—and thoroughly<br />\ntest—an aerosol share that soaks rings around any<br />\nother lather4 Burma Share', regular and menthol.<br /><br />\nNEWS-LETTER<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 30, 1965<br /><br />\nWard Named Royal Fellow<br /><br />\nCoach Tabs Netters'Better,'<br />\nHold 4th Place With 1-4 Log<br /><br />\nPAGE SIX<br /><br />\nHefner Here Sunday<br />\nTo Bare Sex Facts<br />\n(Continued from Page 1)<br />\n1963 he adressed the National<br />\nAcademy of Television Arts and<br />\nSciences. In the winter of 1963,<br />\nhe<br /><br />\nwrote and appeared in a<br /><br />\nseries of thirteen half-hour television lectures entitled \"Introducing Theology.\" He is the<br />\nauthor of a forthcoming paperback bok which will include studies of the writing of James Baldwin, Albert Camus, and Hugh<br />\nHefner.<br /><br />\nDr. John C. Ward, Professor<br />\nof Physics at the University, has<br />\nbeen elected a Fellow in the<br />\nRoyal Society. He will be formally inducted into Britain's oldest<br />\nscientific society at a London<br />\nceremony in April.<br />\nBorn and educated in England,<br />\nDr. Ward attended Oxford University, Merton College and received his Ph.D. degree there in<br />\n1949. He has been engaged in<br />\nresearch and teaching in the<br />\nUnited States since 1951.<br />\nA member of the Institute of<br />\nAdvanced Study at Princeton<br />\nUniversity from 1951-'52, 1953'54 and 1960-'61 Dr. Ward has<br />\nalso taught at the Carnegie Institute of Technology, the UM-<br /><br />\nWANTED: Coin collections of all denominations<br />\nU.S. Gold, and all foreign coins.<br /><br />\nversity of Miami, and the Universe Libre de Bruxelles, Belgium.<br />\nDr. Ward joined the Hopkins<br />\nfaculty in 1961. Among his major<br />\npublications are the discovery of<br />\n'Ward's Identity,\" a mathematical identity which facilitates renormalization of quantum electro-dynamics.<br />\nIn 1960, he published a paper<br />\nwith Abdul Salam on unitary<br />\nsymmetry. This paper constituted<br />\na major breakthrough in the<br />\nstudy of elementary particle physics. His study of the \"combinational method,\" published in the<br />\n1955 Theoretical Physics Journal,<br />\nis closely related to research in<br />\nferromagnetism<br />\nFor further information, please<br />\ncontact George S. Wills, Johns<br />\nHopkins University, Office of<br />\nPublic Relations, HO. 7-3300, Ext.<br />\n221, 222.<br />\nA Favorite Rendez Wu<br />\nfor Hopkins Men<br /><br />\nJIMMY WU'S<br /><br />\nComplete line of subs and cold beer.<br /><br />\nB &amp; M SUB SHOP<br /><br />\nNEW<br />\nCHINA INN<br />\nCharles Street below 25th<br />\nJIMMY WU'S<br />\nCARRY OUT SHOP<br />\n1411 E. Cold Spring Lane<br /><br />\nCH 3-9294<br /><br />\nGuilford and 31st<br /><br />\nBy WALTER SIENKIEWICZ<br />\nThe fourth-place varsity tennis team figures to improve its<br />\n1-4 record when it crosses racquets with Washington College<br />\ntomorrow afternoon.<br />\nThe netmen, under Coach Tom<br />\nMcDermott, picked up their only<br />\nwin to date against Western<br />\nMaryland but looked a great deal<br />\nbetter than they had for two<br />\nseasons.<br />\nIn this 7-1 victory, top man<br />\nJoe Sorrow won 6-1, 6-0; Mark<br />\nEllenbogen won 7-5, 6-2; Bob<br />\nChilders went 4-6,6-0,8-6; John<br />\nLowe won 6-4, 6-4; and Rick<br />\nJelovsek defeated his man 6-1,<br />\n6-3.<br />\nWin Doubles<br />\nTwo of the Jay doubles combinations won, while the number<br />\nthree doubles match was called<br />\nbecause of darkness.<br />\nBob Childers put in the best<br />\neffort of the day. Losing the<br />\nfirst set, he lumbered back to<br />\nshut his opponent out in the second. Childers pushed on in the<br />\ntight third set, eventually taking<br />\nit 8-6.<br />\nAgainst Haverford on Parent's<br />\nDay, Hopkins was defeated 61/2-<br /><br />\n2. The long meet was tense<br />\n5 1/<br />\nnevertheless. Sorrow seemed to<br />\nhave trouble with his softer-playing opponent. Only after<br />\ntwenty-seven games, 6-3 and 108, did Sorrow take Hopkins' only<br />\nsingles match.<br />\nGive Exhibition<br />\nThe number two doubles combination of Ken Larsen and Johr.<br />\nLowe also gave the spectator.)<br />\nan interesting match. After taking the first set 6-4, the div)<br />\nslipped up on the second 3-6<br />\nAnd then a long third set began<br />\nLasting close to an hour. As<br />\ndarkness rolled in, the match<br />\nwith the final set at 8-8 was<br />\ndeclared a tie.<br />\nIn the return match with<br />\nLoyola this Tuesday, the varsity<br />\nwill seek to avenge its earlier<br />\n6-3 loss to the Greyhounds.<br />\nThe freshmen tennis team<br />\nbrought its record to 1-1 with an<br />\neasy 7-2 victory over Baltimore<br />\nPolytechnic.<br />\nIn the winning column were<br />\nKit Battenfield (6-2 and 6-3).<br />\nGeorge Miller (6-1 and 6-3)<br />\nScott Black (6-1 and 6-1), and<br />\nWalt Sienkiewicz (6-1 and 6-0).<br />\nDuos of Roger Evans and Battenfield, Dave Millstone and<br />\nDennis Clements, and Ken Luck..<br />\nman and Sienkiewicz gave Hopkins the three doubles matches.<br /><br />\nCLASS RINGS<br />\nOrders for rings will still be taken t<br />\nat the Student Shop for the remainder<br />\nof the semester. Rings will be sent<br />\n'C.O.D.. to home address. Any information—at Student Shop. Monday<br />\nthru FridaY.<br /><br />\nCOTTAGE FOR RENT<br />\n3 bedroom, 2 baths, Govans,<br />\nwest of York Rd.<br />\nFurnished<br /><br />\nor unfurnished<br /><br />\nID 5-3948<br /><br />\nTHE WORLD'S BEST!<br />\n... because there is more preci-<br /><br />\nA NEW PROGRAM OF INTEREST TO<br /><br />\nsion-built quality in every Schwinn..<br />\nThat's why \"Schwinn Bikes Are<br />\nBestl\"<br /><br />\nMEN<br />\nIt Isn't easy to become an—officer in die United<br />\nStates Army.Only the best young men are selected.'<br />\nThe training and course of study are demanding.i<br />\nBut if you can qualify—and you should find out,<br />\nif you can—you will receive training which will put<br />\nyou a step ahead of other college graduates. Armyi<br />\nROTC training will give you experience that most<br />\ncollege graduates do not get—in leading and man-1<br />\naging other men, in organizational techniques, in<br />\nself-discipline and in speaking on your feet. This<br />\nkind of experience will payoff in everything you.<br /><br />\nit Ci-f your life.<br />\nArmy ROTC has a new program designed specifically for outstanding men who already have<br />\ntwo years of college, and plan to continue their<br />\ncollege work. During your junior and senior years<br />\nin this program, you will receive $40 per month.<br />\nWant to find out more about the program? Simply<br />\nsend in the coupon below, or see the Professor of<br />\nMilitary Science if you are now attending an<br />\nROTC college. There's no obligation—except the<br />\none you owe to yourself,/<br /><br />\n'10 the<br /><br />\nVARSITY<br /><br />\n—10 SPEED<br /><br />\nEasy<br />\nTerms<br /><br />\nIfyoul're good-enough to be an Army Officer,, don't settle for less<br />\n1E11<br /><br />\nProfessional styling, Handbrakes,<br />\nracing handlebars, racing saddle,<br />\nSprint derailleur, and nylon cord:<br />\nhigh pressure tires.<br /><br />\nARMY ROTC<br />\nBox 1040, Westbury, New York 11591<br /><br />\n'Gentlemen: Please send<br /><br />\nme information on the new 2-Year Army ROTC Program. I am<br /><br />\nEXPERT REPAIRS<br />\nPICK-UP &amp; DELIVERY<br /><br />\nnow a student at<br /><br />\nA<br /><br />\n(college or university) and plan to continue my schooling at<br /><br />\nPR I NCETcyv<br /><br />\nName<br />\nAddres;<br />\nState<br /><br />\n_Zip Code--<br /><br />\n-<br /><br />\nCYCLE &amp; SKI CO.<br />\n5304 PARK HEIGHTS AVE.<br /><br />\nHOMEWOOD, BALTIMORE, APRIL 30. 1965<br /><br />\nNEWS-LETTER<br /><br />\nTight Defense, 3-Goal Final Quarter<br />\nGive Trossmen Win Over Cadets<br />\nArmy<br /><br />\nSyracuse<br /><br />\n(Continued from Page 8)<br />\nexplained. \"It was very low scoring for a major college contest<br />\nwith only nine goals being<br />\nscored.\"<br />\nBlattner To Start<br />\nJoe Blattner earned himself a<br />\nstarting post on defense by sutting out Bill Ritch. The Army<br />\nsenior had scored seven goals<br />\nagainst Hopkins in two previous<br />\ngames.<br />\nDick Bower limited Bob Johnson, the Cadets' leading scorer,<br />\nto one shot and no goals. Frank<br />\nSzoka did a good job on Tim<br />\nVogel, the number-one Army<br />\nmid-fielder.<br /><br />\n(Continued from Page 8)<br />\nmounting his total saves to thirteen, the last period was all Hopkins'. The defense buckled down<br />\nand held Army scoreless.<br />\nThe Jays went ahead to stay<br />\nwhen Darrell took a feed from<br />\nPfeifer for their fourth goal.<br />\nNine minutes later Darrell came<br />\naround from behind the net and<br />\nadded another point when his<br />\nshot, partially blocked by Army<br />\ngoalie John Cullen. dribbled into<br />\nthe goal. The marker was his<br />\ntenth of the year.<br />\nPfeifer, on a pass from Darrell,<br />\ngot Hopkins' final goal with less<br />\nthan a minute to go.<br /><br />\nFrosh Batsmen Close Season;<br />\nMeet Frederick, Glen Burnie<br />\nThe freshman baseball squad<br />\nends its short season with two<br />\nhome games this weekend, one<br />\ntoday at 3:30 against Frederick<br />\nHigh School, the other tomorrow<br />\nafternoon at 1:30 against Glen<br />\nBurnie High School.<br />\nThe contingent brings a 1-3<br />\nrecord into today's encounter,<br />\nbut the statistics are not a good<br />\nindication of the team's quality<br />\nand potential, according to Coach<br />\nSam Case. Well-balanced, the<br />\nteam features consistent hiters,<br />\ngood fielders and excellent pitchers.<br />\nLack Practice<br />\n\"We played our first game before we had our first\" practice\",<br />\ncommented Case. \"The squad is<br />\na good, hard-working one but<br />\nhas been hurt by the weather.\"<br />\nThis past week. for example,<br />\npractice was called off, and varsity games took up the field<br />\non Tuesday and Thursday. Thus<br /><br />\nthe Jays had only Wednesday to<br />\nget ready for today's game.<br />\nThe bulk of the hitting has<br />\nbeen supplied by Dave Thomas,<br />\nWebster Gray, Jim Ca111, Pete<br />\nMartindale, and Mike Shaw.<br />\nThe mainstay of the pitching<br />\nstaff is Erie Javel, who has<br />\npitched 18 of the team's 30 innings so far. In one effort, he<br />\nfanned 11 batters in 6 and 2 innings. Rounding out the pitching are Rob Snyder, Dan Frey,<br />\nand Wally Siggers.<br />\nLists Roster<br />\nThe rest of Case's lineup is as<br />\nfollows: Charles Allegrone, outfield; James Buchanan, first<br />\nbage; Aldrich Davis, second base;<br />\nJames Easter. first base; Dave<br />\nKomocki, shortstop; Bill Mitchell,<br />\nouteld. Also listed are Tom Mobley, catcher; Ron Smith, outfield; and William Thorn, outfield.<br />\nLast season the freshman diamonders played only two games,<br />\nlosing both.<br /><br />\nLibrary Concerts<br />\nRecorded concerts in the Gar- Thursday. May 6. 1965<br />\nret Room of the new library.<br />\n, Opera highlights: Wagner<br />\nMonday, May 3, 1965<br />\nVerdi<br />\nBallet highlights: Copelia, DeFriday. May 7. 1965<br />\nlibes. Les Sylphides<br />\nOrchestra music made popular<br />\nTuesday, May 4, 1965<br />\nby Glenn Miller<br />\nDvorak: New world symphony<br />\nPrado: Exotic suite of the<br />\n(Ray McKinley &amp; Jerry Gray)<br />\nAmericas<br />\nWednesday, May 5, 1965<br />\nPar away places exotic music:<br />\nSUB, SUB, SUB,<br />\nHarpsichord and orchestra<br />\nGuitar duo<br />\nSHAKE, SHAKE, SHAKE<br /><br />\nII II<br /><br />\nZEPP PHOTO CENTERS<br />\nThe Friendly Spot<br />\nto Photo Shop<br />\n3042 Greenmount Ave.<br /><br />\nII III<br /><br />\nIII<br /><br />\nDEFY GOLDFINGER!<br />\nGot your passport —<br /><br />\nGot your health certificate<br />\nGet your<br /><br />\nINTERNATIONAL<br />\nSTUDENT ID CARD!<br />\nThen, a student ship to<br />\nEurope will be a fascinating<br /><br />\nexperience.<br />\nBook your passage with us — ask<br />\nfor special folder and student jobs<br />\nin Holland.<br /><br />\nThey've landed the Marines<br />\nHarry's Little Submarines<br /><br />\nWrite: Dept. 007,<br /><br />\nfor<br /><br />\nU.S. NATIONAL<br />\nSTUDENT ASSOCIATION<br /><br />\nHARRY LITTLE<br />\nCarry-Out SHOPS<br /><br />\n265 Madison Avenue<br />\nNew York, N. Y. 10016<br /><br />\n407 East 32nd Street<br /><br />\nTowson Plaza<br />\n111<br /><br />\nYou don't need an<br />\nengineering degree to figure out<br />\nwhy this cordless shaver<br />\ncosts a bit more.<br /><br />\nAll you need<br />\nare whiskers.<br />\nJust run the cordless<br /><br />\nA profitable summer of study<br />\nand recreation...<br /><br />\nOF LONG ISLAND UNIVERSITY<br /><br />\nApplications now being accepted for<br /><br />\nTWO 5-WEEK SUMMER SESSIONS<br />\nJUNE 21 to JULY 23; JULY 26 to AUGUST 27<br /><br />\nDay and Evening<br />\nAccelerate your degree program<br />\nwith a distinguished visiting<br />\naid resident faculty, outstanding laboratory<br />\nand library facilities.<br />\nGRADUATE COURSE offerings<br />\nin the Graduate Schools of<br />\nLong Island University<br />\ninclude studies in Biological<br />\nSciences, Business Administratiell,<br />\nEducation, English, Guidance and<br />\nCounseling, History, library Science,<br />\nMathematics, Music Education,<br />\nPhysics, Political Science,<br />\nSociology, Speech.<br /><br />\nLocated on the beautiful North Shore<br />\nof Long Island, the 270-acre campus<br />\nIs just 30 minutes from the World's Fair,<br /><br />\n60 minutes from midtown Manhattan.<br /><br />\nEnjoy swimming, tennis, riding, bowling,<br /><br />\nealk.• wow<br /><br />\nREMINGTOINI<br /><br />\nLEKTRON1C 11 Shaver through our<br />\nbeard. Then feel for whiskers.<br />\nThis alone will tell you why our<br />\nshaver costs a bit more. Still, if you<br />\nwant more facts, read on.<br />\nThe LEKTRONIC II has the biggest<br />\nshaver head in the business. With<br />\n756 working slots, things get done<br />\nin a hurry.<br />\nOn top of the shaver head are<br />\n4 tiny rollers. They make sure only<br />\nwhiskers disappear. Not skin.<br />\n348 cutting edges take care of that •<br />\nfast disappearing act. Honed from<br />\nsurgical high-carbon steel, these cutters<br />\nstart sharp, stay sharp.<br />\nAdd to this the sideburn trimmer:<br />\na straightedge tucked under the<br />\nhead case that gives you a neat,<br />\nfinishing touch.<br />\nThen there's the cordless feature.<br />\nWorks on rechargeable energy cells.<br />\n(Also works with a cord, if you forget<br />\nto recharge.) So you can shave where<br />\nand when the itch hits you. Frees you<br />\nfrom sockets and wet sinks.<br />\nSo, you can easily see why it costs<br />\na bit more. Even if you can't add or<br />\nhandle a slide rule.<br /><br />\nCAAT.POST COLLEGE<br /><br />\nUNDERGRADUATE<br />\nCOURSE offerings<br />\nInclude studies in<br />\nLiberal Arts and Sciences,<br />\nPre-Professional,<br />\nPre-Engineering,<br />\nBusiness and Education.<br /><br />\nPAGE SEVEN<br /><br />\nFtEMINGTON<br />\n'<br /><br />\n5S)<br />\n- UAW Stdat<br /><br />\nELEV.,<br /><br />\noutdoor plays and concerts on the campus.<br />\nNearby are famous beaches, sailing clubs, summer<br />\nstock theatres, parks and golf courses.<br /><br />\n•<br /><br />\nNew men's and women's residence halls,<br />\nAPPLY NOW...Admission open to VISITING STUDENTS<br />\nfrom other accredited colleges.<br />\nFor additional information, summer bulletin and<br />\napplication, phone 516 MAytair 6-1200 or mail coupon<br />\n.........................................<br /><br />\nDean of Summer School, C. W.Post College, P.O., Greenvale,LI., N.Y.11548<br />\nPlease send me Summer Sessions information bulletin.<br />\nCP<br />\n[] Men's Residence Hall<br />\nD Women's Residence Hall<br />\nIJ Graduate<br />\nLI Day<br />\n1.3 Evening<br />\nID Undergraduate<br /><br />\ne<br /><br />\nName.......................................................<br />\nAddress......................................................<br /><br />\nState<br /><br />\nCity<br />\nIf visiting student,from which<br /><br />\nLir I kON,_<br /><br />\ncollege'<br />\n.<br /><br />\nrry<br /><br />\n.4<br /><br />\nSP<br /><br />\nNEWS<br /><br />\nLETTER<br />\nHOMEWOOD, BALTIMORE, APRIL 30, 1965<br /><br />\nNEWS-LETTER<br /><br />\nPAGE EIGHT<br /><br />\nStickers Gunning For 8th Straight<br />\nTomorrow<br />\nSyracuse<br />\nJays<br />\n.<br />\nFace<br />\nI<br />\nBatsmen<br />\nVarsity<br />\nI Pitching Woes Plague<br />\npacking 6-3 Victory Over Army<br />\nHank Schaefer, who has been should add some stability to the<br />\nmaking good progress lately team's unsettled infield situation.<br />\nIts miseries magnified by an<br />\ndespite a painfully injured arm.<br />\nAfter Saturday's encounter, the<br />\naching mound staff. the varsity<br />\nStanley<br />\nTo<br />\nReturn<br />\nJays<br />\nhost Loyola Wednesday at<br />\nWashbaseball team travels to<br />\nRumors of the season loss of 3:00 and journey to Towson<br />\nstill<br />\ntomorrow<br />\nCollege<br />\nington<br />\nSaturday. Last<br />\nnext<br />\nshortstop Dick Stanley were dis- State<br />\nseeking its initial victory.<br />\nspelled when Barrette announced Wednesday's game with Lebanon<br />\nThe previous week's action—<br />\nthat the 5'-8\" senior is expected Vali.ey was cancelled and will<br />\nencounters with Western Maryback within a week. His return not be replayed.<br />\nland, Gettysburg. and Ursinus—<br />\ndid little to boost hopes of a<br />\nHopkins' diamond<br />\nsuccessful<br />\ncampaign. The squad fell by respective 10-1, 8-0, and 9-2<br />\nmargins to the three clubs.<br />\nBy MIKE PHILLIPS<br /><br />\nLacrosse History<br /><br />\nPitching Collapses<br />\nEven pitching, the Jays' one<br />\nusual source of strength, collapsed. About the only competent<br />\nperformance was Frank Soriano's<br />\nfive-inning relief stint against<br />\nUrsinus. Arnie Michelson, Merlin<br />\nBatt, and Soriano himself were<br />\nthoroughly combed in starting<br />\nroles.<br />\nPart of the hill staff's problems can be traced to the past<br />\nIveek's schedule, which saw the<br />\nJays play three games in four<br />\ndays.<br />\nThis hampered any attempt<br />\nby Coach Gary Barrette to man<br />\nan effective bull pen and made<br />\nit necessary for the starters<br />\n(with the exception of Batt) to<br />\ngo the route, even if hit hard.<br /><br />\nSport In 78th Year At Hop;<br />\nJay 'Crossers Set U.S. Pace<br />\nTaken from 1965<br />\nJ.H.U. spring sports<br />\nLacrosse at Hopkins, one of<br />\nthe nation's intercollegiate leaders in the sport, got off to an<br />\ninconspicuous start with the formation of a stick club on October<br />\n10, 1882. Elgin Gould, from the<br />\nUniversity of Toronto, was the<br />\nfounder.<br />\nIt took until 1888 before Hopkins was officially represented in<br />\nlacrosse. That year it won the<br />\nfirst of its 417 victories, drubbing<br />\nthe Patterson, a club outfit, 6-2.<br /><br />\nWon Title<br />\nOnce the sport was given official recognition, Hopkins quickly<br />\ngot into the championship act.<br />\nIn 1891, the Blue Jay's second<br />\nseason in the Intercollegiate Lacrosse league, Hopkins won<br />\nRuns Come Hard<br />\nlaurels with a 6-0 slate.<br />\nThe team's run-scoring ability<br />\nThat was the first of seven uncontinued at its low level, as evi- defeated campaign. During the<br />\ndenced by the past week's play. past seventy-seven years, Hopkins has registered fifty-eight<br />\nThe Gettysburg game was the<br />\nsecond time this year that Hopkins had been held to one hit.<br />\nLacrosse Broadcast<br />\nThe<br />\nHopkins-Syracuse laLooking things over. Barrette<br />\ncrosse game will be broadcast<br />\nnoted that soph right fielder Ray<br />\nlive from Syracuse, New York,<br />\nWier is hitting at a steady clip,<br />\non WJHU, 830 k.c. Air time is<br />\npacing the club with a .375 av1:55.<br />\nerage. He also praised catcher<br /><br />\nST. PAUL CLEANERS<br />\nTailoring - Repairing - Dyeing<br />\nSame Day Pressing<br />\nComplete Laundry Service<br />\n32ND &amp; ST. PAUL ST.<br />\nBELMONT 5-4413<br /><br />\n*<br /><br />\n********<br /><br />\n***<br /><br />\nWe need your head In our<br />\nbusiness<br /><br />\nshutouts, the last over Loyola<br />\nCollege, 20-0 in 1960. It has only<br />\nbeen blanked six times; has had<br />\nfifty-two winning seasons; fifteen losing; while ten were even<br />\nsplits.<br />\nAlong with its 417 wins, Hopkins has lost 167 games and tied<br />\nfteen—a '71.4 percentage. The<br />\nJays lead every major rivalry but<br />\nMount Washington Club (12-302. and Navy (16-20-1).<br />\nIn Olympics<br />\nNot only has Hopkins won or<br />\nshared<br />\ntwenty-five<br />\nnational<br />\nchampionships, but it has twice<br />\nrepresented the U.S. in the<br />\nOlympic Games. The Blue Jays<br />\nwon special playoff series in both<br />\n1928 and 1932 to earn trips to<br />\nAmsterdam and Los Angeles,<br />\nwhere both times they brought<br />\nthe world championship back to<br />\nthe Homewood Campus.<br /><br />\nLife Guard<br />\nStudents desiring a position<br />\nas life-guard at the new pool,<br />\nplease contact Coach William<br />\nKlarner in the athletic center.<br />\nThe position is salaried, and<br />\nstudents will be pic.rmitted to<br />\nwork a maximum of ten hours<br />\nper week. Senior life-saving<br />\ncertification is required.<br /><br />\nArmy<br /><br />\nSyracuse<br />\nBy JIM MANGIARDO<br />\nWith an attack that is still<br />\nhobbling and a defense which has<br />\nproven that it can do the job<br />\nwhen called upon, the varsity<br />\nlacrosse team travels north tomorrow to challenge an ambitious Syracuse club.<br />\nSyracuse, which usually schedules just teams from the Ohio<br />\nand New England areas, has<br />\nplayed the Jays only four times.<br />\nThe last contest was in 1963<br />\nwhen Hopkins edged the visitors<br />\n10-7.<br />\nReturning from that team<br />\nwhich gave the Jays this battle<br />\nare Duncan Crowther, Tom Kennedy, Barry Loucks, and Art<br />\nMarkusen.<br />\nNominated All-America<br />\nCrowther is Syracuse's nomination for All-America this year.<br />\nThe midfielder scored two<br />\ngoals and had an assist in the<br />\n1963 game. Kennedy, another<br />\nmidfielder, also had a goal in<br />\nthe fray.<br />\nCompleting the starting midfield for the Orangemen is<br />\nLoucks. Markusen will start on<br />\ndefense. The man to watch on<br />\nthe Syracuse attack is Al Smoral,<br />\nan underclassman.<br />\n\"Syracuse will play the same<br />\nsort of game that Yale played,\"<br />\nCoach Bob Scott predicted.<br />\n\"They are hard hitting and will<br />\ndo a lot of personal dogging.\"<br />\nLook Ahead<br />\n\"It will be very easy for the<br />\nteam to think ahead to Navy as<br />\nwe thought of Army in the<br />\nWashington College game. But<br />\nwe will have to remember that<br />\nwe have to play real well to win.<br />\nWe just can not lower ourselves<br />\nto their level as we have done<br />\nconsistently this year against ou<br />\nminor competition.\"<br />\nAfter his brief talk about his<br />\nopposition this weekend, the<br />\ncoach went on to discuss his<br />\nteam's play against Army. Hopkins upset the Cadets by pouring in three goals in the final<br />\nperiod to break a 3-3 tie.<br />\n\"It was an unusual game,\" he<br />\n(Continued on Page 7)<br /><br />\nSt. Paul Barber Shop<br />\nAcross from Eddie's<br /><br />\n********************************<br /><br />\nIN THE NATION'S CAPITAL<br />\nAT THE GEORGE<br />\nWASHINGTON UNIVERSITY<br /><br />\nSURF BOARDS<br />\nFactory seconds--variety of colors<br /><br />\nA program designed to make<br />\nthe unparalleled resources of<br />\nWashington, D.C. available to<br />\nstudents in other colleges and<br />\nuniversities.<br /><br />\n$55.00 to $75.00<br /><br />\nBAY LAMINATES Inc.<br /><br />\nJUNE 14-JULY 21<br />\nJULY 22-AUGUST 27<br /><br />\nTHE SAFE WAY to stay alert<br />\nwithout harmful stimulants<br /><br />\nRenting to JHU Students<br /><br />\nFeaturing New Fords<br />\nSpecial Weekend Rates<br /><br />\nYOU CAN EARN UP TO 14 HOURS OF<br />\nCOLLEGE CREDIT WHILE<br /><br />\nSTUDYING<br />\nTHIS SUMMER<br /><br />\n3120 St. Paul St.<br /><br />\n1799 McGuckian St.<br />\nAnnapolis, Md.<br /><br />\nBy IVER MINDEL<br />\n•<br />\nNewsletter Correspondent<br />\nThe varsity lacrosse team put<br />\na check on Army's highly touted<br />\nattack Saturday as it scrambled<br />\nto a 6-3 victory, Hopkins' seventh straight.<br />\nThe encounter was the Jays'<br />\nbest defensive effort of the campaign. Their defensive trio—<br />\nHank Kaestner, Mike Oidick, and<br />\nJoe Blattner—stayed in action<br />\nthe entire fray and didn't commit a single foul to boot.<br />\nKaestner covered the Cadets'<br />\nAll-American attackman Toni<br />\nSheckells, while Oidick was on<br />\nRay Enners. Starting in place of<br />\ninjured Denny Townsend. Blattner guarded third-string AllAmerican Bill Ritch.<br />\nArmy Scores First<br />\nScrapping characterized most<br />\nof the play. At ten minutes in<br />\nthe first period, the Cadets drew<br />\nfirst blood when second-midfielder Jim Tillman took Enners'<br />\nfeed and scored.<br />\nA<br />\nminute<br />\nlater, Hopkins<br />\nbruised Army's defense with a<br />\nmarker of its own—on a pass<br />\nfrom Skip Darrell to Stan Fine.<br />\nWhen Jerry Pfeifer, playing on<br />\na sore leg, assisted Chip Giardina at eight minutes in the second period. Coach Bob Scott's<br />\ncharges went ahead.<br />\nTie Game<br />\nSheckells retaliated, however,<br />\nby scooping up a loose ball and<br />\nslamming it into the goal unassisted.<br />\nIn the third period, Al Huston.<br />\nwho played both crease attack<br />\nand second midfield, took a pass<br />\nfrom Herb Better and converted<br />\nIt into a goal. Again Sheckells<br />\ntied it up for Army, picking up<br />\nanother ground ball and scoring.<br />\nWith goalie John Dashiells<br />\n(Continued on Page 7)<br /><br />\nNOD0zTM keeps you mentally<br />\nalert with the same safe refresher found in coffee. Yet<br />\nNoDoz is faster,handier,more<br />\nreliable. Absolutely not habitforming. Next time monotony<br /><br />\nmakes you feel drowsy while<br />\nstudying, working or driving,<br />\ndo as millions do... perk up<br />\nwith safe, effective NoDoz<br />\nKeep Alert Tablets.<br />\nAnother floe product of Grove Laboratories,<br /><br />\nRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRxRx.Rx<br /><br />\nNational Car Rental System<br /><br />\navailable at<br /><br />\n1915 N. Howard Street<br />\n539-3990<br /><br />\nTHE GREENWAY PHARMACY<br />\nCharles and 34th Streets<br /><br />\nhi<br />\nhi<br /><br />\nhi<br />\nhi<br /><br />\nRidtaRxRaRxRxRxRxRxRxRxRxRxRxRxRxRxRxRaRxRxRxRx.Rx<br /><br />\n•Special 3-week workshops le<br />\nEducation begin June 14,<br />\nJuly 6, and July 26<br />\n• Air-conditioned classrooms,<br />\nlibrary and residence hall<br />\n• Urban campus just four<br />\nblocks from the White House<br />\nwrite for catalogue:<br />\nDean of the<br />\nSummer Sessions<br />\nThe George<br />\nWashington<br />\nUniversity<br />\nWashington, D.C.<br />\n20006<br /><br />"}], "field_media_file": [{"target_id": 40122, "display": null, "description": null, "target_type": "file", "target_uuid": "a81e0740-15c1-4bf3-8d42-4be6813a9212", "url": "http://digital.library.jhu.edu/system/files/2022-03/13875-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13875, "target_type": "node", "target_uuid": "be7d0bd1-f665-4fcd-9c63-097ca693f1c7", "url": "/node/13875"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4b88b8cf-734a-4f2d-be11-1ad22fee95cd"}]}