{"mid": [{"value": 37027}], "uuid": [{"value": "ddab292b-364b-4fdd-894a-821ec0f5f8a6"}], "vid": [{"value": 37027}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:58:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13147-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:58:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:58:13+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "tE<br />\n<br />\nVOL. XXIX, No it /<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 2, 1924<br />\n<br />\nMAJ. A. C. McBRIDE WILL WALTER H. PAGE SCHOOL<br />\nCAMPAIGN BEGINS IN<br />\nINSPECT R. 0. T. C.<br />\nNEW YORK<br />\nUNIT DECEMBER 8<br />\nPreliminary Survey of Entire Corps Representatives from Hopkins Attend<br />\nto Determine if It is Worthy of<br />\nBanquet to Launch Drive for<br />\nFunds of New School<br />\nFinal Review in May<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nHOPKINS, 0-MARYLAND, 0 IN<br />\nSTATE CHAMPIONSHIP GAME<br />\n<br />\nPICTURES AND WRITE-UPS CHAMPIONSHIP UNDECIDED FOR SECOND<br />\nNow that the excitement of the<br />\nDr. Frank J. Goodnow, Dr. C.<br />\nOF CAMPUS LEADERS<br />\nSTRAIGHT YEAR—FAILURE OF TEAMS TO<br />\nbig Army-Navy football game is K. Edmunds, and Dr. John H.<br />\nSENT TO PAPERS<br />\nover, R. O. T. C. men must turn<br />\nSCORE DISAPPOINTING TO LARGE CROWD<br />\nLatane, attended a dinner at the<br />\ntheir serious attention/ to a visit<br />\nBoard Begins Far-reaching<br />\nCentury Club in New York, Mon- Publicity<br />\nDrive to Advertise Hopkins.<br />\nBlue Jays Use Huddle System in Exciting Last Quarter<br />\non December 8th by Major A. C.<br />\nActivities Featured<br />\n24th,<br />\ngiven<br />\nto<br />\nthe<br />\nday,<br />\nNovember<br />\n\" March After Injury to Taylor<br />\nMcBride, who is the officer in<br />\nPublicity<br />\n\"Activities<br />\nof<br />\nthe<br />\nare<br />\nestablishing<br />\na<br />\nwho<br />\ntrustees<br />\ncharge of R. 0. T. C. affairs for<br />\nTwo teams, both determined to win, met at the Stadoum on Thanksthe Third Corps Area. On the day $1,000,000 fund for the founding Board have been steadily increas- giving Day and when the battle was over neither had had their<br />\nappointed he will go over the class- of the Walter Hines Page School ing since the opening of school, desires and hopes satisfied, the scoreboard reading Hopkins, 0;<br />\nroom work of the unit in the morn- of International Relations at Johns though the amount of work which Maryland, 0. They had battled the year before to a 6 to 6 tie. The<br />\nhas been done has not made any<br />\ning and will inspect the drill and<br />\nHopkins. The dinner was attended apparent showing in the minds of game was played before an audience of 18,000 persons, the largest<br />\npractical work in the afternoon.<br />\ncrowd that has ever witnessed a contest between the two foreThe purpose of the Major's visit by twenty men of nation-wide many students,\" James Young,<br />\nmost Maryland universities. Hopeditor-in-chief, said yesterday.<br />\nWill be to determine, according to prominence.<br />\nkins used the \"huddle\" system to<br />\nBIG<br />\nRALLY<br />\nALUMNI<br />\nSTAGE<br />\nThe dinner was given by John J. Photographs have been taken of<br />\nhis judgment, whether or not the<br />\na great extent after Taylor had<br />\nON EVE OF MARYLAND<br />\nR. 0. T. C. men at Hopkins are Carty, vice-president of the Amer- about fifteen men by the Bachbeen forced from •the game beGAME<br />\nworthy of being considered at a ican Telephone and Telegraph Com- rach Studio for publicity purposes.<br />\ncause of an injured head. Both<br />\nfinal inspection to be held in May. pany, and it was at this dinner that An arrangement has been made to Bonfire and Parade Mark Pre-game teams were well supported by<br />\nRites of Annual Contest<br />\nThis final inspection is conducted an active campaign for raising the photograph the different campus<br />\ntheir cheering sections throughleaders<br />\nand<br />\nfaculty<br />\nmembers.<br />\nAn alumni get-tOgether, a bon- out the entire game.<br />\na.nnually by a board of officers who money was launched formally. This<br />\nact as judges in deciding if Johns was the first gathering of the trus- These prints are sent to the news- fire, and a parade featured the preTurnbull's punting was of exHopkins may be rated for the sea- tees and it marked the beginning papers in Baltimore and a copy of (Tame activities held last Wednesceptionally high calibre. His kicks<br />\nson as a distinguished college of their effort to reach the goal of each is retained for the Publicity<br />\nday. The meeting of the alumni averaged 42 yards. Turnbull, and<br />\namong others of the nation, in so $1,000,000 which is deemed neces- Board files. As soon as the prints<br />\nfar as its R. 0. T. C. unit is con- sary to make the school a reality. are sent to the newspapers, a was the most successful in years. Captain Magill were both playing<br />\nsons of Hopkins,<br />\nwrite-up of each man concerning Four hundred<br />\ncerned. \"This means careful trainPurpose of School<br />\ntheir last game for the Black and<br />\ndifferent<br />\nstates, gathtwenty<br />\nfrom<br />\nThe Page School will be one his activities and career on the<br />\ning and strict discipline on the part<br />\nEngineering Hall. Blue. Hopkins played a defensive<br />\nof each student,\" Lieutenant Sher- which will, primarily, study and in- campus is sent to them for their .red in the Civil<br />\ngame waiting for the breaks.<br />\nwood said. \"Particular attention vestigate the various phases of in- files. The object of this is to have Classes represented ranged from<br />\nwell-rememberthe<br />\neighties<br />\nto<br />\nthe<br />\nMaryland scored 12 first downs<br />\nshould be paid to uniform and ternational relations. The charac- material on file for immediate use.<br />\nselec- as compared with four for the J.<br />\nfew<br />\nAfter<br />\na<br />\n'24.<br />\nclass<br />\nof<br />\ned<br />\nter,<br />\nscope,<br />\nand importance of this Results do not often come from<br />\nequipment.\"<br />\nschool was emphasized at the meet- this type of work immediately, tions by the Glee Club had helped H. U. The Farmer line outHopkins Ranks Hifth<br />\nA gold star worn on the uniform ing, and it was pointed out that the but the nature of it is quite fa- to put the assemblage in a recep- weighed the Black and Blue.<br />\nIS the symbol of distinction won at proposed school will follow the lab- vorable publicity for the Univer- ive frame of mind,\"hot dogs\" and<br />\nWhen Besley and Pugh gained practicalthe annual inspections in May. The oratory or seminary method of sity whenever the opportunity real beer were served.<br />\nR. 0. T. C. at Hopkins has at- study, much as they have been ap- arises to use the picture and the these had done their deadly work ly all of the ground for the Colthe old grads, headed by Walter lege Parkers, in fact, with the extained this honor four times.\"<br />\nplied in the other schools - at Hop- material.<br />\nB. Swindell, came tearing out of ception of one play when Hall<br />\nSpeaking of the attitude of the kins.<br />\nOut-of-town Publicity<br />\nhowls, carried the pigskin, these two men<br />\nMembers of the faculty and grad- The names, addresses and ac- the building with war-like<br />\nstudents to Major McBride, Lieuin a<br />\nthe<br />\nfield<br />\nwound<br />\nonto<br />\nand<br />\ntenant Sherwood said: \"We have uate students, it was explained, will tivities of all out of town men are<br />\nhad the football on every play.<br />\ndance.<br />\nsnake<br />\ntwisting<br />\nwrithing,<br />\nalways been pleased to have the devote themselves largely to inves- being prepared for publicity purThere were few substitutions<br />\nWhen they arrived on the scene<br />\nMajor inspect us. Each year he tigation and research of the vari- poses. Newspapers in the towns<br />\nanother snake made during the game. Curly<br />\ncomes to Johns Hopkins he im- ous phases of international rela- from which the students come, are of action they found<br />\nmore enthusi- Byrd sending in Bonnett for<br />\nlarger<br />\nif<br />\nnot<br />\npresses us with the fairness of his tions. The results will be published listed with the respective names. dance,<br />\nastic, which comprised nearly half Bromley, while Hopkins due to<br />\ndecisions and the heaftiness of his for the benefit of the public.<br />\nThe intention is to send news arco-operation.\" On the day of the<br />\nAlthough the campaign has so ticles to the different towns, tell- the undergraduate body. The injuries substituted Almy for<br />\nbonfire with the usual atMajor's visit a review will be held far been one of education only dur- ing what the student is doing, huge<br />\nBlandi ; Milanausky for Oles, and<br />\nfeatures of the gallows<br />\ntendant<br />\nin his honor, followed by such work ing the summer and fall months, what department of the school he<br />\nbearing the image of Maryland Lawrence for Taylor. The Blue<br />\nas is regularly scheduled for that subscriptions and pledges totaling<br />\nis in, the organizations to which<br />\ndelight as Jays' aerial attack showed conday.<br />\nnearly $100,000 have been sent in, he belongs and such other favor- and the usual yells of<br />\nThey<br />\nwas already nearly siderable improvement.<br />\nWhen Major McBride comes to said Dr. Finley, one of the trus- able publicity as will present the it caught fire<br />\nlight both completed three out of four trys.<br />\nwaning<br />\nby<br />\nits<br />\nand<br />\nover;<br />\nHopkins this year he will find a tees. • This sum indicates the wide- name of Johns Hopkins.<br />\nlines wound over the field.<br />\nThe Homewood eleven during<br />\nunit that has found it necessary to spread approval with which the<br />\nWork for the corning winter inParade Goes Down-town<br />\nContinued on page 3, col. 3.<br />\nContinued on page 3, col. 3<br />\nthe last quarter made a very sericludes publicity for the BarnSoon the cry of \"Downtown !\"<br />\nous<br />\nattack on the Farmers' goal.<br />\nstormers, the Musical Clubs, June<br />\nwas raised on all sides, and a long<br />\nOLD NEWS-LETTERS OF LATE NINETIES<br />\nWeek and the Blue Jay Twin Six.<br />\ncolumn,four abreast, swung down Hopkins had the ball on its own<br />\nREVEAL LITERARY FLAVOR OF PA,PER In fact, the purpose is to advertise Charles street, headed by Ralph 30-yard line. Lawrence began the<br />\nthe varions non-athletic activities<br />\nThat a distinctly literary tone workout and had beaten Warfield. which support the Publicity Board Townsend and his accomplices advance with a gain of 3 yards.<br />\nPervaded the original News-Let- College at Sykesville by 27 points. in a financial way through the Ac- and by six members of the Band. Turnbull passed to Mallonee, who<br />\nThe first stop was Goucher. After had travelled 35 yards before beter is shown by several \"first<br />\nEven during the last gasps of tivities Council, with news and<br />\ncopies\" in the possession of Dr. the nineteenth century, Freshmen pictures in newspapers in this sec- an enthusiastically received out- ing brought to the ground. On a<br />\nburst, the parade again got under<br />\nCarol Van Buren Wight, of the were a source of worry. The fac- tion of the East.<br />\nway. The next halt was unex- double pass Almy made eight<br />\nClassical Department.<br />\nulty had set themselves up as the<br />\nLast year's efforts show that pected. News had arrived that a around left end, and Lawrence<br />\nThe issue of November, 1898, protectors of the humble Frosh, the Board when properly directed<br />\nMaryland parade, coming up gained five more and a first down.<br />\nWhen the publication was barely a much to the distaste of the Sopho- was able to get across more news<br />\nCharles, was only about two Almy fumbled but recovered.<br />\nYear old, contained an article on mores. The News-Letter, true or- and pictures for the activities than<br />\nblocks distant. With some effort,<br />\n:Student Life in Japan,\" recount- gan of the campus, voiced the has ever been accomplished in the crowd was persuaded to re- With the ball on U. of Md.'s 30yard line Turnbull tried a droping the rise of the Japanese educa- opinion that \"this rivalry which previous years.<br />\nfrain from physical violence, and<br />\ntional system, a review of Rud- now finds no expression is not<br />\nMeetings are being held every when the two columns passed, the kick but it did not quite come<br />\nin<br />\nwithout<br />\nvalue<br />\nits<br />\npromoting<br />\n.Yard<br />\nDay's<br />\nKipling's \"The<br />\nMonday and arrangements are be- only show of hostile feeling was between the goal posts. Hopkins<br />\nWork,\" and Dr. Wight's first pub- class spirit and adding spice to ing made to move 'immediately an exchange of blood-thirsty had made its first attempt at goal<br />\nlished work, a • translation of college life.\"<br />\ninto Room 22 of the Sub-base- threats. Progress continued to in the first quarter when Doug<br />\nGoethe's \"Mignon.\"<br />\nJohn C. French, now of the ment of the Chemistry Labora- the Stafford, where a \"Hullabaloo made a try from the 40-yard line.<br />\nDuring the final minutes of play<br />\nUndergraduate activities of the English Department, was Editor- tory.<br />\nfor Dr. Goodnow\" was given; and<br />\nboth<br />\nteams were fighting harder<br />\nlate \"nineties\" play their part in in-Chief of the News-Letter, and<br />\na block further the parade was<br />\nthese early issues. In November, John Philip Hill was Exchange<br />\nthan<br />\nduring<br />\nany other part of the<br />\nyells.<br />\nfew<br />\na<br />\nafter<br />\ndisbanded<br />\nNOTICE<br />\ncontest.<br />\nHopkins<br />\ngot into trouble<br />\nof1898, the Varsity football team Editor in 1898.<br />\nthe<br />\nof<br />\nend<br />\nthe<br />\nmarked<br />\nThis<br />\nGrades of the psychological<br />\nhad defeated Western Maryland<br />\ntest given to entering freshmen<br />\nUntil 1911 the News-Letter apficial ceremonies, but word was when a short punt hit a Blue Jay<br />\nwill be given out at Room 401,<br />\n10 to 0 at Electric Park. Earlier peared spasmodically, but at this<br />\npassed to returning groups that and a Maryland player recovered<br />\nGilman, at the following times:<br />\nin the season Maryland Agricul- time the support of local and naMonday, Wednesday and ThursMaryland was painting the cam- the spheroid. Maryland then had<br />\nday from 12.00 to 1.00 P. M.;<br />\ntural College had been outclassed tional advertisers warranted a<br />\npus, but the large crowd which The ball on their own 40-yard line.<br />\nand Tuesday and Friday from<br />\nmay<br />\nin a 16 to 0 tilt. A \"Scrub\" aggre- weekly publication. It gradually<br />\nsoon gathered at Homewood fore- Besley and Pugh made two first<br />\n4.00 to 5.00 P. M. Marks<br />\nbe obtained until the Christmas<br />\nstalled any such attempt which downs and kept on until when the<br />\ngation had shown great ability by gained power and in 1920 assumed<br />\nHolidays.<br />\nmay have been planned.<br />\nContinued on page 4 col. 3<br />\ndefeating Marston's in a 53 to 0 its present semi-weekly form.<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS - LI.:1TER, DECEMBER 2, 1924<br />\n<br />\nThe Johns Hopkins News-Letter<br />\n<br />\nProf. J. T. Thompson to Head U. S.<br />\nPublic Roads Bureau<br />\nInvestigation<br />\n<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all artidles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nTelephone<br />\n<br />\nHomewood 0100<br />\n<br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALGER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\n<br />\nHOPKINS TO CO-OPERATE<br />\nWITH U. S. ROADS<br />\nBUREAU<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\n<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\n<br />\nCirculation Manager<br />\nOTHO J. KELLER, III, '26<br />\n<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br />\n<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT if. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 2, 1924<br />\n<br />\nPOST MORTEM<br />\nThe honor of victory on the gridiron was claimed by neither<br />\nJohns Hopkins nor the University of Maryland on Thanksgiving<br />\nDay. Again the State Championship remains undecided. There<br />\nare no apologies on either side for the tied score. None are needed.<br />\nBoth teams fought hard. The players gave their best in the struggle. With that we are content.<br />\n<br />\nA co-operative agreement between the Johns Hopkins University and the United States Bureau<br />\nof Public Roads, Department of<br />\nAgriculture, Washington, D. C.,<br />\nhas just been entered into for research upon the elastic properties<br />\nof concrete under the action of<br />\nrapidly applied loads.<br />\nIt was determined by the Bureau at its experimental station at<br />\nArlington, Virginia, a few years<br />\nago, that the force applied upon<br />\na concrete pavement by a moving<br />\nvehicle was several times as great<br />\nas that applied by the same vc<br />\nhide standing still. This \"dynamic increment,\" commonly<br />\ncalled \"impact,\" is due to inherent<br />\nroughness in the pavement and<br />\nthe wheels of the vehicle, causing the wheels to actually jump<br />\nclear of the pavement in many<br />\ncases and then, under the action<br />\nof gravity and flexed springs, to<br />\nstrike the pavement a severe blow.<br />\nThe value of this impact load is<br />\nnow susceptible of fairly accurate measurement.<br />\nFrom other experiments conducted at the same station, it is<br />\nalso believed that material such as<br />\nconcrete, whose elastic properties<br />\nare well known under static conditions, behave differently when<br />\nsubjected to rapid applications ot<br />\nloads.<br />\nThe whole question of proper<br />\nconcrete highway design, involving the expenditure of millions of<br />\ndollars, depends upon accurate<br />\nknowledge of these elastic properties.<br />\nThe investigation will be in<br />\ncharge of Professor J. Trueman<br />\nThompson of the Civil Engineering Faculty, who has been serving for the past four summers in<br />\nthe capacity of Highway Research<br />\nSpecialist in the Bureau of Public Roads. The testing apparatus,<br />\ndesigned by Professor Thompson,<br />\nwill be built in the University<br />\nshops beginning immediately and<br />\nwill be located in the \"Concrete<br />\nLaboratory,\" C. E. Building.<br />\n<br />\nToo much credit cannot be given to the team and to the coaches.<br />\nTo the team, naturally, goes our unanimous praise and vote of appreciation. A heavier team, conceded the odds in every department of<br />\nthe game, failed to score against the Hopkins squad. This fact in<br />\nitself speaks for the calibre of a Hopkins eleven. The Band and<br />\nthose loyal rooters who followed the game also deserve a share of<br />\nthe praise. After praise-giving to these elements, too many of us PLAY BY PLAY ACCOUNT OF<br />\nGAME<br />\nare likely to forget others to whom credit is due.<br />\nFootball games, it has been said, are won and lost on the practice<br />\nfield. The success of any team when it gets in a game depends<br />\nlargely on the character of the practice it has had, for no matter how<br />\nstrong the offensive tactics may be, a team is well on the way to<br />\ndefeat when its defense is weak. It is the maltreated, forgotten<br />\n\"scrub,\" who, to those not too well informed, keeps in because he<br />\nhasn't sense enough to quit, that turns out the well rounded varsity<br />\nteam. The scrub player is absolutely essential. In many cases the<br />\nscrub gives his time and energy daily for four years that winning<br />\nteams may be produced. Yet, in many cases he receives no reward.<br />\nAs the farmer is to the soldier in time of war, so is the scrub to the<br />\nteam. He is \"the man behind the lines\" who is a measure of fighting<br />\nstrength. The scrub, then, should rightly share honors equally with<br />\nthe \"first team.\"<br />\nWithout any one of these elements, the team would not have<br />\nplayed so well on Thanksgiving Day. To teamwork on and off the<br />\nfield we owe our success.<br />\n<br />\nSHERWOOD EDDY<br />\nA world figure in Christian leadership, one with twenty-four<br />\nyears' experience in international religious affairs, comes to Johns<br />\nHopkins to address the student Assembly on \"World Problems.\" Mr.<br />\nSherwood Eddy, Yale '91, is the guest of the Y. M. C. A. and of the<br />\nUniversity and as his hosts it behooves us to display to him such<br />\ncourtesy as befits a man of his position in world affairs.<br />\n<br />\nFirst Quarter<br />\n<br />\n\\\\COLOGNE<br />\n<br />\nSSELS<br />\n,<br />\n11 N tLIEGE<br />\n<br />\n\\\\\\<br />\nN<br />\n<br />\nLow Cost Trips<br />\nto EUROPE<br />\nSummer of 1925<br />\nHY don't you plan to go to Europe next sumW<br />\nwithin your means.<br />\nmer? You can—at a<br />\nLast summer thousands of students and teachers<br />\ncost<br />\n<br />\nlearned how to do it. On one voyage of the Leviathan alone over 70institutions were represented by<br />\n225 students and teachers. In 1925 thousands more<br />\nwill en;oy the pleasures of a European trip. You can<br />\nbe one of them if you will only get the facts.<br />\nThe United States Lines have made it possible for<br />\nAmericans to go abroad comfortably yet economically. Exclusive accommodations, formerly third<br />\nclass, have been prepared and reserved on U. S.<br />\nGovernment ships. The cost of passage is only $85<br />\nand up. This includes clean, comfortable cabins,<br />\ngood food, willing service, exclusive deck and<br />\ndancing space, and many other features.<br />\nYou can learn all the details bysending the coupon<br />\nbelow. Illustrated literature,including a Princeton<br />\nProfessor's account of his trip last summer will be<br />\nsent you at once. Varied itineraries to help you<br />\nplan your trip are included in this booklet. Start to<br />\nmake your plans now. Talk them over at home during the Christmas vacation. But get the facts now.<br />\n<br />\nUnited States Lines<br />\nNew York City<br />\n<br />\n45 Broadway<br />\n<br />\nManaging Operators for<br />\n<br />\nU. S. SHIPPING<br />\n<br />\nOARD<br />\n<br />\nLocal Representative<br />\n<br />\nUNITED STATES LINES<br />\nNew York City<br />\n45 Broadway<br />\nStudents' Tours Dept. 863MB<br />\nPlease send me literature including the booklet-\"Low<br />\nCost Trips to Europe.\"<br />\nIf I go date will be about<br />\npersons in my party.<br />\nThere will be<br />\nName<br />\nAddress<br />\n<br />\nmade 2. Turnbull kicked to Pugh<br />\nSecond Quarter<br />\n<br />\nTaylor made 1 off tackle and<br />\nTurnbull booted to Maryland's 8yard line. Heine punted back to his<br />\n45-yard line. Turnbull lost 8 around<br />\nSupplee's end but Taylor made it<br />\nup around right end, then made 5<br />\nmore off tackle. Turnbull's dropkick went into the line and Hopkins<br />\nrecovered. Taylor lost 12 and a penalty for holding made a total of 15.<br />\nTaylor punted to the 20-yard line.<br />\nAlmy went in for Blandi who was<br />\nhurt. Pugh made 10 more and first<br />\ndown. The line held and Heine<br />\nkicked to Taylor on his 15-yard line.<br />\nHe returned the ball 10 yards. Turnbull and Taylor made 5 but it was<br />\nlost when Hopkins was penalized<br />\nfor being off side. Turnbull made<br />\n1 more, then kicked 50 yards to<br />\nMaryland's 35-yard line. Pugh and<br />\nBesley could not gain. Heine got<br />\noff a 50-yard punt to Taylor. Three<br />\nline plays got 6 yards. Turnbull<br />\nkicked to Pugh on his 30-yard line.<br />\nBesley gained 4 on a fumble then<br />\nbroke away around left end for 35<br />\nOn the next play Mallonee threw<br />\nhim for a loss of 11 yards. Berndt<br />\nthrew Pugh for a loss of 7. The<br />\nhalf ended with the ball on the 50yard line.<br />\n<br />\nHall kicked off to Taylor, who<br />\nran back 15 yards to the 25-yard<br />\nline. Turnbull gained 3 yards at<br />\ncenter. A pass, Turnbull to Taylor,<br />\nfrom kick formation netted 15<br />\nyards, but Taylor fumbled when<br />\ntackled and Hall recovered for<br />\nMaryland. Pugh and Besley did<br />\nnot gain at center, but Pugh made<br />\n5 off tackle. Blandi blocked Heine's<br />\nkick, Day recovering for Hopkins.<br />\nThird Quarter<br />\nTaylor did not gain on two plays<br />\nTurnbull kicked off to Besley,<br />\nbut Turnbull made 4 at center. His who ran back 15 yards. Pugh got<br />\ndropkick from the 40-yard line was a first down on Maryland's 40-yard<br />\njust short of the goal. Pugh made line. Milanausky replaced Oles.<br />\n9 yards around end. On two more Pugh got first down. Besley and<br />\nplays he made first down. Besley Pugh made it first down. Pugh<br />\ngot 2 off left tackle. Pugh broke made one more and a pass, Besthrough for 10 yards and first down, ley to Supplee, gained 5. Another<br />\nthen made 5 more. A forward pass pass grounded and 'when Besley<br />\ngrounded and Sauerwein made a fumbled Hopkins took the ball on<br />\nfair catch of Hall's poor dropkick down. Three line plays got 6 yards<br />\non the 20-yard line. Taylor's two and Turnbull punted from the 25tries at the line gained 2 and Turn- yard line to Maryland's 35. Besbull punted 42 yards to Maryland's ley and Pugh made 6 in three plays.<br />\n38-yard line. Pugh and Besley Heine kicked to Hopkins' 15-yard<br />\ngained 2. Magill touched Heine's line. Taylor passed to Turnbull for<br />\npunt and it landed at Hopkins' 45- 5. Taylor and Turnbull plunged<br />\nyard line. Taylor and Turnbull<br />\nContinued on page 3 col. 2<br />\n<br />\n\\<br />\n\\<br />\n:).•<br />\n;:1 \\i,?<br />\n<br />\n\"'<br />\n<br />\n,s.<br />\n.45<br />\n<br />\nSick headwork<br />\nGetting the right tailor, trailing<br />\nwith the right crowd, keeping<br />\nthe \"profs\" properly complaisant all come under this heading.<br />\nBut a tousled, untidy mane and<br />\ndandruff on your \"tuck\" collar<br />\nare always bad form.<br />\nGetting a bottle of \"Vaseline\" hair<br />\nTonic and using it regularly keeps the<br />\nscalp healthy and makes stiff hair look<br />\nsilky. It prevents dandruff and puts on<br />\nthe finishing touch of slick headwork. At<br />\nall drug stores and student barber shops.<br />\nEvery \"Vaseline\" product is recommended everywhere because of its<br />\nabsolute purity and effectiverress.<br />\n<br />\nVas line<br />\nREG. U.5. PAT. OFF.<br />\n<br />\nHAIR TONIC<br />\nFor the Health and<br />\nAppearance of the Hair<br />\nChesebrough<br />\nState Street<br />\n<br />\nmfg. Company (Cons'd)<br />\nNew York<br />\n<br />\nWrite Your Name with<br />\n<br />\nSANFORD'S INK<br />\nIt Will Last Forever<br />\n<br />\nANFORD.S<br />\nFountain Pen Ink<br />\n\"The Ink that Made the<br />\nFountain Pen Possible\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, DECEMBER 2. 1924<br />\n<br />\nghe largest selling qualifts<br />\npencil in the world<br />\n<br />\nFOR thestudent or prof.,the<br />\n-A- superb VENUS out-rival3<br />\nall for perfect pencil work.<br />\n17 black degrees-3 copying.<br />\nAmerican Lead<br />\nPencil Co.<br />\n220 Fifth Ave.<br />\nNew Yerk<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\n<br />\nTHE GAME, PLAY BY PLAY<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an' indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br />\n<br />\nfor 4. Turnbull kicked to Maryland's 30-yard line. Besley plunged<br />\nfor 10 and then 3. Pugh lost 4.<br />\nSauerwein intercepted a pass and<br />\nTaylor and Turnbull made 9 in<br />\nthree plays. Turnbull punted to<br />\nPugh. Three plays failed for Maryland.<br />\n<br />\nContinued from page 2<br />\n<br />\nFourth Quarter<br />\n<br />\nGood Advice<br />\nCollege and Fraternity Stationery<br />\nEditor of the NEWS-LETTER:<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nJAS. H. DOWNS<br />\nPRINTER<br />\n<br />\nSTATIONER<br />\n<br />\n229 N. CHARLES ST.<br />\n<br />\nR. G. Loy & Company<br />\n(Robert G. Loy)<br />\n<br />\nPHARMACISTS<br />\nUNIVERSITY PARKWAY<br />\nAt Charles St.<br />\n<br />\nNECKWEAR<br />\n<br />\nSHIRTS<br />\n<br />\nLeFranc & Ault<br />\n421 N. HOWARD ST.<br />\n<br />\nGLOVES<br />\n<br />\nHOSIERY<br />\n<br />\nJ. F.—APPLE CO.<br />\nMANUFACTURING JEWELERS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\nkiP.TEEEPffiJOIEffE001-0102ggffff<br />\ntrigRADERS<br />\n<br />\nLOMBARD<br />\n-arEZIEF-ga.<br />\n<br />\nHub<br />\nBaltimore's Great<br />\nMen's Store<br />\n<br />\n,<br />\n<br />\nHeine kicked to Hopkins' 30The Football Schedule<br />\nyard line. Taylor made 6 and<br />\nEditor of the NEWS-LETTER:<br />\nSo the tentative schedule for passed to Turnbull for 16 more.<br />\nWrite for<br />\nfootball for next year is being ar- Turnbull kicked to the 15-yard line.<br />\nbooklet on<br />\nVENUS Pencils and<br />\nVENUS EVERPOINTED<br />\nranged. Well, well, that will be in- Besley made 9 yards in three plays.<br />\nMechanical Pencils<br />\nteresting<br />\nto everyone in view of the Lawrence replaced Turnbull and<br />\n...........sas.rattsuseess.nis<br />\nunusual schedule we had this year. \"Doug\" took Taylor's position when<br />\nAccording to the NEWS-LETTER, the latter's<br />\nhead forced him from<br />\nrecently three schools, Mt. St.<br />\nthe game. Heine kicked to HopMary's, Loyola, and George Washkins' 30-yard line. Hopkins began<br />\nington are not to be included.<br />\nusing the \"huddle\" system and LawThat's all right.. Some mention<br />\nrence gained 3. Turnbull passed to<br />\nwas<br />\nmade that out-of-town schools<br />\nDamon—<br />\nMallonee for 35 more. On a douwould be played, and I want to sug\"What's the matter?<br />\nble<br />\npass Almy made 8 around left<br />\nCan't you read your<br />\ngest to the graduate manager that<br />\nnotes of the lecture?\"<br />\nend. Lawrence made 5 more and<br />\nthere is a rousing good team at<br />\nPythias—<br />\nfirst down. Almy fumbled for a loss<br />\nScranton which we ought to have<br />\n\"No—doggone it. I<br />\nof 3 yards. Turnbull tried a dropskipped over to class<br />\non our schedule—The International<br />\nthis morning without<br />\nkick from the 30-yard line, but it<br />\nCorrespondence School; the famous<br />\nmy Dixon's Eldorado!\"<br />\nwent wide. Pugh and Besley failed<br />\nChicago<br />\nknockouts—the<br />\nsquad<br />\n17 leads—all dealers<br />\nto register a first down and Heine<br />\nfrom Alexander Hamilton Instikicked. Lawrence made 2 and TurnDIXONS<br />\ntute ; and Marston's School is a<br />\nbull reversed his field for 5 more.<br />\ngood one to schedule. These teams<br />\nTurnbull kicked to Maryland's 25ELDORA])<br />\nshould be bargained with and I unyard line. Two line plays failed to<br />\n\"the washerdraiteke<br />\nderstand from reliable sources that<br />\ngain, but Maryland got the ball on<br />\nthe associations in charge of their<br />\nher 40-yard line when a short punt<br />\ngommagmc===z athletics<br />\nwill charge $1 admission<br />\nhit a Hopkins man. Pugh and Ilesinstead of $2.<br />\nley made a first down. Besley made<br />\nSeriously, I'm interested in seefirst down. Besley made a 5-yard<br />\ning a real good schedule for Hoppass. Another grounded, as the<br />\nkins. This year's schedule brought<br />\ngame ended on Hopkins' 20-yard<br />\ndown a tremendous amount of adline.<br />\nverse criticism from students and<br />\nAverage of punts—Hopkins, 42;<br />\ntownspeople. The team is great, so Maryland, 35. Forward passes—Hopkins, 3 out of 4; Maryland, 2 out of 5.<br />\nmake the schedule its equal.<br />\nFirst downs—Hopkins, 4; Maryland,<br />\nSHERWOOD BROTHERS, INC.<br />\nYours truly,<br />\n12.<br />\nISIDORE O'BRIEN<br />\n\"fmtvi,•—•41-..-:,.v.rginprionricaxignatir<br />\nPAGE CAMPAIGN BEGINS<br />\n<br />\nENGRAVER<br />\n<br />\n3<br />\n<br />\nPRUITERS<br />\n<br />\nand<br />\n<br />\nSOUTH<br />\n<br />\nBIRDERS<br />\n<br />\nSTREETS<br />\n<br />\nDear Sir: Seniors hear from<br />\ntheir many friends each spring the<br />\noft repeated advice, \"Don't work<br />\nfor a big corporation.\" This is just<br />\none of the forms in which the advice is phrased; there are many others, but they all mean practically<br />\nthe same thing. Why is it that this<br />\nadvice is so prevalent? Why should<br />\nengineers be especially picked out<br />\nto receive this sort of advice? The<br />\nanswers are not easily found, but<br />\na refutation of the advice is readily<br />\nmade to those engineers who are<br />\nexpecting to start their life's work<br />\nthis summer.<br />\nA big corporation presupposes a<br />\nsuccessful corporation, for otherwise it could never have become big,<br />\nand to be successful it must be<br />\npractical. You have the theory but<br />\nyou need practical experience, and<br />\nyou can best get this in a big corporation where many branches of<br />\nengineering are used. From the field<br />\nthus brought before you, you can<br />\nchoose safely the branch which you<br />\nwant to follow throughout your<br />\nlife.<br />\nBut you ask if there is a chance<br />\nfor advancement and is there room<br />\nnear the top. There is plenty of<br />\nroom near the to and if you fear<br />\nthat you cannot push through the<br />\ncrowds at the bottom the big corporations do not want you. They<br />\nwant able, confident engineers.<br />\nMany large electrical corporations<br />\noffer graduate engineers a course<br />\nof one year in the shop to fit them<br />\nfor their real work in dealing with<br />\nelectrical problems as they arise in<br />\nthe manufacturing industry. While<br />\non this course the young engineer<br />\nis under. the supervision of the Educational Department, which at all<br />\n<br />\nContinued from page 1<br />\nproject has already been stamped,<br />\nhe said.<br />\nWalter Hines Page's most important position was that of United<br />\nStates Ambassador to Great Britain<br />\nduring the war. His \"Life and<br />\nLetters,\" recently published,. sdld<br />\nto the number of more than 86,000<br />\ncopies.<br />\nPlans for the continuation of the<br />\neffort include: a campaign of information through circularization<br />\nof the friends and admirers of Mr.<br />\nPage, and a general educational<br />\ncampaign urging on the American<br />\npublic , the necessity of creating<br />\nsuch a school and obtaining the support of those citizens who believe<br />\nin practical steps for the betterment<br />\nof international relations.<br />\nThe school, if built, will be located at Homewood.<br />\nMAJ. McBRIDE TO INSPECT UNIT<br />\nContinued from page 1<br />\n<br />\norder • additional rifles and equipment because of the increase in<br />\nsize. A stock of new rifles, belts,<br />\nbayonets, packs and other necessary supplies has just arrived and<br />\nwill shortly be issued to the Sophomores. Those concerned will soon<br />\nbe notified when to apply for this<br />\nequipment.<br />\ntunes is willing to aid him in reaching the decision as to which phase<br />\nof the electrical industry he is best<br />\nfitted for and wants to follow.<br />\nEngineers are trained to think<br />\nfor themselves. Seniors, do not let<br />\nthe fears of your lay-friends spoil<br />\nyour chance of success. Don't overlook the big corporation.<br />\nJAMES ATFRIEND, '24,<br />\nGeneral Electric Co.<br />\n<br />\nWe Solicit Your Patronage<br />\n<br />\nBOULEVARD OPTICAL CO.<br />\nOPTOMETRISTS<br />\n<br />\nOPTICIANS<br />\n<br />\n3209 Greenmount Avenue<br />\nHomewood 6717<br />\n<br />\nBaltimore<br />\n<br />\nSmooth, trim, lustrous hair<br />\n<br />\nAlorning c4fternoon Evening<br />\nthis will keep your hair<br />\n- in place .<br />\n• •<br />\n<br />\nHow does your hair look an<br />\nhour after you've brushed it?<br />\nAll out of place—mussed—<br />\nevery which way? Only a<br />\nhint of its trimness left?<br />\nThat used to be the daily<br />\nexperience of most men.<br />\nFor then there was no quick,<br />\neffective way to keep the hair<br />\nalways in place, looking at all<br />\ntimes just as you want it to<br />\nlook. Old-fashioned pomades<br />\nmatted the hair and made it<br />\ngreasy. Water evaporated<br />\nquickly and left the hair drier<br />\nand harder to control than<br />\never.<br />\n<br />\nA great change<br />\nBut now Stacomb is an essential in the well-dressed<br />\nman's equipment. And everywhere—in college and out—<br />\nyou seesmooth neatly - combed<br />\nhair—natural, soft, lustrous.<br />\n<br />\nMen have found in Stacomb<br />\nwhat they have always needed<br />\n—an easy, natural way to<br />\nmake their hair lie as they<br />\nlike it best, and stay that way<br />\nfrom morning till night.<br />\nYour hair — however dry<br />\nand straggly, however uncontrollable after being washed—<br />\nwill keep in perfect order all<br />\nday long if you apply just a<br />\ntouch of Stacomb when you<br />\nbrush it in the morning.<br />\nWomen use Stacomb, too.<br />\nWhether the hair is long or bobbed,<br />\nit will lie fashionably close to the<br />\nhead—smooth and lustrous.<br />\nYou can get this delicate, invisible cream at your college drug store.<br />\nNon-staining, non-greasy. In jars<br />\nand tubes (or the new Liquid Stacomb if you prefer). Use Stacomb<br />\ntomorrow morning, and look your<br />\nbest all<br />\n<br />\nKEEPS THE HAIR IN PLACE<br />\n<br />\nVeyt•<br />\nCity<br />\naLories,Inc.,<br />\n11.a:orStteet,New York<br />\ngenerous<br />\n--t2n - ar 18tli<br />\ncharge, S<br />\nfree of<br />\n113 W est<br />\nsend rae,Stacorab.<br />\nof<br />\n7-lease<br />\nsample be<br />\n<br />\nFree Offer<br />\n<br />\n. . . .. . .<br />\n. . . ....<br />\n.<br />\n.<br />\n•<br />\n•<br />\n•<br />\n•<br />\n.<br />\nr arne<br />\n• • • •.<br />\nP adre s<br />\n<br />\n..<br />\n<br />\n\fTHE JOHNS HOPKINS NE WS-LETTER, DECEMBER 2, 1924<br />\n<br />\n4<br />\n<br />\nErnest G.Leimbach<br />\n<br />\nMUSICAL CLUBS WILL GIVE DR. BLONDHEIM ADDRESSES<br />\nZIONIST SOCIETY ON<br />\nFIRST CONCERT OF YEAR<br />\nJEWISH CONDITIONS<br />\nAT REISTERSTOWN<br />\n<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br />\n<br />\nUPTOWN<br />\nQUALTIES<br />\n<br />\nDOWNTOWN<br />\nPRICES<br />\n<br />\nOPEN EVENINGS<br />\n<br />\nTelephone, Madison 4722<br />\n<br />\nTHE J. W. HOWARD CO.<br />\nDRAWING MATERIALS<br />\nSURVEYING INSTRUMENTS<br />\n<br />\nDecember 5 Set as Date. Perform- Next Meeting December 5; Dr. Broadus<br />\nMitchell to Speak. Dance<br />\nance to Be Followed by a<br />\nPostponed<br />\nDance<br />\n<br />\nReisterstown will be the scene<br />\nof the first invasion of the Musical Clubs in their schedule of the<br />\npresent year. The concert is<br />\nscheduled for Friday evening, December 5, in Caltrider's Hall. A<br />\nlarge number of students are expected to accompany the clubs, especially since there will be a<br />\ndance immediately following the<br />\nmajor event of the evening. The<br />\nprice of admission to the concert<br />\nwill be 50 cents for each person,<br />\nin addition to 50 cents per couple<br />\nfor the dance.<br />\nProgram Arranged<br />\n<br />\n2422 Madison Avenue<br />\nB altimore, Md.<br />\n<br />\nDr. Blondheim, of the University faculty, addressed the Zionist<br />\nSociety at their last meeting, Friday, November 21, on the changes<br />\nwhich have taken place recently<br />\nin Europe regarding the status of<br />\nJews. The war brought about a<br />\nstrong nationalistic feeling which<br />\nresulted in amity between the various elements making up each nation.<br />\nTowards the end of the<br />\nwar, however, nationalistic feeling<br />\ndied down and racial antagonisms<br />\nsprang up, bringing pogroms and<br />\nmisery to the Jews of Europe.<br />\nThe causes for such antagonism<br />\nare various. A general desire to<br />\nblame the war on someone, and<br />\njealousy because of the remarkable financial success of Jews, particularly in Germany, are among<br />\nthem. The chief instigators of<br />\nanti-Semitism were the old aris<br />\ntocratic families of Europe which<br />\nhave always been enemies of Judaism. Members of these families, finding their positions threatened by the springing up of republics, and finding that Jews<br />\nwere prospering under republican<br />\ngovernments and even taking part<br />\nin them, sought for selfish motives to rouse Anti-Semitism<br />\namong the people.<br />\n<br />\nrealized by the clubs that<br />\nfirst impressions have a great deal<br />\nto do with reputations and they<br />\nhave been working hard at rehearsals to complete an elaborate<br />\nVernon 4986<br />\nprogram for their initial public<br />\nperformance. Directed by Mr.<br />\n\"Say It With Flowers\"<br />\nHobart Smock, the Glee Club,<br />\nwhich tried out a number of selections at the Alumni meeting last<br />\nWednesday with great 'success,<br />\nwill present several entertaining<br />\nand varied numbers. The Blue<br />\n1822 N. CHARLES STREET Jay Orchestra, headed by Mr.<br />\nJack Sherr, is well-known to be<br />\nblessed with a pleasant case of<br />\njazzmania and will broadcast syncopation during the concert and<br />\nafter. The Banjo Club, under the<br />\nConditions Improving<br />\ndirection of Mr. Conrad Gebelin,<br />\npromises, before they get through, In 1919 the condition of the<br />\nto have the entire audience keep- Jewish people in Europe was very<br />\ngloomy. Since then, however,<br />\ning time with their feet. A violin<br />\nSOPHOMORES<br />\nthere has been much improvesolo by Mr. Light, a piano solo by<br />\nFRESHMEN<br />\nment, most of which is due to the<br />\nMr. Harris, a J. H. U. medley by<br />\nnew European Republics, that are<br />\nthe versatile Steinwald, a xylogrowing stronger daily. In Europhone solo by Mr. Boyd, and a<br />\npean countries, where formerly<br />\nsaxophone selection by Mr. Scherr<br />\nthe Jews lived to themselves and<br />\nwill round out the bill.<br />\nspoke their own language, they<br />\nThe program as arranged is as<br />\nRESTAURANT<br />\nnow live among the other inhabifollows:<br />\ntants of the country. The decline<br />\n1817 N. Charles St.<br />\n1. The Glee Club<br />\nof Anti-Semitism has somewhat<br />\n(a) The University Ode,<br />\nweakened the Zionist movement,<br />\nDevries as<br />\nit has removed one of its causes<br />\nOpen All Hours<br />\n(b) Estudiantina ....Lacome<br />\nbut that movement is still pro2. The Banjo Club<br />\ngressing steadily.<br />\nMoonlight Waltz.Nightingale<br />\nThe next meeting of the Zionist<br />\n3. Violin Solo, by Mr. Light<br />\nNear Your Campus<br />\nSociety will be on Friday, DecemCanzonetta....A. d'Ambrosio ber 5, when Dr. Broadus Mitchell<br />\n4. The Glee Club<br />\nwill speak. A study circle is beDe Sandman...... .Protheroe ing orzanized by the society for<br />\n5. Piano Solo, by Mr. Harris<br />\nthe study of Zionist questions and<br />\n(a) Waltz in B Minor.. Chopin literature. Plans will soon be an(b) Novellette .....McDowell nounced.<br />\n6. The Blue Jay Orchestra<br />\nBecause the varsity club is hav(a) Popular Selections<br />\ning a reunion meeting of the alum(b) Xylophone Solo, by Mr. ni on November 26, the dance<br />\nBoyd<br />\nwhich the Zionist Society had<br />\n7. Our Alma Mater in Dixieland planned for this date was postMedley, by Mr. Steinwald poned. December 6th is a tenta8. The Banjo Club<br />\ntive date for this affair.<br />\nFieldson March....Kitchener<br />\n9. Saxophone Solo by Mr. Scherr<br />\nHOPKINS-U. OF M. GAME<br />\n10. The Glee Club<br />\nLATEST STYLES AND FORMS<br />\nContinued from page 1<br />\nCossack War Song....Parker<br />\nPlenty of publicity has been giv- final whistle blew the ball was on<br />\nEngraved<br />\nen this concert in Reisterstown the Hopkins 20-yard line.<br />\nWEDDING INVITATIONS,<br />\nMaryland (0)<br />\nANNOUNCEMENTS AND<br />\nand a crowded hall is expected. Hopkins (0)<br />\nSupplee<br />\n•<br />\nVISITING CARDS<br />\nThe respective leaders have spent Mallonee<br />\nBromley<br />\nMagill<br />\na great deal of time in preparation Oles<br />\nLuckey<br />\nSAMUEL H. KIRBY for this event and they want the Day<br />\nLewis<br />\nR G<br />\nHough<br />\nSlowik<br />\nENGRAVER<br />\nstudent body behind them in their Levy<br />\nR T<br />\nBurger<br />\nR E<br />\nBeatty<br />\nfirst attempt. \"If long rehearsals Berndt<br />\nSamples and Prices on Request<br />\nBosley<br />\nTaylor<br />\nQ B<br />\nand determination mean any- Turnbull<br />\nL H<br />\nPugh<br />\n42 SOUTH ST.<br />\nBALTIMORE<br />\nR H<br />\nHeine<br />\nthing,\" said one of the members, Sauerwein<br />\nF B<br />\nHall<br />\nBlandi<br />\n\"there will be a tuneful time in the<br />\nSubstitutions—Hopkins, Almy for<br />\nold town that night.\"<br />\nBlandi, Milinausky for Oles, Lawrence<br />\nORDERS RECEIVED FOR<br />\nDuring the second week in Jan- for Taylor; Maryland, Bonnett for<br />\nBromley. Referee—Harry Fisher, Couary another concert will be held lumbia. Umpire—W. R. Crowley, Bowin the ballroom of the New Wil- doin. Head linesman—H. R. Heneage,<br />\nDartmouth. Field judge—J. J. Coslard Hotel in! Washington and grove, Cornell. Time of quarters-15<br />\nTransfer.8E Baggage Express<br />\nlater, in the first part of February, minutes.<br />\nNote—A play by play account of the<br />\nAUTOMOBILE SERVICE<br />\na concert will be given at the Delgame will be found on page 2, colPHONE, HOMEWOOD 6886<br />\naware College, at Newark.<br />\numn 3.<br />\n<br />\nSMITH & CO.<br />\nFlorists<br />\n<br />\nIt is<br />\n<br />\nCan you wiggle your ears?<br />\nCan you do anything that makes you stand<br />\nout from others at parties, soirees or at the<br />\nfraternity?<br />\nIn a few lessons I can make you so proficient in magic tricks that you will be the<br />\ncenter of attraction.<br />\nThe tricks are simple and anyone can do<br />\nthem. I guarantee to teach YOU so that<br />\nyou can do them.<br />\nI will be glad to demonstrate at your frat<br />\nrooms or boarding house.<br />\nPhone Mr. Bagby, Plaza 7440 or Forest<br />\n7033-J for appointment.<br />\nThree lessons, $5.00.<br />\n<br />\nJohns Hopkins Students Will Find A Welcome At<br />\nMOUNT VERNON PLACE<br />\nMETHODIST EPISCOPAL<br />\nCHURCH<br />\n(At the Washington Monument)<br />\n<br />\nREV. OSCAR THOMAS<br />\nOLSON, D.D.,<br />\nMinister<br />\n<br />\nSENIORS<br />\n<br />\nSunday Services of Worship<br />\n11 A. M. and 8 P. M.<br />\n<br />\nJUNIORS<br />\n<br />\nThe Sunday afternoon \"at home\"<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nRoom is a social occasion that brings<br />\ntogether the student groups from Hopkins, University of Maryland, Goucher,<br />\nPeabody, and other schools of Baltimore.<br />\nEpworth League at 7 P. M. and the<br />\nBible class at 10 A. M. are built particularly with the needs of the young<br />\npeople in mind.<br />\n<br />\nSt. Regis<br />\n<br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br />\n<br />\nCOGGIN'S<br />\n<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nbf<br />\n<br />\n/vet.<br />\n<br />\nCharles<br />\nist<br />\nt m<br />\nN.a<br />\n<br />\nTOM MAGILL,<br />\nManager<br />\n<br />\nDOUG 'TURNBULL<br />\nRepresentatives<br />\n<br />\nBaltimore's Best Store<br />\nHOCHSCHILD,KOHN<br />\n<br />\ngc Co.<br />\n<br />\nHoward and Lexington<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nXWCornerCjavelie and 6Putaw Sts.<br />\n-Where Wholesale and Retail Districts Meet\"<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nDRAPERIES<br />\n<br />\n\f", "format": "basic_html", "processed": "tE<br /><br />\nVOL. XXIX, No it /<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 2, 1924<br /><br />\nMAJ. A. C. McBRIDE WILL WALTER H. PAGE SCHOOL<br />\nCAMPAIGN BEGINS IN<br />\nINSPECT R. 0. T. C.<br />\nNEW YORK<br />\nUNIT DECEMBER 8<br />\nPreliminary Survey of Entire Corps Representatives from Hopkins Attend<br />\nto Determine if It is Worthy of<br />\nBanquet to Launch Drive for<br />\nFunds of New School<br />\nFinal Review in May<br /><br />\nPRICE 5 CENTS<br /><br />\nHOPKINS, 0-MARYLAND, 0 IN<br />\nSTATE CHAMPIONSHIP GAME<br /><br />\nPICTURES AND WRITE-UPS CHAMPIONSHIP UNDECIDED FOR SECOND<br />\nNow that the excitement of the<br />\nDr. Frank J. Goodnow, Dr. C.<br />\nOF CAMPUS LEADERS<br />\nSTRAIGHT YEAR—FAILURE OF TEAMS TO<br />\nbig Army-Navy football game is K. Edmunds, and Dr. John H.<br />\nSENT TO PAPERS<br />\nover, R. O. T. C. men must turn<br />\nSCORE DISAPPOINTING TO LARGE CROWD<br />\nLatane, attended a dinner at the<br />\ntheir serious attention/ to a visit<br />\nBoard Begins Far-reaching<br />\nCentury Club in New York, Mon- Publicity<br />\nDrive to Advertise Hopkins.<br />\nBlue Jays Use Huddle System in Exciting Last Quarter<br />\non December 8th by Major A. C.<br />\nActivities Featured<br />\n24th,<br />\ngiven<br />\nto<br />\nthe<br />\nday,<br />\nNovember<br />\n\" March After Injury to Taylor<br />\nMcBride, who is the officer in<br />\nPublicity<br />\n\"Activities<br />\nof<br />\nthe<br />\nare<br />\nestablishing<br />\na<br />\nwho<br />\ntrustees<br />\ncharge of R. 0. T. C. affairs for<br />\nTwo teams, both determined to win, met at the Stadoum on Thanksthe Third Corps Area. On the day $1,000,000 fund for the founding Board have been steadily increas- giving Day and when the battle was over neither had had their<br />\nappointed he will go over the class- of the Walter Hines Page School ing since the opening of school, desires and hopes satisfied, the scoreboard reading Hopkins, 0;<br />\nroom work of the unit in the morn- of International Relations at Johns though the amount of work which Maryland, 0. They had battled the year before to a 6 to 6 tie. The<br />\nhas been done has not made any<br />\ning and will inspect the drill and<br />\nHopkins. The dinner was attended apparent showing in the minds of game was played before an audience of 18,000 persons, the largest<br />\npractical work in the afternoon.<br />\ncrowd that has ever witnessed a contest between the two foreThe purpose of the Major's visit by twenty men of nation-wide many students,\" James Young,<br />\nmost Maryland universities. Hopeditor-in-chief, said yesterday.<br />\nWill be to determine, according to prominence.<br />\nkins used the \"huddle\" system to<br />\nBIG<br />\nRALLY<br />\nALUMNI<br />\nSTAGE<br />\nThe dinner was given by John J. Photographs have been taken of<br />\nhis judgment, whether or not the<br />\na great extent after Taylor had<br />\nON EVE OF MARYLAND<br />\nR. 0. T. C. men at Hopkins are Carty, vice-president of the Amer- about fifteen men by the Bachbeen forced from •the game beGAME<br />\nworthy of being considered at a ican Telephone and Telegraph Com- rach Studio for publicity purposes.<br />\ncause of an injured head. Both<br />\nfinal inspection to be held in May. pany, and it was at this dinner that An arrangement has been made to Bonfire and Parade Mark Pre-game teams were well supported by<br />\nRites of Annual Contest<br />\nThis final inspection is conducted an active campaign for raising the photograph the different campus<br />\ntheir cheering sections throughleaders<br />\nand<br />\nfaculty<br />\nmembers.<br />\nAn alumni get-tOgether, a bon- out the entire game.<br />\na.nnually by a board of officers who money was launched formally. This<br />\nact as judges in deciding if Johns was the first gathering of the trus- These prints are sent to the news- fire, and a parade featured the preTurnbull's punting was of exHopkins may be rated for the sea- tees and it marked the beginning papers in Baltimore and a copy of (Tame activities held last Wednesceptionally high calibre. His kicks<br />\nson as a distinguished college of their effort to reach the goal of each is retained for the Publicity<br />\nday. The meeting of the alumni averaged 42 yards. Turnbull, and<br />\namong others of the nation, in so $1,000,000 which is deemed neces- Board files. As soon as the prints<br />\nfar as its R. 0. T. C. unit is con- sary to make the school a reality. are sent to the newspapers, a was the most successful in years. Captain Magill were both playing<br />\nsons of Hopkins,<br />\nwrite-up of each man concerning Four hundred<br />\ncerned. \"This means careful trainPurpose of School<br />\ntheir last game for the Black and<br />\ndifferent<br />\nstates, gathtwenty<br />\nfrom<br />\nThe Page School will be one his activities and career on the<br />\ning and strict discipline on the part<br />\nEngineering Hall. Blue. Hopkins played a defensive<br />\nof each student,\" Lieutenant Sher- which will, primarily, study and in- campus is sent to them for their .red in the Civil<br />\ngame waiting for the breaks.<br />\nwood said. \"Particular attention vestigate the various phases of in- files. The object of this is to have Classes represented ranged from<br />\nwell-rememberthe<br />\neighties<br />\nto<br />\nthe<br />\nMaryland scored 12 first downs<br />\nshould be paid to uniform and ternational relations. The charac- material on file for immediate use.<br />\nselec- as compared with four for the J.<br />\nfew<br />\nAfter<br />\na<br />\n'24.<br />\nclass<br />\nof<br />\ned<br />\nter,<br />\nscope,<br />\nand importance of this Results do not often come from<br />\nequipment.\"<br />\nschool was emphasized at the meet- this type of work immediately, tions by the Glee Club had helped H. U. The Farmer line outHopkins Ranks Hifth<br />\nA gold star worn on the uniform ing, and it was pointed out that the but the nature of it is quite fa- to put the assemblage in a recep- weighed the Black and Blue.<br />\nIS the symbol of distinction won at proposed school will follow the lab- vorable publicity for the Univer- ive frame of mind,\"hot dogs\" and<br />\nWhen Besley and Pugh gained practicalthe annual inspections in May. The oratory or seminary method of sity whenever the opportunity real beer were served.<br />\nR. 0. T. C. at Hopkins has at- study, much as they have been ap- arises to use the picture and the these had done their deadly work ly all of the ground for the Colthe old grads, headed by Walter lege Parkers, in fact, with the extained this honor four times.\"<br />\nplied in the other schools - at Hop- material.<br />\nB. Swindell, came tearing out of ception of one play when Hall<br />\nSpeaking of the attitude of the kins.<br />\nOut-of-town Publicity<br />\nhowls, carried the pigskin, these two men<br />\nMembers of the faculty and grad- The names, addresses and ac- the building with war-like<br />\nstudents to Major McBride, Lieuin a<br />\nthe<br />\nfield<br />\nwound<br />\nonto<br />\nand<br />\ntenant Sherwood said: \"We have uate students, it was explained, will tivities of all out of town men are<br />\nhad the football on every play.<br />\ndance.<br />\nsnake<br />\ntwisting<br />\nwrithing,<br />\nalways been pleased to have the devote themselves largely to inves- being prepared for publicity purThere were few substitutions<br />\nWhen they arrived on the scene<br />\nMajor inspect us. Each year he tigation and research of the vari- poses. Newspapers in the towns<br />\nanother snake made during the game. Curly<br />\ncomes to Johns Hopkins he im- ous phases of international rela- from which the students come, are of action they found<br />\nmore enthusi- Byrd sending in Bonnett for<br />\nlarger<br />\nif<br />\nnot<br />\npresses us with the fairness of his tions. The results will be published listed with the respective names. dance,<br />\nastic, which comprised nearly half Bromley, while Hopkins due to<br />\ndecisions and the heaftiness of his for the benefit of the public.<br />\nThe intention is to send news arco-operation.\" On the day of the<br />\nAlthough the campaign has so ticles to the different towns, tell- the undergraduate body. The injuries substituted Almy for<br />\nbonfire with the usual atMajor's visit a review will be held far been one of education only dur- ing what the student is doing, huge<br />\nBlandi ; Milanausky for Oles, and<br />\nfeatures of the gallows<br />\ntendant<br />\nin his honor, followed by such work ing the summer and fall months, what department of the school he<br />\nbearing the image of Maryland Lawrence for Taylor. The Blue<br />\nas is regularly scheduled for that subscriptions and pledges totaling<br />\nis in, the organizations to which<br />\ndelight as Jays' aerial attack showed conday.<br />\nnearly $100,000 have been sent in, he belongs and such other favor- and the usual yells of<br />\nThey<br />\nwas already nearly siderable improvement.<br />\nWhen Major McBride comes to said Dr. Finley, one of the trus- able publicity as will present the it caught fire<br />\nlight both completed three out of four trys.<br />\nwaning<br />\nby<br />\nits<br />\nand<br />\nover;<br />\nHopkins this year he will find a tees. • This sum indicates the wide- name of Johns Hopkins.<br />\nlines wound over the field.<br />\nThe Homewood eleven during<br />\nunit that has found it necessary to spread approval with which the<br />\nWork for the corning winter inParade Goes Down-town<br />\nContinued on page 3, col. 3.<br />\nContinued on page 3, col. 3<br />\nthe last quarter made a very sericludes publicity for the BarnSoon the cry of \"Downtown !\"<br />\nous<br />\nattack on the Farmers' goal.<br />\nstormers, the Musical Clubs, June<br />\nwas raised on all sides, and a long<br />\nOLD NEWS-LETTERS OF LATE NINETIES<br />\nWeek and the Blue Jay Twin Six.<br />\ncolumn,four abreast, swung down Hopkins had the ball on its own<br />\nREVEAL LITERARY FLAVOR OF PA,PER In fact, the purpose is to advertise Charles street, headed by Ralph 30-yard line. Lawrence began the<br />\nthe varions non-athletic activities<br />\nThat a distinctly literary tone workout and had beaten Warfield. which support the Publicity Board Townsend and his accomplices advance with a gain of 3 yards.<br />\nPervaded the original News-Let- College at Sykesville by 27 points. in a financial way through the Ac- and by six members of the Band. Turnbull passed to Mallonee, who<br />\nThe first stop was Goucher. After had travelled 35 yards before beter is shown by several \"first<br />\nEven during the last gasps of tivities Council, with news and<br />\ncopies\" in the possession of Dr. the nineteenth century, Freshmen pictures in newspapers in this sec- an enthusiastically received out- ing brought to the ground. On a<br />\nburst, the parade again got under<br />\nCarol Van Buren Wight, of the were a source of worry. The fac- tion of the East.<br />\nway. The next halt was unex- double pass Almy made eight<br />\nClassical Department.<br />\nulty had set themselves up as the<br />\nLast year's efforts show that pected. News had arrived that a around left end, and Lawrence<br />\nThe issue of November, 1898, protectors of the humble Frosh, the Board when properly directed<br />\nMaryland parade, coming up gained five more and a first down.<br />\nWhen the publication was barely a much to the distaste of the Sopho- was able to get across more news<br />\nCharles, was only about two Almy fumbled but recovered.<br />\nYear old, contained an article on mores. The News-Letter, true or- and pictures for the activities than<br />\nblocks distant. With some effort,<br />\n:Student Life in Japan,\" recount- gan of the campus, voiced the has ever been accomplished in the crowd was persuaded to re- With the ball on U. of Md.'s 30yard line Turnbull tried a droping the rise of the Japanese educa- opinion that \"this rivalry which previous years.<br />\nfrain from physical violence, and<br />\ntional system, a review of Rud- now finds no expression is not<br />\nMeetings are being held every when the two columns passed, the kick but it did not quite come<br />\nin<br />\nwithout<br />\nvalue<br />\nits<br />\npromoting<br />\n.Yard<br />\nDay's<br />\nKipling's \"The<br />\nMonday and arrangements are be- only show of hostile feeling was between the goal posts. Hopkins<br />\nWork,\" and Dr. Wight's first pub- class spirit and adding spice to ing made to move 'immediately an exchange of blood-thirsty had made its first attempt at goal<br />\nlished work, a • translation of college life.\"<br />\ninto Room 22 of the Sub-base- threats. Progress continued to in the first quarter when Doug<br />\nGoethe's \"Mignon.\"<br />\nJohn C. French, now of the ment of the Chemistry Labora- the Stafford, where a \"Hullabaloo made a try from the 40-yard line.<br />\nDuring the final minutes of play<br />\nUndergraduate activities of the English Department, was Editor- tory.<br />\nfor Dr. Goodnow\" was given; and<br />\nboth<br />\nteams were fighting harder<br />\nlate \"nineties\" play their part in in-Chief of the News-Letter, and<br />\na block further the parade was<br />\nthese early issues. In November, John Philip Hill was Exchange<br />\nthan<br />\nduring<br />\nany other part of the<br />\nyells.<br />\nfew<br />\na<br />\nafter<br />\ndisbanded<br />\nNOTICE<br />\ncontest.<br />\nHopkins<br />\ngot into trouble<br />\nof1898, the Varsity football team Editor in 1898.<br />\nthe<br />\nof<br />\nend<br />\nthe<br />\nmarked<br />\nThis<br />\nGrades of the psychological<br />\nhad defeated Western Maryland<br />\ntest given to entering freshmen<br />\nUntil 1911 the News-Letter apficial ceremonies, but word was when a short punt hit a Blue Jay<br />\nwill be given out at Room 401,<br />\n10 to 0 at Electric Park. Earlier peared spasmodically, but at this<br />\npassed to returning groups that and a Maryland player recovered<br />\nGilman, at the following times:<br />\nin the season Maryland Agricul- time the support of local and naMonday, Wednesday and ThursMaryland was painting the cam- the spheroid. Maryland then had<br />\nday from 12.00 to 1.00 P. M.;<br />\ntural College had been outclassed tional advertisers warranted a<br />\npus, but the large crowd which The ball on their own 40-yard line.<br />\nand Tuesday and Friday from<br />\nmay<br />\nin a 16 to 0 tilt. A \"Scrub\" aggre- weekly publication. It gradually<br />\nsoon gathered at Homewood fore- Besley and Pugh made two first<br />\n4.00 to 5.00 P. M. Marks<br />\nbe obtained until the Christmas<br />\nstalled any such attempt which downs and kept on until when the<br />\ngation had shown great ability by gained power and in 1920 assumed<br />\nHolidays.<br />\nmay have been planned.<br />\nContinued on page 4 col. 3<br />\ndefeating Marston's in a 53 to 0 its present semi-weekly form.<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS - LI.:1TER, DECEMBER 2, 1924<br /><br />\nThe Johns Hopkins News-Letter<br /><br />\nProf. J. T. Thompson to Head U. S.<br />\nPublic Roads Bureau<br />\nInvestigation<br /><br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all artidles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nTelephone<br /><br />\nHomewood 0100<br /><br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALGER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br /><br />\nHOPKINS TO CO-OPERATE<br />\nWITH U. S. ROADS<br />\nBUREAU<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br /><br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br /><br />\nCirculation Manager<br />\nOTHO J. KELLER, III, '26<br /><br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\nWILLIAM E. THOMSEN, JR., '26<br /><br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT if. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., DECEMBER 2, 1924<br /><br />\nPOST MORTEM<br />\nThe honor of victory on the gridiron was claimed by neither<br />\nJohns Hopkins nor the University of Maryland on Thanksgiving<br />\nDay. Again the State Championship remains undecided. There<br />\nare no apologies on either side for the tied score. None are needed.<br />\nBoth teams fought hard. The players gave their best in the struggle. With that we are content.<br /><br />\nA co-operative agreement between the Johns Hopkins University and the United States Bureau<br />\nof Public Roads, Department of<br />\nAgriculture, Washington, D. C.,<br />\nhas just been entered into for research upon the elastic properties<br />\nof concrete under the action of<br />\nrapidly applied loads.<br />\nIt was determined by the Bureau at its experimental station at<br />\nArlington, Virginia, a few years<br />\nago, that the force applied upon<br />\na concrete pavement by a moving<br />\nvehicle was several times as great<br />\nas that applied by the same vc<br />\nhide standing still. This \"dynamic increment,\" commonly<br />\ncalled \"impact,\" is due to inherent<br />\nroughness in the pavement and<br />\nthe wheels of the vehicle, causing the wheels to actually jump<br />\nclear of the pavement in many<br />\ncases and then, under the action<br />\nof gravity and flexed springs, to<br />\nstrike the pavement a severe blow.<br />\nThe value of this impact load is<br />\nnow susceptible of fairly accurate measurement.<br />\nFrom other experiments conducted at the same station, it is<br />\nalso believed that material such as<br />\nconcrete, whose elastic properties<br />\nare well known under static conditions, behave differently when<br />\nsubjected to rapid applications ot<br />\nloads.<br />\nThe whole question of proper<br />\nconcrete highway design, involving the expenditure of millions of<br />\ndollars, depends upon accurate<br />\nknowledge of these elastic properties.<br />\nThe investigation will be in<br />\ncharge of Professor J. Trueman<br />\nThompson of the Civil Engineering Faculty, who has been serving for the past four summers in<br />\nthe capacity of Highway Research<br />\nSpecialist in the Bureau of Public Roads. The testing apparatus,<br />\ndesigned by Professor Thompson,<br />\nwill be built in the University<br />\nshops beginning immediately and<br />\nwill be located in the \"Concrete<br />\nLaboratory,\" C. E. Building.<br /><br />\nToo much credit cannot be given to the team and to the coaches.<br />\nTo the team, naturally, goes our unanimous praise and vote of appreciation. A heavier team, conceded the odds in every department of<br />\nthe game, failed to score against the Hopkins squad. This fact in<br />\nitself speaks for the calibre of a Hopkins eleven. The Band and<br />\nthose loyal rooters who followed the game also deserve a share of<br />\nthe praise. After praise-giving to these elements, too many of us PLAY BY PLAY ACCOUNT OF<br />\nGAME<br />\nare likely to forget others to whom credit is due.<br />\nFootball games, it has been said, are won and lost on the practice<br />\nfield. The success of any team when it gets in a game depends<br />\nlargely on the character of the practice it has had, for no matter how<br />\nstrong the offensive tactics may be, a team is well on the way to<br />\ndefeat when its defense is weak. It is the maltreated, forgotten<br />\n\"scrub,\" who, to those not too well informed, keeps in because he<br />\nhasn't sense enough to quit, that turns out the well rounded varsity<br />\nteam. The scrub player is absolutely essential. In many cases the<br />\nscrub gives his time and energy daily for four years that winning<br />\nteams may be produced. Yet, in many cases he receives no reward.<br />\nAs the farmer is to the soldier in time of war, so is the scrub to the<br />\nteam. He is \"the man behind the lines\" who is a measure of fighting<br />\nstrength. The scrub, then, should rightly share honors equally with<br />\nthe \"first team.\"<br />\nWithout any one of these elements, the team would not have<br />\nplayed so well on Thanksgiving Day. To teamwork on and off the<br />\nfield we owe our success.<br /><br />\nSHERWOOD EDDY<br />\nA world figure in Christian leadership, one with twenty-four<br />\nyears' experience in international religious affairs, comes to Johns<br />\nHopkins to address the student Assembly on \"World Problems.\" Mr.<br />\nSherwood Eddy, Yale '91, is the guest of the Y. M. C. A. and of the<br />\nUniversity and as his hosts it behooves us to display to him such<br />\ncourtesy as befits a man of his position in world affairs.<br /><br />\nFirst Quarter<br /><br />\n\\\\COLOGNE<br /><br />\nSSELS<br />\n,<br />\n11 N tLIEGE<br /><br />\n\\\\\\<br />\nN<br /><br />\nLow Cost Trips<br />\nto EUROPE<br />\nSummer of 1925<br />\nHY don't you plan to go to Europe next sumW<br />\nwithin your means.<br />\nmer? You can—at a<br />\nLast summer thousands of students and teachers<br />\ncost<br /><br />\nlearned how to do it. On one voyage of the Leviathan alone over 70institutions were represented by<br />\n225 students and teachers. In 1925 thousands more<br />\nwill en;oy the pleasures of a European trip. You can<br />\nbe one of them if you will only get the facts.<br />\nThe United States Lines have made it possible for<br />\nAmericans to go abroad comfortably yet economically. Exclusive accommodations, formerly third<br />\nclass, have been prepared and reserved on U. S.<br />\nGovernment ships. The cost of passage is only $85<br />\nand up. This includes clean, comfortable cabins,<br />\ngood food, willing service, exclusive deck and<br />\ndancing space, and many other features.<br />\nYou can learn all the details bysending the coupon<br />\nbelow. Illustrated literature,including a Princeton<br />\nProfessor's account of his trip last summer will be<br />\nsent you at once. Varied itineraries to help you<br />\nplan your trip are included in this booklet. Start to<br />\nmake your plans now. Talk them over at home during the Christmas vacation. But get the facts now.<br /><br />\nUnited States Lines<br />\nNew York City<br /><br />\n45 Broadway<br /><br />\nManaging Operators for<br /><br />\nU. S. SHIPPING<br /><br />\nOARD<br /><br />\nLocal Representative<br /><br />\nUNITED STATES LINES<br />\nNew York City<br />\n45 Broadway<br />\nStudents' Tours Dept. 863MB<br />\nPlease send me literature including the booklet-\"Low<br />\nCost Trips to Europe.\"<br />\nIf I go date will be about<br />\npersons in my party.<br />\nThere will be<br />\nName<br />\nAddress<br /><br />\nmade 2. Turnbull kicked to Pugh<br />\nSecond Quarter<br /><br />\nTaylor made 1 off tackle and<br />\nTurnbull booted to Maryland's 8yard line. Heine punted back to his<br />\n45-yard line. Turnbull lost 8 around<br />\nSupplee's end but Taylor made it<br />\nup around right end, then made 5<br />\nmore off tackle. Turnbull's dropkick went into the line and Hopkins<br />\nrecovered. Taylor lost 12 and a penalty for holding made a total of 15.<br />\nTaylor punted to the 20-yard line.<br />\nAlmy went in for Blandi who was<br />\nhurt. Pugh made 10 more and first<br />\ndown. The line held and Heine<br />\nkicked to Taylor on his 15-yard line.<br />\nHe returned the ball 10 yards. Turnbull and Taylor made 5 but it was<br />\nlost when Hopkins was penalized<br />\nfor being off side. Turnbull made<br />\n1 more, then kicked 50 yards to<br />\nMaryland's 35-yard line. Pugh and<br />\nBesley could not gain. Heine got<br />\noff a 50-yard punt to Taylor. Three<br />\nline plays got 6 yards. Turnbull<br />\nkicked to Pugh on his 30-yard line.<br />\nBesley gained 4 on a fumble then<br />\nbroke away around left end for 35<br />\nOn the next play Mallonee threw<br />\nhim for a loss of 11 yards. Berndt<br />\nthrew Pugh for a loss of 7. The<br />\nhalf ended with the ball on the 50yard line.<br /><br />\nHall kicked off to Taylor, who<br />\nran back 15 yards to the 25-yard<br />\nline. Turnbull gained 3 yards at<br />\ncenter. A pass, Turnbull to Taylor,<br />\nfrom kick formation netted 15<br />\nyards, but Taylor fumbled when<br />\ntackled and Hall recovered for<br />\nMaryland. Pugh and Besley did<br />\nnot gain at center, but Pugh made<br />\n5 off tackle. Blandi blocked Heine's<br />\nkick, Day recovering for Hopkins.<br />\nThird Quarter<br />\nTaylor did not gain on two plays<br />\nTurnbull kicked off to Besley,<br />\nbut Turnbull made 4 at center. His who ran back 15 yards. Pugh got<br />\ndropkick from the 40-yard line was a first down on Maryland's 40-yard<br />\njust short of the goal. Pugh made line. Milanausky replaced Oles.<br />\n9 yards around end. On two more Pugh got first down. Besley and<br />\nplays he made first down. Besley Pugh made it first down. Pugh<br />\ngot 2 off left tackle. Pugh broke made one more and a pass, Besthrough for 10 yards and first down, ley to Supplee, gained 5. Another<br />\nthen made 5 more. A forward pass pass grounded and 'when Besley<br />\ngrounded and Sauerwein made a fumbled Hopkins took the ball on<br />\nfair catch of Hall's poor dropkick down. Three line plays got 6 yards<br />\non the 20-yard line. Taylor's two and Turnbull punted from the 25tries at the line gained 2 and Turn- yard line to Maryland's 35. Besbull punted 42 yards to Maryland's ley and Pugh made 6 in three plays.<br />\n38-yard line. Pugh and Besley Heine kicked to Hopkins' 15-yard<br />\ngained 2. Magill touched Heine's line. Taylor passed to Turnbull for<br />\npunt and it landed at Hopkins' 45- 5. Taylor and Turnbull plunged<br />\nyard line. Taylor and Turnbull<br />\nContinued on page 3 col. 2<br /><br />\n\\<br />\n\\<br />\n:).•<br />\n;:1 \\i,?<br /><br />\n\"'<br /><br />\n,s.<br />\n.45<br /><br />\nSick headwork<br />\nGetting the right tailor, trailing<br />\nwith the right crowd, keeping<br />\nthe \"profs\" properly complaisant all come under this heading.<br />\nBut a tousled, untidy mane and<br />\ndandruff on your \"tuck\" collar<br />\nare always bad form.<br />\nGetting a bottle of \"Vaseline\" hair<br />\nTonic and using it regularly keeps the<br />\nscalp healthy and makes stiff hair look<br />\nsilky. It prevents dandruff and puts on<br />\nthe finishing touch of slick headwork. At<br />\nall drug stores and student barber shops.<br />\nEvery \"Vaseline\" product is recommended everywhere because of its<br />\nabsolute purity and effectiverress.<br /><br />\nVas line<br />\nREG. U.5. PAT. OFF.<br /><br />\nHAIR TONIC<br />\nFor the Health and<br />\nAppearance of the Hair<br />\nChesebrough<br />\nState Street<br /><br />\nmfg. Company (Cons'd)<br />\nNew York<br /><br />\nWrite Your Name with<br /><br />\nSANFORD'S INK<br />\nIt Will Last Forever<br /><br />\nANFORD.S<br />\nFountain Pen Ink<br />\n\"The Ink that Made the<br />\nFountain Pen Possible\"<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, DECEMBER 2. 1924<br /><br />\nghe largest selling qualifts<br />\npencil in the world<br /><br />\nFOR thestudent or prof.,the<br />\n-A- superb VENUS out-rival3<br />\nall for perfect pencil work.<br />\n17 black degrees-3 copying.<br />\nAmerican Lead<br />\nPencil Co.<br />\n220 Fifth Ave.<br />\nNew Yerk<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br /><br />\nTHE GAME, PLAY BY PLAY<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an' indorsement of its views<br />\nby the \"News-Letter,\" which invites the<br />\nfreest discussion of matters of general<br />\ninterest.<br /><br />\nfor 4. Turnbull kicked to Maryland's 30-yard line. Besley plunged<br />\nfor 10 and then 3. Pugh lost 4.<br />\nSauerwein intercepted a pass and<br />\nTaylor and Turnbull made 9 in<br />\nthree plays. Turnbull punted to<br />\nPugh. Three plays failed for Maryland.<br /><br />\nContinued from page 2<br /><br />\nFourth Quarter<br /><br />\nGood Advice<br />\nCollege and Fraternity Stationery<br />\nEditor of the NEWS-LETTER:<br />\nBanquet and Dance Cards, Invitations<br /><br />\nJAS. H. DOWNS<br />\nPRINTER<br /><br />\nSTATIONER<br /><br />\n229 N. CHARLES ST.<br /><br />\nR. G. Loy &amp; Company<br />\n(Robert G. Loy)<br /><br />\nPHARMACISTS<br />\nUNIVERSITY PARKWAY<br />\nAt Charles St.<br /><br />\nNECKWEAR<br /><br />\nSHIRTS<br /><br />\nLeFranc &amp; Ault<br />\n421 N. HOWARD ST.<br /><br />\nGLOVES<br /><br />\nHOSIERY<br /><br />\nJ. F.—APPLE CO.<br />\nMANUFACTURING JEWELERS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\nkiP.TEEEPffiJOIEffE001-0102ggffff<br />\ntrigRADERS<br /><br />\nLOMBARD<br />\n-arEZIEF-ga.<br /><br />\nHub<br />\nBaltimore's Great<br />\nMen's Store<br /><br />\n,<br /><br />\nHeine kicked to Hopkins' 30The Football Schedule<br />\nyard line. Taylor made 6 and<br />\nEditor of the NEWS-LETTER:<br />\nSo the tentative schedule for passed to Turnbull for 16 more.<br />\nWrite for<br />\nfootball for next year is being ar- Turnbull kicked to the 15-yard line.<br />\nbooklet on<br />\nVENUS Pencils and<br />\nVENUS EVERPOINTED<br />\nranged. Well, well, that will be in- Besley made 9 yards in three plays.<br />\nMechanical Pencils<br />\nteresting<br />\nto everyone in view of the Lawrence replaced Turnbull and<br />\n...........sas.rattsuseess.nis<br />\nunusual schedule we had this year. \"Doug\" took Taylor's position when<br />\nAccording to the NEWS-LETTER, the latter's<br />\nhead forced him from<br />\nrecently three schools, Mt. St.<br />\nthe game. Heine kicked to HopMary's, Loyola, and George Washkins' 30-yard line. Hopkins began<br />\nington are not to be included.<br />\nusing the \"huddle\" system and LawThat's all right.. Some mention<br />\nrence gained 3. Turnbull passed to<br />\nwas<br />\nmade that out-of-town schools<br />\nDamon—<br />\nMallonee for 35 more. On a douwould be played, and I want to sug\"What's the matter?<br />\nble<br />\npass Almy made 8 around left<br />\nCan't you read your<br />\ngest to the graduate manager that<br />\nnotes of the lecture?\"<br />\nend. Lawrence made 5 more and<br />\nthere is a rousing good team at<br />\nPythias—<br />\nfirst down. Almy fumbled for a loss<br />\nScranton which we ought to have<br />\n\"No—doggone it. I<br />\nof 3 yards. Turnbull tried a dropskipped over to class<br />\non our schedule—The International<br />\nthis morning without<br />\nkick from the 30-yard line, but it<br />\nCorrespondence School; the famous<br />\nmy Dixon's Eldorado!\"<br />\nwent wide. Pugh and Besley failed<br />\nChicago<br />\nknockouts—the<br />\nsquad<br />\n17 leads—all dealers<br />\nto register a first down and Heine<br />\nfrom Alexander Hamilton Instikicked. Lawrence made 2 and TurnDIXONS<br />\ntute ; and Marston's School is a<br />\nbull reversed his field for 5 more.<br />\ngood one to schedule. These teams<br />\nTurnbull kicked to Maryland's 25ELDORA])<br />\nshould be bargained with and I unyard line. Two line plays failed to<br />\n\"the washerdraiteke<br />\nderstand from reliable sources that<br />\ngain, but Maryland got the ball on<br />\nthe associations in charge of their<br />\nher 40-yard line when a short punt<br />\ngommagmc===z athletics<br />\nwill charge $1 admission<br />\nhit a Hopkins man. Pugh and Ilesinstead of $2.<br />\nley made a first down. Besley made<br />\nSeriously, I'm interested in seefirst down. Besley made a 5-yard<br />\ning a real good schedule for Hoppass. Another grounded, as the<br />\nkins. This year's schedule brought<br />\ngame ended on Hopkins' 20-yard<br />\ndown a tremendous amount of adline.<br />\nverse criticism from students and<br />\nAverage of punts—Hopkins, 42;<br />\ntownspeople. The team is great, so Maryland, 35. Forward passes—Hopkins, 3 out of 4; Maryland, 2 out of 5.<br />\nmake the schedule its equal.<br />\nFirst downs—Hopkins, 4; Maryland,<br />\nSHERWOOD BROTHERS, INC.<br />\nYours truly,<br />\n12.<br />\nISIDORE O'BRIEN<br />\n\"fmtvi,•—•41-..-:,.v.rginprionricaxignatir<br />\nPAGE CAMPAIGN BEGINS<br /><br />\nENGRAVER<br /><br />\n3<br /><br />\nPRUITERS<br /><br />\nand<br /><br />\nSOUTH<br /><br />\nBIRDERS<br /><br />\nSTREETS<br /><br />\nDear Sir: Seniors hear from<br />\ntheir many friends each spring the<br />\noft repeated advice, \"Don't work<br />\nfor a big corporation.\" This is just<br />\none of the forms in which the advice is phrased; there are many others, but they all mean practically<br />\nthe same thing. Why is it that this<br />\nadvice is so prevalent? Why should<br />\nengineers be especially picked out<br />\nto receive this sort of advice? The<br />\nanswers are not easily found, but<br />\na refutation of the advice is readily<br />\nmade to those engineers who are<br />\nexpecting to start their life's work<br />\nthis summer.<br />\nA big corporation presupposes a<br />\nsuccessful corporation, for otherwise it could never have become big,<br />\nand to be successful it must be<br />\npractical. You have the theory but<br />\nyou need practical experience, and<br />\nyou can best get this in a big corporation where many branches of<br />\nengineering are used. From the field<br />\nthus brought before you, you can<br />\nchoose safely the branch which you<br />\nwant to follow throughout your<br />\nlife.<br />\nBut you ask if there is a chance<br />\nfor advancement and is there room<br />\nnear the top. There is plenty of<br />\nroom near the to and if you fear<br />\nthat you cannot push through the<br />\ncrowds at the bottom the big corporations do not want you. They<br />\nwant able, confident engineers.<br />\nMany large electrical corporations<br />\noffer graduate engineers a course<br />\nof one year in the shop to fit them<br />\nfor their real work in dealing with<br />\nelectrical problems as they arise in<br />\nthe manufacturing industry. While<br />\non this course the young engineer<br />\nis under. the supervision of the Educational Department, which at all<br /><br />\nContinued from page 1<br />\nproject has already been stamped,<br />\nhe said.<br />\nWalter Hines Page's most important position was that of United<br />\nStates Ambassador to Great Britain<br />\nduring the war. His \"Life and<br />\nLetters,\" recently published,. sdld<br />\nto the number of more than 86,000<br />\ncopies.<br />\nPlans for the continuation of the<br />\neffort include: a campaign of information through circularization<br />\nof the friends and admirers of Mr.<br />\nPage, and a general educational<br />\ncampaign urging on the American<br />\npublic , the necessity of creating<br />\nsuch a school and obtaining the support of those citizens who believe<br />\nin practical steps for the betterment<br />\nof international relations.<br />\nThe school, if built, will be located at Homewood.<br />\nMAJ. McBRIDE TO INSPECT UNIT<br />\nContinued from page 1<br /><br />\norder • additional rifles and equipment because of the increase in<br />\nsize. A stock of new rifles, belts,<br />\nbayonets, packs and other necessary supplies has just arrived and<br />\nwill shortly be issued to the Sophomores. Those concerned will soon<br />\nbe notified when to apply for this<br />\nequipment.<br />\ntunes is willing to aid him in reaching the decision as to which phase<br />\nof the electrical industry he is best<br />\nfitted for and wants to follow.<br />\nEngineers are trained to think<br />\nfor themselves. Seniors, do not let<br />\nthe fears of your lay-friends spoil<br />\nyour chance of success. Don't overlook the big corporation.<br />\nJAMES ATFRIEND, '24,<br />\nGeneral Electric Co.<br /><br />\nWe Solicit Your Patronage<br /><br />\nBOULEVARD OPTICAL CO.<br />\nOPTOMETRISTS<br /><br />\nOPTICIANS<br /><br />\n3209 Greenmount Avenue<br />\nHomewood 6717<br /><br />\nBaltimore<br /><br />\nSmooth, trim, lustrous hair<br /><br />\nAlorning c4fternoon Evening<br />\nthis will keep your hair<br />\n- in place .<br />\n• •<br /><br />\nHow does your hair look an<br />\nhour after you've brushed it?<br />\nAll out of place—mussed—<br />\nevery which way? Only a<br />\nhint of its trimness left?<br />\nThat used to be the daily<br />\nexperience of most men.<br />\nFor then there was no quick,<br />\neffective way to keep the hair<br />\nalways in place, looking at all<br />\ntimes just as you want it to<br />\nlook. Old-fashioned pomades<br />\nmatted the hair and made it<br />\ngreasy. Water evaporated<br />\nquickly and left the hair drier<br />\nand harder to control than<br />\never.<br /><br />\nA great change<br />\nBut now Stacomb is an essential in the well-dressed<br />\nman's equipment. And everywhere—in college and out—<br />\nyou seesmooth neatly - combed<br />\nhair—natural, soft, lustrous.<br /><br />\nMen have found in Stacomb<br />\nwhat they have always needed<br />\n—an easy, natural way to<br />\nmake their hair lie as they<br />\nlike it best, and stay that way<br />\nfrom morning till night.<br />\nYour hair — however dry<br />\nand straggly, however uncontrollable after being washed—<br />\nwill keep in perfect order all<br />\nday long if you apply just a<br />\ntouch of Stacomb when you<br />\nbrush it in the morning.<br />\nWomen use Stacomb, too.<br />\nWhether the hair is long or bobbed,<br />\nit will lie fashionably close to the<br />\nhead—smooth and lustrous.<br />\nYou can get this delicate, invisible cream at your college drug store.<br />\nNon-staining, non-greasy. In jars<br />\nand tubes (or the new Liquid Stacomb if you prefer). Use Stacomb<br />\ntomorrow morning, and look your<br />\nbest all<br /><br />\nKEEPS THE HAIR IN PLACE<br /><br />\nVeyt•<br />\nCity<br />\naLories,Inc.,<br />\n11.a:orStteet,New York<br />\ngenerous<br />\n--t2n - ar 18tli<br />\ncharge, S<br />\nfree of<br />\n113 W est<br />\nsend rae,Stacorab.<br />\nof<br />\n7-lease<br />\nsample be<br /><br />\nFree Offer<br /><br />\n. . . .. . .<br />\n. . . ....<br />\n.<br />\n.<br />\n•<br />\n•<br />\n•<br />\n•<br />\n.<br />\nr arne<br />\n• • • •.<br />\nP adre s<br /><br />\n..<br /><br />\nTHE JOHNS HOPKINS NE WS-LETTER, DECEMBER 2, 1924<br /><br />\n4<br /><br />\nErnest G.Leimbach<br /><br />\nMUSICAL CLUBS WILL GIVE DR. BLONDHEIM ADDRESSES<br />\nZIONIST SOCIETY ON<br />\nFIRST CONCERT OF YEAR<br />\nJEWISH CONDITIONS<br />\nAT REISTERSTOWN<br /><br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br /><br />\nUPTOWN<br />\nQUALTIES<br /><br />\nDOWNTOWN<br />\nPRICES<br /><br />\nOPEN EVENINGS<br /><br />\nTelephone, Madison 4722<br /><br />\nTHE J. W. HOWARD CO.<br />\nDRAWING MATERIALS<br />\nSURVEYING INSTRUMENTS<br /><br />\nDecember 5 Set as Date. Perform- Next Meeting December 5; Dr. Broadus<br />\nMitchell to Speak. Dance<br />\nance to Be Followed by a<br />\nPostponed<br />\nDance<br /><br />\nReisterstown will be the scene<br />\nof the first invasion of the Musical Clubs in their schedule of the<br />\npresent year. The concert is<br />\nscheduled for Friday evening, December 5, in Caltrider's Hall. A<br />\nlarge number of students are expected to accompany the clubs, especially since there will be a<br />\ndance immediately following the<br />\nmajor event of the evening. The<br />\nprice of admission to the concert<br />\nwill be 50 cents for each person,<br />\nin addition to 50 cents per couple<br />\nfor the dance.<br />\nProgram Arranged<br /><br />\n2422 Madison Avenue<br />\nB altimore, Md.<br /><br />\nDr. Blondheim, of the University faculty, addressed the Zionist<br />\nSociety at their last meeting, Friday, November 21, on the changes<br />\nwhich have taken place recently<br />\nin Europe regarding the status of<br />\nJews. The war brought about a<br />\nstrong nationalistic feeling which<br />\nresulted in amity between the various elements making up each nation.<br />\nTowards the end of the<br />\nwar, however, nationalistic feeling<br />\ndied down and racial antagonisms<br />\nsprang up, bringing pogroms and<br />\nmisery to the Jews of Europe.<br />\nThe causes for such antagonism<br />\nare various. A general desire to<br />\nblame the war on someone, and<br />\njealousy because of the remarkable financial success of Jews, particularly in Germany, are among<br />\nthem. The chief instigators of<br />\nanti-Semitism were the old aris<br />\ntocratic families of Europe which<br />\nhave always been enemies of Judaism. Members of these families, finding their positions threatened by the springing up of republics, and finding that Jews<br />\nwere prospering under republican<br />\ngovernments and even taking part<br />\nin them, sought for selfish motives to rouse Anti-Semitism<br />\namong the people.<br /><br />\nrealized by the clubs that<br />\nfirst impressions have a great deal<br />\nto do with reputations and they<br />\nhave been working hard at rehearsals to complete an elaborate<br />\nVernon 4986<br />\nprogram for their initial public<br />\nperformance. Directed by Mr.<br />\n\"Say It With Flowers\"<br />\nHobart Smock, the Glee Club,<br />\nwhich tried out a number of selections at the Alumni meeting last<br />\nWednesday with great 'success,<br />\nwill present several entertaining<br />\nand varied numbers. The Blue<br />\n1822 N. CHARLES STREET Jay Orchestra, headed by Mr.<br />\nJack Sherr, is well-known to be<br />\nblessed with a pleasant case of<br />\njazzmania and will broadcast syncopation during the concert and<br />\nafter. The Banjo Club, under the<br />\nConditions Improving<br />\ndirection of Mr. Conrad Gebelin,<br />\npromises, before they get through, In 1919 the condition of the<br />\nto have the entire audience keep- Jewish people in Europe was very<br />\ngloomy. Since then, however,<br />\ning time with their feet. A violin<br />\nSOPHOMORES<br />\nthere has been much improvesolo by Mr. Light, a piano solo by<br />\nFRESHMEN<br />\nment, most of which is due to the<br />\nMr. Harris, a J. H. U. medley by<br />\nnew European Republics, that are<br />\nthe versatile Steinwald, a xylogrowing stronger daily. In Europhone solo by Mr. Boyd, and a<br />\npean countries, where formerly<br />\nsaxophone selection by Mr. Scherr<br />\nthe Jews lived to themselves and<br />\nwill round out the bill.<br />\nspoke their own language, they<br />\nThe program as arranged is as<br />\nRESTAURANT<br />\nnow live among the other inhabifollows:<br />\ntants of the country. The decline<br />\n1817 N. Charles St.<br />\n1. The Glee Club<br />\nof Anti-Semitism has somewhat<br />\n(a) The University Ode,<br />\nweakened the Zionist movement,<br />\nDevries as<br />\nit has removed one of its causes<br />\nOpen All Hours<br />\n(b) Estudiantina ....Lacome<br />\nbut that movement is still pro2. The Banjo Club<br />\ngressing steadily.<br />\nMoonlight Waltz.Nightingale<br />\nThe next meeting of the Zionist<br />\n3. Violin Solo, by Mr. Light<br />\nNear Your Campus<br />\nSociety will be on Friday, DecemCanzonetta....A. d'Ambrosio ber 5, when Dr. Broadus Mitchell<br />\n4. The Glee Club<br />\nwill speak. A study circle is beDe Sandman...... .Protheroe ing orzanized by the society for<br />\n5. Piano Solo, by Mr. Harris<br />\nthe study of Zionist questions and<br />\n(a) Waltz in B Minor.. Chopin literature. Plans will soon be an(b) Novellette .....McDowell nounced.<br />\n6. The Blue Jay Orchestra<br />\nBecause the varsity club is hav(a) Popular Selections<br />\ning a reunion meeting of the alum(b) Xylophone Solo, by Mr. ni on November 26, the dance<br />\nBoyd<br />\nwhich the Zionist Society had<br />\n7. Our Alma Mater in Dixieland planned for this date was postMedley, by Mr. Steinwald poned. December 6th is a tenta8. The Banjo Club<br />\ntive date for this affair.<br />\nFieldson March....Kitchener<br />\n9. Saxophone Solo by Mr. Scherr<br />\nHOPKINS-U. OF M. GAME<br />\n10. The Glee Club<br />\nLATEST STYLES AND FORMS<br />\nContinued from page 1<br />\nCossack War Song....Parker<br />\nPlenty of publicity has been giv- final whistle blew the ball was on<br />\nEngraved<br />\nen this concert in Reisterstown the Hopkins 20-yard line.<br />\nWEDDING INVITATIONS,<br />\nMaryland (0)<br />\nANNOUNCEMENTS AND<br />\nand a crowded hall is expected. Hopkins (0)<br />\nSupplee<br />\n•<br />\nVISITING CARDS<br />\nThe respective leaders have spent Mallonee<br />\nBromley<br />\nMagill<br />\na great deal of time in preparation Oles<br />\nLuckey<br />\nSAMUEL H. KIRBY for this event and they want the Day<br />\nLewis<br />\nR G<br />\nHough<br />\nSlowik<br />\nENGRAVER<br />\nstudent body behind them in their Levy<br />\nR T<br />\nBurger<br />\nR E<br />\nBeatty<br />\nfirst attempt. \"If long rehearsals Berndt<br />\nSamples and Prices on Request<br />\nBosley<br />\nTaylor<br />\nQ B<br />\nand determination mean any- Turnbull<br />\nL H<br />\nPugh<br />\n42 SOUTH ST.<br />\nBALTIMORE<br />\nR H<br />\nHeine<br />\nthing,\" said one of the members, Sauerwein<br />\nF B<br />\nHall<br />\nBlandi<br />\n\"there will be a tuneful time in the<br />\nSubstitutions—Hopkins, Almy for<br />\nold town that night.\"<br />\nBlandi, Milinausky for Oles, Lawrence<br />\nORDERS RECEIVED FOR<br />\nDuring the second week in Jan- for Taylor; Maryland, Bonnett for<br />\nBromley. Referee—Harry Fisher, Couary another concert will be held lumbia. Umpire—W. R. Crowley, Bowin the ballroom of the New Wil- doin. Head linesman—H. R. Heneage,<br />\nDartmouth. Field judge—J. J. Coslard Hotel in! Washington and grove, Cornell. Time of quarters-15<br />\nTransfer.8E Baggage Express<br />\nlater, in the first part of February, minutes.<br />\nNote—A play by play account of the<br />\nAUTOMOBILE SERVICE<br />\na concert will be given at the Delgame will be found on page 2, colPHONE, HOMEWOOD 6886<br />\naware College, at Newark.<br />\numn 3.<br /><br />\nSMITH &amp; CO.<br />\nFlorists<br /><br />\nIt is<br /><br />\nCan you wiggle your ears?<br />\nCan you do anything that makes you stand<br />\nout from others at parties, soirees or at the<br />\nfraternity?<br />\nIn a few lessons I can make you so proficient in magic tricks that you will be the<br />\ncenter of attraction.<br />\nThe tricks are simple and anyone can do<br />\nthem. I guarantee to teach YOU so that<br />\nyou can do them.<br />\nI will be glad to demonstrate at your frat<br />\nrooms or boarding house.<br />\nPhone Mr. Bagby, Plaza 7440 or Forest<br />\n7033-J for appointment.<br />\nThree lessons, $5.00.<br /><br />\nJohns Hopkins Students Will Find A Welcome At<br />\nMOUNT VERNON PLACE<br />\nMETHODIST EPISCOPAL<br />\nCHURCH<br />\n(At the Washington Monument)<br /><br />\nREV. OSCAR THOMAS<br />\nOLSON, D.D.,<br />\nMinister<br /><br />\nSENIORS<br /><br />\nSunday Services of Worship<br />\n11 A. M. and 8 P. M.<br /><br />\nJUNIORS<br /><br />\nThe Sunday afternoon \"at home\"<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nRoom is a social occasion that brings<br />\ntogether the student groups from Hopkins, University of Maryland, Goucher,<br />\nPeabody, and other schools of Baltimore.<br />\nEpworth League at 7 P. M. and the<br />\nBible class at 10 A. M. are built particularly with the needs of the young<br />\npeople in mind.<br /><br />\nSt. Regis<br /><br />\nLondon Pipes<br />\nCollege Styles<br />\nMilano and handmade and many<br />\nOthers at<br />\nThe Barn<br /><br />\nCOGGIN'S<br /><br />\nBRANCH<br />\nAT THE BARN<br /><br />\nbf<br /><br />\n/vet.<br /><br />\nCharles<br />\nist<br />\nt m<br />\nN.a<br /><br />\nTOM MAGILL,<br />\nManager<br /><br />\nDOUG 'TURNBULL<br />\nRepresentatives<br /><br />\nBaltimore's Best Store<br />\nHOCHSCHILD,KOHN<br /><br />\ngc Co.<br /><br />\nHoward and Lexington<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nXWCornerCjavelie and 6Putaw Sts.<br />\n-Where Wholesale and Retail Districts Meet\"<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n41Besides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nDRAPERIES<br /><br />"}], "field_media_file": [{"target_id": 37917, "display": null, "description": null, "target_type": "file", "target_uuid": "c78b4559-5201-4961-b21c-0ca52e583dea", "url": "http://digital.library.jhu.edu/system/files/2022-03/13147-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13147, "target_type": "node", "target_uuid": "9aa802ad-53b5-4009-bb3e-011884e99062", "url": "/node/13147"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "33fba2ff-45f8-43ef-a7f4-de6a36ef7b37"}]}