{"mid": [{"value": 37519}], "uuid": [{"value": "565c364e-9c41-42f0-9e17-667f03591ec1"}], "vid": [{"value": 37519}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:34:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13372-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:34:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:34:11+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "JEMISEGIBMWSPIMER<br />\nVol: XXXIII, No. 46<br />\n<br />\nSOPHOMORES VICTORS<br />\nIN INTERCLASS MEET<br />\n<br />\nWOMEN'S CLUB TO GIVE<br />\nTEA ON WEDNESDAY<br />\nThe Johns Hopkins Wo75<br />\nmen's Club will hold a tea on<br />\nnext Wednesday afternoon at<br />\nfour o'clock in their rooms on<br />\nthe third floor of Gilman Hall.<br />\nBoth students and faculty are<br />\ninvited to attend.<br />\n-711his is the second large<br />\nsocial function the Women's<br />\nClub has given in the last<br />\nmonth, a bridge party having<br />\nbeen given previously.<br />\n<br />\nCAMPUS RESUMES CUSTOMARY<br />\nQUIET AFTER BANQUET SCRAPS<br />\n<br />\nA. A. CARDS MUST<br />\nBE RESTAMPED<br />\nMr. Henry Iddins, Business<br />\nManager of the Athletic Association, requested on Saturday that all men in the University should take their A. A.<br />\ncards to the postoffice,and have<br />\nadditional numbers placed on<br />\nthem.<br />\nWhen these cards were<br />\nprinted in the fall, no allowance was made for basketball<br />\ngames, consequently a lack of<br />\nnumbers has resulted. All men<br />\nare asked to attend to this<br />\nmatter immediately.<br />\n<br />\nJAYS LOSE TO ARMY<br />\nLACROSSE TEAM 4-1<br />\n<br />\nOnce more the campus has as- In clearing up the terminology,<br />\nsumed its wonted academic quiet, the following explanation may throw<br />\nHopkins Defense Repulses<br />\nSeveral Promising Track Men<br />\nand interclass-animosities die gently some light on the case: ban meanOnslaught for Half<br />\nShow Up in Meet<br />\namid a flood of 'reminiscences and ing restriction, and quit meaning<br />\nIS STAR<br />\nBROWNLEY<br />\nSENIORS ARE SECOND<br />\nexaggerations (which is just another leave, banquet may be a corruption<br />\nor disalleave,<br />\nmeaning<br />\nbanquit,<br />\nis<br />\nof<br />\nPlays<br />\nseason<br />\nGoalie<br />\nClever<br />\nway<br />\nof<br />\nthe<br />\nsaying<br />\nbanquet<br />\nUntil<br />\nResult Undecided<br />\nStirring Game<br />\nlow, restrictions. That seems much<br />\nover).<br />\nLast Event<br />\nTwo' years ago, girls and boys, more logical than its having any refArmy's sterling lacrosse twelve<br />\nAmidst the russet shades of twithere was a banquet season that was erence to feasting.<br />\ndefeated the Blue Jay team 4-1 in a<br />\nbattled<br />\nGarrett<br />\nand<br />\nHershey<br />\nlight,<br />\nupon a Two, results, principally, seem to<br />\nOnce<br />\nname.<br />\nof<br />\nworthy<br />\nthe<br />\nwell played game last Saturday. The<br />\nthrough the broad jum-p for a retime, you know, freshmen and so- follow the new attitude toward the<br />\nwonderful condition of the Cadet<br />\nspective class victory, in Friday's<br />\nto<br />\nright<br />\nwere<br />\nhe<br />\ncouncils<br />\nand<br />\n—<br />\nstudent<br />\nphomores<br />\nbanquets. Deprived<br />\nteam was a big factor in the victory.<br />\ninterclass track meet. Their ardor<br />\nnot so solicitous of their fellows' vent their youthful vitality upon one<br />\nDuring the first half the Jay deresulted in a tie at 19 feet 9 inches,<br />\nboard,<br />\nendwell-being, and banquets often<br />\nanother about the groaning<br />\nfense was called upon time and time<br />\nwinning the meet for the clftsc of<br />\nexed in the direst disorder.<br />\nthe class rivals must take their<br />\nagain to give its utmost to stopping'<br />\n1932, by one-half point. The final<br />\nWell, to resume, two years ago a ercise during the three-day season<br />\nthe West Point team and in every<br />\nscore was Sophomores 37, Seniors<br />\nunanimous and ambitious sopho- preceding, and turd to new sources<br />\ncase was successful. In the second<br />\nT 2, and Jun36'/, Freshmen29/-'<br />\nmore class—stilted seniors they are of excitement on the night itself<br />\nhalf the Cadets swept down on the<br />\n.<br />\nRyan, Thomas, Ludwig, and Cal- today—raised banqueting to its high- These sourdes are reported adequate<br />\niors 14.<br />\nJay goal like an avalanche and kept<br />\nMoore Wins Dash<br />\nverton Speak to Students<br />\nest degree of perfection, and thereshooting at the Black and Blue goal<br />\nWhatever may be the shortcomIn thy 100-yard dash, Moore -2(.)<br />\nby killed the art.<br />\nuntil even the peerless work of Corof recent frosh-soph hostilities,<br />\ning<br />\nARE<br />\nHELD<br />\nGROUPS<br />\nSTUDY<br />\nhandia<br />\nwith<br />\n10.2<br />\nseconds,<br />\nIs<br />\nLawyer<br />\nin<br />\nwon<br />\nNoted Criminal<br />\nAll that's an old story; in fact, it the campus for the past few days<br />\nner Brownley, Hopkins goal tenAcclaimed by Crowd<br />\ncap of 5 yards. Second place was Reports Show Weakness of Lib- is already canonized as a campus<br />\nordithan<br />\nder, could not stop them from makseemed even more calm<br />\nawarded to Linde '32, and third to<br />\neralism in Local Colleges<br />\ntradition, and must be reverenced by narily. During the week that the \"Religion through ignorance, ing a score. Soon after the tying<br />\n- Nett '31. Two heats were necesall frosh, although contemned by season lasts, there stalks about an morality through law, govern- count the Cadets scored again to<br />\nThirty-three delegates from Johns moody grad students. Although the<br />\nsary to settle this dash.<br />\nair of expectancy. No one knows ment through acquiescence, and make the score 2-1 in their favor.<br />\nMorrison '31 won- the 220-yard Hopkins attended' the Intertollegi- Annapolis celebration caps the cliat what moment or from what quar- convention by hypocrisy,\" is the From then on until the half was aldash from scratch in 23.3 seconds. ate Liberal Conference held at the max, the freshman banquet, afloat<br />\nter or with what force, the next credo of the American people to- most over the ball was in the posHe was followed closely by Perry Friends Meeting House on April an the Chesapeake, of the preceding<br />\nblow will fall. No, member of either day, said Arthur Garfield Hayes session of the Cadet team most of<br />\n19-21. Over one hundred delegates year, deserves special consideration<br />\n'32, and Scheidt '30,<br />\nlower class is altogether safe at any in addressing the student body at the time.<br />\nLitich '32 won the 440-yard dash from seventeen American colleges and can serve as an example of the<br />\ntime during that period. It is a<br />\nPlayingi<br />\nThursday,. Mr.<br />\nwith a five-yard handicap, in 54.4 were at this gathering sponsored by best expression of the eating art. time when even the lowliest can just- the assembly last<br />\nThe West Pointers had a well<br />\nthe<br />\nby<br />\nhere<br />\nbrought<br />\nwas<br />\nHayes<br />\nHopand<br />\nJohns<br />\nEthics<br />\nand<br />\nsecond<br />\nthe Goucher<br />\nseconds. Lockard ran<br />\nEating, children, is a misnomer. ly attach some importance to his<br />\nPi Lambda Phi fraternity of balanced team and were playing at<br />\nkins Liberal clubs. In addition to Eating is the last thing thought of<br />\nPerry third.<br />\nperson. The most indifferent feels which he is a member. As coun- the top of their form. They made<br />\nYellott won the hard-fought 880- these two inStitutions George Wash- at a proper class banquet. Certain irrepressiblY-the unity of the class<br />\nAmerican Civil Liber- the most of their opportunities and<br />\nyard 'dash from scratch in 2 min- ington, Hood (Maryland), Western other elements, unmentionable here, and his identification with it when sel for the<br />\nhe has made -quite a deserved the victory. The Hopkins<br />\nutes 11 seconds., Loiseaux and Mil- Maryland, Maryland State Normal enter in which quite eclipse the sat- from any direction and from any ties Union<br />\nname for himself throughout the defense functioned well, better in<br />\nler trailed him to the finish line. School, Maryland Institute, Mary- isfaction of the_ gastronomic sense.<br />\nindividual there goes up the cry of country in his various endeavors fact than it has any other time this<br />\nThe One Mile<br />\nland College for 'Women, St. One is often hard put to. it to un\"Sopho• to preserve the original _freedom season; the attack showed momen•The one-mile run was by far the John's, Morgan, American Univer- derstand why the name banquet was a classmate in trouble:<br />\ntary flashes of good form but for<br />\nof the American Constitution.<br />\nmores!\" \"Freshmen !\"<br />\nmost thrilling event of the day. Here sity, Boston University, University employed.<br />\nthe most part were unable to recover<br />\nSubject<br />\nRomano got off .to a flying start, of Montana, Princeton, and Yale<br />\nthe ball after one shot had been<br />\n\"Morality through law\" was<br />\nFrosh Feast Closes<br />\n• with his 150-Yard handicap, to lead were represented. Students now Y. M. C. A. to Install<br />\nmade at the Cadet goal. One reason<br />\nbefore<br />\naddress<br />\nhis<br />\nof<br />\nsubject<br />\nthe<br />\nwhen<br />\nthe<br />\nlaps,<br />\nfrom<br />\nthree<br />\nfor<br />\ncame<br />\nthe pack around<br />\nstudying in America<br />\nAnnual Banquet Season<br />\nthe Jay attack may not have gone so<br />\nTonight<br />\nOfficers<br />\nNew<br />\ntrend<br />\ngeneral<br />\nThe<br />\ndash,<br />\nassembly.<br />\nthe<br />\nhis pace started to tell. This<br />\nEuropean universities of Mostosl.<br />\nmembers of the<br />\nwell is that the West Point team<br />\nTonight the Johns Hopkins Y. M. Over one hundred<br />\nof the country today, Mr. Hayes plays a very odd form of defense<br />\ntoo, saw Kelley run a beautiful race Paris, Berlin, and Vienna. - Alany<br />\nfreshman class attended their aninstallation<br />\nannual<br />\nits<br />\nhold<br />\nwill<br />\nA.<br />\nC.<br />\nenthe<br />\nbrought out, is toWard<br />\nfrom scratch, though he was unable liberal, religious, and labor organiand with its inexperience the Jay<br />\nlast Friday night at<br />\nof officers and snanner conference nual banquet<br />\nforcement of moral principles by<br />\nto overcome the terrific handicap un- zations also sent delegates.<br />\nNew Howard Hotel.<br />\nthe<br />\nattackers were unable to solve their<br />\nFriends<br />\nthe<br />\nin<br />\nM.<br />\nP.<br />\n6.30<br />\nat<br />\ndinner<br />\nlegislation. Half the people are<br />\nFour Addresses<br />\nder which he was placed. Loiseaux<br />\nGrafton Herpsber- The banquet began at nine o'clock afraid that the other half are be- difficulty.<br />\n'29 ran this distance -with a handi- Four scheduled addr,;ses were Meeting House.<br />\nof the \"Y\", will and lasted until midnight. Just be- coming immoral and so are writCadets at Top of Form<br />\ncap of 75 yards, in 4 minutes 42 given by speakers representing all ger, vice-president<br />\nAs usual the game was a model<br />\nThe program fore the \"eye and ear\" entertain- ing this moral legislation upon<br />\nseconds. Every inch of his victory phrases of liberalism. These were act as toastmaster.<br />\nmusical numbers, a ment began, many upper classmen the statute books of the Nation. of clean playing and good sportswas contested by Miller '31, and open to the general public and many includes several<br />\nadmittance<br />\nJohn Mount and a duet by' rrived and requested,<br />\nby<br />\nsolo<br />\nOn<br />\nattended:<br />\npersons<br />\nThe widespread agitation against manship. There were very few peninterested<br />\nEmerson '31.<br />\nDonald Van- which at first was .denied them. In obscenity of all sorts was cite('<br />\nand<br />\nSherwood<br />\nR.<br />\nJohn<br />\nA.<br />\nJohn<br />\nFather<br />\nevening;<br />\nFriday<br />\nalties on either side and several of<br />\nitrland Hershey dashed throng'<br />\nwere<br />\nthey<br />\nhowever,<br />\nwhile,<br />\nshort<br />\na<br />\nof the class of '23. Edward<br />\nas an example of this trend. The those that were inflicted were for<br />\nthe 110-yard high hurdles in 16.1 Ryan gave the opening speeds on ileman<br />\nadmitted.<br />\nIntercolThe<br />\npresent<br />\nwill<br />\nBeall<br />\nT.<br />\nNorLiberalism.\"<br />\nof<br />\nTheodore<br />\ncasg in Boston against<br />\nseconds. Kelley '29 finished slightly \"The Meaning<br />\nviolation of the off-side rule and not<br />\nC. A. paper,<br />\nDreiser's \"American Tragedy\", for<br />\nman Thomas spoke Saturday, after- legian, national Y. M.<br />\nbehind his classmate.<br />\nroughness.<br />\npresentbe<br />\nwill<br />\nCabinet<br />\nnew<br />\nthe<br />\nand<br />\ninElects<br />\nPhi Beta<br />\nwhere a jury composed of meHershey gained another victory noon, at complimentary luncheon<br />\nThe work of Brownley was uned by William Purnell Hall, retirchanics, plumbers and clerks was<br />\nStudents<br />\nGraduate<br />\nin the 220-yard low hurdles in 27 his honor, on \"Our Interdependent<br />\ning president. The installation servdoubtedly the feature of Jays' playseconds. Morrison '32 and Scheidt World and I low We Run It.\" That<br />\nelected to 'the Maryland called on to decide whether this<br />\nice will be conducted by Dr. John C. The men<br />\na less capable goal tender<br />\ning—with<br />\nis<br />\nillustrative<br />\nimmoral,<br />\nwas<br />\nbook<br />\nwhose<br />\n'30 trailed the leader home. The evening he discussed \"The College<br />\nKappa<br />\nChapter of Phi Beta<br />\nFrench.<br />\nonly accident of -the day occurred Student as a Potential Voter.\" Sunappear in the last is- of the fight which a puritanic ele- the score would have surely been<br />\nnot<br />\ndid<br />\nnames<br />\nofficers to be installed are:<br />\nment of Anytirican Society is wag- very much higher.<br />\nwhen Stafford injured himself at the day morning Walter Ludwig .pre- The<br />\nGeorge sue are:<br />\nsented \"Students in Industry.\" That Edwin Lockhard, president;<br />\nsixth hurdle.<br />\nStudents in Philosophy ing. Mr. Hayes said he would<br />\nGraduate<br />\nDespite the fact that the jay team<br />\nvice-president; William<br />\nThe high jumps ended in a tie afternoon A,II. Calverton gave the H. Dowell,<br />\n—Paul Acquarone, Leonard B. rather have the jury, made up as lost the game its stay in West Point<br />\nJones,<br />\nRoswell<br />\nand<br />\nsecretary,<br />\nStudent<br />\nOlsen,<br />\nthe<br />\n\"What<br />\nworking<br />\nordinary<br />\nfor first and third- places. Peake closing address,<br />\nClark, Lancaster E. Dabney, Albert it was of the<br />\ntreasurcr. The other members of<br />\nwas very pleasant and it was with<br />\n'31 and Rosen '32 were tied for first Can Do.\"<br />\nB. F. Duncan, Aaron M. Margalith, class, decide the case than trust<br />\nchairmen,<br />\ncommittee<br />\nCabinet;=<br />\nthe<br />\n,<br />\nRegional Group Is Planned<br />\nWellington A. it to the...judge. The great fear regret that the Jay players left the<br />\nMylonas,<br />\nE.<br />\nplace ,with jumps of five feet one<br />\nGeorge<br />\n'new presiSaturday niorniq was devoted to will be announced by the<br />\ninch. Colburn and 'Hershey, both<br />\nParlin, Edward F. Richards, Law- which the reformers all have is home of the Army. The Hopkins<br />\ntopics. The dent tonight.<br />\nrence H. Schultz, Louise C. Seibert, that \"youth\" will be Corrupted by twelve was quartered in the new hojumped four feet eleven inches. All a study of the following<br />\nBoard of Managers<br />\nLabor Party Movement in the U. S..<br />\nRichard E. Vollrath, Edward H. these so-called obscenities. The tel, an innovation in the Army prohad handicaps of six inches.<br />\nof the<br />\ndesire is primarily to protect<br />\nThe Board of Managers for the Watson, Theodore M. Whitfield.<br />\nPeake captured the pole vault Dollar Diplomacy, Criticisms<br />\nRoads to coming year consists of Dr. John C. Graduate Students in Medieine--- youth, though, said Mr. Hayes, gram (former teams' having been<br />\nwith a jump of 11.6 feet from a Present Order, Proposed<br />\nof Na- French. chairman, Drs. Joseph S. Douglas Barnes Remsen, Howard middle age is far more in need of housed in regular barrack\"), where<br />\nhandicap of 2.5 feet. Scheidt '30 Freedom, and The League<br />\n'Reports of<br />\nAmes, G. H. Cartledge, and John H. Atkinson Howe, Theodore Judson protection than youth, because the Cadet team gave the Hopkins<br />\nvaulted 11.3 feet from scratch. tions and World Peace.<br />\nthe eampii<br />\nyouth is always inclined to retain squad a banqtiet. After the banquet<br />\nQuirk '30 sailed over the bar at 'the state cif liberalism on<br />\nW. H. Swarz, Purnell Hall, Abernethey.<br />\nLatane,<br />\nOf those colleges present revealed Walter Frey, Edwin Lockard, T. Members of the Academic Staff— certain ideals which middle age the Jays attended the regular Satur11 feet, .from scratch.'<br />\ndevelbe<br />\nto<br />\nyet<br />\nWilliam Mansfield Clark, Ernest loses as it becomes cynical. day dance in a body.<br />\nRooney.--threw the shot- for .38 the fact that it is<br />\ncolleges, es- Reese Marsh, Lewis C. From, John<br />\nFeise, Edwards Albert Park.<br />\nfeet, with a handicap of 8 feet,, to oped in most Maryland<br />\nThese very reformers never ad- The score of die game gives Jay<br />\nSherwood,<br />\nW.<br />\nJohn<br />\nreliSherwood',<br />\nor<br />\nR.<br />\nwin first place. Mahler, Hershey. pecially those under state<br />\n-resolution<br />\nMilmit the deleterious 'effect of what fans little to be happy over but the<br />\nJr., H.<br />\nTurnbull,<br />\nformal<br />\nC.<br />\nA<br />\nDouglas<br />\ncontrol.<br />\ngious<br />\nfor<br />\ntied<br />\nFarr, and Romano were<br />\nthe Con- ton Wagner, and Clark T. Wisotz- Hopkins Awards Nine.<br />\nauthorizing<br />\nsay is obscene on them- coaching staff is far from discourthey<br />\nadopted<br />\nwas<br />\nsecond place with 36 feet all.<br />\nference chairman to appoint a com- ski.<br />\nselves, but are always fearful aged. With two more games under<br />\nFellowships<br />\nChemical<br />\nDiscus Throw<br />\nplans for an inThe discus witnessed the keenest mittee to prepare<br />\nThe Summer Conference dinner<br />\nAnnouncement of the awards of -that the other fellow will suffer its belt the Jay club will be ready to<br />\nliberal association in<br />\ncompetition of the meet. At this tercollegiate<br />\ntake on its ancient rival, St. John's.<br />\nis a new item of this year's pro- fellowships, under a recently estab- from its effects.<br />\nCoof<br />\nDistrict<br />\nthe<br />\nand<br />\npoint, a victory for either the Fresh- Maryland<br />\nthis time former dele- lished system at the Johns Hopkins<br />\nMencken Case<br />\nAt<br />\nArnold<br />\ngram.<br />\nnight<br />\nLine-up:<br />\nSaturday<br />\nmen or Sophomores threw them in- lumbia.<br />\nSeveral years ago when Henry<br />\nQuestion of gates will tell of their experiences University, by which the winners<br />\nArmy<br />\nliopkins Position<br />\nto the lead. Dorman '32 threw 110 Bennett's farce, \"A<br />\nfor the Confer- and efforts will be made to interest will follow a more intensive course L. Mencken was arrested in Bos- Brownley<br />\nGoldberg<br />\nG<br />\nfeet from scratch, and Burke '31 Sex,\" was enacted<br />\nPlayers.<br />\nCosmopolitan<br />\nHammack<br />\nP<br />\nthe undergraduates in this confer- in chemistry, was made yesterday by ton for selling the \"American Hall<br />\nalmost threw consternation into the ence by the<br />\ntalks,<br />\nEdsom<br />\nAt the conclusion of the<br />\nC.P<br />\nence, held at Eagles Mere, Pa., in D. J. C. W. Frazer, chairman of the 'Mercury\" on the Boston Com- Cone<br />\nhands of the Freshmen with a throw<br />\nanwere<br />\nfloor<br />\nKenny<br />\nID<br />\nof - 109 feet under an 13 foot handi- uestions from the<br />\nspeaking on this sub- chemistry department at the institu- mons with a supposedly obscene Kegan<br />\nAlumni<br />\nJune.<br />\nspeakers.<br />\nMcBride<br />\n2D<br />\nswered by each of the<br />\nCaplan<br />\ncap.<br />\nand,<br />\nSteuart,<br />\nacquitted<br />\nwas<br />\nA.<br />\nhe<br />\nit,<br />\nin<br />\nGeorge<br />\nstory<br />\nDr.<br />\ntion.<br />\ninclude<br />\nrevealed opposition to Father ject<br />\nLovell<br />\n3D<br />\nNickel<br />\nExact measurements were not ob- These<br />\npros- '07, Henry E. Corner, '14, Douglas<br />\nAt the same time Dr. Frazer an- yet, in Cambridie a bookseller Campbell<br />\nSundt<br />\nC<br />\nRyan's defense of the Scopes<br />\ntained in the javelin throw, but Neu<br />\nKing<br />\n3A<br />\nand of the right of those in C. Turnbull, Jr4....24, T. Ray Gai- nt5urited the establishment of four was found guilty of selling tht Guild<br />\n'31 took the,laurel with a 157 foot ecution<br />\nthey<br />\nAyre<br />\n'25, and Joseph Blandi, '28. new fellowships under a plan which same magazine to a Harvard stu- Dukehart<br />\nof schools to teach what<br />\nther,<br />\ncontrol<br />\nhandicap.<br />\nheave from a forty-yard<br />\nIA<br />\nDraper<br />\nA. H. Calverton's sensa- Edwin Lockard,'31, new \"Y\" pres- eventually will give one fellowship dent. The judge wanted to pro- Eagan<br />\nFriz and Plummer of '29 contested desire.<br />\nindictment of the present sys0.H<br />\nO'Kcefe<br />\ntional<br />\ntect youth. Mr. Hayes also cited Love<br />\nident, will tell of last year's gather- to each of the forty-eight States.<br />\nfor second plate with respective<br />\nrewas<br />\ncolleges<br />\nI.H<br />\nLyons<br />\nin American<br />\nContinued on Page 3, Cor 2<br />\nContinued on Page 3, Col. 5<br />\nthrows of-154 and 153 feet from a tem<br />\nhearers. ing at Eagles Mere,<br />\nsented ,by a group of his<br />\nthirty-yard handicap.<br />\n<br />\nTWENTY COLLEGES AT<br />\nLIBERAL CONFERENCE<br />\n<br />\n16<br />\n<br />\nPrice 5 Cespts<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., APRIL 23, 1929<br />\n<br />\nARTHUR G. HAYES IS<br />\nSPEAKER AT ASSEMBLY<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, APRIL 23, 1929<br />\n<br />\nTIIEJOHISHOPEESikvsurrEll<br />\n1897<br />\n<br />\nTHE SPORT SHOP<br />\nSPORTING GOODS<br />\nFishing Tackle<br />\nTennis Equipment<br />\nKenneth Allen Golf Clubs<br />\n<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore. Md., tinder Act of Congress November 3. 10.79.<br />\nPublished semi-weekty from October'to June by the students of Johns<br />\nHopkins University.<br />\nBusiness co.:um:mint-ions should be addressed to the Busirimiss MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MaNaGLsc<br />\nLanni; other communications to the Eurros-IN-CinEF.<br />\nUniversity 0100<br />\n<br />\nTelephone<br />\nEDITORIAL DEPARTMF_NT<br />\n<br />\nEditor-en-Chief<br />\nGEORGE E. BANKS, JR. '29<br />\nA srietant Managing Editor<br />\nManaging Editor<br />\nGEORGE G1:14P, '30<br />\nPima. W. Ngss, '29<br />\nAssociate Editors<br />\nRoam S. BAIRD, '30<br />\nWILMER H. DRIVER. *3<br />\nColumsist<br />\n71-211EN E. Frrzcestair:. '31<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR , 23<br />\nAdvertising Manager<br />\nGeosca M. GI.Azum, '29<br />\nOffice Staff<br />\nTheodore A. Fleishman, '31<br />\nRandolph Rothchild, '31<br />\nJohn A. Jamieson. '31<br />\nLyle 17- Gulley. '30<br />\nHenry V. Saunders. '32<br />\n<br />\nCirculation Manager<br />\nJ. RusErr MYERS. '213<br />\nA drertising Stet\"<br />\nAftin H. Blum. 'JO<br />\nrlcis Burke. '31<br />\nGeorge S. Robertson. '31<br />\nRaffel. '31<br />\nS. Sykes, ''Et<br />\n<br />\nStreets,<br />\nProduced by The Read-Taylor Company, Lombard and South<br />\nBaltimore, Md.<br />\n<br />\nEDITORIAL COMMENT<br />\n.\".)<br />\n<br />\nHe Wasn't to Blame,<br />\nor<br />\nWhat About It, Mr. \"Ben\"?<br />\n<br />\nA MODERN PATRICK HENRY<br />\nGarfield<br />\n<br />\nyears ago, before a packed assembI6 Mr. Arthur<br />\nbody<br />\nHayes, by his dynamic oratory, sent the Hopkins student<br />\n\"<br />\n<br />\nT<br />\n<br />\nhe proved him-.<br />\ninto paroxysms of enthisAasm. In his forceful speech,<br />\ndeclared -himself an<br />\nself a bitter foe of hypocrisy and bigotry. He-I the cause of<br />\nof<br />\nenemy of unintelligent censorship and a champion<br />\ntes that they<br />\npersonal liberty. So enthused were the undergradua<br />\ndelights of Doc<br />\nwere willing, for once, to forego the gastronomic<br />\nde.monAra•<br />\nAdams' &feteria in order to participate in an enthusiastictheir palms<br />\npounded<br />\npan of their appreciation. Dignified seniors<br />\nin the<br />\nsomersaults<br />\ntogether and the freshmen did everything but turn<br />\naisles. All in all, it was a gala occasion.<br />\nagain set<br />\nLas/ Thursday, before a smaller audience, Mr. Hayes resumed<br />\nHall and<br />\nup his heavy artillery on the platform of the C. E.<br />\nnarrow-minded moralists.<br />\nhis cannonading against the forces of the<br />\nhas blocked<br />\nSince the days of Roger Bacon and Galileo, intolerance in his scienthe progress of the human race. Because he persisted Galileo was<br />\nand<br />\nprison<br />\ntific research work, Bacon was clapped into<br />\nand tyranny: - Like,the victim of the Inquisition's reign of oppression<br />\nspirit of.:inwise, in the field of politics, we can perceive this same divine right<br />\nthe<br />\ntolerance. English yeomen who refused to believe in<br />\nhangman's<br />\nthe<br />\nof kings, were apt to find themselves dangling from certain body<br />\na<br />\nrope. Thus, down through the ages, there has existed<br />\nrepressing their<br />\nof reformers who willingly undertake the -task of<br />\nfellowmen.<br />\nbeen the<br />\nSince the famous•American Mercury case, Boston has<br />\nAmerican liberty<br />\nhotbed of literary censorship. Today, the cradle of<br />\nof<br />\ncomposed<br />\nis the stamping ground of puritanical bigots. A jury<br />\ncontemporary<br />\nauto washers, clerks, laundrymen and other students of<br />\nPreisefs An<br />\nliterature, were perniitted - to decide whether Theodore<br />\nbanned his<br />\nAmerican Tragedy is an immoral book. When Boston<br />\nobserved that<br />\nrecent novel, Oil, Upton Sinclair, with trenchant wit,<br />\nagent:*<br />\n\"America is my market—Boston is my advertising<br />\ndivorce<br />\nMr. Hayes also trained his seige guns on the present<br />\nunion.<br />\nlaws, now existing in the various states of our great American<br />\nwhile in<br />\nIn New York, divorce is permitted on only one ground<br />\naccomplished.<br />\nReno, Nevada, the severance of the marital tie is easily<br />\nwho<br />\nAmerica needs more men like Arthur Garfield Hayes—men<br />\nfor John<br />\nare willing to fight for the freedom of the individual and opinion<br />\nthis<br />\nSmith's right to the pursuit of happiness. Unfortunately,<br />\nof our<br />\nis not 4iated by the matronly ladies of the D. A. R. and some<br />\ndescendso-called patriotic flag-waving -societies. These noble ladies,<br />\nto -inants of the veterans of Lexington and Concord, have seen fit<br />\nBecause<br />\nclude Mr. Hayes' name on their list of disapproved speakers.<br />\nthese<br />\nyouth,<br />\n-of<br />\nminds<br />\nthe views of the lawyer might corrupt the<br />\nblackdaughters of American liberty. have placed Mr. Hayes on the<br />\n7•/.7<br />\nlist.<br />\nWe doubt whether Mr. Hayes' speech on \"Making People Moral<br />\nany of the Hopkins undergraduates into the paths_<br />\nlead<br />\nwill<br />\nBy Law\"<br />\nbroad<br />\nof sin. Perhaps we have already joined the travelers on the<br />\nMr.<br />\nhighway which leads to perdition. Be that as it may, whenever<br />\nCampus,<br />\nHomewood<br />\nthe<br />\nto<br />\nHayes finds it convenient to return<br />\nanother warm welcome awaits him.<br />\n<br />\nIT CAN BE DONE<br />\nfor<br />\n/THERE has long existed the idiotic notion that it is impossible<br />\nJ. a college man to indulge in campus activity work and still<br />\nthe remaintain his academic prestige in the classroom. However,<br />\nKappa furnish<br />\ncent elections of the Maryland Chapter of Phi Beta<br />\nof<br />\nsufficient evidence to refute this ridiculous assumption. Everyone<br />\nhas engaged<br />\nthe men who have been chosen to wear the coveted key,<br />\ncampus.<br />\nin at least on extra-curricular activity on the Homewood<br />\nof the<br />\nThe leader of the undergraduate list is- Business Manager<br />\nediNews-LErrso and another of the initiates is a member of the<br />\non the<br />\ntorial staff of this famous periodical. Two of the men are<br />\npresident of the BarnBlack and Blue Jay's roster of scribblers. The<br />\n', the<br />\nstormers Club, the Editor-in-Chief of our worthy contemporary<br />\nteamn are also listed among the<br />\ntrack<br />\nthe<br />\nof<br />\nmember<br />\na<br />\nand<br />\nNews,<br />\n7<br />\nnewly elected Phi Bete&<br />\nstill<br />\nIt is perfectly possible to engage in student activities and<br />\nmembers of<br />\nachiete scholastic distinction. The seven newly elected<br />\nPbi Beta Kappa should be doubly congratulated.<br />\n<br />\nBy \"BENDramatis Personae:<br />\n\"Ben.- really H L. Nlencken.<br />\nFoster Dowell, in charge of publicity.<br />\nM. J. Smulovitch. really H. L. Mencken.<br />\nNVilmer Driver<br />\nBill Banks<br />\nSoldiers of the Queen.<br />\nAlvin Blunt, a butler.<br />\nGeorge Banks, a gentleman of the old school.<br />\n•<br />\nGeorge Gump, really H. L. .11encken.<br />\n<br />\n4:1<br />\n<br />\n-Everything for the Outdoors'.<br />\n7.122 West North Ave.<br />\nrd St at Greenmount<br />\n<br />\nMEET YOUR FRIENDS AT<br />\n<br />\n\"The<br />\n<br />\n(ROBIN\"<br />\n<br />\nThe \"HOTSY TOTSIE\" NIGHT CLUB<br />\nDANCING — DINING — ENTERTAINMENT<br />\n<br />\nACT I<br />\nThe curtain rises, showing 'Ben- seated at a desk in his<br />\ngarden. He is. writing an article which he is going to call<br />\n\"Dreiser.- However, close beside him is a copy of Mencken's<br />\n\"Prefaces.- The audience is to draw its own 'conclusions.<br />\n\"Ben\" (mumbling): Theodore Dreiser remains perhips. the<br />\nmost enigmatical . . (Aloud) My word! I hope nobody<br />\ncatches me at this. It's pretty risk-y.<br />\n. (An empty taxicab drives up and M. J. Smulovitch<br />\n• steps !out. In his hands he has two cudgels. Pretty soon<br />\nhe intends to lift these cudgels and drop them on \"Ben.\")<br />\nM. J. Smulovitch: Ha! (-He is not heard.) Ha! Ha! (Still<br />\nunheard.), Ha! Ha! Ha<br />\n<br />\nVErnon<br />\n2682<br />\n<br />\nof Maryland<br />\n<br />\nFidelity arid Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND FLOOR, FIDELITY BLDG.<br />\n<br />\nPhone PLaza 0800<br />\n<br />\nD C HANDY, Manager<br />\n<br />\n@A. H. FETTING<br />\ncMANyFACTURING JEWELRY CO.<br />\nManufacturers<br />\n<br />\nMary say?<br />\nSmulovitch: Well, what will she say?<br />\n(Author's note: I cant' write M. J. any more.)<br />\n\"Ben\": Ha! I've fooled you. I don't know- anybody named<br />\nMary! '<br />\n(Smulovitch pins on a disguise and jumps into the cab.<br />\n.<br />\nwhich disappears in a cloud of dust.)<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n444 NORTH CHARLES STREET<br />\n<br />\nOpen From<br />\n<br />\nCollege Men.s<br />\nLuncheon 50 Cents<br />\n<br />\n\"Ben\" (rising, with outstretched arms): Have I deceived him?<br />\nI wonder. I smiled- on the surface but underneath I am<br />\na seething cauldron of passion and crime Ah. woe is me:<br />\n<br />\nA. M.<br />\n<br />\n11..z0 A. M. to<br />\n<br />\nNEW CELESTIAL RESTAURANT<br />\nAMerican • Chinese<br />\n<br />\n(Curtain)<br />\n<br />\n117-119-121 N. Howard Street<br />\n<br />\nACT II<br />\n<br />\n\"Ben- (blushing) Ha,. Ha.<br />\nBanks: I guess that'll fix you.<br />\n\"Ben\" (getting weak): Ha.-ha, ha.<br />\nGeorge Gump: Listen. \"Ben.\" .why don't you write an 'arti,<br />\nand call it, \"In Defense of Plagiarism\"?<br />\nAlvin Blum: Yes, and copy the whole thing from somebody else.<br />\n(Everyone becomes silent as if theylakIi sudden premonition of what is to come. Immediatel!'a loud clap of<br />\nthunder is heard and a large cloud rolls in the window and<br />\ncovers the whole scene. When it rolls away, everyone is<br />\nsurprised to see Foster Dowell standing in the middle of<br />\nthe room.)<br />\n<br />\n844 N.lioward St.<br />\n<br />\nFIDELITY AND DEPOSIT CO,<br />\n<br />\n\"Ben\": Do you stutter?<br />\nM. J. Smulovitch: No. Why?<br />\n\"Ben\": I thought you were trying to say Hahvahd. Author's<br />\nnote: That wasn't- so good.)<br />\nM. J. Smulovitch: Are you writing another article?<br />\n\"Ben\": Yes, go 'way.<br />\nM. J. Smulovitch (stealing up and looking over \"Ben's\" shoulder): Ha! Plagiarizing again. I see.<br />\n\"Ben\" (softly): Ah, caught! Caught in the ac't What will<br />\n<br />\nThe scene is laid in the NEWS-LETTER office. \"Ben- is re:ading \"Letters to the Editor,\" all of Which seem to have some<br />\nfault to find with him. Suddenly the door opens and Wilmer<br />\nDriver and Bill Banks walk in. \"Ben\" immediately hides<br />\nunder the desk where he remains until they have left. After<br />\nthey depart, \"Ben\" comes out from hiding. He has aged rapid:y and his hair is now snow white; however, he sits down at the<br />\ndesk and begins to write. The door opens again ,and George<br />\nBanks enters.<br />\nBanks (looking at \"Ben\"): Well. I guess you read Smulovitch's<br />\narticle about you in today's N....VS-LETTER, didn't you?<br />\n<br />\n(hinge of<br />\nProgram<br />\nWeekly<br />\n<br />\n•<br />\n<br />\nVINCENT CA RA<br />\nand<br />\nHis RECORD \\ZOYS<br />\nFLOSSY MIEITER<br />\nManager<br />\n<br />\ne, 64<br />\n<br />\nPhone<br />\n<br />\nI<br />\n<br />\n'sDancing<br />\nMusic. !I<br />\n!!<br />\nj<br />\n<br />\nTheatre<br />\n<br />\nParties<br />\n<br />\n\\<br />\n<br />\nE<br />\n<br />\n!<br />\n<br />\nS:stssr4 L'<br />\n:=<br />\nd<br />\n\"<br />\nc<br />\nESTA MiLlifltr-245 Psi GL1S gkiNPORSITY<br />\nSTYLES,ORtia_ OV-St, *CiUTHFUL<br />\nCHARTS ScikrEL*F.0.1k..DIS<br />\nGUISHED<br />\nT ,14-31<br />\nSERVICE<br />\nSTATES.<br />\n<br />\nDowell: Well, what about it, Mr. \"Ben''?<br />\n\"Ben\": All right., what about it.<br />\n(A loud stamping is heard coming up the steps; it is<br />\nthe rest of !the-NEws-LErrEE staff. They are all asking<br />\neach other if they have read Smulovitch's article about<br />\n- \"Ben.\" \"Ben\" pulls a false mustache, a wig, and a pair of<br />\nsideburns from his pocket and puts them on. The staff<br />\nbursts in.)<br />\n\"Ben\"• Hey Everybody, have you read Smulovitch's article'<br />\nEverybody: Yeah. Have you seen \"Ben\"?<br />\n\"Ben\": I think he's gone into a monastery.<br />\n( M. J. ''Smulovitch appears from the corner, where he<br />\nhas been hiding; disguised as a package of Old Golds. He<br />\nstrides over to \"Ben\" and strips off his disguise.)<br />\nSmulovitch: Now, me fine fellow; what have you to say now?<br />\nFoster Dowell: Yes, what about it, Mr. \"Ben\"?<br />\n(\"Ben\" and Smulovitch both draw their pistols at the<br />\nsame time.)<br />\nThen the lights went out—Dowell screamed—and two guns<br />\nblazed in the dark,<br />\nThen the lights went up—nothing happened—two men lay stiff<br />\nand stark.<br />\nPitched on his head and pumped full of lead, lay dangerous<br />\n\"Ben\" McGrew,<br />\nAnd watching his luck, was his light of love—M. J. Smulovitch.<br />\n<br />\n(Curtain, real fast.)<br />\n<br />\n0 _ %e<br />\n8V SPECIAL APPOINTIHEATT<br />\nOUR STORE IS THE<br />\n<br />\nt<br />\nCF ILAUTIMCIUIE<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br />\n<br />\n1Itellallub<br />\nBallancen Minas and farina,<br />\n<br />\n\f3<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 23, 1929<br />\n<br />\nHomewood rivals, however, came CHEMISTRY SCHOLARSHIPS<br />\nTENNIS TEAM SWAMPS<br />\nContinued from Page 1, Col. 4<br />\nUNIV. OF BALTIMORE out on the long ,end of a 10-8 score<br />\nthe set and therewith the<br />\nannex<br />\nthe-same time Dr. Frazer anto<br />\nAt<br />\n4<br />\nCol.<br />\n4,<br />\nPage<br />\nfrom<br />\nContinued<br />\nthe case of Countess -Cathcart,<br />\nthe establishment of four<br />\nmatch.<br />\nnounced<br />\nplayBaltimore<br />\nthe<br />\nwho for a time was barred from nine matches,<br />\nnew fellowships, under a plan which<br />\nthis country because of moral ers could land only one set when Summary:<br />\neventually will give one fellowship<br />\nturpitude. When she was told she N. Salzman took the Second set Irons, J. H. U., defeated S. Salzto each of the forty-eight states.<br />\nwas to be barred because she had from Goldberg of Hopkins by a<br />\nman, U. of B., 6-3; 6-1.<br />\nto the<br />\ncommitted adultery, she inquired count of 6-4. Goldberg was not to Gdldberg, J. H. U., defeated N. Fellowships were awarded<br />\nfollowing:<br />\nof the gentlemen of the board if be denied, however, and came back<br />\nJUST PRAISE<br />\nSalzman, U. of B., 8-6; 4-6;<br />\nthey had never committed the to capture the third and winning.set,<br />\nPaul Porter Sutton, 5607 Merville<br />\n6-3.<br />\nthree<br />\nbut<br />\nThe Editor-in-Chief of the NEWSopponent<br />\nhis<br />\nallowing<br />\nAvenue, Baltimore.<br />\ncrime. Their answer was<br />\nHendefeated<br />\nH.<br />\nU.,<br />\nJ.<br />\nHelmholtz,<br />\nLETTER:<br />\n.<br />\nwe are American citizens.\" \"Ob- games.<br />\n\"we<br />\nRobert D. Stiehler, Hicksville, New<br />\nry, U. of B, 6-0; 6-0.<br />\nHopfor<br />\nIrons, playing first man<br />\nscenity is purely subjective,\" said<br />\nDear Sir:<br />\nDiehl, York.<br />\nday's proceedings Brockman, J. H. U., defeated<br />\nGilbert is intere,,ted<br />\nPhi Beta Kappa recently held Mr.-kiages. It is all a matter of kins, started the<br />\nMaurice E. Krahl, Greencastle, Ind.<br />\n6-3.<br />\n6-3;<br />\nB.,<br />\nof<br />\nU.<br />\nin dramatics to the<br />\ncustom and of one's own point o' rather auspiciously by defeating S.<br />\nPa.<br />\nBethlehem,<br />\nEbert,<br />\nS.<br />\nMichael<br />\ntheir elections and a large number<br />\nSeidendefeated<br />\nU.,<br />\nH.<br />\nJ.<br />\nview. If one is used to seeing Salzman in straight sets. Helm- Gump,<br />\ntiniest detail A One<br />\nRobert W. Cairns, Oberlin, Ohio.<br />\nman, U. of B., 9-7; 6-2.<br />\nof scholars received the singular women in a<br />\nstate of undress, the holtz, third man on the Jay team,<br />\ntime when be was<br />\nrabelow,<br />\nWillard E. Bleick, Maplewood,<br />\nhonor of election to that body. sight ceases to be suggestive. The allowed Ed. Henry not even one Shugar, J. H. U., defeated<br />\nKing Midas he actualU. of B., 6-3; 6-4.<br />\nN.J.<br />\nThose elected represent various very fight being waged by the re- game in their match. Helmholtz<br />\nly counted out the<br />\nDoubles:<br />\nMains.<br />\nophis<br />\nAuburn,<br />\nto<br />\ndefeat<br />\nsets<br />\nField,<br />\nlove<br />\ntwo<br />\ntook<br />\nE.<br />\nTheodore<br />\natformers against obscenity,'defeats<br />\nfields of intellectual activity and<br />\nwhiskers for his heard.<br />\nHelmholtz and Irons, J. H. 1.1., de- Kenneth E. Glidden, Durham, N. H.<br />\nits own purpose in the long run. ponent. Diehl, of Baltimore, found<br />\ntainment.<br />\nfeated S. Salzman and' N.<br />\nGil says nothing quite<br />\nthe going pretty hard against BrockWis.<br />\nMadison,<br />\nRuhoff,<br />\nAvowedly<br />\nR.<br />\nbooks<br />\nobscene<br />\nJohn<br />\nreceive<br />\nHowever there is one name<br />\nSalzman, 6-3; 10-8.<br />\npermeates his audifree and widespread advertise- man, and fell before the Jay capand drives in straight Brockman and Gump, J. H. U., dewhich appears in the list of the un- ment,.and arouse<br />\nence with college atunnecessary and tain's strokes<br />\nfeated Diehl and Henry, 6-3 ;<br />\ndergraduates that deserves the spe- unnatural curiosity.<br />\nmosphere like when<br />\n6-2.<br />\nWins in Extra Games<br />\ncial attention and praise of every<br />\nhe wears Braeburn<br />\nMorality Through Law<br />\ndeU.,<br />\nJ.<br />\nH.<br />\nShugar,<br />\nand<br />\nGoldberg<br />\nGump, following the lead of his<br />\nFROM<br />\nJOhns Hopkins man. The man to Prohibition is another example<br />\nUniversity Clothes.<br />\nfeated Seidenman and JabeSULSKY<br />\nteammates, defeated Seidenman, U.<br />\nwhom I refer is one who has been of an effort to obtain morality of Baltimore, in straight sets, but<br />\n7-5.<br />\n6-1;<br />\nlow,<br />\n313 W. FRANKLIN STREET<br />\n$35<br />\nseverely physically handicapped through law. It has not proved only after the Baltimore player had<br />\n$40<br />\nL. G. BALFOUR CO.<br />\n$45<br />\nsince his entrance in this institu- successful. \"The question is not forced Gump into extra games to<br />\nBOOKS<br />\none of liquor, but where to get it<br />\nFraternity Pins<br />\ntion in the year 1925. With all of<br />\nfirst set 9:7. Shugar, Hopwin<br />\nthe<br />\nanged<br />\nld---Exch<br />\nBought—So<br />\nr -Nur<br />\nJewelry, Favors, Novelties<br />\nand ,how much one must pay per<br />\nhis handicaps he has reached the quart,\" said Mr. Hayes. The law kins,'defeated Gabelow to conclude<br />\nHOPKINS RINGS<br />\nSTORE<br />\nBOOK<br />\nPIPPEN'S<br />\nheights of success and promises to never will work as long as a tre- the singles matches. .This match<br />\n1109 Fidelity, Bldg.<br />\nClothiers and Haberdasher..<br />\n605 N. EUTAW STREET<br />\nPhone CAlvert 1564<br />\ndo so in the future. The man of mendous percentage of the peo- marked Shugar's first appearance on<br />\nTtui<br />\nwhom k am speaking is Leonard B. ple oppose it. A law is only feasi- the Hopkins team since the southern<br />\n17 E. Baltimore St.<br />\nYELLOW CAB STANDS<br />\nPhone HOmewood 7908<br />\nble where a very small portion of trip, which the Jays took 'during<br />\nNolley.<br />\nAT<br />\nput in the Easter holidays.<br />\nbe<br />\never<br />\ncan<br />\npopulation<br />\nthe<br />\none<br />\nas<br />\nons<br />\ncongratulati<br />\nI offer my<br />\nHomewood Field<br />\nviolating it. When prohiWin Al! Double Matches<br />\nwho has the greatest respect and ad- jail for<br />\nST. PAUL at 33rd STREET<br />\nand St. Paul Streetz<br />\n35th<br />\nproscice the general<br />\nIn the doubles, the Black and<br />\n31st and St. Paul Streets<br />\nmiration for the man who has re- bitionists<br />\nStore<br />\nd<br />\nDrug<br />\nenHome—HO. 20911<br />\nNeighborhoo<br />\nthe<br />\nYour<br />\nsince<br />\nPhone, CAI. 1380<br />\ncountry<br />\nthe<br />\nin<br />\nEfficient Service<br />\nand<br />\nas<br />\nefSafe<br />\nperity<br />\njust<br />\nplayed<br />\ncourtmen<br />\nBlue<br />\ncently. been elected to the highest<br />\nFRANCES T. BANNON<br />\nof the Eighteenth ficiently taking the three matches<br />\nCharge for Extra Passengers<br />\nactment<br />\nNo<br />\nundergraduan<br />\nby<br />\nTIONS<br />\nattainable<br />\nPRESCRIP<br />\nto<br />\nHARBAUGH El BANNON<br />\nSuccessor<br />\nhonot<br />\n'PHONE<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\nAmendment, Mr. Hayes said he in straight sets. The Salzman boys, School Supplied, Candy, Cigars<br />\nate.<br />\n(Room 28)<br />\nVERNON 1212<br />\ncomes back with the ar- teamed against Helmholtz and Irons,<br />\nUnexcelled Fountain Service<br />\nStenographic Dictation, Copying,<br />\nFOR A<br />\nWilmer H. Driver. always<br />\nMultigraphing, Mimeographing<br />\ngument that the country had pro- put up a stiff battle and forced the<br />\nYELLOW CAB<br />\nMaryland<br />\nBaltimore<br />\nMake Our Store Tour Store<br />\n1919.<br />\nbefore<br />\nTheir<br />\nsimilarly<br />\ngames.<br />\nextra<br />\ngressed<br />\nsecond Set into<br />\nas<br />\nTheir argument is as plausible<br />\nthe old syllogism: \"Adam was<br />\nthe first man; I am a man; therefore all elephants eat peanuts,\"<br />\nE. E. ADAMS<br />\nthe speaker humorously pointed<br />\nHAYES AT ASSEMBLY<br />\n<br />\nMAIL<br />\nILA6<br />\n<br />\nContinued from Page 1, Col. 5<br />\n<br />\nRENT<br />\n<br />\nSNAPPY<br />\nTUXEDOS<br />\n<br />\nBirely's Pharmacy)<br />\n<br />\nBARN CAFETERIA ,<br />\n<br />\nWith a cigarette<br />\nas good as Camels<br />\nthe simple truth<br />\nis enough<br />\n<br />\nout.<br />\nReligious Fanaticism<br />\n<br />\nSuch laws as the Tennessee<br />\nAnti-evolution ,Law are examples of the desire of the religious<br />\nfanatics to protect the fundamentals of their faith. Through ignoTHE CHARLES E. MYERS CO.<br />\nIncorporated<br />\nrance, they hope to preserve fuManufacturer of<br />\nture generations in the same be-<br />\n<br />\n'RUBBER STAMPS<br />\n<br />\nliefs as they hold today.<br />\nMarriage and divorce laws are<br />\nbooks<br />\nalso written into the statute<br />\nbecause<br />\nJust<br />\nreformers.<br />\nby moral<br />\nto dia particular sect is opposes<br />\nTHE NEW<br />\nshould<br />\nit<br />\nwhy<br />\nreason<br />\nnq<br />\nis<br />\nvorce<br />\nHOLLYWOOD SHIRT<br />\non<br />\nseek to impose that belief<br />\nHollywood's latest creation! Black,<br />\nof mardiversity<br />\nThe<br />\neveryone.<br />\nOrange and Blue are the colors.<br />\nthe<br />\nriage and divorce laws typifies<br />\nhypocrasy of our present stand<br />\neven<br />\n\"The Old Boy Himself\"<br />\nMr. Hayes maintained that<br />\nlasvs were made<br />\ndivorce<br />\n.the<br />\nif<br />\nAVES.<br />\nNORTH & MARYLAND<br />\nwould Be<br />\nmore lenient, marriage<br />\nNot all<br />\njust as firm as it is now.<br />\nseparate if<br />\nwould<br />\npeople<br />\nmarried<br />\ndo so.<br />\nthey weie at liberty to<br />\nby affecbound<br />\nare<br />\nthem<br />\nof<br />\nMost<br />\n,<br />\n„<br />\nand family,<br />\ntion, love for home<br />\n11111111',\"., 1111!Iii<br />\nfar better<br />\nbe<br />\nwould<br />\nIt<br />\nhabits.<br />\nor<br />\ncouunhappy<br />\nif<br />\nconcerned<br />\nfor all<br />\neasily and<br />\nples might separate<br />\nhappy lives<br />\nhave a chance to live<br />\neverything.<br />\ninstead of ruining<br />\nthese reThe whole course of<br />\npursuit of<br />\nthe<br />\nblock<br />\nto<br />\n,<br />\nis<br />\nforms<br />\ngloom.<br />\nha'qiness and substitute<br />\ncleverly parodied<br />\nMr. ilayes very<br />\nIndependence<br />\nthe Declaration of<br />\nIn style and quality \"Bostonians\"<br />\nclosof this document<br />\nversion<br />\nhis<br />\nfootwear<br />\nequal the most expensive<br />\nthat,<br />\nstatement<br />\nthe<br />\ning with<br />\nProduced today.<br />\ninstituted<br />\nare<br />\n\"Governments<br />\nAnd the saving is a big item.<br />\ntheir just<br />\namong men deriving<br />\nKlan,<br />\nKlux<br />\nKu<br />\nthe<br />\npowers from<br />\nMostly $7 to $10<br />\nLeague and the<br />\n-Saloon<br />\nAnti<br />\nthe<br />\nto the con<br />\nD. A. R. In responding<br />\nExclusively in Baltimore<br />\ngreeted his<br />\ntinued applause which<br />\n\"I am parBOSTONIAN<br />\ntalk, Mr. Hayes said,<br />\nbecause<br />\nticularly glad to hear this<br />\nSHOE STORE<br />\nthat some<br />\nbelieve<br />\nto<br />\nme<br />\nit leads<br />\n112 E. Baltimore Street<br />\nwith me.\"<br />\nof you may agree<br />\nThe Service Shop<br />\n319 W. Redwood St<br />\n<br />\nCAM E<br />\n<br />\nc.MANNIE (BERG .<br />\n<br />\nCollek,e eMen!<br />\n<br />\nCIGARETTES<br />\n<br />\nWHY CAMELS ARE THE BETTER CIGARETTE<br />\n<br />\nCamels are made of the choicest tobaccos<br />\ngrown—cured and Uendeyji4 expert care.<br />\nCamels are mildinl ellow.<br />\nThe taste of amels is smooth and satisfying.<br />\nCamels ar cool and refreshing.<br />\nThe fragrance of Camels is always pleasant,<br />\nindoors or out.<br />\nThey do not tire the taste nor leave any<br />\ncigaretty after-taste.<br />\n<br />\n,<br />\no 1929. R. 3. Reynolds Mews<br />\nIt4. C.<br />\nWIrese4slook<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LET-MR, APRIL 23, 1929<br />\n<br />\nMen who want<br />\n<br />\nNEW<br />\n<br />\nNTERCOLL EG LATE:;<br />\nNEWS - -<br />\n<br />\nSummer Work<br />\n<br />\nTUXEDOS<br />\nFOR HIRE<br />\nAiss Dress Shirts, Collars. Tits,<br />\nSliver Studs, Etc<br />\nSte<br />\n11. GARLAND HERSHEY<br />\nAbout Special Price to Hopk:: Men<br />\nWakkef Dress Suit Co<br />\n<br />\nCal. 5344<br />\n<br />\n119111r1M111WillrM911,<br />\n<br />\nThis Smoke<br />\n1<br />\nAids Artist<br />\nTo Nab Ideas<br />\nledepeedeetee, Mo.<br />\nJune 24,.lf28.<br />\nLeos Sr Nether Col;<br />\nRieanowd. Va.<br />\nDear Mac<br />\nPerhaps you would Face to know in<br />\n*ita ward or no how kom* partners<br />\nwith Edgeworth in a bn.ss way.<br />\nBy proleadoe I am a cartoonist;<br />\nwive you probably know is &led upon<br />\nto create new Wass. While this is<br />\npart at the prorefired as the bieFrts.ter<br />\nit may eerily<br />\nleation„ I have<br />\nperste will but<br />\nbe mastered,<br />\nrecline say easy their, light a pipe,<br />\nan,1 live withastagin' stirs persons in<br />\nsresiatie meoire donde that will<br />\nsoca MI the room. Edgeworth has<br />\ngime are mere ideas than any other<br />\nbrand et tobeartrosi 1 -marrinr my<br />\npupeteitquiteawhaleago. The merit<br />\nhas been wonderfuL The more you<br />\nme Edgeworth, the more yea crave<br />\nit-am as a drug. bin as a wholesome<br />\npiseatre.<br />\nCompfimeating the standard quality(wildssteams mew than the words<br />\nsienify)el Mipmrarth,Jam a devoted<br />\nand profound seer.<br />\nYount very<br />\n<br />\nTENNIS TEAM WINS<br />\nTWO MORE MATCHES<br />\n<br />\nUedeHePkias Net Sc<br />\nHopes for the present day<br />\nfeated This Season<br />\n:ege man to dear up politics in<br />\nthe United States can now be<br />\nWELL BALANCED SQUAD<br />\nSee Faze 131 in :he<br />\nvoiced with a little more ass.ttrit-..<br />\nWeek's Lay-off Does Not<br />\nDickinson College is the firt<br />\nAmerican ?viagazme<br />\n• Affect Jay Skill<br />\ns.tiuition to make a step forward<br />\n:n abolishing all fraternity<br />\nac:: •<br />\nties in school elections, and it is<br />\n- 7: ,..u.sed by cad<br />\n-TED<br />\nTEACHERS ';;•;....1,̀<br />\ntenni,. team<br />\nhoped that their act will set an tf. the i<br />\nYen izt si-coner.. wi. sr=<br />\nFranklin and Marshal<br />\nnew. be seentstra.-7 er.,te<br />\nexample to others. Two tratermci,.W,<br />\nesAlostss sh,,4,1 wrfte,<br />\n_<br />\n, m the<br />\nhale plses-r.i Emmy Fit,pkins ertsd.-ties at Dickinson, reprosentiug:,<br />\natm<br />\nsixty-five studentslhave pledged!ctri.rfog<br />\nTHE BALTIMORE TEACHERS'<br />\n_<br />\nAGENCY<br />\n_<br />\ntss.i \"es.<br />\n:0 keep out of all political entan- record of<br />\n114C-1<br />\nfour satagt:<br />\nto<br />\naiming<br />\nand<br />\nany<br />\nin<br />\nglements and to support<br />\nfOr .a=7<br />\nelections only those men whom tar.i. defeat at<br />\neach inClividual member derma fit<br />\nfor the positiOn. By the plf..;4:e<br />\n441 ,ill be forbidden to discuss. - 7<br />\nLaablashed :<br />\neach man<br />\nmg election a<br />\nIrono Wins<br />\nPHILADELPHIA<br />\nthereby pc::: c-a unbiased<br />\npacollege<br />\nthe<br />\n7.:a7.<br />\nDickin.s,<br />\nThe<br />\nOttziai Makers of the Standard<br />\n, per. his expressed the hope that<br />\nmatters will never agarn!end<br />\nthe tangle of* year. and has<br />\nthreatened to publish the<br />\n<br />\nYou do get Better Kodak Pictures<br />\nfrom<br />\n<br />\nhEPP PHOTO—SERVICE<br />\nI<br />\n—<br />\n.-<br />\n<br />\nei<br />\n4=<br />\n<br />\nEST. 1900<br />\n<br />\nGREENMOUNT AVENUE<br />\n<br />\nBAS<br />\n<br />\nJohns Hopkins Ring<br />\nPnees Upei Re4tien<br />\n<br />\nthe ref,:rt.:<br />\nnur ha:s<br />\n<br />\nPhotographic Supplies<br />\n<br />\nFor Sweaters,:Trench Coats, Slickers, Sporting Goods,<br />\nArmy Uniforms and Supplies, also Aviation Outfits, head<br />\nyour airship and land at the<br />\nOUTING SUPPLY CORPORATION<br />\n21 North Liberty<br />\n<br />\nStreet<br />\n<br />\nHENNEGEN-BATES COMPANY •<br />\n<br />\nDicldns•<br />\ngames<br />\n<br />\nr.ra'•<br />\n, repor: casea According t-LF,ESS ET<br />\n_ _<br />\n12<br />\nreplies from the presidents<br />\ndeans of approximately 300 col- match Haz- •<br />\n•<br />\n:eges, and sponsored by He77:.<br />\nCOMPLETE<br />\nGrattan Doyle, dean of men 07:<br />\nBALTLMJ.RE AT CHARLES STREET<br />\nGeorge Washington University,; ,..a‘l Hazeltine 4-I , -...-.., - A<br />\nthe average modern American :- game in the second ,s/et. but :<br />\nstudent is not a carefree \"co'.:t- -- --ylvanian staged a comeback •<br />\ngiate- person as pictured by - • - - -hat and the third -se: by -...-V 11<br />\n-_- re of. 6-4q<br />\n•<br />\nmany popular magazines, but<br />\nDECORATIONS<br />\n'INTERIOR WOOD WORK<br />\nE<br />\nF. and H. Wins<br />\nstead has higher ideals and p-_-.:-a:-.;:<br />\nFrank::::<br />\nVon Seldenech. ..,::<br />\nposes. does better and more serlRADJOHN C. KNIPP & SONS.<br />\nous scholastic work and lives by a .'_ar•shall, encountered less opposi- 1.,<br />\nTAYLOR<br />\nhigher standard of moral conduct • - :71 defeating Brockman. Jay: :<br />\nPow<br />\nFURNITURE<br />\nCo.<br />\n- Wa successive sets. I<br />\n:a .<br />\nthan the student of any precedBALTIMORE,<br />\nMD<br />\nDoyle<br />\n\"Dean<br />\ning generation.<br />\nout several months ago a<br />\nA<br />\nShow Roosts<br />\nFactory<br />\ncokuitt,<br />\nuqtlight<br />\ntett'<br />\nPes<br />\nJrrat<br />\nlengthy questionnaire enco a,- ler<br />\n141 N. Ci-lafles Street<br />\n5 Pulaski .Street<br />\n14.12•.1<br />\nprol,social<br />\nevery<br />\npractically<br />\ning<br />\n.4<br />\n1.•X<br />\nlem of the student of today. In<br />\nsending out the. questionnaire<br />\nExtra High Grade<br />\n•SERVICE•<br />\nDean Doyle said: -I haar. fe:•<br />\nAt Your Service 24 Hours a Day<br />\nconcern ar.-f : •-.etimes: chagrir.<br />\nSmoking Tobacco over the rner-..) picture. of the<br />\nProducers of \"The !.* eau-Letter\" 'collegiate' boy or girl which the<br />\n11A6Maii.<br />\nINCORPORATED<br />\n1718 N. Charles Street<br />\ngeneral public has apparently cre- up,<br />\nkimmeszez DIARISTS TEL•EGRAPH DELIVERY ASSOf:LATI<br />\n20c FIRST HALF-MILE .<br />\nated during recent yeas. I feel team .so thaiT<br />\n10c each additional Half-Mile<br />\nthat this imaginary individual !doubles<br />\nJ. A. RI rit.R & SON<br />\nor fraction thereof<br />\nSurrtrary :<br />\nby no means typical and therefore<br />\nFlorists cad Decoldtors<br />\nTbe above rate applies for I to 4 passenger,<br />\nBALTIMORE. MD<br />\nI am sending this letter to dean J. H. U. itfeated<br />\n110111 N. CHARLES ST., Near 20Th<br />\n, 1:672<br />\n.<br />\nPhone, VErn<br />\nCOMPARE!<br />\nin a number of leading college<br />\n• r-2<br />\n\\-Ernori 4090<br />\nStand a Honcuooci<br />\nand uni-.-ersities throughout the 2<br />\nU..<br />\nj.<br />\nconsena<br />\nget<br />\nto<br />\norder<br />\nco:':<br />\nE4umar, ;'..-6; 7-5<br />\n',act and opinion which can.<br />\nNEW LIFE<br />\n3—Haz !tine, F. St M.. def--.;.THE GIANT<br />\n•:-e-ented to .the public.\"<br />\nFOR MOTOR<br />\nmh:_::tz:<br />\n:<br />\nPOWER FUEL<br />\n..e'Lr_lenech. F. r. M., deft::GEO. M. PLEINES<br />\n13n-x-kmar.. 6-2: 6-4.<br />\nThe Fogg Museum of Harvard.<br />\n\"STANDARD\" MOTOR OIL<br />\n•<br />\n']efea:e,:. 1<br />\nhas adr,Pted the plan. of loaning<br />\nre h. 9-7<br />\npaintings to students to :decorate<br />\nThe Measure of Oil Value<br />\n11 their rooms. It is believed that ! Dublk<br />\nI this practice . will encourage the l<br />\nSTALf7ts,<br />\n.• I.<br />\n>-Ei<br />\nSTANDARD OIL COMPANY OF N<br />\nand H<br />\n)6RTH AVE MARKET<br />\nstudy and appreciation ,of art<br />\ndefeated Kahler and Ecluaa:-..<br />\nBALTIMORE. MD.<br />\nf,-4: 10-8.<br />\nA student at the College of In- 2—Goldberg and Br?ckrnan. J.<br />\ndefeay-,1 V :-.<br />\ndustrial Arts. Denton. Texas. recently handed in an exam paper<br />\nwith the following remark inserte4 at the bottom: The Lord pf,<br />\n',11),<br />\nMN<br />\nH,osts. be with us yet; left we for- Tennis Team Swamps<br />\n—are the New Spring Books!<br />\nget, lest We forget.\"<br />\nInit.. of Baltimore<br />\nYou'll never know what<br />\n.<br />\nYou'll find rows and rows of them—brand-new books in bright<br />\nmarking the painstructor<br />\nThe<br />\ntenr:g,,od<br />\nv<br />\n•<br />\nt-.-.cc:<br />\nPlaying<br />\ncovers—smelling<br />\npungently of printer's ink and crisp paper—fiction,<br />\nyour car will really do<br />\n\"<br />\ner thought it worth an \"F\" and<br />\npoetry, biography, science—awaiting your choice at our two stores<br />\nthe Johns Hopkn-i- •,:ns team .-i,until you start feeding it<br />\nadded to the mark: \"The Lord of<br />\nTHE NORMAN, REMINGTON CO.<br />\nfeated the Univer:ny of Baltimor,<br />\nAMOCO GAS.<br />\nHosts' was with us not; for we<br />\nDown-Town:<br />\nUpTown:<br />\nracqueters 9-0. Saturday, on the<br />\nCharles Sc. at Mulberry<br />\nforgot, for we forget.\"<br />\n1118 North Charles Sc.<br />\nHomewood Courts. By this victory.<br />\nthe Blue Jays kept their season's<br />\nHeywood Brown in a recent record inviolate. This was the secstatement regarding co-eds on ond victory in two days arid the<br />\nAmerican campuses stated that he sixth straight win Of the season.<br />\nwas strongly in favor of their The other teams that have heretopresence at the universities. \"I<br />\nNo Deposit Required<br />\nfore fallen before the cuts and;<br />\nthink it is best,\" he said, \"for the<br />\nof Johns Hopkins University Students<br />\nsmashes of the Jay netmen are:<br />\ncollege, man to have association<br />\nUniversity of Virginia, Washington<br />\nwith women in college rather<br />\nLight and<br />\nand Lee, University of Delaware,<br />\nBuicks<br />\nLombard Sts.<br />\nno<br />\nis<br />\nthere<br />\nthan outside. When<br />\n6000<br />\nPLaza<br />\nVillanova, and Franklin and MarChevrolets<br />\n1723-25 N.<br />\nopportunity within the college the<br />\nshall.<br />\nCharles St<br />\nChryslers<br />\nmen will go outside and associate<br />\nVEmon 4049<br />\n(Easy Going)<br />\nHupmobiles<br />\n2402 Pennsylwith women on a lower intellec- In Saturday's encounter, the<br />\nvania Ave.<br />\nWillys-Knights<br />\ntual standing, and they show a Black and Blue courtmen found the<br />\nLAfayette 2000<br />\ndecided preference for wait- going comparatively easy. Of the<br />\nBaltimore Concedes Milestone Siipremaijr-3<br />\nresses.\"<br />\nContinued on Page<br />\nOrders ad:r;ted at t.be<br />\n?sac r -e in the Cciilege<br />\n<br />\n_<br />\n<br />\nrr9<br />\n<br />\n444<br />\n<br />\nEdgeworth<br />\n<br />\nzMayflozz;er<br />\n<br />\nESSO<br />\n<br />\nYou'll Never<br />\nKnow<br />\n<br />\nCab Co.<br />\n<br />\n\"Say it with Flowers\" •<br />\n<br />\n'—<br />\nstimulating-<br />\n<br />\ndelightful<br />\n<br />\nIt<br />\n<br />\n\f", "format": "basic_html", "processed": "JEMISEGIBMWSPIMER<br />\nVol: XXXIII, No. 46<br /><br />\nSOPHOMORES VICTORS<br />\nIN INTERCLASS MEET<br /><br />\nWOMEN'S CLUB TO GIVE<br />\nTEA ON WEDNESDAY<br />\nThe Johns Hopkins Wo75<br />\nmen's Club will hold a tea on<br />\nnext Wednesday afternoon at<br />\nfour o'clock in their rooms on<br />\nthe third floor of Gilman Hall.<br />\nBoth students and faculty are<br />\ninvited to attend.<br />\n-711his is the second large<br />\nsocial function the Women's<br />\nClub has given in the last<br />\nmonth, a bridge party having<br />\nbeen given previously.<br /><br />\nCAMPUS RESUMES CUSTOMARY<br />\nQUIET AFTER BANQUET SCRAPS<br /><br />\nA. A. CARDS MUST<br />\nBE RESTAMPED<br />\nMr. Henry Iddins, Business<br />\nManager of the Athletic Association, requested on Saturday that all men in the University should take their A. A.<br />\ncards to the postoffice,and have<br />\nadditional numbers placed on<br />\nthem.<br />\nWhen these cards were<br />\nprinted in the fall, no allowance was made for basketball<br />\ngames, consequently a lack of<br />\nnumbers has resulted. All men<br />\nare asked to attend to this<br />\nmatter immediately.<br /><br />\nJAYS LOSE TO ARMY<br />\nLACROSSE TEAM 4-1<br /><br />\nOnce more the campus has as- In clearing up the terminology,<br />\nsumed its wonted academic quiet, the following explanation may throw<br />\nHopkins Defense Repulses<br />\nSeveral Promising Track Men<br />\nand interclass-animosities die gently some light on the case: ban meanOnslaught for Half<br />\nShow Up in Meet<br />\namid a flood of 'reminiscences and ing restriction, and quit meaning<br />\nIS STAR<br />\nBROWNLEY<br />\nSENIORS ARE SECOND<br />\nexaggerations (which is just another leave, banquet may be a corruption<br />\nor disalleave,<br />\nmeaning<br />\nbanquit,<br />\nis<br />\nof<br />\nPlays<br />\nseason<br />\nGoalie<br />\nClever<br />\nway<br />\nof<br />\nthe<br />\nsaying<br />\nbanquet<br />\nUntil<br />\nResult Undecided<br />\nStirring Game<br />\nlow, restrictions. That seems much<br />\nover).<br />\nLast Event<br />\nTwo' years ago, girls and boys, more logical than its having any refArmy's sterling lacrosse twelve<br />\nAmidst the russet shades of twithere was a banquet season that was erence to feasting.<br />\ndefeated the Blue Jay team 4-1 in a<br />\nbattled<br />\nGarrett<br />\nand<br />\nHershey<br />\nlight,<br />\nupon a Two, results, principally, seem to<br />\nOnce<br />\nname.<br />\nof<br />\nworthy<br />\nthe<br />\nwell played game last Saturday. The<br />\nthrough the broad jum-p for a retime, you know, freshmen and so- follow the new attitude toward the<br />\nwonderful condition of the Cadet<br />\nspective class victory, in Friday's<br />\nto<br />\nright<br />\nwere<br />\nhe<br />\ncouncils<br />\nand<br />\n—<br />\nstudent<br />\nphomores<br />\nbanquets. Deprived<br />\nteam was a big factor in the victory.<br />\ninterclass track meet. Their ardor<br />\nnot so solicitous of their fellows' vent their youthful vitality upon one<br />\nDuring the first half the Jay deresulted in a tie at 19 feet 9 inches,<br />\nboard,<br />\nendwell-being, and banquets often<br />\nanother about the groaning<br />\nfense was called upon time and time<br />\nwinning the meet for the clftsc of<br />\nexed in the direst disorder.<br />\nthe class rivals must take their<br />\nagain to give its utmost to stopping'<br />\n1932, by one-half point. The final<br />\nWell, to resume, two years ago a ercise during the three-day season<br />\nthe West Point team and in every<br />\nscore was Sophomores 37, Seniors<br />\nunanimous and ambitious sopho- preceding, and turd to new sources<br />\ncase was successful. In the second<br />\nT 2, and Jun36'/, Freshmen29/-'<br />\nmore class—stilted seniors they are of excitement on the night itself<br />\nhalf the Cadets swept down on the<br />\n.<br />\nRyan, Thomas, Ludwig, and Cal- today—raised banqueting to its high- These sourdes are reported adequate<br />\niors 14.<br />\nJay goal like an avalanche and kept<br />\nMoore Wins Dash<br />\nverton Speak to Students<br />\nest degree of perfection, and thereshooting at the Black and Blue goal<br />\nWhatever may be the shortcomIn thy 100-yard dash, Moore -2(.)<br />\nby killed the art.<br />\nuntil even the peerless work of Corof recent frosh-soph hostilities,<br />\ning<br />\nARE<br />\nHELD<br />\nGROUPS<br />\nSTUDY<br />\nhandia<br />\nwith<br />\n10.2<br />\nseconds,<br />\nIs<br />\nLawyer<br />\nin<br />\nwon<br />\nNoted Criminal<br />\nAll that's an old story; in fact, it the campus for the past few days<br />\nner Brownley, Hopkins goal tenAcclaimed by Crowd<br />\ncap of 5 yards. Second place was Reports Show Weakness of Lib- is already canonized as a campus<br />\nordithan<br />\nder, could not stop them from makseemed even more calm<br />\nawarded to Linde '32, and third to<br />\neralism in Local Colleges<br />\ntradition, and must be reverenced by narily. During the week that the \"Religion through ignorance, ing a score. Soon after the tying<br />\n- Nett '31. Two heats were necesall frosh, although contemned by season lasts, there stalks about an morality through law, govern- count the Cadets scored again to<br />\nThirty-three delegates from Johns moody grad students. Although the<br />\nsary to settle this dash.<br />\nair of expectancy. No one knows ment through acquiescence, and make the score 2-1 in their favor.<br />\nMorrison '31 won- the 220-yard Hopkins attended' the Intertollegi- Annapolis celebration caps the cliat what moment or from what quar- convention by hypocrisy,\" is the From then on until the half was aldash from scratch in 23.3 seconds. ate Liberal Conference held at the max, the freshman banquet, afloat<br />\nter or with what force, the next credo of the American people to- most over the ball was in the posHe was followed closely by Perry Friends Meeting House on April an the Chesapeake, of the preceding<br />\nblow will fall. No, member of either day, said Arthur Garfield Hayes session of the Cadet team most of<br />\n19-21. Over one hundred delegates year, deserves special consideration<br />\n'32, and Scheidt '30,<br />\nlower class is altogether safe at any in addressing the student body at the time.<br />\nLitich '32 won the 440-yard dash from seventeen American colleges and can serve as an example of the<br />\ntime during that period. It is a<br />\nPlayingi<br />\nThursday,. Mr.<br />\nwith a five-yard handicap, in 54.4 were at this gathering sponsored by best expression of the eating art. time when even the lowliest can just- the assembly last<br />\nThe West Pointers had a well<br />\nthe<br />\nby<br />\nhere<br />\nbrought<br />\nwas<br />\nHayes<br />\nHopand<br />\nJohns<br />\nEthics<br />\nand<br />\nsecond<br />\nthe Goucher<br />\nseconds. Lockard ran<br />\nEating, children, is a misnomer. ly attach some importance to his<br />\nPi Lambda Phi fraternity of balanced team and were playing at<br />\nkins Liberal clubs. In addition to Eating is the last thing thought of<br />\nPerry third.<br />\nperson. The most indifferent feels which he is a member. As coun- the top of their form. They made<br />\nYellott won the hard-fought 880- these two inStitutions George Wash- at a proper class banquet. Certain irrepressiblY-the unity of the class<br />\nAmerican Civil Liber- the most of their opportunities and<br />\nyard 'dash from scratch in 2 min- ington, Hood (Maryland), Western other elements, unmentionable here, and his identification with it when sel for the<br />\nhe has made -quite a deserved the victory. The Hopkins<br />\nutes 11 seconds., Loiseaux and Mil- Maryland, Maryland State Normal enter in which quite eclipse the sat- from any direction and from any ties Union<br />\nname for himself throughout the defense functioned well, better in<br />\nler trailed him to the finish line. School, Maryland Institute, Mary- isfaction of the_ gastronomic sense.<br />\nindividual there goes up the cry of country in his various endeavors fact than it has any other time this<br />\nThe One Mile<br />\nland College for 'Women, St. One is often hard put to. it to un\"Sopho• to preserve the original _freedom season; the attack showed momen•The one-mile run was by far the John's, Morgan, American Univer- derstand why the name banquet was a classmate in trouble:<br />\ntary flashes of good form but for<br />\nof the American Constitution.<br />\nmores!\" \"Freshmen !\"<br />\nmost thrilling event of the day. Here sity, Boston University, University employed.<br />\nthe most part were unable to recover<br />\nSubject<br />\nRomano got off .to a flying start, of Montana, Princeton, and Yale<br />\nthe ball after one shot had been<br />\n\"Morality through law\" was<br />\nFrosh Feast Closes<br />\n• with his 150-Yard handicap, to lead were represented. Students now Y. M. C. A. to Install<br />\nmade at the Cadet goal. One reason<br />\nbefore<br />\naddress<br />\nhis<br />\nof<br />\nsubject<br />\nthe<br />\nwhen<br />\nthe<br />\nlaps,<br />\nfrom<br />\nthree<br />\nfor<br />\ncame<br />\nthe pack around<br />\nstudying in America<br />\nAnnual Banquet Season<br />\nthe Jay attack may not have gone so<br />\nTonight<br />\nOfficers<br />\nNew<br />\ntrend<br />\ngeneral<br />\nThe<br />\ndash,<br />\nassembly.<br />\nthe<br />\nhis pace started to tell. This<br />\nEuropean universities of Mostosl.<br />\nmembers of the<br />\nwell is that the West Point team<br />\nTonight the Johns Hopkins Y. M. Over one hundred<br />\nof the country today, Mr. Hayes plays a very odd form of defense<br />\ntoo, saw Kelley run a beautiful race Paris, Berlin, and Vienna. - Alany<br />\nfreshman class attended their aninstallation<br />\nannual<br />\nits<br />\nhold<br />\nwill<br />\nA.<br />\nC.<br />\nenthe<br />\nbrought out, is toWard<br />\nfrom scratch, though he was unable liberal, religious, and labor organiand with its inexperience the Jay<br />\nlast Friday night at<br />\nof officers and snanner conference nual banquet<br />\nforcement of moral principles by<br />\nto overcome the terrific handicap un- zations also sent delegates.<br />\nNew Howard Hotel.<br />\nthe<br />\nattackers were unable to solve their<br />\nFriends<br />\nthe<br />\nin<br />\nM.<br />\nP.<br />\n6.30<br />\nat<br />\ndinner<br />\nlegislation. Half the people are<br />\nFour Addresses<br />\nder which he was placed. Loiseaux<br />\nGrafton Herpsber- The banquet began at nine o'clock afraid that the other half are be- difficulty.<br />\n'29 ran this distance -with a handi- Four scheduled addr,;ses were Meeting House.<br />\nof the \"Y\", will and lasted until midnight. Just be- coming immoral and so are writCadets at Top of Form<br />\ncap of 75 yards, in 4 minutes 42 given by speakers representing all ger, vice-president<br />\nAs usual the game was a model<br />\nThe program fore the \"eye and ear\" entertain- ing this moral legislation upon<br />\nseconds. Every inch of his victory phrases of liberalism. These were act as toastmaster.<br />\nmusical numbers, a ment began, many upper classmen the statute books of the Nation. of clean playing and good sportswas contested by Miller '31, and open to the general public and many includes several<br />\nadmittance<br />\nJohn Mount and a duet by' rrived and requested,<br />\nby<br />\nsolo<br />\nOn<br />\nattended:<br />\npersons<br />\nThe widespread agitation against manship. There were very few peninterested<br />\nEmerson '31.<br />\nDonald Van- which at first was .denied them. In obscenity of all sorts was cite('<br />\nand<br />\nSherwood<br />\nR.<br />\nJohn<br />\nA.<br />\nJohn<br />\nFather<br />\nevening;<br />\nFriday<br />\nalties on either side and several of<br />\nitrland Hershey dashed throng'<br />\nwere<br />\nthey<br />\nhowever,<br />\nwhile,<br />\nshort<br />\na<br />\nof the class of '23. Edward<br />\nas an example of this trend. The those that were inflicted were for<br />\nthe 110-yard high hurdles in 16.1 Ryan gave the opening speeds on ileman<br />\nadmitted.<br />\nIntercolThe<br />\npresent<br />\nwill<br />\nBeall<br />\nT.<br />\nNorLiberalism.\"<br />\nof<br />\nTheodore<br />\ncasg in Boston against<br />\nseconds. Kelley '29 finished slightly \"The Meaning<br />\nviolation of the off-side rule and not<br />\nC. A. paper,<br />\nDreiser's \"American Tragedy\", for<br />\nman Thomas spoke Saturday, after- legian, national Y. M.<br />\nbehind his classmate.<br />\nroughness.<br />\npresentbe<br />\nwill<br />\nCabinet<br />\nnew<br />\nthe<br />\nand<br />\ninElects<br />\nPhi Beta<br />\nwhere a jury composed of meHershey gained another victory noon, at complimentary luncheon<br />\nThe work of Brownley was uned by William Purnell Hall, retirchanics, plumbers and clerks was<br />\nStudents<br />\nGraduate<br />\nin the 220-yard low hurdles in 27 his honor, on \"Our Interdependent<br />\ning president. The installation servdoubtedly the feature of Jays' playseconds. Morrison '32 and Scheidt World and I low We Run It.\" That<br />\nelected to 'the Maryland called on to decide whether this<br />\nice will be conducted by Dr. John C. The men<br />\na less capable goal tender<br />\ning—with<br />\nis<br />\nillustrative<br />\nimmoral,<br />\nwas<br />\nbook<br />\nwhose<br />\n'30 trailed the leader home. The evening he discussed \"The College<br />\nKappa<br />\nChapter of Phi Beta<br />\nFrench.<br />\nonly accident of -the day occurred Student as a Potential Voter.\" Sunappear in the last is- of the fight which a puritanic ele- the score would have surely been<br />\nnot<br />\ndid<br />\nnames<br />\nofficers to be installed are:<br />\nment of Anytirican Society is wag- very much higher.<br />\nwhen Stafford injured himself at the day morning Walter Ludwig .pre- The<br />\nGeorge sue are:<br />\nsented \"Students in Industry.\" That Edwin Lockhard, president;<br />\nsixth hurdle.<br />\nStudents in Philosophy ing. Mr. Hayes said he would<br />\nGraduate<br />\nDespite the fact that the jay team<br />\nvice-president; William<br />\nThe high jumps ended in a tie afternoon A,II. Calverton gave the H. Dowell,<br />\n—Paul Acquarone, Leonard B. rather have the jury, made up as lost the game its stay in West Point<br />\nJones,<br />\nRoswell<br />\nand<br />\nsecretary,<br />\nStudent<br />\nOlsen,<br />\nthe<br />\n\"What<br />\nworking<br />\nordinary<br />\nfor first and third- places. Peake closing address,<br />\nClark, Lancaster E. Dabney, Albert it was of the<br />\ntreasurcr. The other members of<br />\nwas very pleasant and it was with<br />\n'31 and Rosen '32 were tied for first Can Do.\"<br />\nB. F. Duncan, Aaron M. Margalith, class, decide the case than trust<br />\nchairmen,<br />\ncommittee<br />\nCabinet;=<br />\nthe<br />\n,<br />\nRegional Group Is Planned<br />\nWellington A. it to the...judge. The great fear regret that the Jay players left the<br />\nMylonas,<br />\nE.<br />\nplace ,with jumps of five feet one<br />\nGeorge<br />\n'new presiSaturday niorniq was devoted to will be announced by the<br />\ninch. Colburn and 'Hershey, both<br />\nParlin, Edward F. Richards, Law- which the reformers all have is home of the Army. The Hopkins<br />\ntopics. The dent tonight.<br />\nrence H. Schultz, Louise C. Seibert, that \"youth\" will be Corrupted by twelve was quartered in the new hojumped four feet eleven inches. All a study of the following<br />\nBoard of Managers<br />\nLabor Party Movement in the U. S..<br />\nRichard E. Vollrath, Edward H. these so-called obscenities. The tel, an innovation in the Army prohad handicaps of six inches.<br />\nof the<br />\ndesire is primarily to protect<br />\nThe Board of Managers for the Watson, Theodore M. Whitfield.<br />\nPeake captured the pole vault Dollar Diplomacy, Criticisms<br />\nRoads to coming year consists of Dr. John C. Graduate Students in Medieine--- youth, though, said Mr. Hayes, gram (former teams' having been<br />\nwith a jump of 11.6 feet from a Present Order, Proposed<br />\nof Na- French. chairman, Drs. Joseph S. Douglas Barnes Remsen, Howard middle age is far more in need of housed in regular barrack\"), where<br />\nhandicap of 2.5 feet. Scheidt '30 Freedom, and The League<br />\n'Reports of<br />\nAmes, G. H. Cartledge, and John H. Atkinson Howe, Theodore Judson protection than youth, because the Cadet team gave the Hopkins<br />\nvaulted 11.3 feet from scratch. tions and World Peace.<br />\nthe eampii<br />\nyouth is always inclined to retain squad a banqtiet. After the banquet<br />\nQuirk '30 sailed over the bar at 'the state cif liberalism on<br />\nW. H. Swarz, Purnell Hall, Abernethey.<br />\nLatane,<br />\nOf those colleges present revealed Walter Frey, Edwin Lockard, T. Members of the Academic Staff— certain ideals which middle age the Jays attended the regular Satur11 feet, .from scratch.'<br />\ndevelbe<br />\nto<br />\nyet<br />\nWilliam Mansfield Clark, Ernest loses as it becomes cynical. day dance in a body.<br />\nRooney.--threw the shot- for .38 the fact that it is<br />\ncolleges, es- Reese Marsh, Lewis C. From, John<br />\nFeise, Edwards Albert Park.<br />\nfeet, with a handicap of 8 feet,, to oped in most Maryland<br />\nThese very reformers never ad- The score of die game gives Jay<br />\nSherwood,<br />\nW.<br />\nJohn<br />\nreliSherwood',<br />\nor<br />\nR.<br />\nwin first place. Mahler, Hershey. pecially those under state<br />\n-resolution<br />\nMilmit the deleterious 'effect of what fans little to be happy over but the<br />\nJr., H.<br />\nTurnbull,<br />\nformal<br />\nC.<br />\nA<br />\nDouglas<br />\ncontrol.<br />\ngious<br />\nfor<br />\ntied<br />\nFarr, and Romano were<br />\nthe Con- ton Wagner, and Clark T. Wisotz- Hopkins Awards Nine.<br />\nauthorizing<br />\nsay is obscene on them- coaching staff is far from discourthey<br />\nadopted<br />\nwas<br />\nsecond place with 36 feet all.<br />\nference chairman to appoint a com- ski.<br />\nselves, but are always fearful aged. With two more games under<br />\nFellowships<br />\nChemical<br />\nDiscus Throw<br />\nplans for an inThe discus witnessed the keenest mittee to prepare<br />\nThe Summer Conference dinner<br />\nAnnouncement of the awards of -that the other fellow will suffer its belt the Jay club will be ready to<br />\nliberal association in<br />\ncompetition of the meet. At this tercollegiate<br />\ntake on its ancient rival, St. John's.<br />\nis a new item of this year's pro- fellowships, under a recently estab- from its effects.<br />\nCoof<br />\nDistrict<br />\nthe<br />\nand<br />\npoint, a victory for either the Fresh- Maryland<br />\nthis time former dele- lished system at the Johns Hopkins<br />\nMencken Case<br />\nAt<br />\nArnold<br />\ngram.<br />\nnight<br />\nLine-up:<br />\nSaturday<br />\nmen or Sophomores threw them in- lumbia.<br />\nSeveral years ago when Henry<br />\nQuestion of gates will tell of their experiences University, by which the winners<br />\nArmy<br />\nliopkins Position<br />\nto the lead. Dorman '32 threw 110 Bennett's farce, \"A<br />\nfor the Confer- and efforts will be made to interest will follow a more intensive course L. Mencken was arrested in Bos- Brownley<br />\nGoldberg<br />\nG<br />\nfeet from scratch, and Burke '31 Sex,\" was enacted<br />\nPlayers.<br />\nCosmopolitan<br />\nHammack<br />\nP<br />\nthe undergraduates in this confer- in chemistry, was made yesterday by ton for selling the \"American Hall<br />\nalmost threw consternation into the ence by the<br />\ntalks,<br />\nEdsom<br />\nAt the conclusion of the<br />\nC.P<br />\nence, held at Eagles Mere, Pa., in D. J. C. W. Frazer, chairman of the 'Mercury\" on the Boston Com- Cone<br />\nhands of the Freshmen with a throw<br />\nanwere<br />\nfloor<br />\nKenny<br />\nID<br />\nof - 109 feet under an 13 foot handi- uestions from the<br />\nspeaking on this sub- chemistry department at the institu- mons with a supposedly obscene Kegan<br />\nAlumni<br />\nJune.<br />\nspeakers.<br />\nMcBride<br />\n2D<br />\nswered by each of the<br />\nCaplan<br />\ncap.<br />\nand,<br />\nSteuart,<br />\nacquitted<br />\nwas<br />\nA.<br />\nhe<br />\nit,<br />\nin<br />\nGeorge<br />\nstory<br />\nDr.<br />\ntion.<br />\ninclude<br />\nrevealed opposition to Father ject<br />\nLovell<br />\n3D<br />\nNickel<br />\nExact measurements were not ob- These<br />\npros- '07, Henry E. Corner, '14, Douglas<br />\nAt the same time Dr. Frazer an- yet, in Cambridie a bookseller Campbell<br />\nSundt<br />\nC<br />\nRyan's defense of the Scopes<br />\ntained in the javelin throw, but Neu<br />\nKing<br />\n3A<br />\nand of the right of those in C. Turnbull, Jr4....24, T. Ray Gai- nt5urited the establishment of four was found guilty of selling tht Guild<br />\n'31 took the,laurel with a 157 foot ecution<br />\nthey<br />\nAyre<br />\n'25, and Joseph Blandi, '28. new fellowships under a plan which same magazine to a Harvard stu- Dukehart<br />\nof schools to teach what<br />\nther,<br />\ncontrol<br />\nhandicap.<br />\nheave from a forty-yard<br />\nIA<br />\nDraper<br />\nA. H. Calverton's sensa- Edwin Lockard,'31, new \"Y\" pres- eventually will give one fellowship dent. The judge wanted to pro- Eagan<br />\nFriz and Plummer of '29 contested desire.<br />\nindictment of the present sys0.H<br />\nO'Kcefe<br />\ntional<br />\ntect youth. Mr. Hayes also cited Love<br />\nident, will tell of last year's gather- to each of the forty-eight States.<br />\nfor second plate with respective<br />\nrewas<br />\ncolleges<br />\nI.H<br />\nLyons<br />\nin American<br />\nContinued on Page 3, Cor 2<br />\nContinued on Page 3, Col. 5<br />\nthrows of-154 and 153 feet from a tem<br />\nhearers. ing at Eagles Mere,<br />\nsented ,by a group of his<br />\nthirty-yard handicap.<br /><br />\nTWENTY COLLEGES AT<br />\nLIBERAL CONFERENCE<br /><br />\n16<br /><br />\nPrice 5 Cespts<br /><br />\nHOMEWOOD, BALTIMORE, MD., APRIL 23, 1929<br /><br />\nARTHUR G. HAYES IS<br />\nSPEAKER AT ASSEMBLY<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 23, 1929<br /><br />\nTIIEJOHISHOPEESikvsurrEll<br />\n1897<br /><br />\nTHE SPORT SHOP<br />\nSPORTING GOODS<br />\nFishing Tackle<br />\nTennis Equipment<br />\nKenneth Allen Golf Clubs<br /><br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore. Md., tinder Act of Congress November 3. 10.79.<br />\nPublished semi-weekty from October'to June by the students of Johns<br />\nHopkins University.<br />\nBusiness co.:um:mint-ions should be addressed to the Busirimiss MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MaNaGLsc<br />\nLanni; other communications to the Eurros-IN-CinEF.<br />\nUniversity 0100<br /><br />\nTelephone<br />\nEDITORIAL DEPARTMF_NT<br /><br />\nEditor-en-Chief<br />\nGEORGE E. BANKS, JR. '29<br />\nA srietant Managing Editor<br />\nManaging Editor<br />\nGEORGE G1:14P, '30<br />\nPima. W. Ngss, '29<br />\nAssociate Editors<br />\nRoam S. BAIRD, '30<br />\nWILMER H. DRIVER. *3<br />\nColumsist<br />\n71-211EN E. Frrzcestair:. '31<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR , 23<br />\nAdvertising Manager<br />\nGeosca M. GI.Azum, '29<br />\nOffice Staff<br />\nTheodore A. Fleishman, '31<br />\nRandolph Rothchild, '31<br />\nJohn A. Jamieson. '31<br />\nLyle 17- Gulley. '30<br />\nHenry V. Saunders. '32<br /><br />\nCirculation Manager<br />\nJ. RusErr MYERS. '213<br />\nA drertising Stet\"<br />\nAftin H. Blum. 'JO<br />\nrlcis Burke. '31<br />\nGeorge S. Robertson. '31<br />\nRaffel. '31<br />\nS. Sykes, ''Et<br /><br />\nStreets,<br />\nProduced by The Read-Taylor Company, Lombard and South<br />\nBaltimore, Md.<br /><br />\nEDITORIAL COMMENT<br />\n.\".)<br /><br />\nHe Wasn't to Blame,<br />\nor<br />\nWhat About It, Mr. \"Ben\"?<br /><br />\nA MODERN PATRICK HENRY<br />\nGarfield<br /><br />\nyears ago, before a packed assembI6 Mr. Arthur<br />\nbody<br />\nHayes, by his dynamic oratory, sent the Hopkins student<br />\n\"<br /><br />\nT<br /><br />\nhe proved him-.<br />\ninto paroxysms of enthisAasm. In his forceful speech,<br />\ndeclared -himself an<br />\nself a bitter foe of hypocrisy and bigotry. He-I the cause of<br />\nof<br />\nenemy of unintelligent censorship and a champion<br />\ntes that they<br />\npersonal liberty. So enthused were the undergradua<br />\ndelights of Doc<br />\nwere willing, for once, to forego the gastronomic<br />\nde.monAra•<br />\nAdams' &amp;feteria in order to participate in an enthusiastictheir palms<br />\npounded<br />\npan of their appreciation. Dignified seniors<br />\nin the<br />\nsomersaults<br />\ntogether and the freshmen did everything but turn<br />\naisles. All in all, it was a gala occasion.<br />\nagain set<br />\nLas/ Thursday, before a smaller audience, Mr. Hayes resumed<br />\nHall and<br />\nup his heavy artillery on the platform of the C. E.<br />\nnarrow-minded moralists.<br />\nhis cannonading against the forces of the<br />\nhas blocked<br />\nSince the days of Roger Bacon and Galileo, intolerance in his scienthe progress of the human race. Because he persisted Galileo was<br />\nand<br />\nprison<br />\ntific research work, Bacon was clapped into<br />\nand tyranny: - Like,the victim of the Inquisition's reign of oppression<br />\nspirit of.:inwise, in the field of politics, we can perceive this same divine right<br />\nthe<br />\ntolerance. English yeomen who refused to believe in<br />\nhangman's<br />\nthe<br />\nof kings, were apt to find themselves dangling from certain body<br />\na<br />\nrope. Thus, down through the ages, there has existed<br />\nrepressing their<br />\nof reformers who willingly undertake the -task of<br />\nfellowmen.<br />\nbeen the<br />\nSince the famous•American Mercury case, Boston has<br />\nAmerican liberty<br />\nhotbed of literary censorship. Today, the cradle of<br />\nof<br />\ncomposed<br />\nis the stamping ground of puritanical bigots. A jury<br />\ncontemporary<br />\nauto washers, clerks, laundrymen and other students of<br />\nPreisefs An<br />\nliterature, were perniitted - to decide whether Theodore<br />\nbanned his<br />\nAmerican Tragedy is an immoral book. When Boston<br />\nobserved that<br />\nrecent novel, Oil, Upton Sinclair, with trenchant wit,<br />\nagent:*<br />\n\"America is my market—Boston is my advertising<br />\ndivorce<br />\nMr. Hayes also trained his seige guns on the present<br />\nunion.<br />\nlaws, now existing in the various states of our great American<br />\nwhile in<br />\nIn New York, divorce is permitted on only one ground<br />\naccomplished.<br />\nReno, Nevada, the severance of the marital tie is easily<br />\nwho<br />\nAmerica needs more men like Arthur Garfield Hayes—men<br />\nfor John<br />\nare willing to fight for the freedom of the individual and opinion<br />\nthis<br />\nSmith's right to the pursuit of happiness. Unfortunately,<br />\nof our<br />\nis not 4iated by the matronly ladies of the D. A. R. and some<br />\ndescendso-called patriotic flag-waving -societies. These noble ladies,<br />\nto -inants of the veterans of Lexington and Concord, have seen fit<br />\nBecause<br />\nclude Mr. Hayes' name on their list of disapproved speakers.<br />\nthese<br />\nyouth,<br />\n-of<br />\nminds<br />\nthe views of the lawyer might corrupt the<br />\nblackdaughters of American liberty. have placed Mr. Hayes on the<br />\n7•/.7<br />\nlist.<br />\nWe doubt whether Mr. Hayes' speech on \"Making People Moral<br />\nany of the Hopkins undergraduates into the paths_<br />\nlead<br />\nwill<br />\nBy Law\"<br />\nbroad<br />\nof sin. Perhaps we have already joined the travelers on the<br />\nMr.<br />\nhighway which leads to perdition. Be that as it may, whenever<br />\nCampus,<br />\nHomewood<br />\nthe<br />\nto<br />\nHayes finds it convenient to return<br />\nanother warm welcome awaits him.<br /><br />\nIT CAN BE DONE<br />\nfor<br />\n/THERE has long existed the idiotic notion that it is impossible<br />\nJ. a college man to indulge in campus activity work and still<br />\nthe remaintain his academic prestige in the classroom. However,<br />\nKappa furnish<br />\ncent elections of the Maryland Chapter of Phi Beta<br />\nof<br />\nsufficient evidence to refute this ridiculous assumption. Everyone<br />\nhas engaged<br />\nthe men who have been chosen to wear the coveted key,<br />\ncampus.<br />\nin at least on extra-curricular activity on the Homewood<br />\nof the<br />\nThe leader of the undergraduate list is- Business Manager<br />\nediNews-LErrso and another of the initiates is a member of the<br />\non the<br />\ntorial staff of this famous periodical. Two of the men are<br />\npresident of the BarnBlack and Blue Jay's roster of scribblers. The<br />\n', the<br />\nstormers Club, the Editor-in-Chief of our worthy contemporary<br />\nteamn are also listed among the<br />\ntrack<br />\nthe<br />\nof<br />\nmember<br />\na<br />\nand<br />\nNews,<br />\n7<br />\nnewly elected Phi Bete&amp;<br />\nstill<br />\nIt is perfectly possible to engage in student activities and<br />\nmembers of<br />\nachiete scholastic distinction. The seven newly elected<br />\nPbi Beta Kappa should be doubly congratulated.<br /><br />\nBy \"BENDramatis Personae:<br />\n\"Ben.- really H L. Nlencken.<br />\nFoster Dowell, in charge of publicity.<br />\nM. J. Smulovitch. really H. L. Mencken.<br />\nNVilmer Driver<br />\nBill Banks<br />\nSoldiers of the Queen.<br />\nAlvin Blunt, a butler.<br />\nGeorge Banks, a gentleman of the old school.<br />\n•<br />\nGeorge Gump, really H. L. .11encken.<br /><br />\n4:1<br /><br />\n-Everything for the Outdoors'.<br />\n7.122 West North Ave.<br />\nrd St at Greenmount<br /><br />\nMEET YOUR FRIENDS AT<br /><br />\n\"The<br /><br />\n(ROBIN\"<br /><br />\nThe \"HOTSY TOTSIE\" NIGHT CLUB<br />\nDANCING — DINING — ENTERTAINMENT<br /><br />\nACT I<br />\nThe curtain rises, showing 'Ben- seated at a desk in his<br />\ngarden. He is. writing an article which he is going to call<br />\n\"Dreiser.- However, close beside him is a copy of Mencken's<br />\n\"Prefaces.- The audience is to draw its own 'conclusions.<br />\n\"Ben\" (mumbling): Theodore Dreiser remains perhips. the<br />\nmost enigmatical . . (Aloud) My word! I hope nobody<br />\ncatches me at this. It's pretty risk-y.<br />\n. (An empty taxicab drives up and M. J. Smulovitch<br />\n• steps !out. In his hands he has two cudgels. Pretty soon<br />\nhe intends to lift these cudgels and drop them on \"Ben.\")<br />\nM. J. Smulovitch: Ha! (-He is not heard.) Ha! Ha! (Still<br />\nunheard.), Ha! Ha! Ha<br /><br />\nVErnon<br />\n2682<br /><br />\nof Maryland<br /><br />\nFidelity arid Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\nBALTIMORE BRANCH OFFICE<br />\nGROUND FLOOR, FIDELITY BLDG.<br /><br />\nPhone PLaza 0800<br /><br />\nD C HANDY, Manager<br /><br />\n@A. H. FETTING<br />\ncMANyFACTURING JEWELRY CO.<br />\nManufacturers<br /><br />\nMary say?<br />\nSmulovitch: Well, what will she say?<br />\n(Author's note: I cant' write M. J. any more.)<br />\n\"Ben\": Ha! I've fooled you. I don't know- anybody named<br />\nMary! '<br />\n(Smulovitch pins on a disguise and jumps into the cab.<br />\n.<br />\nwhich disappears in a cloud of dust.)<br /><br />\nGreek Letter Fraternity Jewelry<br />\n444 NORTH CHARLES STREET<br /><br />\nOpen From<br /><br />\nCollege Men.s<br />\nLuncheon 50 Cents<br /><br />\n\"Ben\" (rising, with outstretched arms): Have I deceived him?<br />\nI wonder. I smiled- on the surface but underneath I am<br />\na seething cauldron of passion and crime Ah. woe is me:<br /><br />\nA. M.<br /><br />\n11..z0 A. M. to<br /><br />\nNEW CELESTIAL RESTAURANT<br />\nAMerican • Chinese<br /><br />\n(Curtain)<br /><br />\n117-119-121 N. Howard Street<br /><br />\nACT II<br /><br />\n\"Ben- (blushing) Ha,. Ha.<br />\nBanks: I guess that'll fix you.<br />\n\"Ben\" (getting weak): Ha.-ha, ha.<br />\nGeorge Gump: Listen. \"Ben.\" .why don't you write an 'arti,<br />\nand call it, \"In Defense of Plagiarism\"?<br />\nAlvin Blum: Yes, and copy the whole thing from somebody else.<br />\n(Everyone becomes silent as if theylakIi sudden premonition of what is to come. Immediatel!'a loud clap of<br />\nthunder is heard and a large cloud rolls in the window and<br />\ncovers the whole scene. When it rolls away, everyone is<br />\nsurprised to see Foster Dowell standing in the middle of<br />\nthe room.)<br /><br />\n844 N.lioward St.<br /><br />\nFIDELITY AND DEPOSIT CO,<br /><br />\n\"Ben\": Do you stutter?<br />\nM. J. Smulovitch: No. Why?<br />\n\"Ben\": I thought you were trying to say Hahvahd. Author's<br />\nnote: That wasn't- so good.)<br />\nM. J. Smulovitch: Are you writing another article?<br />\n\"Ben\": Yes, go 'way.<br />\nM. J. Smulovitch (stealing up and looking over \"Ben's\" shoulder): Ha! Plagiarizing again. I see.<br />\n\"Ben\" (softly): Ah, caught! Caught in the ac't What will<br /><br />\nThe scene is laid in the NEWS-LETTER office. \"Ben- is re:ading \"Letters to the Editor,\" all of Which seem to have some<br />\nfault to find with him. Suddenly the door opens and Wilmer<br />\nDriver and Bill Banks walk in. \"Ben\" immediately hides<br />\nunder the desk where he remains until they have left. After<br />\nthey depart, \"Ben\" comes out from hiding. He has aged rapid:y and his hair is now snow white; however, he sits down at the<br />\ndesk and begins to write. The door opens again ,and George<br />\nBanks enters.<br />\nBanks (looking at \"Ben\"): Well. I guess you read Smulovitch's<br />\narticle about you in today's N....VS-LETTER, didn't you?<br /><br />\n(hinge of<br />\nProgram<br />\nWeekly<br /><br />\n•<br /><br />\nVINCENT CA RA<br />\nand<br />\nHis RECORD \\ZOYS<br />\nFLOSSY MIEITER<br />\nManager<br /><br />\ne, 64<br /><br />\nPhone<br /><br />\nI<br /><br />\n'sDancing<br />\nMusic. !I<br />\n!!<br />\nj<br /><br />\nTheatre<br /><br />\nParties<br /><br />\n\\<br /><br />\nE<br /><br />\n!<br /><br />\nS:stssr4 L'<br />\n:=<br />\nd<br />\n\"<br />\nc<br />\nESTA MiLlifltr-245 Psi GL1S gkiNPORSITY<br />\nSTYLES,ORtia_ OV-St, *CiUTHFUL<br />\nCHARTS ScikrEL*F.0.1k..DIS<br />\nGUISHED<br />\nT ,14-31<br />\nSERVICE<br />\nSTATES.<br /><br />\nDowell: Well, what about it, Mr. \"Ben''?<br />\n\"Ben\": All right., what about it.<br />\n(A loud stamping is heard coming up the steps; it is<br />\nthe rest of !the-NEws-LErrEE staff. They are all asking<br />\neach other if they have read Smulovitch's article about<br />\n- \"Ben.\" \"Ben\" pulls a false mustache, a wig, and a pair of<br />\nsideburns from his pocket and puts them on. The staff<br />\nbursts in.)<br />\n\"Ben\"• Hey Everybody, have you read Smulovitch's article'<br />\nEverybody: Yeah. Have you seen \"Ben\"?<br />\n\"Ben\": I think he's gone into a monastery.<br />\n( M. J. ''Smulovitch appears from the corner, where he<br />\nhas been hiding; disguised as a package of Old Golds. He<br />\nstrides over to \"Ben\" and strips off his disguise.)<br />\nSmulovitch: Now, me fine fellow; what have you to say now?<br />\nFoster Dowell: Yes, what about it, Mr. \"Ben\"?<br />\n(\"Ben\" and Smulovitch both draw their pistols at the<br />\nsame time.)<br />\nThen the lights went out—Dowell screamed—and two guns<br />\nblazed in the dark,<br />\nThen the lights went up—nothing happened—two men lay stiff<br />\nand stark.<br />\nPitched on his head and pumped full of lead, lay dangerous<br />\n\"Ben\" McGrew,<br />\nAnd watching his luck, was his light of love—M. J. Smulovitch.<br /><br />\n(Curtain, real fast.)<br /><br />\n0 _ %e<br />\n8V SPECIAL APPOINTIHEATT<br />\nOUR STORE IS THE<br /><br />\nt<br />\nCF ILAUTIMCIUIE<br />\nThe character of the suits and<br />\ntopcoats tailored by Charter House<br />\nwill earn your most sincere liking.<br /><br />\n1Itellallub<br />\nBallancen Minas and farina,<br /><br />\n3<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, APRIL 23, 1929<br /><br />\nHomewood rivals, however, came CHEMISTRY SCHOLARSHIPS<br />\nTENNIS TEAM SWAMPS<br />\nContinued from Page 1, Col. 4<br />\nUNIV. OF BALTIMORE out on the long ,end of a 10-8 score<br />\nthe set and therewith the<br />\nannex<br />\nthe-same time Dr. Frazer anto<br />\nAt<br />\n4<br />\nCol.<br />\n4,<br />\nPage<br />\nfrom<br />\nContinued<br />\nthe case of Countess -Cathcart,<br />\nthe establishment of four<br />\nmatch.<br />\nnounced<br />\nplayBaltimore<br />\nthe<br />\nwho for a time was barred from nine matches,<br />\nnew fellowships, under a plan which<br />\nthis country because of moral ers could land only one set when Summary:<br />\neventually will give one fellowship<br />\nturpitude. When she was told she N. Salzman took the Second set Irons, J. H. U., defeated S. Salzto each of the forty-eight states.<br />\nwas to be barred because she had from Goldberg of Hopkins by a<br />\nman, U. of B., 6-3; 6-1.<br />\nto the<br />\ncommitted adultery, she inquired count of 6-4. Goldberg was not to Gdldberg, J. H. U., defeated N. Fellowships were awarded<br />\nfollowing:<br />\nof the gentlemen of the board if be denied, however, and came back<br />\nJUST PRAISE<br />\nSalzman, U. of B., 8-6; 4-6;<br />\nthey had never committed the to capture the third and winning.set,<br />\nPaul Porter Sutton, 5607 Merville<br />\n6-3.<br />\nthree<br />\nbut<br />\nThe Editor-in-Chief of the NEWSopponent<br />\nhis<br />\nallowing<br />\nAvenue, Baltimore.<br />\ncrime. Their answer was<br />\nHendefeated<br />\nH.<br />\nU.,<br />\nJ.<br />\nHelmholtz,<br />\nLETTER:<br />\n.<br />\nwe are American citizens.\" \"Ob- games.<br />\n\"we<br />\nRobert D. Stiehler, Hicksville, New<br />\nry, U. of B, 6-0; 6-0.<br />\nHopfor<br />\nIrons, playing first man<br />\nscenity is purely subjective,\" said<br />\nDear Sir:<br />\nDiehl, York.<br />\nday's proceedings Brockman, J. H. U., defeated<br />\nGilbert is intere,,ted<br />\nPhi Beta Kappa recently held Mr.-kiages. It is all a matter of kins, started the<br />\nMaurice E. Krahl, Greencastle, Ind.<br />\n6-3.<br />\n6-3;<br />\nB.,<br />\nof<br />\nU.<br />\nin dramatics to the<br />\ncustom and of one's own point o' rather auspiciously by defeating S.<br />\nPa.<br />\nBethlehem,<br />\nEbert,<br />\nS.<br />\nMichael<br />\ntheir elections and a large number<br />\nSeidendefeated<br />\nU.,<br />\nH.<br />\nJ.<br />\nview. If one is used to seeing Salzman in straight sets. Helm- Gump,<br />\ntiniest detail A One<br />\nRobert W. Cairns, Oberlin, Ohio.<br />\nman, U. of B., 9-7; 6-2.<br />\nof scholars received the singular women in a<br />\nstate of undress, the holtz, third man on the Jay team,<br />\ntime when be was<br />\nrabelow,<br />\nWillard E. Bleick, Maplewood,<br />\nhonor of election to that body. sight ceases to be suggestive. The allowed Ed. Henry not even one Shugar, J. H. U., defeated<br />\nKing Midas he actualU. of B., 6-3; 6-4.<br />\nN.J.<br />\nThose elected represent various very fight being waged by the re- game in their match. Helmholtz<br />\nly counted out the<br />\nDoubles:<br />\nMains.<br />\nophis<br />\nAuburn,<br />\nto<br />\ndefeat<br />\nsets<br />\nField,<br />\nlove<br />\ntwo<br />\ntook<br />\nE.<br />\nTheodore<br />\natformers against obscenity,'defeats<br />\nfields of intellectual activity and<br />\nwhiskers for his heard.<br />\nHelmholtz and Irons, J. H. 1.1., de- Kenneth E. Glidden, Durham, N. H.<br />\nits own purpose in the long run. ponent. Diehl, of Baltimore, found<br />\ntainment.<br />\nfeated S. Salzman and' N.<br />\nGil says nothing quite<br />\nthe going pretty hard against BrockWis.<br />\nMadison,<br />\nRuhoff,<br />\nAvowedly<br />\nR.<br />\nbooks<br />\nobscene<br />\nJohn<br />\nreceive<br />\nHowever there is one name<br />\nSalzman, 6-3; 10-8.<br />\npermeates his audifree and widespread advertise- man, and fell before the Jay capand drives in straight Brockman and Gump, J. H. U., dewhich appears in the list of the un- ment,.and arouse<br />\nence with college atunnecessary and tain's strokes<br />\nfeated Diehl and Henry, 6-3 ;<br />\ndergraduates that deserves the spe- unnatural curiosity.<br />\nmosphere like when<br />\n6-2.<br />\nWins in Extra Games<br />\ncial attention and praise of every<br />\nhe wears Braeburn<br />\nMorality Through Law<br />\ndeU.,<br />\nJ.<br />\nH.<br />\nShugar,<br />\nand<br />\nGoldberg<br />\nGump, following the lead of his<br />\nFROM<br />\nJOhns Hopkins man. The man to Prohibition is another example<br />\nUniversity Clothes.<br />\nfeated Seidenman and JabeSULSKY<br />\nteammates, defeated Seidenman, U.<br />\nwhom I refer is one who has been of an effort to obtain morality of Baltimore, in straight sets, but<br />\n7-5.<br />\n6-1;<br />\nlow,<br />\n313 W. FRANKLIN STREET<br />\n$35<br />\nseverely physically handicapped through law. It has not proved only after the Baltimore player had<br />\n$40<br />\nL. G. BALFOUR CO.<br />\n$45<br />\nsince his entrance in this institu- successful. \"The question is not forced Gump into extra games to<br />\nBOOKS<br />\none of liquor, but where to get it<br />\nFraternity Pins<br />\ntion in the year 1925. With all of<br />\nfirst set 9:7. Shugar, Hopwin<br />\nthe<br />\nanged<br />\nld---Exch<br />\nBought—So<br />\nr -Nur<br />\nJewelry, Favors, Novelties<br />\nand ,how much one must pay per<br />\nhis handicaps he has reached the quart,\" said Mr. Hayes. The law kins,'defeated Gabelow to conclude<br />\nHOPKINS RINGS<br />\nSTORE<br />\nBOOK<br />\nPIPPEN'S<br />\nheights of success and promises to never will work as long as a tre- the singles matches. .This match<br />\n1109 Fidelity, Bldg.<br />\nClothiers and Haberdasher..<br />\n605 N. EUTAW STREET<br />\nPhone CAlvert 1564<br />\ndo so in the future. The man of mendous percentage of the peo- marked Shugar's first appearance on<br />\nTtui<br />\nwhom k am speaking is Leonard B. ple oppose it. A law is only feasi- the Hopkins team since the southern<br />\n17 E. Baltimore St.<br />\nYELLOW CAB STANDS<br />\nPhone HOmewood 7908<br />\nble where a very small portion of trip, which the Jays took 'during<br />\nNolley.<br />\nAT<br />\nput in the Easter holidays.<br />\nbe<br />\never<br />\ncan<br />\npopulation<br />\nthe<br />\none<br />\nas<br />\nons<br />\ncongratulati<br />\nI offer my<br />\nHomewood Field<br />\nviolating it. When prohiWin Al! Double Matches<br />\nwho has the greatest respect and ad- jail for<br />\nST. PAUL at 33rd STREET<br />\nand St. Paul Streetz<br />\n35th<br />\nproscice the general<br />\nIn the doubles, the Black and<br />\n31st and St. Paul Streets<br />\nmiration for the man who has re- bitionists<br />\nStore<br />\nd<br />\nDrug<br />\nenHome—HO. 20911<br />\nNeighborhoo<br />\nthe<br />\nYour<br />\nsince<br />\nPhone, CAI. 1380<br />\ncountry<br />\nthe<br />\nin<br />\nEfficient Service<br />\nand<br />\nas<br />\nefSafe<br />\nperity<br />\njust<br />\nplayed<br />\ncourtmen<br />\nBlue<br />\ncently. been elected to the highest<br />\nFRANCES T. BANNON<br />\nof the Eighteenth ficiently taking the three matches<br />\nCharge for Extra Passengers<br />\nactment<br />\nNo<br />\nundergraduan<br />\nby<br />\nTIONS<br />\nattainable<br />\nPRESCRIP<br />\nto<br />\nHARBAUGH El BANNON<br />\nSuccessor<br />\nhonot<br />\n'PHONE<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\nAmendment, Mr. Hayes said he in straight sets. The Salzman boys, School Supplied, Candy, Cigars<br />\nate.<br />\n(Room 28)<br />\nVERNON 1212<br />\ncomes back with the ar- teamed against Helmholtz and Irons,<br />\nUnexcelled Fountain Service<br />\nStenographic Dictation, Copying,<br />\nFOR A<br />\nWilmer H. Driver. always<br />\nMultigraphing, Mimeographing<br />\ngument that the country had pro- put up a stiff battle and forced the<br />\nYELLOW CAB<br />\nMaryland<br />\nBaltimore<br />\nMake Our Store Tour Store<br />\n1919.<br />\nbefore<br />\nTheir<br />\nsimilarly<br />\ngames.<br />\nextra<br />\ngressed<br />\nsecond Set into<br />\nas<br />\nTheir argument is as plausible<br />\nthe old syllogism: \"Adam was<br />\nthe first man; I am a man; therefore all elephants eat peanuts,\"<br />\nE. E. ADAMS<br />\nthe speaker humorously pointed<br />\nHAYES AT ASSEMBLY<br /><br />\nMAIL<br />\nILA6<br /><br />\nContinued from Page 1, Col. 5<br /><br />\nRENT<br /><br />\nSNAPPY<br />\nTUXEDOS<br /><br />\nBirely's Pharmacy)<br /><br />\nBARN CAFETERIA ,<br /><br />\nWith a cigarette<br />\nas good as Camels<br />\nthe simple truth<br />\nis enough<br /><br />\nout.<br />\nReligious Fanaticism<br /><br />\nSuch laws as the Tennessee<br />\nAnti-evolution ,Law are examples of the desire of the religious<br />\nfanatics to protect the fundamentals of their faith. Through ignoTHE CHARLES E. MYERS CO.<br />\nIncorporated<br />\nrance, they hope to preserve fuManufacturer of<br />\nture generations in the same be-<br /><br />\n'RUBBER STAMPS<br /><br />\nliefs as they hold today.<br />\nMarriage and divorce laws are<br />\nbooks<br />\nalso written into the statute<br />\nbecause<br />\nJust<br />\nreformers.<br />\nby moral<br />\nto dia particular sect is opposes<br />\nTHE NEW<br />\nshould<br />\nit<br />\nwhy<br />\nreason<br />\nnq<br />\nis<br />\nvorce<br />\nHOLLYWOOD SHIRT<br />\non<br />\nseek to impose that belief<br />\nHollywood's latest creation! Black,<br />\nof mardiversity<br />\nThe<br />\neveryone.<br />\nOrange and Blue are the colors.<br />\nthe<br />\nriage and divorce laws typifies<br />\nhypocrasy of our present stand<br />\neven<br />\n\"The Old Boy Himself\"<br />\nMr. Hayes maintained that<br />\nlasvs were made<br />\ndivorce<br />\n.the<br />\nif<br />\nAVES.<br />\nNORTH &amp; MARYLAND<br />\nwould Be<br />\nmore lenient, marriage<br />\nNot all<br />\njust as firm as it is now.<br />\nseparate if<br />\nwould<br />\npeople<br />\nmarried<br />\ndo so.<br />\nthey weie at liberty to<br />\nby affecbound<br />\nare<br />\nthem<br />\nof<br />\nMost<br />\n,<br />\n„<br />\nand family,<br />\ntion, love for home<br />\n11111111',\"., 1111!Iii<br />\nfar better<br />\nbe<br />\nwould<br />\nIt<br />\nhabits.<br />\nor<br />\ncouunhappy<br />\nif<br />\nconcerned<br />\nfor all<br />\neasily and<br />\nples might separate<br />\nhappy lives<br />\nhave a chance to live<br />\neverything.<br />\ninstead of ruining<br />\nthese reThe whole course of<br />\npursuit of<br />\nthe<br />\nblock<br />\nto<br />\n,<br />\nis<br />\nforms<br />\ngloom.<br />\nha'qiness and substitute<br />\ncleverly parodied<br />\nMr. ilayes very<br />\nIndependence<br />\nthe Declaration of<br />\nIn style and quality \"Bostonians\"<br />\nclosof this document<br />\nversion<br />\nhis<br />\nfootwear<br />\nequal the most expensive<br />\nthat,<br />\nstatement<br />\nthe<br />\ning with<br />\nProduced today.<br />\ninstituted<br />\nare<br />\n\"Governments<br />\nAnd the saving is a big item.<br />\ntheir just<br />\namong men deriving<br />\nKlan,<br />\nKlux<br />\nKu<br />\nthe<br />\npowers from<br />\nMostly $7 to $10<br />\nLeague and the<br />\n-Saloon<br />\nAnti<br />\nthe<br />\nto the con<br />\nD. A. R. In responding<br />\nExclusively in Baltimore<br />\ngreeted his<br />\ntinued applause which<br />\n\"I am parBOSTONIAN<br />\ntalk, Mr. Hayes said,<br />\nbecause<br />\nticularly glad to hear this<br />\nSHOE STORE<br />\nthat some<br />\nbelieve<br />\nto<br />\nme<br />\nit leads<br />\n112 E. Baltimore Street<br />\nwith me.\"<br />\nof you may agree<br />\nThe Service Shop<br />\n319 W. Redwood St<br /><br />\nCAM E<br /><br />\nc.MANNIE (BERG .<br /><br />\nCollek,e eMen!<br /><br />\nCIGARETTES<br /><br />\nWHY CAMELS ARE THE BETTER CIGARETTE<br /><br />\nCamels are made of the choicest tobaccos<br />\ngrown—cured and Uendeyji4 expert care.<br />\nCamels are mildinl ellow.<br />\nThe taste of amels is smooth and satisfying.<br />\nCamels ar cool and refreshing.<br />\nThe fragrance of Camels is always pleasant,<br />\nindoors or out.<br />\nThey do not tire the taste nor leave any<br />\ncigaretty after-taste.<br /><br />\n,<br />\no 1929. R. 3. Reynolds Mews<br />\nIt4. C.<br />\nWIrese4slook<br /><br />\nTHE JOHNS HOPKINS NEWS-LET-MR, APRIL 23, 1929<br /><br />\nMen who want<br /><br />\nNEW<br /><br />\nNTERCOLL EG LATE:;<br />\nNEWS - -<br /><br />\nSummer Work<br /><br />\nTUXEDOS<br />\nFOR HIRE<br />\nAiss Dress Shirts, Collars. Tits,<br />\nSliver Studs, Etc<br />\nSte<br />\n11. GARLAND HERSHEY<br />\nAbout Special Price to Hopk:: Men<br />\nWakkef Dress Suit Co<br /><br />\nCal. 5344<br /><br />\n119111r1M111WillrM911,<br /><br />\nThis Smoke<br />\n1<br />\nAids Artist<br />\nTo Nab Ideas<br />\nledepeedeetee, Mo.<br />\nJune 24,.lf28.<br />\nLeos Sr Nether Col;<br />\nRieanowd. Va.<br />\nDear Mac<br />\nPerhaps you would Face to know in<br />\n*ita ward or no how kom* partners<br />\nwith Edgeworth in a bn.ss way.<br />\nBy proleadoe I am a cartoonist;<br />\nwive you probably know is &amp;led upon<br />\nto create new Wass. While this is<br />\npart at the prorefired as the bieFrts.ter<br />\nit may eerily<br />\nleation„ I have<br />\nperste will but<br />\nbe mastered,<br />\nrecline say easy their, light a pipe,<br />\nan,1 live withastagin' stirs persons in<br />\nsresiatie meoire donde that will<br />\nsoca MI the room. Edgeworth has<br />\ngime are mere ideas than any other<br />\nbrand et tobeartrosi 1 -marrinr my<br />\npupeteitquiteawhaleago. The merit<br />\nhas been wonderfuL The more you<br />\nme Edgeworth, the more yea crave<br />\nit-am as a drug. bin as a wholesome<br />\npiseatre.<br />\nCompfimeating the standard quality(wildssteams mew than the words<br />\nsienify)el Mipmrarth,Jam a devoted<br />\nand profound seer.<br />\nYount very<br /><br />\nTENNIS TEAM WINS<br />\nTWO MORE MATCHES<br /><br />\nUedeHePkias Net Sc<br />\nHopes for the present day<br />\nfeated This Season<br />\n:ege man to dear up politics in<br />\nthe United States can now be<br />\nWELL BALANCED SQUAD<br />\nSee Faze 131 in :he<br />\nvoiced with a little more ass.ttrit-..<br />\nWeek's Lay-off Does Not<br />\nDickinson College is the firt<br />\nAmerican ?viagazme<br />\n• Affect Jay Skill<br />\ns.tiuition to make a step forward<br />\n:n abolishing all fraternity<br />\nac:: •<br />\nties in school elections, and it is<br />\n- 7: ,..u.sed by cad<br />\n-TED<br />\nTEACHERS ';;•;....1,̀<br />\ntenni,. team<br />\nhoped that their act will set an tf. the i<br />\nYen izt si-coner.. wi. sr=<br />\nFranklin and Marshal<br />\nnew. be seentstra.-7 er.,te<br />\nexample to others. Two tratermci,.W,<br />\nesAlostss sh,,4,1 wrfte,<br />\n_<br />\n, m the<br />\nhale plses-r.i Emmy Fit,pkins ertsd.-ties at Dickinson, reprosentiug:,<br />\natm<br />\nsixty-five studentslhave pledged!ctri.rfog<br />\nTHE BALTIMORE TEACHERS'<br />\n_<br />\nAGENCY<br />\n_<br />\ntss.i \"es.<br />\n:0 keep out of all political entan- record of<br />\n114C-1<br />\nfour satagt:<br />\nto<br />\naiming<br />\nand<br />\nany<br />\nin<br />\nglements and to support<br />\nfOr .a=7<br />\nelections only those men whom tar.i. defeat at<br />\neach inClividual member derma fit<br />\nfor the positiOn. By the plf..;4:e<br />\n441 ,ill be forbidden to discuss. - 7<br />\nLaablashed :<br />\neach man<br />\nmg election a<br />\nIrono Wins<br />\nPHILADELPHIA<br />\nthereby pc::: c-a unbiased<br />\npacollege<br />\nthe<br />\n7.:a7.<br />\nDickin.s,<br />\nThe<br />\nOttziai Makers of the Standard<br />\n, per. his expressed the hope that<br />\nmatters will never agarn!end<br />\nthe tangle of* year. and has<br />\nthreatened to publish the<br /><br />\nYou do get Better Kodak Pictures<br />\nfrom<br /><br />\nhEPP PHOTO—SERVICE<br />\nI<br />\n—<br />\n.-<br /><br />\nei<br />\n4=<br /><br />\nEST. 1900<br /><br />\nGREENMOUNT AVENUE<br /><br />\nBAS<br /><br />\nJohns Hopkins Ring<br />\nPnees Upei Re4tien<br /><br />\nthe ref,:rt.:<br />\nnur ha:s<br /><br />\nPhotographic Supplies<br /><br />\nFor Sweaters,:Trench Coats, Slickers, Sporting Goods,<br />\nArmy Uniforms and Supplies, also Aviation Outfits, head<br />\nyour airship and land at the<br />\nOUTING SUPPLY CORPORATION<br />\n21 North Liberty<br /><br />\nStreet<br /><br />\nHENNEGEN-BATES COMPANY •<br /><br />\nDicldns•<br />\ngames<br /><br />\nr.ra'•<br />\n, repor: casea According t-LF,ESS ET<br />\n_ _<br />\n12<br />\nreplies from the presidents<br />\ndeans of approximately 300 col- match Haz- •<br />\n•<br />\n:eges, and sponsored by He77:.<br />\nCOMPLETE<br />\nGrattan Doyle, dean of men 07:<br />\nBALTLMJ.RE AT CHARLES STREET<br />\nGeorge Washington University,; ,..a‘l Hazeltine 4-I , -...-.., - A<br />\nthe average modern American :- game in the second ,s/et. but :<br />\nstudent is not a carefree \"co'.:t- -- --ylvanian staged a comeback •<br />\ngiate- person as pictured by - • - - -hat and the third -se: by -...-V 11<br />\n-_- re of. 6-4q<br />\n•<br />\nmany popular magazines, but<br />\nDECORATIONS<br />\n'INTERIOR WOOD WORK<br />\nE<br />\nF. and H. Wins<br />\nstead has higher ideals and p-_-.:-a:-.;:<br />\nFrank::::<br />\nVon Seldenech. ..,::<br />\nposes. does better and more serlRADJOHN C. KNIPP &amp; SONS.<br />\nous scholastic work and lives by a .'_ar•shall, encountered less opposi- 1.,<br />\nTAYLOR<br />\nhigher standard of moral conduct • - :71 defeating Brockman. Jay: :<br />\nPow<br />\nFURNITURE<br />\nCo.<br />\n- Wa successive sets. I<br />\n:a .<br />\nthan the student of any precedBALTIMORE,<br />\nMD<br />\nDoyle<br />\n\"Dean<br />\ning generation.<br />\nout several months ago a<br />\nA<br />\nShow Roosts<br />\nFactory<br />\ncokuitt,<br />\nuqtlight<br />\ntett'<br />\nPes<br />\nJrrat<br />\nlengthy questionnaire enco a,- ler<br />\n141 N. Ci-lafles Street<br />\n5 Pulaski .Street<br />\n14.12•.1<br />\nprol,social<br />\nevery<br />\npractically<br />\ning<br />\n.4<br />\n1.•X<br />\nlem of the student of today. In<br />\nsending out the. questionnaire<br />\nExtra High Grade<br />\n•SERVICE•<br />\nDean Doyle said: -I haar. fe:•<br />\nAt Your Service 24 Hours a Day<br />\nconcern ar.-f : •-.etimes: chagrir.<br />\nSmoking Tobacco over the rner-..) picture. of the<br />\nProducers of \"The !.* eau-Letter\" 'collegiate' boy or girl which the<br />\n11A6Maii.<br />\nINCORPORATED<br />\n1718 N. Charles Street<br />\ngeneral public has apparently cre- up,<br />\nkimmeszez DIARISTS TEL•EGRAPH DELIVERY ASSOf:LATI<br />\n20c FIRST HALF-MILE .<br />\nated during recent yeas. I feel team .so thaiT<br />\n10c each additional Half-Mile<br />\nthat this imaginary individual !doubles<br />\nJ. A. RI rit.R &amp; SON<br />\nor fraction thereof<br />\nSurrtrary :<br />\nby no means typical and therefore<br />\nFlorists cad Decoldtors<br />\nTbe above rate applies for I to 4 passenger,<br />\nBALTIMORE. MD<br />\nI am sending this letter to dean J. H. U. itfeated<br />\n110111 N. CHARLES ST., Near 20Th<br />\n, 1:672<br />\n.<br />\nPhone, VErn<br />\nCOMPARE!<br />\nin a number of leading college<br />\n• r-2<br />\n\\-Ernori 4090<br />\nStand a Honcuooci<br />\nand uni-.-ersities throughout the 2<br />\nU..<br />\nj.<br />\nconsena<br />\nget<br />\nto<br />\norder<br />\nco:':<br />\nE4umar, ;'..-6; 7-5<br />\n',act and opinion which can.<br />\nNEW LIFE<br />\n3—Haz !tine, F. St M.. def--.;.THE GIANT<br />\n•:-e-ented to .the public.\"<br />\nFOR MOTOR<br />\nmh:_::tz:<br />\n:<br />\nPOWER FUEL<br />\n..e'Lr_lenech. F. r. M., deft::GEO. M. PLEINES<br />\n13n-x-kmar.. 6-2: 6-4.<br />\nThe Fogg Museum of Harvard.<br />\n\"STANDARD\" MOTOR OIL<br />\n•<br />\n']efea:e,:. 1<br />\nhas adr,Pted the plan. of loaning<br />\nre h. 9-7<br />\npaintings to students to :decorate<br />\nThe Measure of Oil Value<br />\n11 their rooms. It is believed that ! Dublk<br />\nI this practice . will encourage the l<br />\nSTALf7ts,<br />\n.• I.<br />\n&gt;-Ei<br />\nSTANDARD OIL COMPANY OF N<br />\nand H<br />\n)6RTH AVE MARKET<br />\nstudy and appreciation ,of art<br />\ndefeated Kahler and Ecluaa:-..<br />\nBALTIMORE. MD.<br />\nf,-4: 10-8.<br />\nA student at the College of In- 2—Goldberg and Br?ckrnan. J.<br />\ndefeay-,1 V :-.<br />\ndustrial Arts. Denton. Texas. recently handed in an exam paper<br />\nwith the following remark inserte4 at the bottom: The Lord pf,<br />\n',11),<br />\nMN<br />\nH,osts. be with us yet; left we for- Tennis Team Swamps<br />\n—are the New Spring Books!<br />\nget, lest We forget.\"<br />\nInit.. of Baltimore<br />\nYou'll never know what<br />\n.<br />\nYou'll find rows and rows of them—brand-new books in bright<br />\nmarking the painstructor<br />\nThe<br />\ntenr:g,,od<br />\nv<br />\n•<br />\nt-.-.cc:<br />\nPlaying<br />\ncovers—smelling<br />\npungently of printer's ink and crisp paper—fiction,<br />\nyour car will really do<br />\n\"<br />\ner thought it worth an \"F\" and<br />\npoetry, biography, science—awaiting your choice at our two stores<br />\nthe Johns Hopkn-i- •,:ns team .-i,until you start feeding it<br />\nadded to the mark: \"The Lord of<br />\nTHE NORMAN, REMINGTON CO.<br />\nfeated the Univer:ny of Baltimor,<br />\nAMOCO GAS.<br />\nHosts' was with us not; for we<br />\nDown-Town:<br />\nUpTown:<br />\nracqueters 9-0. Saturday, on the<br />\nCharles Sc. at Mulberry<br />\nforgot, for we forget.\"<br />\n1118 North Charles Sc.<br />\nHomewood Courts. By this victory.<br />\nthe Blue Jays kept their season's<br />\nHeywood Brown in a recent record inviolate. This was the secstatement regarding co-eds on ond victory in two days arid the<br />\nAmerican campuses stated that he sixth straight win Of the season.<br />\nwas strongly in favor of their The other teams that have heretopresence at the universities. \"I<br />\nNo Deposit Required<br />\nfore fallen before the cuts and;<br />\nthink it is best,\" he said, \"for the<br />\nof Johns Hopkins University Students<br />\nsmashes of the Jay netmen are:<br />\ncollege, man to have association<br />\nUniversity of Virginia, Washington<br />\nwith women in college rather<br />\nLight and<br />\nand Lee, University of Delaware,<br />\nBuicks<br />\nLombard Sts.<br />\nno<br />\nis<br />\nthere<br />\nthan outside. When<br />\n6000<br />\nPLaza<br />\nVillanova, and Franklin and MarChevrolets<br />\n1723-25 N.<br />\nopportunity within the college the<br />\nshall.<br />\nCharles St<br />\nChryslers<br />\nmen will go outside and associate<br />\nVEmon 4049<br />\n(Easy Going)<br />\nHupmobiles<br />\n2402 Pennsylwith women on a lower intellec- In Saturday's encounter, the<br />\nvania Ave.<br />\nWillys-Knights<br />\ntual standing, and they show a Black and Blue courtmen found the<br />\nLAfayette 2000<br />\ndecided preference for wait- going comparatively easy. Of the<br />\nBaltimore Concedes Milestone Siipremaijr-3<br />\nresses.\"<br />\nContinued on Page<br />\nOrders ad:r;ted at t.be<br />\n?sac r -e in the Cciilege<br /><br />\n_<br /><br />\nrr9<br /><br />\n444<br /><br />\nEdgeworth<br /><br />\nzMayflozz;er<br /><br />\nESSO<br /><br />\nYou'll Never<br />\nKnow<br /><br />\nCab Co.<br /><br />\n\"Say it with Flowers\" •<br /><br />\n'—<br />\nstimulating-<br /><br />\ndelightful<br /><br />\nIt<br /><br />"}], "field_media_file": [{"target_id": 38410, "display": null, "description": null, "target_type": "file", "target_uuid": "f26d2556-471a-4fa4-88b6-322be553ef4b", "url": "http://digital.library.jhu.edu/system/files/2022-03/13372-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13372, "target_type": "node", "target_uuid": "c1576fa4-53b7-4ede-8bf5-da7dfd51b8f4", "url": "/node/13372"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "6427f25f-4039-46e4-8425-a0ccf3baef1d"}]}