{"mid": [{"value": 36997}], "uuid": [{"value": "a80a8dd0-0476-485f-8229-088ddb26a6ee"}], "vid": [{"value": 36997}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13132-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:40+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXIX, No 2<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 7, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\ni HOPKINS R. O. T. C. LEADS STUDENTS ASKED TO<br />\nTHREE HUNDRED AND SEVEAST IN THEORETICAL<br />\n\"VOTE\" FOR PRESIDENT ENTY-FIVE MEN ENROLL<br />\nIN FRESHMAN CLASS<br />\nTRAINING<br />\nWith the presidential election less<br />\nLocal Unit is on Distinguished Service than a month away, the NEWS- All States But Four, and Ten Foreign<br />\nList for 1924-25<br />\nLETTER iS giving all students, Lands Represented. Russia With<br />\nLawrence And Blandi, Freshmen, Play Brilliant Game For Hopkins;<br />\nSix Men Leads Foreigners<br />\nAccording to Lieutenant Colonel whether of voting age or not, and<br />\nBlandi Injured; Van Orman Uses Two Teams Against Visitors<br />\nAccording to figures which<br />\nWalter C. Short, senior member of professors, an opportunity to exJohns Hopkins came through as<br />\nthe Board of Inspection sent out by press their choice for the Presi- were given out last week by the NINETY-FIVE CARS PARKED<br />\nwas<br />\nexpected Saturday at Homethe government to recommend R. dency. Because of the fact that the Office of the Registrar, there are<br />\nON CAMPUS AS<br />\nwood<br />\nField and easily trounced<br />\n0. T. C., units for the Distin- majority of undergraduates are not<br />\nAVERAGE<br />\n375 new men enrolled in the unthe<br />\nRandolph<br />\n-Macon eleven from<br />\nguished Service List, the Johns of voting age, the NEWS-LETTER'S<br />\ndergraduate schools this year. Of<br />\nthe<br />\nOld<br />\nDominion,<br />\nby the score of<br />\nFive States Represented. Fords Lead,<br />\nHopkins Reserve Officers Training straw ballot has little immediate<br />\nWith Twenty-one Other Makes<br />\n32-0.<br />\nnumber<br />\nthis<br />\n216<br />\nThe<br />\nenrolled<br />\nin<br />\nare<br />\ngame<br />\nwas an excelCorps has the highest standard of significance. But the attitude of the<br />\nRepresented<br />\nlent<br />\nexperience<br />\nfor<br />\nthe<br />\nBlack and<br />\nCollege<br />\nthe<br />\nof<br />\nArts and Sciences,<br />\ntheoretical training of any R. 0. college student in the coming elecOn one day last week Johns Hop- Blue as it enabled Coach Van OrTC. unit from Maine to Florida. tion has sufficient interest for its which is an increase of 104 over<br />\nkins professors and students rode man to test the skill of 21 of his<br />\nConsequently, the Hopkins Unit is own sake to make the balloting last year's 112 academic students;<br />\nto<br />\nthe University in ninety-five au- pigskin chasers and likewise to<br />\non the Distinguished Service List worth while.<br />\n131 men registered in the School<br />\ntry out many forms of attack and<br />\nfor 1924-25.<br />\nThe ballots are printed at the top of Engineering, an increase of 55 tomobiles, including twenty-two difdefense.<br />\nMajor Horsington, head of the of page four of this issue of the over last year's entering class. ferent makes, and representing five<br />\nThe Blue Jays with six new<br />\nHopkins Unit, says that this NEWS-LETTER. Mark and sign the The remaining 28 freshmen are in states. These statistics were semen<br />\nin the line-up were a little<br />\nachievement of the R. 0. T. C. ballots, and deposit them before the School of Business Economics<br />\ncured Friday by a census of all ma- slow in registering but before<br />\nthe<br />\ndraws men into its ranks. He an- 1 P. M., Thursday, in a box that which shows an increase of seven<br />\nchines parked on the campus at first quarter was ended they had<br />\nflounces the enrollment to be three will be placed in the basement of over the enrollment of the entercrossed the Virginians' goal line.<br />\n11 A. M.<br />\nhundred and eighty-two. This num- Gilman Hall for the purpose. Only ing class of 1923-24.<br />\nher, which is the largest i,n the his- signed ballots will be counted.<br />\n- Henry Ford's versatile \"flii4er Blandi, a freshman, carrying the<br />\nTwo hundred and sixty-two of<br />\ntory of the unit, is subject to<br />\nThe results will be made known the new men are from Baltimore leads the field with thirty-one rep- ball. The backfield working together for the first time, ran<br />\nchange because more menare en- as soon as the ballots are counted.<br />\nTwelve Chevrolets<br />\ncity and the counties of Maryland, resentatives.<br />\nsmoothly.<br />\nBefore the half had<br />\nrolling every day. It is made up<br />\neach of which is well represented. gave that make second place, and ended<br />\nHopkins had added 13<br />\nas follows: thirty-eight seniors, COLLEGE SPIRIT PREVAILS<br />\nSixteen of the freshmen are from the Buick ran third with nine. The more<br />\nAT ANNUAL Y. M. C. A.<br />\npoints to their total. The<br />\nthirty-six juniors, one hundred and<br />\nforeign<br />\nlands, Russia leading with Dodge was a close fourth with score<br />\nRECEPTION<br />\nat the end of the first period<br />\nfifteen sophomores and one hunsix and China being second with<br />\nwas Hopkins, 19; Randolph-Maeight.<br />\ndred and ninety-five freshmen. The Hopkins Activities Presented In Talks<br />\ntwo. There is one man each from<br />\nBy Undergraduate Leaders Of<br />\nJunior engineers are credited with<br />\nThere were also five Essexs, five con, 0.<br />\nCampus Activities<br />\nCanada, Egypt, Germany, Italy,<br />\na hundred per cent enrollment.<br />\nThe Black and Blue had gained<br />\nPoland,<br />\nRumania, Panama and the nupmobiles, four Overlands, three most of their ground<br />\ngood-fellowship<br />\nof<br />\nspirit<br />\nA<br />\nCaptain Scobey Welcomed<br />\nby continual<br />\nMarmons. two each of Packards,<br />\nThe faculty has lost one of its marked the Y. M. C. A. Freshman Philippines, making a representaline plunges. The keenness with<br />\nStutzes, Studebakers and Oaklands,<br />\nmembers in Captain Paul, who has Reception, held last Friday night tion from ten foreign climes.<br />\nand<br />\none Franklin. Durant, Hudson, which the Hopkins gridders<br />\nbeen called to service in Hawaii. in the C. E. Hall. About one hunThe other 97 men are divided<br />\nLincoln, Cadillac, Jordan, Chrys- watched the pigskin made life unCaptain W. P. Scobey, the new dred freshmen and an equal num- among 26 states and the District<br />\nler, H. C. S., Standard and Chal- happy for the Virginians, and<br />\nmember of the faculty, who has ber of upperclassmen were present. of Columbia, which has seven repplaced the Homewood team in<br />\nmers.<br />\ntaken the position of Captain Paul, The sophomore for a time laving resentatives. The greatest numpossession<br />\nof the ball most of the<br />\nMaryland, of course, had the<br />\nis a Vanderbilt College man. He aside the traditional feud, joined ber of \"outsiders\" are 21 New<br />\ntime.<br />\nBlue<br />\nJay forwards could<br />\ngreatest number of automobile lihasbn i<br />\nnot be held back by the opposiService since 1916 with Juniors and Seniors in greet- Yorkers and the next greatest con- cense plates, with a total of<br />\nninety.<br />\nand during that time has served on ing the new class.<br />\n- tribution to the class of Twentytion with the result that during<br />\nMichigan<br />\nhad<br />\ntwo<br />\nrepresentatives,<br />\n11' ,lexican border, with the Sec- Each person who entered the hall eight is Pennsylvania's 17. Virthe entire game Randolph-Macon<br />\nond Division in the Army of Oc- was given a tag—upperclassmen, ginia follows with nine men and and Virginia and Pennsylvania had succeeded in booting the ball only<br />\nwhite—upon seven hail from New Jersey. one each.<br />\ncupe;nn in Germany, and three green; freshmen,<br />\ntwice, the rest of the times the<br />\nye— in Hawaii. Captain Scobey which he wrote ,his name, in order There are four Georgians and an<br />\nkicks were smothered and the pighas been especially active this past to make formal introductions un- equal number came from Ohio. RENAMING OF BUILDINGS<br />\nskin recovered by the Black and<br />\nCONSIDERED<br />\nyear. He graduated from the In- necessary. Except for a line around Michigan sends three freshmen,<br />\nBlue.<br />\nsides,<br />\nroom<br />\nthe<br />\nthe<br />\nwas<br />\ncleared<br />\nof<br />\nseveral<br />\nThat<br />\nof the university<br />\nfantry School, worked with the C.<br />\nand Illinois, California, Colorado,<br />\nThat the Hopkins team were<br />\nM. T. C. at Camp Meade and acted chairs. At intervals there were ta- \\Vest Virginia, Louisiana and buildings will receive new names masters of the<br />\nday was easily<br />\nas instructor in the Small Arms bles from which punch and cakes North Carolina are each reprein the near future is practically demonstrated since the Virginians<br />\nwere later served, and on the wall sented by two students. One man<br />\nSchool at Camp Perry, Ohio.<br />\ncertain, according to Douglas succeeded in scoring only three<br />\nThere have been changes in the above each table were placards of apiece conies from 13 other states<br />\nTurnbull, Jr., president of the first downs compared to 18 for the<br />\norganization of the unit. Require- the different branches of activities, —Tennessee, Florida, Rhode Islocal team. If the strength of a<br />\nments for a cadet commission are such as \"Athletics\" or \"Publica- land, Masachusetts, Missouri, Omicron Delta Kappa honorary team depends<br />\nupon capable submore strict and the number of Ca- tions,\" listing the names of the lead- Texas, Indiana, Alabama, New fraternity, which is earnestly stitutes<br />\nthe prospects for the seadet officers has been reduced. For- ers in each branch.<br />\nHampshire, Kentucky, Kansas, backing a move to abolish the too son are bright since Van Orman<br />\nThe students began to arrive Delaware and Washington. As common names now in use. The ran in<br />\nmerly, there were two majors, who<br />\ntwo different teams during<br />\ncommanded the unit. This year, about seven-thirty, and others kept four other states are already rep- 0. D. K. has taken up the matter the afternoon and scoring went<br />\non<br />\nhowever, the commanders of the drifting. in until by a quarter after resented in upper classes there are and hopes to be able to make a re- just the same.<br />\nunit are a Lieutenant Colonel and eight the hall was well filled. A few 18 states which have not at least one port soon. Representatives of the<br />\nWith the beginning of the seca Major. Thomas R. Gaither holds minutes later Bob Hopkins, the or more representatives in the \"un- society have<br />\ncarried the sugges- ond half the Blue Jays received<br />\nthe rank of Lieutenant Colonel and master of ceremonies. introduced<br />\nConthused on page 3, co1.1<br />\ntion to Dean Ames, who in turn and Taylor succeeded in carrying<br />\nGeorge B. Hess holds the rank of Dr. Charles K. Edmunds, the new<br />\nhas presented the plan to Presi- the ball back 30 yards before he<br />\nMajor. -The number of captains of Provost, who was the first speaker<br />\ndent Goodnow.<br />\nwas finally downed. A few minNOTICES<br />\ncompanies has also been reduced of the evening. In the absence of<br />\nIt is the suggestion of 0. D. K. utes later the Black and Blue<br />\nTrack Organization meeting,<br />\nDr. Goodnow, he welcomed the<br />\none-half.<br />\nto name the buildings after the blocked a punt on the Randolphtoday, C. E. 120. Bring<br />\n12.20<br />\nin<br />\nfreshmen, and explained to them<br />\nRifle Club to Organize<br />\nequipment.<br />\noriginal professors of the Johns Macon 25-yard line and Lawrence<br />\nThere is one activity of the R. part the nature of Johns Hopkins;<br />\nHopkins University. The name of carried the ball across for the<br />\nMeeting of candidates for the<br />\n0. T. C. in which all of the stu- later in his talk he drew. an interRemsen, the great Hopkins chem- fourth tally. Turnbull booted the<br />\nNews-Letter Editorial and Busidents at Johns Hopkins may par- esting comparison of the Hopkins<br />\nness Staffs, 12.30 today, in Newsist, has been suggested for the pigskin over the bar. Lawrence<br />\nticipate. The Rifle Club offers its of 1894, from which he had gradLetter office, second floor of<br />\nChemical Laboratory.<br />\nscored the final touchdown in this<br />\nBarn.<br />\nopportunities to all who wish to uated, and the present Hopkins to<br />\nquarter when he tallied after BickDouglas<br />\nTurnbull<br />\nis<br />\nquoted<br />\nas<br />\ntake advantage of them. Enroll- which he returned. Dr. Edmunds<br />\nMeeting of Rifle Club, 4.15 toford<br />\nsaying,<br />\n\"The<br />\nand Taylor had brought the<br />\ncollege<br />\natmosphere<br />\nday, in South Loft, Gilman Hall.<br />\nment began Wednesday, at room was followed in succession by<br />\nteam<br />\nreport<br />\nCandidates<br />\nfor<br />\nat<br />\nball<br />\nwould<br />\nhe<br />\ndown<br />\nthe field with steady<br />\nimproved,<br />\nand<br />\nthe<br />\nspirit<br />\n325. Gilman Hall. Experience is Douglas Turnbull, who explained<br />\nthis meeting.<br />\nplunges.<br />\nwould<br />\nbe<br />\nappreciably<br />\nDuring<br />\nthe last quarter<br />\nincreased by<br />\nnot necessary; any student who has the qualifications and honor of<br />\nHopkins<br />\nthis<br />\ndaily<br />\nreminder<br />\ntried<br />\nan<br />\nof<br />\nMeeting of Barnstormers Club<br />\naerial attack but<br />\nachievean interest in the club should en- membership in 0. D. K.; Karl Miltomorrow, 12.20, in Studio.<br />\nments of these great men, former it was not as good a deiiiInstraroll at once. There will he an or- ler, who defined the organization<br />\nHopkins professors. These names, tion as they had given<br />\nOrganization meeting of the<br />\nother<br />\nganization meeting of the Rifle of the Hopkins Y. M. C. A., and<br />\nentire Musical Clubs and candiperpetuated by the fine and lasting branches of the sport.<br />\nClub, Tuesday, October 7, in South Mr. Schall, who spoke on the misdates Thursday, 8 P. M., in Barn.<br />\nbuildings already in our posses- Hopkins<br />\nDirectors of Glee and Banjo Clubs<br />\nLoft, at 4:15 P. M. Lieutenant sion of the \"Y\" on the. campus.<br />\nRandolph-Macon<br />\nto be present.<br />\nsion,<br />\ncould not but prove a con- Oles<br />\nSherwood will coach the team.<br />\nAt this juncture, speech-making<br />\n.L.E.... Alexander<br />\n+<br />\nstant source of inspiration to the Magill(capt.) L<br />\nCandidates wanted for EdiThe uniform for this year will was suspended. The refreshments<br />\nT.<br />\nCarmine<br />\ntorial, Art and Business Boards<br />\nundergraduate, especially to the Milanausky<br />\nbe the same as that of last year, were served while the Blue Jay Six<br />\n...L.G..........<br />\nReport<br />\nto<br />\nBeal<br />\nof Black and Blue Jay.<br />\nimpressionable freshman.<br />\nBlue Jay office in Barn any day<br />\nwith the exception •of the head- played in its usual -fine style. The<br />\nDay<br />\nC. ...... . . Hales<br />\nat 12.20.<br />\nThe matter, which is now in the Slowik<br />\ndress. The unit will be equipped ice seemed to be thoroughly broken.;<br />\n....R.G....... Hughes<br />\nhands<br />\nof President Goodnow, is Biddison .<br />\nwith the Pershing cap. This head- freshmen and upperclassmen, in<br />\nStudent Council will meet<br />\n.R.T.... . Fraley<br />\nevery Friday at 12.20 in Room<br />\nexpected to be settled in a few Gilliece<br />\ndress is far better than any that many cases newly introduced. gathR E.... (capt.)Bell<br />\n109 M. E.<br />\ndays.<br />\nContinued on page<br />\nContinued on page 2, col. 4<br />\nContinued<br />\n<br />\nBLACK AND BLUE EASILY WINS<br />\nINITIAL ENCOUNTER AGAINST<br />\nRANDOLF -MACON, 32-0<br />\n<br />\n4, col. 5.<br />\n<br />\non page 4 col. 3<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1924<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the student of Johns<br />\nHopkins University.<br />\n<br />\nBusiness communications shQuld be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSItY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br />\n<br />\nTelephone<br />\n<br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALGER HISS, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br />\n<br />\nHomewood 100<br />\n<br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\nCirculation Manager<br />\nOTHO J. KFT.T.F.R, III, '26<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\n<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br />\n<br />\nDEBATING SCHEDULE WILL<br />\nBE BRILLIANT<br />\nAccording to Lawrence D. Willison, president of the Debating<br />\nCouncil, a highly interesting<br />\nschedule is being arranged for the<br />\nVarsity Debating Team. The Annual Triangular Debate with University of North Carolina and<br />\nWashington and Lee will be as in<br />\nprevious years the most important<br />\nevent of the debating season and<br />\nclosely approaching it in point of<br />\ninterest will be the dual meets<br />\nwith the University of Richmond<br />\nand the University of Virginia.<br />\nIt is hoped by those in charge<br />\nthat the University of Maryland<br />\nwill be on the schedule as the rivalry between State and the Blue<br />\nJays is always .strong. Last year<br />\nMaryland had no team but efforts<br />\nare being made to form one at<br />\nleast in time to meet the Hopkins<br />\ndebaters in a dual argument.<br />\nWillison is trying to excite<br />\nmore interest among the \"undergrads\" and hopes to increase attendance at the debates. Social<br />\nfeatures of this year's clashes will<br />\ninclude dancing with the Blue Jay<br />\nSix and the serving of refreshments.<br />\n<br />\nY. M. C. A. RECEPTION<br />\nContinued from page 1<br />\n<br />\nfor the whole program of Hopkins- THR<br />\nFIV<br />\nspeeches and Hopkins songs wa<br />\nered in groups around the room. designed to give the Freshmen their<br />\nMembers of the Glee Club who first real taste of the spirit of the derg<br />\nhay(<br />\nwere present gave several selections, University.<br />\nmon<br />\nmostly Hopkins songs, in which the<br />\nso<br />\n0<br />\nwhole room joined for the chorus.<br />\n1'3<br />\nFollowing this, addresses were<br />\nthe<br />\nmade by representatives of the leadthat<br />\ning student activities. John Partere,<br />\nsons spoke on the Athletic Assocliff(<br />\nDaman—<br />\nciation; \"Mike\" Tilghman on PubAl et<br />\n\"What was the matter<br />\nwith Professor Henry this<br />\nlications, and Nelson Young on the<br />\n118<br />\nmorning? I've never seen<br />\nhim so peeved. He seemed<br />\nMusical Clubs and Barnstormers.<br />\nre pr<br />\nto be boiling over.\"<br />\nYoung was without doubt the star<br />\nhay,<br />\nPy.thias—<br />\nof the evening. After the serious<br />\n\"Boiling over is good. He<br />\nUni<br />\nwas. Didn't you notice<br />\npart of his talk, his dramatic recihayi<br />\nwhy? The old boy had mislaid his Eldorado pencil.\"<br />\ntation of the \"Ballad of Yukon<br />\nthe<br />\nJake\" filled his hearers with such<br />\ntists<br />\nenthusiasm that their applause nearhas<br />\nly brought down the house.<br />\ncent<br />\nThe reception ended with a big<br />\npref<br />\n\"Me masterdrawine paled..<br />\nHullabaloo. It was a fitting close<br />\nwith<br />\n17 leads—all dealers<br />\n<br />\nDIXON'S<br />\n<br />\noRAD<br />\n<br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n(LBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br />\n<br />\nThc<br />\nflier<br />\nChu<br />\n<br />\nCht<br />\nenti<br />\n<br />\nUni<br />\n<br />\nGre<br />\nof<br />\n0th(<br />\nsem<br />\nthe<br />\nDRAPERIES pies<br />\nBre<br />\niii ci<br />\n<br />\nJOHN C. KNIPP & SONS<br />\nFURNITURE<br />\n<br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 7, 1924<br />\n<br />\nREGULATION NUMBER ONE<br />\nThe fact that all the leading institutions of higher learning perireshman regulations to exist affords strong presumption that<br />\nthey are regarded with favor and that their influence is for good<br />\nrather than for evil. Yet their value is. questioned by ninety-nine<br />\nper cent of the freshmen in every university. In brief, for the benefit of those doubting yearlings, freshman regulations develop discipline, teach college tradition, make necessary class organization,<br />\npromote college allegiance, arouse ambition, and afford opportunity<br />\nfor many instances of mutual helpfulness.<br />\nIt is obvious, even to freshmen, that all the regulations are not<br />\nintended for disciplinary purposes or humiliation of the first year<br />\nmen. Regulation Number One is the one which affords opportunity<br />\nfor mutual helpfulness. On the one hand the freshman, being required to participate in some activity, serves his Alma Mater, while<br />\nin \"learning the ropes\" he is aided and guided by experienced upperclassmen. This rule, intended to equip the \"frosh\" for his part in the<br />\nlife of Johns Hopkins, has done much to put Hopkins activities on<br />\na sound footing. Through its enforcement much hidden ability and<br />\ntalent is uncovered. No doubt interesting statistics might be compiled from facts gathered from present college leaders showing the<br />\nrise of the majority during their four years in college.<br />\nWhile participation in activities is recognized as advantageous,<br />\nit is likewise clearly seen that over indulgence is disadvantageous<br />\nand in some cases even harmful. It should be remembered at all<br />\ntimes that pursuit of knowledge is the real reason for coming to college and not to engage solely in activities. The News-Letter, therefore, in its paternal capacity, would advise the freshman in colloquial<br />\nterms \"not to bite off more than he can chew.\"<br />\nOPPORTUNITY<br />\nA former editor of the News-Letter, on turning over the quill<br />\nto his successor, was heard to remark: \"I would not substitute the<br />\nexperience gained through my work in college journalism fOr any<br />\nthree courses offered in the curriculum.\" A statement of this kind<br />\nis proof of the value of News-Letter work. College newspaper work<br />\nis undoubtedly the broadest in scope of any activity, for in reporting<br />\nnews one is brought into contact with faculty members, university<br />\nofficials; campus leaders, and the entire student body.<br />\nIn . )ecoming a candidate for the News-Letter, a freshman is<br />\noffered tie opportunity of getting acquainted with college life. Aside<br />\nfrom the feeling of service to Johns Hopkins, there is a material<br />\n:reward offered. The Varsity Seal, a miniature reproduction in gold<br />\nof the University seal, is given for faithful and consistent work in<br />\nnon-athletic activities. The Seal corresponds to the Varsity \"H.\"<br />\nCandidates will be welcomed in the News-Letter Office today at<br />\n12:30.<br />\nThe News-Letter regrets to announce the resignation of Harold S. Goodwin, '26, from the edi tonal staff.<br />\n<br />\nACIll<br />\n<br />\nAs a football player<br />\nhe's a good poet<br />\nE T'S admit that all men are not born for<br />\ngridiron honors, just as all men are not<br />\nborn poets.<br />\nYou can admire a man's grit for plugging<br />\naway at the thing that comes hardest to him.<br />\nHe does derive benefit in developing himself<br />\nwhere he is weakest. But to achieve real success<br />\nit is only common wisdom to pick out the line<br />\nfor which you have a natural aptitude—and go<br />\nto it.<br />\nParticularly if you are a freshman it may be<br />\nuseful to remind you of this principle, because<br />\nit can help you start off on the right foot in both<br />\nyour campus activities and your college courses.<br />\nIf your fingers love the feel of a pencil, why<br />\nnot obey that impulse and come out for the<br />\npublications? You can serve Alma Mater and<br />\nyourself better as a first-class editor than a thirdclass halfback.<br />\nSimilarly, when it comes to electing your college courses,you will be happier and more efficient if you choose in accordance with your<br />\nnatural aptitude.<br />\nThe world needs many types of men. Find<br />\nyour line, and your college course will be a preparation for a greater success.<br />\n<br />\nIA<br />\n<br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by what.<br />\never helps the<br />\nIndustry.<br />\ns.<br />\n<br />\nstern Electric Compasy<br />\nSince 1869 makers and distributors ofelectrical equipment<br />\n<br />\nAN<br />\n<br />\nNumber 41 of a series/\"<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7. 1924<br />\npkins• THREE<br />\n1,Va<br />\n<br />\nHUNDRED AND SEVENTYFIVE MEN IN FRESHMAN CLASS<br />\nContinued from page I<br />\n<br />\nBROWN ELECTED PRESIDENT OF COTILLON<br />\nCLUB<br />\n\"Eddie\" Brown, active in Cotillion Club circles during the last<br />\nscholastic year, was chosen president of the society at the regular<br />\nmeeting last week. He succeeds<br />\nW. Carville Gardner, under whose<br />\nleadership the club enjoyed one of<br />\nthe most succesful years in its history.<br />\n<br />\ntheir<br />\nf the dergrad\" schools and 14 of these<br />\nhave representatives in one or<br />\nmore of the graduate departments<br />\nSo only four are out of the fold.<br />\nFrom a totally different source,<br />\n, the Y. M. C. A., comes the news<br />\nthat the 653 men who have registered for Handbooks embrace 20<br />\ndifferent religions—there are -125<br />\nter<br />\nethodists, 119 Episcopalians and<br />\nthis<br />\nAt the same meeting John<br />\n118 Hebrews. Thirty-two per cent<br />\n,een<br />\nued<br />\nWebster<br />\nwas chosen 'secretaryrepresent denominations 'which<br />\ntreasurer.<br />\nThe new officers of the<br />\nhave ten or more members in the<br />\nclub<br />\nannounced<br />\nhave<br />\nthat the first<br />\nHe<br />\nUniversity. The Presbyterians<br />\ntiee<br />\nimportant<br />\ndance<br />\nseason will<br />\nthe<br />\nof<br />\nillShave 67 men, the Lutherans 59,<br />\nbe<br />\nSaturday<br />\nevening,<br />\nheld<br />\non<br />\nOcthe Roman Catholics 49, the Bapauditorium<br />\ntober<br />\n18,<br />\nthe<br />\nin<br />\nof<br />\nthe<br />\ntists 23 and the Reformed Church<br />\nEngineering<br />\nCivil<br />\nBuilding.<br />\nThis<br />\nhas 10. Of the remaining 11 per<br />\ncent 50 men express no church is the date of the Johns Hopkinspreference and five are Protestants University of Pittsburgh football<br />\nwithout any speCial preferences. clash, so an unusually large crowd<br />\nThere are 'five each registered as is expected. Music will be by the<br />\nmembers of the Congregational Blue Jay Six. Subscription for the<br />\naffair will be $1.<br />\nV 1 Church<br />\nand the Evangelical<br />\nThe date of the first cotillion<br />\nChurch. Four are Christian Sciwill<br />\nbe Friday, December 5, it was<br />\nentists and the same number are<br />\nUnited Brethren. There are three decided at the meeting. The dates<br />\nGreek Catholics- Ilia-M-6 members- of-the ,remaining-cotillions of the<br />\nof the Christian Temple. The year have not been officially .deOther religions, which are repre- termined, but probably will be at<br />\nsented by only one man apiece are the next meeting of the society.<br />\nthe Society of Friends, the DisciTea dances will be held in the<br />\nZ.IES Pies<br />\nof Christ, the Plymouth Civil Engineering Hall after each<br />\nBrethren, the Unitarian Church football game, the subscription beand the Mosaic Church.<br />\ning fifty cents a couple.<br />\n<br />\n3<br />\n<br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWELERS<br />\nLancaster, Pa.<br />\nClass Rings, Pins, Fraternity Pins<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"Makers of the Varsity Seals\"<br />\n<br />\nSlick headwork<br />\nGetting the right tailor, trailing<br />\nwith the right crowd, keeping<br />\nthe \"profs\" properly complaisant all come under this heading.<br />\nBut a tousled, untidy mane and<br />\ndandruff on your \"tuck\" collar<br />\nare always bad form.<br />\nGetting a bottle of \"Vaseline\" Hair<br />\nTonic and using it regularly keeps the<br />\nscalp healthy and makes stiff hair look<br />\nsilky. It prevents dandruff and puts on<br />\nthe finishing touch of slick headwork. At<br />\nall drug stores and student barber shops.<br />\n<br />\nSAlARTLY dressed men in the<br />\nstyle centers of the world know<br />\nthere is no substitute for a Stetson.<br />\n<br />\nEvery •'Vaseline\"Product is recommended everywhere because of its<br />\nabsolute purity and effectiveteess.<br />\n<br />\naseithe<br />\nREG.U.S. PAT.OFF.<br />\n<br />\nHAIR TONIC<br />\n<br />\nSTETSON HATS<br />\nStyled for young men<br />\n<br />\nFor the Health and<br />\nAppearance of the Hair<br />\n<br />\nChesebrough mfg. Company (Cons'd)<br />\nState Street<br />\nNew York<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\nXPrt:Corner C-- ayelle<br />\n<br />\nand nztaw Sts.<br />\n<br />\n-Where Wholesale and Retail Districts Meet-<br />\n<br />\natE1.7==11121211=1<br />\n<br />\n!WHOMHE<br />\n<br />\nPayne &Merrill<br />\n<br />\nMemory Tonic<br />\n<br />\n°THE WONDER MOTOR FULE<br />\n<br />\nCLOTHIERS<br />\nHABERDASHERS<br />\nSHERWOOD BROTHERS, INC.<br />\n<br />\n315 Charles St. North<br />\nwgztgiggigNmcgataugunumgaltogamagi<br />\n<br />\nCollege men and women now<br />\nkeep their hair fashionably smooth<br />\nT.TER smooth, lustrous hair, done<br />\nwith fashionable plainness in<br />\nlines that follow closely the shape of<br />\nthe head . • •<br />\n•<br />\nHis well-kept hair,always in place,<br />\nalways trim, neatly parted, naturallooking . • • •<br />\nStacomb is responsible for this<br />\nnew trimness, never before possible.<br />\nIt keeps your hair looking at all<br />\n<br />\ntimes just the way you want it to<br />\nlook. Non-staining and non-greasy.<br />\nIn jars and tubes. At all drug and<br />\ndepartment stores.<br />\n<br />\nIt is surprising how the ever-readiness of Eversharp prompts the<br />\njotting down of passing thoughts<br />\nand facts—and how quickly the<br />\nhabit of writing it down\"improves<br />\nthe ability for accurate remembrance.<br />\nSix new features make Eversharp<br />\nfiner<br />\na<br />\nwriting instrument than<br />\nbefore—non-clogging rifled tip,<br />\nquick reloading, complete interchangeability of parts, are the most<br />\nimportant.<br />\nPut a new Eversharp in your<br />\npocket. And for complete preparedness, match it with a Wahl Pen.<br />\nPrices $1 to $45, at all dealers.<br />\nMade in the U. S. A. by<br />\nTHE WAHI. COMPANY, Chicago<br />\nCanadian Factory, THE<br />\n<br />\nWAHL COMPANY,Ltd.,Toronto<br />\n<br />\nManufaCturers of the Wahl Eversharp and the Wahl<br />\nAll-Metal Fountain Pen<br />\n<br />\nKEEPS THE HAIR IN PLACE<br />\n<br />\nDept.<br />\nLaboratories, Inc.,York City<br />\nStreet,New<br />\ngenerous<br />\nStandard<br />\ncharge, a<br />\n18th<br />\nWest<br />\nof<br />\n113<br />\nfree<br />\nrae,<br />\nStacomb.<br />\nPlease send<br />\nsarnple tube of<br />\n<br />\nThe New PERFECTED<br />\nAu '17filiZ511ARP<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1924<br />\n<br />\n4<br />\n<br />\nBLACK AND BLUE WINS INITIAL after touchdown—Turnbull (2)<br />\nENCOUNTER<br />\n(placement and drop-kick). RefContinued from page 1<br />\n<br />\nNEWS-LETTER'S PRESIDENTIAL BALLOT<br />\n<br />\neree—George Hoban. Umpire—<br />\nO.B..... Anderson Sigmund. Head<br />\nLinesman—ShaL.FI........ Marks let. Time of quarters-15 minutes.<br />\nR.H . . Crouse<br />\nFOR THE STUDENTS<br />\nRiggan<br />\nF.B.<br />\nBring<br />\nThis to the Address Below<br />\n6 13 13 0-32<br />\nHopkins<br />\nWhen You Want Anything in the<br />\nRandolph-3facon..0 0 0 0— 0<br />\nDRUG LINE<br />\nSubstitutions—Johns Hopkins:<br />\nMallonee for Gilliece, Leipensper- R. G.Loy & Company<br />\n(Robert G. Loy)<br />\no-er for Biddison. Grinsfelder for<br />\nPHARMACISTS<br />\nLawrence, Bickford for Blandi;<br />\nUNIVERSITY PARKWAY<br />\nGilliece for Mallonee, Lawrence<br />\nAt Charles St.<br />\nmeeting.<br />\nfor Grinsfelder, Levy for Day,<br />\nAt this time, President Niner Van Horn for Taylor, Duckett<br />\nappointed a pep committee consist- for Magill, Conant for Milanau- BRANCH<br />\nAT THE BARN<br />\ning of Day, chairman, O'Dunne, sky, Kaufman for Slowik, SauerBoyce, Hi;:ies, Gassaway, Gibson, vein for Lawrence, Schacht for<br />\nTodd, Phillips, Swanson, Ward- Oles. Randolph-Macon: Snapp<br />\nwell and Grinsfelder.<br />\nfor Carmine, Thompson for Riggan, Osborne for Hughes, Martin<br />\nrTt<br />\nfor<br />\nFraley, Golden for Marks,<br />\nNOTICE<br />\nDorsey for Alexander, Scott for<br />\nJunior Class meeting today at Osborne. Touchdowns — Blandi<br />\n12.20. 120 C. E. Hall.<br />\n(2), Lawrence (2), Taylor. Points DOUG TURNBULL<br />\nTaylor<br />\nLawrence<br />\nTurnbull .<br />\nBlandi .<br />\n<br />\n(Mark X Beside Name of Choice)<br />\nDAVIS<br />\nCOOLIDGE<br />\nLaFOLLETTE<br />\nAny Other (Specify)<br />\n(Signed)<br />\n<br />\nRED PREDOMINATES IN THE<br />\nFIRST SOPH-FROSH<br />\nSCRAP<br />\nRed! Red was the color predominating. No doubt about it. The<br />\nFrosh and Sophs both saw red,<br />\nthere was a plentiful besprinkling<br />\nof the red life fluid, proceeding<br />\nfrom the olfactory organs of<br />\nnumerous combatants, and topping<br />\nthe whole proceeding was the fiery<br />\nred head of one of the most pugnacious Freshmen that ever trod<br />\nthe paths of Homewood.<br />\nThis particular chap would persist in walking on the sacred lawns,<br />\nin spite of President Goodnow's<br />\n-straight line admonition,\" in spite<br />\nof certain well-known regulations,<br />\nand in spite of the objections of<br />\ncertain gentlemen known generically as the \"wise fools.\" And when<br />\nhe walked forward, his Freshmen<br />\ncompatriots saw red, both figuratively and literally, stepped in where<br />\nangels feared to tread (no insinuations meant), and were soundly<br />\npaddled for their pains by the aforementioned -wise-fool- Sophs.<br />\nIt was a great battle while it lasted. Rolling, scratching, yelling<br />\nmasses of humanity fought hard<br />\nand loyally for the honor of their<br />\nrespective classes. Standing on the<br />\n:fide-lines, Juniors, but a space removed from such squabbles, cheered<br />\nfor the Freshmen, urged the battles on, and laughed long and heartily; they knew that their own fighting days were o'er, hence no forebodings prevented their mirth from.<br />\nreaching its highest pitch. Seniors<br />\nyawned lazily, or smiled cynically,<br />\nin order to maintain their legened<br />\ndignity, although in reality they enjoyed the battle as much as any one<br />\nelse. Even certain dignified professors, long known for their unperturable tranquillity in the face<br />\nof all student pranks, were seen gingerly poking their heads forth from<br />\noffice windows, and as quickly withdrawing them. Their reputation<br />\nhad to be maintained. Yes, this<br />\nwas a real fight.<br />\nThe Frosh seemed to have the<br />\nedge. Out numbering the Sophs<br />\nalmost two to one, they showed<br />\ntheir valor in true Hopkins fashion.<br />\nBesides, did they not have the redheaded leader to make them see red;<br />\ndid not their respective countenances show red with blood, and<br />\nwasn't that tingling sensation induced by paddles a most reddening<br />\nmatter? The Sophs were up against<br />\ntoo much red, in this the first battle of the year. They tried to believe that it was green. green Frosh,<br />\nbut they either were color-blind, or<br />\ndetermined to avoid facts. There<br />\nwas too much red for the Sophs.<br />\n<br />\nSOPHS MAKE NOMINATIONS<br />\nFOR STUDENT COUNCIL<br />\nNominations for student council<br />\nrepresentative were made by the<br />\nsophomore class at its first meeting of the year. on Tuesday, September 30. Those named were<br />\nMeredith, Cleaveland, Harwood,<br />\nFrantz, Niner, and Passano. The<br />\nelection will be held at the next<br />\n<br />\nR. 0. T. C. LEADS<br />\nContinued from page 1<br />\n<br />\nthe unit has thus far used, according to Lieutenant Sherwood, wh( VOl<br />\nis in charge.<br />\nIn addition to the change in head CL,<br />\ndress, is a change in the design of N(<br />\nthe cap device, which has not bec<br />\ndefinitely determined. A later edi Fres<br />\nr<br />\ntion of the NEWS-LETTER will a<br />\nnounce a student competition for<br />\nc<br />\nnew design for the cap device. Th(<br />\nwinner of this competition will ix<br />\nate5<br />\nceive ten dollars in gold.<br />\n•<br />\n— les<br />\ntior<br />\n<br />\nclas<br />\nflex<br />\n<br />\n• Fro<br />\n<br />\n4=6•F<br />\n<br />\nCloiftes<br />\nCustom<br />\n14. N.ovaries<br />\n<br />\nRepresentatives<br />\n<br />\nAy<br />\nreet<br />\n<br />\nTOM MAGILL,<br />\nManages<br />\n<br />\nOct<br />\nme(<br />\ncall<br />\nof<br />\n<br />\nDa,<br />\n<br />\nCot<br />\n'noi<br />\nsub<br />\ngill<br />\n_<br />\noff(<br />\nwot<br />\nCot<br />\nF<br />\nbro<br />\n'.ini<br />\n<br />\n11<br />\n<br />\nt V$11<br />\n,<br />\n\"=:=1<br />\n<br />\nishi.411,,0<br />\n<br />\nwas<br />\nGri<br />\nin t<br />\nabil<br />\n<br />\n,<br />\n<br />\ntO<br />\nloll<br />\n<br />\nCui<br />\n<br />\n1 11101<br />\n<br />\nSailing West to India<br />\n€53INCE the days of Christopher Columbus men have felt<br />\nthe call to ((sail due west to find<br />\nIndia.\" In an organization like<br />\nWestinghouse, such pioneering<br />\nspirits find happy haven as research engineers. Their every<br />\nthought is a question—every<br />\nenergy bent to discover new<br />\nand more effective answers to<br />\nbaffling problems.<br />\nImmediately Westinghouse<br />\nbegan to build alternating current machines of high voltages,<br />\nfor example, the problem of<br />\ninsulation became acute. For<br />\nthirty-five years high voltages<br />\nand insulation have formed an<br />\nendless chain of problems. As<br />\nvoltages have been increased,<br />\nimproved insulation has been<br />\ndemanded. As insulation has<br />\n<br />\nbeen bettered, voltages have<br />\nbeen still further increased.<br />\nOne striking contribution of<br />\nWestinghouse research engineers has been the perfection<br />\nof an entirely new insulation<br />\nmaterial— Micarta. Possessing<br />\nmany of the qualities of metal,<br />\npaper,fiber, mica,gum,rubber,<br />\nMicarta differs in radical respect from all of these.<br />\nIt serves industry indirectly<br />\nas improved insulation material, and also directly because<br />\nof superiorities when used for<br />\ngears, propeller blades, and<br />\nthe like.<br />\nOnly the imagination can<br />\nset a limit on the field for the<br />\nresearch engineer—or for an<br />\norganization that centers<br />\naround him.<br />\n<br />\nWh4<br />\n<br />\nlast<br />\n<br />\ntirg<br />\n<br />\nat<br />\ncall<br />\nbly<br />\nele(<br />\n<br />\nCla<br />\nilig<br />\n<br />\nC.<br />\n<br />\n13<br />\n:iot<br />\n,pr<br />\nCol<br />\noth<br />\n.111r<br />\n<br />\nFR<br />\n<br />\nlast<br />\nfinc<br />\nwh(<br />\nTw<br />\nmal<br />\nthe:<br />\nmei<br />\nper<br />\ntest<br />\n<br />\nJoe<br />\nkin1<br />\nhig<br />\nlish<br />\ntjç<br />\n<br />\n('St<br />\n11.(1<br />\n<br />\nvv;1,<br />\n<br />\nACHIEVEMENT<br />\n<br />\nOPPORTUNITY<br />\n<br />\n(111(<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXIX, No 2<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 7, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\ni HOPKINS R. O. T. C. LEADS STUDENTS ASKED TO<br />\nTHREE HUNDRED AND SEVEAST IN THEORETICAL<br />\n\"VOTE\" FOR PRESIDENT ENTY-FIVE MEN ENROLL<br />\nIN FRESHMAN CLASS<br />\nTRAINING<br />\nWith the presidential election less<br />\nLocal Unit is on Distinguished Service than a month away, the NEWS- All States But Four, and Ten Foreign<br />\nList for 1924-25<br />\nLETTER iS giving all students, Lands Represented. Russia With<br />\nLawrence And Blandi, Freshmen, Play Brilliant Game For Hopkins;<br />\nSix Men Leads Foreigners<br />\nAccording to Lieutenant Colonel whether of voting age or not, and<br />\nBlandi Injured; Van Orman Uses Two Teams Against Visitors<br />\nAccording to figures which<br />\nWalter C. Short, senior member of professors, an opportunity to exJohns Hopkins came through as<br />\nthe Board of Inspection sent out by press their choice for the Presi- were given out last week by the NINETY-FIVE CARS PARKED<br />\nwas<br />\nexpected Saturday at Homethe government to recommend R. dency. Because of the fact that the Office of the Registrar, there are<br />\nON CAMPUS AS<br />\nwood<br />\nField and easily trounced<br />\n0. T. C., units for the Distin- majority of undergraduates are not<br />\nAVERAGE<br />\n375 new men enrolled in the unthe<br />\nRandolph<br />\n-Macon eleven from<br />\nguished Service List, the Johns of voting age, the NEWS-LETTER'S<br />\ndergraduate schools this year. Of<br />\nthe<br />\nOld<br />\nDominion,<br />\nby the score of<br />\nFive States Represented. Fords Lead,<br />\nHopkins Reserve Officers Training straw ballot has little immediate<br />\nWith Twenty-one Other Makes<br />\n32-0.<br />\nnumber<br />\nthis<br />\n216<br />\nThe<br />\nenrolled<br />\nin<br />\nare<br />\ngame<br />\nwas an excelCorps has the highest standard of significance. But the attitude of the<br />\nRepresented<br />\nlent<br />\nexperience<br />\nfor<br />\nthe<br />\nBlack and<br />\nCollege<br />\nthe<br />\nof<br />\nArts and Sciences,<br />\ntheoretical training of any R. 0. college student in the coming elecOn one day last week Johns Hop- Blue as it enabled Coach Van OrTC. unit from Maine to Florida. tion has sufficient interest for its which is an increase of 104 over<br />\nkins professors and students rode man to test the skill of 21 of his<br />\nConsequently, the Hopkins Unit is own sake to make the balloting last year's 112 academic students;<br />\nto<br />\nthe University in ninety-five au- pigskin chasers and likewise to<br />\non the Distinguished Service List worth while.<br />\n131 men registered in the School<br />\ntry out many forms of attack and<br />\nfor 1924-25.<br />\nThe ballots are printed at the top of Engineering, an increase of 55 tomobiles, including twenty-two difdefense.<br />\nMajor Horsington, head of the of page four of this issue of the over last year's entering class. ferent makes, and representing five<br />\nThe Blue Jays with six new<br />\nHopkins Unit, says that this NEWS-LETTER. Mark and sign the The remaining 28 freshmen are in states. These statistics were semen<br />\nin the line-up were a little<br />\nachievement of the R. 0. T. C. ballots, and deposit them before the School of Business Economics<br />\ncured Friday by a census of all ma- slow in registering but before<br />\nthe<br />\ndraws men into its ranks. He an- 1 P. M., Thursday, in a box that which shows an increase of seven<br />\nchines parked on the campus at first quarter was ended they had<br />\nflounces the enrollment to be three will be placed in the basement of over the enrollment of the entercrossed the Virginians' goal line.<br />\n11 A. M.<br />\nhundred and eighty-two. This num- Gilman Hall for the purpose. Only ing class of 1923-24.<br />\nher, which is the largest i,n the his- signed ballots will be counted.<br />\n- Henry Ford's versatile \"flii4er Blandi, a freshman, carrying the<br />\nTwo hundred and sixty-two of<br />\ntory of the unit, is subject to<br />\nThe results will be made known the new men are from Baltimore leads the field with thirty-one rep- ball. The backfield working together for the first time, ran<br />\nchange because more menare en- as soon as the ballots are counted.<br />\nTwelve Chevrolets<br />\ncity and the counties of Maryland, resentatives.<br />\nsmoothly.<br />\nBefore the half had<br />\nrolling every day. It is made up<br />\neach of which is well represented. gave that make second place, and ended<br />\nHopkins had added 13<br />\nas follows: thirty-eight seniors, COLLEGE SPIRIT PREVAILS<br />\nSixteen of the freshmen are from the Buick ran third with nine. The more<br />\nAT ANNUAL Y. M. C. A.<br />\npoints to their total. The<br />\nthirty-six juniors, one hundred and<br />\nforeign<br />\nlands, Russia leading with Dodge was a close fourth with score<br />\nRECEPTION<br />\nat the end of the first period<br />\nfifteen sophomores and one hunsix and China being second with<br />\nwas Hopkins, 19; Randolph-Maeight.<br />\ndred and ninety-five freshmen. The Hopkins Activities Presented In Talks<br />\ntwo. There is one man each from<br />\nBy Undergraduate Leaders Of<br />\nJunior engineers are credited with<br />\nThere were also five Essexs, five con, 0.<br />\nCampus Activities<br />\nCanada, Egypt, Germany, Italy,<br />\na hundred per cent enrollment.<br />\nThe Black and Blue had gained<br />\nPoland,<br />\nRumania, Panama and the nupmobiles, four Overlands, three most of their ground<br />\ngood-fellowship<br />\nof<br />\nspirit<br />\nA<br />\nCaptain Scobey Welcomed<br />\nby continual<br />\nMarmons. two each of Packards,<br />\nThe faculty has lost one of its marked the Y. M. C. A. Freshman Philippines, making a representaline plunges. The keenness with<br />\nStutzes, Studebakers and Oaklands,<br />\nmembers in Captain Paul, who has Reception, held last Friday night tion from ten foreign climes.<br />\nand<br />\none Franklin. Durant, Hudson, which the Hopkins gridders<br />\nbeen called to service in Hawaii. in the C. E. Hall. About one hunThe other 97 men are divided<br />\nLincoln, Cadillac, Jordan, Chrys- watched the pigskin made life unCaptain W. P. Scobey, the new dred freshmen and an equal num- among 26 states and the District<br />\nler, H. C. S., Standard and Chal- happy for the Virginians, and<br />\nmember of the faculty, who has ber of upperclassmen were present. of Columbia, which has seven repplaced the Homewood team in<br />\nmers.<br />\ntaken the position of Captain Paul, The sophomore for a time laving resentatives. The greatest numpossession<br />\nof the ball most of the<br />\nMaryland, of course, had the<br />\nis a Vanderbilt College man. He aside the traditional feud, joined ber of \"outsiders\" are 21 New<br />\ntime.<br />\nBlue<br />\nJay forwards could<br />\ngreatest number of automobile lihasbn i<br />\nnot be held back by the opposiService since 1916 with Juniors and Seniors in greet- Yorkers and the next greatest con- cense plates, with a total of<br />\nninety.<br />\nand during that time has served on ing the new class.<br />\n- tribution to the class of Twentytion with the result that during<br />\nMichigan<br />\nhad<br />\ntwo<br />\nrepresentatives,<br />\n11' ,lexican border, with the Sec- Each person who entered the hall eight is Pennsylvania's 17. Virthe entire game Randolph-Macon<br />\nond Division in the Army of Oc- was given a tag—upperclassmen, ginia follows with nine men and and Virginia and Pennsylvania had succeeded in booting the ball only<br />\nwhite—upon seven hail from New Jersey. one each.<br />\ncupe;nn in Germany, and three green; freshmen,<br />\ntwice, the rest of the times the<br />\nye— in Hawaii. Captain Scobey which he wrote ,his name, in order There are four Georgians and an<br />\nkicks were smothered and the pighas been especially active this past to make formal introductions un- equal number came from Ohio. RENAMING OF BUILDINGS<br />\nskin recovered by the Black and<br />\nCONSIDERED<br />\nyear. He graduated from the In- necessary. Except for a line around Michigan sends three freshmen,<br />\nBlue.<br />\nsides,<br />\nroom<br />\nthe<br />\nthe<br />\nwas<br />\ncleared<br />\nof<br />\nseveral<br />\nThat<br />\nof the university<br />\nfantry School, worked with the C.<br />\nand Illinois, California, Colorado,<br />\nThat the Hopkins team were<br />\nM. T. C. at Camp Meade and acted chairs. At intervals there were ta- \\Vest Virginia, Louisiana and buildings will receive new names masters of the<br />\nday was easily<br />\nas instructor in the Small Arms bles from which punch and cakes North Carolina are each reprein the near future is practically demonstrated since the Virginians<br />\nwere later served, and on the wall sented by two students. One man<br />\nSchool at Camp Perry, Ohio.<br />\ncertain, according to Douglas succeeded in scoring only three<br />\nThere have been changes in the above each table were placards of apiece conies from 13 other states<br />\nTurnbull, Jr., president of the first downs compared to 18 for the<br />\norganization of the unit. Require- the different branches of activities, —Tennessee, Florida, Rhode Islocal team. If the strength of a<br />\nments for a cadet commission are such as \"Athletics\" or \"Publica- land, Masachusetts, Missouri, Omicron Delta Kappa honorary team depends<br />\nupon capable submore strict and the number of Ca- tions,\" listing the names of the lead- Texas, Indiana, Alabama, New fraternity, which is earnestly stitutes<br />\nthe prospects for the seadet officers has been reduced. For- ers in each branch.<br />\nHampshire, Kentucky, Kansas, backing a move to abolish the too son are bright since Van Orman<br />\nThe students began to arrive Delaware and Washington. As common names now in use. The ran in<br />\nmerly, there were two majors, who<br />\ntwo different teams during<br />\ncommanded the unit. This year, about seven-thirty, and others kept four other states are already rep- 0. D. K. has taken up the matter the afternoon and scoring went<br />\non<br />\nhowever, the commanders of the drifting. in until by a quarter after resented in upper classes there are and hopes to be able to make a re- just the same.<br />\nunit are a Lieutenant Colonel and eight the hall was well filled. A few 18 states which have not at least one port soon. Representatives of the<br />\nWith the beginning of the seca Major. Thomas R. Gaither holds minutes later Bob Hopkins, the or more representatives in the \"un- society have<br />\ncarried the sugges- ond half the Blue Jays received<br />\nthe rank of Lieutenant Colonel and master of ceremonies. introduced<br />\nConthused on page 3, co1.1<br />\ntion to Dean Ames, who in turn and Taylor succeeded in carrying<br />\nGeorge B. Hess holds the rank of Dr. Charles K. Edmunds, the new<br />\nhas presented the plan to Presi- the ball back 30 yards before he<br />\nMajor. -The number of captains of Provost, who was the first speaker<br />\ndent Goodnow.<br />\nwas finally downed. A few minNOTICES<br />\ncompanies has also been reduced of the evening. In the absence of<br />\nIt is the suggestion of 0. D. K. utes later the Black and Blue<br />\nTrack Organization meeting,<br />\nDr. Goodnow, he welcomed the<br />\none-half.<br />\nto name the buildings after the blocked a punt on the Randolphtoday, C. E. 120. Bring<br />\n12.20<br />\nin<br />\nfreshmen, and explained to them<br />\nRifle Club to Organize<br />\nequipment.<br />\noriginal professors of the Johns Macon 25-yard line and Lawrence<br />\nThere is one activity of the R. part the nature of Johns Hopkins;<br />\nHopkins University. The name of carried the ball across for the<br />\nMeeting of candidates for the<br />\n0. T. C. in which all of the stu- later in his talk he drew. an interRemsen, the great Hopkins chem- fourth tally. Turnbull booted the<br />\nNews-Letter Editorial and Busidents at Johns Hopkins may par- esting comparison of the Hopkins<br />\nness Staffs, 12.30 today, in Newsist, has been suggested for the pigskin over the bar. Lawrence<br />\nticipate. The Rifle Club offers its of 1894, from which he had gradLetter office, second floor of<br />\nChemical Laboratory.<br />\nscored the final touchdown in this<br />\nBarn.<br />\nopportunities to all who wish to uated, and the present Hopkins to<br />\nquarter when he tallied after BickDouglas<br />\nTurnbull<br />\nis<br />\nquoted<br />\nas<br />\ntake advantage of them. Enroll- which he returned. Dr. Edmunds<br />\nMeeting of Rifle Club, 4.15 toford<br />\nsaying,<br />\n\"The<br />\nand Taylor had brought the<br />\ncollege<br />\natmosphere<br />\nday, in South Loft, Gilman Hall.<br />\nment began Wednesday, at room was followed in succession by<br />\nteam<br />\nreport<br />\nCandidates<br />\nfor<br />\nat<br />\nball<br />\nwould<br />\nhe<br />\ndown<br />\nthe field with steady<br />\nimproved,<br />\nand<br />\nthe<br />\nspirit<br />\n325. Gilman Hall. Experience is Douglas Turnbull, who explained<br />\nthis meeting.<br />\nplunges.<br />\nwould<br />\nbe<br />\nappreciably<br />\nDuring<br />\nthe last quarter<br />\nincreased by<br />\nnot necessary; any student who has the qualifications and honor of<br />\nHopkins<br />\nthis<br />\ndaily<br />\nreminder<br />\ntried<br />\nan<br />\nof<br />\nMeeting of Barnstormers Club<br />\naerial attack but<br />\nachievean interest in the club should en- membership in 0. D. K.; Karl Miltomorrow, 12.20, in Studio.<br />\nments of these great men, former it was not as good a deiiiInstraroll at once. There will he an or- ler, who defined the organization<br />\nHopkins professors. These names, tion as they had given<br />\nOrganization meeting of the<br />\nother<br />\nganization meeting of the Rifle of the Hopkins Y. M. C. A., and<br />\nentire Musical Clubs and candiperpetuated by the fine and lasting branches of the sport.<br />\nClub, Tuesday, October 7, in South Mr. Schall, who spoke on the misdates Thursday, 8 P. M., in Barn.<br />\nbuildings already in our posses- Hopkins<br />\nDirectors of Glee and Banjo Clubs<br />\nLoft, at 4:15 P. M. Lieutenant sion of the \"Y\" on the. campus.<br />\nRandolph-Macon<br />\nto be present.<br />\nsion,<br />\ncould not but prove a con- Oles<br />\nSherwood will coach the team.<br />\nAt this juncture, speech-making<br />\n.L.E.... Alexander<br />\n+<br />\nstant source of inspiration to the Magill(capt.) L<br />\nCandidates wanted for EdiThe uniform for this year will was suspended. The refreshments<br />\nT.<br />\nCarmine<br />\ntorial, Art and Business Boards<br />\nundergraduate, especially to the Milanausky<br />\nbe the same as that of last year, were served while the Blue Jay Six<br />\n...L.G..........<br />\nReport<br />\nto<br />\nBeal<br />\nof Black and Blue Jay.<br />\nimpressionable freshman.<br />\nBlue Jay office in Barn any day<br />\nwith the exception •of the head- played in its usual -fine style. The<br />\nDay<br />\nC. ...... . . Hales<br />\nat 12.20.<br />\nThe matter, which is now in the Slowik<br />\ndress. The unit will be equipped ice seemed to be thoroughly broken.;<br />\n....R.G....... Hughes<br />\nhands<br />\nof President Goodnow, is Biddison .<br />\nwith the Pershing cap. This head- freshmen and upperclassmen, in<br />\nStudent Council will meet<br />\n.R.T.... . Fraley<br />\nevery Friday at 12.20 in Room<br />\nexpected to be settled in a few Gilliece<br />\ndress is far better than any that many cases newly introduced. gathR E.... (capt.)Bell<br />\n109 M. E.<br />\ndays.<br />\nContinued on page<br />\nContinued on page 2, col. 4<br />\nContinued<br /><br />\nBLACK AND BLUE EASILY WINS<br />\nINITIAL ENCOUNTER AGAINST<br />\nRANDOLF -MACON, 32-0<br /><br />\n4, col. 5.<br /><br />\non page 4 col. 3<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1924<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\nPublished semi-weekly from October to June by the student of Johns<br />\nHopkins University.<br /><br />\nBusiness communications shQuld be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSItY; all articles and other communications<br />\nshould be sent to the MANAGING EDITOR.<br /><br />\nTelephone<br /><br />\nEditor-in-Chief<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nManaging Editor<br />\nALGER HISS, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nJOHN W. PARSONS, '25<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REESE, '27<br />\nW. BARNES HALL, '27<br /><br />\nHomewood 100<br /><br />\nBusiness Manager<br />\nPHILIP W. HOWARD, '25<br />\nAdvertising Manager<br />\nALFRED J. McKAY, '26<br />\nCirculation Manager<br />\nOTHO J. KFT.T.F.R, III, '26<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br /><br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, '27<br /><br />\nDEBATING SCHEDULE WILL<br />\nBE BRILLIANT<br />\nAccording to Lawrence D. Willison, president of the Debating<br />\nCouncil, a highly interesting<br />\nschedule is being arranged for the<br />\nVarsity Debating Team. The Annual Triangular Debate with University of North Carolina and<br />\nWashington and Lee will be as in<br />\nprevious years the most important<br />\nevent of the debating season and<br />\nclosely approaching it in point of<br />\ninterest will be the dual meets<br />\nwith the University of Richmond<br />\nand the University of Virginia.<br />\nIt is hoped by those in charge<br />\nthat the University of Maryland<br />\nwill be on the schedule as the rivalry between State and the Blue<br />\nJays is always .strong. Last year<br />\nMaryland had no team but efforts<br />\nare being made to form one at<br />\nleast in time to meet the Hopkins<br />\ndebaters in a dual argument.<br />\nWillison is trying to excite<br />\nmore interest among the \"undergrads\" and hopes to increase attendance at the debates. Social<br />\nfeatures of this year's clashes will<br />\ninclude dancing with the Blue Jay<br />\nSix and the serving of refreshments.<br /><br />\nY. M. C. A. RECEPTION<br />\nContinued from page 1<br /><br />\nfor the whole program of Hopkins- THR<br />\nFIV<br />\nspeeches and Hopkins songs wa<br />\nered in groups around the room. designed to give the Freshmen their<br />\nMembers of the Glee Club who first real taste of the spirit of the derg<br />\nhay(<br />\nwere present gave several selections, University.<br />\nmon<br />\nmostly Hopkins songs, in which the<br />\nso<br />\n0<br />\nwhole room joined for the chorus.<br />\n1'3<br />\nFollowing this, addresses were<br />\nthe<br />\nmade by representatives of the leadthat<br />\ning student activities. John Partere,<br />\nsons spoke on the Athletic Assocliff(<br />\nDaman—<br />\nciation; \"Mike\" Tilghman on PubAl et<br />\n\"What was the matter<br />\nwith Professor Henry this<br />\nlications, and Nelson Young on the<br />\n118<br />\nmorning? I've never seen<br />\nhim so peeved. He seemed<br />\nMusical Clubs and Barnstormers.<br />\nre pr<br />\nto be boiling over.\"<br />\nYoung was without doubt the star<br />\nhay,<br />\nPy.thias—<br />\nof the evening. After the serious<br />\n\"Boiling over is good. He<br />\nUni<br />\nwas. Didn't you notice<br />\npart of his talk, his dramatic recihayi<br />\nwhy? The old boy had mislaid his Eldorado pencil.\"<br />\ntation of the \"Ballad of Yukon<br />\nthe<br />\nJake\" filled his hearers with such<br />\ntists<br />\nenthusiasm that their applause nearhas<br />\nly brought down the house.<br />\ncent<br />\nThe reception ended with a big<br />\npref<br />\n\"Me masterdrawine paled..<br />\nHullabaloo. It was a fitting close<br />\nwith<br />\n17 leads—all dealers<br /><br />\nDIXON'S<br /><br />\noRAD<br /><br />\nFURNITURE OF QUALITY<br />\nand individuality is offered here at prices that are not<br />\nand cannot be underquoted by any house at any time.<br />\n(LBesides the reputation of an old-established firm<br />\nis back of each sale with a guarantee.<br /><br />\nThc<br />\nflier<br />\nChu<br /><br />\nCht<br />\nenti<br /><br />\nUni<br /><br />\nGre<br />\nof<br />\n0th(<br />\nsem<br />\nthe<br />\nDRAPERIES pies<br />\nBre<br />\niii ci<br /><br />\nJOHN C. KNIPP &amp; SONS<br />\nFURNITURE<br /><br />\nDECORATIONS<br />\n343 NORTH CHARLES STREET<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 7, 1924<br /><br />\nREGULATION NUMBER ONE<br />\nThe fact that all the leading institutions of higher learning perireshman regulations to exist affords strong presumption that<br />\nthey are regarded with favor and that their influence is for good<br />\nrather than for evil. Yet their value is. questioned by ninety-nine<br />\nper cent of the freshmen in every university. In brief, for the benefit of those doubting yearlings, freshman regulations develop discipline, teach college tradition, make necessary class organization,<br />\npromote college allegiance, arouse ambition, and afford opportunity<br />\nfor many instances of mutual helpfulness.<br />\nIt is obvious, even to freshmen, that all the regulations are not<br />\nintended for disciplinary purposes or humiliation of the first year<br />\nmen. Regulation Number One is the one which affords opportunity<br />\nfor mutual helpfulness. On the one hand the freshman, being required to participate in some activity, serves his Alma Mater, while<br />\nin \"learning the ropes\" he is aided and guided by experienced upperclassmen. This rule, intended to equip the \"frosh\" for his part in the<br />\nlife of Johns Hopkins, has done much to put Hopkins activities on<br />\na sound footing. Through its enforcement much hidden ability and<br />\ntalent is uncovered. No doubt interesting statistics might be compiled from facts gathered from present college leaders showing the<br />\nrise of the majority during their four years in college.<br />\nWhile participation in activities is recognized as advantageous,<br />\nit is likewise clearly seen that over indulgence is disadvantageous<br />\nand in some cases even harmful. It should be remembered at all<br />\ntimes that pursuit of knowledge is the real reason for coming to college and not to engage solely in activities. The News-Letter, therefore, in its paternal capacity, would advise the freshman in colloquial<br />\nterms \"not to bite off more than he can chew.\"<br />\nOPPORTUNITY<br />\nA former editor of the News-Letter, on turning over the quill<br />\nto his successor, was heard to remark: \"I would not substitute the<br />\nexperience gained through my work in college journalism fOr any<br />\nthree courses offered in the curriculum.\" A statement of this kind<br />\nis proof of the value of News-Letter work. College newspaper work<br />\nis undoubtedly the broadest in scope of any activity, for in reporting<br />\nnews one is brought into contact with faculty members, university<br />\nofficials; campus leaders, and the entire student body.<br />\nIn . )ecoming a candidate for the News-Letter, a freshman is<br />\noffered tie opportunity of getting acquainted with college life. Aside<br />\nfrom the feeling of service to Johns Hopkins, there is a material<br />\n:reward offered. The Varsity Seal, a miniature reproduction in gold<br />\nof the University seal, is given for faithful and consistent work in<br />\nnon-athletic activities. The Seal corresponds to the Varsity \"H.\"<br />\nCandidates will be welcomed in the News-Letter Office today at<br />\n12:30.<br />\nThe News-Letter regrets to announce the resignation of Harold S. Goodwin, '26, from the edi tonal staff.<br /><br />\nACIll<br /><br />\nAs a football player<br />\nhe's a good poet<br />\nE T'S admit that all men are not born for<br />\ngridiron honors, just as all men are not<br />\nborn poets.<br />\nYou can admire a man's grit for plugging<br />\naway at the thing that comes hardest to him.<br />\nHe does derive benefit in developing himself<br />\nwhere he is weakest. But to achieve real success<br />\nit is only common wisdom to pick out the line<br />\nfor which you have a natural aptitude—and go<br />\nto it.<br />\nParticularly if you are a freshman it may be<br />\nuseful to remind you of this principle, because<br />\nit can help you start off on the right foot in both<br />\nyour campus activities and your college courses.<br />\nIf your fingers love the feel of a pencil, why<br />\nnot obey that impulse and come out for the<br />\npublications? You can serve Alma Mater and<br />\nyourself better as a first-class editor than a thirdclass halfback.<br />\nSimilarly, when it comes to electing your college courses,you will be happier and more efficient if you choose in accordance with your<br />\nnatural aptitude.<br />\nThe world needs many types of men. Find<br />\nyour line, and your college course will be a preparation for a greater success.<br /><br />\nIA<br /><br />\nPublished in<br />\nthe interest ofElectrical Development by<br />\nan Institution that will<br />\nbe helped by what.<br />\never helps the<br />\nIndustry.<br />\ns.<br /><br />\nstern Electric Compasy<br />\nSince 1869 makers and distributors ofelectrical equipment<br /><br />\nAN<br /><br />\nNumber 41 of a series/\"<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7. 1924<br />\npkins• THREE<br />\n1,Va<br /><br />\nHUNDRED AND SEVENTYFIVE MEN IN FRESHMAN CLASS<br />\nContinued from page I<br /><br />\nBROWN ELECTED PRESIDENT OF COTILLON<br />\nCLUB<br />\n\"Eddie\" Brown, active in Cotillion Club circles during the last<br />\nscholastic year, was chosen president of the society at the regular<br />\nmeeting last week. He succeeds<br />\nW. Carville Gardner, under whose<br />\nleadership the club enjoyed one of<br />\nthe most succesful years in its history.<br /><br />\ntheir<br />\nf the dergrad\" schools and 14 of these<br />\nhave representatives in one or<br />\nmore of the graduate departments<br />\nSo only four are out of the fold.<br />\nFrom a totally different source,<br />\n, the Y. M. C. A., comes the news<br />\nthat the 653 men who have registered for Handbooks embrace 20<br />\ndifferent religions—there are -125<br />\nter<br />\nethodists, 119 Episcopalians and<br />\nthis<br />\nAt the same meeting John<br />\n118 Hebrews. Thirty-two per cent<br />\n,een<br />\nued<br />\nWebster<br />\nwas chosen 'secretaryrepresent denominations 'which<br />\ntreasurer.<br />\nThe new officers of the<br />\nhave ten or more members in the<br />\nclub<br />\nannounced<br />\nhave<br />\nthat the first<br />\nHe<br />\nUniversity. The Presbyterians<br />\ntiee<br />\nimportant<br />\ndance<br />\nseason will<br />\nthe<br />\nof<br />\nillShave 67 men, the Lutherans 59,<br />\nbe<br />\nSaturday<br />\nevening,<br />\nheld<br />\non<br />\nOcthe Roman Catholics 49, the Bapauditorium<br />\ntober<br />\n18,<br />\nthe<br />\nin<br />\nof<br />\nthe<br />\ntists 23 and the Reformed Church<br />\nEngineering<br />\nCivil<br />\nBuilding.<br />\nThis<br />\nhas 10. Of the remaining 11 per<br />\ncent 50 men express no church is the date of the Johns Hopkinspreference and five are Protestants University of Pittsburgh football<br />\nwithout any speCial preferences. clash, so an unusually large crowd<br />\nThere are 'five each registered as is expected. Music will be by the<br />\nmembers of the Congregational Blue Jay Six. Subscription for the<br />\naffair will be $1.<br />\nV 1 Church<br />\nand the Evangelical<br />\nThe date of the first cotillion<br />\nChurch. Four are Christian Sciwill<br />\nbe Friday, December 5, it was<br />\nentists and the same number are<br />\nUnited Brethren. There are three decided at the meeting. The dates<br />\nGreek Catholics- Ilia-M-6 members- of-the ,remaining-cotillions of the<br />\nof the Christian Temple. The year have not been officially .deOther religions, which are repre- termined, but probably will be at<br />\nsented by only one man apiece are the next meeting of the society.<br />\nthe Society of Friends, the DisciTea dances will be held in the<br />\nZ.IES Pies<br />\nof Christ, the Plymouth Civil Engineering Hall after each<br />\nBrethren, the Unitarian Church football game, the subscription beand the Mosaic Church.<br />\ning fifty cents a couple.<br /><br />\n3<br /><br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWELERS<br />\nLancaster, Pa.<br />\nClass Rings, Pins, Fraternity Pins<br />\nCups, Medals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"Makers of the Varsity Seals\"<br /><br />\nSlick headwork<br />\nGetting the right tailor, trailing<br />\nwith the right crowd, keeping<br />\nthe \"profs\" properly complaisant all come under this heading.<br />\nBut a tousled, untidy mane and<br />\ndandruff on your \"tuck\" collar<br />\nare always bad form.<br />\nGetting a bottle of \"Vaseline\" Hair<br />\nTonic and using it regularly keeps the<br />\nscalp healthy and makes stiff hair look<br />\nsilky. It prevents dandruff and puts on<br />\nthe finishing touch of slick headwork. At<br />\nall drug stores and student barber shops.<br /><br />\nSAlARTLY dressed men in the<br />\nstyle centers of the world know<br />\nthere is no substitute for a Stetson.<br /><br />\nEvery •'Vaseline\"Product is recommended everywhere because of its<br />\nabsolute purity and effectiveteess.<br /><br />\naseithe<br />\nREG.U.S. PAT.OFF.<br /><br />\nHAIR TONIC<br /><br />\nSTETSON HATS<br />\nStyled for young men<br /><br />\nFor the Health and<br />\nAppearance of the Hair<br /><br />\nChesebrough mfg. Company (Cons'd)<br />\nState Street<br />\nNew York<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br />\nXPrt:Corner C-- ayelle<br /><br />\nand nztaw Sts.<br /><br />\n-Where Wholesale and Retail Districts Meet-<br /><br />\natE1.7==11121211=1<br /><br />\n!WHOMHE<br /><br />\nPayne &amp;Merrill<br /><br />\nMemory Tonic<br /><br />\n°THE WONDER MOTOR FULE<br /><br />\nCLOTHIERS<br />\nHABERDASHERS<br />\nSHERWOOD BROTHERS, INC.<br /><br />\n315 Charles St. North<br />\nwgztgiggigNmcgataugunumgaltogamagi<br /><br />\nCollege men and women now<br />\nkeep their hair fashionably smooth<br />\nT.TER smooth, lustrous hair, done<br />\nwith fashionable plainness in<br />\nlines that follow closely the shape of<br />\nthe head . • •<br />\n•<br />\nHis well-kept hair,always in place,<br />\nalways trim, neatly parted, naturallooking . • • •<br />\nStacomb is responsible for this<br />\nnew trimness, never before possible.<br />\nIt keeps your hair looking at all<br /><br />\ntimes just the way you want it to<br />\nlook. Non-staining and non-greasy.<br />\nIn jars and tubes. At all drug and<br />\ndepartment stores.<br /><br />\nIt is surprising how the ever-readiness of Eversharp prompts the<br />\njotting down of passing thoughts<br />\nand facts—and how quickly the<br />\nhabit of writing it down\"improves<br />\nthe ability for accurate remembrance.<br />\nSix new features make Eversharp<br />\nfiner<br />\na<br />\nwriting instrument than<br />\nbefore—non-clogging rifled tip,<br />\nquick reloading, complete interchangeability of parts, are the most<br />\nimportant.<br />\nPut a new Eversharp in your<br />\npocket. And for complete preparedness, match it with a Wahl Pen.<br />\nPrices $1 to $45, at all dealers.<br />\nMade in the U. S. A. by<br />\nTHE WAHI. COMPANY, Chicago<br />\nCanadian Factory, THE<br /><br />\nWAHL COMPANY,Ltd.,Toronto<br /><br />\nManufaCturers of the Wahl Eversharp and the Wahl<br />\nAll-Metal Fountain Pen<br /><br />\nKEEPS THE HAIR IN PLACE<br /><br />\nDept.<br />\nLaboratories, Inc.,York City<br />\nStreet,New<br />\ngenerous<br />\nStandard<br />\ncharge, a<br />\n18th<br />\nWest<br />\nof<br />\n113<br />\nfree<br />\nrae,<br />\nStacomb.<br />\nPlease send<br />\nsarnple tube of<br /><br />\nThe New PERFECTED<br />\nAu '17filiZ511ARP<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 7, 1924<br /><br />\n4<br /><br />\nBLACK AND BLUE WINS INITIAL after touchdown—Turnbull (2)<br />\nENCOUNTER<br />\n(placement and drop-kick). RefContinued from page 1<br /><br />\nNEWS-LETTER'S PRESIDENTIAL BALLOT<br /><br />\neree—George Hoban. Umpire—<br />\nO.B..... Anderson Sigmund. Head<br />\nLinesman—ShaL.FI........ Marks let. Time of quarters-15 minutes.<br />\nR.H . . Crouse<br />\nFOR THE STUDENTS<br />\nRiggan<br />\nF.B.<br />\nBring<br />\nThis to the Address Below<br />\n6 13 13 0-32<br />\nHopkins<br />\nWhen You Want Anything in the<br />\nRandolph-3facon..0 0 0 0— 0<br />\nDRUG LINE<br />\nSubstitutions—Johns Hopkins:<br />\nMallonee for Gilliece, Leipensper- R. G.Loy &amp; Company<br />\n(Robert G. Loy)<br />\no-er for Biddison. Grinsfelder for<br />\nPHARMACISTS<br />\nLawrence, Bickford for Blandi;<br />\nUNIVERSITY PARKWAY<br />\nGilliece for Mallonee, Lawrence<br />\nAt Charles St.<br />\nmeeting.<br />\nfor Grinsfelder, Levy for Day,<br />\nAt this time, President Niner Van Horn for Taylor, Duckett<br />\nappointed a pep committee consist- for Magill, Conant for Milanau- BRANCH<br />\nAT THE BARN<br />\ning of Day, chairman, O'Dunne, sky, Kaufman for Slowik, SauerBoyce, Hi;:ies, Gassaway, Gibson, vein for Lawrence, Schacht for<br />\nTodd, Phillips, Swanson, Ward- Oles. Randolph-Macon: Snapp<br />\nwell and Grinsfelder.<br />\nfor Carmine, Thompson for Riggan, Osborne for Hughes, Martin<br />\nrTt<br />\nfor<br />\nFraley, Golden for Marks,<br />\nNOTICE<br />\nDorsey for Alexander, Scott for<br />\nJunior Class meeting today at Osborne. Touchdowns — Blandi<br />\n12.20. 120 C. E. Hall.<br />\n(2), Lawrence (2), Taylor. Points DOUG TURNBULL<br />\nTaylor<br />\nLawrence<br />\nTurnbull .<br />\nBlandi .<br /><br />\n(Mark X Beside Name of Choice)<br />\nDAVIS<br />\nCOOLIDGE<br />\nLaFOLLETTE<br />\nAny Other (Specify)<br />\n(Signed)<br /><br />\nRED PREDOMINATES IN THE<br />\nFIRST SOPH-FROSH<br />\nSCRAP<br />\nRed! Red was the color predominating. No doubt about it. The<br />\nFrosh and Sophs both saw red,<br />\nthere was a plentiful besprinkling<br />\nof the red life fluid, proceeding<br />\nfrom the olfactory organs of<br />\nnumerous combatants, and topping<br />\nthe whole proceeding was the fiery<br />\nred head of one of the most pugnacious Freshmen that ever trod<br />\nthe paths of Homewood.<br />\nThis particular chap would persist in walking on the sacred lawns,<br />\nin spite of President Goodnow's<br />\n-straight line admonition,\" in spite<br />\nof certain well-known regulations,<br />\nand in spite of the objections of<br />\ncertain gentlemen known generically as the \"wise fools.\" And when<br />\nhe walked forward, his Freshmen<br />\ncompatriots saw red, both figuratively and literally, stepped in where<br />\nangels feared to tread (no insinuations meant), and were soundly<br />\npaddled for their pains by the aforementioned -wise-fool- Sophs.<br />\nIt was a great battle while it lasted. Rolling, scratching, yelling<br />\nmasses of humanity fought hard<br />\nand loyally for the honor of their<br />\nrespective classes. Standing on the<br />\n:fide-lines, Juniors, but a space removed from such squabbles, cheered<br />\nfor the Freshmen, urged the battles on, and laughed long and heartily; they knew that their own fighting days were o'er, hence no forebodings prevented their mirth from.<br />\nreaching its highest pitch. Seniors<br />\nyawned lazily, or smiled cynically,<br />\nin order to maintain their legened<br />\ndignity, although in reality they enjoyed the battle as much as any one<br />\nelse. Even certain dignified professors, long known for their unperturable tranquillity in the face<br />\nof all student pranks, were seen gingerly poking their heads forth from<br />\noffice windows, and as quickly withdrawing them. Their reputation<br />\nhad to be maintained. Yes, this<br />\nwas a real fight.<br />\nThe Frosh seemed to have the<br />\nedge. Out numbering the Sophs<br />\nalmost two to one, they showed<br />\ntheir valor in true Hopkins fashion.<br />\nBesides, did they not have the redheaded leader to make them see red;<br />\ndid not their respective countenances show red with blood, and<br />\nwasn't that tingling sensation induced by paddles a most reddening<br />\nmatter? The Sophs were up against<br />\ntoo much red, in this the first battle of the year. They tried to believe that it was green. green Frosh,<br />\nbut they either were color-blind, or<br />\ndetermined to avoid facts. There<br />\nwas too much red for the Sophs.<br /><br />\nSOPHS MAKE NOMINATIONS<br />\nFOR STUDENT COUNCIL<br />\nNominations for student council<br />\nrepresentative were made by the<br />\nsophomore class at its first meeting of the year. on Tuesday, September 30. Those named were<br />\nMeredith, Cleaveland, Harwood,<br />\nFrantz, Niner, and Passano. The<br />\nelection will be held at the next<br /><br />\nR. 0. T. C. LEADS<br />\nContinued from page 1<br /><br />\nthe unit has thus far used, according to Lieutenant Sherwood, wh( VOl<br />\nis in charge.<br />\nIn addition to the change in head CL,<br />\ndress, is a change in the design of N(<br />\nthe cap device, which has not bec<br />\ndefinitely determined. A later edi Fres<br />\nr<br />\ntion of the NEWS-LETTER will a<br />\nnounce a student competition for<br />\nc<br />\nnew design for the cap device. Th(<br />\nwinner of this competition will ix<br />\nate5<br />\nceive ten dollars in gold.<br />\n•<br />\n— les<br />\ntior<br /><br />\nclas<br />\nflex<br /><br />\n• Fro<br /><br />\n4=6•F<br /><br />\nCloiftes<br />\nCustom<br />\n14. N.ovaries<br /><br />\nRepresentatives<br /><br />\nAy<br />\nreet<br /><br />\nTOM MAGILL,<br />\nManages<br /><br />\nOct<br />\nme(<br />\ncall<br />\nof<br /><br />\nDa,<br /><br />\nCot<br />\n'noi<br />\nsub<br />\ngill<br />\n_<br />\noff(<br />\nwot<br />\nCot<br />\nF<br />\nbro<br />\n'.ini<br /><br />\n11<br /><br />\nt V$11<br />\n,<br />\n\"=:=1<br /><br />\nishi.411,,0<br /><br />\nwas<br />\nGri<br />\nin t<br />\nabil<br /><br />\n,<br /><br />\ntO<br />\nloll<br /><br />\nCui<br /><br />\n1 11101<br /><br />\nSailing West to India<br />\n€53INCE the days of Christopher Columbus men have felt<br />\nthe call to ((sail due west to find<br />\nIndia.\" In an organization like<br />\nWestinghouse, such pioneering<br />\nspirits find happy haven as research engineers. Their every<br />\nthought is a question—every<br />\nenergy bent to discover new<br />\nand more effective answers to<br />\nbaffling problems.<br />\nImmediately Westinghouse<br />\nbegan to build alternating current machines of high voltages,<br />\nfor example, the problem of<br />\ninsulation became acute. For<br />\nthirty-five years high voltages<br />\nand insulation have formed an<br />\nendless chain of problems. As<br />\nvoltages have been increased,<br />\nimproved insulation has been<br />\ndemanded. As insulation has<br /><br />\nbeen bettered, voltages have<br />\nbeen still further increased.<br />\nOne striking contribution of<br />\nWestinghouse research engineers has been the perfection<br />\nof an entirely new insulation<br />\nmaterial— Micarta. Possessing<br />\nmany of the qualities of metal,<br />\npaper,fiber, mica,gum,rubber,<br />\nMicarta differs in radical respect from all of these.<br />\nIt serves industry indirectly<br />\nas improved insulation material, and also directly because<br />\nof superiorities when used for<br />\ngears, propeller blades, and<br />\nthe like.<br />\nOnly the imagination can<br />\nset a limit on the field for the<br />\nresearch engineer—or for an<br />\norganization that centers<br />\naround him.<br /><br />\nWh4<br /><br />\nlast<br /><br />\ntirg<br /><br />\nat<br />\ncall<br />\nbly<br />\nele(<br /><br />\nCla<br />\nilig<br /><br />\nC.<br /><br />\n13<br />\n:iot<br />\n,pr<br />\nCol<br />\noth<br />\n.111r<br /><br />\nFR<br /><br />\nlast<br />\nfinc<br />\nwh(<br />\nTw<br />\nmal<br />\nthe:<br />\nmei<br />\nper<br />\ntest<br /><br />\nJoe<br />\nkin1<br />\nhig<br />\nlish<br />\ntjç<br /><br />\n('St<br />\n11.(1<br /><br />\nvv;1,<br /><br />\nACHIEVEMENT<br /><br />\nOPPORTUNITY<br /><br />\n(111(<br /><br />"}], "field_media_file": [{"target_id": 37887, "display": null, "description": null, "target_type": "file", "target_uuid": "f97db31d-c5ce-40b8-a029-834425a1dea7", "url": "http://digital.library.jhu.edu/system/files/2022-03/13132-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13132, "target_type": "node", "target_uuid": "03c82826-ab22-421a-8888-097b7a3efb8e", "url": "/node/13132"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "890901bd-aa6a-4443-8be5-9ccf6846e263"}]}