{"mid": [{"value": 37417}], "uuid": [{"value": "1229f3bf-de5f-49cc-bcab-784d547cde2e"}], "vid": [{"value": 37417}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T18:32:00+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13343-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T18:32:00+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T18:32:00+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXXIII, No. 15<br />\n<br />\nDR. EDDY SPEAKS<br />\nAT ASSEMBLY<br />\n<br />\nHOMEWOOD,BALTIMORE, MD., NOVEMBER 20, 1928<br />\nE. G. BAETJER NAMED<br />\n- TO BOARD OF J. H. U.<br />\n<br />\nNEW ISSUE OF BLACK AND BLUE<br />\nJAY IS FAVORABLY RECEIVED<br />\n<br />\nPRICE 5 CENTS<br />\nBASKETBALL CANDIDATES<br />\nTO REPORT THURSDAY<br />\n<br />\nBLUE JAYS LOSE TO<br />\nST. JOHNS ELEVEN<br />\n<br />\n_ Thursday, following the asThe first issue of the Jay has ex- campus are introduced in this issue<br />\nsembly, the basketball squad<br />\ncellent material. It is noticeably and and add to the intrinsic value of the<br />\nJay Team Plays Listlessly<br />\nWell-known Author Talks on<br />\nwill hold its-organization meetnotably different from all issues Jay.,<br />\nThroughout Game<br />\n\"Sex and Youth\"<br />\ning in the C. E. Hall. Coaches<br />\nAnother feature of the magazine<br />\nheretofore published, but most of<br />\nRay.<br />\nVan<br />\nOrman<br />\nand<br />\nGeorge<br />\nLINE<br />\nLACKS POWER<br />\nabundance<br />\nof<br />\nadis<br />\nthe<br />\nlack<br />\nof<br />\nover<br />\nin<br />\nmagazine<br />\nis<br />\nlost<br />\nthe<br />\nthe<br />\nvalue of<br />\nSPEECH GREATLY ENJOYED<br />\nDarley will address the gatherthe fact that is so kte. However, fertisements. Those advertisements<br />\nSt. John's Plays Superb Football<br />\ning, at which candidates for<br />\nto Turn Back Jays 46-0<br />\nOutspoken Attack on Presentthe high tension oT expectation which are in the issueadd to it as<br />\nmanagerial as well as playing<br />\ncaused by the long delay makes the a whole except that, as the Jay itday Principles Pleases<br />\nAn inspired St. John's football<br />\npositions<br />\nshould<br />\nbe<br />\npresent.<br />\nbook anxiously sought for by ev- self, they are late and some of the<br />\nteam came to Homewood last SatDr. Sherwood Eddy, National<br />\nThe initial practice of the<br />\neryone. The first issue is- out just copy is already history.<br />\nurday and left nothing but amazeSecretarz of the'Y. M. C. A., wellAn index of work and the auyear will be held at Carlin's on<br />\nin time to give those unfortunate<br />\nment in its wake. Playing superb<br />\nknown lecturer and author of sevTuesday afternoon. -Informastudents who can't make the marks, thors of the work also are novel in<br />\nfootball, the Johnnies ran over the<br />\neral renowned books,,poke be<br />\na taste of the humorous side of col- the Black and Blue Jay. From the, ilen relative to practices and<br />\nJay team at will and rolled up 46<br />\nforE a large assembly last Thursindex it can be seen that the stories,<br />\nequipment will be given at the<br />\nlege.<br />\npoints before the contest finally endday in the C. E. Hall. Dr. Eddy,<br />\norganization<br />\nmeeting<br />\non<br />\nThe cover, by Kolb, forec-asts the articles and editorials have grown<br />\ned. The second quarter was a riot<br />\nwho recently wrote a book on<br />\nThursday.<br />\nchange of style of the publication. in volume while the art work, and<br />\nOf scoring for the St.,John's team;<br />\n\"Sex'and Youth\", made this SubIt is a Inarked change from the us- the usual amount of exchange and<br />\nin this period the Annapolis eleven<br />\npoor<br />\nlocal<br />\njokes<br />\nhave<br />\nbeen<br />\nject the basis of his•talk.<br />\nexcluded.<br />\nual college art work. It is quiet and<br />\nrolled up 34 points without letting<br />\nThis Jay is a renovated publicaconservative, but expressive.<br />\nIn intioducing his subject, Dr.the Jays get really within scoring<br />\nArt wort( throughout is of a high- tion ,and is certainly a step forward<br />\nEddy brought out that at the botdistance at any time.<br />\ntom of the makeup 'of every red- Impregnated Paper Insulation Is er calibre than the Jay has known and upward from the old level that<br />\n4)u-the tenth play 9f-the game<br />\nSubject<br />\nthe<br />\nformer<br />\nissnes-Established.<br />\nFor<br />\nsome<br />\ntime.<br />\nAmong<br />\nothers,<br />\nReport<br />\nAll<br />\nto<br />\nCandidatesUrged<br />\nblooded young man there are cerBobby Lyons was injured and had<br />\nthis<br />\noriginality<br />\nand<br />\nthe<br />\ninitiative<br />\nof<br />\nQuirk's<br />\nportrait<br />\nof<br />\na<br />\nyoung<br />\nlady<br />\nThen<br />\nThe<br />\nConference<br />\non<br />\nImpreg.<br />\ntain \"drives\", _impulses, or into be removed from the field before<br />\nstepping away from the beaten.track<br />\n_stincis which can make or break nated Paper Insulation has been which accompanies the poem \"LoveThe annual Barnstomers' Rally the second quarter was fairly under<br />\narid<br />\ntlfe<br />\nsemi-humorous<br />\n.type<br />\nof<br />\nthe<br />\nliness\"<br />\nis<br />\nfine.<br />\nthe individual. Like a high-pow- in progress at ,Hopkins during<br />\nusual humorous magazine, we take will be held at the Homewood Play- way. Without their field general<br />\nered car they Can get out of con- _the last , week, On Thursday,'Fri- The page of photographs and the<br />\nshop, behind the 3 ..versity Club, the Jay team didn't seem to know<br />\noff<br />\nour hat to the Jay.<br />\narticles<br />\nof<br />\ncommon<br />\ninterest<br />\nto<br />\nthe<br />\ntrol, but on the other hand by dis- day and Saturday.<br />\nFriday, November 23, at 8 o'clock. what to do with the ball when they<br />\nExperts in high voltage electric<br />\nciplined self-control they can be<br />\nThis is the first call for candidates got possession of it, and as a result<br />\nStudent<br />\nActivities<br />\nCouncil<br />\nSpeak<br />\nStanley<br />\nJones<br />\nTo<br />\ntransmission<br />\nE.<br />\nfrom<br />\nall<br />\nparts<br />\nof<br />\nthe<br />\nmastered to a love of all fine and<br />\nby the Barnstormers in view of were kept on the defensive the enConsider Varsity Seals<br />\nTo College Students starting a light rehearsal schedule tire game.<br />\nbeautiful things. It was broUght United States; representing leading<br />\nengineering<br />\nschools<br />\nand<br />\nelecout that much depends on whethDr. E. Stanley Jones of India beginning immediately. Candidates<br />\n34 Points in Third Quarter<br />\nA meeting of the Student Activier the individual masters or is tric power companies, attended<br />\nwill<br />\nbe the speaker at a° special ad- should not feel any hesitancy in<br />\nThe first score came on the fifth<br />\nmastered by these drives. From the'three-day ccinference on the ties Council was held last Friday. dress and open forum for students coming out because of lack of ex- play of the second quarter, after the<br />\nNovember 16, at which a financial<br />\nthis point on Dr. Eddy assailed problems of insulation.<br />\nthis afternoon, Goucfter, Hopkins perience, as many of the stars of Johnnies had blocked and recovered<br />\nThe main purpose of the con- report of the group was rendered by<br />\nwith sincere, heartfelt enthusiasm<br />\nand<br />\nMaryland are trie represented_the productions in the past had no a kick on the Hopkins 35-yard line.<br />\nthe old Puritannical, ignorant ference_ was to investigate the Mr. John Myers, the treasurer of at this meeting, which will be held experience before coming to Hop- The ball was carried over the last<br />\nthe<br />\ncouncil,<br />\nshowing<br />\nthe<br />\navailable<br />\ndealing<br />\nwith<br />\nthe<br />\nmeans<br />\nof<br />\nbest<br />\npolicies of rearing children in igat'five o'clock in Catherine Hooper kins.. This year's play calls for an white marker by a series of ordinorance, and letting youth flour- insulation Problem, which has resources of each activity. Also con- Hall of Goucher College. The Stu- unusually large cast and as many of narily well-executed plays. There<br />\nhas<br />\nsiderable<br />\ncomment<br />\nwas<br />\nmade<br />\nupon<br />\npresent.<br />\nThis<br />\narisenat<br />\nCOnre<br />\nish into it beautiful state of exdent Volunteer Movement and Mt. last year's stars were lost through was nothing \"flukey\" about it except<br />\nistewe with horrible inisconeep- about as -a result of the develop- the caress and promiscuous dona- Vernon Place M. E. Church are graduation, there are many-places the apparent listlessness of the HopWhich<br />\nplants<br />\ntion<br />\nof<br />\nvarsity<br />\nseals<br />\nthat<br />\nwas<br />\nprevasuper-powef<br />\n•tions of sex anit sex life. It teas. merit of<br />\nsponsoring the affair. The Campus which will have to be filled by can- kins team. Front then on it _was<br />\nbrought out thai.., the ' new era- are long distances from the mar- lent last year in the University. To Committee consists of Foster Dow- didates.<br />\nmerely a case of how often the St.<br />\nrectify this error, each member is<br />\nsinC-e the war has seen for the kets for the current.<br />\nell, Purnell Hall, Edward Lockhard, This rally will not be confined John's team would cross the scorThe conference did not fornial- appointed as a committee of one to<br />\nmost 'part a gradual lifting of<br />\nGrafton lierpsberger and Howard exclusively to candidates for the ing line before the half would end.<br />\nthese medieval and backward ten- ly open till Friday at 9.30 A. M.. arrange a practical plan to reduce Easton, Similar committees are cast. Clyde Friz, Production Mana- Hopkins backs were not plugging<br />\nGoodnow<br />\nPresident<br />\nthe<br />\nnumber<br />\nof<br />\nseals<br />\ngiven<br />\nout,<br />\nand<br />\ntime<br />\nthis<br />\nat<br />\ndencies, but that narrow-mindedworking at Goucher, and Maryland. ger, will welcome all carpenters, holes in the line on the defense and<br />\n'tress still exists. Dr. Eddy welcomed the many scientists -to report the same at the next meeting. The three comniittees consisting of painters, and electricians and George were not giving interference on the<br />\nmeetactual<br />\nof<br />\nthem<br />\nwill<br />\nnot<br />\nso<br />\nthat<br />\nthe<br />\nvalue<br />\nThe<br />\nconferences.<br />\nthe<br />\nbrought out several specific cases<br />\nsome two dozen students met at Glazier wishes to have all those in- offense; the Hopkins line was dis- •<br />\norder by be lessened.<br />\n.of youths from revble fami- ing was they called to<br />\n• dinner over a week ago and worked terested in the business staff pres- playing a phenomenal reversal of<br />\nelec-.<br />\nthe<br />\nof<br />\ndean<br />\nWhitehead',<br />\nlies, students at high school-- Dr.<br />\nform over last Saturday,'apparently<br />\nout the details.<br />\nent.<br />\ndepartment.,<br />\ngrowing up in ignorance feeling trical engineering<br />\nFootball<br />\nFrosh-Soph<br />\nbeing unable to stop even the weakDr.<br />\nJones<br />\nis<br />\na<br />\nnative,<br />\nof<br />\nBaltielectrical<br />\nWilliam<br />\nBanks,<br />\npresident of the<br />\nse -urges, and answering them in who is chairman of the<br />\nest thrusts of the St. John's team.<br />\nNov.<br />\n24<br />\nGame<br />\nand<br />\nRush<br />\nmore.<br />\nFrom<br />\nthis<br />\ncity<br />\nhe<br />\nRewent<br />\nto<br />\nNational<br />\n*club, has solicited the attendance of<br />\npromiscuous and indecent _ways. committee of the<br />\nThe Johnny backfield men just<br />\nUnder this coun- Freshmen-Sophomore hostilities India, where he worked for about the alumni through a circular letter<br />\nIn each case the habits continued search Council.<br />\nleading elec- will be resumed when the rival fifteen years. He is now in his early in line with the club's policy of de- couldn't be stopped by the Jaymen<br />\nby<br />\n-backed<br />\nand<br />\ncil<br />\nand the boys grew into manhood<br />\nimportant re- classes trot out their football teams forties and one of the leading au- veloping alumni support. The com- until they had traversed at least two<br />\nand always retained that horrible trical companies,<br />\nsearch work along the line of in- on the upper field, Saturday, No- thoritieS ittn that great Asiatic na- mittee promises entertainment, the or three white markers. Each time<br />\nstain of'indecency.<br />\nsulatibsn has been carried on vember 24. at 2.30 P. M. Dow Stra- tion. He has studied the country nature of which has not been dis- the St. John's team got the ball in<br />\n. Open Forums .<br />\nWhite- der,'varsity captain and center. will not from the point of view of an closed. Walter B. SWindell, '01, a broken field the Hopkins stands<br />\nDr. Eddy brought out that he tinder the direction of Dr.<br />\nheld their breath—having secured<br />\nreferee. Coach Van Orman will American, but through the outlook who has coached the last six prowell remembers the first sex ex- head.<br />\nan early lead, the Johnny backs<br />\nContinued an Page 4, Col. 4<br />\nissue uniforms to sophomores who given by an antecedent study of In- ductions, will be on hand to talkito<br />\nplanation he ever acquired. It<br />\narose to.the occasion and outplayed<br />\nwas from a small boy in a base-.<br />\nturn out, the freshmen having al- dian literature, language, philoso- the candidates and welcome the<br />\nphy, religion and history. He was alumni.<br />\nRefreshments will be themselves. It seemed as though<br />\nready been supplied.<br />\nball park, and was naturally full Major Tipton To Talk<br />\n,<br />\nelected a bishop of the Methodist served. Part of the assembly on a touchdown was made every time<br />\nnf indecent and vague concepHopkins. A. S. M. .E. After the game the annual class Episcopal Church but resigned that Thursday will be turned over to the Annapolis eleven got possession<br />\nTo<br />\nthe<br />\ntions. He automatically got<br />\nMajor °Tipton, of the. Maryland rush will take place in a novel form. high office, preferring his work in Mr. Swindell, who will attempt to of the hall.<br />\nwrong idea, and because .of this<br />\naddress the A football will be placed on the<br />\nNational<br />\narouse.interest among the students<br />\nBlue Jays Overconfident<br />\nfact lost all reskct for his parni la which he regarded as.a. greater<br />\nbranch of the American So- fifty-yard line and members of each<br />\nstudent<br />\nThe first half finally ended with •<br />\nto come out -for the play.<br />\nents, friends, and teachers, who<br />\nopportunity<br />\nfor<br />\nservice.<br />\nthe<br />\nopposing<br />\nline<br />\nup<br />\non<br />\ntoclass<br />\nwill<br />\nMechanical Engineers<br />\nthe visiting team having scored at<br />\nhad kept these facts from him. It ciety of<br />\nnight. The meeting will be forty-five-yard lind. At the whis- His two books, The Christ of the<br />\nthe rate of one touchdown every<br />\nwas brought out that these things morrow<br />\nCampus<br />\nCage<br />\nFund<br />\no'clock in Robrn 110 of the tle, the frosh and sophs will try to Indian Road and The Christ of the<br />\nthree minutes of actual playing time<br />\nare actually beautiful and sacra- at 8:00<br />\nNears Completidtz during the second quarter. Jay<br />\nget the ball between the goal posts Round Table, have been<br />\nBuilding.<br />\nread by<br />\nmental, if understood in the prop- M. E.<br />\nMajor Tipton is at present vice- of their antagonists. The rush, un- students not only in English but<br />\nAccording to rePorts furnished rooters were absolutely spell-bound,<br />\ner light.' God created man and<br />\npresident of the Chesapeake Air- less one side wins before, will last<br />\nby the Treasurers -office, the cage they could hardly believe their eyes.<br />\nGenesis,<br />\nwoman as described in<br />\nalso<br />\nin<br />\nGerman,<br />\nFrench,<br />\nSpanish,<br />\nholds<br />\nofficially<br />\nCompany and<br />\nfund goal of $10,000 is being ap- St. John's was administering a drubfive minutes.<br />\nand He certainly was not craft<br />\nSwedish, Norwegian, Japanese, Kothe rapacity of Major in the Naproached by the donations of 296 bing the parallel of which could<br />\nashamed of His creation.<br />\nactively<br />\nrean, Chitiese, Syrian, and several °undergraduate students which have hardly be remembered by the oldest<br />\ntional Guard. lie has been/<br />\nflying<br />\nLecture<br />\nhe<br />\nTo<br />\nDr. Eddy mentioned that<br />\nDr. Miles<br />\nvernaculars of India. Four hundred attained four-fifths of the amount Hopkins grad.<br />\nengaged and interested' in<br />\nhad lectured at nearly 50 colleges during and since the Worrd9Var.<br />\nOn Shakespeare Again thousand'copiek of the former book required to receive support from _ When the second half began<br />\nthroughout the country on the<br />\nMajor Tipton was a lieutenant in<br />\nwere sold and went through five edi- the alumni of the University. At things began to look a little better<br />\nsubject. Ffe had held_ open for- the Flying Corps during the War, Dr. Miles will render the second<br />\ntions in six months. Dr. Jones the sophomore class meeting last for the Blue team. Four first downs<br />\nan<br />\nas<br />\nrecord<br />\nseries<br />\nof<br />\nfour<br />\nlectures<br />\nrosk<br />\nremarkable<br />\nhis<br />\nof<br />\na<br />\ntuns, and had answered freely all and has<br />\nThursday $170 was raised, and this were made in quick succession, only<br />\nToward the latter part of Shakespeare on Thursday, Novem- stirred 'large audiences of students week the junior 'and senior classes to lose<br />\ninquiries on the part. of students. aviator.<br />\nthe ball on St. John's 20the<br />\nbehind<br />\nfell<br />\nand<br />\nBerlin<br />\neven<br />\nin<br />\nPrague„<br />\nVienna<br />\nplane<br />\nconflict his<br />\nwill have meetings at which Dr. Van yard line. The chance to score was<br />\nber 22, at 4.15. The lecture is exThese inquiries and answers were the<br />\ncapheld<br />\nwas<br />\nGerman lines, and he<br />\npected to be given in Room. 101, though speaking through an inter- Orman will speak on the cage fund. gone and from then on for the rest<br />\nusually arranged through writing.<br />\ntive in a prison -camp for the reHall, which was the loca- preter. He is in this country for<br />\nRemsen<br />\nAlthough the tune limit for sub- of the quarter the two teams fought<br />\nbeing<br />\nSpeaks of Petting<br />\nmainder of the war. After<br />\nNaturally, it was brought out released he returned to Hopkins and tion of the first. The last two are only three months and eager to re- scriptions has passed, any students out the battle on about even terms.<br />\nThe Hopkins eleven was still playmany of the questions dealtzvith took up Mechanical Engineering scheduled for December 13 and Jan- turn to India.<br />\nnot seen by the committee and wishing listlessly, as though the contest<br />\nthe preposition whether such and and graduated in 1921.<br />\ning to subscribe, may stop at the were of little moment, and the guaruary la at the same time and place.<br />\nbeen<br />\nsuch a thing was right or wrong. Since then, perhaps, he. has<br />\nTreasurer's office before this Friday terended with the ball on the Jay's<br />\nThe last lecture was a general<br />\nThe first important meetinainly through<br />\nFor instance, in many cases it closely connectrd;-and sign the pledge. As soon as all 15-yard line.<br />\nsurvey of the early. influences upon<br />\nNathe<br />\nBusithe<br />\nof<br />\nthe<br />\nyear<br />\nof<br />\ning<br />\nwith<br />\naviation,<br />\ncommercial<br />\nwas asked whether \"petting\"—a<br />\npossibilities on the campus have Twice more before the game was<br />\nthe works of Shakespeare and the<br />\nness Staff and Business Cantional Guard. He also is writing<br />\nnew and well-known term was or<br />\nbeen exhausted, a final drive will be over the St. John's team crossed the<br />\nthree will continue the study<br />\ndidates of the \"News-Letter\"<br />\non commercial aviation for the Sun next<br />\nwas not ethical.<br />\nDr. Eddy paper.<br />\nmade on the alumni to complete the last white line to add six more<br />\nwill be held tomorrow, Wedof his life.<br />\npoints to their already unbelievable<br />\nnesday, November 22, at<br />\nremainder of the necessary fund for<br />\nbroug4i1 out that to judge whethA special invitation is extended<br />\nAll students taking English 1 are<br />\nscore.<br />\n12.30, in the \"News-Letter\"<br />\ner a thing of this sort is right or to all M. E. students who are in required to attend and will be held<br />\nthe cage which will approximate<br />\nOne more defeat chalked up to<br />\nOffice. It is imperative that<br />\nsecond years, but all<br />\nover one hundred and fifty thou- the score of over-confidence.<br />\nwrong in general is an impossible their 'first and<br />\nthe contents of the<br />\nall members be present.<br />\nwelcome and cordially responsible for<br />\nare<br />\nstudents<br />\nsand dollars.<br />\ntask. He mentipned that \"petContinued on Page 3, Cot,<br />\nfull series.<br />\ninvited to attend.<br />\nContinued on Page 3, Cd• 4<br />\nMr. Edwin Gs Baetjer,<br />\nprominent local attorney,- has<br />\nbeen selected to fill one of the<br />\nfour vacancies on the board of<br />\ntrustees of this University. No<br />\naction has been taken on the<br />\nother places to be filled.<br />\nIt is understood that the<br />\nboard is nearing the finish of<br />\n'their research and elimination<br />\nin an effort to find a successor<br />\nfor President Frank J. Goodnow, whose resignation' lakes<br />\neffect not later than July ilst,<br />\n1929.<br />\n<br />\nCONFERENCE IS HELD<br />\nBY ENGINEERING SCHOOL<br />\n<br />\nBARNSTORMERS TO HOLD<br />\nANNUAL RALLY FRIDAY<br />\n<br />\n\f20, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER<br />\n<br />\n2<br />\n<br />\nHOMESNEWS:LETTER<br />\niOUNDED 1897<br />\n$2.00<br />\n<br />\nSubscription<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\nEDITOR: other communications to the EDITOR-IN-CHIEF.<br />\n<br />\nUniversity 0106<br />\n<br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chiel<br />\nGEORGIC E. BANKS, JR., '29<br />\n<br />\nAssistant Managing Editor<br />\nGams GUMP,'30<br />\n<br />\nManaging Editor<br />\nPHILIP W. Ness, '29<br />\n<br />\nAssociate Editors<br />\nWILMER H. DRIVER, '29<br />\nROBERT S. BAMD, 'BO<br />\n<br />\nRICHARD H. WOOD,'29<br />\n<br />\nJunior Editors<br />\nStewart L. Smith, '30<br />\nLeonard B. Motley. '29<br />\nH. Garland Hershey, '29<br />\nPaul W. Spear. '30<br />\nGeorge H. Dowell, '31<br />\nRobert F. Skutch, '30<br />\n<br />\nW. Purnell Hall. 4., '30<br />\nFoster Dowell, 29<br />\nRichard G. Hunt. '31<br />\nHarwood F. Mullikin. Jr ‘131<br />\n'Irving K. Gordon, '29<br />\nLewis Daneiger, '31<br />\nIt.<br />\n<br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nAdvertising Manager<br />\nGEORGE M. GLAZIER, '29<br />\nOffice Staff<br />\nThonanrP A. Elotshmftn. '31<br />\nersnnolnh Rothchild. '11<br />\nT<br />\nv Shur,. '11<br />\nJohn A inmirieon. '30<br />\n<br />\nCia °'/Won Manager<br />\nJ. Witmer Mvsses. '29<br />\nAdvertising Staff<br />\nAlvin IL Ilium. '30<br />\nGus Burke, '31<br />\nGeorge S. Robertson. '31<br />\n-Sidney Raffel, '31<br />\n<br />\nStaff Photographer<br />\nWALTER D. SCHEIDT, '30<br />\nPrinted by The Read-Taylor Company, Lombard and South Streets,<br />\nBaltimore, Md.<br />\n<br />\nEDITORIAL COMMENT<br />\nPOST MORTEM<br />\nP from historic Annapolis, there came eleven gridiron warriors,<br />\nwith 'a glint of defiance in their eyes and a passion for revenge<br />\nsurging through their souls. NOt since 1?.17., had St. John's been able<br />\nto ,take the measure ,of a johns Hopkins ..football team. Year after<br />\nyear, they had been forced to accept the borers',share. But,this year,<br />\n.under the direction of their coach, \"Tody\" Riggs, the JohnnieS came\"<br />\nto town with a determined look on their faces and swore a fierce oath<br />\nthat their past defeats would be avenged.<br />\nOut from the locker rooms, under the Homewood Field stands,<br />\nseyed Jays. Last week, they had made New Vick ,<br />\n.<br />\ntrotted the blue-jer<br />\ngasp with amazeinerit-Wholding the powerful Columbia outfit to a<br />\n14-to-13 score. The newspaper experts had picked them to again beat<br />\nold St. John's. There was a confident spirit in their ranks as they.<br />\ncarried on their preliminary work,out It looked like another Hop,<br />\nkills year.<br />\n<br />\nU<br />\n<br />\nAs the game progressed, it became more and more apparent that<br />\nthe football guessers had made another mistake. The Johnnies ripped<br />\nimmense gaping holes in the. Jay fOrward wall. They tore open great<br />\ngaps, large enough .for the whole backfield to pass through: When<br />\nthe Jays got possession of the ball, the St. John's defenses held like<br />\na mighty fortress. Hopkins was simply outclassed,-outguessed and<br />\n<br />\nST. JOHN'S BURNTIN TRADITIONAL<br />\nMANNER BY CHANTING PARADERS<br />\nthat an _important event is<br />\ntranspiring. At.Goucher, a halt was<br />\ndeclared; and here the fair co-eds<br />\nwere informed in. no uncertain<br />\nterms that St.John's was irrevocably<br />\ndoomed.. After having yelled itself<br />\njust a little more hoarse, the crowd<br />\nrumbled, tumbled and crashed on<br />\ndown to North Avenue. Another<br />\nmore evincing of Hopkins en. Therefore, in the traditional nian- halt;<br />\nmore denunciations of<br />\nner, the Hopkins student body set thusiasm;<br />\nand again forward moforth on Friday night to totally ex- .St. John's,<br />\ntinguish the spirit of St. John's in a tion.<br />\nNow the street cars added in cremanner highly ceremonious and efnoise as ingenious Frosh<br />\nficacious. The demonstration start- ating a<br />\ndynamite powder on the<br />\ned at the Barn in the early part of dropped<br />\nwould in Annapolis<br />\nWHat<br />\ntracks.<br />\nsuccess<br />\nthe<br />\ninsure<br />\nthe evening. To<br />\nprovocative of calling<br />\nbeen<br />\nhave<br />\nof the procedure and to ward off<br />\nstate militia, was more<br />\nall evil bodieS-,a flaming \"H\" com- forth the<br />\nin Baltimore. Was<br />\ntolerated<br />\nthan<br />\nposed of lighted torches was set up<br />\nserenaded with a<br />\npoliceman<br />\none<br />\nnot<br />\nin the center of the bowl.<br />\nchorus of \"all policemen have big<br />\nLed by four upper classmen feet\"; and did he not acknowledge<br />\nasiride fierce chargers, the parade the compliment by smiling gracioUsot under way. Despite the blaring ly ? Baltimore, seeming' to enjoy<br />\nof the band, the tooting of horns, the spectacle, gazed .eagerly and<br />\nthe back-firing_ of \"ilivvers,\" and th- good-naturedly.<br />\nyelling of Freshmen, a certain'sadAfter a series of stops and starts,<br />\nness was prevalent, The Frosh, the procession reached Sun Squart<br />\ndressed in white pajamas, presented En -rOilte the fat thir St. John's<br />\na somewhat wraith-like appearance was again being consigned to torthat was altogether meet at a time rid regions was made known to the<br />\nwhen the spirit of an ancient rival somewhat inanimate John Eager<br />\nis about to be laid to rest. Nor was Howard and George Washing-ton,<br />\nthis the only portent of a somewhat who daily hang out in Mt. Vernon<br />\nlugubrious event. A large black Place. In honor of the occasion,<br />\nhearse, on which sat some twenty the equine that has so patiently<br />\nor thirty students in positions vari- borne the bronze Sir Howard for<br />\nous and precarious, gave more evi- many years, come to life again and<br />\ndence of a funeral.<br />\nsnorted fire as some original yearDespite this tinge of sadness, the ling stuck .a flaming torch in the<br />\nprocession was lively enough. Hoo- horse's mouth.<br />\nwah-hooing and snake dancing, the<br />\nBy the time the Sun Square was<br />\nparade advanced down Charles reached the preliminaries had been<br />\nStreet. ,Burning torches_were car- concluded. The crowd, worn but<br />\nried aloft. in order to give light to still happy, was just in the right<br />\nthe St. John's spirit that was soon mood for a.cremation.- After havto be condemned to purgatory. ing announced to Baltimore Street<br />\nWith the black hearse, the sulphur and the environs that Hopkins was<br />\nfumes of the flares, and the singing present and that St. John's was the<br />\nof \"Hopkins Will Give You _Hell, object of the ritual, the high priests<br />\nHell, Hell!\", the thought of the in- proceeded to successfully conclude<br />\nfernal regions was not absent from the matter. St. John's in effigy was<br />\nthe minds of the annihilators.<br />\ndragged forth from the hearse and<br />\nHopkins, staid and conservative there at the Sim Square was conenough throughout the year, be- sumed by flames. While ihe-spirit<br />\ncomes boisterous and noisy when was being burned and descending to<br />\nSt. John's is the object of its wrath, the Inferno, the band played an apand must need let the city at large propriate funeral-dirge.<br />\n<br />\nFor quite a number of years it<br />\nhas been customary for Hopkins to<br />\ndoubly annihilate their ancient rivals, St. John's. One annihilation<br />\nthat of the spirit, takes place on the<br />\nnight preceding the game; the other<br />\noccurs the next day, when the Blue<br />\nJay eleven usually proceeds to annihilate the Crabtowners in the body.<br />\n<br />\nLight Lunch<br />\n5 W. Twenty-first St.<br />\nOpen 9.30 A. M. to Midnight<br />\n<br />\nCONGRATULATIONS TO THE JAY<br />\nHEN the Black and Blue Jay announced a change in editorial<br />\npolicy for the coming year, the snickers of the campus cynics<br />\nwere heard on all sides. These chronic pessimists commenced to nudge<br />\neach other and smile: The Jay. they told each other, had always been<br />\na glorified Capstans Billy's Whiz-Bang and could never be anything<br />\nelse. However, with the first number of the rehabilitated campus<br />\ncomic, the prophecies of the smart,alecks have failed to materialize.<br />\n<br />\nW<br />\n<br />\nThe Jay staff may well be proud of their first issue. The editorial<br />\ncopy is good, the illustratiorls are well executed, the typography is<br />\nexcellent. The pages and pages of \"he-she\" jokes are, we are glad<br />\nto report, a thing of the past. In their places, are poems, stories and<br />\narticles of general interest.<br />\nOur esteemed colleague, Mr. Kolb, hammers his typewriter to<br />\ngood effect and hurls several verbal brick bats at the once famous<br />\nTudor and Stuart Club. Kolb's slashing denunciation certainly shows<br />\nthe literary club in a had light. Perhaps, a couple of sticks of dynamite would awaken the literati from their drowsy lethargy.<br />\nThe new Jay meets with our unqualified approval. To the staff,<br />\nwe offer the heartiest congratulations and best wishes for continued •<br />\nSUCCOR.<br />\n<br />\n35th 6' St. Paul Sts.<br />\n31st 6' St. Paul Sts.<br />\nSafe and Efficient Service<br />\nPassengers<br />\nNo Charge for Extra<br />\n'PHONE<br />\n<br />\nAlgebra-zGeometry—Trigonometry<br />\nWILLIAM H. JOLLY<br />\n2706 Gwynn Oak Ave.<br />\nTel. Woodlawn 276.W<br />\n<br />\nto HARBAUGH Ei BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nMaryland<br />\nBaltimore<br />\n<br />\nPLANTATION<br />\n<br />\n1506-1508 Guilford Avenue<br />\n<br />\nVERNON 1 21 2<br />\n<br />\nBaltimore,<br />\n<br />\nFOR A<br />\n<br />\nIa.<br />\n<br />\nPhone VErnon 1691<br />\n<br />\nYELLOW CAB<br />\n<br />\nStep Out From The Crowd!<br />\nBe an exception—Be a Successful Somebody<br />\nWith a Savings Acpunt you are on the highroad<br />\nto succus—Opportunity waits beyond.<br />\n<br />\nPARK BANK<br />\nLexington Street at Liberty<br />\nNorth Avenue at Charles<br />\n4819 Belair Road at Southern<br />\n<br />\neAn Invitation<br />\nTo the Johns Hopkins students we extend a cor,<br />\n- -dial- invitation_to come in and __see our beautiful<br />\nhand-wrought Jewelry, our'importations of ancient<br />\nand modern gifts. Prices very moderate.<br />\n<br />\nCARL SCHON, INC.<br />\n109 W. SARATOGA ST.<br />\n<br />\n\"Friend of the Hopkins Man\"<br />\n<br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STI-t'BECer<br />\n\"On the Route of the'rEaries Street Bus\"<br />\n<br />\nSI<br />\n<br />\nstimulatingdelightful<br />\nthe New Fall Books!<br />\nYou'll find tows and rows of them—brand-new books in bright<br />\ncovers—smelling pungently of printer's ink and crisp paper--fictiona<br />\nthy, science—awaiting your choice at our two stores<br />\npoetry, bigir,<br />\n<br />\nTHE NORMAN,REMINGTON CO.<br />\nDown-Town:<br />\nCharles St. at Mulberry<br />\n<br />\nUp-Town:<br />\n<br />\n1118<br />\n<br />\nNorth Charles St.<br />\n<br />\nE<br />\nmin<br />\n<br />\nCOMMUNITY INN<br />\n<br />\n- GWYNN LEASE<br />\nOrchestras- of Distinction<br />\n1944 EDMONDSON AVENUE<br />\nPhone Garnor 6886<br />\n<br />\nE. E. ADAMS<br />\n<br />\nSTABLIKO<br />\n<br />\nS<br />\nE<br />\nCHARTS<br />\nSERVICE<br />\n<br />\nad<br />\nme<br />\nCit-t to Oil<br />\n;_S<br />\n<br />\nEINM ISF4J.INIVtRSITY<br />\nVER YOUTHFUL<br />\nISTiNGUISHED<br />\nSTATES.<br />\n<br />\n--oda<br />\n<br />\nBARN CAFETERIA<br />\n<br />\ncMANNIE (BERG<br />\n\"The Old Boy Himself\"<br />\nTrade<br />\n<br />\nMark<br />\n<br />\nReg.<br />\n<br />\nCol4iate Furnishit*s<br />\n<br />\nCollege Men!<br />\n<br />\nNORTH AVE. MARKET<br />\nNORTH.6? MARYLAND<br />\n<br />\nAVEs.<br />\n<br />\nPhone HOmewood 7908<br />\n<br />\nIn style and quality \"Bostonians\"<br />\nequal the most expensive footwear<br />\nproduced today. .<br />\n<br />\nST. PAUL at 33rd STREET<br />\n<br />\nYour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br />\n<br />\nrz=r1L<br />\n<br />\nAPPOINTMENT<br />\nOUR STORE IS THE<br />\n<br />\nOF BALTIMORE<br />\n<br />\nMostly $7.50 to $10<br />\n<br />\novercoats tailored by Charter House<br />\n<br />\nThe character of<br />\nwill<br />\n<br />\nExclusieely in<br />\n<br />\nBaltimore'<br />\n<br />\nBOSTONIAN<br />\nSHOE STORE<br />\n112 E. Baltimore Street<br />\n<br />\n-u<br />\n<br />\n114rter housel<br />\n<br />\nAnd the saving is a big item.<br />\n<br />\n(13ire1y's Pharmacy'<br />\n<br />\nTH<br />\n<br />\nThomas & Evans<br />\nPrinting Company<br />\n<br />\nSuccessor<br />\n<br />\nWe 'haven't<br />\n<br />\nBut there will be another St. John's game'again next year. There<br />\nwill be another parade down Charles Street and another burning •<br />\nof an effigy. Then perhaps, when the sun sinks behind the Wyman<br />\nPark woods, the sccire board will tell another story.<br />\n<br />\nHomewood Field<br />\n<br />\nHome—HO. 2091-i<br />\n<br />\nFRANCES T. BANNON<br />\n<br />\noutplayed.<br />\n<br />\nany excuse to offer for the overwhelming defeat<br />\nof the Blue Jays. Like as not, there is no alibi available. St. John's<br />\nplayed an inspired game. They .have a scrappy, aggressive, fighting<br />\n.<br />\n•<br />\neleven, and deserved to win.<br />\n<br />\nNewspaper.<br />\nCommercial<br />\nBooks<br />\nWork<br />\nEstablished 1880<br />\n<br />\nAT<br />\n<br />\nTUTORING<br />\n<br />\nFRANK'S<br />\n<br />\nPhone, CAL 1380<br />\n<br />\nknow<br />\n<br />\nYELLOW CAB STA14DS<br />\n<br />\nthe suits<br />\n<br />\nand<br />\n<br />\nearn your most sincere liking.<br />\n<br />\nDe<br />\n<br />\nHub<br />\n<br />\n11 -1:ri<br />\nBaltimore. Cherie., and Fayette<br />\n<br />\nONO<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1928<br />\nPhone CAlvert 5975<br />\n<br />\nI<br />\n<br />\nIncorporated<br />\nManufacturer of<br />\n<br />\n(RUBBER STAMPS<br />\nThe Service shop<br />\n319 W. Redwood St.<br />\nBOOKS<br />\nBOUGHT, SOLD<br />\nand EXCHANGED<br />\nPippen's Book Store<br />\n605 N. EUTAW ST.<br />\n<br />\nTHE SOUTHERN<br />\nHOTEL<br />\nBaltimore's Newest<br />\nand Finest :•:<br />\n\"A Hotel of Atmosphere<br />\nmui Enviremsent\"<br />\n<br />\nContinued from -Page 4, Cot. 2<br />\n<br />\nances, for within him burned the<br />\nsacred flame that was to influence<br />\nhis life. At eighteen he started to<br />\nkeep a diary. He had heard that<br />\nBenjamin Franklin kept one and he<br />\nfollowed this example. It has not<br />\nbeen published but is,a most interesting and instructtve document.<br />\nIt seems that when he wanted to'clo<br />\ngood he was always alone, when he<br />\nwished to do something bad he was<br />\nsurrounded by friends. One of the<br />\nrules he made at this time is, 'when<br />\nyou are thinking use always all the<br />\npower of your brain.' If my father<br />\nachieved greatness it was because<br />\nhe used all the power of his brain<br />\nwhen thinking: He also says, `It is<br />\nbetter to do nothing at all than to<br />\nbe busy 'doing nothing.' This my<br />\nfather followed all his life.\"<br />\nAfter Tolstoy's military career<br />\nand his Sebastopol letters, Tourgenif declared \"Now we have a writer<br />\nwho is niit afraid to tell the truth.\"<br />\nNow Tollt!y traveled in Western<br />\nEurope tg ,k'udy education. Not<br />\nlong ate,k his return'atthirty-five<br />\nTolstoy married and settled down<br />\nat his country estate.<br />\n<br />\n11 E. North Avenue<br />\nVernon 2704<br />\n<br />\nI<br />\n<br />\nThe<br />\nlargestselling<br />\n<br />\nQUALITY<br />\npencil in<br />\nthe World<br />\n<br />\nSend$1•<br />\n<br />\nfor sample box ofa<br />\ndozen assorted styles<br />\n<br />\nANIERICAN PENCIL CO., Dept.D46 Make.,N.J.:<br />\nMakers of UNIQUE To.,Lead Colored<br />\n1.120 per doz.<br />\nPersc4.—lasalorr—$)<br />\n<br />\n•<br />\n<br />\nDR. EDDY SPEAKS<br />\n<br />\nTOLSTOY SPEAKS<br />\n<br />\nTHE CHARLES E. MYERS CO.<br />\n<br />\n\"The first fifteen years of my<br />\nfather's family life were years of<br />\nunclouded happiness. My father<br />\nwas busy writing and took an active<br />\npart in the education of his children.<br />\nMy mother cared for hew thirteen<br />\nchildren and managed' 'the large<br />\nhome and was a secretary to my<br />\nfather—a very difficult position....<br />\nas a matter of fact, she copied War<br />\nand Peace and Anna Karanina eight<br />\ntimes in all. Some things she had<br />\nto copy over a hundred times.\"<br />\nIn the rest of his talk Count Tlstoy told about 'his father's home<br />\nlife, his ;eat period of moral difficulty, and the search for a satisfying religion.<br />\n<br />\nYOU'LL LIKE BOWLING ,AT THE<br />\n\"<br />\n'ARCADE<br />\nATOP NORTH AVE. MARKET<br />\n\"<br />\n72/ ALLEYS<br />\nBowling Keeps You Fit!<br />\n<br />\nINTER COLLEGIATE<br />\n- NEWS - B. B. Jones, Mississippi philanthropist, has sent some carloads of<br />\napples to the suffering students of<br />\nthe state from his plantation in Virginia.. Blue Mountain College, Mississippi Synodical College, Holly<br />\nSprings, Delta State Teachers College, and Grenada College were the<br />\nbeneficiaries.<br />\nAt least one of them should give<br />\nthe worthy Mr. Jones an LL. D., or<br />\nat least some Mississippi applejack.<br />\n<br />\nContinued from Page 1, Col. 1<br />\n<br />\nFIDELITY AND DEPOSIT CO.<br />\n<br />\nting\" can be in some cases a perfectly legitimate and ethical<br />\nmeans of sex expression. An engaged couple, for instance, have a<br />\nperfect right to express themselves to each other through the<br />\nmediums of their, love. Petting<br />\ncan be as beautifully ideal and<br />\nsacramental as intercourse between man and wife if accompanied by mutual love and mutual<br />\nfeelins. If the thing is merely a<br />\nsuperficiality there is no mutuality of feeling and there is riethical justification.<br />\n<br />\nof Maryland<br />\n<br />\nProgress of the higher learning<br />\nin Kansas Wesleyan University, as<br />\nreported by the accurate Wesleyan<br />\nAdvance: \"'I do not believe,' says<br />\nDean. King, 'that the teaching of<br />\npenmanship is practical.'\"<br />\n<br />\nDr. Eddy also brought out that<br />\nunder certain circumstances Companionate Marriage was justified.<br />\nHe showed the case of a ppor<br />\nyoung man and woman who love<br />\neach other dearly, but cannot afWe are 'pleased to report that the ford matrimony. If they wait for<br />\nWellesley College girls have at last 10, perhaps 15 years they are<br />\ntaken to pure sports, to: wit/ hoop- passing by the best years of theit<br />\nrolling. And now the epidemic has lives, and to satisfy their natural<br />\nspread to Dartmouth, where the<br />\nder.ires.theinan will in most cases<br />\nfreshmen have been obliged to roll<br />\n.lower himself to a prostitute and<br />\nhoops around the solemn and anci-,<br />\nunhappiness and ruined lives are<br />\nent town of Hanover.<br />\nthe results. Dr. Eddy assailed<br />\nAt Smith College, ihey are giv- fiercely the terrible, conventionaling courses in beauty culture to pro- istic laws, whereby a mother was<br />\nduce beautiful students. At Vas- forbidden by the state under pensar they ,are giving courses to proimprisonment and fine to<br />\nduce beautiful homes. Which is alty of<br />\njust another argument in favor of possibly save her life by taking<br />\nthe advice of her physician and<br />\npolygamy.<br />\navoiding the deliverance of anBLUE JAYS LOSE TO<br />\nother child. She is also proseST. JOHN'S ELEVEN<br />\ncuted for merely, advising her<br />\nContinued from Page 1, Col. 6<br />\ndaughter to spare her health by<br />\nLine-up:<br />\nSt. John's<br />\nHopkins<br />\ncontrolling the number of her<br />\nMcLean children.<br />\nLove<br />\nLE<br />\nO'Connor,<br />\nKeating<br />\nL.T<br />\nL.G.Jones<br />\nTobin<br />\nThere will be one junior<br />\nStrader (Capt.)...C.(Capt.) Turner<br />\nand one sophomore added<br />\nMorris<br />\nR.G<br />\nKegan<br />\nto the membership of the CoKeller<br />\nBialoskorsky ...R.T<br />\ntillion Board. Any one de- Smith<br />\nRE<br />\nsiring to be considered will<br />\nRosenberg<br />\nplease be present at the<br />\nQ.B<br />\nCasassa<br />\nLyons<br />\nmeeting on Friday, NovemR.H<br />\nW. Lynch<br />\nBesore<br />\nber 23, at 12.20 in Room<br />\nArtnacoSt<br />\nL.H<br />\nMills<br />\n114, M. E.<br />\nSpring<br />\nF.B<br />\nCaplan<br />\n<br />\nHOPKINS ALUMNUS<br />\n<br />\nHE'S<br />\n<br />\nAll Lines of Insurance<br />\n<br />\nGROUND FLOOR, FIDELITY BLDG<br />\nD. C. HANDY,<br />\n<br />\nPhone PLaza 0800<br />\n<br />\nManager<br />\n<br />\nDECORATIONS<br />\n<br />\nINTERIOR %)OD WOR1C<br />\n<br />\nJOHN C. KNIPP ei SONS<br />\nFURNITURE<br />\nBALTIMORE. MD<br />\nShow Rooms<br />\n343 N. Charles Street<br />\n<br />\n, Factory<br />\n606:-&-puluki Street<br />\n<br />\nNiiBiiih<br />\nanlik-YashionedOxfordi<br />\nwear,the Tummo<br />\n—a Nunn-Bush Ankle-Fashioned plain toe patent pump.<br />\nAlso in Dull Calf.<br />\n<br />\nFOR formal<br />\n<br />\nTHIL<br />\n<br />\nUMITYOHOP<br />\nCollar Hu Clothes<br />\nDaft/mare<br />\n<br />\nnt.ni-AED<br />\n<br />\n,..ta<br />\n<br />\nobelystmett<br />\n<br />\nBy BRIGGS 1<br />\n<br />\nNOT A COU41-4<br />\nWu A CAR.L.OAD<br />\nHARRY, V1/4-11-4Y<br />\nDON'T You<br />\nGET vvt5E<br />\nTo THErs1<br />\n<br />\nBY COUGH'<br />\n<br />\nPhone, Plaza 1062<br />\n<br />\nBALTIMORE BRANCH OFFICE<br />\n<br />\nrWhen a Feller Needs a Friend<br />\n$ THE<br />\nFIFTH PLATE<br />\n<br />\nFORDYCE E. C. CAMPBELL<br />\n<br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br />\n<br />\nFoR GOODNESS<br />\nSAKE, GivE<br />\n\"Na<br />\n<br />\nOLD GOLD<br />\n<br />\nEt rHER HE<br />\nSWEARS HE'LL<br />\nSTART<br />\n3MoK.11.44<br />\nOLD GOLDS<br />\nOR HE SThys<br />\nOUT<br />\n<br />\nJ. A. RITTER. El SON,<br />\nFlorists and Decorators<br />\nBALTIMORE, MD.<br />\n<br />\n19'18 N. CHARLES ST., Near 20TH.<br />\nPhone, VErnon 0573<br />\n<br />\nTHE GIANT<br />\n<br />\nESSO<br />\n<br />\nPOWER FUEL<br />\n<br />\nNEW -LIFE<br />\nFOR MOTORS<br />\n<br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br />\n<br />\nSTANDARD OIL—COMPANY OF N.<br />\n<br />\neA. H. FETTING<br />\neNIANUFACTURING JEWELRY CO.<br />\n<br />\nPc4-47f,<br />\n<br />\nManufacturers<br />\n<br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br />\n<br />\nHENNEGEN-BATES COMPANY<br />\nJewelers<br />\n<br />\nand Silversmiths<br />\n<br />\nsince<br />\n<br />\nDRESS SETS<br />\nfor evening wear'7 and 9 East Baltimore Street<br />\n<br />\n1851<br />\n<br />\nOF<br />\n<br />\nTHE PICTURE<br />\n<br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br />\n<br />\n«<br />\n<br />\n,<br />\n<br />\nGOLD<br />\nOLD<br />\nThe Smoother and Better Cigarette<br />\nnot a cough in a carload<br />\n0?.Lorillard Cs,Bat. 570<br />\n<br />\n\f1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20,<br />\n<br />\n4<br />\n<br />\nFlat Tire<br />\nCall Barry<br />\nVernon 4183<br />\n<br />\nHOOD TIRES<br />\n-We Hurry\"<br />\n<br />\nFLARE-UP PROVIDED BY<br />\n'COUNT ILYA TOLSTOY TRIPLE<br />\nEDDY, SEX, AND COLORED LIGHTS<br />\n!Tireworks to the right 'of hint, group of highly* condescending<br />\nADDRESSES MEETING fireworks<br />\nto the left of hint.\" To Juniors and eniors willing to sacriSon of Russia's Famous Writer<br />\nIs Adopted American<br />\nC. E. HALL CROWDED<br />\n<br />\nLeavesTobacco<br />\nTin as All-time<br />\nCalling Card<br />\nCalgary, Alta.,<br />\nMarch 4, 1928<br />\n<br />\ntLarus & Bro. Co.,<br />\n'Richmond, Va.<br />\nV. S. A.<br />\n'Gentlemen:<br />\nWhile in Banff, Alberta, in 1909, I<br />\ntlimbed Tunnell Mountain. On top of<br />\nthis mountain there is a elfin of stones<br />\nwhere tourists leave their cards with<br />\nremarks about the scenery, etc. Not<br />\nbating a card with me., I Ieft a tin of<br />\nEdgeworth Sliced', scribbled my name<br />\nand address on a piece of paper, and<br />\nsaid. \"Have a fill on me.\"<br />\nI have kept up a haphazard correspondence with one of three who wrote<br />\nme thanking me for the Pipeful of<br />\nEdgeworth. What makes me write<br />\nyou is that today from Australia I<br />\nreceived two SliCef,of Edgeworth with<br />\nthe words,\" Have a fill on me,\" so you<br />\nsee Edgeworth keeps friends friendly.<br />\n,Yours sincerely,<br />\nP. B. Johnstone<br />\n<br />\nEdgeworth<br />\nExtra High _Grade<br />\n<br />\nSmoking Tobacco<br />\n<br />\nCOLLECT TWICE<br />\nIf you could talk with the hi; men and<br />\nthose who convey that .ery attitude whom<br />\nwe tailor, you'd understand what it's all<br />\nabout. To look at him might sufice be.<br />\ncause of the charm and personal4ty we_<br />\nbuild in his clothes.<br />\nWe will do the same for you and include<br />\n• quality in the cloth and construction<br />\nthat will outwear two dollars spent any<br />\nother way. You collect twice on every<br />\ndollar with us.<br />\nTWO GRADES ONLY<br />\n<br />\n$28.75<br />\n<br />\n$38.75<br />\n<br />\nWILLARD TAILORING CORP.<br />\n120 West Fayette St.<br />\nPint<br />\n<br />\nFloor<br />\n<br />\nLUKE 1111tVIN4<br />\nA UODY IV<br />\nFISHEIR<br />\n<br />\nNecks by request...,<br />\nThe lines and grace<br />\nof a Braeburn Prom<br />\nTHK, have an ele-<br />\n<br />\ngance equalled only<br />\nby the finest.<br />\nThat it is forty<br />\ndollars is your<br />\ngood fortune.<br />\nCloduers and Halxrdasheys<br />\n<br />\nTuIrlIEL131EIRT...<br />\n17 E Baltimore St.<br />\n<br />\nMany Stand to Hear Talk on<br />\n\"Tolstoy and Russia\"<br />\n\"The great advantage the United<br />\nStates has received front Bolshevism is that it has given us the 'eminent son of Tolstoy. That he has<br />\nbecome a thorough American can<br />\nbest be.shown from his own words.<br />\nWhen I met him a little while ago<br />\nI said I should surely recognize him<br />\nfrom the portraits of his father to<br />\nwhich he replied \"It cotslcle.lnly have<br />\nbeen I or one of the Smith Brothers<br />\nthat made the cough drops.\" With<br />\nthese words of introduction Dr.<br />\nLancaster presented Count Ilya Tolstoy to a most appreciative audience<br />\nwhich crowded the C. E. Hall last<br />\nThursday. The reference to *hirsute -adornment provoked _much_ applause..<br />\n• Hundredth Anniversary<br />\n\"The whole world was celebrating<br />\nthe hundredth anniversary of the<br />\nbirth of my father this year. My<br />\nfather was born September 18.<br />\n1828. It is hard for us to realize<br />\nthe condition that prevailed in this<br />\ncountry and in Russia at that time.<br />\nThey did not know matches or kerosene, there were no railways and<br />\nthe telegraph and telephone had not<br />\nbeen invented, there were no automobiles. They were living in the<br />\nmost primitive conditions. I ant inclined to think that-living in their<br />\nprimitive way they were much more<br />\nhappy than we are With our electricour telephones,--our poison gas.<br />\nMy father was born underthe reign<br />\nof Nicholas I at a time When slavery<br />\nwas a very common thing and men<br />\nand women were bartered for<br />\nhorses or cattle, or a trained bear.<br />\nSoldiers were flogged to death in<br />\nthe 'Army.<br />\n<br />\nRequired<br />\n<br />\nNo Deposit<br />\nfice a bit of their valuable time and<br />\nUniversity Students<br />\nhard earned (?) money for \"dear .<br />\nof Johns Hopkins<br />\nold Johnny Hopkins.\"<br />\nLight and Loom<br />\nBuicks<br />\nSide by' side with these were the<br />\nhard Sts.<br />\nthe<br />\nin<br />\nfireworks<br />\nmoral And mental<br />\nChevrolets ,<br />\nPLaza 6000 •<br />\nform of ,Dr. Eddy's little pamphlet<br />\n1723-25 N.<br />\nChryslers<br />\nCharles St.<br />\non Sex and Youth. Selling for fif4049<br />\nVEmOn<br />\nHupmobiles<br />\nteen cents apiece or thrdel for a<br />\n2402 Pennsylquarter,• these ...little pamphlits disWillys-Knights<br />\nvania Ave.<br />\nthe<br />\n'Had<br />\ns.<br />\nappeared Re--NM:take<br />\n.<br />\nLAfiyette 2000<br />\nanti-militaristic<br />\npacifistic ,- and<br />\nBaltimore Concedes Milestone Supremacy<br />\nspeaker of the morning been able to<br />\na '<br />\nsee the .proceeds taken up in an<br />\nR. 0. T. C. cap his hair would have<br />\nrisen up on end in the,,most apThen came the actual fireworks. proved Harold Lloyd manner. BeOn the platform at the rear end of fore long - the. st*k.--had. been exthe hall were sold the red and green hausted and the youth of the camflares by the light of which St. pus Was devouring about thirty dolJohn's is to be banged. drawn and lars' worth of SZ,x. Rumor has it<br />\nquartered—in efffgy. Green= tied that three of the most prominent<br />\nFrosh urged by Johnnie Norris' an- members of the \"Y\" Cabinet had to<br />\nnouncement of Student Council'en- ekertiall.their \"Pull\" to•get the last<br />\nforcement were seen purchasing the trio of copies. Thus with three<br />\nneceSSity -fliteK More sal-ASH-tared kinds of fireworks -iinloaded On the<br />\nSophomores. \"invited\" as their vetstudents by eve, ear and hand: the<br />\ndarn hued rivals by some hard, inof one exciting morning was<br />\nepic<br />\ndiscriminate fate, also-Purchase-EV<br />\nThen. complete. A hot time was had by<br />\nSupply ..,of pyrotechnics.<br />\nmirabile dictu, appeared a small all.<br />\n<br />\nignobly paraphrase Tennyson's famous poem (with customary apologies to the original) these words<br />\nmight well describe the feelings of<br />\nthose Who attended last Thursday's<br />\nassembly. First came the verbal fireworks in Dr: Eddy's highly Charged<br />\naddress. Birth Control,'petting, the<br />\nmail censorship laws, and many<br />\nother sex problems kept a crowded<br />\nassembly hall listening for something they did not get. The thrill<br />\nhunters wfre disappointed but the<br />\nthOughtfvfl student had found something to think about.<br />\n<br />\nenyou use the<br />\n<br />\nJAY HARRIERS WIN FIFTH<br />\nPLACE IN MIDDLE STATES<br />\nSchiebel Finishes Third; Se en<br />\nColleges Enter Tea<br />\nJohns' I lopkins. cr, — country<br />\nteam placed fifth in the Middle Atlantic States Intercollegiaie Championships in Van Courtland Park.<br />\nNew York City. Herman Schiebel<br />\nof Hopkins won third place„being<br />\nthe first Tay, to finish. The, next<br />\nBlack and Blue runner was Miller',<br />\nwho finished twenty-seventh. Kelly<br />\nWas thirtieth. Emerson thirty-fifth.<br />\nOnaratp.,thirty-ninth. l_oiseaux forty-Erst,,and Waters-isixty-first. The<br />\nteam scre4.was 113.<br />\n<br />\nRemington<br />\nPortable<br />\n<br />\nCONFERENCE IS HELD BY<br />\nENGINEERING SCHOOL<br />\nImpregnated Paper Insulation Is<br />\nSubject<br />\n<br />\nW<br />\n<br />\nContinued front Page t, Col. 2<br />\n<br />\nITER'S cramp may sound<br />\nlike a joke to some, but to the student<br />\nwho has spent several long hours<br />\nwriting a thesis or report by hand, it<br />\nlooms as a very real malady.<br />\nEliminate the drudgery and slowness<br />\nof writing by hand-'-get a Remington.<br />\nPortable.' Your work will be neater<br />\n.. and you'll get it done far more quick(y.<br />\nRemington Portable is the smallest,<br />\nlightest, most compact and most dependable portable with standard keyboard. Carrying case only 4 inches<br />\nhigh. Weighs (02 pounds, net,<br />\n<br />\nThe basic technical session began at ten. Various electrical experts gave reports, and conclusions which they had reached.<br />\nAmong these, the Most interesting, were t-ss:o reports on \"The<br />\nStudy of Mechanism of Cable Deterioration,\" given by C. F.<br />\nHershflkl; -Detroit Edison Co.,<br />\nanclsorie on \"Public Utilities and<br />\nResearch', by \", D. W. Roper Of<br />\nCommonwealth Edison Co.<br />\nLuncheon<br />\n<br />\nLuncheon was thenlield ih the<br />\nAllred University won the team AlumniThlemotial Dormitory. At<br />\n, 'Descendants of First King<br />\nchampionship and New York<br />\n2.30 P. M. the discussions were<br />\n\"The Tolstoys came tovR,ussia in<br />\nversity.took tirst,and second places:- resumed: Professor'. Whitehead<br />\nabottt the fourteenth century.' The<br />\nU. covered then gave a' description of the<br />\n'Nat Lerner -of N..<br />\nancestors of my father's- mother<br />\nthe six-mile epluse in thirty--one work in progress at Hopkins in<br />\nwere direct descendants of the first<br />\nminutes-and. eighteen seconds. Phil the laboratories of Electrical EnRussian King. In the big hall of<br />\nEdwards. negro stab of the same gineering. The entire group then<br />\nYasnaya-Polijana hung many picUniversity; finished twenty yards inspected the work being done at<br />\nOne<br />\nancestors.<br />\nfather's<br />\ntures of my<br />\nbehind him. Schiebel came in third.<br />\npicture was of my father's grand- while Getz and Z. Schley of Alfred, Hopkins at the present time. Friday night all the members of the<br />\nthe<br />\nat<br />\nfather, who was prominent<br />\ntook fourth and fifth prizes. Sixth,<br />\ncourt of Catherine the Great. He seventh, eighth, and ninth places conference met for dinner at the<br />\nquarreled with the Empress and Rothmann Boulton, Marps, and Belvedere. At eight-fifteen that<br />\nthen retired to his country home. Brown, all of Alfred. The score night the majority alfrithe scienThere he educated his two daugh- by teams gave Alfred first place tists attended the meeting at the<br />\nters. In his picture his eyebrows with thirty-three points: New York Engineers' Club of the Baltimore<br />\nwere thick and his eyes so piercing U. second with forty-six: Lafayette section of the A. I. E. E. Mr. D<br />\nthat I, as a child, was quite afraid third With eight-nine: Union fourth H. ROwland. research engineer of<br />\nof him. fo'r be seemed to watch -with a hundred and four : Hopkins the Locke Insulator Corporation.<br />\nwas the guest of honor,<br />\nAnother<br />\nmy verf movements.<br />\nfifth • with a hundred and ,thirteen:<br />\nDiscuision Continnii. r of my 'father had his Rutgers sixth with a hundred and.<br />\ngiandfathe<br />\nA continuation ,of the disctt.,.<br />\nportrait there: he was the antithesis eighteen, and Lehigh last with a<br />\nsion of the research reports was<br />\nof the first. He spent .his fortune hundred and twenty-seye.<br />\nbegun at 9.30 Saturday morning.<br />\nentertaining his friends and guests.<br />\nEdwards-Versatile<br />\nHe had the idea, as some do nowOne of the peculiar event.: Three discussions of importance<br />\nadays that domestic articles were which occurred in the running of were held at this time. The first<br />\n. a discusSion on \"The Supprestticin<br />\nworthless and desired every thing the race was.the placing of Phil F41-imported. He would wear his linen wards of N. Y. U. second. If there of Edge Effect in Breakdown<br />\nonly if it were laundered in 14°1- was ever a More versatile track man Tests and Its Consequences.\"<br />\nSo-lie sent to Holland on than Edwards, he has ..0t bekn was given hy-Prof-V-- -Bush- of<br />\nhorse and 'on the way through heard of. Starting iikff his college the Massachusetts 'Institute of<br />\nCharnpaigne the rider bought rare career in sprints, he gradually work- Technology: It was very well re- I<br />\nwines, and in Bordeaux, Reni Wine. ed up to. middle distances. Last ceived. \"The Losses in Solid Di- 1<br />\nand the lovely glassware of Bo- year he \"ian Away\" with both the electrics and in Ionized Gas<br />\nhemia. His Men traveled all he 440 and -880,itt the Middle State Films\" was the second report.<br />\nyear around for there was always Championships. Shortly after this given by C. L. Dawes of Harvard.<br />\nlinen to be laundered.<br />\nhe was selected for the Canadian The last report was rendered by<br />\nteam and at Amsterdam Prof. E. B. Paine of the UniverOlympic<br />\n\"Ms- father's parents died when he<br />\n,<br />\nover the \"Nebraska Fly- sity of Illinois.<br />\nvictor<br />\nwas<br />\nwas quite young. His mother died<br />\nTwo research committees then<br />\nyear,crossThis<br />\nHahn.<br />\nLloyd<br />\ner,\"<br />\nwhen he was two and his father<br />\nheld their sessions. The most imwhen he wag nine, and . he was country*has been added to the list<br />\nportant was a meeting of the<br />\nbrought up by a distant relative. I of his accomplishments. •<br />\nThere was some slight protest due committee on Electrical Insularemember her when she was about<br />\nB. Whitehead was its<br />\nseventy. I was about six 'when she to alleged cutting of curves but no tion. J.<br />\naction was taken. The Van Court- chairman. It summed up the<br />\ndied.\"<br />\nland course is three miles long and chief work and aims of the con\"After slight success at the Uni- was covered twice. The start \"and ference. The committee then adversity, Tolstoy retired to Yasnaya- the first mile are on level ground. journed after holding luncheon<br />\nPolijana. where he lived rather a In the Second mile there is a high in the Alumni Memorial Dormidissolute life with his friends. He hill and the third mile is on level tory.<br />\nenjoyed cards and drinking, life was ground again. The Hopkins squad,<br />\neasy. The days were 'N‘rein, Vsreib consisting of seven men, and Coach<br />\nHambleton,left Baltimore Friday<br />\nund Gesang.'<br />\nafternoon. The meet took place<br />\n\"To all outward appearances he Saturday. and some of the team rewas just a wealthy country gentle- turned that night: the remainder<br />\nBALTIMORE<br />\nman. I say to all outward appear- staying over until late Sunday.<br />\n<br />\nCash or convenient terms.<br />\n<br />\nAlfred U. Wins<br />\n<br />\nY.<br />\n<br />\nThe READ TAYLOR CO<br />\nADVERTISING<br />\n<br />\nREMINGTON RAND<br />\nBUSINESS SERVICE, INC.\",<br />\n<br />\n--<br />\n<br />\n130 W. Payette Street<br />\nBALTIMOREAMD.<br />\n<br />\nw(<br />\nin<br />\n<br />\nP,<br />\nco<br />\nth<br />\nen<br />\nI;a<br />\nde<br />\n<br />\n-<br />\n<br />\ntw<br />\nre:<br />\nGo<br />\nsk<br />\nlit<br />\ns Le<br />\n0'<br />\nen<br />\n<br />\nIs<br />\nho<br />\nan<br />\nitti<br />\n<br />\nRo<br />\nto<br />\na<br />\n'Th<br />\neig<br />\nof<br />\nSb<br />\nsOt<br />\nF1,<br />\ndot<br />\nart.<br />\ntea<br />\nthe<br />\nrep<br />\n<br />\ntea<br />\nsot<br />\n<br />\nmut<br />\nthe<br />\n\\I<br />\n•it•<br />\nan,<br />\nre,<br />\n<br />\n.<br />\n<br />\n--<br />\n<br />\nTHE CURRENT .<br />\n,TYLES<br />\nCLOTHES, HA TS,...V110:-.T<br />\nAND HABERDASHERY<br />\nFoR<br />\n...LOUNGE,'SPORTS .4ND<br />\nCAMPUS USAGE<br />\n<br />\nWILL BE<br />\n<br />\nEXHIBITED I '.X.x.24,.c TOWN<br />\n0.V DATE GIVEN<br />\nBELOW.<br />\nYOU ARE<br />\nCORDIALLY<br />\nYlTtij TO<br />\n<br />\n'v.<br />\n<br />\nA TTEND.<br />\n<br />\nAt<br />\nSTUDENT BOOK STORE<br />\n1818 E. Monument St.<br />\n<br />\nFriday,' November 23rd.<br />\n<br />\nHarry Schein, Rep.<br />\n<br />\nNZSV YO.<br />\nJACES01,4 ZOO aaaaa<br />\n<br />\nii,exidwoo<br />\n<br />\nth,<br />\n. mit<br />\n-tt.t<br />\n<br />\ntan<br />\nmet<br />\npalI•<br />\nclot<br />\n<br />\nden<br />\nrus<br />\nthe<br />\nsity<br />\ngan<br />\n<br />\nany<br />\nfew<br />\nver<br />\nson<br />\nball<br />\nthe<br />\nspe,<br />\nthe<br />\npeel<br />\ncoil<br />\nfact<br />\ngetl<br />\neau<br />\nthei<br />\nten<br />\n<br />\nat t<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXXIII, No. 15<br /><br />\nDR. EDDY SPEAKS<br />\nAT ASSEMBLY<br /><br />\nHOMEWOOD,BALTIMORE, MD., NOVEMBER 20, 1928<br />\nE. G. BAETJER NAMED<br />\n- TO BOARD OF J. H. U.<br /><br />\nNEW ISSUE OF BLACK AND BLUE<br />\nJAY IS FAVORABLY RECEIVED<br /><br />\nPRICE 5 CENTS<br />\nBASKETBALL CANDIDATES<br />\nTO REPORT THURSDAY<br /><br />\nBLUE JAYS LOSE TO<br />\nST. JOHNS ELEVEN<br /><br />\n_ Thursday, following the asThe first issue of the Jay has ex- campus are introduced in this issue<br />\nsembly, the basketball squad<br />\ncellent material. It is noticeably and and add to the intrinsic value of the<br />\nJay Team Plays Listlessly<br />\nWell-known Author Talks on<br />\nwill hold its-organization meetnotably different from all issues Jay.,<br />\nThroughout Game<br />\n\"Sex and Youth\"<br />\ning in the C. E. Hall. Coaches<br />\nAnother feature of the magazine<br />\nheretofore published, but most of<br />\nRay.<br />\nVan<br />\nOrman<br />\nand<br />\nGeorge<br />\nLINE<br />\nLACKS POWER<br />\nabundance<br />\nof<br />\nadis<br />\nthe<br />\nlack<br />\nof<br />\nover<br />\nin<br />\nmagazine<br />\nis<br />\nlost<br />\nthe<br />\nthe<br />\nvalue of<br />\nSPEECH GREATLY ENJOYED<br />\nDarley will address the gatherthe fact that is so kte. However, fertisements. Those advertisements<br />\nSt. John's Plays Superb Football<br />\ning, at which candidates for<br />\nto Turn Back Jays 46-0<br />\nOutspoken Attack on Presentthe high tension oT expectation which are in the issueadd to it as<br />\nmanagerial as well as playing<br />\ncaused by the long delay makes the a whole except that, as the Jay itday Principles Pleases<br />\nAn inspired St. John's football<br />\npositions<br />\nshould<br />\nbe<br />\npresent.<br />\nbook anxiously sought for by ev- self, they are late and some of the<br />\nteam came to Homewood last SatDr. Sherwood Eddy, National<br />\nThe initial practice of the<br />\neryone. The first issue is- out just copy is already history.<br />\nurday and left nothing but amazeSecretarz of the'Y. M. C. A., wellAn index of work and the auyear will be held at Carlin's on<br />\nin time to give those unfortunate<br />\nment in its wake. Playing superb<br />\nknown lecturer and author of sevTuesday afternoon. -Informastudents who can't make the marks, thors of the work also are novel in<br />\nfootball, the Johnnies ran over the<br />\neral renowned books,,poke be<br />\na taste of the humorous side of col- the Black and Blue Jay. From the, ilen relative to practices and<br />\nJay team at will and rolled up 46<br />\nforE a large assembly last Thursindex it can be seen that the stories,<br />\nequipment will be given at the<br />\nlege.<br />\npoints before the contest finally endday in the C. E. Hall. Dr. Eddy,<br />\norganization<br />\nmeeting<br />\non<br />\nThe cover, by Kolb, forec-asts the articles and editorials have grown<br />\ned. The second quarter was a riot<br />\nwho recently wrote a book on<br />\nThursday.<br />\nchange of style of the publication. in volume while the art work, and<br />\nOf scoring for the St.,John's team;<br />\n\"Sex'and Youth\", made this SubIt is a Inarked change from the us- the usual amount of exchange and<br />\nin this period the Annapolis eleven<br />\npoor<br />\nlocal<br />\njokes<br />\nhave<br />\nbeen<br />\nject the basis of his•talk.<br />\nexcluded.<br />\nual college art work. It is quiet and<br />\nrolled up 34 points without letting<br />\nThis Jay is a renovated publicaconservative, but expressive.<br />\nIn intioducing his subject, Dr.the Jays get really within scoring<br />\nArt wort( throughout is of a high- tion ,and is certainly a step forward<br />\nEddy brought out that at the botdistance at any time.<br />\ntom of the makeup 'of every red- Impregnated Paper Insulation Is er calibre than the Jay has known and upward from the old level that<br />\n4)u-the tenth play 9f-the game<br />\nSubject<br />\nthe<br />\nformer<br />\nissnes-Established.<br />\nFor<br />\nsome<br />\ntime.<br />\nAmong<br />\nothers,<br />\nReport<br />\nAll<br />\nto<br />\nCandidatesUrged<br />\nblooded young man there are cerBobby Lyons was injured and had<br />\nthis<br />\noriginality<br />\nand<br />\nthe<br />\ninitiative<br />\nof<br />\nQuirk's<br />\nportrait<br />\nof<br />\na<br />\nyoung<br />\nlady<br />\nThen<br />\nThe<br />\nConference<br />\non<br />\nImpreg.<br />\ntain \"drives\", _impulses, or into be removed from the field before<br />\nstepping away from the beaten.track<br />\n_stincis which can make or break nated Paper Insulation has been which accompanies the poem \"LoveThe annual Barnstomers' Rally the second quarter was fairly under<br />\narid<br />\ntlfe<br />\nsemi-humorous<br />\n.type<br />\nof<br />\nthe<br />\nliness\"<br />\nis<br />\nfine.<br />\nthe individual. Like a high-pow- in progress at ,Hopkins during<br />\nusual humorous magazine, we take will be held at the Homewood Play- way. Without their field general<br />\nered car they Can get out of con- _the last , week, On Thursday,'Fri- The page of photographs and the<br />\nshop, behind the 3 ..versity Club, the Jay team didn't seem to know<br />\noff<br />\nour hat to the Jay.<br />\narticles<br />\nof<br />\ncommon<br />\ninterest<br />\nto<br />\nthe<br />\ntrol, but on the other hand by dis- day and Saturday.<br />\nFriday, November 23, at 8 o'clock. what to do with the ball when they<br />\nExperts in high voltage electric<br />\nciplined self-control they can be<br />\nThis is the first call for candidates got possession of it, and as a result<br />\nStudent<br />\nActivities<br />\nCouncil<br />\nSpeak<br />\nStanley<br />\nJones<br />\nTo<br />\ntransmission<br />\nE.<br />\nfrom<br />\nall<br />\nparts<br />\nof<br />\nthe<br />\nmastered to a love of all fine and<br />\nby the Barnstormers in view of were kept on the defensive the enConsider Varsity Seals<br />\nTo College Students starting a light rehearsal schedule tire game.<br />\nbeautiful things. It was broUght United States; representing leading<br />\nengineering<br />\nschools<br />\nand<br />\nelecout that much depends on whethDr. E. Stanley Jones of India beginning immediately. Candidates<br />\n34 Points in Third Quarter<br />\nA meeting of the Student Activier the individual masters or is tric power companies, attended<br />\nwill<br />\nbe the speaker at a° special ad- should not feel any hesitancy in<br />\nThe first score came on the fifth<br />\nmastered by these drives. From the'three-day ccinference on the ties Council was held last Friday. dress and open forum for students coming out because of lack of ex- play of the second quarter, after the<br />\nNovember 16, at which a financial<br />\nthis point on Dr. Eddy assailed problems of insulation.<br />\nthis afternoon, Goucfter, Hopkins perience, as many of the stars of Johnnies had blocked and recovered<br />\nThe main purpose of the con- report of the group was rendered by<br />\nwith sincere, heartfelt enthusiasm<br />\nand<br />\nMaryland are trie represented_the productions in the past had no a kick on the Hopkins 35-yard line.<br />\nthe old Puritannical, ignorant ference_ was to investigate the Mr. John Myers, the treasurer of at this meeting, which will be held experience before coming to Hop- The ball was carried over the last<br />\nthe<br />\ncouncil,<br />\nshowing<br />\nthe<br />\navailable<br />\ndealing<br />\nwith<br />\nthe<br />\nmeans<br />\nof<br />\nbest<br />\npolicies of rearing children in igat'five o'clock in Catherine Hooper kins.. This year's play calls for an white marker by a series of ordinorance, and letting youth flour- insulation Problem, which has resources of each activity. Also con- Hall of Goucher College. The Stu- unusually large cast and as many of narily well-executed plays. There<br />\nhas<br />\nsiderable<br />\ncomment<br />\nwas<br />\nmade<br />\nupon<br />\npresent.<br />\nThis<br />\narisenat<br />\nCOnre<br />\nish into it beautiful state of exdent Volunteer Movement and Mt. last year's stars were lost through was nothing \"flukey\" about it except<br />\nistewe with horrible inisconeep- about as -a result of the develop- the caress and promiscuous dona- Vernon Place M. E. Church are graduation, there are many-places the apparent listlessness of the HopWhich<br />\nplants<br />\ntion<br />\nof<br />\nvarsity<br />\nseals<br />\nthat<br />\nwas<br />\nprevasuper-powef<br />\n•tions of sex anit sex life. It teas. merit of<br />\nsponsoring the affair. The Campus which will have to be filled by can- kins team. Front then on it _was<br />\nbrought out thai.., the ' new era- are long distances from the mar- lent last year in the University. To Committee consists of Foster Dow- didates.<br />\nmerely a case of how often the St.<br />\nrectify this error, each member is<br />\nsinC-e the war has seen for the kets for the current.<br />\nell, Purnell Hall, Edward Lockhard, This rally will not be confined John's team would cross the scorThe conference did not fornial- appointed as a committee of one to<br />\nmost 'part a gradual lifting of<br />\nGrafton lierpsberger and Howard exclusively to candidates for the ing line before the half would end.<br />\nthese medieval and backward ten- ly open till Friday at 9.30 A. M.. arrange a practical plan to reduce Easton, Similar committees are cast. Clyde Friz, Production Mana- Hopkins backs were not plugging<br />\nGoodnow<br />\nPresident<br />\nthe<br />\nnumber<br />\nof<br />\nseals<br />\ngiven<br />\nout,<br />\nand<br />\ntime<br />\nthis<br />\nat<br />\ndencies, but that narrow-mindedworking at Goucher, and Maryland. ger, will welcome all carpenters, holes in the line on the defense and<br />\n'tress still exists. Dr. Eddy welcomed the many scientists -to report the same at the next meeting. The three comniittees consisting of painters, and electricians and George were not giving interference on the<br />\nmeetactual<br />\nof<br />\nthem<br />\nwill<br />\nnot<br />\nso<br />\nthat<br />\nthe<br />\nvalue<br />\nThe<br />\nconferences.<br />\nthe<br />\nbrought out several specific cases<br />\nsome two dozen students met at Glazier wishes to have all those in- offense; the Hopkins line was dis- •<br />\norder by be lessened.<br />\n.of youths from revble fami- ing was they called to<br />\n• dinner over a week ago and worked terested in the business staff pres- playing a phenomenal reversal of<br />\nelec-.<br />\nthe<br />\nof<br />\ndean<br />\nWhitehead',<br />\nlies, students at high school-- Dr.<br />\nform over last Saturday,'apparently<br />\nout the details.<br />\nent.<br />\ndepartment.,<br />\ngrowing up in ignorance feeling trical engineering<br />\nFootball<br />\nFrosh-Soph<br />\nbeing unable to stop even the weakDr.<br />\nJones<br />\nis<br />\na<br />\nnative,<br />\nof<br />\nBaltielectrical<br />\nWilliam<br />\nBanks,<br />\npresident of the<br />\nse -urges, and answering them in who is chairman of the<br />\nest thrusts of the St. John's team.<br />\nNov.<br />\n24<br />\nGame<br />\nand<br />\nRush<br />\nmore.<br />\nFrom<br />\nthis<br />\ncity<br />\nhe<br />\nRewent<br />\nto<br />\nNational<br />\n*club, has solicited the attendance of<br />\npromiscuous and indecent _ways. committee of the<br />\nThe Johnny backfield men just<br />\nUnder this coun- Freshmen-Sophomore hostilities India, where he worked for about the alumni through a circular letter<br />\nIn each case the habits continued search Council.<br />\nleading elec- will be resumed when the rival fifteen years. He is now in his early in line with the club's policy of de- couldn't be stopped by the Jaymen<br />\nby<br />\n-backed<br />\nand<br />\ncil<br />\nand the boys grew into manhood<br />\nimportant re- classes trot out their football teams forties and one of the leading au- veloping alumni support. The com- until they had traversed at least two<br />\nand always retained that horrible trical companies,<br />\nsearch work along the line of in- on the upper field, Saturday, No- thoritieS ittn that great Asiatic na- mittee promises entertainment, the or three white markers. Each time<br />\nstain of'indecency.<br />\nsulatibsn has been carried on vember 24. at 2.30 P. M. Dow Stra- tion. He has studied the country nature of which has not been dis- the St. John's team got the ball in<br />\n. Open Forums .<br />\nWhite- der,'varsity captain and center. will not from the point of view of an closed. Walter B. SWindell, '01, a broken field the Hopkins stands<br />\nDr. Eddy brought out that he tinder the direction of Dr.<br />\nheld their breath—having secured<br />\nreferee. Coach Van Orman will American, but through the outlook who has coached the last six prowell remembers the first sex ex- head.<br />\nan early lead, the Johnny backs<br />\nContinued an Page 4, Col. 4<br />\nissue uniforms to sophomores who given by an antecedent study of In- ductions, will be on hand to talkito<br />\nplanation he ever acquired. It<br />\narose to.the occasion and outplayed<br />\nwas from a small boy in a base-.<br />\nturn out, the freshmen having al- dian literature, language, philoso- the candidates and welcome the<br />\nphy, religion and history. He was alumni.<br />\nRefreshments will be themselves. It seemed as though<br />\nready been supplied.<br />\nball park, and was naturally full Major Tipton To Talk<br />\n,<br />\nelected a bishop of the Methodist served. Part of the assembly on a touchdown was made every time<br />\nnf indecent and vague concepHopkins. A. S. M. .E. After the game the annual class Episcopal Church but resigned that Thursday will be turned over to the Annapolis eleven got possession<br />\nTo<br />\nthe<br />\ntions. He automatically got<br />\nMajor °Tipton, of the. Maryland rush will take place in a novel form. high office, preferring his work in Mr. Swindell, who will attempt to of the hall.<br />\nwrong idea, and because .of this<br />\naddress the A football will be placed on the<br />\nNational<br />\narouse.interest among the students<br />\nBlue Jays Overconfident<br />\nfact lost all reskct for his parni la which he regarded as.a. greater<br />\nbranch of the American So- fifty-yard line and members of each<br />\nstudent<br />\nThe first half finally ended with •<br />\nto come out -for the play.<br />\nents, friends, and teachers, who<br />\nopportunity<br />\nfor<br />\nservice.<br />\nthe<br />\nopposing<br />\nline<br />\nup<br />\non<br />\ntoclass<br />\nwill<br />\nMechanical Engineers<br />\nthe visiting team having scored at<br />\nhad kept these facts from him. It ciety of<br />\nnight. The meeting will be forty-five-yard lind. At the whis- His two books, The Christ of the<br />\nthe rate of one touchdown every<br />\nwas brought out that these things morrow<br />\nCampus<br />\nCage<br />\nFund<br />\no'clock in Robrn 110 of the tle, the frosh and sophs will try to Indian Road and The Christ of the<br />\nthree minutes of actual playing time<br />\nare actually beautiful and sacra- at 8:00<br />\nNears Completidtz during the second quarter. Jay<br />\nget the ball between the goal posts Round Table, have been<br />\nBuilding.<br />\nread by<br />\nmental, if understood in the prop- M. E.<br />\nMajor Tipton is at present vice- of their antagonists. The rush, un- students not only in English but<br />\nAccording to rePorts furnished rooters were absolutely spell-bound,<br />\ner light.' God created man and<br />\npresident of the Chesapeake Air- less one side wins before, will last<br />\nby the Treasurers -office, the cage they could hardly believe their eyes.<br />\nGenesis,<br />\nwoman as described in<br />\nalso<br />\nin<br />\nGerman,<br />\nFrench,<br />\nSpanish,<br />\nholds<br />\nofficially<br />\nCompany and<br />\nfund goal of $10,000 is being ap- St. John's was administering a drubfive minutes.<br />\nand He certainly was not craft<br />\nSwedish, Norwegian, Japanese, Kothe rapacity of Major in the Naproached by the donations of 296 bing the parallel of which could<br />\nashamed of His creation.<br />\nactively<br />\nrean, Chitiese, Syrian, and several °undergraduate students which have hardly be remembered by the oldest<br />\ntional Guard. lie has been/<br />\nflying<br />\nLecture<br />\nhe<br />\nTo<br />\nDr. Eddy mentioned that<br />\nDr. Miles<br />\nvernaculars of India. Four hundred attained four-fifths of the amount Hopkins grad.<br />\nengaged and interested' in<br />\nhad lectured at nearly 50 colleges during and since the Worrd9Var.<br />\nOn Shakespeare Again thousand'copiek of the former book required to receive support from _ When the second half began<br />\nthroughout the country on the<br />\nMajor Tipton was a lieutenant in<br />\nwere sold and went through five edi- the alumni of the University. At things began to look a little better<br />\nsubject. Ffe had held_ open for- the Flying Corps during the War, Dr. Miles will render the second<br />\ntions in six months. Dr. Jones the sophomore class meeting last for the Blue team. Four first downs<br />\nan<br />\nas<br />\nrecord<br />\nseries<br />\nof<br />\nfour<br />\nlectures<br />\nrosk<br />\nremarkable<br />\nhis<br />\nof<br />\na<br />\ntuns, and had answered freely all and has<br />\nThursday $170 was raised, and this were made in quick succession, only<br />\nToward the latter part of Shakespeare on Thursday, Novem- stirred 'large audiences of students week the junior 'and senior classes to lose<br />\ninquiries on the part. of students. aviator.<br />\nthe ball on St. John's 20the<br />\nbehind<br />\nfell<br />\nand<br />\nBerlin<br />\neven<br />\nin<br />\nPrague„<br />\nVienna<br />\nplane<br />\nconflict his<br />\nwill have meetings at which Dr. Van yard line. The chance to score was<br />\nber 22, at 4.15. The lecture is exThese inquiries and answers were the<br />\ncapheld<br />\nwas<br />\nGerman lines, and he<br />\npected to be given in Room. 101, though speaking through an inter- Orman will speak on the cage fund. gone and from then on for the rest<br />\nusually arranged through writing.<br />\ntive in a prison -camp for the reHall, which was the loca- preter. He is in this country for<br />\nRemsen<br />\nAlthough the tune limit for sub- of the quarter the two teams fought<br />\nbeing<br />\nSpeaks of Petting<br />\nmainder of the war. After<br />\nNaturally, it was brought out released he returned to Hopkins and tion of the first. The last two are only three months and eager to re- scriptions has passed, any students out the battle on about even terms.<br />\nThe Hopkins eleven was still playmany of the questions dealtzvith took up Mechanical Engineering scheduled for December 13 and Jan- turn to India.<br />\nnot seen by the committee and wishing listlessly, as though the contest<br />\nthe preposition whether such and and graduated in 1921.<br />\ning to subscribe, may stop at the were of little moment, and the guaruary la at the same time and place.<br />\nbeen<br />\nsuch a thing was right or wrong. Since then, perhaps, he. has<br />\nTreasurer's office before this Friday terended with the ball on the Jay's<br />\nThe last lecture was a general<br />\nThe first important meetinainly through<br />\nFor instance, in many cases it closely connectrd;-and sign the pledge. As soon as all 15-yard line.<br />\nsurvey of the early. influences upon<br />\nNathe<br />\nBusithe<br />\nof<br />\nthe<br />\nyear<br />\nof<br />\ning<br />\nwith<br />\naviation,<br />\ncommercial<br />\nwas asked whether \"petting\"—a<br />\npossibilities on the campus have Twice more before the game was<br />\nthe works of Shakespeare and the<br />\nness Staff and Business Cantional Guard. He also is writing<br />\nnew and well-known term was or<br />\nbeen exhausted, a final drive will be over the St. John's team crossed the<br />\nthree will continue the study<br />\ndidates of the \"News-Letter\"<br />\non commercial aviation for the Sun next<br />\nwas not ethical.<br />\nDr. Eddy paper.<br />\nmade on the alumni to complete the last white line to add six more<br />\nwill be held tomorrow, Wedof his life.<br />\npoints to their already unbelievable<br />\nnesday, November 22, at<br />\nremainder of the necessary fund for<br />\nbroug4i1 out that to judge whethA special invitation is extended<br />\nAll students taking English 1 are<br />\nscore.<br />\n12.30, in the \"News-Letter\"<br />\ner a thing of this sort is right or to all M. E. students who are in required to attend and will be held<br />\nthe cage which will approximate<br />\nOne more defeat chalked up to<br />\nOffice. It is imperative that<br />\nsecond years, but all<br />\nover one hundred and fifty thou- the score of over-confidence.<br />\nwrong in general is an impossible their 'first and<br />\nthe contents of the<br />\nall members be present.<br />\nwelcome and cordially responsible for<br />\nare<br />\nstudents<br />\nsand dollars.<br />\ntask. He mentipned that \"petContinued on Page 3, Cot,<br />\nfull series.<br />\ninvited to attend.<br />\nContinued on Page 3, Cd• 4<br />\nMr. Edwin Gs Baetjer,<br />\nprominent local attorney,- has<br />\nbeen selected to fill one of the<br />\nfour vacancies on the board of<br />\ntrustees of this University. No<br />\naction has been taken on the<br />\nother places to be filled.<br />\nIt is understood that the<br />\nboard is nearing the finish of<br />\n'their research and elimination<br />\nin an effort to find a successor<br />\nfor President Frank J. Goodnow, whose resignation' lakes<br />\neffect not later than July ilst,<br />\n1929.<br /><br />\nCONFERENCE IS HELD<br />\nBY ENGINEERING SCHOOL<br /><br />\nBARNSTORMERS TO HOLD<br />\nANNUAL RALLY FRIDAY<br /><br />\n20, 1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER<br /><br />\n2<br /><br />\nHOMESNEWS:LETTER<br />\niOUNDED 1897<br />\n$2.00<br /><br />\nSubscription<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice in<br />\nBaltimore, Md., under Act of Congress November 3, 1879.<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\nBusiness communications should be addressed to the BUSINESS MANAGER,<br />\nJohns Hopkins University. All articles should be sent to the MANAGING<br />\nEDITOR: other communications to the EDITOR-IN-CHIEF.<br /><br />\nUniversity 0106<br /><br />\nTelephone<br />\nEDITORIAL DEPARTMENT<br />\nEditor-in-Chiel<br />\nGEORGIC E. BANKS, JR., '29<br /><br />\nAssistant Managing Editor<br />\nGams GUMP,'30<br /><br />\nManaging Editor<br />\nPHILIP W. Ness, '29<br /><br />\nAssociate Editors<br />\nWILMER H. DRIVER, '29<br />\nROBERT S. BAMD, 'BO<br /><br />\nRICHARD H. WOOD,'29<br /><br />\nJunior Editors<br />\nStewart L. Smith, '30<br />\nLeonard B. Motley. '29<br />\nH. Garland Hershey, '29<br />\nPaul W. Spear. '30<br />\nGeorge H. Dowell, '31<br />\nRobert F. Skutch, '30<br /><br />\nW. Purnell Hall. 4., '30<br />\nFoster Dowell, 29<br />\nRichard G. Hunt. '31<br />\nHarwood F. Mullikin. Jr ‘131<br />\n'Irving K. Gordon, '29<br />\nLewis Daneiger, '31<br />\nIt.<br /><br />\nBUSINESS DEPARTMENT<br />\nBusiness Manager<br />\nHARRY 0. SCHLOSS, JR., '29<br />\nAdvertising Manager<br />\nGEORGE M. GLAZIER, '29<br />\nOffice Staff<br />\nThonanrP A. Elotshmftn. '31<br />\nersnnolnh Rothchild. '11<br />\nT<br />\nv Shur,. '11<br />\nJohn A inmirieon. '30<br /><br />\nCia °'/Won Manager<br />\nJ. Witmer Mvsses. '29<br />\nAdvertising Staff<br />\nAlvin IL Ilium. '30<br />\nGus Burke, '31<br />\nGeorge S. Robertson. '31<br />\n-Sidney Raffel, '31<br /><br />\nStaff Photographer<br />\nWALTER D. SCHEIDT, '30<br />\nPrinted by The Read-Taylor Company, Lombard and South Streets,<br />\nBaltimore, Md.<br /><br />\nEDITORIAL COMMENT<br />\nPOST MORTEM<br />\nP from historic Annapolis, there came eleven gridiron warriors,<br />\nwith 'a glint of defiance in their eyes and a passion for revenge<br />\nsurging through their souls. NOt since 1?.17., had St. John's been able<br />\nto ,take the measure ,of a johns Hopkins ..football team. Year after<br />\nyear, they had been forced to accept the borers',share. But,this year,<br />\n.under the direction of their coach, \"Tody\" Riggs, the JohnnieS came\"<br />\nto town with a determined look on their faces and swore a fierce oath<br />\nthat their past defeats would be avenged.<br />\nOut from the locker rooms, under the Homewood Field stands,<br />\nseyed Jays. Last week, they had made New Vick ,<br />\n.<br />\ntrotted the blue-jer<br />\ngasp with amazeinerit-Wholding the powerful Columbia outfit to a<br />\n14-to-13 score. The newspaper experts had picked them to again beat<br />\nold St. John's. There was a confident spirit in their ranks as they.<br />\ncarried on their preliminary work,out It looked like another Hop,<br />\nkills year.<br /><br />\nU<br /><br />\nAs the game progressed, it became more and more apparent that<br />\nthe football guessers had made another mistake. The Johnnies ripped<br />\nimmense gaping holes in the. Jay fOrward wall. They tore open great<br />\ngaps, large enough .for the whole backfield to pass through: When<br />\nthe Jays got possession of the ball, the St. John's defenses held like<br />\na mighty fortress. Hopkins was simply outclassed,-outguessed and<br /><br />\nST. JOHN'S BURNTIN TRADITIONAL<br />\nMANNER BY CHANTING PARADERS<br />\nthat an _important event is<br />\ntranspiring. At.Goucher, a halt was<br />\ndeclared; and here the fair co-eds<br />\nwere informed in. no uncertain<br />\nterms that St.John's was irrevocably<br />\ndoomed.. After having yelled itself<br />\njust a little more hoarse, the crowd<br />\nrumbled, tumbled and crashed on<br />\ndown to North Avenue. Another<br />\nmore evincing of Hopkins en. Therefore, in the traditional nian- halt;<br />\nmore denunciations of<br />\nner, the Hopkins student body set thusiasm;<br />\nand again forward moforth on Friday night to totally ex- .St. John's,<br />\ntinguish the spirit of St. John's in a tion.<br />\nNow the street cars added in cremanner highly ceremonious and efnoise as ingenious Frosh<br />\nficacious. The demonstration start- ating a<br />\ndynamite powder on the<br />\ned at the Barn in the early part of dropped<br />\nwould in Annapolis<br />\nWHat<br />\ntracks.<br />\nsuccess<br />\nthe<br />\ninsure<br />\nthe evening. To<br />\nprovocative of calling<br />\nbeen<br />\nhave<br />\nof the procedure and to ward off<br />\nstate militia, was more<br />\nall evil bodieS-,a flaming \"H\" com- forth the<br />\nin Baltimore. Was<br />\ntolerated<br />\nthan<br />\nposed of lighted torches was set up<br />\nserenaded with a<br />\npoliceman<br />\none<br />\nnot<br />\nin the center of the bowl.<br />\nchorus of \"all policemen have big<br />\nLed by four upper classmen feet\"; and did he not acknowledge<br />\nasiride fierce chargers, the parade the compliment by smiling gracioUsot under way. Despite the blaring ly ? Baltimore, seeming' to enjoy<br />\nof the band, the tooting of horns, the spectacle, gazed .eagerly and<br />\nthe back-firing_ of \"ilivvers,\" and th- good-naturedly.<br />\nyelling of Freshmen, a certain'sadAfter a series of stops and starts,<br />\nness was prevalent, The Frosh, the procession reached Sun Squart<br />\ndressed in white pajamas, presented En -rOilte the fat thir St. John's<br />\na somewhat wraith-like appearance was again being consigned to torthat was altogether meet at a time rid regions was made known to the<br />\nwhen the spirit of an ancient rival somewhat inanimate John Eager<br />\nis about to be laid to rest. Nor was Howard and George Washing-ton,<br />\nthis the only portent of a somewhat who daily hang out in Mt. Vernon<br />\nlugubrious event. A large black Place. In honor of the occasion,<br />\nhearse, on which sat some twenty the equine that has so patiently<br />\nor thirty students in positions vari- borne the bronze Sir Howard for<br />\nous and precarious, gave more evi- many years, come to life again and<br />\ndence of a funeral.<br />\nsnorted fire as some original yearDespite this tinge of sadness, the ling stuck .a flaming torch in the<br />\nprocession was lively enough. Hoo- horse's mouth.<br />\nwah-hooing and snake dancing, the<br />\nBy the time the Sun Square was<br />\nparade advanced down Charles reached the preliminaries had been<br />\nStreet. ,Burning torches_were car- concluded. The crowd, worn but<br />\nried aloft. in order to give light to still happy, was just in the right<br />\nthe St. John's spirit that was soon mood for a.cremation.- After havto be condemned to purgatory. ing announced to Baltimore Street<br />\nWith the black hearse, the sulphur and the environs that Hopkins was<br />\nfumes of the flares, and the singing present and that St. John's was the<br />\nof \"Hopkins Will Give You _Hell, object of the ritual, the high priests<br />\nHell, Hell!\", the thought of the in- proceeded to successfully conclude<br />\nfernal regions was not absent from the matter. St. John's in effigy was<br />\nthe minds of the annihilators.<br />\ndragged forth from the hearse and<br />\nHopkins, staid and conservative there at the Sim Square was conenough throughout the year, be- sumed by flames. While ihe-spirit<br />\ncomes boisterous and noisy when was being burned and descending to<br />\nSt. John's is the object of its wrath, the Inferno, the band played an apand must need let the city at large propriate funeral-dirge.<br /><br />\nFor quite a number of years it<br />\nhas been customary for Hopkins to<br />\ndoubly annihilate their ancient rivals, St. John's. One annihilation<br />\nthat of the spirit, takes place on the<br />\nnight preceding the game; the other<br />\noccurs the next day, when the Blue<br />\nJay eleven usually proceeds to annihilate the Crabtowners in the body.<br /><br />\nLight Lunch<br />\n5 W. Twenty-first St.<br />\nOpen 9.30 A. M. to Midnight<br /><br />\nCONGRATULATIONS TO THE JAY<br />\nHEN the Black and Blue Jay announced a change in editorial<br />\npolicy for the coming year, the snickers of the campus cynics<br />\nwere heard on all sides. These chronic pessimists commenced to nudge<br />\neach other and smile: The Jay. they told each other, had always been<br />\na glorified Capstans Billy's Whiz-Bang and could never be anything<br />\nelse. However, with the first number of the rehabilitated campus<br />\ncomic, the prophecies of the smart,alecks have failed to materialize.<br /><br />\nW<br /><br />\nThe Jay staff may well be proud of their first issue. The editorial<br />\ncopy is good, the illustratiorls are well executed, the typography is<br />\nexcellent. The pages and pages of \"he-she\" jokes are, we are glad<br />\nto report, a thing of the past. In their places, are poems, stories and<br />\narticles of general interest.<br />\nOur esteemed colleague, Mr. Kolb, hammers his typewriter to<br />\ngood effect and hurls several verbal brick bats at the once famous<br />\nTudor and Stuart Club. Kolb's slashing denunciation certainly shows<br />\nthe literary club in a had light. Perhaps, a couple of sticks of dynamite would awaken the literati from their drowsy lethargy.<br />\nThe new Jay meets with our unqualified approval. To the staff,<br />\nwe offer the heartiest congratulations and best wishes for continued •<br />\nSUCCOR.<br /><br />\n35th 6' St. Paul Sts.<br />\n31st 6' St. Paul Sts.<br />\nSafe and Efficient Service<br />\nPassengers<br />\nNo Charge for Extra<br />\n'PHONE<br /><br />\nAlgebra-zGeometry—Trigonometry<br />\nWILLIAM H. JOLLY<br />\n2706 Gwynn Oak Ave.<br />\nTel. Woodlawn 276.W<br /><br />\nto HARBAUGH Ei BANNON<br />\n2 E. LEXINGTON ST., Cor. Charles<br />\n(Room 28)<br />\nStenographic Dictation, Copying,<br />\nMultigraphing, Mimeographing<br />\nMaryland<br />\nBaltimore<br /><br />\nPLANTATION<br /><br />\n1506-1508 Guilford Avenue<br /><br />\nVERNON 1 21 2<br /><br />\nBaltimore,<br /><br />\nFOR A<br /><br />\nIa.<br /><br />\nPhone VErnon 1691<br /><br />\nYELLOW CAB<br /><br />\nStep Out From The Crowd!<br />\nBe an exception—Be a Successful Somebody<br />\nWith a Savings Acpunt you are on the highroad<br />\nto succus—Opportunity waits beyond.<br /><br />\nPARK BANK<br />\nLexington Street at Liberty<br />\nNorth Avenue at Charles<br />\n4819 Belair Road at Southern<br /><br />\neAn Invitation<br />\nTo the Johns Hopkins students we extend a cor,<br />\n- -dial- invitation_to come in and __see our beautiful<br />\nhand-wrought Jewelry, our'importations of ancient<br />\nand modern gifts. Prices very moderate.<br /><br />\nCARL SCHON, INC.<br />\n109 W. SARATOGA ST.<br /><br />\n\"Friend of the Hopkins Man\"<br /><br />\nUnion Trust Company of Maryland<br />\nCHARLES AND FAYETTE STI-t'BECer<br />\n\"On the Route of the'rEaries Street Bus\"<br /><br />\nSI<br /><br />\nstimulatingdelightful<br />\nthe New Fall Books!<br />\nYou'll find tows and rows of them—brand-new books in bright<br />\ncovers—smelling pungently of printer's ink and crisp paper--fictiona<br />\nthy, science—awaiting your choice at our two stores<br />\npoetry, bigir,<br /><br />\nTHE NORMAN,REMINGTON CO.<br />\nDown-Town:<br />\nCharles St. at Mulberry<br /><br />\nUp-Town:<br /><br />\n1118<br /><br />\nNorth Charles St.<br /><br />\nE<br />\nmin<br /><br />\nCOMMUNITY INN<br /><br />\n- GWYNN LEASE<br />\nOrchestras- of Distinction<br />\n1944 EDMONDSON AVENUE<br />\nPhone Garnor 6886<br /><br />\nE. E. ADAMS<br /><br />\nSTABLIKO<br /><br />\nS<br />\nE<br />\nCHARTS<br />\nSERVICE<br /><br />\nad<br />\nme<br />\nCit-t to Oil<br />\n;_S<br /><br />\nEINM ISF4J.INIVtRSITY<br />\nVER YOUTHFUL<br />\nISTiNGUISHED<br />\nSTATES.<br /><br />\n--oda<br /><br />\nBARN CAFETERIA<br /><br />\ncMANNIE (BERG<br />\n\"The Old Boy Himself\"<br />\nTrade<br /><br />\nMark<br /><br />\nReg.<br /><br />\nCol4iate Furnishit*s<br /><br />\nCollege Men!<br /><br />\nNORTH AVE. MARKET<br />\nNORTH.6? MARYLAND<br /><br />\nAVEs.<br /><br />\nPhone HOmewood 7908<br /><br />\nIn style and quality \"Bostonians\"<br />\nequal the most expensive footwear<br />\nproduced today. .<br /><br />\nST. PAUL at 33rd STREET<br /><br />\nYour Neighborhood Drug Store<br />\nPRESCRIPTIONS<br />\nSchool Supplies, Candy, Cigars<br />\nUnexcelled Fountain Service<br />\nMake Our Store Your Store<br /><br />\nrz=r1L<br /><br />\nAPPOINTMENT<br />\nOUR STORE IS THE<br /><br />\nOF BALTIMORE<br /><br />\nMostly $7.50 to $10<br /><br />\novercoats tailored by Charter House<br /><br />\nThe character of<br />\nwill<br /><br />\nExclusieely in<br /><br />\nBaltimore'<br /><br />\nBOSTONIAN<br />\nSHOE STORE<br />\n112 E. Baltimore Street<br /><br />\n-u<br /><br />\n114rter housel<br /><br />\nAnd the saving is a big item.<br /><br />\n(13ire1y's Pharmacy'<br /><br />\nTH<br /><br />\nThomas &amp; Evans<br />\nPrinting Company<br /><br />\nSuccessor<br /><br />\nWe 'haven't<br /><br />\nBut there will be another St. John's game'again next year. There<br />\nwill be another parade down Charles Street and another burning •<br />\nof an effigy. Then perhaps, when the sun sinks behind the Wyman<br />\nPark woods, the sccire board will tell another story.<br /><br />\nHomewood Field<br /><br />\nHome—HO. 2091-i<br /><br />\nFRANCES T. BANNON<br /><br />\noutplayed.<br /><br />\nany excuse to offer for the overwhelming defeat<br />\nof the Blue Jays. Like as not, there is no alibi available. St. John's<br />\nplayed an inspired game. They .have a scrappy, aggressive, fighting<br />\n.<br />\n•<br />\neleven, and deserved to win.<br /><br />\nNewspaper.<br />\nCommercial<br />\nBooks<br />\nWork<br />\nEstablished 1880<br /><br />\nAT<br /><br />\nTUTORING<br /><br />\nFRANK'S<br /><br />\nPhone, CAL 1380<br /><br />\nknow<br /><br />\nYELLOW CAB STA14DS<br /><br />\nthe suits<br /><br />\nand<br /><br />\nearn your most sincere liking.<br /><br />\nDe<br /><br />\nHub<br /><br />\n11 -1:ri<br />\nBaltimore. Cherie., and Fayette<br /><br />\nONO<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20, 1928<br />\nPhone CAlvert 5975<br /><br />\nI<br /><br />\nIncorporated<br />\nManufacturer of<br /><br />\n(RUBBER STAMPS<br />\nThe Service shop<br />\n319 W. Redwood St.<br />\nBOOKS<br />\nBOUGHT, SOLD<br />\nand EXCHANGED<br />\nPippen's Book Store<br />\n605 N. EUTAW ST.<br /><br />\nTHE SOUTHERN<br />\nHOTEL<br />\nBaltimore's Newest<br />\nand Finest :•:<br />\n\"A Hotel of Atmosphere<br />\nmui Enviremsent\"<br /><br />\nContinued from -Page 4, Cot. 2<br /><br />\nances, for within him burned the<br />\nsacred flame that was to influence<br />\nhis life. At eighteen he started to<br />\nkeep a diary. He had heard that<br />\nBenjamin Franklin kept one and he<br />\nfollowed this example. It has not<br />\nbeen published but is,a most interesting and instructtve document.<br />\nIt seems that when he wanted to'clo<br />\ngood he was always alone, when he<br />\nwished to do something bad he was<br />\nsurrounded by friends. One of the<br />\nrules he made at this time is, 'when<br />\nyou are thinking use always all the<br />\npower of your brain.' If my father<br />\nachieved greatness it was because<br />\nhe used all the power of his brain<br />\nwhen thinking: He also says, `It is<br />\nbetter to do nothing at all than to<br />\nbe busy 'doing nothing.' This my<br />\nfather followed all his life.\"<br />\nAfter Tolstoy's military career<br />\nand his Sebastopol letters, Tourgenif declared \"Now we have a writer<br />\nwho is niit afraid to tell the truth.\"<br />\nNow Tollt!y traveled in Western<br />\nEurope tg ,k'udy education. Not<br />\nlong ate,k his return'atthirty-five<br />\nTolstoy married and settled down<br />\nat his country estate.<br /><br />\n11 E. North Avenue<br />\nVernon 2704<br /><br />\nI<br /><br />\nThe<br />\nlargestselling<br /><br />\nQUALITY<br />\npencil in<br />\nthe World<br /><br />\nSend$1•<br /><br />\nfor sample box ofa<br />\ndozen assorted styles<br /><br />\nANIERICAN PENCIL CO., Dept.D46 Make.,N.J.:<br />\nMakers of UNIQUE To.,Lead Colored<br />\n1.120 per doz.<br />\nPersc4.—lasalorr—$)<br /><br />\n•<br /><br />\nDR. EDDY SPEAKS<br /><br />\nTOLSTOY SPEAKS<br /><br />\nTHE CHARLES E. MYERS CO.<br /><br />\n\"The first fifteen years of my<br />\nfather's family life were years of<br />\nunclouded happiness. My father<br />\nwas busy writing and took an active<br />\npart in the education of his children.<br />\nMy mother cared for hew thirteen<br />\nchildren and managed' 'the large<br />\nhome and was a secretary to my<br />\nfather—a very difficult position....<br />\nas a matter of fact, she copied War<br />\nand Peace and Anna Karanina eight<br />\ntimes in all. Some things she had<br />\nto copy over a hundred times.\"<br />\nIn the rest of his talk Count Tlstoy told about 'his father's home<br />\nlife, his ;eat period of moral difficulty, and the search for a satisfying religion.<br /><br />\nYOU'LL LIKE BOWLING ,AT THE<br />\n\"<br />\n'ARCADE<br />\nATOP NORTH AVE. MARKET<br />\n\"<br />\n72/ ALLEYS<br />\nBowling Keeps You Fit!<br /><br />\nINTER COLLEGIATE<br />\n- NEWS - B. B. Jones, Mississippi philanthropist, has sent some carloads of<br />\napples to the suffering students of<br />\nthe state from his plantation in Virginia.. Blue Mountain College, Mississippi Synodical College, Holly<br />\nSprings, Delta State Teachers College, and Grenada College were the<br />\nbeneficiaries.<br />\nAt least one of them should give<br />\nthe worthy Mr. Jones an LL. D., or<br />\nat least some Mississippi applejack.<br /><br />\nContinued from Page 1, Col. 1<br /><br />\nFIDELITY AND DEPOSIT CO.<br /><br />\nting\" can be in some cases a perfectly legitimate and ethical<br />\nmeans of sex expression. An engaged couple, for instance, have a<br />\nperfect right to express themselves to each other through the<br />\nmediums of their, love. Petting<br />\ncan be as beautifully ideal and<br />\nsacramental as intercourse between man and wife if accompanied by mutual love and mutual<br />\nfeelins. If the thing is merely a<br />\nsuperficiality there is no mutuality of feeling and there is riethical justification.<br /><br />\nof Maryland<br /><br />\nProgress of the higher learning<br />\nin Kansas Wesleyan University, as<br />\nreported by the accurate Wesleyan<br />\nAdvance: \"'I do not believe,' says<br />\nDean. King, 'that the teaching of<br />\npenmanship is practical.'\"<br /><br />\nDr. Eddy also brought out that<br />\nunder certain circumstances Companionate Marriage was justified.<br />\nHe showed the case of a ppor<br />\nyoung man and woman who love<br />\neach other dearly, but cannot afWe are 'pleased to report that the ford matrimony. If they wait for<br />\nWellesley College girls have at last 10, perhaps 15 years they are<br />\ntaken to pure sports, to: wit/ hoop- passing by the best years of theit<br />\nrolling. And now the epidemic has lives, and to satisfy their natural<br />\nspread to Dartmouth, where the<br />\nder.ires.theinan will in most cases<br />\nfreshmen have been obliged to roll<br />\n.lower himself to a prostitute and<br />\nhoops around the solemn and anci-,<br />\nunhappiness and ruined lives are<br />\nent town of Hanover.<br />\nthe results. Dr. Eddy assailed<br />\nAt Smith College, ihey are giv- fiercely the terrible, conventionaling courses in beauty culture to pro- istic laws, whereby a mother was<br />\nduce beautiful students. At Vas- forbidden by the state under pensar they ,are giving courses to proimprisonment and fine to<br />\nduce beautiful homes. Which is alty of<br />\njust another argument in favor of possibly save her life by taking<br />\nthe advice of her physician and<br />\npolygamy.<br />\navoiding the deliverance of anBLUE JAYS LOSE TO<br />\nother child. She is also proseST. JOHN'S ELEVEN<br />\ncuted for merely, advising her<br />\nContinued from Page 1, Col. 6<br />\ndaughter to spare her health by<br />\nLine-up:<br />\nSt. John's<br />\nHopkins<br />\ncontrolling the number of her<br />\nMcLean children.<br />\nLove<br />\nLE<br />\nO'Connor,<br />\nKeating<br />\nL.T<br />\nL.G.Jones<br />\nTobin<br />\nThere will be one junior<br />\nStrader (Capt.)...C.(Capt.) Turner<br />\nand one sophomore added<br />\nMorris<br />\nR.G<br />\nKegan<br />\nto the membership of the CoKeller<br />\nBialoskorsky ...R.T<br />\ntillion Board. Any one de- Smith<br />\nRE<br />\nsiring to be considered will<br />\nRosenberg<br />\nplease be present at the<br />\nQ.B<br />\nCasassa<br />\nLyons<br />\nmeeting on Friday, NovemR.H<br />\nW. Lynch<br />\nBesore<br />\nber 23, at 12.20 in Room<br />\nArtnacoSt<br />\nL.H<br />\nMills<br />\n114, M. E.<br />\nSpring<br />\nF.B<br />\nCaplan<br /><br />\nHOPKINS ALUMNUS<br /><br />\nHE'S<br /><br />\nAll Lines of Insurance<br /><br />\nGROUND FLOOR, FIDELITY BLDG<br />\nD. C. HANDY,<br /><br />\nPhone PLaza 0800<br /><br />\nManager<br /><br />\nDECORATIONS<br /><br />\nINTERIOR %)OD WOR1C<br /><br />\nJOHN C. KNIPP ei SONS<br />\nFURNITURE<br />\nBALTIMORE. MD<br />\nShow Rooms<br />\n343 N. Charles Street<br /><br />\n, Factory<br />\n606:-&amp;-puluki Street<br /><br />\nNiiBiiih<br />\nanlik-YashionedOxfordi<br />\nwear,the Tummo<br />\n—a Nunn-Bush Ankle-Fashioned plain toe patent pump.<br />\nAlso in Dull Calf.<br /><br />\nFOR formal<br /><br />\nTHIL<br /><br />\nUMITYOHOP<br />\nCollar Hu Clothes<br />\nDaft/mare<br /><br />\nnt.ni-AED<br /><br />\n,..ta<br /><br />\nobelystmett<br /><br />\nBy BRIGGS 1<br /><br />\nNOT A COU41-4<br />\nWu A CAR.L.OAD<br />\nHARRY, V1/4-11-4Y<br />\nDON'T You<br />\nGET vvt5E<br />\nTo THErs1<br /><br />\nBY COUGH'<br /><br />\nPhone, Plaza 1062<br /><br />\nBALTIMORE BRANCH OFFICE<br /><br />\nrWhen a Feller Needs a Friend<br />\n$ THE<br />\nFIFTH PLATE<br /><br />\nFORDYCE E. C. CAMPBELL<br /><br />\nFidelity and Surety Bonds<br />\nBurglary and Plate Glass Insurance<br /><br />\nFoR GOODNESS<br />\nSAKE, GivE<br />\n\"Na<br /><br />\nOLD GOLD<br /><br />\nEt rHER HE<br />\nSWEARS HE'LL<br />\nSTART<br />\n3MoK.11.44<br />\nOLD GOLDS<br />\nOR HE SThys<br />\nOUT<br /><br />\nJ. A. RITTER. El SON,<br />\nFlorists and Decorators<br />\nBALTIMORE, MD.<br /><br />\n19'18 N. CHARLES ST., Near 20TH.<br />\nPhone, VErnon 0573<br /><br />\nTHE GIANT<br /><br />\nESSO<br /><br />\nPOWER FUEL<br /><br />\nNEW -LIFE<br />\nFOR MOTORS<br /><br />\n\"STANDARD\" MOTOR OIL<br />\nThe Measure of Oil Value<br /><br />\nSTANDARD OIL—COMPANY OF N.<br /><br />\neA. H. FETTING<br />\neNIANUFACTURING JEWELRY CO.<br /><br />\nPc4-47f,<br /><br />\nManufacturers<br /><br />\nGreek Letter Fraternity Jewelry<br />\n314 NORTH CHARLES STREET<br /><br />\nHENNEGEN-BATES COMPANY<br />\nJewelers<br /><br />\nand Silversmiths<br /><br />\nsince<br /><br />\nDRESS SETS<br />\nfor evening wear'7 and 9 East Baltimore Street<br /><br />\n1851<br /><br />\nOF<br /><br />\nTHE PICTURE<br /><br />\nMEMBERS FLORISTS TELEGRAPH DELIVERY ASSOCIATION<br /><br />\n«<br /><br />\n,<br /><br />\nGOLD<br />\nOLD<br />\nThe Smoother and Better Cigarette<br />\nnot a cough in a carload<br />\n0?.Lorillard Cs,Bat. 570<br /><br />\n1928<br />\nTHE JOHNS HOPKINS NEWS-LETTER, NOVEMBER 20,<br /><br />\n4<br /><br />\nFlat Tire<br />\nCall Barry<br />\nVernon 4183<br /><br />\nHOOD TIRES<br />\n-We Hurry\"<br /><br />\nFLARE-UP PROVIDED BY<br />\n'COUNT ILYA TOLSTOY TRIPLE<br />\nEDDY, SEX, AND COLORED LIGHTS<br />\n!Tireworks to the right 'of hint, group of highly* condescending<br />\nADDRESSES MEETING fireworks<br />\nto the left of hint.\" To Juniors and eniors willing to sacriSon of Russia's Famous Writer<br />\nIs Adopted American<br />\nC. E. HALL CROWDED<br /><br />\nLeavesTobacco<br />\nTin as All-time<br />\nCalling Card<br />\nCalgary, Alta.,<br />\nMarch 4, 1928<br /><br />\ntLarus &amp; Bro. Co.,<br />\n'Richmond, Va.<br />\nV. S. A.<br />\n'Gentlemen:<br />\nWhile in Banff, Alberta, in 1909, I<br />\ntlimbed Tunnell Mountain. On top of<br />\nthis mountain there is a elfin of stones<br />\nwhere tourists leave their cards with<br />\nremarks about the scenery, etc. Not<br />\nbating a card with me., I Ieft a tin of<br />\nEdgeworth Sliced', scribbled my name<br />\nand address on a piece of paper, and<br />\nsaid. \"Have a fill on me.\"<br />\nI have kept up a haphazard correspondence with one of three who wrote<br />\nme thanking me for the Pipeful of<br />\nEdgeworth. What makes me write<br />\nyou is that today from Australia I<br />\nreceived two SliCef,of Edgeworth with<br />\nthe words,\" Have a fill on me,\" so you<br />\nsee Edgeworth keeps friends friendly.<br />\n,Yours sincerely,<br />\nP. B. Johnstone<br /><br />\nEdgeworth<br />\nExtra High _Grade<br /><br />\nSmoking Tobacco<br /><br />\nCOLLECT TWICE<br />\nIf you could talk with the hi; men and<br />\nthose who convey that .ery attitude whom<br />\nwe tailor, you'd understand what it's all<br />\nabout. To look at him might sufice be.<br />\ncause of the charm and personal4ty we_<br />\nbuild in his clothes.<br />\nWe will do the same for you and include<br />\n• quality in the cloth and construction<br />\nthat will outwear two dollars spent any<br />\nother way. You collect twice on every<br />\ndollar with us.<br />\nTWO GRADES ONLY<br /><br />\n$28.75<br /><br />\n$38.75<br /><br />\nWILLARD TAILORING CORP.<br />\n120 West Fayette St.<br />\nPint<br /><br />\nFloor<br /><br />\nLUKE 1111tVIN4<br />\nA UODY IV<br />\nFISHEIR<br /><br />\nNecks by request...,<br />\nThe lines and grace<br />\nof a Braeburn Prom<br />\nTHK, have an ele-<br /><br />\ngance equalled only<br />\nby the finest.<br />\nThat it is forty<br />\ndollars is your<br />\ngood fortune.<br />\nCloduers and Halxrdasheys<br /><br />\nTuIrlIEL131EIRT...<br />\n17 E Baltimore St.<br /><br />\nMany Stand to Hear Talk on<br />\n\"Tolstoy and Russia\"<br />\n\"The great advantage the United<br />\nStates has received front Bolshevism is that it has given us the 'eminent son of Tolstoy. That he has<br />\nbecome a thorough American can<br />\nbest be.shown from his own words.<br />\nWhen I met him a little while ago<br />\nI said I should surely recognize him<br />\nfrom the portraits of his father to<br />\nwhich he replied \"It cotslcle.lnly have<br />\nbeen I or one of the Smith Brothers<br />\nthat made the cough drops.\" With<br />\nthese words of introduction Dr.<br />\nLancaster presented Count Ilya Tolstoy to a most appreciative audience<br />\nwhich crowded the C. E. Hall last<br />\nThursday. The reference to *hirsute -adornment provoked _much_ applause..<br />\n• Hundredth Anniversary<br />\n\"The whole world was celebrating<br />\nthe hundredth anniversary of the<br />\nbirth of my father this year. My<br />\nfather was born September 18.<br />\n1828. It is hard for us to realize<br />\nthe condition that prevailed in this<br />\ncountry and in Russia at that time.<br />\nThey did not know matches or kerosene, there were no railways and<br />\nthe telegraph and telephone had not<br />\nbeen invented, there were no automobiles. They were living in the<br />\nmost primitive conditions. I ant inclined to think that-living in their<br />\nprimitive way they were much more<br />\nhappy than we are With our electricour telephones,--our poison gas.<br />\nMy father was born underthe reign<br />\nof Nicholas I at a time When slavery<br />\nwas a very common thing and men<br />\nand women were bartered for<br />\nhorses or cattle, or a trained bear.<br />\nSoldiers were flogged to death in<br />\nthe 'Army.<br /><br />\nRequired<br /><br />\nNo Deposit<br />\nfice a bit of their valuable time and<br />\nUniversity Students<br />\nhard earned (?) money for \"dear .<br />\nof Johns Hopkins<br />\nold Johnny Hopkins.\"<br />\nLight and Loom<br />\nBuicks<br />\nSide by' side with these were the<br />\nhard Sts.<br />\nthe<br />\nin<br />\nfireworks<br />\nmoral And mental<br />\nChevrolets ,<br />\nPLaza 6000 •<br />\nform of ,Dr. Eddy's little pamphlet<br />\n1723-25 N.<br />\nChryslers<br />\nCharles St.<br />\non Sex and Youth. Selling for fif4049<br />\nVEmOn<br />\nHupmobiles<br />\nteen cents apiece or thrdel for a<br />\n2402 Pennsylquarter,• these ...little pamphlits disWillys-Knights<br />\nvania Ave.<br />\nthe<br />\n'Had<br />\ns.<br />\nappeared Re--NM:take<br />\n.<br />\nLAfiyette 2000<br />\nanti-militaristic<br />\npacifistic ,- and<br />\nBaltimore Concedes Milestone Supremacy<br />\nspeaker of the morning been able to<br />\na '<br />\nsee the .proceeds taken up in an<br />\nR. 0. T. C. cap his hair would have<br />\nrisen up on end in the,,most apThen came the actual fireworks. proved Harold Lloyd manner. BeOn the platform at the rear end of fore long - the. st*k.--had. been exthe hall were sold the red and green hausted and the youth of the camflares by the light of which St. pus Was devouring about thirty dolJohn's is to be banged. drawn and lars' worth of SZ,x. Rumor has it<br />\nquartered—in efffgy. Green= tied that three of the most prominent<br />\nFrosh urged by Johnnie Norris' an- members of the \"Y\" Cabinet had to<br />\nnouncement of Student Council'en- ekertiall.their \"Pull\" to•get the last<br />\nforcement were seen purchasing the trio of copies. Thus with three<br />\nneceSSity -fliteK More sal-ASH-tared kinds of fireworks -iinloaded On the<br />\nSophomores. \"invited\" as their vetstudents by eve, ear and hand: the<br />\ndarn hued rivals by some hard, inof one exciting morning was<br />\nepic<br />\ndiscriminate fate, also-Purchase-EV<br />\nThen. complete. A hot time was had by<br />\nSupply ..,of pyrotechnics.<br />\nmirabile dictu, appeared a small all.<br /><br />\nignobly paraphrase Tennyson's famous poem (with customary apologies to the original) these words<br />\nmight well describe the feelings of<br />\nthose Who attended last Thursday's<br />\nassembly. First came the verbal fireworks in Dr: Eddy's highly Charged<br />\naddress. Birth Control,'petting, the<br />\nmail censorship laws, and many<br />\nother sex problems kept a crowded<br />\nassembly hall listening for something they did not get. The thrill<br />\nhunters wfre disappointed but the<br />\nthOughtfvfl student had found something to think about.<br /><br />\nenyou use the<br /><br />\nJAY HARRIERS WIN FIFTH<br />\nPLACE IN MIDDLE STATES<br />\nSchiebel Finishes Third; Se en<br />\nColleges Enter Tea<br />\nJohns' I lopkins. cr, — country<br />\nteam placed fifth in the Middle Atlantic States Intercollegiaie Championships in Van Courtland Park.<br />\nNew York City. Herman Schiebel<br />\nof Hopkins won third place„being<br />\nthe first Tay, to finish. The, next<br />\nBlack and Blue runner was Miller',<br />\nwho finished twenty-seventh. Kelly<br />\nWas thirtieth. Emerson thirty-fifth.<br />\nOnaratp.,thirty-ninth. l_oiseaux forty-Erst,,and Waters-isixty-first. The<br />\nteam scre4.was 113.<br /><br />\nRemington<br />\nPortable<br /><br />\nCONFERENCE IS HELD BY<br />\nENGINEERING SCHOOL<br />\nImpregnated Paper Insulation Is<br />\nSubject<br /><br />\nW<br /><br />\nContinued front Page t, Col. 2<br /><br />\nITER'S cramp may sound<br />\nlike a joke to some, but to the student<br />\nwho has spent several long hours<br />\nwriting a thesis or report by hand, it<br />\nlooms as a very real malady.<br />\nEliminate the drudgery and slowness<br />\nof writing by hand-'-get a Remington.<br />\nPortable.' Your work will be neater<br />\n.. and you'll get it done far more quick(y.<br />\nRemington Portable is the smallest,<br />\nlightest, most compact and most dependable portable with standard keyboard. Carrying case only 4 inches<br />\nhigh. Weighs (02 pounds, net,<br /><br />\nThe basic technical session began at ten. Various electrical experts gave reports, and conclusions which they had reached.<br />\nAmong these, the Most interesting, were t-ss:o reports on \"The<br />\nStudy of Mechanism of Cable Deterioration,\" given by C. F.<br />\nHershflkl; -Detroit Edison Co.,<br />\nanclsorie on \"Public Utilities and<br />\nResearch', by \", D. W. Roper Of<br />\nCommonwealth Edison Co.<br />\nLuncheon<br /><br />\nLuncheon was thenlield ih the<br />\nAllred University won the team AlumniThlemotial Dormitory. At<br />\n, 'Descendants of First King<br />\nchampionship and New York<br />\n2.30 P. M. the discussions were<br />\n\"The Tolstoys came tovR,ussia in<br />\nversity.took tirst,and second places:- resumed: Professor'. Whitehead<br />\nabottt the fourteenth century.' The<br />\nU. covered then gave a' description of the<br />\n'Nat Lerner -of N..<br />\nancestors of my father's- mother<br />\nthe six-mile epluse in thirty--one work in progress at Hopkins in<br />\nwere direct descendants of the first<br />\nminutes-and. eighteen seconds. Phil the laboratories of Electrical EnRussian King. In the big hall of<br />\nEdwards. negro stab of the same gineering. The entire group then<br />\nYasnaya-Polijana hung many picUniversity; finished twenty yards inspected the work being done at<br />\nOne<br />\nancestors.<br />\nfather's<br />\ntures of my<br />\nbehind him. Schiebel came in third.<br />\npicture was of my father's grand- while Getz and Z. Schley of Alfred, Hopkins at the present time. Friday night all the members of the<br />\nthe<br />\nat<br />\nfather, who was prominent<br />\ntook fourth and fifth prizes. Sixth,<br />\ncourt of Catherine the Great. He seventh, eighth, and ninth places conference met for dinner at the<br />\nquarreled with the Empress and Rothmann Boulton, Marps, and Belvedere. At eight-fifteen that<br />\nthen retired to his country home. Brown, all of Alfred. The score night the majority alfrithe scienThere he educated his two daugh- by teams gave Alfred first place tists attended the meeting at the<br />\nters. In his picture his eyebrows with thirty-three points: New York Engineers' Club of the Baltimore<br />\nwere thick and his eyes so piercing U. second with forty-six: Lafayette section of the A. I. E. E. Mr. D<br />\nthat I, as a child, was quite afraid third With eight-nine: Union fourth H. ROwland. research engineer of<br />\nof him. fo'r be seemed to watch -with a hundred and four : Hopkins the Locke Insulator Corporation.<br />\nwas the guest of honor,<br />\nAnother<br />\nmy verf movements.<br />\nfifth • with a hundred and ,thirteen:<br />\nDiscuision Continnii. r of my 'father had his Rutgers sixth with a hundred and.<br />\ngiandfathe<br />\nA continuation ,of the disctt.,.<br />\nportrait there: he was the antithesis eighteen, and Lehigh last with a<br />\nsion of the research reports was<br />\nof the first. He spent .his fortune hundred and twenty-seye.<br />\nbegun at 9.30 Saturday morning.<br />\nentertaining his friends and guests.<br />\nEdwards-Versatile<br />\nHe had the idea, as some do nowOne of the peculiar event.: Three discussions of importance<br />\nadays that domestic articles were which occurred in the running of were held at this time. The first<br />\n. a discusSion on \"The Supprestticin<br />\nworthless and desired every thing the race was.the placing of Phil F41-imported. He would wear his linen wards of N. Y. U. second. If there of Edge Effect in Breakdown<br />\nonly if it were laundered in 14°1- was ever a More versatile track man Tests and Its Consequences.\"<br />\nSo-lie sent to Holland on than Edwards, he has ..0t bekn was given hy-Prof-V-- -Bush- of<br />\nhorse and 'on the way through heard of. Starting iikff his college the Massachusetts 'Institute of<br />\nCharnpaigne the rider bought rare career in sprints, he gradually work- Technology: It was very well re- I<br />\nwines, and in Bordeaux, Reni Wine. ed up to. middle distances. Last ceived. \"The Losses in Solid Di- 1<br />\nand the lovely glassware of Bo- year he \"ian Away\" with both the electrics and in Ionized Gas<br />\nhemia. His Men traveled all he 440 and -880,itt the Middle State Films\" was the second report.<br />\nyear around for there was always Championships. Shortly after this given by C. L. Dawes of Harvard.<br />\nlinen to be laundered.<br />\nhe was selected for the Canadian The last report was rendered by<br />\nteam and at Amsterdam Prof. E. B. Paine of the UniverOlympic<br />\n\"Ms- father's parents died when he<br />\n,<br />\nover the \"Nebraska Fly- sity of Illinois.<br />\nvictor<br />\nwas<br />\nwas quite young. His mother died<br />\nTwo research committees then<br />\nyear,crossThis<br />\nHahn.<br />\nLloyd<br />\ner,\"<br />\nwhen he was two and his father<br />\nheld their sessions. The most imwhen he wag nine, and . he was country*has been added to the list<br />\nportant was a meeting of the<br />\nbrought up by a distant relative. I of his accomplishments. •<br />\nThere was some slight protest due committee on Electrical Insularemember her when she was about<br />\nB. Whitehead was its<br />\nseventy. I was about six 'when she to alleged cutting of curves but no tion. J.<br />\naction was taken. The Van Court- chairman. It summed up the<br />\ndied.\"<br />\nland course is three miles long and chief work and aims of the con\"After slight success at the Uni- was covered twice. The start \"and ference. The committee then adversity, Tolstoy retired to Yasnaya- the first mile are on level ground. journed after holding luncheon<br />\nPolijana. where he lived rather a In the Second mile there is a high in the Alumni Memorial Dormidissolute life with his friends. He hill and the third mile is on level tory.<br />\nenjoyed cards and drinking, life was ground again. The Hopkins squad,<br />\neasy. The days were 'N‘rein, Vsreib consisting of seven men, and Coach<br />\nHambleton,left Baltimore Friday<br />\nund Gesang.'<br />\nafternoon. The meet took place<br />\n\"To all outward appearances he Saturday. and some of the team rewas just a wealthy country gentle- turned that night: the remainder<br />\nBALTIMORE<br />\nman. I say to all outward appear- staying over until late Sunday.<br /><br />\nCash or convenient terms.<br /><br />\nAlfred U. Wins<br /><br />\nY.<br /><br />\nThe READ TAYLOR CO<br />\nADVERTISING<br /><br />\nREMINGTON RAND<br />\nBUSINESS SERVICE, INC.\",<br /><br />\n--<br /><br />\n130 W. Payette Street<br />\nBALTIMOREAMD.<br /><br />\nw(<br />\nin<br /><br />\nP,<br />\nco<br />\nth<br />\nen<br />\nI;a<br />\nde<br /><br />\n-<br /><br />\ntw<br />\nre:<br />\nGo<br />\nsk<br />\nlit<br />\ns Le<br />\n0'<br />\nen<br /><br />\nIs<br />\nho<br />\nan<br />\nitti<br /><br />\nRo<br />\nto<br />\na<br />\n'Th<br />\neig<br />\nof<br />\nSb<br />\nsOt<br />\nF1,<br />\ndot<br />\nart.<br />\ntea<br />\nthe<br />\nrep<br /><br />\ntea<br />\nsot<br /><br />\nmut<br />\nthe<br />\n\\I<br />\n•it•<br />\nan,<br />\nre,<br /><br />\n.<br /><br />\n--<br /><br />\nTHE CURRENT .<br />\n,TYLES<br />\nCLOTHES, HA TS,...V110:-.T<br />\nAND HABERDASHERY<br />\nFoR<br />\n...LOUNGE,'SPORTS .4ND<br />\nCAMPUS USAGE<br /><br />\nWILL BE<br /><br />\nEXHIBITED I '.X.x.24,.c TOWN<br />\n0.V DATE GIVEN<br />\nBELOW.<br />\nYOU ARE<br />\nCORDIALLY<br />\nYlTtij TO<br /><br />\n'v.<br /><br />\nA TTEND.<br /><br />\nAt<br />\nSTUDENT BOOK STORE<br />\n1818 E. Monument St.<br /><br />\nFriday,' November 23rd.<br /><br />\nHarry Schein, Rep.<br /><br />\nNZSV YO.<br />\nJACES01,4 ZOO aaaaa<br /><br />\nii,exidwoo<br /><br />\nth,<br />\n. mit<br />\n-tt.t<br /><br />\ntan<br />\nmet<br />\npalI•<br />\nclot<br /><br />\nden<br />\nrus<br />\nthe<br />\nsity<br />\ngan<br /><br />\nany<br />\nfew<br />\nver<br />\nson<br />\nball<br />\nthe<br />\nspe,<br />\nthe<br />\npeel<br />\ncoil<br />\nfact<br />\ngetl<br />\neau<br />\nthei<br />\nten<br /><br />\nat t<br /><br />"}], "field_media_file": [{"target_id": 38308, "display": null, "description": null, "target_type": "file", "target_uuid": "f1490485-a8ad-4310-b449-80db5acbc1fb", "url": "http://digital.library.jhu.edu/system/files/2022-03/13343-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13343, "target_type": "node", "target_uuid": "2a1b8d4d-7c6a-43ae-a24c-15da0de92b50", "url": "/node/13343"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "4f598a1b-2af9-4041-bf43-01f05063f5a0"}]}