{"mid": [{"value": 51054}], "uuid": [{"value": "810cfec6-d372-4da0-93af-56dc26a3f767"}], "vid": [{"value": 51054}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-19T16:02:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 534, "target_type": "user", "target_uuid": "dfa33910-e475-482d-9fb2-7c268bc2ee7b", "url": "/user/534"}], "name": [{"value": "15668-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-19T16:02:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-19T16:02:17+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": " <br />\n<br />\ne<br />\n<br />\n <br />\n<br />\n <br />\n<br />\nT TR TN T NS T<br />\n<br />\nT T AT TN T T TS<br />\n<br />\nRS<br />\n<br />\nT<br />\n<br />\n13<br />\n<br />\n <br />\n<br />\nZOOLOGY,<br />\n<br />\n <br />\n<br />\ntatives; two of the crabs of the coast are sold in<br />\ngreatnumbersin the Baltimore market ; the largest of<br />\nthese is the Lupa diacantha, Say. Lobsters (Homarus<br />\nAmericanus) are an extensive article of consumption.<br />\nNo species is more abundant than the singular king-<br />\ncrab (Limulus polyphemus), whose relationships appear<br />\n<br />\nto be with the old forms of the coal and earlier peri--<br />\n<br />\nods of time.<br />\n<br />\nThe largest from fresh waters are the crawfishes<br />\n(Astacus), which abound in every stream. The little<br />\nBranchiopods occur also in the streams. Some spe-<br />\ncies are parasitic on fishes. The Isopods are repre-<br />\nsented by the very abundant ¢ wood-lice,” which are<br />\nof the very few land Crustacea. The Entomostraca<br />\nhave a hinged shell, shaped like that of a muscle;<br />\nthere are many minute species.<br />\n<br />\nThe Myriapods, or centipedes, abound. One long-<br />\nlegged, short-bodied species (Cermatia forceps), is<br />\ncommon in out-buildings and cellars, and is very<br />\nuseful in destroying insects. The active species of<br />\nthe field and wood are also carnivorous (Seolopocriyp-<br />\ntops, Lithobius, et al.), and inflict sharp but harmless<br />\nbites on the finger which attacks them. The Spiro-<br />\nbolus is large and red-ringed, and exudes a pernicious<br />\nfluid, like nitro-muriatic acid; and in the same way,<br />\nthe stout, short Polydesmus discharges a substance<br />\nwith the smell of prussic acid.<br />\n<br />\nSpiders, or Arachnida, are very abundant in spe-<br />\ncies, and many are of brilliant colors and singular<br />\nforms. Though we have no tarantula, a common<br />\nspecies of the same genus (Mygale) spreads over an<br />\narea of two inches in diameter with the feet. Wood-<br />\nticks (Zzodes) are also abundant.<br />\n<br />\nThere are probably 25,000 species of insects in the<br />\nState. All the orders are abundantly represented,<br />\nbut those which embrace the greatest number of spe-<br />\ncies are the Coleoptera, Hymenoptera, and the Lepi-<br />\ndoptera ; that is, the beetles, the wasps, bees, ete.,<br />\nand the butterflies. The Neuroptera (dragon-flics,<br />\ncte.) are carnivorous, and are friends of the farmer.<br />\nBesides the numerous diurnal dragon-flies, the Chauli-<br />\nodus and Sialis, with leaf-like wings, and altogether<br />\nan ancient type, fly at night. So does the little<br />\ngreen Chrysopa, which has a vile smell of sulphuret-<br />\nted hydrogen.<br />\n<br />\n\" We have in Maryland one termito (ZTermes flavipes),<br />\n<br />\nwhich, though not so injurious as its congeners of<br />\nthe tropics, creates havoc in gate-posts, door-steps,<br />\ndry floors, ete.<br />\n<br />\nThe grasshoppers (Orthoplera) sometimes increase<br />\n80 as to be injurious to the farmers, but never to the<br />\nextent seen in Western America and Asia. The<br />\nmusical insects are all here. The katydid (Platy-<br />\nphyllum concavum) makes the summer woods uproar-<br />\nious; in the fields hot with the blazing sun, other<br />\nspecies sing like thousands of small shuttles flying;<br />\nand the shrubberies are vocal at evening with the<br />\nmusical thrill of several species of @canthus.<br />\n<br />\nThe list of beetles is endless, and many of them<br />\nremain unnoticed by naturalists. Many mischievous<br />\npests belong here, which have made great havoc with<br />\nour trees and crops. Thus, of the long-horns, several<br />\nspecies of Saperda bore our fruit and hedge-trees to<br />\ndeath; the Clyfus has ruined our locust groves (Ro-<br />\nbinia pscudacacia); the Oncideres girdle our hickorics;<br />\n<br />\n~the Curculios sting the fruit to such an extent as to<br />\n<br />\nruin some crops entirely. Thus, plums can no longer<br />\nbe raised near Philadelphia without extraordinary<br />\nprotection, and cherries suffer severely. Few apples<br />\ndo not contain worms. Species of Baridius bore<br />\nstems of the potato, and admit water, which causes<br />\nrot. The European grain-weevil has come over to<br />\nshare the victories of his tribe.<br />\n<br />\nThe Phytophagous beetles are no better. The<br />\n<br />\nGaleruca vittata has destroyed many elms by eating<br />\nthe leaves. Other species eat our cucumbers and<br />\ncabbages. To keep down these marauders, many<br />\ncarnivorous species exist. Some species of Iyiia<br />\npossess some value as blistering-flies, and one of<br />\nthem (L. vitlata) eats up the potato tops. Some fif-<br />\nteen species of fire-flies spangle the evening shades,<br />\nbut none of them are very large.<br />\n<br />\n <br />\n<br />\nThe wasp family is largely represented; but the<br />\nbee is rot a native of the State or Continent. Nu-<br />\nmerous relatives of the wasps build nests of varied<br />\nconstruction, and defend them with formidable<br />\nstings. The most numerous family of the Iymenop-<br />\ntera is that of the JIehneumons, which check other in-<br />\nsect life by laying eggs in the grubs. The galls<br />\n(Cynipidee) are scarcely less abundant; their sting-<br />\nexcrescences deface almost every species of wild<br />\nplant.<br />\n<br />\nAnts abound, and some are of large size. But<br />\nfew are injurious, though two species infest houses.<br />\nThe largest of the order, species of Stizus, are com-<br />\nmon. They have stings which inflict serious wounds.<br />\nThey burrow in the earth, where they lay up a store<br />\nof Cicaaz. They are called “tiger hornets.”<br />\n<br />\nThe Dptera, or flies, abound in blood-sucking spe-<br />\ncies, from horse- and ox-flies an inch long, to the<br />\ndelicate mosquito and minute black midge. Hemip-<br />\ntera. furnishes the rattling Clcada (“locust” of the<br />\ncommon people), the well-armed Reduvius, and a<br />\nhost of plain and gay plant-suckers. The bed-bug,<br />\nunfortunately, occurs, but is an importation from<br />\nEurope.<br />\n<br />\nThe Lepidoptera embrace many species of much<br />\nbeauty, especially among the diurnal species; never-<br />\ntheless, our region cannot claim preéminence in these<br />\nas much as in the numerous and large species of the<br />\nSaturnia and Cossus types. The former make large<br />\ncocoons of coarse silk, which can be easily cultivated,<br />\n<br />\nand will probably give rise to a silk industry at a<br />\n<br />\nfuture day. The nocturnal species, or millers, ete.,<br />\nare legion, and their work is generally unfavorable<br />\nto agriculture. Their eggs produce cut-worms,<br />\napple - worms, ete., and multitudes of leaf-borers,<br />\nwhose sinuous tracks can be seen in some leaves of<br />\nalmost every native plant,<br />\n<br />\nThere are many species of Molluses in Maryland,<br />\nwhich are of course either marine, fresh-water, or<br />\nterrestrial. The first abound on the coast; the two<br />\nspecies of Busycon may be noted as the most striking.<br />\nIn the bays, as the Sinepuxent, cte., and in the<br />\nestuary of the Chesapeake, the oyster (Ostrea Virgin-<br />\nica) abounds, which furnishes the basis of such exten-<br />\nsive industries in Baltimore and other places. The<br />\nformer are far more numerous in the tributaries of<br />\nthe Youghiogheny than elsewhere, and consist mainly<br />\nof pearl muscles (Unio and Anodonta). The species<br />\nand individuals are abundant, and. of beautiful color<br />\nand lustre. They are employed in making pearl<br />\nbuttons. The land or air-breathing species are, on<br />\nthe other hand, Gasteropods of the Pulmonate division.<br />\nThey chiefly abound in the limestone valleys of the<br />\nAlleghanies and the coal regions, on account of the<br />\nabundance of materials for constructing their spiral<br />\nshells. There are about 65 species in the State, of<br />\nwhich a considerable proportion would be termed<br />\nsnails. Some are moderately large, but a majority<br />\nare small, many extremely so.  Two species (Zeben-<br />\nnophorus) are without shell ; both are common.<br />\n<br />\nThe Polyzoa is a group of minute molluscs having<br />\na common house or domicil, which extends over<br />\nstones or other objects, branching after the manner<br />\nof corals. Several species oceur in our streams and<br />\nponds; one of them (Pectinatella magnifica) is the<br />\nlargest in the world. It forms gelatinous masses<br />\nround roots or sticks, and contains hundreds of indi-<br />\nviduals. ;<br />\n<br />\nThe Radiate and Cewlenterate animals are marine.<br />\nThe sandy shores of the coast do not produce many<br />\nsedentary species, but meduse and the Portuguese<br />\nman-of-war abound. Acres of beautiful jelly-fish<br />\nmay be seen on the lower Chesapeake, which often<br />\nfurnish shelter and food for a little fish beneath their<br />\numbrella. The Hydra of fresh water is also a (-<br />\nlenterate. 1t is, in form, urn-shaped, with slender<br />\narms and a stem-like base attached to any support in<br />\nthe water. They are very simple in structure, and<br />\nlengthen their arms exceedingly in scarch of prey.<br />\nThey may be cut into small pieces, when each piece<br />\nkecomes a perfect Hydra. The lowest of animals<br />\n<br />\n <br />\n<br />\nare the Protozoa. They are unicellular, composed of<br />\naggregated similar cells or of uniform gelatine. Into<br />\nthe second class enter the sponges. A fresh-water<br />\nsponge (Spongille), whose substance is supported by<br />\nhorny spicules, occurs in sluggish waters in the<br />\nBrandywine and other streams,<br />\n<br />\nSECTION III.—DISTRIBUTION.<br />\n<br />\nWe will now take a bricf view of the relations of<br />\nthe Maryland fauna to those of other regions of the<br />\nearth.<br />\n<br />\nNorth America, of which Maryland forms a part,<br />\nembraces the Nearctic fauna. This one is more<br />\nnearly related in character to that of Europe and<br />\nNorth Asia (Palwarctic) than any other, though it<br />\npossesses an admixture of South American (Neotrop-<br />\nical) life. The most remote from it in character is<br />\nthe Australian fauna, then the Palwotropical (Indian),<br />\nand the African is a little nearer. The Nearctic<br />\nJauna is distinguished by its natural productions into<br />\nthe Fastern district (to the plains), the Middle (to the<br />\nSierra Nevada), the Pacific (the western coast), and<br />\nthe Sonoran, which includes Arizona, Sonora, and<br />\npart of Lower California. The Eastern district is<br />\ncharacterized, among other points, by the abundance<br />\nof tortoises and poverty in lizards, as seen above; by<br />\nthe presence of bony gars (Lepidosteus), pike (Esox),<br />\nand Nematognathi (catfishes). In the broad sense, the<br />\nlife of the district is characterized by the presence<br />\nof some ancient forms of life, which have passed<br />\naway in prior geologic epochs, though the Neotrop-<br />\nical and Australian fauna possess a still larger portion<br />\nof such. Thus, the snapping-tortoise and the Profo-<br />\nnopsis have fossil representatives in some strata of<br />\nEurope, and the extinct relatives of the bony gar<br />\nabound in still older rocks.<br />\n<br />\nAnother proportion of types may be considered<br />\nNeotropical (South American) in character. Such are<br />\namong Mammals, the opossum and the wood-mice<br />\n(Hesperomys); among Birds, the Tyrannide (king-<br />\nbird, pewees, etc.), the humming-birds (Zrochilus),<br />\nand the tanagers (Pyranga); among the Fishes, the<br />\nNematognathi may be mentioned.  Of especial North<br />\nAmerican character may be enumerated the raccoon<br />\n(Procyon), the skunks (Mephitis), and the lesser deer<br />\n(Cariacus); also the American porcupine (Lirethizon).<br />\nAmong birds, the turkey and the wood-warblers<br />\n(Dendreeca) belong especially to the Nearctic fuuna.<br />\nAmong reptiles, the rattlesnakes and copperheads,<br />\nthe whole of the salamanders except two species, and<br />\nespecially the Protonopsis and Necturus, are especially<br />\nNorth American.  Of this character, among the<br />\n<br />\n. fishes, are the gar, dog-fish, pike, and Etheostomine<br />\n<br />\nperch, an extensive group of small fishes without<br />\nswim-bladders, found in all streams.<br />\n<br />\nThere are certain climatal divisions of the fauna<br />\nof the Eastern district of North America, regulated<br />\nby the elevation of the surface, the latitude, temper-<br />\nature, ete. These have been named the Floridian,<br />\nthe Louisianian, the Carolinian, the Alleghanion, the<br />\nCanadian, the Hudsonian, ete. Maryland is traversed<br />\nby the Carolinian, the Alleghanian, and the Cana-<br />\ndian, and their boundaries separate the breeding-<br />\nplaces of various species of birds, and range of others,<br />\nof mammals, ete.<br />\n<br />\nThe greater part of the area of the State, that s,<br />\nthe low countries from the ocean to the Potomac and<br />\nto the line extending from Wilmington to Baltimoroe<br />\nand to Washington, D. C., is the especial range<br />\nof the mocking-bird, the blue grossbeak, the summer<br />\nred-bird (Lyranga wstiva), and others. Also of the<br />\npine meadow-mouse (Arvicola pinetorum), ete.<br />\n<br />\nThe middle part of the State is occupied by the<br />\nAlleghanian fauna, which extends north and south.<br />\nThe higher ridges of the Alleghany Mountains are<br />\nincluded in the Canadian, as indicated by the breed-<br />\ning of the snow-bird, various warblers, and the range<br />\nof some land animals. This fauna extends along the<br />\nmountains to Georgia. Our State, then, presents a<br />\nfine and prolific ficld to the student of Biological<br />\nScience.<br />\n<br />\n <br />\n\f", "format": "basic_html", "processed": "<br /><br />\ne<br /><br /><br /><br /><br /><br />\nT TR TN T NS T<br /><br />\nT T AT TN T T TS<br /><br />\nRS<br /><br />\nT<br /><br />\n13<br /><br /><br /><br />\nZOOLOGY,<br /><br /><br /><br />\ntatives; two of the crabs of the coast are sold in<br />\ngreatnumbersin the Baltimore market ; the largest of<br />\nthese is the Lupa diacantha, Say. Lobsters (Homarus<br />\nAmericanus) are an extensive article of consumption.<br />\nNo species is more abundant than the singular king-<br />\ncrab (Limulus polyphemus), whose relationships appear<br /><br />\nto be with the old forms of the coal and earlier peri--<br /><br />\nods of time.<br /><br />\nThe largest from fresh waters are the crawfishes<br />\n(Astacus), which abound in every stream. The little<br />\nBranchiopods occur also in the streams. Some spe-<br />\ncies are parasitic on fishes. The Isopods are repre-<br />\nsented by the very abundant ¢ wood-lice,” which are<br />\nof the very few land Crustacea. The Entomostraca<br />\nhave a hinged shell, shaped like that of a muscle;<br />\nthere are many minute species.<br /><br />\nThe Myriapods, or centipedes, abound. One long-<br />\nlegged, short-bodied species (Cermatia forceps), is<br />\ncommon in out-buildings and cellars, and is very<br />\nuseful in destroying insects. The active species of<br />\nthe field and wood are also carnivorous (Seolopocriyp-<br />\ntops, Lithobius, et al.), and inflict sharp but harmless<br />\nbites on the finger which attacks them. The Spiro-<br />\nbolus is large and red-ringed, and exudes a pernicious<br />\nfluid, like nitro-muriatic acid; and in the same way,<br />\nthe stout, short Polydesmus discharges a substance<br />\nwith the smell of prussic acid.<br /><br />\nSpiders, or Arachnida, are very abundant in spe-<br />\ncies, and many are of brilliant colors and singular<br />\nforms. Though we have no tarantula, a common<br />\nspecies of the same genus (Mygale) spreads over an<br />\narea of two inches in diameter with the feet. Wood-<br />\nticks (Zzodes) are also abundant.<br /><br />\nThere are probably 25,000 species of insects in the<br />\nState. All the orders are abundantly represented,<br />\nbut those which embrace the greatest number of spe-<br />\ncies are the Coleoptera, Hymenoptera, and the Lepi-<br />\ndoptera ; that is, the beetles, the wasps, bees, ete.,<br />\nand the butterflies. The Neuroptera (dragon-flics,<br />\ncte.) are carnivorous, and are friends of the farmer.<br />\nBesides the numerous diurnal dragon-flies, the Chauli-<br />\nodus and Sialis, with leaf-like wings, and altogether<br />\nan ancient type, fly at night. So does the little<br />\ngreen Chrysopa, which has a vile smell of sulphuret-<br />\nted hydrogen.<br /><br />\n\" We have in Maryland one termito (ZTermes flavipes),<br /><br />\nwhich, though not so injurious as its congeners of<br />\nthe tropics, creates havoc in gate-posts, door-steps,<br />\ndry floors, ete.<br /><br />\nThe grasshoppers (Orthoplera) sometimes increase<br />\n80 as to be injurious to the farmers, but never to the<br />\nextent seen in Western America and Asia. The<br />\nmusical insects are all here. The katydid (Platy-<br />\nphyllum concavum) makes the summer woods uproar-<br />\nious; in the fields hot with the blazing sun, other<br />\nspecies sing like thousands of small shuttles flying;<br />\nand the shrubberies are vocal at evening with the<br />\nmusical thrill of several species of @canthus.<br /><br />\nThe list of beetles is endless, and many of them<br />\nremain unnoticed by naturalists. Many mischievous<br />\npests belong here, which have made great havoc with<br />\nour trees and crops. Thus, of the long-horns, several<br />\nspecies of Saperda bore our fruit and hedge-trees to<br />\ndeath; the Clyfus has ruined our locust groves (Ro-<br />\nbinia pscudacacia); the Oncideres girdle our hickorics;<br /><br />\n~the Curculios sting the fruit to such an extent as to<br /><br />\nruin some crops entirely. Thus, plums can no longer<br />\nbe raised near Philadelphia without extraordinary<br />\nprotection, and cherries suffer severely. Few apples<br />\ndo not contain worms. Species of Baridius bore<br />\nstems of the potato, and admit water, which causes<br />\nrot. The European grain-weevil has come over to<br />\nshare the victories of his tribe.<br /><br />\nThe Phytophagous beetles are no better. The<br /><br />\nGaleruca vittata has destroyed many elms by eating<br />\nthe leaves. Other species eat our cucumbers and<br />\ncabbages. To keep down these marauders, many<br />\ncarnivorous species exist. Some species of Iyiia<br />\npossess some value as blistering-flies, and one of<br />\nthem (L. vitlata) eats up the potato tops. Some fif-<br />\nteen species of fire-flies spangle the evening shades,<br />\nbut none of them are very large.<br /><br /><br /><br />\nThe wasp family is largely represented; but the<br />\nbee is rot a native of the State or Continent. Nu-<br />\nmerous relatives of the wasps build nests of varied<br />\nconstruction, and defend them with formidable<br />\nstings. The most numerous family of the Iymenop-<br />\ntera is that of the JIehneumons, which check other in-<br />\nsect life by laying eggs in the grubs. The galls<br />\n(Cynipidee) are scarcely less abundant; their sting-<br />\nexcrescences deface almost every species of wild<br />\nplant.<br /><br />\nAnts abound, and some are of large size. But<br />\nfew are injurious, though two species infest houses.<br />\nThe largest of the order, species of Stizus, are com-<br />\nmon. They have stings which inflict serious wounds.<br />\nThey burrow in the earth, where they lay up a store<br />\nof Cicaaz. They are called “tiger hornets.”<br /><br />\nThe Dptera, or flies, abound in blood-sucking spe-<br />\ncies, from horse- and ox-flies an inch long, to the<br />\ndelicate mosquito and minute black midge. Hemip-<br />\ntera. furnishes the rattling Clcada (“locust” of the<br />\ncommon people), the well-armed Reduvius, and a<br />\nhost of plain and gay plant-suckers. The bed-bug,<br />\nunfortunately, occurs, but is an importation from<br />\nEurope.<br /><br />\nThe Lepidoptera embrace many species of much<br />\nbeauty, especially among the diurnal species; never-<br />\ntheless, our region cannot claim preéminence in these<br />\nas much as in the numerous and large species of the<br />\nSaturnia and Cossus types. The former make large<br />\ncocoons of coarse silk, which can be easily cultivated,<br /><br />\nand will probably give rise to a silk industry at a<br /><br />\nfuture day. The nocturnal species, or millers, ete.,<br />\nare legion, and their work is generally unfavorable<br />\nto agriculture. Their eggs produce cut-worms,<br />\napple - worms, ete., and multitudes of leaf-borers,<br />\nwhose sinuous tracks can be seen in some leaves of<br />\nalmost every native plant,<br /><br />\nThere are many species of Molluses in Maryland,<br />\nwhich are of course either marine, fresh-water, or<br />\nterrestrial. The first abound on the coast; the two<br />\nspecies of Busycon may be noted as the most striking.<br />\nIn the bays, as the Sinepuxent, cte., and in the<br />\nestuary of the Chesapeake, the oyster (Ostrea Virgin-<br />\nica) abounds, which furnishes the basis of such exten-<br />\nsive industries in Baltimore and other places. The<br />\nformer are far more numerous in the tributaries of<br />\nthe Youghiogheny than elsewhere, and consist mainly<br />\nof pearl muscles (Unio and Anodonta). The species<br />\nand individuals are abundant, and. of beautiful color<br />\nand lustre. They are employed in making pearl<br />\nbuttons. The land or air-breathing species are, on<br />\nthe other hand, Gasteropods of the Pulmonate division.<br />\nThey chiefly abound in the limestone valleys of the<br />\nAlleghanies and the coal regions, on account of the<br />\nabundance of materials for constructing their spiral<br />\nshells. There are about 65 species in the State, of<br />\nwhich a considerable proportion would be termed<br />\nsnails. Some are moderately large, but a majority<br />\nare small, many extremely so.  Two species (Zeben-<br />\nnophorus) are without shell ; both are common.<br /><br />\nThe Polyzoa is a group of minute molluscs having<br />\na common house or domicil, which extends over<br />\nstones or other objects, branching after the manner<br />\nof corals. Several species oceur in our streams and<br />\nponds; one of them (Pectinatella magnifica) is the<br />\nlargest in the world. It forms gelatinous masses<br />\nround roots or sticks, and contains hundreds of indi-<br />\nviduals. ;<br /><br />\nThe Radiate and Cewlenterate animals are marine.<br />\nThe sandy shores of the coast do not produce many<br />\nsedentary species, but meduse and the Portuguese<br />\nman-of-war abound. Acres of beautiful jelly-fish<br />\nmay be seen on the lower Chesapeake, which often<br />\nfurnish shelter and food for a little fish beneath their<br />\numbrella. The Hydra of fresh water is also a (-<br />\nlenterate. 1t is, in form, urn-shaped, with slender<br />\narms and a stem-like base attached to any support in<br />\nthe water. They are very simple in structure, and<br />\nlengthen their arms exceedingly in scarch of prey.<br />\nThey may be cut into small pieces, when each piece<br />\nkecomes a perfect Hydra. The lowest of animals<br /><br /><br /><br />\nare the Protozoa. They are unicellular, composed of<br />\naggregated similar cells or of uniform gelatine. Into<br />\nthe second class enter the sponges. A fresh-water<br />\nsponge (Spongille), whose substance is supported by<br />\nhorny spicules, occurs in sluggish waters in the<br />\nBrandywine and other streams,<br /><br />\nSECTION III.—DISTRIBUTION.<br /><br />\nWe will now take a bricf view of the relations of<br />\nthe Maryland fauna to those of other regions of the<br />\nearth.<br /><br />\nNorth America, of which Maryland forms a part,<br />\nembraces the Nearctic fauna. This one is more<br />\nnearly related in character to that of Europe and<br />\nNorth Asia (Palwarctic) than any other, though it<br />\npossesses an admixture of South American (Neotrop-<br />\nical) life. The most remote from it in character is<br />\nthe Australian fauna, then the Palwotropical (Indian),<br />\nand the African is a little nearer. The Nearctic<br />\nJauna is distinguished by its natural productions into<br />\nthe Fastern district (to the plains), the Middle (to the<br />\nSierra Nevada), the Pacific (the western coast), and<br />\nthe Sonoran, which includes Arizona, Sonora, and<br />\npart of Lower California. The Eastern district is<br />\ncharacterized, among other points, by the abundance<br />\nof tortoises and poverty in lizards, as seen above; by<br />\nthe presence of bony gars (Lepidosteus), pike (Esox),<br />\nand Nematognathi (catfishes). In the broad sense, the<br />\nlife of the district is characterized by the presence<br />\nof some ancient forms of life, which have passed<br />\naway in prior geologic epochs, though the Neotrop-<br />\nical and Australian fauna possess a still larger portion<br />\nof such. Thus, the snapping-tortoise and the Profo-<br />\nnopsis have fossil representatives in some strata of<br />\nEurope, and the extinct relatives of the bony gar<br />\nabound in still older rocks.<br /><br />\nAnother proportion of types may be considered<br />\nNeotropical (South American) in character. Such are<br />\namong Mammals, the opossum and the wood-mice<br />\n(Hesperomys); among Birds, the Tyrannide (king-<br />\nbird, pewees, etc.), the humming-birds (Zrochilus),<br />\nand the tanagers (Pyranga); among the Fishes, the<br />\nNematognathi may be mentioned.  Of especial North<br />\nAmerican character may be enumerated the raccoon<br />\n(Procyon), the skunks (Mephitis), and the lesser deer<br />\n(Cariacus); also the American porcupine (Lirethizon).<br />\nAmong birds, the turkey and the wood-warblers<br />\n(Dendreeca) belong especially to the Nearctic fuuna.<br />\nAmong reptiles, the rattlesnakes and copperheads,<br />\nthe whole of the salamanders except two species, and<br />\nespecially the Protonopsis and Necturus, are especially<br />\nNorth American.  Of this character, among the<br /><br />\n. fishes, are the gar, dog-fish, pike, and Etheostomine<br /><br />\nperch, an extensive group of small fishes without<br />\nswim-bladders, found in all streams.<br /><br />\nThere are certain climatal divisions of the fauna<br />\nof the Eastern district of North America, regulated<br />\nby the elevation of the surface, the latitude, temper-<br />\nature, ete. These have been named the Floridian,<br />\nthe Louisianian, the Carolinian, the Alleghanion, the<br />\nCanadian, the Hudsonian, ete. Maryland is traversed<br />\nby the Carolinian, the Alleghanian, and the Cana-<br />\ndian, and their boundaries separate the breeding-<br />\nplaces of various species of birds, and range of others,<br />\nof mammals, ete.<br /><br />\nThe greater part of the area of the State, that s,<br />\nthe low countries from the ocean to the Potomac and<br />\nto the line extending from Wilmington to Baltimoroe<br />\nand to Washington, D. C., is the especial range<br />\nof the mocking-bird, the blue grossbeak, the summer<br />\nred-bird (Lyranga wstiva), and others. Also of the<br />\npine meadow-mouse (Arvicola pinetorum), ete.<br /><br />\nThe middle part of the State is occupied by the<br />\nAlleghanian fauna, which extends north and south.<br />\nThe higher ridges of the Alleghany Mountains are<br />\nincluded in the Canadian, as indicated by the breed-<br />\ning of the snow-bird, various warblers, and the range<br />\nof some land animals. This fauna extends along the<br />\nmountains to Georgia. Our State, then, presents a<br />\nfine and prolific ficld to the student of Biological<br />\nScience.<br /><br /><br />"}], "field_media_file": [{"target_id": 51977, "display": null, "description": null, "target_type": "file", "target_uuid": "bcb4b806-7f94-4f09-bee9-f97f399b917c", "url": "http://digital.library.jhu.edu/system/files/2022-03/15668-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 15668, "target_type": "node", "target_uuid": "1c6ac797-eb80-44be-9f05-cd0284fb94cb", "url": "/node/15668"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "b1c5d55d-453c-4774-bc7b-341d6bdacebc"}]}