{"mid": [{"value": 37009}], "uuid": [{"value": "94b1b790-0588-46bf-b2de-ffcd4f6d432d"}], "vid": [{"value": 37009}], "langcode": [{"value": "en"}], "bundle": [{"target_id": "extracted_text", "target_type": "media_type", "target_uuid": "362b734e-71f2-4cdb-8e29-066e6203b015"}], "revision_created": [{"value": "2022-03-16T16:57:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "revision_user": [], "revision_log_message": [], "status": [{"value": true}], "uid": [{"target_id": 533, "target_type": "user", "target_uuid": "f0761e2b-c842-4acd-bc36-31f4a4f01dfd", "url": "/user/533"}], "name": [{"value": "13138-Extracted Text.txt"}], "thumbnail": [{"target_id": 530, "alt": "", "title": null, "width": null, "height": null, "target_type": "file", "target_uuid": "5da57c25-1943-4f4c-b0c7-f1076ac4cfd7", "url": "http://digital.library.jhu.edu/sites/default/files/media-icons/generic/generic.png"}], "created": [{"value": "2022-03-16T16:57:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "changed": [{"value": "2022-03-16T16:57:52+00:00", "format": "Y-m-d\\TH:i:sP"}], "default_langcode": [{"value": true}], "revision_translation_affected": [{"value": true}], "path": [{"alias": null, "pid": null, "langcode": "en"}], "content_translation_source": [{"value": "und"}], "content_translation_outdated": [{"value": false}], "field_access_terms": [], "field_edited_text": [{"value": "VOL. XXIX, No 8<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 28, 1924<br />\n<br />\nPRICE 5 CENTS<br />\n<br />\nRULES FOR INTRAMURAL PUBLICITY BOARD ORGAN- ANATOLE FRANCE SUBJECT<br />\nIZED; NEW OFFICE IN<br />\nMATCHES ANNOUNCED<br />\nOF MR. L. P. SHANKS'<br />\nCHEM. LAB<br />\nBY RIFLE CLUB<br />\nADDRESS<br />\nSeries of Six Matches Will Begin On Provost Edmunds Satisfied With Work Hopkins Instructor Outlines Life<br />\nNov. 7 and Continue Until<br />\nOf Board Last Year; Will SuperFamous French Novelist, In<br />\nvise Organization This Year<br />\nDecember 19<br />\nThursday Assembly<br />\n<br />\nBLUE JAYS ROMP OVER<br />\nJESUITS AT HOMEWOOD<br />\nIN FIRST BATTLE, 87-0<br />\nOf<br />\n<br />\nHopkins Backs Gallop Over Loyola Line, Flashing Brilliant Open<br />\nBeginning on Monday, NovemOrganization of the Publicity<br />\nTouching upon the high spots<br />\nField Runs; Oles and Magill Injured<br />\nber 7, the Johns Hopkins Univer- Board took place Monday noon only in the life of Anatole France,<br />\nLost in the shuffle, the Green and Gray representatives of Loyola<br />\nsity Rifle Club Intramural Matches when the members met in the Mr. L. P. Shanks entertained an<br />\nCollege were mauled and walked over by Hopkins to the tune of 87<br />\nwill be staged. The sixth and last of Blue Jay office at 12.20, according attentive audience at the Assemto 0 last Saturday at Homewood. Crippled by the loss of \"Polly\"<br />\nthis series will take place on De- to information given out this week bly last Thursday. He has taken<br />\nByrne, their fullback, the Jesuits took the field with Paul Menton<br />\ncember 19. Only members of the by James Young, president of the the place of Professor Lancaster<br />\nin their star's position. Nothing, however, seemed to avail against<br />\nRifle Club will be eligible to com- Board.<br />\nat Hopkins and is at present the Blue Jays, who crashed through the Loyola<br />\nline as easily as a<br />\npete in these matches, the particiNo definite work has been un- teaching French. Dean Ames pre- circus clown dives through his paper hoop.<br />\npation in which will enable the new dertaken since the opening of sented him as a man familiar with<br />\nLong broken field runs were plentiful and on the defense Levy,<br />\nmen to become accustomed to shoot- school because of having no work- French ideals.<br />\nMagill and Slowik sparkled. Magill and Oles, however, were forced<br />\ning under match conditions, and ing quarters and because of no<br />\nAnatole France ranks with Har- to leave the game due to slight injuries.<br />\npave the way for a successful sea- funds. The president<br />\nof the dy and Kipling as one of the greatThe game opened with Loyola<br />\nson.<br />\nBoard advanced money to cover est of French and European con- JUNIORS SHUT OUT SOPHS, kicking to Hopkins. Taylor electThe Rifle Club has completed its the expenses during the spring and temporaries, Mr. Shanks began.<br />\n2-0, IN KEENLY FOUGHT<br />\ned to return the kick immediately.<br />\nPlans concerning the six intramural no reimbursement has been made. He won the Nobel prize for literCONTEST<br />\nTurnbull's punt was short and afmatches and has announced the Some financial assistance was giv- ature and was given a seat in the<br />\nter Enright had gained a lone first<br />\nrules which are given below in de- en by the Athletic Association French Academy. His books sold Niner Allows No Hits, While Goodwin<br />\ndown the Hopkins line held. Mentail. Graduate students now attend- from a fund secured from alumni. in re-editions more numerous than<br />\nHolds Opponents to One<br />\nton's try at a placement was<br />\ning the university will be welcomed The $5 appropriation from the those of any American or English<br />\nNiner lost a heart-breaking<br />\nblocked. With the ball in Hopby the club.<br />\nStudent Activities Council only book. His funeral was attended pitching duel to G9odwin when kins' possession Taylor then<br />\ncovers the postage bill for three by the most distinguished gather- the Sophomores failed to back up crashed through the whole Loyola<br />\nTHE RULES<br />\nFirst Match, Friday, November weeks at the rate material was ing since the triumph of General their star hurler. The Juniors were eleven for a spectacular<br />\n55-yard<br />\nFoci.<br />\n7, 1924, between 1 and 6 P. M.— sent out last year.<br />\nhelpless before the dazzling speed<br />\nrun off right tackle.<br />\nBlandi<br />\nYouthful At Fifty<br />\nef the Soph pitcher. Niner did plunged<br />\nPosition: Prone and sitting; one<br />\nArrangements have been made<br />\nthe ball over for the first<br />\nIn his early years the French not allow a single hit, struck out<br />\ntarget in each position, 2 shots on to use Room 22 in the Chemical<br />\nscore of the game.<br />\neach bull's eye, including the sight- Laboratory for the Publicity Of- satirist absorbed the literary at- ten men, and issued only one pass.<br />\nA forward pass, Taylor to<br />\nmosphere of his father's bookstore Goodwin also pitched an excellent<br />\ning bull.<br />\nfice. Equipment and files will be<br />\nTurnbull, gained 30 yards and<br />\nEligibility: Open to all members moved there immediately and af- and early turned to bookish brana of ball as he won his sec- Taylor plunged over for the secof the Club who have never fired ter Monday's meeting active work things. He may be said to have ond straight game for the Juniors. ond touchdown. The third was<br />\nin a match as a member of the J. will start on publicity concerning reversed the usual order of a life- Both teams fielded exceptionally<br />\nthe result of end runs by Taylor<br />\ntime, dwelling upon the past in the well. The Juniors made only one<br />\nR. U. team.<br />\nthe undergraduate activities'. Efand Turnbull, allowing Blandi to<br />\nfirst half of his life and taking up error, while the Sophs made two<br />\nRifles: Winchester, Cal. 22, sin- forts are under way to increase<br />\ntear over the goal line. The first<br />\nat 50 the enthusiasm of youth. In misplays.<br />\ngle shot.<br />\nthe budget. A 10 per cent allowquarter ended: Hopkins, 19; Loythe 70's, after war and defeat, the<br />\nGoodwin opened the game by ola, 0.<br />\nance on the balance left from all<br />\nAmmunition: .22 short.<br />\nFrench nation sought to escape hitting Farinholt, the<br />\nSophomore<br />\nPrizes: 1st prize, 250 rounds, activities was voted on at an Ac- from<br />\nAlmost immediately atter the<br />\nthe present and his dreams lead-off man, Lowman followed<br />\nCouncil<br />\ntivities<br />\nmeeting<br />\nlast<br />\nammunition, cal. .22 long; 2nd<br />\nsecond<br />\nperiod began Hopkins reof the past -fitted in well at that by hitting a line dire to Love,<br />\nPrize: 100 rounds, ammunition, spring, but this will not care for<br />\nceived<br />\nball through a fumble<br />\nthe<br />\ntime.<br />\n•<br />\nwho completed a snappy double on Loyola's 30-yard line. Taylor<br />\ncal. .22 long; 3rd prizes: 50 rounds, the large amount of work which<br />\nLater, however, there came the play by catching Farinholt off<br />\nwill be done this year.<br />\nammunition, cal. .22 long.<br />\nand Turnbull put it over again on<br />\nreaction and his novels turned first. Crawford struck<br />\nout. Was- two plays. Blandi, with the aid of<br />\nAfter several weeks of intensive<br />\nSecond Match, Friday, Novemagainst the church. After nis serman, Love<br />\nand Thomsen were the other backs, scored the next<br />\nber 14, 1924, between 1 and 6 P. M. work last winter it was found that<br />\nelection to the Academy he turned sent down in order<br />\nby the fast two touchdowns by straight footPosition: Kneeling; one target, 2 the Publicity Board could actually<br />\nhis literary skill toward criticism fielding Sophomore<br />\nteam: In the ball. Turnbull's end runs were<br />\nshots on each bull's eye including give Hopkins affairs plenty of real<br />\nthe sighting bull.<br />\npublicity and the organization got of affairs of the day and took the second inning only three men on beautiful examples of perfect inpart of the common people. He each side faced the plate.<br />\nEligibility: Open to all members under way in such a manner that<br />\nterference. The half ended: Hopexpressed<br />\nhis opinions dramaticalof the club.<br />\nit was properly functioning, but<br />\nJuniors Score First Run<br />\nkins,<br />\n40; Loyola, 0.<br />\nly through fictitious characters.<br />\nlack of funds halted the rapid<br />\nRifles: Any rifle, cal. .22.<br />\nfeeble<br />\nW<br />\nasserman<br />\nstifled<br />\na<br />\nAshton Devereux took Taylor's<br />\nLa Revolte des Anges<br />\nstride of the Board.<br />\nAmmunition: Any cal. .22.<br />\nMr. Shanks concluded his talk Sophomore rally in the third by signal-calling position at quarter<br />\nIn a letter from Dr. Ames to the with<br />\nPrizes: 1st prize: $5:00; 2nd<br />\na sketch of the French au- making a spectacular running during the second half. Turnbull<br />\nPrize: $3.00; 3rd prize: $2.00; 4th editor of the Board, he says tnat<br />\nthor's last novel, \"La Revolte des catch of Crawford's hot liner. The intercepted a pass by Menton at<br />\nPrize: $1.00; 5th prize: 100 rounds the organization will consider itAnges,\" published in 1914, in Juniors scored the first tally of the the beginning of the half and<br />\nself under the supervision of Proammunition.<br />\nwhich the( Cherubim and Sera- game when Wasserman reached made 65 yards before being<br />\nThird Match, Friday, November vost Edmunds, who is conducting<br />\nphim, upon .asking Lucifer's aid first after the Soph catcher downed. He plunged over the<br />\n21, 1924, between 1 and 6 P. M.-- the endowment campaign and the<br />\nin their conspiracy against Heaven dropped his third strike. Wasser- goal line a moment later. After<br />\nContinued on page 2, col. 5<br />\nContinued on page 4, col. 3<br />\nare told that even in the event of man stole second and was sacri- the kick-off Devereux made a gain<br />\nsuCcess, the order of victor and ficed to third. He then successful- of 41 yards on two successive<br />\nDE LA MARE'S FOURTH LECTURE DEALS<br />\nvanquished would merely be re- ly staged a squeeze play with the runs. On the third play he passed<br />\n•to Mallonee for Hopkins' eighth<br />\nWITH IMAGINATION IN PROSE WRITING versed and tyranny still prevail. help of Love, who was at bat.<br />\nThe moral is the uselessness of<br />\nThe fourth inning again saw the touchdown. Sauerwein interceptwar.<br />\nSophomores blanked. Goodwin let ed a forward pass and ran 53<br />\nWalter De La Mare, the English its personal interest. Still another The irony and apparently sim- himself<br />\ninto a hole when two men yards for the last score of the<br />\nPoet who has been lecturing under variety is \"professional prose,\" ple style of Anatole France<br />\nare his got on base, but he pulled through period which ended: Hopkins, 60;<br />\nthe Percy Turnbull Memorial which is a literary uniform for its<br />\nchief weapons. He was a genial in great style by striking out tne Loyola, 0.<br />\nPoundation, gave the fourth of his authors. It is ceremonious, imper- and kindly skeptic.<br />\nAfter Almy, who was substitutlast two men. The Juniors scored<br />\nseries of lectures last Thursday in sork-tl, pompous and is employed<br />\nMr. Shanks concluded his talk their second run in the fourth ed for Blandi, put over the tenth<br />\nthe C. E. Hall. The subject was chiefly by lawyers and political<br />\nby drawing the moral from the life when Thomsen, who managed to touchdown at the' beginning of<br />\n\"Imaginative Expression, or the speakers.<br />\nof Anatole France that if one is to walk and steal second and third, the final period, Lawrence, taking<br />\nMedium of Prose.\"<br />\n\"But,\" Mr. De La Mare added, be happy one must spend his life raced home on a passed ball.<br />\nTurnbull's place, scored the last<br />\n\"Prose,\" said the lecturer, is the a prose worthy of the name of lit- in the service of others.<br />\nBryan started the Sophs on a three touchdowns, Leibensperger<br />\nordinary language of ordinary men erature must be human, engaging,<br />\nSuspension, Non-Exam Penalty<br />\ndesperate last inning rally when he kicking the goal each time, Devin.ordinary circumstances.\" When various, persuasive. And, above all, Dean Ames announced ,at the<br />\nreached first on Curry's - error, ereux holding the ball.<br />\ntouched by genius it becomes liter- it must reveal the active possession opening of the meeting that all<br />\nThe score:<br />\nature. 1\\1 r. De La Mare cited vari- not only of a sensitive mind but those Freshmen who did not re- Wheeler became the man of the<br />\nTHE SCORE:<br />\nhour when he crashed out the only<br />\nous forms of prose writing. First something of a heart.\"<br />\nHopkins (87)<br />\nContinued on page 4 col. 2<br />\nPos.<br />\nLoyola (0)<br />\nhit of the game, a single to right Mallonee<br />\nL E.<br />\nhe considered \"the prose of the<br />\nMost necessary of all for true<br />\nFlynn<br />\nfield. Bryan stopped at third. Magill (Capt.) ..L.T.<br />\nSimpson<br />\nmatter of fact,\" which is built up literature are sensuous memory<br />\nOles<br />\nLG<br />\nWatson<br />\nNOTICES<br />\nWheeler further cheered the Day<br />\nC<br />\nby an aggregate mental effort. Un- and imagination. \"What the naked<br />\nSullivan<br />\nRG<br />\nSophs by pilfering second. Good- Slowik<br />\nMeeting of editorial candidates<br />\nTholes<br />\nder this form of prose conies most eye saw yesterday the inwird eye<br />\nLevy<br />\nR<br />\nT<br />\nHolland<br />\nof the Hullabaloo at 12:20 Thursmoment<br />\ncritical<br />\nthis<br />\nrallied<br />\nwin<br />\nat<br />\nBerndt<br />\nR E.<br />\nscientific writing of the definition may recall tomorrow. In imaginaO'Connell<br />\nday in the Blue Jay office. Plenand crushed the Sophomore hopes Taylor<br />\nEnright<br />\nty of work and candidates are<br />\nQ13.<br />\ntype. It is naked in form and\"pre- tion, then, we sensuously re-experiSauerwein<br />\nLH<br />\nLinn<br />\nneeded.<br />\nWilling<br />\nfanning<br />\nHoffman.<br />\nby<br />\nand<br />\nTurnbull<br />\ncision is its only essential virtue.\" ence the past.\" \"The faculty of imRH<br />\nGorsuch<br />\nMr. Myers, University postF B.<br />\nPhillips, the next man up, ended Blandi<br />\nMenton<br />\nThen there is the prose, which like agination can make a wilderness<br />\nmaster, announces that all mail<br />\nScore<br />\nby<br />\nPeriods:<br />\npopping<br />\nto<br />\nLove.<br />\nby<br />\ngame<br />\nthe<br />\nfor<br />\nmen<br />\nnot<br />\nhaving<br />\npost-office<br />\nRuxley's conveys knowledge gained blossom like a rose. Without creHopkins<br />\n21 20 27-87<br />\nboxes will be held for five days,<br />\nThe Sophomore line-up was as<br />\nby the writer himself, and may be ative imagination everything would<br />\nLoyola ... 0<br />\n0<br />\n0<br />\n0— 0<br />\nand then returned to the sender.<br />\n<br />\nof great literary worth because of be rendered prosaic.\"<br />\n<br />\nContinued on page 4, col. 3.<br />\n<br />\nGmtifmod on page 4, col.1<br />\n<br />\n\f2<br />\n<br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 28, 1924<br />\n<br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br />\n<br />\nSubscription<br />\n<br />\n$2.00<br />\n<br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br />\n<br />\nTHE NEWS-LETTER<br />\nMAILBAG<br />\n<br />\nEVERY 61 UDENT NEEDS ONt<br />\n<br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br />\n<br />\nby the \"News-Letter,' which invites the<br />\nfreest discussion of matters of general<br />\nInterest.<br />\n<br />\nEditor of THE NEWS-LETTER:<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br />\n<br />\nThere has been considerable talk<br />\namong representatives of different<br />\nstudent publications concerning the<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Hopkins blotter-advertising idea. I<br />\nshould be sent to the MANAGING EDITOR.<br />\nam taking this method to present<br />\nthe situation to the student body beTelephone<br />\nHomewood 0100 cause it is a question which concerns every publication and the blotter advertisement must not occur<br />\nEditor-in-Chief<br />\nBusiness Manager<br />\nagain under the conditions it did<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nPHILIP W. HOWARD, '25<br />\nthis year.<br />\nManaging Editor<br />\nALGER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REEsE, '27<br />\nW. BARNES HAIL, '27<br />\n<br />\nAdvertising Manager<br />\nALFRED J. McICAY, '26<br />\nCirculation Manager<br />\nOTHO J. KET.TXR, III, '26<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, 227<br />\n<br />\nMember Southern Intercollegiate Newspaper Association<br />\n<br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br />\n<br />\nBusiness staffs of the Hullabaloo, the Blue Jay, and THE NEWSLETTER report that their revenue<br />\nhas been stopped from faithful advertisers who have formerly appeared in the columns of the respective publications. With the excuse that they had advertised in the<br />\nblotter, merchants say their appropriation has been exhausted and<br />\nthat they Will only go into one advertising during the year.<br />\nAdvertising men know pretty<br />\nwell that money spent on such a<br />\nproposition is wasted. The life of<br />\na blotter is very short. The money<br />\ngoes into the pockets of a student<br />\nwhen it should go into the treasury of a publication, where circulation is guaranteed each week or<br />\nmonth. In the case of the Hullabaloo, the price of one small space<br />\non the blotter deal would get a half<br />\npage in a book which lasts forever<br />\nand which is representative of Hopkins.<br />\n<br />\nREMINGTON<br />\nPortableTypewriter<br />\nThe Remington Portable will serve you well—<br />\nnot only in school or college, but for years and years<br />\nto come. It will give you a training which will be<br />\nhelpful to you in all your after life.<br />\nCompact—fits in a case only four inches high.<br />\nComplete—has the four-row keyboard---no shifting for figures—just like the big machines.<br />\nConvenient—can be operated on your lap if you<br />\nwish, for it carries its table on its back.<br />\nCome in and see the Remington Portable.<br />\nPrice, complete with case, Igo. Easy payment<br />\nterms if desired.<br />\nREMINGTON TYTEWRITER CO.<br />\n25 W. Fayette St., Baltimore, Md.<br />\n<br />\nOPTIMISTIC OUTLOOK FOR RIFLE CLUB ANNOUNCES<br />\nRULES FOR MATCHES<br />\nTRACK TEAM<br />\n<br />\nContinued from page 1<br />\nUnder the guiding hand of<br />\nCoach Huntley Lloyd, the track Position: Standing; one target, 2<br />\nteam is surely rounding into form. shots on each bull's eye, including<br />\nAlthough it is too early to make the sighting bull. Eligibility: Open<br />\nabsolute predictions, nevertheless it to all members of the club. Rifles:<br />\nFRATERNITIES<br />\nseems certain that Hopkins will be Any rifle, cal. .22. Ammunition:<br />\nrepresented by a fine track team Any cal. .22. Prizes: 1st prize,<br />\nof<br />\nspirit<br />\nThe<br />\nassociation has, in all ages, induced men to join tothis year. It is true that the loss $5.00; 2nd prize, $3.00; 3rd prize,<br />\ngether for the pleasures of mutual enjoyment or for the attainment<br />\nof Hopkins' nationally known fliers, $2.00; 4th prize, $1.00; 5th prize,<br />\nof some common purpose for which the support of members is necesBooth and Clark, is a severe one, 100 rounds ammunition.<br />\nsary. And so, in nearly all leading educational institutions of this<br />\nFourth Match, Friday, Decembut practically all of the old men<br />\ncountry, we find Greek letter societies, commonly called \"College Fraare back again, augmented by some ber 5, 1924, between 1 and 6 P. M.<br />\nPositions: Kneeling and standing;<br />\nternities,\" founded on this same idea. Social life forms basic raison<br />\nI understand that the Hopkins very promising new men.<br />\nCaptain Heyn will be entered in one target in each position, 2 shots<br />\nd'etre of all fraternities. A fraternity is unique among secret socie- seal can only be used on the official<br />\non each bull's eye, including the<br />\nties, although its secrecy is largely nominal, in that it is the only publications. Two of them were the 100, 220, broad jump and pole<br />\nsighting<br />\nbull. Eligibility: Open to<br />\nvault; Gwinn in mile and 2 mile<br />\norganization of the kind founded on an aristocracy of social advan- used on the advertising scheme and<br />\nall members of the club who have<br />\nraces.<br />\ntage and educational opportunity.<br />\nsurely were not authorized for such<br />\nProctor, who holds the high- not won a prize heretofore. Rifles:<br />\nThe campaign for new members is called \"rushing\" and is the a thing. The seal is the stamp of jump record, will again compete in Any rifle cal. .22. Ammunition:<br />\nAny cal. .22. Prizes: 1st prize, $2;<br />\ngreat student feature at the beginning of each college year. Every the University and has no place on the high jump and broad jump.<br />\nprize, $1; 3rd prize, 100 rounds<br />\n2nd<br />\nEdwards, the record holder of<br />\na blotter.<br />\nfreshman is almost immediately confronted by the question, shall I<br />\nammunition.<br />\nthe 880-yard dash, is back in school<br />\nBefore the same proposition is<br />\njoin a fraternity? For the man who decides in the affirmative a still<br />\nFifth Match, Friday, December<br />\nagain after a lapse of a few years<br />\nmore important question demands his attention, which fraternity shall carried out next year, or next se- and bids fair to repeat his stellar 12, 1924, between 1 and 6 P. M:—<br />\nmester, because the blotters will<br />\nPositions: Prone, sitting, kneeling<br />\nI join? 'This question is a problem of the greatest magnitude for<br />\nperformances.<br />\nhardly last a semester, Pi Delta<br />\nthe nature of the freshman will\" depend very largely upon the ideals Epsilon, the journalistic fraternity, In addition to these is Straus, and standing; 1 target in 'each position, 2 shots on each bull's eye, inand traditions of the fraternity he joins. No other influence in col- should step in and take hold of the who put the shot for Princeton. He<br />\nwill, in all •likelihood, get the call cluding the sighting bull. Eligibil lege is so close or permeating as that particular kind resulting from situation. My suggestion is that the<br />\nity : Two teams of 5 men each will<br />\nhere.<br />\nfraternity membership. Usually a man's college career is character- merchants who regularly deal with<br />\nThe former City and Poly star be selected by the Executive Officer<br />\nized as being associated with one fraternity or another. The college Hopkins publications, be notified prep sprinters are showing up well from the highest scores in all four<br />\nthat no advertising in booklets, blotin practice, as is also one youngster positions up to date. Rifles: Any<br />\n,gives environment; the classroom gives knowledge; activities give<br />\nters, etc., is authorized unless the<br />\ntraining; but to all of these the fraternity gives distinction and color. solicitor bears a letter or card from from Central High of Washington. rifle cal. .22. Ammunition: Any<br />\nManager Donaldson announced cal. .22. Prizes: A theater party<br />\n\"Fraternities have personalities as distinct as persons,\" it has the president or some officer of the that no definite schedule<br />\nhas been for the winning team.<br />\nSixth Match, Friday, December<br />\nbeen said. The fact that fraternities are as distinct as persons im- fraternity. This perhaps could be arranged as yet. He hopes to comdone by the student council, but no<br />\n1924, between 1 and 6 P. M.—<br />\n19,<br />\nplies a difference sufficient to induce careful choice. Fraternity life<br />\nplete arrangements soon that will<br />\none feels the direct need of such acTotal amount of money colPrize:<br />\nin the wrong fraternity is worse than none at all, for as Bacon says' tion more than the heads of the insure some very interesting meets<br />\nlected as fines for using profanity,<br />\nin his essay on Friendship, \"a crowd is not company.\" The wise publications and members of the for this coming track season. It is<br />\nestimated at $15.00.<br />\nunderstood<br />\nthat<br />\nat<br />\ntrione<br />\nleast<br />\nchoice will be the fraternity whose spirit is closest, most congenial staffs who go out to sell advertisDetails to be announced later.<br />\nangular meet with two other leadto the freshman, the fraternity composed of men of his type, their ing space. They are members of ing college teams will be arranged.<br />\nPi Delta Epsilon and if they see<br />\ntastes his tastes and their ideals his ideals. That no man should yield<br />\nIn order to expedite matters,<br />\nthat action is needed they would<br />\nManager Donaldson has inauguto glamor in which he will not be congenial is a truth which many not<br />\nhesitate to bring immediate aclearn too late. Sometimes when a \"bid\" does not come from the tion to curb useless waste of money rated a new card-filing system.<br />\ndesired fraternity it is wise to wait, but as a rule the better way is to which rightfully belongs to the Every man connected with the track<br />\nteam is represented in this index.<br />\nbegin to look elsewhere, for often a man favors a particular fraternity three publications.<br />\nRecords of past experience, physbecause he happens to know more about it.<br />\nThis is a matter that must not ical condition, and scholastic data<br />\nLUNCHEON—AFTERNOON TEA—<br />\nhang<br />\nfire. Just the one example is are a few of the details that comSuccess and happiness most certainly do not depend upon makDINNER<br />\nsufficient.<br />\npose an accurate statement of<br />\ning a fraternity. But if a choice of fraternities is to be made at all,<br />\nevery man. The good results exYours truly,<br />\nit should be the right choice. It will save the Freshman vain regrets<br />\nBanquets & Receptions<br />\npected from this system are obvilater.<br />\nCAKES —ROLLS —SANDWICHES<br />\nJAMES R. YOUNG.<br />\n<br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 28, 1924<br />\n<br />\nqwg Stefuart<br />\nZra laciont<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS LETTER, OCTOBER 28, 1924<br />\n<br />\nErnest G.Leimbach<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br />\n<br />\nUPTOWN<br />\nQUALTIES<br />\n<br />\nDOWNTOWN<br />\nPRICES<br />\n<br />\nOPEN EVENINGS<br />\n<br />\nNot a hair out of place and not<br />\na single flake of dandruff. Big<br />\nand strong also. Adonis had<br />\nnothing on him.<br />\nYou can gamble he doesn't say a word<br />\nabout \"Vaseline\" Hair Tonic. But he<br />\nuses it almost religiously. Nothing like<br />\nit for mastering unruly hair and keeping<br />\nthe scalp healthy. Rub it in regularly<br />\nand your hair will stay with you and<br />\nlook right. At all drug stores and student barber shops.<br />\nEvery \"Vaseline\"product Is-recommended everywhere because of its<br />\nabsolute purity and effectiveness.<br />\n<br />\nVaseline<br />\nREG,U.S PAYOFF.<br />\n<br />\nHAIR TONIC<br />\nFor the Health and<br />\nAppearance of the Hair<br />\n<br />\nChesebrough<br />\nState Street<br />\n<br />\nMfg. Company (Coned)<br />\nNew York<br />\n<br />\nLATEST STYLES AND FORMS<br />\nEngraved<br />\n<br />\nWEDDING INVITATIONS,<br />\nANNOUNCEMENTS AND<br />\nVISITING CARDS<br />\n<br />\nSAMUEL H. KIRBY<br />\nENGRAVER<br />\nSamples and Prices on Request<br />\n42 SOUTH ST.<br />\n<br />\nBALTIMORE<br />\n<br />\n3<br />\n<br />\nSELECTION OF GILMAN AS PRESIDENT<br />\nASSURED FUTURE OF NEW UNIVERSITY<br />\nThis, the second of a series of articles dealing with \"Hopkins History\", tells of the<br />\nappointment of the first president and his colleagues and of their combined efforts<br />\nduring that memorable first year.—Editor's Note.<br />\n<br />\nHEN Johns Hopkins<br />\nhad fully developed<br />\nhis plans -of creating<br />\na university, he<br />\nformed a corporation.<br />\nJohns Hopkins University then<br />\nactually became a reality. This<br />\nhappened-on the 24th of August,1864. He had spent much time<br />\nand care in choosing the board of<br />\ntrustees who were to have the<br />\nenormous task of starting the new<br />\norganization, of picking its leader,<br />\nand of making it a success once<br />\nit was started. That board, which<br />\nfunctioned so smoothly and perfectly, was headed by Galloway<br />\nCfieston, as chairman, and consisted of twelve distinguished men in<br />\nmany walks of life, chosen without • regard to their religion or<br />\ntheir political feelings for the<br />\nNorth or the South—a question<br />\nwhich was still burning deeply in<br />\nthe hearts of the people.<br />\n<br />\nsame time be capable of reaching<br />\nthem. Their unanimity, without<br />\ncorrespondence between themselves, in pointing to Daniel Colt<br />\nGilman for the important post is<br />\nimpressive. He made Hopkins<br />\nsomething great and valuable to<br />\nthe whole country, for had not the<br />\n\"one man\" been chosen, undoubtedly, the history of Johns Hopkins and of higher education<br />\nwould have been very different.<br />\nGilman in Baltimore<br />\n<br />\nIn December of 1874, Gilman—<br />\nhe was then president of California and his work there will long<br />\nbe remembered—made the overland journey to Baltimore in order personally to interview and<br />\nbecome acquainted with the trustees. He realized the wonderful<br />\npossibilities of advancing education to a point unknown before,<br />\nand he stated to the board at that<br />\ntime that his acceptance lay in<br />\ntheir approval of his conditions.<br />\nPerfect Plans<br />\n-Many, many months passed dur- He said, speaking of the future<br />\ning which the men became well university:<br />\nacquainted with one another as<br />\nPlans for Future<br />\nwell as with their common inter\"I will make it the means of<br />\nest. They spent the time in gath- promoting scholarship of the<br />\nfirst<br />\nering together contemporary lit- order, leaving the work now<br />\ndone<br />\nerature on every aspect of educa- by undergraduates to be done<br />\ntion. Thus they built their plans elsewhere for the most part. For<br />\nand organized until, in the sum- this purpose I will select as promer of 1874 (Hopkins died in De- fessors only men now standing in<br />\ncember, 1873), they invited three the front rank in their fields, paymen of acknowledged pre-emi- ing them well enough to leave<br />\nnence to come to Baltimore to an- them at ease as to the commoner<br />\nswer many inquiries concerning 'and coarser cares of life. I will<br />\nwhich they were still in doubt. give them students far enough adEliot, of Harvard, president of a vanced to keep them stimulated<br />\ncollege of the old type; White, of to the highest pitch; and we will<br />\nCornell, the head of a new college exact from them yearly proof of<br />\nwhich he had had from its begin- the diligence and fruitful cultivaning, and Angell, of Michigan, tion of their specialties by compresident of a very flourishing pelling them to print somewhere<br />\nState University, were the three. the results of their research. Our<br />\nThey answered a great many money will be •spent for the best<br />\nquestions along various lines, but professors, the best apparatus and<br />\nit is extremely interesting to note for creating scholarships<br />\nwith<br />\ntheir' unity of opinion when the which we may bring the best<br />\nstusubject of the presidency of Hop- dents. It will not yet be wasted<br />\nkins was presented. To a marked on architecture. . . . The undegree the future of the new insti- biased truth alone will be our<br />\ntution was to be moulded by the aim.\"<br />\ntype of man who would become<br />\nHis ideas were unanimously acthe very heart and soul of that cepted. Indeed, they created a<br />\ninstitution. Consequently he must hitherto unknown degree of enhave the highest aims and at the<br />\nContinued on page 4 col. 1<br />\n<br />\nDR.<br />\nKOUWENHOVEN<br />\nINSTALLS LOUD SPEAKER<br />\nTO HEAR DE LA MARE<br />\nIN CHEMICAL LAB<br />\nWalter De La Mare cannot find<br />\na hall large enough at Homewood<br />\nto accommodate the large crowds<br />\n-who are desirous of hearing the<br />\ndistinguished Englishman give<br />\nhis talks on poetry. Last Thursday at half past four every seat PI DELTA EPSILON<br />\nELECTS HON. H. A. L. FISHER TO LECin the C. E. Hall was taken. The<br />\nOFFICERS FOR 1924-25<br />\nTURE HERE WEDNESDAY<br />\naudience included people of all<br />\nP. W. Howard was elected pres- \"The Present Relations of<br />\nages.<br />\nident of the Pi Delta Epsilon Fra- Great Britain and Her DependenIn order that more may hear ternity at a recent meeting of that<br />\ncies\" is the subject of a lecture to<br />\nDe La Mare's lectures, Dr. Kou- organization. E. E. Donaldson was be given<br />\nWednesday by the Right<br />\nwenho-ven has supervised the in- elected vice-president, H. Turnbull Hon. H. A. L.<br />\nFisher, for six<br />\nstallation of a loud speaker in the secretary, and G. Hess treasurer, years a member of<br />\nLloyd George's<br />\nauditorium of the Chemical Lab- for the year 1924-25. This election, Cabinet, at the<br />\nUniversity. This<br />\noratory. A broadcasting micro- of considerable moment in the lo- lecture is given<br />\nunder the George<br />\nPhone has been placed on the cal chapter's yearly activities, ex- Huntington<br />\nWilliams Memorial<br />\nsPeaker's desk in the C. E. Hall, cited considerable interest in the Lectureship.<br />\nWhich is connected by wires with university literary circles.<br />\nMr. Fisher was President of the<br />\na loud speaker in the Chemical<br />\nThis fraternity is a national or- Board of Education<br />\nin England<br />\nLaboratory. The entire apparatus, ganization, its purpose is to raise for<br />\nsix years. He was elected to<br />\nconsisting of the microphone, bat- the standards of college journalism<br />\nParliament in 1916 as a Liberal.<br />\nteries, and tubes which amplify and to honor those men<br />\nwho have Previous to that time<br />\nhe was at<br />\nthe voice over 100,000 times, terattained distinction in that partic- New College,<br />\nOxford, and later<br />\nminates with the loud speaker in ular field.<br />\nvice-chancellor of Sheffield Unithe auditorium of the Chemical<br />\nThe local chapter was installed in versity. Since the fall of Lloyd<br />\nLaboratory.<br />\nOctober, 1922, by a delegation from George's cabinet Mr. Fisher<br />\nhas<br />\nThursday there was some trou- the chapter at George Washington been interesting<br />\nhimself in politible in hearing clearly, caused by a University. Only students in the cal science and<br />\nhistory. He is an<br />\nfan in the Chem. Lab., but this Junior and Senior classes who have<br />\nauthority on the constitutional asdifficulty will be done away with served at least two years on a pub- pects of the<br />\nBritish Empire, and is<br />\nhY today, when Mr. De La Mare's lication are eligible for membera biographer of Napoleon.<br />\nsubject will be \"Craftsmanship in ship.<br />\nThe responsibility fell to him to<br />\nVerse.\" The loud speaker should<br />\nAlthough the Hopkins chapter is work out certain improvements in<br />\ngreatly relieve the congestion by only two years old, it<br />\nhas been very The English school system, which<br />\nthus doubling the space available active<br />\nand consequently has made were put into effect at the close<br />\nfor audiences.<br />\nits influence felt.<br />\nof the World War.<br />\n<br />\nFashionably smooth hair<br />\n<br />\nThis has caused the great<br />\nchange in the appearance<br />\nof men's hair<br />\nYOU<br />\ncannot go into a<br />\nclassroom, or a club,or a<br />\nfraternity house, without noticing it —<br />\nSomehow,college men have<br />\nfound a way to make the<br />\nhair, the most conspicuous<br />\npart of the appearance, look<br />\njust as they want it to look<br />\nat all times.<br />\nIt was not always so.<br />\nBefore Stacomb was introduced, they tried countless<br />\nmethods to make their hair<br />\nlie smoothly and stay that way.<br />\n—from old-fashioned pomades,which only matted the<br />\nhair and made it greasy, to<br />\nplain water, which kept it in<br />\nplace an hour at the most and<br />\n<br />\nthen left it drier and more<br />\nbrittle than ever. Small wonder that they greeted Stacomb<br />\nwith such instant enthusiasm!<br />\nHere at last was something<br />\nthat would make the hair stay<br />\nin place without harming it or<br />\nmaking it sticky and unnatural-looking<br />\nToday the great change which<br />\nStacomb has brought about is noticed everywhere. Men whose hair<br />\nused to be out of place an hour after<br />\nbeing brushed, men whose otherwise correct appearance used to be<br />\nspoiled by hair that was hopelessly<br />\nunkempt—today they keep their<br />\nhair constantly in perfect order.<br />\nUse Stacomb tomorrow morning —<br />\nand look your best all day. A delicate, invisible cream. Non-staining<br />\nand non-greasy. In jars and tubes,<br />\nat all drug and department stores.<br />\n<br />\n/*/<br />\n<br />\n'<br />\n<br />\n4 4f1<br />\n<br />\nire(<br />\nA.Ace,<br />\n1<br />\n<br />\nT<br />\n<br />\nREE 'OFFER-<br />\n<br />\nRIG•1.1.1<br />\n<br />\n0,11<br />\n<br />\nKEEPS THE HAIR IN PLACE<br />\n<br />\nOA<br />\nStandardLaboratories,Inc., Dept.<br />\norIc CitY<br />\nl'1eW Y generous<br />\nStreet,charge,<br />\na<br />\n<br />\n'West 18thfreeof<br />\n113<br />\nme,<br />\nStacomb.<br />\nPleasesealof<br />\n..............••<br />\nsample tube<br />\n......<br />\n.<br />\n• • ••<br />\n.<br />\n.<br />\n.<br />\n• •.<br />\n• • • ...<br />\n`N.5une• • . • •<br />\n............ •<br />\n<br />\ncAddress • • • • •<br />\n<br />\nBRANCH<br />\nAT THE BARN<br />\n<br />\nMikes of Gaston Quality<br />\n14 N.Charles Street.<br />\nDOUG 'TURNBULL<br />\n<br />\nTOM MAGILL,<br />\n<br />\nRepresentatives<br />\n<br />\nSMART APPAREL and FURNISHINGS<br />\nfor Campus and Sports<br />\nAwait the selection of the college man.<br />\n<br />\nIETZLEK 13Kff1ln<br />\n<br />\nManager<br />\n<br />\n\fTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 28, 1924<br />\n<br />\n4<br />\n<br />\nGILMAN MOVING FORCE OF R. 0. T. C. TO USHER AT CHARLES C. COOK LECTURES emerged victors over both the<br />\nFreshmen and Sophomores. If<br />\nTO ENGINEERS<br />\nARMY-NAVY FOOT• INFANT UNIVERSITY<br />\nContinued from page 3<br />\nBALL GAME<br />\n\"The engineer is a primary fac- they win their remaining game, to<br />\nthusiasm. A few months later<br />\nMembers of the Hopkins Reserve tor in economic growth and as such, be played October 28, against the<br />\nwhen he finally broke away from<br />\nOfficers' Training Corps will be must be ready to do his wok with Seniors, they will be undisputed<br />\nCalifornia, he turned his whole atchampions. The Seniors are a<br />\ntention to choosing the courses of given an opportunity to witness the neatness, accuracy, and dispatch. close second in the championship<br />\nstudy to be given at Hopkins and Army-Navy football game to be Nothing can replace these qualities race. However, their only chance<br />\nto selecting a competent faculty played at the Stadium on Novem- nor compensate for their lack.\" of winning the pennant is to dewhich would answer his ideals.<br />\nber on 29th.<br />\nSuch were the sentiments expressed feat the' Juniors and then win the<br />\nGilman Meets Rowland<br />\nWh.n the Army and Navy offi- by Mr. Charles C. Cook, engineer play-off of the Freshman-Senior<br />\nIn 1875, late in the spring, Gilcials selected the City of Baltimore on maintenance of way of the Bal- tie. At present all indications point<br />\nman was at West Point and by<br />\nto a Junior victory.<br />\nchance he heard of a young man for this year's contest Major Hois- timore and Ohio Railroad, in an adThe Freshmen are-not yet elimnamed Rowland who was showing ington offered the services of the dress before the Hopkins student inated from the race, but their<br />\ngreat promise as a physicist. He unit as ushers. The committee in chapter of the American Society of chances are very slim. The Soasked Rowland to come to him, charge of arrangements accepted Civil Engineers last Friday night. phomores are out of the running<br />\nand he was so impressed with the the offer, but will desire only two<br />\nMr. Cook spoke upon \"Prelim- due to their defeat by the Juniors.<br />\nyoung man that shortly after,<br />\nhundred and fifty men. At present inary Survey and Location,\" a sub- Their only hope of redemption is<br />\nwhen he left to spend the summer<br />\nthere are almost four hundred in ject of which he is well qualified to to vanquish the Freshmen when<br />\nin Europe, in hopes of finding one<br />\nthose two teams meet on October<br />\nor two acceptable professors, lie the unit; but little trouble should treat after twenty years of experi- 29.<br />\ntook Rowland with him for com- be experienced in the selection of ence in railroad work. Rather than<br />\nBUIDERS<br />\npany. When the college opened, the needed two hundred and fifty. take up the details of the subject, EllGRAUERS PRUITERS<br />\nRowland held the chair in physics. The game takes place during the Mr. Cook spoke briefly of the variThat summer—Gilman has left Thanksgiving holidays, and some ous branches of engineering endeavbut few memoranda of those inter- members of the unit will be out of or in railroad work and then point<br />\nesting months—was spent learn- town. From those remaining, choice ed out the fields oped to the young<br />\ning methods of education. Out of will be made of seniors, juniors, engineer in railroad work and the<br />\nit later grew two appointments sophomores and freshmen in the or- conditions he may expect to find in<br />\nwhich will never be forgotten— der of their seniority in numbers entering thereupon.<br />\nIn the early history of the counSylvester, a mathematician, and of years of service in the unit.<br />\ntry,<br />\nMr. Cook said, railroad work<br />\nNewell, a biologist.<br />\nconsisted<br />\nalmost entirely of the exDuring the remaining time un- FRESHMEN ELECT CURLETT<br />\npansion<br />\nof<br />\nnew lines and the adTO STUDENT COUNCIL<br />\ntil the founding, October 3, 1876,<br />\nvance of old lines into new terriProfessors Gildersleeve, Ira RemJ. U. Curlett was elected Student<br />\ntory.<br />\nDuring these times, the engipresident,<br />\nsen, later the second<br />\nCouncil representative from the<br />\nPrinters of<br />\nneer<br />\nled<br />\na romantic and exciting<br />\nand Charles Morris were called. Freshman class at the meeting held<br />\nThey represented a great field. after last Thursday's assembly. E. life. Now, however, railroad work<br />\ncrhe Johns 1-lopkins<br />\nfor each became pre-eminent in Fenimore was runner-up, being consists merely of internal expanNEWS,LETTER<br />\nhis special study: chemistry, phy- eliminated on the last ballot after sion and the necessary engineering<br />\nsics, biology, mathematics, liter- a hotly contested race.' Tom Lan- work has become a matter of rou- LOMBAPD and SOUTH STREETS<br />\nature, and the classics. Yearly dry, last year's Freshman coach, tine.<br />\nAt the conclusion of the address,<br />\nthey printed the results of their and former Hopkins captain, will<br />\nR. G.Loy & Company<br />\nthe<br />\nstudents held an informal disresearch and from Hopkins came coach the team this year. Candidates<br />\n(Robert G. Loy)<br />\ncussion on various topics connected<br />\ninspiration to every other college have been called out and practice<br />\nPHARMACISTS<br />\nwith railroad surveying.<br />\nin the country, thanks to our Im- will begin immediately.<br />\n<br />\nPayne &Merrill<br />\nCLOTHIERS<br />\nHABERDASHERS<br />\n315 Charles St. North<br />\n<br />\nHOUK<br />\n\"THE WONDER MOTOR MEC<br />\n<br />\nSHERWOOD BROTHERS, INC.<br />\n'4<br />\n<br />\nTOT<br />\n<br />\n4.4114 I 44.44 4444<br />\n<br />\nNIKKEI<br />\n<br />\n44441,5.1.4,4,41.<br />\n<br />\nTelephone, Madison 4722<br />\n<br />\nTHE I. W. HOWARD CO.<br />\nDRAWINGMATERIALS<br />\nSURVEYING INSTRUMENTS<br />\n2422 Madison Avenue<br />\nB altimore,Md.<br />\n<br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br />\n<br />\nJAS. H. DOWNS<br />\nENGRAVER<br />\n<br />\nPRINTER<br />\n<br />\nSTATIONER<br />\n<br />\n229 N. CHARLES ST.<br />\n<br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWELERS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"MAKERS OF THE VARSITY SEALS\"<br />\n<br />\nUNIVERSITY PARKWAY<br />\nRalph Townsend. cheer leader, PUBLICITY BOARD ORGANIZED<br />\nAt Charles St.<br />\nselected a group of freshmen and<br />\nContinued from page 1<br />\nIn February, 1876, Gilman was sophomores to assist in improving<br />\ninaugurated. It was the prepara- the cheering section. This group publicity from a downtown office.<br />\nDr. Edmunds this week extory shot and heralded the coming will be placed in the center of the<br />\npressed<br />\ngreat satisfaction at<br />\nof a new and greater undertaking stand and will be depended upon to<br />\nMOUNT VERNON PLACE<br />\nknowing<br />\nof<br />\nthe work of the Board<br />\nfor the benefit of the world. cheer when called upon. In this<br />\nMETHODIST EPISCOPAL<br />\nCHURCH<br />\nEveryone looked forward to the way it is expected to keep every- last year, though-it may not be to<br />\n(At the Washington Monument)<br />\nopening of Johns Hopkins Uni- one cheering all the time. Doug the knowledge of the undergraduREV. OSCAR THOMAS<br />\nversity, which was expected in the Turnbull announced that .every ate body of the quantity of maOLSON, D.D.,<br />\nfollowing October. And on Octo- freshman must buy the 0. D. K. terial and work. He feels that as<br />\nMinister<br />\nlong<br />\nas<br />\nthe<br />\nBoard<br />\nfunctions<br />\nin<br />\nthe<br />\nber 3, 1876, the first class, con- song book, which will cost $1.50.<br />\nSunday<br />\nServices<br />\nof Worship<br />\nproper manner, sending out news<br />\nsisting of twenty chosen fellows<br />\nEddie Day, chairman of the<br />\n11<br />\nA.<br />\nM.<br />\nand<br />\n8 P. M.<br />\nto papers throughout the counholding scholarships, was held.<br />\nsophomore \"pep\" committee, reSunday<br />\nafternoon<br />\n\"at home\"<br />\nThe<br />\nThomas Huxley. a great man, quested that. all class feeling be for-' try concerning all departments ot<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nRoom is a social occasion that brings<br />\nthen considered a radical of the gotten at. the football games, thus the University, it is doing good<br />\ntogether the student groups from Hopwork.<br />\nHe<br />\nmentioned<br />\nthat<br />\nhis<br />\nofworst type, gave the first lecture enabling everyone to concentrate on<br />\nkins, University of Maryland, Goucher,<br />\nPeabody, and other schools of Baltito that opening class. FTe merely cheering. He was seconded in this fice would co-operate with the stumore.<br />\narose at a designated time and bc- Plea, by Wallace Oles, freshman dent publicity office in attempting<br />\nEpworth League at 7 P. M. and the<br />\nto avoid duplication of work, yet<br />\nBible class at 10 A. M. are built pargan his speech. There was no president.<br />\nticularly with the needs of the young<br />\n.concentrate both forces on tne<br />\nopening Prayer. The presence oi<br />\npeople in mind.<br />\nsame line.<br />\nHuxley alone would have created<br />\nMR. L. P. SHANKS SPEAKS<br />\nFiles of clippings, pictures of<br />\nexcitement in the press, but with<br />\nContinued from page I<br />\nmen<br />\non the campus, faculty picno offering to God at such a mo- port for medical and physical extures,<br />\nnames of all out-of-town<br />\nmentous time, it was too much. amination before Monday, the<br />\nstudents<br />\nand their activities, a<br />\nThroughout the country, the 27th, would be suspended indefipress foretold the future of Hop- nitely from the University. Seats complete newspaper file of daily<br />\nkins—disaster--and it was a long in the Assembly room were facing newspapers, and addressing equipwhile before the university was in the opposite direction from last ment make up the material of the<br />\nagain favorably reecived in the week and the Dean explained that Board. There is plenty of work to<br />\nbe done and the candidates will<br />\npublic eye.<br />\nthis was due to the efforts being<br />\n.Tfreornerayelie and Culaw Sis.<br />\nget<br />\nsome training in newspaper<br />\n—By T. D. B.<br />\nmade to connect the Chem. Lab.<br />\nwriting.<br />\n-Where Wholesale and Retail Districts Meet\"<br />\nBuilding by loud speaker with the<br />\nHOPKINS DEFEATS LOYOLA<br />\nC. E. Building in order, if possiContinued from page 1<br />\nJUNIORS BEAT SOPHS<br />\nSubstitutions—Hopkins: Conant for ble, to double Mr. de la Mare's<br />\nContinued from page 1<br />\nOles; Almy for Blandi, Devereux for<br />\nMr. Shanks' address<br />\nTaylor, Lawrence for Turnbull, Lieb- audience.<br />\nfollows: Farinholt, 2b; Lowman,<br />\nensberger for Magill, Kaufman for Slo- was the first test of the experilb; Crawford, ss ; Bryan, ;I;<br />\nwik; Loyola: Polewicz for Simpson, Eagen for O'Connell, Carroll for Flynn, in en L.<br />\nWheeler, 3b; Willing, If; HoffWerne for Gorsuch, O'Connell for EaThomas Magill announced that<br />\nman, rf ; Phillips, c; Niner, p.<br />\ngan, Simpson, for Polewicz, O'Brennan<br />\nthose on the News-Letter, the<br />\nfor Linn Bentley for O'Connell.<br />\nThe Junior lineup was: WasserTouchdowns—Blandi (4), Taylor, Freshman baseball team and the<br />\nand individuality is offered here at prices that are not<br />\nman, ss ; Love, 3b; Thomsen, lb.;<br />\nTurnbull (2), Mallonee, Saperwein,<br />\nGlee<br />\nClub<br />\nmay<br />\nget<br />\ntheir<br />\nstudent<br />\nand cannot be underquoted by any house at any time.<br />\nAlmy, Lawrence (3).<br />\nHomer, c; Fonda, rf ; Boswell, cf ;<br />\nPoints after touchdowns—Turnbull, activities button from him.<br />\nQBesides the reputation of an old-established firm<br />\nCurry, 2b; Baldwin, If; Goodwin,<br />\n6 out of 9 (4 by placement, Taylor<br />\nUnder<br />\nthe<br />\npeppy<br />\nleadership<br />\nof<br />\nback of each sale with a guarantee.<br />\nis<br />\nholding the ball, 2 drop kicks); Almy,<br />\np; Hiss, 2b.<br />\n0 out of 1; Leibensperger, 3 out of 3 Townsend the usual enthusiasm<br />\n(by placement, Devereux holding the<br />\nScore by innings:<br />\nprevailed in yell practice, and the<br />\nball).<br />\nSophomores<br />\n0 0 0 0 0 0<br />\nFirst Downs—Hopkins, 30; Loyola, Assembly was brought to a close<br />\n3. ,<br />\n0 0 1 1 x-2<br />\nDECORATIONS<br />\nwith a mighty 'Hullabaloo that Juniors<br />\nDRAPERIES<br />\nFURNITURE<br />\nReferee—Heneage, Harvard.<br />\nUmpire—Hennessy, Brown.<br />\nTo date the Juniors are leading<br />\ndidn't need a loud speaker Li<br />\n343 NORTH CHARLES STREET<br />\nHead linesman—Lentz.<br />\nthe inter-class league. They have<br />\nbroadcast it.<br />\nTime of quarters-15 minutes.<br />\n<br />\nmortal Gilman.<br />\n<br />\nInauguration and Opening<br />\n<br />\nJohns Hopkins Students Will Find A Welcome At<br />\n<br />\nDROVERS & MECHANICS<br />\nNATIONAL BANK<br />\n<br />\nFURNITURE OF QUALITY<br />\n<br />\nJOHN C. KNIPP & SONS<br />\n<br />\n\f", "format": "basic_html", "processed": "VOL. XXIX, No 8<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 28, 1924<br /><br />\nPRICE 5 CENTS<br /><br />\nRULES FOR INTRAMURAL PUBLICITY BOARD ORGAN- ANATOLE FRANCE SUBJECT<br />\nIZED; NEW OFFICE IN<br />\nMATCHES ANNOUNCED<br />\nOF MR. L. P. SHANKS'<br />\nCHEM. LAB<br />\nBY RIFLE CLUB<br />\nADDRESS<br />\nSeries of Six Matches Will Begin On Provost Edmunds Satisfied With Work Hopkins Instructor Outlines Life<br />\nNov. 7 and Continue Until<br />\nOf Board Last Year; Will SuperFamous French Novelist, In<br />\nvise Organization This Year<br />\nDecember 19<br />\nThursday Assembly<br /><br />\nBLUE JAYS ROMP OVER<br />\nJESUITS AT HOMEWOOD<br />\nIN FIRST BATTLE, 87-0<br />\nOf<br /><br />\nHopkins Backs Gallop Over Loyola Line, Flashing Brilliant Open<br />\nBeginning on Monday, NovemOrganization of the Publicity<br />\nTouching upon the high spots<br />\nField Runs; Oles and Magill Injured<br />\nber 7, the Johns Hopkins Univer- Board took place Monday noon only in the life of Anatole France,<br />\nLost in the shuffle, the Green and Gray representatives of Loyola<br />\nsity Rifle Club Intramural Matches when the members met in the Mr. L. P. Shanks entertained an<br />\nCollege were mauled and walked over by Hopkins to the tune of 87<br />\nwill be staged. The sixth and last of Blue Jay office at 12.20, according attentive audience at the Assemto 0 last Saturday at Homewood. Crippled by the loss of \"Polly\"<br />\nthis series will take place on De- to information given out this week bly last Thursday. He has taken<br />\nByrne, their fullback, the Jesuits took the field with Paul Menton<br />\ncember 19. Only members of the by James Young, president of the the place of Professor Lancaster<br />\nin their star's position. Nothing, however, seemed to avail against<br />\nRifle Club will be eligible to com- Board.<br />\nat Hopkins and is at present the Blue Jays, who crashed through the Loyola<br />\nline as easily as a<br />\npete in these matches, the particiNo definite work has been un- teaching French. Dean Ames pre- circus clown dives through his paper hoop.<br />\npation in which will enable the new dertaken since the opening of sented him as a man familiar with<br />\nLong broken field runs were plentiful and on the defense Levy,<br />\nmen to become accustomed to shoot- school because of having no work- French ideals.<br />\nMagill and Slowik sparkled. Magill and Oles, however, were forced<br />\ning under match conditions, and ing quarters and because of no<br />\nAnatole France ranks with Har- to leave the game due to slight injuries.<br />\npave the way for a successful sea- funds. The president<br />\nof the dy and Kipling as one of the greatThe game opened with Loyola<br />\nson.<br />\nBoard advanced money to cover est of French and European con- JUNIORS SHUT OUT SOPHS, kicking to Hopkins. Taylor electThe Rifle Club has completed its the expenses during the spring and temporaries, Mr. Shanks began.<br />\n2-0, IN KEENLY FOUGHT<br />\ned to return the kick immediately.<br />\nPlans concerning the six intramural no reimbursement has been made. He won the Nobel prize for literCONTEST<br />\nTurnbull's punt was short and afmatches and has announced the Some financial assistance was giv- ature and was given a seat in the<br />\nter Enright had gained a lone first<br />\nrules which are given below in de- en by the Athletic Association French Academy. His books sold Niner Allows No Hits, While Goodwin<br />\ndown the Hopkins line held. Mentail. Graduate students now attend- from a fund secured from alumni. in re-editions more numerous than<br />\nHolds Opponents to One<br />\nton's try at a placement was<br />\ning the university will be welcomed The $5 appropriation from the those of any American or English<br />\nNiner lost a heart-breaking<br />\nblocked. With the ball in Hopby the club.<br />\nStudent Activities Council only book. His funeral was attended pitching duel to G9odwin when kins' possession Taylor then<br />\ncovers the postage bill for three by the most distinguished gather- the Sophomores failed to back up crashed through the whole Loyola<br />\nTHE RULES<br />\nFirst Match, Friday, November weeks at the rate material was ing since the triumph of General their star hurler. The Juniors were eleven for a spectacular<br />\n55-yard<br />\nFoci.<br />\n7, 1924, between 1 and 6 P. M.— sent out last year.<br />\nhelpless before the dazzling speed<br />\nrun off right tackle.<br />\nBlandi<br />\nYouthful At Fifty<br />\nef the Soph pitcher. Niner did plunged<br />\nPosition: Prone and sitting; one<br />\nArrangements have been made<br />\nthe ball over for the first<br />\nIn his early years the French not allow a single hit, struck out<br />\ntarget in each position, 2 shots on to use Room 22 in the Chemical<br />\nscore of the game.<br />\neach bull's eye, including the sight- Laboratory for the Publicity Of- satirist absorbed the literary at- ten men, and issued only one pass.<br />\nA forward pass, Taylor to<br />\nmosphere of his father's bookstore Goodwin also pitched an excellent<br />\ning bull.<br />\nfice. Equipment and files will be<br />\nTurnbull, gained 30 yards and<br />\nEligibility: Open to all members moved there immediately and af- and early turned to bookish brana of ball as he won his sec- Taylor plunged over for the secof the Club who have never fired ter Monday's meeting active work things. He may be said to have ond straight game for the Juniors. ond touchdown. The third was<br />\nin a match as a member of the J. will start on publicity concerning reversed the usual order of a life- Both teams fielded exceptionally<br />\nthe result of end runs by Taylor<br />\ntime, dwelling upon the past in the well. The Juniors made only one<br />\nR. U. team.<br />\nthe undergraduate activities'. Efand Turnbull, allowing Blandi to<br />\nfirst half of his life and taking up error, while the Sophs made two<br />\nRifles: Winchester, Cal. 22, sin- forts are under way to increase<br />\ntear over the goal line. The first<br />\nat 50 the enthusiasm of youth. In misplays.<br />\ngle shot.<br />\nthe budget. A 10 per cent allowquarter ended: Hopkins, 19; Loythe 70's, after war and defeat, the<br />\nGoodwin opened the game by ola, 0.<br />\nance on the balance left from all<br />\nAmmunition: .22 short.<br />\nFrench nation sought to escape hitting Farinholt, the<br />\nSophomore<br />\nPrizes: 1st prize, 250 rounds, activities was voted on at an Ac- from<br />\nAlmost immediately atter the<br />\nthe present and his dreams lead-off man, Lowman followed<br />\nCouncil<br />\ntivities<br />\nmeeting<br />\nlast<br />\nammunition, cal. .22 long; 2nd<br />\nsecond<br />\nperiod began Hopkins reof the past -fitted in well at that by hitting a line dire to Love,<br />\nPrize: 100 rounds, ammunition, spring, but this will not care for<br />\nceived<br />\nball through a fumble<br />\nthe<br />\ntime.<br />\n•<br />\nwho completed a snappy double on Loyola's 30-yard line. Taylor<br />\ncal. .22 long; 3rd prizes: 50 rounds, the large amount of work which<br />\nLater, however, there came the play by catching Farinholt off<br />\nwill be done this year.<br />\nammunition, cal. .22 long.<br />\nand Turnbull put it over again on<br />\nreaction and his novels turned first. Crawford struck<br />\nout. Was- two plays. Blandi, with the aid of<br />\nAfter several weeks of intensive<br />\nSecond Match, Friday, Novemagainst the church. After nis serman, Love<br />\nand Thomsen were the other backs, scored the next<br />\nber 14, 1924, between 1 and 6 P. M. work last winter it was found that<br />\nelection to the Academy he turned sent down in order<br />\nby the fast two touchdowns by straight footPosition: Kneeling; one target, 2 the Publicity Board could actually<br />\nhis literary skill toward criticism fielding Sophomore<br />\nteam: In the ball. Turnbull's end runs were<br />\nshots on each bull's eye including give Hopkins affairs plenty of real<br />\nthe sighting bull.<br />\npublicity and the organization got of affairs of the day and took the second inning only three men on beautiful examples of perfect inpart of the common people. He each side faced the plate.<br />\nEligibility: Open to all members under way in such a manner that<br />\nterference. The half ended: Hopexpressed<br />\nhis opinions dramaticalof the club.<br />\nit was properly functioning, but<br />\nJuniors Score First Run<br />\nkins,<br />\n40; Loyola, 0.<br />\nly through fictitious characters.<br />\nlack of funds halted the rapid<br />\nRifles: Any rifle, cal. .22.<br />\nfeeble<br />\nW<br />\nasserman<br />\nstifled<br />\na<br />\nAshton Devereux took Taylor's<br />\nLa Revolte des Anges<br />\nstride of the Board.<br />\nAmmunition: Any cal. .22.<br />\nMr. Shanks concluded his talk Sophomore rally in the third by signal-calling position at quarter<br />\nIn a letter from Dr. Ames to the with<br />\nPrizes: 1st prize: $5:00; 2nd<br />\na sketch of the French au- making a spectacular running during the second half. Turnbull<br />\nPrize: $3.00; 3rd prize: $2.00; 4th editor of the Board, he says tnat<br />\nthor's last novel, \"La Revolte des catch of Crawford's hot liner. The intercepted a pass by Menton at<br />\nPrize: $1.00; 5th prize: 100 rounds the organization will consider itAnges,\" published in 1914, in Juniors scored the first tally of the the beginning of the half and<br />\nself under the supervision of Proammunition.<br />\nwhich the( Cherubim and Sera- game when Wasserman reached made 65 yards before being<br />\nThird Match, Friday, November vost Edmunds, who is conducting<br />\nphim, upon .asking Lucifer's aid first after the Soph catcher downed. He plunged over the<br />\n21, 1924, between 1 and 6 P. M.-- the endowment campaign and the<br />\nin their conspiracy against Heaven dropped his third strike. Wasser- goal line a moment later. After<br />\nContinued on page 2, col. 5<br />\nContinued on page 4, col. 3<br />\nare told that even in the event of man stole second and was sacri- the kick-off Devereux made a gain<br />\nsuCcess, the order of victor and ficed to third. He then successful- of 41 yards on two successive<br />\nDE LA MARE'S FOURTH LECTURE DEALS<br />\nvanquished would merely be re- ly staged a squeeze play with the runs. On the third play he passed<br />\n•to Mallonee for Hopkins' eighth<br />\nWITH IMAGINATION IN PROSE WRITING versed and tyranny still prevail. help of Love, who was at bat.<br />\nThe moral is the uselessness of<br />\nThe fourth inning again saw the touchdown. Sauerwein interceptwar.<br />\nSophomores blanked. Goodwin let ed a forward pass and ran 53<br />\nWalter De La Mare, the English its personal interest. Still another The irony and apparently sim- himself<br />\ninto a hole when two men yards for the last score of the<br />\nPoet who has been lecturing under variety is \"professional prose,\" ple style of Anatole France<br />\nare his got on base, but he pulled through period which ended: Hopkins, 60;<br />\nthe Percy Turnbull Memorial which is a literary uniform for its<br />\nchief weapons. He was a genial in great style by striking out tne Loyola, 0.<br />\nPoundation, gave the fourth of his authors. It is ceremonious, imper- and kindly skeptic.<br />\nAfter Almy, who was substitutlast two men. The Juniors scored<br />\nseries of lectures last Thursday in sork-tl, pompous and is employed<br />\nMr. Shanks concluded his talk their second run in the fourth ed for Blandi, put over the tenth<br />\nthe C. E. Hall. The subject was chiefly by lawyers and political<br />\nby drawing the moral from the life when Thomsen, who managed to touchdown at the' beginning of<br />\n\"Imaginative Expression, or the speakers.<br />\nof Anatole France that if one is to walk and steal second and third, the final period, Lawrence, taking<br />\nMedium of Prose.\"<br />\n\"But,\" Mr. De La Mare added, be happy one must spend his life raced home on a passed ball.<br />\nTurnbull's place, scored the last<br />\n\"Prose,\" said the lecturer, is the a prose worthy of the name of lit- in the service of others.<br />\nBryan started the Sophs on a three touchdowns, Leibensperger<br />\nordinary language of ordinary men erature must be human, engaging,<br />\nSuspension, Non-Exam Penalty<br />\ndesperate last inning rally when he kicking the goal each time, Devin.ordinary circumstances.\" When various, persuasive. And, above all, Dean Ames announced ,at the<br />\nreached first on Curry's - error, ereux holding the ball.<br />\ntouched by genius it becomes liter- it must reveal the active possession opening of the meeting that all<br />\nThe score:<br />\nature. 1\\1 r. De La Mare cited vari- not only of a sensitive mind but those Freshmen who did not re- Wheeler became the man of the<br />\nTHE SCORE:<br />\nhour when he crashed out the only<br />\nous forms of prose writing. First something of a heart.\"<br />\nHopkins (87)<br />\nContinued on page 4 col. 2<br />\nPos.<br />\nLoyola (0)<br />\nhit of the game, a single to right Mallonee<br />\nL E.<br />\nhe considered \"the prose of the<br />\nMost necessary of all for true<br />\nFlynn<br />\nfield. Bryan stopped at third. Magill (Capt.) ..L.T.<br />\nSimpson<br />\nmatter of fact,\" which is built up literature are sensuous memory<br />\nOles<br />\nLG<br />\nWatson<br />\nNOTICES<br />\nWheeler further cheered the Day<br />\nC<br />\nby an aggregate mental effort. Un- and imagination. \"What the naked<br />\nSullivan<br />\nRG<br />\nSophs by pilfering second. Good- Slowik<br />\nMeeting of editorial candidates<br />\nTholes<br />\nder this form of prose conies most eye saw yesterday the inwird eye<br />\nLevy<br />\nR<br />\nT<br />\nHolland<br />\nof the Hullabaloo at 12:20 Thursmoment<br />\ncritical<br />\nthis<br />\nrallied<br />\nwin<br />\nat<br />\nBerndt<br />\nR E.<br />\nscientific writing of the definition may recall tomorrow. In imaginaO'Connell<br />\nday in the Blue Jay office. Plenand crushed the Sophomore hopes Taylor<br />\nEnright<br />\nty of work and candidates are<br />\nQ13.<br />\ntype. It is naked in form and\"pre- tion, then, we sensuously re-experiSauerwein<br />\nLH<br />\nLinn<br />\nneeded.<br />\nWilling<br />\nfanning<br />\nHoffman.<br />\nby<br />\nand<br />\nTurnbull<br />\ncision is its only essential virtue.\" ence the past.\" \"The faculty of imRH<br />\nGorsuch<br />\nMr. Myers, University postF B.<br />\nPhillips, the next man up, ended Blandi<br />\nMenton<br />\nThen there is the prose, which like agination can make a wilderness<br />\nmaster, announces that all mail<br />\nScore<br />\nby<br />\nPeriods:<br />\npopping<br />\nto<br />\nLove.<br />\nby<br />\ngame<br />\nthe<br />\nfor<br />\nmen<br />\nnot<br />\nhaving<br />\npost-office<br />\nRuxley's conveys knowledge gained blossom like a rose. Without creHopkins<br />\n21 20 27-87<br />\nboxes will be held for five days,<br />\nThe Sophomore line-up was as<br />\nby the writer himself, and may be ative imagination everything would<br />\nLoyola ... 0<br />\n0<br />\n0<br />\n0— 0<br />\nand then returned to the sender.<br /><br />\nof great literary worth because of be rendered prosaic.\"<br /><br />\nContinued on page 4, col. 3.<br /><br />\nGmtifmod on page 4, col.1<br /><br />\n2<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 28, 1924<br /><br />\nThe Johns Hopkins News-Letter<br />\nFOUNDED 1897<br /><br />\nSubscription<br /><br />\n$2.00<br /><br />\nEntered as second-class matter December 3, 1909, at the Postoffice at<br />\nBaltimore, Md., under Act of Congress, November 3, 1879.<br /><br />\nTHE NEWS-LETTER<br />\nMAILBAG<br /><br />\nEVERY 61 UDENT NEEDS ONt<br /><br />\nAll letters intended for publication<br />\nmust be concise, written in ink on<br />\nregular letter size paper, on one side<br />\nonly.<br />\nNo attention will be paid to anonymous letters, but names signed as an<br />\nevidence of good faith will not be<br />\nprinted if request is made that they be<br />\nomitted.<br />\nThe publication of a letter is not to<br />\nbe taken as an indorsement of its views<br /><br />\nby the \"News-Letter,' which invites the<br />\nfreest discussion of matters of general<br />\nInterest.<br /><br />\nEditor of THE NEWS-LETTER:<br />\nPublished semi-weekly from October to June by the students of Johns<br />\nHopkins University.<br /><br />\nThere has been considerable talk<br />\namong representatives of different<br />\nstudent publications concerning the<br />\nBusiness communications should be addressed to the BUSINESS MANAGER, JOHNS HOPKINS UNIVERSITY; all articles and other communications Hopkins blotter-advertising idea. I<br />\nshould be sent to the MANAGING EDITOR.<br />\nam taking this method to present<br />\nthe situation to the student body beTelephone<br />\nHomewood 0100 cause it is a question which concerns every publication and the blotter advertisement must not occur<br />\nEditor-in-Chief<br />\nBusiness Manager<br />\nagain under the conditions it did<br />\nR. CARMICHAEL TILGHMAN, '25<br />\nPHILIP W. HOWARD, '25<br />\nthis year.<br />\nManaging Editor<br />\nALGER Hiss, '26<br />\nAssistant Managing Editor<br />\nERNEST A. STRATHMAN, '26<br />\nAssociate Editors<br />\nBENJAMIN T. ROME, '25<br />\nARTHUR L. NELSON, '26<br />\nJunior Editors<br />\nEDWARD 0. MICHEL, '26<br />\nJAMES YOUNG, '25<br />\nHENRY R. TURNBULL, '26<br />\nA. RISLEY ENSOR, '26<br />\nJ. HENRY JARRETT, '27<br />\nCHARLES F. REEsE, '27<br />\nW. BARNES HAIL, '27<br /><br />\nAdvertising Manager<br />\nALFRED J. McICAY, '26<br />\nCirculation Manager<br />\nOTHO J. KET.TXR, III, '26<br />\nAssistant Business Managers<br />\nG. DONALD GIESKE, '25<br />\nJ. JACKSON KIDD, '26<br />\nT. STRAN SUMMERS, '25<br />\nHEYWARD E. BOYCE, JR., '27<br />\nROBERT T. SAUERWEIN, '26<br />\nARTHUR SWANSON, 227<br /><br />\nMember Southern Intercollegiate Newspaper Association<br /><br />\nPrinted by the Read-Taylor Co., Lombard and South Sts., Baltimore, Md.<br /><br />\nBusiness staffs of the Hullabaloo, the Blue Jay, and THE NEWSLETTER report that their revenue<br />\nhas been stopped from faithful advertisers who have formerly appeared in the columns of the respective publications. With the excuse that they had advertised in the<br />\nblotter, merchants say their appropriation has been exhausted and<br />\nthat they Will only go into one advertising during the year.<br />\nAdvertising men know pretty<br />\nwell that money spent on such a<br />\nproposition is wasted. The life of<br />\na blotter is very short. The money<br />\ngoes into the pockets of a student<br />\nwhen it should go into the treasury of a publication, where circulation is guaranteed each week or<br />\nmonth. In the case of the Hullabaloo, the price of one small space<br />\non the blotter deal would get a half<br />\npage in a book which lasts forever<br />\nand which is representative of Hopkins.<br /><br />\nREMINGTON<br />\nPortableTypewriter<br />\nThe Remington Portable will serve you well—<br />\nnot only in school or college, but for years and years<br />\nto come. It will give you a training which will be<br />\nhelpful to you in all your after life.<br />\nCompact—fits in a case only four inches high.<br />\nComplete—has the four-row keyboard---no shifting for figures—just like the big machines.<br />\nConvenient—can be operated on your lap if you<br />\nwish, for it carries its table on its back.<br />\nCome in and see the Remington Portable.<br />\nPrice, complete with case, Igo. Easy payment<br />\nterms if desired.<br />\nREMINGTON TYTEWRITER CO.<br />\n25 W. Fayette St., Baltimore, Md.<br /><br />\nOPTIMISTIC OUTLOOK FOR RIFLE CLUB ANNOUNCES<br />\nRULES FOR MATCHES<br />\nTRACK TEAM<br /><br />\nContinued from page 1<br />\nUnder the guiding hand of<br />\nCoach Huntley Lloyd, the track Position: Standing; one target, 2<br />\nteam is surely rounding into form. shots on each bull's eye, including<br />\nAlthough it is too early to make the sighting bull. Eligibility: Open<br />\nabsolute predictions, nevertheless it to all members of the club. Rifles:<br />\nFRATERNITIES<br />\nseems certain that Hopkins will be Any rifle, cal. .22. Ammunition:<br />\nrepresented by a fine track team Any cal. .22. Prizes: 1st prize,<br />\nof<br />\nspirit<br />\nThe<br />\nassociation has, in all ages, induced men to join tothis year. It is true that the loss $5.00; 2nd prize, $3.00; 3rd prize,<br />\ngether for the pleasures of mutual enjoyment or for the attainment<br />\nof Hopkins' nationally known fliers, $2.00; 4th prize, $1.00; 5th prize,<br />\nof some common purpose for which the support of members is necesBooth and Clark, is a severe one, 100 rounds ammunition.<br />\nsary. And so, in nearly all leading educational institutions of this<br />\nFourth Match, Friday, Decembut practically all of the old men<br />\ncountry, we find Greek letter societies, commonly called \"College Fraare back again, augmented by some ber 5, 1924, between 1 and 6 P. M.<br />\nPositions: Kneeling and standing;<br />\nternities,\" founded on this same idea. Social life forms basic raison<br />\nI understand that the Hopkins very promising new men.<br />\nCaptain Heyn will be entered in one target in each position, 2 shots<br />\nd'etre of all fraternities. A fraternity is unique among secret socie- seal can only be used on the official<br />\non each bull's eye, including the<br />\nties, although its secrecy is largely nominal, in that it is the only publications. Two of them were the 100, 220, broad jump and pole<br />\nsighting<br />\nbull. Eligibility: Open to<br />\nvault; Gwinn in mile and 2 mile<br />\norganization of the kind founded on an aristocracy of social advan- used on the advertising scheme and<br />\nall members of the club who have<br />\nraces.<br />\ntage and educational opportunity.<br />\nsurely were not authorized for such<br />\nProctor, who holds the high- not won a prize heretofore. Rifles:<br />\nThe campaign for new members is called \"rushing\" and is the a thing. The seal is the stamp of jump record, will again compete in Any rifle cal. .22. Ammunition:<br />\nAny cal. .22. Prizes: 1st prize, $2;<br />\ngreat student feature at the beginning of each college year. Every the University and has no place on the high jump and broad jump.<br />\nprize, $1; 3rd prize, 100 rounds<br />\n2nd<br />\nEdwards, the record holder of<br />\na blotter.<br />\nfreshman is almost immediately confronted by the question, shall I<br />\nammunition.<br />\nthe 880-yard dash, is back in school<br />\nBefore the same proposition is<br />\njoin a fraternity? For the man who decides in the affirmative a still<br />\nFifth Match, Friday, December<br />\nagain after a lapse of a few years<br />\nmore important question demands his attention, which fraternity shall carried out next year, or next se- and bids fair to repeat his stellar 12, 1924, between 1 and 6 P. M:—<br />\nmester, because the blotters will<br />\nPositions: Prone, sitting, kneeling<br />\nI join? 'This question is a problem of the greatest magnitude for<br />\nperformances.<br />\nhardly last a semester, Pi Delta<br />\nthe nature of the freshman will\" depend very largely upon the ideals Epsilon, the journalistic fraternity, In addition to these is Straus, and standing; 1 target in 'each position, 2 shots on each bull's eye, inand traditions of the fraternity he joins. No other influence in col- should step in and take hold of the who put the shot for Princeton. He<br />\nwill, in all •likelihood, get the call cluding the sighting bull. Eligibil lege is so close or permeating as that particular kind resulting from situation. My suggestion is that the<br />\nity : Two teams of 5 men each will<br />\nhere.<br />\nfraternity membership. Usually a man's college career is character- merchants who regularly deal with<br />\nThe former City and Poly star be selected by the Executive Officer<br />\nized as being associated with one fraternity or another. The college Hopkins publications, be notified prep sprinters are showing up well from the highest scores in all four<br />\nthat no advertising in booklets, blotin practice, as is also one youngster positions up to date. Rifles: Any<br />\n,gives environment; the classroom gives knowledge; activities give<br />\nters, etc., is authorized unless the<br />\ntraining; but to all of these the fraternity gives distinction and color. solicitor bears a letter or card from from Central High of Washington. rifle cal. .22. Ammunition: Any<br />\nManager Donaldson announced cal. .22. Prizes: A theater party<br />\n\"Fraternities have personalities as distinct as persons,\" it has the president or some officer of the that no definite schedule<br />\nhas been for the winning team.<br />\nSixth Match, Friday, December<br />\nbeen said. The fact that fraternities are as distinct as persons im- fraternity. This perhaps could be arranged as yet. He hopes to comdone by the student council, but no<br />\n1924, between 1 and 6 P. M.—<br />\n19,<br />\nplies a difference sufficient to induce careful choice. Fraternity life<br />\nplete arrangements soon that will<br />\none feels the direct need of such acTotal amount of money colPrize:<br />\nin the wrong fraternity is worse than none at all, for as Bacon says' tion more than the heads of the insure some very interesting meets<br />\nlected as fines for using profanity,<br />\nin his essay on Friendship, \"a crowd is not company.\" The wise publications and members of the for this coming track season. It is<br />\nestimated at $15.00.<br />\nunderstood<br />\nthat<br />\nat<br />\ntrione<br />\nleast<br />\nchoice will be the fraternity whose spirit is closest, most congenial staffs who go out to sell advertisDetails to be announced later.<br />\nangular meet with two other leadto the freshman, the fraternity composed of men of his type, their ing space. They are members of ing college teams will be arranged.<br />\nPi Delta Epsilon and if they see<br />\ntastes his tastes and their ideals his ideals. That no man should yield<br />\nIn order to expedite matters,<br />\nthat action is needed they would<br />\nManager Donaldson has inauguto glamor in which he will not be congenial is a truth which many not<br />\nhesitate to bring immediate aclearn too late. Sometimes when a \"bid\" does not come from the tion to curb useless waste of money rated a new card-filing system.<br />\ndesired fraternity it is wise to wait, but as a rule the better way is to which rightfully belongs to the Every man connected with the track<br />\nteam is represented in this index.<br />\nbegin to look elsewhere, for often a man favors a particular fraternity three publications.<br />\nRecords of past experience, physbecause he happens to know more about it.<br />\nThis is a matter that must not ical condition, and scholastic data<br />\nLUNCHEON—AFTERNOON TEA—<br />\nhang<br />\nfire. Just the one example is are a few of the details that comSuccess and happiness most certainly do not depend upon makDINNER<br />\nsufficient.<br />\npose an accurate statement of<br />\ning a fraternity. But if a choice of fraternities is to be made at all,<br />\nevery man. The good results exYours truly,<br />\nit should be the right choice. It will save the Freshman vain regrets<br />\nBanquets &amp; Receptions<br />\npected from this system are obvilater.<br />\nCAKES —ROLLS —SANDWICHES<br />\nJAMES R. YOUNG.<br /><br />\nHOMEWOOD, BALTIMORE, MD., OCTOBER 28, 1924<br /><br />\nqwg Stefuart<br />\nZra laciont<br /><br />\nTHE JOHNS HOPKINS NEWS LETTER, OCTOBER 28, 1924<br /><br />\nErnest G.Leimbach<br />\n2819 Greenmount Avenue<br />\n(Opposite Ilchester)<br />\nA high-grade Haberdashery Shop<br />\nWithin Walking Distance of the<br />\nUniversity<br /><br />\nUPTOWN<br />\nQUALTIES<br /><br />\nDOWNTOWN<br />\nPRICES<br /><br />\nOPEN EVENINGS<br /><br />\nNot a hair out of place and not<br />\na single flake of dandruff. Big<br />\nand strong also. Adonis had<br />\nnothing on him.<br />\nYou can gamble he doesn't say a word<br />\nabout \"Vaseline\" Hair Tonic. But he<br />\nuses it almost religiously. Nothing like<br />\nit for mastering unruly hair and keeping<br />\nthe scalp healthy. Rub it in regularly<br />\nand your hair will stay with you and<br />\nlook right. At all drug stores and student barber shops.<br />\nEvery \"Vaseline\"product Is-recommended everywhere because of its<br />\nabsolute purity and effectiveness.<br /><br />\nVaseline<br />\nREG,U.S PAYOFF.<br /><br />\nHAIR TONIC<br />\nFor the Health and<br />\nAppearance of the Hair<br /><br />\nChesebrough<br />\nState Street<br /><br />\nMfg. Company (Coned)<br />\nNew York<br /><br />\nLATEST STYLES AND FORMS<br />\nEngraved<br /><br />\nWEDDING INVITATIONS,<br />\nANNOUNCEMENTS AND<br />\nVISITING CARDS<br /><br />\nSAMUEL H. KIRBY<br />\nENGRAVER<br />\nSamples and Prices on Request<br />\n42 SOUTH ST.<br /><br />\nBALTIMORE<br /><br />\n3<br /><br />\nSELECTION OF GILMAN AS PRESIDENT<br />\nASSURED FUTURE OF NEW UNIVERSITY<br />\nThis, the second of a series of articles dealing with \"Hopkins History\", tells of the<br />\nappointment of the first president and his colleagues and of their combined efforts<br />\nduring that memorable first year.—Editor's Note.<br /><br />\nHEN Johns Hopkins<br />\nhad fully developed<br />\nhis plans -of creating<br />\na university, he<br />\nformed a corporation.<br />\nJohns Hopkins University then<br />\nactually became a reality. This<br />\nhappened-on the 24th of August,1864. He had spent much time<br />\nand care in choosing the board of<br />\ntrustees who were to have the<br />\nenormous task of starting the new<br />\norganization, of picking its leader,<br />\nand of making it a success once<br />\nit was started. That board, which<br />\nfunctioned so smoothly and perfectly, was headed by Galloway<br />\nCfieston, as chairman, and consisted of twelve distinguished men in<br />\nmany walks of life, chosen without • regard to their religion or<br />\ntheir political feelings for the<br />\nNorth or the South—a question<br />\nwhich was still burning deeply in<br />\nthe hearts of the people.<br /><br />\nsame time be capable of reaching<br />\nthem. Their unanimity, without<br />\ncorrespondence between themselves, in pointing to Daniel Colt<br />\nGilman for the important post is<br />\nimpressive. He made Hopkins<br />\nsomething great and valuable to<br />\nthe whole country, for had not the<br />\n\"one man\" been chosen, undoubtedly, the history of Johns Hopkins and of higher education<br />\nwould have been very different.<br />\nGilman in Baltimore<br /><br />\nIn December of 1874, Gilman—<br />\nhe was then president of California and his work there will long<br />\nbe remembered—made the overland journey to Baltimore in order personally to interview and<br />\nbecome acquainted with the trustees. He realized the wonderful<br />\npossibilities of advancing education to a point unknown before,<br />\nand he stated to the board at that<br />\ntime that his acceptance lay in<br />\ntheir approval of his conditions.<br />\nPerfect Plans<br />\n-Many, many months passed dur- He said, speaking of the future<br />\ning which the men became well university:<br />\nacquainted with one another as<br />\nPlans for Future<br />\nwell as with their common inter\"I will make it the means of<br />\nest. They spent the time in gath- promoting scholarship of the<br />\nfirst<br />\nering together contemporary lit- order, leaving the work now<br />\ndone<br />\nerature on every aspect of educa- by undergraduates to be done<br />\ntion. Thus they built their plans elsewhere for the most part. For<br />\nand organized until, in the sum- this purpose I will select as promer of 1874 (Hopkins died in De- fessors only men now standing in<br />\ncember, 1873), they invited three the front rank in their fields, paymen of acknowledged pre-emi- ing them well enough to leave<br />\nnence to come to Baltimore to an- them at ease as to the commoner<br />\nswer many inquiries concerning 'and coarser cares of life. I will<br />\nwhich they were still in doubt. give them students far enough adEliot, of Harvard, president of a vanced to keep them stimulated<br />\ncollege of the old type; White, of to the highest pitch; and we will<br />\nCornell, the head of a new college exact from them yearly proof of<br />\nwhich he had had from its begin- the diligence and fruitful cultivaning, and Angell, of Michigan, tion of their specialties by compresident of a very flourishing pelling them to print somewhere<br />\nState University, were the three. the results of their research. Our<br />\nThey answered a great many money will be •spent for the best<br />\nquestions along various lines, but professors, the best apparatus and<br />\nit is extremely interesting to note for creating scholarships<br />\nwith<br />\ntheir' unity of opinion when the which we may bring the best<br />\nstusubject of the presidency of Hop- dents. It will not yet be wasted<br />\nkins was presented. To a marked on architecture. . . . The undegree the future of the new insti- biased truth alone will be our<br />\ntution was to be moulded by the aim.\"<br />\ntype of man who would become<br />\nHis ideas were unanimously acthe very heart and soul of that cepted. Indeed, they created a<br />\ninstitution. Consequently he must hitherto unknown degree of enhave the highest aims and at the<br />\nContinued on page 4 col. 1<br /><br />\nDR.<br />\nKOUWENHOVEN<br />\nINSTALLS LOUD SPEAKER<br />\nTO HEAR DE LA MARE<br />\nIN CHEMICAL LAB<br />\nWalter De La Mare cannot find<br />\na hall large enough at Homewood<br />\nto accommodate the large crowds<br />\n-who are desirous of hearing the<br />\ndistinguished Englishman give<br />\nhis talks on poetry. Last Thursday at half past four every seat PI DELTA EPSILON<br />\nELECTS HON. H. A. L. FISHER TO LECin the C. E. Hall was taken. The<br />\nOFFICERS FOR 1924-25<br />\nTURE HERE WEDNESDAY<br />\naudience included people of all<br />\nP. W. Howard was elected pres- \"The Present Relations of<br />\nages.<br />\nident of the Pi Delta Epsilon Fra- Great Britain and Her DependenIn order that more may hear ternity at a recent meeting of that<br />\ncies\" is the subject of a lecture to<br />\nDe La Mare's lectures, Dr. Kou- organization. E. E. Donaldson was be given<br />\nWednesday by the Right<br />\nwenho-ven has supervised the in- elected vice-president, H. Turnbull Hon. H. A. L.<br />\nFisher, for six<br />\nstallation of a loud speaker in the secretary, and G. Hess treasurer, years a member of<br />\nLloyd George's<br />\nauditorium of the Chemical Lab- for the year 1924-25. This election, Cabinet, at the<br />\nUniversity. This<br />\noratory. A broadcasting micro- of considerable moment in the lo- lecture is given<br />\nunder the George<br />\nPhone has been placed on the cal chapter's yearly activities, ex- Huntington<br />\nWilliams Memorial<br />\nsPeaker's desk in the C. E. Hall, cited considerable interest in the Lectureship.<br />\nWhich is connected by wires with university literary circles.<br />\nMr. Fisher was President of the<br />\na loud speaker in the Chemical<br />\nThis fraternity is a national or- Board of Education<br />\nin England<br />\nLaboratory. The entire apparatus, ganization, its purpose is to raise for<br />\nsix years. He was elected to<br />\nconsisting of the microphone, bat- the standards of college journalism<br />\nParliament in 1916 as a Liberal.<br />\nteries, and tubes which amplify and to honor those men<br />\nwho have Previous to that time<br />\nhe was at<br />\nthe voice over 100,000 times, terattained distinction in that partic- New College,<br />\nOxford, and later<br />\nminates with the loud speaker in ular field.<br />\nvice-chancellor of Sheffield Unithe auditorium of the Chemical<br />\nThe local chapter was installed in versity. Since the fall of Lloyd<br />\nLaboratory.<br />\nOctober, 1922, by a delegation from George's cabinet Mr. Fisher<br />\nhas<br />\nThursday there was some trou- the chapter at George Washington been interesting<br />\nhimself in politible in hearing clearly, caused by a University. Only students in the cal science and<br />\nhistory. He is an<br />\nfan in the Chem. Lab., but this Junior and Senior classes who have<br />\nauthority on the constitutional asdifficulty will be done away with served at least two years on a pub- pects of the<br />\nBritish Empire, and is<br />\nhY today, when Mr. De La Mare's lication are eligible for membera biographer of Napoleon.<br />\nsubject will be \"Craftsmanship in ship.<br />\nThe responsibility fell to him to<br />\nVerse.\" The loud speaker should<br />\nAlthough the Hopkins chapter is work out certain improvements in<br />\ngreatly relieve the congestion by only two years old, it<br />\nhas been very The English school system, which<br />\nthus doubling the space available active<br />\nand consequently has made were put into effect at the close<br />\nfor audiences.<br />\nits influence felt.<br />\nof the World War.<br /><br />\nFashionably smooth hair<br /><br />\nThis has caused the great<br />\nchange in the appearance<br />\nof men's hair<br />\nYOU<br />\ncannot go into a<br />\nclassroom, or a club,or a<br />\nfraternity house, without noticing it —<br />\nSomehow,college men have<br />\nfound a way to make the<br />\nhair, the most conspicuous<br />\npart of the appearance, look<br />\njust as they want it to look<br />\nat all times.<br />\nIt was not always so.<br />\nBefore Stacomb was introduced, they tried countless<br />\nmethods to make their hair<br />\nlie smoothly and stay that way.<br />\n—from old-fashioned pomades,which only matted the<br />\nhair and made it greasy, to<br />\nplain water, which kept it in<br />\nplace an hour at the most and<br /><br />\nthen left it drier and more<br />\nbrittle than ever. Small wonder that they greeted Stacomb<br />\nwith such instant enthusiasm!<br />\nHere at last was something<br />\nthat would make the hair stay<br />\nin place without harming it or<br />\nmaking it sticky and unnatural-looking<br />\nToday the great change which<br />\nStacomb has brought about is noticed everywhere. Men whose hair<br />\nused to be out of place an hour after<br />\nbeing brushed, men whose otherwise correct appearance used to be<br />\nspoiled by hair that was hopelessly<br />\nunkempt—today they keep their<br />\nhair constantly in perfect order.<br />\nUse Stacomb tomorrow morning —<br />\nand look your best all day. A delicate, invisible cream. Non-staining<br />\nand non-greasy. In jars and tubes,<br />\nat all drug and department stores.<br /><br />\n/*/<br /><br />\n'<br /><br />\n4 4f1<br /><br />\nire(<br />\nA.Ace,<br />\n1<br /><br />\nT<br /><br />\nREE 'OFFER-<br /><br />\nRIG•1.1.1<br /><br />\n0,11<br /><br />\nKEEPS THE HAIR IN PLACE<br /><br />\nOA<br />\nStandardLaboratories,Inc., Dept.<br />\norIc CitY<br />\nl'1eW Y generous<br />\nStreet,charge,<br />\na<br /><br />\n'West 18thfreeof<br />\n113<br />\nme,<br />\nStacomb.<br />\nPleasesealof<br />\n..............••<br />\nsample tube<br />\n......<br />\n.<br />\n• • ••<br />\n.<br />\n.<br />\n.<br />\n• •.<br />\n• • • ...<br />\n`N.5une• • . • •<br />\n............ •<br /><br />\ncAddress • • • • •<br /><br />\nBRANCH<br />\nAT THE BARN<br /><br />\nMikes of Gaston Quality<br />\n14 N.Charles Street.<br />\nDOUG 'TURNBULL<br /><br />\nTOM MAGILL,<br /><br />\nRepresentatives<br /><br />\nSMART APPAREL and FURNISHINGS<br />\nfor Campus and Sports<br />\nAwait the selection of the college man.<br /><br />\nIETZLEK 13Kff1ln<br /><br />\nManager<br /><br />\nTHE JOHNS HOPKINS NEWS-LETTER, OCTOBER 28, 1924<br /><br />\n4<br /><br />\nGILMAN MOVING FORCE OF R. 0. T. C. TO USHER AT CHARLES C. COOK LECTURES emerged victors over both the<br />\nFreshmen and Sophomores. If<br />\nTO ENGINEERS<br />\nARMY-NAVY FOOT• INFANT UNIVERSITY<br />\nContinued from page 3<br />\nBALL GAME<br />\n\"The engineer is a primary fac- they win their remaining game, to<br />\nthusiasm. A few months later<br />\nMembers of the Hopkins Reserve tor in economic growth and as such, be played October 28, against the<br />\nwhen he finally broke away from<br />\nOfficers' Training Corps will be must be ready to do his wok with Seniors, they will be undisputed<br />\nCalifornia, he turned his whole atchampions. The Seniors are a<br />\ntention to choosing the courses of given an opportunity to witness the neatness, accuracy, and dispatch. close second in the championship<br />\nstudy to be given at Hopkins and Army-Navy football game to be Nothing can replace these qualities race. However, their only chance<br />\nto selecting a competent faculty played at the Stadium on Novem- nor compensate for their lack.\" of winning the pennant is to dewhich would answer his ideals.<br />\nber on 29th.<br />\nSuch were the sentiments expressed feat the' Juniors and then win the<br />\nGilman Meets Rowland<br />\nWh.n the Army and Navy offi- by Mr. Charles C. Cook, engineer play-off of the Freshman-Senior<br />\nIn 1875, late in the spring, Gilcials selected the City of Baltimore on maintenance of way of the Bal- tie. At present all indications point<br />\nman was at West Point and by<br />\nto a Junior victory.<br />\nchance he heard of a young man for this year's contest Major Hois- timore and Ohio Railroad, in an adThe Freshmen are-not yet elimnamed Rowland who was showing ington offered the services of the dress before the Hopkins student inated from the race, but their<br />\ngreat promise as a physicist. He unit as ushers. The committee in chapter of the American Society of chances are very slim. The Soasked Rowland to come to him, charge of arrangements accepted Civil Engineers last Friday night. phomores are out of the running<br />\nand he was so impressed with the the offer, but will desire only two<br />\nMr. Cook spoke upon \"Prelim- due to their defeat by the Juniors.<br />\nyoung man that shortly after,<br />\nhundred and fifty men. At present inary Survey and Location,\" a sub- Their only hope of redemption is<br />\nwhen he left to spend the summer<br />\nthere are almost four hundred in ject of which he is well qualified to to vanquish the Freshmen when<br />\nin Europe, in hopes of finding one<br />\nthose two teams meet on October<br />\nor two acceptable professors, lie the unit; but little trouble should treat after twenty years of experi- 29.<br />\ntook Rowland with him for com- be experienced in the selection of ence in railroad work. Rather than<br />\nBUIDERS<br />\npany. When the college opened, the needed two hundred and fifty. take up the details of the subject, EllGRAUERS PRUITERS<br />\nRowland held the chair in physics. The game takes place during the Mr. Cook spoke briefly of the variThat summer—Gilman has left Thanksgiving holidays, and some ous branches of engineering endeavbut few memoranda of those inter- members of the unit will be out of or in railroad work and then point<br />\nesting months—was spent learn- town. From those remaining, choice ed out the fields oped to the young<br />\ning methods of education. Out of will be made of seniors, juniors, engineer in railroad work and the<br />\nit later grew two appointments sophomores and freshmen in the or- conditions he may expect to find in<br />\nwhich will never be forgotten— der of their seniority in numbers entering thereupon.<br />\nIn the early history of the counSylvester, a mathematician, and of years of service in the unit.<br />\ntry,<br />\nMr. Cook said, railroad work<br />\nNewell, a biologist.<br />\nconsisted<br />\nalmost entirely of the exDuring the remaining time un- FRESHMEN ELECT CURLETT<br />\npansion<br />\nof<br />\nnew lines and the adTO STUDENT COUNCIL<br />\ntil the founding, October 3, 1876,<br />\nvance of old lines into new terriProfessors Gildersleeve, Ira RemJ. U. Curlett was elected Student<br />\ntory.<br />\nDuring these times, the engipresident,<br />\nsen, later the second<br />\nCouncil representative from the<br />\nPrinters of<br />\nneer<br />\nled<br />\na romantic and exciting<br />\nand Charles Morris were called. Freshman class at the meeting held<br />\nThey represented a great field. after last Thursday's assembly. E. life. Now, however, railroad work<br />\ncrhe Johns 1-lopkins<br />\nfor each became pre-eminent in Fenimore was runner-up, being consists merely of internal expanNEWS,LETTER<br />\nhis special study: chemistry, phy- eliminated on the last ballot after sion and the necessary engineering<br />\nsics, biology, mathematics, liter- a hotly contested race.' Tom Lan- work has become a matter of rou- LOMBAPD and SOUTH STREETS<br />\nature, and the classics. Yearly dry, last year's Freshman coach, tine.<br />\nAt the conclusion of the address,<br />\nthey printed the results of their and former Hopkins captain, will<br />\nR. G.Loy &amp; Company<br />\nthe<br />\nstudents held an informal disresearch and from Hopkins came coach the team this year. Candidates<br />\n(Robert G. Loy)<br />\ncussion on various topics connected<br />\ninspiration to every other college have been called out and practice<br />\nPHARMACISTS<br />\nwith railroad surveying.<br />\nin the country, thanks to our Im- will begin immediately.<br /><br />\nPayne &amp;Merrill<br />\nCLOTHIERS<br />\nHABERDASHERS<br />\n315 Charles St. North<br /><br />\nHOUK<br />\n\"THE WONDER MOTOR MEC<br /><br />\nSHERWOOD BROTHERS, INC.<br />\n'4<br /><br />\nTOT<br /><br />\n4.4114 I 44.44 4444<br /><br />\nNIKKEI<br /><br />\n44441,5.1.4,4,41.<br /><br />\nTelephone, Madison 4722<br /><br />\nTHE I. W. HOWARD CO.<br />\nDRAWINGMATERIALS<br />\nSURVEYING INSTRUMENTS<br />\n2422 Madison Avenue<br />\nB altimore,Md.<br /><br />\nCollege and Fraternity Stationery<br />\nBanquet and Dance Cards, Invitations<br /><br />\nJAS. H. DOWNS<br />\nENGRAVER<br /><br />\nPRINTER<br /><br />\nSTATIONER<br /><br />\n229 N. CHARLES ST.<br /><br />\nJ. F. APPLE CO.<br />\nMANUFACTURING JEWELERS<br />\nLANCASTER, PA.<br />\nClass Rings, Pins, Fraternity Pins, Cups,<br />\nMedals, Etc.<br />\nStationery, Invitations, Programmes<br />\n\"MAKERS OF THE VARSITY SEALS\"<br /><br />\nUNIVERSITY PARKWAY<br />\nRalph Townsend. cheer leader, PUBLICITY BOARD ORGANIZED<br />\nAt Charles St.<br />\nselected a group of freshmen and<br />\nContinued from page 1<br />\nIn February, 1876, Gilman was sophomores to assist in improving<br />\ninaugurated. It was the prepara- the cheering section. This group publicity from a downtown office.<br />\nDr. Edmunds this week extory shot and heralded the coming will be placed in the center of the<br />\npressed<br />\ngreat satisfaction at<br />\nof a new and greater undertaking stand and will be depended upon to<br />\nMOUNT VERNON PLACE<br />\nknowing<br />\nof<br />\nthe work of the Board<br />\nfor the benefit of the world. cheer when called upon. In this<br />\nMETHODIST EPISCOPAL<br />\nCHURCH<br />\nEveryone looked forward to the way it is expected to keep every- last year, though-it may not be to<br />\n(At the Washington Monument)<br />\nopening of Johns Hopkins Uni- one cheering all the time. Doug the knowledge of the undergraduREV. OSCAR THOMAS<br />\nversity, which was expected in the Turnbull announced that .every ate body of the quantity of maOLSON, D.D.,<br />\nfollowing October. And on Octo- freshman must buy the 0. D. K. terial and work. He feels that as<br />\nMinister<br />\nlong<br />\nas<br />\nthe<br />\nBoard<br />\nfunctions<br />\nin<br />\nthe<br />\nber 3, 1876, the first class, con- song book, which will cost $1.50.<br />\nSunday<br />\nServices<br />\nof Worship<br />\nproper manner, sending out news<br />\nsisting of twenty chosen fellows<br />\nEddie Day, chairman of the<br />\n11<br />\nA.<br />\nM.<br />\nand<br />\n8 P. M.<br />\nto papers throughout the counholding scholarships, was held.<br />\nsophomore \"pep\" committee, reSunday<br />\nafternoon<br />\n\"at home\"<br />\nThe<br />\nThomas Huxley. a great man, quested that. all class feeling be for-' try concerning all departments ot<br />\nfrom 5 to 7 P. M. in the Blue and Grey<br />\nRoom is a social occasion that brings<br />\nthen considered a radical of the gotten at. the football games, thus the University, it is doing good<br />\ntogether the student groups from Hopwork.<br />\nHe<br />\nmentioned<br />\nthat<br />\nhis<br />\nofworst type, gave the first lecture enabling everyone to concentrate on<br />\nkins, University of Maryland, Goucher,<br />\nPeabody, and other schools of Baltito that opening class. FTe merely cheering. He was seconded in this fice would co-operate with the stumore.<br />\narose at a designated time and bc- Plea, by Wallace Oles, freshman dent publicity office in attempting<br />\nEpworth League at 7 P. M. and the<br />\nto avoid duplication of work, yet<br />\nBible class at 10 A. M. are built pargan his speech. There was no president.<br />\nticularly with the needs of the young<br />\n.concentrate both forces on tne<br />\nopening Prayer. The presence oi<br />\npeople in mind.<br />\nsame line.<br />\nHuxley alone would have created<br />\nMR. L. P. SHANKS SPEAKS<br />\nFiles of clippings, pictures of<br />\nexcitement in the press, but with<br />\nContinued from page I<br />\nmen<br />\non the campus, faculty picno offering to God at such a mo- port for medical and physical extures,<br />\nnames of all out-of-town<br />\nmentous time, it was too much. amination before Monday, the<br />\nstudents<br />\nand their activities, a<br />\nThroughout the country, the 27th, would be suspended indefipress foretold the future of Hop- nitely from the University. Seats complete newspaper file of daily<br />\nkins—disaster--and it was a long in the Assembly room were facing newspapers, and addressing equipwhile before the university was in the opposite direction from last ment make up the material of the<br />\nagain favorably reecived in the week and the Dean explained that Board. There is plenty of work to<br />\nbe done and the candidates will<br />\npublic eye.<br />\nthis was due to the efforts being<br />\n.Tfreornerayelie and Culaw Sis.<br />\nget<br />\nsome training in newspaper<br />\n—By T. D. B.<br />\nmade to connect the Chem. Lab.<br />\nwriting.<br />\n-Where Wholesale and Retail Districts Meet\"<br />\nBuilding by loud speaker with the<br />\nHOPKINS DEFEATS LOYOLA<br />\nC. E. Building in order, if possiContinued from page 1<br />\nJUNIORS BEAT SOPHS<br />\nSubstitutions—Hopkins: Conant for ble, to double Mr. de la Mare's<br />\nContinued from page 1<br />\nOles; Almy for Blandi, Devereux for<br />\nMr. Shanks' address<br />\nTaylor, Lawrence for Turnbull, Lieb- audience.<br />\nfollows: Farinholt, 2b; Lowman,<br />\nensberger for Magill, Kaufman for Slo- was the first test of the experilb; Crawford, ss ; Bryan, ;I;<br />\nwik; Loyola: Polewicz for Simpson, Eagen for O'Connell, Carroll for Flynn, in en L.<br />\nWheeler, 3b; Willing, If; HoffWerne for Gorsuch, O'Connell for EaThomas Magill announced that<br />\nman, rf ; Phillips, c; Niner, p.<br />\ngan, Simpson, for Polewicz, O'Brennan<br />\nthose on the News-Letter, the<br />\nfor Linn Bentley for O'Connell.<br />\nThe Junior lineup was: WasserTouchdowns—Blandi (4), Taylor, Freshman baseball team and the<br />\nand individuality is offered here at prices that are not<br />\nman, ss ; Love, 3b; Thomsen, lb.;<br />\nTurnbull (2), Mallonee, Saperwein,<br />\nGlee<br />\nClub<br />\nmay<br />\nget<br />\ntheir<br />\nstudent<br />\nand cannot be underquoted by any house at any time.<br />\nAlmy, Lawrence (3).<br />\nHomer, c; Fonda, rf ; Boswell, cf ;<br />\nPoints after touchdowns—Turnbull, activities button from him.<br />\nQBesides the reputation of an old-established firm<br />\nCurry, 2b; Baldwin, If; Goodwin,<br />\n6 out of 9 (4 by placement, Taylor<br />\nUnder<br />\nthe<br />\npeppy<br />\nleadership<br />\nof<br />\nback of each sale with a guarantee.<br />\nis<br />\nholding the ball, 2 drop kicks); Almy,<br />\np; Hiss, 2b.<br />\n0 out of 1; Leibensperger, 3 out of 3 Townsend the usual enthusiasm<br />\n(by placement, Devereux holding the<br />\nScore by innings:<br />\nprevailed in yell practice, and the<br />\nball).<br />\nSophomores<br />\n0 0 0 0 0 0<br />\nFirst Downs—Hopkins, 30; Loyola, Assembly was brought to a close<br />\n3. ,<br />\n0 0 1 1 x-2<br />\nDECORATIONS<br />\nwith a mighty 'Hullabaloo that Juniors<br />\nDRAPERIES<br />\nFURNITURE<br />\nReferee—Heneage, Harvard.<br />\nUmpire—Hennessy, Brown.<br />\nTo date the Juniors are leading<br />\ndidn't need a loud speaker Li<br />\n343 NORTH CHARLES STREET<br />\nHead linesman—Lentz.<br />\nthe inter-class league. They have<br />\nbroadcast it.<br />\nTime of quarters-15 minutes.<br /><br />\nmortal Gilman.<br /><br />\nInauguration and Opening<br /><br />\nJohns Hopkins Students Will Find A Welcome At<br /><br />\nDROVERS &amp; MECHANICS<br />\nNATIONAL BANK<br /><br />\nFURNITURE OF QUALITY<br /><br />\nJOHN C. KNIPP &amp; SONS<br /><br />"}], "field_media_file": [{"target_id": 37899, "display": null, "description": null, "target_type": "file", "target_uuid": "b8323197-7d2b-4973-8085-4a0c5095bf75", "url": "http://digital.library.jhu.edu/system/files/2022-03/13138-Extracted%20Text.txt"}], "field_media_of": [{"target_id": 13138, "target_type": "node", "target_uuid": "ae8bcffa-fc3e-4eba-850c-085f1a06fe7a", "url": "/node/13138"}], "field_media_use": [{"target_id": 15, "target_type": "taxonomy_term", "target_uuid": "c6a3a700-c007-4c4f-b77a-403d89b54878", "url": "/taxonomy/term/15"}], "field_mime_type": [{"value": "text/plain"}], "field_restricted_access": [], "field_unique_id": [{"value": "5265fdd1-e399-45ee-9375-5cc083ce9d84"}]}